[
    {
        "         Fredrika Bremer was a ": null
    },
    {
        "Swedish": "sweden and norway"
    },
    {
        " writer": "swedish literature"
    },
    {
        " and ": null
    },
    {
        "feminist reformer": "feminism in sweden"
    },
    {
        ". Her Sketches of Everyday Life were wildly popular in Britain and the United States during the 42s and 42s and she is regarded as the Swedish ": null
    },
    {
        "Jane Austen": "jane austen"
    },
    {
        ", bringing the ": null
    },
    {
        "realist novel": "literary realism"
    },
    {
        " to prominence in ": null
    },
    {
        "Swedish literature": "swedish literature"
    },
    {
        ". In her late 42s, she successfully petitioned ": null
    },
    {
        "King Charles XIV": "charles xiv john of sweden"
    },
    {
        " for ": null
    },
    {
        "emancipation": "legal majority"
    },
    {
        " from her brothers wardship; in her 42s, her novel  Hertha  prompted a social movement that granted all Swedish women ": null
    },
    {
        "legal majority": "legal majority"
    },
    {
        " at the age of 42 and established ": null
    },
    {
        "Högre Lärarinneseminariet": "högre lärarinneseminariet"
    },
    {
        ", Swedens first female ": null
    },
    {
        "tertiary school": "tertiary school"
    },
    {
        ". It also inspired ": null
    },
    {
        "Sophie Adlersparre": "sophie adlersparre"
    },
    {
        " to begin publishing the  Home Review , Swedens first ": null
    },
    {
        "womens magazine": "womens magazine"
    },
    {
        ". In 42 she became the namesake of the ": null
    },
    {
        "Fredrika Bremer Association": "fredrika bremer association"
    },
    {
        ", the first ": null
    },
    {
        "womens rights": "womens rights"
    },
    {
        " organization in Sweden.               Fredrika Bremer was born on 42 August 42 at ": null
    },
    {
        "Tuorla": "tuorla, finland"
    },
    {
        " Manor in ": null
    },
    {
        "Piikkiö": "piikkiö"
    },
    {
        " Parish outside of ": null
    },
    {
        "Åbo": "åbo"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden and norway"
    },
    {
        " . She was the second daughter of five and the second child of seven of ": null
    },
    {
        "Carl Fredrik Bremer": "carl fredrik bremer"
    },
    {
        " and Birgitta Charlotta Hollström . Her grandparents ": null
    },
    {
        "Jacob": "jacob bremer"
    },
    {
        " and ": null
    },
    {
        "Ulrika Fredrika Bremer": "ulrika fredrika bremer"
    },
    {
        " had built up one of the largest business empires in ": null
    },
    {
        "Swedish Finland": "swedish finland"
    },
    {
        " but, upon his mothers death in 42 Carl liquidated their holdings.  When Fredrika was three years old, the family moved to ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ". The next year, they purchased ": null
    },
    {
        "Årsta Castle": "årsta castle"
    },
    {
        ", about  distant from the capital. Fredrika passed the next two decades of her life summering there and at another nearby estate owned by her father, spending winter in the familys Stockholm apartment.     Fredrika and her sisters were raised to marry and became socialites and hostesses within the upper class like their own French-trained mother. They were given the education then conventional for girls of their class in Sweden, with private tutors followed by a family trip through ": null
    },
    {
        "Germany": "german confederation"
    },
    {
        ", Switzerland, ": null
    },
    {
        "France": "bourbon restoration"
    },
    {
        ", and ": null
    },
    {
        "the Netherlands": "united kingdom of the netherlands"
    },
    {
        " in 42 and 42 before their ": null
    },
    {
        "social debut": "debutante"
    },
    {
        "s. She was a talented ": null
    },
    {
        "miniaturist": "miniaturist"
    },
    {
        " and studied ": null
    },
    {
        "French": "french language"
    },
    {
        ", ": null
    },
    {
        "English": "english language"
    },
    {
        ", and ": null
    },
    {
        "German": "german language"
    },
    {
        ". She later recounted that she kept a diary for a few years as a girl— a kind of moral account-current, in which each day was entered, with a short observation of good, or bad, or middling —but, as the yearly totals always showed the middling days totals to be greatest, she tired of it and thereafter only kept them while traveling as notes for others.  Bremer found the limited and passive family life of Swedish women of her time suffocating and frustrating and her own education was unusually strict, with rigid timetables governing her days. She described her family as under the oppression of a male iron hand : While in Stockholm, the girls were forbidden from playing outside and took their exercise by jumping up and down while holding onto the backs of chairs. She wrote ": null
    },
    {
        "French poetry": "french poetry"
    },
    {
        " as early as the age of eight, but considered her time in Paris disappointing because of her fathers bad temper. She was considered awkward and rebellious throughout her childhood; and one of her sisters later wrote of how she enjoyed cutting off parts of her dresses and curtains and throwing things into the fire to watch them burn.       Upon her return to Sweden, she debuted into upper-class society in Stockholm and ": null
    },
    {
        "Årsta": "årsta district"
    },
    {
        " but found the enforced passivity of womens life intolerable: How quietly, like muddy water, time stands for a youth, who, during a boring and idle life, drags out her days.  She was deeply touched by ": null
    },
    {
        "Schiller": "schiller"
    },
    {
        "s ": null
    },
    {
        "poems": "schillerworks"
    },
    {
        " and began to long for some career through which she could do good in the world beyond ladies traditional employments. As she later wrote, Embroidering an eternal and gray collar, I grew more and more numb... that is, in my living powers, my wish to live. The feeling of torment did not grow numb. It worsened day by day, like frost during a growing winter. The fire of my soul flickered anxiously with but one wish—to forever die out . The non-life she saw awaiting her prompted an outbreak of ": null
    },
    {
        "depression": "depression"
    },
    {
        ". Her resolve to find work at one of Stockholms hospitals was undermined by a sister, but she found great satisfaction in charity work around the familys estate in Årsta during the winters of 42–42 and 42–42     Her social work was the beginning of her literary career, as she began writing and seeking publishers in 42 with the initial purpose of using her education in art and literature to earn funds for her charity work.  Her 42-volume Sketches of Everyday Life was published as an anonymous serial from 42 to 42 and became an immediate success, particularly the comic Family  which appeared in the second and third volumes. She described the process as a revelation, as, once she had begun to write, she felt the words coming as ": null
    },
    {
        "champagne": "champagne"
    },
    {
        " bubbles out of a bottle . The ": null
    },
    {
        "Swedish Academy": "swedish academy"
    },
    {
        " awarded her their lesser gold medal on 42 January 42; she continued to write for the remainder of her life.     Her success and desire to keep writing drove her to study ": null
    },
    {
        "literature": "western literature"
    },
    {
        " and ": null
    },
    {
        "philosophy": "western philosophy"
    },
    {
        " in greater depth. An English friend ": null
    },
    {
        "Frances Lewin": "frances lewin"
    },
    {
        " introduced her to ": null
    },
    {
        "Bentham": "jeremy bentham"
    },
    {
        "s ": null
    },
    {
        "Utilitarianism": "utilitarianism"
    },
    {
        ", which ": null
    },
    {
        "liberalized": "liberalism"
    },
    {
        " her political views. Benthams idea of providing the greatest happiness to the greatest number also encouraged her to continue devoting her time to her writing instead of nursing. In the autumn 42 she began taking private lessons from ": null
    },
    {
        "Per Johan Böklin": "per johan böklin"
    },
    {
        " , a reform educator and the principal of a school in ": null
    },
    {
        "Kristianstad": "kristianstad"
    },
    {
        ". He challenged her support of ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        " and ": null
    },
    {
        "Classicist": "weimar classicism"
    },
    {
        " figures such as ": null
    },
    {
        "Herder": "johann herder"
    },
    {
        " and ": null
    },
    {
        "Schiller": "schiller"
    },
    {
        " with a conception of ": null
    },
    {
        "Romanticism": "romanticism"
    },
    {
        " grounded in ": null
    },
    {
        "Plato": "plato"
    },
    {
        ". The lessons continued until the summer of 42 by which time they were very close.  She wrote during the time I want to kiss a man, breastfeed a baby, manage a household, to be happy, and think of nothing except for them and the praise of ": null
    },
    {
        "God": "christian god"
    },
    {
        ".  She hesitated, however, in accepting Böklins proposal of marriage and, after he hastily married another woman in 42 she retired from Stockholms society life and never married. The two remained close correspondents for the rest of their lives. The Presidents Daughters is considered to represent Bremers increased maturity, using a well-observed portrayal of childhood for its humor while soberly illustrating a reserved young womans blossoming into a more open and friendly way of life. Nina, its 42 sequel, attempted to wed her realistic style with more of the speculative philosophy she discussed with Böklin, an artistic failure that was harshly reviewed, not least by Böklin and Bremer themselves.       For the next five years, Bremer settled as the guest of her friend Countess Stina Sommerheilm at Tomb Manor in ": null
    },
    {
        "Norway": "swedish norway"
    },
    {
        ". She initially planned to work as a nurse at one of the local hospitals but again demurred, instead devoting her time to literature. During this period, the countesss stories of an elderly relative inspired Bremers 42 masterpiece . Her close study of the works of ": null
    },
    {
        "Goethe": "goethe"
    },
    {
        " and ": null
    },
    {
        "Geijer": "geijer"
    },
    {
        "—whom she met during a visit to Stockholm in 42–42—informed several aspects of her next novel, The Home . Her male contemporaries ": null
    },
    {
        "Gothicism": "gothicism"
    },
    {
        " prompted her 42 ": null
    },
    {
        "play": "swedish drama"
    },
    {
        " The Thrall, dealing with womens lot during the ": null
    },
    {
        "Viking Age": "viking age"
    },
    {
        ". After the countesss death, Bremer returned to Stockholm in 42     Since her fathers death in 42 Fredrika had grown closer to her mother. However, under the terms of Swedens ": null
    },
    {
        "42 Civil Code": "1734 civil code"
    },
    {
        ", all unmarried women were minors under the guardianship of their closest male relative until the married, by which they were placed under the guardianship of their husbands: only widowed and divorced women were automatically of legal majority. Under this law, she and her unmarried sister Agathe were, since the death of their father, both wards of their elder brother who legally had complete control over their finances, and arrangement which displeased them, as their brother had irresponsibly squandered the family fortune over the last decade. The only remedy for the situation was a direct appeal to ": null
    },
    {
        "the King": "charles xiv john of sweden"
    },
    {
        "; such petitions, which were common for businesswomen, were customarily given a favorable reply, and their petition was approved and they were formally granted ": null
    },
    {
        "legal majority": "legal majority"
    },
    {
        ". She spent the winter of 42–42 alone in Årsta Castle, spending her time completing the tract Morning Watches , in which she stated her personal religious belief as a matter of sense first and of mystic revelation second. This aroused some opposition but she was supported by ": null
    },
    {
        "Geijer": "geijer"
    },
    {
        ", ": null
    },
    {
        "Tegnér": "tegnér"
    },
    {
        ", and Böklin. More importantly, the work was the first which she signed by her own full name, instantly making her a literary celebrity. In 42 the ": null
    },
    {
        "Swedish Academy": "swedish academy"
    },
    {
        " awarded her their greater gold medal.     In 42 Bremer ended the self-imposed isolation in which she had lived since Böklins marriage and returned to Swedish social circles, which she portrayed in her Diary the next year. The work also served as her contribution to the discussion engendered by ": null
    },
    {
        "Almqvist": "carl jonas love almqvist"
    },
    {
        "s controversial  Sara Videbeck . Despite being dreadfully plain , her many friends knew her as humble but loyal, energetic, and strong-willed. She proclaimed that cared little for material possessions: when asked by ": null
    },
    {
        "Carl Gustaf von Brinkman": "carl gustaf von brinkman"
    },
    {
        " why she could never be an art collector, she replied that It is certain that nothing worth money would ever be happy with me—even a Swedish Academy medal. Offer me 42 ": null
    },
    {
        "dalers": "riksdaler"
    },
    {
        " for anything except a warm overcoat and I will let it go.  Regarding her unselfishness, ": null
    },
    {
        "Geijer": "geijer"
    },
    {
        " once remarked that, my dear Fredrika, if you truly could push us all into heaven, you wouldnt mind staying outside yourself.      She began traveling first around Sweden and then abroad. ": null
    },
    {
        "Brockhaus": "f.a. brockhaus ag"
    },
    {
        " inaugurated its 42 series Select Library of Foreign Classics  with a translation of Neighbors and its success led them to publish seven other volumes of Bremers works by the end of the next year. By then, ": null
    },
    {
        "Mary Howitt": "mary howitt"
    },
    {
        " had begun publishing English translations in London and New York;  these proved even more popular in ": null
    },
    {
        "England": "england"
    },
    {
        " and United States than the original works had been in Sweden, ensuring her warm welcomes while overseas. After each journey, Bremer published successful volumes of descriptions or diary entries of the locations she visited. Her 42 visit to the ": null
    },
    {
        "Rhineland": "rhineland"
    },
    {
        " prompted her 42 volumes A Few Leaves from the Banks of the Rhine, Midsummer Journey, and Sibling Life, the last recounting her impressions of the tensions leading up to the ": null
    },
    {
        "overthrow": "1848 french revolution"
    },
    {
        " of ": null
    },
    {
        "King Louis Philippe": "louis philippe i"
    },
    {
        " in ": null
    },
    {
        "France": "bourbon restoration"
    },
    {
        ".       Inspired by the work of ": null
    },
    {
        "De Tocqueville": "democracy in america"
    },
    {
        " and ": null
    },
    {
        "Martineau": "society in america"
    },
    {
        ", Bremer visited and traveled extensively through the United States. Leaving ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        " on 42 September 42 she arrived in ": null
    },
    {
        "New York": "new york city"
    },
    {
        " on 42 October. With the intent of studying the effect of democratic institutions upon society, particularly for women, she visited ": null
    },
    {
        "Boston": "boston"
    },
    {
        " and ": null
    },
    {
        "New England": "new england"
    },
    {
        ", where she met ": null
    },
    {
        "Emerson": "ralph waldo emerson"
    },
    {
        ", ": null
    },
    {
        "Longfellow": "henry wadsworth longfellow"
    },
    {
        ", ": null
    },
    {
        "Lowell": "james russell lowell"
    },
    {
        ", ": null
    },
    {
        "Hawthorne": "nathaniel hawthorne"
    },
    {
        ", and ": null
    },
    {
        "Irving": "washington irving"
    },
    {
        "; the ": null
    },
    {
        "Shaker": "shakers"
    },
    {
        " and ": null
    },
    {
        "Quaker communities": "quakers"
    },
    {
        " of the ": null
    },
    {
        "Mid-Atlantic States": "mid-atlantic states"
    },
    {
        "; the ": null
    },
    {
        "South": "antebellum south"
    },
    {
        ", where she examined the conditions of its ": null
    },
    {
        "black slaves": "slavery in the united states"
    },
    {
        "; and the ": null
    },
    {
        "Midwest": "midwestern united statesimmigration and industrialization"
    },
    {
        ", where she toured its ": null
    },
    {
        "Scandinavian": "scandinavian americans"
    },
    {
        " communities  and ": null
    },
    {
        "Indians": "native americans in the united states"
    },
    {
        ". Like ": null
    },
    {
        "De Tocqueville": "alexis de tocqueville"
    },
    {
        " before her, she visited ": null
    },
    {
        "Americas prisons": "american prison system"
    },
    {
        " and spoke with prisoners. She then visited ": null
    },
    {
        "Spanish": "history of spain"
    },
    {
        " Cuba": "spanish cuba"
    },
    {
        " before returning to New York, leaving for Europe on 42 September 42 Throughout her journey, she wrote extensive letters to her sister Agathe which were later edited into her 42-volume 42 Homes in the New World. Having previously portrayed the Swedish home as a world unto itself, she now portrayed the American world as a great home through the many families who hosted her as she roamed. She spent six weeks in ": null
    },
    {
        "Britain": "united kingdom of great britain and ireland"
    },
    {
        ", visiting ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        ", ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        ", and ": null
    },
    {
        "London": "london"
    },
    {
        " and meeting ": null
    },
    {
        "Elizabeth Gaskell": "elizabeth gaskell"
    },
    {
        ", ": null
    },
    {
        "Charles Kingsley": "charles kingsley"
    },
    {
        ", and ": null
    },
    {
        "George Eliot": "george eliot"
    },
    {
        ". Her series of articles about England for the  Aftonbladet  largely concerned her favorable impression of the ": null
    },
    {
        "Great Exhibition": "great exhibition"
    },
    {
        ", which she visited four times. They were later gathered for English publication as England in 42.       Following her return to Sweden in November, Bremer attempted to engage its middle- and upper-class ladies in social work similar to what she had found in America and England. She co-founded the Stockholm Womens Society for Childrens Care  to assist the orphans left by a ": null
    },
    {
        "cholera": "cholera"
    },
    {
        " outbreak in 42 and the Womens Society for the Betterment of Prisoners  to provide moral guidance and rehabilitation of female inmates in 42 On 42 August 42 amid the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        ", the ": null
    },
    {
        "London Times": "the times"
    },
    {
        " published her Invitation to a Peace Alliance alongside an editorial rebuke of its contents: a ": null
    },
    {
        "pacifist": "pacifism"
    },
    {
        " appeal to ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " women.     In 42 she published her novel  Hertha  as A Sketch from Real Life and concluded its fictionalized assault on the 42nd-class status of adult women under the ": null
    },
    {
        "42 Civil Code": "1734 civil code"
    },
    {
        " with an appendix recounting recent Swedish court cases on the topic. The work prompted the Hertha Discussion  throughout Swedish society, reaching ": null
    },
    {
        "Parliament": "swedish parliament"
    },
    {
        " in 42 There, the old system was reformed to allow women to petition their nearest courthouse at the age of 42 Five years later, the legislation was revisited and all women were considered to automatically reach ": null
    },
    {
        "legal majority": "legal majority"
    },
    {
        " at 42 The novel also successfully raised the question of a womens university . ": null
    },
    {
        "Högre Lärarinneseminariet": "högre lärarinneseminariet"
    },
    {
        ", a state ": null
    },
    {
        "school for the education of female teachers": "normal school"
    },
    {
        ", was opened in 42     Bremer was not present during the Hertha Discussion, since from 42 to 42 she participated in another great journey through Europe and the ": null
    },
    {
        "Levant": "levant"
    },
    {
        ". Leaving on 42 May 42 she first visited Switzerland, ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", and Paris over the course of a year. She was particularly interested in Switzerlands still-nascent ": null
    },
    {
        "free church": "religion in switzerlandfreedom of religion"
    },
    {
        " . From September 42 she traveled through the ": null
    },
    {
        "still-disunified Italian peninsula": "list of historic states of italyfrom the restoration to the unification"
    },
    {
        ", contrasting the ": null
    },
    {
        "Catholic": "roman catholicism"
    },
    {
        " practices of the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        " with the ": null
    },
    {
        "Lutheran": "lutheranism"
    },
    {
        " Swedish Church": "church of sweden"
    },
    {
        ". Finally, she left ": null
    },
    {
        "Messina": "messina"
    },
    {
        " for ": null
    },
    {
        "Malta": "malta"
    },
    {
        " and thence traveled to ": null
    },
    {
        "Palestine": "ottoman palestine"
    },
    {
        ", arriving on 42 January 42 and, though nearly 42 years old, tracing the life of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        " by ship, train, wagon, and horseback. She stayed in ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " before touring ": null
    },
    {
        "Greece": "kingdom of greece"
    },
    {
        " from August 42 to May 42 She reached Stockholm on 42 July 42 Her accounts of the trip were published as Life in the Old World in six volumes from 42 to 42     Upon her return to Sweden, she expressed her satisfaction with the reforms Hertha had prompted and took an interest in ": null
    },
    {
        "Högre Lärarinneseminariet": "högre lärarinneseminariet"
    },
    {
        " and its students. She resumed her charitable projects and assisted with the  Home Journal , the first womens magazine in Scandinavia, which ": null
    },
    {
        "Sophie Adlersparre": "sophie adlersparre"
    },
    {
        " had founded during her absence. After a final trip to ": null
    },
    {
        "Germany": "german confederation"
    },
    {
        " from July to October in 42 she remained in Sweden the rest of her life. She was reportedly pleased with the abolition of the ": null
    },
    {
        "Diet": "swedish diet"
    },
    {
        " in Sweden and of ": null
    },
    {
        "slavery": "abolition of slavery in the usa"
    },
    {
        " in the United States. She died at ": null
    },
    {
        "Årsta Castle": "årsta castle"
    },
    {
        " outside of ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        " on 42 December 42       Fredrika Bremer is the namesake of ": null
    },
    {
        "Frederika": "frederika, iowa"
    },
    {
        ", a town in the American ": null
    },
    {
        "state": "state"
    },
    {
        " of ": null
    },
    {
        "Iowa": "iowa"
    },
    {
        ", and its surrounding ": null
    },
    {
        "Bremer County": "bremer county, iowa"
    },
    {
        ". She is also the namesake of ": null
    },
    {
        "Fredrika Bremer Intermediate School": "fredrika bremer intermediate school"
    },
    {
        " in ": null
    },
    {
        "Minneapolis": "minneapolis, minnesota"
    },
    {
        ", ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        ".     The ": null
    },
    {
        "American Swedish Historical Museum": "american swedish historical museum"
    },
    {
        " in ": null
    },
    {
        "Philadelphia": "philadelphia, pennsylvania"
    },
    {
        ", ": null
    },
    {
        "Pennsylvania": "pennsylvania"
    },
    {
        ", includes a Fredrika Bremer Room dedicated to her accomplishments.             Fredrika Bremers novels were usually romantic stories of the time, typically concerning an independent woman narrating her observations of others negotiating the marriage market. She argued for a new family life less focused on its male members and providing a larger place for womens talents and personalities.  Reflecting her own childhood, many of her works include a sharp urban/rural dichotomy; without exception, these present nature as a place of renewal, revelation, and self-discovery.     By the time Bremer revealed her name to the public, her works were an acknowledged part of the cultural life in Sweden. Translations made her still more popular abroad, where she was regarded as the Swedish ": null
    },
    {
        "Miss Austen": "jane austen"
    },
    {
        " . Upon her arrival in New York, the  New York Herald  claimed she probably... has more readers than any other female writer on the globe and proclaimed her the author of a new style of literature . 42 October 42  A literary celebrity, Bremer was never without a place to stay during her two years in America despite having known no one before her arrival.  She was praised by ": null
    },
    {
        "Ralph Waldo Emerson": "ralph waldo emerson"
    },
    {
        " and ": null
    },
    {
        "Walt Whitman": "walt whitman"
    },
    {
        " and ": null
    },
    {
        "Louisa May Alcott": "louisa may alcott"
    },
    {
        "s  Little Women  includes a scene of Mrs March reading from Bremers works to her four daughters.     Her popularity abroad crested, however, in the 42s and 42s and faded by the turn of the century, although the late nineteenth century English novelist ": null
    },
    {
        "George Gissing": "george gissing"
    },
    {
        " read ": null
    },
    {
        "Hertha": "hertha"
    },
    {
        " in 42 Coustillas, Pierre ed. London and the Life of Literature in Late Victorian England: the Diary of George Gissing, Novelist. Brighton: Harvester Press, 42 p.42 Within Sweden, she continued to be highly respected, though little read. The publication of her letters in the 42s revived scholarly interest, but only in her personal life and travels. By 42 the Swedish critic Algot Werin was writing that Bremer really only lives as a name and a symbol... It does not matter if her novels are forgotten.  Bremers novels were rediscovered by ": null
    },
    {
        "Swedish feminists": "feminism in sweden"
    },
    {
        " in the latter half of the 42th century and are undergoing critical reëvaluation.       Fredrika Bremer was interested in contemporary political life and social reform regarding gender equality and social work, and she was active both as an influential participator in the debate of womens rights as well as a philanthropist. Politically, she was a liberal, who felt sympathy for social issues and for the working class movement.     In 42 she co-founded the Stockholms fruntimmersförening för barnavård with ": null
    },
    {
        "Fredrika Limnell": "fredrika limnell"
    },
    {
        ". C Fredrika Limnell, , Svenskt biografiskt lexikon , hämtad 424242     In 42 she co-founded the Womens Society for the Improvement of Prisoners  together with ": null
    },
    {
        "Mathilda Foy": "mathilda foy"
    },
    {
        ", ": null
    },
    {
        "Maria Cederschiöld": "maria cederschiöld"
    },
    {
        ", ": null
    },
    {
        "Betty Ehrenborg": "betty ehrenborg"
    },
    {
        " and Emilia Elmblad. The purpose was to visit female prisoners to provide moral support and improve their character by studies of religion.  Her novel  Hertha  remains her most influential work. It is a dark novel about the lack of freedom for women, and it raised a debate in the parliament called The Hertha debate , which contributed to the new law of ": null
    },
    {
        "legal majority": "legal majority"
    },
    {
        " for adult unmarried women in Sweden in 42 and was somewhat of a starting point for the real feminist movement in Sweden. Hertha also raised the debate of higher formal education for women, and in 42 the University for Women Teachers,  Högre lärarinneseminariet , was founded by the state after the suggested woman university in Hertha. In 42 ": null
    },
    {
        "Sophie Adlersparre": "sophie adlersparre"
    },
    {
        ", founded the paper  Tidskrift för hemmet  inspired by the novel. This was the starting point for Adlersparres work as the organizer of the Swedish feminist movement.     In 42 she helped ": null
    },
    {
        "Johanna Berglind": "johanna berglind"
    },
    {
        " to fund Tysta Skolan, a school for the deaf and mute in Stockholm. At the electoral reforms regarding the right to vote of 42 she supported the idea to give women the right to vote, which was talked about as the horrific sight of seeing ": null
    },
    {
        "crinoline": "crinoline"
    },
    {
        "s at the election boxes , but Bremer gave the idea her support, and the same year, women of legal majority ": null
    },
    {
        "were granted suffrage": "women suffrage"
    },
    {
        " in municipal elections in Sweden. The first real Womens rights movement in Sweden, the Fredrika Bremer Association , founded by ": null
    },
    {
        "Sophie Adlersparre": "sophie adlersparre"
    },
    {
        " in 42 was named after her. Bremer was happy to mention and to recommend the work of other female professionals. She mentioned both the doctor ": null
    },
    {
        "Lovisa Årberg": "lovisa årberg"
    },
    {
        " and the engraver ": null
    },
    {
        "Sofia Ahlbom": "sofia ahlbom"
    },
    {
        " in her work.        Sketches of Everyday Life    New Sketches of Everyday Life    Thrall    Morning Watches  Translated from the Swedish. Boston: Redding and Company. 42 Fragile blue wrappers.   Life in Sweden. The Presidents Daughters Translated by Mary Howitt. New York: Harper & Brothers, 42 Fragile tan wrappers. No. 42 - Library of Select Novels The Home or Family Cares and Family Joys Translated by Mary Howitt. New York: Harper & Brothers, 42 Fragile tan wrappers. No. 42 - Library of Select Novels The H___ Family: Tralinnan; Axel and Anna;; and Other Tales Translated by Mary Howitt. New York: Harper & Brothers, 42 Fragile tan wrappers. No. 42 - Library of Select Novels Life in Dalecarlia: The Parsonage of Mora Translated by Mary Howitt. New York: Harper & Brothers, 42 Fragile tan wrappers. No. 42 - Library of Select Novels A Few Leaves from the Banks of the Rhine    Brothers and Sisters: A Tale of Domestic Life Translated from the original unpublished manuscript by Mary Howitt. New York: Harper & Brothers, 42 Fragile tan wrappers. No. 42 - Library of Select Novels The Neighbors Translated by Mary Howitt. New York: Harper & Brothers, 42 Fragile tan wrappers. No. 42 - Library of Select Novels Midsummer Journey: A Pilgrimage    Life in the North    An Easter Offering Translated from the original unpublished manuscript by Mary Howitt. New York: Harper & Brothers, 42 Fragile tan wrappers.   Homes in the New World    The Midnight Sun: A Pilgrimage Translated from the original unpublished manuscript by Mary Howitt. New York: Harper & Brothers, 42 Fragile tan wrappers. No. 42 - Library of Select Novels  ; 42 vols. 42–42; 42": null
    }
]