[
    {
        "      Frederik George Pohl Jr.  was an American ": null
    },
    {
        "science-fiction writer": "Science Fiction Writer"
    },
    {
        ", ": null
    },
    {
        "editor": "Editor"
    },
    {
        ", and ": null
    },
    {
        "fan": "Science Fiction Fandom"
    },
    {
        ", with a career spanning more than 75 years—from his first published work, the 1937 poem Elegy to a Dead Satellite: Luna , to the 2011 novel All the Lives He Led and articles and essays published in 2012.     From about 1959 until 1969, Pohl edited  Galaxy  and its sister magazine  If ; the latter won three successive annual ": null
    },
    {
        "Hugo Awards": "Hugo Award"
    },
    {
        "as the years best professional magazine. His 1977 novel  Gateway  won four years best novel awards: the Hugo voted by convention participants, the Locus voted by magazine subscribers, the Nebula voted by American science-fiction writers, and the juried academic ": null
    },
    {
        "John W. Campbell Memorial Award": "John W. Campbell Memorial Award"
    },
    {
        ". He won the Campbell Memorial Award again for the 1984 collection of novellas Years of the City, one of two repeat winners during the first 40 years. For his 1979 novel Jem, Pohl won a U.S. ": null
    },
    {
        "National Book Award": "National Book Award"
    },
    {
        " in the ": null
    },
    {
        "one-year category Science Fiction": "List Of Winners Of The National Book Awardmiscellaneous 1980 To 1985"
    },
    {
        ".  It was a finalist for three other years best novel awards. He won four Hugo and three Nebula Awards, including receiving both for the 1977 novel  Gateway .     The ": null
    },
    {
        "Science Fiction Writers of America": "Science Fiction Writers Of America"
    },
    {
        " named Pohl its 12th recipient of the ": null
    },
    {
        "Damon Knight Memorial Grand Master Award": "Damon Knight Memorial Grand Master Award"
    },
    {
        " in 1993 and he was inducted by the ": null
    },
    {
        "Science Fiction and Fantasy Hall of Fame": "Emp Museumscience Fiction Hall Of Fame"
    },
    {
        " in 1998, its third class of two dead and two living writers.      Pohl won the ": null
    },
    {
        "Hugo Award for Best Fan Writer": "Hugo Award For Best Fan Writer"
    },
    {
        " in 2010, for his blog, The Way the Future Blogs .               Pohl was the son of Frederik George Pohl and Anna Jane Mason.  Pohl Sr. held various jobs, and the Pohls lived in such wide-flung locations as ": null
    },
    {
        "Texas": "Texas"
    },
    {
        ", ": null
    },
    {
        "California": "California"
    },
    {
        ", ": null
    },
    {
        "New Mexico": "New Mexico"
    },
    {
        ", and the ": null
    },
    {
        "Panama Canal Zone": "Panama Canal Zone"
    },
    {
        ". The family settled in ": null
    },
    {
        "Brooklyn": "Brooklyn"
    },
    {
        " when Pohl was around seven.      He attended ": null
    },
    {
        "Brooklyn Technical High School": "Brooklyn Technical High School"
    },
    {
        ", and dropped out at 17.  In 2009, he was awarded an honorary diploma from Brooklyn Tech.      While a teenager, he co-founded the New York–based ": null
    },
    {
        "Futurians": "Futurians"
    },
    {
        " fan group": "Science Fiction Fandom"
    },
    {
        ", and began lifelong friendships with ": null
    },
    {
        "Donald Wollheim": "Donald Wollheim"
    },
    {
        ", ": null
    },
    {
        "Isaac Asimov": "Isaac Asimov"
    },
    {
        ", and others who would become important writers and editors.   Pohl later said that other friends came and went and were gone, many of the ones I met through fandom were friends all their lives – Isaac, ": null
    },
    {
        "Damon Knight": "Damon Knight"
    },
    {
        ", ": null
    },
    {
        "Cyril Kornbluth": "Cyril Kornbluth"
    },
    {
        ", ": null
    },
    {
        "Dirk Wylie": "Dirk Wylie"
    },
    {
        ", ": null
    },
    {
        "Dick Wilson": "Richard Wilson"
    },
    {
        ". In fact, there are one or two – ": null
    },
    {
        "Jack Robins": "Jack Robins"
    },
    {
        ", ": null
    },
    {
        "Dave Kyle": "David A. Kyle"
    },
    {
        " – whom I still count as friends, seventy-odd years later.... He published a science-fiction fanzine called Mind of Man.      During 1936, Pohl joined the ": null
    },
    {
        "Young Communist League": "Young Communist League"
    },
    {
        " because of its positions for ": null
    },
    {
        "unions": "Labour Unions"
    },
    {
        " and against ": null
    },
    {
        "racial prejudice": "Racial Prejudice"
    },
    {
        ", ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        ", and ": null
    },
    {
        "Benito Mussolini": "Benito Mussolini"
    },
    {
        ". He became president of the local ": null
    },
    {
        "Flatbush": "Flatbush, New York"
    },
    {
        " III Branch of the YCL in Brooklyn. Pohl has said that after the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "Molotov–Ribbentrop Pact"
    },
    {
        " of 1939, the party line changed and he could no longer support it, at which point he left. The Way the Future Was, Frederick Pohl , pp. 93, 113.     Pohl served in the United States Army from April 1943 until November 1945, rising to ": null
    },
    {
        "sergeant": "Sergeant"
    },
    {
        " as an air corps weatherman. After training in Illinois, Oklahoma, and Colorado, he was mainly stationed in Italy with the ": null
    },
    {
        "456th Bombardment Group": "456Th Bombardment Group"
    },
    {
        ".      Pohl was married five times. His first wife, ": null
    },
    {
        "Leslie Perri": "Leslie Perri"
    },
    {
        ", was another Futurian; they were married in August 1940, and divorced in 1944. He then married Dorothy LesTina in Paris in August 1945 while both were serving in the military in Europe; the marriage ended in 1947. During 1948, he married ": null
    },
    {
        "Judith Merril": "Judith Merril"
    },
    {
        "; they had a daughter, Ann. Pohl and Merril divorced in 1952. In 1953, he married Carol M. Ulf Stanton, with whom he had three children and collaborated on several books; they separated in 1977 and were divorced in 1983. From 1984 until his death, Pohl was married to science-fiction expert and academic ": null
    },
    {
        "Elizabeth Anne Hull": "Elizabeth Anne Hull"
    },
    {
        ".     He fathered four children  – Ann , Frederik III , Frederik IV and Kathy.  Grandchildren include Canadian writer ": null
    },
    {
        "Emily Pohl-Weary": "Emily Pohl-Weary"
    },
    {
        " and ": null
    },
    {
        "chef": "Chef"
    },
    {
        " Tobias Pohl-Weary. , The Way the Future Blogs, May 5, 2010: The proprietor and head chef is the talented Tobias Pohl Weary, who has not only been winning awards for his cuisine but is also my grandson, of whom I am really proud.     From 1984 on, he lived in ": null
    },
    {
        "Palatine, Illinois": "Palatine, Illinois"
    },
    {
        ", a suburb of ": null
    },
    {
        "Chicago": "Chicago"
    },
    {
        ". He was previously a longtime resident of ": null
    },
    {
        "Middletown, New Jersey": "Middletown, New Jersey"
    },
    {
        ".               Pohl began writing in the late 1930s, using pseudonyms for most of his early works. His first publication was the poem Elegy to a Dead Satellite: Luna under the name of Elton Andrews, in the October 1937 issue of  Amazing Stories , edited by ": null
    },
    {
        "T. OConor Sloane": "T. Oconor Sloane"
    },
    {
        ".    His first story, the collaboration with C.M. Kornbluth Before the Universe , appeared in 1940 under the pseudonym S.D. Gottesman.       Pohl started a career as a literary agent in 1937, but it was a sideline for him until after World War II, when he began doing it full-time. He ended up representing more than half the successful writers in science fiction , but his agency did not succeed financially, and he closed it down in the early 1950s.     Pohl stopped being Asimovs agent—the only one the latter ever had  —when he became editor from 1939 to 1943 of two ": null
    },
    {
        "pulp magazines": "Pulp Magazines"
    },
    {
        ",  Astonishing Stories  and  Super Science Stories .  Stories by Pohl often appeared in these ": null
    },
    {
        "science-fiction magazines": "Science Fiction Magazine"
    },
    {
        ", but never under his own name. Work written in collaboration with ": null
    },
    {
        "Cyril M. Kornbluth": "Cyril M. Kornbluth"
    },
    {
        " was credited to S.  D. Gottesman or Scott Mariner; other collaborative work was credited to Paul Dennis Lavond. For Pohls solo work, stories were credited to James MacCreigh Works by Gottesman , Lavond , and MacCreigh continued to appear in various science-fiction pulp magazines throughout the 1940s.     In his autobiography, Pohl said that he stopped editing the two magazines at roughly the time of the German invasion of the Soviet Union in 1941.     Pohl co-founded the ": null
    },
    {
        "Hydra Club": "Hydra Club"
    },
    {
        ", a loose collection of science-fiction professionals and fans who met during the late 1940s and 1950s.        From the early 1960s until 1969, Pohl served as editor of  Galaxy Science Fiction  and  Worlds of if  magazines, taking over after the ailing ": null
    },
    {
        "H. L. Gold": "H. L. Gold"
    },
    {
        " could no longer continue working around the end of 1960 . Pohl, Frederik. The Way the Future Was , pp. 221-2 Under his leadership, if won the Hugo Award for Best Professional Magazine for 1966, 1967 and 1968.  Pohl hired ": null
    },
    {
        "Judy-Lynn del Rey": "Judy-Lynn Del Rey"
    },
    {
        " as his assistant editor at Galaxy and if. He also served as editor of  Worlds of Tomorrow  from its first issue in 1963 until it was merged into if in 1967. Ashley, Mike, Transformations: The Story of the Science Fiction Magazines from 1950 to 1970, Liverpool University Press , , p.  207.     In the mid-1970s, Pohl acquired and edited novels for ": null
    },
    {
        "Bantam Books": "Bantam Books"
    },
    {
        ", published as Frederik Pohl Selections ; these included ": null
    },
    {
        "Samuel R. Delanys": "Samuel R. Delany"
    },
    {
        "  Dhalgren  and ": null
    },
    {
        "Joanna Russs": "Joanna Russ"
    },
    {
        "  The Female Man . He also edited a number of science-fiction ": null
    },
    {
        "anthologies": "Anthology"
    },
    {
        ".       After World War II, Pohl worked as an advertising ": null
    },
    {
        "copywriter": "Copywriting"
    },
    {
        " and then as a copywriter and book editor for  Popular Science . Following the war, Pohl began publishing material under his own name, much in collaboration with his fellow Futurian, Cyril Kornbluth.     Though the pen names of Gottesman , Lavond , and MacCreigh were retired by the early 1950s, Pohl still occasionally used pseudonyms, even after he began to publish work under his real name. These occasional pseudonyms, all of which date from the early 1950s to the early 1960s, included Charles Satterfield, Paul Flehr, Ernst Mason, Jordan Park , and Edson McCann .     In the 1970s, Pohl re-emerged as a novel writer in his own right, with books such as  Man Plus  and the  Heechee  series. He won back-to-back Nebula Awards with Man Plus in 1976 and  Gateway , the first Heechee novel, in 1977. In 1978, Gateway swept the other two major novel honors, also winning the ": null
    },
    {
        "Hugo Award for Best Novel": "Hugo Award For Best Novel"
    },
    {
        " and ": null
    },
    {
        "John W. Campbell Memorial Award for the best science-fiction novel": "John W. Campbell Memorial Award For Best Science Fiction Novel"
    },
    {
        ". Two of his stories have also earned him Hugo Awards: The Meeting tied in 1973 and ": null
    },
    {
        "Fermi and Frost": "Fermi And Frost"
    },
    {
        " won in 1986. Another award-winning novel is  Jem  , winner of the ": null
    },
    {
        "National Book Award": "National Book Award"
    },
    {
        ".     His works include not only science fiction, but also articles for  Playboy  and  Family Circle  magazines and nonfiction books. For a time, he was the official authority for  Encyclopædia Britannica  on the subject of ": null
    },
    {
        "Emperor Tiberius": "Tiberius"
    },
    {
        ".      Some of his short stories take a satirical look at ": null
    },
    {
        "consumerism": "Consumerism"
    },
    {
        " and advertising in the 1950s and 1960s: The Wizards of Pungs Corners , where flashy, over-complex military hardware proved useless against farmers with shotguns, and ": null
    },
    {
        "The Tunnel under the World": "The Tunnel Under The World"
    },
    {
        " , where an entire community of seeming-humans is held captive by advertising researchers. .     Pohls Law is either No one is ever ready for anything Pohl, Frederik. Black Star Rising , p. 177. or Nothing is so good that somebody, somewhere will not hate it .      He was a frequent guest on ": null
    },
    {
        "Long John Nebels": "Long John Nebel"
    },
    {
        "radio show from the 1950s to the early 1970s, and an international lecturer. Pohl, Frederik. The Way the Future Was , pp. 238-39, 269-70, 280.     Starting in 1995, when the ": null
    },
    {
        "Theodore Sturgeon Memorial Award": "Theodore Sturgeon Memorial Award"
    },
    {
        " became a juried award, Pohl served first with ": null
    },
    {
        "James Gunn": "James Gunn"
    },
    {
        " and ": null
    },
    {
        "Judith Merril": "Judith Merril"
    },
    {
        ", and since then with several others until retiring in 2013.  Pohl was associated with Gunn since the 1940s, becoming involved in 1975 with what later became Gunns ": null
    },
    {
        "Center for the Study of Science Fiction": "Center For The Study Of Science Fiction"
    },
    {
        " at the University of Kansas. There, he presented many talks, recorded a discussion about The Ideas in Science Fiction in 1973  for the Literature of Science Fiction Lecture Series,  and served the Intensive Institute on Science Fiction and Science Fiction Writing Workshop.      Pohl received the second annual J.  W. Eaton Lifetime Achievement Award in Science Fiction from the ": null
    },
    {
        "University of California, Riverside": "University Of California, Riverside"
    },
    {
        " Libraries at the 2009 ": null
    },
    {
        "Eaton Science Fiction Conference": "Eaton Award"
    },
    {
        ", Extraordinary Voyages: ": null
    },
    {
        "Jules Verne": "Jules Verne"
    },
    {
        " and Beyond .      Pohls work has been an influence on a wide variety of other science fiction writers, some of whom appear in the 2010 anthology,  Gateways: Original New Stories Inspired by Frederik Pohl , edited by Elizabeth Anne Hull.      Pohls last novel, All the Lives He Led, was released on April 12, 2011.      By the time of his death, he was working to finish a second volume of his autobiography The Way the Future Was , along with an expanded version of the latter.        In addition to his solo writings, Pohl was also well known for his collaborations, beginning with his first published story. Before and following the war, Pohl did a series of collaborations with his friend Cyril Kornbluth, including a large number of short stories and several novels, among them  The Space Merchants , a ": null
    },
    {
        "dystopia": "Dystopia"
    },
    {
        "n ": null
    },
    {
        "satire": "Satire"
    },
    {
        " of a world ruled by the advertising agencies. A belated sequel,  The Merchants War  was written by Pohl alone, after Kornbluths death. Pohls  The Merchants of Venus  was an unconnected 1972 novella that includes biting satire on runaway ": null
    },
    {
        "free market": "Free Market"
    },
    {
        " capitalism": "Capitalism"
    },
    {
        " and first introduced the ": null
    },
    {
        "Heechee": "Heechee"
    },
    {
        ".     In the mid-1950s, he began a long-running collaboration with Jack Williamson, eventually resulting in 10 collaborative novels over five decades.     Other collaborations included a novel with Lester Del Rey, Preferred Risk . This novel was solicited for a contest by Galaxy–Simon & Schuster when the judges did not think any of the contest submissions was good enough to win their contest. It was published under the joint pseudonym Edson McCann. Frederick Pohl, The Way the Future Was, Ballantine Books , He also collaborated with ": null
    },
    {
        "Thomas T. Thomas": "Thomas T. Thomas"
    },
    {
        " on a sequel to his award-winning novel Man Plus. He wrote two short stories with Isaac Asimov in the 1940s, both published in 1950. Asimov, Isaac . The Early Asimov Volume 2, Panther Books, pp. 134 and 197-198.      He finished a novel begun by ": null
    },
    {
        "Arthur C. Clarke": "Arthur C. Clarke"
    },
    {
        ",  The Last Theorem , which was published on August 5, 2008.       Pohl went to the hospital in respiratory distress on the morning of September 2, 2013, and died that afternoon     at the age of 93.               ": null
    }
]