[
    {
        "      In ": null
    },
    {
        "economics": "economics"
    },
    {
        ", a free market is a ": null
    },
    {
        "system": "economic system"
    },
    {
        " in which the ": null
    },
    {
        "prices": "price"
    },
    {
        "for ": null
    },
    {
        "goods and services": "goods and services"
    },
    {
        " are self-regulated by the ": null
    },
    {
        "open market": "open market"
    },
    {
        " and by ": null
    },
    {
        "consumer": "consumer"
    },
    {
        "s. In a free market, the laws and forces of ": null
    },
    {
        "supply and demand": "supply and demand"
    },
    {
        " are free from any intervention by a ": null
    },
    {
        "government": "forms of government"
    },
    {
        " or other authority and from all forms of economic privilege, monopolies and artificial scarcities. Proponents of the concept of free market contrast it with a ": null
    },
    {
        "regulated market": "regulated market"
    },
    {
        " in which a government intervenes in supply and demand through various methods such as ": null
    },
    {
        "tariffs": "tariff"
    },
    {
        "used to restrict trade and to protect the local economy. In an idealized ": null
    },
    {
        "free-market economy": "free-market economy"
    },
    {
        ", prices for goods and services are set freely by the forces of supply and demand and are allowed to reach their point of ": null
    },
    {
        "equilibrium": "economic equilibrium"
    },
    {
        " without intervention by government policy.     Scholars contrast the concept of a free market with the concept of a ": null
    },
    {
        "coordinated market": "coordinated market economy"
    },
    {
        " in fields of study such as ": null
    },
    {
        "political economy": "political economy"
    },
    {
        ", ": null
    },
    {
        "new institutional economics": "new institutional economics"
    },
    {
        ", ": null
    },
    {
        "economic sociology": "economic sociology"
    },
    {
        " and ": null
    },
    {
        "political science": "political science"
    },
    {
        ". All of these fields emphasize the importance in currently existing market systems of rule-making institutions external to the simple forces of supply and demand which create space for those forces to operate to control productive output and distribution. Although free markets are commonly associated with ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        " within a ": null
    },
    {
        "market economy": "market economy"
    },
    {
        " in contemporary usage and ": null
    },
    {
        "popular culture": "popular culture"
    },
    {
        ", free markets have also been advocated by ": null
    },
    {
        "anarchists": "free-market anarchism"
    },
    {
        ", ": null
    },
    {
        "socialists": "market socialism"
    },
    {
        " and some proponents of ": null
    },
    {
        "cooperatives": "cooperative"
    },
    {
        "and advocates of ": null
    },
    {
        "profit sharing": "profit sharing"
    },
    {
        ".  Criticism of the theoretical concept may regard systems with significant ": null
    },
    {
        "market power": "market power"
    },
    {
        ", ": null
    },
    {
        "inequality of bargaining power": "inequality of bargaining power"
    },
    {
        ", or ": null
    },
    {
        "information asymmetry": "information asymmetry"
    },
    {
        " as less than free, with regulation being necessary to control those imbalances in order to allow markets to function more efficiently as well as produce more desirable social outcomes.       Laissez-faire economics       The laissez-faire principle expresses a preference for an absence of non-market pressures on prices and wages such as those from discriminatory government ": null
    },
    {
        "tax": "tax"
    },
    {
        "es, ": null
    },
    {
        "subsidies": "subsidy"
    },
    {
        ", ": null
    },
    {
        "tariff": "tariff"
    },
    {
        "s, ": null
    },
    {
        "regulations": "regulation"
    },
    {
        "of purely private behavior, or ": null
    },
    {
        "government-granted": "government-granted monopoly"
    },
    {
        " or ": null
    },
    {
        "coercive monopolies": "coercive monopoly"
    },
    {
        ". In The Pure Theory of Capital, ": null
    },
    {
        "Friedrich Hayek": "friedrich hayek"
    },
    {
        " argued that the goal is the preservation of the unique information contained in the price itself. Hayek, Friedrich . The Pure Theory of Capital.     The definition of free market has been disputed and made complex by collectivist political philosophers and socialist economic ideas.  This contention arose from the divergence from ": null
    },
    {
        "classical economists": "classical economics"
    },
    {
        " such as ": null
    },
    {
        "Richard Cantillon": "richard cantillon"
    },
    {
        ", ": null
    },
    {
        "Adam Smith": "adam smith"
    },
    {
        ", ": null
    },
    {
        "David Ricardo": "david ricardo"
    },
    {
        " and ": null
    },
    {
        "Thomas Robert Malthus": "thomas robert malthus"
    },
    {
        " and from the continental ": null
    },
    {
        "economic science": "economics"
    },
    {
        " developed primarily by the Spanish scholastic and French classical economists, including ": null
    },
    {
        "Anne-Robert-Jacques Turgot, Baron de Laune": "anne-robert-jacques turgot, baron de laune"
    },
    {
        ", ": null
    },
    {
        "Jean-Baptiste Say": "jean-baptiste say"
    },
    {
        " and ": null
    },
    {
        "Frédéric Bastiat": "frédéric bastiat"
    },
    {
        ". During the ": null
    },
    {
        "marginal revolution": "marginal utilitythe marginal revolution"
    },
    {
        ", ": null
    },
    {
        "subjective value theory": "theory of value subjective theory of value"
    },
    {
        " was rediscovered.      Although laissez-faire has been commonly associated with ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        ", there is a similar economic theory associated with ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " called ": null
    },
    {
        "left-wing or socialist laissez-faire": "laissez-fairelaissez-faire socialism"
    },
    {
        ", or ": null
    },
    {
        "free-market anarchism": "free-market anarchism"
    },
    {
        ", also known as ": null
    },
    {
        "free-market anti-capitalism": "left-wing market anarchism"
    },
    {
        " and ": null
    },
    {
        "free-market socialism": "market socialism"
    },
    {
        " to distinguish it from laissez-faire capitalism. Chartier, Gary; Johnson, Charles W. . Markets Not Capitalism: Individualist Anarchism Against Bosses, Inequality, Corporate Power, and Structural Poverty. Brooklyn, NY:Minor Compositions/Autonomedia It introduces an eye-opening approach to radical social thought, rooted equally in libertarian socialism and market anarchism. Chartier, Gary; Johnson, Charles W. . Markets Not Capitalism: Individualist Anarchism Against Bosses, Inequality, Corporate Power, and Structural Poverty. Brooklyn, NY: Minor Compositions/Autonomedia. p. back cover. But there has always been a market-oriented strand of libertarian socialism that emphasizes voluntary cooperation between producers. And markets, properly understood, have always been about cooperation. As a commenter at Reason magazines Hit & Run blog, remarking on ": null
    },
    {
        "Jesse Walkers": "jesse walker"
    },
    {
        "link to the Kelly article, put it: every trade is a cooperative act. In fact, its a fairly common observation among market anarchists that genuinely free markets have the most legitimate claim to the label socialism.  by ": null
    },
    {
        "Kevin Carson": "kevin carson"
    },
    {
        " at website of Center for a Stateless Society. Critics of laissez-faire as commonly understood argue that a truly laissez-faire system would be ": null
    },
    {
        "anti-capitalist": "anti-capitalist"
    },
    {
        " and ": null
    },
    {
        "socialist": "libertarian socialism"
    },
    {
        ". Nick Manley, . Nick Manley, .             Various forms of ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " based on free markets have existed since the 19th century. Early notable socialist proponents of free markets include ": null
    },
    {
        "Pierre-Joseph Proudhon": "pierre-joseph proudhon"
    },
    {
        ", ": null
    },
    {
        "Benjamin Tucker": "benjamin tucker"
    },
    {
        " and the ": null
    },
    {
        "Ricardian socialist": "ricardian socialist"
    },
    {
        "s. These economists believed that genuinely free markets and ": null
    },
    {
        "voluntary exchange": "voluntary exchange"
    },
    {
        " could not exist within the ": null
    },
    {
        "exploitative": "exploitation"
    },
    {
        " conditions of ": null
    },
    {
        "capitalism": "capitalist mode of production"
    },
    {
        ". These proposals ranged from various forms of ": null
    },
    {
        "worker cooperatives": "worker cooperative"
    },
    {
        "operating in a free-market economy such as the ": null
    },
    {
        "mutualist": "mutualism"
    },
    {
        " system proposed by Proudhon, to state-owned enterprises operating in unregulated and open markets. These models of socialism are not to be confused with other forms of market socialism  where publicly owned enterprises are coordinated by various degrees of ": null
    },
    {
        "economic planning": "economic planning"
    },
    {
        ", or where capital good prices are determined through marginal cost pricing.     Advocates of free-market socialism such as ": null
    },
    {
        "Jaroslav Vanek": "jaroslav vanek"
    },
    {
        " argue that genuinely free markets are not possible under conditions of private ownership of productive property. Instead, he contends that the class differences and inequalities in income and power that result from private ownership enable the interests of the dominant class to skew the market to their favor, either in the form of monopoly and market power, or by utilizing their wealth and resources to legislate government policies that benefit their specific business interests. . Interview by Albert Perkins. Retrieved March 17, 2011. Additionally, Vanek states that workers in a socialist economy based on cooperative and self-managed enterprises have stronger incentives to maximize productivity because they would receive a share of the profits in addition to receiving their fixed wage or salary.     Socialists also assert that free-market capitalism leads to an excessively skewed distribution of income which in turn leads to social instability. As a result, corrective measures in the form of ": null
    },
    {
        "social welfare": "social welfare"
    },
    {
        ", re-distributive taxation and administrative costs are required, but they end up being paid into workers hands who spend and help the economy to run. They claim corporate monopolies run rampant in free markets, with endless agency over the consumer. Thus, free-market socialism desires government regulation of markets to prevent social instability, although at the cost of taxpayer dollars. The Political Economy of Socialism, by Horvat, Branko , pp. 197–98.          For classical economists such as ": null
    },
    {
        "Adam Smith": "adam smith"
    },
    {
        ", the term free market does not necessarily refer to a market free from government interference, but rather free from all forms of economic privilege, monopolies and artificial scarcities. This implies that ": null
    },
    {
        "economic rent": "economic rent"
    },
    {
        "s, i.e. profits generated from a lack of ": null
    },
    {
        "perfect competition": "perfect competition"
    },
    {
        ", must be reduced or eliminated as much as possible through free competition.     Economic theory suggests the returns to ": null
    },
    {
        "land": "land"
    },
    {
        " and other ": null
    },
    {
        "natural resources": "natural resource"
    },
    {
        "are economic rents that cannot be reduced in such a way because of their perfect inelastic supply. ": null
    },
    {
        "Adam Smith": "adam smith"
    },
    {
        ",  The Wealth of Nations  ": null
    },
    {
        "Book V, Chapter 2": "s:the wealth of nations/book v/chapter 2"
    },
    {
        ", Part 2, Article I: Taxes upon the Rent of Houses. Some economic thinkers emphasize the need to share those rents as an essential requirement for a well functioning market. It is suggested this would both eliminate the need for regular taxes that have a negative effect on trade  as well as release land and resources that are speculated upon or monopolised. Two features that improve the competition and free market mechanisms. ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        " supported this view by the following statement: Land is the mother of all monopoly . House Of Commons May 4th; Kings Theatre, Edinburgh, July 17 The American economist and social philosopher ": null
    },
    {
        "Henry George": "henry george"
    },
    {
        ", the most famous proponent of this thesis, wanted to accomplish this through a high ": null
    },
    {
        "land value tax": "land value tax"
    },
    {
        " that replaces all other taxes. Backhaus, Henry Georges Ingenious Tax, pp. 453–58. Followers of his ideas are often called ": null
    },
    {
        "Georgists": "georgism"
    },
    {
        " or geoists and ": null
    },
    {
        "geolibertarians": "geolibertarianism"
    },
    {
        ".     ": null
    },
    {
        "Léon Walras": "léon walras"
    },
    {
        ", one of the founders of the ": null
    },
    {
        "neoclassical economics": "neoclassical economics"
    },
    {
        " who helped formulate the ": null
    },
    {
        "general equilibrium theory": "general equilibrium theory"
    },
    {
        ", had a very similar view. He argued that free competition could only be realized under conditions of state ownership of natural resources and land. Additionally, income taxes could be eliminated because the state would receive income to finance public services through owning such resources and enterprises.      laissez-faire capitalist systems ": null
    },
    {
        "employee-owned companies": "employee stock ownership plan"
    },
    {
        " were the norm as envisioned by various thinkers including ": null
    },
    {
        "Louis O. Kelso": "louis o. kelso"
    },
    {
        " and ": null
    },
    {
        "James S. Albus": "james s. albus"
    },
    {
        ".         Conditions that must exist for unregulated markets to behave as free markets are summarized at ": null
    },
    {
        "perfect competition": "perfect competition"
    },
    {
        ". An absence of any of these perfect competition ideal conditions is a ": null
    },
    {
        "market failure": "market failure"
    },
    {
        ". Most schools of economics allow that regulatory intervention may provide a substitute force to counter a market failure. Under this thinking, this form of market regulation may be better than an unregulated market at providing a free market.          Demand for an item refers to the economic market pressure from people trying to buy it. Buyers have a maximum price they are willing to pay and sellers have a minimum price they are willing to offer their product. The point at which the supply and demand curves meet is the equilibrium price of the good and quantity demanded. Sellers willing to offer their goods at a lower price than the equilibrium price receive the difference as ": null
    },
    {
        "producer surplus": "producer surplus"
    },
    {
        ". Buyers willing to pay for goods at a higher price than the equilibrium price receive the difference as ": null
    },
    {
        "consumer surplus": "consumer surplus"
    },
    {
        ".      The model is commonly applied to wages in the market for labor. The typical roles of supplier and consumer are reversed. The suppliers are individuals, who try to sell their labor for the highest price. The consumers are businesses, which try to buy the type of labor they need at the lowest price. As more people offer their labor in that market, the equilibrium wage decreases and the equilibrium level of employment increases as the supply curve shifts to the right. The opposite happens if fewer people offer their wages in the market as the supply curve shifts to the left.     In a free market, individuals and firms taking part in these transactions have the liberty to enter, leave and participate in the market as they so choose. Prices and quantities are allowed to adjust according to economic conditions in order to reach equilibrium and properly allocate resources. However, in many countries around the world governments seek to intervene in the free market in order to achieve certain social or political agendas.  Governments may attempt to create ": null
    },
    {
        "social equality": "social equality"
    },
    {
        " or ": null
    },
    {
        "equality of outcome": "equality of outcome"
    },
    {
        " by intervening in the market through actions such as imposing a ": null
    },
    {
        "minimum wage": "minimum wage"
    },
    {
        " or erecting ": null
    },
    {
        "price controls": "price controls"
    },
    {
        " . Other lesser-known goals are also pursued, such as in the United States, where the federal government subsidizes owners of fertile land to not grow crops in order to prevent the supply curve from further shifting to the right and decreasing the equilibrium price. This is done under the justification of maintaining farmers profits; due to the relative ": null
    },
    {
        "inelasticity": "elasticity"
    },
    {
        " of demand for crops, increased supply would lower the price but not significantly increase quantity demanded, thus placing pressure on farmers to exit the market.  Those interventions are often done in the name of maintaining basic assumptions of free markets such as the idea that the costs of production must be included in the price of goods. Pollution and depletion costs are sometimes not included in the cost of production , therefore governments may opt to impose regulations in an attempt to try to internalize all of the cost of production and ultimately include them in the price of the goods.     Advocates of the free market contend that government intervention hampers economic growth by disrupting the natural allocation of resources according to supply and demand while critics of the free market contend that government intervention is sometimes necessary to protect a countrys economy from better-developed and more influential economies, while providing the stability necessary for wise long-term investment. ": null
    },
    {
        "Milton Friedman": "milton friedman"
    },
    {
        " pointed to failures of ": null
    },
    {
        "central planning": "central planning"
    },
    {
        ", ": null
    },
    {
        "price controls": "price controls"
    },
    {
        " and ": null
    },
    {
        "state-owned corporations": "government-owned corporation"
    },
    {
        ", particularly in the ": null
    },
    {
        "Soviet Union": "economy of the soviet union"
    },
    {
        " and ": null
    },
    {
        "China": "economy of china"
    },
    {
        "  while ": null
    },
    {
        "Ha-Joon Chang": "ha-joon chang"
    },
    {
        " cites the examples of post-war Japan and the growth of South Koreas steel industry. ": null
    },
    {
        "Bad Samaritans: The Myth of Free Trade and the Secret History of Capitalism": "bad samaritans: the myth of free trade and the secret history of capitalism"
    },
    {
        " , Ha-Joon Chang, Bloomsbury Press,              With varying degrees of mathematical rigor over time, the ": null
    },
    {
        "general equilibrium theory": "general equilibrium theory"
    },
    {
        " has demonstrated that under certain conditions of ": null
    },
    {
        "competition": "perfect competition"
    },
    {
        " the law of ": null
    },
    {
        "supply and demand": "supply and demand"
    },
    {
        " predominates in this ideal free and competitive market, influencing prices toward an ": null
    },
    {
        "equilibrium": "economic equilibrium"
    },
    {
        " that balances the demands for the products against the supplies. Theory of Value by ": null
    },
    {
        "Gérard Debreu": "gérard debreu"
    },
    {
        ". At these equilibrium prices, the market distributes the products to the purchasers according to each purchasers preference or ": null
    },
    {
        "utility": "utility"
    },
    {
        " for each product and within the relative limits of each buyers ": null
    },
    {
        "purchasing power": "purchasing power"
    },
    {
        ". This result is described as market efficiency, or more specifically a ": null
    },
    {
        "Pareto optimum": "pareto optimum"
    },
    {
        ".     This equilibrating behavior of free markets requires certain assumptions about their agents—collectively known as ": null
    },
    {
        "perfect competition": "perfect competition"
    },
    {
        "—which therefore cannot be results of the market that they create. Among these assumptions are several which are impossible to fully achieve in a real market, such as complete information, interchangeable goods and services and lack of market power. The question then is what approximations of these conditions guarantee approximations of market efficiency and which failures in competition generate overall market failures. Several ": null
    },
    {
        "Nobel Prizes in Economics": "nobel memorial prize in economic sciences"
    },
    {
        " have been awarded for analyses of market failures due to ": null
    },
    {
        "asymmetric information": "asymmetric information"
    },
    {
        ".          A free market does not require the existence of competition, however it does require a framework that allows new market entrants. Hence, in the lack of coercive barriers, for example, paid licensing certification for certain services and businesses, competition between businesses flourishes all through the demands of consumers, or buyers. It often suggests the presence of the ": null
    },
    {
        "profit motive": "profit motive"
    },
    {
        ", although neither a profit motive or profit itself are necessary for a free market. All modern free markets are understood to include ": null
    },
    {
        "entrepreneur": "entrepreneur"
    },
    {
        "s, both individuals and ": null
    },
    {
        "business": "business"
    },
    {
        "es. Typically, a modern free-market economy would include other features such as a ": null
    },
    {
        "stock exchange": "stock exchange"
    },
    {
        " and a ": null
    },
    {
        "financial services": "financial services"
    },
    {
        " sector, but they do not define it.             ": null
    },
    {
        "Friedrich Hayek": "friedrich hayek"
    },
    {
        " popularized the view that market economies promote ": null
    },
    {
        "spontaneous order": "spontaneous order"
    },
    {
        " which results in a better allocation of societal resources than any design could achieve . Hayek cited. Petsoulas, Christina. Hayeks Liberalism and Its Origins: His Idea of Spontaneous Order and the Scottish Enlightenment. Routledge. 2001. p. 2. According to this view, market economies are characterized by the formation of complex transactional networks which produce and distribute goods and services throughout the economy. These networks are not designed, but they nevertheless emerge as a result of decentralized individual economic decisions. The idea of spontaneous order is an elaboration on the ": null
    },
    {
        "invisible hand": "invisible hand"
    },
    {
        " proposed by ": null
    },
    {
        "Adam Smith": "adam smith"
    },
    {
        " in  The Wealth of Nations . About the individual, Smith wrote:   By preferring the support of domestic to that of foreign industry, he intends only his own security; and by directing that industry in such a manner as its produce may be of the greatest value, he intends only his own gain, and he is in this, as in many other cases, led by an invisible hand to promote an end which was no part of his intention. Nor is it always the worse for society that it was no part of it. By pursuing his own interest, he frequently promotes that of the society more effectually than when he really intends to promote it. I have never known much good done by those who affected to trade for the public good. Smith, Adam . The Wealth of Naton. Book IV. . Worstall, Tim. . Forbes. April 25, 2014. Retrieved March 20, 2019.     Smith pointed out that one does not get ones dinner by appealing to the brother-love of the butcher, the farmer or the baker. Rather, one appeals to their self-interest and pays them for their labor, arguing:   It is not from the benevolence of the butcher, the brewer or the baker, that we expect our dinner, but from their regard to their own self-interest. We address ourselves, not to their humanity but to their self-love, and never talk to them of our own necessities but of their advantages.      Supporters of this view claim that spontaneous order is superior to any order that does not allow individuals to make their own choices of what to produce, what to buy, what to sell and at what prices due to the number and complexity of the factors involved. They further believe that any attempt to implement central planning will result in more disorder, or a less efficient production and distribution of goods and services.     Critics such as political economist ": null
    },
    {
        "Karl Polanyi": "karl polanyi"
    },
    {
        " question whether a spontaneously ordered market can exist, completely free of distortions of political policy, claiming that even the ostensibly freest markets require a state to exercise coercive power in some areas, namely to enforce ": null
    },
    {
        "contract": "contract"
    },
    {
        "s, govern the formation of ": null
    },
    {
        "labor union": "labor union"
    },
    {
        "s, spell out the rights and obligations of ": null
    },
    {
        "corporation": "corporation"
    },
    {
        "s, shape who has standing to bring legal actions and define what constitutes an unacceptable ": null
    },
    {
        "conflict of interest": "conflict of interest"
    },
    {
        ". ": null
    },
    {
        "Hacker, Jacob S.": "jacob s. hacker"
    },
    {
        "; ": null
    },
    {
        "Pierson, Paul": "paul pierson"
    },
    {
        " . Winner-Take-All Politics: How Washington Made the Rich Richer – and Turned Its Back on the Middle Class. Simon & Schuster. p. 55.                ": null
    },
    {
        "The Heritage Foundation": "the heritage foundation"
    },
    {
        ", a ": null
    },
    {
        "conservative": "conservatism in the united states"
    },
    {
        " and ": null
    },
    {
        "right-wing": "right-wing politics"
    },
    {
        " think tank": "think tank"
    },
    {
        " based in Washington, D.C. that defines ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        " as the free market which is free from ": null
    },
    {
        "state intervention": "economic interventionism"
    },
    {
        " and ": null
    },
    {
        "government regulation": "government regulation"
    },
    {
        ", tried to identify the key factors necessary to measure the degree of freedom of economy of a particular country. In 1986, they introduced the ": null
    },
    {
        "Index of Economic Freedom": "index of economic freedom"
    },
    {
        " which is based on some fifty variables. While this and other similar indices do not necessarily define a free market, The Heritage Foundation measures the degree to which a modern economy is free. The variables are divided into the following major groups:   Trade policy   ": null
    },
    {
        "Fiscal burden of government": "fiscal burden of government"
    },
    {
        "  International free trade improved the country and in order for Americans to prosper from a strong economy they had no choice but to embrace it.  Each group is assigned a numerical value between 1 and 5 as the index is the arithmetical mean of the values, rounded to the nearest hundredth. Initially, countries which were traditionally considered capitalistic received high ratings, but the method improved over time. Some economists such as ": null
    },
    {
        "Milton Friedman": "milton friedman"
    },
    {
        " and other  laissez-faire  economists have argued that there is a direct relationship between economic growth and economic freedom and some studies suggest this is true.   Journal of Developing Areas, Vol. 32, No. 3, Spring 1998, pp. 327–38. Publisher: Western Illinois University. Ongoing debates exist among scholars regarding methodological issues in empirical studies of the connection between economic freedom and economic growth. These debates and studies continue to explore just what that relationship entails.  Econ Journal Watch, Volume 4, Number 1, January 2007, pp. 71–78.  Econ Journal Watch, Volume 3, Number 3, September 2006, pp. 407–411.  Econ Journal Watch, Volume 4, Number 1, January 2007, pp. 79–82.     The Free Market Monument Foundation defines the principles of a free market as such:  . Free Market Monument Foundation.   Individual rights: We are each created with equal individual rights to control and to defend our life, liberty and property and to voluntary contractual exchange.   Limited government: Governments are instituted only to secure individual rights, deriving their just powers from the ": null
    },
    {
        "consent of the governed": "consent of the governed"
    },
    {
        ".   Equal justice under law: Government must treat everyone equally; neither rewarding failure nor punishing success.   Subsidiarity: Government authority must reside at the lowest feasible level.   Spontaneous order: When individual rights are respected, unregulated competition will maximize economic benefit for society by providing the most goods and services possible at the lowest cost.   Property rights: Private ownership is the most efficient way to sustainably utilize resources.   Golden rule: Deal with others honestly and require honesty in return.          Critics of the free market have argued that in real world situations it has proven to be susceptible to the development of ": null
    },
    {
        "price fixing": "price fixing"
    },
    {
        " monopolies.  Such reasoning has led to government intervention, e.g. the ": null
    },
    {
        "United States antitrust law": "united states antitrust law"
    },
    {
        ".     Two prominent Canadian authors argue that government at times has to intervene to ensure competition in large and important industries. ": null
    },
    {
        "Naomi Klein": "naomi klein"
    },
    {
        " illustrates this roughly in her work  The Shock Doctrine  and ": null
    },
    {
        "John Ralston Saul": "john ralston saul"
    },
    {
        " more humorously illustrates this through various examples in The Collapse of Globalism and the Reinvention of the World. Saul, John The End of Globalism. While its supporters argue that only a free market can create healthy competition and therefore more business and reasonable prices, opponents say that a free market in its purest form may result in the opposite. According to Klein and Ralston, the merging of companies into giant corporations or the privatization of government-run industry and national assets often result in monopolies or oligopolies requiring government intervention to ": null
    },
    {
        "force competition": "competition law"
    },
    {
        " and reasonable prices. Another form of market failure is ": null
    },
    {
        "speculation": "speculation"
    },
    {
        ", where transactions are made to profit from short term fluctuation, rather from the ": null
    },
    {
        "intrinsic value": "intrinsic value"
    },
    {
        " of the companies or products. This criticism has been challenged by historians such as ": null
    },
    {
        "Lawrence Reed": "lawrence reed"
    },
    {
        ", who argued that monopolies have historically failed to form even in the absence of antitrust law. ,  The Freeman , January 23, 2015. Retrieved December 20, 2016. This is because monopolies are inherently difficult to maintain as a company that tries to maintain its monopoly by buying out new competitors, for instance, is incentivizing newcomers to enter the market in hope of a buy-out.     American philosopher and author ": null
    },
    {
        "Cornel West": "cornel west"
    },
    {
        " has derisively termed what he perceives as ": null
    },
    {
        "dogma": "dogma"
    },
    {
        "tic arguments for  laissez-faire  economic policies as ": null
    },
    {
        "free-market fundamentalism": "free-market fundamentalism"
    },
    {
        ". West has contended that such mentality trivializes the concern for public interest and makes money-driven, poll-obsessed elected officials deferential to corporate goals of profit – often at the cost of the common good . ,  The Globalist , January 24, 2005. Retrieved October 9, 2014. American political philosopher ": null
    },
    {
        "Michael J. Sandel": "michael j. sandel"
    },
    {
        " contends that in the last thirty years the United States has moved beyond just having a market economy and has become a market society where literally everything is for sale, including aspects of social and civic life such as education, access to justice and political influence. ": null
    },
    {
        "Michael J. Sandel": "michael j. sandel"
    },
    {
        " . . ": null
    },
    {
        "TED": "ted"
    },
    {
        ". Retrieved January 11, 2015. The economic historian ": null
    },
    {
        "Karl Polanyi": "karl polanyi"
    },
    {
        " was highly critical of the idea of the market-based society in his book  The Great Transformation , noting that any attempt at its creation would undermine human society and the common good. Henry Farrell . .  The Washington Post . Retrieved January 11, 2015.     Critics of free market economics range from those who reject markets entirely in favour of a ": null
    },
    {
        "planned economy": "planned economy"
    },
    {
        " as advocated by various ": null
    },
    {
        "Marxists": "marxism"
    },
    {
        " to those who wish to see market failures regulated to various degrees or supplemented by government interventions. ": null
    },
    {
        "Keynesians": "keynesian economics"
    },
    {
        " support market roles for government such as using fiscal policy for economic stimulus when actions in the private sector lead to sub-optimal economic outcomes of ": null
    },
    {
        "depressions": "depression"
    },
    {
        " or ": null
    },
    {
        "recession": "recession"
    },
    {
        "s. ": null
    },
    {
        "Business cycle": "business cycle"
    },
    {
        " is used by Keynesians to explain ": null
    },
    {
        "liquidity trap": "liquidity trap"
    },
    {
        "s, by which underconsumption occurs, to argue for government intervention with fiscal policy. ": null
    },
    {
        "David McNally": "david mcnally"
    },
    {
        " of the University of Houston argues in the Marxist tradition that the logic of the market inherently produces inequitable outcomes and leads to unequal exchanges, arguing that ": null
    },
    {
        "Adam Smiths": "adam smith"
    },
    {
        "moral intent and moral philosophy espousing equal exchange was undermined by the practice of the free market he championed. According to McNally, the development of the ": null
    },
    {
        "market economy": "market economy"
    },
    {
        " involved coercion, exploitation and violence that Smiths moral philosophy could not countenance. McNally also criticizes market socialists for believing in the possibility of fair markets based on equal exchanges to be achieved by purging parasitical elements from the market economy such as ": null
    },
    {
        "private ownership": "private ownership"
    },
    {
        " of the ": null
    },
    {
        "means of production": "means of production"
    },
    {
        ", arguing that ": null
    },
    {
        "market socialism": "market socialism"
    },
    {
        " is an oxymoron when ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " is defined as an end to ": null
    },
    {
        "wage labour": "wage labour"
    },
    {
        ".      Some would argue that only one known example of a true free market exists, namely the ": null
    },
    {
        "black market": "black market"
    },
    {
        ". The black market is under constant threat by the ": null
    },
    {
        "police": "police"
    },
    {
        ", but under no circumstances do the police regulate the substances that are being created. The black market produces wholly unregulated goods and are purchased and consumed unregulated. That is to say, anyone can produce anything at any time and anyone can purchase anything available at any time. The alternative view is that the black market is not a free market at all since high prices and ": null
    },
    {
        "natural monopolies": "natural monopolies"
    },
    {
        " are often enforced through murder, theft and destruction. Black markets can only exist peripheral to regulated markets where laws are being regularly enforced.": null
    }
]