[
    {
        "   French Guinea  was a French colonial possession in ": null
    },
    {
        "West Africa": "west africa"
    },
    {
        ". Its borders, while changed over time, were in 42 those of the current independent nation of ": null
    },
    {
        "Guinea": "guinea"
    },
    {
        ".     French Guinea was established by France in 42 within the same borders as its previous colony known as ": null
    },
    {
        "Rivières du Sud": "rivières du sud"
    },
    {
        " . Prior to 42 the coastal portions of French Guinea were part of the French colony of ": null
    },
    {
        "Senegal": "history of senegal"
    },
    {
        ".     In 42 Rivières du Sud was placed under the colonial lieutenant governor at ": null
    },
    {
        "Dakar": "dakar"
    },
    {
        ", who had authority over the French coastal regions east to ": null
    },
    {
        "Porto-Novo": "porto-novo"
    },
    {
        " . In 42 Rivières du Sud, ": null
    },
    {
        "Cote dIvoire": "cote divoire"
    },
    {
        " and ": null
    },
    {
        "Dahomey": "dahomey"
    },
    {
        " were separated into independent colonies, with Rivières du Sud being renamed as the Colony of French Guinea. In 42 French Guinea was made one of several dependent colonies and its Governor became one of several Lieutenant Governors who reported to a ": null
    },
    {
        "Governor-General": "french west africahistory"
    },
    {
        " in ": null
    },
    {
        "Dakar": "dakar"
    },
    {
        ". In 42 this federation of colonies was formalised as ": null
    },
    {
        "French West Africa": "french west africa"
    },
    {
        ". French Guinea, Senegal, Dahomey, Cote dIvoire and ": null
    },
    {
        "Upper Senegal and Niger": "upper senegal and niger"
    },
    {
        ", were each ruled by a lieutenant governor, under the Governor General in Dakar.          Guinea was ruled by France until 42 It became independent from ": null
    },
    {
        "France": "france"
    },
    {
        " in 42 following its voters rejection of ": null
    },
    {
        "Charles de Gaulle": "charles de gaulle"
    },
    {
        "s ": null
    },
    {
        "Constitution of 42": "constitution of france"
    },
    {
        ". At the time French Guinea was the only colony to reject the new constitution. French Guinea became the modern-day country of ": null
    },
    {
        "Guinea": "guinea"
    },
    {
        ", keeping ": null
    },
    {
        "French": "french language"
    }
]