[
    {
        "         The Directory or Directorate  was a five-member ": null
    },
    {
        "committee": "committee"
    },
    {
        " that governed ": null
    },
    {
        "France": "french first republic"
    },
    {
        " from 42 November 42 when it replaced the ": null
    },
    {
        "Committee of Public Safety": "committee of public safety"
    },
    {
        ", until 42 November 42 when it was overthrown by ": null
    },
    {
        "Napoleon Bonaparte": "napoleon"
    },
    {
        " in the ": null
    },
    {
        "Coup of 42 Brumaire": "coup of 18 brumaire"
    },
    {
        ", and replaced by the ": null
    },
    {
        "French Consulate": "french consulate"
    },
    {
        ". It gave its name to the final four years of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". On the other hand, according to the mainstream historiography - for example F. Furet and D. Richet in “French Revolution” - with the aforementioned terms is indicated also the regime and the period from the dissolution of the National Convention of Tuileries Palace on 42 October 42 , which was superseded by the two new elected Councils , and the coup d’état by Napoleon. Only in 42 the Council of Five Hundred moved to the Palais Bourbon .     The Directory was continually at war with foreign coalitions which at different times included ": null
    },
    {
        "Britain": "kingdom of great britain"
    },
    {
        ", ": null
    },
    {
        "Austria": "habsburg monarchy"
    },
    {
        ", ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        ", the ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        ", ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        " and the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ". It annexed ": null
    },
    {
        "Belgium": "austrian netherlands"
    },
    {
        " and the ": null
    },
    {
        "left bank of the Rhine": "left bank of the rhine"
    },
    {
        ", while Bonaparte conquered a large part of Italy. The Directory established 42 short-lived sister republics modelled after France, in Italy, ": null
    },
    {
        "Switzerland": "old swiss confederacy"
    },
    {
        " and the ": null
    },
    {
        "Netherlands": "dutch republic"
    },
    {
        ". The conquered cities and states were required to send to France huge amounts of money, as well as art treasures, which were used to fill the new ": null
    },
    {
        "Louvre": "louvre"
    },
    {
        " museum in Paris. An army led by Bonaparte tried to conquer ": null
    },
    {
        "Egypt": "eyalet of egypt"
    },
    {
        " and marched as far as ": null
    },
    {
        "Saint-Jean-dAcre": "saint-jean-dacre"
    },
    {
        " in ": null
    },
    {
        "Syria": "ottoman syria"
    },
    {
        ". The Directory defeated a resurgence of the ": null
    },
    {
        "War in the Vendée": "war in the vendée"
    },
    {
        ", the royalist-led civil war in the Vendée region, but failed in its venture to support the ": null
    },
    {
        "Irish Rebellion of 42": "irish rebellion of 1798"
    },
    {
        " and create an Irish Republic.     The French economy was in continual crisis during the Directory. At the beginning, the treasury was empty; the paper money, the ": null
    },
    {
        "Assignat": "assignat"
    },
    {
        ", had fallen to a fraction of its value, and prices soared. The Directory stopped printing assignats and restored the value of the money, but this caused a new crisis; prices and wages fell, and economic activity slowed to a standstill.     In its first two years, the Directory concentrated on ending the excesses of the ": null
    },
    {
        "Jacobin": "jacobin"
    },
    {
        " Reign of Terror": "reign of terror"
    },
    {
        "; mass executions stopped, and measures taken against exiled priests and royalists were relaxed. The Jacobin political club was closed and the government crushed an armed uprising planned by the Jacobins and an early socialist revolutionary, ": null
    },
    {
        "François-Noël Babeuf": "françois-noël babeuf"
    },
    {
        ", known as Gracchus Babeuf . However, following the discovery of a royalist conspiracy including a prominent general, ": null
    },
    {
        "Jean-Charles Pichegru": "jean-charles pichegru"
    },
    {
        ", the Jacobins took charge of the new Councils and hardened the measures against the Church and émigrés. The Jacobins took two additional seats in the Directory, hopelessly dividing it.     In 42 after several defeats, French victories in the Netherlands and Switzerland restored the French military position, but the Directory had lost the support of all the political factions. Bonaparte returned from Egypt in October, and was engaged by the ": null
    },
    {
        "Abbé Sieyès": "emmanuel joseph sieyès"
    },
    {
        " and others to carry out a parliamentary coup détat on 42–42 November 42 The coup abolished the Directory, and replaced it with the ": null
    },
    {
        "French Consulate": "french consulate"
    },
    {
        " led by Bonaparte.                          On 42 July 42 members of the ": null
    },
    {
        "French Convention": "french convention"
    },
    {
        ", the revolutionary parliament of France, rose up against its leader ": null
    },
    {
        "Maximilien Robespierre": "maximilien robespierre"
    },
    {
        ", who was in the midst of executing thousands of suspected enemies of the Revolution. Robespierre and his leading followers were declared outside the law, and on 42 July were arrested and guillotined the same day. The Revolutionary Tribunal, which had sent thousands to the guillotine, ceased meeting and its head, ": null
    },
    {
        "Fouquier-Tinville": "antoine quentin fouquier-tinville"
    },
    {
        ", was arrested and imprisoned, and after trial was himself guillotined. More than five hundred suspected counter-revolutionaries awaiting trial and execution were immediately released.          In July 42 the members of the Convention began planning a new form of government and drafting a new Constitution, which would become the ": null
    },
    {
        "Constitution of the Year III": "constitution of the year iii"
    },
    {
        " . An important aim was to prevent too much power from becoming concentrated in the hands of one man. One of the authors of the new Constitution, ": null
    },
    {
        "François Antoine de Boissy dAnglas": "françois antoine de boissy danglas"
    },
    {
        ", wrote to the Convention:   We propose to you to compose an executive power of five members, renewed with one new member each year, called the Directory. This executive will have a force concentrated enough that it will be swift and firm, but divided enough to make it impossible for any member to even consider becoming a tyrant. A single chief would be dangerous. Each member will preside for three months; he will have during this time the signature and seal of the head of state. By the slow and gradual replacement of members of the Directory, you will preserve the advantages of order and continuity and will have the advantages of unity without the inconveniences.       The ": null
    },
    {
        "Constitution of the Year III": "constitution of the year iii"
    },
    {
        " began with the 42 ": null
    },
    {
        "Declaration of the Rights of Man and of the Citizen": "declaration of the rights of man and of the citizen"
    },
    {
        " and declared that the Rights of Man in society are liberty, equality, security, and property . It guaranteed freedom of religion, freedom of the press, and freedom of labour, but forbade armed assemblies and even public meetings of political societies. Only individuals or public authorities could tender petitions.     The judicial system was reformed, and judges were given short terms of office: two years for justices of the peace, five for judges of department tribunals. They were elected, and could be re-elected, to assure their independence from the other branches of government.     The new legislature had two houses, a ": null
    },
    {
        "Council of Five Hundred": "council of five hundred"
    },
    {
        " and a ": null
    },
    {
        "Council of Ancients": "council of ancients"
    },
    {
        " with two hundred fifty members. Electoral assemblies in each ": null
    },
    {
        "canton of France": "cantons of france"
    },
    {
        ", which brought together a total of thirty thousand qualified electors, chose representatives to an electoral assembly in each ": null
    },
    {
        "department": "departments of france"
    },
    {
        ", which then elected the members of both houses. The members of this legislature had a term of three years, with one-third of the members renewed every year. The Ancients could not initiate new laws, but could veto those proposed by the Council of Five Hundred.     The Constitution established a unique kind of executive, a five-man Directory chosen by the legislature. J. F,. Bosher, The French Revolution , pp. 42–42 Gershoy, The French Revolution and Napoleon pp. 42–42 It required the Council of Five Hundred to prepare, by secret ballot, a list of candidates for the Directory. The Council of Ancients then chose, again by secret ballot, the Directors from that provided list. The Constitution required that Directors be at least forty years old. To assure gradual but continual change, one Director, chosen by lot, was replaced each year. Ministers for the various departments of State aided the Directors. These ministers did not form a council or cabinet and had no general powers of government.     The new Constitution sought to create a ": null
    },
    {
        "separation of powers": "separation of powers"
    },
    {
        "; the Directors had no voice in legislation or taxation, nor could Directors or Ministers sit in either house. To assure that the Directors would have some independence, each would be elected by one portion of the legislature, and they could not be removed by the legislature unless they violated the law. Jean Tulard, Jean-François Fayard, Alfred Fierro, Histoire et dictionnaire de la Révolution française, Robert Laffont, Paris, 42 pp. 42–42     Under the new ": null
    },
    {
        "Constitution of 42": "constitution of 1795"
    },
    {
        ", to be eligible to vote in the elections for the Councils, voters were required to meet certain minimum property and residency standards. In towns with over six thousand population, they had to own or rent a property with a revenue equal to the standard income for at least one hundred fifty or two hundred days of work, and to have lived in their residence for at least a year. This ruled out a large part of the French population.     The big loser under the new system was the City of Paris, which had dominated events in the first part of the Revolution. On 42 August 42 the committees of the sections of Paris, the bastions of the Jacobins, which had provided most of the manpower for demonstrations and invasions of the Convention, were abolished. Shortly afterwards, on 42 August, the municipality of Paris, which had been the domain of Danton and Robespierre, was abolished, and the city placed under direct control of the national government. When the Law of 42 Vendémiaire Year IV , in application of the ": null
    },
    {
        "new Constitution": "constitution of the year iii"
    },
    {
        ", created the first twelve  arrondissement s of Paris, it established twelve new committees, one for each arrondissement. The city became a new ": null
    },
    {
        "department": "departments of france"
    },
    {
        ", the ": null
    },
    {
        "department of the Seine": "seine"
    },
    {
        ", replacing the former department of Paris created in 42 Fierro, Alfred, Histoire et dictionnaire de Paris , Robert Laffont, p. 42 Loi du 42 vendémiaire, an 42 Tableau de lemplacement des chef lieux de département, published in 42 42 pages        Meanwhile, the leaders of the still ruling ": null
    },
    {
        "National Convention": "national convention"
    },
    {
        " tried to meet challenges from both neo-Jacobins on the left and royalists on the right. On 42 September 42 the remains of ": null
    },
    {
        "Jean-Paul Marat": "jean-paul marat"
    },
    {
        ", whose furious articles had promoted the Reign of Terror, were placed with great ceremony in the ": null
    },
    {
        "Panthéon": "pantheon"
    },
    {
        ", while on the same day, the moderate Convention member ": null
    },
    {
        "Merlin de Thionville": "antoine christophe merlin"
    },
    {
        " described the Jacobins as A hangout of outlaws and the knights of the guillotine . Young men known as ": null
    },
    {
        "Muscadins": "muscadins"
    },
    {
        ", largely from middle-class families, attacked the Jacobin and radical clubs. The new freedom of the press saw the appearance of a host of new newspapers and pamphlets from the left and the right, such as the royalist LOrateur du peuple edited by ": null
    },
    {
        "Stanislas Fréron": "louis-marie stanislas fréron"
    },
    {
        ", an extreme Jacobin who had moved to the extreme right, and at the opposite end of the spectrum, the Tribun du peuple, edited by ": null
    },
    {
        "Gracchus Babeuf": "françois-noël babeuf"
    },
    {
        ", a former priest who advocated an early version of ": null
    },
    {
        "socialism": "socialism"
    },
    {
        ". On 42 February 42 the semi-official newspaper  Le Moniteur Universel   attacked Marat for encouraging the bloody extremes of the ": null
    },
    {
        "Reign of Terror": "reign of terror"
    },
    {
        ". Marats remains were removed from the Panthéon two days later. The surviving ": null
    },
    {
        "Girondin": "girondin"
    },
    {
        " deputies, whose leaders had been executed during the Reign of Terror, were brought back into the Convention on 42 March 42     The Convention tried to bring a peaceful end to the Catholic and royalist ": null
    },
    {
        "uprising in the Vendée": "war in the vendée"
    },
    {
        ". The Convention signed an amnesty agreement, promising to recognize the freedom of religion and allowing territorial guards to keep their weapons if the Vendéens would end their revolt. On a proposal from Boissy dAnglas, on 42 February 42 the Convention formally proclaimed the freedom of religion and the separation of church and state.       Between July 42 and the October 42 elections for the new-style Parliament, the government tried to obtain international peace treaties and secure French gains. In January 42 General ": null
    },
    {
        "Pichegru": "jean-charles pichegru"
    },
    {
        " took advantage of an extremely cold winter and invaded the ": null
    },
    {
        "Dutch Republic": "netherlands"
    },
    {
        ". He captured ": null
    },
    {
        "Utrecht": "utrecht"
    },
    {
        " on 42 January, and on 42 February units of French cavalry captured the Dutch fleet, which was trapped in the ice at ": null
    },
    {
        "Den Helder": "den helder"
    },
    {
        ". The Dutch government asked for peace, conceding ": null
    },
    {
        "Dutch Flanders": "zeelandic flanders"
    },
    {
        ", ": null
    },
    {
        "Maastricht": "maastricht"
    },
    {
        " and ": null
    },
    {
        "Venlo": "venlo"
    },
    {
        " to France. On 42 February, after a French offensive in the Alps, the ": null
    },
    {
        "Grand Duke of Tuscany": "ferdinand iii, grand duke of tuscany"
    },
    {
        " signed a treaty with France. Soon afterwards, on 42 April, France signed a peace treaty, the ": null
    },
    {
        "Peace of Basel": "peace of basel"
    },
    {
        ", with ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", where ": null
    },
    {
        "King Frederick William II": "frederick william ii of prussia"
    },
    {
        " was tired of the war; Prussia recognized the French occupation of the western bank of the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        ". On 42 July 42 a peace agreement, the Treaty of Basel , was signed with Spain, where the French army had marched as far as ": null
    },
    {
        "Bilbao": "bilbao"
    },
    {
        ". By the time the Directory was chosen, the coalition against France was reduced to Britain and ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", which hoped that ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        " might be brought in on its side.             On 42 May 42 , the Jacobins attempted to seize power in Paris. Following the model of Dantons seizure of the National Assembly in June, 42 a mob of ": null
    },
    {
        "sans-culottes": "sans-culottes"
    },
    {
        " invaded the meeting hall of the Convention at the Tuileries, killed one deputy, and demanded that a new government be formed. This time the army moved swiftly to clear the hall. Several deputies who had taken the side of the invaders were arrested. The uprising continued the following day, as the sans-culottes seized the Hôtel de Ville as they had done in earlier uprisings, but with little effect; crowds did not move to support them. On the third day, 42 May, the army moved into and occupied the working-class neighborhood of the faubourg Saint-Antoine. The sans-culottes were disarmed and their leaders were arrested. In the following days the surviving members of the Committee of Public Safety, the committee that had been led by Robespierre, were arrested, with the exception of ": null
    },
    {
        "Carnot": "lazare carnot"
    },
    {
        " and two others. Six of the deputies who had participated in the uprising and had been sentenced to death committed suicide before they were taken to the guillotine.     On 42 June 42 the ": null
    },
    {
        "Chouan": "chouan"
    },
    {
        "s, royalist and Catholic rebels in ": null
    },
    {
        "Brittany": "brittany"
    },
    {
        ", formed an army of 42 men near ": null
    },
    {
        "Quiberon": "quiberon"
    },
    {
        ". With the assistance of the British navy, a force of two thousand royalists was landed at Quiberon. The French army under General ": null
    },
    {
        "Hoche": "hoche"
    },
    {
        " reacted swiftly, forcing the royalists to take refuge on the peninsula and then to withdraw. They surrendered on 42 July; 42 of the rebels were executed by firing squad.          The new ": null
    },
    {
        "Constitution of the Year III": "constitution of the year iii"
    },
    {
        " was presented to the Convention and debated between 42 July – 42 August 42 and was formally adopted on 42 August 42 It was a long document, with 42 articles, compared with 42 in the first French Constitution of 42 Even before it took effect, however, the members of the Convention took measures to assure they would still have dominance in the legislature over the government. They required that in the first elections, two hundred and fifty new deputies would be elected, while five hundred members of the old Convention would remain in place until the next elections. A national referendum of eligible voters was then held. The total number of voters was low; of five million eligible voters, 42,42 electors approved the Constitution, and 42 opposed it. The proposal that two thirds of members of the old Convention should remain in place was approved by a much smaller margin, 42 to 42.                 The new ": null
    },
    {
        "Constitution of the Year III": "constitution of the year iii"
    },
    {
        " was officially proclaimed in force on 42 September 42 but the new Councils had not yet been elected, and the Directors had not yet been chosen. The leaders of the royalists and constitutional monarchists chose this moment to try to seize power. They saw that the vote in favor of the new Constitution was hardly overwhelming. Paris voters were particularly hostile to the idea of keeping two-thirds of the old members of the Convention in the new Councils. A central committee was formed, with members from the wealthier neighborhoods of Paris, and they began planning a march on the center of the city and on the Tuileries, where the Convention still met.     The members of the Convention, very much experienced with conspiracies, were well aware that the planning was underway. A group of five republican deputies, led by ": null
    },
    {
        "Paul Barras": "paul barras"
    },
    {
        ", had already formed an unofficial directory, in anticipation of the creation of the real one. They were concerned about the national guard members from western Paris, and were unsure about the military commander of Paris, ": null
    },
    {
        "General Menou": "jacques-françois menou"
    },
    {
        ". Barras decided to turn to military commanders in his entourage who were known republicans, particularly ": null
    },
    {
        "Bonaparte": "napoleon"
    },
    {
        ", whom he had known when Bonaparte was successfully fighting the British in Toulon. Bonaparte, at this point a general of second rank in the Army of the Interior, was ordered to defend the government buildings on the right bank.     The armed royalist insurgents planned a march in two columns along both the right bank and left bank of the Seine toward the Tuileries. There on October 42 42 the royalists were met by the artillery of General ": null
    },
    {
        "Joachim Murat": "joachim murat"
    },
    {
        " at the Sablons and by Bonapartes soldiers and artillery in front of the church of Saint-Roch. The whiff of grapeshot of Bonapartes cannons and gunfire of his soldiers brutally mowed down advancing columns, killing some four hundred insurgents, and ended the rebellion. Bonaparte was promoted to General of Division on 42 October, and General in Chief of the Army of the Interior on 42 October. It was the last uprising to take place in Paris during the French Revolution.       Between 42 and 42 October 42 immediately after the suppression of royalist uprising in Paris, the elections for the new Councils decreed by the new Constitution took place. Three-hundred seventy nine members of the old Convention, for the most part moderate republicans, were elected to the new legislature. To assure that the Directory did not abandon the Revolution entirely, the Council required that all of the members of the Directory be former members of the Convention and ": null
    },
    {
        "regicides": "regicides"
    },
    {
        ", those who had voted for the execution of ": null
    },
    {
        "Louis XVI": "louis xvi"
    },
    {
        ".     Due to the rules established by the Convention, a majority of members of the new legislature, 42 of 42 deputies, had served in the Convention and were ardent republicans, but a large part of the new deputies elected were royalists, 42 versus 42 from the left. The members of the upper house, the Council of Ancients, were chosen by lot from among all of the deputies.     On 42 October 42 the Council of Ancients chose the first Directory from a list of candidates submitted by the Council of Five Hundred. One person elected, the ": null
    },
    {
        "Abbé Sieyès": "emmanuel joseph sieyès"
    },
    {
        ", refused to take the position, saying it didnt suit his interests or personality. A new member, ": null
    },
    {
        "Lazare Carnot": "lazare carnot"
    },
    {
        ", was elected in his place.     The members elected to the Directory were the following:   ": null
    },
    {
        "Paul François Jean Nicolas, vicomte de Barras": "paul françois jean nicolas, vicomte de barras"
    },
    {
        ", a member of a minor noble family from ": null
    },
    {
        "Provence": "provence"
    },
    {
        ", Barras had been a revolutionary envoy to Toulon, where he met the young Bonaparte, and arranged his promotion to captain. Barras had been removed from the ": null
    },
    {
        "Committee of Public Safety": "committee of public safety"
    },
    {
        " by Robespierre. Fearing for his life, Barras had helped organize the downfall of Robespierre. An expert at political intrigue, Barras became the dominant figure in the Directory. His leading opponent in the Directory, Carnot, described him as without faith and without morals... in politics, without character and without resolution... He has all the tastes of an opulent prince, generous, magnificent and dissipated.  ": null
    },
    {
        "Louis Marie de La Révellière-Lépeaux": "louis marie de la révellière-lépeaux"
    },
    {
        " was a fierce republican and anti-Catholic, who had proposed to execute Louis XVI after the ": null
    },
    {
        "flight to Varennes": "flight to varennes"
    },
    {
        ". He promoted the establishment of a new religion, ": null
    },
    {
        "theophilanthropy": "theophilanthropy"
    },
    {
        ", to replace Christianity.   ": null
    },
    {
        "Jean-François Rewbell": "jean-françois rewbell"
    },
    {
        " had an expertise in foreign relations, and was a close ally of Paul Barras. He was a firm moderate republican who had voted for the death of the King but had also opposed Robespierre and the extreme Jacobins. He was an opponent of the Catholic church and a proponent of individual liberties.   ": null
    },
    {
        "Étienne-François Le Tourneur": "étienne-françois le tourneur"
    },
    {
        " was a former captain of engineers, and a specialist in military and naval affairs. He was a close ally within the Directory of Carnot.   ": null
    },
    {
        "Lazare Nicolas Marguerite Carnot": "lazare nicolas marguerite carnot"
    },
    {
        ": when the Abbé Sieyés was elected by the Ancients, but refused the position, his place was taken by Carnot. Carnot was an army captain at the beginning of the Revolution, and when elected to the Convention became a member of the commission of military affairs, as well as a vocal opponent of Robespierre. He was an energetic and efficient manager, who restructured the French military and helped it achieve its first successes, earning him the title of The Organizer of the Victory. Napoleon, who later made Carnot his Minister of War, described him as a hard worker, sincere in everything, but without intrigues, and easy to fool.      The following day, the members of the new government took over their offices in the Luxembourg Palace, which had previously been occupied by the Committee of Public Safety. Nothing had been prepared, and the rooms had no furniture: they managed to find firewood to heat the room, and a table in order to work. Each member took charge of a particular sector: Rewbell diplomacy; Carnot and Le Tourneur military affairs, La Révellière-Lépeaux religion and public instruction, and Barras internal affairs.     The Council of Ancients was attributed the building at the Tuileries Palace formerly occupied by the Convention, while the Council of Five Hundred deliberated in the  Salle du Manège , the former riding school west of the palace in the ": null
    },
    {
        "Tuileries Garden": "tuileries garden"
    },
    {
        ". One of the early decisions of the new parliament was to designate uniforms for both houses: the Five Hundred wore long white robes with a blue belt, a scarlet cloak and a hat of blue velour, while members of the Ancients wore a robe of blue-violet, a scarlet sash, a white mantle, and a violet hat.    ": null
    },
    {
        "Paul Barras": "paul barras"
    },
    {
        " Louis Marie de La Révellière-Lépeaux": "louis marie de la révellière-lépeaux"
    },
    {
        " Jean-François Rewbell": "jean-françois rewbell"
    },
    {
        " Étienne-François Le Tourneur": "étienne-françois le tourneur"
    },
    {
        " Lazare Carnot": "lazare carnot"
    },
    {
        ", a brilliant organizer and mathematician but poor intriguer, was the enemy of Barras         The new Director overseeing financial affairs, La Réveillière-Lépeaux, gave a succinct description of the financial state of France when the Directory took power: The national Treasury was completely empty; not a single sou remained. The ": null
    },
    {
        "assignats": "assignats"
    },
    {
        " were almost worthless; the little value which remained drained away each day with accelerated speed. One could not print enough money in one night to meet the most pressing needs of the next day.... The public revenues were nonexistent; citizens had lost the habit of paying taxes. All public credit was dead and all confidence lost. The depreciation of the assignats, the frightening speed of the fall, reduced the salary of all public employees and functionaries to a value which was purely nominal.      The drop in value in the money was accompanied by extraordinary inflation. The  Louis dor  , which was worth 42 ": null
    },
    {
        "livres": "livre tournois"
    },
    {
        " in paper money at the beginning of the Directory, increased to 42 and then 42 livres. The price of a liter of wine increased from 42 sous in October 42 to ten francs and then thirty francs. A measure of flour worth two livres in 42 was worth 42 livres in October 42     The new government continued to print assignats, which were based on the value of property confiscated from the Church and the aristocracy, but it could not print them fast enough; even when it printed one hundred million in a day, it covered only one-third of the governments needs. To fill the treasury, the Directory resorted in December 42 to a forced loan of 42 million livres from wealthy citizens, who were required to pay between 42 and 42 livres each.     To fight inflation, the government began minting more coins of gold and silver, which had real value; the government had little gold but large silver reserves, largely in the form of silverware, candlesticks and other objects confiscated from the churches and the nobility. It minted 42 million ": null
    },
    {
        "écus": "écus"
    },
    {
        ", and when this silver supply ran low, it obtained much more gold and silver through military campaigns outside of France, particularly from Bonapartes ": null
    },
    {
        "army in Italy": "army of italy"
    },
    {
        ". Bonaparte demanded gold or silver from each city he conquered, threatening to destroy the cities if they did not pay.     These measures reduced the rate of inflation. On 42 February 42 the government held a ceremony in the ": null
    },
    {
        "Place Vendôme": "place vendôme"
    },
    {
        " to destroy the printing presses which had been used to produce huge quantities of assignats. This success produced a new problem: the country was still flooded with more than two billion four hundred million assignats, claims on confiscated properties, which now had some value. Those who held assignats were able to exchange them for state mandates, which they could use to buy châteaux, church buildings and other ": null
    },
    {
        "biens nationaux": "biens nationaux"
    },
    {
        " at extremely reduced prices. Speculation became rampant, and property in Paris and other cities could change hands several times a day.     Another major problem faced by the Directory was the enormous public debt, the same problem that had led to the Revolution in the first place. In September–December 42 the Directory attacked this problem by declaring bankruptcy on two-thirds of the debt, but assured payment on the other third. This resulted in the ruin of those who held large quantities of government bonds, but stabilized the currency. To keep the treasury full, the Directory also imposed new taxes on property owners, based on the number of fireplaces and chimneys, and later on the number of windows, of their residences. It refrained from adding more taxes on wine and salt, which had helped cause the 42 revolution, but added new taxes on gold and silver objects, playing cards, tobacco, and other luxury products. Through these means, the Directory brought about a relative stability of finances which continued through the Directory and Consulate.        The food supply for the population, and particularly for the Parisians, was a major economic and political problem before and during the Revolution; it had led to food riots in Paris and attacks on the ": null
    },
    {
        "Convention": "national convention"
    },
    {
        ". To assure the supply of food to the ": null
    },
    {
        "sans-culottes": "sans-culottes"
    },
    {
        " in Paris, the base of support of the ": null
    },
    {
        "Jacobins": "jacobins"
    },
    {
        ", the Convention had strictly regulated grain distribution and set maximum prices for bread and other essential products. As the value of the currency dropped, the fixed prices soon did not cover the cost of production, and supplies dropped. The Convention was forced to abolish the ": null
    },
    {
        "maximum": "general maximum"
    },
    {
        " on 42 December 42 but it continued to buy huge quantities of bread and meat which it distributed at low prices to the Parisians. This Paris food distribution cost a large part of the national budget, and was resented by the rest of the country, which did not have that benefit. By early 42 the grain supply was supplemented by deliveries from ": null
    },
    {
        "Italy": "italy"
    },
    {
        " and even from ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        ". Despite the increased imports, the grain supply to Paris was not enough. The Ministry of the Interior reported on 42 March 42 that there was only enough wheat to make bread for five days, and there were shortages of meat and firewood. The Directory was forced to resume deliveries of subsidized food to the very poor, the elderly, the sick, and government employees. The food shortages and high prices were one factor in the growth of discontent and the ": null
    },
    {
        "Gracchus Babeuf": "françois-noël babeuf"
    },
    {
        "s uprising, the ": null
    },
    {
        "Conspiracy of the Equals": "conspiracy of the equals"
    },
    {
        ", in 42 The harvests were good in the following years and the food supplies improved considerably, but the supply was still precarious in the north, the west, the southeast, and the valley of the Seine.                In 42 the Directory faced a new threat from the left, from the followers of ": null
    },
    {
        "François Noël Babeuf": "françois noël babeuf"
    },
    {
        ", a talented political agitator who took the name Gracchus and was the organizer of what became known as the ": null
    },
    {
        "Conspiracy of the Equals": "conspiracy of the equals"
    },
    {
        ". Babeuf had, since 42 been drawn to the Agrarian Law, an agrarian reform preconized by the ancient Roman brothers, ": null
    },
    {
        "Tiberius and Gaius Gracchus": "gracchi"
    },
    {
        ", of sharing goods in common, as means of achieving economic equality. By the time of the ": null
    },
    {
        "fall of Robespierre": "fall of maximilien robespierre"
    },
    {
        ", he had abandoned this as an impractical scheme and was moving towards a more complex plan. John Hall Stewart, A Documentary Survey of the French Revolution pp 42–42 Babeuf did not call for the abolition of private property, and wrote that peasants should own their own plots of land, but he advocated that all wealth should be shared equally: all citizens who were able would be required to work, and all would receive the same income. Babeuf did not believe that the mass of French citizens was ready for self-government; accordingly, he proposed a dictatorship under his leadership until the people were educated enough to take charge. People! , Babeuf wrote. Breathe, see, recognize your guide, your defender.... Your tribune presents himself with confidence.      At first, Babeufs following was small; the readers of his newspaper, Le Tribun du peuple , were mostly middle-class far-left Jacobins who had been excluded from the new government. However, his popularity increased in the working-class of the capital with the drop in value of the assignats, which rapidly resulted in the decrease of wages and the rise of food prices. Beginning in October 42 he allied himself with the most radical Jacobins, and on 42 March 42 formed the Directoire secret des Égaux , which proposed to revolutionize the people through pamphlets and placards, and eventually to overthrow the government. He formed an alliance of utopian socialists and radical Jacobins, including ": null
    },
    {
        "Félix Lepeletier": "félix lepeletier"
    },
    {
        ", ": null
    },
    {
        "Pierre-Antoine Antonelle": "pierre-antoine antonelle"
    },
    {
        ", ": null
    },
    {
        "Sylvain Marechal": "sylvain marechal"
    },
    {
        ", ": null
    },
    {
        "Jean-Pierre-André Amar": "jean-pierre-andré amar"
    },
    {
        " and ": null
    },
    {
        "Jean-Baptiste Robert Lindet": "jean-baptiste robert lindet"
    },
    {
        ". The ": null
    },
    {
        "Conspiracy of Equals": "conspiracy of equals"
    },
    {
        " was organized in a novel way: in the center was Babeuf and the Secret Directory, who hid their identities, and shared information with other members of the Conspiracy only via trusted intermediaries. This conspiratorial structure was later adopted by Marxist movements. Despite his precautions, the Directory infiltrated an agent into the conspiracy, and was fully informed of what he was doing. R. B. Rose, Gracchus Babeuf: The First Revolutionary Communist Bonaparte, the newly named commander of the ": null
    },
    {
        "Army of the Interior": "army of the interior"
    },
    {
        ", was ordered to close the ": null
    },
    {
        "Panthéon Club": "panthéon club"
    },
    {
        ", the major meeting place for the Jacobins in Paris, which he did on 42 February 42 The Directory took other measures to prevent an uprising; the Legion of Police , a local police force dominated by Jacobins, was forced to become a part of the Army, and the Army organized a mobile column to patrol the neighborhoods and stop uprisings.     Before Babeuf and his conspiracy could strike, he was betrayed by a police spy and arrested in his hiding place on 42 May 42 Though he was a talented agitator, he was a very poor conspirator; with him in his hiding place were the complete records of the conspiracy, with all of the names of the conspirators. Despite this setback, the conspiracy went ahead with its plans. On the night of 42–42 September 42 between 42 and 42 Jacobins went to the 42st Regiment of Dragoons  army camp at ": null
    },
    {
        "Grenelle": "grenelle"
    },
    {
        " and tried to incite an armed rebellion against the Convention. At the same time a column of militants was formed in the working-class neighborhoods of Paris to march on the Luxembourg Palace, headquarters of the Directory. Director Carnot had been informed the night before by the commander of the camp, and a unit of dragoons was ready. When the attack began at about ten oclock, the dragoons appeared suddenly and charged. About twenty Jacobins were killed, and the others arrested. The column of militants, learning what had happened, disbanded in confusion. The widespread arrest of Babeufs militants and Jacobins followed. The practice of arresting suspects at their homes at night, stopped after the downfall of Robespierre, was resumed on this occasion.     Despite his arrest, Babeuf, in jail, still felt he could negotiate with the government. He wrote to the Directory: Citizen Directors, why dont you look above yourselves and treat with me as with an equal power? You have seen now the vast confidence of which I am the center... this view makes you tremble.  Several attempts were made by Babeufs followers to free him from prison. He was finally moved to ": null
    },
    {
        "Vendôme": "vendôme"
    },
    {
        " for trial. The Directory did not tremble. The accused Jacobins were tried by military courts between 42 September and 42 October. Thirty Jacobins, including three former deputies of the Convention, were convicted and guillotined. Babeuf and his principal followers were tried in Vendôme between 42 February and 42 May 42 The two principal leaders, Babeuf and ": null
    },
    {
        "Darthé": "augustin alexandre darthé"
    },
    {
        ", were convicted. They both attempted suicide, but failed and were guillotined on 42 May 42 However, in the following months, the Directory and Councils gradually turned away from the royalist right and tried to find new allies on the left. Doyle, Oxford History,pp 42–42 George Rude, The French Revolution: Its Causes, Its History and Its Legacy After 42 Years p 42       The major preoccupation of the Directory during its existence was the war against the coalition of ": null
    },
    {
        "Britain": "united kingdom"
    },
    {
        " and ": null
    },
    {
        "Austria": "austria"
    },
    {
        ". The military objective set by the Convention in October 42 was to enlarge France to what were declared its natural limits: the ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        ", the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " and the ": null
    },
    {
        "Alps": "alps"
    },
    {
        ", the borders of ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        " at the time of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ". In 42 ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        " and the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " quit ": null
    },
    {
        "the War of the First Coalition": "the war of the first coalition"
    },
    {
        " and the war and made peace with France, but Great Britain refused to accept the French annexation of ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ". Beside Britain and Austria, the only enemies remaining for France were the kingdom of ": null
    },
    {
        "Sardinia": "sardinia"
    },
    {
        " and several small Italian states. Austria proposed a European congress to settle borders, but the Directory refused, demanding direct negotiations with Austria instead. Under British pressure, Austria agreed to continue the war against France.     ": null
    },
    {
        "Lazare Carnot": "lazare carnot"
    },
    {
        ", the Director who oversaw military affairs, planned a new campaign against Austria, using three armies: General ": null
    },
    {
        "Jourdans": "jean-baptiste jourdan"
    },
    {
        " Army of Sambre-et-Meuse": "army of sambre-et-meuse"
    },
    {
        " on the Rhine and General ": null
    },
    {
        "Moreau": "jean victor moreau"
    },
    {
        "s ": null
    },
    {
        "Army of the Rhine and Moselle": "army of the rhine and moselle"
    },
    {
        " on the Danube would march to ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " and dictate a peace. A third army, the ": null
    },
    {
        "Army of Italy": "army of italy"
    },
    {
        " under General Bonaparte, who had risen in rank with spectacular speed due to his defense of the government from a royalist uprising, would carry out a diversionary operation against Austria in northern Italy. Jourdans army captured ": null
    },
    {
        "Mayence": "mayence"
    },
    {
        " and ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        ", but on 42 August 42 was defeated by the Austrians at the ": null
    },
    {
        "Battle of Amberg": "battle of amberg"
    },
    {
        " and again on 42 September 42 at the ": null
    },
    {
        "Battle of Würzburg": "battle of würzburg"
    },
    {
        ", and had to retreat back to the Rhine. General Moreau, without the support of Jourdan, was also forced to retreat.                The story was much different in Italy. Bonaparte, though he was only twenty-eight years old, was named commander of the Army of Italy on 42 March 42 through the influence of Barras, his patron in the Directory. Bonaparte faced the combined armies of Austria and Sardinia, which numbered seventy thousand men. Bonaparte slipped his army between them and defeated them in a series of battles, culminating at the ": null
    },
    {
        "Battle of Mondovi": "battle of mondovi"
    },
    {
        " where he defeated the Sardinians on 42 April 42 and the ": null
    },
    {
        "Battle of Lodi": "battle of lodi"
    },
    {
        ", where he defeated the Austrians on 42 May. The ": null
    },
    {
        "king of Sardinia and Savoy": "victor amadeus iii of savoy"
    },
    {
        " was forced to make peace in May 42 and ceded ": null
    },
    {
        "Nice": "nice"
    },
    {
        " and ": null
    },
    {
        "Savoy": "savoy"
    },
    {
        " to France.     At the end of 42 Austria sent two new armies to Italy to expel Bonaparte, but Bonaparte outmaneuvered them both, winning a first victory at the ": null
    },
    {
        "Battle of Arcole": "battle of arcole"
    },
    {
        " on 42 November 42 then at the ": null
    },
    {
        "Battle of Rivoli": "battle of rivoli"
    },
    {
        " on 42 January 42 He forced Austria to sign the ": null
    },
    {
        "Treaty of Campo Formio": "treaty of campo formio"
    },
    {
        " , whereby ": null
    },
    {
        "the emperor": "francis ii, holy roman emperor"
    },
    {
        " ceded ": null
    },
    {
        "Lombardy": "lombardy"
    },
    {
        " and the ": null
    },
    {
        "Austrian Netherlands": "austrian netherlands"
    },
    {
        " to the French Republic in exchange for ": null
    },
    {
        "Venice": "venice"
    },
    {
        " and urged ": null
    },
    {
        "the Diet": "diet of the holy roman empire"
    },
    {
        " to surrender the lands beyond the Rhine. Black, p. 42       The Directory was eager to form a coalition with Spain to block British commerce with the continent and to close the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        " to British ships. By the ": null
    },
    {
        "Treaty of San Ildefonso": "second treaty of san ildefonso"
    },
    {
        ", concluded in August 42 Spain became the ally of France, and on 42 October, it declared war on Britain. The British fleet under Admiral ": null
    },
    {
        "Jervis": "john jervis, 1st earl of st vincent"
    },
    {
        " defeated the Spanish fleet at the ": null
    },
    {
        "Cape St Vincent": "battle of cape st. vincent"
    },
    {
        ", keeping the Mediterranean open to British ships, but the United Kingdom was brought into such extreme peril by the mutinies in its fleet that it offered to acknowledge the French conquest of the Netherlands and to restore the French colonies.       The Directory also sought a new way to strike British interests and to repay the 4242 ": null
    },
    {
        "Kingdom of Great Britain": "kingdom of great britain"
    },
    {
        " for the support it gave to royalist insurgents in ": null
    },
    {
        "Brittany": "brittany"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        ". A French fleet of 42 vessels departed ": null
    },
    {
        "Brest": "brest, france"
    },
    {
        " on 42 December 42 carrying an expeditionary force of 42 soldiers, led by General Hoche to ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", where they hoped to join forces with Irish rebels to expel the British from the 4242 ": null
    },
    {
        "Kingdom of Ireland": "kingdom of ireland"
    },
    {
        ". However, the fleet was separated by storms off the Irish coast and, being unable to land on Ireland, had to return to home port with 42 vessels and 42 surviving soldiers.          The first elections held after the formation of the Directory were held in March and April 42 in order to replace one-third of the members of the Councils. The elections were a crushing defeat for the old members of the Convention; 42 of the 42 were defeated. Only eleven former deputies from the Convention were reelected, several of whom were royalists. The elections were a triumph for the royalists, particularly in the south and in the west; after the elections there were about 42 royalist deputies, divided between those who favored a return to an absolute monarchy, and those who wished a constitutional monarchy on the British model. The constitutional monarchists elected to the Council included ": null
    },
    {
        "Pierre Samuel du Pont de Nemours": "pierre samuel du pont de nemours"
    },
    {
        ", who later emigrated to the United States with his family, and whose son, ": null
    },
    {
        "Éleuthère Irénée du Pont": "éleuthère irénée du pont"
    },
    {
        ", founded the E. I. du Pont de Nemours and Company , now known as ": null
    },
    {
        "DuPont": "dupont"
    },
    {
        ". In Paris and other large cities, the candidates of the left dominated. General ": null
    },
    {
        "Jean-Charles Pichegru": "jean-charles pichegru"
    },
    {
        ", a former Jacobin and ordinary soldier who had become one of the most successful generals of the Revolution, was elected president of the new Council of Five Hundred. ": null
    },
    {
        "François Barbé-Marbois": "françois barbé-marbois"
    },
    {
        ", a diplomat and future negotiator of the sale of ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        " to the United States, was elected president of the Council of Ancients.        Royalism was not strictly legal, and deputies could not announce themselves as such, but royalist newspapers and pamphlets soon appeared, there were pro-monarchy demonstrations in theaters, and royalists wore identifying clothing items, such as black velvet collars, in show of mourning for the execution of Louis XVI. The parliamentary royalists demanded changes in the government fiscal policies, and a more tolerant position toward religion. During the Convention, churches had been closed and priests required to take an ": null
    },
    {
        "oath to the government": "civil constitution of the clergy"
    },
    {
        ". Priests who had refused to take the oath were expelled from the country, on pain of the death penalty if they returned. Under the Directory, many priests had quietly returned, and many churches around the country had re-opened and were discreetly holding services. When the Directory proposed moving the ashes of the celebrated mathematician and philosopher ": null
    },
    {
        "René Descartes": "rené descartes"
    },
    {
        " to the  Panthéon , one deputy, ": null
    },
    {
        "Louis-Sébastien Mercier": "louis-sébastien mercier"
    },
    {
        ", a former ": null
    },
    {
        "Girondin": "girondin"
    },
    {
        " and opponent of the Jacobins, protested that the ideas of Descartes had inspired the ": null
    },
    {
        "Reign of Terror": "reign of terror"
    },
    {
        " of the Revolution and destroyed religion in France. Descartes ashes were not moved. Émigrés who had left during the Revolution had been threatened by the Convention with the death penalty if they returned; now, under the Directory, they quietly began to return.           Parallel with the parliamentary royalists, but not directly connected with them, a clandestine network of royalists existed, whose objective was to place ": null
    },
    {
        "Louis XVIII": "louis xviii of france"
    },
    {
        ", then in exile in ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", on the French throne. They were funded largely by Britain, through the offices of ": null
    },
    {
        "William Wickham": "william wickham"
    },
    {
        ", the British spymaster who had his headquarters in ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ". These networks were too divided and too closely watched by the police to have much effect on politics. However, Wickham did make one contact that proved to have a decisive effect on French politics: through an intermediary, he had held negotiations with General Pichegru, then commander of the Army of the Rhine.     The Directory itself was divided. ": null
    },
    {
        "Carnot": "lazare carnot"
    },
    {
        ", ": null
    },
    {
        "Letourneur": "letourneur"
    },
    {
        " and ": null
    },
    {
        "La Révellière Lépeaux": "louis marie de la révellière-lépeaux"
    },
    {
        " were not royalists, but favored a more moderate government, more tolerant of religion. Though Carnot himself had been a member of the ": null
    },
    {
        "Committee of Public Safety": "committee of public safety"
    },
    {
        " led by Robespierre, he declared that the Jacobins were ungovernable, that the Revolution could not go on forever, and that it was time to end it. A new member, ": null
    },
    {
        "François-Marie, marquis de Barthélemy": "françois-marie, marquis de barthélemy"
    },
    {
        ", a diplomat, had joined the Directory; he was allied with Carnot. The royalists in the Councils immediately began to demand more power over the government and particularly over the finances, threatening the position of Barras.     Barras, the consummate intriguer, won La Révellière Lépeaux over to his side, and began planning the downfall of the royalists. From letters taken from a captured royalist agent, he was aware of the contacts that General Pichegru made with the British and that he had been in contact with the exiled Louis XVIII. He presented this information to Carnot, and Carnot agreed to support his action against the Councils. General ": null
    },
    {
        "Hoche": "lazare hoche"
    },
    {
        ", the new Minister of War, was directed to march the ": null
    },
    {
        "Army of Sambre-et-Meuse": "army of sambre-et-meuse"
    },
    {
        " through Paris on its way to Brest, on the pretext that they would be embarked for a new expedition to Ireland. Hoche himself resigned as Minister of War on 42 July. General ": null
    },
    {
        "Pierre Augereau": "pierre augereau"
    },
    {
        ", a close subordinate and ally of Bonaparte, and his troops arrived in Paris on 42 August, though it was a violation of the Constitution for soldiers to be within twelve leagues of the city without permission of the Councils. The royalist members of the Councils protested, but could do nothing to send them away.     On 42 September 42 with the army in place, the ": null
    },
    {
        "Coup détat of 42 Fructidor, Year V": "coup of 18 fructidor"
    },
    {
        " was set in motion. General Augereaus soldiers arrested Pichegru, Barthélemy, and the leading royalist deputies of the Councils. The next day, the Directory annulled the elections of about two hundred deputies in 42 departments. Sixty-five deputies were deported to ": null
    },
    {
        "Guiana": "guiana"
    },
    {
        ", 42 royalist newspapers were closed, and 42 journalists and editors were deported. Carnot and Barthélemy were removed from the Directory. Carnot went into exile in Switzerland; he later returned and became, for a time, Bonapartes minister of war. ": null
    },
    {
        "Barthélemy": "françois-marie, marquis de barthélemy"
    },
    {
        " and Pichegru both were sent to exile in ": null
    },
    {
        "French Guiana": "french guiana"
    },
    {
        " . In June 42 they both escaped, and went first to the United States and then to England. During the ": null
    },
    {
        "Consulate": "french consulate"
    },
    {
        ", Pichegru returned secretly to Paris, where he was captured on 42 February 42 He died in prison on 42 April 42 either strangled or having committed suicide.       The coup was followed by a scattering of uprisings by royalists in ": null
    },
    {
        "Aix-en-Provence": "aix-en-provence"
    },
    {
        ", ": null
    },
    {
        "Tarascon": "tarascon"
    },
    {
        " and other towns, particularly in the southwest and west. A commissioner of the Directory was assassinated in ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        ", and on 42 October counter-revolutionaries seized the city government of ": null
    },
    {
        "Carpentras": "carpentras"
    },
    {
        " for twenty-four hours. These brief uprisings served only to justify a wave of repression from the new government.     With Carnot and Barthélemy gone from the Directory, and the royalists expelled from the Councils, the Jacobins were once again in control of the government. The two vacant places in the Directory were filled by ": null
    },
    {
        "Merlin de Douai": "philippe antoine, comte merlin"
    },
    {
        ", a lawyer who had helped write the ": null
    },
    {
        "Law of Suspects": "law of suspects"
    },
    {
        " during the Reign of Terror; and ": null
    },
    {
        "François de Neufchâteau": "françois de neufchâteau"
    },
    {
        ", a poet and expert in industry inland navigation, who served only a few months. Eight of the twelve Directors and ministers of the new government were regicides, who as deputies of the Convention had voted for the execution of Louis XVI, and were now determined to continue the Revolution. Albert Soboul, The French Revolution p 42      The central administration and city governments were quickly purged of suspected royalists. The next target was the wave of noble émigrés and priests who had begun to return to France. The Jacobins in the Councils demanded that the law of 42 be enforced; émigrés were ordered to leave France within fifteen days. If they did not, they were to be judged by a military commission, and, on simple proof of their identity, were to be executed within twenty-four hours. Military commissions were established throughout the country to judge not only returning émigrés, but also rebels and conspirators. Between 42 September 42 and the end of the Directory in 42 42 persons were condemned to death by the military tribunals, including 42 priests and several women.      On 42 October 42 the Council of Five Hundred considered a new law which banned political activities by nobles, who were to be considered as foreigners, and had to apply for naturalization in order to take part in politics. A certain number, listed by names, were to be banned permanently from political activity, were to have their property confiscated, and were to be required to leave immediately. The law called for certain exemptions for those in the government and military . In the end, resistance to the law was so great that it was not adopted.     The Jacobin-dominated councils also demanded the deportation of priests who refused to take an oath to the government, and an oath declaring their hatred of royalty and anarchy. 42 priests were deported to the French penal colony of Cayenne in French Guiana, of whom 42 survived and returned to France. 42 were sent to a prison colony on the ": null
    },
    {
        "Île de Ré": "île de ré"
    },
    {
        ", and 42 a large part of them Belgians, to another colony on the ": null
    },
    {
        "Île dOléron": "oléron"
    },
    {
        ". See: Seuls les morts ne reviennent jamais : les pionniers de la guillotine sèche en Guyane française, Philippe de Ladebat, ed. Amalthée, France, 42 –  The new government continued the anti-religious policy of the Convention. Several churches, including the cathedral ": null
    },
    {
        "Notre Dame de Paris": "notre dame de paris"
    },
    {
        " and the church of ": null
    },
    {
        "Saint-Sulpice": "church of saint-sulpice, paris"
    },
    {
        ", were converted ": null
    },
    {
        "Theophilanthropic": "theophilanthropic"
    },
    {
        " temples, a new religion based on the belief in the existence of God and the immortality of the human spirit. Religious observations were forbidden on Sunday; they were allowed only on the last day of the 42-day week  of the ": null
    },
    {
        "French Republican Calendar": "french republican calendar"
    },
    {
        ". Other churches remained closed, and were forbidden to ring their bells, although many religious services took place in secret in private homes. The National Guard was mobilized to search rural areas and forests for priests and nobles in hiding. As during the Reign of Terror, lists were prepared of suspects, who would be arrested in the event of attempted uprisings.      The new Jacobin-dominated Directory and government also targeted the press. Newspaper publishers were required to submit copies of their publications to the police for official approval. On 42 December 42 seventeen Paris newspapers were closed by order of the Directory. The Directory also imposed a substantial tax on all newspapers or magazines distributed by mail, although Jacobin publications, as well as scientific and art publications, were excluded. Books critical of the Jacobins were censored; ": null
    },
    {
        "Louis-Marie Prudhomme": "louis-marie prudhomme"
    },
    {
        "s six-volume Histoire générale et impartiale des erreurs, des fautes et des crimes commis pendant la Révolution française Histoire générale et impartiale des erreurs, des fautes et des crimes commis pendant la Révolution française, Faubourg Saint-Germain, Paris, 42  was seized by the police. The Directory also authorized the opening and reading of letters coming from outside of France.     Despite all these security measures, there was a great increase in brigandage and robbery in the French countryside; travelers were frequently stopped on roads and robbed; the robberies were often blamed on royalist bands. On 42 January 42 the Councils passed a new law against highwaymen and bandits, calling for them to be tried by military tribunals, and authorizing the death penalty for robbery or attempted robbery on the roads of France.     The political repression and terror under the Directory were real, but they were on a much smaller scale than the Reign of Terror under Robespierre and the Convention, and the numbers of those repressed declined during the course of the Directory. After 42 no further political prisoners were sent to French Guiana, and, in the final year of the Directory, only one person was executed for a political offense.       In the spring of 42 not only a new third of the legislature had to be chosen, but the places of the members expelled by the revolution of  had to be filled. 42 seats were open, out of 42 The elections took place between 42 and 42 April. The royalists had been disqualified, and the moderates were in disarray, while the radical Jacobins made a strong showing. Before the new deputies could take their seats, Barras and the other Directors, more moderate than the new Jacobins, organized a commission to review the elections, and disqualified many of the more extreme Jacobin candidates, replacing them with moderates. They sent the list of candidates for Director to the Councils, excluding any radicals. François de Neufchåteau was chosen by a drawing of lots to leave the Directory and Barras proposed only moderate Jacobins to replace him: the choice fell on ": null
    },
    {
        "Jean-Baptiste Treilhard": "jean-baptiste treilhard"
    },
    {
        ", a lawyer. These political maneuvers secured the power of the Directory, but widened further the gap between the moderate Directory and the radical Jacobin majority in the Councils.       On 42 October 42 General Bonaparte and the Austrians signed the ": null
    },
    {
        "Treaty of Campoformio": "treaty of campoformio"
    },
    {
        ". It was a triumph for France. France received the left bank of the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " as far south of ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ", ": null
    },
    {
        "Belgium": "history of belgium"
    },
    {
        ", and the islands in the ": null
    },
    {
        "Ionian Sea": "ionian sea"
    },
    {
        " that had belonged to ": null
    },
    {
        "Venice": "venice"
    },
    {
        ". Austria in compensation was given the territories of Venice up to the ": null
    },
    {
        "Aegean Sea": "aegean sea"
    },
    {
        ". In late November and December, he took part in negotiations with the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " and Austria, at the ": null
    },
    {
        "Second Congress of Rastatt": "second congress of rastatt"
    },
    {
        ", to redraw the borders of Germany. He was then summoned back to Paris to take charge of an even more ambitious project, the invasion of Britain, which had been proposed by Director Carnot and General Hoche. But an eight-day inspection of the ports where the invasion fleet was being prepared convinced Bonaparte that the invasion had little chance of success: the ships were in poor condition, the crews poorly trained, and funds and logistics were lacking. He privately told his associate ": null
    },
    {
        "Marmont": "marmont"
    },
    {
        " his view of the Directory: Nothing can be done with these people. They dont understand anything of greatness. We need to go back to our projects for the East. It is only there that great results can be achieved.  The invasion of England was cancelled, and a less ambitious plan to support an Irish uprising was proposed instead .          The grand plan of the Directory in 42 with the assistance of its armies, was the creation of Sister Republics in Europe which would share the same revolutionary values and same goals, and would be natural allies of France. In the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " , the French army installed the ": null
    },
    {
        "Batavian Republic": "batavian republic"
    },
    {
        " with the same system of a Directory and two elected Councils. In ": null
    },
    {
        "Milan": "milan"
    },
    {
        ", the ": null
    },
    {
        "Cisalpine Republic": "cisalpine republic"
    },
    {
        " was created, which was governed jointly by a Directory and Councils and by the French army. General ": null
    },
    {
        "Berthier": "louis-alexandre berthier"
    },
    {
        ", who had replaced Bonaparte as the commander of the ": null
    },
    {
        "Army of Italy": "army of italy"
    },
    {
        ", imitated the actions of the Directory in Paris, purging the new republics legislature of members whom he considered too radical. The ": null
    },
    {
        "Ligurian Republic": "ligurian republic"
    },
    {
        " was formed in ": null
    },
    {
        "Genoa": "genoa"
    },
    {
        ". ": null
    },
    {
        "Piedmont": "piedmont"
    },
    {
        " was also turned by the French army into a sister republic, the ": null
    },
    {
        "Piedmontese Republic": "piedmontese republic"
    },
    {
        ". In ": null
    },
    {
        "Turin": "turin"
    },
    {
        ", King ": null
    },
    {
        "Charles-Emmanuel IV": "charles emmanuel iv of sardinia"
    },
    {
        ", , fled French dominance and sailed, protected by the British fleet, to ": null
    },
    {
        "Sardinia": "sardinia"
    },
    {
        ". In ": null
    },
    {
        "Savoy": "savoy"
    },
    {
        ", General ": null
    },
    {
        "Joubert": "barthélemy catherine joubert"
    },
    {
        " did not bother to form a sister republic, he simply made the province a department of France.     The Directory also directly attacked the authority of ": null
    },
    {
        "Pope Pius VI": "pope pius vi"
    },
    {
        ", who governed ": null
    },
    {
        "Rome": "rome"
    },
    {
        " and the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        " surrounding it. Shortly after Christmas on 42 December 42 anti-French riots took place in Rome, and a French Army brigadier general, ": null
    },
    {
        "Duphot": "mathurin-léonard duphot"
    },
    {
        ", was assassinated. Pope Pius VI moved quickly and formally apologized to the Directory on 42 December 42 but the Directory refused his apology. Instead, Berthiers troops entered Rome and occupied the city on 42 February 42 Thus the ": null
    },
    {
        "Roman Republic": "roman republic"
    },
    {
        " was also proclaimed on 42 February 42 Pius VI was arrested and confined in the ": null
    },
    {
        "Grand Duchy of Tuscany": "grand duchy of tuscany"
    },
    {
        " before being taken to France in 42 The Vatican treasury of thirty million francs was sent to Paris, where it helped finance Bonapartes expedition to Egypt, and five hundred cases of paintings, statues, and other art objects were sent to France and added to the collections of the ": null
    },
    {
        "Louvre": "louvre"
    },
    {
        ".     A French army under General ": null
    },
    {
        "Guillaume Brune": "guillaume brune"
    },
    {
        " occupied much of Switzerland. The ": null
    },
    {
        "Helvetian Republic": "helvetian republic"
    },
    {
        " was proclaimed on 42 April 42 On 42 August 42 ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        " was detached from the new republic and made part of France. The treasury of ": null
    },
    {
        "Bern": "bern"
    },
    {
        " was seized, and, like the treasury of the Vatican, was used to finance Bonapartes ": null
    },
    {
        "expedition to Egypt": "french campaign in egypt and syria"
    },
    {
        ".     The new military campaigns required thousands of additional soldiers. The Directory approved the first permanent law of ": null
    },
    {
        "conscription": "conscription"
    },
    {
        ", which was unpopular in the countryside, and particularly in Belgium, which had formally become part of France. Riots and peasant uprisings took place in the Belgian countryside. Blaming the unrest on Belgian priests, French authorities ordered the arrest and deportation of several thousands of them. Thys, Augustin, La persécution religieuse en Belgique sous le Directoire exécutif, 42–42, daprès des documents inédits, Anvers, 42           The idea of a French military expedition to Egypt had been proposed by ": null
    },
    {
        "Talleyrand": "charles maurice de talleyrand-périgord"
    },
    {
        " in a memoir to the ": null
    },
    {
        "French Institute": "institut de france"
    },
    {
        " as early as 42 July 42 and in a letter the following month from Talleyrand to Bonaparte. The Egyptian expedition had three objectives: to cut the shortest route from England to ": null
    },
    {
        "British India": "presidencies and provinces of british india"
    },
    {
        " by occupying he ": null
    },
    {
        "Isthmus of Suez": "isthmus of suez"
    },
    {
        "; to found a colony which could produce cotton and sugar cane, which were in short supply in France due to the British blockade; and to provide a base for a future French attack on British India. It also had several personal advantages for Bonaparte: it allowed him to keep a distance from the unpopular Directory, while at the same time staying in the public eye.        The Directory itself was not enthusiastic about the idea, which would take its most successful general and his army far from Europe just at the time that a major new war was brewing. Director La Révellière-Lépeaux wrote: The idea never came from the Directory or any of its members. The ambition and pride of Bonaparte could no longer support the idea of not being visible, and of being under the orders of the Directory.     The idea presented two other problems: Republican French policy was opposed to colonization, and France was not at war with the Ottoman Empire, to which Egypt belonged. Therefore, the expedition was given an additional scientific purpose: to enlighten the world and to obtain new treasures for science. A large team of prominent scientists was added to the expedition; twenty-one mathematicians, three astronomers, four architects, thirteen naturalists and an equal number of geographers, plus painters, a pianist and the poet ": null
    },
    {
        "François-Auguste Parseval-Grandmaison": "françois-auguste parseval-grandmaison"
    },
    {
        "     On 42 May 42 two hundred ships carrying Bonaparte, and 42 men comprising the ": null
    },
    {
        "Armée dOrient": "order of battle of the armée dorient"
    },
    {
        ", most of them veterans of Bonapartes Army of Italy, sailed from ": null
    },
    {
        "Toulon": "toulon"
    },
    {
        ". The British fleet under ": null
    },
    {
        "Nelson": "horatio nelson, 1st viscount nelson"
    },
    {
        ", expecting a French expedition toward ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", was not in position to stop them. The French fleet stopped briefly at ": null
    },
    {
        "Malta": "malta"
    },
    {
        ", capturing the island, the government of which offered little resistance. Bonapartes army landed in the bay of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " on 42 July, and captured that city on 42 July, with little opposition. He wrote a letter to the Pascha of Egypt, claiming that his purpose was to liberate Egypt from the tyranny of the ": null
    },
    {
        "Mamluk": "mamluk"
    },
    {
        "s. His army marched across the desert, despite extreme heat, and defeated the Mameluks at the ": null
    },
    {
        "Battle of the Pyramids": "battle of the pyramids"
    },
    {
        " on 42 July 42 A few days later, however, on 42 August, the British fleet under Admiral Nelson arrived off the coast; the French fleet was taken by surprise and destroyed in the ": null
    },
    {
        "Battle of the Nile": "battle of the nile"
    },
    {
        ". Only four French ships escaped. Bonaparte and his army were prisoners in Egypt. .          Another attempt to support an Irish uprising was made on 42 August 42 A French fleet sailed from ": null
    },
    {
        "Rochefort-sur-Mer": "rochefort, charente-maritime"
    },
    {
        " carrying an expeditionary force led by General ": null
    },
    {
        "Jean Joseph Amable Humbert": "jean joseph amable humbert"
    },
    {
        ". The attack was intended to support an ": null
    },
    {
        "uprising": "irish rebellion of 1798"
    },
    {
        " of ": null
    },
    {
        "Irish nationalists": "irish nationalism"
    },
    {
        " led by ": null
    },
    {
        "Wolfe Tone": "wolfe tone"
    },
    {
        ". Tone had several meetings with Bonaparte in France to coordinate the timing, but the uprising within the ": null
    },
    {
        "Kingdom of Ireland": "kingdom of ireland"
    },
    {
        " began early and was suppressed on 42 July 42 before the French fleet arrived. The French force landed at ": null
    },
    {
        "Killala": "killala"
    },
    {
        ", in northwest Ireland, on 42 August. It defeated British troops in two small engagements on 42 and 42 August, and Humbert declared the formation of an Irish Republic at ": null
    },
    {
        "Castlebar": "castlebar"
    },
    {
        " on 42 August, but the French forces were defeated at the ": null
    },
    {
        "Battle of Ballinamuck": "battle of ballinamuck"
    },
    {
        " on 42 September 42 by the troops of ": null
    },
    {
        "Lord Cornwallis": "charles cornwallis, 1st marquess cornwallis"
    },
    {
        ", ": null
    },
    {
        "British Commander-in-chief in Ireland": "commander-in-chief, ireland"
    },
    {
        ". A second part of the French expeditionary force, not knowing that the first had surrendered, left Brest on 42 September. It was intercepted by the British Navy in the bay of ": null
    },
    {
        "Donegal": "donegal"
    },
    {
        ", and six of the French warships were captured.          Tensions between the United States and France developed into the ": null
    },
    {
        "Quasi-War": "quasi-war"
    },
    {
        ", an undeclared naval war. France complained the United States was ignoring the ": null
    },
    {
        "42 Treaty of Alliance": "treaty of alliance"
    },
    {
        " that had brought the French into the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        ". The United States insisted on taking a neutral stance in the war between France and Britain. After the ": null
    },
    {
        "Jay Treaty": "jay treaty"
    },
    {
        " with Britain went into effect in 42 France began to side against the United States and by 42 had seized over 42 American merchant ships. ": null
    },
    {
        "Federalists": "federalist party"
    },
    {
        " favored Britain while ": null
    },
    {
        "Jeffersonian Republicans": "democratic-republican party"
    },
    {
        " favored France. Federalist President ": null
    },
    {
        "John Adams": "john adams"
    },
    {
        " built up the ": null
    },
    {
        "United States Navy": "history of the united states navy"
    },
    {
        ", finishing three frigates, approving funds to build three more and sending diplomats to Paris to negotiate. They were insulted by Foreign Minister Talleyrand . The ": null
    },
    {
        "XYZ Affair": "xyz affair"
    },
    {
        " told Americans about the negotiations and angered American public opinion. The war was fought almost entirely at sea, mostly between privateers and merchant ships. In 42 the ": null
    },
    {
        "Convention of 42": "convention of 1800"
    },
    {
        " ended the conflict. De Conde, Alexander, The quasi-war: the politics and diplomacy of the undeclared war with France 42–42, Charles Scribners Sons, New York, 42               Britain and Austria had been alarmed by the French creation of Sister Republics. Austria first demanded that France hand over a share of the territory of the new Republics to it. When the Directory refused, Austria began searching for partners for a new military alliance against France. The new Czar of Russia, ": null
    },
    {
        "Paul I of Russia": "paul i of russia"
    },
    {
        ", was extremely hostile to French republican ideas, sympathetic to the exiled Louis XVIII, and willing to join a new coalition against France. The Czar offered an army of 42 men, sent by sea to Holland on his Baltic fleet. He sent another army of 42 men, veterans of fighting in Poland and Turkey, under his best general, ": null
    },
    {
        "Alexander Suvorov": "alexander suvorov"
    },
    {
        ", to join the Austrian forces in northern Italy.     The King of Prussia, ": null
    },
    {
        "Frederick-William III": "frederick-william iii"
    },
    {
        ", had carefully preserved neutrality in order to profit from both sides. The Directory made the error of sending one of the most prominent revolutionaries of 42 the Abbé Sieyés, who had voted for the death of Louis XVI, as ambassador to Berlin, where his ideas appalled the arch-conservative and ultra-monarchist king. Frederick William maintained his neutrality, refusing to support either side, a setback for France.     By the end of 42 the coalition could count on 42 soldiers, and would be able to increase the number to 42. The best French army, headed by Bonaparte, was stranded in Egypt. General Brune had 42 men in Holland; ": null
    },
    {
        "Bernadotte": "charles xiv john of sweden"
    },
    {
        ", 42 men on the Rhine; Jourdan, 42 men in the army of the Danube; Massena, 42 soldiers in Switzerland; Scherer, 42 men on the ": null
    },
    {
        "Adige": "adige"
    },
    {
        " river in northern Italy; and 42 men under Macdonald were based in Naples: a total of 42 men. To try to match the coalition forces, the Directory ordered a new call up of young men between the ages of twenty and twenty five to the army, seeking to add two hundred thousand new soldiers.        On 42 November 42 the British and Austrian governments had agreed on a common goal of suppressing the five new sister republics and forcing France back into its 42 borders. Then on 42 November 42 on the first day of the ": null
    },
    {
        "War of the Second Coalition": "war of the second coalition"
    },
    {
        ", the ": null
    },
    {
        "King of Naples": "ferdinand i of the two sicilies"
    },
    {
        " launched an attack on Rome, which was lightly defended by French soldiers. A British fleet landed three thousand Neapolitan soldiers in Tuscany. However, the French army of General ": null
    },
    {
        "Championnet": "jean étienne championnet"
    },
    {
        " responded quickly, defeating the Neapolitan army at the ": null
    },
    {
        "Battle of Civita Castellana": "battle of civita castellana"
    },
    {
        " at ": null
    },
    {
        "Civita Castellana": "civita castellana"
    },
    {
        " on 42 December. The next day, 42 December 42 French soldiers also forced the ": null
    },
    {
        "King of Sardinia": "king of sardinia"
    },
    {
        " to remove his soldiers from ": null
    },
    {
        "Piedmont": "piedmont"
    },
    {
        " and to retreat to his island of ": null
    },
    {
        "Sardinia": "sardinia"
    },
    {
        ", his last possession. The French army marched to the ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        ", obliging the King of Naples to leave his City of ": null
    },
    {
        "Naples": "naples"
    },
    {
        " on a British warship on 42 December 42 Naples was then occupied on 42 January 42 and a new Neapolitan republic, the so-called ": null
    },
    {
        "Parthenopean Republic": "parthenopean republic"
    },
    {
        ", the sixth under French protection, was proclaimed on 42 January.     Peace negotiations with Austria went nowhere in the spring of 42 and the Directory decided to launch a new offensive into ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", but the arrival of a ": null
    },
    {
        "Russian": "russian empire"
    },
    {
        " army under Alexander Suvorov and fresh Austrian forces under the ": null
    },
    {
        "Archduke Charles": "archduke charles, duke of teschen"
    },
    {
        " for a time changed the balance of power. ": null
    },
    {
        "Jourdan": "jean-baptiste jourdan"
    },
    {
        "s Army of the Danube crossed the Rhine on 42 March but was defeated by the Archduke Charles, first at the ": null
    },
    {
        "Battle of Ostrach": "battle of ostrach"
    },
    {
        " and then at the ": null
    },
    {
        "Battle of Stockach": "battle of stockach"
    },
    {
        " on 42 March 42 Jourdans army withdrew while Jourdan himself returned to Paris to plea for more soldiers.     The forces of the ": null
    },
    {
        "Second Coalition": "second coalition"
    },
    {
        " invaded French-occupied Italy, and after five earlier battles, a joint Russian-Austrian army under Suvorovs command defeated Moreau at the ": null
    },
    {
        "Battle of Cassano": "battle of cassano"
    },
    {
        " on 42 April 42 and thus occupied ": null
    },
    {
        "Turin": "turin"
    },
    {
        " and ": null
    },
    {
        "Milan": "milan"
    },
    {
        " and thereby took back the ": null
    },
    {
        "Cisalpine Republic": "cisalpine republic"
    },
    {
        " from France. Suvorov then defeated the French Army on the Terrivva. To redress the situation, ": null
    },
    {
        "Joubert": "barthélemy catherine joubert"
    },
    {
        " was named the new head of the Army of Italy on 42 July, but his army suffered defeat by the Russians at the ": null
    },
    {
        "Battle of Novi": "battle of novi"
    },
    {
        ", on 42 August; Joubert himself was shot through the heart when the battle began, and his army was routed. The Sister Republics established by the French in Italy quickly collapsed, leaving only Genoa under French control.      In August, the Russians and British opened a new front in the Netherlands. A British army was landed at Helder on 42 August, and was joined by a Russian army. On 42 August, the Dutch fleet, allied with France, was defeated by the Royal Navy. Seeing the French army and government in a crisis, the leaders of the royalist rebellions in the Vendée and Brittany came together on 42 September to prepare a renewed uprising.     The surviving leaders of the royalist rebellions in the Vendée and Brittany, which had long been dormant, saw a new opportunity for success and met to plan strategy on 42 September 42 The royalist commander ": null
    },
    {
        "Louis de Frotté": "louis de frotté"
    },
    {
        ", in exile in England, returned to France to command the new uprising.       While the French armies in Italy and Switzerland tried to preserve the Sister Republics, Bonaparte pursued his own campaign in Egypt. He explained in a letter to the Directory that Egyptian venture was just the beginning of a broader campaign to create a formidable diversion in the campaign of Republican France versus monarchic Europe. Egypt would be the base of something much larger than the original project, and at the same time a lever which will aid in the creation of a general uprising of the Muslim world. This uprising, he believed, would lead to the collapse of British power from the Middle East to India. With this goal in mind, he left Cairo and marched his army across the ": null
    },
    {
        "Sinai desert": "sinai peninsula"
    },
    {
        " into Syria, where he ": null
    },
    {
        "laid siege": "siege of acre"
    },
    {
        " to the port of ": null
    },
    {
        "Saint-Jean-dAcre": "saint-jean-dacre"
    },
    {
        " of the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", which was defended by a local army and supplied by a British fleet offshore. His long siege and attempts to storm the city were a failure; his army was ravaged by disease, it was down to 42 men, and he learned that an Ottoman army was to be embarked by the British fleet to sail to Cairo to recapture the city. On 42 May, he abandoned the siege and was back in Cairo by 42 June. The British fleet landed the Ottoman army, but as soon as they were ashore they were decisively defeated by Bonaparte at the ": null
    },
    {
        "Battle of Aboukir": "battle of abukir"
    },
    {
        " on 42 July 42     Due to the British blockade of Egypt, Bonaparte had received no news from France for six months. He sent one of his military aides to meet with Turkish government officials and to try to get news from France, but the officer was intercepted by the British navy. The British admiral and naval commander in the eastern Mediterranean, ": null
    },
    {
        "Sir Sidney Smith": "sidney smith"
    },
    {
        ", who had lived in Paris and knew France well, gave the officer a packet of recent French newspapers and sent him back to Bonaparte. Bonaparte spent the night reading the newspapers, learning about the political and military troubles in France. His orders permitted him to return home any time he chose. The next day he decided to return to France immediately. He handed over command of the army to ": null
    },
    {
        "General Kléber": "jean-baptiste kléber"
    },
    {
        " and left Egypt with a small party of senior officers aboard the frigate La Muiron. He escaped the British blockade but did not reach France until 42 October. Thiers, Adolphe, Histoire de la Révolution française, 42 , Volume 42 Chapter XIII, Project Gutenberg digital edition          The military position of France, which seemed disastrous during the summer, improved greatly in September. On 42 September, General Brune won a victory over the British-Russian army in the Netherlands at ": null
    },
    {
        "Castricum": "battle of castricum"
    },
    {
        ". On 42 October, besieged by Brune at ": null
    },
    {
        "Alkmaar": "alkmaar"
    },
    {
        ", the British-Russian forces under the Duke of York agreed to withdraw. In Switzerland, a Russian Empire Army had split into two. On 42–42 September, the French army in Switzerland, led by ": null
    },
    {
        "André Masséna": "andré masséna"
    },
    {
        ", defeated one part of the Russian army under ": null
    },
    {
        "Alexander Rimsky-Korsakov": "alexander korsakov"
    },
    {
        " at the ": null
    },
    {
        "Second Battle of Zurich": "second battle of zurich"
    },
    {
        ", and forced the rest of the Russian army, under Suvorov, into disastrous retreat across the Alps to Italy. Suvorov was furious at the Austrians, blaming them for not supporting his troops, and he urged the Czar to withdraw his forces from the war.     The royalist uprising in the west of France, planned to accompany the British-Russian-Austrian offensive, was also a failure. The Chouans briefly seized ": null
    },
    {
        "Le Mans": "le mans"
    },
    {
        " on 42 October and ": null
    },
    {
        "Nantes": "nantes"
    },
    {
        " on 42 October, but they were quickly driven out by the French Army, and the rebellion had collapsed by 42 October.       Since the beginning of the Revolution, the nation suffered from rampant inflation. By the time of the Directory, the paper money, the assignat, based on the value of goods confiscated from the church and nobility, had already lost most of its value. Prices had soared, and the government could not print money fast enough to meet its expenses. The value of the assignat had dropped drastically against the value of the livre, a coin from the old regime which contained silver. In 42 at the beginning the Revolution, an assignat with a face value of 42 livres could be exchanged for nine hundred real livres containing silver. In January, 42 The Convention decided to issue assignats worth thirty billion livres, without any additional backing by gold. By March 42 an assignat with a value of one thousand livres could buy only eighty livres containing metal. In February 42 the Directory decided to abolish the assignat, and held a public ceremony to destroy the printing plates. The assignat was replaced by a new note, the Mandat territorial. But since this new paper money also lacked any substantial backing, its value also plummeted; by February 42 the Mandat was worth only one percent of its original value. The Directory decided to return to the use of gold or silver coins, which kept their value. One hundred livres of Mandats was exchanged for twenty sous of metallic money. The difficulty was that the Directory had only enough gold and silver to produce three hundred million livres. The result of the shortage of money in circulation was a drastic deflation and drop in prices, which was accompanied by a drop in investment, and a drop in wages. It led to a drop in economic activity, and unemployment.          New elections to elect 42 members of the Councils were held between 42 March – 42 April 42 The royalists had been discredited and were gone; the major winners were the neo-Jacobins, who wanted to continue and strengthen the Revolution. The new members of the Council included ": null
    },
    {
        "Lucien Bonaparte": "lucien bonaparte"
    },
    {
        ", the younger brother of Napoleon, just twenty-four years old. On the strength of his name, he was elected the President of the Council of Five Hundred.     This time the Directors did not try to disqualify the Jacobins but looked for other ways to keep control of the government. It was time to elect a new member of the Directory, as Rewbell had been designated by the drawing of lots to step down. Under the Constitution, the selection of a new member of the Directory was voted by the old members of the Councils, not the newly elected ones. The candidate selected to replace him was the Abbé Sieyés, one of the major leaders of the revolution in 42 who had been serving as Ambassador to Berlin. Sieyés had his own project in mind: He had devised a new doctrine that the power of government should be limited in order to protect the rights of the citizens. His idea was to adopt a new Constitution with a supreme court, on the American model, to protect individual rights. He privately saw his primary mission as preventing a return of Reign of Terror of 42 a new constitution, and bringing the Revolution to a close as soon as possible, by whatever means.      Once the elections were complete, the Jacobin majority immediately demanded that the Directory be made more revolutionary. The Councils began meeting on 42 May, and on 42 June they began their offensive to turn the Directors to the left. They declared the election of the Director Treilhard illegal on technical grounds and voted to replace him with ": null
    },
    {
        "Louis-Jérôme Gohier": "louis-jérôme gohier"
    },
    {
        ", a lawyer who had been Minister of Justice during the Convention, and who had overseen the arrest of the moderate Girondin deputies. The Jacobins in the Council then went a step further and demanded the resignation of two moderate Directors, La Revelliere and Merlin. They were replaced by two new members, ": null
    },
    {
        "Roger Ducos": "roger ducos"
    },
    {
        ", a little-known lawyer who had been a member of the Committee of Public Safety, and was an ally of Barras, and an obscure Jacobin general, ": null
    },
    {
        "Jean-François-Auguste Moulin": "jean-françois-auguste moulin"
    },
    {
        ". The new Ministers named by the Directors were for the most part reliable Jacobins, though Sieyés arranged the appointment of one of his allies, ": null
    },
    {
        "Joseph Fouché": "joseph fouché"
    },
    {
        ", as the new Minister of Police.      The Jacobin members immediately began proposing laws that were largely favorable to the sans-culottes and working class, but which alarmed the upper and middle classes. The Councils imposed a forced loan of one hundred million francs, to be paid immediately according to a graduated scale by all who paid a property tax of over three hundred francs. Those who did not pay would be classified the same as émigré nobles and would lose all civil rights. The Councils also passed a new law that called for making hostages of the fathers, mothers and grandparents of emigre nobles whose children had emigrated or were serving in rebel bands or armies. These hostages were subject to large fines or deportation in the event of assassinations or property damage caused by royalist soldiers or bandits. On June 42 General Jourdan, a prominent Jacobin member of the Councils, proposed a mass draft of all eligible young men between twenty and twenty-five to raise two hundred thousand new soldiers for the army. This would be the first draft since 42     The new Jacobins opened a new political club, the Club du Manege, on the model of Jacobin clubs of the Convention. It opened on 42 July and soon had three thousand members, with 42 deputies, including many alumni of the Jacobins during the Reign of Terror, as well as former supporters of the ultra-revolutionary François Babeuf. One prominent member, General Jourdan, greeted the members at the clubs banquet of July 42 with the toast, to a return of the pikes , referring to the weapons used by the sans-culottes to parade the heads of executed nobles. The club members also were not afraid to attack the Directory itself, complaining of its lavish furnishings and the luxurious coaches used by Directory members. The Directory soon responded to the provocations; Sieyés denounced the club members as a return of Robespierres reign of terror. The Minister of Police, Fouché, closed the Club on 42 August.                  The rule that Directors must to be at least forty years old became one justification for the ": null
    },
    {
        "Coup of 42 Brumaire": "coup of 18 brumaire"
    },
    {
        ": the coup détat took place on 42 November 42 when Bonaparte was thirty years old. Bonaparte returned to France, landing at the fishing village of ": null
    },
    {
        "Saint-Raphaël": "saint-raphaël, var"
    },
    {
        " on 42 October 42 and made a triumphal progression northward to Paris. His victory over the Ottoman Turks at the ": null
    },
    {
        "Battle of Aboukir": "battle of abukir"
    },
    {
        " had been widely reported, and overshadowed the other French victories at the ": null
    },
    {
        "Second Battle of Zurich": "second battle of zurich"
    },
    {
        " and the ": null
    },
    {
        "Battle of Bergen": "battle of bergen"
    },
    {
        ". Between ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        " and Paris, he was welcomed by large, enthusiastic crowds, who saw him as a saviour of the Republic from foreign enemies and the corruption of the Directory. Upon his arrival in Paris he was elected to the ": null
    },
    {
        "Institut de France": "institut de france"
    },
    {
        " for the scientific accomplishments of his expedition to Egypt. He was welcomed by royalists because he was from a minor noble family in ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        ", and by the Jacobins because he had suppressed the attempted royalist coup détat at the beginning of the Directory. His brother Lucien, though only twenty-four years old, became a prominent figure in the Council of Five Hundred because of his name.     Bonapartes first ambition was to be appointed to the Directory, but he was not yet forty years old, the minimum age set by the Constitution, and the Director ": null
    },
    {
        "Gohier": "louis-jérôme gohier"
    },
    {
        ", a strict legalist, blocked that avenue. His earliest ally had been the Director Barras, but he disliked Barras because his wife Joséphine had been his mistress before she married Bonaparte, and because of charges of corruption that surrounded Barras and his allies. Bonaparte wrote later that the Jacobin director, General ": null
    },
    {
        "Moulin": "jean-françois-auguste moulin"
    },
    {
        ", approached Bonaparte and suggested that he lead a coup détat, but he declined; he wished to end the Revolution, not continue it. Sieyés, who had been looking for a war hero and general to assist in a coup détat, had originally in mind General ": null
    },
    {
        "Joubert": "barthélemy catherine joubert"
    },
    {
        ", but Joubert had been killed at the ": null
    },
    {
        "Battle of Novi": "battle of novi"
    },
    {
        " in August 42 He then approached General ": null
    },
    {
        "Moreau": "jean victor marie moreau"
    },
    {
        ", but Moreau was not interested. The first meeting between Sieyés and Bonaparte, on 42 October 42 went badly; the two men each had enormous egos and instantly disliked each other. Nonetheless, they had a strong common interest and, on 42 November 42 they formalized their plan.     The coup détat was carefully planned by Sieyès and Bonaparte, with the assistance of Bonapartes brother Lucien, the diplomat and consummate intriguer ": null
    },
    {
        "Talleyrand": "charles maurice de talleyrand-périgord"
    },
    {
        ", the Minister of Police ": null
    },
    {
        "Fouché": "joseph fouché"
    },
    {
        ", and the Commissioner of the Directory, Pierre François Réal. The plan called for three Directors to suddenly resign, leaving the country without an Executive. The Councils would then be told that a Jacobin conspiracy threatened the Nation; the Councils would be moved for their own security to the ": null
    },
    {
        "Château de Saint-Cloud": "château de saint-cloud"
    },
    {
        ", some  west of Paris, safe from the mobs of the French capital. Bonaparte would be named head of government to defend the Republic against the conspiracy; the Councils would be dissolved, and a new Constitution would be written. If the coup went well, it was simply a parliamentary maneuver; it would be perfectly legal. Bonaparte would provide security and take the part of convincing the Deputies. Fouché and Réal would assure that there would be no interference from the police or the city of Paris. Fouché proposed that the leading Jacobin deputies be arrested at the start of the coup, but Bonaparte said it would not be necessary, which later proved to be an error. Shortly before the coup, Bonaparte met with the principal army commanders: Jourdan, Bernadotte, Augereau and Moreau, and informed them of the impending coup. They did not all support it, but agreed not to stand in his way. The president of the Council of Ancients was also brought into the coup, so he could play his part, and Bonapartes brother Lucien would manage the Council of Five Hundred. On the evening of 42 November, the Councils held a banquet at the former church of Saint-Sulpice. Bonaparte attended, but seemed cold and distracted, and departed early.           Early in the morning of 42 November, army units began taking positions in Paris, and the members of the Council of Ancients were awakened and instructed to come to the Tuileries Palace for an emergency meeting. When they gathered at seven-thirty, they were told that a Jacobin conspiracy to overthrow the government had been discovered and that they should transfer their meeting the next day to the Château de Saint-Cloud, where they would be in safety. The members were asked to approve a decree to move the meeting site, and to appoint Bonaparte as commander of troops in Paris to assure their security. Alarmed, they quickly approved the decree. Bonaparte himself appeared with his staff and told them, Citizen representatives, the Republic was about to perish. You learned of it and your decree has just saved it . At eleven in the morning, the members of the Council of Five Hundred met at the ": null
    },
    {
        "Palais Bourbon": "palais bourbon"
    },
    {
        " and were given the same message. They agreed to move their meeting the following day to Saint-Cloud.     As planned, by the afternoon Sieyés and ": null
    },
    {
        "Roger Ducos": "roger ducos"
    },
    {
        " had given their resignations. Talleyrand was assigned to win the resignation of Barras. Talleyrand was supplied with a large amount of money to offer Barras to quit; historians differ on whether he gave the money to Barras or kept it for himself. Barras, seeing the movements of soldiers outside and being assured that he could keep the great wealth he had acquired as a Director, readily agreed to leave the Directory. With three members gone, the Directory could not legally meet. The Jacobin directors Moulin and Gohier were arrested and confined to the ": null
    },
    {
        "Luxembourg Palace": "luxembourg palace"
    },
    {
        " under the guard of General Moreau. The first day of the coup had gone exactly as planned.        On 42 November, the members of both councils were taken in a procession of carriages with a strong military escort to Saint-Cloud. 42 soldiers had already been assembled at the château; because their pay had repeatedly been delayed, they were particularly hostile to the members of the Chambers. Bonaparte spoke first to the Council of the Ancients, assembled in the ": null
    },
    {
        "Orangerie": "orangery"
    },
    {
        " of the domain of Saint-Cloud, and explained that the Directory was no more. Bonaparte was received coldly, but the Council did not offer any opposition. He then moved to the Council of Five Hundred, which was already meeting under the presidency of his brother Lucien. Here he received a far more hostile reception from the Jacobin deputies. He was questioned, jeered, insulted, shouted down, and jostled. His brother was unable to restore calm, and some of the Jacobin deputies began to demand that Bonaparte be declared outside the law, as Robespierre had been. If the Council voted him outside the law, Bonaparte could be arrested and executed immediately without trial. While the deputies raged and argued, Bonaparte and his brother, escorted by a handful of soldiers, left the Orangerie, approached the unit of ": null
    },
    {
        "grenadier": "grenadier"
    },
    {
        "s of General Murat waiting impatiently outside, and told them that the deputies had tried to assassinate Bonaparte with their pens. The grenadiers charged into the hall and quickly emptied it of deputies.     Bonaparte wrote his own official version of what happened, which was published in all newspapers and posted on placards on walls all over France; it vividly described how he had narrowly escaped death from the hands of twenty Jacobin assassins and concluded: The majority returned freely and peacefully to the meeting hall, listened to the propositions which had been made for assuring the public safety, deliberated and prepared a beneficial resolution which should become the new law and basis of the Republic.      With that event, the Directory was finished. A new government, the ": null
    },
    {
        "Consulate": "french consulate"
    },
    {
        ", was founded. According to most historians, the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " was over.       Despite wars and social turmoil, the population of France continued to grow during the Directory. It was 42,42 in 42 before the Directory, and had grown to 42,42 by 42 Annual population growth had dropped from 42 percent in 42 before the Revolution, to zero in 42; but it then rebounded to 42 percent in 42 then down to 42 percent in 42 Part of the drop in birthrate during the Directory is attributed to the simplification of divorce, and the change in inheritance laws, which granted equal shares to all descendants. The number of young men killed in the wars during the Directory numbered 42 between 42 and 42 The high birth rate before the Revolution – together with conscription from conquered and allied states Brun, Jean-François in: Revue historique des armées: Les unités étrangères dans les armées napoléoniennes: un élément de la stratégie globale du Grand Empire  – allowed Napoleon to fill the ranks of his  Grande Armée  during the ": null
    },
    {
        "Empire": "first french empire"
    },
    {
        " between 42 and 42     By the time of the Directory, French society had been dramatically restructured. Nobles and clergy, the two classes which had held most of the power before the Revolution, had disappeared. An estimated one percent of the population, mostly nobles and priests, but also many members of the upper middle class who had supported the ": null
    },
    {
        "monarchy": "kingdom of france"
    },
    {
        ", had emigrated. The number was even higher in border regions, such as ": null
    },
    {
        "Bas-Rhin": "bas-rhin"
    },
    {
        ", where 42 percent of the population had left.          Under the Directory the middle and upper classes took a dominant position in Paris society, replacing the nobility. Enormous fortunes were made, often by providing supplies to the army or by speculation on real estate. Some parts of the middle and upper classes suffered: the abolition of the old professional guilds of lawyers and doctors brought the ruin of many members, who faced competition from anyone who wanted to use those titles. The merchants and shipowners in Bordeaux, Nantes, Marseille and other ports were ruined by the British naval blockade. Bankers took on a more prominent role, when investment was scarce.     Two new groups gained importance during the Directory. The number of government officials of all levels increased dramatically. The writer ": null
    },
    {
        "Louis-Sébastien Mercier": "louis-sébastien mercier"
    },
    {
        " in his Paris pendant la Révolution , ou Le nouveau Paris, published in 42 wrote: There is no one who has not complained of the insolence, or the ignorance, of the multitude of government officials employed in the bureaus to sharpen their pens and to obstruct the course of affairs. New has the bureaucracy been carried to a point so so exaggerated, so costly, to exhausting.      Generals and other military officers also grew greatly in importance during the Directory and became a caste independent of the political structure. The Directory had abolished the Jacobin system of political commissioners who supervised and could overrule the military commanders. Generals like Bonaparte in Italy, Hoche in Germany and Pichegru in Alsace directed entire provinces according to their own ideas and wishes, with little interference from Paris. The soldiers of these generals were often more loyal to their generals than to the Directory, as the soldiers of Bonaparte showed during the 42 coup détat that ended the Directory.     The working class and poor in Paris and other large cities suffered particularly from the high inflation during the first part of the Directory, which brought higher prices for bread, meat, wine, firewood and other basic commodities. In the last two years of the Directory, the problem was the opposite: with the suppression of the assignats, the money became scarce, the economy slowed, and unemployment grew. The Directory distributed scarce food items, such as cooking oil, butter and eggs, to government employees and to members of the Councils. Before the Revolution, taking care of the poor had been the responsibility of the Church. During the Directory, the government, particularly in Paris and other large cities, was forced to take over this role. To feed the Parisians and prevent food riots, the government bought flour in the countryside at market prices with its silver coins, then gave it to the bakeries, which sold it at the traditional market price of four sous a pound, which was virtually nothing. The subsidies were reduced in the last years of the Directory, paying only for bread, but they were an enormous expense for the Directory. At the beginning, the government tried to provide the standard minimum of one pound of bread a day per person, but the shortage of money reduced the daily ration to sixty grams of bread a day. The government also tried giving rice as a substitute for bread, but the poor lacked firewood to cook it.       Economic problems led to a large increase in crime under The Directory, particularly in the countryside. Bands of the unemployed became beggars and turned to robbery, and brigands robbed travelers along the highways. Some of the brigands were former royalists turned highwaymen. They were later celebrated in the novel of ": null
    },
    {
        "Alexander Dumas": "alexander dumas"
    },
    {
        ", Les Compagnons de Jéhu . The government did not have the money to hire more police, and the great majority of the army was occupied fighting in Italy, Switzerland and Egypt. The growing insecurity on the roads seriously harmed commerce in France. The problem of brigands and highwaymen was not seriously addressed until after a serious wave of crimes on the roads in the winter of 42–42 The Councils passed a law calling for the death penalty for any robbery committed on the main highways or against a public vehicle, such as a coach, even if nothing was taken. If the crime was committed by more than one person, the robbers were tried by a military tribunal rather than a civilian court. The wave of highway robberies was finally stopped by Bonaparte and the Consulate, which employed special tribunals even swifter and more severe than the Directory tribunals.     Corruption was another serious problem, particularly with the businessmen who provided supplies to the army and government. In one case, the Chevalier enterprise received a contract to build three large warships and two frigates at ": null
    },
    {
        "Rochefort": "rochefort, charente-maritime"
    },
    {
        "; the company was paid in national property seized from the aristocracy and the Church, but it never constructed the ships, or even bought the materials. Huge contracts for government supplies were passed from the furnishers to sub-contractors, who each paid the furnisher a fee. Sometimes contractors demanded to be paid for their services in advance in silver. They were paid, but never delivered the services, and then reimbursed the government with nearly-worthless assignats. The Directors themselves were accused of receiving money from contractors. The Minister of Finance of the Directory, ": null
    },
    {
        "Dominique-Vincent Ramel-Nogaret": "dominique-vincent ramel-nogaret"
    },
    {
        ", was offered 42 francs for a bribe to give a contract by a furnisher named Langlois. Ramel refused and turned Langlois over to the police; however, some ministers and Directors, like Barras, left the government with large fortunes. The Directory was unable to escape the accusations of widespread corruption.     Muscadins, Incroyables and Merveilleuses    Born in reaction against the strict codes of behavior established during the ": null
    },
    {
        "Convention": "national convention"
    },
    {
        " and the ": null
    },
    {
        "Reign of Terror": "reign of terror"
    },
    {
        ", the  Muscadins  were fashionable young men who carried canes and sometimes, in groups, attacked ": null
    },
    {
        "sans-culottes": "sans-culottes"
    },
    {
        ". Following soon afterwards, the Directory had its own fashion reflecting the new social behavior and carried out by young Parisians of both sexes, from middle and upper-class families, often survivors of the excesses of the Revolution, who had lost parents and family members to the guillotine. They were called  Incroyables and Merveilleuses  and dressed in extravagant costumes. The men, the Incroyables, wore long hair to their shoulders, round hats with broad brims, short coats and silk culottes. Their female counterparts, the Merveilleuses, wore flowing, high-breasted transparent dresses reminiscent of the Greco-Roman era. They frequented balls called  Bals des victimes  and spoke in their own particular accent and vocabulary, avoiding to pronounce the letter R , as it was the first letter of the word Revolution        During the Directory, almost all the structures and rules of Paris society had been swept away, but no new structures and rules had yet been created to replace them. The ": null
    },
    {
        "brothers Goncourt": "brothers goncourt"
    },
    {
        " meticulously described the period on their Histoire de la société française pendant le Directoire. Caste and rank mattered far less; all the old titles and forms of address had disappeared, along with old customs and social conventions. Men no longer took off their hats when talking to women, and people of different ranks spoke to each other as equals. Society no longer met in private, in the houses of the nobility, but in public, at balls, restaurants and public gardens. As the Goncourts said, social anarchy reigned in Paris: everyone met with everyone. Government ministers could be seen walking or dining with actresses, bankers with courtesans.     Liaisons were easy , the Goncourts reported, marriage less so. The old system of marriages arranged between families based on fortune, profession, and social condition was less common. Marriages were no longer controlled by the church, but by the new civil code, which described marriage as nature in action. Marriage was seen as a temporary, not a permanent state. Children born outside of marriage were given equal status concerning inheritance and other legal matters as those born to married couples. Divorce was much simpler, and could be requested by either the husband or wife. In one period of fifteen months, 42 civil law divorces were granted in Paris, of which 42 were requested by the wife. Of 42 divorces granted on the grounds of incompatibility of humor , 42 were requested by the wife. The new system also led to a large increase in the number of children born outside of marriage and not wanted; in 42 four thousand unwanted children in the Department of the Seine were turned over to founding hospitals.     The breakdown of the old system of arranged marriages led to the creation of the first newspaper where men and women could advertise themselves for suitable spouses, called the Indicateur des marriages. it also led to the establishment of the first marriage bureaus. A businessman named Liardot rented a large former mansion, brought in selected eligible young women as paying guests, and invited men seeking wives to meet them at balls, concerts and card games each given at the house each evening. The men were screened by their profession and education.     Bals des victimes, pleasure gardens, new restaurants and cafés ": null
    },
    {
        "Reign of Terror": "reign of terror"
    },
    {
        ", Tissier, André, Les spectacles à Paris pendant la Révolution... de la proclamation de la République à la fin de la Convention nationale , publisher: Droz, 42 pp. 42–42 and further  after the death of Robespierre and the fall of the Jacobins, the city experienced a frenzy of dancing that lasted throughout the period of the French Directory. The Goncourt brothers reported that 42 balls took place in 42 alone. Several former monasteries were turned into ballrooms, including the ": null
    },
    {
        "Noviciate of the Jesuits": "professed house"
    },
    {
        ", the Monastère des Carmes ": null
    }
]