[
    {
        "           Freshwater is a ": null
    },
    {
        "national park": "national park"
    },
    {
        " in ": null
    },
    {
        "Queensland": "queensland"
    },
    {
        ", ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", 42  km north of ": null
    },
    {
        "Brisbane": "brisbane"
    },
    {
        ". The park is west of Redcliffe, near ": null
    },
    {
        "Deception Bay": "deception bay"
    },
    {
        ", within ": null
    },
    {
        "Caboolture Shire": "caboolture shire"
    },
    {
        ".     The parks vegetation is a remnant of the Open ": null
    },
    {
        "Sclerophyll": "sclerophyll"
    },
    {
        " Woodland which was once common in this area. The dominant ": null
    },
    {
        "tree": "tree"
    },
    {
        "s are  Eucalyptus  species, notably scribbly gum -  Eucalyptus racemosa  with smooth white trunks, and some  Angophora  species, while the ": null
    },
    {
        "shrub": "shrub"
    },
    {
        " layer varies from an Open Heath area dominated by low ": null
    },
    {
        "grasstrees": "xanthorrhoea"
    },
    {
        " in the south of the park, to dense  Casuarina  stands, and small ": null
    },
    {
        "swamp": "swamp"
    },
    {
        "y areas with paperbark trees . A small ": null
    },
    {
        "creek": "stream"
    },
    {
        " runs through the north end of the park.   Sighted in the Open Heath area are low growing plants such as the fringed lilly  Thysanotus tuberosus , tall sundew  Drosera peltata , which is a carnivorous plant, flat-stemmed cord rush  Eurychorda complanata  and Wallum grevillea  Grevillea leiophylla , which is a delicate pink flowered grevillea growing to only about 42  cm. This is only a small selection of the numerous beautiful plants to be found in this park.   This park is one of the few protected places of Open Woodland/Low Heathland in the area. Much of this type of vegetation has been cleared for development.     Though very small, and surrounded by development, roads and a highway, the park is rich with wildlife. In spring it teams with birds, most noticeable being the many species of ": null
    },
    {
        "honeyeater": "honeyeater"
    },
    {
        "s. Australian ": null
    },
    {
        "fairywren": "fairywren"
    },
    {
        "s such as the beautiful blue ": null
    },
    {
        "variegated fairywren": "variegated fairywren"
    },
    {
        " and the brilliant red and black ": null
    },
    {
        "red-backed fairywren": "red-backed fairywren"
    },
    {
        " both occur here. In a very large old ": null
    },
    {
        "gum tree": "gum tree"
    },
    {
        " wedge-tailed eagle": "wedge-tailed eagle"
    },
    {
        "s have made a nest, and the adults are often seen soaring over the park. Calls from ": null
    },
    {
        "white-throated gerygone": "white-throated gerygone"
    },
    {
        "s, ": null
    },
    {
        "spangled drongo": "spangled drongo"
    },
    {
        "s and ": null
    },
    {
        "rainbow bee-eater": "rainbow bee-eater"
    },
    {
        "s make a pleasant background sound in the park.     The ": null
    },
    {
        "invertebrate": "invertebrate"
    },
    {
        " fauna is rich, with many species of ": null
    },
    {
        "dragonflies": "dragonflies"
    },
    {
        " and ": null
    },
    {
        "damselflies": "damselflies"
    },
    {
        " being quite obvious in summer. The magnificent large dragonfly  Hemianax papuensis  hawks through the park all year long, while in summer the beautiful  Rhyothemis graphiptera , with wings barred with glistening dark purple, waft slowly along the tracks, and deep red  Diplacodes bipunctata ": null
    }
]