[
    {
        "      A fret is a raised element on the ": null
    },
    {
        "neck": "neck"
    },
    {
        " of a ": null
    },
    {
        "stringed instrument": "stringed instrument"
    },
    {
        ". Frets usually extend across the full width of the neck. On most modern ": null
    },
    {
        "western": "western culture"
    },
    {
        " fretted instruments, frets are ": null
    },
    {
        "metal": "metal"
    },
    {
        " strips inserted into the ": null
    },
    {
        "fingerboard": "fingerboard"
    },
    {
        ". On some historical instruments and non-European instruments, frets are made of pieces of string tied around the neck.     Frets divide the neck into fixed segments at intervals related to a ": null
    },
    {
        "music": "music"
    },
    {
        "al framework. On instruments such as ": null
    },
    {
        "guitar": "guitar"
    },
    {
        "s, each fret represents one ": null
    },
    {
        "semitone": "semitone"
    },
    {
        " in the standard western system, in which one ": null
    },
    {
        "octave": "octave"
    },
    {
        " is divided into twelve semitones. Fret is often used as a verb, meaning simply to press down the string behind a fret . Fretting often refers to the frets and/or their system of placement.       Pressing the string against the fret reduces the vibrating length of the string to that between the ": null
    },
    {
        "bridge": "bridge"
    },
    {
        " and the next fret between the fretting finger and the bridge. This is damped if the string were stopped with the soft fingertip on a ": null
    },
    {
        "fretless": "fretless"
    },
    {
        " fingerboard.     Frets make it much easier for a player to achieve an acceptable standard of ": null
    },
    {
        "intonation": "intonation"
    },
    {
        ", since the frets determine the positions for the correct notes. Furthermore, a fretted fingerboard makes it easier to play ": null
    },
    {
        "chords": "chord"
    },
    {
        " accurately.     A disadvantage of frets is that they restrict pitches to the ": null
    },
    {
        "temperament": "musical tuning"
    },
    {
        " defined by the fret positions. A player may still influence ": null
    },
    {
        "intonation": "intonation"
    },
    {
        ", however, by pulling the string to the side to increase string tension and raise the pitch. This technique  is often used by electric ": null
    },
    {
        "guitarist": "guitarist"
    },
    {
        "s of all genres, and is an important part of ": null
    },
    {
        "sitar": "sitar"
    },
    {
        " playing. On instruments with frets that are thicker off the fingerboard, string tension and pitch vary with finger pressure behind the fret. Sometimes a player can pull the string toward the bridge or ": null
    },
    {
        "nut": "nut"
    },
    {
        ", thus lowering or raising the string tension and pitch. However, except for instruments that accommodate extensive string pulling, like the sitar, much less influence on intonation is possible than on unfretted instruments.     Since the intonation of most modern western fretted instruments is ": null
    },
    {
        "equal tempered": "equal tempered"
    },
    {
        ", the ": null
    },
    {
        "ratio": "ratio"
    },
    {
        " of the distances of two consecutive frets to the bridge is \\sqrt , or approximately 42. Theoretically, the twelfth fret should divide the string in two exact halves. To compensate for the increase in string tension when the string is pressed against the frets, the bridge position is adjusted slightly so the 42th fret plays exactly in tune.        Many instruments frets are not spaced according to the ": null
    },
    {
        "semitone": "semitone"
    },
    {
        "s of ": null
    },
    {
        "equal temperament": "equal temperament"
    },
    {
        ", including the ": null
    },
    {
        "Appalachian dulcimer": "appalachian dulcimer"
    },
    {
        " , the Turkish ": null
    },
    {
        "Saz": "baglama"
    },
    {
        " , the Arabic ": null
    },
    {
        "Buzuq": "buzuq"
    },
    {
        " , and the Persian ": null
    },
    {
        "setar": "setar"
    },
    {
        " and ": null
    },
    {
        "tar": "tar"
    },
    {
        " , and the Turkish ": null
    },
    {
        "tanbur": "tanbur"
    },
    {
        " .       Fan frets , or ": null
    },
    {
        "multi-scale": "multi-scale fingerboard"
    },
    {
        ": while frets are generally ": null
    },
    {
        "perpendicular": "perpendicular"
    },
    {
        " to the instruments neck centerline and ": null
    },
    {
        "parallel": "parallel"
    },
    {
        " to each other, on a fanned fretboard, the frets are angled with only one center fret perpendicular to the neck’s centerline. This gives the lower-pitched strings more length and the higher strings shorter length .   The idea is to give more accurate tuning and deeper bass. Some think that fanned frets might be more ": null
    },
    {
        "ergonomic": "ergonomic"
    },
    {
        ".   Fanned frets first appeared on the 42th century ": null
    },
    {
        "Orpharion": "orpharion"
    },
    {
        ", a variant of the ": null
    },
    {
        "cittern": "cittern"
    },
    {
        ", tuned like a ": null
    },
    {
        "lute": "lute"
    },
    {
        ". John Starrett revived the idea in the late seventies on his innovative instrument, the Starrboard. Rickenbacker employed a slanted fret, but it was not multi scale, or fanned. ": null
    },
    {
        "Novax Guitars": "novax guitars"
    },
    {
        " among others offers such guitars today. The appearance of angled frets on these modern instruments belies the antiquity of this technique.     Scalloped fretboard: ": null
    },
    {
        "Scalloping": "scalloping"
    },
    {
        " involves removing some of the wood between some or all of the fret. This is intended to allow a lighter touch for more precise fingering, while easing bends or vibratos . It has some popularity with musicians playing ": null
    },
    {
        "heavy metal music": "heavy metal music"
    },
    {
        ", although the concept can also be seen in ancient instruments such as the ": null
    },
    {
        "sitar": "sitar"
    },
    {
        " Scalloped fretboards have not found widespread popularity because tonally accurate play requires a much lighter fretting hand than most guitarists can achieve, and often significantly heavier strings as well.     Fat frets: on older guitars , frets were typically made out of thin wire, and some electric guitar players replaced that with thicker wire, for fat frets or jumbo frets . Fat frets make bending easier, and they change the feel of the guitar. As well, large frets, offering more metal, remain playable much longer than thin frets. A side effect of a thicker fret is a less precise note, since the string is held over a wider surface, causing a slight inaccuracy of pitch, which increases in significance as frets wear.          It is also possible to find semi-fretted instruments; examples include the ": null
    },
    {
        "Malagasy": "music of madagascar"
    },
    {
        " kabosy and the ": null
    },
    {
        "Afghan Rubab": "rubab"
    },
    {
        ". Semi-fretted versions of guitars and other fretted string instruments, however, are usually one-off, custom adaptations made for players who want to combine elements of both types of sound. One arrangement is for the frets to extend only part of the way along the neck so that the higher notes can be played with the smooth expression possible with a fretless fingerboard. Another approach is the use of frets that extend only partway across the fretboard so that some courses of strings are fretted and others fretless, for example Ryszard Lateckis .       Instruments with straight frets like ": null
    },
    {
        "guitar": "guitar"
    },
    {
        "s require a special compensation on the saddle and nut. Every time a string is fretted it is also stretched, and as it stretches the string rises in ": null
    },
    {
        "pitch": "pitch"
    },
    {
        ", making all fretted tones sound sharp. When the saddle is positioned properly, however, the fretted tones all sound sharp to the same degree as long as the distances between the frets are correct. With the right nut compensation, the pitch of the unfretted string can be raised by the same amount. As a result, when the tension of the strings is lowered, the pitches of all notes, both fretted and unfretted, becomes correct.       On instruments equipped with steel strings, such as ": null
    },
    {
        "folk guitar": "folk guitar"
    },
    {
        "s and ": null
    },
    {
        "electric guitar": "electric guitar"
    },
    {
        "s, frets are eventually bound to wear down as the strings cut grooves into them. When this happens, the instrument may need refretting or, in less severe cases, fret dressing .   Often, a few fret dressings can be performed on a guitar before it requires complete refretting.     Tied gut frets, used on instruments such as the ": null
    },
    {
        "lute": "lute"
    },
    {
        " or ": null
    },
    {
        "viol": "viol"
    },
    {
        ", wear quickly, and must be replaced regularly.       Fret buzz is one of the many undesirable phenomena that can occur on a ": null
    },
    {
        "guitar": "guitar"
    },
    {
        " or similar ": null
    },
    {
        "stringed instrument": "stringed instrument"
    },
    {
        ". Fret buzz occurs when the vibrating part of one or more strings physically strikes the frets that are higher than the fretted note . This causes a buzzing sound on the guitar that can range from a small annoyance, to severe enough to dampen the note and greatly reduce ": null
    },
    {
        "sustain": "sustain"
    },
    {
        ". Sometimes, fret buzz can be so minimal that there is only a small change in the tone  of the note, without any noticeable buzzing. Fret buzz can be caused by different things:      Low ": null
    },
    {
        "action": "action"
    },
    {
        " Strings": "string"
    },
    {
        " too loose   Improper ": null
    },
    {
        "relief": "relief"
    },
    {
        " of ": null
    },
    {
        "guitar neck": "guitar neck"
    },
    {
        "     Fret buzz is evident in some famous recordings; an example is ": null
    },
    {
        "Friends": "friends"
    },
    {
        " by ": null
    },
    {
        "Led Zeppelin": "led zeppelin"
    },
    {
        " . In some songs, such as ": null
    },
    {
        "My Last Serenade": "my last serenade"
    },
    {
        " by ": null
    },
    {
        "Killswitch Engage": "killswitch engage"
    },
    {
        ", the guitars are tuned to ": null
    },
    {
        "Dropped C": "dropped c"
    },
    {
        " and the low tension of the strings is used to create fret buzz by the bass player in order to create a dirty sound.       Fret repair is a common job performed by ": null
    },
    {
        " luthiers": "luthier"
    },
    {
        " and ": null
    },
    {
        " guitar technicians": "guitar technician"
    },
    {
        ", though it is often necessary for all fretted instruments. There are many factors that can contribute to fret damage including regular wear, mishandling of the instrument, and ": null
    },
    {
        "humidity": "humidity"
    }
]