[
    {
        "     In ": null
    },
    {
        "Norse mythology": "norse mythology"
    },
    {
        ", Freyja  is a goddess associated with war, death, love, sex, beauty, fertility, gold, and ": null
    },
    {
        "seiðr": "seiðr"
    },
    {
        ". Freyja is the owner of the necklace ": null
    },
    {
        "Brísingamen": "brísingamen"
    },
    {
        ", rides a chariot pulled by two cats, is accompanied by the boar ": null
    },
    {
        "Hildisvíni": "hildisvíni"
    },
    {
        ", and possesses a cloak of ": null
    },
    {
        "falcon": "falcon"
    },
    {
        " feathers. By her husband ": null
    },
    {
        "Óðr": "óðr"
    },
    {
        ", she is the mother of two daughters, ": null
    },
    {
        "Hnoss": "hnoss"
    },
    {
        " and ": null
    },
    {
        "Gersemi": "gersemi"
    },
    {
        ". Along with her brother ": null
    },
    {
        "Freyr": "freyr"
    },
    {
        ", her father ": null
    },
    {
        "Njörðr": "njörðr"
    },
    {
        ", and her mother , she is a member of the ": null
    },
    {
        "Vanir": "vanir"
    },
    {
        ". Stemming from Old Norse Freyja, modern forms of the name include Freya, Freyia, and Freja.     Freyja rules over her heavenly field, ": null
    },
    {
        "Fólkvangr": "fólkvangr"
    },
    {
        ", where she receives half of those who die in battle. The other half go to the god ": null
    },
    {
        "Odins": "odin"
    },
    {
        "hall, ": null
    },
    {
        "Valhalla": "valhalla"
    },
    {
        ". Within Fólkvangr lies her hall, ": null
    },
    {
        "Sessrúmnir": "sessrúmnir"
    },
    {
        ". Freyja assists other deities by allowing them to use her feathered cloak, is invoked in matters of fertility and love, and is frequently sought after by powerful ": null
    },
    {
        "jötnar": "jötunn"
    },
    {
        " who wish to make her their wife. Freyjas husband, the god Óðr, is frequently absent. She cries tears of red gold for him, and searches for him under assumed names. Freyja has numerous names, including Gefn, Hörn, Mardöll, Sýr, Valfreyja, and Vanadís.     Freyja is attested in the  Poetic Edda , compiled in the 13th century from earlier traditional sources; in the  Prose Edda  and  Heimskringla , composed by ": null
    },
    {
        "Snorri Sturluson": "snorri sturluson"
    },
    {
        " in the 13th century; in several ": null
    },
    {
        "Sagas of Icelanders": "sagas of icelanders"
    },
    {
        "; in the short story  Sörla þáttr ; in the poetry of ": null
    },
    {
        "skald": "skald"
    },
    {
        "s; and into the modern age in ": null
    },
    {
        "Scandinavian folklore": "scandinavian folklore"
    },
    {
        ".     Scholars have debated whether Freyja and the goddess ": null
    },
    {
        "Frigg": "frigg"
    },
    {
        " ultimately stem from a single goddess common among the ": null
    },
    {
        "Germanic peoples": "germanic peoples"
    },
    {
        "; connected her to the ": null
    },
    {
        "valkyrie": "valkyrie"
    },
    {
        "s, female battlefield choosers of the slain; and analyzed her relation to other goddesses and figures in ": null
    },
    {
        "Germanic mythology": "germanic paganism"
    },
    {
        ", including the thrice-burnt and thrice-reborn ": null
    },
    {
        "Gullveig/Heiðr": "gullveig"
    },
    {
        ", the goddesses ": null
    },
    {
        "Gefjon": "gefjon"
    },
    {
        ", ": null
    },
    {
        "Skaði": "skaði"
    },
    {
        ", ": null
    },
    {
        "Þorgerðr Hölgabrúðr and Irpa": "þorgerðr hölgabrúðr and irpa"
    },
    {
        ", ": null
    },
    {
        "Menglöð": "menglöð"
    },
    {
        ", and the 1st century CE ": null
    },
    {
        " Isis of the Suebi": "isis   of the suebi"
    },
    {
        ". Freyjas name appears in numerous place names in Scandinavia, with a high concentration in southern ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ". Various plants in Scandinavia once bore her name, but it was replaced with the name of the ": null
    },
    {
        "Virgin Mary": "mary"
    },
    {
        " during the process of ": null
    },
    {
        "Christianization": "christianization of scandinavia"
    },
    {
        ". Rural Scandinavians continued to acknowledge Freyja as a supernatural figure into the 19th century, and Freyja has inspired various works of art.       The name Freyja transparently means lady and ultimately derives from ": null
    },
    {
        "Proto-Germanic": "proto-germanic"
    },
    {
        "  frawōn . Freyja is ": null
    },
    {
        "cognate": "cognate"
    },
    {
        " with, for example, ": null
    },
    {
        "Old Saxon": "old saxon"
    },
    {
        " frūa lady, mistress and ": null
    },
    {
        "Old High German": "old high german"
    },
    {
        " frouwa . Orel . The ": null
    },
    {
        "theonym": "theonym"
    },
    {
        " Freyja is thus considered to have been an ": null
    },
    {
        "epithet": "epitheton"
    },
    {
        " in origin, replacing a personal name that is now unattested. Grundy . As a result, either the original name became entirely ": null
    },
    {
        "taboo": "word taboo"
    },
    {
        " or another process occurred in which the goddess is a duplicate or hypostasis of another known goddess .     In addition to Freyja, Old Norse sources refer to the goddess by the following names:            Poetic Edda Poetic Edda , Freyja is mentioned or appears in the poems  Völuspá ,  Grímnismál ,  Lokasenna ,  Þrymskviða ,  Oddrúnargrátr , and  Hyndluljóð .     Völuspá contains a stanza that mentions Freyja, referring to her as Óðs girl ; Freyja being the wife of her husband, ": null
    },
    {
        "Óðr": "óðr"
    },
    {
        ". The stanza recounts that Freyja was once promised to an unnamed builder, later revealed to be a ": null
    },
    {
        "jötunn": "jötunn"
    },
    {
        " and subsequently killed by ": null
    },
    {
        "Thor": "thor"
    },
    {
        " . In the poem  Grímnismál , Odin  tells the young ": null
    },
    {
        "Agnar": "agnarr geirröðsson"
    },
    {
        " that every day Freyja allots seats to half of those that are slain in her hall ": null
    },
    {
        "Fólkvangr": "fólkvangr"
    },
    {
        ", while Odin owns the other half.        In the poem  Lokasenna , where Loki accuses nearly every female in attendance of promiscuity or unfaithfulness, an aggressive exchange occurs between ": null
    },
    {
        "Loki": "loki"
    },
    {
        " and Freyja. The introduction to the poem notes that among other gods and goddesses, Freyja attends a celebration held by ": null
    },
    {
        "Ægir": "ægir"
    },
    {
        ". In verse, after Loki has ": null
    },
    {
        "flyted": "flyting"
    },
    {
        " with the goddess ": null
    },
    {
        "Frigg": "frigg"
    },
    {
        ", Freyja interjects, telling Loki that he is insane for dredging up his terrible deeds, and that Frigg knows the ": null
    },
    {
        "fate of everyone": "wyrd"
    },
    {
        ", though she does not tell it. Loki tells her to be silent, and says that he knows all about her—that Freyja is not lacking in blame, for each of the gods and ": null
    },
    {
        "elves": "elf"
    },
    {
        " in the hall have been her lover. Freyja objects. She says that Loki is lying, that he is just looking to blather about misdeeds, and since the gods and goddesses are furious at him, he can expect to go home defeated. Loki tells Freyja to be silent, calls her a malicious witch, and conjures a scenario where Freyja was once astride her brother when all of the gods, laughing, surprised the two. Njörðr interjects—he says that a woman having a lover other than her husband is harmless, and he points out that Loki has borne children, and calls Loki a pervert. The poem continues in turn.     The poem Þrymskviða features Loki borrowing Freyjas cloak of feathers and Thor dressing up as Freyja to fool the lusty ": null
    },
    {
        "jötunn": "jötunn"
    },
    {
        " Þrymr": "þrymr"
    },
    {
        ". In the poem, Thor wakes up to find that his powerful hammer, ": null
    },
    {
        "Mjöllnir": "mjöllnir"
    },
    {
        ", is missing. Thor tells Loki of his missing hammer, and the two go to the beautiful court of Freyja. Thor asks Freyja if she will lend him her cloak of feathers, so that he may try to find his hammer. Freyja agrees:             Loki flies away in the whirring feather cloak, arriving in the land of ": null
    },
    {
        "Jötunheimr": "jötunheimr"
    },
    {
        ". He spies ": null
    },
    {
        "Þrymr": "þrymr"
    },
    {
        " sitting on top of a ": null
    },
    {
        "mound": "tumulus"
    },
    {
        ". Þrymr reveals that he has hidden Thors hammer deep within the earth and that no one will ever know where the hammer is unless Freyja is brought to him as his wife. Loki flies back, the cloak whistling, and returns to the courts of the gods. Loki tells Thor of Þrymrs conditions.     The two go to see the beautiful Freyja. The first thing that Thor says to Freyja is that she should dress herself and put on a brides ": null
    },
    {
        "head-dress": "headgear"
    },
    {
        ", for they shall drive to Jötunheimr. At that, Freyja is furious—the halls of the gods shake, she snorts in anger, and from the goddess the necklace ": null
    },
    {
        "Brísingamen": "brísingamen"
    },
    {
        " falls. Indignant, Freyja responds:          The gods and goddesses assemble at a ": null
    },
    {
        "thing": "thing"
    },
    {
        " and debate how to solve the problem. The god ": null
    },
    {
        "Heimdallr": "heimdallr"
    },
    {
        " proposes to dress Thor up as a bride, complete with bridal dress, head-dress, jingling keys, jewelry, and the famous Brísingamen. Thor objects but is hushed by Loki, reminding him that the new owners of the hammer will soon be settling in the land of the gods if the hammer isnt returned. Thor is dressed as planned and Loki is dressed as his maid. Thor and Loki go to Jötunheimr.     In the meantime, Thrym tells his servants to prepare for the arrival of the daughter of ": null
    },
    {
        "Njörðr": "njörðr"
    },
    {
        ". When Freyja arrives in the morning, Thrym is taken aback by her behavior; her immense appetite for food and ": null
    },
    {
        "mead": "mead"
    },
    {
        " is far more than what he expected, and when Thrym goes in for a kiss beneath Freyjas veil, he finds her eyes to be terrifying, and he jumps down the hall. The disguised Loki makes excuses for the brides odd behavior, claiming that she simply has not eaten or slept for eight days. In the end, the disguises successfully fool the jötnar and, upon sight of it, Thor regains his hammer by force.     In the poem  Oddrúnargrátr , ": null
    },
    {
        "Oddrún": "oddrún"
    },
    {
        " helps ": null
    },
    {
        "Borgny": "borgny"
    },
    {
        " give birth to twins. In thanks, Borgny invokes ": null
    },
    {
        "vættir": "vættir"
    },
    {
        ", Frigg, Freyja, and other unspecified deities.           Freyja is a main character in the poem  Hyndluljóð , where she assists her faithful servant ": null
    },
    {
        "Óttar": "óttar"
    },
    {
        " in finding information about his ancestry so that he may claim his inheritance. In doing so, Freyja turns Óttar into her boar, ": null
    },
    {
        "Hildisvíni": "hildisvíni"
    },
    {
        ", and, by means of flattery and threats of death by fire, Freyja successfully pries the information that Óttar needs from the jötunn ": null
    },
    {
        "Hyndla": "hyndla"
    },
    {
        ". Freyja speaks throughout the poem, and at one point praises Óttar for constructing a ": null
    },
    {
        "hörgr": "hörgr"
    },
    {
        " and frequently making ": null
    },
    {
        "blót": "blót"
    },
    {
        " to her:            Prose Edda Prose Edda  books  Gylfaginning  and  Skáldskaparmál . In chapter 24 of Gylfaginning, the enthroned figure of ": null
    },
    {
        "High": "high, just-as-high, and third"
    },
    {
        " says that after the god ": null
    },
    {
        "Njörðr": "njörðr"
    },
    {
        " split with the goddess ": null
    },
    {
        "Skaði": "skaði"
    },
    {
        ", he had two beautiful and mighty children ; a son, ": null
    },
    {
        "Freyr": "freyr"
    },
    {
        ", and a daughter, Freyja. Freyr is the most glorious of the gods, and Freyja the most glorious of the goddesses. Freyja has a dwelling in the heavens, ": null
    },
    {
        "Fólkvangr": "fólkvangr"
    },
    {
        ", and that whenever Freyja rides into battle she gets half the slain, and the other half to Odin . In support, High quotes the Grímnismál stanza mentioned in the Poetic Edda section above.     High adds that Freyja has a large, beautiful hall called ": null
    },
    {
        "Sessrúmnir": "sessrúmnir"
    },
    {
        ", and that when Freyja travels she sits in a chariot and drives two cats, and that Freyja is the most approachable one for people to pray to, and from her name is derived the honorific title whereby noble ladies are called fruvor . High adds that Freyja has a particular fondness for love songs, and that it is good to pray to her concerning love affairs .     In chapter 29, High recounts the names and features of various goddesses, including Freyja. Regarding Freyja, High says that, next to Frigg, Freyja is highest in rank among them and that she owns the necklace Brísingamen. Freyja is married to ": null
    },
    {
        "Óðr": "óðr"
    },
    {
        ", who goes on long travels, and the two have a very fair daughter by the name of ": null
    },
    {
        "Hnoss": "hnoss"
    },
    {
        ". While Óðr is absent, Freyja stays behind and in her sorrow she weeps tears of red gold. High notes that Freyja has many names, and explains that this is because Freyja adopted them when looking for Óðr and traveling among strange peoples . These names include Gefn, Hörn, Mardöll, Sýr, and Vanadís.     Freyja plays a part in the events leading to the birth of ": null
    },
    {
        "Sleipnir": "sleipnir"
    },
    {
        ", the eight-legged horse. In chapter 42, High recounts that, soon after the gods built the hall ": null
    },
    {
        "Valhalla": "valhalla"
    },
    {
        ", a builder came to them and offered to build for them in three seasons a fortification so solid that no ": null
    },
    {
        "jötunn": "jötunn"
    },
    {
        " would be able to come in over from ": null
    },
    {
        "Midgard": "midgard"
    },
    {
        ". In exchange, the builder wants Freyja for his bride, and the ": null
    },
    {
        "sun": "sól"
    },
    {
        " and the ": null
    },
    {
        "moon": "máni"
    },
    {
        ". After some debate the gods agree, but with added conditions. In time, just as he is about to complete his work, it is revealed that the builder is, in fact, himself a jötunn, and he is killed by Thor. In the meantime, Loki, in the form of a mare, has been impregnated by the jötunns horse, ": null
    },
    {
        "Svaðilfari": "svaðilfari"
    },
    {
        ", and so gives birth to Sleipnir. In support, High quotes the  Völuspá  stanza that mentions Freyja. In chapter 49, High recalls the funeral of ": null
    },
    {
        "Baldr": "baldr"
    },
    {
        " and says that Freyja attended the funeral and there drove her cat-chariot, the final reference to the goddess in Gylfaginning.      At the beginning of the book  Skáldskaparmál , Freyja is mentioned among eight goddesses attending a banquet held for ": null
    },
    {
        "Ægir": "ægir"
    },
    {
        ". Chapter 56 details the abduction of the goddess ": null
    },
    {
        "Iðunn": "iðunn"
    },
    {
        " by the jötunn ": null
    },
    {
        "Þjazi": "þjazi"
    },
    {
        " in the form of an eagle. Terrified at the prospect of death and torture due to his involvement in the abduction of Iðunn, Loki asks if he may use Freyjas falcon shape to fly north to ": null
    },
    {
        "Jötunheimr": "jötunheimr"
    },
    {
        " and retrieve the missing goddess. Freyja allows it, and using her falcon shape and a furious chase by eagle-Þjazi, Loki successfully returns her.     In chapter 6, a means of referring to Njörðr is provided that refers to Frejya . In chapter 7, a means of referring to Freyr is provided that refers to the goddess . In chapter 8, ways of referring to the god ": null
    },
    {
        "Heimdallr": "heimdallr"
    },
    {
        " are provided, including Lokis enemy, recoverer of Freyjas necklace , inferring a myth involving Heimdallr recovering Freyjas necklace from Loki.     In chapter 17, the jötunn ": null
    },
    {
        "Hrungnir": "hrungnir"
    },
    {
        " finds himself in Asgard, the realm of the gods, and becomes very drunk. Hrungnir boasts that he will move Valhalla to Jötunheimr, bury Asgard, and kill all of the gods—with the exception of the goddesses Freyja and Sif, who he says he will take home with him. Freyja is the only one of them that dares to bring him more to drink. Hrungnir says that he will drink all of their ale. After a while, the gods grow bored of Hrungnirs antics and invoke the name of Thor. Thor immediately enters the hall, hammer raised. Thor is furious and demands to know who is responsible for letting a jötunn in to Asgard, who guaranteed Hrungnir safety, and why Freyja should be serving him drink as if at the ": null
    },
    {
        "Æsirs": "æsir"
    },
    {
        "banquet .     In chapter 18, verses from the 10th century ": null
    },
    {
        "skalds": "skald"
    },
    {
        "composition  Þórsdrápa  are quoted. A ": null
    },
    {
        "kenning": "kenning"
    },
    {
        " used in the poem refers to Freyja. In chapter 20, poetic ways to refer to Freyja are provided; daughter of Njörðr , sister of Freyr , wife of Óðr , mother of Hnoss , possessor of the fallen slain and of Sessrumnir and tom-cats , possessor of Brísingamen, Van-deity , Vanadís, and fair-tear deity . In chapter 32, poetic ways to refer to gold are provided, including Freyjas weeping and rain or shower from Freyjas eyes .     Chapter 33 tells that once the gods journeyed to visit ": null
    },
    {
        "Ægir": "ægir"
    },
    {
        ", one of whom was Freyja. In chapter 49, a quote from a work by the skald ": null
    },
    {
        "Einarr Skúlason": "einarr skúlason"
    },
    {
        " employs the kenning Óðrs bedfellows eye-rain , which refers to Freyja and means gold .     Chapter 36 explains again that gold can be referring to as Freyjas weeping due to her red gold tears. In support, works by the skalds ": null
    },
    {
        "Skúli Þórsteinsson": "skúli þórsteinsson"
    },
    {
        " and Einarr Skúlason are cited that use Freyjas tears or Freyjas weepings to represent gold . The chapter features additional quotes from poetry by Einarr Skúlason that references the goddess and her child Hnoss. Freyja receives a final mention in the Prose Edda in chapter 75, where a list of goddesses is provided that includes Freyja.     Heimskringla   The  Heimskringla  book  Ynglinga saga  provides a ": null
    },
    {
        "euhemerized": "euhemerism"
    },
    {
        " account of the origin of the gods, including Freyja. In chapter 4, Freyja is introduced as a member of the Vanir, the sister of Freyr, and the daughter of Njörðr and his sister . After the ": null
    },
    {
        "Æsir–Vanir War": "æsir–vanir war"
    },
    {
        " ends in a stalemate, Odin appoints Freyr and Njörðr as priests over sacrifices. Freyja becomes the priestess of sacrificial offerings and it was she who introduced the practice of ": null
    },
    {
        "seiðr": "seiðr"
    },
    {
        " to the Æsir, previously only practiced by the Vanir.     In chapter 10, Freyjas brother Freyr dies, and Freyja is the last survivor among the Æsir and Vanir. Freyja keeps up the sacrifices and becomes famous. The saga explains that, due to Freyjas fame, all women of rank become known by her name—frúvor , a woman who is the mistress of her property is referred to as freyja, and húsfreyja for a woman who owns an estate.     The chapter adds that not only was Freyja very clever, but that she and her husband ": null
    },
    {
        "Óðr": "óðr"
    },
    {
        " had two immensely beautiful daughters, ": null
    },
    {
        "Gersemi": "gersemi"
    },
    {
        " and ": null
    },
    {
        "Hnoss": "hnoss"
    },
    {
        ", who gave their names to our most precious possessions .          Freyja is mentioned in the ": null
    },
    {
        "sagas": "saga"
    },
    {
        "  Egils saga ,  Njáls saga ,  Hálfs saga ok Hálfsrekka , and in  Sörla þáttr .     ;Egils saga   In  Egils saga , when ": null
    },
    {
        "Egill Skallagrímsson": "egill skallagrímsson"
    },
    {
        " refuses to eat, his daughter Þorgerðr says she will go without food and thus starve to death, and in doing so will meet the goddess Freyja:     :Thorgerd replied in a loud voice, I have had no evening meal, nor will I do so until I join Freyja. I know no better course of action than my fathers. I do not want to live after my father and brother are dead.        ;Hálfs saga ok Hálfsrekka   In the first chapter of the 14th century ": null
    },
    {
        "legendary saga": "legendary saga"
    },
    {
        " Hálfs saga ok Hálfsrekka, King Alrek has two wives, Geirhild and Signy, and cannot keep them both. He tells the two women that he would keep whichever of them that brews the better ale for him by the time he has returned home in the summer. The two compete and during the brewing process Signy prays to Freyja and Geirhild to Hött , a man she had met earlier . Hött answers her prayer and spits on her yeast. Signys brew wins the contest.      ;Sörla þáttr   In  Sörla þáttr , a short, late 14th century narrative from a later and extended version of the  Óláfs saga Tryggvasonar  found in the  Flateyjarbók  manuscript, an euhmerized account of the gods is provided. In the account, Freyja is described as having been a concubine of Odin, who bartered sex to four dwarfs for a golden necklace. In the work, the ": null
    },
    {
        "Æsir": "æsir"
    },
    {
        " once lived in a city called ": null
    },
    {
        "Asgard": "asgard"
    },
    {
        ", located in a region called Asialand or Asiahome . Odin was the king of the realm, and made ": null
    },
    {
        "Njörðr": "njörðr"
    },
    {
        " and ": null
    },
    {
        "Freyr": "freyr"
    },
    {
        " temple priests. Freyja was the daughter of Njörðr, and was Odins concubine. Odin deeply loved Freyja, and she was the fairest of woman of that day . Freyja had a beautiful ": null
    },
    {
        "bower": "boudoir"
    },
    {
        ", and when the door was shut no one could enter without Freyjas permission.     Chapter 1 records that one day Freyja passed by an open stone where ": null
    },
    {
        "dwarfs": "dwarf"
    },
    {
        " lived. Four dwarfs were smithying a golden necklace, and it was nearly done. Looking at the necklace, the dwarfs thought Freyja to be most fair, and she the necklace. Freyja offered to buy the collar from them with silver and gold and other items of value. The dwarfs said that they had no lack of money, and that for the necklace the only thing she could offer them would be a night with each of them. Whether she liked it better or worse , Freyja agreed to the conditions, and so spent a night with each of the four dwarfs. The conditions were fulfilled and the necklace was hers. Freyja went home to her bower as if nothing happened.     As related in chapter 2, Loki, under the service of Odin, found out about Freyjas actions and told Odin. Odin told Loki to get the necklace and bring it to him. Loki said that since no one could enter Freyjas bower against her will, this wouldnt be an easy task, yet Odin told him not to come back until he had found a way to get the necklace. Howling, Loki turned away and went to Freyjas bower but found it locked, and that he couldnt enter. So Loki transformed himself into a fly, and after having trouble finding even the tiniest of entrances, he managed to find a tiny hole at the gable-top, yet even here he had to squeeze through to enter.     Having made his way into Freyjas chambers, Loki looked around to be sure that no one was awake, and found that Freyja was asleep. He landed on her bed and noticed that she was wearing the necklace, the clasp turned downward. Loki turned into a ": null
    },
    {
        "flea": "flea"
    },
    {
        " and jumped onto Freyjas cheek and there bit her. Freyja stirred, turning about, and then fell asleep again. Loki removed his fleas shape and undid her collar, opened the bower, and returned to Odin.     The next morning Freyja woke and saw that the doors to her bower were open, yet unbroken, and that her precious necklace was gone. Freyja had an idea of who was responsible. She got dressed and went to Odin. She told Odin of the malice he had allowed against her and of the theft of her necklace, and that he should give her back her jewelry.     Odin said that, given how she obtained it, she would never get it back. That is, with one exception: she could have it back if she could make two kings, themselves ruling twenty kings each, battle one another, and cast a spell so that each time one of their numbers falls in battle, they will again spring up and fight again. And that this must go on eternally, unless a ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " man of a particular stature goes into the battle and smites them, only then will they stay dead. Freyja agreed.          Although the ": null
    },
    {
        "Christianization of Scandinavia": "christianization of scandinavia"
    },
    {
        " sought to ": null
    },
    {
        "demonize": "demonization"
    },
    {
        " the native gods, belief and reverence in the gods, including Freyja, remained into the modern period and melded into ": null
    },
    {
        "Scandinavian folklore": "scandinavian folklore"
    },
    {
        ".  comments that Freyja became a particular target under Christianization:     :Freyjas erotic qualities became an easy target for the new religion, in which an asexual virgin was the ideal woman Freyja is called a whore and a harlot by the holy men and missionaries, whereas many of her functions in the everyday lives of men and women, such as protecting the vegetation and supplying assistance in childbirth were transferred to the Virgin Mary.       However, Freyja did not disappear. In Iceland, Freyja was called upon for assistance by way of ": null
    },
    {
        "Icelandic magical staves": "icelandic magical staves"
    },
    {
        " as late as the 18th century; and as late as the 19th century, Freyja is recorded as retaining elements of her role as a fertility goddess among rural Swedes. For Freyja in Iceland, see . For Freyja in Sweden, see .     The Old Norse poem Þrymskviða continued into Scandinavian folk song tradition, where it was ": null
    },
    {
        "euhemerized": "euhemerized"
    },
    {
        " and otherwise transformed over time. In Iceland, the poem became known as Þrylur, whereas in Denmark the poem became Thor af Havsgaard and in Sweden it became Torvisan or Hammarhämtningen. A section of the Swedish Torvisan, in which Freyja has been transformed into the fair  Frojenborg, reads as follows:            In the province of ": null
    },
    {
        "Småland": "småland"
    },
    {
        ", Sweden, an account is recorded connecting Freyja with sheet lightning in this respect. Writer Johan Alfred Göth recalled a Sunday in 1880 where men were walking in fields and looking at nearly ripened ": null
    },
    {
        "rye": "rye"
    },
    {
        ", where Måns in Karryd said: Now Freyja is out watching if the rye is ripe . Along with this, Göth recalls another mention of Freyja in the countryside:     :When as a boy I was visiting the old Proud-Katrina, I was afraid of lightning like all boys in those days. When the ": null
    },
    {
        "sheet lightning": "lightningobservational variations"
    },
    {
        " flared at the night, Katrina said: Dont be afraid little child, it is only Freyja who is out making fire with steel and flintstone to see if the rye is ripe. She is kind to people and she is only doing it to be of service, she is not like Thor, he slays both people and livestock, when he is in the mood I later heard several old folks talk of the same thing in the same way.       In ": null
    },
    {
        "Värend": "värend"
    },
    {
        ", Sweden, Freyja could also arrive at Christmas night and she used to shake the apple trees for the sake of a good harvest and consequently people left some apples in the trees for her sake. However, it was dangerous to leave the ": null
    },
    {
        "plough": "plough"
    },
    {
        " outdoors, because if Freyja sat on it, it would no longer be of any use.          Several plants were named after Freyja, such as Freyjas tears and Freyjas hair , but during the process of Christianization, the name of the goddess was replaced with that of the ": null
    },
    {
        "Virgin Mary": "virgin mary"
    },
    {
        ". In the pre-Christian period, the ": null
    },
    {
        "Orion": "orion"
    },
    {
        " constellation": "constellation"
    },
    {
        " was called either Friggs distaff or Freyjas ": null
    },
    {
        "distaff": "distaff"
    },
    {
        " .     Place names in ": null
    },
    {
        "Norway": "norway"
    },
    {
        " and ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        " reflect devotion to the goddess, including the Norwegian place name ": null
    },
    {
        "Frøihov": "frøihov"
    },
    {
        "  and Swedish place names such as ": null
    },
    {
        "Frövi": "frövi"
    },
    {
        " .  and . In a survey of toponyms in Norway, M. Olsen tallies at least 20 to 30 location names compounded with Freyja. Three of these place names appear to derive from Freyjuhof , whereas the goddesss name is frequently otherwise compounded with words for meadow  and similar land formations. These toponyms are attested most commonly on the west coast though a high frequency is found in the southeast.     Place names containing Freyja are yet more numerous and varied in Sweden, where they are widely distributed. A particular concentration is recorded in Uppland, among which a number derive from the above-mentioned Freyjuvé and also Freyjulundr , place names that indicate public worship of Freyja. In addition, a variety of place names  have been seen as containing an element cognate to Gothic alhs and Old English ealh , although these place names may be otherwise interpreted. In addition, Frejya appears as a compound element with a variety of words for geographic features such as fields, meadows, lakes, and natural objects such as rocks.     The Freyja name Hörn appears in the Swedish place names ": null
    },
    {
        "Härnevi": "härnevi"
    },
    {
        " and ": null
    },
    {
        "Järnevi": "järnevi"
    },
    {
        ", stemming from the reconstructed Old Norse place name Hörnar-vé .  and .          A ": null
    },
    {
        "priestess": "völva"
    },
    {
        " was buried  with considerable splendour in Hagebyhöga in ": null
    },
    {
        "Östergötland": "östergötland"
    },
    {
        ". In addition to being buried with her ": null
    },
    {
        "wand": "wand"
    },
    {
        ", she had received great riches which included horses, a wagon and an Arabian bronze pitcher. There was also a silver pendant, which represents a woman with a broad necklace around her neck. This kind of necklace was only worn by the most prominent women during the Iron Age and some have interpreted it as Freyjas necklace Brísingamen. The pendant may represent Freyja herself. Harrison, D. & Svensson, K. . Vikingaliv. Fälth & Hässler, Värnamo.  p.58     A 7th-century ": null
    },
    {
        "phalara": "phalera"
    },
    {
        " found in a warrior grave in what is now ": null
    },
    {
        "Eschwege": "eschwege"
    },
    {
        " in northwestern Germany features a female figure with two large braids flanked by two cat-like beings and holding a staff-like object. This figure has been interpreted as Freyja. This image may be connected to various B-type ": null
    },
    {
        "bracteate": "bracteate"
    },
    {
        "s, referred to as the ": null
    },
    {
        "Fürstenberg-type": "fürstenberg-type"
    },
    {
        ", that may also depict the goddess; they show a female figure, in a short skirt and double-looped hair, holding a stave or sceptre in her right hand and a double-cross feature in the left .     A 12th century depiction of a cloaked but otherwise nude woman riding a large cat appears on a wall in the ": null
    },
    {
        "Schleswig Cathedral": "schleswig cathedral"
    },
    {
        " in ": null
    },
    {
        "Schleswig-Holstein": "schleswig-holstein"
    },
    {
        ", ": null
    },
    {
        "Northern Germany": "northern germany"
    },
    {
        ". Beside her is similarly a cloaked yet otherwise nude woman riding a ": null
    },
    {
        "distaff": "distaff"
    },
    {
        ". Due to iconographic similarities to the literary record, these figures have been theorized as depictions of Freyja and Frigg respectively.           Due to numerous similarities, scholars have frequently connected Freyja with the goddess ": null
    },
    {
        "Frigg": "frigg"
    },
    {
        ". The connection with Frigg and question of possible earlier identification of Freyja with Frigg in the ": null
    },
    {
        "Proto-Germanic": "common germanic deities"
    },
    {
        " period  remains a matter of scholarly discourse. Regarding a Freyja-Frigg common origin hypothesis, scholar ": null
    },
    {
        "Stephan Grundy": "stephan grundy"
    },
    {
        " comments, the problem of whether Frigg or Freyja may have been a single goddess originally is a difficult one, made more so by the scantiness of pre-": null
    },
    {
        "Viking Age": "viking age"
    },
    {
        " references to ": null
    },
    {
        "Germanic goddesses": "list of germanic deities and heroes"
    },
    {
        ", and the diverse quality of the sources. The best that can be done is to survey the arguments for and against their identity, and to see how well each can be supported.      Like the name of the group of gods to which Freyja belongs, the ": null
    },
    {
        "Vanir": "vanir"
    },
    {
        ", the name Freyja is not attested outside of ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        ", as opposed to the name of the goddess Frigg, who is attested as a goddess common among the Germanic peoples, and whose name is reconstructed as ": null
    },
    {
        "Proto-Germanic": "proto-germanic"
    },
    {
        "  Frijjō . Similar proof for the existence of a common Germanic goddess from which Freyja descends does not exist, but scholars have commented that this may simply be due to lack of evidence.     In the Poetic Edda poem Völuspá, a figure by the name of ": null
    },
    {
        "Gullveig": "gullveig"
    },
    {
        " is burnt three times yet is three times reborn. After her third rebirth, she is known as ": null
    },
    {
        "Heiðr": "heiðr"
    },
    {
        ". This event is generally accepted as precipitating the ": null
    },
    {
        "Æsir–Vanir War": "æsir–vanir war"
    },
    {
        ". Starting with scholar ": null
    },
    {
        "Gabriel Turville-Petre": "gabriel turville-petre"
    },
    {
        ", scholars such as ": null
    },
    {
        "Rudolf Simek": "rudolf simek"
    },
    {
        ", ": null
    },
    {
        "Andy Orchard": "andy orchard"
    },
    {
        ", and ": null
    },
    {
        "John Lindow": "john lindow"
    },
    {
        " have theorized that Gullveig/Heiðr is the same figure as Freyja, and that her involvement with the Æsir somehow led to the events of the Æsir–Vanir War. , , and .     Outside of theories connecting Freyja with the goddess Frigg, some scholars, such as ": null
    },
    {
        "Hilda Ellis Davidson": "hilda ellis davidson"
    },
    {
        " and , have theorized that other goddesses in Norse mythology, such as ": null
    },
    {
        "Gefjon": "gefjon"
    },
    {
        ", ": null
    },
    {
        "Gerðr": "gerðr"
    },
    {
        ", and ": null
    },
    {
        "Skaði": "skaði"
    },
    {
        ", may be forms of Freyja in different roles or ages.       Freyja and her afterlife field ": null
    },
    {
        "Fólkvangr": "fólkvangr"
    },
    {
        ", where she receives half of the slain, have been theorized as connected to the valkyries. Scholar Britt-Mari Näsström points out the description in Gylfaginning where it is said of Freyja that whenever she rides into battle she takes half of the slain , and interprets Fólkvangr as the field of the Warriors . Näsström notes that, just like Odin, Freyja receives slain heroes who have died on the battlefield, and that her house is ": null
    },
    {
        "Sessrumnir": "sessrumnir"
    },
    {
        " , a dwelling that Näsström posits likely fills the same function as Valhalla. Näsström comments that still, we must ask why there are two heroic paradises in the Old Norse view of afterlife. It might possibly be a consequence of different forms of initiation of warriors, where one part seemed to have belonged to Óðinn and the other to Freyja. These examples indicate that Freyja was a war-goddess, and she even appears as a valkyrie, literally the one who chooses the slain.      Siegfried Andres Dobat comments that in her mythological role as the chooser of half the fallen warriors for her death realm Fólkvangr, the goddess Freyja, however, emerges as the mythological role model for the Valkyrjar  and the ": null
    },
    {
        "dísir": "dísir"
    },
    {
        ".        ": null
    },
    {
        "Gustav Neckel": "gustav neckel"
    },
    {
        ", writing in 1920, connects Freyja to the ": null
    },
    {
        "Phrygian": "phyrgia"
    },
    {
        " goddess ": null
    },
    {
        "Cybele": "cybele"
    },
    {
        ". According to Neckel, both goddesses can be interpreted as fertility goddesses and other potential resemblances have been noted. Some scholars have suggested that the image of Cybele subsequently influenced the iconography of Freyja, the lions drawing the formers chariot becoming large cats. These observations became an extremely common observation in works regarding Old Norse religion until at least the early 1990s. In her book-length study of scholarship on the topic of Freyja, Britt-Mari Näsström is highly critical of this deduction; Näsström says that these parallels are due to sheer ignorance about the characteristics of Cybele; scholars have not troubled to look into the resemblances and differences between the two goddesses, if any, in support for their arguments for a common origin.           Into the modern period, Freyja was treated as a Scandinavian counterpart to the Roman Venus in, for example, Swedish literature, where the goddess may be associated with romantic love or, conversely, simply as a synonym for lust and potency . In the 18th century, Swedish poet ": null
    },
    {
        "Carl Michael Bellman": "carl michael bellman"
    },
    {
        " referred to ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        " prostitutes in his  Fredmans Epistles  as the children of Fröja . In the 19th century, Britt-Mari Näsström observes, Swedish Romanticism focused less on Freyjas erotic qualities and more on the image of the pining goddess, weeping for her husband .     Freyja is mentioned in the first stanza of the civil ": null
    },
    {
        "national anthem": "national anthem"
    },
    {
        " of Denmark,  Der er et yndigt land , written by 19th century Danish poet ": null
    },
    {
        "Adam Gottlob Oehlenschläger": "adam gottlob oehlenschläger"
    },
    {
        " in 1819. In addition, Oehlenschläger wrote a comedy entitled Freyjas alter and a poem Freais sal featuring the goddess.     The 19th century German composer ": null
    },
    {
        "Richard Wagners": "richard wagner"
    },
    {
        "  Der Ring des Nibelungen  opera cycle features Freia, the goddess Freyja combined with the apple-bearing goddess ": null
    },
    {
        "Iðunn": "iðunn"
    },
    {
        ".     In late 19th century and early 20th century Northern Europe, Freyja was the subject of numerous works of art, including Freyja by ": null
    },
    {
        "H. E. Freund": "hermann ernst freund"
    },
    {
        " , Freja sökande sin make by ": null
    },
    {
        "Nils Blommér": "nils blommér"
    },
    {
        ", Freyjas Aufnahme uner den Göttern , and Frigg; Freyja by , Freyja by ": null
    },
    {
        "Carl Emil Doepler d. J.": "carl emil doepler"
    },
    {
        ", and Freyja and the Brisingamen by ": null
    },
    {
        "J. Doyle Penrose": "j. doyle penrose"
    },
    {
        " . Like other Norse goddesses, her name was applied widely in Scandinavia to, for example, sweetmeats or to stout carthorses . Vanadís, one of Freyjas names, is the source of the name of the ": null
    },
    {
        "chemical element": "chemical element"
    },
    {
        " vanadium": "vanadium"
    },
    {
        ", so named because of its many colored compounds. . A suburb of Minneapolis, MN, an area settled heavily by Scandinavians, is called Vanadis Heights .     Starting in the early 1990s, derivatives of Freyja began to appear as a given name for girls. According to the Norwegian name database from the Central Statistics Bureau, around 500 women are listed with the first name Frøya in the country. There are also several similar names, such as the first element of the dithematic personal name Frøydis. ": null
    }
]