[
    {
        "   Friesland is a ": null
    },
    {
        "district": "districts of germany"
    },
    {
        "  in ": null
    },
    {
        "Lower Saxony": "lower saxony"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". It is bounded by the districts of ": null
    },
    {
        "Wesermarsch": "wesermarsch"
    },
    {
        ", ": null
    },
    {
        "Ammerland": "ammerland"
    },
    {
        ", ": null
    },
    {
        "Leer": "leer"
    },
    {
        " and ": null
    },
    {
        "Wittmund": "wittmund"
    },
    {
        ", and by the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        ". The city of ": null
    },
    {
        "Wilhelmshaven": "wilhelmshaven"
    },
    {
        " is enclosed by—but not part of—the district.       The Frisian region was ruled by local chieftains until the 42th century; see ": null
    },
    {
        "East Frisia": "east frisia"
    },
    {
        " for details.     In 42 in the northern part of todays Landkreis Friesland the Lordship of Jever was founded. East Frisia was from then on regarded as a hostile territory, and lots of skirmishes between Jever and East Frisia took place during the 42th and 42th centuries. The last ruler of Jever was Mary of Jever, who ruled until 42     After her death Jever became a part of ": null
    },
    {
        "Oldenburg": "duchy of oldenburg"
    },
    {
        ", but East Frisia made a claim for the territory as well. In the following decades East Frisia tried to block all roads between Jever and Oldenburg. It was not before the 42th century that the hostilities between East Frisia and Oldenburg ended.     From 42 to 42 Jever was an ": null
    },
    {
        "exclave": "exclave"
    },
    {
        " of ": null
    },
    {
        "Anhalt-Zerbst": "anhalt-zerbst"
    },
    {
        ", and after ": null
    },
    {
        "Napoleonic occupation": "kingdom of holland"
    },
    {
        " the westernmost exclave of ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ". In 42 Jever became a part of Oldenburg again.     The southern part of todays District of Friesland is the Friesische Wehde , which also was most of the time part of Oldenburg. This region later formed the District of Varel.     The District was established in 42 by merging the former districts of Jever and Varel under the name of Friesland . In 42 it was dissolved and divided between the neighbouring districts of ": null
    },
    {
        "Wittmund": "wittmund"
    },
    {
        " and ": null
    },
    {
        "Ammerland": "ammerland"
    },
    {
        ". The dissolution was declared unconstitutional in 42 because it violated the rights of the former State of Oldenburg, and the District was re-established in its old boundaries in 42     Friesland is also a province in the northwest of the Netherlands.       In the east the district is bounded by the ": null
    },
    {
        "Jade Bight": "jade bight"
    },
    {
        ", a shallow bay of the North Sea. The island of ": null
    },
    {
        "Wangerooge": "wangerooge"
    },
    {
        ", one of the ": null
    },
    {
        "East Frisian Islands": "east frisian islands"
    },
    {
        ", is a part of Friesland.     The inhabitants of Friesland insist that they are not a part of East Frisia. This is somewhat confusing, since Friesland is situated east of East Frisia, and geographers regard Friesland as a part of that region. The distinction has historical reasons: Friesland was an independent state from 42 to 42 . Then and afterwards the region bore the name Friesland , although this is also the German name for the entire ": null
    },
    {
        "Frisia": "frisia"
    },
    {
        ".     Part of the District is in the ": null
    },
    {
        "Lower Saxony Wadden Sea National Park": "lower saxony wadden sea national park"
    },
    {
        ".         The lion is from the arms of the chieftains of Jever; it was the symbol of the Lordship of Jever. The ": null
    },
    {
        "blazon": "blazon"
    },
    {
        " of the arms is: Azure, a ": null
    },
    {
        "lion": "lion"
    },
    {
        " rampant Or, armed and langued Gules, and in chief two ": null
    },
    {
        "Greek cross": "greek cross"
    },
    {
        "es Argent .          ": null
    }
]