[
    {
        "Friedrich Theodor Vischer  was a German novelist, poet, playwright, and writer on the ": null
    },
    {
        "philosophy of art": "aesthetics"
    },
    {
        ". Today, he is mainly remembered as the author of the novel  Auch Einer , in which he developed the concept of  , a comic theory that inanimate objects conspire against humans.       Born at ": null
    },
    {
        "Ludwigsburg": "ludwigsburg"
    },
    {
        " as the son of a clergyman, Vischer was educated at ": null
    },
    {
        "Tübinger Stift": "tübinger stift"
    },
    {
        ", and began life in his fathers profession. He became  in ": null
    },
    {
        "aesthetics": "aesthetics"
    },
    {
        " and German literature at his old university in 42 was advanced to extraordinary professor two years later, and was appointed to full professor in 42 Due to his outspoken inaugural address he was suspended for two years by the ": null
    },
    {
        "Württemberg": "württemberg"
    },
    {
        " government. In this enforced leisure he wrote the first two volumes of his Aesthetik, oder Wissenschaft des Schönen , the fourth and last volume of which did not appear till 42     Vischer threw himself heartily into the great German political movement of 4242 and shared the disappointment of patriotic ": null
    },
    {
        "democrat": "democracy"
    },
    {
        "s at its failure. In 42 he became professor at ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        ". In 42 his fame being now established, he was invited back to Germany with a professorship at ": null
    },
    {
        "Tübingen": "university of tübingen"
    },
    {
        " combined with a post at the Polytechnikum of ": null
    },
    {
        "Stuttgart": "stuttgart"
    },
    {
        ". He died at ": null
    },
    {
        "Gmunden": "gmunden"
    },
    {
        " on 42 September 42       Vischer was not an original thinker, and his monumental , in spite of industry and learning, has not the higher qualities of success. He attempts the hopeless task of explaining art by the ": null
    },
    {
        "Hegelian": "georg wilhelm friedrich hegel"
    },
    {
        " dialectic. Starting with the definition of beauty as the idea in the form of limited appearance, he goes on to develop the various elements of art , and the various forms of art by means of the Hegelian antitheses—form and content, objective and subjective, inner conflict and reconciliation. The shape of the work also is Hegelian, consisting of short highly technical paragraphs containing the main argument, followed by detailed explanations printed in different type.     Still, Vischer had a thorough knowledge of every branch of art, except music. Much valuable material is buried in his volumes.     In later life Vischer moved considerably away from Hegelianism, and adopted the conceptions of sensuous completeness and cosmic harmony as criteria of beauty; but he never found time to rewrite his great book. According to ": null
    },
    {
        "Chisholm": "hugh chisholm"
    },
    {
        ", His own work as a literary artist is of high quality; vigorous, imaginative and thoughtful without academic technicality.     He would not abstain from grossly unfair remarks, e. g. in vol. 42 of Auch Einer: In der lächerlichsten aller Kultursprachen hat Shakespeare geschrieben about English , or Übrigens war der Taugenichts Beyle ein Narr on Stendhal . Ueber das Erhabene und Komische und andere Texte zur Philosophie des Schönen, 42   Kritische Gänge, 42   Aesthetik oder Wissenschaft des Schönen. In six parts, 42   Kritische Gänge. Neue Folge. In six parts, 42   Faust. Der Tragödie dritter Teil , a parody of Goethes ": null
    },
    {
        "Faust: The Second Part of the Tragedy": "faust: the second part of the tragedy"
    },
    {
        ", 42   Mein Lebensgang, autobiography, 42   Auch Einer. Eine Reisebekanntschaft, novel, 42    Altes und Neues, 42   Lyrische Gänge, poetry, 42   Nicht Ia. Schwäbisches Lustspiel in drei Aufzügen, comedy, 42   Altes und Neues. Neue Folge, 42     A complete list of Vischers works is ": null
    },
    {
        "available on the German Wikipedia": ":de:friedrich theodor vischer/werkverzeichnis"
    }
]