[
    {
        "           A frigate  is a type of ": null
    },
    {
        "warship": "warship"
    },
    {
        ", having various sizes and roles over the last few centuries.     In the 17th century, a frigate was any warship built for speed and maneuverability, the description often used being frigate-built . These could be warships carrying their principal batteries of carriage-mounted ": null
    },
    {
        "guns": "naval artillery"
    },
    {
        " on a single ": null
    },
    {
        "deck": "deck"
    },
    {
        " or on two decks . The term was generally used for ships too small to stand in the ": null
    },
    {
        "line of battle": "line of battle"
    },
    {
        ", although early line-of-battle ships were frequently referred to as frigates when they were built for speed.     In the 18th century, frigates were ": null
    },
    {
        "full-rigged ship": "full-rigged ship"
    },
    {
        "s, that is ": null
    },
    {
        "square-rigged": "square rig"
    },
    {
        " on all three masts, they were built for speed and handiness, had a lighter armament than a ": null
    },
    {
        "ship of the line": "ship of the line"
    },
    {
        ", and were used for patrolling and escort. In the definition adopted by the ": null
    },
    {
        "British Admiralty": "british admiralty"
    },
    {
        ", they were ": null
    },
    {
        "rated ships": "rating system of the royal navy"
    },
    {
        " of at least 28 guns, carrying their principal armaments upon a single continuous deck – the upper deck – while ships of the line possessed two or more continuous decks bearing batteries of guns.     In the late 19th century , the armoured frigate was a type of ": null
    },
    {
        "ironclad warship": "ironclad warship"
    },
    {
        " that for a time was the most powerful type of vessel afloat. The term frigate was used because such ships still mounted their principal armaments on a single continuous upper deck.     In modern navies, frigates are used to protect other warships and ": null
    },
    {
        "merchant-marine": "merchant-marine"
    },
    {
        " ships, especially as ": null
    },
    {
        "anti-submarine warfare": "anti-submarine warfare"
    },
    {
        " combatants for amphibious expeditionary forces, underway replenishment groups, and merchant ": null
    },
    {
        "convoy": "convoy"
    },
    {
        "s. Ship classes dubbed frigates have also more closely resembled ": null
    },
    {
        "corvette": "corvette"
    },
    {
        "s, ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s, ": null
    },
    {
        "cruisers": "cruiser"
    },
    {
        "and even battleships. Some European navies such as the Dutch, French, German or Spanish ones use the term frigate for both their destroyers and frigates. The rank ": null
    },
    {
        "frigate captain": "frigate captain"
    },
    {
        " derives from the name of this type of ship.                The term frigate  originated in the ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        " in the late 15th century, referring to a lighter ": null
    },
    {
        "galley": "galley"
    },
    {
        "-type warship with oars, sails and a light armament, built for speed and maneuverability. Henderson, James: Frigates Sloops & Brigs. Pen & Sword Books, London, 2005. . The etymology of the word remains uncertain, although it may have originated as a ": null
    },
    {
        "corruption": "corruption"
    },
    {
        " of  aphractus , a ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word for an open vessel with no lower deck. Aphractus, in turn, derived from the ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " phrase ἄφρακτος ναῦς  - undefended ship .     In 1583, during the ": null
    },
    {
        "Eighty Years War": "eighty years war"
    },
    {
        " of 1568-1648, ": null
    },
    {
        "Habsburg Spain": "habsburg spain"
    },
    {
        " recovered the ": null
    },
    {
        "southern Netherlands": "southern netherlands"
    },
    {
        " from the Protestant rebels. This soon resulted in the use of the occupied ports as bases for ": null
    },
    {
        "privateers": "privateers"
    },
    {
        ", the ": null
    },
    {
        "Dunkirkers": "dunkirker"
    },
    {
        " , to attack the shipping of the Dutch and their allies. To achieve this the Dunkirkers developed small, maneuverable, sailing vessels that came to be referred to as frigates. The success of these Dunkirker vessels influenced the ship design of other navies contending with them, but because most regular navies required ships of greater endurance than the Dunkirker frigates could provide, the term soon came to apply less exclusively to any relatively fast and elegant sail-only warship. In French, the term frigate gave rise to a verb - frégater, meaning to build long and low, and to an adjective, adding more confusion. Even the huge English  could be described as a delicate frigate by a contemporary after her upper decks were reduced in 1651. Rodger p. 216     The navy of the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " became the first navy to build the larger ocean-going frigates. The Dutch navy had three principal tasks in the struggle against Spain: to protect Dutch merchant ships at sea, to blockade the ports of Spanish-held ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        " to damage trade and halt enemy ": null
    },
    {
        "privateering": "privateering"
    },
    {
        ", and to fight the Spanish fleet and prevent troop landings. The first two tasks required speed, shallowness of draft for the shallow waters around the Netherlands, and the ability to carry sufficient supplies to maintain a blockade. The third task required heavy armament, sufficient to stand up to the Spanish fleet. The first of the larger battle-capable frigates were built around 1600 at ": null
    },
    {
        "Hoorn": "hoorn"
    },
    {
        " in ": null
    },
    {
        " Holland": "county of holland"
    },
    {
        ". Geofrrey Parker, The Military Revolution: Military Innovation and the Rise of the West 1500–1800, p. 99 By the later stages of the ": null
    },
    {
        "Eighty Years War": "eighty years war"
    },
    {
        " the Dutch had switched entirely from the heavier ships still used by the English and Spanish to the lighter frigates, carrying around 40  guns and weighing around 300  tons.     The effectiveness of the Dutch frigates became most evident in the ": null
    },
    {
        "Battle of the Downs": "battle of the downs"
    },
    {
        " in 1639, encouraging most other navies, especially the English, to adopt similar designs.     The fleets built by the ": null
    },
    {
        "Commonwealth of England": "commonwealth of england"
    },
    {
        " in the 1650s generally consisted of ships described as frigates , the largest of which were two-decker great frigates of the ": null
    },
    {
        "third rate": "third-rate"
    },
    {
        ". Carrying 60  guns, these vessels were as big and capable as great ships of the time; however, most other frigates at the time were used as ": null
    },
    {
        "cruisers": "cruiser"
    },
    {
        " : independent fast ships. The term frigate implied a long hull-design, which relates directly to speed  and which also, in turn, helped the development of the ": null
    },
    {
        "broadside": "broadside"
    },
    {
        " tactic in naval warfare.          At this time, a further design evolved, reintroducing oars and resulting in galley frigates such as  of 1676, which was rated as a 32-gun ": null
    },
    {
        "fifth-rate": "fifth-rate"
    },
    {
        " but also had a bank of 40 oars set below the upper deck which could propel the ship in the absence of a favourable wind.     In Danish, the word fregat often applies to warships carrying as few as 16 guns, such as , which the British classified as a sloop.     Under the ": null
    },
    {
        "rating system of the Royal Navy": "rating system of the royal navy"
    },
    {
        ", by the middle of the 18th century, the term frigate was technically restricted to single-decked ships of the ": null
    },
    {
        "fifth rate": "fifth-rate"
    },
    {
        ", though small 28-gun frigates classed as ": null
    },
    {
        "sixth rate": "sixth-rate"
    },
    {
        ".               The classic sailing frigate, well-known today for its role in the ": null
    },
    {
        "Napoleonic wars": "napoleonic wars"
    },
    {
        ", can be traced back to French developments in the second quarter of the 18th century. The French-built  of 1740 is often regarded as the first example of this type. These ships were square-rigged and carried all their main guns on a single continuous upper deck. The lower deck, known as the gun deck , now carried no armament, and functioned as a berth deck where the crew lived, and was in fact placed below the waterline of the new frigates. The typical earlier cruiser had a partially armed lower deck, from which it was known as a half-battery or demi-batterie ship. Removing the guns from this deck allowed the height of the hull upperworks to be lowered, giving the resulting true-frigate much improved sailing qualities. The unarmed deck meant that the frigates guns were carried comparatively high above the waterline; as a result, when seas were too rough for two-deckers to open their lower deck gun-ports, frigates were still able to fight with all their guns .  Gardiner and Lavery , pp. 36–37     A total of fifty-nine French sailing frigates were built between 1777 and 1790, with a standard design averaging a hull length of  and an average draught of . The new frigates recorded sailing speeds of up to , significantly faster than their predecessor vessels.     The ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " captured a number of the new French frigates, including Médée, during the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        " and were impressed by them, particularly for their inshore handling capabilities. They soon built copies , based on a French privateer named Tygre, and started to adapt the type to their own needs, setting the standard for other frigates as the leading naval power. The first British frigates carried 28 guns including an upper deck battery of twenty-four 9-pounder guns but soon developed into fifth-rate ships of 32 or 36 guns including an upper deck battery of twenty-six 12-pounder guns, with the remaining six or ten smaller guns carried on the quarter deck and forecastle. Gardiner and Lavery , p. 37          In 1778, the British Admiralty introduced a larger heavy frigate, with a main battery of twenty-six or twenty-eight 18-pounder guns . This move may reflect the naval conditions at the time, with both France and Spain as enemies the usual British preponderance in ship numbers was no longer the case and there was pressure on the British to produce cruisers of individually greater force. In reply, the first French 18-pounder frigates were laid down in 1781. The 18-pounder frigate eventually became the standard frigate of the French Revolutionary and Napoleonic Wars. The British produced larger, 38-gun, and slightly smaller, 36-gun, versions and also a 32-gun design that can be considered an economy version. The 32-gun frigates also had the advantage that they could be built by the many smaller, less-specialised shipbuilders. Gardiner and Lavery , p. 39 Gardiner , p. 19     Frigates could additionally carry smaller carriage-mounted guns on their quarter decks and ": null
    },
    {
        "forecastles": "forecastle"
    },
    {
        ". Technically, rated ships with fewer than 28  guns could not be classed as frigates but as ": null
    },
    {
        "post ships": "post ship"
    },
    {
        " ; however, in common parlance most post ships were often described as frigates , the same casual misuse of the term being extended to smaller two-decked ships that were too small to stand in the line of battle. In 1778 the Carron Iron Company of Scotland produced a naval gun which would revolutionise the armament of smaller naval vessels, including the frigate. The ": null
    },
    {
        "carronade": "carronade"
    },
    {
        " was a large calibre, short-barrelled naval cannon which was light, quick to reload and needed a smaller crew than a conventional long gun. Due to its lightness it could be mounted on the forecastle and quarter deck of frigates. It greatly increased the firepower, measured in weight of metal , of these vessels. The disadvantages of the carronade were that it had a much shorter range and was less accurate than a long gun. The British quickly saw the advantages of the new weapon and soon employed it on a wide scale, the US Navy also copied the design soon after its appearance. The French and other nations eventually adopted variations of the weapon in succeeding decades. The typical heavy frigate had a main armament of 18-pounder long guns, plus 32-pounder carronades mounted on its upper decks. Gardiner and Lavery , p. 153          The first super-heavy frigates, armed with 24-pounder long guns, were built by the naval architect ": null
    },
    {
        "F H Chapman": "fredrik henrik af chapman"
    },
    {
        " for the Swedish navy in 1782. Because of a shortage of ships-of-the-line, the Swedes wanted these frigates, the Bellona class, to be able to stand in the battle line in an emergency. In the 1790s the French built a small number of large 24-pounder frigates, such as  and Egyptienne, they also cut-down a number of older ships-of-the-line  to produce super-heavy frigates, the resulting ship was known as a ": null
    },
    {
        "rasée": "razee"
    },
    {
        ". It is not known whether the French were seeking to produce very potent cruisers or merely to address stability problems in old ships. The British, alarmed by the prospect of these powerful heavy frigates, responded by rasée-ing three of the smaller 64-gun battleships, including , which went on to have a very successful career as a frigate. At this time the British also built a few 24-pounder-armed large frigates, the most successful of which was . Gardiner , pp. 40-42 Gardiner and Lavery , p. 40     In 1797, three of the ": null
    },
    {
        "United States Navys": "united states navy"
    },
    {
        " first six major ships": "original six frigates of the united states navy"
    },
    {
        " were rated as 44-gun frigates, which operationally carried fifty-six to sixty ": null
    },
    {
        "24-pounder long guns": "24-pounder long gun"
    },
    {
        "and 32-pounder or 42-pounder carronades on two decks; they were exceptionally powerful. These ships were so well-armed that they were often regarded as equal to ships of the line, and after a series of losses at the outbreak of the ": null
    },
    {
        "War of 1812": "war of 1812"
    },
    {
        ", Royal Navy fighting instructions ordered British frigates to never engage the large American frigates at any less than a 2:1 advantage. , preserved as a ": null
    },
    {
        "museum ship": "museum ship"
    },
    {
        " by the US Navy, is the oldest commissioned warship afloat, and is a surviving example of a frigate from the ": null
    },
    {
        "Age of Sail": "age of sail"
    },
    {
        ". Constitution and her sister ships  and  were created in a response to deal with the Barbary Coast pirates and in conjunction with the ": null
    },
    {
        "Naval Act of 1794": "naval act of 1794"
    },
    {
        ". The three big frigates, when built, had a distinctive building pattern which minimised ": null
    },
    {
        "hogging": "hogging and sagging"
    },
    {
        " and improves hydrodynamic efficiency. Archibald, Roger. 1997. Six ships that shook the world. American Heritage of Invention & Technology 13, : 24.     ": null
    },
    {
        "Joshua Humphreys": "joshua humphreys"
    },
    {
        " proposed that only ": null
    },
    {
        "live oak": "live oak"
    },
    {
        ", a tree that grew only in America, should be used to build these ships. The method was to use diagonal riders, eight on each side that sat at a 45-degree angle. These beams of live oak were about  wide and around  thick and helped to maintain the shape of the hull, serving also to reduce flexibility and to minimize impacts.     The British, wounded by repeated defeats in single-ship actions, responded to the success of the American 44s in three ways. They built a class of conventional 40-gun, 24-pounder armed frigates on the lines of Endymion. They cut down three old 74-gun battleships into rasées, producing frigates with a 32-pounder main armament, supplemented by 42-pounder carronades. These had an armament that far exceeded the power of the American ships. Finally,  and , 1,500-ton spar-decked frigates , were built, which were an almost exact match in size and firepower to the American 44-gun frigates. Gardiner , pp. 48-56            Frigates were perhaps the hardest-worked of warship types during the ": null
    },
    {
        "Age of Sail": "age of sail"
    },
    {
        ". While smaller than a ": null
    },
    {
        "ship-of-the-line": "ship of the line"
    },
    {
        ", they were formidable opponents for the large numbers of ": null
    },
    {
        "sloops": "sloop-of-war"
    },
    {
        " and ": null
    },
    {
        "gunboat": "gunboat"
    },
    {
        "s, not to mention ": null
    },
    {
        "privateers": "privateer"
    },
    {
        "or merchantmen. Able to carry six months stores, they had very long range; and vessels larger than frigates were considered too valuable to operate independently.     Frigates scouted for the fleet, went on commerce-raiding missions and patrols, and conveyed messages and dignitaries. Usually, frigates would fight in small numbers or singly against other frigates. They would avoid contact with ships-of-the-line; even in the midst of a fleet engagement it was bad etiquette for a ship of the line to fire on an enemy frigate which had not fired first.  Frigates were involved in fleet battles, often as repeating frigates . In the smoke and confusion of battle, ": null
    },
    {
        "signals": "naval flag signalling"
    },
    {
        " made by the fleet commander, whose ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " might be in the thick of the fighting, might be missed by the other ships of the fleet.  Frigates were therefore stationed to windward or leeward of the main ": null
    },
    {
        "line of battle": "line of battle"
    },
    {
        ", and had to maintain a clear line of sight to the commanders flagship. Signals from the flagship were then repeated by the frigates, which themselves standing out of the line and clear from the smoke and disorder of battle, could be more easily seen by the other ships of the fleet. If damage or loss of masts prevented the flagship from making clear conventional signals, the repeating frigates could interpret them and hoist their own in the correct manner, passing on the commanders instructions clearly.     For officers in the Royal Navy, a frigate was a desirable posting. Frigates often saw action, which meant a greater chance of glory, promotion, and ": null
    },
    {
        "prize money": "prize money"
    },
    {
        ".     Unlike larger ships that were placed ": null
    },
    {
        "in ordinary": "reserve fleet"
    },
    {
        ", frigates were kept in service in peacetime as a cost-saving measure and to provide experience to frigate captains and officers which would be useful in wartime. Frigates could also carry ": null
    },
    {
        "marines": "marine"
    },
    {
        " for boarding enemy ships or for operations on shore; in 1832, the frigate  landed a party of 282 sailors and Marines ashore in the US Navys ": null
    },
    {
        "first Sumatran expedition": "first sumatran expedition"
    },
    {
        ".     Frigates remained a crucial element of navies until the mid-19th century. The first ": null
    },
    {
        "ironclads": "ironclad warship"
    },
    {
        " were classified as frigates because of the number of guns they carried. However, terminology changed as iron and steam became the norm, and the role of the frigate was assumed first by the ": null
    },
    {
        "protected cruiser": "protected cruiser"
    },
    {
        " and then by the ": null
    },
    {
        "light cruiser": "light cruiser"
    },
    {
        ".     Frigates are often the vessel of choice in historical naval novels due to their relative freedom compared to ships of the line and smaller vessels . For example, the ": null
    },
    {
        "Patrick OBrian": "patrick obrian"
    },
    {
        " Aubrey–Maturin series": "aubrey–maturin series"
    },
    {
        ", ": null
    },
    {
        "C. S. Foresters": "c. s. forester"
    },
    {
        " Horatio Hornblower": "horatio hornblower"
    },
    {
        " series and ": null
    },
    {
        "Alexander Kents": "douglas reeman"
    },
    {
        " Richard Bolitho": "richard bolitho"
    },
    {
        " series. The motion picture  Master and Commander: The Far Side of the World  features a reconstructed historic frigate, ": null
    },
    {
        "HMS Rose": "hms surprise"
    },
    {
        ", to depict Aubreys frigate HMS Surprise.               Vessels classed as frigates continued to play a great role in navies with the adoption of steam power in the 19th century. In the 1830s, navies experimented with large ": null
    },
    {
        "paddle steamers": "paddle steamer"
    },
    {
        "equipped with large guns mounted on one deck, which were termed paddle frigates .     From the mid-1840s on, frigates which more closely resembled the traditional sailing frigate were built with steam engines and screw ": null
    },
    {
        "propeller": "propeller"
    },
    {
        "s. These ": null
    },
    {
        "screw frigates": "steam frigate"
    },
    {
        " , built first of wood and later of ": null
    },
    {
        "iron": "wrought iron"
    },
    {
        ", continued to perform the traditional role of the frigate until late in the 19th century.       From 1859, armour was added to ships based on existing frigate and ": null
    },
    {
        "ship of the line": "ship of the line"
    },
    {
        " designs. The additional weight of the armour on these first ": null
    },
    {
        "ironclad warships": "ironclad warship"
    },
    {
        "meant that they could have only one gun deck, and they were technically frigates, even though they were more powerful than existing ships-of-the-line and occupied the same strategic role. The phrase armoured frigate remained in use for some time to denote a sail-equipped, broadside-firing type of ironclad.     After 1875, the term frigate fell out of use. Vessels with armoured sides were designated as ": null
    },
    {
        "battleships": "battleship"
    },
    {
        " or ": null
    },
    {
        "armoured cruisers": "armored cruiser"
    },
    {
        " , while ": null
    },
    {
        "protected cruisers": "protected cruiser"
    },
    {
        " only possessed an armoured deck, and unarmoured vessels, including frigates and sloops, were classified as unprotected cruisers .                  Modern frigates are related to earlier frigates only by name. The term frigate was readopted during the ": null
    },
    {
        "Second World War": "world war ii"
    },
    {
        " by the British ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " to describe an ": null
    },
    {
        "anti-submarine": "anti-submarine warfare"
    },
    {
        " escort vessel that was larger than a ": null
    },
    {
        "corvette": "corvette"
    },
    {
        ", while smaller than a ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        ". Equal in size and capability to the American ": null
    },
    {
        "destroyer escort": "destroyer escort"
    },
    {
        ", frigates are usually less expensive to build and maintain.  Anti-submarine escorts had previously been classified as ": null
    },
    {
        "sloops": "sloop-of-war"
    },
    {
        " by the Royal Navy, and the  s of 1939–1945 were as large as the new types of frigate, and more heavily armed. Twenty-two of these were reclassified as frigates after the war, as were the remaining 24 smaller  s.     The frigate was introduced to remedy some of the shortcomings inherent in the  corvette design: limited armament, a hull form not suited to open-ocean work, a single ": null
    },
    {
        "shaft": "driveshaft"
    },
    {
        " which limited speed and manoeuvrability, and a lack of range. The frigate was designed and built to the same mercantile construction standards  as the corvette, allowing manufacture by yards unused to warship construction. The first frigates of the  were essentially two sets of corvette machinery in one larger hull, armed with the latest ": null
    },
    {
        "Hedgehog": "hedgehog"
    },
    {
        " anti-submarine weapon.     The frigate possessed less offensive firepower and speed than a ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        ", but such qualities were not required for anti-submarine warfare. Submarines were slow while submerged, and ": null
    },
    {
        "ASDIC": "asdic"
    },
    {
        " sets did not operate effectively at speeds of over . Rather, the frigate was an austere and weatherly vessel suitable for mass-construction and fitted with the latest innovations in anti-submarine warfare. As the frigate was intended purely for convoy duties, and not to deploy with the fleet, it had limited range and speed.     The contemporary ": null
    },
    {
        "German": "nazi germany"
    },
    {
        "  Flottenbegleiter  , also known as F-Boats , were essentially frigates.   Retrieved on: 11 February 2008. They were based on a pre-war  Oberkommando der Marine  concept of vessels which could fill roles such as fast minesweeper, minelayer, merchant escort and anti-submarine vessel. Because of the ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        " their displacement was officially limited to 600  tons, although in reality they exceeded this by about 100  tons. F-boats had two stacks and two 105  mm gun turrets. The design was flawed because of its narrow beam, sharp bow and unreliable high pressure steam turbines. F-boats were succeeded in operational duties by ": null
    },
    {
        "Type 35": "torpedo boat type 35"
    },
    {
        " and s. Flottenbegleiter remained in service as advanced training vessels.     It was not until the Royal Navys  of 1944 that a British design classified as a frigate was produced for fleet use, although it still suffered from limited speed. These ": null
    },
    {
        "anti-aircraft": "anti-aircraft warfare"
    },
    {
        " frigates, built on incomplete  hulls, were similar to the ": null
    },
    {
        "United States Navys": "united states navy"
    },
    {
        "destroyer escorts": "destroyer escort"
    },
    {
        ", although the latter had greater speed and offensive armament to better suit them to fleet deployments. The destroyer escort concept came from design studies by the ": null
    },
    {
        "General Board of the United States Navy": "general board of the united states navy"
    },
    {
        " in 1940, as modified by requirements established by a British commission in 1941 Gardiner, Robert, ed., Conways All the Worlds Fighting Ships, 1922–1946, New York: Mayflower Books, 1980, , p. 149. prior to the American entry into the war, for deep-water escorts. The American-built destroyer escorts serving in the ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " Royal Navy": "royal navy"
    },
    {
        " were rated as ": null
    },
    {
        "Captain-class": "captain-class frigate"
    },
    {
        " frigates. The U.S. Navys two ": null
    },
    {
        "Canadian": "canada"
    },
    {
        "-built  and 96 British-influenced, American-built  frigates that followed originally were classified as patrol ": null
    },
    {
        "gunboats": "gunboat"
    },
    {
        " in the U.S. Navy but on 15 April 1943 were all reclassified as patrol frigates .                    The introduction of the ": null
    },
    {
        "surface-to-air missile": "surface-to-air missile"
    },
    {
        " after World War II made relatively small ships effective for anti-aircraft warfare: the guided missile frigate . In the USN, these vessels were called ": null
    },
    {
        "ocean escorts": "ocean escort"
    },
    {
        " and ": null
    },
    {
        "designated": "hull classification symbol"
    },
    {
        " DE or DEG until 1975 – a holdover from the World War II ": null
    },
    {
        "destroyer escort": "destroyer escort"
    },
    {
        " or DE . The ": null
    },
    {
        "Royal Canadian Navy": "royal canadian navy"
    },
    {
        " and British ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " maintained the use of the term frigate ; likewise, the French Navy refers to missile-equipped ship, up to cruiser-sized ships , by the name of frégate , while smaller units are named  aviso . The Soviet Navy used the term guard-ship .     From the 1950s to the 1970s, the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " commissioned ships classed as guided missile frigates , which were actually anti-aircraft warfare ": null
    },
    {
        "cruisers": "cruiser"
    },
    {
        "built on ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "-style hulls. These had one or two twin launchers per ship for the ": null
    },
    {
        "RIM-2 Terrier": "rim-2 terrier"
    },
    {
        " missile, upgraded to the ": null
    },
    {
        "RIM-67 Standard": "rim-67 standard"
    },
    {
        " ER missile in the 1980s. This type of ship was intended primarily to defend aircraft carriers against anti-ship ": null
    },
    {
        "cruise missile": "cruise missile"
    },
    {
        "s, augmenting and eventually replacing converted World War II cruisers in this role. The guided missile frigates also had an anti-submarine capability that most of the World War II cruiser conversions lacked. Some of these ships –  and  along with the  and es – were ": null
    },
    {
        "nuclear-powered": "united states naval reactors"
    },
    {
        " . Bauer and Roberts, pp. 215–217 These frigates were roughly mid-way in size between cruisers and destroyers. This was similar to the use of the term frigate during the age of sail during which it referred to a medium-sized warship, but it was inconsistent with conventions used by other contemporary navies which regarded frigates as being smaller than destroyers. During the ": null
    },
    {
        "1975 ship reclassification": "united states navy 1975 ship reclassification"
    },
    {
        ", the large American frigates were redesignated as guided missile cruisers or destroyers , while ": null
    },
    {
        "ocean escorts": "ocean escort"
    },
    {
        "  were reclassified as frigates , sometimes incorrectly called fast frigates . In the late 1970s the ": null
    },
    {
        "US Navy": "us navy"
    },
    {
        " introduced the 51-ship ": null
    },
    {
        "Oliver Hazard Perry-class": "oliver hazard perry-class frigate"
    },
    {
        " guided missile frigates , the last of which was decommissioned in 2015, although some serve in other navies. Bauer and Roberts, pp. 251–252 By 1995 the older guided missile cruisers and destroyers were replaced by the s and s. Gardiner and Chumbley, pp. 580–585     One of the most successful post-1945 designs was the British , which was used by several navies. Laid down in 1959, the Leander-class was based on the previous ": null
    },
    {
        "Type 12 anti-submarine frigate": "whitby-class frigate"
    },
    {
        " but equipped for anti-aircraft use as well. They were used by the UK into the 1990s, at which point some were sold onto other navies. The Leander design, or improved versions of it, were licence-built for other navies as well.     Nearly all modern frigates are equipped with some form of offensive or defensive missiles, and as such are rated as guided-missile frigates . Improvements in surface-to-air missiles  allow modern guided-missile frigates to form the core of many modern navies and to be used as a fleet defence platform, without the need for specialised anti-air warfare frigates.       The Royal Navy ": null
    },
    {
        "Type 61 Salisbury class": "salisbury-class frigate"
    },
    {
        " were ": null
    },
    {
        " air direction ": "radar picket"
    },
    {
        " frigates equipped to track aircraft. To this end they had reduced armament compared to the ": null
    },
    {
        "Type 41 Leopard-class": "leopard-class frigate"
    },
    {
        " air-defence frigates built on the same hull.     Multi-role frigates like the ": null
    },
    {
        "MEKO 200": "meko 200"
    },
    {
        ",  and es are designed for navies needing warships deployed in a variety of situations that a general frigate class would not be able to fulfill and not requiring the need for deploying ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s.            At the opposite end of the spectrum, some frigates are specialised for ": null
    },
    {
        "anti-submarine warfare": "anti-submarine warfare"
    },
    {
        ". Increasing submarine speeds towards the end of World War II  greatly reduced the margin of speed superiority of frigate over submarine. The frigate could no longer be slow and powered by mercantile machinery and consequently postwar frigates, such as the , were faster.     Such ships carry improved ": null
    },
    {
        "sonar": "sonar"
    },
    {
        " equipment, such as the ": null
    },
    {
        "variable depth sonar": "sonaranti-submarine warfare"
    },
    {
        " or ": null
    },
    {
        "towed array": "towed array sonar"
    },
    {
        ", and specialised weapons such as ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        "es, forward-throwing weapons such as ": null
    },
    {
        "Limbo": "limbo"
    },
    {
        " and missile-carried anti-submarine torpedoes such as ": null
    },
    {
        "ASROC": "asroc"
    },
    {
        " or ": null
    },
    {
        "Ikara": "ikara"
    },
    {
        ". Surface-to-air missiles such as ": null
    },
    {
        "Sea Sparrow": "aim-7 sparrowsea sparrow"
    },
    {
        " and surface-to-surface missiles such as ": null
    },
    {
        "Exocet": "exocet"
    },
    {
        " give them defensive and offensive capabilities. The Royal Navys original ": null
    },
    {
        "Type 22 frigate": "type 22 frigate"
    },
    {
        " is an example of a specialised anti-submarine warfare frigate.     Especially for anti-submarine warfare, most modern frigates have a ": null
    },
    {
        "landing deck": "helipad"
    },
    {
        " and ": null
    },
    {
        "hangar": "hangar"
    },
    {
        " aft to operate ": null
    },
    {
        "helicopter": "helicopter"
    },
    {
        "s, eliminating the need for the frigate to close with unknown sub-surface threats, and using fast helicopters to attack nuclear submarines which may be faster than surface warships. For this task the helicopter is equipped with sensors such as ": null
    },
    {
        "sonobuoy": "sonobuoy"
    },
    {
        "s, wire-mounted dipping sonar and ": null
    },
    {
        "magnetic anomaly detectors": "magnetic anomaly detector"
    },
    {
        "to identify possible threats, and torpedoes or ": null
    },
    {
        "depth-charges": "depth-charge"
    },
    {
        "to attack them.     With their onboard radar helicopters can also be used to reconnoitre over-the-horizon targets and, if equipped with ": null
    },
    {
        "anti-ship missiles": "anti-ship missile"
    },
    {
        "such as ": null
    },
    {
        "Penguin": "penguin missile"
    },
    {
        " or ": null
    },
    {
        "Sea Skua": "sea skua"
    },
    {
        ", to attack them. The helicopter is also invaluable for ": null
    },
    {
        "search and rescue": "search and rescue"
    },
    {
        " operation and has largely replaced the use of ": null
    },
    {
        "small boats": "dinghy"
    },
    {
        " or the ": null
    },
    {
        "jackstay rig": "underway replenishment"
    },
    {
        " for such duties as transferring personnel, mail and cargo between ships or to shore. With helicopters these tasks can be accomplished faster and less dangerously, and without the need for the frigate to slow down or change course.          Some frigates are specialised in ": null
    },
    {
        "airdefense": "airdefense"
    },
    {
        ", because of the major developments in ": null
    },
    {
        "fighter jets": "fighter jet"
    },
    {
        "and ": null
    },
    {
        "ballistic missile": "ballistic missile"
    },
    {
        "s.   An example is the  air defense and command frigate of the ": null
    },
    {
        "Royal Dutch Navy": "royal dutch navy"
    },
    {
        ". These ships are armed with ": null
    },
    {
        "VL Standard Missile 2 Block IIIA": "rim-66 standard"
    },
    {
        ", one or two ": null
    },
    {
        "Goalkeeper CIWS": "goalkeeper ciws"
    },
    {
        " systems,  ": null
    },
    {
        "VL Evolved Sea Sparrow Missile": "rim-162 essm"
    },
    {
        "s, a special ": null
    },
    {
        "SMART-L Radar": "smart-l"
    },
    {
        " and a ": null
    },
    {
        "Thales APAR": "active phased array radar"
    },
    {
        ", all of whom are for air defense. Another example is the  of the ": null
    },
    {
        "Danish Navy": "danish navy"
    },
    {
        ".                ": null
    },
    {
        "Stealth technology": "stealth technology"
    },
    {
        " has been introduced in modern frigate design by the French  design.  Frigate shapes are designed to offer a minimal ": null
    },
    {
        "radar cross section": "radar cross section"
    },
    {
        ", which also lends them good air penetration; the maneuverability of these frigates has been compared to that of sailing ships. Examples are the Italian and French  with the ": null
    },
    {
        "Aster 15": "aster 15"
    },
    {
        " and ": null
    },
    {
        "Aster 30": "aster 30"
    },
    {
        " missile for anti-missile capabilities, the ": null
    },
    {
        "German": "germany"
    },
    {
        "  and  s, the ": null
    },
    {
        "Turkish": "turkey"
    },
    {
        "  type frigates with the ": null
    },
    {
        "MK-41 VLS": "mk-41 vls"
    },
    {
        " and the ": null
    },
    {
        "India": "india"
    },
    {
        "n ,  and  classes with the ": null
    },
    {
        "Brahmos missile": "brahmos missile"
    },
    {
        " system.     The modern ": null
    },
    {
        "French Navy": "french navy"
    },
    {
        " applies the term first-class frigate and second-class frigate to both destroyers and frigates in service. Pennant numbers remain divided between F-series numbers for those ships internationally recognised as frigates and D-series pennant numbers for those more traditionally recognised as destroyers. This can result in some confusion as certain classes are referred to as frigates in French service while similar ships in other navies are referred to as destroyers. This also results in some recent classes of French ships such as the  being among the largest in the world to carry the rating of frigate.        In the ": null
    },
    {
        "German Navy": "german navy"
    },
    {
        ", frigates were used to replace aging destroyers; however in size and role the new German frigates exceed the former class of destroyers. The future German s will be the largest class of frigates worldwide with a displacement of more than 7,200  tons. The same was done in the ": null
    },
    {
        "Spanish Navy": "spanish navy"
    },
    {
        ", which went ahead with the deployment of the first ": null
    },
    {
        "Aegis": "aegis combat system"
    },
    {
        " frigates, the s.            Some new classes of ships similar to ": null
    },
    {
        "corvettes": "corvette"
    },
    {
        "are optimized for high-speed deployment and combat with small craft rather than combat between equal opponents; an example is the U.S. ": null
    },
    {
        "littoral combat ship": "littoral combat ship"
    },
    {
        " . As of 2015, all  s in the United States Navy have been decommissioned, and their role partially being assumed by the new LCS. While the LCS class ships are smaller than the frigate class they will replace, they offer a similar degree of weaponry while requiring less than half the crew complement and offering a top speed of over . A major advantage for the LCS ships is that they are designed around specific mission modules allowing them to fulfill a variety of roles. The modular system also allows for most upgrades to be performed ashore and installed later into the ship, keeping the ships available for deployment for the maximum time.     The latest U.S. deactivation plans means that this is the first time that the U.S. Navy has been without a frigate class of ships since 1943 .      The remaining 20 LCSs to be acquired from 2019 and onwards that will be enhanced will be designated as frigates, and existing ships given modifications may also have their classification changed to FF as well.   – News.USNI.org, 15 January 2015         A few nations have frigates on display as museum ships. They are:        in ": null
    },
    {
        "Boston": "boston"
    },
    {
        ", ": null
    },
    {
        "United States": "united states"
    },
    {
        ". Second oldest commissioned warship in the world, oldest commissioned warship afloat. Active as the flagship of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ".   NRP  Dom Fernando II e Glória  in ": null
    },
    {
        "Almada": "almada"
    },
    {
        ", ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        ".    in ": null
    },
    {
        "Hartlepool": "hartlepool"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        ".    in ": null
    },
    {
        "Dundee": "dundee"
    },
    {
        ", ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ".       , sailing replica of the 1779 Hermione which carried ": null
    },
    {
        "Lafayette": "gilbert du motier, marquis de lafayette"
    },
    {
        " to the United States.   , originally named Grand Turk was built for the TV series ": null
    },
    {
        "Hornblower": "hornblower"
    },
    {
        " in 1997. She was sold to France in 2010 and renamed Étoile du Roy. , a sailing replica of Russias first warship, homeported in ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        ", ": null
    },
    {
        "Russia": "russia"
    },
    {
        ".    in ": null
    },
    {
        "San Diego": "san diego"
    },
    {
        ", ": null
    },
    {
        "United States": "united states"
    },
    {
        ", replica of HMS Rose, used in the film,  Master and Commander: The Far Side of the World .        in ": null
    },
    {
        "Den Helder": "den helder"
    },
    {
        ", ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ".    in ": null
    },
    {
        "Ebeltoft": "ebeltoft"
    },
    {
        ", ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ".   , replica in ": null
    },
    {
        "Esashi": "esashi, hokkaidō"
    },
    {
        ", ": null
    },
    {
        "Japan": "japan"
    },
    {
        ".    in ": null
    },
    {
        "Portsmouth": "portsmouth"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        ".    in ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        ", ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ".        in ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        ", ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ".    in ": null
    },
    {
        "Brisbane": "brisbane"
    },
    {
        ", ": null
    },
    {
        "Australia": "australia"
    },
    {
        ".   TCG Ege , formerly  in ": null
    },
    {
        "Izmit": "izmit"
    },
    {
        ", ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ".   ROKS Taedong , formerly  in ": null
    },
    {
        "South Korea": "south korea"
    },
    {
        ".   ROKS Ulsan , in ": null
    },
    {
        "Ulsan": "ulsan"
    },
    {
        ", South Korea.   ROKS Seoul , in ": null
    },
    {
        "Seoul": "seoul"
    },
    {
        ", South Korea.   HTMS Tachin , formerly  in ": null
    },
    {
        "Nakhon Nayok": "nakhon nayok"
    },
    {
        ", ": null
    },
    {
        "Thailand": "thailand"
    },
    {
        ".   HTMS Prasase , formerly  in ": null
    },
    {
        "Rayong Province": "rayong province"
    },
    {
        ", Thailand.   CNS Nanchong in ": null
    },
    {
        "Qingdao": "qingdao"
    },
    {
        ", ": null
    },
    {
        "China": "china"
    },
    {
        ".   CNS Yingtan in Qingdao, China.   CNS Xiamen in ": null
    },
    {
        "Taizhou": "taizhou, jiangsu"
    },
    {
        ", China.    in ": null
    },
    {
        "London": "london"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        ".    in London, England.    in ": null
    },
    {
        "Horten": "horten"
    },
    {
        ", ": null
    },
    {
        "Norway": "norway"
    },
    {
        ".    in ": null
    },
    {
        "Lumut, Malaysia": "lumut, malaysia"
    }
]