[
    {
        "            Fritz Reuter Leiber Jr. was an American writer of fantasy, horror, and science fiction. He was also a poet, actor in theater and films, playwright and ": null
    },
    {
        "chess expert": "chess expert"
    },
    {
        ". With writers such as ": null
    },
    {
        "Robert E. Howard": "robert e. howard"
    },
    {
        " and ": null
    },
    {
        "Michael Moorcock": "michael moorcock"
    },
    {
        ", Leiber can be regarded as one of the fathers of ": null
    },
    {
        "sword and sorcery": "sword and sorcery"
    },
    {
        " fantasy, having coined the term.         Fritz Leiber was born December 24, 1910, in ": null
    },
    {
        "Chicago, Illinois": "chicago, illinois"
    },
    {
        ", to the actors ": null
    },
    {
        "Fritz Leiber": "fritz leiber"
    },
    {
        " and Virginia Bronson Leiber. For a time, he seemed inclined to follow in his parents footsteps; the theater and actors are prominently featured in his fiction. He spent 1928 touring with his parents ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        " company before entering the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        ", where he was elected to ": null
    },
    {
        "Phi Beta Kappa": "phi beta kappa"
    },
    {
        " and received an undergraduate ": null
    },
    {
        "Ph.B.": "ph.b."
    },
    {
        " degree in ": null
    },
    {
        "psychology": "psychology"
    },
    {
        " and ": null
    },
    {
        "physiology": "physiology"
    },
    {
        "  or ": null
    },
    {
        "biology": "biology"
    },
    {
        "  with honors in 1932. From 1932 to 1933, he worked as a ": null
    },
    {
        "lay reader": "lay reader"
    },
    {
        " and studied as a candidate for the ministry at the ": null
    },
    {
        "General Theological Seminary": "general theological seminary"
    },
    {
        " in ": null
    },
    {
        "Chelsea, Manhattan": "chelsea, manhattan"
    },
    {
        ", an affiliate of the ": null
    },
    {
        "Episcopal Church": "episcopal church"
    },
    {
        ", without taking a degree.     After pursuing graduate studies in ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        " at the University of Chicago from 1933 to 1934 and failing once more to take a degree, he remained based in Chicago while touring intermittently with his parents company and pursuing a concurrent literary career; six short stories in the 2010 collection Strange Wonders: A Collection of Rare Fritz Leiber Works carry 1934 and 1935 dates. He also appeared alongside his father in uncredited parts in several films, including ": null
    },
    {
        "George Cukors": "george cukor"
    },
    {
        "  Camille  , ": null
    },
    {
        "James Whales": "james whale"
    },
    {
        "  The Great Garrick  and ": null
    },
    {
        "William Dieterles": "william dieterle"
    },
    {
        "  The Hunchback of Notre Dame  .     In 1936, he initiated a brief yet intense correspondence with ": null
    },
    {
        "H.P. Lovecraft": "h.p. lovecraft"
    },
    {
        ", who encouraged and influenced literary development before succumbing to ": null
    },
    {
        "small intestine cancer": "small intestine cancer"
    },
    {
        " and ": null
    },
    {
        "malnutrition": "malnutrition"
    },
    {
        " in March 1937.  Leiber introduced ": null
    },
    {
        "Fafhrd and the Gray Mouser": "fafhrd and the gray mouser"
    },
    {
        " in Two Sought Adventure , his first professionally published short story in the August 1939 edition of  Unknown , edited by ": null
    },
    {
        "John W. Campbell": "john w. campbell"
    },
    {
        ". Anderson, Poul , The Wizard of Nehwon , The Best of Fritz Leiber, NY: Doubleday, pp. vii–xv.     Leiber married Jonquil Stephens on January 16, 1936; their only child, the philosopher and science fiction writer ": null
    },
    {
        "Justin Leiber": "justin leiber"
    },
    {
        ", was born in 1938. From 1937 to 1941, he was employed by Consolidated Book Publishing as a staff writer for the Standard American Encyclopedia. In 1941, the family moved to California, where Leiber served as a speech and drama instructor at ": null
    },
    {
        "Occidental College": "occidental college"
    },
    {
        " during the 1941–1942 academic year.     Unable to conceal his disdain for academic politics as the United States entered ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", he decided that the struggle against ": null
    },
    {
        "fascism": "fascism"
    },
    {
        " was more important than his long-held ": null
    },
    {
        "pacifist": "pacifist"
    },
    {
        " convictions. He accepted a position with ": null
    },
    {
        "Douglas Aircraft": "douglas aircraft"
    },
    {
        " in quality inspection, primarily working on the ": null
    },
    {
        "C-47 Skytrain": "c-47 skytrain"
    },
    {
        "; throughout the war, he continued to regularly publish fiction in a variety of periodicals.     Thereafter, the family returned to Chicago, where Leiber served as associate editor of  Science Digest  from 1945 to 1956. During this decade , his output  was characterized by ": null
    },
    {
        "Poul Anderson": "poul anderson"
    },
    {
        " as a lot of the best science fiction and fantasy in the business. In 1958, the Leibers returned to Los Angeles. By this juncture, he was able to relinquish his journalistic career and support his family as a full-time fiction writer.     Jonquils death in 1969 precipitated Leibers permanent relocation to ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " and exacerbated his longstanding ": null
    },
    {
        "alcoholism": "alcoholism"
    },
    {
        " after twelve years of fellowship in ": null
    },
    {
        "Alcoholics Anonymous": "alcoholics anonymous"
    },
    {
        "; however, he would gradually regain relative sobriety  over the next two decades.  In 1977, he returned to his original form with a fantasy novel set in modern-day San Francisco,  Our Lady of Darkness , which is about a writer of weird tales who must deal with the death of his wife and his recovery from alcoholism.     Perhaps as a result of his substance abuse, Leiber seems to have suffered periods of penury in the 1970s; ": null
    },
    {
        "Harlan Ellison": "harlan ellison"
    },
    {
        " wrote of his anger at finding that the much-awarded Leiber had to write his novels on a manual typewriter that was propped up over the sink in his apartment, and ": null
    },
    {
        "Marc Laidlaw": "marc laidlaw"
    },
    {
        " wrote that, when visiting Leiber as a fan in 1976, he was shocked to find him occupying one small room of a seedy San Francisco residence hotel, its squalor relieved mainly by walls of books . Laidlaw, Marc, On Our Lady of Darkness, in the anthology Horror: Another 100 Best Books, edited by Stephen Jones and Kim Newman, Carroll & Graf, 2005. Other reports suggest that Leiber preferred to live simply in the city, spending his money on dining, movies and travel. In the last years of his life, royalty checks from ": null
    },
    {
        "TSR, Inc.": "tsr, inc."
    },
    {
        "  were enough in themselves to ensure that he lived comfortably.      In 1992, the last year of his life, Leiber married his second wife, Margo Skinner, a journalist and poet with whom he had been friends for many years.     Leibers death occurred a few weeks after a physical collapse while traveling from a science fiction convention in ": null
    },
    {
        "London, Ontario": "london, ontario"
    },
    {
        ", with Skinner. The cause of his death was stated by his wife to be stroke.      He wrote a 100-page-plus memoir, Not Much Disorder and Not So Early Sex, which can be found in The Ghost Light .      Leibers own literary criticism, including several essays on Lovecraft, was collected in the volume Fafhrd and Me .             As the child of two ": null
    },
    {
        "Shakespeare": "william shakespeare"
    },
    {
        "an actors—": null
    },
    {
        "Fritz Sr.": "fritz leiber sr."
    },
    {
        " and Virginia —Leiber was fascinated with the stage, describing itinerant Shakespearean companies in stories like No Great Magic and Four Ghosts in Hamlet, and creating an actor/producer protagonist for his novel  A Specter is Haunting Texas .     Although his Change War novel,  The Big Time , is about a war between two factions, the Snakes and the Spiders , changing and rechanging history throughout the universe, all the action takes place in a small bubble of isolated ": null
    },
    {
        "space-time": "space-time"
    },
    {
        " about the size of a theatrical stage, with only a handful of characters. ": null
    },
    {
        "Judith Merril": "judith merril"
    },
    {
        "  remarks on Leibers acting skills when the writer won a science fiction convention costume ball. Leibers costume consisted of a cardboard military collar over turned-up jacket lapels, cardboard insignia, an armband, and a spider pencilled large in black on his forehead, thus turning him into an officer of the Spiders, one of the combatants in his Change War stories. The only other component, Merril writes, was the Leiber instinct for theatre.         Due to the similarity of the names of the father and the son, some filmographies incorrectly attribute to Fritz Jr. roles which were in fact played by his father, Fritz Leiber Sr., who was the evil Inquisitor in the Errol Flynn adventure film  The Sea Hawk  and had played in many other movies from 1917 onwards until the late 1950s. It is the elder Leiber, not the younger, who appears in the Vincent Price vehicle  The Web  and in Charlie Chaplins  Monsieur Verdoux  .     In the cult horror film  Equinox  directed by ": null
    },
    {
        "Dennis Muren": "dennis muren"
    },
    {
        " and Jack Woods, Leiber has a cameo appearance as Dr. Watermann, a geologist. In the edited second version of the movie Leiber has no spoken dialogue in the film but features in a few scenes. The original version of the movie has a longer appearance by Leiber recounting the ancient book and a brief speaking role, all of which was cut from the re-release of the film.     He also appears in the 1979 Schick Sunn Classics documentary The Bermuda Triangle, based on the book by ": null
    },
    {
        "Charles Berlitz": "charles berlitz"
    },
    {
        ", as Chavez.                                             Leiber was heavily influenced by H. P. Lovecraft and ": null
    },
    {
        "Robert Graves": "robert graves"
    },
    {
        " in the first two decades of his career. Beginning in the late 1950s, he was increasingly influenced by the works of ": null
    },
    {
        "Carl Jung": "carl jung"
    },
    {
        ", particularly by the concepts of the ": null
    },
    {
        "anima": "anima"
    },
    {
        " and the ": null
    },
    {
        "shadow": "shadow"
    },
    {
        ". From the mid-1960s onwards, he began incorporating elements of Joseph Campbells  The Hero with a Thousand Faces . These concepts are often openly mentioned in his stories, especially the anima, which becomes a method of exploring his fascination with, but estrangement from, the female.     Leiber liked cats, which feature prominently in many of his stories. Tigerishka, for example, is a ": null
    },
    {
        "cat-like alien": "cat-like aliens"
    },
    {
        " who is sexually attractive to the human protagonist yet repelled by human customs in the novel The Wanderer. Leibers Gummitch stories feature a kitten with an I.Q. of 160, just waiting for his ritual cup of coffee so that he can become human, too.     His first stories in the 1930s and 40s were inspired by Lovecrafts ": null
    },
    {
        "Cthulhu Mythos": "cthulhu mythos"
    },
    {
        ". The leading critic and historian of the wider Mythos, S. T. Joshi, has singled out Leibers The Sunken Land  as perhaps the most accomplished of the early stories based on Lovecrafts Mythos. S. T. Joshi, Cthulhus Empire: H. P. Lovecrafts Influence on His Contemporaries and Successors , Critical Insights: Pulp Fiction of the 1920s and 1930s, Salem Press, 2013. Leiber also later wrote several essays on Lovecraft the man, such as A Literary Copernicus , the publication of which formed a key moment in the emergence of a serious critical appreciation of Lovecrafts life and work.     Leibers first professional sale was Two Sought Adventure ,  which introduced his most famous characters, Fafhrd and the Gray Mouser. In 1943, his first two novels were serialized in Unknown  and  Astounding Science Fiction  .     1947 marked the publication of his first book,  Nights Black Agents , a short story collection containing seven stories grouped as Modern Horrors, one as a Transition, and two grouped as Ancient Adventures: The Sunken Land and Adepts Gambit , which are both stories of Fafhrd and the Gray Mouser.     Book publication of the science fiction novel Gather, Darkness followed in 1950. It deals with a futuristic world that follows the Second Atomic Age which is ruled by scientists, until in the throes of a new Dark Age, the witches revolt.     In 1951, Leiber was Guest of Honor at the World Science Fiction Convention in New Orleans. Further novels followed during the 1950s, and in 1958  The Big Time  won the ": null
    },
    {
        "Hugo Award for Best Novel": "hugo award for best novel"
    },
    {
        ".     Leiber published further books in the 1960s. His novel  The Wanderer  also received the Hugo for Best Novel. In the novel, an artificial planet, quickly nicknamed the Wanderer, materializes from hyperspace within earths orbit. The Wanderers gravitational field captures the moon and shatters it into something like one of Saturns rings. On Earth, the Wanderers gravity well triggers massive earthquakes, tsunamis, and tidal phenomena. The multi-threaded plot follows the exploits of a large ensemble cast as they struggle to survive the global disaster.     Leiber received the ": null
    },
    {
        "Hugo Award for Best Novella": "hugo award for best novella"
    },
    {
        " in 1970 and 1971 for Ship of Shadows and ": null
    },
    {
        "Ill Met in Lankhmar": "ill met in lankhmar"
    },
    {
        " . ": null
    },
    {
        "Gonna Roll the Bones": "gonna roll the bones"
    },
    {
        " , his contribution to Harlan Ellisons  Dangerous Visions  anthology, received the ": null
    },
    {
        "Hugo Award for Best Novelette": "hugo award for best novelette"
    },
    {
        " and the ": null
    },
    {
        "Nebula Award for Best Novelette": "nebula award for best novelette"
    },
    {
        " in 1968.     Our Lady of Darkness —originally serialized in short form in  The Magazine of Fantasy & Science Fiction  under the title The Pale Brown Thing —featured cities as the breeding grounds for new types of ": null
    },
    {
        "elementals": "elemental"
    },
    {
        "called paramentals, summonable by the dark art of ": null
    },
    {
        "megapolisomancy": "megapolisomancy"
    },
    {
        ", with such activities centering on the ": null
    },
    {
        "Transamerica Pyramid": "transamerica pyramid"
    },
    {
        ". Its main characters include Franz Westen, Jaime Donaldus Byers, and the magician Thibault de Castries. Our Lady of Darkness won the ": null
    },
    {
        "World Fantasy Award—Novel": "world fantasy award—novel"
    },
    {
        ".     Leiber also did the 1966 novelization of the ": null
    },
    {
        "Clair Huffaker": "clair huffaker"
    },
    {
        " screenplay of  Tarzan and the Valley of Gold .      Many of Leibers most-acclaimed works are short stories, especially in the horror genre. Owing to such stories as The Smoke Ghost , The Girl With the Hungry Eyes and Youre All Alone , he is widely regarded as one of the forerunners of the modern urban horror story. Leiber also challenged the conventions of science fiction through reflexive narratives such as A Bad Day For Sales , in which the protagonist, Robie, America’s only genuine mobile salesrobot, Leiber, Fritz. A Bad Day For Sales . Sense of Wonder: A Century of Science Fiction. Ed. 1. Leigh Ronald Grossman. Wildside Press, 2011. 422. Print. references the title character of Isaac Asimov’s idealistic robot story, Robbie . Grossman, Leigh R. Ed. Sense of Wonder: A Century of Science Fiction. 1. Wildside Press, 2011. 421. Print. Questioning Isaac Asimov’s ": null
    },
    {
        "Three Laws of Robotics": "three laws of robotics"
    },
    {
        ", Leiber imagines the futility of automatons in a post-apocalyptic New York City. In his later years, Leiber returned to short story horror in such works as Horrible Imaginings , Black Has Its Charms and the award-winning The Button Moulder .       The short ": null
    },
    {
        "parallel worlds": "parallel universe"
    },
    {
        "story ": null
    },
    {
        "Catch That Zeppelin!": "catch that zeppelin!"
    },
    {
        " received the ": null
    },
    {
        "Hugo Award for Best Short Story": "hugo award for best short story"
    },
    {
        " and the ": null
    },
    {
        "Nebula Award for Best Short Story": "nebula award for best short story"
    },
    {
        " in 1976. This story shows a plausible alternate reality that is much better than our own, whereas the typical parallel universe story depicts a world that is much worse than our own. Belsen Express won the ": null
    },
    {
        "World Fantasy Award—Short Fiction": "world fantasy award—short fiction"
    },
    {
        ". Both stories reflect Leibers uneasy fascination with ": null
    },
    {
        "Nazism": "nazism"
    },
    {
        ", an uneasiness compounded by his mixed feelings about his German ancestry and his philosophical pacifism during World War II.     Leiber was named the second ": null
    },
    {
        "Gandalf Grand Master": "gandalf award"
    },
    {
        " of Fantasy by participants in the 1975 ": null
    },
    {
        "World Science Fiction Convention": "world science fiction convention"
    },
    {
        " , after the posthumous inaugural award to ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        ". Next year he won the ": null
    },
    {
        "World Fantasy Award for Life Achievement": "world fantasy award for life achievement"
    },
    {
        ". He was Guest of Honor at the 1979 Worldcon in Brighton, England . The ": null
    },
    {
        "Science Fiction Writers of America": "science fiction writers of america"
    },
    {
        " made him its fifth ": null
    },
    {
        "SFWA Grand Master": "sfwa grand master"
    },
    {
        " in 1981; the ": null
    },
    {
        "Horror Writers Association": "horror writers association"
    },
    {
        " made him an inaugural winner of the ": null
    },
    {
        "Bram Stoker Award for Lifetime Achievement": "bram stoker award for lifetime achievement"
    },
    {
        " in 1988 ; and the ": null
    },
    {
        "Science Fiction and Fantasy Hall of Fame": "emp museumscience fiction hall of fame"
    },
    {
        " inducted him in 2001, its sixth class of two deceased and two living writers.     Leiber was a founding member of the ": null
    },
    {
        "Swordsmen and Sorcerers Guild of America": "swordsmen and sorcerers guild of america"
    },
    {
        " , a loose-knit group of ": null
    },
    {
        "Heroic fantasy": "heroic fantasy"
    },
    {
        " authors founded in the 1960s, led by ": null
    },
    {
        "Lin Carter": "lin carter"
    },
    {
        ", with entry by fantasy credentials alone. Some works by SAGA members were published in ": null
    },
    {
        "Lin Carters": "lin carter"
    },
    {
        "  Flashing Swords!  anthologies. Leiber himself is credited with inventing the term ": null
    },
    {
        "sword and sorcery": "sword and sorcery"
    },
    {
        " for the particular subgenre of epic fantasy exemplified by his Fafhrd and Grey Mouser stories.     In an appreciation in the July 1969 Special Fritz Leiber Issue of The Magazine of Fantasy & Science Fiction, ": null
    },
    {
        "Judith Merril": "judith merril"
    },
    {
        " writes of Leibers connection with his readers: That this kind of personal response...is shared by thousands of other readers, has been made clear on several occasions. The November 1959 issue of  Fantastic , for instance: Leiber had just come out of one of his recurrent dry spells, and editor ": null
    },
    {
        "Cele Lalli": "cele goldsmith lalli"
    },
    {
        " bought up all his new material until there was enough to fill an issue; the magazine came out with a big black headline across its cover — Leiber Is Back!            His legacy appears to have been consolidated by the most famous of his creations, the Fafhrd and the Gray Mouser stories, written over a span of 50 years. The first of them, Two Sought Adventure , appeared in  Unknown , August 1939. They are concerned with an unlikely pair of heroes found in and around the city of ": null
    },
    {
        "Lankhmar": "lankhmar"
    },
    {
        ". Fafhrd was based on Leiber himself and the Mouser on his friend ": null
    },
    {
        "Harry Otto Fischer": "harry otto fischer"
    },
    {
        ", and the two characters were created in a series of letters exchanged by the two in the mid-1930s. These stories were among the progenitors of many of the ": null
    },
    {
        "tropes": "trope"
    },
    {
        " of the ": null
    },
    {
        "sword and sorcery": "sword and sorcery"
    },
    {
        " genre. They are also notable among sword and sorcery stories in that, over the course of the stories, his two heroes mature, take on more responsibilities, and eventually settle down into marriage.     Some Fafhrd and Mouser stories were recognized by annual genre awards: Scyllas Daughter was Short Story Hugo finalist and Ill Met in Lankhmar won the Best Novella Hugo and Nebula Awards. Leibers last major work, The Knight and Knave of Swords , brought the series to a close while leaving room for possible sequels. In the last year of his life, Leiber was considering allowing the series to be continued by other writers, but his sudden death made this more difficult. One new Fafhrd and the Mouser novel,  Swords Against the Shadowland , by ": null
    },
    {
        "Robin Wayne Bailey": "robin wayne bailey"
    },
    {
        ", did appear in 1998.     The stories were influential in shaping the genre and were influential on other works. ": null
    },
    {
        "Joanna Russ": "joanna russ"
    },
    {
        " stories about thief-assassin Alyx  were in part inspired by Fafhrd and the Gray Mouser, and Alyx in fact made guest appearances in two of Leibers stories. Numerous writers have paid homage to the stories. For instance, ": null
    },
    {
        "Terry Pratchetts": "terry pratchett"
    },
    {
        "city of ": null
    },
    {
        "Ankh-Morpork": "ankh-morpork"
    },
    {
        " bears something more than a passing resemblance to Lankhmar . More recently, playing off the visit of Fafhrd and the Grey Mouser to our world in Adepts Gambit , ": null
    },
    {
        "Steven Saylors": "steven saylor"
    },
    {
        "short story Ill Seen in Tyre takes his ": null
    },
    {
        "Roma Sub Rosa": "roma sub rosa"
    },
    {
        " series hero Gordianus to the city of Tyre a hundred years later, where the two visitors from Nehwon are remembered as local legends. Saylor, Steven, Ill Seen in Tyre , in the anthology Rogues, edited by Gardner Dozois and George R.R. Martin, Bantam, 2014.     Fischer and Leiber contributed to the original game design of the wargame  Lankhmar —published in 1976 by ": null
    },
    {
        "TSR": "tsr, inc."
    },
    {
        ".                     Two Sought Adventure  . Collection of six short stories. Later expanded and retitled as Swords Against Death.    Swords and Deviltry  . Collection of 3 short stories.    Swords Against Death  . Collection of 10 short stories; an expanded edition of Two Sought Adventure    Swords in the Mist  . Collection of 6 short stories.    Swords Against Wizardry  . Collection of 4 short stories.    The Swords of Lankhmar  . Expanded from Scyllas Daughter in  Fantastic , 1963.    Swords and Ice Magic  . Collection of 8 short stories.     The Knight and Knave of Swords  . Collection of 4 short stories. Retitled Farewell to Lankhmar .        Conjure Wife   — This novel relates a college professors discovery that his wife are regularly using ": null
    },
    {
        "magic": "magic"
    },
    {
        " against and for one another and their husbands.   Gather, Darkness!  – a dystopian, satirical depiction of a future ": null
    },
    {
        "theocracy": "theocracy"
    },
    {
        " and the revolution that brings it down.    Destiny Times Three      The Sinful Ones , an adulterated version of Youre All Alone ; Leiber rewrote the inserted passages and saw published a revised edition in 1980.   The Green Millennium   The Night of the Long Knives     The Big Time   — Change War series. Also available in Ship of Shadows – see Collections below.   The Silver Eggheads     The Wanderer     Tarzan and the Valley of Gold      A Spectre is Haunting Texas    Youre All Alone     Our Lady of Darkness  This novel, the title of which is drawn from ": null
    },
    {
        "Thomas de Quinceys": "thomas de quincey"
    },
    {
        "  Suspiria de Profundis , was published the same year as ": null
    },
    {
        "Dario Argentos": "dario argento"
    },
    {
        " Suspiria": "suspiria"
    },
    {
        ", which referenced the same idea in de Quincey. It also makes fictional reference to fellow novelists ": null
    },
    {
        "Jack London": "jack london"
    },
    {
        ", ": null
    },
    {
        "Clark Ashton Smith": "clark ashton smith"
    },
    {
        " and ": null
    },
    {
        "H.P. Lovecraft": "h.p. lovecraft"
    },
    {
        " and others.   Rime Isle    Ervool . A standalone edition of a short story originally published in the 1940s fanzine The Acolyte.   The Dealings of Daniel Kesserich — ": null
    },
    {
        "H. P. Lovecraft": "h. p. lovecraft"
    },
    {
        "ian novella written in 1936 and lost for decades   Dark Ladies . Omnibus edition of  Conjure Wife  and Our Lady of Darkness  Nights Black Agents  . Reprinted by Berkley, 1978 with the addition of two stories – The Girl With the Hungry Eyes and A Bit of the Dark World . The definitive hardcover edition is the Gregg Press edition, which adds a Foreword by ": null
    },
    {
        "Richard Powers": "richard powers"
    },
    {
        " to the complete contents of the Berkley edition.   The Mind Spider and Other Stories . Collection of 6 short stories.   Shadows With Eyes . Collection of 6 short stories.    A Pail of Air  . Collection of 11 short stories.   Ships to the Stars . Collection of 6 short stories.   The Night of the Wolf . Collection of 4 short stories.   The Secret Songs . Collection of 11 short stories.   Night Monsters . Collection of 4 short stories. UK edition drops 1 story and adds 4.    The Best of Fritz Leiber  . Collection of 22 short stories.     The Book of Fritz Leiber  . Collection of 10 stories and 9 articles.    The Second Book of Fritz Leiber  . Collection of 4 stories, 1 play, and 6 articles.    Bazaar of the Bizarre     Heroes and Horrors  . Collection of 9 stories.   Ship of Shadows . Collection of 5 award-winning short stories 3 stories 2 novellas & 1 novelThe BigTime. Victor Gollancz Dust Jacket bio.   Changewar . Collection of the Changewar short stories .   The Ghost Light . Collection of 9 stories with illustrations and an autobiographic essay with photographs.   The Leiber Chronicles Collection of 44 short stories.   Gummitch and Friends . Leibers cat stories, the first five of which feature Gummitch.   Ill Met in Lankhmar  combines Swords and Deviltry and Swords Against Death .   Lean Times in Lankhmar  combines Swords in the Mist and Swords Against Wizardry   Return to Lankhmar  combines The Swords of Lankhmar and Swords and Ice Magic   Farewell to Lankhmar    The Black Gondolier Collection of 18 short stories.   Smoke Ghost and Other Apparitions Collection of 18 short stories.   Day Dark, Night Bright   Horrible Imaginings Collection of 15 short stories.   Strange Wonders . Edited by ": null
    },
    {
        "Benjamin Szumskyj": "benjamin szumskyj"
    },
    {
        ". Collection of 48 unpublished and uncollected works .   Fritz Leiber: Selected Stories . Edited by ": null
    },
    {
        "Jonathan Strahan": "jonathan strahan"
    },
    {
        " and ": null
    },
    {
        "Charles N. Brown": "charles n. brown"
    },
    {
        ". Collection of 17 stories, with an introduction by ": null
    },
    {
        "Neil Gaiman": "neil gaiman"
    },
    {
        ".       Quicks Around the Zodiac: A Farce. . .       The Mystery of the Japanese Clock. A standalone essay on the workings of a digital Japanese clock. Montgolfier Press, 1982, with Introduction by his son ": null
    },
    {
        "Justin Leiber": "justin leiber"
    },
    {
        ". .       Demons of the Upper Air .    Sonnets to Jonquil and All .       Conjure Wife has been made into feature films three times under other titles:    Weird Woman  starring ": null
    },
    {
        "Lon Chaney Jr.": "lon chaney jr."
    },
    {
        ". One of six Inner Sanctum mystery films made by Universal Studios based upon the old ": null
    },
    {
        "Inner Sanctum": "inner sanctum mystery"
    },
    {
        " radio series.   Conjure Wife was also adapted for the 1960 TV series Moment of Fear    Night of the Eagle       Witches Brew   Directed by Richard Shore and starring ": null
    },
    {
        "Teri Garr": "teri garr"
    },
    {
        " and ": null
    },
    {
        "Richard Benjamin": "richard benjamin"
    },
    {
        ".     A new film adaptation of Conjure Wife was announced in 2008, to be filmed by US director ": null
    },
    {
        "Billy Ray": "billy ray"
    },
    {
        ". It is slated to be a United Artists/Studio Canal co-production. , UPI , December 19, 2008. Retrieved July 17, 2010.     ": null
    },
    {
        " The Girl with the Hungry Eyes was filmed under that title": "the girl with the hungry eyes"
    },
    {
        " by Kastenbaum Films in 1995. .     Two Leiber stories were filmed for TV for ": null
    },
    {
        "Rod Serlings": "rod serling"
    },
    {
        "  Night Gallery ": null
    }
]