[
    {
        "        Fruit tree pruning is the ": null
    },
    {
        "cutting and removing of selected parts": "pruning"
    },
    {
        " of a ": null
    },
    {
        "fruit tree": "fruit tree"
    },
    {
        ". It spans a number of ": null
    },
    {
        "horticultural": "horticulture"
    },
    {
        " techniques. Pruning often means cutting ": null
    },
    {
        "branch": "branch"
    },
    {
        "es back, sometimes removing smaller limbs entirely. It may also mean removal of young ": null
    },
    {
        "shoot": "shoot"
    },
    {
        "s, buds, and ": null
    },
    {
        "leaves": "leaf"
    },
    {
        ".     Established ": null
    },
    {
        "orchard": "orchard"
    },
    {
        " practice of both ": null
    },
    {
        "organic": "organic farming"
    },
    {
        " and nonorganic types typically includes pruning. Pruning can control growth, remove dead or diseased ": null
    },
    {
        "wood": "wood"
    },
    {
        ", and stimulate the formation of ": null
    },
    {
        "flowers": "flowers"
    },
    {
        " and ": null
    },
    {
        "fruit buds": "bud"
    },
    {
        ". It is widely stated that careful attention to pruning and training young trees improves their later productivity and longevity, and that good pruning and training can also prevent later injury from weak ": null
    },
    {
        "crotches or forks": "tree fork"
    },
    {
        " that break from the weight of fruit, snow, or ice on the branches.     Some ": null
    },
    {
        "sustainable agriculture": "sustainable agriculture"
    },
    {
        " or ": null
    },
    {
        "permaculture": "permaculture"
    },
    {
        " personalities, such as ": null
    },
    {
        "Sepp Holzer": "sepp holzer"
    },
    {
        " and ": null
    },
    {
        "Masanobu Fukuoka": "masanobu fukuoka"
    },
    {
        ", advocate and practice no-pruning methods, which runs counter to the widespread confidence in the idea that pruning produces superior results compared with not pruning. Many books about fruit-growing assert advantages and disadvantages of pruning or not pruning, although without ": null
    },
    {
        "randomized controlled trial": "randomized controlled trial"
    },
    {
        "s, it is hard to separate ": null
    },
    {
        "theorizing": "theory"
    },
    {
        " and ": null
    },
    {
        "traditional knowledge": "traditional knowledge"
    },
    {
        " from ": null
    },
    {
        "evidence": "evidence"
    },
    {
        "-based recommendations.            Plants form new tissue in an area called the ": null
    },
    {
        "meristem": "meristem"
    },
    {
        ", located near the tips of roots and shoots, where active cell division takes place. Meristem growth is aimed at ensuring that leaves are quickly elevated into sunlight, and that roots are able to penetrate deeply into the ": null
    },
    {
        "soil": "soil"
    },
    {
        ". Once adequate height and length is achieved by the stems and roots, they begin to thicken to support the plant. On the shoots, these growing tips of the plant are called apical buds. The  apical meristem  produces the growth hormone ": null
    },
    {
        "auxin": "auxin"
    },
    {
        ", which not only promotes cell division, but also diffuses downwards and inhibits the development of lateral bud growth that otherwise competes with the apical tip for light and nutrients. Removing the apical tip and its suppressive hormone lets lower, dormant lateral buds develop, and the buds between the leaf stalk and stem produce new shoots that compete to become lead growth.     Manipulating this natural response to damage  by processes such as pruning  allows the arborist to determine the shape, size, and productivity of many fruiting trees and bushes. The main aim when pruning fruit trees is usually to maximize fruit yield. Unpruned trees tend to produce large numbers of small fruits that may be difficult to reach when harvesting by hand. Branches can become broken by the weight of the crop, and the cropping may become ": null
    },
    {
        "biennial": "biennial plant"
    },
    {
        " . Overpruned trees on the other hand tend to produce light crops of large, flavourless fruit that does not store well. Careful pruning balances shoot growth and fruit production.     One of the simplest instructions given in nearly every article or book chapter on the subject is that no branches should cross each other, that is, rub against each other, and that one of them should be selected and removed.       In the early years of the trees life, it is important to develop a framework sufficiently strong to bear the weight of crops. This requires formative pruning to reinforce the tree. Formative pruning of ": null
    },
    {
        "apple": "apple"
    },
    {
        "  and ": null
    },
    {
        "pear": "pear"
    },
    {
        "  trees should be carried out in the dormant winter months. For the ": null
    },
    {
        "Northern hemisphere": "northern hemisphere"
    },
    {
        ", this should occur between November and March; For the ": null
    },
    {
        "Southern hemisphere": "southern hemisphere"
    },
    {
        ", June and September. ": null
    },
    {
        "Stone fruits": "prunus"
    },
    {
        "—such as ": null
    },
    {
        "cherries": "cherry"
    },
    {
        ", ": null
    },
    {
        "plum": "plum"
    },
    {
        "s, and ": null
    },
    {
        "gages": "greengage"
    },
    {
        "—have different requirements, and should not be pruned in dormant months.       Image:Pruningyear42png|One-year-old tree   Image:Pruningyear42png|Two-year-old tree   Image:Pruningyear42png|Three-year-old tree   Image:Pruningyear42png|Four-year-old tree         A maiden whip should be pruned to a bud with two buds below it at about 42  cm from the ground immediately after planting to produce primary branches during the first growing season. A feathered maiden should have its main stem pruned back to three or four strong shoots at 42  cm from the ground. Side shoots should be shortened by two thirds of their length to an upward or outward facing bud. Lower shoots should be removed flush with the stem.       Remove lower shoots and prune between three and five of the best-placed shoots by half to an upwards or outwards facing bud to form what becomes the trees main structural branches. Remove any inward-facing shoots.       Prune leading shoots of branches selected to extend the framework by half, to a bud facing in the desired direction. Select four good laterals to fill the framework and shorten these by a half. Prune any remaining laterals to four buds to form ": null
    },
    {
        "fruiting spur": "fruiting spur"
    },
    {
        "s.       The tree has begun to fruit and requires only limited formative pruning. Shorten leaders by one third and prune laterals not required to extend the framework to four buds.       The tree is established, and should be pruned annually as described in the following section.          Before pruning, distinguish between spur-bearing varieties, tip-bearing varieties, and an intermediate between the two that bears both on spurs and at the tips. Spur-bearing trees occur more frequently than tip-bearing trees, and they bear most of their fruit yearly at the end of short lateral pieces of wood up to about 42  inches long.     Spur-bearing types include apples of the varieties ": null
    },
    {
        "Coxs Orange Pippin": "coxs orange pippin"
    },
    {
        ", ": null
    },
    {
        "James Grieve": "james grieve apple"
    },
    {
        " and Sunset, and pears such as Conference, Doyenne du Commice, and Williams Bon Chretien. Tip-bearers on the other hand produce most of their fruit buds at the tips of slender shoots grown the previous summer, and include the apples ": null
    },
    {
        "Worcester Pearmain": "worcester pearmain"
    },
    {
        " and Irish Peach, and the pears such as Jargonelle and Josephine de Malines. There are basically three types of pruning that are applied once the main shape of the tree has been established. These are:      Spur pruning: Spur bearing varieties form spurs naturally, but spur growth can also be induced.   Renewal pruning: This also depends on the tendency of many apple and pear trees to form flower buds on unpruned two-year-old laterals. It is a technique best used for the strong laterals on the outer part of the tree where there is room for such growth. Pruning long-neglected fruit trees is a task that should be undertaken over a lengthy period, with not more than one third of the branches that require removal being taken each year.   Regulatory pruning": null
    }
]