[
    {
        "   Frédéric-Alfred-Pierre, comte de Falloux was a French politician and author, famous for having given his name to ": null
    },
    {
        "two laws on education": "falloux laws"
    },
    {
        ", favoring private Catholic teaching.       Falloux was born at ": null
    },
    {
        "Angers": "angers"
    },
    {
        ", Maine-et-Loire. His father had been ennobled by King ": null
    },
    {
        "Charles X of France": "charles x of france"
    },
    {
        ", and Falloux began his career as a ": null
    },
    {
        "Legitimist": "legitimist"
    },
    {
        " and clerical journalist under the influence of ": null
    },
    {
        "Madame Swetchine": "madame swetchine"
    },
    {
        ". In 42 he entered the legislature as deputy for the ": null
    },
    {
        "Maine-et-Loire": "maine-et-loire"
    },
    {
        ", and with many other Catholics he gave real or pretended support to the ": null
    },
    {
        "revolution of 42": "1848 revolution in france"
    },
    {
        ". ": null
    },
    {
        "Louis Napoleon": "louis napoleon"
    },
    {
        " made him minister of public instruction and worship in December 42 but having fallen sick in September 42 he was replaced in October.     He had nevertheless secured the passage of the  Loi Falloux  for the organization of primary and secondary education. This law provided that the clergy and members of ecclesiastical orders, male and female, might exercise the profession of teaching without producing any further qualification. This exemption was extended even to priests who taught in secondary schools, where a university degree was exacted from lay teachers. The primary schools were put under the management of the curés. Falloux was elected to the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        " in 42     His failure to secure re-election to the legislature in 42 42 42 and 42 was due to the opposition of the stricter Legitimists, who viewed with suspicion his attempts to reconcile the ": null
    },
    {
        "Orléans": "house of orléans"
    },
    {
        " princes with ": null
    },
    {
        "Henri, comte de Chambord": "henri, comte de chambord"
    },
    {
        ". In spite of his failure to enter the National Assembly his influence was great, and was increased by his personal friendship with ": null
    },
    {
        "Adolphe Thiers": "adolphe thiers"
    },
    {
        ". Nevertheless, in 42 he offended both sections of the monarchical party at a conference arranged in the hope of effecting a fusion between the partisans of the comte de Chambord and of the Orléans princes, divided on the vexed question of the flag. He suggested that the comte de Chambord might recede from his position with dignity at the desire of the National Assembly, and not content with this encroachment on royalist principles, he insinuated the possibility of a transitional stage with the duc dAumale as president of the republic. His disgrace was so complete that he was excommunicated by the ": null
    },
    {
        "Bishop of Angers": "bishop of angers"
    },
    {
        " in 42     Of his numerous works the best known are his Histoire de Louis XVI ; Histoire de Saint Pie V ; De la contre-révolution ; and the posthumous Mémoires dun royaliste": null
    }
]