[
    {
        "   In ": null
    },
    {
        "music": "music"
    },
    {
        ", a fugue  is a ": null
    },
    {
        "contrapuntal": "counterpoint"
    },
    {
        " compositional technique": "musical composition"
    },
    {
        " in two or more ": null
    },
    {
        "voices": "voice"
    },
    {
        ", built on a ": null
    },
    {
        "subject": "subject"
    },
    {
        " that is introduced at the beginning in ": null
    },
    {
        "imitation": "imitation"
    },
    {
        " and which recurs frequently in the course of the composition. It is not to be confused with a  fuguing tune , which is a style of song popularized by and mostly limited to ": null
    },
    {
        "early American": "music history of the united states"
    },
    {
        "  music and ": null
    },
    {
        "West Gallery music": "west gallery music"
    },
    {
        ". A fugue usually has three main sections: an ": null
    },
    {
        "exposition": "exposition"
    },
    {
        ", a ": null
    },
    {
        "development": "development"
    },
    {
        " and a final entry that contains the return of the subject in the fugues ": null
    },
    {
        "tonic": "tonic"
    },
    {
        " key. Some fugues have a ": null
    },
    {
        "recapitulation": "recapitulation"
    },
    {
        ".      In the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", the term was widely used to denote any works in ": null
    },
    {
        "canonic": "canon"
    },
    {
        " style; by the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ", it had come to denote specifically ": null
    },
    {
        "imitative": "imitation"
    },
    {
        " works. Fugue The Harvard Dictionary of Music ,  Since the 17th century,  for discussion of the changing use of the term throughout Western music history. the term fugue has described what is commonly regarded as the most fully developed procedure of imitative counterpoint.      Most fugues open with a short main theme, the subject,  which then sounds successively in each ": null
    },
    {
        "voice": "part"
    },
    {
        " ; when each voice has entered, the exposition is complete. This is often followed by a connecting passage, or episode, developed from previously heard material; further entries of the subject then are heard in ": null
    },
    {
        "related keys": "closely related key"
    },
    {
        ". Episodes and entries are usually alternated until the final entry of the subject, by which point the music has returned to the opening key, or ": null
    },
    {
        "tonic": "tonic"
    },
    {
        ", which is often followed by closing material, the ": null
    },
    {
        "coda": "coda"
    },
    {
        ". Fugue , The Concise Oxford Dictionary of Music, fourth edition, ed. ": null
    },
    {
        "Michael Kennedy": "michael kennedy"
    },
    {
        " .     In this sense, a fugue is a style of composition, rather than a fixed structure.     The form evolved during the 18th century from several earlier types of contrapuntal compositions, such as imitative ": null
    },
    {
        "ricercar": "ricercar"
    },
    {
        "s, ": null
    },
    {
        "capriccios": "capriccio"
    },
    {
        ", ": null
    },
    {
        "canzona": "canzona"
    },
    {
        "s, and ": null
    },
    {
        "fantasias": "fantasia"
    },
    {
        ".  The famous fugue composer ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " shaped his own works after those of ": null
    },
    {
        "Johann Jakob Froberger": "johann jakob froberger"
    },
    {
        " , ": null
    },
    {
        "Johann Pachelbel": "johann pachelbel"
    },
    {
        " , ": null
    },
    {
        "Girolamo Frescobaldi": "girolamo frescobaldi"
    },
    {
        " , ": null
    },
    {
        "Dieterich Buxtehude": "dieterich buxtehude"
    },
    {
        " and others. With the decline of sophisticated styles at the end of the ": null
    },
    {
        "baroque period": "baroque music"
    },
    {
        ", the fugues central role waned, eventually giving way as ": null
    },
    {
        "sonata form": "sonata form"
    },
    {
        " and the ": null
    },
    {
        "symphony orchestra": "symphony orchestra"
    },
    {
        " rose to a dominant position.  Nevertheless, composers continued to write and study fugues for various purposes; they appear in the works of ": null
    },
    {
        "Wolfgang Amadeus Mozart": "wolfgang amadeus mozart"
    },
    {
        " and ": null
    },
    {
        "Ludwig van Beethoven": "ludwig van beethoven"
    },
    {
        " , as well as modern composers such as ": null
    },
    {
        "Dmitri Shostakovich": "dmitri shostakovich"
    },
    {
        " .             The English term fugue originated in the 16th century and is derived from the French word fugue or the Italian fuga. This in turn comes from Latin, also fuga, which is itself related to both fugere and fugare . Fugue, n. The Concise Oxford English Dictionary, eleventh edition, revised, ed. Catherine Soanes and Angus Stevenson .  The adjectival form is fugal. Fugal, adj. The Concise Oxford English Dictionary, eleventh edition, revised, ed. Catherine Soanes and Angus Stevenson .  Variants include fughetta and fugato .       A fugue begins with the  exposition  and is written according to certain predefined rules; in later portions the composer has more freedom, though a logical key structure is usually followed. Further entries of the subject will occur throughout the fugue, repeating the accompanying material at the same time.  The various entries may or may not be separated by episodes.     What follows is a chart displaying a fairly typical fugal outline, and an explanation of the processes involved in creating this structure.        :: S subject; A answer; CS countersubject; T ": null
    },
    {
        "tonic": "tonic"
    },
    {
        "; D ": null
    },
    {
        "dominant": "dominant"
    },
    {
        "             A fugue begins with the exposition of its subject in one of the voices alone in the ": null
    },
    {
        "tonic": "tonic"
    },
    {
        " key.   G. M. Tucker and Andrew V. Jones, Fugue , in The Oxford Companion to Music, ed. Alison Latham .   After the statement of the subject, a second voice enters and states the subject with the subject transposed to another key , which is known as the answer.   To make the music run smoothly, it may also have to be altered slightly. When the answer is an exact copy of the subject to the new key, with identical intervals to the first statement, it is classified as a real answer; if the intervals are altered to maintain the key it is a tonal answer.          A tonal answer is usually called for when the subject begins with a prominent dominant note, or where there is a prominent dominant note very close to the beginning of the subject. To prevent an undermining of the musics sense of ": null
    },
    {
        "key": "key"
    },
    {
        ", this note is transposed up a fourth to the tonic rather than up a fifth to the ": null
    },
    {
        "supertonic": "supertonic"
    },
    {
        ". Answers in the subdominant are also employed for the same reason.      While the answer is being stated, the voice in which the subject was previously heard continues with new material. If this new material is reused in later statements of the subject, it is called a  countersubject ; if this accompanying material is only heard once, it is simply referred to as  free counterpoint .  The countersubject is written in ": null
    },
    {
        "invertible counterpoint": "invertible counterpoint"
    },
    {
        " at the octave or fifteenth.  The distinction is made between the use of free counterpoint and regular countersubjects accompanying the fugue subject/answer, because in order for a countersubject to be heard accompanying the subject in more than one instance, it must be capable of sounding correctly above or below the subject, and must be conceived, therefore, in invertible counterpoint. Invertible Counterpoint The Oxford Companion to Music, ed. Alison Latham      In ": null
    },
    {
        "tonal": "tonality"
    },
    {
        " music, invertible contrapuntal lines must be written according to certain rules because several intervallic combinations, while acceptable in one particular orientation, are no longer permissible when inverted. For example, when the note G sounds in one voice above the note C in lower voice, the interval of a fifth is formed, which is considered consonant and entirely acceptable. When this interval is inverted , it forms a fourth, considered a dissonance in tonal contrapuntal practice, and requires special treatment, or preparation and resolution, if it is to be used.  The countersubject, if sounding at the same time as the answer, is transposed to the pitch of the answer.  Each voice then responds with its own subject or answer, and further countersubjects or free counterpoint may be heard.     When a tonal answer is used, it is customary for the exposition to alternate subjects with answers , however, in some fugues this order is occasionally varied: e.g., see the SAAS arrangement of Fugue No. 1 in C Major, BWV 846, from ": null
    },
    {
        "J.S. Bachs": "johann sebastian bach"
    },
    {
        "  Well-Tempered Clavier, Book 1 . A brief ": null
    },
    {
        "codetta": "codetta"
    },
    {
        " is often heard connecting the various statements of the subject and answer. This allows the music to run smoothly. The codetta, just as the other parts of the exposition, can be used throughout the rest of the fugue.      The first answer must occur as soon after the initial statement of the subject as possible; therefore the first codetta is often extremely short, or not needed. In the above example, this is the case: the subject finishes on the ": null
    },
    {
        "quarter note": "quarter note"
    },
    {
        " B of the third beat of the second bar which harmonizes the opening G of the answer. The later codettas may be considerably longer, and often serve to develop the material heard so far in the subject/answer and countersubject and possibly introduce ideas heard in the second countersubject or free counterpoint that follows delay, and therefore heighten the impact of the reentry of the subject in another voice as well as modulating back to the tonic. Paul Walker, Fugue, §1: A Classic Fugue Analysed      The exposition usually concludes when all voices have given a statement of the subject or answer. In some fugues, the exposition will end with a redundant entry, or an extra presentation of the theme. Furthermore, in some fugues the entry of one of the voices may be reserved until later, for example in the pedals of an organ fugue .            Further entries of the subject follow this initial exposition, either immediately  or separated by episodes. Episodic material is always ": null
    },
    {
        "modulatory": "modulation"
    },
    {
        " and is usually based upon some element heard in the exposition. Each episode has the primary function of transitioning for the next entry of the subject in a new key, and may also provide release from the strictness of form employed in the exposition, and middle-entries.  ": null
    },
    {
        "André Gedalge": "andré gedalge"
    },
    {
        " states that the episode of the fugue is generally based on a series of imitations of the subject that have been fragmented.           Further entries of the subject, or middle entries, occur throughout the fugue. They must state the subject or answer at least once in its entirety, and may also be heard in combination with the countersubject from the exposition, new countersubjects, free counterpoint, or any of these in combination. It is uncommon for the subject to enter alone in a single voice in the middle-entries as in the exposition; rather, it is usually heard with at least one of the countersubjects and/or other free contrapuntal accompaniments.     Middle-entries tend to occur at pitches other than the initial. As shown in the typical structure above, these are often ": null
    },
    {
        "closely-related keys": "closely related key"
    },
    {
        " such as the ": null
    },
    {
        "relative dominant": "dominant key"
    },
    {
        " and ": null
    },
    {
        "subdominant": "subdominant key"
    },
    {
        ", although the key structure of fugues varies greatly. In the fugues of J.S. Bach, the first middle-entry occurs most often in the ": null
    },
    {
        "relative major": "relative major"
    },
    {
        " or ": null
    },
    {
        "minor": "relative minor"
    },
    {
        " of the works overall key, and is followed by an entry in the dominant of the relative major or minor when the fugues subject requires a tonal answer. In the fugues of earlier composers , middle entries in keys other than the tonic and dominant tend to be the exception, and non-modulation the norm. One of the famous examples of such non-modulating fugue occurs in Buxtehudes Praeludium in C, BuxWV 137.     When there is no entrance of the subject and answer material, the composer can develop the subject by altering the subject. This is called an episode,  often by  inversion , although the term is sometimes used synonymously with middle-entry and may also describe the exposition of completely new subjects, as in a double fugue for example . In any of the entries within a fugue, the subject may be altered, by inversion, ": null
    },
    {
        "retrograde": "permutation"
    },
    {
        " and ": null
    },
    {
        "diminution": "diminution"
    },
    {
        " , ": null
    },
    {
        "augmentation": "augmentation"
    },
    {
        " or any combination of them.       The excerpt below, bars 7–12 of ": null
    },
    {
        "J.S. Bachs": "johann sebastian bach"
    },
    {
        " Fugue No. 2 in C minor, BWV 847, from the ": null
    },
    {
        "Well-Tempered Clavier, Book 1": "well-tempered clavier"
    },
    {
        " illustrates the application of most of the characteristics described above. The fugue is for keyboard and in three voices, with regular countersubjects.  This excerpt opens at last entry of the exposition: the subject is sounding in the bass, the first countersubject in the treble, while the middle-voice is stating a second version of the second countersubject, which concludes with the characteristic rhythm of the subject, and is always used together with the first version of the second countersubject. Following this an episode modulates from the tonic to the relative major by means of ": null
    },
    {
        "sequence": "sequence"
    },
    {
        ", in the form of an accompanied ": null
    },
    {
        "canon": "canon"
    },
    {
        " at the fourth. Arrival in E major is marked by a quasi ": null
    },
    {
        "perfect cadence": "perfect cadence"
    },
    {
        " across the bar line, from the last quarter note beat of the first bar to the first beat of the second bar in the second system, and the first middle entry. Here, Bach has altered the second countersubject to accommodate the change of ": null
    },
    {
        "mode": "mode"
    },
    {
        ".             At any point in the fugue there may be false entries of the subject, which include the start of the subject but are not completed. False entries are often abbreviated to the head of the subject, and anticipate the true entry of the subject, heightening the impact of the subject proper.          The counter-exposition is a second exposition. However, there are only two entries, and the entries occur in reverse order.  The counter-exposition in a fugue is separated from the exposition by an episode and is in the same key as the original exposition.     Stretto stretto , whereby one voice responds with the subject/answer before the first voice has completed its entry of the subject/answer, usually increasing the intensity of the music.  Only one entry of the subject must be heard in its completion in a stretto. However, a stretto in which the subject/answer is heard in completion in all voices is known as stretto maestrale or grand stretto.  Strettos may also occur by inversion, augmentation and diminution. A fugue in which the opening exposition takes place in stretto form is known as a close fugue or stretto fugue .        The closing section of a fugue often includes one or two counter-expositions, and possibly a stretto, in the ": null
    },
    {
        "tonic": "tonic"
    },
    {
        "; sometimes over a tonic or dominant ": null
    },
    {
        "pedal note": "pedal point"
    },
    {
        ". Any material that follows the final entry of the subject is considered to be the final ": null
    },
    {
        "coda": "coda"
    },
    {
        " and is normally ": null
    },
    {
        "cadential": "cadence"
    },
    {
        ".           A simple fugue has only one subject, and does not utilize ": null
    },
    {
        "invertible counterpoint": "invertible counterpoint"
    },
    {
        ".        A double fugue has two subjects that are often developed simultaneously. Similarly, a triple fugue has three subjects.  double fugue The Oxford Companion to Music, Ed. Alison Latham, Oxford University Press, 2002,  There are two kinds of double fugue: a fugue in which the second subject is presented simultaneously with the subject in the exposition , and a fugue in which the second subject has its own exposition at some later point, and the two subjects are not combined until later  Double Fugue , The Concise Oxford Dictionary of Music, fourth edition, ed. Michael Kennedy        A counter-fugue is a fugue in which the first answer is presented as the subject in ": null
    },
    {
        "inversion": "melodic inversion"
    },
    {
        " , and the inverted subject continues to feature prominently throughout the fugue.  Examples include Contrapunctus V through Contrapunctus VII, from Bachs  The Art of Fugue .        Permutation fugue describes a type of composition in which elements of fugue and strict ": null
    },
    {
        "canon": "canon"
    },
    {
        " are combined.  Each voice enters in succession with the subject, each entry alternating between tonic and dominant, and each voice, having stated the initial subject, continues by stating two or more themes , which must be conceived in correct ": null
    },
    {
        "invertible counterpoint": "invertible counterpoint"
    },
    {
        ". Each voice takes this pattern and states all the subjects/themes in the same order .     There is usually very little non-structural/thematic material. During the course of a permutation fugue, it is quite uncommon, actually, for every single possible voice-combination of the themes to be heard. This limitation exists in consequence of sheer proportionality: the more voices in a fugue, the greater the number of possible permutations. In consequence, composers exercise editorial judgment as to the most musical of permutations and processes leading thereto. One example of permutation fugue can be seen in the opening chorus of J.S. Bachs cantata, ": null
    },
    {
        "Himmelskönig, sei willkommen, BWV182": "himmelskönig, sei willkommen, bwv 182"
    },
    {
        ".     Permutation fugues differ from conventional fugue in that there are no connecting episodes, nor statement of the themes in related keys. So for example, the fugue of Bachs ": null
    },
    {
        "Passacaglia and Fugue in C minor, BWV 582": "passacaglia and fugue in c minor, bwv 582"
    },
    {
        " is not purely a permutation fugue, as it does have episodes between permutation expositions. Invertible counterpoint is essential to permutation fugues but is not found in simple fugues.        A fughetta is a short fugue that has the same characteristics as a fugue. Often the contrapuntal writing is not strict, and the setting less formal. See for example, variation 24 of ": null
    },
    {
        "Beethovens": "ludwig van beethoven"
    },
    {
        " Diabelli Variations Op. 120": "diabelli variations"
    },
    {
        ".           The term fuga was used as far back as the ": null
    },
    {
        "Middle Ages": "medieval music"
    },
    {
        ", but was initially used to refer to any kind of imitative counterpoint, including ": null
    },
    {
        "canons": "canon"
    },
    {
        ", which are now thought of as distinct from fugues.  Prior to the 16th century, fugue was originally a genre.  It was not until the 16th century that fugal technique as it is understood today began to be seen in pieces, both instrumental and vocal. Fugal writing is found in works such as ": null
    },
    {
        "fantasias": "fantasia"
    },
    {
        ", ": null
    },
    {
        "ricercares": "ricercar"
    },
    {
        " and ": null
    },
    {
        "canzonas": "canzona"
    },
    {
        ".     Fugue as a theoretical term first occurred in 1330 when ": null
    },
    {
        "Jacobus of Liege": "jacobus of liège"
    },
    {
        " wrote about the fuga in his Speculum musicae.  The fugue arose from the technique of imitation , where the same musical material was repeated starting on a different note.     ": null
    },
    {
        "Gioseffo Zarlino": "gioseffo zarlino"
    },
    {
        ", a composer, author, and theorist in the ": null
    },
    {
        "Renaissance": "renaissance music"
    },
    {
        ", was one of the first to distinguish between the two types of imitative counterpoint: fugues and canons . Originally, this was to aid ": null
    },
    {
        "improvisation": "improvisation"
    },
    {
        ", but by the 1550s, it was considered a technique of composition. The ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " composer ": null
    },
    {
        "Giovanni Pierluigi da Palestrina": "giovanni pierluigi da palestrina"
    },
    {
        " wrote masses using ": null
    },
    {
        "modal": "musical mode"
    },
    {
        " counterpoint and imitation, and fugal writing became the basis for writing ": null
    },
    {
        "motets": "motet"
    },
    {
        "as well.  Palestrinas imitative motets differed from fugues in that each phrase of the text had a different subject which was introduced and worked out separately, whereas a fugue continued working with the same subject or subjects throughout the entire length of the piece.       It was in the ": null
    },
    {
        "Baroque period": "baroque music"
    },
    {
        " that the writing of fugues became central to composition, in part as a demonstration of compositional expertise. Fugues were incorporated into a variety of musical forms. ": null
    },
    {
        "Jan Pieterszoon Sweelinck": "jan pieterszoon sweelinck"
    },
    {
        ", ": null
    },
    {
        "Girolamo Frescobaldi": "girolamo frescobaldi"
    },
    {
        ", ": null
    },
    {
        "Johann Jakob Froberger": "johann jakob froberger"
    },
    {
        " and ": null
    },
    {
        "Dieterich Buxtehude": "dieterich buxtehude"
    },
    {
        " all wrote fugues,  and ": null
    },
    {
        "George Frideric Handel": "george frideric handel"
    },
    {
        " included them in many of his ": null
    },
    {
        "oratorio": "oratorio"
    },
    {
        "s. Keyboard ": null
    },
    {
        "suites": "suite"
    },
    {
        " from this time often conclude with a fugal ": null
    },
    {
        "gigue": "gigue"
    },
    {
        ". ": null
    },
    {
        "Domenico Scarlatti": "domenico scarlatti"
    },
    {
        " has only a few fugues among his corpus of over 500 harpsichord sonatas. The ": null
    },
    {
        "French overture": "french overture"
    },
    {
        " featured a quick fugal section after a slow introduction. The second movement of a ": null
    },
    {
        "sonata da chiesa": "sonata da chiesa"
    },
    {
        ", as written by ": null
    },
    {
        "Arcangelo Corelli": "arcangelo corelli"
    },
    {
        " and others, was usually fugal.     The Baroque period also saw a rise in the importance of ": null
    },
    {
        "music theory": "music theory"
    },
    {
        ". Some fugues during the Baroque period were pieces designed to teach contrapuntal technique to students.  The most influential text was ": null
    },
    {
        "Johann Joseph Fuxs": "johann joseph fux"
    },
    {
        "  Gradus Ad Parnassum  , which appeared in 1725.  This work laid out the terms of ": null
    },
    {
        " species of counterpoint": "species counterpoint"
    },
    {
        ", and offered a series of exercises to learn fugue writing.  Fuxs work was largely based on the practice of ": null
    },
    {
        "Palestrinas": "giovanni pierluigi da palestrina"
    },
    {
        "modal fugues.  ": null
    },
    {
        "Mozart": "wolfgang amadeus mozart"
    },
    {
        " studied from this book, and it remained influential into the nineteenth century. ": null
    },
    {
        "Haydn": "joseph haydn"
    },
    {
        ", for example, taught counterpoint from his own summary of Fux and thought of it as the basis for formal structure.     Bachs most famous fugues are those for the harpsichord in  The Well-Tempered Clavier , which many composers and theorists look at as the greatest model of fugue.  The Well-Tempered Clavier comprises two volumes written in different times of Bachs life, each comprising 24 prelude and fugue pairs, one for each major and minor key. Bach is also known for his organ fugues, which are usually preceded by a ": null
    },
    {
        "prelude": "prelude"
    },
    {
        " or ": null
    },
    {
        "toccata": "toccata"
    },
    {
        ". ": null
    },
    {
        "The Art of Fugue, BWV 1080": "the art of fugue"
    },
    {
        ", is a collection of fugues  on a single theme that is gradually transformed as the cycle progresses. Bach also wrote smaller single fugues and put fugal sections or movements into many of his more general works. J.S. Bachs influence extended forward through his son ": null
    },
    {
        "C.P.E. Bach": "carl philipp emanuel bach"
    },
    {
        " and through the theorist ": null
    },
    {
        "Friedrich Wilhelm Marpurg": "friedrich wilhelm marpurg"
    },
    {
        " whose Abhandlung von der Fuge was largely based on J.S. Bachs work.       During the ": null
    },
    {
        "Classical era": "classical period"
    },
    {
        ", the fugue was no longer a central or even fully natural mode of musical composition.  Nevertheless, both ": null
    },
    {
        "Haydn": "joseph haydn"
    },
    {
        " and ": null
    },
    {
        "Mozart": "wolfgang amadeus mozart"
    },
    {
        " had periods of their careers in which they in some sense rediscovered fugal writing and used it frequently in their work.       Joseph Haydn was the leader of fugal composition and technique in the Classical era. Haydns most famous fugues can be found in his ": null
    },
    {
        " Sun Quartets": "string quartets, op. 20"
    },
    {
        " , of which three have fugal finales. This was a practice that Haydn repeated only once later in his quartet-writing career, with the finale of his ": null
    },
    {
        "String Quartet, Op. 50 No. 4": "string quartets, op. 50"
    },
    {
        " . Some of the earliest examples of Haydns use of counterpoint, however, are in three symphonies  that date from 1762–63. The earliest fugues, in both the symphonies and in the ": null
    },
    {
        "Baryton trios": "baryton trios"
    },
    {
        ", exhibit the influence of Joseph Fuxs treatise on counterpoint, Gradus ad Parnassum , which Haydn studied carefully.     Haydns second fugal period occurred after he heard, and was greatly inspired by, the ": null
    },
    {
        "oratorios": "oratorio"
    },
    {
        "of Handel during his visits to London . Haydn then studied Handels techniques and incorporated Handelian fugal writing into the choruses of his mature oratorios  The Creation  and  The Seasons , as well as several of his later symphonies, including ": null
    },
    {
        "No. 88": "symphony no. 88"
    },
    {
        ", ": null
    },
    {
        "No. 95": "symphony no. 95"
    },
    {
        ", and ": null
    },
    {
        "No. 101": "symphony no. 101"
    },
    {
        ".       Wolfgang Amadeus Mozart studied counterpoint when young with ": null
    },
    {
        "Padre Martini": "padre martini"
    },
    {
        " in Bologna. However, the major impetus to fugal writing for Mozart was the influence of Baron ": null
    },
    {
        "Gottfried van Swieten": "gottfried van swieten"
    },
    {
        " in Vienna around 1782. Van Swieten, during diplomatic service in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", had taken the opportunity to collect as many manuscripts by Bach and Handel as he could, and he invited Mozart to study his collection and also encouraged him to transcribe various works for other combinations of instruments. Mozart was evidently fascinated by these works, and wrote a set of transcriptions for string trio of fugues from Bachs  Well-Tempered Clavier , introducing them with preludes of his own.     In a letter to his sister, dated in Vienna on April 20, 1782, Mozart recognizes that he had not written anything in this form, but moved by the interest of ": null
    },
    {
        "Constance": "constanze mozart"
    },
    {
        " he composed one piece, which is sent with the letter. He begs his sister not to let anybody see the fugue and manifests the hope to write five more and then present them to Baron van Swieten. Regarding the piece, he said I have taken particular care to write andante maestoso upon it, so that it should not be played fast – for if a fugue is not played slowly the ear cannot clearly distinguish the new subject as it is introduced and the effect is missed .  Mozart then set to writing fugues on his own, mimicking the Baroque style. These included the fugues for String Quartet, K. 405 and a Fugue in C Minor K. 426 for two pianos . Later, Mozart incorporated fugal writing into his opera  Die Zauberflöte  and the finale of his ": null
    },
    {
        "Symphony No. 41": "symphony no. 41"
    },
    {
        ".          The parts of the ": null
    },
    {
        "Requiem": "requiem"
    },
    {
        " he completed also contain several fugues .       ": null
    },
    {
        "Ludwig van Beethoven": "ludwig van beethoven"
    },
    {
        " was familiar with fugal writing from childhood, as an important part of his training was playing from  The Well-Tempered Clavier . During his early career in ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", Beethoven attracted notice for his performance of these fugues. There are fugal sections in Beethovens early piano sonatas, and fugal writing is to be found in the second and fourth movements of the  Eroica Symphony  . Beethoven incorporated fugues in his sonatas, and reshaped the episodes purpose and compositional technique for later generations of composers.      Nevertheless, fugues did not take on a truly central role in Beethovens work until his late period. The finale of Beethovens ": null
    },
    {
        "Hammerklavier Sonata": "piano sonata no. 29"
    },
    {
        " contains a fugue, which was practically unperformed until the late 19th century, due to its tremendous technical difficulty and length. The last movement of his ": null
    },
    {
        "Cello Sonata, Op. 102 No. 2": "cello sonatas nos. 4 and 5 sonata no. 5.2c op. 102.2c no. 2"
    },
    {
        " is a fugue, and there are fugal passages in the last movements of his Piano Sonatas in ": null
    },
    {
        "A major, Op. 101": "piano sonata no. 28"
    },
    {
        " and ": null
    },
    {
        "A major Op. 110": "piano sonata no. 31"
    },
    {
        ". According to ": null
    },
    {
        "Charles Rosen": "charles rosen"
    },
    {
        " With the finale of 110, Beethoven re-conceived the significance of the most traditional elements of fugue writing. Rosen, C. The Classical Style. London, Faber.     Fugal passages are also found in the  Missa Solemnis  and all movements of the ": null
    },
    {
        "Ninth Symphony": "symphony no. 9"
    },
    {
        ", except the third. A massive, dissonant fugue forms the finale of his ": null
    },
    {
        "String Quartet, Op. 130": "string quartet no. 13"
    },
    {
        " ; the latter was later published separately as Op. 133, the  Große Fuge  . However, it is the fugue that opens Beethovens ": null
    },
    {
        "String Quartet in C minor, Op. 131": "string quartet no. 14"
    },
    {
        " that several commentators regard as one of the composers greatest achievements. ": null
    },
    {
        "Joseph Kerman": "joseph kerman"
    },
    {
        " calls it this most moving of all fugues . Kerman, J. , The Beethoven Quartets. Oxford University Press ": null
    },
    {
        "J.W.N. Sullivan": "j. w. n. sullivan"
    },
    {
        " hears it as the most superhuman piece of music that Beethoven has ever written. Sullivan, J.W.N. Beethoven. London, Jonathan Cape ": null
    },
    {
        "Philip Radcliffe": "philip radcliffe"
    },
    {
        " says bare description of its formal outline can give but little idea of the extraordinary profundity of this fugue . Radcliffe, P. Beethovens String Quartets. London, Hutchinson.        By the beginning of the ": null
    },
    {
        "Romantic era": "romantic music"
    },
    {
        ", fugue writing had become specifically attached to the norms and styles of the Baroque. ": null
    },
    {
        "Felix Mendelssohn": "felix mendelssohn"
    },
    {
        " wrote many fugues inspired by his study of the music of ": null
    },
    {
        "J.S. Bach": "johann sebastian bach"
    },
    {
        ". ": null
    },
    {
        "Franz Liszts": "franz liszt"
    },
    {
        " Piano Sonata in B minor": "piano sonata"
    },
    {
        " contains a powerful fugue, demanding incisive virtuosity from its player:": null
    },
    {
        "Giuseppe Verdi": "verdi"
    },
    {
        " included a whimsical example at the end of his opera Falstaff  and his setting of the ": null
    },
    {
        "Requiem Mass": "requiem"
    },
    {
        " contained two choral fugues. ": null
    },
    {
        "Anton Bruckner": "bruckner"
    },
    {
        " and ": null
    },
    {
        "Gustav Mahler": "mahler"
    },
    {
        " also included them in their respective symphonies. The exposition of the finale of Bruckners ": null
    },
    {
        "Fifth Symphony": "symphony no. 5"
    },
    {
        " begins with a fugal exposition. The exposition ends with a chorale, the melody of which is then used as a second fugal exposition at the beginning of the development. The recapitulation features both fugal subjects concurrently. The finale of Mahlers ": null
    },
    {
        "Symphony No. 5": "symphony no. 5"
    },
    {
        " features a fugue-like Floros, C. Gustav Mahler: The Symphonies, trans. Wicker. Amadeus Press. passage early in the movement, though this is not actually an example of a fugue.       Twentieth-century composers brought fugue back to its position of prominence, realizing its uses in full instrumental works, its importance in development and introductory sections, and the developmental capabilities of fugal composition.     The second movement of ": null
    },
    {
        "Maurice Ravels": "maurice ravel"
    },
    {
        "piano suite  Le Tombeau de Couperin  is a fugue that ": null
    },
    {
        "Roy Howat": "roy howat"
    },
    {
        " describes as having a subtle glint of jazz . Howat, R. Ravel and the Piano in Mawer, D. The Cambridge Companion to Ravel. Cambridge University Press. ": null
    },
    {
        "Béla Bartóks": "béla bartók"
    },
    {
        "  Music for Strings, Percussion and Celesta  opens with a slow fugue that ": null
    },
    {
        "Pierre Boulez": "pierre boulez"
    },
    {
        " regards as certainly the finest and most characteristic example of Bartóks subtle style... probably the most timeless of all Bartóks works – a fugue that unfolds like a fan to a point of maximum intensity and then closes, returning to the mysterious atmosphere of the opening. Boulez, P. Orientations. London, Faber.     ": null
    },
    {
        "Igor Stravinsky": "igor stravinsky"
    },
    {
        " also incorporated fugues into his works, including the  Symphony of Psalms  and the  Dumbarton Oaks  concerto. Stravinsky recognized the compositional techniques of Bach, and in the second movement of his Symphony of Psalms , he lays out a fugue that is much like that of the Baroque era.  It employs a double fugue with two distinct subjects, the first beginning in C and the second in E. Techniques such as stretto, sequencing, and the use of subject incipits are frequently heard in the movement.     ": null
    },
    {
        "Olivier Messiaen": "olivier messiaen"
    },
    {
        ", writing about his  Vingt regards sur lenfant-Jésus  wrote of the sixth piece of that collection, Par Lui tout a été fait :      ": null
    },
    {
        "György Ligeti": "györgy ligeti"
    },
    {
        " wrote a five-part double fugue for his Requiems second movement, the Kyrie, in which each part is subdivided in four-voice bundles that make a canon . The melodic material in this fugue is totally chromatic , with melismatic parts overlaid onto skipping intervals, and use of polyrhythm , blurring everything both harmonically and rhythmically so as to create an aural aggregate, thus highlighting the theoretical/aesthetic question of the next section as to whether fugue is a form or a texture. Eric Drott, Lines, Masses, Micropolyphony: Ligetis Kyrie and the Crisis of the Figure . Perspectives of New Music 49, no. 1 : 4–46. Citation on 10. According to Tom Service , in this work, Ligeti         Benjamin Britten used a fugue in the final part of ": null
    },
    {
        "The Young Persons Guide to the Orchestra": "the young persons guide to the orchestra"
    },
    {
        " . The Henry Purcells theme is triumphantly cited at the end making it a choral fugue. https://goodmorningbritten.wordpress.com/2013/10/18/listening-to-britten-the-young-persons-guide-to-the-orchestra-op-34/     Canadian pianist and musical thinker Glenn Gould composed ": null
    },
    {
        "So You Want to Write a Fugue?": "so you want to write a fugue?"
    },
    {
        ", a full-scale fugue set to a text that cleverly explicates its own musical form.       Fugues have been incorporated into genres outside Western classical music. Several examples exist within jazz , such as Bach goes to Town, composed by the Welsh composer Alec Templeton and recorded by Benny Goodman in 1938, and ": null
    },
    {
        "Concorde": "concorde"
    },
    {
        " composed by John Lewis and recorded by the Modern Jazz Quartet in 1955.     In Fugue for Tinhorns from the Broadway musical Guys and Dolls , written by Frank Loesser , the characters Nicely-Nicely, Benny, and Rusty sing simultaneously about hot tips they each have in an upcoming horse race .     A few examples also exist within progressive rock , such as the central movement of The Endless Enigma by Emerson, Lake & Palmer and On Reflection by Gentle Giant .           A widespread view of the fugue is that it is not a musical form but rather a technique of composition.     The Austrian musicologist Erwin Ratz argues that the formal organization of a fugue involves not only the arrangement of its theme and episodes, but also its harmonic structure. In particular, the exposition and coda tend to emphasize the tonic key , whereas the episodes usually explore more distant tonalities. Ratz stressed, however, that this is the core, underlying form of the fugue, from which individual fugues may deviate.     Thus it is to be noted that while certain related keys are more commonly explored in fugal development, the overall structure of a fugue does not limit its harmonic structure. For example, a fugue may not even explore the dominant, one of the most closely related keys to the tonic. Bachs Fugue in B major from book one of the Well Tempered Clavier explores the relative minor , the supertonic and the subdominant . This is unlike later forms such as the sonata, which clearly prescribes which keys are explored . Then, many modern fugues dispense with traditional tonal harmonic scaffolding altogether, and either use serial rules, or , use panchromatic, or even denser, harmonic spectra.       Fugue is the most complex of contrapuntal forms. In Ratzs words, fugal technique significantly burdens the shaping of musical ideas, and it was given only to the greatest geniuses, such as Bach and Beethoven, to breathe life into such an unwieldy form and make it the bearer of the highest thoughts.  In presenting Bachs fugues as among the greatest of contrapuntal works, ": null
    },
    {
        "Peter Kivy": "peter kivy"
    },
    {
        " points out that counterpoint itself, since time out of mind, has been associated in the thinking of musicians with the profound and the serious  and argues that there seems to be some rational justification for their doing so.      This is related to the idea that restrictions create freedom for the composer, by directing their efforts. He also points out that fugal writing has its roots in improvisation, and was, during the Renaissance, practiced as an improvisatory art. Writing in 1555, ": null
    },
    {
        "Nicola Vicentino": "nicola vicentino"
    },
    {
        ", for example, suggests that:   ": null
    }
]