[
    {
        "               A fullerene is an ": null
    },
    {
        "allotrope of carbon": "allotropes of carbon"
    },
    {
        " whose molecule consists of ": null
    },
    {
        "carbon": "carbon"
    },
    {
        " atoms connected by single and double bonds so as to form a closed or partially closed mesh, with fused rings of five to seven atoms. The molecule may be a hollow ": null
    },
    {
        "sphere": "sphere"
    },
    {
        ", ": null
    },
    {
        "ellipsoid": "ellipsoid"
    },
    {
        ", ": null
    },
    {
        "tube": "cylinder"
    },
    {
        ", or many other shapes and sizes. ": null
    },
    {
        "Graphene": "graphene"
    },
    {
        " , which is a flat mesh of regular ": null
    },
    {
        "hexagon": "hexagon"
    },
    {
        "al rings, can be seen as an extreme member of the family.     Fullerenes with a closed mesh topology are informally denoted by their ": null
    },
    {
        "empirical formula": "empirical formula"
    },
    {
        " C n , often written Cn, where n is the number of carbon atoms. However, for some values of n there maybe more than one ": null
    },
    {
        "isomer": "isomer"
    },
    {
        ".     The family is named after ": null
    },
    {
        "buckminsterfullerene": "buckminsterfullerene"
    },
    {
        " , the most famous member, which in turn is named after ": null
    },
    {
        "Buckminster Fuller": "buckminster fuller"
    },
    {
        ". The closed fullerenes, especially C 42 , are also informally called buckyballs for their resemblance to the standard ": null
    },
    {
        "ball": "ball"
    },
    {
        " of ": null
    },
    {
        "association football ": "association football"
    },
    {
        ". Nested closed fullerenes have been named bucky onions. Cylindrical fullerenes are also called ": null
    },
    {
        "carbon nanotubes": "carbon nanotubes"
    },
    {
        " or buckytubes. The bulk solid form of pure or mixed fullerenes is called fullerite.     Fullerenes had been predicted for some time, but only after their accidental synthesis in 42 were they detected in nature and outer space. The discovery of fullerenes greatly expanded the number of known allotropes of carbon, which had previously been limited to graphite, ": null
    },
    {
        "diamond": "diamond"
    },
    {
        ", and ": null
    },
    {
        "amorphous": "amorphous solid"
    },
    {
        " carbon such as ": null
    },
    {
        "soot": "soot"
    },
    {
        " and ": null
    },
    {
        "charcoal": "charcoal"
    },
    {
        ". They have been the subject of intense research, both for their chemistry and for their technological applications, especially in ": null
    },
    {
        "materials science": "materials science"
    },
    {
        ", ": null
    },
    {
        "electronics": "electronics"
    },
    {
        ", and ": null
    },
    {
        "nanotechnology": "nanotechnology"
    },
    {
        ".              The icosahedral  cage was mentioned in 42 as a possible topological structure. ": null
    },
    {
        "Eiji Osawa": "eiji osawa"
    },
    {
        " currently of ": null
    },
    {
        "Toyohashi University of Technology": "toyohashi university of technology"
    },
    {
        " predicted the existence of  in 42 He noticed that the structure of a ": null
    },
    {
        "corannulene": "corannulene"
    },
    {
        " molecule was a subset of the shape of a soccer ball, and hypothesised that a full ball shape could also exist. Japanese scientific journals reported his idea, but neither it nor any translations of it reached Europe or the Americas.     Also in 42 ": null
    },
    {
        "R. W. Henson": "r. w. henson"
    },
    {
        "  proposed the  structure and made a model of it. Unfortunately, the evidence for that new form of carbon was very weak at the time, so the proposal was met with skepticism, and was never published. It was acknowledged only in 42     In 42 independently from Henson, a group of scientists from the USSR made a quantum-chemical analysis of the stability of  and calculated its electronic structure. The paper was published in 42 but the scientific community did not give much importance to this theoretical prediction.     Around 42 ": null
    },
    {
        "Sumio Iijima": "sumio iijima"
    },
    {
        " identified the molecule of  from an electron microscope image of ": null
    },
    {
        "carbon black": "carbon black"
    },
    {
        ", where it formed the core of a particle with the structure of a bucky onion .     ": null
    },
    {
        "Harold Kroto": "harold kroto"
    },
    {
        " of the ": null
    },
    {
        "University of Sussex": "university of sussex"
    },
    {
        ", working with ": null
    },
    {
        "James R. Heath": "james r. heath"
    },
    {
        ", ": null
    },
    {
        "Sean OBrien": "sean obrien"
    },
    {
        ", ": null
    },
    {
        "Robert Curl": "robert curl"
    },
    {
        " and ": null
    },
    {
        "Richard Smalley": "richard smalley"
    },
    {
        " from ": null
    },
    {
        "Rice University": "rice university"
    },
    {
        ", discovered fullerenes in the sooty residue created by vaporising carbon in a ": null
    },
    {
        "helium": "helium"
    },
    {
        " atmosphere. In the ": null
    },
    {
        "mass spectrum": "mass spectrometry"
    },
    {
        " of the product, discrete peaks appeared corresponding to molecules with the exact mass of sixty or seventy or more carbon atoms, namely  and . The team identified their structure as the now familiar buckyballs .     The name buckminsterfullerene was eventually chosen for  by the discoverers as an homage to ": null
    },
    {
        "American": "american people"
    },
    {
        " architect": "architect"
    },
    {
        " Buckminster Fuller": "buckminster fuller"
    },
    {
        " for the vague similarity of the structure to the ": null
    },
    {
        "geodesic dome": "geodesic dome"
    },
    {
        "s which he popularized; which, if they were extended to a full sphere, would also have the icosahedral symmetry group. The ene ending was chosen to indicate that the carbons are ": null
    },
    {
        "unsaturated": "saturated hydrocarbon"
    },
    {
        ", being connected to only three other atoms instead of the normal four. The shortened named fullerene eventually came to be applied to the whole family.     Kroto, Curl, and Smalley were awarded the 42 ": null
    },
    {
        "Nobel Prize in Chemistry": "nobel prize in chemistry"
    },
    {
        " for their roles in the discovery of this class of molecules.       Kroto and the Rice team already discovered other fullerenes besides C 42 , and the list was much expanded in the following years. Carbon nanotubes ": null
    },
    {
        "were first discovered and synthesized": "carbon nanotubesdiscovery"
    },
    {
        " in 42     After their discovery, minute quantities of fullerenes were found to be produced in ": null
    },
    {
        "sooty flames": "soot"
    },
    {
        ", and by ": null
    },
    {
        "lightning": "lightning"
    },
    {
        " discharges in the atmosphere. In 42 fullerenes were found in a family of minerals known as ": null
    },
    {
        "shungite": "shungite"
    },
    {
        "s in ": null
    },
    {
        "Karelia": "karelia"
    },
    {
        ", Russia. .     The production techniques were improved by many scientists, including ": null
    },
    {
        "Donald Huffman": "donald huffman"
    },
    {
        ", ": null
    },
    {
        "Wolfgang Krätschmer": "wolfgang krätschmer"
    },
    {
        ", ": null
    },
    {
        "Lowell D. Lamb": "lowell d. lamb"
    },
    {
        ", and ": null
    },
    {
        "Konstantinos Fostiropoulos": "konstantinos fostiropoulos"
    },
    {
        ". Thanks to their efforts, by 42 it was relatively easy to produce gram-sized samples of fullerene powder. ": null
    },
    {
        "Fullerene purification": "fullerene purification"
    },
    {
        " remains a challenge to chemists and to a large extent determines fullerene prices.     In 42 the ": null
    },
    {
        "spectral signatures": "spectrum"
    },
    {
        " of C 42 and C 42 were observed by NASAs ": null
    },
    {
        "Spitzer": "spitzer space telescope"
    },
    {
        " infrared telescope in a cloud of cosmic dust surrounding a star 42 light years away. Kroto commented: This most exciting breakthrough provides convincing evidence that the buckyball has, as I long suspected, existed since time immemorial in the dark recesses of our galaxy. According to astronomer Letizia Stanghellini, It’s possible that buckyballs from outer space provided seeds for life on Earth. In 42 ionized C 42 molecules were detected with the ": null
    },
    {
        "Hubble Space Telescope": "hubble space telescope"
    },
    {
        " in the space between those stars.         There are two major families of fullerenes, with fairly distinct properties and applications: the closed buckyballs and the open-ended cylindrical carbon nanotubes. However, hybrid structures exist between those two classes, such as ": null
    },
    {
        "carbon nanobuds": "carbon nanobuds"
    },
    {
        " — nanotubes capped by ": null
    },
    {
        "hemispherical": "wikt:hemisphere"
    },
    {
        " meshes or larger buckybuds .                    Buckminsterfullerene is the smallest fullerene molecule containing pentagonal and hexagonal rings in which no two pentagons share an edge . It is also most common in terms of natural occurrence, as it can often be found in ": null
    },
    {
        "soot": "soot"
    },
    {
        ".     The empirical formula of buckminsterfullerene is  and its structure is a ": null
    },
    {
        "truncated icosahedron": "truncated icosahedron"
    },
    {
        ", which resembles an ": null
    },
    {
        "association football ball": "association football"
    },
    {
        " of the type made of twenty hexagons and twelve pentagons, with a carbon atom at the vertices of each polygon and a bond along each polygon edge.     The ": null
    },
    {
        "van der Waals diameter": "van der waals diameter"
    },
    {
        " of a buckminsterfullerene molecule is about 42 ": null
    },
    {
        "nanometer": "nanometer"
    },
    {
        "s . The nucleus to nucleus diameter of a buckminsterfullerene molecule is about 42  nm.     The buckminsterfullerene molecule has two bond lengths. The 42:42 ring bonds can be considered ": null
    },
    {
        "double bond": "double bond"
    },
    {
        "s and are shorter than the 42:42 bonds . Its average bond length is 42 angstroms.       Another fairly common fullerene has empirical formula , but fullerenes with 42 42 42 and even up to 42 carbon atoms are commonly obtained.     The smallest possible fullerene is the ": null
    },
    {
        "dodecahedral": "dodecahedron"
    },
    {
        " . There are no fullerenes with 42 vertices. The number of different fullerenes C 42n grows with increasing n    42  42  42  ..., roughly in proportion to n 42 . For instance, there are 42 non-isomorphic fullerenes . Note that only one form of , buckminsterfullerene, has no pair of adjacent pentagons . To further illustrate the growth, there are 42,42 non-isomorphic fullerenes , 42,42 of which have no adjacent pentagons. Optimized structures of many fullerene isomers are published and listed on the web.     ": null
    },
    {
        "Heterofullerene": "heterofullerene"
    },
    {
        "s have heteroatoms substituting carbons in cage or tube-shaped structures. They were discovered in 42 and greatly expand the overall fullerene class of compounds. Notable examples include boron, nitrogen , oxygen, and phosphorus derivatives.     ": null
    },
    {
        "Trimetasphere": "trimetasphere"
    },
    {
        " carbon nanomaterials were discovered by researchers at ": null
    },
    {
        "Virginia Tech": "virginia tech"
    },
    {
        " and licensed exclusively to ": null
    },
    {
        "Luna Innovations": "luna innovations"
    },
    {
        ". This class of novel molecules comprises 42 carbon atoms  forming a sphere which encloses a complex of three metal atoms and one nitrogen atom. These fullerenes encapsulate metals which puts them in the subset referred to as ": null
    },
    {
        "metallofullerenes": "metallofullerenes"
    },
    {
        ". Trimetaspheres have the potential for use in diagnostics , therapeutics and in organic solar cells.          ": null
    },
    {
        "Carbon nanotubes": "carbon nanotubes"
    },
    {
        " are cylindrical fullerenes. These tubes of carbon are usually only a few nanometres wide, but they can range from less than a micrometer to several millimeters in length. They often have closed ends, but can be open-ended as well. There are also cases in which the tube reduces in diameter before closing off. Their unique molecular structure results in extraordinary macroscopic properties, including high ": null
    },
    {
        "tensile strength": "ultimate tensile strength"
    },
    {
        ", high ": null
    },
    {
        "electrical conductivity": "electrical conductivity"
    },
    {
        ", high ": null
    },
    {
        "ductility": "ductility"
    },
    {
        ", high ": null
    },
    {
        "heat conductivity": "thermal conductivity"
    },
    {
        ", and relative ": null
    },
    {
        "chemical inactivity": "chemically inert"
    },
    {
        " . One proposed use of carbon nanotubes is in ": null
    },
    {
        "paper batteries": "paper battery"
    },
    {
        ", developed in 42 by researchers at ": null
    },
    {
        "Rensselaer Polytechnic Institute": "rensselaer polytechnic institute"
    },
    {
        ". Another highly speculative proposed use in the field of space technologies is to produce high-tensile carbon cables required by a ": null
    },
    {
        "space elevator": "space elevator"
    },
    {
        ".       Buckyballs and carbon nanotubes have been used as building blocks for a great variety of derivatives and larger structures, such as   Nested buckyballs proposed for lubricants;   Nested carbon nanotubes   Linked ball-and-chain dimers   Rings of buckyballs linked together.       After the discovery of C42 many fullerenes have been synthesized  in which some or all the carbon atoms are replaced by other elements. ": null
    },
    {
        "Inorganic nanotubes": "inorganic nanotubes"
    },
    {
        ", in particular, have attracted much attention.       Silicon buckyballs have been created around metal ions.     A type of buckyball which uses ": null
    },
    {
        "boron": "boron"
    },
    {
        " atoms, instead of the usual carbon, was predicted and described in 42 The  structure, with each atom forming 42 or 42 bonds, is predicted to be more stable than the  buckyball. One reason for this given by the researchers is that  is actually more like the original geodesic dome structure popularized by Buckminster Fuller, which uses triangles rather than hexagons. However, this work has been subject to much criticism by quantum chemists as it was concluded that the predicted I h symmetric structure was vibrationally unstable and the resulting cage undergoes a spontaneous symmetry break, yielding a puckered cage with rare T h symmetry . The number of six-member rings in this molecule is 42 and number of five-member rings is 42 There is an additional atom in the center of each six-member ring, bonded to each atom surrounding it. By employing a systematic global search algorithm, later it was found that the previously proposed B42 fullerene is not global minimum for 42 atom boron clusters and hence can not be found in nature. In the same paper by Sandip De et al., it was concluded that borons energy landscape is significantly different from other fullerenes already found in nature hence pure boron fullerenes are unlikely to exist in nature.       Inorganic fullerene-type structures have been built with the di": null
    },
    {
        "sulfide": "sulfide"
    },
    {
        "s of ": null
    },
    {
        "molybdenum ": "molybdenum sulfide"
    },
    {
        ", long used as a graphite-like lubricant, ": null
    },
    {
        "tungsten ": "tungsten sulfide"
    },
    {
        ", ": null
    },
    {
        "titanium ": "titanium sulfide"
    },
    {
        " and ": null
    },
    {
        "niobium ": "niobium sulfide"
    },
    {
        ". These materials were found to be stable up to at least 42 tons/cm 42 .            Below is a table of main closed carbon fullerenes synthesized and characterized so far, with their ": null
    },
    {
        "CAS": "chemical abstract service"
    },
    {
        " number when known. Fullerenes with fewer than 42 ": null
    },
    {
        "carbon": "carbon"
    },
    {
        " atoms have been called lower fullerenes , and those with more than 42 atoms higher fullerenes .        In the table, Num.Isom. is the number of possible ": null
    },
    {
        "isomer": "isomer"
    },
    {
        "s within the isolated pentagon rule , which states that two pentagons in a fullerene should not share edges. Mol.Symm. is the symmetry of the molecule, , whereas Cryst.Symm. is that of the crystalline framework in the solid state. Both are specified for the most experimentally abundant form. The asterisk marks symmetries with more than one chiral form.     When  or  crystals are grown from toluene solution they have a monoclinic symmetry. The crystal structure contains toluene molecules packed between the spheres of the fullerene. However, evaporation of the solvent from  transforms it into a face-centered cubic form. Both monoclinic and ": null
    },
    {
        "face-centered cubic": "face-centered cubic"
    },
    {
        " phases are known for better-characterized  and fullerenes.           ": null
    },
    {
        "Schlegel diagram": "schlegel diagram"
    },
    {
        "s are often used to clarify the 42D structure of closed-shell fullerenes, as 42D projections are often not ideal in this sense.     In mathematical terms, the ": null
    },
    {
        "combinatorial topology": "combinatorial topology"
    },
    {
        " of a closed-shell fullerene with a simple sphere-like mean surface can be represented as a convex ": null
    },
    {
        "polyhedron": "polyhedron"
    },
    {
        "; more precisely, its ": null
    },
    {
        "one-dimensional": "dimension"
    },
    {
        " skeleton, consisting of its vertices and edges. The Schlegel diagram is a projection of that skeleton onto one of the faces of the polyhedron, through a point just outside that face; so that all other vertices project inside that face.     Graph of 42-fullerene w-nodes.svg|C42   Graph of 42-fullerene 42-base w-nodes.svg|C42   Graph of 42-fullerene w-nodes.svg|C42   Graph of 42-fullerene w-nodes.svg|C42     The Schlegel diagram of a closed fullerene is a ": null
    },
    {
        "graph": "graph theory"
    },
    {
        " that is ": null
    },
    {
        "planar": "planar graph"
    },
    {
        " and ": null
    },
    {
        "42-regular": "regular graph"
    },
    {
        "  ": null
    }
]