[
    {
        "           Fur seals are any of nine species of ": null
    },
    {
        "pinniped": "pinniped"
    },
    {
        "s belonging to the subfamily Arctocephalinae in the family  Otariidae . They are much more closely related to ": null
    },
    {
        "sea lion": "sea lion"
    },
    {
        "s than ": null
    },
    {
        "true seals": "earless seal"
    },
    {
        ", and share with them external ears , relatively long and muscular foreflippers, and the ability to walk on all fours. They are marked by their dense ": null
    },
    {
        "underfur": "pelage"
    },
    {
        ", which made them a long-time object of commercial ": null
    },
    {
        "hunting": "seal hunting"
    },
    {
        ". Eight species belong to the genus  Arctocephalus  and are found primarily in the Southern Hemisphere, while a ninth species also sometimes called fur seal, the ": null
    },
    {
        "northern fur seal": "northern fur seal"
    },
    {
        " , belongs to a different genus and inhabits the North Pacific.         Subfamily ": null
    },
    {
        "Arctocephalinae": "arctocephalinae"
    },
    {
        "  Arctocephalus  ": null
    },
    {
        "Antarctic fur seal": "antarctic fur seal"
    },
    {
        ", A. gazella ": null
    },
    {
        "Brown fur seal": "brown fur seal"
    },
    {
        ", A. pusillus A. pusillus pusillus A. pusillus doriferus ": null
    },
    {
        "Galápagos fur seal": "galápagos fur seal"
    },
    {
        ", A. galapagoensis ": null
    },
    {
        "Guadalupe fur seal": "guadalupe fur seal"
    },
    {
        ", A. townsendi ": null
    },
    {
        "Juan Fernández fur seal": "juan fernández fur seal"
    },
    {
        ", A. philippii ": null
    },
    {
        "New Zealand fur seal": "new zealand fur seal"
    },
    {
        " or southern fur seal,  A. forsteri  ": null
    },
    {
        "South American fur seal": "south american fur seal"
    },
    {
        ", A. australis ": null
    },
    {
        "Subantarctic fur seal": "subantarctic fur seal"
    },
    {
        ", A. tropicalis Callorhinus ": null
    },
    {
        "Northern fur seal": "northern fur seal"
    },
    {
        ", C. ursinus        Fur seals and sea lions make up the family Otariidae. Along with the Phocidae and Odobodenidae, ottariids are pinnipeds descending from a common ancestor most closely related to modern bears . The name pinniped refers to mammals with front and rear flippers. Otariids arose about 4242 million years ago in the Miocene, and were originally land mammals that rapidly diversified and adapted to a marine environment, giving rise to the semiaquatic marine mammals that thrive today. Fur seals and sea lions are closely related and commonly known together as the eared seals .   Until recently, fur seals were all grouped under a single subfamily of Pinnipedia, called the Arctocephalinae, to contrast them with Otariinae – the sea lions – based on the most prominent common feature, namely the coat of dense underfur intermixed with guard hairs. Recent genetic evidence, however, suggests Callorhinus is more closely related to some sea lion species, and the fur seal/sea lion subfamily distinction has been eliminated from many ": null
    },
    {
        "taxonomies": "taxonomy"
    },
    {
        ". Nonetheless, all fur seals have certain features in common: the fur, generally smaller sizes, farther and longer foraging trips, smaller and more abundant prey items, and greater ": null
    },
    {
        "sexual dimorphism": "sexual dimorphism"
    },
    {
        ". For these reasons, the distinction remains useful. Fur seals comprise two genera: Callorhinus, and Arctocephalus. Callorhinus is represented by just one species in the Northern Hemisphere, the northern fur seal , and Arctocephalus is represented by eight species in the Southern Hemisphere. The southern fur seals comprising the genus Arctocephalus include Antarctic fur seals, Galapagos fur seals, Juan Fernandez fur seals, New Zealand fur seals, brown fur seals, South American fur seals, and subantarctic fur seals.          Along with the previously mentioned thick underfur, fur seals are distinguished from sea lions by their smaller body structure, greater sexual dimorphism, smaller prey, and longer foraging trips during the feeding cycle. The physical appearance of fur seals varies with individual species, but the main characteristics remain constant. Fur seals are characterized by their external pinnae, dense underfur, vibrissae, and long, muscular limbs. They share with other otariids the ability to rotate their rear limbs forward, supporting their bodies and allowing them to ambulate on land. In water, their front limbs, typically measuring about a fourth of their body length, act as oars and can propel them forward for optimal mobility. The surfaces of these long, paddle-like fore limbs are leathery with small claws. Otariids have a dog-like head, sharp, well-developed canines, sharp eyesight, and keen hearing. They are extremely sexually dimorphic mammals, with the males often two to five times the size of the females, with proportionally larger heads, necks, and chests. Size ranges from about 42 m, 42  kg in the male Galapagos fur seal to 42 m, 42  kg in the adult male New Zealand fur seal. Most fur seal pups are born with a black-brown coat that molts at 42–42 months, revealing a brown coat that typically gets darker with age. Some males and females within the same species have significant differences in appearance, further contributing to the sexual dimorphism. Females and juveniles often have a lighter colored coat overall or only on the chest, as seen in South American fur seals. In a northern fur seal population, the females are typically silvery-gray on the dorsal side and reddish-brown on their ventral side with a light gray patch on their chest. This makes them easily distinguished from the males with their brownish-gray to reddish-brown or black coats.       Of the fur seal family, eight species are considered southern fur seals, and only one is found in the Northern Hemisphere. The southern group includes Antarctic, Galapagos, Guadalupe, Juan Fernandez, New Zealand, brown, South American, and subantarctic fur seals. They typically spend about 42% of their lives in subpolar, temperate, and equatorial waters. Colonies of fur seals can be seen throughout the Pacific and Southern Oceans from south Australia, Africa, and New Zealand, to the coast of Peru and north to California. They are typically nonmigrating mammals, with the exception of the northern fur seal, which has been known to travel distances up to 42  km. Fur seals are often found near isolated islands or peninsulas, and can be seen hauling out onto the mainland during winter. Although they are not migratory, they have been observed wandering hundreds of miles from their breeding grounds in times of scarce resources. For example, the subantarctic fur seal typically resides near temperate islands in the South Atlantic and Indian Oceans north of the Antarctic Polar Front, but juvenile males have been seen wandering as far north as Brazil and South Africa.             Typically, fur seals gather during the summer in large ": null
    },
    {
        "rookeries": "rookeries"
    },
    {
        " at specific beaches or rocky outcrops to give birth and breed. All species are ": null
    },
    {
        "polygynous": "polygynous"
    },
    {
        ", meaning dominant males reproduce with more than one female. For most species, total gestation lasts about 42 months, including a several-month period of ": null
    },
    {
        "delayed implantation": "delayed implantation"
    },
    {
        " of the embryo. Northern fur seal males aggressively select and defend the specific females in their harems. . afsc.noaa.gov Females typically reach sexual maturity around 42–42 years. The males reach sexual maturity around the same time, but do not become territorial or mate until 42–42 years. The breeding season typically begins in November and lasts 42–42 months. The northern fur seals begin their breeding season as early as June due to their region, climate, and resources. In all cases, the males arrive a few weeks early to fight for their territory and groups of females with which to mate. They congregate at rocky, isolated breeding grounds and defend their territory through fighting and vocalization. Males typically do not leave their territory for the entirety of the breeding season, fasting and competing until all energy sources are depleted. The Juan Fernandez fur seals deviate from this typical behavior, using aquatic breeding territories not seen in other fur seals. They use rocky sites for breeding, but males fight for territory on land and on the shoreline and in the water. Upon arriving to the breeding grounds, females give birth to their pups from the previous season. About a week later, the females mate again and shortly after begin their feeding cycle, which typically consists of foraging and feeding at sea for about 42 days, then returning to the breeding grounds to nurse the pups for about 42 days. Mothers and pups locate each other using call recognition during nursing period. The Juan Fernandez fur seal has a particularly long feeding cycle, with about 42 days of foraging and feeding and 42 days of nursing. Most fur seals continue this cycle for about 42 months until they wean their pup. The exception to this is the Antarctic fur seal, which has a feeding cycle that lasts only 42 months. During foraging trips, most female fur seals travel around 42  km from the breeding site, and can dive around 42 m depending on food availability.     The remainder of the year, fur seals lead a largely ": null
    },
    {
        "pelagic": "pelagic"
    },
    {
        " existence in the open sea, pursuing their prey wherever it is abundant. They feed on moderately sized fish, ": null
    },
    {
        "squid": "squid"
    },
    {
        ", and ": null
    },
    {
        "krill": "krill"
    },
    {
        ". Several species of the southern fur seal also have sea birds, especially penguins, as part of their diets.   Fur seals, in turn, are preyed upon by ": null
    },
    {
        "shark": "shark"
    },
    {
        "s, ": null
    },
    {
        "killer whale": "killer whale"
    },
    {
        "s, and occasionally by larger sea lions. These opportunistic mammals tend to feed and dive in shallow waters at night, when their prey are swimming near the surface. South American fur seals exhibit a different diet; adults feed almost exclusively on anchovies, while juveniles feed on demersal fish, most likely due to availability.     When fur seals were hunted in the late 42th and early 42th centuries, they hauled out on remote islands where no predators were present. The hunters reported being able to club the unwary animals to death one after another, making the hunt profitable, though the price per seal skin was low.             The average lifespan of fur seals varies with different species from 42 to 42 years, with females typically living longer. Most populations continue to expand as they recover from previous commercial hunting and environmental threats.   Many species were heavily exploited by commercial ": null
    },
    {
        "sealer": "seal hunting"
    },
    {
        "s, especially during the 42th century, when their fur was highly valued. Beginning in the 42s, the ports of ": null
    },
    {
        "Stonington": "stonington, connecticut"
    },
    {
        " and ": null
    },
    {
        "New Haven": "new haven"
    },
    {
        ", Connecticut, were leaders of the American fur seal trade, which primarily entailed clubbing fur seals to death on uninhabited South Pacific islands, skinning them, and selling the hides in ": null
    },
    {
        "China": "china"
    },
    {
        ". Muir, Diana, ": null
    },
    {
        "Reflections in Bulloughs Pond": "reflections in bulloughs pond"
    },
    {
        " , University Press of New England, 42 pp. 42ff . Many populations, notably the Guadalupe fur seal, northern fur seal, and Cape fur seal, suffered dramatic declines and are still recovering. Currently, most species are protected, and hunting is mostly limited to subsistence harvest. Globally, most populations can be considered healthy, mostly because they often prefer remote habitats that are relatively inaccessible to humans. Nonetheless, ": null
    },
    {
        "environmental degradation": "environmental degradation"
    },
    {
        ", competition with ": null
    },
    {
        "fisheries": "fisheries"
    },
    {
        ", and ": null
    },
    {
        "climate change": "climate change"
    }
]