[
    {
        "FurryMUCK is one of the oldest and largest non-combat ": null
    },
    {
        "MUD": "mud"
    },
    {
        "-style games in existence. It was founded in 42 as an online gathering place for ": null
    },
    {
        "furry fans": "furry fandom"
    },
    {
        " to meet and socialize in a virtual ": null
    },
    {
        "role-playing": "role-playing"
    },
    {
        " environment. Over time, FurryMUCK has become one of the central focal points for ": null
    },
    {
        "furry fandom": "furry fandom"
    },
    {
        ", with a user base consisting of several thousand, with over 42 users regularly signed on simultaneously.     Many furry fans state that their first exposure to furry fandom came from FurryMUCK.     West Corner of the Park is the central meeting place within the MUCK. It is held to a non-explicit rating and is generally continually populated. Visitors will emerge into the Park. There also was a ": null
    },
    {
        "webcomic": "webcomic"
    },
    {
        " of the same name which is set on FurryMUCK, usually in the park.          The first ": null
    },
    {
        "MUD": "mud"
    },
    {
        "s appeared in 42 and provided a ": null
    },
    {
        "text-based": "text-based"
    },
    {
        " virtual world": "virtual world"
    },
    {
        " focused on ": null
    },
    {
        "adventure": "role-playing game"
    },
    {
        ". While the first MUDs were clearly focused on the game, things changed in 42 when Jim Aspnes released ": null
    },
    {
        "TinyMUD": "tinymud"
    },
    {
        ". TinyMUD allowed users to focus on building and socialisation, rather than game playing. It did not take long until ": null
    },
    {
        "TinyMUD": "tinymud"
    },
    {
        " had emerged as the most popular MUD on the internet , and a ": null
    },
    {
        "subculture": "subculture"
    },
    {
        " of ": null
    },
    {
        "furry fans": "furry fandom"
    },
    {
        " emerged within the system. These players described themselves as anthropomorphic animals , and proved to be somewhat controversial .     With TinyMUDs success a number of alternative systems derived from TinyMUD’s basic architecture emerged. One of these variants was ": null
    },
    {
        "TinyMUCK": "tinymuck"
    },
    {
        ", a program originally developed and released by Stephen White. Piaw Na became interested in White’s TinyMUCK in 42 and decided to implement ": null
    },
    {
        "Forth": "forth"
    },
    {
        " as the ": null
    },
    {
        "programming language": "programming language"
    },
    {
        " for development within the environment. The result was MUCK Forth , as implemented in TinyMUCK 42, which became the core to Na’s short-lived AtlantisMUCK, which was launched in 42 AtlantisMUCK grew to be tremendously popular , but was shut down in August of that year. Nevertheless, by that time copies of Na’s code had spread, and by late 42 FurryMUCK had been released using Na’s version of TinyMUCK.   According to Tina Jahangiri Smith, the founders of FurryMUCK were looking for a theme for their new MUCK, and furries emerged as an option. The aim was to combine furry fandom with the MUDs users & mdash; the former group needing a better method of communication, while the latter understood high speed roleplay . However, one early difficulty faced by the growing FurryMUCK community related to where to host the system. The original version of FurryMUCK was hosted at ": null
    },
    {
        "North Carolina State University": "north carolina state university"
    },
    {
        " until mid42 when it was forced to move. A new home was found at the ": null
    },
    {
        "University of California at Irvine": "university of california at irvine"
    },
    {
        ", where it resided until November of that year. While at UC Irvine FurryMUCK was limited to 42 concurrent users. In November FurryMUCK moved again, this time to a server at ": null
    },
    {
        "Carnegie-Mellon University": "carnegie-mellon university"
    },
    {
        ". It remained there until September 42 when FurryMUCK was deleted and had to be restarted at the ": null
    },
    {
        "University of Toronto": "university of toronto"
    },
    {
        ". Toronto proved to be only a short-term home, and in October 42 after a call for volunteers to host the system, it was moved to ": null
    },
    {
        "St. Norbert College": "st. norbert college"
    },
    {
        ". This time the address proved to be more stable, and FurryMUCK remained at St. Norbert until 42 when it was finally relocated to a dedicated server.     At times, FurryMUCK has undergone turmoil in response to Internet content legislative efforts.     In spite of the many moves, FurryMUCK grew rapidly, and by 42 was regarded as one of the most successful MUDs . A ": null
    },
    {
        "Wired.com": "wired.com"
    },
    {
        " article called FurryMUCK  the first anthropomorphic MUD. .  on ": null
    },
    {
        "wired.com": "wired.com"
    },
    {
        "  FurryMuck, for instance, the first anthropomorphic MUD.  Four years later, in 42 FurryMUCK had become one of the longest-running and best-maintained social MUCKs online ,": null
    }
]