[
    {
        "     Clarence Eugene Fuzzy Haskins is a former singer with 42s and 42s ": null
    },
    {
        "doo-wop": "doo-wop"
    },
    {
        " group, ": null
    },
    {
        "The Parliaments": "the parliaments"
    },
    {
        ". He is a founding member of the groundbreaking and influential 42s ": null
    },
    {
        "funk": "funk"
    },
    {
        " bands ": null
    },
    {
        "Parliament": "parliament"
    },
    {
        " and ": null
    },
    {
        "Funkadelic": "funkadelic"
    },
    {
        ", also known as ": null
    },
    {
        "Parliament-Funkadelic": "parliament-funkadelic"
    },
    {
        ". He left Parliament-Funkadelic in 42 to pursue a solo career. He is a member of the ": null
    },
    {
        "Rock and Roll Hall of Fame": "rock and roll hall of fame"
    },
    {
        ", inducted in 42 with fifteen other members of ": null
    },
    {
        "Parliament-Funkadelic": "parliament-funkadelic"
    },
    {
        ".       Haskins was born in ": null
    },
    {
        "Elkins, West Virginia": "elkins, west virginia"
    },
    {
        ", and starting in the late 42s he was a founding member of ": null
    },
    {
        "doo wop": "doo wop"
    },
    {
        " vocal group ": null
    },
    {
        "The Parliaments": "the parliaments"
    },
    {
        ", led by ": null
    },
    {
        "George Clinton": "george clinton"
    },
    {
        ". The group originated as a ": null
    },
    {
        "barbershop quintet": "barbershop music"
    },
    {
        " in the back room of a barber shop on West 42rd Street in ": null
    },
    {
        "Plainfield, New Jersey": "plainfield, new jersey"
    },
    {
        ". Haskins often sang lead in the group. They started traveling to ": null
    },
    {
        "Detroit, Michigan": "detroit"
    },
    {
        " on weekends in order to audition for ": null
    },
    {
        "Motown Records": "motown records"
    },
    {
        " and to participate in the fertile music scene there. The Parliaments released ": null
    },
    {
        "singles": "single"
    },
    {
        " on several record labels, but did not have a hit until 42 when Testify, on the small Detroit imprint Revilot Records, reached 42 on the  Billboard  R & B singles chart. The song was actually recorded by George Clinton and a group called The Holidays, as the other Parliaments didnt make it to Detroit that week. Revilot went out of business, and in the process, the group lost their name, The Parliaments.     By 42 the five Parliaments singers were touring with five backing musicians known separately as ": null
    },
    {
        "Funkadelic": "funkadelic"
    },
    {
        ". The highly rehearsed performances and ": null
    },
    {
        "suited": "suit"
    },
    {
        " look of The Parliaments gave way to the members dressing in their own outrageous styles. Haskins wore ": null
    },
    {
        "long johns": "long underwear"
    },
    {
        " on stage. Due to the contractual issues surrounding the group name, Clinton signed the band as ": null
    },
    {
        "Funkadelic": "funkadelic"
    },
    {
        " to ": null
    },
    {
        "Westbound Records": "westbound records"
    },
    {
        ". The ensemble released their first album  Funkadelic  in 42 Clinton also renamed his group of singers ": null
    },
    {
        "Parliament": "parliament"
    },
    {
        " and signed that act to the ": null
    },
    {
        "Holland-Dozier-Holland": "holland-dozier-holland"
    },
    {
        "-owned record label, Invictus. Parliament released their first album  Osmium  in 42 Clinton now had two groups that were actually one entity. Under the name Funkadelic, the ensemble was geared towards a rock audience, and as ": null
    },
    {
        "Parliament": "parliament"
    },
    {
        " it was aimed at a ": null
    },
    {
        "soul music": "soul music"
    },
    {
        " audience. Collectively, they became known as ": null
    },
    {
        "Parliament-Funkadelic": "parliament-funkadelic"
    },
    {
        ", or ": null
    },
    {
        "P-Funk": "p-funk"
    },
    {
        ". Haskins contributed to P-Funk as a writer through 42 He toured and appeared on P-Funk albums as a singer, and occasionally as a guitarist, throughout the 42s. In June 42 at the height of P-Funks popularity, Haskins  left the ensemble over financial and management disputes with Clinton.     Haskins released his first solo album,  A Whole Nother Thang , in 42 The album featured P-Funk members: ": null
    },
    {
        "Tiki Fulwood": "tiki fulwood"
    },
    {
        " and ": null
    },
    {
        "Cordell Boogie Mosson": "boogie mosson"
    },
    {
        " on drums, and ": null
    },
    {
        "Bootsy Collins": "bootsy collins"
    },
    {
        " and Mosson on bass. ": null
    },
    {
        "Bernie Worrell": "bernie worrell"
    },
    {
        " makes an appearance on keyboards, contributing horn and string arrangements as well. Haskins served as producer, singer, songwriter, guitarist and even drummer on one song. Haskins released his second album,  Radio Active , two years later. An Ace compilation from 42 reissued both albums on one CD.     In 42 Haskins, Simon, and Thomas formed a new funk band using the name Funkadelic, appeared on  Soul Train  under that name, and released the album,  Connections & Disconnections . The album was later reissued on CD with the title  Whos a Funkadelic?  in 42 In the 42s, Haskins toured with ": null
    },
    {
        "Original P": "original p"
    },
    {
        ", a group made up of four of the original five Parliaments.        A Whole Nother Thang  , ": null
    },
    {
        "Westbound": "westbound records"
    },
    {
        "  Radio Active  , Westbound    A Whole Nother Radio Active Thang  , Westbound/": null
    },
    {
        "Ace": "ace records"
    }
]