[
    {
        "         Galactic empires are a common ": null
    },
    {
        "trope": "trope"
    },
    {
        " used in ": null
    },
    {
        "science fantasy": "science fantasy"
    },
    {
        " and science fiction, particularly in works known as ": null
    },
    {
        "space opera": "space opera"
    },
    {
        "s. Many authors have either used a ": null
    },
    {
        "galaxy": "galaxy"
    },
    {
        "-spanning empire as background or written about the growth and/or decline of such an empire. The capital of a galactic empire is frequently a core world, such as a ": null
    },
    {
        "planet": "planet"
    },
    {
        " relatively close to a galaxys ": null
    },
    {
        "supermassive black hole": "supermassive black hole"
    },
    {
        ", which has advanced considerably in science and technology compared to current ": null
    },
    {
        "human civilization": "human civilization"
    },
    {
        ". Characterizations can vary wildly from malevolent forces attacking sympathetic victims to ": null
    },
    {
        "apathetic": "apathy"
    },
    {
        " bureaucracies": "bureaucracy"
    },
    {
        " to more reasonable entities focused on ": null
    },
    {
        "social progress": "social progress"
    },
    {
        " and anywhere in between.            The best known such organization to the general public today is probably ": null
    },
    {
        "the Galactic Empire from Star Wars": "galactic empire"
    },
    {
        ", which was formed in turn from the ": null
    },
    {
        "Galactic Republic": "galactic republic"
    },
    {
        ". A ": null
    },
    {
        "military dictatorship": "military dictatorship"
    },
    {
        " based upon fear and terror, said Empire is an explicitly ": null
    },
    {
        "villainous force": "villain"
    },
    {
        " with linguistic and visual traits directly reminiscent of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ". For example, their armored forces known as ": null
    },
    {
        "stormtrooper": "stormtrooper"
    },
    {
        "s are named analogously to the  Sturmabteilung  , a paramilitary entity created by the Nazis in 42 Their best known weapon is the iconic  Death Star ; the ": null
    },
    {
        "moon": "natural satellite"
    },
    {
        "-sized ": null
    },
    {
        "space station": "space station"
    },
    {
        " has the ability to destroy entire planets.     Most of these galaxy-spanning domains depend on some form of transportation capable of quickly or instantly crossing vast cosmic distances, usually measured in ": null
    },
    {
        "light-year": "light-year"
    },
    {
        "s, many times faster than regular particles such as ": null
    },
    {
        "photon": "photon"
    },
    {
        "s traveling at ": null
    },
    {
        "light speed": "light speed"
    },
    {
        ". These, instantaneous or ": null
    },
    {
        "faster-than-light": "faster-than-light"
    },
    {
        " technologies invariably require some type of propulsion or displacement technology forbidden by ": null
    },
    {
        "Albert Einstein": "albert einstein"
    },
    {
        "s ": null
    },
    {
        "theories on relativity": "theory of relativity"
    },
    {
        ". Described methods often rely on theories that circumvent or supersede relativity. Examples include the hypothesis of a ": null
    },
    {
        "warp drive": "warp drive"
    },
    {
        "  that bend the fabric of ": null
    },
    {
        "space-time": "space-time"
    },
    {
        ".     The term galactic empire has, no doubt because of association with the Empire from  Star Wars , gained an unfavorable reputation. However, the galactic empires from the  Foundation  universe and the  CoDominium  universe are relatively benign organizations. Much of the plot of the Foundation series, authored by ": null
    },
    {
        "Isaac Asimov": "isaac asimov"
    },
    {
        ", revolves around the issue of who can best and most quickly revive the ": null
    },
    {
        "fallen galactic empire": "galactic empire"
    },
    {
        ", it being taken for granted that this is a positive and worthy aim. In writer ": null
    },
    {
        "Jerry Pournelle": "jerry pournelle"
    },
    {
        "s CoDominium series, members of the empire often work to maintain the best interests of humanity despite efforts by violent political extremists to pursue their own ends.     In many cases, the term galactic empire is misleading as it suggests an organization encompassing far more ": null
    },
    {
        "star systems": "star systems"
    },
    {
        " than is actually described. This may come about as a result of propaganda exaggerating the spread of an imperial entity in order to appear stronger than is actually the case. The situation is similar to how historical ": null
    },
    {
        "nation-states": "nation-states"
    },
    {
        " such as the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " presented themselves; being roughly equal in size to modern Germany. While some of the noted fictional empires tend to encompass a large portion of the galaxy, many other empires may be classified as interplanetary or interstellar empires since they encompass only a local group of star systems.     Writer ": null
    },
    {
        "Poul Anderson": "poul anderson"
    },
    {
        " makes the point that the declining empire depicted in his  Dominic Flandry  series does not span the entire galaxy but only a fraction of one of its spiral arms. Still, however, the institution is vast beyond a regular human‘s ability to truly comprehend, and it is in the process of collapsing under its own weight.     Galactic Empires are many cases consciously modeled on historical Earth-bound empires. Asimov stated explicitly that the Galactic Empire whose fall is depicted in his Foundation books is modeled on the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", with the author taking direct inspiration from the ": null
    },
    {
        "historical writings": "the history of the decline and fall of the roman empire"
    },
    {
        " of ": null
    },
    {
        "Edward Gibbon": "edward gibbon"
    },
    {
        ", even to the point of basing some ": null
    },
    {
        "individual characters": "bel rioseorigin"
    },
    {
        " on historical figures. In addition, Andersons Dominic Flandry series consciously compares the imperial organization for which the protagonist serves with the Roman Empire to the point of tracing out the space equivalents of the Roman ": null
    },
    {
        "Principate": "principate"
    },
    {
        " and ": null
    },
    {
        "Dominate": "dominate"
    },
    {
        " phases. In the  Star Wars  universe, the fall of the ": null
    },
    {
        "Galactic Republic": "galactic republic"
    },
    {
        " and its replacement by the ": null
    },
    {
        " Galactic Empire": "galactic empire"
    },
    {
        " - as depicted in  Revenge of the Sith  - recall the historic fall of the ": null
    },
    {
        "Roman Republic": "roman republic"
    },
    {
        " and its replacement by the Roman Empire headed by ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        ".     The universe established in ": null
    },
    {
        "Frank Herbert": "frank herbert"
    },
    {
        "s  Dune  recalls the aforementioned Holy Roman Empire as well as the ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " and ": null
    },
    {
        "Islamic": "list of muslim empires and dynasties"
    },
    {
        " empires, especially given the role of hitherto disregarded desert-dwellers who, due to a powerful new religion, expand to topple an old empire and build a new one. For example, the Egyptian-Canadian commentator Khalid M. Baheyeldin has enumerated the obviously Islamic concepts and references appearing in Dune to the level of finding multiple similarities between the career of Herberts ": null
    },
    {
        "Paul Atreides": "paul atreides"
    },
    {
        " and that of the Islamic prophet ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        ".      Another notable example of a galactic empire would be the ": null
    },
    {
        "Imperium of Man": "imperium of man"
    },
    {
        " from the ": null
    },
    {
        "Warhammer 42": "warhammer 40,000"
    },
    {
        " universe, which is a ": null
    },
    {
        "theocratic": "theocracy"
    },
    {
        " industrial and ": null
    },
    {
        "militaristic": "militaristic"
    },
    {
        " totalitarian": "totalitarian"
    },
    {
        " regime that does in fact span almost the entirety of the ": null
    },
    {
        "Milky Way Galaxy": "milky way galaxy"
    },
    {
        ". Despite massive strength, the institutions territories are constantly at risk due to unending conflict with various ": null
    },
    {
        "alien races and rebel factions": "warhammer 40,000 species"
    },
    {
        ".     In the final arc of the  Sailor Moon  manga series by ": null
    },
    {
        "Naoko Takeuchi": "naoko takeuchi"
    },
    {
        ", a fictional organization called ": null
    },
    {
        "Shadow Galactica": "shadow galactica"
    },
    {
        " has established an empire all over the Milky Way. Shadow Galactica is stealing starseeds , the essense of sentient life in the galaxy. Its members come from different Star Systems and Sailor Galaxia, the self-proclaimed Golden Queen of Shadow Galactica , has built her palace around the Galaxy Cauldron, the birthplace of all life in the Milky Way located in ": null
    },
    {
        "Galactic Center": "galactic center"
    },
    {
        ".     ": null
    },
    {
        "Bertram Chandler": "bertram chandler"
    },
    {
        " wrote two interstellar series – one ": null
    },
    {
        " featuring a Galactic Empire": "a. bertram chandlerempress irene series"
    },
    {
        " ruled by a series of non-hereditary Empresses while the other has ": null
    },
    {
        "a Republican Galactic Federation": "a. bertram chandlerjohn grimes novels"
    },
    {
        ". Chandlers Empire and Federation, both relatively benign, have much in common – both covering the same volume of space, having much the same kind of Space Navy and both having the same commercial spaceflight company called The Dog Star Line , suggesting that these are two ": null
    },
    {
        "alternate history": "alternate history"
    },
    {
        " timelines which branched off from the same original space travelling culture.     In ": null
    },
    {
        "Ursula K. Le Guin": "ursula k. le guin"
    },
    {
        "s ": null
    },
    {
        "Hainish Cycle": "hainish cycle"
    },
    {
        ", the interstellar entity known as The League of All Worlds and later as The Ekumen is in possession of the ": null
    },
    {
        "ansible": "ansible"
    },
    {
        ". Technology makes possible instantaneous interstellar communications, and the ability to send instantaneous unmanned ships carrying bombs to another planet is exploited as well. However, living beings cant survive such travel, and thus humans are limited to space exploration done at relativistic speeds. Correspondingly, this organization, despite on occasion waging war across interstellar distances, ends up being more loose than a true empire.     Author ": null
    },
    {
        "Orson Scott Card": "orson scott card"
    },
    {
        "s Starways Congress , an organization featured in the work  Speaker for the Dead  , similarly relies on the ansible. Yet it is more ": null
    },
    {
        "authoritarian": "authoritarian"
    },
    {
        " and less benevolent than Le Guins creation. Much of the story-line of the book and its sequels involve attempts to avoid interstellar bloodshed despite difficult circumstances.       In the novel Dune, the empires power is held within three organizations, these being the Imperial family; the Landsraad, representing the nobility; and the Guild, an interstellar travel monopoly.     Star Wars depicts ": null
    },
    {
        "an empire": "galactic empire"
    },
    {
        " dictated by ": null
    },
    {
        "Darth Sidious": "palpatine"
    },
    {
        ", supported by a powerful space navy. It is stated in the ": null
    },
    {
        "original Star Wars film": "star wars"
    },
    {
        " that there was an Imperial Senate that was later disbanded by the Emperor.     In Warhammer 42": null
    }
]