[
    {
        "                 Galanthus  is a small ": null
    },
    {
        "genus": "genus"
    },
    {
        " of approximately 42 ": null
    },
    {
        "species": "species"
    },
    {
        " of ": null
    },
    {
        "bulb": "bulb"
    },
    {
        "ous ": null
    },
    {
        "perennial": "perennial"
    },
    {
        " herbaceous plant": "herbaceous plant"
    },
    {
        "s in the ": null
    },
    {
        "family": "family"
    },
    {
        " Amaryllidaceae": "amaryllidaceae"
    },
    {
        ". The plants have two linear ": null
    },
    {
        "leaves": "leaves"
    },
    {
        " and a single small white drooping bell shaped ": null
    },
    {
        "flower": "flower"
    },
    {
        " with six petal-like  ": null
    },
    {
        "tepals": "tepals"
    },
    {
        " in two circles . The smaller inner petals have green markings.     Snowdrops have been known since the earliest times under various names, but were named Galanthus in 42 As the number of recognised species increased, various attempts were made to divide the species into subgroups, usually on the basis of the pattern of the emerging leaves . In the era of ": null
    },
    {
        "molecular phylogenetics": "molecular phylogenetics"
    },
    {
        " this characteristic has been shown to be unreliable and now seven molecularly-defined ": null
    },
    {
        "clades": "clades"
    },
    {
        " are recognised corresponding to the ": null
    },
    {
        "biogeographical": "biogeographical"
    },
    {
        " distribution of species. New species continue to be discovered.     Most species flower in winter, before the ": null
    },
    {
        "vernal equinox": "vernal equinox"
    },
    {
        " , but some flower in early ": null
    },
    {
        "spring": "spring"
    },
    {
        " and late ": null
    },
    {
        "autumn": "autumn"
    },
    {
        ". Sometimes snowdrops are confused with the two related genera within the ": null
    },
    {
        "tribe": "tribe"
    },
    {
        " Galantheae": "galantheae"
    },
    {
        ", snowflakes  Leucojum  and  Acis .           All ": null
    },
    {
        "species": "species"
    },
    {
        " of Galanthus are ": null
    },
    {
        "perennial": "perennial"
    },
    {
        " petaloid": "petaloid"
    },
    {
        " herbaceous": "herbaceous"
    },
    {
        " bulbous  ": null
    },
    {
        "monocot": "monocot"
    },
    {
        " plants. The ": null
    },
    {
        "genus": "genus"
    },
    {
        " is characterised by the presence of two ": null
    },
    {
        "leaves": "leaves"
    },
    {
        ", ": null
    },
    {
        "pendulous": ":wikt:pendulous"
    },
    {
        " white ": null
    },
    {
        "flowers": "flowers"
    },
    {
        " with six free ": null
    },
    {
        "perianth": "perianth"
    },
    {
        " segments in two ": null
    },
    {
        "whorls": "whorl"
    },
    {
        ". The inner whorl is smaller than the outer whorl and has green markings.         ; Leaves:   These are basal, emerging from the bulb initially-enclosed in a tubular membranous sheath of ": null
    },
    {
        "cataphylls": "cataphylls"
    },
    {
        ". Generally, these are two in number and linear, strap-shaped, or ": null
    },
    {
        "oblanceolate": "oblanceolate"
    },
    {
        ". ": null
    },
    {
        "Vernation": "vernation"
    },
    {
        ", the arrangement of the emerging leaves relative to each other, varies among species. These may be applanate , supervolute , or explicative . In applanate vernation the two leaf blades are pressed flat to each other within the bud and as they emerge; explicative leaves are also pressed flat against each other, but the edges of the leaves are folded back or sometimes rolled; in supervolute plants, one leaf is tightly clasped around the other within the bud and generally remains at the point where the leaves emerge from the soil . In the past, this feature has been used to distinguish between species and to determine the parentage of hybrids, but now has been shown to be ": null
    },
    {
        "homoplasious": "homoplasious"
    },
    {
        ", and not useful in this regard.     The ": null
    },
    {
        "scape": "scape"
    },
    {
        " is erect, leafless, ": null
    },
    {
        "terete": "terete"
    },
    {
        ", or compressed.         ;": null
    },
    {
        "Inflorescence": "inflorescence"
    },
    {
        " :   The scape bears at the top a pair of ": null
    },
    {
        "bract": "bract"
    },
    {
        "-like ": null
    },
    {
        "spathe": "spathe"
    },
    {
        " valves usually fused down one side and joined by a papery membrane, appearing ": null
    },
    {
        "monophyllous": "glossary of botanical termsmonophyllous"
    },
    {
        " . From between them emerges a solitary , pendulous, nodding, bell-shaped white flower, held on a slender ": null
    },
    {
        "pedicel": "pedicel"
    },
    {
        ". The flower bears six free ": null
    },
    {
        "perianth": "perianth"
    },
    {
        " segments  rather than ": null
    },
    {
        "petals": "petals"
    },
    {
        ", arranged in two whorls of three, the outer whorl being larger and more convex than the inner series. The outer tepals are ": null
    },
    {
        "acute": "glossary of leaf morphologyacute"
    },
    {
        " to more or less ": null
    },
    {
        "obtuse": "glossary of leaf morphologyacute"
    },
    {
        ", ": null
    },
    {
        "spathulate": "spathulate"
    },
    {
        " or oblanceolate to narrowly ": null
    },
    {
        "obovate": "obovate"
    },
    {
        " or linear, shortly clawed, and erect spreading. The inner tepals are much shorter , oblong, spathulate or oblanceolate, somewhat ": null
    },
    {
        "unguiculate": ":wikt:unguiculate"
    },
    {
        " and tapered to the base and erect. These tepals also bear green markings at the base, apex, or both, that when at the apex, are bridge-shaped over the small ": null
    },
    {
        "sinus": "sinus"
    },
    {
        " at the tip of each tepal, which are ": null
    },
    {
        "emarginate": "emarginate"
    },
    {
        ". Occasionally the markings are either green-yellow, yellow, or absent, and the shape and size varies by species.      ; ": null
    },
    {
        "Androecium": "androecium"
    },
    {
        " :   The six ": null
    },
    {
        "stamens": "stamens"
    },
    {
        " are inserted at the base of the perianth, and are very short , the anthers basifixed with filaments much shorter than the anthers and ": null
    },
    {
        "dehisce": "dehisce"
    },
    {
        " by terminal ": null
    },
    {
        "pores": "stoma"
    },
    {
        " or short slits.     ; ": null
    },
    {
        "Gynoecium": "gynoecium"
    },
    {
        ", ": null
    },
    {
        "Fruit": "fruit"
    },
    {
        " and ": null
    },
    {
        "Seeds": "seeds"
    },
    {
        ":   The inferior ": null
    },
    {
        "ovary": "ovary"
    },
    {
        " is three-celled. The ": null
    },
    {
        "style": "style"
    },
    {
        " is slender and longer than the anthers, the ": null
    },
    {
        "stigma": "stigma"
    },
    {
        " are minutely capitate. The ovary ripens into a three-celled ": null
    },
    {
        "capsule": "capsule"
    },
    {
        " fruit. This fruit is fleshy, ellipsoid or almost spherical, opening by three flaps with seeds that are light brown to white and oblong with a small appendage or tail  containing substances attractive to ": null
    },
    {
        "ant": "ant"
    },
    {
        "s, which distribute the seeds.     The ": null
    },
    {
        "chromosome number": "chromosome number"
    },
    {
        " is 42n42     ": null
    },
    {
        "Floral formula": "floral formula"
    },
    {
        ": \\star\\; P_ \\; A_ \\; G_          The genus Galanthus is native to Europe and the Middle East, from the Spanish and French ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        " in the west through to the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " and ": null
    },
    {
        "Iran": "iran"
    },
    {
        " in the east, and south to ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ", the ": null
    },
    {
        "Peloponnese": "peloponnese"
    },
    {
        ", the ": null
    },
    {
        "Aegean": "aegean islands"
    },
    {
        ", ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ", ": null
    },
    {
        "Lebanon": "lebanon"
    },
    {
        ", and ": null
    },
    {
        "Syria": "syria"
    },
    {
        ". The northern limit is uncertain because G. nivalis has been widely ": null
    },
    {
        "introduced": "introduced species"
    },
    {
        " and ": null
    },
    {
        "cultivated": "horticulture"
    },
    {
        " throughout Europe. G. nivalis and some other species valued as ": null
    },
    {
        "ornamentals": "ornamental plants"
    },
    {
        " have become widely ": null
    },
    {
        "naturalized": "naturalization"
    },
    {
        " in Europe, North America, and other regions.     Galanthus nivalis is the best-known and most widespread representative of the genus Galanthus. It is native to a large area of Europe, stretching from the Pyrenees in the west, through France and Germany to Poland in the north, Italy, northern Greece, Bulgaria, Romania, Ukraine, and European Turkey. It has been introduced and is widely ": null
    },
    {
        "naturalised": "naturalisation_"
    },
    {
        " elsewhere. Although it is often thought of as a British native wild flower, or to have been brought to the British Isles by the Romans, it probably was introduced around the early sixteenth century and is currently not a protected species in the UK. It was first recorded as naturalised in the UK in ": null
    },
    {
        "Worcestershire": "worcestershire"
    },
    {
        " and ": null
    },
    {
        "Gloucestershire": "gloucestershire"
    },
    {
        " in 42 Most other Galanthus species are from the eastern Mediterranean, but several are found in southern Russia, Georgia, Armenia, and Azerbaijan. Galanthus fosteri comes from Jordan, Lebanon, Syria, Turkey, and perhaps, Israel.     Galanthus grows best in ": null
    },
    {
        "woodland": "woodland"
    },
    {
        ", in ": null
    },
    {
        "acid": "acid soil"
    },
    {
        " or alkaline soil, although some are grassland or mountain species.                  Snowdrops have been known since early times, being described by the classical ": null
    },
    {
        "Greek": "greeks"
    },
    {
        " author, ": null
    },
    {
        "Theophrastus": "theophrastus"
    },
    {
        ", in the fourth century BC in his, Περὶ φυτῶν ἱστορία . He gave it, and similar plants, the name λευκόἲον from which the later name Leucojum was derived. He described the plant as ἑπεἰ τοῖς γε χρώμασι λευκἂ καἱ οὐ λεπυριώδη and of their habits Ἰῶν δ ἁνθῶν τὀ μἑν πρῶτον ἑκφαἱνεται τὁ λευκόἲον, ὅπου μἑν ό ἀἠρ μαλακώτερος εὐθὑς τοῦ χειμῶνος, ὅπου δἐ σκληρότερος ὕστερον, ἑνιαχοῡ τοῡ ἣρος     ": null
    },
    {
        "Rembert Dodoens": "rembert dodoens"
    },
    {
        ", a ": null
    },
    {
        "Flemish": "flemish"
    },
    {
        " botanist, had described and illustrated this plant in 42 as did ": null
    },
    {
        "Gerard": "john gerard"
    },
    {
        " in England in 42 , calling it, Leucojum bulbosum praecox . Gerard refers to Theophrastus description as Viola alba or Viola bulbosa using ": null
    },
    {
        "Pliny": "pliny the elder"
    },
    {
        "s translation, and comments that the plant had originated in Italy and had taken possession in England many years past . The ": null
    },
    {
        "genus": "genus"
    },
    {
        " was formally named Galanthus and described by ": null
    },
    {
        "Carl Linnaeus": "carl linnaeus"
    },
    {
        " in 42 with the single ": null
    },
    {
        "species": "species"
    },
    {
        ",  Galanthus nivalis , which is the ": null
    },
    {
        "type": "type"
    },
    {
        " species. Consequently, Linnaeus is granted the ": null
    },
    {
        "botanical authority": "botanical authority"
    },
    {
        ". In doing so, he distinguished this genus and species from  Leucojum  , a name by which it previously had been known.         In 42 ": null
    },
    {
        "Adanson": "adanson"
    },
    {
        " began a system of arranging genera in families. Using the ": null
    },
    {
        "synonym": "synonym"
    },
    {
        " Acrocorion , he placed Galanthus in the family ": null
    },
    {
        "Liliaceae": "liliaceae"
    },
    {
        ", section Narcissi. ": null
    },
    {
        "Lamarck": "lamarck"
    },
    {
        " provided a description of the genus in his encyclopedia , and later, Illustrations des genres . In 42 ": null
    },
    {
        "de Jussieu": "antoine laurent de jussieu"
    },
    {
        ", who is credited with the modern concept of genera organised in ": null
    },
    {
        "families": "family"
    },
    {
        ", placed Galanthus and related genera within a ": null
    },
    {
        "division": "division"
    },
    {
        " of ": null
    },
    {
        "Monocotyledons": "monocotyledons"
    },
    {
        ", using a modified form of Linnaeus sexual classification, but with the respective topography of stamens to carpels rather than just their numbers. In doing so he restored the name Galanthus and retained their placement under Narcissi, this time as a family  and referred to the French vernacular name,  Perce-neige  , based on the plants tendency to push through early spring snow . The modern family of ": null
    },
    {
        "Amaryllidaceae": "amaryllidaceae"
    },
    {
        ", in which Galanthus is placed, dates to ": null
    },
    {
        "Jaume Saint-Hilaire": "jaume saint-hilaire"
    },
    {
        " who replaced Jussieus Narcissi with Amaryllidées. In 42 ": null
    },
    {
        "Brown": "robert brown"
    },
    {
        " proposed that a subgroup of Liliaceae be distinguished on the basis of the position of the ": null
    },
    {
        "ovaries": "ovary"
    },
    {
        " and be referred to as Amaryllideae, and in 42 ": null
    },
    {
        "de Candolle": "de candolle"
    },
    {
        " separated them by describing Liliacées Juss. and Amaryllidées Brown as two quite separate families. However, in his comprehensive survey of the ": null
    },
    {
        "Flora": "flora"
    },
    {
        " of France": "flora of france"
    },
    {
        "  he divided Liliaceae into a series of Ordres, and placed Galanthus into the Narcissi Ordre. This relationship of Galanthus to either liliaceous or amaryllidaceaous taxa  was to last for another two centuries until the two were formally divided at the end of the twentieth century. ": null
    },
    {
        "Lindley": "john lindley"
    },
    {
        " followed this general pattern, placing Galanthus and related genera such as  Amaryllis  and  Narcissus  in his Amaryllideae . By 42 the number of known plants was increasing considerably and he revised his schema in his last work, placing Galanthus together, and the other two genera in the modern ": null
    },
    {
        "Galantheae": "galantheae"
    },
    {
        " in tribe Amarylleae, order Amaryllidaceae, alliance Narcissales. These three genera have been treated together taxonomically by most authors, on the basis of an inferior ovary. As the number of plant species increased, so did the taxonomic complexity. By the time ": null
    },
    {
        "Bentham": "george bentham"
    },
    {
        " and ": null
    },
    {
        "Hooker": "joseph dalton hooker"
    },
    {
        " published their Genera plantarum  ordo Amaryllideae contained five tribes, and tribe Amarylleae 42 subtribes . They placed Galanthus in subtribe Genuinae and included three species.              Galanthus is one of three closely-related genera making up the tribe ": null
    },
    {
        "Galantheae": "galantheae"
    },
    {
        " within subfamily ": null
    },
    {
        "Amaryllidoideae": "amaryllidoideae"
    },
    {
        " . Sometimes snowdrops are confused with the other two genera,  Leucojum  and  Acis  . Leucojum species are much larger and flower in spring , with all six ": null
    },
    {
        "tepal": "tepal"
    },
    {
        "s in the flower being the same size, although some poculiform Galanthus species may have inner segments similar in shape and length to the outer ones. Galantheae are likely to have arisen in the Caucusus.                        Galanthus has approximately 42 species, but new species continue to be described. G. trojanus was identified in Turkey in 42  G. panjutinii was discovered in 42 in five locations in a small area of the northern ": null
    },
    {
        "Colchis": "colchis"
    },
    {
        " area  of ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        " and ": null
    },
    {
        "Russia": "russia"
    },
    {
        ".  G. samothracicus was identified in Greece in 42 Since it has not been subjected to genetic sequencing, it remains unplaced. It resembles G. nivalis, but is outside the distribution of that species.      Many species are difficult to identify, however, and traditional infrageneric classification based on ": null
    },
    {
        "morphological": "plant morphology"
    },
    {
        " alone, such as those of ": null
    },
    {
        "Stern": "fc stern"
    },
    {
        " , ": null
    },
    {
        "Traub": "hp traub"
    },
    {
        " and Davis ,  has not reflected what is known about its ": null
    },
    {
        "evolutionary history": "evolutionary history"
    },
    {
        " due to the morphological similarities among the species, and relative lack of easily discernible distinguishing characteristics. Stern divided the genus into three series according to leaf ": null
    },
    {
        "vernation": "vernation"
    },
    {
        " ; Nivales Beck   section Plicati Beck    section Latifolii Stern    Stern further utilised characteristics such as the markings of the inner segments, length of the pedicels in relation to the spathe, and the colour and shape of the leaves in identifying and classifying species     Traub considered them as ": null
    },
    {
        "subgenera": "subgenera"
    },
    {
        ";   subgenus Galanthus Plicatanthus Traub & Moldk.   subgenus Platyphyllanthe Traub     By contrast Davis, with much more information and specimens, included ": null
    },
    {
        "biogeography": "biogeography"
    },
    {
        " in addition to vernation, forming two series. He used somewhat different terminology for vernation, namely applanate , explicative , and supervolute . He merged Nivalis and Plicati into series Galanthus, and divided Latifolii into two subseries, Glaucaefolii A.P.Davis and Viridifolii A.P.Davis .     Early ": null
    },
    {
        "molecular phylogenetic": "molecular phylogenetic"
    },
    {
        " studies confirmed the genus was ": null
    },
    {
        "monophyletic": "monophyletic"
    },
    {
        " and suggested four ": null
    },
    {
        "clades": "clades"
    },
    {
        ", which were labelled as ": null
    },
    {
        "series": "series"
    },
    {
        ", and showed that Davis subseries were not monophyletic. An expanded study in 42 demonstrated seven major clades corresponding to ": null
    },
    {
        "biogeographical": "biogeographical"
    },
    {
        " distribution. This study used nuclear encoded nr": null
    },
    {
        "ITS": "internal transcribed spacer"
    },
    {
        " , and ": null
    },
    {
        "plastid": "plastid"
    },
    {
        " encoded matK ,  trnL-F ,  ndhF , and  psbK–psbI , and examined all species recognised at the time, as well as two naturally occurring putative ": null
    },
    {
        "hybrids": "hybrid"
    },
    {
        ". The morphological characteristic of vernation that earlier authors had mainly relied on was shown to be highly ": null
    },
    {
        "homoplasious": "homoplasious"
    },
    {
        ". A number of species, such as G. nivalis and G. elwesii demonstrated intraspecific biogeographical clades, indicating problems with ": null
    },
    {
        "speciation": "speciation"
    },
    {
        " and there may be a need for ": null
    },
    {
        "recircumscription": "circumscription"
    },
    {
        ". These clades were assigned names, partly according to Davis previous groupings. In this model clade Platyphyllus is ": null
    },
    {
        "sister": "sister group"
    },
    {
        " to the rest of the genus.     By contrast another study performed at the same time, using both ": null
    },
    {
        "nuclear": "nuclear dna"
    },
    {
        " and ": null
    },
    {
        "chloroplast DNA": "chloroplast dna"
    },
    {
        ", but limited to the 42 species found in Turkey, largely confirmed Davis series and subseries, and with biogeographical correlation. Series Galanthus in this study corresponded to clade nivalis, subseries Glaucaefolii with clade Elwesii and subseries Viridifolii with clades Woronowii and Alpinus. However, the model did not provide complete resolution.         sensu Ronsted et al. 42 ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        ", W. ": null
    },
    {
        "Transcaucasus": "transcaucasus"
    },
    {
        ", NE ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        "NW Turkey": null
    },
    {
        "Aegean Islands": "aegean islands"
    },
    {
        "Turkey, Aegean Islands, SE Europe42 variantsEurope, NW Turkey42 subspecies42 subspeciesCaucasus, E. and NE Turkey, N. ": null
    },
    {
        "Iran": "iran"
    },
    {
        "Caucasus, NE Turkey, N.Iran42 variantsGreeceJanuary–May in the wildexplicative vernationor blotches": null
    },
    {
        "ngua": "ngua"
    },
    {
        "galaanthosSnow-dropsee ": null
    },
    {
        "Symbols": "symbols"
    },
    {
        "an": "an"
    },
    {
        "see illustration": null
    },
    {
        "ta": "ta"
    },
    {
        "G. nivalis, G. elwesii, and G. woronowiisee ": null
    },
    {
        "Horticulture": "horticulture"
    },
    {
        "unt": "unt"
    },
    {
        "42 Feb–42 March 42NGS": null
    },
    {
        "tati": "tati"
    },
    {
        "more than 42 cultivars are described in Bishop, Davis, and Grimshaws book, plus lists of many cultivars that have now been lost, and others not seen by the authorseven fanatical": null
    },
    {
        "ta": "ta"
    },
    {
        "olo": "olo"
    },
    {
        " ta": "ta"
    },
    {
        "  in the green or galanthamine": null
    },
    {
        "n": "n"
    },
    {
        "see ": null
    },
    {
        "Symbols": "symbols"
    },
    {
        "42 A triplet of green-pencilled snow 42 ": null
    },
    {
        "42 film42": "56 film19"
    },
    {
        "42 film42": "72 film19"
    },
    {
        "42 film42": "80 film19"
    },
    {
        "Sekai meisaku dowa mori wa ikiteiru in Japanwho were stationed in the UK preparatory to the invasion of the continentFebruary 42Little snow bells": null
    },
    {
        "as": "as"
    }
]