[
    {
        "            A galaxy is a ": null
    },
    {
        "gravitation": "gravitation"
    },
    {
        "ally bound system of ": null
    },
    {
        "star": "star"
    },
    {
        "s, ": null
    },
    {
        "stellar remnant": "stellar remnant"
    },
    {
        "s, ": null
    },
    {
        "interstellar gas": "interstellar medium"
    },
    {
        ", ": null
    },
    {
        "dust": "cosmic dust"
    },
    {
        ", and ": null
    },
    {
        "dark matter": "dark matter"
    },
    {
        ". The word galaxy is derived from the ": null
    },
    {
        "Greek": "ancient greek"
    },
    {
        "  , literally milky , a reference to the ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        ". Galaxies range in size from ": null
    },
    {
        "dwarfs": "dwarf galaxy"
    },
    {
        " with just a few hundred million  stars to ": null
    },
    {
        "giants": "ic 1101"
    },
    {
        " with one hundred ": null
    },
    {
        "trillion": "orders of magnitude 1012"
    },
    {
        "  stars, each orbiting its galaxys ": null
    },
    {
        "center of mass": "center of mass"
    },
    {
        ".     Galaxies are categorized according to their visual ": null
    },
    {
        "morphology": "morphology"
    },
    {
        " as ": null
    },
    {
        "elliptical": "elliptical galaxy"
    },
    {
        ", ": null
    },
    {
        "spiral": "spiral galaxy"
    },
    {
        ", or ": null
    },
    {
        "irregular": "irregular galaxy"
    },
    {
        ". Many galaxies are thought to have ": null
    },
    {
        "supermassive black holes": "supermassive black hole"
    },
    {
        "at their centers. The Milky Ways central black hole, known as ": null
    },
    {
        "Sagittarius A": "sagittarius a"
    },
    {
        ", has a mass four million times greater than the ": null
    },
    {
        "Sun": "sun"
    },
    {
        ". As of March 2016, ": null
    },
    {
        "GN-z11": "gn-z11"
    },
    {
        " is the oldest and most distant observed galaxy with a ": null
    },
    {
        "comoving distance": "comoving distance"
    },
    {
        " of 32 billion ": null
    },
    {
        "light-years": "light-years"
    },
    {
        " from Earth, and observed as it existed just 400 million years after the ": null
    },
    {
        "Big Bang": "big bang"
    },
    {
        ".     Research released in 2016 revised the number of galaxies in the ": null
    },
    {
        "observable universe": "observable universe"
    },
    {
        " from a previous estimate of 200 billion  to a suggested two trillion  or more  and, overall, as many as an estimated  stars   .  Most of the galaxies are 1,000 to 100,000 ": null
    },
    {
        "parsecs": "parsec"
    },
    {
        "in diameter  and separated by distances on the order of millions of parsecs . For comparison, the Milky Way has a diameter of at least 30,000 parsecs and is separated from the ": null
    },
    {
        "Andromeda Galaxy": "andromeda galaxy"
    },
    {
        ", its nearest large neighbor, by 780,000 parsecs     The ": null
    },
    {
        "space": "intergalactic space"
    },
    {
        " between galaxies is filled with a tenuous gas  having an average density of less than one ": null
    },
    {
        "atom": "atom"
    },
    {
        " per cubic meter. The majority of galaxies are gravitationally organized into ": null
    },
    {
        "groups": "galaxy group"
    },
    {
        ", ": null
    },
    {
        "clusters": "galaxy cluster"
    },
    {
        ", and ": null
    },
    {
        "supercluster": "supercluster"
    },
    {
        "s. The Milky Way is part of the ": null
    },
    {
        "Local Group": "local group"
    },
    {
        ", which is dominated by it and the Andromeda Galaxy and is part of the ": null
    },
    {
        "Virgo Supercluster": "virgo supercluster"
    },
    {
        ". At the ": null
    },
    {
        "largest scale": "large-scale structure of the cosmos"
    },
    {
        ", these associations are generally arranged into ": null
    },
    {
        "sheets and filaments": "galaxy filament"
    },
    {
        " surrounded by immense ": null
    },
    {
        "voids": "void"
    },
    {
        ". Both the Local Group and the Virgo Supercluster are contained in a much larger cosmic structure named ": null
    },
    {
        "Laniakea": "laniakea supercluster"
    },
    {
        ".           The word galaxy was borrowed via ": null
    },
    {
        "French": "french language"
    },
    {
        " and ": null
    },
    {
        "Medieval Latin": "medieval latin"
    },
    {
        " from the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " term for the Milky Way,    C. T. Onions et al., The Oxford Dictionary of English Etymology, Oxford 1966, p. 385. milky , named after its appearance as a milky band of light in the sky. In ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        " places his son born by a mortal woman, the infant ": null
    },
    {
        "Heracles": "heracles"
    },
    {
        ", on ": null
    },
    {
        "Heras": "hera"
    },
    {
        "breast while she is asleep so the baby will drink her divine milk and thus become immortal. Hera wakes up while breastfeeding and then realizes she is nursing an unknown baby: she pushes the baby away, some of her milk spills, and it produces the faint band of light known as the Milky Way.     In the astronomical literature, the capitalized word Galaxy is often used to refer to our galaxy, the ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        ", to distinguish it from the other galaxies in our ": null
    },
    {
        "universe": "universe"
    },
    {
        ". The English term Milky Way can be traced back to a story by ": null
    },
    {
        "Chaucer": "chaucer"
    },
    {
        " :        Galaxies were initially discovered telescopically and were known as ": null
    },
    {
        "spiral nebula": "spiral nebula"
    },
    {
        "e. Most 18th to 19th Century astronomers considered them as either unresolved star cluster s or anagalactic nebula e, and were just thought as a part of the Milky Way, but their true composition and natures remained a mystery. Observations using larger telescopes of a few nearby bright galaxies, like the Andromeda Galaxy , began resolving them into huge conglomerations of stars, but based simply on the apparent faintness and sheer population of stars, the true distances of these objects placed them well beyond the Milky Way. For this reason they were popularly called island universes, but this term quickly fell into disuse, as the word universe implied the entirety of existence. Instead, they became known simply as galaxies.       thu SDSS J1152+3313 . SDSS stands for Sloan Digital Sky Survey , J for Julian epoch , and 1152+3313 for the declination and right ascension respectively.     Tens of thousands of galaxies have been catalogued, but only a few have well-established names, such as the Andromeda Galaxy , the Magellanic Clouds , the Whirlpool Galaxy , and the Sombrero Galaxy . Astronomers work with numbers from certain catalogues, such as the Messier catalogue , the NGC , the IC , the CGCG , the MCG and UGC . All the well-known galaxies appear in one or more of these catalogues but each time under a different number.   For example, Messier 109 is a spiral galaxy having the number 109 in the catalogue of Messier, and also having the designations NGC 3992, UGC 6937, CGCG 269-023, MCG +09-20-044, and PGC 37617.       The realization that we live in a galaxy which is one among many galaxies, parallels major discoveries that were made about the Milky Way and other nebula e.           The Greek philosopher Democritus proposed that the bright band on the night sky known as the Milky Way might consist of distant stars.   Aristotle , however, believed the Milky Way to be caused by the ignition of the fiery exhalation of some stars that were large, numerous and close together and that the ignition takes place in the upper part of the atmosphere , in the region of the World that is continuous with the heavenly motions . The Neoplatonist philosopher Olympiodorus the Younger was critical of this view, arguing that if the Milky Way is sublunary it should appear different at different times and places on Earth, and that it should have parallax , which it does not. In his view, the Milky Way is celestial.     According to Mohani Mohamed, the Arabian astronomer Alhazen made the first attempt at observing and measuring the Milky Ways parallax, and he thus determined that because the Milky Way had no parallax, it must be remote from the Earth, not belonging to the atmosphere. The Persian astronomer al-Bīrūnī proposed the Milky Way galaxy to be a collection of countless fragments of the nature of nebulous stars. The Andalusian astronomer Ibn Bâjjah proposed that the Milky Way is made up of many stars that almost touch one another and appear to be a continuous image due to the effect of refraction from sublunary material, citing his observation of the conjunction of Jupiter and Mars as evidence of this occurring when two objects are near. In the 14th century, the Syrian-born Ibn Qayyim proposed the Milky Way galaxy to be a myriad of tiny stars packed together in the sphere of the fixed stars.   thu in 1785; the Solar System was assumed to be near the center.     Actual proof of the Milky Way consisting of many stars came in 1610 when the Italian astronomer Galileo Galilei used a telescope to study the Milky Way and discovered that it is composed of a huge number of faint stars. Galileo Galilei, Sidereus Nuncius ,   English translation: Galileo Galilei with Edward Stafford Carlos, trans., The Sidereal Messenger ,   In 1750 the English astronomer Thomas Wright , in his An Original Theory or New Hypothesis of the Universe, speculated that the galaxy might be a rotating body of a huge number of stars held together by gravitation al forces, akin to the Solar System but on a much larger scale. The resulting disk of stars can be seen as a band on the sky from our perspective inside the disk. Thomas Wright, An Original Theory or New Hypothesis of the Universe... . ...the stars are not infinitely dispersed and distributed in a promiscuous manner throughout all the mundane space, without order or design,... this phænomenon no other than a certain effect arising from the observers situation,... To a spectator placed in an indefinite space,... it i.e., the Milky Way  a vast ring of stars...   Wright called the Milky Way the Vortex Magnus and estimated its diameter at 8.64×10 12 miles . In a treatise in 1755, Immanuel Kant elaborated on Wrights idea about the structure of the Milky Way.   Immanuel Kant, . Available in English translation by Ian Johnston at:       The first project to describe the shape of the Milky Way and the position of the Sun was undertaken by William Herschel in 1785 by counting the number of stars in different regions of the sky. He produced a diagram of the shape of the galaxy with the Solar System close to the center . Herschels diagram of the galaxy appears immediately after the articles last page. Using a refined approach, Kapteyn in 1920 arrived at the picture of a small ellipsoid galaxy with the Sun close to the center. A different method by Harlow Shapley based on the cataloguing of globular cluster s led to a radically different picture: a flat disk with diameter approximately 70  kiloparsecs and the Sun far from the center. Both analyses failed to take into account the absorption of light by interstellar dust present in the galactic plane , but after Robert Julius Trumpler quantified this effect in 1930 by studying open cluster s, the present picture of our host galaxy, the Milky Way, emerged.   thu mosaic of the Milky Way arching at a high inclination across the night sky, shot from a dark-sky location in Chile. The Magellanic Clouds , satellite galaxies of the Milky Way, appear near the left edge.       A few galaxies outside the Milky Way are visible on a dark night to the unaided eye , including the Andromeda Galaxy , Large Magellanic Cloud , the Small Magellanic Cloud , and the Triangulum Galaxy . In the 10th century, the Persian astronomer Al-Sufi made the earliest recorded identification of the Andromeda Galaxy, describing it as a small cloud . In 964, Al-Sufi probably mentioned the Large Magellanic Cloud in his ": null
    },
    {
        "Book of Fixed Stars": "book of fixed stars"
    },
    {
        " ; it was not well known to Europeans until Magellan s voyage in the 16th century. The Andromeda Galaxy was later independently noted by Simon Marius in 1612.   In 1734, philosopher Emanuel Swedenborg in his Principia speculated that there may be galaxies outside our own that are formed into galactic clusters that are minuscule parts of the universe which extends far beyond what we can see. These views are remarkably close to the present-day views of the cosmos.   In 1745, Pierre Louis Maupertuis conjectured that some nebula -like objects are collections of stars with unique properties, including a glow exceeding the light its stars produce on their own, and repeated Johannes Hevelius s view that the bright spots are massive and flattened due to their rotation. Kant, Immanuel, ": null
    },
    {
        "Universal Natural History and Theory of the Heavens": "universal natural history and theory of the heavens"
    },
    {
        "   In 1750, Thomas Wright speculated that the Milky Way is a flattened disk of stars, and that some of the nebulae visible in the night sky might be separate Milky Ways. See text quoted from Wrights An original theory or new hypothesis of the Universe in   thu     Toward the end of the 18th century, Charles Messier compiled a catalog containing the 109 brightest celestial objects having nebulous appearance. Subsequently, William Herschel assembled a catalog of 5,000 nebulae. In 1845, Lord Rosse constructed a new telescope and was able to distinguish between elliptical and spiral nebulae. He also managed to make out individual point sources in some of these nebulae, lending credence to Kants earlier conjecture. parsonstown.info.     In 1912, Vesto Slipher made spectrographic studies of the brightest spiral nebulae to determine their composition. Slipher discovered that the spiral nebulae have high Doppler shift s, indicating that they are moving at a rate exceeding the velocity of the stars he had measured. He found that the majority of these nebulae are moving away from us.     In 1917, Heber Curtis observed nova S Andromedae within the Great Andromeda Nebula . Searching the photographic record, he found 11 more nova e. Curtis noticed that these novae were, on average, 10 magnitudes fainter than those that occurred within our galaxy. As a result, he was able to come up with a distance estimate of 150,000   parsec s. He became a proponent of the so-called island universes hypothesis, which holds that spiral nebulae are actually independent galaxies.     In 1920 a debate took place between Harlow Shapley and Heber Curtis , concerning the nature of the Milky Way, spiral nebulae, and the dimensions of the universe. To support his claim that the Great Andromeda Nebula is an external galaxy, Curtis noted the appearance of dark lanes resembling the dust clouds in the Milky Way, as well as the significant Doppler shift.     In 1922, the Estonia n astronomer Ernst Öpik gave a distance determination that supported the theory that the Andromeda Nebula is indeed a distant extra-galactic object. Using the new 100  inch Mt. Wilson telescope, Edwin Hubble was able to resolve the outer parts of some spiral nebulae as collections of individual stars and identified some Cepheid variable s, thus allowing him to estimate the distance to the nebulae: they were far too distant to be part of the Milky Way. In 1936 Hubble produced a classification of galactic morphology that is used to this day.       thu of a typical spiral galaxy: predicted based on the visible matter and observed . The distance is from the galactic core .     In 1944, Hendrik van de Hulst predicted that microwave radiation with wavelength of 21 cm would be detectable from interstellar atomic hydrogen gas; and in 1951 it was observed. This radiation is not affected by dust absorption, and so its Doppler shift can be used to map the motion of the gas in our galaxy. These observations led to the hypothesis of a rotating bar structure in the center of our galaxy. With improved radio telescope s, hydrogen gas could also be traced in other galaxies.   In the 1970s, Vera Rubin uncovered a discrepancy between observed galactic rotation speed and that predicted by the visible mass of stars and gas. Today, the galaxy rotation problem is thought to be explained by the presence of large quantities of unseen dark matter .   le survey to recalculate the total number of galaxies.     Beginning in the 1990s, the Hubble Space Telescope yielded improved observations. Among other things, Hubble data helped establish that the missing dark matter in our galaxy cannot solely consist of inherently faint and small stars. The Hubble Deep Field , an extremely long exposure of a relatively empty part of the sky, provided evidence that there are about 125 billion galaxies in the observable universe. Improved technology in detecting the spectra invisible to humans allow detection of other galaxies which are not detected by Hubble. Particularly, galaxy surveys in the Zone of Avoidance have revealed a number of new galaxies.     In 2016, a study published in ": null
    },
    {
        "The Astrophysical Journal": "the astrophysical journal"
    },
    {
        " and led by Christopher Conselice of the University of Nottingham using 3D modeling of images collected over 20 years by the Hubble Space Telescope concluded that there are more than two trillion galaxies in the observable universe. ": null
    }
]