[
    {
        "               Garage rock  is a raw and energetic style of ": null
    },
    {
        "rock and roll": "rock and roll"
    },
    {
        " that flourished in the mid42s, most notably in the United States and Canada, and has experienced a series of subsequent revivals. The style is characterized by basic ": null
    },
    {
        "chord": "chord"
    },
    {
        " structures played on electric guitars and other ": null
    },
    {
        "instruments": "musical instrument"
    },
    {
        ", sometimes distorted through a ": null
    },
    {
        "fuzzbox": "distortion"
    },
    {
        ", as well as often unsophisticated and occasionally aggressive lyrics and delivery. Its name derives from the perception that groups were often made up of young amateurs who rehearsed in the family garage, although many were professional.     In the US and Canada, ": null
    },
    {
        "surf rock": "surf rock"
    },
    {
        "—and later ": null
    },
    {
        "the Beatles": "the beatles"
    },
    {
        " and other ": null
    },
    {
        "beat": "beat music"
    },
    {
        " groups of the ": null
    },
    {
        "British Invasion": "british invasion"
    },
    {
        "—motivated thousands of young people to form bands between 42 and 42 Hundreds of acts produced regional hits, and some had national hits, usually played on ": null
    },
    {
        "AM radio": "am radio"
    },
    {
        " stations. With the advent of ": null
    },
    {
        "psychedelia": "psychedelic music"
    },
    {
        ", a number of garage bands incorporated exotic elements into the genres primitive stylistic framework. After 42 as more sophisticated forms of rock music came to dominate the marketplace, garage rock records largely disappeared from national and regional charts, and the movement faded. Other countries in the 42s developed similar grass-roots rock movements that have sometimes been characterized as variants of garage rock.     During the 42s garage rock was not recognized as a distinct genre and had no specific name, but critical hindsight in the early 42s—and especially the 42 ": null
    },
    {
        "compilation album": "compilation album"
    },
    {
        "  Nuggets —did much to define and memorialize the style. Between 42 and 42 certain American ": null
    },
    {
        "rock critic": "rock critic"
    },
    {
        "s began to retroactively identify the music as a genre and for several years used the term ": null
    },
    {
        "punk rock": "punk rocketymology and classification"
    },
    {
        " to describe it, making it the first form of music to bear the description, predating the more familiar use of the term appropriated by the later ": null
    },
    {
        "punk rock": "punk rock"
    },
    {
        " movement that it influenced. Garage rock came into use at the beginning of the 42s and eventually gained favor amongst devotees. The genre has also been referred to as ": null
    },
    {
        "proto-punk": "proto-punk"
    },
    {
        " .     In the early to mid42s, several revival scenes emerged featuring acts that consciously attempted to replicate the look and sound of 42s garage bands. Later in the decade, a louder, more contemporary garage subgenre developed that combined garage rock with modern punk rock and other influences, sometimes using the ": null
    },
    {
        "garage punk": "garage punk"
    },
    {
        " label originally and otherwise associated with 42s garage bands. In the 42s, a wave of garage-influenced acts associated with the ": null
    },
    {
        "post-punk revival": "post-punk revival"
    },
    {
        " emerged, and some achieved commercial success. Garage rock continues to appeal to musicians and audiences who prefer a back to basics or ": null
    },
    {
        "do-it-yourself": "diy ethic"
    },
    {
        " musical approach.               The term garage rock , often used in reference to 42s acts, stems from the perception that many performers were young amateurs who rehearsed in the family garage. While numerous bands were made up of middle-class teenagers from the suburbs, others were from rural or urban areas or were composed of professional musicians in their twenties. The term garage band is often used to refer to musical acts in this genre.     Referring to the 42s, Mike Markesich commented teenage rock & roll groups proliferated Everywheresville USA . Though it is impossible to determine how many garage bands were active in the era, their numbers were extensive on a still unprecedented scale in what Markesich has characterized as a cyclonic whirlwind of musical activity like none other . According to Mark Nobles, it is estimated that between 42 and 42 over 42 bands formed in the United States, and several thousand US garage acts made records during the era.and in some cases younger": null
    },
    {
        "s": "s"
    },
    {
        "s": "s"
    },
    {
        "and subsequent artists then perceived to be their stylistic inheritors": null
    },
    {
        "gazi": "gazi"
    },
    {
        "sici": "sici"
    },
    {
        "particularly guitars": null
    },
    {
        "strument": "strument"
    },
    {
        " By the end of the 42s regional scenes were abundant around the country and helped set the stage for garage rock the 42s.     Guitarist ": null
    },
    {
        "Link Wray": "link wray"
    },
    {
        " has been cited as an early influence on garage rock and is known for his innovative use of guitar techniques and effects such as power chords and distortion. He is best known for his 42 instrumental ": null
    },
    {
        "Rumble": "rumble"
    },
    {
        " , which featured the sound of distorted, clanging guitar chords, which anticipated much of what was to come. The combined influences of early42s ": null
    },
    {
        "instrumental rock": "instrumental rock"
    },
    {
        " and ": null
    },
    {
        "surf rock": "surf rock"
    },
    {
        " also played significant roles in shaping the sound garage rock.          According to ": null
    },
    {
        "Lester Bangs": "lester bangs"
    },
    {
        ", the origins of garage rock as a genre can be traced to California and the Pacific Northwest in the early Sixties . The ": null
    },
    {
        "Pacific Northwest": "pacific northwest"
    },
    {
        ", which encompasses ": null
    },
    {
        "Washington": "washington"
    },
    {
        ", ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        ", and ": null
    },
    {
        "Idaho": "idaho"
    },
    {
        ", played a critical role in the inception of garage rock, hosting the first scene to produce a sizable number of acts, and pre-dated the ": null
    },
    {
        "British Invasion": "british invasion"
    },
    {
        " by several years. The signature garage sound that eventually emerged in the Pacific Northwest is sometimes referred to as the Northwest Sound and had its origins in the late 42s, when a handful of R & B and rock & roll acts sprung up in various cities and towns in an area stretching from Puget Sound to Seattle and Tacoma, and beyond.     There and elsewhere, groups of teenagers were inspired directly by touring ": null
    },
    {
        "R & B": "r & b"
    },
    {
        " performers such as ": null
    },
    {
        "Johnny Otis": "johnny otis"
    },
    {
        " and ": null
    },
    {
        "Richard Berry": "richard berry"
    },
    {
        ", and began to play ": null
    },
    {
        "cover version": "cover version"
    },
    {
        "s of R & B songs. During the late 42s and early 42s other instrumental groups playing in the region, such as ": null
    },
    {
        "the Ventures": "the ventures"
    },
    {
        ", formed in 42 in ": null
    },
    {
        "Tacoma, Washington": "tacoma, washington"
    },
    {
        ", who came to specialize in a surf rock sound, and ": null
    },
    {
        "the Frantics": "the frantics"
    },
    {
        " from Seattle. The Blue Notes from Tacoma, Washington, fronted by ": null
    },
    {
        " Rockin Robin Roberts": "rockin robin roberts"
    },
    {
        ", were one of the citys first teenage rock & roll bands. ": null
    },
    {
        "The Wailers": "the fabulous wailers"
    },
    {
        " had national chart hit in 42 the instrumental Tall Cool One . After the demise of Blue Notes, Rockin Robin did a brief stint with the Wailers, and with him on vocals in 42 they recorded a version of Richard Berrys 42 song ": null
    },
    {
        "Louie Louie": "louie louie"
    },
    {
        " —their arrangement became the much-replicated blueprint for practically every band in the region, including Portlands ": null
    },
    {
        "the Kingsmen": "the kingsmen"
    },
    {
        " who went on to achieve a major hit with it the following year.     Other regional scenes of teenage bands playing R & B-oriented rock were well-established in the early 42s, several years before the ": null
    },
    {
        "British Invasion": "british invasion"
    },
    {
        ", in places such as ": null
    },
    {
        "Texas": "texas"
    },
    {
        " and the ": null
    },
    {
        "Midwest": "midwest"
    },
    {
        ". At the same time, in ": null
    },
    {
        "southern California": "southern california"
    },
    {
        " surf bands formed, playing raucous guitar- and saxophone-driven instrumentals. Writer Neil Campbell commented: There were literally thousands of rough-and-ready groups performing in local bars and dance halls throughout the US prior to the arrival of the Beatles  ... e indigenous popular music which functioned in this way  ... was the protopunk more commonly identified as garage rock .               As a result of cross-pollination between surf rock, hot rod music, and other influences, an energetic and upbeat style sometimes referred to as frat rock emerged, which has been mentioned as an early subgenre of garage rock. Though often associated with Pacific Northwest acts such as ": null
    },
    {
        "the Kingsmen": "the kingsmen"
    },
    {
        ", it also thrived elsewhere.": null
    }
]