[
    {
        "           A gas mask is a ": null
    },
    {
        "mask": "mask"
    },
    {
        " used to protect the wearer from inhaling airborne ": null
    },
    {
        "pollutants": "pollutant"
    },
    {
        "and toxic gases. The mask forms a sealed cover over the nose and mouth, but may also cover the eyes and other vulnerable soft tissues of the face. Most gas masks are also ": null
    },
    {
        "respirator": "respirator"
    },
    {
        "s, though the word gas mask is often used to refer to military equipment . The user of the gas mask is not protected from gas that the skin can absorb. Most gas mask filters will last around 24 hours in a nuclear biological chemical situation.     Airborne toxic materials may be gaseous  or particulates . Many gas masks include protection from both types. Gas masks are used in construction to protect against welding fumes, in demolition to protect against ": null
    },
    {
        "asbestos": "asbestos"
    },
    {
        " or other hazardous particles, and in the chemical industry when handling ": null
    },
    {
        "hazardous materials": "hazardous materials"
    },
    {
        ", as in making repairs to leaking equipment or cleaning up after spills; workers are usually issued gas masks as a precaution against leaks.     During demonstrations and protests where ": null
    },
    {
        "tear gas": "tear gas"
    },
    {
        " or ": null
    },
    {
        "CS gas": "cs gas"
    },
    {
        " is employed by riot police, gas masks are commonly used by police and demonstrators alike. Aside from serving their functional purposes, gas masks are also used as emblems in ": null
    },
    {
        "industrial music": "industrial music"
    },
    {
        ", with the most notable example, the ": null
    },
    {
        "subgenre": "subgenre"
    },
    {
        " of ": null
    },
    {
        "drum and bass": "drum and bass"
    },
    {
        " called ": null
    },
    {
        "neurofunk": "neurofunk"
    },
    {
        ". These emblems are used by ": null
    },
    {
        "graffiti": "graffiti"
    },
    {
        " taggers because the mask protects them from the paint canisters ": null
    },
    {
        "toxic fumes": "toxic"
    },
    {
        ", and by ": null
    },
    {
        "urban explorers": "urban exploration"
    },
    {
        " venturing into environments where hazardous materials, such as asbestos, may be present.     The traditional gas mask style with two small circular eye windows originated when the only suitable material for these eye windows was ": null
    },
    {
        "glass": "glass"
    },
    {
        " or ": null
    },
    {
        "acrylic": "poly"
    },
    {
        "; as glass is notoriously brittle, glass eye windows had to be kept small and thick. Later, the discovery of ": null
    },
    {
        "polycarbonate": "polycarbonate"
    },
    {
        " allowed for gas masks with a large full-face window. Some have one or two filters attached to the face mask while others have a large filter connected to the face mask with a hose that is sometimes confused with an air-supplied respirator in which an alternate supply of fresh air is delivered.       ": null
    },
    {
        "Absorption": "absorption"
    },
    {
        " is the process of being drawn into a body or substrate, and ": null
    },
    {
        "adsorption": "adsorption"
    },
    {
        " is the process of deposition upon a surface. This can be used to remove both particulate and gaseous hazards. Although some form of ": null
    },
    {
        "reaction": "chemical reaction"
    },
    {
        " may take place, it is not necessary; the method may work by attractive ": null
    },
    {
        "charges": "electric charge"
    },
    {
        ". For example, if the target particles are positively charged, a negatively charged substrate may be used. Examples of substrates include ": null
    },
    {
        "activated carbon": "activated carbon"
    },
    {
        ", and ": null
    },
    {
        "zeolite": "zeolite"
    },
    {
        " MCU-2/P protective mask": "mcu-2/p protective mask"
    },
    {
        "M17 gas masks": "m17 gas mask"
    },
    {
        "        Gas masks have a limited useful lifespan that is related to the absorbent capacity of the filter. Once the filter has been saturated with hazardous chemicals, it ceases to provide protection and the user may be injured. Most gas masks use sealing caps over the air intake to prevent the filter from degrading before use, but the protective abilities also degrade as the filter ages or if it is exposed to moisture and heat. Very old unused gas mask filters from World War II may not be effective at all in protecting the user, and can even potentially cause harm to the user due to long-term changes in the filter chemical composition.        World War II gas masks contained ": null
    },
    {
        "chrysotile asbestos": "chrysotile asbestos"
    },
    {
        " or ": null
    },
    {
        "crocidolite asbestos": "riebeckitecrocidolite_"
    },
    {
        " in their filters.   It is unknown how long for certain the materials were used in filters. Breathing blue asbestos in the factories resulted in the death of 10 percent of the workforce due to pleural and ": null
    },
    {
        "peritoneal mesothelioma": "peritoneal mesothelioma"
    },
    {
        ". This rate was between 2.5 and 3.2 times the normal incidence of lung or respiratory cancers.      Many stories have originated from various Russian gas masks and their filters that are now common in surplus stores; the ": null
    },
    {
        "GP-5": "gp-5 gas mask"
    },
    {
        " was often considered to have an asbestos filter. Although the filter is made so that the asbestos fibres cannot be breathed in if the filter layer is not damaged, these expired filters and others should be avoided for risk of health. All Russian ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " period gas mask filters contain asbestos and should be avoided.     Modern gas masks are quite safe and do not use asbestos, but it is still important to be careful when using a modern gas mask. Typically, masks using 40  mm connections are a more recent design. Rubber degrades with time, so new in-box modern type masks can be ": null
    },
    {
        "cracked": "ozone cracking"
    },
    {
        " and leak. Also, the US C2 canister was shown to contain ": null
    },
    {
        "hexavalent chromium": "hexavalent chromium"
    },
    {
        ": the studies by the ": null
    },
    {
        "U.S. Army Chemical Corps": "u.s. army chemical corps"
    },
    {
        " showed that the levels in the filter were acceptable, but imply caution when using, as it is a ": null
    },
    {
        "carcinogen": "carcinogen"
    },
    {
        ".         The filter is selected according to the toxic compound.  Each filter type protects against a particular hazard:     AX - Low-boiling organic compounds   A - High-boiling    ref  /ref  gallery  /gallery  ref  /ref  ref nameHill  /ref  ref  /ref  ref  /ref  ref  /ref  ref name disu  /ref  ref  /ref ref name Benson2010  /ref ref  /ref  ref  /ref ref name pbs.org/wgbh/theymadeamerica2  /ref ref name encyclopedia.com/topic/Garrett_Morgan2  /ref ref name biography.com/people/garrett-morgan2  /ref  ref  /ref  ref name Lefebure  /ref  ref namerooms  /ref  ref name RCS  /ref  ref name gasmasknet  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref name ReferenceA /ref  ref  /ref ref  /ref  ref  /ref  ref ": null
    }
]