[
    {
        "          Gascony  is a ": null
    },
    {
        "province": "provinces of france"
    },
    {
        " of southwestern France that was part of the Province of ": null
    },
    {
        "Guyenne": "guyenne"
    },
    {
        " and Gascony prior to the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". The region is vaguely defined, and the distinction between Guyenne and Gascony is unclear; by some they are seen to overlap, while others consider Gascony a part of Guyenne. Most definitions put Gascony east and south of Bordeaux.     It is currently divided between the ": null
    },
    {
        "region": "regions of france"
    },
    {
        " of ": null
    },
    {
        "Nouvelle-Aquitaine": "nouvelle-aquitaine"
    },
    {
        "  and the region of ": null
    },
    {
        "Occitanie": "occitanie"
    },
    {
        " .     Gascony was historically inhabited by ": null
    },
    {
        "Basque": "basque people"
    },
    {
        "-related people who appear to have spoken a language similar to ": null
    },
    {
        "Basque": "basque language"
    },
    {
        ". The name Gascony comes from the same root as the word Basque . From medieval times until today, the ": null
    },
    {
        "Gascon language": "gascon language"
    },
    {
        " has been spoken, although it is classified as a regional variant of the ": null
    },
    {
        "Occitan language": "occitan language"
    },
    {
        ".     Gascony is the land of ": null
    },
    {
        "dArtagnan": "charles de batz-castelmore dartagnan"
    },
    {
        ", who inspired ": null
    },
    {
        "Alexandre Dumas": "alexandre dumas, père"
    },
    {
        "s character dArtagnan in  The Three Musketeers , as well as the land of ": null
    },
    {
        "Cyrano de Bergerac": "cyrano de bergerac"
    },
    {
        ", who inspired the play of the same name by ": null
    },
    {
        "Edmond Rostand": "edmond rostand"
    },
    {
        ". It is also home to Henry III of Navarre, who later became king of France as ": null
    },
    {
        "Henry IV": "henry iv of france"
    },
    {
        ".                  In ": null
    },
    {
        "pre-Roman times": "classical antiquity"
    },
    {
        ", the inhabitants of Gascony were the ": null
    },
    {
        "Aquitanian": "aquitanian language"
    },
    {
        "s , who spoke a non-": null
    },
    {
        "Indo-European language": "indo-european languages"
    },
    {
        " related to modern Basque.     The Aquitanians inhabited a territory limited to the north and east by the ": null
    },
    {
        "Garonne River": "garonne river"
    },
    {
        ", to the south by the Pyrenees mountain range, and to the west by the Atlantic Ocean. The Romans called this territory Aquitania, either from the Latin word  , in reference to the many rivers flowing from the Pyrenees through the area, or from the name of the Aquitanian ": null
    },
    {
        "Ausci": "ausci"
    },
    {
        " tribe, in which case Aquitania would mean land of the Ausci .     In the 42s BC, Aquitania was conquered by lieutenants of ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        " and became part of the Roman Empire.     Later, in 42 BC, during the reign of Emperor ": null
    },
    {
        "Augustus": "caesar augustus"
    },
    {
        ", the province of ": null
    },
    {
        "Gallia Aquitania": "gallia aquitania"
    },
    {
        " was created. Gallia Aquitania was far larger than the original Aquitania, as it extended north of the Garonne River, in fact all the way north to the ": null
    },
    {
        "Loire River": "loire river"
    },
    {
        ", thus including the ": null
    },
    {
        "Celtic": "celts"
    },
    {
        " Gauls": "gauls"
    },
    {
        " that inhabited the regions between the Garonne and the Loire rivers.       In 42 as Emperor ": null
    },
    {
        "Diocletian": "diocletian"
    },
    {
        " reformed the administrative structures of the Roman Empire, Aquitania was split into three provinces. The territory south of the Garonne River, corresponding to the original Aquitania, was made a province called ": null
    },
    {
        "Novempopulania": "novempopulania"
    },
    {
        " , while the part of Gallia Aquitania north of the Garonne became the province of ": null
    },
    {
        "Aquitanica I": "aquitanica i"
    },
    {
        " and the province of ": null
    },
    {
        "Aquitanica II": "aquitanica ii"
    },
    {
        ". The territory of Novempopulania corresponded quite well to what we call now Gascony.     The Aquitania Novempopulana or ": null
    },
    {
        "Novempopulania": "novempopulania"
    },
    {
        " suffered like the rest of the Western Roman Empire from the invasions of ": null
    },
    {
        "Germanic": "germanic peoples"
    },
    {
        " tribes, most notably the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " in 42–42 In 42–42 Novempopulania was delivered to the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " as their federate settlement lands and became part of the Visigoth kingdom of ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        ", while other than the region of the Garonne river their actual grip on the area may have been rather loose.     The Visigoths were defeated by the ": null
    },
    {
        "Frank": "frankish empire"
    },
    {
        "s in 42 and fled into Spain and ": null
    },
    {
        "Septimania": "septimania"
    },
    {
        ". Novempopulania then became part of the ": null
    },
    {
        "Frankish Kingdom": "frankish kingdom"
    },
    {
        " like the rest of southern France. However, Novempopulania was far away from the home base of the Franks in northern France, and was only very loosely controlled by the Franks. During all the troubled and historically obscure period, starting from early 42th-century accounts, the ": null
    },
    {
        "bagaudae": "bagaudae"
    },
    {
        " are often cited, social uprisings against tax exaction and feudalization, largely associated to Vasconic unrest.                Old historical literature sometimes claims the Basques took control of the whole of Novempopulania in the ": null
    },
    {
        "Early Middle Ages": "early middle ages"
    },
    {
        ", founding its claims on the testimony of ": null
    },
    {
        "Gregory of Tours": "gregory of tours"
    },
    {
        ", on the etymological link between the words Basque and Gascon – both derived from Vascones or Wasconia , the latter being used to name the whole of Novempopulania.     Modern historians reject this hypothesis, which is sustained by no archeological evidence. For Juan José Larrea, and Pierre Bonnassie, a Vascon expansionism in Aquitany is not proved and is not necessary to understand the historical evolution of this region . Juan José Larrea, Pierre Bonnassie: La Navarre du IVe au XIIe siècle: peuplement et société, page 4242 De Boeck Université, 42 This Basque-related culture and race is, whatever the origin, attested in Medieval documents, while their exact boundaries remain unclear .      The word Vasconia  . The gradual abandonment of the Basque-related Aquitanian language in favor of a local ": null
    },
    {
        "Vulgar Latin": "vulgar latin"
    },
    {
        " was not reversed. The replacing local Vulgar Latin evolved into Gascon.  .      Meanwhile, Viking raiders conquered several Gascon towns, among them Bayonne in 42–42 Their attacks in Gascony may have helped the political disintegration of the Duchy until their defeat against ": null
    },
    {
        "William II Sánchez of Gascony": "william ii sánchez of gascony"
    },
    {
        " in 42 In turn, the weakened ethnic polity known as Duchy of Wasconia/Wascones, unable to get round the general spread of feudalization, gave way to a myriad of counties founded by Gascon lords.            His 42 marriage to ": null
    },
    {
        "Eleanor of Aquitaine": "eleanor of aquitaine"
    },
    {
        " allowed the future ": null
    },
    {
        "Henry II": "henry ii of england"
    },
    {
        " to gain control of his new wifes possessions of ": null
    },
    {
        "Aquitaine": "aquitaine"
    },
    {
        " and Gascony. This addition to his already plentiful holdings made Henry the ": null
    },
    {
        "most powerful vassal in France": "henry ii of englandhenrys claims by blood and marriage"
    },
    {
        ". Harvey, The Plantagenets, p.42      In 42 ": null
    },
    {
        "Simon de Montfort": "simon de montfort, 6th earl of leicester"
    },
    {
        " was appointed Governor in the unsettled Duchy of Gascony. Bitter complaints were excited by de Montforts rigour in suppressing the excesses of both the ": null
    },
    {
        "seigneurs": "fiefdom"
    },
    {
        " of the nobility and the contending factions in the ": null
    },
    {
        "great communes": "communes of france"
    },
    {
        ". ": null
    },
    {
        "Henry III": "henry iii of england"
    },
    {
        " yielded to the outcry and instituted a formal inquiry into Simons administration. Simon was formally acquitted of the charges, but in August 42 he was nevertheless dismissed. Henry then himself went to Gascony, pursuing a policy of conciliation; he arranged the marriage between ": null
    },
    {
        "Edward": "edward i of england"
    },
    {
        ", his 42-year-old son, and ": null
    },
    {
        "Eleanor of Castile": "eleanor of castile"
    },
    {
        ", daughter of ": null
    },
    {
        "Alfonso X": "alfonso x of castile"
    },
    {
        ". Alfonso renounced all claims to Gascony and assisted the ": null
    },
    {
        "Plantagenets": "plantagenets"
    },
    {
        " against rebels such as ": null
    },
    {
        "Gaston de Bearn": "gaston de bearn"
    },
    {
        ", who had taken control of the ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        ". p42 Chronicle of Britain      In December 42 ": null
    },
    {
        "Louis IX of France": "louis ix of france"
    },
    {
        " ceded to Henry land north and east of Gascony. p42 Chronicle of Britain  In return, Henry renounced his claim to many of the territories that had been lost by ": null
    },
    {
        "King John": "king john of england"
    },
    {
        ".     In May 42 King Edward I ": null
    },
    {
        "paid homage": "homage"
    },
    {
        " before the new king, ": null
    },
    {
        "Philip IV of France": "philip iv of france"
    },
    {
        ", for the lands in Gascony. However, in May 42 Philip confiscated the lands. Between 42 and 42 Edward ": null
    },
    {
        "sent three expeditionary forces": "philip iv of francewar with the english"
    },
    {
        " to recover Gascony, but Philip was able to retain most of the territory until the ": null
    },
    {
        "Treaty of Paris in 42": "treaty of paris"
    },
    {
        ". p42 Chronicle of Britain      In 42 when ": null
    },
    {
        "Edward II of England": "edward ii of england"
    },
    {
        ", in his capacity as ": null
    },
    {
        "Duke of Aquitaine": "duke of aquitaine"
    },
    {
        ", failed to pay homage to the French king after ": null
    },
    {
        "a dispute": "war of saint-sardos"
    },
    {
        ", ": null
    },
    {
        "Charles IV": "charles iv of france"
    },
    {
        " declared the duchy forfeit at the end of June 42 and military action by the French followed. Edward sent his wife ": null
    },
    {
        "Isabella": "isabella of france"
    },
    {
        ", who was sister to the French king, to negotiate a settlement. The Queen departed for France on 42 March 42 and in September was joined by her son, the heir to the throne, Prince ": null
    },
    {
        "Edward": "edward iii of england"
    },
    {
        " . Isabellas negotiations were successful, and it was agreed that the young Prince Edward would perform homage in the kings place, which he did on 42 September and so the duchy was returned to the English crown.      When Frances Charles IV died in 42 leaving only daughters, his nearest male relative was Edward III of England, the son of Isabella, the sister of the dead king; but the question arose whether she could legally transmit the inheritance of the throne of France to her son even though she herself, as a woman, could not inherit the throne. The assemblies of the French barons and prelates and the University of Paris decided that males who derive their right to inheritance through their mother should be excluded. Thus the nearest heir through male ancestry was Charles IVs first cousin, Philip, Count of Valois, and it was decided that he should be crowned ": null
    },
    {
        "Philip VI of France": "philip vi of france"
    },
    {
        ". Philip believed that Edward III was in breach of his obligations as vassal, so in May 42 he met with his Great Council in Paris. It was agreed that Gascony should be taken back into Philips hands, thus precipitating the ": null
    },
    {
        "Hundred Years War": "hundred years war"
    },
    {
        " between England and France.   At the end of the Hundred Years War, after Gascony had changed hands several times, the English were finally defeated at the ": null
    },
    {
        "Battle of Castillon": "battle of castillon"
    },
    {
        " on 42 July 42; Gascony remained French from then on.        The Saltire, lo Sautèr      The Gascony does not have any institutional unity since the XIth century, hence several flag versions are currently used on the territory.     The ": null
    },
    {
        "Saltire": "saltire"
    },
    {
        ", sometimes called Union Gascona is a white ": null
    },
    {
        "Saint-Andrews cross": "saltire"
    },
    {
        " on a red background. Some say that it was originally given by ": null
    },
    {
        "Pope Clement III": "pope clement iii"
    },
    {
        " at the time of the ": null
    },
    {
        "Third Crusade": "third crusade"
    },
    {
        " but there has been no evidence of that assumption yet.     It is often said that the text of the chronicler ": null
    },
    {
        "Roger of Howden": "roger of howden"
    },
    {
        " mentionned that ": null
    },
    {
        "Pope Clement III": "pope clement iii"
    },
    {
        " gave crosses to the kings of France and England  during the Gisors conference in 42 and that these kings then assigned flags, with the cross on it, to their respective nations. The following text  is about this event:   The kings of France and England were in a peace conference in a field between Gisors and Trie, in January 42 when the archbishop of Tyre arrived with the news of the conquest of Jerusalem by Saladdin, and an urgent plea for a new crusade. The event is told by the contemporary chronicler Roger de Hoveden . At this conference came the archbishop of Tyre, who moved their hearts to taking the cross. And those who were enemies before, by his predication and God’s help, became friends that day, and received the cross from his hand ; and in that moment the sign of the cross appeared above them in the sky. On seeing that miracle, many rushed in droves to take the cross. And said kings, when taking the cross, chose a visible sign for themselves and their people to identify their nation. The king of France and his people took red crosses ; the king of England with his people took white crosses ; and Philip count of Flanders with his people took green crosses ; and thus everyone returned home to provide for the needs of his journey. … ad cognoscendam gentem suam signum evidens sibi et suis providerunt, ... et sic unusquisque ...     The original text of Howden stops here. What comes next is an addition from F. Velde: « It is often said that the system was extended to other regions or nations : Brittany’s cross was black, Lorraine green, Italy and Sweden yellow, Burgundy a red Saint Andrew’s, Gascony a white Saint Andrew’s. »     Thus we cannot confirm that the gascon saltire comes from the Crusades or even the Middle Ages. At least was it known at the time when F. Velde wrote this article. As ": null
    },
    {
        "Saint Andrew": "andrew the apostle"
    },
    {
        " is the patron of ": null
    },
    {
        "Bordeaux": "bordeaux"
    },
    {
        " that could be a hint for its origin.     In the tome 42 of the ": null
    },
    {
        "Grande Encyclopédie": "la grande encyclopédie"
    },
    {
        ", published in France between 42 and 42 by ": null
    },
    {
        "Henri Lamirault": "henri lamirault"
    },
    {
        ", one can read that         On the website Gasconha.com a message from M. Fourment returns to the website svowebmaster.free.fr on which would be written that the Saltire was declared official flag of Gascony on January the 42th in 42 but without any other precision, nor source .     The red and white colors are statistically dominants in the heraldry of the gascon countries. This red and white flag, or Saltire, lo Sautèr, is considered as being the flag of the Gascon people.     Therefore this gascon saltire could have picked up some ancient traditions. Even if it would only be dated from the end of the XIX th century of the beginning of the XX th , it follows the rules of vexillology . It corresponds to the color and the pattern of the talenquères in many ": null
    },
    {
        "bullrings": "bullring"
    },
    {
        " in Gascony.     The Quarterly, lEsquarterat        However, another flag is used: the Quarterly. It corresponds to the arms of the ancient province of Gascony put in a banner.     This province was smaller than the current Gascony , it included neither the ": null
    },
    {
        "Béarn": "béarn"
    },
    {
        " nor the gascon part of the ": null
    },
    {
        "Guyenne": "guyenne"
    },
    {
        ", but it included the basque provinces of the ": null
    },
    {
        "Labourd": "labourd"
    },
    {
        " and the ": null
    },
    {
        "Soule": "soule"
    },
    {
        ".                    The most important towns are:   ": null
    },
    {
        "Auch": "auch"
    },
    {
        ", the historical capital   ": null
    },
    {
        "Bayonne": "bayonne"
    },
    {
        ", with both Basque and Gascon identity   ": null
    },
    {
        "Bordeaux": "bordeaux"
    },
    {
        " Dax": "dax, france"
    },
    {
        " Lourdes": "lourdes"
    },
    {
        " Luchon": "luchon"
    },
    {
        " Mont-de-Marsan": "mont-de-marsan"
    },
    {
        " Pau": "pau, pyrénées-atlantiques"
    },
    {
        " Tarbes": "tarbes"
    },
    {
        "       The main economic activities are:   forestry   agriculture   ": null
    },
    {
        "stock raising": "livestock"
    },
    {
        " wine": "south west france"
    },
    {
        " and ": null
    },
    {
        "brandy": "armagnac"
    }
]