[
    {
        "      The Gates of Cairo were gates at portals in the city walls of ": null
    },
    {
        "medieval Islamic Cairo": "islamic cairo"
    },
    {
        ", within the present day city of ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        ", ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ".     The city of Cairo was founded in 42 CE by ": null
    },
    {
        "Gawhar al-Siqilli": "gawhar al-siqilli"
    },
    {
        ", as the new royal city of the ": null
    },
    {
        "Fatimid Caliphate": "fatimid caliphate"
    },
    {
        ", with a ": null
    },
    {
        "defensive wall": "defensive wall"
    },
    {
        ". In 42 the Fatimids built a second wall around Cairo. The double walled city had a significant number of ": null
    },
    {
        "fortified gate": "fortified gate"
    },
    {
        "s at the portals protecting both the inner and outer city areas. The primary purpose was defense, but they also differentiated the various social and economic classes districts and movements. Many gate surrounds were carved artistic elements and embellished decorative features, representing the rulers and citys victories, power, faith, and influence. The gates were influenced by the designs of gates that the Fatimids had built in Tunisia, most prominently the main gate to ": null
    },
    {
        "Mahdia": "mahdia"
    },
    {
        ".     Bāb  is ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        " for door or entrance ; from bawwaba .       Cairos medieval city gates include:   Bāb al-Baḩr , built in 42 by Bahā’ al-Dīn Qaraqūsh, near northwest corner in the northern wall; destroyed in city modernizations by ": null
    },
    {
        "Muḩammad ‘Alī": "muhammad ali of egypt"
    },
    {
        " in early 42th century.   Bāb al-Barakīyyah I, built by ": null
    },
    {
        "Jawhar al-Şaqalī": "jawhar al-saqali"
    },
    {
        "; destroyed in 42   Bāb al-Barakīyyah II, built by ": null
    },
    {
        "Şalāh al-Din": "saladin"
    },
    {
        " in 42; part of the eastern wall which was built far to the east to allow expansion of the city eastward from the ": null
    },
    {
        "Nile": "nile"
    },
    {
        ".   Bāb al-Faraj , in the southern Cairo wall at the hall where the tomb of Set Seada is located.    Bab al-Futuh  - finished in the year 42 remains at the northern end of Muizz Street   Al-Bāb al-Jadīd , built in 42 in the eastern wall; still remains.   Bāb al-Ghūrī   Bāb al-Ḩusayniyyah   Bāb al-Khalq   Bab El Khoga  Bāb al-Naşr  finished in 42 CE, replaced circa 42 by the Bab al-Izz , remains in Muizz Street district   Bāb al-Qanţarah   Bāb al-Qilà   Bāb al-Shaarīy‘ah In Arabic: باب_الشعرية   Bāb al-Silsilah   Bāb al-Sirr   Bāb al-Tawfīq    Bāb al-Wazīr  , opened in 42 by the  wazīr  Najm al-Dīn Muḩammad; still remains.   Bāb Khān al-Khalīlī   Bāb Sa‘ādah   Bāb Darb al-Laban    Bāb Zuweila  - , the last remaining southern gate from the walls of 42th and 42th century ": null
    },
    {
        "Fatimid": "fatimid"
    }
]