[
    {
        "        Gavrilo Princip  was a ": null
    },
    {
        "Bosnian Serb": "Serbs Of Bosnia And Herzegovina"
    },
    {
        " member of ": null
    },
    {
        "Young Bosnia": "Young Bosnia"
    },
    {
        " who sought an end to ": null
    },
    {
        "Austro-Hungarian rule in Bosnia and Herzegovina": "Austro-Hungarian Rule In Bosnia And Herzegovina"
    },
    {
        ". At the age of 19, he assassinated ": null
    },
    {
        "Archduke Franz Ferdinand of Austria": "Archduke Franz Ferdinand Of Austria"
    },
    {
        " and the Archdukes wife, ": null
    },
    {
        "Sophie, Duchess of Hohenberg": "Sophie, Duchess Of Hohenberg"
    },
    {
        ", in ": null
    },
    {
        "Sarajevo": "Sarajevo"
    },
    {
        " on 28 June 1914. Princip and his accomplices were arrested and implicated a Serbian nationalist secret society, which initiated the ": null
    },
    {
        "July Crisis": "July Crisis"
    },
    {
        " and led to the outbreak of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ".     At his trial, Princip stated that: I am a Yugoslav nationalist, aiming for the unification of all Yugoslavs, and I do not care what form of state, but it must be freed from Austria.  Princip was sentenced to twenty years in prison, the maximum for his age, and was imprisoned at the ": null
    },
    {
        "Terezín": "Terezín"
    },
    {
        " fortress. He died on 28 April 1918 from ": null
    },
    {
        "tuberculosis": "Tuberculosis"
    },
    {
        " exacerbated by poor prison conditions which had already caused the loss of his right arm.       Gavrilo Princip was born in the remote hamlet of ": null
    },
    {
        "Obljaj": "Obljaj"
    },
    {
        ", near ": null
    },
    {
        "Bosansko Grahovo": "Bosansko Grahovo"
    },
    {
        ", on . He was the second of his parents nine children, six of whom died in infancy. Princips mother Marija wanted to name him after her late brother Špiro, but he was named Gavrilo at the insistence of a local ": null
    },
    {
        "Eastern Orthodox": "Eastern Orthodox Church"
    },
    {
        " priest, who claimed that naming the sickly infant after the Archangel ": null
    },
    {
        "Gabriel": "Gabriel"
    },
    {
        " would help him survive.           A ": null
    },
    {
        "Serb": "Serb"
    },
    {
        " family, the Princips had lived in northwestern Bosnia for many centuries and adhered to the ": null
    },
    {
        "Serbian Orthodox Christian": "Serbian Orthodox Christian"
    },
    {
        " faith. Princips parents, Petar and Marija , were poor farmers who lived off the little land that they owned. They belonged to a class of Christian peasants known as kmets , who were often oppressed by their Muslim landlords.     Petar, who insisted on strict correctness, never drank or swore and was ridiculed by his neighbours as a result. In his youth, he fought in the ": null
    },
    {
        "Herzegovina Uprising": "Herzegovina Uprising"
    },
    {
        " against the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        ". Following the revolt, he returned to being a farmer in the Grahovo valley, where he worked approximately  of land and was forced to give a third of his income to his landlord. In order to supplement his income and feed his family, he resorted to transporting mail and passengers across the mountains between northwestern ": null
    },
    {
        "Bosnia": "Bosnia"
    },
    {
        " and ": null
    },
    {
        "Dalmatia": "Dalmatia"
    },
    {
        ".     Despite Petars opposition, Gavrilo Princip began attending primary school in 1903, aged nine. He overcame a difficult first year and became very successful in his studies, for which he was awarded a collection of Serbian epic poetry by his headmaster. At the age of 13, Princip moved to ": null
    },
    {
        "Sarajevo": "Sarajevo"
    },
    {
        ", where his elder brother Jovan intended to enroll him into an Austro-Hungarian military school. However, by the time Princip reached Sarajevo, Jovan had changed his mind after a friend advised him not to make Gavrilo an executioner of his own people. Princip was enrolled into a merchant school instead. Jovan paid for his tuition with the money he earned performing manual labour, carrying logs from the forests surrounding Sarajevo to mills within the city. After three years of study, Gavrilo transferred to a local ": null
    },
    {
        "gymnasium": "Gymnasium"
    },
    {
        ". In 1910, he came to revere ": null
    },
    {
        "Bogdan Žerajić": "Bogdan Žerajić"
    },
    {
        ", a ": null
    },
    {
        "Bosnian Serb": "Bosnian Serb"
    },
    {
        " revolutionary who attempted to assassinate ": null
    },
    {
        "Marijan Varešanin": "Marijan Varešanin"
    },
    {
        ", the Austro-Hungarian ": null
    },
    {
        "Governor of Bosnia and Herzegovina": "Governor Of Bosnia And Herzegovina"
    },
    {
        ", before taking his own life. In 1911, Princip joined ": null
    },
    {
        "Young Bosnia": "Young Bosnia"
    },
    {
        " , a society that wanted to separate Bosnia from Austria-Hungary and unite it with the neighbouring ": null
    },
    {
        "Kingdom of Serbia": "Kingdom Of Serbia"
    },
    {
        ". Because the local authorities had forbidden students to form organizations and clubs, Princip and other members of Young Bosnia met in secret. During their meetings, they discussed ": null
    },
    {
        "literature": "Literature"
    },
    {
        ", ": null
    },
    {
        "ethics": "Ethics"
    },
    {
        " and ": null
    },
    {
        "politics": "Politics"
    },
    {
        ".        In 1912, Princip was expelled from school for being involved in a demonstration against Austro-Hungarian authorities. A student who witnessed the incident claimed that Princip went from class to class, threatening with his ": null
    },
    {
        "knuckle-duster": "Brass Knuckles"
    },
    {
        " all the boys who wavered in coming to the new demonstrations.  Princip left Sarajevo shortly after being expelled and made the 280-kilometre journey to ": null
    },
    {
        "Belgrade": "Belgrade"
    },
    {
        " on foot. According to one account, he fell to his knees and kissed the ground upon crossing the border into Serbia. In Belgrade, Princip volunteered to join the Serbian guerrilla bands fighting the Ottoman Turks, under the leadership of Major ": null
    },
    {
        "Vojislav Tankosić": "Vojislav Tankosić"
    },
    {
        ". Tankosić was a member of the ": null
    },
    {
        "Black Hand": "Black Hand"
    },
    {
        ", the foremost conspiratorial society in Serbia at the time.     At first, Princip was rejected at a recruitment office in Belgrade because of his small stature. Enraged, he tracked down Tankosić himself, who also told him that he was too small and weak. Humiliated, Princip returned to Bosnia and lodged with his brother in Sarajevo. He spent the next several months moving back and forth between Sarajevo and Belgrade. In Belgrade he met Živojin Rafajlović, one of the founders of the ": null
    },
    {
        "Serbian Chetnik Organization": "Serbian Chetnik Organization"
    },
    {
        ", who sent him to the Chetnik training centre in ": null
    },
    {
        "Vranje": "Vranje"
    },
    {
        ".  There, they met with school manager Mihajlo Stevanović-Cupara. He lived in Cuparas house, which is today located on Gavrilo Princip Street in Vranje. Princip practiced shooting, using bombs and the blade, after which training was completed and he returned to Belgrade.      In 1913, while Princip was staying in Sarajevo, Austria-Hungary declared a ": null
    },
    {
        "state of emergency": "State Of Emergency"
    },
    {
        ", implemented ": null
    },
    {
        "martial law": "Martial Law"
    },
    {
        ", seized control of all schools, and prohibited all Serb cultural organizations.                   On 28 June 1914, Princip participated in the assassination of ": null
    },
    {
        "Archduke Franz Ferdinand of Austria": "Archduke Franz Ferdinand Of Austria"
    },
    {
        " and his wife, ": null
    },
    {
        "Duchess Sophie Chotek": "Sophie, Duchess Of Hohenberg"
    },
    {
        ". The royal couple arrived in ": null
    },
    {
        "Sarajevo": "Sarajevo"
    },
    {
        " by train shortly before 10 a.m. and rode in the third car of a six-car motorcade towards Town Hall.  Their cars top was rolled back in order to allow the crowds a good view of its occupants.     Princip and the five other conspirators lined the route. They were spaced out along the Appel Quay, each one with instructions to assassinate the Archduke when the royal car reached their position. The first conspirator on the route to see the royal car was ": null
    },
    {
        "Muhamed Mehmedbašić": "Muhamed Mehmedbašić"
    },
    {
        ". Standing by the Austro-Hungarian Bank, Mehmedbašić lost his nerve and allowed the car to pass without taking action. At 10:15 a.m., when the motorcade passed the central police station, nineteen-year-old student ": null
    },
    {
        "Nedeljko Čabrinović": "Nedeljko Čabrinović"
    },
    {
        " hurled a ": null
    },
    {
        "hand grenade": "Hand Grenade"
    },
    {
        " at the Archdukes car. The driver accelerated when he saw the object flying towards him, and the bomb, which had a 10-second delay, exploded under the fourth car. Two of the occupants were seriously wounded. After Čabrinovićs failed attempt, the motorcade sped away and Princip and the remaining conspirators failed to act due to the motorcades high speed.     After the Archduke gave his scheduled speech at Town Hall, he decided to visit the victims of Čabrinovićs grenade attack at the Sarajevo Hospital.  In order to avoid the city centre, ": null
    },
    {
        "General Oskar Potiorek": "Oskar Potiorek"
    },
    {
        " decided that the royal car should travel straight along the Appel Quay to the hospital. However, Potiorek forgot to inform the driver, ": null
    },
    {
        "Leopold Lojka": "Leopold Lojka"
    },
    {
        ", about this decision. On the way to the hospital, Lojka incorrectly turned onto a side street where Princip had positioned himself in front of a local delicatessen. After realizing his mistake, Lojka braked and began to reverse. As he did so the engine stalled and the gears locked. Princip stepped forward, drew his ": null
    },
    {
        "FN Model 1910": "Fn Model 1910"
    },
    {
        ", Manfried Rauchensteiner, Manfred Litscher : Das Heeresgeschichtliche Museum in Wien. Graz, Wien 2000, page 63.  and at ": null
    },
    {
        "point-blank range": "Point-Blank Range"
    },
    {
        " fired twice into the car, first hitting the Archduke in the neck, and then hitting the Duchess in the ": null
    },
    {
        "abdomen": "Abdomen"
    },
    {
        ".   They both died shortly after.          Princip attempted to shoot himself, but the pistol was wrestled from his hand before he had a chance to fire another shot.  At his trial, he said he regretted the killing of the Duchess but that he was proud of what he had done  and stated that: I am a Yugoslav nationalist, aiming for the unification of all Yugoslavs, and I do not care what form of state, but it must be freed from Austria.  The ": null
    },
    {
        "Black Hand": "Black Hand"
    },
    {
        " was implicated in the assassination which led Austria-Hungary to issue a ": null
    },
    {
        "démarche": "Démarche"
    },
    {
        " to Serbia known as the ": null
    },
    {
        "July Ultimatum": "July Ultimatum"
    },
    {
        " which led to the eventual outbreak of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ".     Princip was nineteen years old at the time and too young to receive the death penalty, as he was twenty-seven days short of the twenty-year minimum age limit required by ": null
    },
    {
        "Habsburg Law": "Habsburg Law"
    },
    {
        ".  Instead, he received the maximum sentence of twenty years in prison.           Princip was held in solitary confinement, chained to the wall, at the ": null
    },
    {
        "Terezín": "Terezín"
    },
    {
        " fortress.  He lived in harsh conditions which were worsened by the war, and contracted ": null
    },
    {
        "tuberculosis": "Tuberculosis"
    },
    {
        ". His body had become wracked by ": null
    },
    {
        "skeletal tuberculosis": "Pott Disease"
    },
    {
        " that ate away his bones so badly that his right arm had to be amputated. In January 1916, Princip unsuccessfully attempted to hang himself with a towel.  From February to June 1916, Princip met with Martin Pappenheim, a psychiatrist in the Austro-Hungarian army, four times. Pappenheim wrote that Princip believed the World War would not have failed to come, independent of his actions, but that he cannot believe the World War was a consequence of the assassination and cannot feel himself responsible for the catastrophe.     Gavrilo Princip died on 28 April 1918, three years and ten months after the assassination. At the time of his death, weakened by malnutrition and disease, he weighed around .          Fearing his bones might become relics for Slavic nationalists, Princips prison guards secretly took the body to an unmarked grave, but a Czech soldier assigned to the burial remembered the location, and in 1920 Princip and the other Heroes of Vidovdan were exhumed and brought to Sarajevo, where they were buried together beneath a chapel built to commemorate for eternity our Serb heroes at the Saint Archangels Cemetery  which includes a citation from the Montenegrin poet ": null
    },
    {
        "Njegoš": "Petar Ii Petrović-Njegoš"
    },
    {
        ": Blessed is he who lives forever. He had something to be born for.           Princips legacy is still disputed. He is celebrated as a hero by Serbs but regarded as a terrorist by many ": null
    },
    {
        "Bosniaks": "Bosniaks"
    },
    {
        ".      In socialist Yugoslavia, Gavrilo Princip was venerated as a national hero and a freedom fighter who fought to liberate all the peoples of Yugoslavia from Austrian rule;  however in the modern day, many ": null
    },
    {
        "Croats": "Croats"
    },
    {
        " and Bosniaks have now expressed viewpoints characterizing Princip as a murderer. ": null
    },
    {
        "Asim Sarajlic": "Asim Sarajlić"
    },
    {
        ", a senior MP of the Bosniak nationalist ": null
    },
    {
        "Party of Democratic Action": "Party Of Democratic Action"
    },
    {
        ", stated that Princip brought an end to a golden era of history under Austrian rule and that we are strongly against the mythology of Princip as a fighter of freedom.     However, Serbs continue to venerate his memory, with Nenad Samardžija, governor of ": null
    },
    {
        "East Sarajevo": "East Sarajevo"
    },
    {
        ", saying that the assassination was not a terrorist act but a movement of young people who wanted to liberate themselves from colonial slavery.           The house where Princip lived in Sarajevo was destroyed during World War I. After the war, it was rebuilt as a museum in the ": null
    },
    {
        "Kingdom of Yugoslavia": "Kingdom Of Yugoslavia"
    },
    {
        ". Yugoslavia was conquered by Germany in 1941 and Sarajevo became part of the Independent State of Croatia. The ": null
    },
    {
        "Croatian Ustaše": "Ustaše"
    },
    {
        " destroyed the house again. After the establishment of ": null
    },
    {
        "Communist Yugoslavia": "Socialist Federal Republic Of Yugoslavia"
    },
    {
        " in 1944, the house of Gavrilo Princip became a museum again and there was another museum dedicated to him within the city of Sarajevo. During the ": null
    },
    {
        "Yugoslav Wars": "Yugoslav Wars"
    },
    {
        " of the 1990s, the house of Gavrilo Princip was destroyed and then rebuilt for the third time in 2015.       Princips pistol was confiscated by the authorities and eventually given, along with the Archdukes bloody undershirt, to ": null
    },
    {
        "Anton Puntigam": ":De:Anton Puntigam"
    },
    {
        ", a Jesuit priest who was a close friend of the Archduke and had given the Archduke and his wife their last rites. The pistol and shirt remained in the possession of the Austrian Jesuits until they were offered on long-term loan to the ": null
    },
    {
        "Museum of Military History": "Museum Of Military History, Vienna"
    },
    {
        " in Vienna in 2004. It is now part of the permanent exhibition there.      There have been many short-lived memorials to Gavrilo Princip.  In 1917, a pillar was constructed at the corner of where the assassination took place. It was destroyed the following year. In the 1940s, a plaque commemorating Princip was removed when the German Army invaded, and after ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", a new plaque went up which incorrectly claimed that Gavrilo Princip threw off the German occupiers. During the ": null
    },
    {
        "Bosnian War": "Bosnian War"
    },
    {
        ", embossed footprints marking where Princip fired the fatal shots were torn out.     As the centenary of the assassination neared, a plaque at the corner where the assassination took place was put up, which states: From this place on 28 June 1914, Gavrilo Princip assassinated the heir to the Austro-Hungarian throne Franz Ferdinand and his wife Sofia.  On 21 April 2014, a bust of Princip was unveiled in ": null
    },
    {
        "Tovariševo": "Tovariševo"
    },
    {
        ",  and on the centenary itself, a statue was erected in ": null
    },
    {
        "East Sarajevo": "East Sarajevo"
    },
    {
        ". , B92, June 27, 2014 . , BBC News, June 8, 2015 . A year later, a statue of Princip was unveiled in Belgrade by the President of Serbia ": null
    },
    {
        "Tomislav Nikolić": "Tomislav Nikolić"
    },
    {
        " and the President of ": null
    },
    {
        "Republika Srpska": "Republika Srpska"
    },
    {
        " Milorad Dodik": "Milorad Dodik"
    },
    {
        ", as a gift from Republika Srpska to Serbia. ": null
    }
]