[
    {
        "     Jelly is a ": null
    },
    {
        "dessert": "Dessert"
    },
    {
        " made with a sweetened and flavored processed collagen product . This kind of dessert is first recorded by ": null
    },
    {
        "Hannah Glasse": "Hannah Glasse"
    },
    {
        " in her 18th century book  The Art of Cookery , appearing in a layer of ": null
    },
    {
        "trifle": "Trifle"
    },
    {
        ". Jelly is also featured in the best selling cookbooks of English food writers ": null
    },
    {
        "Eliza Acton": "Eliza Acton"
    },
    {
        " and ": null
    },
    {
        "Isabella Beeton": "Isabella Beeton"
    },
    {
        " in the 19th century.     They can be made by combining plain ": null
    },
    {
        "gelatin": "Gelatin"
    },
    {
        " with other ingredients or by using a premixed blend of gelatin with additives. Fully prepared jelly is sold in a variety of forms, ranging from large decorative shapes to individual serving cups.     Popular brands of premixed gelatin include: ": null
    },
    {
        "Aeroplane Jelly": "Aeroplane Jelly"
    },
    {
        " in Australia, ": null
    },
    {
        "Hartleys": "Hartleys"
    },
    {
        "  in the United Kingdom, and ": null
    },
    {
        "Jell-O": "Jell-O"
    },
    {
        " from ": null
    },
    {
        "Kraft Foods": "Kraft Foods"
    },
    {
        " and Royal from ": null
    },
    {
        "Jel Sert": "Jel Sert"
    },
    {
        " in North America.            Before gelatin became widely available as a commercial product, the most typical jelly was calfs foot jelly . As the name indicates, this was made by extracting and purifying gelatin from the foot of a ": null
    },
    {
        "calf": "Calf"
    },
    {
        ". This gelatin was used for savory dishes in ": null
    },
    {
        "aspic": "Aspic"
    },
    {
        ", or was mixed with ": null
    },
    {
        "fruit juice": "Fruit Juice"
    },
    {
        " and sugar for a dessert.       In the eighteenth century, gelatin from calfs feet, ": null
    },
    {
        "isinglass": "Isinglass"
    },
    {
        " and ": null
    },
    {
        "hartshorn": "Hartshorn"
    },
    {
        " was colored blue with violet juice, yellow with ": null
    },
    {
        "saffron": "Saffron"
    },
    {
        ", red with ": null
    },
    {
        "cochineal": "Cochineal"
    },
    {
        " and green with spinach and allowed to set in layers in small, narrow glasses. It was flavored with sugar, lemon juice and mixed spices. This preparation was called jelly; English cookery writer ": null
    },
    {
        "Hannah Glasse": "Hannah Glasse"
    },
    {
        " was the first to record the use of this jelly in ": null
    },
    {
        "trifle": "Trifle"
    },
    {
        " in her book  The Art of Cookery , first published in 1747.  Preparations on making jelly appear in the best selling cookbooks of English writers ": null
    },
    {
        "Eliza Acton": "Eliza Acton"
    },
    {
        " and ": null
    },
    {
        "Isabella Beeton": "Isabella Beeton"
    },
    {
        " in the 19th century.         To make a jelly, gelatin is dissolved in hot liquid with the desired flavors and other additives. These latter ingredients usually include ": null
    },
    {
        "sugar": "Sugar"
    },
    {
        ", fruit juice, or ": null
    },
    {
        "sugar substitute": "Sugar Substitute"
    },
    {
        "s; they may be added and varied during preparation, or pre-mixed with the gelatin in a commercial product which merely requires the addition of hot water.     In addition to sweeteners, the prepared commercial blends generally contain ": null
    },
    {
        "flavoring agents": "Flavorflavorants Or Flavorings"
    },
    {
        " and other additives, such as ": null
    },
    {
        "adipic acid": "Adipic Acid"
    },
    {
        ", ": null
    },
    {
        "fumaric acid": "Fumaric Acid"
    },
    {
        ", ": null
    },
    {
        "sodium citrate": "Trisodium Citrate"
    },
    {
        ", and artificial flavorings and ": null
    },
    {
        "food color": "Food Color"
    },
    {
        "s. Because the ": null
    },
    {
        "collagen": "Collagen"
    },
    {
        " is processed extensively, the final product is not categorized as a meat or ": null
    },
    {
        "animal product": "Animal Product"
    },
    {
        " by the US federal government.      Prepared commercial blends may be sold as a powder or as a concentrated gelatinous block, divided into small squares. Either type is mixed with sufficient hot water to completely dissolve it, and then mixed with enough cold water to make the volume of liquid specified on the packet.     The solubility of powdered gelatin can be enhanced by sprinkling it into the liquid several minutes before heating, blooming the individual granules.  The fully dissolved mixture is then ": null
    },
    {
        "refrigerate": "Refrigerate"
    },
    {
        "d, slowly forming a ": null
    },
    {
        "colloid": "Colloid"
    },
    {
        "al ": null
    },
    {
        "gel": "Gel"
    },
    {
        " as it cools.     Jelly may be enhanced in many ways, such as using ": null
    },
    {
        "decorative molds": "Mold"
    },
    {
        ", creating multicolored layers by adding a new layer of slightly cooled liquid over the previously-solidified one, or suspending non-soluble edible elements such as ": null
    },
    {
        "marshmallows": "Marshmallow"
    },
    {
        "or ": null
    },
    {
        "fruit": "Fruit"
    },
    {
        ". Some types of fresh fruit and their unprocessed juices are incompatible with jelly; see the ": null
    },
    {
        "Chemistry": "Chemistry"
    },
    {
        " section below.     When fully chilled, the most common ratios of gelatin to liquid usually result in a ": null
    },
    {
        "custard": "Custard"
    },
    {
        "-like texture which can retain detailed shapes when cold but melts back to a viscous liquid when warm. A recipe calling for the addition of additional gelatin to regular jelly gives a rubbery product that can be cut into shapes with cookie cutters and eaten with fingers . Higher gelatin ratios can be used to increase the stability of the gel, culminating in ": null
    },
    {
        "gummy candies": "Gummy Candy"
    },
    {
        " which remain rubbery solids at room temperature .     The Bloom Strength of a gelatin mixture is the measure of how strong it is. It is defined by the force in grams required to press a 12.5  mm diameter plunger 4  mm into 112 g of a standard 6.67% w/v gelatin gel at 10  °C. The Bloom Strength of a gel is useful to know when determining the possibility of substituting a gelatin of one Bloom Strength for a gelatin of another. One can use the following equation:     C x B ½ k     or C 1 ½ ÷ ½ C 2     Where C concentration, B Bloom strength and k constant. For example, when making gummies, its important to know that a 250 Bloom gelatin has a much shorter texture than a 180 Bloom gelatin.              A jelly shot  is a ": null
    },
    {
        "shooter": "Shooter"
    },
    {
        " in which ": null
    },
    {
        "liquor": "Distilled Beverage"
    },
    {
        ", usually ": null
    },
    {
        "vodka": "Vodka"
    },
    {
        ", ": null
    },
    {
        "rum": "Rum"
    },
    {
        ", ": null
    },
    {
        "tequila": "Tequila"
    },
    {
        ", or ": null
    },
    {
        "neutral grain spirit": "Neutral Grain Spirit"
    },
    {
        ", replaces some of the water or fruit juice that is used to congeal the gel.     The American satirist and mathematician ": null
    },
    {
        "Tom Lehrer": "Tom Lehrer"
    },
    {
        " claims to have invented the jelly shot in the 1950s while working for the ": null
    },
    {
        "National Security Agency": "National Security Agency"
    },
    {
        ", where he developed ": null
    },
    {
        "vodka": "Vodka"
    },
    {
        " jelly as a way to circumvent a restriction of alcoholic beverages on base.  An early published recipe for an alcoholic jelly drink dates from 1862, found in How to Mix Drinks, or The Bon Vivants Companion by ": null
    },
    {
        "Jerry Thomas": "Jerry Thomas"
    },
    {
        ": his recipe for Punch Jelly calls for the addition of ": null
    },
    {
        "isinglass": "Isinglass"
    },
    {
        " or other ": null
    },
    {
        "gelatin": "Gelatin"
    },
    {
        " to a punch made from cognac, rum, and lemon juice.  The Joy of Mixology by Gary Regan. Clarkson Potter, 2003. Pages 15-16, 150.            Gelatin art desserts, also known as 3D gelatin desserts, are made by injecting colorful shapes into a flavored gelatin base. This 3D gelation art technique originated from Mexico and has spread along to Western and Pacific countries.     These desserts are made using high quality gelatin that has a high bloom value and low odor and taste. The clear gelatin base is prepared using gelatin, water, sugar, citric acid and food flavoring.     When the clear gelatin base sets, colorful shapes are injected using a syringe.     The injected material usually consists of a sweetener , some type of edible liquid , food coloring and a thickening agent such as starch or additional gelatin.     The shapes are drawn by making incisions in the clear gelatin base using sharp objects. Colored liquid is then allowed to fill the crevice and make the cut shape visible.     Most commonly, the shapes are drawn using sterile medical needles or specialized pre-cut gelatin art tools that allow the shape to be cut and filled with color at the same time.     Gelatin art tools are attached to a syringe and used to inject a predetermined shape into gelatin.     When combined with other ingredients, such as whipping cream or mousse, gelatin art desserts can be assembled into visually impressive formations resembling a cake.          Other culinary gelling agents can be used instead of animal-derived gelatin. These plant-derived substances are more similar to ": null
    },
    {
        "pectin": "Pectin"
    },
    {
        " and other gelling plant ": null
    },
    {
        "carbohydrates": "Carbohydrate"
    },
    {
        "than to gelatin proteins; their physical properties are slightly different, creating different constraints for the preparation and storage conditions. These other gelling agents may also be preferred for certain traditional cuisines or dietary restrictions.     ": null
    },
    {
        "Agar": "Agar"
    },
    {
        ", a product made from ": null
    },
    {
        "red algae": "Red Algae"
    },
    {
        ",  . is the traditional gelling agent in many Asian desserts. Agar is a popular gelatin substitute in quick jelly powder mix and prepared dessert gels that can be stored at room temperature. Compared to gelatin, agar preparations require a higher dissolving temperature, but the resulting gels congeal more quickly and remain solid at higher temperatures, ,  as opposed to   for gelatin. ": null
    },
    {
        "Vegans": "Veganism"
    },
    {
        " and ": null
    },
    {
        "vegetarians": "Vegetarians"
    },
    {
        " can use agar to replace animal-derived gelatin.     ": null
    },
    {
        "Carrageenan": "Carrageenan"
    },
    {
        " is also derived from seaweed, and lacks agars occasionally unpleasant smell during cooking. It sets more firmly than agar and is often used in ": null
    },
    {
        "kosher": "Kosher"
    },
    {
        " and ": null
    },
    {
        "halal": "Halal"
    },
    {
        " cooking.     ": null
    },
    {
        "Konjac": "Konjac"
    },
    {
        " is a gelling agent used in many Asian foods, including the popular ": null
    },
    {
        "konnyaku fruit jelly candies": "Konjacfruit Jelly"
    },
    {
        ".          Gelatin consists of partially ": null
    },
    {
        "hydrolyzed collagen": "Hydrolyzed Collagen"
    },
    {
        ", a ": null
    },
    {
        "protein": "Protein"
    },
    {
        " which is highly abundant in animal tissues such as bone and skin. Collagen is a protein made up of three strands of polypeptide chains that form in a helical structure. To make a gelatin dessert, such as ": null
    },
    {
        "Jello": "Jell-O"
    },
    {
        ", the collagen is mixed with water and heated, disrupting the bonds that hold the three strands of polypeptides together. As the gelatin cools, these bonds try to reform in the same structure as before, but now with small bubbles of liquid in between. This gives gelatin its semisolid, gel-like texture.      Because gelatin is a protein that contains both acid and base amino groups, it acts as an amphoteric molecule, displaying both acidic and basic properties. This allows it to react with different compounds, such as sugars and other food additives. These interactions give gelatin a versatile nature in the roles that it plays in different foods. It can stabilize foams in foods such as ": null
    },
    {
        "marshmallow": "Marshmallow"
    },
    {
        "s, it can help maintain small ice crystals in ": null
    },
    {
        "ice cream": "Ice Cream"
    },
    {
        ", and it can even serve as an emulsifier for foods like ": null
    },
    {
        "toffee": "Toffee"
    },
    {
        " and ": null
    },
    {
        "margarine": "Margarine"
    },
    {
        ".      Although many gelatin desserts incorporate fruit, some fresh fruits contain proteolytic ": null
    },
    {
        "enzyme": "Enzyme"
    },
    {
        "s; these enzymes cut the gelatin molecule into ": null
    },
    {
        "peptides": "Peptide"
    },
    {
        " too small to form a firm gel. The use of such fresh fruits in a gelatin recipe results in a dessert that never sets .     Specifically, ": null
    },
    {
        "pineapple": "Pineapple"
    },
    {
        " contains the ": null
    },
    {
        "protease": "Protease"
    },
    {
        " bromelain": "Bromelain"
    },
    {
        ", ": null
    },
    {
        "kiwi fruit": "Kiwi Fruit"
    },
    {
        " contains ": null
    },
    {
        "actinidin": "Actinidin"
    },
    {
        ", ": null
    },
    {
        "figs": "Ficus"
    },
    {
        "contain ": null
    },
    {
        "ficain": "Ficain"
    },
    {
        ", and ": null
    },
    {
        "papaya": "Papaya"
    },
    {
        " contains ": null
    },
    {
        "papain": "Papain"
    },
    {
        ". Cooking or ": null
    },
    {
        "canning": "Canning"
    },
    {
        " denatures": "Denaturation Protein Denaturation"
    },
    {
        " and deactivates the proteases, so canned pineapple, for example, works fine in a gelatin dessert.         Jelly in China is defined as edible jelly-like food prepared from a mixture of water, sugar and gelling agent.  The preparation processes include concocting, gelling, sterilizing and packaging. In China, around 250 legal additives are allowed in gelatin desserts as gelling agents, colors, ": null
    },
    {
        "artificial sweeteners": "Sugar Substitute"
    },
    {
        ", ": null
    },
    {
        "emulsifiers": "Emulsion"
    },
    {
        " and ": null
    },
    {
        "antioxidant": "Antioxidant"
    },
    {
        "s.      Jellies are classified into 5 categories according to the different flavoring substances they contain. Five types of flavoring substance include artificial fruit flavored type , natural fruit flavored type , natural flavored with fruit pulp type and dairy type products, which includes dairy ingredients. The last type summarizes gelatin desserts not mentioned above. It is typically sold in single-serving plastic cups or plastic food bags.       Although eating tainted beef can lead to New Variant ": null
    },
    {
        "Creutzfeldt–Jakob disease": "Creutzfeldt–Jakob Disease"
    },
    {
        " , there is no known case of BSE having been transmitted through collagen products such as gelatin.        ": null
    }
]