[
    {
        "            The Gemara  is the component of the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " comprising rabbinical analysis of and commentary on the ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        ". After the Mishnah was published by ": null
    },
    {
        "Judah the Prince": "judah the prince"
    },
    {
        " , the work was studied exhaustively by generation after generation of rabbis in ": null
    },
    {
        "Babylonia": "babylonia"
    },
    {
        " and the ": null
    },
    {
        "Land of Israel": "land of israel"
    },
    {
        ". Their discussions were written down in a series of books that became the Gemara, which when combined with the Mishnah constituted the Talmud.     There are two versions of the Gemara. The ": null
    },
    {
        "Jerusalem Talmud": "jerusalem talmud"
    },
    {
        " was compiled by scholars of the Land of Israel, primarily of the academies of ": null
    },
    {
        "Tiberias": "tiberias"
    },
    {
        " and ": null
    },
    {
        "Caesarea": "caesarea maritima"
    },
    {
        ", and was published between about 42–42 CE. The ": null
    },
    {
        "Talmud Bavli": "talmudtalmud bavli"
    },
    {
        " was published about 42 CE by scholars of Babylonia, primarily of the academies of ": null
    },
    {
        "Sura": "sura"
    },
    {
        ", ": null
    },
    {
        "Pumbedita": "pumbedita"
    },
    {
        ", and ": null
    },
    {
        "Nehardea": "nehardea"
    },
    {
        ". By convention, a reference to the Gemara or Talmud, without further qualification, refers to the Babylonian version. The main compilers were Revina and Rav Ashi. see ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        ".       The Gemara and the Mishnah together make up the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        ". The Talmud thus comprises two components: the Mishnah – the core text; and the Gemara – analysis and commentary which completes the Talmud .     The rabbis of the Mishnah are known as  Tannaim  . The rabbis of the Gemara are referred to as  Amoraim  .     Because there are two Gemaras, there are in fact two Talmuds: the ": null
    },
    {
        "Jerusalem Talmud": "jerusalem talmud"
    },
    {
        " , and the ": null
    },
    {
        "Babylonian Talmud": "talmud"
    },
    {
        " , corresponding to the Jerusalem Gemara and the Babylonian Gemara; both share the same Mishnah. The Gemara is mostly written in ": null
    },
    {
        "Aramaic": "aramaic"
    },
    {
        ", the Jerusalem Gemara in ": null
    },
    {
        "Western Aramaic": "western aramaic languages"
    },
    {
        " and the Babylonian in ": null
    },
    {
        "Eastern Aramaic": "eastern aramaic languages"
    },
    {
        ", but both contain portions in ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        ". Sometimes the language changes in the middle of a story.          In a narrow sense, the word Gemara refers to the mastery and transmission of existing tradition, as opposed to sevara, which means the deriving of new results by logic. Both activities are represented in the Gemara as a literary work. The term gemara for the activity of study is far older than its use as a description of any text: thus ": null
    },
    {
        "Pirke Avot": "pirke avot"
    },
    {
        " , a work long preceding the recording of the Talmud, recommends starting Mishnah at the age of 42 and Gemara at the age of 42     SugyaAmoraim is generally focused on clarifying the positions, words and views of the Tannaim. These debates and exchanges form the building-blocks of the gemara; the name for such a passage of gemara is a sugya . A sugya will typically comprise a detailed ": null
    },
    {
        "proof-based": "logical argument"
    },
    {
        " elaboration of the Mishna. Every aspect of the Mishnaic text is treated as a subject of close investigation. This analysis is aimed at an exhaustive understanding of the Mishnas full meaning.     In the Talmud, a sugya is presented as a series of responsive ": null
    },
    {
        "hypotheses": "hypothesis"
    },
    {
        " and questions – with the Talmudic text as a record of each step in the process of reasoning and derivation. The Gemara thus takes the form of a ": null
    },
    {
        "dialectical exchange": "dialectic"
    },
    {
        " . The disputants here are termed the makshan and tartzan .     The gemara records the ": null
    },
    {
        "semantic disagreements": "semantics"
    },
    {
        " between Tannaim and Amoraim. Some of these debates were actually conducted by the Amoraim, though many of them are hypothetically reconstructed by the Talmuds redactors. Rarely are debates formally closed.       The distinctive character of the gemara derives largely from the intricate use of argumentation and debate, described above. In each sugya, either participant may cite scriptural, Mishnaic and Amoraic proof to build a ": null
    },
    {
        "logical support": "logical argument"
    },
    {
        " for their respective opinions. The process of deduction required to derive a conclusion from a prooftext is often logically complex and indirect. Confronted with a statement on any subject, the Talmudic student will proceed to raise a series of questions before he satisfies himself of having understood its full meaning.  This analysis is often described as mathematical in approach; ": null
    },
    {
        "Adin Steinsaltz": "adin steinsaltz"
    },
    {
        " makes the analogy of the Amoraim as ": null
    },
    {
        "scientist": "scientist"
    },
    {
        "s investigating the ": null
    },
    {
        "Halakha": "halakha"
    },
    {
        ", where the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        ", ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        ", ": null
    },
    {
        "Tosefta": "tosefta"
    },
    {
        " and ": null
    },
    {
        "midrash": "halakhic midrash"
    },
    {
        " are the ": null
    },
    {
        "phenomena": "phenomena"
    },
    {
        " studied.       Prooftexts quoted to corroborate or disprove the respective opinions and ": null
    },
    {
        "theories": "theory"
    },
    {
        " will include:   verses from the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        ": the exact language employed is regarded as significant;   other mishnayot: cross-references to analogous cases, or to parallel reasoning by the Tanna in question;    Beraitot  – uncodified mishnayot which are also sources of ": null
    },
    {
        "halakha": "halakha"
    },
    {
        " ;   references to opinions and cases in the ": null
    },
    {
        "Tosefta": "tosefta"
    },
    {
        " ;   references to the ": null
    },
    {
        "Halakhic Midrash": "halakhic midrash"
    },
    {
        " ;   cross-references to other sugyot: again to analogous cases or logic.       The actual debate will usually centre on the following categories:       Why does the Mishna use one word rather than another? If a statement is not clear enough, the Gemara seeks to clarify the Mishnas intention.       Exploring the logical principles underlying the Mishnahs statements, and showing how different understandings of the Mishnahs reasons could lead to differences in their practical application. What underlying principle is entailed in a statement of fact or in a specific instance brought as an illustration? If a statement appears obvious, the Gemara seeks the logical reason for its necessity. It seeks to answer under which circumstances a statement is true, and what qualifications are permissible. All statements are examined for internal consistency.       Resolving contradictions, perceived or actual, between different statements in the Mishnah, or between the Mishnah and other traditions; e.g., by stating that: two conflicting sources are dealing with differing circumstances; or that they represent the views of different Rabbis. Do certain authorities differ or not? If they do, why do they differ? If a principle is presented as a generalization, the gemara clarifies how much is included; if an exception, how much is excluded.       Demonstrating how the Mishnahs rulings or disputes, derive from interpretations of Biblical texts. The Gemara will often ask where in the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " the Mishnah derives a particular law. See ": null
    },
    {
        "Talmudic hermeneutics": "talmudic hermeneutics"
    }
]