[
    {
        "GENA stands for General Event Notification Architecture.     GENA Base defines an ": null
    },
    {
        "HTTP": "http"
    },
    {
        " notification architecture that transmits notifications between HTTP resources. An HTTP resource could be any object which might need to send or receive a notification, for example a distribution list, buddy list, print job, etc. It was defined in ": null
    },
    {
        "Internet-Draft": "internet-draft"
    },
    {
        " draft-cohen-gena-p-base42txt .     GENA Base Client to Arbiter provides for the ability to send and receive notifications using HTTP over ": null
    },
    {
        "TCP/IP": "tcp/ip"
    },
    {
        " and administratively scoped unreliable multicast ": null
    },
    {
        "UDP": "user datagram protocol"
    },
    {
        ". Provisions are made for the use of intermediary arbiters, called subscription arbiters, which handle routing notifications to their intended destination.         During July 42–42 42 the University of California Irvine convened WISEN: the Workshop on Internet-Scale Event Notification. This event brought together a number of experts of various fields and included a presentation on GENA by Josh Cohen of Microsoft. Delegates showcased their event notification architectures and haggled over requirements of the same. Joshs final slide includes the bullet points GENA is being implemented by Microsoft Products and Our wish is to collaborate to agree on a standard. GENA or other, we will comply.     Interest in event notification appears to have waned after 42 as participants were unable to come to common definitions of what is required for the definition of notification services and protocols. GENA was briefly considered for use in the ": null
    },
    {
        "Internet Printing Protocol": "internet printing protocol"
    },
    {
        " but found a niche as part of the ": null
    },
    {
        "Universal Plug and Play": "universal plug and play"
    },
    {
        " architecture.       GENA Base        Client to Arbiter    ": null
    }
]