[
    {
        "The General Synod is the title of the governing body of some church organizations.              In the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ", the General Synod, which was established in 1970 , is the legislative body of the Church.       In the ": null
    },
    {
        "Episcopal Church in the United States of America": "Episcopal Church In The United States Of America"
    },
    {
        ", the equivalent is ": null
    },
    {
        "General Convention": "General Convention Of The Episcopal Church In The United States Of America"
    },
    {
        ".       General Synods of other churches within the Anglican Communion  ": null
    },
    {
        "Anglican Church of Australia": "Anglican Church Of Australia"
    },
    {
        " Anglican Church of Canada": "General Synod Of The Anglican Church Of Canada"
    },
    {
        " Church of Ireland": "Church Of Ireland"
    },
    {
        " Anglican Church in Aotearoa, New Zealand and Polynesia": "Anglican Church In Aotearoa, New Zealand And Polynesia"
    },
    {
        " Scottish Episcopal Church": "Scottish Episcopal Church"
    },
    {
        " Hong Kong Sheng Kung Hui": "General Synod Of Hong Kong Sheng Kung Hui"
    },
    {
        "       The ": null
    },
    {
        "United Church of Christ": "United Church Of Christ"
    },
    {
        " based in the United States also calls their main governing body a General Synod. It meets every two years and consists of over 600 delegates from various congregations and conferences.     The ": null
    },
    {
        "National Baptist Churches of the USA": "National Baptist Churches Of The Usa"
    },
    {
        " calls their main governing body a General Synod. It meets annually setting the theological and missional direction for the denomi-network.     The ": null
    },
    {
        "Associate Reformed Presbyterian Church": "Associate Reformed Presbyterian Church"
    },
    {
        " has as its highest Church court the General Synod. The ARP General Synod meets yearly . The delegates to the General Synod of the ": null
    },
    {
        "ARP Church": "Arp Church"
    },
    {
        " are the elder representatives elected from each churchs Session and all ministers from all presbyteries that comprise the Church .     The ": null
    },
    {
        "Evangelical Church of Augsburg and Helvetic Confession in Austria": "Evangelical Church Of Augsburg And Helvetic Confession In Austria"
    },
    {
        " and the ": null
    },
    {
        "United Evangelical Lutheran Church of Germany": "United Evangelical Lutheran Church Of Germany"
    },
    {
        " each call their main legislative bodies Generalsynode. In the ": null
    },
    {
        "Evangelical Church in Prussia": "Evangelical Church In Prussia"
    },
    {
        " the legislating body was called Generalsynode between 1846 and 1953.     The governing body of the ": null
    },
    {
        "Reformed Church in America": "Reformed Church In America"
    },
    {
        ", a ": null
    },
    {
        "Calvinist": "Calvinism"
    },
    {
        " denomination in the United States and Canada, is known as the General Synod.     Kirkemøtet , the governing body of the ": null
    },
    {
        "Church of Norway": "Church Of Norway"
    },
    {
        " is normally translated to General Synod. It convenes once a year, and consists of 85 representatives, of whom seven or eight are sent from each of the dioceses.     The ": null
    },
    {
        "Batak Christian Protestant Church": "Batak Christian Protestant Church"
    },
    {
        " , or Huria Kristen Batak Protestan , held a twice-a-year General Synod , to discuss about matters in HKBP, and to elect the new Ephorus for the HKBP. The first General Synod of HKBP was held in 1922.       In the North American ": null
    },
    {
        "Lutheran": "Lutheran"
    },
    {
        " tradition, General Synod refers to a church body which existed from 1820–1918. See ": null
    },
    {
        "Evangelical Lutheran General Synod of the United States of North America": "Evangelical Lutheran General Synod Of The United States Of North America"
    }
]