[
    {
        "          General surgery is a ": null
    },
    {
        "surgical": "surgery"
    },
    {
        " specialty that focuses on ": null
    },
    {
        "abdominal": "abdomen"
    },
    {
        " contents including ": null
    },
    {
        "esophagus": "esophagus"
    },
    {
        ", ": null
    },
    {
        "stomach": "stomach"
    },
    {
        ", ": null
    },
    {
        "small intestine": "small intestine"
    },
    {
        ", ": null
    },
    {
        "large intestine": "large intestine"
    },
    {
        ", ": null
    },
    {
        "liver": "liver"
    },
    {
        ", ": null
    },
    {
        "pancreas": "pancreas"
    },
    {
        ", ": null
    },
    {
        "gallbladder": "gallbladder"
    },
    {
        ", ": null
    },
    {
        "appendix": "appendix"
    },
    {
        " and ": null
    },
    {
        "bile duct": "bile duct"
    },
    {
        "s, and often the ": null
    },
    {
        "thyroid": "thyroid"
    },
    {
        " gland . They also deal with diseases involving the ": null
    },
    {
        "skin": "human skin"
    },
    {
        ", ": null
    },
    {
        "breast": "breast"
    },
    {
        ", ": null
    },
    {
        "soft tissue": "soft tissue"
    },
    {
        ", ": null
    },
    {
        "trauma": "trauma"
    },
    {
        ", ": null
    },
    {
        "peripheral": "peripheral"
    },
    {
        " vascular surgery": "vascular surgery"
    },
    {
        " and ": null
    },
    {
        "hernia": "hernia"
    },
    {
        "s and perform endoscopic procedures such as ": null
    },
    {
        "gastroscopy": "gastroscopy"
    },
    {
        " and ": null
    },
    {
        "colonoscopy": "colonoscopy"
    },
    {
        ".         General surgeons may sub-specialize into one or more of the following disciplines:          In many parts of the world including ": null
    },
    {
        "North America": "north america"
    },
    {
        ", ": null
    },
    {
        "Australia": "australia"
    },
    {
        " and the ": null
    },
    {
        "United Kingdom": "uk"
    },
    {
        ", the overall responsibility for ": null
    },
    {
        "trauma care": "major trauma"
    },
    {
        " falls under the auspices of general surgery. Some general surgeons obtain advanced training in this field and specialty certification surgical critical care. General surgeons must be able to deal initially with almost any surgical emergency. Often, they are the first port of call to critically ill or gravely injured patients, and must perform a variety of procedures to stabilize such patients, such as thoracostomy, ": null
    },
    {
        "cricothyroidotomy": "cricothyroidotomy"
    },
    {
        ", compartment fasciotomies and emergency ": null
    },
    {
        "laparotomy": "laparotomy"
    },
    {
        " or ": null
    },
    {
        "thoracotomy": "thoracotomy"
    },
    {
        " to ": null
    },
    {
        "stanch": "wikt:stanch"
    },
    {
        " bleeding. They are also called upon to staff surgical intensive care units or trauma intensive care units.      All general surgeons are trained in emergency surgery. Bleeding, infections, bowel obstructions and organ perforations are the main problems they deal with. ": null
    },
    {
        "Cholecystectomy": "cholecystectomy"
    },
    {
        ", the surgical removal of the gallbladder, is one of the most common surgical procedures done worldwide. This is most often done electively, but the gallbladder can become acutely inflamed and require an emergency operation. Infections and rupture of the ": null
    },
    {
        "appendix": "vermiform appendix"
    },
    {
        " and small bowel obstructions are other common emergencies.          This is a relatively new specialty dealing with ": null
    },
    {
        "minimal access techniques": "minimally invasive procedures"
    },
    {
        " using cameras and small instruments inserted through 42 to 42mm incisions. ": null
    },
    {
        "Robotic surgery": "robotic surgery"
    },
    {
        " is now evolving from this concept . Gallbladders, appendices, and colons can all be removed with this technique. Hernias are also able to be repaired laparoscopically. ": null
    },
    {
        "Bariatric surgery": "bariatric surgery"
    },
    {
        " can be performed laparoscopically and there a benefits of doing so to reduce wound complications in ": null
    },
    {
        "obese": "obese"
    },
    {
        " patients. General surgeons that are trained today are expected to be proficient in laparoscopic procedures.          General surgeons treat a wide variety of major and minor colon and rectal diseases including inflammatory bowel diseases , ": null
    },
    {
        "diverticulitis": "diverticulitis"
    },
    {
        ", colon and rectal cancer, gastrointestinal bleeding and hemorrhoids.          General surgeons perform a majority of all non-cosmetic breast surgery from lumpectomy to ": null
    },
    {
        "mastectomy": "mastectomy"
    },
    {
        ", especially pertaining to the evaluation, diagnosis and treatment of ": null
    },
    {
        "breast cancer": "breast cancer"
    },
    {
        ".          General surgeons can perform vascular surgery if they receive special training and certification in vascular surgery. Otherwise, these procedures are typically performed by vascular surgery specialists. However, general surgeons are capable of treating minor vascular disorders.          General surgeons are trained to remove all or part of the thyroid and ": null
    },
    {
        "parathyroid gland": "parathyroid gland"
    },
    {
        "s in the neck and the ": null
    },
    {
        "adrenal glands": "adrenal glands"
    },
    {
        " just above each ": null
    },
    {
        "kidney": "kidney"
    },
    {
        " in the abdomen. In many communities, they are the only surgeon trained to do this. In communities that have a number of subspecialists, other subspecialty surgeons may assume responsibility for these procedures.            Responsible for all aspects of pre-operative, operative, and post-operative care of abdominal organ transplant patients. Transplanted organs include liver, kidney, pancreas, and more rarely small bowel.            Surgical oncologist refers to a general surgical oncologist , but thoracic surgical oncologists, gynecologist and so forth can all be considered surgeons who specialize in treating cancer patients. The importance of training surgeons who sub-specialize in cancer surgery lies in evidence, supported by a number of clinical trials, that outcomes in surgical cancer care are positively associated to surgeon volume—i.e., the more cancer cases a surgeon treats, the more proficient he or she becomes, and his or her patients experience improved survival rates as a result. This is another controversial point, but it is generally accepted—even as common sense—that a surgeon who performs a given operation more often, will achieve superior results when compared with a surgeon who rarely performs the same procedure. This is particularly true of complex cancer resections such as ": null
    },
    {
        "pancreaticoduodenectomy": "pancreaticoduodenectomy"
    },
    {
        " for pancreatic cancer, and ": null
    },
    {
        "gastrectomy": "gastrectomy"
    },
    {
        " with extended lymphadenectomy for gastric cancer. Surgical oncology is generally a 42 year fellowship following completion of a general surgery residency .            Most cardiothoracic surgeons in the U.S. first complete a general surgery residency , followed by a cardiothoracic surgery fellowship .            Pediatric surgery is a subspecialty of general surgery. Pediatric surgeons do surgery on patients age lower than 42 Pediatric surgery is 42–42 years of residency and a 4242 year fellowship.       In the 42s ": null
    },
    {
        "minimally invasive surgery": "minimally invasive surgery"
    },
    {
        " became more prevalent. Considerable enthusiasm has been built around ": null
    },
    {
        "robot-assisted surgery": "robot-assisted surgery"
    },
    {
        " , despite a lack of data suggesting it has significant benefits that justify its cost.        In Canada, Australia, New Zealand, and the United States general surgery is a five to seven year ": null
    },
    {
        "residency": "resident"
    },
    {
        " and follows completion of ": null
    },
    {
        "medical school": "medical school"
    },
    {
        ", either ": null
    },
    {
        "MD, MBBS, MBChB": "doctor of medicine"
    },
    {
        ", or ": null
    },
    {
        "DO": "doctor of osteopathic medicine"
    },
    {
        " degrees. In Australia and New Zealand, a residency leads to eligibility for Fellowship of the ": null
    },
    {
        "Royal Australasian College of Surgeons": "royal australasian college of surgeons"
    },
    {
        ". In Canada, residency leads to eligibility for certification by and Fellowship of the ": null
    },
    {
        "Royal College of Physicians and Surgeons of Canada": "royal college of physicians and surgeons of canada"
    },
    {
        ", while in the United States, completion of a residency in general surgery leads to eligibility for board certification by the ": null
    },
    {
        "American Board of Surgery": "american board of surgery"
    },
    {
        " or the ": null
    },
    {
        "American Osteopathic Board of Surgery": "american osteopathic board of surgery"
    },
    {
        " which is also required upon completion of training for a general surgeon to have operating privileges at most hospitals in the United States.     In the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", surgical trainees enter training after five years of medical school and two years of the ": null
    },
    {
        "Foundation Programme": "foundation programme"
    },
    {
        ". During the two to three-year core training programme, doctors will sit the Membership of the ": null
    },
    {
        "Royal College of Surgeons": "royal college of surgeons"
    },
    {
        " examination. On award of the MRCS examination, surgeons may hold the title ": null
    },
    {
        "Mister": "mr."
    },
    {
        " or ": null
    },
    {
        "Miss": "miss"
    },
    {
        "/": null
    },
    {
        "Ms.": "ms."
    },
    {
        "/": null
    },
    {
        "Mrs": "mrs"
    },
    {
        " rather than doctor. This is a tradition dating back hundreds of years in the United Kingdom from when only physicians attended medical school and surgeons did not, but were rather associated with ": null
    },
    {
        "barber": "barber"
    },
    {
        "s in the ": null
    },
    {
        "Barber Surgeon’s": "barber_surgeon"
    },
    {
        " Guild. The tradition is also present in many ": null
    },
    {
        "Commonwealth": "commonwealth_of_nations"
    },
    {
        " countries including ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        " and some states of ": null
    },
    {
        "Australia": "australia"
    },
    {
        ". Trainees will then go onto Higher Surgical Training , lasting a further five to six years. During this time they may choose to subspecialise. Before the end of HST, the examination of Fellow of the Royal College of Surgeons must be taken in general surgery plus the subspeciality. Upon completion of training, the surgeon will become a consultant surgeon and will be eligible for entry on the ": null
    },
    {
        "GMC": "general_medical_council"
    },
    {
        " Specialist Register and may work both in the NHS and independent sector as a consultant general surgeon. The implementation of the European Working Time Directive limited UK surgical residents to a 42-hour working week. ": null
    }
]