[
    {
        "      In ": null
    },
    {
        "abstract algebra": "abstract algebra"
    },
    {
        ", a generating set of a group is a ": null
    },
    {
        "subset": "subset"
    },
    {
        " such that every element of the ": null
    },
    {
        "group": "group"
    },
    {
        " can be expressed as a combination of finitely many elements of the subset and their ": null
    },
    {
        "inverses": "inverse element"
    },
    {
        ".     In other words, if S is a subset of a group G, then , the subgroup generated by S, is the smallest ": null
    },
    {
        "subgroup": "subgroup"
    },
    {
        " of G containing every element of S, which is equal to the intersection over all subgroups containing the elements of S; equivalently,  is the subgroup of all elements of G that can be expressed as the finite product of elements in S and their inverses.     If G , then we say that S generates G, and the elements in S are called generators or group generators. If S is the empty set, then  is the ": null
    },
    {
        "trivial group": "trivial group"
    },
    {
        " , since we consider the empty product to be the identity.     When there is only a single element x in S,  is usually written as . In this case,  is the cyclic subgroup of the powers of x, a ": null
    },
    {
        "cyclic group": "cyclic group"
    },
    {
        ", and we say this group is generated by x. Equivalent to saying an element x generates a group is saying that  equals the entire group G. For ": null
    },
    {
        "finite group": "finite group"
    },
    {
        "s, it is also equivalent to saying that x has ": null
    },
    {
        "order": "order"
    },
    {
        " G G is a ": null
    },
    {
        "topological group": "topological group"
    },
    {
        " then a subset S of G is called a set of topological generators if  is dense in G, i.e. the ": null
    },
    {
        "closure": "closure"
    },
    {
        " of  is the whole group G.          If S is finite, then a group  is called finitely generated. The structure of ": null
    },
    {
        "finitely generated abelian group": "finitely generated abelian group"
    },
    {
        "s in particular is easily described. Many theorems that are true for finitely generated groups fail for groups in general. It has been proven that if a finite group is generated by a subset S, then each group element may be expressed as a word from the alphabet S of length less than or equal to the order of the group.     Every finite group is finitely generated since . The ": null
    },
    {
        "integer": "integer"
    },
    {
        "s under addition are an example of an infinite group which is finitely generated by both 42 and −42 but the group of ": null
    },
    {
        "rationals": "rational number"
    },
    {
        " under addition cannot be finitely generated. No ": null
    },
    {
        "uncountable": "uncountable"
    },
    {
        " group can be finitely generated. For example, the group of real numbers under addition, .     Different subsets of the same group can be generating subsets. For example, if p and q are integers with , then  also generates the group of integers under addition by ": null
    },
    {
        "Bézouts identity": "bézouts identity"
    },
    {
        ".     While it is true that every ": null
    },
    {
        "quotient": "quotient group"
    },
    {
        " of a finitely generated group is finitely generated , a ": null
    },
    {
        "subgroup": "subgroup"
    },
    {
        " of a finitely generated group need not be finitely generated. For example, let G be the ": null
    },
    {
        "free group": "free group"
    },
    {
        " in two generators, x and y , and let S be the subset consisting of all elements of G of the form y n xy −n for n a ": null
    },
    {
        "natural number": "natural number"
    },
    {
        ".  is ": null
    },
    {
        "isomorphic": "isomorphism"
    },
    {
        " to the free group in countably infinitely many generators, and so cannot be finitely generated. However, every subgroup of a finitely generated ": null
    },
    {
        "abelian group": "abelian group"
    },
    {
        " is in itself finitely generated. In fact, more can be said: the class of all finitely generated groups is closed under ": null
    },
    {
        "extensions": "group extension"
    },
    {
        ". To see this, take a generating set for the ": null
    },
    {
        "normal subgroup": "normal subgroup"
    },
    {
        " and quotient. Then the generators for the normal subgroup, together with preimages of the generators for the quotient, generate the group.          The most general group generated by a set S is the group ": null
    },
    {
        "freely generated": "free group"
    },
    {
        " by S. Every group generated by S is ": null
    },
    {
        "isomorphic": "isomorphic"
    },
    {
        " to a ": null
    },
    {
        "quotient": "quotient group"
    },
    {
        " of this group, a feature which is utilized in the expression of a groups ": null
    },
    {
        "presentation": "presentation of a group"
    },
    {
        ".       An interesting companion topic is that of non-generators. An element x of the group G is a non-generator if every set S containing x that generates G, still generates G when x is removed from S. In the integers with addition, the only non-generator is 42 The set of all non-generators forms a subgroup of G, the ": null
    },
    {
        "Frattini subgroup": "frattini subgroup"
    },
    {
        ".       The ": null
    },
    {
        "group of units": "group of units"
    },
    {
        " U is the group of all integers ": null
    },
    {
        "relatively prime": "coprime"
    },
    {
        " to  42 under multiplication  . All arithmetic here is done ": null
    },
    {
        "modulo": "modular arithmetic"
    },
    {
        " 42 Seven is not a generator of U, since     : \\ \\.     while 42 is, since:     : \\ \\.     On the other hand, for n  sub /sub  ref  /ref  math /math  sup /sup  ref  /ref  ref  /ref  math /math  math ": null
    }
]