[
    {
        "   Genosha  is a ": null
    },
    {
        "fictional country": "Fictional Country"
    },
    {
        " appearing in ": null
    },
    {
        "American comic books": "American Comic Book"
    },
    {
        "published by ": null
    },
    {
        "Marvel Comics": "Marvel Comics"
    },
    {
        ". It is an island nation that exists in Marvels main ": null
    },
    {
        "shared universe": "Shared Universe"
    },
    {
        ", known as Earth 616 in the ": null
    },
    {
        "Marvel Universe": "Marvel Universe"
    },
    {
        " and a prominent place in the ": null
    },
    {
        "X-Men": "X-Men"
    },
    {
        " chronology. The fictional nation served as an ": null
    },
    {
        "allegory": "Allegory"
    },
    {
        " for ": null
    },
    {
        "slavery": "Slavery"
    },
    {
        " and later for ": null
    },
    {
        "South Africa": "South Africa"
    },
    {
        "n ": null
    },
    {
        "apartheid": "Apartheid"
    },
    {
        " before becoming a mutant ": null
    },
    {
        "homeland": "Homeland"
    },
    {
        " and subsequently a disaster zone. The island is located off the Southeastern African coast northwest from ": null
    },
    {
        "Seychelles": "Seychelles"
    },
    {
        " and northeast of ": null
    },
    {
        "Madagascar": "Madagascar"
    },
    {
        ". Its capital city was Hammer Bay.       Genosha first appeared in  Uncanny X-Men  235 , and was created by ": null
    },
    {
        "Chris Claremont": "Chris Claremont"
    },
    {
        " and ": null
    },
    {
        "Rick Leonardi": "Rick Leonardi"
    },
    {
        ".     Genosha received an entry in the  Official Handbook of the Marvel Universe Update 89  3.           The island is located off the east coast of ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ", to the north of ": null
    },
    {
        "Madagascar": "Madagascar"
    },
    {
        ", and boasted a high standard of living, an excellent economy, and freedom from the political and racial turmoil that characterized neighboring nations. However, Genoshas prosperity was built upon the enslavement of its ": null
    },
    {
        "mutant": "Mutant"
    },
    {
        " population. Mutants in Genosha were the property of the state and children who were positively identified with the mutant gene were put through a process developed by ": null
    },
    {
        "David Moreau": "David Moreau"
    },
    {
        ", commonly known as the Genegineer, stripped of free will and made into ": null
    },
    {
        "mutates": "Mutate"
    },
    {
        " . The Genegineer was also capable of modifying certain mutant abilities in order to fulfill specific labor shortages. Citizenship in Genosha is permanent and the government does not recognize any emigration. Citizens who attempt to leave the country are tracked down and forcibly brought back to the island by the special force known as ": null
    },
    {
        "Press Gang": "Press Gang"
    },
    {
        ". The Press Gang consisted of Hawkshaw, Pipeline, and Punchout, and were aided in their task by ": null
    },
    {
        "Wipeout": "Wipeout"
    },
    {
        ". Mutant problems are handled by a special group known as the ": null
    },
    {
        "Magistrates": "Magistrates"
    },
    {
        ". The foundations of Genoshan society has been upset in recent years due to the efforts of outside mutant interests. In the first storyline to feature the nation, some members of the ": null
    },
    {
        "X-Men": "X-Men"
    },
    {
        "  were kidnapped by Genoshan Magistrates, under the order of the Genegineer. Uncanny X-Men 235-238. Marvel Comics. Later, in the multi-issue, multi-title  X-Tinction Agenda  storyline, the X-Men and their allies rescued their teammates, ": null
    },
    {
        "Storm": "Storm"
    },
    {
        ", ": null
    },
    {
        "Meltdown": "Tabitha Smith"
    },
    {
        ", ": null
    },
    {
        "Rictor": "Rictor"
    },
    {
        " and ": null
    },
    {
        "Wolfsbane": "Wolfsbane"
    },
    {
        ", from Genoshan brainwashing, toppling the government after discovering their alliance with former ": null
    },
    {
        "X-Factor": "X-Factor"
    },
    {
        " ally turned mutant hater, ": null
    },
    {
        "Cameron Hodge": "Cameron Hodge"
    },
    {
        ", and that ": null
    },
    {
        "Havok": "Havok"
    },
    {
        " was one of the Magistrates since having his memory wiped by the Siege Perilous. Havok himself, woken from his conditioning by his brother ": null
    },
    {
        "Cyclops": "Cyclops"
    },
    {
        " dealt the killing blow to Cameron Hodge in the process. Uncanny X-Men  270-272, New Mutants 95-97, X-Factor 60-62. Marvel Comics.       A new Genoshan regime that promised better treatment of mutants was put in place after Hodges destruction. A period of general turmoil and a number of attacks by superhumans, including ": null
    },
    {
        "Magnetos": "Magneto"
    },
    {
        " Acolytes": "Acolytes"
    },
    {
        " who were unwilling to forgive the former Genoshan government for its crimes against mutants, followed.     A different version of X-Factor, including Wolfsbane, later returned to the island to help restore peace between its government and a rogue group of super-powered beings that had fled the island. The Genoshan government was shown with peaceful intentions, even trying to undo the ill effects visited upon Wolfsbane. Genosha was also shown to have typical suburban tract housing, like many small towns in America. X-Factor Vol. 1 89. Marvel Comics.     After the ": null
    },
    {
        "Age of Apocalypse": "Age Of Apocalypse"
    },
    {
        " story arc, it was revealed and ": null
    },
    {
        "retconned": "Retroactive Continuity"
    },
    {
        " that the mutate process formula was given to the Genegineer by ": null
    },
    {
        "Sugar Man": "Sugar Man"
    },
    {
        ", a refugee of the Age of Apocalypse timeline.     The ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " ceded the island nation to the powerful mutant ": null
    },
    {
        "Magneto": "Magneto"
    },
    {
        ", after he demanded an entire mutants-only nation. X-Men vol. 2 87  Magneto and his Acolytes managed to reestablish a modicum of peace and stability only briefly until civil war broke out between him and the remaining human population on the island led by the Magistrates. Magneto eventually defeated the Magistrates and restored order to most of the island, with hold-outs briefly remaining at Carrion Cove before being obliterated.     The elimination of the ": null
    },
    {
        "Legacy Virus": "Legacy Virus"
    },
    {
        " gave Magneto a freshly healthy army, leading him to declare a campaign of global conquest. A small team of X-Men stopped this plan, badly injuring Magneto in the process X-Men Vol. 2 113, p.21. Marvel Comics. .     Genosha had a population of sixteen million mutants and a stable, advanced society. New X-Men 115. Marvel Comics. However, the entire island was reduced to rubble and its mutant population was slain by ": null
    },
    {
        "Cassandra Novas": "Cassandra Nova"
    },
    {
        "Wild ": null
    },
    {
        "Sentinels": "Sentinel"
    },
    {
        ". There were few survivors, many evacuated, and the ": null
    },
    {
        "Brotherhood of Mutants": "Brotherhood Of Mutants"
    },
    {
        " turned one of the Sentinels into a memorial statue. New X-Men 132. Marvel Comics.       Magneto and Xavier have since then joined forces to rebuild the island nation as detailed in the series  Excalibur  vol. 3 . This goes badly as foreign military forces have thrown up a cordon around the island; no one is allowed to enter, and those trying to leave are fired upon.     A few survivors and newly arriving mutants who wish to help with the rebuilding process remain on the island. Members of this volunteer army include ": null
    },
    {
        "Callisto": "Callisto"
    },
    {
        ", ": null
    },
    {
        "Freakshow": "Freakshow"
    },
    {
        " and ": null
    },
    {
        "Wicked": "Wicked"
    },
    {
        ". More are found in the surrounding countryside, some join with Xavier. There is a conflict with Magistrates, the islands former law enforcement. Though they are assisted by humanoid creatures they refer to as trolls, the Magistrates forces are driven off. Some of the Magistrates are captured and kept in the islands makeshift jail.     Some of the captured Magistrates agree to work with Xavier to rebuild the island. Throughout the entire series, ": null
    },
    {
        "Unus the Untouchable": "Unus The Untouchable"
    },
    {
        " and his squadron of mutants remain a problem; they do not wish to be part of Xaviers group. Excalibur 6. Marvel Comics.          Later, Magneto learned of his daughter the Scarlet Witchs nervous break-down and her ever-growing powers to alter reality. Magneto snatched Wanda from her battle with her fellow Avengers and brought her to Genosha, where he asked Xavier to restore the Scarlet Witch’s sanity - but to no avail. The telepath couldn’t help her and, concerned of the threat to reality that Wanda posed, Xavier consulted the Avengers and the X-Men about what to do with her. Their decision was rendered moot, though, as by the time they reached Genosha reality altered around the heroes - changing into the world ruled by the ": null
    },
    {
        "House of M": "House Of M"
    },
    {
        " .     While conventional reality was eventually restored, it came at a high price, as thousands if not millions of Earth’s mutant population lost their powers or died in the process, leaving only a few hundred mutants alive and powered. Just like most of his new Genoshan allies and enemies, Magneto was among the depowered people, remaining trapped on the island.       In the ": null
    },
    {
        "limited series": "Limited Series"
    },
    {
        " Son of M": "Son Of M"
    },
    {
        ", there is a battle between some of the remaining mutants and the ": null
    },
    {
        "Inhumans": "Inhumans"
    },
    {
        ".     In ": null
    },
    {
        "New Avengers": "The New Avengers"
    },
    {
        " 19-20 it was stated that energy cannot be created nor destroyed, and the same held true for the energies of the numerous depowered mutants. Eventually, these energies gathered in the form of an unsuspecting energy-absorbing mutant named ": null
    },
    {
        "Michael Pointer": "Michael Pointer"
    },
    {
        ". Dubbed the Collective by the Avengers, against whom he then fought, the Collective traveled to Genosha and reached out to the startled Magneto. The Collective, controlled by ": null
    },
    {
        "Xorn": "Xorn"
    },
    {
        ", attempted to restore Magneto’s powers and convince him to lead the remaining mutants into taking over the planet. To the Collective’s surprise, Magneto resisted and allowed the Avengers to separate the energy from his body and send it into the sun. The comatose Magneto is also taken into S.H.I.E.L.D. custody, but the helicopter that was supposed to transport him off Genosha explodes once it lifts off. Magneto’s body is not found. It has since been revealed that he survived the explosion and remained depowered until the ": null
    },
    {
        "High Evolutionarys": "High Evolutionary"
    },
    {
        "dangerous experiment returned his magnetic abilities. New Avengers 19-20. Marvel Comics.          To date Genosha is now completely dead. Already in ruins before, the battle between the Inhumans and the ONE further destroyed the once-proud island nation.     Since Magneto was the last person on Genosha, it seems that it’s now totally uninhabited, which is corroborated by ": null
    },
    {
        "Wiccan": "Wiccan"
    },
    {
        " and ": null
    },
    {
        "Speed": "Speed"
    },
    {
        " when they began their search for their mother, the Scarlet Witch. They encountered Genosha an empty land filled with destroyed towers and empty streets.          ": null
    },
    {
        "Selene": "Selene"
    },
    {
        " is seen traveling to the ruined island of Genosha with her followers who were resurrected by the Technarch transmode virus. Led there by ": null
    },
    {
        "Blink": "Blink"
    },
    {
        " and ": null
    },
    {
        "Caliban": "Caliban"
    },
    {
        ", who tells Selene he senses millions of dead mutants. They enter the ruins and Selene proclaims Hammer Bay, the devastated capital of the island nation Necrosha, the place where she will become a god. X-Necrosha 1. Marvel Comics.     With Eli Bard, Selene resurrects the massacred residents of Genosha, with ": null
    },
    {
        "Cerebro": "Cerebro"
    },
    {
        " and ": null
    },
    {
        "Bastions": "Bastion"
    },
    {
        "computers detecting the rise of mutant numbers into the millions. X-Force 21. Marvel Comics. A problem presents itself in that many of the newly resurrected mutants have been de-powered, despite having been killed before ": null
    },
    {
        "M-Day": "Decimation"
    },
    {
        ". ": null
    },
    {
        "Wither": "Wither"
    },
    {
        " and ": null
    },
    {
        "Mortis": "Lois London"
    },
    {
        " explain what happened and the Coven begins to set up base at Necrosha.     Selene is eventually defeated and killed, thus ending the effect of the corrupted Techno-organic virus in the bodies she revived X-Force 25. Marvel Comics. and returning Genosha to an empty land. According to writer Chris Yost, Elixir is still on Necrosha.     During a visit to Genosha by the students of Jean Greys School for Gifted Youngsters students organized by Beast and Kitty Pryde, Sabretooth and AOA Blob assaulted Kid Gladiator and Kid Omega in order to kidnap Genesis. During this time, there were no mentionings of Elixir living here. Uncanny X-Force 30. Marvel Comics.     During the AXIS storyline, Magneto enters the island of Genosha to find that it had turned into a concentration camp for mutants. He frees two mutant girls who tell him that Red Skull is responsible and possesses Professor Xs brain. Magneto attacks Red Skull, but is quickly stopped by the Skulls S-Men . Magneto Vol. 3 9. Marvel Comics. Magneto is captured and telepathically tortured by Red Skull. He is given visions of those closest to him suffering while being unable to do anything to stop it. After being freed by Scarlet Witch, Rogue, and Havok, he bites down on a vial beneath his skin of Mutant Growth Hormone, giving himself enough power to fight. Magneto Vol. 3 10. Marvel Comics. Havok, Rogue, and Scarlet Witch are captured by the Red Skulls S-Men and sent to his concentration camp in Genosha. Rogue is able to break the group free. They discover Magneto has been captured, and free him, as well. The three want to leave the island and alert the rest of the Avengers and X-Men of what Red Skull is doing, but Magneto says hes going to stay and fight. Before they can do anything, Red Skull appears. Uncanny Avengers 24. Marvel Comics. Magneto, Rogue, and the Scarlet Witch fought Red Onslaught in Genosha and are later joined by the Avengers and the X-Men. Iron Man used a telepathic tamperer to stop the Red Skulls influence. When more heroes arrived to help, Red Onslaught revealed that he influenced Stark to create a model of Sentinels, based on the knowledge of different super heroes he acquired after the Civil War before erasing the latters memories of constructing them. Red Onslaught then deployed his Stark Sentinels to fight the heroes. Avengers & X-Men: AXIS 1. Marvel Comics.       As part of the All-New, All-Different Marvel , Magneto and his Uncanny X-Men use Genosha as a staging ground for an ambush on the Dark Riders , who have been targeting mutants with healing powers. After defeating the Dark Riders, Magneto then ties up the Dark Riders and sets off a bomb that kills them and also levels the entire island. It was a sign that Magneto has no intention of Laying Low. Uncanny X-Men Vol 4 5. Marvel Comics.       Carrion Cove -   Hammer Bay - The capital of Genosha which is the largest city on Genosha. Sugar Man has a secret laboratory underneath Hammer Bay.   Magda Square -   Magneto Monument - A monument made from a Wild Sentinel by the Brotherhood of Mutants following the Wild Sentinels attack on Genosha.         In this reality, there is a prison called Genosha Bay Prison which is somewhat similar to Guantánamo Bay . It was originally settled by Quaker missionaries who built a penitentiary so to isolate prisoners from each other so they could contemplate the gravity of their sins. By the 1930s, Genosha Bay later became a United States extraterritorial prison which hold prisoners of the worse cases from around the world and was notorious for practicing inhumane punishment s on its prisoners ranging from sleep deprivations and water torture. Genosha Bay Prison caught the notice of the public and culminating in a Senate Judiciary Meeting on consider closing the prison. Even if the prison were to be close down, lawmakers were unwilling to let its more severe criminal sociopaths from allowing into Americas prisons. In reality, Genosha Bay Prison was used as a proving ground in recruiting the prisoners as a next generation of government operatives. X-Men Noir: Mark of Cain 1. Marvel Comics.       In the ": null
    },
    {
        "Ultimate Marvel": "Ultimate Marvel"
    },
    {
        " reality, Genosha has made an appearances as an island south of Madagascar . Its main export seems to be television programs notably Hunt for Justice under control of Mojo Adams and his crew. Ultimate X-Men 54 . Mutants were recently reduced to second-class citizen s after the murder of a government minister Lord Joseph Scheele by a mutant called Arthur Centino aka Longshot after an affair was revealed between Scheele and his girlfriend Spiral . Centino is sentenced by Adams and Major Domo to the neighboring island of Krakoa to battle Arcade , but is saved by the X-Men. The island returns in an arc of ": null
    },
    {
        "Ultimate Spider-Man": "Ultimate Spider-Man"
    },
    {
        " where the mutant killer Deadpool and his squad is hired by Adams. Ultimate Spider-Man Vol 1 91-93         In the 1990s animated TV series ": null
    },
    {
        "X-Men": "X-Men"
    },
    {
        ", Genosha claims to be a mutant-friendly environment where those possessing the X-gene could live peacefully without fear of persecution. However, as soon as mutants travel there, they are captured and fitted with power-negating collars placed around their necks; they are put to work building Sentinels for the Genoshan government, under the direction of Bolivar Trask , Cameron Hodge , Henry Peter Gyrich , and a government official known as the Leader. With the help of Cable and a flood orchestrated by Storm, the X-Men simultaneously free the mutant slaves and destroy the Sentinels. Genosha continues to enslave mutants employing Sentinels and Magistrates, until they are rescued by Magneto and his Acolytes with the aid of many mutants . All Genoshan mutants leave for Asteroid M . Before long, the country is taken over by Magneto who is ready to declare war on humanity with the Genoshan mutants by his side, following an attack on Professor X during an anti-mutant summit. He never follows through with his plans though as he is called to a dying Xaviers side in the series final episode.     In the ": null
    },
    {
        "Wolverine and the X-Men": "Wolverine And The X-Men"
    },
    {
        " continuity, Genosha is a mutant paradise under Magnetos rule. Magneto offers the country as a sanctuary for other mutants around the world, promising peace and equality. Despite the facade of a mutant paradise, Nightcrawler soon learns from Dust that Magneto is an oppressive ruler who unfairly incarcerates Genosha mutants who do not abide by his rules. In Battle Lines, it is revealed that Senator Kelly gave Genosha to Magneto. In Aces and Eights , Genosha has closed off its borders. This same episode continually present Genosha as a monarchy by depicted Magneto as a King. In the three-part episode Foresight, Magneto has Mystique pose as Senator Kelly and unleash the Sentinels on Genosha. This was part of Magnetos plan to reprogram them to attack humans only to face problems with the Phoenix Force. After the Phoenix Force is stopped, many of Magnetos followers have lost faith in his methods. Scarlet Witch and Polaris have Blink teleport Magneto and Quicksilver away from Genosha. Though Genosha is no longer Magnetos country, Scarlet Witch tells Quicksilver that he is always welcome to return.       Genosha appears in both ": null
    },
    {
        "X-Men": "X-Men"
    },
    {
        " and ": null
    },
    {
        "Dark Phoenix": "Dark Phoenix"
    },
    {
        ". In X-Men, it is an uncharted island serving as Magnetos Brotherhood base. In Dark Phoenix, it is Magnetos safe haven for mutants with no home to return to gifted to him by the U.S. Government .       In the SNES game, Spider-Man and the X-Men in Arcades Revenge , Cyclopss levels are the Genosha Sentinel mines.   In the SNES game, X-Men: Mutant Apocalypse , Genosha serves as the primary setting of the game, as Apocalypse , Tusk , and the Broods take over said island to keep mutants in captivity.   Genosha is the Sentinels stage in the arcade and console-imported game ": null
    },
    {
        "X-Men: Children of the Atom": "X-Men: Children Of The Atom"
    },
    {
        ". Master Mold can be seen working in the background. If the Sentinel wins, Master Mold lifts off. However, if the Sentinel loses, Master Mold gets destroyed as well.   Genosha is briefly seen in ": null
    },
    {
        "X-Men: Next Dimension": "X-Men: Next Dimension"
    },
    {
        ", when Prime Sentinels attack Magneto .   In ": null
    },
    {
        "X-Men Legends": "X-Men Legends"
    },
    {
        ", Genosha is mentioned when Magneto gives his demands on television to make it a mutant paradise under his control.   In ": null
    },
    {
        "X-Men Legends II: Rise of Apocalypse": "X-Men Legends Ii: Rise Of Apocalypse"
    },
    {
        ", a chapter set in Genosha has it devastated by Apocalypse. The X-Men and the Brotherhood of Mutants had to liberate it from his control while using Magnetos sanctuary as a hub.   Genosha is the main setting in ": null
    },
    {
        "Deadpool": "Deadpool"
    },
    {
        ". http://www.computerandvideogames.com/386698/previews/deadpool-let-me-tell-you-why-you-should-buy-my-game/ Here, Genosha is in a state of ruins from the Sentinel attacks and Mister Sinister has made his base of operations here, harvesting the vast amount of mutant genetic material for his experiments. Deadpool travels to Genosha with the X-Men with the intention of killing Mister Sinister as revenge for killing one of Deadpools marks.       Genosha recordings: Experimental hardcore/gabber/darkcore label run by The Outside Agency .   The experimental string metal band, Judgement Day , has a song titled Genosha on their album Peacocks/Pink Monsters .       Genosha is compared to the Confederate States of America in an article in ": null
    },
    {
        "The Atlantic": "The Atlantic"
    },
    {
        ". ": null
    }
]