[
    {
        "      Genre  is any form or type of ": null
    },
    {
        "communication": "communication"
    },
    {
        " in any mode with socially-agreed-upon conventions developed over time. Genre is most popularly known as a ": null
    },
    {
        "category": "category of being"
    },
    {
        " of ": null
    },
    {
        "literature": "literature"
    },
    {
        ", ": null
    },
    {
        "music": "music"
    },
    {
        ", or other forms of art or entertainment, whether written or spoken, audio or visual, based on some set of stylistic criteria, yet genres can be aesthetic, rhetorical, communicative, or functional. Genres form by conventions that change over time as cultures invent new genres and discontinue the use of old ones. Often, works fit into multiple genres by way of borrowing and recombining these conventions. Stand-alone texts, works, or pieces of communication may have individual styles, but genres are amalgams of these texts based on agreed-upon or socially inferred conventions. Some genres may have rigid, strictly adhered-to guidelines, while others may show great flexibility.     Genre began as an absolute classification system for ": null
    },
    {
        "ancient Greek literature": "ancient greek literature"
    },
    {
        ", as set out in ": null
    },
    {
        "Aristotles Poetics": "poetics"
    },
    {
        ". For Aristotle, ": null
    },
    {
        "poetry": "poetry"
    },
    {
        " , ": null
    },
    {
        "prose": "prose"
    },
    {
        ", and ": null
    },
    {
        "performance": "performance"
    },
    {
        " each had specific design features that supported appropriate content of each genre. Speech patterns for comedy would not be appropriate for tragedy, for example, and even actors were restricted to their genre under the assumption that a type of person could tell one type of story best.     In later periods genres proliferated and developed in response to changes in audiences and creators. Genre became a dynamic tool to help the public make sense out of unpredictable art. Because art is often a response to a social state, in that people write/paint/sing/dance about what they know about, the use of genre as a tool must be able to adapt to changing meanings.     Genre suffers from the ills of any classification system. It has been suggested that genres resonate with people because of the familiarity, the shorthand communication, as well as because of the tendency of genres to shift with public ": null
    },
    {
        "mores": "mores"
    },
    {
        " and to reflect the ": null
    },
    {
        "zeitgeist": "zeitgeist"
    },
    {
        ". While the genre of ": null
    },
    {
        "storytelling": "storytelling"
    },
    {
        " has been relegated as lesser form of art because of the heavily borrowed nature of the ": null
    },
    {
        "conventions": "convention"
    },
    {
        ", admiration has grown. Proponents argue that the genius of an effective genre piece is in the variation, recombination, and evolution of the codes.            The term genre is much used in the history and criticism of visual art, but in ": null
    },
    {
        "art history": "art history"
    },
    {
        " has meanings that overlap rather confusingly. ": null
    },
    {
        "Genre painting": "genre painting"
    },
    {
        " is a term for paintings where the main subject features human figures to whom no specific identity attachesin other words, figures are not portraits, characters from a story, or allegorical personifications. These are distinguished from ": null
    },
    {
        "staffage": "staffage"
    },
    {
        ": incidental figures in what is primarily a ": null
    },
    {
        "landscape": "landscape art"
    },
    {
        " or architectural painting. Genre painting may also be used as a wider term covering genre painting proper, and other specialized types of paintings such as ": null
    },
    {
        "still-life": "still-life"
    },
    {
        ", landscapes, ": null
    },
    {
        "marine painting": "marine painting"
    },
    {
        "s and animal paintings.     The concept of the ": null
    },
    {
        "hierarchy of genres": "hierarchy of genres"
    },
    {
        " was a powerful one in artistic theory, especially between the 42th and 42th centuries. It was strongest in France, where it was associated with the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        " which held a central role in ": null
    },
    {
        "academic art": "academic art"
    },
    {
        ". The genres in hierarchical order are:   ": null
    },
    {
        "History painting": "history painting"
    },
    {
        ", including narrative religious mythological and allegorical subjects   ": null
    },
    {
        "Portrait painting": "portrait painting"
    },
    {
        " footmen": "infantry"
    },
    {
        " in the Army of Art according to the Dutch theorist ": null
    },
    {
        "Samuel van Hoogstraten": "samuel van hoogstraten"
    },
    {
        " d": "d"
    },
    {
        "as in the case of fictionin loose chronological order": null
    },
    {
        "ner": "ner"
    },
    {
        "n": "n"
    },
    {
        "a mixture of dialogue and narrativesuperior-dramatic dialoguesuperior-mixed narrativeinferior-dramatic dialogueinferior-mixed narrativeand therefore well beyond4242": null
    },
    {
        "s": "s"
    },
    {
        "sicologi": "sicologi"
    },
    {
        "Aug. 42the idea of ": null
    },
    {
        "heteroglossia": "heteroglossia"
    },
    {
        "such as formal letter and grocery list , or university lecture and personal anecdote often informally42s–42sinterFairclough, 42: 42Charaudeau and Maingueneau, 42:42–4242424242p.  4242pp. 42–4242Ed.pp. 42–42": null
    },
    {
        "n": "n"
    },
    {
        "teratu": "teratu"
    },
    {
        "ilosop": "ilosop"
    },
    {
        "mmunicati": "mmunicati"
    },
    {
        "n": "n"
    },
    {
        "Genette 4242Eds.pp. 4242Devitt 42Rosso, 42": null
    },
    {
        "nta": "nta"
    }
]