[
    {
        "            Mauritania , a country in the western region of the continent of Africa, is generally flat, its 42,42 square kilometres forming vast, arid plains broken by occasional ridges and clifflike outcroppings. It borders the North ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ", between ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        " and ": null
    },
    {
        "Western Sahara": "western sahara"
    },
    {
        ", ": null
    },
    {
        "Mali": "mali"
    },
    {
        " and ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        ". It is considered part of both the ": null
    },
    {
        "Sahel": "sahel"
    },
    {
        " and the ": null
    },
    {
        "Maghreb": "maghreb"
    },
    {
        ". A series of scarps face southwest, longitudinally bisecting these plains in the center of the country. The scarps also separate a series of sandstone plateaus, the highest of which is the ": null
    },
    {
        "Adrar Plateau": "adrar plateau"
    },
    {
        ", reaching an elevation of 42 metres. Spring-fed oases lie at the foot of some of the scarps. Isolated peaks, often rich in minerals, rise above the plateaus; the smaller peaks are called guelbs and the larger ones kedias. The concentric ": null
    },
    {
        "Guelb er Richat": "guelb er richat"
    },
    {
        " is a prominent feature of the north-central region. ": null
    },
    {
        "Kediet ej Jill": "kediet ej jill"
    },
    {
        ", near the city of ": null
    },
    {
        "Zouîrât": "zouîrât"
    },
    {
        ", has an elevation of 42 metres and is the highest peak.     Approximately three-fourths of Mauritania is desert or semidesert. As a result of extended, severe drought, the desert has been expanding since the mid42s. The plateaus gradually descend toward the northeast to the barren ": null
    },
    {
        "El Djouf": "el djouf"
    },
    {
        ", or Empty Quarter, a vast region of large sand dunes that merges into the ": null
    },
    {
        "Sahara Desert": "sahara desert"
    },
    {
        ". To the west, between the ocean and the plateaus, are alternating areas of clayey plains and sand dunes , some of which shift from place to place, gradually moved by high winds. The dunes generally increase in size and mobility toward the north.     Belts of natural vegetation, corresponding to the rainfall pattern, extend from east to west and range from traces of tropical forest along the ": null
    },
    {
        "Sénégal River": "sénégal river"
    },
    {
        " to brush and savanna in the southeast. Only sandy desert is found in the centre and north of the country.       The climate is characterized by extremes in temperature and by meager and irregular rainfall. Annual temperature variations are small, although diurnal variations can be extreme. The harmattan, a hot, dry, and often dust-laden wind, blows from the Sahara throughout the long dry season and is the prevailing wind, except along the narrow coastal strip, which is influenced by oceanic trade winds. Most rain falls during the short rainy season , from July to September, and average annual precipitation varies from  in the far south to less than  in the northern two-thirds of the country.          Mauritania has four ecological zones: the ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        "n Zone, the ": null
    },
    {
        "Sahel": "sahel"
    },
    {
        "ian Zone, the ": null
    },
    {
        "Senegal River": "senegal river"
    },
    {
        " Valley, and the ": null
    },
    {
        "Coast": "coast"
    },
    {
        "al Zone. Although the zones are markedly different from one another, no natural features clearly delineate the boundaries between them. ": null
    },
    {
        "Sand": "sand"
    },
    {
        ", varying in color and composition, covers 42 percent of the surface of the country, forming dunes that appear in all zones except the Senegal River Valley. Fixed sand dunes are composed of coarse, fawn-colored sand, while shifting dunes consist of fine, dustlike, reddish-colored sands that can be carried by the wind. Plateaus generally are covered with heavier blue, gray, and black sands that form a crusty surface over layers of soft, loose sand.            The Saharan Zone makes up the northern two-thirds of the country. Its southern boundary corresponds to the ": null
    },
    {
        "isohyet": "isohyet"
    },
    {
        " that represents annual precipitation of . Rain usually falls during the hivernage, which lasts from July to September. Often, isolated storms drop large amounts of water in short periods of time. A year, or even several years, may pass without any rain in some locations.     Diurnal variations in temperature in the Saharan Zone may be extreme, although annual variations are minimal. During December and January, temperatures range from an early morning low of  to a midafternoon high of . During May, June, and July, temperatures range from  in the morning to more than  by afternoon. Throughout the year, the harmattan often causes blinding sandstorms.     The administrative regions of ": null
    },
    {
        "Tiris Zemmour": "tiris zemmour"
    },
    {
        " in the north, ": null
    },
    {
        "Adrar": "adrar region"
    },
    {
        " in the center, and northern ": null
    },
    {
        "Hodh ech Chargui": "hodh ech chargui"
    },
    {
        " in the east, which make up most of the Saharan Zone, are vast empty stretches of dunes alternating with granite outcroppings. After a rain, or in the presence of a well, these outcroppings may support vegetation. In the populated ": null
    },
    {
        "Adrar": "adrar plateau"
    },
    {
        " and ": null
    },
    {
        "Tagant": "tagant plateau"
    },
    {
        " plateaus, springs and wells provide water for pasturage and some agriculture. In the western portion of the Saharan Zone, extending toward ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        ", rows of sand dunes are aligned from northeast to southwest in ridges from two to twenty kilometres wide. Between these ridges are depressions filled with limestone and clayey sand capable of supporting vegetation after a rain. Dunes in the far north shift with the wind more than those in the south.     The Saharan Zone has little vegetation. Some mountainous areas with a water source support small-leafed and spiny plants and scrub grasses suitable for camels. Because seeds of desert plants can remain dormant for many years, dunes often sprout sparse vegetation after a rain. In depressions between dunes, where the water is nearer the surface, some flora—including acacias, soapberry trees, capers, and swallowwort—may be found. Saline areas have a particular kind of vegetation, mainly chenopods, which are adapted to high salt concentrations in the soil. Cultivation is limited to oases, where date palms are used to shade other crops from the sun.       The Sahelian Zone extends south of the Saharan Zone to within approximately 42 kilometres of the Senegal River. It forms an east–west belt with its axis running from ": null
    },
    {
        "Boutilimit": "boutilimit"
    },
    {
        " through ": null
    },
    {
        "Ayoûn el Atroûs": "ayoûn el atroûs"
    },
    {
        " to ": null
    },
    {
        "Néma": "néma"
    },
    {
        ", including the ": null
    },
    {
        "Aoukar": "aoukar"
    },
    {
        " basin. The area is mostly made up of steppes and savanna grasslands. Herds of cattle, sheep, and goats move across this zone in search of pasturage.     The hivernage begins earlier in the Sahelian Zone than in the Saharan Zone, often lasting from June until October. Because farmers and herders depend on annual rains, a delay of one month in the beginning of the rainy season can cause large losses and lead to mass migrations from Hodh ech Chargui and ": null
    },
    {
        "Hodh el Gharbi": "hodh el gharbi"
    },
    {
        " into ": null
    },
    {
        "Mali": "mali"
    },
    {
        ". Although temperature extremes are narrower than in the Saharan Zone, daily variations range from . The ": null
    },
    {
        "harmattan": "harmattan"
    },
    {
        " is the prevailing wind.     In the northern Sahel, dunes are covered with scrub grasses and spiny acacia trees. Farther south, greater rainfall permits denser vegetation. Sands begin to give way to clay. Large date palm plantations are found on the ": null
    },
    {
        "Tagant Plateau": "tagant plateau"
    },
    {
        ", and savanna grasses, brushwood, balsam, and spurge cover fixed dunes. Occasional ": null
    },
    {
        "baobab": "adansonia digitata"
    },
    {
        " trees dot the flat ": null
    },
    {
        "savanna": "savanna"
    },
    {
        " grasslands of the southern Sahel. Forest areas contain ": null
    },
    {
        "palm tree": "palm tree"
    },
    {
        "s and baobabs. Vast forests of gum-bearing acacia grow in ": null
    },
    {
        "Trarza": "trarza"
    },
    {
        " and ": null
    },
    {
        "Brakna": "brakna"
    },
    {
        " regions. Farther south, particularly in ": null
    },
    {
        "Assâba": "assâba"
    },
    {
        " and the northern portion of ": null
    },
    {
        "Guidimaka": "guidimaka"
    },
    {
        " regions, rainfall is high enough to support forms of sedentary agriculture.       The Senegal River Valley, sometimes known as the ": null
    },
    {
        "Chemama": "chemama"
    },
    {
        " or the pre-Sahel, is a narrow belt of land that extends north of the ": null
    },
    {
        "Senegal River": "senegal river"
    },
    {
        ". Before the droughts of the 42s, 42s, and 42s, the belt ranged from  north of the river. By the late 42s, desertification had reached the northern bank of the river in some parts of the valley. The valley is wider in Guidimaka Region and is completely dominated by the seasonal cycle of the river. Almost all of the valleys economically active population engages in sedentary agriculture or fishing along the Senegal River and its main tributaries—the ": null
    },
    {
        "Karakoro": "karakoro river"
    },
    {
        ", the ": null
    },
    {
        "Gorgol": "gorgol river"
    },
    {
        ", and the ": null
    },
    {
        "Garfa": "garfa"
    },
    {
        ". This area supplies most of the countrys agricultural production.     The climate of the Senegal River Valley contrasts with that of the Saharan and Sahelian zones. Rainfall is higher than in other regions, ranging from  annually, usually between May and September. This rainfall, combined with annual flooding of the river, provides the basis for agriculture. Temperatures are cooler and subject to less annual and diurnal variation than in other regions.     The Senegal is the only permanent river between southern Morocco and central Senegal. From its source in ": null
    },
    {
        "Guinea": "guinea"
    },
    {
        ", it flows north and west , reaching the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        " at ": null
    },
    {
        "Saint Louis": "saint-louis region"
    },
    {
        ", Senegal. From its mouth, the river is navigable as far as ": null
    },
    {
        "Kayes": "kayes"
    },
    {
        ", Mali, during the rainy season and ": null
    },
    {
        "Podor": "podor"
    },
    {
        ", Senegal, during the rest of the year. Heavy rains, beginning in April in Guinea and May and June in Senegal and Mali, bring annual floods. These floods cover the entire valley up to a width of , filling numerous lakes and sloughs that empty back into the river during the dry season. When the waters recede from the bottomlands, planting begins.     The Senegal River Valley, with its rich alluvial and clayey soil, is comparatively abundant in flora. Moreover, higher rainfall, irrigation, and abundant side channels and sloughs tend to produce a lush, near-tropical vegetation, with baobab and gonakie trees and abundant rich grasses. Ddounm and barussus palms are also found here. Much of the flood plain is cultivated.       The Coastal Zone, or Sub-Canarian Zone, extends the length of the approximately  long Atlantic coast. Prevailing oceanic trade winds from the Canary Islands modify the influence of the harmattan, producing a humid but temperate climate. Rainfall here is minimal; in Nouadhibou it averages 42   mm annually and occurs between July and September. Temperatures are moderate, varying from mean maximums of  for Nouadhibou and Nouakchott, respectively, to mean minimums of .     Battering surf and shifting sand banks characterize the entire length of the shoreline. The ": null
    },
    {
        "Ras Nouadhibou": "ras nouadhibou"
    },
    {
        " peninsula, which forms ": null
    },
    {
        "Dakhlet Nouadhibou": "dakhlet nouadhibou"
    },
    {
        " to the east, is  long and 42  km wide. The peninsula is administratively divided between Western Sahara and Mauritania, with the Mauritanian port and railhead of Nouadhibou located on the eastern shore. Dakhlet Nouadhibou, one of the largest natural harbours on the west coast of Africa, is  long and  wide at its broadest point. Fifty kilometres southeast of Ras Nouadhibou is ": null
    },
    {
        "Arguin": "arguin"
    },
    {
        ". In 42 the first ": null
    },
    {
        "Portuguese": "portugal"
    },
    {
        " installation south of ": null
    },
    {
        "Cape Bojador": "cape bojador"
    },
    {
        " was established at Arguin. Farther south is the coastlines only significant promontory, -high Cape Timiris. From this cape to the marshy area around the mouth of the Senegal River, the coast is regular and marked only by an occasional high dune.     On coastal dunes vegetation is rare. At the foot of ridges, however, large tamarisk bushes, dwarf acacias, and swallowworts may be found. Some high grass, mixed with balsam, spurge, and spiny shrubs, grows in the central region. The north has little vegetation.          The climate has altered drastically since the onset of the prolonged drought in the 42s, part of a recurrent pattern of wet and dry cycles common to Sahelian Africa. Experts agree, however, that overgrazing, deforestation, denuding of ground cover around wells, poor farming methods, and overpopulation have aggravated the drought. In Mauritania the isohyet indicating annual rainfall of 42 millimetres—considered the minimum for pastoralism—has shifted southward about 42 kilometres to a point well south of Nouakchott. During the 42s, the desert was advancing southward at an estimated rate of six kilometres a year. Each major climatic zone had shifted southward, and in some cases near-desert conditions had reached the banks of the Senegal River.     By the late 42s, desertification had fundamentally altered agro-pastoral and human settlement patterns. Loss of ground cover in the Sahelian Zone had driven animals and people southward in search of food and water and had given rise to new fields of sand dunes. The advancing dunes threatened to engulf wells, villages, and roads; they had even invaded Nouakchott on their march to the sea. The government secured international help to stabilize the dune field around Nouakchott and planted 42 palm trees to create a barrier against the encroaching desert. To further combat desiccation, the government constructed dams on the Senegal River and its tributaries to increase the amount of cultivable land.           total:   42,42  km²   land:   42,42  km²   water:   42  km²       total:   42  km     border countries:   ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        " 42  km, ": null
    },
    {
        "Mali": "mali"
    },
    {
        " 42  km, ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        " 42  km, ": null
    },
    {
        "Western Sahara": "western sahara"
    },
    {
        " 42  km       42  km       territorial sea:      contiguous zone:      continental shelf:    or to the edge of the continental margin   exclusive economic zone:          lowest point:   ": null
    },
    {
        "Sebkha de Ndrhamcha": "sebkha de ndrhamcha"
    },
    {
        " 42 m   highest point:   ": null
    },
    {
        "Kediet ej Jill": "kediet ej jill"
    },
    {
        " 42 m           ": null
    },
    {
        "iron": "iron"
    },
    {
        " ore, ": null
    },
    {
        "gypsum": "gypsum"
    },
    {
        ", ": null
    },
    {
        "copper": "copper"
    },
    {
        ", ": null
    },
    {
        "phosphate": "phosphate"
    },
    {
        ", ": null
    },
    {
        "diamond": "diamond"
    },
    {
        "s, ": null
    },
    {
        "gold": "gold"
    },
    {
        ", ": null
    },
    {
        "oil": "oil"
    },
    {
        ", ": null
    },
    {
        "fish": "fish"
    },
    {
        "          arable land:   42%   permanent crops:   42%   other:   42%        42  km²       42  km 42           hot, dry, dust/sand-laden ": null
    },
    {
        "sirocco": "sirocco"
    },
    {
        " wind blows primarily in March and April; periodic ": null
    },
    {
        "drought": "drought"
    },
    {
        "s       ": null
    },
    {
        "overgrazing": "overgrazing"
    },
    {
        ", ": null
    },
    {
        "deforestation": "deforestation"
    },
    {
        ", and ": null
    },
    {
        "soil erosion": "soil erosion"
    },
    {
        " aggravated by ": null
    },
    {
        "drought": "drought"
    },
    {
        " are contributing to ": null
    },
    {
        "desertification": "desertification"
    },
    {
        "; very limited natural fresh ": null
    },
    {
        "water": "water"
    },
    {
        " resources away from the Senegal which is the only perennial river; ": null
    },
    {
        "locust": "locust"
    },
    {
        " infestation       party to:   ": null
    },
    {
        "Biodiversity": "convention on biological diversity"
    },
    {
        ", ": null
    },
    {
        "Climate Change": "united nations framework convention on climate change"
    },
    {
        ", ": null
    },
    {
        "Climate Change-Kyoto Protocol": "kyoto protocol"
    },
    {
        ", ": null
    },
    {
        "Desertification": "united nations convention to combat desertification"
    },
    {
        ", ": null
    },
    {
        "Endangered Species": "convention on the international trade in endangered species of wild flora and fauna"
    },
    {
        ", ": null
    },
    {
        "Hazardous Wastes": "basel convention"
    },
    {
        ", ": null
    },
    {
        "Law of the Sea": "united nations convention on the law of the sea"
    },
    {
        ", ": null
    },
    {
        "Ozone Layer Protection": "montreal protocol on substances that deplete the ozone layer"
    },
    {
        ", ": null
    },
    {
        "Ship Pollution": "ship pollution"
    },
    {
        ", ": null
    },
    {
        "Wetlands": "ramsar convention"
    },
    {
        ", ": null
    },
    {
        "Whaling": "whaling"
    },
    {
        "   signed, but not ratified:   none of the selected agreements       The population is mainly concentrated in the cities of ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        " and ": null
    },
    {
        "Nouadhibou": "nouadhibou"
    },
    {
        " and along the ": null
    },
    {
        "Senegal River": "senegal river"
    },
    {
        " at the southern border of the country.       This is a list of the extreme points of ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        ", the points that are farther north, south, east or west than any other location.     Northernmost point – the ": null
    },
    {
        "tripoint": "tripoint"
    },
    {
        " with ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        " and ": null
    },
    {
        "Western Sahara": "western sahara"
    },
    {
        ", ": null
    },
    {
        "Tiris Zemmour Region": "tiris zemmour region"
    },
    {
        " tripoint": "tripoint"
    },
    {
        " with ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        " and ": null
    },
    {
        "Mali": "mali"
    },
    {
        ", ": null
    },
    {
        "Tiris Zemmour Region": "tiris zemmour region"
    },
    {
        " Senegal river": "senegal river"
    },
    {
        " and the ": null
    },
    {
        "Karakoro river": "karakoro river"
    },
    {
        " on the border with ": null
    },
    {
        "Mali": "mali"
    },
    {
        ", ": null
    },
    {
        "Guidimaka Region": "guidimaka region"
    },
    {
        " Western Sahara": "western sahara"
    },
    {
        " on the ": null
    },
    {
        "Ras Nouadhibou": "ras nouadhibou"
    },
    {
        ", peninsula, ": null
    },
    {
        "Dakhlet Nouadhibou Region": "dakhlet nouadhibou region"
    }
]