[
    {
        "right": "image:la-map.png"
    },
    {
        "      Laos is an independent republic, and a landlocked nation in ": null
    },
    {
        "Southeast Asia": "southeast asia"
    },
    {
        ", northeast of ": null
    },
    {
        "Thailand": "thailand"
    },
    {
        ", west of ": null
    },
    {
        "Vietnam": "vietnam"
    },
    {
        ". It covers 236,800 square kilometers in the center of the Southeast Asian peninsula and it is surrounded by ": null
    },
    {
        "Myanmar": "myanmar"
    },
    {
        " , ": null
    },
    {
        "Cambodia": "cambodia"
    },
    {
        ", the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        ", ": null
    },
    {
        "Thailand": "thailand"
    },
    {
        ", and ": null
    },
    {
        "Vietnam": "vietnam"
    },
    {
        ". About seventy percent of its geographic area is made up of mountain ranges, highlands, plateaux, and rivers cut through.     Its location has often made it a ": null
    },
    {
        "buffer state": "buffer state"
    },
    {
        " between more powerful neighboring states, as well as a crossroads for trade and communication. Migration and international conflict have contributed to the present ethnic composition of the country and to the geographic distribution of its ethnic groups.       Most of the western border of ": null
    },
    {
        "Laos": "laos"
    },
    {
        " is demarcated by the ": null
    },
    {
        "Mekong": "mekong"
    },
    {
        " river, which is an important artery for transportation. The Dong Falls at the southern end of the country prevent access to the sea, but cargo boats travel along the entire length of the Mekong in Laos during most of the year. Smaller power boats and ": null
    },
    {
        "pirogues": "pirogue"
    },
    {
        "provide an important means of transportation on many of the tributaries of the Mekong.     The Mekong has thus not been an obstacle but a facilitator for communication, and the similarities between Laos and northeast Thai society—same people, almost same language—reflect the close contact that has existed across the river for centuries. Also, many Laotians living in the Mekong Valley have relatives and friends in Thailand.     Prior to the twentieth century, Laotian kingdoms and principalities encompassed areas on both sides of the Mekong, and Thai control in the late nineteenth century extended to the left bank. Although the Mekong was established as a border by French colonial forces, travel from one side to the other has been significantly limited only since the establishment of the Lao Peoples Democratic Republic in 1975.     The eastern border with Vietnam extends for 2,130 kilometres, mostly along the crest of the Annamite Chain, and serves as a physical barrier between the Chinese-influenced culture of Vietnam and the Indianized states of Laos and Thailand. These mountains are sparsely populated by tribal minorities who traditionally have not acknowledged the border with Vietnam any more than lowland Lao have been constrained by the 1,754-kilometre Mekong River border with Thailand. Thus, ethnic minority populations are found on both the Laotian and Vietnamese sides of the frontier. Because of their relative isolation, contact between these groups and lowland Lao has been mostly confined to trading.     Laos shares its short—only 541 kilometres—southern border with Cambodia, and ancient Khmer ruins at Wat Pho and other southern locations attest to the long history of contact between the Lao and the Khmer. In the north, the country is bounded by a mountainous 423-kilometre border with China and shares the 235-kilometre-long Mekong River border with ": null
    },
    {
        "Myanmar": "myanmar"
    },
    {
        ".     The topography of Laos is largely mountainous, with the ": null
    },
    {
        "Annamite Range": "annamite range"
    },
    {
        " in the northeast and east and the ": null
    },
    {
        "Luang Prabang Range": "luang prabang range"
    },
    {
        " in the northwest, among other ranges typically characterized by steep terrain. Elevations are typically above 500 metres with narrow river valleys and low agricultural potential. This mountainous landscape extends across most of the north of the country, except for the plain of Vientiane and the ": null
    },
    {
        "Plain of Jars": "plain of jars"
    },
    {
        " in the ": null
    },
    {
        "Xiangkhoang Plateau": "xiangkhoang plateau"
    },
    {
        ".     The southern panhandle of the country contains large level areas in Savannakhét and Champasak provinces that are well suited for extensive paddy rice cultivation and livestock raising. Much of Khammouan Province and the eastern part of all the southern provinces are mountainous. Together, the alluvial plains and terraces of the Mekong and its tributaries cover only about 20% of the land area.     Only about 4% of the total land area is classified as arable. The forested land area has declined significantly since the 1970s as a result of commercial logging and expanded ": null
    },
    {
        "swidden": "swidden"
    },
    {
        ", or slash-and-burn, farming.       ": null
    },
    {
        "Phou Bia": "phou bia"
    },
    {
        ", 2,819 m   ": null
    },
    {
        "Phu Xai Lai Leng": "phu xai lai leng"
    },
    {
        ", 2,720 m   ": null
    },
    {
        "Rao Co": "rao co"
    },
    {
        ", 2,286 m   ": null
    },
    {
        "Phu Soi Dao": "phu soi dao"
    },
    {
        ", 2,120 m   2,079 m   ": null
    },
    {
        "Shiceng Dashan": "shiceng dashan"
    },
    {
        ", 1,830 m   ": null
    },
    {
        "Dong Ap Bia": "dong ap bia"
    },
    {
        ", 937 m               Laos has a tropical monsoon climate, with a pronounced rainy season from May through October, a cool dry season from November through February, and a hot dry season in March and April. Generally, monsoons occur at the same time across the country, although that time may vary significantly from one year to the next.     Rainfall varies regionally, with the highest amounts— annually—recorded on the Bolovens Plateau in Champasak Province. City rainfall stations have recorded that Savannakhét averages  of rain annually; Vientiane receives about , and Louangphrabang  receives about .     Rainfall is not always adequate for rice cultivation and the relatively high average precipitation conceals years where rainfall may be only half or less of the norm, causing significant declines in rice yields. Such droughts often are regional, leaving production in other parts of the country unaffected.     The average temperatures in January, coldest month, are, Luang Prabang 20.5  °C , Vientiane 20.3  °C , and Pakse 23.9  °C ; the average temperatures for April, usually the hottest month, are, Luang Prabang 28.1  °C , Vientiane 39.4  °Cor 300 meters2017NUPIMISIS": null
    },
    {
        "belled with red do": "belled with red do"
    },
    {
        "wild oxen": null
    },
    {
        "olo": "olo"
    },
    {
        "VPA26 September 201231 July 20113 October 2012IASGASLEAFNBCACliPADNPA": null
    },
    {
        "landlocked": "landlocked"
    }
]