[
    {
        "Grenada is a ": null
    },
    {
        "Caribbean": "caribbean sea"
    },
    {
        " island": "island"
    },
    {
        " between the Caribbean Sea and ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ", north of ": null
    },
    {
        "Trinidad and Tobago": "trinidad and tobago"
    },
    {
        ". It is located at . There are no large inland bodies of water on the island, which consists entirely of the state of Grenada. The coastline is 42  km long. The island has 42 constituencies and speaks English. It is volcanic in origin and its topography is mountainous.     ": null
    },
    {
        "Natural resource": "natural resource"
    },
    {
        "s include ": null
    },
    {
        "timber": "timber"
    },
    {
        ", tropical ": null
    },
    {
        "fruit": "fruit"
    },
    {
        " and deepwater ": null
    },
    {
        "harbor": "harbor"
    },
    {
        "s.     Grenada and its largely uninhabited outlying territories are the most southerly of the ": null
    },
    {
        "Windward Islands": "windward islands"
    },
    {
        ". The Grenadine Islands chain consists of some 42 islets; those south of the ": null
    },
    {
        "Martinique Channel": "martinique channel"
    },
    {
        " belong to Grenada, while those north of the channel are part of the nation of St. Vincent and the Grenadines. Located about 42 kilometers north of Venezuela, at approximately 42° north latitude and 42° west longitude, Grenada and its territories occupy a small area of 42 square kilometers. Grenada, known as the Spice Isle because of its production of nutmeg and mace, is the largest at 42 square kilometers, or about the size of the city of ": null
    },
    {
        "Detroit": "detroit"
    },
    {
        ". The island is oval shaped and framed by a jagged southern coastline; its maximum width is thirty-four kilometers, and its maximum length is nineteen kilometers. ": null
    },
    {
        "St. Georges": "st. georges, grenada"
    },
    {
        ", the capital and the nations most important harbor, is favorably situated near a lagoon on the southwestern coast. Of all the islands belonging to Grenada, only two are of consequence: Carriacou, with a population of a few thousand, and its neighbor Petit Martinique, roughly 42 kilometers northeast of Grenada and populated by some 42 inhabitants.          Part of the volcanic chain in the Lesser Antilles arc, Grenada and its possessions generally vary in elevation from under 42 meters to over 42 meters above sea level. Grenada is more rugged and densely foliated than its outlying possessions, but other geographical conditions are more similar. Grenadas landmass rises from a narrow, coastal plain in a generally north-south trending axis of ridges and narrow valleys. ": null
    },
    {
        "Mount St. Catherine": "mount saint catherine"
    },
    {
        " is the highest peak at 42 meters.     Although many of the rocks and soils are of volcanic origin, the volcanic cones dotting Grenada are long dormant. The only known active volcano in the area is ": null
    },
    {
        "Kick em Jenny": "kick em jenny"
    },
    {
        ", just north between Grenada and Carriacou. Some of the drainage features on Grenada remain from its volcanic past. There are a few crater lakes, the largest of which is Grand Etang. The swift upper reaches of rivers, which occasionally overflow and cause flooding and landslides, generally cut deeply into the conic slopes. By contrast, many of the water courses in the lowlands tend to be sluggish and meandering.                The Grenadian climate is tropical, tempered by northeast ": null
    },
    {
        "trade winds": "trade winds"
    },
    {
        ".     The abundance of water is primarily caused by the tropical, wet climate. Yearly precipitation, largely generated by the warm and moisture-laden northeasterly trade winds, varies from more than  on the windward mountainsides to less than  in the lowlands. The greatest monthly totals are recorded throughout Grenada from June through November, the months when tropical storms and hurricanes are most likely to occur. Rainfall is less pronounced from December through May, when the equatorial low-pressure system moves south. Similarly, the highest humidities, usually close to 42 percent, are recorded during the rainy months, and values from 42 to 42 percent are registered during the drier period. Temperatures averaging  are constant throughout the year, however, with slightly higher readings in the lowlands. Nevertheless, diurnal ranges within a 42-hour period are appreciable: between  during the day and between  at night.       ; Area:   : Total: 42 km²   : Land: 42 km²   ; Maritime claims:   : Territorial sea:    : ": null
    },
    {
        "Exclusive economic zone": "exclusive economic zone"
    },
    {
        ":  and    ; Land use:   : Arable land: 42%   : Permanent crops: 42%   : Other: 42%   ; Irrigated land:   : 42 km²   ; Natural hazards:   : Lies on edge of hurricane belt; hurricane season lasts from June to November   ; Extreme points   Northernmost point – ": null
    },
    {
        "Gun Point": "gun point, grenada"
    },
    {
        ", ": null
    },
    {
        "Carriacou": "carriacou"
    },
    {
        " Tanga Langue": "tanga langue"
    },
    {
        ", ": null
    },
    {
        "Saint Patrick Parish": "saint patrick parish, grenada"
    },
    {
        " Petite Martinique": "petite martinique"
    },
    {
        " island   Easternmost point - ": null
    },
    {
        "Artiste Point": "artiste point"
    },
    {
        ", ": null
    },
    {
        "Saint Andrew Parish": "saint andrew parish, grenada"
    },
    {
        " Glover Island": "glover island, grenada"
    },
    {
        ", ": null
    },
    {
        "Saint George Parish": "saint george parish, grenada"
    },
    {
        " Prickly Point": "prickly point"
    },
    {
        ", ": null
    },
    {
        "Saint George Parish": "saint george parish, grenada"
    },
    {
        " Point Salines": "point salines"
    },
    {
        ", ": null
    },
    {
        "Saint George Parish": "saint george parish, grenada"
    },
    {
        " Mount Saint Catherine": "mount saint catherine"
    },
    {
        ": 42 m   Lowest point – ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        ": 42 m     ; Environment - international agreements:   : Party to: Biodiversity, Climate Change, Desertification, Endangered Species, ": null
    },
    {
        "Law of the Sea": "law of the sea"
    },
    {
        ", Ozone Layer Protection, Whaling   ; Geography - note:   : The administration of the islands of the ": null
    },
    {
        "Grenadines": "grenadines"
    },
    {
        " group is divided between ": null
    },
    {
        "Saint Vincent and the Grenadines": "saint vincent and the grenadines"
    },
    {
        " and ": null
    },
    {
        "Grenada": "grenada"
    }
]