[
    {
        "                  Cape Verde   is a group of ": null
    },
    {
        "arid": "arid"
    },
    {
        " Atlantic": "atlantic ocean"
    },
    {
        " islands which are home to a number of birds and reptiles and constitute a unique ": null
    },
    {
        "ecoregion": "ecoregion"
    },
    {
        " in the ": null
    },
    {
        "World Wildlife Fund": "world wildlife fund"
    },
    {
        " classification.         The Cape Verde Islands are located in the mid-Atlantic Ocean some  off the west coast of the continent of Africa. The landscape varies from dry plains to high active volcanoes with cliffs rising steeply from the ocean. The climate is arid. The total size is .     The ": null
    },
    {
        "archipelago": "archipelago"
    },
    {
        " consists of ten islands and five islets, divided into the windward  and leeward  groups. The six islands in the Barlavento group are ": null
    },
    {
        "Santo Antão": "santo antão, cape verde"
    },
    {
        ", ": null
    },
    {
        "São Vicente": "são vicente, cape verde"
    },
    {
        ", ": null
    },
    {
        "Santa Luzia": "santa luzia, cape verde"
    },
    {
        ", ": null
    },
    {
        "São Nicolau": "são nicolau, cape verde"
    },
    {
        ", ": null
    },
    {
        "Sal": "sal, cape verde"
    },
    {
        ", and ": null
    },
    {
        "Boa Vista": "boa vista, cape verde"
    },
    {
        ". The islands in the Sotavento group are ": null
    },
    {
        "Maio": "maio, cape verde"
    },
    {
        ", ": null
    },
    {
        "Santiago": "santiago, cape verde"
    },
    {
        ", ": null
    },
    {
        "Fogo": "fogo, cape verde"
    },
    {
        ", and ": null
    },
    {
        "Brava": "brava, cape verde"
    },
    {
        ". All but Santa Luzia are inhabited.     Three islands & ndash; Sal, Boa Vista, and Maio & ndash; generally are level and lack natural water supplies. Mountains higher than  are found on Santiago, Fogo, Santo Antão, and São Nicolau.     Sand carried by high winds has caused erosion on all islands, especially the windward ones. Sheer, jagged cliffs rise from the sea on several of the mountainous islands. The lack of natural vegetation in the uplands and coast also contributes to soil erosion. Only the interior valleys support natural vegetation.         ; Geographic coordinates:   :      ; Area:   : Total: 42 km 42   : Land: 42 km 42   : Water: 42 km 42    ; Area & ndash; comparative:   : US: slightly larger than ": null
    },
    {
        "Rhode Island": "rhode island"
    },
    {
        "   : Canada: slightly larger than the ": null
    },
    {
        "Queen Charlotte Islands": "queen charlotte islands"
    },
    {
        "   : UK: slightly larger than Suffolk   ; Coastline:   : 42 km   ; Maritime claims:   : Measured from claimed archipelagic baselines   : Territorial sea:    : Contiguous zone:    : Exclusive economic zone:    ; ": null
    },
    {
        "Exclusive economic zone": "exclusive economic zone"
    },
    {
        "   : EEZ area:    : Continental shelf: 42 km 42   : Coral reefs: 42% of world   : Sea mounts: 42% of world   : source: https://web.archive.org/web/42/http://seaaroundus.org/eez/eez.aspx Sea Around Us Projects Countries EEZ   ; Terrain:   : Steep, rugged, rocky, volcanic.   ; Elevation extremes:   : Lowest point: Atlantic Ocean 42 m   : Highest point: ": null
    },
    {
        "Mount Fogo": "mount fogo"
    },
    {
        " 42 m   ; Natural resources:   : ": null
    },
    {
        "Salt": "salt"
    },
    {
        ", ": null
    },
    {
        "basalt": "basalt"
    },
    {
        " rock, ": null
    },
    {
        "limestone": "limestone"
    },
    {
        ", ": null
    },
    {
        "kaolin": "kaolin"
    },
    {
        ", ": null
    },
    {
        "fish": "fish"
    },
    {
        ", ": null
    },
    {
        "clay": "clay"
    },
    {
        ", ": null
    },
    {
        "gypsum": "gypsum"
    },
    {
        "   ; Land use:   : Arable land: 42%   : Permanent crops: 42%   : Other: 42%   ; Irrigated land:   : 42 km 42   ; Total renewable water resources:   : 42 km 42   ; Freshwater withdrawal   : total: 42 km 42 /yr   : per capita: 42 m 42 /yr   ; Natural hazards:   : Prolonged ": null
    },
    {
        "drought": "drought"
    },
    {
        "s; seasonal harmattan wind produces obscuring dust; volcanically and seismically active.   ; Geography - note:   : Strategic location 42 km from west coast of Africa near major north-south sea routes; important communications station; important sea and air refueling site.                     Cabo Verde shares ": null
    },
    {
        "maritime boundaries": "maritime boundary"
    },
    {
        " with ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        " and ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        ". Cabo Verde has signed ": null
    },
    {
        "treaties": "treaty"
    },
    {
        " with ": null
    },
    {
        "Senegal": "cape verde – senegal maritime delimitation treaty"
    },
    {
        " and ": null
    },
    {
        "Mauritania": "cape verde – mauritania maritime delimitation treaty"
    },
    {
        " delimiting": "boundary delimitation"
    },
    {
        " the specific boundaries. However, the two treaties conflict in their delimitation of the precise borders. Due to the numerous islands it has an ": null
    },
    {
        "Exclusive Economic Zone": "exclusive economic zone"
    },
    {
        " of .                   A cold Atlantic current produces an arid atmosphere around the archipelago. December–June is cool and dry, with temperatures at sea level averaging ; July–November is warm and dry, with temperatures averaging . Although some rain comes during the latter season, rainfall is sparse overall and very erratic. Accumulations are generally around  annually in the northern islands and  in the south. The archipelago is subject to cyclical droughts; a devastating drought began in 42 and was broken only briefly in 42 42 42 and 42     Rainfall is irregular, historically causing periodic droughts and famines. Desalination plants now provide water to more than half the countrys population.   Experiments with ": null
    },
    {
        "fog collectors": "fog collector"
    },
    {
        " have been conducted since 42 Sabino, António A. , Fog Water Collection Projects in Cape Verde: Potentialities and Constraints. Case Study of the Natural Park of Serra Malagueta. 42th International Conference on Fog, Fog Collection and Dew , however, such collectors had not been expanded beyond the Serra Malagueta community of Santiago Island, as of 42  The average precipitation per year in ": null
    },
    {
        "Praia": "praia"
    },
    {
        " is .   During the winter, storms blowing from the ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        " sometimes form dense dust clouds that obscure the sun; however, sunny days are the norm year round. The clearest skies are found between February and June, with very little rainfall during these months. Saharan dust, Harmattan wind, laden with dust come from the Sahara. This occurs between November and March and is generally similar to the Calima affecting the Canary Islands.     The ocean near Cabo Verde is an area of ": null
    },
    {
        "tropical cyclone": "tropical cyclone"
    },
    {
        " formation; since these storms have the whole Atlantic over which to develop as they move westward, they are among the most intense hurricanes, and are called ": null
    },
    {
        "Cape Verde-type hurricane": "cape verde-type hurricane"
    },
    {
        "s.     The Cape Verde islands are a very degradated area. Also, most islands do not always get a monsoon. In fact, it is not surprising that some atmospheric precipitation of islands are limited in tropical rain.     If rain arrives, it is usually between August and October. The first rainy season brings high temperatures and high humidity that condenses as dew mountain. The other rainy season is between December and June, when the northeast trade winds are common during this season, only altitudes above 42 m tend to receive regular rain.   The island of Sal receives an average of 42 mm in May. When the rain comes, if it comes, it can be very strong. Half of the rain in a particular year can often fall into a single storm.   Most of the Cape Verde islands are dry, but on islands with high mountains and farther away from the continental land mass, by orography, the humidity is much higher, giving a rainforest habitat, very degraded by the strong human presence.   Northeastern slopes of high mountains often receive a lot of rain and southwestern slopes do not. This is because they are umbria areas, situated in the north hillsides or slopes of the mountainous areas, oriented behind the sun in the ": null
    },
    {
        "Northern Hemisphere": "northern hemisphere"
    },
    {
        ", in the shadyside ": null
    },
    {
        "orographic": "orography"
    },
    {
        ". So the amount of ": null
    },
    {
        "solar radiation": "solar radiation"
    },
    {
        " that it receive is much lower than it would if it had without the islands relief which intercepts much of the sun. In terms of botanical ecology, these umbria areas are identified as being cool and moist.     The current north of the Canaries, has a cooling effect on the islands of Cabo Verde, making the air temperature more bearable than it would expect in any case at this latitude. Conversely, the islands do not receive the upwellings that affect the West African coast, so the air temperature is cooler than in Senegal, but the sea is actually warmer, because the orographic relief of some islands, such as Sao Miguel with steep mountains, cover it with rich woods and luxuriant vegetation where the humid air condenses and soak the plants, rocks, soil, logs, and moss.     Hurricanes often begin forming in the waters around the islands of Cabo Verde, but it is rare that the strength of the storm reaches close to the islands. A Cape Verde type hurricane is formed in the area south of the islands, near Sao Miguel, after a tropical wave on the African continent during the rainy season. The storm picks up strength when it crosses the warm waters of Atlantic.     The ": null
    },
    {
        "laurel forest": "laurel forest"
    },
    {
        " is a type of cloud forest, the ": null
    },
    {
        "cloud forest": "cloud forest"
    },
    {
        "s, are developed preferably about ": null
    },
    {
        "mountain": "mountain"
    },
    {
        "s, where the dense ": null
    },
    {
        "moisture": "moisture"
    },
    {
        " from the sea or ocean, is precipitated by the action of the relief. Opposing the terrain to a front of warm, moist air mass, it forces to increase the height above sea level of that body wet and warm air mass, which cools and decreases the ": null
    },
    {
        "dew point": "dew point"
    },
    {
        ", causing it to condense part of the moisture that falls as rain or fog, creating a habitat especially cool, saturated with moisture in the air and soil.     It is the balance between the dry and warm influence of the subtropical anticyclone, hot and dry summer and ": null
    },
    {
        "orography": "orography"
    },
    {
        " the responsible for carrying cool wet air.   As latitude increases, this increases the impact of the storms, which in its journey from west to east, swept the western coasts of continents, dumping heavy rains as carrying high humidity.   Precipitation multiply if these air masses are crossing mountains in the way. The resulting climate is wetter, but with an annual oscillation of the temperature moderated by the proximity of the ocean.   Appear mostly occupying favorable areas named geographically ": null
    },
    {
        "Umbria": "umbria"
    },
    {
        "s, this is north hillsides or slopes of the mountainous areas that are oriented behind the sun, because the islands are in the ": null
    },
    {
        "Northern Hemisphere": "northern hemisphere"
    },
    {
        ", between 42 and 42 meters, thus benefiting from the humidity provided by the ": null
    },
    {
        "trade winds": "trade winds"
    },
    {
        " to form such a sea of clouds. In its botanical ecology, the mountain umbria is identified with cool and moisture.         Cape Verde is the driest archipelago of the ecoregion of ": null
    },
    {
        "Macaronesia": "macaronesia"
    },
    {
        ". That with a greater influence of African species due to its geographical location near the African mainland of the Sahel.   At first, the islands of Cabo Verde housed an extensive savanna and ": null
    },
    {
        "dry forest": "dry forest"
    },
    {
        " cover": "forest cover"
    },
    {
        ", but mostly it was removed to convert to agricultural land, which, together with the arid climate and rugged terrain, has led to a soil erosion and desertification widespread. However, the archipelago can be divided into four broad ecological zones , according to altitude and average annual rainfall ranging from 42  mm in the arid areas of the coast to more than 42  mm in the humid mountain. Mostly rainfall precipitation is due to condensation of the ocean mist. Today much of the forest cover comprises relatively immature agroforestry plantations, in which are used non-native species such as Prosopis juliflora, Leucaena leucocephala and Jatropha curcas. The native ": null
    },
    {
        "laurel forest": "laurel forest"
    },
    {
        " species are in wet area only in mountainous areas.     On the lower and drier islands the vegetation, before human colonization, consisted of savanna or steppe vegetation, with the flattest inland portion supporting semi-desert plants. At higher altitudes, a form of arid shrubland was also present. These islands were covered with savanna on the plains and arid shrubland on the mountainsides, but after over 42 years of human habitation nearly all the original vegetation has been cleared in favour of widespread agriculture including the grazing of goats, sheep and cattle and the planting of imported crop species. There are some remaining patches of dry forest high on steep mountainside including a number of endemic plant species, but these are inaccessible and hard to study.     On the higher islands and somewhat wetter islands, exclusively in mountainous areas, like Santo Antao island, the climate is suitable for the development of dry monsoon forest, and laurel forest as this vegetation is believed to have been present in the past. However, most vegetation has now been converted to agriculture and forest fragments are now restricted to areas where cultivation is not possible, such as mountain peaks and steep slopes. The demand for wood has resulted in deforestation and desertification.     Of particular note is the ": null
    },
    {
        "endemic": "endemic"
    },
    {
        " type of ": null
    },
    {
        "humid subtropical": "humid subtropical"
    },
    {
        " laurel forest": "laurel forest"
    },
    {
        " of macaronesian laurisilva, found on several of the ": null
    },
    {
        "Macaronesia": "macaronesia"
    },
    {
        "n islands of the ": null
    },
    {
        "North Atlantic": "north atlantic"
    },
    {
        " and Macaronesian African mainland enclaves: these are a relic of the ": null
    },
    {
        "Pliocene": "pliocene"
    },
    {
        " subtropical": "subtropical"
    },
    {
        " forest": "forest"
    },
    {
        "s, supporting numerous endemic species, namely ": null
    },
    {
        "Madeira Islands": "madeira islands"
    },
    {
        ", the ": null
    },
    {
        "Azores": "azores"
    },
    {
        ", Cape Verde Islands and the ": null
    },
    {
        "Canary Islands": "canary islands"
    },
    {
        ".     This ": null
    },
    {
        "laurisilva": "laurisilva"
    },
    {
        " forests are found in the islands of ": null
    },
    {
        "Macaronesia": "macaronesia"
    },
    {
        " in the eastern Atlantic, in particular the Azores, Madeira Islands, and western Canary Islands, from 42  m to 42  m elevation. Trees of the genera  Apollonias  ,  Ocotea  ,  Persea  ,  Clethra  ,  Dracaena  , and  Picconia   are characteristic. , Madeira Wind Birds 42 The Madeira Islands laurel forest was designated a ": null
    },
    {
        "World Heritage Site": "world heritage site"
    },
    {
        " by ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " in 42         There are four endemic bird species including the ": null
    },
    {
        "Raso lark": "raso lark"
    },
    {
        " along with more common ": null
    },
    {
        "swifts": "swifts"
    },
    {
        ", ": null
    },
    {
        "larks": "larks"
    },
    {
        ", ": null
    },
    {
        "warblers": "warblers"
    },
    {
        ", and ": null
    },
    {
        "sparrows": "old world sparrow"
    },
    {
        ". The islands are an important breeding site for seabirds including the ": null
    },
    {
        "Cape Verde shearwater": "cape verde shearwater"
    },
    {
        " and ": null
    },
    {
        "Feas petrel": "feas petrel"
    },
    {
        " , which breeds only here and in ": null
    },
    {
        "Madeira": "madeira"
    },
    {
        ". Santiago Island holds the only breeding site of the endemic and critically endangered ": null
    },
    {
        "Bournes heron": "bournes heron"
    },
    {
        ". The 42 endemic reptile species include a giant gecko , and there are other ": null
    },
    {
        "gecko": "gecko"
    },
    {
        "s and ": null
    },
    {
        "skink": "skink"
    },
    {
        "s in abundance. The giant skink  is now thought to be extinct.         Almost all of the natural environment has been destroyed by conversion to agriculture and logging for firewood, as well as natural ": null
    },
    {
        "soil erosion": "soil erosion"
    },
    {
        ", all of which has threatened several species of birds and reptiles. The remaining original forest exists at high altitudes only. Newer problems include illegal beach sand extraction and ": null
    },
    {
        "overfishing": "overfishing"
    },
    {
        " while the nesting birds are vulnerable due to introduced mammals, including cats and rats.     ; Environment - international agreements   : Party to: ": null
    },
    {
        "Biodiversity": "biodiversity"
    },
    {
        ", ": null
    },
    {
        "Climate Change": "united nations framework convention on climate change"
    },
    {
        ", ": null
    },
    {
        "Desertification": "desertification"
    },
    {
        ", Endangered Species, ": null
    },
    {
        "Environmental Modification": "environmental modification convention"
    },
    {
        ", ": null
    },
    {
        "Hazardous Wastes": "hazardous wastes"
    },
    {
        ", ": null
    },
    {
        "Law of the Sea": "law of the sea"
    },
    {
        ", ": null
    },
    {
        "Marine Dumping": "marine dumping"
    },
    {
        ", ": null
    },
    {
        "Nuclear Test Ban": "nuclear test ban"
    },
    {
        ", Ship Pollution, Wetlands         The higher altitudes of the islands are accessible on the islands of ": null
    },
    {
        "Fogo": "fogo, cape verde"
    },
    {
        ", where there is a road to the volcano and walks up to the crater, and the mountainous ": null
    },
    {
        "Santo Antão": "santo antão, cape verde"
    },
    {
        " where there are hiking routes.       Northernmost point - ": null
    },
    {
        "Ponta do Sol": "ponta do sol, cape verde"
    },
    {
        " on ": null
    },
    {
        "Santao Antão": "santo antão, cape verde"
    },
    {
        " Island   Southernmost point - ": null
    },
    {
        "Ponta Nho Martinho": "ponta nho martinho"
    },
    {
        " on ": null
    },
    {
        "Brava": "brava, cape verde"
    },
    {
        " Ponta Chao de Mongrade": "ponta chao de mongrade"
    },
    {
        " on ": null
    },
    {
        "Santao Antão": "santo antão, cape verde"
    },
    {
        " Ponta Meringuel": "ponta meringuel"
    },
    {
        " on ": null
    },
    {
        "Boa Vista": "boa vista, cape verde"
    },
    {
        " Note: this is also the westernmost point of Africa": null
    }
]