[
    {
        "Belize": "belize"
    },
    {
        " is a small ": null
    },
    {
        "Central America": "central america"
    },
    {
        "n ": null
    },
    {
        "nation": "nation"
    },
    {
        ", located at 42°42 north of the ": null
    },
    {
        "equator": "equator"
    },
    {
        " and 42°42 west of the ": null
    },
    {
        "Prime Meridian": "prime meridian"
    },
    {
        " on the ": null
    },
    {
        "Yucatán Peninsula": "yucatán peninsula"
    },
    {
        ". It borders the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        " to the east, with 42  km of coastline. It has a total of 42  km of land borders—": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " to the north-northwest and Guatemala to the south-southwest . Belizes total size is 42  km², of which 42  km² is land and 42  km² is water.     Belize is the only country in Central America without a ": null
    },
    {
        "Pacific": "pacific ocean"
    },
    {
        " coastline. Many ": null
    },
    {
        "coral reef": "coral reef"
    },
    {
        "s, ": null
    },
    {
        "cay": "cay"
    },
    {
        "s, and ": null
    },
    {
        "island": "island"
    },
    {
        "s to the east—such as ": null
    },
    {
        "Ambergris Caye": "ambergris caye"
    },
    {
        ", ": null
    },
    {
        "Lighthouse Reef": "lighthouse reef"
    },
    {
        ", ": null
    },
    {
        "Glovers Reef": "glovers reef"
    },
    {
        ", and the ": null
    },
    {
        "Turneffe Islands": "turneffe islands"
    },
    {
        "—are part of Belizes territory, forming the ": null
    },
    {
        "Belize Barrier Reef": "belize barrier reef"
    },
    {
        ", the longest in the western hemisphere stemming approximately  and the second longest in the world after the ": null
    },
    {
        "Great Barrier Reef": "great barrier reef"
    },
    {
        ". Belizes largest river is the eponymous ": null
    },
    {
        "Belize River": "belize river"
    },
    {
        ". Belizes lowest ": null
    },
    {
        "elevation": "elevation"
    },
    {
        " is at ": null
    },
    {
        "sea level": "sea level"
    },
    {
        ". Its highest point is ": null
    },
    {
        "Doyles Delight": "doyles delight"
    },
    {
        " at .     The climate in Belize is tropical, with a rainy season from June to November and a dry season from January to May. ": null
    },
    {
        "Natural hazard": "natural hazard"
    },
    {
        "s include ": null
    },
    {
        "hurricanes": "tropical cyclone"
    },
    {
        "  and coastal ": null
    },
    {
        "flooding": "flooding"
    },
    {
        ", especially in the south.       Topographical feature divide the Belizean landscape into two main physiographic regions. The most visually striking of these regions is distinguished by the ": null
    },
    {
        "Maya Mountains": "maya mountains"
    },
    {
        " and the associated basins and plateaus that dominate all but the narrow coastal plain in the southern half of the country. The mountains rise to heights of about 42 metres, with the highest point being ": null
    },
    {
        "Doyles Delight": "doyles delight"
    },
    {
        " in the Cockscomb Range, a spur of the Maya Mountains in Western Belize. Covered with shallow, highly erodible soils of low fertility, these heavily forested highlands are very sparsely inhabited.     The second region comprises the northern lowlands, along with the southern coastal plain. Eighteen major rivers and many perennial streams drain these low-lying areas. The coastline is flat and swampy, with many lagoons, especially in the northern and central parts of the country. Westward from the northern coastal areas, the terrain changes from mangrove swamp to tropical pine savanna and hardwood forest.        Belize claims an ": null
    },
    {
        "exclusive economic zone": "exclusive economic zone"
    },
    {
        " of  with  and a ": null
    },
    {
        "territorial sea": "territorial waters"
    },
    {
        " of . From the mouth of the ": null
    },
    {
        "Sarstoon River": "sarstoon river"
    },
    {
        " to Ranguana Cay, Belizes territorial sea is ; according to Belizes Maritime Areas Act, 42 the purpose of this limitation is to provide a framework for the negotiation of a definitive agreement on territorial differences with Guatemala.     Belize is the only country in Central America without a coastline on the ": null
    },
    {
        "North Pacific Ocean": "pacific ocean"
    },
    {
        ".          The interlocking networks of rivers, creeks, and lagoons have played a key role in the historical geography of Belize. The largest and most historically important river is the ": null
    },
    {
        "Belize River": "belize river"
    },
    {
        ", which drains more than one-quarter of the country as it winds along the northern edge of the Maya Mountains across the center of the country to the sea near Belize City. Also known as the Old River, the Belize River is navigable up to the Guatemalan border and served as the main artery of commerce and communication between the interior and the coast until well into the twentieth century.     Other historically important rivers include the ": null
    },
    {
        "Sibun River": "sibun river"
    },
    {
        ", which drains the northeastern edge of the Maya Mountains, and the ": null
    },
    {
        "New River": "new river"
    },
    {
        ", which flows through the northern sugar-growing areas before emptying into ": null
    },
    {
        "Chetumal Bay": "chetumal bay"
    },
    {
        ". Both of these river valleys possess fertile alluvial soils and have supported considerable cultivation and human settlement.                     Belize has a tropical climate with pronounced wet and dry seasons, although there are significant variations in weather patterns by region. Temperatures vary according to elevation, proximity to the coast, and the moderating effects of the northeast trade winds off the Caribbean. Average temperatures in the coastal regions range from  in January to  in July. Temperatures are slightly higher inland, except for the southern highland plateaus, such as the Mountain Pine Ridge, where it is noticeably cooler year round. Overall, the seasons are marked more by differences in humidity and rainfall than in temperature.     Average rainfall varies considerably, ranging from  in the north and west to over  in the extreme south. Seasonal differences in rainfall are greatest in the northern and central regions of the country where, between January and April or May, fewer than  of rain fall per month. The dry season is shorter in the south, normally only lasting from February to April. A shorter, less rainy period, known locally as the little dry, usually occurs in late July or August, after the initial onset of the rainy season.       Hurricanes have played a devastating role in Belizean history. In 42 an unnamed hurricane destroyed over two-thirds of the buildings in Belize City and killed more than 42 people. In 42 ": null
    },
    {
        "Hurricane Janet": "hurricane janet"
    },
    {
        " leveled the northern town of Corozal. Six years later, ": null
    },
    {
        "Hurricane Hattie": "hurricane hattie"
    },
    {
        " struck the central coastal area of the country, with winds in excess of  and  storm tides. The devastation of Belize City for the second time in thirty years prompted the relocation of the capital some  inland to the planned city of ": null
    },
    {
        "Belmopan": "belmopan"
    },
    {
        ". A hurricane that devastated Belize was ": null
    },
    {
        "Hurricane Greta": "hurricane greta-olivia"
    },
    {
        ", which caused more than US$42 million in damages along the southern coast in 42     There was a period of 42 years that Belize was considered as a hurricane-free zone by many until ": null
    },
    {
        "Hurricane Mitch": "hurricane mitch"
    },
    {
        " caused quite a stir and gave rise to hurricane awareness and the National Emergency Management Organization . Two years later ": null
    },
    {
        "Tropical Storm Chantal": "tropical storm chantal"
    },
    {
        " and ": null
    },
    {
        "Hurricane Keith": "hurricane keith"
    },
    {
        " did much to put the country on the hurricane map.     In 42 ": null
    },
    {
        "Hurricane Iris": "hurricane iris"
    },
    {
        " swept through the southern part of Belize causing damage that ranged in the hundreds of millions due largely to wiping away the ": null
    },
    {
        "banana": "banana"
    },
    {
        " industry, crippling the ": null
    },
    {
        "citrus": "citrus"
    },
    {
        " and tourism in the area. Six years later, the fury of ": null
    },
    {
        "Category Five Dean": "hurricane dean"
    },
    {
        " landed on the Yucatán coast at Mahahual and Corozal in northern Belize, was not spared the brunt of reportedly Category 42 to 42 winds. Hurricane Dean did tens of millions in damages, especially to the infantile ": null
    },
    {
        "papaya": "papaya"
    },
    {
        " industry and to a lesser extent to the endemic ": null
    },
    {
        "sugar cane": "sugar cane"
    },
    {
        " industry.            Belizean geology consists largely of varieties of ": null
    },
    {
        "limestone": "limestone"
    },
    {
        ", with the notable exception of the ": null
    },
    {
        "Maya Mountains": "maya mountains"
    },
    {
        ", a large uplifted block of intrusive ": null
    },
    {
        "Paleozoic": "paleozoic"
    },
    {
        " granite": "granite"
    },
    {
        " and sediments running northeast to southwest across the south-central part of the country. Several major ": null
    },
    {
        "faults": "fault"
    },
    {
        " rive these highlands, but much of Belize lies outside the ": null
    },
    {
        "tectonically active": "tectonics"
    },
    {
        " zone that underlies most of Central America. During the ": null
    },
    {
        "Cretaceous": "cretaceous"
    },
    {
        " Period, what is now the western part of the Maya Mountains stood above sea level, creating the oldest land surface in Central America, the Mountain Pine Ridge plateau.     The hilly regions surrounding the Maya Mountains are formed from Cretaceous limestone. These areas are characterized by a ": null
    },
    {
        "karst topography": "karst topography"
    },
    {
        " that is typified by numerous ": null
    },
    {
        "sinkhole": "sinkhole"
    },
    {
        "s, ": null
    },
    {
        "cave": "cave"
    },
    {
        "rns, and underground streams. In contrast to the Mountain Pine Ridge, some of the soils in these regions are quite fertile and have been cultivated during at least the past 42 years.     Much of the northern half of Belize lies on the Yucatán Platform, a tectonically stable region. Although mostly level, this part of the country also has occasional areas of hilly, karst terrain, such as the Yalbac Hills along the western border with Guatemala and the Manatee Hills between Belize City and ": null
    },
    {
        "Dangriga": "dangriga"
    },
    {
        ". Alluvial deposits of varying fertility cover the relatively flat landscapes of the coastal plains.       ": null
    },
    {
        "Environmental degradation": "environmental degradation"
    },
    {
        " issues in Belize include ": null
    },
    {
        "deforestation": "deforestation"
    },
    {
        ", ": null
    },
    {
        "water pollution": "water pollution"
    },
    {
        " from ": null
    },
    {
        "sewage": "sewage"
    },
    {
        ", industrial ": null
    },
    {
        "effluent": "effluent"
    },
    {
        "s, ": null
    },
    {
        "agricultural runoff": "agricultural runoff"
    },
    {
        ", and ": null
    },
    {
        "solid waste": "solid waste"
    },
    {
        " disposal.     Belize is party to the ": null
    },
    {
        "Basel Convention": "basel convention"
    },
    {
        ", ": null
    },
    {
        "Convention on Biological Diversity": "convention on biological diversity"
    },
    {
        ", ": null
    },
    {
        "Ramsar Convention": "ramsar convention"
    },
    {
        ", ": null
    },
    {
        "CITES": "cites"
    },
    {
        ", ": null
    },
    {
        "Convention on the Prevention of Marine Pollution by Dumping of Wastes and Other Matter": "convention on the prevention of marine pollution by dumping of wastes and other matter"
    },
    {
        ", ": null
    },
    {
        "International Convention for the Regulation of Whaling": "international convention for the regulation of whaling"
    },
    {
        ", ": null
    },
    {
        "Montreal Protocol": "montreal protocol"
    },
    {
        ", ": null
    },
    {
        "MARPOL 42/42": "marpol 73/78"
    },
    {
        ", ": null
    },
    {
        "United Nations Convention on the Law of the Sea": "united nations convention on the law of the sea"
    },
    {
        ", ": null
    },
    {
        "United Nations Convention to Combat Desertification": "united nations convention to combat desertification"
    },
    {
        ", and ": null
    },
    {
        "United Nations Framework Convention on Climate Change": "united nations framework convention on climate change"
    },
    {
        ".       Although a number of economically important minerals exist in Belize, none has been found in quantities large enough to warrant their mining. Those minerals include dolomite, barite , bauxite , cassiterite , and gold. In 42 limestone, used in road building, was the only mineral resource being exploited for either domestic or export use.     The similarity of Belizean geology to that of oil-producing areas of Mexico and Guatemala prompted oil companies, principally from the United States, to explore for petroleum at both offshore and on-land sites in the early 42s. Initial results were promising, but the pace of exploration slowed later in the decade, and production operations never commenced. As a result, Belize remains almost totally dependent on imported petroleum for its energy needs.     Belize has considerable potential for hydroelectric and other renewable energy resources, such as solar and biomass. In the mid42s a Belizean businessman proposed the construction of a wood-burning power station for the production of electricity, but the idea foundered in the wake of ecological concerns and economic constraints. In late 42 a company named Belize Natural Energy found oil in commercial quantities in the ": null
    },
    {
        "Spanish Lookout": "spanish lookout"
    },
    {
        " area of Belize.         Northernmost point – ": null
    },
    {
        "Subteniente Lopez": "subteniente lopez"
    },
    {
        " Guatemala": "guatemala"
    },
    {
        ", near ": null
    },
    {
        "Chocon": "chocon"
    },
    {
        " Guatemala": "guatemala"
    },
    {
        ", at ": null
    },
    {
        "Sarstoon River": "sarstoon river"
    },
    {
        " Lighthouse Reef": "lighthouse reef"
    },
    {
        " Doyles Delight": "doyles delight"
    },
    {
        ": 42 m   Lowest point – ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    }
]