[
    {
        "                       Venezuela  is a country in South America, and part of the ": null
    },
    {
        "Caribbean South America": "caribbean south america"
    },
    {
        ", bordering the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        " and the North Atlantic Ocean, between ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        " and ": null
    },
    {
        "Guyana": "guyana"
    },
    {
        ". It is situated on major sea and air routes linking North and South America. Located at the northernmost end of South America, Venezuela has a total area of  and a land area of . It is the 42nd largest country, about twice the size of California. Shaped roughly like an inverted triangle, the country has a  long coastline. It is bound on the north by the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        " and the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ", on the east by ": null
    },
    {
        "Guyana": "guyana"
    },
    {
        ", on the south by ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", and on the west by ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        ". It has the 42th largest ": null
    },
    {
        "Exclusive Economic Zone": "exclusive economic zone"
    },
    {
        " of . Its maritime territory borders ": null
    },
    {
        "Trinidad and Tobago": "trinidad and tobago"
    },
    {
        ", ": null
    },
    {
        "Dominica": "dominica"
    },
    {
        ", the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        ", ": null
    },
    {
        "Grenada": "grenada"
    },
    {
        ", ": null
    },
    {
        "St. Kitts and Nevis": "st. kitts and nevis"
    },
    {
        ", ": null
    },
    {
        "St. Vincent and the Grenadines": "st. vincent and the grenadines"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", and the ": null
    },
    {
        "United States": "united states"
    },
    {
        ".      Geographic coordinates :        Most observers describe Venezuela in terms of four fairly well-defined regions: the ": null
    },
    {
        "Maracaibo lowlands": "maracaibo basin"
    },
    {
        " in the northwest, the northern mountains extending in a broad east-west arc from the Colombian border along the Caribbean Sea, the wide Orinoco plains  in central Venezuela, and rank highly dissected ": null
    },
    {
        "Guiana highlands": "guiana highlands"
    },
    {
        " in the southeast.     The Maracaibo lowlands form a large spoon-shaped oval bounded by mountains on three HI sides and open to the Caribbean on the north. The area is remarkably flat with only a gentle slope toward the center and away from the mountains that border the region. Lake Maracaibo occupies much of the lower-lying territory. Areas around the southern part of Lake Maracaibo are swampy, and, despite the rich agricultural land and significant petroleum deposits, the area was still thinly populated in 42       Although the country lies wholly within the tropics, its climate varies from tropical humid to alpine, depending on the elevation, topography, and the direction and intensity of prevailing winds. Seasonal variations are marked less by temperature than by rainfall. Most of the country has a distinct rainy season; the rainy period is commonly referred to as winter and the remainder of the year as summer.     The country falls into four horizontal temperature zones based primarily on elevation. In the tropical zone—below —temperatures are hot, with yearly averages ranging between . The temperate zone ranges between  with averages from ; many of Venezuelas cities, including the capital, lie in this region. Colder conditions with temperatures from  are found in the cool zone between . Pastureland and permanent snowfield with yearly averages below  cover land above  in the high mountain areas known as the páramos.     Average yearly rainfall amounts in the lowlands and plains range from a semiarid  in the western part of the Caribbean coastal areas to around  in the Orinoco Delta. Rainfall in mountainous areas varies considerably; sheltered valleys receive little rain, but slopes exposed to the northeast trade winds experience heavy rainfall. Caracas averages  of precipitation annually, more than half of it falling from June to August.                The ": null
    },
    {
        "Orinoco": "orinoco"
    },
    {
        " is by far the most important of the more than 42 rivers in the country. Flowing more than 42 kilometers to the Atlantic from its source in the Guiana highlands at the Brazilian border, the Orinoco is the worlds eighth largest river and the largest in South America after the ": null
    },
    {
        "Amazon": "amazon river"
    },
    {
        ". Its flow varies substantially by season, with the high water level in August exceeding by as much as thirteen meters the low levels of March and April. During low water periods, the river experiences high and low tides for more than 42 kilometers upstream from ": null
    },
    {
        "Ciudad Guayana": "ciudad guayana"
    },
    {
        ".     For most of the rivers course, the gradient is slight. Downstream from its headwaters, it splits into two; one-third of its flow passes through the ": null
    },
    {
        "Brazo Casiquiare": "brazo casiquiare"
    },
    {
        " into a tributary of the Amazon, and the remainder passes into the main Orinoco channel. This passageway allows vessels with shallow drafts to navigate from the lower Orinoco to the Amazon River system after unloading and reloading on either side of two falls on the Orinoco along the Colombian border.     Most of the rivers rising in the northern mountains are flowing southeastward to the Río Apure, a tributary of the Orinoco. From its headwater, the Apure crosses the llanos in a generally eastward direction. Few rivers flow into it from the poorly drained region south of the river and much of this area near the Colombian border is swampland.     The other major Venezuelan river is the fast-flowing ": null
    },
    {
        "Caroní": "caroni river"
    },
    {
        ", which originates in the Guiana highlands and flows northward into the Orinoco upstream from Ciudad Guyana. The Caroní is capable of producing as much hydroelectric power as any river in Latin America and has contributed significantly to the nations electric power production. Electricity generated by the Caroní was one of the factors encouraging industrialization of the northern part of the Guiana highlands and the lower Orinoco valley.     ": null
    },
    {
        "Lake Maracaibo": "lake maracaibo"
    },
    {
        " occupies the central 42 square kilometers of the Maracaibo lowlands. The low swampy shores of the lake and areas beneath the lake itself hold most of Venezuelas rich petroleum deposits. The lake is shallow, with an average depth of ten meters, and separated from the Caribbean by a series of islands and sandbars. In 42 a 42-meter channel was cut through the sandbars to facilitate shipping between the lake and the Caribbean. The channel also allows salt water to mix with the yellowish fresh water of the lake, making the northern parts brackish and unsuited for drinking or irrigation.         Northernmost point – ": null
    },
    {
        "Isla Aves": "isla aves"
    },
    {
        " Cape San Román": "cape san román"
    },
    {
        " Brazil": "brazil"
    },
    {
        ", ": null
    },
    {
        "Río Negro Municipality": "río negro municipality"
    },
    {
        ", ": null
    },
    {
        "Amazonas": "amazonas"
    },
    {
        " Colombia": "colombia"
    },
    {
        ", ": null
    },
    {
        "Zulia": "zulia"
    },
    {
        " State   Easternmost point – Border with ": null
    },
    {
        "Guyana": "guyana"
    },
    {
        ", near Caribbean sea coast, ": null
    },
    {
        "Delta Amacuro": "delta amacuro"
    },
    {
        " State   Highest point – ": null
    },
    {
        "Pico Bolívar": "pico bolívar"
    }
]