[
    {
        "      Missouri": "missouri"
    },
    {
        ", a state near the geographical center of the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", has ": null
    },
    {
        "three distinct physiographic divisions": "physiographic regions of the united states"
    },
    {
        ":     a north-western upland plain or prairie region part of the Interior Plains Central Lowland  known as the northern plains   a lowland in the extreme southeast ": null
    },
    {
        "bootheel": "missouri bootheel"
    },
    {
        " region of Missouri, part of the Atlantic Plain known as the Mississippi Alluvial Plain  or the ": null
    },
    {
        "Mississippi embayment": "mississippi embayment"
    },
    {
        " Ozark": "ozark"
    },
    {
        " Plateau which lies between the Mississippi Alluvial Plain and the Central lowland.   The boundary between the northern plains and the Ozark region follows the   ": null
    },
    {
        "Missouri River": "missouri river"
    },
    {
        " from its mouth at ": null
    },
    {
        "St. Louis": "st. louis, missouri"
    },
    {
        " to ": null
    },
    {
        "Columbia": "columbia, missouri"
    },
    {
        ". This also corresponds to the southernmost extent of glaciation during the ": null
    },
    {
        "Pre-Illinoian Stage": "pre-illinoian"
    },
    {
        " which destroyed the remnant plateau to the north but left the ancient landforms to the south unaltered. The Ozark boundary runs southwestward from there towards ": null
    },
    {
        "Joplin": "joplin, missouri"
    },
    {
        " at the southeast corner of ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        ". The boundary between the Ozark and lowland regions runs southwest from ": null
    },
    {
        "Cape Girardeau": "cape girardeau, missouri"
    },
    {
        " on the ": null
    },
    {
        "Mississippi River": "mississippi river"
    },
    {
        " to the ": null
    },
    {
        "Arkansas": "arkansas"
    },
    {
        " border just southwest of ": null
    },
    {
        "Poplar Bluff": "poplar bluff, missouri"
    },
    {
        ". Missouri borders eight other US States, more than any other state except ": null
    },
    {
        "Tennessee": "tennessee"
    },
    {
        ", which also borders eight states.             The Dissected ": null
    },
    {
        "Till": "till"
    },
    {
        " Plains portion of the northern plains region lies in the portion of the state north of the ": null
    },
    {
        "Missouri River": "missouri river"
    },
    {
        ", while the Osage plains portion extends into the southwestern portion of the state bordering the ": null
    },
    {
        "Ozark Plateau": "ozark plateau"
    },
    {
        ". Thus the northern plains covers an area slightly more than a third of the state. This region is a beautiful, rolling country, with a great abundance of streams.     It is more hilly and broken in its western half than in its eastern half. The elevation in the extreme northwestern Missouri is about . and in the extreme northeastern portion about ., while the rim of the region to the southeast, along the border of the Ozark region, has an elevation of about . The valleys for the larger streams are about 42 to  deep and sometimes 42 to  wide with the country bordering them being the most broken of the region.     The smaller streams have so eroded the whole face of the country that little of the original surface plain is to be seen. The ": null
    },
    {
        "Mississippi River": "mississippi river"
    },
    {
        " runs along the length of Missouris eastern side and is skirted throughout by topographic relief of 42 to . elevation.       The Ozark region is essentially a low dome, with local faulting and minor undulations, dominated by a ridge or, more exactly, a relatively even belt of highland that runs from near the Mississippi river about ": null
    },
    {
        "Ste. Genevieve": "ste. genevieve county, missouri"
    },
    {
        " to ": null
    },
    {
        "McDonald County": "mcdonald county, missouri"
    },
    {
        " on the Arkansas border. High rocky bluffs rise precipitously on the Mississippi, sometimes to a height of  or so above the water, from the mouth of the ": null
    },
    {
        "Meramec River": "meramec river"
    },
    {
        " to Ste. Genevieve. These mark where that river cuts the Ozark ridge. Across the Mississippi River, this ridge is continued by the ": null
    },
    {
        "Shawnee Hills": "shawnee hills"
    },
    {
        " in Illinois.      The elevations of the crests in Missouri vary from 42 to . This second physiographic region comprises somewhat less than two-thirds of the area of the state. The Burlington escarpment of ": null
    },
    {
        "Mississippian": "mississippian age"
    },
    {
        " rocks, which in places is as much as 42 to  in height, runs along the western edge of the ": null
    },
    {
        "Ordovician": "ordovician"
    },
    {
        " formations and divides the region into an eastern and a western area, known respectively to physiographers as the Salem Plateau and the Springfield Plateau. ": null
    },
    {
        "Headward erosion": "headward erosion"
    },
    {
        " by the south flowing tributaries to the ": null
    },
    {
        "White River": "white river"
    },
    {
        " in northern Arkansas has created a southern escarpment to both the Springfield and Salem plateaus that runs from ": null
    },
    {
        "McDonald": "mcdonald county, missouri"
    },
    {
        " through ": null
    },
    {
        "Barry": "barry county, missouri"
    },
    {
        ", ": null
    },
    {
        "Stone": "stone county, missouri"
    },
    {
        ", ": null
    },
    {
        "Christian": "christian county, missouri"
    },
    {
        ", ": null
    },
    {
        "Douglas": "douglas county, missouri"
    },
    {
        ", and ": null
    },
    {
        "Howell": "howell county, missouri"
    },
    {
        " counties. To the south of this escarpment lies some of the more rugged and highly dissected parts of the Missouri Ozarks. The famed ": null
    },
    {
        "Shepherd of the Hills": "shepherd of the hills"
    },
    {
        " region near ": null
    },
    {
        "Branson": "branson, missouri"
    },
    {
        " lies within this rugged area. To the east of the ": null
    },
    {
        "West Plains": "west plains, missouri"
    },
    {
        " plain lies the dissected valleys of the ": null
    },
    {
        "Eleven Point River": "eleven point river"
    },
    {
        " and the ": null
    },
    {
        "Current River": "current river"
    },
    {
        ".     Superficially, each is a simple rolling plateau, much broken by erosion , especially in the east, and dotted with hills. Some of these are residual outliers of the eroded ": null
    },
    {
        "Mississippian": "mississippian age"
    },
    {
        " limestone": "limestone"
    },
    {
        "s to the west, and others are the summits of a ": null
    },
    {
        "Precambrian": "precambrian"
    },
    {
        " topography above and around which ": null
    },
    {
        "sedimentary": "sedimentary"
    },
    {
        " formations were deposited and then eroded. There is no arrangement in chains, but only scattered rounded peaks and short ridges, with winding valleys about them.     The two highest points in the state are ": null
    },
    {
        "Taum Sauk Mountain": "taum sauk mountain"
    },
    {
        " at  in the ": null
    },
    {
        "St. Francois Mountains": "saint francois mountains"
    },
    {
        " in ": null
    },
    {
        "Iron County": "iron county, missouri"
    },
    {
        " and Lead Hill just east of the community of ": null
    },
    {
        "Cedar Gap": "cedar gap, missouri"
    },
    {
        " at  in the southwestern corner of ": null
    },
    {
        "Wright County": "wright county, missouri"
    },
    {
        ".   Few localities have an elevation exceeding . Rather broad, smooth valleys, well degraded hills with rounded summits, and despite the escarpments generally smooth contours and sky-lines, characterize the bulk of the Ozark region.         The third region, the lowlands of the south-east and part of the Mississippi Alluvial Plain, has an area of some . It is an undulating country, for the most part well drained, but swampy in its lowest portions. The Mississippi is skirted with lagoons, lakes and morasses from Ste. Genevieve to the ": null
    },
    {
        "Arkansas": "arkansas"
    },
    {
        " border, and in places is confined by levees. These lowlands are the northernmost extent of the ": null
    },
    {
        "Mississippi embayment": "mississippi embayment"
    },
    {
        ". The area is within the ": null
    },
    {
        "New Madrid Seismic Zone": "new madrid seismic zone"
    },
    {
        " and includes the ": null
    },
    {
        "epicenter": "epicenter"
    },
    {
        " location of the ": null
    },
    {
        "42–42 New Madrid earthquakes": "1811–12 new madrid earthquakes"
    },
    {
        " at ": null
    },
    {
        "New Madrid, Missouri": "new madrid, missouri"
    },
    {
        ".          The drainage of the state is wholly into the ": null
    },
    {
        "Mississippi River": "mississippi river"
    },
    {
        ", directly or indirectly, and to a large extent into either that river or the ": null
    },
    {
        "Missouri River": "missouri river"
    },
    {
        " within the borders of the state. The latter stream, crossing the state and cutting the eastern and western borders at or near St Louis and Kansas City respectively, has a length within Missouri of . The areas drained into the Mississippi outside the state through the ": null
    },
    {
        "St. Francis": "st. francis river"
    },
    {
        ", ": null
    },
    {
        "White": "white river"
    },
    {
        " and other minor streams are relatively small. The larger streams of the ": null
    },
    {
        "Ozark": "the ozarks"
    },
    {
        " dome are of decided interest to the physiographer. Those of the White system have open trough valleys bordered by hills in their upper courses and canyons in their lower courses.     Both the Ozark region and the northern plain region are divided by minor escarpments into ten or twelve sub-regions. There are remarkable differences in the drainage areas of their two sides, with interesting illustrations of shifting water-partings; and the ": null
    },
    {
        "White": "white river"
    },
    {
        ", ": null
    },
    {
        "Gasconade": "gasconade river"
    },
    {
        ", ": null
    },
    {
        "Osage": "osage river"
    },
    {
        " and other rivers are remarkable for upland meanders, lying, not on flood-plains, but around the spurs of a highland country. These ": null
    },
    {
        "incised meander": "entrenched river"
    },
    {
        "s have been interpreted to have formed by downward erosion after uplift of an older ": null
    },
    {
        "peneplain": "peneplain"
    },
    {
        " surface.     Many streams in Missouri are called rivers though they are small enough perhaps to be called creeks . This is due to a direct translation of the French word rivière which implies a stream size smaller than the French word fleuve , meaning a river that flows to the sea . An example of this is ": null
    },
    {
        "Loutre River": "loutre river"
    },
    {
        " , from Rivière Loutre , or Otter Stream .             The Ozarks region has a well-developed ": null
    },
    {
        "karst": "karst"
    },
    {
        " topography with numerous areas of ": null
    },
    {
        "sinkhole": "sinkhole"
    },
    {
        "s, ": null
    },
    {
        "stream capture": "losing stream"
    },
    {
        ", and ": null
    },
    {
        "cave": "cave"
    },
    {
        "rn development.     Caves, within areas of ": null
    },
    {
        "limestone": "limestone"
    },
    {
        " and ": null
    },
    {
        "dolomite": "dolomite"
    },
    {
        " bedrock, occur in great numbers in and near the Ozark Mountain region in the southwestern part of Missouri. More than a hundred have been discovered in ": null
    },
    {
        "Stone County": "stone county, missouri"
    },
    {
        " alone, and there are many in ": null
    },
    {
        "Christian": "christian county, missouri"
    },
    {
        ", ": null
    },
    {
        "Greene": "greene county, missouri"
    },
    {
        " and ": null
    },
    {
        "McDonald": "mcdonald county, missouri"
    },
    {
        " counties.     ": null
    },
    {
        "Marvel Cave": "marvel cave"
    },
    {
        " is located a short distance southeast of the center of Stone county. The entrance originally was through a large sink-hole at the top of Roark Mountain, though now an easier entrance has been made. Marvel Cave has a large hall-like room about  long and about  wide with bluish-grey limestone walls, and a vaulted roof, rising from 42 to . Due to its acoustic properties the room has been named the Auditorium. At one end is a large stalagmite formation about  in height and about  in girth, called the White Throne.     Exploration of ": null
    },
    {
        "Jacobs Cavern": "jacobs cavern"
    },
    {
        ", near ": null
    },
    {
        "Pineville": "pineville, missouri"
    },
    {
        ", ": null
    },
    {
        "McDonald": "mcdonald county, missouri"
    },
    {
        " county, revealed human and animal skeletons along with crude implements. Crystal Cave, near Joplin, ": null
    },
    {
        "Jasper": "jasper county, missouri"
    },
    {
        " county, has its entire surface lined with ": null
    },
    {
        "calcite": "calcite"
    },
    {
        " crystals and scalenohedron formations, from 42 to  in length.     Other caves include Friedes Cave, about six miles northeast of ": null
    },
    {
        "Rolla": "rolla, missouri"
    },
    {
        ", ": null
    },
    {
        "Phelps County": "phelps county, missouri"
    },
    {
        " and ": null
    },
    {
        "Mark Twain Cave": "mark twain cave"
    },
    {
        " ": null
    }
]