[
    {
        "     Ethiopia is located in the ": null
    },
    {
        "Horn of Africa": "horn of africa"
    },
    {
        ". It is bordered by ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        " to the north, ": null
    },
    {
        "Djibouti": "djibouti"
    },
    {
        " and ": null
    },
    {
        "Somalia": "somalia"
    },
    {
        " to the east, ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        " and ": null
    },
    {
        "South Sudan": "south sudan"
    },
    {
        " to the west, and ": null
    },
    {
        "Kenya": "kenya"
    },
    {
        " to the south. ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        " has a high central plateau that varies from  above sea level, with the highest mountain reaching .     Elevation is generally highest just before the point of descent to the ": null
    },
    {
        "Great Rift Valley": "great rift valley, ethiopia"
    },
    {
        ", which splits the plateau diagonally. A number of rivers cross the plateau; notably the ": null
    },
    {
        "Blue Nile": "blue nile"
    },
    {
        " rising from ": null
    },
    {
        "Lake Tana": "lake tana"
    },
    {
        ". The plateau gradually slopes to the lowlands of the Sudan on the west and the Somali-inhabited plains to the east.                 Between the valley of the Upper ": null
    },
    {
        "Nile": "nile"
    },
    {
        " and Ethiopias border with ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        " and South Sudan is a region of elevated ": null
    },
    {
        "plateau": "plateau"
    },
    {
        "s from which rise the various tablelands and mountains that constitute the ": null
    },
    {
        "Ethiopian Highlands": "ethiopian highlands"
    },
    {
        ". On nearly every side, the walls of the plateaus rise abruptly from the ": null
    },
    {
        "plain": "plain"
    },
    {
        "s, constituting outer mountain chains. The highlands are thus a clearly marked geographic division. In ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        ", the eastern wall of this plateau runs parallel to the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        " from ": null
    },
    {
        "Ras Kasar": "ras kasar"
    },
    {
        "  to ": null
    },
    {
        "Annesley Bay": "annesley bay"
    },
    {
        "  . It then turns due south into Ethiopia and follows closely the line of ": null
    },
    {
        "42° E": "40th meridian east"
    },
    {
        " for some .     About ": null
    },
    {
        "42° N": "9th parallel north"
    },
    {
        " there is a break in the wall, through which the ": null
    },
    {
        "Awash River": "awash river"
    },
    {
        " flows eastward. The main range at this point trends southwest, while south of the Awash Valley, which is some  below the level of the mountains, another ": null
    },
    {
        "massif": "massif"
    },
    {
        " rises in a direct line south. This second range sends a chain  eastward toward the ": null
    },
    {
        "Gulf of Aden": "gulf of aden"
    },
    {
        ".     The two chief eastern ranges maintain a parallel course south by west, with a broad upland valley in between — in which valley are a series of lakes — to about ": null
    },
    {
        "42° N": "3rd parallel north"
    },
    {
        ", the outer spurs of the plateau still keeping along the line of ": null
    },
    {
        "42° E": "40th meridian east"
    },
    {
        ". The southern escarpment of the plateau is highly irregular, but has a general direction northwest and southeast from ": null
    },
    {
        "42° N": "6th parallel north"
    },
    {
        " to ": null
    },
    {
        "42° N": "3rd parallel north"
    },
    {
        ". It overlooks the depression in which is ": null
    },
    {
        "Lake Turkana": "lake turkana"
    },
    {
        " and — east of that lake — the southern ": null
    },
    {
        "Debub Omo Zone": "debub omo zone"
    },
    {
        " .     The western wall of the plateau from ": null
    },
    {
        "42° N": "6th parallel north"
    },
    {
        " to ": null
    },
    {
        "42° N": "11th parallel north"
    },
    {
        " is well marked and precipitous. North of ": null
    },
    {
        "42° N": "11th parallel north"
    },
    {
        " the hills turn more to the east and fall more gradually to the ": null
    },
    {
        "East Sudanian savanna": "east sudanian savanna"
    },
    {
        " plains at their base. On its northern face, the plateau falls in terraces to the level of the eastern Sudan.     The eastern escarpment is the best defined of these outer ranges. It has a mean height of , and in many places rises almost perpendicularly from the plain. Narrow and deep clefts, through which descend mountain torrents that lose themselves in the sandy soil of the Eritrean coast, afford means of reaching the plateau, or the easier route through the Awash Valley may be chosen. On surmounting this rocky barrier, the traveller finds that the encircling rampart rises little above the normal level of the plateau.     The physical aspect of the highlands is impressive. The northern portion lies mainly between ": null
    },
    {
        "42°": "10th parallel north"
    },
    {
        " and ": null
    },
    {
        "42° N": "15th parallel north"
    },
    {
        ". It consists of a huge mass of ": null
    },
    {
        "Archaean": "archean"
    },
    {
        " rocks with a mean height of  above sea level, and is flooded in a deep central depression by the waters of ": null
    },
    {
        "Lake Tana": "lake tana"
    },
    {
        ". Above the plateau rise several irregular and generally ill-defined mountain ranges which attain altitudes of from  to just under . Many of the mountains are of unusual shape.     Characteristic of the country are the enormous ": null
    },
    {
        "fissures": "canyon"
    },
    {
        " which divide it, formed over time by the ": null
    },
    {
        "erosive": "erosion"
    },
    {
        " action of water. They are the valleys of the rivers, which rising on the uplands or mountain sides, have cut their way to the surrounding lowlands. Some of the valleys are of considerable width; in other cases the opposite walls of the gorges are but two or three hundred meters apart, and fall almost vertically thousands of meters, representing an erosion of many hundred thousands cubic metres of hard rock. One result of the action of the water has been the formation of numerous isolated flat-topped hills or small plateaus, known as  ambas , with nearly perpendicular sides.     The highest peaks are found in the ": null
    },
    {
        "Semien": "semien mountains"
    },
    {
        " and ": null
    },
    {
        "Bale": "bale mountains"
    },
    {
        " ranges. The Semien Mountains lie northeast of Lake Tana and culminate in the snow-covered peak of ": null
    },
    {
        "Ras Dashen": "ras dashen"
    },
    {
        ", which has an altitude of . A few kilometers east and north respectively of Ras Dashen are Mounts ": null
    },
    {
        "Biuat": "mount biuat"
    },
    {
        " and ": null
    },
    {
        "Abba Yared": "mount abba yared"
    },
    {
        ", whose summits are less than  below that of Ras Dashen.     The Bale Mountains are separated from the larger part of the Ethiopian highlands by the ": null
    },
    {
        "Great Rift Valley": "great rift valley, ethiopia"
    },
    {
        ", one of the longest and most profound chasms in Ethiopia. The highest peaks of that range include ": null
    },
    {
        "Tullu Demtu": "mount tullu demtu"
    },
    {
        ", the second-highest mountain in Ethiopia , ": null
    },
    {
        "Batu": "mount batu"
    },
    {
        " , ": null
    },
    {
        "Chilalo": "mount chilalo"
    },
    {
        "  and ": null
    },
    {
        "Mount Kaka": "mount kaka"
    },
    {
        " .     Parallel with the eastern escarpment are the heights of ": null
    },
    {
        "Biala": "mount biala"
    },
    {
        ", , ": null
    },
    {
        "Mount Abuna Yosef": "mount abuna yosef"
    },
    {
        ", , and ": null
    },
    {
        "Kollo": "kollo"
    },
    {
        ", , the last-named being southwest of ": null
    },
    {
        "Magdala": "magdala, ethiopia"
    },
    {
        ". Between Lake Tana and the eastern hills are Mounts ": null
    },
    {
        "Guna": "mount guna"
    },
    {
        ", , and ": null
    },
    {
        "Uara Sahia": "mount uara sahia"
    },
    {
        ", . In the ": null
    },
    {
        "Choqa Mountains": "choqa mountains"
    },
    {
        " of ": null
    },
    {
        "Misraq Gojjam": "misraq gojjam zone"
    },
    {
        ", ": null
    },
    {
        "Mount Choqa": "mount choqa"
    },
    {
        " attains a height of .     Below ": null
    },
    {
        "42° N": "10th parallel north"
    },
    {
        ", the southern portion of the highlands has more open tableland than the northern portion and fewer lofty peaks. Though there are a few heights between , the majority do not exceed , but the general character of the southern regions is the same as in the north: a much-broken hilly plateau.     East of the highlands towards the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        " there is a strip of lowland semi-desert, the ": null
    },
    {
        "Ethiopian xeric grasslands and shrublands": "ethiopian xeric grasslands and shrublands"
    },
    {
        ".             Most of the Ethiopian uplands have a decided slope to the northwest, so that nearly all the large rivers flow in that direction to the ": null
    },
    {
        "Nile": "nile"
    },
    {
        ", comprising some 42% of its water. Such are the ": null
    },
    {
        "Tekezé River": "tekezé river"
    },
    {
        " in the north, the ": null
    },
    {
        "Abay": "abay river"
    },
    {
        " in the center, and the ": null
    },
    {
        "Sobat": "sobat river"
    },
    {
        " in the south, and about four-fifths of the entire drainage is discharged through these three arteries. Another large river is the south-flowing ": null
    },
    {
        "Omo": "omo river"
    },
    {
        ", with 42% of the entire drainage the largest river outside the above-mentioned three main arteries discharging to the west, and by far the main feeder of the ": null
    },
    {
        "endorheic": "closed basin"
    },
    {
        " Turkana Basin": "turkana basin"
    },
    {
        " with ": null
    },
    {
        "Lake Turkana": "lake turkana"
    },
    {
        ". The rest is carried off by the ": null
    },
    {
        "Awash": "awash river"
    },
    {
        ", which runs out in the saline lacustrine district along the border with ": null
    },
    {
        "Djibouti": "djibouti"
    },
    {
        "; by the ": null
    },
    {
        "Shebelle River": "shebelle river"
    },
    {
        " and the ": null
    },
    {
        "Jubba": "jubba river"
    },
    {
        ", which flow southeast through ": null
    },
    {
        "Somalia": "somalia"
    },
    {
        ", though the Shebelle most often fails to reach the ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        ".     The Tekezé River, which is the true upper course of the ": null
    },
    {
        "Atbarah River": "atbarah river"
    },
    {
        ", has its headwaters in the central tableland; and falls from about . in the tremendous crevasse through which it sweeps west, north, forming part of the border with Eritrea, and west again down to the western terraces, where it passes from Ethiopia to Sudan. During the rains the Tekezé rises some  above its normal level, and at this time forms an impassable barrier between the northern and central regions. In its lower course, the river is known by the ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        " name ": null
    },
    {
        "Setit": "setit"
    },
    {
        ".     In Sudan, the Setit is joined  by the Atbarah, a river formed by several streams which rise in the mountains west and northwest of ": null
    },
    {
        "Lake Tana": "lake tana"
    },
    {
        ". The Gash or ": null
    },
    {
        "Mareb": "mareb river"
    },
    {
        ", which forms part of the border with ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        ", is the most northerly of the highland rivers which flow toward the Nile valley. Its headwaters rise on the landward side of the eastern escarpment within 42  km of Annesley Bay on the Red Sea. It reaches the Sudanese plains near ": null
    },
    {
        "Kassala": "kassala"
    },
    {
        ", beyond which place its waters are dissipated in the sandy soil. The Mareb is dry for a great part of the year, but like the Takazze is subject to sudden freshets during the rainy season. Only the left bank of the upper course of the river is in Ethiopian territory.        The Abay — that is, the upper course of the Blue Nile — has its source near ": null
    },
    {
        "Mount Denguiza": "mount denguiza"
    },
    {
        " in the Choqa mountains, around . It first flows for  nearly due north to the south shore of Lake Tana. Tana, which stands  below the normal level of the plateau, has somewhat the physical aspect of a flooded crater. It has an area of about , and a depth in some parts of . At the southeast corner the rim of the crater is, as it were, breached by a deep crevasse through which the Abay escapes, and here makes a great semicircular bend like that of the Tekezé, but in the reverse direction — east, south and north-west — down to the plains of ": null
    },
    {
        "Sennar": "sennar"
    },
    {
        ", where it takes the name of Bahr-el-Azrak or ": null
    },
    {
        "Blue Nile": "blue nile"
    },
    {
        ".     The Abay has many tributaries. Of these, the ": null
    },
    {
        "Bashilo": "bashilo river"
    },
    {
        " rises near Magdala and drains eastern ": null
    },
    {
        "Amhara": "amhara region"
    },
    {
        "; the ": null
    },
    {
        "Jamma": "jamma river"
    },
    {
        " rises near Ankober and drains northern ": null
    },
    {
        "Shoa": "shoa, ethiopia"
    },
    {
        "; the ": null
    },
    {
        "Muger": "muger river"
    },
    {
        " rises near ": null
    },
    {
        "Addis Ababa": "addis ababa"
    },
    {
        " and drains south-western ": null
    },
    {
        "Shoa": "shoa, ethiopia"
    },
    {
        "; the ": null
    },
    {
        "Didessa": "didessa river"
    },
    {
        ", the largest of the Abays affluents, rises in the ": null
    },
    {
        "Kaffa": "kaffa"
    },
    {
        " hills and has a generally south-to-north course; the ": null
    },
    {
        "Dabus": "dabus river"
    },
    {
        " runs near the western edge of the plateau escarpment. All these are perennial rivers. The right-hand tributaries, rising mostly on the western sides of the plateau, have steep slopes and are generally torrential in character. The ": null
    },
    {
        "Beles": "beles river"
    },
    {
        ", however, is perennial, and the ": null
    },
    {
        "Rahad": "rahad river"
    },
    {
        " and ": null
    },
    {
        "Dinder": "dinder river"
    },
    {
        " are important rivers in flood-time.     In the mountains and plateaus of ": null
    },
    {
        "Gambela": "gambela region"
    },
    {
        " and Kaffa in southwestern Ethiopia rise the ": null
    },
    {
        "Baro": "baro river"
    },
    {
        ", ": null
    },
    {
        "Gelo": "gelo river"
    },
    {
        ", ": null
    },
    {
        "Akobo": "akobo river"
    },
    {
        " and other chief affluents of the Sobat tributary of the Nile. The Akobo, in about , joins the ": null
    },
    {
        "Pibor": "pibor river"
    },
    {
        ", which in about  unites with the Baro, the river below the confluence taking the name of Sobat. These rivers descend from the mountains in great falls, and like the other Ethiopian streams are unnavigable in their upper courses. The Baro on reaching the plain becomes, however, a navigable stream affording an open waterway to the Nile. The Baro, Pibor and Akobo form for  the western and southwestern frontiers of Ethiopia.     The chief river of Ethiopia flowing east is the ": null
    },
    {
        "Awash River": "awash river"
    },
    {
        " , which rises in the Shewan uplands and makes a semicircular bend first southeast and then northeast. It reaches the ": null
    },
    {
        "Afar Depression": "afar depression"
    },
    {
        " through a broad breach in the eastern escarpment of the plateau, beyond which it is joined on its left bank by its chief affluent, the ": null
    },
    {
        "Germama": "germama river"
    },
    {
        " , and then trends round in the direction of the ": null
    },
    {
        "Gulf of Tadjoura": "gulf of tadjoura"
    },
    {
        ". Here the Awash is a copious stream nearly  wide and  deep, even in the dry season, and during the floods rising  above low-water mark, thus inundating the plains for many kilometers along both its banks.     After a winding course of about , the Awash River passes through a series of badds to ": null
    },
    {
        "Lake Abhe Bad": "lake abhe bad"
    },
    {
        " on the border with Djibouti and some  from the head of the Gulf of Tadjoura. In this lake the Awash river is lost. This remarkable phenomenon is explained by the position of Abhe Bad in the centre of a saline lacustrine depression several hundred meters below sea level. While most of the other lagoons are highly saline, with thick incrustations of salt round their margins, Abhe Bad remains fresh throughout the year, owing to the great body of water discharged into it by the Awash.     Another lacustrine region extends from the Shoan heights southwest to the Samburu depression. In this chain of scenic upland lakes — some fresh, some ": null
    },
    {
        "brackish": "brackish water"
    },
    {
        ", some completely closed, others connected by short channels — the chief links in their order from north to south are: ": null
    },
    {
        "Zway": "lake zway"
    },
    {
        ", communicating southwards with Hara and Lamina, all in the ": null
    },
    {
        "Arsi Zone": "arsi zone"
    },
    {
        "; then ": null
    },
    {
        "Abijatta": "lake abijatta"
    },
    {
        " with an outlet to a smaller turn to the Baroda and Gamo areas, skirted on the west sides by grassy slopes and wooded ranges from  to nearly  high; lastly, ": null
    },
    {
        "Lake Chew Bahir": "lake chew bahir"
    },
    {
        " which is completely closed and falling to a level of about  above sea level.     To the same system belongs the neighbouring Lake Turkana, which is larger than all the rest put together. This lake receives at its northern end the waters of the Omo, which rises in the Shoan highlands and is a perennial river with many affluents. In its course of some  it has a total fall of about , from  at its source to c.  at lake levelthe other is ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        "ograp": "ograp"
    },
    {
        "p; in Eritr": "p; in eritr"
    },
    {
        "Ashangi group": "ashangi basalts"
    },
    {
        "Magdala groupprobably Tertiarybelgmeher": null
    },
    {
        "gi": "gi"
    },
    {
        "gnarled and stunted, these flourish most on the eastern foothillsthe Natal yellow pine, which resists the attacks of the white ant ": null
    },
    {
        "u": "u"
    },
    {
        "trus aurantifol": "trus aurantifol"
    },
    {
        "rare": null
    },
    {
        "im": "im"
    },
    {
        "both rather rarethe most common—it has long thin legs and a camel-like necklandlocked42 est.42domestic/industrial/agricultural42%/42%/42%42": null
    }
]