[
    {
        "        The geography of Iraq  is diverse and falls into five main regions: the desert , ": null
    },
    {
        "Upper Mesopotamia": "upper mesopotamia"
    },
    {
        " , the northern highlands of Iraq, ": null
    },
    {
        "Lower Mesopotamia": "lower mesopotamia"
    },
    {
        ", and the ": null
    },
    {
        "alluvial plain": "alluvial plain"
    },
    {
        " extending from around ": null
    },
    {
        "Tikrit": "tikrit"
    },
    {
        " to the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ".     The mountains in the northeast are an extension of the alpine system that runs eastward from the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " through southern ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ", northern Iraq, ": null
    },
    {
        "Iran": "iran"
    },
    {
        ", and ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        ", eventually reaching the ": null
    },
    {
        "Himalayas": "himalayas"
    },
    {
        ". The ": null
    },
    {
        "desert": "desert"
    },
    {
        " is in the southwest and central provinces along the borders with ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        " and ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " and geographically belongs with the ": null
    },
    {
        "Arabian Peninsula": "arabian peninsula"
    },
    {
        ".       Most geographers, including those of the Iraqi government, discuss the countrys geography in terms of four main zones or regions: the ": null
    },
    {
        "desert": "desert"
    },
    {
        " in the west and southwest; the rolling upland between the upper Tigris and Euphrates rivers ; the highlands in the north and northeast; and the alluvial plain through which the Tigris and Euphrates flow.   Iraqs official statistical reports give the total land area as , whereas a ": null
    },
    {
        "United States Department of State": "united states department of state"
    },
    {
        " publication gives the area as .          The uplands region, between the Tigris north of ": null
    },
    {
        "Samarra": "samarra"
    },
    {
        " and the Euphrates north of ": null
    },
    {
        "Hit": "hit, iraq"
    },
    {
        ", is known as ": null
    },
    {
        "Al Jazira": "al-jazira, mesopotamia"
    },
    {
        " and is part of a larger area that extends westward into Syria between the two rivers and into ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ". Water in the area flows in deeply cut valleys, and ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        " is much more difficult than it is in the lower plain. The southwest areas of this zone are classified as desert or semi-desert. The northern parts, which include such places like the ": null
    },
    {
        "Nineveh Plains": "nineveh plains"
    },
    {
        ", ": null
    },
    {
        "Duhok": "duhok"
    },
    {
        " and ": null
    },
    {
        "Zakho": "zakho"
    },
    {
        ", mainly consist of ": null
    },
    {
        "Mediterranean": "mediterranean shrub"
    },
    {
        " vegetation. The vegetation cyclically dries out and appear brown in the virtually arid summer and flourish in the wet winter.            An ": null
    },
    {
        "Alluvial plain": "alluvial plain"
    },
    {
        " begins north of ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        " and extends to the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ". Here the Tigris and Euphrates rivers lie above the level of the plain in many places, and the whole area is a ": null
    },
    {
        "river delta": "river delta"
    },
    {
        " interlaced by the channels of the two rivers and by irrigation canals. Intermittent ": null
    },
    {
        "lake": "lake"
    },
    {
        "s, fed by the rivers in flood, also characterize southeastern Iraq. A fairly large area  just above the confluence of the two rivers at ": null
    },
    {
        "Al Qurnah": "al qurnah"
    },
    {
        " and extending east of the Tigris beyond the Iranian border is marshland, known as ": null
    },
    {
        "Hawr al Hammar": "hawr al hammar"
    },
    {
        ", the result of centuries of flooding and inadequate drainage. Much of it is permanent marsh, but some parts dry out in early winter, and other parts become marshland only in years of great flood.     Because the waters of the Tigris and Euphrates above their confluence are heavily ": null
    },
    {
        "silt": "silt"
    },
    {
        "- laden, ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        " and fairly frequent flooding deposit large quantities of silty loam in much of the delta area. Windborne silt contributes to the total deposit of sediments. It has been estimated that the delta plains are built up at the rate of nearly twenty centimeters in a century. In some areas, major floods lead to the deposit in temporary lakes of as much as thirty centimeters of mud.     The Tigris and Euphrates also carry large quantities of ": null
    },
    {
        "salt": "salt"
    },
    {
        "s. These, too, are spread on the land by sometimes excessive irrigation and flooding. A high ": null
    },
    {
        "water table": "water table"
    },
    {
        " and poor surface and subsurface drainage tend to concentrate the salts near the surface of the soil. In general, the salinity of the soil increases from Baghdad south to the Persian Gulf and severely limits productivity in the region south of ": null
    },
    {
        "Al Amarah": "al amarah"
    },
    {
        ". The ": null
    },
    {
        "salinity": "salinity"
    },
    {
        " is reflected in the large lake in central Iraq, southwest of Baghdad, known as ": null
    },
    {
        "Bahr al Milh": "bahr al milh"
    },
    {
        " . There are two other major lakes in the country to the north of Bahr al Milh: ": null
    },
    {
        "Buhayrat ath Tharthar": "buhayrat ath tharthar"
    },
    {
        " and ": null
    },
    {
        "Buhayrat al Habbaniyah": "buhayrat al habbaniyah"
    },
    {
        ".          Between Upper and Lower Mesopotamia is the urban area surrounding ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        ". These ": null
    },
    {
        "Baghdad Belts": "baghdad belts"
    },
    {
        " can be described as the provinces adjacent to the Iraqi capital and can be divided into four quadrants: northeast, southeast, southwest, and northwest. Beginning in the north, the belts include the province of ": null
    },
    {
        "Saladin": "saladin governorate"
    },
    {
        ", clockwise to Baghdad province, ": null
    },
    {
        "Diyala": "diyala governorate"
    },
    {
        " in the northeast, ": null
    },
    {
        "Babil": "babil governorate"
    },
    {
        " and ": null
    },
    {
        "Wasit": "wasit governorate"
    },
    {
        " in the southeast and around to ": null
    },
    {
        "Al Anbar": "al anbar governorate"
    },
    {
        " in the west.          The northeastern highlands begin just south of a line drawn from ": null
    },
    {
        "Mosul": "mosul"
    },
    {
        " to ": null
    },
    {
        "Kirkuk": "kirkuk"
    },
    {
        " and extend to the borders with ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        " and ": null
    },
    {
        "Iran": "iran"
    },
    {
        ". High ground, separated by broad, undulating ": null
    },
    {
        "steppe": "steppe"
    },
    {
        "s, gives way to mountains ranging from  near the Iranian and Turkish borders. Except for a few valleys, the mountain area proper is suitable only for grazing in the foothills and steppes; adequate soil and rainfall, however, make cultivation possible. Here, too, are the great oil fields near Mosul and Kirkuk. The northeast is the homeland of most Iraqi ": null
    },
    {
        "Kurd": "kurd"
    },
    {
        "s.            The desert zone, an area lying west and southwest of the Euphrates River, is a part of the ": null
    },
    {
        "Syrian Desert": "syrian desert"
    },
    {
        " and ": null
    },
    {
        "Arabian Desert": "arabian desert"
    },
    {
        ", which covers sections of ": null
    },
    {
        "Syria": "syria"
    },
    {
        ", ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        ", and ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        " and most of the ": null
    },
    {
        "Arabian Peninsula": "arabian peninsula"
    },
    {
        ".   The region, sparsely inhabited by pastoral ": null
    },
    {
        "bedouins": "bedouins"
    },
    {
        ", consists of a wide stony plain interspersed with rare sandy stretches. A widely ramified pattern of ": null
    },
    {
        "wadi": "wadi"
    },
    {
        "s–watercourses that are dry most of the year–runs from the border to the Euphrates. Some ": null
    },
    {
        "wadis": "wadi"
    },
    {
        "are over  long and carry brief but torrential floods during the winter rains.     Western and southern Iraq is a vast desert region covering some 64,900 square miles , almost two-fifths of the country.   The western desert, an extension of the Syrian Desert, rises to elevations above 1,600 feet .   The southern desert is known as Al-Hajarah in the western part and as Al-Dibdibah in the east. Both deserts are part of the Arabian Desert.   Al Hajarah has a complex topography of rocky desert, wadis, ridges, and depressions.   Al-Dibdibah is a more sandy region with a covering of scrub vegetation. Elevation in the southern desert averages between 1,000 and 2,700 feet .   A height of 3,119 feet is reached at Mount Unayzah at the intersection of the borders of Jordan, Iraq and Saudi Arabia.   The deep Wadi Al-Batin runs 45 miles in a northeast-southwest direction through Al-Dibdibah. It has been recognized since 1913 as the boundary between western ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " and Iraq.          The Euphrates originates in Turkey, is augmented by the ": null
    },
    {
        "Balikh": "balikh river"
    },
    {
        " and ": null
    },
    {
        "Khabur": "khabur"
    },
    {
        " rivers in Syria, and enters Iraq in the northwest. Here it is fed only by the wadis of the western desert during the winter rains. It then winds through a gorge, which varies from two to 16 kilometers in width, until it flows out on the plain at ": null
    },
    {
        "Ar Ramadi": "ar ramadi"
    },
    {
        ". Beyond there the Euphrates continues to the ": null
    },
    {
        "Hindiya Barrage": "hindiya barrage"
    },
    {
        ", which was constructed in 1914 to divert the river into the Hindiyah Channel; the present day Shatt al Hillah had been the main channel of the Euphrates before 1914. Below ": null
    },
    {
        "Al Kifl": "al kifl"
    },
    {
        ", the river follows two channels to ": null
    },
    {
        "As-Samawah": "as-samawah"
    },
    {
        ", where it reappears as a single channel to join the Tigris at ": null
    },
    {
        "Al Qurnah": "al qurnah"
    },
    {
        ".   The Tigris also rises in Turkey but is significantly augmented by several rivers in Iraq, the most important of which are the ": null
    },
    {
        "Khabur": "khabur"
    },
    {
        ", the ": null
    },
    {
        "Great Zab": "great zab"
    },
    {
        ", the ": null
    },
    {
        "Little Zab": "little zab"
    },
    {
        ", and the ": null
    },
    {
        "Adhaim": "adhaim"
    },
    {
        ", all of which join the Tigris above Baghdad, and the ": null
    },
    {
        "Diyala": "diyala river"
    },
    {
        ", which joins it about thirty-six kilometers below the city. At the ": null
    },
    {
        "Kut Barrage": "kut barrage"
    },
    {
        " much of the water is diverted into the ": null
    },
    {
        "Shatt al-Hayy": "shatt al-hayy"
    },
    {
        ", which was once the main channel of the Tigris. Water from the Tigris thus enters the Euphrates through the Shatt al-Hayy well above the confluence of the two main channels at Al Qurnah.     Both the Tigris and the Euphrates break into a number of channels in the marshland area, and the flow of the rivers is substantially reduced by the time they come together at Al Qurnah. Moreover. the swamps act as silt traps, and the Shatt al Arab is relatively silt free as it flows south. Below ": null
    },
    {
        "Basra": "basra"
    },
    {
        ", however, the ": null
    },
    {
        "Karun River": "karun river"
    },
    {
        " enters the ": null
    },
    {
        "Shatt al Arab": "shatt al arab"
    },
    {
        " from Iran, carrying large quantities of silt that present a continuous dredging problem in maintaining a channel for ocean-going vessels to reach the port at Basra. This problem has been superseded by a greater obstacle to river traffic, however, namely the presence of several sunken hulls that have been rusting in the Shatt al Arab since early in the Iran-Iraq war.     The waters of the Tigris and Euphrates are essential to the life of the country, but they sometimes threaten it. The rivers are at their lowest level in September and October and at flood in March, April, and May when they may carry forty times as much water as at low mark. Moreover, one seasons flood may be ten or more times as great as that in another year. In 1954, for example, Baghdad was seriously threatened, and ": null
    },
    {
        "dikes": "dyke"
    },
    {
        " protecting it were nearly topped by the flooding Tigris. Since Syria built a dam on the Euphrates, the flow of water has been considerably diminished and flooding was no longer a problem in the mid-1980s. In 1988 Turkey was also constructing a dam on the Euphrates that would further restrict the water flow.     Until the mid-twentieth century, most efforts to control the waters were primarily concerned with irrigation. Some attention was given to problems of flood control and drainage before the revolution of July 14, 1958, but development plans in the 1960s and 1970s were increasingly devoted to these matters, as well as to irrigation projects on the upper reaches of the Tigris and Euphrates and the tributaries of the Tigris in the northeast. During the war, government officials stressed to foreign visitors that, with the conclusion of a peace settlement, problems of irrigation and flooding would receive top priority from the government.       Iraqi ": null
    },
    {
        "coastal waters": "coastal waters"
    },
    {
        " boast a living ": null
    },
    {
        "coral reef": "coral reef"
    },
    {
        ", covering an area of 28  km 2 in the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ", at the mouth of the ": null
    },
    {
        "Shatt al-Arab": "shatt al-arab"
    },
    {
        " river .  The coral reef was discovered by joint Iraqi–German expeditions of scientific scuba divers carried out in September 2012 and in May 2013. Prior to its discovery, it was believed that Iraq lacks coral reefs as the local turbid waters prevented the detection of the potential presence of local coral reefs. Iraqi corals were found to be adapted to one of the most extreme coral-bearing environments in the world, as the seawater temperature in this area ranges between 14 and 34  °C. The reef harbors several living stone corals, ": null
    },
    {
        "octocorals": "octocorals"
    },
    {
        ", ": null
    },
    {
        "ophiuroids": "ophiuroids"
    },
    {
        " and ": null
    },
    {
        "bivalves": "bivalves"
    },
    {
        ". There are also ": null
    },
    {
        "silica": "silica"
    },
    {
        "-containing demo-sponges.       In the rural areas of the alluvial plain and in the lower Diyala region, settlement almost invariably clusters near the rivers, streams, and irrigation canals. The bases of the relationship between watercourse and settlement have been summarized by Robert McCormick Adams, director of the Oriental Institute of the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        ". He notes that the levees laid down by streams and canals provide advantages for both settlement and agriculture. Surface water drains more easily on the levees back-slope, and the coarse soils of the levees are easier to cultivate and permit better subsurface drainage. The height of the levees gives some protection against floods and the frost that often affect low-lying areas and may kill and/or damage winter crops. Above all, those living or cultivating on the crest of a levee have easy access to water for irrigation and household use in a dry, hot country.     Although there are some isolated homesteads, most rural communities are nucleated settlements rather than dispersed farmsteads; that is, the farmer leaves his village to cultivate the fields outside it. The pattern holds for farming communities in the ": null
    },
    {
        "Kurd": "kurd"
    },
    {
        "ish highlands of the northeast as well as for those in the alluvial plain. The size of the settlement varies, generally with the volume of water available for household use and with the amount of land accessible to village dwellers. Sometimes, particularly in the lower Tigris and Euphrates valleys, ": null
    },
    {
        "soil salinity": "soil salinity"
    },
    {
        " restricts the area of arable land and limits the size of the community dependent on it, and it also usually results in large unsettled and uncultivated stretches between the villages.     Fragmentary information suggests that most farmers in the alluvial plain tend to live in villages of over 100 persons. For example, in the mid-1970s a substantial number of the residents of ": null
    },
    {
        "Baqubah": "baqubah"
    },
    {
        ", the administrative center and major city of Diyala Governorate, were employed in agriculture.     The Marsh Arabs of the south usually live in small clusters of two or three houses kept above water by ": null
    },
    {
        "rushes": "juncaceae"
    },
    {
        " that are constantly being replenished. Such clusters often are close together, but access from one to another is possible only by small boat. Here and there a few natural islands permit slightly larger clusters. Some of these people are primarily ": null
    },
    {
        "water buffalo": "domestic buffalo"
    },
    {
        " herders and lead a semi-": null
    },
    {
        "nomad": "nomad"
    },
    {
        "ic life. In the winter, when the waters are at a low point, they build fairly large temporary villages. In the summer they move their herds out of the marshes to the river banks.     The war has had its effect on the lives of these denizens of the marshes. With much of the fighting concentrated in their areas, they have either migrated to settled communities away from the marshes or have been forced by government decree to relocate within the marshes. Also, in early 1988, the marshes had become the refuge of deserters from the Iraqi army who attempted to maintain life in the fastness of the overgrown, desolate areas while hiding out from the authorities. These deserters in many instances have formed into large gangs that raid the marsh communities; this also has induced many of the marsh dwellers to abandon their villages.     The war has also affected settlement patterns in the northern ": null
    },
    {
        "Kurd": "kurd"
    },
    {
        "ish areas. There, the struggle for a Kurdish state by ": null
    },
    {
        "guerrillas": "guerrillas"
    },
    {
        " was rejected by the government as it steadily escalated violence against the local communities. Starting in 1984, the government launched a scorched-earth campaign to drive a wedge between the villagers and the ": null
    },
    {
        "guerrillas": "guerrillas"
    },
    {
        " in the remote areas of two provinces of ": null
    },
    {
        "Kurdistan": "kurdistan"
    },
    {
        " in which Kurdish guerrillas were active. In the process whole villages were torched and subsequently bulldozed, which resulted in the Kurds flocking into the regional centers of ": null
    },
    {
        "Irbil": "irbil"
    },
    {
        " and ": null
    },
    {
        "As Sulaymaniyah": "as sulaymaniyah"
    },
    {
        ". Also as a military precaution , the government has cleared a broad strip of territory in the Kurdish region along the ": null
    },
    {
        "Iran": "iran"
    },
    {
        "ian border of all its inhabitants, hoping in this way to interdict the movement of Kurdish guerrillas back and forth between Iran and Iraq. The majority of ": null
    },
    {
        "Kurd": "kurd"
    },
    {
        "ish villages, however, remained intact in early 1988.     In the arid areas of Iraq to the west and south, cities and large towns are almost invariably situated on watercourses, usually on the major rivers or their larger tributaries. In the south this dependence has had its disadvantages. Until the recent development of flood control, ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        " and other cities were subject to the threat of inundation. Moreover, the ": null
    },
    {
        "dikes": "dike"
    },
    {
        " needed for protection have effectively prevented the expansion of the urban areas in some directions. The growth of ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        ", for example, was restricted by dikes on its eastern edge. The diversion of water to the Milhat ath Tharthar and the construction of a canal transferring water from the Tigris north of Baghdad to the ": null
    },
    {
        "Diyala River": "diyala river"
    },
    {
        " have permitted the irrigation of land outside the limits of the dikes and the expansion of settlement.                The climate of Iraq is mainly a ": null
    },
    {
        "hot desert climate": "hot desert climate"
    },
    {
        " or a ": null
    },
    {
        "hot semi-arid climate": "hot semi-arid climate"
    },
    {
        " to the northernmost part. Averages high temperatures are generally above 40  °C at low elevations during summer months while averages low temperatures can drop to below 0  °C during the coldest month of the year during winter  The all-time record high temperature in Iraq of 52  °C was recorded near ": null
    },
    {
        "An Nasiriyah": "an nasiriyah"
    },
    {
        " on 2 August 2011.  Most of the rainfall occurs from December through April and averages between  annually. The mountainous region of northern Iraq receives appreciably more precipitation than the central or southern desert region, where they tend to have a ": null
    },
    {
        "Mediterranean climate": "mediterranean climate"
    },
    {
        ".     Roughly 90% of the annual rainfall occurs between November and April, most of it in the winter months from December through March. The remaining six months, particularly the hottest ones of June, July, and August, are extremely dry.     Except in the north and northeast, mean annual rainfall ranges between . Data available from stations in the foothills and steppes south and southwest of the mountains suggest mean annual rainfall between  for that area. Rainfall in the mountains is more abundant and may reach  a year in some places, but the terrain precludes extensive cultivation. Cultivation on nonirrigated land is limited essentially to the mountain valleys, foothills, and ": null
    },
    {
        "steppes": "steppes"
    },
    {
        ", which have  or more of rainfall annually. Even in this zone, however, only one crop a year can be grown, and shortages of rain have often led to crop failures.     Mean minimum temperatures in the winter range from near freezing in the northern and northeastern foothills and the western desert to  and  in the alluvial plains of southern Iraq. They rise to a mean maximum of about  in the western desert and the northeast, and  in the south. In the summer mean minimum temperatures range from about  and rise to maxima between roughly . Temperatures sometimes fall below freezing and have fallen as low as  at Ar Rutbah in the western desert. A such summer heat, even in a hot desert, is high and this can be easily explained by the very low elevations of deserts regions which experience these exceptionally searing high temperatures. In fact, the elevations of cities such as ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        " or ": null
    },
    {
        "Basra": "basra"
    },
    {
        " are near the sea level because deserts are located predominantly along the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ". Thats why some Gulfs countries like ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        ", ": null
    },
    {
        "Iran": "iran"
    },
    {
        " and ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " experience extreme heat during summer, even more extreme than the normal level. The searing summer heat only exists in low elevations in these countries while mountains and higher elevations know much more moderated summer temperatures.     The summer months are marked by two kinds of wind phenomena. The southern and southeasterly sharqi, a dry, dusty wind with occasional gusts of , occurs from April to early June and again from late September through November. It may last for a day at the beginning and end of the season but for several days at other times. This wind is often accompanied by violent duststorms that may rise to heights of several thousand meters and close airports for brief periods. From mid-June to mid-September the prevailing wind, called the ": null
    },
    {
        "shamal": "shamal"
    },
    {
        ", is from the north and northwest. It is a steady wind, absent only occasionally during this period. The very dry air brought by this shamal permits intensive sun heating of the land surface, but the breeze has some cooling effect.     The combination of rain shortage and extreme heat makes much of Iraq a desert. Because of very high rates of evaporation, soil and plants rapidly lose the little moisture obtained from the rain, and vegetation could not survive without extensive irrigation. Some areas, however, although arid, do have natural vegetation in contrast to the desert. For example, in the ": null
    },
    {
        "Zagros": "zagros"
    },
    {
        " Mountains in northeastern Iraq there is permanent vegetation, such as ": null
    },
    {
        "oak": "oak"
    },
    {
        " trees, and ": null
    },
    {
        "date palms": "date palm"
    },
    {
        "are found in the south.            In 1922 British officials concluded the Treaty of Mohammara with Abd al Aziz ibn Abd ar Rahman ": null
    },
    {
        "Al Saud": "al saud"
    },
    {
        ", who in 1932 formed the Kingdom of Saudi Arabia. The treaty provided the basic agreement for the boundary between the eventually independent nations. Also in 1922 the two parties agreed to the creation of the diamond-shaped Neutral Zone of approximately  adjacent to the western tip of Kuwait in which neither Iraq nor Saudi Arabia would build dwellings or installations. ": null
    },
    {
        "Bedouins": "bedouin"
    },
    {
        "from either country could utilize the limited water and seasonal grazing resources of the zone. In April 1975, an agreement signed in ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        " fixed the borders of the countries.     Through ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        "n mediation, Iran and Iraq agreed in March 1975 to normalize their relations, and three months later they signed a treaty known as the ": null
    },
    {
        "Algiers Accord": "1975 algiers agreement"
    },
    {
        ". The document defined the common border all along the ": null
    },
    {
        "Khawr Abd Allah": "khawr abd allah"
    },
    {
        " River ": null
    },
    {
        "estuary": "estuary"
    },
    {
        " as the ": null
    },
    {
        "thalweg": "thalweg"
    },
    {
        ". To compensate Iraq for the loss of what formerly had been regarded as its territory, pockets of territory along the mountain border in the central sector of its common boundary with Iran were assigned to it. Nonetheless, in September 1980 Iraq went to war with ": null
    },
    {
        "Iran": "iran"
    },
    {
        ", citing among other complaints the fact that Iran had not turned over to it the land specified in the ": null
    },
    {
        "Algiers Accord": "1975 algiers agreement"
    },
    {
        ". This problem has subsequently proved to be a stumbling block to a negotiated settlement of the ongoing conflict.     In 1988 the boundary with ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " was another outstanding problem. It was fixed in a 1913 treaty between the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " and ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " officials acting on behalf of ": null
    },
    {
        "Kuwaits ruling family": "politics of kuwait"
    },
    {
        ", which in 1899 had ceded control over foreign affairs to Britain. The boundary was accepted by Iraq when it became independent in 1932, but in the 1960s and again in the mid-1970s, the Iraqi government advanced a claim to parts of Kuwait. ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " made several representations to the Iraqis during the war to fix the border once and for all but ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        " repeatedly demurred, claiming that the issue is a potentially divisive one that could inflame nationalist sentiment inside Iraq. Hence in 1988 it was likely that a solution would have to wait until the war ended.     Area:   total:    land:    water:      Land boundaries:   total:    border countries: ": null
    },
    {
        "Iran": "iran"
    },
    {
        " , ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        " , ": null
    },
    {
        "Syria": "syria"
    },
    {
        " , ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        " , ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " , ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        "      Coastline:      Maritime claims:   territorial sea:    continental shelf: not specified     Terrain: mostly broad plains; reedy marshes along Iranian border in south with large flooded areas; mountains along borders with Iran and Turkey     Elevation extremes:   lowest point: Persian Gulf 0 m   highest point: ": null
    },
    {
        "Cheekah Dar": "cheekah dar"
    },
    {
        "        Natural resources: petroleum, natural gas, phosphates, sulfur     Land use:   arable land: 7.89%   permanent crops: 0.53%   other: 91.58%     Irrigated land:      Total renewable water resources:      Freshwater withdrawal :   total: 66  km 3 /yr   per capita: 2,616 m 3 /yr     While its proven ": null
    },
    {
        "oil reserves": "oil reserves"
    },
    {
        " of  ranks Iraq second in the world behind ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        ", the ": null
    },
    {
        "United States Department of Energy": "united states department of energy"
    },
    {
        " estimates that up to 90 percent of the country remains unexplored. Unexplored regions of Iraq could yield an additional . Iraqs oil production costs are among the lowest in the world. However, only about 2,000 ": null
    },
    {
        "oil wells": "oil well"
    },
    {
        "have been drilled in Iraq, compared to about 1 million wells in ": null
    },
    {
        "Texas": "texas"
    },
    {
        " alone.            Natural hazards: dust storms, sandstorms, floods     Environment - current issues: government water control projects have drained most of the inhabited marsh areas east of An Kshatriya by drying up or diverting the feeder streams and rivers; a once sizable population of Shia Muslims, who have inhabited these areas for thousands of years, has been displaced; furthermore, the destruction of the natural habitat poses serious threats to the areas wildlife populations; inadequate supplies of potable water; development of Tigris-Euphrates Rivers system contingent upon agreements with upstream riparian Turkey; air and water pollution; ": null
    },
    {
        "soil degradation": "soil retrogression and degradation"
    },
    {
        " and erosion; and ": null
    },
    {
        "desertification": "desertification"
    },
    {
        ".     Environment - international agreements:   party to: ": null
    },
    {
        "Biodiversity": "biodiversity"
    },
    {
        ", ": null
    },
    {
        "Law of the Sea": "law of the sea"
    },
    {
        ", ": null
    },
    {
        "Ozone Layer Protection": "ozone layer protection"
    },
    {
        "   signed, but not ratified: ": null
    },
    {
        "Environmental Modification": "environmental modification"
    },
    {
        "     :Major regressions:   :": null
    },
    {
        "Arabian Desert and East Sahero-Arabian xeric shrublands ": "ecoregion pa1303"
    },
    {
        "   :": null
    },
    {
        "Mesopotamian shrub desert ": "ecoregion pa1320"
    },
    {
        "   :Minor ecoregions:   :": null
    },
    {
        "Zagros Mountains forest steppe ": "zagros mountainsecology"
    },
    {
        "   :": null
    },
    {
        "Middle East steppe ": "ecoregion pa0812"
    },
    {
        "   :": null
    },
    {
        "Eastern Mediterranean conifer-sclerophyllous broadleaf forests ": "ecoregion pa1207"
    },
    {
        "   :": null
    },
    {
        "South Iran Nubo-Sindian desert and semi-desert ": "ecoregion pa1328"
    },
    {
        "   :": null
    },
    {
        "Tigris-Euphrates alluvial salt marsh ": "tigris–euphrates river system"
    },
    {
        "   :": null
    },
    {
        "Red Sea Nubo-Sindian tropical desert and semi-desert ": "ecoregion pa1325"
    },
    {
        "   :": null
    },
    {
        "Persian Gulf desert and semi-desert ": "ecoregion pa1323"
    }
]