[
    {
        "Kazakhstan  is located in ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        " and ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        " at . With an area of about 2,724,800 square kilometers, Kazakhstan is more than twice the combined size of the other four Central Asian states and 60% larger than ": null
    },
    {
        "Alaska": "alaska"
    },
    {
        ". The country borders ": null
    },
    {
        "Turkmenistan": "turkmenistan"
    },
    {
        ", ": null
    },
    {
        "Uzbekistan": "uzbekistan"
    },
    {
        ", and ": null
    },
    {
        "Kyrgyzstan": "kyrgyzstan"
    },
    {
        " to the south; ": null
    },
    {
        "Russia": "russia"
    },
    {
        " to the north; Russia and the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        " to the west; and Chinas ": null
    },
    {
        "Xinjiang Uygur Autonomous Region": "xinjiang"
    },
    {
        " to the east.             There is considerable topographical variation within Kazakhstan. The highest point is the top of the mountain ": null
    },
    {
        "Khan Tengri": "khan tengri"
    },
    {
        ", on the Kyrgyz border in the ": null
    },
    {
        "Tian Shan": "tian shan"
    },
    {
        " range, with an elevation of  above sea level; the lowest point is the bottom of the ": null
    },
    {
        "Karagiye": "karagiye"
    },
    {
        " depression at  below sea level, in the ": null
    },
    {
        "Mangystau": "mangystau"
    },
    {
        " province east of the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        ". Most of the country lies at between  above sea level, but Kazakhstans Caspian shore includes some of the lowest elevations on Earth. The peak Khan Tengri in the Tian Shan Mountains  is Kazakhstan highest elevation at  .     Many of the peaks of the ": null
    },
    {
        "Altay": "altay mountains"
    },
    {
        " and Tien Shan ranges are covered with snow, year-round, and their runoff is the source for most of Kazakhstans freshwater rivers, streams, and lakes.     Except for the ": null
    },
    {
        "Tobol": "tobol river"
    },
    {
        ", ": null
    },
    {
        "Ishim": "ishim river"
    },
    {
        ", and ": null
    },
    {
        "Irtysh": "irtysh river"
    },
    {
        " rivers , portions of which flow through Kazakhstan, all of Kazakhstans rivers and streams are part of landlocked systems. They either flow into isolated bodies of water such as the Caspian Sea or simply disappear into the steppes and deserts of central and southern Kazakhstan. Many rivers, streams, and lakes are seasonal, evaporating in summer. The three largest bodies of water are ": null
    },
    {
        "Lake Balkhash": "lake balkhash"
    },
    {
        ", a partially fresh, partially saline lake in the east, near ": null
    },
    {
        "Almaty": "almaty"
    },
    {
        ", the Caspian Sea, and the ": null
    },
    {
        "Aral Sea": "aral sea"
    },
    {
        ", all of which lie partially within Kazakhstan.     Some 9.4 percent of Kazakhstans land is mixed prairie and forest or treeless prairie, primarily in the north or in the basin of the ": null
    },
    {
        "Ural River": "ural river"
    },
    {
        " in the west. More than three-quarters of the country, including the entire west and most of the south, is either semidesert or desert . The terrain in these regions is bare, eroded, broken uplands, with sand dunes in the ": null
    },
    {
        "Qizilqum": "kyzyl kum"
    },
    {
        " and Moyunqum  deserts, which occupy south-central Kazakhstan.          The Climate in Kazakhstan is continental. In summer the temperatures average more than  and in winter average .   What is the Climate, Average Temperature/ Weather in Kazakhstan?     The climatic charts seen below are some noteworthy examples of the countrys differing climates, taken from two contrasting cities representing two different parts of the country; Aktau and the Caspian Sea shore on the countrys west having a distinct ": null
    },
    {
        "hot desert climate": "hot desert climate"
    },
    {
        ", while Petropavl features a climate typical to the rest of the country; an extreme variation of the ": null
    },
    {
        "humid continental": "humid continental"
    },
    {
        " climate known for its uneven rainfall distribution and drastic temperature ranges between seasons.     Despite the nations relatively low precipitation rates and arid geography , spring floods that can occasionally be brought on by heavy rainfall and melting snow, are not unusual in the northern and central regions of the country. In April 2017, following a winter which had left snow volumes exceeding the average by 60 percent, heavy rains wrought widespread damage and temporarily displaced thousands of people.                      The environment of Kazakhstan has been badly damaged by human activity. Most of the water in Kazakhstan is polluted by industrial effluents, pesticide and fertilizer residue, and, in some places, radioactive elements. The most visible damage has been to the ": null
    },
    {
        "Aral Sea": "aral sea"
    },
    {
        ", which as recently as the 1970s was larger than any of the ": null
    },
    {
        "Great Lakes": "great lakes"
    },
    {
        " of ": null
    },
    {
        "North America": "north america"
    },
    {
        " save ": null
    },
    {
        "Lake Superior": "lake superior"
    },
    {
        ". The sea began to shrink rapidly when sharply increased irrigation and other demands on the only significant tributaries, the ": null
    },
    {
        "Syr Darya": "syr darya"
    },
    {
        " and the ": null
    },
    {
        "Amu Darya": "amu darya"
    },
    {
        " , all but eliminated inflow. During the Soviet Era, Kazakhstan received water from ": null
    },
    {
        "Tajikistan": "tajikistan"
    },
    {
        " and ": null
    },
    {
        "Kyrgyzstan": "kyrgyzstan"
    },
    {
        ", and ": null
    },
    {
        "Uzbekistan": "uzbekistan"
    },
    {
        ", ": null
    },
    {
        "Turkmenistan": "turkmenistan"
    },
    {
        ", and Kazakhstan provided oil and gas for these two nations in return. However, after the ": null
    },
    {
        "collapse of the USSR": "collapse of the ussr"
    },
    {
        " this system had collapsed and no plan to replace this system has been put in place. According to research conducted by the ": null
    },
    {
        "International Crisis Group": "international crisis group"
    },
    {
        ", there is little political will to solve this problem despite Central Asias need for mutual resource-sharing. International Crisis Group.  , . 11 September 2014. Retrieved 6 October 2014. By 1993 the Aral Sea had lost an estimated 60 percent of its volume, in the process breaking into three unconnected segments. Increasing salinity and reduced habitat have killed the Aral Seas fish, hence destroying its once-active fishing industry, and the receding shoreline has left the former port of Aralsk more than seventy kilometers from the waters edge. The depletion of this large body of water has increased temperature variations in the region, which in turn have affected agriculture. A much greater agricultural impact, however, has come from the salt- and pesticide-laden soil that the wind is known to carry as far away as the ": null
    },
    {
        "Himalaya Mountains": "himalaya mountains"
    },
    {
        " and the ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        ". Deposition of this heavily saline soil on nearby fields effectively sterilizes them. Evidence suggests that salts, pesticides, and residues of chemical fertilizers are also adversely affecting human life around the former Aral Sea; infant mortality in the region approaches 10 percent compared with the national rate of 2.7 percent in 1991.     By contrast, the water level of the Caspian Sea has been rising steadily since 1978 for reasons that scientists have not been able to explain fully. At the northern end of the sea, more than 10,000 square kilometres of land in ": null
    },
    {
        "Atyrau Province": "atyrau province"
    },
    {
        " have been flooded. Experts estimate that if current rates of increase persist, the coastal city of Atyrau, eighty-eight other population centers, and many of Kazakhstans Caspian oil fields could be submerged by 2020.     Wind erosion has also affected the northern and central parts of the republic because of the introduction of wide-scale dryland wheat farming. During the 1950s and 1960s, much soil was lost when vast tracts of Kazakhstans prairies were plowed under as part of Khrushchevs Virgin Lands agricultural project. By the mid-1990s, an estimated 60 percent of the republics pastureland was in various stages of desertification.     Industrial pollution is a bigger concern in Kazakhstans manufacturing cities, where aging factories pump huge quantities of unfiltered pollutants into the air and groundwater. The former capital, Almaty, is particularly threatened, in part because of the postindependence boom in private automobile ownership.     The gravest environmental threat to Kazakhstan comes from radiation, especially in the ": null
    },
    {
        "Semey": "semey"
    },
    {
        " region of the northeast, where the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " tested almost 500 nuclear weapons, 116 of them above ground. Often, such tests were conducted without evacuating or even alerting the local population. Although nuclear testing was halted in 1990, radiation poisoning, birth defects, severe anemia, and ": null
    },
    {
        "leukemia": "leukemia"
    },
    {
        " are thought to be very common in the area.     With some conspicuous exceptions, lip service has been the primary official response to Kazakhstans ecological problems. In February 1989, opposition to Soviet nuclear testing and its ill effects in Kazakhstan led to the creation of one of the republics largest and most influential grass-roots movements, Nevada-Semipalatinsk, which was founded by Kazak poet and public figure ": null
    },
    {
        "Olzhas Suleymenov": "olzhas suleymenov"
    },
    {
        ". In the first week of the movements existence, Nevada-Semipalatinsk gathered more than two million signatures from Kazakhstanis of all ethnic groups on a petition to ": null
    },
    {
        "Mikhail Gorbachev": "mikhail gorbachev"
    },
    {
        " demanding the end of nuclear testing in Kazakhstan. After a year of demonstrations and protests, the test ban took effect in 1990. It remained in force in 1996, although in 1995 at least one unexploded device reportedly was still in position near Semey.     Once its major ecological objective was achieved, Nevada-Semipalatinsk made various attempts to broaden into a more general political movement; it has not pursued a broad ecological or green agenda. A very small green party, Tabigat, made common cause with the political opposition in the parliament of 1994.     The government has established a Ministry of Ecology and Bioresources, with a separate administration for ": null
    },
    {
        "radioecology": "radioecology"
    },
    {
        ", but the ministrys programs are underfunded and given low priority. In 1994 only 23 percent of budgeted funds were actually allotted to environmental programs. Many official meetings and conferences are held , but few practical programs have gone into operation. In 1994 the ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        ", the ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        " , and the ": null
    },
    {
        "United States Environmental Protection Agency": "united states environmental protection agency"
    },
    {
        " agreed to give Kazakhstan $62 million to help the country overcome ecological problems.     ; Natural hazards:   : ": null
    },
    {
        "Earthquakes": "earthquake"
    },
    {
        "in the south, and ": null
    },
    {
        "mud slides": "mud slide"
    },
    {
        "around ": null
    },
    {
        "Almaty": "almaty"
    },
    {
        "   ; Environment—current issues:   : Radioactive or toxic chemical sites associated with its former defense industries and test ranges are found throughout the country and pose health risks for human beings and animals; industrial pollution is severe in some cities; because the two main rivers which flowed into the Aral Sea have been diverted for irrigation, it is drying up and leaving behind a harmful layer of chemical pesticides and natural salts; these substances are then picked up by the wind and blown into noxious dust storms; pollution in the Caspian Sea; soil pollution from overuse of agricultural chemicals and salination from poor infrastructure and wasteful irrigation practices   ; Environment—international agreements:   : Party to: ": null
    },
    {
        "Biodiversity": "biodiversity"
    },
    {
        ", ": null
    },
    {
        "Climate Change": "united nations framework convention on climate change"
    },
    {
        ", ": null
    },
    {
        "Desertification": "desertification"
    },
    {
        ", ": null
    },
    {
        "Endangered Species": "endangered species"
    },
    {
        ", ": null
    },
    {
        "Ozone Layer Protection": "ozone layer protection"
    },
    {
        ", Ship Pollution    : Signed, but not ratified: Climate Change-": null
    },
    {
        "Kyoto Protocol": "kyoto protocol"
    },
    {
        "       ; Area:   : Total: 2,724,900 km²   : Land: 2,669,700 km²   : Water: 55,200 km²      ; Land boundaries:   : Total:    : Border countries: the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " , ": null
    },
    {
        "Kyrgyzstan": "kyrgyzstan"
    },
    {
        " , ": null
    },
    {
        "Russia": "russia"
    },
    {
        " , ": null
    },
    {
        "Turkmenistan": "turkmenistan"
    },
    {
        " , ": null
    },
    {
        "Uzbekistan": "uzbekistan"
    },
    {
        " .   ; Coastline:   : 0 km ; the country is landlocked, but despite this, Kazakhstan borders the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        " .   ; Maritime claims:   : None     ; Elevation extremes:   : Lowest point: ": null
    },
    {
        "Karagiye": "karagiye"
    },
    {
        " -132 m   : Highest point: ": null
    },
    {
        "Khan Tangiri Shyngy": "khan tangiri shyngy"
    }
]