[
    {
        "              Burkina Faso": "Burkina Faso"
    },
    {
        " is a landlocked ": null
    },
    {
        "Sahel": "Sahel"
    },
    {
        " country that shares borders with six nations. It lies between the ": null
    },
    {
        "Sahara": "Sahara"
    },
    {
        " desert and the ": null
    },
    {
        "Gulf of Guinea": "Gulf Of Guinea"
    },
    {
        ", south of the loop of the ": null
    },
    {
        "Niger River": "Niger River"
    },
    {
        ", mostly between latitudes 9° and 15°N , and longitudes 6°W and 3°E. The land is green in the south, with forests and fruit trees, and desert in the north. Most of central Burkina Faso lies on a ": null
    },
    {
        "savanna": "Savanna"
    },
    {
        " plateau,  above sea level, with fields, brush, and scattered trees. Burkina Fasos game preserves—the most important of which are ": null
    },
    {
        "Arly": "Arli National Park"
    },
    {
        ", ": null
    },
    {
        "Nazinga": "Nazinga Game Ranch"
    },
    {
        ", and ": null
    },
    {
        "W National Park": "W National Park"
    },
    {
        " & mdash;contain ": null
    },
    {
        "lion": "Panthera Leo"
    },
    {
        "s, ": null
    },
    {
        "elephant": "Elephant"
    },
    {
        "s, ": null
    },
    {
        "hippopotamus": "Hippopotamus"
    },
    {
        ", ": null
    },
    {
        "monkey": "Monkey"
    },
    {
        "s, ": null
    },
    {
        "common warthog": "Common Warthog"
    },
    {
        "s, and ": null
    },
    {
        "antelope": "Antelope"
    },
    {
        "s. Previously the endangered ": null
    },
    {
        "painted hunting dog": "Painted Hunting Dog"
    },
    {
        ", Lycaon pictus occurred in Burkina Faso, but, although the last sightings were made in ": null
    },
    {
        "Arli National Park": "Arli National Park"
    },
    {
        ", C. Michael Hogan. 2009.   the species is considered ": null
    },
    {
        "extirpated": "Local Extinction"
    },
    {
        " from Burkina Faso.       Burkina Faso has a total area of 274,200  km 2 , of which 273,800  km 2 is land and 400  km 2 water. Comparatively, it is slightly larger than ": null
    },
    {
        "New Zealand": "New Zealand"
    },
    {
        " and ": null
    },
    {
        "Colorado": "Colorado"
    },
    {
        ". Its borders total 3,611  km: ": null
    },
    {
        "Benin": "Benin"
    },
    {
        " 386  km, ": null
    },
    {
        "Ivory Coast": "Ivory Coast"
    },
    {
        " 545  km, ": null
    },
    {
        "Ghana": "Ghana"
    },
    {
        " 602  km, ": null
    },
    {
        "Mali": "Mali"
    },
    {
        " 1,325  km, ": null
    },
    {
        "Niger": "Niger"
    },
    {
        " 622  km, and ": null
    },
    {
        "Togo": "Togo"
    },
    {
        " 131  km. It has no coastline or maritime claims.       This is a list of the extreme points of ": null
    },
    {
        "Burkina Faso": "Burkina Faso"
    },
    {
        ", the points that are farther north, south, east or west than any other location.     Northernmost point – unnamed location on the border with ": null
    },
    {
        "Mali": "Mali"
    },
    {
        ", ": null
    },
    {
        "Sahel Region": "Sahel Region"
    },
    {
        " Benin": "Benin"
    },
    {
        " immediately south of the Burkina Faso-Benin-Niger ": null
    },
    {
        "tripoint": "Tripoint"
    },
    {
        ", ": null
    },
    {
        "Est Region": "Est Region"
    },
    {
        " Ivory Coast": "Ivory Coast"
    },
    {
        " immediately south of the village of ": null
    },
    {
        "Kpuere": "Kpuere"
    },
    {
        ", ": null
    },
    {
        "Sud-Ouest Region": "Sud-Ouest Region, Burkina Faso"
    },
    {
        " tripoint": "Tripoint"
    },
    {
        " with Mali and Ivory Coast, ": null
    },
    {
        "Cascades Region": "Cascades Region"
    },
    {
        "       It is made up of two major types of countryside. The larger part of the country is covered by a ": null
    },
    {
        "peneplain": "Peneplain"
    },
    {
        ", which forms a gently undulating landscape with, in some areas, a few isolated hills, the last vestiges of a Precambrian massif. The southwest of the country, on the other hand, forms a sandstone massif, where the highest peak, ": null
    },
    {
        "Ténakourou": "Ténakourou"
    },
    {
        ", is found at an elevation of . The massif is bordered by sheer cliffs up to  high. The average altitude of Burkina Faso is  and the difference between the highest and lowest terrain is no greater than . Burkina Faso is therefore a relatively flat country. Its elevation extremes are a lowest point at the ": null
    },
    {
        "Mouhoun": "Mouhoun River"
    },
    {
        "  River and highest point at ": null
    },
    {
        "Tena Kourou": "Tena Kourou"
    },
    {
        " .             The country is divided into ": null
    },
    {
        "13 administrative regions": "Regions Of Burkina Faso"
    },
    {
        ". These regions encompass ": null
    },
    {
        "45 provinces": "Provinces Of Burkina Faso"
    },
    {
        " and ": null
    },
    {
        "351 departments": "Departments Of Burkina Faso"
    },
    {
        ".       The country owes its former name of Upper Volta to three rivers which cross it: the Black Volta , the White Volta and the Red Volta . The Black Volta is one of the countrys only two rivers which flow year-round, the other being the Komoé, which flows to the southwest. The basin of the Niger River also drains 27% of the countrys surface.     The Nigers tributaries – the Béli, the Gorouol, the Goudébo and the Dargol – are seasonal streams and flow for only four to six months a year. They still, however, can cause large floods. The country also contains numerous lakes – the principal ones are Tingrela, Bam and Dem. The country contains large ponds, as well, such as Oursi, Béli, Yomboli and Markoye. Water shortages are often a problem, especially in the north of the country.             Burkina Faso has a primarily tropical climate with two very distinct seasons. In the rainy season, the country receives between 600 and 900 millimetres of rainfall; in the dry season, the ": null
    },
    {
        "harmattan": "Harmattan"
    },
    {
        " – a hot dry wind from the Sahara – blows. The rainy season lasts approximately four months, May/June to September, and is shorter in the north of the country. Three climatic zones can be defined: the Sahel, the Sudan-Sahel, and the Sudan-Guinea. The Sahel in the north typically receives less than  of rainfall per year and has high temperatures, .     A relatively dry tropical savanna, the Sahel extends beyond the borders of Burkina Faso, from the Horn of Africa to the Atlantic Ocean, and borders the Sahara to its north and the fertile region of the Sudan to the South. Situated between 11°3 and 13°5 north latitude, the Sudan-Sahel region is a transitional zone with regards to rainfall and temperature. Further to the south, the Sudan-Guinea zone receives more than  of rain each year and has cooler average temperatures.       Burkina Fasos natural resources include manganese, limestone, marble, phosphates, pumice, salt and small deposits of ": null
    },
    {
        "gold": "Mining In Burkina Faso"
    },
    {
        ". 21.93% of its land is arable, and 0.26% has permanent crops as of 2012. As of 2003, 250  km 2 were irrigated. Its total renewable water resources as of 2011 were 12.5 m 3 , with a total freshwater withdrawal of 0.72  km 3 /yr ": null
    }
]