[
    {
        "             Bermuda": "bermuda"
    },
    {
        " is an ": null
    },
    {
        "overseas territory": "british overseas territories"
    },
    {
        " of the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " in the ": null
    },
    {
        "North Atlantic Ocean": "atlantic ocean"
    },
    {
        ". Located off the ": null
    },
    {
        "east coast of the United States": "east coast of the united states"
    },
    {
        ", it is situated around  northeast of ": null
    },
    {
        "Miami": "miami"
    },
    {
        ", ": null
    },
    {
        "Florida": "florida"
    },
    {
        " and  south of ": null
    },
    {
        "Halifax": "halifax , nova scotia"
    },
    {
        ", ": null
    },
    {
        "Nova Scotia": "nova scotia"
    },
    {
        ", west of ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        ", northwest of ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ",  north of ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        " and north-northeast of ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        ". The nearest landmass is ": null
    },
    {
        "Cape Hatteras": "cape hatteras"
    },
    {
        ", ": null
    },
    {
        "North Carolina": "north carolina"
    },
    {
        ", about  west-northwest. Although commonly referred to in the singular , the territory consists of approximately 42 ": null
    },
    {
        "island": "island"
    },
    {
        "s, with a total area of .          Bermudas ecology has been altered radically since the 42th century by humans and the plants and animals they introduced. Some species had actually become extinct long before this, including the ": null
    },
    {
        "short-tailed albatross": "short-tailed albatross"
    },
    {
        ", a species which occurs today only in the northern ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        ".       Of 42 plant species found in Bermuda today, 42 are ": null
    },
    {
        "endemic": "endemism"
    },
    {
        " , and 42 are endangered. When discovered, about 42 the islands habitat was dominated by the remnant, ": null
    },
    {
        "old-growth": "old growth forest"
    },
    {
        " forest of Bermuda Juniper . Underwater archaeology of the caldera basin to the north shows that the area was once densely forested with junipers when it was above sea level. The juniper is an endemic species, though related to species found in North America. Its wood is an unusually deep red, indicative of the high iron content of the islands soil . Prior to human settlement, there were several million juniper trees in Bermuda. By the 42s, large areas of Bermuda had been denuded by the shipbuilding industry. As that industry died out in the 42th century, however, the junipers rapidly recovered their numbers. By 42 when the human population neared 42, the islands were again covered densely with juniper, although many of these were juvenile trees. The respite proved temporary, however. In the 42s, it was realised that two species of ": null
    },
    {
        "scale insect": "scale insect"
    },
    {
        ",  Lepidosaphes newsteadi  and  Carulaspis minima , had accidentally been introduced, and were rapidly killing off the junipers, which had no immunity to their toxicological effect. Attempts were made to control the infestation naturally, which involved the large-scale introduction of ": null
    },
    {
        "ladybird beetles": "coccinellidae"
    },
    {
        " , but these were to no avail. Over the next decade, roughly 42 million juniper trees were lost to the scales. Motor cars were legalised in Bermuda in 42 as a result of changes wrought by ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", and the resultant sprawl of the rapidly growing population outward from the pre-war population centres happened simultaneously with the destruction of the forests. Unlike in the 42th century, many plant species that had been introduced, some, like the  Casuarina , specifically to replace the ": null
    },
    {
        "windbreak": "windbreak"
    },
    {
        " lost with the juniper, spread virulently. The juniper grows slowly by comparison to many of the ": null
    },
    {
        "introduced species": "introduced species"
    },
    {
        ", and has been unable to thrive in the presence of Casuarina and ": null
    },
    {
        "Brazilian pepper": "brazilian pepper"
    },
    {
        " trees. Efforts to restore it centre around intensively managed land areas, such as gardens and golf courses. Other large plant species, which were never as numerous as the juniper, had also fared poorly in the presence of invasive species, but have become popular with gardeners and their numbers also have increased in managed areas. These include two native species, the Bermuda olivewood , and the Bermuda palmetto , the only native or endemic palm. In some coastal areas and inland marshes, Bermuda is the most northerly point at which ": null
    },
    {
        "mangrove": "mangrove"
    },
    {
        " trees are found. Smaller plants include many ": null
    },
    {
        "fern": "fern"
    },
    {
        "s. Notable among these is the rare Bermuda cave fern . An even rarer fern, Diplazium laffanianum , no longer survives in the wild. Another native plant is the ": null
    },
    {
        "iris": "iris"
    },
    {
        " Bermudiana . This was thought to be endemic, but also appears in two locations in ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ". Many of the smaller endemic and native plants of Bermuda are rare and endangered, but others have survived and prospered. The common ": null
    },
    {
        "Bermuda grass": "cynodon"
    },
    {
        " is not actually Bermudian, but a Mediterranean import.       There were few species of land animal in Bermuda before the arrival of humans. The only vertebrate species was the ": null
    },
    {
        "Bermuda skink": "bermuda rock skink"
    },
    {
        ", or rock lizard . These were quite numerous, but have become rare due to predation by introduced species, and, especially, the introduction of glass bottles, in which they easily become trapped. Unlike the introduced ": null
    },
    {
        "anole": "anole"
    },
    {
        "s, their feet are unable to adhere to glass. Their range had been largely reduced to small islands of ": null
    },
    {
        "Castle Harbour": "castle harbour, bermuda"
    },
    {
        ", but they have re-colonised the mainland, and their numbers are increasing. The only other large land animals found on the island were crustaceans, notably two species of land crab, including the rare giant land crab . Insects included the endemic, ground-burrowing solitary bee, which has not been observed for several decades and is believed extinct. The native ": null
    },
    {
        "cicada": "cicada"
    },
    {
        " also became extinct with the loss of the juniper forest. Other native insects survive, including the migratory ": null
    },
    {
        "monarch butterfly": "monarch butterfly"
    },
    {
        " , which has become threatened due to the loss of ": null
    },
    {
        "milkweed": "asclepias"
    },
    {
        ", which has been eradicated as a weed. The most numerous animals were, and are, birds. Several native species are related to North American species, including the ": null
    },
    {
        "eastern bluebird": "eastern bluebird"
    },
    {
        " , and the ": null
    },
    {
        "white-eyed vireo": "white-eyed vireo"
    },
    {
        " . Both of these were common, but have suffered from loss of habitat, from competition for nest sites with introduced ": null
    },
    {
        "house sparrow": "house sparrow"
    },
    {
        "s , and nest-predation by ": null
    },
    {
        "European starling": "european starling"
    },
    {
        "s  and ": null
    },
    {
        "great kiskadee": "great kiskadee"
    },
    {
        "s  - this last species was deliberately introduced as late as 42 with the intent that it would control the previously introduced anoles. Other native birds, including the ": null
    },
    {
        "grey catbird": "grey catbird"
    },
    {
        ", have suffered from the same causes. The most famous Bermudian bird is the endemic ": null
    },
    {
        "Bermuda petrel": "bermuda petrel"
    },
    {
        " , or cahow. This is a pelagic seabird which had dug burrows for its nests. Humans are believed to have killed millions of them after settlement began in 42 and feral pigs, introduced presumably by Spaniards decades before, also attacked their nests. Before the 42th century was over, the cahow was believed to be extinct. After sightings of the bird at sea, a young Bermudian, ": null
    },
    {
        "David B. Wingate": "david b. wingate"
    },
    {
        ", theorised cahows might still be nesting on rocky islets of Castle Harbour. He visited these islets with ornithologists ": null
    },
    {
        "Robert Cushman Murphy": "robert cushman murphy"
    },
    {
        " and Louis S. Mowbray in 42 and discovered a handful of nesting pairs. Under Wingates supervision, a conservation programme has steadily increased the cahows numbers. Species that arrived by natural dispersion and become native after human settlement include the ": null
    },
    {
        "barn owl": "barn owl"
    },
    {
        " , and the ": null
    },
    {
        "mourning dove": "mourning dove"
    },
    {
        " .       Since discovery by humans, numerous species have been introduced to the island, some deliberately, like the casurina, the feral pig, the ": null
    },
    {
        "cardinal": "northern cardinal"
    },
    {
        " , anoles, ladybird beetles, and the kiskadee, some incidentally, like the ": null
    },
    {
        "Norwegian rat": "brown rat"
    },
    {
        "  and the ": null
    },
    {
        "black rat": "black rat"
    },
    {
        " , and the others accidentally, like the scale mites, and the ": null
    },
    {
        "brown widow spider": "latrodectus geometricus"
    },
    {
        " . Other imported species include the ": null
    },
    {
        "cane toad": "cane toad"
    },
    {
        " , and tree frogs.     In addition to casurinas, numerous other species of tree, bush, shrub, cacti, palm, and other grasses have been introduced, with many of them proving to be invasive species. Despite the decimation of the cedar, those parts of the island not covered in buildings and tarmac are now densely covered in trees and shrubbery, including ": null
    },
    {
        "allspice": "allspice"
    },
    {
        " , fiddlewood, ": null
    },
    {
        "Norfolk Island pine": "araucaria heterophylla"
    },
    {
        " , ": null
    },
    {
        "bay grape": "coccoloba uvifera"
    },
    {
        " , ": null
    },
    {
        "Surinam cherry": "surinam cherry"
    },
    {
        " , ": null
    },
    {
        "poinciana": "royal poinciana"
    },
    {
        " , ": null
    },
    {
        "fan palms": "washingtonia"
    },
    {
        ", ": null
    },
    {
        "coconut palm": "coconut palm"
    },
    {
        " , ": null
    },
    {
        "royal palm": "roystonea"
    },
    {
        " , ": null
    },
    {
        "pittusporum": "pittosporum"
    },
    {
        ", ": null
    },
    {
        "Natal plum": "carissa"
    },
    {
        ", ": null
    },
    {
        "loquat": "loquat"
    },
    {
        " , ": null
    },
    {
        "oleander": "oleander"
    },
    {
        " , and ": null
    },
    {
        "hibiscus": "hibiscus"
    },
    {
        ". Most of the introduced species have proved to be unequal to Bermudas frequently fierce weather. A succession of winter storms and a few powerful hurricanes that have struck over the last two decades have reduced woodlands, and available nest sites for small birds. The number of large trees, particularly, has been reduced. Although cedars are adapted to the local climate, and not so affected by stormy weather, rising sea levels are beginning to inundate the roots of ": null
    },
    {
        "old-growth": "old growth forest"
    },
    {
        " cedars near low-lying ": null
    },
    {
        "marsh": "marsh"
    },
    {
        "lands, causing many to die.     Many domestic animal species have been introduced, including dogs, horses, goats, sheep, chickens, and cats, with cats long having established a large feral population. ": null
    },
    {
        "Feral chickens": "feral chickens"
    },
    {
        " have recently become numerous , and feral rabbits can also be found. Populations of feral guinea pigs have been established and then eradicated. Feral pigs were hunted to extinction centuries ago. Today, introduced feral species, particularly cats, are blamed for falling numbers of native birds, from bluebirds to longtails, but the primary threats are loss of habitat, due now to overdevelopment, and climate change .          According to the ": null
    },
    {
        "Köppen climate classification": "köppen climate classification"
    },
    {
        " Bermuda lies in the transition zone between ": null
    },
    {
        "tropical rainforest climate": "tropical rainforest climate"
    },
    {
        " or Af and ": null
    },
    {
        "humid subtropical climate": "humid subtropical climate"
    },
    {
        " or Cfa. Although Bermuda meets the temperature threshold of a tropical climate , the higher latitude of Bermuda is north of the latitude that most tropical climates are typically found. Bermuda has never experienced a freeze or frost, and winters are quite warm by European and North American standards.     Bermuda experiences hot and humid summers with the majority of precipitation falling from isolated showers and thunderstorms, and mild winters. Occasional ": null
    },
    {
        "Tropical Waves": "tropical wave"
    },
    {
        " and ": null
    },
    {
        "Tropical Cyclones": "tropical cyclones"
    },
    {
        " can also play a role in summertime precipitation totals when they exit the tropics. Winters are mild to semi-warm, with temperatures rarely falling below . Precipitation in wintertime is controlled by fronts moving eastward from the North American continent and into the Atlantic Ocean. During the peak of winter in Bermuda, these fronts can be followed by northwesterly gales and gusty showers that sometimes contain small hail. Precipitation is fairly evenly distributed through the year, but is somewhat less reliable in April and especially May, Bermudas driest months on average, when the ": null
    },
    {
        "Bermuda-Azores High": "bermuda-azores high"
    },
    {
        " can bring extended dry spells. Summers are hot and humid, with frequent intense thundershowers. On average, August is the wettest month. It is not uncommon, during the summer, to ride on sunbaked roads, then round a corner to come suddenly on drenched and steaming tarmac where a shower has passed only minutes earlier.     Bermudas weather is largely controlled by the position and structure of the Bermuda-Azores High. This semi-permanent high pressure area extends a ridge westward toward Bermuda during the spring and summer when the high is most intense. Oriented west-to-east to the near south of Bermuda, clockwise flow around the surface high brings ": null
    },
    {
        "prevailing winds": "prevailing winds"
    },
    {
        " from the southwest for much of the summer and subsequently prevents fronts from reaching the island. However, the ridge sometimes shifts to the north of the island allowing easterly or northeasterly winds.  In fall and winter, the ridge near Bermuda becomes more transient, allowing frontal systems to affect the island. Winds around these systems are much more variable but typically settle out of the southwest ahead of a cold front and shift to the west or northwest behind a cold front.     A local weather phenomenon that occurs mainly in late summer is colloquially known as Morgans Cloud .  On otherwise fair, hot summer days with light southwesterly winds, ": null
    },
    {
        "convective": "convection"
    },
    {
        " clouds can develop along the length of the island and blow to the northeast growing. In extreme cases, this cloud formation can develop into heavy showers and thunderstorms and it has been known to produce funnel clouds and waterspouts in the eastern parishes. This phenomenon also occurs in the less common northeasterly wind regime but its effects are felt in the western parishes. The key to Morgans Cloud forming is light winds blowing along the length of the island which is often warmer than the surrounding waters on hot summer days. This organizes upward motions allowing this cloud formation to occur. Similar localized cloud development is observed in linear tropical and subtropical islands globally. Furthermore, showers following strong cold fronts in wintertime form in a similar manner to ": null
    },
    {
        "lake-effect snow": "lake-effect snow"
    },
    {
        ". Cold air blowing over warm water decreases atmospheric stability, allowing convection to form and grow into showers.                           When settled, in the 42th century, first by the ": null
    },
    {
        "Virginia Company": "london company"
    },
    {
        ", then by its spin-off, the ": null
    },
    {
        "Somers Isles Company": "somers isles company"
    },
    {
        ", Bermuda was divided into nine equally sized administrative areas. These comprised one public territory  and eight tribes . These tribes were subdivided into lots, separated by narrow tribe roads . These roads served both to demarcate the boundaries of lots, and also as access routes to the shoreline, as the primary method of transport about Bermuda would remain by boat for the next three centuries. Each of the lots equated to shares in the company. Each of the tribes was named for a major adventurer of the Company. Most were nobles, who used the ": null
    },
    {
        "toponyms": "toponymy"
    },
    {
        " of their titles, hence most of the parishes bear place names from ": null
    },
    {
        "England": "england"
    },
    {
        ", ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", or ": null
    },
    {
        "Wales": "wales"
    },
    {
        ": Devonshire ,  Hamilton  , Pembroke , Southampton , and Warwick . The others are Paget , Sandys , and Smiths . Hamilton Parish was originally named Bedford, after ": null
    },
    {
        "Lucy Russell, Countess of Bedford": "lucy russell, countess of bedford"
    },
    {
        ", who sold her shares to the Scottish nobleman, James Hamilton. Devonshire Parish had originally been named Cavendish Tribe. The short-lived use of the word tribes for administrative regions appears to have been unique to the Bermuda example. The ninth parish was common  land, not subdivided by tribe roads, and was named for the ": null
    },
    {
        "patron saint": "patron saint"
    },
    {
        " of England, ": null
    },
    {
        "Saint George": "saint george"
    },
    {
        ". It includes the island and the town both of the same name.       Bermudian convention, where a ": null
    },
    {
        "toponym": "toponym"
    },
    {
        " contains the name of a person, is to render the persons name in the ": null
    },
    {
        "possessive": "possessive"
    },
    {
        " form. The place is rarely treated as equivalent to the person.     Among many examples of such place names in Bermuda are ": null
    },
    {
        "St. Davids Island": "st. davids island, bermuda"
    },
    {
        ", Baileys Bay, ": null
    },
    {
        "Sandys Parish": "sandys parish, bermuda"
    },
    {
        " , Skeeters Island ,   Gibbs Hill, Barrs Bay, Ackermanns Hill, Nellys Island, ": null
    },
    {
        "Coopers Island": "coopers island, bermuda"
    },
    {
        ", ": null
    },
    {
        "Darrells Island": "darrells island, bermuda"
    },
    {
        ", Paynters Vale, Abbots Head ,  and Fort St. Catherines. The possessive form is also used for titles, as with Collectors Hill .     The use of the possessive form is not exclusive, however, as exemplified by place names such as the names of most of the parishes , such as ": null
    },
    {
        "Hamilton Parish": "hamilton parish, bermuda"
    },
    {
        " , Devonshire Parish , and Paget Parish. Some of these exceptions may have originated with changed syntax, as Devonshire Parish may originally have been The Parish of Devonshire. This is seen with the City of Hamilton . Whereas the City of Hamilton is commonly referred to as Hamilton, The Town of St. George, St. Georges Parish, St. Georges Island, and St. Georges Harbour always remains possessive when shortened, such as in the St. Georges Foundation.        ; Maritime claims:   : Territorial sea:    : Exclusive fishing zone:    ; Land use:   : Arable land: 42%   : Permanent crops: 42%   : Other: 42%   ; Natural hazards:   : ": null
    },
    {
        "Hurricanes": "tropical cyclone"
    }
]