[
    {
        "   The geography of Bolivia includes the ": null
    },
    {
        "Eastern Andes Mountain Range": "cordillera oriental"
    },
    {
        " which bisects ": null
    },
    {
        "Bolivia": "bolivia"
    },
    {
        " roughly from north to south. To the east of that mountain chain are lowland plains of the ": null
    },
    {
        "Amazon Basin": "amazon basin"
    },
    {
        ", and to the west is the ": null
    },
    {
        "Altiplano": "altiplano"
    },
    {
        " which is a highland ": null
    },
    {
        "plateau": "plateau"
    },
    {
        " where ": null
    },
    {
        "Lake Titicaca": "lake titicaca"
    },
    {
        " is located. Bolivias geography has features similar to those of ": null
    },
    {
        "Peru": "peru"
    },
    {
        " which abuts Bolivias northwest border; like Bolivia, Peru is bisected from north to south by the Eastern Andes Mountains, and these two countries share Lake Titicaca which is the highest navigable lake on ": null
    },
    {
        "Earth": "earth"
    },
    {
        ". Unlike Peru, however, Bolivia is one of the two ": null
    },
    {
        "landlocked": "landlocked"
    },
    {
        " countries in ": null
    },
    {
        "South America": "south america"
    },
    {
        ", the other being ": null
    },
    {
        "Paraguay": "paraguay"
    },
    {
        " which is located along Bolivias southeast border.     The most prominent feature of the Altiplano is the large lake at its northern end, Lake Titicaca. At  above sea level. With a surface area of , it is larger than ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        " and is ": null
    },
    {
        "South America": "south america"
    },
    {
        "s second largest lake by surface area. Lake Titicaca is also deep, about  at its deepest, with an average depth of ; its volume of water is large enough to maintain a constant temperature of . The lake actually moderates the climate for a considerable distance around it, making crops of ": null
    },
    {
        "maize": "maize"
    },
    {
        " and ": null
    },
    {
        "wheat": "wheat"
    },
    {
        " possible in sheltered areas.     Lake Titicaca drains southward through the slow-moving, ": null
    },
    {
        "reed": "phragmites"
    },
    {
        "-filled ": null
    },
    {
        "Desaguadero River": "desaguadero river"
    },
    {
        " to ": null
    },
    {
        "Lake Poopó": "lake poopó"
    },
    {
        ". In contrast to the ": null
    },
    {
        "freshwater": "freshwater"
    },
    {
        " Lake Titicaca, Lake Poopó is salty and shallow, with depths seldom more than .        In western Bolivia, the ": null
    },
    {
        "Cordillera Occidental": "cordillera occidental"
    },
    {
        " is a chain of dormant ": null
    },
    {
        "volcano": "volcano"
    },
    {
        "es and ": null
    },
    {
        "solfatara": "solfatara"
    },
    {
        "s, ": null
    },
    {
        "volcanic vent": "volcanic vent"
    },
    {
        "s emitting ": null
    },
    {
        "sulfur": "sulfur"
    },
    {
        "ous gases. Bolivias highest peak, the snowcapped ": null
    },
    {
        "Nevado Sajama": "nevado sajama"
    },
    {
        " , is located here. The entire cordillera is of volcanic origin and an extension of the volcanic region found in southern Peru. Most of the northern part of this range has an elevation of about ; the southern part is somewhat lower. Rainfall, although scanty everywhere, is greater in the northern half, where the land is covered with ": null
    },
    {
        "scrub": "scrubland"
    },
    {
        " vegetation. The southern area receives almost no ": null
    },
    {
        "precipitation": "precipitation"
    },
    {
        ", and the landscape consists mostly of barren rocks. All of the Cordillera Occidental region is sparsely populated, and the south is virtually uninhabited.     The ": null
    },
    {
        "Altiplano": "altiplano"
    },
    {
        ", the high ": null
    },
    {
        "plateau": "plateau"
    },
    {
        " between the previous range and the ": null
    },
    {
        "Cordillera Oriental": "cordillera oriental"
    },
    {
        ", comprises four major basins formed by mountainous spurs that jut eastward from the Cordillera Occidental about halfway to the Cordillera Oriental. Along the Altiplanos eastern side is a continuous flat area, which has served as Bolivias principal north-south transport corridor since colonial times. The entire Altiplano was originally a deep ": null
    },
    {
        "rift": "rift"
    },
    {
        " between the cordilleras that gradually filled with highly porous ": null
    },
    {
        "sediment": "sediment"
    },
    {
        "ary debris washed down from the peaks. This sedimentary origin explains its gradual slope from north to south; greater rainfall in the north has washed a larger quantity of debris onto the platform floor.     Rainfall in the Altiplano decreases toward the south, and the scrub vegetation grows more sparse, eventually giving way to barren rocks and dry red clay. The land contains several ": null
    },
    {
        "salt flat": "salt pan"
    },
    {
        "s, the dried remnants of ancient lakes. The largest of these - and the worlds largest salt concentration - is the ": null
    },
    {
        "Uyuni": "salar de uyuni"
    },
    {
        " Saltpan, which covers over 42 square kilometers. The salt is more than five meters deep in the centre of this flat. In the dry season, the lake bed can be traversed by heavy trucks. Near the Argentine border, the floor of the Altiplano rises again, creating hills and volcanoes that span the gap between the eastern and western cordilleras of the Andes.     The much older Cordillera Oriental enters Bolivia on the north side of Lake Titicaca, extends southeastward to approximately 42 south latitude, then broadens and stretches south to the Argentine border. The northernmost part of the Cordillera Oriental, the ": null
    },
    {
        "Cordillera Real": "cordillera real"
    },
    {
        ", is an impressive snow-capped series of ": null
    },
    {
        "granite": "granite"
    },
    {
        " mountains. Some of these peaks exceed  and two - ": null
    },
    {
        "Illimani": "illimani"
    },
    {
        " , which overlooks the city of ": null
    },
    {
        "La Paz": "la paz"
    },
    {
        ", and ": null
    },
    {
        "Illampu": "illampu"
    },
    {
        "  - have large ": null
    },
    {
        "glacier": "glacier"
    },
    {
        "s on their upper slopes. South of 42 south latitude, the range changes character. Called the ": null
    },
    {
        "Cordillera Central": "cordillera central, bolivia"
    },
    {
        " here, the land is actually a large block of the Earths crust that has been lifted and tilted eastward. The western edge of this block rises in a series of steep cliffs from the Altiplano. The backbone of the cordillera is a high, rolling plain, with elevations from  to , interspersed with irregularly spaced high peaks. Too high to be exploited for large-scale commercial grazing, this area takes its name from the predominant ": null
    },
    {
        "vegetation type": "vegetation type"
    },
    {
        ", the ": null
    },
    {
        "puna": "puna grassland"
    },
    {
        ".       The northeastern flank of the ": null
    },
    {
        "Cordillera Real": "cordillera real"
    },
    {
        " is known as the ": null
    },
    {
        "Yungas": "yungas"
    },
    {
        ", from the ": null
    },
    {
        "Aymara": "aymara language"
    },
    {
        " and ": null
    },
    {
        "Quechua": "quechua language"
    },
    {
        " word yunka meaning warm valley.  Teofilo Laime Ajacopa, Diccionario Bilingüe Iskay simipi yuyaykancha, La Paz, 42 The steep, almost inaccessible slopes and peaks of this mainly semitropical valley area northeast of ": null
    },
    {
        "La Paz": "la paz"
    },
    {
        " offer some of the most spectacular scenery in Bolivia. Rainfall is heavy, and lush vegetation clings to the sides of narrow river valleys. The land is among the most fertile in Bolivia, but poor transport has hindered its agricultural development. The government attempted to build a railway through the Yungas in 42 to connect La Paz with the eastern lowlands. The railway was abandoned, however, after completion of only 42 kilometres.     The eastern slopes of the ": null
    },
    {
        "Cordillera Central": "cordillera central"
    },
    {
        " descend gradually in a series of complex north-south ranges and hills. Rivers, draining to the east, have cut long narrow valleys; these valleys and the basins between the ranges are favorable areas for crops and settlement. Rich alluvial soils fill the low areas, but erosion has followed the removal of vegetation in some places. The valley floors range from 42 to 42 metres above sea level, and this lower elevation means milder temperatures than those of the Altiplano. The cities of ": null
    },
    {
        "Sucre": "sucre"
    },
    {
        ", ": null
    },
    {
        "Tarija": "tarija"
    },
    {
        " and ": null
    },
    {
        "Cochabamba": "cochabamba"
    },
    {
        ", are located in basins of this vast region.       The eastern lowlands include all of Bolivia north and east of the Andes. Although comprising over two-thirds of the national territory, the region is sparsely populated and, until recently, has played a minor role in the ": null
    },
    {
        "economy": "economy of bolivia"
    },
    {
        ".     Differences in topography and climate separate the lowlands into three areas. The flat northern area, made up of ": null
    },
    {
        "Beni": "beni department"
    },
    {
        " and ": null
    },
    {
        "Pando Department": "pando department"
    },
    {
        "s and the northern part of ": null
    },
    {
        "Cochabamba Department": "cochabamba department"
    },
    {
        ", consists of ": null
    },
    {
        "rainforest": "tropical and subtropical moist broadleaf forests"
    },
    {
        ". Because much of the ": null
    },
    {
        "topsoil": "topsoil"
    },
    {
        " is underlain by ": null
    },
    {
        "claypan": "claypan"
    },
    {
        ", drainage is poor, and heavy rainfall periodically converts vast parts of the region to ": null
    },
    {
        "swamp": "swamp"
    },
    {
        ". The central area, comprising the northern half of ": null
    },
    {
        "Santa Cruz Department": "santa cruz department"
    },
    {
        ", has gently rolling hills and a drier climate than the north. Forests alternate with ": null
    },
    {
        "savanna": "tropical and subtropical grasslands, savannas, and shrublands"
    },
    {
        ", and much of the land has been cleared for cultivation. Santa Cruz, the largest city in the lowlands, is located here, as are most of Bolivias petroleum and natural gas reserves. The southeastern part of the lowlands is part of the ": null
    },
    {
        "Gran Chaco": "gran chaco"
    },
    {
        ". Virtually rainless for nine months of the year, this area becomes ": null
    },
    {
        "flooded": "flooded grasslands and savannas"
    },
    {
        " for the three months of heavy rains. The extreme variation in rainfall supports only thorny scrub vegetation and cattle grazing, although recent discoveries of natural gas and petroleum near the foothills of the Andes have attracted some settlers to the region.     Most of Bolivias important rivers are found in the water-rich northern parts of the lowlands, particularly in the Alto Beni , where the land is suitable for crops such as ": null
    },
    {
        "coffee": "coffee"
    },
    {
        " and ": null
    },
    {
        "cacao": "theobroma_cacao"
    },
    {
        ". The northern lowlands are drained by wide, slow-moving rivers, the three largest of which—the ": null
    },
    {
        "Mamoré": "mamoré river"
    },
    {
        ", ": null
    },
    {
        "Beni": "beni river"
    },
    {
        ", and ": null
    },
    {
        "Madre de Dios": "madre de dios river"
    },
    {
        "—all flow northward into the ": null
    },
    {
        "Madeira River": "madeira river"
    },
    {
        " in ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " and eventually into the ": null
    },
    {
        "River Amazon": "amazon river"
    },
    {
        ". Riverboats along the Beni and the Mamoré carry both passenger and freight traffic; rapids on the Madeira prevent river traffic farther into Brazil. Near the ": null
    },
    {
        "Paraguay": "paraguay"
    },
    {
        "an border, shallow sandy streams carry the seasonal runoff into the ": null
    },
    {
        "Pilcomayo": "pilcomayo river"
    },
    {
        " or ": null
    },
    {
        "Paraguay": "paraguay river"
    },
    {
        " rivers. Also, the ": null
    },
    {
        "Pantanal": "pantanal"
    },
    {
        ", the worlds largest wetland of any kind, has some of its area in Bolivia.     Despite the fact that eastern Bolivia is described a lowland in when seeing the general topography of the country there are mountains and mountain ranges well beyond the Andes. The most notable of these mountains are the forested ": null
    },
    {
        "Serranías Chiquitanas": "serranías chiquitanas"
    },
    {
        " in eastern ": null
    },
    {
        "Santa Cruz Department": "santa cruz department"
    },
    {
        ".          Bolivia has several geographical areas and climates, and the three predominant ones are Andean , sub-Andean , and plains . The climate of Bolivia varies drastically from one ecoregion to the other, from the tropics in the eastern  llanos  to ": null
    },
    {
        "polar climate": "polar climate"
    },
    {
        "s in the western Andes. The summers are warm, humid in the east and dry in the west, with rains that often modify temperatures, humidity, winds, ": null
    },
    {
        "atmospheric pressure": "atmospheric pressure"
    },
    {
        " and evaporation, giving place to very different climates. When the climatological phenomenon known as El Niño    takes place, it provokes great alterations in the weather. Winters are very cold in the west, and it snows around the mountain ranges, while in the western regions, windy days are more usual. The autumn is dry in the non-tropical regions.     Llanos. A ": null
    },
    {
        "humid": "humidity"
    },
    {
        " tropical climate": "tropical climate"
    },
    {
        " with an average temperature of 42° C . The wind coming from the ": null
    },
    {
        "Amazon rainforest": "amazon rainforest"
    },
    {
        " causes significant rainfall. Starting in May, there is low precipitation because of dry winds, and most days have clear skies. Even so, winds from the south, called surazos, can bring cooler temperatures lasting several days.    Altiplano . ": null
    },
    {
        "Desert": "desert climate"
    },
    {
        "-": null
    },
    {
        "Polar": "polar climate"
    },
    {
        " climates, with strong and cold winds. The average temperature ranges from 42 to 42° C . At night, temperatures descend drastically to slightly above 42° C , while during the day, the weather is dry and ": null
    },
    {
        "solar radiation": "sunlight"
    },
    {
        " is high. ": null
    },
    {
        "Ground frost": "ground frost"
    },
    {
        "s occur every month, and ": null
    },
    {
        "snow": "snow"
    },
    {
        " is frequent.   Valleys and Yungas. ": null
    },
    {
        "Temperate": "temperateness"
    },
    {
        " climate. The humid northeastern winds are pushed to the mountains, making this region very humid and rainy. Temperatures are cooler at higher elevations. Snow occurs at altitudes of 42 meters.    Chaco . ": null
    },
    {
        "Subtropical": "subtropics"
    },
    {
        " Semi-arid": "semi-arid climate"
    },
    {
        " climate. Rain and humidity in January and the rest of the year, with warm days and cool nights.                  Terrain:   rugged ": null
    },
    {
        "Andes Mountains": "andes mountains"
    },
    {
        " with a highland plateau , hills, lowland plains of the ": null
    },
    {
        "Amazon Basin": "amazon basin"
    },
    {
        "      Natural resources:   tin, natural gas, petroleum, zinc, tungsten, antimony, silver, iron, lead, gold, timber, hydro-power     Land borders: Argentina , Brazil , Chile , Paraguay , Peru     Land use:   As of 42 the population of Bolivia was more urban than rural . , Pan American Health Organization.   arable land:   42%   permanent crops:   42%   other:   42%     Irrigated land:   42  km²     Total renewable water resources:   42 cu km     Freshwater withdrawal  ": null
    }
]