[
    {
        "     Oman": "Oman"
    },
    {
        " is a country situated in ": null
    },
    {
        "Southwest Asia": "Southwest Asia"
    },
    {
        ", bordering the ": null
    },
    {
        "Arabian Sea": "Arabian Sea"
    },
    {
        ", ": null
    },
    {
        "Gulf of Oman": "Gulf Of Oman"
    },
    {
        ", and ": null
    },
    {
        "Persian Gulf": "Persian Gulf"
    },
    {
        ", between ": null
    },
    {
        "Yemen": "Yemen"
    },
    {
        " and the ": null
    },
    {
        "United Arab Emirates": "United Arab Emirates"
    },
    {
        " . The coast of Oman was an important part in the Omani empire and sultanate.       Oman is located in the southeastern quarter of the ": null
    },
    {
        "Arabian Peninsula": "Arabian Peninsula"
    },
    {
        " and covers a total land area of . The land area is composed of varying ": null
    },
    {
        "topographic": "Topography"
    },
    {
        " features: ": null
    },
    {
        "valleys": "Valley"
    },
    {
        "and ": null
    },
    {
        "desert": "Desert"
    },
    {
        " account for 82 percent of the land mass; mountain ranges, 15 percent; and the coastal plain, 3 percent. The ": null
    },
    {
        "sultanate": "Sultanate"
    },
    {
        " is flanked by the ": null
    },
    {
        "Gulf of Oman": "Gulf Of Oman"
    },
    {
        ", the ": null
    },
    {
        "Arabian Sea": "Arabian Sea"
    },
    {
        ", and the ": null
    },
    {
        "Rub al Khali": "Rub Al Khali"
    },
    {
        " of ": null
    },
    {
        "Saudi Arabia": "Saudi Arabia"
    },
    {
        ", all of which contributed to Omans isolation. Historically, the countrys contacts with the rest of the world were by sea, which not only provided access to foreign lands but also linked the coastal towns of Oman. The Rub al-Khali, difficult to cross even with modern desert transport, formed a barrier between the sultanate and the Arabian interior. The ": null
    },
    {
        "Al Hajar Mountains": "Al Hajar Mountains"
    },
    {
        ",   which form a belt between the coast and the desert from the ": null
    },
    {
        "Musandam Peninsula": "Musandam Peninsula"
    },
    {
        " to the city of ": null
    },
    {
        "Sur": "Sur, Oman"
    },
    {
        ", almost at Omans easternmost point,  formed another barrier. These geographic barriers kept the interior of Oman free from foreign military encroachments.               Natural features divide the country into six distinct areas: ": null
    },
    {
        "Ruus al-Jibal": "Ruus Al-Jibal"
    },
    {
        ", including the northern Musandam Peninsula;  ": null
    },
    {
        "the Batinah": "Al Batinah Region"
    },
    {
        " plain running southeast along the Gulf of Oman coast; the Oman interior behind the Batinah coast comprising the Hajar Mountains, their foothills, and desert fringes; the coast from ": null
    },
    {
        "Muscat": "Muscat"
    },
    {
        "-": null
    },
    {
        "Matrah": "Matrah"
    },
    {
        " around the point of ": null
    },
    {
        "Ras Al Hadd": "Ras Al Hadd"
    },
    {
        ", and down the ": null
    },
    {
        "Arabian Sea": "Arabian Sea"
    },
    {
        "; the offshore island of Masirah; and finally the barren coastline south to the ": null
    },
    {
        "Dhofar": "Dhofar"
    },
    {
        " region in the south.     Except for the foggy and fertile Dhofar, all of the coast and the lowlands around the Hajar mountains are part of the ": null
    },
    {
        "Gulf of Oman desert and semi-desert": "Gulf Of Oman Desert And Semi-Desert"
    },
    {
        " ecoregion, while the mountains themselves are a distinct habitat.       The northernmost area, ": null
    },
    {
        "Musandam": "Musandam Governorate"
    },
    {
        ", extends from the tip of the Musandam Peninsula to the boundary with the ": null
    },
    {
        "United Arab Emirates": "United Arab Emirates"
    },
    {
        " at ": null
    },
    {
        "Hisn al-Dibba": "Dibba Al-Hisn"
    },
    {
        ". It borders the ": null
    },
    {
        "Strait of Hormuz": "Strait Of Hormuz"
    },
    {
        ", which links the ": null
    },
    {
        "Persian Gulf": "Persian Gulf"
    },
    {
        " with the ": null
    },
    {
        "Gulf of Oman": "Gulf Of Oman"
    },
    {
        ", and is separated from the rest of the sultanate by a strip of territory belonging to the UAE. This area consists of low mountains forming the northernmost extremity of the Western Hajar. Two inlets, Elphinstone  and Malcom , cleave the coastline about one third of the distance from the ": null
    },
    {
        "Strait of Hormuz": "Strait Of Hormuz"
    },
    {
        " and at one point are separated by only a few hundred meters of land. The coastline is extremely rugged, and the Elphinstone Inlet,  long and surrounded by cliffs  high, has frequently been compared with ": null
    },
    {
        "fjords": "Fjord"
    },
    {
        "in ": null
    },
    {
        "Norway": "Norway"
    },
    {
        ".          The UAE territory separating Ruus al Jibal from the rest of Oman extends almost as far south as the coastal town of ": null
    },
    {
        "Shinas": "Shinas"
    },
    {
        ". A narrow, well-populated coastal plain known as Al-Batinah runs from the point at which the sultanate is re-entered to the town of As-Sib, about  to the southeast. Across the plains, a number of ": null
    },
    {
        "wadi": "Wadi"
    },
    {
        "s, heavily populated in their upper courses, descend from the Western Hajar Mountains to the south. A ribbon of oases, watered by wells and ": null
    },
    {
        "underground channels ": "Qanat"
    },
    {
        ", extends the length of the plain, about  inland.       South of ": null
    },
    {
        "As Sib": "As Sib"
    },
    {
        ", the coast changes character. For about , from As-Sib to Ras al-Hadd, it is barren and bounded by cliffs almost its entire length; there is no cultivation and little habitation. Although the deep water off this coast renders navigation relatively easy, there are few natural harbors or safe anchorages. The two best are at Muscat and Matrah, where natural harbors facilitated the growth of cities centuries ago.       Al Sharqiyah is the northeastern region of the Sultanate of Oman and overlooks the Arabian Sea to the east and includes the inner side of the Eastern Hijr Mountains.   The region consists of the following states:   South Al Sharqiyah - The state of Sur is its administrative capital in addition to the states of Jalan Bani Bu Ali and Jalan Bani Bu Hassan, Kamel and Alwafi and Masirah.   North Al Sharqiyah - The state of Ibra is its administrative capital in addition to the states of Bidiyah, Al-Mudhaibi, Qabil, Wadi Bani Khalid, Damma and Al-Tayyeen.       The desolate coastal tract from Jalan to Ras Naws has no specific name. Low hills and wastelands meet the sea for long distances. Midway along this coast and about fifteen kilometers offshore is the barren ": null
    },
    {
        "Masirah Island": "Masirah Island"
    },
    {
        ". Stretching about , the island occupies a strategic location near the entry point to the Gulf of Oman from the Arabian Sea. Because of its location, it became the site of military facilities used first by the British and then by the United States, following an access agreement signed in 1980 by the United States and Oman.       West of the coastal areas lies the tableland of central Oman. The Wadi ": null
    },
    {
        "Samail": "Samail"
    },
    {
        " , a valley that forms the traditional route between Muscat and the interior divides the Hajar range into two subranges: Al-Ḥajar Al-Gharbī  and Al-Ḥajar Ash-Sharqī . At the same time, mountains in the central region, where the highest of the Hajar are located, are recognised as the ": null
    },
    {
        "Central Hajar": "Central Hajar Mountains"
    },
    {
        " .  The general elevation is about , but the peaks of the high ridge known as ": null
    },
    {
        "Jebel Akhdar": "Jebel Akhdar"
    },
    {
        " , rise to more than . Jabal Akhdar is a home of the ": null
    },
    {
        "Arabian tahr": "Arabian Tahr"
    },
    {
        ", a unique species of wild goat. In the hope of saving this rare animal, Sultan ": null
    },
    {
        "Qabus ibn Said": "Qabus Ibn Said"
    },
    {
        " has declared part of the mountain a national park. Behind the Western Mountains are two inland regions, Az-Zahirah and Inner Oman, separated by the lateral range of the Rub al Khali. Adjoining the Eastern Hajar Mountains are the sandy regions of Ash-Sharqiyah and Jalan, which also border the desert.          Dhofar region extends from Ras ash-Sharbatat to the border of Yemen and north to the clearly defined border with Saudi Arabia. Its capital, ": null
    },
    {
        "Salalah": "Salalah"
    },
    {
        ", was the permanent residence of Sultan ": null
    },
    {
        "Said ibn Taimur Al Said": "Said Bin Taimur Of Muscat"
    },
    {
        " and the birthplace of the present sultan, ": null
    },
    {
        "Qaboos ibn Said": "Qaboos Ibn Said"
    },
    {
        ". The highest peak of the ": null
    },
    {
        "Dhofar Mountains": "Dhofar Mountains"
    },
    {
        ", ": null
    },
    {
        "Jabal Samhan": "Jabal Samhan"
    },
    {
        ", is about .  The coast of Dhofar is fertile, being watered by monsoonal fogs from the ": null
    },
    {
        "Indian Ocean": "Indian Ocean"
    },
    {
        " and is part of the ": null
    },
    {
        "Arabian Peninsula coastal fog desert": "Arabian Peninsula Coastal Fog Desert"
    },
    {
        " ecoregion": "Ecoregion"
    },
    {
        ".     Al Dharerah region consists of three parts: Dhank, ": null
    },
    {
        "Ibri": "Ibri"
    },
    {
        " and Yanqul.          According to ": null
    },
    {
        "Köppen": "Köppen"
    },
    {
        " climate classification Oman has three different climates  and is dominated by ": null
    },
    {
        "BWh": "Bwh"
    },
    {
        ".     With the exception of ": null
    },
    {
        "Dhofar": "Dhofar"
    },
    {
        "i region, which has a strong monsoon climate and receives warm winds from the Indian Ocean, the climate of Oman is extremely hot and dry most of the year.     Summer begins in mid-April and lasts until October. The highest temperatures are registered in the interior, where readings up to a maximum of  have been recorded. On the Batinah coastal plain, summer temperatures seldom exceed , but, because of the low elevation, the humidity may be as high as 90 percent. The mean summer temperature in Muscat is , but the gharbī , a strong wind that blows from the Rub al-Khali, can raise temperatures from the towns on the Gulf of Oman by  to .     Winter temperatures are mild and pleasant, ranging between .     ": null
    },
    {
        "Precipitation": "Precipitation"
    },
    {
        " on the coasts and on the interior plains ranges from  a year and falls during mid- and late winter. Rainfall in the mountains, particularly over Jebel Akhdar, is much higher and may reach .     Because the ": null
    },
    {
        "plateau": "Plateau"
    },
    {
        " of Jebel Akhdar is porous limestone, rainfall seeps quickly through it, and the vegetation, which might be expected to be more lush, is meager. However, a huge reservoir under the plateau provides springs for low-lying areas. In addition, an enormous ": null
    },
    {
        "wadi": "Wadi"
    },
    {
        " channels water to these valleys, making the area agriculturally productive in years of good rainfall.     ": null
    },
    {
        "Dhofar": "Dhofar"
    },
    {
        ", benefiting from a southwest ": null
    },
    {
        "monsoon": "Monsoon"
    },
    {
        " between June and September, receives heavier rainfall and has constantly running streams, which make the region Omans most fertile area.     Occasionally, a cyclone from the North Indian Ocean makes landfall, bringing with it heavy rain, such as ": null
    },
    {
        "Cyclone Kelia": "Cyclone Kelia"
    },
    {
        " did in 2011. Oman was hit by ": null
    },
    {
        "Cyclone Gonu": "Cyclone Gonu"
    },
    {
        " on June 6. Large areas in the capital area region in the Governorate of Muscat and in Amerat and ": null
    },
    {
        "Quriyat": "Qurayyat, Oman"
    },
    {
        " were severely affected. Gonu first hit the southern city of Sur late on June 5, 2007.        Area:  ": null
    },
    {
        "Saudi Arabia": "Saudi Arabia"
    },
    {
        ": , ": null
    },
    {
        "United Arab Emirates": "United Arab Emirates"
    },
    {
        ": , ": null
    },
    {
        "Yemen": "Yemen"
    },
    {
        ":     ": null
    },
    {
        "exclusive economic zone": "Exclusive Economic Zone"
    },
    {
        ":  and  ": null
    },
    {
        "petroleum": "Petroleum"
    },
    {
        ", ": null
    },
    {
        "copper": "Copper"
    },
    {
        ", ": null
    },
    {
        "asbestos": "Asbestos"
    },
    {
        ", Limited ": null
    },
    {
        "marble": "Marble"
    },
    {
        ", ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        ", ": null
    },
    {
        "chromium": "Chromium"
    },
    {
        ", ": null
    },
    {
        "gypsum": "Gypsum"
    },
    {
        ", ": null
    },
    {
        "natural gas": "Natural Gas"
    },
    {
        "    Total renewable water resources:        Natural hazards: Summer winds often raise large sandstorms and dust storms in the interior during periodic droughts. Following rain, wadis can fill with rainwater water and vast tracts of land can be flooded. A cyclone making landfall can severely flood large areas, or blow sand all over the place.   Environment - current issues: Soil salinity is rising. There is beach pollution from oil spills. There are very limited natural fresh water resources.   Geographical note: Oman is in a strategic location on ": null
    },
    {
        "Musandam Peninsula": "Musandam Peninsula"
    },
    {
        " adjacent to ": null
    },
    {
        "Strait of Hormuz": "Strait Of Hormuz"
    },
    {
        ", a vital transit point for world ": null
    },
    {
        "crude oil": "Crude Oil"
    }
]