[
    {
        "          Paraguay  is a ": null
    },
    {
        "landlocked country": "landlocked country"
    },
    {
        " in South America, bordering ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        " and ": null
    },
    {
        "Bolivia": "bolivia"
    },
    {
        ". The ": null
    },
    {
        "Paraguay River": "paraguay river"
    },
    {
        "  divides the country into strikingly different eastern and western regions. Both the eastern region  and the western region  gently slope toward and are drained into the Paraguay River, which separates and unifies the two regions. With the Paraneña region reaching southward and the Chaco extending to the north, Paraguay straddles the ": null
    },
    {
        "Tropic of Capricorn": "tropic of capricorn"
    },
    {
        " and experiences both ": null
    },
    {
        "subtropical": "subtropics"
    },
    {
        " and ": null
    },
    {
        "tropical": "tropics"
    },
    {
        " climates.       Paraguay borders on three substantially larger countries: Bolivia, Brazil, and Argentina. The definition of the northwestern boundary with Bolivia, extending through the low hills of the Chaco region, dates from 42 The boundary between the Chaco and Brazil was defined in 42; it continues from the confluence of the ": null
    },
    {
        "Apa River": "apa river"
    },
    {
        "  and Paraguay River northward along the course of the Río Paraguay to the border with Bolivia. The northern border of the Paraneña region, set in 42 follows the course of the ": null
    },
    {
        "Paraná River": "paraná river"
    },
    {
        " , the ": null
    },
    {
        "ridge": "ridge"
    },
    {
        "s of the mountains in the northeast region, and finally the course of the Apa River until it empties into the Paraguay River. Paraguays southern border with Argentina comprises the ": null
    },
    {
        "Pilcomayo River": "pilcomayo river"
    },
    {
        " , Paraná River, and Paraguay River. Argentina and Paraguay agreed on these boundaries in 42          Paraguay falls into two main ": null
    },
    {
        "natural region": "natural region"
    },
    {
        "s: the Paraneña region  and the Chaco region .     About 42 percent of Paraguays population resides in the Paraneña region, which has all the significant ": null
    },
    {
        "orographic": "orography"
    },
    {
        " features and a more predictable climate. The Paraneña region can be generally described as consisting of an area of highlands in the east that slopes toward the Río Paraguay and becomes an area of lowlands, subject to floods, along the river.     The Chaco consists predominantly of lowlands, also inclined toward the Río Paraguay, that are alternately flooded and parched.       The Eastern region extends from the Río Paraguay eastward to the Río Paraná, which forms the border with Brazil and Argentina. The eastern hills and mountains, an extension of a plateau in southern Brazil, dominate the region. They reach to about  above sea level at their highest point. The Eastern region also has spacious ": null
    },
    {
        "plain": "plain"
    },
    {
        "s, broad valleys, and ": null
    },
    {
        "lowland": "lowland"
    },
    {
        "s. About 42% of the region lies below  in elevation; the lowest elevation, , occurs in the extreme south at the confluence of the Río Paraguay and Río Paraná.     The Eastern region is drained primarily by rivers that flow westward to the Río Paraguay, although some rivers flow eastward to the Río Paraná. Low-lying ": null
    },
    {
        "meadow": "meadow"
    },
    {
        "s, subject to floods, separate the eastern mountains from the Río Paraguay.     The Eastern region as a whole naturally divides into five physiographic subregions:     the Paraná Plateau   the Northern Upland   the Central Hill Belt   the Central Lowland   the Ñeembucú Plain     In the east, the heavily wooded Paraná Plateau occupies one-third of the region and extends its full length from north to south and up to  westward from the Brazilian and Argentine borders. The Paraná Plateaus western edge is defined by an escarpment that descends from an elevation of about  in the north to about  at the subregions southern extremity. The plateau slopes moderately to east and south, its remarkably uniform surface interrupted only by the narrow valleys carved by the westward-flowing tributaries of the Río Paraná.     The Northern Upland, the Central Hill Belt, and the Central Lowland constitute the lower terrain lying between the escarpment and the Río Paraguay. The first of these eroded extensions stretching westward of the Paraná Plateau—the Northern Upland—occupies the portion northward from the ": null
    },
    {
        "Aquidabán River": "aquidabán river"
    },
    {
        "  to the Apa River on the Brazilian border. For the most part it consists of a rolling plateau about  above sea level and  above the plain farther to the south. The Central Hill Belt encompasses the area in the vicinity of ": null
    },
    {
        "Asunción": "asunción"
    },
    {
        ". Although nearly flat surfaces occur in this subregion, the rolling terrain is extremely uneven. Small, isolated peaks are numerous, and it is here that the only lakes of any size are found. Between these two upland subregions lies the Central Lowland, an area of low elevation and relief, sloping gently upward from the Río Paraguay toward the Paraná Plateau. The valleys of the Central Lowlands westward-flowing rivers are broad and shallow, and periodic flooding of their courses creates seasonal swamps. This subregions most conspicuous features, its flat-topped hills, project  from the grassy plain. Thickly forested, these hills cover areas ranging from a hectare to several square kilometers . Apparently the weathered remnants of rock related to geological formations farther to the east, these hills are called islas de monte , and their margins are known as costas .     The remaining subregion—the Ñeembucú Plain—lies in the southwest corner of the Paraneña region. This alluvial flatland has a slight westerly-southwesterly slope obscured by gentle undulations. The Tebicuary River —a major tributary of the Río Paraguay – bisects the swampy lowland, which is broken in its central portion by rounded swells of land up to three meters in height.     The main orographic features of the Paraneña region include the Cordillera de Amambay, the Cordillera de Mbaracayú, and the Cordillera de Caaguazú. The Cordillera de Amambay extends from the northeast corner of the region south and slightly east along the Brazilian border. The mountains reach on average  above sea level, although the highest point reaches . The main chain,  long, has smaller branches that extend to the west and die out along the banks of the Río Paraguay in the Northern Upland.     The ": null
    },
    {
        "Cordillera de Amambay": "cordillera de amambay"
    },
    {
        " merges with the ": null
    },
    {
        "Cordillera de Mbaracayú": "cordillera de mbaracayú"
    },
    {
        ", which reaches eastward  to the Río Paraná. The average height of this mountain chain is ; the highest point of the chain, , lies within Brazilian territory. The Río Paraná forms the Salto del Guairá waterfall where it cuts through the mountains of the Cordillera de Mbaracayú to enter Argentina.     The ": null
    },
    {
        "Cordillera de Caaguazú": "cordillera de caaguazú"
    },
    {
        " falls where the other two main mountain ranges meet and extends south, with an average height of . Its highest point, ": null
    },
    {
        "Cerro de San Joaquín": "cerro de san joaquín"
    },
    {
        ", reaches  above sea level. This chain is not a continuous massif but is interrupted by hills and undulations covered with forests and meadows. The Cordillera de Caaguazú reaches westward from the Paraná Plateau into the Central Hill Belt.     A lesser mountain chain, the ": null
    },
    {
        "Serranía de Mbaracayú": "serranía de mbaracayú"
    },
    {
        ", also rises at the point where the Cordillera de Amambay and Cordillera de Mbaracayú meet. The Serranía de Mbaracayú extends east and then south to parallel the Río Paraná; the mountain chain has an average height of .               Separated from the Eastern region by the Paraguay River, the Chaco region is a vast plain with elevations reaching no higher than  and averaging . Covering more than 42 percent of Paraguays total land area, the Chaco plain slopes gently eastward to the Río Paraguay.     The Paraguayan Chaco is subdivided into two parts. The Alto Chaco , also called Chaco Seco is the western three-quarters of the region, bordering on Bolivia, while the Bajo Chaco or Chaco Húmedo borders on the Paraguay River. The low hills in the northwestern part of the Alto Chaco are the highest parts in the Gran Chaco. One prominent ": null
    },
    {
        "wetland": "wetland"
    },
    {
        " of the Bajo Chaco is the Estero Patiño, which at  forms the largest ": null
    },
    {
        "swamp": "swamp"
    },
    {
        " in the country.     The Paraguay Chacos western two-thirds belong to the ": null
    },
    {
        "semi-arid": "semi-arid climate"
    },
    {
        " tropics with annual precipitations between , vegetation being dry low scrub in the west to higher growth ": null
    },
    {
        "xerophytic": "xerophyte"
    },
    {
        "  forest towards the east. The eastern third belongs to the semi-humid tropics, with rainfall between , taller vegetation, and tropical semi-humid forest. A belt about  in length along the Paraguay River again has a different ": null
    },
    {
        "evergreen": "evergreen"
    },
    {
        " vegetation of wetlands and ": null
    },
    {
        "palm tree": "arecaceae"
    },
    {
        " forests .     Annual evaporation is around . The very pronounced dry season lasts from May to October, and a wet season occurs from November to April, when the vegetation turns green and abundant.     The soils of the Chaco are very deep ": null
    },
    {
        "sediment": "sediment"
    },
    {
        "ary ": null
    },
    {
        "soil": "soil"
    },
    {
        "s rich in nutrients, including ": null
    },
    {
        "luvisol": "luvisol"
    },
    {
        "s, ": null
    },
    {
        "cambisols": "cambisols"
    },
    {
        ", and ": null
    },
    {
        "regosols": "regosols"
    },
    {
        ", and are in general very fertile and apt for agriculture and pasture , more so than most of the worlds semi-arid tropics.      Limiting factors include a lack of ground freshwater in most of the Paraguays Chaco, except in the north and the west. The lowlands facing the Paraguay River have insufficient drainage and seasonal flooding as a constraint.          The Río Paraguay has a total course of 42  km, 42  km of which are ": null
    },
    {
        "navigable": "navigability"
    },
    {
        " and 42  km of which either border on or pass through Paraguay. The head of navigation is located in Brazil, and during most years vessels with 42 m ": null
    },
    {
        "drafts": "draft"
    },
    {
        " can reach ": null
    },
    {
        "Concepción": "concepción, paraguay"
    },
    {
        " without difficulty. Medium-sized ocean vessels can sometimes reach Asunción, but the twisting course and shifting ": null
    },
    {
        "sandbars": "shoal"
    },
    {
        " can make this transit difficult. Although sluggish and shallow, the river sometimes overflows its low ": null
    },
    {
        "banks": "bank"
    },
    {
        ", forming temporary swamps and flooding villages. ": null
    },
    {
        "River island": "river island"
    },
    {
        "s, ": null
    },
    {
        "meander": "meander"
    },
    {
        " scars, and ": null
    },
    {
        "oxbow lakes": "oxbow lake"
    },
    {
        " attest to frequent changes in course.     The major tributaries entering the Paraguay River from the Paraneña region—such as the Apa, Aquidabán, and Tebicuary Rivers—descend rapidly from their sources in the Paraná Plateau to the lower lands. There they broaden and become sluggish as they meander westward. After heavy rains these rivers sometimes flood nearby lowlands.      About 42  km long, the Paraná River is the second major river in the country. From ": null
    },
    {
        "Salto del Guairá": "salto del guairá"
    },
    {
        ", where the river enters Paraguay, the Paraná River flows 42  km to its juncture with the Río Paraguay and then continues southward to the ": null
    },
    {
        "Río de la Plata": "río de la plata"
    },
    {
        " Estuary at ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        ", Argentina. In general, the Río Paraná is navigable by large ships only up to ": null
    },
    {
        "Encarnación, Paraguay": "encarnación, paraguay"
    },
    {
        " but smaller boats may go somewhat farther. In summer months the river is deep enough to permit vessels with drafts of up to three meters to reach Salto del Guairá, but seasonal and other occasional conditions severely limit the rivers navigational value. On the upper course, sudden floods may raise the water level by as much as five meters in twenty-four hours; west of Encarnación, however, the rocks of the riverbed sometimes come within one meter of the surface during winter and effectively sever communication between the upper river and Buenos Aires.     The rivers flowing eastward across the Paraneña region as tributaries of the Paraná River are shorter, faster-flowing, and narrower than the tributaries of the Paraguay River. Sixteen of these rivers and numerous smaller streams enter the Paraná River above Encarnación.     Paraguays third largest river, the Pilcomayo River, flows into the Paraguay River near Asunción after demarcating the entire border between the Chaco region and Argentina. During most of its course, the river is sluggish and marshy, although small craft can navigate its lower reaches. When the Pilcomayo River overflows its low banks, it feeds the Patiño Estuary .     Drainage in the Chaco region is generally poor because of the flatness of the land and the small number of important streams. In many parts of the region, the ": null
    },
    {
        "water table": "water table"
    },
    {
        " is only a meter beneath the surface of the ground, and there are numerous small ponds and seasonal marshes. As a consequence of the poor drainage, most of the water is too salty for drinking or irrigation.     Because of the seasonal overflow of the numerous westward-flowing streams, the lowland areas of the Paraneña region also experience poor drainage conditions, particularly in the Ñeembucú Plain in the southwest, where an almost impervious clay subsurface prevents the absorption of excess surface water into the aquifer. About 42 percent of the Paraneña region is flooded from time to time, creating extensive areas of seasonal marshlands. Permanent bogs are found only near the largest geographic depressions, however.          Paraguay experiences a subtropical climate in the Paraneña region and a tropical climate in the Chaco. The Paraneña region has a humid climate, with abundant precipitation throughout the year and only moderate seasonal changes in temperature. During the ": null
    },
    {
        "Southern Hemisphere": "southern hemisphere"
    },
    {
        "s summer, which corresponds to the northern winter, the dominant influence on the climate is the warm ": null
    },
    {
        "sirocco": "sirocco"
    },
    {
        " winds blowing out of the northeast. During the winter, the dominant wind is the cold ": null
    },
    {
        "pampero": "pampero"
    },
    {
        " from the ": null
    },
    {
        "South Atlantic": "south atlantic"
    },
    {
        ", which blows across Argentina and is deflected northeastward by the Andes in the southern part of that country. Because of the lack of topographic barriers within Paraguay, these opposite prevailing winds bring about abrupt and irregular changes in the usually moderate weather. Winds are generally brisk. Velocities of 42  km/h have been reported in southern locations, and the town of Encarnación was once leveled by a ": null
    },
    {
        "tornado": "tornado"
    },
    {
        ".     The Paraneña region has only two distinct seasons: summer from October to March and winter from May to August. April and September are transitional months in which temperatures are below the midsummer averages and minimums may dip below freezing. Climatically, autumn and spring do not really exist. During the mild winters, July is the coldest month, with a mean temperature of about  in Asunción and  on the Paraná Plateau. There is no significant north-south variation. The number of days with temperatures falling below freezing ranges from as few as three to as many as sixteen yearly, and with even wider variations deep in the interior. Some winters are very mild, with winds blowing constantly from the north, and little frost. During a cold winter, however, tongues of ": null
    },
    {
        "Antarctic": "antarctic"
    },
    {
        " air bring subfreezing temperatures to all areas. No part of the Paraneña region is entirely free from the possibility of frost and consequent damage to crops, and snow flurries have been reported in various locations.     Moist tropical air keeps the weather warm in the Paraneña region from October through March. In Asunción the seasonal average is about , with January—the warmest month—averaging . Villarrica has a seasonal mean temperature of  and a January mean of . During the summer, daytime temperatures reaching  are fairly common. Frequent waves of cool air from the south, however, cause weather that alternates between clear, humid conditions and storms. Skies will be almost cloudless for a week to ten days as temperature and humidity rise continually. As the soggy heat nears intolerable limits, thunderstorms preceding a cold front will blow in from the south, and temperatures will drop as much as  in a few minutes.     ": null
    },
    {
        "Rainfall": "rainfall"
    },
    {
        " in the Paraneña region is fairly evenly distributed. Although local meteorological conditions play a contributing role, rain usually falls when tropical air masses are dominant. The least rain falls in August, when averages in various parts of the region range from . The two periods of maximum precipitation are March through May and October to November.     For the region as a whole, the difference between the driest and the wettest months ranges from . The annual average rainfall is , although the average on the Paraná Plateau is  greater. All subregions may experience considerable variations from year to year. Asunción has recorded as much as  and as little as  of annual rainfall; ": null
    },
    {
        "Puerto Bertoni": "puerto bertoni"
    },
    {
        " on the Paraná Plateau has recorded as much as  and as little as .     In contrast to the Paraneña region, the Chaco has a tropical wet-and-dry climate bordering on semi-arid. The Chaco experiences seasons that alternately flood and parch the land, yet seasonal variations in temperature are modest. Chaco temperatures are usually high, the averages dropping only slightly in winter. Even at night the air is stifling despite the usually present breezes. Rainfall is light, varying from  per year, except in the higher land to the northwest where it is somewhat greater. Rainfall is concentrated in the summer months, and extensive areas that are deserts in winter become summer swamps.          Current environmental issues include deforestation and water pollution . Paraguay is a party to the ": null
    },
    {
        "United Nations Framework Convention on Climate Change": "united nations framework convention on climate change"
    },
    {
        ", the ": null
    },
    {
        "Climate Change-Kyoto Protocol": "climate change-kyoto protocol"
    },
    {
        ", the ": null
    },
    {
        "Law of the Sea": "law of the sea"
    },
    {
        ", and the ": null
    },
    {
        "Ozone Layer Protection": "ozone layer protection"
    },
    {
        ". It has also signed, but not ratified, the ": null
    },
    {
        "Nuclear Test Ban": "nuclear test ban"
    },
    {
        ".       Geographic coordinates:      Area:   total:   42  km 42   land:   42  km 42   water:   42  km 42     Land boundaries:   total:   42  km   border countries:   ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        " 42  km, ": null
    },
    {
        "Bolivia": "bolivia"
    },
    {
        " 42  km, Brazil 42  km     Coastline:   42  km     Elevation extremes:   lowest point:   junction of ": null
    },
    {
        "Rio Paraguay": "rio paraguay"
    },
    {
        " and ": null
    },
    {
        "Rio Paraná": "rio paraná"
    },
    {
        " 42 m   highest point:   ": null
    },
    {
        "Cerro Peró": "cerro peró"
    },
    {
        " 42 m     Land use:   arable land:   42%   permanent crops:   42%   permanent pastures:   42%   forests and woodland:   42%   other:   42%     Irrigated land:   42  km 42         This is a list of the extreme points of Paraguay, the points that are farther north, south, east or west than any other location.     Northernmost point – the Hito VII Fortin Coronel Sanchez pillar on the border with ": null
    },
    {
        "Bolivia": "bolivia"
    },
    {
        ", ": null
    },
    {
        "Alto Paraguay Department": "alto paraguay department"
    },
    {
        " Itaipu reservoir": "itaipu dam"
    },
    {
        " near the town of ": null
    },
    {
        "Álvar Núñez Cabeza de Vaca": "álvar núñez cabeza de vaca, paraguay"
    },
    {
        ", ": null
    },
    {
        "Canindeyú Department": "canindeyú department"
    },
    {
        " Isla Talavera": "isla talavera"
    },
    {
        " in the ": null
    },
    {
        "Rio Paraná": "rio paraná"
    },
    {
        ", ": null
    },
    {
        "Itapúa Department": "itapúa department"
    },
    {
        " Cambyretá": "cambyretá"
    },
    {
        " and immediately north of the Argentinian town of ": null
    },
    {
        "Candelaria": "candelaria, argentina"
    },
    {
        ", Itapúa Department   Westernmost point – the Hito I Esmeralda pillar on the border with ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ", ": null
    },
    {
        "Boquerón department": "boquerón department"
    },
    {
        " Cerro Tres Kandú": "cerro tres kandú"
    },
    {
        ", ": null
    },
    {
        "Guairá Department": "guairá department"
    },
    {
        ", 42 m   Lowest point – junction of ": null
    },
    {
        "Rio Paraguay": "rio paraguay"
    },
    {
        " and ": null
    },
    {
        "Rio Parana": "rio parana"
    },
    {
        ", 42 m   Geographic center – 42 km west of ": null
    },
    {
        "Concepción": "concepción, paraguay"
    }
]