[
    {
        "                    The  Comoros archipelago  consists of four main islands aligned along a northwest-southeast axis at the north end of the ": null
    },
    {
        "Mozambique Channel": "mozambique channel"
    },
    {
        ", between ": null
    },
    {
        "Mozambique": "mozambique"
    },
    {
        " and the island of ": null
    },
    {
        "Madagascar": "madagascar"
    },
    {
        ". Still widely known by their French names, the islands officially have been called by their ": null
    },
    {
        "Swahili": "swahili language"
    },
    {
        " names by the Comorian government. They are ": null
    },
    {
        "Grande Comore": "grande comore"
    },
    {
        " , ": null
    },
    {
        "Mohéli": "mohéli"
    },
    {
        " , ": null
    },
    {
        "Anjouan": "anjouan"
    },
    {
        " , and ": null
    },
    {
        "Mayotte": "mayotte"
    },
    {
        " . The islands distance from each other—Grande Comore is some 200 kilometers from Mayotte, forty kilometers from Mohéli, and eighty kilometers from Grande Comore—along with a lack of good harbor facilities, make transportation and communication difficult. Comoros has lots of sun.       The islands have a total land area of 2,236 square kilometers , and claim territorial waters of 320 square kilometers. ": null
    },
    {
        "Mount Karthala": "mount karthala"
    },
    {
        " on Grande Comore is an active volcano. From April 17 to 19, 2005, the volcano began spewing ash and gas, forcing as many as 10,000 people to flee. Comoros is located within the ": null
    },
    {
        "Somali plate": "somali plate"
    },
    {
        ".       Grande Comore is the largest island, sixty-seven kilometers long and twenty-seven kilometers wide, with a total area of 1,146 square kilometers. The most recently formed of the four islands in the archipelago, it is also of volcanic origin. Two volcanoes form the islands most prominent topographic features: La Grille in the north, with an elevation of 1,000 meters, is extinct and largely eroded; Kartala in the south, rising to a height of 2,361 meters, last erupted in 1977. A plateau averaging 600 to 700 meters high connects the two mountains. Because Grande Comore is geologically a relatively new island, its soil is thin and rocky and cannot hold water. As a result, water from the islands heavy rainfall must be stored in catchment tanks. There are no coral reefs along the coast, and the island lacks a good harbor for ships. One of the largest remnants of the Comoros once-extensive rain forests is on the slopes of Kartala. The national capital has been at Moroni since 1962.       Anjouan, triangular shaped and forty kilometers from apex to base, has an area of 424 square kilometers. Three mountain chains — Sima, Nioumakele, and Jimilime—emanate from a central peak, Mtingui , giving the island its distinctive shape. Older than Grande Comore, Anjouan has deeper soil cover, but overcultivation has caused serious erosion. A ": null
    },
    {
        "coral reef": "coral reef"
    },
    {
        " lies close to shore; the islands capital of ": null
    },
    {
        "Mutsamudu": "mutsamudu"
    },
    {
        " is also its main port.       Mohéli is thirty kilometers long and twelve kilometers wide, with an area of 290 square kilometers. It is the smallest of the four islands and has a central mountain chain reaching 860 meters at its highest. Like Grande Comore, it retains stands of rain forest. Mohélis capital is Fomboni.       Mayotte, geologically the oldest of the four islands, is thirty-nine kilometers long and twenty-two kilometers wide, totaling 375 square kilometers, and its highest points are between 500 and 600 meters above sea level. Because of greater weathering of the volcanic rock, the soil is relatively rich in some areas. A well-developed coral reef that encircles much of the island ensures protection for ships and a habitat for fish. Dzaoudzi, capital of the Comoros until 1962 and now Mayottes administrative center, is situated on a rocky outcropping off the east shore of the main island. Dzaoudzi is linked by a causeway to le Pamanzi, which at ten kilometers in area is the largest of several islets adjacent to Mayotte. Islets are also scattered in the coastal waters of Grande Comore, Anjouan, and Mohéli.       Comorian waters are the habitat of the ": null
    },
    {
        "coelacanth": "coelacanth"
    },
    {
        ", a rare fish with limblike fins and a cartilaginous skeleton, the fossil remains of which date as far back as 400 million years and which was once thought to have become extinct about 70 million years ago. A live specimen was caught in 1938 off southern Africa; other coelacanths have since been found in the vicinity of the Comoro Islands.     Several mammals are unique to the islands themselves. Livingstones fruit bat, although plentiful when discovered by explorer David Livingstone in 1863, has been reduced to a population of about 120, entirely on Anjouan. The worlds largest bat, the jet-black Livingstone fruit bat has a wingspan of nearly two meters. A British preservation group sent an expedition to the Comoros in 1992 to bring some of the bats to Britain to establish a breeding population.     A hybrid of the ": null
    },
    {
        "common brown lemur": "common brown lemur"
    },
    {
        "  originally from Madagascar, was introduced by humans prior to European colonization and is found on Mayotte. The ": null
    },
    {
        "mongoose lemur": "mongoose lemur"
    },
    {
        " , also introduced from Madagascar by humans, can be found on the islands of Mohéli and Anjouan.     22 species of bird are unique to the archipelago and 17 of these are restricted to the Union of the Comoros. These include the ": null
    },
    {
        "Karthala scops-owl": "karthala scops-owl"
    },
    {
        ", ": null
    },
    {
        "Anjouan scops-owl": "anjouan scops-owl"
    },
    {
        " and ": null
    },
    {
        "Humblots flycatcher": "humblots flycatcher"
    },
    {
        ". Ian Sinclair & Olivier Langrand https://books.google.com/books?idv7orZe55T5EC & printsecfrontcovervonepage & q & ffalse Birds of the Indian Ocean Islands, Struik, Cape Town.     Partly in response to international pressures, Comorians in the 1990s have become more concerned about the environment. Steps are being taken not only to preserve the rare fauna, but also to counteract degradation of the environment, especially on densely populated Anjouan. Specifically, to minimize the cutting down of trees for fuel, ": null
    },
    {
        "kerosene": "kerosene"
    },
    {
        " is being subsidized, and efforts are being made to replace the loss of the forest cover caused by ylang-ylang distillation for perfume. The Community Development Support Fund, sponsored by the International Development Association and the Comorian government, is working to improve water supply on the islands as well.            The climate is marine tropical, with two seasons: hot and humid from November to April, the result of the northeastern monsoon, and a cooler, drier season the rest of the year. Average monthly temperatures range from  along the coasts. Although the average annual precipitation is , water is a scarce commodity in many parts of the Comoros. Mohéli and Mayotte possess streams and other natural sources of water, but Grande Comore and Anjouan, whose mountainous landscapes retain water poorly, are almost devoid of naturally occurring running water. Cyclones, occurring during the hot and wet season, can cause extensive damage, especially in coastal areas. On the average, at least twice each decade houses, farms, and harbor facilities are devastated by these great storms.         This is a list of the extreme points of the Comoros, the points that are farther north, south, east or west than any other location. This list excludes the French-administered island of Mayotte which is claimed by the Comorian government.     Northernmost point – unnamed headland north-west of ": null
    },
    {
        "Bangoua Kouni": "bangoua kouni"
    },
    {
        ", Grande Comore   Easternmost point – unnamed ": null
    },
    {
        "peninsula": "peninsula"
    },
    {
        " east of ": null
    },
    {
        "Domoni": "domoni"
    },
    {
        ", Anjouan   Southernmost point - unnamed headland on ": null
    },
    {
        "Ile Canzouni": "ile canzouni"
    },
    {
        ", Mohéli   Westernmost point - unnamed headland west of ": null
    },
    {
        "Iconi": "iconi"
    },
    {
        ", Grande Comore         Area:   2,235 km 2     Coastline:   340 km     Climate:   tropical marine; rainy season     Terrain:   volcanic islands, interiors vary from steep mountains to low hills     Elevation extremes:   lowest point:   ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        " 0 m   highest point:   ": null
    },
    {
        "Karthala": "karthala"
    },
    {
        " 2,360 m     Natural resources:   fish     Land use:   arable land:   47.29%   permanent crops:   29.55%   other:   23.16%     Irrigated land:   1.3 km 2     Total renewable water resources:   1.2 km 3     Freshwater withdrawal :   total:   0.01 km 3 /yr   per capital:   16.86 m 3 /yr     Natural hazards:   ": null
    },
    {
        "cyclones": "cyclone"
    },
    {
        "possible during rainy season ; volcanic activity on ": null
    },
    {
        "Grand Comore": "grand comore"
    },
    {
        "     Environmental - current issues:   ": null
    },
    {
        "soil degradation": "soil degradation"
    },
    {
        " and ": null
    },
    {
        "erosion": "soil erosion"
    },
    {
        " results from crop cultivation on slopes without proper terracing; ": null
    },
    {
        "deforestation": "deforestation"
    }
]