[
    {
        "Luxembourg": "luxembourg"
    },
    {
        " is a small country located in the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ", part of ": null
    },
    {
        "North-West Europe": "north-west europe"
    },
    {
        " It borders ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " for  to the west and north, ": null
    },
    {
        "France": "france"
    },
    {
        "  to the south, and ": null
    },
    {
        "Germany": "germany"
    },
    {
        "  to the east. Luxembourg is landlocked, separated from the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " by Belgium.     The topography of the country is divided very clearly between the hilly ": null
    },
    {
        "Oesling": "oesling"
    },
    {
        " of the northern third of the Grand Duchy and the flat ": null
    },
    {
        "Gutland": "gutland"
    },
    {
        ", which occupies the southern two-thirds. The countrys longest river is the ": null
    },
    {
        "Sauer": "sauer"
    },
    {
        ", which is a tributary of the ": null
    },
    {
        "Moselle": "moselle"
    },
    {
        ", the basin of which includes almost all of Luxembourgs area. Other major rivers include the ": null
    },
    {
        "Alzette": "alzette"
    },
    {
        " in the south and the ": null
    },
    {
        "Wiltz": "wiltz river"
    },
    {
        " in the north.     The ": null
    },
    {
        "capital": "capital"
    },
    {
        ", and by far the largest city, is ": null
    },
    {
        "Luxembourg City": "luxembourg city"
    },
    {
        ", which is located in the Gutland, as are most of the countrys main population centres, including ": null
    },
    {
        "Esch-sur-Alzette": "esch-sur-alzette"
    },
    {
        ", ": null
    },
    {
        "Dudelange": "dudelange"
    },
    {
        ", and ": null
    },
    {
        "Differdange": "differdange"
    },
    {
        ". Besides Luxembourg City, the other main towns are primarily located in the southern ": null
    },
    {
        "Red Lands": "red lands"
    },
    {
        " region, which lines the border between Luxembourg and France to the south.            Despite its small size, Luxembourg has a varied topography, with two main features to its landscape. The northern section of the country is formed by part of the plateau of the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        ", where the mountain heights range from . The rest of the country is made up of undulating countryside with broad valleys. The capital, ": null
    },
    {
        "Luxembourg City": "luxembourg city"
    },
    {
        ", is located in the southern part of the country.       The most prominent landmark, the high plateau of the Ardennes in the north. At its highest point, it reaches a height of . Commonly known as the Oesling, the Ardennes region covers , about 42% of the entire country. Rugged scenery predominates because ": null
    },
    {
        "river erosion": "river erosion"
    },
    {
        " over thousands of years has left a varied, low mountain landscape, densely covered with vegetation, sometimes with considerable variations in height. These differences in relief, together with stretches of water interspersed with forests, fields, and pastures are the main features that make the landscape so distinctive. Typical of this high area, however, is the infertile soil and poor drainage resulting in numerous ": null
    },
    {
        "peat bogs": "peat bogs"
    },
    {
        ", which were once exploited as fuel. These factors, combined with heavy rainfall and frost, made this an inhospitable environment for the first settlers.     Even today, the living conditions in such an environment are not particularly favourable. Nevertheless, some 42 people make a living of the land through either forestry, small-scale farming, or environment work. Because the soil is so difficult to cultivate, most of the land is used for cattle pasture. The Ardennes region also includes the ": null
    },
    {
        "Upper Sûre National Park": "upper sûre national park"
    },
    {
        ", an important conservation area and a hikers retreat.     South of the ": null
    },
    {
        "Sûre River": "sauer"
    },
    {
        ", the country is known as the ": null
    },
    {
        "Gutland": "gutland"
    },
    {
        ". The region covers slightly over two-thirds of the country.     The terrain gently rises and falls with an average height of . Agriculture is the main activity as term Gutland arises from the fertile soil and warm, dry summers experienced is this part of the Duchy compared to the Oesling region.     As a result, vegetables and fruit, such as ": null
    },
    {
        "strawberries": "strawberry"
    },
    {
        ", ": null
    },
    {
        "apple": "apple"
    },
    {
        "s, ": null
    },
    {
        "plum": "plum"
    },
    {
        "s, and ": null
    },
    {
        "cherries": "cherry"
    },
    {
        ", are grown in large quantities. River erosion in this area has created deep gorges and caves, resulting in some spectacular scenery.     In the extreme south of the country lies the land of the red rocks – a reference to the deposits of minerals found here. Rich in ": null
    },
    {
        "iron ore": "iron ore"
    },
    {
        ", the district has been a mining and heavy industrial region since Roman if not earlier times and stretches for over . The tall chimneys of the iron and steel works are typical landmarks of the industrial south. To the east lies the ": null
    },
    {
        "grape": "grape"
    },
    {
        "-growing valley of the ": null
    },
    {
        "Moselle": "moselle"
    },
    {
        ". Numerous villages nestle in the deep valleys and behind the vineyards along the river banks. Most villages have at least one winery. Also in the east is the ": null
    },
    {
        "Little Switzerland": "little switzerland"
    },
    {
        " area, characterized by wooded glens and ravines in unusual rock formations.       Luxembourg has a number of minor rivers, such as the ": null
    },
    {
        "Eisch": "eisch"
    },
    {
        ", the ": null
    },
    {
        "Alzette": "alzette"
    },
    {
        ", and the ": null
    },
    {
        "Pétrusse": "pétrusse"
    },
    {
        ", but the main river is the Moselle with its tributaries-the Sûre and the ": null
    },
    {
        "Our": "our river"
    },
    {
        ". Together, their courses serve as a natural boundary between Luxembourg and ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". Along their banks, many of the countrys medieval castles can be found.     The ": null
    },
    {
        "Moselle": "moselle"
    },
    {
        " actually rises in northeast ": null
    },
    {
        "France": "france"
    },
    {
        " and flows north through Luxembourg for  to join the mighty ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " at ": null
    },
    {
        "Koblenz": "koblenz"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". The Moselle is  long, and is navigable, due to canalization for . Green slopes, covered with vines, flank the meandering course of the river.     Rising in Belgium, the Sûre River flows for  in an easterly direction through Luxembourg and into the Moselle. Its sinuous course essentially cuts Luxembourg from east to west. The Our River, flowing along the northeastern border, is a tributary of the Sûre. Its valley is surrounded by unspoiled countryside.     The ": null
    },
    {
        "Upper Sûre lake": "upper sûre lake"
    },
    {
        " is the largest stretch of water in the Grand Duchy. Surrounded by luxuriant vegetation and peaceful creeks, the lake is a centre for water sports, such as sailing, canoeing, and kayaking. Such outdoor activities, which has made it an attractive spot for tourists, have led to the growth of a local crafts industry.     The town of ": null
    },
    {
        "Esch-sur-Sûre": "esch-sur-sûre"
    },
    {
        " nestles at one end of the lake. Immediately above it, the river has been dammed to form a hydroelectric reservoir extending some  up the valley. The Upper Sûre dam was built in the 42s to meet the countrys drinking water requirements.            Elevation extremes:   lowest point:   Moselle in ": null
    },
    {
        "Wasserbillig": "wasserbillig"
    },
    {
        " 42 m   highest point:   ": null
    },
    {
        "Kneiff": "kneiff"
    },
    {
        " in ": null
    },
    {
        "Troisvierges": "troisvierges"
    },
    {
        " 42 m            Luxembourg is part of the ": null
    },
    {
        "West European Continental": "west european continental"
    },
    {
        " climatic region, and enjoys a temperate climate without extremes. Winters are mild, summers fairly cool, and rainfall is high.     Seasonal weather is somewhat different between the northern and southern regions. In the north there is considerable influence from the Atlantic systems, in which the passage of frequent pressure depressions gives rise to unstable weather conditions. This results in overcast skies and considerable drizzle in the winter.     Rainfall reaches  a year in some areas. In the summer, excessive heat is rare and temperatures drop noticeably at night. Low temperatures and humidity make for what those living in this part of the country call, optimistically, an invigorating climate .     In the south, although the rainfall is not significantly low, at around , and the winters no milder, the principal difference is in the higher summer temperatures, especially in the ": null
    },
    {
        "Moselle Valley": "moselle valley"
    },
    {
        ". Crops, especially wine grapes, thrive here. With a mean annual temperature of , the sunniest months are May to August. In the spring, the countryside is a riot of wildflowers and blossoms.       Luxembourgs flora is characterized by the countrys location at the border between the ": null
    },
    {
        "Atlantic-European": "atlantic-european"
    },
    {
        " and ": null
    },
    {
        "Central-European": "central-european"
    },
    {
        " climate zones. In the north, ": null
    },
    {
        "beech": "european beech"
    },
    {
        " and ": null
    },
    {
        "oak": "pedunculate oak"
    },
    {
        " trees are plentiful. The oak trees can grow up to , with a diameter of . They supply large quantities of excellent hardwood timber because of their strength.     Along the riverbanks, species like the ": null
    },
    {
        "black alder": "alnus glutinosa"
    },
    {
        " and ": null
    },
    {
        "willow": "willow"
    },
    {
        "s can be found. Alder wood is pale yellow to reddish brown, fine-textured and durable even under water. It is also an important timber tree mainly because of its disease-resistant properties. Willow trees can reach a height of , and are valued for ornamental purposes.     The narrow, deeply incised valleys of the north also provide a habitat for rare plants and animals, especially the ": null
    },
    {
        "European otter": "european otter"
    },
    {
        ", a protected species. In the industrial south, among the abandoned quarries and deserted open pit mines, nature has reclaimed her own, and there are flowers everywhere.       Party to:   Air Pollution, Air Pollution-Nitrogen Oxides, Air Pollution-Sulphur 42 Air Pollution-Sulphur 42 Air Pollution-Volatile Organic Compounds, Biodiversity, Climate Change, Desertification, Endangered Species, Hazardous Wastes, Marine Dumping, Nuclear Test Ban, Ozone Layer Protection, Ship Pollution, Tropical Timber 42 Tropical Timber 42 Wetlands     Signed, but not ratified:   Air Pollution-Persistent Organic Pollutants, Climate Change-Kyoto Protocol, Environmental Modification, Law of the Sea          Geographic coordinates :        Area:   total:   42 42  km 42   land:   42 42  km 42   water:   42  km 42     Natural resources:   iron ore , arable land     Land use:   arable land:   42%   permanent crops:   42%   other:   42%     Irrigated land:   42  km 42     Total renewable water resources:": null
    }
]