[
    {
        "        The geography of Egypt relates to two regions: ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        " and ": null
    },
    {
        "Southwest Asia": "southwest asia"
    },
    {
        ".     ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " has coastlines on the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ", the ": null
    },
    {
        "River Nile": "river nile"
    },
    {
        ", and the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        ". Egypt borders ": null
    },
    {
        "Libya": "libya"
    },
    {
        " to the west, the ": null
    },
    {
        "Gaza Strip": "gaza strip"
    },
    {
        " to the northeast, and ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        " to the ": null
    },
    {
        "south": "south"
    },
    {
        ". Egypt has an area of  which makes it the 31st largest country in the world.     The longest straight-line distance in Egypt from north to south is , while that from east to west measures . Egypt has more than  of coastline on the Mediterranean Sea, the ": null
    },
    {
        "Gulf of Suez": "gulf of suez"
    },
    {
        ", and the ": null
    },
    {
        "Gulf of Aqaba": "gulf of aqaba"
    },
    {
        ". It has an ": null
    },
    {
        "Exclusive Economic Zone": "exclusive economic zone"
    },
    {
        " of .          Egypt is divided into 28 ": null
    },
    {
        "governorate": "governorate"
    },
    {
        "s, which include two city-governorates: ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        "  and ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " . There are nine governorates of ": null
    },
    {
        "Lower Egypt": "lower egypt"
    },
    {
        " in the ": null
    },
    {
        "Nile Delta": "nile delta"
    },
    {
        " region, ten of ": null
    },
    {
        "Upper Egypt": "upper egypt"
    },
    {
        " along the ": null
    },
    {
        "Nile": "nile"
    },
    {
        " river south from Cairo to ": null
    },
    {
        "Aswan": "aswan"
    },
    {
        " and five frontier governorates covering Sinai and the deserts that lie west and east of the Nile river.          Egypt is predominantly ": null
    },
    {
        "desert": "desert"
    },
    {
        ". 35,000  km 2 - 3.5% - of the total land area is ": null
    },
    {
        "cultivate": "agriculture"
    },
    {
        "d and permanently settled. Most of the country lies within the wide band of desert that stretches eastwards from Africas ": null
    },
    {
        "Atlantic Coast": "atlantic ocean"
    },
    {
        " across the ": null
    },
    {
        "continent": "continent"
    },
    {
        " and into southwest Asia.     Egypts ": null
    },
    {
        "geological": "geological"
    },
    {
        " history has produced four major ": null
    },
    {
        "physical regions": "physical regions"
    },
    {
        ":   ": null
    },
    {
        "Nile": "nile"
    },
    {
        " Valley and ": null
    },
    {
        "Nile Delta": "nile delta"
    },
    {
        " Western Desert": "western desert"
    },
    {
        "   Eastern Desert": "eastern desert"
    },
    {
        "    Sinai Peninsula": "sinai peninsula"
    },
    {
        "     Despite covering only about 5% of the total area of Egypt; the ": null
    },
    {
        "Nile Valley": "nile valley"
    },
    {
        " and ": null
    },
    {
        "Nile Delta": "nile delta"
    },
    {
        " are the most important regions, being the countrys only cultivable regions and supporting about 99% of the population. The Nile valley extends approximately 800  km from Aswan to the outskirts of Cairo. The Nile Valley is known as ": null
    },
    {
        "Upper Egypt": "upper egypt"
    },
    {
        ", while the Nile Delta region is known as ": null
    },
    {
        "Lower Egypt": "lower egypt"
    },
    {
        ". Steep rocky cliffs rise along the banks of the Nile in some stretches, while other areas along the Nile are flat, with space for agricultural production. In the past, flooding of the Nile during the summer provided silt and water to make agriculture possible on land that is otherwise very dry. Since construction of the ": null
    },
    {
        "Aswan Dam": "aswan dam"
    },
    {
        ", agriculture in the Nile valley depends on ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        ". The Nile delta consists of flat, low-lying areas. Some parts of the delta are marshy and water-logged, and thus not suitable for agriculture. Other areas of the delta are used for agriculture.              The Nile Valley and Delta, the most extensive ": null
    },
    {
        "oasis": "oasis"
    },
    {
        " on earth, was created by the worlds longest river and its seemingly inexhaustible sources. Without the ": null
    },
    {
        "topographic": "topographic"
    },
    {
        " channel": "stream channel"
    },
    {
        " that permits the Nile to flow across the ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        ", Egypt would be entirely desert. The length within Egypt of the River Nile in its northwards course from three central African sources – the ": null
    },
    {
        "White Nile": "white nile"
    },
    {
        ", the ": null
    },
    {
        "Blue Nile": "blue nile"
    },
    {
        ", and the ": null
    },
    {
        "Atbara": "atbara"
    },
    {
        " – totals some 1,600  km.     The White Nile, which begins at ": null
    },
    {
        "Lake Victoria": "lake victoria"
    },
    {
        " in ": null
    },
    {
        "Uganda": "uganda"
    },
    {
        ", supplies about 28% of the Niles Egyptian waters. In its course from Lake Victoria to ": null
    },
    {
        "Juba": "juba"
    },
    {
        " in ": null
    },
    {
        "South Sudan": "south sudan"
    },
    {
        ", the White Niles channel drops more than 600 m. In its 1,600-km course from Juba to ": null
    },
    {
        "Khartoum": "khartoum"
    },
    {
        ", ": null
    },
    {
        "Sudans": "sudan"
    },
    {
        "capital, the river descends just 75 m. In South Sudan, the White Nile passes through the ": null
    },
    {
        "Sudd": "sudd"
    },
    {
        ", a wide, flat plain covered with ": null
    },
    {
        "swamp": "swamp"
    },
    {
        " vegetation": "vegetation"
    },
    {
        " and slows almost to the point of ": null
    },
    {
        "stagnation": "water stagnation"
    },
    {
        ".     The Blue Nile, which originates at ": null
    },
    {
        "Lake Tana": "lake tana"
    },
    {
        " in ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        ", provides on average some 58% of the Niles Egyptian waters. This river has a steeper gradient and therefore flows more swiftly than the White Nile, which it joins at Khartoum. Unlike the White Nile, the Blue Nile carries a considerable amount of ": null
    },
    {
        "sediment": "sediment"
    },
    {
        ". For several kilometres north of Khartoum, water closer to the eastern bank of the river, coming from the Blue Nile, is visibly ": null
    },
    {
        "mud": "mud"
    },
    {
        "dy, while that closer to the western bank, and coming from the White Nile, is clearer.     The much shorter Atbarah River, which also originates in Ethiopia, joins the main Nile north of Khartoum between the fifth and sixth ": null
    },
    {
        "cataracts": "cataracts of the nile"
    },
    {
        " and provides about 14% of the Niles waters in Egypt. During the low-water season, which runs from January to June, the Atbarah shrinks to a number of pools. But, in late-summer, when torrential rains fall on the ": null
    },
    {
        "Ethiopian Highlands": "ethiopian highlands"
    },
    {
        ", the Atbarah provides 22% of the Niles flow.     The Blue Nile has a similar pattern. It contributes 17% of the Niles waters in the low-water season and 68% during the high-water season. In contrast, the White Nile provides only 10% of the Niles waters during the high-water season but contributes more than 80% during the low-water period. Thus, before the ": null
    },
    {
        "Aswan High Dam": "aswan high dam"
    },
    {
        " was completed in 1971, the White Nile watered the Egyptian stretch of the river throughout the year, whereas the Blue Nile, carrying seasonal rain from Ethiopia, caused the Nile to overflow its banks and deposit a layer of fertile mud over adjacent fields. The great flood of the main Nile usually occurred in Egypt during August, September, and October, but it sometimes began as early as June at ": null
    },
    {
        "Aswan": "aswan"
    },
    {
        " and often did not completely wane until January.     The Nile enters Egypt a few kilometers north of ": null
    },
    {
        "Wadi Halfa": "wadi halfa"
    },
    {
        ", a Sudanese town that was completely rebuilt on high ground when its original site was submerged in the ": null
    },
    {
        "reservoir": "reservoir"
    },
    {
        " created by the Aswan High Dam. As a result of the dams construction, the Nile actually begins its flow into Egypt as ": null
    },
    {
        "Lake Nasser": "lake nasser"
    },
    {
        ", which extends southwards from the dam for 320  km to the border and for an additional 158  km within Sudan. Lake Nassers waters fill the area through ": null
    },
    {
        "Lower Nubia": "lower nubia"
    },
    {
        " within the narrow ": null
    },
    {
        "canyon": "canyon"
    },
    {
        " between the ": null
    },
    {
        "cliffs": "cliffs"
    },
    {
        " of ": null
    },
    {
        "sandstone": "sandstone"
    },
    {
        " and ": null
    },
    {
        "granite": "granite"
    },
    {
        " created by the flow of the river over many centuries.     Below Aswan the cultivated ": null
    },
    {
        "floodplain": "floodplain"
    },
    {
        " strip widens to as much as twenty km. North of Isna , the plateau on both sides of the valley rises to as much as 550 m above sea level; at Qina the 300-m limestone cliffs force the Nile to change course towards the southwest for about 60  km before it turns northwest for about 160  km to Asyut. Northward from Asyut, the ": null
    },
    {
        "escarpments": "escarpment"
    },
    {
        "on both sides diminish, and the valley widens to a maximum of 22  km.     At Cairo, the Nile spreads out over what was once a broad ": null
    },
    {
        "estuary": "estuary"
    },
    {
        ", subsequently filled by silt deposits to form what is now a fertile, fan-shaped ": null
    },
    {
        "delta": "river delta"
    },
    {
        " some 250  km wide at its seaward extremity and extending about 160  km from north to south. The Nile Delta covers approximately 22,000  km 2 . According to historical accounts from the first century AD, seven branches of the Nile once ran through the delta. According to later accounts, the Nile had, by around the twelfth century, just six branches.     Since then, nature and man have closed all but two main outlets: the east branch, ": null
    },
    {
        "Damietta": "damietta"
    },
    {
        " , and the west branch, ": null
    },
    {
        "Rosetta": "rosetta"
    },
    {
        " . Both outlets are named after the ": null
    },
    {
        "ports": "port"
    },
    {
        "located at their respective mouths. A network of ": null
    },
    {
        "drainage": "drainage"
    },
    {
        " and ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        " canals": "canals"
    },
    {
        " supplements these remaining outlets. In the north, near the coast, the Nile delta embraces a series of ": null
    },
    {
        "salt marshes": "salt marshes"
    },
    {
        " and ": null
    },
    {
        "lake": "lake"
    },
    {
        "s, the most notable among which are ": null
    },
    {
        "Idku": "idku"
    },
    {
        ", ": null
    },
    {
        "Al Burullus": "al burullus"
    },
    {
        ", and ": null
    },
    {
        "Manzilah": "manzilah"
    },
    {
        ".     The fertility and productivity of the land adjacent to the Nile depends largely on the ": null
    },
    {
        "silt": "silt"
    },
    {
        " deposited by floodwaters. ": null
    },
    {
        "Archaeological": "archaeological"
    },
    {
        " research indicates that people once lived at a much higher elevation along the river than they do today, probably because the river was higher or the floods more severe. The timing and the amount of annual flow were always unpredictable. Measurements of annual flows as low as 1.2 billion m 3 and as high as 4.25 billion m 3 have been recorded. For centuries Egyptians attempted to predict and take advantage of these flows and thereby moderate the severity of floods.     The construction of ": null
    },
    {
        "dams": "dams"
    },
    {
        " on the Nile, particularly the Aswan High Dam, transformed the mighty river into a large and predictable ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        " ditch": "ditch"
    },
    {
        ". Lake Nasser, the worlds largest artificial lake, has enabled planned use of the Nile regardless of the amount of rainfall in ": null
    },
    {
        "Central Africa": "central africa"
    },
    {
        " and ": null
    },
    {
        "East Africa": "east africa"
    },
    {
        ". The dams have also affected the Nile Valleys ": null
    },
    {
        "fertility": "fertility"
    },
    {
        ", which was dependent for centuries not only on the water brought to the ": null
    },
    {
        "arable land": "arable land"
    },
    {
        " but also on the materials left by the water.     Researchers have estimated that beneficial silt deposits in the valley began about 10,000 years ago. The average annual deposit of arable soil through the course of the river valley amounted to some nine metres. Analysis of the flow revealed that 10.7 million tons of solid matter passed Cairo each year.     Today the Aswan High Dam obstructs most of this sediment, now retained in Lake Nasser. The reduction in annual silt deposits has contributed to rising water tables and increasing ": null
    },
    {
        "soil salinity": "soil salinity"
    },
    {
        " in the Delta, the erosion of the rivers banks in ": null
    },
    {
        "Upper Egypt": "upper egypt"
    },
    {
        ", and the erosion of the ": null
    },
    {
        "alluvial fan": "alluvial fan"
    },
    {
        " along the shore of the Mediterranean Sea.          The Western Desert covers an area of some 700,000  km 2 , thereby accounting for around two-thirds of Egypts total land area. This immense desert to the west of the Nile spans the area from the Mediterranean Sea southwards to the Sudanese border. The deserts ": null
    },
    {
        "Jilf al Kabir Plateau": "jilf al kabir plateau"
    },
    {
        ", at a mean altitude of some 1000 m, constitutes an exception to the uninterrupted territory of basement rocks covered by layers of horizontally bedded sediments forming a massive plain or low plateau. The ": null
    },
    {
        "Great Sand Sea": "great sand sea"
    },
    {
        " lies within the deserts plain and extends from the ": null
    },
    {
        "Siwa Oasis": "siwa oasis"
    },
    {
        " to ": null
    },
    {
        "Jilf al Kabir": "jilf al kabir"
    },
    {
        ". ": null
    },
    {
        "Escarpments": "escarpment"
    },
    {
        " and deep depressions exist in several parts of the Western Desert, and no rivers or streams drain into or out of the area.     The government has considered the Western Desert a frontier region and has divided it into two governorates at about the twenty-eighth parallel: ": null
    },
    {
        "Matruh": "matruh governorate"
    },
    {
        " to the north and New Valley to the south. There are seven important depressions in the Western Desert, and all are considered oases except the largest, ": null
    },
    {
        "Qattara": "qattara"
    },
    {
        ", the water of which is salty. The ": null
    },
    {
        "Qattara Depression": "qattara depression"
    },
    {
        ", which includes the countrys lowest point, encompasses , which is similar to the size of ": null
    },
    {
        "Lake Ontario": "lake ontario"
    },
    {
        ". It is largely below sea level and is  below sea level at the lowest. ": null
    },
    {
        "Badlands": "badlands"
    },
    {
        ", salt marshes, and salt lakes cover the sparsely inhabited Qattara Depression.     Limited ": null
    },
    {
        "agricultural": "agricultural"
    },
    {
        " production, the presence of some natural resources, and permanent ": null
    },
    {
        "settlements": "community"
    },
    {
        " are found in the other six depressions, all of which have fresh water provided by the Nile or by local ": null
    },
    {
        "groundwater": "groundwater"
    },
    {
        ". The Siwah Oasis, close to the Libyan border and west of Qattara, is isolated from the rest of Egypt but has sustained life since ancient times. The Siwas cliff-hung Temple of Amun was renowned for its oracles for more than 1,000 years. ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        " and ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " were among the many illustrious people who visited the temple in the pre-Christian era.     The other major ": null
    },
    {
        "oases": "oases"
    },
    {
        " form a ": null
    },
    {
        "topographic": "topographic"
    },
    {
        " chain of ": null
    },
    {
        "basins": "depression"
    },
    {
        "extending from the ": null
    },
    {
        "Faiyum Oasis": "faiyum oasis"
    },
    {
        " which lies  southwest of ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        ", south to the ": null
    },
    {
        "Bahariya": "bahariya"
    },
    {
        ", ": null
    },
    {
        "Farafirah": "farafra"
    },
    {
        ", and ": null
    },
    {
        "Dakhilah": "dakhla oasis"
    },
    {
        " oases before reaching the countrys largest oasis, ": null
    },
    {
        "Kharijah": "kharga"
    },
    {
        ". A brackish lake, ": null
    },
    {
        "Birket Qarun": "birket qarun"
    },
    {
        ", at the northern reaches of Al Fayyum Oasis, drained into the Nile in ancient times. For centuries sweet water ": null
    },
    {
        "artesian wells": "artesian wells"
    },
    {
        " in the Fayyum Oasis have permitted extensive ": null
    },
    {
        "cultivation": "tillage"
    },
    {
        " in an irrigated area that extends over .               The topographic features of the desert region east of the Nile differ from those to the west of the Nile. The Eastern Desert is relatively mountainous. The elevation rises abruptly from the Nile, and a downward-sloping plateau of sand gives way within 100  km to arid, defoliated, rocky hills running north and south between the Sudan border and the Delta. The hills reach elevations of more than 1,900 m.     The regions most prominent feature is the easterly chain of rugged mountains, the ": null
    },
    {
        "Red Sea Hills": "red sea hills"
    },
    {
        ", which extend from the Nile Valley eastward to the ": null
    },
    {
        "Gulf of Suez": "gulf of suez"
    },
    {
        " and the Red Sea. This elevated region has a natural drainage pattern that rarely functions because of insufficient rainfall. It also has a complex of irregular, sharply cut ": null
    },
    {
        "wadis": "wadis"
    },
    {
        " that extend westward toward the Nile. The desert environment extends all the way to the Red Sea coast.          The ": null
    },
    {
        "Sinai Peninsula": "sinai peninsula"
    },
    {
        " is a triangular-shaped ": null
    },
    {
        "peninsula": "peninsula"
    },
    {
        ", about 61,100  km 2 in area . Similar to the desert, the peninsula contains mountains in its southern sector that are a geological extension of the Red Sea Hills, the low range along the Red Sea coast that includes ": null
    },
    {
        "Mount Catherine": "mount catherine"
    },
    {
        " , the countrys highest point, at 2,642 m above sea-level. The Red Sea may have been named after these mountains, which are red.     The southern side of the peninsula has a sharp escarpment that subsides after a narrow coastal shelf that slopes into the Red Sea and the ": null
    },
    {
        "Gulf of Aqaba": "gulf of aqaba"
    },
    {
        ". The elevation of Sinais southern rim is about 1,000 m. Moving northward, the elevation of this ": null
    },
    {
        "limestone": "limestone"
    },
    {
        " plateau decreases. The northern third of Sinai is a flat, sandy coastal plain, which extends from the Suez Canal into the ": null
    },
    {
        "Gaza Strip": "gaza strip"
    },
    {
        " and ": null
    },
    {
        "Israel": "israel"
    },
    {
        ".     Before the Israeli military occupied Sinai during the June 1967 War , a single Egyptian governorate administered the whole peninsula. By 1982 after all of Sinai was returned to Egypt, the central government divided the peninsula into two governorates. North Sinai has its capital at Al Arish and the South Sinai has its capital in Artt Turkishy.     The abundance of life in the Sinai Peninsula may not be immediately apparent. This again has its roots in the way in which the animals of the desert have adapted to life here. Many species, mammals especially, but also reptiles and even birds such as owls, are nocturnal. They spend the daylight hours in the relative cool of burrows, under boulders or in crevices and cracks in the rock. Many of these creatures will only be apparent from their tracks and trails or from a fleeting glimpse of a diminutive gerbil, or zig-zigging hare, in the car headlights at night. Even those animals that do brave the heat of the day are normally only active in the early morning or evening.       In the 1971 census, 57 percent of Egypts population was counted as rural, including those residing in agricultural areas in the Nile Valley and Delta, as well as the much smaller number of persons living in desert areas. Rural areas differ from the urban in terms of poverty, fertility rates, and other social factors. Agriculture is a key component of the economy in rural areas, though some people are employed in the tourist industry or other non-farm occupations. In 1992, the percentage of Egypts population employed in agriculture was 33 percent. The agricultural industry is dependent on ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        " from the Nile river.        This is a list of the extreme points of ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", the points that are farther north, south, east or west than any other location.     Northernmost point – unnamed headland immediately north-west of ": null
    },
    {
        "Sidi Barrani": "sidi barrani"
    },
    {
        ", ": null
    },
    {
        "Matruh Governorate": "matruh governorate"
    },
    {
        " Ras Hadarba": "ras hadarba"
    },
    {
        " , ": null
    },
    {
        "Red Sea Governorate": "red sea governorate"
    },
    {
        " Jabal Bartazuga": "jabal bartazuga"
    },
    {
        " on the Sudanese border, ": null
    },
    {
        "Red Sea Governorate": "red sea governorate"
    },
    {
        " Libya": "libya"
    },
    {
        " immediately east of the ruin of ": null
    },
    {
        "Qasr al Qarn": "qasr al qarn"
    },
    {
        " in Libya, ": null
    },
    {
        "Matruh Governorate": "matruh governorate"
    },
    {
        "  Ras Hadarba lies within the Halaib triangle which is claimed by Sudan but occupied by Egypt. If it is excluded, then Egypts easternmost point is the Ras Banas peninsula on the mainland or, including islands, Mukawwa Island   Egypts southernmost point lies in the Bir Tawil region, an area that is commonly included as part of Egypt but is not claimed by it. If this area is excluded then Egypt has no southernmost point, its southern border being formed by the 22nd parallel north .       ": null
    }
]