[
    {
        "   Saint Helena is an island in the ": null
    },
    {
        "South Atlantic Ocean": "south atlantic ocean"
    },
    {
        ", about midway between ": null
    },
    {
        "South America": "south america"
    },
    {
        " and ": null
    },
    {
        "Africa": "africa"
    },
    {
        ". St Helena has a land area of 122 square kilometres and is part of the territory of ": null
    },
    {
        "Saint Helena, Ascension and Tristan da Cunha": "saint helena, ascension and tristan da cunha"
    },
    {
        " which includes ": null
    },
    {
        "Ascension Island": "ascension island"
    },
    {
        " and the island group of ": null
    },
    {
        "Tristan da Cunha": "tristan da cunha"
    },
    {
        ".                 The climate of ": null
    },
    {
        "Saint Helena": "saint helena"
    },
    {
        " island can be described as tropical, marine and mild, tempered by the ": null
    },
    {
        "Benguela Current": "benguela current"
    },
    {
        " and ": null
    },
    {
        "trade winds": "trade winds"
    },
    {
        " which blow almost continuously. Similarly, the climate of ": null
    },
    {
        "Tristan da Cunha": "tristan da cunha"
    },
    {
        " is marine, mild and also tempered by trade winds, although the climate is temperate in nature. Ascension Island is warmer and wetter than St Helena.          ": null
    },
    {
        "Saint Helena": "saint helena"
    },
    {
        " has a rugged, ": null
    },
    {
        "volcanic": "volcanic"
    },
    {
        " terrain, with small scattered ": null
    },
    {
        "plateaus": "plateau"
    },
    {
        "and ": null
    },
    {
        "plain": "plain"
    },
    {
        "s, with the largest area of level ground on the island being ": null
    },
    {
        "Prosperous Bay Plain": "prosperous bay plain"
    },
    {
        " in the eastern arid area. The other islands of the group have a volcanic origin. The highest point on the island is ": null
    },
    {
        "Dianas Peak": "dianas peak"
    },
    {
        " at 818 metres , though ": null
    },
    {
        "Queen Marys Peak": "queen marys peak"
    },
    {
        " on ": null
    },
    {
        "Tristan da Cunha": "tristan da cunha"
    },
    {
        " is the highest in the British territory at 2,062 m.     A natural hazard on Tristan da Cunha is active volcanism, though this is not the case on St Helena itself.            St. Helena exists because of the ": null
    },
    {
        "St. Helena hotspot": "st. helena hotspot"
    },
    {
        " which began to produce basaltic lava about 145 million years ago when it was near the ": null
    },
    {
        "constructive plate margin": "divergent boundary"
    },
    {
        " of the ": null
    },
    {
        "Mid-Atlantic Ridge": "mid-atlantic ridge"
    },
    {
        ". The movement of the ": null
    },
    {
        "African Plate": "african plate"
    },
    {
        " away from the hotspot has left the chain of the St. Helena ": null
    },
    {
        "seamounts": "seamounts"
    },
    {
        ", which may connect with the ": null
    },
    {
        "Cameroon Volcanic Line": "cameroon volcanic line"
    },
    {
        ". St. Helena, the most south westerly point on the chain, is close to the plate margin, but the last volcanic eruptions occurred about 7 million years ago.     The first investigations of St. Helena geology were made when ": null
    },
    {
        "Charles Darwin": "charles darwin"
    },
    {
        " visited the island on the voyage of ": null
    },
    {
        "H.M.S. Beagle": "h.m.s. beagle"
    },
    {
        " in July 1836. He used the observations on St Helena to formulate an intermediate hypothesis - volcanoes rise by slow, gradual and episodic events . David Bressan in ": null
    },
    {
        "Scientific American": "scientific american"
    },
    {
        " July 8, 2013, 8, July 1836: Darwin on St Helena and the Birth of a Volcano       The Barn is a capping of younger lavas upon weaker rocks. The Barn features cliffs on the side that faces the sea. It overlooks the pyroclasts and weak flows of Turks Cap Valley to the south.     Taking their names from the story of ": null
    },
    {
        "Lot": "lot"
    },
    {
        " in the Book of Genesis, Lot and Lots Wife are two solitary pillars of rock topping two valleys near Sandy Bay. The pillars are ": null
    },
    {
        "phonolitic": "phonolitic"
    },
    {
        " intrusion": "intrusion"
    },
    {
        "s, which are more resistant to erosion than surrounding volcanic features which have, in time, eroded away. web|url; The Geology of Saint Helena Island, Reginald A. Daly,Proceedings of the American Academy of Arts and Sciences,Vol. 62, No. 2 , pp. 31-92       Saint Helena possesses ": null
    },
    {
        "fish": "fish"
    },
    {
        " as a main natural resource. Land use in the island group is divided between ": null
    },
    {
        "arable land": "arable land"
    },
    {
        " and other uses, which occupy the remaining 87.1%.     In terms of maritime claims, St Helena has an exclusive fishing zone of 200 nautical miles, and a territorial sea of twelve nautical miles.       Just off the coast of St Helena island itself are numerous small islands. Starting from the north and running clockwise, these are: Shore Island, George Island, Rough Rock Island, Flat Rock, The Buoys, Sandy Bay Island, Black Horse Island, White Bird Island, Frightus Island, Jar Rock, Castle Point Rock, Robert Rock, Salt Rock, Speery Island, Flat Rock, The Needle, Lower and Upper Black Rock, Bird Island, Black Rock, Thompsons Valley Island, Peaked Island, Egg Island, Ladys Chair, Lighter Rock, Long Ledge, and Red Rock.          Saint Helena harbours at least 40 species of plants unknown anywhere else in the world, and Ascension is a breeding ground for ": null
    },
    {
        "sea turtles": "sea turtle"
    },
    {
        "and ": null
    },
    {
        "sooty tern": "sooty tern"
    },
    {
        "s.       The island of St Helena is divided into ": null
    },
    {
        "8 districts": "saint helenaadministrative divisions"
    },
    {
        ", ": null
    }
]