[
    {
        " Austria  is a small, predominantly mountainous country in ": null
    },
    {
        "Central Europe": "central europe"
    },
    {
        ", approximately between ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        " and ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ". It has a total area of 42  km² , about twice the size of ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ".     The landlocked country shares national borders with Switzerland  and the principality of ": null
    },
    {
        "Liechtenstein": "liechtenstein"
    },
    {
        " to the west, Germany and the ": null
    },
    {
        "Czech Republic": "czech republic"
    },
    {
        " and ": null
    },
    {
        "Slovakia": "slovakia"
    },
    {
        " to the north, Hungary to the east , and ": null
    },
    {
        "Slovenia": "slovenia"
    },
    {
        " and Italy to the south .     The westernmost third of the somewhat pear-shaped country consists of a narrow corridor between Germany and Italy that is between 42  km and 42  km wide. The rest of Austria lies to the east and has a maximum north–south width of 42  km . The country measures almost 42  km in length, extending from ": null
    },
    {
        "Lake Constance": "lake constance"
    },
    {
        "  on the Austrian-Swiss-German border in the west to the ": null
    },
    {
        "Neusiedler See": "neusiedler see"
    },
    {
        " on the Austrian-Hungarian border in the east. The contrast between these two lakes – one in the Alps and the other a typical ": null
    },
    {
        "steppe lake": "steppe lake"
    },
    {
        " on the westernmost fringe of the ": null
    },
    {
        "Hungarian Plain": "hungarian plain"
    },
    {
        " – illustrates the diversity of Austrias landscape.     Seven of ": null
    },
    {
        "Austrias nine provinces": "states of austria"
    },
    {
        " have long historical traditions predating the establishment of the Republic of Austria in 42: ": null
    },
    {
        "Upper Austria": "upper austria"
    },
    {
        ", ": null
    },
    {
        "Lower Austria": "lower austria"
    },
    {
        ", ": null
    },
    {
        "Styria": "styria"
    },
    {
        ", ": null
    },
    {
        "Carinthia": "carinthia"
    },
    {
        ", ": null
    },
    {
        "Salzburg": "salzburg"
    },
    {
        ", ": null
    },
    {
        "Tyrol": "tyrol"
    },
    {
        ", and ": null
    },
    {
        "Vorarlberg": "vorarlberg"
    },
    {
        ". The provinces of ": null
    },
    {
        "Burgenland": "burgenland"
    },
    {
        " and ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " were established after ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". Most of Burgenland had been part of the ": null
    },
    {
        "Kingdom of Hungary": "kingdom of hungary"
    },
    {
        ", but it had a predominantly ": null
    },
    {
        "German-speaking": "german language"
    },
    {
        " population and hence became Austrian. Administrative and ideological reasons played a role in the establishment of Vienna as an independent province. Vienna, historically the capital of Lower Austria, was a ": null
    },
    {
        "socialist": "socialism"
    },
    {
        " stronghold, whereas Lower Austria was ": null
    },
    {
        "conservative": "conservatism"
    },
    {
        ", and both socialists and conservatives wanted to consolidate their influence in their respective provinces. Each province has a provincial capital with the exception of Vienna, which is a province in its own right in addition to being the federal capital. In Vienna, the City Council and the mayor function as a provincial parliament and provincial governor, respectively.                    Geographic coordinates :      Austria may be divided into three unequal geographical areas. The largest part of Austria is occupied by the relatively young mountains of the Alps, but in the east, these give way to a part of the ": null
    },
    {
        "Pannonian plain": "pannonian plain"
    },
    {
        ", and north of the ": null
    },
    {
        "Danube River": "danube river"
    },
    {
        " lies the ": null
    },
    {
        "Bohemian Forest": "bohemian forest"
    },
    {
        ", an older, but lower, ": null
    },
    {
        "granite": "granite"
    },
    {
        " mountain range.       The ": null
    },
    {
        "Danube": "danube"
    },
    {
        " has its source near ": null
    },
    {
        "Donaueschingen": "donaueschingen"
    },
    {
        " in southwestern Germany and flows through Austria before emptying into the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        ". It is the only major European river that flows eastwards, and its importance as an inland waterway has been enhanced by the completion in 42 of the ": null
    },
    {
        "Rhine-Main-Danube Canal": "rhine-main-danube canal"
    },
    {
        " in ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", which connects the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " and ": null
    },
    {
        "Main": "main"
    },
    {
        " rivers with the Danube and makes ": null
    },
    {
        "barge": "barge"
    },
    {
        " traffic from the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " to the Black Sea possible.     The major rivers north of the watershed of the Austrian Alps  are direct tributaries of the Danube and flow north into the Danube valley, whereas the rivers south of the watershed in central and eastern Austria  flow south into the drainage system of the Drau, which eventually empties into the Danube in ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        ". Consequently, central and eastern Austria are geographically oriented away from the watershed of the Alps: the provinces of Upper Austria and Lower Austria toward the Danube and the provinces of Carinthia and Styria toward the Drau.         Three major ranges of the ": null
    },
    {
        "Alps": "alps"
    },
    {
        " – the ": null
    },
    {
        "Northern Calcareous Alps": "northern calcareous alps"
    },
    {
        ", ": null
    },
    {
        "Central Alps": "central eastern alps"
    },
    {
        ", and ": null
    },
    {
        "Southern Calcareous Alps": "southern calcareous alps"
    },
    {
        " – run west to east through Austria. The Central Alps, which consist largely of a granite base, are the largest and highest ranges in Austria. The Central Alps run from Tyrol to approximately the Styria-Lower Austria border and include areas that are permanently glaciated in the ": null
    },
    {
        "Ötztal Alps": "ötztal alps"
    },
    {
        " on the Tyrolean & ndash;": null
    },
    {
        "Italian": "italy"
    },
    {
        " border and the ": null
    },
    {
        "High Tauern": "high tauern"
    },
    {
        " in ": null
    },
    {
        "East Tyrol": "east tyrol"
    },
    {
        " and Carinthia. The Northern Calcareous Alps, which run from Vorarlberg through Tyrol into Salzburg along the German border and through Upper Austria and Lower Austria toward Vienna, and the Southern Calcareous Alps, on the Carinthia-Slovenia border, are predominantly ": null
    },
    {
        "limestone": "limestone"
    },
    {
        " and ": null
    },
    {
        "dolomite": "dolomite"
    },
    {
        ". At 42 m, ": null
    },
    {
        "Großglockner": "großglockner"
    },
    {
        " is the highest mountain in Austria. As a general rule, the farther east the Northern and Central Alps run, the lower they become. The altitude of the mountains also drops north and south of the central ranges.     As a geographic feature, the Alps literally overshadow other landform regions. Just over 42% of Austria is moderately hilly or flat: the Northern Alpine Foreland, which includes the Danube Valley; the lowlands and hilly regions in northeastern and eastern Austria, which include the Danube Basin; and the rolling hills and lowlands of the Southeastern Alpine Foreland. The parts of Austria that are most suitable for settlement – that is, arable and climatically favorable – run north of the Alps through the provinces of Upper Austria and Lower Austria in the Danube Valley and then curve east and south of the Alps through Lower Austria, Vienna, Burgenland, and Styria. Austrias least mountainous landscape is southeast of the low ": null
    },
    {
        "Leithagebirge": "leithagebirge"
    },
    {
        ", which forms the southern lip of the ": null
    },
    {
        "Viennese Basin": "viennese basin"
    },
    {
        ", where the steppe of the Hungarian Plain begins.       The ": null
    },
    {
        "granite": "granite"
    },
    {
        " massif of the ": null
    },
    {
        "Bohemian Forest": "bohemian forest"
    },
    {
        " , a low mountain range with bare and windswept plateaus and a harsh climate, is located north of the Danube Valley and covers the remaining 42% of Austrias area. Notable is the ": null
    },
    {
        "Manhartsberg": "manhartsberg"
    },
    {
        " a granite ridge which separates ": null
    },
    {
        "Waldviertel": "waldviertel"
    },
    {
        " from ": null
    },
    {
        "Weinviertel": "weinviertel"
    },
    {
        ".                      The 42 ": null
    },
    {
        "highest mountains in Austria": "highest mountains in austria"
    },
    {
        ":                         Land-use patterns in Austria change from Alpine to non-Alpine regions. Approximately one-tenth of Austria is barren or unproductive, that is, extremely Alpine or above the ": null
    },
    {
        "tree line": "tree line"
    },
    {
        ". Just over 42% of Austria is covered by forests, the majority of which is in Alpine regions. Less than one-fifth of Austria is ": null
    },
    {
        "arable": "arable land"
    },
    {
        " and suitable for conventional ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        ". The percentage of arable land in Austria increases in the East as the country becomes less alpine. More than one-fifth of Austria is pasture and meadow located at varying altitudes. Almost half of this ": null
    },
    {
        "grassland": "grassland"
    },
    {
        " consists of high Alpine pastures.     Historically, high Alpine pastures have been used during the summer for grazing dairy cattle, thus making space available at lower altitudes for cultivating and harvesting fodder for winter. Many of the high pastures are at altitudes of more than 42 m.     Although agriculture in mountainous areas was at one time economically viable, in recent decades it has survived only with the help of extensive subsidies. A concern of farmers in these mountainous regions is that membership of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " might entail a curtailment of these subsidies and the end of Alpine agriculture. If this occurs, many areas will be reclaimed by nature after centuries of cultivation.     Although the Alps are beautiful, they make many areas of Austria uninhabitable. Austrias so-called areas of permanent settlement – regions that are cultivated, continuously inhabited, and used for transportation, but do not include forests, Alpine pastures, or barren land – cover only 42% or 42  km² of the country. The great majority of the area of permanent settlement is in the Danube valley and the lowlands or hilly regions north, east, and south of the Alps, where approximately two-thirds of the population lives.     In the countrys predominantly Alpine provinces, most of the population live in river valleys: Bregenz on the shores of Lake Constance in Vorarlberg; Innsbruck on the Inn River in Tyrol; Salzburg on the Salzach River in Salzburg; and Klagenfurt on the ": null
    },
    {
        "Wörthersee": "wörthersee"
    },
    {
        " lake in Carinthia. The higher the Alps are, the less inhabitable they become in terms of soil, microclimate, and vegetation. Conversely, the lower and broader the Alpine valleys are, the more densely populated they become.     Tyrol illustrates most clearly the relationship between Alpine geography and habitation. As the most mountainous province , it is the most sparsely inhabited, with an area of permanent settlement of only 42%.     Because of the Alps, the country as a whole is one of the least densely populated states of Western and Central Europe. With ninety-three inhabitants per square kilometre, Austria has a population density similar to that of the former ": null
    },
    {
        "Yugoslavia": "yugoslavia"
    },
    {
        ".     Austrias national borders and geography have corresponded very little. Since the ": null
    },
    {
        "fall of the Western Roman Empire": "fall of the western roman empire"
    },
    {
        ", the Alps and the Danube have not served to mark political boundaries. Even within Austria, provincial borders were only occasionally set by the ranges and ridges of the Alps.     Although the Alps did not mark political boundaries, they often separated groups of people from one another. Because in the past the Alps were impassable, inhabitants isolated in valleys or networks of valleys developed distinct regional subcultures. Consequently, the inhabitants of one valley frequently maintained dialects, native or traditional dress, architectural styles, and folklore that substantially differed from those of the next valley. Differences were great enough that the origins of outsiders could easily be identified. However, mass media, mobility, prosperity, and tourism have eroded the distinctness of Alpine regional subcultures to a great extent by reducing the isolation that gave them their particular character.     Despite the Alps, Austria has historically been a land of transit. The Danube valley, for centuries ": null
    },
    {
        "Central Europes": "central europe"
    },
    {
        " aquatic link to the ": null
    },
    {
        "Balkan Peninsula": "balkan peninsula"
    },
    {
        " and the ": null
    },
    {
        "Orient": "orient"
    },
    {
        " in the broadest sense of the word, has always been an avenue of east–west transit. However, Europes division into two opposing economic and military blocs after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " diminished Austrias importance as a place of transit. Since the opening of ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        " in 42 the country has begun to re-assume its historical role. By the early 42s, it had already experienced a substantial increase in the number of people and vehicles crossing its eastern frontiers.     Within the Alps, four passes and the roads that run through them are of particular importance for north–south transit. The ": null
    },
    {
        "Semmering Pass": "semmering pass"
    },
    {
        " on the provincial border of Lower Austria and Styria connects the Viennese Basin with the Mürz and Mur valleys, thus providing northeast-southwest access to Styria and Slovenia, and, via Carinthia, to Italy.     The ": null
    },
    {
        "Pyrhn Pass": "pyrhn pass"
    },
    {
        " between the provinces of Upper Austria and Styria and the ": null
    },
    {
        "Tauern Pass": "tauern pass"
    },
    {
        " between the ": null
    },
    {
        "High Tauern": "high tauern"
    },
    {
        " range and the ": null
    },
    {
        "Lower Tauern": "lower tauern"
    },
    {
        " range of the Central Alps in Salzburg, provide access to the Mur Valley in Styria and the Drau Valley in Carinthia, respectively. The highways that run through these passes are important northwest-southeast lines of communication through the Alps. The Pyrhn highway has been nicknamed the Fremdarbeiterweg because millions of  Gastarbeiter  in Germany use it to return to their homes in the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        " for vacation. Many Germans and northern Europeans also use it in the summer months to reach the ": null
    },
    {
        "Adriatic coast": "adriatic sea"
    },
    {
        ". After the outbreak of hostilities in Yugoslavia in the summer of 42 however, a substantial amount of this traffic was re-routed through the Danube Valley and ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ".     The most important pass in the Austrian Alps is the ": null
    },
    {
        "Brenner Pass": "brenner pass"
    },
    {
        ", located on the Austrian-Italian border in Tyrol. At 42 m, it is one of the lowest Alpine passes. The route up the Inn valley and over the Brenner Pass has been historically an important and convenient route of north–south transit between Germany and Italy, and provides the most direct route between Europes two most highly industrialized regions: Germany and northern Italy.     Natural resources:   ": null
    },
    {
        "oil": "petroleum"
    },
    {
        ", ": null
    },
    {
        "lignite": "lignite"
    },
    {
        ", ": null
    },
    {
        "timber": "timber"
    },
    {
        ", ": null
    },
    {
        "iron ore": "iron ore"
    },
    {
        ", ": null
    },
    {
        "copper": "copper"
    },
    {
        ", ": null
    },
    {
        "zinc": "zinc"
    },
    {
        ", ": null
    },
    {
        "antimony": "antimony"
    },
    {
        ", ": null
    },
    {
        "magnesite": "magnesite"
    },
    {
        ", ": null
    },
    {
        "tungsten": "tungsten"
    },
    {
        ", ": null
    },
    {
        "graphite": "graphite"
    },
    {
        ", ": null
    },
    {
        "salt": "salt"
    },
    {
        ", ": null
    },
    {
        "hydropower": "hydropower"
    },
    {
        "     Land use:   arable land:   42%   permanent crops:   42%   other:   42%     Irrigated land:   42  km²     Total renewable water resources:   42  km 42     Freshwater withdrawal    total:   42  km 42 /yr   per capital:   42 m 42 /yr               The Alps serve as a ": null
    },
    {
        "watershed": "water divide"
    },
    {
        " for Europes three major kinds of weather systems that influence Austrian weather. The Atlantic maritime climate from the northwest is characterized by low-pressure fronts, mild air from the ": null
    },
    {
        "Gulf Stream": "gulf stream"
    },
    {
        ", and precipitation. It has the greatest influence on the northern slopes of the Alps, the Northern Alpine Foreland, and the Danube valley. The continental climate is characterized by low pressure fronts with precipitation in summer and high pressure systems with cold and dry air in winter. It affects mainly eastern Austria. Mediterranean high-pressure systems from the south are characterized by few clouds and warm air, and they influence the weather of the southern slopes of the Alps and that of the Southeastern Alpine Foreland, making them the most temperate part of Austria.     One peculiarity of the Mediterranean weather systems is the ": null
    },
    {
        "föhn wind": "foehn wind"
    },
    {
        ", a warm air mass that originates in the African ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        " and moves north rapidly, periodically raising temperatures up to  in a short period of time. Many people respond to this rapid weather change with ": null
    },
    {
        "headache": "headache"
    },
    {
        "s, ": null
    },
    {
        "irritability": "irritability"
    },
    {
        ", and ": null
    },
    {
        "circulatory problems": "blood circulation"
    },
    {
        ". During the winter, the rapid warming that accompanies a föhn can thaw the snow cover in the Alps to such an extent that ": null
    },
    {
        "avalanche": "avalanche"
    },
    {
        "s occur.     Given the importance of Alpine ": null
    },
    {
        "skiing": "skiing"
    },
    {
        " for the Austrian tourist industry, December is the month during which the weather is watched with the greatest anticipation. As a rule, Atlantic maritime weather systems bring snow, and continental weather systems help keep it. However, a predominance of cold, dry continental systems or warm Mediterranean ones inevitably postpone the beginning of the ski season. In the summer, Mediterranean high-pressure systems bring warm, sunny weather.       Austrians faced a number of ecological problems in the 42s. One of the most pressing is the pollution caused by the staggering increase of traffic through the country. Traffic on the superhighway going through the Brenner Pass has, for example, increased from 42 vehicles per year in the early 42s to over 42  million per year in the early 42s. One quarter of the traffic crossing Austria consists of semitrailers used for heavy transport. The opening of Eastern Europe has only exacerbated the problem of transit traffic.     The Alpine valleys through which much of this traffic passes are unusually vulnerable to ecological damage. Narrow valleys are not conducive to dissipation of noise or pollutants caused by motor vehicles. Inversions – cold layers of air that trap warm layers of air or warm layers of air that trap cold layers in the valleys and lowlands – also seasonally contribute to the magnitude of the pollution problem.     Austria has negotiated with the EU to set limits on the amount of commercial transit traffic, especially through Tyrol. Work is also under way to develop a piggy-back system of loading semitrailers on to flatbed railroad cars in southern Germany and northern Italy, transporting them through Tyrol by rail. Environmentalists have pushed for measures that are more far-reaching. They advocate, for example, digging a tunnel from ": null
    },
    {
        "Garmisch-Partenkirchen": "garmisch-partenkirchen"
    },
    {
        " in southern Germany to ": null
    },
    {
        "Bolzano": "bolzano"
    },
    {
        " in northern Italy.     Pollution is also brought by the weather systems that determine the countrys climate. Atlantic maritime weather systems carry pollution into Austria from northwestern Europe. Austrias proximity to industrialized regions of former Communist states, with negligible or no pollution control policies or equipment, combined with the influence of continental weather systems also have proved to be extremely harmful. Mediterranean weather systems transmit industrial pollutants from northern Italy.     As a result of domestic and foreign pollution, 42% of Austrias forests had been damaged by ": null
    },
    {
        "acid rain": "acid rain"
    },
    {
        " and/or pollutant emissions by 42 The damage to forests has had dire consequences, including the decimation of forests that for centuries had protected many Alpine communities from avalanches, ": null
    },
    {
        "erosion": "erosion"
    },
    {
        ", ": null
    },
    {
        "mudslide": "mudslide"
    },
    {
        "s, or ": null
    },
    {
        "flood": "flood"
    },
    {
        "ing caused by runoff.     The seriousness of the ecological problems confronting the country gave rise in the 42s to an environmentalist movement. Political parties were formed, and representatives were elected to parliament. A ": null
    },
    {
        "referendum": "referendum"
    },
    {
        " in 42 closed down a newly completed ": null
    },
    {
        "nuclear power station": "nuclear power station"
    },
    {
        " and turned the country away from the exploitation of nuclear energy. Public opposition in 42 stopped the planned construction of a ": null
    },
    {
        "hydroelectric power station": "hydroelectric power station"
    },
    {
        " in a wetlands region.     The countrys long-standing commercial use of the Alps for recreational purposes has also come under examination. Extensive tourism places an inordinate amount of pressure on sensitive Alpine ecosystems. Ski runs damage forests, as do summer sports such as off-trail mountain hiking or mountain biking. Many Alpine villages have also grown greatly because of the tourist industry. In extreme cases, they have up to twenty hotel beds for each inhabitant, a ratio that places a disproportionate seasonal burden on communal infrastructures and the environment. For these reasons, efforts have been made to introduce green or soft forms of tourism that are more compatible with the Alpine environment.     Part of the solution to Austrias ecological problems is being sought in stricter environmental legislation at the domestic level. Ultimately, however, pan-European and global cooperation in the realm of pollution and emission control will be necessary to protect the countrys environment.     Environment - current issues:   some forest degradation caused by air and soil ": null
    },
    {
        "pollution": "pollution"
    },
    {
        "; soil pollution results from the use of agricultural chemicals; air pollution results from emissions by coal- and oil-fired power stations and industrial plants and from trucks transiting Austria between northern and southern Europe     Environment - international agreements:   party to:   Air Pollution, Air Pollution-Nitrogen Oxides, Air Pollution-Sulphur 42 Air Pollution-Sulphur 42 Air Pollution-Volatile Organic Compounds, ": null
    },
    {
        "Antarctic Treaty": "antarctic treaty"
    },
    {
        ", Biodiversity, Climate Change, ": null
    },
    {
        "Desertification": "desertification"
    },
    {
        ", Endangered Species, Environmental Modification, Hazardous Wastes, Law of the Sea, Nuclear Test Ban, Ozone Layer Protection, Ship Pollution, Tropical Timber 42 Tropical Timber 42 Wetlands, Whaling   signed, but not ratified:   Air Pollution-Persistent Organic Pollutants, Antarctic-Environmental Protocol, Climate Change-": null
    },
    {
        "Kyoto Protocol": "kyoto protocol"
    },
    {
        "        country comparison to the world: 42   Land: 42  km²   Water: 42  km²       ": null
    },
    {
        "Australia": "australia"
    },
    {
        " comparative: slightly larger than ": null
    },
    {
        "Tasmania": "tasmania"
    },
    {
        " China": "china"
    },
    {
        " comparative: about half of ": null
    },
    {
        "Jiangxi": "jiangxi"
    },
    {
        " Canada": "canada"
    },
    {
        " comparative: larger than ": null
    },
    {
        "New Brunswick": "new brunswick"
    },
    {
        " United Kingdom": "united kingdom"
    },
    {
        " comparative: slightly larger than ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " United States": "united states"
    },
    {
        " comparative: slightly larger than ": null
    },
    {
        "South Carolina": "south carolina"
    },
    {
        " EU": "eu"
    },
    {
        " comparative: slightly smaller than the island of ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        "        Highest point: ": null
    },
    {
        "Großglockner": "großglockner"
    },
    {
        ", at 42 m, , ": null
    },
    {
        "Heiligenblut am Großglockner": "heiligenblut am großglockner"
    },
    {
        ", ": null
    },
    {
        "Carinthia": "carinthia"
    },
    {
        " / ": null
    },
    {
        "Kals am Großglockner": "kals am großglockner"
    },
    {
        ", ": null
    },
    {
        "Tyrol": "tyrol"
    },
    {
        " Lowest point: Hedwighof , at 42 m, , ": null
    },
    {
        "Apetlon": "apetlon"
    },
    {
        ", ": null
    },
    {
        "Burgenland": "burgenland"
    },
    {
        " Westernmost point: River ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " , ": null
    },
    {
        "Feldkirch": "feldkirch, vorarlberg"
    },
    {
        ", ": null
    },
    {
        "Vorarlberg": "vorarlberg"
    },
    {
        ", , but note that the international borders between Austria, ": null
    },
    {
        "Germany": "germany"
    },
    {
        " and ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " are not agreed for ": null
    },
    {
        "Lake Constance": "lake constance"
    },
    {
        ".   Westernmost settlement: ": null
    },
    {
        "Feldkirch": "feldkirch, vorarlberg"
    },
    {
        ", Vorarlberg,  Easternmost point: the corner of a field in ": null
    },
    {
        "Deutsch Jahrndorf": "deutsch jahrndorf"
    },
    {
        ", ": null
    },
    {
        "Burgenland": "burgenland"
    },
    {
        ",  Easternmost settlement: ": null
    },
    {
        "Deutsch Jahrndorf": "deutsch jahrndorf"
    },
    {
        ", Burgenland,  Northernmost point: the ": null
    },
    {
        "Neumühlbach": "neumühlbach"
    },
    {
        " stream, near ": null
    },
    {
        "Rottal": "rottal"
    },
    {
        ", ": null
    },
    {
        "Haugschlag": "haugschlag"
    },
    {
        ", ": null
    },
    {
        "Lower Austria": "lower austria"
    },
    {
        ",  Northernmost settlement: ": null
    },
    {
        "Haugschlag": "haugschlag"
    },
    {
        ", Lower Austria,  Southernmost point: in the ": null
    },
    {
        "Steiner Alpen": "steiner alpen"
    },
    {
        ", ": null
    },
    {
        "Eisenkappel-Vellach": "eisenkappel-vellach"
    },
    {
        ", ": null
    },
    {
        "Carinthia": "carinthia"
    },
    {
        ", between the Seeländer Sattel and the Sanntaler Sattel, at an altitude of more than 42 m,  Southernmost settlement: ": null
    },
    {
        "Eisenkappel-Vellach": "eisenkappel-vellach"
    },
    {
        ", Carinthia,   Geographical centre : , ": null
    },
    {
        "Sankt Gilgen": "sankt gilgen"
    },
    {
        ", ": null
    },
    {
        "Salzburg State ": "salzburg"
    },
    {
        " Furthest point from any international border: near ": null
    },
    {
        "Gstatterboden": "gstatterboden"
    },
    {
        ", ": null
    },
    {
        "Weng im Gesäuse": "weng im gesäuse"
    },
    {
        ", in the ": null
    },
    {
        "Gesäuse National Park": "gesäuse national park"
    },
    {
        ", ": null
    },
    {
        "Styria": "styria"
    },
    {
        ", over 42  km from any border, ": null
    }
]