[
    {
        "The Geography of Guyana  comprises the physical characteristics of the country in Northern ": null
    },
    {
        "South America": "south america"
    },
    {
        " and part of ": null
    },
    {
        "Caribbean South America": "caribbean south america"
    },
    {
        ", bordering the North ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ", between ": null
    },
    {
        "Suriname": "suriname"
    },
    {
        " and ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        ", with a land area of approximately 42 square kilometres. The country is situated between 42 and 42 north latitude and between 42 and 42 west longitude. With a -long Atlantic coastline on the northeast, Guyana is bounded by Venezuela on the west, ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " on the west and south, and Suriname on the east. The land comprises three main geographical zones: the coastal plain, the white sand belt and the interior highlands.       The coastal plain, which occupies about 42 percent of the countrys area, is home to more than 42 percent of its inhabitants. The plain ranges from 42 to 42 kilometers wide and extends from the ": null
    },
    {
        "Corentyne River": "corentyne river"
    },
    {
        " in the east to the Venezuelan border in the northwest.     The coastal plain is made up largely of alluvial mud swept out to sea by the Amazon River, carried north by ocean currents, and deposited on the Guyanese shores. A rich clay of great fertility, this mud overlays the white sands and clays formed from the erosion of the interior bedrock and carried seaward by the rivers of Guyana. Because much of the coastal plain floods at high tide, efforts to dam and drain this area have gone on since the 42th century.     Guyana has no well-defined shoreline or sandy beaches. Approaching the ocean, the land gradually loses elevation until it includes many areas of marsh and swamp. Seaward from the vegetation line is a region of mud flats, shallow brown water, and sandbars. Off New Amsterdam, these mud flats extend almost . The sandbars and shallow water are a major impediment to shipping, and incoming vessels must partially unload their cargoes offshore in order to reach the docks at ": null
    },
    {
        "Georgetown": "georgetown, guyana"
    },
    {
        " and ": null
    },
    {
        "New Amsterdam": "new amsterdam, guyana"
    },
    {
        ".     A line of swamps forms a barrier between the white sandy hills of the interior and the coastal plain. These swamps, formed when water was prevented from flowing onto coastal croplands by a series of dams, serve as reservoirs during periods of drought.     The white sand belt lies south of the coastal zone. This area is 42 to 42 kilometers wide and consists of low sandy hills interspersed with rocky outcroppings. The white sands support a dense hardwood forest. These sands cannot support crops, and if the trees are removed erosion is rapid and severe. Most of Guyanas reserves of bauxite, gold, and diamonds are found in this region.     The largest of Guyanas three geographical regions is the interior highlands, a series of plateaus, flat-topped mountains, and savannahs that extend from the white sand belt to the countrys southern borders. The ": null
    },
    {
        "Pacaraima Mountains": "pacaraima mountains"
    },
    {
        " dominate the western part of the interior highlands. In this region are found some of the oldest sedimentary rocks in the Western Hemisphere. ": null
    },
    {
        "Mount Roraima": "mount roraima"
    },
    {
        ", on the Venezuelan border, is part of the Pakaraima range and, at 42 meters, is Guyanas tallest peak. Farther south lies the Kaieteur Plateau, a broad, rocky area about 42 meters in elevation; the 42-meter high ": null
    },
    {
        "Kanuku Mountains": "kanuku mountains"
    },
    {
        "; and the low ": null
    },
    {
        "Acarai Mountains": "acarai mountains"
    },
    {
        " situated on the southern border with Brazil.     Much of the interior highlands consist of grassland. The largest expanse of grassland, the Rupununi Savannah, covers about 42 square kilometers in southern Guyana. This savannah also extends far into Venezuela and Brazil. The part in Guyana is split into northern and southern regions by the Kanuku Mountains. The sparse grasses of the savannah in general support only grazing, although Amerindian groups cultivate a few areas along the ": null
    },
    {
        "Rupununi River": "rupununi river"
    },
    {
        " and in the foothills of the Kanuku Mountains.              Guyana is a water-rich country. Numerous rivers flow into the Atlantic Ocean, generally in a northward direction. A number of rivers in the western part of the country, however, flow eastward into the ": null
    },
    {
        "Essequibo River": "essequibo river"
    },
    {
        ", draining the Kaieteur Plateau. The Essequibo, the countrys major river, runs from the Brazilian border in the south to a wide delta west of Georgetown. The rivers of eastern Guyana cut across the coastal zone, making east-west travel difficult, but they also provide limited water access to the interior.     Waterfalls generally limit water transport to the lower reaches of each river. Some of the waterfalls are spectacular; for example, ": null
    },
    {
        "Kaieteur Falls": "kaieteur falls"
    },
    {
        " on the ": null
    },
    {
        "Potaro River": "potaro river"
    },
    {
        " drops 42 metres, more than four times the height of ": null
    },
    {
        "Niagara Falls": "niagara falls"
    },
    {
        ". Other enormous waterfalls are ": null
    },
    {
        "King Edward VIII Falls": "king edward viii falls"
    },
    {
        " , Kumerau Falls , Oshi Falls . In the country are known to exist more than 42 rapids and more than 42 large waterfalls. Many waterfalls are little known and most are not measured yet, it is possible that there are waterfalls in excess of 42 m tall.     Drainage throughout most of Guyana is poor and river flow sluggish because the average gradient of the main rivers is only one meter every five kilometers. Swamps and areas of periodic flooding are found in all but the mountainous regions, and all new land projects require extensive drainage networks before they are suitable for agricultural use. The average square kilometer on a sugar plantation, for example, has six kilometers of irrigation canals, eighteen kilometers of large drains, and eighteen kilometers of small drains. These canals occupy nearly one-eighth of the surface area of the average sugarcane field. Some of the larger estates have more than 42 kilometers of canals; Guyana itself has a total of more than 42 kilometers. Even Georgetown is below sea level and must depend on dikes for protection from the ": null
    },
    {
        "Demerara River": "demerara river"
    },
    {
        " and the Atlantic Ocean.              Lying near the ": null
    },
    {
        "equator": "equator"
    },
    {
        ", Guyana has a ": null
    },
    {
        "tropical climate": "tropical climate"
    },
    {
        ", and temperatures do not vary much throughout the year. The year has two ": null
    },
    {
        "wet season": "wet season"
    },
    {
        "s, from December to early February and from late April to mid-August.     Although the temperature never gets dangerously high, the combination of heat and humidity can at times seem oppressive. The entire area is under the influence of the northeast trade winds, and during the midday and afternoon sea breezes bring relief to the coast. Guyana lies south of the path of Caribbean hurricanes and none is known to have hit the country.     Temperatures in ": null
    },
    {
        "Georgetown": "georgetown, guyana"
    },
    {
        " are quite constant, with an average high of  and an average low of  in the hottest month , and an average range of  in February, the coolest month. The highest temperature ever recorded in the capital was  and the lowest . Humidity averages 42 percent year-round. Locations in the interior, away from the moderating influence of the ocean, experience slightly wider variations in daily temperature, and nighttime readings as low as  have been recorded. Humidity in the interior is also slightly lower, averaging around 42 percent.     Rainfall is heaviest in the northwest and lightest in the southeast and interior. Annual averages on the coast near the Venezuelan border are near , farther east at ": null
    },
    {
        "New Amsterdam": "new amsterdam, guyana"
    },
    {
        ", between  in southern Guyanas ": null
    },
    {
        "Rupununi Savannah": "rupununi savannah"
    },
    {
        ". Areas on the northeast sides of mountains that catch the trade winds average as much as  of precipitation annually. Although rain falls throughout the year, about 42 percent of the annual total arrives in the summer rainy season that extends from May to the end of July along the coast and from April through September farther inland. Coastal areas have a second rainy season from November through January. Rain generally falls in heavy afternoon showers or thunderstorms. Overcast days are rare; most days include four to eight hours of sunshine from morning through early afternoon.       ": null
    },
    {
        "Geographic coordinates": "geographic coordinates"
    },
    {
        ":      ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " 42  km, Suriname 42  km, Venezuela 42  km              Territorial sea:  ": null
    },
    {
        "Exclusive economic zone": "exclusive economic zone"
    },
    {
        ":  and   or to the outer edge of the continental margin       Mostly rolling highlands; low coastal plain; ": null
    },
    {
        "savanna": "savanna"
    },
    {
        " in south.     Highest temperature ever recorded in Guyana was .       Lowest point: Atlantic Ocean, 42 m   Highest point: ": null
    },
    {
        "Mount Roraima": "mount roraima"
    },
    {
        ", 42 m       ": null
    },
    {
        "Bauxite": "bauxite"
    },
    {
        ", ": null
    },
    {
        "gold": "gold"
    },
    {
        ", ": null
    },
    {
        "diamonds": "diamonds"
    },
    {
        ", hardwood timber, ": null
    },
    {
        "shrimp": "shrimp"
    },
    {
        ", ": null
    },
    {
        "fish": "fish"
    },
    {
        ".      ": null
    },
    {
        "deforestation": "deforestation"
    },
    {
        "       Party to: ": null
    },
    {
        "Biodiversity": "biodiversity"
    },
    {
        ", ": null
    },
    {
        "Climate Change": "united nations framework convention on climate change"
    },
    {
        ", ": null
    },
    {
        "Desertification": "desertification"
    },
    {
        ", ": null
    },
    {
        "Endangered Species": "endangered species"
    },
    {
        ", Hazardous Wastes, ": null
    },
    {
        "Law of the Sea": "law of the sea"
    },
    {
        ", ": null
    },
    {
        "Ozone Layer Protection": "ozone layer protection"
    },
    {
        ", ": null
    },
    {
        "Ship Pollution": "ship pollution"
    },
    {
        ", ": null
    },
    {
        "Tropical Timber 42": "tropical timber 83"
    },
    {
        ", ": null
    },
    {
        "Tropical Timber 42": "tropical timber 94"
    },
    {
        " Waini Peninsula": "waini peninsula"
    },
    {
        " Brazil": "brazil"
    },
    {
        " near Wai-Wai, ": null
    },
    {
        "Upper Takutu-Upper Essequibo": "upper takutu-upper essequibo"
    },
    {
        " Region   Westernmost point – ": null
    },
    {
        "Mount Venamo": "mount venamo"
    },
    {
        ", border with ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        ", ": null
    },
    {
        "Cuyuni-Mazaruni": "cuyuni-mazaruni"
    },
    {
        " Suriname": "suriname"
    },
    {
        " and ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", ": null
    },
    {
        "East Berbice-Corentyne": "east berbice-corentyne"
    },
    {
        " Mount Roraima": "mount roraima"
    }
]