[
    {
        " Turkmenistan  is a ": null
    },
    {
        "landlocked": "landlocked"
    },
    {
        " country in ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        ", bordering the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        " to the west, ": null
    },
    {
        "Iran": "iran"
    },
    {
        " and ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        " to the south, ": null
    },
    {
        "Uzbekistan": "uzbekistan"
    },
    {
        " to the north-east, and ": null
    },
    {
        "Kazakhstan": "kazakhstan"
    },
    {
        " to the north-west. It is the southernmost republic of the ": null
    },
    {
        "Commonwealth of Independent States": "commonwealth of independent states"
    },
    {
        " , the loose federation created at the end of 1991 by most of the ": null
    },
    {
        "Post-Soviet states": "post-soviet states"
    },
    {
        ".     Its longest border is with the Caspian Sea . The other borders are with Iran , Afghanistan , Uzbekistan  and Kazakhstan . Turkmenistan is slightly larger than the US state of ": null
    },
    {
        "California": "california"
    },
    {
        " in territory, occupying 488,100  km². By area, Turkmenistan ranks fourth among the former Soviet republics, after ": null
    },
    {
        "Russia": "russia"
    },
    {
        ", Kazakhstan, and ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        ". The countrys greatest extent from west to east is , and its greatest north-to-south distance is .                            Terrain of Turkmenistan consists of a flat-to-rolling sandy ": null
    },
    {
        "desert": "desert"
    },
    {
        ", the ": null
    },
    {
        "Karakum": "karakum desert"
    },
    {
        ", with its ": null
    },
    {
        "dunes": "dune"
    },
    {
        "slowly rising to the south; by the time they reach the border with ": null
    },
    {
        "Iran": "iran"
    },
    {
        ", they become the low mountains known as the ": null
    },
    {
        "Kopet Dag": "kopet dag"
    },
    {
        ". The ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        " washes the western shores of this mostly ": null
    },
    {
        "arid": "arid"
    },
    {
        " country.     Turkmenistans average elevation is 100 to 220 meters above sea level, with its highest point being ": null
    },
    {
        "Mount Aýrybaba": "mount ayrybaba"
    },
    {
        " in the ": null
    },
    {
        "Köýtendag Range": "köýtendag range"
    },
    {
        " of the ": null
    },
    {
        "Pamir-Alay": "pamir-alay"
    },
    {
        " chain in the south-east, and its lowest point being the Akjagaýa Depression in ": null
    },
    {
        "Sarygamysh Lake": "sarygamysh lake"
    },
    {
        ", close to 100 meters below sea level .  . The ": null
    },
    {
        "Mount Arlan": "gora arlan"
    },
    {
        " rises sharply above sea level in the ": null
    },
    {
        "Great Balkhan Range": "great balkhan range"
    },
    {
        " in western Turkmenistan . Nearly 80% of the republic lies within the ": null
    },
    {
        "Turan Depression": "turan depression"
    },
    {
        ", which slopes from south to north and from east to west.     Turkmenistans mountains include 600  km of the northern reaches of the Kopet Dag Range, which it shares with Iran. The Kopet Dag Range is a region characterized by foothills, dry and sandy slopes, mountain plateaus, and steep ravines; ": null
    },
    {
        "Mount Şahşah": "mount şahşah"
    },
    {
        " , also known as ": null
    },
    {
        "Mount Rizeh": "mount rizeh"
    },
    {
        ", southwest of ": null
    },
    {
        "Ashgabat": "ashgabat"
    },
    {
        ", is the highest elevation of the Kopet Dag Range in Turkmenistan. The Kopet Dag is undergoing tectonic transformation, meaning that the region is threatened by ": null
    },
    {
        "earthquakes": "earthquake"
    },
    {
        "such as the one that destroyed Ashgabat in 1948. The ": null
    },
    {
        "Krasnovodsk": "turkmenbashi, turkmenistan"
    },
    {
        " and ": null
    },
    {
        "Üstýurt": "ustyurt"
    },
    {
        " plateaus are the prominent topographical features of northwestern Turkmenistan.     A dominant feature of the republics landscape is the Garagum Desert , which occupies about 350,000 square kilometers . Shifting winds create desert mountains that range from two to twenty meters in height and may be several kilometers in length. Chains of such structures are common, as are steep elevations and smooth, concrete-like clay deposits formed by the rapid evaporation of flood waters in the same area for a number of years. Large marshy salt flats, formed by capillary action in the soil, exist in many depressions, including the ": null
    },
    {
        "Garaşor": "garaşor"
    },
    {
        ", which occupies 1,500 square kilometers in the northwest. The ": null
    },
    {
        "Sandykly Desert": "sandykly desert"
    },
    {
        " west of the ": null
    },
    {
        "Amu Darya": "amu darya"
    },
    {
        " river is the southernmost extremity of the ": null
    },
    {
        "Qizilqum": "kyzyl kum"
    },
    {
        " Desert, most of which lies in Uzbekistan to the northeast.             Turkmenistan has a cold desert climate that is severely ": null
    },
    {
        "continental": "continental climate"
    },
    {
        ". Summers are long , hot, and dry, while winters generally are mild and dry, although occasionally cold and damp in the north. Most precipitation falls between January and May; precipitation is slight throughout the country, with annual averages ranging from  in the ": null
    },
    {
        "Kopet Dag": "kopet dag"
    },
    {
        " to  in the northwest. The capital, ": null
    },
    {
        "Ashgabat": "ashgabat"
    },
    {
        ", close to the Iranian border in south-central Turkmenistan, averages  of rainfall annually. Average annual temperatures range from  in Ashgabat to  in ": null
    },
    {
        "Daşoguz": "daşoguz"
    },
    {
        ", on the Uzbek border in north-central Turkmenistan. The almost constant winds are northerly, northeasterly, or westerly.       Almost 80% of the territory of Turkmenistan lacks a constant source of surface water flow. Its main rivers are located only in the southern and eastern peripheries; a few smaller rivers on the northern slopes of the Kopetdag are diverted entirely to irrigation. The most important river is the Amu Darya, which has a total length of 2,540  km from its farthest tributary, making it the longest river in Central Asia. The Amu Darya flows across northeastern Turkmenistan, thence eastward to form the southern borders of Uzbekistan and ": null
    },
    {
        "Tajikistan": "tajikistan"
    },
    {
        ". Damming and irrigation uses of the Amu Darya have had severe environmental effects on the ": null
    },
    {
        "Aral Sea": "aral sea"
    },
    {
        ", into which the river flows . The rivers average annual flow is 1,940 cubic meters per second. Other major rivers are the ": null
    },
    {
        "Tejen": "hari river, afghanistan"
    },
    {
        " ; the ": null
    },
    {
        "Murgab": "murgab river"
    },
    {
        " ; and the ": null
    },
    {
        "Atrek": "atrek river"
    },
    {
        " .            Since the ": null
    },
    {
        "dissolution of the Soviet Union": "dissolution of the soviet union"
    },
    {
        ", ": null
    },
    {
        "environmental regulation": "environmental regulation"
    },
    {
        " is largely unchanged in Turkmenistan. The new government created the Ministry of Natural Resources Use and Environmental Protection in July 1992, with departments responsible for environmental protection, protection of flora and fauna, ": null
    },
    {
        "forestry": "forestry"
    },
    {
        ", ": null
    },
    {
        "hydrometeorology": "hydrometeorology"
    },
    {
        ", and administrative planning. Like other CIS republics, Turkmenistan has established an Environmental Fund based on revenues collected from environmental fines, but the fines generally are too low to accumulate significant revenue. Thanks to the former Soviet system of game preserves and the efforts of the Society for Nature Conservation and the Academy of Sciences, flora and fauna receive some protection in the republic; however, hard-currency hunts by wealthy Western and Arab businesspeople already are depleting animals on preserves.       Contamination of soil and groundwater with agricultural chemicals, pesticides; salination, water-logging of soil due to poor irrigation methods; Caspian Sea pollution; diversion of a large share of the flow of the ": null
    },
    {
        "Amu Darya": "amu darya"
    },
    {
        " into irrigation contributes to that rivers inability to replenish the ": null
    },
    {
        "Aral Sea": "aral sea"
    },
    {
        "; ": null
    },
    {
        "desertification": "desertification"
    },
    {
        "       party to: Biodiversity, Climate Change, Climate Change-": null
    },
    {
        "Kyoto Protocol": "kyoto protocol"
    },
    {
        ", Desertification, Hazardous Wastes, Ozone Layer Protection   signed, but not ratified: none of the selected agreements       According to estimates, as a result of desertification processes and pollution, biological productivity of the ecological systems in Turkmenistan has declined by 30% to 50% in recent decades. The ": null
    },
    {
        "Karakum": "karakum desert"
    },
    {
        " and ": null
    },
    {
        "Kyzyl Kum": "kyzyl kum"
    },
    {
        " deserts are expanding at a rate surpassed on a planetary scale only by the desertification process in the ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        " and ": null
    },
    {
        "Sahel": "sahel"
    },
    {
        " regions of Africa. Between 8,000 and 10,000  km² of new desert now appears each year in Central Asia.     The most irreparable type of desertification is the ": null
    },
    {
        "salinization": "soil salinity"
    },
    {
        " process that forms marshy salt flats. A major factor that contributes to these conditions is inefficient use of water because of weak regulation and failure to charge for water that is used. Efficiency in application of water to the fields is low, but the main problem is leakage in main and secondary canals, especially Turkmenistans main canal, the ": null
    },
    {
        "Karakum Canal": "qaraqum canal"
    },
    {
        ". Nearly half of the canals water seeps out into lakes and salt swamps along its path. Excessive irrigation brings salts to the surface, forming salt marshes that dry into unusable clay flats. In 1989 Turkmenistans Institute for Desert Studies claimed that the area of such flats had reached 10,000  km².     The type of desertification caused by year-round pasturing of cattle has been termed the most devastating in Central Asia, with the gravest situations in Turkmenistan and the ": null
    },
    {
        "Kazakh steppe": "kazakhstan"
    },
    {
        " along the eastern and northern coasts of the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        ". Wind erosion and desertification also are severe in settled areas along the Garagum Canal; planted windbreaks have died because of soil waterlogging and/or salinization. Other factors promoting desertification are the inadequacy of the collector-drainage system built in the 1950s and inappropriate application of chemicals.       Turkmenistan both contributes to and suffers from the consequences of the desiccation of the ": null
    },
    {
        "Aral Sea": "aral sea"
    },
    {
        ". Because of excessive irrigation, Turkmen agriculture contributes to the steady drawdown of sea levels. In turn, the Aral Seas ": null
    },
    {
        "desiccation": "desiccation"
    },
    {
        ", which had shrunk that body of water by an estimated 59,000 square kilometers by 1994, profoundly affects economic productivity and the health of the population of the republic. Besides the cost of ameliorating damaged areas and the loss of at least part of the initial investment in them, salinization and chemicalization of land have reduced agricultural productivity in Central Asia by an estimated 20 to 25%. Poor drinking water is the main health risk posed by such environmental degradation. In ": null
    },
    {
        "Dashhowuz Province": "dashhowuz province"
    },
    {
        ", which has suffered the greatest ecological damage from the Aral Seas desiccation, bacteria levels in drinking water exceeded ten times the sanitary level; 70% of the population has experienced illnesses, many with ": null
    },
    {
        "hepatitis": "hepatitis"
    },
    {
        ", and ": null
    },
    {
        "infant mortality": "infant mortality"
    },
    {
        " is high. Experts have warned that inhabitants will have to evacuate the province by the end of the century unless a comprehensive cleanup program is undertaken. Turkmenistan has announced plans to clean up some of the Aral Sea fallout with financial support from the ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        ".       The most productive ": null
    },
    {
        "cotton": "cotton"
    },
    {
        " lands in Turkmenistan receive as much as 250 kilograms of fertilizer per hectare, compared with the average application of thirty kilograms per hectare. Furthermore, most fertilizers are so poorly applied that experts have estimated that only 15 to 40% of the chemicals can be absorbed by cotton plants, while the remainder washes into the soil and subsequently into the groundwater. Cotton also uses far more pesticides and defoliants than other crops, and application of these chemicals often is mishandled by farmers. For example, local herdsmen, unaware of the danger of DDT, have reportedly mixed the pesticide with water and applied it to their faces to keep away mosquitoes. In the late 1980s, a drive began in Central Asia to reduce agrochemical usage. In Turkmenistan the campaign reduced fertilizer use 30% between 1988 and 1989. In the early 1990s, use of some pesticides and defoliants declined drastically because of the countrys shortage of hard currency.       Area:   total: 488,100  km²   land: 469,930  km²   water: 18,170  km²     Area - comparative: slightly larger than the US state of California     Land boundaries:   total: 3,736  km   border countries: ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        " 744  km, ": null
    },
    {
        "Iran": "iran"
    },
    {
        " 992  km, ": null
    },
    {
        "Kazakhstan": "kazakhstan"
    },
    {
        " 379  km, ": null
    },
    {
        "Uzbekistan": "uzbekistan"
    },
    {
        " 1,621  km     Coastline: 0  km   Note: Turkmenistan borders the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        ". Its coastline with the Caspian Sea is 1,768  km.     Maritime claims: none       Natural resources: ": null
    },
    {
        "petroleum": "petroleum"
    },
    {
        ", ": null
    },
    {
        "natural gas": "natural gas"
    },
    {
        ", ": null
    },
    {
        "sulfur": "sulfur"
    },
    {
        ", ": null
    },
    {
        "salt": "salt"
    },
    {
        "     Land use:   arable land: 3.89%   permanent crops: 0.12%   other: 95.98%     Irrigated land: 19,910  km²     Total renewable water resources:": null
    }
]