[
    {
        "Dominica": "dominica"
    },
    {
        " is an ": null
    },
    {
        "island": "island"
    },
    {
        " in the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        ", located about halfway between the French islands of ": null
    },
    {
        "Guadeloupe": "guadeloupe"
    },
    {
        " and ": null
    },
    {
        "Martinique": "martinique"
    },
    {
        " . Its coordinates are 15 25 N, 61 20 W. It is known as The Nature Island of the Caribbean due to its spectacular, lush, and varied flora and fauna, which is protected by an extensive natural park system. It is the fourth largest island in the Eastern Caribbean with a population of people mainly of African descent.     The lowest point in the country is at ": null
    },
    {
        "sea level": "sea level"
    },
    {
        " along the coast, and the highest is ": null
    },
    {
        "Morne Diablotins": "morne diablotins"
    },
    {
        " . The extreme southwestern coast of the island includes a large collapsed submarine caldera. Portions of the exposed rim of this caldera form the southwestern tip of the island at Scotts Head. Natural resources include ": null
    },
    {
        "farming": "farming"
    },
    {
        ", ": null
    },
    {
        "hydropower": "hydropower"
    },
    {
        " and ": null
    },
    {
        "timber": "timber"
    },
    {
        ".     Geographically, Dominica is distinctive in many ways. The country has one of the most rugged landscapes in the Caribbean, covered by a largely unexploited, multi-layered rain forest. It is also among the Earths most rain-drenched lands, and the water runoff forms cascading rivers and natural pools. The island, home to rare species of wildlife, is considered by many as a beautiful, unspoiled tropical preserve. According to a popular West Indian belief, Dominica is the only New World territory that Columbus would still recognize.     Dominica is the largest and most northerly of the ": null
    },
    {
        "Windward Islands": "windward islands"
    },
    {
        ". The island faces the Atlantic Ocean to the east and the Caribbean Sea to the west. Its nearest neighbors are the French islands of Guadeloupe, some  north, and Martinique, about  south. Oblong-shaped and slightly smaller than New York City, Dominica is  in area,  in length, and  in width. Roseau, the nations capital and major port, is favorably situated on the sheltered, southwestern coast.       The islands ": null
    },
    {
        "climate": "climate"
    },
    {
        " is tropical, moderated by northeast ": null
    },
    {
        "trade winds": "trade winds"
    },
    {
        " and heavy ": null
    },
    {
        "rain": "rain"
    },
    {
        "fall.     Dominica has a ": null
    },
    {
        "tropical rainforest climate": "tropical rainforest climate"
    },
    {
        " and some areas bordering on a ": null
    },
    {
        "tropical monsoon climate": "tropical monsoon climate"
    },
    {
        " with characteristically warm temperatures and heavy rainfall. Excessive heat and humidity are tempered somewhat by a steady flow of the northeast trade winds, which periodically develop into hurricanes during the Northern Hemispheres summer. The steep interior slopes also alter temperatures and winds. Because of the moderating effects of the surrounding ocean temperature ranges are slight. Average daytime temperatures generally vary from  in January to  in June. Diurnal ranges are usually no greater than  in most places, but temperatures dipping to  on the highest peaks are not uncommon.     Most of the islands ample supply of water is brought by the trade winds. Although amounts vary with the location, rain is possible throughout the year, with the greatest monthly totals recorded from June through October. Average yearly rainfall along the windward east coast frequently exceeds , and exposed mountainsides receive up to , among the highest accumulations in the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " and the world. Totals on the leeward west coast, however, are only about  per year. Humidities are closely tied to rainfall patterns, with the highest values occurring on windward slopes and the lowest in sheltered areas. Relative humidity readings between 70 percent and 90 percent have been recorded in Roseau.     Hurricanes and severe winds, most likely to occur during the wettest months, occasionally are devastating. The most recent hurricanes of note were ": null
    },
    {
        "David": "hurricane david"
    },
    {
        ", ": null
    },
    {
        "Maria": "hurricane maria"
    },
    {
        ", and ": null
    },
    {
        "Frederic": "hurricane frederic"
    },
    {
        " in August 1979 and ": null
    },
    {
        "Allen": "hurricane allen"
    },
    {
        " in August 1980. The 1979 hurricanes caused over 40 deaths, 2,500 injuries, and extensive destruction of housing and crops. Many agricultural commodities were destroyed during the 1980 storm, and about 25 percent of the banana crop was destroyed by strong winds in 1984.     Dominica is especially vulnerable to hurricanes as the island is located in what is referred to as the ": null
    },
    {
        "hurricane": "hurricane"
    },
    {
        " region. In 1979, Dominica was hit directly by ": null
    },
    {
        "Category 5": "saffir–simpson hurricane scale"
    },
    {
        " Hurricane David": "hurricane david"
    },
    {
        ", causing widespread and extreme damage. On August 17, 2007, ": null
    },
    {
        "Hurricane Dean": "hurricane dean"
    },
    {
        ", a ": null
    },
    {
        "Category 1": "saffir–simpson hurricane scale"
    },
    {
        " at the time, hit the island. A mother and her seven-year-old son died when a ": null
    },
    {
        "landslide": "landslide"
    },
    {
        " caused by the heavy rains fell onto their house.   In another incident two people were injured when a tree fell on their house.  ": null
    },
    {
        "Prime Minister": "prime minister of dominica"
    },
    {
        " Roosevelt Skerrit": "roosevelt skerrit"
    },
    {
        " estimated that 100 to 125 homes were damaged, and that the agriculture sector was extensively damaged, in particular the banana crop.      Below is the climate data for Roseau, the capital city located on the western side of Dominica partially shielded from the trade winds by the mountains.               Bays are as follows from the northern tip of the island in a clockwise direction:     ": null
    },
    {
        "Agoucha Bay": "agoucha bay"
    },
    {
        ",   ": null
    },
    {
        "Sandwich Bay": "sandwich bay"
    },
    {
        ",   ": null
    },
    {
        "Grand Baptiste Bay": "grand baptiste bay"
    },
    {
        ",   ": null
    },
    {
        "Petit Baptiste Bay": "petit baptiste bay"
    },
    {
        ",   ": null
    },
    {
        "La Taille Bay": "la taille bay"
    },
    {
        ", ": null
    },
    {
        "Rough Bay": "rough bay"
    },
    {
        ",   ": null
    },
    {
        "Marigot Bay,": "marigot bay"
    },
    {
        "   Walkers Rest Bay": "walkers rest bay"
    },
    {
        ",   ": null
    },
    {
        "Sophia Bay": "sophia bay"
    },
    {
        ",   ": null
    },
    {
        "Londonderry Bay": "londonderry bay"
    },
    {
        ",   ": null
    },
    {
        "Mango Hole Bay": "mango hole bay"
    },
    {
        ",   ": null
    },
    {
        "Middle Bay": "middle bay"
    },
    {
        ",   ": null
    },
    {
        "Panto Hole Bay": "panto hole bay"
    },
    {
        ",   ": null
    },
    {
        "Petite Soufriere Bay": "petite soufriere bay"
    },
    {
        ",   ": null
    },
    {
        "Soufriere Bay": "soufriere bay"
    },
    {
        ",   ": null
    },
    {
        "Woodbridge Bay": "woodbridge bay"
    },
    {
        ",   ": null
    },
    {
        "Prince Rupert Bay": "prince rupert bay"
    },
    {
        ",   ": null
    },
    {
        "Douglas Bay": "douglas bay"
    },
    {
        ".          Dominica was the last island to be formed in the Caribbean. The island was created by volcanic action about 26 million years ago. It lies upon two opposing tectonic plates. This explains why an island a bit bigger than ": null
    },
    {
        "Marthas Vineyard": "marthas vineyard"
    },
    {
        " has mountains approaching .      Geologically, Dominica is part of the rugged Lesser Antilles volcanic arc. The countrys central spine, a northwest-southeast axis of steep volcanic slopes and deep gorges, generally varies in elevation from  above sea level. Several east-west trending mountain spurs extend to the narrow coastal plain, which is studded with sea cliffs and has level stretches no wider than . The highest peak is Morne Diablotins, at ; Morne Trois Pitons, with an elevation of , lies farther south and is the site of the national park.     The interior features rugged ": null
    },
    {
        "mountains": "mountain"
    },
    {
        "of ": null
    },
    {
        "volcanic": "volcano"
    },
    {
        " origin. Volcanism is still quite evident on the island, the most popular examples being Dominicas ": null
    },
    {
        "Boiling Lake": "boiling lake"
    },
    {
        " and valley of desolation. The boiling lake is within a crater and is fed by a waterfall - the boiling is believed to be caused by the heat of a magma chamber beneath the lake. The valley of desolation is a sulfurous valley of volcanic vents and hot springs that inhibits significant plant growth - in stark contrast to the surrounding rain forest. Technically dormant today, this caldera last erupted in 1880. The area that exploded on 4 January 1880 was reported to be fully nine square miles . The Twillingate Sun, February 10, 1881.        Dominicas rugged surface is marked by its volcanic past. Rock formations are mainly volcanic andesite and rhyolite, with fallen boulders and sharp-edged protrusions peppering slope bases. The light- to dark-hued clay and sandy soils, derived from the rocks and decomposed vegetation, are generally fertile and porous. Only a few interior valleys and coastal strips are flat enough for soil accumulations of consequence, however. Although scores of mostly mild seismic shocks were recorded in 1986, volcanic eruptions ceased thousands of years ago. Sulfuric springs and steam vents, largely concentrated in the central and southern parts of the island, remain active, however. One of the largest springs, Boiling Lake, is located in the national park.     Dominica is water-rich with swift-flowing highland streams, which cascade into deep gorges and form natural pools and crater lakes. The streams are not navigable, but many are sources of hydroelectric power. Trafalgar Falls, located near the national park, is one of the most spectacular sites on the island. The falls consists of twin waterfalls known as the mother and father or the Mama and the Papa. At the base of each waterfall are natural pools. Locals and tourists alike come here to enjoy the water. At the base of the Papa fall a natural hot spring can also be found which heats a portion of its pool. The principal rivers flowing westward are the Layou and the Roseau, and the major one emptying eastward is the Toulaman. The largest crater lake, called Boeri, is located in the national park. There are 83 significant waterways on the island out of a total of 365 with also includes rills and brooks.       There are 172 species of birds, including four species of ": null
    },
    {
        "hummingbird": "hummingbird"
    },
    {
        ", ": null
    },
    {
        "broad-winged hawk": "broad-winged hawk"
    },
    {
        "s, ": null
    },
    {
        "yellow-crowned night heron": "yellow-crowned night heron"
    },
    {
        "s, and the ": null
    },
    {
        "brown trembler": "brown trembler"
    },
    {
        ". Some plants and animals thought to be extinct on surrounding islands can still be found in Dominicas forests.     The ": null
    },
    {
        "sisserou parrot": "imperial parrot"
    },
    {
        " is Dominicas national bird and is indigenous to its mountain forests.     The ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        " offshore of the island of Dominica is home to many ": null
    },
    {
        "cetaceans": "cetaceans"
    },
    {
        ". Most notably a small group of ": null
    },
    {
        "sperm whales": "sperm whale"
    },
    {
        "live in this area year round. These are shy animals, but there is a good chance of seeing them if you go out on a calm day. Other cetaceans commonly seen in the area include ": null
    },
    {
        "pilot whale": "pilot whale"
    },
    {
        ", ": null
    },
    {
        "Frasers dolphin": "frasers dolphin"
    },
    {
        ", ": null
    },
    {
        "pantropical spotted dolphin": "pantropical spotted dolphin"
    },
    {
        " and ": null
    },
    {
        "bottlenose dolphin": "bottlenose dolphin"
    },
    {
        ". Less commonly seen animals include ": null
    },
    {
        "Cuviers beaked whale": "cuviers beaked whale"
    },
    {
        ", ": null
    },
    {
        "false killer whale": "false killer whale"
    },
    {
        ", ": null
    },
    {
        "pygmy sperm whale": "pygmy sperm whale"
    },
    {
        ", ": null
    },
    {
        "dwarf sperm whale": "dwarf sperm whale"
    },
    {
        ", ": null
    },
    {
        "Rissos dolphin": "rissos dolphin"
    },
    {
        ", ": null
    },
    {
        "common dolphin": "common dolphin"
    },
    {
        ", ": null
    },
    {
        "humpback whale": "humpback whale"
    },
    {
        " and ": null
    },
    {
        "Brydes whale": "brydes whale"
    },
    {
        ". This makes Dominica a destination for tourists interested in ": null
    },
    {
        "whale-watching": "whale-watching"
    },
    {
        ".         Map references:   Central America and the Caribbean     Area:   total:   751 km 2   land:   751  km 2     Coastline:   148  km     Maritime claims:   territorial sea:      contiguous zone:      exclusive economic zone:        Land use:   arable land:   8%   permanent crops:   24%   other:   68%     Irrigated land:   NA km 2     Freshwater withdrawal :   total: 0.02  km 3 /yr   per capita: 244.1 m 3 /yr     Natural hazards:   Flash floods are a constant threat; destructive hurricanes can be expected during the late summer months     Environment - international agreements:     Party to:   ": null
    },
    {
        "Biodiversity": "biodiversity"
    },
    {
        ", Climate Change, ": null
    },
    {
        "Desertification": "desertification"
    },
    {
        ", Endangered Species, Environmental Modification, Hazardous Wastes, ": null
    },
    {
        "Law of the Sea": "law of the sea"
    },
    {
        ", Ozone Layer Protection, Ship Pollution, Whaling         Northernmost point – ": null
    },
    {
        "Carib Point": "carib point"
    },
    {
        ", ": null
    },
    {
        "Saint Andrew Parish": "saint andrew parish, dominica"
    },
    {
        " Scotts Head": "scotts head, dominica"
    },
    {
        ", ": null
    },
    {
        "Saint Mark Parish": "saint mark parish, dominica"
    },
    {
        " Saint John Parish": "saint john parish, dominica"
    },
    {
        " Saint David Parish": "saint david parish, dominica"
    },
    {
        " Morne Diablotins": "morne diablotins"
    },
    {
        ": 1,447 m   Lowest point – ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    }
]