[
    {
        "North Macedonia": "north macedonia"
    },
    {
        " is a country situated in ": null
    },
    {
        "southeastern": "balkans"
    },
    {
        " Europe with ": null
    },
    {
        "geographic coordinates": "geographic coordinate system"
    },
    {
        " , bordering ": null
    },
    {
        "Kosovo": "kosovo"
    },
    {
        " and ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        " to the north, ": null
    },
    {
        "Bulgaria": "bulgaria"
    },
    {
        " to the east, ": null
    },
    {
        "Greece": "greece"
    },
    {
        " to the south and ": null
    },
    {
        "Albania": "albania"
    },
    {
        " to the west. The country is part of the wider ": null
    },
    {
        "region of Macedonia": "macedonia"
    },
    {
        " and makes up most of ": null
    },
    {
        "Vardar Macedonia": "vardar macedonia"
    },
    {
        ". The country is a major transportation corridor from ": null
    },
    {
        "Western": "western europe"
    },
    {
        " and ": null
    },
    {
        "Central Europe": "central europe"
    },
    {
        " to ": null
    },
    {
        "Southern Europe": "southern europe"
    },
    {
        " and the ": null
    },
    {
        "Aegean Sea": "aegean sea"
    },
    {
        ". North Macedonia is a landlocked country but has three major natural lakes: ": null
    },
    {
        "Lake Ohrid": "lake ohrid"
    },
    {
        ", ": null
    },
    {
        "Lake Prespa": "lake prespa"
    },
    {
        " and ": null
    },
    {
        "Lake Dojran": "lake dojran"
    },
    {
        ". It has a water area of 857  km 2 , while its land area is 24,856  km 2 .     ": null
    },
    {
        "Phytogeographically": "phytogeography"
    },
    {
        ", Macedonia belongs to the Illyrian province of the ": null
    },
    {
        "Circumboreal Region": "circumboreal region"
    },
    {
        " within the ": null
    },
    {
        "Boreal Kingdom": "boreal kingdom"
    },
    {
        ". According to the ": null
    },
    {
        "WWF": "world wide fund for nature"
    },
    {
        " and Digital Map of European Ecological Regions by the ": null
    },
    {
        "European Environment Agency": "european environment agency"
    },
    {
        ", North Macedonias territory can be subdivided into four ": null
    },
    {
        "ecoregion": "ecoregion"
    },
    {
        "s: the ": null
    },
    {
        "Pindus Mountains": "pindus"
    },
    {
        " mixed forests": "temperate broadleaf and mixed forests"
    },
    {
        ", ": null
    },
    {
        "Balkan": "balkans"
    },
    {
        " mixed forests": "temperate broadleaf and mixed forests"
    },
    {
        ", ": null
    },
    {
        "Rhodopes": "rhodope mountains"
    },
    {
        " mixed forests": "temperate broadleaf and mixed forests"
    },
    {
        " and ": null
    },
    {
        "Aegean": "aegean sea"
    },
    {
        " sclerophyll": "sclerophyll"
    },
    {
        "ous and ": null
    },
    {
        "mixed forests": "temperate broadleaf and mixed forests"
    },
    {
        ".               North Macedonia has a unique climate explained by its location and topography. The climate of the plains is a ": null
    },
    {
        "Mediterranean climate": "mediterranean climate"
    },
    {
        " combined with the influence of the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        ". Georges Castellan, op. cit., p. 13 The country also holds continental characteristics, which are accentuated by the mountains in the south which prevent hot air from the south from moving to the north. Conversely, the ": null
    },
    {
        "Šar Mountains": "šar mountains"
    },
    {
        ", which are located in the northwestern part, block cold northern winds. In whole, the northern and western parts of the country are relatively close to a ": null
    },
    {
        "Continental climate": "continental climate"
    },
    {
        " and the southern and eastern to a Mediterranean climate. Dominique Auzias et Jean-Paul Labourdette, op. cit., p. 25     North Macedonia has four seasons, but the lengths of the seasons varies based on geography. The spring is often very short. Summers are subtropical and it is not uncommon to see temperatures of above  during this season, especially in the plains along the valley of the ": null
    },
    {
        "Vardar": "vardar"
    },
    {
        " river. Winters, although moderate, can be quite cold. Snowfalls during winter are common and occasionally heavy. The average annual temperature of the air is , but the plains experience higher temperatures, . The warmest month is July, which has an average temperature of  and the coldest is January, with a temperature of . The maximum and minimum temperatures recorded in North Macedonia to date are  and , respectively.      The rainfall is abundant in the western and eastern parts of the country, but the temperature decreases significantly in the Vardar region. This region sees warmer winters through the Vardarec wind. This wind comes up from the mouth of the Vardar river and brings warm air. Skopje, considered a low-lying city, has an average of 64 rainy days per year. The month of October is the wettest with 61  mm; the driest is August with 28  mm. Rains are most common in the spring and fall.      Climate Facts:           Climatic data for Skopje :                   The country has some 766  km of boundaries, shared with Kosovo to the northwest, Serbia to the North, Bulgaria to the east, Greece to the south, and Albania to the west.     The north border with Serbia and Kosovo is 221 kilometers in length. The border was made after World War II, between ": null
    },
    {
        "SR Macedonia": "sr macedonia"
    },
    {
        " and ": null
    },
    {
        "SR Serbia": "sr serbia"
    },
    {
        ". But in 2008 when Kosovo ": null
    },
    {
        "declared independence": "2008 kosovo declaration of independence"
    },
    {
        " the border with it was remarked again. Rather more than half of the boundary separates North Macedonia from Kosovo. From the tripoint with Albania, the boundary trends north-eastwards along the watershed of ": null
    },
    {
        "Šar Mountain": "šar mountain"
    },
    {
        ". It describes a curve to the south across the River ": null
    },
    {
        "Lepenec": "lepenec"
    },
    {
        " and then turns to north-east to traverse Mount Crna before taking a course slightly to the north of east across the landscape features to the tripoint with Bulgaria.      The east border with Bulgaria has length of approximately 148  km. The settled boundary from Yugoslavia and the ": null
    },
    {
        "Peoples Republic of Bulgaria": "peoples republic of bulgaria"
    },
    {
        " was accepted after the independence in 1992.  The boundary starts from the tripoint with Greece, the boundary runs north, crossing the ": null
    },
    {
        "River of Strumica": "strumica river"
    },
    {
        " and then rising to the watershed which it follows northwards and then north-westwards to the tripoint with Serbia.     The south border that splits North Macedonia from Greece is 228  km long and it is the longest border. It was marked with the ": null
    },
    {
        "Treaty of Bucharest": "treaty of bucharest"
    },
    {
        " on 10 August 1913. The border starts from the tripoint with Albania, in ": null
    },
    {
        "Lake Prespa": "lake prespa"
    },
    {
        ", the boundary runs in a straight line eastwards across the lake and then continues in the north of east trend across the relief to the ": null
    },
    {
        "Voras Oros": "voras mountains"
    },
    {
        " , where it turns north-eastwards. It traverses the watershed of the Voras Oros and then continues eastwards along the watershed before dropping to the valley of Vardar river. The boundary continues eastwards and then turns north across the ": null
    },
    {
        "Dojran lake": "dojran lake"
    },
    {
        ", before, on the latitude of ": null
    },
    {
        "Valandovo": "valandovo"
    },
    {
        ", turning east to the tripoint with Bulgaria on Mount Tumba.     The boundary with Albania was marked first in 1926 and then remarked with the ": null
    },
    {
        "Treaty of Paris": "paris peace treaties, 1947"
    },
    {
        " in 1947. The boundary starts from the tripoint with Kosovo and follows a watershed before crossing, and for a short distance, following the ": null
    },
    {
        "Black Drin": "black drin"
    },
    {
        " river and continuing along a crest line to ": null
    },
    {
        "Ohrid Lake": "ohrid lake"
    },
    {
        ". It crosses the lake, leaving approximately one-third in Albania, traverses a high ridge and meets the tripoint with Greece in Lake Prespa.               North Macedonia is a ": null
    },
    {
        "landlocked country": "landlocked country"
    },
    {
        " that is geographically clearly defined by a central valley formed by the Vardar river and framed along its borders by mountain ranges. The terrain is mostly rugged, located between the ": null
    },
    {
        "Šar Mountains": "šar mountains"
    },
    {
        " and ": null
    },
    {
        "Osogovo": "osogovo"
    },
    {
        ", which frame the valley of the ": null
    },
    {
        "Vardar": "vardar"
    },
    {
        " river. Three large lakes  — Lake Ohrid, Lake Prespa and Dojran Lake  — lie on the southern borders, bisected by the frontiers with Albania and Greece. Ohrid is considered to be one of the oldest lakes and biotopes in the world.  The region is seismically active and has been the site of destructive earthquakes in the past, most recently in 1963 when Skopje was heavily damaged by a major earthquake, killing over 1,000.     North Macedonia also has scenic mountains. They belong to two different ": null
    },
    {
        "mountain range": "mountain range"
    },
    {
        "s: the first is the ": null
    },
    {
        "Šar Mountains": "šar mountains"
    },
    {
        "   that continues to the West Vardar/Pelagonia group of mountains , also known as the ": null
    },
    {
        "Dinaric range": "dinaric alps"
    },
    {
        ". The second range is the ": null
    },
    {
        "Osogovo": "osogovo"
    },
    {
        "–": null
    },
    {
        "Belasica": "belasica"
    },
    {
        " mountain chain, also known as the ": null
    },
    {
        "Rhodope range": "rhodope mountains"
    },
    {
        ". The mountains belonging to the Šar Mountains and the West Vardar/Pelagonia range are younger and higher than the older mountains that are part of the Osogovo-Belasica mountain group. The ten highest mountains in North Macedonia are:               In North Macedonia there are 1,100 large sources of water. The rivers flow into three different basins: the Aegean, the ": null
    },
    {
        "Adriatic": "adriatic sea"
    },
    {
        " and that Black Sea basin.      The Aegean basin is the largest. It covers 87% of the countrys territory, which is 22,075  km 2 . ": null
    },
    {
        "Vardar": "vardar"
    },
    {
        ", the largest river in this basin, drains 80% of the territory or 20,459  km 2 . Its valley plays an important part in the economy and the communication system of the country. The project named The Vardar Valley is considered to be crucial for the strategic development of the country.     The river ": null
    },
    {
        "Black Drim": "black drim"
    },
    {
        " forms the Adriatic basin, which covers an area of about 3,320  km², i. e. 13% of the territory. It issues from Lakes Prespa and Ohrid.     The Black Sea basin is the smallest with only 37  km² It covers the northern side of Mount ": null
    },
    {
        "Skopska Crna Gora": "skopska crna gora"
    },
    {
        ". Here is the source of the river ": null
    },
    {
        "Binačka Morava": "binačka morava"
    },
    {
        " which joins the ": null
    },
    {
        "South Morava": "south morava"
    },
    {
        " and later the ": null
    },
    {
        "Danube": "danube"
    },
    {
        ", which eventually flows into the Black Sea.     Despite being a landlocked country, North Macedonia has three large lakes , three artificial lakes and roughly 50 ponds.     There are nine spa resorts in North Macedonia: Banište, Banja Bansko, Istibanja, Katlanovo, ": null
    },
    {
        "Kežovica": "kežovica"
    },
    {
        ", Kosovrasti, Banja Kočani, Kumanovski Banji and Negorci.               The Vardar is the longest and most important river in North Macedonia. It is  long, and drains an area of around .     The river rises at Vrutok, a few kilometers north of ": null
    },
    {
        "Gostivar": "gostivar"
    },
    {
        " in the Republic of North Macedonia. It passes through Gostivar, Skopje and into Veles, crosses the Greek border near ": null
    },
    {
        "Gevgelija": "gevgelija"
    },
    {
        ", ": null
    },
    {
        "Polykastro": "polykastro"
    },
    {
        " and ": null
    },
    {
        "Axioupoli": "axioupoli"
    },
    {
        ", before emptying into the Aegean Sea in ": null
    },
    {
        "Central Macedonia": "central macedonia"
    },
    {
        " west of ": null
    },
    {
        "Thessaloniki": "thessaloniki"
    },
    {
        " in northern Greece.     The Vardar basin includes two-thirds of the territory of the Republic of North Macedonia. For that the area is called Vardar Macedonia after the river, to distinguish it from Aegean Macedonia and ": null
    },
    {
        "Pirin Macedonia": "pirin macedonia"
    },
    {
        " .     The valley comprises fertile lands in ": null
    },
    {
        "Polog": "polog"
    },
    {
        ", Gevgelija and other parts. The river is surrounded by mountains elsewhere. The M1 / E75, connecting with ": null
    },
    {
        "Greek National Road 1": "greek national road 1"
    },
    {
        ", runs through the valley along the rivers entire length to near Skopje.     The river is depicted on the coat of arms of Skopje, which in turn is incorporated in the citys flag. Official portal of the city of Skopje: . – Retrieved on 13 May 2009.               Lake Ohrid straddles the mountainous border between southwestern North Macedonia and eastern Albania. Lake Ohrid is the deepest lake of the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ", with a maximum depth of 288  m and a mean depth of 155  m . It covers an area of , containing an estimated 55.4  km³ of water. It is 30.4  km long by 14.8  km wide at its maximum extent with a shoreline length of 87.53  km, shared between North Macedonia and Albania . The lake drains an area of around 2600  km² and is fed primarily by underground springs on the eastern shore , with roughly 25% shares from rivers and direct precipitation. Over 20% of the lakes water comes from nearby Lake Prespa, about  to the southeast and at 150 m higher altitude than Lake Ohrid.        Similar to ": null
    },
    {
        "Lake Baikal": "lake baikal"
    },
    {
        " and ": null
    },
    {
        "Lake Tanganyika": "lake tanganyika"
    },
    {
        ", Lake Ohrid harbors endemic species covering the whole food-chain, from ": null
    },
    {
        "phytoplankton": "phytoplankton"
    },
    {
        " and ": null
    },
    {
        "sestile algae": "sestile algae"
    },
    {
        " , over plant species , zooplankton , ": null
    },
    {
        "cyprinid": "cyprinid"
    },
    {
        " fish , to predatory fish  and finally its diverse endemic bottom fauna , with particularly large endemism among ": null
    },
    {
        "crustacean": "crustacean"
    },
    {
        "s, ": null
    },
    {
        "mollusc": "mollusc"
    },
    {
        "s, sponges and ": null
    },
    {
        "planarian": "planarian"
    },
    {
        "s.     There are three cities on the lakes shores: ": null
    },
    {
        "Ohrid": "ohrid"
    },
    {
        " and ": null
    },
    {
        "Struga": "struga"
    },
    {
        " on North Macedonias side; ": null
    },
    {
        "Pogradec": "pogradec"
    },
    {
        " in Albania. There are also several fishing villages, although tourism is now a more significant part of their income. The catchment area of the lake has a population of around 170,000 people, with 131,000 people living directly at the lake shore .               The Great Prespa Lake is divided between Albania, Greece and North Macedonia. The biggest island in the Great Prespa Lake, on North Macedonias side, is called  Golem Grad  , or Snake Island . The other island Mal Grad is the site of a ruined 14th century monastery dedicated to ": null
    },
    {
        "St. Peter": "st. peter"
    },
    {
        ". Today, both islands are uninhabited. .     Because Great Prespa Lake sits about 150m above Lake Ohrid, which lies only about  to the west, its waters run through underground channels in the ": null
    },
    {
        "karst": "karst"
    },
    {
        " and emerge from springs which feed streams running into Lake Ohrid.            Dojran Lake, located in southeastern North Macedonia, is the smallest of the three major lakes with an area of 42.7  km². It is shared between North Macedonia and Greece .  The town of ": null
    },
    {
        "Dojran": "dojran"
    },
    {
        " is situated on the west coast of the lake, while the Greek village of ": null
    },
    {
        "Mouries": "mouries"
    },
    {
        " lies to the east. To the north is the mountain ": null
    },
    {
        "Belasica": "belasica"
    },
    {
        " and to the south is the Greek town of ": null
    },
    {
        "Doirani": "doirani"
    },
    {
        ". The lake is round in shape, has a maximum depth of 10 metres, has a north-to-south length of 8.9  km, and is 7.1  km at its widest.           The flora of North Macedonia is represented with around 210 ": null
    },
    {
        "families": "family"
    },
    {
        ", 920 ": null
    },
    {
        "genera": "genus"
    },
    {
        ", and around 3,700 plant ": null
    },
    {
        "species": "species"
    },
    {
        ". The most abundant group are the ": null
    },
    {
        "flowering plants": "flowering plant"
    },
    {
        "with around 3,200 species, which is followed by mosses and ": null
    },
    {
        "ferns": "fern"
    },
    {
        ".     ": null
    },
    {
        "Phytogeographically": "phytogeography"
    },
    {
        ", North Macedonia belongs to the Illyrian province of the ": null
    },
    {
        "Circumboreal Region": "circumboreal region"
    },
    {
        " within the ": null
    },
    {
        "Boreal Kingdom": "boreal kingdom"
    },
    {
        ". According to the ": null
    },
    {
        "WWF": "world wide fund for nature"
    },
    {
        " and Digital Map of European Ecological Regions by the ": null
    },
    {
        "European Environment Agency": "european environment agency"
    },
    {
        ", the territory of the Republic can be subdivided into four ": null
    },
    {
        "ecoregion": "ecoregion"
    },
    {
        "s: the ": null
    },
    {
        "Pindus Mountains": "pindus mountains"
    },
    {
        " mixed forests": "mixed forests"
    },
    {
        ", ": null
    },
    {
        "Balkan": "balkan"
    },
    {
        " mixed forests": "mixed forests"
    },
    {
        ", ": null
    },
    {
        "Rhodopes": "rhodopes"
    },
    {
        " mixed forests": "mixed forests"
    },
    {
        " and ": null
    },
    {
        "Aegean": "aegean sea"
    },
    {
        " sclerophyllous": "sclerophyllous"
    },
    {
        " and ": null
    },
    {
        "mixed forests": "mixed forests"
    },
    {
        ".     The fauna of the Macedonian forests is abundant and includes bears, ": null
    },
    {
        "wild boar": "wild boar"
    },
    {
        "s, ": null
    },
    {
        "wolves": "wolf"
    },
    {
        ", foxes, ": null
    },
    {
        "squirrel": "squirrel"
    },
    {
        "s, ": null
    },
    {
        "chamois": "chamois"
    },
    {
        " and ": null
    },
    {
        "deer": "deer"
    },
    {
        ". The ": null
    },
    {
        "lynx": "eurasian lynx"
    },
    {
        " is found, although very rarely, in the mountains of western North Macedonia, while deer can be found in the region of ": null
    },
    {
        "Demir Kapija": "demir kapija"
    },
    {
        ". Forest birds include the ": null
    },
    {
        "blackcap": "blackcap"
    },
    {
        ", the ": null
    },
    {
        "grouse": "grouse"
    },
    {
        ", the ": null
    },
    {
        "black grouse": "black grouse"
    },
    {
        ", the ": null
    },
    {
        "imperial eagle": "eastern imperial eagle"
    },
    {
        " and the forest owl.     The three artificial lakes of the country represent a separate fauna zone, an indication of long-lasting territorial and temporal isolation. The fauna of Lake Ohrid is a relict of an earlier era and the lake is widely known for its letnica trout, ": null
    },
    {
        "lake whitefish": "lake whitefish"
    },
    {
        ", ": null
    },
    {
        "gudgeon": "gudgeon"
    },
    {
        ", ": null
    },
    {
        "roach": "rutilus"
    },
    {
        ", podust, and pior, as well as for certain species of snails of a genus older than 30  million years; similar species can only be found in ": null
    },
    {
        "Lake Baikal": "lake baikal"
    },
    {
        ". Lake Ohrid is also noted in zoology texts for the ": null
    },
    {
        "European eel": "european eel"
    },
    {
        " and its baffling reproductive cycle: it comes to Lake Ohrid from the ": null
    },
    {
        "Sargasso Sea": "sargasso sea"
    },
    {
        ", located in the Atlantic Ocean, and lurks in the depths of the lake for ten years. When sexually mature, the eel is driven by unexplained instincts in the autumn to return to its point of birth. There it spawns and dies, leaving its offspring to seek out Lake Ohrid to begin the cycle anew.        North Macedonia is rich in low-grade ": null
    },
    {
        "iron": "iron"
    },
    {
        " ore, ": null
    },
    {
        "copper": "copper"
    },
    {
        ", ": null
    },
    {
        "lead": "lead"
    },
    {
        ", ": null
    },
    {
        "zinc": "zinc"
    },
    {
        ", ": null
    },
    {
        "chromite": "chromite"
    },
    {
        ", ": null
    },
    {
        "manganese": "manganese"
    },
    {
        ", ": null
    },
    {
        "nickel": "nickel"
    },
    {
        ", ": null
    },
    {
        "tungsten": "tungsten"
    },
    {
        ", ": null
    },
    {
        "gold": "gold"
    },
    {
        ", ": null
    },
    {
        "silver": "silver"
    },
    {
        ", ": null
    },
    {
        "asbestos": "asbestos"
    },
    {
        ", and ": null
    },
    {
        "gypsum": "gypsum"
    },
    {
        ". Also it is one of possibly two places in the world where the ": null
    },
    {
        "lorandite": "lorandite"
    },
    {
        " mineral is found.       16.1% of the countrys territory is ": null
    },
    {
        "arable land": "arable land"
    },
    {
        ".   1.36% of permanent ": null
    },
    {
        "crops": "crop"
    },
    {
        "  82.54% – other. .     According to 2004 estimates, there are 1278  km 2 of irrigated land, and 6.4  km 3 of total renewable water resources.            In July 2007, fires were particularly visible in Greece, Albania and North Macedonia.     The environment is preserved in areas impractical and sparsely populated. In addition, the country has three major national parks, created under the ": null
    },
    {
        "Yugoslav": "socialist federal republic of yugoslavia"
    },
    {
        " regime of 1948–1958. The parks of Pelister, Mavrovo and Galičica cover an area of  and allow for the protection of natural areas by their exceptional geological setting, their fauna and flora. The ornithological reserve of Ezerani, north of ": null
    },
    {
        "Lake Prespa": "lake prespa"
    },
    {
        ", is 2,000 hectares big and is home to sixty animals protected by the ": null
    },
    {
        "Bern Convention": "convention on the conservation of european wildlife and natural habitats"
    },
    {
        ".     However, if it is protected where man has little access, nature is threatened the outskirts of towns and villages. Indeed, in order to make North Macedonia, formerly rural and poor, a modern and prosperous country, the Yugoslav communist regime established many factories, often highly polluting. These factories, located mainly in the regions of ": null
    },
    {
        "Veles": "veles"
    },
    {
        " and Skopje are still functioning. The emissions of waste pollutants have decreased after 1991, after independence, because many companies have gone bankrupt or have reduced their activity after the transition to a market economy.     The other danger of degradation of nature lies in waste. Indeed, only the city of Skopje has a processing center for household waste in the rest of the country, so they are left in open dumps. The lack of resources and political will behind these fatal neglect for the environment.     North Macedonia is also experiencing serious problems in water management. The country, however should be able to secure its water through its dams and its sources. In summer, water restrictions are common.  The summer period is also marked by the devastation of forests by wildfire.   In 2008, six million trees were planted in North Macedonia to regenerate damaged forests.      The environmental degradation nevertheless mobilizes local groups and North Macedonia is a signatory to international treaties like the ": null
    },
    {
        "Kyoto Protocol": "kyoto protocol"
    },
    {
        ".        The three national parks :    The Republic of North Macedonia consists primarily of rural country towns, with only 45% of the population concentrated in the larger towns and cities. Skopje, with more than 500,000 inhabitants, is by far the largest city in the country. The surrounding region, one of the few plains of the country, includes several other cities, like ": null
    },
    {
        "Tetovo": "tetovo"
    },
    {
        " and ": null
    },
    {
        "Gostivar": "gostivar"
    },
    {
        ". ": null
    },
    {
        "Bitola": "bitola"
    },
    {
        ", ": null
    },
    {
        "Prilep": "prilep"
    },
    {
        " and other significant cities, are located in the plain of Pelagonia in the south. The rest of the population is concentrated in the valley of the Vardar and the few other basins and plains of the country.     ": null
    },
    {
        "Urbanization": "urbanization"
    },
    {
        ", which is developing very fast since the communist era of Yugoslavia, has led to uncontrolled and illegal constructions. Other cities have not grown as fast as the capital, which has gained more than 300,000 inhabitants between 1948 and 1981. Bitola, Prilep and ": null
    },
    {
        "Kumanovo": "kumanovo"
    },
    {
        ", the three other major cities, did not exceed 30,000 inhabitants in 1948 and have barely reached 100,000 people since. Kumanovo, which is the second largest city of North Macedonia, had only 105,000 inhabitants in 2002, which is substantial difference comparing it with the population of the capital Skopje – 506,000 inhabitants. This makes Skopje a ": null
    },
    {
        "primate city": "primate city"
    },
    {
        ".     Population of the most populous municipalities  Georges Castellan, op. cit., p. 78     TimeAxis orientation:horizontal format:yyyy   ImageSize width:640 height:auto barincrement:25   PlotArea left:10 right:10 top:10 bottom:40   AlignBars justify     Colors   id:canvas value:rgb     BackgroundColors canvas:canvas     Period from:0 till:600   ScaleMajor unit:year increment:100 start:0 gridcolor:drabgreen     BarData   barset:Einwohnerzahl     PlotData   width:20 fontsize:M textcolor:black color:skyblue shift: anchor:from     barset:Einwohnerzahl     from:start till:506.9 text:": null
    },
    {
        "Skopje": "skopje"
    },
    {
        "_   from:start till:105.5 text:": null
    },
    {
        "Kumanovo": "kumanovo"
    },
    {
        "_   from:start till:95.4 text:": null
    },
    {
        "Bitola": "bitola"
    },
    {
        "_   from:start till:86.5 text:": null
    },
    {
        "Tetovo": "tetovo"
    },
    {
        "_   from:start till:81.0 text:": null
    },
    {
        "Gostivar": "gostivar"
    },
    {
        "_   from:start till:76.7 text:": null
    },
    {
        "Prilep": "prilep"
    },
    {
        "_   from:start till:63.3 text:": null
    },
    {
        "Struga": "struga"
    },
    {
        "_   from:start till:55.7 text:": null
    },
    {
        "Ohrid": "ohrid"
    },
    {
        "_   from:start till:55.1 text:": null
    },
    {
        "Veles": "vélès"
    },
    {
        "_   from:start till:54.6 text:": null
    },
    {
        "Strumica": "strumica"
    },
    {
        "_     TextData   fontsize:S pos:   text:Population              The ": null
    },
    {
        "Macedonians": "macedonians"
    },
    {
        " are the largest ethnic group in the country, accounting for 64.2% of the total population, according to the 2002 census. They speak the ": null
    },
    {
        "Macedonian language": "macedonian language"
    },
    {
        " and most are ": null
    },
    {
        "Orthodox Christians": "orthodox church"
    },
    {
        ". ": null
    },
    {
        "Ethnic Albanians": "albanians in the republic of macedonia"
    },
    {
        " are the countrys largest minority, making up one-quarter of the total population. They live mainly in the west and northwest. The ": null
    },
    {
        "Turks": "turks in north macedonia"
    },
    {
        ", who comprise nearly 4% of the population, are mostly scattered, though they form a majority in two municipalities . The ": null
    },
    {
        "Romani": "romani people"
    },
    {
        " make up 2.7% of the population and are also concentrated throughout North Macedonia, while the ": null
    },
    {
        "Serbs": "serbs in the republic of macedonia"
    },
    {
        ", who form just under 2% of the total population, live mostly in the north of the country.               North Macedonia is divided into eight statistical regions: ": null
    },
    {
        "Skopje": "skopje statistical region"
    },
    {
        ", ": null
    },
    {
        "Pelagonia": "pelagonia statistical region"
    },
    {
        ", ": null
    },
    {
        "Polog": "polog statistical region"
    },
    {
        ", ": null
    },
    {
        "Vardar": "vardar statistical region"
    },
    {
        ", ": null
    },
    {
        "Eastern": "eastern statistical region"
    },
    {
        ", ": null
    },
    {
        "Southeastern": "southeastern statistical region"
    },
    {
        ", ": null
    },
    {
        "Northeastern": "northeastern statistical region"
    },
    {
        " and ": null
    },
    {
        "Southwestern": "southwestern statistical region"
    },
    {
        ".      The country is further divided into 84 municipalities. Until 1996, there were 123 municipalities, but several laws aimed at increasing the rights of minorities decreased the number of municipalities and modified their overall role. Skopje, the nations capital, is itself divided into ten municipalities.        North Macedonia, like most countries in Eastern Europe, has a developing economy.  Under Yugoslavia, North Macedonia saw the establishment of many factories and the significant modernisation of the country, especially after the devastating ": null
    },
    {
        "Skopje earthquake of 1963": "1963 skopje earthquake"
    },
    {
        ". Since independence in 1991, it has suffered the transition to market economy.  Greece, which believed that the republic was monopolising the cultural and historical heritage of Macedonia, imposed a temporary embargo in 1993 and had prevented the countrys accession to organisations like the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " and ": null
    },
    {
        "NATO": "nato"
    },
    {
        ", until the implementation of the ": null
    },
    {
        "Prespa agreement": "prespa agreement"
    },
    {
        " in 2019.      In 1995, the Greek embargo was lifted and Macedonia was able to access the IMF and World Bank. The country still suffers, however, from its isolation and lack of foreign investment, to which Greece is one of the largest contributors. In 2007, the unemployment rate was estimated at 32% and the ": null
    },
    {
        "black market": "black market"
    },
    {
        " provided about 20% of the Gross Domestic Product.       North Macedonias geographical positioning provides it with many advantages. One advantage is the geographical position of the country. It is the center of the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ", between ": null
    },
    {
        "Belgrade": "belgrade"
    },
    {
        " and ": null
    },
    {
        "Athens": "athens"
    },
    {
        ", ": null
    },
    {
        "Tirana": "tirana"
    },
    {
        " and ": null
    },
    {
        "Sofia": "sofia"
    },
    {
        ", between the ": null
    },
    {
        "Adriatic": "adriatic"
    },
    {
        " and Black Sea. The Vardar valley forms a natural corridor, which connects Greece to the rest of Europe. This corridor is crossed by the highway E75, which crosses in Europe and connects Scandinavia with ": null
    },
    {
        "Attica": "attica"
    },
    {
        ". This highway has also been renovated in North Macedonia with the ": null
    },
    {
        "European Agency for Reconstruction": "european agency for reconstruction"
    },
    {
        ", and the communication channels that connect the Adriatic to the Black Sea, called the Corridor VIII, were also upgraded and maintained through international assistance including the ": null
    },
    {
        "Italia": "italia"
    },
    {
        "n one.      North Macedonia is also rich with minerals. The country in fact has substantial deposits of ": null
    },
    {
        "chromium": "chromium"
    },
    {
        " and other nonferrous metals like ": null
    },
    {
        "copper": "copper"
    },
    {
        ", ": null
    },
    {
        "zinc": "zinc"
    },
    {
        ", ": null
    },
    {
        "manganese": "manganese"
    },
    {
        " and ": null
    },
    {
        "nickel": "nickel"
    },
    {
        ". The country also has gypsum mines, ": null
    },
    {
        "marble": "marble"
    },
    {
        " and ": null
    },
    {
        "granite": "granite"
    },
    {
        ", located in Pelagonia. ": null
    },
    {
        "Lignite": "lignite"
    },
    {
        ", provides 80% of the Macedonian electricity. In addition to mines and quarries, the country has large cement plants and large complexes of metal, created by the communist regime.     ": null
    },
    {
        "Agriculture": "agriculture"
    },
    {
        " is encouraged by the significant water resources, managed by dams and canals. The presence of hot springs of volcanic origin can heat the greenhouses in winter, particularly in the ": null
    },
    {
        "Strumica": "strumica"
    },
    {
        " region, whose products include ": null
    },
    {
        "tomato": "tomato"
    },
    {
        "es and ": null
    },
    {
        "cucumbers": "cucumber"
    },
    {
        "in the month of February. Different climates provide opportunities for various productions in the geographical area, so the ": null
    },
    {
        "vine": "vine"
    },
    {
        " and ": null
    },
    {
        "tobacco": "tobacco"
    },
    {
        " are operated in the south, the ": null
    },
    {
        "rice": "rice"
    },
    {
        " in the region of ": null
    },
    {
        "Kočani": "kočani"
    },
    {
        " which is largely irrigated, and the wood industry is concentrated around ": null
    },
    {
        "Štip": "štip"
    },
    {
        ". Dominique Auzias and Jean-Paul Labourdette, cit., p. 182 Agriculture contributes a significant share of exports, especially with the wine and tobacco. The low cost of labor also helps the textile industry.        North Macedonia receives about 1,000,000 tourists annually  and experiences a constant increase of visitors. The number of domestic tourists in the period from January to March 2008 compared to the same period of the previous year, increased 23.5%. While the number of foreign tourists in March 2008 compared to March 2007 increased 44.7%.  In 2007, Lake Ohrid had received about 250,000 domestic and foreign tourists.  In February 2009, nearly 28,000 tourists, or 3.2% more than the same month last year, visited North Macedonia. There was also an 8% increase in the number of foreign visitors to the country.  The summer of 2009 was the city of ": null
    },
    {
        "Dojrans": "dojran"
    },
    {
        "best tourist season with 135,000 overnight visitors, an increase of 12.5% compared to the previous year.      The tourist capital of North Macedonia, Ohrid,  has been listed as an UNESCO ": null
    },
    {
        "World Heritage Site": "world heritage site"
    },
    {
        " since 1979. ": null
    }
]