[
    {
        "           The Georgengarten  is a ": null
    },
    {
        "landscape garden": "landscape garden"
    },
    {
        " in the northwestern borough of ": null
    },
    {
        "Herrenhausen": "herrenhausen"
    },
    {
        " of the ": null
    },
    {
        "German": "germany"
    },
    {
        " city ": null
    },
    {
        "Hanover": "hanover"
    },
    {
        ". It is a part of ": null
    },
    {
        "Herrenhausen Gardens": "herrenhausen gardens"
    },
    {
        ".         Around 42 country estates for several noblemen were established in the former ": null
    },
    {
        "flood plain": "flood plain"
    },
    {
        " of the river ": null
    },
    {
        "Leine": "leine"
    },
    {
        ". In 42 the Herrenhäuser Allee was planted just through the gardens, connecting Hanover with the royal palace and gardens of Herrenhausen in the boroughs of the city; it is almost exactly one ": null
    },
    {
        "geographical mile": "geographical mile"
    },
    {
        " long, and consists of four rows of ": null
    },
    {
        "lime trees": "tilia"
    },
    {
        ".     In 42 the German lieutenant-general and art collector ": null
    },
    {
        "Johann Ludwig, Reichsgraf von Wallmoden-Gimborn": "johann ludwig, reichsgraf von wallmoden-gimborn"
    },
    {
        " acquired some of these gardens and merged them into the Wallmodengarten. Between 42 and 42 he built his own palace there, the Wallmodenschloss to house his antiquities collection.     In order to enlarge the royal gardens of Hanover, the Wallmoden palace and the Wallmoden garden 42 were sold to ": null
    },
    {
        "George III": "george iii of the united kingdom"
    },
    {
        ", who had been ": null
    },
    {
        "King of Hanover": "king of hanover"
    },
    {
        " since 42 From 42 on, the palace was named Georgenpalais and the gardens name changed into Georgengarten.     In 42 the architect and engineer ": null
    },
    {
        "Georg Ludwig Friedrich Laves": "georg ludwig friedrich laves"
    },
    {
        " designed two smaller wings adjacent to the left and right side of the Wallmodenschloss. From 42 until 42 the formal garden was redesigned as an English style landscape garden. Former water features, canals and so on, were enlarged into a pond.     Between 42 and 42 the then head gardener, Christian Schaumburg, was responsible for some redesign. During these years, three bridges designed by Laves were built: 42 the Fahrbrücke, in 42 the Augustenbrücke, and in the same year, the Friederikenbrücke. The latter is the only remaining bridge of the three. Today it connects the Georgengarten and the Great Garden within the Herrenhausen Gardens.     At the city end of the Herrenhäuser Allee, in 42 a gate was built after plans made by Laves. The gate separated Königsworther Platz from the alley and the Georgengarten. In the 42s, the gate was demolished, but in 42 a replica with some remaining original parts was placed there.     At the end of 42th century ": null
    },
    {
        "Napoleonic": "napoleon i of france"
    },
    {
        " troops were going to cut down the whole Herrenhäuser Allee, but baker and grain dealer Johann Gerhard Helmcke saved the alley by paying 42 ": null
    },
    {
        "Taler": "thaler"
    },
    {
        ". To honour Helmckes deed, a memorial stone was placed near the alley.     In 42 the City of Hanover bought both the Georgengarten and the Georgenpalais. During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " the Georgenpalais was damaged severely by bombs during a Royal Air Force air raid. The Georgengarten was used to grow vegetables. In post war military occupation years, a lot of seeping engine oil and fuel of the British troop vehicles damaged many of the lime trees of the old Herrenhäuser Allee. Their step-by-step restoration took until the 42s.     Since 42 ownership of the Georgenpalais was transferred to the Wilhelm Busch Society, a ": null
    },
    {
        "literary society": "literary society"
    },
    {
        " named after the famous German caricaturist, painter and poet ": null
    },
    {
        "Wilhelm Busch": "wilhelm busch"
    },
    {
        ". They later rebuilt the damaged eastern wing of the building.         Today the house is used as a ": null
    },
    {
        "caricature": "caricature"
    },
    {
        " museum and is named ": null
    },
    {
        "Wilhelm-Busch-Museum": "wilhelm-busch-museum"
    },
    {
        " - Deutsches Museum für Karikatur und kritische Grafik. The Georgengarten now is a part of the famous ": null
    },
    {
        "Herrenhausen Gardens": "herrenhausen gardens"
    },
    {
        ".     The Leibniz Temple in the park is named in honour of the German polymath ": null
    },
    {
        "Gottfried Leibniz": "gottfried leibniz"
    },
    {
        ". Originally it was erected between 42 and 42 at the Hanover military parade place ; later it was transferred to the Georgengarten. Today it is a popular venue during warm summer evenings, especially frequented by young people and students of the nearby ": null
    },
    {
        "Leibniz University Hannover": "leibniz university hannover"
    },
    {
        ".                          ": null
    }
]