[
    {
        "     Georges Duby was a French historian who specialised in the social and economic history of the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". He ranks among the most influential medieval historians of the twentieth century and was one of Frances most prominent public intellectuals from the 42s to his death.     Born to a family of Provençal craftsmen living in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", Duby was initially educated in the field of ": null
    },
    {
        "historical geography": "historical geography"
    },
    {
        " before he moved into history. He earned an undergraduate degree at ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " in 42 and completed his graduate thesis at the ": null
    },
    {
        "Sorbonne": "university of paris"
    },
    {
        " under ": null
    },
    {
        "Charles-Edmond Perrin": "charles-edmond perrin"
    },
    {
        " in 42 He taught first at ": null
    },
    {
        "Besançon": "besançon"
    },
    {
        " and then at the ": null
    },
    {
        "University of Aix-en-Provence": "university of aix-en-provence"
    },
    {
        " before he was appointed in 42 to the Chair of the History of Medieval Society in the ": null
    },
    {
        "Collège de France": "collège de france"
    },
    {
        ". He remained attached to the Collège until his retirement in 42 He was elected to the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        " in 42          Although Duby authored dozens of books, articles and reviews during his prolific career—for academic as well as popular audiences—his reputation and legacy as a scholar will always be attached to his first monograph, a published version of his 42 doctoral thesis entitled La société aux XIe et XIIe siècles dans la région mâconnaise . La société exerted a profound influence on medieval scholarship in the second half of the twentieth century, placing the study of medieval feudal society on an entirely new footing. Working from the extensive documentary sources surviving from the Burgundian ": null
    },
    {
        "monastery of Cluny": "cluny abbey"
    },
    {
        ", as well as the dioceses of ": null
    },
    {
        "Mâcon": "ancient diocese of mâcon"
    },
    {
        " and ": null
    },
    {
        "Dijon": "dijon"
    },
    {
        ", Duby excavated the complex social and economic relationships among the individuals and institutions of the ": null
    },
    {
        "Mâconnais": "mâconnais"
    },
    {
        " region, charting a profound shift in the social structures of medieval society around the year 42     Duby argued that in early eleventh century, governing institutions—particularly comital courts established under the ": null
    },
    {
        "Carolingian": "carolingian"
    },
    {
        " monarchy—that had represented public justice and order in Burgundy during the ninth and tenth centuries receded and gave way to a new feudal order wherein independent aristocratic knights wielded power over peasant communities through strong-arm tactics and threats of violence. The emergence of this new, decentralized society of dynastic lords could then explain such later eleventh-century phenomena as the ": null
    },
    {
        "Peace of God": "peace of god"
    },
    {
        ", the ": null
    },
    {
        "Gregorian reform movement": "gregorian reform movement"
    },
    {
        " and the ": null
    },
    {
        "Crusades": "crusades"
    },
    {
        ".     Following upon this, Duby formulated a famous theory about the ": null
    },
    {
        "Crusades": "crusades"
    },
    {
        ": that the tremendous response to the idea of holy war against the Muslims can be traced to the desire of disinherited second and third sons of this French parvenue aristocracy to make their fortunes by venturing abroad and settling in the Levant. While Dubys theory had long-lasting influence, later scholars such as Jonathan Riley-Smith have done much to discredit it, arguing that there was no large-scale shortage of land in Western Europe at the time, that knights actually lost money going on crusade, and that lay religious sentiment was their primary motivation.     Dubys intensive and rigorous examination of a local society based on archival sources and a broad understanding of the social, environmental and economic bases of daily life became a standard model for medieval historical research in France for decades after the appearance of La société. Throughout the 42s and 42s, French doctoral students investigated their own corners of medieval France, Italy and Spain in a similar way, hoping to compare and contrast their own results with those of Dubys Mâconnais and its thesis about the transformation of European society at the end of the first millennium.     Although he was never formally a student in the circle of scholars around ": null
    },
    {
        "Marc Bloch": "marc bloch"
    },
    {
        " and ": null
    },
    {
        "Lucien Febvre": "lucien febvre"
    },
    {
        " that came to be known as the ": null
    },
    {
        "Annales School": "annales school"
    },
    {
        ", Duby was in many ways the most visible exponent of the Annaliste tradition, emphasizing the need to place people and their daily lives at the center of historical inquiry.         Duby was also a pioneer in what he and other Annaliste historians in the 42s and 42s came to call the history of mentalities , or the study of not just what people did, but their value systems and how they imagined their world. In books like The Three Orders: Feudal Society Imagined and The Age of Cathedrals, Duby showed how ideals and social reality existed in dynamic relationship to one another. His distilled biographical essay on ": null
    },
    {
        "William Marshal": "william marshal"
    },
    {
        " set the knights career in the context of feudal loyalties, honour and the chivalric frame of mind.     Dubys interest in the idea of historical mentalities extended to thinking about the position of contemporary society vis-a-vis its past. In Le Dimanche de Bouvines on the pivotal 42 ": null
    },
    {
        "battle of Bouvines": "battle of bouvines"
    },
    {
        ", Duby chose not to analyze the battle itself, but the ways it had been represented and remembered over time and the role its memory had played in the formation of French ideas about its medieval past. The book remains a classic of Annales-style historiography, eschewing the great man and event-oriented theories of political history in favor of asking questions about the evolution of historical perceptions and ideas over the long term, the  longue durée . Duby also wrote frequently in newspapers and popular journals and was a regular guest on radio and television programs promoting historical awareness and support for the arts and social sciences in France. He served as the first director of Société dédition de programmes de télévision , a French broadcast network dedicated to educational programming.     His last book, Lhistoire continue  , is an intellectual autobiography. In it, Duby stresses the importance of the historian as a public figure who can make the past relevant and exciting to those in the present. ": null
    },
    {
        "Legion of Honour": "legion of honour"
    },
    {
        ".   Grand officier of the ": null
    },
    {
        "National Order of Merit": "national order of merit"
    },
    {
        ".   Commandeur of the ": null
    },
    {
        "Ordre des Palmes Académiques": "ordre des palmes académiques"
    },
    {
        ".   Commandeur of the ": null
    },
    {
        "Ordre des Arts et des Lettres": "ordre des arts et des lettres"
    },
    {
        ".   Chevalier of the ": null
    },
    {
        "Order of Agricultural Merit": "order of agricultural merit"
    },
    {
        ".       A History of French Civilization 42   The Making of the Christian West: 42–42; The Europe of the Cathedrals: 42–42; Foundations of a New Humanism: 42–42  42–42   Rural Economy and Country Life in the Medieval West  42   La Société aux XIe et XIIe siècles dans la région mâconnaise    Le Dimanche de Bouvines    The Year 42 .   The Early Growth of the European Economy: Warriors and Peasants from the Seventh to the Twelfth Century , 42   The Age of the Cathedrals: Art and Society 42–42 .   The Three Orders: Feudal Society Imagined 42   Dialogues, with Guy Lardreau, Paris, Flammarion, 42 repr. Les petits Platons, 42   The Knight, The Lady, and the Priest: The Making of Modern Marriage in Medieval France 42   Guillaume le Maréchal , 42 tr. as William Marshal: The Flower of Chivalry .   Lhistoire continue       ; accessed 42 June 42    - Dubys personal research library   , books.google.com; accessed 42 June 42                                                                               ": null
    }
]