[
    {
        "               Georg Philipp Telemann   was a German ": null
    },
    {
        "Baroque": "baroque music"
    },
    {
        " composer": "composer"
    },
    {
        " and ": null
    },
    {
        "multi-instrumentalist": "multi-instrumentalist"
    },
    {
        ". Almost completely ": null
    },
    {
        "self-taught": "self-taught"
    },
    {
        " in music, he became a composer against his familys wishes. After studying in ": null
    },
    {
        "Magdeburg": "magdeburg"
    },
    {
        ", ": null
    },
    {
        "Zellerfeld": "zellerfeld"
    },
    {
        ", and ": null
    },
    {
        "Hildesheim": "hildesheim"
    },
    {
        ", Telemann entered the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        " to study law, but eventually settled on a career in music. He held important positions in ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ", ": null
    },
    {
        "Sorau": "żary"
    },
    {
        ", ": null
    },
    {
        "Eisenach": "eisenach"
    },
    {
        ", and ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        " before settling in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " in 1721, where he became musical director of that citys five main churches. While Telemanns career prospered, his personal life was always troubled: his first wife died only a few months after their marriage, and his second wife had extramarital affairs and accumulated a large gambling debt before leaving him.     Telemann is one of the most prolific composers in history The Guinness Book of World Records 1998, Bantam Books, p. 402. .  See Phillip Huscher,  , Chicago Symphony Orchestra, 2007. and was considered by his contemporaries to be one of the leading German composers of the time—he was compared favorably both to his friend ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        ", who made Telemann the godfather and namesake of his son ": null
    },
    {
        "Carl Philipp Emanuel": "carl philipp emanuel bach"
    },
    {
        ", and to ": null
    },
    {
        "George Frideric Handel": "george frideric handel"
    },
    {
        ", whom Telemann also knew personally. As part of his duties, he wrote a considerable amount of music for educating organists under his direction. This includes 48 chorale preludes and 20 small fugues to accompany his chorale harmonizations for 500 hymns. His music incorporates French, Italian, and German national styles, and he was at times even influenced by Polish popular music. He remained at the forefront of all new musical tendencies, and his music stands as an important link between the late Baroque and early ": null
    },
    {
        "Classical styles": "classical period"
    },
    {
        ". The ": null
    },
    {
        "Telemann Museum": "telemann museum"
    },
    {
        " in Hamburg is dedicated to him.               Telemann was born in ": null
    },
    {
        "Magdeburg": "magdeburg"
    },
    {
        ", then the capital of the ": null
    },
    {
        "Duchy of Magdeburg": "duchy of magdeburg"
    },
    {
        ", ": null
    },
    {
        "Brandenburg-Prussia": "brandenburg-prussia"
    },
    {
        ". His father Heinrich, ": null
    },
    {
        "deacon": "deacon"
    },
    {
        " at the Church of the Holy Spirit , died when Telemann was four. The future composer received his first music lessons at 10, from a local organist, and became immensely interested in music in general, and composition in particular. Despite opposition from his mother and relatives, who forbade any musical activities, Telemann found it possible to study and compose in secret, even creating an opera at age 12. As Telemann claimed in his autobiography provided to and printed by Johann Mattheson in the latter’s „Grundlage einer Ehren-Pforte“ , p. 355: “... Ich eine ertappte hamburger Oper, Sigismundus, etwa im zwölfften Jahr meines Alters, in die Musik seßte, welche auch auf einer errichteten Bühne toll genug abegefungen wurde, und wohen ich selbst meinen Held ziemlich troßig vorstellte.“ set it to music, which was performed well enough on a home-made stage, and where I personally presented my hero pretty defiantly.”     In 1697, after studies at the Domschule in Magdeburg and at a school in ": null
    },
    {
        "Zellerfeld": "zellerfeld"
    },
    {
        ", Telemann was sent to the famous Gymnasium Andreanum at ": null
    },
    {
        "Hildesheim": "hildesheim"
    },
    {
        ", where his musical talent flourished, supported by school authorities, including the rector himself. Telemann was becoming equally adept both at composing and performing, teaching himself flute, oboe, violin, viola da gamba, recorder, double bass, and other instruments. In 1701 he graduated from the Gymnasium and went to Leipzig to become a student at the ": null
    },
    {
        "Leipzig University": "leipzig university"
    },
    {
        ", where he intended to study law. He ended up becoming a professional musician, regularly composing works for ": null
    },
    {
        "Nikolaikirche": "st. nicholas church, leipzig"
    },
    {
        " and even St. Thomas . In 1702 he became director of the municipal opera house Opernhaus auf dem Brühl, and later music director at the Neukirche. Prodigiously productive, Telemann supplied a wealth of new music for Leipzig, including several operas, one of which was his first major opera,  Germanicus . However, he became engaged in a conflict with the cantor of the Thomaskirche, ": null
    },
    {
        "Johann Kuhnau": "johann kuhnau"
    },
    {
        ". The conflict intensified when Telemann started employing numerous students for his projects, including those who were Kuhnaus, from the Thomasschule. Spitta, Phillip, Johann Sebastian Bach translated from the German by Clara Bell and J.A. Fuller-Maitland, Dover 1951 , Vol II, pp. 204–207: The direct connection between opera and sacred music which thus took form in the person of Telemann at once exerted its baleful influence.... Kuhnau represented that the tendencies of the Operists ... were destroying all feeling for true church music...     Spitta, ibid. Appendix B VII : ... Memorials of Kuhnaus, addressed to the Town Council and to the University on ... March 17, 1709... appeals to ... consider certain points... 8 & 9 refer to the numbers of the choir, and 10 complains again of the increasing influence of the opera; this, he says, causes the greatest mischief, for the better students, as soon as they have acquired... sufficient practice, long to find themselves among the Operisten     Telemann left Leipzig in 1705 at the age of 24, after receiving an invitation to become  Kapellmeister  for the court of Count ": null
    },
    {
        "Erdmann II of Promnitz": "erdmann ii of promnitz"
    },
    {
        " at Sorau . His career there was cut short in early 1706 by the hostilities of the ": null
    },
    {
        "Great Northern War": "great northern war"
    },
    {
        ", and after a short period of travels he entered the service of ": null
    },
    {
        "Duke Johann Wilhelm": "john william iii, duke of saxe-eisenach"
    },
    {
        ", in ": null
    },
    {
        "Eisenach": "eisenach"
    },
    {
        " where Johann Sebastian Bach was born. He became Konzertmeister on 24 December 1708 and Secretary and Kapellmeister in August 1709. During his tenure at Eisenach, Telemann wrote a great deal of music: at least four annual cycles of church cantatas, dozens of sonatas and concertos, and other works. In 1709, he married Amalie Louise Juliane Eberlin, lady-in-waiting to the Countess of Promnitz and daughter of the musician ": null
    },
    {
        "Daniel Eberlin": "daniel eberlin"
    },
    {
        ". Their daughter was born in January 1711. The mother died soon afterwards, leaving Telemann depressed and distraught.        After less than a year he sought another position, and moved to ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        " on 18 March 1712 at the age of 31 to become city music director and Kapellmeister at the Barfüßerkirche and ": null
    },
    {
        "St. Catherines Church": "st. catherines church, frankfurt"
    },
    {
        ". In Frankfurt, he fully gained his mature personal style. Here, as in Leipzig, he was a powerful force in the citys musical life, creating music for two major churches, civic ceremonies, and various ensembles and musicians. By 1720 he had adopted the use of the ": null
    },
    {
        "da capo aria": "da capo aria"
    },
    {
        ", which had been adopted by composers such as ": null
    },
    {
        "Domenico Scarlatti": "domenico scarlatti"
    },
    {
        ". Operas such as  Narciso , which was brought to Frankfurt in 1719, written in the Italian idiom of composition, made a mark on Telemanns output.      On 28 August 1714, three years after his first wife had died, Telemann married his second wife, Maria Catharina Textor, daughter of a Frankfurt council clerk. They eventually had nine children together. This was a source of much personal happiness, and helped him produce compositions. Telemann continued to be extraordinarily productive and successful, even augmenting his income by working for Eisenach employers as a  Kapellmeister  von Haus aus, that is, regularly sending new music while not actually living in Eisenach. Telemanns first published works also appeared during the Frankfurt period. His output increased rapidly, for he fervently composed overture-suites and chamber music, most of which is unappreciated. In the latter half of the Frankfurt period, he composed an innovative work, his ": null
    },
    {
        "Viola Concerto": "viola concerto"
    },
    {
        " in G major, which is twice the length of his violin concertos.  Also, here he composed his first choral masterpiece, his  Brockes Passion , in 1716.       The composer, however, was still ambitious and wishing for a better post, so in 1721 he accepted the invitation to work in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " as Kantor of the ": null
    },
    {
        "Johanneum": "gelehrtenschule des johanneums"
    },
    {
        " Lateinschule": "lateinschule"
    },
    {
        ", and music director of the five largest churches. Soon after arrival, Telemann encountered some opposition from church officials who found his secular music and activities to be too much of a distraction for both Telemann himself and the townsfolk. The next year, when ": null
    },
    {
        "Johann Kuhnau": "johann kuhnau"
    },
    {
        " died and the city of Leipzig was looking for a new  Thomaskantor , Telemann applied for the job and was approved, yet declined after Hamburg authorities agreed to give him a suitable raise. After another candidate, ": null
    },
    {
        "Christoph Graupner": "christoph graupner"
    },
    {
        ", declined, the post went to Johann Sebastian Bach.          Telemann took a few small trips outside of Germany at this time. However, later in the Hamburg period he traveled to Paris and stayed for eight months, 1737 into 1738. He heard and was impressed by  Castor et Pollux , an opera by French composer ": null
    },
    {
        "Jean-Philippe Rameau": "jean-philippe rameau"
    },
    {
        ". From then on, he incorporated the French operatic style into his vocal works. Before then, his influence was primarily Italian and German.  Apart from that, Telemann remained in Hamburg for the rest of his life. A vocal masterpiece of this period is his St Luke Passion from 1728, which is a prime example of his fully matured vocal style.     His first years there were plagued by marital troubles: his wifes infidelity, and her gambling debts, which amounted to a sum larger than Telemanns annual income. The composer was saved from bankruptcy by the efforts of his friends, and by the numerous successful music and poetry publications Telemann made during the years 1725 to 1740. By 1736 husband and wife were no longer living together because of their financial disagreements. Although still active and fulfilling the many duties of his job, Telemann became less productive in the 1740s, for he was in his 60s. He took up theoretical studies, as well as hobbies such as gardening and cultivating exotic plants, something of a fad in Hamburg at that time, and a hobby shared by Handel.   Most of the music of the 1750s appears to have been parodied from earlier works. Telemanns eldest son Andreas died in 1755, and Andreas son ": null
    },
    {
        "Georg Michael Telemann": "georg michael telemann"
    },
    {
        " was raised by the aging composer. Troubled by health problems and failing eyesight in his last years, Telemann was still composing into the 1760s. He died on the evening of 25 June 1767 from what was recorded at the time as a chest ailment. He was succeeded at his Hamburg post by his godson, Johann Sebastian Bachs second son ": null
    },
    {
        "Carl Philipp Emmanuel Bach": "carl philipp emmanuel bach"
    },
    {
        ".       Telemann was one of the most prolific major composers of all time:  his all-encompassing oeuvre comprises more than 3,000 compositions, half of which have been lost, and most of which have not been performed since the 18th century. From 1708 to 1750, Telemann composed 1,043 sacred cantatas and 600 overture-suites, and types of concertos for combinations of instruments that no other composer of the time employed. The first accurate estimate of the number of his works was provided by musicologists only during the 1980s and 1990s, when extensive thematic catalogues were published. During his lifetime and the latter half of the 18th century, Telemann was very highly regarded by colleagues and critics alike. Numerous theorists  cited his works as models, and major composers such as J. S. Bach and Handel bought and studied his published works. He was immensely popular not only in Germany but also in the rest of Europe: orders for editions of Telemanns music came from ": null
    },
    {
        "France": "france"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ", ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        "n countries, ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ", and ": null
    },
    {
        "Spain": "spain"
    },
    {
        ". It was only in the early 19th century that his popularity came to a sudden halt. Most lexicographers started dismissing him as a ": null
    },
    {
        "polygraph": "polygraph"
    },
    {
        " who composed too many works, a Vielschreiber for whom quantity came before quality. Such views were influenced by an account of Telemanns music by ": null
    },
    {
        "Christoph Daniel Ebeling": "christoph daniel ebeling"
    },
    {
        ", a late-18th-century critic who in fact praised Telemanns music and made only passing critical remarks of his productivity. After the Bach revival, Telemanns works were judged as inferior to Bachs and lacking in deep religious feeling. Zohn, GroveOnline. For example, by 1911, the  Encyclopædia Britannica  lacked an article about Telemann, and in one of its few mentions of him referred to the vastly inferior work of lesser composers such as Telemann in comparison to Handel and Bach.      Particularly striking examples of such judgements were produced by noted Bach biographers ": null
    },
    {
        "Philipp Spitta": "philipp spitta"
    },
    {
        " and ": null
    },
    {
        "Albert Schweitzer": "albert schweitzer"
    },
    {
        ", who criticized Telemanns cantatas and then praised works they thought were composed by Bach, but which were composed by Telemann. The last performance of a substantial work by Telemann  occurred in 1832, and it was not until the 20th century that his music started being performed again. The revival of interest in Telemann began in the first decades of the 20th century and culminated in the Bärenreiter critical edition of the 1950s. Today each of Telemanns works is usually given a ": null
    },
    {
        "TWV": "twv"
    },
    {
        " number, which stands for Telemann-Werke-Verzeichnis .     Telemanns music was one of the driving forces behind the late Baroque and the early Classical styles. Starting in the 1710s he became one of the creators and foremost exponents of the so-called German mixed style, an amalgam of German, French, Italian and Polish styles. Over the years, his music gradually changed and started incorporating more and more elements of the galant style, but he never completely adopted the ideals of the nascent Classical era: Telemanns style remained contrapuntally and harmonically complex, and already in 1751 he dismissed much contemporary music as too simplistic. Composers he influenced musically included pupils of J.S. Bach in Leipzig, such as ": null
    },
    {
        "Wilhelm Friedemann Bach": "wilhelm friedemann bach"
    },
    {
        ", ": null
    },
    {
        "Carl Philipp Emmanuel Bach": "carl philipp emmanuel bach"
    },
    {
        " and ": null
    },
    {
        "Johann Friedrich Agricola": "johann friedrich agricola"
    },
    {
        ", as well as those composers who performed under his direction in Leipzig , composers of the Berlin lieder school, and finally, his numerous pupils, none of whom, however, became major composers.     Equally important for the history of music were Telemanns publishing activities. By pursuing exclusive publication rights for his works, he set one of the most important early precedents for regarding music as the intellectual property of the composer. The same attitude informed his public concerts, where Telemann would frequently perform music originally composed for ceremonies attended only by a select few members of the upper class.                Georg Philipp Telemanns Passions   Cantata Cycle 1716–1717   Harmonischer Gottes-Dienst  Die Donner-Ode TWV 6:3a-b   Du bleibest dennoch unser Gott   Ihr Völker, hört Ino   Sei tausendmal willkommen   Die Tageszeiten   Gott, man lobet dich, Cantata for the Peace of Paris, 1763, for 5-part chorus, flute, 2 oboes, bassoon, 3 trumpets, 2 horns, strings & continuo, TWV 14:12   not by Telemann: Der Schulmeister , by Christoph Ludwig Fehre .       ": null
    },
    {
        "Hamburger Admiralitätsmusik": "admiralitätsmusik"
    },
    {
        " several years including TWV 24:1   Der Tag des Gerichts   ": null
    },
    {
        "Hamburgische Kapitänsmusik": "kapitänsmusik"
    },
    {
        "   Der Tod Jesu TWV 5:6   Die Auferstehung und Himmelfahrt Jesu  TWV 6:6,   Trauermusik for emperor Karl VII Ich hoffete aufs Licht, TWV 4:13   Trauermusik for Hamburg mayor :nl:Garlieb Sillem Schwanengesang TWV 4:6   Der aus der Löwengrube errettete Daniel   Reformations-Oratorium 1755 Holder Friede, Heilger Glaube TWV 13:18 Concerto: Das Magazin für Alte Musik, Vol. 22, p. 14 2005 Am 24. September erklingt dann in St. Anna erstmals wieder Georg Philipp Telemanns Oratorium »Holder Friede, Heilger Glaube«, das 1755 zum 200. Jubiläum des Augsburger Religionsfriedens entstanden ist.       Grillen-symphonie TWV 50:1   Ouverture  TWV 55:C3   Ouverture des nations anciens et modernes in G TWV 55:G4   Ouverture in G minor TWV 55:g4   Suite in A minor for recorder, strings, and continuo TWV 55:a2   Overture: Alster Echo in F, for 4 horns, 2 oboes, bassoon, strings and continuo, TWV55:F11       Sinfonia Spirituosa in D Major TWV 44:1   Tafelmusik   Der getreue Musikmeister , a musical journal containing 70 small vocal and instrumental compositions   Twelve Paris Quartets in two sets of six  for flute, violin, viola da gamba or cello, continuo, TWV 43:G1, D1, A1, g1, e1, h1 , TWV 43:D3, a2, G4, h2, A3, e4   Twelve Fantasias for Transverse Flute without Bass TWV 40:2–13   Twelve Fantasias for Violin without Bass TWV 40:14–25   Twelve Fantasias for Viola da Gamba solo TWV 40:26–37   Sonates sans basse TWV 40:101–106   ": null
    },
    {
        "Six Canonical Sonatas": "6 canonical sonatas"
    },
    {
        " TWV 40: 118–123   Six Concertos for Flute and Harpsichord TWV 42.       36 Fantasias for Keyboard TWV 33:1-36   6 Overtures for Keyboard TWV 32:5-10   6 Light Fugues with Small Fresh Additions TWV 30:21-26         48 Chorale Preludes for Organ TWV 31:1-48   20 easy fugues in 4 parts TWV 30:1-20TelemannTelemannTelemannfor Melodic instrument - Violin, Flute or Oboe, from Der getreue Musikmeisterfrom Der getreue Musikmeisterpart of the collection Der getreue Musikmeister, 1728": null
    }
]