[
    {
        "                         George Washington  was an American political leader, military general, statesman, and ": null
    },
    {
        "Founding Father": "Founding Fathers Of The United States"
    },
    {
        " who served as the first ": null
    },
    {
        "president of the United States": "President Of The United States"
    },
    {
        " from 1789 to 1797. Previously, he led ": null
    },
    {
        "Patriot": "Patriot"
    },
    {
        " forces to victory in the nations ": null
    },
    {
        "War for Independence": "American Revolutionary War"
    },
    {
        ". He presided at the ": null
    },
    {
        "Constitutional Convention": "Constitutional Convention"
    },
    {
        " of 1787 which established the ": null
    },
    {
        "U.S. Constitution": "Constitution Of The United States"
    },
    {
        "   and a federal government. Washington has been called the ": null
    },
    {
        "Father of His Country": "Father Of The Nation"
    },
    {
        " for his manifold leadership in the formative days of the new nation.     Washington received his initial military training and command with the ": null
    },
    {
        "Virginia Regiment": "Virginia Regiment"
    },
    {
        " during the ": null
    },
    {
        "French and Indian War": "French And Indian War"
    },
    {
        ". He was later elected to the ": null
    },
    {
        "Virginia House of Burgesses": "House Of Burgesses"
    },
    {
        " and was named a delegate to the ": null
    },
    {
        "Continental Congress": "Continental Congress"
    },
    {
        ", where he was appointed ": null
    },
    {
        "Commanding General": "Commanding General Of The United States Army"
    },
    {
        " of the ": null
    },
    {
        "Continental Army": "Continental Army"
    },
    {
        ". He commanded American forces, allied with France, in the defeat and surrender of the British during the ": null
    },
    {
        "Siege of Yorktown": "Siege Of Yorktown"
    },
    {
        ", and resigned his commission in 1783 after the signing of the ": null
    },
    {
        "Treaty of Paris": "Treaty Of Paris"
    },
    {
        ".     Washington played a key role in the adoption and ratification of the ": null
    },
    {
        "Constitution": "United States Constitution"
    },
    {
        " and was then elected president by the ": null
    },
    {
        "Electoral College": "United States Electoral College"
    },
    {
        " in the first two elections. He implemented a strong, well-financed national government while remaining impartial in a fierce rivalry between cabinet members ": null
    },
    {
        "Thomas Jefferson": "Thomas Jefferson"
    },
    {
        " and ": null
    },
    {
        "Alexander Hamilton": "Alexander Hamilton"
    },
    {
        ". During the ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        ", he proclaimed a policy of neutrality while sanctioning the ": null
    },
    {
        "Jay Treaty": "Jay Treaty"
    },
    {
        ". He set enduring precedents for the office of president, including the title President of the United States , and his ": null
    },
    {
        "Farewell Address": "George Washingtons Farewell Address"
    },
    {
        " is widely regarded as a pre-eminent statement on ": null
    },
    {
        "republicanism": "Republicanism"
    },
    {
        ".     ": null
    },
    {
        "Washington owned slaves": "George Washington And Slavery"
    },
    {
        " for labor and trading, and supported measures passed by Congress protecting slavery, in order to preserve national unity. He later became troubled with the institution of ": null
    },
    {
        "slavery": "Slavery In The United States"
    },
    {
        " and freed his slaves in a 1799 will. He endeavored to assimilate ": null
    },
    {
        "Native Americans": "Native Americans In The United States"
    },
    {
        " into Western culture, but responded to their hostility in times of war. He was a member of the Anglican Church and the ": null
    },
    {
        "Freemasons": "Freemasonry"
    },
    {
        ", and he urged broad religious freedom in his roles as general and president. Upon his death, he was eulogized as first in war, first in peace, and first in the hearts of his countrymen. He has been memorialized by monuments, art, geographical locations, stamps, and currency, and many scholars and polls rank him among ": null
    },
    {
        "the greatest American presidents": "Historical Rankings Of Presidents Of The United States"
    },
    {
        ".              The Washington family was a wealthy Virginia family which had made its fortune in ": null
    },
    {
        "land speculation": "Land Speculation"
    },
    {
        ". Harlow Giles Unger, Thomas Paine and the Clarion Call for American Independence, , p. 100-101 Washingtons great-grandfather ": null
    },
    {
        "John Washington": "John Washington"
    },
    {
        " immigrated in 1656 from ": null
    },
    {
        "Sulgrave": "Sulgrave"
    },
    {
        ", England to the British ": null
    },
    {
        "Colony of Virginia": "Colony Of Virginia"
    },
    {
        " where he accumulated  of land, including ": null
    },
    {
        "Little Hunting Creek": "Little Hunting Creek"
    },
    {
        " on the ": null
    },
    {
        "Potomac River": "Potomac River"
    },
    {
        ". George Washington was born February 22, 1732 at ": null
    },
    {
        "Popes Creek": "George Washington Birthplace National Monument"
    },
    {
        " in ": null
    },
    {
        "Westmoreland County, Virginia": "Westmoreland County, Virginia"
    },
    {
        ", and was the first of six children of ": null
    },
    {
        "Augustine": "Augustine Washington"
    },
    {
        " and ": null
    },
    {
        "Mary Ball Washington": "Mary Ball Washington"
    },
    {
        ". By English ": null
    },
    {
        "common law": "Jus Sanguinis"
    },
    {
        " Washington was a naturalized subject of the King, as were all others born in the English colonies. His father was a ": null
    },
    {
        "justice of the peace": "Justice Of The Peace"
    },
    {
        " and a prominent public figure who had three additional children from his first marriage to Jane Butler. The family moved to ": null
    },
    {
        "Little Hunting Creek": "Little Hunting Creek"
    },
    {
        ", in 1735, then to ": null
    },
    {
        "Ferry Farm": "Ferry Farm"
    },
    {
        " near ": null
    },
    {
        "Fredericksburg, Virginia": "Fredericksburg, Virginia"
    },
    {
        " in 1738. When Augustine died in 1743, Washington inherited Ferry Farm and ten slaves; his older half-brother ": null
    },
    {
        "Lawrence": "Lawrence Washington"
    },
    {
        " inherited Little Hunting Creek and renamed it ": null
    },
    {
        "Mount Vernon": "Mount Vernon"
    },
    {
        ".     Washington did not have the formal education that his elder brothers received at ": null
    },
    {
        "Appleby Grammar School": "Appleby Grammar School"
    },
    {
        " in England, but he did learn mathematics, trigonometry, and land ": null
    },
    {
        "surveying": "Surveying"
    },
    {
        ", and he was talented in draftsmanship and map-making. By early adulthood, he was writing with considerable force and precision.  However, his writing displayed little wit or humor. As a young man in pursuit of admiration, status, and power, he had a tendency to attribute his shortcomings and failures on someone elses ineffectuality.     Washington often visited Mount Vernon and ": null
    },
    {
        "Belvoir": "Belvoir"
    },
    {
        ", the plantation that belonged to Lawrences father-in-law ": null
    },
    {
        "William Fairfax": "William Fairfax"
    },
    {
        ". Fairfax became Washingtons patron and surrogate father, and Washington spent a month in 1748 with a team surveying Fairfaxs ": null
    },
    {
        "Shenandoah Valley": "Shenandoah Valley"
    },
    {
        " property. He received a surveyors license the following year from the ": null
    },
    {
        "College of William & Mary": "College Of William  &  Mary"
    },
    {
        "; Fairfax appointed him surveyor of ": null
    },
    {
        "Culpeper County, Virginia": "Culpeper County, Virginia"
    },
    {
        ", and he thus familiarized himself with the frontier region. He resigned from the job in 1750 and had bought almost  in the Valley, and he owned  by 1752.     In 1751, Washington made his only trip abroad when he accompanied Lawrence to ": null
    },
    {
        "Barbados": "Barbados"
    },
    {
        ", hoping that the climate would cure his brothers tuberculosis. Washington contracted ": null
    },
    {
        "smallpox": "Smallpox"
    },
    {
        " during that trip, which immunized him but left his face slightly scarred. Lawrence died in 1752, and Washington leased Mount Vernon from his widow; he inherited it outright after her death in 1761.       Lawrences service as adjutant general of the ": null
    },
    {
        "Virginia militia": "Virginia Militia"
    },
    {
        " inspired Washington to seek a commission, and Virginias Lieutenant Governor ": null
    },
    {
        "Robert Dinwiddie": "Robert Dinwiddie"
    },
    {
        " appointed him as a major in December 1752 and as commander of one of the four militia districts. The British and French were competing for control of the ": null
    },
    {
        "Ohio Valley": "Ohio Valley"
    },
    {
        " at the time, the British building forts along the Ohio River and the French doing likewise, between Lake Erie and the Ohio River.     In October 1753, Dinwiddie appointed Washington as a special envoy to demand that the French vacate territory which the British had claimed. Dinwiddie also appointed him to make peace with the ": null
    },
    {
        "Iroquois Confederacy": "Iroquois Confederacy"
    },
    {
        " and to gather intelligence about the French forces. Washington met with Half-King ": null
    },
    {
        "Tanacharison": "Tanacharison"
    },
    {
        " and other Iroquois chiefs at ": null
    },
    {
        "Logstown": "Logstown"
    },
    {
        " to secure their promise of support against the French, and his party reached the Ohio River in November. They were intercepted by a French patrol and escorted to ": null
    },
    {
        "Fort Le Boeuf": "Fort Le Boeuf"
    },
    {
        " where Washington was received in a friendly manner. He delivered the British demand to vacate to French commander ": null
    },
    {
        "Saint-Pierre": "Jacques Legardeur De Saint-Pierre"
    },
    {
        ", but the French refused to leave. Saint-Pierre gave Washington his official answer in a sealed envelope after a few days delay, and he gave Washingtons party food and extra winter clothing for the trip back to Virginia. Washington completed the precarious mission in 77 days in difficult winter conditions and achieved a measure of distinction when his report was published in Virginia and London.          In February 1754, Dinwiddie promoted Washington to lieutenant colonel and second-in-command of the 300-strong Virginia Regiment, with orders to confront French forces at the ": null
    },
    {
        "Forks of the Ohio": "Forks Of The Ohio"
    },
    {
        ". Washington set out for the Forks with half of the regiment in April but soon learned that a French force of 1,000 had begun construction of ": null
    },
    {
        "Fort Duquesne": "Fort Duquesne"
    },
    {
        " there. In May, Washington had set up a ": null
    },
    {
        "defensive position": "Fort Necessity National Battlefield"
    },
    {
        " at Great Meadows when he learned that the French had made camp  away. Washington decided to take the offensive in pursuit of the French contingent.      The French detachment proved to be only about 50 men, so Washington advanced on May 28 with a small force of Virginians and Indian allies to ambush them. What took place, known as the ": null
    },
    {
        "Battle of Jumonville Glen": "Battle Of Jumonville Glen"
    },
    {
        " or the Jumonville affair, was disputed, but French forces were killed outright with muskets and hatchets. French commander ": null
    },
    {
        "Joseph Coulon de Jumonville": "Joseph Coulon De Jumonville"
    },
    {
        ", who carried a diplomatic message for the British to evacuate, was killed. French forces found Jumonville and some of his men dead and scalped and assumed that Washington was responsible. Washington placed blame on his translator for not communicating the French intentions. Dinwiddie congratulated Washington for his victory over the French. This incident ignited the ": null
    },
    {
        "French and Indian War": "French And Indian War"
    },
    {
        ", which later became part of the larger ": null
    },
    {
        "Seven Years War": "Seven Years War"
    },
    {
        ".     The full Virginia Regiment joined Washington at Fort Necessity the following month with news that he had been promoted to command of the regiment and to colonel upon the death of the regimental commander. The regiment was reinforced by an ": null
    },
    {
        "independent company of 100 South Carolinians": "British Army Independent Companies Of Foot In South Carolina, 1721–1763"
    },
    {
        ", led by Captain ": null
    },
    {
        "James Mackay": "James Mackay"
    },
    {
        ", whose royal commission outranked Washington, and a conflict of command ensued. On July 3, a French force attacked with 900 men, and the ": null
    },
    {
        "ensuing battle": "Battle Of Fort Necessity"
    },
    {
        " ended in Washingtons surrender. In the aftermath, Colonel ": null
    },
    {
        "James Innes": "James Innes"
    },
    {
        " took command of intercolonial forces, the Virginia Regiment was divided, and Washington was offered a captaincy which he refused, with resignation of his commission.          In 1755, Washington served voluntarily as an aide to General ": null
    },
    {
        "Edward Braddock": "Edward Braddock"
    },
    {
        ", who led a British ": null
    },
    {
        "expedition": "Braddock Expedition"
    },
    {
        " to expel the French from Fort Duquesne and the Ohio Country. On Washingtons recommendation, Braddock split the army into one main column and a lightly equipped flying column . Suffering from a severe case of ": null
    },
    {
        "dysentery": "Dysentery"
    },
    {
        ", Washington was left behind, and when he rejoined Braddock at Monongahela, the French and their Indian allies ": null
    },
    {
        "ambushed": "Battle Of The Monongahela"
    },
    {
        " the divided army. The British suffered two-thirds casualties, including the mortally wounded Braddock. Under the command of Lieutenant Colonel Thomas Gage, Washington, still very ill, rallied the survivors and formed a rear guard, which allowed the remnants of the force to disengage and retreat. During the engagement he had two horses shot from under him, and his hat and coat were bullet-pierced. His conduct under fire redeemed his reputation among critics of his command in the Battle of Fort Necessity, but he was not included by the succeeding commander Colonel Thomas Dunbar in planning subsequent operations.     The Virginia Regiment was reconstituted in August 1755, and Dinwiddie appointed Washington its commander, again with the colonial rank of colonel. Washington clashed over seniority almost immediately, this time with ": null
    },
    {
        "John Dagworthy": "John Dagworthy"
    },
    {
        ", another captain of superior royal rank, who commanded a detachment of Marylanders at the regiments headquarters in ": null
    },
    {
        "Fort Cumberland": "Fort Cumberland"
    },
    {
        ". Washington, impatient for an offensive against Fort Duquesne, was convinced Braddock would have granted him a royal commission, and pressed his case in February 1756 with Braddocks successor, ": null
    },
    {
        "William Shirley": "William Shirley"
    },
    {
        ", and again in January 1757 with Shirleys successor, ": null
    },
    {
        "Lord Loudoun": "John Campbell, 4Th Earl Of Loudoun"
    },
    {
        ". Shirley ruled in Washingtons favor only in the matter of Dagworthy; Loudoun humiliated Washington, refused him a royal commission and agreed only to relieve him of the responsibility of manning Fort Cumberland.     In 1758, the Virginia Regiment was assigned to Britains ": null
    },
    {
        "Forbes Expedition": "Forbes Expedition"
    },
    {
        " to take Fort Duquesne. Washington disagreed with General ": null
    },
    {
        "John Forbes": "John Forbes"
    },
    {
        " tactics and chosen route. Forbes nevertheless made Washington a brevet brigadier general and gave him command of one of the three brigades that would assault the fort. The French abandoned the fort and the valley before the assault was launched, with Washington seeing only a friendly-fire incident which left 14 dead and 26 injured. The war lasted another four years, but Washington resigned his commission and returned to Mount Vernon.     Under Washington, the Virginia Regiment had defended  of frontier against 20 Indian attacks in 10 months. He increased the professionalism of the regiment as it increased from 300 to 1,000 men, and Virginias frontier population suffered less than other colonies. Some historians have said this was Washingtons only unqualified success during the war. Though he failed to realize a royal commission, he gained valuable knowledge of British tactics, self-confidence, and leadership skills. The destructive competition Washington witnessed among colonial politicians fostered his later support of strong central government.              On January 6, 1759, Washington, at age 26, married ": null
    },
    {
        "Martha Dandridge Custis": "Martha Washington"
    },
    {
        ", the 28 year-old widow of wealthy plantation owner ": null
    },
    {
        "Daniel Parke Custis": "Daniel Parke Custis"
    },
    {
        ". The marriage took place at Marthas estate; she was intelligent and gracious, and experienced in managing a planters estate, and the couple created a happy marriage. They raised ": null
    },
    {
        "John Parke Custis": "John Parke Custis"
    },
    {
        " and Martha Parke Custis, children from her previous marriage, and later their grandchildren ": null
    },
    {
        "Eleanor Parke Custis": "Eleanor Parke Custis Lewis"
    },
    {
        " and ": null
    },
    {
        "George Washington Parke Custis": "George Washington Parke Custis"
    },
    {
        " . Washingtons 1751 bout with smallpox is thought to have rendered him sterile, though it is equally likely Martha may have sustained injury during the birth of Patsy, her final child, making additional births impossible. Chernow, R. . Washington: A life. New York, NY: Penguin Books. They lamented the fact that they had no children together. They moved to Mount Vernon, near ": null
    },
    {
        "Alexandria": "Alexandria, Virginia"
    },
    {
        ", where he took up life as a planter of tobacco and wheat and emerged as a political figure.     The marriage gave Washington control over Marthas one-third ": null
    },
    {
        "dower": "Dower"
    },
    {
        " interest in the  ": null
    },
    {
        "Custis estate": "Daniel Parke Custisestate"
    },
    {
        ", and he managed the remaining two-thirds for Marthas children; the estate also included 84 slaves. He became one of Virginias wealthiest men which increased his social standing.     At Washingtons urging, Governor ": null
    },
    {
        "Lord Botetourt": "Norborne Berkeley, 4Th Baron Botetourt"
    },
    {
        " fulfilled Dinwiddies 1754 promise of land bounties to all volunteer militia during the French and Indian War. In late 1770, Washington inspected the lands in the ": null
    },
    {
        "Ohio": "Ohio River"
    },
    {
        " and ": null
    },
    {
        "Great Kanawha": "Kanawha River"
    },
    {
        " regions, and he engaged surveyor ": null
    },
    {
        "William Crawford": "William Crawford"
    },
    {
        " to subdivide it. Crawford allotted  to Washington; Washington told the veterans that their land was hilly and unsuitable for farming, and he agreed to purchase , leaving some feeling that they had been duped. He also doubled the size of Mount Vernon to  and increased its slave population to more than 100 by 1775.     As a respected military hero and large landowner, Washington held local offices and was elected to the Virginia provincial legislature, representing Frederick County in the House of Burgesses for seven years beginning in 1758. He plied the voters with beer, brandy, and other beverages, although he was absent while serving on the Forbes Expedition. He won election with roughly 40 percent of the vote, defeating three other candidates with the help of several local supporters. He rarely spoke in his early legislative career, but he became a prominent critic of Britains taxation and mercantilist policies in the 1760s.          By occupation Washington was a planter, and he imported luxuries and other goods from England and paid for them by exporting tobacco. His profligate spending combined with low tobacco prices left him £1,800 in debt by 1764, prompting him to diversify. In 1765, because of erosion and other soil problems he changed Mount Vernons primary cash crop from tobacco to wheat, and expanded operations to include corn ": null
    },
    {
        "flour milling": "George Washingtons Gristmill"
    },
    {
        ", fishing, and other pursuits. Washington also took time for leisure with fox hunting, fishing, dances, theater, cards, backgammon, and billiards,     Washington soon was counted among the political and social elite in Virginia. From 1768 to 1775, he invited some 2,000 guests to his Mount Vernon estate, mostly those whom he considered people of rank . He became more politically active in 1769, presenting legislation in the ": null
    },
    {
        "Virginia Assembly": "Virginia General Assembly"
    },
    {
        " to establish an embargo on goods from Great Britain.     Washingtons stepdaughter Patsy Custis suffered from epileptic attacks from age 12, and she died in his arms in 1773. The following day, he wrote to ": null
    },
    {
        "Burwell Bassett": "Burwell Bassett"
    },
    {
        ": It is easier to conceive, than to describe, the distress of this Family . He canceled all business activity and remained with Martha every night for three months.            Washington played a central role before and during the ": null
    },
    {
        "American Revolution": "American Revolution"
    },
    {
        ". His disdain for the British military had begun when he was abashedly passed over for promotion into the Regular Army. He was opposed to the continuing taxes imposed by the British Parliament on the Colonies without ": null
    },
    {
        "proper representation": "Virtual Representation"
    },
    {
        ". He and other colonists were also angered by the ": null
    },
    {
        "Royal Proclamation of 1763": "Royal Proclamation Of 1763"
    },
    {
        " which banned American settlement west of the ": null
    },
    {
        "Allegheny Mountains": "Allegheny Mountains"
    },
    {
        " and protected the ": null
    },
    {
        "British fur trade": "North American Fur Trade"
    },
    {
        ".     Washington believed that the ": null
    },
    {
        "Stamp Act": "Stamp Act 1765"
    },
    {
        " of 1765 was an Act of Oppression , and he celebrated its repeal the following year. In March 1766, Parliament passed the ": null
    },
    {
        "Declaratory Act": "Declaratory Act"
    },
    {
        " asserting that Parliamentary law superseded colonial law. Washington helped to lead widespread protests against the ": null
    },
    {
        "Townshend Acts": "Townshend Acts"
    },
    {
        " passed by Parliament in 1767, and he introduced a proposal in May 1769 drafted by ": null
    },
    {
        "George Mason": "George Mason"
    },
    {
        " which called Virginians to boycott English goods; the Acts were mostly repealed in 1770.     Parliament sought to punish Massachusetts colonists for their role in the ": null
    },
    {
        "Boston Tea Party": "Boston Tea Party"
    },
    {
        " in 1774 by passing the ": null
    },
    {
        "Coersive Acts": "Intolerable Acts"
    },
    {
        ", which Washington referred to as an Invasion of our Rights and Privileges . He said Americans must not submit to acts of tyranny since custom and use shall make us as tame and abject slaves, as the blacks we rule over with such arbitrary sway . That July, he and George Mason drafted a list of resolutions for the ": null
    },
    {
        "Fairfax County": "Fairfax County, Virginia"
    },
    {
        " committee which Washington chaired, and the committee adopted the ": null
    },
    {
        "Fairfax Resolves": "Fairfax Resolves"
    },
    {
        " calling for a Continental Congress. On August 1, Washington attended the ": null
    },
    {
        "First Virginia Convention": "Virginia Conventions"
    },
    {
        " where he was selected as a delegate to the ": null
    },
    {
        "First Continental Congress": "First Continental Congress"
    },
    {
        ". As tensions rose in 1774, he assisted in the training of county militias in Virginia and organized enforcement of the ": null
    },
    {
        "Continental Association": "Continental Association"
    },
    {
        " boycott of British goods instituted by the Congress.     The ": null
    },
    {
        "American Revolutionary War": "American Revolutionary War"
    },
    {
        " began on April 19, 1775 with the ": null
    },
    {
        "Battles of Lexington and Concord": "Battles Of Lexington And Concord"
    },
    {
        " and the ": null
    },
    {
        "Siege of Boston": "Siege Of Boston"
    },
    {
        ". The colonists were divided over breaking away from British rule and split into two factions: ": null
    },
    {
        "Patriots": "Patriot"
    },
    {
        " who rejected British rule, and ": null
    },
    {
        "Loyalists": "Loyalist"
    },
    {
        " who desired to remain subject to the British King. General ": null
    },
    {
        "Thomas Gage": "Thomas Gage"
    },
    {
        " was commander of British forces in America at the beginning of the war. Upon hearing the shocking news of the onset of war, Washington was sobered and dismayed , and he hastily departed Mount Vernon on May 4, 1775 to join the Continental Congress in ": null
    },
    {
        "Philadelphia": "Philadelphia, Pennsylvania"
    },
    {
        ".             ": null
    },
    {
        "Congress": "Second Continental Congress"
    },
    {
        " created the ": null
    },
    {
        "Continental Army": "Continental Army"
    },
    {
        " on June 14, 1775, and ": null
    },
    {
        "Samuel": "Samuel Adams"
    },
    {
        " and ": null
    },
    {
        "John Adams": "John Adams"
    },
    {
        " nominated Washington to become its commander in chief. Washington was chosen over ": null
    },
    {
        "John Hancock": "John Hancock"
    },
    {
        " because of his military experience and the belief that a Virginian would better unite the colonies. He was considered an incisive leader who kept his ambition in check.  He was unanimously elected commander in chief by Congress the next day.": null
    },
    {
        "ner": "Ner"
    },
    {
        "ssachuset": "Ssachuset"
    },
    {
        "ldi": "Ldi"
    },
    {
        "ldi": "Ldi"
    },
    {
        "w Yo": "W Yo"
    },
    {
        "ner": "Ner"
    },
    {
        "erican, Schwäbisch Gmünd 1816–1868 Washington, D.C.1851 painting18": "Erican, Schwäbisch Gmünd 1816–1868 Washington, D.C.1851 Painting18"
    },
    {
        "ner": "Ner"
    },
    {
        "ldi": "Ldi"
    },
    {
        "2,400 troops": null
    },
    {
        "nnsylvan": "Nnsylvan"
    },
    {
        "700": null
    },
    {
        "ner": "Ner"
    },
    {
        "1,500": null
    },
    {
        "See map": ":File:Battle Of Trenton.Dean.Usma.Edu.History.Gif"
    },
    {
        ".including Colonel ": null
    },
    {
        "Johann Rall": "Johann Rall"
    },
    {
        "referred to as the ": null
    },
    {
        "Conway Cabal": "Conway Cabal"
    },
    {
        "itish Army officer, born 17": "Itish Army Officer, Born 17"
    },
    {
        "51–18": "51–18"
    },
    {
        "itish Army officer, born 17": "Itish Army Officer, Born 17"
    },
    {
        "ner": "Ner"
    },
    {
        "itish Army officer, born 17": "Itish Army Officer, Born 17"
    },
    {
        "54-17": "54-17"
    },
    {
        "yali": "Yali"
    },
    {
        "ited Stat": "Ited Stat"
    },
    {
        "w Yo": "W Yo"
    },
    {
        "ce preside": "Ce Preside"
    },
    {
        "w Yo": "W Yo"
    },
    {
        "9517": "9517"
    },
    {
        "ancell": "Ancell"
    },
    {
        "ited Stat": "Ited Stat"
    },
    {
        "Kentucky in 1792, Tennessee in 1796": null
    },
    {
        "shington, D.": "Shington, D."
    },
    {
        "lbert Stuart portra": "Lbert Stuart Portra"
    },
    {
        "or indeed no crime at all2010": null
    },
    {
        "iladelph": "Iladelph"
    },
    {
        "ncinnati, Oh": "Ncinnati, Oh"
    },
    {
        "British allies": null
    },
    {
        "ptember 19, 17": "Ptember 19, 17"
    },
    {
        "Piedmont": "Piedmont"
    },
    {
        "Dr. William Thornton": "Dr. William Thornton"
    },
    {
        " arrived some hours after Washington died.": null
    },
    {
        "inter18": "Inter18"
    },
    {
        "tracheal inflammation": null
    },
    {
        " rightrig": "Rightrig"
    },
    {
        "chite": "Chite"
    },
    {
        "ti": "Ti"
    },
    {
        "r": "R"
    },
    {
        "r": "R"
    },
    {
        "02–16": "02–16"
    },
    {
        "his great-great-grandfatherthe Anglican Church": null
    },
    {
        "iscopal prie": "Iscopal Prie"
    },
    {
        "edenborgi": "Edenborgi"
    },
    {
        "20002001": null
    },
    {
        "sh": "Sh"
    },
    {
        "2003": null
    },
    {
        "ldi": "Ldi"
    },
    {
        "20052010201012 vols., 1834–18371931–44": null
    },
    {
        "a": "A"
    },
    {
        "ited States co": "Ited States Co"
    },
    {
        "the ": null
    },
    {
        "Washington quarter": "Washington Quarter"
    },
    {
        "cropped": null
    },
    {
        "ited States co": "Ited States Co"
    }
]