[
    {
        "     George the Bearded, Duke of Saxony , was ": null
    },
    {
        "Duke of Saxony": "duke of saxony"
    },
    {
        " from 1500 to 1539 known for his opposition to the ": null
    },
    {
        "Reformation": "reformation"
    },
    {
        ". While the Ernestine line embraced ": null
    },
    {
        "Lutheranism": "lutheranism"
    },
    {
        ", the Albertines were reluctant to do so. Despite Georges efforts to avoid a succession by a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " upon his death in 1539, he could not prevent it from happening. Under the Act of Settlement of 1499, Lutheran ": null
    },
    {
        "Henry IV": "henry iv, duke of saxony"
    },
    {
        " became the new duke. Upon his accession, Henry introduced ": null
    },
    {
        "Lutheranism": "lutheranism"
    },
    {
        " as a ": null
    },
    {
        "state religion": "state religion"
    },
    {
        " in the Albertine lands of Saxony.     Duke George was a member of the ": null
    },
    {
        "Order of the Golden Fleece": "order of the golden fleece"
    },
    {
        ".       His father was ": null
    },
    {
        "Albert the Brave of Saxony": "albert, duke of saxony"
    },
    {
        ", founder of the Albertine line of the ": null
    },
    {
        "Wettin family": "wettin"
    },
    {
        ", his mother was ": null
    },
    {
        "Sidonie": "sidonie podiebrad"
    },
    {
        ", daughter of ": null
    },
    {
        "George Podiebrad": "george podiebrad"
    },
    {
        ", ": null
    },
    {
        "King of Bohemia": "king of bohemia"
    },
    {
        ". Elector ": null
    },
    {
        "Frederick the Wise": "frederick iii, elector of saxony"
    },
    {
        ", a member of the Ernestine branch of the same family, known for his protection of ": null
    },
    {
        "Luther": "martin luther"
    },
    {
        ", was a cousin of Duke George.      George, as the eldest son, received an excellent training in theology and other branches of learning, and was thus much better educated than most of the princes of his day.     As early as 1488, when his father was in ": null
    },
    {
        "East Frisia": "east frisia"
    },
    {
        " fighting on behalf of the emperor, George was regent of the ducal possessions, which included the ": null
    },
    {
        "Margraviate of Meissen": "margraviate of meissen"
    },
    {
        " with the cities of ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        " and ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ".     He is buried with his wife Barbara in the purpose-built Georgskapelle in ": null
    },
    {
        "Meissen Cathedral": "meissen cathedral"
    },
    {
        ". The room contains a magnificent altarpiece by ": null
    },
    {
        "Lucas Cranach the Elder": "lucas cranach the elder"
    },
    {
        ". In 1677 a highly ornate ceiling was added to the chapel, designed by ": null
    },
    {
        "Wolf Caspar von Klengel": "wolf caspar von klengel"
    },
    {
        ".                George was married at Dresden, on 21 November 1496, to ": null
    },
    {
        "Barbara Jagiellon": "barbara jagiellon"
    },
    {
        ", daughter of ": null
    },
    {
        "Casimir IV, King of Poland and Grand Duke of Lithuania": "casimir iv of poland"
    },
    {
        " and Elisabeth, daughter of ": null
    },
    {
        "Albrecht II of Hungary": "albrecht ii of hungary"
    },
    {
        ". They had ten children, but all, with the exception of a daughter, died before their father:     Christof .   ": null
    },
    {
        "Johann": "john of saxony"
    },
    {
        " , Hereditary Duke of Saxony; married on 20 May 1516 to ": null
    },
    {
        "Elizabeth of Hesse": ":file:lucas cranach d. ä. 052.jpg"
    },
    {
        ", ": null
    },
    {
        "sister of his brother-in-law": "elisabeth of hesse, hereditary princess of saxony"
    },
    {
        ". This union was childless.   Wolfgang .   Anna .   Christof .   Agnes .   ": null
    },
    {
        "Frederick": "frederick, hereditary prince of saxony"
    },
    {
        " , Hereditary Duke of Saxony; married on 27 January 1539 to Elisabeth of Mansfeld. This union was childless.   ": null
    },
    {
        "Christine": "christine of saxony"
    },
    {
        " , married on 11 December 1523 to ": null
    },
    {
        "Philip I, Landgrave of Hesse": "philip i, landgrave of hesse"
    },
    {
        ".   ": null
    },
    {
        "Magdalena": "magdalena of saxony"
    },
    {
        " , married on 6 November 1524 to ": null
    },
    {
        "Joachim Hector": "joachim ii hector, elector of brandenburg"
    },
    {
        " Albert the brave of Saxony": "albert iii, duke of saxony"
    },
    {
        " Barbara": "barbara jagiellon"
    },
    {
        " Portrait of a Saxon Prince possibly of George of Saxonys son Johann.  Portrait of a Saxon Princess possibly George of Saxonys daughter-in-law Elizabeth of Hesse.  ": null
    },
    {
        "Christine of Saxony": "christine of saxony"
    },
    {
        " Magdalena of Saxony": "magdalena of saxony"
    },
    {
        "            In 1498, the emperor granted Albert the Brave the hereditary governorship of Friesland. At ": null
    },
    {
        "Maastricht": "maastricht"
    },
    {
        ", 14 February 1499, Albert settled the succession to his possessions, and endeavoured by this arrangement to prevent further partition of his domain. He died 12 September 1500, and was succeeded in his German territories by George as the head of the Albertine line, while Georges brother ": null
    },
    {
        "Heinrich": "henry iv, duke of saxony"
    },
    {
        " became hereditary governor of Friesland.     The Saxon occupation of Friesland, however, was by no means secure and was the source of constant revolts in that province. Consequently, Heinrich, who was of a rather inert disposition, relinquished his claims to the governorship, and in 1505 an agreement was made between the brothers by which Friesland was transferred to George, while Heinrich received an annuity and the districts of ": null
    },
    {
        "Freiberg": "freiberg"
    },
    {
        " and ": null
    },
    {
        "Wolkenstein": "wolkenstein"
    },
    {
        ". But this arrangement did not restore peace in Friesland, which remained a source of trouble to Saxony. In 1515 George sold Friesland to ": null
    },
    {
        "the future Emperor Charles V": "charles v, holy roman emperor"
    },
    {
        "  for the very moderate price of 100,000 florins. He tried to keep the newmade lands of ": null
    },
    {
        "het Bildt": "het bildt"
    },
    {
        " which werent granted him by Charles V. These troubles outside of his Saxon possessions did not prevent George from bestowing much care on the government of the ducal territory proper. When regent, during the lifetime of his father, the difficulties arising from conflicting interests and the large demands on his powers had often brought the young prince to the verge of despair.     In a short time, however, he developed decided ability as a ruler; on entering upon his inheritance he divided the duchy into governmental districts, took measures to suppress the robber-knights, and regulated the judicial system by defining and readjusting the jurisdiction of the various law courts. In his desire to achieve good order, severity, and the amelioration of the condition of the people, he sometimes ventured to infringe even on the rights of the cities. His court was better regulated than that of any other German prince, and he bestowed a paternal care on the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        ", where a number of reforms were introduced, and ": null
    },
    {
        "Humanism": "humanism"
    },
    {
        ", as opposed to ": null
    },
    {
        "Scholasticism": "scholasticism"
    },
    {
        ", was encouraged.       From the beginning of the ": null
    },
    {
        "Reformation": "protestant reformation"
    },
    {
        " in 1517, Duke George directed his energies chiefly to ecclesiastical affairs. Hardly one of the secular German princes held as firmly as he to the Church, he defended its rights and vigorously condemned every innovation except those countenanced by the highest ecclesiastical authorities. At first he was not opposed to Luther, but as time went on and Luthers aim became clear to him, he turned more and more from the Reformer, and was finally, in consequence of this change of attitude, drawn into an acrimonious correspondence in which Luther, according to some without any justification, heavily criticized the duke.     The duke was not blind to the undeniable abuses existing at that time in the Church. In 1519, despite the opposition of the theological faculty of the university, he originated the ": null
    },
    {
        "Disputation of Leipzig": "disputation of leipzig"
    },
    {
        ", with the idea of helping forward the cause of truth, and was present at all the discussions. In 1521, at the ": null
    },
    {
        "Diet of Worms": "diet of worms"
    },
    {
        ", when the German princes handed in a paper containing a list of grievances concerning the condition of the Church, George added for himself twelve specific complaints referring mainly to the abuse of ": null
    },
    {
        "Indulgences": "indulgences"
    },
    {
        " and the ": null
    },
    {
        "annate": "annate"
    },
    {
        "s.     In 1525, he combined with his Lutheran son-in-law, Landgrave ": null
    },
    {
        "Philip of Hesse": "philip of hesse"
    },
    {
        ", and his cousin, the Elector Frederick the Wise, to suppress the ": null
    },
    {
        "revolt of the peasants": "german peasants war"
    },
    {
        ", who were defeated near ": null
    },
    {
        "Frankenhausen": "frankenhausen"
    },
    {
        " in ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        ". Some years later, he wrote a forcible preface to a translation of the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " issued at his command by his private secretary, ": null
    },
    {
        "Hieronymus Emser": "hieronymus emser"
    },
    {
        ", as an offset to Luthers version. Lutheran books were confiscated by his order, wherever found, though he refunded the cost of the books. He proved himself in every way a vigorous opponent of the Lutherans, decreeing that Christian burial was to be refused to apostates, and recreant ecclesiastics were to be delivered to the ": null
    },
    {
        "bishop of Merseburg": "bishop of merseburg"
    },
    {
        ".     For those, however, who merely held anti-catholic opinions, the punishment was only expulsion from the duchy. The duke deeply regretted the constant postponement of the ardently desired council, from the action of which so much was expected. While awaiting its convocation, he thought to remove the more serious defects by a reform of the monasteries, which had become exceedingly worldly in spirit and from which many of the inmates were departing. He vainly sought to obtain from the ": null
    },
    {
        "Curia": "curia"
    },
    {
        " the right, which was sometimes granted by ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", to make official visitations to the conventual institutions of his realm. His reforms were confined mainly to uniting the almost vacant monasteries and to matters of economic management, the control of the property being entrusted in most cases to the secular authorities.     In 1525, Duke George formed, with some other German rulers, the ": null
    },
    {
        "League of Dessau": "league of dessau"
    },
    {
        ", for the protection of Catholic interests. In the same way he was the animating spirit of the ": null
    },
    {
        "League of Halle": "league of halle"
    },
    {
        ", formed in 1533, from which sprang in 1538 the ": null
    },
    {
        "Holy League of Nuremberg": "holy league of nuremberg"
    },
    {
        " for the maintenance of the religious ": null
    },
    {
        "Peace of Nuremberg": "peace of nuremberg"
    },
    {
        ".     The vigorous activity displayed by the duke in so many directions was not attended with much success. Most of his political measures, indeed, stood the test of experience, but in ecclesiastico-political matters he witnessed with sorrow the gradual decline of Catholicism and the spread of Lutheranism within his dominions, in spite of his earnest efforts and forcible prohibition of the new doctrine. Furthermore, during Georges lifetime his nearest relations his son-in-law Philip of Hesse, and his brother Heinrich, joined the Reformers.     He spent the last years of his reign in endeavours to secure a Catholic successor, thinking by this step to check the dissemination of Lutheran opinions. The only one of Georges sons then living was the weak-minded and unmarried Frederick. The intention of his father was that Frederick should rule with the aid of a council. Early in 1539, Frederick was married to Elizabeth of ": null
    },
    {
        "Mansfeld": "mansfeld"
    },
    {
        ", but he died shortly afterwards, leaving no prospect of an heir. According to the act of settlement of 1499, Georges Protestant brother Heinrich was now heir prospective; but George, disregarding his fathers will, sought to disinherit his brother and to bequeath the duchy to ": null
    },
    {
        "Ferdinand": "ferdinand i, holy roman emperor"
    },
    {
        ", brother of ": null
    },
    {
        "Charles V": "charles v, holy roman emperor"
    },
    {
        ". His sudden death prevented the carrying out of this intention.       George was an industrious and energetic, if somewhat irascible ruler in the furtherance of the interests of his land and people. A faithful adherent of the Emperor and Empire, he accomplished much for his domain by economy, love of order and wise direction of activities of his state officials. The grief of his life was Luthers Reformation and what he regarded to be apostasy from the Old Faith. Of a strictly religious, although not narrow, disposition, he sought at any cost to keep his subjects from falling away from the Church, but his methods were sometimes questionable.       ": null
    }
]