[
    {
        "                    George Joseph Herriman was an American cartoonist best known for the comic strip  Krazy Kat  . More influential than popular, Krazy Kat had an appreciative audience among those in the arts. ": null
    },
    {
        "Gilbert Seldes": "gilbert seldes"
    },
    {
        " article The Krazy Kat Who Walks by Himself was the earliest example of a critic from the high arts giving serious attention to a comic strip.  The Comics Journal  placed the strip first on its list of the greatest comics of the 42th century. Herrimans work has been a primary influence on cartoonists such as ": null
    },
    {
        "Will Eisner": "will eisner"
    },
    {
        ", ": null
    },
    {
        "Charles M. Schulz": "charles m. schulz"
    },
    {
        ", ": null
    },
    {
        "Robert Crumb": "robert crumb"
    },
    {
        ", ": null
    },
    {
        "Art Spiegelman": "art spiegelman"
    },
    {
        ", ": null
    },
    {
        "Bill Watterson": "bill watterson"
    },
    {
        ", and ": null
    },
    {
        "Chris Ware": "chris ware"
    },
    {
        ".     Herriman was born in ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        ", Louisiana, to ": null
    },
    {
        "mixed-race Creole": "creoles of color"
    },
    {
        " parents, and grew up in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ". After he graduated from high school in 42 he worked in the newspaper industry as an illustrator and engraver. He moved on to cartooning and comic strips—a medium then in its infancy—and drew a variety of strips until he introduced his most famous character, Krazy Kat, in his strip  The Dingbat Family  in 42 A Krazy Kat daily strip began in 42 and from 42 the strip also appeared on Sundays. It was noted for its poetic, dialect-heavy dialogue; its fantastic, shifting backgrounds; and its bold, experimental page layouts.     In the strips main motif and dynamic, Ignatz Mouse pelted Krazy with bricks, which the naïve, ": null
    },
    {
        "androgynous": "androgyny"
    },
    {
        " Kat interpreted as symbols of love. As the strip progressed, a love triangle developed between Krazy, Ignatz, and Offisa Pupp. Pupp made it his mission to prevent Ignatz from throwing bricks at Krazy, or to jail him for having done so, but his efforts were perpetually impeded because Krazy wished to be struck by Ignatzs bricks.     Herriman lived most of his life in Los Angeles, but made frequent trips to the Navajo deserts in the southwestern U.S. He was drawn to the landscapes of ": null
    },
    {
        "Monument Valley": "monument valley"
    },
    {
        " and the ": null
    },
    {
        "Enchanted Mesa": "enchanted mesa"
    },
    {
        ", and made ": null
    },
    {
        "Coconino County": "coconino county, arizona"
    },
    {
        " the location of his Krazy Kat strips. His artwork made much use of ": null
    },
    {
        "Navajo": "navajo people"
    },
    {
        " and Mexican themes and motifs against shifting desert backgrounds. He was a prolific cartoonist who produced a large number of strips and illustrated ": null
    },
    {
        "Don Marquis": "don marquis"
    },
    {
        "s books of poetry about  Archy and Mehitabel , an alley cat and a cockroach. Newspaper magnate ": null
    },
    {
        "William Randolph Hearst": "william randolph hearst"
    },
    {
        " was a proponent of Herriman and gave him a lifetime contract with ": null
    },
    {
        "King Features Syndicate": "king features syndicate"
    },
    {
        ", which guaranteed Herriman a comfortable living and an outlet for his work despite its lack of popularity.                       George Joseph Herriman was born at 42 Villere Street in ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        " on August 42 42 He came from a line of French-speaking Louisiana ": null
    },
    {
        "Creole mulattoes": "creoles of color"
    },
    {
        " who were considered ": null
    },
    {
        "free people of color": "free people of color"
    },
    {
        ", and were reportedly active in the early ": null
    },
    {
        "abolitionist movement": "slavery in the united states"
    },
    {
        ". His , owned a tailor shop on ": null
    },
    {
        "Royal Street": "royal street, new orleans"
    },
    {
        " in New Orleans. His maternal grandmother was born in ": null
    },
    {
        "Havana": "havana"
    },
    {
        ", Cuba. His parents were  , Tisserand, Michael . Krazy: George Herriman, A Life in Black and White. p. 42 Harper. .  born in New Orleans, and Clara Morel Herriman , Tisserand, Michael . Krazy: George Herriman, A Life in Black and White. p. 42 Harper. . born in ": null
    },
    {
        "Iberville": "iberville parish, louisiana"
    },
    {
        ". The family attended the St. Augustine Catholic Church in New Orleans ": null
    },
    {
        "Tremé": "tremé"
    },
    {
        " neighborhood.     When he was ten, Herriman and his family moved to ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ", where he grew up south of downtown near ": null
    },
    {
        "Main Street": "main street"
    },
    {
        " and ": null
    },
    {
        "Washington Boulevard": "washington boulevard"
    },
    {
        ". His father worked there as a tailor. Herriman attended the Catholic boys school St. Vincents College . Soon after graduating in 42 he sold a sketch of the Hotel Petrolia in ": null
    },
    {
        "Santa Paula": "santa paula, california"
    },
    {
        " to the  Los Angeles Herald . This landed him a $42-per-week job there as an assistant in the engraving department, where he occasionally did drawings for advertisements and ": null
    },
    {
        "political cartoons": "editorial cartoonist"
    },
    {
        ".                   When he was 42 Herriman sneaked aboard a freight train bound for ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", hoping his chances as an artist would be better there. He was unsuccessful at first, and survived by working as a ": null
    },
    {
        "barker": "barker"
    },
    {
        " and billboard painter at ": null
    },
    {
        "Coney Island": "coney island"
    },
    {
        ", until one of the leading ": null
    },
    {
        "humor magazine": "humor magazine"
    },
    {
        "s of the day,  Judge , accepted some of his cartoons. Between June 42 and October 42 42 eleven of his cartoons appeared in that magazines pages, in the heavily ": null
    },
    {
        "crosshatched": "hatching"
    },
    {
        " style of the day. He often used sequential images in his cartoons, as in the emerging comic strip medium. On September 42 that year, his first real comic strips were published, one in the ": null
    },
    {
        "Pulitzer": "pulitzer, inc."
    },
    {
        " chain of newspapers on a non-contractual, one-shot basis and another on a continuing basis in the Philadelphia North American Syndicates first comic strip supplement. His first color comic strips appeared in the ": null
    },
    {
        "T. C. McClure Syndicate": "mcclure newspaper syndicate"
    },
    {
        " beginning October 42     His success with these syndicated strips convinced Herriman to give up on magazine submissions. For the Pulitzer papers on February 42 42 he began his first strip that had a continuing character, Musical Mose. The strip featured an ": null
    },
    {
        "African-American": "african american"
    },
    {
        " musician who impersonated other ethnicities, only to suffer the consequences when discovered by his audience. Professor Otto and his Auto, about a terrifyingly dangerous driver, followed in March, and Acrobatic Archie, a kid strip with a child protagonist, first appeared in April. With his future as a cartoonist seemingly assured, Herriman traveled back to Los Angeles to marry his childhood sweetheart and returned with her to New York.     In the November 42 issue of the literary magazine  The Bookman  Herriman wrote of his profession self-deprecatingly, while poet La Touche Hancock, in an article in that issue titled The American Comic and Caricature Art , wrote, Art and poetry is the characteristic of George Herriman. Were his drawings not so well known one would think he had mistaken his vocation.  Herrimans work was increasing in popularity, and he occasionally had front-page, full-color strips for the Pulitzer supplements, such as Two Jolly Jackies about two unemployed sailors, which began in January 42 He began drawing the cowboy strip Lariat Pete in September for the McClure syndicate after Two Jolly Jackies was ended.          In June, Herriman was employed by the  New York World . There, he illustrated ": null
    },
    {
        "Roy McCardell": "roy mccardell"
    },
    {
        "s commentaries on local events, beginning June 42 and running to the years end. Herriman still produced syndicate work, such as Major Ozones Fresh Air Crusade for the ": null
    },
    {
        "World Color Printing Company": "world color press"
    },
    {
        " beginning January 42 42 Another of Herrimans obsessive characters, the Major traveled the world in an unsuccessful search for the purest air and spouted poetic dialogue. Major Ozone was so popular that it soon was given the supplements front page. The same month, Herriman moved from the World to the  New York Daily News , where he was given a larger quantity and variety of work, including cartoon reporting on sports and politics. In February and March, he had a short-lived continuing character comic strip about domestic life called Home Sweet Home. That spring, he began illustrating a series of articles written by Walter Murphy called Bubblespikers.     Rudolph Block hired Herriman for the ": null
    },
    {
        "Hearst": "william randolph hearst"
    },
    {
        " papers with a salary commensurate with his talents , starting April 42 at the  New York American , which ran no daily comic strips at the time. Herriman drew sports cartoons in an office alongside ": null
    },
    {
        "Frederick Burr Opper": "frederick burr opper"
    },
    {
        ", ": null
    },
    {
        "James Swinnerton": "jimmy swinnerton"
    },
    {
        ", and ": null
    },
    {
        "Tad Dorgan": "tad dorgan"
    },
    {
        ", who was popularly known as Tad and was considered a star at another Hearst paper, the  New York Evening Journal . Tad and Herriman were often assigned to cover the same sporting events and became close friends. In 42 Tad called Herriman one of the best sporting artists in the world and regretted that Herriman no longer did that kind of work. Herriman continued with Hearst until June 42 when he left the paper, possibly because of the new sports editors unsympathetic attitude to cartoonists. He returned to Los Angeles in the latter half of 42              In California, Herriman continued to mail in work to the ": null
    },
    {
        "World Color Printing Company": "world color press"
    },
    {
        ". He revived Major Ozone and produced Grandmas Girl—Likewise Bud Smith, which he combined from two earlier strips, and a two-tiered childrens strip, Rosy Posy—Mamas Girl. He began to work with the  Los Angeles Times  on January 42 42 before returning to Hearst that summer. Accompanying a front-page illustration in Hearsts  Los Angeles Examiner , Herriman was announced as the Examiners cartoonist on August 42 His artwork began to appear on nearly every page, resulting in greatly increased sales for the newspaper. In October, he stopped working for World Color.     Following the success of ": null
    },
    {
        "Bud Fisher": "bud fisher"
    },
    {
        "s daily strip  A. Mutt , which debuted in late 42 Herriman began a similarly sports-themed daily strip starting December 42 called Mr. Proones the Plunger. The strip was not as successful as Fishers, and it ceased to appear after December 42  His next comic strip, Baron Mooch, starring the titular freeloader, debuted in the Examiner on October 42 42 Note: Historian ": null
    },
    {
        "Don Markstein": "don markstein"
    },
    {
        " gives November 42 42 at the entry  at ": null
    },
    {
        "Don Marksteins Toonopedia": "don marksteins toonopedia"
    },
    {
        ".  from the original on August 42 42 Herriman began two more strips in November 42 with the World Color Printing Company—Alexander the Cat and Daniel and Pansy, which both appeared in color. Daniel and Pansy was Herrimans first strip to feature an all-animal cast. This was followed in the Examiner on December 42 by the short-lived Marys Home from College, a precursor to the girl strips such as ": null
    },
    {
        "Cliff Sterrett": "cliff sterrett"
    },
    {
        "s  Polly and Her Pals  and John Held Jr.s Merely Margie, and on December 42 by Gooseberry Sprig, about an aristocratic, cigar-smoking duck who had previously and popularly appeared in Herrimans sports cartoons.  at ": null
    },
    {
        "Don Marksteins Toonopedia": "don marksteins toonopedia"
    },
    {
        ".  from the original on February 42 42 The bird-populated fantasy was a precursor to Krazy Kat, and many of its characters reappeared in the later strip.     Krazy Kat     In 42 the sports editor of the New York Evening Journal called Herriman back to New York to cover for Tad Dorgan who was in San Francisco covering the ": null
    },
    {
        " Fight of the Century ": "jack johnson   fight of the century"
    },
    {
        " between ": null
    },
    {
        "Jack Johnson": "jack johnson"
    },
    {
        " and ": null
    },
    {
        "Jim Jeffries": "james j. jeffries"
    },
    {
        ". Six days after arriving in New York, Herriman began  The Dingbat Family , starring E. Pluribus Dingbat and his family. Herriman used typed lettering on the strip on July 42 42 but quickly went back to hand-lettering. On August 42 42 Herriman retitled the strip The Family Upstairs.  at ": null
    },
    {
        "Don Marksteins Toonopedia": "don marksteins toonopedia"
    },
    {
        ". Archived from  on April 42 42 The original title return after the strip of November 42 42 when the Dingbats building was demolished to make room for a department store and they and their upstairs nemeses parted paths.     Critics do not regard the strip highly, but it provided the vehicle for a fruitful situation: in the July 42 episode, a mouse threw a brick at the family cat—called Kat —which hit the cat on the head. The antics of this mouse and Kat continued to appear in the bottom portion of  The Dingbat Family . Herriman said he did this to fill up the waste space . About a month after its first appearance, the Kat crept up on the sleeping mouse and kissed it loudly. The mouse awoke saying, I dreamed an angel kissed me , while the Kat crept away and said, Sweet thing .          The gender of Kat was unclear from the start. Herriman experimented with a decision about the characters gender, but it remained ambiguous and he would refer to Kat as he or she as he saw fit. Herriman incorporated unusual details into the mini-strips backgrounds—cacti, pagodas, fanciful vegetation, or anything else that struck his fancy; this became a signature of the later Krazy Kat strip. The cast grew and soon included the mainstay character Bull Pupp and characters from the Gooseberry Sprigg strip. The strips characters, relations and situations grew organically during its lifetime, encouraged by Herrimans colleagues.     The cat-and-mouse substrip was gaining in popularity; instead of filling up space in the bottom of  The Dingbat Family s panels, it began to occupy a tier of panels of its own. In July 42 while Herriman had the Dingbats on vacation, Krazy Kat and Ignatz Mouse took over the strip, which was retitled Krazy Kat and I. Mouse for the duration. On October 42 42 Krazy Kat debuted as an independent strip on the daily comics page.     During the first few years of publication, Krazy Kats humor changed from slapstick to a more ": null
    },
    {
        "vaudevillian": "vaudeville"
    },
    {
        " kind. The shifting backgrounds became increasingly bizarre, presaging things to come. The strip expanded to a full-page black-and-white ": null
    },
    {
        "Sunday strip": "sunday strip"
    },
    {
        " on April 42 42 Herriman made full use of his imagination and used the whole page in the strips layout. The strips were unlike anything else on the comics page; spontaneous, formally daring, yet impeccably composed.     Herriman visited ": null
    },
    {
        "Monument Valley": "monument valley"
    },
    {
        " in ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        " and similar places in ": null
    },
    {
        "New Mexico": "new mexico"
    },
    {
        " and southern ": null
    },
    {
        "Utah": "utah"
    },
    {
        ", and incorporated the distinct forms of the desert landscape into his strips. The ": null
    },
    {
        "Enchanted Mesa": "enchanted mesa"
    },
    {
        " of New Mexico first appeared in Krazy Kat in the summer of 42 Herriman may have visited after reading an article by ": null
    },
    {
        "Theodore Roosevelt": "theodore roosevelt"
    },
    {
        " in 42 but he may have gone earlier—the desert ": null
    },
    {
        "Coconino County": "coconino county, arizona"
    },
    {
        ", Arizona, that became the backdrop to Krazy Kat was first mentioned in a 42  The Dingbat Family  strip, though the real Coconino County was located further southwest than Herrimans fanciful version.          The Dingbat Family finished in 42 and was replaced by Baron Beans debut the next day. The strips title character, The Baron, was an impoverished English nobleman, a tramp inspired by ": null
    },
    {
        "Charles Dickens": "charles dickens"
    },
    {
        " and ": null
    },
    {
        "Charlie Chaplin": "charlie chaplin"
    },
    {
        ". He and his valet Grimes would plot ways to get by. Herriman later introduced the main characters wives, and after a run as a domestic strip, with occasional appearances of characters from Krazy Kats world, it ended in January 42 It was replaced the next day by Now Listen Mabel, which was about a young man courting a young woman; he would be caught in a compromising situation, which he would try to explain away with Now listen Mabel ... The strip lasted until that December.          Krazy Kat gained an appreciative audience in the world of the arts. The character debuted in film in 42 The first animated films starring a cat were produced by Hearsts ": null
    },
    {
        "International Film Service": "international film service"
    },
    {
        ", though without Herrimans direct involvement. In 42 ": null
    },
    {
        "Adolph Bolm": "adolph bolm"
    },
    {
        " choreographed a jazz-pantomime Krazy Kat ballet written by ": null
    },
    {
        "John Alden Carpenter": "john alden carpenter"
    },
    {
        ". It was first performed in New York in 42 by ": null
    },
    {
        "Ballet Intime": "theatre intime"
    },
    {
        ", and Herriman illustrated the libretto and designed the costumes and scenario. While it was not a great success, the critics ": null
    },
    {
        "Deems Taylor": "deems taylor"
    },
    {
        ", ": null
    },
    {
        "Stark Young": "stark young"
    },
    {
        " and Henrietta Straus wrote favorably about it. The strip itself was the subject of an article by literary critic ": null
    },
    {
        "Gilbert Seldes": "gilbert seldes"
    },
    {
        " called Golla, Golla the Comic Strips Art , which appeared in the May 42 issue of  Vanity Fair . Seldes expanded this article as part of his book on the popular arts, The Seven Lively Arts , in which Seldes argued against conservative tendencies that excluded artists in the popular arts, such as Herriman and Chaplin, from being considered alongside traditional artists. Krazy Kat was the subject of a chapter entitled The Krazy Kat That Walks by Himself , which is the most famous piece of writing about the strip and the earliest example of a critic from the world of high art giving legitimacy to the comic strip medium. Vanity Fair inducted Herriman into its Hall of Fame in the April 42 issue.         Hearst, an admirer of Krazy Kat, had given Herriman a lifetime contract with his company ": null
    },
    {
        "King Features Syndicate": "king features syndicate"
    },
    {
        ", which gave Herriman the security to live anywhere he wanted. In 42 he moved back to Hollywood, into a two-story Spanish-style home at 42 North Sierra Bonita, from where he made frequent visits to the Arizona desert. Herriman developed ties with members of the film industry; he knew ": null
    },
    {
        "Hal Roach": "hal roach"
    },
    {
        " Studio members ": null
    },
    {
        "Tom McNamara": "tom mcnamara"
    },
    {
        " and ": null
    },
    {
        " Beanie Walker": "h. m. walker"
    },
    {
        " from their newspaper days. Walker, Herrimans best friend, was the head writer on the  Our Gang  shorts. In the early 42s, Herriman occasionally drew his strips at the Roach Studio. He met celebrities, including ": null
    },
    {
        "Will Rogers": "will rogers"
    },
    {
        " and ": null
    },
    {
        "Frank Capra": "frank capra"
    },
    {
        ", and presented them with hand-colored drawings. He loved Charlie Chaplins films, and reviewed  The Gold Rush  in the magazine Motion Picture Classics in October 42          Autumn 42 saw the first daily installment of Stumble Inn, the first non-Krazy Kat strip Herriman had drawn since 42 A verbose strip whose Sundays were often overrun with prose, its lead characters were Uriah and Ida Stumble, who rented rooms to an assortment of strange characters. The daily strip was short-lived, but the Sundays edition lasted three years.     From August 42 until September 42 King Features required that Herriman design the Krazy Kat Sundays so that they could be run either as a full Sunday page or as two four-panel dailies. Herriman lamented intrusion on his page designs, and the artwork of the period took on a rushed look. He was made to focus on the strips characterization, and during this period, the Krazy—Ignatz—Offisa Pupp love triangle for which the strip is remembered became fully developed. Pupp pined for Krazy, Krazy loved Ignatz, and Ignatz hated Krazy and pelted the annoying Kat with a brick, and Pupp imprisoned Ignatz.     Throughout the late 42s, Herriman made frequent trips to ": null
    },
    {
        "Kayenta, Arizona": "kayenta, arizona"
    },
    {
        ", in ": null
    },
    {
        "Navajo": "navajo people"
    },
    {
        " country about  from Monument Valley. He also made winter trips to Mexico. The desert, Navajo artwork, and Mexican pottery and architecture became more prominent in Herrimans strips, and he sometimes used Spanish vocabulary in the dialogue. Herriman did little work on these excursions, and it is likely that he drew his strips in hurried bursts when in Hollywood.     Stumble Inn finished in late 42 and it was replaced with the domestic strip Us Husbands , which ran until the end of that year. In 42 Herriman took over the strip Embarrassing Moments, which had begun in 42 and had been drawn by several cartoonists. The strip eventually became Bernie Burns, in which embarrassing moments would happen to the title character. The strip appeared in few papers, and after it ended in 42 Herriman worked only on Krazy Kat, although he provided illustrations for Don Marquis popular Archy and Mehitabel, a series of books of poetry about a cat and a cockroach.     In 42 Herriman sold his first Hollywood home to a friend and moved his family to 42 Maravilla Drive, a Spanish-style mansion atop a hill. It was adorned with paintings of Southwest and Native themes, and had a Mexican-style garden paved with ": null
    },
    {
        "flagstone": "flagstone"
    },
    {
        "s and decorated with painted pots and tropical plants. Herriman later bought the lot across the street and turned it into a public park.     The 42s were a period of tragedy for Herriman. On September 42 42 his wife Mabel died after an automobile accident, and in 42 his youngest daughter Bobbie died unexpectedly at 42 After his wifes death, Herriman never remarried and lived in Los Angeles with his cats and dogs. He developed a close relationship with cartoonist James Swinnertons first wife Louise, with whom he frequently exchanged letters. Herriman underwent a kidney operation in spring 42 and during his ten-week convalescence King Features reran old Krazy Kat strips.          Krazy Kats popularity fell considerably over the years, and by the 42s it was running in only thirty-five newspapers, while its contemporaries such as  Bringing Up Father  were reportedly running in up to a thousand. Herriman realized his $42-per-week salary from Hearsts King Features Syndicate was far more than the revenue the strip could be generating, but Hearst refused Herrimans offer to take a pay cut. Hearst let it be known that Herriman was to continue the strip as long as he liked. From 42 Krazy Kat appeared in color, of which Herriman made bold use. He reduced the amount of hatchwork and used larger, more open panels.     Herriman died in his sleep in his home near Hollywood on April 42 42 after a long illness. An incompletely inked penciling of a weeks worth of daily strips was found on his drawing board. On his death certificate, the cause of death was listed as ": null
    },
    {
        "non-alcoholic": "non-alcoholic fatty liver disease"
    },
    {
        " cirrhosis": "cirrhosis"
    },
    {
        " of the liver , and despite his mixed-race heritage, he was listed as caucasian . The  New York Journal-American  ran a front-page obituary. His funeral at Little Church of Flowers at ": null
    },
    {
        "Forest Lawn Memorial Park": "forest lawn memorial park"
    },
    {
        " was attended by few. Cartoonist ": null
    },
    {
        "Harry Hershfield": "harry hershfield"
    },
    {
        " spoke at the funeral, saying, If ever there was a saint on earth, it was George Herriman . According to his request, his body was cremated and his remains were scattered over Monument Valley.     On June 42 42 two months after Herrimans death, the last of his completed Krazy Kat strips, a full-page Sunday, was printed. At the time, Hearst usually engaged new cartoonists when the artists of popular strips quit or died, but he made an exception for Herriman, as he felt that no one could take his place.              Herriman was described as self-deprecatingly modest, and he disliked being photographed. The New York Journal-Americans obituary described him as a devoted husband and father, of slight build, mild-mannered and an anonymous contributor to charities. He was generous to his friends, and sold his first Hollywood house, which he had bought for $42, to a friend for $42. Though a private person, he was said to be an entertaining host to his friends. He would sometimes stay silent during social occasions and would often leave the room to wash dishes, which he said he enjoyed as it gave him the opportunity to think. His favorite game was poker, which he particularly enjoyed playing with his fellow cartoonists.     Herriman had a great love of animals, and had a large number of dogs and cats; he had five dogs and thirteen cats in 42 He usually kept to a vegetarian diet, except when it made him feel too weak, and he refused to ride horses. He so admired ": null
    },
    {
        "Henry Ford": "henry ford"
    },
    {
        "s pacifist stance that he would only buy ": null
    },
    {
        "Ford": "ford motor company"
    },
    {
        " automobiles. He purchased a new model annually.     Herriman married his childhood sweetheart Mabel Lillian Bridge in Los Angeles on July 42 42 They had two daughters: Mabel , nicknamed Toodles , later Toots b. 42": null
    },
    {
        "cial identi": "cial identi"
    },
    {
        "novel4242comic strip42 ": null
    }
]