[
    {
        "        Georgian  is a ": null
    },
    {
        "Kartvelian language": "kartvelian language"
    },
    {
        " spoken by ": null
    },
    {
        "Georgians": "georgians"
    },
    {
        ". It is the ": null
    },
    {
        "official language": "official language"
    },
    {
        " of ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        ". Georgian is written in its own ": null
    },
    {
        "writing system": "writing system"
    },
    {
        ", the ": null
    },
    {
        "Georgian script": "georgian scripts"
    },
    {
        ". Georgian is the ": null
    },
    {
        "literary language": "literary language"
    },
    {
        " for all regional subgroups of Georgians, including those who speak other Kartvelian languages: ": null
    },
    {
        "Svans": "svan people"
    },
    {
        ", ": null
    },
    {
        "Mingrelians": "mingrelians"
    },
    {
        " and the ": null
    },
    {
        "Laz": "laz people"
    },
    {
        ".       Georgian is the most prevalent of the ": null
    },
    {
        "Kartvelian languages": "kartvelian languages"
    },
    {
        ", a family that also includes ": null
    },
    {
        "Svan": "svan language"
    },
    {
        " and ": null
    },
    {
        "Megrelian": "megrelian language"
    },
    {
        " and ": null
    },
    {
        "Laz": "laz language"
    },
    {
        " .          Dialects of Georgian are from ": null
    },
    {
        "Imereti": "imereti"
    },
    {
        ", ": null
    },
    {
        "Racha": "racha"
    },
    {
        "-": null
    },
    {
        "Lechkhumi": "lechkhumi"
    },
    {
        ", ": null
    },
    {
        "Guria": "guria"
    },
    {
        ", ": null
    },
    {
        "Adjara": "adjara"
    },
    {
        ", ": null
    },
    {
        "Imerkhevi": "imerkhevi"
    },
    {
        " , ": null
    },
    {
        "Kartli": "kartli"
    },
    {
        ", ": null
    },
    {
        "Kakheti": "kakheti"
    },
    {
        ", ": null
    },
    {
        "Saingilo": "saingilo"
    },
    {
        " , ": null
    },
    {
        "Tusheti": "tusheti"
    },
    {
        ", ": null
    },
    {
        "Khevsureti": "khevsureti"
    },
    {
        ", ": null
    },
    {
        "Khevi": "khevi"
    },
    {
        ", ": null
    },
    {
        "Pshavi": "pshavi"
    },
    {
        ", ": null
    },
    {
        "Fereydan": "fereydan"
    },
    {
        " , ": null
    },
    {
        "Mtiuleti": "mtiuleti"
    },
    {
        " and ": null
    },
    {
        "Meskheti": "meskheti"
    },
    {
        ".                  The history of the Georgian language can conventionally be divided into:   Early ": null
    },
    {
        "Old Georgian": "old georgian language"
    },
    {
        ": 42th–42th centuries   Classical Old Georgian: 42th–42th centuries   Middle Georgian: 42th/42th–42th/42th centuries   Modern Georgian: 42th/42th century  – present     Georgian shares an ": null
    },
    {
        "ancestral language": "proto-kartvelian language"
    },
    {
        " with ": null
    },
    {
        "Mingrelian": "mingrelian language"
    },
    {
        "/": null
    },
    {
        "Laz": "laz language"
    },
    {
        " and ": null
    },
    {
        "Svan": "svan language"
    },
    {
        ". Georgian as separate from the other Kartvelian languages would have emerged in the 42st millennium BC in the area known later as the ": null
    },
    {
        "Kingdom of Iberia": "kingdom of iberia"
    },
    {
        ". The earliest allusion to spoken Georgian may be a passage of the ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " grammarian ": null
    },
    {
        "Marcus Cornelius Fronto": "marcus cornelius fronto"
    },
    {
        " in the 42nd century: Fronto imagines the Iberians addressing the emperor ": null
    },
    {
        "Marcus Aurelius": "marcus aurelius"
    },
    {
        " in their incomprehensible tongue . Braund, David , Georgia in Antiquity; a History of Colchis and Transcaucasian Iberia, 42 B.C.  – A.D. 42, p. 42 ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ",      The evolution of Georgian into a written language was a consequence of the conversion of the Georgian elite to Christianity in the mid42th century. The new literary language was constructed on an already well-established cultural infrastructure, appropriating the functions, conventions, and status of ": null
    },
    {
        "Aramaic": "aramaic language"
    },
    {
        ", the literary language of pagan Georgia, and the new national religion. ": null
    },
    {
        "Tuite, Kevin": "kevin tuite"
    },
    {
        ", Early Georgian , pp. 4242 in: Woodard, Roger D. , The Ancient Languages of Asia Minor. ": null
    },
    {
        "Cambridge University Press": "cambridge university press"
    },
    {
        ",  The first Georgian texts are inscriptions and ": null
    },
    {
        "palimpsest": "palimpsest"
    },
    {
        "s dating to the 42th century. Georgian has a rich literary tradition. The oldest surviving literary work in Georgian is the 42th century  Martyrdom of the Holy Queen Shushanik   by ": null
    },
    {
        "Iakob Tsurtaveli": "iakob tsurtaveli"
    },
    {
        ".        In the 42th century, Old Georgian gives rise to Middle Georgian, the literary language of the medieval ": null
    },
    {
        "kingdom of Georgia": "kingdom of georgia"
    },
    {
        ". The Georgian national epic, ": null
    },
    {
        "Shota Rustaveli": "shota rustaveli"
    },
    {
        "s  The Knight in the Panthers Skin  , dates from the 42th century.     In 42  Alphabetum Ibericum sive Georgianum cum Oratione  and  Dittionario giorgiano e italiano  were the first two books printed in the Georgian language using ": null
    },
    {
        "movable type": "movable type"
    },
    {
        " in ": null
    },
    {
        "Rome": "rome"
    },
    {
        " supported by the ": null
    },
    {
        "Congregation for the Evangelization of Peoples": "congregation for the evangelization of peoples"
    },
    {
        " of the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        " for their evangelical movement in Georgian kingdoms. This marked the beginning of the modern Georgian language.           Symbols on the left are those of the ": null
    },
    {
        "IPA": "help:ipa"
    },
    {
        " and those on the right are of the ": null
    },
    {
        "modern Georgian alphabet": "georgian scriptsmodern georgian alphabet"
    },
    {
        ".        Opinions differ on the aspiration of , as it is non-contrastive.     Opinions differ on how to classify  and ;  classifies them as post-velar,  argues that they range from velar to uvular according to context.     Former   has merged with  , leaving only the latter.     The glottalization of the ejectives is rather light, and in many romanization systems it is not marked, for transcriptions such as ejective p, t, ts, ch, k and q, against aspirated p‘, t‘, ts‘, ch‘ and k‘ .     The coronal occlusives  are variously described as apical dental, laminal alveolar, and dental .              ": null
    },
    {
        "Prosody": "prosody"
    },
    {
        " in Georgian involves stress, intonation, and rhythm. Stress is very weak, and linguists disagree as to where stress occurs in words.  Jun, Vicenik, and Lofstedt have proposed that Georgian stress and intonation are the result of ": null
    },
    {
        "pitch accent": "pitch accent"
    },
    {
        "s on the first syllable of a word and near the end of a phrase.  The rhythm of Georgian speech is ": null
    },
    {
        "syllable-timed": "isochronysyllable timing"
    },
    {
        ".        Georgian contains many harmonic clusters involving two consonants of a similar type which are pronounced with only a single release; e.g.  bgera ,  tskhovreba , and  tsqali .  There are also frequent ": null
    },
    {
        "consonant cluster": "consonant cluster"
    },
    {
        "s, sometimes involving more than six consonants in a row, as may be seen in words like  gvprtskvni and  mtsvrtneli .     Vicenik has observed that Georgian vowels following ejective stops have ": null
    },
    {
        "creaky voice": "creaky voice"
    },
    {
        " and suggests this may be one cue distinguishing ejectives from their aspirated and voiced counterparts.                    Georgian has been written in a variety of scripts over its history. Currently the  Mkhedruli  or Military script is almost completely dominant; the others are used mostly in religious documents and architecture.     Mkhedruli has 42 letters in common use; a half dozen more are obsolete in Georgian, though still used in other alphabets, like Mingrelian, Laz, and Svan. The letters of Mkhedruli correspond closely to the phonemes of the Georgian language.     According to the traditional account written down by ": null
    },
    {
        "Leonti Mroveli": "leonti mroveli"
    },
    {
        " in the 42th century, the first Georgian script was created by the first ruler of the ": null
    },
    {
        "Kingdom of Iberia": "kingdom of iberia"
    },
    {
        ", ": null
    },
    {
        "Pharnavaz": "pharnavaz i of iberia"
    },
    {
        ", in the 42rd century BC. However, the first examples of a Georgian script date from the 42th century AD. There are now three Georgian scripts, called  Asomtavruli  capitals ,  Nuskhuri  small letters , and Mkhedruli. The first two are used together as upper and lower case in the writings of the ": null
    },
    {
        "Georgian Orthodox Church": "georgian orthodox church"
    },
    {
        " and together are called Khutsuri priests .     In Mkhedruli, there is no case. Sometimes, however, a capital-like effect, called Mtavruli, title or heading , is achieved by modifying the letters so that their vertical sizes are identical and they rest on the baseline with no descenders. These capital-like letters are often used in page headings, chapter titles, monumental inscriptions, and the like.               This is the Georgian standard  Microsoft keyboard layout. The standard Windows keyboard is essentially that of manual ": null
    },
    {
        "typewriter": "typewriter"
    },
    {
        "s.                   Georgian is an ": null
    },
    {
        "agglutinative language": "agglutinative languages"
    },
    {
        ". There are certain prefixes and suffixes that are joined together in order to build a verb. In some cases, there can be up to eight different morphemes in one verb at the same time. An example can be ageshenebinat . The verb can be broken down to parts: a-g-e-shen-eb-in-a-t. Each morpheme here contributes to the meaning of the verb tense or the person who has performed the verb. The verb conjugation also exhibits ": null
    },
    {
        "polypersonalism": "polypersonalism"
    },
    {
        "; a verb may potentially include morphemes representing both the subject and the object.       In Georgian ": null
    },
    {
        "morphophonology": "morphophonology"
    },
    {
        ", ": null
    },
    {
        "syncope": "syncope"
    },
    {
        " is a common phenomenon. When a suffix  is attached to a word which has either of the vowels a or e in the last syllable, this vowel is, in most words, lost. For example, megobari means friend . To say friends , one says, megobØrebi , with the loss of a in the last syllable of the word root.       Georgian has seven noun cases: ": null
    },
    {
        "nominative": "nominative case"
    },
    {
        ", ": null
    },
    {
        "ergative": "ergative case"
    },
    {
        ", ": null
    },
    {
        "dative": "dative case"
    },
    {
        ", ": null
    },
    {
        "genitive": "genitive case"
    },
    {
        ", ": null
    },
    {
        "instrumental": "instrumental case"
    },
    {
        ", ": null
    },
    {
        "adverbial": "adverbial case"
    },
    {
        " and ": null
    },
    {
        "vocative": "vocative case"
    },
    {
        ". An interesting feature of Georgian is that, while the subject of a sentence is generally in the nominative case, and the object is in the ": null
    },
    {
        "accusative case": "accusative case"
    },
    {
        " , in Georgian, one can find this reversed in many situations . This is called the ": null
    },
    {
        "dative construction": "dative construction"
    },
    {
        ". In the past tense of the transitive verbs, and in the present tense of the verb to know , the subject is in the ergative case.       Georgian is a ": null
    },
    {
        "left-branching": "left-branching"
    },
    {
        " language, in which adjectives precede nouns, ": null
    },
    {
        "possessors": "possession"
    },
    {
        " precede possessions, objects normally precede verbs, and ": null
    },
    {
        "postpositions": "postpositions"
    },
    {
        " are used instead of ": null
    },
    {
        "prepositions": "prepositions"
    },
    {
        ".   Each postposition requires the modified noun to be in a specific case.    Georgian is a ": null
    },
    {
        "pro-drop": "pro-drop"
    },
    {
        " language: both subject and object pronouns are frequently omitted except for emphasis or to resolve ambiguity.   A study by Skopeteas et al. concluded that Georgian word order tends to place the ": null
    },
    {
        "focus": "focus"
    },
    {
        " of a sentence immediately before the verb, and the ": null
    },
    {
        "topic": "topic"
    },
    {
        " before the focus. A subject–object–verb  word order is common in idiomatic expressions and when the focus of a sentence is on the object. A subject–verb–object  word order is common when the focus is on the subject, or in longer sentences. Object-initial word orders  are also possible, but less common. Verb-initial word orders including both subject and object  are extremely rare.    Georgian has no ": null
    },
    {
        "grammatical gender": "grammatical gender"
    },
    {
        "; even the pronouns are gender-neutral.   Georgian has no ": null
    },
    {
        "article": "article"
    },
    {
        "s. Therefore, for example, guest , a guest and the guest are said in the same way. In ": null
    },
    {
        "relative clause": "relative clause"
    },
    {
        "s, however, it is possible to establish the meaning of the definite article through use of some particles.       Georgian has a rich ": null
    },
    {
        "word-derivation": "derivation"
    },
    {
        " system. By using a root, and adding some definite prefixes and suffixes, one can derive many nouns and adjectives from the root. For example, from the root -kartv-, the following words can be derived: Kartveli , Kartuli and Sakartvelo .     Most ": null
    },
    {
        "Georgian surnames": "georgian surnames"
    },
    {
        " end in -dze , -shvili , -ia , -ani , -uri , etc. The ending -eli is a particle of nobility, equivalent to French de, German von or Polish -ski.     Georgian has a ": null
    },
    {
        "vigesimal": "vigesimal"
    },
    {
        " numeric system like ": null
    },
    {
        "Basque": "basque language"
    },
    {
        " or French, based on the counting system of 42 In order to express a number greater than 42 and less than 42 first the number of 42s in the number is stated and the remaining number is added. For example, 42 is expressed as  - otkh-m-ots-da-tsameti .     One of the most important Georgian dictionaries is the  Explanatory dictionary of the Georgian language  . It consists of eight volumes and about 42 words. It was produced between 42 and 42 by a team of linguists under the direction of ": null
    },
    {
        "Arnold Chikobava": "arnold chikobava"
    },
    {
        ".           Georgian has a word derivation system, which allows the derivation of nouns from verb roots both with prefixes and suffixes, for example:     From the root -tser- , the words tserili and mtserali are derived.   From the root -tsa- , the word gadatsema is derived.   From the root -tsda- , the word gamotsda is derived.   From the root -gav- , the words msgavsi and msgavseba are derived.   From the root -shen- , the word shenoba is derived.   From the root -tskh- , the word namtskhvari is derived.   From the root -tsiv- , the word matsivari is derived.   From the root -pr- , the words tvitmprinavi and aprena are derived.     It is also possible to derive verbs from nouns:     From the noun -omi- , the verb omob is derived.   From the noun -sadili- , the verb sadilob is derived.   From the noun -sauzme , the verb tsasauzmeba is derived; the preverb tsa- in Georgian could add the meaning VERBing a little .   From the noun -sakhli- , the verb gadasakhleba is derived.     Likewise, verbs can be derived from adjectives, for example:     From the adjective -tsiteli- , the verb gatsitleba is derived. This kind of derivation can be done with many adjectives in Georgian.   From the adjective -brma , the verbs dabrmaveba are derived.   From the adjective -lamazi- , the verb galamazeba is derived.       In Georgian many nouns and adjectives begin with two or more contiguous consonants. This is because most syllables in the language begin with certain two consonants.   Some examples of words that begin with double consonants are:   , , water   , , correct   , , milk   , , hair   , , mountain   , , horse   There are also many words that begin with three contiguous consonants:   , , you   , , green   , , nose   , , sweet   , , painful   , , north   There are also a few words in Georgian that begin with four contiguous consonants. Examples are:   , , murderer   , , dead   , , drunk   ; , row   There can also be some extreme cases in Georgian. For example, the following word begins with six contiguous consonants:   , , trainer   And the following words begin with eight consonants:    , you peel us    , you tear us       Article 42 of the ": null
    },
    {
        "Universal Declaration of Human Rights": "universal declaration of human rights"
    },
    {
        " in Georgian:      Transliteration:   qvela adamiani ibadeba tavisupali da tanastsori tavisi ghirsebita da uplebebit. mat minichebuli akvt goneba da sindisi da ertmanetis mimart unda iktseodnen dzmobis suliskvetebit.   Translation:   All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood. ": null
    }
]