[
    {
        "   George Major was a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " theologian of the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        ". He was born in ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        " and died at ": null
    },
    {
        "Wittenberg": "wittenberg"
    },
    {
        ".       At the age of nine Major was sent to Wittenberg, and in 42 entered the university there. When Cruciger returned to Wittenberg in 42 Major was appointed rector of the Johannisschule in ": null
    },
    {
        "Magdeburg": "magdeburg"
    },
    {
        ", but in 42 he became court preacher at Wittenberg and was ordained by ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        ".     In 42 he was made professor in the theological faculty, in which his authority increased to such an extent that in the following year the elector sent him to the ": null
    },
    {
        "Conference of Regensburg": "conference of regensburg"
    },
    {
        ", where he was soon captivated by the personality of ": null
    },
    {
        "Butzer": "butzer"
    },
    {
        ". Like ": null
    },
    {
        "Philipp Melanchthon": "philipp melanchthon"
    },
    {
        ", he fled before the disastrous close of the ": null
    },
    {
        "Schmalkald war": "schmalkald war"
    },
    {
        ", and found refuge in Magdeburg. In the summer of 42 he returned to Wittenberg, and in the same year became cathedral superintendent at ": null
    },
    {
        "Merseburg": "merseburg"
    },
    {
        ", although he resumed his activity at the university in the following year.     In the negotiations of the ": null
    },
    {
        "Augsburg Interim": "augsburg interim"
    },
    {
        ", he took the part of Melanchthon in first opposing it and then making concessions. This attitude incurred the enmity of the opponents of the Interim, especially after he cancelled a number of passages in the second edition of his Psalterium in which he had violently attacked the position of ": null
    },
    {
        "Maurice, Elector of Saxony": "maurice, elector of saxony"
    },
    {
        ", whom he now requested to prohibit all polemical treatises proceeding from Magdeburg, while he condemned the preachers of Torgau who were imprisoned in Wittenberg on account of their opposition to the Interim. He was even accused of accepting bribes from Maurice.     In 42 Count Hans Georg, who favored the Interim, appointed him superintendent of ": null
    },
    {
        "Eisleben": "eisleben"
    },
    {
        ", on the recommendation of ": null
    },
    {
        "Melchior Kling": "melchior kling"
    },
    {
        ". The orthodox clergy of the County of ": null
    },
    {
        "Mansfeld": "mansfeld"
    },
    {
        ", however, immediately suspected him of being an interimist and adiaphorist, and he tried to defend his position in public, but his apology resulted in the so-called ": null
    },
    {
        "Majoristic Controversy": "majoristic controversy"
    },
    {
        ".     At ": null
    },
    {
        "Christmas": "christmas"
    },
    {
        ", 42 Count Albrecht expelled him without trial and he fled to Wittenberg, where he resumed his activity as professor and member of the Wittenberg ": null
    },
    {
        "Consistory": "consistory"
    },
    {
        ". Thence forth he was an important and active member in the circle of the Wittenberg ": null
    },
    {
        "Philippists": "philippists"
    },
    {
        ".     From 42 to 42 he was dean of the theological faculty and repeatedly held the rectorate of the university. He lived long enough to experience the first overthrow of ": null
    },
    {
        "Crypto-Calvinism": "crypto-calvinism"
    },
    {
        " in the ": null
    },
    {
        "Electorate of Saxony": "electorate of saxony"
    },
    {
        ", and Paul Crell, his son-in-law, signed for him at Torgau in May 42 the articles which repudiated ": null
    },
    {
        "Calvinism": "calvinism"
    },
    {
        " and acknowledged the unity of Luther and Melanchthon.       Among his writings, special mention may be made of the following:     A text edition of Justini ex Trogo Pompejo historia ;   an edition of Luthers smaller catechism in Latin and Low German ;   Sententiae veterum poetarum ;   Quaestiones rhetoricae ;   Vita Patrum ;   Psalterium Davidis juxta translationem veterem repurgatum ;   De origine et auctoritate verbi Dei ;   Commonefactio ad ecclesiam catholicam, orthodoxam, de fugiendis . . . blasphemiis Samosatenicis ;     as well as commentaries on the Pauline epistles and homilies on the pericopes.                                                ": null
    }
]