[
    {
        "              Mary Ann Evans , known by her ": null
    },
    {
        "pen name": "pen name"
    },
    {
        " George Eliot, was an English novelist, poet, journalist, translator and one of the leading writers of the ": null
    },
    {
        "Victorian era": "victorian era"
    },
    {
        ". She wrote seven novels, including  Adam Bede  ,  The Mill on the Floss  ,  Silas Marner  ,  Romola  ,  Middlemarch  and  Daniel Deronda  , most of which are set in provincial England and known for their ": null
    },
    {
        "realism": "literary realism"
    },
    {
        " and ": null
    },
    {
        "psychological insight": "psychological fiction"
    },
    {
        ".     Although female authors were published under their own names during her lifetime, she wanted to escape the stereotype of womens writing being limited to lighthearted romances. She also wanted to have her fiction judged separately from her already extensive and widely known work as an editor and critic. Another factor in her use of a pen name may have been a desire to shield her private life from public scrutiny, thus avoiding the scandal that would have arisen because of her relationship with the married ": null
    },
    {
        "George Henry Lewes": "george henry lewes"
    },
    {
        ". Karl, Frederick R. George Eliot: Voice of a Century. Norton, 1995. pp. 237–38.     Eliots  Middlemarch  has been described by the novelists ": null
    },
    {
        "Martin Amis": "martin amis"
    },
    {
        " Long, Camilla. , The Times, 24 January 2010, p. 4: Theyve produced the greatest writer in the English language ever, George Eliot, and arguably the third greatest, Jane Austen, and certainly the greatest novel, Middlemarch... and ": null
    },
    {
        "Julian Barnes": "julian barnes"
    },
    {
        "  as the greatest novel in the English language.           Mary Ann Evans was born in ": null
    },
    {
        "Nuneaton": "nuneaton"
    },
    {
        ", Warwickshire, England. She was the third child of Robert Evans and Christiana Evans , the daughter of a local mill-owner. Mary Anns name was sometimes shortened to Marian.  According to a University of Virginia research forum published here, her baptismal records record the spelling as Mary Anne, and she uses this spelling in her earliest letters. Around 1857, she began to use Mary Ann. In 1859, she was using Marian, but she reverted to Mary Ann in 1880.  Her full siblings were Christiana, known as Chrissey , Isaac , and twin brothers who died a few days after birth in March 1821. She also had a half-brother, Robert , and half-sister, Fanny , from her fathers previous marriage to Harriet Poynton . Her father Robert Evans, of Welsh ancestry, was the manager of the ": null
    },
    {
        "Arbury Hall": "arbury hall"
    },
    {
        " Estate for the ": null
    },
    {
        "Newdigate family": "newdigate family"
    },
    {
        " in Warwickshire, and Mary Ann was born on the estate at South Farm. In early 1820 the family moved to a house named ": null
    },
    {
        "Griff House": "griff house"
    },
    {
        ", between ": null
    },
    {
        "Nuneaton": "nuneaton"
    },
    {
        " and ": null
    },
    {
        "Bedworth": "bedworth"
    },
    {
        ".      The young Evans was a voracious reader and obviously intelligent. Because she was not considered physically beautiful, Evans was not thought to have much chance of marriage, and this, coupled with her intelligence, led her father to invest in an education not often afforded women. Karl, Frederick R. George Eliot: Voice of a Century. Norton, 1995. pp. 24–25 From ages five to nine, she boarded with her sister Chrissey at Miss Lathams school in ": null
    },
    {
        "Attleborough": "attleborough, warwickshire"
    },
    {
        ", from ages nine to thirteen at Mrs. Wallingtons school in Nuneaton, and from ages thirteen to sixteen at Miss Franklins school in ": null
    },
    {
        "Coventry": "coventry"
    },
    {
        ". At Mrs. Wallingtons school, she was taught by the ": null
    },
    {
        "evangelical": "evangelicalism"
    },
    {
        " Maria Lewis — to whom her earliest surviving letters are addressed. In the religious atmosphere of the ": null
    },
    {
        "Misses Franklins": "mary franklin"
    },
    {
        "school, Evans was exposed to a quiet, disciplined belief opposed to evangelicalism. Karl, Frederick R. George Eliot: Voice of a Century. Norton, 1995. p. 31     After age sixteen, Evans had little formal education. Karl, Frederick R. George Eliot: Voice of a Century. Norton, 1995. p. 52 Thanks to her fathers important role on the estate, she was allowed access to the library of Arbury Hall, which greatly aided her self-education and breadth of learning. Her classical education left its mark; Christopher Stray has observed that George Eliots novels draw heavily on Greek literature , and her themes are often influenced by Greek tragedy . Christopher Stray Classics Transformed, p. 81 Her frequent visits to the estate also allowed her to contrast the wealth in which the local landowner lived with the lives of the often much poorer people on the estate, and different lives lived in parallel would reappear in many of her works. The other important early influence in her life was religion. She was brought up within a ": null
    },
    {
        "low church": "low church"
    },
    {
        " Anglican": "anglican"
    },
    {
        " family, but at that time the ": null
    },
    {
        "Midlands": "english midlands"
    },
    {
        " was an area with a growing number of ": null
    },
    {
        "religious dissenters": "english dissenters"
    },
    {
        ".       In 1836 her mother died and Evans returned home to act as housekeeper, but she continued correspondence with her tutor Maria Lewis. When she was 21, her brother Isaac married and took over the family home, so Evans and her father moved to ": null
    },
    {
        "Foleshill": "foleshill"
    },
    {
        " near ": null
    },
    {
        "Coventry": "coventry"
    },
    {
        ". The closeness to Coventry society brought new influences, most notably those of Charles and Cara Bray. ": null
    },
    {
        "Charles Bray": "charles bray"
    },
    {
        " had become rich as a ribbon manufacturer and had used his wealth in the building of schools and in other philanthropic causes. Evans, who had been struggling with religious doubts for some time, became intimate friends with the radical, free-thinking Brays, whose Rosehill home was a haven for people who held and debated radical views. The people whom the young woman met at the Brays house included ": null
    },
    {
        "Robert Owen": "robert owen"
    },
    {
        ", ": null
    },
    {
        "Herbert Spencer": "herbert spencer"
    },
    {
        ", ": null
    },
    {
        "Harriet Martineau": "harriet martineau"
    },
    {
        ", and ": null
    },
    {
        "Ralph Waldo Emerson": "ralph waldo emerson"
    },
    {
        ". Through this society Evans was introduced to more liberal and agnostic theologies and to writers such as ": null
    },
    {
        "David Strauss": "david strauss"
    },
    {
        " and ": null
    },
    {
        "Ludwig Feuerbach": "ludwig feuerbach"
    },
    {
        ", who cast doubt on the literal truth of Biblical stories. In fact, her first major literary work was an English translation of Strausss The Life of Jesus , which she completed after it had been left incomplete by another member of the Rosehill Circle ; later she translated Feuerbach’s The Essence of Christianity . As a product of their friendship, Bray published some of Evanss earliest writing, such as reviews, in his newspaper the  Coventry Herald and Observer .      When Evans began to question her religious faith, her father threatened to throw her out of the house, but his threat was not carried out. Instead, she respectfully attended church and continued to keep house for him until his death in 1849, when she was 30. Five days after her fathers funeral, she travelled to Switzerland with the Brays. She decided to stay on in ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        " alone, living first on the lake at Plongeon and then on the second floor of a house owned by her friends François and Juliet dAlbert Durade on the rue de Chanoines . She commented happily that one feels in a downy nest high up in a good old tree . Her stay is commemorated by a plaque on the building. While residing there, she read avidly and took long walks in the beautiful Swiss countryside, which was a great inspiration to her. François Durade painted her portrait there as well. Hardy BN. George Elliot: A Critics Biography. Continuum. London 2006 pp42-45.     Westminster Review ": null
    },
    {
        "John Chapman": "john chapman"
    },
    {
        ", the radical publisher whom she had met earlier at Rosehill and who had published her Strauss translation. Chapman had recently purchased the campaigning, left-wing journal  The Westminster Review . Evans became its assistant editor in 1851 after joining just a year earlier. Evans writings for the paper were comments on her views of society and the Victorian way of Thinking. Hazel Mackenzie-A Dialogue of Forms: The Display of Thinking in George Eliot’s ‘Poetry and Prose, From the Notebook of an Eccentric’ and Impressions of Theophrastus Such- She was sympathetic to the lower classes and criticised organised religion throughout her articles and reviews and commented on contemporary ideas of the time. Bodenheimer, Rosemarie- Before George Eliot: Marian Evans and the Periodical Press/Modernizing George Eliot: The Writer as Artist, Intellectual, Proto-Modernist, Cultural CriticVictorian Studies; Bloomington Vol. 56, Iss. 4, . Much of this was drawn from her own experiences and knowledge and she used this to critique other ideas and organisations. This led to her writing being viewed as authentic and wise but not too obviously opinionated. Evans’ also focused on the business side of the Review with attempts to change its layout and design. Dillane, Fionnuala -Before George Eliot : Marian Evans and the Periodical Press- Cambridge University Press 2013-08-15 Although Chapman was officially the editor, it was Evans who did most of the work of producing the journal, contributing many essays and reviews beginning with the January 1852 issue and continuing until the end of her employment at the Review in the first half of 1854. Ashton, Rosemary. George Eliot: A Life. London: Penguin, 1997. 88ff. p110. Eliot sympathized with the ": null
    },
    {
        "1848 Revolutions": "1848 revolutions"
    },
    {
        " throughout continental Europe, and even hoped that the Italians would chase the odious Austrians out of ": null
    },
    {
        "Lombardy": "kingdom of lombardy–venetia"
    },
    {
        " and that decayed monarchs would be pensioned off, although she believed a gradual reformist approach to social problems was best for England.     Women writers were common at the time, but Evanss role as the female editor of a literary magazine was quite unusual. During this period, she formed a number of unreciprocated emotional attachments, including one with Chapman , and another with ": null
    },
    {
        "Herbert Spencer": "herbert spencer"
    },
    {
        ".            The philosopher and critic ": null
    },
    {
        "George Henry Lewes": "george henry lewes"
    },
    {
        " met Evans in 1851, and by 1854 they had decided to live together. Lewes was already married to Agnes Jervis, although in an ": null
    },
    {
        "open marriage": "open marriage"
    },
    {
        ". In addition to the three children they had together, Agnes also had four children by ": null
    },
    {
        "Thornton Leigh Hunt": "thornton leigh hunt"
    },
    {
        ".  In July 1854, Lewes and Evans travelled to ": null
    },
    {
        "Weimar": "weimar"
    },
    {
        " and Berlin together for the purpose of research. Before going to Germany, Evans continued her theological work with a translation of Feuerbachs  The Essence of Christianity , and while abroad she wrote essays and worked on her translation of ": null
    },
    {
        "Baruch Spinozas": "baruch spinoza"
    },
    {
        "  Ethics , which she completed in 1856, but which was not published in her lifetime. Hughes, Kathryn, George Eliot: The Last Victorian, p. 168.     The trip to Germany also served as a honeymoon for Evans and Lewes, who subsequently considered themselves married. Evans began to refer to Lewes as her husband and to sign her name as Mary Ann Evans Lewes. Eventually, after Lewes death, she legally changed her name to Mary Ann Evans Lewes.  It was not unusual for men in Victorian society to have adulterous affairs; ": null
    },
    {
        "Charles Bray": "charles bray"
    },
    {
        ", John Chapman, ": null
    },
    {
        "Friedrich Engels": "friedrich engels"
    },
    {
        ", and ": null
    },
    {
        "Wilkie Collins": "wilkie collins"
    },
    {
        " all had adulterous affairs, conducted with discretion. By contrast, Lewes and Evans declined to conceal their relationship, and it was this refusal which perhaps gave an additional edge to the reproaches of contemporary moralists.       While continuing to contribute pieces to the Westminster Review, Evans resolved to become a novelist, and set out a pertinent manifesto in one of her last essays for the Review, Silly Novels by Lady Novelists  text from The Westminster Review Vol. 66 old series, Vol. 10 new series : 442–61. . The essay criticised the trivial and ridiculous plots of contemporary fiction written by women. In other essays, she praised the ": null
    },
    {
        "realism": "realism"
    },
    {
        " of novels that were being written in Europe at the time, an emphasis on realistic storytelling confirmed in her own subsequent fiction. She also adopted a nom-de-plume, George Eliot; as she explained to her biographer J. W. Cross, George was Lewess forename, and Eliot was a good mouth-filling, easily pronounced word Cross , vol 1, p. 431     In 1857, when she was 37 years of age, The Sad Fortunes of the Reverend Amos Barton , the first of the three stories comprising  Scenes of Clerical Life , and the first work of George Eliot , was published in  Blackwoods Magazine .  The Scenes , was well received, and was widely believed to have been written by a country ": null
    },
    {
        "parson": "parson"
    },
    {
        ", or perhaps the wife of a parson. Evanss first complete novel, published in 1859, was  Adam Bede . It was an instant success, and prompted yet more intense curiosity as to the authors identity: there was even a pretender to the authorship, one Joseph Liggins. This public interest subsequently led to Marian Evans Lewess acknowledgment that it was she who stood behind the pseudonym George Eliot.     The revelations about Eliots private life surprised and shocked many of her admiring readers, but this did not affect her popularity as a novelist. Her relationship with Lewes afforded her the encouragement and stability she needed to write fiction, but it would be some time before the couple were accepted into polite society. Acceptance was finally confirmed in 1877 when they were introduced to ": null
    },
    {
        "Princess Louise": "princess louise, duchess of argyll"
    },
    {
        ", the daughter of ": null
    },
    {
        "Queen Victoria": "queen victoria"
    },
    {
        ". The queen herself was an avid reader of all of Eliots novels and was so impressed with Adam Bede that she commissioned the artist ": null
    },
    {
        "Edward Henry Corbould": "edward henry corbould"
    },
    {
        " to paint scenes from the book. , Oxford Dictionary of National Biography, Oxford University Press, 2004        When the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " broke out, Eliot expressed sympathy with the ": null
    },
    {
        "North": "union"
    },
    {
        ", which was a rare stance in England at the time.   In 1868 she supported ": null
    },
    {
        "Richard Congreves": "richard congreve"
    },
    {
        "protests against Britains imperial policy toward Ireland and her view of the growing movement in support of ": null
    },
    {
        "Irish Home Rule": "irish home rule"
    },
    {
        " was positive.     She was influenced by the writings of ": null
    },
    {
        "John Stuart Mill": "john stuart mill"
    },
    {
        " and read all of his major works as they were published.  In Mills Subjection of Women she judged the second chapter excoriating the laws which oppress married women excellent. She was supportive of Mills parliamentary run, but believed that the electorate was unlikely to vote for a philosopher and was surprised when he won. While Mill served in parliament, she expressed her agreement with Mills efforts on behalf of female suffrage, being inclined to hope for much good from the serious presentation of womens claims before Parliament.  In a letter to ": null
    },
    {
        "John Morley": "john morley"
    },
    {
        ", she declared her support for plans which held out reasonable promise of tending to establish as far as possible an equivalence of advantage for the two sexes, as to education and the possibilities of free development , and dismissed ": null
    },
    {
        "appeals to nature": "appeal to nature"
    },
    {
        " in explaining womens lower status. In 1870, she responded enthusiastically to ": null
    },
    {
        "Lady Amberleys": "katharine russell, viscountess amberley"
    },
    {
        "feminist lecture on the claims of women for education, occupations, equality in marriage, and child custody.     After the success of Adam Bede, Eliot continued to write popular novels for the next fifteen years. Within a year of completing Adam Bede, she finished  The Mill on the Floss , dedicating the manuscript: To my beloved husband, George Henry Lewes, I give this MS. of my third book, written in the sixth year of our life together, at Holly Lodge, South Field, Wandsworth, and finished 21 March 1860.  Silas Marner  and  Romola  soon followed, and later  Felix Holt, the Radical  and her most acclaimed novel,  Middlemarch  .     Her last novel was  Daniel Deronda , published in 1876, after which she and Lewes moved to ": null
    },
    {
        "Witley": "witley"
    },
    {
        ", Surrey. By this time Lewess health was failing, and he died two years later, on 30 November 1878. Eliot spent the next two years editing Lewess final work, Life and Mind, for publication, and found solace and companionship with John Walter Cross, a Scottish commission agent 1881 census 20 years her junior, whose mother had recently died.            On 16 May 1880 Eliot married John Cross and again changed her name, this time to Mary Ann Cross. While the marriage courted some controversy due to the difference in ages, it pleased her brother Isaac, who had broken off relations with her when she had begun to live with Lewes, and now sent congratulations. While the couple were honeymooning in ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", Cross, in a fit of depression, jumped from the hotel balcony into the ": null
    },
    {
        "Grand Canal": "grand canal"
    },
    {
        ". He survived, and the newlyweds returned to England. They moved to a new house in Chelsea, but Eliot fell ill with a throat infection. This, coupled with the ": null
    },
    {
        "kidney disease": "kidney disease"
    },
    {
        " with which she had been afflicted for several years, led to her death on 22 December 1880 at the age of 61.       Eliot was not buried in ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " because of her denial of the Christian faith and her adulterous affair with Lewes. She was buried in ": null
    },
    {
        "Highgate Cemetery": "highgate cemetery"
    },
    {
        " , Highgate, London, in the area reserved for societal outcasts, religious dissenters and agnostics, beside the love of her life, ": null
    },
    {
        "George Henry Lewes": "george henry lewes"
    },
    {
        ". The graves of ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        " and her friend Herbert Spencer are nearby. Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 . McFarland & Company, Inc., Publishers. Kindle Edition. In 1980, on the centenary of her death, a memorial stone was established for her in the ": null
    },
    {
        "Poets Corner": "poets corner"
    },
    {
        ".     Several landmarks in her birthplace of Nuneaton are named in her honour. These include The George Eliot School, Middlemarch Junior School, George Eliot Hospital ,  and George Eliot Road, in ": null
    },
    {
        "Foleshill": "foleshill"
    },
    {
        ", Coventry.          A statue of Eliot is in Newdegate Street, Nuneaton, and ": null
    },
    {
        "Nuneaton Museum & Art Gallery": "nuneaton museum  &  art gallery"
    },
    {
        " has a display of artifacts related to her.            Throughout her career, Eliot wrote with a politically astute pen. From  Adam Bede  to  The Mill on the Floss  and  Silas Marner , Eliot presented the cases of social outsiders and small-town persecution.  Felix Holt, the Radical  and  The Legend of Jubal  were overtly political, and political crisis is at the heart of  Middlemarch , in which she presents the stories of a number of inhabitants of a small English town on the eve of the ": null
    },
    {
        "Reform Bill of 1832": "reform act 1832"
    },
    {
        "; the novel is notable for its deep psychological insight and sophisticated character portraits. The roots of her realist philosophy can be found in her review of ": null
    },
    {
        "John Ruskins": "john ruskin"
    },
    {
        "  Modern Painters  in  Westminster Review  in 1856.     Readers in the Victorian era praised her novels for their depictions of rural society. Much of the material for her prose was drawn from her own experience. She shared with ": null
    },
    {
        "Wordsworth": "william wordsworth"
    },
    {
        " the belief that there was much value and beauty to be found in the mundane details of ordinary country life. Eliot did not, however, confine herself to stories of the English countryside.  Romola , an historical novel set in late fifteenth century ": null
    },
    {
        "Florence": "florence"
    },
    {
        ", was based on the life of the Italian priest ": null
    },
    {
        "Girolamo Savonarola": "girolamo savonarola"
    },
    {
        ". In The Spanish Gypsy, Eliot made a foray into verse, but her poetrys initial popularity has not endured.     Working as a translator, Eliot was exposed to German texts of religious, social, and moral philosophy such as ": null
    },
    {
        "Friedrich Strauss": "david strauss"
    },
    {
        "’s Life of Jesus, Feuerbach’s The Essence of Christianity, and Spinoza’s Ethics. Elements from these works show up in her fiction, much of which is written with her trademark sense of ": null
    },
    {
        "agnostic": "agnostic"
    },
    {
        " humanism": "humanism"
    },
    {
        ". She had taken particular notice of Feuerbach’s conception of Christianity, positing that our understanding of the nature of the divine was to be found ultimately in the nature of humanity projected onto a divine figure. An example of this philosophy appeared in her novel Romola, in which Eliot’s protagonist displayed a “surprisingly modern readiness to interpret religious language in humanist or secular ethical terms.”  Though Eliot herself was not religious, she had respect for religious tradition and its ability to maintain a sense of social order and morality.   The religious elements in her fiction also owe much to her upbringing, with the experiences of Maggie Tulliver from The Mill on the Floss sharing many similarities with the young Mary Ann Evans. Eliot also faced a quandary similar to that of Silas Marner, whose alienation from the church simultaneously meant his alienation from society. Because Eliot retained a vestigial respect for religion, German philosopher ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        " excoriated her system of morality for figuring sin as a debt that can be expiated through suffering, which he demeaned as characteristic of little moralistic females à la Eliot. Thomas J. Joudrey. The Defects of Perfectionism: Nietzsche, Eliot, and the Irrevocability of Wrong. Philological Quarterly 96.1 : 77-104.     She was at her most autobiographical in Looking Backwards, part of her final published work  Impressions of Theophrastus Such . By the time of  Daniel Deronda , Eliots sales were falling off, and she had faded from public view to some degree. This was not helped by the posthumous biography written by her husband, which portrayed a wonderful, almost saintly, woman totally at odds with the scandalous life people knew she had led. In the 20th century she was championed by a new breed of critics, most notably by ": null
    },
    {
        "Virginia Woolf": "virginia woolf"
    },
    {
        ", who called Middlemarch one of the few English novels written for grown-up people . Woolf, Virginia. George Eliot. The Common Reader. New York: Harcourt, Brace, and World, 1925. pp. 166–76. In 1994, literary critic ": null
    },
    {
        "Harold Bloom": "harold bloom"
    },
    {
        " placed Eliot among the most important Western writers of all time": "the western canon: the books and school of the ages"
    },
    {
        ". ": null
    },
    {
        "Bloom, Harold": "harold bloom"
    },
    {
        ". 1994.  The Western Canon: The Books and School of the Ages . p. 226. New York: Harcourt Brace. In a 2007 authors poll by  TIME , Middlemarch was voted the tenth greatest literary work ever written.  In 2015, writers from outside the UK voted it first among all British novels by a landslide .  The various film and television adaptations of Eliots books have re-introduced her to the wider reading public.            Adam Bede , 1859    The Mill on the Floss , 1860    Silas Marner , 1861    Romola , 1863    Felix Holt, the Radical , 1866    Middlemarch , 1871–72    Daniel Deronda , 1876       In a London Drawingroom, 1865   , 1866   The Choir Invisible, 1867   , 1868   Agatha, 1869   Brother and Sister, 1869   Armgart, 1871   Stradivarius, 1873   The Legend of Jubal, 1874   I Grant You Ample Leave, 1874   Arion, 1874   A Minor Prophet, 1874   A College Breakfast Party, 1879   The Death of Moses, 1879   , 1887       Digital facsimile of manuscript , MS Lowell 13, Houghton Library, Harvard University   Translation of   by ": null
    },
    {
        "David Strauss": "david strauss"
    },
    {
        ", 1846   Translation of  by ": null
    },
    {
        "Ludwig Feuerbach": "ludwig feuerbach"
    },
    {
        ", 1854   , 1855   , 1856    , 1856    Scenes of Clerical Life , 1857   The Sad Fortunes of the Rev. Amos Barton Mr Gilfils Love Story Janets Repentance  The Lifted Veil , 1859   , 1864   , 1865    Impressions of Theophrastus Such , 1879      ": null
    }
]