[
    {
        "         Geotechnics is the application of scientific methods and engineering principles to the acquisition, interpretation, and use of knowledge of materials of the ": null
    },
    {
        "Earths crust": "Earths Crust"
    },
    {
        " and earth materials for the solution of ": null
    },
    {
        "engineering": "Engineering"
    },
    {
        " problems and the design of engineering works. It is the applied science of predicting the behavior of the Earth, its various materials and processes towards making the Earth more suitable for human activities and development.     Geotechnics embraces the fields of ": null
    },
    {
        "soil mechanics": "Soil Mechanics"
    },
    {
        " and ": null
    },
    {
        "rock mechanics": "Rock Mechanics"
    },
    {
        ", and many of the aspects of ": null
    },
    {
        "geology": "Geology"
    },
    {
        ", ": null
    },
    {
        "geophysics": "Geophysics"
    },
    {
        ", ": null
    },
    {
        "hydrology": "Hydrology"
    },
    {
        ", and other related sciences. Geotechnics is practiced by both ": null
    },
    {
        "engineering geologists": "Engineering Geologist"
    },
    {
        "and ": null
    },
    {
        "geotechnical engineer": "Geotechnical Engineering"
    },
    {
        "s.     Examples of the application of geotechnics include: the prediction, prevention or mitigation of damage caused by ": null
    },
    {
        "natural hazards": "Natural Hazard"
    },
    {
        "such as ": null
    },
    {
        "avalanche": "Avalanche"
    },
    {
        "s, ": null
    },
    {
        "mud flow": "Mud Flow"
    },
    {
        "s, ": null
    },
    {
        "landslide": "Landslide"
    },
    {
        "s, ": null
    },
    {
        "rockslide": "Rockslide"
    },
    {
        "s, ": null
    },
    {
        "sinkhole": "Sinkhole"
    },
    {
        "s, and ": null
    },
    {
        "volcanic eruptions": "Volcanic Eruptions"
    },
    {
        "; the application of ": null
    },
    {
        "soil": "Soil"
    },
    {
        ", ": null
    },
    {
        "rock": "Rock"
    },
    {
        " and ": null
    },
    {
        "groundwater": "Groundwater"
    },
    {
        " mechanics to the design and predicted performance of earthen structures such as ": null
    },
    {
        "dam": "Dam"
    },
    {
        "s; the design and performance prediction of the foundations of ": null
    },
    {
        "bridge": "Bridge"
    },
    {
        "s, buildings, and other man-made structures in terms of the underlying soil and/or rock; and flood control and prediction.     Geotechnical engineering is the branch of ": null
    },
    {
        "civil engineering": "Civil Engineering"
    },
    {
        " concerned with the engineering behavior of ": null
    },
    {
        "earth materials": "Earth Materials"
    },
    {
        ". Geotechnical engineering is important in civil engineering, but also has applications in ": null
    },
    {
        "military": "Military Engineer"
    },
    {
        ", ": null
    },
    {
        "mining": "Mining Engineering"
    },
    {
        ", ": null
    },
    {
        "petroleum": "Petroleum Engineering"
    },
    {
        " and other ": null
    },
    {
        "engineering disciplines": "Engineering Disciplines"
    },
    {
        " that are concerned with construction occurring on the surface or within the ground. Geotechnical engineering uses principles of ": null
    },
    {
        "soil mechanics": "Soil Mechanics"
    },
    {
        " and ": null
    },
    {
        "rock mechanics": "Rock Mechanics"
    },
    {
        " to investigate subsurface conditions and materials; determine the relevant physical/mechanical and chemical properties of these materials; evaluate ": null
    },
    {
        "stability of natural slopes": "Slope Stability"
    },
    {
        " and man-made soil deposits; assess risks posed by site conditions; design ": null
    },
    {
        "earthworks": "Earthworks"
    },
    {
        " and structure ": null
    },
    {
        "foundations": "Foundation"
    },
    {
        "; and monitor site conditions, earthwork and foundation construction. Terzaghi, K., Peck, R.B. and Mesri, G. , Soil Mechanics in Engineering Practice 3rd Ed., John Wiley & Sons, Inc.  Holtz, R. and Kovacs, W. , An Introduction to Geotechnical Engineering, Prentice-Hall, Inc.      A typical geotechnical engineering project begins with a review of project needs to define the required material properties. Then follows a site investigation of ": null
    },
    {
        "soil": "Soil"
    },
    {
        ", rock, fault distribution and ": null
    },
    {
        "bedrock": "Bedrock"
    },
    {
        " properties on and below an area of interest to determine their engineering properties including how they will interact with, on or in a proposed ": null
    },
    {
        "construction": "Construction"
    },
    {
        ". ": null
    },
    {
        "Site investigations": "Site Investigation"
    },
    {
        "are needed to gain an understanding of the area in or on which the engineering will take place. Investigations can include the assessment of the risk to humans, property and the environment from natural hazards such as ": null
    },
    {
        "earthquake": "Earthquake"
    },
    {
        "s, ": null
    },
    {
        "landslide": "Landslide"
    },
    {
        "s, ": null
    },
    {
        "sinkhole": "Sinkhole"
    },
    {
        "s, ": null
    },
    {
        "soil liquefaction": "Soil Liquefaction"
    },
    {
        ", ": null
    },
    {
        "debris flows": "Debris Flow"
    },
    {
        "and ": null
    },
    {
        "rockfall": "Rockfall"
    },
    {
        "s.     A geotechnical engineer then determines and designs the type of foundations, earthworks, and/or pavement subgrades required for the intended man-made structures to be built. Foundations are designed and constructed for structures of various sizes such as high-rise buildings, ": null
    },
    {
        "bridge": "Bridge"
    },
    {
        "s, medium to large commercial buildings, and smaller structures where the soil conditions do not allow code-based design.     Foundations built for above-ground structures include shallow and deep foundations. Retaining structures include earth-filled ": null
    },
    {
        "dams": "Dams"
    },
    {
        " and retaining walls. Earthworks include ": null
    },
    {
        "embankments": "Embankment"
    },
    {
        ", ": null
    },
    {
        "tunnel": "Tunnel"
    },
    {
        "s, ": null
    },
    {
        "dikes and levees": "Levee"
    },
    {
        ", ": null
    },
    {
        "channels": "Channel"
    },
    {
        ", ": null
    },
    {
        "reservoir": "Reservoir"
    },
    {
        "s, deposition of ": null
    },
    {
        "hazardous waste": "Hazardous Waste"
    },
    {
        " and sanitary landfills. Geotechnical engineers are extensively involved in earthen and concrete dam projects, evaluating the subsurface conditions at the dam site and the side slopes of the reservoir, the seepage conditions under and around the dam and the stability of the dam under a range of normal and extreme loading conditions.     Geotechnical engineering is also related to ": null
    },
    {
        "coastal": "Coastal Engineering"
    },
    {
        " and ": null
    },
    {
        "ocean engineering": "Offshore Construction"
    },
    {
        ". Coastal engineering can involve the design and construction of ": null
    },
    {
        "wharves": "Wharves"
    },
    {
        ", ": null
    },
    {
        "marina": "Marina"
    },
    {
        "s, and ": null
    },
    {
        "jetties": "Jetties"
    },
    {
        ". Ocean engineering can involve foundation and anchor systems for ": null
    },
    {
        "offshore structures": "Offshore Construction"
    },
    {
        " such as ": null
    },
    {
        "oil platforms": "Oil Platforms"
    },
    {
        ".     The fields of geotechnical engineering and ": null
    },
    {
        "engineering geology": "Engineering Geology"
    },
    {
        " are closely related, and have large areas of overlap. However, the field of geotechnical engineering is a specialty of ": null
    },
    {
        "engineering": "Engineering"
    },
    {
        ", where the field of engineering geology is a specialty of ": null
    },
    {
        "geology": "Geology"
    },
    {
        ". Coming from the fields of engineering and science, respectively, the two may approach the same subject, such as soil classification, with different methods.       Humans have historically used soil as a material for flood control, irrigation purposes, burial sites, building foundations, and as construction material for buildings. First activities were linked to irrigation and flood control, as demonstrated by traces of dykes, dams, and canals dating back to at least 2000 BCE that were found in ancient ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", ancient ": null
    },
    {
        "Mesopotamia": "Mesopotamia"
    },
    {
        " and the ": null
    },
    {
        "Fertile Crescent": "Fertile Crescent"
    },
    {
        ", as well as around the early settlements of ": null
    },
    {
        "Mohenjo Daro": "Mohenjo-Daro"
    },
    {
        " and Harappa in the ": null
    },
    {
        "Indus valley": "Indus Valley"
    },
    {
        ". As the cities expanded, structures were erected supported by formalized foundations; ": null
    },
    {
        "Ancient Greeks": "Ancient Greeks"
    },
    {
        " notably constructed pad footings and ": null
    },
    {
        "strip-and-raft foundations": "Strip-And-Raft Foundations"
    },
    {
        ". Until the 18th century, however, no theoretical basis for soil design had been developed and the discipline was more of an art than a science, relying on past experience.      Several foundation-related engineering problems, such as the ": null
    },
    {
        "Leaning Tower of Pisa": "Leaning Tower Of Pisa"
    },
    {
        ", prompted scientists to begin taking a more scientific-based approach to examining the subsurface. The earliest advances occurred in the development of ": null
    },
    {
        "earth pressure": "Lateral Earth Pressure"
    },
    {
        " theories for the construction of ": null
    },
    {
        "retaining walls": "Retaining Walls"
    },
    {
        ". Henri Gautier, a French Royal Engineer, recognized the natural slope of different soils in 1717, an idea later known as the soils ": null
    },
    {
        "angle of repose": "Angle Of Repose"
    },
    {
        ". A rudimentary soil classification system was also developed based on a materials unit weight, which is no longer considered a good indication of soil type.      The application of the principles of mechanics to soils was documented as early as 1773 when ": null
    },
    {
        "Charles Coulomb": "Charles-Augustin De Coulomb"
    },
    {
        " developed improved methods to determine the earth pressures against military ramparts. Coulomb observed that, at failure, a distinct slip plane would form behind a sliding retaining wall and he suggested that the maximum shear stress on the slip plane, for design purposes, was the sum of the soil cohesion, c , and friction \\sigma\\,\\! \\tan , where \\sigma\\,\\! is the normal stress on the slip plane and \\phi\\,\\! is the friction angle of the soil. By combining Coulombs theory with ": null
    },
    {
        "Christian Otto Mohrs": "Christian Otto Mohr"
    },
    {
        " 2D stress state": "Mohrs Circle"
    },
    {
        ", the theory became known as ": null
    },
    {
        "Mohr-Coulomb theory": "Mohr-Coulomb Theory"
    },
    {
        ". Although it is now recognized that precise determination of cohesion is impossible because c is not a fundamental soil property, Disturbed soil properties and geotechnical design, Schofield, Andrew N., Thomas Telford, 2006.  the Mohr-Coulomb theory is still used in practice today.     In the 19th century ": null
    },
    {
        "Henry Darcy": "Henry Darcy"
    },
    {
        " developed what is now known as ": null
    },
    {
        "Darcys Law": "Darcys Law"
    },
    {
        " describing the flow of fluids in porous media. ": null
    },
    {
        "Joseph Boussinesq": "Joseph Boussinesq"
    },
    {
        " developed theories of stress distribution in elastic solids that proved useful for estimating stresses at depth in the ground; ": null
    },
    {
        "William Rankine": "William Rankine"
    },
    {
        ", an engineer and physicist, developed an alternative to Coulombs earth pressure theory. ": null
    },
    {
        "Albert Atterberg": "Albert Atterberg"
    },
    {
        " developed the ": null
    },
    {
        "clay consistency": "Atterberg Limits"
    },
    {
        " indices that are still used today for soil classification. ": null
    },
    {
        "Osborne Reynolds": "Osborne Reynolds"
    },
    {
        " recognized in 1885 that shearing causes volumetric dilation of dense and contraction of loose granular materials.     Modern geotechnical engineering is said to have begun in 1925 with the publication of Erdbaumechanik by ": null
    },
    {
        "Karl Terzaghi": "Karl Terzaghi"
    },
    {
        " . Considered by many to be the father of modern soil mechanics and geotechnical engineering, Terzaghi developed the principle of effective stress, and demonstrated that the shear strength of soil is controlled by effective stress. Terzaghi also developed the framework for theories of bearing capacity of foundations, and the theory for prediction of the rate of settlement of clay layers due to ": null
    },
    {
        "consolidation": "Consolidation"
    },
    {
        ". Soil Mechanics, Lambe, T.William and Whitman, Robert V., Massachusetts Institute of Technology, John Wiley & Sons., 1969.  In his 1948 book, Donald Taylor recognized that interlocking and dilation of densely packed particles contributed to the peak strength of a soil. The interrelationships between volume change behavior and shearing behavior were all connected via the theory of ": null
    },
    {
        "plasticity": "Plasticity"
    },
    {
        " using ": null
    },
    {
        "critical state soil mechanics": "Critical State Soil Mechanics"
    },
    {
        " by Roscoe, Schofield, and Wroth with the publication of On the Yielding of Soils in 1958. ": null
    },
    {
        "Critical state soil mechanics": "Critical State Soil Mechanics"
    },
    {
        " is the basis for many contemporary advanced ": null
    },
    {
        "constitutive models": "Constitutive Model"
    },
    {
        "describing the behavior of soil. Soil Behavior and Critical State Soil Mechanics, Wood, David Muir, Cambridge University Press, 1990.      ": null
    },
    {
        "Geotechnical centrifuge modeling": "Geotechnical Centrifuge Modeling"
    },
    {
        " is a method of testing physical scale models of geotechnical problems. The use of a centrifuge enhances the similarity of the scale model tests involving soil because the strength and stiffness of soil is very sensitive to the confining pressure. The centrifugal acceleration allows a researcher to obtain large stresses in small physical models.       Geotechnical engineers are typically graduates of a four-year civil engineering program and some hold a ": null
    },
    {
        "masters degree": "Masters Degree"
    },
    {
        ". In the US, geotechnical engineers are typically licensed and regulated as Professional Engineers in most states; currently only ": null
    },
    {
        "California": "California"
    },
    {
        " and ": null
    },
    {
        "Oregon": "Oregon"
    },
    {
        " have licensed geotechnical engineering specialties. The  began issuing Diplomate, Geotechnical Engineering certification in 2008. State governments will typically license engineers who have graduated from an ": null
    },
    {
        "ABET": "Abet"
    },
    {
        " accredited school, passed the  examination, completed several years of work experience under the supervision of a licensed Professional Engineer, and passed the ": null
    },
    {
        "Professional Engineering": "Professional Engineering"
    },
    {
        " examination.                In geotechnical engineering, soils are considered a three-phase material composed of: rock or ": null
    },
    {
        "mineral": "Mineral"
    },
    {
        " particles, water and air. The voids of a soil, the spaces in between mineral particles, contain the water and air.     The engineering properties of soils are affected by four main factors: the predominant size of the mineral particles, the type of mineral particles, the grain size distribution, and the relative quantities of mineral, water and air present in the soil matrix. Fine particles are defined as particles less than 0.075  mm in diameter.          Some of the important properties of soils that are used by geotechnical engineers to analyze site conditions and design earthworks, retaining structures, and foundations are:   ; ": null
    },
    {
        "Specific weight or Unit Weight": "Specific Weight"
    },
    {
        ": Cumulative weight of the solid particles, water and air of the unit volume of soil. Note that the air phase is often assumed to be weightless.   ; ": null
    },
    {
        "Porosity": "Porosity"
    },
    {
        ": Ratio of the volume of voids in a soil to the total volume of the soil. Porosity is mathematically related to void ratio the by      n\\frac     :here e is void ratio and n is porosity   ; ": null
    },
    {
        "Void ratio": "Void Ratio"
    },
    {
        ": The ratio of the volume of voids to the volume of solid particles in a soil mass. Void ratio is mathematically related to the porosity by     e\\frac       ; ": null
    },
    {
        "Permeability": "Permeability"
    },
    {
        ": A measure of the ability of water to flow through the soil. It is expressed in units of darcies . Permeability of 1 d allows the flow of 1 cm3 per second of fluid with 1 cP viscosity through a cross-sectional area of 1 cm2 when a pressure gradient of 1 atm/cm is applied.    ; ": null
    },
    {
        "Compressibility": "Compressibility"
    },
    {
        ": The rate of change of volume with effective stress. If the pores are filled with water, then the water must be squeezed out of the pores to allow volumetric compression of the soil; this process is called consolidation.   ; ": null
    },
    {
        "Shear strength": "Shear Strength"
    },
    {
        ": The maximum ": null
    },
    {
        "shear stress": "Shear Stress"
    },
    {
        " that can be applied in a soil mass without causing shear failure.    ; ": null
    },
    {
        "Atterberg Limits": "Atterberg Limits"
    },
    {
        ": ": null
    },
    {
        "Liquid limit": "Atterberg Limitsliquid Limit"
    },
    {
        ", ": null
    },
    {
        "Plastic limit": "Atterberg Limitsplastic Limit"
    },
    {
        ", and ": null
    },
    {
        "Shrinkage limit": "Atterberg Limitsshrinkage Limit"
    },
    {
        ". These indices are used for estimation of other engineering properties and for ": null
    },
    {
        "soil classification": "Soil Classification"
    },
    {
        ".               Geotechnical engineers and engineering geologists perform geotechnical investigations to obtain information on the physical properties of soil and rock underlying a site to design earthworks and foundations for proposed structures, and for the repair of distress to earthworks and structures caused by subsurface conditions. A geotechnical investigation will include surface exploration and subsurface exploration of a site. Sometimes, ": null
    },
    {
        "geophysical methods": "Exploration Geophysics"
    },
    {
        " are used to obtain data about sites. Subsurface exploration usually involves in-situ testing . In addition site investigation will often include subsurface sampling and laboratory testing of the soil samples retrieved. The digging of test pits and trenching  may also be used to learn about soil conditions at depth. Large diameter borings are rarely used due to safety concerns and expense but are sometimes used to allow a geologist or engineer to be lowered into the borehole for direct visual and manual examination of the soil and rock stratigraphy.     A variety of ": null
    },
    {
        "soil samplers": "Geotechnical Investigationsoil Sampling"
    },
    {
        " exists to meet the needs of different engineering projects. The ": null
    },
    {
        "standard penetration test": "Standard Penetration Test"
    },
    {
        " , which uses a thick-walled split spoon sampler, is the most common way to collect disturbed samples. Piston samplers, employing a thin-walled tube, are most commonly used for the collection of less disturbed samples. More advanced methods, such as ": null
    },
    {
        "ground freezing": "Ground Freezing"
    },
    {
        " and the Sherbrooke block sampler, are superior, but even more expensive.     ": null
    },
    {
        "Atterberg limits": "Atterberg Limits"
    },
    {
        " tests, ": null
    },
    {
        "water content": "Water Content"
    },
    {
        " measurements, and grain size analysis, for example, may be performed on disturbed samples obtained from thick-walled ": null
    },
    {
        "soil samplers": "Geotechnical Investigationsoil Sampling"
    },
    {
        ". Properties such as shear strength, stiffness hydraulic conductivity, and coefficient of ": null
    },
    {
        "consolidation": "Consolidation"
    },
    {
        " may be significantly altered by sample disturbance. To measure these properties in the laboratory, high-quality sampling is required. Common tests to measure the strength and stiffness include the ": null
    },
    {
        "triaxial shear": "Triaxial Shear Tests"
    },
    {
        " and unconfined compression test.     Surface exploration can include ": null
    },
    {
        "geologic map": "Geologic Map"
    },
    {
        "ping, ": null
    },
    {
        "geophysical methods": "Exploration Geophysics"
    },
    {
        ", and ": null
    },
    {
        "photogrammetry": "Photogrammetry"
    },
    {
        "; or it can be as simple as an engineer walking around to observe the physical conditions at the site. Geologic mapping and interpretation of geomorphology are typically completed in consultation with a ": null
    },
    {
        "geologist": "Geologist"
    },
    {
        " or ": null
    },
    {
        "engineering geologist": "Engineering Geologist"
    },
    {
        ".     ": null
    },
    {
        "Geophysical exploration": "Exploration Geophysics"
    },
    {
        " is also sometimes used. Geophysical techniques used for subsurface exploration include measurement of ": null
    },
    {
        "seismic waves": "Seismic Waves"
    },
    {
        " , surface-wave methods and/or downhole methods, and electromagnetic surveys .             A buildings foundation transmits loads from buildings and other structures to the earth. Geotechnical engineers design foundations based on the load characteristics of the structure and the properties of the soils and/or bedrock at the site. In general, geotechnical engineers:   Estimate the magnitude and location of the loads to be supported.   Develop an investigation plan to ": null
    },
    {
        "explore the subsurface": "Geotechnical Investigation"
    },
    {
        ".   Determine necessary soil parameters through field and lab testing .   Design the foundation in the safest and most economical manner.     The primary considerations for foundation support are ": null
    },
    {
        "bearing capacity": "Bearing Capacity"
    },
    {
        ", settlement, and ground movement beneath the foundations. Bearing capacity is the ability of the site soils to support the loads imposed by buildings or structures. Settlement occurs under all foundations in all soil conditions, though lightly loaded structures or rock sites may experience negligible settlements. For heavier structures or softer sites, both overall settlement relative to unbuilt areas or neighboring buildings, and differential settlement under a single structure can be concerns. Of particular concern is a settlement which occurs over time, as immediate settlement can usually be compensated for during construction. Ground movement beneath a structures foundations can occur due to shrinkage or swell of expansive soils due to climatic changes, frost expansion of soil, melting of permafrost, slope instability, or other causes. All these factors must be considered during the design of foundations.     Many building codes specify basic foundation design parameters for simple conditions, frequently varying by jurisdiction, but such design techniques are normally limited to certain types of construction and certain types of sites and are frequently very conservative.     In areas of shallow bedrock, most foundations may bear directly on bedrock; in other areas, the soil may provide sufficient strength for the support of structures. In areas of deeper bedrock with soft overlying soils, deep foundations are used to support structures directly on the bedrock; in areas where bedrock is not economically available, stiff bearing layers are used to support deep foundations instead.                Shallow foundations are a type of foundation that transfers the building load to the very near the surface, rather than to a subsurface layer. Shallow foundations typically have a depth to width ratio of less than 1.       Footings are structural elements which transfer structure loads to the ground by direct areal contact. Footings can be isolated footings for point or column loads or strip footings for wall or another long loads. Footings are normally constructed from ": null
    },
    {
        "reinforced concrete": "Reinforced Concrete"
    },
    {
        " cast directly onto the soil and are typically embedded into the ground to penetrate through the zone of frost movement and/or to obtain additional bearing capacity.       A variant on spread footings is to have the entire structure bear on a single slab of concrete underlying the entire area of the structure. Slabs must be thick enough to provide sufficient rigidity to spread the bearing loads somewhat uniformly and to minimize differential settlement across the foundation. In some cases, flexure is allowed and the building is constructed to tolerate small movements of the foundation instead. For small structures, like single-family houses, the slab may be less than 300   mm thick; for larger structures, the foundation slab may be several meters thick.     Slab foundations can be either ": null
    },
    {
        "slab-on-grade foundations": "Slab-On-Grade Foundation"
    },
    {
        "or embedded foundations, typically in buildings with basements. Slab-on-grade foundations must be designed to allow for potential ground movement due to changing soil conditions.                  Deep foundations are used for structures or heavy loads when shallow foundations cannot provide adequate capacity, due to size and structural limitations. They may also be used to transfer building loads past weak or compressible soil layers. While shallow foundations rely solely on the ": null
    },
    {
        "bearing capacity": "Bearing Capacity"
    },
    {
        " of the soil beneath them, deep foundations can rely on end bearing resistance, frictional resistance along their length, or both in developing the required capacity. Geotechnical engineers use specialized tools, such as the ": null
    },
    {
        "cone penetration test": "Cone Penetration Test"
    },
    {
        ", to estimate the amount of skin and end bearing resistance available in the subsurface.     There are many types of deep foundations including ": null
    },
    {
        "piles": "Deep Foundation"
    },
    {
        ", drilled shafts, ": null
    },
    {
        "caissons": "Caisson"
    },
    {
        ", piers, and earth stabilized columns. Large buildings such as ": null
    },
    {
        "skyscrapers": "Skyscraper"
    },
    {
        "typically require deep foundations. For example, the ": null
    },
    {
        "Jin Mao Tower": "Jin Mao Tower"
    },
    {
        " in ": null
    },
    {
        "China": "China"
    },
    {
        " uses tubular steel piles about 1m driven to a depth of 83.5m to support its weight.     In buildings that are constructed and found to undergo settlement, ": null
    },
    {
        "underpinning": "Underpinning"
    },
    {
        " piles can be used to stabilize the existing building.     There are three ways to place piles for a deep foundation. They can be driven, drilled, or installed by the use of an auger. Driven piles are extended to their necessary depths with the application of external energy in the same way a nail is hammered. There are four typical hammers used to drive such piles: drop hammers, diesel hammers, hydraulic hammers, and air hammers. Drop hammers simply drop a heavy weight onto the pile to drive it, while diesel hammers use a single-cylinder diesel engine to force piles through the Earth. Similarly, hydraulic and air hammers supply energy to piles through hydraulic and air forces. The energy imparted from a hammerhead varies with the type of hammer chosen and can be as high as a million-foot pounds for large scale diesel hammers, a very common hammerhead used in practice. Piles are made of a variety of material including steel, timber, and concrete. Drilled piles are created by first drilling a hole to the appropriate depth, and filling it with concrete. Drilled piles can typically carry more load than driven piles, simply due to a larger diameter pile. The auger method of pile installation is similar to drilled pile installation, but concrete is pumped into the hole as the auger is being removed.              A retaining wall is a structure that holds back earth. Retaining walls stabilize soil and rock from downslope movement or erosion and provide support for vertical or near-vertical grade changes. Cofferdams and bulkheads, structures to hold back water, are sometimes also considered retaining walls.     The primary geotechnical concern in design and installation of retaining walls is that the weight of the retained material is creates ": null
    },
    {
        "lateral earth pressure": "Lateral Earth Pressure"
    },
    {
        " behind the wall, which can cause the wall to deform or fail. The lateral earth pressure depends on the height of the wall, the density of the soil, the strength of the ": null
    },
    {
        "soil": "Soil Mechanics"
    },
    {
        ", and the amount of allowable movement of the wall. This pressure is smallest at the top and increases toward the bottom in a manner similar to hydraulic pressure, and tends to push the wall away from the backfill. ": null
    },
    {
        "Groundwater": "Groundwater"
    },
    {
        " behind the wall that is not dissipated by a drainage system causes an additional horizontal hydraulic pressure on the wall.       Gravity walls depend on the size and weight of the wall mass to resist pressures from behind. Gravity walls will often have a slight setback, or batter, to improve wall stability. For short, landscaping walls, gravity walls made from dry-stacked stone or segmental concrete units are commonly used.     Earlier in the 20th century, taller retaining walls were often gravity walls made from large masses of concrete or stone. Today, taller retaining walls are increasingly built as composite gravity walls such as geosynthetic or steel-reinforced backfill soil with precast facing; gabions , crib walls or soil-nailed walls .     For reinforced-soil gravity walls, the soil reinforcement is placed in horizontal layers throughout the height of the wall. Commonly, the soil reinforcement is geogrid, a high-strength polymer mesh, that provides tensile strength to hold the soil together. The wall face is often of precast, segmental concrete units that can tolerate some differential movement. The reinforced soils mass, along with the facing, becomes the gravity wall. The reinforced mass must be built large enough to retain the pressures from the soil behind it. Gravity walls usually must be a minimum of 30 to 40 percent as deep as the height of the wall and may have to be larger if there is a slope or surcharge on the wall.       Prior to the introduction of modern reinforced-soil gravity walls, cantilevered walls were the most common type of taller retaining wall. Cantilevered walls are made from a relatively thin stem of steel-reinforced, cast-in-place concrete or mortared masonry . These walls cantilever loads to a large, structural footing; converting horizontal pressures from behind the wall to vertical pressures on the ground below. Sometimes cantilevered walls are buttressed on the front, or include a counterfort on the back, to improve their stability against high loads. Buttresses are short ": null
    },
    {
        "wing walls": "Wing Wall"
    },
    {
        "at right angles to the main trend of the wall. These walls require rigid concrete footings below seasonal frost depth. This type of wall uses much less material than a traditional gravity wall.     Cantilever walls resist lateral pressures by friction at the base of the wall and/or passive earth pressure, the tendency of the soil to resist lateral movement.     Basements are a form of cantilever walls, but the forces on the basement walls are greater than on conventional walls because the basement wall is not free to move.          Shoring of temporary excavations frequently requires a wall design that does not extend laterally beyond the wall, so shoring extends below the planned base of the excavation. Common methods of shoring are the use of sheet piles or soldier beams and lagging. Sheet piles are a form of driven piling using thin interlocking sheets of steel to obtain a continuous barrier in the ground and are driven prior to excavation. Soldier beams are constructed of wide flange steel H sections spaced about 2–3 m apart, driven prior to excavation. As the excavation proceeds, horizontal timber or steel sheeting is inserted behind the H pile flanges.     In some cases, the lateral support which can be provided by the shoring wall alone is insufficient to resist the planned lateral loads; in this case, additional support is provided by walers or tie-backs. Walers are structural elements that connect across the excavation so that the loads from the soil on either side of the excavation are used to resist each other, or which transfer horizontal loads from the shoring wall to the base of the excavation. Tie-backs are steel tendons drilled into the face of the wall which extends beyond the soil which is applying pressure to the wall, to provide additional lateral resistance to the wall.             ": null
    },
    {
        "Compaction": "Soil Compaction"
    },
    {
        " is the process by which the density of soil is increased and permeability of soil is decreased. Fill placement work often has specifications requiring a specific degree of compaction, or alternatively, specific properties of the compacted soil. In-situ soils can be compacted by rolling, deep ": null
    },
    {
        "dynamic compaction": "Dynamic Compaction"
    },
    {
        ", vibration, blasting, gyrating, kneading, compaction grouting etc.       Ground Improvement is a technique that improves the engineering properties of the treated soil mass. Usually, the properties modified are shear strength, stiffness, and permeability. Ground improvement has developed into a sophisticated tool to support foundations for a wide variety of structures. Properly applied, i.e. after giving due consideration to the nature of the ground being improved and the type and sensitivity of the structures being built, ground improvement often reduces direct costs and saves time.                Slope stability is the potential of soil covered slopes to withstand and undergo ": null
    },
    {
        "movement": "Mass Wasting"
    },
    {
        ". Stability is determined by the balance of ": null
    },
    {
        "shear stress": "Shear Stress"
    },
    {
        " and ": null
    },
    {
        "shear strength": "Shear Strength"
    },
    {
        ". A previously stable slope may be initially affected by preparatory factors, making the slope conditionally unstable. Triggering factors of a ": null
    },
    {
        "slope failure": "Slope Failure"
    },
    {
        " can be climatic events that can then make a slope actively unstable, leading to mass movements. Mass movements can be caused by increases in shear stress, such as loading, lateral pressure, and transient forces. Alternatively, shear strength may be decreased by weathering, changes in ": null
    },
    {
        "pore water pressure": "Pore Water Pressure"
    },
    {
        ", and organic material.     Several modes of failure for earth slopes include falls, topples, slides, and flows. In slopes with coarse-grained soil or rocks, falls typically occur as the rapid descent of rocks and other loose slope material. A slope topples when a large column of soil tilts over its vertical axis at failure. Typical slope stability analysis considers sliding failures, categorized mainly as rotational slides or translational slides. As implied by the name, rotational slides fail along a generally curved surface, while translational slides fail along a more planar surface. A slope failing as flow would resemble a fluid flowing downhill.            Stability analysis is needed for the design of engineered slopes and for estimating the risk of slope failure in natural or designed slopes. A common assumption is that a slope consists of a layer of soil sitting on top of a rigid base. The mass and the base are assumed to interact via friction. The interface between the mass and the base can be planar, curved, or have some other complex geometry. The goal of a slope stability analysis is to determine the conditions under which the mass will slip relative to the base and lead to slope failure.      If the interface between the mass and the base of a slope has a complex geometry, slope stability analysis is difficult and numerical solution methods are required. Typically, the exact geometry of the interface is not known and a simplified interface geometry is assumed. Finite slopes require three-dimensional models to be analyzed. To keep the problem simple, most slopes are analyzed assuming that the slopes are infinitely wide and can, therefore, be represented by two-dimensional models. A slope can be drained or undrained. The undrained condition is used in the calculations to produce conservative estimates of risk.     A popular stability analysis approach is based on principles pertaining to the limit equilibrium concept. This method analyzes a finite or infinite slope as if it were about to fail along its sliding failure surface. Equilibrium stresses are calculated along the failure plane and compared to the soils shear strength as determined by ": null
    },
    {
        "Terzaghis shear strength equation": "Shear Strength Drained Shear Strength"
    },
    {
        ". Stability is ultimately decided by a factor of safety equal to the ratio of shear strength to the equilibrium stresses along the failure surface. A factor of safety greater than one generally implies a stable slope, failure of which should not occur assuming the slope is undisturbed. A factor of safety of 1.5 for static conditions is commonly used in practice.               Offshore  geotechnical engineering is concerned with foundation design for human-made structures in the ": null
    },
    {
        "sea": "Sea"
    },
    {
        ", away from the ": null
    },
    {
        "coast": "Coast"
    },
    {
        "line . Dean, E.T.R. . Offshore Geotechnical Engineering – Principles and Practice. Thomas Telford, Reston, VA, 520 p. ": null
    },
    {
        "Oil platform": "Oil Platform"
    },
    {
        "s, ": null
    },
    {
        "artificial islands": "Artificial Island"
    },
    {
        "and ": null
    },
    {
        "submarine pipelines": "Submarine Pipeline"
    },
    {
        "are examples of such structures. There are a number of significant differences between onshore and offshore geotechnical engineering. Randolph, M. and Gourvenec, S., 2011. Offshore geotechnical engineering. Spon Press, N.Y., 550 p. Notably, ground improvement and site investigation are more expensive, the offshore structures are exposed to a wider range of ": null
    },
    {
        "geohazard": "Geohazard"
    },
    {
        "s, and the environmental and financial consequences are higher in case of failure. Offshore structures are exposed to various environmental loads, notably ": null
    },
    {
        "wind": "Wind"
    },
    {
        ", ": null
    },
    {
        "waves": "Wind Wave"
    },
    {
        "and ": null
    },
    {
        "currents": "Ocean Current"
    },
    {
        ". These phenomena may affect the integrity or the serviceability of the structure and its foundation during its operational lifespan – they need to be taken into account in offshore design.     In ": null
    },
    {
        "subsea": "Subsea"
    },
    {
        " geotechnical engineering, seabed materials are considered a two-phase material composed of 1": null
    }
]