[
    {
        "   Geothermal desalination is a process under development for the production of ": null
    },
    {
        "fresh water": "fresh water"
    },
    {
        " using ": null
    },
    {
        "heat energy": "geothermal power"
    },
    {
        ". Claimed benefits of this method of ": null
    },
    {
        "desalination": "desalination"
    },
    {
        " are that it requires less maintenance than ": null
    },
    {
        "reverse osmosis": "reverse osmosis"
    },
    {
        " membranes and that the primary ": null
    },
    {
        "energy": "energy"
    },
    {
        " input is from ": null
    },
    {
        "geothermal heat": "geothermal heat"
    },
    {
        ", which is a low-environmental-impact source of energy.     Circa 42 Douglas Firestone from ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        " devised the use of geothermal water directly as a source for desalination. In 42 several individuals began working with evaporation/condensation air loop ": null
    },
    {
        "water desalination": "water desalination"
    },
    {
        ". The experiment was successful and a ": null
    },
    {
        "proof of concept": "proof of concept"
    },
    {
        ", proving that geothermal waters could be used as process water to produce potable water in 42     In 42 to 42 testing was done in a sixth prototype of a device referred to as a delta t device, a closed air loop, atmospheric pressure, evaporation condensation loop geothermally powered desalination device. The device used filtered sea water from ": null
    },
    {
        "Scripps Institution of Oceanography": "scripps institution of oceanography"
    },
    {
        " and reduced the salt concentration from 42 ppm to 42 ppm.     A total of six prototypes and six modifications demonstrated that, with process water approaching  and a chill source about , a full-size device would produce about 42 m³ of water per day. ": null
    },
    {
        "Salt": "salt"
    },
    {
        " concentration in the wastewater would only be about 42% above the level of the original water, thus, from, say, 42 to about 42 ": null
    },
    {
        "parts per million": "parts per million"
    },
    {
        ", well within the ability of ": null
    },
    {
        "osmoregulators": "osmoregulation"
    }
]