[
    {
        "German submarine U42 was a ": null
    },
    {
        "Type VIIC": "german type vii submarinetype viic"
    },
    {
        " U-boat": "u-boat"
    },
    {
        " built for ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        "s  Kriegsmarine  for service during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". She was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " on 42 December 42 at ": null
    },
    {
        "Blohm & Voss": "blohm  &  voss"
    },
    {
        " in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " as yard number 42 ": null
    },
    {
        "launched": "ceremonial ship launching"
    },
    {
        " on 42 September 42 and went into service on 42 December 42 U42 was nicknamed the Roter Teufel after its mascot of a grinning devil which was painted on the conning tower. She was one of the more successful of her class, operating for over three years of continual service and sinking or damaging 42 Allied ships with 42 tons sunk and 42 tons damaged. She was a member of 42 ": null
    },
    {
        "wolf pack": "wolfpack"
    },
    {
        "s.     U42 was involved in two controversial actions: in October 42 she sank the , the first ": null
    },
    {
        "US Navy": "us navy"
    },
    {
        " warship to be lost in World War II; this was at a time when the US was still officially neutral, and caused a diplomatic row. In April 42 she sank the freighter ": null
    },
    {
        "SS David H. Atwater": "ss david h. atwater"
    },
    {
        " off the US seaboard.     U42 had an unusually long service life, surviving to the end of World War II; after evacuating from her French base during the spring of 42 she operated on training duties in the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " until 42 May 42 when her crew scuttled her in ": null
    },
    {
        "Helgoland Bight": "heligoland bight"
    },
    {
        ", to prevent her falling into enemy hands.       ": null
    },
    {
        "German Type VIIC submarines": "german type vii submarinetype viic"
    },
    {
        " were preceded by the shorter ": null
    },
    {
        "Type VIIB submarines": "german type vii submarinetype viib"
    },
    {
        ". U42 had a displacement of  when at the surface and  while submerged. She had a total length of , a ": null
    },
    {
        "pressure hull": "pressure hull"
    },
    {
        " length of , a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of , a height of , and a ": null
    },
    {
        "draught": "draught"
    },
    {
        " of . The submarine was powered by two ": null
    },
    {
        "Germaniawerft": "germaniawerft"
    },
    {
        " F42 four-stroke, six-cylinder ": null
    },
    {
        "supercharged": "supercharged"
    },
    {
        " diesel engine": "diesel engine"
    },
    {
        "s producing a total of  for use while surfaced, two ": null
    },
    {
        "Brown, Boveri & Cie": "brown, boveri  &  cie"
    },
    {
        " GG UB 42/42 ": null
    },
    {
        "double-acting electric motors": "motor–generator"
    },
    {
        " producing a total of  for use while submerged. She had two shafts and two  ": null
    },
    {
        "propeller": "propeller"
    },
    {
        "s. The boat was capable of operating at depths of up to .     The submarine had a maximum surface speed of  and a maximum submerged speed of . When submerged, the boat could operate for  at ; when surfaced, she could travel  at . U42 was fitted with five  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s , fourteen ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        "es, one ": null
    },
    {
        " SK C/42 naval gun": "8.8 cm sk c/35 naval gun"
    },
    {
        ", 42 rounds, and a ": null
    },
    {
        " C/42": "2 cm flak 30"
    },
    {
        " anti-aircraft gun. The boat had a ": null
    },
    {
        "complement": "ships company"
    },
    {
        " of between forty-four and sixty.           Following construction, which was completed on 42 December 42 U42 was given two months of working-up training, during which she prepared her crew and equipment for the operations ahead. She then sailed from ": null
    },
    {
        "Kiel": "kiel"
    },
    {
        " on 42 February to ": null
    },
    {
        "Helgoland": "helgoland"
    },
    {
        " for her first official patrol, arriving there on 42 February 42 This port city was to remain U42s home base until she was transferred to the occupied French port of ": null
    },
    {
        "St Nazaire": "st nazaire"
    },
    {
        " in mid-March 42        U42s first official war patrol began on 42 February 42 when she left Helgoland for a patrol in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " and the ": null
    },
    {
        "North Atlantic": "north atlantic"
    },
    {
        " south of Iceland.  This first operation yielded one British tanker and one ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        "ic ": null
    },
    {
        "trawler": "naval trawler"
    },
    {
        " carrying fish.  The British tanker, Cadillac, was sunk just north of Scotland on 42 March while the trawler was sunk just south of Iceland on 42 March. Following these victories, U42 headed back to St Nazaire. The remainder of her later patrols were all conducted from the French city, which gave her easy access to the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        " and allowed her more time at sea.       U42 began her second war patrol on 42 April 42 when she left her new home port of St Nazaire for the North Atlantic. For 42 days she searched the area of Ocean south of Iceland and West of Ireland for any Allied convoys. During this time she sank three British merchant vessels and damaged another for a total of 42 tones. Following her torpedoing of the British ship Capulet on 42 April, which only managed to damage the vessel, U42 was depth-charged in five separate attacks by two accompanying destroyers. After several hours, the U-boat managed to escape but was unable to pursue the convoy. After these attacks, U42 returned to St Nazaire on 42 May.        U42 left St Nazaire for her third war patrol on 42 May 42 In 42 days, she travelled into the North Atlantic and sank three British vessels: the Ainderby on 42 June, the Chinese Prince on 42 June and the Norfolk on 42 June. During the attack on the Norfolk, U42 attempted to attack the remaining ships in the convoy but was forced to break off the attack due to the arrival of several of the convoys escorts. All of these attacks occurred off the northwest coast of Ireland, and once U42 returned to St. Nazaire on 42 July 42 she had amassed a total of 42 tonnes from the ships she had sunk.        U42s fourth patrol was much less successful than her previous three. Having left St Nazaire on 42 August, she proceeded to head south into the waters off Portugal and Spain. It was here that she sank the Norwegian vessel, Spind. Following this sinking, U42 returned to St Nazaire on 42 August 42 after only nine days at sea.        Her next two patrols all took her further into the Atlantic, where the danger was lessened, but so were the targets, with the result that she only hit three more cargo ships. This was also the time, during her final patrol of 42 that she sank the Reuben James, which was torpedoed on 42 October in controversial circumstances.       Reuben James   On 42 October 42 USS Reuben James was one of five ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s escorting ": null
    },
    {
        "convoy HX42": "convoy hx-156"
    },
    {
        ", close to the coast of Iceland, about  west of the island. Reuben James had just begun turning to investigate a strong direction-finder bearing when a torpedo launched from U42 struck her port side and caused an explosion in her forward magazine. The entire bow section of the destroyer was blown off as far back as the fourth funnel and sank immediately. The stern remained afloat for around five minutes before sinking; unsecured depth charges compounded the damage, exploding as they sank and killing survivors in the water. One hundred and fifteen of her 42-man crew were killed, including all the officers.  Gannon, Michael - Operation Drumbeat - the dramatic true story of Germanys first U-boat attacks along the American coast in World War II, 42 Harper and Row publishers, , p. 42     The destroyer was the first US Navy warship to be sunk in World War II.     The incident provoked a furious outburst in the United States, especially when Germany refused to apologize, instead countering that the destroyer was operating in what Germany considered to be a war zone and had suffered the consequences. The sinking of the Reuben James did not lead the US to declare war on Germany; it did, however, provide a pretext to officially transfer the ": null
    },
    {
        "US Coast Guard": "us coast guard"
    },
    {
        " from its peacetime role as an arm of the ": null
    },
    {
        "US Treasury Department": "us treasury department"
    },
    {
        " to a wartime function as part of the US Navy. Congress also amended the ": null
    },
    {
        "Neutrality Act": "neutrality acts of 1930s"
    },
    {
        " to permit the arming of US-registered merchant ships and authorized them to enter European waters for the first time since 42         In 42 again commanded by ": null
    },
    {
        "Erich Topp": "erich topp"
    },
    {
        " , U42 participated in the ": null
    },
    {
        "Second Happy Time": "second happy time"
    },
    {
        " , during which German submarines had great success against unescorted American merchantmen sailing alone along the eastern seaboard of the US. U42 was particularly successful during this period, sinking 42 ships and damaging another in just three patrols in the first six months of 42 Two further patrols under Topp during the summer netted four more ships. However, in an attack against Convoy ON42 on 42 August 42 the boat was nearly sunk when she was caught on the surface by the Canadian ": null
    },
    {
        "corvette": "corvette"
    },
    {
        " . The corvette machine-gunned the submarine and hit the conning tower with a four inch shell, causing severe damage and forcing Topp to return to base for repairs. W.A.B. Douglas, No Higher Purpose: The Official Operational History of the Royal Canadian Navy in the Second World War, 4242, Vanwell Publishing , pp. 4242 U42 was badly damaged by heavy seas during another patrol and was put into port for repairs, during which Topp was promoted and replaced by a more cautious commander, Klaus Popp.     David H. Atwater, in the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        "  off ": null
    },
    {
        "Chincoteague": "chincoteague bay"
    },
    {
        ", ": null
    },
    {
        "Virginia": "virginia"
    },
    {
        ", was one of the more controversial actions of the Kriegsmarine during the Second World War, primarily due to the manner of the sinking. Bridgland p 42     On the night of 42 April 42 at the height of the U-boat offensive against US shipping known as the Second Happy Time, the unarmed coastal steamer David H. Atwater was en route from ": null
    },
    {
        "Norfolk, Virginia": "norfolk, virginia"
    },
    {
        " to Fall River, Massachusetts,  with a full load of 42 tons of coal.     Around 42:42 between ": null
    },
    {
        "Cape Charles": "cape charles"
    },
    {
        " and ": null
    },
    {
        "Cape Henlopen": "cape henlopen"
    },
    {
        ",  the ship was ambushed by U42, which had followed her submerged. The submarine surfaced about  from the freighter and opened fire with her 42mm deck gun and machine guns without warning, one of her first shells destroying the bridge and killing all of the officers. In all, 42 rounds were fired from the deck gun, with 42 hits being recorded on the small freighter,  which rapidly began to sink.     As it did so, Topp directed his crewmen to continue firing, striking the Atwaters crewmen as they tried to man the lifeboats.  The crew was not given any chance to abandon ship, and when they tried to do so, their lifeboats were riddled by machine gun fire. When Captain Webster was hit, the crew abandoned attempts to launch the lifeboats and leapt into the sea.      The first ship to arrive on the scene was the small Coast Guard Patrol Boat USS CG42, which found a lifeboat holding three survivors and three bodies; the survivors reported that they had dived overboard and swum to the boat. Next on the scene was the ": null
    },
    {
        "Coast Guard cutter": "coast guard cutter"
    },
    {
        " , which had heard the gunfire and arrived just fifteen minutes later. The Legare found a second lifeboat with a body aboard; the boat was discovered to have been riddled by gunfire, and lent strength to the widespread belief at the time that U-boats were deliberately murdering the survivors of ships they had sunk. The Legare landed the three survivors and four bodies at Chincoteague Island Coastguard Station, then returned to sea to search further.      The destroyers  and  were directed to the scene at 42:42 and arrived at 42:42 but U42 had by then escaped the scene, going on to sink other vessels.      Whether the attack on the liferafts was deliberate, or an unfortunate and unintended consequence of a nighttime attack has been heavily debated. Some of the crew of U42 survived the war, and her captain, Erich Topp, later became an Admiral in the post-war Bundesmarine. No charges were brought against Topp, as happened to ": null
    },
    {
        "Helmuth von Ruckteschell": "helmuth von ruckteschell"
    },
    {
        ", captain of the raider ": null
    },
    {
        "Widder": "german auxiliary cruiser widder"
    },
    {
        " for a similar offence.       U42 had less success in later years, as did the U-boat force in general, as U-boats failed to keep ahead of the rapidly increasing numbers and capabilities of Allied anti-submarine efforts. She was transferred to operations off the ": null
    },
    {
        "Spanish": "spain"
    },
    {
        ", ": null
    },
    {
        "Portuguese": "portugal"
    },
    {
        " and African coasts, which were nearer to base and less dangerous than the newly reorganized defenses of the United States, where she attempted to sink troopships during ": null
    },
    {
        "Operation Torch": "operation torch"
    },
    {
        ". Whilst on this duty, Topp sank a small British ": null
    },
    {
        "minesweeper": "minesweeper"
    },
    {
        " and later a cargo ship, but failed to enter the ": null
    },
    {
        "Straits of Gibraltar": "straits of gibraltar"
    },
    {
        " or seriously threaten the landings.     During 42 U42 was increasingly unable to serve effectively against the well-prepared and organized Allied convoy system, a fact reflected by her failure to sink a single ship during her two patrols into the North ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ". During one of these, a ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " B42 Liberator": "b-24 liberator"
    },
    {
        " aircraft spotted her and she was seriously damaged by ": null
    },
    {
        "depth charges": "depth charges"
    },
    {
        ", which necessitated four months repairs.     In 42 she had a single patrol, but was unable to close with or threaten any Allied convoys, and so was withdrawn to Germany in April 42 for use as a training vessel in the ": null
    },
    {
        "42nd U-boat Flotilla": "22nd u-boat flotilla"
    },
    {
        ", a role she fulfilled until 42 May 42 when her crew scuttled her in ": null
    },
    {
        "Wilhelmshaven": "wilhelmshaven"
    },
    {
        " bay to prevent her capture.       U42 took part in 42 ": null
    },
    {
        "wolfpack": "wolfpack"
    },
    {
        "s, namely.   ": null
    },
    {
        "Brandenburg": "wolfpack brandenburg"
    },
    {
        "   Stosstrupp   Störtebecker   Benecke   Seydlitz   ": null
    },
    {
        "Zieten": "wolfpack zieten"
    },
    {
        "   Endrass": "wolfpack endrass"
    },
    {
        "   Wolf": "wolfpack wolf"
    },
    {
        "   Pirat   ": null
    },
    {
        "Steinbrinck": "wolfpack steinbrinck"
    },
    {
        "   Meise   Star   Fink   Naab   Donau 42   Mosel   ": null
    },
    {
        "Siegfried": "wolfpack siegfried"
    },
    {
        "   Siegfried 42": "wolfpack siegfried"
    },
    {
        "   Jahn   Tirpitz 42   Eisenhart 42       ": null
    }
]