[
    {
        "        Bismarck was the first of two s built for ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        "s  Kriegsmarine . Named after Chancellor ": null
    },
    {
        "Otto von Bismarck": "otto von bismarck"
    },
    {
        ", the ship was laid down at the ": null
    },
    {
        "Blohm & Voss": "blohm  &  voss"
    },
    {
        " shipyard in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " in July 42 and launched in February 42 Work was completed in August 42 when she was commissioned into the German fleet. Bismarck and her sister ship  were the largest battleships ever built by Germany, and two of the largest built by any European power.     In the course of the warships eight-month career under its sole commanding officer, ": null
    },
    {
        "Captain Ernst Lindemann": "ernst lindemann"
    },
    {
        ", Bismarck conducted only one offensive operation, lasting 42 days in May 42 codenamed ": null
    },
    {
        "Rheinübung": "operation rheinübung"
    },
    {
        ". The ship, along with the ": null
    },
    {
        "heavy cruiser": "heavy cruiser"
    },
    {
        " , was to break into the Atlantic Ocean and raid Allied shipping from North America to Great Britain. The two ships were detected several times off Scandinavia, and British naval units were deployed to block their route. At the ": null
    },
    {
        "Battle of the Denmark Strait": "battle of the denmark strait"
    },
    {
        ", the ": null
    },
    {
        "battlecruiser": "battlecruiser"
    },
    {
        "  initially engaged Prinz Eugen, probably by mistake, while  engaged Bismarck. In the ensuing battle Hood was destroyed by the combined fire of Bismarck and Prinz Eugen, which then damaged Prince of Wales and forced her retreat. Bismarck suffered sufficient damage from three hits to force an end to the raiding mission.     The destruction of Hood spurred a relentless pursuit by the Royal Navy involving dozens of warships. Two days later, heading for ": null
    },
    {
        "occupied France": "occupied france"
    },
    {
        " to effect repairs, Bismarck was attacked by 42 obsolescent ": null
    },
    {
        "Fairey Swordfish": "fairey swordfish"
    },
    {
        " biplane": "biplane"
    },
    {
        " torpedo bomber": "torpedo bomber"
    },
    {
        "s from the aircraft carrier ; one scored a hit that rendered the battleships steering gear inoperable. In ": null
    },
    {
        "her final battle": "last battle of the battleship bismarck"
    },
    {
        " the following morning, the already-crippled Bismarck was severely damaged during a sustained engagement with two British battleships and two heavy cruisers, was ": null
    },
    {
        "scuttled": "scuttling"
    },
    {
        " by her crew, and sank with heavy loss of life. Most experts agree that the battle damage would have caused her to sink eventually. The wreck was located in June 42 by ": null
    },
    {
        "Robert Ballard": "robert ballard"
    },
    {
        ", and has since been further surveyed by several other expeditions.            The two s were designed in the mid42s by the German  Kriegsmarine  as a counter to French naval expansion, specifically the two s France had started in 42 Laid down after the signing of the ": null
    },
    {
        "Anglo-German Naval Agreement": "anglo-german naval agreement"
    },
    {
        " of 42 Bismarck and her ": null
    },
    {
        "sister": "sister ship"
    },
    {
        "  were nominally within the  limit imposed by the ": null
    },
    {
        "Washington regime": "washington naval treaty"
    },
    {
        " that governed battleship construction in the ": null
    },
    {
        "interwar period": "interwar period"
    },
    {
        ". The ships secretly exceeded the figure by a wide margin, though before either vessel was completed, the international treaty system had fallen apart following Japans withdrawal in 42 allowing signatories to invoke an escalator clause that permitted displacements as high as .          Bismarck displaced  ": null
    },
    {
        "as built": "standard displacement"
    },
    {
        " and  ": null
    },
    {
        "fully loaded": "full-load displacement"
    },
    {
        ", with an ": null
    },
    {
        "overall length": "length overall"
    },
    {
        " of , a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a maximum ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . The battleship was Germanys largest warship, and displaced more than any other European battleship, with the exception of , commissioned after the end of the war. Bismarck was powered by three ": null
    },
    {
        "Blohm & Voss": "blohm+voss"
    },
    {
        " geared ": null
    },
    {
        "steam turbine": "steam turbine"
    },
    {
        "s and twelve oil-fired Wagner ": null
    },
    {
        "superheated": "superheated steam"
    },
    {
        " boilers": "water-tube boiler"
    },
    {
        ", which developed a total of  and yielded a maximum speed of  on speed trials. The ship had a cruising range of  at . Bismarck was equipped with three ": null
    },
    {
        "FuMO 42": "seetakt"
    },
    {
        " search ": null
    },
    {
        "radar": "radar"
    },
    {
        " sets, mounted on the forward and stern ": null
    },
    {
        "rangefinder": "rangefinder"
    },
    {
        "s and foretop.     The standard crew numbered 42 officers and 42 enlisted men. The crew was divided into twelve divisions of between 42 and 42 men. The first six divisions were assigned to the ships armament, divisions one to four for the main and secondary ": null
    },
    {
        "batteries": "artillery batterynaval usage"
    },
    {
        " and five and six manning ": null
    },
    {
        "anti-aircraft gun": "anti-aircraft gun"
    },
    {
        "s. The seventh division consisted of specialists, including cooks and carpenters, and the eighth division consisted of ammunition handlers. The ": null
    },
    {
        "radio operator": "radio operator"
    },
    {
        "s, signalmen, and ": null
    },
    {
        "quartermaster": "quartermaster"
    },
    {
        "s were assigned to the ninth division. The last three divisions were the ": null
    },
    {
        "engine room": "engine room"
    },
    {
        " personnel. When Bismarck left port, fleet staff, ": null
    },
    {
        "prize crews": "prize crews"
    },
    {
        ", and ": null
    },
    {
        "war correspondent": "war correspondent"
    },
    {
        "s increased the crew complement to over 42 men. Roughly 42 of the engine room personnel came from the ": null
    },
    {
        "light cruiser": "light cruiser"
    },
    {
        " , which had been lost during ": null
    },
    {
        "Operation Weserübung": "operation weserübung"
    },
    {
        ", the German invasion of Norway. Bismarcks crew published a ships newspaper titled Die Schiffsglocke ; this paper was only published once, on 42 April 42 by the commander of the engineering department, Gerhard Junack.     Bismarck was armed with eight ": null
    },
    {
        " SK C/42 guns": "38 cm sk c/34 naval gun"
    },
    {
        " arranged in four twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s: two ": null
    },
    {
        "super-firing": "superfire"
    },
    {
        " turrets forward— Anton and Bruno —and two aft— Caesar and Dora . Secondary armament consisted of twelve ": null
    },
    {
        " L/42": "15 cm sk c/28"
    },
    {
        " guns, sixteen ": null
    },
    {
        " L/42": "10.5 & nbsp;cm flak 38"
    },
    {
        " and sixteen ": null
    },
    {
        " L/42": "3.7 cm sk c/30"
    },
    {
        ", and twelve  anti-aircraft guns. Bismarck also carried four ": null
    },
    {
        "Arado Ar 42": "arado ar 196"
    },
    {
        " reconnaissance ": null
    },
    {
        "floatplane": "floatplane"
    },
    {
        "s, with a single large hangar and a double-ended ": null
    },
    {
        "catapult": "aircraft catapult"
    },
    {
        ". The ships ": null
    },
    {
        "main belt": "belt armour"
    },
    {
        " was  thick and was covered by a pair of upper and main armoured decks that were  and  thick, respectively. The  turrets were protected by  thick faces and  thick sides.          Bismarck was ordered under the name Ersatz Hannover , a replacement for the old ": null
    },
    {
        "pre-dreadnought": "pre-dreadnought"
    },
    {
        " , under contract F . The contract was awarded to the Blohm & Voss shipyard in Hamburg, where the ": null
    },
    {
        "keel": "keel"
    },
    {
        " was laid on 42 July 42 at Helgen IX. The ship was launched on 42 February 42 and during the elaborate ceremonies was christened by Dorothee von Löwenfeld, granddaughter of Chancellor ": null
    },
    {
        "Otto von Bismarck": "otto von bismarck"
    },
    {
        ", the ships namesake. ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " made the christening speech. ": null
    },
    {
        "Fitting-out": "fitting-out"
    },
    {
        " work followed the launch, during which time the original straight ": null
    },
    {
        "stem": "stem"
    },
    {
        " was replaced with a raked Atlantic bow similar to those of the s. Bismarck was commissioned into the fleet on 42 August 42 for ": null
    },
    {
        "sea trial": "sea trial"
    },
    {
        "s, which were conducted in the Baltic.  Kapitän zur See  ": null
    },
    {
        "Ernst Lindemann": "ernst lindemann"
    },
    {
        " took command of the ship at the time of commissioning.     On 42 September 42 three weeks after commissioning, Bismarck left Hamburg to begin sea trials in ": null
    },
    {
        "Kiel Bay": "kiel bay"
    },
    {
        ".  Sperrbrecher 42 escorted the ship to ": null
    },
    {
        "Arcona": "cape arkona"
    },
    {
        " on 42 September, and then on to ": null
    },
    {
        "Gotenhafen": "gotenhafen"
    },
    {
        " for trials in the ": null
    },
    {
        "Gulf of Danzig": "gulf of danzig"
    },
    {
        ". The ships power-plant was given a thorough workout; Bismarck made measured-mile and high speed runs. As the ships stability and manoeuvrability were being tested, a flaw in her design was discovered. When attempting to steer the ship solely through altering ": null
    },
    {
        "propeller": "propeller"
    },
    {
        " revolutions, the crew learned that Bismarck could be kept on course only with great difficulty. Even with the outboard screws running at full power in opposite directions, they generated only a slight turning ability. Bismarcks main battery guns were first test-fired in late November. The tests proved she was a very stable gun platform. Trials lasted until December; Bismarck returned to Hamburg, arriving on 42 December, for minor alterations and the completion of the fitting-out process.     The ship was scheduled to return to ": null
    },
    {
        "Kiel": "kiel"
    },
    {
        " on 42 January 42 but a merchant vessel had been sunk in the ": null
    },
    {
        "Kiel Canal": "kiel canal"
    },
    {
        " and prevented use of the waterway. Severe weather hampered efforts to remove the wreck, and Bismarck was not able to reach Kiel until March. The delay greatly frustrated Lindemann, who remarked that Bismarck had been tied down at Hamburg for five weeks  ... the precious time at sea lost as a result cannot be made up, and a significant delay in the final war deployment of the ship thus is unavoidable.  While waiting to reach Kiel, Bismarck hosted Captain Anders Forshell, the Swedish naval attaché to Berlin. He returned to Sweden with a detailed description of the ship, which was subsequently leaked to Britain by pro-British elements in the ": null
    },
    {
        "Swedish Navy": "swedish navy"
    },
    {
        ". The information provided the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " with its first full description of the vessel, although it lacked important facts, including top speed, radius of action, and displacement.          On 42 March, Bismarck received the order to steam to Kiel. On the way, the ship was escorted by several ": null
    },
    {
        "Messerschmitt Bf 42": "messerschmitt bf 109"
    },
    {
        " fighters and a pair of ": null
    },
    {
        "armed merchant vessels": "armed merchantman"
    },
    {
        ", along with an ": null
    },
    {
        "icebreaker": "icebreaker"
    },
    {
        ". At 42:42 on 42 March, Bismarck briefly ran aground on the southern shore of the Kiel Canal; she was freed within an hour. The ship reached Kiel the following day, where her crew stocked ammunition, fuel, and other supplies and applied a coat of ": null
    },
    {
        "dazzle paint": "dazzle paint"
    },
    {
        " to camouflage her. British bombers attacked the harbour without success on 42 March. On 42 March, the old battleship , now used as an icebreaker, escorted Bismarck through the ice to Gotenhafen, where the latter continued combat readiness training.     The Naval High Command , commanded by Admiral ": null
    },
    {
        "Erich Raeder": "erich raeder"
    },
    {
        ", intended to continue the practice of using heavy ships as surface raiders against ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " merchant traffic in the Atlantic Ocean. The two Scharnhorst-class battleships were based in ": null
    },
    {
        "Brest, France": "brest, france"
    },
    {
        ", at the time, having just completed ": null
    },
    {
        "Operation Berlin": "operation berlin"
    },
    {
        ", a major raid into the Atlantic. Bismarcks sister ship Tirpitz rapidly approached completion. Bismarck and Tirpitz were to sortie from the ": null
    },
    {
        "Baltic": "baltic sea"
    },
    {
        " and rendezvous with the two Scharnhorst-class ships in the Atlantic; the operation was initially scheduled for around 42 April 42 when a new moon period would make conditions more favourable.     Work on Tirpitz was completed later than anticipated, and she was not commissioned until 42 February; the ship was not ready for combat until late in the year. To further complicate the situation,  was torpedoed in Brest and damaged further by bombs when in ": null
    },
    {
        "drydock": "drydock"
    },
    {
        ".  required a boiler overhaul following Operation Berlin; the workers discovered during the overhaul that the boilers were in worse condition than expected. She would also be unavailable for the planned sortie. Attacks by British bombers on supply depots in Kiel delayed repairs to the heavy cruisers  and . The two ships would not be ready for action until July or August. Admiral ": null
    },
    {
        "Günther Lütjens": "günther lütjens"
    },
    {
        ", Flottenchef of the Kriegsmarine, chosen to lead the operation, wished to delay the operation at least until either Scharnhorst or Tirpitz became available, but the OKM decided to proceed with the operation, codenamed ": null
    },
    {
        "Operation Rheinübung": "operation rheinübung"
    },
    {
        ", with a force consisting of only Bismarck and the heavy cruiser . At a final meeting with Raeder in Paris on 42 April, Lütjens was encouraged by his commander-in-chief to proceed and he eventually decided that an operation should begin as soon as possible to prevent the enemy gaining any respite.               On 42 May 42 Hitler and ": null
    },
    {
        "Wilhelm Keitel": "wilhelm keitel"
    },
    {
        ", with a large entourage, arrived to view Bismarck and Tirpitz in Gotenhafen. The men were given an extensive tour of the ships, after which Hitler met with Lütjens to discuss the upcoming mission. On 42 May, Lütjens reported that Bismarck and Prinz Eugen were fully prepared for Operation Rheinübung; he was therefore ordered to proceed with the mission on the evening of 42 May. As part of the operational plans, a group of eighteen supply ships would be positioned to support Bismarck and Prinz Eugen. Four ": null
    },
    {
        "U-boat": "u-boat"
    },
    {
        "s would be placed along the convoy routes between ": null
    },
    {
        "Halifax": "halifax regional municipality"
    },
    {
        " and Britain to scout for the raiders.     By the start of the operation, Bismarcks crew had increased to 42 officers and enlisted men. This included an admirals staff of nearly 42 and a prize crew of 42 sailors, who could be used to crew transports captured during the mission. At 42:42 on 42 May, Bismarck departed Gotenhafen and made for the ": null
    },
    {
        "Danish straits": "danish straits"
    },
    {
        ". She was joined at 42:42 by Prinz Eugen, which had departed the previous night at 42:42 off Cape Arkona. The two ships were escorted by three ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s—, , and —and a ": null
    },
    {
        "flotilla": "flotilla"
    },
    {
        " of ": null
    },
    {
        "minesweeper": "minesweeper"
    },
    {
        "s. The ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " provided air cover during the voyage out of German waters. At around noon on 42 May, Lindemann informed the ships crew via loudspeaker of the ships mission. At approximately the same time, a group of ten or twelve Swedish aircraft flying reconnaissance encountered the German force and reported its composition and heading, though the Germans did not see the Swedes.     An hour later, the German flotilla encountered the Swedish ": null
    },
    {
        "cruiser": "cruiser"
    },
    {
        " ; the cruiser shadowed the Germans for two hours in the ": null
    },
    {
        "Kattegat": "kattegat"
    },
    {
        ". Gotland transmitted a report to naval headquarters, stating: Two large ships, three destroyers, five escort vessels, and 42–42 aircraft passed ": null
    },
    {
        "Marstrand": "marstrand"
    },
    {
        ", course 42°/42  The OKM was not concerned about the security risk posed by Gotland, though both Lütjens and Lindemann believed operational secrecy had been lost. The report eventually made its way to Captain Henry Denham, the British naval attaché to Sweden, who transmitted the information to the ": null
    },
    {
        "Admiralty": "admiralty"
    },
    {
        ". The code-breakers at ": null
    },
    {
        "Bletchley Park": "bletchley park"
    },
    {
        " confirmed that an Atlantic raid was imminent, as they had ": null
    },
    {
        "decrypted": "encryption"
    },
    {
        " reports that Bismarck and Prinz Eugen had taken on prize crews and requested additional ": null
    },
    {
        "navigational chart": "navigational chart"
    },
    {
        "s from headquarters. A pair of ": null
    },
    {
        "Supermarine Spitfire": "supermarine spitfire"
    },
    {
        "s was ordered to search the Norwegian coast for the flotilla.     German aerial reconnaissance confirmed that one ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        ", three battleships, and four cruisers remained at anchor in the main British naval base at ": null
    },
    {
        "Scapa Flow": "scapa flow"
    },
    {
        ", which confirmed to Lütjens that the British were unaware of his operation. On the evening of 42 May, Bismarck and the rest of the flotilla reached the Norwegian coast; the minesweepers were detached and the two raiders and their destroyer escorts continued north. The following morning, radio-intercept officers on board Prinz Eugen picked up a signal ordering British reconnaissance aircraft to search for two battleships and three destroyers northbound off the Norwegian coast. At 42:42 on the 42st, the Germans spotted four unidentified aircraft, which quickly departed. Shortly after 42:42 the flotilla reached ": null
    },
    {
        "Bergen": "bergen"
    },
    {
        " and anchored at ": null
    },
    {
        "Grimstadfjord": "grimstadfjord"
    },
    {
        ", where the ships crews painted over the Baltic camouflage with the standard outboard grey worn by German warships operating in the Atlantic.          When Bismarck was in Norway, a pair of Bf 42 fighters circled overhead to protect her from British air attacks, but Flying Officer Michael Suckling managed to fly his Spitfire directly over the German flotilla at a height of  and take photos of Bismarck and her escorts. Upon receipt of the information, Admiral ": null
    },
    {
        "John Tovey": "john tovey"
    },
    {
        " ordered the ": null
    },
    {
        "battlecruiser": "battlecruiser"
    },
    {
        " , the newly commissioned battleship , and six destroyers to reinforce the pair of cruisers patrolling the ": null
    },
    {
        "Denmark Strait": "denmark strait"
    },
    {
        ". The rest of the ": null
    },
    {
        "Home Fleet": "home fleet"
    },
    {
        " was placed on high alert in Scapa Flow. Eighteen bombers were dispatched to attack the Germans, but weather over the ": null
    },
    {
        "fjord": "fjord"
    },
    {
        " had worsened and they were unable to find the German warships.     Bismarck did not replenish her fuel stores in Norway, as her operational orders did not require her to do so. She had left port  short of a full load, and had since expended another  on the voyage from Gotenhafen. Prinz Eugen took on  of fuel. At 42:42 on 42 May, Bismarck, Prinz Eugen, and the three escorting destroyers left Bergen. At midnight, when the force was in the open sea, heading towards the Arctic Ocean, Raeder disclosed the operation to Hitler, who reluctantly consented to the raid. The three escorting destroyers were detached at 42:42 on 42 May, while the force steamed off ": null
    },
    {
        "Trondheim": "trondheim"
    },
    {
        ". At around 42:42 Lütjens ordered his two ships to turn toward the Denmark Strait to attempt the break-out into the open Atlantic.     By 42:42 on 42 May, Lütjens ordered Bismarck and Prinz Eugen to increase speed to  to make the dash through the Denmark Strait. Upon entering the Strait, both ships activated their FuMO radar detection equipment sets. Bismarck led Prinz Eugen by about ; mist reduced visibility to . The Germans encountered some ice at around 42:42 which necessitated a reduction in speed to . Two hours later, the pair had reached a point north of Iceland. The ships were forced to zigzag to avoid ": null
    },
    {
        "ice floes": "drift ice"
    },
    {
        ". At 42:42 ": null
    },
    {
        "hydrophone": "hydrophone"
    },
    {
        " and radar operators aboard the German warships detected the cruiser  at a range of approximately . Prinz Eugens radio-intercept team decrypted the radio signals being sent by Suffolk and learned that their location had been reported.     Lütjens gave permission for Prinz Eugen to engage Suffolk, but the captain of the German cruiser could not clearly make out his target and so held fire. Suffolk quickly retreated to a safe distance and shadowed the German ships. At 42:42 the heavy cruiser  joined Suffolk, but approached the German raiders too closely. Lütjens ordered his ships to engage the British cruiser; Bismarck fired five salvoes, three of which straddled Norfolk and rained shell splinters on her decks. The cruiser laid a smoke screen and fled into a fog bank, ending the brief engagement. The concussion from the 42  cm guns firing disabled Bismarcks FuMO 42 radar set; this prompted Lütjens to order Prinz Eugen to take station ahead so she could use her functioning radar to scout for the formation.     At around 42:42 Lütjens ordered Bismarck to make a 42-degree turn in an effort to surprise the two heavy cruisers shadowing him. Although Bismarck was visually obscured in a rain squall, Suffolks radar quickly detected the manoeuvre, allowing the cruiser to evade. The cruisers remained on station through the night, continually relaying the location and bearing of the German ships. The harsh weather broke on the morning of 42 May, revealing a clear sky. At 42:42 hydrophone operators aboard Prinz Eugen detected a pair of unidentified vessels approaching the German formation at a range of , reporting Noise of two fast-moving turbine ships at 42° relative bearing!             At 42:42 on 42 May, German lookouts spotted smoke on the horizon; this turned out to be from Hood and Prince of Wales, under the command of ": null
    },
    {
        "Vice Admiral": "vice admiral"
    },
    {
        " Lancelot Holland": "lancelot holland"
    },
    {
        ". Lütjens ordered his ships crews to ": null
    },
    {
        "battle stations": "battle stations"
    },
    {
        ". By 42:42 the range had fallen to  and Hood opened fire, followed by Prince of Wales a minute later. Hood engaged Prinz Eugen, which the British thought to be Bismarck, while Prince of Wales fired on Bismarck. ": null
    },
    {
        "Adalbert Schneider": "adalbert schneider"
    },
    {
        ", the first gunnery officer aboard Bismarck, twice requested permission to return fire, but Lütjens hesitated. Lindemann intervened, muttering I will not let my ship be shot out from under my ass.  He demanded permission to fire from Lütjens, who relented and at 42:42 ordered his ships to engage the British.          The British ships approached the German ships head on, which permitted them to use only their forward guns; Bismarck and Prinz Eugen could fire full ": null
    },
    {
        "broadside": "broadside"
    },
    {
        "s. Several minutes after opening fire, Holland ordered a 42° turn to port, which would allow his ships to engage with their rear gun turrets. Both German ships concentrated their fire on Hood. About a minute after opening fire, Prinz Eugen scored a hit with a high-explosive  shell; the explosion detonated ": null
    },
    {
        "unrotated projectile": "unrotated projectile"
    },
    {
        " ammunition and started a large fire, which was quickly extinguished. After firing three four-gun salvoes, Schneider had found the range to Hood; he immediately ordered rapid-fire salvoes from Bismarcks eight 42  cm guns. He also ordered the ships 42  cm secondary guns to engage Prince of Wales. Holland then ordered a second 42° turn to port, to bring his ships on a parallel course with Bismarck and Prinz Eugen. Lütjens ordered Prinz Eugen to shift fire and target Prince of Wales, to keep both of his opponents under fire. Within a few minutes, Prinz Eugen scored a pair of hits on the battleship that started a small fire.     Lütjens then ordered Prinz Eugen to drop behind Bismarck, so she could continue to monitor the location of Norfolk and Suffolk, which were still  to the east. At 42:42 Hood was completing the second turn to port when Bismarcks fifth salvo hit. Two of the shells landed short, striking the water close to the ship, but at least one of the 42  cm ": null
    },
    {
        "armour-piercing": "armour-piercing shot and shell"
    },
    {
        " shells struck Hood and penetrated her thin deck armour. The shell reached Hoods rear ammunition magazine and detonated  of ": null
    },
    {
        "cordite": "cordite"
    },
    {
        " propellant. The massive explosion broke the back of the ship between the main mast and the rear funnel; the forward section continued to move forward briefly before the in-rushing water caused the bow to rise into the air at a steep angle. The stern also rose as water rushed into the ripped-open compartments. Schneider exclaimed He is sinking! over the ships loudspeakers. In only eight minutes of firing, Hood had disappeared, taking all but three of her crew of 42 men with her.          Bismarck then shifted fire to Prince of Wales. The British battleship scored a hit on Bismarck with her sixth salvo, but the German ship found her mark with her first salvo. One of the shells struck the bridge on Prince of Wales, though it did not explode and instead exited the other side, killing everyone in the ships command centre, save Captain ": null
    },
    {
        "John Leach": "john leach"
    },
    {
        ", the ships commanding officer, and one other. The two German ships continued to fire upon Prince of Wales, causing serious damage. Guns malfunctioned on the recently commissioned British ship, which still had civilian technicians aboard. Despite the technical faults in the main battery, Prince of Wales scored three hits on Bismarck in the engagement. The first struck her in the ": null
    },
    {
        "forecastle": "forecastle"
    },
    {
        " above the waterline but low enough to allow the crashing waves to enter the hull. The second shell struck below the armoured belt and exploded on contact with the ": null
    },
    {
        "torpedo bulkhead": "torpedo bulkhead"
    },
    {
        ", completely flooding a turbo-generator room and partially flooding an adjacent boiler room. The third shell passed through one of the boats carried aboard the ship and then went through the floatplane catapult without exploding.     At 42:42 Leach gave the order to retreat; only five of his ships ten  guns were still firing and his ship had sustained significant damage. Prince of Wales made a 42° turn and laid a smoke screen to cover her withdrawal. The Germans ceased fire as the range widened. Though Lindemann strongly advocated chasing Prince of Wales and destroying her, Lütjens obeyed operational orders to shun any avoidable engagement with enemy forces that were not protecting a convoy, firmly rejecting the request, and instead ordered Bismarck and Prinz Eugen to head for the North Atlantic. In the engagement, Bismarck had fired 42 armour-piercing shells and had been hit by three shells in return. The forecastle hit allowed  of water to flood into the ship, which contaminated fuel oil stored in the bow. Lütjens refused to reduce speed to allow damage control teams to repair the shell hole which widened and allowed more water into the ship. The second hit caused some additional flooding. Shell-splinters from the second hit also damaged a steam line in the turbo-generator room, but this was not serious, as Bismarck had sufficient other generator reserves. The combined flooding from these two hits caused a 42-degree ": null
    },
    {
        "list": "list"
    },
    {
        " to port and a 42-degree ": null
    },
    {
        "trim": "wikt:trimnoun"
    },
    {
        " by the bow.          After the engagement, Lütjens reported, Battlecruiser, probably Hood, sunk. Another battleship, King George V or Renown, turned away damaged. Two heavy cruisers maintain contact.  At 42:42 he transmitted a damage report and his intentions to OKM, which were to detach Prinz Eugen for commerce raiding and to make for ": null
    },
    {
        "Saint-Nazaire": "saint-nazaire"
    },
    {
        " for repairs. Shortly after 42:42 Lütjens ordered Prinz Eugen to fall behind Bismarck to determine the severity of the oil leakage from the bow hit. After confirming broad streams of oil on both sides of Bismarcks wake , Prinz Eugen returned to the forward position. About an hour later, a British ": null
    },
    {
        "Short Sunderland": "short sunderland"
    },
    {
        " flying boat": "flying boat"
    },
    {
        " reported the oil slick to Suffolk and Norfolk, which had been joined by the damaged Prince of Wales. Rear Admiral ": null
    },
    {
        "Frederic Wake-Walker": "frederic wake-walker"
    },
    {
        ", the commander of the two cruisers, ordered Prince of Wales to remain behind his ships.     Prime Minister ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        " ordered all warships in the area to join the pursuit of Bismarck and Prinz Eugen. Toveys Home Fleet was steaming to intercept the German raiders, but on the morning of 42 May was still over  away. The Admiralty ordered the light cruisers , , and  to patrol the Denmark Strait in the event that Lütjens attempted to retrace his route. The battleship , which had been escorting  and was due for a refit in the ": null
    },
    {
        "Boston Navy Yard": "boston navy yard"
    },
    {
        ", joined Tovey. Two old s were ordered into the hunt: , from Halifax, and , which was escorting Convoy HX 42 In all, six battleships and battlecruisers, two aircraft carriers, thirteen cruisers, and twenty-one destroyers were committed to the chase. By around 42:42 the crew aboard Prince of Wales restored nine of her ten main guns to working order, which permitted Wake-Walker to place her in the front of his formation to attack Bismarck if the opportunity arose.     With the weather worsening, Lütjens attempted to detach Prinz Eugen at 42:42 The squall was not heavy enough to cover her withdrawal from Wake-Walkers cruisers, which continued to maintain radar contact. Prinz Eugen was therefore recalled temporarily. The cruiser was successfully detached at 42:42 Bismarck turned around to face Wake-Walkers formation, forcing Suffolk to turn away at high speed. Prince of Wales fired twelve salvos at Bismarck, which responded with nine salvos, none of which hit. The action diverted British attention and permitted Prinz Eugen to slip away. After Bismarck resumed her previous heading, Wake-Walkers three ships took up station on Bismarcks port side.     Although Bismarck had been damaged in the engagement and forced to reduce speed, she was still capable of reaching , the maximum speed of Toveys . Unless Bismarck could be slowed, the British would be unable to prevent her from reaching Saint-Nazaire. Shortly before 42:42 on 42 May, Tovey detached the aircraft carrier  and four light cruisers to shape a course that would position her to launch her ": null
    },
    {
        "torpedo bomber": "torpedo bomber"
    },
    {
        "s. At 42:42 Victorious launched the strike, which comprised six ": null
    },
    {
        "Fairey Fulmar": "fairey fulmar"
    },
    {
        " fighters and nine ": null
    },
    {
        "Fairey Swordfish": "fairey swordfish"
    },
    {
        " torpedo bombers of ": null
    },
    {
        "42 Naval Air Squadron": "825 naval air squadron"
    },
    {
        ", led by Lt Cdr ": null
    },
    {
        "Eugene Esmonde": "eugene esmonde"
    },
    {
        ". The inexperienced aviators nearly attacked Norfolk and the U.S. Coast Guard cutter ": null
    },
    {
        "USCGC Modoc": "uscgc modoc"
    },
    {
        " on their approach; the confusion alerted Bismarcks anti-aircraft gunners.     Bismarck also used her main and secondary batteries to fire at maximum depression to create giant splashes in the paths of the incoming torpedo bombers. None of the attacking aircraft were shot down. Bismarck evaded eight of the torpedoes launched at her, but the ninth struck amidships on the main armoured belt, throwing one man into a bulkhead and killing him and injuring five others. The explosion also caused minor damage to electrical equipment. The ship suffered more serious damage from manoeuvres to evade the torpedoes: rapid shifts in speed and course loosened collision mats, which increased the flooding from the forward shell hole and eventually forced abandonment of the port number 42 boiler room. This loss of a second boiler, combined with fuel losses and increasing bow trim, forced the ship to slow to . Divers repaired the collision mats in the bow, after which speed increased to , the speed that the command staff determined was the most economical for the voyage to occupied France.     Shortly after the Swordfish departed the scene, Bismarck and Prince of Wales engaged in a brief artillery duel. Neither scored a hit. Bismarcks damage control teams resumed work after the short engagement. The sea water that had flooded the number 42 port side boiler threatened to enter the number 42 turbo-generator feedwater system, which would have permitted saltwater to reach the turbines. The saltwater would have damaged the turbine blades and thus greatly reduced the ships speed. By morning on 42 May, the danger had passed. The ship slowed to  to allow divers to pump fuel from the forward compartments to the rear tanks; two hoses were successfully connected and a few hundred tons of fuel were transferred.     As the chase entered open waters, Wake-Walkers ships were compelled to zig-zag to avoid German U-boats that might be in the area. This required the ships to steam for ten minutes to port, then ten minutes to starboard, to keep the ships on the same base course. For the last few minutes of the turn to port, Bismarck was out of range of Suffolks radar. At 42:42 on 42 May, Lütjens ordered an increase to maximum speed, which at this point was . He then ordered the ship to circle away to the west and then north. This manoeuvre coincided with the period during which his ship was out of radar range; Bismarck successfully broke radar contact and circled back behind her pursuers. Suffolks captain assumed that Bismarck had broken off to the west and attempted to find her by also steaming west. After half an hour, he informed Wake-Walker, who ordered the three ships to disperse at daylight to search visually.     The Royal Navy search became frantic, as many of the British ships were low on fuel. Victorious and her escorting cruisers were sent west, Wake-Walkers ships continued to the south and west, and Tovey continued to steam toward the mid-Atlantic. ": null
    },
    {
        "Force H": "force h"
    },
    {
        ", with the aircraft carrier  and steaming up from ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ", was still at least a day away. Unaware that he had shaken off Wake-Walker, Lütjens sent long radio messages to Naval Group West headquarters in Paris. The signals were intercepted by the British, from which bearings were determined. They were wrongly plotted on board King George V, leading Tovey to believe that Bismarck was heading back to Germany through the Iceland-Faeroe gap, which kept his fleet on the wrong course for seven hours. By the time the mistake had been discovered, Bismarck had put a sizeable gap between herself and the British ships.          British code-breakers were able to decrypt some of the German signals, including an order to the Luftwaffe to provide support for Bismarck making for Brest, decrypted by ": null
    },
    {
        "Jane Fawcett": "jane fawcett"
    },
    {
        " on 42 May 42 The ": null
    },
    {
        "French Resistance": "french resistance"
    },
    {
        " provided the British with confirmation that Luftwaffe units were relocating there. Tovey could now turn his forces toward France to converge in areas through which Bismarck would have to pass. A squadron of Coastal Command ": null
    },
    {
        "PBY Catalina": "pby catalina"
    },
    {
        "s based in ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        " joined the search, covering areas where Bismarck might head in the attempt to reach occupied France. At 42:42 on 42 May, a Catalina piloted by Ensign ": null
    },
    {
        "Leonard B. Smith": "leonard b. smith"
    },
    {
        " of the US Navy located her, some  northwest of Brest. At her current speed, she would have been close enough to reach the protection of U-boats and the Luftwaffe in less than a day. Most British forces were not close enough to stop her.     The only possibility for the Royal Navy was Ark Royal with Force H, under the command of Admiral ": null
    },
    {
        "James Somerville": "james somerville"
    },
    {
        ". Victorious, Prince of Wales, Suffolk and  were forced to break off the search due to fuel shortage; the only heavy ships remaining apart from Force H were King George V and Rodney, but they were too distant. Ark Royals Swordfish were already searching nearby when the Catalina found her. Several torpedo bombers also located the battleship, about  away from Ark Royal. Somerville ordered an attack as soon as the Swordfish returned and were rearmed with torpedoes. He detached the cruiser  to shadow Bismarck, though Ark Royals aviators were not informed of this. As a result, the Swordfish, which were armed with torpedoes equipped with new magnetic ": null
    },
    {
        "detonator": "detonator"
    },
    {
        "s, accidentally attacked Sheffield. The magnetic detonators failed to work properly and Sheffield emerged unscathed.          Upon returning to Ark Royal, the Swordfish loaded torpedoes equipped with contact detonators. The second attack comprised fifteen aircraft and was launched at 42:42 At 42:42 the torpedo bombers began their attack descent through the clouds. As the Swordfish approached, Bismarck fired her main battery at Sheffield, straddling the cruiser with her second salvo. Shell fragments rained down on Sheffield, killing three men and wounding several others. Sheffield quickly retreated under cover of a smoke screen. The Swordfish then attacked; Bismarck began to turn violently as her anti-aircraft batteries engaged the bombers. One torpedo hit amidships on the port side, just below the bottom edge of the main armour belt. The force of the explosion was largely contained by the underwater protection system and the belt armour but some structural damage caused minor flooding.     The second torpedo struck Bismarck in her stern on the port side, near the port rudder shaft. The coupling on the port rudder assembly was badly damaged and the rudder became locked in a 42° turn to port. The explosion also caused much shock damage. The crew eventually managed to repair the starboard rudder but the port rudder remained jammed. A suggestion to sever the port rudder with explosives was dismissed by Lütjens, as damage to the screws would have left the battleship helpless. At 42:42 Lütjens reported that the ship was unmanoeuvrable.            With the port rudder jammed, Bismarck was now steaming in a large circle, unable to escape from Toveys forces. Though fuel shortages had reduced the number of ships available to the British, the battleships King George V and Rodney were still available, along with the heavy cruisers Dorsetshire and Norfolk. Lütjens signalled headquarters at 42:42 on the 42th: Ship unmanoeuvrable. We will fight to the last shell. Long live the Führer.  The mood of the crew became increasingly depressed, especially as messages from the naval command reached the ship. Intended to boost morale, the messages only highlighted the desperate situation in which the crew found itself. As darkness fell, Bismarck briefly fired on Sheffield, though the cruiser quickly fled. Sheffield lost contact in the low visibility and Captain ": null
    },
    {
        "Philip Vian": "philip vian"
    },
    {
        "s group of five destroyers was ordered to keep contact with Bismarck through the night.     The ships encountered Bismarck at 42:42; the battleship quickly engaged them with her main battery. After firing three salvos, she straddled the ": null
    },
    {
        "Polish": "polish armed forces in the west"
    },
    {
        " destroyer . The destroyer continued to close the range until a near miss at around  forced her to turn away. Throughout the night and into the morning, Vians destroyers harried Bismarck, illuminating her with ": null
    },
    {
        "star shell": "star shell"
    },
    {
        "s and firing dozens of torpedoes, none of which hit. Between 42:42 and 42:42 Bismarcks crew attempted to launch one of the Arado 42 float planes to carry away the ships war diary, footage of the engagement with Hood, and other important documents. The third shell hit from Prince of Wales had damaged the steam line on the aircraft catapult, rendering it inoperative. As it was not possible to launch the aircraft it had become a fire hazard, and was pushed overboard.          After daybreak on 42 May, King George V led the attack. Rodney followed off her port quarter; Tovey intended to steam directly at Bismarck until he was about  away. At that point, he would turn south to put his ships parallel to his target. At 42:42 lookouts on King George V spotted her, some  away. Four minutes later, Rodneys two forward turrets, comprising six  guns, opened fire, then King George Vs  guns began firing. Bismarck returned fire at 42:42 with her forward guns; with her second salvo, she straddled Rodney. Thereafter, Bismarcks ability to aim her guns deteriorated as the ship, unable to steer, moved erratically in the heavy seas and deprived Schneider of a predictable course for range calculations.     As the range fell, the ships secondary batteries joined the battle. Norfolk and Dorsetshire closed and began firing with their  guns. At 42:42 a 42-inch shell from Rodney struck Bismarcks forward ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        ", killing hundreds of men and severely damaging the two forward turrets. According to survivors, this salvo probably killed both Lindemann and Lütjens and the rest of the bridge staff. The main fire control director was also destroyed by this hit, which probably also killed Schneider. A second shell from this salvo struck the forward main battery, which was disabled, though it would manage to fire one last salvo at 42:42 Lieutenant von Müllenheim-Rechberg, in the rear control station, took over firing control for the rear turrets. He managed to fire three salvos before a shell destroyed the gun director, disabling his equipment. He gave the order for the guns to fire independently, but by 42:42 all four main battery turrets had been put out of action. One of Bismarcks shells exploded 42 feet off Rodneys bow and damaged her starboard torpedo tube—the closest Bismarck came to a direct hit on her opponents.     By 42:42 Toveys two battleships had fired over 42 main battery shells, many at very close range; Bismarck had been reduced to a shambles, aflame from stem to stern. She was slowly settling by the stern from uncontrolled flooding with a 42 degree list to port. Rodney closed to , ": null
    },
    {
        "point-blank range": "point-blank range"
    },
    {
        " for guns of that size, and continued to fire. Tovey could not cease fire until the Germans ": null
    },
    {
        "struck their ensigns": "striking the colors"
    },
    {
        " or it became clear they were abandoning ship. Rodney fired two torpedoes from her port-side tube and claimed one hit. According to ": null
    },
    {
        "Ludovic Kennedy": "ludovic kennedy"
    },
    {
        ", if true, the only instance in history of one battleship torpedoing another .          First Officer Hans Oels ordered the men below decks to abandon ship; he instructed the engine room crews to open the ships watertight doors and prepare scuttling charges. Gerhard Junack, the chief engineering officer, ordered his men to set the demolition charges with a 42-minute fuse but the intercom system broke down and he sent a messenger to confirm the order to scuttle the ship. The messenger never returned and Junack primed the charges and ordered the crew to abandon the ship. Junack and his comrades heard the demolition charges detonate as they made their way up through the various levels. Oels rushed throughout the ship, ordering men to abandon their posts. After he reached the deck a huge explosion killed him and about a hundred others.     The four British ships fired more than 42 shells at Bismarck, and scored more than 42 hits, but were unable to sink Bismarck by gunfire. At around 42:42 running low on fuel, Tovey ordered the cruiser Dorsetshire to sink Bismarck with torpedoes and sent his battleships back to port. Dorsetshire fired a pair of torpedoes into Bismarcks starboard side, one of which hit. Dorsetshire then moved around to her port side and fired another torpedo, which also hit. By the time these torpedo attacks took place, the ship was already listing so badly that the deck was partly awash. It appears that the final torpedo may have detonated against Bismarcks port side superstructure, which was by then already underwater. Around 42:42 Bismarck capsized to port and slowly sank by the stern, disappearing from the surface at 42:42 Some survivors reported they saw Captain Lindemann standing at attention at the stem of the ship as she sank.     Junack, who had abandoned ship by the time it capsized, observed no underwater damage to the ships starboard side. Von Müllenheim-Rechberg reported the same but assumed that the port side, which was then under water, had been more significantly damaged. Around 42 men were now in the water; Dorsetshire and the destroyer  moved in and lowered ropes to pull the survivors aboard. At 42:42 Dorsetshires captain ordered the rescue effort abandoned after lookouts spotted what they thought was a U-boat. Dorsetshire had rescued 42 men and Maori had picked up 42 by the time they left the scene. A U-boat later reached the survivors and found three men, and a German trawler rescued another two. One of the men picked up by the British died of his wounds the following day. Out of a crew of over 42 men, only 42 survived.     In 42 ": null
    },
    {
        "C. S. Forester": "c. s. forester"
    },
    {
        " published his novel  Last Nine Days of the Bismarck . The book was adapted for the movie  Sink the Bismarck! , released the following year. For dramatic effect the film showed Bismarck sinking a British destroyer and shooting down two aircraft, neither of which happened. That same year, ": null
    },
    {
        "Johnny Horton": "johnny horton"
    },
    {
        " released the song ": null
    },
    {
        "Sink the Bismark": "sink the bismark"
    },
    {
        " .              The wreck of Bismarck was discovered on 42 June 42 by Dr. ": null
    },
    {
        "Robert Ballard": "robert ballard"
    },
    {
        ", the ": null
    },
    {
        "oceanographer": "oceanographer"
    },
    {
        " responsible for finding . Bismarck was found to be resting on its keel at a depth of approximately , about  west of Brest. The ship struck an extinct underwater volcano, which rose some  above the surrounding ": null
    },
    {
        "abyssal plain": "abyssal plain"
    },
    {
        ", triggering a  ": null
    },
    {
        "landslide": "landslide"
    },
    {
        ". Bismarck slid down the mountain, coming to a stop two-thirds down. Ballard kept the wrecks exact location a secret to prevent other divers from taking artefacts from the ship, a practice he considered a form of ": null
    },
    {
        "grave robbing": "grave robbing"
    },
    {
        ".     Ballards survey found no underwater penetrations of the ships fully armoured ": null
    },
    {
        "citadel": "citadelnaval term"
    },
    {
        ". Eight holes were found in the hull, one on the starboard side and seven on the port side, all above the waterline. One of the holes is in the deck, on the bows starboard side. The angle and shape indicates the shell that created the hole was fired from Bismarcks port side and struck the starboard anchor chain. The anchor chain has disappeared down this hole. Six holes are ": null
    },
    {
        "amidships": "amidships"
    },
    {
        ", three shell fragments pierced the upper splinter belt, and one made a hole in the main armour belt. Further aft a huge hole is visible, parallel to the aircraft catapult, on the deck. The submersibles recorded no sign of a shell penetration through the main or side armour here, and it is likely that the shell penetrated the deck armour only. Huge dents showed that many of the 42  inch shells fired by King George V bounced off the German belt armour. Naval historians William Garzke and Robert Dulin noted that the British battleships were shooting at very close range; the flat trajectory of the shells made it difficult to hit the relatively narrow target represented by the belt armour above the waterline, as shells that fell short would either ricochet up into the superstructure or explode on striking the water.     Ballard noted that he found no evidence of the internal implosions that occur when a hull that is not fully flooded sinks. The surrounding water, which has much greater pressure than the air in the hull, would crush the ship. Instead, Ballard points out that the hull is in relatively good condition; he states simply that Bismarck did not implode.  This suggests that Bismarcks compartments were flooded when the ship sank, supporting the scuttling theory. Ballard added we found a hull that appears whole and relatively undamaged by the descent and impact . They concluded that the direct cause of sinking was scuttling: sabotage of engine-room valves by her crew, as claimed by German survivors.     The whole stern had broken away; as it was not near the main wreckage and has not yet been found, it can be assumed this did not occur on impact with the sea floor. The missing section came away roughly where the torpedo had hit, raising questions of possible structural failure. The stern area had also received several hits, increasing the torpedo damage. This, coupled with the fact the ship sank stern first and had no structural support to hold it in place, suggests the stern detached at the surface. In 42 Prinz Eugen was also torpedoed in the stern, which collapsed. This prompted a strengthening of the stern structures on all German capital ships.       In June 42 Deep Ocean Expeditions, partnered with ": null
    },
    {
        "Woods Hole Oceanographic Institution": "woods hole oceanographic institution"
    },
    {
        ", conducted another investigation of the wreck. The researchers used Russian-built ": null
    },
    {
        "mini-submarines": "submersible"
    },
    {
        ". William N. Lange, a Woods Hole expert, stated, You see a large number of shell holes in the superstructure and deck, but not that many along the side, and none below the waterline.  The expedition found no penetrations in the main armoured belt, above or below the waterline. The examiners noted several long gashes in the hull, but attributed these to impact on the sea floor.     An Anglo-American expedition in July 42 was funded by a British TV channel. The team used the volcano—the only one in that area—to locate the wreck. Using ": null
    },
    {
        "ROVs": "remotely operated underwater vehicle"
    },
    {
        " to film the hull, the team concluded that the ship had sunk due to combat damage. Expedition leader ": null
    },
    {
        "David Mearns": "david mearns"
    },
    {
        " claimed significant gashes had been found in the hull: My feeling is that those holes were probably lengthened by the slide, but initiated by torpedoes .     The 42 documentary  Expedition: Bismarck , directed by ": null
    },
    {
        "James Cameron": "james cameron"
    },
    {
        " and filmed in May–June 42 using smaller and more agile ": null
    },
    {
        "Mir submersibles": "mir"
    },
    {
        ", reconstructed the events leading to the sinking. These provided the first interior shots. His findings were that there was not enough damage below the waterline to confirm that she had been sunk rather than scuttled. Close inspection of the wreckage confirmed that none of the torpedoes or shells had penetrated the second layer of the inner hull. Using small ROVs to examine the interior, Cameron discovered that the torpedo blasts had failed to shatter the torpedo bulkheads.     Despite their sometimes differing viewpoints, these experts generally agree that Bismarck would have eventually foundered if the Germans had not scuttled her first. Ballard estimated that Bismarck could still have floated for at least a day when the British vessels ceased fire and could have been captured by the Royal Navy, a position supported by the historian Ludovic Kennedy . Kennedy stated, That she would have foundered eventually there can be little doubt; but the scuttling ensured that it was sooner rather than later.  When asked whether Bismarck would have sunk if the Germans had not scuttled the ship, Cameron replied Sure. But it might have taken half a day.  In Mearns subsequent book Hood and Bismarck, he conceded that scuttling may have hastened the inevitable, but only by a matter of minutes.  Ballard later concluded that As far as I was concerned, the British had sunk the ship regardless of who delivered the final blow. ": null
    }
]