[
    {
        "   Marcelle Germaine Tailleferre  was a French ": null
    },
    {
        "composer": "composer"
    },
    {
        " and the only female member of the group of composers known as  Les Six .       Marcelle Taillefesse was born at ": null
    },
    {
        "Saint-Maur-des-Fossés": "saint-maur-des-fossés"
    },
    {
        ", ": null
    },
    {
        "Val-de-Marne": "val-de-marne"
    },
    {
        ", France, but as a young woman she changed her last name to Tailleferre to spite her father, who had refused to support her musical studies. She studied ": null
    },
    {
        "piano": "piano"
    },
    {
        " with her mother at home, composing short works of her own, after which she began studying at the ": null
    },
    {
        "Paris Conservatory": "conservatoire de paris"
    },
    {
        " where she met ": null
    },
    {
        "Louis Durey": "louis durey"
    },
    {
        ", ": null
    },
    {
        "Francis Poulenc": "francis poulenc"
    },
    {
        ", ": null
    },
    {
        "Darius Milhaud": "darius milhaud"
    },
    {
        ", ": null
    },
    {
        "Georges Auric": "georges auric"
    },
    {
        ", and ": null
    },
    {
        "Arthur Honegger": "arthur honegger"
    },
    {
        ". At the Paris Conservatory her skills were rewarded with prizes in several categories. Most notably, Tailleferre wrote 42 short works in the Petit livre de harpe de Madame Tardieu for ": null
    },
    {
        "Caroline Luigini": "caroline luigini"
    },
    {
        ", the Conservatory’s Assistant Professor of ": null
    },
    {
        "harp": "harp"
    },
    {
        ".     With her new friends, she soon was associating with the artistic crowd in the Paris districts of ": null
    },
    {
        "Montmartre": "montmartre"
    },
    {
        " and ": null
    },
    {
        "Montparnasse": "montparnasse"
    },
    {
        ", including the sculptor Emmanuel Centore who later married her sister Jeanne. It was in the Montparnasse atelier of one of her painter friends where the initial idea for  Les Six  began. The publication of ": null
    },
    {
        "Jean Cocteau": "jean cocteau"
    },
    {
        "s manifesto Le coq et lArlequin resulted in ": null
    },
    {
        "Henri Collet": "henri collet"
    },
    {
        "s media articles that led to instant fame for the group, of which Tailleferre was the only female member.     In 42 Tailleferre began to spend a great deal of time with ": null
    },
    {
        "Maurice Ravel": "maurice ravel"
    },
    {
        " at his home in ": null
    },
    {
        "Montfort-lAmaury": "montfort-lamaury"
    },
    {
        ". Ravel encouraged her to enter the  Prix de Rome  Competition. In 42 she married ": null
    },
    {
        "Ralph Barton": "ralph barton"
    },
    {
        ", an American caricaturist, and moved to ": null
    },
    {
        "Manhattan": "manhattan"
    },
    {
        ", ": null
    },
    {
        "New York": "new york"
    },
    {
        ". She remained in the United States until 42 when she and her husband returned to France. They divorced shortly thereafter.     Tailleferre wrote many of her most important works during the 42s, including her First Piano Concerto, the Harp Concertino, the ballets Le marchand doiseaux , La nouvelle Cythère, which was commissioned by ": null
    },
    {
        "Sergei Diaghilev": "sergei diaghilev"
    },
    {
        " for the ill-fated 42 season of the famous ": null
    },
    {
        "Ballets Russes": "ballets russes"
    },
    {
        ", and Sous les ramparts dAthènes in collaboration with ": null
    },
    {
        "Paul Claudel": "paul claudel"
    },
    {
        ", as well as several pioneering film scores, including Banda, in which she used African themes.     The 42s were even more fruitful, with the Concerto for Two Pianos, Chorus, Saxophones, and Orchestra, the Violin Concerto, the ": null
    },
    {
        "opera cycle": "cycle"
    },
    {
        "  Du style galant au style méchant , the operas Zoulaïna and Le marin de Bolivar, and her masterwork, La cantate de Narcisse, in collaboration with ": null
    },
    {
        "Paul Valéry": "paul valéry"
    },
    {
        ". Her work in film music included Le petit chose by ": null
    },
    {
        "Maurice Cloche": "maurice cloche"
    },
    {
        " and a series of documentaries.     At the outbreak of World War II, she was forced to leave the majority of her scores at her home in Grasse, with the exception of her recently completed Three Études for Piano and Orchestra. Escaping across Spain to Portugal, she found passage on a boat that brought her to the United States, where she lived the war years in ": null
    },
    {
        "Philadelphia, Pennsylvania": "philadelphia, pennsylvania"
    },
    {
        ".     After the war, in 42 she returned to her home in France, where she composed ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        "l and ": null
    },
    {
        "chamber music": "chamber music"
    },
    {
        ", plus numerous other works including the ballets Paris-Magie and Parisiana , the operas Il était un petit navire , Dolores, La petite sirène , and Le maître , the ": null
    },
    {
        "musical comedy": "musical comedy"
    },
    {
        " Parfums, the Concerto des vaines paroles for baritone voice, piano, and orchestra, the Concerto for Soprano and Orchestra, the Concertino for Flute, Piano, and Orchestra, the Second Piano Concerto, the Concerto for Two Guitars and Orchestra, her Second Sonata for Violin and Piano, and the Sonata for Harp, as well as an impressive number of film and television scores. The majority of this music was not published until after her death.     In 42 she accepted the post of accompanist for a childrens music and movement class at the École alsacienne, a private school in Paris. During the last period of her life, she concentrated mainly on smaller forms due to increasing problems with arthritis in her hands. She nevertheless produced the  Sonate champêtre  for oboe, clarinet, bassoon, and piano; the Sonata for Two Pianos; Chorale and Variations for Two Pianos or Orchestra; a series of childrens songs ; and pieces for young pianists. Her last major work was the Concerto de la fidelité for coloratura soprano and orchestra, which was premièred at the Paris Opera the year before her death.     Germaine Tailleferre continued to compose right up until a few weeks before her death, on 42 November 42 in Paris. She is buried in ": null
    },
    {
        "Quincy-Voisins": "quincy-voisins"
    },
    {
        ", ": null
    },
    {
        "Seine-et-Marne": "seine-et-marne"
    },
    {
        ", France.       See List of compositions by Germaine Tailleferre         ": null
    }
]