[
    {
        "         Ghost in the Shell, known in Japan as  is a Japanese ": null
    },
    {
        "cyberpunk": "cyberpunk"
    },
    {
        " science fiction": "science fiction"
    },
    {
        " media franchise originally published as a ": null
    },
    {
        "seinen manga": "seinen manga"
    },
    {
        " series ": null
    },
    {
        "of the same name": "ghost in the shell"
    },
    {
        " written and illustrated by ": null
    },
    {
        "Masamune Shirow": "masamune shirow"
    },
    {
        ". The manga, first serialized in 1989 under the subtitle of The Ghost in the Shell, and later published as its own ": null
    },
    {
        "tankōbon": "tankōbon"
    },
    {
        " volumes by ": null
    },
    {
        "Kodansha": "kodansha"
    },
    {
        ", told the story of the fictional counter-cyberterrorist organization ": null
    },
    {
        "Public Security Section 9": "public security section 9"
    },
    {
        ", led by protagonist Major ": null
    },
    {
        "Motoko Kusanagi": "motoko kusanagi"
    },
    {
        ", in the mid-21st century of Japan.     Animation studio ": null
    },
    {
        "Production I.G": "production i.g"
    },
    {
        " has produced several different anime adaptations of Ghost in the Shell, starting with the ": null
    },
    {
        "1995 film of the same name": "ghost in the shell"
    },
    {
        ", telling the story of Section 9s investigation of the ": null
    },
    {
        "Puppet Master": "puppet master"
    },
    {
        ". The television series  Ghost in the Shell: Stand Alone Complex  followed in 2002, telling an alternate story from the manga and first film, featuring Section 9s investigations of government corruption in the ": null
    },
    {
        "Laughing Man": "laughing man"
    },
    {
        " and ": null
    },
    {
        "Individual Eleven": "individual eleven"
    },
    {
        " incidents. A sequel to the 1995 film,  Ghost in the Shell 2: Innocence , was released in 2004. In 2006, the film  Ghost in the Shell: Stand Alone Complex - Solid State Society  retook the story of the television series. 2013 saw the start of the  Ghost in the Shell: Arise  ": null
    },
    {
        "original video animation": "original video animation"
    },
    {
        " series, consisting of four parts through mid-2014. The series was recompiled in early 2015 as a television series titled Ghost in the Shell: Arise - Alternative Architecture, airing with an additional two episodes .  An animated feature film produced by most of the Arise staff, titled  Ghost in the Shell: The New Movie , was released on June 20, 2015. A ": null
    },
    {
        "live-action American film": "ghost in the shell"
    },
    {
        ", a re-telling of the narrative of the original 1995 film, was released on March 31, 2017.            Shirow stated that he had always wanted the title of his manga to be Ghost in the Shell, even in Japan, but his original publishers preferred Mobile Armored Riot Police. He chose Ghost in the Shell in homage to ": null
    },
    {
        "Arthur Koestlers": "arthur koestler"
    },
    {
        "  The Ghost in the Machine , from which he also drew inspiration. Ghost in the Shell: Stand Alone Complex Official Log 1 , p. 9.  Young Magazine  Pirate Edition, 2003.          Primarily set in the mid-twenty-first century in the fictional Japanese city of , There is a real-world ": null
    },
    {
        "Niihama": "niihama, ehime"
    },
    {
        ", located in ": null
    },
    {
        "Ehime Prefecture": "ehime prefecture"
    },
    {
        ", but its name is written differently in ": null
    },
    {
        "kanji": "kanji"
    },
    {
        ": . otherwise known as , the manga and the many anime adaptations follow the members of ": null
    },
    {
        "Public Security Section 9": "public security section 9"
    },
    {
        ", a task-force consisting of various professionals at solving and preventing crime, mostly with some sort of police background. Political intrigue and counter-terrorism operations are standard fare for Section 9, but the various actions of corrupt officials, companies, and cyber-criminals in each scenario are unique and require the diverse skills of Section 9s staff to prevent a series of incidents from escalating.     In this ": null
    },
    {
        "post-cyberpunk": "post-cyberpunk"
    },
    {
        " iteration of a possible future, computer technology has advanced to the point that many members of the public possess cyberbrains, technology that allows them to interface their biological brain with various networks. The level of cyberization varies from simple minimal interfaces to almost complete replacement of the brain with cybernetic parts, in cases of severe trauma. This can also be combined with various levels of ": null
    },
    {
        "prostheses": "prostheses"
    },
    {
        ", with a fully prosthetic body enabling a person to become a ": null
    },
    {
        "cyborg": "cyborg"
    },
    {
        ". The main character of Ghost in the Shell, Major ": null
    },
    {
        "Motoko Kusanagi": "motoko kusanagi"
    },
    {
        ", is such a cyborg, having had a terrible accident befall her as a child that ultimately required her to use a full-body prosthesis to house her cyberbrain. This high level of cyberization, however, opens the brain up to attacks from highly skilled hackers, with the most dangerous being those who will hack a person to bend to their whims.              The original Ghost in the Shell manga ran in Japan from April 1989 to November 1990 in ": null
    },
    {
        "Kodanshas": "kodansha"
    },
    {
        "manga anthology  Young Magazine , and was released in a  tankōbon  volume on October 5, 1991.  Ghost in the Shell 2: Man-Machine Interface followed 1997 for 9 issues in Young Magazine, and was collected in the Ghost in the Shell: Solid Box on December 1, 2000.  Four stories from Man-Machine Interface that were not released in tankobon format from previous releases were later collected in Ghost in the Shell 1.5: Human-Error Processor, and published by Kodansha on July 23, 2003.  Several art books have also been published for the manga.            Two animated films based on the original manga have been released, both directed by ": null
    },
    {
        "Mamoru Oshii": "mamoru oshii"
    },
    {
        " and animated by ": null
    },
    {
        "Production I.G": "production i.g"
    },
    {
        ".  Ghost in the Shell  was released in 1995 and follows the Puppet Master storyline from the manga. It was re-released in 2008 as Ghost in the Shell 2.0 with new audio and updated 3D computer graphics in certain scenes.  Innocence, otherwise known as  Ghost in the Shell 2: Innocence , was released in 2004, with its story based on a chapter from the first manga.     On September 5, 2014, it was revealed by Production I.G. that a new Ghost in the Shell animated film,  in Japanese, would be released in 2015 promising to show the further evolution .  On January 8, 2015, a short teaser trailer was revealed for the project unveiling a redesigned Major more closely resembling her appearance from the older films, and a plot following the Arise continuity of the franchise.  The trailer listed Kazuya Nomura as the director, Kazuchika Kise as the general director and character designer, Toru Okubo as the animation director, Tow Ubukata as the screenplay writer and ": null
    },
    {
        "Cornelius": "cornelius"
    },
    {
        " as the composer. The film premiered on June 20, 2015, in Japanese theaters.          In 2008, ": null
    },
    {
        "DreamWorks": "dreamworks pictures"
    },
    {
        " and producer ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        " acquired the rights to a ": null
    },
    {
        "live-action": "live-action"
    },
    {
        " film adaptation of the original Ghost in the Shell manga.  On January 24, 2014, ": null
    },
    {
        "Rupert Sanders": "rupert sanders"
    },
    {
        " was announced as director, with a screenplay by William Wheeler.  In April 2016, the full cast was announced, which included ": null
    },
    {
        "Juliette Binoche": "juliette binoche"
    },
    {
        ", ": null
    },
    {
        "Chin Han": "ng chin han"
    },
    {
        ", ": null
    },
    {
        "Lasarus Ratuere": "lasarus ratuere"
    },
    {
        " and ": null
    },
    {
        "Kaori Momoi": "kaori momoi"
    },
    {
        ", and ": null
    },
    {
        "Scarlett Johansson": "scarlett johansson"
    },
    {
        " in the lead role;  the casting of Johansson drew accusations of ": null
    },
    {
        "whitewashing": "whitewashing in film"
    },
    {
        ".     ": null
    },
    {
        "Principal photography": "principal photography"
    },
    {
        " on the film began on location in ": null
    },
    {
        "Wellington": "wellington"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ", on February 1, 2016. Filming wrapped in June 2016.  Ghost in the Shell premiered in Tokyo on March 16, 2017, and was released in the United States on March 31, 2017, in 2D, ": null
    },
    {
        "3D": "3d film"
    },
    {
        " and ": null
    },
    {
        "IMAX 3D": "imax"
    },
    {
        ".  It received mixed reviews, with praise for its visuals and Johanssons performance but criticism for its script.         Stand Alone Complex TV series and film   In 2002, Ghost in the Shell: Stand Alone Complex premiered on ": null
    },
    {
        "Animax": "animax"
    },
    {
        ", presenting a new telling of Ghost in the Shell independent from the original manga, focusing on Section 9s investigation of the ": null
    },
    {
        "Laughing Man": "laughing man"
    },
    {
        " hacker.  It was followed in 2004 by a second season titled Ghost in the Shell: S.A.C. 2nd GIG, which focused on the ": null
    },
    {
        "Individual Eleven": "individual eleven"
    },
    {
        " terrorist group.  The primary storylines of both seasons were compressed into OVAs broadcast as Ghost in the Shell: Stand Alone Complex The Laughing Man in 2005 and Ghost in the Shell: Stand Alone Complex Individual Eleven in 2006.   Also in 2006,  Ghost in the Shell: Stand Alone Complex - Solid State Society , featuring Section 9s confrontation with a hacker known as the Puppeteer, was broadcast, serving as a finale to the anime series.  ": null
    },
    {
        "The extensive score": "music of ghost in the shell: stand alone complex"
    },
    {
        " for the series and its films was composed by ": null
    },
    {
        "Yoko Kanno": "yoko kanno"
    },
    {
        ".      In addition to the anime, a series of published books, two separate manga adaptations, and several video games for consoles and mobile phones have been released for Stand Alone Complex.     Arise OVA, TV series and film     In 2013, a new iteration of the series titled  Ghost in the Shell: Arise  premiered, taking an original look at the Ghost in the Shell world, set before the original manga. It was released as a series of four ": null
    },
    {
        "original video animation": "original video animation"
    },
    {
        " episodes from 2013 to 2014, then recompiled as a 10-episode television series under the title of Kōkaku Kidōtai: Arise - Alternative Architecture. An additional fifth OVA titled Pyrophoric Cult, originally premiering in the Alternative Architecture broadcast as two original episodes, was released on August 26, 2015.  Kazuchika Kise served as the chief director of the series, with ": null
    },
    {
        "Tow Ubukata": "tow ubukata"
    },
    {
        " as head writer.  ": null
    },
    {
        "Cornelius": "cornelius"
    },
    {
        " was brought onto the project to compose the score for the series, with the Majors new voice actress ": null
    },
    {
        "Maaya Sakamoto": "maaya sakamoto"
    },
    {
        " also providing vocals for certain tracks.     Ghost in the Shell: The New Movie, also known as Ghost in the Shell: Arise − The Movie or New Ghost in the Shell, is a 2015 film directed by Kazuya Nomura that serves as a finale to the Ghost in the Shell: Arise story arc. The film is a continuation to the plot of the Pyrophoric Cult episode of Arise, and ties up loose ends from that arc.     A manga adaptation was serialized in Kodanshas Young Magazine, which started on March 13 and ended on August 26, 2013.       SAC_2045 ONA series": null
    },
    {
        "Kenji Kamiyama": "kenji kamiyama"
    },
    {
        " and ": null
    },
    {
        "Shinji Aramaki": "shinji aramaki"
    },
    {
        " will be co-directing a new Kōkaku Kidōtai anime production.  On December 7, 2018, it was reported by ": null
    },
    {
        "Netflix": "netflix"
    },
    {
        " that they had acquired the worldwide streaming rights to the anime, titled Ghost in the Shell: SAC_2045, and that it would premiere in 2020. The series will be in 3DCG and Sola Digital Arts will be collaborating with Production I.G on the project. It was later revealed that Ilya Kuvshinov will handle character designs.  It was stated that the new series will have two seasons of 12 episodes each.            Ghost in the Shell  was developed by Exact and released for the ": null
    },
    {
        "PlayStation": "playstation"
    },
    {
        " on July 17, 1997, in Japan by ": null
    },
    {
        "Sony Computer Entertainment": "sony computer entertainment"
    },
    {
        ".  It is a ": null
    },
    {
        "third-person shooter": "third-person shooter"
    },
    {
        " featuring an original storyline where the character plays a rookie member of Section 9. The video games soundtrack Megatech Body features various electronica artists.      Several video games were also developed to tie into the Stand Alone Complex television series, in addition to a ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        " by ": null
    },
    {
        "Nexon": "nexon"
    },
    {
        " and Neople titled  Ghost in the Shell: Stand Alone Complex - First Assault Online ,  released in 2016.        Ghost in the Shell influenced a number of prominent filmmakers. ": null
    },
    {
        "The Wachowskis": "the wachowskis"
    },
    {
        ", creators of  The Matrix  and its sequels, showed it to producer ": null
    },
    {
        "Joel Silver": "joel silver"
    },
    {
        ", saying, We wanna do that for real. ": null
    },
    {
        "Joel Silver": "joel silver"
    },
    {
        ", interviewed in Making The Matrix featurette on The Matrix DVD. The Matrix series took several concepts from the film, including the ": null
    },
    {
        "Matrix digital rain": "matrix digital rain"
    },
    {
        ", which was inspired by the opening credits of Ghost in the Shell, and the way characters access the Matrix through holes in the back of their necks.  Other parallels have been drawn to ": null
    },
    {
        "James Camerons": "james cameron"
    },
    {
        "  Avatar , ": null
    },
    {
        "Steven Spielbergs": "steven spielberg"
    },
    {
        "  A.I. Artificial Intelligence , and ": null
    },
    {
        "Jonathan Mostows": "jonathan mostow"
    },
    {
        "  Surrogates . James Cameron cited Ghost in the Shell as a source of inspiration,  citing it as an influence on Avatar.      ": null
    },
    {
        "Bungies": "bungie"
    },
    {
        "famous 2001 ": null
    },
    {
        "third-person": "third-person view"
    },
    {
        " action game  Oni  draws substantial inspiration from Ghost in the Shell setting and characters.   Ghost in the Shell also influenced video games such as the  Metal Gear Solid  series,   Deus Ex ,  and  Cyberpunk 2077 .  ": null
    }
]