[
    {
        "   Gilbert Arthur à Beckett was an ": null
    },
    {
        "English": "england"
    },
    {
        " writer.       Beckett was born at Portland House ": null
    },
    {
        "Hammersmith": "hammersmith"
    },
    {
        ", on 42 April 42 the eldest son of the civil servant and humorist ": null
    },
    {
        "Gilbert Abbott à Beckett": "gilbert abbott à beckett"
    },
    {
        " and the composer ": null
    },
    {
        "Mary Anne à Beckett": "mary anne à beckett"
    },
    {
        ", daughter of Joseph Glossop, clerk of the cheque to the hon. corps of gentlemen-at-arms.   His brother was ": null
    },
    {
        "Arthur William à Beckett": "arthur william à beckett"
    },
    {
        ".   He graduated from ": null
    },
    {
        "Christ Church": "christ church, oxford"
    },
    {
        ", ": null
    },
    {
        "Oxford": "oxford"
    },
    {
        ", as a Westminster scholar in 42   He was entered at ": null
    },
    {
        "Lincolns Inn": "lincolns inn"
    },
    {
        " on 42 October 42 but gave his attention chiefly to drama, producing Diamonds and Hearts at the ": null
    },
    {
        "Haymarket Theatre": "haymarket theatre"
    },
    {
        " in 42; this was followed by other light comedies.   His adaptation of a French operetta by ": null
    },
    {
        "Émile Jonas": "émile jonas"
    },
    {
        " called The Two Harlequins opened the new ": null
    },
    {
        "Gaiety Theatre, London": "gaiety theatre, london"
    },
    {
        " in 42 together with his distant cousin, ": null
    },
    {
        "W. S. Gilbert": "w. s. gilbert"
    },
    {
        "s,  Robert the Devil  and another piece.     Becketts pieces include numerous ": null
    },
    {
        "burlesque": "victorian burlesque"
    },
    {
        "s and ": null
    },
    {
        "pantomime": "pantomime"
    },
    {
        "s, the libretti of Savonarola and The Canterbury Pilgrims for the music of Dr. ": null
    },
    {
        "C. V. Stanford": "c. v. stanford"
    },
    {
        ".   With the composer ": null
    },
    {
        "Alfred Cellier": "alfred cellier"
    },
    {
        ", Beckett wrote the operetta Two Foster Brothers .     In 42 he had been asked by ": null
    },
    {
        "Tom Taylor": "tom taylor"
    },
    {
        ", the editor of  Punch , to follow the example of his younger brother Arthur, and become a regular member of the staff of Punch.   Three years later he was appointed to the Table.   The Punch dinners were his greatest pleasure, and he attended them with regularity, although the paralysis of the legs, the result of falling down the stairway of ": null
    },
    {
        "Gower Street station": "gower street station"
    },
    {
        ", rendered his locomotion, and especially the mounting of Mr. Punchs staircase, a matter of painful exertion.   To Punch he contributed both prose and verse; he wrote, in greater part, the admirable parody of a boys sensational shocker , and he developed Jerrolds idea of humorous bogus advertisements under the heading How we advertise now.   The idea of one of Sir ": null
    },
    {
        "John Tenniel": "john tenniel"
    },
    {
        "s best cartoons for Punch, entitled Dropping the Pilot, illustrative of Bismarcks resignation in 42 was due to him.     Apart from his work on Punch, he wrote songs and music for the German Reeds entertainment, while in 42 and 42 he was collaborator in two dramatic productions which evoked a considerable amount of public attention.        On 42 March 42  The Happy Land  was given at the ": null
    },
    {
        "Court Theatre": "royal court theatre"
    },
    {
        ", 42 a daring political satire and burlesque of W. S. Gilberts  The Wicked World .   In this amusing piece of banter three statesmen were represented as visiting Fairyland in order to impart to the inhabitants the secrets of popular government. The actors representing Mr. G., Mr. L., and Mr. A. were dressed so as to resemble the ministers satirised, and the representation elicited a question in the ": null
    },
    {
        "House of Commons": "house of commons of the united kingdom"
    },
    {
        " and an official visit of the Lord Chamberlain to the theatre, with the result that the actors had to change their make-up.     In the following year, he furnished the legend to ": null
    },
    {
        "Herman Merivale": "herman merivale"
    },
    {
        "s tragedy The White Pilgrim, first given at the Court in February 42   At the close of his life he furnished the lyrics and most of the book for the operetta  La Cigale , which at the time of his death was nearing its four hundredth performance at the Lyric Theatre.     In 42 he suffered a great shock from the death by drowning of his only son, and he died in London on 42 October 42 and was buried in Mortlake cemetery.       Punch devoted some appreciative stanzas to his memory, bearing the epigraph Wearing the white flower of a blameless life . His portrait appeared in the well-known drawing of The Mahogany Tree , and likenesses were also given in the Illustrated London News and in Spielmanns History of Punch .       He married Emily, eldest daughter of William Hunt, J.P., of Bath, and his only daughter Minna married in 42 ": null
    },
    {
        "Mr. Hugh Clifford": "hugh clifford"
    },
    {
        ", C.M.G., governor of Labuan and British North Borneo.": null
    }
]