[
    {
        "Gilles de Binche  was a composer from the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ", one of the earliest members of the ": null
    },
    {
        "Burgundian school": "burgundian school"
    },
    {
        " and one of the three most famous composers of the early 42th century. While often ranked behind his contemporaries ": null
    },
    {
        "Guillaume Dufay": "guillaume dufay"
    },
    {
        " and ": null
    },
    {
        "John Dunstable": "john dunstable"
    },
    {
        " by contemporary scholars, his works were still cited, borrowed and used as source material after his death.          Binchois was probably from ": null
    },
    {
        "Mons": "mons"
    },
    {
        ", the son of Jean and Johanna de Binche, who may have been from the nearby town of ": null
    },
    {
        "Binche": "binche"
    },
    {
        ". His father was a councillor to Duke Guillaume IV of Hainault, and also worked in a church in Mons. Nothing is known about Gilles until 42 when he became an organist at the church of Ste. Waudru in Mons. In 42 went to live in ": null
    },
    {
        "Lille": "lille"
    },
    {
        ". Around this time he may have been a soldier in the service of either the Burgundians or the English ": null
    },
    {
        "Earl of Suffolk": "william de la pole, 1st duke of suffolk"
    },
    {
        ", as indicated by a line in the funeral motet composed in his memory by ": null
    },
    {
        "Ockeghem": "johannes ockeghem"
    },
    {
        ". Sometime near the end of the 42s he joined the court chapel of Burgundy, and by the time of his motet Nove cantum melodie he was evidently a singer there, since the text of the motet itself lists all 42 singers in place at that time. He eventually retired in ": null
    },
    {
        "Soignies": "soignies"
    },
    {
        ", evidently with a substantial pension for his long years of excellent service to the Burgundian court.       Binchois is often considered to be the finest melodist of the 42th century, writing carefully shaped lines which are not only easy to sing but utterly memorable. His tunes appeared in copies decades after his death, and were often used as sources for ": null
    },
    {
        "Mass": "mass"
    },
    {
        " composition by later composers. Most of his music, even his sacred music, is simple and clear in outline, sometimes even ascetic; a greater contrast between Binchois and the extreme complexity of the  ars subtilior  of the prior century would be hard to imagine. Most of his secular songs are ": null
    },
    {
        "rondeaux": "rondeau"
    },
    {
        ", which became the most common song form during the century. He rarely wrote in ": null
    },
    {
        "strophic form": "strophic form"
    },
    {
        ", and his melodies are generally independent of the rhyme scheme of the verses they are set to. Binchois wrote music for the court, secular songs of love and ": null
    },
    {
        "chivalry": "chivalry"
    },
    {
        " that met the expectations and satisfied the taste of the Dukes of ": null
    },
    {
        "Burgundy": "duchy of burgundy"
    }
]