[
    {
        "   Gilles Apap is a ": null
    },
    {
        "French": "france"
    },
    {
        " classical": "classical music"
    },
    {
        " violin": "violin"
    },
    {
        "ist. Born in ": null
    },
    {
        "Béjaïa": "béjaïa"
    },
    {
        ", ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        ", he was raised in ": null
    },
    {
        "Nice": "nice"
    },
    {
        ", France. In 42 he won first prize in the contemporary music category at the ": null
    },
    {
        "Yehudi Menuhin": "yehudi menuhin"
    },
    {
        " Competition. He served as ": null
    },
    {
        "concertmaster": "concertmaster"
    },
    {
        " with the ": null
    },
    {
        "Santa Barbara Symphony Orchestra": "santa barbara symphony orchestra"
    },
    {
        " for 42 years, but has since focused on his career as a ": null
    },
    {
        "soloist": "solo"
    },
    {
        " with orchestras around the world.     A virtuosic violinist, Gilles is also known for his interpretations of traditional music from Eastern Europe to America, such as gypsy, Irish, swing or bluegrass.     He recorded three CDs in the 42s with ": null
    },
    {
        "Sony Classical Records": "sony classical records"
    },
    {
        ", then formed his own company, Apapaziz Productions. Since 42 Apapaziz has recorded eight Gilles Apap CDs.       42 Gilles Apap and the Transylvanian Mountain Boys: Who?   42 Gilles Apap and the Transylvanian Mountain Boys: Gilles Apap & the Transylvanian Mountain Boys   42 Gilles Apap and the Transylvanian Mountain Boys: d’Ici & d’Ailleurs   42 Enescu, Debussy and Ravel – Sonatas for violin and piano   42 No Piano on That One   42 Vivaldi’s Four Seasons   42 Gilles Apap and The Sinfonia Varsovia   42 Gilles Apap: Music for Solo Violin   42 Friends   42 Sans Orchestre   42 Gypsy Tunes… California Style That Is       42 The unknown fiddler of Santa Barbara    42 Gilles Apap and Friends   42  Thirty Two Short Films About Glenn Gould  Gilles Apap plays Mozart’s Third Concerto   42 Apap Masala, Gilles Apap in India                                          ": null
    }
]