[
    {
        "        Gin is a distilled ": null
    },
    {
        "alcoholic drink": "alcoholic drink"
    },
    {
        " that derives its predominant flavour from ": null
    },
    {
        "juniper berries": "juniper berry"
    },
    {
        " . Gin is one of the broadest categories of spirits, all of various origins, styles, and flavour profiles, that revolve around juniper as a common ingredient.     From its earliest origins in the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", the drink has evolved from a ": null
    },
    {
        "herbal medicine": "herbalism"
    },
    {
        " to an object of commerce in the ": null
    },
    {
        "spirits industry": "alcohol industry"
    },
    {
        ". Gin emerged in England after the introduction of the ": null
    },
    {
        "jenever": "jenever"
    },
    {
        ", a Dutch and Belgian liquor which originally had been a medicine. Although this development had been taking place since early 17th century, gin became widespread after the ": null
    },
    {
        "William of Orange": "william iii of england"
    },
    {
        "-led 1688 ": null
    },
    {
        "Glorious Revolution": "glorious revolution"
    },
    {
        " and subsequent import restrictions on French brandy.     Gin today is produced in subtly different ways, from a wide range of herbal ingredients, giving rise to a number of distinct styles and brands. After juniper, gin tends to be flavoured with botanical/herbal, spice, floral or fruit-flavours or often a combination. It is most commonly consumed mixed with ": null
    },
    {
        "tonic water": "tonic water"
    },
    {
        ". Gin is also often used as a base spirit to produce flavoured gin-based ": null
    },
    {
        "liqueurs": "liqueur"
    },
    {
        "such as, for example, ": null
    },
    {
        "Sloe gin": "sloe gin"
    },
    {
        ", traditionally by the addition of fruit, flavourings and sugar.       The earliest known written reference to ": null
    },
    {
        "jenever": "jenever"
    },
    {
        " appears in the 13th-century encyclopaedic work Der Naturen Bloeme , with the earliest printed recipe for jenever dating from 16th-century work Een Constelijck Distileerboec .     The physician ": null
    },
    {
        "Franciscus Sylvius": "franciscus sylvius"
    },
    {
        " has been falsely credited with the invention of gin in the mid-17th century,  although the existence of jenever is confirmed in ": null
    },
    {
        "Philip Massingers": "philip massinger"
    },
    {
        "play  The Duke of Milan  , when Sylvius would have been about nine years old. It is further claimed that English soldiers who provided support in ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " against the Spanish in 1585, during the ": null
    },
    {
        "Eighty Years War": "eighty years war"
    },
    {
        ", were already drinking jenever for its calming effects before battle, from which the term  Dutch courage  is believed to have originated.  According to some unconfirmed accounts, gin originated in Italy.      By the mid-17th century, numerous small Dutch and Flemish distillers had popularized the re-distillation of malt spirit or malt wine with juniper, ": null
    },
    {
        "anise": "anise"
    },
    {
        ", ": null
    },
    {
        "caraway": "caraway"
    },
    {
        ", ": null
    },
    {
        "coriander": "coriander"
    },
    {
        ", etc.,  which were sold in ": null
    },
    {
        "pharmacies": "pharmacy"
    },
    {
        " and used to treat such medical problems as ": null
    },
    {
        "kidney": "kidney"
    },
    {
        " ailments, ": null
    },
    {
        "lumbago": "lumbago"
    },
    {
        ", ": null
    },
    {
        "stomach": "stomach"
    },
    {
        " ailments, ": null
    },
    {
        "gallstone": "gallstone"
    },
    {
        "s, and ": null
    },
    {
        "gout": "gout"
    },
    {
        ". Gin emerged in England in varying forms by the early 17th century, and at the time of ": null
    },
    {
        "the Restoration": "the restoration"
    },
    {
        ", enjoyed a brief resurgence. Gin became vastly more popular as an alternative to brandy, when ": null
    },
    {
        "William III, II & I": "william iii of england"
    },
    {
        " and ": null
    },
    {
        "Mary II": "mary ii of england"
    },
    {
        " became co-sovereigns of England, Scotland and Ireland after leading the ": null
    },
    {
        "Glorious Revolution": "glorious revolution"
    },
    {
        ".  Particularly in crude, inferior forms, it was more likely to be flavoured with ": null
    },
    {
        "turpentine": "turpentine"
    },
    {
        ".         Gin drinking in England rose significantly after the government allowed unlicensed gin production, and at the same time imposed a heavy ": null
    },
    {
        "duty": "duty"
    },
    {
        " on all imported spirits such as French ": null
    },
    {
        "brandy": "brandy"
    },
    {
        ". This created a larger market for poor-quality ": null
    },
    {
        "barley": "barley"
    },
    {
        " that was unfit for brewing ": null
    },
    {
        "beer": "beer"
    },
    {
        ", and in 1695–1735 thousands of gin-shops sprang up throughout England, a period known as the ": null
    },
    {
        "Gin Craze": "gin craze"
    },
    {
        ".  Because of the low price of gin, when compared with other drinks available at the same time, and in the same geographic location, gin began to be consumed regularly by the poor.  Of the 15,000 drinking establishments in London, not including coffee shops and drinking chocolate shops, over half were gin shops. Beer maintained a healthy reputation as it was often safer to drink the brewed ale than unclean plain water.  Gin, though, was blamed for various social problems, and it may have been a factor in the higher death rates which stabilized Londons previously growing population. The reputation of the two drinks was illustrated by ": null
    },
    {
        "William Hogarth": "william hogarth"
    },
    {
        " in his engravings  Beer Street and Gin Lane  , described by the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " as arguably the most potent anti-drug poster ever conceived.  The negative reputation of gin survives today in the English language, in terms like gin mills or the American phrase gin joints to describe disreputable bars, or gin-soaked to refer to drunks. The epithet mothers ruin is a common British name for gin, the origin of which is the subject of ongoing debate.      The ": null
    },
    {
        "Gin Act 1736": "gin craze"
    },
    {
        " imposed high taxes on retailers and led to riots in the streets. The prohibitive duty was gradually reduced and finally abolished in 1742. The ": null
    },
    {
        "Gin Act 1751": "gin act 1751"
    },
    {
        " was more successful, however; it forced distillers to sell only to licensed retailers and brought gin shops under the jurisdiction of local magistrates. Gin in the 18th century was produced in ": null
    },
    {
        "pot still": "pot still"
    },
    {
        "s, and was somewhat sweeter than the London gin known today.     In London in the early 18th century, much gin was distilled legally in residential houses and was often flavoured with turpentine to generate resinous woody notes in addition to the juniper.  As late as 1913,  Websters Dictionary  states without further comment, common gin is usually flavoured with turpentine .     Another common variation was to distill in the presence of ": null
    },
    {
        "sulphuric acid": "sulphuric acid"
    },
    {
        ". Although the acid itself does not distil, it imparts the additional aroma of ": null
    },
    {
        "diethyl ether": "diethyl ether"
    },
    {
        " to the resulting gin. Sulphuric acid subtracts one water molecule from two ethanol molecules to create ": null
    },
    {
        "diethyl ether": "diethyl ether"
    },
    {
        ", which also forms an ": null
    },
    {
        "azeotrope": "azeotrope"
    },
    {
        " with ethanol, and therefore distils with it. The result is a sweeter spirit, and one that may have possessed additional analgesic or even intoxicating effects  – see ": null
    },
    {
        "Paracelsus": "paracelsus"
    },
    {
        ".     Dutch or Belgian gin, also known as jenever or genever, evolved from malt wine spirits, and is a distinctly different drink from later styles of gin. ": null
    },
    {
        "Schiedam": "schiedam"
    },
    {
        ", a city in the province of ": null
    },
    {
        "South Holland": "south holland"
    },
    {
        ", is famous for its jenever-producing history. The same for ": null
    },
    {
        "Hasselt": "hasselt"
    },
    {
        " in the Belgian province of Limburg. The oude style of jenever remained very popular throughout the 19th century, where it was referred to as Holland or Geneva gin in popular, American, pre-Prohibition bartender guides. Johnson, Harry; Harry Johnsons New and Improved Bartenders Manual; 1900. ;     The 18th century gave rise to a style of gin referred to as  Old Tom gin , which is a softer, sweeter style of gin, often containing sugar. Old Tom gin faded in popularity by the early 20th century.        The invention and development of the ": null
    },
    {
        "column still": "column still"
    },
    {
        "  made the distillation of neutral spirits practical, thus enabling the creation of the London dry style that evolved later in the 19th century.     In tropical British colonies gin was used to mask the bitter flavour of ": null
    },
    {
        "quinine": "quinine"
    },
    {
        ", which was the only effective anti-malarial compound. Quinine was dissolved in carbonated water to form ": null
    },
    {
        "tonic water": "tonic water"
    },
    {
        "; the resulting cocktail is ": null
    },
    {
        "gin and tonic": "gin and tonic"
    },
    {
        ", although modern tonic water contains only a trace of quinine as a flavouring. Gin is a common base spirit for many ": null
    },
    {
        "mixed drinks": "mixed drinks"
    },
    {
        ", including the ": null
    },
    {
        "martini": "martini cocktail"
    },
    {
        ". Secretly produced ": null
    },
    {
        "bathtub gin": "bathtub gin"
    },
    {
        " was available in the ": null
    },
    {
        "speakeasies": "speakeasy"
    },
    {
        " and blind pigs of ": null
    },
    {
        "Prohibition": "prohibition"
    },
    {
        "-era America as a result of the relative simple production.     ": null
    },
    {
        "Sloe gin": "sloe gin"
    },
    {
        " is traditionally described as a liqueur made by infusing ": null
    },
    {
        "sloes": "blackthorn"
    },
    {
        " in gin, although modern versions are almost always compounded from neutral spirits and flavourings. Similar infusions are possible with other fruits, such as ": null
    },
    {
        "damson": "damson"
    },
    {
        "s.  Another popular gin-based liqueur with a longstanding history is ": null
    },
    {
        "Pimms No.1 Cup": "pimms"
    },
    {
        "   ": null
    }
]