[
    {
        "Glaaki  is a ": null
    },
    {
        "fictional character": "fictional character"
    },
    {
        " in the ": null
    },
    {
        "Cthulhu Mythos": "cthulhu mythos"
    },
    {
        ". Glaaki first appeared in The Inhabitant of the Lake , an early story by ": null
    },
    {
        "Ramsey Campbell": "ramsey campbell"
    },
    {
        ". Recently this being featured in Campbells The Last Revelation of Glaaki .       In ": null
    },
    {
        "Cthulhu Mythos": "cthulhu mythos"
    },
    {
        " fiction, Glaaki is a ": null
    },
    {
        "Great Old One": "great old one"
    },
    {
        " and dwells within a lake in the ": null
    },
    {
        "Severn Valley near Brichester": "severn valley brichester"
    },
    {
        ", in England . Glaaki has the appearance of an enormous slug covered with metallic spines which, despite their appearance, are actually organic growths. Glaaki can also extrude tentacles with eyes at the tips, allowing him to peer from underneath the water. It is believed that he came to the Earth imprisoned inside a meteor. When the meteor landed, Glaaki was freed, and the impact created the lake where he now resides.     Glaaki is an ancient and wise creature with vast knowledge of the other beings which are active in Britains Severn River Valley, such as ": null
    },
    {
        "Ygolonac": "ygolonac"
    },
    {
        ", the ": null
    },
    {
        "Denizens of Sglhuo": "elements of the cthulhu mythostable-c"
    },
    {
        ", ": null
    },
    {
        "Shub-Niggurath": "shub-niggurath"
    },
    {
        ", ": null
    },
    {
        "Eihort": "ramsey_campbell_deitieseihort"
    },
    {
        ", Mnagalah and ": null
    },
    {
        "Byatis": "byatis"
    },
    {
        ". The cults holy book, known as  The Revelations of Glaaki , was written by his cult, which gleaned sorcerous knowledge from their master. While the original text was reportedly written in eleven loose-leaf notebooks by various unidentified contributors, the 42 edition, published by the Matterhorn Press of Highgate, is contained in nine volumes, described as edited, organized, and corrected. A small edition, printed exclusively for subscribers, is now extremely rare.       By driving one of his spines into a victim, and injecting a special fluid, Glaaki can turn the unfortunate into an ": null
    },
    {
        "undead": "undead"
    },
    {
        " slave. However, if the spine is broken off before the fluid is injected, the victim dies anyway, but is at least spared the fate of becoming one of Glaakis slaves. The injected fluid produces growths throughout the victims body that allow Glaaki to manipulate the subjects corpse.     Many people come to serve Glaaki willingly, in exchange for the promise of eternal life. What they dont realize is that he makes good on his promise by driving his spines into them, turning the worshiper into one of his undead slaves.       As time passes, the undead creatures become increasingly sensitive to sunlight, and even begin to suffer damage from it. The servants of Glaaki refer to this condition as the Green Decay": null
    }
]