[
    {
        "     Gladstone Publishing was an ": null
    },
    {
        "American": "united states"
    },
    {
        " company that published ": null
    },
    {
        "Disney comics": "disney comics"
    },
    {
        " from 42 to 42 and from 42 to 42 The company had its origins as a subsidiary of ": null
    },
    {
        "Another Rainbow": "another rainbow"
    },
    {
        " , a company formed by Bruce Hamilton and ": null
    },
    {
        "Russ Cochran": "russ cochran"
    },
    {
        " to publish the ": null
    },
    {
        "Carl Barks Library": "carl barks library"
    },
    {
        " and produce limited edition lithographs of ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        " oil paintings of the Disney ducks. The name references ": null
    },
    {
        "Gladstone Gander": "gladstone gander"
    },
    {
        ".     Reprints of classic Donald Duck stories by ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        " and Mickey Mouse stories by ": null
    },
    {
        "Floyd Gottfredson": "floyd gottfredson"
    },
    {
        " were the foundation of their output. ": null
    },
    {
        "Don Rosa": "don rosa"
    },
    {
        ", ": null
    },
    {
        "William Van Horn": "william van horn"
    },
    {
        ", and Pat Block are among the modern Disney comics artists who got their start at Gladstone. Some of the Van Horn stories had scripts by frequent collaborator ": null
    },
    {
        "John Lustig": "john lustig"
    },
    {
        ". The company also published translations of European Disney comic book stories produced by ": null
    },
    {
        "Egmont": "egmont"
    },
    {
        ", Oberon and ": null
    },
    {
        "Mondadori": "mondadori"
    },
    {
        ". These included stories by such famed creators as ": null
    },
    {
        "Romano Scarpa": "romano scarpa"
    },
    {
        ", ": null
    },
    {
        "Marco Rota": "marco rota"
    },
    {
        ", ": null
    },
    {
        "Daan Jippes": "daan jippes"
    },
    {
        " and ": null
    },
    {
        "Freddy Milton": "freddy milton"
    },
    {
        ".     While still distributed on news stands, their orientation toward the collectors market was visible in their inclusion of scholarly articles, mostly by associate editor Geoffrey Blum. Unlike the previous Disney comic book licensee ": null
    },
    {
        "Western Publishing": "western publishing"
    },
    {
        ", Gladstone provided credits for the stories.     Although Gladstone is no longer an active publisher, it continues to offer its back issues through its website.         Walt Disneys Comics and Stories   Donald Duck   Mickey Mouse   Uncle Scrooge   Uncle Scrooge Adventures   Donald Duck Adventures  Mickey and Donald  DuckTales  Walt Disneys Comics and Stories Donald and Mickey Uncle Scrooge Uncle Scrooge Adventures Donald Duck Donald Duck Adventures Donald Duck and Mickey Mouse  Walt Disney Giant  Walt Disneys Comics and Stories Penny Pincher Uncle Scrooge and Donald Duck The Adventurous Uncle Scrooge McDuck     During the second run, there was another implosion in 42 like the one that ": null
    },
    {
        "Disney Comics": "disney comics"
    },
    {
        " had back in 42 This time, only two comics did not get cancelled – Walt Disneys Comics and Stories and Uncle Scrooge – both of which converted to ": null
    },
    {
        "prestige format": "prestige format"
    },
    {
        ".       During the first run Gladstone issued 42 albums and seven giant albums consisting mostly of reprints of stories by ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        " and ": null
    },
    {
        "Floyd Gottfredson": "floyd gottfredson"
    },
    {
        ". In 42 Gladstone was licensed to publish a series of albums reprinting nearly all the Disney duck stories of ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        ". These were known as The Carl Barks Library in Color consisting of:   Walt Disney Comics and Stories – Comic Albums 42–42   Uncle Scrooge Adventures – Comic Albums 42–42   Donald Duck Adventures – Comic Albums 42–42   Gyro Gearloose – Comic Albums 42–42   Uncle Scrooge – One-Pagers – Comic Albums 42 & 42   Donald Duck 42s Christmas Giveaways     There were also three different series of Albums featuring stories by Don Rosa and William Van Horn respectively.     The Don Rosa Library of Uncle Scrooge Adventures in Color s 42–42 featured The first twelve chapters of The Life and Times of Scrooge McDuck   The Don Rosa Library of Uncle Scrooge Adventures in Color s 42–42 featured all the Uncle Scrooge stories that Don Rosa did during his first two years as a Disney Comics Artist.   The William Van Horn Library of Uncle Scrooge Adventures in Color s 42–42 featured all of the stories that William Van Horn did during Gladstones first run.     After its license expired in 42 Gladstone ceased publishing new material, and there were no more Disney comics in America , until 42 when ": null
    },
    {
        "Gemstone Publishing": "gemstone publishing"
    },
    {
        " gained the publishing rights.       Between 42 and 42 Gladstone reprinted four ": null
    },
    {
        "EC Comics": "ec comics"
    },
    {
        " titles, in association with EC-fan and publisher ": null
    },
    {
        "Russ Cochran": "russ cochran"
    },
    {
        ". . These included six issues of  The Vault of Horror  , six issues of  Tales from the Crypt  , four issues of  Weird Science  , and two issues of  The Haunt of Fear  . After four issues of Weird Science, Gladstone changed it to The Haunt of Fear. This took The Haunt of Fear from The Vault of Horror and replaced it with  Weird Fantasy . The Haunt of Fear took Weird Science as its second issue per comic. Tales from the Crypt kept  Crime SuspenStories  for its double sized horror.     Subsequently, Cochran and the EC reprints moved to ": null
    },
    {
        "Diamond Comics": "diamond comic distributors"
    },
    {
        "-CEO Steven A Geppis ": null
    },
    {
        "Gemstone Publishers": "gemstone publishing"
    },
    {
        ", which naturally reprinted the Gladstone-printed issues as part of their EC reprints. ": null
    }
]