[
    {
        "Global air-traffic management  is a concept for satellite-based ": null
    },
    {
        "Communication, navigation and surveillance": "communication, navigation and surveillance"
    },
    {
        " and ": null
    },
    {
        "air traffic management": "air traffic control"
    },
    {
        ". The ": null
    },
    {
        "Federal Aviation Administration": "federal aviation administration"
    },
    {
        " and the ": null
    },
    {
        "International Civil Aviation Organization": "international civil aviation organization"
    },
    {
        ", a specialized agency of the United Nations, established GATM standards to keep air travel safe and effective in increasingly crowded worldwide air space. Efforts are being made worldwide to test and implement new technologies that will allow GATM to efficiently support air traffic control.     Airservices Australia ": null
    },
    {
        "ADS-B": "ads-b"
    },
    {
        " initiative is one of the major implementation programs in this field. This initiative will facilitate the certification of this new technology allowing further implementation.     The two core satellite constellations are the ": null
    },
    {
        "Global Positioning System": "global positioning system"
    },
    {
        " of the US and the ": null
    },
    {
        "Global Navigation Satellite System": "global navigation satellite system"
    },
    {
        " of Russia/India. The third constellation will be the European Union ": null
    },
    {
        "Galileo system": "galileo"
    },
    {
        " when it becomes fully operational. These systems provide independent capabilities and can be used in combination with future core constellations and augmentation systems. Signals from core satellite are received by ground reference stations and any errors in the signals are identified. Each station in the network relays the data to area-wide master stations where correction information for specific geographical areas is computed. The correction message is prepared and uplinked to a ": null
    },
    {
        "geostationary communication satellite": "geostationary communication satellite"
    },
    {
        " via a ground uplink station. This message is broadcast to receivers on board aircraft flying within the broadcast coverage area of the system. The system is known in the US as WAAS , in Europe as EGNOS , in Japan as MSAS  and in India as GAGAN .     The system employs various techniques to correct equatorial anomalies. The advantage of the system is, it is global in scope and it has the potential to support all phases of flight providing a seamless global navigation guidance. This could eliminate the need for a variety of ground and airborne systems that were designed to meet specific requirements for certain phases of flight.   Standard and recommended practices for the air traffic management based on a global navigation satellite system are developed by ": null
    },
    {
        "ICAO": "icao"
    },
    {
        " . Thus the system has to meet ICAO standards to become operational.        ": null
    }
]