[
    {
        "       is a 1989 Japanese ": null
    },
    {
        "kaiju film": "kaiju"
    },
    {
        " written and directed by ": null
    },
    {
        "Kazuki Ōmori": "kazuki ōmori"
    },
    {
        ", with special effects by ": null
    },
    {
        "Koichi Kawakita": "koichi kawakita"
    },
    {
        ". Produced and distributed by ": null
    },
    {
        "Toho Studios": "toho"
    },
    {
        ", it is the 17th film in the ": null
    },
    {
        "Godzilla franchise": "godzilla"
    },
    {
        " and the second film in the franchises ": null
    },
    {
        "Heisei period": "godzilla heisei period"
    },
    {
        ". The film stars Kunihiko Mitamura, ": null
    },
    {
        "Yoshiko Tanaka": "yoshiko tanaka"
    },
    {
        ", ": null
    },
    {
        "Masanobu Takashima": "masanobu takashima"
    },
    {
        ", ": null
    },
    {
        "Megumi Odaka": "megumi odaka"
    },
    {
        ", ": null
    },
    {
        "Toru Minegishi": "tōru minegishi"
    },
    {
        ", ": null
    },
    {
        "Yasuko Sawaguchi": "yasuko sawaguchi"
    },
    {
        ", ": null
    },
    {
        "Toshiyuki Nagashima": "toshiyuki nagashima"
    },
    {
        ", ": null
    },
    {
        "Yoshiko Kuga": "yoshiko kuga"
    },
    {
        ", Ryunosuke Kaneda and ": null
    },
    {
        "Kōji Takahashi": "kōji takahashi"
    },
    {
        ".     In the film, Godzilla battles a monster born from the cells of a plant and a woman, as corporations struggle for control over Godzilla cells. The idea originated from a public story-writing contest, and set a trend common to all Heisei era movies, in which Godzilla faces off against opponents capable of metamorphosing into new, progressively more powerful forms.     Godzilla vs. Biollante was released theatrically in Japan on December 16, 1989. It received a ": null
    },
    {
        "direct-to-video": "direct-to-video"
    },
    {
        " release in the United States in November 25, 1992 through ": null
    },
    {
        "HBO Video": "hbo video"
    },
    {
        ". Although it received generally positive reviews, the film was a disappointment at the Japanese box office.   In Japan, it was followed by  Godzilla vs. King Ghidorah  in 1991.         In the aftermath of ": null
    },
    {
        "Godzillas attack on Tokyo and later imprisonment at Mount Mihara": "the return of godzilla"
    },
    {
        ", the monsters cells are secretly delivered to the ": null
    },
    {
        "Saradia": "list of fictional locations in the godzilla filmssaradia"
    },
    {
        " Institute of Technology and Science, where they are to be merged with ": null
    },
    {
        "genetically modified plants": "genetically modified plants"
    },
    {
        " in the hope of transforming Saradias deserts into fertile land and ending the countrys economic dependence on oil wells. Dr. Genshiro Shiragami and his daughter, Erika, are enlisted to aid with the project. However, a terrorist bombing destroys the institutes laboratory, ruining the cells and killing Erika.     Five years later, Shiragami has returned to Japan and merged some of Erikas cells with those of a ": null
    },
    {
        "rose": "rose"
    },
    {
        " in an attempt to preserve her soul. Scientist Kazuhito Kirishima and Lieutenant Goro Gondo of the ": null
    },
    {
        "Japan Self-Defense Forces": "japan self-defense forces"
    },
    {
        " are using the Godzilla cells they collected to create Anti-Nuclear Energy Bacteria , hoping it can serve as a weapon against Godzilla should he return. They attempt to recruit Shiragami to aid them, but are rebuffed. Meanwhile, international tensions increase over the Godzilla cells, as they are coveted by both the Saradia Institute of Technology and Science and the American Bio-Major organization. An explosion from ": null
    },
    {
        "Mount Mihara": "mount mihara"
    },
    {
        " causes tremors across the area, including Shiragamis home, badly damaging the roses. Shiragami agrees to join the JSDFs effort and is given access to the Godzilla cells, which he secretly merges with one of the roses. A night later, rival Bio-Major and Saradian agents break into Shiragamis lab, but are attacked by a large plant-like creature which later escapes to ": null
    },
    {
        "Lake Ashino": "lake ashino"
    },
    {
        " and is named ": null
    },
    {
        "Biollante": "biollante"
    },
    {
        " by Shiragami.     Bio-Major agents plant explosives around Mount Mihara and blackmails the ": null
    },
    {
        "Diet of Japan": "diet of japan"
    },
    {
        ", warning the explosives will be detonated and thus free Godzilla if the cells are not handed over. Kirishima and Gondo attempt to trade, but Saradian agent SSS9 thwarts the attempt and escapes with the cells. The explosives are detonated, and Godzilla is released. He attempts to reach the nearest power plant to replenish his supply of nuclear energy, but Biollante calls out to him. Godzilla arrives at the lake to engage Biollante in a vicious battle, and emerges as the victor. Godzilla proceeds toward the power plant at ": null
    },
    {
        "Tsuruga": "tsuruga"
    },
    {
        ", but psychic ": null
    },
    {
        "Miki Saegusa": "miki saegusa"
    },
    {
        " uses her powers to divert him toward ": null
    },
    {
        "Osaka": "osaka"
    },
    {
        " instead. The city is quickly evacuated before Godzilla makes landfall. A team led by Gondo meet Godzilla at the central district and fire rockets infused with the anti-nuclear bacteria into his body. Gondo is killed in the process, and an unharmed Godzilla leaves.     Kirishima recovers the cells and returns them to the JSDF. Shiragami theorizes that if Godzillas body temperature is increased, the bacteria should work against it. The JSDF erects microwave-emitting plates during an artificial thunderstorm, hitting Godzilla with lightning and heating up his body temperature during a battle in the mountains outside Osaka. Godzilla is only moderately affected, but Biollante arrives to engage him in battle once again. The fight ends after Godzilla fires an atomic heat ray inside Biollantes mouth. An exhausted Godzilla collapses on the beach, and Biollante disintegrates into the sky, forming an image of Erika among the stars. Shiragami, watching the scene, is killed by SSS9. Kirishima chases the assassin and, after a brief scuffle, SSS9 is killed by a microwave-emitting plate activated by Sho Kuroki. Godzilla reawakens and leaves for the ocean.                   ": null
    },
    {
        "Tomoyuki Tanaka": "tomoyuki tanaka"
    },
    {
        " announced a sequel to  The Return of Godzilla  in 1985, but was skeptical of its possibilities, as the film had been of little financial benefit to ": null
    },
    {
        "Toho": "toho"
    },
    {
        ", and the failure of  King Kong Lives  following year convinced him that audiences were not ready for a continuation of the Godzilla series. He relented after the success of  Little Shop of Horrors , and proceeded to hold a public story contest for a possible script. Kalat, D. , A Critical History and Filmography of Tohos Godzilla Series, McFarland, p. 169-78,  In consideration of The Return of Godzillas marginal success in Japan, Tanaka insisted that the story focus on a classic monster vs. monster theme. Tanaka handed the five finalist entries to director Kazuki Ōmori , despite the twos initially hostile relationship; the latter had previously held Tanaka responsible for the decline in the Godzilla series quality during the 1970s. Ōmori chose the entry of dentist Shinichiro Kobayashi, who wrote his story with the hypothetical death of his daughter in mind.     Kobayashis submission was notable for its emphasis on dilemmas concerning biotechnology rather than nuclear energy, and revolved around a scientist grieving for his deceased daughter and attempting to keep her soul alive by merging her genes with those of a plant. The scientists initial experiments would have resulted in the creation of a giant rat-like amphibian called Deutalios, which would have landed in Tokyo Bay and been killed by Godzilla. A female reporter investigating the scientists activities would have suffered from psychic visions of plants with humanoid faces compelling her to infiltrate the scientists laboratory. The scientist would have later confessed his intentions, and the finale would have had Godzilla battling a human-faced Biollante who defeats him by searing his flesh with acid.     Ōmori proceeded to modify the story into a workable script over a period of three years, using his background as a biologist to create a plausible plot involving genetic engineering and botany. In order to preserve the series anti-nuclear message, he linked the creation of Biollante to the use of Godzilla cells, and replaced Kobayashis journalist character with Miki Saegusa . He openly admitted that directing a Godzilla film was secondary to his desire to make a James Bond movie, and thus added elements of the spy film genre into the plot. Unlike the case with later, more committee-driven Godzilla films, Ōmori was given considerable leeway in writing and directing the film, which Toho staff later judged to have been an error resulting in a movie with a very narrow audience.       thu   Koichi Kawakita , who had previously worked for Tsuburaya Productions , replaced Teruyoshi Nakano as head of the series special effects unit after Toho became impressed at his work in ": null
    },
    {
        "Gunhed": "gunhed"
    },
    {
        ". Kawakita made use of Gunheads special effects team Studio OX, and initially wanted to make Godzilla more animal-like, using crocodiles as references, but was berated by Tanaka, who declared Godzilla to be a monster rather than an animal. Kenpachiro Satsuma returned to portray Godzilla, hoping to improve his performance by making it less anthropomorphic than in previous films. Suitmaker Noboyuki Yasamaru created a Godzilla suit made specifically with Satsumas measurements in mind, unlike the previous one which was initially built for another performer and caused Satsuma discomfort. The resulting 242 lb suit proved more comfortable than the last, having a lower center of gravity and more mobile legs. A second 176 lb suit was built for outdoor underwater scenes. The heads size was reduced, and the whites around the eyes removed. On the advice of story finalist Shinichiro Kobayashi, a double row of teeth was incorporated in the jaws. As with the previous film, animatronic models were used for close-up shots. These models were an improvement over the last, as they were made from the same molds used for the main costume, and included an articulated tongue and intricate eye motion. The suits dorsal plates were filled with light bulbs for scenes in which Godzilla uses his atomic ray, thus lessening reliance on optical animation, though they electrocuted Satsuma the first time they were activated. Satsuma was also obliged to wear protective goggles when in the suit during scenes in which Godzilla battles the JSDF, as real explosives were used on set.     Designing and building the Biollante props proved problematic, as traditional suitmation techniques made realizing the requested design of the creatures first form difficult, and the resulting cumbersome model for Biollantes final form was met with disbelief from the special effects team. Biollantes first form was performed by Masao Takegami, who sat within the models trunk area on a platform just above water level. While the creatures head movements were simple to operate, its vines were controlled by an intricate array of overhead wires which proved difficult for Satsuma to react to during combat scenes as they offered no tension, thus warranting Satsuma to feign receiving blows from them, despite not being able to perceive them. Biollantes final form was even more difficult to operate, as its vine network took hours to rig up on set. Visibility in both the Godzilla and final form Biollante suits was poor, thus causing difficulties for Takegami in aiming the creatures head when firing sap, which permanently stained anything it landed on.     While it was initially decided to incorporate stop motion animation into the film, the resulting sequences were scrapped, as Kawakita felt they failed to blend in with the live-action footage effectively. The film however became the first of its kind to use CGI , though its usage was limited to scenes involving computer generated schematics. The original cut of the movie had the first battle culminating in Biollantes spores falling around the hills surrounding Lake Ashino and blooming into fields of flowers, though this was removed as the flowers were out of scale.       Unlike the previous film, Godzilla vs. Biollante incorporates themes from Akira Ifukube s original Gojira theme, though the majority of the soundtrack was composed of original themes by Koichi Sugiyama . The score was orchestrated by conductor David Howell through the Kansai Philarmonic, though Howell himself had never viewed the movie, and thus was left to interpret what the scenes would consist of when conducting the orchestra.       After the film was released in Japan, Toho commissioned a Hong Kong company named Omni Productions to dub the film into English.     In early 1990, Toho entered discussions with Miramax to distribute the film. When talks broke off, Toho filed a lawsuit in Los Angeles Federal Court, accusing Miramax of entering an oral agreement in June to pay Toho $500,000 to distribute the film. This lawsuit delayed the films release for two years. An out of court settlement was reached with Miramax buying the rights to the film for an unreported figure. Miramax would have entertained thoughts of releasing the film in theaters, but in the end it was decided to release the film straight to home video instead. HBO released the film on VHS in 1992 and Laserdisc in 1993. Miramax utilized the uncut English international version of the film for this release.         Godzilla vs. Biollante was released on VHS by HBO Home Video on November 25, 1992. It was later released on Blu-ray and DVD by Miramax Echo Bridge on December 4, 2012. It was released as a double feature and 8-disk movie pack on both Blu-ray and DVD with ": null
    },
    {
        "Mega Shark Versus Giant Octopus": "mega shark versus giant octopus"
    },
    {
        " by Echo Bridge Home Entertainment in 2013. It was last released by Lionsgate on Blu-ray and DVD on October 7, 2014.           In Japan, the film sold approximately 2 million tickets, earning $7,000,000 .       Godzilla vs. Biollante has received positive reviews, with praise for the story, music and visuals.   Ed Godziszewski of Monster Zero said the film is by no means a classic but felt that for the first time in well over 20 years, a script is presented with some fresh, original ideas and themes. ": null
    },
    {
        "Monster Zero": "monster zero"
    },
    {
        ". June 10, 2002 Joseph Savitski of Beyond Hollywood said the films music is a major detraction , but added that its not only one of the most imaginative films in the series, but also the most enjoyable to watch. Beyond Hollywood. August 2, 2004 Japan Hero said, is is definitely a Godzilla movie not to be missed. . Japan Hero     In their scholarly book Japans Green Monsters on ": null
    },
    {
        "kaiju": "kaiju"
    },
    {
        " cinema, Rhoads and McCorkle offer an ecocritical assessment of Godzilla vs. Biollante. The scholars focus on the films critique of genetic engineering and biotechnology years before the subject appeared in more popular Hollywood blockbusters like ": null
    },
    {
        "Steven Spielbergs": "steven spielberg"
    },
    {
        "1993 blockbuster  Jurassic Park . Rhoads and McCorkle counter prior reviews of the film and argue that Godzilla vs. Biollante possesses far deeper environmental messages than the obvious ones present on the films surface.      In July 2014, in a poll reported by the , Godzilla vs. Biollante was selected as the best Godzilla film by a group of fans and judges.      Composer ": null
    },
    {
        "Akira Ifukube": "akira ifukube"
    },
    {
        ", who had refused to compose the films score, stated on interview that he disliked the way ": null
    },
    {
        "Koichi Sugiyama": "koichi sugiyama"
    },
    {
        " had modernized his Godzilla theme, and defined the Saradia theme as ridiculous , on account of it sounding more European than Middle Eastern. David Milner, . Kaiju Conversations": null
    }
]