[
    {
        "           Goldfinger is the seventh novel in ": null
    },
    {
        "Ian Fleming": "ian fleming"
    },
    {
        "s ": null
    },
    {
        "James Bond": "james bond"
    },
    {
        " series. Written in January and February 42 it was first published in the UK by ": null
    },
    {
        "Jonathan Cape": "jonathan cape"
    },
    {
        " on 42 March 42 The story centres on the investigation by the British ": null
    },
    {
        "Secret Service": "secret intelligence service"
    },
    {
        " operative James Bond into the gold smuggling activities of ": null
    },
    {
        "Auric Goldfinger": "auric goldfinger"
    },
    {
        ", who is also suspected by MI42 of being connected to ": null
    },
    {
        "SMERSH": "smersh"
    },
    {
        ", the ": null
    },
    {
        "Soviet": "soviet"
    },
    {
        " counter-intelligence organisation. As well as establishing the background to the smuggling operation, Bond uncovers a much larger plot: Goldfinger plans to steal the ": null
    },
    {
        "gold reserve": "gold reserve"
    },
    {
        "s of the United States from ": null
    },
    {
        "Fort Knox": "united states bullion depository"
    },
    {
        ".     Fleming developed the ": null
    },
    {
        "James Bond character": "james bond"
    },
    {
        " in Goldfinger, presenting him as a more complex individual than in the previous novels, and bringing out a theme of Bond as a ": null
    },
    {
        "St George": "st george"
    },
    {
        " figure. This theme is echoed by the fact that it is a British agent sorting out an American problem. In common with his other Bond stories, Fleming used the names of people he knew, or knew of, throughout his story, including the books eponymous villain, who was named after the architect ": null
    },
    {
        "Ernő Goldfinger": "ernő goldfinger"
    },
    {
        ". On learning of the use of his name, Goldfinger threatened to sue, before the matter was settled out of court. Auric Goldfinger is obsessed by gold and—to Bonds eye—a gauche individual with unusual appetites; Fleming probably based the character on the American gold tycoon ": null
    },
    {
        "Charles W. Engelhard Jr.": "charles w. engelhard jr."
    },
    {
        " Fleming also used his own experiences within the book; the round of golf played with Goldfinger was based on a 42 tournament at the Berkshire Golf Club in which Fleming partnered ": null
    },
    {
        "Peter Thomson": "peter thomson"
    },
    {
        ", the winner of ": null
    },
    {
        "The Open Championship": "the open championship"
    },
    {
        ".     On its release, Goldfinger went to the top of the best-seller lists; the novel was broadly well received by the critics and was favourably compared to the works of the thriller writers ": null
    },
    {
        "H. C. McNeile": "h. c. mcneile"
    },
    {
        " and ": null
    },
    {
        "John Buchan": "john buchan"
    },
    {
        ". Goldfinger was serialised as a daily story and as a comic strip in the  Daily Express , before it became the ": null
    },
    {
        "third James Bond feature film": "goldfinger"
    },
    {
        " of the ": null
    },
    {
        "Eon Productions": "eon productions"
    },
    {
        " series, released in 42 and starring ": null
    },
    {
        "Sean Connery": "sean connery"
    },
    {
        " as Bond. In 42 Goldfinger was adapted for ": null
    },
    {
        "BBC Radio": "bbc radio"
    },
    {
        " with ": null
    },
    {
        "Toby Stephens": "toby stephens"
    },
    {
        " as Bond and ": null
    },
    {
        "Sir Ian McKellen": "sir ian mckellen"
    },
    {
        " as Goldfinger.               Happenstance   While changing planes in Miami after closing down a Mexican heroin smuggling operation, the British ": null
    },
    {
        "Secret Service": "secret intelligence service"
    },
    {
        " operative James Bond meets Junius Du Pont, a rich American businessman whom Bond had briefly met and gambled with in ": null
    },
    {
        "Casino Royale": "casino royale"
    },
    {
        ". Du Pont asks Bond to watch ": null
    },
    {
        "Auric Goldfinger": "auric goldfinger"
    },
    {
        ", with whom Du Pont is playing ": null
    },
    {
        "canasta": "canasta"
    },
    {
        ", to discover if he is cheating. Bond soon realises that Goldfinger is using his assistant, Jill Masterton, to spy on Du Ponts cards. Bond blackmails Goldfinger into admitting his guilt and paying back Du Ponts lost money; Bond also has a brief affair with Masterton. Back in London, Bonds superior, ": null
    },
    {
        "M": "m"
    },
    {
        ", tasks him with determining how Goldfinger is smuggling gold out of Britain; M also suspects Goldfinger of being connected to ": null
    },
    {
        "SMERSH": "smersh"
    },
    {
        " and financing their western networks with his gold. Bond visits the ": null
    },
    {
        "Bank of England": "bank of england"
    },
    {
        " for a briefing on the methods of gold smuggling.     Coincidence   Bond contrives to meet and play a round of golf with Goldfinger; Goldfinger attempts to win the golf match by cheating, but Bond turns the tables on him, beating him in the process. He is subsequently invited to Goldfingers mansion near ": null
    },
    {
        "Reculver": "reculver"
    },
    {
        " where he narrowly escapes being caught ": null
    },
    {
        "on camera": "closed-circuit television"
    },
    {
        " looking through the house. Goldfinger introduces Bond to his ": null
    },
    {
        "factotum": "handyman"
    },
    {
        ", a Korean named ": null
    },
    {
        "Oddjob": "oddjob"
    },
    {
        ".          Issued by MI42 with an ": null
    },
    {
        "Aston Martin DB Mark III": "aston martin db mark iii"
    },
    {
        ", Bond trails Goldfinger in his vintage ": null
    },
    {
        "Rolls-Royce Silver Ghost": "rolls-royce silver ghost"
    },
    {
        " , driven by Oddjob. Both travel by ": null
    },
    {
        "air ferries": "air ferry"
    },
    {
        " to Switzerland. Bond manages to trace Goldfinger to a warehouse in Geneva, where he finds that the armour of the Rolls-Royce is actually white-gold, cast into panels at his Kent refinery. When the car reaches the factory in Switzerland , he recasts the gold from the armour panels into aircraft seats and fits the seats to the aeroplanes of Mecca Charter Airline, in which he holds a large stake. The gold is finally sold in India at a large profit. Bond foils an assassination attempt on Goldfinger by Jill Mastertons sister, Tilly, to avenge Jills death at Goldfingers hands: he had painted her body with gold paint, which killed her. Bond and Tilly attempt to escape when the alarm is raised, but are captured.     Enemy action   Bond is tortured by Oddjob when he refuses to confess his role in trailing Goldfinger. In a desperate attempt to escape being cut in two by a ": null
    },
    {
        "circular saw": "circular saw"
    },
    {
        ", Bond offers to work for Goldfinger, a ruse that Goldfinger initially refuses but then accepts. Bond and Tilly are subsequently taken to Goldfingers operational headquarters in a warehouse in New York City. They are put to work as secretaries for a meeting between Goldfinger and several gangsters , who have been recruited to assist in Operation Grand Slam —stealing gold from the ": null
    },
    {
        "United States Bullion Depository": "united states bullion depository"
    },
    {
        " at ": null
    },
    {
        "Fort Knox": "fort knox"
    },
    {
        ". One of the gang leaders, Helmut Springer, refuses to join the operation and is killed by Oddjob. Bond learns that the operation includes killing the inhabitants of Fort Knox by introducing poison into the water supply. He manages to conceal a message in the toilet of Goldfingers private plane, where he hopes it will be found and sent to ": null
    },
    {
        "Pinkertons": "pinkerton national detective agency"
    },
    {
        ", where his friend and ex-counterpart ": null
    },
    {
        "Felix Leiter": "felix leiter"
    },
    {
        " now works.     Operation Grand Slam commences, and it transpires that Leiter has found and acted on Bonds message. A battle commences, but Goldfinger escapes. Tilly, a lesbian, hopes that one of the gang leaders, ": null
    },
    {
        "Pussy Galore": "pussy galore"
    },
    {
        " , will protect her, but she is killed by Oddjob. Goldfinger, Oddjob and the Mafia bosses all escape in the melee. Bond is drugged before his flight back to England and wakes to find he has been captured by Goldfinger, who drugged a ": null
    },
    {
        "BOAC": "boac"
    },
    {
        " flightcrew and hijacked their jetliner. Bond manages to break a window, causing a ": null
    },
    {
        "depressurisation": "uncontrolled decompression"
    },
    {
        " that blows Oddjob out of the plane; he then fights and strangles Goldfinger. At gunpoint, he forces the crew to ditch in the sea near the Canadian coast, where they are rescued by a nearby ": null
    },
    {
        "weathership": "weather ship"
    },
    {
        ".       By January 42 the author ": null
    },
    {
        "Ian Fleming": "ian fleming"
    },
    {
        " had published five novels in the preceding five years: Casino Royale in 42  Live and Let Die  ,  Moonraker  ,  Diamonds Are Forever  and  From Russia, with Love  in 42 A fifth,  Dr. No , was being edited and prepared for production. That month Fleming travelled to his ": null
    },
    {
        "Goldeneye estate": "goldeneye"
    },
    {
        " in Jamaica to write Goldfinger. He followed his usual practice, which he later outlined in  Books and Bookmen  magazine: I write for about three hours in the morning  ... and I do another hours work between six and seven in the evening. I never correct anything and I never go back to see what I have written  ... By following my formula, you write 42 words a day.  He returned to London in March that year with a 42-page typescript, the longest he had produced to that time. He initially gave the manuscript the title The Richest Man in the World; few alterations were made to the story before publication.     Although Fleming did not date the events within his novels, John Griswold and Henry Chancellor—both of whom wrote books for ": null
    },
    {
        "Ian Fleming Publications": "ian fleming publications"
    },
    {
        "—identified different timelines based on events and situations within the ": null
    },
    {
        "novel series": "list of james bond novels and short stories"
    },
    {
        " as a whole. Chancellor put the events of Goldfinger in 42; Griswold is more precise, and considers the story to have taken place from late-April to early-June that year.     Fleming had long been fascinated with gold. He was a collector of Spanish ": null
    },
    {
        "doubloon": "doubloon"
    },
    {
        "s, and he commissioned a gold-plated typewriter from the ": null
    },
    {
        "Royal Typewriter Company": "royal typewriter company"
    },
    {
        ", although he never actually used it; he wrote with a gold-tipped ballpoint pen and included the theft or obtaining of gold in several of his stories. When researching for Goldfinger, Fleming reinforced his knowledge of gold by sending a questionnaire to an expert at the ": null
    },
    {
        "Worshipful Company of Goldsmiths": "worshipful company of goldsmiths"
    },
    {
        "—one of the ": null
    },
    {
        "livery companies": "livery companies"
    },
    {
        " of the ": null
    },
    {
        "City of London": "city of london"
    },
    {
        " who ": null
    },
    {
        "assay": "assay"
    },
    {
        " precious metals for purity—with a list of queries about gold, its properties and the background of the industry, including smuggling.     Fleming had originally conceived the card game scene as a separate short story but instead used the device for Bond and Goldfingers first encounter. The architect ": null
    },
    {
        "Ernő Goldfinger": "ernő goldfinger"
    },
    {
        " threatened to sue Fleming over the use of the name. With the book already printed but not released, Fleming threatened to add an erratum slip to the book changing the name from Goldfinger to Goldprick and explaining why; the matter was settled out of court after the publishers, ": null
    },
    {
        "Jonathan Cape": "jonathan cape"
    },
    {
        ", paid Ernős legal costs, agreed to ensure the name Auric was always used in conjunction with Goldfinger and sent him six copies of the novel.     Once Fleming completed the novel—which he found the easiest of all the Bond books to write—he thought he had exhausted his inspiration for plots. He told the writer ": null
    },
    {
        "William Plomer": "william plomer"
    },
    {
        "—his friend who proof-read all the Bond books—that Goldfinger was to be the last full length folio on Bond  ... Though I may be able to think up some episodes for him in the future, I shall never be able to give him 42 words again .            Fleming based some points in the book on events he had read about. The pre-First World War death of a showgirl in Europe after she had covered herself in paint was one such idea, and the depressurisation of Goldfingers plane was a plot device Fleming had intended to use elsewhere, but which he included in Goldfinger. Some years previously a plane had depressurised over the Lebanon and an American passenger had been sucked out of the window; Fleming, who was not a comfortable airline passenger, had made note of the incident to use it. As he had done in previous Bond novels, Fleming used the names of several friends or associates in the novel. The surname of ": null
    },
    {
        "Sir John Masterman": "john cecil masterman"
    },
    {
        ", the MI42 agent and Oxford academic who ran the ": null
    },
    {
        "double-cross system": "double-cross system"
    },
    {
        " during the Second World War, was used as the basis for the Masterton sisters; Alfred Whiting, the golf professional at ": null
    },
    {
        "Royal St Georges Golf Club": "royal st georges golf club"
    },
    {
        ", Sandwich, became Alfred Blacking; while the Royal St Georges Golf Club itself became the Royal St Marks, for the game between Bond and Goldfinger.     In June 42 Fleming played in the Bowmaker Pro-Am golf tournament at the Berkshire Golf Club, where he partnered ": null
    },
    {
        "Peter Thomson": "peter thomson"
    },
    {
        ", the winner of ": null
    },
    {
        "The Open Championship": "the open championship"
    },
    {
        "; much of the background went into the match between Bond and Goldfinger. One of Flemings neighbours in Jamaica, and later his lover, was ": null
    },
    {
        "Blanche Blackwell": "blanche blackwell"
    },
    {
        "; Fleming used Blanche as the model for Pussy Galore, although the name Pussy came from Mrs Pussy Deakin, formerly Livia Stela, an ": null
    },
    {
        "SOE": "special operations executive"
    },
    {
        " agent and friend of Flemings wife.     Flemings golf partner, John Blackwell , was also a cousin by marriage to Ernő Goldfinger and disliked him: it was Blackwell who reminded Fleming of the name. Fleming also disliked Goldfinger, who, Fleming thought, destroyed Victorian buildings and replaced them with his own ": null
    },
    {
        "modernist": "modernist"
    },
    {
        " designs, particularly a terrace at Goldfingers own residence at ": null
    },
    {
        "42 Willow Road": "2 willow road"
    },
    {
        ", ": null
    },
    {
        "Hampstead": "hampstead"
    },
    {
        ". Blackwell had his name used as the heroin smuggler at the beginning of the book, with a sister who was a heroin addict.     There were some similarities between Ernő and Auric Goldfinger: both were Jewish immigrants who came to Britain from Eastern Europe in the 42s and both were Marxists. The fictional and real Goldfingers were physically very different. According to the historian Henry Chancellor the likely model for Auric Goldfinger was the American gold tycoon ": null
    },
    {
        "Charles W. Engelhard Jr.": "charles w. engelhard jr."
    },
    {
        ", whom Fleming had met in 42 Engelhard had established a business, the Precious Metals Development Company, which circumvented numerous export restrictions, selling gold ingots directly into Hong Kong.       The character of Bond was developed more in Goldfinger than in the previous novels; the historian ": null
    },
    {
        "Jeremy Black": "jeremy black"
    },
    {
        " considers that Bond was presented as a complex character . The novelist ": null
    },
    {
        "Raymond Benson": "raymond benson"
    },
    {
        "—who later wrote a series of Bond novels—sees Goldfinger as a transitional novel, making Bond more human than in previous books and more concerned with what Benson calls the mortal trappings of life . This manifests itself in the opening chapter of the book as Bond sits in Miami airport and thinks through his fight with and killing of a Mexican thug. Benson also finds Bond developing something of a sense of humour in Goldfinger, verbally abusing Oddjob for his own amusement.     The ": null
    },
    {
        "anthropologist": "anthropologist"
    },
    {
        " Anthony Synnott examined several examples of racism in the Bond novels, and finds in Goldfinger examples of the most blatant racism of the series, all of which concern the Koreans; as an example, Synnott highlights the sentence putting Oddjob and any other Korean firmly in his place, which, in Bonds estimation, was rather lower than apes in the mammalian hierarchy . Benson agrees that Bond is shown as a bigot in the passage quoted, and observes that this is the only point in all the works in which Bond disparages a whole race.          The writer ": null
    },
    {
        "Anthony Burgess": "anthony burgess"
    },
    {
        ", in his 42 work  Ninety-nine Novels , describes Flemings malefactors as impossible villains, enemies of democracy, megalomaniacs ; Burgess goes on to write that Goldfinger is the most extravagant of these . The character was described by Benson as Flemings most successful villain to that point in the series, and Fleming gives him several character flaws that are brought out across the novel. Black writes that psychologically Goldfinger is warped, possibly because of an inferiority complex brought on by his shortness, in contrast to several of Flemings other over-sized villains. Physically he is odd, with a lack of proportion to his body. According to the literary analyst LeRoy L. Panek, in his examination of 42th-century British spy novels, in several of Flemings novels he uses characters as psychological counters in a game of simplified psychology . Fleming writes that Bond always mistrusted short men. They grew up from childhood with an inferiority complex.  ... Napoleon had been short, and Hitler. It was the short men that caused all the trouble in the world , an opinion Black considers a reflection of the racialism and crude psychology of early-twentieth century literature.     Like many other of Flemings villains, Goldfinger is not of British extraction ; other villains have been, for example, Russian, German, Jewish, Chinese-German or Slav. Synnott observes that in many of the Bond novels, including Goldfinger, Ugliness, evil and foreignness go together, complementing and reinforcing each other. Ugliness symbolizes evil and evil is symbolized by ugliness and foreignness.      Fleming employs devices he uses elsewhere in the series to show Goldfinger is corrupt or outside what Fleming considered normal. Goldfinger cheats at cards and golf; Panek considers this is a traditional sign of a gauche individual. Black considers that Goldfinger is portrayed as a killjoy as he does not consume cigarettes or alcohol—unlike many people of the time—but he does pay prostitutes; these aspects of Goldfingers are condemned by Fleming for being outside normal appetites.     Elisabeth Ladenson, the general editor of Romanic Review, believes the character of Pussy Galore to be perhaps the most memorable figure in the Bond periphery . Galore was introduced by Fleming for Bond to seduce her, proving Bonds masculinity by his being able to seduce a lesbian. To some extent the situation also reflected Flemings own opinions, expressed in the novel as part of Bonds thoughts, where her sexual confusion is attributable to womens suffrage ; in addition, as Fleming himself put it in the book: Bond felt the sexual challenge all beautiful Lesbians have for men.  Ladenson points out that, unlike some Bond girls, Galores role in the plot is crucial and she is not just there as an accessory: it is her change of heart that allows good to triumph over evil. The cultural historians Janet Woollacott and ": null
    },
    {
        "Tony Bennett": "tony bennett"
    },
    {
        " consider that many of the female characters in the Bond series depart from Flemings accepted cultural norms; both Pussy Galore and Tilly Masterton conform to this rule because they are lesbian. For those that Bond sleeps with, there is a back story explaining why they are outside Flemings norm: in Pussy Galores case, it is because she was raped by her uncle. According to Stephen Heath, the literature and cultural historian, Galores lesbianism is explained by being anti-man, following the rape, and she is converted because, as she says in the book, I never met a man before . Bonds conversion of Galore from lesbian to his bed partner reflected Flemings sexual politics . It was, Black sees, a crude end to the book, a form of ": null
    },
    {
        "happy ending": "happy ending"
    },
    {
        " .       The sixth Bond novel, Dr. No began what the media historian ": null
    },
    {
        "James Chapman": "james chapman"
    },
    {
        " describes as the move of the Bond books to fantastic and highly improbable plots ; Chapman considers that Goldfinger maintains that trend. He also finds it the most implausible of Flemings plots . Benson states that the plot is impractical and that sometimes theres no logic in the sequence of events ; the author ": null
    },
    {
        "Kingsley Amis": "kingsley amis"
    },
    {
        "—who also later wrote a Bond novel—says that the novel was more implausible than most . According to Panek there is an episodic approach in Flemings works; in Goldfinger this manifests itself in the use of the card game—something also seen in Casino Royale and Moonraker; Benson considers the novel to be more episodic than Flemings previous books.     Fleming structured the novel in three sections— Happenstance , Coincidence and Enemy action —which was how Goldfinger described Bonds three seemingly coincidental meetings with him. Like Dr. No, what seems to be a trivial event—in this case the card game—leads to what Chapman calls a grandiose criminal conspiracy . The denouement of the novel is described by Black as hurried and unsatisfactory , and the one-man heroism of the work is too stretched across the novel.     Benson, and Flemings biographer ": null
    },
    {
        "Matthew Parker": "matthew parker"
    },
    {
        ", consider Goldfinger to be the densest of the Bond novels, with a fast pace and high levels of action, in which Bond moves from Miami, via New York to London, then through Kent and northern France to Switzerland, then back to New York to Kentucky, to New York, Washington, and finally ditching the aeroplane in the North Atlantic.       As with other Bond novels, such as Casino Royale, gambling is a theme—not only the money staked on the golf match as part of the novel, but opening with the canasta game. Raymond Benson identified times in the novel when Bonds investigation of Goldfinger was a gamble too, and cites Bond tossing a coin to decide on his tactics in relation to his quarry. Once more  it is Bond the British agent who has to sort out what turns out to be an American problem and this, along with Bonds warning to Goldfinger not to underestimate the English, may be seen as Flemings reaction to the lack of US support over the ": null
    },
    {
        "Suez Crisis": "suez crisis"
    },
    {
        " in 42        Benson identifies a theme of Bond acting as ": null
    },
    {
        "St George": "st george"
    },
    {
        " in Goldfinger which, he says, has run in all the novels, but is finally stated explicitly in the book as part of Bonds thoughts. This is after Goldfinger reveals he will use an atomic device to open the vault: Bond sighed wearily. Once more into the breach, dear friend! This time it really was St George and the dragon. And St George had better get a move on and do something . Jeremy Black notes that the image of the latter-day St George again an English, rather than British image . According to Ladenson, by making Bond St George, Goldfinger himself  ... is a mere obstacle, the dragon to be got rid of before the worthy knight can make off with the duly conquered lady .     Goldfinger has an obsession with gold to the extent that Ladenson says that he is a walking tautology . Ladenson lists both his family name and his first name as being related to gold ; his clothes, hair, car and cat are all gold coloured, or a variant thereof; his Korean servants are referred to by Bond as being yellow , or yellow-faced ; and he paints his women gold before sex.     As with a number of other villains in the Bond novels, there is a reference to the Second World War, to show the post-war readers how evil Bonds villains were. Thus, Goldfinger employs members of the German ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        ", Japanese and Koreans. For Operation Grand Slam, Goldfinger used the poison GB—now known as ": null
    },
    {
        "Sarin": "sarin"
    },
    {
        "—which had been discovered by the Nazis. Pussy Galores all-woman criminal gang has some members that look like some young ": null
    },
    {
        "SS": "ss"
    },
    {
        " guardsman , to underline the connection to evil.           Goldfinger was published on 42 March 42 in the UK as a hardcover edition by Jonathan Cape; it was 42 pages long and cost fifteen ": null
    },
    {
        "shilling": "shilling"
    },
    {
        "s. As with his previous four novels, Fleming came up with the design of the front cover, which featured a rose between a skulls teeth. He commissioned ": null
    },
    {
        "Richard Chopping": "richard chopping"
    },
    {
        " to provide the artwork. According to Jonathan Hopson of the ": null
    },
    {
        "Victoria and Albert Museum": "victoria and albert museum"
    },
    {
        ", the covers macabre symbolism memorably expresses the novels themes of greed, sex and death . The book was dedicated to gentle reader, William Plomer . The novel went straight to the top of the best-seller lists. Fleming took part in a select number of promotional activities, including appearing on the television programme The Bookman and attending a book signing at ": null
    },
    {
        "Harrods": "harrods"
    },
    {
        ". In May 42 ": null
    },
    {
        "Pan Books": "pan books"
    },
    {
        " published a paperback version of the novel in the UK, which sold 42 copies before the end of the year. Since its initial publication the book has been issued in numerous hardback and paperback editions, translated into several languages and, as at , has never been out of print.       Goldfinger received more positive reviews than Flemings previous novel, Dr. No, which had faced widespread criticism in the British media. Writing in  The Observer , ": null
    },
    {
        "Maurice Richardson": "maurice richardson"
    },
    {
        " thought that Mr. Fleming seems to be leaving realism further and further behind and developing only in the direction of an atomic, sophisticated ": null
    },
    {
        "Sapper": "sapper"
    },
    {
        " . Though Fleming may have left reality behind, Richardson considered that the writer, even with his forked tongue sticking right through his cheek,  ... remains maniacally readable . Richardson said that Goldfinger is the most preposterous specimen yet displayed in Mr. Flemings museum of super fiends , and, referring to the novels central character, observed that the real trouble with Bond, from a literary point of view, is that he is becoming more and more synthetic and zombie-ish. Perhaps it is just as well.  In  The Manchester Guardian , Roy Perrott observed that Goldfinger  ... will not let close admirers down . Perrott thought that overall Fleming is again at his best when most sportingly ": null
    },
    {
        "Buchan-ish": "john buchan, 1st baron tweedsmuir"
    },
    {
        " as in the motoring pursuit across Europe ; he summarised the book by saying that it was hard to put down; but some of us wish we had the good taste just to try .      The Times  thought that Bond was backed up by sound writing by Fleming; the critic thought that although the plot was grandiose it sounds—and is—fantastic; the skill of Mr. Fleming is to be measured by the fact that it is made not to seem so . For  The Times Literary Supplement , Michael Robson considered that a new Bond has emerged from these pages: an agent more relaxed, less promiscuous, less stagily muscular than of yore . Robson added that the story, too, is more relaxed . Robson saw this as a positive development, but it did mean that although there are incidental displays of the virtuosity to which Mr. Fleming has accustomed us,  ... the narrative does not slip into top gear until Goldfinger unfolds his plan .  The Evening Standard  looked at why Bond was a success and listed the things that make Bond attractive: the sex, the sadism, the vulgarity of money for its own sake, the cult of power, the lack of standards .  The Sunday Times  called Goldfinger Guilt-edged Bond ; the critic for  The Manchester Evening News  thought that Only Fleming could have got away with it  ... outrageously improbable, wickedly funny, wildly exciting .     Even the avid anti-Bond and an anti-Fleming man , ": null
    },
    {
        "Anthony Boucher": "anthony boucher"
    },
    {
        ", writing for  The New York Times  appeared to enjoy Goldfinger, saying the whole preposterous fantasy strikes me as highly entertaining . The critic for  The New York Herald Tribune , James Sandoe considered the book to be a superlative thriller from our foremost literary magician .     Burgess cites Goldfinger as one of the 42 best novels in English since 42 Fleming raised the standard of the popular story of espionage through good writing—a heightened journalistic style—and the creation of a government agent—James Bond, 42—who is sufficiently complicated to compel our interest over a whole series of adventures.             Goldfinger was serialised on a daily basis in the  Daily Express  newspaper from 42 March 42 onwards. Flemings original novel was adapted as a daily ": null
    },
    {
        "comic strip": "comic strip"
    },
    {
        " which was published in the same paper and syndicated around the world—the first of the novels to be adapted as such. The adaptation ran from 42 October 42 to 42 April 42 and Fleming received £42 for the British publication and a percentage for syndicated copies. The adaptation was written by ": null
    },
    {
        "Henry Gammidge": "henry gammidge"
    },
    {
        " and illustrated by ": null
    },
    {
        "John McLusky": "john mclusky"
    },
    {
        ". Goldfinger was reprinted in 42 by ": null
    },
    {
        "Titan Books": "titan books"
    },
    {
        " as part of the Dr. No anthology, which in addition to Dr. No, also included Diamonds Are Forever and From Russia, with Love.        In 42 Goldfinger became the third entry in the James Bond film series. ": null
    },
    {
        "Sean Connery": "sean connery"
    },
    {
        " returned as Bond, and the German actor ": null
    },
    {
        "Gert Fröbe": "gert fröbe"
    },
    {
        " played Auric Goldfinger. The film was mostly similar to the novel, but Jill and Tilly Masterton have shortened roles and earlier deaths in the story. The plot of the film was also changed from stealing the gold at Fort Knox to ": null
    },
    {
        "irradiating": "irradiation"
    },
    {
        " the gold vault with a ": null
    },
    {
        "dirty bomb": "dirty bomb"
    },
    {
        ". Alan Barnes and Marcus Hearn, in their examination of the Bond films, consider that the film improves on what they see as some of Flemings ludicrous notions . The pair highlight the irradiation of the gold in Fort Knox, and the change of Pussy Galores organisation to stunt pilots, rather than masquerading as nurses, as examples of improvements.     The 42 ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " documentary  Omnibus : The British Hero featured ": null
    },
    {
        "Christopher Cazenove": "christopher cazenove"
    },
    {
        " playing a number of such title characters , including James Bond in dramatised scenes from Goldfinger—notably featuring the hero being threatened with the novels circular saw, rather than the films laser beam—and  Diamonds Are Forever .     Following its radio version of Dr. No, produced in 42 as a special one-off to mark the centenary of Ian Flemings birth, ": null
    },
    {
        "Eon Productions": "eon productions"
    },
    {
        " allowed a second Bond story to be adapted. On 42 April 42 ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " broadcast a radio adaptation of Goldfinger with ": null
    },
    {
        "Toby Stephens": "toby stephens"
    },
    {
        "  as Bond, ": null
    },
    {
        "Sir Ian McKellen": "sir ian mckellen"
    },
    {
        " as Goldfinger and Stephenss Die Another Day co-star ": null
    },
    {
        "Rosamund Pike": "rosamund pike"
    },
    {
        " as Pussy Galore. The play was adapted from Flemings novel by Archie Scottney and was directed by ": null
    },
    {
        "Martin Jarvis": "martin jarvis"
    },
    {
        ".": null
    }
]