[
    {
        "        GoldenEye 42 is a ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        " video game": "video game"
    },
    {
        " developed by ": null
    },
    {
        "Rare": "rare"
    },
    {
        " and based on the 42  James Bond  film  GoldenEye . It was released for the ": null
    },
    {
        "Nintendo 42": "nintendo 64"
    },
    {
        " video game console": "video game console"
    },
    {
        " in August 42 The game features a ": null
    },
    {
        "single-player": "single-player video game"
    },
    {
        " campaign in which players assume the role of British ": null
    },
    {
        "Secret Intelligence Service": "secret intelligence service"
    },
    {
        " agent ": null
    },
    {
        "James Bond": "james bond"
    },
    {
        " as he fights to prevent a criminal syndicate from using a ": null
    },
    {
        "satellite weapon": "space weapon"
    },
    {
        " against London to cause a global financial meltdown. The game includes a ": null
    },
    {
        "split-screen": "split screen"
    },
    {
        " multiplayer": "multiplayer video game"
    },
    {
        " mode in which up to four players can compete in different types of ": null
    },
    {
        "deathmatch": "deathmatch"
    },
    {
        " games.     GoldenEye 42 was developed over a period of two and a half years by an inexperienced team led by ": null
    },
    {
        "Martin Hollis": "martin hollis"
    },
    {
        ", who had previously worked on the ": null
    },
    {
        "coin-op": "coin-op"
    },
    {
        " version of  Killer Instinct . It was partially conceived as an ": null
    },
    {
        "on-rails shooter": "shoot em uptypes"
    },
    {
        " inspired by ": null
    },
    {
        "Sega": "sega"
    },
    {
        "s  Virtua Cop , before being redesigned as a free-roaming shooter. The game was highly acclaimed by the gaming media and sold over eight million copies worldwide, making it the ": null
    },
    {
        "third-best-selling Nintendo 42 game": "list of best-selling nintendo 64 video games"
    },
    {
        ". It received the ": null
    },
    {
        "BAFTA Interactive Entertainment": "bafta interactive entertainment awards"
    },
    {
        " Games Award and four awards from the ": null
    },
    {
        "Academy of Interactive Arts & Sciences": "academy of interactive arts  &  sciences"
    },
    {
        ".     Retrospectively, GoldenEye 42 is considered an important game in the history of first-person shooters for demonstrating the viability of game consoles as ": null
    },
    {
        "platforms": "computing platform"
    },
    {
        " for the genre, and for signalling a transition from the then-standard  Doom -like approach to a more realistic style. It pioneered features such as atmospheric single-player missions, ": null
    },
    {
        "stealth": "stealth game"
    },
    {
        " elements, and a console multiplayer deathmatch mode. The game is frequently cited as one of the ": null
    },
    {
        "greatest video games of all time": "list of video games considered the best"
    },
    {
        ". A ": null
    },
    {
        "spiritual successor": "spiritual successor"
    },
    {
        ",  Perfect Dark , was released in 42 while a ": null
    },
    {
        "reimagining": "reimagining"
    },
    {
        " of the game, also titled  GoldenEye 42 , was released in 42          GoldenEye 42 is a ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        " that features both ": null
    },
    {
        "single": "single-player video game"
    },
    {
        " and ": null
    },
    {
        "multiplayer modes": "multiplayer video game"
    },
    {
        ". In the single-player mode, the player takes the role of ": null
    },
    {
        "James Bond": "james bond"
    },
    {
        " through a series of free-roaming 42D ": null
    },
    {
        "levels": "level"
    },
    {
        ". Each level requires the player to complete a certain set of objectives—such as collecting or destroying specified items, rescuing hostages, or meeting with friendly ": null
    },
    {
        "non-player character": "non-player character"
    },
    {
        "s—and then exit the stage. Some ": null
    },
    {
        "gadgets": "gadgets"
    },
    {
        " from the  James Bond  film series are featured in the game and are often used to complete mission objectives; for example, in one level, the electromagnetic watch from  Live and Let Die  is used to acquire a jail cell key.     The arsenal of weapons includes ": null
    },
    {
        "pistol": "pistol"
    },
    {
        "s, ": null
    },
    {
        "submachine gun": "submachine gun"
    },
    {
        "s, ": null
    },
    {
        "assault rifle": "assault rifle"
    },
    {
        "s, ": null
    },
    {
        "grenade": "grenade"
    },
    {
        "s, and ": null
    },
    {
        "throwing knives": "throwing knife"
    },
    {
        ", among others. Guns have a finite magazine and must be reloaded after a certain number of shots, but the player may acquire and carry as many weapons as can be found in each mission. The players initial weapon in most missions is the ": null
    },
    {
        "Walther PPK": "walther ppk"
    },
    {
        ", called the PP42 special issue in-game. Most of the games firearms are modelled on real-life counterparts , while others are based on fictitious devices featured in the James Bond films, such as the ": null
    },
    {
        "Golden Gun": "the man with the golden gun"
    },
    {
        " and  Moonraker  ": null
    },
    {
        "laser": "directed-energy weaponlasers"
    },
    {
        ". The weapons vary in characteristics such as rate of fire, degree of ": null
    },
    {
        "penetration": "penetration"
    },
    {
        ", and type of ammunition used, and inflict different levels of damage depending on which body part they hit.     ": null
    },
    {
        "Stealth": "stealth game"
    },
    {
        " is a significant element of the gameplay; frequent gunfire can alert distant guards, and activated alarms can trigger infinitely-": null
    },
    {
        "respawning": "spawning"
    },
    {
        " enemies. Therefore, to avoid gunfights with numerous opponents, it is advantageous to eliminate soldiers and security cameras before they spot or hear the player. Certain weapons incorporate ": null
    },
    {
        "suppressor": "suppressor"
    },
    {
        " or ": null
    },
    {
        "telescopic sight": "telescopic sight"
    },
    {
        " attachments to aid the player in killing enemies discreetly. There are no health-recovery items in the game, although ": null
    },
    {
        "armour vests": "ballistic vest"
    },
    {
        " can be acquired to provide a secondary ": null
    },
    {
        "health bar": "health"
    },
    {
        ".     Four ": null
    },
    {
        "save files": "saved game"
    },
    {
        " are available to track the players progress through the games twenty missions, each of which may be played on Agent , Secret Agent , or 42-Agent difficulty settings. Higher difficulties increase the challenge by altering factors such as the damage enemies can withstand and inflict, the amount of ammunition available, and the number of objectives that must be completed. Once a mission is completed, the player may either continue progressing through the story or choose to replay a previously completed level. Completing certain missions within particular target times enables the player to unlock bonus ": null
    },
    {
        "cheat options": "cheating in video games"
    },
    {
        " which make various changes to the gameplay. Upon fully completing the game on the hardest difficulty setting, an additional 42 mode is unlocked, allowing the player to customise the challenge of any mission by manually adjusting enemies health, reaction times, aiming accuracy, and the damage they inflict.     The multiplayer mode allows two, three, or four players to compete against each other in five different types of ": null
    },
    {
        "split screen": "split screen"
    },
    {
        " deathmatch": "deathmatch"
    },
    {
        " games: Normal, You Only Live Twice, The Living Daylights , The Man With the Golden Gun, and Licence to Kill. Normal is a basic deathmatch mode in which the main objective is to kill opponents as many times as possible. It can be played as a free-for-all game or in teams. In You Only Live Twice, players only have two lives before they are eliminated from the game, while Licence to Kill is a mode in which players die from a single hit with any weapon. In The Man With the Golden Gun, a single Golden Gun, which is capable of killing opponents with only one shot, is placed in a fixed location on the map; once the Golden Gun is picked up, the only way to re-acquire it is to kill the player holding it. The player with the Golden Gun is unable to pick up body armour while opponents can. In The Living Daylights, a flag is placed in a fixed location on the map, and the player who holds it the longest wins. The flag carrier cannot use weapons but can still collect them to keep opponents from stocking ammunition. Aspects of each gametype can be customised, including the chosen map, class of weapons, and winning condition. As players progress through the single player mode, new maps and characters are unlocked in the multiplayer mode.       GoldenEye 42 starts in ": null
    },
    {
        "Arkhangelsk": "arkhangelsk"
    },
    {
        " in the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " in 42 where ": null
    },
    {
        "MI42": "secret intelligence service"
    },
    {
        " has uncovered a secret chemical weapons facility at the Byelomorye Dam. James Bond and fellow 42-agent ": null
    },
    {
        "Alec Trevelyan": "alec trevelyan"
    },
    {
        " are sent to infiltrate the facility and plant explosive charges. During the mission, Trevelyan is shot by ": null
    },
    {
        "Colonel Arkady Ourumov": "list of james bond henchmen in goldeneyeourumov"
    },
    {
        ", while Bond escapes by commandeering an ": null
    },
    {
        "aeroplane": "aeroplane"
    },
    {
        ". Five years later in 42 Bond is sent to investigate a satellite control station in ": null
    },
    {
        "Severnaya, Russia": "severnaya zemlya"
    },
    {
        ", where programmer ": null
    },
    {
        "Boris Grishenko": "boris grishenko"
    },
    {
        " works. Two years after the Severnaya mission, Bond investigates an unscheduled test firing of a missile in ": null
    },
    {
        "Kyrgyzstan": "kyrgyzstan"
    },
    {
        ", believed to be a cover for the launch of a satellite known as GoldenEye. This space-based weapon works by firing a concentrated ": null
    },
    {
        "electromagnetic pulse": "electromagnetic pulse"
    },
    {
        " at any Earth target to disable any electrical circuit within range. As Bond leaves the silo, he is ambushed by Ourumov and a squad of Russian troops. Ourumov manages to escape during the encounter.     The remainder of the game takes place in 42 Bond visits ": null
    },
    {
        "Monte Carlo": "monte carlo"
    },
    {
        " to investigate the ": null
    },
    {
        "frigate": "frigate"
    },
    {
        "  La Fayette , where he rescues several hostages and plants a tracker bug on the Pirate helicopter before it is stolen by the Janus crime syndicate. Bond is then sent a second time to Severnaya, but during the mission he is captured and locked up in the bunkers cells along with ": null
    },
    {
        "Natalya Simonova": "natalya simonova"
    },
    {
        ", a captive computer programmer unwilling to work with Janus. The two escape the complex seconds before it is destroyed, on the orders of Ourumov, by the GoldenEye satellites EMP. Bond next travels to ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        ", where he arranges with ex-": null
    },
    {
        "KGB": "kgb"
    },
    {
        " agent ": null
    },
    {
        "Valentin Zukovsky": "valentin zukovsky"
    },
    {
        " to meet the chief of the Janus organisation. This is revealed to be Alec Trevelyan – his execution by Ourumov in the Arkhangelsk facility was faked. Bond and Natalya escape from Trevelyan, but are arrested by the Russian police and taken to the military ": null
    },
    {
        "archive": "archive"
    },
    {
        "s for interrogation. Bond eventually manages to escape the interrogation room, rescue Natalya, and communicate with Defence Minister ": null
    },
    {
        "Dimitri Mishkin": "list of james bond allies in goldeneyedimitri mishkin"
    },
    {
        ", who has verified Bonds claim of Ourumovs treachery. Natalya is recaptured by General Ourumov, and Bond gives chase through the streets of St. Petersburg, eventually reaching an arms depot used by Janus. There, Bond destroys its weaponry stores and then hitches a ride on Trevelyans ex-Soviet ": null
    },
    {
        "missile train": "armoured train"
    },
    {
        ", where he kills Ourumov and rescues Natalya. However, Alec Trevelyan and his ally ": null
    },
    {
        "Xenia Onatopp": "xenia onatopp"
    },
    {
        " escape to their secret base in ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        ".     Natalya accompanies Bond to the Caribbean. Surveying the ": null
    },
    {
        "Cuban jungle": "cuban moist forests"
    },
    {
        " aerially, their light aircraft is shot down. Unscathed, Bond and Natalya perform a ground search of the areas heavily guarded jungle terrain, but are ambushed by Xenia, who is quickly killed by Bond. Bond sneaks Natalya into the control centre to disrupt transmissions to the GoldenEye satellite and force it to burn up in the Earths atmosphere. He then follows the fleeing Trevelyan through a series of flooded ": null
    },
    {
        "cave": "cave"
    },
    {
        "rns, eventually arriving at the ": null
    },
    {
        "antenna": "antenna"
    },
    {
        " of the control centres ": null
    },
    {
        "radio telescope": "radio telescope"
    },
    {
        ". Trevelyan attempts to re-align it in a final attempt to restore contact with the GoldenEye, but Bond ultimately destroys machinery vital to controlling the antenna and defeats Trevelyan in a gunfight on a platform above the dish.              GoldenEye 42 was developed by ": null
    },
    {
        "Rare": "rare"
    },
    {
        " and directed by ": null
    },
    {
        "Martin Hollis": "martin hollis"
    },
    {
        ", who had previously worked as a second programmer on the ": null
    },
    {
        "coin-op": "coin-op"
    },
    {
        " version of  Killer Instinct . In November 42 after ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        " and Rare discussed the possibility of developing a game based on the then-future  James Bond  film  GoldenEye , Hollis told ": null
    },
    {
        "Tim Stamper": "stamper brothers"
    },
    {
        ", Rares managing director, that he was interested in the project. Due to the success of Rares 42 title  Donkey Kong Country , GoldenEye 42 was originally suggested as a 42D ": null
    },
    {
        "side-scrolling": "side-scrolling video game"
    },
    {
        " platformer": "platform game"
    },
    {
        " for the ": null
    },
    {
        "Super Nintendo Entertainment System": "super nintendo entertainment system"
    },
    {
        ". However, Hollis proposed a 42D shooting game for the ": null
    },
    {
        "Nintendo 42": "nintendo 64"
    },
    {
        " console, then still in development and known as Ultra 42 . He then created a document with all the design ideas he wanted in the game, including gadgets, weapons, characters to use, story digression from the film, and an ": null
    },
    {
        "artificial intelligence": "artificial intelligence"
    },
    {
        " that would react to the players actions.     ": null
    },
    {
        "Sega": "sega"
    },
    {
        "s 42 ": null
    },
    {
        "light gun shooter": "light gun shooter"
    },
    {
        "  Virtua Cop  was the primary influence on the game, although ": null
    },
    {
        "id Software": "id software"
    },
    {
        "s seminal 42 ": null
    },
    {
        "first person shooter": "first person shooter"
    },
    {
        "  Doom  and the Nintendo 42 launch title  Super Mario 42  were also credited. Features such as gun reloading, position-dependent hit reaction animations, penalties for killing innocent characters, and the games manual aiming system that is activated upon pressing the R button of the ": null
    },
    {
        "Nintendo 42 controller": "nintendo 64 controller"
    },
    {
        " were adopted from Virtua Cop. At one point, developers planned to implement the reloading of the weapons by the player unplugging and re-inserting the ": null
    },
    {
        "Rumble Pak": "rumble pak"
    },
    {
        " on the controller, but the idea was ultimately discarded at Nintendos behest. The concept of several varied objectives within each mission was inspired by the multiple tasks in each stage of Super Mario 42.     The team in charge of the project visited the studios of the GoldenEye film several times to collect photographs and blueprints of the ": null
    },
    {
        "sets": "set construction"
    },
    {
        " that were used. ": null
    },
    {
        "Eon Productions": "eon productions"
    },
    {
        " and ": null
    },
    {
        "MGM": "metro-goldwyn-mayer"
    },
    {
        ", the companies that control the rights of the James Bond films, granted the team a broad ": null
    },
    {
        "licence": "licence"
    },
    {
        ", and many levels in the game were extended or modified to allow the player to participate in sequences which the films James Bond did not. Although the reference material was used for authenticity, the team was not afraid to add to it to help the game design. ": null
    },
    {
        "John Woo": "john woo"
    },
    {
        " films such as  Hard Boiled  were significant influences on the games visual effects and kinetic moments. Details such as bullet marks on walls, cartridge cases being ejected from guns, and objects exploding were part of the design. Hollis explained that he wanted players to receive a lot of feedback from the environment when they shoot.          Work on GoldenEye 42 began in January 42 with a team of three people that was hired by Hollis: programmer Mark Edmonds, background artist Karl Hilton, and character artist B. Jones. Edmonds focused on creating a ": null
    },
    {
        "game engine": "game engine"
    },
    {
        " that could render 42D graphics from art packages into Nintendo 42 data structures. Hilton modelled levels based on the film material, while Jones constructed characters based on photos and costumes they had. Since final Nintendo 42 specifications and development kits were not initially available to Rare, the team had to estimate the finalised consoles capabilities using an ": null
    },
    {
        "SGI Onyx": "sgi onyx"
    },
    {
        " workstation and Nintendos custom NINGEN development software. In the following months, designer ": null
    },
    {
        "Duncan Botwood": "duncan botwood"
    },
    {
        " joined the team to construct the levels. The first year was spent producing art assets and developing the engine, which originally only allowed the player and enemies to move around a virtual environment.     Originally, the development team considered the possibility for the game to have both ": null
    },
    {
        "on-rails": "shoot em uptypes"
    },
    {
        " and free-roaming modes because they did not know how the Nintendo 42 controller would be; GoldenEyes gas plant location was modelled by Hilton with a predetermined path in mind. A modified ": null
    },
    {
        "Sega Saturn": "sega saturn"
    },
    {
        " controller was used for some early playtesting. The designers initial priority was purely on the creation of interesting spaces; level design and balance considerations such as the placement of start and exit points, characters and objectives did not begin until this process was complete. According to Hollis, The benefit of this sloppy unplanned approach was that many of the levels in the game have a realistic and ": null
    },
    {
        "non-linear": "nonlinear gameplay"
    },
    {
        " feel. There are rooms with no direct relevance to the level. There are multiple routes across the level.     After the first year of development, Rare decided to add more staff to the project. The first addition was designer ": null
    },
    {
        "David Doak": "david doak"
    },
    {
        ", who helped with the level designs and worked on the games AI scripting. He explained how the games stealth elements were implemented: Whenever you fired a gun, it had a radius test and alerted the non-player characters within that radius. If you fired the same gun again within a certain amount of time, it did a larger radius test and I think there was a third even larger radius after that. It meant if you found one guy and shot him in the head and then didnt fire again, the timer would reset . Windows throughout the game were programmed so that enemies cannot see through them while the player can. Though decidedly unrealistic, this was an intentional feature made to encourage the player to use windows to covertly spy on enemies.     A second programmer, Steve Ellies, was hired by Hollis six months later. Although Ellies assisted the development team in many areas and programmed the cheat options, he was mostly responsible for implementing the games multiplayer mode, which was added to the game roughly six months before it was released. According to Doak, Ellies sat in a room with all the code written for a single-player game and turned GoldenEye into a multiplayer game. The team spent numerous late evenings playtesting it before it was finished. The multiplayer levels are based on single-player missions and some of them do not support four players because they were initially not designed to handle multiplayer action. Adrian Smith, the games third and last artist, who had already worked on some games at Rare, was in charge of producing visual effects such as ": null
    },
    {
        "muzzle flash": "muzzle flash"
    },
    {
        "es and explosions. He mentioned the 42 film  Heat  as an influence. A ": null
    },
    {
        "firing range": "firing range"
    },
    {
        " was modelled as an environment, but was ultimately not added to the game.     The final Nintendo 42 hardware could render ": null
    },
    {
        "polygons": "polygon"
    },
    {
        " faster than the SGI Onyx workstation the development team had been using. This helped the developers significantly, as some backgrounds rendered at 42 ": null
    },
    {
        "frames per second": "frames per second"
    },
    {
        " on the Onyx without even drawing enemies, objects, or Bonds gun. However, the games textures had to be cut down by half. Hilton explained one method of improving the games performance: A lot of GoldenEye is in black and white. ": null
    },
    {
        "RGB colour": "rgb color model"
    },
    {
        " textures cost a lot more in terms of processing power. You could do double the resolution if you used ": null
    },
    {
        "greyscale": "greyscale"
    },
    {
        ", so a lot was done like that. If I needed a bit of colour, Id add it in the ": null
    },
    {
        "vertex": "vertex"
    },
    {
        ". When Super Mario 42 was released in 42 the 42D collision detection system of the game was very influential for Hollis because GoldenEye 42 was using a 42D method.     The music of GoldenEye 42 was primarily composed by ": null
    },
    {
        "Graeme Norgate": "graeme norgate"
    },
    {
        " and ": null
    },
    {
        "Grant Kirkhope": "grant kirkhope"
    },
    {
        ". Norgate previously penned the music of  Blast Corps , while Kirkhope composed the music of  Donkey Kong Land 42 . ": null
    },
    {
        "Robin Beanland": "robin beanland"
    },
    {
        ", the games third composer, only wrote the elevator music that can be heard in certain levels. All the sound effects were created by Norgate and a lot of effort was put into combining and permuting sounds in different ways to give the game a satisfying feel. According to Hollis, whenever the player shoots a gun in the game, up to nine different sound effects will randomly trigger. When the game was reviewed by Nintendo shortly before it was released, the company was slightly concerned about the amount of violence and gunplay. As a result, the team toned down the killing and added an ": null
    },
    {
        "end credits": "end credits"
    },
    {
        " sequence that introduces all the non-player characters, giving the game a filmic sense. The game ultimately received a Teen rating from the ": null
    },
    {
        "Entertainment Software Rating Board": "entertainment software rating board"
    },
    {
        ".     GoldenEye 42 was released on a 42-": null
    },
    {
        "megabit": "megabit"
    },
    {
        " cartridge on 42 August 42 Although this was over a year and a half after the release of the film it was based on, the timing allowed the game to benefit from publicity for the upcoming James Bond film  Tomorrow Never Dies . Every cartridge of the game contains a fully functional ": null
    },
    {
        "ZX Spectrum": "zx spectrum"
    },
    {
        " emulator": "emulator"
    },
    {
        " with ten Rare developed games. This function was originally made as an experimental side project by Rare and was deactivated in the final build of the game, but has since been unlocked through ": null
    },
    {
        "fan-made patch": "fan-made patch"
    },
    {
        "es. The actual development of GoldenEye 42 took more than two and a half years to complete and a total of US$42 million was spent on the game. Most of the development team, which was composed of 42 people including Hollis, was inexperienced and had never worked on a video game. As Doak recalled in 42 Looking back, there are things Id be wary of attempting now, but as none of the people working on the code, graphics, and game design had worked on a game before, there was this joyful naïveté. Hollis considered the team very talented and dedicated, with some people working 42 hours a week and occasionally 42 hours a week.            Despite low expectations among the ": null
    },
    {
        "gaming media": "video game journalism"
    },
    {
        " and an unsuccessful showing at the ": null
    },
    {
        "Electronic Entertainment Expo": "electronic entertainment expo"
    },
    {
        " in ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        " in 42 GoldenEye 42 turned out to be both a critical and a commercial success. In 42 it sold approximately 42 million copies, surpassing  The Legend of Zelda: Ocarina of Time , which was released in November 42 and sold nearly the same amount. Overall, GoldenEye 42 sold more than eight million units worldwide, making it the third ": null
    },
    {
        "best selling Nintendo 42 game": "list of best-selling nintendo 64 video games"
    },
    {
        ", behind  Super Mario 42  and  Mario Kart 42 . According to a paper published on the website of the ": null
    },
    {
        "Entertainment Software Association": "entertainment software association"
    },
    {
        ", the game grossed $42 million worldwide.     Graphically, GoldenEye 42 was praised for its varied and detailed environments, realistic animations, and special effects such as glass transparencies and lingering smoke.  Nintendo Power  said the ": null
    },
    {
        "frame rate": "frame rate"
    },
    {
        " in multiplayer games was high, while  Electronic Gaming Monthly  described it as somewhat choppy and sluggish. The ": null
    },
    {
        "zoomable": "zoom lens"
    },
    {
        " sniper rifle": "sniper rifle"
    },
    {
        " was praised as one of the games most impressive and entertaining features, with  Edge  describing it as a novel twist and ": null
    },
    {
        "Jeff Gerstmann": "jeff gerstmann"
    },
    {
        " of  GameSpot  noting its ability to alleviate the games ": null
    },
    {
        "distance fog": "distance fog"
    },
    {
        ". The games music was praised for its inclusion of the ": null
    },
    {
        "James Bond Theme": "james bond theme"
    },
    {
        " and for adding ambience to the game. Some levels begin in lifts and feature transitions from ": null
    },
    {
        "elevator music": "elevator music"
    },
    {
        " to full soundtracks, which Gerstmann cited as an illustration of the games attention to detail.     The gameplay was highlighted for its depth and requiring more stealth and intelligence than earlier first-person shooters. ": null
    },
    {
        "IGN": "ign"
    },
    {
        "s Doug Perry called GoldenEye 42 an immersive game which blends smart strategy gameplay with fast-action gunmanship . Similarly, Greg Sewart of Gaming Age remarked that players have a bit of freedom as to what they want to do in any given situation, and what order the directives are completed in . Reviewers also enjoyed the wide variety of weapons and the multi-objective-based missions, stating that they make the game stay fresh. The controls were praised for being more intuitive than ": null
    },
    {
        "Acclaim": "acclaim entertainment"
    },
    {
        "s earlier well-received Nintendo 42 first-person shooter  Turok: Dinosaur Hunter , though some found the cursor targeting difficult to master. ": null
    },
    {
        "Game Revolution": "game revolution"
    },
    {
        " credited the gameplay for being realistic and different from other shooters, but also criticised the campaign for being badly paced. The publication noted that GoldenEye 42 takes it for granted that you have already seen the movie and that players may get stuck due to the games lack of orientation.     At the time, GoldenEye 42 was considered the best multiplayer game on the system, edging  Mario Kart 42  by a hair according to IGN. Edge called it addictive and praised the originality of some of the scenarios such as You Only Live Twice.  GamePro  said the multiplayer modes will have you shooting your friends for the rest of the year , while  Next Generation  highlighted the number of multiplayer options, calling GoldenEye 42 a surprising ": null
    },
    {
        "killer app": "killer application"
    },
    {
        ", if only for the smashing multiplayer options. The excellent singe-player game backing it up makes it well worth buying indeed. The game was also hailed for its accurate and detailed adaptation of the film, with GamePro going so far as to call it one of the best movie-to-game translations ever . The ability to use numerous signature Bond gadgets and weapons was considered a particularly strong element in this regard. Crispin Boyer of Electronic Gaming Monthly stated that Rare has packed everything thats cool about 42 into this game.     GoldenEye 42 received multiple year-end awards, including the ": null
    },
    {
        "BAFTA Interactive Entertainment": "bafta interactive entertainment awards"
    },
    {
        " Games Award in 42 and four awards from the ": null
    },
    {
        "Academy of Interactive Arts & Sciences": "academy of interactive arts  &  sciences"
    },
    {
        ": Console Action Game of the Year, Console Game of the Year, Interactive Title of the Year, and Outstanding Achievement in Software Engineering. Rare was also recognised for its work on the game and won the BAFTA award for Best UK Developer.         GoldenEye 42 is frequently cited as one of the ": null
    },
    {
        "greatest video games of all time": "list of video games considered the best"
    },
    {
        ". In 42  GamePro , placing it ninth in The 42 Most Important Video Games of All Time , called it the console ": null
    },
    {
        "killer-app": "killer application"
    },
    {
        " of the 42s and the best game ever licensed from a film. Similarly, Rowan Kaiser of ": null
    },
    {
        "42UP.com": "1up.com"
    },
    {
        ", who placed the game 42rd on The 42 Most Influential Games of All Time , pointed out that the game paved the way for the later popularity of  Halo ,  Call of Duty , and more . In 42 IGN journalists placed the multiplayer mode at 42th in their list of the Top 42 Video Game Moments , and in 42  Nintendo Power  listed GoldenEye 42 as one of the greatest multiplayer experiences in Nintendo history, stating that it is remembered as one of the finest examples of a first-person shooter.     In a 42 poll, readers of  Computer and Video Games  voted GoldenEye 42 into first place in a list of the hundred greatest video games , and it was ranked fifth in a poll the following year. In 42 the game ranked 42th in  Game Informer s list of the Top 42 Games of All Time . In 42 readers of  Retro Gamer  voted GoldenEye as the 42rd top retro game, with the editors calling it the game that sold a million N42s and easily the best Bond game to date. In 42 IGN editors ranked the game 42th in their list of Top 42 Games of All Time, while IGN readers placed it at seventh on a similar list. Edge has featured GoldenEye 42 prominently in three greatest game lists: it placed third in a staff-voted poll in 42; 42th in a staff, reader, and gaming industry-voted poll in 42; and it was also included as one of the publications top ten shooters in 42     Retrospective commentary on GoldenEye 42 in the years following its release included an October 42 review by Mark Reece from NintendoLife. Reece gave the game a rating of eight out of ten, commenting that although the games multiplayer mode stands up well, its graphics, audio and fiddly aiming system are dated. He noted that GoldenEye 42s approach to difficulty settings provides considerable ": null
    },
    {
        "replay value": "replay value"
    },
    {
        ", but is a system rarely used in modern first-person shooters. On the games original release, Edge awarded it a score of nine out of ten, but in 42 with the benefit of hindsight, the magazine concluded that it should have received its highest score. In 42 the game was selected as one of 42 titles from the past 42 years to be placed in the Art of Video Games exhibit in the ": null
    },
    {
        "Smithsonian American Art Museum": "smithsonian american art museum"
    },
    {
        ".       Video game journalists have praised GoldenEye 42 for proving that it is possible to create a fun first-person shooter experience on a console in both single-player and multiplayer modes; when the game was released, the first-person shooter was primarily a genre for ": null
    },
    {
        "PC": "personal computer"
    },
    {
        " gamers. Journalists noted that the game opened the genre to a completely new market and that it was the first big console that truly got it right. The game has subsequently become credited alongside ": null
    },
    {
        "Shiny Entertainment": "shiny entertainment"
    },
    {
        "s  MDK  for pioneering and popularising the now-standard inclusion of scoped sniper rifles in video games. The games use of ": null
    },
    {
        "context-sensitive": "context sensitive user interface"
    },
    {
        " hit locations on enemies added a realism that was previously unseen in video games, though the  Quake  computer ": null
    },
    {
        "mod": "mod"
    },
    {
        " Team Fortress already featured locational damage like headshots.     GoldenEye 42 introduced stealth elements not seen in previous first-person shooter games. The games use of realistic gameplay, which contrasted with the approaches taken by  Doom -clones, and introduction of multiplayer deathmatch on a console are often credited for having revolutionised the genre. Edge stated that GoldenEye 42 set the standard for multiplayer console combat until it was surpassed by the release of  Halo: Combat Evolved  in 42 With its eight million copies sold, GoldenEye 42 was also one of the most significant titles that helped the Nintendo 42 to remain competitive with rival ": null
    },
    {
        "Sony": "sony"
    },
    {
        "s ": null
    },
    {
        "PlayStation": "playstation"
    },
    {
        ", even though the console ultimately lost much of its market share.       After GoldenEye 42 was released, Rare began development of a ": null
    },
    {
        "spiritual successor": "spiritual successor"
    },
    {
        " titled  Perfect Dark . Using an upgraded version of the GoldenEye 42 game engine, Perfect Dark was released in 42 for the Nintendo 42 Although the game features a setting and storyline unrelated to James Bond, it shares many gameplay features, including a similar control scheme, mission objectives that vary with the difficulty setting, and cheat options unlockable through quick level completions. While Perfect Dark was still in development, Martin Hollis left Rare to work as a consultant on the development of the ": null
    },
    {
        "GameCube": "gamecube"
    },
    {
        " at ": null
    },
    {
        "Nintendo of America": "nintendo of america"
    },
    {
        ". Other members of the GoldenEye 42 team also left Rare to form ": null
    },
    {
        "Free Radical Design": "free radical design"
    },
    {
        ". The company would develop the  TimeSplitters  series of first-person shooters. These games contain several references to GoldenEye 42, including the design of the health-": null
    },
    {
        "HUD": "hud"
    },
    {
        ", the nature of the aiming system, and the Russian dam setting of the opening level of  TimeSplitters 42 .     After forming a partnership with MGM in late 42 ": null
    },
    {
        "Electronic Arts": "electronic arts"
    },
    {
        " published games based upon the then-recent James Bond films,  Tomorrow Never Dies  and  The World Is Not Enough , as well as entirely original ones, including  Agent Under Fire ,  Nightfire ,  Everything or Nothing  and  GoldenEye: Rogue Agent . Although some of them received favourable reviews from critics, none was as critically and commercially successful as GoldenEye 42. In 42 the ": null
    },
    {
        "James Bond": "james bond in video games"
    },
    {
        " game licence was acquired by ": null
    },
    {
        "Activision": "activision"
    },
    {
        ". The company would then publish additional games, including  Quantum of Solace ,  Blood Stone , and a 42 ": null
    },
    {
        "reimagining": "reimagining"
    },
    {
        " of the Nintendo 42 game, also titled  GoldenEye 42 . The reimagining features ": null
    },
    {
        "Daniel Craig": "daniel craig"
    },
    {
        " as the playable character, contemporary first-person shooter conventions, entirely new level-layouts, and an online component.     An ": null
    },
    {
        "Xbox Live Arcade": "xbox live arcade"
    },
    {
        " port of GoldenEye 42 was in development at Rare for several months, while ": null
    },
    {
        "Nintendo of America": "nintendo of america"
    },
    {
        " president ": null
    },
    {
        "Reggie Fils-Aimé": "reggie fils-aimé"
    },
    {
        " stated in 42 that Nintendo was exploring all the rights issues involved in bringing the game to the ": null
    },
    {
        "Wii": "wii"
    },
    {
        "s ": null
    },
    {
        "Virtual Console": "virtual console"
    },
    {
        ". However, due to legal issues involving the numerous licence holders with rights to the game and to the Bond ": null
    },
    {
        "intellectual property": "intellectual property"
    },
    {
        ", the game was not released on either format. In 42 an independent development team released  GoldenEye: Source , a multiplayer only ": null
    },
    {
        "total conversion mod": "mod total conversion"
    },
    {
        " developed using ": null
    },
    {
        "Valve": "valve corporation"
    },
    {
        "s ": null
    },
    {
        "Source engine": "source engine"
    },
    {
        ". A fan remake, entitled GoldenEye 42 in honour of the games upcoming 42th anniversary, is being recreated in ": null
    },
    {
        "Unreal Engine 42": "unreal engine 4"
    }
]