[
    {
        "     The golden age of American animation was a period in the history of U.S. animation that began with the advent of sound cartoons in 42 and gradually ended throughout the 42s, where theatrical animated shorts began losing popularity to the newer medium of television animation, produced on cheaper budgets and in a more limited animation style by companies such as ": null
    },
    {
        "Hanna-Barbera": "hanna-barbera"
    },
    {
        " and ": null
    },
    {
        "DePatie-Freleng": "depatie-freleng"
    },
    {
        ".     Many popular characters emerged from this period, including ": null
    },
    {
        "Mickey Mouse": "mickey mouse"
    },
    {
        ", ": null
    },
    {
        "Minnie Mouse": "minnie mouse"
    },
    {
        ", ": null
    },
    {
        "Donald Duck": "donald duck"
    },
    {
        ", ": null
    },
    {
        "Daisy Duck": "daisy duck"
    },
    {
        ", ": null
    },
    {
        "Goofy": "goofy"
    },
    {
        ", ": null
    },
    {
        "Pluto": "pluto"
    },
    {
        " of  Walt Disney Productions , ": null
    },
    {
        "Bugs Bunny": "bugs bunny"
    },
    {
        ", ": null
    },
    {
        "Daffy Duck": "daffy duck"
    },
    {
        ", ": null
    },
    {
        "Porky Pig": "porky pig"
    },
    {
        ", ": null
    },
    {
        "Tweety": "tweety"
    },
    {
        ", ": null
    },
    {
        "Sylvester the Cat": "sylvester the cat"
    },
    {
        ", ": null
    },
    {
        "Elmer Fudd": "elmer fudd"
    },
    {
        " of  Warner Bros. Cartoons , ": null
    },
    {
        "Tom and Jerry": "tom and jerry"
    },
    {
        ", ": null
    },
    {
        "Droopy": "droopy"
    },
    {
        ", ": null
    },
    {
        "Barney Bear": "barney bear"
    },
    {
        " of  MGM cartoon studio , ": null
    },
    {
        "Popeye": "popeye"
    },
    {
        " , ": null
    },
    {
        "Superman": "superman"
    },
    {
        " , ": null
    },
    {
        "Little Lulu": "little lulu"
    },
    {
        " , ": null
    },
    {
        "Casper": "casper the friendly ghost"
    },
    {
        ", ": null
    },
    {
        "Betty Boop": "betty boop"
    },
    {
        " of  Paramount Cartoon Studios / Fleischer Studios , ": null
    },
    {
        "Pink Panther": "pink panther"
    },
    {
        " of  United Artists , ": null
    },
    {
        "Woody Woodpecker": "woody woodpecker"
    },
    {
        " of  Universal Studio Cartoons / Walter Lantz Productions , ": null
    },
    {
        "Mighty Mouse": "mighty mouse"
    },
    {
        " of  42th Century Fox / Terrytoons , ": null
    },
    {
        "Mr. Magoo": "mr. magoo"
    },
    {
        " of  UPA , ": null
    },
    {
        "the Fox and the Crow": "the fox and the crow"
    },
    {
        " of  Screen Gems , ": null
    },
    {
        "Yogi Bear": "yogi bear"
    },
    {
        ", ": null
    },
    {
        "Huckleberry Hound": "huckleberry hound"
    },
    {
        " and ": null
    },
    {
        "Fred Flintstone": "fred flintstone"
    },
    {
        " of  Hanna-Barbera Productions , and more.     Feature length animation also had begun during this period, most notably with ": null
    },
    {
        "Walt Disney": "walt disney"
    },
    {
        "s first films:  Snow White and the Seven Dwarfs  in 42  Pinocchio  and  Fantasia  both in 42  Dumbo  in 42 and  Bambi  in 42 Animation also began on television with the first animated series from ": null
    },
    {
        "42": "list of animated television series of the 1940s and 1950s"
    },
    {
        " to the early 42s.     ": null
    },
    {
        "Walt Disney Productions": "walt disney productions"
    },
    {
        "Walt Disney": "walt disney"
    },
    {
        " had decided to become a newspaper cartoonist drawing political caricatures and comic strips. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, pp. 42–42 Alfred A. Knopf, New York City However nobody would hire Disney, so his older brother ": null
    },
    {
        "Roy": "roy o. disney"
    },
    {
        ", who was working as a banker at the time, got him a job at the Pesmen-Rubin Art Studio where he created advertisements for newspapers, magazines, and movie theaters. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, pp. 42–42 Alfred A. Knopf, New York City Here he met fellow cartoonist ": null
    },
    {
        "Ub Iwerks": "ub iwerks"
    },
    {
        ", the two quickly became friends and in January 42 when their time at the studio expired they decided to open up their own advertising agency together called Iwerks-Disney Commercial Artists. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City The business however got off to a rough start and Walt temporarily left for the Kansas City Film and Ad Co. to raise money for the fleeting company and Iwerks soon followed as he was unable to run the business alone. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City     While working here he made commercials for local theaters using crude ": null
    },
    {
        "cut-out animation": "cut-out animation"
    },
    {
        ". Disney became fascinated by the art and decided to become an animator. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City He then borrowed a camera from work and rented a book from the local library called Animated Cartoons: How They Are Made, Their Origin and Development by Edwin G. Lutz and decided that ": null
    },
    {
        "cel animation": "cel animation"
    },
    {
        " would produce better quality and decided to open up his own animation studio. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City Disney then teamed up with ": null
    },
    {
        "Fred Harman": "fred harman"
    },
    {
        " and made their first film, The Little Artist which was nothing more than an artist taking a cigarette break at his work desk. Harman soon dropped out of the venture, but Disney was able to strike a deal with local theater owner Frank L. Newman and animated a cartoon all by himself entitled Newman Laugh-O-Grams screened in roughly February 42 Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, pp. 42–42 Oxford University Press, UK Walt then quit his job at the film and ad company and incorporated  Laugh-O-Gram Films  in May 42 and hired former advertising colleagues as unpaid students of animation including Ub Iwerks and Fred Harmans brother, ": null
    },
    {
        "Hugh Harman": "hugh harman"
    },
    {
        ". Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, p. 42 Oxford University Press, UK     Throughout 42 the Disney company produced a series of modernized adaptations of fairy tales including  Little Red Riding Hood ,  The Four Musicians of Bremen ,  Jack and the Beanstalk ,  Jack the Giant Killer ,  Goldielocks and the Three Bears ,  Puss in Boots ,  Cinderella  and  Tommy Tuckers Tooth , the latter being mostly a live-action film about dental hygiene. None of these films turned a profit. Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, pp. 4242 Oxford University Press, UK The last film made by the Disney company was a short called  Alices Wonderland . Loosely inspired by ": null
    },
    {
        "Lewis Carroll": "lewis carroll"
    },
    {
        "s  Alices Adventures in Wonderland ; the short featured a live-action five-year-old girl named Alice  who had adventures in a fully animated world. The film was never fully complete however as the studio went bankrupt in the summer of 42 Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, pp. 42–42 Alfred A. Knopf, New York City     Upon the closure of Laugh-O-Grams, Walt Disney worked as a freelance filmmaker before selling his camera for a one-way ticket to Los Angeles. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City Once arriving he moved in with his Uncle Robert and his brother Roy, who was recovering at a nearby government hospital from ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " he had suffered during the war. Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, p. 42 Oxford University Press, UK After failing to get a job as a director of live-action films he sent the unfinished Alices Wonderland reel to short-subjects distributor ": null
    },
    {
        "Margaret J. Winkler": "margaret j. winkler"
    },
    {
        " of Winkler Pictures in New York. Winkler was distributing both the ": null
    },
    {
        "Felix the Cat": "felix the cat"
    },
    {
        " and ": null
    },
    {
        "Out of the Inkwell": "out of the inkwell"
    },
    {
        " cartoons at the time, but the Fleischer brothers were about to leave to set up their own distribution company, Red Seal Films, and Felix producer ": null
    },
    {
        "Pat Sullivan": "pat sullivan"
    },
    {
        " was constantly fighting with Winkler; therefore Winkler agreed to distribute Disneys  Alice Comedies  as sort of an insurance policy.     Once Walt Disney received the notice on October 42 he convinced Roy to leave the hospital and help him set-up his business. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City The next day, on October 42 42 Disney Bros. Cartoon Studio opened its doors at a small rented office two blocks away from his uncles house with Roy managing business and Walt handling creative affairs. Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, p. 42 Oxford University Press, UK He convinced Virginia Daviss parents which caused the first official Alice short,  Alices Day at Sea , to be released on January 42 42; delayed by eleven days. Ub Iwerks was re-hired in February 42 and the quality of animation on the Alice series improved; this prompted Hugh Harman, ": null
    },
    {
        "Rudolf Ising": "rudolf ising"
    },
    {
        " and ": null
    },
    {
        "Carman Maxwell": "carman maxwell"
    },
    {
        " to follow Disney west in June 42 Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, pp. 42–42 Oxford University Press, UK Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, pp. 42–42 Alfred A. Knopf, New York City Around that time, Davis was replaced with ": null
    },
    {
        "Maggie Gay": "maggie gay"
    },
    {
        " and the cartoons started to focus less on the live-action scenes and more the fully animated scenes, particularly those featuring Alices pet sidekick ": null
    },
    {
        "Julius": "julius the cat"
    },
    {
        ", who bore an uncanny resemblance to Felix the Cat. Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, p. 42 Oxford University Press, UK In February 42 Disney built a larger studio at 42 Hyperion Avenue and changed the name of the company to Walt Disney Cartoons. Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, p. 42 Oxford University Press, UK Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City     In November 42 Winkler married ": null
    },
    {
        "Charles Mintz": "charles mintz"
    },
    {
        " and handed over the business to him when she fell pregnant a few months later. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, pp. 42–42 Alfred A. Knopf, New York City,@ Barrier, Michael, 42 Hollywood Cartoons: American Animation in its Golden Age, p. 42 Oxford University Press, UKn Mintz was often described as a cold, stern and ruthless chain-smoking tyrant; one employee remembered him as a grim-faced man, with a pair of cold eyes glittering behind the pince nez and never talked to the staff. He looked us over like an admiral surveying a row of stanchions. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, pp. 42–42 Alfred A. Knopf, New York City While Winkler had offered gentle critiques and encouragement, Mintz communicated to Disney in a harsh and cruel tone. Gabler, Neal, 42 Walt Disney: The Triumph of American Imagination, p. 42 Alfred A. Knopf, New York City In 42 Mintz ordered Disney to stop producing Alice Comedies due to the costs of combining live-action and animation.     Mintz managed to gain a distribution deal with ": null
    },
    {
        "Universal Studios": "universal studios"
    },
    {
        "; however it was Mintz—not Disney—that signed the deal. Disney and lead animator Ub Iwerks created ": null
    },
    {
        "Oswald the Lucky Rabbit": "oswald the lucky rabbit"
    },
    {
        ", who debuted in ": null
    },
    {
        "Trolley Troubles": "trolley troubles"
    },
    {
        " in 42 The Oswald series was a success and became the first hit for the Walt Disney studio.     In the spring of 42 Disney travelled to New York to ask Mintz for a budget increase. His request was harshly denied by Mintz, who pointed out that in the contract Mintz had signed with Universal, it was Universal—not Disney—that owned the rights to the character. Mintz revealed to Disney that he had hired most of his staff away from the studio  and threatened that unless he took a 42 per cent budget decrease, he would drop Disney and continue the Oswald series by himself. Walt refused, and Winkler Pictures dropped its distribution.       While Disney was finishing the remaining cartoons for Mintz, Disney and his staff secretly came up with a new cartoon character to replace Oswald—": null
    },
    {
        "Mickey Mouse": "mickey mouse"
    },
    {
        ".     The inspiration for Mickey has never been clear. Walt Disney said that he came up with the idea on the train ride back to Los Angeles shortly after the confrontation with Mintz, but other records say that he came up with the idea after he returned to the studio. Walt Disney once said that he was inspired by a pet mouse he once had at the old Laugh-O-Grams studio, but more commonly said that he chose a mouse because a mouse had never been the central character of a cartoon series before. Some ": null
    },
    {
        "animation historian": "animation historian"
    },
    {
        "s claim that Ub Iwerks created Mickey and he should be the one to receive credit for the creation of Mickey Mouse.     In 42  Plane Crazy  became the first entry into the Mickey Mouse series; however, it was not released because of a poor reaction from test screenings and failed to gain a distributor. The second Mickey Mouse cartoon  The Gallopin Gaucho  also failed to gain attention of the audience and a distributor. Disney knew what was missing: sound. ": null
    },
    {
        "Sound film": "sound film"
    },
    {
        " had been captivating audiences since 42 with  The Jazz Singer  and Walt decided that the next cartoon  Steamboat Willie  would have sound. Steamboat Willie was not the first sound cartoon, ": null
    },
    {
        "Max": "max fleischer"
    },
    {
        " and ": null
    },
    {
        "Dave Fleischer": "dave fleischer"
    },
    {
        " had produced  Song Car-Tunes  since 42 However, they failed to keep the sound synchronized with the animation and the main focus of the cartoons were the ": null
    },
    {
        "bouncing ball": "bouncing ball"
    },
    {
        " sing-a-long": "sing-a-long"
    },
    {
        "s. The Song Car-Tunes were not a success and some staff members doubted whether a cartoon with sound would be successful. So Disney arranged a special preview screening with the music and sound effects being played live behind stage through a microphone. The Steamboat Willie test screening was a success and managed to gain a distributor, Celebrity Pictures chief ": null
    },
    {
        "Pat Powers": "pat powers"
    },
    {
        ". However, the first attempt to synchronize the sound with the animation was a disaster with the timing being all wrong. In order to finance the second recording, Walt sold his car. This time he used a click track to keep his musicians on the beat . Little more than a month before Steamboat Willies premiere, Paul Terry released his sound cartoon ": null
    },
    {
        "Dinner Time": "dinner time"
    },
    {
        "; however it was not a financial success and Walt Disney described it as a bunch of racket .       Steamboat Willie was released on November 42 42 and was a big success. Disney quickly gained huge dominance in the animation field using sound in his future cartoons by dubbing Plane Crazy, The Gallopin Gaucho and the nearly completed ": null
    },
    {
        "The Barn Dance": "the barn dance"
    },
    {
        ". Mickey Mouses popularity put the animated character into the ranks of the most popular screen personalities in the world. Disneys biggest competitor, Pat Sullivan with his Felix the Cat , was eclipsed by Mickeys popularity and the studio closed in 42   Merchandising based on Disney cartoons rescued a number of companies from bankruptcy during the depths of the Depression, and Disney took advantage of this popularity to move forward with further innovations in animation.     In 42 he launched a new series entitled the ": null
    },
    {
        "Silly Symphonies": "silly symphonies"
    },
    {
        " which was based around music with no recurring characters. However, they did not become as popular as the Mickey Mouse cartoon series.     In 42 after a falling-out with Powers, Disney switched distributors to Columbia Pictures . However, Ub Iwerks left Walt Disney after an offer from Powers to be in charge of his own studio.     In 42 Mickey Mouse had become an international sensation, but the Silly Symphonies hadnt . Columbia Pictures had backed out of its distribution of the series and Disney was lured to move the Silly Symphonies into United Artists by a budget increase.     Walt Disney then worked with the Technicolor company to create the first full three-strip color cartoon, ": null
    },
    {
        "Flowers and Trees": "flowers and trees"
    },
    {
        ". Another great success, it became the first cartoon to win the Academy Award for the Best Animated Short Film. Shortly afterward, Disney negotiated an exclusive, but temporary deal with Technicolor so only he could use the three-strip process in animated films—no other studio was permitted to use it. However, he withheld making Mickey Mouse in color because he thought that Technicolor might boost the Silly Symphonies popularity.     By 42 Walt Disney had realized the success of animated films depended upon telling emotionally gripping stories that would grab the audience and not let go. This realization led to an important innovation around 42 and 42: a story department, separate from the animators, with storyboard artist s who would be dedicated to working on a story development phase of the production pipeline.   In turn, Disneys continued emphasis on story development and characterization resulted in another hit in 42: ": null
    },
    {
        "Three Little Pigs": "three little pigs"
    },
    {
        ", which is seen as the first cartoon in which multiple characters displayed unique, individual personalities and is still considered to be the most successful animated short of all time, and also featured the hit song that became the anthem in fighting the Great Depression : Whos Afraid of the Big Bad Wolf .     In the Mickey Mouse series, he continued to add personality to his characters; this resulted in the creation of new characters such as Pluto with The Chain Gang in 42 Goofy with Mickeys Revue in 42 and Donald Duck in 42 with The Wise Little Hen . When Disneys contract with Technicolor expired, the Mickey Mouse series was moved into Technicolor starting with The Band Concert in 42 In addition, Mickey was partially redesigned for Technicolor later that year.     In 42 Disney invented the multiplane camera , which gave an illusion of depth to the animated world. He first used this on the Academy Award-winning Silly Symphony cartoon ": null
    },
    {
        "The Old Mill": "the old mill"
    },
    {
        ". Much of Disneys work was heavily influenced by European stories and myths, and the work of illustrators such as Doré and Busch .     Also in 42 Disney changed distributors to the Silly Symphonies into RKO Radio Pictures and remained under the distribution until the early 42s, when they are re-issued and re-released by Disneys new distribution company, Buena Vista Distribution .       In 42 Walt Disney produced ": null
    },
    {
        "Snow White and the Seven Dwarfs": "snow white and the seven dwarfs"
    },
    {
        ", the first American feature-length animated musical fantasy film. This was the culmination of four years of effort by Disney studios. Walt Disney was convinced that short cartoons would not keep his studio profitable in the long run, so he took what was seen as an enormous gamble. The critics predicted that Snow White would result in financial ruin for the studio. They said that the colors would be too bright for the audience and they would get sick of the gags and leave. The One That Started it All – the making of Snow White and the Seven Dwarfs – Snow White and the Seven Dwarfs, 42 DVD However, the critics were proven wrong. Snow White was a worldwide box office success, and was universally acclaimed as a landmark in the development of animation as a serious art form.     After the success of Snow White, Disney went on to produce ": null
    },
    {
        "Pinocchio": "pinocchio"
    },
    {
        ", which was released in 42 It was considered a stunning achievement both technically and artistically, costing twice as much as Snow White. However Pinocchio was not a financial success, since World War II had cut off 42% of Disneys foreign release market and although it was a moderate success in the United States, the domestic gross alone was not enough to make back its revenue. However, the film did receive very positive reviews and has made millions from subsequent re-releases. Later that year, Disney produced ": null
    },
    {
        "Fantasia": "fantasia"
    },
    {
        ". It originally started with the Mickey Mouse cartoon The Sorcerers Apprentice in an attempt to recapture Mickeys popularity, which had sharply declined to Max Fleischers Popeye and Disneys Donald Duck. In the Sorcerers Apprentice, Mickey Mouse was redesigned by Fred Moore . This redesign of Mickey is still in use today. The short featured no dialogue, only music which was conducted by Leopold Stokowski . When the budget for the short grew very expensive, Stokowski suggested to Disney that it could be a feature film with other pieces of classical music matched to animation. Disney agreed and production started. Fantasia would also become the first commercial film to be released in stereophonic sound . However, like Pinocchio, Fantasia was not a financial success. Fantasia was also the first Disney film not to be received well, receiving mixed reviews from the critics. It was looked down upon by music critics and audiences, who felt that Walt Disney was striving for something beyond his reach by trying to introduce mainstream animation to abstract art, classical music, and elite subjects. However, the film would be reevaluated in later years and considered a significant achievement in the art of animation.     In 42 in order to compensate for the relative poor box office of Pinocchio and Fantasia, Disney produced a low-budget feature film, ": null
    },
    {
        "Dumbo": "dumbo"
    },
    {
        ". Just a few days after rough animation was complete on Dumbo, the Disney animators strike broke out. This was caused by the Screen Cartoonists Guild , who severed many ties between Walt Disney and his staff, while encouraging many members of the Disney studio to leave and seek greener pastures. Later that year, Dumbo became a big success, the first time since Snow White. The critically acclaimed film brought in much-needed revenue and kept the studio afloat. A few months after Dumbo was released in 42 the United States entered the war after Pearl Harbor was attacked. This caused the mobilization of all movie studios to produce propaganda material to bolster public confidence and encourage support for the war effort. The war shook Walt Disneys empire, as the US Army had seized Disneys studio as soon as the US entered World War II in December 42 Due to this, Disney put the feature films Alice in Wonderland , Peter Pan , Wind in the Willows , Song of the South , Mickey and the Beanstalk and Bongo on hold until the war was over. The only feature film that was allowed to continue production was ": null
    },
    {
        "Bambi": "bambi"
    },
    {
        ", which was released in 42 Bambi was ground-breaking in terms of animating animals realistically. However, due to the war Bambi failed at the box-office and received mixed reviews from the critics. This was to be short lived as it grossed a considerable amount of money in the 42 re-release.     Disney was now fully committed to the war and contributed by producing propaganda shorts and a feature film entitled ": null
    },
    {
        "Victory Through Air Power": "victory through air power"
    },
    {
        ". Victory Through Air Power did poor box office and the studio lost around $42 as a result. The required propaganda cartoon shorts were also not as popular as Disneys regular shorts, and by the time the Army ended its stay at the Walt Disney Studios when the war ended in 42 Disney struggled to restart his studio, and had a low amount of cash on hand.     Further Disney feature films of the 42s were modestly budgeted collections of animated short segments put together to make a feature film. These began with ": null
    },
    {
        "Saludos Amigos": "saludos amigos"
    },
    {
        " in 42 and continued during the war with ": null
    },
    {
        "The Three Caballeros": "the three caballeros"
    },
    {
        " in 42 and after the war with ": null
    },
    {
        "Make Mine Music": "make mine music"
    },
    {
        " in 42 ": null
    },
    {
        "Fun and Fancy Free": "fun and fancy free"
    },
    {
        " in 42 ": null
    },
    {
        "Melody Time": "melody time"
    },
    {
        " in 42 and ": null
    },
    {
        "The Adventures of Ichabod and Mr. Toad": "the adventures of ichabod and mr. toad"
    },
    {
        " in 42 For the feature films Mickey and the Beanstalk, Bongo and Wind in the Willows, he condensed them into the package films Fun and Fancy Free and The Adventures of Ichabod and Mr. Toad since Walt feared that the low-budget animation would not become profitable. Barrier, Michale Hollywood Cartoons: American Animation in its Golden Age, Oxford University Press, UK The most ambitious Disney film of this period was the 42 film ": null
    },
    {
        "Song of the South": "song of the south"
    },
    {
        ", a musical film blending live-action and animation which drew criticism in later years for accusations of racial stereotyping .     In 42 Disney produced ": null
    },
    {
        "Cinderella": "cinderella"
    },
    {
        ". Cinderella was an enormous success, becoming the highest-grossing film of 42 and became Disneys most successful film since Snow White and the Seven Dwarfs and Disneys first single narrative feature film since Bambi.     Disneys company started to diversify, producing live-action feature films beginning with ": null
    },
    {
        "Treasure Island": "treasure island"
    },
    {
        " and nature documentaries of which ": null
    },
    {
        "Seal Island": "seal island"
    },
    {
        " was the first. Due to this, Walt Disney was needed on several different units at one time and was spending less time on animation, although he was always present at story-meetings. In 42 he released ": null
    },
    {
        "Alice in Wonderland": "alice in wonderland"
    },
    {
        ", a project he had been working on since the late 42s and had shelved during the war. Alice in Wonderland was initially moderately successful and received mixed reviews from the critics . In 42 he released ": null
    },
    {
        "Peter Pan": "peter pan"
    },
    {
        ", which, like Alice in Wonderland, had been in production since the late 42s, early42s and was shelved during the war. However unlike Alice, Peter Pan was a big success both critically and financially on its first release.     When Disneys contract with RKO expired at the end of 42 instead of renewing it as usual Disney was concerned about the instability of RKO and started distributing its own films through its newly created Buena Vista Distribution subsidiary. This allowed a higher budget for shorts and features than the last few years of cartoons made for RKO dictated, which made it possible to make some of the cartoons in the new CinemaScope format. However, the budget per short was nowhere near as high as it had been in the 42s as Disney had been focusing more on live action, television, and feature animation and less on short animation. In 42 shortly after the switch from RKO to Buena Vista, Disney released its final Mickey Mouse short, ": null
    },
    {
        "The Simple Things": "the simple things"
    },
    {
        ". From there, the studio produced fewer animated shorts by the year until the animated shorts division was eventually closed in 42 After that, any future short cartoon work was done through the feature animation division until 42 The last Disney animated short of the golden age, Its Tough to Be a Bird!, was released in 42     In 42 he created ": null
    },
    {
        "Lady and the Tramp": "lady and the tramp"
    },
    {
        ", the first animated film in CinemaScope . Upon building Disneyland in 42 Walt Disney regained a huge amount of popularity among the public, and turned his focus at producing his most ambitious movie: ": null
    },
    {
        "Sleeping Beauty": "sleeping beauty"
    },
    {
        ". Sleeping Beauty was filmed in Super Technirama 42 mm film and in stereophonic sound like Fantasia. Sleeping Beauty also signaled a change in the style of drawing, with cartoony and angular characters; taking influence from United Productions of America . Although Sleeping Beauty was the second-highest-grossing film of 42 , the film went over budget, costing $42 million, and the film failed to make back its expenditure. The studio was in serious debt and had to cut the cost of animation. In 42 this resulted in Disney switching to xerography , that replaced the traditional hand-inking . The first feature film that used Xerox cels was ": null
    },
    {
        "42 Dalmatians": "one hundred and one dalmatians"
    },
    {
        " in 42 It was a huge success; however, the Xerox resulted in films with a sketchier look and lacked the quality of the hand-inked films. According to Floyd Norman , who was working at Disney at the time, it felt like the end of an era.     On December 42 42 Walt Disney died of lung cancer . The last two films he was involved in was ": null
    },
    {
        "The Jungle Book": "the jungle book"
    },
    {
        " and ": null
    },
    {
        "The Many Adventures of Winnie the Pooh": "the many adventures of winnie the pooh"
    },
    {
        ", since one of the shorts ": null
    },
    {
        "Winnie the Pooh and the Honey Tree": "winnie the pooh and the honey tree"
    },
    {
        " was released during his lifetime, and he was involved in the production of ": null
    },
    {
        "Winnie the Pooh and the Blustery Day": "winnie the pooh and the blustery day"
    },
    {
        ". The animated musical comedy feature, ": null
    },
    {
        "The Jungle Book": "the jungle book"
    },
    {
        ", and the live-action big-screen musical, ": null
    },
    {
        "The Happiest Millionaire": "the happiest millionaire"
    },
    {
        " were released a year in 42 after his death and Winnie the Pooh and the Blustery Day released two years later, while The Many Adventures of Winnie the Pooh was released in 42 Winnie the Pooh and the Blustery Day also won the 42 Academy Award for Animated Short Film. After Walt Disneys death, the animated films produced by the Disney company were only moderately successful. The animation department did not fully recover until the late 42s and early 42s with the Disney Renaissance .           One of Walt Disneys main competitors was Max Fleischer , the head of Fleischer Studios , which produced cartoons for Paramount Pictures . Fleischer Studios was a family-owned business, operated by Max Fleischer and his younger brother Dave Fleischer , who supervised the production of the cartoons. The Fleischers scored successful hits with the ": null
    },
    {
        "Betty Boop": "betty boop"
    },
    {
        " cartoons and the ": null
    },
    {
        "Popeye the Sailor": "popeye the sailor"
    },
    {
        " series. Popeyes popularity during the 42s rivaled Mickey Mouse at times, and Popeye fan clubs sprang up across the country in imitation of Mickeys fan clubs; in 42 polls showed that Popeye was even more popular than Mickey Mouse. However, during the early 42s, stricter censorship rules enforced by the new Production Code in 42 required animation producers to remove risqué humor. The Fleischers in particular had to tone down the content of their Betty Boop cartoons, which waned in popularity afterwards. The Fleischers also had produced a number of ": null
    },
    {
        "Color Classics": "color classics"
    },
    {
        " cartoons during the 42s which attempted to emulate Walt Disneys use of color, but the series was not a success.       In 42 Max Fleischer became interested in producing an animated feature film shortly after Walt Disneys announcement of Snow White, however Paramount vetoed the idea. In 42 Fleischer Studios produced the first of three two-reel Popeye Technicolor features: ": null
    },
    {
        "Popeye the Sailor Meets Sindbad the Sailor": "popeye the sailor meets sindbad the sailor"
    },
    {
        " in 42 ": null
    },
    {
        "Popeye the Sailor Meets Ali Babas Forty Thieves": "popeye the sailor meets ali babas forty thieves"
    },
    {
        " in 42 and ": null
    },
    {
        "Aladdin and His Wonderful Lamp": "aladdin and his wonderful lamp"
    },
    {
        " in 42     In 42 after Disneys success with Snow White and the Seven Dwarfs, Paramount had gave the Fleischers a permission to produce an animated feature film and Fleischer studio relocated itself from New York to Miami, Florida in order to avoid organized unions, which became a threat to the studio after a five-month strike occurred among Fleischer Studio workers in late 42 Here the Fleischers produced ": null
    },
    {
        "Gullivers Travels": "gullivers travels"
    },
    {
        " which was released in 42 It was a small success and encouraged the Fleischers to produce more.       In May 42 the Fleischers gave Paramount full ownership of the studio as collateral to pay off their debts left from the loans they obtained from the studio to make unsuccessful cartoons like Stone Age, Gabby, and Color Classics. However, they still maintained their positions as heads of their studios production. Under Paramount rule, the Fleischers brought Popeye into the Navy and contributed to the war effort, and would gain more success by beginning a series of spectacular Superman cartoons that have become legendary in themselves.     Despite the success Superman gave the studio, a major blow to the studio would occur when the married Dave started having an adulterous affair with the Miami secretary. This led to many disputes between the Fleischer Brothers until Max and Dave were no longer speaking to each other. In 42 they released ": null
    },
    {
        "Mister Bug Goes to Town": "mister bug goes to town"
    },
    {
        ", unfortunately it was released a few days before the attack on Pearl Harbor, which caused Mister Bug to fail at the box-office. Shortly after the films poor box office, Dave Fleischer, still maintaining his position as co-chief of his studio, had left Fleischer Studios to run Columbia Pictures Screen Gems cartoons. Due to this, Paramount Pictures had expelled Dave and Max Fleischer from their positions as the head of the cartoon studio.       In a move that remains controversial to the present day , Paramount took over the Fleischer studio completely and brought it under the fold of their own studio, renaming it Famous Studios and continuing the work that the Fleischers began. Isadore Sparber , Seymour Kneitel and Dan Gordon were promoted to directors , while Sam Buchwald was promoted to executive producer. Paramount also discontinued the expensive Superman cartoons in 42 in favor of adapting ": null
    },
    {
        "Little Lulu": "little lulu"
    },
    {
        " to theaters.     Famous Studios had continued to release Popeye shorts as well as creating ": null
    },
    {
        "Noveltoons": "noveltoons"
    },
    {
        ", an anthology short series similar to Fleischers ": null
    },
    {
        "Color Classics": "color classics"
    },
    {
        ". Noveltoons introduced many notable characters such as Casper the Friendly Ghost , Little Audrey , Herman and Katnip , Baby Huey and many other lesser known one-shot characters.     The departure of the Fleischers had an immediate effect on the studio: the Paramount cartoons of the war years continued to be entertaining and popular and still retained most of the Fleischer style and gloss, however it began losing the popularity and distinct style of animation that Fleischer Studios had after the 42s ended, with a common criticism being its repetitive story, and a more family-friendly tone for most of their shorts.       In 42 Sam Buchwald died from a heart attack, leaving Sparber and Kneitel as the lead producers and directors. Dave Tendlar was promoted to director in 42     By the mid42s, Famous Studios was still releasing shorts but with tighter budgets. This was a standard industry practice at the time, since other animation studios were also releasing short films with tighter budgets due to the popularity of television. This was evident to Famous at this point. At the same time, the studio had really drastic changes. Paramount renamed the studio to Paramount Cartoon Studios, as well as discontinuing the Popeye shorts by 42 ": null
    },
    {
        "Spooky Swabs": "spooky swabs"
    },
    {
        " was the last Popeye short in theaters. Budgets for the shorts were so tight in 42 that they mostly consisted of cheap or limited animation , despite having prominent animators working on them.     In the 42s, Paramount still released Noveltoon cartoons, as well as producing Popeye shorts for television. After Seymour Kneitel died in 42 from a heart attack, other animation veterans like Howard Post , James Culhane and Ralph Bakshi were hired to directed shorts late in the studios lifespan.     In 42 Paramounts new owners at the time Gulf+Western shut down the cartoon studio.         In 42 former Disney animators Hugh Harman and Rudolf Ising made a cartoon entitled ": null
    },
    {
        "Bosko, the Talk-Ink Kid": "bosko, the talk-ink kid"
    },
    {
        ", and tried to sell it to a distributor in 42 Warner Bros. who had previously tried an unsuccessful attempt to set up a cartoon studio in New York in order to compete with Disney, agreed to distribute the series. Under producer Leon Schlesinger s guide Harman and Ising created ": null
    },
    {
        "Looney Tunes": "looney tunes"
    },
    {
        "  starring their character Bosko . A second Harman-Ising series, ": null
    },
    {
        "Merrie Melodies": "merrie melodies"
    },
    {
        ", followed in 42 Both series showed the strong influence of the early Disney movies.         After disputes over the money, Harman-Ising parted company with Schlesinger in 42 taking Bosko with them to work with Metro Goldwyn Mayer . Schlesinger began his own cartoon operation under the new name Leon Schlesinger Productions , hiring Harman-Ising animator Friz Freleng and several others to run the studio. Animator Tom Palmer created a Bosko clone known as Buddy and answered to Walt Disneys use of color in the Silly Symphonies cartoons in 42 and began making all future Merrie Melodies cartoons in color. However, since Walt Disney had an exclusive deal with Technicolor, Schlesinger was forced to use Cinecolor and Two Strip Technicolor until 42 when Disneys contract with Technicolor had expired. In 42 Schlesinger fired Tom Palmer and Buddy was retired.       In a 42 Merrie Melodie directed by Friz Freleng entitled ": null
    },
    {
        "I Havent Got a Hat": "i havent got a hat"
    },
    {
        " was the first screen appearance of Porky Pig . Also in 42 Schlesinger hired a new animation director who proceeded to revitalize the studio: Tex Avery . Schlesinger put Avery in charge of the low-budget Looney Tunes in a low run-down old building the animators named Termite Terrace. Under Avery, Porky Pig would replace the Buddy series and become the first Warner Bros. cartoon character to achieve star power. Also at Termite Terrace animator Bob Clampett redesigned Porky from a fat, chubby pig to a more cute and childlike character.     Unlike the other cartoon producers at the time, Avery had no intention of competing with Walt Disney, but instead brought a new wacky, zany style of animation to the studio that would increase the Warner Bros. cartoons popularity in the crowded marketplace. This was firmly established in 42 when Tex Avery directed ": null
    },
    {
        "Porkys Duck Hunt": "porkys duck hunt"
    },
    {
        ". During production of the short lead animator Bob Clampett elaborated the exit of the Duck character by having him jump up and down on his head, flip around and holler off into the sunset. The Man from Wackyland: The art of Bob Clampett Looney Tunes Golden Collection: The Best of Tweety and Sylvester, 42 DVD This created the character of Daffy Duck . After Daffy was created, he would add even more success to Warner Bros. cartoons and replaced Porky Pig as the studios most popular animated character, and Bob Clampett took over Termite Terrace, while Tex Avery took over the Merrie Melodies department.     The 42 Academy Award-nominated cartoon ": null
    },
    {
        "A Wild Hare": "a wild hare"
    },
    {
        " marked Bugs Bunny s official debut. Bugs quickly replaced Daffy as the studios top star. By 42 Bugs had become the most popular cartoon character. Because of the success of Bugs, Daffy and Porky, the Schlesinger studio now had risen to new heights, and Bugs quickly became the star of the color Merrie Melodies cartoons, which had previously been used for one-shot character appearances. By 42 Warners shorts had now surpassed Disneys in sales and popularity.     Frank Tashlin also worked with Avery in the Merrie Melodies department. He began at Warners in 42 as an animator but was fired and joined Iwerks in 42 Tashlin returned to Warners in 42 taking over direction of Merrie Melodies department. He returned in 42 directing Porky and Daffy cartoons. He left in late 42 to direct live-action films. Martha Sigall described him as, Here today, gone tomorrow. Now you see him, now you dont. That was Frank Tashlin, who would be working at Leon Schlesingers one day, and, suddenly, gone the next day.         After several disputes with Schlesinger , Avery left Warner Bros. in 42 and went to work at MGM. Avery created Droopy in 42 and many other characters during his 42-year career at MGM.     Schlesinger sold his studio to Warner Bros. in August 42 Edward Selzer was in turn named the new producer. By this time, Warner cartoons top directors of the 42s were Friz Freleng , Chuck Jones , Bob Clampett and recently Robert McKimson , who took over Frank Tashlin ’s unit after he left the studio. Their cartoons are now considered classics of the medium. They directed some of the most beloved animated shorts of all time, including ": null
    },
    {
        "Porky in Wackyland": "porky in wackyland"
    },
    {
        ", ": null
    },
    {
        "Wabbit Twouble": "wabbit twouble"
    },
    {
        ", ": null
    },
    {
        "A Corny Concerto": "a corny concerto"
    },
    {
        ", ": null
    },
    {
        "The Great Piggy Bank Robbery": "the great piggy bank robbery"
    },
    {
        ", ": null
    },
    {
        "The Big Snooze": "the big snooze"
    },
    {
        ", ": null
    },
    {
        "You Ought to Be in Pictures": "you ought to be in pictures"
    },
    {
        ", ": null
    },
    {
        "Rhapsody in Rivets": "rhapsody in rivets"
    },
    {
        ", ": null
    },
    {
        "Little Red Riding Rabbit": "little red riding rabbit"
    },
    {
        ", ": null
    },
    {
        "Birds Anonymous": "birds anonymous"
    },
    {
        ", ": null
    },
    {
        "Knighty Knight Bugs": "knighty knight bugs"
    },
    {
        ", ": null
    },
    {
        "Rabbit Fire": "rabbit fire"
    },
    {
        ", ": null
    },
    {
        "Duck Amuck": "duck amuck"
    },
    {
        ", ": null
    },
    {
        "Duck Dodgers in the 42½th Century": "duck dodgers in the 24½th century"
    },
    {
        ", ": null
    },
    {
        "One Froggy Evening": "one froggy evening"
    },
    {
        ", ": null
    },
    {
        "Whats Opera, Doc?": "whats opera, doc?"
    },
    {
        ", ": null
    },
    {
        "Walky Talky Hawky": "walky talky hawky"
    },
    {
        ", ": null
    },
    {
        "Hillbilly Hare": "hillbilly hare"
    },
    {
        ", ": null
    },
    {
        "Devil May Hare": "devil may hare"
    },
    {
        ", ": null
    },
    {
        "The Hole Idea": "the hole idea"
    },
    {
        " and ": null
    },
    {
        "Stupor Duck": "stupor duck"
    },
    {
        ".     Besides McKimson being promoted to director in the mid 42s, Arthur Davis took over after Clampett in late 42 after being was fired by Selzer. Clampett went to work on Beany and Cecil .     McKimson created many recurring characters like Foghorn Leghorn , the Barnyard Dawg , Hippety Hopper , Speedy Gonzales , Taz and Sylvester Jr. , while Davis created many one-shot characters to establish his unit, as well as directing 42 shorts featuring the Goofy Gophers . Davis’ unit was shut down in 42 by Warners due to budget issues, causing him to move to Frelengs unit to become one of his key animators.         In 42 Warners could no longer force theaters to buy their movies and shorts together as packages, due to the United States v. Paramount Pictures, Inc. anti-trust case that year. It resulted to shorts of the early 42s to have tighter budgets. Edward Selzer in 42 retired, leading to production manager John Burton to take his place. David DePatie assumes producer in 42 after Burton left the studio.     After more than two decades at the top, Warner Bros. shut down the original Termite Terrace studio in 42 and DePatie-Freleng Enterprises assumed production of the shorts, licensed by Warner Bros. After DePatie-Freleng ceased production of Looney Tunes in 42 Bill Hendricks was put in charge of production of the newly renamed Warner Bros.-Seven Arts animation studio, and hired veterans such as Alex Lovy and LaVerne Harding from the Walter Lantz studio, Volus Jones and Ed Solomon from Disney, Jaime Diaz who later worked on ": null
    },
    {
        "The Fairly OddParents": "the fairly oddparents"
    },
    {
        " as director, and David Hanan, who previously worked on ": null
    },
    {
        "Roger Ramjet": "roger ramjet"
    },
    {
        ". Hendricks brought only three of the original Looney Tunes veterans to the studio; Ted Bonniscken, Norman McCabe and Bob Givens. The studios one shot cartoons from this era were critically panned and are widely considered to be the worst in the studios history: ": null
    },
    {
        "Cool Ca": "cool ca"
    },
    {
        "t, ": null
    },
    {
        "Merlin the Magic Mouse": "merlin the magic mouse"
    },
    {
        ", ": null
    },
    {
        "Chimp and Zee": "chimp and zee"
    },
    {
        " and ": null
    },
    {
        "Norman Normal": "norman normal"
    },
    {
        ", despite the later gaining a large cult following , were said to be witless, crudely animated as well as having poor writing and design because of the extremely low budgets the crew had to work with by this time. Alex Lovy left the studio in 42 and Robert McKimson took over. McKimson mostly focused on the recurring characters Alex Lovy had created and two of his own creation, Bunny and Claude. The last of the original Looney Tunes shorts produced was Bugged by a Bee and the last Merrie Melodies short was Injun Trouble, which shares its name with another Looney Tunes short from 42 The Warner Bros.-Seven Arts studio finally shut down in 42 A total of 42 Looney Tunes shorts had been created.     A decade later, after the success of the film, ": null
    },
    {
        "The Bugs Bunny/Road Runner Movie": "the bugs bunny/road runner movie"
    },
    {
        ", which consisted predominantly of footage from the classic shorts by Jones, a new in-house studio to produce original animation opened its doors in 42 named Warner Bros. Animation , which exists to this day.           At first, Mickey Mouse was drawn by Walt Disneys long-time partner and friend Ub Iwerks , who was also a technical innovator in cartoons, and drew an average of 42 drawings for Disney on a daily basis; Disney was responsible for the ideas in the cartoons, and Iwerks was responsible for bringing them to life. However, Iwerks left the Disney studio in 42 to form his own company, which was financially backed by Celebrity Pictures owner Pat Powers. After his departure, Disney eventually found a number of different animators to replace Iwerks. Iwerks would produce three cartoon series during the 42s: ": null
    },
    {
        "Flip the Frog": "flip the frog"
    },
    {
        " and ": null
    },
    {
        "Willie Whopper": "willie whopper"
    },
    {
        " for Metro-Goldwyn-Mayer , and the ": null
    },
    {
        "ComiColor Cartoons": "comicolor cartoons"
    },
    {
        " for Pat Powers Celebrity Productions . However, none of these cartoons could come close to matching the success of Disney or Fleischer cartoons, and in 42 MGM, Iwerks cartoon distributor since 42 ended distribution of his cartoons in favor of distributing Harman and Ising cartoons, and Iwerks left after his contract expired in 42 After his stay with MGM, Iwerks cartoons were distributed by Celebrity Pictures, and Iwerks would answer to Disneys use of Technicolor and create the Comicolor series, which aired cartoons in two-strip Cinecolor. However, by 42 the Iwerks Studio began to experience financial setbacks and closed after Pat Powers withdrew financial aid to the studio. After animating at Warner Brothers creating Gabby Goat and going to Screen Gems which was making cartoons for Columbia Pictures at the time, Iwerks returned to Disney in 42 where he worked as the head of the special effects development division until his death in 42       After MGM dropped Iwerks, they hired Harman and Ising away from Leon Schlesinger and Warner Bros and appointed them heads of the studio. They began producing Bosko and ": null
    },
    {
        "Happy Harmonies": "happy harmonies"
    },
    {
        " cartoons which were emulative of Disneys ": null
    },
    {
        "Silly Symphonies": "silly symphonies"
    },
    {
        ". However they failed to make a success in the theaters, and in 42 the Bosko and Happy Harmonies series were discontinued and MGM replaced Harman and Ising with Fred Quimby . After Quimby took over, he kept a number of Harman and Isings staff and scouted other animation studios for talent . He created an animated adaptation of the comic book series ": null
    },
    {
        "The Katzenjammer Kids": "the katzenjammer kids"
    },
    {
        " which he re-titled ": null
    },
    {
        "The Captain & The Kids": "the captain  &  the kids"
    },
    {
        ". The Captain & The Kids series was unsuccessful. In 42 however, Quimby gained success after rehiring Harman & Ising.     After returning to MGM, Ising created MGMs first successful animated star named ": null
    },
    {
        "Barney Bear": "barney bear"
    },
    {
        ", which he would became his own series cartoon from 42 to 42 Harman directed his masterpiece ": null
    },
    {
        "Peace on Earth": "peace on earth"
    },
    {
        " in the meantime.       In 42 William Hanna and Joseph Barbera started a partnership that would last for more than six decades, until Hannas death in 42 The duos first cartoon together was ": null
    },
    {
        "Puss Gets the Boot": "puss gets the boot"
    },
    {
        " , featuring an unnamed mouses attempts to outwit a housecat named Jasper. Though released without fanfare, the short was financially and critically successful, earning an Academy Award nomination for Best Short Subject of 42 On the strength of the Oscar nomination and public demand, Hanna and Barbera set themselves to producing a long-running series of cat-and-mouse cartoons, soon christening the characters ": null
    },
    {
        "Tom and Jerry": "tom and jerry"
    },
    {
        ". Puss Gets the Boot did not win the 42 Academy Award for Best Cartoon, but another MGM cartoon, Rudolf Isings ": null
    },
    {
        "The Milky Way": "the milky way"
    },
    {
        " did, making ": null
    },
    {
        "MGM cartoon studio": "mgm cartoon studio"
    },
    {
        " the first studio to wrestle the Cartoon Academy Award away from Walt Disney.     After appearing in ": null
    },
    {
        "Puss Gets the Boot": "puss gets the boot"
    },
    {
        ", Tom and Jerry quickly became the stars of MGM cartoons. With Hanna-Barbera under their belts, ": null
    },
    {
        "MGM cartoon studio": "mgm cartoon studio"
    },
    {
        " was finally able to compete with Disney in the field of animated cartoons. The shorts were successful at the box office, many licensed products were released to the market, and the series would earn twelve more Academy Award for Short Subjects nominations, with seven of the Tom and Jerry shorts going on to win the Academy Award: ": null
    },
    {
        "The Yankee Doodle Mouse": "the yankee doodle mouse"
    },
    {
        " , ": null
    },
    {
        "Mouse Trouble": "mouse trouble"
    },
    {
        " , ": null
    },
    {
        "Quiet Please!": "quiet please!"
    },
    {
        " , ": null
    },
    {
        "The Cat Concerto": "the cat concerto"
    },
    {
        " , ": null
    },
    {
        "The Little Orphan": "the little orphan"
    },
    {
        " , ": null
    },
    {
        "The Two Mouseketeers": "the two mouseketeers"
    },
    {
        " , and ": null
    },
    {
        "Johann Mouse": "johann mouse"
    },
    {
        " . Tom and Jerry was eventually tied with ": null
    },
    {
        "Disneys Silly Symphonies": "silly symphonies"
    },
    {
        " as the most-awarded theatrical cartoon series. No other character-based theatrical animated series has won more awards, nor has any other series featuring the same characters.     In addition to classical Tom and Jerry shorts , Hanna and Barbera also produced/directed for ": null
    },
    {
        "MGM cartoon studio": "mgm cartoon studio"
    },
    {
        " half a dozen ": null
    },
    {
        "one-shot theatrical shorts": "list of one-shot metro-goldwyn-mayer animated shorts"
    },
    {
        " besides it, including ": null
    },
    {
        "Gallopin Gals": "gallopin gals"
    },
    {
        " , ": null
    },
    {
        "Officer Pooch": "officer pooch"
    },
    {
        " , ": null
    },
    {
        "War Dogs": "war dogs"
    },
    {
        " and ": null
    },
    {
        "Good Will to Men": "peace on earth"
    },
    {
        " . Fred Quimby retired in 42 with Hanna and Barbera replacing him in charge of the remaining MGM cartoons  until 42 when the studio shut down, ending all the animation productions, the duo started the ": null
    },
    {
        "Hanna-Barbera": "hanna-barbera"
    },
    {
        " animated television series company afterwards.     Key to the successes of Tom and Jerry and other MGM cartoons was the work of Scott Bradley , who scored virtually all of the cartoons for the studio from 42 to 42 Bradleys scores made use of both classical and jazz sensibilities. In addition, he often used songs from the scores of MGMs feature films, the most frequent of them being The Trolley Song from ": null
    },
    {
        "Meet Me in St. Louis": "meet me in st. louis"
    },
    {
        " and Sing Before Breakfast from ": null
    },
    {
        "Broadway Melody of 42": "broadway melody"
    },
    {
        ".       Meanwhile, Tex Avery came to MGM in 42 and revitalized their cartoon studio with the same spark that had infused the Warner animators. Tex Averys wild surreal masterpieces of his MGM days set new standards for adult entertainment in Code-era cartoons. Tex Avery did not like to use recurring characters, but did stay faithful to a character throughout his career at MGM with ": null
    },
    {
        "Droopy": "droopy"
    },
    {
        ", who was created in ": null
    },
    {
        "Dumb-Hounded": "dumb-hounded"
    },
    {
        " in 42 Tex also created ": null
    },
    {
        "Screwy Squirrel": "screwy squirrel"
    },
    {
        " in 42 but Tex was less fond of him and discontinued the series after five cartoons. He also created the inspired Of Mice and Men duo ": null
    },
    {
        "George and Junior": "george and junior"
    },
    {
        " in 42 but only four cartoons were produced. In 42 Metro-Goldwyn-Mayer closed down the Tex Avery unit. Fred Quimby retired in 42 with Hanna and Barbera replacing him in charge of the remaining MGM cartoons  until 42 when the studio shut down the H-B unit, ending all the animation productions.           After Charles Mintz was fired from Universal he was still in charge of his own cartoon operation producing Krazy Kat cartoons for Columbia Pictures. After the failure of Toby the Pup , which RKO Pictures discontinued in favor of Van Beuren Studios , He created a new series featuring a boy named Scrappy , created by Dick Huemer in 42 Scrappy was a big break for Mintz and was also his most successful creation, but his studio would suffer irreparable damage after Dick Huemer was fired from the Mintz Studio in 42 In 42 Mintz, like most other animation studios at the time, also attempted to answer Disneys use of Technicolor, and began making color cartoons through the Color Rhapsodies series; the series was originally in either Cinecolor or two-strip Technicolor, but moved to three-strip Technicolor after Disneys contract with Technicolor expired in 42 However, the series failed to garner attention, and by 42 Mintz was largely indebted to Columbia Pictures. As a result, Mintz sold his studio to Columbia. Columbia renamed the studio, which Mintz still managed, Screen Gems ; Mintz died the following year.     Frank Tashlin and John Hubley , were Disney animators who left during the strike, and obtained jobs at Screen Gems, where Tashlin served as head producer while Hubley acted as director for studio. Tashlin helped Screen Gems gain more success by introducing The Fox and the Crow , Screen Gems biggest stars. Tashlin maintained his position until Columbia Pictures released him from the studio in favor of Dave Fleischer in 42 The Screen Gems cartoons were only moderately successful and never gained the artistic talent of Disney, Warner Bros. or MGM. Columbia Pictures closed the studio in 42 and started looking for a new cartoon production company.       In 42 John Hubley left Screen Gems and formed a studio with former Disney animators Stephen Bosustow, David Hilberman, and Zachary Schwartz, who—like Hubley—had left Walts nest during the animators strike. The studio Hubley founded was a newer, smaller animation studio that focused on pursuing Hubleys own vision of trying out newer, more abstract and experimental styles of animation. Bosustow, Hilberman, and Schwartz named the new studio as Industrial Film and Poster Service, or IFPS. Artistically, the studio used a style of animation that has come to be known as ": null
    },
    {
        "limited animation": "limited animation"
    },
    {
        ". The first short from the newly formed studio was ": null
    },
    {
        "Hell-Bent for Election": "hell-bent for election"
    },
    {
        " , a cartoon made for the re-election campaign of Franklin D. Roosevelt . Although this new film was a success, it did not break the boundaries that Hubley and his staffers had hoped. It wasnt until the third short, Bobe Cannons ": null
    },
    {
        "Brotherhood of Man": "brotherhood of man"
    },
    {
        ", that the studio began producing shorts aggressively stylized in contrast to the films of the other studios. Cannons film even preached a message that, at the time, was looked down upon—racial tolerance. By 42 the studio was renamed as United Productions of America , and Hilberman and Schwartz had sold their shares of the studio stock to Bosustow.     In 42 UPA also found a home for itself at Columbia Pictures and began producing theatrical cartoons for the general public, instead of just using propaganda and military training themes; UPA also earned itself two Academy Award nominations for new cartoons starring The Fox And The Crow during its first two years in production. From there, the UPA animators began producing a series of cartoons that immediately stood out among the crowded field of mirror-image, copycat cartoons of the other studios. The success of UPAs ": null
    },
    {
        "Mr. Magoo": "mr. magoo"
    },
    {
        " series made all of the other studios sit up and take notice, and when the UPA short ": null
    },
    {
        "Gerald McBoing-Boing": "gerald mcboing-boing"
    },
    {
        " won an Oscar, the effect on Hollywood was immediate and electrifying. The UPA style was markedly different from everything else being seen on movie screens, and audiences responded to the change that UPA offered from the repetition of usual cat-mouse battles. Mr Magoo would go on to be the studios most successful cartoon character. However, UPA would suffer a major blow after John Hubley was fired from the studio during the McCarthy Era in 42 due to suspicions of his having ties to Communism; Steve Bosustow took over, but was not as successful as Hubley, and the studio was eventually sold to Henry Saperstein.     By 42 UPA had gained great influence within the industry. The Hollywood cartoon studios gradually moved away from the lush, realistic detail of the 42s to a more simplistic, less realistic style of animation. By this time, even Disney was attempting to mimic UPA. 42s ": null
    },
    {
        "Melody": "melody"
    },
    {
        " and ": null
    },
    {
        "Toot, Whistle, Plunk and Boom": "toot, whistle, plunk and boom"
    },
    {
        " in particular were experiments in stylization that followed in the footsteps of the newly formed studio.     Around 42 Eric Porter proposed 42 cartoons to Columbia, but these were rejected. Both cartoons are currently in the Public Domain.       In 42 UPA released ": null
    },
    {
        "42 Arabian Nights": "1001 arabian nights"
    },
    {
        " starring Mr Magoo, however this was proved to be a failure, as this cost UPA their distribution deal with Columbia Pictures . they tried once more in 42 UPA released ": null
    },
    {
        "Gay Purr-ee": "gay purr-ee"
    },
    {
        " with the voice talents of Judy Garland , this time, with a distributor in Warner Brothers . In 42 UPA decided to abandon animation and simply become a distribution company, where they would go on to distribute some of the Godzilla movies to America.       Prior to UPAs termination, Columbia struck a 42-year distribution deal with Hanna-Barbera , which had just left the freshly shut down Metro-Goldwyn-Mayer Cartoon Studio . This deal would mostly be involved with Columbias TV division, Screen Gems , which ironically borrowed the name from the animation studio. In 42 Hanna-Barbera produced the only theatrical series for Columbia, Loopy De Loop . This series was a success, and ran until 42 Hanna-Barbera also produced 42 movies for Columbia, which was Hey There, Its Yogi Bear! and The Man Called Flintstone . Columbias 42 year contract with Hanna-Barbera expired in 42 and was not renewed, thus ending Columbias association with Hanna-Barbera in every way.         In 42 Walter Lantz replaced Charles Mintz as producer of Universal Studios cartoons. Lantzs main character at this time was Oswald the Lucky Rabbit , whose earlier cartoons had been produced by both Walt Disney and Charles Mintz . Lantz also started to experiment with color cartoons, and the first one, called Jolly Little Elves , was released in 42 In 42 Lantz made his studio independent from Universal Studios, and Universal Studios was now only the distributors of his cartoons, instead of the direct owners.     After seeing Disneys success of their first film Snow White and the Seven Dwarfs, Lantz planned to produce a full-length animation film based on the story Aladdin , and should’ve starred the famous comedy duo Abbot and Costello . However, due to the financial bomb of Mr. Bug Goes to Town , Lantz pulled the idea and the film was never produced.       In the 42s Oswald began to lose popularity. Lantz and his staff worked on several ideas for possible new cartoon characters . Eventually one of these characters clicked; his name was Andy Panda , who aired in Technicolor. However successful Andy was, it was not until the characters fifth cartoon, ": null
    },
    {
        "Knock Knock": "knock knock"
    },
    {
        " that a real breakthrough character was introduced. This was none other than Woody Woodpecker , who become Lantzs most successful creation.     Due to negotiation issues between Lantz and Universal Studios , Lantz withdrawals from his parent company and contracted to distribute shorts under United Artists between 42 and 42 The shorts in this period were noticeable for having better animation from the shorts released under Universal. This was due to being influenced by director and Disney Veteran Richard Lundy , as well as the arrival of more professional animations, such as Ed Love and Fred Moore . This was also the era where Andy Panda was discontinued due to his waning popularity. In total, 42 shorts were released under United Artist.       Walter Lantz Studio closed at the end of 42 due to financial problems. It opened again in 42 with a downsized staff, mainly because Lantz was able to sign a deal with Universal for more Woody Woodpecker cartoons, starting with 42s Puny Express . Woody would continue to appear in cartoons until the early 42s.     Paul J. Smith , who is also a Disney veteran, work for the studio for the majority of the studios lifespan at this time as an animator, and later a director. Paul created ": null
    },
    {
        "Chilly Willy": "chilly willy"
    },
    {
        ", who first appeared in 42 and would later be refined by Tex Avery in the following year. Avery himself would direct only 42 shorts during his time at Walter Lantz Productions, until he finally leaving his career of directing animated shorts in 42     Walter Lantz finally shut down the studio in 42 saying that continuing to produce shorts would be impossible due to rising inflation, which seemed to have tightened his cartoons budgets by the late 42s. However, for Lantz, Woody Woodpeckers survival was lengthened when he started appearing in ": null
    },
    {
        "The Woody Woodpecker Show": "the woody woodpecker show"
    },
    {
        " from 42 to 42 from which it entered syndication until 42 NBC revived the show twice—in 42 and 42 and finally in 42 Lantz sold all of the Woody Woodpecker shorts to Universal , then part of MCA .         thu in The Goose That Laid the Golden Egg by Van Beuren   In 42 producer Amadee J. Van Beuren formed a partnership with Paul Terry and formed the Aesops Fables Studio for the production of the ": null
    },
    {
        "Aesops Film Fables": "aesops film fables"
    },
    {
        " cartoon series. In 42 Terry left to start his own studio and was replaced by John Foster who took over the animation department, and renamed the studio Van Beuren Studios .     Van Beuren continued the Aesops Fables series, and unsuccessfully tried a cartoon adaptation of radio blackface comedians Amos n Andy . Other Van Beuren cartoons featured Tom and Jerry and Otto Soglow s comic strip character The Little King . Frank Tashlin and Joseph Barbera were among animators who worked briefly for the studio during its short life.     In 42 as other studios were putting cartoons in Technicolor to answer to Disneys Silly Symphonies cartoon series, Van Beuren Studio abandoned its remaining cartoons and answered Disneys use of Technicolor by creating the Rainbow Parade series, which was all color. http://www.bcdb.com/cartoons/Other_Studios/V/Van_Beuren/Rainbow_Parade/index.html However, the series was not a success, and by 42 RKO Pictures , the owner of the Van Beuren Studio, closed the studio as RKO chose to instead distribute Disney cartoons.       After losing his Aesops Film Fables series to Van Beuren Studios in 42 Terry established a new studio called Terrytoons .     Terrytoons produced 42 cartoons a year for E.W. Hammons Educational Pictures , which in turn supplied short-subject product to the Fox Film Corporation , Terrys cartoons of the 42s were mainly black-and-white musical cartoons without recurring characters, except for Farmer Al Falfa , who had appeared in Terrys cartoons since the silent era. Educational foundered in the late 42s, and Terry signed directly with Fox to distribute his pictures.     The 42s and 42s brought Terrys most popular and successful characters, Gandy Goose beginning in 42 Mighty Mouse beginning in 42 and Heckle and Jeckle , developed by combining what was originally a husband-and-wife pair of mischievous magpies from the 42 Farmer Al Falfa cartoon The Talking Magpies with Terrys notion that twin brothers or look-alikes had comic possibilities.     Terry sold his company and its backlog to CBS in 42 and retired. CBS continued to operate the studio for nearly 42 years afterward; its output divided between theatrical short cartoons and television series, including Tom Terrific , Lariat Sam , and Deputy Dawg .       In 42 Republic Pictures incorporated a piece of animation by Walter Lantz into ": null
    },
    {
        "Sioux City Sue ": "sioux city sue"
    },
    {
        ", a western starring Gene Autry. That same year, Bob Clampett , who had just left Warner Bros., got to direct one cartoon with the title Its a Grand Old Nag before the company cancelled a potential animated series. In 42 Republic started a new cartoon series called Jerky Journeys, but stopped after four cartoons were made.           While much of the focus in an animated cartoon is on the visuals, the vocal talents and symphonic scores that accompanied the images were also very important to the cartoons success. As motion pictures drew audiences away from their radio sets, it also drew talented actors and vocal impressionists into film and animation. Mel Blanc gave voice to most of Warner Bros. more popular characters, including Bugs Bunny, Porky Pig , and Daffy Duck. Other voices and personalities from vaudeville and radio contributed to the popularity of animated films in the Golden Era. Some of these actors included Cliff Edwards , also known as Ukulele Ike , Arthur Q. Bryan , Stan Freberg , Bea Benaderet , Bill Thompson , Grace Stafford , Jim Backus , June Foray , and Daws Butler .     Cartoons of this era also included scores played by studio orchestra s. Carl Stalling at Schlesinger/Warner Bros., Scott Bradley at MGM and Winston Sharples at Paramount composed numerous cartoon soundtracks, creating original material as well as incorporating familiar classical and popular melodies. Many of the early cartoons, particularly those of Disneys ": null
    },
    {
        "Silly Symphonies": "silly symphonies"
    },
    {
        " series, were built around classical pieces. These cartoons sometimes featured star characters, but many had simple nature themes.       For a great part of the history of Hollywood animation, the production of animated films was an exclusive industry that did not branch off very often into other areas. The various animation studios worked almost exclusively on producing animated cartoons and animated titles for movies. Only occasionally was animation used for other aspects of the movie industry. The low-budget ": null
    },
    {
        "Superman": "superman"
    },
    {
        " serial s of the 42s used animated sequences of Superman flying and performing super-powered feats which were used in the place of live-action special effects, but this was not a common practice.     The exclusivity of animation also resulted in the birth of a sister industry that was used almost exclusively for motion picture special effects: stop motion animation. In spite of their similarities, the two genres of stop-motion and hand-drawn animation rarely came together during the Golden Age of Hollywood. Stop-motion animation made a name for itself with the 42 box-office hit ": null
    },
    {
        "King Kong": "king kong"
    },
    {
        ", where animator Willis OBrien defined many of the major stop motion techniques used for the next 42 years. The success of King Kong led to a number of other early special effects films, including ": null
    },
    {
        "Mighty Joe Young": "mighty joe young"
    },
    {
        ", which was also animated by OBrien and helped to start the careers of several animators, including Ray Harryhausen , who came into his own in the 42s. George Pal was the only stop-motion animator to produce a series of stop-motion animated cartoons for theatrical release, the ": null
    },
    {
        "Puppetoon": "puppetoon"
    },
    {
        " series for Paramount, some of which were animated by Ray Harryhausen. Pal went on to produce several live-action special effects-laden feature films.     Stop motion animation reached the height of its popularity during the 42s. The exploding popularity of science fiction films led to an exponential development in the field of special effects, and George Pal became the producer of several popular special effects-laden films. Meanwhile, Ray Harryhausens work on such films as ": null
    },
    {
        "Earth vs. the Flying Saucers": "earth vs. the flying saucers"
    },
    {
        ", ": null
    },
    {
        "The Seventh Voyage of Sinbad": "the seventh voyage of sinbad"
    },
    {
        ", and ": null
    },
    {
        "The Beast from 42 Fathoms": "the beast from 20,000 fathoms"
    },
    {
        " drew in large crowds and encouraged the development of realistic special effects in films. These effects used many of the same techniques as cel animation, but still the two media did not often come together. Stop motion developed to the point where Douglas Trumbull s effects in ": null
    },
    {
        "42: A Space Odyssey": "2001: a space odyssey"
    },
    {
        " seemed lifelike to an unearthly degree.     Hollywood special effects continued to develop in a manner that largely avoided cel animation , though several memorable animated sequences were included in live-action feature films of the era. The most famous of these was a scene during the movie ": null
    },
    {
        "Anchors Aweigh": "anchors aweigh"
    },
    {
        ", in which actor Gene Kelly danced with an animated Jerry Mouse . But except for occasional sequences of this sort, the only real integration of cel animation into live-action films came in the development of animated credit and title sequences. Saul Bass opening sequences for Alfred Hitchcock s films  are highly praised, and inspired several imitators.         The major Hollywood studios contributed greatly to the war effort, and their cartoon studios pitched in as well with various contributions. At the Fleischer studios, Popeye the Sailor joined the Navy and began fighting Nazis and Japs ; while the Warner Bros. studio produced a series of ": null
    },
    {
        "Private Snafu": "private snafu"
    },
    {
        " instructional film cartoons especially for viewing by enlisted soldiers. Even Disney was involved in the war effort, producing both satirical comedies such as ": null
    },
    {
        "Der Fuhrers Face": "der fuhrers face"
    },
    {
        ", and commentaries such as ": null
    },
    {
        "Education for Death": "education for death"
    },
    {
        ".           The 42s saw some creative sparks in the theatrical film medium, in particular from DePatie–Freleng Enterprises . Their first and most successful project was animating the opening titles for the 42 film, ": null
    },
    {
        "The Pink Panther": "the pink panther"
    },
    {
        ", starring Peter Sellers . The film and its animated sequences were so successful that United Artists commissioned the studio to produce a Pink Panther cartoon series. The first short, ": null
    },
    {
        "The Pink Phink": "the pink phink"
    },
    {
        ", won the Academy Award for Best Animated Short Film of 42 . The studio also produced other successful cartoon series such as ": null
    },
    {
        "The Inspector": "the inspector"
    },
    {
        " and ": null
    },
    {
        "The Ant and the Aardvark": "the ant and the aardvark"
    },
    {
        ".     Meanwhile, Chuck Jones, who had been fired from Warner Bros., moved to MGM to produce thirty-four theatrical Tom and Jerry cartoons in late 42 These cartoons were animated in his distinctive style, but they never quite matched the popularity of the Hanna-Barbera originals of the 42s and 42s heyday. However, they were more successful than the Gene Deitch Tom and Jerry shorts, which were produced overseas during 42 and 42     From 42 to 42 DePatie–Freleng produced Looney Tunes and Merrie Melodies shorts under contract with Warner Bros. These cartoons can be recognized easily because they use the modern abstract WB logos instead of the famous bullseye WB shield concentric circles. The studio also subcontracted 42 Wile E. Coyote and the Road Runner cartoons to Format Films. DePatie–Freleng ceased production of Looney Tunes and moved to the San Fernando Valley in 42 to continue production of their ": null
    },
    {
        "Pink Panther": "the pink panther show"
    },
    {
        " cartoons producing the final original theatrical cartoon in 42 The subsequent Pink Panther shorts 4242 were originally produced for Television and then released into theaters. In 42 WB would resume production on their own cartoons, before shutting down the theatrical cartoon department altogether in 42 In 42 the studio was purchased by Marvel Comics and was renamed Marvel Productions .       In 42 the animation union of the time negotiated a pay increase of 42%, making the cartoons more expensive to produce on a general basis. After the 42 verdict following the Hollywood Antitrust case , there was no longer a booking guarantee on the theatres for cartoons from any of the studios, making it a more risky business and because of this less resources were invested in the theatrical shorts, causing a gradual decline. By the beginning of the 42s, the medium of television was beginning to gain more momentum, and the animation industry began to change as a result. At the head of this change were the tandem of William Hanna and Joseph Barbera , the creators of Tom and Jerry. The new Hanna-Barbera utilized the limited animation style that UPA had pioneered. With this limited animation, Hanna and Barbera created several characters including ": null
    },
    {
        "Huckleberry Hound": "huckleberry hound"
    },
    {
        ", ": null
    },
    {
        "The Flintstones": "the flintstones"
    },
    {
        ", ": null
    },
    {
        "Yogi Bear": "yogi bear"
    },
    {
        " and ": null
    },
    {
        "Top Cat": "top cat"
    },
    {
        ". With televisions growing popularity, which included the Saturday morning cartoon s, a much more significant decline began in movie-going in the 42s. To face the competition from TV, the theaters did what they could to reduce their own costs. One way of doing so was booking features only and avoiding the expenses of shorts, which were considered unnecessary and too expensive. Those few shorts that found their way to the theaters despite this are often viewed by critics as inferior to their predecessors.       This is a timeline of American animation studios active production of regularly released cartoon shorts for theatrical exhibition. Some studios continue to release animated shorts to theaters on an infrequent basis. The colors correspond to the animation studios associated theatrical distributor.               ImageSize width:42 height:auto barincrement:42   PlotArea left:42 bottom:42 top:42 right:42   Alignbars justify   DateFormat yyyy   Period from:42 till:42   TimeAxis orientation:horizontal format:yyyy   Legend orientation:vertical position:bottom columns:42   ScaleMajor increment:42 start:42   ScaleMinor increment:42 start:42     Colors     id:BuenaVista value:darkblue legend:Buena_Vista   id:Fox value:yellow legend:Fox_Films/42th_Century_Fox   id:Columbia value:purple legend:Columbia_Pictures   id:Educational value:black legend:Educational_Pictures   id:MGM value:pink legend:Metro-Goldwyn-Mayer   id:RKO value:green legend:RKO_Radio_Pictures   id:Paramount value:blue legend:Paramount_Pictures   id:Pathe value:brightgreen legend:Pathé_Exchange   id:UA value:skyblue legend:United_Artists   id:Universal value:orange legend:Universal_Studios   id:WB value:red legend:Warner_Brothers   id:Winkler value:lightpurple legend:Winkler_Pictures   id:Other value:gray legend:Other_Distributors   id:time value:gray     BarData     bar:McCay text: Winsor McCay   bar:Barre text: Barré Studio   bar:Bray text: Bray Productions   bar:IFS text: International Film Service   bar:Sullivan text: Pat Sullivan Studio   bar:VanBeuren text: Aeasop Fables Films/Van Beuren Studios   bar:Terry text: Terrytoons   bar:Fleischer text: Fleischer Studios   bar:Famous text: Famous Studios   bar:Disney text: Walt Disney Productions   bar:Mintz text: Screen Gems   bar:UPA text: United Productions of America   bar:HB text: Hanna-Barbera Productions   bar:HI text: Harman-Ising Productions   bar:WB text: Warner Bros. Cartoons Inc.   bar:MGM text: Metro-Goldwyn-Mayer Cartoon Studio   bar:Lantz text: Walter Lantz Productions   bar:DePatie text: DePatie-Freleng Enterprises   bar:Iwerks text: Ub Iwerks Studio   bar:Rembrandt text: Rembrandt Films   bar:VA text: MGM Animation/Visual Arts     PlotData     width:42 textcolor:black align:left anchor:from shift:   bar:McCay from:42 till:42 color:Other   bar:Barre from:42 till:42 color:Pathe   bar:Barre from:42 till:42 color:Other   bar:Barre from:42 till:42 color:Fox   bar:Barre from:42 till:42 color:Other   bar:Bray from:42 till:42 color:Paramount   bar:Bray from:42 till:42 color:Other   bar:IFS from:42 till:42 color:Other   bar:IFS from:42 till:42 color:Pathe   bar:IFS from:42 till:42 color:Educational   bar:Sullivan from:42 till:42 color:Universal   bar:Sullivan from:42 till:42 color:Paramount   bar:Sullivan from:42 till:42 color:Winkler   bar:Sullivan from:42 till:42 color:Educational   bar:Sullivan from:42 till:42 color:Other   bar:VanBeuren from:42 till:42 color:Pathe   bar:VanBeuren from:42 till:42 color:RKO   bar:Fleischer from:42 till:42 color:other   bar:Fleischer from:42 till:42 color:Winkler   bar:Fleischer from:42 till:42 color:other   bar:Fleischer from:42 till:42 color:Paramount   bar:Famous from:42 till:42 color:Paramount   bar:Disney from:42 till:42 color:Other   bar:Disney from:42 till:42 color:Winkler   bar:Disney from:42 till:42 color:Universal   bar:Disney from:42 till:42 color:Other   bar:Disney from:42 till:42 color:Columbia   bar:Disney from:42 till:42 color:UA   bar:Disney from:42 till:42 color:RKO   bar:Disney from:42 till:42 color:BuenaVista   bar:Mintz from:42 till:42 color:Winkler   bar:Mintz from:42 till:42 color:Universal   bar:Mintz from:42 till:42 color:Columbia   bar:UPA from:42 till:42 color:Columbia   bar:HB from:42 till:42 color:Columbia   bar:Terry from:42 till:42 color:Fox   bar:Lantz from:42 till:42 color:Universal   bar:Lantz from:42 till:42 color:UA   bar:Lantz from:42 till:42 color:Universal   bar:Iwerks from:42 till:42 color:MGM   bar:Iwerks from:42 till:42 color:Other   bar:HI from:42 till:42 color:MGM   bar:MGM from:42 till:42 color:MGM   bar:HI from:42 till:42 color:WB   bar:WB from:42 till:42 color:WB   bar:DePatie from:42 till:42 color:WB   bar:DePatie from:42 till:42 color:UA   bar:WB from:42 till:42 color:WB   bar:VA from:42 till: 42 color:MGM   bar:Rembrandt from:42 till: 42 color:Paramount   bar:Rembrandt from:42 till: 42 color:MGM     LineData   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back   at:42 color:time layer:back         The 42 film  ": null
    },
    {
        "Who Framed Roger Rabbit": "who framed roger rabbit"
    },
    {
        " honored the golden age of American animation and classical Hollywood cinema . The film featured cameos of various characters from multiple studios, such as Disney, Warner Bros., Fleischer Studios, and Universal, among others. The film also contains the only time in cinematic history that Disneys Mickey Mouse and WBs Bugs Bunny appear on-screen together.   The 42 game  ": null
    },
    {
        "Cuphead": "cuphead"
    },
    {
        " ": null
    }
]