[
    {
        "The  Golden Globe Award for Best Television Series – Musical or Comedy is one of the annual ": null
    },
    {
        "Golden Globe Award": "golden globe award"
    },
    {
        "s, given to the best comedy television series. From 42 to 42 the category was Golden Globe Award for Best Television Series, and grouped Musical, Comedy and Drama series in a single category .                                                               ;42 wins    All in the Family      ;42 wins    The Golden Girls   Sex and the City   Taxi      ;42 wins    Ally McBeal   Barney Miller   Desperate Housewives   Fame   Glee                  ;42 nominations    The Carol Burnett Show   Cheers      ;42 nominations    Frasier      ;42 nominations    All in the Family   The Golden Girls   Will & Grace      ;42 nominations    Entourage   MASH   Sex and the City   Taxi        ;42 nominations    Ally McBeal   Friends   The Mary Tyler Moore Show   Modern Family   Murphy Brown   Seinfeld           ;42 nominations    42 Rock   The Love Boat      ;42 nominations    Alice   Barney Miller   The Big Bang Theory   The Cosby Show   Desperate Housewives   Fame   Family Ties   Girls   Glee   Mad About You   Moonlighting   The Office   Roseanne   Rowan & Martins Laugh-In   Spin City   Transparent   Weeds           ;42 nominations    42rd Rock from the Sun   Arrested Development   Black-ish   Brooklyn Bridge   Californication   Curb Your Enthusiasm   Designing Women   Dharma & Greg   Episodes   Evening Shade   The Glen Campbell Goodtime Hour   Happy Days   Home Improvement   Kate & Allie   Laverne & Shirley   The Marvelous Mrs. Maisel   Maude   Mozart in the Jungle   Orange Is the New Black   The Partridge Family   Silicon Valley   The Sonny & Cher Comedy Hour   Veep   The Wonder Years                 ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " – 42   ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " – 42   ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " – 42    ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " – 42   ": null
    },
    {
        "Fox": "fox broadcasting company"
    },
    {
        " – 42   ": null
    },
    {
        "Amazon Video": "amazon video"
    },
    {
        " – 42    ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " – 42   ": null
    },
    {
        "FX": "fx"
    },
    {
        " – 42   ": null
    },
    {
        "Syndicated": "broadcast syndication"
    },
    {
        " – 42   ": null
    }
]