[
    {
        "         The Gospel According to Matthew  is the first book of the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " and one of the three ": null
    },
    {
        "synoptic gospels": "synoptic gospels"
    },
    {
        ". It tells how the ": null
    },
    {
        "Messiah": "messiah"
    },
    {
        ", ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        ", having been prosecuted by a ": null
    },
    {
        "Rabbinic assembly of ancient Israel": "sanhedrin"
    },
    {
        ", is crucified, raised from the dead, and finally ": null
    },
    {
        "sends the disciples": "great commission"
    },
    {
        " to preach ": null
    },
    {
        "the gospel": "the gospel"
    },
    {
        " to the whole world. Most scholars believe it was composed between AD 42 and 42 with a range of possibility between AD 42 to 42 . The anonymous author was probably a male ": null
    },
    {
        "Jew": "jew"
    },
    {
        ", standing on the margin between traditional and non-traditional Jewish values, and familiar with technical legal aspects of scripture being debated in his time. Writing in a polished Semitic synagogue Greek , he drew on the ": null
    },
    {
        "Gospel of Mark": "gospel of mark"
    },
    {
        " as a source, plus a collection of sayings known as the ": null
    },
    {
        "Q source": "q source"
    },
    {
        " , and material unique to his own community, called the ": null
    },
    {
        "M source": "m-source"
    },
    {
        " or Special Matthew .     The divine nature of Jesus was a major issue for the Matthaean community, the crucial element separating the ": null
    },
    {
        "early Christians": "early christianity"
    },
    {
        " from their Jewish neighbors; while Mark begins with Jesus ": null
    },
    {
        "baptism": "baptism of jesus"
    },
    {
        " and ": null
    },
    {
        "temptations": "temptations of jesus"
    },
    {
        ", Matthew goes back to Jesus origins, showing him as the ": null
    },
    {
        "Son of God": "son of god"
    },
    {
        " from his birth, the fulfillment of ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        " messianic prophecies": "christian messianic prophecies"
    },
    {
        ". The title ": null
    },
    {
        "Son of David": "names and titles of jesus in the new testamentson of david"
    },
    {
        " identifies Jesus as the healing and miracle-working Messiah of Israel , sent to Israel alone. As ": null
    },
    {
        "Son of Man": "son of man"
    },
    {
        " he will return to judge the world, an expectation which his disciples recognise but of which his enemies are unaware. As ": null
    },
    {
        "Son of God": "son of god"
    },
    {
        " he is God revealing himself through his son, and Jesus proving his sonship through his obedience and example.     The gospel reflects the struggles and conflicts between the evangelists community and the other Jews, particularly with its sharp criticism of the scribes and Pharisees. Prior to the ": null
    },
    {
        "Crucifixion": "crucifixion"
    },
    {
        " the Jews are called ": null
    },
    {
        "Israelites": "israelites"
    },
    {
        ", the honorific title of Gods chosen people; after it, they are called ": null
    },
    {
        "Ioudaioi": "ioudaioi"
    },
    {
        " , Jews, a sign that through their rejection of the Christ the ": null
    },
    {
        "Kingdom of Heaven": "kingship and kingdom of god"
    },
    {
        " has been taken away from them and given instead to the church.                 The oldest relatively complete manuscripts of the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " are the  Codex Vaticanus  and the  Codex Sinaiticus , which date from the 42th century. Besides these, there exist manuscript fragments ranging from a few verses to whole chapters.  and  are notable fragments of Matthew. These are copies of copies. In the process of recopying, variations slipped in, different regional ": null
    },
    {
        "manuscript traditions": "manuscript culture"
    },
    {
        " emerged, and ": null
    },
    {
        "corrections and adjustments were made": "historicity of the bible"
    },
    {
        ". Modern ": null
    },
    {
        "textual scholars": "textual criticism"
    },
    {
        " collate all major surviving manuscripts": "cladogram"
    },
    {
        ", as well as citations in the works of the ": null
    },
    {
        "Church Fathers": "church fathers"
    },
    {
        ", in order to produce a text which most likely approximates to the lost autographs.          The gospel itself does not specify an author, but he was probably a male ": null
    },
    {
        "Jew": "jew"
    },
    {
        ", standing on the margin between traditional and non-traditional Jewish values, and familiar with technical legal aspects of scripture being debated in his time. The majority of modern scholars believe that Mark was the ": null
    },
    {
        "first gospel to be composed": "marcan priority"
    },
    {
        " and that Matthew and Luke both drew upon it as a major source for their works. The author of Matthew did not, however, simply copy Mark, but used it as a base, emphasising Jesus place in the Jewish tradition and including other details not covered in Mark. He likely took an additional 42 verses, shared by Matthew and Luke but not found in Mark, from a second source, a hypothetical collection of sayings to which scholars give the name Quelle , or the ": null
    },
    {
        "Q source": "q source"
    },
    {
        ". This view, known as the ": null
    },
    {
        "two-source hypothesis": "two-source hypothesis"
    },
    {
        " , allows for a further body of tradition known as Special Matthew , or the ": null
    },
    {
        "M source": "m source"
    },
    {
        ", meaning material unique to Matthew; this may represent a separate source, or it may come from the authors church, or he may have composed these verses himself. The author also had the Greek scriptures at his disposal, both as book-scrolls  and in the form of testimony collections , and, if Papias is correct, probably oral stories of his community. These sources were predominantly in Greek, but mostly not from any known version of the ": null
    },
    {
        "Septuagint": "septuagint"
    },
    {
        "; a few scholars hold that some of them may have been Greek translations of older Hebrew or Aramaic sources.       The majority view among scholars is that Matthew was a product of the last quarter of the 42st century. This view is based on three arguments: the setting reflects the final separation of Church and Synagogue, about 42 AD; it reflects the capture of Jerusalem and destruction of the Temple by the Romans in 42 AD; it uses Mark, usually dated around 42 AD, as a source.  France himself is not convinced by the majority – see his Commentary, pp. 42–42 This makes it a work of the second generation of Christians, for whom the defining event was the destruction of Jerusalem and the ": null
    },
    {
        "Temple": "second temple"
    },
    {
        " by the Romans in AD 42 in the course of the ": null
    },
    {
        "First Jewish–Roman War": "first jewish–roman war"
    },
    {
        " ; from this point on, what had begun with ": null
    },
    {
        "Jesus of Nazareth": "jesus of nazareth"
    },
    {
        " as a Jewish ": null
    },
    {
        "messianic movement": "messiah"
    },
    {
        " became an increasingly Gentile phenomenon evolving in time into a separate religion.   The Christian community to which Matthew belonged, like many 42st-century Christians, was still part of the larger Jewish community: hence the designation ": null
    },
    {
        "Jewish Christian": "jewish christian"
    },
    {
        " to describe them. The relationship of Matthew to this wider world of Judaism remains a subject of study and contention, the principal question being to what extent, if any, Matthews community had cut itself off from its Jewish roots. Certainly there was conflict between Matthews group and other Jewish groups, and it is generally agreed that the root of the conflict was the Matthew communitys belief in Jesus as the Messiah and authoritative interpreter of the law, as one risen from the dead and uniquely endowed with divine authority.     The author of Matthew wrote for a community of Greek-speaking Jewish Christians located probably in Syria . Unlike Mark, Matthew never bothers to explain Jewish customs, since his intended audience was a Jewish one; unlike Luke, who traces Jesus ancestry back to Adam, father of the human race, he traces it only to Abraham, father of the Jews; of his three presumed sources only M , the material from his own community, refers to a church , an organised group with rules for keeping order; and the content of M suggests that this community was strict in keeping the Jewish law, holding that they must exceed the scribes and the Pharisees in righteousness . Writing from within a Jewish-Christian community growing increasingly distant from other Jews and becoming increasingly Gentile in its membership and outlook, Matthew put down in his gospel his vision of an assembly or church in which both Jew and Gentile would flourish together .                Matthew, alone among the gospels, alternates five blocks of narrative with five of discourse, marking each off with the phrase When Jesus had finished...  . Some scholars see in this a deliberate plan to create a parallel to the first five books of the Old Testament; others see a three-part structure based around the idea of Jesus as ": null
    },
    {
        "Messiah": "messiah"
    },
    {
        "; or a set of weekly readings spread out over the year; or no plan at all. Davies and Allison, in their widely used commentary, draw attention to the use of triads , and ": null
    },
    {
        "R. T. France": "richard thomas france"
    },
    {
        ", in another influential commentary, notes the geographic movement from Galilee to Jerusalem and back, with the post-resurrection appearances in Galilee as the culmination of the whole story.          The Gospel of Matthew begins with the words The Book of Genealogy of Jesus Christ , deliberately echoing the words of Genesis 42:42 in the ": null
    },
    {
        "Old Testament in Greek": "septuagint"
    },
    {
        ". France, p. 42 note 42 and p. 42: The first two words of Matthews gospel are literally book of genesis . The genealogy tells of Jesus descent from ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        " and ": null
    },
    {
        "King David": "king david"
    },
    {
        " and the miraculous events surrounding his ": null
    },
    {
        "virgin birth": "virgin birth of jesus"
    },
    {
        ", France, p. 42 note 42: All MSS and versions agree in making it explicit that Joseph was not Jesus father, with the one exception of sys, which reads Joseph, to whom was betrothed Mary the virgin, begot Jesus. and the infancy narrative tells of the ": null
    },
    {
        "massacre of the innocents": "massacre of the innocents"
    },
    {
        ", ": null
    },
    {
        "the flight into Egypt": "flight into egypt"
    },
    {
        ", and eventual journey to Nazareth.          The first narrative section begins. ": null
    },
    {
        "John": "john the baptist"
    },
    {
        " baptizes Jesus, and the Holy Spirit descends upon him. Jesus prays and meditates in the wilderness for forty days, and is tempted by ": null
    },
    {
        "Satan": "satan"
    },
    {
        ". His early ministry by word and deed in Galilee meets with much success, and leads to the Sermon on the Mount, the first of the discourses. The sermon presents the ethics of the ": null
    },
    {
        "kingdom of God": "kingdom of god"
    },
    {
        ", introduced by the ": null
    },
    {
        "Beatitudes": "beatitudes"
    },
    {
        " . It concludes with a reminder that the response to the kingdom will have eternal consequences, and the crowds amazed response leads into the next narrative block.       From the authoritative words of Jesus the gospel turns to three sets of three ": null
    },
    {
        "miracles": "miracles of jesus"
    },
    {
        " interwoven with two sets of two ": null
    },
    {
        "discipleship": "disciples of jesus"
    },
    {
        " stories , followed by a discourse on mission and suffering. Jesus commissions the ": null
    },
    {
        "Twelve Disciples": "twelve disciples"
    },
    {
        " and sends them to preach to the Jews, perform miracles, and prophesy the imminent coming of the Kingdom, commanding them to travel lightly, without staff or sandals.       Opposition to Jesus comes to a head with accusations that his deeds are done through the power of Satan; Jesus in turn accuses his opponents of blaspheming the Holy Spirit. The discourse is a set of ": null
    },
    {
        "parables": "parables of jesus"
    },
    {
        " emphasising the sovereignty of God, and concluding with a challenge to the disciples to understand the teachings as scribes of the kingdom of heaven. .          The fourth narrative section reveals that the increasing opposition to Jesus will result in his crucifixion in Jerusalem, and that his disciples must therefore prepare for his absence. The instructions for the post-crucifixion church emphasize responsibility and humility. .          Jesus travels toward Jerusalem, and the opposition intensifies: he is tested by ": null
    },
    {
        "Pharisees": "pharisees"
    },
    {
        " as soon as he begins to move towards the city, and when he arrives he is soon in conflict with the Temples traders and religious leaders. He teaches in the Temple, debating with the chief priests and religious leaders and speaking in parables about the Kingdom of God and the failings of the chief priests and the Pharisees. The ": null
    },
    {
        "Herodian": "herodians"
    },
    {
        " caucus also become involved in a scheme to entangle Jesus , but Jesus careful response to their enquiry, Render therefore to Caesar the things that are Caesar’s, and to God the things that are God’s , leaves them marveling at his words .     The disciples ask about the future, and in his final discourse  Jesus speaks of the coming end. There will be false Messiahs, earthquakes, and persecutions, the sun, moon, and stars will fail, but this generation will not pass away before all the prophecies are fulfilled. The disciples must steel themselves for ministry to all the nations. At the end of the discourse, Matthew notes that Jesus has finished all his words, and attention turns to the crucifixion.       The events of Jesus last week occupy a third of the content of all four gospels. Jesus ": null
    },
    {
        "enters Jerusalem in triumph": "triumphal entry into jerusalem"
    },
    {
        " and drives the money changers from the temple, holds a ": null
    },
    {
        "last supper": "last supper"
    },
    {
        ", prays to be spared the coming agony , and is betrayed. He is tried by the Jewish leaders  and before ": null
    },
    {
        "Pontius Pilate": "pontius pilate"
    },
    {
        ", and Pilate washes his hands to indicate that he does not assume responsibility. Jesus is crucified as king of the Jews, ": null
    },
    {
        "mocked": "mocking of jesus"
    },
    {
        " by all. On his death there is an earthquake, the veil of the Temple is rent, and saints rise from their tombs. ": null
    },
    {
        "Mary Magdalene": "mary magdalene"
    },
    {
        " and ": null
    },
    {
        "another Mary": "mary, the mother of james"
    },
    {
        " discover the empty tomb, guarded by an ": null
    },
    {
        "angel": "angel"
    },
    {
        ", and Jesus himself tells them to tell the disciples to meet him in Galilee.     After the resurrection the remaining disciples return to Galilee, to the mountain that Jesus had appointed , where he comes to them and tells them that he has been given all authority in heaven and on Earth. He gives the Great Commission: Therefore go and make disciples of all the nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to obey everything that I have commanded you . Jesus will be with them to the very end of the age .              ": null
    },
    {
        "Christology": "christology"
    },
    {
        " is the theological doctrine of Christ, the affirmations and definitions of Christs humanity and deity . There are a variety of Christologies in the New Testament, albeit with a single centre—Jesus is the figure in whom God has acted for mankinds salvation.     Matthew has taken over his key Christological texts from Mark, but sometimes he has changed the stories he found in Mark, giving evidence of his own concerns. The title ": null
    },
    {
        "Son of David": "names and titles of jesus in the new testamentson of david"
    },
    {
        " identifies Jesus as the healing and miracle-working Messiah of Israel , and the Jewish messiah is sent to Israel alone. As ": null
    },
    {
        "Son of Man": "son of man"
    },
    {
        " he will return to judge the world, a fact his disciples recognise but of which his enemies are unaware. As ": null
    },
    {
        "Son of God": "son of god"
    },
    {
        " he is named ": null
    },
    {
        "Immanuel": "immanuel"
    },
    {
        " , God revealing himself through his son, and Jesus proving his sonship through his obedience and example.       Matthews prime concern was that the Jewish tradition should not be lost in a church that was increasingly becoming gentile. This concern lies behind the frequent citations of Jewish scripture, the evocation of Jesus as the new Moses along with other events from Jewish history, and the concern to present Jesus as fulfilling, not destroying, the Law. Matthew must have been aware of the tendency to distort Pauls teaching of the law no longer having power over the New Testament Christian into ": null
    },
    {
        "antinomianism": "antinomianism"
    },
    {
        ", and addressed Christs fulfilling of what the Israelites expected from the Law and the Prophets in an eschatological sense, in that he was all that the Old Testament had predicted in the Messiah.     The gospel has been interpreted as reflecting the struggles and conflicts between the evangelists community and the other Jews, particularly with its sharp criticism of the scribes and Pharisees. Prior to the ": null
    },
    {
        "Crucifixion": "crucifixion"
    },
    {
        " the Jews are called ": null
    },
    {
        "Israelites": "israelites"
    },
    {
        ", the honorific title of Gods chosen people; after it, they are called ": null
    },
    {
        "Ioudaioi": "ioudaioi"
    },
    {
        " , Jews, a sign that through their rejection of the Christ the ": null
    },
    {
        "Kingdom of Heaven": "kingship and kingdom of god"
    },
    {
        " has been taken away from them and given instead to the church.           The divine nature of Jesus was a major issue for the community of Matthew, the crucial element marking them from their Jewish neighbors. Early understandings of this nature grew as the gospels were being written. Before the gospels, that understanding was focused on the revelation of Jesus as God in his resurrection, but the gospels reflect a broadened focus extended backwards in time. The gospel of Mark recounts prior revelations in Jesus lifetime on earth, at his baptism and transfiguration. Matthew and Luke go back further still, showing Jesus as the Son of God from his birth. Matthew more than all the other gospels identifies how his coming to earth was the fulfillment of many Old Testament prophecies. Finally John calls God the Word pre-existent before ": null
    },
    {
        "creation": "genesis creation narrative"
    },
    {
        ", and thus before all time.     Matthew is a creative reinterpretation of Mark, stressing Jesus teachings as much as his acts, and making subtle changes in order to stress his divine nature: for example, Marks young man who appears at Jesus tomb becomes a radiant angel in Matthew. The miracle stories in Mark do not demonstrate the divinity of Jesus, but rather confirm his status as an emissary of God .       There is a broad disagreement over chronology between Matthew, Mark and Luke on one hand and John on the other: all four agree that Jesus public ministry began with an encounter with John the Baptist, but Matthew, Mark and Luke follow this with an account of teaching and healing in Galilee, then a trip to Jerusalem where there is an incident in the Temple, climaxing with the crucifixion on the day of the ": null
    },
    {
        "Passover": "passover"
    },
    {
        " holiday. ": null
    },
    {
        "John": "gospel of john"
    },
    {
        ", by contrast, puts the Temple incident very early in Jesus ministry, has several trips to Jerusalem, and puts the crucifixion immediately before the Passover holiday, on the day when the lambs for the Passover meal were being sacrificed in Temple.": null
    }
]