[
    {
        "      The Gospel According to Luke , also called the Gospel of Luke, or simply Luke, is the third of the four ": null
    },
    {
        "canonical Gospels": "Gospel"
    },
    {
        ". It tells of the origins, ": null
    },
    {
        "birth": "Nativity Of Jesus"
    },
    {
        ", ": null
    },
    {
        "ministry": "Ministry Of Jesus"
    },
    {
        ", ": null
    },
    {
        "death": "Crucifixion Of Jesus"
    },
    {
        ", ": null
    },
    {
        "resurrection": "Resurrection Of Jesus"
    },
    {
        ", and ": null
    },
    {
        "ascension": "Ascension Of Jesus"
    },
    {
        " of ": null
    },
    {
        "Jesus Christ": "Jesus Christ"
    },
    {
        ".     Luke is the longest of the four gospels and the longest book in the New Testament; together with ": null
    },
    {
        "Acts of the Apostles": "Acts Of The Apostles"
    },
    {
        " it makes up a two-volume work from the same author, called ": null
    },
    {
        "Luke–Acts": "Luke–Acts"
    },
    {
        ". The cornerstone of Luke–Acts theology is salvation history , the authors understanding that Gods purpose is seen in the way he has acted, and will continue to act, in history. It divides the ": null
    },
    {
        "history of first-century Christianity": "Christianity In The 1St Century"
    },
    {
        " into three stages, with the gospel making up the first two of these – the arrival among men of Jesus the ": null
    },
    {
        "Messiah": "Messiah"
    },
    {
        ", from his birth to the beginning of his earthly mission in the meeting with ": null
    },
    {
        "John the Baptist": "John The Baptist"
    },
    {
        " followed by his ": null
    },
    {
        "earthly ministry": "Ministry Of Jesus"
    },
    {
        ", ": null
    },
    {
        "Passion": "Passion Of Jesus"
    },
    {
        ", death, and resurrection . The author of Luke used the ": null
    },
    {
        "Gospel of Mark": "Gospel Of Mark"
    },
    {
        " as a source for the narrative of Christs earthly life, and likely used a hypothetical sayings collection called the ": null
    },
    {
        "Q source": "Q Source"
    },
    {
        " for Jesus teachings. Luke also contains material found in no other gospels, often referred to as the ": null
    },
    {
        "L source": "L Source"
    },
    {
        ".     Luke–Acts does not name its author. According to Church tradition this was ": null
    },
    {
        "Luke the Evangelist": "Luke The Evangelist"
    },
    {
        ", the companion of Paul, but while this view is still occasionally put forward the scholarly consensus emphasises the many contradictions between Acts and the authentic Pauline letters. One suggested date for its composition is around 85 CE .                       ": null
    },
    {
        "Autographs": "Autograph"
    },
    {
        " of Luke and the other Gospels have not been preserved, as is typical for ancient documents; the texts that survive are third-generation copies, with no two completely identical. The earliest witnesses for Lukes gospel fall into two families with considerable differences between them, the Western and the Alexandrian, and the dominant view is that the Western text represents a process of deliberate revision, as the variations seem to form specific patterns. The ": null
    },
    {
        "fragment": "Manuscript Fragment"
    },
    {
        "  is often cited as the oldest witness. It has been dated from the late 2nd century, although this dating is disputed. The oldest complete texts are the 4th century ": null
    },
    {
        "Codex Sinaiticus": "Codex Sinaiticus"
    },
    {
        " and ": null
    },
    {
        "Vaticanus": "Codex Vaticanus Graecus 1209"
    },
    {
        ", both from the Alexandrian family; ": null
    },
    {
        "Codex Bezae": "Codex Bezae"
    },
    {
        ", a 5th- or 6th-century ": null
    },
    {
        "Western text-type": "Western Text-Type"
    },
    {
        " manuscript that contains Luke in ": null
    },
    {
        "Greek": "Ancient Greek"
    },
    {
        " and ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " versions on facing pages, appears to have descended from an offshoot of the main manuscript tradition, departing from more familiar readings at many points. ": null
    },
    {
        "Codex Bezae": "Codex Bezae"
    },
    {
        " shows comprehensively the differences between the versions which show no core theological significance.              The gospel of Luke and the ": null
    },
    {
        "Acts of the Apostles": "Acts Of The Apostles"
    },
    {
        " make up a two-volume work which scholars call ": null
    },
    {
        "Luke–Acts": "Luke–Acts"
    },
    {
        ". Together they account for 27.5% of the ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        ", the largest contribution by a single author, providing the framework for both the Churchs liturgical calendar and the historical outline into which later generations have fitted their idea of the story of Jesus.     The author is not named in either volume. According to a Church tradition dating from the 2nd century he was the ": null
    },
    {
        "Luke": "Luke The Evangelist"
    },
    {
        " named as a companion of ": null
    },
    {
        "Paul": "Apostle Paul"
    },
    {
        " in three of the letters attributed to Paul himself, but a critical consensus emphasizes the countless contradictions between the account in Acts and the authentic Pauline letters.  An example can be seen by comparing Acts accounts of Pauls conversion with Pauls own statement that he remained unknown to Christians in Judea after that event . Luke admired Paul, but his theology was significantly different from Pauls on key points and he does not represent Pauls views accurately. He was educated, a man of means, probably urban, and someone who respected manual work, although not a worker himself; this is significant, because more high-brow writers of the time looked down on the artisans and small business-people who made up the early church of Paul and were presumably Lukes audience.     The eclipse of the traditional attribution to Luke the companion of Paul has meant that an early date for the gospel is now rarely put forward. Some experts date the composition of the combined work to around 80–90 AD, although some others suggest 90–110, and there is textual evidence that Luke–Acts was still being substantially revised well into the 2nd century.            Luke–Acts is a religio-political history of the Founder of the church and his successors, in both deeds and words. The author describes his book as a narrative , rather than as a gospel, and implicitly criticises his predecessors for not giving their readers the speeches of Jesus and the Apostles, as such speeches were the mark of a full report, the vehicle through which ancient historians conveyed the meaning of their narratives. He seems to have taken as his model the works of two respected Classical authors, ": null
    },
    {
        "Dionysius of Halicarnassus": "Dionysius Of Halicarnassus"
    },
    {
        ", who wrote a history of Rome, and the Jewish historian ": null
    },
    {
        "Josephus": "Josephus"
    },
    {
        ", author of a ": null
    },
    {
        "history of the Jews": "Antiquities Of The Jews"
    },
    {
        ". All three authors anchor the histories of their respective peoples by dating the births of the founders and narrate the stories of the founders births from God, so that they are sons of God. Each founder taught authoritatively, appeared to witnesses after death, and ascended to heaven. Crucial aspects of the teaching of all three concerned the relationship between rich and poor and the question of whether foreigners were to be received into the people.     The author of Luke used the ": null
    },
    {
        "Gospel of Mark": "Gospel Of Mark"
    },
    {
        " as a source for the narrative of Christs earthly life, and likely used a hypothetical sayings collection called the ": null
    },
    {
        "Q source": "Q Source"
    },
    {
        " for Jesus teachings, although the existence of Q has been questioned by some scholars. Mark, written around 70 AD, provided the narrative outline, but Mark contains comparatively little of Jesus teachings. For these Luke likely turned to Q, which would have consisted mostly, although not exclusively, of sayings . Mark and Q account for about 64% of Luke. The remaining material, known as the ": null
    },
    {
        "L source": "L Source"
    },
    {
        ", is of unknown origin and date. Most Q and L-source material is grouped in two clusters, Luke 6:17–8:3 and 9:51–18:14, and L-source material forms the first two sections of the gospel .       Luke was written to be read aloud to a group of Jesus-followers gathered in a house to share the Lords supper. The author assumes an educated Greek-speaking audience, but directs his attention to specifically Christian concerns rather than to the Greco-Roman world at large. He begins his gospel with a preface addressed to Theophilus : the name means Lover of God, and could mean any Christian though most interpreters consider it a reference to a Christian convert and Lukes literary patron. Here he informs Theophilus of his intention, which is to lead his reader to certainty through an orderly account of the events that have been fulfilled among us.  He did not, however, intend to provide Theophilus with a historical justification of the Christian faith – did it happen? – but to encourage faith – what happened, and what does it all mean?               Following the authors preface addressed to his patron and the two birth narratives , the gospel opens in Galilee and moves gradually to its climax in Jerusalem:   A brief preface addressed to Theophilus stating the authors aims;   Birth and infancy narratives for both Jesus and John the Baptist, interpreted as the dawn of the promised era of Israels salvation;   Preparation for Jesus messianic mission: Johns prophetic mission, his baptism of Jesus, and the testing of Jesus vocation;   The beginning of Jesus mission in Galilee, and the hostile reception there;   The central section: the journey to Jerusalem, where Jesus knows he must meet his destiny as Gods prophet and messiah;   His mission in Jerusalem, culminating in confrontation with the leaders of the Jewish Temple;   His last supper with his most intimate followers, followed by his arrest, interrogation, and crucifixion;   Gods validation of Jesus as Christ: events from the first Easter to the Ascension, showing Jesus death to be divinely ordained, in keeping with both scriptural promise and the nature of messiahship, and anticipating the story of        The structure of Acts parallels the structure of the gospel, demonstrating the universality of the divine plan and the shift of authority from Jerusalem to Rome:     The gospel – the acts of Jesus:   The presentation of the child Jesus at the Temple in Jerusalem   Jesus forty days in the desert   Jesus in Samaria/Judea   Jesus in the Decapolis   Jesus receives the Holy Spirit   Jesus preaches with power   Jesus heals the sick   Death of Jesus   The apostles are sent to preach to all nations     The acts of the apostles Luke 1:5–3:1Luke 3:2–24:51": null
    },
    {
        "Messiah": "Messiah"
    },
    {
        "Roman emperors are an example": null
    },
    {
        "Murillo": "Bartolomé Esteban Perez Murillo"
    },
    {
        "ristiani": "Ristiani"
    },
    {
        "Luke has taken the words of God from ": null
    },
    {
        "Psalm 2": "Psalm 2"
    },
    {
        ", an ancient royal adoption formula in which the king of Israel was recognised as Gods electGod says to Jesus, You are my beloved son, with you I am well pleased  All who believed were together and had all things in common ": null
    },
    {
        "ravaggio16": "Ravaggio16"
    },
    {
        "about 70 AD cf. , cf. , ": null
    }
]