[
    {
        "              Gothic architecture  is a ": null
    },
    {
        "style": "architectural style"
    },
    {
        " that flourished in ": null
    },
    {
        "Europe": "europe"
    },
    {
        " during the ": null
    },
    {
        "High": "high middle ages"
    },
    {
        " and ": null
    },
    {
        "Late": "late middle ages"
    },
    {
        " Middle Ages": "middle ages"
    },
    {
        ". It evolved from ": null
    },
    {
        "Romanesque architecture": "romanesque architecture"
    },
    {
        " and was succeeded by ": null
    },
    {
        "Renaissance architecture": "renaissance architecture"
    },
    {
        ". Originating in 42th-century ": null
    },
    {
        "France": "france"
    },
    {
        ", it was widely used, especially for cathedrals and churches, until the 42th century.     Its most prominent features included the use of the ": null
    },
    {
        "rib vault": "rib vault"
    },
    {
        " and the ": null
    },
    {
        "flying buttress": "flying buttress"
    },
    {
        ", which allowed the weight of the roof to be counterbalanced by buttresses outside the building, giving greater height and more space for windows. Another important feature was the extensive use of ": null
    },
    {
        "stained glass": "stained glass"
    },
    {
        ", and the ": null
    },
    {
        "rose window": "rose window"
    },
    {
        ", to bring light and color to the interior. Another feature was the use of realistic statuary on the exterior, particularly over the portals, to illustrate biblical stories for the largely illiterate parishioners. Some key architectural features, such as the ": null
    },
    {
        "pointed arch": "pointed arch"
    },
    {
        " and a decorative kind of ": null
    },
    {
        "rib vault": "rib vault"
    },
    {
        ", existed earlier outside Europe, and may have been derived from ": null
    },
    {
        "Islamic architecture": "islamic architecture"
    },
    {
        ". These features had both existed in ": null
    },
    {
        "Romanesque architecture": "romanesque architecture"
    },
    {
        ", but they were used more extensively and in more innovative ways to make Gothic cathedrals higher, stronger, and filled with light.     The first important example is generally considered to be the ": null
    },
    {
        "Basilica of Saint-Denis": "basilica of saint-denis"
    },
    {
        ", near Paris, whose choir was reconstructed with Gothic ": null
    },
    {
        "rib vault": "rib vault"
    },
    {
        "s and large stained glass windows between 42 and 42       Gothic architecture was known during the period as  . The term Gothic architecture originated in the 42th century and was originally very negative, suggesting something barbaric. ": null
    },
    {
        "Giorgio Vasari": "giorgio vasari"
    },
    {
        " used the term barbarous German style in his 42  Lives of the Artists  to describe what is now considered the Gothic style, and in the introduction to the Lives he attributed various architectural features to ": null
    },
    {
        "the Goths": "goths"
    },
    {
        " whom he held responsible for destroying the ancient buildings after they conquered ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", and erecting new ones in this style. ": null
    },
    {
        "ambulatory": "ambulatory"
    },
    {
        " at the ": null
    },
    {
        "Abbey of Saint-Denis": "saint denis basilica"
    },
    {
        " Noyon Cathedral": "noyon cathedral"
    },
    {
        " Noyon Cathedral": "noyon cathedral"
    },
    {
        " Laon Cathedral": "laon cathedral"
    },
    {
        " Notre Dame de Paris": "notre dame de paris"
    },
    {
        ", facade begun about 42       The Gothic style originated in the ": null
    },
    {
        "Ile-de-France": "ile-de-france"
    },
    {
        " region of northern France in the first half of the 42th century. A new dynasty of French Kings, the ": null
    },
    {
        "Capetians": "capetians"
    },
    {
        ", had subdued the feudal lords, and had become the most powerful rulers in France, with their capital in Paris. They allied themselves with the bishops of the major cities of northern France, and reduced the power of the feudal abbots and monasteries. Their rise coincided with an enormous growth of the population and prosperity of the cities of northern France. The Capetian Kings and their bishops wished to build new cathedrals as monuments of their power, wealth, and religious faith.     The church which served as the primary model for the style was the ": null
    },
    {
        "Abbey of St-Denis": "abbey of st-denis"
    },
    {
        ", which underwent reconstruction by the Abbot ": null
    },
    {
        "Suger": "suger"
    },
    {
        ", first in the choir and then the facade , Suger was a close ally and biographer of the French King, ": null
    },
    {
        "Louis VII": "louis vii of france"
    },
    {
        ", who was a fervent Catholic and builder, and the founder of the ": null
    },
    {
        "University of Paris": "university of paris"
    },
    {
        ". Suger remodeled the ambulatory of the Abbey, removed the enclosures that separated the chapels, and replaced the existing structure with imposing pillars and ": null
    },
    {
        "rib vault": "rib vault"
    },
    {
        "s. This created higher and wider bays, into which he installed larger windows, which filled the end of the church with light. Soon afterward he rebuilt the facade, adding three deep portals, each with a ": null
    },
    {
        "tympanum": "tympanum"
    },
    {
        ", an arch filled with sculpture illustrating biblical stories. The new facade was flanked by two towers. He also installed a small circular ": null
    },
    {
        "rose window": "rose window"
    },
    {
        " over the central portal. This design became the prototype for a series of new French cathedrals.     ": null
    },
    {
        "Sens Cathedral": "sens cathedral"
    },
    {
        " was the first Cathedral to be built in the new style . Other versions of the new style soon appeared in ": null
    },
    {
        "Noyon Cathedral": "noyon cathedral"
    },
    {
        " ; ": null
    },
    {
        "Laon Cathedral": "laon cathedral"
    },
    {
        " ; and the most famous of all, ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        ", where construction had begun in 42     The Gothic style was also adapted by some French monastic orders, notably the ": null
    },
    {
        "Cistercian": "cistercian"
    },
    {
        " order under ": null
    },
    {
        "Saint Bernard of Clairvaux": "saint bernard of clairvaux"
    },
    {
        ". It was used in an austere form without ornament at the new Cistercian ": null
    },
    {
        "Abbey of Fontenay": "abbey of fontenay"
    },
    {
        " and the church of ": null
    },
    {
        "Clairvaux Abbey": "clairvaux abbey"
    },
    {
        ", whose site is now occupied by a French prison.     The new style was also copied outside the Kingdom of France in the ": null
    },
    {
        "Duchy of Normandy": "duchy of normandy"
    },
    {
        ". Early examples of Norman Gothic included ": null
    },
    {
        "Coutances Cathedral": "coutances cathedral"
    },
    {
        " ; ": null
    },
    {
        "Bayeux Cathedral": "bayeux cathedral"
    },
    {
        " , ": null
    },
    {
        "Le Mans Cathedral": "le mans cathedral"
    },
    {
        " and ": null
    },
    {
        "Rouen Cathedral": "rouen cathedral"
    },
    {
        ". Through the rule of the ": null
    },
    {
        "Angevin dynasty": "house of plantagenet"
    },
    {
        ", the new style was introduced to ": null
    },
    {
        "England": "england"
    },
    {
        " and spread from there to ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", northern ": null
    },
    {
        "Italy": "italy"
    },
    {
        " and ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". The Gothic style did not immediately replace the Romanesque everywhere in Europe. The Late Romanesque continued to flourish in the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " under the ": null
    },
    {
        "Hohenstaufens": "house of hohenstaufen"
    },
    {
        " and ": null
    },
    {
        "Rhineland": "rhineland"
    },
    {
        " Chartres Cathedral": "chartres cathedral"
    },
    {
        " Chartres Cathedral": "chartres cathedral"
    },
    {
        " Bourges Cathedral": "bourges cathedral"
    },
    {
        " Reims Cathedral": "reims cathedral"
    },
    {
        " Amiens Cathedral": "amiens cathedral"
    },
    {
        " Amiens Cathedral": "amiens cathedral"
    },
    {
        " choir and altar       From the end of the 42th century until the middle of the 42th century, the Gothic style spread from the Île-de-France to appear in other cities of northern France. New structures in the style included ": null
    },
    {
        "Chartres Cathedral": "chartres cathedral"
    },
    {
        " ; ": null
    },
    {
        "Bourges Cathedral": "bourges cathedral"
    },
    {
        " , ": null
    },
    {
        "Reims Cathedral": "reims cathedral"
    },
    {
        " , and ": null
    },
    {
        "Amiens Cathedral": "amiens cathedral"
    },
    {
        " ; At Chartres, the use of the flying buttresses allowed the elimination of the tribune level, which allowed much higher arcades and nave, and larger windows. The early type of ": null
    },
    {
        "rib vault": "rib vault"
    },
    {
        " used of Saint Denis and Notre Dame, with six parts, was modified to four parts, making it simpler and stronger. Amiens and Chartres were among the first to use the ": null
    },
    {
        "flying buttress": "flying buttress"
    },
    {
        "; the buttresses were strengthened by an additional arch and with a supporting arcade, allowing even higher and walls and more windows. At Reims, the buttresses were given greater weight and strength by the addition of heavy stone pinnacles on top. These were often decorated with statues of angels, and became an important decorative element of the High Gothic style. Another practical and decorative element, the gargoyle, appeared; it was an ornamental rain spout which channeled the water from the roof away from the building. At Amiens, the windows of the nave were made larger, and an additional row of clear glass windows flooded the interior with light. The new structural technologies allowed the enlargement of the transepts and of the choirs at the east end of the cathedrals, creating the space for a ring of well-lit chapels. The transept of Notre-Dame was rebuilt with the new technology, and two spectacular rose windows added. ": null
    },
    {
        "Sainte-Chapelle": "sainte-chapelle"
    },
    {
        " Notre Dame Cathedral": "notre dame cathedral"
    },
    {
        " Notre Dame Cathedral": "notre dame cathedral"
    },
    {
        "       The next period was termed  Rayonnant  , describing the tendency toward the use of more and more stained glass and less masonry in the design of the structure, until the walls seemed entirely made of glass. The most celebrated example was the chapel of ": null
    },
    {
        "Sainte-Chapelle": "sainte-chapelle"
    },
    {
        ", the chapel attached to the royal residence on the ": null
    },
    {
        "Palais de la Cité": "palais de la cité"
    },
    {
        ". An elaborate system of exterior columns and arches reduced the walls of the upper chapel to a thin framework for the enormous windows. The weight of each of the masonry gables above the ": null
    },
    {
        "archivolt": "archivolt"
    },
    {
        " of the windows also helped the walls to resist the thrust and to distribute the weight.     Another landmark of the Rayonnant Gothic are the two rose windows on the north and south of the transept of ": null
    },
    {
        "Notre Dame Cathedral": "notre dame cathedral"
    },
    {
        ". Whereas earlier rose windows, like those of ": null
    },
    {
        "Amiens Cathedral": "amiens cathedral"
    },
    {
        ", were framed by stone and occupied only a portion of the wall, these two windows, with a delicate lace-like framework, occupied the entire space between the pillars.         Paris Sainte Chapelle du Chateau de Vincennes ancienne demeure royale Vers le Bois de Vincennes en France angle 42JPG|The west front of ": null
    },
    {
        "Sainte-Chapelle de Vincennes": "sainte-chapelle de vincennes"
    },
    {
        "   Interior of Sainte Chapelle, Vincennes 42 42jpg|The nave of ": null
    },
    {
        "Sainte-Chapelle de Vincennes": "sainte-chapelle de vincennes"
    },
    {
        "   Rose Window of Sainte-Chapelle de Vincennes, Interior View 42 42jpg|The rose window ": null
    },
    {
        "Sainte-Chapelle de Vincennes": "sainte-chapelle de vincennes"
    },
    {
        " Vault ceiling": "vault"
    },
    {
        " in the ": null
    },
    {
        "Sainte-Chapelle de Vincennes": "sainte-chapelle de vincennes"
    },
    {
        "   Cathédrale Notre-Dame de Rouen - panoramio .jpg|West facade, ": null
    },
    {
        "Rouen Cathedral": "rouen cathedral"
    },
    {
        " Royal Monastery of Brou": "royal monastery of brou"
    },
    {
        ", ": null
    },
    {
        "Bourg-en-Bresse": "bourg-en-bresse"
    },
    {
        " St. Annes Church": "church of st. anne, vilnius"
    },
    {
        " in ": null
    },
    {
        "Vilnius": "vilnius"
    },
    {
        ", ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        "       The ": null
    },
    {
        "Flamboyant": "flamboyant"
    },
    {
        " Gothic style appeared in the second half of the 42th century. Its characteristic features were more exuberant decoration, as the nobles and wealthy citizens of mostly northern French cities competed to build more and more elaborate churches and cathedrals. It took its name from the sinuous, flame-like designs which ornamented windows. Other new features included the arc en accolade, a window decorated with an arch, stone pinnacles and floral sculpture. It also featured an increase in the number of nervures, or ribs, that supported and decorated each vault of the ceiling, both for greater support and decorative effect. Notable examples of Flamboyant Gothic include the western facade of ": null
    },
    {
        "Rouen Cathedral": "rouen cathedral"
    },
    {
        " and ": null
    },
    {
        "Sainte-Chapelle de Vincennes": "sainte-chapelle de vincennes"
    },
    {
        " in Paris, both built in the 42s; and the Choir of ": null
    },
    {
        "Mont Saint Michel Abbey": "mont saint michel abbey"
    },
    {
        " . Subsequently, the style spread to Northern Europe. A notable example of Flamboyant Gothic in the Baltic region includes the ": null
    },
    {
        "Brick Gothic": "brick gothic"
    },
    {
        " Church of St. Anne": "church of st. anne, vilnius"
    },
    {
        " in ": null
    },
    {
        "Vilnius": "vilnius"
    },
    {
        " Chartres Cathedral": "chartres cathedral"
    },
    {
        " York Minster": "york minster"
    },
    {
        " Cologne Cathedral": "cologne cathedral"
    },
    {
        " Basilica of Saint Denis": "basilica of saint denis"
    },
    {
        ", by ": null
    },
    {
        "Eugene Viollet-le-Duc": "eugene viollet-le-duc"
    },
    {
        "       The plan of the Gothic cathedral was based on the model of the ancient Roman ": null
    },
    {
        "basilica": "basilica"
    },
    {
        ", which was a combined public market and courthouse; which was also the basis of the plan of the Romanesque cathedral. The cathedral is in the form of a Latin cross. The entrance is traditionally on the west end, has three portals decorated with sculpture, usually a rose window, and is flanked by two towers. The long nave, where the congregation worshiped, occupies the west end. This is usually divided from the nave by rows of pillars, which support the roof, flanked by one or two aisles, called collaérals. There are usually small chapels on the two sides, placed between the buttresses, which provide additional support to the walls.     The cathedral usually has a ": null
    },
    {
        "transept": "transept"
    },
    {
        ", a crossing, roughly in the middle, which sometimes projects outwards some distance, and in other cases, such as Notre-Dame, is minimal. The croisée or crossing of the transept, is the center of the church, and is surrounded by particularly massive pillars, which sometimes support a lantern tower, which brings light into the center of the cathedral. The north and south facades of the transept often feature rose windows, as at ": null
    },
    {
        "Notre Dame de Paris": "notre dame de paris"
    },
    {
        ".     To the east of the transept is the ": null
    },
    {
        "choir": "choir"
    },
    {
        ", where the altar is located, where ceremonies take place, and where only the clergy was allowed. This space grew greatly in the 42th century, as ceremonies became more elaborate. Behind the choir is single or double a walkway called the ": null
    },
    {
        "ambulatory": "ambulatory"
    },
    {
        ". At the eastern end of the church is the ": null
    },
    {
        "apse": "apse"
    },
    {
        " usually in the form of a half-circle, and the chevet. There is usually a chapel here dedicated to the Virgin Mary, which can be very large. Around chevet there are usually several other smaller chapels.     The earlier Gothic cathedrals had four levels, from the floor to the roof. On the ground floor, there were two rows grand arcades with large pillars, which received the weight of the vaults of the ceiling. Above these were the tribunes, a section of arched openings, giving more support. Above these was the triforium, a section of small arches. On the top level, just below the vaults, were the upper windows, the main source of light for the Cathedral. The lower walls were supported by massive contreforts or buttresses placed directly up against them, with pinnacles on top which provided additional weight.     Later, with the development of the flying buttress, the supports moved further away from the walls, and the walls were built much higher. Gradually the tribunes and the triforium disappeared, and the walls above the arcades were occupied almost entirely with stained glass.     The eastern arm shows considerable diversity. In England it is generally long and may have two distinct sections, both choir and presbytery. It is often square ended or has a projecting Lady Chapel, dedicated to the ": null
    },
    {
        "Virgin Mary": "virgin mary"
    },
    {
        ". In France the eastern end is often polygonal and surrounded by a walkway called an ": null
    },
    {
        "ambulatory": "ambulatory"
    },
    {
        " and sometimes a ring of chapels called a ": null
    },
    {
        "chevet": "chevet"
    },
    {
        " . While German churches are often similar to those of France, in Italy, the eastern projection beyond the transept is usually just a shallow apsidal chapel containing the sanctuary, as at ": null
    },
    {
        "Florence Cathedral": "florence cathedral"
    },
    {
        ". Wim Swaan, The Gothic Cathedral ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        " Canterbury Cathedral": "canterbury cathedral"
    },
    {
        " Rouen Cathedral": "rouen cathedral"
    },
    {
        " Cologne Cathedral": "cologne cathedral"
    },
    {
        " Strasbourg Cathedral": "strasbourg cathedral"
    },
    {
        " Prague Cathedral": "st. vitus cathedral"
    },
    {
        " Flamboyant": "flamboyant"
    },
    {
        " rib vaults with ornamental ribs at Lady Chapel of ": null
    },
    {
        "Ely Cathedral": "ely cathedral"
    },
    {
        " Peterborough Cathedral": "peterborough cathedral"
    },
    {
        "       In Romanesque architecture, the rounded arches of the ": null
    },
    {
        "barrel vault": "barrel vault"
    },
    {
        "s that covered the nave pressed directly down on the walls with crushing weight. This required massive columns, thick walls and small windows, and naturally limited the height of the building. Gothic architects found a solution through an innovative use of the ": null
    },
    {
        "rib vault": "rib vault"
    },
    {
        ".     An early kind of rib vault, used at ": null
    },
    {
        "Mosque-Cathedral of Cordoba": "mosque-cathedral of cordoba"
    },
    {
        " , was found under a cupola or dome, but was different in form and function from the later Gothic rib vault. The cupola itself was supported by ": null
    },
    {
        "pendentives": "pendentives"
    },
    {
        " or ": null
    },
    {
        "squinches": "squinches"
    },
    {
        ", a practice used in ": null
    },
    {
        "Byzantine architecture": "byzantine architecture"
    },
    {
        ". The ribs were decorative. The vaults in churches in ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " dated to the 42th century, after Sicily had been conquered by the Normans, and resembled the vaults used at the same time in Normandy and England.     Gothic builders designed a new and lighter kind of rib vault. They divided into compartments by a diagonal crossing of thin stone ribs , and completed by two additional arcs perpendicular and parallel to the nave . They also made innovative use of the broken arch or pointed arch. In Islamic and Romanesque architecture, pointed arches had usually been used in doorways and windows. Gothic architects used them at the meeting points of the ribs at the top of the vaults, which distributed the weight of the roof downwards and outwards, not just downwards. These ribs divided the early vaults into six compartments, each as wide as two traverses of the nave. Some of the ribs went downwards as colonettes, and were bundled into pillars on the ground floor. Other ribs carried the thrust outwards to the walls, where it was counterbalanced by heavy ": null
    },
    {
        "flying buttresses": "flying buttresses"
    },
    {
        " outside the walls. Since the weight was supported by pillars and buttresses, the walls themselves could be much higher and thinner. This made possible the expanses of ": null
    },
    {
        "stained glass": "stained glass"
    },
    {
        " that were a characteristic of Gothic cathedrals.     The earlier Gothic rib vaults, used at Notre Dame, Noyon, and Laon, were divided by the ribs into six compartments, were very difficult to build, and could only cross a limited space. In later cathedral construction, the design was simplified, and the rib vaults had only four compartments, and could cover a wider span; a single vault could cross the nave, and fewer pillars were needed. The four-part vaults also made it possible to build the cathedrals even higher. ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        ", begun in 42 with four-part vaults, reached a height of 42 meters, remarkable for the time. ": null
    },
    {
        "Amiens Cathedral": "amiens cathedral"
    },
    {
        ", begun in 42 with four-part ribs, reached the height of 42 meters at the transept.     In the later period of the Gothic style, from the early 42th century, the rib vaults lost their elegant simplicity and were loaded with additional ribs, sculptural designs, and sometimes pendants and other purely decorative elements. ": null
    },
    {
        "nave": "nave"
    },
    {
        " of ": null
    },
    {
        "Notre-Dame Cathedral": "notre-dame cathedral"
    },
    {
        " drawn by ": null
    },
    {
        "Eugène Viollet-le-Duc": "eugène viollet-le-duc"
    },
    {
        " Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        " Amiens Cathedral": "amiens cathedral"
    },
    {
        "        Another important feature of Gothic architecture was the ": null
    },
    {
        "flying buttress": "flying buttress"
    },
    {
        ", designed to support the walls by means of arches connected to counter-supports outside the walls. Flying buttresses had existed in simple forms since Roman times, but the Gothic builders raised their use to a fine art, balancing the thrust from the roof inside against the counter-thrust of the buttresses. The earliest Gothic cathedrals, including Saint-Denis and Notre-Dame in its beginning stages, did not have flying buttresses. Their walls were supported by heavy stone abutments placed directly against the walls. The roof was supported by the ribs of the vaults, which were bundled with the columns below.     In the later 42th and early 42th century, the buttresses became more sophisticated. New arches carried the thrust of the weight entirely outside the walls, where it was met by the counter-thrust of stone columns, with pinnacles placed on top for decoration and for additional weight. Thanks to this system of external buttresses, the walls could be higher and thinner, and could support larger stained glass windows. The buttresses themselves became part of the decoration; the pinnacles became more and more ornate, becoming more and more elaborate, as at ": null
    },
    {
        "Beauvais Cathedral": "beauvais cathedral"
    },
    {
        " and ": null
    },
    {
        "Reims Cathedral": "reims cathedral"
    },
    {
        ". The arches had an additional practical purpose; they contained lead channels which carried rainwater off the roof; it was expelled from the mouths of stone ": null
    },
    {
        "gargoyles": "gargoyles"
    },
    {
        " placed in rows on the buttresses. ": null
    },
    {
        "Noyon Cathedral": "noyon cathedral"
    },
    {
        " ; Ground floor arcade of massive pillars supporting the roof; a second, smaller arcade, or tribune; the ": null
    },
    {
        "triforium": "triforium"
    },
    {
        ", a narrow walkway; and claire-voie ": null
    },
    {
        "Chartres Cathedral": "chartres cathedral"
    },
    {
        " Amiens Cathedral": "amiens cathedral"
    },
    {
        " Beauvais Cathedral": "beauvais cathedral"
    },
    {
        " Nave": "nave"
    },
    {
        " of ": null
    },
    {
        "Milan Cathedral": "milan cathedral"
    },
    {
        " 42  m high       An important characteristic of Gothic church architecture is its height, both absolute and in proportion to its width, the verticality suggesting an aspiration to Heaven. The increasing height of cathedrals over the Gothic period was accompanied by an increasing proportion of the wall devoted to windows, until, by the late Gothic, the interiors became like cages of glass. This was made possible by the development of the flying buttress, which transferred the thrust of the weight of the roof to the supports outside the walls. As a result, the walls gradually became thinner and higher, and masonry was replaced with glass. The four-part elevation of the naves of early Cathedrals such as Notre-Dame was transformed in the choir of ": null
    },
    {
        "Beauvais Cathedral": "beauvais cathedral"
    },
    {
        " to very tall arcades, a thin triforium, and soaring windows up to the roof.     Beauvais Cathedral reached the limit of what was possible with Gothic technology. A portion of the choir collapsed in 42 causing alarm in all of the cities with very tall cathedrals. Panels of experts were created in Sienna and Chartres to study the stability of those structures. Only the transept and choir of Beauvais were completed, and in the 42st century, the transept walls were reinforced with cross-beams. No cathedral built since exceeded the height of the choir of Beauvais.     A section of the main body of a Gothic church usually shows the ": null
    },
    {
        "nave": "nave"
    },
    {
        " as considerably taller than it is wide. In England, the proportion is sometimes greater than 42:42 while the greatest proportional difference achieved is at ": null
    },
    {
        "Cologne Cathedral": "cologne cathedral"
    },
    {
        " with a ratio of 42:42 The highest internal vault is at ": null
    },
    {
        "Beauvais Cathedral": "beauvais cathedral"
    },
    {
        " at  ": null
    },
    {
        "Abbey of Saint-Denis": "abbey of saint-denis"
    },
    {
        ", Abbot ": null
    },
    {
        "Suger": "suger"
    },
    {
        " Chartres Cathedral": "chartres cathedral"
    },
    {
        " Bourges Cathedral": "bourges cathedral"
    },
    {
        " Oculus": "oculus"
    },
    {
        " of ": null
    },
    {
        "Canterbury Cathedral": "canterbury cathedral"
    },
    {
        " Rayonnant": "rayonnant"
    },
    {
        " north ": null
    },
    {
        "rose window": "rose window"
    },
    {
        " of ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        "       One of the most prominent features of Gothic architecture was the use of stained glass window, which steadily grew in height and size and filled cathedrals with light and color. Historians including Viollet-le-Duc, Focillon, Aubert, and ": null
    },
    {
        "Max Dvořák": "max dvořák"
    },
    {
        " contended that this is one of the most universal features of the Gothic style.     Religious teachings in the Middle Ages, particularly the writings of Religious ": null
    },
    {
        "Pseudo-Dionysius": "pseudo-dionysius"
    },
    {
        ", a 42th-century mystic whose book,  The Celestial Hierarchy , was popular among monks in France, taught that all light was divine. When the Abbot ": null
    },
    {
        "Suger": "suger"
    },
    {
        " ordered the reconstruction of the ": null
    },
    {
        "Basilica of Saint Denis": "basilica of saint denis"
    },
    {
        ", he instructed that the windows in the choir admit as much light as possible.     Many earlier Romanesque churches had stained glass windows, and many had round windows, called oculi, but these windows were necessarily small, due to the thickness of the walls. The primary interior decorations of Romanesque cathedrals were painted murals. In the Gothic period, the improvements in rib vaults and flying buttresses allowed Cathedral walls to be higher, thinner and stronger, and windows were consequently considerably larger, The windows of churches in the late Gothic period, such as ": null
    },
    {
        "Sainte Chapelle": "sainte chapelle"
    },
    {
        " in Paris, filled the entire wall between the ribs of stone. Enormous windows were also an important element of ": null
    },
    {
        "York Minster": "york minster"
    },
    {
        " and ": null
    },
    {
        "Gloucester Cathedral": "gloucester cathedral"
    },
    {
        ".     The main threat to cathedral windows was the wind; frames had to be extremely strong. The early windows were fit into openings cut into the stone. The small pieces of colored glass were joined together with pieces of lead, and then their surfaces were painted with faces and other details. and then the windows were mounted in the stone frames. Thin vertical and horizontal bars of iron, called vergettes or barlotierres, were placed inside the window to reinforce the glass.     The stories told in the glass were usually episodes from the Bible, but they also sometimes illustrated the professions of the guilds which had funded the windows, such as the drapers, stonemasons or the barrel-makers.     Much of the stained glass in Gothic cathedrals today dates from later restorations, but a few cathedrals, notably ": null
    },
    {
        "Chartres Cathedral": "chartres cathedral"
    },
    {
        " and ": null
    },
    {
        "Bourges Cathedral": "bourges cathedral"
    },
    {
        ", still have many of their original windows. ": null
    },
    {
        "Basilica of St Denis": "basilica of st denis"
    },
    {
        ", with early ": null
    },
    {
        "tympanum": "tympanum"
    },
    {
        " tympanum": "tympanum"
    },
    {
        " at ": null
    },
    {
        "Amiens Cathedral": "amiens cathedral"
    },
    {
        " Strasbourg Cathedral": "strasbourg cathedral"
    },
    {
        " Westminster Abbey": "westminster abbey"
    },
    {
        " north portal       Early Gothic Cathedrals traditionally have their main entrance at the western end of the church, opposite the choir. Based on the model of the ": null
    },
    {
        "Basilica of Saint Denis": "basilica of saint denis"
    },
    {
        " and ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        ", there are usually three doorways with pointed arches, richly filled with sculpture. The ": null
    },
    {
        "tympanum": "tympanum"
    },
    {
        ", or arch, over each doorway is filled with realistic statues illustrating biblical stories, and the columns between the doors are often also crowded with statuary. Following the example of Amiens, the tympanum over the central portal traditionally depicted the ": null
    },
    {
        "Last Judgement": "last judgement"
    },
    {
        ", the right portal showed the coronation of the Virgin Mary, and the left portal showed the lives of saints who were important in the diocese.     The iconography of the sculptural decoration on the facade was not left to the artists. An edict of the ": null
    },
    {
        "Second Council of Nicaea": "second council of nicaea"
    },
    {
        " in 42 had set the rules: The composition of religious images is not to be left to the inspiration of artists; it is derived from the principles put in place by the Catholic Church and religious tradition. Only the art belongs to the artist; the composition belongs to the Fathers.      The portals and interiors were much more colorful than they are today. Each sculpture on the tympanum and in the interior was painted by the peintre imagier, or image painter, following a system of colors codified in the 42th century; yellow, called gold, symbolized intelligence, grandeur and virtue; white, called argent, symbolized purity, wisdom, and correctness; black, or sable, meant sadness, but also will; green, or sinopole, represented hope, liberty and joy; red or guelues meant charity or victory; blue, or azure symbolized the sky, faithfulness and perseverance; and violet, or pourpre, was the color of royalty and sovereignty. ": null
    },
    {
        "Laon Cathedral": "laon cathedral"
    },
    {
        " Abbey of Saint-Étienne, Caen": "abbey of saint-étienne, caen"
    },
    {
        " Notre-Dame de lÉpine": "notre-dame de lépine"
    },
    {
        ", near ": null
    },
    {
        "Verdun": "verdun"
    },
    {
        ", an example of ": null
    },
    {
        "Flamboyant Gothic": "flamboyant gothic"
    },
    {
        " Rouen Cathedral": "rouen cathedral"
    },
    {
        " Salisbury Cathedral": "salisbury cathedral"
    },
    {
        ", the tallest in Britain     The plan for the ": null
    },
    {
        "Basilica of Saint-Denis": "basilica of saint-denis"
    },
    {
        " called for two towers of equal height on the west facade, and this general plan was copied at Notre-Dame and most of the early cathedrals. The towers of ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        ", 42 meters tall, were intended to be seen throughout the city; they were the tallest towers in Paris until the completion of the ": null
    },
    {
        "Eiffel Tower": "eiffel tower"
    },
    {
        " in 42 An informal but vigorous competition began in northern France for the tallest Cathedral towers.     To make the churches taller and more prominent, and visible from a distance, heir builders often added a flèche, a spire usually made of wood and covered with lead, to the top of each tower, or, as in ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        ", in the center of the transept. Later in the Gothic period, more massive towers were constructed over the transept, rivaling or exceeding in height the towers of the facade.     The towers were usually the last part of the Cathedral to be constructed. They were often built many years or decades after the rest of the building. Sometimes, by the time the towers were built, the plans had changed, or the money had run out. As a result, some Gothic cathedrals had just one tower, or two towers of different heights or styles. On the other hand, ": null
    },
    {
        "Laon Cathedral": "laon cathedral"
    },
    {
        ", begun just before Notre-Dame, boasted five towers; two on the facade, two on the transept, and a central lantern. An additional two were planned but not built. The ": null
    },
    {
        "Abbey of Saint-Étienne, Caen": "abbey of saint-étienne, caen"
    },
    {
        " originally built in the Romanesque style, was rebuilt with nine Gothic towers in the 42th century.     The informal competition for the ": null
    },
    {
        "tallest church in Europe": "list of tallest church buildings"
    },
    {
        " went on throughout the Gothic period, sometimes with disastrous results. ": null
    },
    {
        "Beauvais Cathedral": "beauvais cathedral"
    },
    {
        " had the tallest tower , completed in 42 for a brief time, until its tower collapsed in the wind in 42 ": null
    },
    {
        "Lincoln Cathedral": "lincoln cathedral"
    },
    {
        " also had the record from 42 until 42 until its tower also collapsed. Today the tallest cathedral tower in France is ": null
    },
    {
        "Rouen Cathedral": "rouen cathedral"
    },
    {
        ", and ": null
    },
    {
        "Cologne Cathedral": "cologne cathedral"
    },
    {
        " is the tallest cathedral in Europe.     The Gothic ": null
    },
    {
        "Old St Pauls Cathedral": "old st pauls cathedral"
    },
    {
        " had been the tallest cathedral in England until it was destroyed by the ": null
    },
    {
        "Great Fire of London": "great fire of london"
    },
    {
        " in 42 Today the tallest combined Gothic tower and spire in the UK belongs to ": null
    },
    {
        "Salisbury Cathedral": "salisbury cathedral"
    },
    {
        ", , built 42–42     In ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", the tower, if present, is almost always detached from the building, as at ": null
    },
    {
        "Florence Cathedral": "florence cathedral"
    },
    {
        ", and is often from an earlier structure. In ": null
    },
    {
        "France": "france"
    },
    {
        " and ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", two towers on the front is the norm. In ": null
    },
    {
        "England": "england"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        " and ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        " this is often the arrangement, but an English cathedral may also be surmounted by an enormous tower at the crossing. Smaller churches usually have just one tower, but this may also be the case at larger buildings, such as ": null
    },
    {
        "Salisbury Cathedral": "salisbury cathedral"
    },
    {
        " or ": null
    },
    {
        "Ulm Minster": "ulm minster"
    },
    {
        " in ": null
    },
    {
        "Ulm": "ulm"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", completed in 42 and possessing the tallest spire in the world, slightly exceeding that of ": null
    },
    {
        "Lincoln Cathedral": "lincoln cathedral"
    },
    {
        ", the tallest spire that was actually completed during the medieval period, at .  ": null
    },
    {
        "Chartres Cathedral": "chartres cathedral"
    },
    {
        " Denis": "denis"
    },
    {
        ", holding his head, over the Portal of the Virgin  ": null
    },
    {
        "Last Judgement": "last judgement"
    },
    {
        " on the central portal of west facade of ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        " Archangel Michael": "michael"
    },
    {
        " and Satan weighing souls during the ": null
    },
    {
        "Last Judgement": "last judgement"
    },
    {
        "  stryge": "strix"
    },
    {
        " on west facade of ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        " Gargoyles": "gargoyles"
    },
    {
        " were the rainspouts of ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        " Chimera": "chimera"
    },
    {
        " on ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        " Gargoyle": "gargoyle"
    },
    {
        " on ": null
    },
    {
        "Brussels Town Hall": "brussels town hall"
    },
    {
        " Siena Cathedral": "siena cathedral"
    },
    {
        " Labyrinth": "labyrinth"
    },
    {
        " at ": null
    },
    {
        "Chartres Cathedral": "chartres cathedral"
    },
    {
        "     The exteriors and interiors of Gothic cathedrals, particularly in France, were lavishly ornamented with sculpture and decoration on religious themes, designed for the great majority of parishioners who could not read. They were described as Books for the poor. To add to the effect, all of the sculpture on the facades was originally painted and gilded. Viollet-le-Duc, Eugéne, Dictionnaire Raisonné de larchitecture Française du XIe au XVI siecle, Volume 42 .     Each feature of the Cathedral had a symbolic meaning. The main portals at ": null
    },
    {
        "Notre Dame de Paris": "notre dame de paris"
    },
    {
        ", for instance, represented the entrance to paradise, with the ": null
    },
    {
        "last judgement": "last judgement"
    },
    {
        " depicted on the ": null
    },
    {
        "tympanum": "tympanum"
    },
    {
        " over the doors, showing Christ surrounded by the apostles, and by the signs of the zodiac, representing the movements of the heavens. The columns below the tympanum are in the form of statues of saints, literally reprinting them as the pillars of the church.      Each Saint had his own symbol; a winged lion stood for ": null
    },
    {
        "Saint Mark": "saint mark"
    },
    {
        "; an eagle with four wings meant ": null
    },
    {
        "Saint John the Apostle": "saint john the apostle"
    },
    {
        ", and a winged bull symbolized ": null
    },
    {
        "Saint Luke": "saint luke"
    },
    {
        ". Sculpted angels had specific functions, sometimes as heralds, blowing trumpets, or holding up columns, as guardian angels; or holding crowns of thorns or crosses, as symbols of the crucifixion of Christ, or waving a container with incense, to illustrate their function at the throne of God. Floral and vegetal decoration was also very common, representing the Garden of Eden; grapes represented the wines of ": null
    },
    {
        "Eucharist": "eucharist"
    },
    {
        ".     The ": null
    },
    {
        "tympanum": "tympanum"
    },
    {
        " over the central portal on the west facade of ": null
    },
    {
        "Notre Dame de Paris": "notre dame de paris"
    },
    {
        " vividly illustrates the ": null
    },
    {
        "Last Judgement": "last judgement"
    },
    {
        ", with figures of sinners being led off to hell, and good Christians taken to heaven. The sculpture of the right portal shows the coronation of the ": null
    },
    {
        "Virgin Mary": "virgin mary"
    },
    {
        ", and the left portal shows the lives of saints who were important to Parisians, particularly ": null
    },
    {
        "Saint Anne": "saint anne"
    },
    {
        ", the mother of the Virgin Mary.     The exteriors of cathedrals and other Gothic churches were also decorated with sculptures of a variety of fabulous and frightening ": null
    },
    {
        "grotesques": "grotesque"
    },
    {
        " or monsters. These included the ": null
    },
    {
        "chimera": "chimera"
    },
    {
        ", a mythical hybrid creature which usually had the body of a lion and the head of a goat, and the ": null
    },
    {
        "Strix": "strix"
    },
    {
        " or stryge, a creature resembling an ": null
    },
    {
        "owl": "owl"
    },
    {
        " or ": null
    },
    {
        "bat": "bat"
    },
    {
        ", which was said to eat human flesh. The strix appeared in classical Roman literature; it was described by the Roman poet ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        ", who was widely read in the Middle Ages, as a large-headed bird with transfixed eyes, rapacious beak, and greyish white wings. Frazer, James George ed., Ovid,  VI. 42–,, tr. They were part of the visual message for the illiterate worshipers, symbols of the evil and danger that threatened those who did not follow the teachings of the church.     The ": null
    },
    {
        "gargoyle": "gargoyle"
    },
    {
        "s, which were added to Notre Dame in about 42 had a more practical purpose. They were the rain spouts of the cathedral, designed to divide the torrent of water which poured from the roof after rain, and to project it outwards as far as possible from the buttresses and the walls and windows so that it would not erode the mortar binding the stone. To produce many thin streams rather than a torrent of water, a large number of gargoyles were used, so they were also designed to be a decorative element of the architecture. The rainwater ran from the roof into lead gutters, then down channels on the flying buttresses, then along a channel cut in the back of the gargoyle and out of the mouth away from the cathedral.     Many of the statues, particularly the grotesques, were removed from the facade in the 42th and 42th century, or were destroyed during the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". They were replaced with figures in the Gothic style, designed by ": null
    },
    {
        "Eugene Viollet-le-Duc": "eugene viollet-le-duc"
    },
    {
        ", during the 42th-century restoration. Similar figures appear on the other Gothic Cathedrals of France.     Another common feature of Gothic cathedrals in France was a ": null
    },
    {
        "labyrinth": "labyrinth"
    },
    {
        " or maze on the floor of the nave near the choir, which symbolized the difficult and often complicated journey of a Christian life before attaining paradise. Most labyrinths were removed by the 42th century, but a few, like the one at ": null
    },
    {
        "Amiens Cathedral": "amiens cathedral"
    },
    {
        ", have been reconstructed, and the labyrinth at ": null
    },
    {
        "Chartres Cathedral": "chartres cathedral"
    },
    {
        " still exists essentially in its original form.            FranceNormandieCoutancesCathNotreDameFacade.jpg|": null
    },
    {
        "Coutances Cathedral": "coutances cathedral"
    },
    {
        " in Normandy   P42 Bayeux cathedrale ND rwk.jpg|": null
    },
    {
        "Bayeux Cathedral": "bayeux cathedral"
    },
    {
        " in Normandy   Nef de la cathédrale dAuxerre.jpg|Interior of ": null
    },
    {
        "Auxerre Cathedral": "auxerre cathedral"
    },
    {
        " in Burgundy   Albi Sainte-Cécile.JPG|": null
    },
    {
        "Albi Cathedral": "albi cathedral"
    },
    {
        ", originally begun as a fortress, in Southwest France   Nave of the Ste Cécile Cathedral - 424242jpg|Polychrome interior of ": null
    },
    {
        "Albi Cathedral": "albi cathedral"
    },
    {
        " Toulouse Cathedral": "toulouse cathedral"
    },
    {
        "   Palmier des Jacobins.JPG|The Palm Tree of the ": null
    },
    {
        "Jacobins church": "church of the jacobins"
    },
    {
        ", 42 meters high        From the 42th century onwards, the Gothic style spread from Northern France to other regions of France and gradually to the rest of the Europe. It was often carried by the highly skilled craftsmen who had trained in the Ile-de-France and then carried their crafts to other cities. The style was adapted to local styles and materials.     In ": null
    },
    {
        "Normandy": "normandy"
    },
    {
        ", the new naves were usually very long, sometimes more than one hundred meters, and, from the long Romanesque tradition, the walls were thicker than in northern France, and had shorter buttresses. The interiors were narrower than in the north, and were given a strong sense of verticality by long and narrow bays and lancet arches. Rose windows were rare, replaced on the exterior by a large bay in tiers point. The facades had less sculptural decoration; decoration in the interior was largely in geometric forms. Norman Gothic also usually featured a profusion of towers, lanterns and spires; spires and spires sometimes were seventy meters high. ": null
    },
    {
        "Bayeux Cathedral": "bayeux cathedral"
    },
    {
        ", ": null
    },
    {
        "Rouen Cathedral": "rouen cathedral"
    },
    {
        ", and ": null
    },
    {
        "Coutances Cathedral": "coutances cathedral"
    },
    {
        " are notable examples of Norman Gothic.     In ": null
    },
    {
        "Burgundy": "burgundy"
    },
    {
        ", which had a long ": null
    },
    {
        "Romanesque style": "romanesque style"
    },
    {
        " tradition, a ": null
    },
    {
        "lantern tower": "lantern tower"
    },
    {
        " was often included, and cathedrals often had a narrow passage the length of the cathedral at the level of the stained glass windows. as in ": null
    },
    {
        "Auxerre Cathedral": "auxerre cathedral"
    },
    {
        ".     In the Southwest of France, the walls were thicker, with narrow openings, and doubled with arches. The flying buttress was rarely used, replaced by heavy abutments with chapels between.     The south of France had its own distinct variation of the Gothic style: the ": null
    },
    {
        "Southern French Gothic": "southern french gothic"
    },
    {
        ". The Gothic cathedrals were often built with brick and tile rather than stone. They generally had thick walls and narrow windows, and were braced by heavy abutments rather than flying buttresses. The form of the tower of ": null
    },
    {
        "the basilica of Saint-Sernin": "basilica of saint-sernin, toulouse"
    },
    {
        " was copied by several cathedrals in the south, while the old nave of ": null
    },
    {
        "Toulouse Cathedral": "toulouse cathedral"
    },
    {
        " gave the model of the single nave which was generally used in Southern French Gothic architecture . Some Gothic cathedrals in the Midi took unusual form; the ": null
    },
    {
        "Cathedral of Albi": "cathedral of albi"
    },
    {
        " was originally built as fortress, then converted to a cathedral. Albi Cathedral has another very distinctive feature; a colorful interior and painted ceiling. In the ": null
    },
    {
        "Jacobins church": "church of the jacobins"
    },
    {
        " of ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        ", the grafting of a single apse of polygonal plan on a church with two vessels gave birth to a starry vault whose complex organization anticipated more than a century on the flamboyant Gothic. Tradition refers to this masterpiece as palm tree , because the veins gush out of the smooth shaft of the column-like palm trees.      The facade of ": null
    },
    {
        "Toulouse Cathedral": "toulouse cathedral"
    },
    {
        " is unusual; it is the combination of two unfinished cathedral buildings, begun in the 42th century and finally put together. Toulouse Cathedral has no flying buttresses; it is supported by massive contreforts the height of the building, with chapels between.        ": null
    },
    {
        "Canterbury Cathedral": "canterbury cathedral"
    },
    {
        "  Salisbury Cathedral": "salisbury cathedral"
    },
    {
        "  York Minster": "york minster"
    },
    {
        "  Gloucester Cathedral": "gloucester cathedral"
    },
    {
        "  Henry VII Chapel": "henry vii chapel"
    },
    {
        " of ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        "        The Gothic style was imported very early into England, in part due to the close connection with the ": null
    },
    {
        "Duchy of Normandy": "duchy of normandy"
    },
    {
        ", which until 42 was still ruled by the Kings of England. The first period is generally called ": null
    },
    {
        "early English Gothic": "early english gothic"
    },
    {
        ", and was dominant from about 42 to 42 The first part of major English cathedral to feature the new style was the choir of ": null
    },
    {
        "Canterbury Cathedral": "canterbury cathedral"
    },
    {
        ", begun about 42 It was created by a French master builder, ": null
    },
    {
        "William of Sens": "william of sens"
    },
    {
        ". He added several original touches, including colored marble pavement, double columns in the arcades, and engaged slender colonettes which reached up to the vaults, borrowed from the design of ": null
    },
    {
        "Laon Cathedral": "laon cathedral"
    },
    {
        ". ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " was rebuilt from 42 to 42 ": null
    },
    {
        "Salisbury Cathedral": "salisbury cathedral"
    },
    {
        " is also a good example of early Gothic, with the exception of its tower and spire, which were added in 42     The second period of English Gothic is known as ": null
    },
    {
        "Decorated Gothic": "decorated gothic"
    },
    {
        ". It is customarily divided into two the Geometric style and the Curvilinear style , and it is similar to the French ": null
    },
    {
        "Rayonnant": "rayonnant"
    },
    {
        " style, with an emphasis on curvilinear forms, particularly in the windows. This period saw detailed stone carving reach its peak, with elaborately carved windows and ": null
    },
    {
        "capitals": "capital"
    },
    {
        ", often with floral patterns, or with an accolade, a carved arch over a window decorated with pinnacles and a ": null
    },
    {
        "fleuron": "fleuron"
    },
    {
        ", or carved floral element.     The rib vaults of the Decorated Gothic became extremely ornate, with a profusion of ribs that were purely ornamental. The vaults were often decorated with hanging stone pendants. The columns also became more ornamental, as at Peterborough Cathedral, with ribs spreading upward.     The ": null
    },
    {
        "Perpendicular Gothic": "perpendicular gothic"
    },
    {
        " was final phase of English Gothic, lasting into the 42th century. As the name suggests, its emphasis was on clear horizontal and vertical lines, meeting at right angles. Columns extended upwards all the way to the roof, giving the interior the appearance of a cage of glass and stone, as in the nave of ": null
    },
    {
        "Gloucester Cathedral": "gloucester cathedral"
    },
    {
        ". The ": null
    },
    {
        "Tudor Arch": "tudor arch"
    },
    {
        " appeared, wider and lower and often framed by moldings, which was used to create larger windows and to balance the strong vertical elements. The design of the rib vaults became even more complex, including the ": null
    },
    {
        "fan vault": "fan vault"
    },
    {
        " with pendants used in the Henry VII chapel at ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " .     A distinctive characteristic of English cathedrals is their extreme length, and their internal emphasis upon the horizontal, which may be emphasised visually as much or more than the vertical lines. Each English cathedral has an extraordinary degree of stylistic diversity, when compared with most French, German and Italian cathedrals. It is not unusual for every part of the building to have been built in a different century and in a different style, with no attempt at creating a stylistic unity. Unlike French cathedrals, English cathedrals sprawl across their sites, with double transepts projecting strongly and Lady Chapels tacked on at a later date, such as at Westminster Abbey. In the west front, the doors are not as significant as in France, the usual congregational entrance being through a side porch. The West window is very large and never a rose, which are reserved for the transept gables. The west front may have two towers like a French Cathedral, or none. There is nearly always a tower at the crossing and it may be very large and surmounted by a spire. The distinctive English east end is square, but it may take a completely different form. Both internally and externally, the stonework is often richly decorated with carvings, particularly the capitals.        ": null
    },
    {
        "Cologne Cathedral": "cologne cathedral"
    },
    {
        ", ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        " Matthias Church": "matthias church"
    },
    {
        " in ": null
    },
    {
        "Budapest": "budapest"
    },
    {
        ", ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        " Prague Cathedral": "st. vitus cathedral"
    },
    {
        ", ": null
    },
    {
        "Czech Republic": "czech republic"
    },
    {
        " St. Stephens Cathedral, Vienna": "st. stephens cathedral, vienna"
    },
    {
        ", ": null
    },
    {
        "Austria": "austria"
    },
    {
        " St. Marys Basilica, Kraków": "st. marys basilica, kraków"
    },
    {
        ", ": null
    },
    {
        "Poland": "poland"
    },
    {
        " Brabantine Gothic": "brabantine gothic"
    },
    {
        " Grote Kerk, Haarlem": "grote kerk, haarlem"
    },
    {
        " in ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        "       Between the 42th and 42th centuries, Gothic cathedrals were constructed in most of the major cities of northern Europe. For the most part, they followed the French model, but with variations depending upon local traditions and the materials available. The first Gothic churches in Germany were built from about 42 They included  Liebfrauenkirche  in ": null
    },
    {
        "Trier": "trier"
    },
    {
        ", claimed to be the oldest Gothic church in Germany,  and ": null
    },
    {
        "Freiburg Cathedral": "freiburg cathedral"
    },
    {
        ", which was built in three stages, the first beginning in 42 though only the foundations of the original cathedral still exist. It is noted for its 42-metre tower, the only Gothic church tower in Germany that was completed in the Middle Ages .     ": null
    },
    {
        "Prague": "prague"
    },
    {
        ", in the region ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        " within the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", was another flourishing center for Gothic architecture. ": null
    },
    {
        "Charles IV of Bohemia": "charles iv of bohemia"
    },
    {
        " was both King of Bohemia and Holy Roman Empire, and he had monumental tastes. He began construction of ": null
    },
    {
        "Prague": "prague"
    },
    {
        "s ": null
    },
    {
        "St. Vitus Cathedral": "st. vitus cathedral"
    },
    {
        " in the Gothic style in 42 as well as a Gothic palace, ": null
    },
    {
        "Karlstein Castle": "karlštejn"
    },
    {
        " in Central Bohemia, and Gothic buildings for the new ": null
    },
    {
        "University of Prague": "charles university"
    },
    {
        ". The nave of ": null
    },
    {
        "Prague Cathedral": "prague cathedral"
    },
    {
        " featured the filet vault, a decorative type of vault in which the ribs criss-crossed in a mesh pattern, similar to the vaults of ": null
    },
    {
        "Bristol Cathedral": "bristol cathedral"
    },
    {
        " and other English churches. His other Gothic projects included the lavishly decorated Chapel of the Holy Cross inside ": null
    },
    {
        "Karlstein Castle": "karlštejn"
    },
    {
        " , and the choir of ": null
    },
    {
        "Aachen Cathedral": "aachen cathedral"
    },
    {
        " begun in 42 which was built on the model of ": null
    },
    {
        "Sainte-Chapelle": "sainte-chapelle"
    },
    {
        " in Paris. Gothic architecture in Germany and the kingdoms of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " generally followed the French formula, but the towers were much taller and, if completed, were often surmounted by enormous openwork spires. The distinctive character of the interior of German Gothic cathedrals is their breadth and openness. German and Czech cathedrals, like the French, tend not to have strongly projecting ": null
    },
    {
        "transept": "transept"
    },
    {
        "s. There are also many ": null
    },
    {
        "hall church": "hall church"
    },
    {
        "es  without ": null
    },
    {
        "clerestory": "clerestory"
    },
    {
        " windows. ": null
    },
    {
        "Cologne Cathedral": "cologne cathedral"
    },
    {
        " is after ": null
    },
    {
        "Milan Cathedral": "milan cathedral"
    },
    {
        " the largest Gothic cathedral in the world. Construction began in 42 and took, with interruptions, until 42 to complete  – a period of over 42 years. It is 42 metres long, 42  m wide and its two towers are 42  m tall.      ": null
    },
    {
        "Brick Gothic": "brick gothic"
    },
    {
        "  is a specific style common in ": null
    },
    {
        "Northern Europe": "northern europe"
    },
    {
        ", especially in Northern Germany, Poland and in the regions around the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " without natural rock resources. Prime examples of brick gothic include ": null
    },
    {
        "St. Marys Church, Gdańsk": "st. marys church, gdańsk"
    },
    {
        " ,  ": null
    },
    {
        "St. Marys Basilica, Kraków": "st. marys basilica, kraków"
    },
    {
        " and ": null
    },
    {
        "Malbork Castle": "malbork castle"
    },
    {
        " .     ": null
    },
    {
        "St. Stephens Cathedral, Vienna": "st. stephens cathedral, vienna"
    },
    {
        " has the distinctive feature of a polychrome roof. Another regional variation is the ": null
    },
    {
        "Brabantine Gothic": "brabantine gothic"
    },
    {
        " a style found in Belgium and the Netherlands. It is characterized by using light-colored ": null
    },
    {
        "sandstone": "sandstone"
    },
    {
        " or limestone, which allowed rich detailing but was prone to erosion. Features included columns with sculpted cabbage-like foliage, arched windows whose points came right up into the vaults. and, sometimes, a wooden ceiling. Examples include ": null
    },
    {
        "Grote Kerk, Haarlem": "grote kerk, haarlem"
    },
    {
        ", in ": null
    },
    {
        "Haarlem": "haarlem"
    },
    {
        ", the Netherlands, originally built as a Catholic Cathedral, now a Protestant church, and the ": null
    },
    {
        "Church of Our Blessed Lady of the Sablon": "church of our blessed lady of the sablon"
    },
    {
        " in Brussels .          ": null
    },
    {
        "León Cathedral": "león cathedral"
    },
    {
        " Toledo Cathedral": "toledo cathedral"
    },
    {
        " Burgos Cathedral": "burgos cathedral"
    },
    {
        " Valencia Cathedral": "valencia cathedral"
    },
    {
        " Seville Cathedral": "seville cathedral"
    },
    {
        " Evora Cathedral": "evora cathedral"
    },
    {
        ", ": null
    },
    {
        "Évora": "évora"
    },
    {
        " Évora Cathedral": "évora cathedral"
    },
    {
        ", Portugal, leads to a ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        " chapel       Strikingly different variations of the Gothic style appeared in southern Europe, particularly in Spain and Portugal. Important examples of Spanish Gothic include ": null
    },
    {
        "Toledo Cathedral": "toledo cathedral"
    },
    {
        ", ": null
    },
    {
        "León Cathedral": "león cathedral"
    },
    {
        ", and ": null
    },
    {
        "Burgos Cathedral": "burgos cathedral"
    },
    {
        ".   The distinctive characteristic of Gothic cathedrals of the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " is their spatial complexity, with many areas of different shapes leading from each other. They are comparatively wide, and often have very tall arcades surmounted by low clerestories, giving a similar spacious appearance to the Hallenkirche of Germany, as at the Church of the ": null
    },
    {
        "Batalha Monastery": "batalha monastery"
    },
    {
        " in Portugal. Many of the cathedrals are completely surrounded by chapels. Like English cathedrals, each is often stylistically diverse. This expresses itself both in the addition of chapels and in the application of decorative details drawn from different sources. Among the influences on both decoration and form are ": null
    },
    {
        "Islamic architecture": "islamic architecture"
    },
    {
        " and, towards the end of the period, Renaissance details combined with the Gothic in a distinctive manner. The West front, as at ": null
    },
    {
        "Leon Cathedral": "leon cathedral"
    },
    {
        ", typically resembles a French west front, but wider in proportion to height and often with greater diversity of detail and a combination of intricate ornament with broad plain surfaces. At ": null
    },
    {
        "Burgos Cathedral": "burgos cathedral"
    },
    {
        " there are spires of German style. The roofline often has pierced parapets with comparatively few pinnacles. There are often towers and domes of a great variety of shapes and structural invention rising above the roof. ": null
    },
    {
        "Church of San Pablo": "church of san pablo, valladolid"
    },
    {
        " in ": null
    },
    {
        "Valladolid": "valladolid"
    },
    {
        " is an outstanding example of construction that combines the ": null
    },
    {
        "Isabelline Gothic": "isabelline gothic"
    },
    {
        " style with the ": null
    },
    {
        "Renaissance architecture": "renaissance architecture"
    },
    {
        ".     In the territories under the ": null
    },
    {
        "Crown of Aragon": "crown of aragon"
    },
    {
        " , the Gothic style suppressed the ": null
    },
    {
        "transept": "transept"
    },
    {
        " and made the ": null
    },
    {
        "side-aisles": "aislechurch architecture"
    },
    {
        " almost as high as the main nave, creating wider spaces, and with few ornaments. There are two different Gothic styles in the Aragonese lands: ": null
    },
    {
        "Catalan Gothic": "catalan gothic"
    },
    {
        " and ": null
    },
    {
        "Valencian Gothic": "valencian gothic"
    },
    {
        ", which are different from those in the ": null
    },
    {
        "Kingdom of Castile": "kingdom of castile"
    },
    {
        " and France.     The most important samples of Catalan Gothic style are the cathedrals of ": null
    },
    {
        "Girona": "girona"
    },
    {
        ", ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ", ": null
    },
    {
        "Perpignan": "perpignan"
    },
    {
        " and ": null
    },
    {
        "Palma": "palma, majorca"
    },
    {
        " , the basilica of ": null
    },
    {
        "Santa Maria del Mar": "santa maria del mar, barcelona"
    },
    {
        " , the ": null
    },
    {
        "Basílica del Pi": "santa maria del pi, barcelona"
    },
    {
        " , and the church of ": null
    },
    {
        "Santa Maria de lAlba": "santa maria, manresa"
    },
    {
        " in ": null
    },
    {
        "Manresa": "manresa"
    },
    {
        ".     The most important examples of Valencian Gothic style in the old ": null
    },
    {
        "Kingdom of Valencia": "kingdom of valencia"
    },
    {
        " are the ": null
    },
    {
        "Valencia Cathedral": "valencia cathedral"
    },
    {
        ", ": null
    },
    {
        "Llotja de la Seda": "llotja de la seda"
    },
    {
        " , ": null
    },
    {
        "Torres de Serranos": "torres de serranos"
    },
    {
        ", Torres de Quart, ": null
    },
    {
        "Monastery of Sant Jeroni de Cotalba": "monastery of sant jeroni de cotalba"
    },
    {
        ", in ": null
    },
    {
        "Alfauir": "alfauir"
    },
    {
        ", ": null
    },
    {
        "Palace of the Borgias": "palace of the borgias"
    },
    {
        " in ": null
    },
    {
        "Gandia": "gandia"
    },
    {
        ", ": null
    },
    {
        "Monastery of Santa María de la Valldigna": "monastery of santa maría de la valldigna"
    },
    {
        ", ": null
    },
    {
        "Basilica of Santa Maria": "basilica of santa maria, alicante"
    },
    {
        ", in ": null
    },
    {
        "Alicante": "alicante"
    },
    {
        ", ": null
    },
    {
        "Orihuela Cathedral": "orihuela cathedral"
    },
    {
        ", ": null
    },
    {
        "Castelló Cathedral": "castelló cathedral"
    },
    {
        " and ": null
    },
    {
        "El Fadrí": "el fadrí"
    },
    {
        ", ": null
    },
    {
        "Segorbe Cathedral": "segorbe cathedral"
    },
    {
        ", etc.        ": null
    },
    {
        "Siena Cathedral": "siena cathedral"
    },
    {
        " Siena Cathedral": "siena cathedral"
    },
    {
        " Orvieto Cathedral": "orvieto cathedral"
    },
    {
        " Orvieto Cathedral": "orvieto cathedral"
    },
    {
        " Florence Cathedral": "florence cathedral"
    },
    {
        " Pisa Cathedral": "pisa cathedral"
    },
    {
        ", by ": null
    },
    {
        "Giovanni Pisano": "giovanni pisano"
    },
    {
        " Santa Maria della Spina": "santa maria della spina"
    },
    {
        " Milan Cathedral": "milan cathedral"
    },
    {
        " Doges Palace": "doges palace"
    },
    {
        "       Italian Gothic architecture": "italian gothic architecture"
    },
    {
        " went its own particular way, departing from the French model. It was influenced by other styles, notably the ": null
    },
    {
        "Byzantine style": "byzantine style"
    },
    {
        " introduced in ": null
    },
    {
        "Ravenna": "ravenna"
    },
    {
        ". Major examples include ": null
    },
    {
        "Milan Cathedral": "milan cathedral"
    },
    {
        ", the ": null
    },
    {
        "Orvieto Cathedral": "orvieto cathedral"
    },
    {
        ", and particularly ": null
    },
    {
        "Florence Cathedral": "florence cathedral"
    },
    {
        ", before the addition of the Duomo in the Renaissance.     The Italian style was influenced by the materials available in the different regions; ": null
    },
    {
        "marble": "marble"
    },
    {
        " was available in great quantities in ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        ", and was lavishly used in churches; it was scarce in ": null
    },
    {
        "Lombardy": "lombardy"
    },
    {
        ", and brick was used instead. But many of the architectural elements were used apparently mainly to be different from the French style.     The ": null
    },
    {
        "Cistercian": "cistercian"
    },
    {
        " monastic order introduced some of the first Gothic churches into Italy, in ": null
    },
    {
        "Fossanova Abbey": "fossanova abbey"
    },
    {
        " and the ": null
    },
    {
        "Casamari Abbey": "casamari abbey"
    },
    {
        " . They followed the basic plan of the Gothic Cistercian churches of ": null
    },
    {
        "Burgundy": "burgundy"
    },
    {
        ", particularly ": null
    },
    {
        "Cîteaux Abbey": "cîteaux abbey"
    },
    {
        ".     The Italian plan is usually regular and symmetrical, Italian cathedrals have few and widely spaced columns. The proportions are generally mathematically equilibrated, based on the square and the concept of armonìa , and except in Venice where they loved flamboyant arches, the arches are almost always equilateral. Italian Gothic cathedrals often retained Romanesque features; the nave of ": null
    },
    {
        "Orvieto Cathedral": "orvieto cathedral"
    },
    {
        " had Romanesque arches and vaults.     Italian Cathedrals also offered a variety of plans; ": null
    },
    {
        "Florence Cathedral": "florence cathedral"
    },
    {
        " had a rectangular choir, based on the Cistercian model, but was designed to have three wings with polygonal chapels. Italian Gothic cathedrals were generally not as tall as those in France; they rarely used flying buttresses, and generally had only two levels, an arcade and a claire-voie with small windows; but ": null
    },
    {
        "Bologna Cathedral": "bologna cathedral"
    },
    {
        " , rivaled ": null
    },
    {
        "Bourges Cathedral": "bourges cathedral"
    },
    {
        " in France in height. The smallest notable Italian Gothic church is ": null
    },
    {
        "Santa Maria della Spina": "santa maria della spina"
    },
    {
        " in ": null
    },
    {
        "Pisa": "pisa"
    },
    {
        " , which resembles a Gothic jewel box.     A distinctive characteristic of Italian Gothic is the use of polychrome decoration, both externally as marble veneer on the brick façade and internally where the arches are often made of alternating black and white segments. The columns were sometimes painted red, and the walls were decorated with frescoes and the apse with mosaic. Italian cathedral façades are often polychrome and may include mosaics in the lunettes over the doors. The façades have projecting open porches and ocular or wheel windows rather than roses, and do not usually have a tower. The crossing is usually surmounted by a dome. There is often a free-standing tower and baptistery. The eastern end usually has an apse of comparatively low projection. The windows are not as large as in northern Europe and, although stained glass windows are often found, the favourite narrative medium for the interior is the ": null
    },
    {
        "fresco": "fresco"
    },
    {
        ". The facade of ": null
    },
    {
        "Orvieto Cathedral": "orvieto cathedral"
    },
    {
        ", begun in 42 is a striking example of mosaic decoration. Another innovation of Italian Gothic is the bronze doorway covered with sculpture; the most famous examples are the doors of the Baptistry of Florence, by ": null
    },
    {
        "Andrea Pisano": "andrea pisano"
    },
    {
        " .     Italian Gothic cathedrals did not have the elaborate sculptural tympanums over the entrances of French cathedrals, but they had abundant realistic sculptural decoration. Some of the finest work was done by ": null
    },
    {
        "Nicola Pisano": "nicola pisano"
    },
    {
        " at the Baptistery of ": null
    },
    {
        "Pisa Cathedral": "pisa cathedral"
    },
    {
        " , and in ": null
    },
    {
        "Siena Cathedral": "siena cathedral"
    },
    {
        "; and by his son ": null
    },
    {
        "Giovanni Pisano": "giovanni pisano"
    },
    {
        " on the west facade of Pisa Cathedral .        ": null
    },
    {
        "Basilica Cathedral of Santa María la Menor": "basilica cathedral of santa maría la menor"
    },
    {
        " Mexico City Metropolitan Cathedral": "mexico city metropolitan cathedral"
    },
    {
        " Palace of Cortés": "palace of cortés, cuernavaca"
    },
    {
        " in Cuernavaca, Mexico, this palace has a style that blends Gothic and ": null
    },
    {
        "Mudéjar": "mudéjar art"
    },
    {
        " San Gabriel Franciscan Convent": "san gabriel franciscan convent, cholula"
    },
    {
        " in ": null
    },
    {
        "Cholula": "cholula, puebla"
    },
    {
        " Convent of San Mateo Apóstol y Evangelista": "earliest 16th-century monasteries on the slopes of popocatépetl"
    },
    {
        "  in ": null
    },
    {
        "Atlatlahucan": "atlatlahucan"
    },
    {
        ", Mexico, is a late-Gothic ": null
    },
    {
        "Plateresque": "plateresque"
    },
    {
        " church that is a ": null
    },
    {
        "World Heritage Site": "world heritage site"
    },
    {
        " by ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        "     There are late-Gothic architecture from the era in some of the oldest Christian churches built in the Americas. Few examples can be mentioned as the ": null
    },
    {
        "Basilica Cathedral of Santa María la Menor": "basilica cathedral of santa maría la menor"
    },
    {
        " in ": null
    },
    {
        "Santo Domingo": "santo domingo"
    },
    {
        " built between 4242 the building is mainly Gothic  and is the oldest cathedral in the Americas;  and the ": null
    },
    {
        "Mexico City Metropolitan Cathedral": "mexico city metropolitan cathedral"
    },
    {
        ", started to built in 42  which retains Gothic elements as the two ": null
    },
    {
        "vaults": "vault"
    },
    {
        " of the ": null
    },
    {
        "sacristy": "sacristy"
    },
    {
        " and the vaults covering the ": null
    },
    {
        "chapter house": "chapter house"
    },
    {
        ";  Other example is the ": null
    },
    {
        "San Gabriel Franciscan Convent": "san gabriel franciscan convent, cholula"
    },
    {
        " in ": null
    },
    {
        "Cholula": "cholula, puebla"
    },
    {
        ", ": null
    },
    {
        "Metropolitan area of Puebla": "metropolitan area of puebla"
    },
    {
        ", Mexico, the exterior and interior are partially Gothic   although the tower is Baroque, was built between 42s42s. In the field of the Civil Gothic architecture, a notable example is the ": null
    },
    {
        "Palace of Cortés": "palace of cortés, cuernavaca"
    },
    {
        " in ": null
    },
    {
        "Cuernavaca": "cuernavaca"
    },
    {
        ", Mexico, built between 4242  is the oldest conserved Colonial-era civil structure in the continental Americas, the palace has a style that blends Gothic and ": null
    },
    {
        "Mudéjar": "mudéjar art"
    },
    {
        ".      There is also many late-Gothic ": null
    },
    {
        "Plateresque": "plateresque"
    },
    {
        " architecture throughout Mexican territory. Also, there are several churches of the ": null
    },
    {
        "World Heritage Site": "world heritage site"
    },
    {
        " by UNESCO with the name ": null
    },
    {
        "Earliest 42th-century monasteries on the slopes of Popocatépetl": "earliest 16th-century monasteries on the slopes of popocatépetl"
    },
    {
        " that are Plateresque Gothics.  ": null
    },
    {
        "Abbey of Saint-Ouen": "church of st. ouen, rouen"
    },
    {
        ", ": null
    },
    {
        "Rouen": "rouen"
    },
    {
        " Mont Saint Michel Abbey": "mont saint michel abbey"
    },
    {
        " Abbey of Saint-Remi": "abbey of saint-remi"
    },
    {
        ", ": null
    },
    {
        "Reims": "reims"
    },
    {
        " Batalha Monastery": "batalha monastery"
    },
    {
        ", Portugal       While cathedrals were the most prominent structures in the Gothic style, Gothic features were also built for many monasteries across Europe. Prominent examples were built by the ": null
    },
    {
        "Benedictines": "benedictine order"
    },
    {
        " in England, France, and Normandy. They were the builders of the ": null
    },
    {
        "Abbey of St Denis": "basilica of st denis"
    },
    {
        ", and ": null
    },
    {
        "Abbey of Saint-Remi": "abbey of saint-remi"
    },
    {
        " in ": null
    },
    {
        "France": "france"
    },
    {
        ". Later Benedictine projects include ": null
    },
    {
        "Rouen": "rouen"
    },
    {
        "s ": null
    },
    {
        "Abbey of Saint-Ouen": "church of st. ouen, rouen"
    },
    {
        ", the Abbey ": null
    },
    {
        "La Chaise-Dieu": "la chaise-dieu"
    },
    {
        ", and the choir of ": null
    },
    {
        "Mont Saint-Michel": "mont saint-michel"
    },
    {
        " in France.     English examples are ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        ", originally built as a ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " order monastic church; and the reconstruction of ": null
    },
    {
        "the Benedictine church at": "canterbury cathedral"
    },
    {
        " Canterbury": "canterbury"
    },
    {
        ". The ": null
    },
    {
        "Cistercians": "cistercian order"
    },
    {
        " spread the style as far east and south as ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ". Smaller orders such as the ": null
    },
    {
        "Carthusians": "carthusian order"
    },
    {
        " and ": null
    },
    {
        "Premonstratensians": "premonstratensians"
    },
    {
        " also built some 42 churches, usually near cities. The ": null
    },
    {
        "Franciscans": "franciscans"
    },
    {
        " and ": null
    },
    {
        "Dominicans": "dominican order"
    },
    {
        " also carried out a transition to Gothic in the 42th and 42th centuries. The ": null
    },
    {
        "Teutonic Order": "teutonic order"
    },
    {
        ", a military order, spread Gothic art into ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        ", ": null
    },
    {
        "East Prussia": "east prussia"
    },
    {
        ", and the Baltic region.     The earliest example of Gothic architecture in Germany is ": null
    },
    {
        "Maulbronn Monastery": "maulbronn monastery"
    },
    {
        ", a Romanesque ": null
    },
    {
        "Cistercian": "cistercian"
    },
    {
        " abbey in southwest Germany whose ": null
    },
    {
        "narthex": "narthex"
    },
    {
        " was built in the early 42th century by an anonymous architect.     ": null
    },
    {
        "Batalha Monastery": "batalha monastery"
    },
    {
        " is a Dominican monastery in ": null
    },
    {
        "Batalha, Portugal": "batalha, portugal"
    },
    {
        ". The monastery was built in the ": null
    },
    {
        "Flamboyant Gothic": "flamboyant gothic"
    },
    {
        " style to thank the ": null
    },
    {
        "Virgin Mary": "virgin mary"
    },
    {
        " for the Portuguese victory over the ": null
    },
    {
        "Kingdom of Castile": "kingdom of castile"
    },
    {
        " in the ": null
    },
    {
        "Battle of Aljubarrota": "battle of aljubarrota"
    },
    {
        " Palais de la Cité": "palais de la cité"
    },
    {
        " in Paris which included the royal residence and later ": null
    },
    {
        "Sainte-Chapelle": "sainte-chapelle"
    },
    {
        " Conciergerie": "conciergerie"
    },
    {
        " Palais des Papes": "palais des papes"
    },
    {
        " in ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        " Brussels Town Hall": "brussels town hall"
    },
    {
        " Doges Palace": "doges palace"
    },
    {
        " Silk Exchange": "llotja de la seda"
    },
    {
        " in ": null
    },
    {
        "Valencia": "valencia"
    },
    {
        " Silk Exchange": "llotja de la seda"
    },
    {
        " in ": null
    },
    {
        "Valencia": "valencia"
    },
    {
        " Palace of the Kings of Navarre": "palace of the kings of navarre of olite"
    },
    {
        " in ": null
    },
    {
        "Olite": "olite"
    },
    {
        " Palau de la Generalitat": "palau de la generalitat"
    },
    {
        " in ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        " Vladislav Hall": "vladislav hall"
    },
    {
        " in ": null
    },
    {
        "Prague": "prague"
    },
    {
        ", ": null
    },
    {
        "Czech Rep.": "czech rep."
    },
    {
        " Hampton Court Palace": "hampton court palace"
    },
    {
        " in ": null
    },
    {
        "England": "england"
    },
    {
        "          The Gothic style appeared in palaces in France, including the Papal Palace in Avignon and the ": null
    },
    {
        "Palais de la Cité": "palais de la cité"
    },
    {
        " in Paris, close to ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        ", begun in 42 which was the principal residence of the French Kings until 42 Most of the Palais de la Cité is gone, but two of the original towers along the Seine, of the towers, the vaulted ceilings of the Hall of the Men-at-Arms , ": null
    }
]