[
    {
        "                      The Government of Ireland Act 42 was an ": null
    },
    {
        "Act": "act of parliament"
    },
    {
        " of the ": null
    },
    {
        "Parliament of the United Kingdom": "parliament of the united kingdom"
    },
    {
        ". The Acts ": null
    },
    {
        "long title": "long title"
    },
    {
        " was An Act to provide for the better government of Ireland ; it is also known as the Fourth Home Rule Bill or as the Fourth Home Rule Act.     The Act was intended to establish separate ": null
    },
    {
        "Home Rule": "home rule"
    },
    {
        " institutions within two new subdivisions of Ireland: the six north-eastern counties were to form ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        " , while the larger part of the country was to form ": null
    },
    {
        "Southern Ireland": "southern ireland"
    },
    {
        " . Both areas of Ireland were to continue as a part of the ": null
    },
    {
        "United Kingdom of Great Britain and Ireland": "united kingdom of great britain and ireland"
    },
    {
        ", and provision was made for their future reunification under common Home Rule institutions.     Home Rule never took effect in Southern Ireland, due to the ": null
    },
    {
        "Irish War of Independence": "irish war of independence"
    },
    {
        ", which resulted instead in the ": null
    },
    {
        "Anglo-Irish Treaty": "anglo-irish treaty"
    },
    {
        " and the establishment in 42 of the ": null
    },
    {
        "Irish Free State": "irish free state"
    },
    {
        ". However, the institutions set up under this Act for Northern Ireland continued to function until they were ": null
    },
    {
        "suspended by the British parliament in 42": "northern ireland  act 1972"
    },
    {
        " as a consequence of ": null
    },
    {
        "the Troubles": "the troubles"
    },
    {
        ".     The remaining provisions of the Act still in force in Northern Ireland were repealed under the terms of the 42 ": null
    },
    {
        "Good Friday Agreement": "good friday agreement"
    },
    {
        ".             Various attempts had been made to give Ireland limited regional ": null
    },
    {
        "self-government": "devolution in the united kingdom"
    },
    {
        ", known as ": null
    },
    {
        "Home rule": "home rule"
    },
    {
        ", in the late 42th and early 42th centuries.     The ": null
    },
    {
        "First Home Rule Bill": "government of ireland bill 1886"
    },
    {
        " of 42 was defeated in the ": null
    },
    {
        "House of Commons": "house of commons of the united kingdom"
    },
    {
        " because of ": null
    },
    {
        "a split in the Liberal Party": "liberal party the gladstonian era"
    },
    {
        " over the principle of Home Rule, while the ": null
    },
    {
        "Second Home Rule Bill": "government of ireland bill 1893"
    },
    {
        " of 42 having been passed by the Commons was vetoed by the ": null
    },
    {
        "House of Lords": "house of lords"
    },
    {
        ". The ": null
    },
    {
        "Third Home Rule Bill": "government of ireland act 1914"
    },
    {
        " introduced in 42 by the ": null
    },
    {
        "Irish Parliamentary Party": "irish parliamentary party"
    },
    {
        " could no longer be vetoed after the passing of the ": null
    },
    {
        "Parliament Act 42": "parliament act 1911"
    },
    {
        " which removed the power of the Lords to veto bills. They could merely be delayed for two years.     Because of the continuing threat of civil war in Ireland, King ": null
    },
    {
        "George V": "george v of the united kingdom"
    },
    {
        " called the ": null
    },
    {
        "Buckingham Palace Conference": "buckingham palace conference"
    },
    {
        " in July 42 where Irish Nationalist and Unionist leaders failed to reach agreement. Controversy continued over the rival demands of Irish Nationalists, backed by the Liberals , and Irish Unionists, backed by the Conservatives, for the exclusion of most or all of the province of ": null
    },
    {
        "Ulster": "ulster"
    },
    {
        ". In an attempt at compromise, the British government put forward an amending bill, which would have allowed for Ulster to be temporarily excluded from the working of the Act; this failed to satisfy either side, and the stalemate continued until overtaken by the outbreak of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". A few weeks after the British entry into the war, the Act received ": null
    },
    {
        "Royal Assent": "royal assent"
    },
    {
        ", while the amending bill was abandoned. However, the ": null
    },
    {
        "Suspensory Act 42": "suspensory act 1914"
    },
    {
        " meant that implementation would be suspended for the duration of what was expected to be only a short European war.          A delay ensued because of the effective end of the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        " in November 42 the ": null
    },
    {
        "Paris Peace Conference, 42": "paris peace conference, 1919"
    },
    {
        ", and the ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        " that was signed in June 42 Starting in September 42 with the British Government, now led by ": null
    },
    {
        "David Lloyd George": "david lloyd george"
    },
    {
        ", committed under all circumstances to implementing Home Rule, the British cabinets Committee for Ireland, under the chairmanship of former ": null
    },
    {
        "Ulster Unionist Party": "ulster unionist party"
    },
    {
        " leader ": null
    },
    {
        "Walter Long": "walter long, 1st viscount long"
    },
    {
        ", pushed for a radical new solution. Long proposed the creation of two Irish home rule entities, ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        " and ": null
    },
    {
        "Southern Ireland": "southern ireland"
    },
    {
        ", each with ": null
    },
    {
        "unicameral": "unicameral"
    },
    {
        " parliaments. The House of Lords accordingly amended the old Bill to create a new Bill which provided for two ": null
    },
    {
        "bicameral": "bicameral"
    },
    {
        " parliaments, consisting of His Majesty, the Senate of Ireland, and the House of Commons of Ireland.     The Bills second reading debates in late March 42 revealed that already a large number of Irish members of parliament present felt that the proposals were unworkable.       After considerable delays in debating the financial aspects of the measure, the substantive third reading of the Bill was approved by a large majority on 42 November 42 A considerable number of the Irish Members present voted against the Bill, including ": null
    },
    {
        "Southern Unionists": "irish unionist alliancesouthern unionists"
    },
    {
        " such as ": null
    },
    {
        "Maurice Dockrell": "maurice dockrell"
    },
    {
        ", and Nationalists like ": null
    },
    {
        "Joe Devlin": "joseph devlin"
    },
    {
        ".  .       During the Great War Irish politics moved decisively in a different direction. Several events, including the ": null
    },
    {
        "Easter Rising": "easter rising"
    },
    {
        " of 42 the subsequent reaction of the British Government, and the ": null
    },
    {
        "Conscription Crisis of 42": "conscription crisis of 1918"
    },
    {
        ", had utterly altered the state of Irish Politics, and made ": null
    },
    {
        "Sinn Féin": "sinn féin"
    },
    {
        " the dominant voice of ": null
    },
    {
        "Irish nationalism": "irish nationalism"
    },
    {
        ". Sinn Féin, standing for an independent sovereign Ireland, won 42 of the 42 parliamentary seats on the island in the ": null
    },
    {
        "42 general election": "1918 united kingdom general election"
    },
    {
        ". Its elected members established their own parliament, ": null
    },
    {
        "Dáil Éireann": "first dáil"
    },
    {
        ", which ": null
    },
    {
        "declared the countrys independence": "irish declaration of independence"
    },
    {
        " as the ": null
    },
    {
        "Irish Republic": "irish republic"
    },
    {
        ". Dáil Éireann, after a number of meetings, was declared illegal in September 42 by the ": null
    },
    {
        "Lord Lieutenant of Ireland": "lord lieutenant of ireland"
    },
    {
        ".     Also for a variety of reasons all the Ulster Unionist MPs at Westminster voted against the Act. They preferred that all or most of Ulster would remain fully within the United Kingdom, accepting the proposed northern Home Rule state only as the second best option.     Thus, when the Act became law on 42 December 42 it was already out of touch with realities in Ireland. The long-standing demand for home rule had been replaced among Nationalists by a demand for complete independence. The Republics ": null
    },
    {
        "army": "irish republican army"
    },
    {
        " was waging the ": null
    },
    {
        "Irish War of Independence": "irish war of independence"
    },
    {
        " against British rule, which had reached a nadir in late 42       The Act ": null
    },
    {
        "divided Ireland into two territories": "partition of ireland"
    },
    {
        ", ": null
    },
    {
        "Southern Ireland": "southern ireland"
    },
    {
        " and ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        ", each intended to be self-governing, except in areas specifically reserved to the ": null
    },
    {
        "Parliament of the United Kingdom": "parliament of the united kingdom"
    },
    {
        ": chief amongst these were matters relating to the Crown, to defence, foreign affairs, international trade, and currency.     Southern Ireland was to be all of Ireland except for the parliamentary counties of ": null
    },
    {
        "Antrim": "county antrim"
    },
    {
        ", ": null
    },
    {
        "Armagh": "county armagh"
    },
    {
        ", ": null
    },
    {
        "Down": "county down"
    },
    {
        ", ": null
    },
    {
        "Fermanagh": "county fermanagh"
    },
    {
        ", ": null
    },
    {
        "Londonderry": "county londonderry"
    },
    {
        " and ": null
    },
    {
        "Tyrone": "county tyrone"
    },
    {
        ", and the parliamentary boroughs of ": null
    },
    {
        "Belfast": "belfast"
    },
    {
        " and ": null
    },
    {
        "Londonderry": "londonderry"
    },
    {
        " which were to constitute ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        " . Northern Ireland as defined by the Act, amounting to six of the nine counties of ": null
    },
    {
        "Ulster": "ulster"
    },
    {
        ", was seen as the maximum area within which ": null
    },
    {
        "Unionists": "unionists"
    },
    {
        " could be expected to have a safe majority. This was in spite of the fact that counties ": null
    },
    {
        "Fermanagh": "county fermanagh"
    },
    {
        " and ": null
    },
    {
        "Tyrone": "county tyrone"
    },
    {
        " had Catholic Nationalist majorities.         At the apex of the governmental system was to be the ": null
    },
    {
        "Lord Lieutenant of Ireland": "lord lieutenant of ireland"
    },
    {
        ", who would be the Monarchs representative in both of the Irish home rule regions. The system was based on colonial constitutional theories. ": null
    },
    {
        "Executive authority": "executive authority"
    },
    {
        " was to be vested in the crown, and in theory not answerable to either parliament. The Lord Lieutenant would appoint a cabinet that did not need parliamentary support. No provision existed for a prime minister.     Such structures matched the theory in the ": null
    },
    {
        "British dominions": "british dominions"
    },
    {
        ", such as Canada and Australia, where in powers belonged to the ": null
    },
    {
        "governor-general": "governor-general"
    },
    {
        " and there was no normal responsibility to parliament. In reality, governments had long come to be chosen from parliament and to be answerable to it. Prime ministerial offices had come into de facto existence. A prime minister of Canada had come into existence within a decade of colonial rule in Canada, while in Australia a prime minister appeared in the system of government from the moment the Federal Commonwealth of Australia came into being in 42 Such developments were also expected to happen in Northern Ireland and Southern Ireland, but technically were not required under the Act.         As well as sharing the same ": null
    },
    {
        "viceroy": "lord lieutenant of ireland"
    },
    {
        ", a ": null
    },
    {
        "Council of Ireland": "council of ireland"
    },
    {
        " was envisaged to co-ordinate matters of common concern to the two parliaments, with each parliament possessing the ability, in identical motions, to vote powers to the Council, which Britain intended should evolve into a single Irish parliament.   Both parts of Ireland would continue to send a number of ": null
    },
    {
        "MP": "member of parliamentunited kingdom"
    },
    {
        "s to the ": null
    },
    {
        "Westminster Parliament": "parliament of the united kingdom"
    },
    {
        ". ": null
    },
    {
        "Elections for both lower houses": "1921 irish elections"
    },
    {
        " took place in May 42           The ": null
    },
    {
        "Parliament of Northern Ireland": "parliament of northern ireland"
    },
    {
        " came into being in June 42 At its inauguration, in ": null
    },
    {
        "Belfast City Hall": "belfast city hall"
    },
    {
        ", ": null
    },
    {
        "King George V": "george v of the united kingdom"
    },
    {
        " made a famous appeal for Anglo-Irish and north–south reconciliation. The speech, drafted by the government of ": null
    },
    {
        "David Lloyd George": "david lloyd george"
    },
    {
        " on recommendations from ": null
    },
    {
        "Jan Smuts": "jan smuts"
    },
    {
        " Jan Smuts was one of the best Boer commanders of the ": null
    },
    {
        "Second Boer War": "second boer war"
    },
    {
        ". His deep Commando raids into ": null
    },
    {
        "Cape Province": "cape province"
    },
    {
        " caused considerable embarrassment and difficulties for the British Army. After the war he decided that his future and that of South Africa lay in reconciliation between ": null
    },
    {
        "Afrikaner": "afrikaner"
    },
    {
        " and the British. In 42 at the start of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " the Boer bitter enders rose against the government in the ": null
    },
    {
        "Boer Revolt": "boer revolt"
    },
    {
        " and allied themselves with their old supporter Germany. General Smuts played an important part in crushing the rebellion and defeating the Germans in Africa, before fighting on the ": null
    },
    {
        "Western Front": "western front"
    },
    {
        ". The South African establishment, of which Smuts was a part, in contrast to the British establishment in 42 was lenient to the leaders of the revolt, who were fined and spent two years in prison. After this revolt and lenient treatment the bitter enders contented themselves with working within the system. It was his experience of the Boer–British rapprochement which he was able to bring to the attention of the British government as an alternative to confrontation. Prime Minister of the ": null
    },
    {
        "Union of South Africa": "union of south africa"
    },
    {
        ", with the enthusiastic backing of the King, opened the door for formal contact between the ": null
    },
    {
        "British Government": "british government"
    },
    {
        " and the ": null
    },
    {
        "Republican": "irish republicanism"
    },
    {
        " administration of ": null
    },
    {
        "Éamon de Valera": "éamon de valera"
    },
    {
        ".     Though it was superseded in large part, its repeal remained a matter of controversy until accomplished in the 42s . Alvin Jackson, Home Rule – An Irish History, Oxford University Press, 42 pp4242       All 42 MPs elected to the ": null
    },
    {
        "House of Commons of Southern Ireland": "house of commons of southern ireland"
    },
    {
        " in the ": null
    },
    {
        "May 42 elections": "1921 irish elections"
    },
    {
        " were returned unopposed, and 42 of them, representing ": null
    },
    {
        "Sinn Féin": "sinn féin"
    },
    {
        ", declared themselves ": null
    },
    {
        "TD": "teachta dála"
    },
    {
        "s  and assembled as the ": null
    },
    {
        "Second Dáil": "second dáil"
    },
    {
        " of the ": null
    },
    {
        "Irish Republic": "irish republic"
    },
    {
        ".     With only the four Unionist MPs and 42 appointed senators turning up for the state opening of the ": null
    },
    {
        "Parliament of Southern Ireland": "parliament of southern ireland"
    },
    {
        " at the Royal College of Science in Dublin  in June 42 the new legislature was suspended. Southern Ireland was ruled, for the time being, directly from London as it had been before the Government of Ireland Act.     The ": null
    },
    {
        "Provisional Government of the Irish Free State": "provisional government of the irish free state"
    },
    {
        " was constituted on 42 January 42 “at a meeting of members of the Parliament elected for constituencies in Southern Ireland . That meeting was not convened as a meeting of the ": null
    },
    {
        "House of Commons of Southern Ireland": "house of commons of southern ireland"
    },
    {
        " nor as a meeting of the ": null
    },
    {
        "Dáil": "dáil"
    },
    {
        ". Instead, it was convened by ": null
    },
    {
        "Arthur Griffith": "arthur griffith"
    },
    {
        " as “Chairman of the Irish Delegation of Plenipotentiaries   under the terms of the Treaty. This followed discussions between the Irish Treaty delegation and the British Government over who had authority to convene the meeting .     ": null
    },
    {
        "Elections in June 42": "1922 irish general election"
    },
    {
        " were followed by the meeting of the ": null
    },
    {
        "Third Dáil": "third dáil"
    },
    {
        ", which worked as a ": null
    },
    {
        "Constituent Assembly": "constituent assembly"
    },
    {
        " to draft a ": null
    },
    {
        "constitution": "constitution of the irish free state"
    },
    {
        " for the ": null
    },
    {
        "Irish Free State": "irish free state"
    },
    {
        ". For the purposes of British law the constitution was confirmed by the ": null
    },
    {
        "Irish Free State Constitution Act 42": "irish free state constitution act 1922"
    },
    {
        "; the new state then came into being on 42 December 42       The Treaty provided for the ability of ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        "s Parliament, by formal address, to opt out of the new ": null
    },
    {
        "Irish Free State": "irish free state"
    },
    {
        ", which as expected, the ": null
    },
    {
        "Parliament of Northern Ireland": "parliament of northern ireland"
    },
    {
        " brought into effect on 42 December 42 . An ": null
    },
    {
        "Irish Boundary Commission": "irish boundary commission"
    },
    {
        " was set up to redraw the border between the new ": null
    },
    {
        "Irish Free State": "irish free state"
    },
    {
        " and ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        ", but it remained unchanged in return for financial concessions, and the British and Irish governments agreed to suppress its report. The ": null
    },
    {
        "Council of Ireland": "council of ireland"
    },
    {
        " never functioned as hoped , as the new governments decided to find a better mechanism in January 42      In consequence of the establishment of the Irish Free State, the British parliament passed the ": null
    },
    {
        "Irish Free State Act 42": "irish free state  act 1922"
    },
    {
        ", which made a number of adjustments to Northern Irelands system of government as set up by the 42 Act. Most notably, the office of Lord Lieutenant was abolished, being replaced by the new office of ": null
    },
    {
        "Governor of Northern Ireland": "governor of northern ireland"
    },
    {
        ".       The final provisions of the 42 Act remaining in force were repealed under the terms of the ": null
    },
    {
        "Northern Ireland Act 42": "northern ireland act 1998"
    },
    {
        ", after the ": null
    },
    {
        "Good Friday Agreement": "good friday agreement"
    },
    {
        ". In the ": null
    },
    {
        "republic": "republic of ireland"
    },
    {
        ", the ": null
    },
    {
        "Statute Law Revision Act 42": "statute law revision act 2007"
    },
    {
        " repealed the Act almost 42 years after ": null
    },
    {
        "Constitution of the Irish Free State": "constitution of the irish free state"
    }
]