[
    {
        "            The Government of the Socialist Republic of Vietnam is the executive arm of the ": null
    },
    {
        "Vietnamese state": "politics of vietnam"
    },
    {
        ", and the members of the Government are elected by the ": null
    },
    {
        "National Assembly of Vietnam": "national assembly of vietnam"
    },
    {
        ".       The Vietnamese Council of Ministers was entrusted by the 42 Constitution with managing and implementing the governmental activities of the state. It is described in that document as the Government of the Socialist Republic of Vietnam, the highest executive state body of the highest body of state authority. It is accountable to the ": null
    },
    {
        "National Assembly of Vietnam": "national assembly of vietnam"
    },
    {
        ", and, more directly, to the ": null
    },
    {
        "Vietnamese Council of State": "vietnamese council of state"
    },
    {
        " when the National Assembly is not in session. Its duties include submitting draft laws, decrees, and other bills to the National Assembly and the Council of State; drafting state plans and budgets and implementing them following the National Assemblys approval; managing the development of the national economy; organising national defence activities and assuring the preparedness of the armed forces; and organising and managing the states foreign relations. Its membership includes a chairman, vice-chairman, cabinet ministers, and the heads of state committees, whose terms of office coincide with that of the National Assembly. The Council of Ministers includes its own standing committee, which serves to co-ordinate and mobilise the councils activities. In 42 the standing committee was expanded from ten to thirteen members.     Each ministry is headed by a minister, who is assisted by two to twelve deputy ministers. The number and functions of the ministries are not prescribed in the Constitution, but in 42 there were twenty-three ministries, and a number of other specialised commissions and departments. In apparent response to the call by the ": null
    },
    {
        "Sixth National Party Congress": "6th national congress of the communist party of vietnam"
    },
    {
        " in 42 for a streamlined bureaucracy, several ministries were merged. The former ministries of agriculture, food, and food industry were joined in a newly created Ministry of Agriculture and Food Industry. The ministries of power and mines were merged to form the Ministry of Energy, and a newly created Ministry of Labour, War Invalids, and Social Welfare consolidated the duties of three former ministries. The addition of two new ministerial bodies also resulted from the 42th National Party Congress: a Ministry f Information to replace the Vietnam Radio and Television Commission, and a mission for Economic Relations with Foreign Countries to act as a co-ordinating body for foreign aid.       ": null
    }
]