[
    {
        "              Graham Arthur Chapman was an English comedian, writer, actor, author, and one of the six members of the British surreal comedy group ": null
    },
    {
        "Monty Python": "monty python"
    },
    {
        ". He played authority figures such as the ": null
    },
    {
        "Colonel": "the colonel"
    },
    {
        " and the lead role in two Python films,  Holy Grail  and  Life of Brian  .     Chapman was born in ": null
    },
    {
        "Leicester": "leicester"
    },
    {
        " and was raised in ": null
    },
    {
        "Melton Mowbray": "melton mowbray"
    },
    {
        ". He enjoyed science, acting and comedy, and after graduating from ": null
    },
    {
        "Emmanuel College, Cambridge": "emmanuel college, cambridge"
    },
    {
        " and ": null
    },
    {
        "St Bartholomews Hospital Medical College": "st bartholomews hospital medical college"
    },
    {
        ", he turned down a career as a doctor to be a comedian instead. Chapman eventually established a writing partnership with ": null
    },
    {
        "John Cleese": "john cleese"
    },
    {
        ", which reached its critical peak with Monty Python during the 1970s. He subsequently left Britain for ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ", where he attempted to be a success on American television, speaking on the college circuit and producing the pirate film  Yellowbeard  , before returning to Britain in the early 1980s.     In his personal life, Chapman was openly ": null
    },
    {
        "homosexual": "homosexual"
    },
    {
        " and a strong supporter of ": null
    },
    {
        "gay rights": "gay rights"
    },
    {
        ", and was in a ": null
    },
    {
        "long-term partnership": "domestic partnership"
    },
    {
        " with ": null
    },
    {
        "David Sherlock": "david sherlock"
    },
    {
        ". He was an ": null
    },
    {
        "alcoholic": "alcoholic"
    },
    {
        " during his time at Cambridge and the Python years, but quit drinking shortly before working on Life of Brian. He later became an enthusiast and patron of the ": null
    },
    {
        "Dangerous Sports Club": "dangerous sports club"
    },
    {
        ". Chapman died of ": null
    },
    {
        "tonsil cancer": "tonsil cancer"
    },
    {
        " on 4 October 1989, on the eve of Monty Pythons 20th anniversary. His life and legacy were commemorated at a private memorial service at St Bartholomews with the other five Pythons.          Graham Arthur Chapman was born on 8 January 1941 at the Stoneygate Nursing Home, ": null
    },
    {
        "Stoneygate": "stoneygate"
    },
    {
        ", ": null
    },
    {
        "Leicester": "leicester"
    },
    {
        ", the son of policeman Walter Chapman and Edith Towers.  He had an elder brother, John, who was born in 1936. One of Chapmans earliest memories was seeing the remains of Polish airmen who had suffered an aeroplane accident near Leicester, later saying the sights of this remained in his memory.     Chapman was educated at ": null
    },
    {
        "Melton Mowbray Grammar School": "king edward vii school"
    },
    {
        ". He showed a strong affinity for science, sports and amateur dramatics, and was singled out for attention when a local paper reviewed his performance of ": null
    },
    {
        "Mark Antony": "mark antony"
    },
    {
        " in ": null
    },
    {
        "Shakespeares": "william shakespeare"
    },
    {
        "  Julius Caesar . Graham and his brother John were both avid fans of radio comedy, being especially fond of  The Goon Show  and Robert Moretons skill of telling jokes the wrong way round and reversing punchlines. Biographer Jim Yoakum said the radio shows didnt necessarily make him laugh .     In 1959, Chapman began to study medicine at ": null
    },
    {
        "Emmanuel College, Cambridge": "emmanuel college, cambridge"
    },
    {
        ". He joined the ": null
    },
    {
        "Cambridge Footlights": "cambridge footlights"
    },
    {
        ", where he first began writing with ": null
    },
    {
        "John Cleese": "john cleese"
    },
    {
        ". Following graduation, Chapman joined the Footlights show Cambridge Circus and toured ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ", deferring his medical studies for a year. After the tour, he continued his studies at ": null
    },
    {
        "St Bartholomews Medical College": "st bartholomews medical college"
    },
    {
        ",  but became torn between whether to pursue a career in medicine or acting. His brother John later said, He wasnt ever driven to go into medicine...it wasnt his lifes ambition.               Following their Footlights success, Chapman and Cleese began to write professionally for the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ", initially for ": null
    },
    {
        "David Frost": "david frost"
    },
    {
        " but also for ": null
    },
    {
        "Marty Feldman": "marty feldman"
    },
    {
        ". Frost had recruited Cleese, and in turn Cleese decided he needed Chapman as a sounding board. Chapman also contributed sketches to the radio series  Im Sorry, Ill Read That Again  and wrote material on his own and with ": null
    },
    {
        "Bill Oddie": "bill oddie"
    },
    {
        ". He wrote for  The Illustrated Weekly Hudd  ,  Cilla Black ,  This Is Petula Clark , and  This Is Tom Jones . Chapman, Cleese, and ": null
    },
    {
        "Tim Brooke-Taylor": "tim brooke-taylor"
    },
    {
        " later joined Feldman in the television comedy series  At Last the 1948 Show . It was Chapmans first significant role as a performer as well as a writer and he displayed a gift for ": null
    },
    {
        "deadpan": "deadpan"
    },
    {
        " comedy  and imitating various British ": null
    },
    {
        "dialects": "dialects"
    },
    {
        ". The series was the first to feature Chapmans sketch of wrestling with himself.     Despite the series’ success, Chapman was still unsure about abandoning his medical career. In between the two series of At Last The 1948 Show, he completed his studies at St. Bartholomews, and became professionally registered as a doctor. Chapman and Cleese also wrote for the long-running television comedy series  Doctor in the House , and both appeared on a one-off television special,  How to Irritate People  alongside Brooke-Taylor and future Python member ": null
    },
    {
        "Michael Palin": "michael palin"
    },
    {
        ". One of Cleese and Chapmans sketches, featuring a used car salesman refusing to believe a customers model had broken down, became the inspiration for the ": null
    },
    {
        "Dead Parrot sketch": "dead parrot sketch"
    },
    {
        ". Chapman also co-wrote several episodes of Doctor in the House follow up,  Doctor in Charge , with ": null
    },
    {
        "Bernard McKenna": "bernard mckenna"
    },
    {
        ".             In 1969, Chapman and Cleese joined the other Pythons, ": null
    },
    {
        "Michael Palin": "michael palin"
    },
    {
        ", ": null
    },
    {
        "Eric Idle": "eric idle"
    },
    {
        ", ": null
    },
    {
        "Terry Jones": "terry jones"
    },
    {
        " and ": null
    },
    {
        "Terry Gilliam": "terry gilliam"
    },
    {
        ", for their sketch comedy series  Monty Pythons Flying Circus . The groups writing was split into well-defined teams, with Chapman collaborating almost exclusively with Cleese. Chapman was particularly keen to remove stereotypical ": null
    },
    {
        "punchlines": "punch line"
    },
    {
        " in sketches and created ": null
    },
    {
        "The Colonel": "the colonel"
    },
    {
        ", who would stop them in mid-flow by saying they were too silly .      Although the pair were officially equal partners, Cleese later thought that Chapman contributed comparatively little in the way of direct writing, saying he would come in, say something marvellous and then drift off in his own mind . The other Pythons have said that Chapmans biggest contribution in the writing room was an intuition for what was funny. Gilliam later recalled that Graham would do the nudge that would push it into something extraordinary . The series was an immediate success, and Chapman was delighted to learn that medical students at St. Bartholomews crowded round the television in the bar to watch it. Chapman was frequently late for rehearsing or recording, leading to the other Pythons calling him the late Graham Chapman .     Chapmans main contribution to the ": null
    },
    {
        "Dead Parrot sketch": "dead parrot sketch"
    },
    {
        " , derived from the piece within How to Irritate People and involving a customer returning a faulty toaster, was How can we make this madder? , turning the toaster into a dead Norwegian Blue parrot. Cleese later said he and Chapman believed that there was something very funny there, if we could find the right context for it . Cleese was in particular concerned that the ": null
    },
    {
        "Cheese Shop sketch": "cheese shop sketch"
    },
    {
        " simply was not funny, in that it was just mainly a man listing different makes of cheese. Chapman urged his partner to continue with it, telling him Trust me, its funny. When it was read out at the next script meeting, Cleese found that the others, particularly Palin, thought it was hilarious. The group felt that Chapman had the best acting skills among them. Cleese complimented Chapman by saying that he was particularly a wonderful actor .     Chapman played the lead role in two Python films,  Holy Grail  and  Life of Brian . He was chosen to play the lead in Holy Grail because of the groups respect towards his straight acting skills, and because the other members wanted to play lesser, funnier characters. Chapman did not mind being filmed fully nude in front of a crowd in Life of Brian, but the scene, filmed in ": null
    },
    {
        "Tunisia": "tunisia"
    },
    {
        ", caused problems with the female ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " extras.       In 1975, Chapman and ": null
    },
    {
        "Douglas Adams": "douglas adams"
    },
    {
        " wrote a pilot for a television series, entitled  Out of the Trees , but it received poor ratings after being broadcast at the same time as  Match of the Day  and only the initial episode was produced. In 1978, Chapman co-wrote the comedy film  The Odd Job  with McKenna, and starred as one of the main characters. Chapman wanted his friend ": null
    },
    {
        "Keith Moon": "keith moon"
    },
    {
        " to play a co-lead role alongside him, but Moon could not pass an acting test, so the part went to ": null
    },
    {
        "David Jason": "david jason"
    },
    {
        " who had previously appeared on  Do Not Adjust Your Set  with Pythons Idle, Jones, and Palin. The film was moderately successful.     During the 1970s, Chapman became increasingly concerned about the Pythons income and finances. He moved to ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " in the late 1970s to avoid British ": null
    },
    {
        "income tax": "income tax"
    },
    {
        ". He guest-starred on several television series including  The Big Show .     In 1976, Chapman began writing a pirate film,  Yellowbeard  , which came out of conversations between Chapman and Moon while in Los Angeles. Moon had always wanted to play ": null
    },
    {
        "Long John Silver": "long john silver"
    },
    {
        ", so Chapman began to write a script for him. Moon died in 1978 and the work stalled, eventually being rewritten by McKenna, then by ": null
    },
    {
        "Peter Cook": "peter cook"
    },
    {
        ". The film, which starred Chapman as the eponymous pirate, also featured appearances from Cook, ": null
    },
    {
        "Marty Feldman": "marty feldman"
    },
    {
        ", Cleese, Idle, ": null
    },
    {
        "Spike Milligan": "spike milligan"
    },
    {
        ", and ": null
    },
    {
        "Cheech & Chong": "cheech  &  chong"
    },
    {
        ". It marked the last appearance of Feldman, who suffered a fatal heart attack in December 1982. The project was fraught with financial difficulties, and at times there was not enough money to pay the crew. It was released to mixed reviews. ": null
    },
    {
        "David Robinson": "david robinson"
    },
    {
        ", reviewing the film in  The Times , said that the Monty Python style of comic anarchy requires more than scatology, rude words and funny faces .     Chapman published his memoirs,  A Liars Autobiography , in 1980, choosing the title because he said its almost impossible to tell the truth . He returned to Britain permanently after Yellowbeard was released. He became involved with the ": null
    },
    {
        "extreme sports": "extreme sport"
    },
    {
        "club ": null
    },
    {
        "Dangerous Sports Club": "dangerous sports club"
    },
    {
        ", which popularised ": null
    },
    {
        "bungee jumping": "bungee jumping"
    },
    {
        ". Chapman was scheduled to perform a bungee jump himself, but it was cancelled due to safety concerns.       After reuniting with the other Pythons in the film  The Meaning of Life  , Chapman began a lengthy series of US college tours, talking about The Pythons, the Dangerous Sports Club and his friend Moon, among other subjects.  Saturday Night Live  creator and Python fan ": null
    },
    {
        "Lorne Michaels": "lorne michaels"
    },
    {
        " persuaded Chapman to star in  The New Show .     In 1988, Chapman appeared in the ": null
    },
    {
        "Iron Maiden": "iron maiden"
    },
    {
        " video ": null
    },
    {
        "Can I Play with Madness": "can i play with madness"
    },
    {
        " .  The same year, he starred in a pilot of a proposed television series,  Jakes Journey , but financial problems prevented a full series from being made. In 1988, he also appeared on stage with three other Pythons at the ": null
    },
    {
        "41st British Academy Film Awards": "41st british academy film awards"
    },
    {
        " where Monty Python received the ": null
    },
    {
        "BAFTA Award": "british academy film awards"
    },
    {
        " for Outstanding British Contribution To Cinema.      Broadcast in November 1989, the 20th anniversary television special,  Parrot Sketch Not Included – 20 Years of Monty Python , hosted by Python fan ": null
    },
    {
        "Steve Martin": "steve martin"
    },
    {
        ", was Chapmans final onscreen appearance with the other five Python members.  Chapman was intended to be cast in the  Red Dwarf  episode ": null
    },
    {
        "Timeslides": "timeslides"
    },
    {
        " , but died before shooting could begin.           Chapman first met his long-term partner ": null
    },
    {
        "David Sherlock": "david sherlock"
    },
    {
        " in ": null
    },
    {
        "Ibiza": "ibiza"
    },
    {
        " in 1966. He later described realising he was ": null
    },
    {
        "homosexual": "homosexual"
    },
    {
        " as an important moment in my life . He told close friends about his relationship, including Cleese and Feldman, the following year. Chapman and Sherlock moved to ": null
    },
    {
        "Belsize Park": "belsize park"
    },
    {
        " in 1968, and the pair enjoyed visiting gay clubs in Central London.     Chapman first disclosed his homosexuality in public in 1972, on a television show fronted by British ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " musician ": null
    },
    {
        "George Melly": "george melly"
    },
    {
        ", becoming one of the first celebrities to do so.   He was a vocal spokesman for gay rights, supporting the ": null
    },
    {
        "Gay Liberation Front": "gay liberation front"
    },
    {
        ". In 1972, Chapman supported the newspaper  Gay News , which listed him as one of the publications special friends in recognition.     In 1971, Chapman and Sherlock ": null
    },
    {
        "adopted": "gay adoption"
    },
    {
        " John Tomiczek as their son. Chapman met Tomiczek when the adolescent was a run-away from ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", aged 14. After discussions with Tomiczeks father, it was agreed that Chapman would become Tomiczeks legal guardian. Tomiczek later became Chapmans business manager, and got engaged, but died of a heart attack in 1992.      Later, during his college tour, Chapman mentioned that a television audience member had written to The Pythons to complain about them having a gay member, adding that the Bible said; any man who lies with a man should be taken out and ": null
    },
    {
        "stoned": "stoning"
    },
    {
        ". With other Pythons already aware of his ": null
    },
    {
        "sexual orientation": "sexual orientation"
    },
    {
        ", Idle jokingly replied that they had found the perpetrator and killed him. Both Sherlock and Tomiczek remained a constant in Chapmans life. In the mid-1980s, having resettled in Britain, the three moved to ": null
    },
    {
        "Maidstone": "maidstone"
    },
    {
        ", ": null
    },
    {
        "Kent": "kent"
    },
    {
        ".     Chapman took up ": null
    },
    {
        "pipe smoking": "pipe smoking"
    },
    {
        " aged 15, which became a lifelong habit. He began drinking heavily during his time at Cambridge and St. Bartholomews, favouring ": null
    },
    {
        "gin": "gin"
    },
    {
        ". By the time Monty Python has gone out on tour in 1973, Chapmans drinking had begun to affect his performance, causing him to miss cues to go on stage. He stopped drinking during Christmas 1977, concerned at being able to act in Life of Brian successfully, and remained sober for the rest of his life.       In 1988, Chapman made a routine visit to a dentist, who found a small but malignant tumour on one of his ": null
    },
    {
        "tonsil": "tonsil"
    },
    {
        "s, leading to both being removed via a ": null
    },
    {
        "tonsillectomy": "tonsillectomy"
    },
    {
        ". The following year, the cancer had spread into Chapmans spinal cord, where another tumour was surgically removed. Chapman had several ": null
    },
    {
        "chemotherapy": "chemotherapy"
    },
    {
        " treatments and surgeries during the final months of his life, but ultimately the cancer was declared inoperable. According to his brother, Chapman was visibly upset by the death of his mother that July, by which time he was ": null
    },
    {
        "terminally ill": "terminal illness"
    },
    {
        ". Shortly afterwards, Chapman filmed scenes for the 20th anniversary of the first broadcast of Monty Python’s Flying Circus, the final time he appeared on television.      Chapman died on 4 October 1989 in ": null
    },
    {
        "Maidstone Hospital": "maidstone hospital"
    },
    {
        ". At the time of his death, he was being visited by Sherlock, brother John and his sister-in-law, and fellow Pythons Palin and Cleese, the latter of whom had to be led out of the room to deal with his grief. ": null
    },
    {
        "Peter Cook": "peter cook"
    },
    {
        " had intended to visit, but arrived too late and was visibly shaken by the news. Chapmans death occurred on the eve of the twentieth anniversary of The Pythons’ collective debut on British television, and Jones called it the worst case of party-pooping in all history .          The five surviving Python members had decided to stay away from Chapmans private funeral to prevent it from becoming a ": null
    },
    {
        "media circus": "media circus"
    },
    {
        " and to give his family some privacy. They sent a wreath in the shape of the Python foot, with the message: To Graham from the other Pythons with all our love. PS: Stop us if were getting too silly . ": null
    },
    {
        "The Rolling Stones": "the rolling stones"
    },
    {
        " also sent a floral arrangement, saying Thanks for all the laughs.      A public memorial service for Chapman was held at St. Bartholomews on 3 December, two months after his death. The service began with a chorus of the hymn ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " sung in ": null
    },
    {
        "Engrish": "engrish"
    },
    {
        " with a mock ": null
    },
    {
        "Chinese accent": "standard chinese"
    },
    {
        ". Cleese delivered a eulogy to Chapman with shock humour that he believed Chapman would have appreciated, and later became the first person at a televised British memorial service to say fuck .  Palin also delivered a eulogy to Chapman, as did Idle, quipping that Chapman had decided to die rather than listen to Palin once again. Idle also led the other surviving Pythons and Chapmans close friends and family in a rendition of the song ": null
    },
    {
        "Always Look on the Bright Side of Life": "always look on the bright side of life"
    },
    {
        " , from Life of Brian, then closed his remarks by saying: Id just like to be the last person at this meeting to say fuck.      Ten years after Chapmans death, his ashes were first rumoured to have been ": null
    },
    {
        "blasted into the skies in a rocket": "space burial"
    },
    {
        " with assistance from the ": null
    },
    {
        "Dangerous Sports Club": "dangerous sports club"
    },
    {
        ".  In a second rumour, Chapmans ashes had been scattered on the mountains of ": null
    },
    {
        "Snowdonia": "snowdonia"
    },
    {
        ", ": null
    },
    {
        "Wales": "wales"
    },
    {
        ", where he had visited regularly as a climber.             Following Chapmans death, reformations of the Pythons have included an urn said to contain his ": null
    },
    {
        "ashes": "cremation"
    },
    {
        ". At the 1998 Aspen Comedy Arts festival, the urn, brought onstage by a stiff English butler, was accidentally knocked over by ": null
    },
    {
        "Terry Gilliam": "terry gilliam"
    },
    {
        ", spilling the ashes on-stage. The apparently ": null
    },
    {
        "cremated": "cremation"
    },
    {
        " remains were then removed with a dust-buster.  Idle recalled meeting Sherlock, saying I wish he was here now and Sherlock replied Oh, but he is. Hes in my pocket!      Asteroid ": null
    },
    {
        "9617 Grahamchapman": "9617 grahamchapman"
    },
    {
        ", named in Chapmans honour, is one of six asteroids named after the Python members.     In 1997, Sherlock allowed Jim Yoakum to start the Graham Chapman Archives. Later that year, the novel Graham Crackers: Fuzzy Memories, Silly Bits, and Outright Lies was released. It is a semi-sequel to A Liars Autobiography, with Chapmans works compiled by Yoakum.  A compendium of writings, Calcium Made Interesting: Sketches, Letters, Essays & Gondolas, also compiled and edited by Yoakum, was published in 2005 in association with the David Sherlock and John Tomiczeck trust. In 2000, Chapmans play O Happy Day was performed by ": null
    },
    {
        "Dads Garage Theatre Company": "dads garage theatre company"
    },
    {
        " in ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        ", ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        ", with the assistance of Cleese and Palin. In 2006, the album and ": null
    },
    {
        "DVD": "dvd-video"
    },
    {
        " release Looks Like Another Brown Trouser Job came out, featuring a college lecture recorded in April 1988.         In June 2011, it was announced that Cleese, Jones, Gilliam and Palin would perform in a ": null
    },
    {
        "3-D": "3d film"
    },
    {
        " animated version of Chapmans memoir  A Liars Autobiography: Volume VI .  Co-director Jeff Simpson worked closely with Chapmans estate and the surviving Python members to get this exactly right .  The film, titled  A Liars Autobiography: The Untrue Story of Monty Pythons Graham Chapman , was shown at the Toronto International Film Festival in September 2012 and premiered in the UK the following month as part of the ": null
    },
    {
        "BFI London Film Festival": "bfi london film festival"
    },
    {
        ". The voices of Cleese, Gilliam, Jones, and Palin were spliced into commentary recorded by Chapman reading from his memoir and taped shortly before his death. The films official trailer quoted Chapman as saying, This is the best film Ive been in since I died.      In September 2012, a British Comedy Society ": null
    },
    {
        "blue plaque": "blue plaque"
    },
    {
        ", to commemorate Chapman, was unveiled at The Angel pub in ": null
    },
    {
        "Highgate": "highgate"
    },
    {
        ", ": null
    },
    {
        "North London": "north london"
    },
    {
        ", by Jones, Palin, ": null
    },
    {
        "Barry Cryer": "barry cryer"
    },
    {
        ", ": null
    },
    {
        "Ray Davies": "ray davies"
    },
    {
        " and ": null
    },
    {
        "Carol Cleveland": "carol cleveland"
    },
    {
        ".  Palin said, Highgate was his patch, and he should be celebrated because he was a very good, brilliant, funny, nice, wise, kind man, who occasionally drank too much.  In December 2014, a green plaque funded by ": null
    },
    {
        "Leicestershire County Council": "leicestershire county council"
    },
    {
        " was placed on Chapmans former home in Burton Road, ": null
    },
    {
        "Melton Mowbray": "melton mowbray"
    },
    {
        ".  A year later, a blue plaque at the entrance of Chapmans old school, ": null
    },
    {
        "King Edward VII School": "king edward vii school, melton mowbray"
    },
    {
        " was reported as stolen, but was later found inside the building.  In March 2017, the plaque was relocated to Melton Mowbray town centre.           ": null
    }
]