[
    {
        "           Granite  is a common type of ": null
    },
    {
        "felsic": "felsic"
    },
    {
        " intrusive": "intrusive rock"
    },
    {
        " igneous rock": "igneous rock"
    },
    {
        " that is granular and ": null
    },
    {
        "phaneritic": "phaneritic"
    },
    {
        " in texture. Granites can be predominantly white, pink, or gray in color, depending on their ": null
    },
    {
        "mineralogy": "mineralogy"
    },
    {
        ". The word granite comes from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " granum, a grain, in reference to the coarse-grained structure of such a ": null
    },
    {
        "holocrystalline": "holocrystalline"
    },
    {
        " rock. Strictly speaking, granite is an igneous rock with between 20% and 60% ": null
    },
    {
        "quartz": "quartz"
    },
    {
        " by volume, and at least 35% of the total feldspar consisting of ": null
    },
    {
        "alkali feldspar": "alkali feldspar"
    },
    {
        ", although commonly the term granite is used to refer to a wider range of coarse-grained igneous rocks containing quartz and feldspar.     The term granitic means granite-like and is applied to granite and a group of intrusive igneous rocks with similar textures and slight variations in composition and origin. These rocks mainly consist of ": null
    },
    {
        "feldspar": "feldspar"
    },
    {
        ", ": null
    },
    {
        "quartz": "quartz"
    },
    {
        ", ": null
    },
    {
        "mica": "mica"
    },
    {
        ", and ": null
    },
    {
        "amphibole": "amphibole"
    },
    {
        " mineral": "mineral"
    },
    {
        "s, which form an interlocking, somewhat ": null
    },
    {
        "equigranular": "equigranular"
    },
    {
        " matrix": "matrix"
    },
    {
        " of feldspar and quartz with scattered darker ": null
    },
    {
        "biotite": "biotite"
    },
    {
        " mica and amphibole  peppering the lighter color minerals. Occasionally some individual crystals  are larger than the ": null
    },
    {
        "groundmass": "groundmass"
    },
    {
        ", in which case the texture is known as ": null
    },
    {
        "porphyritic": "porphyritic"
    },
    {
        ". A granitic rock with a porphyritic texture is known as a granite ": null
    },
    {
        "porphyry": "porphyry"
    },
    {
        ". ": null
    },
    {
        "Granitoid": "granitoid"
    },
    {
        " is a general, descriptive ": null
    },
    {
        "field": "field research"
    },
    {
        " term for lighter-colored, coarse-grained igneous rocks. ": null
    },
    {
        "Petrographic": "petrography"
    },
    {
        " examination is required for identification of specific types of granitoids.  The ": null
    },
    {
        "extrusive": "extrusive"
    },
    {
        " igneous rock equivalent of granite is ": null
    },
    {
        "rhyolite": "rhyolite"
    },
    {
        ".         Granite is nearly always massive , hard, and tough. These properties have made granite a widespread construction stone throughout human history. The average ": null
    },
    {
        "density": "density"
    },
    {
        " of granite is between ,  its ": null
    },
    {
        "compressive strength": "compressive strength"
    },
    {
        " usually lies above 200 MPa, and its ": null
    },
    {
        "viscosity": "viscosity"
    },
    {
        " near ": null
    },
    {
        "STP": "standard conditions for temperature and pressure"
    },
    {
        " is 3–6·10 19 Pa·s.      The melting temperature of dry granite at ambient pressure is ;  it is strongly reduced in the presence of water, down to 650  °C at a few kBar pressure.      Granite has poor primary ": null
    },
    {
        "permeability": "permeability"
    },
    {
        " overall, but strong secondary permeability through cracks and fractures if they are present.               Granite is classified according to the ": null
    },
    {
        "QAPF diagram": "qapf diagram"
    },
    {
        " for coarse grained ": null
    },
    {
        "plutonic rocks": "pluton"
    },
    {
        " and is named according to the percentage of ": null
    },
    {
        "quartz": "quartz"
    },
    {
        ", alkali ": null
    },
    {
        "feldspar": "feldspar"
    },
    {
        "  and ": null
    },
    {
        "plagioclase": "plagioclase"
    },
    {
        " feldspar on the A-Q-P half of the diagram. True granite  contains both plagioclase and alkali feldspars. When a granitoid is devoid or nearly devoid of plagioclase, the rock is referred to as ": null
    },
    {
        "alkali feldspar granite": "alkali feldspar granite"
    },
    {
        ". When a granitoid contains less than 10% orthoclase, it is called ": null
    },
    {
        "tonalite": "tonalite"
    },
    {
        "; ": null
    },
    {
        "pyroxene": "pyroxene"
    },
    {
        " and ": null
    },
    {
        "amphibole": "amphibole"
    },
    {
        " are common in tonalite. A granite containing both muscovite and biotite ": null
    },
    {
        "micas": "mica"
    },
    {
        "is called a binary or two-mica granite. Two-mica granites are typically high in ": null
    },
    {
        "potassium": "potassium"
    },
    {
        " and low in plagioclase, and are usually S-type granites or A-type granites.       A worldwide average of the chemical composition of granite, by weight percent, based on 2485 analyses:                       Granite containing rock is widely distributed throughout the ": null
    },
    {
        "continental crust": "continental crust"
    },
    {
        ".  Much of it was intruded during the ": null
    },
    {
        "Precambrian": "precambrian"
    },
    {
        " age; it is the most abundant ": null
    },
    {
        "basement rock": "basement rock"
    },
    {
        " that underlies the relatively thin ": null
    },
    {
        "sedimentary": "sedimentary rock"
    },
    {
        " veneer of the continents. ": null
    },
    {
        "Outcrops": "outcrop"
    },
    {
        "of granite tend to form ": null
    },
    {
        "tors": "tor"
    },
    {
        " and rounded ": null
    },
    {
        "massif": "massif"
    },
    {
        "s. Granites sometimes occur in circular ": null
    },
    {
        "depressions": "depression"
    },
    {
        "surrounded by a range of hills, formed by the ": null
    },
    {
        "metamorphic aureole": "metamorphic aureole"
    },
    {
        " or ": null
    },
    {
        "hornfels": "hornfels"
    },
    {
        ". Granite often occurs as relatively small, less than 100  km 2 stock masses  and in ": null
    },
    {
        "batholiths": "batholith"
    },
    {
        "that are often associated with ": null
    },
    {
        "orogenic": "orogeny"
    },
    {
        " mountain": "mountain"
    },
    {
        " ranges. Small ": null
    },
    {
        "dikes": "dike"
    },
    {
        " of granitic composition called ": null
    },
    {
        "aplites": "aplite"
    },
    {
        "are often associated with the margins of granitic ": null
    },
    {
        "intrusion": "intrusion"
    },
    {
        "s. In some locations, very coarse-grained ": null
    },
    {
        "pegmatite": "pegmatite"
    },
    {
        " masses occur with granite.       Granite has a felsic composition and is more common in continental crust than in oceanic crust. They are crystallized from felsic melts which are less dense than mafic rocks and thus tend to ascend toward the surface. In contrast, mafic rocks, either basalts or gabbros, once metamorphosed at eclogite facies, tend to sink into the mantle beneath the ": null
    },
    {
        "Moho": "mohorovičić discontinuity"
    },
    {
        ".       Granitoids have crystallized from felsic magmas that have compositions at or near a eutectic point . Magmas are composed of melts and minerals in variable abundances. Traditionally, magmatic minerals are crystallized from the melts that have completely separated from their parental rocks and thus are highly evolved because of igneous differentiation. If a granite has a slowly cooling process, it has the potential to form larger crystals.     There are also peritectic and residual minerals in granitic magmas. Peritectic minerals are generated through peritectic reactions, whereas residual minerals are inherited from parental rocks. In either case, magmas will evolve to the eutectic for crystallization upon cooling. Anatectic melts are also produced by peritectic reactions, but they are much less evolved than magmatic melts because they have not separated from their parental rocks. Nevertheless, the composition of anatectic melts may change toward the magmatic melts through high-degree fractional crystallization.     Fractional crystallisation serves to reduce a melt in iron, magnesium, titanium, calcium and sodium, and enrich the melt in potassium and silicon – alkali feldspar and quartz , are two of the defining constituents of granite. This process operates regardless of the origin of parental magmas to granites, and regardless of their chemistry.       The composition and origin of any magma that differentiates into granite leave certain petrological evidence as to what the granites parental rock was. The final texture and composition of a granite are generally distinctive as to its parental rock. For instance, a granite that is derived from partial melting of metasedimentary rocks may have more alkali feldspar, whereas a granite derived from partial melting of metaigneous rocks may be richer in plagioclase. It is on this basis that the modern alphabet classification schemes are based.     The letter-based Chappell & White classification system was proposed initially to divide granites into ": null
    },
    {
        "I-type": "i-type granite"
    },
    {
        " granite and S-type . Chappell, B. W.; White, A. J. R. . Two contrasting granite types: 25 years later. Australian Journal of Earth Sciences, 48: 489–499. Both types are produced by partial melting of crustal rocks, either metaigneous rocks or metasedimentary rocks.     M-type granite was later proposed to cover those granites that were clearly sourced from crystallized mafic magmas, generally sourced from the mantle. However, this proposal has been rejected by studies of experimental petrology, which demonstrate that partial melting of mantle ": null
    },
    {
        "peridotite": "peridotite"
    },
    {
        " cannot produce granitic melts in any case. Although the fractional crystallisation of basaltic melts can yield small amounts of granites, such granites must occur together with large amounts of basaltic rocks.     A-type granites were defined as to occur in anorogenic setting, have alkaline and anhydrous compositions. They show a peculiar mineralogy and geochemistry, with particularly high silicon and potassium at the expense of calcium and magnesium. Winter, J.D. Principles of Igneous and Metamorphic Petrology. 2nd Edition, page 381. These granites are produced by partial melting of refractory lithology such as granulites in the lower continental crust at high thermal gradients. This leads to significant extraction of hydrous felsic melts from granulite-facies resitites. A-type granites occur in the Koettlitz Glacier Alkaline Province in the Royal Society Range, Antarctica. The rhyolites of the Yellowstone Caldera are examples of volcanic equivalents of A-type granite.     H-type granites were suggested for hybrid granites, which were hypothesized to form by mixing between mafic and felsic from different sources, e.g. M-type and S-type. However, the big difference in rheology between mafic and felsic magmas makes this process hardly happening in nature.       An old, and largely discounted process, granitization states that granite is formed in place through extreme metasomatism by fluids bringing in elements, e.g. potassium, and removing others, e.g. calcium, to transform a metamorphic rock into a granite. This was supposed to occur across a migrating front.     After more than 50 years of studies, it becomes clear that granitic magmas have separated from their sources and experienced fractional crystallization during their ascent toward the surface. On the other hand, granitic melts can be produced in place through the partial melting of metamorphic rocks by extracting melt-mobile elements such as potassium and silicon into the melts but leaving others such as calcium and iron in granulite residues. Once a metamorphic rock is melted, it becomes a kind of migmatites which are composed of leucosome and melanosome.     In nature, metamorphic rocks may undergo partial melting to transform into migmatites through peritectic reactions, with anatectic melts to crystallize as leucosomes. As soon as the anatectic melts have separated from their sources and highly evolved through fractional crystallization during their ascent toward the surface, they become the magmatic melts and minerals of granitic composition.     After the extraction of anatectic melts, the migmatites become a kind of granulites. In all cases, the partial melting of solid rocks requires high temperatures, and also water or other volatiles which act as a catalyst by lowering the solidus temperature of these rocks. The production of granite at crustal depths requires high heat flow, which cannot be provided by heat production elements in the crust. Furthermore, high heat flow is necessary to produce granulite facies metamorphic rocks in orogens, indicating extreme metamorphism at high thermal gradients. In-situ granitisation by the extreme metamorphism is possible if crustal rocks would be heated by the asthenospheric mantle in rifting orogens, where collision-thickened orogenic lithosphere is thinned at first and then underwent extensional tectonism for active rifting. Zheng, Y.-F., Chen, R.-X., 2017. Regional metamorphism at extreme conditions: Implications for orogeny at convergent plate margins. Journal of Asian Earth Sciences, 145: 46-73.       The ascent and emplacement of large volumes of granite within the upper continental crust is a source of much debate amongst geologists. There is a lack of field evidence for any proposed mechanisms, so hypotheses are predominantly based upon experimental data. There are two major hypotheses for the ascent of magma through the crust:     Stokes ": null
    },
    {
        "diapir": "diapir"
    },
    {
        " Fracture propagation": "fracture"
    },
    {
        "     Of these two mechanisms, Stokes diapir was favoured for many years in the absence of a reasonable alternative. The basic idea is that magma will rise through the crust as a single mass through ": null
    },
    {
        "buoyancy": "buoyancy"
    },
    {
        ". As it rises, it heats the ": null
    },
    {
        "wall rocks": "country rock"
    },
    {
        ", causing them to behave as a ": null
    },
    {
        "power-law fluid": "power-law fluid"
    },
    {
        " and thus flow around the ": null
    },
    {
        "pluton": "pluton"
    },
    {
        " allowing it to pass rapidly and without major heat loss.  This is entirely feasible in the warm, ": null
    },
    {
        "ductile": "ductility"
    },
    {
        " lower crust where rocks are easily deformed, but runs into problems in the upper crust which is far colder and more brittle. Rocks there do not deform so easily: for magma to rise as a pluton it would expend far too much energy in heating wall rocks, thus cooling and solidifying before reaching higher levels within the crust.     ": null
    },
    {
        "Fracture": "fracture"
    },
    {
        " propagation is the mechanism preferred by many geologists as it largely eliminates the major problems of moving a huge mass of magma through cold brittle crust. Magma rises instead in small channels along self-propagating ": null
    },
    {
        "dykes": "dike"
    },
    {
        " which form along new or pre-existing fracture or ": null
    },
    {
        "fault": "fault"
    },
    {
        " systems and networks of active shear zones.  As these narrow conduits open, the first magma to enter solidifies and provides a form of insulation for later magma.     Granitic magma must make room for itself or be intruded into other rocks in order to form an intrusion, and several mechanisms have been proposed to explain how large ": null
    },
    {
        "batholiths": "batholith"
    },
    {
        "have been emplaced:   ": null
    },
    {
        "Stoping": "stoping"
    },
    {
        ", where the granite cracks the wall rocks and pushes upwards as it removes blocks of the overlying crust   Assimilation, where the granite melts its way up into the crust and removes overlying material in this way   Inflation, where the granite body inflates under pressure and is injected into position     Most geologists today accept that a combination of these phenomena can be used to explain granite intrusions, and that not all granites can be explained entirely by one or another mechanism.             ": null
    },
    {
        "Physical weathering": "physical weathering"
    },
    {
        " occurs on a large scale in the form of ": null
    },
    {
        "exfoliation joint": "exfoliation joint"
    },
    {
        "s, which are the result of granites expanding and fracturing as pressure is relieved when overlying material is removed by erosion or other processes.     ": null
    },
    {
        "Chemical weathering": "chemical weathering"
    },
    {
        " of granite occurs when dilute ": null
    },
    {
        "carbonic acid": "carbonic acid"
    },
    {
        ", and other acids present in rain and soil waters, ": null
    },
    {
        "alter": "mineral alteration"
    },
    {
        " feldspar in a process called ": null
    },
    {
        "hydrolysis": "weathering"
    },
    {
        ".   As demonstrated in the following reaction, this causes potassium feldspar to form ": null
    },
    {
        "kaolinite": "kaolinite"
    },
    {
        ", with potassium ions, bicarbonate, and silica in solution as byproducts. An end product of granite weathering is ": null
    },
    {
        "grus": "grus"
    },
    {
        ", which is often made up of coarse-grained fragments of disintegrated granite.     :2 KAlSi 3 O 8 + 2 H 2 CO 3 + 9 H 2 O → Al 2 Si 2 O 5 4 + 4 H 4 SiO 4 + 2 K + + 2 HCO 3 −     Climatic variations also influence the weathering rate of granites. For about two thousand years, the relief engravings on ": null
    },
    {
        "Cleopatras Needle": "cleopatras needle"
    },
    {
        " obelisk had survived the arid conditions of its origin before its transfer to London. Within two hundred years, the red granite has drastically deteriorated in the damp and polluted air there.      Soil development on granite reflects the rocks high quartz content and dearth of available bases, with the base-poor status predisposing the soil to ": null
    },
    {
        "acidification": "soil acidification"
    },
    {
        " and ": null
    },
    {
        "podzol": "podzol"
    },
    {
        "ization in cool humid climates as the weather-resistant quartz yields much sand.  Use Impacts on Soil Quality Feldspars also weather slowly in cool climes, allowing sand to dominate the fine-earth fraction. In warm humid regions, the weathering of feldspar as described above is accelerated so as to allow a much higher proportion of clay with the ": null
    },
    {
        "Cecil": "cecil"
    },
    {
        " soil series a prime example of the consequent ": null
    },
    {
        "Ultisol": "ultisol"
    },
    {
        " great soil group.  Cecil -- North Carolina State Soil       Granite is a natural source of ": null
    },
    {
        "radiation": "particle radiation"
    },
    {
        ", like most natural stones.     ": null
    },
    {
        "Potassium-40": "potassium-40"
    },
    {
        " is a ": null
    },
    {
        "radioactive isotope": "radioactive isotope"
    },
    {
        " of weak emission, and a constituent of ": null
    },
    {
        "alkali feldspar": "alkali feldspar"
    },
    {
        ", which in turn is a common component of granitic rocks, more abundant in ": null
    },
    {
        "alkali feldspar granite": "alkali feldspar granite"
    },
    {
        " and ": null
    },
    {
        "syenite": "syenite"
    },
    {
        "s.     Some granites contain around 10 to 20 ": null
    },
    {
        "parts per million": "parts per million"
    },
    {
        " of ": null
    },
    {
        "uranium": "uranium"
    },
    {
        ". By contrast, more mafic rocks, such as tonalite, ": null
    },
    {
        "gabbro": "gabbro"
    },
    {
        " and ": null
    },
    {
        "diorite": "diorite"
    },
    {
        ", have 1 to 5 ppm uranium, and ": null
    },
    {
        "limestones": "limestone"
    },
    {
        "and ": null
    },
    {
        "sedimentary": "sedimentary"
    },
    {
        " rocks usually have equally low amounts. Many large granite plutons are sources for ": null
    },
    {
        "palaeochannel": "palaeochannel"
    },
    {
        "-hosted or roll front ": null
    },
    {
        "uranium ore deposits": "uranium ore deposits"
    },
    {
        ", where the uranium washes into the ": null
    },
    {
        "sediments": "sediment"
    },
    {
        "from the granite uplands and associated, often highly radioactive pegmatites. Cellars and basements built into soils over granite can become a trap for ": null
    },
    {
        "radon": "radon"
    },
    {
        " gas, which is formed by the decay of uranium.  Radon gas poses significant health concerns and is the number two cause of ": null
    },
    {
        "lung cancer": "lung cancer"
    },
    {
        " in the US behind smoking.      ": null
    },
    {
        "Thorium": "thorium"
    },
    {
        " occurs in all granites. Hubbert, M. King . American Petroleum Institute Conference. Energy Bulletin. ": null
    },
    {
        "Conway granite": "conway granite"
    },
    {
        " has been noted for its relatively high thorium concentration of 56±6 ppm.      There is some concern that some granite sold as countertops or building material may be hazardous to health. Dan Steck of St. Johns University has stated    that approximately 5% of all granite is of concern, with the caveat that only a tiny percentage of the tens of thousands of granite slab types have been tested. Various resources from national geological survey organizations are accessible online to assist in assessing the risk factors in granite country and design rules relating, in particular, to preventing accumulation of radon gas in enclosed basements and dwellings.     A study of granite countertops was done in November 2008 by National Health and Engineering Inc. of USA. In this test, all of the 39 full-size granite slabs that were measured for the study showed radiation levels well below the European Union safety standards and radon emission levels well below the average outdoor radon concentrations in the US.  – Environmental Health and Engineering – Assessing Exposure to Radon and Radiation from Granite Countertops.          Granite and related ": null
    },
    {
        "marble industries": "marble industry"
    },
    {
        " are considered one of the oldest industries in the world; existing as far back as ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        ".      Major modern exporters of granite include China, India, Italy, Brazil, Canada, Germany, Sweden, Spain and the United States.                 The ": null
    },
    {
        "Red Pyramid": "red pyramid"
    },
    {
        " of ": null
    },
    {
        "Egypt": "ancient egypt"
    },
    {
        " , named for the light crimson hue of its exposed limestone surfaces, is the third largest of ": null
    },
    {
        "Egyptian pyramids": "egyptian pyramids"
    },
    {
        ". ": null
    },
    {
        "Menkaures Pyramid": "menkaures pyramid"
    },
    {
        ", likely dating to the same era, was constructed of ": null
    },
    {
        "limestone": "limestone"
    },
    {
        " and granite blocks. The ": null
    },
    {
        "Great Pyramid of Giza": "great pyramid of giza"
    },
    {
        "  contains a huge granite ": null
    },
    {
        "sarcophagus": "sarcophagus"
    },
    {
        " fashioned of Red ": null
    },
    {
        "Aswan": "aswan"
    },
    {
        " Granite . The mostly ruined ": null
    },
    {
        "Black Pyramid": "black pyramid"
    },
    {
        " dating from the reign of ": null
    },
    {
        "Amenemhat III": "amenemhat iii"
    },
    {
        " once had a polished granite ": null
    },
    {
        "pyramidion": "pyramidion"
    },
    {
        " or capstone, which is now on display in the main hall of the ": null
    },
    {
        "Egyptian Museum": "egyptian museum"
    },
    {
        " in ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " . Other uses in ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        " include ": null
    },
    {
        "column": "column"
    },
    {
        "s, door ": null
    },
    {
        "lintel": "lintel"
    },
    {
        "s, ": null
    },
    {
        "sills": "sill plate"
    },
    {
        ", ": null
    },
    {
        "jamb": "jamb"
    },
    {
        "s, and wall and floor veneer.  How the ": null
    },
    {
        "Egyptians": "egyptians"
    },
    {
        " worked the solid granite is still a matter of debate. ": null
    },
    {
        "Patrick Hunt": "patrick hunt"
    },
    {
        "  has postulated that the Egyptians used ": null
    },
    {
        "emery": "emery"
    },
    {
        ", which has greater ": null
    },
    {
        "hardness": "hardenability"
    },
    {
        " on the ": null
    },
    {
        "Mohs scale": "mohs scale of mineral hardness"
    },
    {
        ".     ": null
    },
    {
        "Rajaraja Chola I": "rajaraja chola i"
    },
    {
        " of the Chola Dynasty in South India built the worlds first temple entirely of granite in the 11th century AD in ": null
    },
    {
        "Tanjore": "tanjore"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        ". The ": null
    },
    {
        "Brihadeeswarar Temple": "brihadeeswarar temple"
    },
    {
        " dedicated to Lord Shiva was built in 1010. The massive Gopuram is believed to have a mass of around 81 tonnes. It was the tallest temple in south India.      Imperial Roman granite was quarried mainly in Egypt, and also in Turkey, and on the islands of ": null
    },
    {
        "Elba": "elba"
    },
    {
        " and ": null
    },
    {
        "Giglio": "isola del giglio"
    },
    {
        ". Granite became an integral part of the Roman language of monumental architecture . The quarrying ceased around the third century AD. Beginning in Late Antiquity the granite was reused, which since at least the early 16th century became known as ": null
    },
    {
        "spoliation": "spoliation"
    },
    {
        ". Through the process of ": null
    },
    {
        "case-hardening": "case hardening of rocks"
    },
    {
        ", granite becomes harder with age. The technology required to make ": null
    },
    {
        "tempered steel": "tempered steel"
    },
    {
        " chisels was largely forgotten during the Middle Ages. As a result, Medieval stoneworkers were forced to use saws or emery to shorten ancient columns or hack them into discs. ": null
    },
    {
        "Giorgio Vasari": "giorgio vasari"
    },
    {
        " noted in the 16th century that granite in quarries was far softer and easier to work than after it has lain exposed while ancient columns, because of their hardness and solidity have nothing to fear from fire or sword, and time itself, that drives everything to ruin, not only has not destroyed them but has not even altered their colour.                 In some areas, granite is used for gravestones and memorials. Granite is a hard stone and requires skill to carve by hand. Until the early 18th century, in the Western world, granite could be carved only by hand tools with generally poor results.     A key breakthrough was the invention of steam-powered cutting and dressing tools by Alexander MacDonald of ": null
    },
    {
        "Aberdeen": "aberdeen"
    },
    {
        ", inspired by seeing ancient Egyptian granite carvings. In 1832, the first polished tombstone of Aberdeen granite to be erected in an English cemetery was installed at ": null
    },
    {
        "Kensal Green Cemetery": "kensal green cemetery"
    },
    {
        ". It caused a sensation in the London monumental trade and for some years all polished granite ordered came from MacDonalds. Friends of West Norwood Cemetery newsletter 71 , As a result of the work of sculptor William Leslie, and later Sidney Field, granite memorials became a major status symbol in Victorian Britain. The royal sarcophagus at ": null
    },
    {
        "Frogmore": "frogmoreroyal mausoleum"
    },
    {
        " was probably the pinnacle of its work, and at 30 tons one of the largest. It was not until the 1880s that rival machinery and works could compete with the MacDonald works.     Modern methods of carving include using computer-controlled rotary bits and ": null
    },
    {
        "sandblasting": "sandblasting"
    },
    {
        " over a rubber stencil. Leaving the letters, numbers, and emblems exposed on the stone, the blaster can create virtually any kind of artwork or epitaph.     The stone known as black granite is usually ": null
    },
    {
        "gabbro": "gabbro"
    },
    {
        ", which has a completely different chemical composition.        Granite has been extensively used as a ": null
    },
    {
        "dimension stone": "dimension stone"
    },
    {
        " and as flooring tiles in public and commercial buildings and monuments. ": null
    },
    {
        "Aberdeen": "aberdeen"
    },
    {
        " in Scotland, which is constructed principally from local granite, is known as The Granite City . Because of its abundance in ": null
    },
    {
        "New England": "new england"
    },
    {
        ", granite was commonly used to build foundations for homes there. The ": null
    },
    {
        "Granite Railway": "granite railway"
    },
    {
        ", Americas first railroad, was built to haul granite from the quarries in ": null
    },
    {
        "Quincy, Massachusetts": "quincy, massachusetts"
    },
    {
        ", to the ": null
    },
    {
        "Neponset River": "neponset river"
    },
    {
        " in the 1820s.       ": null
    },
    {
        "Engineers": "engineers"
    },
    {
        " have traditionally used polished granite ": null
    },
    {
        "surface plates": "surface plate"
    },
    {
        "to establish a ": null
    },
    {
        "plane": "plane"
    },
    {
        " of reference, since they are relatively impervious and inflexible. Sandblasted ": null
    },
    {
        "concrete": "concrete"
    },
    {
        " with a heavy ": null
    },
    {
        "aggregate": "aggregate"
    },
    {
        " content has an appearance similar to rough granite, and is often used as a substitute when use of real granite is impractical. A most unusual use of granite was as the material of the tracks of the ": null
    },
    {
        "Haytor Granite Tramway": "haytor granite tramway"
    },
    {
        ", Devon, England, in 1820. Granite block is usually processed into slabs, which can be cut and shaped by a ": null
    },
    {
        "cutting center": "cutting center"
    },
    {
        ". Granite tables are used extensively as bases for optical instruments because of granites rigidity, high dimensional stability, and excellent vibration characteristics. In military engineering, Finland planted granite boulders along its ": null
    },
    {
        "Mannerheim Line": "mannerheim line"
    },
    {
        " to block invasion by Russian tanks in the winter war of 1940.       ": null
    },
    {
        "Curling": "curling"
    },
    {
        " stones are traditionally fashioned of Ailsa Craig granite. The first stones were made in the 1750s, the original source being ": null
    },
    {
        "Ailsa Craig": "ailsa craig"
    },
    {
        " in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". Because of the rarity of this granite, the best stones can cost as much as US$1,500. Between 60 and 70 percent of the stones used today are made from Ailsa Craig granite, although the island is now a wildlife reserve and is still used for quarrying under license for Ailsa granite by ": null
    },
    {
        "Kays of Scotland": "kays of scotland"
    },
    {
        " for curling stones.        Granite is one of the rocks most prized by climbers, for its steepness, soundness, crack systems, and friction. Well-known venues for granite climbing include the ": null
    },
    {
        "Yosemite Valley": "yosemite valley"
    },
    {
        ", the ": null
    },
    {
        "Bugaboos": "the bugaboos"
    },
    {
        ", the ": null
    },
    {
        "Mont Blanc": "mont blanc"
    },
    {
        " massif , the ": null
    },
    {
        "Bregaglia": "bregaglia range"
    },
    {
        ", ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        ", parts of the ": null
    },
    {
        "Karakoram": "karakoram"
    },
    {
        " , the Fitzroy Massif, ": null
    },
    {
        "Patagonia": "patagonia"
    },
    {
        ", ": null
    },
    {
        "Baffin Island": "baffin island"
    },
    {
        ", ": null
    },
    {
        "Ogawayama": "ogawayama"
    },
    {
        ", the ": null
    },
    {
        "Cornish coast": "geography of cornwall"
    },
    {
        ", the ": null
    },
    {
        "Cairngorms": "cairngorms"
    },
    {
        ", ": null
    },
    {
        "Sugarloaf Mountain": "sugarloaf mountain"
    },
    {
        " in Rio de Janeiro, Brazil, and the ": null
    },
    {
        "Stawamus Chief": "stawamus chief"
    },
    {
        ", British Columbia, Canada.     Granite ": null
    },
    {
        "rock climbing": "rock climbing"
    },
    {
        " is so popular that many of the artificial rock ": null
    },
    {
        "climbing wall": "climbing wall"
    },
    {
        " setts": "setts"
    },
    {
        " on the ": null
    },
    {
        "St. Louis": "st. louis"
    },
    {
        " riverfront": "mississippi river"
    },
    {
        " and for the piers of the ": null
    },
    {
        "Eads Bridge": "eads bridge"
    },
    {
        " Cordillera Paine": "cordillera paine"
    },
    {
        " in the ": null
    },
    {
        "Chile": "chile"
    },
    {
        "an ": null
    },
    {
        "Patagonia": "patagonia"
    },
    {
        " Half Dome": "half dome"
    },
    {
        ", ": null
    },
    {
        "Yosemite National Park": "yosemite national park"
    },
    {
        ", a classic ": null
    },
    {
        "granitic dome": "granitic dome"
    },
    {
        " Lysekil": "lysekil"
    },
    {
        " Liberty Bell Mountain": "liberty bell mountain"
    },
    {
        " in the ": null
    },
    {
        "North Cascades": "north cascades"
    },
    {
        " Early Winters Spires": "early winters spires"
    },
    {
        " in the ": null
    },
    {
        "North Cascades": "north cascades"
    }
]