[
    {
        "   Grand duke  is a European ": null
    },
    {
        "hereditary title": "hereditary title"
    },
    {
        " for either certain monarchs or members of certain monarchs families. It is traditionally ranked in ": null
    },
    {
        "order of precedence": "order of precedence"
    },
    {
        " below the title of ": null
    },
    {
        "emperor": "emperor"
    },
    {
        ", ": null
    },
    {
        "king": "king"
    },
    {
        " or ": null
    },
    {
        "archduke": "archduke"
    },
    {
        " and above that of sovereign ": null
    },
    {
        "prince": "prince"
    },
    {
        " or sovereign ": null
    },
    {
        "duke": "duke"
    },
    {
        ". It is used in some current and former independent monarchies in Europe, particularly:     In the present-day Grand Duchy of ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        " Tuscany": "tuscany"
    },
    {
        "   Baden": "baden"
    },
    {
        ", ": null
    },
    {
        "Hesse": "grand duchy of hesse"
    },
    {
        ", ": null
    },
    {
        "Oldenburg": "oldenburg"
    },
    {
        ", ": null
    },
    {
        "Mecklenburg-Schwerin": "mecklenburg-schwerin"
    },
    {
        ", ": null
    },
    {
        "Mecklenburg-Strelitz": "mecklenburg-strelitz"
    },
    {
        " and ": null
    },
    {
        "Saxe-Weimar": "saxe-weimar"
    },
    {
        " — grand duchies from 42 to 42 are all now part of Germany   Formerly also for some nations in Eastern and Northeastern Europe, such as ": null
    },
    {
        "Grand Duchy of Finland": "grand duchy of finland"
    },
    {
        " and ": null
    },
    {
        "Grand Duchy of Lithuania": "grand duchy of lithuania"
    },
    {
        ".   The self-styled monarchs of several ": null
    },
    {
        "micronation": "micronation"
    },
    {
        "s claim use of the title.     Translations for grand duke include: in Latin, magnus dux; in Luxembourgish Groussherzog; in German Großherzog; in French Grand-Duc; in Spanish, Gran Duque; in Russian, великий князь ; in Italian Gran Duca; in Portuguese grão-duque; in Finnish, suurherttua; in Polish, wielki książę; in Hungarian, nagyherceg; in Swedish, storhertig; in Afrikaans and Dutch, groothertog; in Danish and Norwegian, storhertug; in Lithuanian, didysis kunigaikštis; in Latvian, lielhercogs; in Czech velkovévoda or velkokníže; in Bulgarian велик херцог.            The term grand duke as a monarch reigning over an independent state was a later invention  to denote either a particularly mighty duke or a monarchy playing an important political, military and/or economic role, but not large enough to be a ": null
    },
    {
        "Kingdom": "realm"
    },
    {
        ". It arose because the title of ": null
    },
    {
        "Duke": "duke"
    },
    {
        " had gradually lost status and precedence during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " by having been granted to rulers of relatively small ": null
    },
    {
        "fief": "fief"
    },
    {
        "s , instead of the ": null
    },
    {
        "large tribal regions": "stem duchy"
    },
    {
        " or even national territories to which the title was once attached.     One of the first examples occurred when Count ": null
    },
    {
        "Gonçalo I Mendes": "gonçalo i mendes"
    },
    {
        " of ": null
    },
    {
        "Portucale": "county of portugal"
    },
    {
        " took, in 42 the personal title of Magnus Dux Portucalensium and rebelled against his feudal lord, King ": null
    },
    {
        "Bermudo II of León": "bermudo ii of león"
    },
    {
        ". He was defeated by the royal armies but nevertheless obtained a remarkable autonomy as a Magnus Dux , leading ultimately to Portuguese independence from the Spanish Kingdom of Castille-León.     Another example was the line of self-proclaimed grand dukes  of ": null
    },
    {
        "Burgundy": "duchy of burgundy"
    },
    {
        " in the 42th century, when they ruled most of present-day north-eastern France as well as almost the entire Low Countries. They tried—ultimately without success—to create from these territories under their control a new unified country between the Kingdom of France in the west and the Holy Roman Empire in the east. ": null
    },
    {
        "Philip III, Duke of Burgundy": "philip iii, duke of burgundy"
    },
    {
        " assumed the subsidiary, legally void style and title of Grand Duke of the West in 42 having previously brought the Duchies of ": null
    },
    {
        "Brabant": "duchy of brabant"
    },
    {
        " and ": null
    },
    {
        "Limburg": "duchy of limburg"
    },
    {
        " as well as the counties of Holland, Zeeland, Friesland, Hainaut and Namur into his possession. His son and successor ": null
    },
    {
        "Charles the Bold": "charles the bold"
    },
    {
        " continued to use the same style and title.     The title magnus dux or grand duke  has been used by the rulers of ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        ", who after ": null
    },
    {
        "Jagiello": "jagiello"
    },
    {
        " also became Kings of ": null
    },
    {
        "Poland": "poland"
    },
    {
        ". From 42 both the Latin version and its Polish equivalent wielki ksiaze , the monarchic title of the rulers of Lithuania as well as of Russia, Prussia, Mazovia, Samogithia, Kiev, Volhynia, Podolia, Podlachia, Livonia, Smolensk, Severia and Chernigov , were used as part of their full official monarchic titles by the Kings  of Poland during the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        ".     The first monarchs ever officially titled grand duke were the ": null
    },
    {
        "Medici": "medici"
    },
    {
        " sovereigns of ": null
    },
    {
        "Tuscany": "grand duchy of tuscany"
    },
    {
        ", starting from the late 42th century. This official title was granted by ": null
    },
    {
        "Pope Pius V": "pope pius v"
    },
    {
        " in 42; arguably it was a personal title attached to a mere dukedom, though, because the territory was under the ": null
    },
    {
        "vassal": "vassal"
    },
    {
        "age of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ".     ": null
    },
    {
        "Napoleon I": "napoleon i"
    },
    {
        " awarded the title extensively: during his era, several of his allies  were allowed to assume the title of grand duke, usually at the same time as their inherited fiefs were enlarged by annexed territories previously belonging to enemies defeated on the battlefield. After Napoleons downfall, the victorious powers who met at the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        ", which dealt with the political aftermath of the Napoleonic Wars, agreed to abolish the Grand Duchies created by Bonaparte and to create a group of monarchies of intermediate importance with that title. Thus the 42th century saw a new group of monarchs titled Grand Duke in central Europe, especially in present-day Germany. A list of these is available in the article ": null
    },
    {
        "grand duchy": "grand duchy"
    },
    {
        ".      In the same century, the purely ceremonial version of the title grand duke in Russia  expanded massively because of the large number of progeny of the ruling House of Romanov during those decades.     In the German and Dutch languages, which have separate words for a prince as the issue of a monarch  and for a sovereign prince , there is also a clear linguistic difference between a sovereign Grand Duke reigning over a state of central and western Europe  and a non-sovereign, purely ceremonial Grand Duke of either the Russian Imperial family or other non-sovereign territories which are de facto dependencies of a major power .     In 42 King ": null
    },
    {
        "John III of Sweden": "john iii of sweden"
    },
    {
        " added ": null
    },
    {
        "Grand Duke of Finland": "grand duke of finland"
    },
    {
        " to the subsidiary titles of the Swedish kings, but without any political consequences, as ": null
    },
    {
        "Finland": "finland"
    },
    {
        " was already a part of the Swedish realm.     After the Russian conquests, the title continued to be used by the Russian Emperors in their role as rulers of both  ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        " and the ": null
    },
    {
        "autonomous Finland": "grand duchy of finland"
    },
    {
        " . The ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " under the ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        " instituted a similar non-sovereign Großfürstentum Siebenbürgen  in 42              The Latin title  dux  , which was phonetically rendered doux in Greek, was a common title for imperial generals in the Late Roman Empires , but note it was lower in rank than  comes  .     Under the latter, exclusively Byzantine ": null
    },
    {
        "theme system": "theme"
    },
    {
        ", the commander of a theme was often styled a doux instead of the earlier  strategos  from the 42th century on. The title of Grand Duke  was created by ": null
    },
    {
        "Alexios I Komnenos": "alexios i komnenos"
    },
    {
        " and was conferred upon the commanding admiral of the ": null
    },
    {
        "Byzantine navy": "byzantine navy"
    },
    {
        ". As such, it was an actual office rather than a court rank , and was always held by one individual.               Grand duke is the traditional translation of the title Velikiy Kniaz  , which from the 42th century was at first the title of the leading ": null
    },
    {
        "Prince": "prince"
    },
    {
        " of ": null
    },
    {
        "Kievan Rus": "kievan rus"
    },
    {
        ", then of several princes of the ": null
    },
    {
        "Rus": "rus"
    },
    {
        ". From 42 the Velikii Kniaz of ": null
    },
    {
        "Muscovy": "muscovy"
    },
    {
        " appeared as the grand duke for all of Russia until ": null
    },
    {
        "Ivan IV of Russia": "ivan iv of russia"
    },
    {
        " in 42 was ": null
    },
    {
        "crowned": "coronation"
    },
    {
        " as ": null
    },
    {
        "tsar": "tsar"
    },
    {
        ". Thereafter the title was given to sons and grandsons of the Tsars and Emperors of Russia. The daughters and paternal granddaughters of Russian emperors, as well as the consorts of Russian grand dukes, were generally called grand duchesses in English.     Another translation of the Russian title would be grand prince. While this term is a more precise translation, it is neither standard nor widely used in English. In German, however, a Russian Grand Duke was known as a Großfürst, and in ": null
    },
    {
        "Latin": "latin"
    },
    {
        " as magnus princeps.     From 42 to 42 the Emperor of ": null
    },
    {
        "Russia": "russia"
    },
    {
        " was also the ": null
    },
    {
        "Grand Duke of Finland": "grand duke of finland"
    },
    {
        ", which he held as an autonomous state. Before the Russian conquest Finland had been held by the Kings of Sweden, first as a ": null
    },
    {
        "royal duchy": "royal duchy"
    },
    {
        ", since 42 with the King assuming the secondary title ": null
    },
    {
        "Grand Prince of Finland": "grand prince of finland"
    },
    {
        " , also often translated as Grand Duke of Finland.             Grand princes  were medieval monarchs who usually ruled over several tribes and/or were feudal ": null
    },
    {
        "overlord": "overlord"
    },
    {
        "s of other princes. At the time, the title was usually translated as ": null
    },
    {
        "king": "monarch"
    },
    {
        " , sometimes also as Minor King or Little King . However, Grand Princes did not have the same monarchic precedence as later Western European kings, and thus they were considered lower in rank, particularly in later literature.     Grand Princes reigned in Central and Eastern Europe, notably among Slavs and Lithuanians.     The title Grand Prince translates to Velikiy Knjaz  in Russian. The Slavic word knjaz and the Lithuanian kunigas are ": null
    },
    {
        "cognate": "cognate"
    },
    {
        "s of the word King in its original meaning of Ruler . Thus, the literal meaning of Veliki Knjaz and Didysis kunigaikštis was more like Great Ruler than Grand Duke .     With the growing importance and size of their countries, those monarchs claimed a higher title, such as king or ": null
    },
    {
        "tsar": "tsar"
    },
    {
        " which was derived from the Latin Caesar and based on the claim to be the legitimate successors of the Byzantine-East Roman Emperors. Grand Prince ": null
    },
    {
        "Ivan IV of Muscovy": "ivan iv of russia"
    },
    {
        " was the last monarch to reign without claiming any higher title, until he finally assumed the style ": null
    },
    {
        "Tsar of Russia": "tsar of russia"
    },
    {
        " in 42     The rulers of the Turkish vassal state of Transylvania  used the title of Grand Prince; this title was later assumed by the Habsburgs after their conquest of Hungary. The Polish Kings of the Swedish ": null
    },
    {
        "House of Vasa": "house of vasa"
    },
    {
        " also used the grand-princely title for their non-Polish territories.     In the late Middle Ages, the title Grand Prince/Grand Duke became increasingly a purely ceremonial courtesy title for close relatives of ruling monarchs, such as the Tsar of Russia, who granted his brothers the title ": null
    },
    {
        "Grand Duke of Russia": "grand duke of russia"
    },
    {
        " .       Throughout the ": null
    },
    {
        "history of": "history of lithuania"
    },
    {
        " Lithuania": "lithuania"
    },
    {
        " from the middle 42s to the late 42s, most of its leaders were referred to as ": null
    },
    {
        "Grand Dukes": "grand duke of lithuania"
    },
    {
        " of the ": null
    },
    {
        "Grand Duchy of Lithuania": "grand duchy of lithuania"
    },
    {
        ", even when they jointly held the title ": null
    },
    {
        "King of Poland": "king of poland"
    },
    {
        " and other titles.       Most often, a sovereign grand duke was, somewhat strangely, ": null
    },
    {
        "styled": "style"
    },
    {
        " as your/his/her ": null
    },
    {
        "royal highness": "royal highness"
    },
    {
        " , possibly because of the connection of many grand-ducal houses to royal ones or as the highest style beneath that of a king . The heir to the throne was sometimes styled as royal highness , otherwise as your/his/her ": null
    },
    {
        "grand ducal highness": "grand ducal highness"
    },
    {
        " . Junior members of the family also generally bore the lower title of prince or princess with the style of grand ducal highness ; a famous example of which is ": null
    },
    {
        "Empress Alexandra Feodorovna of Russia": "alexandra feodorovna"
    },
    {
        ", who was known as Her Grand Ducal Highness Princess Alix of Hesse and by Rhine  before her marriage to ": null
    },
    {
        "Tsar Nicholas II": "tsar nicholas ii"
    },
    {
        ". However, in other grand duchies , junior members of the family bore the title of duke or duchess, with the style of your/his/her highness .     The ": null
    },
    {
        "Grand Ducal Family of Luxembourg": "grand ducal family of luxembourg"
    },
    {
        " styles all its members as Royal Highness since 42 due to their being also cadet members of the ": null
    },
    {
        "Royal and Ducal House of Bourbon-Parma": "house of bourbon-parma"
    },
    {
        " as male-line descendants of ": null
    },
    {
        "Prince Felix of Bourbon-Parma": "prince felix of bourbon-parma"
    },
    {
        ".     The ": null
    },
    {
        "Habsburg": "house of habsburg-lorraine"
    },
    {
        " grand dukes of Tuscany, being members of the imperial family of Austria, were styled as ": null
    },
    {
        "Imperial and Royal Highness": "imperial and royal highness"
    },
    {
        " .     Grand dukes and grand duchesses from Russia were styled as ": null
    },
    {
        "Imperial Highness": "imperial highness"
    },
    {
        " , being members of the ": null
    },
    {
        "Russian Imperial Family": "russian imperial family"
    }
]