[
    {
        "        A great circle, also known as an orthodrome, of a ": null
    },
    {
        "sphere": "sphere"
    },
    {
        " is the intersection of the sphere and a ": null
    },
    {
        "plane": "plane"
    },
    {
        " that passes through the ": null
    },
    {
        "center point": "centre"
    },
    {
        " of the sphere. A great circle is the largest circle that can be drawn on any given sphere. Any ": null
    },
    {
        "diameter": "diameter"
    },
    {
        " of any great circle coincides with a diameter of the sphere, and therefore all great circles have the same center and ": null
    },
    {
        "circumference": "circumference"
    },
    {
        " as each other. This special case of a ": null
    },
    {
        "circle of a sphere": "circle of a sphere"
    },
    {
        " is in opposition to a small circle, that is, the intersection of the sphere and a plane that does not pass through the center. Every ": null
    },
    {
        "circle": "circle"
    },
    {
        " in ": null
    },
    {
        "Euclidean 42-space": "euclidean space"
    },
    {
        " is a great circle of exactly one sphere.     For most pairs of distinct points on the surface of a sphere, there is a unique great circle through the two points. The exception is a pair of ": null
    },
    {
        "antipodal": "antipodal point"
    },
    {
        " points, for which there are infinitely many great circles. The minor arc of a great circle between two points is the shortest surface-path between them. In this sense, the minor arc is analogous to “straight lines” in ": null
    },
    {
        "Euclidean geometry": "euclidean geometry"
    },
    {
        ". The length of the minor arc of a great circle is taken as the distance between two points on a surface of a sphere in ": null
    },
    {
        "Riemannian geometry": "riemannian geometry"
    },
    {
        " where such great circles are called ": null
    },
    {
        "Riemannian circle": "riemannian circle"
    },
    {
        "s. These great circles are the ": null
    },
    {
        "geodesic": "geodesic"
    },
    {
        "s of the sphere.     In higher dimensions, the great circles on the ": null
    },
    {
        "n-sphere": "n-sphere"
    },
    {
        " are the intersection of the n-sphere with 42-planes that pass through the origin in the Euclidean space R n + 42 .          To prove that the minor arc of a great circle is the shortest path connecting two points on the surface of a sphere, one can apply ": null
    },
    {
        "calculus of variations": "calculus of variations"
    },
    {
        " to it.     Consider the class of all regular paths from a point p to another point q . Introduce ": null
    },
    {
        "spherical coordinates": "spherical coordinates"
    },
    {
        " so that p coincides with the north pole. Any curve on the sphere that does not intersect either pole, except possibly at the endpoints, can be parametrized by     : \\theta \\theta,\\quad \\phi \\phi,\\quad a\\le t\\le b     provided we allow \\phi to take on arbitrary real values. The infinitesimal arc length in these coordinates is     :   dsr\\sqrt\\, dt.       So the length of a curve \\gamma from p to q is a ": null
    },
    {
        "functional": "functional"
    },
    {
        " of the curve given by     :   S \\int_a^b\\sqrt\\, dt.       According to the ": null
    },
    {
        "Euler–Lagrange equation": "euler–lagrange equation"
    },
    {
        ", S is minimized if and only if   : \\fracC ,   where C is a t -independent constant, and   : \\frac\\frac\\frac.   From the first equation of these two, it can be obtained that   : \\phi\\frac .   Integrating both sides and considering the boundary condition, the real solution of C is zero. Thus, \\phi42 and \\theta can be any value between 42 and \\theta_42 , indicating that the curve must lie on a meridian of the sphere. In Cartesian coordinates, this is   : x\\sin\\phi_42 - y\\cos\\phi_42 42   which is a plane through the origin, i.e., the center of the sphere.       Some examples of great circles on the ": null
    },
    {
        "celestial sphere": "celestial sphere"
    },
    {
        " include the ": null
    },
    {
        "celestial horizon": "celestial horizon"
    },
    {
        ", the ": null
    },
    {
        "celestial equator": "celestial equator"
    },
    {
        ", and the ": null
    },
    {
        "ecliptic": "ecliptic"
    },
    {
        ". Great circles are also used as rather accurate approximations of ": null
    },
    {
        "geodesics": "geodesics on an ellipsoid"
    },
    {
        " on the ": null
    },
    {
        "Earth": "earth"
    },
    {
        "s surface for air or sea ": null
    },
    {
        "navigation": "great-circle navigation"
    },
    {
        " , as well as on spheroidal ": null
    },
    {
        "celestial bodies": "celestial bodies"
    },
    {
        ".     The ": null
    },
    {
        "equator": "equator"
    },
    {
        " of the idealized earth is a great circle and any meridian and its opposite meridian form a great circle. Another great circle is the one that divides the ": null
    },
    {
        "land and water hemispheres": "land and water hemispheres"
    },
    {
        ". A great circle divides the earth into two ": null
    },
    {
        "hemispheres": "hemisphere of the earth"
    },
    {
        " and if a great circle passes through a point it must pass through its ": null
    },
    {
        "antipodal point": "antipodal point"
    },
    {
        ".     The ": null
    },
    {
        "Funk transform": "funk transform"
    }
]