[
    {
        "Greeklish, a ": null
    },
    {
        "portmanteau": "portmanteau"
    },
    {
        " of the words Greek and English, also known as Grenglish, Latinoellinika/Λατινοελληνικά or  ASCII Greek, is the ": null
    },
    {
        "Greek language": "greek language"
    },
    {
        " written using the ": null
    },
    {
        "Latin alphabet": "latin alphabet"
    },
    {
        ". Unlike standardized systems of ": null
    },
    {
        "Romanization of Greek": "romanization of greek"
    },
    {
        ", as used internationally for purposes such as rendering Greek proper names or place names, or for ": null
    },
    {
        "bibliographic": "bibliography"
    },
    {
        " purposes, the term Greeklish mainly refers to informal, ad-hoc practices of writing Greek text in environments where the use of the ": null
    },
    {
        "Greek alphabet": "greek alphabet"
    },
    {
        " is technically impossible or cumbersome, especially in electronic media. Greeklish was commonly used on the Internet when Greek people communicate by ": null
    },
    {
        "forum": "internet forum"
    },
    {
        ", ": null
    },
    {
        "e-mail": "e-mail"
    },
    {
        ", ": null
    },
    {
        "IRC": "internet relay chat"
    },
    {
        ", ": null
    },
    {
        "instant messaging": "instant messaging"
    },
    {
        " and occasionally on ": null
    },
    {
        "SMS": "short message service"
    },
    {
        ", mainly because older operating systems did not have the ability to write in Greek, or in a ": null
    },
    {
        "unicode": "unicode"
    },
    {
        " form like ": null
    },
    {
        "UTF42": "utf-8"
    },
    {
        ". During this age, Greeklish became a controversial subject, with some claiming that it bastardized the Greek language or degraded the youths linguistic ability. Nowadays, while the Greek alphabet has become more easily accessible and a lot of Greek language content is written in it, Greeklish is still often used, primarily by younger generations on ": null
    },
    {
        "social media": "social media"
    },
    {
        ", be it for convenience or aesthetic reasons.     Sometimes, the term Greeklish is also used informally for a non-standard language variety used by ": null
    },
    {
        "bilingual": "bilingualism"
    },
    {
        " speakers of English and Greek, i.e. Greek with heavy ": null
    },
    {
        "macaronic": "macaronic language"
    },
    {
        " or ": null
    },
    {
        "code-switching": "code-switching"
    },
    {
        " admixture of English words, or vice versa.       Some older traditions of using the Latin alphabet for Greek existed in earlier centuries. The term frankolevantinika properly refers to the use of the Latin script to write Greek in the cultural ambit of Catholicism. This usage was routine in the Venetian-ruled Greece and in ": null
    },
    {
        "Venetian Crete": "venetian crete"
    },
    {
        " in the early modern era. Indeed, the autograph manuscripts of several Greek literary works of the Renaissance are in Latin script . This convention was also known as frankochiotika/φραγκοχιώτικα, Frankish/Catholic Chiot , alluding to the significant presence of Catholic missionaries based on the island of ": null
    },
    {
        "Chios": "chios"
    },
    {
        ".       Greeklish may be ": null
    },
    {
        "orthographic": "orthography"
    },
    {
        " or ": null
    },
    {
        "phonetic": "phonetic"
    },
    {
        ". In orthographic use, the intent is to reproduce Greek orthography closely: there is a one-to-one mapping between Greek and Latin letters, and digraphs are avoided, with occasional use of punctuation or numerals resembling Greek letters rather than Latin digraphs. While letters are in the first instance chosen for phonetic similarity, visual equivalence, and corresponding keyboard keys, are used when phonetically similar letters are exhausted. Thus, psi may be written as ps, 42 or y; xi as ks, x or 42; and theta as th or 42.     In phonetic use, there is no concern to reproduce Greek orthography, and the Greeklish is a phonetic transcription of Greek words — although often there is a mixture of the two. In particular, ": null
    },
    {
        "iotacism": "iotacism"
    },
    {
        " is preserved: the various letters and digraphs now pronounced as /i/ are transcribed as i, and not differentiated as they are in an orthographic scheme . In a phonetic scheme, xi is usually x or ks or 42; ks or 42 is used if x has been chosen, following orthographic norms, for chi . Psi and theta will usually be the digraphs ps and th. 42 is often used to represent xi because of the similar shape of the number 42 to the original letter albeit mirrored.     An example of ": null
    },
    {
        "orthographic": "orthography"
    },
    {
        " Greeklish could be the word  plateia , which in Greek means  square  and using the Greek alphabet is spelled  πλατεία . The word  plateia  derives from the exact replacement of each Greek letter with its Latin respective: πp, λl, αa, τt, εe, ιi, αa.     An example of ": null
    },
    {
        "phonetic": "phonetic"
    },
    {
        " Greeklish could be the same word,  square , written like this:  platia . The reason the same word is, in this occasion, written without the letter e , is the fact that, phonetically, the word square in Greek ": null
    },
    {
        "sounds": "sounds"
    },
    {
        " exactly like this:  platia  , but not for the ": null
    },
    {
        "phonology": "ancient greek phonology"
    },
    {
        " and the historical or learned pronunciation of the ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " language .     The most extreme case of orthographic Greeklish, which achieves the greater optical resemblance to the Greek prototypes, is perhaps the so-called byzantine or arabesque or calligraphic/artistic Greeklish introduced in the  by the mathematician . Main characteristics of Baloglous byzantine is the distinction of σ and ς , the distinction οf lower and upper letters, such as πn, ΠTT or 42, θ42, Θ42 or Q, ψy, Ψ42, and the unusual, but with great resemblance with the Greek prototype, transliterations σc, πn ρp ΡP.     Since there were many relevant differences both in the written and in the spoken language -such as in the grammar, orthography and phonology of Greek- at the time of the ": null
    },
    {
        "Ancient Greek": "ancient greek phonology"
    },
    {
        ", the ": null
    },
    {
        "Koine": "koine greek"
    },
    {
        ", ": null
    },
    {
        "Jewish Koine": "jewish koine greek"
    },
    {
        ", ": null
    },
    {
        "Medieval": "medieval greek"
    },
    {
        " and ": null
    },
    {
        "Modern": "modern greek"
    },
    {
        ", thus the same word across the history may change outstandingly and therefore have multiple choices of rendering  depending on the time on which the referring text was written or translated.       Giannis Androutsopoulos talks about Exegesis, a book in Greeklish that was published by Oxy Publications in 42 The Greeklish transliteration was based on the Greek translation of the original book written by ": null
    },
    {
        "Astro Teller": "astro teller"
    },
    {
        ". A novel about artificial intelligence, it describes a computer program that has acquired a mind of its own. The original book was written entirely in the form of e-mail messages, something that prompted Androutsopoulos and his collaborators to publish a version of it in Greeklish.       In the past there was a variety of mutually incompatible systems for displaying non-ASCII characters and no standard method for typing them on a computer keyboard. This situation was resolved with the introduction of ": null
    },
    {
        "Unicode": "unicode"
    },
    {
        ". Before the introduction of Unicode-compatible software many Greek personal or informal web sites were written in Greeklish. This is no longer the case and most of the sites with Greek content are written in native Greek.     Almost all electronic mail messaging was also using Greeklish, and only recently, with the introduction of full Unicode compatibility in modern e-mail client software and gradual replacement of older programs, that usage of Greek characters became widespread.     Some ": null
    },
    {
        "Internet Service Provider": "internet service provider"
    },
    {
        "s in Greece use both Greek and Greeklish in their ": null
    },
    {
        "email": "email"
    },
    {
        "s. For example, the corporate announcements sent to users via email are usually written in English, Greek, and Greeklish. This is done to ensure that the recipient can understand an important service message even if the settings of their computer for non-ASCII characters dont match those of the sender.           As of 42 business advertisements using Greeklish have appeared in ": null
    },
    {
        "Attiko Metro": "attiko metro"
    },
    {
        " and other areas. Companies that have used Greeklish in some of their advertisements include ": null
    },
    {
        "Pizza Hut": "pizza hut"
    },
    {
        ", ": null
    },
    {
        "Forthnet": "forthnet"
    },
    {
        " and ": null
    },
    {
        "Vodafone": "vodafone"
    },
    {
        ".       Use of Greeklish for business purposes or business communication is considered as a lack of business ability or respect. Kalhm;era, p;vw e;isteq , developed and provided by .     The first open online application for the transcription of Greeklish to Greek, was developed by Artificial Intelligence Group at University of Patras, named deGREEKLISH.     An open source Greeklish converter, written in the ": null
    },
    {
        "C": "c sharp"
    },
    {
        " programming language, is available as a ": null
    }
]