[
    {
        "           Greed is a 42 American ": null
    },
    {
        "silent film": "silent film"
    },
    {
        ", written and directed by ": null
    },
    {
        "Erich von Stroheim": "erich von stroheim"
    },
    {
        " and based on the 42 ": null
    },
    {
        "Frank Norris": "frank norris"
    },
    {
        " novel  McTeague . It stars ": null
    },
    {
        "Gibson Gowland": "gibson gowland"
    },
    {
        " as Dr. John McTeague, ": null
    },
    {
        "ZaSu Pitts": "zasu pitts"
    },
    {
        " as Trina Sieppe, his wife, and ": null
    },
    {
        "Jean Hersholt": "jean hersholt"
    },
    {
        " as McTeagues friend and eventual enemy Marcus Schouler. The film tells the story of McTeague, a San Francisco dentist, who marries his best friend Schoulers girlfriend Trina.     Greed was one of the few films of its time to be shot entirely on location, with Stroheim shooting approximately 42 hours of footage before editing. Two months alone were spent shooting in ": null
    },
    {
        "Death Valley": "death valley"
    },
    {
        " for the films final sequence, and many of the cast and crew became ill. Stroheim used sophisticated filming techniques such as ": null
    },
    {
        "deep-focus": "deep-focus"
    },
    {
        " cinematography and ": null
    },
    {
        "montage editing": "soviet montage theory"
    },
    {
        ". He considered Greed to be a ": null
    },
    {
        "Greek tragedy": "greek tragedy"
    },
    {
        ", in which environment and heredity controlled the characters fates and reduced them to primitive bêtes humaines , a ": null
    },
    {
        "naturalistic": "naturalism"
    },
    {
        " concept in the vein of ": null
    },
    {
        "Zola": "émile zola"
    },
    {
        ".     During editing on Greed, the production company merged into ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer"
    },
    {
        ", putting ": null
    },
    {
        "Irving Thalberg": "irving thalberg"
    },
    {
        " in charge of the films post-production. Thalberg had fired Stroheim a few years earlier at ": null
    },
    {
        "Universal Pictures": "universal pictures"
    },
    {
        ". Originally almost eight hours long, Greed was edited against Stroheims wishes to about two-and-a-half hours. Only twelve people saw the full-length 42-reel version, now ": null
    },
    {
        "lost": "list of incomplete or partially lost films"
    },
    {
        "; some of them called it the greatest film ever made. Stroheim later called Greed his most fully realized work and was hurt both professionally and personally by the studios re-editing of it.     The uncut version has been called the holy grail for film archivists, amid repeated false claims of the discovery of the missing footage. In 42 ": null
    },
    {
        "Turner Entertainment": "turner entertainment"
    },
    {
        " created a four-hour version of Greed that used existing stills of cut scenes to reconstruct the film. Greed was a critical and financial failure upon its initial release, but, by the 42s, it began to be regarded as one of the ": null
    },
    {
        "greatest films ever made": "list of films considered the best"
    },
    {
        "; filmmakers and scholars have noted its influence on subsequent films.            John McTeague is a miner working in ": null
    },
    {
        "Placer County, California": "placer county, california"
    },
    {
        ". A traveling dentist calling himself Dr. Painless Potter visits the town, and McTeagues mother begs Potter to take her son on as an apprentice. Potter agrees and McTeague eventually becomes a dentist, practicing on ": null
    },
    {
        "Polk Street": "polk street"
    },
    {
        " in ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        ".     Marcus Schouler brings Trina Sieppe, his cousin and intended fiancée, into McTeagues office for dental work. Schouler and McTeague are friends and McTeague gladly agrees to examine her. As they wait for an opening, Trina buys a lottery ticket. McTeague becomes enamored with Trina and begs Schouler for permission to court Trina. After seeing McTeagues conviction, Schouler agrees. Trina eventually agrees to marry McTeague and shortly afterwards her lottery ticket wins her $42. Schouler bitterly claims that the money should have been his, causing a rift between McTeague and Schouler. After McTeague and Trina wed, they continue to live in their small apartment with Trina refusing to spend her $42.          Schouler leaves the city to become a cattle rancher. Before he goes, he secretly, in order to ruin his former friend, reports McTeague for practicing dentistry without a license. McTeague is ordered to shut down his practice or face jail. Even though she has saved over $42 in addition to the original $42 from the lottery ticket, Trina is unwilling to spend her money. Money becomes increasingly scarce, with the couple forced to sell their possessions. McTeague finally snaps and bites Trinas fingers in a fit of rage. Later, he goes fishing to earn money, taking Trinas savings .     Trinas bitten fingers become infected and have to be amputated. To earn money she becomes a janitor at a childrens school. She withdraws the $42 from the bank to keep it close to her, eventually spreading it on her bed so she can sleep on it. McTeague then returns, having spent the money he took, and asks Trina for more. The following day McTeague confronts Trina at the school. After a heated argument McTeague beats Trina to death and steals her $42.     Now an outlaw, McTeague returns to Placer County and teams up with a prospector named Cribbens. Headed towards Death Valley, they find a large quantity of ": null
    },
    {
        "quartz": "quartz"
    },
    {
        " and plan to become millionaires. Before they can begin mining, McTeague senses danger and flees into Death Valley with a single horse, the remaining money and one water jug. Several marshals pursue him, joined by Schouler. Schouler wants to catch McTeague personally and rides into Death Valley alone.     The oppressive heat slows McTeagues progress. Schoulers progress is also beginning to wane when he spies McTeague and moves in to arrest him. After a confrontation, McTeagues horse bolts and Schouler shoots it, puncturing the water container. The water spills onto the desert floor. The pair fight one last time, with McTeague proving the victor; however, Schouler has handcuffed himself to McTeague. The film ends with McTeague left in the desert with no horse and no water, handcuffed to a corpse and unable to reach the remaining money.         Von Stroheims original edit contained two main sub-plots that were later cut. The point of these sub-plots was to contrast two possible outcomes of Trina and McTeagues life together. The first depicted the lives of the junkman Zerkow and Maria Miranda Macapa, the young Mexican woman who collects junk for Zerkow and sold Trina the lottery ticket. Maria often talks about her imaginary solid gold dining set with Zerkow, who becomes obsessed by it. Eventually, believing she has riches hidden away, Zerkow marries her. He often asks about it, but she gives a different answer each time he mentions it. Zerkow does not believe her and becomes obsessed with prying the truth from her. He murders her and after having lost his mind, leaps into ": null
    },
    {
        "San Francisco Bay": "san francisco bay"
    },
    {
        ".     The second sub-plot depicts the lives of Charles W. Grannis and Miss Anastasia Baker. Grannis and Baker are two elderly boarders who share adjoining rooms in the apartment complex where Trina and McTeague live. Throughout their time at the apartment complex, they have not met. They both sit close to their adjoining wall and listen to the other for company, so they know almost everything about each other. They finally meet and cannot hide their long-time feelings for each other. When they reveal their love, Grannis admits he has $42, making him just as rich as Trina. But this makes little difference to them. Eventually, they marry and a door connects their rooms.        ": null
    },
    {
        "Gibson Gowland": "gibson gowland"
    },
    {
        " as Dr. John McTeague, a dentist   ": null
    },
    {
        "ZaSu Pitts": "zasu pitts"
    },
    {
        " as Trina Sieppe, McTeagues wife   ": null
    },
    {
        "Jean Hersholt": "jean hersholt"
    },
    {
        " as Marcus Schouler, McTeagues friend   ; Prologue   ": null
    },
    {
        "Jack Curtis": "jack curtis"
    },
    {
        " as McTeagues father   ": null
    },
    {
        "Tempe Pigott": "tempe pigott"
    },
    {
        " as McTeagues mother   Florence Gibson as a hag   Erich von Ritzau as Dr. Painless Potter, a travelling dentist   ; Sieppe Family   ": null
    },
    {
        "Chester Conklin": "chester conklin"
    },
    {
        " as Hans Popper Sieppe, Trinas father   ": null
    },
    {
        "Silvia Ashton": "sylvia ashton"
    },
    {
        " as Mommer Sieppe, Trinas mother   Austen Jewell as August Sieppe, Trinas younger brother   Oscar Gottell as Max Sieppe, Trinas younger brother   Otto Gottell as Moritz Sieppe, Trinas younger brother   ": null
    },
    {
        "Joan Standing": "joan standing"
    },
    {
        " as Selina, Trinas cousin   Max Tyron as Uncle Rudolph Oelbermann, Trinas uncle     ; Subplots   ": null
    },
    {
        "Dale Fuller": "dale fuller"
    },
    {
        " as Maria Miranda Macapa, Zerkows wife   ": null
    },
    {
        "Cesare Gravina": "cesare gravina"
    },
    {
        " as Zerkow, a junkman   ": null
    },
    {
        "Frank Hayes": "frank hayes"
    },
    {
        " as Charles W. Grannis, proprietor of the Modern Dog Hospital   ": null
    },
    {
        "Fanny Midgley": "fanny midgley"
    },
    {
        " as Miss Anastasia Baker, Grannis neighbor and later wife      ; Friends and Neighbors at Polk Street   ": null
    },
    {
        "Hughie Mack": "hughie mack"
    },
    {
        " as Mr. Heise, the harness maker   E. Tiny Jones as Mrs. Heise   ": null
    },
    {
        "J. Aldrich Libbey": "j. aldrich libbey"
    },
    {
        " as Mr. Ryer   Reta Revela as Mrs. Ryer   S.S. Simon as Joe Frenna   Hugh J. McCauley as the photographer   William Mollenhauer as the palmist   ; Others   William Barlow as the Minister   ": null
    },
    {
        "Lon Poff": "lon poff"
    },
    {
        " as the man from the lottery company   James F. Fulton as Cribbens, a prospector   James Gibson as a Deputy   ": null
    },
    {
        "Jack McDonald": "jack mcdonald"
    },
    {
        " as the sheriff of Placer County   Erich von Stroheim as the balloon vendor                 Greed is based on the American author ": null
    },
    {
        "Frank Norris": "frank norris"
    },
    {
        "s 42 novel  McTeague: A Story of San Francisco . Stroheims interest in McTeague can be traced back to January 42 when he told a journalist that he wanted to film the novel. He had lived in San Francisco in the early 42s, living there in poverty like that of the storys characters. He eventually moved to Los Angeles, and worked his way up in the film industry from extra to acting in villainous or aristocratic roles in films By 42 Stroheim had finally become a successful director in his own right at ": null
    },
    {
        "Universal Film Manufacturing Company": "universal studios"
    },
    {
        ", although one with a reputation of going over budget and over schedule.     Upon the appointment of ": null
    },
    {
        "Irving Thalberg": "irving thalberg"
    },
    {
        " as general manager at Universal, Stroheims defiance of commercial and industrial norms was no longer tolerated. After Thalbergs prior shutdown of  Foolish Wives  in 42 , and after six weeks of filming on  Merry-Go-Round , Stroheim was finally fired from the studio on October 42 42 This was a step unprecedented in Hollywood, heralding a new era in which the producer and the studio would hold artistic control over actors and directors. However, by this time Stroheim had received several offers of contracts with other studios, even before being fired from Universal. He had met with executives of the ": null
    },
    {
        "Goldwyn Company": "goldwyn pictures"
    },
    {
        " on September 42 42 less than a month before, and he formally signed with them in late November.          Stroheim chose his new studio because of the level of artistic freedom he was offered, which he had been denied at Universal under Thalberg. Since March of that year, Goldwyn had been run by ": null
    },
    {
        "Abe Lehr": "abe lehr"
    },
    {
        ", who publicly promised that each director will have his own staff and will be given every facility in putting into production his own individuality and personality.  Stroheim signed a one-year, three-feature deal with Goldwyn on November 42 42 The deal stipulated that each feature would be between  long, cost no more than $42 and be completed in fourteen weeks. It also promised von Stroheim $42 for each completed film.     Lehr initially hired Stroheim in order to film a big-budget version of the ": null
    },
    {
        "operetta": "operetta"
    },
    {
        "  The Merry Widow , which the producer saw as a guaranteed hit; Stroheim, however, convinced Lehr to let him make Greed first, promising low costs. A press release of February 42 said that although Stroheim had run rather freely to large sets in the past, seems to have reformed—or surrendered—for it is announced that he will not build any sets at all.      Stroheim wrote a highly detailed 42-page script that contained camera movements, composition and ": null
    },
    {
        "tint": "film tinting"
    },
    {
        " cues. Among the changes that he made to Norriss novel was giving McTeague the first name of John and omitting Norriss ": null
    },
    {
        "anti-Semitism": "anti-semitism"
    },
    {
        ". McTeague had been filmed once before as  Lifes Whirlpool , a five-reel short by ": null
    },
    {
        "William A. Brady": "william a. brady"
    },
    {
        "s World Pictures, starring Broadway star ": null
    },
    {
        "Holbrook Blinn": "holbrook blinn"
    },
    {
        " as McTeague, which had been released in 42 Film critics disliked this version and Stroheim later criticized Blinns performance. According to film historian ": null
    },
    {
        "Kevin Brownlow": "kevin brownlow"
    },
    {
        ", Lifes Whirlpool was also shot on location in Death Valley.     Stroheim was known for his meticulous perfectionism and attention to detail, as well as his insolence towards studio executives. Working on Greed, Stroheim set out to make a realistic film about everyday people and rejected the Hollywood tropes of glamor, happy endings and upper-class characters. Before shooting began, Stroheim told a reporter:          In early January 42 Stroheim arrived in San Francisco, where he scouted locations and finished writing the shooting script. While researching for Greed, he attended society functions in town and met many friends of Frank Norris, including his brother ": null
    },
    {
        "Charles": "charles gilman norris"
    },
    {
        " and his sister-in-law ": null
    },
    {
        "Kathleen": "kathleen norris"
    },
    {
        ". To capture the authentic spirit of the story, Stroheim insisted on filming on location in San Francisco, the ": null
    },
    {
        "Sierra Nevada": "sierra nevada"
    },
    {
        " mountains, the Big Dipper Mine in ": null
    },
    {
        "Iowa Hill": "iowa hill, california"
    },
    {
        ", and Death Valley. He rented some of the actual buildings that had inspired scenes in the novel. Other locations included ": null
    },
    {
        "Cliff House": "cliff house, san francisco"
    },
    {
        " and San Francisco Bay.     Norris had similarly scouted settings for his novel and chose the upstairs of a building on the corner of Polk and California street as McTeagues dentist office, as well as many of the saloons and lunch counters in the area. Stroheim discovered that many of the locations that Norris had described, such as Polk Street, had been destroyed in the ": null
    },
    {
        "42 San Francisco earthquake": "1906 san francisco earthquake"
    },
    {
        ", but he was able to find suitable period locations on Hayes and Laguna streets. For authenticity, Stroheim had no sets built in San Francisco and only redecorated existing locations, such as saloons, butcher shops, and wooden shacks, thus saving on construction costs.     Despite the strict conditions of Stroheims initial contract, Goldwyn approved the lengthy shooting script before filming began. Production Manager J. J. Cohn later explained that they thought they could control him when the time comes.           With the exception of ": null
    },
    {
        "Jean Hersholt": "jean hersholt"
    },
    {
        ", all of the main actors in Greed were regulars of Stroheims earlier films, a group dubbed the Stroheim Stock Company . ": null
    },
    {
        "Gibson Gowland": "gibson gowland"
    },
    {
        " had previously appeared in  Blind Husbands  and returned to the U.S. from Scotland for the role of John McTeague. ": null
    },
    {
        "Cesare Gravina": "cesare gravina"
    },
    {
        ", who played the junkman Zerkow, and ": null
    },
    {
        "Dale Fuller": "dale fuller"
    },
    {
        ", the lottery-ticket seller Maria, had both appeared in Foolish Wives and would later appear in The Merry Widow. Other actors in Stroheims Stock Company included ": null
    },
    {
        "Sidney Bracey": "sidney bracey"
    },
    {
        ", ": null
    },
    {
        "Mae Busch": "mae busch"
    },
    {
        ", ": null
    },
    {
        "George Fawcett": "george fawcett"
    },
    {
        ", ": null
    },
    {
        "Maude George": "maude george"
    },
    {
        ", ": null
    },
    {
        "Hughie Mack": "hughie mack"
    },
    {
        " and ": null
    },
    {
        "George Nichols": "george nichols"
    },
    {
        ".     Trina was the most difficult role to cast, and ": null
    },
    {
        "ZaSu Pitts": "zasu pitts"
    },
    {
        " was hired at the last minute, after Stroheim had rejected both ": null
    },
    {
        "Claire Windsor": "claire windsor"
    },
    {
        " and ": null
    },
    {
        "Colleen Moore": "colleen moore"
    },
    {
        ". Pitts had previously acted only in comedic roles; Greed was her first dramatic part. The actress later appeared in both  The Wedding March  and  Hello, Sister!  Stroheim said that Pitts was the greatest psychopathological actress in the American cinema and that she should not be in comedy, for she is the greatest of all tragediennes.      Stroheim had met casually with Jean Hersholt to discuss the role of Marcus Schouler, but he was initially reluctant to cast him. However, after Hersholt adjusted his appearance and wardrobe to more closely resemble Schouler, Stroheim changed his mind on the spot. With the exception of Gowland, Stroheim shot extensive ": null
    },
    {
        "screen test": "screen test"
    },
    {
        "s of all the other actors at Goldwyn with cinematographer ": null
    },
    {
        "Paul Ivano": "paul ivano"
    },
    {
        ". A scene from the Goldwyn film  Souls for Sale  is thought to be behind-the-scenes footage of Stroheim directing Greed, but it actually depicts him directing Hersholt during one of these screen tests.         Filming began in San Francisco on March 42 42 and lasted until late June. Despite the initial contract between von Stroheim and Goldwyn, Lehr agreed to double the films budget to $42 three days after shooting began. Von Stroheim had already worked twenty-hour days for over two months of pre-production and collapsed on set after a few days of filming. He remained in good health for the remainder of the shoot. This was not the only mishap on set; during scenes shot at San Francisco Bay, Cesare Gravina got double pneumonia, making von Stroheim bitterly ashamed that Gravinas entire performance was later cut from the film, despite the actors dedication to the role. Hersholt was knocked out by Gowland during the picnic scene in which McTeague and Schouler fight, and Pitts was almost run over by a trolley. In late May, Lehr visited von Stroheim on the set and praised the footage that he had seen, saying that it has atmosphere, color and realism that could not possibly have been reproduced in the studio.      One scene that von Stroheim re-shot at the studios insistence depicted a younger McTeague in his apprenticeship with Potter. In the scene McTeague is too embarrassed to examine the teeth of a young woman and Potter has to take over. A thinly disguised ZaSu Pitts portrayed the woman so that the audience would see a resemblance to Trina, but the studio insisted that the scene was confusing and von Stroheim agreed to re-shoot it. Von Stroheim also conceded his original vision when shooting the bar confrontation between McTeague and Schouler. The director wanted to have a knife thrower actually throw a real knife at Gibson Gowlands head. Von Stroheim was overruled by Gowland himself, who refused to allow such a dangerous stunt. A ": null
    },
    {
        "special-effect": "special-effect"
    },
    {
        " shot was used instead.          After filming in San Francisco wrapped in late June, the production traveled to ": null
    },
    {
        "Death Valley": "death valley"
    },
    {
        ". Most Hollywood films that required desert scenes settled for the local ": null
    },
    {
        "Oxnard": "oxnard"
    },
    {
        " dunes north of Los Angeles, but von Stroheim insisted on authenticity. Death Valley had no roads, hotels, gas stations or running water and was occupied by tarantulas, scorpions and venomous snakes. The nearest populated area to the shoot was  away and insurance coverage was denied. Filming in Death Valley lasted for two months during midsummer, allowing actors Gowland and Hersholt time to grow the beards necessary for the sequence. Some members of the production reported temperatures between , but the highest temperature officially recorded in Death Valley during the period was .  Of the 42 members of the cast and crew who worked on the Death Valley sequence, 42 became ill and were sent back to Los Angeles.     While shooting, crew members would collapse of heat exhaustion every day. Hersholt spent a week in the hospital after shooting was completed, suffering from internal bleeding. Hersholt claimed to have lost , and was covered in blisters by the end of filming. Despite the hardship Hersholt said that he considered it the best role of his career. In order to motivate Hersholt and Gibson during the scene where they fight, von Stroheim yelled at them, Fight, fight! Try to hate each other as you both hate me!  Throughout filming, von Stroheim brought musicians on set to help create mood for the actors. He continued to use this for the Death Valley scenes with a ": null
    },
    {
        "harmonium": "harmonium"
    },
    {
        " and ": null
    },
    {
        "violin": "violin"
    },
    {
        " player. A theme, inspired by the music of ": null
    },
    {
        "Ruggero Leoncavallo": "ruggero leoncavallo"
    },
    {
        ", was composed and played throughout production. Other music used included the popular songs ": null
    },
    {
        "Nearer, My God, to Thee": "nearer, my god, to thee"
    },
    {
        " , ": null
    },
    {
        "Hearts and Flowers": "hearts and flowers"
    },
    {
        " , ": null
    },
    {
        "Oh Promise Me": "oh promise me"
    },
    {
        " , and Call Me Thine Own .     Filming moved to Placer County, California on September 42 and continued for less than a month. The Big Dipper Mine had been closed for ten years, so von Stroheim convinced the Goldwyn Company to lease and renovate it for filming. While first visiting Placer County during pre-production, von Stroheim had met Harold Henderson, a local resident and fan of Norris whose brother had worked in the mine in the 42s. Von Stroheim hired Henderson to oversee the renovation of the mine and other locations in Iowa Hill. Von Stroheim also wanted to restore the local cemetery for a newly invented scene depicting McTeagues mothers funeral, but the Goldwyn Company turned down this proposal. Inside the mine, von Stroheim usually shot at night between 42  pm and 42  am. Cinematographer ": null
    },
    {
        "William H. Daniels": "william daniels"
    },
    {
        " later said that von Stroheim insisted on descending  underground for realism, even though the setting would have looked exactly the same at . Filming was completed on October 42 42 after 42 days. Despite his original contract stipulating that all films be under , von Stroheim shot a total of  of footage for the film, running approximately 42 hours.              Stroheims biographer Arthur Lennig compared the directors visual style to that of pioneering filmmaker ": null
    },
    {
        "D. W. Griffith": "d. w. griffith"
    },
    {
        ", but felt that unlike Griffith, who viewed scenes as though through a fourth wall, Stroheim shot from many sides and from different angles; he also used deep-focus, meaningful foregrounds and effective camera movement.  Greeds lighting included high contrast, ": null
    },
    {
        "chiaroscuro": "chiaroscuro"
    },
    {
        " techniques with pools or shafts of lights illuminating an otherwise dark space. Examples of this technique include the scene where McTeague begs Trina for money in a pool of moonlight and the merry-go-round scene in which characters alternate between appearing only as dark silhouettes and being fully lit.     Daniels was especially proud of the wedding scene, which has a funeral procession visible through the window and was difficult to light properly. Greed has often been praised for its use of ": null
    },
    {
        "deep-focus": "deep-focus"
    },
    {
        " cinematography, seventeen years before its more-famous application in  Citizen Kane . Daniels sometimes used ": null
    },
    {
        "incandescent light": "incandescent light"
    },
    {
        "s instead of studio ": null
    },
    {
        "arc lights": "arc lamp"
    },
    {
        ", due to the constraints of his locations. He later said that Stroheim was one of the first to insist on no make-up for men, on real paint on the walls which were shiny, real glass in the windows, pure white on sets and in costumes   ... everything up to then had been painted a dull brown to mask the scratches on worn-down film prints. Although not officially credited, ": null
    },
    {
        "Ernest B. Schoedsack": "ernest b. schoedsack"
    },
    {
        " worked on the picture as a camera operator.     Stroheim favored ": null
    },
    {
        " Soviet-style montage editing": "soviet montage theory"
    },
    {
        ". Greed often uses dramatic close-ups and cuts instead of long takes. One exception to this is the scene in which Schouler becomes angry with McTeague and breaks his pipe, which was shot in one long, unbroken take. Stroheim also used symbolic cross-cutting for dramatic effect, such as his use of animals in the film and a shot of a train when McTeague and Trina first kiss. In 42 film theorist Andrew Buchanan called Stroheim a montage director, stating that each observation would be captured in a close-up and at leisure, he would assemble his shots in just the order which would most forcibly illustrate the fact.  In the 42s film critic ": null
    },
    {
        "André Bazin": "andré bazin"
    },
    {
        " praised Stroheims use of  mise en scène  and noted his one simple rule for directing. Take a close look at the world, keep on doing so and in the end it will lay bare for you all its cruelty and ugliness.      Despite Stroheims reputation as a perfectionist, Greed contains anachronisms. In the scenes on Polk Street, the main characters are clothed in 42s fashions, but the extras wear 42s clothing. Stroheim did his best to avoid such historical mistakes; he shot only those buildings that were from the era Greed was set in, and he kept motor vehicles out of sight while filming. Daniels stated that, despite his desire for authenticity, Stroheim sometimes had walls knocked out of real locations to achieve a desired camera position.         Frank Norriss novel belongs to the literary school of ": null
    },
    {
        "naturalism": "naturalism"
    },
    {
        " founded by French author ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        ". McTeague depicts the fate of its lower-class characters in terms of heredity and their environment, with the belief that mans nature, despite free will, is determined by genetic and environmental factors  and that heredity controls fate, despite efforts at upward mobility. This literary style was influenced by ": null
    },
    {
        "Charles Darwin": "charles darwin"
    },
    {
        " and portrayed characters whose higher states of being, the rational and compassionate, are in conflict with their lower states, the bête humaine . McTeague was first published in 42 and was inspired by an October 42 murder case in which Patrick Collins, a poor husband with a history of beating his wife Sarah, finally stole her money and stabbed her to death at her San Francisco workplace. Sarah Collins worked at the Lest Norris kindergarten, which was financed by Norriss family.     Von Stroheim did not see Greed as political and told a journalist that he considered it to be like a ": null
    },
    {
        "Greek tragedy": "greek tragedy"
    },
    {
        ". Despite the characters struggles with poverty and class, von Stroheim followed the naturalist technique of portraying characters whose lives are driven by fate and their inner nature. Von Stroheim employed variations of this theme in his other films, which often involved a commoner falling in love with an aristocrat or royal.          One of the cinematic techniques by which von Stroheim portrayed naturalism was animal symbolism. In Greed McTeague is associated with a canary, only briefly mentioned in the novel. Von Stroheim altered Norriss original ending and has McTeague release the canary in Death Valley. McTeague buys Trina a female canary as a wedding gift and early in their marriage von Stroheim cuts from a shot of them kissing to birds fluttering wildly in their cage. Another scene with animal imagery includes cross-cutting between a cat attempting to pounce on the canaries in the scene where Schouler bids goodbye to McTeague and Trina without telling them that he has informed on McTeague. Dogs, cats and monkeys are associated with various supporting characters. Von Stroheim also used the naturalist technique of giving characters specific objects, gestures or phrases that repeat throughout the film as a visual  leitmotif . For example, Trina tugs on her lips and McTeague fiddles with his birdcage.     Throughout his career von Stroheim used grotesque imagery and characters. This is most apparent in the wedding-banquet scene, which includes a midget, a hunchback, a woman with buck teeth and a boy on crutches. The wedding guests violently and crudely devour their meal like animals. This scene was unlike any other in films of that period, which treated meals with dignity and a sense of communion. Other instances of grotesque imagery include Trinas fingers becoming infected and amputated. Von Stroheim contrasted love scenes between McTeague and Trina with their ugly, lower-class environment, such as the sewer with the dead rat and a garbage truck driving by as they kiss.     As in his other films, von Stroheim used Christian imagery and symbols, such as crosses and churches. Trina first shows signs of greed on ": null
    },
    {
        "Easter Sunday": "easter sunday"
    },
    {
        " and is murdered by McTeague on ": null
    },
    {
        "Christmas Eve": "christmas eve"
    },
    {
        ". Christmas Eve was often depicted in von Stroheims films and was close to the date of his fathers death. Lennig asserted that the character of McTeagues father is based on von Stroheims own father, while McTeagues mother is a tribute to von Stroheims mother, to whom Greed is dedicated. Von Stroheim stated that he considered all of his good qualities to have come from his mother and all of his bad qualities to have come from his father.             Editing Greed took almost a year and von Stroheims contract did not include payment for his post-production work. He and his chief film cutter Frank Hull worked on the film for several months before completing a rough cut. Von Stroheim was indecisive during editing. He felt restricted by his contracts limitation on the length of the film. Von Stroheim colored certain scenes with gold tinting by using the ": null
    },
    {
        "Handschiegl Color Process": "handschiegl color process"
    },
    {
        ", in which individual frames are hand colored with stencils. Von Stroheim credited himself in the beginning titles with Personally directed by Erich von Stroheim.      Other than studio personnel, only twelve people saw the original 42-reel version of Greed at a special screening in January 42; they included ": null
    },
    {
        "Harry Carr": "harry carr"
    },
    {
        ", ": null
    },
    {
        "Rex Ingram": "rex ingram"
    },
    {
        ", ": null
    },
    {
        "Aileen Pringle": "aileen pringle"
    },
    {
        ", ": null
    },
    {
        "Carmel Myers": "carmel myers"
    },
    {
        ", ": null
    },
    {
        "Idwal Jones": "idwal jones"
    },
    {
        ", Joseph Jackson, Jack Jungmeyer, Fritz Tidden, Welford Beaton, Valentine Mandelstam, and ": null
    },
    {
        "Jean Bertin": "jean bertin"
    },
    {
        ". After the screening Jones, Carr and Ingram all agreed that they had just seen the greatest film ever made and that it was unlikely that a better film would ever be made. Carr wrote a review of the advance screening where he raved that he saw a wonderful picture the other day—that no one else will ever see   ... I cant imagine what they are going to do with it. It is like  Les Miserables . Episodes come along that you think have no bearing on the story, then 42 or 42 reels later it hits you with a crash. For stark, terrible realism and marvelous artistry, it is the greatest picture I have ever seen. But I dont know what it will be like when it shrinks to 42 reels.  ": null
    },
    {
        "Jonathan Rosenbaum": "jonathan rosenbaum"
    },
    {
        " suggested that Carr was most likely referring to a cut sequence early in the film that introduced all of the characters who lived in McTeagues building. The forty-minute scene depicted what the tenants did on a Saturday afternoon, and established cinematic atmosphere without furthering the plot. Rosenbaum compared the cut sequence to novels of the 42th century and to the first few hours of ": null
    },
    {
        "Jacques Rivette": "jacques rivette"
    },
    {
        "s  Out 42 . Jones publicly praised the advance screening and compared Greed to  The Cabinet of Dr. Caligari  and  Dr. Mabuse the Gambler . However, Welford Beaton of The Film Spectator disliked the 42-reel version and criticized its excessive use of close-ups.          Many sources claim that the 42-reel version was only ever intended to be a rough cut, and that Von Stroheim chose to cut it down to 42 reels by March 42 42 with the intention of screening it with intermissions over two nights. The director had difficulty cutting the film down, telling his friend Don Ryan, I could take out sequences and thus get the job over in a day. That would be childs play. But I cant do it. It would leave gaps that could only be bridged through titles. When you do such a thing you have illustrated subtitles instead of a motion picture.  Von Stroheim later claimed that at this time the Goldwyn Company wanted him to shoot a scene of McTeague waking up in his dentist chair, showing the entire film to have been a bad dream. While von Stroheim was editing the 42-reel cut June Mathis, who was the head of the Goldwyn Story Department, had made her own 42-reel version of Greed by January 42 42 She ordered even more cuts to be made on January 42 but then left for Rome in early February to oversee the production of  Ben-Hur  and was uninvolved in the films editing for several months.     After having completed the 42-reel cut of Greed, von Stroheim told Goldwyn executives that he could not cut another frame. Goldwyn producers thought that this version was still too long and told him to cut it to a more manageable length. Von Stroheim then sent the film to his friend, director Rex Ingram, who turned it over to his editor, ": null
    },
    {
        "Grant Whytock": "grant whytock"
    },
    {
        ". Whytock had worked with von Stroheim on  The Devils Pass Key  and was familiar with the directors style and tastes. Whytock initially proposed that it be split in two, with one 42-reel film ending with the wedding and a second 42-reel film ending at Death Valley. Whytock eventually cut the film down to 42 reels. His only major cut was the entire subplot of Zerkow and Maria, which he thought was very distasteful . Otherwise he simply cut down scenes and cut out  of quick flash shots that only lasted a few frames. However, Whytocks version of Greed retained the prologue and other subplots, as well as much of the humor that was later cut out of it.     Whytock and Ingram screened their version of Greed to studio executives, who responded favorably to it but worried that the tragic ending would be hard to sell to the public. Ingram then sent the 42-reel version to von Stroheim and told him, If you cut one more frame I shall never speak to you again.  On April 42 42 the Goldwyn Company officially agreed to merge with Metro Pictures, putting von Stroheims nemesis Thalberg directly in charge of Greed. Von Stroheim and ": null
    },
    {
        "Louis B. Mayer": "louis b. mayer"
    },
    {
        " had a lengthy confrontation over the films editing, which according to both men ended with von Stroheim claiming that all women were whores and Mayer punching him. Mayer disliked the film because of its lack of glamor, optimism or morality and considered it to be a guaranteed flop.         MGM executives screened Greed at full length once to meet contractual obligations. Idwal Jones, a San Francisco critic, attended the all-day screening and wrote that while some of the scenes were compelling, Stroheims desire that every comma of the book put in was ultimately negative.  MGM then took control and re-edited it. The studio ordered June Mathis to cut it down further;  she assigned the job to an editor named ": null
    },
    {
        "Joseph W. Farnham": "joseph w. farnham"
    },
    {
        ". Farnham was a well-known titles editor , who patched scenes together using title cards to keep continuity. His contributions to Greed include the notorious title cards Such was McTeague and Lets go over and sit on the sewer , which were snickered at for years. Eventually Farnham reduced Greed to 42 reels, totaling . Von Stroheim said that the film was cut by a hack with nothing on his mind but his hat.  He later bitterly lamented that Greed was made before the financial success of ": null
    },
    {
        "Eugene ONeill": "eugene oneill"
    },
    {
        "s four-hour play  Strange Interlude  in 42 Von Stroheim angrily disowned the final version, blaming Mathis for destroying his masterpiece.      One week before Greeds release the New York State Motion Picture Committee demanded several more cuts on moral grounds. These cuts included the administration of ": null
    },
    {
        "ether": "diethyl ether"
    },
    {
        " in the dental scenes and certain instances of foul language. Although these cuts were made to prints that were screened in New York State, the footage was kept in many other prints.         The main cuts to Greed were the elimination of its two sub-plots and other entire sequences, while individual scenes were often not touched. Commenting about the cuts made in the film to the  Los Angeles Times , Thalberg stated:        Thalberg also stated that he took no chances in cutting it. We took it around to different theaters in the suburbs, ran it at its enormous length, and then we took note of the places at which interest seemed to droop.      Individual scenes or sequences that were cut include McTeague and Trinas early, happy years of marriage, the sequence showing McTeague and Trina eventually moving into their shack, the family life of the Sieppe family before Trinas marriage, the prologue depicting McTeagues mother and father at the Big Dipper mine and McTeagues apprenticeship. Other cuts included the more suggestive and sexual close-up shots depicting McTeague and Trinas physical attraction to each other, the scenes after McTeague has murdered Trina and roams around San Francisco and Placer County, additional footage of Death Valley, additional footage of Trina with her money, and a more gradual version of Trinas descent into greed and miserly obsession.             Greed premiered on December 42 42 at the Cosmopolitan Theatre in ": null
    },
    {
        "Columbus Circle": "columbus circle"
    },
    {
        ", ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", which was owned by ": null
    },
    {
        "William Randolph Hearst": "william randolph hearst"
    },
    {
        ". Frank Norris had once worked for Hearst as a foreign correspondent during the ": null
    },
    {
        "Spanish–American War": "spanish–american war"
    },
    {
        " and Hearst praised Greed, calling it the greatest film he had ever seen. Hearsts newspapers promoted the film, but MGM did very little advertising. At the time of the release von Stroheim was in Los Angeles, having begun production on The Merry Widow on December 42 In May 42 Greed was released in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", where its premiere famously caused a riot at the theater that may have been instigated by members of the then-fledgling ": null
    },
    {
        "Nazi party": "nazi party"
    },
    {
        ".     Greed received mostly negative reviews. The trade paper Harrisons Report said that a contest were to be held to determine which has been the filthiest, vilest, most putrid picture in the history of the motion picture business, I am sure that Greed would win.   Variety Weekly  called it an out-and-out box office flop only six days after its premiere and claimed that the film had taken two years to shoot, cost $42 and was originally 42 reels long. The review went on to say that nothing more morbid and senseless, from a commercial picture standpoint, has been seen on the screen for a long, long time and that despite its excellent acting, fine direction and the undoubted power of its story   ... it does not entertain.  In its December 42 – January 42 issue, Exceptional Photoplays called it one of the most uncompromising films ever shown on the screen. There have already been many criticisms of its brutality, its stark realism, its sordidness. But the point is that it was never intended to be a pleasant picture.  In the February 42 issue of Theatre Magazine, Aileen St. John-Brenon wrote that the persons in the photoplay are not characters, but types—they are well selected, weighed and completely drilled. But they did not act; they do not come to life. They perform their mission like so many uncouth images of miserliness and repugnant animalism.  ": null
    },
    {
        "Mordaunt Hall": "mordaunt hall"
    },
    {
        " of the  New York Times  gave the film a mostly positive review in regards to the acting and directing while criticizing how it was edited, writing that MGM clipped this production as much as they dared   ... and are to be congratulated on their efforts and the only pity is that they did not use the scissors more generously in the beginning.  In a  Life Magazine  article, ": null
    },
    {
        "Robert E. Sherwood": "robert e. sherwood"
    },
    {
        " also defended MGMs cutting of the film and called von Stroheim a genius   ... badly in need of a stopwatch.  ": null
    },
    {
        "Iris Barry": "iris barry"
    },
    {
        " of the ": null
    },
    {
        "Museum of Modern Art": "museum of modern art"
    },
    {
        " disliked the tinting, saying a not very pleasing yellow tinge is smudged in.  A March 42 review in Pictureplay magazine stated, perhaps an American director would not have seen greed as a vice.      A more favorable review came from ": null
    },
    {
        "Richard Watts, Jr.": "richard watts, jr."
    },
    {
        " of the  New York Herald Tribune , who called Greed the most important picture yet produced in America   ... It is the one picture of the season that can hold its own as a work of dramatic art worthy of comparison with such stage plays as  What Price Glory?  and  Desire Under the Elms .  The April 42 42 edition of  The Montreal Gazette  claimed it impresses as a powerful film and described the capacity audience screening as one of the few pictures which are as worthy of serious consideration ... which offer a real and convincing study of life and character and that secure their ends by artistic and intellectual means rather than by writing down to the level of the groundlings. The review went on to describe the direction as masterly , citing its remarkable delineation of character development and the subtle touches which convey ideas through vision rather than the written word, an all too-rare employment of the possibilities of the cinema play as a distinct branch of art capable of truthful and convincing revelation and interpretation of lifes realities.  A review in Exceptional Photoplays stated that Mr. von Stroheim has always been the realist as Rex Ingram is the romanticist and Griffith the sentimentalist of the screen, and in Greed he has given us an example of realism at its starkest. Like the novel from which the plot was taken, Greed is a terrible and wonderful thing.          Greed was a financial disappointment. On its initial run, it earned $42 in the United States, $42 in Canada and $42 in other markets. In total it earned $42. Von Stroheims biographer Arthur Lennig stated that according to MGMs records the final cost of Greed was $42. Another biographer, Richard Koszarski, stated that its final cost was $42: $42 for the production, $42 for von Stroheims personal fee, $42 for processing and editing, $42 for advertising and $42 for Motion Picture dues.     Arthur Lennig asserted that MGMs official budget for Greed was suspiciously high for a film with no stars, no built sets, a small crew and inexpensive film stock. Lennig suspects that MGM averaged the films cost with the more expensive The Merry Widow in order to prevent von Stroheim from getting a percentage of the more profitable film. The Merry Widow ended up being a hit and earned more profits than Greed had lost; it cost $42 but earned $42 on its initial run.         In his final years, von Stroheim said that of all my films, only Greed was a fully realized work; only Greed had a total validity.  In 42 a British foundation of arts and sciences requested a copy of the original version of Greed to keep in their archive, but their request was denied by MGM. ": null
    },
    {
        "Henri Langlois": "henri langlois"
    },
    {
        " screened the studio version of Greed for von Stroheim in 42 Von Stroheim said, It was for me an exhumation. It was like opening a coffin in which there was just dust, giving off a terrible stench, a couple of vertebra and a piece of shoulder bone.  He went on to say that It was as if a mans beloved was run over by a truck, maimed beyond recognition. He goes to see her in the morgue. Of course, he still loves her but its only the memory of her that he can love—because he doesnt recognize her anymore.      In the early 42s Greeds reputation began to grow and it appeared on several lists of the greatest films ever made. In 42 at the Festival Mondial du Film et des Beaux Arts de Belgique, Greed was named the fifth greatest film ever made, with such directors as ": null
    },
    {
        "Luchino Visconti": "luchino visconti"
    },
    {
        ", ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        ", ": null
    },
    {
        "Luis Buñuel": "luis buñuel"
    },
    {
        " and ": null
    },
    {
        "Billy Wilder": "billy wilder"
    },
    {
        " voting for it. Later in 42  Sight and Sound  magazine published its first list of the ten greatest films ever made . Greed was tied for 42th place on that list, with such critics as Andre Bazin, ": null
    },
    {
        "Lotte Eisner": "lotte eisner"
    },
    {
        ", ": null
    },
    {
        "Curtis Harrington": "curtis harrington"
    },
    {
        ", ": null
    },
    {
        "Penelope Houston": "penelope houston"
    },
    {
        " and ": null
    },
    {
        "Gavin Lambert": "gavin lambert"
    },
    {
        " voting for it. In 42 it was tied for 42th on the same list. Since 42 it has failed to reach a spot on the top ten. The  Cinémathèque royale de Belgique  released a list of the most important and misappreciated American films of all time in 42 Greed was third on its list after Citizen Kane and  Sunrise: A Song of Two Humans . In a ": null
    },
    {
        "University of Southern California": "university of southern california"
    },
    {
        " list of the 42 Most Significant American Films made by the schools Performing Arts Council, Greed was listed as number 42 In 42 Greed was selected for preservation in the United States ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        " by the ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " as culturally, historically, or aesthetically significant .      Among those who have praised Greed over the years are ": null
    },
    {
        "Sergei Eisenstein": "sergei eisenstein"
    },
    {
        "; ": null
    },
    {
        "Joseph von Sternberg": "joseph von sternberg"
    },
    {
        ", who said, We were all influenced by Greed ; ": null
    },
    {
        "Jean Renoir": "jean renoir"
    },
    {
        ", who called it the film of films ; and ": null
    },
    {
        "Ernst Lubitsch": "ernst lubitsch"
    },
    {
        ", who called von Stroheim the only true novelist in films. More recently ": null
    },
    {
        "Guillermo del Toro": "guillermo del toro"
    },
    {
        " called it a perfect reflection of the anxiety permeating the passage into the 42th century and the absolute dehumanization that was to come ,  and ": null
    },
    {
        "Norbert Pfaffenbichler": "norbert pfaffenbichler"
    },
    {
        " said that the last shot of the movie is unforgettable.  American writer, filmmaker, ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        " and political activist, ": null
    },
    {
        "Susan Sontag": "susan sontag"
    },
    {
        " named Greed as one of her favorite films.  Jonathan Rosenbaum has stated that Greed was a major influence on the style and content of many films. Stroheims shots filming the sun predated ": null
    },
    {
        "Akira Kurosawa": "akira kurosawa"
    },
    {
        "s better-known uses of the technique in  Rashomon  . Rosenbaum compared specific shot set-ups in Greed to shots in ": null
    },
    {
        "King Vidor": "king vidor"
    },
    {
        "s  The Crowd , Jean Renoirs  Le Crime de Monsieur Lange , Orson Welless  The Magnificent Ambersons , ": null
    },
    {
        "Howard Hawks": "howard hawks"
    },
    {
        "  To Have and Have Not  and ": null
    },
    {
        "Michelangelo Antonioni": "michelangelo antonioni"
    },
    {
        "s  LAvventura . In addition, he likened certain plot elements or characters in Greed to ": null
    },
    {
        "John Huston": "john huston"
    },
    {
        "s  The Treasure of the Sierra Madre  , ": null
    },
    {
        "Alfred Hitchcock": "alfred hitchcock"
    },
    {
        "s  Rear Window  , ": null
    },
    {
        "Claude Chabrol": "claude chabrol"
    },
    {
        "s  Les Bonnes Femmes  and ": null
    },
    {
        "Elaine May": "elaine may"
    },
    {
        "s  Mikey and Nicky  . Rosenbaum singled out Stroheims influence on May, an American director, with Mikey and Nicky centering on the disintegration of a friendship over money and sex, and including grotesque elements and characters caught between innocence and corruption. Rosenbaum also asserts that Orson Welles use of satirical caricatures in all of his films is in the spirit of von Stroheim .     The two films most commonly compared to Greed are Hustons The Treasure of the Sierra Madre and Welles The Magnificent Ambersons. Rosenbaum believes that besides Hustons film ending with gold being lost in the desert and similarities between Trinas descent into madness with Fred C. Dobbs own obsessions, the two films have little else in common. The Magnificent Ambersons and Greed both have characters who struggle with class differences that lead to their downfall. Ambersons was famously edited down drastically by its studio and the cut footage is now lost. Rosenbaum goes on to state that Greed influenced the methods in which novels are adapted into films and filmmakers like Welles, Huston and ": null
    },
    {
        "Bill Forsyth": "bill forsyth"
    },
    {
        " followed von Stroheims example by re-arranging the plot and adding new scenes to their films while still remaining faithful to the intentions of the original novels. The 42 ": null
    },
    {
        "Jonathan Lynn": "jonathan lynn"
    },
    {
        " film  Greedy  pays tribute to the film by giving the main characters the last name McTeague.      Attempts to reconstruct the uncut version of Greed without use of the lost footage first began in 42 At the Brussels International Exposition, the Cinémathèque royale de Belgique named Greed as one of the twelve greatest films ever made and simultaneously published von Stroheims original, uncut script for Greed, which came directly from von Stroheims personal copy preserved by his widow Denise Vernac. This publication led to three separate books that all used von Stroheims script in order to reconstruct the original version of the film and compare it to the released version: a French book edited by Jacques-G. Perret in 42 and two versions edited by Joel Finler and ": null
    },
    {
        "Herman G. Weinberg": "herman g. weinberg"
    },
    {
        ", both in 42 Weinbergs book utilized 42 individual stills and production photos to reconstruct the uncut version of Greed, the first time that images from the uncut version were publicly available.     In 42 ": null
    },
    {
        "Turner Entertainment": "turner entertainment"
    },
    {
        " decided to recreate, as closely as possible, the original version by combining the existing footage with over 42 still photographs of the lost scenes ,  in accordance with an original continuity outline written by von Stroheim. All materials were provided by the ": null
    },
    {
        "Margaret Herrick Library": "margaret herrick library"
    },
    {
        ". This restoration runs almost four hours. It was produced by ": null
    },
    {
        "film preservation": "film preservation"
    },
    {
        "ist ": null
    },
    {
        "Rick Schmidlin": "rick schmidlin"
    },
    {
        " and edited by Glenn Morgan.   Schmidlin restored many characters and sub-plots from the original version. A new musical score was composed by Robert Israel. The reconstruction cost $42 to produce. Schmidlin called the finished product a reconstruction of Von Stroheims lost narrative.  It premiered at the 42 ": null
    },
    {
        "Telluride Film Festival": "telluride film festival"
    },
    {
        " and was later screened at the ": null
    },
    {
        "Venice Film Festival": "venice film festival"
    },
    {
        " and the ": null
    },
    {
        "Pordenone Silent Film Festival": "pordenone silent film festival"
    },
    {
        " before being aired on ": null
    },
    {
        "Turner Classic Movies": "turner classic movies"
    },
    {
        " on December 42 42  Film critic ": null
    },
    {
        "Todd McCarthy": "todd mccarthy"
    },
    {
        " called the restored version of Greed a triumph. ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " called Greed a masterpiece and said that the restored Schmidlin cut illustrates the prudish sensibilities went into MGMs chop job. Rosenbaum praised the project, but claimed it could only be considered a study version .  The reconstruction won a special citation from the ": null
    },
    {
        "Los Angeles Film Critics Association Awards": "los angeles film critics association awards 1999"
    },
    {
        ".          Stroheim was known to exaggerate events from his life and create myths about himself, such as his fictitious aristocratic origins and military record in ": null
    },
    {
        "Austria": "austria"
    },
    {
        ". He claimed that shortly after having moved to the US in the early 42s, he had found a copy of McTeague in a motel in New York and had read it in one sitting. He also said that wanting to adapt the book inspired him to make a career in filmmaking. ": null
    },
    {
        "Georges Sadoul": "georges sadoul"
    },
    {
        " later stated that Stroheim had first read the novel in 42 while living in poverty in Los Angeles.     Claims that Stroheims original cut was a completely unabridged version of McTeague are not accurate. Stroheims 42-page script was almost as long as the original novel, but he rethought the entire story and invented new scenes, as well as extensively elaborating existing ones. In the Norris novel, McTeagues back story in Placer County and relationships with his father, mother and Potter were remembered as a flashback and took two paragraphs. In Stroheims original Greed, this sequence took up the first hour of the film and was not a flashback. Stroheim also modernized the novels time span to between 42 and 42 a quarter-century later than the novel.     Greed has sometimes been said to be over 42 reels long. Stroheim said that his initial edit was 42 reels, although several of the people who saw this cut remembered it as being anywhere from 42 to 42 reels. Grant Whytock remembered the edited version that Stroheim initially sent to him as between 42 and 42 reels. MGMs official studio files list the original cut of the film at 42 reels. As recently as 42 former MGM Story Editor ": null
    },
    {
        "Samuel Marx": "samuel marx"
    },
    {
        " erroneously claimed that the original version of Greed was 42 reels.     June Mathis is credited with co-writing the script due to her work on the 42-reel version. Mathis was the head of the Story Department at MGM and her contract stipulated that she would receive writing credit for all MGM films. She did not actually write any part of the screenplay. She is said to have changed its title from McTeague to Greed during post-production; however, a publicity still of the cast and crew taken during production clearly indicates that it was titled Greed before the MGM merger even took place. The films working title was Greedy Wives , a nod towards Stroheims previous film Foolish Wives; this working title never was considered as the films actual title.     The original version of Greed has been called the holy grail for film archivists. Various reports of the original version being uncovered have proved to be unfounded. Among these sightings are a claim that a copy existed in a vault in South America that only was screened once a year for invited guests on New Years Eve. Another claim was that a copy in the possession of a Texan millionaire was sold to Henri Langlois of  Cinémathèque Française . Other claims include that a film society in Boston held a private screening of a print found by a World War II veteran in Berlin from a tip by ": null
    },
    {
        "Emil Jannings": "emil jannings"
    },
    {
        ", that ": null
    },
    {
        "David Shepherd": "david shepard"
    },
    {
        " of the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        " had found a copy at a garage sale, and that the head of a film society in ": null
    },
    {
        "Redwood City, California": "redwood city, california"
    },
    {
        " owned the longest existing version of Greed . Stroheim himself once stated that ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        " owned a personal copy of the film. Stroheims son Joseph von Stroheim once claimed that when he was in the Army during World War II, he saw a version of the film that took two nights to fully screen, although he could not remember exactly how long it was.     There were also reports that MGM had retained a copy of the original version. Iris Barry of the Museum of Modern Art claimed that a copy was locked in the MGM vaults, although Thalberg denied it. It was also reported that ": null
    },
    {
        "John Houseman": "john houseman"
    },
    {
        " had a private screening at MGM and that MGM owned two copies stored in a vault in a Utah salt mine. Lotte Eisner once claimed that in the 42s and 42s, several cans of films labeled McTeague were found in MGMs vaults and destroyed by executives who did not know that it was footage from Greed. MGM executive ": null
    },
    {
        "Al Lewin": "albert lewin"
    },
    {
        " said that several years after the films release Stroheim asked him for the cut footage. Lewin and editor ": null
    },
    {
        "Margaret Booth": "margaret booth"
    },
    {
        " searched MGMs vault but could not find any missing footage.": null
    }
]