[
    {
        "     The gridiron pendulum was a temperature-compensated ": null
    },
    {
        "clock": "clock"
    },
    {
        " pendulum": "pendulum"
    },
    {
        " invented by British clockmaker ": null
    },
    {
        "John Harrison": "john harrison"
    },
    {
        " around 42 and later modified by ": null
    },
    {
        "John Ellicott": "john ellicott"
    },
    {
        ". It was used in precision clocks. In ordinary clock pendulums, the pendulum rod expands and contracts with changes in temperature. The ": null
    },
    {
        "period": "frequency"
    },
    {
        " of the pendulums swing depends on its length, so a pendulum clocks rate varied with changes in ambient temperature, causing inaccurate timekeeping. The gridiron pendulum consists of alternating parallel rods of two metals with different ": null
    },
    {
        "thermal expansion": "thermal expansion"
    },
    {
        " coefficients, such as ": null
    },
    {
        "steel": "steel"
    },
    {
        " and ": null
    },
    {
        "brass": "brass"
    },
    {
        ". The rods are connected by a frame in such a way that their different thermal expansions compensate for each other, so the overall length of the pendulum, and thus its period, stays constant with temperature.     The gridiron pendulum was used during the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " period in ": null
    },
    {
        "regulator clock": "regulator clock"
    },
    {
        "s, precision clocks employed as time standards in factories, laboratories, office buildings, and post offices to schedule work and set other clocks. The gridiron became so associated with quality timekeeping that to this day many clocks have pendulums with decorative fake gridirons, which have no temperature compensating qualities.       Its simplest and later form consists of five rods. A central ": null
    },
    {
        "iron": "iron"
    },
    {
        " rod runs up from the ": null
    },
    {
        "bob": "bob"
    },
    {
        " to a point immediately below the suspension. At that point a cross-piece extends from the central rod and connects to two ": null
    },
    {
        "zinc": "zinc"
    },
    {
        " rods, one on each side of the central rod, which reach down to, and are fixed to, the bottom bridge just above the bob. The bottom bridge clears the central rod and connects to two further iron rods which run back up to the top bridge attached to the suspension. As the iron rods expand in heat, the bottom bridge drops relative to the suspension, and the bob drops relative to the middle bridge. However, the middle bridge rises relative to the bottom one because the greater expansion of the zinc rods pushes the middle bridge, and therefore the bob, upwards to match the combined drop caused by the expanding iron.        In simple terms, the upwards expansion of the zinc counteracts the combined downwards expansion of the iron . The rod lengths are calculated so that the effective length of the zinc rods multiplied by zincs ": null
    },
    {
        "thermal expansion": "thermal expansion"
    },
    {
        " coefficient equals the effective length of the iron rods multiplied by irons expansion coefficient thereby keeping the pendulum the same length.     Harrisons original construction using ": null
    },
    {
        "brass": "brass"
    },
    {
        " is more complex since brass does not expand as much as zinc does. A further set of rods and bridges is needed giving nine rods in all, five iron and four brass. The exact degree of compensation can be adjusted by having a section of the central rod which is partly brass and partly iron. These overlap and are joined by a pin which passes through both metals. A number of holes for the pin are made in both parts and moving the pin up or down the rod changes how much of the combined rod is brass and how much is iron. In the late 42th century the ": null
    },
    {
        "Dent": "edward john dent"
    },
    {
        " company marketed a further development of the zinc gridiron in which the four outer rods were replaced by two concentric tubes which were linked by a tubular nut which could be screwed up and down to alter the degree of compensation.       Scientists in the 42s found that the gridiron pendulum had disadvantages that made it unsuitable for the highest precision clocks. The friction of the rods sliding in the holes in the frame caused the rods to adjust to temperature changes in a series of tiny jumps, rather than with a smooth motion. This caused the rate of the pendulum, and therefore the clock, to change suddenly with each jump. Later it was found that zinc is not very stable dimensionally; it is subject to ": null
    },
    {
        "creep": "creep"
    },
    {
        ". Therefore, another type of temperature-compensated pendulum, the ": null
    },
    {
        "mercury pendulum": "pendulummercury pendulum"
    },
    {
        ", was used in the highest precision clocks.     By 42 the highest precision astronomical regulators used pendulums of low thermal expansion materials like ": null
    },
    {
        "invar": "invar"
    },
    {
        " and ": null
    },
    {
        "fused quartz": "fused quartz"
    },
    {
        ".                ": null
    }
]