[
    {
        "     In ": null
    },
    {
        "individualist anarchist": "individualist anarchism"
    },
    {
        " discourse": "discourse"
    },
    {
        ", a group entity is usually distinguished from an individual ": null
    },
    {
        "hominid": "hominidae"
    },
    {
        ", or animal groups from a single living being of any sexual species. All group-entities are assumed to have certain characteristics in common, most of them sociopathic or destructive to the interests of individuals.     Some support exists for this political view in modern human sciences. Mainstream psychological and sociological research identifies characteristics of human groups including ": null
    },
    {
        "groupthink": "groupthink"
    },
    {
        ", ": null
    },
    {
        "peer pressure": "peer pressure"
    },
    {
        " and ": null
    },
    {
        "mass hysteria": "mass hysteria"
    },
    {
        " that support this view, but fall short of identifying all group-entities as malignant. ": null
    },
    {
        "Political science": "political science"
    },
    {
        " identifies phenomena such as ": null
    },
    {
        "mob rule": "ochlocracy"
    },
    {
        ", ": null
    },
    {
        "mass hysteria": "mass hysteria"
    },
    {
        " and ": null
    },
    {
        "moral panic": "moral panic"
    },
    {
        " but of course also studies positive cooperation such as ": null
    },
    {
        "social capital": "social capital"
    },
    {
        " and ": null
    },
    {
        "political virtues": "political virtues"
    },
    {
        " but also more debatable phenomena such as the ": null
    },
    {
        "political party": "political party"
    },
    {
        ". See below for references to fields and authorities supporting this view.     Users of the term group entity effectively signal a critical view of group actions and skepticism of positive claims for human group achievements, usually preferring to attribute group success to underlying individual ": null
    },
    {
        "leadership": "leadership"
    },
    {
        " and ": null
    },
    {
        "relationships": "interpersonal relationship"
    },
    {
        ".         In the anarchist discourse, groups are seen often as akin to asexual beings, reproducing by copying  rather than by sharing. Groups are also uninterested in interaction other than consumption . Group relations are described as limited to eat-or-be-eaten, in contrast to individuals who can engage in more complex types of interaction with the more complex cognition that sexual reproduction and social living require. The ability to sexually reproduce, in other words, is the main ": null
    },
    {
        "ontological distinction": "ontological distinction"
    },
    {
        " between a genuine being and faux or pretend entities that cannot share interests nor sympathize with sexually reproducing beings. An unbridgeable cognitive gap is assumed to exist between things that make more of themselves by meeting, sharing, mating and protecting offspring, and things that make more of themselves by simply consuming and then splitting off their successor entities.     ": null
    },
    {
        "Biology": "biology"
    },
    {
        " makes similar distinctions but only ": null
    },
    {
        "sociobiology": "sociobiology"
    },
    {
        " and the ": null
    },
    {
        "autopoietic": "autopoietic"
    },
    {
        " approach to biology generally assume, as most anarchists do, that the origin or type of being decisively determines its cognition and limits its ability to empathize or agree.     Political implications of assuming reproduction style frames cognition and cooperation are profound and have immediate legal and political implications. Stricter individualist anarchists generally deny the assertion that ": null
    },
    {
        "private corporation": "corporation"
    },
    {
        "s, for instance, are fundamentally different from ": null
    },
    {
        "trade union": "trade union"
    },
    {
        "s or ": null
    },
    {
        "political parties": "political party"
    },
    {
        " or religious institutions or even ": null
    },
    {
        "non-governmental organization": "non-governmental organization"
    },
    {
        "s. All such entities are seen as self-interested and interested only in their own propagation - their relation to individuals is predatory, parasitic, and only rarely symbiotic. Even if those individuals perceive those groups as serving their own interests, the anarchist argues, they are actually accepting a proxy for those interests.     In particular the distinction is important for sexual interests, which are the most obvious interests that group-entities cannot have, having no sexual feelings, and able to deal in sex only as a commodity not as a direct organismic interest, e.g. a ": null
    },
    {
        "dating game show": "dating game show"
    },
    {
        " which is motivated to indulge sexual interest but only to sell ": null
    },
    {
        "advertising": "advertising"
    },
    {
        ", thus distorting the mating process to serve commerce. A response to this argument is that groups also do not feel hunger, but can act as a means for individuals to satisfy their hunger - this being the main motive for the corporation and collective economic effort, back to earliest systems of ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        ".     ": null
    },
    {
        "Bob Black": "bob black"
    },
    {
        " argued that it was not feelings or intentions or urges but the actual model of collaboration that distincted the group-entity. The sexual individual animal can conceive of seduction, dance, flirtation, and other means of cooperation that do not involve one entity consuming and destroying the identity of the other. Group-entities have no such skills nor capacities - they interact with each other in a way reminiscent of ": null
    },
    {
        "predator-prey relations": "predation"
    },
    {
        ", where the predator will consume and destroy the identity of the prey, which no longer reproduces but contributes to the predators energy. ": null
    },
    {
        "Corporate merger": "corporate merger"
    },
    {
        "s, for instance, are often presented as relationships of equals cooperating, but in fact usually one executive group or the other will be drastically reduced, the ": null
    },
    {
        "organizational structure": "organizational structure"
    },
    {
        " and ": null
    },
    {
        "ethics": "ethics"
    },
    {
        " of one of the two being obliterated. Corporations do not get each other pregnant, nor do they nurture child corporations - ": null
    },
    {
        "joint venture": "joint venture"
    },
    {
        "s being a notable exception.     As noted above, some anarchists employ arguments reminiscent of ": null
    },
    {
        "sociobiology": "sociobiology"
    },
    {
        " and relate the behavior of other animals to those of humans - including that of animal groups. They may rely on observations from ": null
    },
    {
        "ecology": "ecology"
    },
    {
        " and ": null
    },
    {
        "biology": "biology"
    },
    {
        ". For example, in a ": null
    },
    {
        "fish school": "shoaling and schooling"
    },
    {
        ", the fish have certain habits that make the school a cohesive group-entity, and which they perceive protect them from predators. But it may also be true that the school itself acts to attract predators, prevent creative or evasive actions, and acts with some ": null
    },
    {
        "collective intelligence": "collective intelligence"
    },
    {
        " to cut out its weaker members - none of which necessarily benefits the individual fish obeying school rules. Much of anarchist discourse consists of comparing human behavior to that of other pack or social animals, and focuses on the collective stupidity such habits imply - also known in ": null
    },
    {
        "psychology": "psychology"
    },
    {
        " as ": null
    },
    {
        "groupthink": "groupthink"
    },
    {
        ". ": null
    },
    {
        "John Zerzan": "john zerzan"
    },
    {
        " considers even ideas of number to reflect such a groupthink.     Some, possibly following ": null
    },
    {
        "Jonathan Swift": "jonathan swift"
    },
    {
        ", argue that humans are the ": null
    },
    {
        "stupidest": "stupidity"
    },
    {
        " of ": null
    },
    {
        "hominid": "hominidae"
    },
    {
        "s when massed socially, no better than domestic animals bred for either chaos or slavery, and have thus lost much of their capacity to solve ecological or social problems with creativity. ": null
    },
    {
        "War": "war"
    },
    {
        ", ": null
    },
    {
        "fundamentalist religion": "religious fundamentalism"
    },
    {
        " and ": null
    },
    {
        "pathological consumption": "pathological consumption"
    },
    {
        " are often seen as mere symptoms of this. These phenomena are sometimes presented as arguments against ": null
    },
    {
        "civilization": "civilization"
    },
    {
        " itself as a process. Certainly Gullivers Travels presents cogent arguments of this sort.     The theory of ": null
    },
    {
        "eco-anarchism": "eco-anarchism"
    },
    {
        " focuses on reducing reliance on group-entities specifically to reactivate creativity, and strengthen inter-generational ties as an alternative to same-generation peer-groups  or school. ": null
    },
    {
        "Daniel Quinn": "daniel quinn"
    },
    {
        "s book  Ishmael  presents a positive vision of ": null
    },
    {
        "tribalism": "tribalism"
    },
    {
        " and ": null
    },
    {
        "Great Ape personhood": "great ape personhood"
    },
    {
        " is an influential work of this sort.     An interesting question is whether a ": null
    },
    {
        "family": "family"
    },
    {
        " which exists primarily or only to provide economic, infrastructural, instructional and emotional support to specific individuals who are related, is a group-entity distinct from feelings or methods of individual sexual animals. Families unlike the more economic or political entities focused on the outside world, do seem sometimes to merge or alter themselves so as to relate effectively in ways analogous to individuals - indeed, a traditional family is formed by exactly such a dance between two such individuals. Positive notions of ": null
    },
    {
        "tribe": "tribalism"
    },
    {
        " would seem to flow from ": null
    },
    {
        "kin": "family"
    },
    {
        " or ": null
    },
    {
        "clan": "clan"
    },
    {
        " relationships, as studied in ": null
    },
    {
        "cultural anthropology": "cultural anthropology"
    },
    {
        " and seemingly universal in not only ": null
    },
    {
        "human": "human"
    },
    {
        " but also ": null
    },
    {
        "Great Ape": "great ape"
    },
    {
        " societies.     ": null
    },
    {
        "Lewis Thomas": "lewis thomas"
    },
    {
        " noted in  Lives of a Cell , 42 that people deprived of traditional life-ways could often behave in ways reminiscent of the sociopathic and predatory ways that ": null
    },
    {
        "nation-state": "nation-state"
    },
    {
        "s interact, e.g. in ": null
    },
    {
        "zero-sum game": "zero-sum game"
    },
    {
        "s. The ": null
    },
    {
        "Ik": "ik people"
    },
    {
        "s, a people he used as example, were not longer able to hunt and pursue their forest lifestyle, and when forced to become farmers were reduced to playing cruel practical jokes on each other, revelling in each others errors and misfortunes, and squabbling in ways that reminded Thomas of the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ", i.e. not very united at all, and not reflective of a real society.     Accordingly, ": null
    },
    {
        "nationalism": "nationalism"
    },
    {
        " and the interaction between nation-states  might be the most appropriate or least controversial application of the theory of group-entities being malignant or inherently competitive and unable to cooperate for common benefit. See Prisoners Dilemma and the work of Robert Axelrod for another view of how even self-interested entities can cooperate, which tends to moderate the individualist view.         Application of the theory of inherently competitive group-entities below that level is questionable to the degree that the group or the entity does have some biological identity, e.g. an ": null
    },
    {
        "ecoregion": "ecoregion"
    },
    {
        ", a ": null
    },
    {
        "species": "species"
    },
    {
        ", a ": null
    },
    {
        "food chain": "food chain"
    },
    {
        ", the ": null
    },
    {
        "carbon cycle": "carbon cycle"
    },
    {
        " of the ": null
    },
    {
        "atmosphere": "celestial bodys atmosphere"
    },
    {
        ", the ": null
    },
    {
        "water cycle": "water cycle"
    },
    {
        " of a ": null
    },
    {
        "watershed": "drainage basin"
    },
    {
        ". Such bases for organization would seem, like that of the kin, clan, or family, to align biological and group interests, and therefore overcome the objections that group and individual entities have nothing in common. Accordingly, ": null
    },
    {
        "eco-anarchism": "eco-anarchism"
    },
    {
        " and the looser ": null
    },
    {
        "green anarchism": "green anarchism"
    },
    {
        "s, and related theories in ": null
    },
    {
        "green economics": "green economics"
    },
    {
        " such as that of ": null
    },
    {
        "trustee": "trustee"
    },
    {
        " stewardship": "stewardship"
    },
    {
        " of ": null
    },
    {
        "the commons": "the commons"
    },
    {
        ", are more likely to perceive group-entity actions as benign if the group entity itself has a biological or ecological parameter, mission or scope. For instance, ": null
    },
    {
        "watershed": "drainage divide"
    },
    {
        "s as borders, or a ": null
    },
    {
        "migration corridor": "migration corridor"
    },
    {
        "s as a ": null
    },
    {
        "right of way": "right-of-way"
    },
    {
        ", could align the interests of the biological creatures that rely on these to the group-entities that succeed via effective management of them. Several specific proposals to do this are extant today:     The theory of ": null
    },
    {
        "bioregional democracy": "bioregional democracy"
    },
    {
        " relates political party and watershed and other ecological border and management problems explicitly, as one solution to the group-entity interest problem. ": null
    },
    {
        "Peter Barnes": "peter barnes"
    },
    {
        "s ": null
    },
    {
        "Capitalism 42": "capitalism 3.0"
    },
    {
        " advances an economic theory in which explicit trustees of public commons would take their place alongside the ": null
    },
    {
        "public sector": "public sector"
    },
    {
        " and ": null
    },
    {
        "private sector": "private sector"
    },
    {
        " as a third ": null
    },
    {
        "commons sector": "commons sector"
    },
    {
        " . Such commons would include not only ": null
    },
    {
        "ocean": "ocean"
    },
    {
        "s, ": null
    },
    {
        "biodiversity": "biodiversity"
    },
    {
        " and ": null
    },
    {
        "natural capital": "natural capital"
    },
    {
        " but also the ": null
    },
    {
        "instructional capital": "instructional capital"
    },
    {
        " required to maintain them - including ": null
    },
    {
        "Wikipedia itself": "wikipedia itself"
    },
    {
        " or other ": null
    },
    {
        "open content": "open content"
    }
]