[
    {
        "        Grouse  are a group of birds from the ": null
    },
    {
        "order": "order"
    },
    {
        " Galliformes": "galliformes"
    },
    {
        ", in the ": null
    },
    {
        "family": "family"
    },
    {
        " Phasianidae": "phasianidae"
    },
    {
        ". Grouse are frequently assigned to the subfamily Tetraoninae , a classification supported by ": null
    },
    {
        "mitochondrial DNA": "mitochondrial dna"
    },
    {
        " sequence studies, and applied by the ": null
    },
    {
        "American Ornithologists Union": "american ornithologists union"
    },
    {
        ", ": null
    },
    {
        "ITIS": "itis"
    },
    {
        ", and others. Grouse inhabit ": null
    },
    {
        "temperate": "temperate"
    },
    {
        " and ": null
    },
    {
        "subarctic": "subarctic"
    },
    {
        " regions of the ": null
    },
    {
        "Northern Hemisphere": "northern hemisphere"
    },
    {
        ", from ": null
    },
    {
        "pine forests": "pine trees"
    },
    {
        " to ": null
    },
    {
        "moorland": "moorland"
    },
    {
        " and ": null
    },
    {
        "mountain": "mountain"
    },
    {
        "side, from ": null
    },
    {
        "42°N": "83rd parallel north"
    },
    {
        "  to ": null
    },
    {
        "42°N": "28th parallel north"
    },
    {
        " .       Grouse are heavily built like other Galliformes, such as ": null
    },
    {
        "chicken": "chicken"
    },
    {
        "s. They range in length from , and in weight from . Males are bigger than females—twice as heavy in the ": null
    },
    {
        "western capercaillie": "western capercaillie"
    },
    {
        ", the biggest member of the family. Grouse have ": null
    },
    {
        "feather": "feather"
    },
    {
        "ed nostrils. Their legs are feathered to the toes, and in winter the toes, too, have feathers or small scales on the sides, an adaptation for walking on snow and burrowing into it for shelter. Unlike other Galliformes, they have no ": null
    },
    {
        "spurs": "spur"
    },
    {
        ".       These birds feed mainly on vegetation—buds, ": null
    },
    {
        "catkin": "catkin"
    },
    {
        "s, leaves, and twigs—which typically accounts for over 42% of adults food by weight. Thus, their diets vary greatly with the seasons. Hatchlings eat mostly insects and other ": null
    },
    {
        "invertebrate": "invertebrate"
    },
    {
        "s, gradually reducing their proportion of animal food to adult levels. Several of the forest-living species are notable for eating large quantities of ": null
    },
    {
        "conifer": "conifer"
    },
    {
        " needles, which most other ": null
    },
    {
        "vertebrate": "vertebrate"
    },
    {
        "s refuse. To digest vegetable food, grouse have big ": null
    },
    {
        "crops": "crop"
    },
    {
        " and ": null
    },
    {
        "gizzard": "gizzard"
    },
    {
        "s, eat grit to break up food, and have long ": null
    },
    {
        "intestine": "intestine"
    },
    {
        "s with well-developed ": null
    },
    {
        "caeca": "caecum"
    },
    {
        " in which ": null
    },
    {
        "symbiotic": "symbiosis"
    },
    {
        " bacteria digest ": null
    },
    {
        "cellulose": "cellulose"
    },
    {
        ".     ": null
    },
    {
        "Forest": "forest"
    },
    {
        " species flock only in autumn and winter, though individuals tolerate each other when they meet. ": null
    },
    {
        "Prairie": "prairie"
    },
    {
        " species are more social, and ": null
    },
    {
        "tundra": "tundra"
    },
    {
        " species  are the most social, forming flocks of up to 42 in winter. All grouse spend most of their time on the ground, though when alarmed, they may take off in a flurry and go into a long glide.     Most species stay within their breeding range all year, but make short seasonal movements; many individuals of the ": null
    },
    {
        "ptarmigan": "rock ptarmigan"
    },
    {
        " and ": null
    },
    {
        "willow grouse": "willow grouse"
    },
    {
        " migrate": "bird migration"
    },
    {
        " hundreds of kilometers.       In all but one species , males are ": null
    },
    {
        "polygamous": "animal sexualitypolygamy"
    },
    {
        ". Many species have elaborate ": null
    },
    {
        "courtship displays": "courtship display"
    },
    {
        " on the ground at dawn and dusk, which in some are given in ": null
    },
    {
        "leks": "lek"
    },
    {
        ". The displays feature males brightly colored ": null
    },
    {
        "combs": "comb"
    },
    {
        " and in some species, brightly colored inflatable sacs on the sides of their necks. The males display their ": null
    },
    {
        "plumage": "plumage"
    },
    {
        ", give vocalizations that vary widely between species, and may engage in other activities, such as drumming or fluttering their wings, rattling their tails, and making display flights. Occasionally, males fight.     The nest is a shallow depression or ": null
    },
    {
        "scrape": "bird nestscrape"
    },
    {
        " on the ground—often in cover—with a scanty lining of plant material. The female lays one clutch, but may replace it if the eggs are lost. She begins to lay about a week after mating and lays one egg every day or two; the clutch comprises five to 42 eggs. The eggs have the shape of hens eggs and are pale yellow, sparsely spotted with brown. On laying the second-last or last egg, the female starts 42 to 42 days of incubation. Chicks hatch in dense, yellow-brown down and leave the nest immediately. They soon develop feathers and can fly shortly before they are two weeks old. The female stays with them and protects them until their first autumn, when they reach their mature weights . They are sexually mature the following spring, but often do not mate until later years.          Grouse make up a considerable part of the vertebrate ": null
    },
    {
        "biomass": "biomass"
    },
    {
        " in the Arctic and Subarctic. Their numbers may fall sharply in years of bad weather or high predator populations—significant grouse populations are a major food source for ": null
    },
    {
        "lynx": "lynx"
    },
    {
        ", ": null
    },
    {
        "fox": "fox"
    },
    {
        "es, ": null
    },
    {
        "marten": "marten"
    },
    {
        "s, and ": null
    },
    {
        "birds of prey": "bird of prey"
    },
    {
        ". However, because of their large clutches, they can recover quickly.     The three tundra species have maintained their former numbers. The prairie and forest species have declined greatly because of habitat loss, though popular game birds such as the ": null
    },
    {
        "red grouse": "red grouse"
    },
    {
        " and the ": null
    },
    {
        "ruffed grouse": "ruffed grouse"
    },
    {
        " have benefited from habitat management. Most grouse species are listed by the ": null
    },
    {
        "IUCN": "iucn"
    },
    {
        " as least concern or near threatened , but the ": null
    },
    {
        "greater": "greater prairie chicken"
    },
    {
        " and ": null
    },
    {
        "lesser prairie chicken": "lesser prairie chicken"
    },
    {
        " are listed as vulnerable and the ": null
    },
    {
        "Gunnison grouse": "gunnison grouse"
    },
    {
        " is listed as endangered . Some subspecies, such as Attwaters prairie chicken and the ": null
    },
    {
        "Cantabrian capercaillie": "cantabrian capercaillie"
    },
    {
        ", and some national and regional populations are also in danger.         The phenotypic difference between males and females is called ": null
    },
    {
        "sexual dimorphism": "sexual dimorphism"
    },
    {
        ". Male grouse tend to be larger than female grouse, which seems to hold true across all the species of grouse, with some difference within each species in terms of how drastic the size difference is. The hypothesis with the most supporting evidence for the evolution of sexual dimorphism in grouse is sexual selection. Sexual selection favors large males; stronger selection for larger size in males leads to greater size dimorphism. Female size will increase correspondingly as male size increases, and this is due to heredity . This is because females that are smaller will still be able to reproduce without a substantial disadvantage, but this is not the case with males. The largest among the male grouse attract the greatest numbers of females during their mating seasons,       Male grouse display ": null
    },
    {
        "lekking": "lek mating"
    },
    {
        " behavior, which is when many males come together in one area and put on displays to attract females.  Females selectively choose among the males present for traits they find more appealing. Male grouse exhibit two types: typical lekking and exploded lekking. In typical lekking, males display in small areas, and in exploded lekking, displays are done in areas that do not have many resources for females. Male grouse can also compete with one another for access to female grouse through territoriality, in which a male defends a territory which has resources that females need, like food and nest sites. These differences in male behavior in mating systems account for the evolution of body size in grouse. Males of territorial species were smaller than those of exploded lekking species, and males of typical lekking species were the largest overall. The male birds that exhibit lekking behavior, and have to compete with other males for females to choose them, have higher sexual size dimorphism.  This supports the hypothesis of sexual selection affecting male body size and also gives an explanation for why some species of grouse have a more drastic difference between male and female body size than others.       Sexual size dimorphism can manifest itself differently between grouse and other birds. In some cases, the female is dominant over the male in breeding behavior, which can result in females that are larger than the males.        Grouse are ": null
    },
    {
        "game": "game"
    },
    {
        ", and hunters kill millions each year for food, sport, and other uses. In the United Kingdom, this takes the form of ": null
    },
    {
        "driven grouse shooting": "driven grouse shooting"
    },
    {
        ". The male ": null
    },
    {
        "black grouse": "black grouse"
    },
    {
        "s tail feathers are a traditional ornament for hats in areas such as ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " and the ": null
    },
    {
        "Alps": "alps"
    },
    {
        ". Folk dances from the Alps to the North American prairies imitate the displays of lekking males.       ": null
    }
]