[
    {
        "     In ": null
    },
    {
        "electrical engineering": "electrical engineering"
    },
    {
        ", a ground plane is an electrically ": null
    },
    {
        "conductive": "electrical conductor"
    },
    {
        " surface, usually connected to electrical ": null
    },
    {
        "ground": "ground"
    },
    {
        ". The term has two different meanings in separate areas of electrical engineering. In ": null
    },
    {
        "antenna": "antenna"
    },
    {
        " theory, a ground plane is a conducting surface large in comparison to the ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        ", such as the Earth, which is connected to the ": null
    },
    {
        "transmitter": "transmitter"
    },
    {
        "s ground wire and serves as a reflecting surface for ": null
    },
    {
        "radio wave": "radio wave"
    },
    {
        "s. In ": null
    },
    {
        "printed circuit board": "printed circuit board"
    },
    {
        "s, a ground plane is a large area of copper foil on the board which is connected to the power supply ": null
    },
    {
        "ground": "ground"
    },
    {
        " terminal and serves as a return path for current from different components on the board.       In ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        ", a ground plane is a flat or nearly flat horizontal conducting surface that serves as part of an ": null
    },
    {
        "antenna": "antenna"
    },
    {
        ", to reflect the ": null
    },
    {
        "radio wave": "radio wave"
    },
    {
        "s from the other antenna elements. The plane does not necessarily have to be connected to ": null
    },
    {
        "ground": "ground"
    },
    {
        ". Ground plane shape and size play major roles in determining its radiation characteristics including gain.          To function as a ground plane, the conducting surface must be at least a quarter of the ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        "  of the radio waves in diameter. In lower ": null
    },
    {
        "frequency": "frequency"
    },
    {
        " antennas, such as the ": null
    },
    {
        "mast radiator": "mast radiator"
    },
    {
        "s used for broadcast antennas, the Earth itself is used as a ground plane. For higher frequency antennas, in the ": null
    },
    {
        "VHF": "very high frequency"
    },
    {
        " or ": null
    },
    {
        "UHF": "ultrahigh frequency"
    },
    {
        " range, the ground plane can be smaller, and metal disks, screens and wires are used as ground planes. At upper VHF and UHF, the metal skin of a car or aircraft can serve as a ground plane for ": null
    },
    {
        "whip antenna": "whip antenna"
    },
    {
        "s projecting from it. In ": null
    },
    {
        "microstrip antenna": "microstrip antenna"
    },
    {
        "s and printed ": null
    },
    {
        "monopole antenna": "monopole antenna"
    },
    {
        "s an area of copper foil on the opposite side of a ": null
    },
    {
        "printed circuit board": "printed circuit board"
    },
    {
        " serves as a ground plane. The ground plane doesnt have to be a continuous surface. In the ground plane antenna style ": null
    },
    {
        "whip antenna": "whip antenna"
    },
    {
        ", the plane consists of several wires λ/42 long radiating from the base of a quarter-wave whip antenna.     The radio waves from an antenna element that reflect off a ground plane appear to come from a mirror image of the antenna located on the other side of the ground plane. In a monopole antenna, the radiation pattern of the monopole plus the virtual ": null
    },
    {
        "image antenna": "image antenna"
    },
    {
        " make it appear as a two element center-fed ": null
    },
    {
        "dipole antenna": "dipole antenna"
    },
    {
        ". So a monopole mounted over an ideal ground plane has a radiation pattern identical to a dipole antenna. The feedline from the transmitter or receiver is connected between the bottom end of the monopole element and the ground plane. The ground plane must have good conductivity; any resistance in the ground plane is in series with the antenna, and serves to dissipate power from the transmitter.            A ground plane on a ": null
    },
    {
        "printed circuit board": "printed circuit board"
    },
    {
        " is a large area or layer of copper foil connected to the circuits ": null
    },
    {
        "ground": "ground"
    },
    {
        " point, usually one terminal of the ": null
    },
    {
        "power supply": "power supply"
    },
    {
        ". It serves as the return path for ": null
    },
    {
        "current": "electric current"
    },
    {
        " from many different components.     A ground plane is often made as large as possible, covering most of the area of the PCB which is not occupied by circuit traces. In multilayer PCBs, it is often a separate layer covering the entire board. This serves to make circuit layout easier, allowing the designer to ground any component without having to run additional traces; component leads needing grounding are routed directly through a hole in the board to the ground plane on another layer. The large area of copper also conducts the large return currents from many components without significant voltage drops, ensuring that the ground connection of all the components are at the same reference potential.     In digital and ": null
    },
    {
        "radio frequency": "radio frequency"
    },
    {
        " PCBs, the major reason for using large ground planes is to reduce ": null
    },
    {
        "electrical noise": "electrical noise"
    },
    {
        " and interference through ": null
    },
    {
        "ground loop": "ground loop"
    },
    {
        "s and to prevent ": null
    },
    {
        "crosstalk": "crosstalk"
    },
    {
        " between adjacent circuit traces. When digital circuits switch state, large current pulses flow from the active devices through the ground circuit. If the power supply and ground traces have significant impedance, the voltage drop across them may create noise voltage pulses that disturb other parts of the circuit . The large conducting area of the ground plane has much lower impedance than a circuit trace, so the current pulses cause less disturbance.     In addition, a ground plane under printed circuit traces can reduce crosstalk between adjacent traces. When two traces run parallel, an electrical signal in one can be coupled into the other through ": null
    },
    {
        "electromagnetic induction": "electromagnetic induction"
    },
    {
        " by magnetic field lines from one linking the other; this is called ": null
    },
    {
        "crosstalk": "crosstalk"
    },
    {
        ". When a ground plane layer is present underneath, it forms a ": null
    },
    {
        "transmission line": "transmission line"
    },
    {
        " with the trace. The oppositely-directed return currents flow through the ground plane directly beneath the trace. This confines most of the electromagnetic fields to the area near the trace and consequently reduces crosstalk.     A power plane is often used in addition to a ground plane in a multilayer circuit board, to distribute DC power to the active devices. The two facing areas of copper create a large parallel plate ": null
    },
    {
        "decoupling capacitor": "decoupling capacitor"
    },
    {
        " that prevents noise from being coupled from one circuit to another through the ": null
    },
    {
        "power supply": "power supply"
    },
    {
        ".     Ground planes are sometimes split and then connected by a thin trace. This allows the separation of analog and digital sections of a board or the inputs and outputs of amplifiers. The thin trace has low enough ": null
    },
    {
        "impedance": "electrical impedance"
    },
    {
        " to keep the two sides very close to the same potential while keeping the ground currents of one side from coupling into the other side, causing ": null
    },
    {
        "ground loop": "ground loop"
    }
]