[
    {
        "   The ": null
    },
    {
        "Guaraní people": "guaraní people"
    },
    {
        " live in south-central part of ": null
    },
    {
        "South America": "south america"
    },
    {
        ", especially in ": null
    },
    {
        "Paraguay": "paraguay"
    },
    {
        " and parts of the surrounding areas of ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ", ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", and ": null
    },
    {
        "Bolivia": "bolivia"
    },
    {
        ".       There exist no written records of the ancient myths and legends associated with the Guaraní people. The ": null
    },
    {
        "Guaraní language": "guaraní language"
    },
    {
        " was not a written ": null
    },
    {
        "language": "language"
    },
    {
        " until modern times, and, as such, the entirety of their religious beliefs is passed down through word of mouth only. As such, accounts of the various ": null
    },
    {
        "gods": "deity"
    },
    {
        " and related myths and legends can vary from one locale to the next, and the regional differences may be so extreme as to completely redefine the role a specific deity plays in the Guaraní belief system.     Although a large number of the indigenous Guaraní people have largely been assimilated into modern society and their belief system altered or replaced by ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " , several of the core beliefs are still active in many rural areas in the Guaraní region. As a result, the myths and legends continue to evolve to this day.       The primary figure in most Guaraní ": null
    },
    {
        "creation legends": "creation myth"
    },
    {
        " is ": null
    },
    {
        "Tupã": "tupã"
    },
    {
        ", the supreme god of all ": null
    },
    {
        "creation": ":wikt:creation"
    },
    {
        ". With the help of the ": null
    },
    {
        "moon goddess": "moon goddess"
    },
    {
        " Arasy": "arasy"
    },
    {
        ", Tupã descended upon the ": null
    },
    {
        "Earth": "earth"
    },
    {
        " in a location specified as a ": null
    },
    {
        "hill": "hill"
    },
    {
        " in the region of Aregúa, Paraguay, and from that location created all that is found upon the face of the earth, including the ": null
    },
    {
        "ocean": "ocean"
    },
    {
        ", ": null
    },
    {
        "forests": "forests"
    },
    {
        ", and the ": null
    },
    {
        "animals": "animals"
    },
    {
        ". It is also said that the ": null
    },
    {
        "star": "star"
    },
    {
        "s were placed in the ": null
    },
    {
        "sky": "sky"
    },
    {
        " at this point.     Tupã then created ": null
    },
    {
        "human": "human"
    },
    {
        "ity  in an elaborate ceremony, forming ": null
    },
    {
        "clay": "clay"
    },
    {
        " statues of man and woman with a mixture of various elements from nature. After breathing ": null
    },
    {
        "life": "life"
    },
    {
        " into the human forms, he left them with the ": null
    },
    {
        "spirits": "spirits"
    },
    {
        " of good and evil and departed.       The original humans created by Tupã were Rupave and Sypave, whose names mean ": null
    },
    {
        "Father": "father"
    },
    {
        " of the people and ": null
    },
    {
        "Mother": "mother"
    },
    {
        " of the people , respectively. The pair had three sons and a large but unspecified number of daughters. The first of their sons was ": null
    },
    {
        "Tumé Arandú": "tume arandu"
    },
    {
        ", considered to be the wisest of men and the great ": null
    },
    {
        "prophet": "prophet"
    },
    {
        " of the Guaraní people. Second of their sons was Marangatú, a benevolent and generous leader of his people, and father of ": null
    },
    {
        "Kerana": "kerana"
    },
    {
        ", the mother of the seven legendary monsters of Guaraní myth . Their third son was Japeusá, who was from birth considered a liar, a thief and a trickster, always doing things backwards to confuse people and take advantage of them. He eventually committed ": null
    },
    {
        "suicide": "suicide"
    },
    {
        ", drowning himself in the ": null
    },
    {
        "water": "water"
    },
    {
        ", but he was resurrected as a ": null
    },
    {
        "crab": "crab"
    },
    {
        ", and since then all crabs are cursed to walk backwards much as Japeusá did.     Among the daughters of the Rupave and Supave was Porâsý, notable for sacrificing her own life in order to rid the world of one of the seven legendary monsters, diminishing their power .     Several of the first humans were considered to have ascended upon their deaths and become minor deities.          Kerana, the beautiful daughter of Marangatu, was captured by the personification or spirit of evil called ": null
    },
    {
        "Tau": "tau"
    },
    {
        ". Together the two had seven sons who were cursed of the high goddess Arasy, and all but one were born as hideous ": null
    },
    {
        "monster": "monster"
    },
    {
        "s. The seven are considered primary figures in Guaraní ": null
    },
    {
        "mythology": "mythology"
    },
    {
        ", and while several of the lesser gods or even the original humans are forgotten in the verbal tradition of some areas, these seven were generally maintained in the legends. Some of them are even believed in down to modern times in some rural areas. The seven sons of Tau and Kerana are, in order of their births:   ": null
    },
    {
        "Teju Jagua": "teju jagua"
    },
    {
        ", god or spirit of caverns and fruits   ": null
    },
    {
        "Mbói Tuĩ": "mbói tuĩ"
    },
    {
        ", god of waterways and aquatic creatures   ": null
    },
    {
        "Moñái": "moñái"
    },
    {
        ", god of the open fields. He was defeated by the sacrifice of Porâsý   ": null
    },
    {
        "Jasy Jatere": "jasy jatere"
    },
    {
        ", god of the ": null
    },
    {
        "siesta": "siesta"
    },
    {
        ", only of the seven to not appear as a monster   ": null
    },
    {
        "Kurupi": "kurupi"
    },
    {
        ", god of sexuality and fertility   ": null
    },
    {
        "Ao Ao": "ao ao"
    },
    {
        ", god of hills and mountains   ": null
    },
    {
        "Luison": "luison"
    },
    {
        " , god of death and all things related to it       Angatupyry, spirit or personification of good, opposite to Tau   Pytajovái, god of war    Pombero , a popular spirit of mischief    Abaangui , a god credited with the creation of the moon; may only figure as an adaptation of outlying Guaraní tribes   Jurupari, a god limited to worship by men, generally limited to isolated tribes in Brazil   Jande Jari, our grandmother , spirit of the river Parapetí in Bolivia   Mala Visiõ, According to one version of the legend, Mala Vision was a beautiful woman maddened by jealousy, that one night she murdered her husband and dumped his body in a cave by covering it with burning coals to cremate his body totally believing that he was maintaining relationships with other women. On the seventh night after the event, with lightning, throwing sparks, the corpse of her husband stood before the woman who dropped dead of fright. Since that day the lost soul of the woman goes through canyons and hills on stormy nights, crying plaintive and eerie. Mala Vision is presented as the spirit of a beautiful woman dressed in white, tall and deformed shrouded in transparent fumes.   Plata Yvyguy, , many treasures were buried during the ": null
    },
    {
        "Paraguayan War": "paraguayan war"
    },
    {
        ", its a tradition that if someone is to see a headless white dog that disappears and re-appears all the time in their own house, it means that Plata Yvyguy is buried under it.    The Celestial Jaguar, According to a version of the legend, the mother of the heavenly twins, known as Sun and Moon, was killed by the Celestial Jaguars. The twins were raised by the ": null
    },
    {
        "jaguar": "jaguar"
    },
    {
        " s until a bird told them how their mother had been killed. The twins went on a rampage, killing all jaguars except one which was pregnant and the mother of todays primitive jaguars.  Now, jaguars are a wild beast that are to be feared by the Guarani. It is common for the animal to be part of the beginning and end of a persons life. The meat will be eaten by a childs mother while she is pregnant and the jaguars themselves represent the souls of the dead in temples.  Those that are sick, elderly, and slow-moving have also been known to have been left behind to the jaguars. ": null
    }
]