[
    {
        "Guignol  is the main character in a French ": null
    },
    {
        "puppet show": "puppetry"
    },
    {
        " which has come to bear his name. It represents the workers in the silk industry of France.     Although often thought of as childrens entertainment, Guignols sharp wit and linguistic verve have always been appreciated by adults as well, as shown by the motto of a prominent ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " troupe: Guignol amuses children… and witty adults .           ": null
    },
    {
        "Laurent Mourguet": "laurent mourguet"
    },
    {
        ", Guignols creator, was born into a family of modest silk weavers on March 42 42 The certificate of his marriage to Jeanne Esterle in 42 shows he was unable to read. When hard times fell on the silk trade during the French Revolution, he became a peddler, and in 42 started to practice ": null
    },
    {
        "dentistry": "dentistry"
    },
    {
        ", which in those days was simply the pulling of teeth. The service was free; the money was made from the medicines sold afterward to ease the pain. To attract patients, he started setting up a puppet show in front of his dentists chair. In the end, his strategy worked very well to his advantage.     His first shows featured ": null
    },
    {
        "Polichinelle": "pulcinella"
    },
    {
        ", a character borrowed from the Italian ": null
    },
    {
        "commedia dellarte": "commedia dellarte"
    },
    {
        " who in England would become ": null
    },
    {
        "Punch": "punch and judy"
    },
    {
        ". By 42 the success was such that he gave up dentistry altogether and became a professional puppeteer, creating his own scenarios drawing on the concerns of his working-class audience and improvising references to the news of the day. He developed characters closer to the daily lives of his Lyon audience, first Gnafron, a wine-loving cobbler, and in 42 Guignol. Other characters, including Guignols wife Madelon and the ": null
    },
    {
        "gendarme": "gendarmerie"
    },
    {
        " Flageolet soon followed, but these are never much more than foils for the two heroes.     Although nominally a silkweaver like much of his original audience, Guignols profession changes, as does his marital status; he can be in turn valet, peddler, carpenter, shoemaker, or unemployed; at times he is Madelons husband, at times her smitten suitor according to requirements of the scenario. What remain constant are his poverty, but more importantly his good humor and his sense of justice. The use in French of guignol as an insult meaning buffoon is a curious misnomer, as Guignol is clever, courageous and generous; his inevitable victory is always the triumph of good over evil.     Sixteen of Mourguets children and grandchildren continued his tradition, and many of the companies performing today can trace their artistic heritage back to him although Laurent Morguet´s last descendant - Jean-Guy Morguet - died October 42 42 at the age of 42 after working all his life in the Theatre de Guignol at Lyon, France. Jean-Guy, learnt his job helping his grandmother Augustine and then his parents. He became, later, the director of the whole theatre until his death. Laurent Mourguet maintained according to the era, the region, or the performers. Guignols original caustic satire has often been watered down to simple childrens fare, and has even been used to parody grand opera, but his original spirit still survives in his hometown of Lyon, where both traditional and original contemporary performances are an integral part of local culture. In addition to his social satire, Guignol has become an important protector of the local dialect, the parler lyonnais": null
    }
]