[
    {
        "   GURPS Supers is a superhero roleplaying game written by Loyd Blankenship and published by Steve Jackson Games. The first edition was published in 1989.       GURPS Supers is a supplement of rules for comic-book superhero characters and campaigns for  GURPS . The first edition book includes new combat rules, 24 superpowers, bionic superlimbs, gadgets and equipment, and rules for creating new powers, sample heroes and villains, and a briefly described campaign world. The second edition book is revised and corrected.     GURPS Supers deals with super-powered characters in a modern-day setting, and contains all the necessary rules to create superheroes for the GURPS basic system. The book also contains suggestions for running a superhero campaign, and a detailed background setting with the UN controlling most superheroes.       The official house setting for GURPS Supers is the IST World , described briefly in chapter 7 of GURPS Supers and later appearing in its own full-length supplement,  GURPS International Super Teams .       GURPS Supers is a supplement for the GURPS roleplaying game and uses that basic rule system. The supplement offers additional rules and options for characters with superpowers.     Players can choose from several different basic types of superhero characters that influence how the characters ": null
    },
    {
        "powers": "power"
    },
    {
        " are selected. Players can select from a wide variety of powers and their modifications given in GURPS Supers, augmented by those in the GURPS Basic, plus any other GURPS book included by the campaign. The rules book included advice on creating superhero campaigns, and ways for the ": null
    },
    {
        "game master": "game master"
    },
    {
        " to customize the style of the campaign.     As part of the GURPS system, GURPS Supers allows the exchange of a players characters between any of the numerous other genres supported by GURPS. GURPS Supers favors lower-powered heroes over higher-powered ones. Many of the superpowers unique to GURPS Supers appear as Advantages and Disadvantages in the ": null
    },
    {
        "GURPS 4e Basic Set": "gurps 4e basic set"
    },
    {
        ".       GURPS Supers was written by ": null
    },
    {
        "Loyd Blankenship": "loyd blankenship"
    },
    {
        ", with a cover by ": null
    },
    {
        "Alan Gutierrez": "alan gutierrez"
    },
    {
        " and ": null
    },
    {
        "Charlie Weidman": "charlie weidman"
    },
    {
        ", and was first published by ": null
    },
    {
        "Steve Jackson Games": "steve jackson games"
    },
    {
        " in 1988 as a 112-page book.  GURPS Space was one of the broad genre books that followed the publication of the  GURPS Basic Set .       The 2nd edition of GURPS Supers was published in 1990 and featured a cover by ": null
    },
    {
        "John Zeleznik": "john zeleznik"
    },
    {
        ".         The first edition of GURPS Supers was printed in 1989, and the second edition was published in 1990. The first edition had groupings of character powers that were not used in the second edition. Both were based on the Third Edition of GURPS Basic.     There were various aids, supplements and ready-made adventures available, including:   GURPS Supers Adventures GURPS Supers: Death Wish GURPS Supers: Mixed Doubles GURPS Supers: School of Hard Knocks GURPS Supers: Superscum GURPS Supers: Supertemps Hellboy Sourcebook and Roleplaying Game  series    GURPS Wild Cards     GURPS Wild Cards: Aces Abroad       GURPS Supers for 4e was published in 2007, one of several genre books published by Steve Jackson Games for the new edition.      For the 4th edition of GURPS, the majority of rules governing the creation of superhero characters are covered in the more generic  GURPS Powers .  A ": null
    },
    {
        "PDF": "portable document format"
    },
    {
        " release by ": null
    },
    {
        "William H. Stoddard": "william h. stoddard"
    },
    {
        " covers the genre specific information in a similar style to  GURPS Fantasy  and  GURPS Space  books for the fourth edition of GURPS.        ": null
    },
    {
        "Rick Swan": "rick swan"
    },
    {
        " reviewed the second edition of GURPS Supers for  Dragon  magazine 233 .  Comparing it to the  Champions  RPG, Swan comments that GURPS Super takes a more realistic route, stressing personality over punch-outs. Thats not to say its stodgy; a typical chapter is titled Unnatural Multiple Limbs from Another World. The Second Edition streamlines the occasionally awkward mechanics of the First Edition and adds some nifty new powers.     Steve Faragher reviewed the second edition of GURPS Supers for Arcane magazine, rating it a 6 out of 10 overall.  He calls the background setting rather dull , saying it is fine if you want to recreate a Saturday afternoon TV show, but not so great for a more fantastic, underground campaign of the Watchmen variety . Faragher concludes that its a competent enough set of rules - and one thats well presented - but GURPS Supers": null
    }
]