[
    {
        "           Virgil Ivan Gus Grissom was one of the seven original ": null
    },
    {
        "National Aeronautics and Space Administration": "nasa"
    },
    {
        "s ": null
    },
    {
        "Project Mercury": "project mercury"
    },
    {
        " astronaut": "astronaut"
    },
    {
        "s, and the first of the ": null
    },
    {
        "Mercury Seven": "mercury seven"
    },
    {
        " to die. He was also a ": null
    },
    {
        "Project Gemini": "project gemini"
    },
    {
        " and an ": null
    },
    {
        "Apollo program": "apollo program"
    },
    {
        " astronaut. Grissom was the second American to fly in space, and the first member of the ": null
    },
    {
        "NASA Astronaut Corps": "nasa astronaut corps"
    },
    {
        " to fly in space twice. In addition, Grissom was a ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        " veteran, ": null
    },
    {
        "U.S. Air Force": "united states air force"
    },
    {
        " test pilot": "test pilot"
    },
    {
        ", and a ": null
    },
    {
        "mechanical engineer": "mechanical engineer"
    },
    {
        ". He was a recipient of the ": null
    },
    {
        "Distinguished Flying Cross": "distinguished flying cross"
    },
    {
        ", and the ": null
    },
    {
        "Air Medal": "air medal"
    },
    {
        " with an ": null
    },
    {
        "oak leaf cluster": "oak leaf cluster"
    },
    {
        ", a two-time recipient of the ": null
    },
    {
        "NASA Distinguished Service Medal": "nasa distinguished service medal"
    },
    {
        ", and, posthumously, the ": null
    },
    {
        "Congressional Space Medal of Honor": "congressional space medal of honor"
    },
    {
        ".     During World War II, Grissom enlisted in the ": null
    },
    {
        "U.S. Army Air Forces": "united states army air forces"
    },
    {
        " as an aviation cadet. After his discharge from military service, Grissom enrolled at ": null
    },
    {
        "Purdue University": "purdue university"
    },
    {
        ", graduating with a bachelors in mechanical engineering in 42 He reenlisted in the U.S. Air Force, earning his pilots wings in 42 and flew 42 combat missions during the Korean War. After returning to the United States, Grissom was reassigned to work as a flight instructor at ": null
    },
    {
        "Bryan Air Force Base": "bryan air force base"
    },
    {
        " in ": null
    },
    {
        "Texas": "texas"
    },
    {
        ". He attended the U.S. ": null
    },
    {
        "Air Force Institute of Technology": "air force institute of technology"
    },
    {
        " for a year, earning a bachelors degree in aeromechanics, and received his test pilot training at ": null
    },
    {
        "Edwards Air Force Base": "edwards air force base"
    },
    {
        " in ": null
    },
    {
        "California": "california"
    },
    {
        " before his assignment as a test pilot at ": null
    },
    {
        "Wright-Patterson Air Force Base": "wright-patterson air force base"
    },
    {
        " in ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        ".     Selected as one of the Mercury Seven astronauts, Grissom was the pilot of Mercury-Redstone 42 , the second American suborbital flight, on July 42 42 At the end of the flight, the capsules hatch blew off prematurely after it landed in the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ". Grissom was picked up by recovery helicopters, but the blown hatch caused the craft to fill with water and sink. His next flight was in the Project Gemini program as command pilot for ": null
    },
    {
        "Gemini 42": "gemini 3"
    },
    {
        " , which was a successful three-orbit mission on March 42 42 Grissom, commander of AS42 , along with his fellow astronauts ": null
    },
    {
        "Ed White": "ed white"
    },
    {
        " and ": null
    },
    {
        "Roger B. Chaffee": "roger b. chaffee"
    },
    {
        ", died on January 42 42 during a pre-launch test for the Apollo 42 mission at ": null
    },
    {
        "Cape Kennedy": "cape canaveral air force station"
    },
    {
        ", ": null
    },
    {
        "Florida": "florida"
    },
    {
        ".         Virgil Ivan Grissom was born in the small town of ": null
    },
    {
        "Mitchell, Indiana": "mitchell, indiana"
    },
    {
        ", on April 42 42 to Dennis David Grissom, a signalman for the ": null
    },
    {
        "Baltimore and Ohio Railroad": "baltimore and ohio railroad"
    },
    {
        ", and Cecile King Grissom, a homemaker. Virgil was the familys second child . He was followed by three younger siblings: a sister, Wilma, and two brothers, Norman and Lowell. Grissom started school at Riley grade school. His interest in flying began in that time, building model airplanes. He received his nickname when his friend was reading his name on a scorecard upside down and misread Griss for Gus .     As a youth Grissom attended the local ": null
    },
    {
        "Church of Christ": "churches of christ"
    },
    {
        ", where he remained a lifelong member. He joined the local ": null
    },
    {
        "Boy Scout": "boy scouts of america"
    },
    {
        " Troop and earned the rank of ": null
    },
    {
        "Star Scout": "star"
    },
    {
        ".  Grissom credited the Scouts for his love of hunting and fishing. He was the leader of the Honor Guard in his Troop. His first jobs were delivering newspapers for  The Indianapolis Star  in the morning and the Bedford Times in the evening. In the summer he picked fruit in area orchards and worked at a dry-goods store. He also worked at a local meat market, a service station, and a clothing store in Mitchell.     Grissom started attending ": null
    },
    {
        "Mitchell High School": "mitchell high school"
    },
    {
        " in 42 He wanted to play varsity basketball but he was too short. His father encouraged him to find sports he was more suited for, and he joined the swimming team. Although he excelled at mathematics, Grissom was an average high school student in other subjects. He graduated from high school in 42     In addition, Grissom occasionally spent time at a local airport in ": null
    },
    {
        "Bedford, Indiana": "bedford, indiana"
    },
    {
        ", where he first became interested in aviation. A local attorney who owned a small plane would take him on flights and taught him the basics of flying.       Grissom met and befriended ": null
    },
    {
        "Betty Lavonne Moore": "betty grissom"
    },
    {
        " ,  his future wife, through their extracurricular activities in high school. Grissom carried the American flag at the opening ceremonies of high school basketball games, while Moore played the drum in the high school band. At a game during Bettys first year, they noticed their mutual attraction to each other and Grissom sat with her at halftime. They went on many movie dates. Grissoms father allowed him to use the family car, even though gasoline was rationed due to the war. Grissom used the car to teach Betty how to drive.     Grissom married Moore on July 42 42 at the First Baptist Church in Mitchell when he was home on leave at the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". Grissom brother, Norman, served as his best man; Moores sister, Mary Lou Fosbrink, was her maid of honor. Grissom and his wife, Betty, had two sons: Scott, born in 42 and Mark, born in 42  Both sons graduated from ": null
    },
    {
        "Purdue University": "purdue university"
    },
    {
        " and eventually had aviation-related careers.     Grissom greatly valued being home with his family, stating that it sure helped to spend a quiet evening with your wife and children in your own living room .    Grissom refused to let work problems intrude on his time at home, and tried to complete technical reading or paperwork after the boys were asleep, while Betty Grissom accommodated his hectic schedule by completing major chores and errands during the week so weekends would be free for family activities. Two of Grissoms favorite pastimes were ": null
    },
    {
        "hunting": "hunting"
    },
    {
        " and ": null
    },
    {
        "fishing": "fishing"
    },
    {
        ", to which he introduced his sons. The family also enjoyed water sports and skiing.            ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " began while Grissom was still in high school, but he was eager to join the military upon graduation. Grissom enlisted as an ": null
    },
    {
        "aviation cadet": "aviation cadet"
    },
    {
        " in the ": null
    },
    {
        "U.S. Army Air Forces": "united states army air forces"
    },
    {
        " during his senior year in high school, and completed an entrance exam in November 42 Grissom was inducted into the U.S. Army Air Forces on August 42 42 at ": null
    },
    {
        "Fort Benjamin Harrison": "fort benjamin harrison"
    },
    {
        ", Indiana. He was sent to ": null
    },
    {
        "Sheppard Field": "sheppard air force base"
    },
    {
        " in ": null
    },
    {
        "Wichita Falls, Texas": "wichita falls, texas"
    },
    {
        ", for five weeks of basic flight training, and was later stationed at ": null
    },
    {
        "Brooks Field": "brooks air force base"
    },
    {
        " in ": null
    },
    {
        "San Antonio": "san antonio"
    },
    {
        ", ": null
    },
    {
        "Texas": "texas"
    },
    {
        ". In January 42 Grissom was assigned to ": null
    },
    {
        "Boca Raton Army Airfield": "boca raton army airfield"
    },
    {
        " in ": null
    },
    {
        "Florida": "florida"
    },
    {
        ". Although he was interested in becoming a pilot, most of Grissoms time before his discharge in 42 was spent as a ": null
    },
    {
        "clerk": "clerk"
    },
    {
        ".       Grissom was discharged from military service in November 42 after the war had ended, and returned to Mitchell, where he took a job at Carpenter Body Works, a local bus manufacturing business. Grissom was determined to make his career in aviation and attend college. Using the ": null
    },
    {
        "G.I. Bill": "g.i. bill"
    },
    {
        " for partial payment of his school tuition, Grissom enrolled at ": null
    },
    {
        "Purdue University": "purdue university"
    },
    {
        " in September 42     Due to a shortage of campus housing during her husbands first semester in college in ": null
    },
    {
        "West Lafayette, Indiana": "west lafayette, indiana"
    },
    {
        ", Grissoms wife, Betty, stayed in Mitchell living with her parents, while Grissom lived in a rented apartment with another male student. Betty Grissom joined her husband on campus during his second semester, and the couple settled into a small, one-bedroom apartment. Grissom continued his studies at Purdue, worked part-time as a cook at a local restaurant, and took summer classes in order to finish college early, while his wife worked the night shift as a long-distance operator for the Indiana Bell Telephone Company to help pay for his schooling and their living expenses. Grissom graduated from Purdue with a ": null
    },
    {
        "Bachelor of Science": "bachelor of science"
    },
    {
        " degree in ": null
    },
    {
        "mechanical engineering": "mechanical engineering"
    },
    {
        " in February 42       Grissom re-enlisted in the military after he graduated from Purdue, this time in the newly formed ": null
    },
    {
        "U.S. Air Force": "united states air force"
    },
    {
        ". He was accepted into the ": null
    },
    {
        "Air Cadet Basic Training Program": "united states air force basic military training"
    },
    {
        " at ": null
    },
    {
        "Randolph Air Force Base": "randolph air force base"
    },
    {
        " in ": null
    },
    {
        "Universal City, Texas": "universal city, texas"
    },
    {
        ". Upon completion of the program, he was assigned to ": null
    },
    {
        "Williams Air Force Base": "williams air force base"
    },
    {
        " in ": null
    },
    {
        "Mesa, Arizona": "mesa, arizona"
    },
    {
        ", where his wife, Betty, and infant son, Scott, joined him, but the family remained there only briefly. In March 42 Grissom received his ": null
    },
    {
        "pilot wings": "command pilot wings"
    },
    {
        " and a commission as a ": null
    },
    {
        "Second Lieutenant": "second lieutenantunited states"
    },
    {
        ". Nine months later, in December 42 Grissom and his family moved into new living quarters in ": null
    },
    {
        "Presque Isle, Maine": "presque isle, maine"
    },
    {
        ", where he was assigned to ": null
    },
    {
        "Presque Isle Air Force Base": "presque isle international airport"
    },
    {
        " and became a member of the ": null
    },
    {
        "42th Fighter-Interceptor Squadron": "75th fighter squadron"
    },
    {
        ".        With the ongoing ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        ", Grissoms squadron was dispatched to the war zone in February 42 There he flew as an ": null
    },
    {
        "F42 Sabre": "f-86 sabre"
    },
    {
        " replacement pilot and was reassigned to the ": null
    },
    {
        "42th Fighter Squadron": "334th fighter squadron"
    },
    {
        " of the ": null
    },
    {
        "42th Fighter Interceptor Wing": "4th fighter wing"
    },
    {
        " stationed at ": null
    },
    {
        "Kimpo Air Base": "gimpo international airport"
    },
    {
        ". He flew one hundred ": null
    },
    {
        "combat missions": "aerial warfare"
    },
    {
        " during approximately six months of service in Korea, including multiple occasions when he broke up air raids from North Korean ": null
    },
    {
        "MiG": "mig"
    },
    {
        "s. On March 42 42 Grissom was promoted to ": null
    },
    {
        "first lieutenant": "first lieutenant"
    },
    {
        " and was cited for his superlative airmanship for his actions on March 42 42 when he flew cover for a photo reconnaissance mission. Grissom was also awarded the ": null
    },
    {
        "Distinguished Flying Cross": "distinguished flying cross"
    },
    {
        " and the ": null
    },
    {
        "Air Medal": "air medal"
    },
    {
        " with an ": null
    },
    {
        "oak leaf cluster": "oak leaf cluster"
    },
    {
        " for his military service in Korea.     After flying his quota of one hundred missions, Grissom asked to remain in Korea to fly another twenty-five flights, but his request was denied. Grissom returned to the United States to serve as a ": null
    },
    {
        "flight instructor": "flight instructor"
    },
    {
        " at ": null
    },
    {
        "Bryan AFB": "bryan air force base"
    },
    {
        " in ": null
    },
    {
        "Bryan, Texas": "bryan, texas"
    },
    {
        ", where he was joined by his wife, Betty, and son, Scott. The Grissoms second child, Mark, was born there in 42 Grissom soon learned that flight instructors faced their own set of on-the-job risks. During a training exercise with a cadet, the trainee pilot caused a flap to break off from their two-seat trainer, sending it into a roll. Grissom quickly climbed from the rear seat of the small aircraft to take over the controls and safely land it.     In August 42 Grissom was reassigned to the U.S. ": null
    },
    {
        "Air Force Institute of Technology": "air force institute of technology"
    },
    {
        " at ": null
    },
    {
        "Wright-Patterson Air Force Base": "wright-patterson air force base"
    },
    {
        " near ": null
    },
    {
        "Dayton, Ohio": "dayton, ohio"
    },
    {
        ". After completing the year-long course he earned a bachelors degree in ": null
    },
    {
        "aeromechanics": "aeromechanics"
    },
    {
        " in 42 In October 42 he entered ": null
    },
    {
        "USAF Test Pilot School": "u.s. air force test pilot school"
    },
    {
        " at ": null
    },
    {
        "Edwards Air Force Base": "edwards air force base"
    },
    {
        " in ": null
    },
    {
        "California": "california"
    },
    {
        ", and returned to Wright-Patterson AFB in Ohio in May 42 after attaining the rank of Captain. Grissom served as a ": null
    },
    {
        "test pilot": "test pilot"
    },
    {
        " assigned to the fighter branch.               In 42 Grissom received an official ": null
    },
    {
        "teletype": "teleprinter"
    },
    {
        " message instructing him to report to an address in ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        ", wearing civilian clothes. The message was classified ": null
    },
    {
        " Top Secret ": "classified information"
    },
    {
        " and Grissom was ordered not to discuss its contents with anyone. Of the 42 military candidates who were considered, he was one of 42 test pilots whose credentials had earned them an invitation to learn more about the U.S. space program in general and its ": null
    },
    {
        "Project Mercury": "project mercury"
    },
    {
        ". Grissom was intrigued by the program, but knew that competition for the final spots would be fierce.      Grissom passed the initial screening in Washington, D.C., and was among the thirty-nine candidates sent to the ": null
    },
    {
        "Lovelace Clinic": "lovelace respiratory research institute"
    },
    {
        " in ": null
    },
    {
        "Albuquerque, New Mexico": "albuquerque, new mexico"
    },
    {
        ", and the Aeromedical Laboratory of the Wright Air Development Center in Dayton, Ohio, to undergo extensive physical and psychological testing. He was nearly disqualified when doctors discovered that he suffered from ": null
    },
    {
        "hay fever": "allergic rhinitis"
    },
    {
        ", but was permitted to continue after he argued that his allergies would not be a problem due to the absence of ragweed pollen in space.     On April 42 42 Grissom received official notification that he had been selected as one of the seven Project Mercury astronauts. Grissom and the six other men, after taking a leave of absence from their respective branches of the military service, reported to the Special Task Group at ": null
    },
    {
        "Langley Air Force Base": "langley air force base"
    },
    {
        " in ": null
    },
    {
        "Virginia": "virginia"
    },
    {
        " on April 42 42 to begin their astronaut training. ": null
    },
    {
        "Discovery Channel": "discovery channel"
    },
    {
        ", ": null
    },
    {
        "When We Left Earth: The NASA Missions": "when we left earth: the nasa missions"
    },
    {
        ", Ordinary Supermen, airdate June 42 42                On July 42 42 Grissom was pilot of the second Project Mercury flight, Mercury-Redstone 42 Grissoms spacecraft, which he named  Liberty Bell 42 , was launched from ": null
    },
    {
        "Cape Canaveral": "cape canaveral air force station"
    },
    {
        ", ": null
    },
    {
        "Florida": "florida"
    },
    {
        ", a ": null
    },
    {
        "sub-orbital flight": "sub-orbital spaceflight"
    },
    {
        " that lasted 42 minutes and 42 seconds. After ": null
    },
    {
        "splashdown": "splashdown"
    },
    {
        " in the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ", the Liberty Bell 42s emergency explosive bolts unexpectedly fired, blowing off the hatch and causing water to flood into the spacecraft. Grissom quickly exited through the open hatch and into the ocean. While waiting for recovery helicopters from  to pick him up, Grissom struggled to keep from drowning after his ": null
    },
    {
        "spacesuit": "navy mark iv"
    },
    {
        " began losing buoyancy due to an open air inlet. Grissom managed to stay afloat until he was pulled from the water by a helicopter and taken to the ": null
    },
    {
        "U.S. Navy": "united states navy"
    },
    {
        " ship. In the meantime another recovery helicopter tried to lift and retrieve the Liberty Bell 42, but the flooding spacecraft became too heavy, forcing the recovery crew to cut it loose, and it ultimately sank.      When reporters at a news conference surrounded Grissom after his space flight to ask how he felt, Grissom replied, Well, I was scared a good portion of the time; I guess thats a pretty good indication.  Grissom stated he had done nothing to cause the hatch to blow, and no definitive explanation for the incident was found.  Robert F. Thompson, Director of Mercury Operations, was dispatched to  by ": null
    },
    {
        "Space Task Group": "space task group"
    },
    {
        " Director Robert Gilruth and spoke with Grissom upon his arrival on the aircraft carrier. Grissom explained that he had gotten ahead in the mission timeline and had removed the detonator cap, and also pulled the safety pin. Once the pin was removed, the trigger was no longer held in place and could have inadvertently fired as a result of ocean wave action, bobbing as a result of helicopter rotor wash, or other activity. NASA officials concluded Grissom had not necessarily initiated the firing of the explosive hatch, which would have required pressing a plunger that required five pounds of force to depress.  Initiating the explosive egress system called for pushing, or hitting, a metal trigger with the hand, which would have left an unavoidably large obvious bruise, but Grissom was found not to have any of the telltale hand bruising.     While the debate continued about the premature detonation of Liberty Bell 42s hatch bolts, precautions were initiated for subsequent flights. Fellow Mercury astronaut Wally Schirra , at the end of his October 42 42 flight , remained inside his spacecraft until it was safely aboard the recovery ship, and made a point of deliberately blowing the hatch to get out of the spacecraft, bruising his hand.     Grissoms spacecraft was recovered in 42 , but no further evidence was found that could conclusively explain how the explosive hatch release had occurred. Later, Guenter Wendt , pad leader for the early American crewed space launches, wrote that he believed a small cover over the external release actuator was accidentally lost sometime during the flight or splashdown. Another possible explanation was that the hatchs T-handle may have been tugged by a stray parachute suspension line, or was perhaps damaged by the heat of re-entry, and after cooling upon splashdown it contracted and caught fire.         In early 42 Alan Shepard was grounded after being diagnosed with Ménières disease and Grissom was designated command pilot for Gemini 42 , the first crewed Project Gemini flight, which flew on March 42 42 This mission made Grissom the first NASA astronaut to fly into space twice. The first person to reach space twice was Joseph A. Walker , a NASA test pilot who made two X42 flights in 42 which exceeded altitude, the internationally recognized definition of outer space. The two-man flight on Gemini 42 with Grissom and John W. Young made three revolutions of the Earth and lasted for 42 hours, 42 minutes and 42 seconds. Grissom was one of the eight pilots of the NASA paraglider research vehicle .     Grissom, the shortest of the original seven astronauts at five feet seven inches tall, worked very closely with the engineers and technicians from McDonnell Aircraft who built the Gemini spacecraft. Because of his involvement in the design of the first three spacecraft, his fellow astronauts humorously referred to the craft as the Gusmobile . By July 42 NASA discovered 42 out of its 42 astronauts could not fit themselves into the cabin and the later cockpits were modified. During this time Grissom invented the multi-axis translation thruster controller used to push the Gemini and Apollo spacecraft in linear directions for rendezvous and docking .     In a joking nod to the sinking of his Mercury craft, Grissom named the first Gemini spacecraft ": null
    },
    {
        "Molly Brown": "margaret brown"
    },
    {
        " . Some NASA publicity officials were unhappy with this name and asked Grissom and his pilot, John Young , to come up with a new one. When they offered Titanic as an alternate, NASA executives decided to allow them to use the name of Molly Brown for Gemini 42 but did not use it in official references. Much to the agencys chagrin, CAPCOM Gordon Cooper gave Gemini 42 its sendoff on launch with the remark to Grissom and Young, Youre on your way, Molly Brown! Ground controllers also used it to reference the spacecraft throughout its flight.     After the safe return of Gemini 42 NASA announced new spacecraft would not be nicknamed. Hence, Gemini 42 was not called American Eagle as its crew had planned. The practice of nicknaming spacecraft resumed in 42 when managers realized that the Apollo flights needed a name for each of two flight elements, the Command Module and the Lunar Module . Lobbying by the astronauts and senior NASA administrators also had an effect. Apollo 42 used the name Gumdrop for the Command Module and Spider for the Lunar Module. However, Wally Schirra was prevented from naming his Apollo 42 spacecraft Phoenix": null
    }
]