[
    {
        "     Nils Gustaf Dalén  was a Swedish ": null
    },
    {
        "Nobel Laureate": "nobel laureate"
    },
    {
        " and industrialist, ": null
    },
    {
        "engineer": "engineer"
    },
    {
        ", inventor and long-term CEO of the ": null
    },
    {
        "AGA": "aga ab"
    },
    {
        " company and inventor of the ": null
    },
    {
        "AGA cooker": "aga cooker"
    },
    {
        " and the ": null
    },
    {
        "Dalén light": "dalén light"
    },
    {
        ". In 42 he was awarded the ": null
    },
    {
        "Nobel Prize in Physics": "nobel prize in physics"
    },
    {
        " for his invention of ": null
    },
    {
        "automatic regulators": "sun valve"
    },
    {
        " for use in conjunction with gas accumulators for illuminating ": null
    },
    {
        "lighthouse": "lighthouse"
    },
    {
        "s and ": null
    },
    {
        "buoy": "buoy"
    },
    {
        "s .          Dalén was born in Stenstorp, a small village in ": null
    },
    {
        "Falköping Municipality": "falköping municipality"
    },
    {
        ", ": null
    },
    {
        "Västra Götaland County": "västra götaland county"
    },
    {
        ". He managed the family farm, which he expanded to include a market garden, a seed merchants and a dairy. In 42 he invented a milk-fat tester to check milk quality of the milk delivered and went to ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        " to show his new invention for ": null
    },
    {
        "Gustaf de Laval": "gustaf de laval"
    },
    {
        ". de Laval was impressed by the self-taught Dalén and the invention and encouraged him to get a basic technical education. He was admitted to the ": null
    },
    {
        "Chalmers University of Technology": "chalmers university of technology"
    },
    {
        " where he earned his ": null
    },
    {
        "Masters degree": "masters degree"
    },
    {
        " and a ": null
    },
    {
        "Doctorate": "doctorate"
    },
    {
        " on leaving in 42 Dalén was much the same type of inventor as Gustaf de Laval, not afraid of testing impossible ideas, but Dalén was much more careful with the company economy. The products should have a solid market place before he introduced a new product.       In 42 Dalén became chief engineer at the Gas Accumulator Company and in 42 when AGA was founded, he was appointed the managing director for the company. During his life, AGA was one of the most innovative companies in Sweden and produced a large variety of products that grew every year. Finally in the early 42s AGA was forced to reduce the number of markets it was involved in and concentrate on the production of gases for industrial use.     In 42 he ascended to the position of Managing Director of the renamed company Svenska Aktiebolaget Gasaccumulator . AGA developed lighthouses using Daléns products. In 42 the company bought a large real estate in ": null
    },
    {
        "Lidingö": "lidingö municipality"
    },
    {
        " and built a production plant that was completed around 42 when they moved out from the facilities in Stockholm.            Initially Dalén worked with ": null
    },
    {
        "acetylene": "acetylene"
    },
    {
        " , a flammable and sometimes explosive ": null
    },
    {
        "hydrocarbon": "hydrocarbon"
    },
    {
        " gas. Dalén invented ": null
    },
    {
        "Agamassan": "agamassan"
    },
    {
        " , a ": null
    },
    {
        "substrate": "substrate"
    },
    {
        " used to absorb the gas allowing safe storage and hence commercial exploitation.     Acetylene produced an ultra-bright white light which superseded the less bright ": null
    },
    {
        "LPG": "liquefied petroleum gas"
    },
    {
        " as the fuel of choice for lighthouse illumination.     Dalén exploited the new fuel, developing the ": null
    },
    {
        "Dalén light": "dalén light"
    },
    {
        " which incorporated another invention, the ": null
    },
    {
        "sun valve": "sun valve"
    },
    {
        ". This device allowed the light to operate only at night, conserving fuel, and extending their service life to over a year.     The Dalen Flasher was a device that, except for a small pilot light, only consumed gas during the flash stage. This reduced gas consumption by more than 42%. The AGA lighthouse equipment worked without any type of electric supply and was thus extremely reliable.     To a rugged coastal area like ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        ", his mass-produced, robust, minimal maintenance buoys were a significant boon to safety and livelihood. AGA Lighthouses covered the entire ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        ".       In 42 he patented his invention of the ": null
    },
    {
        "AGA cooker": "aga cooker"
    },
    {
        ". Most of the testing for the cooker was made in his private kitchen in his Villa Ekbacken that was built when AGA moved to Lidingö in 42 but that he never actually had a chance to see with his own eyes. His family helped him with the development work, checking temperatures, airflow etc., as the development work proceeded.       His parents were Anders and Lovisa Dalén. He married Elma Persson in 42 They had four children, two daughters and two sons:   Maja, married Silfverstolpe   Gunnar   Anders   Inga-Lisa, married Keen       Early in 42 Dalén was ": null
    },
    {
        "blind": "blindness"
    },
    {
        "ed in an acetylene explosion during a test of maximum pressure for the accumulators. Later the same year he was awarded the ": null
    },
    {
        "Nobel Prize for physics": "nobel prize for physics"
    },
    {
        ". Too ill to attend the presentation, Dalén had his brother, ophthalmologist Professor Albin Dalén of the ": null
    },
    {
        "Caroline Institute": "caroline institute"
    },
    {
        ", stand in his place.     The presentation speech praised the quality of sacrificing personal safety in scientific experimentation, a compliment that compared Dalén with ": null
    },
    {
        "Nobel": "alfred nobel"
    },
    {
        " himself. Despite his blindness, Dalén controlled AGA until his death in 42 He received over 42 patents during his lifetime.       Nobel Prize for Physics 42   Member of the ": null
    },
    {
        "Royal Swedish Academy of Sciences": "royal swedish academy of sciences"
    },
    {
        " Academy of Science and Engineering": "academy of science and engineering"
    },
    {
        "       ": null
    }
]