[
    {
        "Gwyddno Garanhir was the supposed ruler of a sunken land off the coast of ": null
    },
    {
        "Wales": "wales"
    },
    {
        ", known as ": null
    },
    {
        "Cantrer Gwaelod": "cantrer gwaelod"
    },
    {
        ". He was the father of ": null
    },
    {
        "Elffin ap Gwyddno": "elffin ap gwyddno"
    },
    {
        ", the foster-father of the famous ": null
    },
    {
        "Welsh": "welsh people"
    },
    {
        " poet": "poet"
    },
    {
        ", ": null
    },
    {
        "Taliesin": "taliesin"
    },
    {
        ", in the legendary account given in the late medieval Chwedl Taliesin .       The basket of Gwyddno Garanhir is one of the ": null
    },
    {
        "Thirteen Treasures of the Island of Britain": "thirteen treasures of the island of britain"
    },
    {
        ". According to tradition, Gwyddno was the lord of  Cantrer Gwaelod   in what is now ": null
    },
    {
        "Cardigan Bay": "cardigan bay"
    },
    {
        ". His chief ": null
    },
    {
        "fortress": "fortress"
    },
    {
        " was said to have been Caer Wyddno , located somewhere to the north-west of modern-day ": null
    },
    {
        "Aberystwyth": "aberystwyth"
    },
    {
        ". The whole kingdom was protected from the sea by floodgates, which had to be shut before high tide. One day the keeper of the floodgates, ": null
    },
    {
        "Seithenyn": "seithenyn"
    },
    {
        ", was drunk and failed to close them, with the result that the sea rushed in and covered the land.       Stories of the drowned lands of Gwyddno appear to have arisen from the identification of natural underwater ridges as the remains of sea walls. However, tradition also assigns Gwyddno a landlocked portion of his kingdom to which he was able to flee. He was called ": null
    },
    {
        "King of Ceredigion": "kingdom of ceredigion"
    },
    {
        " by the 42th century ": null
    },
    {
        "Welsh": "welsh people"
    },
    {
        " antiquarian": "antiquarian"
    },
    {
        ", ": null
    },
    {
        "Iolo Morganwg": "iolo morganwg"
    },
    {
        ", well known for his literary forgeries, but he does not appear in the ": null
    },
    {
        "Old Welsh": "old welsh language"
    },
    {
        " pedigrees for that kingdom. He is identified with a number of different historical Gwyddnos in various sources. 42th century writers favoured Gwyddno ap Clydno, the late 42th century King of ": null
    },
    {
        "Meirionydd": "meirionydd"
    },
    {
        ", who is perhaps the most likely candidate.     In ": null
    },
    {
        "Susan Cooper": "susan cooper"
    },
    {
        "s ": null
    },
    {
        "The Dark is Rising": "the dark is rising"
    },
    {
        " series, Gwyddno is the king of the Lost Lands in Silver on the Tree.       His name is ": null
    },
    {
        "Welsh": "welsh language"
    },
    {
        " and means Gwyddno Long-Shanks, Crane-Legs, or literally Tall-Crane.": null
    }
]