[
    {
        "               Count Gyula Andrássy de Csíkszentkirály et Krasznahorka was a Hungarian statesman, who served as ": null
    },
    {
        "Prime Minister of Hungary": "prime minister of hungary"
    },
    {
        " and subsequently as ": null
    },
    {
        "Foreign Minister": "list of foreign ministers of austria-hungary"
    },
    {
        " of ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        " . Andrássy was a conservative; his foreign policies looked to expanding the Empire into Southeast Europe, preferably with British and German support, and without alienating Turkey. He saw Russia as the main adversary, because of its own expansionist policies toward Slavic and Orthodox areas. He distrusted Slavic nationalist movements as a threat to his multi-ethnic empire.       The son of Count ": null
    },
    {
        "Károly Andrássy": "károly andrássy"
    },
    {
        " and ": null
    },
    {
        "Etelka Szapáry": "etelka szapáry"
    },
    {
        ", he was born in ": null
    },
    {
        "Oláhpatak": "vlachovo"
    },
    {
        " , ": null
    },
    {
        "Kingdom of Hungary": "kingdom of hungary"
    },
    {
        ". The son of a ": null
    },
    {
        "liberal": "liberalism"
    },
    {
        " father who belonged to the political opposition, at a time when opposing the government was very dangerous, Andrássy at a very early age threw himself into the political struggles of the day, adopting at the outset the patriotic side.       ": null
    },
    {
        "Count István Széchenyi": "istván széchenyi"
    },
    {
        " was the first adequately to appreciate his capacity. In 42 Andrássy was appointed as president of the society for the regulation of the waters of the ": null
    },
    {
        "Upper Tisza": "tisza"
    },
    {
        " River.     In 42 he attracted attention by publishing highly critical articles of the government in ": null
    },
    {
        "Lajos Kossuth": "lajos kossuth"
    },
    {
        "s paper, the Pesti Hírlap. He was elected as one of the Radical candidates to the ": null
    },
    {
        "Diet": "diet of hungary"
    },
    {
        " of 42     When the Croats under ": null
    },
    {
        "Josip Jelačić": "josip jelačić"
    },
    {
        " attempted to have ": null
    },
    {
        "Međimurje": "međimurje"
    },
    {
        ", which was then part of Hungary, returned to Croatia, Andrássy entered military service. He was commander of the ": null
    },
    {
        "gentry": "gentry"
    },
    {
        " of his county, and served with distinction at the battles of ": null
    },
    {
        "Pákozd": "battle of pákozd"
    },
    {
        " and ": null
    },
    {
        "Schwechat": "battle of schwechat"
    },
    {
        ", as ": null
    },
    {
        "Artúr Görgei": "artúr görgei"
    },
    {
        "s adjutant .     Toward the end of the war, Andrássy was sent to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " by the revolutionary government. He was seeking to obtain the neutrality of the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", if not their support, during the struggle with Croatia.     After the catastrophe of ": null
    },
    {
        "Világos": "surrender at világos"
    },
    {
        ", where the Hungarians were defeated, Andrássy emigrated to London and then to Paris. On 42 September 42 he was condemned in absentia to death and was ": null
    },
    {
        "hanged": "hanged"
    },
    {
        " in ": null
    },
    {
        "effigy": "effigy"
    },
    {
        " by the Austrian government for his share in the Hungarian revolt.     In exile for ten years, he studied politics in what was then the centre of European diplomacy. He discerned the weakness of the second French empire beneath its imposing exterior.     Andrássy returned to Hungary in 42 but his position was still difficult. He had never petitioned for an ": null
    },
    {
        "amnesty": "amnesty"
    },
    {
        ", and had steadily rejected all the overtures both of the Austrian government and of the Magyar Conservatives He enthusiastically supported ": null
    },
    {
        "Ferenc Deák": "ferenc deák"
    },
    {
        "s party.     On 42 December 42 he was chosen vice-president of the Diet. In March 42 he was elected as president of the sub-committee appointed by the parliamentary commission to draw up the ": null
    },
    {
        "Austro-Hungarian Compromise of 42": "austro-hungarian compromise of 1867"
    },
    {
        " between Austria and Hungary. He originated the idea of the Delegations of powers.   It was said at that time that he was the only member of the commission who could persuade the court of the justice of the national claims.     After the ": null
    },
    {
        "Battle of Königgrätz": "battle of königgrätz"
    },
    {
        ", he was formally consulted by ": null
    },
    {
        "Emperor Franz Joseph": "emperor franz joseph"
    },
    {
        " for the first time. He recommended the re-establishment of the constitution and the appointment of a responsible foreign and defence ministry.     On 42 February 42 the king appointed him as the first prime minister of the Hungarian half of the newly formed Dual Monarchy of ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ". The obvious first choice had been ": null
    },
    {
        "Ferenc Deák": "ferenc deák"
    },
    {
        ", one of the architects of the ": null
    },
    {
        "Compromise": "austro-hungarian compromise of 1867"
    },
    {
        ", but he stepped down in favour of Andrássy. Deák described him as the providential statesman given to Hungary by the grace of God.     As premier, Andrássy by his firmness, amiability and dexterity as a debater, soon won for himself a commanding position. Yet his position continued to be difficult, inasmuch as the authority of Deák dwarfed that of all the party leaders, however eminent.     Andrássy chose for himself the departments of war and foreign affairs. It was he who reorganized the ": null
    },
    {
        "Honvéd": "royal hungarian landwehr"
    },
    {
        " system , and he used often to say that the regulation of the military border districts was the most difficult labour of his life.     On the outbreak of the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        " of 42 Andrássy resolutely defended the neutrality of the Austrian monarchy, and in his speech on 42 July 42 warmly protested against the assumption that it was in the interests of Austria to seek to recover the position she had held in Germany before 42 On the fall of ": null
    },
    {
        "Beust": "count friedrich ferdinand von beust"
    },
    {
        " , Andrássy stepped into his place. His tenure of the chancellorship was epoch-making.     Hitherto the empire of the Habsburgs had never been able to dissociate itself from its ": null
    },
    {
        "Holy Roman": "holy roman empire"
    },
    {
        " traditions. But its loss of influence in ": null
    },
    {
        "Italy": "italy"
    },
    {
        " and Germany, and the consequent formation of the ": null
    },
    {
        "Dual State": "dual state"
    },
    {
        ", had at length indicated the proper, and, indeed, the only field for its diplomacy in the future – the ": null
    },
    {
        "Near East": "near east"
    },
    {
        ", where the process of the crystallization of the ": null
    },
    {
        "Balkan": "balkan"
    },
    {
        " peoples into nationalities was still incomplete. The question was whether these nationalities were to be allowed to become independent or were only to exchange the tyranny of the ": null
    },
    {
        "sultan": "sultan"
    },
    {
        " for the tyranny of the ": null
    },
    {
        "tsar": "tsar"
    },
    {
        " or the Habsburg emperor.     Hitherto Austria had been content either to keep out the ": null
    },
    {
        "Russians": "russians"
    },
    {
        " or share the booty with them. She was now, moreover, in consequence of her misfortunes deprived of most of her influence in the councils of Europe.      It was Andrassy who recovered for her proper place in the European concert. First he approached the German emperor; then more friendly relations were established with the courts of ": null
    },
    {
        "Italy": "italy"
    },
    {
        " and ": null
    },
    {
        "Russia": "russia"
    },
    {
        " by means of conferences at Berlin, ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", ": null
    },
    {
        "St Petersburg": "st petersburg"
    },
    {
        " and ": null
    },
    {
        "Venice": "venice"
    },
    {
        ".       The recovered influence of Austria was evident in the negotiations which followed the outbreak of serious disturbances in ": null
    },
    {
        "Bosnia": "bosnia vilayet"
    },
    {
        " in 42     The three courts of Vienna, Berlin and St Petersburg reached an understanding as to their attitude in the Eastern question, and their views were embodied in the dispatch, known as the Andrássy Note , sent on 42 December 42 by Andrássy to Count Beust, the Austrian ambassador to the Court of St James.     In it he pointed out that the efforts of the powers to localize the revolt seemed in danger of failure, that the rebels were still holding their own, and that the ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " promises of reform, embodied in various ": null
    },
    {
        "firman": "firman"
    },
    {
        "s, were no more than vague statements of principle which had never had, and were probably not intended to have, any local application. In order to avert the risk of a general conflagration, therefore, he urged that the time had come for concerted action of the powers for the purpose of pressing the Porte to fulfil its promises.     A sketch of the more essential reforms followed: the recognition rather than the toleration of the ": null
    },
    {
        "Christian religion": "christianity"
    },
    {
        "; the abolition of the system of farming the taxes; and, in ": null
    },
    {
        "Bosnia and Herzegovina": "bosnia and herzegovina"
    },
    {
        ", where the religious was complicated by an agrarian question, the conversion of the Christian peasants into free proprietors, to rescue them from their double subjection to the Muslim Ottoman landowners.     In ": null
    },
    {
        "Bosnia and Herzegovina": "bosnia and herzegovina"
    },
    {
        " elected provincial councils were to be established, life-term judges appointed and individual liberties guaranteed.     Finally, a mixed commission of Muslims and Christians was to be empowered to watch over the carrying out of these reforms.     The fact that the sultan would be responsible to Europe for the realization of his promises would serve to allay the natural suspicions of the insurgents. To this plan both ": null
    },
    {
        "Britain": "great britain"
    },
    {
        " and France gave a general assent, and the Andrássy Note was adopted as the basis of negotiations.     When war became inevitable between ": null
    },
    {
        "Russia": "russia"
    },
    {
        " and the Porte, Andrássy arranged with the Russian court that, in case ": null
    },
    {
        "Russia": "russia"
    },
    {
        " prevailed, the status quo should not be changed to the detriment of the Austrian monarchy. When, however, the ": null
    },
    {
        "Treaty of San Stefano": "treaty of san stefano"
    },
    {
        " threatened a Russian hegemony in the Near East, Andrássy concurred with the German and British courts that the final adjustment of matters must be submitted to a European congress.      At the ": null
    },
    {
        "Congress of Berlin": "congress of berlin"
    },
    {
        " in 42 he was the principal Austrian plenipotentiary, and directed his efforts to diminish the gains of ": null
    },
    {
        "Russia": "russia"
    },
    {
        " and aggrandize the Dual Monarchy. Before the Congress opened on 42 June, negotiations between Andrássy and the British Foreign Secretary ": null
    },
    {
        "Marquess of Salisbury": "robert cecil, 3rd marquess of salisbury"
    },
    {
        " had already ended on 42 June by Britain agreeing to all the Austrian proposals relative to Bosnia-Herzegovina about to come before the congress while Austria would support British demands .     In addition to the ": null
    },
    {
        "occupation and administration of Bosnia-Herzegovina": "austro-hungarian campaign in bosnia and herzegovina in 1878"
    },
    {
        ", Andrássy also obtained the right to station garrisons in the ": null
    },
    {
        "Sanjak of Novi Pazar": "sanjak of novi pazar"
    },
    {
        ", which remained under Ottoman administration. The Sanjak preserved the separation of Serbia and Montenegro, and the Austro-Hungarian garrisons there would open the way for a dash to Salonika that would bring the western half of the Balkans under permanent Austrian influence . High military authorities desired immediate major expedition with Salonika as its objective .     This occupation was most unpopular in Hungary, both for financial reasons and because of the strong philo-Turk sentiments of the Magyars.       On 42 September 42 the Finance Minister, Koloman von Zell, threatened to resign if the army, behind which stood the ": null
    },
    {
        "Archduke Albert": "archduke albrecht, duke of teschen"
    },
    {
        ", were allowed to advance to Salonika. In the session of the Hungarian Parliament of 42 November 42 the Opposition proposed that the Foreign Minister should be impeached for violating the constitution by his policy during the Near East Crisis and by the occupation of Bosnia-Herzegovina. The motion was lost by 42 to 42 By the Opposition rank and file the gravest accusations were raised against Andrassy.       On 42 October 42 the French diplomat ": null
    },
    {
        "Melchior de Vogüé": "melchior de vogüé"
    },
    {
        " described the situation as follows:       Particularly in Hungary the dissatisfaction caused by this adventure has reached the gravest proportions, prompted by that strong conservative instinct which animates the Magyar race and is the secret of its destinies. This vigorous and exclusive instinct explains the historical phenomenon of an isolated group, small in numbers yet dominating a country inhabited by a majority of peoples of different races and conflicting aspirations, and playing a role in European affairs out of all proportions to its numerical importance or intellectual culture. This instinct is to-day awakened and gives warning that it feels the occupation of Bosnia-Herzegovina to be a menace which, by introducing fresh Slav elements into the Hungarian political organism and providing a wider field and further recruitment of the Croat opposition, would upset the unstable equilibrium in which the Magyar domination is poised.       Andrássy felt constrained to bow before the storm, and he placed his resignation in the emperors hands . The day before his retirement he signed the offensive-defensive alliance with Germany, which placed the foreign relations of Austria-Hungary once more on a stable footing.          After his retirement, Andrássy continued to take an active part in public affairs both in the Delegations and in the Upper House. In 42 he warmly supported the project for the reform of the ": null
    },
    {
        "House of Magnates": "house of magnates"
    },
    {
        ", but on the other hand he jealously defended the inviolability of the Composition of 42 and on 42 March 42 in his place in the Upper House spoke against any particularist tampering with the common army. In the last years of his life he regained his popularity, and his death on 42 February 42 aged 42 was mourned as a national calamity. There is a plaque dedicated to him in the town of ": null
    },
    {
        "Volosko": "volosko"
    },
    {
        " where he died . It is located just above the restaurant Amfora.     He was the first Magyar statesman who, for centuries, had occupied a European position. It has been said that he united in himself the Magyar magnate with the modern gentleman. His motto was: It is hard to promise, but it is easy to perform. If Deák was the architect, Andrássy certainly was the master-builder of the modern Hungarian state.       Andrássy married countess ": null
    },
    {
        "Katinka Kendeffy": "katinka kendeffy"
    },
    {
        " in Paris in 42 They had two sons, ": null
    },
    {
        "Tivadar": "tivadar andrássy"
    },
    {
        " and ": null
    },
    {
        "Gyula": "gyula andrássy the younger"
    },
    {
        " , and one daughter, ": null
    },
    {
        "Ilona": "ilona andrássy"
    },
    {
        " .     Both sons gained distinction in Hungarian politics. Tivadar was elected vice-president of the Lower House of the Hungarian parliament in 42 Gyula also had a successful political career.     Count Gyula Andrássys granddaughter, Klára, married the Hungarian nobleman and industrialist Prince Károly Odescalchi.      According to common legend, Count Andrássy had a long lasting romance with ": null
    },
    {
        "Elisabeth, Empress of Austria and Queen of Hungary": "empress elisabeth of austria"
    },
    {
        ", also known as Sisi, the wife of Emperor ": null
    },
    {
        "Franz Josef I": "franz josef i"
    },
    {
        " of Austria-Hungary. Some rumored that Sisis fourth child, ": null
    },
    {
        "Archduchess Marie Valerie of Austria": "archduchess marie valerie of austria"
    },
    {
        ", had been fathered by Andrassy. There is no evidence for this, and the rumor may have evolved due to the devotion of both Sisi and Count Andrássy towards Hungary, its culture and national customs , and the amount of time they spent together in mutual pursuit of their dreams for Hungary. Additionally, as Marie Valerie grew up, her physical resemblance to her father Franz Josef became very marked.     Count Andrássy had four granddaughters, Klára above, Borbála, married Marquis Pallavicini, Katalin married Count ": null
    },
    {
        "Mihály Károlyi": "mihály károlyi"
    },
    {
        " and Ilona war widow of Prince ": null
    },
    {
        "Pál Esterházy": "pál esterházy"
    },
    {
        ", remarried Count ": null
    },
    {
        "József Cziráky": "józsef cziráky"
    }
]