[
    {
        "      The Haijin or sea ban was a series of related ": null
    },
    {
        "isolationist": "isolationism"
    },
    {
        " Chinese policies restricting private maritime trading and coastal settlement during most of the ": null
    },
    {
        "Ming dynasty": "ming dynasty"
    },
    {
        " and some of the ": null
    },
    {
        "Qing": "qing dynasty"
    },
    {
        ". Despite official proclamations the Ming policy was not enforced in practice, and trade continued without hindrance.     First imposed to deal with ": null
    },
    {
        "Japanese": "ashikaga shogunate"
    },
    {
        " piracy": "wokou"
    },
    {
        " amid the mopping up of ": null
    },
    {
        "Yuan": "yuan dynasty"
    },
    {
        " partisans, the sea ban was completely counterproductive: by the 42th century, piracy and smuggling were endemic and mostly consisted of Chinese who had been dispossessed by the policy. Chinas foreign trade was limited to irregular and expensive ": null
    },
    {
        "tribute missions": "imperial chinese tributary system"
    },
    {
        ", and the military pressure from the Mongols after the disastrous ": null
    },
    {
        "Battle of Tumu": "battle of tumu"
    },
    {
        " led to the scrapping of ": null
    },
    {
        "Zheng He": "zheng he"
    },
    {
        "s fleets. Piracy dropped to negligible levels only upon the end of the policy in 42 but a modified form was subsequently adopted by the Qing. This produced the ": null
    },
    {
        "Canton System": "canton system"
    },
    {
        " of the ": null
    },
    {
        "Thirteen Factories": "thirteen factories"
    },
    {
        ", but also the ": null
    },
    {
        "opium smuggling": "history of opium in china"
    },
    {
        " that led to ": null
    },
    {
        "disastrous wars": "opium wars"
    },
    {
        " with ": null
    },
    {
        "Britain": "united kingdom of great britain and ireland"
    },
    {
        " and other European powers in the 42th century.     The policy was also mimicked by both ": null
    },
    {
        "Tokugawa Japan": "tokugawa japan"
    },
    {
        "  and ": null
    },
    {
        "Joseon Korea": "joseon korea"
    },
    {
        ", which became known as the ": null
    },
    {
        "Hermit Kingdom": "hermit kingdom"
    },
    {
        " , before they were opened militarily in ": null
    },
    {
        "42": "bakumatsu"
    },
    {
        " and ": null
    },
    {
        "42": "japan–korea treaty of 1876"
    },
    {
        ".              The 42th century was a time of chaos throughout ": null
    },
    {
        "East Asia": "east asia"
    },
    {
        ". The ": null
    },
    {
        "second": "second plague pandemic"
    },
    {
        " bubonic plague": "bubonic plague"
    },
    {
        " pandemic began in ": null
    },
    {
        "Mongolia": "yuan mongolia"
    },
    {
        " around 42 and may have killed the majority of the population in ": null
    },
    {
        "Hebei": "hebei"
    },
    {
        " and ": null
    },
    {
        "Shanxi": "shanxi"
    },
    {
        " and millions elsewhere. Another epidemic raged for three years from 42–42 Existing revolts over the government salt monopoly and severe floods along the ": null
    },
    {
        "Yellow River": "yellow river"
    },
    {
        " provoked the ": null
    },
    {
        "Red Turban Rebellion": "red turban rebellion"
    },
    {
        ". The declaration of the ": null
    },
    {
        "Ming": "ming empire"
    },
    {
        " in 42 did not end its wars with ": null
    },
    {
        "Mongol": "yuan dynasty"
    },
    {
        " remnants under ": null
    },
    {
        "Toghon Temür": "toghon temür"
    },
    {
        " in ": null
    },
    {
        "the north": "northern yuan"
    },
    {
        " and under the ": null
    },
    {
        "Prince of Liang": "basalawarmi"
    },
    {
        " in ": null
    },
    {
        "the south": "viceroy of yun-gui"
    },
    {
        ". ": null
    },
    {
        "King Gongmin": "gongmin of goryeo"
    },
    {
        " of ": null
    },
    {
        "Korea": "goryeo"
    },
    {
        " had begun freeing himself from the ": null
    },
    {
        "Mongols": "yuan dynasty"
    },
    {
        " as well, retaking his countrys northern provinces, when a ": null
    },
    {
        "Red Turban": "red turban invasions of goryeo"
    },
    {
        " invasion devastated the areas and laid waste to ": null
    },
    {
        "Pyongyang": "pyongyang"
    },
    {
        ". In Japan, ": null
    },
    {
        "Emperor Daigo II": "emperor go-daigo"
    },
    {
        "s ": null
    },
    {
        "Kenmu Restoration": "kenmu restoration"
    },
    {
        " succeeded in overthrowing the ": null
    },
    {
        "Kamakura shogunate": "kamakura period"
    },
    {
        " but ultimately simply replaced them with the weaker ": null
    },
    {
        "Ashikaga": "ashikaga shogunate"
    },
    {
        ".     The loose control over Japans periphery led to ": null
    },
    {
        "pirates": "wokou"
    },
    {
        " setting up bases on the realms outlying islands, particularly ": null
    },
    {
        "Tsushima": "tsushima island"
    },
    {
        ", ": null
    },
    {
        "Iki": "iki island"
    },
    {
        ", and the ": null
    },
    {
        "Gotōs": "gotō islands"
    },
    {
        ". These ": null
    },
    {
        "dwarf pirates": "wokou"
    },
    {
        " raided Japan as well as Korea and China.     The ": null
    },
    {
        "Treasure voyages": "treasure voyages"
    },
    {
        " of ": null
    },
    {
        "Zheng He": "zheng he"
    },
    {
        " were discontinued due to a rise in Mongol assertiveness after the Emperors capture at the ": null
    },
    {
        "Battle of Tumu": "battle of tumu"
    },
    {
        " in 42 The large scale of private overseas trade had caused price competition for the Ming governments purchases, such as warhorses for the northern frontier, and funds had to be reallocated. However, after the end of the Treasure voyages, Chinese trade within Asia and North Africa continued.        As a rebel leader, Zhu Yuanzhang promoted foreign trade as a source of revenue. As the ": null
    },
    {
        "Hongwu Emperor": "hongwu emperor"
    },
    {
        ", first of the ": null
    },
    {
        "Ming Dynasty": "ming dynasty"
    },
    {
        ", however, he issued the first sea ban in 42 All foreign trade was to be conducted by official ": null
    },
    {
        "tribute missions": "imperial chinese tributary system"
    },
    {
        ", handled by representatives of the Ming Empire and its vassal states. Private foreign trade was made punishable by death, with the offenders ": null
    },
    {
        "family and neighbors exiled": "collective punishment"
    },
    {
        " from their homes. . A few years later, in 42 the Maritime Trade Intendancies  at ": null
    },
    {
        "Ningbo": "ningbo"
    },
    {
        ", ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        ", and ": null
    },
    {
        "Quanzhou": "quanzhou"
    },
    {
        " were shuttered. Ships, docks, and shipyards were destroyed and ports sabotaged with rocks and pine stakes. . Although the policy is now associated with imperial China generally, it was then at odds with Chinese tradition, which had pursued foreign trade as a source of revenue and become particularly important under the ": null
    },
    {
        "Tang": "tang dynasty"
    },
    {
        ", ": null
    },
    {
        "Song": "song dynasty"
    },
    {
        ", and ": null
    },
    {
        "Yuan": "yuan dynasty"
    },
    {
        ". A 42 edict prohibited maritime trade between the lands north and south of the Yangtze River, attempting to put a stop to captains claiming to be heading to Jiangsu and then diverting to Japan.       Although the policy has generally been ascribed to national defense against the pirates, it was so obviously counterproductive and yet carried on for so long that other explanations have been offered. The initial conception seems to have been to use the Japanese need for Chinese goods to force them to terms. Parallels with Song and Yuan measures restricting outflows of ": null
    },
    {
        "bullion": "bullion"
    },
    {
        " have led some to argue that it was intended to support the Hongwu Emperors ": null
    },
    {
        "printing of fiat currency": "ming currency"
    },
    {
        ", whose use was continued by his successors as late as 42  Others assert that it was a side effect of a desire to elevate ": null
    },
    {
        "Confucian": "confucianism"
    },
    {
        " humaneness": "ren"
    },
    {
        "  and eliminate greed from the realms foreign relations or a ploy to weaken the realms southern subjects to the benefit of the central government. . Nonetheless, it may have been the case that the Hongwu Emperor prioritized protecting his state against the ": null
    },
    {
        "Northern Yuan": "northern yuan dynasty"
    },
    {
        " remnants, leaving the policy and its local enforcers as the most he could accomplish . and his mention of them in his  Ancestral Injunctions  as responsible for their continuation.       The policy offered too little—decennial tribute missions comprising only two ships—as a reward for good behavior and enticement for Japanese authorities to root out their smugglers and pirates. The Hongwu Emperors message to the ": null
    },
    {
        "Japanese": "ashikaga shogunate"
    },
    {
        " that his army would capture and exterminate your bandits, head straight for your country, and put your ": null
    },
    {
        "king": "emperor of japan"
    },
    {
        " in bonds  received the ": null
    },
    {
        "Ashikaga shogun": "ashikaga shogunate"
    },
    {
        "s reply that your great empire may be able to invade Japan but our small state is not short of a strategy to defend ourselves . .     Although the sea ban left the Ming army free to extirpate the remaining Yuan loyalists and secure Chinas borders, it tied up local resources. 42 coastal garrisons were established from ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        " in ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        " to ": null
    },
    {
        "Shandong": "shandong"
    },
    {
        "; under the ": null
    },
    {
        "Yongle Emperor": "yongle emperor"
    },
    {
        ", these outposts were notionally manned by 42 subjects. . The loss of income from taxes on trade contributed to chronic funding difficulties throughout the Ming, particularly for ": null
    },
    {
        "Zhejiang": "zhejiang"
    },
    {
        " and ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        " provinces. By impoverishing and provoking both coastal Chinese and Japanese against the regime, it increased the problem it was purporting to solve. . The initial wave of Japanese pirates had been independently dealt with by ": null
    },
    {
        "Jeong Mong-ju": "jeong mong-ju"
    },
    {
        " and ": null
    },
    {
        "Imagawa Sadayo": "imagawa sadayo"
    },
    {
        ", who returned their booty and slaves to Korea; .  .  ": null
    },
    {
        "Ashikaga Yoshimitsu": "ashikaga yoshimitsu"
    },
    {
        " delivered 42 more to China in 42 which boiled them alive in a cauldron in ": null
    },
    {
        "Ningbo": "ningbo"
    },
    {
        ". . However, the raids on China continued, most grievously under the ": null
    },
    {
        "Jiajing Emperor": "jiajing emperor"
    },
    {
        ". By the 42th century, the Japanese , ": null
    },
    {
        "dwarf": "wokou"
    },
    {
        " , and ": null
    },
    {
        "eastern barbarian": "dongyi"
    },
    {
        " pirates of the ": null
    },
    {
        "Jiajing wokou raids": "jiajing wokou raids"
    },
    {
        " were mostly non-Japanese.      Nonetheless, because the sea ban was added by the Hongwu Emperor to his  Ancestral Injunctions , it continued to be broadly enforced through most of the rest of his dynasty. For the next two centuries, the rich farmland of the south and the military theaters of the north were linked almost solely by the ": null
    },
    {
        "Jinghang Canal": "jinghang canal"
    },
    {
        ". . Bribery and disinterest occasionally permitted more leeway, as when the ": null
    },
    {
        "Portuguese": "portuguese empire"
    },
    {
        " began trading at ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        " , ": null
    },
    {
        "Shuangyu": "shuangyu"
    },
    {
        " , and ": null
    },
    {
        "Quanzhou": "quanzhou"
    },
    {
        " , but crackdowns also occurred, as with the expulsion of the Portuguese in the 42s, on the islands off ": null
    },
    {
        "Ningbo": "ningbo"
    },
    {
        " and ": null
    },
    {
        "Zhangzhou": "zhangzhou"
    },
    {
        " in 42 or at ": null
    },
    {
        "Yuegang": "yuegang"
    },
    {
        " in 42 The Portuguese were permitted to settle at ": null
    },
    {
        "Macao": "portuguese macao"
    },
    {
        " in 42 but only after several years of helping the Chinese suppress piracy.     The sea ban was largely unenforceable from its earliest years. Local authorities themselves were frequently involved in the illicit trade, and usually ignored edicts to restrict trade. Military officers brokered trade deals and the wealthy families in the coastal settlements depended on its income. Ordinary workers found employment in trade-related industries. Many of the official posts to enforce trade regulations were left vacant and the Maritime Trading Intendancies were abolished. The court generally ignored the issue of overseas trade. The Grand secretary of the court in the 42s was from coastal Zhejiang province, and he proceeded to block any attempt to enforce the sea ban. The most significant attempt to crush out the illicit trade was made by Chu Wan, an official appointed by the court in the 42s, but just as he was making headway in wiping out the smugglers he was removed by the court on accusations of unauthorised killings.      Piracy dropped to negligible levels only after the general abolition of the policy in 42 upon the ascension of the ": null
    },
    {
        "Longqing Emperor": "longqing emperor"
    },
    {
        " and at the urging of the ": null
    },
    {
        "governor": "governor of fujian"
    },
    {
        " of ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        ". Chinese merchants were then permitted to engage in all foreign trade except with Japan or involving weapons or other contraband goods; these included iron, sulfur, and copper. The number of foreign traders was capped by a license and quota system; no trading could take them away from China for longer than a year. Maritime trade intendancies were reëstablished at ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        " and ": null
    },
    {
        "Ningbo": "ningbo"
    },
    {
        " in 42 and Chinese merchants turned ": null
    },
    {
        "Yuegang": "yuegang"
    },
    {
        "  into a thriving port. The end of the sea ban did not mark an imperial change of heart, however, so much as a recognition that the weakness of the later Ming state made it impossible to continue the prohibition. The state continued to regulate trade as heavily as it could, and foreigners were restricted to doing business through approved agents, with prohibitions against any direct business with ordinary Chinese. Accommodations could be made, but were slow in coming: the merchants of Yuegang were trading heavily with the Spanish within a year of ": null
    },
    {
        "Maynila": "kingdom of maynila"
    },
    {
        "s 42 ": null
    },
    {
        "conquest": "spanish conquest of the philippines"
    },
    {
        " by ": null
    },
    {
        "Martín de Goiti": "martín de goiti"
    },
    {
        " but it wasnt until 42 that the throne approved the citys requests for more merchant licenses to expand the trade. Fu Yuanchus 42 memorial to the throne made the case that trade between ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        " and ": null
    },
    {
        "Dutch Taiwan": "dutch taiwan"
    },
    {
        " had made the ban entirely unworkable.          China acted as the cog running the wheel of global trade.  Trade with Japan continued unobstructed despite the embargo, through Chinese smugglers, Southeast Asian ports, or Portuguese. China was entirely integrated in the world trading system.      European nations had a great desire for Chinese goods such as ": null
    },
    {
        "silk": "silk industry in china"
    },
    {
        " and ": null
    },
    {
        "porcelain": "porcelain"
    },
    {
        ".  The Europeans did not have any goods or commodities which China desired, so they traded silver to make up for their trade deficit.  Spaniards at the time of the ": null
    },
    {
        "Age of Exploration": "age of discovery"
    },
    {
        " discovered vast amounts of silver, much of which was from the ": null
    },
    {
        "Potosí": "potosí"
    },
    {
        " silver mines, to fuel their trade economy. Spanish American silver mines were the worlds cheapest sources of it,  producing 42 tons of silver in 42 years.  The ultimate destination for the mass amounts of silver produced in the Americas and Japan was China.  From 42 to 42 Mexico and Peru produced about 42%  of the worlds silver with 42% of it eventually ending up in China. In the late 42th and early 42th century, Japan was also exporting silver heavily into China. Silver from the Americas flowed mostly across the Atlantic and made its way to the far east. Major outposts for the silver trade were located in Southeast Asian countries, such as the Philippines.  The city of Manila served as a primary outpost of the exchange of goods between the Americas, Japan, Indian, Indonesia and China. However, there was a large amount of silver that crossed across the Pacific Ocean directly from the Americas as well.     Trade with ": null
    },
    {
        "Ming China": "ming dynasty"
    },
    {
        " via Manila served a major source of revenue for the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        " and as a fundamental source of income for Spanish colonists in the Philippine Islands. Until 42 two or more ships would set sail annually from each port. Schurz, William Lytle. The Manila Galleon, 42 P 42 The galleon trade was supplied by merchants largely from port areas of ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        " who traveled to Manila to sell the Spaniards spices, ": null
    },
    {
        "porcelain": "porcelain"
    },
    {
        ", ": null
    },
    {
        "ivory": "ivory"
    },
    {
        ", ": null
    },
    {
        "lacquerware": "lacquerware"
    },
    {
        ", processed ": null
    },
    {
        "silk": "silk"
    },
    {
        " cloth and other valuable commodities. Cargoes varied from one voyage to another but often included goods from all over Asia - jade, wax, gunpowder and silk from China; amber, cotton and rugs from India; spices from Indonesia and Malaysia; and a variety of goods from Japan, including fans, chests, screens and porcelain.               As the ": null
    },
    {
        "Qing": "qing empire"
    },
    {
        " expanded south": "qing conquest of the ming"
    },
    {
        " following ": null
    },
    {
        "their victory at Shanhai Pass": "shanhai pass"
    },
    {
        ", the ": null
    },
    {
        "Southern Ming": "southern ming"
    },
    {
        " were supported by the ": null
    },
    {
        "Zheng clan": "house of koxinga"
    },
    {
        ". ": null
    },
    {
        "Zheng Zhilong": "zheng zhilong"
    },
    {
        " surrendered the passes through ": null
    },
    {
        "Zhejiang": "zhejiang"
    },
    {
        " in exchange for a wealthy retirement, but his son ": null
    },
    {
        "Zheng Chenggong": "zheng chenggong"
    },
    {
        "—better known by his ": null
    },
    {
        "Hokkien": "hokkien language"
    },
    {
        " honorific Koxinga—continued to resist from ": null
    },
    {
        "Xiamen": "xiamen"
    },
    {
        " and then, after wresting its control from the ": null
    },
    {
        "Dutch": "dutch formosa"
    },
    {
        ", ": null
    },
    {
        "Taiwan": "taiwan island"
    },
    {
        ". ": null
    },
    {
        "His dynasty": "house of koxinga"
    },
    {
        " then developed it as the independent state of ": null
    },
    {
        "Tungning": "kingdom of tungning"
    },
    {
        ", but were driven from their mainland bases in 42          The ": null
    },
    {
        "Qing": "qing dynasty"
    },
    {
        " regent": "dorgondorgons regency"
    },
    {
        " Prince Rui": "dorgon"
    },
    {
        " resumed the sea ban in 42 but it was not effective until a more severe order followed in 42 upon the ascension of the ": null
    },
    {
        "Kangxi Emperor": "kangxi emperor"
    },
    {
        ". In an evacuation known as the ": null
    },
    {
        "Great Clearance": "great clearance"
    },
    {
        " or Frontier Shift , coastal residents of ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        ", ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        ", ": null
    },
    {
        "Zhejiang": "zhejiang"
    },
    {
        ", ": null
    },
    {
        "Jiangsu": "jiangsu"
    },
    {
        ", and parts of ": null
    },
    {
        "Shandong": "shandong"
    },
    {
        " were required to destroy their property and move inland  , with ": null
    },
    {
        "Qing soldiers": "qing army"
    },
    {
        " erecting boundary markers and enforcing the death penalty on those beyond it. Ships were destroyed, and foreign trade was again limited to that passing through ": null
    },
    {
        "Macao": "portuguese macao"
    },
    {
        ". Checks and adjustments were made the following year, and the inhabitants of five ": null
    },
    {
        "counties": "county"
    },
    {
        "—": null
    },
    {
        "Panyu": "panyu district"
    },
    {
        ", ": null
    },
    {
        "Shunde": "shunde"
    },
    {
        ", ": null
    },
    {
        "Xinhui": "xinhui"
    },
    {
        ", ": null
    },
    {
        "Dongguan": "dongguan"
    },
    {
        ", and ": null
    },
    {
        "Zhongshan": "zhongshan"
    },
    {
        "—moved again the year after that. Following numerous high-level memorials, the evacuation was no longer enforced after 42 In 42 following the destruction of ": null
    },
    {
        "Tungning": "kingdom of tungning"
    },
    {
        ", other bans were lifted. The year after that, customs offices were established in ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        ", ": null
    },
    {
        "Xiamen": "xiamen"
    },
    {
        ", ": null
    },
    {
        "Ningbo": "ningbo"
    },
    {
        ", and ": null
    },
    {
        "Songjiang": "songjiang town"
    },
    {
        " to deal with foreign trade.     Repressive Qing policies such as the ": null
    },
    {
        "queue": "queue"
    },
    {
        " caused Chinese traders to ": null
    },
    {
        "emigrate": "chinese diaspora"
    },
    {
        " in such large numbers, however, that the ": null
    },
    {
        "Kangxi Emperor": "kangxi emperor"
    },
    {
        " began to fear the military implications. The immigrant community in ": null
    },
    {
        "Jakarta": "jakarta"
    },
    {
        " was estimated at 42 and rumors circulated that a Ming heir was living on ": null
    },
    {
        "Luzon": "luzon"
    },
    {
        ". A ban on trade in the ": null
    },
    {
        "Southern Ocean": "south china sea"
    },
    {
        " followed in 42 with tighter port inspections and travel restrictions. Emigrants were ordered to return to China within the next three years upon penalty of death; those emigrating in future were to face the same punishment.     Legal trade in the South China Sea was resumed in 42 but the ": null
    },
    {
        "East India Company": "british east india company"
    },
    {
        "s discovery that the prices and duties at ": null
    },
    {
        "Ningbo": "ningbo"
    },
    {
        " were both much lower than those at ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        " prompted them to begin shifting their trade north from 42 to 42 The ": null
    },
    {
        "Qianlong Emperor": "qianlong emperor"
    },
    {
        "s attempt to discourage this through higher fees failed; in the winter of 42 he declared that—effective the next year—": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        "  was to be the only Chinese port permitted to foreign traders, beginning the ": null
    },
    {
        "Canton System": "canton system"
    },
    {
        ", with its ": null
    },
    {
        "Cohong": "cohong"
    },
    {
        " and ": null
    },
    {
        "Thirteen Factories": "thirteen factories"
    },
    {
        ". Chinese merchants trading with foreigners, on the other hand, were not affected by any of these regulations.        The initial Qing sea ban curtailed Koxingas influence on the Chinese mainland and ended with ": null
    },
    {
        "his state": "kingdom of tungning"
    },
    {
        "s defeat, which brought ": null
    },
    {
        "Taiwan": "taiwan island"
    },
    {
        " into the ": null
    },
    {
        "Qing Empire": "qing empire"
    },
    {
        ".     Nonetheless, it was quite harmful to the Chinese themselves, as documented in governors and viceroys memorials to the throne. Even before the Kangxi Emperors restrictions, Jin Fus 42 memorial to the throne argued that the ban on foreign trade was limiting Chinas access to silver, harmfully restricting the money supply, and that lost trading opportunities cost Chinese merchants 42 or 42 million ": null
    },
    {
        "tael": "tael"
    },
    {
        "s a year. The policies revived rebellions and piracy along the coast, while also providing a boon for ": null
    },
    {
        "black markets": "fences in ming china"
    },
    {
        ". The ": null
    },
    {
        "Great Clearance": "great clearance"
    },
    {
        " was completely disruptive to Chinas southern coasts. Of the roughly 42 residents of ": null
    },
    {
        "Xinan County": "xinan county"
    },
    {
        "  who were driven inland in 42 only 42 were recorded returning in 42 Powerful ": null
    },
    {
        "typhoon": "typhoon"
    },
    {
        "s that year and in 42 further destroyed local communities and discouraged resettlement. When trade restrictions were released, ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        " and ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        " saw ": null
    },
    {
        "enormous outflows": "chinese diaspora"
    },
    {
        " of migrants. The conflicts between the ": null
    },
    {
        "former residents": "punti"
    },
    {
        " and the newcomers such as the ": null
    },
    {
        "Hakka": "hakka people"
    },
    {
        " provoked lingering feuds that erupted into ": null
    },
    {
        "full-scale war": "punti-hakka clan wars"
    },
    {
        " in the 42s and 42s and that fueled Guangdongs piracy into the 42th century.     European countries trade with China was so extensive that they were forced to risk silver deficits to supply merchants in Asia.  As supplies of silver decreased in Europe, Europeans had less ability to purchase highly coveted Chinese goods. Merchants were no longer able to sustain the China trade through profits made by selling Chinese goods in the West and were forced to take bullion out of circulation in Europe to buy goods in China.      The restrictions imposed by the ": null
    },
    {
        "Qianlong Emperor": "qianlong emperor"
    },
    {
        " that established the ": null
    },
    {
        "Canton System": "canton system"
    },
    {
        " were highly lucrative for ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        "s ": null
    },
    {
        "Cohong": "cohong"
    },
    {
        "—the merchant ": null
    },
    {
        "Howqua": "howqua"
    },
    {
        " became one of the worlds wealthiest individuals—and normalized Guangzhous tax base and inflow of foreign silver. Under the canton system, the Qianlong Emperor restricted trade to only licensed Chinese merchants, while the British government on their part issued a monopoly charter for trade only to the ": null
    },
    {
        "British East India Company": "british east india company"
    },
    {
        ". This arrangement was not challenged until the 42th century when the idea of free trade was popularised in the West.  By restricting imports mostly to ": null
    },
    {
        "bullion": "bullion"
    },
    {
        ", however, it created strong pressure on the ": null
    },
    {
        "British": "united kingdom of great britain and ireland"
    },
    {
        "—for whom tea had become ": null
    },
    {
        "the national drink": "british tea culture"
    },
    {
        " over the course of the 42th century—to find any means possible to adjust the balance of trade. This turned out to be ": null
    },
    {
        "smuggled Indian opium": "history of opium in china"
    },
    {
        ", which became so lucrative and important that the ": null
    },
    {
        "viceroy": "viceroy of liangguang"
    },
    {
        " Lin Zexu": "lin zexu"
    },
    {
        "s vigorous enforcement of existing laws against it prompted the ": null
    },
    {
        "First Opium War": "first opium war"
    },
    {
        " and the beginning of the ": null
    },
    {
        "unequal treaties": "unequal treaties"
    },
    {
        " that restricted Qing sovereignty in the 42th century. The 42 ": null
    },
    {
        "Treaty of Nanking": "treaty of nanking"
    },
    {
        " opened the ports of ": null
    },
    {
        "Xiamen": "xiamen"
    },
    {
        " , ": null
    },
    {
        "Fuzhou": "fuzhou"
    },
    {
        " , ": null
    },
    {
        "Ningbo": "ningbo"
    },
    {
        " , and ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        ", but legal trade continued to be limited to specified ports to ": null
    },
    {
        "the end of the dynasty": "xinhai revolution"
    }
]