[
    {
        "                      Hair is a ": null
    },
    {
        "protein filament": "protein filament"
    },
    {
        " that grows from ": null
    },
    {
        "follicles": "hair follicle"
    },
    {
        " found in the ": null
    },
    {
        "dermis": "dermis"
    },
    {
        ". Hair is one of the defining characteristics of ": null
    },
    {
        "mammal": "mammal"
    },
    {
        "s.   The human body, apart from areas of glabrous skin, is covered in follicles which produce thick ": null
    },
    {
        "terminal": "terminal hair"
    },
    {
        " and fine ": null
    },
    {
        "vellus hair": "vellus hair"
    },
    {
        ". Most common interest in hair is focused on ": null
    },
    {
        "hair growth": "hair growth"
    },
    {
        ", hair types, and ": null
    },
    {
        "hair care": "hair care"
    },
    {
        ", but hair is also an important ": null
    },
    {
        "biomaterial": "biomaterial"
    },
    {
        " primarily composed of protein, notably ": null
    },
    {
        "alpha-keratin": "alpha-keratin"
    },
    {
        ".     Attitudes towards different forms of hair, such as ": null
    },
    {
        "hairstyles": "hairstyle"
    },
    {
        "and ": null
    },
    {
        "hair removal": "hair removal"
    },
    {
        ", vary widely across different cultures and historical periods, but it is often used to indicate a persons personal beliefs or social position, such as their age, sex, or religion.        The word hair usually refers to two distinct structures:   the part beneath the skin, called the hair follicle, or, when pulled from the skin, the bulb. This organ is located in the ": null
    },
    {
        "dermis": "dermis"
    },
    {
        " and maintains stem cells, which not only re-grow the hair after it falls out, but also are recruited to regrow skin after a wound.    the shaft, which is the hard filamentous part that extends above the skin surface. A cross section of the hair shaft may be divided roughly into three zones.     Hair fibers have a structure consisting of several layers, starting from the outside:   the ": null
    },
    {
        "cuticle": "cuticle"
    },
    {
        ", which consists of several layers of flat, thin cells laid out overlapping one another as roof shingles   the ": null
    },
    {
        "cortex": "cortex"
    },
    {
        ", which contains the ": null
    },
    {
        "keratin": "keratin"
    },
    {
        " bundles in cell structures that remain roughly rod-like   the ": null
    },
    {
        "medulla": "medulla"
    },
    {
        ", a disorganized and open area at the fibers center           Each strand of hair is made up of the ": null
    },
    {
        "medulla": "medulla"
    },
    {
        ", ": null
    },
    {
        "cortex": "cortex"
    },
    {
        ", and ": null
    },
    {
        "cuticle": "cuticle"
    },
    {
        ". . follicle.com The innermost region, the medulla, is not always present and is an open, unstructured region.  The highly structural and organized cortex, or second of three layers of the hair, is the primary source of mechanical strength and water uptake. The cortex contains ": null
    },
    {
        "melanin": "melanin"
    },
    {
        ", which colors the fiber based on the number, distribution and types of melanin granules. The shape of the follicle determines the shape of the cortex, and the shape of the fiber is related to how straight or curly the hair is. People with straight hair have round hair fibers. Oval and other shaped fibers are generally more wavy or curly. The cuticle is the outer covering. Its complex structure slides as the hair swells and is covered with a single molecular layer of lipid that makes the hair repel water. The diameter of human hair varies from .  There are two million small, tubular glands and ": null
    },
    {
        "sweat glands": "sweat gland"
    },
    {
        "that produce watery fluids that cool the body by evaporation. The glands at the opening of the hair produce a fatty secretion that lubricates the hair.      Hair growth begins inside the ": null
    },
    {
        "hair follicle": "hair follicle"
    },
    {
        ". The only living portion of the hair is found in the follicle. The hair that is visible is the hair shaft, which exhibits no biochemical activity and is considered dead . The base of a hairs root contains the cells that produce the hair shaft.  Other structures of the hair follicle include the oil producing ": null
    },
    {
        "sebaceous gland": "sebaceous gland"
    },
    {
        " which lubricates the hair and the ": null
    },
    {
        "arrector pili": "arrector pili"
    },
    {
        " muscles, which are responsible for causing hairs to stand up. In humans with little body hair, the effect results in ": null
    },
    {
        "goose bumps": "goose bumps"
    },
    {
        ".          The root of the hair ends in an enlargement, the hair bulb, which is whiter in color and softer in texture than the shaft, and is lodged in a follicular involution of the ": null
    },
    {
        "epidermis": "epidermis"
    },
    {
        " called the ": null
    },
    {
        "hair follicle": "hair follicle"
    },
    {
        ". The bulb of hair consists of fibrous connective tissue, glassy membrane, external root sheath, internal root sheath composed of epithelium stratum  and granular stratum , cuticle, cortex and medulla.  . Histology.leeds.ac.uk. Retrieved on 18 May 2016.             All natural hair colors are the result of two types of hair pigments. Both of these pigments are melanin types, produced inside the hair follicle and packed into granules found in the fibers. ": null
    },
    {
        "Eumelanin": "eumelanin"
    },
    {
        " is the dominant pigment in ": null
    },
    {
        "brown hair": "brown hair"
    },
    {
        " and ": null
    },
    {
        "black hair": "black hair"
    },
    {
        ", while ": null
    },
    {
        "pheomelanin": "pheomelanin"
    },
    {
        " is dominant in ": null
    },
    {
        "red hair": "red hair"
    },
    {
        ". ": null
    },
    {
        "Blond hair": "blond hair"
    },
    {
        " is the result of having little ": null
    },
    {
        "pigmentation": "pigmentation"
    },
    {
        " in the hair strand. ": null
    },
    {
        "Gray hair": "gray hair"
    },
    {
        " occurs when melanin production decreases or stops, while ": null
    },
    {
        "poliosis": "poliosis"
    },
    {
        " is hair , typically in spots, that never possessed melanin at all in the first place, or ceased for natural genetic reasons, generally, in the first years of life.          Hair grows everywhere on the external body except for mucus membranes and glabrous skin, such as that found on the palms of the hands, soles of the feet, and lips.     Hair follows a specific growth cycle with three distinct and concurrent phases: ": null
    },
    {
        "anagen": "anagen"
    },
    {
        ", ": null
    },
    {
        "catagen": "catagen"
    },
    {
        ", and ": null
    },
    {
        "telogen": "telogen"
    },
    {
        " phases; all three occur simultaneously - while one strand of hair may be in the anagen phase, another may be in the telogen phase. Each has specific characteristics that determine the length of the hair.     The body has different types of hair, including ": null
    },
    {
        "vellus hair": "vellus hair"
    },
    {
        " and ": null
    },
    {
        "androgenic hair": "androgenic hair"
    },
    {
        ", each with its own type of cellular construction. The different construction gives the hair unique characteristics, serving specific purposes, mainly, warmth and protection.          Hair exists in a variety of textures. Three main aspects of hair texture are the curl pattern, volume, and consistency. The derivations of hair texture are not fully understood. All mammalian hair is composed of ": null
    },
    {
        "keratin": "keratin"
    },
    {
        ", so the make-up of ": null
    },
    {
        "hair follicles": "hair follicles"
    },
    {
        " is not the source of varying hair patterns. There are a range of theories pertaining to the curl patterns of hair. Scientists have come to believe that the shape of the ": null
    },
    {
        "hair shaft": "hair shaft"
    },
    {
        " has an effect on the curliness of the individuals hair. A very round shaft allows for fewer ": null
    },
    {
        "disulfide bonds": "disulfide bonds"
    },
    {
        " to be present in the hair strand. This means the bonds present are directly in line with one another, resulting in straight hair.      The flatter the hair shaft becomes, the curlier hair gets, because the shape allows more ": null
    },
    {
        "cysteines": "cysteine"
    },
    {
        "to become compacted together resulting in a bent shape that, with every additional disulfide bond, becomes curlier in form. As the hair follicle shape determines curl pattern, the hair follicle size determines thickness. While the circumference of the hair follicle expands, so does the thickness of the hair follicle. An individuals hair volume, as a result, can be thin, normal, or thick. The consistency of hair can almost always be grouped into three categories: fine, medium, and coarse. This trait is determined by the hair follicle volume and the condition of the strand.  Fine hair has the smallest circumference, coarse hair has the largest circumference, and medium hair is anywhere between the other two. Coarse hair has a more open cuticle than thin or medium hair causing it to be the most porous.     Classification systems     The ": null
    },
    {
        "Andre Walker Hair Typing System": "andre walker hair typing system"
    },
    {
        " is the most widely used system to classify hair. The system was created by the hairstylist of ": null
    },
    {
        "Oprah Winfrey": "oprah winfrey"
    },
    {
        ", ": null
    },
    {
        "Andre Walker": "andre walker"
    },
    {
        ". According to this system there are four types of hair: straight, wavy, curly, kinky.     Type 1 is straight hair, which reflects the most sheen and also the most resilient hair of all of the hair types. It is hard to damage and immensely difficult to curl this hair texture. Because the ": null
    },
    {
        "sebum": "sebum"
    },
    {
        " easily spreads from the scalp to the ends without curls or kinks to interrupt its path, it is the most oily hair texture of all.   Type 2 is wavy hair, whose texture and sheen ranges somewhere between straight and curly hair. Wavy hair is also more likely to become ": null
    },
    {
        "frizz": "frizz"
    },
    {
        "y than straight hair. While type A waves can easily alternate between straight and curly styles, type B and C Wavy hair is resistant to styling.   Type 3 is ": null
    },
    {
        "curly hair": "curly hair"
    },
    {
        " known to have an S-shape. The curl pattern may resemble a lowercase s , uppercase S , or sometimes an uppercase Z or lowercase z .  This hair type is usually voluminous, climate dependent , and damage-prone.  Lack of proper care causes less defined curls.   Type 4 is ": null
    },
    {
        "kinky hair": "kinky hair"
    },
    {
        ", which features a tightly coiled curl pattern that is often fragile with a very high density. This type of hair shrinks when wet and because it has fewer cuticle layers than other hair types it is more susceptible to damage.          ;    This is a method which classifies the hair by curl pattern, hair-strand thickness and overall hair volume.            Many mammals have ": null
    },
    {
        "fur": "fur"
    },
    {
        " and other hairs that serve different functions. Hair provides thermal regulation and ": null
    },
    {
        "camouflage": "camouflage"
    },
    {
        " for many animals; for others it provides signals to other animals such as warnings, mating, or other communicative displays; and for some animals hair provides defensive functions and, rarely, even offensive protection. Hair also has a sensory function, extending the sense of touch beyond the surface of the skin. Guard hairs give warnings that may trigger a recoiling reaction.            While humans have developed clothing and other means of keeping warm, the hair found on the head serves primarily as a source of heat ": null
    },
    {
        "insulation": "thermal insulation"
    },
    {
        " and cooling as well as protection from ultra-violet radiation exposure. The function of hair in other locations is debated. Hats and coats are still required while doing outdoor activities in cold weather to prevent ": null
    },
    {
        "frostbite": "frostbite"
    },
    {
        " and ": null
    },
    {
        "hypothermia": "hypothermia"
    },
    {
        ", but the hair on the human body does help to keep the internal temperature regulated. When the body is too cold, the ": null
    },
    {
        "arrector pili": "arrector pili"
    },
    {
        " muscles found attached to hair follicles stand up, causing the hair in these follicles to do the same. These hairs then form a heat-trapping layer above the ": null
    },
    {
        "epidermis": "epidermis"
    },
    {
        ". This process is formally called ": null
    },
    {
        "piloerection": "piloerection"
    },
    {
        ", derived from the Latin words pilus and erectio , but is more commonly known as having ": null
    },
    {
        "goose bumps": "goose bumps"
    },
    {
        " in English.  This is more effective in other mammals whose fur fluffs up to create air pockets between hairs that insulate the body from the cold. The opposite actions occur when the body is too warm; the arrector muscles make the hair lie flat on the skin which allows heat to leave.       In some mammals, such as ": null
    },
    {
        "hedgehogs": "hedgehog"
    },
    {
        "and ": null
    },
    {
        "porcupine": "porcupine"
    },
    {
        "s, the hairs have been modified into hard spines or quills. These are covered with thick plates of keratin and serve as protection against predators. Thick hair such as that of the lions mane and grizzly bears fur do offer some protection from physical damages such as bites and scratches.       Displacement and vibration of hair shafts are detected by hair follicle nerve receptors and nerve receptors within the skin. Hairs can sense movements of air as well as touch by physical objects and they provide sensory awareness of the presence of ": null
    },
    {
        "ectoparasites": "ectoparasites"
    },
    {
        ".  Some hairs, such as eyelashes, are especially sensitive to the presence of potentially harmful matter.                The ": null
    },
    {
        "eyebrows": "eyebrow"
    },
    {
        "provide moderate protection to the ": null
    },
    {
        "eyes": "eye"
    },
    {
        "from ": null
    },
    {
        "dirt": "dirt"
    },
    {
        ", ": null
    },
    {
        "sweat": "sweat"
    },
    {
        " and ": null
    },
    {
        "rain": "rain"
    },
    {
        ". They also play a key role in non-verbal ": null
    },
    {
        "communication": "communication"
    },
    {
        " by displaying emotions such as sadness, anger, surprise and excitement. In many other mammals, they contain much longer, whisker-like hairs that act as tactile sensors.     The ": null
    },
    {
        "eyelash": "eyelash"
    },
    {
        " grows at the edges of the eyelid and protects the eye from dirt. The ": null
    },
    {
        "eyelash": "eyelash"
    },
    {
        " is to humans, camels, horses, ostriches etc., what ": null
    },
    {
        "whiskers": "whiskers"
    },
    {
        " are to ": null
    },
    {
        "cat": "cat"
    },
    {
        "s; they are used to sense when dirt, ": null
    },
    {
        "dust": "dust"
    },
    {
        ", or any other potentially harmful object is too close to the eye.  The eye reflexively closes as a result of this ": null
    },
    {
        "sensation": "sensation"
    },
    {
        ".       Hair has its origins in the common ancestor of mammals, the ": null
    },
    {
        "synapsid": "synapsid"
    },
    {
        "s, about 300 million years ago. It is currently unknown at what stage the synapsids acquired mammalian characteristics such as ": null
    },
    {
        "body hair": "body hair"
    },
    {
        " and ": null
    },
    {
        "mammary gland": "mammary gland"
    },
    {
        "s, as the ": null
    },
    {
        "fossils": "fossil"
    },
    {
        "only rarely provide direct evidence for soft tissues. Skin impression of the belly and lower tail of a ": null
    },
    {
        "pelycosaur": "pelycosaur"
    },
    {
        ", possibly  Haptodus  shows the basal synapsid stock bore transverse rows of rectangular ": null
    },
    {
        "scute": "scute"
    },
    {
        "s, similar to those of a modern ": null
    },
    {
        "crocodile": "crocodile"
    },
    {
        ".  An exceptionally well-preserved skull of  Estemmenosuchus , a ": null
    },
    {
        "therapsid": "therapsid"
    },
    {
        " from the ": null
    },
    {
        "Upper Permian": "upper permian"
    },
    {
        ", shows smooth, hairless skin with what appears to be glandular depressions, Kardong, K.V. : Vertebrates: Comparative anatomy, function, evolution. 3rd Edition. McGraw-Hill, New York though as a semi-aquatic species it might not have been particularly useful to determine the integument of terrestrial species. The oldest undisputed known fossils showing unambiguous imprints of hair are the ": null
    },
    {
        "Callovian": "callovian"
    },
    {
        "   Castorocauda  and several contemporary ": null
    },
    {
        "haramiyida": "haramiyida"
    },
    {
        "ns, both ": null
    },
    {
        "near-mammal": "mammaliformes"
    },
    {
        " cynodont": "cynodont"
    },
    {
        "s.  See also the news item at    More recently, studies on terminal ": null
    },
    {
        "Permian": "permian"
    },
    {
        " Russia": "russia"
    },
    {
        "n ": null
    },
    {
        "coprolites": "coprolites"
    },
    {
        " may suggest that non-mammalian synapsids from that era had fur.  If this is the case, these are the oldest hair remnants known, showcasing that fur occurred as far back as the latest ": null
    },
    {
        "Paleozoic": "paleozoic"
    },
    {
        ".     Some modern mammals have a special gland in front of each ": null
    },
    {
        "orbit": "orbit"
    },
    {
        " used to preen the fur, called the ": null
    },
    {
        "harderian gland": "harderian gland"
    },
    {
        ". Imprints of this structure are found in the skull of the small early mammals like  Morganucodon , but not in their ": null
    },
    {
        "cynodont": "cynodont"
    },
    {
        " ancestors like  Thrinaxodon .      The hairs of the fur in modern animals are all connected to nerves, and so the fur also serves as a transmitter for sensory input. Fur could have evolved from sensory hair . The signals from this sensory apparatus is interpreted in the ": null
    },
    {
        "neocortex": "neocortex"
    },
    {
        ", a chapter of the brain that expanded markedly in animals like Morganucodon and  Hadrocodium .  The more advanced therapsids could have had a combination of naked skin, ": null
    },
    {
        "whisker": "whisker"
    },
    {
        "s, and ": null
    },
    {
        "scute": "scute"
    },
    {
        "s. A full ": null
    },
    {
        "pelage": "pelage"
    },
    {
        " likely did not evolve until the therapsid-mammal transition.  The more advanced, smaller therapsids could have had a combination of hair and scutes, a combination still found in some modern mammals, such as ": null
    },
    {
        "rodents": "rodents"
    },
    {
        " and the ": null
    },
    {
        "opossum": "opossum"
    },
    {
        ".      The high interspecific variability of the size, color, and microstructure of hair often enables the identification of species based on single hair filaments.                 In varying degrees most ": null
    },
    {
        "mammals": "mammal"
    },
    {
        "have some skin areas without natural hair. On the human body, glabrous ": null
    },
    {
        "skin": "human skin"
    },
    {
        " is found on the ": null
    },
    {
        "ventral": "ventral"
    },
    {
        " portion of the ": null
    },
    {
        "finger": "finger"
    },
    {
        "s, ": null
    },
    {
        "palms": "hand"
    },
    {
        ", ": null
    },
    {
        "soles of feet": "sole"
    },
    {
        " and ": null
    },
    {
        "lips": "lips"
    },
    {
        ", which are all parts of the body most closely associated with interacting with the world around us,  as are the ": null
    },
    {
        "labia minora": "labia minora"
    },
    {
        " and ": null
    },
    {
        "glans penis": "glans penis"
    },
    {
        ".  There are four main types of ": null
    },
    {
        "mechanoreceptors": "mechanoreceptor"
    },
    {
        "in the glabrous skin of humans: ": null
    },
    {
        "Pacinian corpuscles": "lamellar corpuscle"
    },
    {
        ", ": null
    },
    {
        "Meissners corpuscles": "tactile corpuscle"
    },
    {
        ", ": null
    },
    {
        "Merkels discs": "merkel nerve ending"
    },
    {
        ", and ": null
    },
    {
        "Ruffini corpuscles": "bulbous corpuscle"
    },
    {
        ".     The ": null
    },
    {
        "naked mole-rat": "naked mole-rat"
    },
    {
        "  has evolved skin lacking in general, pelagic hair covering, yet has retained long, very sparsely scattered tactile hairs over its body. Glabrousness is a trait that may be associated with ": null
    },
    {
        "neoteny": "neoteny"
    },
    {
        ".             The general hairlessness of humans in comparison to related species may be due to loss of functionality in the pseudogene KRTHAP1 in the human lineage about 240,000 years ago.  On an individual basis, mutations in the gene HR can lead to complete hair loss, though this is not typical in humans.  Humans may also lose their hair as a result of hormonal imbalance due to drugs or pregnancy.      In order to comprehend why humans are essentially hairless, it is essential to understand that mammalian body hair is not merely an aesthetic characteristic; it protects the skin from wounds, bites, heat, cold, and UV radiation.  Additionally, it can be used as a communication tool and as a camouflage.  To this end, it can be concluded that benefits stemming from the loss of human body hair must be great enough to outweigh the loss of these protective functions by nakedness.     Humans are the only primate species that have undergone significant hair loss and of the approximately 5000 extant species of mammal, only a handful are effectively hairless. This list includes elephants, rhinoceroses, hippopotamuses, walruses, some species of ": null
    },
    {
        "pig": "pig"
    },
    {
        "s, whales and other ": null
    },
    {
        "cetaceans": "cetaceans"
    },
    {
        ", and naked mole rats. Most mammals have light skin that is covered by fur, and biologists believe that early human ancestors started out this way also. Dark skin probably evolved after humans lost their body fur, because the naked skin was vulnerable to the strong ": null
    },
    {
        "UV radiation": "uv radiation"
    },
    {
        " as explained in the ": null
    },
    {
        "Out of Africa hypothesis": "out of africa hypothesis"
    },
    {
        ". Therefore, evidence of the time when human skin darkened has been used to date the loss of human body hair, assuming that the dark skin was needed after the fur was gone.   It was expected that dating the split of the ancestral human louse into two species, the ": null
    },
    {
        "head louse": "head louse"
    },
    {
        " and the ": null
    },
    {
        "pubic louse": "pubic louse"
    },
    {
        ", would date the loss of body hair in human ancestors. However, it turned out that the human pubic louse does not descend from the ancestral human louse, but from the ": null
    },
    {
        "gorilla louse": "gorilla louse"
    },
    {
        ", diverging 3.3 million years ago. This suggests that humans had lost body hair and developed thick pubic hair prior to this date, were living in or close to the forest where gorillas lived, and acquired pubic lice from butchering gorillas or sleeping in their nests.     The evolution of the ": null
    },
    {
        "body louse": "body louse"
    },
    {
        " from the head louse, on the other hand, places the date of clothing much later, some 100,000 years ago.          The sweat glands in humans could have evolved to spread from the hands and feet as the body hair changed, or the hair change could have occurred to facilitate sweating. ": null
    },
    {
        "Horses": "horse"
    },
    {
        "and humans are two of the few animals capable of sweating on most of their body, yet horses are larger and still have fully developed fur. In humans, the skin hairs lie flat in hot conditions, as the arrector pili muscles relax, preventing heat from being trapped by a layer of still air between the hairs, and increasing heat loss by ": null
    },
    {
        "convection": "convection"
    },
    {
        ".     Another hypothesis for the thick ": null
    },
    {
        "body hair": "body hair"
    },
    {
        " on humans proposes that ": null
    },
    {
        "Fisherian runaway": "fisherian runaway"
    },
    {
        " sexual selection": "sexual selection"
    },
    {
        " played a role , , as well as a much larger role of testosterone in men. Sexual selection is the only theory thus far that explains the ": null
    },
    {
        "sexual dimorphism": "sexual dimorphism"
    },
    {
        " seen in the hair patterns of men and women. On average, men have more ": null
    },
    {
        "body hair": "androgenic hair"
    },
    {
        " than women. Males have more ": null
    },
    {
        "terminal hair": "terminal hair"
    },
    {
        ", especially on the ": null
    },
    {
        "face": "facial hair"
    },
    {
        ", ": null
    },
    {
        "chest": "chest hair"
    },
    {
        ", ": null
    },
    {
        "abdomen": "abdominal hair"
    },
    {
        ", and back, and females have more ": null
    },
    {
        "vellus hair": "vellus hair"
    },
    {
        ", which is less visible. The halting of hair development at a juvenile stage, vellus hair, would also be consistent with the ": null
    },
    {
        "neoteny": "neoteny"
    },
    {
        " evident in humans, especially in females, and thus they could have occurred at the same time. Dixson, A.F.  . Oxford University Press, USA; 1 edition  This theory, however, has significant holdings in todays cultural norms. There is no evidence that sexual selection would proceed to such a drastic extent over a million years ago when a full, lush coat of hair would most likely indicate health and would therefore be more likely to be selected for, not against, and not all human populations today have sexual dimorphism in body hair.     A further hypothesis is that human hair was reduced in response to ": null
    },
    {
        "ectoparasites": "ectoparasites"
    },
    {
        ".   The ectoparasite explanation of modern human nakedness is based on the principle that a hairless primate would harbor fewer parasites. When our ancestors adopted group-dwelling social arrangements roughly 1.8 mya, ectoparasite loads increased dramatically. Early humans became the only one of the 193 primate species to have ": null
    },
    {
        "fleas": "fleas"
    },
    {
        ", which can be attributed to the close living arrangements of large groups of individuals. While primate species have communal sleeping arrangements, these groups are always on the move and thus are less likely to harbor ectoparasites. Because of this, selection pressure for early humans would favor decreasing body hair because those with thick coats would have more lethal-disease-carrying ectoparasites and would thereby have lower fitness.     Another view is proposed by ": null
    },
    {
        "James Giles": "james giles"
    },
    {
        ", who attempts to explain hairlessness as evolved from the relationship between mother and child, and as a consequence of ": null
    },
    {
        "bipedalism": "bipedalism"
    },
    {
        ". Giles also connects romantic love to hairlessness.      Another hypothesis is that humans use of fire caused or initiated the reduction in human hair.        Evolutionary biologists suggest that the genus  Homo  arose in ": null
    },
    {
        "East Africa": "east africa"
    },
    {
        " approximately 2.5 million years ago.  They devised new hunting techniques. The higher protein diet led to the evolution of larger body and brain sizes. Jablonski postulates that increasing body size, in conjunction with intensified hunting during the day at the equator, gave rise to a greater need to rapidly expel heat. As a result, humans evolved the ability to sweat: a process which was facilitated by the loss of body hair.     Another factor in human evolution that also occurred in the prehistoric past was a preferential selection for ": null
    },
    {
        "neoteny": "neoteny"
    },
    {
        ", particularly in females. The idea that adult humans exhibit certain neotenous features, not evinced in the great apes, is about a century old. ": null
    },
    {
        "Louis Bolk": "louis bolk"
    },
    {
        " made a long list of such traits,  and ": null
    },
    {
        "Stephen Jay Gould": "stephen jay gould"
    },
    {
        " published a short list in  Ontogeny and Phylogeny . short-list of 25 characters reprinted in Gould, Stephen Jay .  Ontogeny and phylogeny . Harvard University Press. p. 357. . In addition, ": null
    },
    {
        "paedomorphic": "paedomorphic"
    },
    {
        " characteristics in women are often ": null
    },
    {
        "acknowledged as desirable by men": "physical attractivenessdeterminants of female physical attractiveness"
    },
    {
        " in ": null
    },
    {
        "developed countries": "psychologycontemporary issues in methodology and practice"
    },
    {
        ".  For instance, ": null
    },
    {
        "vellus hair": "vellus hair"
    },
    {
        " is a juvenile characteristic. However, while men develop longer, coarser, thicker, and darker ": null
    },
    {
        "terminal hair": "terminal hair"
    },
    {
        " through ": null
    },
    {
        "sexual differentiation": "sexual differentiation"
    },
    {
        ", women do not, leaving their vellus hair visible.                          Jablonski asserts head hair was evolutionarily advantageous for pre-humans to retain because it protected the scalp as they walked upright in the intense African ": null
    },
    {
        "UV light": "uv light"
    },
    {
        ". While some might argue that, by this logic, humans should also express hairy shoulders because these body parts would putatively be exposed to similar conditions, the protection of the head, the seat of the brain that enabled humanity to become one of the most successful species on the planet was arguably a more urgent issue . Sometime during the gradual process by which Homo erectus began a transition from furry skin to the naked skin expressed by Homo sapiens, hair texture putatively gradually changed from straight hair to ": null
    },
    {
        "Afro-textured hair": "afro-textured hair"
    },
    {
        " or kinky . This argument assumes that curly hair better impedes the passage of UV light into the body relative to straight hair .     It is substantiated by Iyengars findings that UV light can enter into straight human hair roots via the hair shaft. Specifically, the results of that study suggest that this phenomenon resembles the passage of light through fiber optic tubes . In this sense, when hominids were gradually losing their straight body hair and thereby exposing the initially pale skin underneath their fur to the sun, straight hair would have been an adaptive liability. By inverse logic, later, as humans traveled farther from Africa and/or the equator, straight hair may have evolved to aid the entry of UV light into the body during the transition from dark, UV-protected skin to paler skin.     Some  conversely believe that tightly coiled hair that grows into a typical Afro-like formation would have greatly reduced the ability of the head and brain to cool because although African peoples hair is much less dense than its European counterparts, in the intense sun the effective woolly hat that such hair produced would have been a disadvantage. However, such anthropologists as ": null
    },
    {
        "Nina Jablonski": "nina jablonski"
    },
    {
        " oppositely argue about this hair texture. Specifically, Jablonskis assertions suggest that the adjective woolly in reference to Afro-hair is a ": null
    },
    {
        "misnomer": "misnomer"
    },
    {
        " in connoting the high heat insulation derivable from the true wool of sheep. Instead, the relatively sparse density of Afro-hair, combined with its springy coils actually results in an airy, almost sponge-like structure that in turn, Jablonski argues, more likely facilitates an increase in the circulation of cool air onto the scalp. Further, wet Afro-hair does not stick to the neck and scalp unless totally drenched and instead tends to retain its basic springy puffiness because it less easily responds to moisture and sweat than straight hair does. In this sense, the trait may enhance comfort levels in intense equatorial climates more than straight hair .     Furthermore, some  interpret the ideas of ": null
    },
    {
        "Charles Darwin": "charles darwin"
    },
    {
        " as suggesting that some traits, such as hair texture, were so arbitrary to human survival that the role natural selection played was trivial. Hence, they argue in favor of his suggestion that sexual selection may be responsible for such traits. However, inclinations towards deeming hair texture adaptively trivial may root in certain cultural value judgments more than objective logic. In this sense the possibility that hair texture may have played an adaptively significant role cannot be completely eliminated from consideration. In fact, while the sexual selection hypothesis cannot be ruled out, the asymmetrical distribution of this trait vouches for environmental influence. Specifically, if hair texture were simply the result of adaptively arbitrary human aesthetic preferences, one would expect that the global distribution of the various hair textures would be fairly random. Instead, the distribution of Afro-hair is strongly skewed toward the equator.     Further, it is notable that the most pervasive expression of this hair texture can be found in sub-Saharan Africa; a region of the world that abundant genetic and paleo-anthropological evidence suggests, was the relatively recent point of origin for modern humanity. In fact, although genetic findings suggest that sub-Saharan Africans are the most genetically diverse continental group on Earth, ": null
    },
    {
        "Afro-textured hair": "afro-textured hair"
    },
    {
        " approaches ubiquity in this region. This points to a strong, long-term selective pressure that, in stark contrast to most other regions of the genomes of sub-Saharan groups, left little room for genetic variation at the determining loci. Such a pattern, again, does not seem to support human sexual aesthetics as being the sole or primary cause of this distribution.            A group of studies have recently shown that genetic patterns at the EDAR locus, a region of the modern human genome that contributes to hair texture variation among most individuals of East Asian descent, support the hypothesis that straight hair likely developed in this branch of the modern human lineage subsequent to the original expression of tightly coiled ": null
    },
    {
        "natural afro-hair": "natural afro-hair"
    },
    {
        ".    Specifically, the relevant findings indicate that the EDAR mutation coding for the predominant East Asian coarse or thick, straight hair texture arose within the past ≈65,000 years, which is a time frame that covers from the earliest of the Out of Africa migrations up to now.          ": null
    },
    {
        "Ringworm": "tinea corporis"
    },
    {
        " is a ": null
    },
    {
        "fungal disease": "mycosis"
    },
    {
        " that targets hairy skin.      ": null
    },
    {
        "Premature greying of hair": "premature greying of hair"
    },
    {
        " is another condition that results in greying before the age of 20 years in Whites, before 25 years in Asians, and before 30 years in Africans.           Hair care involves the ": null
    },
    {
        "hygiene": "hygiene"
    },
    {
        " and ": null
    },
    {
        "cosmetology": "cosmetology"
    },
    {
        " of hair including hair on the ": null
    },
    {
        "scalp": "scalp"
    },
    {
        ", facial hair , ": null
    },
    {
        "pubic hair": "pubic hair"
    },
    {
        " and other body hair. Hair care routines differ according to an individuals culture and the physical characteristics of ones hair. Hair may be colored, trimmed, shaved, plucked, or otherwise removed with treatments such as waxing, sugaring, and threading.       ": null
    },
    {
        "Depilation": "depilation"
    },
    {
        " is the removal of hair from the surface of the skin. This can be achieved through methods such as ": null
    },
    {
        "shaving": "shaving"
    },
    {
        ". ": null
    },
    {
        "Epilation": "epilation"
    },
    {
        " is the removal of the entire hair strand, including the part of the hair that has not yet left the follicle. A popular way to epilate hair is through ": null
    },
    {
        "waxing": "waxing"
    },
    {
        ".          ": null
    },
    {
        "Shaving": "shaving"
    },
    {
        " is accomplished with bladed instruments, such as ": null
    },
    {
        "razors": "razors"
    },
    {
        ". The ": null
    },
    {
        "blade": "blade"
    },
    {
        " is brought close to the skin and stroked over the hair in the desired area to cut the terminal hairs and leave the skin feeling smooth. Depending upon the rate of growth, one can begin to feel the hair growing back within hours of shaving. This is especially evident in men who develop a ": null
    },
    {
        "five oclock shadow": "five oclock shadow"
    },
    {
        " after having shaved their faces. This new growth is called ": null
    },
    {
        "stubble": "shaving"
    },
    {
        ". Stubble typically appears to grow back thicker because the shaved hairs are blunted instead of tapered off at the end, although the hair never actually grows back thicker.       ": null
    },
    {
        "Waxing": "waxing"
    },
    {
        " involves using a sticky wax and strip of paper or cloth to pull hair from the root. Waxing is the ideal hair removal technique to keep an area hair-free for long periods of time. It can take three to five weeks for waxed hair to begin to resurface again. Hair in areas that have been waxed consistently is known to grow back finer and thinner, especially compared to hair that has been shaved with a razor.            Laser hair removal is a cosmetic method where a small ": null
    },
    {
        "laser": "laser"
    },
    {
        " beam pulses selective heat on dark target matter in the area that causes hair growth without harming the skin tissue. This process is repeated several times over the course of many months to a couple of years with hair regrowing less frequently until it finally stops; this is used as a more permanent solution to ": null
    },
    {
        "waxing": "waxing"
    },
    {
        " or ": null
    },
    {
        "shaving": "shaving"
    },
    {
        ". Laser removal is practiced in many clinics along with many at-home products.            Because the hair on ones head is normally longer than other types of body hair, it is cut with ": null
    },
    {
        "scissors": "scissors"
    },
    {
        " or ": null
    },
    {
        "clippers": "manual hair clippers"
    },
    {
        ". People with longer hair will most often use scissors to cut their hair, whereas shorter hair is maintained using a trimmer. Depending on the desired length and overall health of the hair, periods without cutting or trimming the hair can vary.     Cut hair may be used in ": null
    },
    {
        "wig": "wig"
    },
    {
        "s. Global imports of hair in 2010 was worth $US 1.24 billion.              Hair has great social significance for ": null
    },
    {
        "human being": "human being"
    },
    {
        "s.     It can grow on most external areas of the ": null
    },
    {
        "human body": "human body"
    },
    {
        ", except on the palms of the ": null
    },
    {
        "hands": "hand"
    },
    {
        "and the soles of the feet . Hair is most noticeable on most people in a small number of areas, which are also the ones that are most commonly trimmed, ": null
    },
    {
        "plucked": "plucking"
    },
    {
        ", or ": null
    },
    {
        "shaved": "shaving"
    },
    {
        ". These include the ": null
    },
    {
        "face": "face"
    },
    {
        ", ": null
    },
    {
        "ear": "ear"
    },
    {
        "s, ": null
    },
    {
        "head": "human head"
    },
    {
        ", eyebrows, ": null
    },
    {
        "leg": "human leg"
    },
    {
        "s, and ": null
    },
    {
        "armpit": "armpit"
    },
    {
        "s, as well as the ": null
    },
    {
        "pubic region": "pubic region"
    },
    {
        ". The highly visible differences between male and female body and facial hair are a notable ": null
    },
    {
        "secondary sex characteristic": "secondary sex characteristic"
    },
    {
        ".     The worlds longest documented hair belongs to Xie Qiuping , at 5.627 m when measured on 8 May 2004. She has been growing her hair since 1973, from the age of 13.        Healthy hair indicates health and youth . Hair color and texture can be a sign of ethnic ancestry. ": null
    },
    {
        "Facial hair": "facial hair"
    },
    {
        " is a sign of ": null
    },
    {
        "puberty": "puberty"
    },
    {
        " in men. White hair is a sign of age or genetics, which may be concealed with ": null
    },
    {
        "hair dye": "hair coloring"
    },
    {
        " , although many prefer to assume it . Male pattern ": null
    },
    {
        "baldness": "baldness"
    },
    {
        " is a sign of age, which may be concealed with a ": null
    },
    {
        "toupee": "toupee"
    },
    {
        ", hats, or religious and cultural adornments. Although drugs and medical procedures exist for the treatment of baldness, many balding men simply shave their heads. In early modern China, the queue was a male hairstyle worn by the Manchus from central Manchuria and the Han Chinese during the Qing dynasty; hair on the front of the head was shaved off above the temples every ten days, mimicking male-pattern baldness, and the rest of the hair braided into a long pigtail.     ": null
    },
    {
        "Hairstyle": "hairstyle"
    },
    {
        " may be an indicator of group membership. During the ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        ", the followers of ": null
    },
    {
        "Oliver Cromwell": "oliver cromwell"
    },
    {
        " decided to crop their hair close to their head, as an act of defiance to the curls and ringlets of the kings men. Olmert, Michael . Miltons Teeth and Ovids Umbrella: Curiouser & Curiouser Adventures in History, p. 53. Simon & Schuster, New York.  This led to the Parliamentary faction being nicknamed ": null
    },
    {
        "Roundhead": "roundhead"
    },
    {
        "s. Recent isotopic analysis of hair is helping to shed further light on sociocultural interaction, giving information on food procurement and consumption in the 19th century   .  Having ": null
    },
    {
        "bobbed hair": "bob cut"
    },
    {
        " was popular among the ": null
    },
    {
        "flappers": "flapper"
    },
    {
        "in the 1920s as a sign of rebellion against traditional roles for women. Female art students known as the cropheads also adopted the style, notably at the Slade School in London, England. Regional variations in ": null
    },
    {
        "hirsutism": "hirsutism"
    },
    {
        " cause practices regarding hair on the arms and legs to differ. Some religious groups may follow certain rules regarding hair as part of religious observance. The rules often differ for men and women.     Many subcultures have hairstyles which may indicate an unofficial membership. Many ": null
    },
    {
        "hippie": "hippie"
    },
    {
        "s, ": null
    },
    {
        "metalheads": "heavy metal subculture"
    },
    {
        " and Indian ": null
    },
    {
        "sadhus": "sadhus"
    },
    {
        " have ": null
    },
    {
        "long hair": "long hair"
    },
    {
        ", as well many older ": null
    },
    {
        "indie kids": "hipster"
    },
    {
        ". Many ": null
    },
    {
        "punks": "punk fashion"
    },
    {
        " wear a hairstyle known as a ": null
    },
    {
        "mohawk": "mohawk hairstyle"
    },
    {
        " or other spiked and dyed hairstyles; ": null
    },
    {
        "skinheads": "skinhead"
    },
    {
        "have short-cropped or completely shaved heads. Long stylized bangs were very common for ": null
    },
    {
        "emo": "emo"
    },
    {
        "s, ": null
    },
    {
        "scene kids": "scene"
    },
    {
        " and younger ": null
    },
    {
        "indie kids": "hipster"
    },
    {
        " in the 2000s and early 2010s, among people of both ": null
    },
    {
        "gender": "gender"
    },
    {
        "s.     Heads were shaved in ": null
    },
    {
        "concentration camp": "concentration camp"
    },
    {
        "s, and head-shaving has been used as ": null
    },
    {
        "punishment": "punishment"
    },
    {
        ", especially for women with long hair. The shaven head is common in ": null
    },
    {
        "military": "military"
    },
    {
        " haircuts, while Western monks are known for the ": null
    },
    {
        "tonsure": "tonsure"
    },
    {
        ". By contrast, among some Indian holy men, the hair is worn extremely long.     In the time of Confucius , the Chinese grew out their hair and often tied it, as a symbol of filial piety.     Regular hairdressing in some cultures is considered a sign of wealth or status. The ": null
    },
    {
        "dreadlocks": "dreadlocks"
    },
    {
        " of the ": null
    },
    {
        "Rastafari movement": "rastafari movement"
    },
    {
        " were despised early in the movements history. In some cultures, having ones hair cut can symbolize a liberation from ones past, usually after a trying time in ones life. Cutting the hair also may be a sign of mourning.     Tightly coiled hair in its natural state may be worn in an ": null
    },
    {
        "Afro": "afro"
    },
    {
        ". This hairstyle was once worn among ": null
    },
    {
        "African Americans": "african american"
    },
    {
        "as a symbol of racial pride. Given that the coiled texture is the natural state of some African Americans hair, or perceived as being more African , this simple style is now often seen as a sign of self-acceptance and an affirmation that the beauty norms of the  dominant culture are not absolute. It is important to note that African Americans as a whole have a variety of hair textures, as they are not an ethnically homogeneous group, but an ad-hoc of different racial admixtures.     The film  Easy Rider  includes the assumption that the two main characters could have their long hairs forcibly shaved with a rusty razor when jailed, symbolizing the intolerance of some conservative groups toward members of the ": null
    },
    {
        "counterculture": "counterculture"
    },
    {
        ". At the conclusion of the ": null
    },
    {
        "Oz obscenity trials in the UK in 1971": "oz trial"
    },
    {
        ", the defendants had their heads shaved by the police, causing public outcry. During the appeal trial, they appeared in the dock wearing wigs. ": null
    },
    {
        "Green, Jonathon": "jonathon green"
    },
    {
        ", . All Dressed Up: The Sixties and the Counterculture. London: Pimlico. . A case where a 14-year-old student was expelled from school in ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " in the mid-2000s, allegedly because of his ": null
    },
    {
        "fauxhawk": "fauxhawk"
    },
    {
        " haircut, sparked national debate and legal action resulting in compensation.         Womens hair may be hidden using ": null
    },
    {
        "headscarves": "headscarf"
    },
    {
        ", a common part of the  hijab  in ": null
    },
    {
        "Islam": "islam"
    },
    {
        " and a symbol of modesty required for certain religious rituals in ": null
    },
    {
        "Eastern Orthodoxy": "eastern orthodox church"
    },
    {
        ". ": null
    },
    {
        "Russian Orthodox Church": "russian orthodox church"
    },
    {
        " requires all married women to wear headscarves inside the church; this tradition is often extended to all women, regardless of marital status. ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        " also commands the use of scarves and other head coverings for married women for modesty reasons. Certain ": null
    },
    {
        "Hindu": "hindu"
    },
    {
        " sects also wear head scarves for religious reasons. ": null
    },
    {
        "Sikhs": "sikhism"
    },
    {
        " have an obligation not to cut hair Dilgeer, Harjinder Singh Dictionary of Sikh Philosophy, Sikh University Press. and men keep it tied in a bun on the head, which is then covered appropriately using a ": null
    },
    {
        "turban": "turban"
    },
    {
        ". Multiple religions, both ancient and contemporary, require or advise one to allow their hair to become ": null
    },
    {
        "dreadlocks": "dreadlocks"
    },
    {
        ", though people also wear them for fashion. For men, Islam, Orthodox Judaism, Orthodox Christianity, Roman Catholicism, and other religious groups have at various times recommended or required the covering of the head and sections of the hair of men, and some have dictates relating to the cutting of mens facial and head hair. Some Christian sects throughout history and up to modern times have also religiously proscribed the cutting of womens hair. For some ": null
    },
    {
        "Sunni": "sunni"
    },
    {
        " madhab": "madhab"
    },
    {
        "s, the donning of a ": null
    },
    {
        "kufi": "kufi"
    },
    {
        " or ": null
    },
    {
        "topi": "taqiyah"
    },
    {
        " is a form of ": null
    },
    {
        "sunnah": "sunnah"
    }
]