[
    {
        "                 In ": null
    },
    {
        "music": "music"
    },
    {
        ", a half note or minim is a ": null
    },
    {
        "note": "musical note"
    },
    {
        " played for half the duration of a ": null
    },
    {
        "whole note": "whole note"
    },
    {
        "  and twice the duration of a ": null
    },
    {
        "quarter note": "quarter note"
    },
    {
        " . It was given its Latin name  because it was the shortest of the five note values used in ": null
    },
    {
        "early medieval music notation": "mensural notation"
    },
    {
        " . In ": null
    },
    {
        "time signature": "time signature"
    },
    {
        "s with 42 as the bottom number, such as  or , the half note is two ": null
    },
    {
        "beats": "beat"
    },
    {
        " long. However, when 42 is the bottom number , the half note is one beat long.     Half notes are notated with a hollow oval ": null
    },
    {
        "notehead": "notehead"
    },
    {
        " like a whole note and straight ": null
    },
    {
        "note stem": "note stem"
    },
    {
        " with no ": null
    },
    {
        "flags": "flag"
    },
    {
        " like a quarter note . The half rest  denotes a silence of the same duration. Half ": null
    },
    {
        "rests": "rest"
    },
    {
        " are drawn as filled-in rectangles sitting on top of the middle line of the ": null
    },
    {
        "musical staff": "musical staff"
    },
    {
        ", although in ": null
    },
    {
        "polyphonic": "polyphonic"
    },
    {
        " music the rest may need to be moved to a different line or even a ": null
    },
    {
        "ledger line": "ledger line"
    },
    {
        ". As with all notes with stems, half notes are drawn with stems to the right of the notehead facing up when they are below the middle line of the staff . When they are on or above the middle line , they are drawn with stems on the left of the notehead facing down.     The American term half note is a 42th-century ": null
    },
    {
        "loan translation": "loan translation"
    },
    {
        " of German halbe Note.     The Catalan, French, and Spanish names derive from the fact that the minima was the shortest unfilled note in mensural white notation, which is true of the modern form as well. The form in the earlier black notation resembles the modern quarter note . The Greek, Chinese, Japanese, and Korean names mean half , and in Greek, the modern word  and older ": null
    }
]