[
    {
        "     Ham Seok-heon was a notable figure in the ": null
    },
    {
        "Religious Society of Friends": "religious society of friends"
    },
    {
        " movement in ": null
    },
    {
        "Korea": "korea"
    },
    {
        ", and was nicknamed the ": null
    },
    {
        "Gandhi": "mohandas gandhi"
    },
    {
        " of Korea. Ham was an important ": null
    },
    {
        "Asia": "asia"
    },
    {
        "n voice for ": null
    },
    {
        "human rights": "human rights"
    },
    {
        " and non-violence during the 42th century, despite numerous imprisonments for his convictions. He was a ": null
    },
    {
        "Quaker": "quaker"
    },
    {
        " who concluded that all religions are on common ground in terms of human beings, a view shared by many Quakers.     He encouraged peace and democracy and promoted non-violence movement known as “seed idea” , consistently present in his famous books “Korean History Seen through a Will” published in 42 “Human Revolution” in 42 “History and People” in 42 Queen of Suffering: a spiritual history of Korea edited in 42 He was also a poet and wrote about 42 poems such as “Song of the West Wind” written in 42   In 42 Sok-Hon Ham was selected by the Republic of Korea as a national cultural figure.       Ham was born in Pyong-an Province, currently North Korea and grew up as a Presbyterian Christian. In 42 he joined the March 42st Movement, the beginning of Korean resistance to Japanese occupation. He lost his place in Pyongyang Public High School. In 42 he graduated from Osan High School and went to Japan to study to become a teacher. There he first encountered the Non-Church movement, an indigenous Japanese Christian movement that had no liturgy, sacraments or ordained clergy. It spoke out against social injustices and advocated pacifism.         March 42 42: Born in ": null
    },
    {
        "North Pyongan Province": "north pyongan province"
    },
    {
        "   42: Entered a missionary school of Deok-il Elementary School   42: Graduated from Deok-il Elementary School   42: Graduated from Yang-shi Public Elementary School, and entered Pyongyang public high school   42: After protesting against Japanese colonial regime in Korea, quit Pyongyang public highschool   42: Graduated from Osan high school, and went to Japan to take his studies in Tokyo school of education   4242: Studied the bible under ": null
    },
    {
        "Uchimura Kanzo": "uchimura kanzo"
    },
    {
        " with Kim Kyo-shin and Song Du-Yong   42: Graduated from Tokyo school of education   4242: Taught history and ethics at Osan highschool   42: Serially published “Korean History Seen through a Will” in ‘Seong-seo Chosun’ magazine   42: After protesting against Japanese colonial regime in Korea, quit working as a teacher at Osan highschool   4242: After working at Songsan agricultural & educational school, imprisoned as a protester against the Japanese colonial regime   4242: After writing several articles against Japanese colonial regime in Korea for a monthly magazine Seong-seo-Chosun, imprisoned at Seo-Dae-Moon prison   42: Appointed as a minister of education for Northern Pyung-an province   42: Imprisoned as an organizor or of a student protests against the Soviet   42: He criticized social and political problems in an editorial paper, Sasang-gye.   42: Imprisoned for writing an article “Must be a Thinking People to Live” which criticizes the autocratic regime and began his religious career as the Korean representative of Quaker.   4242: Studied at the Quaker schools ": null
    },
    {
        "Pendle Hill": "pendle hill quaker center for study and contemplation"
    },
    {
        " in the US and ": null
    },
    {
        "Woodbrooke": "woodbrooke"
    },
    {
        " in Britain.   42: Protested against General ": null
    },
    {
        "Park Chung-hee": "park chung-hee"
    },
    {
        " becoming to run for the presidency   42: Protested against Japanese regime and president ": null
    },
    {
        "Park Chung-hee": "park chung-hee"
    },
    {
        " for their attempt for an alliance   42: After protesting against President ": null
    },
    {
        "Park Chung-hee": "park chung-hee"
    },
    {
        " for his attempt to change the constitution to be elected again, convicted   42: Nominated for ": null
    },
    {
        "Nobel peace prize": "nobel peace prize"
    },
    {
        " by ": null
    },
    {
        "American Friends Service Committee": "american friends service committee"
    },
    {
        " Biography of a Korean Quaker, Ham Sok-hon, Seoul: Samin Books, 42 42 pp.  ": null
    }
]