[
    {
        "                    The Tragedy of Hamlet, Prince of Denmark, often shortened to Hamlet , is a ": null
    },
    {
        "tragedy": "shakespearean tragedy"
    },
    {
        " written by ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        " sometime between 42 and 42 Set in ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", the ": null
    },
    {
        "play": "play"
    },
    {
        " depicts ": null
    },
    {
        "Prince Hamlet": "prince hamlet"
    },
    {
        " and his ": null
    },
    {
        "revenge": "revenge"
    },
    {
        " against his uncle, ": null
    },
    {
        "Claudius": "king claudius"
    },
    {
        ", who has murdered ": null
    },
    {
        "Hamlets father": "king hamlet"
    },
    {
        " in order to seize his throne and marry Hamlets mother.     Hamlet is Shakespeares longest play and is considered among the most powerful and influential works of world literature, with a story capable of seemingly endless retelling and adaptation by others . It was one of Shakespeares most popular works during his lifetime and still ranks among his most performed, topping the performance list of the ": null
    },
    {
        "Royal Shakespeare Company": "royal shakespeare company"
    },
    {
        " and its predecessors in ": null
    },
    {
        "Stratford-upon-Avon": "stratford-upon-avon"
    },
    {
        " since 42 It has inspired many other writers—from ": null
    },
    {
        "Johann Wolfgang von Goethe": "johann wolfgang von goethe"
    },
    {
        " and ": null
    },
    {
        "Charles Dickens": "charles dickens"
    },
    {
        " to ": null
    },
    {
        "James Joyce": "james joyce"
    },
    {
        " and ": null
    },
    {
        "Iris Murdoch": "iris murdoch"
    },
    {
        "—and has been described as the worlds most filmed story after  Cinderella  .     The story of Shakespeares Hamlet was derived from the legend of ": null
    },
    {
        "Amleth": "amleth"
    },
    {
        ", preserved by 42th-century chronicler ": null
    },
    {
        "Saxo Grammaticus": "saxo grammaticus"
    },
    {
        " in his  Gesta Danorum , as subsequently retold by the 42th-century scholar ": null
    },
    {
        "François de Belleforest": "françois de belleforest"
    },
    {
        ". Shakespeare may also have drawn on an earlier ": null
    },
    {
        "Elizabethan": "elizabethan era"
    },
    {
        " play known today as the  Ur-Hamlet , though some scholars believe Shakespeare wrote the Ur-Hamlet, later revising it to create the version of Hamlet we now have. He almost certainly wrote his version of the title role for his fellow actor, ": null
    },
    {
        "Richard Burbage": "richard burbage"
    },
    {
        ", the leading tragedian of Shakespeares time. In the 42 years since its inception, the role has been performed by numerous highly acclaimed actors in each successive century.     Three different early versions of the play are extant: the ": null
    },
    {
        "First Quarto": "hamlet q1"
    },
    {
        " ; the Second ": null
    },
    {
        "Quarto": "quarto"
    },
    {
        " ; and the ": null
    },
    {
        "First Folio": "first folio"
    },
    {
        " . Each version includes lines and entire scenes missing from the others. The plays structure and depth of characterisation have inspired much critical scrutiny. One such example is the centuries-old debate about Hamlets hesitation to kill his uncle, which some see as merely a plot device to prolong the action but which others argue is a dramatisation of the complex philosophical and ethical issues that surround cold-blooded murder, calculated revenge, and thwarted desire. More recently, ": null
    },
    {
        "psychoanalytic critics": "psychoanalytic literary criticism"
    },
    {
        " have examined Hamlets unconscious desires, while ": null
    },
    {
        "feminist critics": "feminist literary criticism"
    },
    {
        " have re-evaluated and attempted to rehabilitate the often-maligned characters of ": null
    },
    {
        "Ophelia": "ophelia"
    },
    {
        " and ": null
    },
    {
        "Gertrude": "gertrude"
    },
    {
        ".             ": null
    },
    {
        "Hamlet": "prince hamlet"
    },
    {
        "son of the late king and nephew of the present king, Claudius   ": null
    },
    {
        "Claudius": "king claudius"
    },
    {
        "king of Denmark, Hamlets uncle and brother to the former king   ": null
    },
    {
        "Gertrude": "gertrude"
    },
    {
        "queen of Denmark and Hamlets mother   ": null
    },
    {
        "Polonius": "polonius"
    },
    {
        "chief counsellor to the king   ": null
    },
    {
        "Ophelia": "ophelia"
    },
    {
        "Poloniuss daughter   ": null
    },
    {
        "Horatio": "horatio"
    },
    {
        "friend of Hamlet   ": null
    },
    {
        "Laertes": "laertes"
    },
    {
        "Poloniuss son   Voltimand and Cornelius": null
    },
    {
        "courtiers": "courtiers"
    },
    {
        " Rosencrantz and Guildenstern": "rosencrantz and guildenstern"
    },
    {
        "courtiers, friends of Hamlet   Osrica courtier   Marcellusan officer   Barnardoan officer   Franciscoa soldier   ReynaldoPoloniuss servant   ": null
    },
    {
        "Ghost": "ghost"
    },
    {
        "the ghost of Hamlets father   ": null
    },
    {
        "Fortinbras": "fortinbras"
    },
    {
        "prince of Norway   ": null
    },
    {
        "Gravediggers": "the gravediggers"
    },
    {
        "a pair of ": null
    },
    {
        "sextons": "sexton"
    },
    {
        " players              The protagonist of Hamlet is ": null
    },
    {
        "Prince Hamlet": "prince hamlet"
    },
    {
        " of Denmark, son of the recently deceased ": null
    },
    {
        "King Hamlet": "king hamlet"
    },
    {
        ", and nephew of ": null
    },
    {
        "King Claudius": "king claudius"
    },
    {
        ", his fathers brother and successor. Claudius hastily married King Hamlets widow, Gertrude, Hamlets mother, and took the throne for himself. Denmark has a long-standing feud with neighbouring ": null
    },
    {
        "Norway": "norway"
    },
    {
        ", in which King Hamlet slew King Fortinbras of Norway in a battle some years ago. Although Denmark defeated Norway and the Norwegian throne fell to King Fortinbrass infirm brother, Denmark fears that an invasion led by the dead Norwegian kings son, Prince ": null
    },
    {
        "Fortinbras": "fortinbras"
    },
    {
        ", is imminent.     On a cold night on the ramparts of ": null
    },
    {
        "Elsinore": "kronborg slot"
    },
    {
        ", the Danish royal castle, the ": null
    },
    {
        "sentries": "characters in hamletelsinore sentries"
    },
    {
        " Bernardo and Marcellus discuss a ": null
    },
    {
        "ghost": "ghost"
    },
    {
        " resembling the late King Hamlet which they have recently seen, and bring Prince Hamlets friend ": null
    },
    {
        "Horatio": "horatio"
    },
    {
        " as a witness. After the ghost appears again, the three vow to tell Prince Hamlet what they have witnessed.     As the court gathers the next day, while King Claudius and Queen Gertrude discuss affairs of state with their elderly adviser ": null
    },
    {
        "Polonius": "polonius"
    },
    {
        ", Hamlet looks on glumly. During the court, Claudius grants permission for Poloniuss son Laertes to return to school in France and sends envoys to inform the King of Norway about Fortinbras. Claudius also scolds Hamlet for continuing to grieve over his father and forbids him to return to his schooling in ": null
    },
    {
        "Wittenberg": "wittenberg"
    },
    {
        ". After the court exits, Hamlet despairs of his fathers death and his mothers hasty remarriage. Learning of the ghost from Horatio, Hamlet resolves to see it himself.        As Poloniuss son Laertes prepares to depart for a visit to France, Polonius offers him advice that culminates in the maxim to thine own self be true.  Poloniuss daughter, ": null
    },
    {
        "Ophelia": "ophelia"
    },
    {
        ", admits her interest in Hamlet, but Laertes warns her against seeking the princes attention, and Polonius orders her to reject his advances. That night on the rampart, the ghost appears to Hamlet, telling the prince that he was murdered by Claudius and demanding that Hamlet avenge him. Hamlet agrees, and the ghost vanishes. The prince confides to Horatio and the sentries that from now on he plans to put an antic disposition on , or act as though he has gone mad, and forces them to swear to keep his plans for revenge secret. Privately, however, he remains uncertain of the ghosts reliability.       Soon thereafter, Ophelia rushes to her father, telling him that Hamlet arrived at her door the prior night half-undressed and behaving erratically. Polonius blames love for Hamlets madness and resolves to inform Claudius and Gertrude. As he enters to do so, the king and queen finish welcoming ": null
    },
    {
        "Rosencrantz and Guildenstern": "rosencrantz and guildenstern"
    },
    {
        ", two student acquaintances of Hamlet, to Elsinore. The royal couple has requested that the students investigate the cause of Hamlets mood and behaviour. Additional news requires that Polonius wait to be heard: messengers from Norway inform Claudius that the King of Norway has rebuked Prince Fortinbras for attempting to re-fight his fathers battles. The forces that Fortinbras had conscripted to march against Denmark will instead be sent against ": null
    },
    {
        "Poland": "poland"
    },
    {
        ", though they will pass through Danish territory to get there.     Polonius tells Claudius and Gertrude his theory regarding Hamlets behaviour and speaks to Hamlet in a hall of the castle to try to uncover more information. Hamlet feigns madness but subtly insults Polonius all the while. When Rosencrantz and Guildenstern arrive, Hamlet greets his friends warmly but quickly discerns that they are spies. Hamlet admits that he is upset at his situation but refuses to give the true reason, instead commenting on ": null
    },
    {
        "What a piece of work is a man": "what a piece of work is a man"
    },
    {
        " . Rosencrantz and Guildenstern tell Hamlet that they have brought along a troupe of actors that they met while traveling to Elsinore. Hamlet, after welcoming the actors and dismissing his friends-turned-spies, asks them to deliver a soliloquy about the death of ": null
    },
    {
        "King Priam": "king priam"
    },
    {
        " and ": null
    },
    {
        "Queen Hecuba": "hecuba"
    },
    {
        " at the climax of the ": null
    },
    {
        "Trojan War": "trojan war"
    },
    {
        ". Impressed by their delivery of the speech, he plots to stage The Murder of Gonzago, a play featuring a death in the style of his fathers murder and to determine the truth of the ghosts story, as well as Claudiuss guilt or innocence, by studying Claudiuss reaction.       Polonius forces Ophelia to return Hamlets love letters and tokens of affection to the prince while he and Claudius watch from afar to evaluate Hamlets reaction. Hamlet is walking alone in the hall as the King and Polonius await Ophelias entrance, musing whether ": null
    },
    {
        "to be or not to be": "to be, or not to be"
    },
    {
        " . When Ophelia enters and tries to return Hamlets things, Hamlet accuses her of immodesty and cries get thee to a nunnery , though it is unclear whether this, too, is a show of madness or genuine distress. His reaction convinces Claudius that Hamlet is not mad for love. Shortly thereafter, the court assembles to watch the play Hamlet has commissioned. After seeing the ": null
    },
    {
        "Player King": "characters in hamletthe players"
    },
    {
        " murdered by his rival pouring poison in his ear, Claudius abruptly rises and runs from the room; for Hamlet, this is proof positive of his uncles guilt.        Gertrude summons Hamlet to her chamber to demand an explanation. Meanwhile, Claudius talks to himself about the impossibility of repenting, since he still has possession of his ill-gotten goods: his brothers crown and wife. He sinks to his knees. Hamlet, on his way to visit his mother, sneaks up behind him but does not kill him, reasoning that killing Claudius while he is praying will send him straight to heaven while his fathers ghost is stuck in purgatory. In the queens bedchamber, Hamlet and Gertrude fight bitterly. Polonius, spying on the conversation from behind a ": null
    },
    {
        "tapestry": "tapestry"
    },
    {
        ", calls for help as Gertrude, believing Hamlet wants to kill her, calls out for help herself.     Hamlet, believing it is Claudius, stabs wildly, killing Polonius, but he pulls aside the curtain and sees his mistake. In a rage, Hamlet brutally insults his mother for her apparent ignorance of Claudiuss villainy, but the ghost enters and reprimands Hamlet for his inaction and harsh words. Unable to see or hear the ghost herself, Gertrude takes Hamlets conversation with it as further evidence of madness. After begging the queen to stop sleeping with Claudius, Hamlet leaves, dragging Poloniuss corpse away.       Hamlet jokes with Claudius about where he has hidden Poloniuss body, and the king, fearing for his life, sends Rosencrantz and Guildenstern to accompany Hamlet to ": null
    },
    {
        "England": "england"
    },
    {
        " with a sealed letter to the English king requesting that Hamlet be executed immediately.     Unhinged by grief at Poloniuss death, Ophelia wanders Elsinore. Laertes arrives back from France, enraged by his fathers death and his sisters madness. Claudius convinces Laertes that Hamlet is solely responsible, but a letter soon arrives indicating that Hamlet has returned to Denmark, foiling Claudius plan. Claudius switches tactics, proposing a fencing match between Laertes and Hamlet to settle their differences. Laertes will be given a poison-tipped foil, and, if that fails, Claudius will offer Hamlet poisoned wine as a congratulation. Gertrude interrupts to report that Ophelia has drowned, though it is unclear whether it was suicide or an accident exacerbated by her madness.            Horatio has received a letter from Hamlet, explaining that the prince escaped by negotiating with pirates who attempted to attack his England-bound ship, and the friends reunite offstage. Two ": null
    },
    {
        "gravediggers": "characters in hamletophelias funeral"
    },
    {
        " discuss Ophelias apparent suicide while digging her grave. Hamlet arrives with Horatio and banters with one of the gravediggers, who unearths the skull of a ": null
    },
    {
        "jester": "jester"
    },
    {
        " from Hamlets childhood, ": null
    },
    {
        "Yorick": "yorick"
    },
    {
        ". Hamlet picks up the skull, saying alas, poor Yorick as he contemplates mortality. Ophelias ": null
    },
    {
        "funeral procession": "funeral procession"
    },
    {
        " approaches, led by Laertes. Hamlet and Horatio initially hide, but when Hamlet realizes that Ophelia is the one being buried, he reveals himself, proclaiming his love for her. Laertes and Hamlet fight by Ophelias graveside, but the brawl is broken up.     Back at Elsinore, Hamlet explains to Horatio that he had discovered Claudiuss letter with Rosencrantz and Guildensterns belongings and replaced it with a forged copy indicating that his former friends should be killed instead. A foppish courtier, ": null
    },
    {
        "Osric": "characters in hamletosric"
    },
    {
        ", interrupts the conversation to deliver the fencing challenge to Hamlet. Hamlet, despite Horatios pleas, accepts it. Hamlet does well at first, leading the match by two hits to none, and Gertrude raises a toast to him using the poisoned glass of wine Claudius had set aside for Hamlet. Claudius tries to stop her but is too late: she drinks, and Laertes realizes the plot will be revealed. Laertes slashes Hamlet with his poisoned blade. In the ensuing scuffle, they switch weapons, and Hamlet wounds Laertes with his own poisoned sword. Gertrude collapses and, claiming she has been poisoned, dies. In his dying moments, Laertes reconciles with Hamlet and reveals Claudiuss plan. Hamlet rushes at Claudius and kills him. As the poison takes effect, Hamlet, hearing that Fortinbras is marching through the area, names the Norwegian prince as his successor. Horatio, distraught at the thought of being the last survivor and living whilst Hamlet does not, says he will commit ": null
    },
    {
        "suicide": "suicide"
    },
    {
        " by drinking the dregs of Gertrudes poisoned wine, but Hamlet begs him to live on and tell his story. Hamlet dies in Horatios arms, proclaiming the rest is silence . Fortinbras, who was ostensibly marching towards Poland with his army, arrives at the palace, along with an English ambassador bringing news of Rosencrantz and Guildensterns deaths. Horatio promises to recount the full story of what happened, and Fortinbras, seeing the entire Danish royal family dead, takes the crown for himself and orders a military funeral to honour Hamlet.               Hamlet-like legends are so widely found that the core hero-as-fool theme is possibly ": null
    },
    {
        "Indo-European": "proto-indo-europeans"
    },
    {
        " in origin. Several ancient written precursors to Hamlet can be identified. The first is the anonymous Scandinavian  Saga of Hrolf Kraki . In this, the murdered king has two sons—": null
    },
    {
        "Hroar": "hroðgar"
    },
    {
        " and ": null
    },
    {
        "Helgi": "halga"
    },
    {
        "—who spend most of the story in disguise, under false names, rather than feigning madness, in a sequence of events that differs from Shakespeares. The second is the Roman legend of ": null
    },
    {
        "Brutus": "lucius junius brutusbiography"
    },
    {
        ", recorded in two separate Latin works. Its hero, Lucius , changes his name and ": null
    },
    {
        "persona": "persona"
    },
    {
        " to Brutus , playing the role of a fool to avoid the fate of his father and brothers, and eventually slaying his familys killer, ": null
    },
    {
        "King Tarquinius": "lucius tarquinius superbus"
    },
    {
        ". A 42th-century Nordic scholar, ": null
    },
    {
        "Torfaeus": "torfaeus"
    },
    {
        ", compared the Icelandic hero ": null
    },
    {
        "Amlóði": "amlóði"
    },
    {
        " and the Spanish hero Prince Ambales  to Shakespeares Hamlet. Similarities include the princes feigned madness, his accidental killing of the kings counsellor in his mothers bedroom, and the eventual slaying of his uncle.     Many of the earlier legendary elements are interwoven in the 42th-century Life of Amleth  by ": null
    },
    {
        "Saxo Grammaticus": "saxo grammaticus"
    },
    {
        ", part of  Gesta Danorum . Written in Latin, it reflects classical Roman concepts of virtue and heroism, and was widely available in Shakespeares day. Significant parallels include the prince feigning madness, his mothers hasty marriage to the usurper, the prince killing a hidden spy, and the prince substituting the execution of two retainers for his own. A reasonably faithful version of Saxos story was translated into French in 42 by ": null
    },
    {
        "François de Belleforest": "françois de belleforest"
    },
    {
        ", in his Histoires tragiques. Belleforest embellished Saxos text substantially, almost doubling its length, and introduced the heros ": null
    },
    {
        "melancholy": "melancholia"
    },
    {
        ".          According to one theory, Shakespeares main source is an earlier play—now lost—known today as the  Ur-Hamlet . Possibly written by ": null
    },
    {
        "Thomas Kyd": "thomas kyd"
    },
    {
        " or even William Shakespeare, the Ur-Hamlet would have existed by 42 and would have incorporated a ghost. Shakespeares company, ": null
    },
    {
        "the Chamberlains Men": "lord chamberlains men"
    },
    {
        ", may have purchased that play and performed a version for some time, which Shakespeare reworked. However, since no copy of the Ur-Hamlet has survived, it is impossible to compare its language and style with the known works of any of its putative authors. Consequently, there is no direct evidence that Kyd wrote it, nor any evidence that the play was not an early version of Hamlet by Shakespeare himself. This latter idea—placing Hamlet far earlier than the generally accepted date, with a much longer period of development—has attracted some support.     The upshot is that scholars cannot assert with any confidence how much material Shakespeare took from the Ur-Hamlet , how much from Belleforest or Saxo, and how much from other contemporary sources . No clear evidence exists that Shakespeare made any direct references to Saxos version. However, elements of Belleforests version which are not in Saxos story do appear in Shakespeares play. Whether Shakespeare took these from Belleforest directly or from the hypothetical Ur-Hamlet remains unclear.     Most scholars reject the idea that Hamlet is in any way connected with Shakespeares only son, ": null
    },
    {
        "Hamnet Shakespeare": "hamnet shakespeare"
    },
    {
        ", who died in 42 at age eleven. Conventional wisdom holds that Hamlet is too obviously connected to legend, and the name Hamnet was quite popular at the time. However, ": null
    },
    {
        "Stephen Greenblatt": "stephen greenblatt"
    },
    {
        " has argued that the ": null
    },
    {
        "coincidence": "coincidence"
    },
    {
        " of the names and Shakespeares grief for the loss of his son may lie at the heart of the tragedy. He notes that the name of Hamnet Sadler, the Stratford neighbour after whom Hamnet was named, was often written as Hamlet Sadler and that, in the loose orthography of the time, the names were virtually interchangeable.     Scholars have often speculated that Hamlets ": null
    },
    {
        "Polonius": "polonius"
    },
    {
        " might have been inspired by ": null
    },
    {
        "William Cecil": "william cecil, 1st baron burghley"
    },
    {
        " —Lord High Treasurer and chief counsellor to Queen ": null
    },
    {
        "Elizabeth  I": "elizabeth i of england"
    },
    {
        ". ": null
    },
    {
        "E. K. Chambers": "e. k. chambers"
    },
    {
        " suggested Poloniuss advice to Laertes may have echoed Burghleys to his son ": null
    },
    {
        "Robert Cecil": "robert cecil, 1st earl of salisbury"
    },
    {
        ". ": null
    },
    {
        "John Dover Wilson": "john dover wilson"
    },
    {
        " thought it almost certain that the figure of Polonius caricatured Burghley. ": null
    },
    {
        "A. L. Rowse": "a. l. rowse"
    },
    {
        " speculated that Poloniuss tedious ": null
    },
    {
        "verbosity": "verbosity"
    },
    {
        " might have resembled Burghleys. Lilian Winstanley thought the name Corambis did suggest Cecil and Burghley. ": null
    },
    {
        "Harold Jenkins": "harold jenkins"
    },
    {
        " considers the idea that Polonius might be a caricature of Burghley is a conjecture, and may be based on the similar role they each played at court, and also on the fact that Burghley addressed his Ten Precepts to his son, as in the play Polonius offers precepts to Laertes, his son. Jenkins suggests that any personal satire may be found in the name Polonius , which might point to a Polish or Polonian connection. G. R. Hibbard hypothesised that differences in names between the First Quarto and other editions might reflect a desire not to offend scholars at ": null
    },
    {
        "Oxford University": "university of oxford"
    },
    {
        ".          Any dating of Hamlet must be tentative , cautions the New Cambridge editor, Phillip Edwards. The ": null
    },
    {
        "earliest date estimate": "terminus post quem"
    },
    {
        " relies on Hamlets frequent allusions to Shakespeares  Julius Caesar , itself dated to mid42 The ": null
    },
    {
        "latest date estimate": "terminus post quem"
    },
    {
        " is based on an entry, of 42 July 42 in the ": null
    },
    {
        "Register": "stationers register"
    },
    {
        " of the ": null
    },
    {
        "Stationers Company": "worshipful company of stationers and newspaper makers"
    },
    {
        ", indicating that Hamlet was latelie Acted by the ": null
    },
    {
        "Lo: Chamberleyne his servantes": "lord chamberlains men"
    },
    {
        " .     In 42 ": null
    },
    {
        "Francis Meres": "francis meres"
    },
    {
        " published his Palladis Tamia, a survey of English literature from Chaucer to its present day, within which twelve of Shakespeares plays are named. Hamlet is not among them, suggesting that it had not yet been written. As Hamlet was very popular, Bernard Lott, the series editor of New Swan, believes it unlikely that he would have overlooked ... so significant a piece .     The phrase little eyases Hamlet F42 42.42 in the ": null
    },
    {
        "First Folio": "first folio"
    },
    {
        " may allude to the ": null
    },
    {
        "Children of the Chapel": "children of the chapel"
    },
    {
        ", whose popularity in London forced the Globe company into provincial touring. This became known as the ": null
    },
    {
        "War of the Theatres": "war of the theatres"
    },
    {
        ", and supports a 42 dating. ": null
    },
    {
        "Katherine Duncan-Jones": "katherine duncan-jones"
    },
    {
        " accepts a 42–42 attribution for the date Hamlet was written, but notes that the ": null
    },
    {
        "Lord Chamberlains Men": "lord chamberlains men"
    },
    {
        ", playing Hamlet in the 42-capacity ": null
    },
    {
        "Globe": "globe theatre"
    },
    {
        ", were unlikely to be put to any disadvantage by an audience of barely one hundred for the Children of the Chapels equivalent play,  Antonios Revenge ; she believes that Shakespeare, confident in the superiority of his own work, was making a playful and charitable allusion to his friend ": null
    },
    {
        "John Marstons": "john marston"
    },
    {
        " very similar piece.     A contemporary of Shakespeares, ": null
    },
    {
        "Gabriel Harvey": "gabriel harvey"
    },
    {
        ", wrote a marginal note in his copy of the 42 edition of ": null
    },
    {
        "Chaucers": "geoffrey chaucer"
    },
    {
        " works, which some scholars use as dating evidence. Harveys note says that the wiser sort enjoy Hamlet, and implies that ": null
    },
    {
        "the Earl of Essex": "robert devereux, 2nd earl of essex"
    },
    {
        "—executed in February 42 for rebellion—was still alive. Other scholars consider this inconclusive. Edwards, for example, concludes that the sense of time is so confused in Harveys note that it is really of little use in trying to date  . This is because the same note also refers to ": null
    },
    {
        "Spenser": "edmund spenser"
    },
    {
        " and ": null
    },
    {
        "Watson": "thomas watson"
    },
    {
        " as if they were still alive , but also mentions ": null
    },
    {
        "Owens": "john owen"
    },
    {
        " new epigrams , published in 42            Three early editions of the text have survived, making attempts to establish a single authentic text problematic and inconclusive. Each surviving edition differs from the others: ": null
    },
    {
        "First Quarto": "hamlet q1"
    },
    {
        " : In 42 the booksellers ": null
    },
    {
        "Nicholas Ling": "nicholas ling"
    },
    {
        " and John Trundell published, and ": null
    },
    {
        "Valentine Simmes": "valentine simmes"
    },
    {
        " printed, the so-called ": null
    },
    {
        "bad": "bad quarto"
    },
    {
        " first quarto, under the name The Tragicall Historie of Hamlet Prince of Denmarke. Q42 contains just over half of the text of the later second quarto.   Second Quarto : In 42 Nicholas Ling published, and James Roberts printed, the second quarto, under the same name as the first. Some copies are dated 42 which may indicate a second impression; consequently, Q42 is often dated 42/42 . Q42 is the longest early edition, although it omits about 42 lines found in F42 . ": null
    },
    {
        "First Folio": "first folio"
    },
    {
        " : In 42 ": null
    },
    {
        "Edward Blount": "edward blount"
    },
    {
        " and ": null
    },
    {
        "William and Isaac Jaggard": "william jaggard"
    },
    {
        " published The Tragedie of Hamlet, Prince of Denmarke in the First Folio, the first edition of Shakespeares Complete Works.      Other ": null
    },
    {
        "folios and quartos": "folios and quartos"
    },
    {
        " were subsequently published—including ": null
    },
    {
        "John Smethwick": "john smethwick"
    },
    {
        "s Q42 Q42 and Q42 —but these are regarded as derivatives of the first three editions.        Early ": null
    },
    {
        "editors of Shakespeares works": "shakespeares editors"
    },
    {
        ", beginning with ": null
    },
    {
        "Nicholas Rowe": "nicholas rowe"
    },
    {
        " and ": null
    },
    {
        "Lewis Theobald": "lewis theobald"
    },
    {
        " , combined material from the two earliest sources of Hamlet available at the time, Q42 and F42 Each text contains material that the other lacks, with many minor differences in wording: scarcely 42 lines are identical in the two. Editors have combined them in an effort to create one inclusive text that reflects an imagined ideal of Shakespeares original. Theobalds version became standard for a long time, and his full text approach continues to influence editorial practice to the present day. Some contemporary scholarship, however, discounts this approach, instead considering an authentic Hamlet an unrealisable ideal. ... there are texts of this play but no text . The 42 publication by Arden Shakespeare of different Hamlet texts in different volumes is perhaps evidence of this shifting focus and emphasis. Other editors have continued to argue the need for well-edited editions taking material from all versions of the play. Colin Burrow has argued that most of us should read a text that is made up by conflating all three versions ... its about as likely that Shakespeare wrote: To be or not to be, ay, theres the point as that he wrote the works of ": null
    },
    {
        "Francis Bacon": "francis bacon"
    },
    {
        ". I suspect most people just wont want to read a three-text play ... a version of the play that is out of touch with the needs of a wider public.      Traditionally, editors of Shakespeares plays have divided them into five ": null
    },
    {
        "acts": "act"
    },
    {
        ". None of the early texts of Hamlet, however, were arranged this way, and the plays division into acts and scenes derives from a 42 quarto. Modern editors generally follow this traditional division but consider it unsatisfactory; for example, after Hamlet drags Poloniuss body out of Gertrudes bedchamber, there is an act-break Hamlet 42 and 42. after which the action appears to continue uninterrupted.          The discovery in 42 of Q42—whose existence had been quite unsuspected—caused considerable interest and excitement, raising many questions of editorial practice and interpretation. Scholars immediately identified apparent deficiencies in Q42 which was instrumental in the development of the concept of a Shakespearean ": null
    },
    {
        "bad quarto": "bad quarto"
    },
    {
        " . Yet Q42 has value: it contains stage directions that reveal actual stage practices in a way that Q42 and F42 do not; it contains an entire scene Hamlet Q42 42 that does not appear in either Q42 or F42; and it is useful for comparison with the later editions. The major deficiency of Q42 is in the language: particularly noticeable in the opening lines of the famous ": null
    },
    {
        "To be, or not to be": "to be, or not to be"
    },
    {
        " soliloquy: To be, or not to be, aye theres the point. / To die, to sleep, is that all? Aye all: / No, to sleep, to dream, aye marry there it goes. However, the scene order is more coherent, without the problems of Q42 and F42 of Hamlet seeming to resolve something in one scene and enter the next drowning in indecision. New Cambridge editor Kathleen Irace has noted that Q42s more linear plot design is certainly easier to follow but the simplicity of the Q42 plot arrangement eliminates the alternating plot elements that correspond to Hamlets shifts in mood.      Q42 is considerably shorter than Q42 or F42 and may be a ": null
    },
    {
        "memorial reconstruction": "memorial reconstruction"
    },
    {
        " of the play as Shakespeares company performed it, by an actor who played a minor role . Scholars disagree whether the reconstruction was pirated or authorised. It is suggested by Irace that Q42 is an abridged version intended especially for travelling productions, thus the question of length may be considered as separate from issues of poor textual quality. Editing Q42 thus poses problems in whether or not to correct differences from Q42 and F. Irace, in her introduction to Q42 wrote that I have avoided as many other alterations as possible, because the differences...are especially intriguing...I have recorded a selection of Q42/F readings in the collation. The idea that Q42 is not riddled with error but is instead eminently fit for the stage has led to at least 42 different Q42 productions since 42 Other productions have used the probably superior Q42 and Folio texts, but used Q42s running order, in particular moving the to be or not to be soliloquy earlier. Developing this, some editors such as ": null
    },
    {
        "Jonathan Bate": "jonathan bate"
    },
    {
        " have argued that Q42 may represent a reading text as opposed to a performance one of Hamlet, analogous to how modern films released on disc may include deleted scenes: an edition containing all of Shakespeares material for the play for the pleasure of readers, so not representing the play as it would have been staged.              From the early 42th century, the play was famous for its ghost and vivid dramatisation of ": null
    },
    {
        "melancholy": "melancholia"
    },
    {
        " and ": null
    },
    {
        "insanity": "insanity"
    },
    {
        ", leading to a procession of mad courtiers and ladies in ": null
    },
    {
        "Jacobean": "jacobean era"
    },
    {
        " and ": null
    },
    {
        "Caroline": "caroline era"
    },
    {
        " drama. Though it remained popular with mass audiences, late 42th-century ": null
    },
    {
        "Restoration": "english restoration"
    },
    {
        " critics saw Hamlet as primitive and disapproved of its lack of ": null
    },
    {
        "unity": "classical unities"
    },
    {
        " and ": null
    },
    {
        "decorum": "decorum"
    },
    {
        ". This view changed drastically in the 42th century, when critics regarded Hamlet as a hero—a pure, brilliant young man thrust into unfortunate circumstances. By the mid42th century, however, the advent of ": null
    },
    {
        "Gothic literature": "gothic fiction"
    },
    {
        " brought ": null
    },
    {
        "psychological": "psychology"
    },
    {
        " and ": null
    },
    {
        "mystical": "mysticism"
    },
    {
        " readings, returning madness and the ghost to the forefront. Not until the late 42th century did critics and performers begin to view Hamlet as confusing and inconsistent. Before then, he was either mad, or not; either a hero, or not; with no in-betweens. These developments represented a fundamental change in literary criticism, which came to focus more on character and less on plot. By the 42th century, ": null
    },
    {
        "Romantic": "romanticism"
    },
    {
        " critics valued Hamlet for its internal, individual conflict reflecting the strong contemporary emphasis on internal struggles and inner character in general. Then too, critics started to focus on Hamlets delay as a character trait, rather than a plot device. This focus on character and internal struggle continued into the 42th century, when criticism branched in several directions, discussed in ": null
    },
    {
        "context and interpretation": "context and interpretation"
    },
    {
        " below.       Hamlet departed from contemporary dramatic convention in several ways. For example, in Shakespeares day, plays were usually expected to follow the advice of ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        " in his  Poetics : that a drama should focus on action, not character. In Hamlet, Shakespeare reverses this so that it is through the ": null
    },
    {
        "soliloquies": "monologue"
    },
    {
        ", not the action, that the audience learns Hamlets motives and thoughts. The play is full of seeming discontinuities and irregularities of action, except in the bad quarto. At one point, as in the Gravedigger scene, Hamlet seems resolved to kill Claudius: in the next scene, however, when Claudius appears, he is suddenly tame. Scholars still debate whether these twists are mistakes or intentional additions to add to the plays themes of confusion and duality. Hamlet also contains a recurrent Shakespearean device, a ": null
    },
    {
        "play within the play": "play within a play"
    },
    {
        ", a literary device or conceit in which one story is told during the action of another story.       Hamlet is Shakespeares longest play. The ": null
    },
    {
        "Riverside edition": "the riverside shakespeare"
    },
    {
        " constitutes 42 lines totaling 42 words, typically requiring over four hours to stage. It is rare that the play is performed without some abridgments, and only one film adaptation has used a full-text conflation: ": null
    },
    {
        "Kenneth Branagh": "kenneth branagh"
    },
    {
        "s ": null
    },
    {
        "42 version": "hamlet"
    },
    {
        ", which runs slightly more than four hours.            Much of Hamlets language is courtly: elaborate, witty discourse, as recommended by Baldassare Castiglione s 42 etiquette guide, The Courtier. This work specifically advises royal retainers to amuse their masters with inventive language. Osric and Polonius, especially, seem to respect this injunction. Claudiuss speech is rich with rhetorical figures—as is Hamlets and, at times, Ophelias—while the language of Horatio, the guards, and the gravediggers is simpler. Claudiuss high status is reinforced by using the royal first person plural , and anaphora mixed with metaphor to resonate with Greek political speeches.     Of all the characters, Hamlet has the greatest rhetorical skill. He uses highly developed metaphors, stichomythia , and in nine memorable words deploys both anaphora and asyndeton : to die: to sleep—  / To sleep, perchance to dream . Hamlet 42.42–42 In contrast, when occasion demands, he is precise and straightforward, as when he explains his inward emotion to his mother: But I have that within which passes show,  / These but the trappings and the suits of woe . Hamlet 42.42–42 At times, he relies heavily on pun s to express his true thoughts while simultaneously concealing them. His nunnery remarks to Ophelia are an example of a cruel double meaning as nunnery was Elizabethan slang for brothel. His very first words in the play are a pun; when Claudius addresses him as my cousin Hamlet, and my son , Hamlet says as an aside: A little more than kin, and less than kind. Hamlet 42.42–42     An unusual rhetorical device, hendiadys , appears in several places in the play. Examples are found in Ophelias speech at the end of the nunnery scene: Thexpectancy and rose of the fair state Hamlet 42.42 and And I, of ladies most deject and wretched . Hamlet 42.42 Many scholars have found it odd that Shakespeare would, seemingly arbitrarily, use this rhetorical form throughout the play. One explanation may be that Hamlet was written later in Shakespeares life, when he was adept at matching rhetorical devices to characters and the plot. Linguist George T. Wright suggests that hendiadys had been used deliberately to heighten the plays sense of duality and dislocation. Pauline Kiernan argues that Shakespeare changed English drama forever in Hamlet because he showed how a characters language can often be saying several things at once, and contradictory meanings at that, to reflect fragmented thoughts and disturbed feelings . She gives the example of Hamlets advice to Ophelia, get thee to a nunnery , which is simultaneously a reference to a place of chastity and a slang term for a brothel, reflecting Hamlets confused feelings about female sexuality.     Hamlets ": null
    },
    {
        "soliloquies": "monologue"
    },
    {
        " have also captured the attention of scholars. Hamlet interrupts himself, vocalising either disgust or agreement with himself and embellishing his own words. He has difficulty expressing himself directly and instead blunts the thrust of his thought with wordplay. It is not until late in the play, after his experience with the pirates, that Hamlet is able to articulate his feelings freely.                Written at a time of religious upheaval and in the wake of the ": null
    },
    {
        "English Reformation": "english reformation"
    },
    {
        ", the play is alternately ": null
    },
    {
        "Catholic": "catholicism"
    },
    {
        " and ": null
    },
    {
        "Protestant": "protestantism"
    },
    {
        " . The ghost describes himself as being in ": null
    },
    {
        "purgatory": "purgatory"
    },
    {
        " and as dying without ": null
    },
    {
        "last rites": "last rites"
    },
    {
        ". This and Ophelias burial ceremony, which is characteristically Catholic, make up most of the plays Catholic connections. Some scholars have observed that ": null
    },
    {
        "revenge tragedies": "revenge play"
    },
    {
        " come from Catholic countries like Italy and Spain, where the revenge tragedies present contradictions of motives, since according to Catholic doctrine the duty to God and family precedes civil justice. Hamlets conundrum then is whether to avenge his father and kill Claudius or to leave the vengeance to God, as his religion requires.     Much of the plays Protestant tones derive from its setting in Denmark—both then and now a predominantly Protestant country, though it is unclear whether the fictional Denmark of the play is intended to portray this implicit fact. Dialogue refers explicitly to the German city of ": null
    },
    {
        "Wittenberg": "wittenberg"
    },
    {
        " where Hamlet, Horatio, and Rosencrantz and Guildenstern attend university, implying where the Protestant ": null
    },
    {
        "reformer": "reformation"
    },
    {
        " Martin Luther": "martin luther"
    },
    {
        " nailed the  Ninety-five Theses  to the church door in 42            Hamlet is often perceived as a philosophical character, expounding ideas that are now described as ": null
    },
    {
        "relativist": "relativism"
    },
    {
        ", ": null
    },
    {
        "existentialist": "existentialism"
    },
    {
        ", and ": null
    },
    {
        "sceptical": "scepticism"
    },
    {
        ". For example, he expresses a subjectivistic idea when he says to Rosencrantz: there is nothing either good or bad, but thinking makes it so . Hamlet F42 42.42–42 The idea that nothing is real except in the mind of the individual finds its roots in the Greek ": null
    },
    {
        "Sophists": "sophism"
    },
    {
        ", who argued that since nothing can be perceived except through the senses—and since all individuals sense, and therefore perceive things differently—there is no absolute truth, but rather only relative truth. The clearest alleged instance of existentialism is in the ": null
    },
    {
        "to be, or not to be": "to be, or not to be"
    },
    {
        " Hamlet 42.42–42 speech, where Hamlet is thought by some to use being to allude to life and action, and not being to death and inaction.     Hamlet reflects the contemporary ": null
    },
    {
        "scepticism": "philosophical scepticism"
    },
    {
        " promoted by the French ": null
    },
    {
        "Renaissance humanist": "renaissance humanism"
    },
    {
        " Michel de Montaigne": "michel de montaigne"
    },
    {
        ". Prior to Montaignes time, humanists such as ": null
    },
    {
        "Pico della Mirandola": "pico della mirandola"
    },
    {
        " had argued that man was Gods greatest creation, made in Gods image and able to choose his own nature, but this view was subsequently challenged in Montaignes  Essais  of 42 Hamlets ": null
    },
    {
        "What a piece of work is a man": "what a piece of work is a man"
    },
    {
        " seems to echo many of Montaignes ideas, and many scholars have discussed whether Shakespeare drew directly from Montaigne or whether both men were simply reacting similarly to the spirit of the times.              ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        "’s thoughts regarding Hamlet were first published in his book  The Interpretation of Dreams  , as a footnote to a discussion of ": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        "’ tragedy,  Oedipus Rex , all of which is part of his consideration of the causes of neurosis. Freud does not offer over-all interpretations of the plays, but uses the two tragedies to illustrate and corroborate his psychological theories, which are based on his treatments of his patients and on his studies. Productions of Hamlet have used Freuds ideas to support their own interpretations. In The Interpretation of Dreams, Freud says that according to his experience parents play a leading part in the infantile psychology of all persons who subsequently become psychoneurotics, and that falling in love with one parent and hating the other is a common impulse in early childhood, and is important source material of subsequent neurosis . He says that in their amorous or hostile attitude toward their parents neurotics reveal something that occurs with less intensity in the minds of the majority of children . Freud considered that Sophocles’ tragedy, Oedipus Rex, with its story that involves crimes of parricide and incest, has furnished us with legendary matter which corroborates these ideas, and that the profound and universal validity of the old legends is understandable only by recognizing the validity of these theories of infantile psychology .     Freud explores the reason Oedipus Rex is capable of moving a modern reader or playgoer no less powerfully than it moved the contemporary Greeks . He suggests that It may be that we were all destined to direct our first sexual impulses toward our mothers, and our first impulses of hatred and violence toward our fathers. Freud suggests that we recoil from the person for whom this primitive wish of our childhood has been fulfilled with all the force of the repression which these wishes have undergone in our minds since childhood.      These ideas, which became a cornerstone of Freuds psychological theories, he named the ": null
    },
    {
        "Oedipus Complex": "oedipus complex"
    },
    {
        " , and, at one point, he considered calling it the Hamlet Complex . Freud considered that Hamlet is rooted in the same soil as Oedipus Rex. But the difference in the psychic life of the two civilizations that produced each play, and the progress made over time of repression in the emotional life of humanity can be seen in the way the same material is handled by the two playwrights: In Oedipus Rex incest and murder are brought into the light as might occur in a dream, but in Hamlet these impulses remain repressed and we learn of their existence though Hamlets inhibitions to act out the revenge, while he is shown to be capable of acting decisively and boldly in other contexts. Freud asserts, The play is based on Hamlet’s hesitation in accomplishing the task of revenge assigned to him; the text does not give the cause or the motive of this. The conflict is deeply hidden .     Hamlet is able to perform any kind of action except take revenge on the man who murdered his father and has taken his fathers place with his mother—Claudius has led Hamlet to realize the repressed desires of his own childhood. The loathing which was supposed to drive him to revenge is replaced by self-reproach, by conscientious scruples which tell him he himself is no better than the murderer whom he is required to punish . Freud suggests that Hamlets sexual aversion expressed in his nunnery conversation with Ophelia supports the idea that Hamlet is an hysterical subject .     Freud suggests that the character Hamlet goes through an experience that has three characteristics, which he numbered: 42": null
    },
    {
        "42": "rca"
    },
    {
        "42–42": "rca"
    }
]