[
    {
        "   Hangman is a ": null
    },
    {
        "paper and pencil": "paper-and-pencil game"
    },
    {
        " guessing game": "guessingguessing games"
    },
    {
        " for two or more players. One player thinks of a ": null
    },
    {
        "word": "word"
    },
    {
        ", ": null
    },
    {
        "phrase": "phrase"
    },
    {
        " or ": null
    },
    {
        "sentence": "sentence"
    },
    {
        " and the other tries to guess it by suggesting ": null
    },
    {
        "letters": "letter"
    },
    {
        " within a certain number of guesses.       The word to guess is represented by a row of ": null
    },
    {
        "dashes": "dash"
    },
    {
        ", representing each ": null
    },
    {
        "letter": "letter"
    },
    {
        " of the ": null
    },
    {
        "word": "word"
    },
    {
        ". In most variants, ": null
    },
    {
        "proper noun": "proper noun"
    },
    {
        "s, such as names, places, and brands, are not allowed. Slang words, sometimes referred to as informal or shortened words, are also not allowed. If the guessing player suggests a letter which occurs in the word, the other player writes it in all its correct positions. If the suggested letter does not occur in the word, the other player draws one element of a hanged man ": null
    },
    {
        "stick figure": "stick figure"
    },
    {
        " as a ": null
    },
    {
        "tally mark": "tally marks"
    },
    {
        ".     The player guessing the word may, at any time, attempt to guess the whole word. If the word is correct, the game is over and the guesser wins. Otherwise, the other player may choose to penalize the guesser by adding an element to the diagram. On the other hand, if the other player makes enough incorrect guesses to allow his opponent to complete the diagram, the game is also over, this time with the guesser losing. However, the guesser can also win by guessing all the letters that appear in the word, thereby completing the word, before the diagram is completed.          As the name of the game suggests, the ": null
    },
    {
        "diagram": "diagram"
    },
    {
        " is designed to look like a ": null
    },
    {
        "hanging": "hanging"
    },
    {
        " man. Although debates have arisen about the questionable taste of this picture,  , Japan Probe, July 23, 2010 it is still in use today. A common alternative for teachers is to draw an ": null
    },
    {
        "apple tree": "apple tree"
    },
    {
        " with ten apples, erasing or crossing out the ": null
    },
    {
        "apples": "apple"
    },
    {
        "as the guesses are used up.     The exact nature of the diagram differs; some players draw the ": null
    },
    {
        "gallows": "gallows"
    },
    {
        " before play and draw parts of the mans body . Some players begin with no diagram at all, and drawing the individual elements of the gallows as part of the game, effectively giving the guessing players more chances. The amount of detail on the man can also vary, affecting the number of chances. Some players include a ": null
    },
    {
        "face": "face"
    },
    {
        " on the head, either all at once or one feature at a time. Some players include beheading the head as the last chance by drawing a line at the neck.     Some modifications to game play  to increase the difficulty level are sometimes implemented, such as limiting guesses on high-frequency ": null
    },
    {
        "consonants": "consonant"
    },
    {
        "and ": null
    },
    {
        "vowel": "vowel"
    },
    {
        "s. Another alternative is to give the definition of the word; this can be used to facilitate the learning of a ": null
    },
    {
        "foreign language": "foreign language"
    },
    {
        ".       The fact that the twelve most commonly occurring letters in the ": null
    },
    {
        "English language": "english language"
    },
    {
        " are ": null
    },
    {
        "e-t-a-o-i-n-s-h-r-d-l-u": "etaoin shrdlu"
    },
    {
        " , along with other ": null
    },
    {
        "letter-frequency": "letter frequency"
    },
    {
        " lists, are used by the guessing player to increase the odds when it is their turn to guess. On the other hand, the same lists can be used by the puzzle setter to stump their opponent by choosing a word that deliberately avoids common letters  or one that contains rare letters .     Another common strategy is to guess vowels first, as ": null
    },
    {
        "English": "english language"
    },
    {
        " only has five vowels  and ": null
    },
    {
        "almost every word has at least one": "english words without vowels"
    },
    {
        ".     According to a 2010 study conducted by Jon McLoone for ": null
    },
    {
        "Wolfram Research": "wolfram research"
    },
    {
        ", the most difficult words to guess include jazz, buzz, hajj, faff, fizz, fuzz and variations of these.          The game show  Wheel of Fortune  is based on Hangman but with the addition of multiple-word puzzles, a ": null
    },
    {
        "roulette": "roulette"
    },
    {
        "-styled wheel, and cash awards.     ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " also had a show in the 1960s and again from 2012–2013 called Let’s Play Hangman, hosted by the legendary ": null
    },
    {
        "Silvio Santos": "silvio santos"
    },
    {
        ". Brazil would later get its own version of Wheel of Fortune, running from 1980 to 1993, again from 2003 to 2012 , and again since 2013 to the present. These shows were also hosted by Santos.     In July 2017, the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " introduced a game show of its own called  Letterbox , which is also based on Hangman.        The following example game illustrates a player trying to guess the word hangman using a strategy based solely on letter frequency. As the player continues, a part of the stick figure on the noose is added. Once a full body is drawn, the game is over, and the player lost.     ": null
    }
]