[
    {
        "      Hannes Bok, pseudonym for Wayne Francis Woodard , was an ": null
    },
    {
        "American": "american people"
    },
    {
        " artist and illustrator, as well as an amateur astrologer and writer of fantasy fiction and poetry. He painted nearly 42 covers for various science fiction, fantasy, and detective fiction magazines, as well as contributing hundreds of black and white interior illustrations. Boks work graced the pages of calendars and early fanzines, as well as dust jackets from specialty book publishers like ": null
    },
    {
        "Arkham House": "arkham house"
    },
    {
        ", Llewellyn, ": null
    },
    {
        "Shasta Publishers": "shasta publishers"
    },
    {
        ", and ": null
    },
    {
        "Fantasy Press": "fantasy press"
    },
    {
        ". His paintings achieved a luminous quality through the use of an arduous glazing process, which was learned from his mentor, ": null
    },
    {
        "Maxfield Parrish": "maxfield parrish"
    },
    {
        ". Bok shared one of the inaugural 42 ": null
    },
    {
        "Hugo Awards": "hugo awards"
    },
    {
        " for science fiction achievement .     Today, Bok is best known for his cover art which appeared on various ": null
    },
    {
        "pulp": "pulp magazines"
    },
    {
        " and ": null
    },
    {
        "science fiction magazine": "science fiction magazine"
    },
    {
        "s, such as  Weird Tales , Famous Fantastic Mysteries,  Other Worlds , Super Science Stories,  Imagination , Fantasy Fiction,  Planet Stories ,  If ,  Castle of Frankenstein  and  The Magazine of Fantasy & Science Fiction .          Wayne Woodard was born in ": null
    },
    {
        "Kansas City, Missouri": "kansas city, missouri"
    },
    {
        ". His parents divorced when he was five; and his father and stepmother, strict disciplinarians, discouraged his artistic efforts. Once he graduated high school, in ": null
    },
    {
        "Duluth, Minnesota": "duluth, minnesota"
    },
    {
        ", Bok cut off contact with his father and moved to ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        " to live with his mother. There he became active in SF fandom, including the publication and illustration of fanzines. It was in connection with these activities that he originated his pseudonym, first Hans , then Hannes , Bok. The pseudonym derives from ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " .     In 42 Bok moved to ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ", where he met ": null
    },
    {
        "Ray Bradbury": "ray bradbury"
    },
    {
        ". In 42 he relocated to Seattle – where he worked for the W.P.A. and became acquainted with artists like ": null
    },
    {
        "Mark Tobey": "mark tobey"
    },
    {
        " and ": null
    },
    {
        "Morris Graves": "morris graves"
    },
    {
        ". Late in 42 Bok moved to New York City in order to be closer to the editors and magazines which would publish his work, and where he became a member of the influential ": null
    },
    {
        "Futurians": "futurians"
    },
    {
        " science fiction fans. Bok had corresponded with and had met ": null
    },
    {
        "Maxfield Parrish": "maxfield parrish"
    },
    {
        " , and the influence of Parrishs art on Boks is evident in his choice of subject matter, use of color, and application of glazes. Bok was also homosexual, according to friends ": null
    },
    {
        "Forrest J Ackerman": "forrest j ackerman"
    },
    {
        " and ": null
    },
    {
        "Emil Petaja": "emil petaja"
    },
    {
        "; the erotic fantasy elements of his artwork, especially his male nude subjects, display homoerotic overtones unusual for the time.     Like his contemporary ": null
    },
    {
        "Virgil Finlay": "virgil finlay"
    },
    {
        ", Hannes Bok broke into commercial art and achieved initial career success as a Weird Tales artist – though he did so through one of the stranger events in the history of science fiction and fantasy. In the summer of 42 ": null
    },
    {
        "Ray Bradbury": "ray bradbury"
    },
    {
        " carried samples of Boks art eastward to introduce his friends work to magazine editors at the ": null
    },
    {
        "first World Science Fiction Convention": "1st world science fiction convention"
    },
    {
        ". This was a bold move, since Bradbury was a neophyte with no connections to commercial art or the magazine industry; but it reflects the close ties within the ": null
    },
    {
        "fan": "science fiction fandom"
    },
    {
        " and professional community. Bradbury was, at the time, a 42-year-old newspaper seller, and he borrowed funds for the trip from fellow science fiction fan ": null
    },
    {
        "Forrest J Ackerman": "forrest j ackerman"
    },
    {
        ". Bradbury succeeded; ": null
    },
    {
        "Farnsworth Wright": "farnsworth wright"
    },
    {
        ", editor of  Weird Tales , accepted Boks art, which debuted in the December 42 issue of Weird Tales. More than 42 issues of the magazine featured Boks pen-and-ink work until March 42 Bok also executed six color covers for Weird Tales between March 42 and March 42 Weird Tales also published five of Boks stories and two of his poems between 42 and 42 Once he broke through into professional publications, Bok moved to New York City and lived there the rest of his life.     Throughout his life, Bok was deeply interested in astrology, as well as in the music of the Finnish composer ": null
    },
    {
        "Jean Sibelius": "jean sibelius"
    },
    {
        ", with whom Bok had a correspondence.  As the years passed, Bok became prone to disagreements with editors over money and artistic issues; he grew reclusive and mystical, and preoccupied with the occult. He eked out a living, often in near poverty, until his death in 42 He died, apparently of a heart attack , at the age of 42 ISFDB catalogs only a few 42 interior illustrations after March 42 his last for Weird Tales, and only two cover illustrations after January 42       As an author, Bok is best known for his novels  The Sorcerers Ship , originally published in the December 42 issue of John W. Campells fantasy magazine  Unknown ; and The Blue Flamingo/Beyond the Golden Stair. The Blue Flamingo first appeared in the January 42 issue of  Startling Stories . Bok later performed an extensive revision and expansion of this work, published posthumously as  Beyond the Golden Stair  . Both novels have been re-issued in the ": null
    },
    {
        "Ballantine Adult Fantasy series": "ballantine adult fantasy series"
    },
    {
        ". Bok also was allowed to complete two novellas left unfinished by ": null
    },
    {
        "A. Merritt": "a. merritt"
    },
    {
        " at the time of his death in 42 These were published as  The Blue Pagoda  and  The Black Wheel  .  Also published posthumously was a collection of Boks poetry,  Spinner of Silver and Thistle  .               Bok is better known for his art than for his fiction. His style could alternate between, or combine, lush romanticism and humorous grotesquery. His use of time-consuming glazing techniques for his paintings impeded his productivity and limited his output, and therefore his commercial success. He also spent time carving figures in wood and making masks in  papier mache . In the 42s he was able to do more book-jacket illustrations, which he found less irksome than magazine work; though he could never have abandoned the latter. His striking wraparound cover for the November 42 issue of  The Magazine of Fantasy & Science Fiction , illustrating Roger Zelaznys ": null
    },
    {
        "A Rose for Ecclesiastes": "a rose for ecclesiastes"
    },
    {
        " , was published in the last months of his life.     Bok and ": null
    },
    {
        "Ed Emshwiller": "ed emshwiller"
    },
    {
        " shared one of the inaugural ": null
    },
    {
        "Hugo Awards": "hugo awards"
    },
    {
        " for science fiction achievement in 42 as the previous years best Cover Artist ; ": null
    },
    {
        "Virgil Finlay": "virgil finlay"
    },
    {
        " was recognized as the best Interior Illustrator . Cover and interior illustration were not thereafter distinguished by the ": null
    },
    {
        "Hugo Award for Best Artist": "hugo award for best artist"
    },
    {
        " under various names.         The science fiction and fantasy author ": null
    },
    {
        "Emil Petaja": "emil petaja"
    },
    {
        " was lifelong friend of Bok and collector of his work. After Boks death, Petaja did as much as anyone to keep the artists work before the public eye.     Bok and Petaja first met in the summer of 42 According to Petaja, Bok and his friend Harold Taves were hitch-hiking from Seattle to New York City when they stopped off in ": null
    },
    {
        "Montana, USA": "montana"
    },
    {
        ", to see the aspiring writer. At first correspondents, Bok and Petaja soon became close friends. The two had much in common – including an interest in fantasy fiction, the ": null
    },
    {
        "Kalevala": "kalevala"
    },
    {
        " , and the music of Sibelius.     Petajas first book, Brief Candle , contained twelve poems by Petaja and twelve illustrations by Bok. Petaja printed this now rare chapbook by running-off copies on the mimeograph machines at ": null
    },
    {
        "Bozeman Campus, Montana State University": "bozeman campus, montana state university, usa"
    },
    {
        ", where he was a student in creative writing. According to Petaja, approximately 42 to 42 copies were printed with many given to friends and well wishers.     Bok and Petajas friendship continued in Los Angeles, where each had relocated in 42 Throughout 42 and 42 Petaja and Bok shared an apartment, and together they attended fan meetings, haunted second-hand book and magazine shops, went to the movies, and helped each other with their poems and stories. They also immersed themselves in the primordial Los Angeles science fiction scene. Bok and Petaja befriended Ray Bradbury – then still a teenager – as well as Forrest J. Ackerman, ": null
    },
    {
        "Henry Kuttner": "henry kuttner"
    },
    {
        " and others.        In And Flights of Angels, Petaja recounts: Perhaps when all is washed down over the dam, my major claim to fame will rest in the fact that it was I who got Hannes down to Los Angeles and I who dragged him, reluctantly, to the meetings of the Los Angeles Science Fiction Society. Where we met Ray Bradbury. . . . It was at Cliftons Cafeteria on Broadway. We couldnt afford to eat there, usually, but we took advantage of the free lime sherbet. In that fabled back room where so many of the s-f elite have sat around the long table chewing the fat, fanwize, Hannes first met Forrie Ackerman, Henry Kuttner, et al. But it was Ray Bradbury who took to Hannes instanter and proved to be such a rare and wonderful friend to him a little later on.     Besides introducing Hannes to Ray Bradbury, I take pride in the fact that this brief Los Angeles period of Boks life was one of the most productive of his life. He produced a dozen color paintings based on ": null
    },
    {
        "Peer Gynt": "peer gynt"
    },
    {
        ", as samples to show book publishers what he could do. He painted The Mermaid and several Enchanted City themes. He wrote scads of poetry. All of which does indicate that, for all his beefs, he was happy then. He might lash out cruelly about this or that, but nobody I have known had as great a capacity for enjoying and sensating all there was around him.     In 42 three years after Boks death, Petaja founded the Bokanalia Memorial Foundation. The foundation was set up with the help and encouragement of Harold Taves of Seattle and Ray Bradbury of Los Angeles and the Golden Gate Futurians of San Francisco . . . . The avowed intention of Bokanalia is simply to keep the great imaginative art of Hannes Bok from slipping into oblivion, and to make new prints available to his many admirers all over the world .     Between 42 and 42 Petaja published five portfolios of Boks art. Those portfolios include Variations on Bok Theme, ; The Famous Power Series, ; and A Memorial Portfolio, . Petaja also authored a commemorative volume, And Flights of Angels: The Life and Legend of Hannes Bok . Along with brief contributions from ": null
    },
    {
        "Roger Zelazny": "roger zelazny"
    },
    {
        ", ": null
    },
    {
        "Jack Gaughan": "jack gaughan"
    },
    {
        ", ": null
    },
    {
        "Donald Wollheim": "donald wollheim"
    },
    {
        " and others, And Flights of Angels contains Petajas long biographical essay on the artist, a checklist of Boks published artwork and writings, and reproductions of a substantial number of the artists drawings, prints and illustrations. Later, under the SISU imprint , Petaja published an illustrated volume of Boks poetry, Spinner of Silver and Thistle , as well as editing The Hannes Bok Memorial Showcase of Fantasy Art .     Much of the Bok material included in the portfolios and books published and authored by Petaja came from Petajas personal collection. Petaja owned at least a dozen paintings, as well as dozens of sketches, drawings, prints and three-dimensional objects. Among Petajas most beloved possessions was the first sketch Bok ever drew for him, a piece from 42 called Gleef, which hung on the wall of Petajas ": null
    },
    {
        "San Francisco": "san francisco"
    }
]