[
    {
        "      Hannibal Hamlin was an American attorney and politician from the state of ": null
    },
    {
        "Maine": "maine"
    },
    {
        ". In a public service career that spanned over 50 years, he served as the 15th ": null
    },
    {
        "vice president of the United States": "vice president of the united states"
    },
    {
        ". The first ": null
    },
    {
        "Republican": "republican party"
    },
    {
        " to hold the office, Hamlin served from 1861 to 1865. He is considered among the most influential politicians to have come from Maine.     A native of ": null
    },
    {
        "Paris, Maine": "paris, maine"
    },
    {
        " , Hamlin managed his fathers farm before becoming a newspaper editor. He studied law, was admitted to the bar in 1833, and began to practice in ": null
    },
    {
        "Hampden, Maine": "hampden, maine"
    },
    {
        ". Originally a ": null
    },
    {
        "Democrat": "democratic party"
    },
    {
        ", Hamlin began his political career with election to the Maine House of Representatives in 1835 and an appointment to the military staff of the ": null
    },
    {
        "Governor of Maine": "governor of maine"
    },
    {
        ". As an officer in the militia, he took part in the 1839 negotiations that helped end the ": null
    },
    {
        "Aroostook War": "aroostook war"
    },
    {
        ". In the 1840s Hamlin was elected and served in the ": null
    },
    {
        "United States House of Representatives": "united states house of representatives"
    },
    {
        ". In 1848 the state house elected him to the ": null
    },
    {
        "United States Senate": "united states senate"
    },
    {
        ", where he served until January 1857. He served temporarily as governor for six weeks in the beginning of 1857, after which he returned to the Senate. Hamlin was an active opponent of slavery; he supported the ": null
    },
    {
        "Wilmot Proviso": "wilmot proviso"
    },
    {
        " and opposed the ": null
    },
    {
        "Compromise Measures of 1850": "compromise measures of 1850"
    },
    {
        ". In 1854, he strongly opposed passage of the ": null
    },
    {
        "Kansas–Nebraska Act": "kansas–nebraska act"
    },
    {
        ". Hamlins increasingly anti-slavery views caused him to leave the Democratic Party for the newly formed Republican Party in 1856.     In 1860, Hamlin was the Republican nominee for Vice President; selected to run with ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        ", who was from Illinois, Hamlin was chosen in part to bring geographic balance to the ticket and in part because as a former Democrat, he could work to convince other anti-slavery Democrats that their future lay with the Republican Party. The Lincoln and Hamlin ticket was successful, and Hamlin served as Vice President from 1861 to 1865, which included all but the last month of the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ". The first Republican Vice President, Hamlin held the office in an era when the office was considered more a part of the legislative branch than the executive; he was not personally close to Lincoln and did not play a major role in his administration. Even so, Hamlin supported the administrations legislative program in his role as presiding officer of the Senate, and he looked for other ways to demonstrate his support for the Union, including a term of service in a ": null
    },
    {
        "Maine militia unit": "maine state guard"
    },
    {
        " during the war.     For the 1864 election, Hamlin was replaced as Vice Presidential nominee by ": null
    },
    {
        "Andrew Johnson": "andrew johnson"
    },
    {
        ", a ": null
    },
    {
        "Southern Democrat": "southern democrat"
    },
    {
        " chosen for his appeal to ": null
    },
    {
        "Southern Unionists": "southern unionists"
    },
    {
        ". After leaving the vice presidency, Hamlin served as ": null
    },
    {
        "Collector": "boston custom house"
    },
    {
        " of the ": null
    },
    {
        "Port of Boston": "port of boston"
    },
    {
        ", a lucrative post to which he was appointed by Johnson after the latter succeeded to the presidency following Lincolns assassination. However, Hamlin later resigned as Collector because of his disagreement with Johnson over ": null
    },
    {
        "Reconstruction": "reconstruction era"
    },
    {
        " of the former Confederacy.     In 1869, Hamlin was elected again to the U.S. Senate, and he served two terms. After leaving the Senate in 1881, he served briefly as ": null
    },
    {
        "United States Ambassador to Spain": "united states ambassador to spain"
    },
    {
        " before returning to Maine in late 1882. In retirement, Hamlin was a resident of ": null
    },
    {
        "Bangor, Maine": "bangor, maine"
    },
    {
        ", where he died in 1891. He was buried at ": null
    },
    {
        "Mount Hope Cemetery": "mount hope cemetery"
    },
    {
        " in Bangor.            Hamlin was born to Cyrus Hamlin and his wife Anna, née Livermore, in ": null
    },
    {
        "Paris": "paris, maine"
    },
    {
        " . He was a descendant in the sixth generation of English colonist James Hamlin, who had settled in the ": null
    },
    {
        "Massachusetts Bay Colony": "massachusetts bay colony"
    },
    {
        " in 1639. He was a grandnephew of U.S. Senator ": null
    },
    {
        "Samuel Livermore": "samuel livermore"
    },
    {
        " II  of New Hampshire.     Hamlin attended the district schools and ": null
    },
    {
        "Hebron Academy": "hebron academy"
    },
    {
        " and later managed his fathers farm. From 1827 to 1830 he published the Oxford Jeffersonian newspaper in partnership with ": null
    },
    {
        "Horatio King": "horatio king"
    },
    {
        ".      He studied law with the firm headed by ": null
    },
    {
        "Samuel Fessenden": "samuel fessenden"
    },
    {
        ",  was admitted to the bar in 1833, and began practicing in ": null
    },
    {
        "Hampden, Maine": "hampden, maine"
    },
    {
        ", where he lived until 1848.          Hamlin married Sarah Jane Emery of Paris Hill in 1833. Her father was ": null
    },
    {
        "Stephen Emery": "maine attorney general"
    },
    {
        ", who was appointed as Maines Attorney General in 1839–1840.  Hamlin and Sarah had four children together: George, Charles, Cyrus and Sarah.     His wife died in 1855. The next year, Hamlin married her half-sister, ": null
    },
    {
        "Ellen Vesta Emery": "ellen vesta emery"
    },
    {
        " in 1856. They had two children together: Hannibal E. and Frank. Ellen Hamlin died in 1925.        Hamlins political career began in 1835, when he was elected to the ": null
    },
    {
        "Maine House of Representatives": "maine house of representatives"
    },
    {
        ". Appointed a ": null
    },
    {
        "Major": "major"
    },
    {
        " on the staff of Governor ": null
    },
    {
        "John Fairfield": "john fairfield"
    },
    {
        ", he served with the militia in the bloodless ": null
    },
    {
        "Aroostook War": "aroostook war"
    },
    {
        " of 1839. He facilitated negotiations between Fairfield and Lieutenant Governor ": null
    },
    {
        "John Harvey": "john harvey"
    },
    {
        " of ": null
    },
    {
        "New Brunswick": "new brunswick"
    },
    {
        ", which helped reduce tensions and make possible the ": null
    },
    {
        "Webster–Ashburton Treaty": "webster–ashburton treaty"
    },
    {
        ", which ended the war.     Hamlin unsuccessfully ran for the ": null
    },
    {
        "United States House of Representatives": "united states house of representatives"
    },
    {
        " in 1840 and left the State House in 1841. He later was elected to two terms in the ": null
    },
    {
        "United States House of Representatives": "united states house of representatives"
    },
    {
        ", serving from 1843 to 1847. He was elected by the state legislature to fill a ": null
    },
    {
        "U.S. Senate": "u.s. senate"
    },
    {
        " vacancy in 1848, and to a full term in 1851. A ": null
    },
    {
        "Democrat": "democratic party"
    },
    {
        " at the beginning of his career, Hamlin supported the candidacy of ": null
    },
    {
        "Franklin Pierce": "franklin pierce"
    },
    {
        " in 1852.     From the very beginning of his service in Congress, Hamlin was prominent as an opponent of the extension of slavery. He was a conspicuous supporter of the ": null
    },
    {
        "Wilmot Proviso": "wilmot proviso"
    },
    {
        " and spoke against the ": null
    },
    {
        "Compromise Measures of 1850": "compromise measures of 1850"
    },
    {
        ". In 1854, Hamlin strongly opposed the passage of the ": null
    },
    {
        "Kansas–Nebraska Act": "kansas–nebraska act"
    },
    {
        ", which repealed the ": null
    },
    {
        "Missouri Compromise": "missouri compromise"
    },
    {
        ". After the ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " endorsed that repeal at the ": null
    },
    {
        "1856 Democratic National Convention": "1856 democratic national convention"
    },
    {
        ", on June 12, 1856, he withdrew from the Democratic Party and joined the newly organized ": null
    },
    {
        "Republican Party": "history of the united states republican party"
    },
    {
        ", causing a national sensation.     The Republicans nominated Hamlin for ": null
    },
    {
        "Governor of Maine": "governor of maine"
    },
    {
        " in the same year. He carried the election by a large majority and was inaugurated on January 8, 1857. In the latter part of February 1857, however, he resigned the governorship. He returned to the ": null
    },
    {
        "United States Senate": "united states senate"
    },
    {
        ", serving from 1857 to January 1861.            Hamlin was nominated by the Republican Party to serve as ": null
    },
    {
        "Vice President of the United States": "vice president of the united states"
    },
    {
        " in the ": null
    },
    {
        "1860 presidential election": "1860 united states presidential election"
    },
    {
        " on a ticket with former Representative ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        ".  Given that Lincoln was from Illinois, a vice presidential nominee from ": null
    },
    {
        "Maine": "maine"
    },
    {
        " made sense in terms of regional balance. As a former Democrat, Hamlin could persuade other anti-slavery Democrats that joining the Republican Party was the only way to ensure slaverys demise.     Hamlin and Lincoln were not close personally but had a good working relationship. At the time, the Vice President was part of the legislative branch in his role as President of the Senate and did not attend cabinet meetings; Hamlin did not regularly visit the White House. ": null
    },
    {
        "Mary Todd Lincoln": "mary todd lincoln"
    },
    {
        " and Hamlin disliked each other. For his part, Hamlin complained, I am only a fifth wheel of a coach and can do little for my friends.      He had little influence in the Lincoln Administration, although he urged both the ": null
    },
    {
        "Emancipation Proclamation": "emancipation proclamation"
    },
    {
        "  and the arming of ": null
    },
    {
        "Black Americans": "black americans"
    },
    {
        ".  He strongly supported ": null
    },
    {
        "Joseph Hookers": "joseph hooker"
    },
    {
        "appointment as commander of the ": null
    },
    {
        "Army of the Potomac": "army of the potomac"
    },
    {
        ",  which ended in failure at the ": null
    },
    {
        "Battle of Chancellorsville": "battle of chancellorsville"
    },
    {
        ".      Beginning in 1860, Hamlin was a member of Company A of the ": null
    },
    {
        "Maine State Guard": "maine state guard"
    },
    {
        ", a ": null
    },
    {
        "militia": "militia"
    },
    {
        " unit.  When the company was called up in the summer of 1864, Hamlin was told that because of his position as Vice President, he did not have to take part in the muster. He opted to serve, arguing that he could set an example by doing the duty expected of any citizen, and the only concession made because of his office was that he was quartered with the officers. He reported to ": null
    },
    {
        "Fort McClary": "fort mcclary"
    },
    {
        " in July, initially taking part in routine assignments including guard duty, and later taking over as the company cook. He was promoted to ": null
    },
    {
        "corporal": "corporalunited states"
    },
    {
        " during his service, and mustered out with the rest of his unit in mid-September.       In June 1864, the Republicans and ": null
    },
    {
        "War Democrats": "war democrat"
    },
    {
        "joined to form the ": null
    },
    {
        "National Union Party": "national union party"
    },
    {
        ". Although Lincoln was renominated, War Democrat ": null
    },
    {
        "Andrew Johnson": "andrew johnson"
    },
    {
        " of Tennessee was named to replace Hamlin as Lincolns running mate. Lincoln was seeking to broaden his base of support and was also looking ahead to Southern ": null
    },
    {
        "Reconstruction": "reconstruction era of the united states"
    },
    {
        ", at which Johnson had proven himself adept as military governor of occupied Tennessee. Hamlin, by contrast, was an ally of the Northern ": null
    },
    {
        "Radical Republicans": "radical republicans"
    },
    {
        " . Lincoln and Johnson were elected in November 1864, and Hamlins term expired on March 4, 1865.     After leaving the vice presidency Hamlin served briefly as ": null
    },
    {
        "Collector": "boston custom house"
    },
    {
        " of the ": null
    },
    {
        "Port of Boston": "port of boston"
    },
    {
        ". Appointed to the post by Johnson, Hamlin resigned in protest over Johnsons ": null
    },
    {
        "Reconstruction": "reconstruction era"
    },
    {
        " policy and accompanying efforts to build a political following loyal to him after he had been repudiated by the Republicans. Republicans had supported Johnson as part of the National Union ticket during the war, but opposed him after he became President and his position on Reconstruction deviated from theirs.      Although Hamlin narrowly missed becoming President, his vice presidency would usher in a half-century of sustained national influence for the ": null
    },
    {
        "Maine Republican Party": "maine republican party"
    },
    {
        ". In the period 1861–1911, Maine Republicans occupied the offices of Vice President, ": null
    },
    {
        "Secretary of the Treasury": "united states secretary of the treasury"
    },
    {
        " , ": null
    },
    {
        "Secretary of State": "united states secretary of state"
    },
    {
        ", ": null
    },
    {
        "President pro tempore of the United States Senate": "president pro tempore of the united states senate"
    },
    {
        ", ": null
    },
    {
        "Speaker of the United States House of Representatives": "speaker of the united states house of representatives"
    },
    {
        " , and would field a presidential nominee in ": null
    },
    {
        "James G. Blaine": "james g. blaine"
    },
    {
        ", a level of influence in national politics unmatched by subsequent Maine political delegations.       Not content with private life, Hamlin returned to the U.S. Senate in 1869 to serve two more 6-year terms before declining to run for re-election in 1880 because of an ailing heart. His last duty as a public servant came in 1881 when ": null
    },
    {
        "Secretary of State": "united states secretary of state"
    },
    {
        " James G. Blaine": "james g. blaine"
    },
    {
        " convinced President ": null
    },
    {
        "James A. Garfield": "james a. garfield"
    },
    {
        " to name Hamlin as ": null
    },
    {
        "United States Ambassador to Spain": "united states ambassador to spain"
    },
    {
        ". Hamlin received the appointment on June 30, 1881, and held the post until October 17, 1882.     Upon returning from Spain, Hamlin retired from public life to his home in ": null
    },
    {
        "Bangor, Maine": "bangor, maine"
    },
    {
        ", which he had purchased in 1851. The ": null
    },
    {
        "Hannibal Hamlin House": "hannibal hamlin house"
    },
    {
        " – as it is known today – is located in central Bangor at 15 5th Street; incorporating ": null
    },
    {
        "Victorian": "victorian architecture"
    },
    {
        ", ": null
    },
    {
        "Italianate": "italianate architecture"
    },
    {
        ", and ": null
    },
    {
        "Mansard": "mansard roof"
    },
    {
        "-style architecture, the mansion was posted to the ": null
    },
    {
        "National Register of Historic Places": "national register of historic places"
    },
    {
        " in 1979.      Hamlin was elected as a Third Class Companion of the ": null
    },
    {
        "Military Order of the Loyal Legion of the United States": "military order of the loyal legion of the united states"
    },
    {
        ". Third Class was the MOLLUS division created to recognize civilians who had contributed outstanding service to the Union during the war.         On ": null
    },
    {
        "Independence Day": "independence day"
    },
    {
        ", July 4, 1891, Hamlin collapsed and fell unconscious while playing cards at the Tarratine Club he founded in downtown Bangor. He was then placed on one of the clubs couches and died a few hours later. He was 81. The couch is preserved at the ": null
    },
    {
        "Bangor Public Library": "bangor public library"
    },
    {
        ".  Hannibal Hamlin was buried in the Hamlin family plot at ": null
    },
    {
        "Mount Hope Cemetery": "mount hope cemetery"
    },
    {
        " in ": null
    },
    {
        "Bangor, Maine": "bangor, maine"
    },
    {
        ". Hamlin survived six of his successors in the vice presidency: ": null
    },
    {
        "Andrew Johnson": "andrew johnson"
    },
    {
        ", ": null
    },
    {
        "Schuyler Colfax": "schuyler colfax"
    },
    {
        ", ": null
    },
    {
        "Henry Wilson": "henry wilson"
    },
    {
        ", ": null
    },
    {
        "William A. Wheeler": "william a. wheeler"
    },
    {
        ", ": null
    },
    {
        "Chester A. Arthur": "chester a. arthur"
    },
    {
        ", and ": null
    },
    {
        "Thomas A. Hendricks": "thomas a. hendricks"
    },
    {
        ".       Hamlin had four sons who grew to adulthood: ": null
    },
    {
        "Charles Hamlin": "charles hamlin"
    },
    {
        ", ": null
    },
    {
        "Cyrus Hamlin": "cyrus hamlin"
    },
    {
        ", ": null
    },
    {
        "Hannibal Emery": "hannibal e. hamlin"
    },
    {
        " and Frank Hamlin. Charles and Cyrus served in the Union forces during the ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        ", both becoming generals, Charles by ": null
    },
    {
        "brevet": "brevet"
    },
    {
        ". Cyrus was among the first Union officers to argue for the enlistment of black troops, and himself commanded a brigade of freedmen in the Mississippi River campaign. Charles and sister Sarah were present at ": null
    },
    {
        "Fords Theater": "fords theater"
    },
    {
        " the night of ": null
    },
    {
        "Lincolns assassination": "abraham lincoln assassination"
    },
    {
        ". Hannibal Emery Hamlin was ": null
    },
    {
        "Maine Attorney General": "maine attorney general"
    },
    {
        " from 1905 to 1908. Hannibal Hamlins great-granddaughter ": null
    },
    {
        "Sally Hamlin": "sally hamlin"
    },
    {
        " was a child actor who made many ": null
    },
    {
        "spoken word": "spoken word"
    },
    {
        " recordings for the ": null
    },
    {
        "Victor Talking Machine Company": "victor talking machine company"
    },
    {
        " in the early years of the 20th century.     Hannibals older brother, Elijah Livermore Hamlin, was president of the Mutual Fire Insurance Co. of Bangor, and the Bangor Institution for Savings. Augustus C. Smith, Bangor, Brewer, and Penobscot Co. Directory, 1859–60 He was twice an unsuccessful candidate for ": null
    },
    {
        "Governor of Maine": "governor of maine"
    },
    {
        " in the late 1840s, though he did serve as Mayor of Bangor in 1851–52. The brothers were members of different political parties before both becoming Republican in the later 1850s.      Hannibals nephew Augustus Choate Hamlin was a physician, artist, mineralogist, author, and historian. He was also Mayor of Bangor in 1877–78, and a founding member of the Bangor Historical Society.      Augustus served as surgeon in the ": null
    },
    {
        "2nd Maine Volunteer Infantry Regiment": "2nd maine volunteer infantry regiment"
    },
    {
        " during the Civil War, eventually becoming a U.S. Army Medical Inspector, and later the Surgeon General of Maine. He wrote books about ": null
    },
    {
        "Andersonville Prison": "andersonville prison"
    },
    {
        " and the ": null
    },
    {
        "Battle of Chancellorsville": "battle of chancellorsville"
    },
    {
        ".  Hannibals grand-nephew Isaiah K. Stetson was Speaker of the ": null
    },
    {
        "Maine House of Representatives": "maine house of representatives"
    },
    {
        " in 1899–1900,  and owned a large company in Bangor which manufactured and shipped lumber and ice and ran a shipyard and marine railway.      Hannibals first cousin ": null
    },
    {
        "Cyrus Hamlin": "cyrus hamlin"
    },
    {
        ", who was a graduate of the ": null
    },
    {
        "Bangor Theological Seminary": "bangor theological seminary"
    },
    {
        ", became a missionary in Turkey, where he founded ": null
    },
    {
        "Robert College": "robert college"
    },
    {
        ". He later became president of ": null
    },
    {
        "Middlebury College": "middlebury college"
    },
    {
        " in Vermont. His son, ": null
    },
    {
        "A. D. F. Hamlin": "alfred dwight foster hamlin"
    },
    {
        ", Hannibals first cousin once removed, became a professor of architecture at ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        " and a noted architectural historian. There are biographies of Hamlin by his grandson Charles E. Hamlin and by H. Draper Hunt             ": null
    },
    {
        "Hamlin County, South Dakota": "hamlin county, south dakota"
    },
    {
        " is named in his honor, as are ": null
    },
    {
        "Hamlin, Kansas": "hamlin, kansas"
    },
    {
        "; ": null
    },
    {
        "Hamlin, New York": "hamlin, new york"
    },
    {
        "; ": null
    },
    {
        "Hamlin, West Virginia": "hamlin, west virginia"
    },
    {
        "; ": null
    },
    {
        "Hamlin Township": "hamlin township, mason county, michigan"
    },
    {
        "; ": null
    },
    {
        "Hamlin Lake": "hamlin lake"
    },
    {
        " in ": null
    },
    {
        "Mason County, Michigan": "mason county, michigan"
    },
    {
        "; and, ": null
    },
    {
        "Hamlin": "hamlin, maine"
    },
    {
        ", a small Maine village that is a U.S.–Canada border crossing with ": null
    },
    {
        "Grand Falls, New Brunswick": "grand falls, new brunswick"
    },
    {
        ". There are statues in Hamlins likeness in the ": null
    },
    {
        "United States Capitol": "united states capitol"
    },
    {
        " and in a public park  in Bangor, Maine.     There is also a building on the ": null
    },
    {
        "University of Maine": "university of maine"
    },
    {
        " Campus, in ": null
    },
    {
        "Orono": "orono, maine"
    },
    {
        ", named Hannibal Hamlin Hall. This burned down in 1945, in a fire that killed two students, but was subsequently rebuilt. Hannibal Hamlin Memorial Library is next to his birthplace in ": null
    },
    {
        "Paris, Maine": "paris, maine"
    },
    {
        ".     The Hampden Maine Historical Society exhibit a restoration of his first law office at their Kinsley House Museum grounds.     ": null
    },
    {
        "Hamlins house": "hannibal hamlin house"
    },
    {
        " in ": null
    },
    {
        "Bangor": "bangor, maine"
    },
    {
        " subsequently housed the Presidents of the adjacent ": null
    },
    {
        "Bangor Theological Seminary": "bangor theological seminary"
    },
    {
        ". It is listed on the ": null
    },
    {
        "National Register of Historic Places": "national register of historic places"
    },
    {
        ", as is Hamlins birthplace in ": null
    },
    {
        "Paris, Maine": "paris, maine"
    },
    {
        " .     Hamlin Park in Chicago is named in his honor.        Hamlin appears briefly in three ": null
    },
    {
        "alternate history": "alternate history"
    },
    {
        " writings by ": null
    },
    {
        "Harry Turtledove": "harry turtledove"
    },
    {
        ":  The Guns of the South ,  Must and Shall , and  How Few Remain .       Fallout 3 ": null
    }
]