[
    {
        "            Hanover Region  is a ": null
    },
    {
        "district": "districts of germany"
    },
    {
        " in ": null
    },
    {
        "Lower Saxony": "lower saxony"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". It is bounded by the districts of ": null
    },
    {
        "Heidekreis": "heidekreis"
    },
    {
        ", ": null
    },
    {
        "Celle": "celle"
    },
    {
        ", ": null
    },
    {
        "Gifhorn": "gifhorn"
    },
    {
        ", ": null
    },
    {
        "Peine": "peine"
    },
    {
        ", ": null
    },
    {
        "Hildesheim": "hildesheim"
    },
    {
        ", ": null
    },
    {
        "Hamelin-Pyrmont": "hamelin-pyrmont"
    },
    {
        ", ": null
    },
    {
        "Schaumburg": "schaumburg"
    },
    {
        " and ": null
    },
    {
        "Nienburg": "nienburg"
    },
    {
        ".     The District of Hanover has a unique legal status among the districts of Lower Saxony. It includes the City of ": null
    },
    {
        "Hanover": "hanover"
    },
    {
        ", the state capital, which has the same privileges as a city that is not part of a district. As a consequence, the District is much larger in population than any other district of the state. Its administrative body is the Regionsparlament , headed by the Regionspräsident or region president . The members of the Regionsparlament are elected once every five years and the Regionspräsident is elected once every eight years in local elections.       The City of Hanover was not part of the district until 42 when the old Hanover District and the city  were merged in order to form the new Region Hannover district .     During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Hanover was the Headquarters of the Military District XI, which was responsible for ": null
    },
    {
        "Braunschweig": "braunschweig"
    },
    {
        ", ": null
    },
    {
        "Anhalt": "anhalt"
    },
    {
        ", and part of Hanover. It was also the Garrison Town for the  42 Infanterie Division .       The district surrounds the City of Hanover and includes the outskirts of its metropolitan area. The ": null
    },
    {
        "Leine": "leine"
    },
    {
        " river enters the district in the south, runs through Hanover and leaves to the north. In the northwest is the ": null
    },
    {
        "Steinhuder Meer": "steinhuder meer"
    },
    {
        ", a lake with an area of 42  km², within the region known as the ": null
    },
    {
        "Hanoverian Moor Geest": "hanoverian moor geest"
    },
    {
        ".       The coat of arms was granted on May 42 42 The cloverleaf is from the arms of the City of Hanover. The lion was the heraldic animal of the ": null
    },
    {
        "Welfen": "welfen"
    },
    {
        " family, which ruled the region from the Middle Ages until 42                   ": null
    }
]