[
    {
        "   Haoma  is a divine plant in ": null
    },
    {
        "Zoroastrianism": "zoroastrianism"
    },
    {
        " and in later Persian culture and ": null
    },
    {
        "mythology": "persian mythology"
    },
    {
        ". Haoma has its origins in Indo-Iranian religion and is the cognate of ": null
    },
    {
        "Vedic": "vedas"
    },
    {
        "  soma .       Both Avestan haoma and ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        "  soma  derived from ": null
    },
    {
        "proto-Indo-Iranian": "proto-indo-iranian language"
    },
    {
        " sauma. The linguistic root of the word haoma, hu-, and of soma, su-, suggests press or pound.   The ": null
    },
    {
        "Middle Persian": "middle persian"
    },
    {
        " form of the name is 𐭧𐭥𐭬 hōm, which continues to be the name in Modern ": null
    },
    {
        "Persian": "persian language"
    },
    {
        ", ": null
    },
    {
        "Pashto": "pashto language"
    },
    {
        " and other living Iranian languages .         The physical attributes, as described in the texts of the ": null
    },
    {
        "Avesta": "avesta"
    },
    {
        ", include:   the plant has stems, roots and branches .   it has a plant asu . The term asu is only used in conjunction with a description of haoma, and does not have an established translation. It refers to twigs according to Dieter Taillieu, stalk according to Robert Wasson, fibre or flesh according to Ilya Gershevitch, sprouts according to ": null
    },
    {
        "Lawrence Heyworth Mills": "lawrence heyworth mills"
    },
    {
        ".   it is tall    it is fragrant    it is golden-green    it can be pressed    it grows on the mountains, swiftly spreading, apart on many paths  to the gorges and abysses  and on the ranges      The indirect attributes include:   it furthers healing    it furthers sexual arousal    it is physically strengthening    it stimulates alertness and awareness    the mildly intoxicating extract can be consumed without negative side effects .   it is nourishing  and most nutritious for the soul .       Many of the physical attributes as described in the texts of the Avesta match the plant used in present-day Zoroastrian practice. In present-day preparation of parahaoma , ...   the twigs are repeatedly pounded in the presence of a little water, which suggests ancient haoma was also water-soluble.   the twigs have to be imported by Indian-Zoroastrians, who believe that they are, for climatic reasons, not obtainable on the Indian subcontinent.   very small quantities are produced.     According to Falk, ": null
    },
    {
        "Parsi": "parsi people"
    },
    {
        "-Zoroastrians use a variant of ": null
    },
    {
        "ephedra": "ephedra"
    },
    {
        ", usually Ephedra procera, imported from the ": null
    },
    {
        "Hari River": "hari river, afghanistan"
    },
    {
        " valley in Afghanistan.     In March 42 the Grand Ayatollah Rohani from Iran issued a formal legal ruling  determining the use of ": null
    },
    {
        "entheogen": "entheogen"
    },
    {
        "s and psychoactive substances to be licit and thus permissible  for ": null
    },
    {
        "Shi’i": "shia islam"
    },
    {
        " Muslims provided it be under the direction and supervision of qualified experts , and that, moreover, such plant substances as a rule do not impair the mind.              Since the late 42th century, when ": null
    },
    {
        "Anquetil-Duperron": "anquetil-duperron"
    },
    {
        " and others made portions of the Avesta available to western scholarship, several scholars have sought a representative botanical equivalent of the haoma as described in the texts and as used in living Zoroastrian practice. Most of the proposals concentrated on either linguistic evidence or comparative pharmacology or reflected ritual use. Rarely were all three considered together, which usually resulted in such proposals being quickly rejected.        In the late 42th century, the highly conservative Zoroastrians of ": null
    },
    {
        "Yazd": "yazd"
    },
    {
        " were found to use ": null
    },
    {
        "genus Ephedra": "ephedra"
    },
    {
        ", which was locally known as hum or homa and which they exported to the Indian Zoroastrians. The plant, as Falk also established, requires a cool and dry climate, i.e. it does not grow in India but thrives in central Asia. Later, it was discovered that a number of ": null
    },
    {
        "Iranian languages": "iranian languages"
    },
    {
        " and Persian dialects have hom or similar terms as the local name for some variant of Ephedra. Considered together, the linguistic and ritual evidence appeared to conclusively establish that haoma was some variant of Ephedra.     In the latter half of the 42th century, several studies attempted to establish haoma as a ": null
    },
    {
        "psychotropic": "psychotropic"
    },
    {
        " substance, and based their arguments on the assumption that proto-Indo-Iranian sauma was a ": null
    },
    {
        "hallucinogen": "hallucinogen"
    },
    {
        ". This assumption, which invariably relied on professed Vedic evidence , was, as Falk and Houben would later establish, not supported by either the texts or by the observation of living practice. Moreover, the references to ": null
    },
    {
        "entheogen": "entheogen"
    },
    {
        "ic properties were only in conjunction with a fermentation of the plant extract, which does not have enough time to occur in living custom.     In the conclusion of his observations on a 42 Haoma-Soma workshop in Leiden, Jan E. M. Houben writes: despite strong attempts to do away with Ephedra by those who are eager to see sauma as a hallucinogen, its status as a serious candidate for the Rigvedic Soma and Avestan Haoma still stands . This supports Falk, who in his summary noted that there is no need to look for a plant other than Ephedra, the one plant used to this day by the ": null
    },
    {
        "Parsis": "parsi people"
    },
    {
        ".          The ": null
    },
    {
        "Yazata": "yazata"
    },
    {
        " Haoma, also known by the middle Persian name Hōm Yazad, is the epitome of the quintessence of the haoma plant, venerated in the Hōm Yašt, the hymns of Yasna 4242     In those hymns, Haoma is said to appear before Zoroaster in the form of Dūraoša,  a beautiful man , who prompts him to gather and press haoma for the purification of the waters . Haoma is righteous and furthers righteousness, is wise and gives insight . Haoma was the first priest, installed by ": null
    },
    {
        "Ahura Mazda": "ahura mazda"
    },
    {
        " with the sacred girdle aiwiyanghana  and serves the ": null
    },
    {
        "Amesha Spenta": "amesha spenta"
    },
    {
        "s in this capacity . Golden-green eyed Haoma was the first to offer up haoma, with a star-adorned, spirit-fashioned mortar, and is the guardian of mountain plants upon the highest mountain peak.      Haoma is associated with the ": null
    },
    {
        "Amesha Spenta": "amesha spenta"
    },
    {
        " Vohu Manah , the guardian of all animal creation. Haoma is the only divinity with a Yasht who is not also represented by a day-name dedication in the ": null
    },
    {
        "Zoroastrian calendar": "zoroastrian calendar"
    },
    {
        ". Without such a dedication, Haoma has ceased to be of any great importance within the Zoroastrian hierarchy of angels.           The Haoma plant is a central element in the legend surrounding the conception of ": null
    },
    {
        "Zoroaster": "zoroaster"
    },
    {
        ".   In the story, his father Pouroshaspa took a piece of the Haoma plant and mixed it with milk. He gave his wife Dugdhova one half of the mixture and he consumed the other. They then conceived Zoroaster who was instilled with the spirit of the plant.     According to tradition, Zoroaster received his revelation on a riverbank while preparing parahaoma for the ": null
    },
    {
        "Ab-Zohr": "ab-zohr"
    },
    {
        " , that is, for the symbolic purification of  Aban  . This symbolic purification is also evident in Yasna 42, where the celebrant makes good for the damage done to water by humanity: These offerings, possessing haoma, possessing milk, possessing pomegranate, shall compensate thee .     barsombarsom  bundle of twigs was originally a bundle of Haoma stalks. The Haoma divinity is identified with priesthood , while the barsom stalks cut for the bundles bound by women  is the symbol and an instrument of Zoroastrian priests. Today the barsom is made from pomegranate twigs .     Shahnameh ": null
    },
    {
        "Ferdowsis": "ferdowsi"
    },
    {
        "  Shahnameh , which incorporates stories from the Avesta , Hom appears as a hermit, dweller of the mountains, incredibly strong. He binds Afrasiab  with the sacred girdle, and drags him from deep within the earth  where Afrasaib has his metal-encircled kingdom that is immune to mortal attack.     In another episode, Vivaŋhat is the first of the humans to press haoma, for which Hom rewards him with a son, ": null
    },
    {
        "Jamshid": "jamshid"
    },
    {
        ". Yasna 4242 has ": null
    },
    {
        "Zoroaster": "zoroaster"
    },
    {
        " asking the divinity who prepared haoma and for what reward, to which Haoma recalls Vivahngvant to whom Yima Xshaeta  is born; Athwya to whom Thraetaona is born; and Thrita to whom Urvaxshaya and Keresaspa are born. The latter two are also characters in priestly heroic tradition, and among conservative Zoroastrians of the hereditary priesthood, Haoma is still prayed to by those wanting children .   The account given in the Indian Vedas closely agrees with that of the Iranian Avesta. The first preparers of Soma are listed as Vivasvat, who is the father of Yama and Manu, and Trita Aptya.       ": null
    },
    {
        "James Darmesteter": "james darmesteter"
    },
    {
        ", in his 42 thesis on the mythology of the Avesta, speculating on the ": null
    },
    {
        "Parsi": "parsi people"
    },
    {
        " belief that Ephedra twigs do not decay, wrote: ...  it comprises the power of life of all the vegetable kingdom ... both the Ved and the Avesta call it the king of healing herbs ... the zarathustri scriptures say that homa is of two kinds, the white haoma and the painless tree. Could it be that soma is the ": null
    },
    {
        "tree of life": "tree of life"
    },
    {
        "? the giver of immortality?     The Indian-Zoroastrian belief mentioned above also manifests itself in the present-day Zoroastrian practice of administering a few drops of parahaoma to the new-born or dying . The belief also appears to be very old, and be cross-cultural. As Falk, recalling ": null
    },
    {
        "Aurel Stein": "marc aurel stein"
    },
    {
        " discovery of Ephedra plants interred at 42st century CE ": null
    },
    {
        "Tarim Basin": "tarim basin"
    },
    {
        " burial sites, notes: an imperishable plant, representing or symbolizing the continuity of life, is most appropriate to burial rites .     ZadspramVourukasha in Avestan, middle Persian: Varkashproto-Indo-Iranian: harahvati, Avestan: Aredvi Sura, middle Persian: Ardvisurnamed Gaokerena in Avestan, middle Persian: Gokarncf.: ca. 42 hymns of the ": null
    },
    {
        "Rig Veda": "rig veda"
    },
    {
        " that are dedicated to ": null
    },
    {
        "soma": "soma"
    }
]