[
    {
        "         Harappa  is an ": null
    },
    {
        "archaeological site": "archaeological site"
    },
    {
        " in ": null
    },
    {
        "Punjab": "punjab, pakistan"
    },
    {
        ", ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        ", about  west of ": null
    },
    {
        "Sahiwal": "sahiwal"
    },
    {
        ". The site takes its name from a modern village located near the former course of the ": null
    },
    {
        "Ravi River": "ravi river"
    },
    {
        " which now runs  to the north. The current village of Harappa is less than  from the ancient site. Although modern Harappa has a legacy railway station from the ": null
    },
    {
        "British Raj": "british raj"
    },
    {
        " period, it is a small crossroads town of 15,000 people today.     The site of the ancient city contains the ruins of a ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " fortified": "fortification"
    },
    {
        " city, which was part of the ": null
    },
    {
        "Indus Valley Civilization": "indus valley civilization"
    },
    {
        " centred in ": null
    },
    {
        "Sindh": "sindh"
    },
    {
        " and the ": null
    },
    {
        "Punjab": "punjab region"
    },
    {
        ", and then the ": null
    },
    {
        "Cemetery H culture": "cemetery h culture"
    },
    {
        ".  The city is believed to have had as many as 23,500 residents and occupied about  with ": null
    },
    {
        "clay": "clay"
    },
    {
        " brick houses at its greatest extent during the ": null
    },
    {
        "Mature Harappan": "periodization of the indus valley civilization"
    },
    {
        " phase , which is considered ": null
    },
    {
        "large": "list of largest cities throughout history"
    },
    {
        " for its time.  Per archaeological convention of naming a previously unknown civilization by its first excavated site, the Indus Valley Civilization is also called the Harappan Civilization.     The ancient city of Harappa was heavily damaged under British rule, when bricks from the ruins were used as track ballast in the construction of the ": null
    },
    {
        "Lahore–Multan Railway": "history of rail transport in pakistan"
    },
    {
        ". In 2005, a controversial ": null
    },
    {
        "amusement park": "amusement park"
    },
    {
        " scheme at the site was abandoned when builders unearthed many archaeological artifacts during the early stages of building work. Tahir, Zulqernain. 26 May 2005. ,  Dawn . Retrieved 13 January 2006.  A plea from the Pakistani archaeologist Mohit Prem Kumar to the ": null
    },
    {
        "Ministry of Culture": "ministry of culture"
    },
    {
        " resulted in a restoration of the site.          The ": null
    },
    {
        "Harappan Civilization": "indus valley civilization"
    },
    {
        " has its earliest roots in cultures such as that of ": null
    },
    {
        "Mehrgarh": "mehrgarh"
    },
    {
        ", approximately 6000  BC. The two greatest cities, ": null
    },
    {
        "Mohenjo-daro": "mohenjo-daro"
    },
    {
        " and Harappa, emerged circa 2600  BC along the ": null
    },
    {
        "Indus River": "indus river"
    },
    {
        " valley in ": null
    },
    {
        "Punjab": "punjab region"
    },
    {
        " and ": null
    },
    {
        "Sindh": "sindh"
    },
    {
        ".  The civilization, with a possible ": null
    },
    {
        "writing system": "writing system"
    },
    {
        ", urban centers, and diversified ": null
    },
    {
        "social": "social structure"
    },
    {
        " and ": null
    },
    {
        "economic system": "economic system"
    },
    {
        ", was rediscovered in the 1920s also after excavations at ": null
    },
    {
        "Mohenjo-daro": "mohenjo-daro"
    },
    {
        " in Sindh near ": null
    },
    {
        "Larkana": "larkana"
    },
    {
        ", and Harappa, in west ": null
    },
    {
        "Punjab": "punjab, pakistan"
    },
    {
        " south of ": null
    },
    {
        "Lahore": "lahore"
    },
    {
        ". A number of other sites stretching from the ": null
    },
    {
        "Himalaya": "himalaya"
    },
    {
        "n foothills in east ": null
    },
    {
        "Punjab": "punjab, india"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        " in the north, to ": null
    },
    {
        "Gujarat": "gujarat"
    },
    {
        " in the south and east, and to ": null
    },
    {
        "Pakistani Balochistan": "balochistan"
    },
    {
        " in the west have also been discovered and studied. Although the archaeological site at Harappa was damaged in 1857 Michel Danino. The Lost River. Penguin India. when engineers constructing the ": null
    },
    {
        "Lahore": "lahore"
    },
    {
        "-": null
    },
    {
        "Multan": "multan"
    },
    {
        " railroad used brick from the Harappa ruins for ": null
    },
    {
        "track ballast": "track ballast"
    },
    {
        ", an abundance of artifacts have nevertheless been found. ": null
    },
    {
        "Kenoyer, J.M.": "jonathan mark kenoyer"
    },
    {
        ", 1997, Trade and Technology of the Indus Valley: New insights from Harappa Pakistan, World Archaeology, 29, pp. 260–280, High definition archaeology The bricks discovered were made of red sand, clay, stones and were baked at very high temperature. As early as 1826 Harappa, located in west Punjab, attracted the attention of a British officer in India, who gets credit for preliminary excavations in Harappa.         The Indus Valley civilization was mainly an urban culture sustained by surplus agricultural production and commerce, the latter including trade with ": null
    },
    {
        "Sumer": "sumer"
    },
    {
        " in southern ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        ". Both ": null
    },
    {
        "Mohenjo-Daro": "mohenjo-daro"
    },
    {
        " and Harappa are generally characterized as having differentiated living quarters, flat-roofed brick houses, and fortified administrative or religious centers. Library of Congress: Country Studies. 1995. . Retrieved 13 January 2006. Although such similarities have given rise to arguments for the existence of a standardized system of urban layout and planning, the similarities are largely due to the presence of a semi-orthogonal type of civic layout, and a comparison of the layouts of ": null
    },
    {
        "Mohenjo-Daro": "mohenjo-daro"
    },
    {
        " and Harappa shows that they are in fact, arranged in a quite dissimilar fashion.     The weights and measures of the Indus Valley Civilization, on the other hand, were highly standardized, and conform to a set scale of gradations. Distinctive seals were used, among other applications, perhaps for identification of property and shipment of goods. Although copper and ": null
    },
    {
        "bronze": "bronze"
    },
    {
        " were in use, ": null
    },
    {
        "iron": "iron"
    },
    {
        " was not yet employed. Cotton was woven and dyed for clothing; wheat, rice, and a variety of vegetables and fruits were ": null
    },
    {
        "cultivated": "agriculture"
    },
    {
        "; and a number of animals, including the ": null
    },
    {
        "humped bull": "brahman"
    },
    {
        ", were ": null
    },
    {
        "domesticated": "domestication"
    },
    {
        ", as well as ": null
    },
    {
        "fowl for fighting": "fighting cock"
    },
    {
        " .  Poultry: Identification, Fabrication, Utilization by Thomas Schneller – Cengage Learning, 28 September 2009 – page 16 Wheel-made pottery—some of it adorned with animal and geometric motifs—has been found in profusion at all the major Indus sites. A centralized administration for each city, though not the whole civilization, has been inferred from the revealed cultural uniformity; however, it remains uncertain whether authority lay with a commercial ": null
    },
    {
        "oligarchy": "oligarchy"
    },
    {
        ". Harappans had many trade routes along the Indus River that went as far as the Persian Gulf, Mesopotamia, and Egypt. Some of the most valuable things traded were ": null
    },
    {
        "carnelian": "carnelian"
    },
    {
        " and ": null
    },
    {
        "lapis lazuli": "lapis lazuli"
    },
    {
        ".      What is clear is that Harappan society was not entirely peaceful, with the human skeletal remains demonstrating some of the highest rates of injury found in South Asian prehistory.  Paleopathological analysis demonstrated that leprosy and tuberculosis were present at Harappa, with the highest prevalence of both disease and trauma present in the skeletons from Area G .  Furthermore, rates of cranio-facial trauma and infection increased through time demonstrating that the civilization collapsed amid illness and injury. The bioarchaeologists who examined the remains have suggested that the combined evidence for differences in mortuary treatment and epidemiology indicate that some individuals and communities at Harappa were excluded from access to basic resources like health and safety, a basic feature of hierarchical societies worldwide.             The excavators of the site have proposed the following ": null
    },
    {
        "chronology": "periodization of the indus valley civilization"
    },
    {
        " of Harappas occupation:   Ravi Aspect of the ": null
    },
    {
        "Hakra": "hakra"
    },
    {
        " phase, c. 3300 – 2800  BC.   Kot Dijian phase, c. 2800 – 2600  BC.   Harappan Phase, c. 2600 – 1900  BC.   Transitional Phase, c. 1900 – 1800  BC.   Late Harappan Phase, c. 1800 – 1300  BC.     By far the most exquisite and obscure artifacts unearthed to date are the small, square ": null
    },
    {
        "steatite": "steatite"
    },
    {
        " seals engraved with human or animal motifs. A large number of seals have been found at such sites as Mohenjo-Daro and Harappa. Many bear pictographic inscriptions generally thought to be a form of writing or script. Despite the efforts of philologists from all parts of the world, and despite the use of modern ": null
    },
    {
        "cryptographic analysis": "cryptography"
    },
    {
        ", the ": null
    },
    {
        "signs": "indus script"
    },
    {
        " remain undeciphered. It is also unknown if they reflect proto-": null
    },
    {
        "Dravidian": "dravidian languages"
    },
    {
        " or other non-": null
    },
    {
        "Vedic": "vedic period"
    },
    {
        " language. The ascribing of Indus Valley Civilization ": null
    },
    {
        "iconography": "iconography"
    },
    {
        " and ": null
    },
    {
        "epigraphy": "epigraphy"
    },
    {
        " to historically known cultures is extremely problematic, in part due to the rather tenuous archaeological evidence for such claims, as well as the projection of modern South Asian political concerns onto the archaeological record of the area. This is especially evident in the radically varying interpretations of Harappan material culture as seen from both Pakistan- and India-based scholars.     In February 2006 a school teacher in the village of Sembian-Kandiyur in ": null
    },
    {
        "Tamil Nadu": "tamil nadu"
    },
    {
        " discovered a stone ": null
    },
    {
        "celt ": "celt"
    },
    {
        " with an inscription estimated to be up to 3,500 years old.     Indian epigraphist ": null
    },
    {
        "Iravatham Mahadevan": "iravatham mahadevan"
    },
    {
        " postulated that the four signs were in the Indus script and called the find the greatest archaeological discovery of a century in Tamil Nadu . Based on this evidence he goes on to suggest that the language used in the Indus Valley was of ": null
    },
    {
        "Dravidian": "dravidian languages"
    },
    {
        " origin. However, the absence of a Bronze Age in South India, contrasted with the knowledge of bronze making techniques in the Indus Valley cultures, calls into question the validity of this hypothesis.       Clay and stone tablets unearthed at Harappa, which were carbon dated 3300–3200  BC., contain trident-shaped and plant-like markings. It is a big question as to if we can call what we have found true writing, but we have found symbols that have similarities to what became Indus script said Dr. Richard Meadow of Harvard University, Director of the Harappa Archeological Research Project.  This primitive writing is placed slightly earlier than primitive writings of the Sumerians of ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        ", dated c.3100  BC. These markings have similarities to what later became ": null
    },
    {
        "Indus Script": "indus script"
    },
    {
        ".           ": null
    },
    {
        "radiocarbon dating": "radiocarbon dating"
    },
    {
        " mentioned on the web is 2725±185  BC or 3338, 3213, 3203  BC calibrated, giving a midpoint of 3251  BC. Kenoyer, Jonathan Mark Urban process in the Indus Tradition: A preliminary report. In Harappa Excavations, 1986–1990: A multidisciplinary approach to Second Millennium urbanism, edited by Richard H. Meadow: 29–59. Monographs in World Archaeology No.3. Prehistory Press, Madison Wisconsin.   Periods 4 and 5 are not dated at Harappa. The termination of the Harappan tradition at Harappa falls between 1900 and 1500  BC.   ": null
    },
    {
        "Mohenjo-daro": "mohenjo-daro"
    },
    {
        " is another major city of the same period, located in ": null
    },
    {
        "Sindh": "sindh"
    },
    {
        " province of ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        ". One of its most well-known structures is the ": null
    },
    {
        "Great Bath": "great bath, mohenjo-daro"
    }
]