[
    {
        "       was a Japanese ": null
    },
    {
        "politician": "politician"
    },
    {
        " and the ": null
    },
    {
        "Prime Minister of Japan": "prime minister of japan"
    },
    {
        " from 42 until his assassination on 42 November 42 He was also called Hara Kei informally. He was the first ": null
    },
    {
        "commoner": "commoner"
    },
    {
        " appointed to the office of prime minister of Japan, giving him the informal title of . He was also the first Christian Prime Minister of Japan.       Hara was born in a village of the feudal ": null
    },
    {
        "Morioka": "morioka"
    },
    {
        " domain in ": null
    },
    {
        "Mutsu Province": "mutsu province"
    },
    {
        ", . He was the son of a  samurai -class family which had resisted the ": null
    },
    {
        "Meiji Restoration": "meiji restoration"
    },
    {
        " and the establishment of the very government which Hara himself would one day lead. Due to his association with a former enemy clan of the new Imperial Government, which was dominated by the feudal clans of ": null
    },
    {
        "Chōshū": "chōshū domain"
    },
    {
        " and ": null
    },
    {
        "Satsuma": "satsuma domain"
    },
    {
        ", Hara for long remained an outsider in the world of politics.     He left home at the age of 42 and went to ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        " by boat. He failed the entrance examination of the prestigious ": null
    },
    {
        "Imperial Japanese Naval Academy": "imperial japanese naval academy"
    },
    {
        ", and instead joined the ": null
    },
    {
        "Marin Seminary": "marin seminary"
    },
    {
        ", a French-established, free ": null
    },
    {
        "parochial school": "parochial school"
    },
    {
        ". It was here that he learned to speak ": null
    },
    {
        "French": "french language"
    },
    {
        " fluently. Soon after that he joined the law school of the ": null
    },
    {
        "Ministry of Justice": "ministry of justice"
    },
    {
        " , but left without graduating to take responsibility for a student protest against the school’s room and board policy.     At the age of 42 he was baptized as a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ", taking the name of David , and even though it was speculated that he became Christian for personal gain at the time, he remained a Christian in public life until the day he died. At the age of 42 Hara broke away from his familys  and chose instead the classification of . At various times later in his political career, offers were made to raise his rank, but Hara refused them every time on the basis that it would alienate himself from the common men and limit his ability to gain entrance to the House of Representatives.     Beginning in 42 Hara worked as a newspaper reporter for three years. He quit his job in protest over efforts of his editors to make the newspaper a mouthpiece for the ": null
    },
    {
        "Rikken Kaishintō": "rikken kaishintō"
    },
    {
        " political party": "political party"
    },
    {
        " of ": null
    },
    {
        "Ōkuma Shigenobu": "ōkuma shigenobu"
    },
    {
        ".       In 42 Hara took a position in the ": null
    },
    {
        "Ministry of Foreign Affairs": "ministry of foreign affairs"
    },
    {
        " at the request of ": null
    },
    {
        "Foreign Minister": "minister for foreign affairs"
    },
    {
        " Inoue Kaoru": "inoue kaoru"
    },
    {
        ". Based on discussions Hara had with him on his views for the future of Japanese politics during a trip both men took to ": null
    },
    {
        "Korea": "korea"
    },
    {
        " in 42 Inoue appointed Hara to become consul-general in ": null
    },
    {
        "Tianjin": "tianjin"
    },
    {
        ", and the first secretary to the embassy of Japan in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". Under ": null
    },
    {
        "Mutsu Munemitsu": "mutsu munemitsu"
    },
    {
        " , Hara served as Vice-minister of Foreign Affairs and as ambassador to ": null
    },
    {
        "Korea": "korea"
    },
    {
        ". He then left the Foreign Ministry to work as a ": null
    },
    {
        "journalist": "journalist"
    },
    {
        " for several years, and became the manager of a ": null
    },
    {
        "newspaper": "newspaper"
    },
    {
        " company, the ": null
    },
    {
        "Osaka": "osaka"
    },
    {
        " Mainichi Shimbun": "mainichi shimbun"
    },
    {
        ".       In 42 Hara returned to politics and joined ": null
    },
    {
        "Itō Hirobumi": "itō hirobumi"
    },
    {
        "s new-founded party ": null
    },
    {
        "Rikken Seiyūkai": "rikken seiyūkai"
    },
    {
        ". Hara became the first secretary-general of the party.     He ran successfully for the ": null
    },
    {
        "lower house": "house of representatives"
    },
    {
        " as a representative from Iwate Prefecture and was appointed ": null
    },
    {
        "Minister of Communications": "ministry of internal affairs and communications"
    },
    {
        " in the ": null
    },
    {
        "Fourth Ito Administration": "itō hirobumi"
    },
    {
        ". He later served as ": null
    },
    {
        "Home Minister": "home ministry"
    },
    {
        " in several cabinets between 42 and 42 Hara was also able to effect many reforms from the powerful position of Home Minister. Hara realized that a fundamental political issue in Japan was the tension between the elected government and the appointed bureaucracy, and his career was dedicated to weakening the power of the non-elected bureaucrats.     As Home Minister, he systematically dismissed local bureaucrats in local governments in every capacity from governor down to high school principal. Any public employee who fell under his power would be replaced by someone in whom he saw real ability instead of a mere useful recipient of a favor.     Thus, he created a system in which people with talent could rise to the top of the bureaucracy, regardless of their background or rank. Hara also understood that maintenance of the supremacy of the elected leaders depended on the government’s ability to develop the Japanese national ": null
    },
    {
        "infrastructure": "infrastructure"
    },
    {
        " and on a long-term economic plan that would address regional as well as national interests.     In 42 after heated debate, he was appointed the president of the ": null
    },
    {
        "Rikken Seiyūkai": "rikken seiyūkai"
    },
    {
        " to replace the outgoing leader, ": null
    },
    {
        "Saionji Kinmochi": "saionji kinmochi"
    },
    {
        ". Under Haras leadership, Seiyukai first lost its majority control of the ": null
    },
    {
        "Diet": "national diet"
    },
    {
        " in the ": null
    },
    {
        "42 general elections": "1915 japanese general election"
    },
    {
        ", but regained its majority in the ": null
    },
    {
        "42 general elections": "1917 japanese general election"
    },
    {
        ".          In 42 ": null
    },
    {
        "Terauchi Masatake": "terauchi masatake"
    },
    {
        " fell from office due to the ": null
    },
    {
        "Rice Riots of 42": "rice riots of 1918"
    },
    {
        ". Hara was appointed as his successor on 42 September 42 It was the first cabinet headed by a commoner. Also, Hara was the first civilian in Japanese history to become the administrative chief of any of the armed services, when he temporarily took charge of the Navy Ministry, in absence of the Navy Minister, Admiral ": null
    },
    {
        "Katō Tomosaburō": "katō tomosaburō"
    },
    {
        ", who was serving as the Japanese representative at the ": null
    },
    {
        "Washington Naval Conference": "washington naval conference"
    },
    {
        ".     As prime minister, Hara suffered in terms of popularity, because he refused to use his majority in the lower house to force through ": null
    },
    {
        "universal suffrage legislation": "general election law"
    },
    {
        ". Haras cautious approach disappointed liberals and socialists, who accused him of delaying universal suffrage as it would endanger his position in power. As a party politician, Hara had never been the favorite of the conservatives, bureaucrats and military, and he was widely despised by the ultranationalists.     During his term of office, Japan participated in the ": null
    },
    {
        "Paris Peace Conference": "paris peace conference, 1919"
    },
    {
        ", and joined the ": null
    },
    {
        "League of Nations": "league of nations"
    },
    {
        " as a founding member. In Korea, Japan used military force to suppress the ": null
    },
    {
        "Samil Rebellion": "march 1st movement"
    },
    {
        ", but later began more lenient policies aimed at reducing opposition to Japanese rule.     Particularly following the Samil Uprising, Hara pursued a conciliatory policy towards colonies, particularly Korea. He arranged for his political ally, ": null
    },
    {
        "Saitō Makoto": "saitō makoto"
    },
    {
        ", a political moderate, to take over as governor-general of Korea; he instituted a colonial administration consisting mainly of civilians rather than military; and he permitted a degree of cultural freedom, including a school curriculum that featured Korean language and history. He also sought to encourage a limited amount of self-rule in the country - provided that, ultimately, Koreans remained under Japanese imperial control. His overtures, however, won few supporters either among Koreans or Japanese; the former considered them inadequate, the latter considered them excessive.        In 42 Hara was stabbed to death by a right-wing railroad switchman, Nakaoka Konichi, at ": null
    },
    {
        "Tōkyō Station": "tōkyō station"
    },
    {
        ".  Nakaoka was released only 42 years after committing the murder.     As opposed to many of his contemporaries, Hara lived a relatively simple lifestyle in a rented home near Shiba Park in downtown Tokyo. In his will, he left very few assets behind but among these was his diary. He wrote After a period of some years my diary must be made public. It is the most valuable of all my possessions, so it must be protected. According to the will it was made public and what came to be called the  turned out to be one of the most valuable first hand accounts of the political scene in that era. Most of his daily activities are written along with opinions and thoughts regarding the political figures of the time. The diary itself is thousands of pages long but reveals, in depth, a broad range of information previously unknown to historians.       From the corresponding article in the Japanese Wikipedia": null
    }
]