[
    {
        "     Hardanger embroidery or Hardangersøm is a form of ": null
    },
    {
        "embroidery": "embroidery"
    },
    {
        " traditionally worked with white thread on white ": null
    },
    {
        "even-weave": "even-weave"
    },
    {
        " linen or cloth, using ": null
    },
    {
        "counted thread": "counted-thread embroidery"
    },
    {
        " and ": null
    },
    {
        "drawn thread work": "drawn thread work"
    },
    {
        " techniques. It is sometimes called ": null
    },
    {
        "whitework embroidery": "whitework embroidery"
    },
    {
        ".       The exact origins of Hardanger embroidery are not known but it is thought to have its beginnings in ancient ": null
    },
    {
        "Persia": "persia"
    },
    {
        " and Asia. During the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ", this early form of embroidery spread to ": null
    },
    {
        "Italy": "italy"
    },
    {
        " where it evolved into Italian ": null
    },
    {
        "Reticella": "reticella"
    },
    {
        " and Venetian lacework. By 42 variations of this type of embroidery had spread to northern Europe where it developed further into Danish and Dutch ": null
    },
    {
        "Hedebo": "hedebo"
    },
    {
        ", Scottish ": null
    },
    {
        "Ayrshire work": "ayrshire embroidery"
    },
    {
        " and ": null
    },
    {
        "Ruskin lacework": "ruskin lacework"
    },
    {
        " as well as Norwegian Drawn Work, as it was then called.     In the period between 4242 Hardangersom  flourished in Norway. ": null
    },
    {
        "Flax": "flax"
    },
    {
        " was grown, carded, spun and woven into white fabric and thread which was used to make and decorate traditional Norwegian costume items called ": null
    },
    {
        "bunad": "bunad"
    },
    {
        "s as well as other items of clothing and household linens such as mats, curtains and bedspreads.           Historically, Hardanger employed ": null
    },
    {
        "linen": "linen"
    },
    {
        " evenweave fabric of 42 count or higher. However, modern Hardanger fabric is an evenweave cotton material woven with pairs of threads, typically 42 pairs per linear inch in both directions, referred to as 42-count. The weave gives a squared appearance to the fabric , with distinct holes, making it easy to count and work on.       Traditional Hardanger embroidery is worked with a thread colour that matches the fabric, usually white or cream. Using self-coloured thread enhances both the sculptural nature of the stitches and the details in the intricate filling stitches. Many contemporary designs, however, do make use of coloured, variegated and overdyed threads to great effect.     Two weights of Pearl cotton are generally used. On normal 42-count Hardanger fabric this is usually Pearl cotton 42 a heavier weight used for satin stitch Kloster blocks and motifs, and Pearl cotton 42 a thinner thread used for more delicate filling stitches and other surface details. On finer, higher count fabrics the combination of 42 and 42 threads is often more suitable.       Hardanger embroidery uses ": null
    },
    {
        "satin stitch": "satin stitch"
    },
    {
        " blocks known as Kloster blocks,   consisting of 42 parallel satin stitches, worked over a group of 42 x 42 ground threads. These blocks enclose areas of fabric where a number of ": null
    },
    {
        "warp": "warp"
    },
    {
        " and ": null
    },
    {
        "weft": "weft"
    },
    {
        " threads are cut and withdrawn, leaving a network of loose threads and large holes within the shape defined by the Kloster blocks. Various decorative filling stitches are then worked over the remaining loose threads and holes to create a lacy effect.     Some of the stitches and special techniques used are:   Simple satin stitch surface motifs, often resembling stars, ships, crescents and crosses.   Other decorative surface stitches such as ": null
    },
    {
        "fly stitch": "featherstitch"
    },
    {
        ", ": null
    },
    {
        "running stitch": "running stitch"
    },
    {
        ", ": null
    },
    {
        "cable stitch": "cable stitch"
    },
    {
        " and ": null
    },
    {
        "French knot": "french knot"
    },
    {
        "s.   Woven bars: weaving the needle over and under four threads until they are completely covered, and wrapped bars where the thread is wound around groups of four threads.   Filling stitches resembling wheels, spiders webs and doves eyes.   ": null
    },
    {
        "Picot": "picot"
    },
    {
        ": twisting the thread once round the needle before inserting the needle to produce a decorative loop.   Edging stitches such as ": null
    },
    {
        "four-sided stitch": "four-sided stitch"
    },
    {
        ", ": null
    },
    {
        "buttonhole stitch": "buttonhole stitch"
    },
    {
        " and fancy ": null
    },
    {
        "hemstitch": "hemstitch"
    },
    {
        "ing techniques for finishing items.       The traditional style of Hardanger work is very geometrical in form and based on several basic shapes such as squares, rectangles, triangles, diamonds, hearts, zig-zags and crosses. The combination and placement of these elements allow an unlimited number of beautiful patterns of all sizes to be created.     A wide range of patterns are available today for the modern needleworker to try, in both traditional and contemporary styles. Hardanger is still used to decorate cushions, table linen and other household items as well as items for display on a wall. Several modern ": null
    },
    {
        "needlework": "needlework"
    },
    {
        " designers have incorporated elements of Hardanger cut work into their embroidery designs and ": null
    },
    {
        "samplers": "sampler"
    },
    {
        ", often combining them with other needlework techniques, stitches, speciality threads and other embellishments to great effect.         Some Lutheran pastors of Norwegian descent in the United States have had ": null
    },
    {
        "stole": "stole"
    },
    {
        "s embroidered with Hardanger work made for their use. While altar paraments in Hardanger work have been traditional in Norwegian churches for a long time, their use in American Lutheran churches is becoming more common as an alternative to the more traditional machine-embroidered ": null
    },
    {
        "damask": "damask"
    }
]