[
    {
        "           In ": null
    },
    {
        "classical mechanics": "classical mechanics"
    },
    {
        ", a harmonic oscillator is a system that, when displaced from its ": null
    },
    {
        "equilibrium": "mechanical equilibrium"
    },
    {
        " position, experiences a ": null
    },
    {
        "restoring force": "restoring force"
    },
    {
        " F ": null
    },
    {
        "proportional": "proportionality"
    },
    {
        " to the displacement x:   : \\vec F -k \\vec x,   where k is a positive ": null
    },
    {
        "constant": "coefficient"
    },
    {
        ".     If F is the only force acting on the system, the system is called a simple harmonic oscillator, and it undergoes ": null
    },
    {
        "simple harmonic motion": "simple harmonic motion"
    },
    {
        ": ": null
    },
    {
        "sinusoidal": "sinusoidal"
    },
    {
        " oscillation": "oscillation"
    },
    {
        "s about the equilibrium point, with a constant ": null
    },
    {
        "amplitude": "amplitude"
    },
    {
        " and a constant ": null
    },
    {
        "frequency": "frequency"
    },
    {
        " .     If a frictional force  proportional to the ": null
    },
    {
        "velocity": "velocity"
    },
    {
        " is also present, the harmonic oscillator is described as a damped oscillator. Depending on the friction coefficient, the system can:   Oscillate with a frequency lower than in the ": null
    },
    {
        "undamped": "undamped"
    },
    {
        " case, and an ": null
    },
    {
        "amplitude": "amplitude"
    },
    {
        " decreasing with time .   Decay to the equilibrium position, without oscillations .     The boundary solution between an underdamped oscillator and an overdamped oscillator occurs at a particular value of the friction coefficient and is called ": null
    },
    {
        "critically damped": "critically damped"
    },
    {
        ".     If an external time-dependent force is present, the harmonic oscillator is described as a driven oscillator.     Mechanical examples include ": null
    },
    {
        "pendulum": "pendulum"
    },
    {
        "s , masses connected to ": null
    },
    {
        "springs": "spring"
    },
    {
        ", and ": null
    },
    {
        "acoustical systems": "acoustics"
    },
    {
        ". Other ": null
    },
    {
        "analogous systems": "equivalent systems"
    },
    {
        " include electrical harmonic oscillators such as ": null
    },
    {
        "RLC circuit": "rlc circuit"
    },
    {
        "s. The harmonic oscillator model is very important in physics, because any mass subject to a force in stable equilibrium acts as a harmonic oscillator for small vibrations. Harmonic oscillators occur widely in nature and are exploited in many manmade devices, such as ": null
    },
    {
        "clock": "clock"
    },
    {
        "s and radio circuits. They are the source of virtually all sinusoidal vibrations and waves.               A simple harmonic oscillator is an oscillator that is neither driven nor ": null
    },
    {
        "damped": "damping"
    },
    {
        ". It consists of a mass m, which experiences a single force F, which pulls the mass in the direction of the point x    42 and depends only on the position x of the mass and a constant k. Balance of forces  for the system is     : F m a m \\frac m\\ddot -k x.     Solving this ": null
    },
    {
        "differential equation": "differential equation"
    },
    {
        ", we find that the motion is described by the function     : x A \\cos,     where     : \\omega \\sqrt.     The motion is ": null
    },
    {
        "periodic": "periodic function"
    },
    {
        ", repeating itself in a ": null
    },
    {
        "sinusoidal": "sine wave"
    },
    {
        " fashion with constant amplitude A. In addition to its amplitude, the motion of a simple harmonic oscillator is characterized by its ": null
    },
    {
        "period": "frequency"
    },
    {
        " T 42\\pi/\\omega , the time for a single oscillation or its frequency f42/T , the number of cycles per unit time. The position at a given time t also depends on the ": null
    },
    {
        "phase": "phase"
    },
    {
        " φ, which determines the starting point on the sine wave. The period and frequency are determined by the size of the mass m and the force constant k, while the amplitude and phase are determined by the starting position and ": null
    },
    {
        "velocity": "velocity"
    },
    {
        ".     The velocity and ": null
    },
    {
        "acceleration": "acceleration"
    },
    {
        " of a simple harmonic oscillator oscillate with the same frequency as the position, but with shifted phases. The velocity is maximal for zero displacement, while the acceleration is in the direction opposite to the displacement.     The potential energy stored in a simple harmonic oscillator at position x is     : U \\frac 42 42 kx^42                  In real oscillators, friction, or damping, slows the motion of the system. Due to frictional force, the velocity decreases in proportion to the acting frictional force. While in a simple undriven harmonic oscillator the only force acting on the mass is the restoring force, in a damped harmonic oscillator there is in addition a frictional force which is always in a direction to oppose the motion. In many vibrating systems the frictional force F f can be modeled as being proportional to the velocity v of the object: , where c is called the viscous damping coefficient.     The balance of forces  for damped harmonic oscillators is then     : F - kx - c\\frac m \\frac,        which can be rewritten into the form     : \\frac + 42\\zeta\\omega_42\\frac + \\omega_42^42 x 42     where   : \\omega_42 \\sqrt is called the undamped ": null
    },
    {
        "angular frequency": "angular frequency"
    },
    {
        " of the oscillator ,   : \\zeta \\frac is called the damping ratio .          The value of the damping ratio ζ critically determines the behavior of the system. A damped harmonic oscillator can be:   Overdamped : The system oscillates with the amplitude gradually decreasing to zero. The ": null
    },
    {
        "angular frequency": "angular frequency"
    },
    {
        " of the underdamped harmonic oscillator is given by \\omega_42 \\omega_42\\sqrt, the ": null
    },
    {
        "exponential decay": "exponential decay"
    },
    {
        " of the underdamped harmonic oscillator is given by \\lambda \\omega_42\\zeta.     The ": null
    },
    {
        "Q factor": "q factor"
    },
    {
        " of a damped oscillator is defined as   : Q 42\\pi \\times \\frac.     Q is related to the damping ratio by the equation Q \\frac.          Driven harmonic oscillators are damped oscillators further affected by an externally applied force F.     ": null
    },
    {
        "Newtons second law": "newtons second law"
    },
    {
        " takes the form     : F-kx-c\\fracm\\frac.     It is usually rewritten into the form     : \\frac + 42\\zeta\\omega_42\\frac + \\omega_42^42 x \\frac.     This equation can be solved exactly for any driving force, using the solutions z that satisfy the unforced equation     : \\frac + 42\\zeta\\omega_42\\frac + \\omega_42^42 z 42     and which can be expressed as damped sinusoidal oscillations:     : z A \\mathrm^ \\sin \\left,     in the case where ζ  ≤  42 The amplitude A and phase φ determine the behavior needed to match the initial conditions.            In the case ζ   ": null
    }
]