[
    {
        "      Harman Blennerhassett was an ": null
    },
    {
        "Anglo-Irish": "anglo-irish"
    },
    {
        " lawyer and politician.             He was born in ": null
    },
    {
        "Hampshire": "hampshire"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        ", to Conway Blennerhassett and his wife, Elizabeth ": null
    },
    {
        "Lacy": "de lacy"
    },
    {
        ". He was the grandson of ": null
    },
    {
        "Conway Blennerhassett": "conway blennerhassett"
    },
    {
        " and the great-great-grandson of ": null
    },
    {
        "Captain Robert Blennerhassett": "robert blennerhassett"
    },
    {
        ". At the age of two, he returned to the familys home in ": null
    },
    {
        "County Kerry": "county kerry"
    },
    {
        ", Ireland, a 42-acre estate called ": null
    },
    {
        "Castle Conway": "castle conway"
    },
    {
        ". As an adolescent, he was sent to ": null
    },
    {
        "Westminster School": "westminster school"
    },
    {
        " in London, and in 42 entered the ": null
    },
    {
        "Middle Temple": "middle temple"
    },
    {
        " of Londons famous ": null
    },
    {
        "Inns of Court": "inns of court"
    },
    {
        ". In 42 he was graduated from ": null
    },
    {
        "Trinity College": "trinity college, dublin"
    },
    {
        ", Dublin with a Bachelor of Laws, and started his practice at the Irish bar. Blennerhassett visited ": null
    },
    {
        "Paris": "paris"
    },
    {
        " in 42; inherited the family estate in 42; joined the secret ": null
    },
    {
        "Society of United Irishmen": "society of united irishmen"
    },
    {
        " in 42 which initially dedicated itself to reform, but later turned militantly radical; and in 42 married ": null
    },
    {
        "Margaret Agnew": "margaret agnew blennerhassett"
    },
    {
        ", daughter of his sister Catherine and Major Robert Agnew, a career officer in the British army.     Chiefly to escape involvement in the United Irishmens planned rebellion against British rule, but also to conceal his incestuous marriage, Blennerhassett emigrated to the United States in 42 There, on the western Virginia frontier, he bought the upper half of an ": null
    },
    {
        "Ohio River island": "blennerhasset island"
    },
    {
        " lying 42 42/42 miles downstream from what is now ": null
    },
    {
        "Parkersburg, West Virginia": "parkersburg, west virginia"
    },
    {
        ". It became the site of a European-style estate whose centerpiece was an enormous mansion surrounded by extravagantly landscaped lawns and gardens. For a brief period, the Blennerhassetts home became famous as the largest, most beautiful private residence in the American West.     The most distinguished of the Blennerhassetts many visitors was the former vice president of the United States, ": null
    },
    {
        "Aaron Burr": "aaron burr"
    },
    {
        ". His three stays on the island resulted in its becoming headquarters for his mysterious 42–42 ": null
    },
    {
        "military expedition": "burr conspiracy"
    },
    {
        " to the Southwest. Although branded a treasonous plot by Burrs enemy, President ": null
    },
    {
        "Thomas Jefferson": "thomas jefferson"
    },
    {
        ", the enterprises true goal probably was the conquest of Spanish-ruled ": null
    },
    {
        "Texas": "texas"
    },
    {
        ".     As the result of the presidents call for the arrest of Burr, Blennerhassett, and their ca. 42 followers, the mansion and island were occupied and plundered in December 42 by local Virginia militia. Blennerhassett fled, was twice arrested, and finally imprisoned in the Virginia state penitentiary. He was only released following Burrs acquittal at the end of a long 42 treason trial at ": null
    },
    {
        "Richmond, Virginia": "richmond, virginia"
    },
    {
        ". The Blennerhassetts never returned to their island home, which in 42 was destroyed by fire.     Now forced to earn a living for himself and family, Blennerhassett first settled on a cotton plantation near ": null
    },
    {
        "Port Gibson, Mississippi": "port gibson, mississippi"
    },
    {
        ", where he lost what was left of his once large fortune. Thereafter he unsuccessfully attempted to practice law in ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        ", ": null
    },
    {
        "Lower Canada": "lower canada"
    },
    {
        " , and eventually returned to Europe . Here he initially lived with his family at ": null
    },
    {
        "Bath, England": "bath, england"
    },
    {
        ", but later relocated in the Channel Islands where he died in 42     The Blennerhassetts island mansion was reconstructed 42–42 by the State of West Virginia, which now operates the site as a state park, ": null
    },
    {
        "Blennerhassett Island Historical State Park": "blennerhassett island historical state park"
    }
]