[
    {
        "A harpsichord  is a ": null
    },
    {
        "musical instrument": "Musical Instrument"
    },
    {
        " played by means of a ": null
    },
    {
        "keyboard": "Musical Keyboard"
    },
    {
        ". Like a ": null
    },
    {
        "pipe organ": "Pipe Organ"
    },
    {
        ", a harpsichord may have more than one keyboard ": null
    },
    {
        "manual": "Manual"
    },
    {
        " and harpsichords may have ": null
    },
    {
        "stop": "Organ Stop"
    },
    {
        " buttons which add or remove additional octaves. Some harpsichords may have a lute stop, which simulates the sound of a plucked ": null
    },
    {
        "lute": "Lute"
    },
    {
        ". This activates a row of levers that turn a trigger mechanism that plucks one or more strings with a small ": null
    },
    {
        "plectrum": "Plectrum"
    },
    {
        " made from quill or plastic. The strings are under tension on a soundboard, which is mounted in a wooden case; the soundboard amplifies the vibrations from the strings so that the listeners can hear it.     The term denotes the whole family of similar plucked-keyboard instruments, including the smaller ": null
    },
    {
        "virginals": "Virginals"
    },
    {
        ", ": null
    },
    {
        "muselar": "Virginalsmuselars"
    },
    {
        ", and ": null
    },
    {
        "spinet": "Spinet"
    },
    {
        ". The harpsichord was widely used in ": null
    },
    {
        "Renaissance": "Renaissance Music"
    },
    {
        " and ": null
    },
    {
        "Baroque music": "Baroque Music"
    },
    {
        ", both as an ": null
    },
    {
        "accompaniment": "Accompaniment"
    },
    {
        " instrument and as a soloing instrument. During the Baroque era, the harpsichord was a standard part of the ": null
    },
    {
        "continuo group": "Continuo Group"
    },
    {
        ", the musicians who performed the ": null
    },
    {
        "basso continuo": "Basso Continuo"
    },
    {
        " part that acted as the foundation for many musical pieces in this era. During the late 18th century, with the development of the ": null
    },
    {
        "fortepiano": "Fortepiano"
    },
    {
        "  the harpsichord gradually disappeared from the musical scene . In the 20th century, it made a resurgence, being used in ": null
    },
    {
        "historically informed performances": "Historically Informed Performance"
    },
    {
        "of older music, in new compositions, and, in rare cases, in certain styles of popular music .                The harpsichord was most likely invented in the late Middle Ages. By the 16th century, harpsichord makers in Italy were making lightweight instruments with low string tension. A different approach was taken in the ": null
    },
    {
        "Southern Netherlands": "Southern Netherlands"
    },
    {
        " starting in the late 16th century, notably by the ": null
    },
    {
        "Ruckers": "Ruckers"
    },
    {
        " family. Their harpsichords used a heavier construction and produced a more powerful and distinctive tone. They included the first harpsichords with two keyboards, used for ": null
    },
    {
        "transposition": "Transposition"
    },
    {
        ".     The Flemish instruments served as the model for 18th-century harpsichord construction in other nations. In France, the double keyboards were adapted to control different choirs of strings, making a more musically flexible instrument. Instruments from the peak of the French tradition, by makers such as the ": null
    },
    {
        "Blanchet family": "Blanchet"
    },
    {
        " and ": null
    },
    {
        "Pascal Taskin": "Pascal Taskin"
    },
    {
        ", are among the most widely admired of all harpsichords, and are frequently used as models for the construction of modern instruments. In England, the ": null
    },
    {
        "Kirkman": "Kirkman"
    },
    {
        " and ": null
    },
    {
        "Shudi": "Burkat Shudi"
    },
    {
        " firms produced sophisticated harpsichords of great power and sonority. German builders extended the sound repertoire of the instrument by adding ": null
    },
    {
        "sixteen foot": "Eight Foot Pitch"
    },
    {
        " and ": null
    },
    {
        "two foot": "Eight Foot Pitch"
    },
    {
        " choirs; these instruments have recently served as models for modern builders.     In the late 18th century the harpsichord was supplanted by the ": null
    },
    {
        "piano": "Piano"
    },
    {
        " and almost disappeared from view for most of the 19th century: an exception was its continued use in opera for accompanying ": null
    },
    {
        "recitative": "Recitative"
    },
    {
        ", but the piano sometimes displaced it even there. Twentieth-century efforts to revive the harpsichord began with instruments that used piano technology, with heavy strings and metal frames. Starting in the middle of the 20th century, ideas about harpsichord making underwent a major change, when builders such as ": null
    },
    {
        "Frank Hubbard": "Frank Hubbard"
    },
    {
        ", ": null
    },
    {
        "William Dowd": "William Dowd"
    },
    {
        ", and ": null
    },
    {
        "Martin Skowroneck": "Martin Skowroneck"
    },
    {
        " sought to re-establish the building traditions of the Baroque period. Harpsichords of this type of historically informed building practice dominate the current scene.          Harpsichords vary in size and shape, but all have the same basic mechanism. The player depresses a key that rocks over a pivot in the middle of its length. The other end of the key lifts a jack that holds a small ": null
    },
    {
        "plectrum": "Plectrum"
    },
    {
        " , which plucks the string. When the player releases the key, the far end returns to its rest position, and the jack falls back; the plectrum, mounted on a tongue mechanism that can swivel backwards away from the string, passes the string without plucking it again. As the key reaches its rest position, a felt damper atop the jack stops the strings vibrations. These basic principles are explained in detail below.      keylever is a simple pivot, which rocks on a balance pin that passes through a hole drilled through the keylever.   The jack is a thin, rectangular piece of wood that sits upright on the end of the keylever. The jacks are held in place by the registers. These are two long strips of wood , which run in the gap between pinblock and bellyrail. The registers have rectangular mortises through which the jacks pass as they can move up and down. The registers hold the jacks in the precise location needed to pluck the string.   plectrum  juts out almost horizontally and passes just under the string. Historically, plectra were made of bird quill or leather; many modern harpsichords have plastic  plectra.   When the front of the key is pressed, the back of the key rises, the jack is lifted, and the plectrum plucks the string.   The vertical motion of the jack is then stopped by the jackrail , which is covered with soft felt to muffle the impact.        Each string is wound around a tuning pin, normally at the end of the string closer to the player. When rotated with a wrench or tuning hammer, the tuning pin adjusts the tension so that the string sounds the correct pitch. Tuning pins are held tightly in holes drilled in the pinblock or wrestplank, an oblong hardwood plank. Proceeding from the tuning pin, a string next passes over the nut, a sharp edge that is made of hardwood and is normally attached to the wrestplank. The section of the string beyond the nut forms its vibrating length, which is plucked and creates sound.     At the other end of its vibrating length, the string passes over the ": null
    },
    {
        "bridge": "Bridge"
    },
    {
        ", another sharp edge made of ": null
    },
    {
        "hardwood": "Hardwood"
    },
    {
        ". As with the nut, the horizontal position of the string along the bridge is determined by a vertical metal pin inserted into the bridge, against which the string rests. The bridge itself rests on a  soundboard , a thin panel of wood usually made of ": null
    },
    {
        "spruce": "Spruce"
    },
    {
        ", ": null
    },
    {
        "fir": "Fir"
    },
    {
        " or—in some Italian harpsichords—": null
    },
    {
        "cypress": "Cupressus Sempervirens"
    },
    {
        ". The soundboard efficiently transduces the vibrations of the strings into vibrations in the air; without a soundboard, the strings would produce only a very feeble sound. A string is attached at its far end by a loop to a hitchpin that secures it to the case.            While many harpsichords have one string per note, more elaborate harpsichords can have two or more strings for each note. When there are multiple strings for each note, these additional strings are called choirs of strings. This provides two advantages: the ability to vary volume and ability to vary tonal quality. Volume is increased when the mechanism of the instrument is set up by the player so that the press of a single key plucks more than one string. Tonal quality can be varied in two ways. First, different choirs of strings can be designed to have distinct tonal qualities, usually by having one set of strings plucked closer to the nut, which emphasizes the higher ": null
    },
    {
        "harmonic": "Harmonic"
    },
    {
        "s, and produces a nasal sound quality. The mechanism of the instrument, called stops  permits the player to select one choir or the other. Second, having one key pluck two strings at once changes not just volume but also tonal quality; for instance, when two strings tuned to the same pitch are plucked simultaneously, the note is not just louder but also richer and more complex.     A particularly vivid effect is obtained when the strings plucked simultaneously are an ": null
    },
    {
        "octave": "Octave"
    },
    {
        " apart. This is normally heard by the ear not as two pitches but as one: the sound of the higher string is blended with that of the lower one, and the ear hears the lower pitch, enriched in tonal quality by the additional strength in the upper harmonics of the note sounded by the higher string.     When describing a harpsichord it is customary to specify its choirs of strings, often called its ": null
    },
    {
        "disposition": "Disposition"
    },
    {
        ". To describe the pitch of the choirs of strings, pipe organ terminology is used. Strings at ": null
    },
    {
        "eight foot pitch": "Eight Foot Pitch"
    },
    {
        " sound at the normal expected pitch, strings at four foot pitch sound an octave higher. Harpsichords occasionally include a sixteen-foot choir or a two-foot choir . When there are multiple choirs of strings, the player is often able to control which choirs sound. This is usually done by having a set of jacks for each choir, and a mechanism for turning off each set, often by moving the upper register sideways a short distance, so that their plectra miss the strings. In simpler instruments this is done by manually moving the registers, but as the harpsichord evolved, builders invented levers, knee levers and pedal mechanisms to make it easier to change registration.     Harpsichords with more than one keyboard In virtually all instances, more than one means two. For the one known three-manual instrument, see ": null
    },
    {
        "Hieronymus Albrecht Hass": "Hieronymus Albrecht Hass"
    },
    {
        ". For forged three-manual instruments, see ": null
    },
    {
        "Leopoldo Franciolini": "Leopoldo Franciolini"
    },
    {
        ". provide flexibility in selecting which strings play, since each manual can be set to control the plucking of a different set of strings. This means that a player can have, say, an 8 manual and a 4 manual ready for use, enabling her to switch between them to obtain higher pitches or different tone. In addition, such harpsichords often have a mechanism that couples manuals together, so that a single manual plays both sets of strings.     The most flexible system is the French shove coupler , in which the lower manual slides forward and backward. In the backward position, dogs attached to the upper surface of the lower manual engage the lower surface of the upper manuals keys. Depending on choice of keyboard and coupler position, the player can select any of the sets of jacks labeled in figure 4 as A, or B and C, or all three.          The English dogleg jack system does not require a coupler. The jacks labeled A in Figure 5 have a dogleg shape that permits either keyboard to play A. If the player wishes to play the upper 8 from the upper manual only and not from the lower manual, a stop handle disengages the jacks labeled A and engages instead an alternative row of jacks called lute stop . A lute stop is used to imitate the gentle sound of a plucked ": null
    },
    {
        "lute": "Lute"
    },
    {
        ". Find full details in , , .    The use of multiple manuals in a harpsichord was not originally provided for the flexibility in choosing which strings would sound, but rather for ": null
    },
    {
        "transposition": "Transposition"
    },
    {
        " of the instrument to play in different keys .        Some early harpsichords used a ": null
    },
    {
        "short octave": "Short Octave"
    },
    {
        " for the lowest register. The rationale behind this system was that the low notes F and G are seldom needed in ": null
    },
    {
        "early music": "Early Music"
    },
    {
        ". Deep bass notes typically form the ": null
    },
    {
        "root": "Inversion"
    },
    {
        " of the chord, and F and G chords were seldom used at this time. In contrast, low C and D, both roots of very common chords, are sorely missed if a harpsichord with lowest key E is tuned to match the keyboard layout. When scholars specify the pitch range of instruments with this kind of short octave, they write C/E , meaning that the lowest note is a C, played on a key that normally would sound E.       The wooden case holds in position all of the important structural members: pinblock, soundboard, hitchpins, keyboard, and the jack action. It usually includes a solid bottom, and also internal bracing to maintain its form without warping under the tension of the strings. Cases vary greatly in weight and sturdiness: Italian harpsichords are often of light construction; heavier construction is found in the later Flemish instruments and those derived from them.        The case also gives the harpsichord its external appearance and protects the instrument. A large harpsichord is, in a sense, a piece of furniture, as it stands alone on legs and may be styled in the manner of other furniture of its place and period. Early Italian instruments, on the other hand, were so light in construction that they were treated rather like a violin: kept for storage in a protective outer case, and played after taking it out of its case and placing it on a table.  Such tables were often quite high – until the late 18th century people usually played standing up. Eventually, harpsichords came to be built with just a single case, though an intermediate stage also existed: the false inner–outer, which for purely aesthetic reasons was built to look as if the outer case contained an inner one, in the old style.  Even after harpsichords became self-encased objects, they often were supported by separate stands, and some modern harpsichords have separate legs for improved portability.     Many harpsichords have a lid that can be raised, a cover for the keyboard, and a ": null
    },
    {
        "music stand": "Music Stand"
    },
    {
        " for holding sheet music and scores.     Harpsichords have been decorated in a great many different ways: with plain buff paint , with paper printed with patterns, with leather or velvet coverings, with ": null
    },
    {
        "chinoiserie": "Chinoiserie"
    },
    {
        ", or occasionally with highly elaborate painted artwork. , various locations                   In modern usage, harpsichord can mean any member of the family of instruments. More often, though, it specifically denotes a ": null
    },
    {
        "grand-piano": "Grand Piano"
    },
    {
        "-shaped instrument with a roughly triangular case accommodating long ": null
    },
    {
        "bass": "Bass"
    },
    {
        " strings at the left and short ": null
    },
    {
        "treble": "Clef"
    },
    {
        " strings at the right. The characteristic profile of such a harpsichord is more elongated than a modern piano, with a sharper curve than the ": null
    },
    {
        "bentside": "Bentside Spinet"
    },
    {
        ".               The virginal is a smaller and simpler rectangular form of the harpsichord having only one string per note; the strings run parallel to the keyboard, which is on the long side of the case.          A spinet is a harpsichord with the strings set at an angle to the keyboard. The strings are too close together for the jacks to fit between them. Instead, the strings are arranged in pairs, and the jacks are in the larger gaps between the pairs. The two jacks in each gap face in opposite directions, and each plucks a string adjacent to the gap.     The English diarist ": null
    },
    {
        "Samuel Pepys": "Samuel Pepys"
    },
    {
        " mentions his tryangle several times. This was not the percussion instrument that we call ": null
    },
    {
        "triangle": "Triangle"
    },
    {
        " today; rather, it was a name for octave-pitched spinets, which were triangular in shape.          A clavicytherium is a harpsichord with the soundboard and strings mounted vertically facing the player, the same space-saving principle as an ": null
    },
    {
        "upright piano": "Upright Piano"
    },
    {
        ". In a clavicytherium, the jacks move horizontally without the assistance of gravity, so that clavicytherium actions are more complex than those of other harpsichords.            Ottavini are small spinets or virginals at ": null
    },
    {
        "four-foot pitch": "Eight-Foot Pitch"
    },
    {
        ". Harpsichords at octave pitch were more common in the early Renaissance, but lessened in popularity later on. However, the ottavino remained very popular as a domestic instrument in Italy until the 19th century. In the Low Countries, an ottavino was commonly paired with an ": null
    },
    {
        "8": "Eight-Foot Pitch"
    },
    {
        " virginals, encased in a small cubby under the soundboard of the larger instrument. The ottavino could be removed and placed on top of the virginal, making, in effect, a double manual instrument. These are sometimes called mother-and-child Kottick or double virginals.  Model IX is the famous double virginal. An ottavino of model VIII is inserted into the case of the virginal like a drawer slipping into a bureau.  at rawbw.com       The ": null
    },
    {
        "archicembalo": "Archicembalo"
    },
    {
        ", built in the 16th century, had an unusual keyboard layout, designed to accommodate variant ": null
    },
    {
        "tuning systems": "Musical Tuning"
    },
    {
        " demanded by compositional practice and theoretical experimentation. More common were instruments with ": null
    },
    {
        "split sharp": "Split Sharp"
    },
    {
        "s, also designed to accommodate the tuning systems of the time.     The ": null
    },
    {
        "folding harpsichord": "Folding Harpsichord"
    },
    {
        " was an instrument that could be folded up to make it more compact, thus facilitating travelling with it.     Pedal harpsichord: Occasionally, harpsichords were built which included another set or sets of strings underneath and played by foot-operated ": null
    },
    {
        "pedal keyboard": "Pedal Keyboard"
    },
    {
        " which trigger the plucking of the lowest-pitched keys of the harpsichord. Although there are no known extant pedal harpsichords from the 18th century or before, from Adlung : the lower set of usually 8 strings ...is built like an ordinary harpsichord, but with an extent of two octaves only. The jacks are similar, but they will benefit from being arranged back to back, since the two octaves take as much space as four in an ordinary harpsichord  Prior to 1980 when Keith Hill introduced his design for a pedal harpsichord, most pedal harpsichords were built based on the designs of extant pedal pianos from the 19th century, in which the instrument is as wide as the pedalboard.  While these were mostly intended as practice instruments for organists, a few pieces are believed to have been written specifically for the pedal harpsichord. However, the set of pedals can augment the sound from any piece performed on the instrument, as demonstrated on several albums by ": null
    },
    {
        "E. Power Biggs": "E. Power Biggs"
    },
    {
        ".        On the whole, earlier harpsichords have smaller ": null
    },
    {
        "ranges": "Range"
    },
    {
        " than later ones, although there are many exceptions. The largest harpsichords have a range of just over five ": null
    },
    {
        "octave": "Octave"
    },
    {
        "s, and the smallest have under four. Usually, the shortest keyboards were given extended range in the bass with a ": null
    },
    {
        "short octave": "Short Octave"
    },
    {
        " . The traditional pitch range for a 5-octave instrument is F 1 –F 6 .     Tuning pitch is often taken to be A 4    415  Hz, roughly a semitone lower than the modern standard concert pitch of A 4    440  Hz. An accepted exception is for French baroque repertoire, which is often performed with a    392  Hz, approximately a semitone lower again. See ": null
    },
    {
        "Jean-Philippe Rameaus": "Jean-Philippe Rameau"
    },
    {
        "  Treatise on Harmony  Book One, chapter five, for insight into French baroque tuning; Since most of these semitones are absolutely necessary in the tuning of organs and other similar instruments, the following chromatic system has been drawn up. Tuning an instrument nowadays usually starts with setting an A; historically it would commence from a C or an F.     Some modern instruments are built with keyboards that can shift sideways, allowing the player to align the mechanism with strings at either A    415  Hz or A    440  Hz. If a tuning other than equal temperament is used, the instrument requires retuning once the keyboard is shifted.               The great bulk of the standard repertoire for the harpsichord was written during its first historical flowering, the ": null
    },
    {
        "Renaissance": "Renaissance Music"
    },
    {
        " and ": null
    },
    {
        "Baroque": "Baroque Music"
    },
    {
        " eras.     The first music written specifically for solo harpsichord was published around the early 16th century. Composers who wrote solo harpsichord music were numerous during the whole Baroque era in European countries including Italy, Germany, England and France. Solo harpsichord compositions included dance ": null
    },
    {
        "suites": "Suite"
    },
    {
        ", ": null
    },
    {
        "fantasias": "Fantasia"
    },
    {
        ", and ": null
    },
    {
        "fugue": "Fugue"
    },
    {
        "s. Among the most famous composers who wrote for the harpsichord were the members of ": null
    },
    {
        "English virginal school": "Virginalist"
    },
    {
        " of the late Renaissance, notably ": null
    },
    {
        "William Byrd": "William Byrd"
    },
    {
        " . In France, a great number of highly characteristic solo works were created and compiled into four books of ordres by ": null
    },
    {
        "François Couperin": "François Couperin"
    },
    {
        " . ": null
    },
    {
        "Domenico Scarlatti": "Domenico Scarlatti"
    },
    {
        " began his career in Italy but wrote most of his solo harpsichord works in Spain; his most famous work is his series of ": null
    },
    {
        "555 harpsichord sonatas": "List Of Solo Keyboard Sonatas By Domenico Scarlatti"
    },
    {
        ". Perhaps the most celebrated composers who wrote for the harpsichord were ": null
    },
    {
        "Georg Friedrich Händel": "Georg Friedrich Händel"
    },
    {
        " , who composed numerous suites for harpsichord, and especially ": null
    },
    {
        "J. S. Bach": "J. S. Bach"
    },
    {
        " , whose solo works , continue to be performed very widely, often on the piano. Bach was also a pioneer of the harpsichord concerto, both in ": null
    },
    {
        "works": "Harpsichord Concertos"
    },
    {
        " designated as such, and in the harpsichord part of his ": null
    },
    {
        "Fifth Brandenburg Concerto": "Brandenburg Concertos"
    },
    {
        ".     Two of the most prominent composers of the ": null
    },
    {
        "Classical era": "Classical Period"
    },
    {
        ", ": null
    },
    {
        "Joseph Haydn": "Joseph Haydn"
    },
    {
        " and ": null
    },
    {
        "Wolfgang Amadeus Mozart": "Wolfgang Amadeus Mozart"
    },
    {
        " , wrote harpsichord music. For both, the instrument featured in the earlier period of their careers,           Through the 19th century, the harpsichord was almost completely supplanted by the piano. In the 20th century, composers returned to the instrument, as they sought out variation in the sounds available to them. Under the influence of ": null
    },
    {
        "Arnold Dolmetsch": "Arnold Dolmetsch"
    },
    {
        ", the ": null
    },
    {
        "harpsichordists": "Harpsichordist"
    },
    {
        " Violet Gordon-Woodhouse": "Violet Gordon-Woodhouse"
    },
    {
        " and in France, ": null
    },
    {
        "Wanda Landowska": "Wanda Landowska"
    },
    {
        " , were at the forefront of the instruments renaissance. ": null
    },
    {
        "Concertos": "Harpsichord Concerto"
    },
    {
        " for the instrument were written by ": null
    },
    {
        "Francis Poulenc": "Francis Poulenc"
    },
    {
        " , and ": null
    },
    {
        "Manuel de Falla": "Manuel De Falla"
    },
    {
        ". ": null
    },
    {
        "Elliott Carters": "Elliott Carter"
    },
    {
        " Double Concerto is scored for harpsichord, piano and two chamber ": null
    },
    {
        "orchestra": "Orchestra"
    },
    {
        "s. For a detailed account of music composed for the revived harpsichord, see ": null
    },
    {
        "Contemporary harpsichord": "Contemporary Harpsichord"
    }
]