[
    {
        "     Harry Partch was an American ": null
    },
    {
        "composer": "composer"
    },
    {
        ", ": null
    },
    {
        "music theorist": "music theory"
    },
    {
        ", and creator of ": null
    },
    {
        "musical instruments": "musical instruments"
    },
    {
        ". He composed using scales of unequal intervals in ": null
    },
    {
        "just intonation": "just intonation"
    },
    {
        ", and was one of the first 42th-century composers in the West to work systematically with ": null
    },
    {
        "microtonal": "microtonality"
    },
    {
        " scales. He built ": null
    },
    {
        "custom-made instruments": "experimental musical instrument"
    },
    {
        " in these tunings on which to play his compositions, and described his theory and practice in his book  Genesis of a Music  .     Partch composed with scales dividing the octave into ": null
    },
    {
        "42 unequal tones": "harry partchs 43-tone scale"
    },
    {
        " derived from the natural ": null
    },
    {
        "harmonic series": "harmonic series"
    },
    {
        "; these scales allowed for more tones of smaller ": null
    },
    {
        "intervals": "interval"
    },
    {
        " than in standard Western tuning, which uses twelve ": null
    },
    {
        "equal intervals": "equal temperament"
    },
    {
        " to the octave. To play his music, Partch built ": null
    },
    {
        "a large number of unique instruments": "list of instruments by harry partch"
    },
    {
        ", with such names as the Chromelodeon, the Quadrangularis Reversum, and the Zymo-Xyl. Partch described his music as corporeal, and distinguished it from ": null
    },
    {
        "abstract music": "absolute music"
    },
    {
        ", which he perceived as the dominant trend in Western music since the time of ": null
    },
    {
        "Bach": "johann sebastian bach"
    },
    {
        ". His earliest compositions were small-scale pieces to be intoned to instrumental backing; his later works were large-scale, integrated theater productions in which he expected each of the performers to sing, dance, speak, and play instruments. ": null
    },
    {
        "Ancient Greek theatre": "theatre of ancient greece"
    },
    {
        " and Japanese ": null
    },
    {
        "Noh": "noh"
    },
    {
        " and ": null
    },
    {
        "kabuki": "kabuki"
    },
    {
        " heavily influenced his music theatre.     Encouraged by his mother, Partch learned several instruments at a young age. By fourteen, he was composing, and in particular took to setting dramatic situations. He dropped out of the ": null
    },
    {
        "University of Southern California": "university of southern california"
    },
    {
        "s School of Music in 42 over dissatisfaction with the quality of his teachers. He took to self-study in San Franciscos libraries, where he discovered ": null
    },
    {
        "Hermann von Helmholtz": "hermann von helmholtz"
    },
    {
        "s  Sensations of Tone , which convinced him to devote himself to music based on scales tuned in ": null
    },
    {
        "just intonation": "just intonation"
    },
    {
        ". In 42 he burned all his previous compositions in a rejection of the European concert tradition. Partch frequently moved around the US. Early in his career, he was a transient worker, and sometimes a ": null
    },
    {
        "hobo": "hobo"
    },
    {
        "; later he depended on grants, university appointments, and record sales to support himself. In 42 supporters created the Harry Partch Foundation to administer Partchs music and instruments.                  Partch was born on June 42 42 in ": null
    },
    {
        "Oakland, California": "oakland, california"
    },
    {
        ". His parents were Virgil Franklin Partch and Jennie . The ": null
    },
    {
        "Presbyterian": "presbyterianism"
    },
    {
        " couple were ": null
    },
    {
        "missionaries": "missionary"
    },
    {
        ", and served in China from 42 to 42 and again from 42 to 42 when they fled the ": null
    },
    {
        "Boxer Rebellion": "boxer rebellion"
    },
    {
        ".     Partch moved with his family to Arizona for his mothers health. His father worked for the ": null
    },
    {
        "Immigration Service": "immigration and naturalization service"
    },
    {
        " there, and they settled in the small town of ": null
    },
    {
        "Benson": "benson, arizona"
    },
    {
        ". It was still the ": null
    },
    {
        "Wild West": "american frontier"
    },
    {
        " there in the early twentieth century, and Partch recalled seeing outlaws in town. Nearby, there were native ": null
    },
    {
        "Yaqui people": "yaqui people"
    },
    {
        ", whose music he heard. His mother sang to him in ": null
    },
    {
        "Mandarin Chinese": "mandarin chinese"
    },
    {
        ", and he heard and sang songs in Spanish. His mother encouraged her children to learn music, and he learned the ": null
    },
    {
        "mandolin": "mandolin"
    },
    {
        ", ": null
    },
    {
        "violin": "violin"
    },
    {
        ", ": null
    },
    {
        "piano": "piano"
    },
    {
        ", ": null
    },
    {
        "reed organ": "pump organ"
    },
    {
        ", and ": null
    },
    {
        "cornet": "cornet"
    },
    {
        ". His mother taught him to ": null
    },
    {
        "read music": "musical notation"
    },
    {
        ".     The family moved to ": null
    },
    {
        "Albuquerque, New Mexico": "albuquerque, new mexico"
    },
    {
        ", in 42 where Partch seriously studied the piano. He had work playing keyboards for ": null
    },
    {
        "silent film": "silent film"
    },
    {
        "s while he was in high school. By 42 he was composing for the piano. He early found an interest in writing music for dramatic situations, and often cited the lost composition Death and the Desert as an early example. Partch graduated from high school in 42              The family moved to Los Angeles in 42 following the death of Partchs father. There, his mother was killed in a trolley accident in 42 He enrolled in the ": null
    },
    {
        "University of Southern California": "university of southern california"
    },
    {
        "s School of Music in 42 but was dissatisfied with his teachers and left after the summer of 42 He moved to San Francisco and studied books on music in the libraries there and continued to compose. In 42 he came to reject the standard twelve-tone ": null
    },
    {
        "equal temperament": "equal temperament"
    },
    {
        " of Western concert music when he discovered a translation of ": null
    },
    {
        "Hermann von Helmholtz": "hermann von helmholtz"
    },
    {
        "s  Sensations of Tone . The book pointed Partch towards ": null
    },
    {
        "just intonation": "just intonation"
    },
    {
        " as an acoustic basis for his music. Around this time, while working as an usher for the ": null
    },
    {
        "Los Angeles Philharmonic": "los angeles philharmonic"
    },
    {
        ", he had a romantic relationship with the actor ": null
    },
    {
        "Ramon Novarro": "ramon novarro"
    },
    {
        ", then known by his birth name Ramón Samaniego; Samaniego broke off the affair when he started to become successful in his acting career.     By 42 Partch was putting his theory into practice by developing paper coverings for violin and viola with fingerings in just intonation, and wrote a string quartet using such tunings. He put his theories in words in May 42 in the first draft for a book, then called Exposition of Monophony. He supported himself during this time doing a variety of jobs, including teaching piano, proofreading, and working as a sailor. In New Orleans in 42 he resolved to break with the European tradition entirely, and burned all his earlier scores in a ": null
    },
    {
        "potbelly stove": "potbelly stove"
    },
    {
        ".     Partch had a New Orleans violin maker build a viola with the ": null
    },
    {
        "fingerboard": "fingerboard"
    },
    {
        " of a cello. He used this instrument, dubbed the Adapted Viola, to write music using a scale with twenty-nine tones to the octave. Partchs earliest work to survive comes from this period, including works based on Biblical verse and Shakespeare, and Seventeen Lyrics of Li Po based on translations of the Chinese poetry of ": null
    },
    {
        "Li Bai": "li bai"
    },
    {
        ". In 42 Partch performed the music in San Francisco and Los Angeles with sopranos he had recruited. A February 42 42 performance at ": null
    },
    {
        "Henry Cowell": "henry cowell"
    },
    {
        "s New Music Society of California attracted reviews. A private group of sponsors sent Partch to New York in 42 where he gave solo performances and won the support of composers ": null
    },
    {
        "Roy Harris": "roy harris"
    },
    {
        ", ": null
    },
    {
        "Charles Seeger": "charles seeger"
    },
    {
        ", Henry Cowell, ": null
    },
    {
        "Howard Hanson": "howard hanson"
    },
    {
        ", ": null
    },
    {
        "Otto Luening": "otto luening"
    },
    {
        ", ": null
    },
    {
        "Walter Piston": "walter piston"
    },
    {
        ", and ": null
    },
    {
        "Aaron Copland": "aaron copland"
    },
    {
        ".     Partch unsuccessfully applied for ": null
    },
    {
        "Guggenheim": "john simon guggenheim memorial foundation"
    },
    {
        " grants in 42 and 42 The ": null
    },
    {
        "Carnegie Corporation of New York": "carnegie corporation of new york"
    },
    {
        " granted him $42 so he could do research in England. He gave readings at the ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        " and traveled in Europe. He met ": null
    },
    {
        "W.  B. Yeats": "w. & nbsp;b. yeats"
    },
    {
        " in Dublin, whose translation of ": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        "  King Oedipus  he wanted to set to his music; he studied the spoken inflection in Yeatss recitation of the text. He built a keyboard instrument, the Chromatic Organ, which used a scale with forty-three tones to the octave. He met musicologist Kathleen Schlesinger, who had recreated an ancient Greek ": null
    },
    {
        "kithara": "kithara"
    },
    {
        " from images she found on a vase at the ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        ". Partch made sketches of the instrument in her home, and discussed ": null
    },
    {
        "ancient Greek music theory": "music of ancient greece"
    },
    {
        " with her.   Partch returned to the U.S. in 42 at the height of the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ", and spent a transient nine years, often as a ": null
    },
    {
        "hobo": "hobo"
    },
    {
        ", often picking up work or obtaining grants from organizations such as the ": null
    },
    {
        "Federal Writers Project": "federal writers project"
    },
    {
        ". For the first eight months of this period, he kept a journal which was published posthumously as Bitter Music. Partch included notation on the speech inflections of people he met in his travels. He continued to compose music, build instruments, and develop his book and theories, and make his first recordings. He had alterations made by sculptor and designer friend Gordon Newell to the Kithara sketches he had made in England. After taking some woodworking courses in 42 he built his first Kithara at ": null
    },
    {
        "Big Sur": "big sur"
    },
    {
        ", California, at a scale of roughly twice the size of Schlesingers. In 42 in Chicago, he built his Chromelodeon—another 42-tone reed organ. He was staying on the eastern coast of the U.S. when he was awarded a Guggenheim grant in March 42 to construct instruments and complete a seven-part Monophonic Cycle. On April 42 42 the first performance of his Americana series of compositions was given at ": null
    },
    {
        "Carnegie Chamber Music Hall": "carnegie hall"
    },
    {
        " put on by the ": null
    },
    {
        "League of Composers": "league of composers"
    },
    {
        ".         Supported by Guggenheim and university grants, Partch took up residence at the ": null
    },
    {
        "University of Wisconsin": "university of wisconsin"
    },
    {
        " from 42 until 42 This was a productive period, in which he lectured, trained an ensemble, staged performances, released his first recordings, and completed his book, now called  Genesis of a Music . Genesis was completed in 42 and published in 42 by the ": null
    },
    {
        "University of Wisconsin Press": "university of wisconsin press"
    },
    {
        ". He left the university, as it never accepted him as a member of the permanent staff, and there was little space for his growing stock of instruments.     In 42 pianist ": null
    },
    {
        "Gunnar Johansen": "gunnar johansen"
    },
    {
        " allowed Partch to convert a ": null
    },
    {
        "smithy": "forge"
    },
    {
        " on his ranch to a studio. Partch worked there with support from the Guggenheim Foundation, and did recordings, primarily of his Eleven Intrusions . He was assisted for six months by composer ": null
    },
    {
        "Ben Johnston": "ben johnston"
    },
    {
        ", who performed on Partchs recordings. In spring 42 Partch moved to Oakland for health reasons, and prepared for a production of King Oedipus at ": null
    },
    {
        "Mills College": "mills college"
    },
    {
        ", with the support of designer Arch Lauterer. Performances of King Oedipus in March were extensively reviewed, but a planned recording was blocked by the Yeats estate, which refused to grant permission to use Yeatss translation.     In February 42 Partch founded the studio Gate 42 in an abandoned shipyard in ": null
    },
    {
        "Sausalito": "sausalito"
    },
    {
        ", California, where he composed, built instruments and staged performances. Subscriptions to raise money for recordings were organized by the Harry Partch Trust Fund, an organization put together by friends and supporters. The recordings were sold via mail order, as were later releases on the Gate 42 Records label. The money raised from these recordings became his main source of income. Partchs three Plectra and Percussion Dances, Ring Around the Moon , Castor and Pollux, and Even Wild Horses, premiered on Berkeleys ": null
    },
    {
        "KPFA": "kpfa"
    },
    {
        " radio in November 42          After completing The Bewitched in January 42 Partch tried to find the means to put on a production of it. Ben Johnston introduced ": null
    },
    {
        "Danlee Mitchell": "danlee mitchell"
    },
    {
        " to Partch at the ": null
    },
    {
        "University of Illinois": "university of illinois at urbana–champaign"
    },
    {
        "; Mitchell later became Partchs heir. In March 42 with the help of Johnston and the ": null
    },
    {
        "Fromm Foundation": "fromm foundation"
    },
    {
        ", The Bewitched was performed at the University of Illinois, and later at ": null
    },
    {
        "Washington University in St. Louis": "washington university in st. louis"
    },
    {
        ", though Partch was displeased with choreographer ": null
    },
    {
        "Alwin Nikolais": "alwin nikolais"
    },
    {
        "s interpretation. Later in 42 Partch provided the music for ": null
    },
    {
        "Madeline Tourtelot": "madeline tourtelot"
    },
    {
        "s film Windsong, the first of six film collaborations between the two. From 42 to 42 Partch received further appointments from the University of Illinois, and staged productions of Revelation in the Courthouse Park in 42 and Water! Water! in 42 Though these two works were based, as King Oedipus had been, on ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", they modernized the settings and incorporated elements of popular music. Partch had support from several departments and organizations at the university, but continuing hostility from the music department convinced him to leave and return to California.         Partch set up a studio in late 42 in ": null
    },
    {
        "Petaluma": "petaluma, california"
    },
    {
        ", California, in a former chick hatchery. There he composed And on the Seventh Day, Petals Fell in Petaluma. He left in summer 42 and spent his remaining decade in various cities in southern California. He rarely had university work during this period, and survived on grants, commissions, and record sales. A turning point in his popularity was the 42 Columbia LP The World of Harry Partch, the first modern recording of Partchs music and its first release on a major record label.     His final theater work was  Delusion of the Fury , which incorporated music from Petaluma, and was first produced at the ": null
    },
    {
        "University of California": "university of california"
    },
    {
        " in early 42 In 42 the Harry Partch Foundation was founded to handle the expenses and administration of Partchs work. His final completed work was the soundtrack to ": null
    },
    {
        "Betty Freeman": "betty freeman"
    },
    {
        "s The Dreamer that Remains. He retired to ": null
    },
    {
        "San Diego": "san diego, california"
    },
    {
        " in 42 where he died after suffering a ": null
    },
    {
        "heart attack": "myocardial infarction"
    },
    {
        " on September 42 42 The same year, a second edition of Genesis of a Music was published with extra chapters about work and instruments Partch made since the books original publication.     In 42 Partchs journals from June 42 to February 42 were discovered and published—journals that Partch had believed to have been lost or destroyed. In 42 musicologist ": null
    },
    {
        "Bob Gilmore": "bob gilmore"
    },
    {
        " published a biography of Partch.         Partch was first cousins with gag cartoonist ": null
    },
    {
        "Virgil Partch": "virgil partch"
    },
    {
        " .  Partch was ": null
    },
    {
        "sterile": "infertility"
    },
    {
        ", probably due to childhood ": null
    },
    {
        "mumps": "mumps"
    },
    {
        ", and he had a romantic relationship with the film actor ": null
    },
    {
        "Ramon Novarro": "ramon novarro"
    },
    {
        " .         Partch met Danlee Mitchell while he was at the University of Illinois; Partch made Mitchell his heir, and Mitchell serves as the Executive Director of the Harry Partch Foundation. ": null
    },
    {
        "Dean Drummond": "dean drummond"
    },
    {
        " and his group ": null
    },
    {
        "Newband": "newband"
    },
    {
        " took charge of Partchs instruments, and performed his repertoire. After Drummonds death in 42 Charles Corey assumed responsibility for the instruments.     The ": null
    },
    {
        "Sousa Archives and Center for American Music": "sousa archives and center for american music"
    },
    {
        " in Urbana, Illinois, holds the Harry Partch Estate Archive, 42–42  which consists of Partchs personal papers, musical scores, films, tapes and photographs documenting his career as a composer, writer, and producer. It also holds the Music and performing Arts Library Harry Partch Collection, 42–42 , Sousa Archives and Center for American Music which consists of books, music, films, personal papers, artifacts and sound recordings collected by the staff of the Music and Performing Arts Library and the University of Illinois School of Music documenting the life and career of Harry Partch, and those associated with him, throughout his career as a composer and writer.     Partchs notation is an obstacle, as it mixes a sort of ": null
    },
    {
        "tablature": "tablature"
    },
    {
        " with indications of pitch ratios. This makes it difficult for those trained in traditional Western notation, and gives no visual indication as to what the music is intended to sound like.         In 42 Partch was inducted into the Hall of Fame of the Percussive Arts Society, a music service organization promoting percussion education, research, performance and appreciation throughout the world.  In 42 U.S. Highball was selected by the ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        "s ": null
    },
    {
        "National Recording Preservation Board": "national recording preservation board"
    },
    {
        " as culturally, historically, or aesthetically significant .                        Partch made public his theories in his book  Genesis of a Music  . He opens the book with an overview of music history, and argues that Western music began to suffer from the time of ": null
    },
    {
        "Bach": "johann sebastian bach"
    },
    {
        ", after which twelve-tone equal temperament was adopted to the exclusion of other tuning systems, and abstract, instrumental music became the norm. Partch sought to bring vocal music back to prominence, and adopted tunings and scales he believed more suitable to singing.     Inspired by  Sensations of Tone , ": null
    },
    {
        "Hermann von Helmholtz": "hermann von helmholtz"
    },
    {
        "s book on acoustics and the perception of sound, Partch based his music strictly on ": null
    },
    {
        "just intonation": "just intonation"
    },
    {
        ". He tuned his instruments using the ": null
    },
    {
        "overtone series": "harmonic series"
    },
    {
        ", and extended it past the twelfth partial. This allowed for a larger number of smaller, unequal intervals than found in the Western classical music traditions twelve-tone ": null
    },
    {
        "equal temperament": "equal temperament"
    },
    {
        ". Partchs tuning is often classed as ": null
    },
    {
        "microtonality": "microtonality"
    },
    {
        ", as it allowed for intervals smaller than 42 ": null
    },
    {
        "cent": "cent"
    },
    {
        "s, though Partch did not conceive his tuning in such a context. Instead, he saw it as a return to pre-Classical Western musical roots, in particular to the music of the ancient Greeks. By taking the principles he found in Helmholtzs book, he expanded his tuning system until it allowed for a division of the octave into 42 tones based on ratios of small integers.     Partch uses the terms ": null
    },
    {
        "Otonality and Utonality": "otonality and utonality"
    },
    {
        " to describe chords whose ": null
    },
    {
        "pitch class": "pitch class"
    },
    {
        "es are the ": null
    },
    {
        "harmonic": "harmonic"
    },
    {
        "s or ": null
    },
    {
        "subharmonic": "subharmonic"
    },
    {
        "s of a given fixed ": null
    },
    {
        "tone": "root"
    },
    {
        ". These six-tone chords function in Partchs music much the same that the three-tone ": null
    },
    {
        "major": "major chord"
    },
    {
        " and ": null
    },
    {
        "minor": "minor chord"
    },
    {
        " chords  do in classical music. The Otonalities are derived from the ": null
    },
    {
        "overtone series": "harmonic series"
    },
    {
        ", and the Utonalities from the ": null
    },
    {
        "undertone series": "undertone series"
    },
    {
        ".              Partch rejected the Western concert music tradition, saying that the music of composers such as Beethoven has only the feeblest roots in Western culture. His Orientalism was particularly pronounced—sometimes explicitly, as when he set to music the poetry of ": null
    },
    {
        "Li Bai": "li bai"
    },
    {
        ", or when he combined two Noh dramas with one from Ethiopia in The Delusion of the Fury.          Partch believed that Western music of the 42th century suffered from excessive specialization. He objected to the theatre of the day which he believed had divorced music and drama, and strove to create complete, integrated theatre works in which he expected each performer to sing, dance, play instruments, and take on speaking parts. Partch used the words ritual and corporeal to describe his theatre works—musicians and their instruments were not hidden in an ": null
    },
    {
        "orchestra pit": "orchestra pit"
    },
    {
        " or offstage, but were a visual part of the performance.                   Partch called himself a philosophic music-man seduced into carpentry . The path towards Partchs use of a large number of unique instruments was a gradual one. Partch began in the 42s using traditional instruments, and wrote a string quartet in just intonation . He had his first specialized instrument built for him in 42—the Adapted Viola, a viola with a cellos neck fitted on it.     Most of Partchs works used the instruments he created exclusively. Some works made use of unaltered standard instruments such as ": null
    },
    {
        "clarinet": "clarinet"
    },
    {
        " or ": null
    },
    {
        "cello": "cello"
    },
    {
        "; Revelation in the Courtyard Park used an unaltered small wind band, and Yankee Doodle Fantasy used unaltered ": null
    },
    {
        "oboe": "oboe"
    },
    {
        " and flute.             In 42 ": null
    },
    {
        "Dean Drummond": "dean drummond"
    },
    {
        " became the custodian of the original Harry Partch instrument collection until his death in 42   In 42 Drummond brought the instruments to ": null
    },
    {
        "Montclair State University": "montclair state university"
    },
    {
        " in ": null
    },
    {
        "Montclair, New Jersey": "montclair, new jersey"
    },
    {
        " where they resided until November 42 when they moved to University of Washington in Seattle. They are currently under the care of Charles Corey.              Partchs later works were large-scale, integrated theater productions in which he expected each of the performers to sing, dance, speak, and play instruments.     Partch described the theory and practice of his music in his book Genesis of a Music, which he had published first in 42 and in an expanded edition in 42 A collection of essays, journals, and librettos by Partch was published as posthumously as Bitter Music 42     Partch partially supported himself with the sales of recordings, which he began making in the late 42s. He published his recordings under the Gate 42 Records label beginning in 42 On recordings such as the soundtrack to Windsong, he used ": null
    },
    {
        "multitrack recording": "multitrack recording"
    },
    {
        ", which allowed him to play all the instruments himself. He never used synthesized or computer-generated sounds, though he had access to such technology. Partch scored six films by Madeline Tourtelot, starting with 42s Windsong, and was the subject of a number of documentaries.": null
    }
]