[
    {
        "     Hasid  is a Jewish honorific, frequently used as a term of exceptional respect in the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        "ic and early medieval periods. In classic ": null
    },
    {
        "Rabbinic literature": "rabbinic literature"
    },
    {
        " it differs from ": null
    },
    {
        "Tzadik": "tzadik"
    },
    {
        " by instead denoting one who goes beyond the legal requirements of ritual and ethical ": null
    },
    {
        "Jewish observance": "halacha"
    },
    {
        " in daily life. The literal meaning of Hasid derives from ": null
    },
    {
        "Chesed": "chesed"
    },
    {
        " , the outward expression of love for God and other people. This spiritual devotion motivates pious conduct beyond everyday limits. The devotional nature of its description lent itself to a few Jewish movements in history being known as Hasidim . Two of these derived from the Jewish ": null
    },
    {
        "mystical tradition": "jewish mysticism"
    },
    {
        ", as it could tend towards piety over legalism.     As a personal honorific, both Hasid and Tzadik could be applied independently to the same individual with both different qualities. The 18th-century ": null
    },
    {
        "Vilna Gaon": "vilna gaon"
    },
    {
        ", for instance, at that time the chief ": null
    },
    {
        "opponent": "misnagdim"
    },
    {
        " of the new Jewish mystical movement that became known as ": null
    },
    {
        "Hasidism": "hasidic judaism"
    },
    {
        " , was renowned for his righteous life. In tribute to his scholarship, he became popularly honored with the formal title of ": null
    },
    {
        "Genius": "gaon"
    },
    {
        " , while amongst the Hasidic movements leadership, despite his fierce opposition to their legalistic tendencies, he was respectfully referred to as The ": null
    },
    {
        "Gaon": "gaon"
    },
    {
        ", the Hasid from Vilna .     In the aggregate, it may refer to members of any of the following Jewish movements:     the ": null
    },
    {
        "Hasideans": "hasideans"
    },
    {
        " of the Maccabean period, around the 2nd century BCE   the ": null
    },
    {
        "Ashkenazi Hasidim": "ashkenazi hasidim"
    },
    {
        ", ascetic German mystical-ethical pietists of the 12th and 13th centuries   ": null
    },
    {
        "Hasidic Judaism": "hasidic judaism"
    },
    {
        ", a movement which began in ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " in the 18th century     ": null
    }
]