[
    {
        "           Hassium is a ": null
    },
    {
        "chemical element": "chemical element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "symbol"
    },
    {
        " Hs and the ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        " 108. It is not known to occur in nature and ": null
    },
    {
        "has been made only in laboratories": "synthetic element"
    },
    {
        " in minuscule quantities. Hassium is highly ": null
    },
    {
        "radioactive": "radioactive"
    },
    {
        "; the most stable known ": null
    },
    {
        "isotope": "isotope"
    },
    {
        ", 269 Hs, has a ": null
    },
    {
        "half-life": "half-life"
    },
    {
        " of approximately 16  seconds.     The first attempt to synthesize element 108 was made at the ": null
    },
    {
        "Joint Institute for Nuclear Research": "joint institute for nuclear research"
    },
    {
        " in ": null
    },
    {
        "Dubna": "dubna"
    },
    {
        ", ": null
    },
    {
        "Moscow Oblast": "moscow oblast"
    },
    {
        ", ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", in 1978. Another attempt was made at the same venue in 1983 and then in 1984; the latter resulted in a claim that element 108 had been produced. Later in 1984, an attempt was made at the ": null
    },
    {
        "Gesellschaft für Schwerionenforschung": "gesellschaft für schwerionenforschung"
    },
    {
        " in ": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        ", ": null
    },
    {
        "Hesse": "hesse"
    },
    {
        ", ": null
    },
    {
        "West Germany": "west germany"
    },
    {
        ", which claimed to have synthesized it. The 1993 report by the ": null
    },
    {
        "Joint Working Party": "iupac/iupap joint working party"
    },
    {
        " between the ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "international union of pure and applied chemistry"
    },
    {
        " and the ": null
    },
    {
        "International Union of Pure and Applied Physics": "international union of pure and applied physics"
    },
    {
        " concluded the report from Darmstadt was more conclusive on its own and the major credit was assigned to the German scientists, who then chose the name hassium after the German state of Hesse.     In the ": null
    },
    {
        "periodic table": "periodic table"
    },
    {
        " of the elements, hassium is a ": null
    },
    {
        "transactinide element": "transactinide element"
    },
    {
        ", a member of the ": null
    },
    {
        "7th period": "period 7"
    },
    {
        " and ": null
    },
    {
        "group 8": "group 8 elements"
    },
    {
        "; it is thus the sixth member of the 6d series of ": null
    },
    {
        "transition metal": "transition metal"
    },
    {
        "s. Chemistry experiments have confirmed that hassium behaves as the heavier ": null
    },
    {
        "homologue": "homology"
    },
    {
        " to ": null
    },
    {
        "osmium": "osmium"
    },
    {
        ", in group 8, reacting readily with oxygen to form a volatile ": null
    },
    {
        "tetroxide": "tetroxide"
    },
    {
        ". The chemical properties of hassium have only been partly characterized but they compare well with the chemistry of the other group 8 elements.                 The synthesis of element 108 was first attempted in 1978 by a research team led by ": null
    },
    {
        "Yuri Oganessian": "yuri oganessian"
    },
    {
        " at the ": null
    },
    {
        "Joint Institute for Nuclear Research": "joint institute for nuclear research"
    },
    {
        " in ": null
    },
    {
        "Dubna": "dubna"
    },
    {
        ", ": null
    },
    {
        "Moscow Oblast": "moscow oblast"
    },
    {
        ", ": null
    },
    {
        "Russian SFSR": "russian sfsr"
    },
    {
        ", ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". The team used a reaction that would generate 270 108 from ": null
    },
    {
        "radium": "radium"
    },
    {
        " and ": null
    },
    {
        "calcium": "calcium"
    },
    {
        ". The researchers were uncertain in interpreting their data, and their paper did not unambiguously claim to have discovered the element.  The same year, another team at JINR investigated the possibility of synthesis of element 108 in reactions between ": null
    },
    {
        "lead": "lead"
    },
    {
        " and ": null
    },
    {
        "iron": "iron"
    },
    {
        "; they were uncertain in interpreting the data, suggesting the possibility that element 108 had not been created.      In 1983, new experiments were performed at JINR. In each experiment, a thin layer of a target material was installed on a rotating wheel and bombarded at a shallow angle so fission fragments from spontaneously fissioning nuclides formed could escape the target and be detected in fission track detectors surrounding the wheel. The experiments probably resulted in the synthesis of element 108; ": null
    },
    {
        "bismuth": "bismuth"
    },
    {
        " was bombarded with ": null
    },
    {
        "manganese": "manganese"
    },
    {
        " to obtain 263 108, lead was bombarded with iron to obtain 264 108, and ": null
    },
    {
        "californium": "californium"
    },
    {
        " was bombarded with ": null
    },
    {
        "neon": "neon"
    },
    {
        " to obtain 270 108.  These experiments were not claimed as a discovery and Oganessian announced them in a conference rather than in a written report.      In 1984, JINR researchers in Dubna performed experiments set up identically to the previous ones; they bombarded bismuth and lead targets with ions of lighter elements manganese and iron, respectively. Twenty-one spontaneous fission events were recorded; these were assigned to 264 108.     Later in 1984, a research team led by ": null
    },
    {
        "Peter Armbruster": "peter armbruster"
    },
    {
        " and ": null
    },
    {
        "Gottfried Münzenberg": "gottfried münzenberg"
    },
    {
        " at the ": null
    },
    {
        "Gesellschaft für Schwerionenforschung": "gesellschaft für schwerionenforschung"
    },
    {
        "  in ": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        ", ": null
    },
    {
        "Hesse": "hesse"
    },
    {
        ", West Germany, attempted to create element 108. The team bombarded a lead target with accelerated iron nuclei.  GSIs experiment to create element 108 was delayed until after their creation of ": null
    },
    {
        "element 109": "meitnerium"
    },
    {
        " in 1982, as prior calculations had suggested that ": null
    },
    {
        "even–even": "even and odd atomic nucleieven proton, even neutron"
    },
    {
        " isotopes of element 108 would have ": null
    },
    {
        "spontaneous fission": "spontaneous fission"
    },
    {
        " half-lives of less than one ": null
    },
    {
        "microsecond": "microsecond"
    },
    {
        ", making them difficult to detect and identify.  The element 108 experiment finally went ahead after 266 109 had been synthesized and was found to decay by alpha emission, suggesting that isotopes of element 108 would do likewise, and this was corroborated by an experiment aimed at synthesising isotopes of ": null
    },
    {
        "element 106": "seaborgium"
    },
    {
        ". GSI reported synthesis of three atoms of 265 108. Two years later, they reported synthesis of one atom of the even–even 264 108.          In 1985, the ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "international union of pure and applied chemistry"
    },
    {
        " and the ": null
    },
    {
        "International Union of Pure and Applied Physics": "international union of pure and applied physics"
    },
    {
        " formed a ": null
    },
    {
        "Joint Working Party": "iupac/iupap joint working party"
    },
    {
        " to assess ": null
    },
    {
        "discoveries": "discovery of the chemical elements"
    },
    {
        " and establish final names for elements with atomic numbers greater than 100. The party held meetings with delegates from the three competing institutes; in 1990, they established criteria for recognition of an element and in 1991, they finished the work of assessing discoveries and disbanded. These results were published in 1993.          According to the report, the 1984 works from JINR and GSI simultaneously and independently established synthesis of element 108. Of the two 1984 works, the one from GSI was said to be sufficient as a discovery on its own. The JINR work, which preceded the GSI one, very probably displayed synthesis of element 108 but that was determined in retrospect given the work from Darmstadt; the JINR work had focused on chemically identifying remote granddaughters of element 108 isotopes , while the GSI work clearly identified the decay path of those element 108 isotopes. The report concluded that the major credit should be awarded to GSI.            According to ": null
    },
    {
        "Mendeleevs nomenclature for unnamed and undiscovered elements": "mendeleevs predicted elements"
    },
    {
        ", hassium should be known as eka-osmium . In 1979, IUPAC published recommendations according to which the element was to be called unniloctium and assigned the corresponding symbol of Uno ,  a ": null
    },
    {
        "systematic element name": "systematic element name"
    },
    {
        " as a ": null
    },
    {
        "placeholder": "placeholder name"
    },
    {
        " until the element was discovered and the discovery then confirmed, and a permanent name was decided. Although these recommendations were widely followed in the chemical community, most scientists in the field ignored them.  They either called it element 108 , with the symbols E108,  or 108, or used the proposed name hassium .     Armbruster and his colleagues, the officially recognized German discoverers, proposed the name hassium for element 108 in September 1992.  It is derived from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " name Hassia for the German state of ": null
    },
    {
        "Hesse": "hesse"
    },
    {
        " where the institute is located.      In 1994, IUPAC Commission on Nomenclature of Inorganic Chemistry recommended that element 108 be named hahnium after the German physicist ": null
    },
    {
        "Otto Hahn": "otto hahn"
    },
    {
        " so elements named after Hahn and ": null
    },
    {
        "Lise Meitner": "lise meitner"
    },
    {
        "  would be next to each other, honouring their joint discovery of ": null
    },
    {
        "nuclear fission": "nuclear fission"
    },
    {
        ";  it was reported that they felt the German suggestion was obscure.  GSI protested, saying this proposal contradicted the long-standing convention of giving the discoverer the right to suggest a name;  the ": null
    },
    {
        "American Chemical Society": "american chemical society"
    },
    {
        " supported GSI. The name hahnium , albeit with the different symbol Ha, had already been proposed and used by American scientists from the ": null
    },
    {
        "Lawrence Berkeley Laboratory": "lawrence berkeley laboratory"
    },
    {
        " in ": null
    },
    {
        "Berkeley": "berkeley, california"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ", United States, for ": null
    },
    {
        "element 105": "dubnium"
    },
    {
        ", which they had a discovery dispute with JINR for; they thus protested the confusing scrambling of names.  IUPAC relented and the name hassium was adopted internationally in 1997. Simultaneously, the name dubnium was assigned to element 105, and the name hahnium was abandoned.      The official justification for this naming, alongside that of darmstadtium for ": null
    },
    {
        "element 110": "darmstadtium"
    },
    {
        ", was that it completed a set of geographic names for the location of the GSI; this set was initiated by 19th-century names ": null
    },
    {
        "europium": "europium"
    },
    {
        " and ": null
    },
    {
        "germanium": "germanium"
    },
    {
        " . This set would serve as a response to earlier naming of ": null
    },
    {
        "americium": "americium"
    },
    {
        " , ": null
    },
    {
        "californium": "californium"
    },
    {
        " , and ": null
    },
    {
        "berkelium": "berkelium"
    },
    {
        " by physicists led by ": null
    },
    {
        "Glenn T. Seaborg": "glenn t. seaborg"
    },
    {
        " and ": null
    },
    {
        "Albert Ghiorso": "albert ghiorso"
    },
    {
        " at LBL. According to Armbruster, this bad tradition was established by Berkeley. We wanted to do it for Europe. Later, when commenting on the naming of ": null
    },
    {
        "element 112": "copernicium"
    },
    {
        ", Armbruster said, I did everything to ensure that we do not continue with German scientists and German towns.             Hassium is not known to occur naturally on Earth; the ": null
    },
    {
        "half-lives": "half-life"
    },
    {
        " of all of its known isotopes are short enough that no ": null
    },
    {
        "primordial": "primordial element"
    },
    {
        " hassium would have survived to the present day. This does not rule out the possibility of the existence of unknown, longer-lived isotopes or ": null
    },
    {
        "nuclear isomer": "nuclear isomer"
    },
    {
        "s, some of which could still exist in ": null
    },
    {
        "trace": "trace radioisotope"
    },
    {
        " quantities if they are long-lived enough. As early as 1926, German physicist ": null
    },
    {
        "Richard Swinne": "richard swinne"
    },
    {
        " proposed element 108 as a source of ": null
    },
    {
        "X-rays": "x-rays"
    },
    {
        " in the ": null
    },
    {
        "Greenland ice sheet": "greenland ice sheet"
    },
    {
        ". Although Swinne was unable to verify this observation and thus did not claim discovery, he proposed in 1931 the existence of regions of long-lived transuranic elements, including one around Z 108.  In the early 1960s, it was predicted that long-lived, deformed isomers of hassium might occur naturally on Earth in trace quantities. This was theorized to explain the extreme radiation damage in some minerals that could not have been caused by any known natural ": null
    },
    {
        "radioisotopes": "radioisotope"
    },
    {
        "but could have been caused by ": null
    },
    {
        "superheavy element": "superheavy element"
    },
    {
        "s.     In 1963, Soviet scientist Viktor Cherdyntsev, who had previously claimed the existence of primordial ": null
    },
    {
        "curium": "curium"
    },
    {
        "-247,  claimed to have discovered element 108—specifically the 267 108 isotope, which supposedly had a half-life of 400 to 500  million years—in natural ": null
    },
    {
        "molybdenite": "molybdenite"
    },
    {
        " and suggested the provisional name sergenium ;  this name takes its origin from the name for the ": null
    },
    {
        "Silk Road": "silk road"
    },
    {
        " and was explained as coming from ": null
    },
    {
        "Kazakhstan": "kazakhstan"
    },
    {
        " for it.  His rationale for claiming that sergenium was the heavier homologue to osmium was that minerals supposedly containing sergenium formed volatile oxides when boiled in ": null
    },
    {
        "nitric acid": "nitric acid"
    },
    {
        ", similarly to osmium.     Cherdyntsevs findings were criticized by Soviet physicist Vladimir Kulakov on the grounds that some of the properties Cherdyntsev claimed sergenium had were inconsistent with the then-current nuclear physics. The chief questions raised by Kulakov were that the claimed ": null
    },
    {
        "alpha decay": "alpha decay"
    },
    {
        " energy of sergenium was many orders of magnitude lower than expected and the half-life given was eight orders of magnitude shorter than what would be predicted for a nuclide alpha-decaying with the claimed decay energy. At the same time a corrected half-life in the region of 10 16  years would be impossible because it would imply the samples contained about 100  milligrams of sergenium.  In 2003, it was suggested that the observed alpha decay with energy 4.5  ": null
    },
    {
        "MeV": "electronvolt"
    },
    {
        " could be due to a low-energy and strongly enhanced transition between different ": null
    },
    {
        "hyperdeformed": "hyperdeformation"
    },
    {
        " states of a hassium isotope around 271 Hs, thus suggesting that the existence of superheavy elements in nature was at least possible, although unlikely.      In 2004, the Joint Institute for Nuclear Research conducted a search for natural hassium; this was done underground to avoid interference and false positives from ": null
    },
    {
        "cosmic ray": "cosmic ray"
    },
    {
        "s. No results have been released, strongly implying no natural hassium was found. The possible extent of primordial hassium on Earth is uncertain; it might only exist in traces or could have completely decayed long ago.     In 2006, it was hypothesized that an isomer of 271 Hs might have a half-life of around  years, which would explain the observation of alpha particles with energies of around 4.4  ": null
    },
    {
        "MeV": "electronvolt"
    },
    {
        " in some samples of molybdenite and ": null
    },
    {
        "osmiridium": "osmiridium"
    },
    {
        ". This isomer of 271 Hs could be produced from the ": null
    },
    {
        "beta decay": "beta decay"
    },
    {
        " of 271 ": null
    },
    {
        "Bh": "bohrium"
    },
    {
        " and 271 ": null
    },
    {
        "Sg": "seaborgium"
    },
    {
        ", which, being homologous to ": null
    },
    {
        "rhenium": "rhenium"
    },
    {
        " and molybdenum respectively, should occur in molybdenite along with rhenium and molybdenum if they occurred in nature. Because hassium is homologous to osmium, it should occur along with osmium in osmiridium if it occurs in nature. The decay chains of 271 Bh and 271 Sg are hypothetical and the predicted half-life of this hypothetical hassium isomer is not long enough for any sufficient quantity to remain on Earth. It is possible that more 271 Hs may be deposited on the Earth as the ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        " travels through the spiral arms of the ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        ", which would explain excesses of ": null
    },
    {
        "plutonium-239": "plutonium-239"
    },
    {
        " found on the ocean floors of the ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        " and the ": null
    },
    {
        "Gulf of Finland": "gulf of finland"
    },
    {
        "; minerals enriched with 271 Hs, however, are predicted to have excesses of ": null
    },
    {
        "uranium-235": "uranium-235"
    },
    {
        " and lead-207, and would have different proportions of elements that are formed during ": null
    },
    {
        "spontaneous fission": "spontaneous fission"
    },
    {
        ", such as ": null
    },
    {
        "krypton": "krypton"
    },
    {
        ", ": null
    },
    {
        "zirconium": "zirconium"
    },
    {
        " and ": null
    },
    {
        "xenon": "xenon"
    },
    {
        ". The natural occurrence of hassium in minerals such as molybdenite and osmiride is theoretically possible, but very unlikely.      A 2007 calculation on the decay properties of unknown, neutron-rich isotopes of superheavy elements suggested the isotope 292 Hs may be the most stable superheavy nucleus against alpha decay and spontaneous fission as a consequence of the ": null
    },
    {
        "shell closure": "magic number"
    },
    {
        " at N 184.  As such, it was considered as a candidate to exist in nature. This nucleus, however, is predicted to be very unstable toward ": null
    },
    {
        "beta decay": "beta decay"
    },
    {
        " and any ": null
    },
    {
        "beta-stable": "beta-stability line"
    },
    {
        " isotopes of hassium such as 286 Hs would be too unstable in the other decay channels to be observed in nature.  Indeed, a subsequent search for 292 Hs in nature along with its congener osmium was unsuccessful, setting an upper limit to its abundance at  of hassium per gram of osmium.              Hassium has no stable or naturally occurring isotopes. Several radioactive isotopes have been synthesized in the laboratory, either by fusing two atoms or by observing the decay of heavier elements. Twelve isotopes with mass numbers ranging from 263 to 277 have been reported, four of which—hassium-265, -267, -269, and -277—have known ": null
    },
    {
        "metastable state": "metastable state"
    },
    {
        "s, although that of hassium-277 is unconfirmed.  Most of these isotopes decay predominantly through alpha decay; this is the most common for all isotopes for which comprehensive decay characteristics are available, the only exception being hassium-277, which undergoes spontaneous fission. The lightest isotopes, which usually have shorter half-lives, were synthesized by direct fusion between two lighter nuclei and as decay products. The heaviest isotope produced by direct fusion is 271 Hs; heavier isotopes have only been observed as decay products of elements with larger atomic numbers.     Theoretical models predict a region of instability for some hassium isotopes to lie around A    275  and N    168–170, which is between the predicted neutron shell closures at  N     162 for deformed nuclei and N    184 for spherical nuclei.  Nuclides within this region are predicted to have low ": null
    },
    {
        "fission barrier": "fission barrier"
    },
    {
        " heights, resulting in short ": null
    },
    {
        "partial half-lives": "partial half-life"
    },
    {
        " toward spontaneous fission. This prediction is supported by the observed 11 millisecond half-life of 277 Hs and that of the neighbouring ": null
    },
    {
        "isobar": "isobar"
    },
    {
        " 277 Mt because the expected hindrance factors from the ": null
    },
    {
        "odd nucleon": "even and odd atomic nuclei"
    },
    {
        " were shown to be much lower than expected. The measured half-lives are even lower than those predicted for the even–even 276 Hs and 278 Ds, which suggests a gap in stability away from the shell closures and perhaps a weakening of the shell closures in this region.         According to calculations, 108 is a ": null
    },
    {
        "proton": "proton"
    },
    {
        " magic number": "magic number"
    },
    {
        " for deformed nuclei—nuclei that are far from spherical—and 162 is a ": null
    },
    {
        "neutron": "neutron"
    },
    {
        " magic number for deformed nuclei. This means such nuclei are permanently deformed in their ground state but have high, narrow fission barriers to further deformation and hence relatively long life-times to spontaneous fission. Computational prospects for shell stabilisation for 270 Hs made it a promising candidate for a deformed doubly magic nucleus. Experimental data from the decay of the ": null
    },
    {
        "darmstadtium": "darmstadtium"
    },
    {
        "  isotopes 271 Ds and 273 Ds provides strong evidence for the magic nature of the N 162 ": null
    },
    {
        "sub-shell": "nuclear shell"
    },
    {
        ". The syntheses of 269 Hs, 270 Hs, and 271 Hs fully supports the assignment of N    162 as a magic number. In particular, the low decay energy for 270 Hs is in complete agreement with calculations.          Various calculations show hassium should be the heaviest known ": null
    },
    {
        "group 8 element": "group 8 element"
    },
    {
        ", which is consistent with the ": null
    },
    {
        "periodic law": "periodic law"
    },
    {
        ". Its properties should generally match those expected for a heavier homologue of ": null
    },
    {
        "osmium": "osmium"
    },
    {
        " with a few deviations arising from ": null
    },
    {
        "relativistic effects": "relativistic effects"
    },
    {
        ".         The previous members of group 8 have relatively high melting points; . Much like them, hassium is predicted to be a solid at room temperature although its melting point has not been precisely calculated. Hassium should crystallize in the ": null
    },
    {
        "hexagonal close-packed": "hexagonal close-packed"
    },
    {
        " structure , similarly to its lighter ": null
    },
    {
        "congener": "congener"
    },
    {
        " osmium. Pure metallic hassium is calculated  to have a ": null
    },
    {
        "bulk modulus": "bulk modulus"
    },
    {
        " of 450  ": null
    },
    {
        "GPa": "pascal"
    },
    {
        ", comparable with that of ": null
    },
    {
        "diamond": "diamond"
    },
    {
        ", which has bulk modulus 442  ": null
    },
    {
        "GPa": "pascal"
    },
    {
        ".  Hassium is expected to have a bulk density of 41  g/cm 3 at ": null
    },
    {
        "standard pressure and temperature": "standard conditions for temperature and pressure"
    },
    {
        ", the highest of any of the 118 known elements and nearly twice the highest density of an element observed to this day at 22.6  g/cm 3 . This results from hassiums high atomic weight, the ": null
    },
    {
        "lanthanide and actinide contractions": "lanthanide contraction"
    },
    {
        ", and ": null
    },
    {
        "relativistic effects": "relativistic quantum chemistry"
    },
    {
        ", although production of enough hassium to measure this quantity would be impractical and the sample would decay quickly.     The atomic radius of hassium is expected to be around 126  pm. Due to the relativistic stabilization of the 7s orbital and destabilization of the 6d orbital, the Hs + ion is predicted to have an electron configuration of & 91;": null
    },
    {
        "Rn": "radon"
    },
    {
        " & 93;  5f 14  6d 5  7s 2 , giving up a 6d electron instead of a 7s electron, which is the opposite of the behaviour of its lighter homologues. The Hs 2+ ion is expected to have an electron configuration of  5f 14  6d 5  7s 1 , analogous to that calculated for the Os 2+ ion.              Hassium is the sixth member of the 6d series of transition metals and is expected to be much like the ": null
    },
    {
        "platinum group metal": "platinum group metal"
    },
    {
        "s.  Calculations on its ": null
    },
    {
        "ionisation potential": "ionisation potential"
    },
    {
        "s, ": null
    },
    {
        "atomic radii": "atomic radius"
    },
    {
        ", orbital energies and ground levels of its ionized states are similar to those of osmium, implying hassiums properties would resemble those of the other ": null
    },
    {
        "group 8 element": "group 8 element"
    },
    {
        "s: iron, ": null
    },
    {
        "ruthenium": "ruthenium"
    },
    {
        ", and osmium.  Some of these properties were confirmed by gas-phase chemistry experiments.    The group 8 elements portray a wide variety of oxidation states but ruthenium and osmium readily portray their group oxidation state of +8; this state becomes more stable down the group.  This oxidation state is extremely rare. Among stable elements, only ruthenium, osmium, and ": null
    },
    {
        "xenon": "xenon"
    },
    {
        " are able to attain it in reasonably stable compounds. Hassium is expected to follow its congeners and have a stable +8 state but like them it should show other stable, lower oxidation states such as +6, +5, +4, +3, and +2.  Hassium is expected to be more stable than hassium in aqueous solution. Hassium should be a rather ": null
    },
    {
        "noble metal": "noble metal"
    },
    {
        ";  the ": null
    },
    {
        "standard reduction potential": "standard reduction potential"
    },
    {
        " for the Hs 4+ /Hs couple is expected to be 0.4  V, which is more than that for the Cu 2+ /Cu couple of ": null
    },
    {
        "copper": "copper"
    },
    {
        " , but less than that for the Ru 2+ /Ru couple for ruthenium .     The group 8 elements show a very distinctive ": null
    },
    {
        "oxide": "oxide"
    },
    {
        " chemistry. All of the lighter members have known or hypothetical tetroxides, MO 4 .  Their oxidizing power decreases as one descends the group. FeO 4 is not known due to its extraordinarily large ": null
    },
    {
        "electron affinity": "electron affinity"
    },
    {
        "—the amount of energy released when an electron is added to a neutral atom or molecule to form a negative ion  —which results in the formation of the well-known ": null
    },
    {
        "oxoanion": "oxoanion"
    },
    {
        " ferrate": "ferrate"
    },
    {
        ", .  ": null
    },
    {
        "Ruthenium tetroxide": "ruthenium tetroxide"
    },
    {
        ", RuO 4 , which is formed by oxidation of ruthenium in acid, readily undergoes ": null
    },
    {
        "reduction": "reduction-oxidation"
    },
    {
        " to ruthenate, .   Oxidation of ruthenium metal in air forms the dioxide, RuO 2 .  In contrast, osmium burns to form the stable ": null
    },
    {
        "tetroxide": "osmium tetroxide"
    },
    {
        ", OsO 4 ,   which complexes with the hydroxide ion to form an osmium -ate complex, 2− .  Therefore, eka-osmium properties for hassium should be demonstrated by the formation of a stable, very volatile tetroxide HsO 4 ,   which undergoes complexation with ": null
    },
    {
        "hydroxide": "hydroxide"
    },
    {
        " to form a hassate, 2− . Ruthenium tetroxide and osmium tetroxide are both volatile due to their symmetrical ": null
    },
    {
        "tetrahedral molecular geometry": "tetrahedral molecular geometry"
    },
    {
        " and because they are charge-neutral; hassium tetroxide should similarly be a very volatile solid. The trend of the volatilities of the group 8 tetroxides is known to be RuO 4    HsO 4 , which confirms the calculated results. In particular, the calculated ": null
    },
    {
        "enthalpies": "enthalpy"
    },
    {
        " of ": null
    },
    {
        "adsorption": "adsorption"
    },
    {
        "—the energy required for the ": null
    },
    {
        "adhesion": "adhesion"
    },
    {
        " of atoms, molecules, or ions from a gas, liquid or dissolved solid to a ": null
    },
    {
        "surface": "surface science"
    },
    {
        "—of HsO 4 , −  kJ/mol on ": null
    },
    {
        "quartz": "quartz"
    },
    {
        ", agrees very well with the experimental value of −  kJ/mol.        Despite the selection of a volatile hassium compound for gas-phase chemical studies being clear from the beginning, the chemical characterization of hassium was considered a difficult task for a long time. Although hassium isotopes were first synthesized in 1984, it was not until 1996 that a hassium isotope long-lived enough to allow chemical studies to be performed was synthesized. Unfortunately, this hassium isotope, 269 Hs, was then synthesized indirectly from the decay of 277 ": null
    },
    {
        "Cn": "copernicium"
    },
    {
        "; not only are indirect synthesis methods not favourable for chemical studies but the reaction that produced the isotope 277 Cn had a low yield—its cross-section was only 1  ": null
    },
    {
        "pb": "barn"
    },
    {
        "— and thus did not provide enough hassium atoms for a chemical investigation. The direct synthesis of 269 Hs and 270 Hs in the reaction 248 Cm 274−x Hs  appeared more promising because the cross-section for this reaction was somewhat larger at 7  pb. This yield was still around ten times lower than that for the reaction used for the chemical characterization of ": null
    },
    {
        "bohrium": "bohrium"
    },
    {
        ". New techniques for irradiation, separation and detection had to be introduced before hassium could be successfully characterized chemically.          Ruthenium and osmium have very similar chemistry due to the ": null
    },
    {
        "lanthanide contraction": "lanthanide contraction"
    },
    {
        " but iron shows some differences from them; for example, although ruthenium and osmium form stable tetroxides in which the metal is in the +8 oxidation state, iron does not. In preparation for the chemical characterization of hassium, research focused on ruthenium and osmium rather than iron because hassium was expected to be similar to ruthenium and osmium, as the predicted data on hassium closely matched that of those two.       The first goal for chemical investigation was the formation of the tetroxide; it was chosen because ruthenium and osmium form tetroxides, being the only transition metals to display a stable compound in the +8 oxidation state.  The first chemistry experiments were performed using gas thermochromatography in 2001, using 172 Os and 173 Os as a reference. During the experiment, seven hassium atoms were synthesized using the reactions 248 Cm 269 Hs and 248 Cm 270 Hs. They were then thermalized and oxidized in a mixture of helium and oxygen gases to form hassium tetroxide molecules.     :Hs + 2 O 2 → HsO 4     The measured ": null
    },
    {
        "deposition": "deposition"
    },
    {
        " temperature indicated hassium tetroxide is less volatile than osmium tetroxide, OsO 4 and places hassium firmly in group 8.  The enthalpy of adsorption for HsO 4 measured, , was significantly lower than the predicted value, , indicating OsO 4 is more volatile than HsO 4 , contradicting earlier calculations that implied they should have very similar volatilities. For comparison, the value for OsO 4 is . It is possible hassium tetroxide interacts differently with ": null
    },
    {
        "silicon nitride": "silicon nitride"
    },
    {
        " than with ": null
    },
    {
        "silicon dioxide": "silicon dioxide"
    },
    {
        ", the chemicals used for the detector; further research is required, including more accurate measurements of the nuclear properties of 269 Hs and comparisons with RuO 4 in addition to OsO 4 .     In 2004, scientists reacted hassium tetroxide and sodium hydroxide to form sodium hassate, a reaction that is well known with osmium. This was the first acid-base reaction with a hassium compound, forming sodium hassate:      : + 2 ": null
    },
    {
        "NaOH": "sodium hydroxide"
    },
    {
        " →      The team from the ": null
    },
    {
        "University of Mainz": "university of mainz"
    },
    {
        " planned in 2008 to study the electrodeposition of hassium atoms using the new TASCA facility at GSI. Their aim was to use the reaction 226 Ra 270 Hs.  Scientists at GSI were hoping to use TASCA to study the synthesis and properties of the hassium compound hassocene, Hs 2 , using the reaction 226 Ra. This compound is analogous to the lighter compounds ": null
    },
    {
        "ferrocene": "ferrocene"
    },
    {
        ", ": null
    },
    {
        "ruthenocene": "ruthenocene"
    },
    {
        " and ": null
    },
    {
        "osmocene": "osmocene"
    },
    {
        ", and is expected to have the two cyclopentadienyl rings in an ": null
    },
    {
        "eclipsed conformation": "eclipsed conformation"
    },
    {
        " like ruthenocene and osmocene and not in a ": null
    },
    {
        "staggered conformation": "staggered conformation"
    },
    {
        " like ferrocene. Hassocene, which is expected to be a stable and highly volatile compound, was chosen because it has hassium in the low formal oxidation state of +2—although the bonding between the metal and the rings is mostly covalent in ": null
    },
    {
        "metallocene": "metallocene"
    },
    {
        "s—rather than the high +8 state that had previously been investigated, and relativistic effects were expected to be stronger in the lower oxidation state. Many metals in the periodic table form ": null
    },
    {
        "metallocenes": "metallocene"
    },
    {
        "so trends could be more easily determined. The highly symmetrical structure of hassocene and its low number of atoms make relativistic calculations easier.  there are no experimental reports of hassocene. ": null
    }
]