[
    {
        "        Hastings  is a seaside ": null
    },
    {
        "town": "town"
    },
    {
        " and ": null
    },
    {
        "borough": "borough"
    },
    {
        " in ": null
    },
    {
        "East Sussex": "east sussex"
    },
    {
        " on the south coast of ": null
    },
    {
        "England": "england"
    },
    {
        ",    east to the county town of ": null
    },
    {
        "Lewes": "lewes"
    },
    {
        " and  south east of ": null
    },
    {
        "London": "london"
    },
    {
        ". The town gives its name to the ": null
    },
    {
        "Battle of Hastings": "battle of hastings"
    },
    {
        ", which took place  to the north-west at ": null
    },
    {
        "Senlac Hill": "senlac hill"
    },
    {
        " in 1066. It later became one of the medieval ": null
    },
    {
        "Cinque Ports": "cinque ports"
    },
    {
        ". In the 19th century, it was a popular ": null
    },
    {
        "seaside resort": "seaside resort"
    },
    {
        ", as the railway allowed tourists and visitors to reach the town. Today, Hastings is a fishing port with a beach-based fishing fleet. It had an estimated population of 92,855 in 2018.                The first mention of Hastings is found in the late 8th century in the form Hastingas. This is derived from the Old English tribal name  Hæstingas , meaning the constituency of Hæsta. ": null
    },
    {
        "Symeon of Durham": "symeon of durham"
    },
    {
        " records the victory of ": null
    },
    {
        "Offa": "offa"
    },
    {
        " in 771 over the Hestingorum gens, that is, the people of the Hastings tribe. ": null
    },
    {
        "Hastingleigh": "hastingleigh"
    },
    {
        " in Kent was named after that tribe. The place name Hæstingaceaster is found in the  Anglo-Saxon Chronicle  entry for 1050, Eilert Ekwall, The Oxford Dictionary of English Place Names, Oxford University Press, 1936. Mills, A. D. & ": null
    },
    {
        "Room, Adrian": "room, adrian"
    },
    {
        " A Dictionary of British Place-names , in: ": null
    },
    {
        "Patrick Hanks": "patrick hanks"
    },
    {
        " et al. The Oxford Names Companion, ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ", 2002. , pp. 895-1264; p. 1061 and may be an alternative name for Hastings. However, the absence of any archaeological remains of or documentary evidence for a Roman fort at Hastings suggest that Hæstingaceaster may refer to a different settlement, most likely that based on the Roman remains at ": null
    },
    {
        "Pevensey": "pevensey"
    },
    {
        ". Pamela Combes and Malcolm Lyne, Hastings, Haestingaceaster and Haestingaport: a question of identity, Sussex Archaeological Collections, 133 , 213–24.      Evidence of prehistoric settlements have been found at the town site: flint arrowheads and ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " artefacts have been found. ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " forts have been excavated on both the East and West Hills. This suggests that the inhabitants moved early to the safety of the valley in between the forts. The settlement was already based on the port when the ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        " arrived in Britain for the first time in 55  BC. At this time, they began to ": null
    },
    {
        "exploit the iron": "iron industry of ashdown forest"
    },
    {
        " , and shipped it out by boat. Iron was worked locally at ": null
    },
    {
        "Beauport Park": "beauport park"
    },
    {
        ", to the north of the town. It employed up to one thousand men and is considered to have been the third-largest mine in the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ".      With the departure of the Romans, the town suffered setbacks. The Beauport site was abandoned, and the town suffered from problems from nature and man-made attacks. The Sussex coast has always suffered from occasional violent storms; with the additional hazard of ": null
    },
    {
        "longshore drift": "longshore drift"
    },
    {
        " , the coastline has been frequently changing. The original Roman port is likely now under the sea.      ": null
    },
    {
        "Bulverhythe": "bulverhythe"
    },
    {
        " was probably a harbour used by Danish invaders, which suggests that -hythe or hithe means a port or small haven.        From the 6th century AD until 771, the people of the area around modern-day Hastings, identified the territory as that of the ": null
    },
    {
        "Haestingas": "haestingas"
    },
    {
        " tribe and a kingdom separate from the surrounding kingdoms of ": null
    },
    {
        "Suth Saxe": "kingdom of sussex"
    },
    {
        " and ": null
    },
    {
        "Kent": "kingdom of kent"
    },
    {
        ". It worked to retain its separate cultural identity until the 11th century.  The kingdom was probably a sub-kingdom, the object of a disputed overlordship by the two powerful neighbouring kingdoms: when King ": null
    },
    {
        "Wihtred": "wihtred"
    },
    {
        " of Kent settled a dispute with King ": null
    },
    {
        "Ine": "ine of wessex"
    },
    {
        " of Sussex & Wessex in 694, it is probable that he seceded the overlordship of Haestingas to Ine as part of the treaty. Kirby, Earliest English Kings, p.  124.     In 771 King ": null
    },
    {
        "Offa": "offa"
    },
    {
        " of Mercia invaded Southern England, and over the next decade gradually seized control of Sussex and Kent. ": null
    },
    {
        "Symeon of Durham": "symeon of durham"
    },
    {
        " records a battle fought at an unidentified location near Hastings in 771, at which Offa defeated the Haestingas ": null
    },
    {
        "tribe": "tribe"
    },
    {
        ", effectively ending its existence as a separate kingdom. By 790, Offa controlled Hastings effectively enough to confirm grants of land in Hastings to the ": null
    },
    {
        "Abbey": "abbey"
    },
    {
        " of St Denis, in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ".  But, the  Anglo-Saxon Chronicle  for 1011 relates that Vikings overran all Kent, Sussex, Surrey and Haestingas , indicating the town was still considered a separate county or province to its neighbours 240 years after Offas conquest.      During the reign of ": null
    },
    {
        "Athelstan": "athelstan"
    },
    {
        ", he established a royal ": null
    },
    {
        "mint": "mint"
    },
    {
        " in Hastings in AD 928.           The start of the ": null
    },
    {
        "Norman Conquest": "norman conquest"
    },
    {
        " was the ": null
    },
    {
        "Battle of Hastings": "battle of hastings"
    },
    {
        ", fought on 14 October 1066, although the battle itself took place  to the north at Senlac Hill, and William had landed on the coast between Hastings and Eastbourne at Pevensey. It is thought that the Norman encampment was on the towns outskirts, where there was open ground; a new town was already being built in the valley to the east. That New Burgh was founded in 1069 and is mentioned in the ": null
    },
    {
        "Domesday Book": "domesday book"
    },
    {
        " as such. ": null
    },
    {
        "William": "william the conqueror"
    },
    {
        " defeated and killed ": null
    },
    {
        "Harold Godwinson": "harold godwinson"
    },
    {
        ", the last Saxon King of England, and destroyed his army, thus opening England to the Norman conquest.     William caused a castle to be built at Hastings probably using the earthworks of the existing Saxon castle.     Hastings was shown as a ": null
    },
    {
        "borough": "borough"
    },
    {
        " by the time of the ": null
    },
    {
        "Domesday Book": "domesday book"
    },
    {
        " ; it had also given its name to the ": null
    },
    {
        "Rape of Hastings": "rape of hastings"
    },
    {
        ", one of the six administrative divisions of Sussex. As a borough, Hastings had a ": null
    },
    {
        "corporation": "corporation"
    },
    {
        " consisting of a bailiff, jurats, and commonalty . By a Charter of ": null
    },
    {
        "Elizabeth I": "elizabeth i of england"
    },
    {
        " in 1589, the bailiff was replaced by a mayor.     Muslim scholar ": null
    },
    {
        "Muhammad al-Idrisi": "muhammad al-idrisi"
    },
    {
        ", writing c.1153, described Hastings as a town of large extent and many inhabitants, flourishing and handsome, having markets, workpeople and rich merchants .             By the end of the Saxon period, the port of Hastings had moved eastward near the present town centre in the Priory Stream valley, whose entrance was protected by the White Rock headland . It was to be a short stay: Danish attacks and huge floods in 1011 and 1014 motivated the townspeople to relocate to the New Burgh.     In the Middle Ages Hastings became one of the ": null
    },
    {
        "Cinque Ports": "cinque ports"
    },
    {
        "; ": null
    },
    {
        "Sandwich": "sandwich, kent"
    },
    {
        ", ": null
    },
    {
        "Dover": "dover"
    },
    {
        " and ": null
    },
    {
        "New Romney": "new romney"
    },
    {
        " being the first, Hastings and ": null
    },
    {
        "Hythe": "hythe, kent"
    },
    {
        " followed, all finally being joined by ": null
    },
    {
        "Rye": "rye, east sussex"
    },
    {
        " and ": null
    },
    {
        "Winchelsea": "winchelsea"
    },
    {
        ", at one point 42 towns were directly or indirectly affiliated with the group.          In the 13th century, much of the town and half of ": null
    },
    {
        "Hastings Castle": "hastings castle"
    },
    {
        " was washed away in the ": null
    },
    {
        "South England flood of February 1287": "south england flood of february 1287"
    },
    {
        ". During a ": null
    },
    {
        "naval campaign of 1339": "english channel naval campaign, 1338-1339"
    },
    {
        ", and again in 1377, the town was raided and burnt by the French, and seems then to have gone into a decline. As a port, Hastings days were finished.        Hastings had suffered over the years from the lack of a natural harbour, and there have been attempts to create a sheltered harbour. Attempts were made to build a stone harbour during the reign of ": null
    },
    {
        "Elizabeth I": "elizabeth i"
    },
    {
        ", but the foundations were destroyed by the sea in terrible storms. The fishing boats are still stored on and launched from the beach.     Hastings was then just a small fishing settlement, but it was soon discovered that the new taxes on luxury goods could be made profitable by smuggling; the town was ideally located for that purpose.  Near the castle ruins, on the West Hill, are ": null
    },
    {
        "St Clements Caves": "st clements caves"
    },
    {
        " , partly natural, but mainly excavated by hand by smugglers from the soft sandstone. Their trade was to come to an end with the period following the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", for the town became one of the most fashionable resorts in Britain, brought about by the so-called health-giving properties of seawater, as well as the local springs and Roman baths. Once this came about the expansion of the town took place, to the west, since there was little space left in the valley.        It was at this time that the elegant Pelham Crescent and Wellington Square were built: other building followed. In the Crescent  is the classical style church of St Mary in the Castle now in use as an arts centre. The building of the crescent and the church necessitated further cutting away of the castle hill cliffs. Once that move away from the old town had begun, it led to the further expansion along the coast, eventually linking up with the new ": null
    },
    {
        "St Leonards": "st leonards-on-sea"
    },
    {
        ".     The extensive development meant that a large transient work-force was required. Many of the people coming in to Hastings at this time, settled on some waste-ground to the west of the main town called the ": null
    },
    {
        "America Ground": "america ground"
    },
    {
        ". This land, originally a shingle spit created by the great storm of 1287, was declared to be Crown Property after an inquiry held at ": null
    },
    {
        "Battle": "battle"
    },
    {
        " during 1827 and the land was cleared in preparation for the development of this area of land by ": null
    },
    {
        "Patrick Francis Robertson": "patrick francis robertson"
    },
    {
        "  .             Like many coastal towns, the population of Hastings grew significantly as a result of the construction of railway links and the fashionable growth of seaside holidays during the ": null
    },
    {
        "Victorian era": "victorian era"
    },
    {
        ". In 1801, its population was a mere 3,175; by 1831, it had reached over ten thousand; by 1891, it was almost sixty thousand.     The last harbour project began in 1896, but this also failed when structural problems and rising costs exhausted all the available funds. Today a fractured seawall is all that remains of what might have become a magnificent harbour. In 1897, the foundation stone was laid on a large concrete structure, but there was insufficient money to complete the work and the Harbour arm remains uncompleted. It was later partially blown up to discourage possible use by German invasion forces during World War II.     Between 1903 and 1919 Fred Judge FRPS photographed many of the towns events and disasters. These included storms, the first tram, visit of the Lord Mayor of London, Hastings Marathon Race and the pier fire of 1917. Many of these images were produced as picture postcards by the British Postcard manufacturer he founded now known as ": null
    },
    {
        "Judges Postcards": "judges postcards"
    },
    {
        ".     In the 1930s, the town underwent some rejuvenation. Seaside resorts were starting to go out of fashion: Hastings perhaps more than most. The town council set about a huge rebuilding project, among which the promenade was rebuilt, and an Olympic-size bathing pool was erected. The latter, regarded in its day as one of the best open-air swimming and diving complexes in Europe, later became a holiday camp before closing in 1986. It was demolished, but the area is still known by locals as The Old Bathing Pool .       The 2001 census reported over 85,000 inhabitants.               Hastings returned two ": null
    },
    {
        "Members of Parliament": "member of parliament"
    },
    {
        " from the 14th century until 1885, since when it has returned one. Since 1983, it has been part of the ": null
    },
    {
        "parliamentary constituency of Hastings and Rye": "hastings and rye"
    },
    {
        "; the current MP, since ": null
    },
    {
        "2010": "2010 united kingdom general election"
    },
    {
        ", is ": null
    },
    {
        "Amber Rudd": "amber rudd"
    },
    {
        " of the Conservative Party. Prior to 1983, the town formed the ": null
    },
    {
        "Hastings parliamentary constituency": "hastings"
    },
    {
        " by itself.     Hastings, it is thought, was a Saxon town before the arrival of the Normans: the ": null
    },
    {
        "Domesday Book": "domesday book"
    },
    {
        " refers to a new Borough: as a borough, Hastings had a ": null
    },
    {
        "corporation": "corporation"
    },
    {
        " consisting of a bailiff, jurats, and commonalty . Its importance was such that it also gave its name to one of the six ": null
    },
    {
        "Rapes": "rape"
    },
    {
        " or administrative districts of Sussex.        By a Charter of ": null
    },
    {
        "Elizabeth I": "elizabeth i of england"
    },
    {
        " in 1589 the bailiff was replaced by a mayor, by which time the towns importance was dwindling. In the ": null
    },
    {
        "Georgian era": "georgian era"
    },
    {
        ", patronage of such seaside places  gave it a new lease of life so that, when the time came with the reform of English local government in 1888, Hastings became a ": null
    },
    {
        "County Borough": "county borough"
    },
    {
        ", responsible for all its local services, independent of the surrounding county, then Sussex ; less than one hundred years later, ": null
    },
    {
        "in 1974": "local government act 1972"
    },
    {
        ", that status was abolished.     Hastings Borough Council is now in the second tier of local government, below ": null
    },
    {
        "East Sussex County Council": "east sussex county council"
    },
    {
        ". The Labour Party has an overall control of the council with 23 seats, whilst the Conservative Party holds 9 seats and one is held by an independent. The Borough is divided into sixteen ": null
    },
    {
        "electoral wards": "wards of the united kingdom"
    },
    {
        "; Ashdown, Baird, Braybrooke, Castle, Central ": null
    },
    {
        "St Leonards": "st leonards-on-sea"
    },
    {
        ", Conquest, Gensing, ": null
    },
    {
        "Hollington": "hollington, east sussex"
    },
    {
        ", Maze Hill, ": null
    },
    {
        "Old Hastings": "hastings old town"
    },
    {
        ", ": null
    },
    {
        "Ore": "ore, east sussex"
    },
    {
        ", St Helens, ": null
    },
    {
        "Silverhill": "silverhill, hastings"
    },
    {
        ", Tressell, ": null
    },
    {
        "West St Leonards": "west st leonards"
    },
    {
        " and Wishing Tree.  The council leader is Peter Chowney, who stood against Rudd as a Labour candidate in the ": null
    },
    {
        "2017 election": "2017 united kingdom general election"
    },
    {
        ".              Hastings is situated where the ": null
    },
    {
        "sandstone": "sandstone"
    },
    {
        " beds, at the heart of the ": null
    },
    {
        "Weald": "weald"
    },
    {
        ", known geologically as the Hastings Sands, meet the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        ", forming tall cliffs to the east of the town. ": null
    },
    {
        "Hastings Old Town": "hastings old town"
    },
    {
        " is in a sheltered valley between the East Hill and West Hill . In Victorian times and later the town has spread westwards and northwards, and now forms a single urban centre with the more suburban area of ": null
    },
    {
        "St Leonards-on-Sea": "st leonards-on-sea"
    },
    {
        " to the west. Roads from the Old Town valley lead towards the Victorian area of Clive Vale and the former village of ": null
    },
    {
        "Ore": "ore, sussex"
    },
    {
        ", from which The Ridge , marking the effective boundary of Hastings, extends north-westwards towards ": null
    },
    {
        "Battle": "battle, east sussex"
    },
    {
        ". Beyond ": null
    },
    {
        "Bulverhythe": "bulverhythe"
    },
    {
        ", the western end of Hastings is marked by low-lying land known as ": null
    },
    {
        "Glyne Gap": "glyne gap"
    },
    {
        ", separating it from ": null
    },
    {
        "Bexhill-on-Sea": "bexhill-on-sea"
    },
    {
        ".     The sandstone cliffs have been the subject of considerable erosion in relatively recent times: much of the Castle was lost to the sea before the present sea defences and promenade were built, and a number of cliff-top houses are in danger of disappearing around the nearby village of ": null
    },
    {
        "Fairlight": "fairlight, east sussex"
    },
    {
        ".     The beach is mainly shingle, although wide areas of sand are uncovered at low tide. The town is generally built upon a series of low hills rising to  ": null
    },
    {
        "above sea level": "above mean sea level"
    },
    {
        " at The Ridge before falling back in the river valley further to the north.        There are three ": null
    },
    {
        "Sites of Special Scientific Interest": "sites of special scientific interest"
    },
    {
        " within the borough; ": null
    },
    {
        "Marline Valley Woods": "marline valley woods"
    },
    {
        ", ": null
    },
    {
        "Combe Haven": "combe haven"
    },
    {
        " and ": null
    },
    {
        "Hastings Cliffs To Pett Beach": "hastings country park"
    },
    {
        ". Marline Valley Woods lies within the Ashdown ward of Hastings. It is an ": null
    },
    {
        "ancient woodland": "ancient woodland"
    },
    {
        " of ": null
    },
    {
        "Pedunculate oak": "quercus robur"
    },
    {
        "—": null
    },
    {
        "hornbeam": "carpinus betulus"
    },
    {
        " which is uncommon nationally. Sussex Wildlife Trust own part of the site.  Combe Haven is another site of biological interest, with alluvial meadows, and the largest reed bed in the county, providing habitat for breeding birds. It is in the West St Leonards ward, stretching into the parish of ": null
    },
    {
        "Crowhurst": "crowhurst, east sussex"
    },
    {
        ".  The final SSSI, Hastings Cliffs to Pett Beach, is within the Ore ward of Hastings, extending into the neighbouring Fairlight and ": null
    },
    {
        "Pett": "pett"
    },
    {
        " parishes. The site runs along the coast and is of both biological and geological interest. The cliffs hold many fossils and the site has many habitats, including ancient woodland and shingle beaches.          As with the rest of the ": null
    },
    {
        "British Isles": "british isles"
    },
    {
        " and Southern England, Hastings experiences a ": null
    },
    {
        "maritime climate": "maritime climate"
    },
    {
        " with cool summers and mild winters. In terms of the local climate, Hastings is on the eastern edge of what is, on average, the sunniest part of the UK, the stretch of coast from the Isle of Wight to the Hastings area. Hastings, tied with Eastbourne, recorded the highest duration of sunshine of any month anywhere in the United Kingdom – 384 hours – in 1911.  Temperature extremes since 1960 at Hastings have ranged from  in July 2019,  down to  in January 1987.  The ": null
    },
    {
        "Köppen Climate Classification": "köppen climate classification"
    },
    {
        " subtype for this climate is ": null
    },
    {
        "Cfb": "köppen climate classificationgroup c: mild temperate/mesothermal climates"
    },
    {
        " .             Some of the areas and suburbs of Hastings are ": null
    },
    {
        "Ore Valley": "ore valley"
    },
    {
        ", ": null
    },
    {
        "St Leonards": "st leonards on sea"
    },
    {
        ", ": null
    },
    {
        "Silverhill": "silverhill, east sussex"
    },
    {
        ", ": null
    },
    {
        "West St Leonards": "bulverhythe"
    },
    {
        ", and ": null
    },
    {
        "Hollington": "hollington, east sussex"
    },
    {
        ". Ore, Silverhill and Hollington were once villages that have since become part of the Hastings conurbation area during rapid growth. The original part St Leonards was bought by ": null
    },
    {
        "James Burton": "james burton"
    },
    {
        " and laid out by his son, the architect ": null
    },
    {
        "Decimus Burton": "decimus burton"
    },
    {
        ", in the early 19th century as a new town: a place of elegant houses designed for the well-off; it also included a central public garden, a hotel, an archery, ": null
    },
    {
        "assembly rooms": "assembly rooms"
    },
    {
        " and ": null
    },
    {
        "a church": "st leonards church, st leonards-on-sea"
    },
    {
        ". Todays St Leonards has extended well beyond that original design, although the original town still exists within it.        The population of the town in 2001 was 85,029, by 2009 the estimated population was 86,900. Hastings suffers at a disadvantage insofar as growth is concerned because of its restricted situation, lying as it does with the ": null
    },
    {
        "High Weald Area of Outstanding Natural Beauty": "high weald area of outstanding natural beauty"
    },
    {
        " to the north. Redevelopment of the area is partly hampered by the split administration of the combined Hastings and Bexhill economic region between Hastings and ": null
    },
    {
        "Rother": "rother district"
    },
    {
        " district councils. There is little space for further large-scale housing and employment growth within the designated boundaries of Hastings, and development on the outskirts is resisted by Rother council whose administrative area surrounds Hastings. Rother has a policy of urban expansion in the area immediately north of Bexhill, but this requires infrastructure improvements by central Governments which have been under discussion for decades.  This situation has now become the subject of parliamentary consideration.           Ethnicity in 2001            Until the development of tourism, ": null
    },
    {
        "fishing": "fishing"
    },
    {
        " was Hastings major industry. The fishing fleet, based at ": null
    },
    {
        "the Stade": "the stade"
    },
    {
        ", remains Europes largest beach-launched fishing fleet and has recently won accreditation for its sustainable methods. The fleet has been based on the same beach, below the cliffs at Hastings, for at least 400, possibly 600, years. Its longevity is attributed to the prolific fishing ground of Rye Bay nearby.  Hastings fishing vessels are registered at ": null
    },
    {
        "Rye": "rye, east sussex"
    },
    {
        ", and thus bear the letters RX .     There are now various industrial estates that lie around the town, mostly on the outskirts, which include engineering, catering, motoring and construction; however, most of the jobs within the Borough are concentrated on health, public services, retail and education. 85% of the firms employed fewer than 10 people; as a consequence the unemployment rate was 3.3% . However, qualification levels are similar to the national average: 8.2% of the working-age population have no qualifications while 28% hold degree-level qualifications or higher, compared with 11% and 31% respectively across England.          Hastings main shopping centre is ": null
    },
    {
        "Priory Meadow Shopping Centre": "priory meadow shopping centre"
    },
    {
        ", which was built on the site of the old ": null
    },
    {
        "Central Recreation Ground": "central recreation ground"
    },
    {
        " which played host to some ": null
    },
    {
        "Sussex CCC": "sussex county cricket club"
    },
    {
        " first-class": "first-class cricket"
    },
    {
        " fixtures, and cricketing royalty such as Dr. ": null
    },
    {
        "W. G. Grace": "w. g. grace"
    },
    {
        " and Sir ": null
    },
    {
        "Don Bradman": "don bradman"
    },
    {
        ". The centre houses 56 stores and covers around 420,000  ft 2 . Further retail areas in the town centre include Queens Road, Wellington Place and Robertson Street.        There are plans to expand the retail area in Hastings, which includes expanding Priory Meadow and creating more retail space as part of the Priory Quarter development. Priory was intended to have a second floor added to part of the retail area, which has not happened yet and so far only office space has been created as part of the Priory Quarter.        In 2002 the Hastings and Bexhill task force, set up by the ": null
    },
    {
        "South East England Development Agency": "south east england development agency"
    },
    {
        ", was founded to regenerate the local economy, a 10-year programme being set up to tackle the local reliance on public sector employment. The regeneration scheme saw the construction of the ": null
    },
    {
        "University Centre Hastings": "university centre hastings"
    },
    {
        ",  the new ": null
    },
    {
        "Sussex Coast College": "sussex coast college"
    },
    {
        " campus and construction of the Priory Quarter, which still remains unfinished but now houses ": null
    },
    {
        "Saga": "saga group"
    },
    {
        " offices, bringing 800 new jobs to the area.   SEEDA   Sea Space           Hastings has an ": null
    },
    {
        "Army Cadet Force": "army cadet force"
    },
    {
        " detachment": "detachment"
    },
    {
        " which is part of ": null
    },
    {
        "Sussex ACF": "list of acf unitssouth east england"
    },
    {
        ". This detachment is based in the old Territorial Army Unit Building on Cinque Ports Way, and is affiliated to ": null
    },
    {
        "PWRR": "princess of wales royal regiment"
    },
    {
        ".  Hastings also has a ": null
    },
    {
        "Royal Air Force Air Cadet": "royal air force air cadets"
    },
    {
        " Squadron, 304 Squadron of Sussex Wing RAFAC, based in the same building.  The town also has a ": null
    },
    {
        "Sea Cadet": "sea cadets"
    },
    {
        " squadron, T.S. Hastings. This sits adjacent to the Army and Air Cadet building on the seafront. The site features a climbing wall and other training facilities.              Throughout the year many annual events take place in Hastings, the largest of which being the ": null
    },
    {
        "May Day": "may day"
    },
    {
        " bank holiday": "bank holiday"
    },
    {
        " weekend, which features a ": null
    },
    {
        "Jack-in-the-Green": "jack-in-the-green"
    },
    {
        " festival ,  and the culmination of the ": null
    },
    {
        "Maydayrun": "maydayrun"
    },
    {
        "—tens of thousands of motorcyclists having ridden the ": null
    },
    {
        "A21": "a21 road"
    },
    {
        " to Hastings. The yearly carnival during ": null
    },
    {
        "Old Town Week": "hastings old town week"
    },
    {
        " takes place every August, which includes a week of events around ": null
    },
    {
        "Hastings Old Town": "hastings old town"
    },
    {
        ", including a Seaboot race, bike race, street party and pram race. In September, there is a month-long arts festival Coastal Currents and a Seafood and Wine Festival. During  held each year around 14 October the Hastings Bonfire Society  stages a traditional Sussex Bonfire which includes a torchlight procession through the streets, a beach bonfire and firework display.   Hastings Pirate Day takes place in July every year. Hastings, as of November 2017, still holds the Guinness World Record for the most pirates in one place.     Other smaller events include the ": null
    },
    {
        "Hastings Beer and Music Festival": "hastings beer and music festival"
    },
    {
        ", held every July in ": null
    },
    {
        "Alexandra Park": "alexandra park, hastings"
    },
    {
        ", the ": null
    },
    {
        "Hastings Musical Festival": "hastings musical festival"
    },
    {
        " held every March in the ": null
    },
    {
        "White Rock Theatre": "white rock theatre"
    },
    {
        " and the ": null
    },
    {
        "Hastings International Chess Congress": "hastings international chess congress"
    },
    {
        ".       There are two main theatres in the town, the ": null
    },
    {
        "White Rock Theatre": "white rock theatre"
    },
    {
        " and the Stables Theatre. The White Rock theatre is the venue of the yearly pantomime and throughout the year hosts comedy, dance and music acts. The Stables stages more local productions and acts as an arts exhibition centre. The Phoenix Arts Centre, based at ": null
    },
    {
        "Ark William Parker Academy": "ark william parker academy"
    },
    {
        " also stages local productions as well as shows put on by the school. An additional theatre is located in Cambridge Road, the  in a shared space with the His Place church in what used to be the ": null
    },
    {
        "Robertson Street Congregational Church": "robertson street congregational church"
    },
    {
        ".     There is a small four screen ": null
    },
    {
        "Odeon": "odeon cinemas"
    },
    {
        " cinema in the town, located opposite the town hall; however, there are plans to build a new multiplex cinema as part of the Priory Quarter development in the town centre. The town has an independent cinema called the  located in the Old Town and a restored cinema in St Leonards called the           There are three museums in Hastings; the ": null
    },
    {
        "Hastings Museum and Art Gallery": "hastings museum and art gallery"
    },
    {
        ", the ": null
    },
    {
        "Hastings Fishermens Museum": "hastings fishermens museum"
    },
    {
        " and the Shipwreck Museum. The former two mentioned are open for the whole year while the Shipwreck Museum is open only weekends during the winter, but daily for the rest of the year.     The Hastings Museum and Art gallery concentrates mostly on local history and contains exhibits on ": null
    },
    {
        "Grey Owl": "grey owl"
    },
    {
        " and ": null
    },
    {
        "John Logie Baird": "john logie baird"
    },
    {
        ". It also features a ": null
    },
    {
        "Durbar Hall": "durbar hall"
    },
    {
        ", donated by ": null
    },
    {
        "Lord Brassey": "thomas brassey, 2nd earl brassey"
    },
    {
        "; the hall contains displays focusing on the Indian subcontinent and the Brassey Family. The Fishermens Museum, housed in the former fishermens church, is dedicated to the fishing industry and maritime history of Hastings. The ": null
    },
    {
        "Shipwreck Museum": "shipwreck museum"
    },
    {
        " displays artifacts from wrecks around the area.     The ": null
    },
    {
        "Jerwood Gallery": "jerwood gallery"
    },
    {
        " located in the Stade area of ": null
    },
    {
        "Hastings Old Town": "hastings old town"
    },
    {
        " is the home for the Jerwood Collection of 20th and 21st century art and a changing contemporary exhibition programme.  The project was opposed by many locals who felt that a new art gallery would have been better located elsewhere in the town.      Jerwood Gallery has now been replaced with the ": null
    },
    {
        "Hastings Contemporary": "hastings contemporary"
    },
    {
        ".       There are many parks and open spaces located throughout the town, one of the most popular and largest being ": null
    },
    {
        "Alexandra Park": "alexandra park, hastings"
    },
    {
        " opened in 1882 by the Prince and Princess of Wales. The park contains gardens, open spaces, woods, a bandstand, tennis courts and a cafe. Other open spaces include White Rock Gardens, West Marina Gardens, St Leonards Gardens, Gensing Gardens, Markwick Gardens, Summerfields Woods, Linton Gardens, Hollington woods, Filsham Valley, Warrior Square, Castle Hill, St Helens Woods and ": null
    },
    {
        "Hastings Country Park": "hastings country park"
    },
    {
        ".          ": null
    },
    {
        "Hastings Castle": "hastings castle"
    },
    {
        " was built in 1070 by the ": null
    },
    {
        "Normans": "normans"
    },
    {
        ", four years after the ": null
    },
    {
        "Norman invasion": "norman conquest of england"
    },
    {
        ". It is located on the West Hill, overlooking the town centre and is a Grade I ": null
    },
    {
        "listed building": "listed building"
    },
    {
        ". Little remains of the castle apart from the arch left from the chapel, part of the walls and dungeons. The nearby ": null
    },
    {
        "St. Clements Caves": "st. clements caves"
    },
    {
        " are home to the Smugglers Adventure, which features interactive displays relating to the history of smuggling on the south coast of England.     ": null
    },
    {
        "Hastings Pier": "hastings pier"
    },
    {
        " can be seen from any part of the seafront in the town. The old pier was opened in 1872, but closed in 2006 following safety concerns from the council. In October 2010, a serious fire burned down most of the buildings on the pier and caused further damage to the structure.  However, the pier reopened on 27 April 2016 in modern architectural forms after a £14.2m refurbishment.  It won the Stirling Prize of the ": null
    },
    {
        "Royal Institute of British Architects": "royal institute of british architects"
    },
    {
        " in 2017.         Many church buildings throughout the town are Grade II listed including; ": null
    },
    {
        "Church in the Wood": "church in the wood, hollington"
    },
    {
        ", Blacklands Parish Church, Ebenezer Particular Baptist Chapel, ": null
    },
    {
        "Fishermens Museum": "hastings fishermens museum"
    },
    {
        " and ": null
    },
    {
        "St Mary Magdalenes Church": "st mary magdalenes church, st leonards-on-sea"
    },
    {
        ".     On the seafront at St Leonards is Marine Court, a 1938 block of flats in the ": null
    },
    {
        "Art Deco": "art deco"
    },
    {
        " style that was originally called The Ship due to its style being based on the ocean liner ": null
    },
    {
        "RMS Queen Mary": "rms queen mary"
    },
    {
        ". This block of flats can be seen up to  away on a clear day, from Holywell, in the Meads area of ": null
    },
    {
        "Eastbourne": "eastbourne"
    },
    {
        ".     An important former landmark was the Memorial , a clock tower commemorating Albert the ": null
    },
    {
        "Prince Consort": "prince consort"
    },
    {
        " which stood for many years at the traffic junction at the town centre, but was demolished following an arson attack in the 1970s.           There are two major roads in Hastings: the ": null
    },
    {
        "A21": "a21 road"
    },
    {
        " trunk road to London; and the ": null
    },
    {
        "A259": "a259 road"
    },
    {
        " coastal road. Both are beset with traffic problems: although the London road, which has to contend with difficult terrain, has had several sections of widening over the past decades there are still many delays. Long-term plans for a much improved A259 east–west route were abandoned in the 1990s. A new Hastings-Bexhill Link Road opened in April 2016 known as the ": null
    },
    {
        "A2690": "a2690"
    },
    {
        " with the hope of reducing traffic congestion along the A259 Bexhill Road. The new link road travels from Queensway in the North of Hastings and joins up to the A259 in Bexhill.  Hastings is also linked to ": null
    },
    {
        "Battle": "battle, east sussex"
    },
    {
        " via the ": null
    },
    {
        "A2100": "a2100 road"
    },
    {
        ", the original London road.     The town is served by ": null
    },
    {
        "Stagecoach in Hastings": "stagecoach in hastings"
    },
    {
        " buses on routes that serve the town, and also extend to Bexhill, Eastbourne and Dover as part of ": null
    },
    {
        "The Wave route": "stagecoach the wave routes"
    },
    {
        ". Stagecoach also run long distance buses up to ": null
    },
    {
        "Northiam": "northiam"
    },
    {
        ", ": null
    },
    {
        "Hawkhurst": "hawkhurst"
    },
    {
        ", ": null
    },
    {
        "Royal Tunbridge Wells": "royal tunbridge wells"
    },
    {
        ", ": null
    },
    {
        "Ashford": "ashford, kent"
    },
    {
        " and ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        ".     ": null
    },
    {
        "National Express Coaches": "national express coaches"
    },
    {
        " run service 023 to London.          Hastings has four ": null
    },
    {
        "rail": "railway"
    },
    {
        " links: two to London, one to ": null
    },
    {
        "Brighton": "brighton"
    },
    {
        " and one to ": null
    },
    {
        "Ashford": "ashford, kent"
    },
    {
        ". Of the London lines, the shorter is the ": null
    },
    {
        "Hastings Line": "hastings line"
    },
    {
        ", the former ": null
    },
    {
        "South Eastern Railway": "south eastern railway"
    },
    {
        " route to ": null
    },
    {
        "Charing Cross": "charing cross railway station"
    },
    {
        " via ": null
    },
    {
        "Battle": "battle, east sussex"
    },
    {
        " and ": null
    },
    {
        "Tunbridge Wells": "royal tunbridge wells"
    },
    {
        ", which opened in 1852; and the longer is the ": null
    },
    {
        "East Coastway Line": "east coastway line"
    },
    {
        ", the former ": null
    },
    {
        "London, Brighton and South Coast Railway": "london, brighton and south coast railway"
    },
    {
        " route to ": null
    },
    {
        "Victoria": "victoria station"
    },
    {
        " via ": null
    },
    {
        "Bexhill": "bexhill-on-sea"
    },
    {
        ", ": null
    },
    {
        "Eastbourne": "eastbourne"
    },
    {
        " and ": null
    },
    {
        "Lewes": "lewes"
    },
    {
        ". Trains to Brighton also use the East Coastway Line. The ": null
    },
    {
        "Marshlink Line": "marshlink line"
    },
    {
        " runs via ": null
    },
    {
        "Rye": "rye, east sussex"
    },
    {
        " to Ashford where a connection can be made with ": null
    },
    {
        "Eurostar": "eurostar"
    },
    {
        " services, and is unelectrified except for the Hastings-Ore segment.     A historic ": null
    },
    {
        "British Rail Class 201": "british rail class 201"
    },
    {
        " Thumper can sometimes been seen on historic runs to and from Hastings.      Hastings is served by two rail companies: ": null
    },
    {
        "Southeastern": "southeastern"
    },
    {
        " and ": null
    },
    {
        "Southern": "southern"
    },
    {
        ".   Southeastern services run along the Hastings Line, generally terminating at Hastings, with some peak services extending to Ore; the other lines are served by Southern, with services terminating at Ore or Ashford.     The town currently has four railway stations: from west to east they are ": null
    },
    {
        "West St Leonards station": "west st leonards station"
    },
    {
        ", ": null
    },
    {
        "St Leonards Warrior Square": "st leonards warrior square"
    },
    {
        ", ": null
    },
    {
        "Hastings": "hastings railway station"
    },
    {
        ", and ": null
    },
    {
        "Ore": "ore railway station"
    },
    {
        "; this latter has been proposed to be renamed to Ore Valley. There is also one closed station and one proposed station in the area. ": null
    },
    {
        "West Marina": "west marina railway station"
    },
    {
        " station was very near West St Leonards and was closed some years ago. A new station has been proposed at Glyne Gap in Bexhill, which would also serve residents from western Hastings.           There are two ": null
    },
    {
        "funicular railway": "funicular railway"
    },
    {
        "s, known locally as the ": null
    },
    {
        "West Hill": "west hill cliff railway"
    },
    {
        " and ": null
    },
    {
        "East Hill Lifts": "east hill cliff railway"
    },
    {
        " respectively.     The ": null
    },
    {
        "Hastings Miniature Railway": "hastings miniature railway"
    },
    {
        " operates along the beach from ": null
    },
    {
        "Rock-a-Nore": "rock-a-nore"
    },
    {
        " to Marine Parade, and has provided tourist transport since 1948. The railway was considerably restored and re-opened in 2010.     A local metro railway service from ": null
    },
    {
        "Bexhill": "bexhill railway station"
    },
    {
        " to ": null
    },
    {
        "Ore": "ore railway station"
    },
    {
        " has also been proposed.       The ": null
    },
    {
        "Saxon Shore Way": "saxon shore way"
    },
    {
        ", ": null
    }
]