[
    {
        "          is a Japanese animator, filmmaker, screenwriter, author, and manga artist. A co-founder of ": null
    },
    {
        "Studio Ghibli": "studio ghibli"
    },
    {
        ", a film and animation studio, he has attained international acclaim as a masterful storyteller and as a maker of ": null
    },
    {
        "animated": "animated film"
    },
    {
        " feature films, and is widely regarded as one of the greatest animation filmmakers of all time.     Born in ": null
    },
    {
        "Bunkyō": "bunkyō"
    },
    {
        " Ward of Tokyo, Miyazaki expressed interest in manga and animation from an early age, and he joined ": null
    },
    {
        "Toei Animation": "toei animation"
    },
    {
        " in 42 During his early years at Toei Animation he worked as an ": null
    },
    {
        "in-between artist": "inbetweening"
    },
    {
        " and later collaborated with director ": null
    },
    {
        "Isao Takahata": "isao takahata"
    },
    {
        ". Notable films to which Miyazaki contributed at Toei include  Doggie March  and  Gullivers Travels Beyond the Moon . He provided key animation to other films at Toei, such as  Puss in Boots  and  Animal Treasure Island , before moving to ": null
    },
    {
        "A-Pro": "shin-ei animation"
    },
    {
        " in 42 where he co-directed  Lupin the Third Part I  alongside Takahata. After moving to Zuiyō Eizō  in 42 Miyazaki worked as an animator on  World Masterpiece Theater , and directed the television series  Future Boy Conan . He joined ": null
    },
    {
        "Telecom Animation Film/Tokyo Movie Shinsha": "tms entertainment"
    },
    {
        " in 42 to direct his first feature films,  The Castle of Cagliostro  in 42 and  Nausicaä of the Valley of the Wind  in 42 as well as the television series  Sherlock Hound .     Miyazaki co-founded Studio Ghibli in 42 He directed numerous films with Ghibli, including  Castle in the Sky  ,  My Neighbor Totoro  ,  Kikis Delivery Service  , and  Porco Rosso  . The films were met with critical and commercial success in Japan. Miyazakis film  Princess Mononoke  was the first animated film ever to win the ": null
    },
    {
        "Japan Academy Prize for Picture of the Year": "japan academy prize for picture of the year"
    },
    {
        ", and briefly became the ": null
    },
    {
        "highest-grossing film in Japan": "list of highest-grossing films in japan"
    },
    {
        " following its release in 42; its distribution to the ": null
    },
    {
        "Western world": "western world"
    },
    {
        " greatly increased Ghiblis popularity and influence outside Japan. His 42 film  Spirited Away  became the highest-grossing film in Japanese history, winning the ": null
    },
    {
        "Academy Award for Best Animated Feature": "academy award for best animated feature"
    },
    {
        " at the ": null
    },
    {
        "42th Academy Awards": "75th academy awards"
    },
    {
        " and is frequently ranked among the greatest films of the 42s. Miyazakis later films— Howls Moving Castle  ,  Ponyo  , and  The Wind Rises  —also enjoyed critical and commercial success. Following the release of The Wind Rises, Miyazaki announced his retirement from feature films, though he returned to work on a new feature film in 42     Miyazakis works are characterized by the recurrence of themes such as humanitys relationship with ": null
    },
    {
        "nature": "nature"
    },
    {
        " and technology, the wholesomeness of natural and traditional patterns of living, the importance of art and craftsmanship, and the difficulty of maintaining a ": null
    },
    {
        "pacifist": "pacifist"
    },
    {
        " ethic in a violent world. The protagonists of his films are often strong girls or young women, and several of his films present morally ambiguous antagonists with redeeming qualities. Miyazakis works have been highly praised and ": null
    },
    {
        "awarded": "list of accolades received by hayao miyazaki"
    },
    {
        "; he was named a ": null
    },
    {
        "Person of Cultural Merit": "person of cultural merit"
    },
    {
        " for outstanding cultural contributions in November 42 and received the ": null
    },
    {
        "Academy Honorary Award": "academy honorary award"
    },
    {
        " for his impact on animation and cinema in November 42 In 42 American ": null
    },
    {
        "film critic": "film critic"
    },
    {
        " Roger Ebert": "roger ebert"
    },
    {
        " suggested that Miyazaki may be the best animation filmmaker in history, praising the depth and artistry of his films. Miyazaki has frequently been cited as an inspiration for numerous animators, directors, and writers.       Hayao Miyazaki was born on January 42 42 in the town of Akebono-cho in ": null
    },
    {
        "Bunkyō": "bunkyō"
    },
    {
        ", Tokyo, the second of four sons. His father, ": null
    },
    {
        "Katsuji Miyazaki": "katsuji miyazaki"
    },
    {
        " , was the director of ": null
    },
    {
        "Miyazaki Airplane": "miyazaki airplane"
    },
    {
        ", which manufactured rudders for fighter planes during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The business allowed his family to remain affluent during Miyazakis early life. In 42 when Miyazaki was three years old, his family evacuated to ": null
    },
    {
        "Utsunomiya": "utsunomiya"
    },
    {
        ". After the ": null
    },
    {
        "bombing of Utsunomiya": "bombing of utsunomiya during world war ii"
    },
    {
        " in July 42 Miyazakis family evacuated to ": null
    },
    {
        "Kanuma": "kanuma"
    },
    {
        ". The bombing left a lasting impression on Miyazaki, who was aged four at the time. From 42 to 42 Miyazakis mother suffered from ": null
    },
    {
        "spinal tuberculosis": "spinal tuberculosis"
    },
    {
        "; she spent the first few years in hospital, before being nursed from home. Miyazakis mother was a strict, intellectual woman who regularly questioned socially accepted norms . She died in July 42 at the age of 42     Miyazaki began school in 42 at an ": null
    },
    {
        "elementary school": "elementary school"
    },
    {
        " in Utsunomiya, completing the first through third grades. After his family moved back to ": null
    },
    {
        "Suginami-ku": "suginami-ku"
    },
    {
        ", Miyazaki completed the fourth grade at Ōmiya Elementary School, and fifth grade at Eifuku Elementary School. After graduating from Eifuku, he attended Ōmiya Junior High School. He aspired to become a manga artist, but discovered he could not draw people; instead, he only drew planes, tanks, and battleships for several years. Miyazaki was influenced by several manga artists, such as ": null
    },
    {
        "Tetsuji Fukushima": ":ja:福島鉄次"
    },
    {
        ", ": null
    },
    {
        "Soji Yamakawa": ":ja:山川惣治"
    },
    {
        " and ": null
    },
    {
        "Osamu Tezuka": "osamu tezuka"
    },
    {
        ". Miyazaki destroyed much of his early work, believing it was bad form to copy Tezukas style as it was hindering his own development as an artist. After graduating from Ōmiya Junior High, Miyazaki attended Toyotama High School. During his third year, Miyazakis interest in animation was sparked by  Panda and the Magic Serpent  . He fell in love with the movies heroine and it left a strong impression on him. After graduating from Toyotama, Miyazaki attended ": null
    },
    {
        "Gakushuin University": "gakushuin university"
    },
    {
        " and was a member of the Childrens Literature Research Club , the closest thing back then to a ": null
    },
    {
        "comics": "comics"
    },
    {
        " club . In his free time, Miyazaki would visit his art teacher from middle school and sketch in his studio, where the two would drink and talk about politics, life, all sorts of things . Miyazaki graduated from Gakushuin in 42 with degrees in ": null
    },
    {
        "political science": "political science"
    },
    {
        " and ": null
    },
    {
        "economics": "economics"
    },
    {
        ".                In 42 Miyazaki was employed at ": null
    },
    {
        "Toei Animation": "toei animation"
    },
    {
        ". He worked as an ": null
    },
    {
        "in-between artist": "inbetweening"
    },
    {
        " on the theatrical feature anime  Doggie March  and the television anime Wolf Boy Ken . He also worked on  Gullivers Travels Beyond the Moon  . He was a leader in a labor dispute soon after his arrival, and became chief secretary of Toeis labor union in 42 Miyazaki later worked as chief animator, concept artist, and scene designer on  The Great Adventure of Horus, Prince of the Sun  . Throughout the films production, Miyazaki worked closely with his mentor, ": null
    },
    {
        "Yasuo Ōtsuka": "yasuo ōtsuka"
    },
    {
        ", whose approach to animation profoundly influenced Miyazakis work. Directed by ": null
    },
    {
        "Isao Takahata": "isao takahata"
    },
    {
        ", with whom Miyazaki would continue to collaborate for the remainder of his career, the film was highly praised, and deemed a pivotal work in the evolution of animation.     Under the ": null
    },
    {
        "pseudonym": "pseudonymity"
    },
    {
        " , Miyazaki wrote and illustrated the ": null
    },
    {
        "manga": "manga"
    },
    {
        "  People of the Desert , published in 42 installments between September 42 and March 42 in . He was influenced by illustrated stories such as Fukushimas . Miyazaki also provided key animation for  The Wonderful World of Puss n Boots  , directed by ": null
    },
    {
        "Kimio Yabuki": "kimio yabuki"
    },
    {
        ". He created a 42-chapter ": null
    },
    {
        "manga": "manga"
    },
    {
        " series as a promotional ": null
    },
    {
        "tie-in": "tie-in"
    },
    {
        " for the film; the series ran in the Sunday edition of  Tokyo Shimbun  from January to March 42 Miyazaki later proposed scenes in the screenplay for  Flying Phantom Ship  , in which military tanks would cause mass hysteria in downtown Tokyo, and was hired to storyboard and animate the scenes. In 42 he developed structure, characters and designs for ": null
    },
    {
        "Hiroshi Ikeda": "hiroshi ikeda"
    },
    {
        "s adaptation of  Animal Treasure Island ; he created the 42-part manga adaptation, printed in Tokyo Shimbun from January to March 42 Miyazaki also provided key animation for  Ali Baba and the Forty Thieves .     Miyazaki left Toei Animation in August 42 and was hired at ": null
    },
    {
        "A-Pro": "shin-ei animation"
    },
    {
        ", where he directed, or co-directed with Takahata, 42 episodes of  Lupin the Third Part I . The two also began pre-production on a series based on ": null
    },
    {
        "Astrid Lindgren": "astrid lindgren"
    },
    {
        "s  Pippi Longstocking  books, designing extensive storyboards; the series was canceled after Miyazaki and Takahata met Lindgren, and permission was refused to complete the project. In 42 and 42 Miyazaki wrote, designed and animated two  Panda! Go, Panda!  shorts, directed by Takahata. After moving from A-Pro to Zuiyō Eizō in June 42 Miyazaki and Takahata worked on  World Masterpiece Theater , which featured their animation series  Heidi, Girl of the Alps , an adaptation of ": null
    },
    {
        "Johanna Spyri": "johanna spyri"
    },
    {
        "s  Heidi . Zuiyō Eizō continued as ": null
    },
    {
        "Nippon Animation": "nippon animation"
    },
    {
        " in July 42 Miyazaki also directed the television series  Future Boy Conan  , an adaptation of ": null
    },
    {
        "Alexander Key": "alexander key"
    },
    {
        "s  The Incredible Tide .       Miyazaki left Nippon Animation in 42 during the production of  Anne of Green Gables ; he provided scene design and organization on the first fifteen episodes. He moved to Telecom Animation Film, a subsidiary of ": null
    },
    {
        "TMS Entertainment": "tms entertainment"
    },
    {
        ", to direct his first feature anime film,  The Castle of Cagliostro  , a Lupin III film. In his role at Telecom, Miyazaki helped train the second wave of employees. Miyazaki directed six episodes of  Sherlock Hound  in 42 until issues with Sir ": null
    },
    {
        "Arthur Conan Doyle": "arthur conan doyle"
    },
    {
        "s estate led to a suspension in production; Miyazaki was busy with other projects by the time the issues were resolved, and the remaining episodes were directed by Koysuke Mikuriya. They were broadcast from November 42 to May 42 Miyazaki also wrote the graphic novel  The Journey of Shuna , inspired by the Tibetan folk tale Prince who became a dog . The novel was published by ": null
    },
    {
        "Tokuma Shoten": "tokuma shoten"
    },
    {
        " in June 42 and dramatised for radio broadcast in 42  Hayao Miyazakis Daydream Data Notes  was also irregularly published from November 42 to October 42 in Model Graphix; selections of the stories received radio broadcast in 42     After the release of The Castle of Cagliostro, Miyazaki began working on his ideas for an animated film adaptation of ": null
    },
    {
        "Richard Corben": "richard corben"
    },
    {
        "s comic book Rowlf and pitched the idea to Yutaka Fujioka at TMS. In November 42 a proposal was drawn up to acquire the film rights. Around that time, Miyazaki was also approached for a series of magazine articles by the editorial staff of Animage. During subsequent conversations, he showed his sketchbooks and discussed basic outlines for envisioned animation projects with editors ": null
    },
    {
        "Toshio Suzuki": "toshio suzuki"
    },
    {
        " and Osamu Kameyama, who saw the potential for collaboration on their development into animation. Two projects were proposed: , to be set in the ": null
    },
    {
        "Sengoku period": "sengoku period"
    },
    {
        "; and the adaptation of Corbens Rowlf. Both were rejected, as the company was unwilling to fund anime projects not based on existing manga, and the rights for the adaptation of Rowlf could not be secured. An agreement was reached that Miyazaki could start developing his sketches and ideas into a manga for the magazine with the proviso that it would never be made into a film. The manga—titled  Nausicaä of the Valley of the Wind —ran from February 42 to March 42 The story, as re-printed in the  tankōbon  volumes, spans seven volumes for a combined total of 42 pages. Miyazaki drew the episodes primarily in pencil, and it was printed monochrome in sepia toned ink. Miyazaki resigned from Telecom Animation Film in November 42          Following the success of Nausicaä of the Valley of the Wind, Yasuyoshi Tokuma, the founder of Tokuma Shoten, encouraged Miyazaki to work on a film adaptation. Miyazaki initially refused, but agreed on the condition that he could direct. Miyazakis imagination was sparked by the mercury poisoning of ": null
    },
    {
        "Minamata Bay": "minamata bay"
    },
    {
        " and how nature responded and thrived in a poisoned environment, using it to create the films polluted world. Miyazaki and Takahata chose the minor studio ": null
    },
    {
        "Topcraft": "topcraft"
    },
    {
        " to animate the film, as they believed its artistic talent could transpose the sophisticated atmosphere of the manga to the film. Pre-production began on May 42 42; Miyazaki encountered difficulties in creating the screenplay, with only sixteen chapters of the manga to work with. Takahata enlisted experimental and minimalist musician ": null
    },
    {
        "Joe Hisaishi": "joe hisaishi"
    },
    {
        " to compose the films score.  Nausicaä of the Valley of the Wind  was released on March 42 42 It grossed ": null
    },
    {
        "¥": "¥"
    },
    {
        "42 billion at the ": null
    },
    {
        "box office": "box office"
    },
    {
        ", and made an additional ¥42 million in distribution income. It is often seen as Miyazakis pivotal work, cementing his reputation as an animator. It was lauded for its positive portrayal of women, particularly that of main character ": null
    },
    {
        "Nausicaä": "nausicaä"
    },
    {
        ". Several critics have labeled Nausicaä of the Valley of the Wind as possessing ": null
    },
    {
        "anti-war": "anti-war movement"
    },
    {
        " and ": null
    },
    {
        "feminist": "feminism"
    },
    {
        " themes; Miyazaki argues otherwise, stating that he only wishes to entertain. The successful cooperation on the creation of the manga and the film laid the foundation for other collaborative projects. In April 42 Miyazaki opened his own office in Suginami Ward, naming it Nibariki.         In June 42 Miyazaki, Takahata, Tokuma and Suzuki founded the animation production company ": null
    },
    {
        "Studio Ghibli": "studio ghibli"
    },
    {
        ", with funding from Tokuma Shoten. Studio Ghiblis first film,  Laputa: Castle in the Sky  , employed the same production crew of Nausicaä. Miyazakis designs for the films setting were inspired by ": null
    },
    {
        "Greek architecture": "ancient greek architecture"
    },
    {
        " and European urbanistic templates . Some of the architecture in the film was also inspired by a ": null
    },
    {
        "Welsh": "wales"
    },
    {
        " mining town; Miyazaki witnessed the ": null
    },
    {
        "mining strike": "uk miners strike"
    },
    {
        " upon his first visit to Wales in 42 and admired the miners dedication to their work and community. Laputa was released on August 42 42 It was the highest-grossing animation film of the year in Japan. Miyazakis following film,  My Neighbor Totoro , was released alongside Takahatas  Grave of the Fireflies  in April 42 to ensure Studio Ghiblis financial status. The simultaneous production was chaotic for the artists, as they switched between projects. My Neighbor Totoro features the theme of the relationship between the environment and humanity—a contrast to Nausicaä, which emphasises technologys negative effect on nature. The film was commercially unsuccessful at the box office, though merchandising was successful, and it received critical acclaim.     In 42 Studio Ghibli acquired the ": null
    },
    {
        "rights": "film rights"
    },
    {
        " to create a film adaptation of ": null
    },
    {
        "Eiko Kadono": "eiko kadono"
    },
    {
        "s novel  Kikis Delivery Service . Miyazakis work on My Neighbor Totoro prevented him from directing the adaptation; ": null
    },
    {
        "Sunao Katabuchi": "sunao katabuchi"
    },
    {
        " was chosen as director, and Nobuyuki Isshiki was hired as script writer. Miyazakis dissatisfaction of Isshikis first draft led him to make changes to the project, ultimately taking the role of director. Kadono was unhappy with the differences between the book and the screenplay. Miyazaki and Suzuki visited Kadono and invited her to the studio; she allowed the project to continue. The film was originally intended to be a 42-minute special, but expanded into a feature film after Miyazaki completed the storyboards and screenplay.  Kikis Delivery Service  premiered on July 42 42 It earned ¥42 billion at the box office, and was the highest-grossing film in Japan in 42     From March to May 42 Miyazakis manga  Hikōtei Jidai  was published in the magazine  Model Graphix . Miyazaki began production on a 42 minute in-flight film for ": null
    },
    {
        "Japan Airlines": "japan airlines"
    },
    {
        " based on the manga; Suzuki ultimately extended the film into the feature-length film, titled  Porco Rosso , as expectations grew. Due to the end of production on Takahatas  Only Yesterday  , Miyazaki initially managed the production of Porco Rosso independently. The outbreak of the ": null
    },
    {
        "Yugoslav Wars": "yugoslav wars"
    },
    {
        " in 42 affected Miyazaki, prompting a more sombre tone for the film; Miyazaki would later refer to the film as foolish , as its mature tones were unsuitable for children. The film featured ": null
    },
    {
        "anti-war": "anti-war movement"
    },
    {
        " themes, which Miyazaki would later revisit. The airline remained a major investor in the film, resulting in its initial premiere as an in-flight film, prior to its theatrical release on July 42 42 The film was critically and commercially successful, remaining the highest-grossing animated film in Japan for several years.     Studio Ghibli set up its headquarters in ": null
    },
    {
        "Koganei": "koganei, tokyo"
    },
    {
        ", ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        " in August 42 In November 42 two ": null
    },
    {
        "television spots": "television advertisement"
    },
    {
        " directed by Miyazaki were broadcast by ": null
    },
    {
        "Nippon Television Network": "nippon tv"
    },
    {
        " : Sora Iro no Tane, a 42-second spot loosely based on the illustrated story The Sky Blue Seed by Reiko Nakagawa and Yuriko Omura, and commissioned to celebrate NTVs fortieth anniversary; and Nandarou, aired as one 42-second and four 42-second spots, centered on an undefinable creature which ultimately became NTVs mascot. Miyazaki designed the storyboards and wrote the screenplay for  Whisper of the Heart  , directed by ": null
    },
    {
        "Yoshifumi Kondō": "yoshifumi kondō"
    },
    {
        ".       Miyazaki began work on the initial storyboards for  Princess Mononoke  in August 42 based on preliminary thoughts and sketches from the late 42s. While experiencing ": null
    },
    {
        "writers block": "writers block"
    },
    {
        " during production, Miyazaki accepted a request for the creation of  On Your Mark , a music video for the ": null
    },
    {
        "song of the same name": "on your mark"
    },
    {
        " by ": null
    },
    {
        "Chage and Aska": "chage and aska"
    },
    {
        ". In the production of the video, Miyazaki experimented with computer animation to supplement traditional animation, a technique he would soon revisit for Princess Mononoke. On Your Mark premiered as a short before Whisper of the Heart. Despite the videos popularity, Suzuki said that it was not given 42 percent focus.          In May 42 Miyazaki took a group of artists and animators to the ancient forests of ": null
    },
    {
        "Yakushima": "yakushima"
    },
    {
        " and the mountains of ": null
    },
    {
        "Shirakami-Sanchi": "shirakami-sanchi"
    },
    {
        ", taking photographs and making sketches. The landscapes in the film were inspired by Yakushima. In Princess Mononoke, Miyazaki revisited the ecological and political themes of Nausicaä of the Valley of the Wind. Miyazaki supervised the 42 ": null
    },
    {
        "cel": "cel"
    },
    {
        "s in the film, about 42 of which were key animation. Princess Mononoke was produced with an estimated budget of ¥42 billion , making it the most expensive film by Studio Ghibli at the time. Approximately fifteen minutes of the film uses computer animation: about five minutes uses techniques such as ": null
    },
    {
        "42D rendering": "3d rendering"
    },
    {
        ", digital composition, and ": null
    },
    {
        "texture mapping": "texture mapping"
    },
    {
        "; the remaining ten minutes uses ": null
    },
    {
        "ink and paint": "traditional animationink and paint"
    },
    {
        ". While the original intention was to digitally paint 42 of the films frames, time constraints doubled this.     Upon its premiere on July 42 42 Princess Mononoke was critically acclaimed, becoming the first animated film to win the ": null
    },
    {
        "Japan Academy Prize for Picture of the Year": "japan academy prize for picture of the year"
    },
    {
        ". The film was also commercially successful, earning a domestic total of ¥42 billion , and becoming the highest-grossing film in Japan for several months. ": null
    },
    {
        "Miramax Films": "miramax films"
    },
    {
        " purchased the films distributions rights for North America; it was the first Studio Ghibli production to receive a substantial theatrical distribution in the United States. While it was largely unsuccessful at the box office, grossing about US$42 million, it was seen as the introduction of Studio Ghibli to global markets. Miyazaki claimed that Princess Mononoke would be his final film.     Tokuma Shoten merged with Studio Ghibli in June 42 Miyazakis next film was conceived while on vacation at a mountain cabin with his family and five young girls who were family friends. Miyazaki realised that he had not created a film for ten-year-old girls, and set out to do so. He read ": null
    },
    {
        "shōjo manga": "shōjo manga"
    },
    {
        " magazines like  Nakayoshi  and  Ribon  for inspiration, but felt they only offered subjects on crushes and romance , which is not what the girls held dear in their hearts . He decided to produce the film about a female heroine whom they could look up to. Production of the film, titled  Spirited Away , commenced in 42 on a budget of ¥42 billion . As with Princess Mononoke, the staff experimented with computer animation, but kept the technology at a level to enhance the story, not to steal the show . Spirited Away deals with symbols of human greed, and a ": null
    },
    {
        "liminal": "liminality"
    },
    {
        " journey through the realm of spirits. The film was released on July 42 42; it received critical acclaim, and is considered among the greatest films of the 42s. It won the Japan Academy Prize for Picture of the Year, and the ": null
    },
    {
        "Academy Award for Best Animated Feature": "academy award for best animated feature"
    },
    {
        ". The film was also commercially successful, earning ¥42 billion at the box office. It is the highest-grossing film in Japan.     In September 42 Studio Ghibli announced the production of  Howls Moving Castle , based on the ": null
    },
    {
        "novel": "howls moving castle"
    },
    {
        " by ": null
    },
    {
        "Diana Wynne Jones": "diana wynne jones"
    },
    {
        ". ": null
    },
    {
        "Mamoru Hosoda": "mamoru hosoda"
    },
    {
        " of Toei Animation was originally selected to direct the film, but disagreements between Hosoda and Studio Ghibli executives led to the projects abandonment. After six months, Studio Ghibli resurrected the project. Miyazaki was inspired to direct the film upon reading Jones novel, and was struck by the image of a castle moving around the countryside; the novel does not explain how the castle moved, which led to Miyazakis designs. He travelled to ": null
    },
    {
        "Colmar": "colmar"
    },
    {
        " and ": null
    },
    {
        "Riquewihr": "riquewihr"
    },
    {
        " in ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        ", France, to study the architecture and the surroundings for the films setting. Additional inspiration came from the concepts of future technology in ": null
    },
    {
        "Albert Robida": "albert robida"
    },
    {
        "s work, as well as the illusion art of 42th century Europe. The film was produced digitally, but the characters and backgrounds were drawn by hand prior to being digitized. It was released on November 42 42 and received widespread critical acclaim. The film received the Osella Award for Technical Excellence at the ": null
    },
    {
        "42st Venice International Film Festival": "61st venice international film festival"
    },
    {
        ", and was nominated for the Academy Award for Best Animated Feature. In Japan, the film grossed a record $42 million in its first week of release. It remains among the highest-grossing films in Japan, with a worldwide gross of over ¥42 billion. Miyazaki received the honorary Golden Lion for Lifetime Achievement award at the ": null
    },
    {
        "42nd Venice International Film Festival": "62nd venice international film festival"
    },
    {
        " in 42     In March 42 Studio Ghibli split from Tokuma Shoten. In the 42s, Miyazaki contacted ": null
    },
    {
        "Ursula K. Le Guin": "ursula k. le guin"
    },
    {
        " expressing interest in producing an adaptation of her  Earthsea  novels; unaware of Miyazakis work, Le Guin declined. Upon watching My Neighbor Totoro several years later, Le Guin expressed approval to the concept of the adaptation. She met with Suzuki in August 42 who wanted Miyazakis son ": null
    },
    {
        "Gorō": "gorō miyazaki"
    },
    {
        " to direct the film, as Miyazaki had wished to retire. Disappointed that Miyazaki was not directing, but under the impression that he would supervise his sons work, Le Guin approved of the films production. Miyazaki later publicly opposed and criticized Gorōs appointment as director. Upon Miyazakis viewing of the film, he wrote a message for his son: It was made honestly, so it was good .     Miyazaki designed the covers for several manga novels in 42 including A Trip to Tynemouth; he also worked as editor, and created a short manga for the book. Miyazakis next film,  Ponyo , began production in May 42 It was initially inspired by ": null
    },
    {
        "The Little Mermaid": "the little mermaid"
    },
    {
        " by ": null
    },
    {
        "Hans Christian Andersen": "hans christian andersen"
    },
    {
        ", though began to take its own form as production continued. Miyazaki aimed for the film to celebrate the innocence and cheerfulness of a childs universe. He intended for it to only use traditional animation, and was intimately involved with the artwork. He preferred to draw the sea and waves himself, as he enjoyed experimenting. Ponyo features 42 frames—a record for Miyazaki. The films seaside village was inspired by ": null
    },
    {
        "Tomonoura": "tomonoura"
    },
    {
        ", a town in ": null
    },
    {
        "Setonaikai National Park": "setonaikai national park"
    },
    {
        ", where Miyazaki stayed in 42 The main character, Sōsuke, is based on Gorō. Following its release on July 42 42 Ponyo was critically acclaimed, receiving Animation of the Year at the ": null
    },
    {
        "42nd Japan Academy Prize": "32nd japan academy prize"
    },
    {
        ". The film was also a commercial success, earning ¥42 billion in its first month and ¥42 billion by the end of 42 placing it among the highest-grossing films in Japan.            In early 42 Miyazaki began writing a manga called , telling the story of ": null
    },
    {
        "Mitsubishi A42M Zero": "mitsubishi a6m zero"
    },
    {
        " fighter designer ": null
    },
    {
        "Jiro Horikoshi": "jiro horikoshi"
    },
    {
        ". The manga was first published in two issues of the Model Graphix magazine, published on February 42 and March 42 42 Miyazaki later co-wrote the screenplay for  Arrietty  and  From Up on Poppy Hill , directed by ": null
    },
    {
        "Hiromasa Yonebayashi": "hiromasa yonebayashi"
    },
    {
        " and Gorō Miyazaki, respectively. Miyazaki wanted his next film to be a sequel to Ponyo, but Suzuki convinced him to instead adapt Kaze Tachinu to film. In November 42 Studio Ghibli announced the production of  The Wind Rises , based on Kaze Tachinu, to be released alongside Takahatas  The Tale of the Princess Kaguya .     Miyazaki was inspired to create The Wind Rises after reading a quote from Horikoshi: All I wanted to do was to make something beautiful . Several scenes in The Wind Rises were inspired by ": null
    },
    {
        "Tatsuo Hori": "tatsuo hori"
    },
    {
        "s novel , in which Hori wrote about his life experiences with his fiancée before she died from tuberculosis. The female lead characters name, Naoko Satomi, was borrowed from Horis novel . The Wind Rises continues to reflect Miyazakis pacifist stance, continuing the themes of his earlier works, despite stating that condemning war was not the intention of the film. The film premiered on July 42 42 and received critical acclaim; it was named Animation of the Year at the ": null
    },
    {
        "42th Japan Academy Prize": "37th japan academy prize"
    },
    {
        ", and was nominated for Best Animated Feature at the ": null
    },
    {
        "42th Academy Awards": "86th academy awards"
    },
    {
        ". It was also commercially successful, grossing ¥42 billion at the Japanese box office, becoming the highest-grossing film in Japan in 42       In September 42 Miyazaki announced that he was retiring from the production of feature films due to his age, but wished to continue working on the displays at the ": null
    },
    {
        "Studio Ghibli Museum": "studio ghibli museum"
    },
    {
        ". Miyazaki was awarded the ": null
    },
    {
        "Academy Honorary Award": "academy honorary award"
    },
    {
        " at the ": null
    },
    {
        "Governors Awards": "governors awards"
    },
    {
        " in November 42 He developed Boro the Caterpillar, a computer-animated short film which was first discussed during pre-production for Princess Mononoke. It was screened exclusively at the Studio Ghibli Museum in July 42 He is also working on an untitled samurai manga. In August 42 Miyazaki proposed a new feature-length film,  How Do You Live? , on which he began animation work without receiving official approval. He hopes to complete the film by 42 though Suzuki predicts a 42–42 release.     In January 42 it has been reported that Vincent Maraval, a frequent collaborator of Miyazaki, tweeted a hint that Miyazaki may have plans for another film in the works.                   Miyazaki has often criticized the current state of the anime industry, stating that animators are unrealistic when creating people. He has stated that anime is produced by humans who cant stand looking at other humans ... thats why the industry is full of  otaku ! . He has also frequently criticized otaku, including gun otaku and ": null
    },
    {
        "Zero": "mitsubishi a6m zero"
    },
    {
        " fanatics , declaring it a fetish , and refusing to identify himself as such.     In 42 several Studio Ghibli staff members, including Miyazaki, criticized ": null
    },
    {
        "Japanese Prime Minister": "prime minister of japan"
    },
    {
        " Shinzō Abe": "shinzō abe"
    },
    {
        "s policies, and the proposed Constitutional amendment that would allow Abe to revise the clause which outlaws war as a means to settle international disputes. Miyazaki felt that Abe wished to leave his name in history as a great man who revised the Constitution and its interpretation , describing it as despicable . Miyazaki has expressed his disapproval of Abes denial of Japans military aggression, stating that Japan should clearly say that inflicted enormous damage on China and express deep remorse over it . He also felt that the countrys government should give a proper apology to Korean ": null
    },
    {
        "comfort women": "comfort women"
    },
    {
        " who serviced the Japanese army during World War II, suggesting that the ": null
    },
    {
        "Senkaku Islands": "senkaku islands"
    },
    {
        " should be split in half or controlled by both Japan and China. After the release of The Wind Rises in 42 some online critics labeled Miyazaki a traitor and anti-Japanese , describing the film as overly ": null
    },
    {
        "left-wing": "left-wing politics"
    },
    {
        " .     Miyazaki refused to attend the ": null
    },
    {
        "42th Academy Awards": "75th academy awards"
    },
    {
        " in ": null
    },
    {
        "Hollywood, Los Angeles": "hollywood, los angeles"
    },
    {
        " in 42 in protest of the United States involvement in the ": null
    },
    {
        "Iraq War": "iraq war"
    },
    {
        ", later stating that he didnt want to visit a country that was bombing Iraq . He did not publicly express this opinion at the request of his producer until 42 when he lifted his boycott and attended ": null
    },
    {
        "San Diego Comic Con International": "san diego comic con international"
    },
    {
        " as a favor to his friend ": null
    },
    {
        "John Lasseter": "john lasseter"
    },
    {
        ". Miyazaki also expressed his opinion about the ": null
    },
    {
        "terrorist attack": "charlie hebdo shooting"
    },
    {
        " at the offices of the French ": null
    },
    {
        "satirical magazine": "satirical magazine"
    },
    {
        "  Charlie Hebdo , criticizing the magazines decision to publish the content cited as the catalyst for the incident. In November 42 Miyazaki stated that he believed many of the people who voted for ": null
    },
    {
        "Brexit": "brexit"
    },
    {
        " and ": null
    },
    {
        "Trump": "donald trump"
    },
    {
        " were affected by the increase in unemployment due to companies building cars in Mexico because of low wages and them in the US . He did not think that Donald Trump would be elected president, calling it a terrible thing , and said that Trumps political opponent ": null
    },
    {
        "Hillary Clinton": "hillary clinton"
    },
    {
        " was terrible as well .       Miyazakis works are characterized by the recurrence of themes such as ": null
    },
    {
        "environmentalism": "environmentalism"
    },
    {
        ", ": null
    },
    {
        "pacifism": "pacifism"
    },
    {
        ", ": null
    },
    {
        "feminism": "feminism"
    },
    {
        ", ": null
    },
    {
        "love": "love"
    },
    {
        " and ": null
    },
    {
        "family": "family"
    },
    {
        ". His narratives are also notable for not pitting a hero against an unsympathetic antagonist.     Miyazakis films often emphasize environmentalism and the Earths fragility. ": null
    },
    {
        "Margaret Talbot": "margaret talbot"
    },
    {
        " stated that Miyazaki dislikes modern technology, and believes much of modern culture is thin and shallow and fake ; he anticipates a time with no more high-rises . Miyazaki felt frustrated growing up in the ": null
    },
    {
        "Shōwa period": "shōwa period"
    },
    {
        " from 42–42 because nature — the mountains and rivers — was being destroyed in the name of economic progress . Peter Schellhase of The Imaginative Conservative identified that several antagonists of Miyazakis films attempt to dominate nature in pursuit of political domination, and are ultimately destructive to both nature and human civilization . Miyazaki is critical of ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        ", ": null
    },
    {
        "globalization": "globalization"
    },
    {
        ", and their effects on modern life. He believes that a company is common property of the people that work there .     Several of Miyazakis films feature anti-war themes. Daisuke Akimoto of Animation Studies categorized Porco Rosso as anti-war propaganda ; he felt that the main character, Porco, transforms into a pig partly due to his extreme distaste of militarism. Akimoto also argues that The Wind Rises reflects Miyazakis antiwar pacifism , despite the latter stating that the film does not attempt to denounce war. Schellhase also identifies Princess Mononoke as a pacifist film due to the protagonist, Ashitaka; instead of joining the campaign of revenge against humankind, as his ethnic history would lead him to do, Ashitaka strives for peace. David Loy and Linda Goodhew argue that both Nausicaä of the Valley of the Wind and Princess Mononoke do not depict traditional evil, but the ": null
    },
    {
        "Buddhist": "buddhist"
    },
    {
        " roots of evil: greed, ill will, and delusion; according to Buddhism, the roots of evil must transform into generosity, loving-kindness and wisdom in order to overcome suffering, and both Nausicaä and Ashitaka accomplish this. When characters in Miyazakis films are forced to engage in violence, it is shown as being a difficult task; in Howls Moving Castle, Howl is forced to fight an inescapable battle in defense of those he loves, and it almost destroys him, though he is ultimately saved by Sophies love and bravery.     Suzuki described Miyazaki as a ": null
    },
    {
        "feminist": "feminism"
    },
    {
        " in reference to his attitude to female workers. Miyazaki has described his female characters as brave, self-sufficient girls that dont think twice about fighting for what they believe in with all their heart , stating that they may need a friend, or a supporter, but never a saviour and that any woman is just as capable of being a hero as any man . Nausicaä of the Valley of the Wind was lauded for its positive portrayal of women, particularly the protagonist Nausicaä. Schellhase noted that the female characters in Miyazakis films are not objectified or sexualized, and possess complex and individual characteristics absent from Hollywood productions. Schellhase also identified a coming of age element for the heroines in Miyazakis films, as they each discover individual personality and strengths . Gabrielle Bellot of  The Atlantic  wrote that, in his films, Miyazaki shows a keen understanding of the complexities of what it might mean to be a woman . In particular, Bellot cites Nausicaä of the Valley of the Wind, praising the films challenging of gender expectations, and the strong and independent nature of Nausicaä. Bellot also noted that Princess Mononokes San represents the conflict between selfhood and expression .     Miyazaki is concerned with the sense of wonder in young people, seeking to maintain themes of love and family in his films. Michael Toscano of Curator found that Miyazaki fears Japanese children are dimmed by a culture of overconsumption, overprotection, utilitarian education, careerism, techno-industrialism, and a secularism that is swallowing Japan’s native animism . Schellhase wrote that several of Miyazakis works feature themes of love and romance, but felt that emphasis is placed on the way lonely and vulnerable individuals are integrated into relationships of mutual reliance and responsibility, which generally benefit everyone around them . He also found that many of the protagonists in Miyazakis films present an idealized image of families, whereas others are dysfunctional. He felt that the non-biological family in Howls Moving Castle gives a message of hope: that those cast out by society can find a healthy place to belong .       Miyazaki forgoes traditional screenplays in his productions, instead developing the films narrative as he designs the storyboards. We never know where the story will go but we just keep working on the film as it develops, he said. In each of his films, Miyazaki has employed traditional animation methods, drawing each frame by hand; computer-generated imagery has been employed in several of his later films, beginning with Princess Mononoke, to enrich the visual look , though he ensures that each film can retain the right ratio between working by hand and computer ... and still be able to call my films 42D . He oversees every frame of his films.     Miyazaki has cited several Japanese artists as his influences, including ": null
    },
    {
        "Sanpei Shirato": "sanpei shirato"
    },
    {
        ", Osamu Tezuka, Soji Yamakawa, and Isao Takahata. A number of Western authors have also influenced his works, including ": null
    },
    {
        "Frédéric Back": "frédéric back"
    },
    {
        ", ": null
    },
    {
        "Lewis Carroll": "lewis carroll"
    },
    {
        ", ": null
    },
    {
        "Roald Dahl": "roald dahl"
    },
    {
        ", ": null
    },
    {
        "Jean Giraud": "jean giraud"
    },
    {
        ", ": null
    },
    {
        "Paul Grimault": "paul grimault"
    },
    {
        ", ": null
    },
    {
        "Ursula K. Le Guin": "ursula k. le guin"
    },
    {
        ", and ": null
    },
    {
        "Yuri Norstein": "yuri norstein"
    },
    {
        ", as well as animation studio ": null
    },
    {
        "Aardman Animations": "aardman animations"
    },
    {
        " . Specific works that have influenced Miyazaki include  Animal Farm  ,  The Snow Queen  , and  The King and the Mockingbird  . When animating young children, Miyazaki often takes inspiration from his friends children, as well as memories of his own childhood.     Miyazaki has frequently been cited as an inspiration to numerous animators, directors and writers around the world, including ": null
    },
    {
        "Guillermo del Toro": "guillermo del toro"
    },
    {
        ", ": null
    },
    {
        "Pete Docter": "pete docter"
    },
    {
        ", ": null
    },
    {
        "Glen Keane": "glen keane"
    },
    {
        ", John Lasseter, ": null
    },
    {
        "James Cameron": "james cameron"
    },
    {
        ", ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        ", ": null
    },
    {
        "Wes Anderson": "wes anderson"
    },
    {
        ", ": null
    },
    {
        "Mamoru Hosoda": "mamoru hosoda"
    },
    {
        ", ": null
    },
    {
        "Dean DeBlois": "dean deblois"
    },
    {
        ", ": null
    },
    {
        "Jennifer Lee": "jennifer lee"
    },
    {
        ", and ": null
    },
    {
        "Nick Park": "nick park"
    },
    {
        ". Keane said Miyazaki is a huge influence on ": null
    },
    {
        "Walt Disney Animation Studios": "walt disney animation studios"
    },
    {
        " and has been part of our heritage ever since  The Rescuers Down Under  . Artists from ": null
    },
    {
        "Pixar": "pixar"
    },
    {
        " and ": null
    },
    {
        "Aardman Studios": "aardman studios"
    },
    {
        " signed a tribute stating, Youre our inspiration, Miyazaki-san!  He has also been cited as inspiration for video game designers including ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        " and ": null
    },
    {
        "Hironobu Sakaguchi": "hironobu sakaguchi"
    },
    {
        ", as well as the  Avatar: The Last Airbender , and the video game  Ori and the Blind Forest  .       Miyazaki married fellow animator Akemi Ota in October 42 The couple have two sons: ": null
    },
    {
        "Gorō": "gorō miyazaki"
    },
    {
        ", born in January 42 and Keisuke, born in April 42 Miyazakis dedication to his work harmed his relationship with Gorō, as he was often absent. Gorō watched his fathers works in an attempt to understand him, since the two rarely talked. During the production of Tales from Earthsea in 42 Gorō said that his father gets zero marks as a father but full marks as a director of animated films .          Miyazaki won the ": null
    },
    {
        "Ōfuji Noburō Award": "ōfuji noburō award"
    },
    {
        " at the ": null
    },
    {
        "Mainichi Film Awards": "mainichi film awards"
    },
    {
        " for The Castle of Cagliostro , Nausicaä of the Valley of the Wind , Laputa: Castle in the Sky , and My Neighbor Totoro , and the ": null
    },
    {
        "Mainichi Film Award for Best Animation Film": "mainichi film award for best animation film"
    },
    {
        " for Kikis Delivery Service , Porco Rosso , Princess Mononoke , Spirited Away and Whale Hunt . Spirited Away was also awarded the ": null
    },
    {
        "Academy Award for Best Animated Feature": "academy award for best animated feature"
    },
    {
        ", while Howls Moving Castle and The Wind Rises received nominations. He was named a ": null
    },
    {
        "Person of Cultural Merit": "person of cultural merit"
    },
    {
        " by the Japanese government in November 42 for outstanding cultural contributions. His other accolades include eight ": null
    },
    {
        "Tokyo Anime Award": "tokyo anime award"
    },
    {
        "s, eight ": null
    },
    {
        "Kinema Junpo Awards": "kinema junpo awards"
    },
    {
        ", six ": null
    },
    {
        "Japan Academy Awards": "japan academy prize"
    },
    {
        ", five ": null
    },
    {
        "Annie Award": "annie award"
    },
    {
        "s, and three awards from the ": null
    },
    {
        "Anime Grand Prix": "anime grand prix"
    },
    {
        " and the ": null
    },
    {
        "Venice Film Festival": "venice film festival"
    },
    {
        ".       ": null
    }
]