[
    {
        "   Heathenry": "heathenry"
    },
    {
        " is a ": null
    },
    {
        "modern Pagan": "modern paganism"
    },
    {
        " new religious movement": "new religious movement"
    },
    {
        " that has been active in the United States since at least the early 1970s. Although the term Heathenry is often employed to cover the entire religious movement, different Heathen groups within the United States often prefer the term Ásatrú or Odinism as self-designations.     Heathenry appeared in the United States during the 1960s, at the same time as the wider emergence of ": null
    },
    {
        "modern Paganism in the United States": "neopaganism in the united states"
    },
    {
        ". Among the earliest American group was the ": null
    },
    {
        "Odinist Fellowship": "odinist fellowship"
    },
    {
        ", founded by Danish migrant ": null
    },
    {
        "Else Christensen": "else christensen"
    },
    {
        " in 1969.       Ásatrú grew steadily in the United States during the 1960s. In 1969, the Danish Odinist ": null
    },
    {
        "Else Christensen": "else christensen"
    },
    {
        " established the ": null
    },
    {
        "Odinist Fellowship": "odinist fellowship"
    },
    {
        " from her home in ": null
    },
    {
        "Florida": "florida"
    },
    {
        ", U.S.A. Heavily influenced by ": null
    },
    {
        "Alexander Rud Mills": "alexander rud mills"
    },
    {
        " writings, she began publication of a magazine, The Odinist, although this focused to a greater extent on right-wing and racialist ideas than theological ones. ": null
    },
    {
        "Stephen McNallen": "stephen mcnallen"
    },
    {
        " first founded the Viking Brotherhood in the early 1970s, before creating the ": null
    },
    {
        "Ásatrú Free Assembly": "ásatrú free assembly"
    },
    {
        " in 1976, which broke up in 1986 amid widespread political disagreements after McNallens repudiation of ": null
    },
    {
        "neo-Nazis": "neo-nazis"
    },
    {
        " within the group. In the 1990s, McNallen founded the ": null
    },
    {
        "Ásatrú Folk Assembly": "ásatrú folk assembly"
    },
    {
        " , an ethnically oriented Heathen group headquartered in California.     Meanwhile, ": null
    },
    {
        "Valgard Murray": "valgard murray"
    },
    {
        " and his kindred in ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        " founded the ": null
    },
    {
        "Ásatrú Alliance": "ásatrú alliance"
    },
    {
        " in the late 1980s, which shared the AFAs perspectives on race and which published the Vor Tru newsletter. In 1987, ": null
    },
    {
        "Edred Thorsson": "edred thorsson"
    },
    {
        " and James Chisholm founded ": null
    },
    {
        "The Troth": "the troth"
    },
    {
        ", which was incorporated in ": null
    },
    {
        "Texas": "texas"
    },
    {
        ". Taking an inclusive, non-racialist view, it soon grew into an international organisation.       In English usage, the genitive  of Æsir faith is often used on its own to denote adherents . This term is favored by practitioners who focus on the deities of Scandinavia, although it is problematic as many Asatruar worship deities and entities other than the Æsir, such as the Vanir, Valkyries, Elves, and Dwarves. Other practitioners term their religion Vanatrú, meaning those who honour the Vanir or Dísitrú, meaning those who honour the Goddesses , depending on their particular theological emphasis.     Within the community it is sometimes stated that the term Ásatrú pertains to groups which are not racially focused, while Odinism is the term preferred by racially oriented groups. However, in practice, there is no such neat division in terminology.     There are notable differences of emphasis between Ásatrú as practiced in the US and in Scandinavia. According to Strmiska and Sigurvinsson , American Asatruar tend to prefer a more devotional form of worship and a more emotional conception of the Nordic gods than Scandinavian practitioners, reflecting the parallel tendency of highly emotional forms of Christianity prevalent in the United States. American Nordic Pagans want to feel an intimate relationship with their gods, not unlike evangelical attitudes towards Jesus. Icelandic Asatruar, by contrast, are more focused on devotion to their past cultural heritage rather than to particular gods. Strmiska and Sigurvinsson , p. 165.       Although deeming it impossible to calculate the exact size of the Heathen community in the US, sociologist Jeffrey Kaplan estimated that, in the mid-1990s, there were around 500 active practitioners in the country, with a further thousand individuals on the periphery of the movement. He noted that the overwhelming majority of individuals in the movement were white, male, and young. Most had at least an undergraduate degree, and worked in a mix of ": null
    },
    {
        "white collar": "white-collar worker"
    },
    {
        " and ": null
    },
    {
        "blue collar jobs": "blue-collar worker"
    },
    {
        ". From her experience within the community, Snook concurred that the majority of American Heathens were male, adding also that most were also white and middle-aged, but believed that there had been a growth in the proportion of Heathen women in the US since the mid-1990s.     The Pagan Census project led by ": null
    },
    {
        "Helen A. Berger": "helen a. berger"
    },
    {
        ", Evan A. Leach, and Leigh S. Shaffer gained 60 responses from Heathens in the US, noting that 65% were male and 35% female, which they saw as the opposite of the rest of the countrys Pagan community. The majority had a college education, but were generally less well educated than the wider Pagan community, with a lower median income than the wider Pagan community too.   Subsequent assessments have suggested a larger support base; 10,000 to 20,000 according to McNallen,  and 7,878 according to the 2014 census.        Ásatrú organizations have memberships which span the entire political and spiritual spectrum. There is a history of political controversy within organized US Ásatrú, mostly surrounding the question of how to deal with such adherents as place themselves in a context of the ": null
    },
    {
        "far right": "far right"
    },
    {
        " and ": null
    },
    {
        "white supremacy": "white supremacy"
    },
    {
        ", notably resulting in the fragmentation of the Asatru Free Assembly in 1986.     Externally, political activity on the part of Ásatrú organizations has surrounded campaigns against alleged ": null
    },
    {
        "religious discrimination": "religious discrimination against neopagans"
    },
    {
        ", such as the call for the introduction of an Ásatrú emblem of belief by the ": null
    },
    {
        "United States Department of Veterans Affairs": "united states department of veterans affairs"
    },
    {
        " to parallel the Wiccan pentacle granted to the widow of ": null
    },
    {
        "Patrick Stewart": "patrick stewart"
    },
    {
        " in 2006. In May 2013, the ": null
    },
    {
        "Hammer of Thor": "mjölnir"
    },
    {
        " was added to the list of ": null
    },
    {
        "United States Department of Veterans Affairs emblems for headstones and markers": "united states department of veterans affairs emblems for headstones and markers"
    },
    {
        ".   It was reported in early 2019 that a Heathenry service was held on the U.S. Navys ": null
    },
    {
        "USS John C. Stennis": "uss john c. stennis"
    },
    {
        "             Historically, the main dispute between the national organizations has generally centered on the interpretation of Nordic heritage as either something cultural, or as something genetic or racial. In the internal discourse within American Ásatrú, this cultural/racial divide has long been known as universalist vs. folkish Ásatrú. Strmiska and Sigurvinsson , p. 134f.     ": null
    },
    {
        "The Troth": "the troth"
    },
    {
        " takes the universalist position, claiming Ásatrú as a synonym for Northern European Heathenry taken to comprise many variations, names, and practices, including ": null
    },
    {
        "Theodism": "theodism"
    },
    {
        ", Irminism, Odinism, and Anglo-Saxon Heathenry . The ": null
    },
    {
        "Asatru Folk Assembly": "asatru folk assembly"
    },
    {
        " takes the folkish position, claiming that Ásatrú and the Germanic beliefs are ancestral in nature, and as an indigenous religion of the European Folk should only be accessed by the descendants of Europe. In the ": null
    },
    {
        "UK": "neopaganism in the united kingdom"
    },
    {
        ", Germanic Neopaganism is more commonly known as ": null
    },
    {
        "Odinism": "odinism"
    },
    {
        " or as Heathenry. This is mostly a matter of terminology, and US Ásatrú may be equated with UK Odinism for practical purposes, as is evident in the short-lived ": null
    },
    {
        "International Asatru-Odinic Alliance": "international asatru-odinic alliance"
    },
    {
        " of folkish Ásatrú/Odinist groups.     Some groups identifying as Ásatrú have been associated with ": null
    },
    {
        "national socialist": "national socialist"
    },
    {
        " and ": null
    },
    {
        "white nationalist": "white nationalist"
    },
    {
        " movements.  ": null
    },
    {
        "Wotansvolk": "wotansvolk"
    },
    {
        " for example is an explicitly racial form.     More recently, however, many Ásatrú groups have been taking a harder stance against these elements of their community. , so named for the corresponding stanza of the ": null
    },
    {
        "Hávamál": "hávamál"
    },
    {
        ": When you see misdeeds, speak out against them, and give your enemies no frið” is a collective statement denouncing and testifying disassociation with the ": null
    },
    {
        "Asatru Folk Assembly": "asatru folk assembly"
    },
    {
        " for alleged racial and sexually-discriminatory practices and beliefs signed by over 150 Ásatrú religious organizations from over 15 different nations mainly represented on ": null
    },
    {
        "Facebook": "facebook"
    },
    {
        ".          Inmates of the Intensive Management Unit at ": null
    },
    {
        "Washington State Penitentiary": "washington state penitentiary"
    },
    {
        " who are adherents of Ásatrú in 2001 were deprived of their ": null
    },
    {
        "Thors Hammer": "mjölnir"
    },
    {
        " medallions.    In 2007, a federal judge confirmed that Ásatrú adherents in US prisons have the right to possess a Thors Hammer pendant. An inmate sued the Virginia Department of Corrections after he was denied it while members of other religions were allowed their medallions.       In the Georgacarakos v. Watts case Peter N. Georgacarakos filed a pro se civil-rights complaint in the United States District Court for the District of Colorado against 19 prison officials for interference with the free exercise of his Ásatrú religion and discrimination on the basis of his being Ásatrú . ": null
    }
]