[
    {
        "             The Hebrides  comprise a widespread and diverse ": null
    },
    {
        "archipelago": "Archipelago"
    },
    {
        " off the west coast of mainland ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        ". There are two main groups: the ": null
    },
    {
        "Inner": "Inner Hebrides"
    },
    {
        " and ": null
    },
    {
        "Outer Hebrides": "Outer Hebrides"
    },
    {
        ".     These islands have a long history of occupation dating back to the ": null
    },
    {
        "Mesolithic": "Mesolithic"
    },
    {
        ", and the culture of the residents has been affected by the successive influences of ": null
    },
    {
        "Celtic-": "Celtic Language"
    },
    {
        ", ": null
    },
    {
        "Norse-": "Old Norse Language"
    },
    {
        ", and ": null
    },
    {
        "English-": "English Language"
    },
    {
        "speaking peoples. This diversity is reflected in the names given to the islands, which are derived from the languages that have been spoken there in historic and perhaps ": null
    },
    {
        "prehistoric": "Prehistoric"
    },
    {
        " times.     The Hebrides are the source of much of ": null
    },
    {
        "Scottish Gaelic literature": "Scottish Gaelic Literature"
    },
    {
        " and ": null
    },
    {
        "Gaelic music": "Gaelic Music"
    },
    {
        ". Today the economy of the islands is dependent on ": null
    },
    {
        "crofting": "Crofting"
    },
    {
        ", fishing, ": null
    },
    {
        "tourism": "Tourism"
    },
    {
        ", the oil industry, and ": null
    },
    {
        "renewable energy": "Renewable Energy"
    },
    {
        ". The Hebrides have lower biodiversity than mainland Scotland, but there is a significant presence of seals and seabirds.       The earliest written references that have survived relating to the islands were made circa 77 AD by ": null
    },
    {
        "Pliny the Elder": "Pliny The Elder"
    },
    {
        " in his Natural History, where he states that there are 30 , and makes a separate reference to , which ": null
    },
    {
        "Watson": "William J. Watson"
    },
    {
        " concludes is unequivocally the Outer Hebrides. Writing about 80 years later, in 140-150  AD, ": null
    },
    {
        "Ptolemy": "Ptolemy"
    },
    {
        ", drawing on the earlier naval expeditions of , writes that there are five  and . Breeze, David J. The ancient geography of Scotland in Smith and Banks pp. 11-13 Watson pp. 40–41 Watson p. 38 Later texts in classical ": null
    },
    {
        "Latin": "Latin Language"
    },
    {
        ", by writers such as , use the forms  and . Louis Deroy & Marianne Mulon , Paris: Le Robert, article Hébrides     The name  recorded by Ptolemy may be pre-Celtic. Islay is Ptolemys , Watson p. 37 the use of the p hinting at a ": null
    },
    {
        "Brythonic": "Celtic Britons"
    },
    {
        " or Pictish tribal name, , Watson p. 45 although the root is not Gaelic. Gammeltoft, Peder Scandinavian Naming-Systems in the Hebrides - A Way of Understanding how the Scandinavians were in Contact with Gaels and Picts? in Ballin Smith et al p. 487 ": null
    },
    {
        "Woolf": "Alex Woolf"
    },
    {
        " has suggested that  may be an Irish attempt to reproduce the word  phonetically rather than by translating it and that the tribes name may come from the root  meaning horse . ": null
    },
    {
        "Woolf, Alex": "Alex Woolf"
    },
    {
        " . Academia.edu. Retrieved 21 January 2015. Watson also notes the possible relationship between  and the ancient Irish ": null
    },
    {
        "Ulaid": "Ulaid"
    },
    {
        " tribal name  and the personal name of a king  recorded in the .        The names of other individual islands reflect their complex linguistic history. The majority are Norse or Gaelic but the roots of several other Hebrides may have a pre-Celtic origin. ": null
    },
    {
        "Adomnán": "Adomnán"
    },
    {
        ", the 7th century abbot of Iona, records Colonsay as Colosus and Tiree as Ethica, both of which may be pre-Celtic names. Watson p. 85-86 The ": null
    },
    {
        "etymology of Skye": "Etymology Of Skye"
    },
    {
        " is complex and may also include a pre-Celtic root. Lewis is  in Old Norse and although various suggestions have been made as to a Norse meaning  p. 80 the name is not of Gaelic origin and the Norse credentials are questionable.     The earliest comprehensive written list of Hebridean island names was undertaken by ": null
    },
    {
        "Donald Monro": "Donald Monro"
    },
    {
        " in 1549, which in some cases also provides the earliest written form of the island name. The derivations of all of the inhabited islands of the Hebrides and some of the larger uninhabited ones are listed below.       ": null
    },
    {
        "Lewis and Harris": "Lewis And Harris"
    },
    {
        " is the largest island in Scotland and the third largest of the ": null
    },
    {
        "British Isles": "British Isles"
    },
    {
        ", after Great Britain and Ireland. Haswell-Smith p. 262. It incorporates Lewis in the north and Harris in the south, both of which are frequently referred to as individual islands, although they are joined by a land border. Remarkably, the island does not have a common name in either English or Gaelic and is referred to as Lewis and Harris , Lewis with Harris , Harris with Lewis etc. For this reason it is treated as two separate islands below. Thompson p. 13. The derivation of Lewis may be pre-Celtic and the origin of Harris is no less problematic. In the ": null
    },
    {
        "Ravenna Cosmography": "Ravenna Cosmography"
    },
    {
        ", Erimon may refer to Harris . This word may derive from the  ": null
    }
]