[
    {
        "                Hedeby  was an important Danish ": null
    },
    {
        "Viking Age": "Viking Age"
    },
    {
        " trading settlement near the southern end of the ": null
    },
    {
        "Jutland Peninsula": "Jutland Peninsula"
    },
    {
        ", now in the ": null
    },
    {
        "Schleswig-Flensburg": "Schleswig-Flensburg"
    },
    {
        " district of ": null
    },
    {
        "Schleswig-Holstein": "Schleswig-Holstein"
    },
    {
        ", ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ". It is the most important archaeological site in Schleswig-Holstein.     The settlement developed as a trading centre at the head of a narrow, navigable inlet known as the ": null
    },
    {
        "Schlei": "Schlei"
    },
    {
        ", which connects to the ": null
    },
    {
        "Baltic Sea": "Baltic Sea"
    },
    {
        ". The location was favorable because there is a short portage of less than 15  km to the ": null
    },
    {
        "Treene River": "Treene River"
    },
    {
        ", which flows into the ": null
    },
    {
        "Eider": "Eider River"
    },
    {
        " with its ": null
    },
    {
        "North Sea": "North Sea"
    },
    {
        " estuary, making it a convenient place where goods and ships could be pulled on a ": null
    },
    {
        "corduroy road": "Corduroy Road"
    },
    {
        " overland for an almost uninterrupted seaway between the Baltic and the North Sea and avoid a dangerous and time-consuming circumnavigation of Jutland, providing Hedeby with a role similar to later ": null
    },
    {
        "Lübeck": "Lübeck"
    },
    {
        ".   Hedeby was the second largest Nordic town during the Viking Age, after ": null
    },
    {
        "Uppåkra": "Uppåkra"
    },
    {
        " in present-day southern Sweden, Sveriges riksdag,  2009-10-05   The city of ": null
    },
    {
        "Schleswig": "Schleswig, Schleswig-Holstein"
    },
    {
        " was later founded on the other side of the Schlei. Hedeby was abandoned after its destruction in 1066.     Hedeby was rediscovered in the late 19th century and excavations began in 1900. The ": null
    },
    {
        "Haithabu Museum": "Hedeby Viking Museum"
    },
    {
        " was opened next to the site in 1985.       The Old Norse name Heiða-býr simply translates to heath-settlement . The name is recorded in numerous spelling variants. , p. 13     Heiðabýr is the reconstructed name in standard ": null
    },
    {
        "Old Norse": "Old Norse"
    },
    {
        ", also anglicized as Heithabyr.   The ": null
    },
    {
        "Stone of Eric": "Stone Of Eric"
    },
    {
        ", a 10th-century Danish ": null
    },
    {
        "runestone": "Runestone"
    },
    {
        " with an inscription mentioning ᚼᛅᛁᚦᛅ᛭ᛒᚢ , found in 1796.  - ": null
    },
    {
        "Rundata": "Rundata"
    },
    {
        " entry for DR 1.   Old English æt Hæðum, from ": null
    },
    {
        "Ohtheres": "Ohthere Of Hålogaland"
    },
    {
        "account of his travels to ": null
    },
    {
        "Alfred the Great": "Alfred The Great"
    },
    {
        " in the Old English ": null
    },
    {
        "Orosius": "Orosius"
    },
    {
        ".     Hedeby, the modern Danish spelling, also most commonly used in English.    Haddeby  is the ": null
    },
    {
        "Low German": "Low German"
    },
    {
        " form, also the name of the administrative district formed in 1949 and named for the site; in 1985, the district introduced a coat of arms featuring a bell with a ": null
    },
    {
        "runic": "Younger Futhark"
    },
    {
        " inscription reading ᚼᛁᚦᛅ᛬ᛒᚢ .    Haithabu is the modern German spelling used when referring to the historical settlement; this spelling represents the transliteration of the name as found in the ": null
    },
    {
        "Stone of Eric": "Stone Of Eric"
    },
    {
        " inscription; it was introduced among other variants in antiquarian literature in the 19th century and has since become the standard German name of the settlement. Haddeby, vormals Heidabu, Haithabu, Heidebo, Hethäbye   Heinrich Karl Wilhelm Berghaus, Schweden, Norwegen u. Dänemark die 3 skandinavischen Reiche Hasselberg , .     Sources from the 9th and 10th century AD also attest to the names Sliesthorp and Sliaswich , and the town of ": null
    },
    {
        "Schleswig": "Schleswig"
    },
    {
        " still exists 3  km north of Hedeby.  However, ": null
    },
    {
        "Æthelweard": "Æthelweard"
    },
    {
        " claimed in his Latin translation of the ": null
    },
    {
        "Anglo-Saxon Chronicle": "Anglo-Saxon Chronicle"
    },
    {
        " that the Saxons used Slesuuic and the Danes Haithaby to refer to the same town.                Hedeby is first mentioned in the Frankish chronicles of ": null
    },
    {
        "Einhard": "Einhard"
    },
    {
        " who was in the service of ": null
    },
    {
        "Charlemagne": "Charlemagne"
    },
    {
        ",   but was probably founded around 770. In 808 the Danish king ": null
    },
    {
        "Godfred": "Gudfred"
    },
    {
        " destroyed a competing ": null
    },
    {
        "Slav": "Early Slavs"
    },
    {
        " trade centre named ": null
    },
    {
        "Reric": "Reric"
    },
    {
        ", and it is recorded in the Frankish chronicles that he moved the merchants from there to Hedeby. This may have provided the initial impetus for the town to develop. The same sources record that Godfred strengthened the ": null
    },
    {
        "Danevirke": "Danevirke"
    },
    {
        ", an earthen wall that stretched across the south of the Jutland peninsula. The ": null
    },
    {
        "Danevirke": "Danevirke"
    },
    {
        " joined the defensive walls of Hedeby to form an east-west barrier across the peninsula, from the marshes in the west to the Schlei inlet leading into the Baltic in the east.     The town itself was surrounded on its three landward sides by earthworks. At the end of the 9th century the northern and southern parts of the town were abandoned for the central section. Later a 9-metre high semi-circular wall was erected to guard the western approaches to the town. On the eastern side, the town was bordered by the innermost part of the Schlei inlet and the bay of ": null
    },
    {
        "Haddebyer Noor": "Haddebyer Noor"
    },
    {
        ".              Hedeby became a principal marketplace because of its geographical location on the major trade routes between the ": null
    },
    {
        "Frankish Empire": "Frankish Empire"
    },
    {
        " and ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        " , and between the ": null
    },
    {
        "Baltic": "Baltic Sea"
    },
    {
        " and the ": null
    },
    {
        "North Sea": "North Sea"
    },
    {
        " . Between 800 and 1000 the growing economic power of the ": null
    },
    {
        "Vikings": "Vikings"
    },
    {
        " led to its dramatic expansion as a major trading centre. Along with ": null
    },
    {
        "Birka": "Birka"
    },
    {
        " and ": null
    },
    {
        "Schleswig": "Schleswig"
    },
    {
        ", Hedebys prominence as a major international trading hub served as a foundation of the ": null
    },
    {
        "Hanseatic League": "Hanseatic League"
    },
    {
        " that would emerge by the 12th century.      The following indicate the importance achieved by the town:   The town was described by visitors from England  and the Mediterranean .   Hedeby became the seat of a bishop and belonged to the Archbishopric of ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        " and ": null
    },
    {
        "Bremen": "Archdiocese Of Bremen"
    },
    {
        ".   The town minted its own coins .   ": null
    },
    {
        "Adam of Bremen": "Adam Of Bremen"
    },
    {
        " reports that ships were sent from this portus maritimus to Slavic lands, to ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ", ": null
    },
    {
        "Samland": "Sambia Peninsula"
    },
    {
        "  and even ": null
    },
    {
        "Greece": "Greece"
    },
    {
        ".     A Swedish dynasty founded by ": null
    },
    {
        "Olof the Brash": "Olof The Brash"
    },
    {
        " is said to have ruled Hedeby during the last decades of the 9th century and the first part of the 10th century. This was told to ": null
    },
    {
        "Adam of Bremen": "Adam Of Bremen"
    },
    {
        " by the Danish king ": null
    },
    {
        "Sweyn Estridsson": "Sweyn Estridsson"
    },
    {
        ", and it is supported by three ": null
    },
    {
        "runestones": "Runestone"
    },
    {
        "found in Denmark. Two of them were raised by the mother of Olofs grandson ": null
    },
    {
        "Sigtrygg Gnupasson": "Sigtrygg Gnupasson"
    },
    {
        ". The third runestone, discovered in 1796, is from Hedeby, the  Stone of Eric  . It is inscribed with ": null
    },
    {
        "Norwegian-Swedish runes": "Runic Alphabetyounger Fuþark"
    },
    {
        ". It is, however, possible that Danes also occasionally wrote with this version of the ": null
    },
    {
        "younger futhark": "Runic Alphabetyounger Fuþark"
    },
    {
        ".       Life was short and crowded in Hedeby. The small houses were clustered tightly together in a grid, with the east-west streets leading down to jetties in the harbour. People rarely lived beyond 30 or 40, and archaeological research shows that their later years were often painful due to crippling diseases such as tuberculosis.  Yet make-up for men and rights for women provide surprises to the modern understanding.     ": null
    },
    {
        "Al-Tartushi": "Ibrahim Ibn Yaqub Al-Tartushi"
    },
    {
        ", a late 10th-century traveller from ": null
    },
    {
        "al-Andalus": "Al-Andalus"
    },
    {
        ", provides one of the most colourful and often quoted descriptions of life in Hedeby. Al-Tartushi was from ": null
    },
    {
        "Cordoba": "Córdoba, Spain"
    },
    {
        " in ": null
    },
    {
        "Spain": "Spain"
    },
    {
        ", which had a significantly more wealthy and comfortable lifestyle than Hedeby. While Hedeby may have been significant by Scandinavian standards, Al-Tartushi was unimpressed:   : Slesvig is a very large town at the extreme end of the world ocean... The inhabitants worship Sirius, except for a minority of Christians who have a church of their own there.... He who slaughters a sacrificial animal puts up poles at the door to his courtyard and impales the animal on them, be it a piece of cattle, a ram, billy goat or a pig so that his neighbours will be aware that he is making a sacrifice in honour of his god. The town is poor in goods and riches. People eat mainly fish which exist in abundance. Babies are thrown into the sea for reasons of economy. The right to divorce belongs to the women.... Artificial eye make-up is another peculiarity; when they wear it their beauty never disappears, indeed it is enhanced in both men and women. Further: Never did I hear singing fouler than that of these people, it is a rumbling emanating from their throats, similar to that of a dog but even more bestial.         The town was sacked in 1050 by King ": null
    },
    {
        "Harald Hardrada": "Harald Hardrada"
    },
    {
        " of Norway during a conflict with King ": null
    },
    {
        "Sweyn II of Denmark": "Sweyn Ii Of Denmark"
    },
    {
        ". He set the town on fire by sending several burning ships into the harbour, the charred remains of which were found at the bottom of the Schlei during recent excavations. A Norwegian  skald , quoted by ": null
    },
    {
        "Snorri Sturluson": "Snorri Sturluson"
    },
    {
        ", describes the sack as follows:   :Burnt in anger from end to end was Hedeby..   :High rose the flames from the houses when, before dawn, I stood upon the strongholds arm      In 1066 the town was ": null
    },
    {
        "sacked": "Looting"
    },
    {
        " and burned by ": null
    },
    {
        "West Slavs": "West Slavs"
    },
    {
        ".  Following the destruction, Hedeby was slowly abandoned. People moved across the ": null
    },
    {
        "Schlei": "Schlei"
    },
    {
        " inlet": "Förde"
    },
    {
        ", which separates the two peninsulas of ": null
    },
    {
        "Angeln": "Angeln"
    },
    {
        " and ": null
    },
    {
        "Schwansen": "Schwansen"
    },
    {
        ", and founded the town of ": null
    },
    {
        "Schleswig": "Schleswig, Schleswig-Holstein"
    },
    {
        ".           After the settlement was abandoned, rising waters contributed to the complete disappearance of all visible structures on the site. It was even forgotten where the settlement had been. This proved to be fortunate for later archaeological work at the site.          Archaeological work began at the site in 1900 after the rediscovery of the settlement. Excavations were conducted for the next 15 years. Further excavations were carried out between 1930 and 1939. Archaeological work on the site was productive for two main reasons: that the site had never been built on since its destruction some 840 years earlier, and that the permanently waterlogged ground had preserved wood and other perishable materials. After the Second World War, in 1959, archaeological work was started again and has continued intermittently ever since. The embankments surrounding the settlement were excavated, and the harbour was partially dredged, during which the wreck of a ": null
    },
    {
        "Viking ship": "Viking Ship"
    },
    {
        " was discovered. Despite all this work, only 5% of the settlement has as yet been investigated.     The most important finds resulting from the excavations are now on display in the adjoining ": null
    },
    {
        "Haithabu Museum": "Hedeby Viking Museum"
    },
    {
        ".     ": null
    }
]