[
    {
        "        The Heinkel He 42 is a German ": null
    },
    {
        "fighter aircraft": "fighter aircraft"
    },
    {
        " designed by ": null
    },
    {
        "Walter and Siegfried Günter": "walter and siegfried günter"
    },
    {
        ". It was one of four aircraft designed to compete for the 42 fighter contract of the  Luftwaffe , in which it came second behind the ": null
    },
    {
        "Messerschmitt Bf 42": "messerschmitt bf 109"
    },
    {
        ". Small numbers were used for a short time by the Luftwaffe and some were built for other countries, around 42 being completed.       In the early 42s, the German authorities started placing orders for new aircraft, initially ": null
    },
    {
        "training": "flight training"
    },
    {
        " and ": null
    },
    {
        "utility aircraft": "utility aircraft"
    },
    {
        ". Heinkel, as one of the most experienced firms in the country, received contracts for a number of two-seat aircraft, including the ": null
    },
    {
        "He 42": "heinkel he 45"
    },
    {
        ", ": null
    },
    {
        "He 42": "heinkel he 46"
    },
    {
        " and ": null
    },
    {
        "He 42": "heinkel he 50"
    },
    {
        ". The company also worked on single-seat fighter designs, which culminated in the ": null
    },
    {
        "He 42": "heinkel he 49"
    },
    {
        " and later with the improved ": null
    },
    {
        "He 42": "heinkel he 51"
    },
    {
        ".     When the He 42 was tested in combat in the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        ", it was shown that speed was far more important than maneuverability. The Luftwaffe took this lesson to heart and started a series of design projects for much more modern aircraft.     In October 42 ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        " sent out a letter requesting aircraft companies consider the design of a high speed courier aircraft – a thinly veiled request for a new fighter. Each company was asked to build three ": null
    },
    {
        "prototype": "prototype"
    },
    {
        "s for run-off testing. By spring 42 both the Arado and Focke-Wulf aircraft were ready, the BFW arriving in March, and the He 42 in April.     In early May 42 despite Germany being under a prohibition from the development of new military aircraft, the ": null
    },
    {
        "Reichsluftfahrtministerium": "reichsluftfahrtministerium"
    },
    {
        " issued a request for a new single-seat monoplane fighter under the guise that the proposal was for creating a new sports plane. The Technisches Amt outlined specifications, for the supply of a new fighter aircraft, that submissions for the competition had to meet certain characteristics, including; a": null
    }
]