[
    {
        "     Heinrich Anton de Bary  was a German ": null
    },
    {
        "surgeon": "surgeon"
    },
    {
        ", ": null
    },
    {
        "botanist": "botanist"
    },
    {
        ", ": null
    },
    {
        "microbiologist": "microbiologist"
    },
    {
        ", and ": null
    },
    {
        "mycologist": "mycologist"
    },
    {
        " .   He is considered a founding father of ": null
    },
    {
        "plant pathology": "plant pathology"
    },
    {
        " as well as the founder of modern mycology. His extensive and careful studies of the life history of ": null
    },
    {
        "fungi": "fungi"
    },
    {
        " and contribution to the understanding of ": null
    },
    {
        "algae": "algae"
    },
    {
        " and higher plants were landmarks of biology.       Born in ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        ", Anton de Bary was one of ten children born to physician August Theodor de Bary and Emilie Meyer de Bary. His father encouraged him to join the excursions of the active group of ": null
    },
    {
        "naturalist": "naturalist"
    },
    {
        "s who collected specimens in the nearby countryside. De Bary’s youthful interest in plants and in examination of fungi and algae were inspired by ": null
    },
    {
        "George Fresenius": "georg fresenius"
    },
    {
        ", a physician, who also taught botany at ": null
    },
    {
        "Senckenberg Institute": "senckenberg institute of pathology"
    },
    {
        ". Fresenius was an expert on ": null
    },
    {
        "thallophyte": "thallophyte"
    },
    {
        "s. In 42 de Bary graduated from a ": null
    },
    {
        "Gymnasium": "gymnasium"
    },
    {
        " at Frankfurt, and began to study medicine at ": null
    },
    {
        "Heidelberg": "heidelberg university"
    },
    {
        ", continued at ": null
    },
    {
        "Marburg": "university of marburg"
    },
    {
        ". In 42 he went to ": null
    },
    {
        "Berlin": "humboldt university of berlin"
    },
    {
        " to continue pursuing his study of medicine, and also continued to explore and develop his interest in plant science. He received his degree in medicine at ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " in 42 but his dissertation title was De plantarum generatione sexuali , a botanical subject. The same year, he published a book on the fungi that caused ": null
    },
    {
        "rusts": "rust"
    },
    {
        " and ": null
    },
    {
        "smuts": "smuts"
    },
    {
        " in plants.       After the graduation, de Bary practiced medicine in Frankfurt, but only for a very short period of time. He was drawn back to botany and became ": null
    },
    {
        "Privatdozent": "privatdozent"
    },
    {
        " in botany at the ": null
    },
    {
        "University of Tübingen": "university of tübingen"
    },
    {
        ", where he worked as an assistant to ": null
    },
    {
        "Hugo von Mohl": "hugo von mohl"
    },
    {
        " for a while. In 42 he succeeded the position of the well-known botanist ": null
    },
    {
        "Karl Wilhelm von Nägeli": "carl nägeli"
    },
    {
        " at ": null
    },
    {
        "Freiburg": "university of freiburg"
    },
    {
        ", where he established the most advanced botanical laboratory at the time and directed many students.       De Bary married Antonie Einert in 42; they raised four children. In 42 de Bary moved to the ": null
    },
    {
        "University of Halle": "university of halle"
    },
    {
        " to succeed the position of Professor ": null
    },
    {
        "Diederich Franz Leonhard von Schlechtendal": "diederich franz leonhard von schlechtendal"
    },
    {
        ", who, with ": null
    },
    {
        "Hugo von Mohl": "hugo von mohl"
    },
    {
        ", co-founded the pioneer botanical journal Botanische Zeitung. De Bary became its ": null
    },
    {
        "coeditor": "coeditor"
    },
    {
        " and later sole ": null
    },
    {
        "editor": "editor"
    },
    {
        ". As an editor of and contributor to the journal, he exercised great influence upon the development of botany. After the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        " , de Bary was appointed professor of botany at the ": null
    },
    {
        "University of Strasbourg": "university of strasbourg"
    },
    {
        ", founder of the ": null
    },
    {
        "Jardin botanique de lUniversité de Strasbourg": "jardin botanique de luniversité de strasbourg"
    },
    {
        ", and also elected as the inaugural rector of the reorganized university. He conducted much research in the university botanical institute, attracted many students from ": null
    },
    {
        "Europe": "europe"
    },
    {
        " and ": null
    },
    {
        "America": "america"
    },
    {
        ", and made a large contribution to the development of botany.       De Bary was devoted to the study of the life history of ": null
    },
    {
        "fungi": "fungi"
    },
    {
        ". At that time, various fungi were still considered to arise through spontaneous generation. He proved that pathogenic fungi were not the products of ": null
    },
    {
        "cell": "cell"
    },
    {
        " contents of the affected plants and did not arise from the secretion of the sick cells.     In de Bary’s time, potato late blight had caused sweeping crop devastation and economic loss. He studied the pathogen  Phytophthora infestans   and elucidated its life cycle. The origin of plant diseases was not known at that time. Much as ": null
    },
    {
        "Miles Joseph Berkeley": "miles joseph berkeley"
    },
    {
        " had insisted in 42 that the ": null
    },
    {
        "oomycete": "oomycete"
    },
    {
        " found in ": null
    },
    {
        "potato blight": "potato blight"
    },
    {
        " was the cause of the disease, de Bary declared that the rust and smut fungi were the causes of the pathological changes in diseased plants. He concluded that ": null
    },
    {
        "Uredinales": "uredinales"
    },
    {
        " and ": null
    },
    {
        "Ustilaginales": "ustilaginales"
    },
    {
        " were ": null
    },
    {
        "parasite": "parasite"
    },
    {
        "s.     De Bary spent much time studying the morphology of fungi and noticed that certain forms that had been classified as separate species were actually successive stages of development of the same organism. De Bary studied the developmental history of ": null
    },
    {
        "Myxomycetes": "myxogastria"
    },
    {
        " , and thought it was necessary to reclassify the lower animals. He first coined the term ": null
    },
    {
        "Mycetozoa": "mycetozoa"
    },
    {
        " to include lower animals and slime molds. In his work on Myxomycetes , he pointed out that at one stage of their life cycle , they were little more than formless, motile masses of the substance that ": null
    },
    {
        "Félix Dujardin": "félix dujardin"
    },
    {
        " had called ": null
    },
    {
        "sarcode": "amoebaamoebae as organisms"
    },
    {
        " . This is the fundamental basis of the protoplasmic theory of life.     De Bary was the first to demonstrate ": null
    },
    {
        "sexuality in fungi": "fungussexual reproduction"
    },
    {
        ". In 42 he had observed conjugation in the alga  Spirogyra , and in 42 he described sexual reproduction in the fungus  Peronospora  sp. He saw the necessity of observing the whole life cycle of pathogens and attempted to follow it in the living host plants.       De Bary published his first work on fungi in 42 and then spent more than 42 years studying Peronosporeae, particularly Phytophthora infestans  and  Cystopus  , parasites of ": null
    },
    {
        "potato": "potato"
    },
    {
        ". In his published work in 42 entitled Recherches sur le developpement de quelques champignons parasites , he reported having inoculated spores of P. infestans on healthy potato leaves and observed the penetration of the leaf and the subsequent growth of the mycelium that affected the tissue, the formation of ": null
    },
    {
        "conidia": "conidia"
    },
    {
        ", and the appearance of the characteristic black spots of the potato blight. He also did similar experiments on potato stalks and ": null
    },
    {
        "tuber": "tuber"
    },
    {
        "s. He watched conidia in the soil and their infection of the tubers, observing that ": null
    },
    {
        "mycelium": "mycelium"
    },
    {
        " could survive the cold winter in the tubers. From all these studies, he concluded that organisms could not be generated spontaneously.     Puccinia graminis Puccinia graminis , the pathogen of rust of wheat, rye and other grains. He noticed that P. graminis produced reddish summer ": null
    },
    {
        "spore": "spore"
    },
    {
        "s called ": null
    },
    {
        "urediospores": "urediniospore"
    },
    {
        " , and dark winter spores called ": null
    },
    {
        "teleutospore": "teleutospore"
    },
    {
        "s . He inoculated ": null
    },
    {
        "sporidia": "sporidia"
    },
    {
        " from the winter spores of the wheat rust on the leaves of the common barberry . The sporidia germinated and led to the formation of ": null
    },
    {
        "aecia": "aecia"
    },
    {
        " with yellow spores, the familiar symptoms of infection on the ": null
    },
    {
        "barberry": "barberry"
    },
    {
        ". De Bary then inoculated ": null
    },
    {
        "aecidiospore": "aecidiospore"
    },
    {
        "s on moisture-retaining slides and then transferred them to the leaves of seedling of ": null
    },
    {
        "rye": "rye"
    },
    {
        " plants. In time, he observed the reddish summer spores appearing in the leaves. The sporidia from the winter spores germinated, but only on barberry. De Bary clearly demonstrated that P. graminis required different hosts during the different stages of its development . De Bary’s discovery explained why the eradication of the barberry plants had long been practiced as a control for rust.       De Bary also studied the formation of ": null
    },
    {
        "lichen": "lichen"
    },
    {
        "s which are the result of an association between a fungus and an alga. He traced the stages through which they grew and reproduced and the adaptations that enabled them to survive drought and winter. He coined the word ": null
    },
    {
        "symbiosis": "symbiosis"
    },
    {
        " in 42 in his monograph Die Erscheinung der Symbiose as the living together of unlike organisms . He carefully studied the morphology of ": null
    },
    {
        "mold": "mold"
    },
    {
        "s, ": null
    },
    {
        "yeast": "yeast"
    },
    {
        "s, and fungi and basically established mycology as an independent science.       De Barys concept and methods had a great impact on the growing field of ": null
    },
    {
        "bacteriology": "bacteriology"
    },
    {
        " and botany. He published more than 42 research papers and influenced many students who later became distinguished botanists and ": null
    },
    {
        "microbiologist": "microbiologist"
    },
    {
        "s such as ": null
    },
    {
        "Sergei Winogradsky": "sergei winogradsky"
    },
    {
        " , ": null
    },
    {
        "William Gilson Farlow": "william gilson farlow"
    },
    {
        " , and ": null
    },
    {
        "Pierre-Marie-Alexis Millardet": "pierre-marie-alexis millardet"
    },
    {
        " . He was one of the most influential of the 42th century bioscientists. De Bary died of a ": null
    },
    {
        "tumor": "tumor"
    },
    {
        " of the jaw, having undergone extensive surgery, on January 42 42 in Strasburg.   ": null
    }
]