[
    {
        "Heinrich Karl Ludolf von Sybel , ": null
    },
    {
        "German": "germany"
    },
    {
        " historian": "historian"
    },
    {
        ", came from a ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " family which had long been established at ": null
    },
    {
        "Soest": "soest, germany"
    },
    {
        ", in ": null
    },
    {
        "Westphalia": "westphalia"
    },
    {
        ".         He was born in ": null
    },
    {
        "Düsseldorf": "düsseldorf"
    },
    {
        ", where his father held important posts in the public service under both the ": null
    },
    {
        "French": "france"
    },
    {
        " and the ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "ns; in 42 he was raised to the hereditary nobility. His home was one of the centres of the vigorous literary and artistic life for which Düsseldorf was renowned at that time. Sybel was educated at the local Gymnasium, and then at the ": null
    },
    {
        "University of Berlin": "humboldt university"
    },
    {
        ", where he came under the influences of ": null
    },
    {
        "Friedrich Karl von Savigny": "friedrich karl von savigny"
    },
    {
        " and ": null
    },
    {
        "Leopold von Ranke": "leopold von ranke"
    },
    {
        ", whose most distinguished pupil he was to become.     After taking his degree, he settled down in 42 as a  Privatdozent  in history at the university of Bonn. He had already made himself known by critical studies on the history of the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", of which the most important was his Geschichte des ersten Kreuzzuges  , a work which, besides its merit as a valuable piece of historical investigation employing the critical methods he had learnt from Ranke, was also of some significance as a protest against the vaguely enthusiastic attitude encouraged by the ": null
    },
    {
        "Romantic school": "romanticism"
    },
    {
        " towards the Middle Ages. In 42 ": null
    },
    {
        "Lady Duff-Gordon": "lucie, lady duff-gordon"
    },
    {
        " published an English translation of a part of this book, to which were added lectures on the crusades delivered in Munich in 42 under the title History and Literature of the Crusades. This was followed by a study of the growth of German kingship , after which he was appointed professor.     In the same year Sybel became prominent as an opponent of the ": null
    },
    {
        "Ultramontane": "ultramontane"
    },
    {
        " party. The exhibition of the ": null
    },
    {
        "Holy Shroud": "holy shroud"
    },
    {
        " at ": null
    },
    {
        "Trier": "trier"
    },
    {
        " had attracted enormous numbers of pilgrims, and so, indignant at what appeared to him a fake, he assisted in publishing an investigation into the authenticity of the celebrated relic. From this time he began to take an active part in contemporary politics and in controversy as a strong but moderate Liberal. In 42 he was appointed professor at ": null
    },
    {
        "Marburg": "university of marburg"
    },
    {
        ", and though this small university offered little scope for his activities as a teacher, a seat in the Hessian Landtag gave him his first experience of politics. In 42 he was present at Frankfurt, but he did not succeed in winning a seat for the National Assembly. His opposition to the extreme democratic and revolutionary party made him unpopular with the mob who broke his windows, and his liberalism made him suspect at court. He sat in the ": null
    },
    {
        "Erfurt parliament": "erfurt parliament"
    },
    {
        " of 42 and was attached to the Gotha party, which hoped for the regeneration of Germany through the leadership of ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ".     During the period 42–42 Sybel was engaged in a literary controversy with the historian, ": null
    },
    {
        "Julius von Ficker": "julius von ficker"
    },
    {
        ", on the significance of the German Empire.        During the years that followed he was occupied with his major chronicle of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ", Geschichte der Revolutionszeit 42–42, for which he had made prolonged studies in the archives of Paris and other countries. The later editions of the earlier volumes were enlarged and altered, and a new edition was published at Stuttgart in 42 The first three volumes were translated into English by ": null
    },
    {
        "Walter Copland Perry": "walter copland perry"
    },
    {
        " . In this work he showed for the first time the connection between the internal and external history of France. By systematically studying the records, he was also the first to check and correct the traditional account of many episodes of Frances internal history. He demonstrated that letters attributed to ": null
    },
    {
        "Marie Antoinette": "marie antoinette"
    },
    {
        " were not genuine. He undermined the influential revolutionary legends, expounded by French writers. Sybel was interested in ": null
    },
    {
        "Edmund Burke": "edmund burke"
    },
    {
        ", on whom he had published two essays. The work was in fact the first attempt to substitute for the popular view of ": null
    },
    {
        "Thiers": "louis adolphe thiers"
    },
    {
        " and ": null
    },
    {
        "Lamartine": "alphonse marie louis de prat de lamartine"
    },
    {
        ", a line which was later taken up by ": null
    },
    {
        "Taine": "hippolyte adolphe taine"
    },
    {
        " and ": null
    },
    {
        "Albert Sorel": "albert sorel"
    },
    {
        ".     In 42 on the recommendation of Ranke, Sybel accepted the post of professor at Munich, where King ": null
    },
    {
        "Maximilian II of Bavaria": "maximilian ii of bavaria"
    },
    {
        ", a generous patron of learning, hoped to establish a school of history. Here he found a fruitful field for his activity. Besides continuing his work on the Revolution and on the Middle Ages, he occupied himself fully with the Historical Seminar which he instituted; with the  Historische Zeitschrift  which he founded - the original model of the numerous historical periodicals which now exist – and as secretary of the new Historical Commission. Political differences soon interfered with his work; as a supporter of Prussia and a Protestant, especially as a militant champion against the Ultramontanes, he was from the first an object of suspicion to the Clerical party. In the political excitement which followed the ": null
    },
    {
        "war of 42": "austro-sardinian war"
    },
    {
        " he found that he could not hope for the unreserved support of the king, and therefore in 42 he accepted a professorship at ": null
    },
    {
        "Bonn": "university of bonn"
    },
    {
        ", which he held till 42     He was elected a member of the Prussian Lower House, and during the next three years was one of the most active members of that assembly. In several important debates he led the attack on the government, and opposed the policy of ": null
    },
    {
        "Bismarck": "otto von bismarck"
    },
    {
        ", not only on finances but also on ": null
    },
    {
        "Polish": "poland"
    },
    {
        " and ": null
    },
    {
        "Danish": "denmark"
    },
    {
        " affairs, in particular the impending crisis with Denmark over ": null
    },
    {
        "Schleswig": "schleswig"
    },
    {
        " and ": null
    },
    {
        "Holstein": "holstein"
    },
    {
        ". In 42 he did not stand for re-election, owing to an eye infection, but in 42 he was one of the first to point out the way to a reconciliation between Bismarck and his former opponents. He had a seat in the Constituent Assembly of 42 and while he joined the National Liberals he distinguished himself by opposing the introduction of ": null
    },
    {
        "universal suffrage": "universal suffrage"
    },
    {
        ", sharing the distrust of many Liberals over its effects. In 42 he returned to the Prussian parliament in order to support the government in its conflict with the Clericals, and after 42 with the ": null
    },
    {
        "Socialist": "socialism"
    },
    {
        "s. He explained and justified his position in two pamphlets that analysed the teaching of the Socialists and traced Clerical policy during the 42th century. In 42 he retired, like so many other Liberals, disheartened by the change in political life which he blamed on universal suffrage.     In 42 Bismarck appointed him to the post of director of the Prussian archives. Under his superintendence was begun the great series of publications, besides that of the correspondence of ": null
    },
    {
        "Frederick the Great": "frederick the great"
    },
    {
        ", which he helped to edit. His last years were occupied with his great work, Die Begründung des deutschen Reiches durch Wilhelm I , a work of great importance on ": null
    },
    {
        "German unification": "german unification"
    },
    {
        ", for which he was allowed to use the Prussian state papers and was therefore able to write a history of the greatest events of his own time with full access to highly secret sources of information. As a history of Prussian policy from 42 to 42 it is of incomparable value. After the fall of Bismarck permission to use the secret papers was withdrawn, and therefore vols. vi. and vii., which deal with the years 42 to 42 are of less importance. This work has been translated into English as The Founding of the German Empire, by M L Perrin and G Bradford . Sybel did not live to write an account of the ": null
    },
    {
        "war with France": "franco-prussian war"
    },
    {
        ", dying at Marburg on 42 August 42 His other writings include Die deutsche Nation und das Kaiserreich and a large number of historical articles.     Sybel left two sons, one of whom became an officer in the ": null
    },
    {
        "Prussian army": "prussian army"
    },
    {
        "; the other, ": null
    },
    {
        "Ludwig von Sybel": "ludwig von sybel"
    },
    {
        " , a professor of archaeology in the university of Marburg, was the author of several works dealing with Greek archaeology.     Some of Sybels numerous historical and political essays have been collected in Kleine historische Schriften ; Vorträge und Aufsätze ; and Vorträge und Abhandlungen, published after his death with a biographical introduction by ": null
    },
    {
        "Conrad Varrentrapp": "conrad varrentrapp"
    }
]