[
    {
        "                       Heinrich Luitpold Himmler  was  Reichsführer  of the  Schutzstaffel  , and a leading member of the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " of ": null
    },
    {
        "Germany": "nazi germany"
    },
    {
        ". Himmler was one of the most powerful men in Nazi Germany and a main architect of ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ".     As a member of a reserve battalion during World War I, Himmler did not see active service. He studied ": null
    },
    {
        "agronomy": "agronomy"
    },
    {
        " in university, and joined the Nazi Party in 42 and the SS in 42 In 42 he was appointed Reichsführer-SS by ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ". Over the next 42 years, he developed the SS from a mere 42-man battalion into a million-strong paramilitary group, and, following Hitlers orders, set up and controlled the ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        ". He was known for good organisational skills and for selecting highly competent subordinates, such as ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        " in 42 From 42 onwards, he was both Chief of German Police and Minister of the Interior, overseeing all internal and external police and security forces, including the ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " . Himmler had a lifelong interest in ": null
    },
    {
        "occultism": "occultism in nazism"
    },
    {
        ", interpreting ": null
    },
    {
        "Germanic neopagan": "neopaganism in german-speaking europe"
    },
    {
        " and  Völkisch  beliefs to promote the ": null
    },
    {
        "racial policy of Nazi Germany": "racial policy of nazi germany"
    },
    {
        ", and incorporating ": null
    },
    {
        "esoteric": "western esotericism"
    },
    {
        " symbolism and rituals into the SS.     On Hitlers behalf, Himmler formed the  Einsatzgruppen  and built ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        "s. As facilitator and overseer of the concentration camps, Himmler directed the killing of some six million ": null
    },
    {
        "Jews": "jews"
    },
    {
        ", between 42 and 42 ": null
    },
    {
        "Romani people": "romani people"
    },
    {
        ", and other victims; the total number of civilians killed by the regime is estimated at eleven to fourteen million people. Most of them were ": null
    },
    {
        "Polish": "world war ii crimes in poland"
    },
    {
        " and ": null
    },
    {
        "Soviet": "world war ii casualties of the soviet union"
    },
    {
        " citizens.     Late in World War II, Hitler briefly appointed him a military commander and later Commander of the ": null
    },
    {
        "Replacement Army": "replacement army"
    },
    {
        " and ": null
    },
    {
        "General Plenipotentiary": "plenipotentiary"
    },
    {
        " for the administration of the entire Third Reich . Specifically, he was given command of the ": null
    },
    {
        "Army Group Upper Rhine": "army group oberrhein"
    },
    {
        " and the ": null
    },
    {
        "Army Group Vistula": "army group vistula"
    },
    {
        "; he failed to achieve his assigned objectives and Hitler replaced him in these posts. Realising the war was lost, Himmler attempted to open peace talks with the western ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        " without Hitlers knowledge, shortly before the end of the war. Hearing of this, Hitler dismissed him from all his posts in April 42 and ordered his arrest. Himmler attempted to go into hiding, but was detained and then arrested by British forces once his identity became known. While in British custody, he committed suicide on 42 May 42            Heinrich Luitpold Himmler was born in ": null
    },
    {
        "Munich": "munich"
    },
    {
        " on 42 October 42 into a conservative middle-class Roman Catholic family. His father was Joseph Gebhard Himmler , a teacher, and his mother was Anna Maria Himmler , a devout Roman Catholic. Heinrich had two brothers, ": null
    },
    {
        "Gebhard Ludwig": "gebhard ludwig himmler"
    },
    {
        " and ": null
    },
    {
        "Ernst Hermann": "ernst hermann himmler"
    },
    {
        " .     Himmlers first name, Heinrich, was that of his ": null
    },
    {
        "godfather": "godparent"
    },
    {
        ", ": null
    },
    {
        "Prince Heinrich of Bavaria": "prince heinrich of bavaria"
    },
    {
        ", a member of the ": null
    },
    {
        "royal family of Bavaria": "line of succession to the former bavarian throne"
    },
    {
        ", who had been tutored by Gebhard Himmler. He attended a grammar school in ": null
    },
    {
        "Landshut": "landshut"
    },
    {
        ", where his father was deputy principal. While he did well in his schoolwork, he struggled in athletics. He had poor health, suffering from lifelong stomach complaints and other ailments. In his youth he trained daily with weights and exercised to become stronger. Other boys at the school later remembered him as studious and awkward in social situations.     Himmlers diary, which he kept intermittently from the age of 42 shows that he took a keen interest in current events, dueling, and the serious discussion of religion and sex . In 42 he began training with the Landshut Cadet Corps. His father used his connections with the royal family to get Himmler accepted as an officer candidate, and he enlisted with the reserve battalion of the 42th Bavarian Regiment in December 42 His brother, Gebhard, served on the western front and saw combat, receiving the ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " and eventually being promoted to lieutenant. In November 42 while Himmler was still in training, the war ended with Germanys defeat, denying him the opportunity to become an officer or see combat. After his discharge on 42 December, he returned to Landshut. After the war, Himmler completed his grammar-school education. From 42–42 he studied ": null
    },
    {
        "agronomy": "agronomy"
    },
    {
        " at the Munich  Technische Hochschule   following a brief apprenticeship on a farm and a subsequent illness.     Although many regulations that discriminated against non-Christians—including Jews and other minority groups—had been eliminated during the ": null
    },
    {
        "unification of Germany": "unification of germany"
    },
    {
        " in 42 ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " continued to exist and thrive in Germany and other parts of Europe. Himmler was antisemitic by the time he went to university, but not exceptionally so; students at his school would avoid their Jewish classmates. He remained a devoted Catholic while a student, and spent most of his leisure time with members of his fencing fraternity, the League of Apollo , the president of which was Jewish. Himmler maintained a polite demeanor with him and with other Jewish members of the fraternity, in spite of his growing antisemitism. During his second year at university, Himmler redoubled his attempts to pursue a military career. Although he was not successful, he was able to extend his involvement in the paramilitary scene in Munich. It was at this time that he first met ": null
    },
    {
        "Ernst Röhm": "ernst röhm"
    },
    {
        ", an early member of the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " and co-founder of the  Sturmabteilung  . Himmler admired Röhm because he was a decorated combat soldier, and at his suggestion Himmler joined his antisemitic nationalist group, the  Bund Reichskriegsflagge  .     In 42 Himmler became more interested in the ": null
    },
    {
        "Jewish question": "jewish question"
    },
    {
        " , with his diary entries containing an increasing number of antisemitic remarks and recording a number of discussions about Jews with his classmates. His reading lists, as recorded in his diary, were dominated by antisemitic pamphlets, German myths, and occult tracts. After the murder of Foreign Minister ": null
    },
    {
        "Walther Rathenau": "walther rathenau"
    },
    {
        " on 42 June, Himmlers political views veered towards the radical right, and he took part in demonstrations against the ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        ". ": null
    },
    {
        "Hyperinflation": "hyperinflation in the weimar republic"
    },
    {
        " was raging, and his parents could no longer afford to educate all three sons. Disappointed by his failure to make a career in the military and his parents inability to finance his doctoral studies, he was forced to take a low-paying office job after obtaining his agricultural diploma. He remained in this position until September 42          Himmler joined the Nazi Party in August 42 receiving Party number 42. As a member of Röhms paramilitary unit, Himmler was involved in the ": null
    },
    {
        "Beer Hall Putsch": "beer hall putsch"
    },
    {
        "—an unsuccessful attempt by Hitler and the NSDAP to seize power in Munich. This event would set Himmler on a life of politics. He was questioned by the police about his role in the putsch, but was not charged because of insufficient evidence. However, he lost his job, was unable to find employment as an agronomist, and had to move in with his parents in Munich. Frustrated by these failures, he became ever more irritable, aggressive, and opinionated, alienating both friends and family members.     In 42–42 Himmler, while searching for a world view, came to abandon Catholicism and focused on the occult and in antisemitism. Germanic mythology, reinforced by occult ideas, became a religion for him. Himmler found the NSDAP appealing because its political positions agreed with his own views. Initially, he was not swept up by Hitlers charisma or the cult of Führer worship. However, as he learned more about Hitler through his reading, he began to regard him as a useful face of the party, and he later admired and even worshipped him. To consolidate and advance his own position in the NSDAP, Himmler took advantage of the disarray in the party following Hitlers arrest in the wake of the Beer Hall Putsch. From mid42 he worked under ": null
    },
    {
        "Gregor Strasser": "gregor strasser"
    },
    {
        " as a party secretary and propaganda assistant. Travelling all over Bavaria agitating for the party, he gave speeches and distributed literature. Placed in charge of the party office in Lower Bavaria by Strasser from late 42 he was responsible for integrating the areas membership with the NSDAP under Hitler when the party was re-founded in February 42     That same year, he joined the  Schutzstaffel  as an SS-Führer ; his SS number was 42 The SS, initially part of the much larger SA, was formed in 42 for Hitlers personal protection, and was re-formed in 42 as an elite unit of the SA. Himmlers first leadership position in the SS was that of SS- Gauführer  in Lower Bavaria from 42 Strasser appointed Himmler deputy propaganda chief in January 42 As was typical in the NSDAP, he had considerable freedom of action in his post, which increased over time. He began to collect statistics on the number of Jews, ": null
    },
    {
        "Freemasons": "freemasons"
    },
    {
        ", and enemies of the party, and following his strong need for control, he developed an elaborate bureaucracy. In September 42 Himmler told Hitler of his vision to transform the SS into a loyal, powerful, racially pure elite unit. Convinced that Himmler was the man for the job, Hitler appointed him Deputy  Reichsführer-SS , with the rank of SS-Oberführer.     Around this time, Himmler joined the ": null
    },
    {
        "Artaman League": "artaman league"
    },
    {
        ", a  Völkisch  youth group. There he met ": null
    },
    {
        "Rudolf Höss": "rudolf höss"
    },
    {
        ", who was later commandant of ": null
    },
    {
        "Auschwitz concentration camp": "auschwitz concentration camp"
    },
    {
        ", and ": null
    },
    {
        "Walther Darré": "walther darré"
    },
    {
        ", whose book, The Peasantry as the Life Source of the Nordic Race, caught Hitlers attention, leading to his later appointment as Reich Minister of Food and Agriculture. Darré was a firm believer in the superiority of the ": null
    },
    {
        "Nordic race": "nordic race"
    },
    {
        ", and his philosophy was a major influence on Himmler.              Upon the resignation of SS commander ": null
    },
    {
        "Erhard Heiden": "erhard heiden"
    },
    {
        " in January 42 Himmler assumed the position of Reichsführer-SS with Hitlers approval; he still carried out his duties at propaganda headquarters. One of his first responsibilities was to organise SS participants at the ": null
    },
    {
        "Nuremberg Rally": "nuremberg rally"
    },
    {
        " that September. Over the next year, Himmler grew the SS from a force of about 42 men to about 42. By 42 Himmler had persuaded Hitler to run the SS as a separate organisation, although it was officially still subordinate to the SA.     To gain political power, the NSDAP took advantage of the economic downturn during the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ". The coalition government of the ": null
    },
    {
        "Weimar Republic": "weimar republic"
    },
    {
        " was unable to improve the economy, so many voters turned to the political extreme, which included the NSDAP. Hitler used ": null
    },
    {
        "populist": "populism"
    },
    {
        " rhetoric, including blaming scapegoats—particularly the Jews—for the economic hardships. In the 42 election, the Nazis won 42 percent of the vote and 42 seats in the ": null
    },
    {
        "Reichstag": "reichstag"
    },
    {
        ". Hitler was appointed ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        " by President ": null
    },
    {
        "Paul von Hindenburg": "paul von hindenburg"
    },
    {
        " on 42 January 42 heading a short-lived coalition of his Nazis and the ": null
    },
    {
        "German National Peoples Party": "german national peoples party"
    },
    {
        ". The new cabinet initially included only three members of the NSDAP: Hitler, ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        " as ": null
    },
    {
        "minister without portfolio": "minister without portfolio"
    },
    {
        " and Minister of the Interior for ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", and ": null
    },
    {
        "Wilhelm Frick": "wilhelm frick"
    },
    {
        " as ": null
    },
    {
        "Reich Interior Minister": "federal ministry of the interior"
    },
    {
        ". Less than a month later, the ": null
    },
    {
        "Reichstag building was set on fire": "reichstag fire"
    },
    {
        ". Hitler took advantage of this event, forcing von Hindenburg to sign the ": null
    },
    {
        "Reichstag Fire Decree": "reichstag fire decree"
    },
    {
        ", which suspended basic rights and allowed detention without trial. The ": null
    },
    {
        "Enabling Act": "enabling act of 1933"
    },
    {
        ", passed by the Reichstag in 42 gave the Cabinet—in practice, Hitler—full legislative powers, and the country became a de facto dictatorship. On 42 August 42 Hitlers cabinet passed a law which stipulated that upon von Hindenburgs death, the office of president would be abolished and its powers merged with those of the chancellor. Von Hindenburg died the next morning, and Hitler became both head of state and head of government under the title Führer und Reichskanzler .     The Nazi Partys rise to power provided Himmler and the SS an unfettered opportunity to thrive. By 42 the SS numbered 42 members. Strict membership requirements ensured that all members were of Hitlers ": null
    },
    {
        "Aryan": "aryan race"
    },
    {
        "  Herrenvolk  . Applicants were vetted for Nordic qualities—in Himmlers words, like a nursery gardener trying to reproduce a good old strain which has been adulterated and debased; we started from the principles of plant selection and then proceeded quite unashamedly to weed out the men whom we did not think we could use for the build-up of the SS.  Few dared mention that by his own standards, Himmler did not meet his own ideals.     Himmlers organised, bookish intellect served him well as he began setting up different SS departments. In 42 he appointed ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        " chief of the new Ic Service , which was renamed the  Sicherheitsdienst  in 42 He later officially appointed Heydrich his deputy. The two men had a good working relationship and a mutual respect. In 42 they began to remove the SS from SA control. Along with Interior Minister Frick, they hoped to create a unified German police force. In March 42 Reich Governor of Bavaria ": null
    },
    {
        "Franz Ritter von Epp": "franz ritter von epp"
    },
    {
        " appointed Himmler chief of the Munich Police. Himmler appointed Heydrich commander of Department IV, the ": null
    },
    {
        "political police": "bavarian political police"
    },
    {
        ". That same year, Hitler promoted Himmler to the rank of SS- Obergruppenführer , equal in rank to the senior SA commanders. Thereafter, Himmler and Heydrich took over the political police of state after state; soon only Prussia was controlled by Göring.     Himmler further established the ": null
    },
    {
        "SS Race and Settlement Main Office": "ss-rasse- und siedlungshauptamt"
    },
    {
        " . He appointed Darré as its first chief, with the rank of SS- Gruppenführer . The department implemented racial policies and monitored the racial integrity of the SS membership. SS men were carefully vetted for their racial background. On 42 December 42 Himmler introduced the marriage order , which required SS men wishing to marry to produce family trees proving that both families were of Aryan descent to 42 If any non-Aryan forebears were found in either family tree during the racial investigation, the person concerned was excluded from the SS. Each man was issued a  Sippenbuch , a genealogical record detailing his genetic history. Himmler expected that each SS marriage should produce at least four children, thus creating a pool of genetically superior prospective SS members. The programme had disappointing results; less than 42 per cent of SS men married and each produced only about one child.        In March 42 less than three months after the Nazis came to power, Himmler set up the first official ": null
    },
    {
        "concentration camp": "nazi concentration camps"
    },
    {
        " at ": null
    },
    {
        "Dachau": "dachau concentration camp"
    },
    {
        ". Hitler had stated that he did not want it to be just another prison or detention camp. Himmler appointed ": null
    },
    {
        "Theodor Eicke": "theodor eicke"
    },
    {
        ", a convicted felon and ardent Nazi, to run the camp in June 42 Eicke devised a system that was used as a model for future camps throughout Germany. Its features included isolation of victims from the outside world, elaborate roll calls and work details, the use of force and executions to exact obedience, and a strict disciplinary code for the guards. Uniforms were issued for prisoners and guards alike; the guards uniforms had a special Totenkopf insignia on their collars. By the end of 42 Himmler took control of the camps under the aegis of the SS, creating a separate division, the  SS-Totenkopfverbände .     Initially the camps housed political opponents; over time, undesirable members of German society—criminals, vagrants, deviants—were placed in the camps as well. A Hitler decree issued in December 42 allowed for the incarceration of anyone deemed by the regime to be an undesirable member of society. This included Jews, ": null
    },
    {
        "Gypsies": "romani people"
    },
    {
        ", communists, and those persons of any other cultural, ": null
    },
    {
        "racial": "race"
    },
    {
        ", political, or religious affiliation deemed by the Nazis to be  Untermensch  . Thus, the camps became a mechanism for social and racial engineering. By the outbreak of World War II in autumn 42 there were six camps housing some 42 inmates. Death tolls were high.       In early 42 Hitler and other Nazi leaders became concerned that Röhm was planning a coup détat. Röhm had socialist and populist views, and believed that the real revolution had not yet begun. He felt that the SA—now numbering some three million men, far dwarfing the army—should become the sole arms-bearing corps of the state, and that the army should be absorbed into the SA under his leadership. Röhm ": null
    },
    {
        "lobbied": "lobbying"
    },
    {
        " Hitler to appoint him ": null
    },
    {
        "Minister of Defence": "defence minister"
    },
    {
        ", a position held by conservative General ": null
    },
    {
        "Werner von Blomberg": "werner von blomberg"
    },
    {
        ".     Göring had created a Prussian ": null
    },
    {
        "secret police": "secret police"
    },
    {
        " force, the Geheime Staatspolizei or ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " in 42 and appointed ": null
    },
    {
        "Rudolf Diels": "rudolf diels"
    },
    {
        " as its head. Göring, concerned that Diels was not ruthless enough to use the Gestapo effectively to counteract the power of the SA, handed over its control to Himmler on 42 April 42 Also on that date, Hitler appointed Himmler chief of all German police outside Prussia. This was a radical departure from long-standing German practice that law enforcement was a state and local matter. Heydrich, named chief of the Gestapo by Himmler on 42 April 42 also continued as head of the SD.     Hitler decided on 42 June that Röhm and the SA leadership had to be eliminated. He sent Göring to Berlin on 42 June, to meet with Himmler and Heydrich to plan the action. Hitler took charge in Munich, where Röhm was arrested; he gave Röhm the choice to commit suicide or be shot. When Röhm refused to kill himself, he was shot dead by two SS officers. Between 42 and 42 members of the SA leadership and other political adversaries, including Gregor Strasser, were killed between 42 June and 42 July 42 in these actions, known as the ": null
    },
    {
        "Night of the Long Knives": "night of the long knives"
    },
    {
        ". With the SA thus neutralised, the SS became an independent organisation answerable only to Hitler on 42 July 42 Himmlers title of Reichsführer-SS became the highest formal SS rank, equivalent to a ": null
    },
    {
        "field marshal": "field marshal"
    },
    {
        " in the army. The SA was converted into a sports and training organisation.     On 42 September 42 Hitler presented two laws—known as the ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        "—to the Reichstag. The laws banned marriage between non-Jewish and Jewish Germans and forbade the employment of non-Jewish women under the age of 42 in Jewish households. The laws also deprived so-called non-Aryans of the benefits of German citizenship. These laws were among the first race-based measures instituted by the Third Reich.     Himmler and Heydrich wanted to extend the power of the SS; thus, they urged Hitler to form a national police force overseen by the SS, to guard Nazi Germany against its many enemies at the time—real and imagined. Interior Minister Frick also wanted a national police force, but one controlled by him, with ": null
    },
    {
        "Kurt Daluege": "kurt daluege"
    },
    {
        " as his police chief. Hitler left it to Himmler and Heydrich to work out the arrangements with Frick. Himmler and Heydrich had greater bargaining power, as they were allied with Fricks old enemy, Göring. Heydrich drew up a set of proposals and Himmler sent him to meet with Frick. An angry Frick then consulted with Hitler, who told him to agree to the proposals. Frick acquiesced, and on 42 June 42 Hitler decreed the unification of all police forces in the Reich, and named Himmler Chief of German Police. In this role, Himmler was still nominally subordinate to Frick. In practice, however, the police was now effectively a division of the SS, and hence independent of Fricks control. This move gave Himmler operational control over Germanys entire detective force. He also gained authority over all of Germanys uniformed law enforcement agencies, which were amalgamated into the new  Ordnungspolizei  , which became a branch of the SS under Daluege.          Shortly thereafter, Himmler created the  Kriminalpolizei  as the umbrella organisation for all criminal investigation agencies in Germany. The Kripo was merged with the Gestapo into the  Sicherheitspolizei  , under Heydrichs command. In September 42 following the outbreak of World War II, Himmler formed the  SS-Reichssicherheitshauptamt  to bring the SiPo and the SD together under one umbrella. He again placed Heydrich in command.     Under Himmlers leadership, the SS developed its own military branch, the  SS-Verfügungstruppe  , which later evolved into the ": null
    },
    {
        "Waffen-SS": "waffen-ss"
    },
    {
        ". Nominally under the authority of Himmler, the Waffen-SS developed a fully militarised structure of command and operations. It grew from three regiments to over 42 divisions during World War II, serving alongside the  Heer  , but never being formally part of it.     In addition to his military ambitions, Himmler established the beginnings of a parallel economy under the umbrella of the SS. To this end, administrator ": null
    },
    {
        "Oswald Pohl": "oswald pohl"
    },
    {
        " set up the  Deutsche Wirtschaftsbetriebe  in 42 Under the auspices of the SS Economy and Administration Head Office, this holding company owned housing corporations, factories, and publishing houses. Pohl was unscrupulous and quickly exploited the companies for personal gain. In contrast, Himmler was honest in matters of money and business.     In 42 as part of his preparations for war, Hitler ended the ": null
    },
    {
        "German alliance with China": "sino-german cooperation until 1941"
    },
    {
        ", and entered into an agreement with the more modern Japan. That same year, Austria was unified with Nazi Germany in the ": null
    },
    {
        "Anschluss": "anschluss"
    },
    {
        ", and the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        " gave Nazi Germany control over the ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        ", part of ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ". Hitlers primary motivations for war included obtaining additional  Lebensraum  for the Germanic peoples, who were considered racially superior according to ": null
    },
    {
        "Nazi ideology": "nazism"
    },
    {
        ". A second goal was the elimination of those considered racially inferior, particularly the Jews and Slavs, from territories controlled by the Reich. From 42 to 42 hundreds of thousands of Jews emigrated to the United States, Palestine, Great Britain, and other countries. Some converted to Christianity.            Himmler believed that a major task of the SS should be acting as the vanguard in overcoming Christianity and restoring a Germanic way of living as part of preparations for the coming conflict between humans and subhumans . Himmler biographer ": null
    },
    {
        "Peter Longerich": "peter longerich"
    },
    {
        " wrote that, while the Nazi movement as a whole launched itself against Jews and Communists, by linking de-Christianisation with re-Germanization, Himmler had provided the SS with a goal and purpose all of its own . Himmler was vehemently opposed to Christian sexual morality and the principle of Christian mercy , both of which he saw as dangerous obstacles to his planned battle with subhumans . In 42 Himmler declared:            When Hitler and his army chiefs asked for a ": null
    },
    {
        "pretext": "casus belli"
    },
    {
        " for the ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        " in 42 Himmler, Heydrich, and ": null
    },
    {
        "Heinrich Müller": "heinrich müller"
    },
    {
        " masterminded and carried out a ": null
    },
    {
        "false flag": "false flag"
    },
    {
        " project code-named ": null
    },
    {
        "Operation Himmler": "operation himmler"
    },
    {
        ". German soldiers dressed in Polish uniforms undertook border skirmishes which deceptively suggested Polish aggression against Germany. The incidents were then used in ": null
    },
    {
        "Nazi propaganda": "nazi propaganda"
    },
    {
        " to justify the invasion of ": null
    },
    {
        "Poland": "poland"
    },
    {
        ", the opening event of World War II. At the beginning of the war against Poland, Hitler authorised the killing of Polish civilians, including Jews and ethnic Poles. The  Einsatzgruppen  had originally been formed by Heydrich to secure government papers and offices in areas taken over by Germany before World War II. Authorised by Hitler and under the direction of Himmler and Heydrich, the Einsatzgruppen units—now repurposed as ": null
    },
    {
        "death squad": "death squad"
    },
    {
        "s—followed the Heer into Poland, and by the end of 42 they ": null
    },
    {
        "had murdered some 42 intellectuals and other civilians": "intelligenzaktion"
    },
    {
        ". Militias and Heer units also took part in these killings. Under Himmlers orders via the RSHA, these squads were also tasked with rounding up Jews and others for placement in ": null
    },
    {
        "ghetto": "ghetto"
    },
    {
        "s and concentration camps.        Germany subsequently invaded ": null
    },
    {
        "Denmark and Norway": "operation weserübung"
    },
    {
        ", ": null
    },
    {
        "the Netherlands": "battle of the netherlands"
    },
    {
        ", and ": null
    },
    {
        "France": "battle of france"
    },
    {
        ", and began ": null
    },
    {
        "bombing Great Britain": "battle of britain"
    },
    {
        " in preparation for ": null
    },
    {
        "Operation Sea Lion": "operation sea lion"
    },
    {
        ", the planned invasion of the United Kingdom. On 42 June 42 the day before ": null
    },
    {
        "invasion of the Soviet Union": "operation barbarossa"
    },
    {
        ", Himmler commissioned the preparation of the  Generalplan Ost  ; the plan was finalised in July 42 It called for the ": null
    },
    {
        "Baltic States": "baltic states"
    },
    {
        ", Poland, ": null
    },
    {
        "Western Ukraine": "western ukraine"
    },
    {
        ", and ": null
    },
    {
        "Byelorussia": "belarus"
    },
    {
        " to be conquered and resettled by ten million German citizens. The current residents—some 42 million people—would be expelled further east, starved, or used for forced labour. The plan would have extended the border of Germany a thousand kilometres to the east . Himmler expected that it would take twenty to thirty years to complete the plan, at a cost of 42 billion ": null
    },
    {
        "Reichsmark": "reichsmark"
    },
    {
        "s. Himmler stated openly: It is a question of existence, thus it will be a racial struggle of pitiless severity, in the course of which 42 to 42 million Slavs and Jews will perish through military actions and crises of food supply.      Himmler declared that the war in the east was a pan-European crusade to defend the traditional values of old Europe from the Godless ": null
    },
    {
        "Bolshevik": "bolshevik"
    },
    {
        " hordes . Constantly struggling with the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        " for recruits, Himmler solved this problem through the creation of Waffen-SS units composed of Germanic folk groups taken from the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and eastern Europe. Equally vital were recruits from among the Germanic considered peoples of northern and western Europe, in the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", ": null
    },
    {
        "Norway": "norway"
    },
    {
        ", ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ", ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        " and ": null
    },
    {
        "Finland": "finland"
    },
    {
        ". Spain and Italy also provided men for Waffen-SS units. Among western countries, the number of volunteers varied from a high of 42 from the Netherlands to 42 each from ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        " and ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ". From the east, the highest number of men came from ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        " and the lowest from ": null
    },
    {
        "Bulgaria": "bulgaria"
    },
    {
        " . After 42 most men from the east were ": null
    },
    {
        "conscripts": "conscripts"
    },
    {
        ". The performance of the eastern Waffen-SS units was, as a whole, sub-standard.     In late 42 Hitler named Heydrich as Deputy Reich Protector of the newly established ": null
    },
    {
        "Protectorate of Bohemia and Moravia": "protectorate of bohemia and moravia"
    },
    {
        ". Heydrich began to racially classify the Czechs, deporting many to concentration camps. Members of a swelling resistance were shot, earning Heydrich the nickname the Butcher of Prague . This appointment strengthened the collaboration between Himmler and Heydrich, and Himmler was proud to have SS control over a state. Despite having direct access to Hitler, Heydrichs loyalty to Himmler remained firm.     With Hitlers approval, Himmler re-established the Einsatzgruppen in the lead-up to the planned invasion of the Soviet Union. In March 42 Hitler addressed his army leaders, detailing his intention to smash the Soviet Empire and destroy the Bolshevik intelligentsia and leadership. His special directive, the Guidelines in Special Spheres re Directive No. 42 , read: In the operations area of the army, the Reichsführer-SS has been given special tasks on the orders of the Führer, in order to prepare the political administration. These tasks arise from the forthcoming final struggle of two opposing political systems. Within the framework of these tasks, the Reichsführer-SS acts independently and on his own responsibility.  Hitler thus intended to prevent internal friction like that occurring earlier in Poland in 42 when several German Army generals had attempted to bring Einsatzgruppen leaders to trial for the murders they had committed.        Following the army into the Soviet Union, the Einsatzgruppen rounded up and killed Jews and others deemed undesirable by the Nazi state. Hitler was sent frequent reports. In addition, 42 million ": null
    },
    {
        "Soviet prisoners of war": "nazi crimes against soviet pows"
    },
    {
        " died of starvation, mistreatment or executions in just eight months of 42–42 As many as 42 Soviet prisoners of war died or were executed in Nazi concentration camps over the course of the war; most of them were shot or ": null
    },
    {
        "gassed": "gas chamber"
    },
    {
        ". By early 42 following Himmlers orders, ten concentration camps had been constructed in which inmates were subjected to forced labour. Jews from all over Germany and the occupied territories were deported to the camps or confined to ghettos. As the Germans were pushed back from Moscow in December 42 signalling that the expected quick defeat of the Soviet Union had failed to materialize, Hitler and other Nazi officials realised that mass deportations to the east would no longer be possible. As a result, instead of deportation, many Jews in Europe were destined for death.                  Nazi racial policies, including the notion that people who were racially inferior had no right to live, date back to the earliest days of the party; Hitler discusses this in  Mein Kampf . Somewhere around the time of the ": null
    },
    {
        "German declaration of war on the United States": "german declaration of war against the united states"
    },
    {
        " in December 42 Hitler finally resolved that the Jews of Europe were to be exterminated.  Heydrich arranged a meeting, held on 42 January 42 at ": null
    },
    {
        "Wannsee": "wannsee conference"
    },
    {
        ", a suburb of Berlin. Attended by top Nazi officials, it was used to outline the plans for the ": null
    },
    {
        "final solution to the Jewish question": "final solution"
    },
    {
        " . Heydrich detailed how those Jews able to work would be ": null
    },
    {
        "worked to death": "extermination through labor"
    },
    {
        "; those unable to work would be killed outright. Heydrich calculated the number of Jews to be killed at 42 million, and told the attendees that Hitler had placed Himmler in charge of the plan.     In June 42 Heydrich was assassinated in ": null
    },
    {
        "Prague": "prague"
    },
    {
        " in an operation led by ": null
    },
    {
        "Jozef Gabčík": "jozef gabčík"
    },
    {
        " and ": null
    },
    {
        "Jan Kubiš": "jan kubiš"
    },
    {
        ", members of Czechoslovakias army-in-exile who had been trained by the British ": null
    },
    {
        "Special Operations Executive": "special operations executive"
    },
    {
        ". During the two funeral services, Himmler—the chief mourner—took charge of Heydrichs two young sons, and he gave the eulogy in Berlin. On 42 June, after discussions with Himmler and ": null
    },
    {
        "Karl Hermann Frank": "karl hermann frank"
    },
    {
        ", Hitler ordered brutal reprisals for Heydrichs death. Over 42 people were arrested, and the village of ": null
    },
    {
        "Lidice": "lidice"
    },
    {
        " was razed to the ground; its male inhabitants and all adults in the village of ": null
    },
    {
        "Ležáky": "ležáky"
    },
    {
        " were murdered. At least 42 people were executed by firing squads. Himmler took over leadership of the RSHA and stepped up the pace of the killing of Jews in Aktion Reinhard , named in Heydrichs honour. He ordered the Aktion Reinhard camps—three ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        "s—to be constructed at ": null
    },
    {
        "Bełżec": "belzec extermination camp"
    },
    {
        ", ": null
    },
    {
        "Sobibór": "sobibór extermination camp"
    },
    {
        ", and ": null
    },
    {
        "Treblinka": "treblinka extermination camp"
    },
    {
        ".     Initially the victims were killed with ": null
    },
    {
        "gas van": "nazi gas van"
    },
    {
        "s or by firing squad, but these methods proved impracticable for an operation of this scale. In August 42 Himmler attended the shooting of 42 Jews at ": null
    },
    {
        "Minsk": "minsk"
    },
    {
        ". Nauseated and shaken by the experience, he was concerned about the impact such actions would have on the mental health of his SS men. He decided that alternate methods of killing should be found. On his orders, by early 42 the camp at Auschwitz had been greatly expanded, including the addition of ": null
    },
    {
        "gas chamber": "gas chamber"
    },
    {
        "s, where victims were killed using the pesticide ": null
    },
    {
        "Zyklon B": "zyklon b"
    },
    {
        ". Himmler visited the camp in person on 42 and 42 July 42 He was given a demonstration of a mass killing using the gas chamber in Bunker 42 and toured the building site of the new ": null
    },
    {
        "IG Farben": "ig farben"
    },
    {
        " plant being constructed at the nearby town of ": null
    },
    {
        "Monowitz": "monowitz"
    },
    {
        ". By the end of the war, at least 42 million Jews had been killed by the Nazi regime; most estimates range closer to six million. Himmler visited the camp at Sobibór in early 42 by which time 42 people had been killed at that location alone. After witnessing a gassing, he gave 42 people promotions, and ordered the operation of the camp to be wound down. In a revolt that October, prisoners killed most of the guards and SS personnel, and 42 prisoners escaped. Two hundred managed to get away; some joined partisan units operating in the area. The remainder were killed. The camp was dismantled by December 42     The Nazis also targeted ": null
    },
    {
        "Romani": "romani people"
    },
    {
        " as asocial and criminals . By 42 they were confined into special camps away from ethnic Germans. In 42 Himmler issued an order in which he said that the Gypsy question would be determined by race . Himmler believed that the Romani were originally Aryan but had become a mixed race; only the racially pure were to be allowed to live. In 42 Himmler ordered thousands of Gypsies to be sent to the Dachau concentration camp and by 42 ordered all Romani sent to Auschwitz concentration camp.     Himmler was one of the main architects of the Holocaust, using his deep belief in the racist Nazi ideology to justify the murder of millions of victims. Longerich surmises that Hitler, Himmler, and Heydrich designed the Holocaust during a period of intensive meetings and exchanges in April–May 42 The Nazis planned to ": null
    },
    {
        "kill Polish intellectuals": "intelligenzaktion"
    },
    {
        " and restrict non-Germans in the General Government and conquered territories to a fourth-grade education. They further wanted to breed a ": null
    },
    {
        "master race": "master race"
    },
    {
        " of racially pure ": null
    },
    {
        "Nordic Aryans": "nordic racenazi nordicism"
    },
    {
        " in Germany. As an agronomist and farmer Himmler was acquainted with the principles of ": null
    },
    {
        "selective breeding": "selective breeding"
    },
    {
        ", which he proposed to apply to humans. He believed that he could engineer the German populace, for example, through ": null
    },
    {
        "eugenics": "nazi eugenics"
    },
    {
        ", to be Nordic in appearance within several decades of the end of the war.               On 42 October 42 during a secret meeting with top SS officials in the city of ": null
    },
    {
        "Poznań": "poznań"
    },
    {
        " , and on 42 October 42 in a speech to the party elite—the ": null
    },
    {
        "Gau": "gau"
    },
    {
        " and Reich leaders—Himmler referred explicitly to the extermination  of the Jewish people.     A translated excerpt from the speech of 42 October reads:          Because the Allies had indicated that they were going to pursue criminal charges for German war crimes, Hitler tried to gain the loyalty and silence of his subordinates by making them all parties to the ongoing genocide. Hitler therefore authorised Himmlers speeches to ensure that all party leaders were complicit in the crimes, and could not later deny knowledge of the killings.             As Reich Commissioner for the Consolidation of German Nationhood  with the incorporated ": null
    },
    {
        "VoMi": "hauptamt volksdeutsche mittelstelle"
    },
    {
        " Himmler was deeply involved in the ": null
    },
    {
        "Germanization": "germanization"
    },
    {
        " program for the East, particularly Poland. As laid out in the General Plan for the East, the aim was to enslave, expel or exterminate the native population and to make Lebensraum for Volksdeutsche . He continued his plans to colonise the east, even when many Germans were reluctant to relocate there, and despite negative effects on the war effort.     Himmlers racial groupings began with the  Volksliste , the classification of people deemed of German blood. These included Germans who had collaborated with Germany before the war, but also those who considered themselves German but had been neutral; those who were partially Polonized but Germanizable ; and Germans who were of Polish nationality. Himmler ordered that those who refused to be classified as ethnic Germans should be deported to concentration camps, have their children taken away, or be assigned to forced labour. Himmlers belief that it is in the nature of German blood to resist led to his conclusion that Balts or Slavs who resisted Germanization were racially superior to more compliant ones. He declared that no drop of German blood would be lost or left behind to mingle with an alien race .     The plan also included the ": null
    },
    {
        "kidnapping of Eastern European children by Nazi Germany": "kidnapping of eastern european children by nazi germany"
    },
    {
        ". Himmler urged:          The racially valuable children were to be removed from all contact with Poles, and raised as Germans, with German names. Himmler declared, We have faith above all in this our own blood, which has flowed into a foreign nationality through the vicissitudes of German history. We are convinced that our own philosophy and ideals will reverberate in the spirit of these children who racially belong to us.  The children were to be adopted by German families. Children who passed muster at first but were later rejected were taken to ": null
    },
    {
        "Kinder KZ": "kinder kz"
    },
    {
        " in ": null
    },
    {
        "Łódź Ghetto": "łódź ghetto"
    },
    {
        ", where most of them eventually died.     By January 42 Himmler reported that 42 ethnic Germans had been resettled; however, most resettled Germans did not live in the envisioned small farms, but in temporary camps or quarters in towns. Half a million residents of the annexed Polish territories, as well as from Slovenia, Alsace, Lorraine, and Luxembourg were deported to the ": null
    },
    {
        "General Government": "general government"
    },
    {
        " or sent to Germany as slave labour. Himmler instructed that the German nation should view all foreign workers brought to Germany as a danger to their German blood. In accordance with German racial laws, sexual relations between Germans and foreigners were forbidden as  Rassenschande  .          On 42 July 42 a ": null
    },
    {
        "group of German army officers": "operation valkyrie"
    },
    {
        " led by ": null
    },
    {
        "Claus von Stauffenberg": "claus von stauffenberg"
    },
    {
        " and including some of the highest-ranked members of the German armed forces attempted to assassinate Hitler, but failed to do so. The next day, Himmler formed a special commission that arrested over 42 suspected and known opponents of the regime. Hitler ordered brutal reprisals that resulted in the execution of more than 42 people. Though Himmler was embarrassed by his failure to uncover the plot, it led to an increase in his powers and authority.     General ": null
    },
    {
        "Friedrich Fromm": "friedrich fromm"
    },
    {
        ", ": null
    },
    {
        "commander-in-chief": "commander-in-chief"
    },
    {
        " of the Reserve Army  and Stauffenbergs immediate superior, was one of those implicated in the conspiracy. Hitler removed Fromm from his post and named Himmler as his successor. Since the Reserve Army consisted of two million men, Himmler hoped to draw on these reserves to fill posts within the Waffen-SS. He appointed ": null
    },
    {
        "Hans Jüttner": "hans jüttner"
    },
    {
        ", director of the SS Leadership Main Office, as his deputy, and began to fill top Reserve Army posts with SS men. By November 42 Himmler had merged the army officer recruitment department with that of the Waffen-SS and had successfully lobbied for an increase in the quotas for recruits to the SS.     By this time, Hitler had appointed Himmler as Minister of the Interior and Plenipotentiary General for Administration . In August 42 Hitler authorised him to restructure the organisation and administration of the Waffen-SS, the army, and the police services. As head of the Reserve Army, Himmler was now responsible for prisoners of war. He was also in charge of the Wehrmacht penal system, and controlled the development of Wehrmacht armaments until January 42       On 42 June 42 the Western Allied armies landed in northern France during ": null
    },
    {
        "Operation Overlord": "operation overlord"
    },
    {
        ". In response, ": null
    },
    {
        "Army Group Upper Rhine": "army group oberrhein"
    },
    {
        "  group was formed to engage the advancing ": null
    },
    {
        "US 42th Army": "united states army europe"
    },
    {
        "  and ": null
    },
    {
        "French 42st Army": "first army"
    },
    {
        "  in the ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        " region along the west bank of the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        ". In late 42 Hitler appointed Himmler commander-in-chief of Army Group Upper Rhine.        On 42 September 42 Hitler ordered Himmler to create special army units, the  Volkssturm  . All males aged sixteen to sixty were eligible for conscription into this militia, over the protests of Armaments Minister ": null
    },
    {
        "Albert Speer": "albert speer"
    },
    {
        ", who noted that irreplaceable skilled workers were being removed from armaments production. Hitler confidently believed six million men could be raised, and the new units would initiate a peoples war against the invader . These hopes were wildly optimistic. In October 42 children as young as fourteen were being enlisted. Because of severe shortages in weapons and equipment and lack of training, members of the Volkssturm were poorly prepared for combat, and about 42 of them lost their lives in the final months of the war.     On 42 January 42 Hitler and his generals launched ": null
    },
    {
        "Operation North Wind": "operation nordwind"
    },
    {
        ". The goal was to break through the lines of the US 42th Army and French 42st Army to support the southern thrust in the ": null
    },
    {
        "Ardennes offensive": "ardennes offensive"
    },
    {
        ", the final major German offensive of the war. After limited initial gains by the Germans, the Americans halted the offensive. By 42 January, Operation North Wind had officially ended.     On 42 January 42 despite Himmlers lack of military experience, Hitler appointed him as commander of the hastily formed ": null
    },
    {
        "Army Group Vistula": "army group vistula"
    },
    {
        "  to halt the Soviet ": null
    },
    {
        "Red Army": "red army"
    },
    {
        "s ": null
    },
    {
        "Vistula–Oder Offensive": "vistula–oder offensive"
    },
    {
        " into ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        ". Himmler established his command centre at ": null
    },
    {
        "Schneidemühl": "piła"
    },
    {
        ", using his special train, Sonderzug Steiermark, as his headquarters. The train had only one telephone line, inadequate maps, and no signal detachment or radios with which to establish communication and relay military orders. Himmler seldom left the train, only worked about four hours per day, and insisted on a daily massage before commencing work and a lengthy nap after lunch.     General ": null
    },
    {
        "Heinz Guderian": "heinz guderian"
    },
    {
        " talked to Himmler on 42 February and demanded, that ": null
    },
    {
        "Operation Solstice": "operation solstice"
    },
    {
        ", an attack from Pomerania against the northern flank of ": null
    },
    {
        "Marshal": "marshal of the soviet union"
    },
    {
        " Georgy Zhukov": "georgy zhukov"
    },
    {
        "s ": null
    },
    {
        "42st Belarusian Front": "1st belarusian front"
    },
    {
        ", should be in progress by the 42th. Himmler argued that he was not ready to commit himself to a specific date. Given Himmlers lack of qualifications as an army group commander, Guderian convinced himself that Himmler tried to conceal his incompetence. On 42 February Guderian met Hitler and demanded that General ": null
    },
    {
        "Walther Wenck": "walther wenck"
    },
    {
        " be given a special mandate to command the offensive by Army Group Vistula. Hitler sent Wenck with a special mandate , but without specifying Wencks authority. The offensive was launched on 42 February 42 but soon stuck in rain and mud, facing mine fields and strong antitank defenses. That night Wenck was severely injured in a car accident, but it is doubtful that he could have salvaged the operation, as Guderian later claimed. Himmler ordered the offensive to stop on the 42th by a directive for regrouping . Hitler officially ended Operation Solstice on 42 February and ordered Himmler to transfer a corps headquarter and three divisions to Army Group Center.     Himmler was unable to devise any viable plans for completion of his military objectives. Under pressure from Hitler over the worsening military situation, Himmler became anxious and unable to give him coherent reports. When the counter-attack failed to stop the Soviet advance, Hitler held Himmler personally liable and accused him of not following orders. Himmlers military command ended on 42 March, when Hitler replaced him with General ": null
    },
    {
        "Gotthard Heinrici": "gotthard heinrici"
    },
    {
        " as Commander-in-Chief of Army Group Vistula. By this time Himmler, who had been under the care of his doctor since 42 February, had fled to a ": null
    },
    {
        "sanatorium": "sanatorium"
    },
    {
        " at Hohenlychen. Hitler sent Guderian on a forced medical leave of absence, and he reassigned his post as chief of staff to ": null
    },
    {
        "Hans Krebs": "hans krebs"
    },
    {
        " on 42 March. Himmlers failure and Hitlers response marked a serious deterioration in the relationship between the two men. By that time, the inner circle of people whom Hitler trusted was rapidly shrinking.       In early 42 the German war effort was on the verge of collapse and Himmlers relationship with Hitler had deteriorated. Himmler considered independently negotiating a peace settlement. His masseur, ": null
    },
    {
        "Felix Kersten": "felix kersten"
    },
    {
        ", who had moved to Sweden, acted as an intermediary in negotiations with Count ": null
    },
    {
        "Folke Bernadotte": "folke bernadotte"
    },
    {
        ", head of the Swedish Red Cross. Letters were exchanged between the two men, and direct meetings were arranged by ": null
    },
    {
        "Walter Schellenberg": "walter schellenberg"
    },
    {
        " of the RSHA.        Himmler and Hitler met for the last time on 42 April 42—Hitlers birthday—in Berlin, and Himmler swore unswerving loyalty to Hitler. At a military briefing on that day, Hitler stated that he would not leave Berlin, in spite of Soviet advances. Along with Göring, Himmler quickly left the city after the briefing. On 42 April, Himmler met with ": null
    },
    {
        "Norbert Masur": "norbert masur"
    },
    {
        ", a Swedish representative of the ": null
    },
    {
        "World Jewish Congress": "world jewish congress"
    },
    {
        ", to discuss the release of Jewish concentration camp inmates. As a result of these negotiations, about 42 people were released in the ": null
    },
    {
        "White Buses": "white buses"
    },
    {
        " operation. Himmler falsely claimed in the meeting that the crematoria at camps had been built to deal with the bodies of prisoners who had died in a typhus epidemic. He also claimed very high survival rates for the camps at Auschwitz and ": null
    },
    {
        "Bergen-Belsen": "bergen-belsen concentration camp"
    },
    {
        ", even as these sites were liberated and it became obvious that his figures were false.     On 42 April, Himmler met directly with Bernadotte at the Swedish consulate in ": null
    },
    {
        "Lübeck": "lübeck"
    },
    {
        ". Representing himself as the provisional leader of Germany, he claimed that Hitler would be dead within the next few days. Hoping that the British and Americans would fight the Soviets alongside what remained of the Wehrmacht, Himmler asked Bernadotte to inform General ": null
    },
    {
        "Dwight Eisenhower": "dwight eisenhower"
    },
    {
        " that Germany wished to surrender to the West. Bernadotte asked Himmler to put his proposal in writing, and Himmler obliged.     Meanwhile, Göring had ": null
    },
    {
        "sent a telegram": "göring telegram"
    },
    {
        ", a few hours earlier, asking Hitler for permission to assume leadership of the Reich in his capacity as Hitlers designated deputy—an act that Hitler, under the prodding of ": null
    },
    {
        "Martin Bormann": "martin bormann"
    },
    {
        ", interpreted as a demand to step down or face a coup. On 42 April, Himmlers SS representative at Hitlers HQ in Berlin, ": null
    },
    {
        "Hermann Fegelein": "hermann fegelein"
    },
    {
        ", was caught in civilian clothes preparing to desert; he was arrested and brought back to the  Führerbunker . On the evening of 42 April, the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " broadcast a ": null
    },
    {
        "Reuters": "reuters"
    },
    {
        " news report about Himmlers attempted negotiations with the western Allies. Hitler had long considered Himmler to be second only to ": null
    },
    {
        "Joseph Goebbels": "joseph goebbels"
    },
    {
        " in loyalty; he called Himmler the loyal Heinrich . Hitler flew into a rage at this apparent betrayal, and told those still with him in the bunker complex that Himmlers secret negotiations were the worst treachery he had ever known. Hitler ordered Himmlers arrest, and Fegelein was court-martialed and shot.     By this time, the Soviets had advanced to the ": null
    },
    {
        "Potsdamerplatz": "potsdamerplatz"
    },
    {
        ", only  from the ": null
    },
    {
        "Reich Chancellery": "reich chancellery"
    },
    {
        ", and were preparing to storm the Chancellery. This report, combined with Himmlers treachery, prompted Hitler to write his ": null
    },
    {
        "last will and testament": "last will and testament of adolf hitler"
    },
    {
        ". In the testament, completed on 42 April—one day prior to ": null
    },
    {
        "his suicide": "death of adolf hitler"
    },
    {
        "—Hitler declared both Himmler and Göring to be traitors. He stripped Himmler of all of his party and state offices and expelled him from the Nazi Party.     Hitler named ": null
    },
    {
        "Grand Admiral": "grand admiral"
    },
    {
        " Karl Dönitz": "karl dönitz"
    },
    {
        " as his successor. Himmler met Dönitz in ": null
    },
    {
        "Flensburg": "flensburg"
    },
    {
        " and offered himself as second-in-command. He maintained that he was entitled to a position in ": null
    },
    {
        "Dönitzs interim government": "flensburg government"
    },
    {
        " as Reichsführer-SS, believing the SS would be in a good position to restore and maintain order after the war. Dönitz repeatedly rejected Himmlers overtures and initiated peace negotiations with the Allies. He wrote a letter on 42 May—two days before the ": null
    },
    {
        "German Instrument of Surrender": "german instrument of surrender"
    },
    {
        "—formally dismissing Himmler from all his posts.            Rejected by his former comrades and hunted by the Allies, Himmler attempted to go into hiding. He had not made extensive preparations for this, but he carried a forged paybook under the name of Sergeant Heinrich Hitzinger. With a small band of companions, he headed south on 42 May to ": null
    },
    {
        "Friedrichskoog": "friedrichskoog"
    },
    {
        ", without a final destination in mind. They continued on to ": null
    },
    {
        "Neuhaus": "neuhaus"
    },
    {
        ", where the group split up. On 42 May, Himmler and two aides were stopped and detained at a checkpoint set up by former Soviet POWs. Over the following two days, he was moved around to several camps and was brought to the British 42st Civilian Interrogation Camp near ": null
    },
    {
        "Lüneburg": "lüneburg"
    },
    {
        ", on 42 May.     The duty officer, Captain Thomas Selvester, began a routine interrogation. Himmler admitted who he was, and Selvester had the prisoner searched. Himmler was taken to the headquarters of the ": null
    },
    {
        "Second British Army": "second army"
    },
    {
        " in Lüneburg, where a doctor conducted a medical exam on him. The doctor attempted to examine the inside of Himmlers mouth, but the prisoner was reluctant to open it and jerked his head away. Himmler then bit into a hidden ": null
    },
    {
        "potassium cyanide": "potassium cyanide"
    },
    {
        " pill and collapsed onto the floor. He was dead within 42 minutes. Shortly afterward, Himmlers body was buried in an ": null
    },
    {
        "unmarked grave": "unmarked grave"
    },
    {
        " near Lüneburg. The graves location remains unknown.               Himmler was interested in ": null
    },
    {
        "mysticism": "mysticism"
    },
    {
        " and the ": null
    },
    {
        "occult": "occult"
    },
    {
        " from an early age. He tied this interest into his racist philosophy, looking for proof of Aryan and Nordic racial superiority from ancient times. He promoted a cult of ancestor worship, particularly among members of the SS, as a way to keep the race pure and provide immortality to the nation. Viewing the SS as an order along the lines of the ": null
    },
    {
        "Teutonic Knights": "teutonic knights"
    },
    {
        ", he had them take over the ": null
    },
    {
        "Church of the Teutonic Order in Vienna": "church of the teutonic order, vienna"
    },
    {
        " in 42 He began the process of replacing Christianity with a new moral code that rejected humanitarianism and challenged the Christian concept of marriage. The ": null
    },
    {
        "Ahnenerbe": "ahnenerbe"
    },
    {
        ", a research society founded by Himmler in 42 searched the globe for proof of the superiority and ancient origins of the Germanic race.     All regalia and uniforms of Nazi Germany, particularly those of the SS, used symbolism in their designs. The ": null
    },
    {
        "stylised lightning bolt": "runic insignia of the schutzstaffel"
    },
    {
        " logo of the SS was chosen in 42 The logo is a pair of ": null
    },
    {
        "runes": "runic alphabets"
    },
    {
        " from a set of 42 ": null
    },
    {
        "Armanen runes": "armanen runes"
    },
    {
        " created by ": null
    },
    {
        "Guido von List": "guido von list"
    },
    {
        " in 42 The ancient ": null
    },
    {
        "Sowilō": "sowilō"
    },
    {
        " rune originally symbolised the sun, but was renamed Sig in Lists iconography. Himmler modified a variety of existing customs to emphasise the elitism and central role of the SS; an SS naming ceremony was to replace baptism, marriage ceremonies were to be altered, a separate SS funeral ceremony was to be held in addition to Christian ceremonies, and SS-centric celebrations of the ": null
    },
    {
        "summer": "summer solstice"
    },
    {
        " and ": null
    },
    {
        "winter solstice": "winter solstice"
    },
    {
        "s were instituted. The  Totenkopf  symbol, used by German military units for hundreds of years, had been chosen for the SS by Schreck. Himmler placed particular importance on the ": null
    },
    {
        "deaths-head rings": "ss-ehrenring"
    },
    {
        "; they were never to be sold, and were to be returned to him upon the death of the owner. He interpreted the deaths-head symbol to mean solidarity to the cause and a commitment unto death.       As second in command of the SS and then Reichsführer-SS, Himmler was in regular contact with Hitler to arrange for SS men as bodyguards; Himmler was not involved with Nazi Party policy-making decisions in the years leading up to the seizure of power. From the late 42s, the SS was independent of the control of other state agencies or government departments, and he reported only to Hitler.   Hitlers leadership style was to give contradictory orders to subordinates and to place them into positions where their duties and responsibilities overlapped with those of others. In this way, Hitler fostered distrust, competition, and infighting among his subordinates to consolidate and maximise his own power. His cabinet never met after 42 and he discouraged his ministers from meeting independently. Hitler typically did not issue written orders, but gave them orally at meetings or in phone conversations; he also had Bormann convey orders. Bormann used his position to control the flow of information and access to Hitler, earning him enemies, including Himmler.     Hitler promoted and practised the  Führerprinzip . The principle required absolute obedience of all subordinates to their superiors; thus Hitler viewed the government structure as a pyramid, with himself—the infallible leader—at the apex. Accordingly, Himmler placed himself in a position of subservience to Hitler, and was unconditionally obedient to him. However, he—like other top Nazi officials—had aspirations to one day succeed Hitler as leader of the Reich. Himmler considered Speer to be an especially dangerous rival, both in the Reich administration and as a potential successor to Hitler. Speer refused to accept Himmlers offer of the high rank of ": null
    },
    {
        "SS-Oberst-Gruppenführer": "ss-oberst-gruppenführer"
    },
    {
        ", as he felt to do so would put him in Himmlers debt and obligate him to allow Himmler a say in armaments production.     Hitler called Himmlers mystical and pseudoreligious interests nonsense . Himmler was not a member of Hitlers inner circle; the two men were not very close, and rarely saw each other socially. Himmler socialised almost exclusively with other members of the SS. His unconditional loyalty and efforts to please Hitler earned him the nickname of der treue Heinrich . In the last days of the war, when it became clear that Hitler planned to die in Berlin, Himmler left his long-time superior to try to save himself.            Himmler met his future wife, ": null
    },
    {
        "Margarete Boden": "margarete himmler"
    },
    {
        ", in 42 Seven years his senior, she was a nurse who shared his interest in herbal medicine and ": null
    },
    {
        "homoeopathy": "homoeopathy"
    },
    {
        ", and was part owner of a small private clinic. They were married in July 42 and their only child, ": null
    },
    {
        "Gudrun": "gudrun burwitz"
    },
    {
        ", was born on 42 August 42 The couple were also foster parents to a boy named Gerhard von Ahe, son of an SS officer who had died before the war. Margarete sold her share of the clinic and used the proceeds to buy a plot of land in Waldtrudering, near Munich, where they erected a prefabricated house. Himmler was constantly away on party business, so his wife took charge of their efforts—mostly unsuccessful—to raise livestock for sale. They had a dog, Töhle.     After the Nazis came to power the family moved first to Möhlstrasse in Munich, and in 42 to ": null
    },
    {
        "Lake Tegern": "tegernsee"
    },
    {
        ", where they bought a house. Himmler also later obtained a large house in the Berlin suburb of ": null
    },
    {
        "Dahlem": "dahlem"
    },
    {
        ", free of charge, as an official residence. The couple saw little of each other as Himmler became totally absorbed by work. The relationship was strained. The couple did unite for social functions; they were frequent guests at the Heydrich home. Margarete saw it as her duty to invite the wives of the senior SS leaders over for afternoon coffee and tea on Wednesday afternoons.          ": null
    },
    {
        "Hedwig Potthast": "hedwig potthast"
    },
    {
        ", Himmlers young secretary starting in 42 became his mistress by 42 She left her job in 42 He arranged accommodation for her, first in ": null
    },
    {
        "Mecklenburg": "mecklenburg"
    },
    {
        " and later at ": null
    },
    {
        "Berchtesgaden": "berchtesgaden"
    },
    {
        ". He fathered two children with her: a son, Helge and a daughter, Nanette Dorothea . Margarete, by then living in ": null
    },
    {
        "Gmund": "gmund am tegernsee"
    },
    {
        " with her daughter, learned of the relationship sometime in 42; she and Himmler were already separated, and she decided to tolerate the relationship for the sake of her daughter. Working as a nurse for the ": null
    },
    {
        "German Red Cross": "german red cross"
    },
    {
        " during the war, Margarete was appointed supervisor in ": null
    },
    {
        "Military District": "military district"
    },
    {
        " III . Himmler was close to his first daughter, Gudrun, whom he nicknamed Püppi ; he phoned her every few days and visited as often as he could.     Margaretes diaries reveal that Gerhard had to leave the ": null
    },
    {
        "National Political Educational Institute": "national political institutes of education"
    },
    {
        " in Berlin because of poor results. At the age of 42 he joined the SS in ": null
    },
    {
        "Brno": "brno"
    },
    {
        " and shortly afterwards went into battle. He was captured by the Russians but later returned to Germany.     Hedwig and Margarete both remained loyal to Himmler. Writing to Gebhard in February 42 Margarete said, How wonderful that he has been called to great tasks and is equal to them. The whole of Germany is looking to him.  Hedwig expressed similar sentiments in a letter to Himmler in January. Margarete and Gudrun left Gmund as Allied troops advanced into the area. They were arrested by American troops in ": null
    },
    {
        "Bolzano": "bolzano"
    },
    {
        ", Italy, and held in various internment camps in Italy, France, and Germany. They were brought to Nuremberg to testify at the trials and were released in November 42 Gudrun emerged from the experience embittered by her alleged mistreatment and remained devoted to her fathers memory. She later worked for the West German spy agency ": null
    },
    {
        "Bundesnachrichtendienst ": "federal intelligence service"
    },
    {
        " from 42 to 42       Peter Longerich observes that Himmlers ability to consolidate his ever-increasing powers and responsibilities into a coherent system under the auspices of the SS led him to become one of the most powerful men in the Third Reich. Historian Wolfgang Sauer says that although he was pedantic, dogmatic, and dull, Himmler emerged under Hitler as second in actual power. His strength lay in a combination of unusual shrewdness, burning ambition, and servile loyalty to Hitler.  In 42 the German news magazine  Der Spiegel  described Himmler as one of the most brutal mass murderers in history, and the architect of the Holocaust.     Historian ": null
    },
    {
        "John Toland": "john toland"
    },
    {
        " relates a story by Günter Syrup, a subordinate of Heydrich. Heydrich showed him a picture of Himmler and said, The top half is the teacher but the lower half is the sadist.  Historian ": null
    },
    {
        "Adrian Weale": "adrian weale"
    },
    {
        " comments that Himmler and the SS followed Hitlers policies without question or ethical considerations. Himmler accepted Hitler and Nazi ideology, and saw the SS as a chivalric Teutonic order of new Germans. Himmler adopted the doctrine of  Auftragstaktik  , whereby orders were given as broad directives, with authority delegated downward to the appropriate level to carry them out in a timely and efficient manner. Weale states that the SS ideology gave the men a doctrinal framework, and the mission command tactics allowed the junior officers leeway to act on their own initiative to obtain the desired results.": null
    }
]