[
    {
        "        Interlanguage links are links from a page in one ": null
    },
    {
        "Wikipedia": "wikipedia"
    },
    {
        " language to an equivalent page in another language. These links can appear in two places:     As links in the Languages section of the pages left sidebar   As inline links in the text of the article     These two types of links are created and handled differently.     Links in the sidebar   Pages on Wikipedia can link to equivalent pages in other languages. The English article on ": null
    },
    {
        "Spain": "spain"
    },
    {
        " includes a link to the Spanish article ": null
    },
    {
        "España": ":es:españa"
    },
    {
        " in the sidebar, and vice versa. These links can be mantained in two places: in Wikidata and by using ": null
    },
    {
        "local links": "help:interlanguage linkslocal links"
    },
    {
        " in the text of the page itself. Using Wikidata is the preferred method.            ": null
    },
    {
        "Wikidata": "wp:wikidata"
    },
    {
        " is a sister project of Wikipedia, it is a collaboratively edited knowledge base. Part of this project is to centralize the interlanguage links for all the Wikipedia projects. The Wikidata entry for a page contains a list of links for that page in different languages.         At the bottom of the Wikidata language list, notated Languages, there is a link labelled Edit links . Clicking on this will reveal a new page:     scroll down to the box marked Wikipedia and click on edit at the top of that box   click on the greyed-out wiki field, the final item on the list, and enter a language code    click on the greyed-out page field and type in the name of the article as it appears in that languages Wikipedia   click on save at the top of the box     If you get an error message like Site link ... is already used by item Q.... , this means that there is already an item in Wikidata pointing to the article you are trying to link to. Wikidata does not allow more than one item to point to a single article in a Wikipedia. There are then two cases:     either the two items really are the same, and should be merged: see ": null
    },
    {
        "d:Help:Merge": "d:help:merge"
    },
    {
        ", or   the scope of the two items is not in fact the same and they should not be linked     Unfortunately, there is no mechanism in Wikidata at present for linking articles that are related, but different in a scope – it is possible to do this with ": null
    },
    {
        "local links": "local links"
    },
    {
        " however.     ": null
    },
    {
        "automated tool": "d:wikidata:tools/user scriptsuserscripts for wikipedia"
    },
    {
        " to help with that.     The local links do however still serve some purposes:     They override the information that comes from Wikidata.   They are required if more than one article in one language should point to a target article in another language.   They are required in order to explicitly link to or from redirects. This can be used to level semantical or organizational differences between articles in different Wikipedias so that the links can go to the exact equivalent term in another language rather than to an article with a somewhat different scope or only related topic.   They are required in order to link to sections of articles. For example, corresponding to the English article , in Italian there is only a section rather than a full article, so ": null
    },
    {
        "Spot welding": "spot welding"
    },
    {
        " includes the local link ": null
    },
    {
        "it:SaldaturaSaldatura a punti": "it:saldaturasaldatura a punti"
    },
    {
        " .   They are required for pages that are not allowed on Wikidata, such as your userpage.       The local interlanguage ": null
    },
    {
        "links": "wikipedia:links"
    },
    {
        " take the following form:     ": null
    },
    {
        "language code:Title": "language code:title"
    },
    {
        "     where the language code is the two-letter code as per ": null
    },
    {
        "ISO 4242": "iso 639-1"
    },
    {
        ".  So for example in the English language article on ": null
    },
    {
        "Plankton": "plankton"
    },
    {
        ", which is available on many other wikis, the interlanguage links might look like this:       ": null
    },
    {
        "ar:عوالق": "ar:عوالق"
    },
    {
        "   el:Πλαγκτόν": "el:πλαγκτόν"
    },
    {
        "   fa:پلانکتون": "fa:پلانکتون"
    },
    {
        "   he:פלנקטון": "he:פלנקטון"
    },
    {
        "   ja:プランクトン": "ja:プランクトン"
    },
    {
        "   ko:플랑크톤": "ko:플랑크톤"
    },
    {
        "   ru:Планктон": "ru:планктон"
    },
    {
        "   ta:மிதவைவாழி": "ta:மிதவைவாழி"
    },
    {
        "   te:ప్లవకాలు": "te:ప్లవకాలు"
    },
    {
        "   th:แพลงก์ตอน": "th:แพลงก์ตอน"
    },
    {
        "   zh:浮游生物": "zh:浮游生物"
    },
    {
        "     NOTE: These links are treated specially, and dont show up in the body of the text, but in a special sidebar section listed by language name. They can go anywhere in the article source as their placement does not alter the visual appearance of the links on the rendered page except for the order. However, the convention is to put them at the bottom of the page. Remember, you only need these type links if you are overriding the information from Wikidata, otherwise you should edit the links on the Wikidata entry.         Featured or good articles are represented via Wikidata.     Inline links ": null
    },
    {
        "red links": "wp:red"
    },
    {
        ". We dont have an article on ": null
    },
    {
        "Hanning Schröder": "hanning schröder"
    },
    {
        " , but the German Wikipedia does. It is possible to:     Write ": null
    },
    {
        "Hanning Schröder": ":de:hanning schröder"
    },
    {
        " to link directly to the German version, the link shows up as ": null
    },
    {
        "Hanning Schröder": ":de:hanning schröder"
    },
    {
        "   Write ": null
    },
    {
        "Hanning Schröder": "hanning schröder"
    },
    {
        "  to give both a redlinked English link and a German blue link: ": null
    },
    {
        "Hanning Schröder": "hanning schröder"
    },
    {
        "    Use the template  which does the same thing as above, but hides the German link if the English redlink turns blue. By writing  we get:  .     The first option is not preferred because it hides the fact that the English Wikipedia is missing that article, and because it can be very unexpected for someone who doesnt speak German to suddenly be sent to a German page.          You can create a clickable link that will be visible in your text by adding a colon before and after the ": null
    },
    {
        "language abbreviation": "list of wikipedias"
    },
    {
        ":     : ": null
    },
    {
        ":fr:Jeux olympiques": ":fr:jeux olympiques"
    },
    {
        " or ": null
    },
    {
        ":ja:東京都": ":ja:東京都"
    },
    {
        "     These links look like this: ": null
    },
    {
        ":fr:Jeux olympiques": ":fr:jeux olympiques"
    },
    {
        " or ": null
    },
    {
        ":ja:東京都": ":ja:東京都"
    },
    {
        ". The language abbreviation is displayed, so the reader knows that they are links to the French article on the Olympic Games and the Japanese article on Tokyo.     But if you wish you can use the pipe to show only the title:     : ": null
    },
    {
        "Jeux olympiques": ":fr:jeux olympiques"
    },
    {
        " or ": null
    },
    {
        "東京都": ":ja:東京都"
    },
    {
        "     Which would look like this in your text: ": null
    },
    {
        "Jeux olympiques": ":fr:jeux olympiques"
    },
    {
        " or ": null
    },
    {
        "東京都": ":ja:東京都"
    },
    {
        "     You can also use the ": null
    },
    {
        "pipe trick": "help:pipe trick"
    },
    {
        " to simplify this to:  . This gives the same result: a link to ": null
    },
    {
        "Jeux olympiques": ":fr:jeux olympiques"
    },
    {
        " on the French Wikipedia.     To link to a ": null
    },
    {
        "namespace": "wp:namespace"
    },
    {
        " other than the main article namespace, add the namespace after the language abbreviation. For example, the page for general discussions on the Japanese Wikipedia is located in the Wikipedia namespace. You can link to it as follows:     : ": null
    },
    {
        ":ja:Wikipedia:井戸端": ":ja:wikipedia:井戸端"
    },
    {
        " or ": null
    },
    {
        "Wikipedia:井戸端": ":ja:wikipedia:井戸端"
    },
    {
        "     On ": null
    },
    {
        "Talk pages": "wikipedia:talk pages"
    },
    {
        " and on ": null
    },
    {
        "Meta": "wikipedia:meta"
    },
    {
        ", you can omit the leading colon. An interlanguage link like ": null
    },
    {
        "fr:Jeux olympiques": "fr:jeux olympiques"
    },
    {
        " will appear inline in the text, like a regular link.   An inline link to a Wiktionary entry, such as  , can be directed to another languages Wiktionary like so:  .       On the English Wikipedia, links to pages that do not exist are displayed in a different color . But this check is not performed for links to pages on another wiki . Unlike internal links, these links do not indicate whether the target page exists or not. ": null
    },
    {
        "Bug 42": "bugzilla:11"
    },
    {
        " If the target page does not exist, the link leads a message on the target wiki informing you that the page does not exist and inviting you to create it.     If you find interlanguage links to non-existent pages on the English Wikipedia, they may be deleted as having no content. Alternatively, you can create at least a ": null
    },
    {
        "stub": "wikipedia:stub"
    },
    {
        " page on the target wiki before adding an interlanguage link to it. Later, interested people can complete the rest of the page.     Note: if the language prefix is wrong, it is considered to be part of the name of a page on the English Wikipedia. This page will probably not exist, so the link will be displayed in red.     The  template can help with this.          You can also link to Wikipedia pages in other languages by using external links, in the same way as linking to other sites on the Internet. This method should not be used in the body of an article, but it may be useful on User pages or Talk pages. For example, this method can be used to link to ": null
    },
    {
        "diff pages": "help:diff"
    },
    {
        " that show the editing history of a page on another Wikipedia.     The following code:     : Tokyo 42 was added to the French page on the Olympics in .     renders as:     :Tokyo 42 was added to the French page on the Olympics in .     Templates  and  are also available to construct diffs for other languages and projects, as is the ": null
    },
    {
        "special-page": "wp:spec"
    },
    {
        " term :Diff/ : ": null
    },
    {
        ":fr:Special:Diff/42": ":fr:special:diff/96480208"
    },
    {
        " will show the ": null
    },
    {
        "same diff": ":fr:special:diff/96480208"
    }
]