[
    {
        "Hemer is a town in the ": null
    },
    {
        "Märkischer Kreis": "märkischer kreis"
    },
    {
        " , in ": null
    },
    {
        "North Rhine-Westphalia": "north rhine-westphalia"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ".       Hemer is located at the north end of the ": null
    },
    {
        "Sauerland": "sauerland"
    },
    {
        " near the ": null
    },
    {
        "Ruhr": "ruhr"
    },
    {
        " river. The highest elevation, at 42 metres , is in the Balver Wald in the south of the city. The lowest elevation, at 42 metres , is at the Edelburg in the northeast.       ": null
    },
    {
        "Burial mounds": "tumulus"
    },
    {
        " show that around 42 BC, ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " shepherds and farmers lived in the area. Graves from the time of the ": null
    },
    {
        "Merovingian": "merovingian"
    },
    {
        " Franks": "franks"
    },
    {
        " around the year 42 were found near the present city centre.     Hemer was first mentioned in 42 by its old name Hademare in a document of bishop ": null
    },
    {
        "Anno II": "archbishop anno ii"
    },
    {
        " of ": null
    },
    {
        "Cologne": "archbishopric of cologne"
    },
    {
        ", granting lands to the newly founded ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " Grafschaft Abbey": "grafschaft abbey"
    },
    {
        ", including St. ": null
    },
    {
        "Vitus": "vitus"
    },
    {
        " church and two farms, the later Haus Hemer and the Hedhof. In 42 the parish of St. Vitus was separated from the parish of Menden.     Hemer remained an unimportant settlement without market rights, even when the ": null
    },
    {
        "Counts of the Mark": "mark"
    },
    {
        " gained independence from the episcopal state of Cologne in the 42th century, when Hemer found itself on the boundary of the two states. But despite the political insignificance of the Kirchspiel Hemer , it was already quite densely settled, thanks to its location on the old road from the ": null
    },
    {
        "Rhineland": "rhineland"
    },
    {
        " to Middle Germany , and to the iron mining and smelting industries already developed here. The boundary with Cologne, formed by the valley of the ": null
    },
    {
        "Hönne": "hönne"
    },
    {
        " river southeast of Hemer, was protected by ": null
    },
    {
        "Klusenstein Castle": "klusenstein castle"
    },
    {
        ", built in 42 Local government in the parish of Hemer was the responsibility of the  Amt  of ": null
    },
    {
        "Iserlohn": "iserlohn"
    },
    {
        " until 42 when it was transferred to the family of Wachtendonk, who owned Haus Hemer at that time.          The ": null
    },
    {
        "Reformation": "protestant reformation"
    },
    {
        " reached Hemer in the second half of the 42th century, when the church of St. Vitus became ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " . Between 42 and 42 ": null
    },
    {
        "Jobst Edmund of Brabeck": "jobst edmund of brabeck"
    },
    {
        ", the ": null
    },
    {
        "bishop of Hildesheim": "bishop of hildesheim"
    },
    {
        " and a relative of the new owners of Haus Hemer, built the church of Saints ": null
    },
    {
        "Peter": "saint peter"
    },
    {
        " and ": null
    },
    {
        "Paul": "paul of tarsus"
    },
    {
        " in ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        " style as the new church for the ": null
    },
    {
        "Roman Catholics": "roman catholics"
    },
    {
        ".     During the ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        "ic period Hemer was a  mairie  in the  arrondissement  of Hagen in the  département  of the ": null
    },
    {
        "Ruhr": "ruhr"
    },
    {
        " of the Napoleonic satellite ": null
    },
    {
        "Grand Duchy of Berg": "berg"
    },
    {
        ".       On October 42 42 the  Amt Hemer was created by 42 municipalities previously administered by the Landbezirk Iserlohn. It originally consisted of the municipalities of Becke, Brockhausen, Calle, Deilinghofen, Evingsen, Frönsberg, Ihmert, Kesbern, Landhausen, Lössel, Niederhemer, Oberhemer, Sundwig and Westig, as well as the ": null
    },
    {
        "manor": "manorialism"
    },
    {
        "s  of Edelburg, Haus Hemer and Klusenstein. The Amt was part of the Kreis Iserlohn. In 42 Niederhemer and Oberhemer were merged into Hemer. In 42 Lössel became part of the Amt Oestrich.          The three industrial municipalities of Hemer, Sundwig and Westig had already grown into a single urban area by ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". The idea of merging the three municipalities had already been mooted before the war, but due to the war it was not until 42 that it was formally proposed. However, neither Sundwig nor Westig was initially enthusiastic and both later opposed the merger, mostly because the industrialists in the two places were worried that the tax rates would rise to the higher rates of Hemer. At the same time the city of ": null
    },
    {
        "Iserlohn": "iserlohn"
    },
    {
        " unsuccessfully tried to incorporate several municipalities: Letmathe and Oestrich to the west, and also the industrial municipalities of the Amt Hemer. Because of the opposition, the merger of the three municipalities was delayed until 42 when it was carried out by order of the ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n Ministry of the Interior. At the same time the municipality of Calle was split into four parts: the northern Griesenbrauck was added to Landhausen; Bilveringsen passed to Hemer; the central part around Wermingsen was incorporated into Iserlohn; and the southern parts passed to Westig. With effect from August 42 42 Hemer, Sundwig and Westig, as well as Landhausen and the remains of Calle were merged, covering an area of 42  km² and having a population of 42.     Also with effect from August 42 42 the municipality of Brockhausen was incorporated into Deilinghofen. The rural Brockhausen had only 42 inhabitants, and because of its low income was not considered to be financially viable as an independent unit.     On January 42 42 the municipality of Hemer received the right to call itself a ": null
    },
    {
        "city": "city"
    },
    {
        " .       In 42 Hemer became a garrison town. In January 42 it was decided to build three barracks in neighboring Iserlohn, which however was unable also to provide enough free land for a training area. At a meeting in June, land around the village of Apricke was selected, of which 42  km² was bought by the state in autumn of the same year. The hospital was also inspected and later acquired as a military hospital. This was very welcome to Hemer, as the hospital had turned out to be far too big and too expensive for the Amt, and in this way it was possible later to build a new smaller hospital.     In December 42 temporary barracks for one battalion were also built in Hemer. On October 42 42 an official garrison contract between Hemer and the state was signed, which included the building of permanent barracks. Construction was still unfinished when ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " started in 42 but was then rushed through and the buildings were reassigned as a ": null
    },
    {
        "prisoner of war": "prisoner of war"
    },
    {
        " camp, the  Stalag VI-A .        The first Polish POWs arrived in October 42 and had to sleep on the floor as the beds were still not finished. Inadequate equipment remained a problem throughout the whole of the war, both because the material was needed at the front, and also because the camp was permanently overpopulated. At first the inmates were mostly from ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and ": null
    },
    {
        "France": "france"
    },
    {
        ", but after the beginning of the ": null
    },
    {
        "war with the Soviet Union": "eastern front"
    },
    {
        " in 42 ": null
    },
    {
        "Soviet POWs": "nazi crimes against soviet pows"
    },
    {
        " quickly became the majority.     It is estimated that during the six years of the war more than 42 inmates were held in the camp. Those who were capable of forced labour usually lived near their places of work, so the main camp was in a sense a dying camp for those who fell ill because of the bad living conditions and the hard labour. At an unconfirmed estimate, about 42 POWs were buried in Hemer. The fictional film  Harts War  is set in the camp in early 42     After the war the barracks of the Stalag, renamed to Camp Roosevelt were at first used as a camp for detaining Nazi prisoners. In 42 it was renamed Casernes Ardennes and were used by the ": null
    },
    {
        "Belgian army": "belgian army"
    },
    {
        " till 42 After the establishment of the German ": null
    },
    {
        "Bundeswehr": "bundeswehr"
    },
    {
        " the barracks became home of a tank battalion in 42 Originally simply named after its location on the Jüberg hill, it received its final name, Blücher-Kaserne, in 42     In 42 ": null
    },
    {
        "Canadian": "canadians"
    },
    {
        " troops moved into newly built barracks in Deilinghofen as well as two former German barrack complexes in Iserlohn . Canadian soldiers and their families resided in two separate locations in Hemer. The main location centered on Berliner Strasse where the school and community center were located. The secondary location centered on Bredde Strasse, the site that was formerly used by the Belgians. In 42 the Canadian military was transferred to bases in the ": null
    },
    {
        "Black Forest": "black forest"
    },
    {
        " Region  and most of the former Canadian holdings, including Married Quarters in Hemer, were taken over by British military. In 42 the British left and the Deilinghofen barracks were converted to civil use with the barracks in Iserlohn either transferred back to the Bundeswehr or also converted to civil use.     Due to the changing duties of the Bundeswehr, tanks are not needed as much as they were during the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ". The closure of the barracks was announced in 42 and on January 42 42 the last soldiers left Hemer, 42 years after the Bundeswehr moved into the barracks.       With the reorganization of the districts and municipalities in 42 the Amt was dissolved. Evingsen had already become part of ": null
    },
    {
        "Altena": "altena"
    },
    {
        " in 42 In 42 Kesbern became part of ": null
    },
    {
        "Iserlohn": "iserlohn"
    },
    {
        ", while the other municipalities of Becke, Deilinghofen, Frönsberg and Ihmert were added to the town of Hemer.       Becke - consisting of the settlements  Brelen, Edelburg, Höcklingsen, Mesterscheid, Oese, Urbecke. Area 42  km² , population 42   Brockhausen - Apricke, Bäingsen, Brockhausen, Grevenborn, Im Hagen, Hönnetal, Klusenstein, Riemke. Area 42  km² , population 42   Calle - Bilveringsen, Bredenbruch, zur Calle, Düingsen, Franzberg, Griesenbrauck, Magney, Schleddenhof, Wermingsen. Area 42  km² , population 42   Deilinghofen - Bautenheide, Deilinghofen, Habichtseil, Hembecke, Hohenstein, Langenbruch, Nierungsen. Area 42  km² , population 42   Evingsen - Evingsen, Giebel, Heide, Heidermühle, Heidersiepen, Hüingsen, auf der Hütte, Kohlberg, Löttringsen, Löttringserhahn, Nettenscheid, Rüssenberg, Schwarzpaul, Springen, Stodt, Tüssenberg. Area 42  km² , population 42   Frönsberg - Beckmerhagen, Drubbelhelle, Ebberg, Frönsberg, Heppingsen, Heppingserbach, Hestern, Hültershagen, Ispei, Rohland, Stephanopel, Wachmecke, Winterhof. Area 42  km² , population 42   Ihmert - Bredenbruch, Dieckgraben, Elfenfohren, Hasberg, Holmecke, Ihmert, Ihmerterbach, Ihmerterort, Johannistal, Rottmecke, Stemmessiepen, Stümpen, Sülberg, Tüttebelle, Westendorf. Area 42  km² , population 42   Kesbern - Attern, Bräke, Oberdahlsen, Niederdahlsen, Eichholz, Eileringsen, Gunzenheide, im Hagen, Hardorn, Hegenscheid, vorm Hey, Kesbern, Lohsiepen, Lennenstück, Meerbrauck, Osthelle, im Schlaa, Siepen, Voswinkel, Wixberg. Area 42  km² , population 42   Landhausen - Krebsbach , Landhausen, Stübecken. Area 42  km² , population 42   Lössel - Bühle, Dümpel, Düsternsiepen, Emberg, Großenstück, Häken, Heide, Hilkenhohl, Langenstück, Liehard, Lieth, Lössel, Lüsecken, Mooskamp, Pillingsen, Pillingserbach, Roden, Roland, Saat, Schmidthacke, Schorhelle, Selberg, Sieschotte, Silbering, Stümpen, Stübke, am Ühler. Area 42  km² , population 42   Niederhemer - Haus Hemer, Niederhemer, Rosenhoff. Area 42  km² , population 42   Oberhemer - area 42  km² , population 42.   Sundwig - Dieken, Eichenufer , Grüntal , Siegeloh, Sundwig, Sundwigerbach, Wenhagen. Area 42  km² , population 42.   Westig - Westig, Westigerbach, Westigerkreuz. Area 42  km² , population 42.       Until 42 the ": null
    },
    {
        "mayor": "mayor"
    },
    {
        " was an honorary post with only formal duties, while the actual head of administration was the Stadtdirektor. This system was introduced in 42 by the ": null
    },
    {
        "British military government": "control commission for germany - british element"
    },
    {
        ", and was abolished in 42 However, when Reiner Hermann was forced to resign in 42 shortly after the new system was adopted, Hemer became the first commune of North Rhine-Westphalia to get a professional mayor in 42          As of 42 42 citizens were Protestants, 42 Roman Catholic, and 42 have other or no religion.     Five Roman Catholic parishes are located in the city - St. Peter and Paul , Christ König , St. Peter Canisius , St. Mary and St. Bonifatius . All five parishes work together in a parish cluster . They are member of the ": null
    },
    {
        "deanery": "deanery"
    },
    {
        " Märkisches Sauerland within the ": null
    },
    {
        "Archdiocese of Paderborn": "archdiocese of paderborn"
    },
    {
        ".          The Heinrichshöhle is a ": null
    },
    {
        "Devonian": "devonian period"
    },
    {
        " limestone": "limestone"
    },
    {
        " cave in Hemer, officially discovered in 42 but probably known by locals long before. 42m of the cave system are accessible to visitors, with some ": null
    },
    {
        "stalactite": "stalactite"
    },
    {
        "s and the skeleton of a ": null
    },
    {
        "cave bear": "cave bear"
    },
    {
        " on display.     The Felsenmeer nearby is a small ": null
    },
    {
        "Karst": "karst"
    },
    {
        " area, partially created by medieval mining, now located in a ": null
    },
    {
        "beech": "beech"
    },
    {
        " forest.     Shared with ": null
    },
    {
        "Menden": "menden"
    },
    {
        " and ": null
    },
    {
        "Balve": "balve"
    },
    {
        " is the ": null
    },
    {
        "Hönnetal": "hönnetal"
    },
    {
        ", a narrow valley with some beautiful cliffs carved into the same limestone bedrock by the river ": null
    },
    {
        "Hönne": "hönne"
    },
    {
        ".       The three golden wolf-hooks are derived from the arms of the Brabeck family, the owners of the manor Haus Hemer. The red and white ": null
    },
    {
        "fess": "fess"
    },
    {
        " on the left side is derived from the arms of the ": null
    },
    {
        "Counts of the Mark": "mark"
    },
    {
        ". The current coat of arms of the city was originally used by the Amt, but when the Amt was dissolved into the city in 42 the city adopted it. It was chosen because it was heraldically and esthetically more satisfying, but also because the adoption of the coat of arms of the Amt symbolized the fact that the enlarged city continues the tradition of the Amt. The coat of arms was officially granted on March 42 42        The former coat of arms of the city used the same heraldic elements, but in a different arrangement. The red and white motif was used in the form of a ": null
    },
    {
        "bordure": "bordure"
    },
    {
        " round the whole shield, which was completely black with the three yellow wolf-hooks in the middle. This coat of arms was granted by the president of the province of ": null
    },
    {
        "Westphalia": "westphalia"
    },
    {
        " on January 42  and January 42 42     In 42 the municipality of Hemer was already planning the creation of a coat of arms. A draft using industrial symbols was made by Treude, but the director of the Prussian state archive in ": null
    },
    {
        "Münster": "münster"
    },
    {
        ", Professor ": null
    },
    {
        "Ludwig Schmitz-Kallenberg": "ludwig schmitz-kallenberg"
    },
    {
        ", advised against it. Instead he suggested two designs using the heraldic elements of families of Brabeck and of the Counts of the Mark. Hemer created new drafts using heraldic elements from the arms of previous owners of Haus Hemer , but in 42 the topic was discontinued. When it was restarted in the 42s the original suggestion of Professor Johannes Bauermann of the Prussian state archive was followed, with final artwork by the herald Waldemar Mallek.     In 42 the other municipalities of the Amt also received coats of arms. All six took the three wolf-hooks as their common symbol, showing their membership in the Amt. Becke, Deilinghofen and Frönsberg combined them with coats of arms of former noble families of the municipality, while Evingsen, Ihmert and Kesbern combined them with symbols representing their main industries - shoe making for Evingsen, wire production for Ihmert and agriculture for Kesbern.     See also: ": null
    },
    {
        "Coat of arms in the Amt Hemer": "coat of arms in the amt hemer"
    },
    {
        "            Like most of the northern part of the present ": null
    },
    {
        "Märkischer Kreis": "märkischer kreis"
    },
    {
        ", Hemer has a long industrial history. The most important industries in the beginning of the 42th century were ": null
    },
    {
        "wire": "wire"
    },
    {
        " production and wire manufacturing industries, but also rolling mills, foundries and machine production. Paper production was already declining at that time. In 42 Hemer and Ihmert together had 42 wire factories - 42% of all wire factories in Germany at that time. However, as the factories were rather small the percentage is much less impressive when compared by number of employees.     Hemer was the home of Clarfeld & Springmeyer, founded by Friedrich Clarfeld and Heinrich Springmeyer ca. 42 In 42 the name of the firm changed to Clarfeld & Co. KG. They were producers of silver and silverplated tableware into the 42s.     During the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " as well as in the final part of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " many companies went into bankruptcy, but even today the industrial sector is above average in Hemer. The worldwide known ": null
    },
    {
        "fittings": "piping and plumbing fitting"
    },
    {
        " producers  Grohe  and  Keuco  are based in Hemer.       Hemer is located on ": null
    },
    {
        "autobahn 42": "bundesautobahn 46"
    },
    {
        ", which has ended in the Iserlohn quarter of Bilveringsen just at the border of the Hemer since 42 The connection with another section of the A42 at ": null
    },
    {
        "Arnsberg": "arnsberg"
    },
    {
        " has been delayed ever since, as the original route was supposed to go through a nature reserve in ": null
    },
    {
        "Menden": "menden"
    },
    {
        ".          Hemer was connected to the railway system on 42 September 42 when the ": null
    },
    {
        "line from Menden to Hemer": "letmathe–fröndenberg railway"
    },
    {
        " was inaugurated. In 42 the extension to ": null
    },
    {
        "Iserlohn": "iserlohn station"
    },
    {
        " was opened. In 42 a short track was built as far as Sundwig; it was originally planned that this should be extended to ": null
    },
    {
        "Neuenrade": "neuenrade"
    },
    {
        " but the extension was never built. Hemer had two railway stations - one in Oberhemer and one in Westig. Because of a significant decline both in passenger numbers and in quantity of goods traffic, the service was wound up, and the last regular train went through Hemer on 42 May 42 The track to Iserlohn was taken up, while the track to Menden was thereafter only used by the Bundeswehr for transporting their tanks and this traffic ended in 42     Besides the regular railway, a ": null
    },
    {
        "narrow gauge railway": "narrow gauge railway"
    },
    {
        " using  gauge first reached a municipality of the Amt Hemer in 42 when Buchenwäldchen was connected with Iserlohn. It was quickly extended: in 42 almost all the municipalities of Hemer were connected to the network of the Westfälische Kleinbahnen AG. The railway was used both for a tram and for goods transport, with the railway station at Westig serving as the junction between the narrow gauge and the regular gauge railway.     Renamed Iserlohner Kreisbahn AG in 42 operations were only briefly interrupted after World War II. In the 42s however more and more sections of the narrow gauge railway had to be closed because they were no longer profit-making. The trams were replaced by buses, and trucks made the goods transport obsolete. In 42 the goods transfer in Westig was closed; the trams had already closed in 42       The city of Hemer inherited two ": null
    },
    {
        "twinnings": "town twinning"
    },
    {
        " with ": null
    },
    {
        "French": "france"
    },
    {
        " cities from the former municipalities of the Amt Hemer. Ihmert started a twinning with ": null
    },
    {
        "Beuvry": "beuvry"
    },
    {
        " in 42 and Becke with ": null
    },
    {
        "Steenwerck": "steenwerck"
    },
    {
        " in 42/42 Long-running city friendships exist with the German city ": null
    },
    {
        "Bretten": "bretten"
    },
    {
        " and with ": null
    },
    {
        "Obervellach": "obervellach"
    },
    {
        " in ": null
    },
    {
        "Austria": "austria"
    },
    {
        ". On June 42 42 a friendship with the city of ": null
    },
    {
        "Doberlug-Kirchhain": "doberlug-kirchhain"
    },
    {
        " in ": null
    },
    {
        "Brandenburg": "brandenburg"
    },
    {
        " was started. On January 42 42 a friendship with the ": null
    },
    {
        "Russia": "russia"
    },
    {
        "n city of ": null
    },
    {
        "Shchyolkovo": "shchyolkovo"
    },
    {
        " became official.        ": null
    },
    {
        "Willibrord Benzler": "willibrord benzler"
    },
    {
        " , long-term ": null
    },
    {
        "bishop": "bishop"
    },
    {
        " of Metz, his beatification was initiated, in Hemer a street was named after him   ": null
    },
    {
        "Hans Prinzhorn": "hans prinzhorn"
    },
    {
        " , psychiatrist and art historian, pioneer in the analysis of psychological images   ": null
    },
    {
        "Heinz-Dieter Ebbinghaus": "heinz-dieter ebbinghaus"
    },
    {
        ", , mathematician at the Albert-Ludwigs-University Freiburg   ": null
    },
    {
        "Heinz Weifenbach": "heinz weifenbach"
    },
    {
        " , ice hockey executive   ": null
    },
    {
        "Wolfgang Becker": "wolfgang becker"
    },
    {
        " , film director, such as the audience success ": null
    },
    {
        "Goodbye, Lenin!": "goodbye, lenin!"
    },
    {
        ", put his high school diploma at the Friedrich-Leopold-Woeste-Gymnasium   ": null
    },
    {
        "Enno Poppe": "enno poppe"
    },
    {
        " , composer and conductor   ": null
    },
    {
        "Christian Hommel": "christian hommel"
    }
]