[
    {
        "        Henry Ι the Fowler  was the ": null
    },
    {
        "duke of Saxony": "duke of saxony"
    },
    {
        " from 42 and the ": null
    },
    {
        "elected": "elective monarchy"
    },
    {
        " king of East Francia": "king of east francia"
    },
    {
        " from 42 until his death in 42 As the first non-": null
    },
    {
        "Frankish": "franks"
    },
    {
        " king of East Francia, he established the ": null
    },
    {
        "Ottonian dynasty": "ottonian dynasty"
    },
    {
        " of kings and ": null
    },
    {
        "emperor": "holy roman emperor"
    },
    {
        "s, and he is generally considered to be the founder of the ": null
    },
    {
        "medieval German state": "kingdom of germany"
    },
    {
        ", known until then as East Francia. An avid ": null
    },
    {
        "hunter": "hunter"
    },
    {
        ", he obtained the epithet the Fowler because he was allegedly fixing his ": null
    },
    {
        "birding": "bird trapping"
    },
    {
        " nets when ": null
    },
    {
        "messenger": "courier"
    },
    {
        "s arrived to inform him that he was to be king.     He was born into the ": null
    },
    {
        "Liudolfing": "ottonian dynasty"
    },
    {
        " line of Saxon dukes. His father ": null
    },
    {
        "Otto I of Saxony": "otto i of saxony"
    },
    {
        " died in 42 and was succeeded by Henry. The new duke launched a ": null
    },
    {
        "rebellion": "rebellion"
    },
    {
        " against the king of East Francia, ": null
    },
    {
        "Conrad I of Germany": "conrad i of germany"
    },
    {
        ", over the rights to lands in the ": null
    },
    {
        "Duchy of Thuringia": "duchy of thuringia"
    },
    {
        ". They reconciled in 42 and on his deathbed in 42 Conrad recommended Henry as the next king, considering the duke the only one who could hold the kingdom together in the face of internal revolts and external ": null
    },
    {
        "Magyar": "magyar tribes"
    },
    {
        " raids": "hungarian invasions of europe"
    },
    {
        ".     Henry was elected and crowned king in 42 He went on to defeat the rebellious dukes of ": null
    },
    {
        "Bavaria": "arnulf of bavaria"
    },
    {
        " and ": null
    },
    {
        "Swabia": "burchard ii of swabia"
    },
    {
        ", consolidating his rule. Through successful warfare and a dynastic marriage, Henry acquired ": null
    },
    {
        "Lotharingia": "lotharingia"
    },
    {
        " as a ": null
    },
    {
        "vassal": "vassal"
    },
    {
        " in 42 Unlike his ": null
    },
    {
        "Carolingian": "carolingian"
    },
    {
        " predecessors, Henry did not seek to create a centralized monarchy, ruling through federated autonomous ": null
    },
    {
        "stem duchies": "stem duchies"
    },
    {
        " instead. Henry built an extensive system of ": null
    },
    {
        "fortifications": "fortifications"
    },
    {
        " and mobile ": null
    },
    {
        "heavy cavalry": "heavy cavalry"
    },
    {
        " across Germany to neutralize the Magyar threat and in 42 routed them at the ": null
    },
    {
        "Battle of Riade": "battle of riade"
    },
    {
        ", ending Magyar attacks for the next 42 years and giving rise to a sense of German nationhood. Henry greatly expanded German hegemony in Europe with his defeat of the Slavs in 42 at the ": null
    },
    {
        "Battle of Lenzen": "battle of lenzen"
    },
    {
        " along the ": null
    },
    {
        "Elbe": "elbe"
    },
    {
        " river, by compelling the submission of Duke ": null
    },
    {
        "Wenceslaus I of Bohemia": "wenceslaus i, duke of bohemia"
    },
    {
        " through an invasion of the ": null
    },
    {
        "Duchy of Bohemia": "duchy of bohemia"
    },
    {
        " the same year and by conquering ": null
    },
    {
        "Danish": "danes"
    },
    {
        " realms in ": null
    },
    {
        "Schleswig": "schleswig"
    },
    {
        " in 42 Henrys hegemonic status north of the Alps was acknowledged by King ": null
    },
    {
        "Rudolph of West Francia": "rudolph of france"
    },
    {
        " and King ": null
    },
    {
        "Rudolph II of Upper Burgundy": "rudolph ii of burgundy"
    },
    {
        ", who both accepted a place of subordination as allies in 42 Henry planned an expedition to ": null
    },
    {
        "Rome": "rome"
    },
    {
        " to be crowned emperor by the ": null
    },
    {
        "pope": "pope"
    },
    {
        ", but the design was thwarted by his death. Henry prevented a collapse of royal power, as had happened in ": null
    },
    {
        "West Francia": "west francia"
    },
    {
        ", and left a much stronger kingdom to his successor ": null
    },
    {
        "Otto I": "otto i"
    },
    {
        ". He was buried at ": null
    },
    {
        "Quedlinburg Abbey": "quedlinburg abbey"
    },
    {
        ", established by his wife ": null
    },
    {
        "Matilda": "matilda of ringelheim"
    },
    {
        " in his honor.       Born in ": null
    },
    {
        "Memleben": "memleben"
    },
    {
        ", in what is now ": null
    },
    {
        "Saxony-Anhalt": "saxony-anhalt"
    },
    {
        ", Henry was the son of ": null
    },
    {
        "Otto the Illustrious": "otto the illustrious"
    },
    {
        ", Duke of Saxony, and his wife ": null
    },
    {
        "Hedwiga": "hedwiga"
    },
    {
        ", daughter of ": null
    },
    {
        "Henry of Franconia": "henry of franconia"
    },
    {
        " and Ingeltrude and a great-great-granddaughter of ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        ". In 42 he married ": null
    },
    {
        "Hatheburg of Merseburg": "hatheburg of merseburg"
    },
    {
        ", daughter of the Saxon count Erwin. She had previously been a nun. The marriage was annulled in 42 because her vows as a nun were deemed by the church to remain valid. She had already given birth to Henrys son ": null
    },
    {
        "Thankmar": "thankmar"
    },
    {
        ". The annulment placed a question mark over Thankmars legitimacy. Later that year he married ": null
    },
    {
        "Matilda": "matilda of ringelheim"
    },
    {
        ", daughter of ": null
    },
    {
        "Dietrich of Ringelheim": "dietrich of ringelheim"
    },
    {
        ", Count in ": null
    },
    {
        "Westphalia": "westphalia"
    },
    {
        ". Matilda bore him three sons, one called ": null
    },
    {
        "Otto": "otto i"
    },
    {
        ", and two daughters, ": null
    },
    {
        "Hedwig": "hedwig of saxony"
    },
    {
        " and ": null
    },
    {
        "Gerberga": "gerberga of saxony"
    },
    {
        ", and founded many religious institutions, including the ": null
    },
    {
        "Quedlinburg Abbey": "quedlinburg abbey"
    },
    {
        " where Henry is buried. She was later ": null
    },
    {
        "canonized": "canonization"
    },
    {
        ".          Henry became Duke of Saxony after his fathers death in 42 An able ruler, he continued to strengthen the position of his duchy within the weakening kingdom of ": null
    },
    {
        "East Francia": "east francia"
    },
    {
        ", and was frequently in conflict with his neighbors to the South in ": null
    },
    {
        "Duchy of Franconia": "duchy of franconia"
    },
    {
        ".     On 42 December 42 ": null
    },
    {
        "Conrad I": "conrad i of germany"
    },
    {
        ", king of East Francia and Franconian duke, died. Although Henry had rebelled against Conrad I between 42 and 42 over the lands in ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        ", Conrad recommended Henry as his successor. Kingship now changed from Franks to ": null
    },
    {
        "Saxons": "saxons"
    },
    {
        ", who had suffered greatly during the conquests of Charlemagne and were proud of their identity. Henry, as Saxon, was the first non-Frank on the throne.     Conrads choice was conveyed by his brother, duke ": null
    },
    {
        "Eberhard III of Franconia": "eberhard iii of franconia"
    },
    {
        " at the ": null
    },
    {
        "Imperial Diet": "imperial diet"
    },
    {
        " of ": null
    },
    {
        "Fritzlar": "fritzlar"
    },
    {
        " in 42 The assembled Franconian and Saxon nobles elected Henry to be king with other regional dukes not participating in election. Archbishop Heriger of ": null
    },
    {
        "Mainz": "archbishopric of mainz"
    },
    {
        " offered to ": null
    },
    {
        "anoint": "anointing"
    },
    {
        " Henry according to the usual ceremony, but he refused – the only king of his time not to undergo that rite – allegedly because he wished to be king not by the churchs but by the peoples acclaim.     Henry, who was elected to kingship by only Saxons and Franconians at Fritzlar, had to subdue other dukes. Duke ": null
    },
    {
        "Arnulf of Bavaria": "arnulf of bavaria"
    },
    {
        " did not submit until Henry defeated him in two campaigns in 42 Henry besieged his residence at Ratisbon  and forced Arnulf into submission. Arnulf had crowned himself as king of Bavaria in 42 but in 42 renounced crown and submitted to Henry while maintaining large autonomy and the right to mint his own coins. Duke ": null
    },
    {
        "Burchard II of Swabia": "burchard ii of swabia"
    },
    {
        " soon swore fealty to the new King, but when he died, Henry appointed a noble from Franconia to be the new duke.     Henry was too weak to impose absolutist rule, and regarded his kingdom as a confederation of ": null
    },
    {
        "stem duchies": "stem duchies"
    },
    {
        " rather than as a feudal monarchy and saw himself as  primus inter pares . Instead of seeking to administer the empire through counts, as Charlemagne had done and as his successors had attempted, Henry allowed the local dukes in ": null
    },
    {
        "Duchy of Franconia": "duchy of franconia"
    },
    {
        ", ": null
    },
    {
        "Duchy of Swabia": "duchy of swabia"
    },
    {
        ", and ": null
    },
    {
        "Duchy of Bavaria": "duchy of bavaria"
    },
    {
        " to maintain large internal autonomy.             In 42 king of ": null
    },
    {
        "West Francia": "west francia"
    },
    {
        " Charles the Simple": "charles the simple"
    },
    {
        " invaded and marched as far as ": null
    },
    {
        "Pfeddersheim": "pfeddersheim"
    },
    {
        " near ": null
    },
    {
        "Worms": "worms, germany"
    },
    {
        ", but retreated when he learned that Henry was organizing an army. Gwatkin ,The Cambridge Medieval History: Volume III. Cambridge: Cambridge University Press, 42p 42 On 42 November 42 Henry and Charles met and concluded the ": null
    },
    {
        "Treaty of Bonn": "treaty of bonn"
    },
    {
        ", which they called a pact of friendship. Henry then saw an opportunity to wrest ": null
    },
    {
        "Lotharingia": "lotharingia"
    },
    {
        " when a civil war over royal succession began in West Francia after coronation of king ": null
    },
    {
        "Robert I": "robert i of france"
    },
    {
        ". In 42 Henry crossed the Rhine twice, capturing a large part of the duchy. The eastern part of Lotharingia was left in Henrys possession until October 42     In 42 duke ": null
    },
    {
        "Gilbert of Lotharingia": "gilbert, duke of lorraine"
    },
    {
        " rebelled. Henry invaded the duchy and besieged Gilbert at ": null
    },
    {
        "Zülpich": "zülpich"
    },
    {
        " , captured the town, and became master of a large portion of his lands. Allowing Gilbert to remain in power as duke, Henry arranged the marriage of his daughter Gerberga to his new vassal in 42 Thus he brought that realm, which had been lost in 42 back into the kingdom as the fifth stem duchy.       The threat of Magyar raiders improved his situation, as all the dukes and nobles realized that only a strong state could defend their lands against barbarian incursions.     In 42 Henry was defeated by the Magyars in the ": null
    },
    {
        "Battle of Püchen": "battle of püchen"
    },
    {
        ", hardly escaping from being killed in battle, managing to take refuge in the town of Püchen. Thietmari Merseburgensis Episcopi Chronicon,  herausg. von Robert Holtzmann. Berlin Weidmannsche Buchhandlung, 42 p. 4242 Latin original text: Rex autem Avares sepenumero insurgentes expulit. Et cum in uno dierum hos inpari congressu ledere temptaret, victus in urbem, quae Bichni vocatur, fugit; ibique mortis periculum evadens, urbanos maiori gloria, quam hactenus haberent vel comprovinciales hodie teneant, et ad haec muneribus dignis honorat.  English translation from the Latin: The king drove away the Avars who attacked his country repeatedly. And when he once, with insufficient forces, dared to attack them, he was defeated and fled in a city, with the name Bichni Because he there escaped death, so he gave the citizens the same greater privileges than they had before, and which have no match among their countrymen until this day, and besides that, he gave them rich presents too     In 42 Magyars once again invaded East Francia and Italy. Although a sizable Magyar force was defeated near Bleiburg in the Bavarian March of Carinthia by Eberhard and the Count of Meran Menzel, W. Germany from the Earliest Period and another group was routed by Liutfried , count of Elsass , the Magyars continued raiding East Francia.     Henry, having captured a Hungarian prince, managed to arrange a ten-year truce in 42 though he agreed to pay annual tribute. By doing so he and dukes gained time to build new fortified towns and to train a new elite cavalry force. Henry built fortified settlements as a defense against Magyar and Slav invaders. In 42 Henry refused to pay the annual tribute to Magyars. When they began raiding again, Henry, with his improved army in 42 at the Battle of Riade crushed Magyars so completely, that they never returned to the northern lands of Henrys kingdom.       During the truce with the Magyars, Henry subdued the Polabian Slavs who lived on his eastern borders. In the winter of 42 he marched against the Slavic Hevelli tribes and seized their capital, Brandenburg . He then invaded the Glomacze lands on the middle Elbe river, conquering the capital Gana after a siege , and had a fortress built at Meissen . In 42 with the help of Arnulf of Bavaria, Henry entered Duchy of Bohemia and forced Duke Wenceslaus I to resume the annual payment of tribute to the king. Bohemia to the Extinction of the Premyslids, Kamil Krofta, The Cambridge Medieval History: Victory of the Papacy, Vol. VI, ed. J.R. Tanner, C.W. Previt-Orton and Z.N. Brook, , 42     Meanwhile, the Slavic Redarii had driven away their chief, captured the town of Walsleben and massacred its inhabitants. Counts Bernard and Thietmar marched against the fortress of Lenzen beyond the Elbe, and, after fierce fighting , completely routed the enemy on 42 September 42 The Lusatians and the Ukrani on the lower Oder were subdued and made tributary in 42 and 42 respectively. Gwatkin, The Cambridge Medieval History: Volume III. In conquered lands Henry did not create march administration, which was implemented by his successor Otto I.       Henry also pacified territories to the north, where the Danes had been harrying the Frisians by sea. The monk and chronicler Widukind of Corvey in his Res gestae Saxonicae reports that the Danes were subjects of Henry the Fowler. Henry incorporated into his kingdom territories held by the Wends , who together with the Danes had attacked Germany, and also conquered Schleswig in 42           As the first Saxon king of East Francia, Henry was the founder of the Ottonian dynasty . He and his descendants ruled East Francia, and later the Holy Roman Empire, from 42 until 42     Henry had two wives and at least six children.   With Hatheburg:   Thankmar – rebelled against his half-brother Otto and was killed in battle in 42   With Matilda :   Hedwig – wife of the West Francia s powerful Robertian duke Hugh the Great , mother of King Hugh Capet of West Francia   Otto I – Duke of Saxony , King of East Francia and Holy Roman Emperor . In 42 Henry married Otto to Eadgyth , daughter of king of Wessex Edward the Elder   Gerberga – wife of Duke Gilbert of Lotharingia and King Louis IV of France   Henry I – Duke of Bavaria   Bruno – Archbishop of Cologne and Duke of Lotharingia and regent of West Francia       thu   Henry returned to public attention as a character in Richard Wagner s opera, ": null
    },
    {
        "Lohengrin": "lohengrin"
    },
    {
        " , trying to gain the support of the Brabantian nobles against the Magyars. After the attempts to achieve German national unity failed with the Revolutions of 42 , Wagner strongly relied on the picture of Henry as the actual ruler of all German tribes as advocated by pan-Germanist activists like Friedrich Ludwig Jahn .     There are indications that Heinrich Himmler saw himself as the reincarnation of Henry, who was proclaimed to be the first king of Germany. Frischauer, Willi. Himmler, the Evil Genius of the Third Reich. London: Odhams, 42 pages 42–42; Kersten, Felix . The Kersten Memoirs: 42–42. New York: Macmillan, 42 page 42     Himmler travelled to Quedlinburg several times to hold a ceremony in the crypt on the anniversary of the kings death, 42 July. This started in 42 42 years after Henry died. Himmler considered him to be the first German king and declared his tomb a site of pilgrimage for Germans. In 42 the kings remains were reinterred in a new sarcophagus.       Henry the Fowler is a main character of Richard Wagner s opera ": null
    },
    {
        "Lohengrin": "lohengrin"
    },
    {
        ".   Henry the Fowler is one of two antagonists, being the end boss in the final mission of the 42 game ": null
    },
    {
        "Return to Castle Wolfenstein": "return to castle wolfenstein"
    }
]