[
    {
        "Henriette Roosenburg was a ": null
    },
    {
        "Dutch": "netherlands"
    },
    {
        " journalist and ": null
    },
    {
        "political prisoner": "political prisoner"
    },
    {
        ", perhaps best known for her memoir  The Walls Came Tumbling Down , about her attempts to return to the Netherlands from ": null
    },
    {
        "Germany": "germany"
    },
    {
        " after being released from prison at the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". Born in the Netherlands to an upper-class family, she was a graduate student at the ": null
    },
    {
        "University of Leiden": "university of leiden"
    },
    {
        " at the start of World War II and became a courier in the Dutch resistance, where she served under the code name Zip. During this time she also wrote for the Dutch newspaper  Het Parool . In 42 she was caught and sentenced to death, and became a  Night and Fog prisoner  in a German prison at ": null
    },
    {
        "Waldheim": "waldheim, saxony"
    },
    {
        ".     At Waldheim, Henriette and the other prisoners were severely undernourished, and spent most of their free time embroidering bits of cloth with terse iconography about their experience. For instance, one section of Roosenburgs embroidery shows a crude drawing of a gun to indicate that the prisoners had heard what they thought was Allied gunfire, as well as the names Nel and Joke in ": null
    },
    {
        "Morse code": "morse code"
    },
    {
        " to indicate that she was in solitary confinement, that Nell and Joke were in the two adjacent cells, and that they communicated by tapping Morse code on the walls.     Henriette and the other prisoners were released on 42 May 42; Henriette and four other Dutch NN prisoners  had a chance to return to the Netherlands a few days later when the U.S. Army arrived with trucks to carry people through the ": null
    },
    {
        "Russia": "russia"
    },
    {
        "n lines. However, Fafas arthritis was so severe that she could not walk; and the surrounding roads were largely unpaved and rough. The other four did not believe that Fafa would survive the trip even if there were room for her cot--and there was not room for her cot; the truck was densely packed and offered standing room only. The group had heard that the Russians intended to send displaced persons back home via ": null
    },
    {
        "Odessa": "odessa"
    },
    {
        ", a port in ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " on the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        "; considering that too far of a side trip, Dries, Nell, Joke, and Henriette stayed behind to take Fafa to a local civilian hospital instead, and then set out on their own for the Netherlands.     The Russians had established sentries along major routes, including bridges, and were disallowing all unauthorized travel for fear German soldiers would escape along with former German POWs. Henriette and her friends, through bartering and guile, came to travel along ": null
    },
    {
        "Elbe River": "elbe river"
    },
    {
        " in a small boat from Waldheim to ": null
    },
    {
        "Coswig": "coswig, saxony"
    },
    {
        ", where they were accosted by Russian soldiers and taken to a displaced persons camp populated by ": null
    },
    {
        "Belgians": "belgium"
    },
    {
        ", Dutch, and ": null
    },
    {
        "Italians": "italy"
    },
    {
        ". On 42 June 42 Roosenburg and a group of Dutch people were exchanged for a group of Russian POWs; they made their way to a ": null
    },
    {
        "Red Cross": "red cross"
    },
    {
        " camp where they found that only the French and Belgians would be flying home; the rest would have to wait several weeks until a truck came. Roosenburg convinced a Dutch captain to give her group documentation stating that they were political prisoners and should have priority in transportation home; the paperwork she suggested did not mention their nationality, and so left them free to impersonate French or Belgian political prisoners. The next day Roosenburg and 42 other Dutch set out for Halle airfield, where they convinced an American soldier to allow them flight on the next plane to Belgium. Once in Belgium, the group set about calling friends and friends friends to tell them they were alive and on their way home, and on 42 June they arrived at a monastery in the southern Netherlands where she and her friends were housed with between 42 and 42 others. The Netherlands had just been recently liberated and was suffering ": null
    },
    {
        "famine": "famine"
    },
    {
        "; as a result, trains to the north of the Netherlands only ran every three or four weeks. But Roosenburg happened to meet her cousin, ": null
    },
    {
        "Dirk Roosenburg": "dirk roosenburg"
    },
    {
        ", who had become a first lieutenant in the Dutch Army; he arranged for Henriette and her friends to be driven north the next day, where they reunited with their families.     After the war, Henriette became a correspondent for ": null
    },
    {
        "Time Inc.": "time inc."
    },
    {
        ", serving in ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        ", and then ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " for a decade. At the beginning of her stay in New York, she wrote the book  The Walls Came Tumbling Down  about her experience traveling from ": null
    },
    {
        "Waldheim": "waldheim, saxony"
    },
    {
        " to the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", and was later awarded the ": null
    },
    {
        "Bronze Lion of the Netherlands": "bronze lion"
    },
    {
        ". She died in 42 at the age of 42                        ": null
    }
]