[
    {
        "              Henry VII  was the ": null
    },
    {
        "King of England": "king of england"
    },
    {
        " and ": null
    },
    {
        "Lord of Ireland": "lord of ireland"
    },
    {
        " from his seizure of the crown on 22 August 1485 to his death. He was the first monarch of the ": null
    },
    {
        "House of Tudor": "house of tudor"
    },
    {
        ".     Henry attained the throne when his forces defeated King ": null
    },
    {
        "Richard III": "richard iii"
    },
    {
        " at the ": null
    },
    {
        "Battle of Bosworth Field": "battle of bosworth field"
    },
    {
        ", the culmination of the ": null
    },
    {
        "Wars of the Roses": "wars of the roses"
    },
    {
        ". He was the last king of England to win his throne on the field of battle. He cemented his claim by marrying ": null
    },
    {
        "Elizabeth of York": "elizabeth of york"
    },
    {
        ", daughter of Richards brother ": null
    },
    {
        "Edward IV": "edward iv"
    },
    {
        ". Henry was successful in restoring the power and stability of the English monarchy after the civil war.     Henry is credited with a number of administrative, economic and diplomatic initiatives. His ": null
    },
    {
        "supportive policy": "trade agreements"
    },
    {
        " toward ": null
    },
    {
        "Englands": "england"
    },
    {
        "wool industry and his standoff with the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        " had long-lasting benefit to the whole English economy. He paid very close attention to detail, and instead of spending lavishly he concentrated on raising new revenues. New taxes stabilised the governments finances, although a commission after his death found widespread abuses in the tax collection process. After a reign of nearly 24 years, he was peacefully succeeded by his son, ": null
    },
    {
        "Henry VIII": "henry viii"
    },
    {
        ".       Henry VII was born at ": null
    },
    {
        "Pembroke Castle": "pembroke castle"
    },
    {
        " on 28 January 1457 to ": null
    },
    {
        "Margaret Beaufort, Countess of Richmond": "lady margaret beaufort"
    },
    {
        ". His father, ": null
    },
    {
        "Edmund Tudor, 1st Earl of Richmond": "edmund tudor, 1st earl of richmond"
    },
    {
        ", died three months before his birth. Caroline Rogers and Roger Turvey, Henry VII, London: Hodder Murray, 2005     Henrys paternal grandfather, ": null
    },
    {
        "Owen Tudor": "owen tudor"
    },
    {
        ", originally from the ": null
    },
    {
        "Tudors of Penmynydd": "tudors of penmynydd"
    },
    {
        ", Isle of ": null
    },
    {
        "Anglesey": "anglesey"
    },
    {
        " in Wales, had been a page in the court of ": null
    },
    {
        "Henry V": "henry v of england"
    },
    {
        ". He rose to become one of the Squires to the Body to the King after military service at the ": null
    },
    {
        "Battle of Agincourt": "battle of agincourt"
    },
    {
        ".  Owen is said to have secretly married the widow of Henry V, ": null
    },
    {
        "Catherine of Valois": "catherine of valois"
    },
    {
        ". One of their sons was Edmund Tudor, father of Henry VII. Edmund was created ": null
    },
    {
        "Earl of Richmond": "earl of richmond"
    },
    {
        " in 1452, and formally declared legitimate by Parliament .      Henrys main claim to the English throne derived from his mother through the ": null
    },
    {
        "House of Beaufort": "house of beaufort"
    },
    {
        ". Henrys mother, Lady Margaret Beaufort, was a great-granddaughter of ": null
    },
    {
        "John of Gaunt": "john of gaunt, 1st duke of lancaster"
    },
    {
        ", Duke of Lancaster, fourth son of ": null
    },
    {
        "Edward III": "edward iii of england"
    },
    {
        ", and his third wife ": null
    },
    {
        "Katherine Swynford": "katherine swynford"
    },
    {
        ". Katherine was Gaunts mistress for about 25 years. When they married in 1396 they already had four children, including Henrys great-grandfather ": null
    },
    {
        "John Beaufort": "john beaufort, 1st earl of somerset"
    },
    {
        ". Thus, Henrys claim was somewhat tenuous; it was from a woman, and by illegitimate descent. In theory, the Portuguese and Castilian royal families had a better claim as descendants of ": null
    },
    {
        "Catherine of Lancaster": "catherine of lancaster"
    },
    {
        ", the daughter of John of Gaunt and his second wife ": null
    },
    {
        "Constance of Castile": "constance of castile, duchess of lancaster"
    },
    {
        ".     Gaunts nephew ": null
    },
    {
        "Richard II": "richard ii of england"
    },
    {
        " legitimised Gaunts children by Katherine Swynford by ": null
    },
    {
        "Letters Patent": "letters patent"
    },
    {
        " in 1397. In 1407, ": null
    },
    {
        "Henry IV": "henry iv of england"
    },
    {
        ", Gaunts son by his first wife, issued new Letters Patent confirming the legitimacy of his half-siblings, but also declaring them ineligible for the throne.  Henry IVs action was of doubtful legality, as the Beauforts were previously legitimised by an ": null
    },
    {
        "Act of Parliament": "act of parliament"
    },
    {
        ", but it further weakened Henrys claim.     Nonetheless, by 1483 Henry was the senior male ": null
    },
    {
        "Lancastrian": "house of lancaster"
    },
    {
        " claimant remaining after the deaths in battle, by murder or execution of ": null
    },
    {
        "Henry VI": "henry vi of england"
    },
    {
        ", his son ": null
    },
    {
        "Edward of Westminster, Prince of Wales": "edward of westminster, prince of wales"
    },
    {
        ", and the other Beaufort line of descent through Lady Margarets uncle, the ": null
    },
    {
        "2nd Duke of Somerset": "edmund beaufort, 2nd duke of somerset"
    },
    {
        ".     Henry also made some political capital out of his Welsh ancestry in attracting military support and safeguarding his armys passage through Wales on its way to the Battle of Bosworth.   He came from an old, established Anglesey family that claimed descent from ": null
    },
    {
        "Cadwaladr": "cadwaladr"
    },
    {
        ", in legend, the last ancient British king,  and on occasion Henry displayed the red dragon of Cadwaladr. He took it, as well as the standard of ": null
    },
    {
        "St George": "st georges cross"
    },
    {
        ", on his procession through London after the victory at Bosworth.  A contemporary writer and Henrys biographer, ": null
    },
    {
        "Bernard André": "bernard andré"
    },
    {
        ", also made much of Henrys Welsh descent.     In reality, his hereditary connections to Welsh aristocracy were not strong. He was descended by the paternal line, through several generations, from ": null
    },
    {
        "Ednyfed Fychan": "ednyfed fychan"
    },
    {
        ", the seneschal of Gwynedd and through this seneschals wife from ": null
    },
    {
        "Rhys ap Tewdwr": "rhys ap tewdwr"
    },
    {
        ", the King of ": null
    },
    {
        "Deheubarth": "deheubarth"
    },
    {
        " in South Wales.    His more immediate ancestor, Tudur ap Goronwy, had aristocratic land rights, but his sons, who were first cousins to ": null
    },
    {
        "Owain Glyndŵr": "owain glyndŵr"
    },
    {
        ", sided with Owain in his revolt. One son was executed and the family land was forfeited. Another son, Henrys great-grandfather, became a butler to the Bishop of Bangor. Owen Tudor, the son of the butler, like the children of other rebels, was provided for by Henry V, a circumstance that precipitated his access to Queen Catherine of Valois.  Notwithstanding this lineage, to the bards of Wales, Henry was a candidate for ": null
    },
    {
        "Y Mab Darogan": "y mab darogan"
    },
    {
        ", The Son of Prophecy who would free the Welsh from oppression.        In 1456, Henrys father Edmund Tudor was captured while fighting for ": null
    },
    {
        "Henry VI": "henry vi of england"
    },
    {
        " in South Wales against the ": null
    },
    {
        "Yorkists": "house of york"
    },
    {
        ". He died in ": null
    },
    {
        "Carmarthen Castle": "carmarthen castle"
    },
    {
        ", three months before Henry was born. Henrys uncle ": null
    },
    {
        "Jasper Tudor": "jasper tudor"
    },
    {
        ", the Earl of Pembroke and Edmunds younger brother, undertook to protect the young widow, who was 13 years old when she gave birth to Henry.  When ": null
    },
    {
        "Edward IV": "edward iv of england"
    },
    {
        " became King in 1461, Jasper Tudor went into exile abroad. Pembroke Castle, and later the ": null
    },
    {
        "Earldom of Pembroke": "earl of pembroke"
    },
    {
        ", were granted to the Yorkist ": null
    },
    {
        "William Herbert": "william herbert, 1st earl of pembroke"
    },
    {
        ", who also assumed the guardianship of Margaret Beaufort and the young Henry.      Henry lived in the Herbert household until 1469, when ": null
    },
    {
        "Richard Neville, Earl of Warwick": "richard neville, earl of warwick"
    },
    {
        " , went over to the Lancastrians. Herbert was captured fighting for the Yorkists and executed by Warwick.  When Warwick restored Henry VI in 1470, Jasper Tudor returned from exile and brought Henry to court. When the Yorkist ": null
    },
    {
        "Edward IV": "edward iv of england"
    },
    {
        " regained the throne in 1471, Henry fled with other Lancastrians to ": null
    },
    {
        "Brittany": "brittany"
    },
    {
        ", where he spent most of the next 14 years under the protection of ": null
    },
    {
        "Francis II, Duke of Brittany": "francis ii, duke of brittany"
    },
    {
        ". In November 1476, Henrys protector fell ill and his principal advisers were more amenable to negotiating with the English king. Henry was handed over and escorted to the Breton port of Saint-Malo. While there, he feigned stomach cramps and in the confusion fled into a monastery. Following the ": null
    },
    {
        "Battle of Tewkesbury": "battle of tewkesbury"
    },
    {
        " in 1471, Edward IV prepared to order Henrys extraction and probable execution. The townspeople took exception to his behaviour and Francis recovered from his illness. Thus, a small band of scouts rescued Henry.          By 1483, Henrys mother was actively promoting him as an alternative to ": null
    },
    {
        "Richard III": "richard iii of england"
    },
    {
        ", despite her being married to ": null
    },
    {
        "Lord Stanley": "thomas stanley, 1st earl of derby"
    },
    {
        ", a Yorkist. At ": null
    },
    {
        "Rennes Cathedral": "rennes cathedral"
    },
    {
        " on Christmas Day 1483, Henry pledged to marry ": null
    },
    {
        "Elizabeth of York": "elizabeth of york"
    },
    {
        ", the eldest daughter of Edward IV, who was also Edwards heir since the presumed death of her brothers, the ": null
    },
    {
        "Princes in the Tower": "princes in the tower"
    },
    {
        ", King ": null
    },
    {
        "Edward V": "edward v of england"
    },
    {
        " and his brother ": null
    },
    {
        "Richard of Shrewsbury, Duke of York": "richard of shrewsbury, duke of york"
    },
    {
        ". S. B. Chrimes, Henry VII p. 65. With money and supplies borrowed from his host, ": null
    },
    {
        "Francis II, Duke of Brittany": "francis ii, duke of brittany"
    },
    {
        ", Henry tried to land in England, but his conspiracy unravelled resulting in the execution of his primary co-conspirator, the ": null
    },
    {
        "Duke of Buckingham": "henry stafford, 2nd duke of buckingham"
    },
    {
        ".  Now supported by Francis IIs prime-minister, ": null
    },
    {
        "Pierre Landais": "pierre landais"
    },
    {
        ", Richard III attempted to extradite Henry from Brittany, but Henry escaped to France.  He was welcomed by the French, who readily supplied him with troops and equipment for a second invasion.     Henry gained the support of the Woodvilles, in-laws of the late Edward IV, and sailed with a small French and Scottish force, landing at Mill Bay near ": null
    },
    {
        "Dale, Pembrokeshire": "dale, pembrokeshire"
    },
    {
        ".  He marched toward England accompanied by his uncle Jasper and the ": null
    },
    {
        "Earl of Oxford": "john de vere, 13th earl of oxford"
    },
    {
        ". Wales was traditionally a Lancastrian stronghold, and Henry owed the support he gathered to his Welsh birth and ancestry, being directly descended, through his father, from ": null
    },
    {
        "Rhys ap Gruffydd": "rhys ap gruffydd"
    },
    {
        ". Henrys return to Wales was regarded by some as the fulfilment of a Messianic prophecy.  He amassed an army of about 5,000 soldiers.  Estimates of the size of Henrys army at Bosworth vary. , gives a figure of perhaps 6,000.     Henry devised a plan to seize the throne by engaging Richard quickly because Richard had reinforcements in ": null
    },
    {
        "Nottingham": "nottingham"
    },
    {
        " and ": null
    },
    {
        "Leicester": "leicester"
    },
    {
        ". Though outnumbered, Henrys Lancastrian forces decisively defeated Richards Yorkist army at the ": null
    },
    {
        "Battle of Bosworth Field": "battle of bosworth field"
    },
    {
        " on 22 August 1485. Several of Richards key allies, such as the ": null
    },
    {
        "Earl of Northumberland": "henry percy, 4th earl of northumberland"
    },
    {
        " and ": null
    },
    {
        "William": "william stanley"
    },
    {
        " and ": null
    },
    {
        "Thomas": "thomas stanley, 1st earl of derby"
    },
    {
        " Stanley, crucially switched sides or left the battlefield. Richard IIIs death at Bosworth Field effectively ended the Wars of the Roses.                As king, Henry was styled by the Grace of God, King of England and France and Lord of Ireland. On his succession, Henry became entitled to bear the ": null
    },
    {
        "Royal Arms of England": "royal arms of england"
    },
    {
        ". After his marriage, Henry used as his emblem the red and white rose, which became known as the ": null
    },
    {
        "Tudor rose": "tudor rose"
    },
    {
        ".     To secure his hold on the throne, Henry declared himself king by ": null
    },
    {
        "right of conquest": "right of conquest"
    },
    {
        " retroactively from 21 August 1485, the day before Bosworth Field. S. B. Chrimes, Henry VII, p. 50. Thus, anyone who had fought for Richard against him would be guilty of ": null
    },
    {
        "treason": "treason act 1495"
    },
    {
        " and Henry could legally confiscate the lands and property of Richard III, while restoring his own. Henry spared Richards nephew and designated heir, the ": null
    },
    {
        "Earl of Lincoln": "john de la pole, earl of lincoln"
    },
    {
        ", and made ": null
    },
    {
        "Margaret Plantagenet": "margaret pole, countess of salisbury"
    },
    {
        ", a Yorkist heiress, ": null
    },
    {
        "Countess of Salisbury": "margaret pole, countess of salisbury"
    },
    {
        " sui juris": "sui iuris"
    },
    {
        ". He took care not to address the ": null
    },
    {
        "baronage": "baronage"
    },
    {
        " or summon ": null
    },
    {
        "Parliament": "parliament of england"
    },
    {
        " until after his coronation, which took place in ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " on 30 October 1485.  After his coronation Henry issued an edict that any gentleman who swore fealty to him would, notwithstanding any previous attainder, be secure in his property and person.     Henry honoured his pledge of December 1483 to marry Elizabeth of York. S. B. Chrimes, Henry VII, p. 53. They were third cousins, as both were great-great-grandchildren of John of Gaunt. Genealogical tables in  Henry and Elizabeth were married on 18 January 1486 at Westminster Abbey. The marriage unified the warring houses and gave his children a strong claim to the throne. The unification of the houses of York and Lancaster by this marriage is symbolised by the heraldic emblem of the ": null
    },
    {
        "Tudor rose": "tudor rose"
    },
    {
        ", a combination of the white rose of York and the red rose of Lancaster. It also ended future discussion as to whether the descendants of the fourth son of Edward III, ": null
    },
    {
        "Edmund, Duke of York": "edmund of langley, 1st duke of york"
    },
    {
        ", through marriage to Philippa, heiress of the second son, ": null
    },
    {
        "Lionel, Duke of Clarence": "lionel of antwerp, 1st duke of clarence"
    },
    {
        ", had a superior or inferior claim to those of the third son ": null
    },
    {
        "John of Gaunt": "john of gaunt, 1st duke of lancaster"
    },
    {
        ", who had held the throne for three generations.   In addition, Henry had Parliament repeal  Titulus Regius , the statute that declared Edward IVs marriage invalid and his children illegitimate, thus legitimising his wife. Amateur historians ": null
    },
    {
        "Bertram Fields": "bertram fields"
    },
    {
        " and ": null
    },
    {
        "Sir Clements Markham": "sir clements markham"
    },
    {
        " have claimed that he may have been involved in the murder of the Princes in the Tower, as the repeal of Titulus Regius gave the Princes a stronger claim to the throne than his own. ": null
    },
    {
        "Alison Weir": "alison weir"
    },
    {
        ", however, points out that the Rennes ceremony, two years earlier, was possible only if Henry and his supporters were certain that the Princes were already dead. Weir, Alison. The Princes in the Tower, p. 190     Henry secured his crown principally by dividing and undermining the power of the nobility, especially through the aggressive use of bonds and recognisances to secure loyalty. He also enacted laws against ": null
    },
    {
        "livery and maintenance": "bastard feudalism"
    },
    {
        ", the great lords practice of having large numbers of retainers who wore their lords badge or uniform and formed a potential private army.     While he was still in Leicester, after the battle of Bosworth Field, Henry was already taking precautions to prevent any rebellions against his reign. Before leaving Leicester to go to London, Henry dispatched ": null
    },
    {
        "Robert Willoughby": "robert willoughby, 1st baron willoughby de broke"
    },
    {
        " to Sheriff Hutton in Yorkshire, to have the ten-year-old ": null
    },
    {
        "Edward, Earl of Warwick": "edward, earl of warwick"
    },
    {
        " arrested and taken to the Tower of London. S. B. Chrimes, Henry VII, p. 51. Edward was the son of George, Duke of Clarence, and as such he presented a threat as a potential rival to the new King Henry VII for the throne of England. However, Henry was threatened by several active rebellions over the next few years. The first was the rebellion of the ": null
    },
    {
        "Stafford brothers": "stafford and lovell rebellion"
    },
    {
        " and ": null
    },
    {
        "Viscount Lovell": "francis lovell, 1st viscount lovell"
    },
    {
        " of 1486, which collapsed without fighting. S. B. Chrimes, Henry VII, p. 69.     In 1487, Yorkists led by Lincoln rebelled in support of ": null
    },
    {
        "Lambert Simnel": "lambert simnel"
    },
    {
        ", a boy who was claimed to be the ": null
    },
    {
        "Earl of Warwick": "edward plantagenet, 17th earl of warwick"
    },
    {
        ", S. B. Chrimes, Henry VII, p. 72. son of Edward IVs brother ": null
    },
    {
        "Clarence": "george plantagenet, 1st duke of clarence"
    },
    {
        " . The rebellion began in ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", where the traditionally Yorkist nobility, headed by the powerful ": null
    },
    {
        "Gerald FitzGerald, 8th Earl of Kildare": "gerald fitzgerald, 8th earl of kildare"
    },
    {
        ", proclaimed Simnel king and provided troops for his invasion of England. The rebellion was defeated and Lincoln killed at the ": null
    },
    {
        "Battle of Stoke": "battle of stoke"
    },
    {
        ". Henry showed remarkable clemency to the surviving rebels: he pardoned Kildare and the other Irish nobles, and he made the boy, Simnel, a servant in the royal kitchen.      In 1490, a young ": null
    },
    {
        "Fleming": "flemish people"
    },
    {
        ", ": null
    },
    {
        "Perkin Warbeck": "perkin warbeck"
    },
    {
        ", appeared and claimed to be ": null
    },
    {
        "Richard": "richard of shrewsbury, 1st duke of york"
    },
    {
        ", the younger of the Princes in the Tower . Warbeck won the support of Edward IVs sister ": null
    },
    {
        "Margaret of Burgundy": "margaret of york"
    },
    {
        ". He led attempted invasions of Ireland in 1491 and England in 1495, and persuaded ": null
    },
    {
        "James IV of Scotland": "james iv of scotland"
    },
    {
        " to invade England in 1496. In 1497 Warbeck landed in ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        " with a few thousand troops, but was soon captured and executed. S. B. Chrimes, Henry VII, pp. 69–70.     In 1499, Henry had the Earl of Warwick executed. However, he spared Warwicks elder sister ": null
    },
    {
        "Margaret": "margaret pole, 8th countess of salisbury"
    },
    {
        ". She survived until 1541, when she was executed by Henry VIII.     Henry married Elizabeth of York with the hope of uniting the Yorkist and Lancastrian sides of the Plantagenet dynastic disputes, and he was largely successful. However, such a level of paranoia persisted that anyone with blood ties to the Plantagenets was suspected of coveting the throne. Penn 2011, pp. 22–23.            For most of Henry VIIs reign ": null
    },
    {
        "Edward Story": "edward story"
    },
    {
        " was ": null
    },
    {
        "Bishop of Chichester": "bishop of chichester"
    },
    {
        ". Storys register still exists and, according to the 19th-century historian W.R.W. Stephens, affords some illustrations of the avaricious and parsimonious character of the king . It seems that the king was skillful at extracting money from his subjects on many pretexts, including that of war with France or war with Scotland. The money so extracted added to the kings personal fortune rather than being used for the stated purpose. Stephens. Memorials of the South Saxon See and Cathedral Church of Chichester. pp. 176–177     Unlike his predecessors, Henry VII came to the throne without personal experience in estate management or financial administration. S. B. Chimes, Henry VII p. 119. But during his reign he became a fiscally prudent monarch who restored the fortunes of an effectively bankrupt ": null
    },
    {
        "exchequer": "exchequer"
    },
    {
        ". Henry VII introduced stability to the financial administration of England by keeping the same financial advisors throughout his reign. For instance, except for the first few months of the reign, ": null
    },
    {
        "Lord Dynham": "john dynham, 1st baron dynham"
    },
    {
        " and ": null
    },
    {
        "Thomas Howard, 2nd Duke of Norfolk": "thomas howard, 2nd duke of norfolk"
    },
    {
        " were the only two office holders in the position of ": null
    },
    {
        "Lord High Treasurer": "lord high treasurer"
    },
    {
        " of England throughout his reign. S. B. Chrimes, Henry VII, p. 121     Henry VII improved tax collection within the realm by introducing ruthlessly efficient mechanisms of taxation. He was supported in this effort by his chancellor, Archbishop ": null
    },
    {
        "John Morton": "john morton"
    },
    {
        ", whose ": null
    },
    {
        "Mortons Fork": "mortons fork"
    },
    {
        " was a ": null
    },
    {
        "catch-22": "catch-22"
    },
    {
        " method of ensuring that nobles paid increased taxes: those nobles who spent little must have saved much, and thus they could afford the increased taxes; on the other hand, those nobles who spent much obviously had the means to pay the increased taxes. S. B. Chrimes, Henry VII, p. 203. Royal government was also reformed with the introduction of the ": null
    },
    {
        "Kings Council": "kings council"
    },
    {
        " that kept the nobility in check.     The capriciousness and lack of due process that indebted many would tarnish his legacy and were soon ended upon Henry VIIs death, after a commission revealed widespread abuses. Thomas Penn. Winter King – Henry VII and The Dawn of Tudor England. p. 371. Simon & Schuster, 2011.  According to the contemporary historian ": null
    },
    {
        "Polydore Vergil": "polydore vergil"
    },
    {
        ", simple greed underscored the means by which royal control was over-asserted in Henrys final years.    Henry VIII executed ": null
    },
    {
        "Richard Empson": "richard empson"
    },
    {
        " and ": null
    },
    {
        "Edmund Dudley": "edmund dudley"
    },
    {
        ", his two most hated tax collectors, on trumped-up charges of treason.      He established the ": null
    },
    {
        "pound": "pound"
    },
    {
        " avoirdupois": "avoirdupois"
    },
    {
        " as a standard of weight; it later became part of the ": null
    },
    {
        "Imperial": "imperial units"
    },
    {
        "    and ": null
    },
    {
        "customary": "united states customary units"
    },
    {
        " systems of units.          Henry VIIs policy was both to maintain peace and to create economic prosperity. Up to a point, he succeeded. He was not a military man and had no interest in trying to regain French territories lost during the reigns of his predecessors; he was therefore ready to conclude a treaty with France at Etaples that brought money into the coffers of England, and ensured the French would not support pretenders to the English throne, such as Perkin Warbeck. However, this treaty came at a slight price, as Henry mounted a minor invasion of Brittany in November 1492. Henry decided to keep Brittany out of French hands, signed an alliance with Spain to that end, and sent 6,000 troops to France. The confused, fractious nature of Breton politics undermined his efforts, which finally failed after three sizeable expeditions, at a cost of £24,000. However, as France was becoming more concerned with the ": null
    },
    {
        "Italian Wars": "italian wars"
    },
    {
        ", the French were happy to agree to the ": null
    },
    {
        "Treaty of Etaples": "treaty of etaples"
    },
    {
        ". John M. Currin, The Kings Army into the Partes of Bretaigne: Henry VII and the Breton Wars, 1489–1491, War in History, Nov 2000, Vol. 7 Issue 4, p379-412 Henry had pressured the French by ": null
    },
    {
        "laying siege to Boulogne": "siege of boulogne"
    },
    {
        " in October 1492.        Henry had been under the financial and physical protection of the French throne or its vassals for most of his life, before he became king. To strengthen his position, however, he subsidised shipbuilding, so strengthening the ": null
    },
    {
        "navy": "the tudors and the royal navy"
    },
    {
        "  and improving trading opportunities.     Henry VII was one of the first European monarchs to recognise the importance of the newly united Spanish kingdom; he concluded the ": null
    },
    {
        "Treaty of Medina del Campo": "treaty of medina del campo"
    },
    {
        ", by which his son, ": null
    },
    {
        "Arthur Tudor": "arthur tudor"
    },
    {
        ", was married to ": null
    },
    {
        "Catherine of Aragon": "catherine of aragon"
    },
    {
        ". He also concluded the ": null
    },
    {
        "Treaty of Perpetual Peace": "treaty of perpetual peace"
    },
    {
        " with Scotland , which betrothed his daughter Margaret to King James IV of Scotland. By this marriage, Henry VII hoped to break the ": null
    },
    {
        "Auld Alliance": "auld alliance"
    },
    {
        " between Scotland and France. Though this was not achieved during his reign, the marriage eventually led to the union of the English and Scottish crowns under Margarets great-grandson, ": null
    },
    {
        "James VI and I": "james vi and i"
    },
    {
        ", following the death of Henrys granddaughter ": null
    },
    {
        "Elizabeth I": "elizabeth i"
    },
    {
        ".     He also formed an alliance with Holy Roman Emperor ": null
    },
    {
        "Maximilian I": "maximilian i, holy roman emperor"
    },
    {
        " and persuaded ": null
    },
    {
        "Pope Innocent VIII": "pope innocent viii"
    },
    {
        " to issue a ": null
    },
    {
        "papal bull": "papal bull"
    },
    {
        " of ": null
    },
    {
        "excommunication": "excommunication"
    },
    {
        " against all pretenders to Henrys throne.         Henry VII was much enriched by trading ": null
    },
    {
        "alum": "alum"
    },
    {
        ", which was used in the wool and cloth trades as a ": null
    },
    {
        "chemical": "chemical"
    },
    {
        " fixative": "dye fixative"
    },
    {
        " for ": null
    },
    {
        "dye": "dye"
    },
    {
        "ing ": null
    },
    {
        "fabric": "fabric"
    },
    {
        "s. Penn 2011, p. 201 Since alum was mined in only one area in Europe , it was a scarce commodity and therefore especially valuable to its land holder, the pope. With the English economy heavily invested in wool production, Henry VII became involved in the alum trade in 1486. With the assistance of the Italian merchant banker Lodovico della Fava and the Italian banker Girolamo Frescobaldi, Henry VII became deeply involved in the trade by licensing ships, obtaining alum from the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", and selling it to the Low Countries and in England. Penn 2011, pp. 203–204. This trade made an expensive commodity cheaper, which raised opposition from ": null
    },
    {
        "Pope Julius II": "pope julius ii"
    },
    {
        ", since the Tolfa mine was a part of papal territory and had given the Pope monopoly control over alum.     Henrys most successful diplomatic achievement as regards the economy was the  Magnus Intercursus  of 1496. In 1494, Henry embargoed trade with the ": null
    },
    {
        "Netherlands": "burgundian netherlands"
    },
    {
        " in retaliation for Margaret of Burgundys support for Perkin Warbeck. The ": null
    },
    {
        "Merchant Adventurers": "company of merchant adventurers of london"
    },
    {
        ", the company which enjoyed the monopoly of the Flemish wool trade, relocated from ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " to ": null
    },
    {
        "Calais": "calais"
    },
    {
        ". At the same time, Flemish merchants were ejected from England. The stand-off eventually paid off for Henry. Both parties realised they were mutually disadvantaged by the reduction in commerce. Its restoration by the Magnus Intercursus was very much to Englands benefit in removing taxation for English merchants and significantly increasing Englands wealth. In turn, Antwerp became an extremely important trade ": null
    },
    {
        "entrepôt": "entrepôt"
    },
    {
        " , through which, for example, goods from the Baltic, spices from the east and Italian silks were exchanged for English cloth.      In 1506, Henry extorted the Treaty of Windsor from ": null
    },
    {
        "Philip the Handsome of Burgundy": "philip i of castile"
    },
    {
        ". Philip had been shipwrecked on the English coast, and while Henrys guest, was bullied into an agreement so favourable to England at the expense of the Netherlands that it was dubbed the  Malus Intercursus  . France, ": null
    },
    {
        "Burgundy": "burgundian netherlands"
    },
    {
        ", the Holy Roman Empire, Spain and the ": null
    },
    {
        "Hanseatic League": "hanseatic league"
    },
    {
        " all rejected the treaty, which was never in force. Philip died shortly after the negotiations.        Henrys principal problem was to restore royal authority in a realm recovering from the Wars of the Roses. There were too many powerful noblemen and, as a consequence of the system of so-called ": null
    },
    {
        "bastard feudalism": "bastard feudalism"
    },
    {
        ", each had what amounted to private armies of indentured retainers .        He was content to allow the nobles their regional influence if they were loyal to him. For instance, the Stanley family had control of Lancashire and Cheshire, upholding the peace on the condition that they stayed within the law. In other cases, he brought his over-powerful subjects to heel by decree. He passed laws against livery and maintenance . These laws were used shrewdly in levying fines upon those that he perceived as threats.     However, his principal weapon was the ": null
    },
    {
        "Court of Star Chamber": "court of star chamber"
    },
    {
        ". This revived an earlier practice of using a small group of the ": null
    },
    {
        "Privy Council": "privy council"
    },
    {
        " as a personal or Prerogative Court, able to cut through the cumbersome legal system and act swiftly. Serious disputes involving the use of personal power, or threats to royal authority, were thus dealt with.      Henry VII used ": null
    },
    {
        "Justices of the Peace": "justices of the peace"
    },
    {
        " on a large, nationwide scale. They were appointed for every shire and served for a year at a time. Their chief task was to see that the laws of the country were obeyed in their area. Their powers and numbers steadily increased during the time of the Tudors, never more so than under Henrys reign.  Despite this, Henry was keen to constrain their power and influence, applying the same principles to the Justices of the Peace as he did to the nobility: a similar system of bonds and recognisances to that which applied to both the gentry and the nobles who tried to exert their elevated influence over these local officials.     All Acts of Parliament were overseen by the Justices of the Peace. For example, Justices of the Peace could replace suspect jurors in accordance with the 1495 act preventing the corruption of juries. They were also in charge of various administrative duties, such as the checking of weights and measures.     By 1509, Justices of the Peace were key enforcers of law and order for Henry VII. They were unpaid, which, in comparison with modern standards, meant a lesser tax bill to pay for a police force. Local gentry saw the office as one of local influence and prestige and were therefore willing to serve. Overall, this was a successful area of policy for Henry, both in terms of efficiency and as a method of reducing the corruption endemic within the nobility of the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ".               In 1502, Henry VIIs first son and heir apparent, ": null
    },
    {
        "Arthur, Prince of Wales": "arthur, prince of wales"
    },
    {
        ", died suddenly at ": null
    },
    {
        "Ludlow Castle": "ludlow castle"
    },
    {
        ", very likely from a viral respiratory illness known at the time as the ": null
    },
    {
        "English sweating sickness": "english sweating sickness"
    },
    {
        " . Penn 2011, p. 70. This made Henry, Duke of York  heir apparent to the throne. The King, normally a reserved man who rarely showed much emotion in public unless angry, surprised his courtiers by his intense grief and sobbing at his sons death, while his concern for the Queen is evidence that the marriage was a happy one, as is his reaction to the Queens death the following year, when he shut himself away for several days, refusing to speak to anyone. Chrimes Henry VII pp. 302–4     Henry VII wanted to maintain the Spanish alliance. He therefore arranged a ": null
    },
    {
        "papal dispensation": "papal dispensation"
    },
    {
        " from ": null
    },
    {
        "Pope Julius II": "pope julius ii"
    },
    {
        " for Prince Henry to marry his brothers widow Catherine, a relationship that would have otherwise precluded marriage in the Roman Catholic Church. In 1503, Queen Elizabeth died in childbirth, so King Henry had the dispensation also permit him to marry Catherine himself. After obtaining the dispensation, Henry had second thoughts about the marriage of his son and Catherine. Catherines mother ": null
    },
    {
        "Isabella I of Castile": "isabella i of castile"
    },
    {
        " had died and Catherines sister ": null
    },
    {
        "Joanna": "joanna of castile"
    },
    {
        " had succeeded her; Catherine was therefore daughter of only one reigning monarch and so less desirable as a spouse for Henry VIIs heir-apparent. The marriage did not take place during his lifetime. Otherwise, at the time of his fathers arranging of the marriage to Catherine of Aragon, the future Henry VIII was too young to contract the marriage according to Canon Law, and would be ineligible until age fourteen.      Henry made half-hearted plans to remarry and beget more heirs, but these never came to anything. In 1505 he was sufficiently interested in a potential marriage to ": null
    },
    {
        "Joan": "joan of naples"
    },
    {
        ", the recently widowed Queen of Naples, that he sent ambassadors to Naples to report on the 27-year-olds physical suitability. Schwarz, Arthur L.,  , p. 58 Henrys Father Searches for a New Wife . The wedding never took place, and the physical description Henry sent with his ambassadors of what he desired in a new wife matched the description of ": null
    },
    {
        "Elizabeth": "elizabeth of york"
    },
    {
        ". After 1503, records show the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        " was never again used as a royal residence by Henry Tudor, and all royal births under ": null
    },
    {
        "Henry VIII": "henry viii of england"
    },
    {
        " took place in palaces. Henry VII was shattered by the loss of Elizabeth, and her death broke his heart.   During his lifetime the nobility often jeered him for re-centralizing power in London, and later the 16th-century historian ": null
    },
    {
        "Francis Bacon": "francis bacon"
    },
    {
        " was ruthlessly critical of the methods by which he enforced tax law, but it is equally true that Henry Tudor was hellbent on keeping detailed records of his personal finances, down to the last halfpenny;  these and one account book detailing the expenses of his queen survive in the British National Archives. Until the death of his wife, the evidence is clear from these accounting books that Henry Tudor was a more doting father and husband than was widely known. Many of the entries show a man who loosened his purse strings generously for his wife and children, and not just on necessities: in spring 1491 he spent a great amount of gold on a lute for his daughter Mary; the following year he spent money on a lion for Elizabeths menagerie.     With Elizabeths death, the possibilities for such family indulgences greatly diminished.  Immediately afterward, Henry became very sick and nearly died himself, allowing only ": null
    },
    {
        "Margaret Beaufort": "margaret beaufort, countess of richmond and derby"
    },
    {
        ", his mother, near him: privily departed to a solitary place, and would that no man should resort unto him. Chrimes Henry VII p. 304      Henry VII died of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " at ": null
    },
    {
        "Richmond Palace": "richmond palace"
    },
    {
        " on 21 April 1509, and was buried at ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        ", next to his wife, Elizabeth, in the chapel he commissioned. S.B. Chrimes, Henry VII, 313, 314 n5 He was succeeded by his second son, ": null
    },
    {
        "Henry VIII": "henry viii of england"
    },
    {
        " . His mother survived him, but died two months later on 29 June 1509.       Henry is the first English king of whose appearance good contemporary visual records in realistic portraits exist that are relatively free of idealization. At 27, he was tall and slender, with small blue eyes, which were said to have a noticeable animation of expression, and noticeably bad teeth in a long, sallow face beneath very fair hair. Amiable and high-spirited, Henry was friendly if dignified in manner, and it was clear to everyone that he was extremely intelligent. His biographer, Professor Chrimes, credits him – even before he had become king – with a high degree of personal magnetism, ability to inspire confidence, and a growing reputation for shrewd decisiveness . On the debit side, he may have looked a little delicate as he suffered from poor health. Chrimes, Henry VII p. 53 Desmond Seward, The Wars of the Roses pg 318          Historians have always compared Henry VII with his continental contemporaries, especially Louis XI of France and Ferdinand II of Aragon. By 1600 historians emphasised Henrys wisdom in drawing lessons in statecraft from other monarchs. In 1622 ": null
    },
    {
        "Francis Bacon": "francis bacon"
    },
    {
        " published his  History of the Reign of King Henry VII . By 1900 the ": null
    },
    {
        " New Monarchy ": "new monarchs"
    },
    {
        " interpretation stressed the common factors that in each country led to the revival of monarchical power. This approach raised puzzling questions about similarities and differences in the development of national states. In the late 20th century a model of European state formation was prominent in which Henry less resembles Louis and Ferdinand. Steven Gunn, Politic history, New Monarchy and state formation: Henry VII in European perspective, Historical Research, ": null
    },
    {
        "Arthur Tudor": "arthur, prince of wales"
    },
    {
        ", ": null
    },
    {
        "Prince of Wales": "prince of wales"
    },
    {
        ", eldest son, first husband of ": null
    },
    {
        "Catherine of Aragon": "catherine of aragon"
    },
    {
        " Margaret Tudor": "margaret tudor"
    },
    {
        ", eldest daughter, wife of King ": null
    },
    {
        "James IV of Scotland": "james iv of scotland"
    },
    {
        " and great-grandmother of King ": null
    },
    {
        "James I of England": "james vi and i"
    },
    {
        " Henry VIII of England": "henry viii of england"
    },
    {
        " Mary Tudor": "mary tudor, queen of france"
    },
    {
        ", younger daughter, Queen of France and subsequently wife of ": null
    },
    {
        "Charles Brandon, 1st Duke of Suffolk": "charles brandon, 1st duke of suffolk"
    },
    {
        "                 ": null
    }
]