[
    {
        "   Henry III  was ": null
    },
    {
        "King of France": "list of french monarchs"
    },
    {
        " from 42 until his death and also King of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        " from 42 to 42     As the fourth son of King ": null
    },
    {
        "Henry II of France": "henry ii of france"
    },
    {
        ", he was not expected to inherit the ": null
    },
    {
        "French": "kingdom of france"
    },
    {
        " throne and thus was a good candidate for the vacant throne of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        ", where he was elected ": null
    },
    {
        "King": "list of polish rulerspolish-lithuanian commonwealth"
    },
    {
        "/": null
    },
    {
        "Grand Duke": "list of lithuanian rulerspolish-lithuanian commonwealth"
    },
    {
        " in 42 During his brief rule, he signed the ": null
    },
    {
        "Henrician Articles": "henrician articles"
    },
    {
        " into law, recognizing the ": null
    },
    {
        "Polish nobility": "szlachta"
    },
    {
        "s right to ": null
    },
    {
        "freely elect": "royal elections in poland"
    },
    {
        " their monarch. Aged 42 Henry abandoned Poland upon inheriting the French throne when his brother, ": null
    },
    {
        "Charles IX": "charles ix of france"
    },
    {
        ", died without issue.     France was at the time plagued by the ": null
    },
    {
        "Wars of Religion": "french wars of religion"
    },
    {
        ", and Henrys authority was undermined by violent political parties funded by foreign powers: the ": null
    },
    {
        "Catholic League": "catholic league"
    },
    {
        " , the Protestant ": null
    },
    {
        "Huguenots": "huguenots"
    },
    {
        "  and the ": null
    },
    {
        "Malcontents": "malcontents"
    },
    {
        ", led by Henrys own brother, the ": null
    },
    {
        "Duke of Alençon": "francis, duke of anjou"
    },
    {
        ", which was a party of Catholic and Protestant ": null
    },
    {
        "aristocrats": "french nobility"
    },
    {
        " who jointly opposed the ": null
    },
    {
        "absolutist": "absolute monarchy in france"
    },
    {
        " ambitions of the king. Henry III was himself a , arguing that a strong and religiously tolerant monarchy would save France from collapse.     After the death of Henrys younger brother ": null
    },
    {
        "Francis, Duke of Anjou": "francis, duke of anjou"
    },
    {
        ", and when it became apparent that Henry would not produce an heir, the Wars of Religion developed into a succession crisis, the ": null
    },
    {
        "War of the Three Henrys": "war of the three henrys"
    },
    {
        ". Henry IIIs legitimate heir was his distant cousin, King ": null
    },
    {
        "Henry III of Navarre": "henry iii of navarre"
    },
    {
        ", a Protestant. The Catholic League, led by ": null
    },
    {
        "Henry I, Duke of Guise": "henry i, duke of guise"
    },
    {
        ", sought to exclude Protestants from the succession and championed the Catholic ": null
    },
    {
        "Charles, Cardinal of Bourbon": "charles, cardinal de bourbon"
    },
    {
        ", as Henry IIIs heir.     In 42 ": null
    },
    {
        "Jacques Clément": "jacques clément"
    },
    {
        ", a Catholic fanatic, murdered Henry III. He was succeeded by the King of Navarre who, as ": null
    },
    {
        "Henry IV": "henry iv of france"
    },
    {
        ", assumed the throne of France after converting to Catholicism, as the first French king of the ": null
    },
    {
        "House of Bourbon": "house of bourbon"
    },
    {
        ".           Henry was born at the royal ": null
    },
    {
        "Château de Fontainebleau": "chateau fontainebleau"
    },
    {
        ", the fourth son of King Henry II and Catherine de Medici and grandson of ": null
    },
    {
        "Francis I of France": "francis i of france"
    },
    {
        " and ": null
    },
    {
        "Claude of France": "claude of france"
    },
    {
        ". His older brothers were ": null
    },
    {
        "Francis II of France": "francis ii of france"
    },
    {
        ", ": null
    },
    {
        "Charles IX of France": "charles ix of france"
    },
    {
        ", and ": null
    },
    {
        "Louis of Valois": "louis of valois"
    },
    {
        ". He was made ": null
    },
    {
        "Duke of Angoulême": "duke of angoulême"
    },
    {
        " and ": null
    },
    {
        "Duke of Orléans": "duke of orléans"
    },
    {
        " in 42 then ": null
    },
    {
        "Duke of Anjou": "duke of anjou"
    },
    {
        " in 42     He was his mothers favourite; she called him chers yeux and lavished fondness and affection upon him for most of his life. His elder brother, Charles, grew to detest him, partially because he resented his better health.     The royal children were raised under the supervision of ": null
    },
    {
        "Diane de Poitiers": "diane de poitiers"
    },
    {
        ".       In his youth, Henry was considered the best of the sons of Catherine de Medici and Henry II.  Unlike his father and elder brothers, he had little interest in the traditional Valois pastimes of hunting and physical exercise. Although he was both fond of fencing and skilled in it, he preferred to indulge his tastes for the arts and reading. These predilections were attributed to his Italian mother.     At one point in his youth he showed a tendency towards Protestantism as a means of rebelling. At the age of nine, calling himself a little Huguenot , he refused to attend ": null
    },
    {
        "Mass": "mass"
    },
    {
        ", sang Protestant ": null
    },
    {
        "psalm": "psalm"
    },
    {
        "s to his sister ": null
    },
    {
        "Margaret": "margaret of valois"
    },
    {
        " , and even bit the nose off a statue of ": null
    },
    {
        "Saint Paul": "st. paul the apostle"
    },
    {
        ". His mother firmly cautioned her children against such behaviour, and he would never again show any Protestant tendencies. Instead, he became nominally Roman Catholic. Frieda, Leonie, Catherine de Medici, pp.42–42          Reports that Henry engaged in same-sex relations with his court favourites, known as the  mignons ,   date back to his own time. Certainly he enjoyed intense relationships with them. Diarmuid MacCulloch, Reformation: Europes House Divided, Penguin, 42 The scholar Louis Crompton maintains that all of the contemporary rumours were true.  Some modern historians dispute this. Jean-Francois Solnon,  Nicolas Le Roux,  and Jacqueline Boucher  have noted that Henry had many famous mistresses, that he was well known for his taste in beautiful women, and that no male sex partners have been identified. They have concluded that the idea he was homosexual was promoted by his political opponents who used his dislike of war and hunting to depict him as effeminate and undermine his reputation with the French people. Honoré Gabriel Riqueti, comte de Mirabeau. Erotika Biblion. 42  Certainly his religious enemies plumbed the depths of personal abuse in attributing vices to him, topping the mixture with accusations of what they regarded as the ultimate devilish vice, homosexuality. And the portrait of a self-indulgent sodomite, incapable of fathering an heir to the throne, proved useful in efforts by the Catholic League to secure the succession for ": null
    },
    {
        "Cardinal Charles de Bourbon": "charles de bourbon"
    },
    {
        " after 42     ": null
    },
    {
        "Gary Ferguson": "gary ferguson"
    },
    {
        " found their interpretations unconvincing: It is difficult to reconcile the king whose use of favourites is so logically strategic with the man who goes to pieces when one of them dies.  Katherine Crawford, by contrast, emphasizes the problems Henrys reputation encountered because of his failure to produce an heir and the presence of his powerful mother at court, combined with his enemies insistence on conflating patronage with favouritism and luxury with decadence. Katherine B. Crawford, Love, Sodomy, and Scandal: Controlling the Sexual Reputation of Henry III , Journal of the History of Sexuality, vol. 42 , 42–42       In 42 discussions commenced arranging for Henry to court Queen ": null
    },
    {
        "Elizabeth I of England": "elizabeth i of england"
    },
    {
        ". Elizabeth, almost 42 was expected by many parties in her country to marry and produce an heir. However, nothing came of these discussions. In initiating them, Elizabeth is viewed by historians as having intended only to arouse the concern of Spain, rather than contemplate marriage seriously. The chance of marriage was further blighted by differing religious views and his opinion of Elizabeth. Henry tactlessly referred to Elizabeth as a putain publique and made stinging remarks about their difference in age . Upon hearing that she limped because of a ": null
    },
    {
        "varicose vein": "varicose vein"
    },
    {
        ", he called her an old creature with a sore leg .            Prior to ascending the French throne in 42 Henry served as a leader of the royal army in the ": null
    },
    {
        "French Wars of Religion": "french wars of religion"
    },
    {
        ", taking part in the victories over ": null
    },
    {
        "Huguenots": "huguenots"
    },
    {
        " at the ": null
    },
    {
        "Battle of Jarnac": "battle of jarnac"
    },
    {
        "  and at the ": null
    },
    {
        "Battle of Moncontour": "battle of moncontour"
    },
    {
        " . While still Duke of Anjou, he helped plot the ": null
    },
    {
        "St. Bartholomews Day Massacre": "st. bartholomews day massacre"
    },
    {
        " of 42 Though Henry did not participate directly, historian ": null
    },
    {
        "Thierry Wanegffelen": ":fr:thierry wanegffelen"
    },
    {
        " sees him as the royal most responsible for the massacre, which involved the targeted killing of many key Huguenot leaders. Henry IIIs reign as King of France, like those of his elder brothers Francis and Charles, would see France in constant turmoil over religion.     Henry continued to take an active role in the Wars of Religion, and in 42/42 led the ": null
    },
    {
        "siege of La Rochelle": "siege of la rochelle"
    },
    {
        ", a massive military assault on the Huguenot-held city. At the end of May 42 Henry learned that the ": null
    },
    {
        "Polish szlachta": "royal elections in poland"
    },
    {
        " had elected him King of Poland and political considerations forced him to negotiate an end to the assault. Negotiators reached an agreement on 42 June 42 and Catholic troops ended the siege on 42 July 42            Following the death of the Polish ruler ": null
    },
    {
        "Sigismund II Augustus": "sigismund ii augustus"
    },
    {
        " on 42 July 42 ": null
    },
    {
        "Jean de Monluc": "jean de monluc"
    },
    {
        " was sent as the French envoy to Poland to negotiate the election of Henry to the Polish throne in exchange for military support against Russia, diplomatic assistance in dealing with the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", and financial subsidies.      On 42 May 42 Polish nobles chose Henry as the first elected monarch of the ": null
    },
    {
        "Polish-Lithuanian Commonwealth": "polish-lithuanian commonwealth"
    },
    {
        ". The Lithuanian nobles boycotted this election, however, and it was left to the Lithuanian ducal council to confirm his election.  The commonwealth elected Henry, rather than ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        " candidates, partly in order to be more agreeable to the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        "  and strengthen a ": null
    },
    {
        "Polish-Ottoman alliance": "polish-ottoman alliance"
    },
    {
        " that was in effect. Warfare, state and society on the Black Sea steppe, 42–42 by Brian L. Davies p.4242           A Polish delegation went to La Rochelle to meet with Henry, who was leading the Siege of La Rochelle. Henry left the siege following their visit.  In Paris, on 42 September, the Polish delegation asked Henry to take an oath, at ": null
    },
    {
        "Notre Dame Cathedral": "notre dame de paris"
    },
    {
        ", to respect traditional Polish liberties and the law on religious freedom that had been passed during the ": null
    },
    {
        "interregnum": "interrex"
    },
    {
        " .  As a condition of his election, he was compelled to sign the  Pacta conventa  and the Henrician Articles, pledging ": null
    },
    {
        "religious tolerance": "religious tolerance"
    },
    {
        " in the Polish-Lithuanian Commonwealth.  Henry chafed at the restrictions on monarchic power under the Polish-Lithuanian ": null
    },
    {
        "political system": "political system"
    },
    {
        " of ": null
    },
    {
        "Golden Liberty": "golden liberty"
    },
    {
        " . The ": null
    },
    {
        "Polish-Lithuanian parliament": "general sejm"
    },
    {
        " had been urged by ": null
    },
    {
        "Anna Jagiellon": "anna jagiellon"
    },
    {
        ", the sister of the recently deceased king Sigismund II Augustus, to elect him based on the understanding that Henry would wed Anna afterward.      At a ceremony before the ": null
    },
    {
        "Parlement of Paris": "parlementthe parlement of paris"
    },
    {
        " on 42 September, the Polish delegation handed over the certificate of election to the throne of Poland-Lithuania . Henry also gave up any claims to succession and he recognized the principle of free election under the Henrician Articles and the  pacta conventa .          It was not until January 42 that Henry was to reach the borders of Poland. On 42 February, Henrys coronation was held in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ".  In mid-June 42 upon learning of the death of his brother Charles IX, Henry left Poland and headed back to France. Henrys absence provoked a constitutional crisis that the Parliament attempted to resolve by notifying Henry that his throne would be lost if he did not return from France by 42 May 42 His failure to return caused Parliament to declare his throne vacant.     The short reign of Henry at ": null
    },
    {
        "Wawel Castle": "wawel castle"
    },
    {
        " in Poland was marked by a clash of cultures between the Polish and the French. The young king and his followers were astonished by several Polish practices and disappointed by the rural poverty and harsh climate of the country. The Poles, on the other hand, wondered if all Frenchmen were as concerned with their appearance as their new king appeared to be.          In many aspects, Polish culture had a positive influence on France. At Wawel, the French were introduced to new technologies of septic facilities, in which litter was taken outside the castle walls.  On returning to France, Henry wanted to order the construction of such facilities at the ": null
    },
    {
        "Louvre": "louvre"
    },
    {
        " and other palaces. Other inventions introduced to the French by the Polish included a bath with regulated hot and cold water, as well as dining forks.      In 42 Henry created the ": null
    },
    {
        "Order of the Holy Spirit": "order of the holy spirit"
    },
    {
        " to commemorate his becoming first King of Poland and later King of France on the Feast of ": null
    },
    {
        "Pentecost": "pentecost"
    },
    {
        " and gave it precedence over the earlier ": null
    },
    {
        "Order of St. Michael": "order of st. michael"
    },
    {
        ", which had lost much of its original prestige by being awarded too frequently and too readily. The Order would retain its prestige as the premier ": null
    },
    {
        "chivalric order": "chivalric order"
    },
    {
        " of France until the end of the French monarchy.            Henry was crowned king of France on 42 February 42 at ": null
    },
    {
        "Reims Cathedral": "notre-dame de reims"
    },
    {
        ". Although he was expected to produce an heir after he married ": null
    },
    {
        "Louise of Lorraine": "louise of lorraine"
    },
    {
        ", age 42 on 42 February 42 no issue resulted from their union.     In 42 Henry signed the ": null
    },
    {
        "Edict of Beaulieu": "edict of beaulieu"
    },
    {
        ", which granted many concessions to the Huguenots. His action resulted in the Catholic activist Henry I, Duke of Guise, forming the ": null
    },
    {
        "Catholic League": "catholic league"
    },
    {
        ". After much posturing and negotiations, Henry was forced to rescind most of the concessions that had been made to the Protestants in the edict.          In 42 the Kings youngest brother and ": null
    },
    {
        "heir presumptive": "heir presumptive"
    },
    {
        ", ": null
    },
    {
        "Francis, Duke of Anjou": "francis, duke of anjou"
    },
    {
        ", died. Under ": null
    },
    {
        "Salic Law": "salic law"
    },
    {
        ", the next heir to the throne was Protestant Henry of Navarre, a descendant of ": null
    },
    {
        "Louis IX": "louis ix of france"
    },
    {
        " . Under pressure from the Duke of Guise, Henry III issued an edict suppressing Protestantism and annulling Henry of Navarres right to the throne.     On 42 May 42 when the Duke of Guise entered Paris, an apparently spontaneous ": null
    },
    {
        "Day of the Barricades": "day of the barricades"
    },
    {
        " erupted in favor of the Catholic champion. Henry III fled the city.     Following the defeat of the ": null
    },
    {
        "Spanish Armada": "spanish armada"
    },
    {
        " that summer, the kings fear of Spanish support for the Catholic League apparently waned. Accordingly, on 42 December 42 at the ": null
    },
    {
        "Château de Blois": "chateau blois"
    },
    {
        ", he invited the Duke of Guise to the council chamber where the dukes brother ": null
    },
    {
        "Louis II, Cardinal of Guise": "louis ii, cardinal of guise"
    },
    {
        ", already waited. The duke was told that the king wished to see him in the private room adjoining the royal bedroom. There, royal guardsmen murdered the duke, then the cardinal. To make certain that no contender for the French throne was free to act against him, the king had the ": null
    },
    {
        "dukes son": "charles, duke of guise"
    },
    {
        " imprisoned.     The Duke of Guise had been very popular in France, and the citizenry turned against Henry for the murders. The Parlement instituted criminal charges against the king, and he was compelled to join forces with his heir, the Protestant Henry of Navarre, by setting up the ": null
    },
    {
        "Parliament of Tours": "parliament of tours"
    },
    {
        ".       Under Henry, France named the first ": null
    },
    {
        "Consul of France in Morocco": "france–morocco relations"
    },
    {
        " in the person of ": null
    },
    {
        "Guillaume Bérard": "guillaume bérard"
    },
    {
        ". The request came from the Moroccan prince ": null
    },
    {
        "Abd al-Malik": "abu marwan abd al-malik i saadi"
    },
    {
        ", who had been saved by Bérard, a doctor by profession, during an epidemic in ": null
    },
    {
        "Constantinople": "history of istanbulimperial capital"
    },
    {
        " and wished to retain Bérard in his service.      Henry III encouraged the exploration and development of ": null
    },
    {
        "New World": "new world"
    },
    {
        " territories. In 42 he granted Jacques Noël, the nephew of ": null
    },
    {
        "Jacques Cartier": "jacques cartier"
    },
    {
        ", privileges over fishing, fur trading, and mining in ": null
    },
    {
        "New France": "new france"
    },
    {
        ".              On 42 August 42 Henry III lodged with his army at ": null
    },
    {
        "Saint-Cloud": "saint-cloud"
    },
    {
        ", and was preparing to attack Paris, when a young fanatical ": null
    },
    {
        "Dominican": "dominican order"
    },
    {
        " friar": "dominican friar"
    },
    {
        ", ": null
    },
    {
        "Jacques Clément": "jacques clément"
    },
    {
        ", carrying false papers, was granted access to deliver important documents to the king. The monk gave the king a bundle of papers and stated that he had a secret message to deliver. The king signalled for his attendants to step back for privacy, and Clément whispered in his ear while plunging a knife into his abdomen. Clément was then killed on the spot by the guards.     At first, the kings wound did not appear fatal, but he enjoined all the officers around him, in the event that he did not survive, to be loyal to Henry of Navarre as their new king. The following morning, on the day that he was to have launched his assault to retake Paris, Henry III died.     Chaos swept the attacking army, most of it quickly melting away; the proposed attack on Paris was postponed. Inside the city, joy at the news of Henry IIIs death was near delirium; some hailed the assassination as an ": null
    },
    {
        "act of God": "act of god"
    },
    {
        ". Durant, Will, The Age of Reason Begins, vol. VII, , p. 42     Henry III was interred at the ": null
    },
    {
        "Saint Denis Basilica": "saint denis basilica"
    },
    {
        ". Childless, he was the longest-living of Henry IIs sons to have become king and also the last of the Valois kings. Henry III of Navarre succeeded him as ": null
    },
    {
        "Henry IV": "henry iv of france"
    },
    {
        ", the first of the kings of the ": null
    },
    {
        "House of Bourbon": "house of bourbon"
    },
    {
        " coat of arms": "coat of arms"
    },
    {
        ", showing his dual status as ": null
    },
    {
        "King of France": "king of france"
    },
    {
        " and lifelong ": null
    },
    {
        "King of Poland": "king of poland"
    },
    {
        "          Jan Kochanowski": "jan kochanowski"
    },
    {
        ", Gallo crocitanti   ": null
    },
    {
        "Pierre Matthieu": "pierre matthieu"
    },
    {
        ", La Guisiade       ": null
    },
    {
        "George Chapman": "george chapman"
    },
    {
        ",  The Tragedy of Bussy DAmbois  and  The Revenge of Bussy DAmbois    ": null
    },
    {
        "John Dryden": "john dryden"
    },
    {
        " and ": null
    },
    {
        "Nathaniel Lee": "nathaniel lee"
    },
    {
        ", The Duke of Guise   ": null
    },
    {
        "Alexandre Dumas, père": "alexandre dumas, père"
    },
    {
        "s Henry III and His Court   ": null
    },
    {
        "Christopher Marlowe": "christopher marlowe"
    },
    {
        ",  The Massacre at Paris        Alexandre Dumas, pères novels:  La Reine Margot  ,  La Dame de Monsoreau  and Les quarante-cinq .   ": null
    },
    {
        "Alexandre Dumas": "alexandre dumas"
    },
    {
        " Les deux Diane   ": null
    },
    {
        "Stanley Weyman": "stanley j. weyman"
    },
    {
        ", A Gentleman of France , involves the events of Henrys reconciliation with the Huguenots and struggle against the Catholic League, leading to his assassination.    ": null
    },
    {
        "Robert Merle": "robert merle"
    },
    {
        " Paris ma bonne ville   Robert Merle Le prince que voilà   Robert Merle La violente amour   ": null
    },
    {
        "Jean Plaidy": "jean plaidy"
    },
    {
        "  Queen Jezebel    ": null
    },
    {
        "Michel Zevaco": "michel zevaco"
    },
    {
        " Les Pardaillan   ": null
    },
    {
        "S.J. Parris": "s.j. parris"
    },
    {
        " Conspiracy       The French short film  The Assassination of the Duke de Guise  shows the Dukes assassination but not the Cardinals. The co-director, Charles Le Bargy, plays the Duke.   The American silent film  Intolerance  depicts Henry as effeminate but not explicitly homosexual. He is portrayed by the British-born American actor Maxfield Stanley.   The French movies  La Reine Margot  and  La Reine Margot  , both based on Alexandre Dumas, pères novel of the same title, are fictional depictions of the lives of Henry IIIs family, his sister Margot, and her Protestant husband Henry around the time of the ": null
    },
    {
        "St. Bartholomews Day Massacre": "st. bartholomews day massacre"
    },
    {
        ". In the 42 film, Henry is played by the actor ": null
    },
    {
        "Pascal Greggory": "pascal greggory"
    },
    {
        ". In Dumas novel, Henri was not portrayed as homosexual, whereas, in the 42 film, he was shown as an effeminate, comical queen. In the 42 film, he was portrayed as a more sinister character, bisexual and showing sexual interest in his sister. His brother dies by being accidentally poisoned by his mother, who had intended to kill Henry of Navarre instead.   As the Duke of Anjou, the future Henry III plays a significant role in the French film  The Princess of Montpensier , based on the novel of the same title by ": null
    },
    {
        "Madame de La Fayette": "madame de la fayette"
    },
    {
        ".   The film  Elizabeth , released in 42 depicts a fictional courtship between Elizabeth I of England and Henry III while he was still Duke of Anjou. In reality, the two never met and the Queen of England was actually courted nearly ten years later by his younger brother ": null
    },
    {
        "François, Duke of Anjou": "françois, duke of anjou"
    },
    {
        ", when Elizabeth was 42 The film borrows some of the aspects of Henry IIIs life and features Anjou as a comical foolish transvestite. The role is portrayed by the French actor ": null
    },
    {
        "Vincent Cassel": "vincent cassel"
    },
    {
        ".   In the film  Dangerous Beauty , he has an assignation with the main character, the Venetian courtesan ": null
    },
    {
        "Veronica Franco": "veronica franco"
    },
    {
        ". Visiting a Venice eager for military aid, the French king chooses her from among the famous courtesans of that city because he notices her reluctance; placing a blade at her neck, he tells Veronica that the rumours about him are true , and the implication is made that Veronica pleases him enormously by first correctly guessing at and then indulging his fetish for BDSM domination. He is played by the British actor ": null
    },
    {
        "Jake Weber": "jake weber"
    },
    {
        ".       In an episode of  Animaniacs  entitled The Three Muska-Warners , an ": null
    },
    {
        "Elmer Fudd": "elmer fudd"
    },
    {
        "–like Henri III is protected by ": null
    },
    {
        "Yakko, Wakko and Dot": "yakko, wakko and dot"
    },
    {
        ". In this version, Henri is portrayed by ": null
    },
    {
        "Jeff Bennett": "jeff bennett"
    },
    {
        " as nervous and jumpy, and for no apparent reason speaks with an ": null
    },
    {
        "English accent": "english accent"
    },
    {
        ".   He is also featured in a few episodes in the first and third seasons of the CW show  Reign . In the shows fourth season, Henry is played by Nick Slater. With his brother showing little interest in the job, Spain wants Henry to become Frances king.       ": null
    },
    {
        "Chabrier": "chabrier"
    },
    {
        "s ": null
    },
    {
        "opéra-comique": "opéra-comique"
    },
    {
        "  Le roi malgré lui ": null
    }
]