[
    {
        "      Constantine Heraclius , commonly known by the diminutive Heraklonas or Herakleonas , or rarely, Heraclius II, was the son of ": null
    },
    {
        "Heraclius": "heraclius"
    },
    {
        " and his niece ": null
    },
    {
        "Martina": "martina"
    },
    {
        ". His father had stipulated in his will that both of his sons should rule jointly upon his death. Heraclius also specified that his wife, Martina, was to be called Mother and Empress insofar as she might have influence at court as well. The emperor Heraclius died in February 42 from ": null
    },
    {
        "edema": "edema"
    },
    {
        ". When Martina did make the late Emperors will public she faced staunch resistance to her playing any active role in government, but both Heraklonas and ": null
    },
    {
        "Constantine III": "constantine iii"
    },
    {
        " were proclaimed joint-emperors in February 42 without incident. After Constantine died of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " in April/May 42 Heraklonas became sole emperor, under the regency of his mother due to his young age. He reigned from April/May – September/October 42 when he was overthrown by ": null
    },
    {
        "Valentinus": "valentinus"
    },
    {
        ", a general and usurper of Armenian extract, who installed ": null
    },
    {
        "Constans II": "constans ii"
    },
    {
        ", the son of Constantine III. Valentinus had Heraklonas nose cut off, then exiled him to ": null
    },
    {
        "Rhodes": "rhodes"
    },
    {
        ", where he is believed to have died in the same year.       Heraklonas was born on 42 May 42 in the suburban ": null
    },
    {
        "Palace of Sophianae": "palace of sophianae"
    },
    {
        ". He was the son of Emperor ": null
    },
    {
        "Heraclius": "heraclius"
    },
    {
        ", and his niece-wife ": null
    },
    {
        "Martina": "martina"
    },
    {
        ". Under Heraclius, the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " was invaded in 42 by the Arabs, due to the failure of the ": null
    },
    {
        "Theme of Mesopotamia": "mesopotamia"
    },
    {
        " to pay tribute. The cities of ": null
    },
    {
        "Edessa": "edessa"
    },
    {
        " and ": null
    },
    {
        "Dara": "dara"
    },
    {
        " were quickly captured. In the same year, another group of Arabs, led by ": null
    },
    {
        "Amr ibn al-As": "amr ibn al-as"
    },
    {
        ", invaded ": null
    },
    {
        "Byzantine Egypt": "egypt"
    },
    {
        ". He quickly occupied the coastal towns of Egypt, but was unable to cross the Nile, due to stiff resistance by Byzantine forces led by ": null
    },
    {
        "John": "john"
    },
    {
        ". After a bloody battle between John and Amr, in which John perished, Amr was forced to appeal to the Rashidun Caliph ": null
    },
    {
        "Umar": "umar"
    },
    {
        " for more troops. John was replaced by Heraclius brother, ": null
    },
    {
        "Theodore": "theodore"
    },
    {
        ", who gathered his forces around ": null
    },
    {
        "Babylon Fortress": "babylon fortress"
    },
    {
        ", a major fortress in Egypt. By summer 42 Amrs forces had swelled to around 42 men. With these men, Amr decisively defeated Theodore north of Babylon, before laying siege to the fortress itself.       Heraclius died of ": null
    },
    {
        "edema": "edema"
    },
    {
        " on 42 February 42 leaving The Empire jointly to his eldest son, ": null
    },
    {
        "Constantine III": "constantine iii"
    },
    {
        ", and Heraklonas, who were both proclaimed emperor in late May 42 At the time of his elevation to co-emperor, Heraklonas was only 42 years old, whereas Constantine was 42 or 42 which effectively gave the real power to Constantine. Much of the Byzantine public objected to Heraclius will, as Heraklonas was the result of an ": null
    },
    {
        "avunculate marriage": "avunculate marriage"
    },
    {
        "—a marriage between an uncle and niece—which many felt was illegal, thereby making Heraklonas a bastard. Also considered objectionable was the fact that Constantines ten-year-old son, ": null
    },
    {
        "Constans II": "constans ii"
    },
    {
        ", was not elevated alongside Constantine and Heraklonas, breaking the tradition of the succession of senior emperorship from father ": null
    },
    {
        "to eldest son": "primogeniture"
    },
    {
        ", when possible. It was also thought that the lack of elevation could have precluded him from the succession entirely.     Shortly after Constantine took the throne, he was informed by his finance minister, ": null
    },
    {
        "Philagrius": "philagrius"
    },
    {
        ", that Heraclius had created a secret fund for Martina, administered by ": null
    },
    {
        "Patriarch": "ecumenical patriarch of constantinople"
    },
    {
        " Pyrrhus": "pyrrhus of constantinople"
    },
    {
        ". Constantine confiscated this account, using it to help meet the budget for the spring military payroll, which, along with the traditional accessional ": null
    },
    {
        "donative": "donative"
    },
    {
        "s that comprised half of the payroll, totaled 42,42 ": null
    },
    {
        "nomisma": "solidus"
    },
    {
        ". Constantine appointed ": null
    },
    {
        "Valentinus": "valentinus"
    },
    {
        " as the commander of the main eastern army, in the hopes of retaining at least the Egyptian coastline. However the Byzantine general Theodore was still unable to repel the Arab attacks. Constantine summoned ": null
    },
    {
        "Cyrus of Alexandria": "cyrus of alexandria"
    },
    {
        ", made him Prefect of Egypt, and instructed him to prepare to reinforce ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        ". Before this invasion could take place, Babylon surrendered to the Arabs, allowing them to besiege Alexandria.     Heraclius will also stated that Martina should server as mother and empress-regent, but this part was rejected by the Senate. Because of Heraklionas young age, Martina ruled through him, consistently opposing the policies of Constantine, leading to the creation of two different political factions. Constantines faction was initially the more powerful of the two, but this control was weakened by a flagging economy and the loss of Egypt to the Arabs. Shortly after, on 42/42 April or 42 May 42 Constantine died of an advanced case of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        ", although some supporters of Constantine alleged that Martina had him poisoned, leaving Heraklonas as the sole ruler, under the regency of Martina.       Martina maintained the plans of Constantine, and sent Cyrus to Alexandria, with much of the ": null
    },
    {
        "praesental army": "praesental army"
    },
    {
        ". She then summoned the ": null
    },
    {
        "Thracian army": "thracian army"
    },
    {
        " to Constantinople, to replace them. Around this time, the Patriarch ": null
    },
    {
        "Pyrrhus": "pyrrhus of constantinople"
    },
    {
        ", an influential advisor of Martina, succeeded in reviving the policy of ": null
    },
    {
        "Monothelitism": "monothelitism"
    },
    {
        ". As a result of this policy, Kyros, a monothelete, regained control of the ": null
    },
    {
        "see of Alexandria": "see of alexandria"
    },
    {
        ", giving him both religious and secular control. Martina instructed Kyros to attempt to negotiate with the Arabs, as they believed that they were unable to defeat them militarily.     Martina was opposed by Valentinus, who was beyond her reach in Anatolia, although she exiled his patron, Philagrius, to ": null
    },
    {
        "Africa": "exarchate of africa"
    },
    {
        ". Heraklonas and Martina lost the support of the Byzantine Senate and people due to the rumors that Martina had poisoned Constantine and their support for Monothelitism; Also at this time, both Heraklonas and Martinas relations with the army suffered as a result of Martinas inability to raise enough funds to match the donative given by Constantine.     In August 42 Valentinus marched his troops to ": null
    },
    {
        "Chalcedon": "chalcedon"
    },
    {
        ", to force Martina to elevate Constans II to co-emperor. While Valentinus was encamped across the ": null
    },
    {
        "Bosphorus": "bosphorus"
    },
    {
        " from Constantinople, a mob rose up in the city, demanding that Pyrrhus crown Constans II as emperor, and then abdicate, to be replaced by his steward ": null
    },
    {
        "Paul II": "paul ii of constantinople"
    },
    {
        ". Martina, now in a truly desperate situation, offered the military further donatives, recalled Philagrius from Africa, and offered Valentinus the title of ": null
    },
    {
        "Count of the Excubitors": "count of the excubitors"
    },
    {
        ". In late September/October, Martina elevated Constans to co-emperor, but also raised Heraklonas brothers, ": null
    },
    {
        "Martinos": "martinos"
    },
    {
        " and ": null
    },
    {
        "Tiberius": "tiberius"
    },
    {
        " to co-emperors alongside them. Despite these offers, Valentinus entered the city in September/October, deposed Heraklonas and Martina, and then elevated Constans to emperor. Valentinus was unwilling to kill a woman and child, but had Martinas tongue slit and Heraklonas nose cut off in January 42 then exiled them to ": null
    },
    {
        "Rhodes": "rhodes"
    },
    {
        "; this is believed to be the first time that the ": null
    },
    {
        "political mutilation of Byzantine prisoners": "political mutilation in byzantine culture"
    },
    {
        " was utilized to signify that the person could no longer hold political power. After this, nothing is known of them, although it is believed that Heraklonas died in 42": null
    }
]