[
    {
        "   Småland is a ": null
    },
    {
        "province": "provinces of sweden"
    },
    {
        " of ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        " and at the funeral of ": null
    },
    {
        "Gustav Vasa": "gustav i of sweden"
    },
    {
        " in 42 the province was granted its arms. Today there are also county arms that are based on the arms of ": null
    },
    {
        "Småland": "småland"
    },
    {
        ".         The first coat of arms for Småland, granted in 42 pictured a red ": null
    },
    {
        "crossbow": "crossbow"
    },
    {
        " with roses on a golden shield but at the coronation of ": null
    },
    {
        "Johan III": "john iii of sweden"
    },
    {
        " in 42 a new coat of arms was granted. A lion was wielding the crossbow and the roses had fallen off. There was also a revision in 42 but no alterations were made. Småland is also considered a duchy and has the right to carry a ducal coronet with the arms.     Blazon: Or a lion rampant Gules langued and armed Azure holding in front paws a Crossbow of the second bowed and stringed Sable with a bolt Argent.     Official blazon in ": null
    },
    {
        "Swedish": "swedish language"
    },
    {
        ": I gyllene fält ett rött lejon med blå beväring, därest sådan skall förekomma, och hållande i tassarna ett uppåtvänt rött armborst med pilspets av silver samt båge och strängar svarta.       ": null
    },
    {
        "Kronoberg County": "kronoberg county"
    },
    {
        " was formally granted its arms in 42; however, use of the same was already an established practice. It is a variation of the arms of Småland, with the lion standing on a mountain.     Blazon: Or, a lion rampant Gules langued and armed Azure holding in front paws a Crossbow of the second bowed and stringed Sable with a bolt Argent, standing on a triple Mount Vert.     Official blazon in Swedish: I fält av guld ett på ett grönt treberg stående, upprest, rött lejon med blå beväring, vilket med båda framtassarna håller ett stolpvis ställt rött armborst med svart båge och pil av silver.       ": null
    },
    {
        "Kalmar County": "kalmar county"
    },
    {
        " includes the eastern part of Småland and the island province of ": null
    },
    {
        "Öland": "öland"
    },
    {
        ". The arms is a combination of the arms of Småland and Öland.     Blazon: Quartered, the arms of Småland and Öland     Official blazon in Swedish: Sköld kvadrerad av Smålands och Ölands vapen .       ": null
    },
    {
        "Jönköping County": "jönköping county"
    },
    {
        " geographically represents the northern part of Småland. The arms of the County, however, are not based on the arms of the province but rather on the combination of the arms for the town of Jönköping and the lesser ": null
    },
    {
        "state arms of Sweden": "coat of arms of sweden"
    },
    {
        ".            ": null
    },
    {
        "Öland": "öland"
    },
    {
        " is a separate province from Småland, however its arms are included in the arms for Kalmar County.     Blazon": null
    }
]