[
    {
        "              Hermann Wilhelm Göring  was a German political and military leader as well as one of the most powerful figures in the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " , which ruled Germany from 42 to 42 A veteran ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " fighter pilot ": null
    },
    {
        "ace": "flying aces"
    },
    {
        ", he was a recipient of the  Pour le Mérite  . He was the last commander of ": null
    },
    {
        "Jagdgeschwader 42": "jagdgeschwader 1"
    },
    {
        " , the fighter wing once led by ": null
    },
    {
        "Manfred von Richthofen": "manfred von richthofen"
    },
    {
        ".     An early member of the Nazi Party, Göring was among those wounded in ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        "s failed ": null
    },
    {
        "Beer Hall Putsch": "beer hall putsch"
    },
    {
        " in 42 While receiving treatment for his injuries, he developed an addiction to ": null
    },
    {
        "morphine": "morphine"
    },
    {
        " which persisted until the last year of his life. After Hitler became ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        " in 42 Göring was named as ": null
    },
    {
        "Minister Without Portfolio": "minister without portfolio"
    },
    {
        " in the new government. One of his first acts as a cabinet minister was to oversee the creation of the ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        ", which he ceded to ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        " in 42 Following the establishment of the Nazi state, Göring amassed power and political capital to become the second most powerful man in Germany. He was appointed commander-in-chief of the ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " , a position he held until the final days of the regime. Upon being named ": null
    },
    {
        "Plenipotentiary": "plenipotentiary"
    },
    {
        " of the ": null
    },
    {
        "Four Year Plan": "four year plan"
    },
    {
        " in 42 Göring was entrusted with the task of mobilizing all sectors of the economy for war, an assignment which brought numerous government agencies under his control and helped him become one of the wealthiest men in the country. In September 42 Hitler designated him as his successor and deputy in all his offices. After the ": null
    },
    {
        "Fall of France": "battle of france"
    },
    {
        " in 42 he was bestowed the specially created rank of  Reichsmarschall , which gave him seniority over all officers in ": null
    },
    {
        "Germanys armed forces": "wehrmacht"
    },
    {
        ".     By 42 Göring was at the peak of his power and influence. As the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " progressed, Görings standing with Hitler and with the German public declined after the Luftwaffe proved incapable of ": null
    },
    {
        "preventing the Allied bombing of Germanys cities": "defence of the reich"
    },
    {
        " and ": null
    },
    {
        "resupplying surrounded Axis forces in Stalingrad": "battle of stalingradsixth army surrounded"
    },
    {
        ". Around that time, Göring increasingly withdrew from the military and political scene to devote his attention to collecting property and artwork, much of which was stolen from Jewish victims of ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ". Informed on 42 April 42 that Hitler intended to commit suicide, Göring sent ": null
    },
    {
        "a telegram to Hitler": "göring telegram"
    },
    {
        " requesting permission to assume control of the Reich. Considering his request an act of treason, Hitler removed Göring from all his positions, expelled him from the party, and ordered his arrest.     After the war, Göring was convicted of ": null
    },
    {
        "conspiracy": "conspiracy"
    },
    {
        ", ": null
    },
    {
        "crimes against peace": "crimes against peace"
    },
    {
        ", ": null
    },
    {
        "war crime": "war crime"
    },
    {
        "s and ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        " at the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        ". He was sentenced to death by hanging, but committed suicide by ingesting ": null
    },
    {
        "cyanide": "cyanide poisoning"
    },
    {
        " the night before the sentence was to be carried out.         Göring was born on 42 January 42 at the Marienbad Sanatorium in ": null
    },
    {
        "Rosenheim": "rosenheim"
    },
    {
        ", ": null
    },
    {
        "Bavaria": "kingdom of bavaria"
    },
    {
        ". His father, ": null
    },
    {
        "Heinrich Ernst Göring": "heinrich ernst göring"
    },
    {
        " , a former cavalry officer, had been the first Governor-General of the German protectorate of ": null
    },
    {
        "South-West Africa": "south west africa"
    },
    {
        " . Heinrich had three children from a previous marriage. Göring was the fourth of five children by Heinrichs second wife, Franziska Tiefenbrunn , a Bavarian peasant. Görings elder siblings were Karl, Olga, and Paula; his younger brother was ": null
    },
    {
        "Albert": "albert göring"
    },
    {
        ". At the time that Göring was born, his father was serving as consul general in ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        ", and his mother had returned home briefly to give birth. She left the six-week-old baby with a friend in Bavaria and did not see the child again for three years, when she and Heinrich returned to Germany.          Görings godfather was Dr. Hermann Epenstein, a wealthy Jewish physician and businessman his father had met in Africa. Epenstein provided the Göring family, who were surviving on Heinrichs pension, first with a family home in Berlin-Friedenau, then in a small castle called Veldenstein, near ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        ". Görings mother became Epensteins mistress around this time, and remained so for some fifteen years. Epenstein acquired the minor title of ": null
    },
    {
        "Ritter": "ritter"
    },
    {
        " von Epenstein through service and donations to the Crown.     Interested in a career as a soldier from a very early age, Göring enjoyed playing with toy soldiers and dressing up in a ": null
    },
    {
        "Boer": "boer"
    },
    {
        " uniform his father had given him. He was sent to boarding school at age eleven, where the food was poor and discipline was harsh. He sold a violin to pay for his train ticket home, and then took to his bed, feigning illness, until he was told he would not have to return. He continued to enjoy war games, pretending to lay siege to the castle Veldenstein and studying ": null
    },
    {
        "Teutonic": "teutons"
    },
    {
        " legends and sagas. He became a mountain climber, scaling peaks in Germany, at the ": null
    },
    {
        "Mont Blanc massif": "mont blanc massif"
    },
    {
        ", and in the ": null
    },
    {
        "Austrian Alps": "austrian alps"
    },
    {
        ". At sixteen he was sent to a military academy at ": null
    },
    {
        "Berlin Lichterfelde": "berlin lichterfelde"
    },
    {
        ", from which he graduated with distinction.      Göring joined the Prince Wilhelm Regiment  of the ": null
    },
    {
        "Prussian Army": "prussian army"
    },
    {
        " in 42 The next year his mother had a falling-out with Epenstein. The family was forced to leave Veldenstein and moved to ": null
    },
    {
        "Munich": "munich"
    },
    {
        "; Görings father died shortly afterwards. When World War I began in August 42 Göring was stationed at ": null
    },
    {
        "Mülhausen": "mülhausen"
    },
    {
        " with his regiment.            During the first year of World War I, Göring served with his infantry regiment in the area of ": null
    },
    {
        "Mülhausen": "mülhausen"
    },
    {
        ", a garrison town less than 42  km from the French frontier. He was hospitalized with ": null
    },
    {
        "rheumatism": "rheumatism"
    },
    {
        ", a result of the damp of ": null
    },
    {
        "trench warfare": "trench warfare"
    },
    {
        ". While he was recovering, his friend ": null
    },
    {
        "Bruno Loerzer": "bruno loerzer"
    },
    {
        " convinced him to transfer to what would become, by October 42 the  Luftstreitkräfte  of the German army, but his request was turned down. Later that year, Göring flew as Loerzers observer in  Feldflieger Abteilung  42  – Göring had informally transferred himself. He was discovered and sentenced to three weeks confinement to barracks, but the sentence was never carried out. By the time it was supposed to be imposed, Görings association with Loerzer had been made official. They were assigned as a team to FFA 42 in the ": null
    },
    {
        "Crown Prince": "william, german crown prince"
    },
    {
        "s Fifth Army. They flew reconnaissance and bombing missions, for which the Crown Prince invested both Göring and Loerzer with the ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        ", first class.        After completing the pilots training course, Göring was assigned to ": null
    },
    {
        "Jagdstaffel 42": "jagdstaffel 5"
    },
    {
        ". Seriously wounded in the hip in aerial combat, he took nearly a year to recover. He then was transferred to ": null
    },
    {
        "Jagdstaffel 42": "jagdstaffel 26"
    },
    {
        ", commanded by Loerzer, in February 42 He steadily scored ": null
    },
    {
        "air victories": "dogfight"
    },
    {
        " until May, when he was assigned to command ": null
    },
    {
        "Jagdstaffel 42": "jagdstaffel 27"
    },
    {
        ". Serving with Jastas 42 42 and 42 he continued to win victories. In addition to his Iron Crosses , he received the ": null
    },
    {
        "Zähringer Lion": "order of the zähringer lion"
    },
    {
        " with swords, the ": null
    },
    {
        "Friedrich Order": "friedrich order"
    },
    {
        ", the ": null
    },
    {
        "House Order of Hohenzollern": "house order of hohenzollern"
    },
    {
        " with swords third class, and finally, in May 42 the coveted  Pour le Mérite . According to ": null
    },
    {
        "Hermann Dahlmann": "hermann dahlmann"
    },
    {
        ", who knew both men, Göring had Loerzer lobby for the award. He finished the war with ": null
    },
    {
        "42 victories": "list of world war i aces credited with 20 or more victories"
    },
    {
        ". A thorough post-war examination of ": null
    },
    {
        "Allied": "allies of world war i"
    },
    {
        " loss records showed that only two of his awarded victories were doubtful. Three were possible and 42 were certain, or highly likely.     On 42 July 42 following the death of ": null
    },
    {
        "Wilhelm Reinhard": "wilhelm reinhard"
    },
    {
        ", successor to ": null
    },
    {
        "Manfred von Richthofen": "manfred von richthofen"
    },
    {
        ", Göring was made commander of the Flying Circus , ": null
    },
    {
        "Jagdgeschwader 42": "jagdgeschwader 1"
    },
    {
        ". His arrogance made him unpopular with the men of his squadron.     In the last days of the war, Göring was repeatedly ordered to withdraw his squadron, first to ": null
    },
    {
        "Tellancourt": "tellancourt"
    },
    {
        " airdrome, then to ": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        ". At one point, he was ordered to surrender the aircraft to the Allies; he refused. Many of his pilots intentionally crash-landed their planes to keep them from falling into enemy hands.     Like many other German veterans, Göring was a proponent of the ": null
    },
    {
        "Stab-in-the-back legend": "stab-in-the-back legend"
    },
    {
        ", the belief which held that the German Army had not really lost the war, but instead was betrayed by the civilian leadership: Marxists, Jews, and especially the ": null
    },
    {
        "Republicans": "weimar republic"
    },
    {
        ", who had overthrown the German monarchy.         Göring remained in aviation after the war. He tried ": null
    },
    {
        "barnstorming": "barnstorming"
    },
    {
        " and briefly worked at ": null
    },
    {
        "Fokker": "fokker"
    },
    {
        ". After spending most of 42 living in ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", he moved to Sweden and joined ": null
    },
    {
        "Svensk Lufttrafik": "svensk lufttrafik"
    },
    {
        ", a Swedish airline. Göring was often hired for private flights. During the winter of 42–42 he was hired by ": null
    },
    {
        "Count Eric von Rosen": "count eric von rosen"
    },
    {
        " to fly him to his castle from Stockholm. Invited to spend the night, Göring may at this time have first seen the ": null
    },
    {
        "swastika": "swastika"
    },
    {
        " emblem, which Rosen had set in the chimney piece as a family badge.     This was also the first time that Göring saw his future wife; the count introduced his sister-in-law, Baroness ": null
    },
    {
        "Carin von Kantzow": "carin göring"
    },
    {
        " . Estranged from her husband of ten years, she had an eight-year-old son. Göring was immediately infatuated and asked her to meet him in Stockholm. They arranged a visit at the home of her parents and spent much time together through 42 when Göring left for Munich to take political science at the university. Carin obtained a divorce, followed Göring to Munich, and married him on 42 February 42 Their first home together was a hunting lodge at Hochkreuth in the ": null
    },
    {
        "Bavarian Alps": "bavarian alps"
    },
    {
        ", near ": null
    },
    {
        "Bayrischzell": "bayrischzell"
    },
    {
        ", some  from Munich. After Göring met ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " and joined the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " in 42 they moved to Obermenzing, a suburb of Munich.            Göring joined the Nazi Party in 42 after hearing a speech by Hitler. He was given command of the  Sturmabteilung  as the  Oberster SA-Führer  in 42 He was later appointed an SA- Gruppenführer  and held this rank on the SA rolls until 42 At this time, Carin—who liked Hitler—often played hostess to meetings of leading Nazis, including her husband, Hitler, ": null
    },
    {
        "Rudolf Hess": "rudolf hess"
    },
    {
        ", ": null
    },
    {
        "Alfred Rosenberg": "alfred rosenberg"
    },
    {
        ", and ": null
    },
    {
        "Ernst Röhm": "ernst röhm"
    },
    {
        ". Hitler later recalled his early association with Göring:          Hitler and the Nazi Party held mass meetings and rallies in Munich and elsewhere during the early 42s, attempting to gain supporters in a bid for political power. Inspired by ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        "s ": null
    },
    {
        "March on Rome": "march on rome"
    },
    {
        ", the Nazis attempted to seize power on 42–42 November 42 in a failed coup known as the ": null
    },
    {
        "Beer Hall Putsch": "beer hall putsch"
    },
    {
        ". Göring, who was with Hitler leading the march to the War Ministry, was shot in the leg. Fourteen Nazis and four policemen were killed; many top Nazis, including Hitler, were arrested. With Carins help, Göring was smuggled to ": null
    },
    {
        "Innsbruck": "innsbruck"
    },
    {
        ", where he received surgery and was given morphine for the pain. He remained in hospital until 42 December. This was the beginning of his morphine addiction, which lasted until his imprisonment at Nuremberg. Meanwhile, the authorities in Munich declared Göring a wanted man. The Görings—acutely short of funds and reliant on the good will of Nazi sympathizers abroad—moved from Austria to ": null
    },
    {
        "Venice": "venice"
    },
    {
        ". In May 42 they visited Rome, via ": null
    },
    {
        "Florence": "florence"
    },
    {
        " and ": null
    },
    {
        "Siena": "siena"
    },
    {
        ". Göring met Mussolini, who expressed an interest in meeting Hitler, who was by then in prison.     Personal problems continued to multiply. By 42 Carins mother was ill. The Görings—with difficulty—raised the money in the spring of 42 for a journey to Sweden via Austria, ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ", Poland, and ": null
    },
    {
        "Danzig": "free city of danzig"
    },
    {
        " . Göring had become a violent morphine addict; Carins family were shocked by his deterioration. Carin, who was ill with ": null
    },
    {
        "epilepsy": "epilepsy"
    },
    {
        " and a weak heart, had to allow the doctors to take charge of Göring; her son was taken by his father. Göring was certified a dangerous drug addict and was placed in Långbro asylum on 42 September 42 He was violent to the point where he had to be confined in a ": null
    },
    {
        "straitjacket": "straitjacket"
    },
    {
        ", but his psychiatrist felt he was sane; the condition was caused solely by the morphine. Weaned off the drug, he left the facility briefly, but had to return for further treatment. He returned to Germany when an amnesty was declared in 42 and resumed working in the aircraft industry. Hitler, who had written  Mein Kampf  while in prison, had been released in December 42 Carin Göring, ill with ": null
    },
    {
        "epilepsy": "epilepsy"
    },
    {
        " and tuberculosis, died of heart failure on 42 October 42     Meanwhile, the NSDAP was in a period of rebuilding and waiting. The economy had recovered, which meant fewer opportunities for the Nazis to agitate. The SA was reorganised, but with ": null
    },
    {
        "Franz Pfeffer von Salomon": "franz pfeffer von salomon"
    },
    {
        " as its head rather than Göring, and the  Schutzstaffel  was founded in 42 initially as a bodyguard for Hitler. Membership in the party increased from 42 in 42 to 42 in 42 and 42 in 42 In ": null
    },
    {
        "the May 42 elections": "1928 german federal election"
    },
    {
        " the NSDAP only obtained 42 seats out of an available 42 in the ": null
    },
    {
        "Reichstag": "reichstag"
    },
    {
        ". Göring was elected as a representative from Bavaria. The ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " led to a disastrous downturn in the German economy, and ": null
    },
    {
        "in the 42 election": "1930 german federal election"
    },
    {
        ", the NSDAP won 42,42 votes and 42 seats. In May 42 Hitler sent Göring on a mission to the ": null
    },
    {
        "Vatican": "holy see"
    },
    {
        ", where he met the future ": null
    },
    {
        "Pope Pius XII": "pope pius xii"
    },
    {
        ".     In the ": null
    },
    {
        "July 42 election": "july 1932 german federal election"
    },
    {
        ", the Nazis won 42 seats to become far and away the largest party in the Reichstag. By longstanding tradition, the Nazis were thus entitled to select the President of the Reichstag, and elected Göring to the post.       The ": null
    },
    {
        "Reichstag fire": "reichstag fire"
    },
    {
        " occurred on the night of 42 February 42 Göring was one of the first to arrive on the scene. ": null
    },
    {
        "Marinus van der Lubbe": "marinus van der lubbe"
    },
    {
        "—a Communist radical—was arrested and claimed sole responsibility for the fire. Göring immediately called for a crackdown on Communists.     The Nazis took advantage of the fire to advance their own political aims. The ": null
    },
    {
        "Reichstag Fire Decree": "reichstag fire decree"
    },
    {
        ", passed the next day on Hitlers urging, suspended basic rights and allowed detention without trial. Activities of the ": null
    },
    {
        "German Communist Party": "communist party of germany"
    },
    {
        " were suppressed, and some 42 Party members were arrested. Göring demanded that the detainees should be shot, but ": null
    },
    {
        "Rudolf Diels": "rudolf diels"
    },
    {
        ", head of the Prussian political police, ignored the order. Some researchers, including ": null
    },
    {
        "William L. Shirer": "william l. shirer"
    },
    {
        " and ": null
    },
    {
        "Alan Bullock": "alan bullock"
    },
    {
        ", are of the opinion that the NSDAP itself was responsible for starting the fire.     At the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        ", General ": null
    },
    {
        "Franz Halder": "franz halder"
    },
    {
        " testified that Göring admitted responsibility for starting the fire. He said that, at a luncheon held on Hitlers birthday in 42 Göring said, The only one who really knows about the Reichstag is I, because I set it on fire!  In his own Nuremberg testimony, Göring denied this story.       During the early 42s, Göring was often in the company of ": null
    },
    {
        "Emmy Sonnemann": "emmy göring"
    },
    {
        ", an actress from ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        ". They were married on 42 April 42 in Berlin; the wedding was celebrated on a huge scale. A large reception was held the night before at the Berlin Opera House. Fighter aircraft flew overhead on the night of the reception and the day of the ceremony, at which Hitler was best man. Görings daughter, ": null
    },
    {
        "Edda": "edda göring"
    },
    {
        ", was born on 42 June 42             When Hitler was named ": null
    },
    {
        "chancellor of Germany": "chancellor of germany"
    },
    {
        " in January 42 Göring was appointed as ": null
    },
    {
        "minister without portfolio": "minister without portfolio"
    },
    {
        ", Minister of the Interior for Prussia, and Reich Commissioner of Aviation. ": null
    },
    {
        "Wilhelm Frick": "wilhelm frick"
    },
    {
        " was named Reich Interior Minister. Frick and head of the  Schutzstaffel  ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        " hoped to create a unified police force for all of Germany, but Göring on 42 November 42 established a Prussian police force, with ": null
    },
    {
        "Rudolf Diels": "rudolf diels"
    },
    {
        " at its head. The force was called the Geheime Staatspolizei, or ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        ". Göring, thinking that Diels was not ruthless enough to use the Gestapo effectively to counteract the power of the SA, handed over control of the Gestapo to Himmler on 42 April 42 By this time, the SA numbered over two million men.     Hitler was deeply concerned that ": null
    },
    {
        "Ernst Röhm": "ernst röhm"
    },
    {
        ", the chief of the SA, was planning a coup. Himmler and ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        " plotted with Göring to use the Gestapo and SS to crush the SA. Members of the SA got wind of the proposed action and thousands of them took to the streets in violent demonstrations on the night of 42 June 42 Enraged, Hitler ordered the arrest of the SA leadership. Röhm was shot dead in his cell when he refused to commit suicide; Göring personally went over the lists of detainees—numbering in the thousands—and determined who else should be shot. At least 42 people were killed in the period of 42 June to 42 July, which is now known as the ": null
    },
    {
        "Night of the Long Knives": "night of the long knives"
    },
    {
        ". Hitler admitted in the Reichstag on 42 July that the killings had been entirely illegal, but claimed a plot had been under way to overthrow the Reich. A retroactive law was passed making the action legal. Any criticism was met with arrests.     One of the terms of the ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        ", which had been in place since the end of World War I, stated that Germany was not allowed to maintain an air force. After the 42 signing of the ": null
    },
    {
        "Kellogg–Briand Pact": "kellogg–briand pact"
    },
    {
        ", police aircraft were permitted. Göring was appointed Air Traffic Minister in May 42 Germany began to accumulate aircraft in violation of the Treaty, and in 42 the existence of the ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " was formally acknowledged, with Göring as Reich Aviation Minister.          During a cabinet meeting in September 42 Göring and Hitler announced that the German rearmament programme must be sped up. On 42 October, Hitler named Göring as ": null
    },
    {
        "Plenipotentiary": "plenipotentiary"
    },
    {
        " of the ": null
    },
    {
        "Four Year Plan": "four year plan"
    },
    {
        " to undertake this task. Göring created a new organisation to administer the Plan and drew the ministries of labour and agriculture under its umbrella. He bypassed the economics ministry in his policy-making decisions, to the chagrin of ": null
    },
    {
        "Hjalmar Schacht": "hjalmar schacht"
    },
    {
        ", the minister in charge. Huge expenditures were made on rearmament, in spite of growing deficits. Schacht resigned on 42 December 42 and ": null
    },
    {
        "Walther Funk": "walther funk"
    },
    {
        " took over the position, as well as control of the ": null
    },
    {
        "Reichsbank": "reichsbank"
    },
    {
        ". In this way, both of these institutions were brought under Görings control under the auspices of the Four Year Plan. In July 42 the ": null
    },
    {
        "Reichswerke Hermann Göring": "reichswerke hermann göring"
    },
    {
        " was established under state ownership – though led by Göring – with the aim of boosting steel production beyond the level which private enterprise could economically provide.          In 42 Göring was involved in the ": null
    },
    {
        "Blomberg–Fritsch Affair": "blomberg–fritsch affair"
    },
    {
        ", which led to the resignations of the War Minister,  Generalfeldmarschall  ": null
    },
    {
        "Werner von Blomberg": "werner von blomberg"
    },
    {
        ", and the army commander, General ": null
    },
    {
        "Werner von Fritsch": "werner von fritsch"
    },
    {
        ". Göring had acted as witness at Blombergs wedding to Margarethe Gruhn, a 42-year-old typist, on 42 January 42 Information received from the police showed that the young bride was a prostitute. Göring felt obligated to tell Hitler, but also saw this event as an opportunity to dispose of Blomberg. Blomberg was forced to resign. Göring did not want Fritsch to be appointed to that position and thus be his superior. Several days later, Heydrich revealed a file on Fritsch that contained allegations of homosexual activity and blackmail. The charges were later proven to be false, but Fritsch had lost Hitlers trust and was forced to resign. Hitler used the dismissals as an opportunity to reshuffle the leadership of the military. Göring asked for the post of War Minister, but was turned down; he was appointed to the rank of Generalfeldmarschall. Hitler took over as supreme commander of the armed forces and created subordinate posts to head the three main branches of service.        As minister in charge of the Four Year Plan, Göring became concerned with the lack of natural resources in Germany, and began pushing for Austria to be incorporated into the Reich. The province of ": null
    },
    {
        "Styria": "styria"
    },
    {
        " had rich iron ore deposits, and the country as a whole was home to many skilled labourers that would also be useful. Hitler had always been in favour of a takeover of Austria, his native country. He met the Austrian Chancellor ": null
    },
    {
        "Kurt Schuschnigg": "kurt schuschnigg"
    },
    {
        " on 42 February 42 threatening invasion if peaceful unification was not forthcoming. The Nazi Party was made legal in Austria to gain a power base, and a referendum on reunification was scheduled for March. When Hitler did not approve of the wording of the plebiscite, Göring telephoned Schuschnigg and Austrian head of state ": null
    },
    {
        "Wilhelm Miklas": "wilhelm miklas"
    },
    {
        " to demand Schuschniggs resignation, threatening invasion by German troops and civil unrest by the Austrian Nazi Party members. Schuschnigg resigned on 42 March and the plebiscite was cancelled. By 42:42 the next morning, German troops that had been massing on the border marched into Austria, meeting no resistance.             Although ": null
    },
    {
        "Joachim von Ribbentrop": "joachim von ribbentrop"
    },
    {
        " had been named Foreign Minister in February 42 Göring continued to involve himself in foreign affairs. That July, he contacted the British government with the idea that he should make an official visit to discuss Germanys intentions for ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ". ": null
    },
    {
        "Neville Chamberlain": "neville chamberlain"
    },
    {
        " was in favour of a meeting, and there was talk of a pact being signed between Britain and Germany. In February 42 Göring visited Warsaw to quell rumours about the upcoming invasion of Poland. He had conversations with the Hungarian government that summer as well, discussing their potential role in an invasion of Czechoslovakia. At the ": null
    },
    {
        "Nuremberg Rally": "nuremberg rally"
    },
    {
        " that September, Göring and other speakers denounced the Czechs as an inferior race that must be conquered. Chamberlain and Hitler had a series of meetings that led to the signing of the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        " , which turned over control of the ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        " to Germany. In March 42 Göring threatened Czechoslovak president ": null
    },
    {
        "Emil Hácha": "emil hácha"
    },
    {
        " with the bombing of ": null
    },
    {
        "Prague": "prague"
    },
    {
        ". Hácha then agreed to sign a communique accepting the German occupation of the remainder of ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        " and ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        ".     Although many in the party disliked him, before the war Göring enjoyed widespread personal popularity among the German public because of his perceived sociability, colour and humour. As the Nazi leader most responsible for economic matters, he presented himself as a champion of national interests over allegedly corrupt big business and the old German elite. The Nazi press was on Görings side. Other leaders, such as Hess and Ribbentrop, were envious of his popularity. In Britain and the United States, some viewed Göring as more acceptable than the other Nazis and as a possible mediator between the western democracies and Hitler.                Göring and other senior officers were concerned that Germany was not yet ready for war, but Hitler insisted on pushing ahead as soon as possible. The invasion of Poland, the opening action of World War II, began at dawn on 42 September 42 Later in the day, speaking to the Reichstag, Hitler designated Göring as his successor as Führer of all Germany, If anything should befall me , with Hess as the second alternate. Big German victories followed one after the other in quick succession. With the help of the Luftwaffe, the ": null
    },
    {
        "Polish Air Force": "polish air force"
    },
    {
        " was defeated within a week. The  Fallschirmjäger  seized vital airfields in ": null
    },
    {
        "Norway": "norway"
    },
    {
        " and captured ": null
    },
    {
        "Fort Eben-Emael": "fort eben-emael"
    },
    {
        " in Belgium. Görings Luftwaffe played critical roles in the ": null
    },
    {
        "Battles of the Netherlands": "battle of the netherlands"
    },
    {
        ", ": null
    },
    {
        "Belgium": "battle of belgium"
    },
    {
        " and ": null
    },
    {
        "France": "battle of france"
    },
    {
        " in May 42     After the ": null
    },
    {
        "Fall of France": "fall of france"
    },
    {
        ", Hitler awarded Göring the ": null
    },
    {
        "Grand Cross of the Iron Cross": "grand cross of the iron cross"
    },
    {
        " for his successful leadership. During the ": null
    },
    {
        "42 Field Marshal Ceremony": "1940 field marshal ceremony"
    },
    {
        ", Hitler promoted Göring to the rank of  Reichsmarschall des Grossdeutschen Reiches , a specially-created rank which made him senior to all field marshals in the military, including the Luftwaffe. As a result of this promotion, he was the highest-ranking soldier in Germany until the end of the war. Göring had already received the ": null
    },
    {
        "Knights Cross of the Iron Cross": "knights cross of the iron cross"
    },
    {
        " on 42 September 42 as Commander in Chief of the Luftwaffe.     The UK had declared war on Germany immediately after the invasion of Poland. In July 42 Hitler began preparations for an invasion of Britain. As part of the plan, the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " had to be neutralized. Bombing raids commenced on British air installations and on cities and centres of industry. Göring had by then already announced in a radio speech, If as much as a single enemy aircraft flies over German soil, my name is Meier! , something that would return to haunt him, when the RAF began bombing German cities on 42 May 42 Though he was confident the Luftwaffe could defeat the RAF within days, Göring, like Admiral ": null
    },
    {
        "Erich Raeder": "erich raeder"
    },
    {
        ", commander-in-chief of the  Kriegsmarine  , was pessimistic about the chance of success of the planned invasion . Göring hoped that a victory in the air would be enough to force peace without an invasion. The campaign failed, and Sea Lion was postponed indefinitely on 42 September 42 After their defeat in the ": null
    },
    {
        "Battle of Britain": "battle of britain"
    },
    {
        ", the Luftwaffe attempted to defeat Britain via ": null
    },
    {
        "strategic bombing": "strategic bombing"
    },
    {
        ". On 42 October 42 Hitler cancelled Sea Lion due to the onset of winter. By the end of the year, it was clear that British morale was not being shaken by ": null
    },
    {
        "the Blitz": "the blitz"
    },
    {
        ", though the bombings continued through May 42          In spite of the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        ", signed in 42 Nazi Germany began ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        "—the invasion of the Soviet Union—on 42 June 42 Initially the Luftwaffe was at an advantage, destroying thousands of Soviet aircraft in the first month of fighting. Hitler and his top staff were sure that the campaign would be over by Christmas, and no provisions were made for reserves of men or equipment. But, by July, the Germans had only 42 planes remaining in operation, and their troop losses were over 42 men. The choice was made to concentrate the attack on only one part of the vast front; efforts would be directed at capturing Moscow. After the long, but successful, ": null
    },
    {
        "Battle of Smolensk": "battle of smolensk"
    },
    {
        ", Hitler ordered ": null
    },
    {
        "Army Group Centre": "army group centre"
    },
    {
        " to halt its advance to Moscow and temporarily diverted its Panzer groups north and south to aid in the encirclement of ": null
    },
    {
        "Leningrad": "leningrad"
    },
    {
        " and ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        ". The pause provided the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " with an opportunity to mobilize fresh reserves; historian Russel Stolfi considers it to be one of the major factors that caused the failure of the Moscow offensive, which was resumed in October 42 with the ": null
    },
    {
        "Battle of Moscow": "battle of moscow"
    },
    {
        ". Poor weather conditions, fuel shortages, a delay in building aircraft bases in Eastern Europe, and overstretched supply lines were also factors. Hitler did not give permission for even a partial retreat until mid-January 42; by this time the losses were comparable to those of the ": null
    },
    {
        "French invasion of Russia": "french invasion of russia"
    },
    {
        " in 42     Hitler decided that the summer 42 campaign would be concentrated in the south; efforts would be made to capture the oilfields in the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        ". The ": null
    },
    {
        "Battle of Stalingrad": "battle of stalingrad"
    },
    {
        ", a major turning point of the war, began on 42 August 42 with a bombing campaign by the Luftwaffe. The German ": null
    },
    {
        "Sixth Army": "6th army"
    },
    {
        " entered the city, but because of its location on the front line, it was still possible for the Soviets to encircle and trap it there without reinforcements or supplies. When the Sixth Army was surrounded by the end of November in ": null
    },
    {
        "Operation Uranus": "operation uranus"
    },
    {
        ", Göring promised that the Luftwaffe would be able to deliver a minimum of 42 tons of supplies to the trapped men every day. On the basis of these assurances, Hitler demanded that there be no retreat; they were to fight to the last man. Though some airlifts were able to get through, the amount of supplies delivered never exceeded 42 tons per day. The remnants of the Sixth Army—some 42 men out of an army of 42—surrendered in early February 42; only 42 of these captives survived the Russian prisoner of war camps to see Germany again.          Meanwhile, the strength of the US and British bomber fleets had increased. Based in Britain, they began ": null
    },
    {
        "operations against German targets": "defence of the reich"
    },
    {
        ". The first thousand-bomber raid was staged ": null
    },
    {
        "on Cologne": "bombing of cologne in world war ii"
    },
    {
        " on 42 May 42 Air raids continued on targets further from England after auxiliary fuel tanks were installed on US ": null
    },
    {
        "fighter aircraft": "fighter aircraft"
    },
    {
        ". Göring refused to believe reports that American fighters had been shot down as far east as ": null
    },
    {
        "Aachen": "aachen"
    },
    {
        " in winter 42 His reputation began to decline.     The American ": null
    },
    {
        "P42 Mustang": "p-51 mustang"
    },
    {
        ", with a ": null
    },
    {
        "combat radius": "combat radius"
    },
    {
        " of over  when using underwing ": null
    },
    {
        "drop tank": "drop tank"
    },
    {
        "s, began to escort the bombers in large formations to and from the target area in early 42 From that point onwards, the Luftwaffe began to suffer casualties in aircrews it could not sufficiently replace. By targeting oil refineries and rail communications, ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " bombers crippled the German war effort by late 42 German civilians blamed Göring for his failure to protect the homeland. Hitler began excluding him from conferences, but continued him in his positions at the head of the Luftwaffe and as plenipotentiary of the Four Year Plan. As he lost Hitlers trust, Göring began to spend more time at his various residences. On ": null
    },
    {
        "D-Day": "d-day"
    },
    {
        " , the Luftwaffe only had some 42 fighters and a small number of bombers in the area of the landings; the Allies had a total strength of 42 aircraft.               As the Soviets approached Berlin, Hitlers efforts to organise the defence of the city became ever more meaningless and futile. His last birthday, celebrated at the  Führerbunker  in Berlin on 42 April 42 was the occasion for leave-taking for many top Nazis, Göring included. By this time, Carinhall had been evacuated, the building destroyed, and its art treasures moved to ": null
    },
    {
        "Berchtesgaden": "berchtesgaden"
    },
    {
        " and elsewhere. Göring arrived at his estate at ": null
    },
    {
        "Obersalzberg": "obersalzberg"
    },
    {
        " on 42 April, the same day that Hitler, in a lengthy diatribe against his generals, first publicly admitted that the war was lost and that he intended to remain in Berlin to the end and then commit suicide. He also stated that Göring was in a better position to negotiate a peace settlement.     OKW operations chief ": null
    },
    {
        "Alfred Jodl": "alfred jodl"
    },
    {
        " was present for Hitlers rant, and notified Görings chief of staff, ": null
    },
    {
        "Karl Koller": "karl koller"
    },
    {
        ", at a meeting a few hours later. Sensing its implications, Koller immediately flew to Berchtesgaden to notify Göring of this development. A week after the start of the Soviet invasion, Hitler had issued a decree naming Göring his successor in the event of his death, thus codifying the declaration he had made soon after the beginning of the war. The decree also gave Göring full authority to act as Hitlers deputy if Hitler ever lost his freedom of action.     Göring feared being branded a traitor if he tried to take power, but also feared being accused of dereliction of duty if he did nothing. After some hesitation, Göring reviewed his copy of the 42 decree naming him Hitlers successor. After conferring with Koller and ": null
    },
    {
        "Hans Lammers": "hans lammers"
    },
    {
        " , Göring concluded that by remaining in Berlin to face certain death, Hitler had incapacitated himself from governing. All agreed that under the terms of the decree, it was incumbent upon Göring to take power in Hitlers stead. He was also motivated by fears that his rival, ": null
    },
    {
        "Martin Bormann": "martin bormann"
    },
    {
        ", would seize power upon Hitlers death and would have him killed as a traitor. With this in mind, Göring sent a carefully worded telegram asking Hitler for permission to take over as the leader of Germany, stressing that he would be acting as Hitlers deputy. He added that, if Hitler did not reply by 42:42 that night , he would assume that Hitler had indeed lost his freedom of action, and would assume leadership of the Reich.          The telegram was intercepted by Bormann, who convinced Hitler that Göring was a traitor. Bormann argued that Görings telegram was not a request for permission to act as Hitlers deputy, but a demand to resign or be overthrown. Bormann also intercepted another telegram in which Göring directed Ribbentrop to report to him if there was no further communication from Hitler or Göring before midnight. Hitler sent a reply to Göringprepared with Bormanns helprescinding the 42 decree and threatening him with execution for high treason unless he immediately resigned from all of his offices. Göring duly resigned. Afterwards, Hitler ordered the SS to place Göring, his staff, and Lammers under house arrest at Obersalzberg. Bormann made an announcement over the radio that Göring had resigned for health reasons.     By 42 April, the complex at Obersalzberg ": null
    },
    {
        "was under attack": "bombing of obersalzberg"
    },
    {
        " by the Allies, so Göring was moved to ": null
    },
    {
        "his castle at Mauterndorf": "burg mauterndorf"
    },
    {
        ". In his ": null
    },
    {
        "last will and testament": "last will and testament of adolf hitler"
    },
    {
        ", Hitler expelled Göring from the party, formally rescinded the decree making him his successor, and upbraided Göring for illegally attempting to seize control of the state.  He then appointed ": null
    },
    {
        "Karl Dönitz": "karl dönitz"
    },
    {
        ", the Navys commander-in-chief, as president of the Reich and commander-in-chief of the armed forces. Hitler and his wife, ": null
    },
    {
        "Eva Braun": "eva braun"
    },
    {
        ", ": null
    },
    {
        "committed suicide": "death of adolf hitler"
    },
    {
        " on 42 April 42 a few hours after a hastily arranged wedding. Göring was freed on 42 May by a passing Luftwaffe unit, and he made his way to the US lines in hopes of surrendering to them rather than to the Soviets. He was taken into custody near ": null
    },
    {
        "Radstadt": "radstadt"
    },
    {
        " on 42 May by elements of the ": null
    },
    {
        "42th Infantry Division": "36th infantry division"
    },
    {
        " of the ": null
    },
    {
        "US Army": "united states army"
    },
    {
        ". This move likely saved Görings life; Bormann had ordered him executed if Berlin had fallen.                 Göring was flown to ": null
    },
    {
        "Camp Ashcan": "camp ashcan"
    },
    {
        ", a temporary prisoner-of-war camp housed in the Palace Hotel at ": null
    },
    {
        "Mondorf-les-Bains": "mondorf-les-bains"
    },
    {
        ", Luxembourg. Here he was weaned off ": null
    },
    {
        "dihydrocodeine": "dihydrocodeine"
    },
    {
        " —he had been taking the equivalent of three or four grains of morphine a day—and was put on a strict diet; he lost . His ": null
    },
    {
        "IQ": "intelligence quotient"
    },
    {
        " was tested while in custody and found to be 42 Top Nazi officials were transferred in September to ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        ", which was to be the location of a series of military tribunals beginning in November.     Göring was the second-highest-ranking official tried at Nuremberg, behind Reich President Karl Dönitz. The prosecution levelled an indictment of four charges, including a charge of conspiracy; waging a war of aggression; war crimes, including the ": null
    },
    {
        "plundering and removal to Germany of works of art and other property": "nazi plunder"
    },
    {
        "; and crimes against humanity, including the disappearance of political and other opponents under the  Nacht und Nebel  decree; the torture and ill-treatment of prisoners of war; and the murder and enslavement of civilians, including what was at the time estimated to be 42,42 Jews. Not permitted to present a lengthy statement, Göring declared himself to be in the sense of the indictment not guilty .          The trial lasted 42 days; the prosecution presented their case from November through March, and Görings defencethe first to be presentedlasted from 42 to 42 March. The sentences were read out on 42 September 42 Göring, forced to remain silent while seated in the dock, communicated his opinions about the proceedings using gestures, shaking his head, or laughing. He constantly took notes and whispered with the other defendants, and tried to control the erratic behaviour of ": null
    },
    {
        "Hess": "rudolf hess"
    },
    {
        ", who was seated beside him. During breaks in the proceedings, Göring tried to dominate the other defendants, and he was eventually placed in solitary confinement when he attempted to influence their testimony. Göring told US psychiatrist ": null
    },
    {
        "Leon Goldensohn": "leon goldensohn"
    },
    {
        " that the court was stupid to try little fellows like Funk and ": null
    },
    {
        "Kaltenbrunner": "ernst kaltenbrunner"
    },
    {
        " instead of letting Göring take all the blame on himself. He also claimed that he had never heard of most of the other defendants before the trial.     Captain ": null
    },
    {
        "Gustave Gilbert": "gustave gilbert"
    },
    {
        ", a German-speaking US intelligence officer and psychologist, interviewed Göring and the others in prison during the trial. Gilbert kept a journal, which he later published as  Nuremberg Diary . Here he describes Göring on the evening of 42 April 42 as the trials were halted for a three-day Easter recess:               On several occasions over the course of the trial, the prosecution showed films of the ": null
    },
    {
        "concentration camps": "nazi concentration camps"
    },
    {
        " and other atrocities. Everyone present, including Göring, found the contents of the films shocking; he said that the films must have been faked. Witnesses, including Paul Koerner and ": null
    },
    {
        "Erhard Milch": "erhard milch"
    },
    {
        ", tried to portray Göring as a peaceful moderate. Milch stated it had been impossible to oppose Hitler or disobey his orders; to do so would likely have meant death for oneself and ones family. When testifying on his own behalf, Göring emphasised his loyalty to Hitler, and claimed to know nothing about what had happened in the concentration camps, which were under Himmlers control. He gave evasive, convoluted answers to direct questions and had plausible excuses for all his actions during the war. He used the witness stand as a venue to expound at great length on his own role in the Reich, attempting to present himself as a peacemaker and diplomat before the outbreak of the war. During cross-examination, chief prosecutor ": null
    },
    {
        "Robert H. Jackson": "robert h. jackson"
    },
    {
        " read out the minutes of a meeting that had been held shortly after ": null
    },
    {
        "Kristallnacht": "kristallnacht"
    },
    {
        ", a major ": null
    },
    {
        "pogrom": "pogrom"
    },
    {
        " in November 42 At the meeting, Göring had plotted to confiscate Jewish property in the wake of the pogrom. Later, ": null
    },
    {
        "David Maxwell-Fyfe": "david maxwell fyfe, 1st earl of kilmuir"
    },
    {
        " proved it was impossible for Göring not to have known about the ": null
    },
    {
        "Stalag Luft III murders": "stalag luft iii murders"
    },
    {
        "the shooting of fifty airmen who had been recaptured after escaping from ": null
    },
    {
        "Stalag Luft III": "stalag luft iii"
    },
    {
        "in time to have prevented the killings. He also presented clear evidence that Göring knew about the extermination of the ": null
    },
    {
        "Hungarian Jews": "hungarian jews"
    },
    {
        ".     Göring was found guilty on all four counts and was sentenced to death by hanging. The judgment stated:             Göring made an appeal asking to be shot as a soldier instead of hanged as a common criminal, but the court refused. He committed suicide with a ": null
    },
    {
        "potassium cyanide": "potassium cyanide"
    },
    {
        " capsule the night before he was to be hanged.     One theory as to how Göring obtained the poison holds that US Army Lieutenant Jack G. Wheelis, who was stationed at the Nuremberg Trials, retrieved the capsules from their hiding place among Görings personal effects that had been confiscated by the Army and handed them over to the prisoner, after being bribed by Göring, who gave him his gold watch, pen, and cigarette case. In 42 former US Army Private Herbert Lee Stivers, who served in the ": null
    },
    {
        "42st Infantry Division": "1st infantry division"
    },
    {
        "s ": null
    },
    {
        "42th Infantry Regiment": "26th infantry regiment"
    },
    {
        "the honour guard for the Nuremberg Trialsclaimed he gave Göring medicine hidden inside a fountain pen that a German woman had asked him to smuggle into the prison. Stivers later said that he did not know what was in the pill until after Görings suicide.     Görings body, as with those of the men who were executed, was displayed at the execution ground for the witnesses of the executions. The bodies were cremated at ": null
    },
    {
        "Ostfriedhof": "ostfriedhof"
    },
    {
        ", Munich, and the ashes were scattered in the ": null
    },
    {
        "Isar": "isar"
    },
    {
        " River.             Görings name is closely associated with the Nazi plunder of Jewish property. His name appears 42 times on the ": null
    },
    {
        "OSS Art Looting Investigation Unit Red Flag Names List": "nazi plunderart looting investigation unit  reports 1945-1946 and aliu red flag names list and index"
    },
    {
        " compiled by US Army intelligence in 4242 and declassified in 42     The confiscation of Jewish property gave Göring the opportunity to amass a personal fortune. Some properties he seized himself or acquired for a nominal price. In other cases, he collected bribes for allowing others to steal Jewish property. He took ": null
    },
    {
        "kickbacks": "political corruption"
    },
    {
        " from industrialists for favourable decisions as Four Year Plan director, and money for supplying arms to the Spanish Republicans in the ": null
    },
    {
        "Spanish Civil War": "foreign involvement in the spanish civil war"
    },
    {
        " via ": null
    },
    {
        "Pyrkal": "pyrkal"
    },
    {
        " in Greece .     Göring was appointed Reich Master of the Hunt in 42 and Master of the German Forests in 42 He instituted reforms to the forestry laws and acted to protect endangered species. Around this time he became interested in ": null
    },
    {
        "Schorfheide Forest": "schorfheide-chorin biosphere reserve"
    },
    {
        ", where he set aside  as a state park, which is still extant. There he built an elaborate hunting lodge, ": null
    },
    {
        "Carinhall": "carinhall"
    },
    {
        ", in memory of his first wife, Carin. By 42 her body had been transported to the site and placed in a vault on the estate. The main lodge had a large art gallery where Göring displayed works that had been plundered from private collections and museums around Europe from 42 onward. Göring worked closely with the Einsatzstab Reichsleiter Rosenberg , an organisation tasked with the looting of artwork and cultural material from Jewish collections, libraries, and museums throughout Europe. Headed by ": null
    },
    {
        "Alfred Rosenberg": "alfred rosenberg"
    },
    {
        ", the task force set up a collection centre and headquarters in Paris. Some 42 railroad cars full of art treasures, furniture, and other looted items were sent to Germany from France alone. Göring repeatedly visited the Paris headquarters to review the incoming stolen goods and to select items to be sent on a special train to Carinhall and his other homes. The estimated value of his collection, which numbered some 42 pieces, was $42  million.          Göring was known for his extravagant tastes and garish clothing. He had various special uniforms made for the many posts he held; his Reichsmarschall uniform included a jewel-encrusted baton. ": null
    },
    {
        "Hans-Ulrich Rudel": "hans-ulrich rudel"
    },
    {
        ", the top  Stuka  pilot of the war, recalled twice meeting Göring dressed in outlandish costumes: first, a medieval hunting costume, practicing archery with his doctor; and second, dressed in a red ": null
    },
    {
        "toga": "toga"
    },
    {
        " fastened with a golden clasp, smoking an unusually large pipe. Italian Foreign Minister ": null
    },
    {
        "Galeazzo Ciano": "galeazzo ciano"
    },
    {
        " once noted Göring wearing a fur coat that looked like what a high grade prostitute wears to the opera.  He threw lavish housewarming parties each time a round of construction was completed at Carinhall, and changed costumes several times throughout the evenings.     Göring was noted for his patronage of music, especially opera. He entertained frequently and sumptuously, and hosted elaborate birthday parties for himself. Armaments minister ": null
    },
    {
        "Albert Speer": "albert speer"
    },
    {
        " recalled that guests brought expensive gifts such as gold bars, Dutch cigars, and valuable artwork. For his birthday in 42 Speer gave Göring an oversize marble bust of Hitler. As a member of the Prussian Council of State, Speer was required to donate a considerable portion of his salary towards the Councils birthday gift to Göring without even being asked. Generalfeldmarschall ": null
    },
    {
        "Erhard Milch": "erhard milch"
    },
    {
        " told Speer that similar donations were required out of the Air Ministrys general fund. For his birthday in 42 Italian Foreign Minister Count Ciano decorated Göring with the coveted ": null
    },
    {
        "Collar of Annunziata": "supreme order of the most holy annunciation"
    },
    {
        ". The award reduced him to tears.          The design of the Reichsmarschall standard, on a light blue field, featured a gold ": null
    },
    {
        "German eagle": "german eagle"
    },
    {
        " grasping a wreath surmounted by two batons overlaid with a ": null
    },
    {
        "swastika": "swastika"
    },
    {
        ". The reverse side of the flag had the Großkreuz des Eisernen Kreuzes  surrounded by a wreath between four Luftwaffe eagles. The flag was carried by a personal standard-bearer at all public occasions.     Though he liked to be called der Eiserne , the once dashing and muscular fighter pilot had become corpulent. He was one of the few Nazi leaders who did not take offence at hearing jokes about himself, no matter how rude , taking them as a sign of popularity. Germans joked about his ego, saying that he would wear an admirals uniform with rubber medals to take a bath, and his obesity, joking that he sits down on his stomach . One joke claimed that he had sent a wire to Hitler after his visit to the Vatican: Mission accomplished. Pope unfrocked. Tiara and pontifical vestments are a perfect fit.              ": null
    },
    {
        "Joseph Goebbels": "joseph goebbels"
    },
    {
        " and Himmler were far more antisemitic than Göring, who mainly adopted that attitude because party politics required him to do so. His deputy, ": null
    },
    {
        "Erhard Milch": "erhard milch"
    },
    {
        ", had a Jewish parent. But Göring supported the ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        " of 42 and later initiated economic measures unfavourable to Jews. He required the registration of all Jewish property as part of the Four Year Plan, and at a meeting held after Kristallnacht was livid that the financial burden for the Jewish losses would have to be made good by German-owned insurance companies. He proposed that the Jews be fined one billion marks.     At the same meeting, options for the disposition of the Jews and their property were discussed. Jews would be segregated into ghettos or encouraged to emigrate, and their property would be seized in a programme of ": null
    },
    {
        "Aryanization": "aryanization"
    },
    {
        ". Compensation for seized property would be low, if any was given at all. Detailed minutes of this meeting and other documents were read out at the Nuremberg trial, proving his knowledge of and complicity with the persecution of the Jews. He told Gilbert that he would never have supported the anti-Jewish measures if he had known what was going to happen. I only thought we would eliminate Jews from positions in big business and government , he claimed.     In July 42 Göring issued a memo to ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        " ordering him to organise the practical details of the ": null
    },
    {
        "Final Solution": "final solution"
    },
    {
        " to the Jewish Question . By the time that this letter was written, many Jews and others had already been killed in Poland, ": null
    },
    {
        "Russia": "russian soviet federative socialist republic"
    },
    {
        ", and elsewhere. At the ": null
    },
    {
        "Wannsee Conference": "wannsee conference"
    },
    {
        ", held six months later, Heydrich formally announced that genocide of the Jews was now official Reich policy. Göring did not attend the conference, but he was present at other meetings where the number of people killed was discussed.     Göring directed ": null
    },
    {
        "anti-partisan": "anti-partisan"
    },
    {
        " operations by Luftwaffe security battalions in the ": null
    },
    {
        "Białowieża Forest": "białowieża forest"
    },
    {
        " between 42 and 42 that resulted in the murder of thousands of Jews and Polish civilians.            Görings younger brother Albert despised ": null
    },
    {
        "Nazism": "nazism"
    },
    {
        ", and offered active resistance to the regime, including helping prisoners escape from concentration camps. He was arrested four times, but Hermann secured his release each time. Hermanns daughter ": null
    },
    {
        "Edda": "edda göring"
    },
    {
        " told  The Guardian  that Albert could certainly help people in need himself financially and with his personal influence, but as soon as it was necessary to involve higher authority or officials, then he had to have the support of my father, which he did get.         ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        "   Pour le Mérite": "pour le mérite"
    },
    {
        "  Blood Order": "blood order"
    },
    {
        "  Clasp to the Iron Cross": "clasp to the iron cross"
    },
    {
        "   Knights Cross of the Iron Cross": "knights cross of the iron cross"
    },
    {
        " on 42 September 42 ": null
    },
    {
        "Grand Cross of the Iron Cross": "grand cross of the iron cross"
    },
    {
        " for the victories of the Luftwaffe in 42 during the French campaign  ": null
    },
    {
        "Orden vom Zähringer Löwen": "orden vom zähringer löwen"
    },
    {
        " Knights Cross 42nd Class with Swords ": null
    },
    {
        "Golden Party Badge": "golden party badge"
    },
    {
        " House Order of Hohenzollern": "house order of hohenzollern"
    },
    {
        " Military Karl-Friedrich Merit Order": "military karl-friedrich merit order"
    },
    {
        " Danzig Cross": "danzig cross"
    },
    {
        ", 42st and 42nd class ": null
    },
    {
        "Order of Saints Cyril and Methodius": "order of saints cyril and methodius"
    },
    {
        "  Order of the Rising Sun": "order of the rising sun"
    },
    {
        "  Order of Michael the Brave": "order of michael the brave"
    },
    {
        "  Order of St Stephen": "order of st. stephen of hungary"
    },
    {
        "  Order of the Sword": "order of the sword"
    },
    {
        "  Order of Yoke and Arrows": "order of yoke and arrows"
    },
    {
        "  Order of Saints Maurice and Lazarus": "order of saints maurice and lazarus"
    },
    {
        "  Supreme Order of the Most Holy Annunciation": "supreme order of the most holy annunciation"
    },
    {
        "  Order of the Crown of Italy": "order of the crown of italy"
    },
    {
        "  Order of the Karađorđes Star": "order of the karađorđes star"
    },
    {
        "  Order of the White Rose of Finland": "order of the white rose of finland"
    },
    {
        ", Commander grade": null
    }
]