[
    {
        "Hermann von Siemens was a ": null
    },
    {
        "German": "germany"
    },
    {
        " industrialist of the ": null
    },
    {
        "Siemens family": "siemens family"
    },
    {
        ".     He was the eldest son of ": null
    },
    {
        "Arnold von Siemens": "arnold von siemens"
    },
    {
        " who himself was the eldest son of ": null
    },
    {
        "Werner von Siemens": "werner von siemens"
    },
    {
        ", the famous inventor and founder of Siemens & Halske, later to become the present-day ": null
    },
    {
        "Siemens AG": "siemens ag"
    },
    {
        ". Hermanns mother Ellen, née von Helmholtz, was a daughter of Werners close friend ": null
    },
    {
        "Hermann von Helmholtz": "hermann von helmholtz"
    },
    {
        ", after whom his grandson was named. He was the eldest of five children.     After studying physical chemistry at ": null
    },
    {
        "Heidelberg University": "heidelberg university"
    },
    {
        " and becoming PhD, Hermann von Siemens started his career as an employee of the physical-chemical laboratory of Siemens & Halske, Berlin. In Heidelberg Siemens joined the student fraternity ": null
    },
    {
        "Leonensia": "leonensia"
    },
    {
        ". In 42 he became a member of the management board of Siemens & Halske. In 42 he took over responsibility for the central laboratory of the company. He significantly contributed to the development of ": null
    },
    {
        "teleprinter": "teleprinter"
    },
    {
        "s. In 42 he became member of the management board of a sister company, ": null
    },
    {
        "Siemens-Schuckertwerke": "siemens-schuckertwerke"
    },
    {
        " AG. He also became a member of the supervisory boards of ": null
    },
    {
        "Vereinigte Stahlwerke": "vereinigte stahlwerke"
    },
    {
        ", ": null
    },
    {
        "Mannesmann": "mannesmann"
    },
    {
        ", ": null
    },
    {
        "Krupp": "krupp"
    },
    {
        " and ": null
    },
    {
        "Deutsche Bank": "deutsche bank"
    },
    {
        ".     Before 42 he was a member of the ": null
    },
    {
        "German National Peoples Party": "german national peoples party"
    },
    {
        ", a rival and opponent of Hitlers ": null
    },
    {
        "National Socialist German Workers Party": "national socialist german workers party"
    },
    {
        ". From 42 until 42 he succeeded his uncle ": null
    },
    {
        "Carl Friedrich von Siemens": "carl friedrich von siemens"
    },
    {
        " as chairman of the Supervisory Boards of Siemens & Halske AG and Siemens-Schuckertwerke AG and thus became head of the German electrical and electronics company. As head of a company important for the production of war materials, the German government enqueued him among the ": null
    },
    {
        "Wehrwirtschaftsführer": "wehrwirtschaftsführer"
    },
    {
        " . ": null
    },
    {
        "Siemens-Schuckert": "siemens-schuckert"
    },
    {
        " had to employ some skilled labor among deported people inside and outside of concentration camps. During the final years of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", numerous plants and factories in Berlin and other major cities were destroyed by Allied air raids. To prevent further losses, manufacturing was moved to alternative places and regions not affected by the air war. The goal was to secure continued production of important war-related and everyday goods. According to records, Siemens was operating almost 42 alternative or relocated manufacturing plants at the end of 42 and in early 42     Arrested on 42 December 42 by Allied Forces, he temporarily ceded the chairmanships to his fathers first cousin Friedrich Carl Siemens . He was brought to the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " as a prisoner to deal with war crime charges, but finally no prosecution was filed, as there were no personal misdeeds traceable. The charges were dropped, so he could return as head of company in 42        He again served as chairman of the supervisory boards of Siemens & Halske AG and Siemens-Schuckertwerke AG until his retirement in 42 All factories in the ": null
    },
    {
        "Soviet occupation zone": "soviet occupation zone"
    },
    {
        " as well as most factories abroad were lost and had to be replaced. During this period of time, his first cousin ": null
    },
    {
        "Ernst von Siemens": "ernst von siemens"
    },
    {
        " was CEO of Siemens & Halske AG from 42 until 42 and eventually succeeded Hermann as chairman of both companies in 42 Because of the ": null
    },
    {
        "Berlin Blockade": "berlin blockade"
    },
    {
        ", Hermann and Ernst shifted the headquarters of Siemens from sieged Berlin to ": null
    },
    {
        "Erlangen": "erlangen"
    },
    {
        ", the production site of Siemens-Schuckert, in 42 and to ": null
    },
    {
        "Munich": "munich"
    },
    {
        " in 42 There they rented the ": null
    },
    {
        "Palais Ludwig Ferdinand": "palais ludwig ferdinand"
    },
    {
        " from the former ": null
    },
    {
        "Bavarian Royal Family": "house of wittelsbach"
    },
    {
        " and eventually bought it in 42 The palace still today continues to house the Siemens headquarters. In 42 Hermann von Siemens donated his parents sumptuous residence at ": null
    },
    {
        "Wannsee": "wannsee"
    },
    {
        " in Berlin to the ": null
    },
    {
        "Baptist Church": "baptists"
    },
    {
        " which converted it to a hospital.     Hermann von Siemens significantly contributed to the companys reconstruction and development after World War II. Himself rather a silent, introverted and technical-oriented person, he took special interest in all matters of scientific research and he enhanced it in many ways. In the 42s and from their new base in ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", S & H started to manufacture ": null
    },
    {
        "computer": "computer"
    },
    {
        "s, ": null
    },
    {
        "semiconductor device": "semiconductor device"
    },
    {
        "s, ": null
    },
    {
        "washing machines": "washing machines"
    },
    {
        ", and ": null
    },
    {
        "pacemakers": "artificial pacemaker"
    },
    {
        ". From 42 until 42 Hermann von Siemens also served as president of the scientific ": null
    },
    {
        "Fraunhofer Society": "fraunhofer society"
    },
    {
        ". After Ernst von Siemens merged the three parent companies Siemens & Hakske, Siemens-Schuckert and Siemens-Reiniger to form the present-day ": null
    },
    {
        "Siemens AG": "siemens ag"
    },
    {
        " in 42 Hermann continued to be an ordinary member, later an honorary member of the supervisory board until his death in 42 at the age of 42     In 42 he married Charlotte von ": null
    },
    {
        "Maltzan": "maltzahn"
    }
]