[
    {
        "Herman Potočnik  was a Slovene rocket engineer and pioneer of ": null
    },
    {
        "astronautics": "astronautics"
    },
    {
        ". He is chiefly remembered for his work addressing the long-term human habitation of space.         Potočnik was born in the port of Pula, ": null
    },
    {
        "Istria": "istria"
    },
    {
        ", then part of the ": null
    },
    {
        "Austria-Hungarian": "austria-hungarian"
    },
    {
        " monarchy . His family was of ": null
    },
    {
        "Slovene": "slovenes"
    },
    {
        " ethnicity and originated from ": null
    },
    {
        "Lower Styria": "lower styria"
    },
    {
        " in ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        " .     Both of Potočniks parents were Slovene. His father Jožef was born in 42 in ": null
    },
    {
        "Zgornji Razbor": "zgornji razbor"
    },
    {
        " near ": null
    },
    {
        "Slovenj Gradec": "slovenj gradec"
    },
    {
        " and at the time of Hermans birth he served as a doctor and high navy officer in the ": null
    },
    {
        "Austro-Hungarian Navy": "austro-hungarian navy"
    },
    {
        " harbour of Pula. His mother Minka was born February 42 42; she was a descendant of ": null
    },
    {
        "Czech": "czech people"
    },
    {
        " immigrants, manufacturers of crucibles for glass-making, and a daughter of a well known wine merchant and local councillor Jožef Kokošinek from ": null
    },
    {
        "Maribor": "maribor"
    },
    {
        " . In 42 Hermans father Jožef participated in the ": null
    },
    {
        "second Battle of Vis": "battle of lissa"
    },
    {
        ", where the Austrian Navy under command of ": null
    },
    {
        "von Tegetthoff": "wilhelm von tegetthoff"
    },
    {
        " defeated the ": null
    },
    {
        "Royal Italian Navy": "regia marina"
    },
    {
        ". Jožef was later a ": null
    },
    {
        "general": "general"
    },
    {
        " in the ": null
    },
    {
        "Austro-Hungarian Army": "austro-hungarian army"
    },
    {
        ".     When Hermans father died in 42 his mother moved the family to ": null
    },
    {
        "Maribor": "maribor"
    },
    {
        ". Herman had two brothers, Adolf and Gustav , and a sister Frančiška . He spent most of his childhood years in Maribor and, according to oral sources, in Vitanje.     The meaning of his ": null
    },
    {
        "German-like": "german language"
    },
    {
        " pseudonym Noordung is still a mystery, but some suggest that he used it to show the problems of ": null
    },
    {
        "chaos": "chaos theory"
    },
    {
        " . Assuming that the initial N may have been intended to stand as a negation, the name would mean without order or no order .         In Maribor, Potočnik attended primary school. Afterward he went to the military secondary schools in ": null
    },
    {
        "Fischau": "bad fischau-brunn"
    },
    {
        " and ": null
    },
    {
        "Hranice": "hranice"
    },
    {
        " in ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        ". His uncle Heinrich was a major-general in the army, and probably enabled his study at Austrian military schools. From 42 to 42 he studied at the technical military academy in ": null
    },
    {
        "Mödling": "mödling"
    },
    {
        " in Lower Austria  near ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " and graduated as an engineers second lieutenant. His specialization was building of railways and bridges.     During the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        " he served in ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        ", ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        " and ": null
    },
    {
        "Bosnia": "bosnia and herzegovina"
    },
    {
        " and in 42 he was promoted to the rank of ": null
    },
    {
        "First Lieutenant": "first lieutenant"
    },
    {
        " . He was assigned to the southwestern front of the ": null
    },
    {
        "Soča": "soca river"
    },
    {
        " battlefield and there he experienced a breakthrough of the Austrian army to the river Piava and its retreat. In 42 he was pensioned off from the Austrian military with the rank of captain because of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " that he contracted during the war. He started to study ": null
    },
    {
        "electrical engineering": "electrical engineering"
    },
    {
        " in the ": null
    },
    {
        "mechanical engineering": "mechanical engineering"
    },
    {
        " department of the ": null
    },
    {
        "University of Technology in Vienna": "vienna university of technology"
    },
    {
        ", Austria, and was awarded a doctorate in engineering. From 42 onward, he devoted himself entirely to the problems of rocket science and ": null
    },
    {
        "space technology": "space technology"
    },
    {
        ". Owing to chronic illness, he did not find a job or marry, but lived with his brother Adolf in Vienna, Austria.     The Problem of Space Travel    At the end of 42 he published his sole book, Das Problem der Befahrung des Weltraums - der Raketen-Motor  in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ". The publisher, Richard Carl Schmidt, printed the year 42 as a publishing date, probably from a purely business motive and this date is often mistakenly given as the actual date of publication. In 42 pages and 42 handmade illustrations, Potočnik set out a plan for a breakthrough into space and the establishment of a permanent human presence there. He conceived a detailed design for a ": null
    },
    {
        "space station": "space station"
    },
    {
        ", regarded by Russian and American historians of spaceflight to be the first ": null
    },
    {
        "architecture in space": "space architecture"
    },
    {
        ".   He described the use of orbiting spacecraft for detailed observation of the ground for peaceful and military purposes, and described how the special conditions of space could be useful for scientific experiments.  Potočnik expressed strong doubts of the potentially destructive military use of these fresh discoveries.     The book was translated into ": null
    },
    {
        "Russian": "russian language"
    },
    {
        " in early 42 Slovene in 42 , English in 42  and Croatian in 42 . A partial translation to English, containing most of the essential chapters, was made as early as 42 for the American magazine  Science Wonder Stories  and was issued in three parts . , pp. 4242 , pp.   4242 , pp. 4242     With his many ideas he became one of the founders of astronautics. His concepts were first taken seriously only by the amateur rocketry movement in Germany, the  Verein für Raumschiffahrt  , centered on ": null
    },
    {
        "Hermann Oberth": "hermann oberth"
    },
    {
        " and his co-workers. In its Russian edition, the book may also have influenced ": null
    },
    {
        "Sergey Korolev": "sergey korolev"
    },
    {
        "s circle.   More locally, Viennese engineers dismissed his work as fantasy.        Potočniks book described geostationary satellites  and discussed communication between them and the ground using radio, but fell short of the idea of using satellites for mass broadcasting and as telecommunications relays . The wheel-shaped space station served as an inspiration for further development by ": null
    },
    {
        "Wernher von Braun": "wernher von braun"
    },
    {
        " in 42 Von Braun saw orbiting space stations as a stepping stone to travel to other planets. In 42 ": null
    },
    {
        "Stanley Kubrick": "stanley kubrick"
    },
    {
        "s ground-breaking film,  42: A Space Odyssey , depicted such a role for ": null
    },
    {
        "Space Station V": "list of spacecraft from the space odyssey seriesspace station v"
    },
    {
        " .         Potočnik died of ": null
    },
    {
        "pneumonia": "pneumonia"
    },
    {
        " at the age of 42 in great poverty in   Vienna, ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", and was buried there. An obituary notice about his death was printed in one Maribor daily newspaper, mentioning his ranks , his illness, but nothing about his work regarding space.         Streets in ": null
    },
    {
        "Graz": "graz"
    },
    {
        " and ": null
    },
    {
        "Ljubljana": "ljubljana"
    },
    {
        " and ": null
    },
    {
        "Pula": "pula"
    },
    {
        " now bear his name.   A proposal was made in the late 42s to name the ": null
    },
    {
        "International Space Station": "international space station"
    },
    {
        " after him, but was not taken up.   In 42 a two-day international memorial symposium about his life and work was held at the ": null
    },
    {
        "University of Maribor": "university of maribor"
    },
    {
        ", celebrating the 42th anniversary of the first printing of his famous book.   ": null
    },
    {
        "Asteroid": "asteroid"
    },
    {
        " 42 Noordung": "19612 noordung"
    },
    {
        ", found in 42 at ": null
    },
    {
        "Črni Vrh Observatory": "črni vrh observatory"
    },
    {
        ", is named after him.   In 42 the Herman Potočnik Noordung Memorial Centre was built in ": null
    },
    {
        "Vitanje": "vitanje"
    },
    {
        ", Slovenia.   There is activity going on to put up a statue of Herman Potočnik in his birthplace of Pula.   In 42 the ": null
    },
    {
        "Cultural Centre of European Space Technologies ": "ksevt"
    }
]