[
    {
        "              Don  Hernán Cortés de Monroy y Pizarro Altamirano, Marquis of the Valley of Oaxaca  was a Spanish  Conquistador  who led an expedition that caused the ": null
    },
    {
        "fall of the Aztec Empire": "Spanish Conquest Of The Aztec Empire"
    },
    {
        " and brought large portions of what is now mainland ": null
    },
    {
        "Mexico": "Mexico"
    },
    {
        " under the rule of the ": null
    },
    {
        "King of Castile": "King Of Castile"
    },
    {
        " in the early 16th century. Cortés was part of the generation of Spanish colonizers who began the first phase of the ": null
    },
    {
        "Spanish colonization of the Americas": "Spanish Colonization Of The Americas"
    },
    {
        ".     Born in ": null
    },
    {
        "Medellín, Spain": "Medellín, Spain"
    },
    {
        ", to a family of lesser ": null
    },
    {
        "nobility": "Nobility"
    },
    {
        ", Cortés chose to pursue adventure and riches in the ": null
    },
    {
        "New World": "New World"
    },
    {
        ". He went to ": null
    },
    {
        "Hispaniola": "Hispaniola"
    },
    {
        " and later to ": null
    },
    {
        "Cuba": "Cuba"
    },
    {
        ", where he received an  encomienda  . For a short time, he served as  alcalde  of the second Spanish town founded on the island. In 1519, he was elected captain of the third expedition to the mainland, which he partly funded. His enmity with the Governor of Cuba, ": null
    },
    {
        "Diego Velázquez de Cuéllar": "Diego Velázquez De Cuéllar"
    },
    {
        ", resulted in the recall of the expedition at the last moment, an order which Cortés ignored.     Arriving on the continent, Cortés executed a successful strategy of allying with some ": null
    },
    {
        "indigenous people": "Indigenous Peoples Of The Americas"
    },
    {
        " against others. He also used a native woman, ": null
    },
    {
        "Doña Marina": "La Malinche"
    },
    {
        ", as an ": null
    },
    {
        "interpreter": "Interpreter"
    },
    {
        ". She later bore his first son. When the Governor of Cuba sent emissaries to arrest Cortés, he fought them and won, using the extra troops as reinforcements. Cortés wrote letters directly to the king asking to be acknowledged for his successes instead of being punished for mutiny. After he overthrew the ": null
    },
    {
        "Aztec Empire": "Aztec Empire"
    },
    {
        ", Cortés was awarded the title of Marqués del Valle de Oaxaca , while the more prestigious title of ": null
    },
    {
        "Viceroy": "New Spain"
    },
    {
        " was given to a high-ranking nobleman, ": null
    },
    {
        "Antonio de Mendoza": "Antonio De Mendoza"
    },
    {
        ". In 1541 Cortés returned to Spain, where he died six years later of natural causes but embittered.     Because of the controversial undertakings of Cortés and the scarcity of reliable sources of information about him, it is difficult to describe his personality or motivations. Early lionizing of the conquistadores did not encourage deep examination of Cortés. Modern reconsideration has done little to enlarge understanding regarding him. As a result of these historical trends, descriptions of Cortés tend to be simplistic, and either damning or idealizing.               Cortés himself used the form Hernando or Fernando for his first name, as seen in his signature and the title of an early portrait. See information box for his signature and painting. ": null
    },
    {
        "William Hickling Prescotts": "William Hickling Prescott"
    },
    {
        " Conquest of Mexico also refers to him as Hernando Cortés. At some point writers began using the shortened form of Hernán more generally.       Cortés was born in 1485 in the town of ": null
    },
    {
        "Medellín": "Medellín"
    },
    {
        ", then a village in the ": null
    },
    {
        "Kingdom of Castile": "Kingdom Of Castile"
    },
    {
        ", now a municipality of the modern-day ": null
    },
    {
        "province": "Provinces Of Spain"
    },
    {
        " of ": null
    },
    {
        "Badajoz": "Badajoz"
    },
    {
        " in ": null
    },
    {
        "Extremadura": "Extremadura"
    },
    {
        ", ": null
    },
    {
        "Spain": "Spain"
    },
    {
        ". His father, Martín Cortés de Monroy, born in 1449 to Rodrigo or Ruy Fernández de Monroy and his wife María Cortés, was an ": null
    },
    {
        "infantry": "Infantry"
    },
    {
        " captain": "Captain"
    },
    {
        " of distinguished ancestry but slender means. Hernáns mother was Catalína Pizarro Altamirano. Machado, J. T. Montalvão, Dos Pizarros de Espanha aos de Portugal e Brasil, Authors Edition, 1st Edition, Lisbon, 1970.     Through his mother, Hernán was second cousin once removed of ": null
    },
    {
        "Francisco Pizarro": "Francisco Pizarro"
    },
    {
        ", who later conquered the ": null
    },
    {
        "Inca Empire": "Inca Empire"
    },
    {
        " of modern-day ": null
    },
    {
        "Peru": "Peru"
    },
    {
        ", and not to be confused with another Francisco Pizarro, who joined Cortés to conquer the ": null
    },
    {
        "Aztec": "Aztec"
    },
    {
        "s. Through his father, Hernán was related to ": null
    },
    {
        "Nicolás de Ovando": "Nicolás De Ovando"
    },
    {
        ", the third ": null
    },
    {
        "Governor of Hispaniola": "Governor Of Hispaniola"
    },
    {
        ". His paternal great-grandfather was ": null
    },
    {
        "Rodrigo de Monroy y Almaraz, 5th Lord of Monroy": "Rodrigo De Monroy Y Almaraz, 5Th Lord Of Monroy"
    },
    {
        ".     According to his ": null
    },
    {
        "biographer": "Biographer"
    },
    {
        ", ": null
    },
    {
        "chaplain": "Chaplain"
    },
    {
        ", and friend ": null
    },
    {
        "Francisco López de Gómara": "Francisco López De Gómara"
    },
    {
        ", Cortés was pale and sickly as a child. At the age of 14, he was sent to study Latin under an uncle in Salamanca. Modern historians have misconstrued this personal tutoring as time enrolled at the University of Salamanca. David A. Boruchoff, Hernán Cortés, International Encyclopedia of the Social Sciences, 2nd. ed. , vol. 2, pp. 146–49      After two years, Cortés returned home to Medellín, much to the irritation of his parents, who had hoped to see him equipped for a profitable legal career. However, those two years in ": null
    },
    {
        "Salamanca": "Salamanca"
    },
    {
        ", plus his long period of training and experience as a notary, first in Valladolid and later in ": null
    },
    {
        "Hispaniola": "Hispaniola"
    },
    {
        ", gave him knowledge of the legal codes of Castile that he applied to help justify his unauthorized conquest of Mexico. Boruchoff, Hernán Cortés, , Encyclopedia     At this point in his life, Cortés was described by Gómara as ruthless, haughty, and mischievous. The Latin Library The 16-year-old youth had returned home to feel constrained life in his small provincial town. By this time, news of the exciting discoveries of Christopher Columbus in the New World was streaming back to Spain.       Plans were made for Cortés to sail to the Americas with a family acquaintance and distant relative, Nicolás de Ovando, the newly appointed Governor of Hispaniola . . Cortés suffered an injury and was prevented from traveling. He spent the next year wandering the country, probably spending most of his time in Spains southern ports of Cadiz , Palos , Sanlucar , and Seville . He finally left for Hispaniola in 1504 and became a colonist. Crow, John A. The Epic of Latin America. Los Angeles, California: University of California Press, 1992. 4th ed. p. 73       Cortés reached Hispaniola in a ship commanded by Alonso Quintero, who tried to deceive his superiors and reach the New World before them in order to secure personal advantages. Quinteros mutinous conduct may have served as a model for Cortés in his subsequent career. The history of the conquistadores is rife with accounts of rivalry, jockeying for positions, mutiny, and betrayal.     Upon his arrival in 1504 in Santo Domingo , the capital of Hispaniola, the 18-year-old Cortés registered as a citizen; this entitled him to a building plot and land to farm. Soon afterward, Governor Nicolás de Ovando granted him an ": null
    },
    {
        "encomienda": "Encomienda"
    },
    {
        " and appointed him as a notary of the town of Azua de Compostela . His next five years seemed to help establish him in the colony; in 1506, Cortés took part in the conquest of Hispaniola and Cuba. The expedition leader awarded him a large estate of land and Indian slaves for his efforts.       In 1511, Cortés accompanied Diego Velázquez de Cuéllar , an aide of the Governor of Hispaniola, in his expedition to conquer Cuba. Velázquez was appointed Governor of New Spain . At the age of 26, Cortés was made clerk to the treasurer with the responsibility of ensuring that the Crown received the quinto, or customary one fifth of the profits from the expedition.     Velázquez was so impressed with Cortés that he secured a high political position for him in the colony. He became secretary for Governor Velázquez. Cortés was twice appointed municipal magistrate  of Santiago . In Cuba, Cortés became a man of substance with an ": null
    },
    {
        "encomienda": "Encomienda"
    },
    {
        " to provide Indian labor for his mines and cattle. This new position of power also made him the new source of leadership, which opposing forces in the colony could then turn to. In 1514, Cortés led a group which demanded that more Indians be assigned to the settlers.     As time went on, relations between Cortés and Governor Velázquez became strained. Hassig, Ross. Mexico and the Spanish Conquest. Longman Group UK Limited, 1994, pp. 45–46 This began once news reached Velázquez that Juan de Grijalva had established a colony on the mainland where there was a bonanza of silver and gold, and Velázquez decided to send him help. Cortés was appointed Captain-General of this new expedition in October 1518, but was advised to move fast before Velázquez changed his mind.     With Cortés experience as an administrator, knowledge gained from many failed expeditions, and his impeccable rhetoric he was able to gather six ships and 300 men, within a month. Velázquezs jealousy exploded and he decided to put the expedition in other hands. However, Cortés quickly gathered more men and ships in other Cuban ports.     Cortés also found time to become romantically involved with Catalina Xuárez , the sister-in-law of Governor Velázquez. Part of Velázquezs displeasure seems to have been based on a belief that Cortés was trifling with Catalinas affections. Cortés was temporarily distracted by one of Catalinas sisters but finally married Catalina, reluctantly, under pressure from Governor Velázquez. However, by doing so, he hoped to secure the good will of both her family and that of Velázquez. Sanderson Beck,     It was not until he had been almost 15 years in the Indies that Cortés began to look beyond his substantial status as mayor of the capital of Cuba and as a man of affairs in the thriving colony. He missed the first two expeditions, under the orders of Francisco Hernández de Córdoba and then Juan de Grijalva , sent by Diego Velázquez to Mexico in 1518.       There are differing perceptions about what happened to Hernán Cortéss ships. Some think that he burned the vessels, and others believe he beached them. The notion that he burned his ships did not become accepted until 250 years later. However, Bernal Díaz del Castillo , while attending an expedition with Cortés, gives reason to believe that Cortés ran them ashore. In a letter to King Charles, Cortés states that his ships were incapable of sailing, telling his men the reason was shipworm. However, after establishing the town of Vera Cruz, five Aztec emissaries arrived which made Cortés anxious to visit Tenochtitlán . Therefore, he destroyed all of his ships but one, which he sent back to Spain for King Charles. The fear of his men returning to Cuba, rather than embarking on the journey to the Aztec Empire, made him decide to demolish his ships. They no longer had an option but to accompany him on this journey. This decision brought about severe consequences because Cortés had trapped himself in Mexico.     Cortés created strife between his men and the Aztecs by taking over the city. However, worried his men would revolt, Montezuma decided to convince them to delay the attack. Cortés now had time to build more ships, but he had to stay on guard against the Aztecs because he was unable to leave Mexico. Furthermore, Velázquez was sending forces to arrest Cortés, which meant the lives of him and his men were at jeopardy. Still without ships, Cortés could not escape. This resulted in him fighting the battle at Cempoala . In addition to restraining himself in Mexico, Cortés also suffered financially. He had to repay Velázquez for the ships he destroyed.     Throughout his journey, Cortés had written five letters to King Charles. He wanted to relieve himself from Velázquezs authority; therefore, Cortés bribed the King through sending him treasures. However, Velázquez did not respond well. He and his men convinced King Charles to revoke Cortéss position as governor. While King Charles forgave Cortés, he did receive punishment. Cortés was promoted to captain-general and given the title of Marquis, but he was not allowed to reclaim his governorship or return to New Spain.           thu .   In 1518, Velázquez put Cortés in command of an expedition to explore and secure the interior of Mexico for colonization. At the last minute, due to the old argument between the two, Velázquez changed his mind and revoked Cortéss charter. He ignored the orders and, in an act of open mutiny , went anyway in February 1519. He stopped in Trinidad, Cuba , to hire more soldiers and obtain more horses. Accompanied by about 11 ships, 500 men , 13 horses, and a small number of cannon s, Cortés landed on the Yucatán Peninsula in Mayan territory. Bernard Grunberg,  La folle aventure dHernan Cortés , in ": null
    },
    {
        "LHistoire": "Lhistoire"
    },
    {
        " n°322, July–August 2007 There he encountered Geronimo de Aguilar , a Spanish Franciscan priest who had survived a shipwreck followed by a period in captivity with the Maya , before escaping. Aguilar had learned the Chontal Maya language and was able to translate for Cortés. Crowe, John A. The Epic of Latin America. Los Angeles, California: University of California Press, 1992. 4th ed. p. 75     In March 1519, Cortés formally claimed the land for the Spanish crown . Then he proceeded to Tabasco , where he met with resistance and won a battle against the natives. He received twenty young indigenous women from the vanquished natives, and he converted them all to Christianity.     Among these women was La Malinche , his future mistress and mother of his son Martín. Malinche knew both the Nahuatl language and Chontal Maya, thus enabling Cortés to communicate with the Aztecs through Aguilar. Diaz, B., 1963, The Conquest of New Spain, London: Penguin Books, At San Juan de Ulúa on Easter Sunday 1519, Cortés met with Moctezuma II s Aztec Empire governors Tendile and Pitalpitoque.     thu   In July 1519, his men took over Veracruz . By this act, Cortés dismissed the authority of the Governor of Cuba to place himself directly under the orders of King Charles . In order to eliminate any ideas of retreat, Cortés scuttled his ships. Hassig, Ross. Mexico and the Spanish Conquest. Longman Group UK Limited, 1994, pp. 53–54       In Veracruz, he met some of the tributaries of the Aztecs and asked them to arrange a meeting with Moctezuma II , the ": null
    },
    {
        "tlatoani": "Tlatoani"
    },
    {
        " of the Aztec Empire. Moctezuma repeatedly turned down the meeting, but Cortés was determined. Leaving a hundred men in Veracruz, Cortés marched on Tenochtitlán in mid-August 1519, along with 600 soldiers, 15 horsemen, 15 cannon s, and hundreds of indigenous carriers and warriors.     On the way to Tenochtitlán, Cortés made alliances with indigenous peoples such as the Totonac s of Cempoala and the Nahuas of Tlaxcala . The Otomis initially, and then the Tlaxcalans fought with the Spanish in a series of three battles from 2 to 5 September 1519, and at one point, Diaz remarked, they surrounded us on every side . After Cortés continued to release prisoners with messages of peace, and realizing the Spanish were enemies of Moctezuma, Xicotencatl the Elder and Maxixcatzin persuaded the Tlaxcalan warleader, Xicotencatl the Younger , that it would be better to ally with the newcomers than to kill them.     In October 1519, Cortés and his men, accompanied by about 1,000 Tlaxcalteca, marched to Cholula , the second largest city in central Mexico. Cortés, either in a pre-meditated effort to instill fear upon the Aztecs waiting for him at Tenochtitlan or wishing to make an example when he feared native treachery, massacred thousands of unarmed members of the nobility gathered at the central plaza, then partially burned the city.     thu meet Moctezuma in Tenochtitlán, November 8, 1519.   By the time he arrived in Tenochtitlán the Spaniards had a large army. On November 8, 1519, they were peacefully received by Moctezuma II. Hassig, Ross. Mexico and the Spanish Conquest. Longman Group UK Limited, 1994, pp. 82, 86 Moctezuma deliberately let Cortés enter the Aztec capital, the island city of Tenochtitlán, hoping to get to know their weaknesses better and to crush them later.     Moctezuma gave lavish gifts of gold to the Spaniards which, rather than placating them, excited their ambitions for plunder. In his letters to King Charles, Cortés claimed to have learned at this point that he was considered by the Aztecs to be either an emissary of the feathered serpent god Quetzalcoatl or Quetzalcoatl himself – a belief which has been contested by a few modern historians. Restall, Matthew . Seven Myths of the Spanish Conquest. Oxford University Press; Townsend, Camilla . Burying the White Gods: New Perspectives on the Conquest of Mexico. American Historical Review 108, no. 3: 659–87. But quickly Cortés learned that several Spaniards on the coast had been killed by Aztecs while supporting the Totonacs, and decided to take Moctezuma as a hostage in his own palace, indirectly ruling Tenochtitlán through him. Hassig, Ross. Mexico and the Spanish Conquest. Longman Group UK Limited, 1994, pp. 88–89     thu leads Spanish soldiers with Tlaxcala n allies in the conquests of Jalisco, 1522.   Meanwhile, Velázquez sent another expedition, led by Pánfilo de Narváez , to oppose Cortés, arriving in Mexico in April 1520 with 1,100 men. Cortés left 200 men in Tenochtitlán and took the rest to confront Narváez. He overcame Narváez, despite his numerical inferiority, and convinced the rest of Narváezs men to join him. In Mexico, one of Cortéss lieutenants Pedro de Alvarado , committed the ": null
    },
    {
        "massacre in the Great Temple": "Massacre In The Great Temple"
    },
    {
        ", triggering a local rebellion. Hassig, Ross. Mexico and the Spanish Conquest. Longman Group UK Limited, 1994, pp. 91–92     Cortés speedily returned to Tenochtitlán. On July 1, 1520 Moctezuma was killed . Faced with a hostile population, Cortés decided to flee for Tlaxcala. During the ": null
    },
    {
        "Noche Triste": "La Noche Triste"
    },
    {
        " , the Spaniards managed a narrow escape from Tenochtitlán across the Tlacopan causeway, while their rearguard was being massacred. Much of the treasure looted by Cortés was lost during this panicked escape from Tenochtitlán.       After a battle in Otumba , they managed to reach Tlaxcala, having lost 870 men. With the assistance of their allies, Cortéss men finally prevailed with reinforcements arriving from Cuba . Cortés began a policy of attrition towards Tenochtitlán, cutting off supplies and subduing the Aztecs allied cities. The siege of Tenochtitlán ended with Spanish victory and the destruction of the city. Hassig, Ross. Mexico and the Spanish Conquest. Longman Group UK Limited, 1994, pp. 108–43     In January 1521, Cortés countered a conspiracy against him, headed by Antonio de Villafana, who was hanged for the offense. Finally, with the capture of Cuauhtémoc , the ": null
    },
    {
        "tlatoani": "Tlatoani"
    }
]