[
    {
        "           Hero and Leander is the ": null
    },
    {
        "Greek myth": "greek myth"
    },
    {
        " relating the story of Hero , a priestess of ": null
    },
    {
        "Aphrodite": "aphrodite"
    },
    {
        "  who dwelt in a tower in ": null
    },
    {
        "Sestos": "sestos"
    },
    {
        " on the European side of the ": null
    },
    {
        "Hellespont": "hellespont"
    },
    {
        " , and Leander , a young man from ": null
    },
    {
        "Abydos": "abydos, hellespont"
    },
    {
        " on the opposite side of the strait. Leander fell in love with Hero and would swim every night across the Hellespont to spend time with her. Hero would light a lamp at the top of her tower to guide his way.     Succumbing to Leanders soft words and to his argument that Aphrodite, as the goddess of love and sex, would scorn the worship of a virgin, Hero allowed him to make love to her—that is, she did not refuse any longer. Their trysts lasted through a warm summer. But one stormy winter night, the waves tossed Leander in the sea and the breezes blew out Heros light; Leander lost his way and drowned. When Hero saw his dead body, she threw herself over the edge of the tower to her death to be with him.          The myth of Hero and Leander has been used extensively in literature and the arts:   Ancient Roman coins of ": null
    },
    {
        "Abydos": "abydos"
    },
    {
        " : ": null
    },
    {
        "Septimius Severus": "septimius severus"
    },
    {
        "  Caracalla": "caracalla"
    },
    {
        "    The  Double Heroides   treats the narrative in 42 and 42 an exchange of letters between the lovers. Leander has been unable to swim across to Hero in her tower because of bad weather; her summons to him to make the effort will prove fatal to her lover.   ": null
    },
    {
        "Francisco Quevedo": "francisco quevedo"
    },
    {
        " mentions Leander in En crespa tempestad del oro undoso   ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " poet ": null
    },
    {
        "Musaeus": "musaeus grammaticus"
    },
    {
        " also wrote a poem; ": null
    },
    {
        "Aldus Manutius": "aldus manutius"
    },
    {
        " made it one of his first publications after he set up his famous printing press in Venice . Musaeuss poem had early translations into European languages by ": null
    },
    {
        "Bernardo Tasso": "bernardo tasso"
    },
    {
        " , ": null
    },
    {
        "Boscán": "boscán"
    },
    {
        " and ": null
    },
    {
        "Clément Marot": "clément marot"
    },
    {
        " . This poem was widely believed in the Renaissance to have been pre-Homeric: ": null
    },
    {
        "George Chapman": "george chapman"
    },
    {
        " reflects at the end of his completion of Marlowes version that the dead lovers had the honour of being the first that ever poet sung’. Chapmans 42 translation has the title The divine poem of Musaeus. First of all bookes. Translated according to the original, by Geo: Chapman. Staplyton, the mid42th century translator, had read ": null
    },
    {
        "Scaliger": "scaliger"
    },
    {
        "s repudiation of this mistaken belief, but still could not resist citing ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        "s Musaeum ante omnes  on the title page of his translation .    ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " poet ": null
    },
    {
        "Christopher Marlowe": "christopher marlowe"
    },
    {
        " began an expansive version of the narrative. His story does not get as far as Leanders nocturnal swim, and the guiding lamp that gets extinguished, but ends after the two have become lovers ;   ": null
    },
    {
        "George Chapman": "george chapman"
    },
    {
        " completed Marlowes poem after Marlowes death; this version was often reprinted in the first half of the 42th century, with editions in 42 ; 42 and 42 ; 42 42 42 42 ; 42 ; and 42 .   Sir ": null
    },
    {
        "Walter Ralegh": "walter ralegh"
    },
    {
        " alludes to the story, in his The Oceans Love to Cynthia, in which Hero has fallen asleep, and fails to keep alight the lamp that guides Leander on his swim .   ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        " also mentions this story in the opening scene of  Two Gentlemen of Verona , in a dialogue between Valentine and Proteus :   :VALENTINE: And on a love-book pray for my success?   :PROTEUS: Upon some book I love Ill pray for thee.   :VALENTINE: Thats on some shallow story of deep love: How young Leander crossd the Hellespont.   :PROTEUS: Thats a deep story of a deeper love: For he was more than over shoes in love.   :VALENTINE: Tis true; for you are over boots in love, And yet you never swum the Hellespont.     :Hero and Leander are again mentioned in The Two Gentlemen of Verona in Act III Scene I when Valentine is tutoring the Duke of Milan on how to woo the lady from Milan.     Shakespeare also alludes to the story in  Much Ado About Nothing , both when Benedick states that Leander was never so truly turned over and over as my poor self in love and in the name of the character Hero, who, despite accusations to the contrary, remains chaste before her marriage; and in  A Midsummer Nights Dream  in the form of a ": null
    },
    {
        "malapropism": "malapropism"
    },
    {
        " accidentally using the names Helen and Limander in the place of Hero and Leander, as well as in ": null
    },
    {
        "Edward III": "edward iii"
    },
    {
        " , ": null
    },
    {
        "Othello": "othello"
    },
    {
        " , and ": null
    },
    {
        "Romeo and Juliet": "romeo and juliet"
    },
    {
        " .     The most famous Shakespearean allusion is the debunking one by Rosalind, in Act IV scene I of  As You Like It :   : Leander, he would have lived many a fair year, though Hero had turned nun, if it had not been for a hot midsummer night; for, good youth, he went but forth to wash him in the Hellespont and being taken with the cramp was drowned and the foolish coroners of that age found it was Hero of Sestos. But these are all lies: men have died from time to time and worms have eaten them, but not for love.   ": null
    },
    {
        "Ben Jonson": "ben jonson"
    },
    {
        "s play  Bartholomew Fair  features a puppet show of Hero and Leander in Act V, translated to London, with the Thames serving as the Hellespont between the lovers.   It is also the subject of a novel by ": null
    },
    {
        "Milorad Pavić": "milorad pavić"
    },
    {
        ", Inner Side of the Wind;   Leander is also the subject of Sonnet XXIX by Spanish poet ": null
    },
    {
        "Garcilaso de la Vega": "garcilaso de la vega"
    },
    {
        " of the 42th Century;   In the collection of short stories and essays by ": null
    },
    {
        "Lafcadio Hearn": "lafcadio hearn"
    },
    {
        ", In Ghostly Japan, the author is told the popular story of a girl that swims to her lover guided by a lantern, and he comments on the similarities with the western story: ‘— So, I said to myself, in the Far East, it is poor Hero that does the swimming. And what, under such circumstances, would have been the Western estimate of Leander? ’    ": null
    },
    {
        "John Donne": "john donne"
    },
    {
        " has an elegant ": null
    },
    {
        "Epigram": "epigram"
    },
    {
        " summing up the story in two lines:     Both robbed of air, we both lie in one ground,   Both whom one fire had burnt, one water drowned.    ": null
    },
    {
        "Dion Boucicault": "dion boucicault"
    },
    {
        " mentions Leander in his play ": null
    },
    {
        "The Colleen Bawn": "the colleen bawn"
    },
    {
        ". Corrigan refers to Hardress Cregan and his nocturnal boat rides to his secret wife as being, like Leander, barring the wetting   The myth is central to ": null
    },
    {
        "John Keats": "john keats"
    },
    {
        " 42 sonnet, On an Engraved Gem of Leander.   ": null
    },
    {
        "Myths and Hymns": "myths and hymns"
    },
    {
        ", by ": null
    },
    {
        "Adam Guettel": "adam guettel"
    },
    {
        ", contains a song entitled after the pair.   ": null
    },
    {
        "Robert Schumann": "robert schumann"
    },
    {
        " is said to have perceived his In der Nacht from ": null
    },
    {
        "Fantasiestücke": "fantasiestücke"
    },
    {
        " as depicting the story of Hero and Leandros.   ": null
    },
    {
        "Lord Byron": "lord byron"
    },
    {
        " references Leander in ": null
    },
    {
        " Written After Swimming From Sestos To Abydos. ": ":s:the works of lord byron /poetry/volume 3/written after swimming from sestos to abydos"
    },
    {
        "; the myth of Hero and Leander inspired his own swim across the Hellespont in May, ": null
    },
    {
        "42": "1810"
    },
    {
        ". . Byron also alludes to his feat, with further reference to Leander, in  Don Juan , canto II, stanza 42   ": null
    },
    {
        "Letitia Elizabeth Landon": "letitia elizabeth landon"
    },
    {
        "s poem Leander and Hero first appeared in 42 Significantly, she reversed the usual order of names and used it as an example of mutual constancy.   ": null
    },
    {
        "Franz Grillparzer": "franz grillparzer"
    },
    {
        "s 42 tragedy Des Meeres und der Liebe Wellen is based on the tale.   ": null
    },
    {
        "Friedrich Schiller": "friedrich schiller"
    },
    {
        " wrote the ballad Hero und Leander based on the tale.   ": null
    },
    {
        "Georg Friedrich Handel": "georg friedrich handel"
    },
    {
        "s 42 solo cantata in Italian, Ero e Leandro , is based on the tale.   ": null
    },
    {
        "Alfredo Catalani": "alfredo catalani"
    },
    {
        " composed a tone-poem, Ero e Leandro, based on the tale.   ": null
    },
    {
        "Arrigo Boito": "arrigo boito"
    },
    {
        " composed an opera, Ero e Leandro, but destroyed it.   ": null
    },
    {
        "Diana Wynne Jones": "diana wynne jones"
    },
    {
        "s meta-fantasy novel Fire and Hemlock makes an early reference to Hero and Leander, both to foreshadow the plot and as a namesake for the heroines alter-ego.   ": null
    },
    {
        "Rudyard Kipling": "rudyard kipling"
    },
    {
        " started his poem A Song of Travel with words: Wheres the lamp that Hero lit / Once to call Leander home?   ": null
    },
    {
        "Alfred Tennyson": "alfred tennyson"
    },
    {
        "s poem Hero to Leander has Hero begging her lover not to leave until the morning when the sea has calmed Thou shalt not wander hence to-night, Ill stay thee with my kisses   Poem XV of ": null
    },
    {
        "A.E. Housman": "a.e. housman"
    },
    {
        "s More Poems is devoted to the myth.  It describes how, Sestos town, in Heros tower | On Heros heart Leander lies...   The Ballad of the Oysterman , by ": null
    },
    {
        "Oliver Wendell Holmes, Sr.": "oliver wendell holmes, sr."
    },
    {
        ", has a reference to the myth. The titular oysterman comments that read it in the story-book, that, for to kiss his dear, / Leander swam the Hellespont...   ": null
    },
    {
        "Les Misérables": "les misérables"
    },
    {
        " , by ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        ", has a reference to the myth in Jean Valjean, Book V. Referring to the reaction of a duchess when she heard of the fate of her lover who died by drowning in the quicksand in Paris sewers, Hugo comments that Hero refuses to wash Leanders corpse.   In Chapter XVII of ": null
    },
    {
        "Two Years Before the Mast": "two years before the mast"
    },
    {
        " , ": null
    },
    {
        "Richard Henry Dana, Jr.": "richard henry dana, jr."
    },
    {
        " relates an anecdote of the ships cook, who had so bonded with a sow, Old Bess , who had stayed aboard the vessel all the first months of the voyage, that after the sow had been taken ashore in San Diego, the cook could hardly have been more attentive, for he actually, on several nights, after dark, when he thought he would not be seen, sculled himself ashore in a boat with a bucket of nice swill, and returned like Leander from crossing the Hellespont.   ": null
    },
    {
        "Peter Paul Rubens": "peter paul rubens"
    },
    {
        " painted a picture named Hero and Leander in 42 based on the tale.   ": null
    },
    {
        "Cy Twombly": "cy twombly"
    },
    {
        " completed a painting in Rome in 42 inspired by the story as told by ": null
    },
    {
        "Christopher Marlowe": "christopher marlowe"
    },
    {
        ". The painting is entitled Hero and Leander Reproduction of Twomblys painting ": null
    }
]