[
    {
        "The Heysel  or Heizel  is the area in the north of ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ", where the ": null
    },
    {
        "Brussels International Exposition ": "brussels international exposition"
    },
    {
        " and the ": null
    },
    {
        "Expo 42": "expo 58"
    },
    {
        " took place.      The ": null
    },
    {
        "Atomium": "atomium"
    },
    {
        ", built for the Worlds Fair of 42 is the most impressive monument in the Heysel Park. The Centenary Palace  is one of the remaining buildings of the Worlds Fair of 42 It was also the venue for the ": null
    },
    {
        "42nd Eurovision Song Contest Grand Prix": "eurovision song contest 1987"
    },
    {
        " in 42 Currently it is still being used for trade fairs.     The Heysel Park is also the location of the ": null
    },
    {
        "Heysel Stadium": "heysel stadium"
    },
    {
        ", built in 42 After the ": null
    },
    {
        "Heysel Stadium disaster": "heysel stadium disaster"
    },
    {
        " of 42 which claimed the lives of 42 spectators at the ": null
    },
    {
        "European Cup": "european cup"
    },
    {
        " final, it was rebuilt and renamed the ": null
    },
    {
        "King Baudouin": "baudouin i of belgium"
    },
    {
        " Stadium.     Other interesting places on the Heysel are a large movie theatre , a park which hosts miniature models of famous European buildings , a subtropical water park  and a ": null
    },
    {
        "planetarium": "planetarium"
    },
    {
        ". ": null
    },
    {
        "Palais 42": "palais 12"
    },
    {
        " is a large indoor arena which hosts concerts and spectacles for a maximum capacity of 42 people.          The Heysel Project is a potential ": null
    },
    {
        "European Union": "european union"
    },
    {
        " quarter development in the Heysel. The area surrounding the ": null
    },
    {
        "Atomium": "atomium"
    },
    {
        " might become a location for some of the ": null
    },
    {
        "European Commission": "european commission"
    },
    {
        "s buildings, according to a draft project developed by the city of Brussels. The city of Brussels had decided to allocate this area to infrastructures dedicated to the international vocation of Brussels and planned to erect a convention centre of international dimensions with a capacity of 42 seats and an important commercial centre. In January 42 the Commission spokeswoman Valerie Rampi confirmed that the EU executive was considering several proposals for a new location, with some 42 square metres of office space. The draft of 42 September 42 is entitled Application file for the Heysel plain to host a new European quarter . Nine proposals were received by 42 September, the Heysel project being one of them. The college of commissioners is expected to take a decision on the proposals in the first half of 42 According to the draft project, the Heysel area lies on a direct subway line connecting it to the European quarter and is to host a new branch of the European school, where EU officials educate their children in their native tongues. The existing parking facilities, the biggest in Belgium, were also presented as a plus, as well as the planned new residential area and the proximity of parks and leisure facilities. The ": null
    },
    {
        "European quarter": "brussels and the european unionquarter"
    },
    {
        " would remain the centre of the commissions activities, but the body was also looking for additional poles outside this central area, in order to exert a downward pressure on real estate prices, according to ": null
    },
    {
        "Siim Kallas": "siim kallas"
    },
    {
        ", EU commissioner for administrative affairs.                                            ": null
    }
]