[
    {
        "Hierarchical routing is a method of ": null
    },
    {
        "routing": "routing"
    },
    {
        " in networks that is based on hierarchical ": null
    },
    {
        "addressing": "network address"
    },
    {
        ".       Most ": null
    },
    {
        "Transmission Control Protocol": "transmission control protocol"
    },
    {
        "/": null
    },
    {
        "Internet Protocol": "internet protocol"
    },
    {
        "  routing is based on a two-level hierarchical routing in which an IP ": null
    },
    {
        "address": "network address"
    },
    {
        " is divided into a ": null
    },
    {
        "network": "computer network"
    },
    {
        " portion and a ": null
    },
    {
        "host": "server"
    },
    {
        " portion. Gateways use only the network portion until an IP ": null
    },
    {
        "datagram": "datagram"
    },
    {
        " reaches a ": null
    },
    {
        "gateway": "gateway"
    },
    {
        " that can deliver it directly. Additional levels of hierarchical routing are introduced by the addition of subnetworks.       Hierarchical routing is the procedure of arranging ": null
    },
    {
        "router": "router"
    },
    {
        "s in a hierarchical manner. A good example would be to consider a corporate ": null
    },
    {
        "intranet": "intranet"
    },
    {
        ". Most corporate intranets consist of a high speed ": null
    },
    {
        "backbone network": "backbone network"
    },
    {
        ". Connected to this backbone are routers which are in turn connected to a particular workgroup. These workgroups occupy a unique ": null
    },
    {
        "LAN": "local area network"
    },
    {
        ". The reason this is a good arrangement is because even though there might be dozens of different workgroups, the span  is 42 Even if the workgroups divided their LAN network into smaller partitions, the span could only increase to 42 in this particular example.     Considering alternative solutions with every router connected to every other router, or if every router was connected to 42 routers, shows the convenience of hierarchical routing. It decreases the complexity of ": null
    },
    {
        "network topology": "network topology"
    },
    {
        ", increases routing efficiency, and causes much less ": null
    },
    {
        "congestion": "network congestion"
    }
]