[
    {
        "A hierarchical organization is an ": null
    },
    {
        "organizational structure": "organizational structure"
    },
    {
        " where every entity in the ": null
    },
    {
        "organization": "organization"
    },
    {
        ", except one, is ": null
    },
    {
        "subordinate": "subordinate"
    },
    {
        " to a single other entity. This arrangement is a form of a ": null
    },
    {
        "hierarchy": "hierarchy"
    },
    {
        ". In an organization, the hierarchy usually consists of a singular/group of ": null
    },
    {
        "power": "power"
    },
    {
        " at the top with subsequent levels of power beneath them. This is the dominant mode of organization among large organizations; most ": null
    },
    {
        "corporation": "corporation"
    },
    {
        "s, ": null
    },
    {
        "governments": "forms of government"
    },
    {
        ", criminal enterprises, and ": null
    },
    {
        "organized religions": "organized religion"
    },
    {
        "are hierarchical organizations with different levels of ": null
    },
    {
        "management": "management"
    },
    {
        ", power or ": null
    },
    {
        "authority": "authority"
    },
    {
        ". For example, the broad, top-level overview of the general organization of the ": null
    },
    {
        "Catholic Church": "catholic church hierarchy"
    },
    {
        " consists of the ": null
    },
    {
        "Pope": "pope"
    },
    {
        ", then the ": null
    },
    {
        "Cardinals": "cardinal"
    },
    {
        ", then the ": null
    },
    {
        "Archbishop": "archbishop"
    },
    {
        "s, and so on.     Members of hierarchical organizational structures chiefly communicate with their immediate superior and with their immediate subordinates. Structuring organizations in this way is useful partly because it can reduce the communication overhead by limiting information flow.       A hierarchy is typically visualized as a ": null
    },
    {
        "pyramid": "pyramid"
    },
    {
        ", where the height of the ranking or person depicts their power status and the width of that level represents how many people or business divisions are at that level relative to the whole—the highest-ranking people are at the ": null
    },
    {
        "apex": "apex"
    },
    {
        ", and there are very few of them; the ": null
    },
    {
        "base": "base"
    },
    {
        " may include thousands of people who have no subordinates. These hierarchies are typically depicted with a ": null
    },
    {
        "tree": "tree structure"
    },
    {
        " or ": null
    },
    {
        "triangle": "triangle"
    },
    {
        " diagram": "diagram"
    },
    {
        ", creating an ": null
    },
    {
        "organizational chart": "organizational chart"
    },
    {
        " or organigram. Those nearest the top have more power than those nearest the bottom, and there being fewer people at the top than at the bottom. As a result, superiors in a hierarchy generally have higher status and command greater rewards than their subordinates.       All governments and most companies have similar structures. Traditionally, the ": null
    },
    {
        "monarch": "monarch"
    },
    {
        " was the pinnacle of the ": null
    },
    {
        "state": "state"
    },
    {
        ". In many countries, ": null
    },
    {
        "feudalism": "feudalism"
    },
    {
        " and ": null
    },
    {
        "manorialism": "manorialism"
    },
    {
        " provided a formal ": null
    },
    {
        "social structure": "social structure"
    },
    {
        " that established hierarchical links at every level of society, with the monarch at the top.     In modern post-feudal states the nominal top of the hierarchy still remains the ": null
    },
    {
        "head of state": "head of state"
    },
    {
        ", which may be a ": null
    },
    {
        "president": "president"
    },
    {
        " or a ": null
    },
    {
        "constitutional monarch": "constitutional monarch"
    },
    {
        ", although in many modern states the powers of the head of state are delegated among different bodies. Below the head, there is commonly a ": null
    },
    {
        "senate": "senate"
    },
    {
        ", ": null
    },
    {
        "parliament": "parliament"
    },
    {
        " or ": null
    },
    {
        "congress": "congress"
    },
    {
        ", which in turn often delegate the day-to-day running of the country to a ": null
    },
    {
        "prime minister": "prime minister"
    },
    {
        ". In many ": null
    },
    {
        "democracies": "democracies"
    },
    {
        ", the people are considered to be the notional top of the hierarchy, over the head of state; in reality, the peoples power is restricted to voting in elections.     In business, the business owner traditionally occupied the pinnacle of the ": null
    },
    {
        "organization": "organization"
    },
    {
        ". In most modern large companies, there is now no longer a single dominant shareholder, and the collective power of the business owners is for most purposes delegated to a ": null
    },
    {
        "board of directors": "board of directors"
    },
    {
        ", which in turn delegates the day-to-day running of the company to a ": null
    },
    {
        "managing director": "managing director"
    },
    {
        " or ": null
    },
    {
        "CEO": "ceo"
    },
    {
        ". Again, although the shareholders of the company are the nominal top of the hierarchy, in reality many companies are run at least in part as personal fiefdoms by their management; ": null
    },
    {
        "corporate governance": "corporate governance"
    },
    {
        " rules are an attempt to mitigate this tendency.       The ": null
    },
    {
        "organizational development": "organizational development"
    },
    {
        " theorist ": null
    },
    {
        "Elliott Jacques": "elliott jacques"
    },
    {
        " identified a special role for hierarchy in his concept of ": null
    },
    {
        "requisite organization": "requisite organization"
    },
    {
        ".     The ": null
    },
    {
        "iron law of oligarchy": "iron law of oligarchy"
    },
    {
        ", introduced by ": null
    },
    {
        "Robert Michels": "robert michels"
    },
    {
        ", describes the inevitable tendency of hierarchical organizations to become ": null
    },
    {
        "oligarchic": "oligarchy"
    },
    {
        " in their decision making.     The ": null
    },
    {
        "Peter Principle": "peter principle"
    },
    {
        " is a term coined by ": null
    },
    {
        "Laurence J. Peter": "laurence j. peter"
    },
    {
        " in which the selection of a candidate for a position in an hierarchical organization is based on the candidates performance in their current role, rather than on abilities relevant to the intended role. Thus, employees only stop being promoted once they can no longer perform effectively, and managers in an hierarchical organization rise to the level of their incompetence.     ": null
    },
    {
        "Hierarchiology": "hierarchiology"
    },
    {
        " is another term coined by Laurence J. Peter, described in his humorous book of the same name, to refer to the study of hierarchical organizations and the behavior of their members.          ": null
    },
    {
        "The IRG Solution – hierarchical incompetence and how to overcome it": "the irg solution – hierarchical incompetence and how to overcome it"
    },
    {
        " argued that hierarchies were inherently incompetent, and were only able to function due to large amounts of informal ": null
    },
    {
        "lateral communication": "lateral communication"
    },
    {
        " fostered by private informal networks.       In the work of diverse theorists such as ": null
    },
    {
        "William James": "william james"
    },
    {
        " , ": null
    },
    {
        "Michel Foucault": "michel foucault"
    },
    {
        " and ": null
    },
    {
        "Hayden White": "hayden white"
    },
    {
        ", important critiques of hierarchical epistemology are advanced. James famously asserts in his work Radical Empiricism that clear distinctions of type and category are a constant but unwritten goal of scientific reasoning, so that when they are discovered, success is declared. But if aspects of the world are organized differently, involving inherent and intractable ambiguities, then scientific questions are often considered unresolved. A hesitation to declare success upon the discovery of ambiguities leaves heterarchy at an artificial and subjective disadvantage in the scope of human knowledge. This bias is an artifact of an aesthetic or pedagogical preference for hierarchy, and not necessarily an expression of objective observation.     Hierarchies and hierarchical thinking has been criticized by many people, including ": null
    },
    {
        "Susan McClary": "susan mcclary"
    },
    {
        " and one political philosophy which is vehemently opposed to hierarchical organization: ": null
    },
    {
        "anarchism": "anarchism"
    },
    {
        ". ": null
    },
    {
        "Heterarchy": "heterarchy"
    },
    {
        " is the most commonly proposed alternative to hierarchy and this has been combined with ": null
    },
    {
        "responsible autonomy": "responsible autonomy"
    },
    {
        " by ": null
    },
    {
        "Gerard Fairtlough": "gerard fairtlough"
    },
    {
        " in his work on ": null
    },
    {
        "Triarchy": "triarchy"
    },
    {
        " theory. The most beneficial aspect of a hierarchical organization is the clear command that is established. However, hierarchy may become dismantled by abuse of power.     Amidst constant innovation in information and communication technologies, hierarchical authority structures are giving way to greater decision-making latitude for individuals and more flexible definitions of job activities and this new style of work presents a challenge to existing organizational forms, with some research studies contrasting traditional organizational forms against groups that operate as online communities that are characterized by personal motivation and the satisfaction of making ones own decisions. Zhao, Rosson, Rosson . The Future of Work: What Does Online Community Have to Do with It? 40th Annual Hawaii International Conference on System Sciences With all levels of an organization having access to information and communication via digital means, power structures align more as a ": null
    },
    {
        "wirearchy": "wirearchy"
    }
]