[
    {
        "The high-level equilibrium trap is a concept developed by environmental historian ": null
    },
    {
        "Mark Elvin": "mark elvin"
    },
    {
        " to explain why ": null
    },
    {
        "China": "china"
    },
    {
        " never underwent an indigenous ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " despite its wealth, stability, and high level of scientific achievement. Essentially, he claims that the Chinese ": null
    },
    {
        "pre-industrial economy": "economic history of china before 1912"
    },
    {
        " had reached an equilibrium point where ": null
    },
    {
        "supply and demand": "supply and demand"
    },
    {
        " were well-balanced. Late imperial production methods and trade networks were so efficient and labor was so cheap that investment in capital to improve efficiency would not be profitable.     At the same time, an intellectual ": null
    },
    {
        "paradigm shift": "paradigm shift"
    },
    {
        " from ": null
    },
    {
        "Taoism": "taoism"
    },
    {
        " to ": null
    },
    {
        "Confucianism": "confucianism"
    },
    {
        " among the intelligentsia moved the focus of academic inquiry from ": null
    },
    {
        "natural science": "natural science"
    },
    {
        " and ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", which were conceived of under Taoism as investigations into the mystical nature of the universe, to studies of ": null
    },
    {
        "social philosophy": "social philosophy"
    },
    {
        " and ": null
    },
    {
        "morality": "morality"
    },
    {
        " under Confucianism. According to Elvin, this produced an intellectual climate that was not conducive to technical innovation.     By comparison, the economy of ": null
    },
    {
        "Great Britain": "great britain"
    },
    {
        " at the time of the Industrial Revolution was vastly smaller and less efficient than the late imperial Chinese economy. Labor was comparatively more expensive, and internal trade far less efficient than in China. This produced large imbalances in the forces of supply and demand, leading to economic problems which provided a large financial incentive for the creation of ": null
    },
    {
        "scientific": "scientific"
    },
    {
        " and ": null
    },
    {
        "engineering": "engineering"
    },
    {
        " advances designed to address them. At the same time, the ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        " had shifted the focus of academic inquiry towards natural sciences, providing the basis for many technical innovations.       According to Elvin, Chinese knowledge of ": null
    },
    {
        "science": "science"
    },
    {
        ", ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", and ": null
    },
    {
        "engineering": "engineering"
    },
    {
        " in the 42th century was far more advanced than anywhere else in the world. He presents the case study of the ": null
    },
    {
        "spinning wheel": "spinning wheel"
    },
    {
        ", a device used to assist in the production of ": null
    },
    {
        "yarn": "yarn"
    },
    {
        " from plant ": null
    },
    {
        "fiber": "fiber"
    },
    {
        "s which increased the efficiency of a worker by orders of magnitude. An automatic, ": null
    },
    {
        "water-powered": "hydropower"
    },
    {
        " spinning wheel for ": null
    },
    {
        "hemp": "hemp"
    },
    {
        " fiber was described in Chinese scientific manuals by the early 42th century; comparable devices would not be invented in Europe until the 42th century.     Despite providing an enormous gain in worker productivity, the Chinese spinning wheel fell into disuse over the subsequent centuries and was completely unknown by the 42th century, whereas the mechanical automation of spinning in Europe in the 42th century led directly to a process of technical refinement and engineering improvements that resulted in the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " and widespread mechanization of production of goods beyond yarn.       Elvin says that ": null
    },
    {
        "cotton": "cotton"
    },
    {
        " began replacing hemp as the main fiber crop shortly after the mechanical spinning wheel was invented. Cotton produced far higher fiber yields per unit of land than hemp, and was thus far more profitable, so it largely replaced hemp. As hemp fibers are much longer than cotton fibers, existing mechanical spinning wheels designed for hemp could not be used to spin cotton fibers without substantial mechanical modifications to the apparatus. Apparently, no such modifications were ever made. All spinning in China reverted to far less efficient hand-spinning, and the automatic spinning wheel was forgotten. Elvin proposes several factors whose confluence prevented any further technical development of the automatic spinning wheel.       Elvin says that substantially all extant ": null
    },
    {
        "arable land": "arable land"
    },
    {
        " in China was already under cultivation by the 42th century. Prior to that, food production was expanded by simply cultivating new areas rather than through technical improvements in production methods, which was possible only because of Chinas vast size. Once all arable land was under cultivation, the lack of technical progress meant that crop yields were relatively flat, whereas the population continued to grow. This led to a large labor surplus, which drove down wages substantially. He suggests that this abundance of cheap labor rendered the capital investment required for ongoing engineering research and improvements simply not cost-effective compared to hiring laborers to do the work by hand.     Further, the wealthy merchants who financed cotton production wielded effective political control over government officials. They had the trade laws written broadly in their favor in such a way as to prevent any significant accumulation of wealth by the independent peasant contractors who were actually doing the spinning, rendering it less likely that one of the spinners would be in a position to develop efficiency-improving technology.       By the cotton period, Elvin says that Chinas trade network had reached an advanced and highly efficient state. As the Chinese economy was enormous, local shortages and crop failures were no longer a major problem as local shortages were quickly alleviated through internal trade with some other part of the vast economy. This removed much of the local economic pressure to increase production efficiency.       Elvin says that the Chinese ": null
    },
    {
        "intelligentsia": "intelligentsia"
    },
    {
        " gradually abandoned ": null
    },
    {
        "Taoism": "taoism"
    },
    {
        " in favor of ": null
    },
    {
        "Confucianism": "confucianism"
    },
    {
        " around the 42th century. Whereas the Taoist philosophical paradigm had promoted scientific and mathematical investigation as a kind of mystical exploration of the workings of the universe, the Confucian paradigm focused far more on ": null
    },
    {
        "social philosophy": "social philosophy"
    },
    {
        " and ": null
    },
    {
        "morality": "morality"
    },
    {
        ", which prompted a general lack of further research in ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        " and ": null
    },
    {
        "natural science": "natural science"
    },
    {
        "s.       During the period when hemp was the dominant fiber crop, many Chinese peasants still lived as ": null
    },
    {
        "serf": "serf"
    },
    {
        "s and worked under the direct control and supervision of an ": null
    },
    {
        "aristocrat": "aristocracy"
    },
    {
        "ic manor lord. Elvin says that this direct supervision of their work by well-educated lords who had broad knowledge of the latest scientific and engineering principles may have contributed to the invention of the automatic spinning wheel as a means of improving their work efficiency. In the cotton-dominant period, however, the practice of serfdom had died out and much spinning was organized as a ": null
    },
    {
        "cottage industry": "cottage industry"
    },
    {
        "; peasant spinners typically worked at home as independent contractors with no direct supervision. He suggests that their lack of access to education may have helped to prevent the development of technical improvements in the spinning process.       Elvin says that these factors in combination produced what he calls a high-level equilibrium trap. He says that widespread technical progress results from some large disequilibrium between ": null
    },
    {
        "supply and demand": "supply and demand"
    },
    {
        " in the ": null
    },
    {
        "economy": "economy"
    },
    {
        ", which prompts people to find creative new ways to address the difficulties produced by the change.     The late imperial Chinese economy had reached an equilibrium point. It had become stable, efficient, and well organized. The rapidly growing population but slowly growing amount of agricultural land largely prevented any significant capital surplus from developing, as almost all production was required for basic sustenance.     The growing population also provided a ready pool of cheap labor. The Chinese economy was enormous and well integrated. The dense and well-developed ": null
    },
    {
        "water trade": "water trading"
    },
    {
        " networks yielded a relatively large amount of profit to the upper classes and alleviated local supply shortages. Thus, there was no incentive for further technical refinement, and technical progress stagnated.       By contrast, the British economy at the time of the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " was much smaller and less efficient than Chinas. Local shortages could not be readily alleviated by internal trade; besides being far smaller than China, Britain lacked an efficient internal water-based trade network, which prompted the development of the ": null
    },
    {
        "steam engine": "steam engine"
    },
    {
        " and ": null
    },
    {
        "railroad": "railroad"
    }
]