[
    {
        "The hijackers in the September 11 attacks  were 19 men affiliated with ": null
    },
    {
        "al-Qaeda": "al-qaeda"
    },
    {
        ". Fifteen of the 19 were citizens of ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        ", two were from the ": null
    },
    {
        "United Arab Emirates": "united arab emirates"
    },
    {
        ", one from ": null
    },
    {
        "Lebanon": "lebanon"
    },
    {
        ", and one from ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ". The hijackers were organized into four teams, each led by a pilot-trained hijacker with three or four muscle hijackers, who were trained to help subdue the pilots, passengers, and crew.     The first hijackers to arrive in the United States were ": null
    },
    {
        "Khalid al-Mihdhar": "khalid al-mihdhar"
    },
    {
        " and ": null
    },
    {
        "Nawaf al-Hazmi": "nawaf al-hazmi"
    },
    {
        ", who settled in ": null
    },
    {
        "San Diego County, California": "san diego county, california"
    },
    {
        ", in January 2000. They were followed by three hijacker-pilots, ": null
    },
    {
        "Mohamed Atta": "mohamed atta"
    },
    {
        ", ": null
    },
    {
        "Marwan al-Shehhi": "marwan al-shehhi"
    },
    {
        ", and ": null
    },
    {
        "Ziad Jarrah": "ziad jarrah"
    },
    {
        " in mid-2000 to undertake flight training in ": null
    },
    {
        "South Florida": "south florida"
    },
    {
        ". The fourth hijacker-pilot, ": null
    },
    {
        "Hani Hanjour": "hani hanjour"
    },
    {
        ", arrived in San Diego in December 2000. The rest of the muscle hijackers arrived in early- and mid-2001.       ": null
    },
    {
        "Khalid al-Mihdhar": "khalid al-mihdhar"
    },
    {
        " and ": null
    },
    {
        "Nawaf al-Hazmi": "nawaf al-hazmi"
    },
    {
        " were both experienced and respected ": null
    },
    {
        "jihad": "jihad"
    },
    {
        "ists in the eyes of al-Qaeda leader ": null
    },
    {
        "Osama bin Laden": "osama bin laden"
    },
    {
        ".     As for the pilots who would go on to participate in the attacks, three of them were original members of the ": null
    },
    {
        "Hamburg cell": "hamburg cell"
    },
    {
        " . Following their training at al-Qaeda training camps in ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        ", they were chosen by Bin Laden and al-Qaedas military wing due to their extensive knowledge of western culture and language skills, increasing the missions operational security and its chances for success. The fourth intended pilot, ": null
    },
    {
        "Ramzi bin al-Shibh": "ramzi bin al-shibh"
    },
    {
        ", a member of the Hamburg cell, was also chosen to participate in the attacks yet was unable to obtain a visa for entry into the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". He was later replaced by ": null
    },
    {
        "Hani Hanjour": "hani hanjour"
    },
    {
        ", a Saudi national.        Mihdhar and Hazmi were also potential pilot hijackers, but did not do well in their initial pilot lessons in San Diego. Both were kept on as muscle hijackers, who would help overpower the passengers and crew and allow the pilot hijackers to take control of the flights. In addition to Mihdhar and Hazmi, thirteen other muscle hijackers were selected in late 2000 or early 2001. All were from Saudi Arabia, with the exception of ": null
    },
    {
        "Fayez Banihammad": "fayez banihammad"
    },
    {
        ", who was from the ": null
    },
    {
        "United Arab Emirates": "united arab emirates"
    },
    {
        ".                               : N.B.: Bold text notes the hijackers who piloted the planes.     Hijackers:  Mohamed Atta  , ": null
    },
    {
        "Abdulaziz al-Omari": "abdulaziz al-omari"
    },
    {
        " , ": null
    },
    {
        "Wail al-Shehri": "wail al-shehri"
    },
    {
        " , ": null
    },
    {
        "Waleed al-Shehri": "waleed al-shehri"
    },
    {
        " , ": null
    },
    {
        "Satam al-Suqami": "satam al-suqami"
    },
    {
        " . , June 18, 2002.     Two flight attendants called the American Airlines reservation desk during the hijacking. ": null
    },
    {
        "Betty Ong": "betty ong"
    },
    {
        " reported that the five hijackers had come from first-class seats: 2A, 2B, 9A, 9C and 9B.  Flight attendant ": null
    },
    {
        "Amy Sweeney": "madeline amy sweeney"
    },
    {
        " called a flight services manager at ": null
    },
    {
        "Logan Airport": "logan international airport"
    },
    {
        " in ": null
    },
    {
        "Boston": "boston"
    },
    {
        " and described them as Middle Eastern. She gave the staff the seat numbers and they pulled up the ticket and credit card information of the hijackers, identifying Mohamed Atta.            Mohamed Attas voice was heard over the ": null
    },
    {
        "air traffic control": "air traffic control"
    },
    {
        " system, broadcasting messages thought to be intended for the passengers.                  Hijackers:  Marwan al-Shehhi  , ": null
    },
    {
        "Fayez Banihammad": "fayez banihammad"
    },
    {
        " , ": null
    },
    {
        "Mohand al-Shehri": "mohand al-shehri"
    },
    {
        " , ": null
    },
    {
        "Hamza al-Ghamdi": "hamza al-ghamdi"
    },
    {
        " , ": null
    },
    {
        "Ahmed al-Ghamdi": "ahmed al-ghamdi"
    },
    {
        " .     A United Airlines mechanic was called by a flight attendant who stated the crew had been murdered and the plane hijacked.             Hijackers:  Hani Hanjour  , ": null
    },
    {
        "Khalid al-Mihdhar": "khalid al-mihdhar"
    },
    {
        " , ": null
    },
    {
        "Majed Moqed": "majed moqed"
    },
    {
        " , ": null
    },
    {
        "Nawaf al-Hazmi": "nawaf al-hazmi"
    },
    {
        " , ": null
    },
    {
        "Salem al-Hazmi": "salem al-hazmi"
    },
    {
        " .     Two hijackers, Hani Hanjour and Majed Moqed were identified by clerks as having bought single, first-class tickets for Flight 77 from Advance Travel Service in ": null
    },
    {
        "Totowa, New Jersey": "totowa, new jersey"
    },
    {
        " with $1,842.25 in cash. Renee May, a flight attendant on Flight 77, used a cell phone to call her mother in ": null
    },
    {
        "Las Vegas": "las vegas valley"
    },
    {
        ". She said her flight was being hijacked by six individuals who had moved them to the rear of the plane. Unlike the other flights, there was no report of stabbings or bomb threats. According to the ": null
    },
    {
        "9/11 Commission Report": "9/11 commission report"
    },
    {
        ", it is possible that pilots were not stabbed to death and were sent to the rear of the plane. One of the hijackers, most likely Hanjour, announced on the intercom that the flight had been hijacked.    Passenger ": null
    },
    {
        "Barbara Olson": "barbara olson"
    },
    {
        " called her husband, ": null
    },
    {
        "Theodore Olson": "theodore olson"
    },
    {
        ", the ": null
    },
    {
        "Solicitor General of the United States": "solicitor general of the united states"
    },
    {
        ", stating the flight had been hijacked and the hijackers had knives and box cutters.  Two of the passengers had been on the FBIs terrorist-alert list: Khalid al-Mihdhar and Nawaf al-Hazmi.                   Hijackers:  Ziad Jarrah  , ": null
    },
    {
        "Ahmed al-Haznawi": "ahmed al-haznawi"
    },
    {
        " , ": null
    },
    {
        "Ahmed al-Nami": "ahmed al-nami"
    },
    {
        " , ": null
    },
    {
        "Saeed al-Ghamdi": "saeed al-ghamdi"
    },
    {
        " .     Passenger ": null
    },
    {
        "Jeremy Glick": "jeremy glick"
    },
    {
        " stated that the hijackers were Arabic-looking, wearing red headbands, and carrying knives.       Spoken messages intended for passengers were broadcast over the air traffic control system, presumably by mistake:          Jarrah is also heard on the ": null
    },
    {
        "cockpit voice recorder": "cockpit voice recorder"
    },
    {
        ".  In addition, DNA samples submitted by his girlfriend were matched to remains recovered in ": null
    },
    {
        "Shanksville": "shanksville, pennsylvania"
    },
    {
        ".                 Before the attacks, FBI agent ": null
    },
    {
        "Robert Wright, Jr.": "robert wright, jr."
    },
    {
        " had written vigorous criticisms of FBIs alleged incompetence in investigating terrorists residing within the United States. Wright was part of the Bureaus Chicago counter-terrorism task force and involved in project Vulgar Betrayal, which was linked to ": null
    },
    {
        "Yasin al-Qadi": "yasin al-qadi"
    },
    {
        ". , address to the National Press Club on May 30, 2002, with ": null
    },
    {
        "Judicial Watch": "judicial watch"
    },
    {
        ", via rationalveracity.com     According to James Bamford, the ": null
    },
    {
        "NSA": "nsa"
    },
    {
        " had picked up communications of al-Mihdhar and al-Hazmi back in 1999, but had been hampered by internal bureaucratic conflicts between itself and the CIA and did not do a full analysis of the information it passed on to the agency. For example, it only passed on the first names, Nawaf and Khalid. Shadow Factory, James Bamford, Doubleday, 2008, Chapter 1: Intercept     Bamford also claims that the CIAs ": null
    },
    {
        "Alec Station": "alec station"
    },
    {
        " knew that al-Mihdhar was planning to come to New York as far back as January 2000. Doug Miller, one of three FBI agents working inside the CIA station, tried to send a message to the FBI to alert them about this, so they could put al-Mihdhar on a ": null
    },
    {
        "watch list": "wikt:watchlist"
    },
    {
        ". His CIA boss, Tom Wilshire, deputy station chief, allegedly denied permission to Miller. Miller asked his associate ": null
    },
    {
        "Mark Rossini": "mark rossini"
    },
    {
        " for advice; Rossini pressed Wilshires deputy but was rebuffed also. Bamford, Chapter 1 , Nova, interview with Mark Rossini 2.3.2009     Bamford also claims that al-Mihdhar and Hazmi wound up living with Abdussattar Shaikh for a time to save money. Shaikh was, coincidentally, an FBI informant, but since they never acted suspiciously around him, he never reported them. The CIA Bangkok station told Alec Station that Hazmi had gone to Los Angeles. None of this information made it back to the FBI headquarters. Bamford, Chapter 2: San Diego       Within minutes of the attacks, the ": null
    },
    {
        "Federal Bureau of Investigation": "federal bureau of investigation"
    },
    {
        " opened the largest FBI investigation in United States history, operation ": null
    },
    {
        "PENTTBOM": "penttbom"
    },
    {
        ". The suspects were identified within 72 hours because few made any attempt to disguise their names on flight and credit card records. They were also among the few non-U.S. citizens and nearly the only passengers with Arabic names on their flights, enabling the FBI to identify them using such details as dates of birth, known or possible residences, visa status, and specific identification of the suspected pilots. , FBI, national Press Release September 14, 2001  On September 27, 2001, the FBI released photos of the 19 hijackers, along with information about many of their possible nationalities and aliases.  FBI, national Press Release 27 September 2001  The suspected hijackers were from ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        " , ": null
    },
    {
        "United Arab Emirates": "united arab emirates"
    },
    {
        " , ": null
    },
    {
        "Lebanon": "lebanon"
    },
    {
        " and ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " .     The passport of Satam al-Suqami was reportedly recovered a few blocks from where the World Trade Centers twin towers once stood ; , September 16, 2001. , BBC News, 16 September 2001 a passerby picked it up and gave it to a NYPD detective shortly before the towers collapsed. The passports of two other hijackers, Ziad Jarrah and Saeed al-Ghamdi, were recovered from the crash site of United Airlines Flight 93 in Pennsylvania, and a fourth passport, that of Abdulaziz al-Omari was recovered from luggage that did not make it onto ": null
    },
    {
        "American Airlines Flight 11": "american airlines flight 11"
    },
    {
        ".      According to the ": null
    },
    {
        "9/11 Commission Report": "9/11 commission report"
    },
    {
        ", 26 al-Qaeda terrorist conspirators sought to enter the United States to carry out a suicide mission. In the end, the FBI reported that there were 19 hijackers in all: five on three of the flights, and four on the fourth. On September 14, three days after the attacks, the ": null
    },
    {
        "FBI": "fbi"
    },
    {
        " announced the names of 19 persons. After a controversy about an earlier remark, U.S. Homeland Security Secretary ": null
    },
    {
        "Janet Napolitano": "janet napolitano"
    },
    {
        " stated in May 2009 that the ": null
    },
    {
        "9/11 Commission": "9/11 commission"
    },
    {
        " found that none of the hijackers entered the United States through Canada.     Nawaf al-Hazmi and Hani Hanjour, attended the ": null
    },
    {
        "Dar al-Hijrah": "dar al-hijrah"
    },
    {
        " Falls Church, Virginia, Islamic Center where the Imam ": null
    },
    {
        "Anwar al-Awlaki": "anwar al-awlaki"
    },
    {
        " preached, in early April 2001. Through interviews with the FBI, it was discovered that Awlaki had previously met Nawaf al-Hazmi several times while the two lived in San Diego. At the time, Hazmi was living with Khalid al-Mihdhar, another 9/11 hijacker.  The hijackers of the same plane often had very strong ties as many of them attended school together or lived together prior to the attacks.        Soon after the attacks and before the FBI had released the pictures of all the hijackers, several reports claimed some of the men named as hijackers on 9/11 were alive   and had their ": null
    },
    {
        "identities stolen": "identity theft"
    },
    {
        ".   ": null
    }
]