[
    {
        "In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", specifically ": null
    },
    {
        "commutative algebra": "commutative algebra"
    },
    {
        ", Hilberts basis theorem says that a ": null
    },
    {
        "polynomial ring": "polynomial ring"
    },
    {
        " over a ": null
    },
    {
        "Noetherian ring": "noetherian ring"
    },
    {
        " is Noetherian.         If R is a ring, let R denote the ring of polynomials in the indeterminate X over R . ": null
    },
    {
        "Hilbert": "david hilbert"
    },
    {
        " proved that if R is not too large , in the sense that if R is Noetherian, the same must be true for R . Formally,     Hilberts Basis Theorem. If R is a Noetherian ring, then R is a Noetherian ring.     Corollary. If R is a Noetherian ring, then R is a Noetherian ring.     This can be translated into ": null
    },
    {
        "algebraic geometry": "algebraic geometry"
    },
    {
        " as follows: every ": null
    },
    {
        "algebraic set": "algebraic set"
    },
    {
        " over a field can be described as the set of common roots of finitely many polynomial equations.  proved the theorem in the course of his proof of finite generation of rings of invariants.     Hilbert produced an innovative proof by contradiction using ": null
    },
    {
        "mathematical induction": "mathematical induction"
    },
    {
        "; his method does not give an ": null
    },
    {
        "algorithm": "algorithm"
    },
    {
        " to produce the finitely many basis polynomials for a given ideal: it only shows that they must exist. One can determine basis polynomials using the method of ": null
    },
    {
        "Gröbner bases": "gröbner basis"
    },
    {
        ".       :Theorem. If R is a left ": null
    },
    {
        "Noetherian ring": "noetherian ring"
    },
    {
        ", then the ": null
    },
    {
        "polynomial ring": "polynomial ring"
    },
    {
        " R is also a left Noetherian ring.     Remark. We will give two proofs, in both only the left case is considered; the proof for the right case is similar.         Suppose \\mathfrak a \\subseteq R is a non-finitely generated left-ideal. Then by recursion  there is a sequence \\ of polynomials such that if \\mathfrak b_n is the left ideal generated by f_0, \\ldots, f_ then f_n \\in \\mathfrak a \\setminus \\mathfrak b_n is of minimal degree. It is clear that \\ is a non-decreasing sequence of naturals. Let a_n be the leading coefficient of f_n and let \\mathfrak be the left ideal in R generated by a_0,a_1,\\ldots . Since R is Noetherian the chain of ideals     : \\subset\\subset \\subset \\cdots     must terminate. Thus \\mathfrak b for some integer N . So in particular,     : a_N\\sum_": null
    }
]