[
    {
        "   Hildesheim is a ": null
    },
    {
        "district": "districts of germany"
    },
    {
        "  in ": null
    },
    {
        "Lower Saxony": "lower saxony"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". It is bounded by the districts of ": null
    },
    {
        "Hanover": "hanover"
    },
    {
        ", ": null
    },
    {
        "Peine": "peine"
    },
    {
        ", ": null
    },
    {
        "Wolfenbüttel": "wolfenbüttel"
    },
    {
        ", ": null
    },
    {
        "Goslar": "goslar"
    },
    {
        ", ": null
    },
    {
        "Northeim": "northeim"
    },
    {
        ", ": null
    },
    {
        "Holzminden": "holzminden"
    },
    {
        " and ": null
    },
    {
        "Hamelin-Pyrmont": "hamelin-pyrmont"
    },
    {
        ".       In 42 the ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n government established districts within the ": null
    },
    {
        "Province of Hanover": "province of hanover"
    },
    {
        ". The present territory of the district was occupied by four districts: Hildesheim, Alfeld, Gronau and Marienburg. In 42 the district of Gronau joined Alfeld, and the number of districts was reduced to three.     When the state of Lower Saxony was founded in 42 the districts were reorganised: Hildesheim became an urban district, the remaining district of Hildesheim and Marienburg were merged to the new district of Hildesheim-Marienburg. The district of Alfeld remained in its former borders.     In 42 the city of Hildesheim lost its status as an urban district and became part of the surrounding district, which was renamed to Hildesheim. The districts of Hildesheim and Alfeld were merged in 42       The district is located southeast of ": null
    },
    {
        "Hanover": "hanover"
    },
    {
        ", and the northernmost parts border the Hanover metropolitan area. The northern half of the district is highly urbanised, while the south is covered with forests. The River ": null
    },
    {
        "Leine": "leine"
    },
    {
        " enters the district in the south, runs through the towns of Alfeld and Gronau and leaves in the northwest towards Hanover; a small affluent, the ": null
    },
    {
        "Innerste": "innerste"
    },
    {
        ", joins the Leine from the east after flowing through the city of Hildesheim. Between Leine and Innerste there are the forested hill chains of the ": null
    },
    {
        "Hildesheim Forest": "hildesheim forest"
    },
    {
        "  and the ": null
    },
    {
        "Sieben Berge": "sieben berge"
    },
    {
        " .         The coat of arms displays:   the eagle from the arms of the city of Hildesheim   the deer antler, taken from the former district of Alfeld, represents the ": null
    },
    {
        "Germanic": "germanic tribes"
    },
    {
        " tribe of the ": null
    },
    {
        "Cherusci": "cherusci"
    },
    {
        "  Thousand-year Rose": "thousand-year rose"
    },
    {
        " at ": null
    },
    {
        "St. Marys Cathedral": "st. marys cathedral, hildesheim"
    },
    {
        "          ": null
    }
]