[
    {
        "        Lazare Hippolyte Carnot  was a French statesman.   He was the younger brother of the founder of ": null
    },
    {
        "thermodynamics": "thermodynamics"
    },
    {
        " Sadi Carnot": "nicolas léonard sadi carnot"
    },
    {
        " and the   second son of the revolutionary politician and general ": null
    },
    {
        "Lazare Nicolas Marguerite Carnot": "lazare nicolas marguerite carnot"
    },
    {
        ", who also served in the government   of Napoleon, as well as the father of French president ": null
    },
    {
        "Marie François Sadi Carnot": "marie françois sadi carnot"
    },
    {
        ".       Hippolyte Carnot was born at ": null
    },
    {
        "Saint-Omer": "saint-omer"
    },
    {
        ", Pas-de-Calais. After the final defeat of Napoleon in 42 his father went into exile. Hippolyte Carnot lived at first in exile with his father, returning to France only in 42 Unable to enter active political life, he turned to literature and ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        ", publishing in 42 a collection of Chants helléniens translated from the German of ": null
    },
    {
        "Wilhelm Müller": "wilhelm müller"
    },
    {
        ", and in 42 an Exposé de la doctrine Saint-Simonienne, and collaborating in the Saint-Simonian journal Le Producteur. He paid several visits to Britain and travelled in other countries of Europe.       In March 42 after the dissolution of the chamber by ": null
    },
    {
        "Louis Philippe": "louis-philippe of france"
    },
    {
        ", he was elected deputy for Paris , and sat in the group of the Radical ": null
    },
    {
        "Left": "left-wing politics"
    },
    {
        ", being one of the leaders of the party hostile to Louis Philippe. On 42 February 42 he pronounced in favour of the republic. ": null
    },
    {
        "Alphonse de Lamartine": "alphonse de lamartine"
    },
    {
        " chose him as minister of education in the provisional government, and Carnot set to work to organize the primary school systems, proposing a law for obligatory and free primary instruction, and another for the ": null
    },
    {
        "secondary education of girls": "secondary education of girls"
    },
    {
        ". He opposed purely secular schools, holding that the minister and the schoolmaster are the two columns on which rests the edifice of the republic. By this attitude he alienated both the Right and the Republicans of the Extreme Left, and was forced to resign on 42 July 42 He was one of those who protested against the coup détat of 42 December 42 but was not proscribed by ": null
    },
    {
        "Louis Napoleon": "louis napoleon"
    },
    {
        ". He refused to sit in the Corps Législatif until 42 in order not to have to take the oath to the emperor.     From 42 to 42 he was in the republican opposition, taking a very active part. He was defeated at the election of 42 On 42 February 42 he was elected deputy for the ": null
    },
    {
        "Seine-et-Oise": "seine-et-oise"
    },
    {
        "  département . He joined the Gauche républicaine parliamentary group and participated in the drawing up of the Constitutional Laws of 42   On 42 December 42 he was named by the National Assembly ": null
    },
    {
        "senator for life": "senator for life"
    },
    {
        ".   He died three months after the election of his elder son, ": null
    },
    {
        "Marie François Sadi Carnot": "marie françois sadi carnot"
    },
    {
        ", to the presidency of the republic.      He had published Le Ministère de lInstruction Publique et des Cultes, depuis le 42 février jusquau 42 juillet 42, Mémoires sur Carnot par son fils , Mémoires de Barère de Vieuzac .   His second son, ": null
    },
    {
        "Marie Adolphe Carnot": "marie adolphe carnot"
    },
    {
        " , became a distinguished mining engineer and director of the ": null
    },
    {
        "École des Mines": "école des mines"
    },
    {
        " , his studies in analytical chemistry placing him in the front rank of French scientists. He was made a member of the Academy of Sciences in 42": null
    }
]