[
    {
        "   The history of Luxembourg consists of the history of the country of ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        " and its geographical area.     Although its ": null
    },
    {
        "recorded history": "recorded history"
    },
    {
        " can be traced back to ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " times, the history of Luxembourg proper is considered to begin in 963. Over the following five centuries, the powerful ": null
    },
    {
        "House of Luxembourg": "house of luxembourg"
    },
    {
        " emerged, but its extinction put an end to the countrys independence. After a brief period of ": null
    },
    {
        "Burgundian": "duchy of burgundy"
    },
    {
        " rule, the country passed to the ": null
    },
    {
        "Habsburgs": "habsburg"
    },
    {
        "in 1477.     After the ": null
    },
    {
        "Eighty Years War": "eighty years war"
    },
    {
        ", Luxembourg became a part of the ": null
    },
    {
        "Southern Netherlands": "southern netherlands"
    },
    {
        ", which passed to the Austrian line of the Habsburg dynasty in 1713. After occupation by ": null
    },
    {
        "Revolutionary France": "revolutionary france"
    },
    {
        ", the 1815 ": null
    },
    {
        "Treaty of Paris": "treaty of paris, 1815"
    },
    {
        " transformed Luxembourg into a ": null
    },
    {
        "Grand Duchy": "grand duchy"
    },
    {
        " in ": null
    },
    {
        "personal union": "personal union"
    },
    {
        " with the ": null
    },
    {
        "Netherlands": "united kingdom of the netherlands"
    },
    {
        ". The treaty also resulted in the second ": null
    },
    {
        "partitioning of Luxembourg": "partitions of luxembourg"
    },
    {
        ", the first being in 1658 and a third in 1839. Although these treaties greatly reduced Luxembourgs territory, the latter established its formal independence, which was confirmed after the ": null
    },
    {
        "Luxembourg Crisis": "luxembourg crisis"
    },
    {
        " of 1867.     In the following decades, Luxembourg fell further into Germanys ": null
    },
    {
        "sphere of influence": "sphere of influence"
    },
    {
        ", particularly after the creation of a separate ruling house in 1890. It was occupied by Germany ": null
    },
    {
        "from 1914 until 1918": "german occupation of luxembourg in world war i"
    },
    {
        " and again ": null
    },
    {
        "from 1940 until 1944": "german occupation of luxembourg in world war ii"
    },
    {
        ". Since the end of the ": null
    },
    {
        "Second World War": "world war ii"
    },
    {
        ", Luxembourg has become one of the worlds richest countries, buoyed by a booming ": null
    },
    {
        "financial services": "financial services"
    },
    {
        " sector, political stability, and ": null
    },
    {
        "European integration": "european integration"
    },
    {
        ".             In the territory now covered by the ": null
    },
    {
        "Grand Duchy of Luxembourg": "grand duchy of luxembourg"
    },
    {
        ", there is evidence of primitive inhabitants dating back to the Paleolithic or Old Stone Age over 35,000 years ago. The oldest artefacts from this period are decorated bones found at ": null
    },
    {
        "Oetrange": "oetrange"
    },
    {
        ".     However, the first real evidence of civilisation is from the Neolithic or 5th millennium BC, from which evidence of houses has been found. Traces have been found in the south of Luxembourg at ": null
    },
    {
        "Grevenmacher": "grevenmacher"
    },
    {
        ", ": null
    },
    {
        "Diekirch": "diekirch"
    },
    {
        ", ": null
    },
    {
        "Aspelt": "aspelt"
    },
    {
        " and ": null
    },
    {
        "Weiler-la-Tour": "weiler-la-tour"
    },
    {
        ". The dwellings were made of a combination of tree trunks for the basic structure, mud-clad wickerwork walls, and roofs of thatched reeds or straw. Pottery from this period has been found near ": null
    },
    {
        "Remerschen": "remerschen"
    },
    {
        ".     While there is not much evidence of communities in Luxembourg at the beginning of the Bronze Age, a number of sites dating back to the period between the 13th and the 8th century BC provide evidence of dwellings and reveal artefacts such as pottery, knives and jewellery. The sites include ": null
    },
    {
        "Nospelt": "nospelt"
    },
    {
        ", ": null
    },
    {
        "Dalheim": "dalheim"
    },
    {
        ", ": null
    },
    {
        "Mompach": "mompach"
    },
    {
        " and Remerschen.     What is present-day Luxembourg, was inhabited by ": null
    },
    {
        "Celts": "celts"
    },
    {
        " during the ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " .   The ": null
    },
    {
        "Gaulish": "gauls"
    },
    {
        " tribe in what is present-day Luxembourg during and after the ": null
    },
    {
        "La Tène period": "la tène period"
    },
    {
        " was known as the ": null
    },
    {
        "Treveri": "treveri"
    },
    {
        "; they reached the height of prosperity in the 1st century BC. The Treveri constructed a number of ": null
    },
    {
        "oppida": "oppida"
    },
    {
        ", ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " fortified settlements, near the ": null
    },
    {
        "Moselle valley": "moselle valley"
    },
    {
        " in what is now southern Luxembourg, western Germany and eastern France. Most of the archaeological evidence from this period has been discovered in tombs, many closely associated with ": null
    },
    {
        "Titelberg": "titelberg"
    },
    {
        ", a 50 ha site which reveals much about the dwellings and handicrafts of the period.     The ": null
    },
    {
        "Romans": "rome"
    },
    {
        ", under ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        ", completed their conquest and occupation in 53 BC. The first known reference to the territory of present-day Luxembourg was by Julius Caesar in his  Commentaries on the Gallic War .  The Treveri were more co-operative with the Romans than most ": null
    },
    {
        "Gallic tribes": "tribes of gaul"
    },
    {
        ", and adapted readily to Roman civilization. Two revolts in the 1st century AD did not permanently damage their cordial relations with Rome.   The land of the Treveri was at first part of ": null
    },
    {
        "Gallia Celtica": "gallia celtica"
    },
    {
        ", but with the reform of ": null
    },
    {
        "Domitian": "domitian"
    },
    {
        " in c. 90, was reassigned to ": null
    },
    {
        "Gallia Belgica": "gallia belgica"
    },
    {
        ".     Gallia Belgica was infiltrated by the Germanic ": null
    },
    {
        "Franks": "franks"
    },
    {
        " from the 4th century, and was abandoned by Rome in AD 406.   The territory of what would become Luxembourg by the 480s, became part of ": null
    },
    {
        "Merovingia": "merovingian"
    },
    {
        " Austrasia": "austrasia"
    },
    {
        " and eventually part of the core territory of the ": null
    },
    {
        "Carolingian Empire": "carolingian empire"
    },
    {
        ".   With the ": null
    },
    {
        "Treaty of Verdun": "treaty of verdun"
    },
    {
        " , it fell to ": null
    },
    {
        "Middle Francia": "middle francia"
    },
    {
        ", and in 855, to ": null
    },
    {
        "Lotharingia": "lotharingia"
    },
    {
        ". With the latters division in 959, it then fell to the ": null
    },
    {
        "Duchy of Upper Lorraine": "duchy of upper lorraine"
    },
    {
        " within the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ".            The history of Luxembourg properly began with the construction of Luxembourg Castle in the ": null
    },
    {
        "High Middle Ages": "high middle ages"
    },
    {
        ". It was Siegfried I, count of ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        " who traded some of his ancestral lands with the monks of the ": null
    },
    {
        "Abbey of St. Maximin": "abbey of st. maximin"
    },
    {
        " in ": null
    },
    {
        "Trier": "trier"
    },
    {
        " in 963 for an ancient, supposedly Roman, fort named Lucilinburhuc.  Modern historians link the etymology of the word with Letze,  meaning fortification, which may have referred to either the remains of a Roman watchtower or to a primitive refuge of the early Middle Ages.            From the ": null
    },
    {
        "Early Middle Ages": "early middle ages"
    },
    {
        " to the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ", Luxembourg bore multiple names, depending on the author. These include Lucilinburhuc, Lutzburg, Lützelburg, Luccelemburc, and Lichtburg, among others. The ": null
    },
    {
        "Luxembourgish dynasty": "house of luxembourg"
    },
    {
        " produced several ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        "s, Kings of ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        ", and ": null
    },
    {
        "Archbishops": "archbishop"
    },
    {
        "of ": null
    },
    {
        "Trier": "trier"
    },
    {
        " and ": null
    },
    {
        "Mainz": "mainz"
    },
    {
        ".     Around the fort of Luxembourg, a town gradually developed, which became the centre of a small but important state of great strategic value to France, Germany and the Netherlands. Luxembourgs fortress, located on a rocky outcrop known as the ": null
    },
    {
        "Bock": "bock"
    },
    {
        ", was steadily enlarged and strengthened over the years by successive owners. Some of these included the ": null
    },
    {
        "Bourbons": "bourbons"
    },
    {
        ", ": null
    },
    {
        "Habsburgs": "habsburg"
    },
    {
        "and ": null
    },
    {
        "Hohenzollern": "hohenzollern"
    },
    {
        "s, who made it one of the strongest fortresses on the European continent, the ": null
    },
    {
        "Fortress of Luxembourg": "fortress of luxembourg"
    },
    {
        ". Its formidable defences and strategic location caused it to become known as the ‘": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        " of the North’.          In the 17th and 18th centuries, the electors of Brandenburg, later kings of Prussia , advanced their claim to the Luxembourg patrimony as heirs-general to William of Thuringia and his wife Anna of Bohemia, the disputed dukes of Luxembourg in the 1460s. Anna was the eldest daughter of the last Luxembourg heiress. From 1609 onward, they had a territorial base in the vicinity, the ": null
    },
    {
        "Duchy of Cleves": "duchy of cleves"
    },
    {
        ", the starting-point of the future ": null
    },
    {
        "Prussian Rhineland": "prussian rhineland"
    },
    {
        ". This Brandenburger claim ultimately produced some results when some districts of Luxembourg were united with Prussia in 1813.     The first Hohenzollern claimant to descend from both Anna and her younger sister Elisabeth, was ": null
    },
    {
        "John George, Elector of Brandenburg": "john george, elector of brandenburg"
    },
    {
        " , his maternal grandmother having been ": null
    },
    {
        "Barbara Jagiellon": "barbara jagiellon"
    },
    {
        ". In the late 18th century, the younger line of ": null
    },
    {
        "Orange-Nassau": "house of orange-nassau"
    },
    {
        " also became related to the Brandenburgers.     In 1598, the then possessor, ": null
    },
    {
        "Philip II of Spain": "philip ii of spain"
    },
    {
        ", bequeathed Luxembourg and the other Low Countries to his daughter, the Infanta ": null
    },
    {
        "Isabella Clara Eugenia": "isabella clara eugenia"
    },
    {
        " and her husband ": null
    },
    {
        "Albert VII, Archduke of Austria": "albert vii, archduke of austria"
    },
    {
        ". Albert was an heir and descendant of ": null
    },
    {
        "Elisabeth of Austria ": "elisabeth of austria"
    },
    {
        ", queen of Poland, the youngest granddaughter of ": null
    },
    {
        "Sigismund of Luxembourg": "sigismund of luxembourg"
    },
    {
        ", the Holy Roman Emperor. Thus, Luxembourg returned to the heirs of the old Luxembourg dynasty of the line of Elisabeth. The Low Countries were a separate political entity during the couples reign. After Alberts childless death in 1621, Luxembourg passed to his great-nephew and heir ": null
    },
    {
        "Philip IV of Spain": "philip iv of spain"
    },
    {
        ".          ": null
    },
    {
        "Luxembourg was invaded": "siege of luxembourg"
    },
    {
        " by ": null
    },
    {
        "Louis XIV of France": "louis xiv of france"
    },
    {
        " in 1684, an action that caused alarm among Frances neighbors and resulted in the formation of the ": null
    },
    {
        "League of Augsburg": "league of augsburg"
    },
    {
        " in 1686. In the ensuing ": null
    },
    {
        "War of the Grand Alliance": "war of the grand alliance"
    },
    {
        ", France was forced to give up the duchy, which was returned to the Habsburgs by the ": null
    },
    {
        "Treaty of Ryswick": "treaty of ryswick"
    },
    {
        " in 1697.     During this period of French rule, the defences of the fortress were strengthened by the famous ": null
    },
    {
        "siege": "siege"
    },
    {
        " engineer ": null
    },
    {
        "Vauban": "vauban"
    },
    {
        ". The French kings great-grandson Louis was, from 1712, the first heir-general of Albert VII. Albert VII was a descendant of Anna of Bohemia and William of Thuringia, having that blood through his mothers Danish great-great-grandmother, but was not the heir-general of that line. Louis was the first real claimant of Luxembourg to descend from both sisters, the daughters of ": null
    },
    {
        "Elisabeth of Bohemia": "elisabeth of bohemia"
    },
    {
        ", the last Luxembourg empress.     Habsburg rule was confirmed in 1715 by the ": null
    },
    {
        "Treaty of Utrecht": "treaty of utrecht"
    },
    {
        ", and Luxembourg was integrated into the ": null
    },
    {
        "Southern Netherlands": "southern netherlands"
    },
    {
        ". Emperor Joseph and his successor Emperor Charles VI were descendants of Spanish kings who were heirs of Albert VII. Joseph and Charles VI were also descendants of Anna of Bohemia and William of Thuringia, having that blood through their mother, although they were heirs-general of neither line. Charles was the first ruler of Luxembourg to descend from both sisters, daughters of Elisabeth of Bohemia.     Austrian rulers were ready to exchange Luxembourg and other territories in the Low Countries. Their purpose was to round out and enlarge their power base, which in geographical terms was centred around ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ". Thus, Bavarian candidate emerged to take over the Duchy of Luxembourg, but this plan led to nothing permanent. Emperor ": null
    },
    {
        "Joseph II": "joseph ii, holy roman emperor"
    },
    {
        " however, made a preliminary pact to make a neighbour of Luxembourg, ": null
    },
    {
        "Charles Theodore, Elector Palatine": "charles theodore, elector palatine"
    },
    {
        ", as Duke of Luxembourg and king in the Low Countries, in exchange for his possessions in Bavaria and Franconia. However, this scheme was aborted by ": null
    },
    {
        "Prussias": "prussia"
    },
    {
        "opposition. Charles Theodore, who would have become Duke of Luxembourg, was genealogically a junior descendant of both Anna and Elisabeth, but the main heir of neither.     During the ": null
    },
    {
        "War of the First Coalition": "war of the first coalition"
    },
    {
        ", Luxembourg was conquered and annexed by ": null
    },
    {
        "Revolutionary France": "revolutionary france"
    },
    {
        ", becoming part of the  département  of the ": null
    },
    {
        "Forêts": "forêts"
    },
    {
        " Literally woods, in reference to the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        ". in 1795. The annexation was formalised at ": null
    },
    {
        "Campo Formio": "treaty of campo formio"
    },
    {
        " in 1797. In 1798, Luxembourgish peasants started a rebellion against the French but it was rapidly suppressed. This brief rebellion is called the ": null
    },
    {
        "Peasants War": "peasants war"
    },
    {
        ".             Luxembourg remained more or less under French rule until the ": null
    },
    {
        "defeat": "treaty of paris"
    },
    {
        " of ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " in 1815. When the French departed, the Allies installed a provisional administration. Luxembourg initially came under the Generalgouvernement Mittelrhein in mid-1814, and then from June 1814 under the Generalgouvernement Nieder- und Mittelrhein .     The ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " of 1815, gave formal autonomy to Luxembourg. In 1813, the Prussians had already managed to wrest lands from Luxembourg, to strengthen the Prussian-possessed ": null
    },
    {
        "Duchy of Julich": "duchy of julich"
    },
    {
        ". The Bourbons of France held a strong claim to Luxembourg, whereas the Emperor of Austria, on the other hand, had controlled the duchy until the revolutionary forces had joined it to the French republic .     Prussia and the Netherlands, both claiming Luxembourg, made an exchange deal: Prussia received the ": null
    },
    {
        "Principality of Orange-Nassau": "principality of orange-nassau"
    },
    {
        ", the ancestral Principality of the Prince of Orange in Central Germany and the Prince of Orange, in turn received Luxembourg.     Luxembourg, somewhat diminished in size , was augmented in another way through the elevation to the status of ": null
    },
    {
        "grand duchy": "grand duchy"
    },
    {
        " and placed under the rule of William I of the Netherlands. This was the first time that the duchy had a monarch who had no claim to the inheritance of the medieval patrimony. However, Luxembourgs military value to ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        " prevented it from becoming a full part of the Dutch kingdom. The fortress, ancestral seat of the medieval Luxembourgers, was garrisoned by Prussian forces, following Napoleons defeat, and Luxembourg became a member of the ": null
    },
    {
        "German Confederation": "german confederation"
    },
    {
        " with Prussia responsible for its defence, and a state under the suzerainty of the Netherlands at the same time.        In July 1819, a contemporary from Britain visited Luxembourg — his journal offers some insights. ": null
    },
    {
        "Norwich Duff": "norwich duff"
    },
    {
        ", writes of ": null
    },
    {
        "its city": "luxembourg"
    },
    {
        " that Luxembourg is considered one of the strongest fortifications in Europe, and … it appears so. It is situated in ": null
    },
    {
        "Holland": "netherlands"
    },
    {
        " but by treaty is ": null
    },
    {
        "garrisoned": "fortified town"
    },
    {
        " by Prussians and 5,000 of their troops occupy it under a ": null
    },
    {
        "Prince of Hesse": "william i, elector of hesse"
    },
    {
        ". The civil government is under the Dutch and the ": null
    },
    {
        "duties": "taxes"
    },
    {
        " collected by them. The town is not very large but the streets are broader than the French towns and clean and the houses are good.... got the cheapest of ": null
    },
    {
        "hot baths": "public bathing"
    },
    {
        " here at the principal house I ever had in my life: one franc.     In 1820, Luxembourg made use of the ": null
    },
    {
        "metric system": "metric system"
    },
    {
        " of measurement compulsory.   Previously, the country had using local units such as the malter .     Much of the Luxembourgish population joined the ": null
    },
    {
        "Belgian revolution": "belgian revolution"
    },
    {
        " against ": null
    },
    {
        "Dutch": "united kingdom of the netherlands"
    },
    {
        " rule. Except for the fortress and its immediate vicinity, Luxembourg was considered a province of the new Belgian state from 1830 to 1839. By the ": null
    },
    {
        "Treaty of London": "treaty of london, 1839"
    },
    {
        " in 1839, the status of the grand duchy became fully sovereign and in personal union to the king of the Netherlands. In turn, the predominantly ": null
    },
    {
        "Oil": "langues doïl"
    },
    {
        "-speaking geographically larger western part of the duchy was ceded to Belgium as the ": null
    },
    {
        "province de Luxembourg": "luxembourg"
    },
    {
        ".     This loss left the Grand Duchy of Luxembourg a predominantly German state, although French cultural influence remained strong. The loss of Belgian markets also caused painful economic problems for the state. Recognising this, the grand duke integrated it into the German  Zollverein  in 1842. Nevertheless, Luxembourg remained an underdeveloped agrarian country for most of the century. As a result of this, about one in five of the inhabitants ": null
    },
    {
        "emigrated": "luxembourg american"
    },
    {
        " to the United States between 1841 and 1891.            In 1867, Luxembourgs independence was confirmed, after a turbulent period which even included a brief time of civil unrest against plans to annex Luxembourg to Belgium, Germany, or France. The ": null
    },
    {
        "crisis": "luxembourg crisis"
    },
    {
        " of 1867 almost resulted in war between France and Prussia over the status of Luxembourg, which had become free of German control when the German Confederation was abolished at the end of the ": null
    },
    {
        "Seven Weeks War": "seven weeks war"
    },
    {
        " in 1866.     William III, king of the Netherlands, and sovereign of Luxembourg, was willing to sell the grand duchy to Frances Emperor ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " in order to retain ": null
    },
    {
        "Limbourg": "limbourg"
    },
    {
        " but backed out when Prussian chancellor, ": null
    },
    {
        "Otto von Bismarck": "otto von bismarck"
    },
    {
        ", expressed opposition. The growing tension brought about a conference in London from March to May 1867 in which the British served as mediators between the two rivals. Bismarck manipulated public opinion, resulting in the denial of sale to France. The issue was resolved by the second ": null
    },
    {
        "Treaty of London": "treaty of london, 1867"
    },
    {
        " which guaranteed the perpetual independence and ": null
    },
    {
        "neutrality": "neutral country"
    },
    {
        " of the state. The fortress walls were pulled down and the Prussian garrison was withdrawn. Frédéric Laux, Bismarck et laffaire du Luxembourg de 1867 à la lumière des archives britanniques, Revue dhistoire diplomatique 2001 115: 183-202 Herbert Maks, Zur Interdependenz innen- und außenpolitischer Faktoren in Bismarcks Politik in der luxemburgischen Frage 1866/67, Francia Part 3 19./20. 1997 24: 91-115.     Famous visitors to Luxembourg in the 18th and 19th centuries included the German poet ": null
    },
    {
        "Johann Wolfgang von Goethe": "johann wolfgang von goethe"
    },
    {
        ", the French writers ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        " and ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        ", the composer ": null
    },
    {
        "Franz Liszt": "franz liszt"
    },
    {
        ", and the English painter ": null
    },
    {
        "Joseph Mallord William Turner": "joseph mallord william turner"
    },
    {
        ".       Luxembourg remained a possession of the kings of the Netherlands until the death of ": null
    },
    {
        "William III": "william iii of the netherlands"
    },
    {
        " in 1890, when the grand duchy passed to the ": null
    },
    {
        "House of Nassau-Weilburg": "house of nassau-weilburg"
    },
    {
        " due to the 1783 ": null
    },
    {
        "Nassau Family Pact": "nassau family pact"
    },
    {
        ", under which those territories of the Nassau family in the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " at the time of the pact  were bound by semi-": null
    },
    {
        "Salic law": "salic law"
    },
    {
        ", which allowed ": null
    },
    {
        "inheritance": "inheritance"
    },
    {
        " by females or through the female line only upon extinction of male members of the ": null
    },
    {
        "dynasty": "dynasty"
    },
    {
        ". When ": null
    },
    {
        "William III": "william iii of the netherlands"
    },
    {
        " died leaving only his daughter ": null
    },
    {
        "Wilhelmina": "wilhelmina of the netherlands"
    },
    {
        " as an heir, the crown of the Netherlands, not being bound by the family pact, passed to Wilhelmina. However, the crown of Luxembourg passed to a male of another branch of the House of Nassau: ": null
    },
    {
        "Adolphe": "adolphe, grand duke of luxembourg"
    },
    {
        ", the dispossessed ": null
    },
    {
        "Duke of Nassau": "house of nassau"
    },
    {
        " and head of the ": null
    },
    {
        "branch of Nassau-Weilburg": "house of nassau-weilburg"
    },
    {
        ".          World War I affected Luxembourg at a time when the nation-building process was far from complete. The small grand duchy opted for an ambiguous policy between 1914 and 1918. With the country occupied by German troops, the government, led by Paul Eyschen, chose to remain neutral. This strategy had been elaborated with the approval of ": null
    },
    {
        "Marie-Adélaïde, Grand Duchess of Luxembourg": "marie-adélaïde, grand duchess of luxembourg"
    },
    {
        ". Although continuity prevailed on the political level, the war caused social upheaval, which laid the foundation for the first ": null
    },
    {
        "trades union": "trades union"
    },
    {
        " in Luxembourg.       The end of the occupation in November 1918, squared with a time of uncertainty on the international and national levels. The victorious Allies disapproved of the choices made by the local élites, and some Belgian politicians even demanded the integration of the country into a greater Belgium. Within Luxembourg, a strong minority asked for the creation of a republic. In the end, the grand duchy remained a monarchy but was led by a new head of state, ": null
    },
    {
        "Charlotte": "charlotte, grand duchess of luxembourg"
    },
    {
        ". In 1921, it entered into an economic and monetary union with Belgium, the Union Économique Belgo-Luxembourgeoise . During most of the 20th century, however, Germany remained its most important economic partner.     The introduction of ": null
    },
    {
        "universal suffrage": "universal suffrage"
    },
    {
        " for men and women favored the Rechtspartei which played the dominant role in the government throughout the 20th century, with the exception of 1925–26 and 1974–79, when the two other important parties, the ": null
    },
    {
        "Liberal": "liberal league"
    },
    {
        " and the ": null
    },
    {
        "Social-Democratic": "social democratic party"
    },
    {
        " parties, formed a coalition. The success of the resulting party was due partly to the support of the church — the population was more than 90 percent Catholic — and of its newspaper, the Luxemburger Wort.     On the international level, the interwar period was characterised by an attempt to put Luxembourg on the map. Especially under Joseph Bech, head of the Department of Foreign Affairs, the country participated more actively in several international organisations, in order to ensure its autonomy. On December 16, 1920, Luxembourg became a member of the ": null
    },
    {
        "League of Nations": "league of nations"
    },
    {
        ". On the economic level in the 1920s and the 1930s, the agricultural sector declined in favour of industry, but even more so for the service sector. The proportion of the active population in this last sector rose from 18 percent in 1907 to 31 percent in 1935.     In the 1930s, the internal situation deteriorated, as Luxembourgish politics were influenced by European left- and right-wing politics. The government tried to counter ": null
    },
    {
        "communist": "communist"
    },
    {
        "-led unrest in the industrial areas and continued friendly policies towards ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ", which led to much criticism. The attempts to quell unrest peaked with the  Maulkuerfgesetz , the muzzle Law, which was an attempt to outlaw the ": null
    },
    {
        "Communist Party": "communist party of luxembourg"
    },
    {
        ". The law was turned down in a 1937 referendum.          Upon the outbreak of the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " in September 1939, the government of Luxembourg observed its neutrality and issued an official proclamation to that effect on September 6, 1939. Government of the Grand Duchy of Luxembourg, Luxembourg and the German Invasion: Before and After p. 32 On May 10, 1940, an invasion by German armed forces swept away the Luxembourgish government and monarchy into exile. The German troops made up of the ": null
    },
    {
        "1st": "1st panzer division"
    },
    {
        ", ": null
    },
    {
        "2nd": "2nd panzer division"
    },
    {
        ", and ": null
    },
    {
        "10th Panzer Divisions": "10th panzer division"
    },
    {
        " invaded at 04:35. They did not encounter any significant resistance save for some bridges destroyed and some land mines since the majority of the Luxembourgish Volunteer Corps stayed in their barracks. Luxembourgish police resisted the German troops, but to little avail and the capital city was occupied before noon. Total Luxembourgish casualties amounted to 75 police and soldiers captured, six police wounded, and one soldier wounded. ": null
    },
    {
        "Horne, Alistair": "alistair horne"
    },
    {
        ", To Lose a Battle, p.258-264     The Luxembourg royal family and their entourage received visas from ": null
    },
    {
        "Aristides de Sousa Mendes": "aristides de sousa mendes"
    },
    {
        " in Bordeaux. They crossed into Portugal and subsequently travelled to the United States in two groups: on the  from Lisbon to Baltimore in July 1940, and on the Pan American airliner Yankee Clipper in October 1940. Throughout the war, ": null
    },
    {
        "Grand Duchess Charlotte": "grand duchess charlotte"
    },
    {
        " broadcast via the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " to Luxembourg to give hope to the people.     Luxembourg remained ": null
    },
    {
        "under German military occupation": "german occupation of luxembourg in world war ii"
    },
    {
        " until August 1942, when the ": null
    },
    {
        "Third Reich": "third reich"
    },
    {
        " formally annexed it as part of the  Gau  Moselland. The German authorities declared Luxembourgers to be German citizens and called up 13,000 for military service. 2,848 Luxembourgers eventually died fighting in the German army.     Luxembourgish opposition to this annexation took the form of passive resistance at first, as in the  Spéngelskrich  , and in refusal to speak German. As French was forbidden, many Luxembourgers resorted to resuscitating old Luxembourgish words, which led to a renaissance of the language. The Germans met opposition with ": null
    },
    {
        "deportation": "deportation"
    },
    {
        ", ": null
    },
    {
        "forced labour": "forced labour"
    },
    {
        ", ": null
    },
    {
        "forced conscription": "forced conscription"
    },
    {
        " and, more drastically, with ": null
    },
    {
        "internment": "internment"
    },
    {
        ", deportation to ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        " and execution.     Executions took place after the so-called ": null
    },
    {
        "general strike": "luxembourgian general strike of 1942"
    },
    {
        " from September 1 to September 3, 1942, which paralysed the administration, agriculture, industry and education in response to the declaration of ": null
    },
    {
        "forced conscription": "forced conscription"
    },
    {
        " by the German administration on August 30, 1942. The Germans suppressed the strike violently. They executed 21 strikers and deported hundreds more to ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        ". The then civilian administrator of Luxembourg, ": null
    },
    {
        "Gauleiter": "gauleiter"
    },
    {
        " Gustav Simon": "gustav simon"
    },
    {
        ", had declared conscription necessary to support the German war effort. The general strike in Luxembourg remained one of the few mass strikes against the German war machine in Western Europe.     U.S. forces liberated most of the country in September 1944. They entered the capital city on September 10, 1944. During the ": null
    },
    {
        "Ardennes Offensive": "ardennes offensive"
    },
    {
        "  German troops took back most of northern Luxembourg for a few weeks. Allied forces finally expelled the Germans in January 1945.     Between December 1944 and February 1945, the recently liberated city of ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        " was designated by the ": null
    },
    {
        "OB West": "ob west"
    },
    {
        " as the target for ": null
    },
    {
        "V-3": "v-3 cannonluxembourg bombardment"
    },
    {
        " siege gun": "siege gun"
    },
    {
        "s, which were originally intended to bombard ": null
    },
    {
        "London": "london"
    },
    {
        ". Two V-3 guns based at ": null
    },
    {
        "Lampaden": "lampaden"
    },
    {
        " fired a total of 183 rounds at Luxembourg. However, the V-3 was not very accurate. 142 rounds landed in Luxembourg, with 44 confirmed hits in the urban area, and the total casualties were 10 dead and 35 wounded. The bombardments ended with the American Army nearing Lampaden on February 22, 1945.     Altogether, of a pre-war population of 293,000, 5,259 Luxembourgers lost their lives during the hostilities.       After ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Luxembourg abandoned its politics of ": null
    },
    {
        "neutrality": "neutral country"
    },
    {
        ", when it became a founding member of the ": null
    },
    {
        "North Atlantic Treaty Organization": "nato"
    },
    {
        " and the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ". It is a signatory of the ": null
    },
    {
        "Treaty of Rome": "treaty of rome"
    },
    {
        ", and constituted a monetary union with Belgium , and an economic union with Belgium and the Netherlands, the so-called ": null
    },
    {
        "BeNeLux": "benelux"
    },
    {
        ".     Between 1945 and 2005, the economic structure of Luxembourg changed significantly. The crisis of the metallurgy sector, which began in the mid-1970s and lasted till the late 1980s, nearly pushed the country into economic recession, given the monolithic dominance of that sector. The Tripartite Coordination Committee, consisting of members of the government, management representatives, and trade union leaders, succeeded in preventing major social unrest during those years, thus creating the myth of a “Luxembourg model” characterised by social peace. Although in the early years of the 21st century Luxembourg enjoyed one of the highest GNP per capita in the world, this was mainly due to the strength of its financial sector, which gained importance at the end of the 1960s. Thirty-five years later, one-third of the tax proceeds originated from that sector. The harmonisation of the tax system across Europe could, however, seriously undermine the financial situation of the grand duchy.     Luxembourg has been one of the strongest advocates of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " in the tradition of ": null
    },
    {
        "Robert Schuman": "robert schuman"
    },
    {
        ". It was one of the six founding members of the European Coal and Steel Community in 1952 and of the ": null
    },
    {
        "European Economic Community": "european economic community"
    },
    {
        " in 1957; in 1999 it joined the ": null
    },
    {
        "euro": "euro"
    },
    {
        " currency area.     Encouraged by the contacts established with the Dutch and Belgian governments in exile, Luxembourg pursued a policy of presence in international organisations. In the context of the Cold War, Luxembourg clearly opted for the West having joined NATO in 1949. Engagement in European reconstruction was rarely questioned subsequently, either by politicians or by the greater population.     Despite its small proportions, Luxembourg often played an intermediary role between larger countries. This role of mediator, especially between the two large and often bellicose nations of Germany and France, was considered one of the main characteristics of its national identity, allowing the Luxembourgers not to have to choose between one of these two neighbours. The country also hosted a large number of European institutions such as the ": null
    },
    {
        "European Court of Justice": "european court of justice"
    },
    {
        ".     Luxembourg’s small size no longer seemed to be a challenge to the existence of the country, and the creation of the ": null
    },
    {
        "Banque Centrale du Luxembourg": "banque centrale du luxembourg"
    },
    {
        " and of the ": null
    },
    {
        "University of Luxembourg": "university of luxembourg"
    },
    {
        " was evidence of the continuing desire to become a “real” nation. The decision in 1985 to declare ": null
    },
    {
        "Lëtzebuergesch ": "luxembourgish language"
    },
    {
        " the national language was also a step in the affirmation of the country’s independence. In fact, the linguistic situation in Luxembourg was characterised by trilingualism: Lëtzebuergesch was the spoken vernacular language, German the written language, in which Luxembourgers were most fluent, and French the language of official letters and law.     In 1985, the country became victim to a mysterious bombing spree, which was targeted mostly at electrical masts and other installations.     In 1995, Luxembourg provided the president of the ": null
    },
    {
        "European Commission": "european commission"
    },
    {
        ", former Prime Minister ": null
    },
    {
        "Jacques Santer": "jacques santer"
    },
    {
        ", who later had to resign over corruption accusations against other commission members.     Prime Minister, ": null
    },
    {
        "Jean-Claude Juncker": "jean-claude juncker"
    },
    {
        ", followed this European tradition. On 10 September 2004, Mr Juncker became the semi-permanent president of the group of finance ministers from the 12 countries that share the euro, a role that led him to be dubbed Mr Euro .     The present sovereign is Grand Duke ": null
    },
    {
        "Henri": "henri, grand duke of luxembourg"
    },
    {
        ". Henris father, ": null
    },
    {
        "Jean": "jean, grand duke of luxembourg"
    },
    {
        ", succeeded his mother, Charlotte, on 12 November 1964. Jeans eldest son, Prince Henri, was appointed Lieutenant Représentant on 4 March 1998. On 24 December 1999, Prime Minister Juncker announced Grand Duke Jeans decision to abdicate the throne on 7 October 2000, in favour of Prince Henri who assumed the title and constitutional duties of Grand Duke.     On July 10, 2005, after threats of resignation by Prime Minister Juncker, the proposed ": null
    },
    {
        "European Constitution": "european constitution"
    }
]