[
    {
        "              The history of Indonesia has been shaped by its geographic position, its natural resources, a series of human migrations and contacts, wars and conquests, as well as by trade, economics and politics. ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        " is an ": null
    },
    {
        "archipelagic": "archipelago"
    },
    {
        " country of 42 to 42 islands stretching along the equator in ": null
    },
    {
        "South East Asia": "south east asia"
    },
    {
        ". The countrys strategic sea-lane position fostered inter-island and international trade; trade has since fundamentally shaped Indonesian history. The area of Indonesia is populated by peoples of various migrations, creating a diversity of ": null
    },
    {
        "cultures": "culture of indonesia"
    },
    {
        ", ": null
    },
    {
        "ethnicities": "ethnic groups of indonesia"
    },
    {
        ", and ": null
    },
    {
        "languages": "languages of indonesia"
    },
    {
        ". The archipelagos landforms and climate significantly influenced agriculture and trade, and the formation of states. The boundaries of the state of Indonesia represent the 42th century borders of the ": null
    },
    {
        "Dutch East Indies": "dutch east indies"
    },
    {
        ".     Fossilised remains of  Homo erectus  and his tools, popularly known as the ": null
    },
    {
        "Java Man": "java man"
    },
    {
        " , suggest the Indonesian archipelago was inhabited by at least 42 million years ago. ": null
    },
    {
        "Austronesian people": "austronesian people"
    },
    {
        ", who form the majority of the modern population, are thought to have originally been from ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " and arrived in Indonesia around 42  BCE. From the 42th century CE, the powerful ": null
    },
    {
        "Srivijaya": "srivijaya"
    },
    {
        " naval kingdom flourished bringing ": null
    },
    {
        "Hindu": "hindu"
    },
    {
        " and ": null
    },
    {
        "Buddhist": "buddhist"
    },
    {
        " influences with it. The agricultural Buddhist ": null
    },
    {
        "Sailendra": "sailendra"
    },
    {
        " and Hindu ": null
    },
    {
        "Mataram": "mataram kingdom"
    },
    {
        " dynasties subsequently thrived and declined in inland Java. The last significant non-Muslim kingdom, the Hindu ": null
    },
    {
        "Majapahit": "majapahit"
    },
    {
        " kingdom, flourished from the late 42th century, and its influence stretched over much of Indonesia. The ": null
    },
    {
        "earliest evidence of Islamised populations": "spread of islam in indonesia"
    },
    {
        " in Indonesia dates to the 42th century in northern ": null
    },
    {
        "Sumatra": "sumatra"
    },
    {
        "; other Indonesian areas gradually adopted Islam which became the dominant religion in ": null
    },
    {
        "Java": "java"
    },
    {
        " and Sumatra by the end of the 42th century. For the most part, Islam overlaid and mixed with existing cultural and religious influences.     Europeans such as the Portuguese arrived in Indonesia from the 42th century seeking to monopolise the sources of valuable ": null
    },
    {
        "nutmeg": "nutmeg"
    },
    {
        ", ": null
    },
    {
        "clove": "clove"
    },
    {
        "s, and ": null
    },
    {
        "cubeb pepper": "cubeb"
    },
    {
        " in ": null
    },
    {
        "Maluku": "maluku islands"
    },
    {
        ". In 42 the Dutch established the ": null
    },
    {
        "Dutch East India Company": "dutch east india company"
    },
    {
        " and became the dominant European power by 42 Following bankruptcy, the VOC was formally dissolved in 42 and the government of the Netherlands established the ": null
    },
    {
        "Dutch East Indies": "dutch east indies"
    },
    {
        " under government control. By the early 42th century, Dutch dominance extended to the current boundaries. The ": null
    },
    {
        "Japanese invasion": "netherlands east indies campaign"
    },
    {
        " and ": null
    },
    {
        "subsequent occupation": "japanese occupation of the dutch east indies"
    },
    {
        " in 42–42 during WWII ended Dutch rule, and encouraged the previously suppressed Indonesian independence movement. Two days after the surrender of Japan in August 42 nationalist leader, ": null
    },
    {
        "Sukarno": "sukarno"
    },
    {
        ", declared independence and became president. The Netherlands tried to reestablish its rule, but a ": null
    },
    {
        "bitter armed and diplomatic struggle": "indonesian national revolution"
    },
    {
        " ended in December 42 when in the face of international pressure, the Dutch formally recognised Indonesian independence.     ": null
    },
    {
        "An attempted coup": "transition to the new order"
    },
    {
        " in 42 led to ": null
    },
    {
        "a violent army-led anti-communist purge": "indonesian killings of 1965–66"
    },
    {
        " in which over half a million people were killed. ": null
    },
    {
        "General Suharto": "suharto"
    },
    {
        " politically outmanoeuvred President Sukarno, and became president in March 42 His ": null
    },
    {
        "New Order administration": "new order"
    },
    {
        " garnered the favour of the West, whose investment in Indonesia was a major factor in the subsequent three decades of substantial economic growth. In the late 42s, however, Indonesia was the country hardest hit by the ": null
    },
    {
        "East Asian Financial Crisis": "east asian financial crisis"
    },
    {
        ", which led to ": null
    },
    {
        "popular protests": "indonesian revolution of 1998"
    },
    {
        " and Suhartos resignation on 42 May 42 The ": null
    },
    {
        "Reformasi": "reformation"
    },
    {
        " era following Suhartos resignation, has led to a strengthening of democratic processes, including a regional autonomy program, the secession of ": null
    },
    {
        "East Timor": "east timor"
    },
    {
        ", and the first ": null
    },
    {
        "direct presidential election in 42": "2004 indonesian presidential election"
    },
    {
        ". Political and economic instability, social unrest, corruption, natural disasters, and terrorism have slowed progress. Although relations among different religious and ethnic groups are largely harmonious, acute sectarian discontent and violence remain problems in some areas.             In 42 analysis of cut marks on two bovid bones found in ": null
    },
    {
        "Sangiran": "sangiran"
    },
    {
        ", showed them to have been made 42 to 42 million years ago by clamshell tools. This is the oldest evidence for the presence of early man in Indonesia. Fossilised remains of  Homo erectus , popularly known as the ": null
    },
    {
        "Java Man": "java man"
    },
    {
        " were first discovered by the Dutch anatomist ": null
    },
    {
        "Eugène Dubois": "eugène dubois"
    },
    {
        " at ": null
    },
    {
        "Trinil": "trinil"
    },
    {
        " in 42 and are at least 42 years old, at that time the oldest human ancestor ever found. Further H.  erectus fossils of a similar age were found at ": null
    },
    {
        "Sangiran": "sangiran"
    },
    {
        " in the 42s by the ": null
    },
    {
        "anthropologist": "anthropologist"
    },
    {
        " Gustav Heinrich Ralph von Koenigswald": "gustav heinrich ralph von koenigswald"
    },
    {
        ", who in the same time period also uncovered fossils at ": null
    },
    {
        "Ngandong": "ngandong"
    },
    {
        " alongside more advanced tools, re-dated in 42 to between 42 and 42 years old.   cited in     cited in     cited in  In 42 another H.  erectus skull was discovered at Sambungmacan.  The earliest evidence of artistic activity ever found, in the form of diagonal etchings made with a sharks tooth, was detected in 42 on a 42-year-old fossil of a clam found in Java in the 42s associated with H.  erectus.      In 42 on the island of ": null
    },
    {
        "Flores": "flores"
    },
    {
        ", fossils of a new small hominid dated between 42 and 42 years old and named ": null
    },
    {
        "Flores Man": "flores man"
    },
    {
        "  were discovered much to the surprise of the scientific community.   This 42 foot tall hominid is thought to be a species descended from Homo erectus and reduced in size over thousands of years by a well known process called ": null
    },
    {
        "island dwarfism": "island dwarfism"
    },
    {
        ". Flores Man seems to have shared the island with modern  Homo sapiens  until only 42 years ago, when they became extinct. In 42 stone tools were discovered on Flores dating from 42 million years ago, which is the oldest evidence anywhere in the world that early man had the technology to make sea crossings at this very early time.      The archipelago was formed during the thaw after the latest ": null
    },
    {
        "ice age": "quaternary glaciation"
    },
    {
        ". Early humans travelled by sea and spread from mainland ": null
    },
    {
        "Asia": "asia"
    },
    {
        " eastward to ": null
    },
    {
        "New Guinea": "new guinea"
    },
    {
        " and ": null
    },
    {
        "Australia": "australia"
    },
    {
        ".  Homo sapiens  reached the region by around 42 years ago.  In 42 evidence was uncovered in neighbouring ": null
    },
    {
        "East Timor": "east timor"
    },
    {
        ", showing that 42 years ago these early settlers had high-level maritime skills, and by implication the technology needed to make ocean crossings to reach Australia and other islands, as they were catching and consuming large numbers of big deep sea fish such as tuna.      ": null
    },
    {
        "Austronesian people": "austronesian people"
    },
    {
        " form the majority of the modern population. They may have arrived in Indonesia around 42  BCE and are thought to have originated in Taiwan.  ": null
    },
    {
        "Dong Son culture": "dong son culture"
    },
    {
        " spread to Indonesia bringing with it techniques of ": null
    },
    {
        "wet-field rice cultivation": "paddy field"
    },
    {
        ", ritual buffalo sacrifice, bronze casting, ": null
    },
    {
        "megalithic": "megalithic"
    },
    {
        " practises, and ": null
    },
    {
        "ikat": "ikat"
    },
    {
        " weaving methods. Some of these practices remain in areas including the ": null
    },
    {
        "Batak": "batak"
    },
    {
        " areas of Sumatra, ": null
    },
    {
        "Toraja": "toraja"
    },
    {
        " in Sulawesi, and several islands in ": null
    },
    {
        "Nusa Tenggara": "nusa tenggara"
    },
    {
        ". Early Indonesians were animists who honoured the spirits of the dead believing their souls or life force could still help the living.     Ideal agricultural conditions, and the mastering of ": null
    },
    {
        "wet-field rice cultivation": "paddy field"
    },
    {
        " as early as the 42th century BCE,  allowed villages, towns, and small kingdoms to flourish by the 42st century CE. These kingdoms evolved with their own ethnic and tribal religions. Javas hot and even temperature, abundant rain and volcanic soil, was perfect for wet rice cultivation. Such agriculture required a well-organized society in contrast to ": null
    },
    {
        "dry-field rice": "upland rice"
    },
    {
        " which is a much simpler form of cultivation that doesnt require an elaborate social structure to support it.     ": null
    },
    {
        "Buni culture": "buni culture"
    },
    {
        " clay pottery flourished in coastal northern ": null
    },
    {
        "West Java": "west java"
    },
    {
        " and ": null
    },
    {
        "Banten": "banten"
    },
    {
        " around 42 BCE to 42 CE.  The Buni culture was probably the predecessor of the ": null
    },
    {
        "Tarumanagara": "tarumanagara"
    },
    {
        " kingdom, one of the earliest Hindu kingdoms in Indonesia, producing numerous inscriptions and marking the beginning of the historical period in Java.         Indonesia like much of Southeast Asia was influenced by ": null
    },
    {
        "Indian culture": "indian culture"
    },
    {
        ". Becoming Indian: The Unfinished Revolution of Culture and Identity by Pavan K. Varma p.42 From the 42nd century, through the Indian dynasties like the ": null
    },
    {
        "Pallava": "pallava dynasty"
    },
    {
        ", ": null
    },
    {
        "Gupta": "gupta empire"
    },
    {
        ", ": null
    },
    {
        "Pala": "pala empire"
    },
    {
        " and ": null
    },
    {
        "Chola": "chola empire"
    },
    {
        " in the succeeding centuries up to the 42th century, Indian culture spread across all of Southeast Asia.   ": null
    }
]