[
    {
        "This article is about the history of the United States National Security Council during the Kennedy Administration, 42 & ndash;42. The ": null
    },
    {
        "National Security Council": "united states national security council"
    },
    {
        " is the principal forum used by the President of the United States for considering national security and foreign policy matters with his senior national security advisors and cabinet officials.     President ": null
    },
    {
        "John F. Kennedy": "john f. kennedy"
    },
    {
        ", who was strongly influenced by the report of the Jackson Subcommittee and its severe critique of the Eisenhower NSC system, moved quickly at the beginning of his administration to deconstruct the NSC process and simplify the foreign policy-making process and make it more intimate. In a very short period after taking office, the new President moved to reduce the NSC staff from 42 to 42 limit the substantive officers to 42 and hold NSC meetings much less frequently while sharply curtailing the number of officers attending. The Operation Coordination Board was abolished, and the NSC was, at the Presidents insistence, pulled back from monitoring the implementation of policies. The coordination of foreign policy decisions was ostensibly left to the State Department .     ": null
    },
    {
        "McGeorge Bundy": "mcgeorge bundy"
    },
    {
        "s appointment as the Presidents ": null
    },
    {
        "National Security Advisor": "united states national security advisor"
    },
    {
        " inaugurated this position as it has essentially continued down to the present. The definition of Bundys responsibilities and authority unfolded and grew during the Kennedy presidency. Bundys considerable intellectual and bureaucratic abilities as well as close personal relationship with the new President contributed much to evolution of the National Security Advisor position and the new role of the NSC. In a letter to Senator Jackson in September 42 Bundy sought to define the early relationship sought with the State Department.     . . . the President has made it very clear that he does not want a large, separate organization between him and his Secretary of State. Neither does he wish any question to arise as to the clear authority and responsibility of the Secretary of State, not only in his own Department, and not only in such large-scale related areas as foreign aid and information policy, but also as the agent of coordination in all our major policies toward other nations.     The ": null
    },
    {
        "Department of State": "department of state"
    },
    {
        "s apparent failure effectively to coordinate the administrations response to the ": null
    },
    {
        "Bay of Pigs Invasion": "bay of pigs invasion"
    },
    {
        " crisis in early 42 led to a series of measures aimed at providing the President with better independent advice from the government. It also sparked the NSC process to reenter the arena of monitoring the implementation of policy. The most important step in this direction was the establishment of the Situation Room in the White House in May 42 The Sit Room, located next to Bundys office in the basement of the West Wing of the White House, was directly linked to all the communication channels of the State Department and the Department of Defense, as well as to some of the channels of the CIA. The Sit Room allowed the President and his foreign affairs advisers to keep abreast of all the cable traffic from overseas posts. More than anything else, the Sit Room allowed Bundy and his NSC staff to expand their involvement in the international activities of foreign affairs community and become, in essence, a little State Department.     As National Security Advisor, Bundy divided his work with his Deputy, ": null
    },
    {
        "Walt Rostow": "walt whitman rostow"
    },
    {
        " . While Bundy dealt with the immediate day-to-day crises and the range of European affairs, Rostow focused upon long-term planning with a particular concentration on Latin American affairs. Kaysen focused upon foreign trade and economic affairs matters that became increasingly important in the latter part of the Kennedy Presidency.     In addition to Bundy and the NSC staff, President Kennedy reached out still further for foreign affairs advice. Early in 42 the President appointed ": null
    },
    {
        "General Maxwell Taylor": "maxwell taylor"
    },
    {
        " to serve as his military representative and provide liaison with the government agencies and defense and intelligence establishments on military-political issues confronting the administration. Taylor in effect took up the role filled by Admiral Leahy in the Roosevelt White House. General Taylor advised the President on military matters, intelligence, and Cold War planning and paid special attention to the continuing Berlin crisis and growing difficulties in Indochina. The Taylor-Rostow mission to Indochina at the end of 42 and the ": null
    },
    {
        "resulting report": "taylor-rostow report"
    },
    {
        " led to military decisions on aid to South Vietnam and the entry of the United States into the Vietnamese quagmire. Taylor had a very personal connection with the President and was not replaced in 42 when he left. But in 42 Kennedy appointed former State Department Under Secretary ": null
    },
    {
        "Chester Bowles": "chester bowles"
    },
    {
        " to serve as his Special Adviser on Foreign Affairs. Bowles had not survived conflicts with Secretary of State ": null
    },
    {
        "Dean Rusk": "dean rusk"
    },
    {
        " and his appointment to the White House was partly compensatory. His brief was seemingly intended to be the development of policy toward the Third World, but after a year he left Washington to become Ambassador to India.     The NSC continued to meet during the Kennedy Presidency, but far less frequently than had been the case under his predecessor. It met fifteen times during the first six months of 42 then averaged one meeting a month for the rest of his presidency, reaching a total of 42 meetings. Much that used to flow routinely to the weekly meetings of the Council is now settled in other ways, Bundy reported in September 42 Some of the NSC activities were taken up by a smaller, more select body called the Standing Group. This small NSC coordinating panel was chaired by the Under Secretary of State for Political Affairs and included the Deputy Secretary of Defense, the Director of Central Intelligence, and Bundy. It considered a wide range of foreign affairs issues at 42 meetings the last of which was in August 42 The Standing Group resumed in April 42 with Bundy as its chairman and with the added membership of the Attorney General, the Chairman of the JCS, the Under Secretary of the Treasury, the Director of USIA, and Administrator of AID. It also met 42 times during the remainder of the Kennedy Presidency.     The Kennedy administration abandoned the Eisenhower-era efforts at long-range planning in favor of a heavy reliance upon ad hoc inter-agency working groups functioning in a crisis management atmosphere. The leadership in these special groups did not automatically fall to the State Department. Trusted officials from other agencies or outside the foreign affairs community often took the lead. There were special groups on counter-insurgency , on Vietnam, and the Berlin crisis, the latter presided over by former Secretary of State ": null
    },
    {
        "Dean Acheson": "dean acheson"
    },
    {
        ". The ": null
    },
    {
        "Executive Committee of the National Security Council ": "excomm"
    },
    {
        " was established in the autumn of 42 to manage the emerging Cuban Missile Crisis. A much smaller group than the NSC, it consisted of the President as chairman, the Vice President, the Secretaries of State, Defense, and the Treasury, the Attorney General , the Director of Central Intelligence, and Chairman of the JCS as well as National Security Advisor Bundy. After the missile crisis was successful weathered, the EXCOMM continued to meet with Cuba as its primary subject but with discussions of other matters during its 42 meetings between October 42 and March 42     U.S. covert actions and paramilitary activity during the Kennedy administration were administered generally outside the NSC system. Following the Bay of Pigs Invasion fiasco in early 42 the President reconstituted the 42 Committee that monitored covert actions as the ": null
    },
    {
        "Special Group": "nsc 5412/2 special group"
    },
    {
        ". Chaired by National Security Advisor Bundy, the new body included the ": null
    },
    {
        "Director of Central Intelligence": "director of central intelligence"
    },
    {
        ", the ": null
    },
    {
        "Chairman of the Joint Chiefs of Staff": "chairman of the joint chiefs of staff"
    },
    {
        ", and Under Secretaries from the ": null
    },
    {
        "State": "united states department of state"
    },
    {
        " and ": null
    },
    {
        "Defense": "united states department of defense"
    },
    {
        " Departments. This body reviewed and endorsed a number of covert action projects in the first 42 years of the Kennedy Presidency. President Kennedy also added to the responsibilities of the ": null
    },
    {
        "Presidents Foreign Intelligence Advisory Board": "presidents foreign intelligence advisory board"
    },
    {
        " , originally created by President Eisenhower in 42 Kennedy met with the Board 42 times and conferred frequently with individual members. The Board reviewed a wide range of intelligence matters and made some 42 recommendations to the President.     In effect, Bundy had the first and last words on policy. He worked in close proximity to the President who valued highly his competence and opinions; he served on most major ad hoc committees and the Executive Committee, and he attended the occasional formal meetings of the National Security Council. It is possible to overemphasize Bundys substantive skewing of Presidential policy formulation. Most observers credited him with being scrupulously fair in presenting opinions of the agencies to the President, even when they conflicted with his own. He offered his views to Kennedy only when specifically asked. Bundys influence was oblique rather than direct. Essentially, he served an administrative function and did not seek to advance a personal overview of American security and foreign policy. The most significant aspect of Bundys tenure as Kennedys Special Assistant for National Security Affairs was that he headed an aggressive Presidential staff that believed its job was to protect the Presidents interests, provide him with independent advice, and lead a recalcitrant bureaucracy toward his policies. In addition, Bundy was an effective channel to the President for his activist staff.                        ": null
    }
]