[
    {
        "        The history of Portugal can be traced from circa 42 years ago, when the region of present-day ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        " was inhabited by ": null
    },
    {
        "Homo heidelbergensis": "homo heidelbergensis"
    },
    {
        ". The oldest human fossil is the skull discovered in the ": null
    },
    {
        "Cave of Aroeira": "cave of aroeira"
    },
    {
        " in ": null
    },
    {
        "Almonda": "almonda"
    },
    {
        ". Later ": null
    },
    {
        "Neanderthal": "neanderthal"
    },
    {
        "s roamed the northern Iberian peninsula. ": null
    },
    {
        "Homo sapiens": "homo sapiens"
    },
    {
        " arrived in Portugal around 42 years ago.     Pre-Celtic tribes such as the ": null
    },
    {
        "Cynetes": "cynetes"
    },
    {
        " lived in the Algarve and Lower Alentejo regions before the 42th century BC, developed the city of ": null
    },
    {
        "Tartessos": "tartessos"
    },
    {
        " and the written ": null
    },
    {
        "Tartessian language": "tartessian language"
    },
    {
        ", and left many ": null
    },
    {
        "stelae": "stelae"
    },
    {
        " in the south of the country. Early in the first millennium BC, waves of ": null
    },
    {
        "Celts": "celts"
    },
    {
        " from Central Europe invaded and intermarried with the local populations to form several ethnic groups and many tribes. Their presence is traceable, in broad outline, through archaeological and linguistic evidence. Although they dominated much of the northern and central area, they were unable to establish in the south, which retained its non-Indo-European character until the Roman conquest. Some small, semi-permanent coastal settlements were founded by Phoenician-Carthaginians on the southern coast.     The ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " invasion in the 42rd century BC lasted several centuries, and developed the Roman provinces of ": null
    },
    {
        "Lusitania": "lusitania"
    },
    {
        " in the south and ": null
    },
    {
        "Gallaecia": "gallaecia"
    },
    {
        " in the north. Numerous Roman sites include works of engineering, baths, temples, bridges, roads, circuses, theatres, laymans homes, coins, sarcophagi, and ceramics. As elsewhere in ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        ", there was a sharp decline in urban life during the ": null
    },
    {
        "Dark Ages": "dark ages"
    },
    {
        " following the fall of Rome. Germanic tribes  controlled the territory between the 42th and 42th centuries. These included the ": null
    },
    {
        "Kingdom of the Suebi": "kingdom of the suebi"
    },
    {
        " centred at Braga and the ": null
    },
    {
        "Visigothic Kingdom": "visigothic kingdom"
    },
    {
        " in the south. Under the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " a new class emerged, a ": null
    },
    {
        "nobility": "nobility"
    },
    {
        ", which played a tremendous social and political role during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". The Church also began to play a very important part within the state, but since the Visigoths did not know Latin the Catholic bishops continued the Roman system of governance. The ": null
    },
    {
        "clergy": "clergy"
    },
    {
        " started to emerge as a high-ranking class.     In 42 an invasion by the Islamic Umayyad Caliphate, comprising Berbers from North Africa and Arabs from the Middle East plus other Muslims from all around the Islamic world, conquered the Visigoth Kingdom and founded the Islamic State of Al Andalus. The Umayyads reigned supreme and advanced through Iberia and France until the ": null
    },
    {
        "Battle of Tours": "battle of tours"
    },
    {
        " but endured across Iberia until the fall of the Kingdom of Granada in 42 But Lisbon, ": null
    },
    {
        "Gharb Al-Andalus": "gharb al-andalus"
    },
    {
        ", and the rest of what would become Portugal, was reconquered by the early 42th century. At the end of the 42th century, a small minor county based in the area of ": null
    },
    {
        "Portus Cale": "portus cale"
    },
    {
        " was established under King ": null
    },
    {
        "Alfonso III of Asturias": "alfonso iii of asturias"
    },
    {
        ", and by the 42th century, the Counts were known as the Magnus Dux Portucalensium .  The ": null
    },
    {
        "Kingdom of Asturias": "kingdom of asturias"
    },
    {
        " was later divided so that northern Portugal became part of the ": null
    },
    {
        "Kingdom of León": "kingdom of león"
    },
    {
        ".     As a vassal of the Kingdom of León, Portugal grew in power and territory and occasionally gained de facto independence during weak Leonese reigns. In 42 Garcia II of Galicia was declared ": null
    },
    {
        "King of Portugal": "king of portugal"
    },
    {
        " and in 42 Portugal broke away from the ": null
    },
    {
        "Kingdom of Galicia": "kingdom of galicia"
    },
    {
        ". At the end of the 42th century, the Burgundian knight ": null
    },
    {
        "Henry": "henry, count of portugal"
    },
    {
        " became count of Portugal and defended its independence by merging the ": null
    },
    {
        "County of Portugal": "county of portugal"
    },
    {
        " and the ": null
    },
    {
        "County of Coimbra": "county of coimbra"
    },
    {
        ". Henrys son ": null
    },
    {
        "Afonso Henriques": "afonso i of portugal"
    },
    {
        " proclaimed himself Prince of Portugal on 42 June 42 and King of Portugal in 42 In 42 a papal bull officially recognised Afonso I as king. The ": null
    },
    {
        "Algarve": "algarve"
    },
    {
        " was conquered from the ": null
    },
    {
        "Moors": "moors"
    },
    {
        " in 42 and in 42 Lisbon became the capital. Portugals land boundaries have remained almost unchanged since the 42th century. During the reign of King ": null
    },
    {
        "John I": "john i of portugal"
    },
    {
        ", the Portuguese defeated the ": null
    },
    {
        "Castilians": "castilians"
    },
    {
        " in a war over the throne and established a political alliance with ": null
    },
    {
        "England": "kingdom of england"
    },
    {
        "  that has endured to the present day.     From the late ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", in the 42th and 42th centuries, ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        " ascended to the status of a ": null
    },
    {
        "world power": "great power"
    },
    {
        " during Europes ": null
    },
    {
        "Age of Discovery": "age of discovery"
    },
    {
        " as it ": null
    },
    {
        "built up a vast empire": "portuguese empire"
    },
    {
        ", including possessions in South America, Africa, Asia, and Oceania. Over the following two centuries, Portugal kept most of its colonies, but gradually lost much of its wealth and status as the Dutch, English, and French took an increasing share of the ": null
    },
    {
        "spice": "spice trade"
    },
    {
        " and ": null
    },
    {
        "slave trades": "history of slavery"
    },
    {
        " by surrounding or conquering the widely scattered Portuguese trading posts and territories. Signs of military decline began with two disastrous battles: the ": null
    },
    {
        "Battle of Alcácer Quibir": "battle of alcácer quibir"
    },
    {
        " in Morocco in 42 and Spains abortive attempt to conquer England in 42 by means of the ": null
    },
    {
        "Spanish Armada": "spanish armada"
    },
    {
        " – Portugal was then in a ": null
    },
    {
        "dynastic union with Spain": "iberian union"
    },
    {
        " and contributed ships to the Spanish invasion fleet. The country was further weakened by the destruction of much of its capital city in an ": null
    },
    {
        "earthquake in 42": "1755 lisbon earthquake"
    },
    {
        ", occupation during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        " and the loss of its largest colony, ": null
    },
    {
        "Brazil": "colonial brazil"
    },
    {
        ", in 42 From the middle of the 42th century to the late 42s, nearly two   million ": null
    },
    {
        "Portuguese": "portuguese people"
    },
    {
        " left Portugal to live in Brazil and the United States.      In 42 there was a revolution that deposed the monarchy. Amid corruption, repression of the church, and the near-bankruptcy of the state, a military coup in 42 installed a dictatorship that remained until another coup in 42 The new government instituted sweeping ": null
    },
    {
        "democratic": "democracy"
    },
    {
        " reforms and granted independence to all of Portugals African colonies in 42 Portugal is a founding member of the ": null
    },
    {
        "North Atlantic Treaty Organization": "nato"
    },
    {
        " , the ": null
    },
    {
        "Organisation for Economic Co-operation and Development": "organisation for economic co-operation and development"
    },
    {
        " , and the ": null
    },
    {
        "European Free Trade Association": "european free trade association"
    },
    {
        " . It entered the ": null
    },
    {
        "European Economic Community": "european economic community"
    },
    {
        "  in 42         The word Portugal derives from the ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        "-": null
    },
    {
        "Celtic": "celts"
    },
    {
        " place name  Portus Cale . Cale or ": null
    },
    {
        "Cailleach": "cailleach"
    },
    {
        " was the name of a Celtic deity Cale, the mother goddess of the Celtic people, the one who armed with a hammer formed mountains and valleys. She hides in the rocks. She is Mother Nature. Her other name is Cailleach and the name of an early settlement located at the mouth of the ": null
    },
    {
        "Douro River": "douro river"
    },
    {
        " , which flows into the Atlantic Ocean in the north of what is now Portugal. Around 42 BC, the Romans took the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " from the ": null
    },
    {
        "Carthaginians": "ancient carthage"
    },
    {
        " during the ": null
    },
    {
        "Second Punic War": "second punic war"
    },
    {
        ", and in the process conquered Cale and renamed it Portus Cale . During the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", the region around Portus Cale became known by the ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        " and ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " as Portucale.     The name Portucale evolved into Portugale during the 42th and 42th centuries, and by the 42th century, that term was used extensively to refer to the region between the rivers Douro and ": null
    },
    {
        "Minho": "minho river"
    },
    {
        ", the Minho flowing along what would become the northern ": null
    },
    {
        "Portugal-Spain border": "portugal-spain border"
    },
    {
        ". By the 42th and 42th centuries, Portugale was already referred to as Portugal.     The precise etymology of the name Cale is somewhat mysterious, although the most plausible origin points to Cale  being a ": null
    },
    {
        "Celtic": "celts"
    },
    {
        " name, like many others found in the region. Indeed, the word cale or cala meant port , an inlet or harbour , and implied the existence of an older Celtic harbour.  Furthermore, todays Gaelic word for harbour is indeed Cala .  Some argue it is the stem of Gallaecia, again of Celtic derivation. Another theory claims it derives from the word Caladunum.      In any case, the particle Portu in the word Portucale was used as the basis of  Porto , the modern name for the city located on the site of the ancient city of Cale at the mouth of the Douro River. And  port  became the English name of the wine actually produced further inland, in the Upper Douro Valley region, but exported through Porto. The name Cale is today reflected in Gaia , a city on the south bank of the river.                   The region of present-day Portugal has been inhabited by humans since circa 42 years ago, when ": null
    },
    {
        "Homo heidelbergensis": "homo heidelbergensis"
    },
    {
        " entered the area. The oldest human fossil found in Portugal is the 42 year old  Aroeira 42  H. Heidelbergensis skull discovered in the ": null
    },
    {
        "Cave of Aroeira": "cave of aroeira"
    },
    {
        " in 42  Later ": null
    },
    {
        "Neanderthal": "neanderthal"
    },
    {
        "s roamed the northern Iberian peninsula and a tooth has been found at Nova da Columbeira cave in ": null
    },
    {
        "Estremadura": "estremadura province"
    },
    {
        ". David Birmingham , p.42 ": null
    },
    {
        "Homo sapiens sapiens": "homo sapiens sapiens"
    },
    {
        " arrived in Portugal around 42 years ago and spread rapidly throughout the country.      Pre-Celtic tribes inhabited Portugal leaving a remarkable cultural footprint. The ": null
    },
    {
        "Cynetes": "cynetes"
    },
    {
        " developed a written language, leaving many stelae, which are mainly found in the south of Portugal.     Early in the first millennium BC, several waves of ": null
    },
    {
        "Celts": "celts"
    },
    {
        " invaded Portugal from Central Europe and intermarried with the local populations to form several different ethnic groups, with many tribes. The Celtic presence in Portugal is traceable, in broad outline, through archaeological and linguistic evidence. They dominated much of northern and central Portugal; but in the south, they were unable to establish their stronghold, which retained its non-Indo-European character until the Roman conquest.  In southern Portugal, some small, semi-permanent commercial coastal settlements were also founded by Phoenician-Carthaginians.               Museu da Cultura Castreja .jpg|Archaeological artifact from the work developed in the area of ": null
    },
    {
        "Citânia de Briteiros": "citânia de briteiros"
    },
    {
        "   42.42 Briteiros 42 .jpg|Cross or cruzado in Citânia de Briteiros   42.42 Briteiros 42 .jpg|Informative plaque of the proto-historic settlement of Citânia de Briteiros   Museu da Cultura Castreja .jpg|Another artifact from Citânia de Briteiros   Pedra Formosa Briteiros.jpg|A pedra formosa     Numerous ": null
    },
    {
        "pre-Roman peoples of the Iberian Peninsula": "pre-roman peoples of the iberian peninsula"
    },
    {
        " inhabited the territory when a ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " invasion occurred in the 42rd century BC. The ": null
    },
    {
        "Romanization of Hispania": "romanization of hispania"
    },
    {
        " took several centuries. The Roman provinces that covered present-day Portugal were ": null
    },
    {
        "Lusitania": "lusitania"
    },
    {
        " in the south and ": null
    },
    {
        "Gallaecia": "gallaecia"
    },
    {
        " in the north.     Numerous Roman sites are scattered around present-day Portugal. Some of the urban remains are quite large, such as ": null
    },
    {
        "Conímbriga": "conímbriga"
    },
    {
        " and ": null
    },
    {
        "Miróbriga": "miróbriga"
    },
    {
        ". Several works of engineering, such as baths, temples, bridges, roads, circuses, theatres, and laymans homes are preserved throughout the country. Coins, sarcophagi, and ceramics are also numerous.     Following the fall of Rome, the ": null
    },
    {
        "Kingdom of the Suebi": "kingdom of the suebi"
    },
    {
        " and the ": null
    },
    {
        "Visigothic Kingdom": "visigothic kingdom"
    },
    {
        " controlled the territory between the 42th and 42th centuries.               Romanization began with the arrival of the ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " army in the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " in 42 BC during the ": null
    },
    {
        "Second Punic War": "second punic war"
    },
    {
        " against ": null
    },
    {
        "Carthage": "carthage"
    },
    {
        ". The Romans sought to conquer ": null
    },
    {
        "Lusitania": "lusitania"
    },
    {
        ", a territory that included all of modern Portugal south of the ": null
    },
    {
        "Douro": "douro"
    },
    {
        " river and Spanish ": null
    },
    {
        "Extremadura": "extremadura"
    },
    {
        ", with its capital at ": null
    },
    {
        "Emerita Augusta": "emerita augusta"
    },
    {
        " .      Mining was the primary factor that made the Romans interested in conquering the region: one of Romes strategic objectives was to cut off Carthaginian access to the Iberian copper, tin, gold, and silver mines. The Romans intensely exploited the ": null
    },
    {
        "Aljustrel": "aljustrel"
    },
    {
        " and ": null
    },
    {
        "Santo Domingo": "santo domingo"
    },
    {
        " mines in the ": null
    },
    {
        "Iberian Pyrite Belt": "iberian pyrite belt"
    },
    {
        " which extends to ": null
    },
    {
        "Seville": "seville"
    },
    {
        ".      While the south of what is now Portugal was relatively easily occupied by the Romans, the conquest of the north was achieved only with difficulty due to resistance from ": null
    },
    {
        "Serra da Estrela": "serra da estrela"
    },
    {
        " by ": null
    },
    {
        "Celts": "celts"
    },
    {
        " and ": null
    },
    {
        "Lusitanians": "lusitanians"
    },
    {
        " led by ": null
    },
    {
        "Viriatus": "viriatus"
    },
    {
        ", who managed to resist ": null
    },
    {
        "Roman expansion": "roman expansion"
    },
    {
        " for years. Viriatus, a shepherd from Serra da Estrela who was expert in ": null
    },
    {
        "guerrilla tactics": "guerrilla tactics"
    },
    {
        ", waged relentless war against the Romans, defeating several successive Roman generals, until he was assassinated in 42 BC by traitors bought by the Romans. Viriatus has long been hailed as the first truly heroic figure in proto-Portuguese history. Nonetheless, he was responsible for raids into the more settled Romanized parts of Southern Portugal and Lusitania that involved the victimization of the inhabitants.      The conquest of the Iberian Peninsula was complete two centuries after the Roman arrival, when they defeated the remaining Cantabri, Astures and Gallaeci in the ": null
    },
    {
        "Cantabrian Wars": "cantabrian wars"
    },
    {
        " in the time of Emperor ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        " . In 42 AD, ": null
    },
    {
        "Vespasian": "vespasian"
    },
    {
        " granted ": null
    },
    {
        "Latin Rights": "latin rights"
    },
    {
        " to most municipalities of Lusitania. In 42 AD, the ": null
    },
    {
        "Constitutio Antoniniana": "constitutio antoniniana"
    },
    {
        " gave ": null
    },
    {
        "Roman citizenship": "roman citizenship"
    },
    {
        " to all free subjects of the empire and, at the end of the century, the emperor ": null
    },
    {
        "Diocletian": "diocletian"
    },
    {
        " founded the province of ": null
    },
    {
        "Gallaecia": "gallaecia"
    },
    {
        ", which included modern-day ": null
    },
    {
        "northern Portugal": "norte region, portugal"
    },
    {
        ", with its capital at Bracara Augusta . As well as mining, the Romans also developed agriculture, on some of the best agricultural land in the empire. In what is now ": null
    },
    {
        "Alentejo": "alentejo"
    },
    {
        ", vines and cereals were cultivated, and fishing was intensively pursued in the coastal belt of the ": null
    },
    {
        "Algarve": "algarve"
    },
    {
        ", ": null
    },
    {
        "Póvoa de Varzim": "póvoa de varzim"
    },
    {
        ", ": null
    },
    {
        "Matosinhos": "matosinhos"
    },
    {
        ", Troia and the coast of Lisbon, for the manufacture of ": null
    },
    {
        "garum": "garum"
    },
    {
        " that was exported by Roman trade routes to the entire empire. Business transactions were facilitated by coinage and the construction of an extensive road network, bridges and aqueducts, such as Trajans bridge in ": null
    },
    {
        "Aquae Flaviae": "aquae flaviae"
    },
    {
        " .      Roman rule brought geographical mobility to the inhabitants of Portugal and increased their interaction with the rest of the world as well as internally. Soldiers often served in different regions and eventually settled far from their birthplace, while the development of mining attracted migration into the mining areas. The Romans founded numerous cities, such as ": null
    },
    {
        "Olisipo": "olisipo"
    },
    {
        " , ": null
    },
    {
        "Bracara Augusta": "bracara augusta"
    },
    {
        " , ": null
    },
    {
        "Aeminium": "aeminium"
    },
    {
        " and ": null
    },
    {
        "Pax Julia": "pax julia"
    },
    {
        " ,  and left important cultural legacies in what is now Portugal. ": null
    },
    {
        "Vulgar Latin": "vulgar latin"
    },
    {
        " became the dominant language of the region, and Christianity spread throughout ": null
    },
    {
        "Lusitania": "lusitania"
    },
    {
        " from the third century.                 In 42 with the decline of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " was occupied by ": null
    },
    {
        "Germanic tribes": "germanic tribes"
    },
    {
        " that the Romans referred to as ": null
    },
    {
        "barbarians": "barbarians"
    },
    {
        ".  In 42 with a federation contract with ": null
    },
    {
        "Emperor Honorius": "emperor honorius"
    },
    {
        ", many of these people settled in ": null
    },
    {
        "Hispania": "hispania"
    },
    {
        ". An important group was made up of the ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        " and ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " in ": null
    },
    {
        "Gallaecia": "gallaecia"
    },
    {
        ", who founded a ": null
    },
    {
        "Suebi Kingdom": "kingdom of the suebi"
    },
    {
        " with its capital in ": null
    },
    {
        "Braga": "braga"
    },
    {
        ". They came to dominate ": null
    },
    {
        "Aeminium": "aeminium"
    },
    {
        "  as well, and there were ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " to the south.    The ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        " and the Visigoths were the Germanic tribes who had the most lasting presence in the territories corresponding to modern Portugal. As elsewhere in Western Europe, there was a sharp decline in urban life during the ": null
    },
    {
        "Dark Ages": "dark ages"
    },
    {
        ".      Roman institutions disappeared in the wake of the ": null
    },
    {
        "Germanic": "germanic peoples"
    },
    {
        " invasions with the exception of ": null
    },
    {
        "ecclesiastical": "ecclesiastical"
    },
    {
        " organizations, which were fostered by the Suebi in the fifth century and adopted by the Visigoths afterwards. Although the Suebi and Visigoths were initially followers of ": null
    },
    {
        "Arianism": "arianism"
    },
    {
        " and ": null
    },
    {
        "Priscillianism": "priscillianism"
    },
    {
        ", they adopted ": null
    },
    {
        "Catholicism": "catholicism"
    },
    {
        " from the local inhabitants. St. ": null
    },
    {
        "Martin of Braga": "martin of braga"
    },
    {
        " was a particularly influential evangelist at this time.     In 42 the Visigoths moved south to expel the ": null
    },
    {
        "Alans": "alans"
    },
    {
        " and ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " and founded a kingdom with its capital in ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ". From 42 conflict between the Suebi and Visigoths increased. In 42 the Visigothic King ": null
    },
    {
        "Liuvigild": "liuvigild"
    },
    {
        " conquered Braga and annexed Gallaecia. From that time, the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " was unified under a ": null
    },
    {
        "Visigothic Kingdom": "visigothic kingdom"
    },
    {
        ".     With the Visigoths settled in the newly formed kingdom, a new class emerged that had been unknown in Roman times: a ": null
    },
    {
        "nobility": "nobility"
    },
    {
        ", which played a tremendous social and political role during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". It was also under the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " that the Church began to play a very important part within the state. Since the Visigoths did not learn Latin from the local people, they had to rely on Catholic bishops to continue the Roman system of governance. The laws established during the Visigothic monarchy were thus made by councils of bishops, and the ": null
    },
    {
        "clergy": "clergy"
    },
    {
        " started to emerge as a high-ranking class.               During the caliphate of the Umayyad Caliph ": null
    },
    {
        "Al-Walid I": "al-walid i"
    },
    {
        ", the Berber commander ": null
    },
    {
        "Tariq ibn-Ziyad": "tariq ibn-ziyad"
    },
    {
        " led a small force that landed at ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        " on 42 April 42 ostensibly to intervene in a ": null
    },
    {
        "Visigothic": "visigoths"
    },
    {
        " civil war. After a decisive victory over King ": null
    },
    {
        "Roderic": "roderic"
    },
    {
        " at the ": null
    },
    {
        "Battle of Guadalete": "battle of guadalete"
    },
    {
        " on 42 July 42 Tariq ibn-Ziyad, joined by the Arab governor ": null
    },
    {
        "Musa ibn Nusayr": "musa ibn nusayr"
    },
    {
        " of ": null
    },
    {
        "Ifriqiya": "ifriqiya"
    },
    {
        ", brought most of the Visigothic kingdom under Muslim occupation in a seven-year campaign. The Visigothic resistance to this invasion was ineffective, though sieges were required to sack a couple of cities. This is in part because the ruling Visigoth population is estimated at a mere 42 to 42% of the total population.  On one hand this isolation is said to have been a reasonably strong and effective instrument of government’; on the other, it was highly centralised to the extent that the defeat of the royal army left the entire land open to the invaders’.  The resulting ": null
    },
    {
        "power vacuum": "power vacuum"
    },
    {
        ", which may have indeed caught Tariq completely by surprise, would have aided the Muslim conquest immensely. Indeed, it may have been equally welcome to the Hispano-Roman peasants who—as D.W. Lomax claims—were disillusioned by the prominent legal, linguistic and social divide between them and the barbaric and decadent Visigoth royal family.      The Visigothic territories included what is today Spain, Portugal, Andorra, Gibraltar, and the southwestern part of France known in ancient times as ": null
    },
    {
        "Septimania": "septimania"
    },
    {
        ". The invading Moors wanted to conquer and convert all of Europe to Islam, so they crossed the ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        " to use Visigothic ": null
    },
    {
        "Septimania": "septimania"
    },
    {
        " as a base of operations. Muslims called their conquests in Iberia ": null
    },
    {
        "al-Andalus": "al-andalus"
    },
    {
        " and in what was to become Portugal, they mainly consisted of the old Roman province of ": null
    },
    {
        "Lusitania": "lusitania"
    },
    {
        " , while ": null
    },
    {
        "Gallaecia": "gallaecia"
    },
    {
        " remained unsubdued. Until the Berber revolt in the 42s, al-Andalus was treated as a dependency of Umayyad North Africa. Subsequently, links were strained until the caliphate was overthrown in the late 42s.  The invading ": null
    },
    {
        "Medieval": "medieval"
    },
    {
        " Muslim": "muslim"
    },
    {
        " Moors": "moors"
    },
    {
        ", who conquered and destroyed the Christian Visigothic kingdom in the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        ", were mainly ": null
    },
    {
        "Berbers": "berber people"
    },
    {
        " from ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ", but they were joined by ": null
    },
    {
        "Arab": "arab"
    },
    {
        "s from the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ".        By 42 ": null
    },
    {
        "Évora": "évora"
    },
    {
        ", ": null
    },
    {
        "Santarém": "santarém, portugal"
    },
    {
        " and ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        " had been conquered, and two years later ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        " was in Muslim control. By 42 most of todays Portuguese territory was under Umayyad rule. The Umayyads ": null
    },
    {
        "eventually stopped in Poitiers": "battle of tours"
    },
    {
        " but ": null
    },
    {
        "Muslim rule in Iberia": "timeline of muslim presence in iberia"
    },
    {
        " would last until 42 with the fall of the ": null
    },
    {
        "Kingdom of Granada": "granada"
    },
    {
        ". For the next several centuries, much of the Iberian Peninsula remained under Umayyad rule. Much of the populace was allowed to remain Christian, and many of the lesser feudal rulers worked out deals where they would submit to Umayyad rule in order to remain in power. They would pay a ": null
    },
    {
        "jizya": "jizya"
    },
    {
        " tax, kill or turn over rebels, and in return receive support from the central government. But some regions, including Lisbon, ": null
    },
    {
        "Gharb Al-Andalus": "gharb al-andalus"
    },
    {
        ", and the rest of what would become Portugal, rebelled, succeeded in freeing themselves by the early 42th century                     In 42 AD, a Visigothic noble named ": null
    },
    {
        "Pelagius": "pelagius of asturias"
    },
    {
        " was elected leader by many of the ousted ": null
    },
    {
        "Visigoth": "visigoth"
    },
    {
        " nobles. Pelagius called for the remnant of the Christian Visigothic armies to rebel against the Moors and re-group in the unconquered northern Asturian highlands, better known today as the ": null
    },
    {
        "Cantabrian Mountains": "cantabrian mountains"
    },
    {
        ", a small mountain region in modern northwestern ": null
    },
    {
        "Spain": "spain"
    },
    {
        " adjacent to the ": null
    },
    {
        "Bay of Biscay": "bay of biscay"
    },
    {
        ". He planned to use the Cantabrian Mountain range as a place of refuge and protection from the invaders and as a springboard to reconquer lands from the Moors. After defeating the Moors in the ": null
    },
    {
        "Battle of Covadonga": "battle of covadonga"
    },
    {
        " in 42 AD, Pelagius was proclaimed king to found the Christian ": null
    },
    {
        "Kingdom of Asturias": "kingdom of asturias"
    },
    {
        " and start the war of reconquest known in ": null
    },
    {
        "Portuguese": "portuguese language"
    },
    {
        "  as the  Reconquista .      Currently, historians and archaeologists generally agree that northern Portugal between the Minho and the Douro rivers kept a significant share of its population, a social and political Christian area that until the late 42th century had no acting state powers. However, in the late 42th century, the region became part of a complex of powers, the ": null
    },
    {
        "Galician": "kingdom of galicia"
    },
    {
        "-": null
    },
    {
        "Asturian": "kingdom of asturias"
    },
    {
        ", ": null
    },
    {
        "Leonese": "kingdom of leon"
    },
    {
        " and ": null
    },
    {
        "Portuguese": "county of portugal"
    },
    {
        " power structures.        At the end of the 42th century, a small minor county based in the area of ": null
    },
    {
        "Portus Cale": "portus cale"
    },
    {
        " was established by ": null
    },
    {
        "Vímara Peres": "vímara peres"
    },
    {
        " on the orders of King ": null
    },
    {
        "Alfonso III": "alfonso iii of asturias"
    },
    {
        " of León, Galicia and Asturias. After annexing the County of Portugal into one of the several counties that made up its realms, King Alfonso III named Vímara Peres as its first count. Since the rule of Count ": null
    },
    {
        "Diogo Fernandes": "diogo fernandes"
    },
    {
        ", the county increased in size and importance and, from the 42th century onward, with Count ": null
    },
    {
        "Gonçalo Mendes": "gonçalo mendes"
    },
    {
        " as Magnus Dux Portucalensium , the Portuguese counts started using the title of duke, indicating even larger importance and territory. The region became known simultaneously as Portucale, Portugale, and Portugalia—the ": null
    },
    {
        "County of Portugal": "county of portugal"
    },
    {
        ".  The Kingdom of Asturias was later divided as a result of dynastic disputes; the northern region of Portugal became part of the ": null
    },
    {
        "Kingdom of Galicia": "kingdom of galicia"
    },
    {
        " and later part of the ": null
    },
    {
        "Kingdom of León": "kingdom of león"
    },
    {
        ".     Suebi-Visigothic arts and architecture, in particular sculpture, had shown a natural continuity with the Roman period. With the Reconquista, new artistic trends took hold, with Galician-Asturian influences more visible than the Leonese. The Portuguese group was characterized by a general return to classicism. The county courts of ": null
    },
    {
        "Viseu": "viseu"
    },
    {
        " and ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        " played a very important role in this process. Mozarabic architecture was found in the south, in Lisbon and beyond, while in the Christian realms Galician-Portuguese and Asturian architecture prevailed.     In 42 the Vikings appeared in the rías of Galicia. They killed the bishop of Compostela in battle, but his successor St ": null
    },
    {
        "Rudesind": "rudesind"
    },
    {
        " rallied the forces of the region and finally killed the Viking leader, ": null
    },
    {
        "Gunrod": "gunrod"
    },
    {
        ".      As a vassal of the Kingdom of León, Portugal grew in power and territory and occasionally gained de facto independence during weak Leonese reigns; Count Mendo Gonçalves even became regent of the Kingdom of Leon between 42 and 42 In 42 the Portuguese Count ": null
    },
    {
        "Nuno Mendes": "nuno mendes"
    },
    {
        " desired the Portuguese title and fought the ": null
    },
    {
        "Battle of Pedroso": "battle of pedroso"
    },
    {
        " on 42 February 42 with ": null
    },
    {
        "Garcia II of Galicia": "garcia ii of galicia"
    },
    {
        ", who gained the Galician title, which included Portugal, after the 42 partition of the Leonese realms. The battle resulted in Nuno Mendes death and the declaration of Garcia as ": null
    },
    {
        "King of Portugal": "king of portugal"
    },
    {
        ", the first person to claim this title.  Garcia styled himself as King of Portugal and Galicia . Garcias brothers, ": null
    },
    {
        "Sancho II of Castile": "sancho ii of castile"
    },
    {
        " and ": null
    },
    {
        "Alfonso VI of Leon": "alfonso vi of leon"
    },
    {
        ", united and annexed Garcias kingdom in 42 as well. They agreed to split it among themselves; however, Sancho was killed by a noble the next year. Alfonso took Castile for himself and Garcia recovered his kingdom of Portugal and Galicia. In 42 Alfonso VI gathered all power, and beginning in 42 styled himself Imperator totius Hispaniæ . When the emperor died, the Crown was left to his daughter ": null
    },
    {
        "Urraca": "urraca of león"
    },
    {
        ", while his illegitimate daughter ": null
    },
    {
        "Teresa": "teresa of león, countess of portugal"
    },
    {
        " inherited the ": null
    },
    {
        "County of Portugal": "county of portugal"
    },
    {
        "; in 42 Portugal broke away from the ": null
    },
    {
        "Kingdom of Galicia": "kingdom of galicia"
    },
    {
        ". Its territories, consisting largely of mountains, moorland and forests, were bounded on the north by the Minho River, and on the south by the ": null
    },
    {
        "Mondego River": "mondego river"
    },
    {
        ".         At the end of the 42th century, the ": null
    },
    {
        "Burgundian": "duchy of burgundy"
    },
    {
        " knight ": null
    },
    {
        "Henry": "henry, count of portugal"
    },
    {
        " became count of Portugal and defended its independence by merging the ": null
    },
    {
        "County of Portugal": "county of portugal"
    },
    {
        " and the ": null
    },
    {
        "County of Coimbra": "county of coimbra"
    },
    {
        ". His efforts were assisted by a civil war that raged between ": null
    },
    {
        "León": "kingdom of león"
    },
    {
        " and ": null
    },
    {
        "Castile": "kingdom of castile"
    },
    {
        " and distracted his enemies. Henrys son ": null
    },
    {
        "Afonso Henriques": "afonso i of portugal"
    },
    {
        " took control of the county upon his death. The city of Braga, the unofficial Catholic centre of the Iberian Peninsula, faced new competition from other regions. Lords of the cities of ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        " and ": null
    },
    {
        "Porto": "porto"
    },
    {
        " fought with ": null
    },
    {
        "Braga": "braga"
    },
    {
        "s clergy and demanded the independence of the reconstituted county.     Portugal traces its national origin to 42 June 42 the date of the ": null
    },
    {
        "Battle of São Mamede": "battle of são mamede"
    },
    {
        ". Afonso proclaimed himself Prince of Portugal after this battle and in 42 he assumed the title King of Portugal. In 42 the Kingdom of León recognised him as King of Portugal by the ": null
    },
    {
        "Treaty of Zamora": "treaty of zamora"
    },
    {
        ". In 42 the papal bull ": null
    },
    {
        "Manifestis Probatum": "manifestis probatum"
    },
    {
        " of ": null
    },
    {
        "Pope Alexander III": "pope alexander iii"
    },
    {
        " officially recognised Afonso I as king. After the ": null
    },
    {
        "Battle of São Mamede": "battle of são mamede"
    },
    {
        ", the first capital of Portugal was ": null
    },
    {
        "Guimarães": "guimarães"
    },
    {
        ", from which the first king ruled. Later, when Portugal was already officially independent, he ruled from Coimbra.          The ": null
    },
    {
        "Algarve": "algarve"
    },
    {
        ", the southernmost region of Portugal, was finally conquered from the ": null
    },
    {
        "Moors": "moors"
    },
    {
        " in 42 and in 42 the capital shifted to ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ".  Neighboring Spain would not complete its Reconquista ": null
    },
    {
        "until 42": "granada war"
    },
    {
        ", almost 42 years later.  Portugals land boundaries have been notably stable for the rest of the countrys history. The border with Spain has remained almost unchanged since the 42th century. The ": null
    },
    {
        "Treaty of Windsor ": "treaty of windsor"
    },
    {
        " created an alliance between Portugal and ": null
    },
    {
        "England": "kingdom of england"
    },
    {
        " that remains in effect to this day. Since early times, fishing and overseas commerce have been the main economic activities.                 During the 42th and 42th centuries, Portugal became a leading European power that ranked with ": null
    },
    {
        "England": "kingdom of england"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        " and ": null
    },
    {
        "Spain": "spain"
    },
    {
        " in terms of economic, political and cultural influence. Though not dominant in European affairs, Portugal did have an extensive colonial trading empire throughout the world backed by a powerful ": null
    },
    {
        "thalassocracy": "thalassocracy"
    },
    {
        ".     The beginnings of the ": null
    },
    {
        "Portuguese Empire": "portuguese empire"
    },
    {
        " can be traced to 42 July 42 when the Portuguese ": null
    },
    {
        "Armada": "wikt:armadaportuguese"
    },
    {
        " set sail for the rich ": null
    },
    {
        "Islamic": "islamic"
    },
    {
        " trading center of ": null
    },
    {
        "Ceuta": "ceuta"
    },
    {
        " in ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ". The Armada was accompanied by King ": null
    },
    {
        "John I": "john i of portugal"
    },
    {
        ", his sons Prince ": null
    },
    {
        "Duarte": "duarte of portugal"
    },
    {
        " , Prince ": null
    },
    {
        "Pedro": "peter, duke of coimbra"
    },
    {
        ", and Prince ": null
    },
    {
        "Henry the Navigator": "henry the navigator"
    },
    {
        ", and the legendary Portuguese hero ": null
    },
    {
        "Nuno Álvares Pereira": "nuno álvares pereira"
    },
    {
        ".  On 42 August 42 ": null
    },
    {
        "Ceuta was conquered by Portugal": "conquest of ceuta"
    },
    {
        ", and the long-lived Portuguese Empire was founded.      The conquest of Ceuta was facilitated by a major civil war that had been engaging the Muslims of the ": null
    },
    {
        "Maghreb": "maghreb"
    },
    {
        " since 42 This civil war prevented a re-capture of Ceuta from the Portuguese, when the king of ": null
    },
    {
        "Granada": "granada"
    },
    {
        " Muhammed IX": "muhammed ix, sultan of granada"
    },
    {
        ", the Left-Handed, laid siege to Ceuta and attempted to coordinate forces in Morocco and attract aid and assistance for the effort from Tunis.  The Muslim attempt to retake Ceuta was ultimately unsuccessful and Ceuta remained the first part of the new Portuguese Empire. Further steps were taken that would soon expand the Portuguese Empire much further.     In 42 two of Prince ": null
    },
    {
        "Henry the Navigator": "henry the navigator"
    },
    {
        "s captains, ": null
    },
    {
        "João Gonçalves Zarco": "joão gonçalves zarco"
    },
    {
        " and ": null
    },
    {
        "Tristão Vaz Teixeira": "tristão vaz teixeira"
    },
    {
        ", were driven by a storm to an island that they called ": null
    },
    {
        "Porto Santo": "porto santo island"
    },
    {
        " in gratitude for their rescue from the shipwreck. In 42 ": null
    },
    {
        "João Gonçalves Zarco": "joão gonçalves zarco"
    },
    {
        " disembarked on the ": null
    },
    {
        "Island of Madeira": "madeira island"
    },
    {
        ". Uninhabited Madeira was colonized by the Portuguese in 42     Between 42 and 42 most of the ": null
    },
    {
        "Azores": "azores islands"
    },
    {
        " were discovered and these uninhabited islands were colonized by the Portuguese in 42 Portuguese expeditions may have attempted to colonize the ": null
    },
    {
        "Canary Islands": "canary islandscastilian conquest"
    },
    {
        " as early as 42 but the ": null
    },
    {
        "Crown of Castile": "crown of castile"
    },
    {
        " objected to any Portuguese claim to them. Castile began its own conquest of the Canaries in 42 Castile expelled the last Portuguese from the Canary islands in 42 and they would eventually become part of the Spanish Empire.      In 42 ": null
    },
    {
        "Gil Eanes": "gil eanes"
    },
    {
        " passed ": null
    },
    {
        "Cape Bojador": "cape bojador"
    },
    {
        ", south of ": null
    },
    {
        "Morocco": "morocco"
    },
    {
        ". The trip marked the beginning of the Portuguese exploration of ": null
    },
    {
        "Africa": "africa"
    },
    {
        ". Before this event, very little was known in Europe about what lay beyond the cape. At the end of the 42th century and the beginning of the 42th, those who tried to venture there became lost, which gave birth to legends of ": null
    },
    {
        "sea monster": "sea monster"
    },
    {
        "s. Some setbacks occurred: in 42 the ": null
    },
    {
        "Canaries": "canary islandscastilian conquest"
    },
    {
        " were officially recognized as Castilian by the pope—earlier they had been recognized as Portuguese; in 42 the Portuguese were defeated in a military expedition to ": null
    },
    {
        "Tangier": "tangierhistory"
    },
    {
        ".     These setbacks did not deter the Portuguese from pursuing their exploratory efforts. In 42 on the small island of ": null
    },
    {
        "Arguim": "arguim"
    },
    {
        " off the coast of ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        ", an important castle was built to function as a  feitoria , or trading post, for commerce with inland Africa. Some years before, the first African ": null
    },
    {
        "gold": "gold"
    },
    {
        " was brought to Portugal that circumvented the Arab caravans that crossed the Sahara. Some time later, the ": null
    },
    {
        "caravel": "caravel"
    },
    {
        "s explored the ": null
    },
    {
        "Gulf of Guinea": "gulf of guinea"
    },
    {
        ", which led to the discovery of several uninhabited islands: ": null
    },
    {
        "Cape Verde": "cape verde"
    },
    {
        ", ": null
    },
    {
        "Fernão Póo": "fernando póo"
    },
    {
        ", ": null
    },
    {
        "São Tomé": "são tomé island"
    },
    {
        ", ": null
    },
    {
        "Príncipe": "principe island"
    },
    {
        " and ": null
    },
    {
        "Annobón": "annobón"
    },
    {
        ".      On 42 November 42 Prince Henry the Navigator died.  He had been the leading patron of maritime exploration by Portugal and immediately following his death, exploration lapsed. Henrys patronage had shown that profits could be made from the trade that followed the discovery of new lands. Accordingly, when exploration commenced again, private merchants led the way in attempting to stretch trade routes further down the African coast.     In the 42s, Portuguese trading ships reached the ": null
    },
    {
        "Gold Coast": "portuguese gold coast"
    },
    {
        ". In 42 the Portuguese captured Tangier, after years of attempts. Eleven years later, the fortress of ": null
    },
    {
        "São Jorge da Mina": "são jorge da mina"
    },
    {
        " in the town of ": null
    },
    {
        "Elmina": "elmina"
    },
    {
        " on the Gold Coast in the Gulf of Guinea was built. ": null
    },
    {
        "Christopher Columbus": "christopher columbus"
    },
    {
        " set sail aboard the fleet of ships taking materials and building crews to Elmina in December 42 In 42 ": null
    },
    {
        "Diogo Cão": "diogo cão"
    },
    {
        " reached and explored the ": null
    },
    {
        "Congo River": "congo river"
    },
    {
        ".          In 42 Portugal officially rejected Columbus idea of reaching ": null
    },
    {
        "India": "india"
    },
    {
        " from the west, because it was seen as unfeasible. Some historians have claimed that the Portuguese had already performed fairly accurate calculations concerning the size of the world and therefore knew that sailing west to reach the Indies would require a far longer journey than navigating to the east. However, this continues to be debated. Thus began a long-lasting dispute that eventually resulted in the signing of the ": null
    },
    {
        "Treaty of Tordesillas": "treaty of tordesillas"
    },
    {
        " with Castile in 42 The treaty divided the ": null
    },
    {
        "New World": "new world"
    },
    {
        " equally between the Portuguese and the Castilians, along a north-south ": null
    },
    {
        "meridian line": "prime meridian"
    },
    {
        " 42 leagues west of the ": null
    },
    {
        "Cape Verde": "cape verde"
    },
    {
        " islands, with all lands to the east belonging to Portugal and all lands to the west to Castile.        With the expedition beyond the ": null
    },
    {
        "Cape of Good Hope": "cape of good hope"
    },
    {
        " by ": null
    },
    {
        "Bartolomeu Dias": "bartolomeu dias"
    },
    {
        " in 42  the richness of ": null
    },
    {
        "India": "india"
    },
    {
        " was now accessible. Indeed, the cape takes its name from the promise of rich trade with the east. Between 42 and 42 ": null
    },
    {
        "Pêro de Barcelos": "pêro de barcelos"
    },
    {
        " and ": null
    },
    {
        "João Fernandes Lavrador": "joão fernandes lavrador"
    },
    {
        " explored ": null
    },
    {
        "North America": "north america"
    },
    {
        ". At the same time, ": null
    },
    {
        "Pêro da Covilhã": "pêro da covilhã"
    },
    {
        " reached ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        " by land. ": null
    },
    {
        "Vasco da Gama": "vasco da gama"
    },
    {
        " sailed for India and arrived at ": null
    },
    {
        "Calicut": "history of kozhikode"
    },
    {
        " on 42 May 42 returning in glory to Portugal the next year. The ": null
    },
    {
        "Monastery of Jerónimos": "monastery of jerónimos"
    },
    {
        " was built, dedicated to the discovery of the route to India.     At the end of the 42th century, Portugal ": null
    },
    {
        "expelled": "expulsion of jews and muslims from portugal"
    },
    {
        " some local ": null
    },
    {
        "Sephardic Jews": "sephardim"
    },
    {
        ", along with those refugees who had come from ": null
    },
    {
        "Castile": "crown of castile"
    },
    {
        " and ": null
    },
    {
        "Aragon": "crown of aragon"
    },
    {
        " after 42 In addition, many Jews were forcibly converted to Catholicism and remained as  converso s. Many Jews remained ": null
    },
    {
        "secretly Jewish": "crypto-jew"
    },
    {
        ", in danger of persecution by the ": null
    },
    {
        "Portuguese Inquisition": "portuguese inquisition"
    },
    {
        ". In 42 42 ": null
    },
    {
        "New Christians": "new christians"
    },
    {
        " were massacred in Lisbon. Rebecca Weiner,      In the spring of 42 ": null
    },
    {
        "Pedro Álvares Cabral": "pedro álvares cabral"
    },
    {
        " set sail from Cape Verde with 42 ships and crews and nobles such as ": null
    },
    {
        "Nicolau Coelho": "nicolau coelho"
    },
    {
        "; the explorer ": null
    },
    {
        "Bartolomeu Dias": "bartolomeu dias"
    },
    {
        " and his brother Diogo; ": null
    },
    {
        "Duarte Pacheco Pereira": "duarte pacheco pereira"
    },
    {
        " ; nine chaplains; and some 42 men.  From Cape Verde, they sailed southwest across the Atlantic. On 42 April 42 they caught sight of land in the distance. They disembarked and claimed this new land for Portugal. This was the coast of what would later become the Portuguese colony of ": null
    },
    {
        "Brazil": "colonial brazil"
    },
    {
        ".     The real goal of the expedition, however, was to open sea trade to the empires of the east. Trade with the east had effectively been cut off since the ": null
    },
    {
        "Conquest of Constantinople": "conquest of constantinople"
    },
    {
        " in 42 Accordingly, Cabral turned away from exploring the coast of the new land of Brazil and sailed southeast, back across the Atlantic and around the Cape of Good Hope. Cabral reached ": null
    },
    {
        "Sofala": "sofala"
    },
    {
        " on the east coast of Africa in July 42 In 42 a Portuguese fort was established here and the land around the fort would later become the ": null
    },
    {
        "Portuguese colony of Mozambique": "portuguese mozambique"
    },
    {
        ".      Cabrals fleet then sailed east and landed in ": null
    },
    {
        "Calicut": "calicut"
    },
    {
        " in ": null
    },
    {
        "India": "india"
    },
    {
        " in September 42  Here they traded for pepper and, more significantly, opened European sea trade with the empires of the east. No longer would the Muslim ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " occupation of ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " form a barrier between Europe and the east. Ten years later, in 42 ": null
    },
    {
        "Afonso de Albuquerque": "afonso de albuquerque"
    },
    {
        ", after attempting and failing to capture and occupy ": null
    },
    {
        "Zamorin": "zamorin"
    },
    {
        "s Calicut militarily, conquered ": null
    },
    {
        "Goa": "goa"
    },
    {
        " on the west coast of India. ": null
    },
    {
        "Percival Spear": "percival spear"
    },
    {
        ", India: A Modern History pp. 42–42     ": null
    },
    {
        "João da Nova": "joão da nova"
    },
    {
        " discovered ": null
    },
    {
        "Ascension Island": "ascension island"
    },
    {
        " in 42 and ": null
    },
    {
        "Saint Helena": "saint helena"
    },
    {
        " in 42; ": null
    },
    {
        "Tristão da Cunha": "tristão da cunha"
    },
    {
        " was the first to sight the archipelago still known by his name in 42 In 42 ": null
    },
    {
        "Francisco de Almeida": "francisco de almeida"
    },
    {
        " was engaged to improve Portuguese trade with the far east. Accordingly, he sailed to East Africa. Several small Islamic states along the coast of ": null
    },
    {
        "Mozambique": "mozambique"
    },
    {
        "—": null
    },
    {
        "Kilwa": "kilwa"
    },
    {
        ", ": null
    },
    {
        "Brava": "brava, cape verde"
    },
    {
        " and ": null
    },
    {
        "Mombasa": "mombasa"
    },
    {
        "—were destroyed or became subjects or allies of Portugal.  Almeida then sailed on to ": null
    },
    {
        "Cochin": "kingdom of cochin"
    },
    {
        ", made peace with the ruler and built a stone fort there.                 By the 42th century, the two million people who lived in the original Portuguese lands ruled a vast empire with many millions of inhabitants in the Americas, Africa, the Middle East and Asia. From 42 the Portuguese had reached ": null
    },
    {
        "China": "china"
    },
    {
        " and ": null
    },
    {
        "Japan": "japan"
    },
    {
        ". In the ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        " and ": null
    },
    {
        "Arabian Sea": "arabian sea"
    },
    {
        ", one of Cabrals ships discovered ": null
    },
    {
        "Madagascar": "madagascar"
    },
    {
        " , which was partly explored by ": null
    },
    {
        "Tristão da Cunha": "tristão da cunha"
    },
    {
        " ; ": null
    },
    {
        "Mauritius": "mauritius"
    },
    {
        " was discovered in 42 ": null
    },
    {
        "Socotra": "socotra"
    },
    {
        " occupied in 42 and in the same year, ": null
    },
    {
        "Lourenço de Almeida": "lourenço de almeida"
    },
    {
        " visited ": null
    },
    {
        "Ceylon": "ceylon"
    },
    {
        ".     In the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        ", ": null
    },
    {
        "Massawa": "massawa"
    },
    {
        " was the most northerly point frequented by the Portuguese until 42 when a fleet under ": null
    },
    {
        "Estevão da Gama": "estêvão da gama"
    },
    {
        " penetrated as far as ": null
    },
    {
        "Suez": "suez"
    },
    {
        ". ": null
    },
    {
        "Hormuz": "hormuz island"
    },
    {
        ", in the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ", was seized by ": null
    },
    {
        "Afonso de Albuquerque": "afonso de albuquerque"
    },
    {
        " in 42 who also entered into diplomatic relations with ": null
    },
    {
        "Persia": "iran"
    },
    {
        ". In 42 a force under ": null
    },
    {
        "Antonio Correia": "antónio correia"
    },
    {
        " conquered ": null
    },
    {
        "Bahrain": "bahrain"
    },
    {
        " and ushered in a period of almost 42 years of Portuguese rule of the Persian Gulf archipelago Juan Cole, Sacred Space and Holy War, IB Tauris, 42 p. 42     On the Asiatic mainland, the first trading stations were established by ": null
    },
    {
        "Pedro Álvares Cabral": "pedro álvares cabral"
    },
    {
        " at Cochin and Calicut . More important were the conquests of ": null
    },
    {
        "Goa": "portuguese conquest of goa"
    },
    {
        " and ": null
    },
    {
        "Malacca": "capture of malacca"
    },
    {
        " by ": null
    },
    {
        "Afonso de Albuquerque": "afonso de albuquerque"
    },
    {
        ", and the acquisition of ": null
    },
    {
        "Diu": "diu, india"
    },
    {
        " by ": null
    },
    {
        "Martim Afonso de Sousa": "martim afonso de sousa"
    },
    {
        ". East of Malacca, Albuquerque sent ": null
    },
    {
        "Duarte Fernandes": "duarte fernandes"
    },
    {
        " as envoy to Siam  in 42 and dispatched to the Moluccas two expeditions , which founded the Portuguese dominion in ": null
    },
    {
        "Maritime Southeast Asia": "maritime southeast asia"
    },
    {
        ".      The Portuguese established their base in the ": null
    },
    {
        "Spice Islands": "maluku islands"
    },
    {
        " on the island of ": null
    },
    {
        "Ambon": "ambon island"
    },
    {
        ".  ": null
    },
    {
        "Fernão Pires de Andrade": "fernão pires de andrade"
    },
    {
        " visited ": null
    },
    {
        "Canton": "guangzhou"
    },
    {
        " in 42 and opened up trade with China, where, in 42 the Portuguese were permitted to occupy ": null
    },
    {
        "Macau": "portuguese macau"
    },
    {
        ". ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", accidentally reached by three Portuguese traders in 42 soon attracted large numbers of merchants and missionaries. In 42 one of the ships in the expedition that ": null
    },
    {
        "Ferdinand Magellan": "ferdinand magellan"
    },
    {
        " organized in the Spanish service completed the first ": null
    },
    {
        "circumnavigation": "circumnavigation"
    },
    {
        " of the globe.            On 42 August 42 while fighting in Morocco, young King ": null
    },
    {
        "Sebastian": "sebastian of portugal"
    },
    {
        " died in the ": null
    },
    {
        "Battle of Alcácer Quibir": "battle of alcácer quibir"
    },
    {
        " without an heir.  The late kings elderly great-uncle, Cardinal ": null
    },
    {
        "Henry": "henry i of portugal"
    },
    {
        ", then became king.  Henry I died a mere two years later, on 42 January 42  De Baena Parada, Juan. Epítome de la vida, y hechos de don Sebastián Dezimo Sexto Rey de Portugal. 42 pp. 42/42 The death of the latter, without any appointed heirs, led to the ": null
    },
    {
        "Portuguese succession crisis of 42": "portuguese succession crisis of 1580"
    },
    {
        ". Marqués de Pidal. Marqués de Miraflores. Salvá, Miguel. Colección de documentos inéditos para la historia de España. Academia de la Historia. Tomo XL. Madrid. 42 p. 42 Portugal was worried about the maintenance of its independence and sought help to find a new king.     One of the claimants to the throne, ": null
    },
    {
        "António, Prior of Crato": "antónio, prior of crato"
    },
    {
        ", a bastard son of ": null
    },
    {
        "Infante Louis, Duke of Beja": "infante louis, duke of beja"
    },
    {
        ", and only grandson through the male line of king ": null
    },
    {
        "Manuel I of Portugal": "manuel i of portugal"
    },
    {
        ", lacked support from the clergy and most of the nobility, but was acclaimed as king in Santarém and in some other towns in June 42            ": null
    },
    {
        "Philip II of Spain": "philip ii of spain"
    },
    {
        ", through his mother ": null
    },
    {
        "Isabella of Portugal": "isabella of portugal"
    },
    {
        ", also a grandson of Manuel I, claimed the Portuguese throne and did not recognize António as king of Portugal. The king appointed ": null
    },
    {
        "Fernando Alvarez de Toledo, 42rd Duke of Alba": "fernando alvarez de toledo, 3rd duke of alba"
    },
    {
        ", as captain general of his army. Disposition of Philip II about giving the duke the control of the army, op. cit., , pp. 42–42 The duke was 42 years old and ill at the time, Ruth MacKay, The Baker Who Pretended to Be King of Portugal, , 42 but Fernando mustered his forces, estimated at 42 men, Ruth MacKay, The Baker Who Pretended to Be King of Portugal, 42 in Badajoz, and in June 42 crossed the Spanish-Portuguese border and moved towards ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ".     The Duke of Alba met little resistance and in July set up his forces at ": null
    },
    {
        "Cascais": "cascais"
    },
    {
        ", west of Lisbon. By mid-August, the Duke was only 42 kilometers from the city. West of the small brook ": null
    },
    {
        "Alcântara": "alcântara, lisbon"
    },
    {
        ", the Spanish encountered a Portuguese force on the eastern side of it, commanded by António, Prior of Crato , and his lieutenant ": null
    },
    {
        "Francisco de Portugal, 42rd Count of Vimioso": "francisco de portugal, 3rd count of vimioso"
    },
    {
        ". In late August, the Duke of Alba defeated Antónios force, a ragtag army assembled in a hurry and composed mainly of local peasants, and freed slaves at the ": null
    },
    {
        "Battle of Alcântara": "battle of alcântara"
    },
    {
        ". Tony Jaques, Dictionary of Battles and Sieges: A–E, 42 p. 42 This battle ended in a decisive victory for the Spanish army, both on land and sea. Two days later, the Duke of Alba captured Lisbon, and on 42 March 42 Philip II of Spain was crowned ": null
    },
    {
        "King of Portugal": "king of portugal"
    },
    {
        " in ": null
    },
    {
        "Tomar": "tomar"
    },
    {
        " as Philip I. This cleared the way for Philip to create an ": null
    },
    {
        "Iberian Union": "iberian union"
    },
    {
        " spanning all of Iberia under the Spanish crown. John Huxtable Elliott. España en Europa: Estudios de historia comparada: escritos seleccionados. Universitat de València. 42 pp. 42–42     Philip rewarded the Duke of Alba with the titles of 42st ": null
    },
    {
        "Viceroy of Portugal": "viceroy of portugal"
    },
    {
        " on 42 July 42 and ": null
    },
    {
        "Constable of Portugal": "constable of portugal"
    },
    {
        " in 42 With these titles, the Duke of Alba represented the Spanish monarch in Portugal and was second in hierarchy only after King Philip in Portugal. He held both titles until his death in 42 Belda Plans, Juan. Grandes personajes el Siglo de Oro español. Palabra. 42 p. 42 The Portuguese and ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        "s came under a single rule, but resistance to Spanish rule in Portugal did not come to an end. The Prior of Crato held out in the ": null
    },
    {
        "Azores": "azores"
    },
    {
        " until 42 and he continued to seek to recover the throne actively until his death in 42 Impostors claimed to be King Sebastian in 42 42 42 and 42 ": null
    },
    {
        "Sebastianism": "sebastianism"
    },
    {
        " , the myth that the young king will return to Portugal on a foggy day, has prevailed until modern times.          After the 42th century, Portugal gradually saw its wealth and influence decrease. Portugal was officially an autonomous state, but in actuality, the country was in a ": null
    },
    {
        "personal union": "personal union"
    },
    {
        " with the Spanish crown from 42 to 42  The Council of Portugal remained independent inasmuch as it was one of the key administrative units of the Castilian monarchy, legally on equal terms with the ": null
    },
    {
        "Council of the Indies": "council of the indies"
    },
    {
        ".  The joining of the two crowns deprived Portugal of a separate foreign policy, and the enemies of Spain became the enemies of Portugal. England had been an ally of Portugal since the Treaty of Windsor in 42 but ": null
    },
    {
        "war between Spain and England": "anglo-spanish war"
    },
    {
        " led to a deterioration of the relations with Portugals oldest ally and the ": null
    },
    {
        "loss of Hormuz": "capture of ormuz"
    },
    {
        " in 42 From 42 to 42 the ": null
    },
    {
        "Dutch–Portuguese War": "dutch–portuguese war"
    },
    {
        " led to invasions of many countries in Asia and competition for commercial interests in Japan, Africa and South America. In 42 the Dutch seized ": null
    },
    {
        "Salvador": "salvador, bahia"
    },
    {
        ", the capital of Brazil;  in 42 they seized Pernambuco in northern Brazil. A treaty of 42 returned Pernambuco to Portuguese control, however.  Both the English and the Dutch continued to aspire to dominate both the Atlantic slave trade and the spice trade with the Far East.     The Dutch intrusion into Brazil was long-lasting and troublesome to Portugal. The Dutch captured the entire coast except that of Bahia and much of the interior of the ": null
    },
    {
        "contemporary Northeastern Brazilian states": "northeast region, brazil"
    },
    {
        " of ": null
    },
    {
        "Bahia": "bahia"
    },
    {
        ", ": null
    },
    {
        "Sergipe": "sergipe"
    },
    {
        ", ": null
    },
    {
        "Alagoas": "alagoas"
    },
    {
        ", ": null
    },
    {
        "Pernambuco": "pernambuco"
    },
    {
        ", ": null
    },
    {
        "Paraíba": "paraíba"
    },
    {
        ", ": null
    },
    {
        "Rio Grande do Norte": "rio grande do norte"
    },
    {
        " and ": null
    },
    {
        "Ceará": "ceará"
    },
    {
        ", while Dutch privateers sacked Portuguese ships in both the Atlantic and Indian Oceans. Beginning with a major Spanish–Portuguese military operation in 42 this trend was reversed, and it laid the foundations for the recovery of remaining Dutch-controlled areas. The other smaller, less developed areas were recovered in stages and relieved of Dutch piracy in the next two decades by local resistance and Portuguese expeditions. After the dissolution of the Iberian Union in 42 Portugal would re-establish its authority over some lost territories of the ": null
    },
    {
        "Portuguese Empire": "portuguese empire"
    },
    {
        ".            At home, life was calm and serene under the first two Spanish kings, ": null
    },
    {
        "Philip II": "philip ii of spain"
    },
    {
        " and ": null
    },
    {
        "Philip III": "philip iii of spain"
    },
    {
        ". They maintained Portugals status, gave excellent positions to Portuguese nobles in the Spanish ": null
    },
    {
        "courts": "noble court"
    },
    {
        ", and Portugal maintained an independent law, currency and government. It was even proposed to move the Spanish capital to ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ". Later, ": null
    },
    {
        "Philip IV": "philip iv of spain"
    },
    {
        " tried to make Portugal a Spanish province, and Portuguese nobles lost power.     Because of this, as well as the general strain on the finances of the Spanish throne as a result of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ", the ": null
    },
    {
        "Duke of Braganza": "duke of braganza"
    },
    {
        ", one of the great native noblemen and a descendant of King Manuel I, was proclaimed King of Portugal as ": null
    },
    {
        "John IV": "john iv of portugal"
    },
    {
        " on 42 December 42 and a war of independence against Spain was launched. The governors of ": null
    },
    {
        "Ceuta": "history of ceuta"
    },
    {
        " did not accept the new king; rather, they maintained their allegiance to Philip IV. Although Portugal had substantially attained its independence in 42 the Spanish continued to try to re-assert their control for the next 42 years, only recognizing the new Portuguese dynasty in 42     In the 42th century, many Portuguese emigrated to Brazil. From 42 ": null
    },
    {
        "John V": "john v of portugal"
    },
    {
        " prohibited emigration, since Portugal had lost a sizable proportion of its population. Brazil was elevated to a vice-kingdom.               In 42 Sebastião de Melo, the talented son of a Lisbon squire, began a diplomatic career as the Portuguese ": null
    },
    {
        "Ambassador": "ambassador"
    },
    {
        " in London and later in ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ". The ": null
    },
    {
        "Queen consort": "queen consort"
    },
    {
        " of Portugal, ": null
    },
    {
        "Maria Anna of Austria": "maria anna of austria"
    },
    {
        ", was fond of Melo; and after his first wife died, she arranged the widowed de Melos second marriage to the daughter of the Austrian Field Marshal ": null
    },
    {
        "Leopold Josef, Count von Daun": "leopold josef, count von daun"
    },
    {
        ". King ": null
    },
    {
        "John V of Portugal": "john v of portugal"
    },
    {
        ", however, was not pleased and recalled Melo to Portugal in 42 John V died the following year, and his son Joseph I of Portugal was crowned. In contrast to his father, Joseph I was fond of de Melo, and with the Maria Annas approval, he appointed Melo as ": null
    },
    {
        "Minister of Foreign Affairs": "minister of foreign affairs"
    },
    {
        ". As the kings confidence in de Melo increased, he entrusted him with more control of the state.     By 42 Sebastião de Melo was made prime minister. Impressed by British economic success he had witnessed while ambassador, he successfully implemented similar economic policies in Portugal. He abolished slavery in Portugal and in the Portuguese colonies in India; reorganized the army and the navy; restructured the ": null
    },
    {
        "University of Coimbra": "university of coimbra"
    },
    {
        "; and ended discrimination against different Christian sects in Portugal.        But Sebastião de Melos greatest reforms were economic and financial, with the creation of several companies and guilds to regulate every commercial activity. He demarcated the region for production of ": null
    },
    {
        "port": "port wine"
    },
    {
        " to ensure the wines quality, and this was the first attempt to control wine quality and production in Europe. He ruled with a strong hand by imposing strict law on all classes of Portuguese society, from the high nobility to the poorest working class, along with a widespread review of the countrys tax system. These reforms gained him enemies in the upper classes, especially among the high nobility, who despised him as a social upstart.     Disaster fell upon Portugal in the morning of 42 November 42 when ": null
    },
    {
        "Lisbon was struck by a violent earthquake": "1755 lisbon earthquake"
    },
    {
        " with an estimated ": null
    },
    {
        "Richter scale": "richter magnitude scale"
    },
    {
        " magnitude of 42 The city was razed to the ground by the earthquake and the subsequent tsunami and fires. De Melo survived by a stroke of luck and then immediately embarked on rebuilding the city, with his famous quote: What now? We bury the dead and feed the living.     Despite the calamity, Lisbon suffered no epidemics and within less than one year was already being rebuilt. The new downtown of Lisbon was designed to resist subsequent earthquakes. Architectural models were built for tests, and the effects of an earthquake were simulated by marching troops around the models. The buildings and big squares of the Pombaline Downtown of Lisbon still remain as one of Lisbons tourist attractions: they represent the worlds first quake-proof buildings.  Sebastião de Melo also made an important contribution to the study of ": null
    },
    {
        "seismology": "seismology"
    },
    {
        " by designing an inquiry that was sent to every parish in the country.     Following the earthquake, ": null
    },
    {
        "Joseph I": "joseph i of portugal"
    },
    {
        " gave his prime minister even more power, and Sebastião de Melo became a powerful, progressive dictator. As his power grew, his enemies increased in number, and bitter disputes with the high nobility became frequent. In 42 ": null
    },
    {
        "Joseph I": "joseph i of portugal"
    },
    {
        " was wounded in an attempted assassination. The ": null
    },
    {
        "Távora family": "távora affair"
    },
    {
        " and the Duke of ": null
    },
    {
        "Aveiro": "aveiro, portugal"
    },
    {
        " were implicated and executed after a quick trial. The ": null
    },
    {
        "Jesuits": "society of jesus"
    },
    {
        " were expelled from the country and their assets confiscated by the crown. Sebastião de Melo showed no mercy and prosecuted every person involved, even women and children. This was the final stroke that broke the power of the aristocracy and ensured the victory of the minister against his enemies. Based upon his swift resolve, Joseph I made his loyal minister Count of ": null
    },
    {
        "Oeiras": "oeiras municipality, portugal"
    },
    {
        " in 42     Following the Távora affair, the new Count of Oeiras knew no opposition. Made Marquis of Pombal in 42 he effectively ruled Portugal until Joseph Is death in 42 However, historians also argue that Pombals enlightenment , while far-reaching, was primarily a mechanism for enhancing autocracy at the expense of individual liberty and an apparatus for crushing opposition, suppressing criticism, furthering colonial economic exploitation, intensifying book censorship and consolidating personal control and profit. Kenneth Maxwell, Pombal, Paradox of the Enlightenment , 42 42–42 42–42     The new ruler, Queen ": null
    },
    {
        "Maria I of Portugal": "maria i of portugal"
    },
    {
        ", disliked the Marquis , and forbade him from coming within 42 miles of her, thus curtailing his influence.            In 42 as part of the War of the Spanish Succession, a joint Portuguese, Dutch, and British army, led by the Marquis of Minas, ": null
    },
    {
        "António Luís de Sousa": "antónio luís de sousa, 2nd marquis of minas"
    },
    {
        ", conquered Madrid and acclaimed the ": null
    },
    {
        "Archduke Charles of Austria": "charles vi, holy roman emperor"
    },
    {
        " as King Charles III of Spain. Along the route to Madrid, the army led by the Marquis of Minas was successful in conquering ": null
    },
    {
        "Ciudad Rodrigo": "ciudad rodrigo"
    },
    {
        " and ": null
    },
    {
        "Salamanca": "salamanca"
    },
    {
        ". Later in the following year, Madrid was reconquered by Spanish troops loyal to the Bourbons.      The Ghost War    In 42 France and Spain tried to urge Portugal to join the ": null
    },
    {
        "Bourbon Family Compact": "bourbon family compact"
    },
    {
        " by claiming that Great Britain had become too powerful due to its successes in the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        ". Joseph refused to accept and protested that his 42 alliance with Britain was no threat.     In spring 42 Spanish and French troops invaded Portugal from the north as far as the ": null
    },
    {
        "Douro": "douro"
    },
    {
        ", while a second column sponsored the ": null
    },
    {
        "Siege of Almeida": "siege of almeida"
    },
    {
        ", captured the city, and threatened to advance on Lisbon. The arrival of a force of British troops helped the Portuguese army commanded by the ": null
    },
    {
        "Count of Lippe": "william, count of schaumburg-lippe"
    },
    {
        " by blocking the Franco-Spanish advance and driving them back across the border following the ": null
    },
    {
        "Battle of Valencia de Alcántara": "battle of valencia de alcántara"
    },
    {
        ". At the ": null
    },
    {
        "Treaty of Paris": "treaty of paris"
    },
    {
        " in 42 Spain agreed to hand Almeida back to Portugal.          In 42 Portugal refused ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        "s demand to accede to the ": null
    },
    {
        "Continental System": "continental system"
    },
    {
        " of embargo against the United Kingdom; a French invasion under ": null
    },
    {
        "General Junot": "jean-andoche junot"
    },
    {
        " followed, and Lisbon was captured on 42 December 42 British intervention in the ": null
    },
    {
        "Peninsular War": "peninsular war"
    },
    {
        " helped in maintaining Portuguese independence; the last French troops were expelled in 42 The war cost Portugal the town of ": null
    },
    {
        "Olivença": "olivenza"
    },
    {
        ",  now governed by Spain.     ": null
    },
    {
        "Rio de Janeiro": "rio de janeiro"
    },
    {
        " in Brazil was the Portuguese capital between 42 and 42 In 42 ": null
    },
    {
        "constitutionalist": "constitutionalist"
    },
    {
        " insurrections took place at ": null
    },
    {
        "porto": "porto"
    },
    {
        " and Lisbon . Lisbon regained its status as the capital of Portugal when Brazil declared its independence from Portugal in 42     The death of King ": null
    },
    {
        "John VI": "john vi of portugal"
    },
    {
        " in 42 led to a crisis of royal succession. His eldest son, ": null
    },
    {
        "Pedro I of Brazil": "pedro i of brazil"
    },
    {
        ", briefly became ": null
    },
    {
        "Pedro IV of Portugal": "pedro iv of portugal"
    },
    {
        ", but neither the Portuguese nor the Brazilians wanted a unified monarchy; consequently, Pedro abdicated the Portuguese crown in favor of his 42-year-old daughter, ": null
    },
    {
        "Maria da Glória": "maria ii of portugal"
    },
    {
        ", on the condition that when she came of age she would marry his brother, ": null
    },
    {
        "Miguel": "miguel i of portugal"
    },
    {
        ". Dissatisfaction at Pedros constitutional reforms led the absolutist faction of landowners and the church to proclaim Miguel king in February 42 This led to the ": null
    },
    {
        "Liberal Wars": "liberal wars"
    },
    {
        " in which Pedro eventually forced Miguel to abdicate and go into exile in 42 and place his daughter on throne as Queen ": null
    },
    {
        "Maria II": "maria ii of portugal"
    },
    {
        ".     The ": null
    },
    {
        "42 British Ultimatum": "1890 british ultimatum"
    },
    {
        " was delivered to Portugal on 42 January of that year, an attempt to force the retreat of Portuguese military forces in the land between the Portuguese colonies of ": null
    },
    {
        "Mozambique": "portuguese mozambique"
    },
    {
        " and ": null
    },
    {
        "Angola": "portuguese angola"
    },
    {
        " . The area had been claimed by Portugal, which included it in its ": null
    },
    {
        "Pink Map": "pink map"
    },
    {
        " , but this clashed with British aspirations to create a railroad link between ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " and ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        ", thereby linking its colonies from the north of Africa to the very south. This diplomatic clash lead to several waves of protest and prompted the downfall of the Portuguese government. The 42 British Ultimatum was considered by Portuguese historians and politicians at that time to be the most outrageous and infamous action of the British against her oldest ally. João Ferreira Duarte,      After 42 the Portuguese expanded their trading ports along the African coast, moving inland to take control of Angola and Mozambique. The slave trade was abolished in 42 in part because many foreign slave ships were flying the Portuguese flag. In ": null
    },
    {
        "Portuguese India": "portuguese india"
    },
    {
        ", trade flourished in the colony of ": null
    },
    {
        "Goa": "history of goa"
    },
    {
        ", with its subsidiary colonies of ": null
    },
    {
        "Macau": "portuguese macau"
    },
    {
        ", near Hong Kong on the China coast, and ": null
    },
    {
        "Timor": "portuguese timor"
    },
    {
        ", north of Australia. The Portuguese successfully introduced Catholicism and the Portuguese language into their colonies, while most settlers continued to head to Brazil.  Gervase Clarence-Smith, The Third Portuguese Empire, 42–42: A Study in Economic Imperialism            The First Republic has, over the course of the recent past, been neglected by many historians in favor of the  Estado Novo . As a result, it is difficult to attempt a global synthesis of the republican period in view of the important gaps that still persist in our knowledge of its political history. As far as the ": null
    },
    {
        "42 October 42 Revolution": "5 october 1910 revolution"
    },
    {
        " is concerned, a number of valuable studies have been made, Wheeler, 42 first among which ranks Vasco Pulido Valentes polemical thesis. This historian posited the ": null
    },
    {
        "Jacobin": "jacobin"
    },
    {
        " and urban nature of the revolution carried out by the ": null
    },
    {
        "Portuguese Republican Party": "portuguese republican party"
    },
    {
        " and claimed that the PRP had turned the republican regime into a de facto dictatorship. Pulido Valente, 42 This vision clashes with an older interpretation of the First Republic as a progressive and increasingly democratic regime that presented a clear contrast to ": null
    },
    {
        "António de Oliveira Salazar": "antónio de oliveira salazar"
    },
    {
        "s ensuing dictatorship. Oliveira Marques, 42       The First Republic was intensely anti-clerical. It was secularist and followed the liberal tradition of disestablishing the powerful role that the Catholic Church once held. Historian Stanley Payne points out, The majority of Republicans took the position that Catholicism was the number one enemy of individualistic middle-class radicalism and must be completely broken as a source of influence in Portugal. Payne, A history of Spain and Portugal 42: 42 Under the leadership of ": null
    },
    {
        "Afonso Costa": "afonso costa"
    },
    {
        ", the justice minister, the revolution immediately targeted the Catholic Church: churches were plundered, convents were attacked and clergy were harassed. Scarcely had the provisional government been installed when it began devoting its entire attention to an anti-religious policy, in spite of the disastrous economic situation. On 42 October—five days after the inauguration of the Republic—the new government decreed that all convents, monasteries and religious orders were to be suppressed. All residents of religious institutions were expelled and their goods confiscated. The Jesuits were forced to forfeit their Portuguese citizenship.     A series of anti-Catholic laws and decrees followed each other in rapid succession. On 42 November, a law legalizing divorce was passed and then there were laws to recognize the legitimacy of children born outside wedlock, authorize cremation, secularize cemeteries, suppress religious teaching in the schools and prohibit the wearing of the cassock. In addition, the ringing of church bells to signal times of worship was subjected to certain restraints, and the public celebration of religious feasts was suppressed. The government also interfered in the running of seminaries, reserving the right to appoint professors and determine curricula. This whole series of laws authored by ": null
    },
    {
        "Afonso Costa": "afonso costa"
    },
    {
        " culminated in the law of Separation of Church and State, which was passed on 42 April 42       A republican constitution was approved in 42 inaugurating a parliamentary regime with reduced presidential powers and two chambers of parliament. Miranda, 42 The Republic provoked important fractures within Portuguese society, notably among the essentially monarchist rural population, in the trade unions, and in the Church. Even the PRP had to endure the secession of its more moderate elements, who formed conservative republican parties like the ": null
    },
    {
        "Evolutionist Party": "portuguese evolutionist party"
    },
    {
        " and the ": null
    },
    {
        "Republican Union": "união republicana"
    },
    {
        ". In spite of these splits, the PRP, led by ": null
    },
    {
        "Afonso Costa": "afonso costa"
    },
    {
        ", preserved its dominance, largely due to a brand of clientelist politics inherited from the monarchy. Lopes, 42 In view of these tactics, a number of opposition forces were forced to resort to violence in order to enjoy the fruits of power. There are few recent studies of this period of the Republics existence, known as the ‘old’ Republic. Nevertheless, an essay by Vasco Pulido Valente should be consulted , as should the attempt to establish the political, social, and economic context made by M. Villaverde Cabral .     The PRP viewed the outbreak of the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        " as a unique opportunity to achieve a number of goals: putting an end to the twin threats of a Spanish invasion of Portugal and of foreign occupation of the African colonies and, at the internal level, creating a national consensus around the regime and even around the party. Teixeira, 42a These domestic objectives were not met, since participation in the conflict was not the subject of a national consensus and since it did not therefore serve to mobilise the population. Quite the opposite occurred: existing lines of political and ideological fracture were deepened by ": null
    },
    {
        "Portugals intervention in the First World War": "portugal during world war i"
    },
    {
        ". Ribeiro de Meneses, 42 The lack of consensus around Portugals intervention in turn made possible the appearance of two dictatorships, led by General ": null
    },
    {
        "Pimenta de Castro": "pimenta de castro"
    },
    {
        " and ": null
    },
    {
        "Sidónio Pais": "sidónio pais"
    },
    {
        " .     ": null
    },
    {
        "Sidonismo": "sidonismo"
    },
    {
        ", also known as Dezembrismo , aroused a strong interest among historians, largely as a result of the elements of modernity that it contained. José Brandão, 42 Ramalho, 42 Ribeiro de Meneses, 42 Armando Silva, 42 Samara, 42 Santos, 42 António José Telo has made clear the way in which this regime predated some of the political solutions invented by the ": null
    },
    {
        "totalitarian": "totalitarian"
    },
    {
        " and ": null
    },
    {
        "fascist": "fascist"
    },
    {
        " dictatorships of the 42s and 42s. Teixeira, 42 pp. 42–42 Sidónio Pais undertook the rescue of traditional values, notably the Pátria , and attempted to rule in a charismatic fashion.     A move was made to abolish traditional political parties and to alter the existing mode of national representation in parliament  through the creation of a ": null
    },
    {
        "corporative": "corporative"
    },
    {
        " Senate": "senate"
    },
    {
        ", the founding of a single-party , and the attribution of a mobilising function to the leader. The state carved out an economically interventionist role for itself while, at the same time, repressing ": null
    },
    {
        "working-class movements": "working-class movements"
    },
    {
        " and leftist republicans. Sidónio Pais also attempted to restore public order and to overcome some of the rifts of the recent past, making the republic more acceptable to ": null
    },
    {
        "monarchists": "monarchists"
    },
    {
        " and ": null
    },
    {
        "Catholics": "catholics"
    },
    {
        ".         The vacuum of power created by Sidónio Paiss murder Medina, 42 on 42 December 42 led the country to a brief ": null
    },
    {
        "civil war": "civil war"
    },
    {
        ". The monarchys restoration was proclaimed in the north of Portugal  on 42 January 42 and four days later a monarchist insurrection broke out in ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ". A republican coalition government, led by ": null
    },
    {
        "José Relvas": "josé relvas"
    },
    {
        ", coordinated the struggle against the monarchists by loyal army units and armed civilians. After a series of clashes the monarchists were definitively chased from ": null
    },
    {
        "Oporto": "porto"
    },
    {
        " on 42 February 42 This military victory allowed the PRP to return to government and to emerge triumphant from the elections held later that year, having won the usual absolute majority.     It was during this restoration of the ‘old’ republic that an attempted reform was carried out in order to provide the regime with greater stability. In August 42 a conservative president was elected  – ": null
    },
    {
        "António José de Almeida": "antónio josé de almeida"
    },
    {
        "  – and his office was given the power to dissolve parliament. Relations with the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        ", restored by Sidónio Pais, were preserved. The president used his new power to resolve a crisis of government in May 42 naming a ": null
    },
    {
        "Liberal": "liberal party"
    },
    {
        " government to prepare the forthcoming elections.     These were held on 42 July 42 with victory going, as was usually the case, to the party in power. However, Liberal government did not last long. On 42 October a military pronunciamento was carried out during which  – and apparently against the wishes of the coups leaders  – a number of prominent conservative figures, including ": null
    },
    {
        "Prime Minister": "list of prime ministers of portugal"
    },
    {
        " António Granjo": "antónio granjo"
    },
    {
        ", were assassinated. This event, known as the ‘": null
    },
    {
        "night of blood": "bloody night"
    },
    {
        "’ Brandão, 42 left a deep wound among political elites and public opinion. There could be no greater demonstration of the essential fragility of the Republics institutions and proof that the regime was democratic in name only, since it did not even admit the possibility of the rotation in power characteristic of the elitist regimes of the nineteenth century.     A new round of elections on 42 January 42 inaugurated a fresh period of stability: the PRP once again emerged from the contest with an absolute majority. Discontent with this situation had not, however, disappeared. Numerous accusations of corruption, and the manifest failure to resolve pressing social concerns wore down the more visible PRP leaders while making the oppositions attacks more deadly. At the same time, moreover, all political parties suffered from growing internal factionalism, especially the PRP itself. The party system was fractured and discredited. João Silva, 42     This is clearly shown by the fact that regular PRP victories at the ballot box did not lead to stable government. Between 42 and 42 there were forty-five governments. The opposition of ": null
    },
    {
        "presidents": "list of presidents of portugal"
    },
    {
        " to single-party governments, internal dissent within the PRP, the partys almost non-existent internal discipline, and its desire to group together and lead all republican forces made any governments task practically impossible. Many different formulas were attempted, including single-party governments, coalitions, and presidential executives, but none succeeded. Force was clearly the sole means open to the opposition if the PRP wanted to enjoy the fruits of power. Schwartzman, 42 Pinto, 42       Historians have emphasized the failure and collapse of the republican dream by the 42s. Sardica summarizes the consensus of historians:   :within a few years, large parts of the key economic forces, intellectuals, opinion-makers and middle classes changed from left to right, trading the unfulfilled utopia of a developing and civic republicanism for notions of order, stability and security . For many who had helped, supported or simply cheered the Republic in 42 hoping that the new political situation would repair the monarchy’s flaws , the conclusion to be drawn, in the 42s, was that the remedy for national maladies called for much more than the simple removal of the king....The First Republic collapsed and died as a result of the confrontation between raised hopes and meager deeds. José Miguel Sardica, The Memory of the Portuguese First Republic throughout the Twentieth Century E-Journal of Portuguese History 42 pp 42–42      Sardica, however, also points out the permanent impact of the republican experiment:   :Despite its overall failure, the First Republic endowed twentieth-century Portugal with an insurpassable and enduring legacy—a renewed civil law, the basis for an educational revolution, the principle of separation between State and Church, the overseas empire , and a strong symbolic culture whose materializations nobody has dared to alter and which still define the present-day collective identity of the Portuguese. The Republic’s prime legacy was indeed that of memory. José Miguel Sardica, The Memory of the Portuguese First Republic throughout the Twentieth Century                 By the mid42s the domestic and international scenes began to favour another authoritarian solution, wherein a strengthened executive might restore political and social order. Since the oppositions constitutional route to power was blocked by the various means deployed by the PRP to protect itself, it turned to the army for support. The political awareness of the armed forces had grown during the war, and many of their leaders had not forgiven the PRP for sending them to a war they did not want to fight. Ferreira, 42a     They seemed to represent, to conservative forces, the last bastion of ‘order’ against the ‘chaos’ that was taking over the country. Links were established between conservative figures and military officers, who added their own political and corporative demands to the already complex equation. The ": null
    },
    {
        "42 May 42 coup détat": "28 may 1926 coup détat"
    },
    {
        " enjoyed the support of most army units and even of most political parties. As had been the case in December 42 the population of Lisbon did not rise to defend the Republic, leaving it at the mercy of the army.     There are few global and up-to-date studies of this turbulent third phase of the Republics existence. Marques, 42 Telo, 42 Telo, 42 Nevertheless, much has been written about the crisis and fall of the regime and the 42 May movement. Cruz, 42 Cabral, 42 Rosas, 42 Martins, 42 Afonso, 42 The First Republic continues to be the subject of an intense debate. A historiographical balance sheet by Armando Malheiro da Silva identifies three main interpretations. For some historians the First Republic was a progressive and increasingly democratic regime. For others it was essentially a prolongation of the liberal and elitist regimes of the 42th century. A third group chooses to highlight the regimes revolutionary, Jacobin and dictatorial nature.                 Political chaos, several strikes, harsh relations with the Church, and considerable economic problems aggravated by a disastrous ": null
    },
    {
        "military intervention in the First World War": "portugal in the great war"
    },
    {
        " led to the military ": null
    },
    {
        "42 May 42 coup détat": "28 may 1926 coup détat"
    },
    {
        ". This coup installed the Second Republic , which started as the  Ditadura Nacional  and became the  Estado Novo  in 42 led by economist ": null
    },
    {
        "António de Oliveira Salazar": "antónio de oliveira salazar"
    },
    {
        ". He transformed Portugal into a sort of ": null
    },
    {
        "Fascist": "fascist"
    },
    {
        " regime that evolved into a single-party ": null
    },
    {
        "corporative": "corporatismfascist corporatism"
    },
    {
        " regime. Portugal, although neutral, informally aided the Nationalists in the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        " .     Salazars policy after the war was to provide a certain level of ": null
    },
    {
        "liberalization": "liberalization"
    },
    {
        " in politics, in terms of organized opposition with more ": null
    },
    {
        "freedom of the press": "freedom of the press"
    },
    {
        ". Opposition parties were tolerated to an extent, but they were also controlled, limited, and manipulated, with the result that they split into factions and never formed a united opposition. Dawn L. Raby, Controlled, Limited and Manipulated Opposition Under a Dictatorial Regime: Portugal, 42–42 European History Quarterly 42 pp. 42–42        Portugal was ": null
    },
    {
        "officially neutral in World War II": "diplomatic history of world war ii"
    },
    {
        ", but in practice Salazar collaborated with the British and sold them rubber and tungsten. William Gervase Clarence-Smith, The Portuguese Empire and the Battle for Rubber in the Second World War, Portuguese Studies Review , 42 pp. 42–42 In late 42 he allowed the Allies to establish air bases in the Azores to fight German U-boats. Moreover, Salazar helped Spain avoid German control. However, as Tungsten was a major product of Portugal, it was also sold to Germany until June 42 when the threat of a German attack on Portugal was minimal. Douglas L. Wheeler, The Price of Neutrality: Portugal, the Wolfram Question, and World War II, Luso-Brazilian Review 42 pp. 42–42 and 42 pp. 42–42 Salazar worked to regain control of ": null
    },
    {
        "East Timor": "east timor"
    },
    {
        " after the Japanese had seized it. Sonny B. Davis, Salazar, Timor, and Portuguese Neutrality in World War II, Portuguese Studies Review 42 pp. 42–42 Also, he admitted several thousand Jewish refugees during the war. Lisbon, maintaining air connections with Britain and the U.S., became a hotbed of spies of several war parties and served as the base for the International Red Cross in its distribution of relief supplies to POWs.         In 42 the Portuguese army was involved in armed action in its colony in Goa against an Indian invasion . The operations resulted in a Portuguese defeat and the loss of the colonies in ": null
    },
    {
        "India": "india"
    },
    {
        ". Independence movements also became active in ": null
    },
    {
        "Portuguese Angola": "portuguese angola"
    },
    {
        ", ": null
    },
    {
        "Portuguese Mozambique": "portuguese mozambique"
    },
    {
        " and ": null
    },
    {
        "Portuguese Guinea": "portuguese guinea"
    },
    {
        "; the ": null
    },
    {
        "Portuguese Colonial War": "portuguese colonial war"
    },
    {
        " started. Some 42 Africans died in the conflict. Clodfelter 42: 42 Portugal, during this period, was never an outcast, and was a founding member of the ": null
    },
    {
        "North Atlantic Treaty Organization": "north atlantic treaty organization"
    },
    {
        " , the ": null
    },
    {
        "Organisation for Economic Co-operation and Development": "organisation for economic co-operation and development"
    },
    {
        " and the ": null
    },
    {
        "European Free Trade Association": "european free trade association"
    },
    {
        " .     After the death of Salazar in 42 his replacement by ": null
    },
    {
        "Marcelo Caetano": "marcelo caetano"
    },
    {
        " offered a certain hope that the regime would open up, the primavera marcelista . However the colonial wars in Africa continued, ": null
    },
    {
        "political prisoner": "political prisoner"
    },
    {
        "s remained incarcerated, freedom of association was not restored, ": null
    },
    {
        "censorship": "censorship"
    },
    {
        " was only slightly eased and the ": null
    },
    {
        "election": "election"
    },
    {
        "s remained tightly controlled.     The regime retained its characteristic traits: censorship, corporativeness, with a market economy dominated by a handful of economical groups, continuous surveillance and intimidation of several sectors of society through the use of a political police and techniques instilling fear .            The ": null
    },
    {
        "Carnation Revolution": "carnation revolution"
    },
    {
        " of April 42 42 an effectively bloodless left-wing military coup, installed the Third Republic . Broad democratic reforms were implemented.     The  Processo Revolucionário Em Curso   was the tumultuous period during the ": null
    },
    {
        "Portuguese transition to democracy": "portuguese transition to democracy"
    },
    {
        ". It started after a failed right-wing coup détat on March 42 42 and ended after a ": null
    },
    {
        "failed left-wing coup détat on November 42 42": "coup of 25 november 1975"
    },
    {
        ". This period was marked by political turmoil, violence, and instability, and the nationalization of industries. Portugal was polarized between the conservative north, with its many independent small farmers, and the radical south, where communists helped peasants seize control of large estates. Finally, in the ": null
    },
    {
        "42 legislative election": "1976 portuguese legislative election"
    },
    {
        ", the ": null
    },
    {
        "Socialist Party": "socialist party"
    },
    {
        " came in first in elections and its leader ": null
    },
    {
        "Mário Soares": "mário soares"
    },
    {
        " formed Portugals first democratically-elected government in nearly a half century.      The ": null
    },
    {
        "Social Democratic Party": "social democratic party"
    },
    {
        " and its center-right allies under Prime Minister ": null
    },
    {
        "Aníbal Cavaco Silva": "aníbal cavaco silva"
    },
    {
        " gained control of parliament in 42 and 42 while the Socialist Party and its allies succeeded in the 42 presidential election to retain the presidency for its popular leader Mario Soares.        In 42 Portugal granted independence to its ": null
    },
    {
        "Overseas Provinces": "portuguese empire"
    },
    {
        "  in Africa . Nearly 42 million Portuguese or persons of Portuguese descent left these former colonies as refugees. , Eric Solsten, ed. Portugal: A Country Study. Washington: GPO for the Library of Congress, 42 In 42 ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        " invaded and annexed the Portuguese province of ": null
    },
    {
        "Portuguese Timor": "portuguese timor"
    },
    {
        " in Asia before independence could be granted. The massive exodus of the Portuguese military and citizens from Angola and Mozambique, would prompt an era of chaos and severe destruction in those territories after independence from Portugal in 42 From May 42 to the end of the 42s, over a million Portuguese citizens from Portugals African territories left those territories as destitute refugees  – the retornados. , ": null
    },
    {
        "The Economist": "the economist"
    },
    {
        " . ,  Time  .     The newly independent countries were ravaged by brutal civil wars in the following decades—the ": null
    },
    {
        "Angolan Civil War": "angolan civil war"
    },
    {
        " and ": null
    },
    {
        "Mozambican Civil War": "mozambican civil war"
    },
    {
        " —responsible for millions of deaths and refugees. The Asian dependency of ": null
    },
    {
        "Macau": "portuguese macau"
    },
    {
        ", after an agreement in 42 was returned to Chinese sovereignty in 42 Portugal applied international pressure to secure East Timors independence from Indonesia, as East Timor was still legally a Portuguese dependency, and recognized as such by the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ". After a referendum in 42 East Timor voted for independence, which Portugal recognized in 42     With the 42–42 independence of its colonies , the 42-year-old ": null
    },
    {
        "Portuguese Empire": "portuguese empire"
    },
    {
        " effectively ended. Simultaneously, 42 years of war effort also came to an end; many Portuguese returned from the colonies  and came to comprise a ": null
    },
    {
        "sizeable proportion of the population": "demographics of portugalvital statistics since 1900"
    },
    {
        ": approximately 42 of Portugals 42 million citizens in 42  This opened new paths for the countrys future just as others closed. In 42 Portugal entered the ": null
    },
    {
        "European Economic Community": "european economic community"
    },
    {
        " and left the ": null
    },
    {
        "European Free Trade Association": "european free trade association"
    },
    {
        " which had been founded by Portugal and its partners in 42 The country joined the euro in 42 The Portuguese Empire ended de facto in 42 when Macau was returned to China, and de jure in 42 when ": null
    },
    {
        "East Timor": "east timor"
    },
    {
        " became independent.          Economic development was one of the major objectives of the Carnation Revolution and it was widely perceived that the new democracy would have the same unfortunate fate of the previous democratic regimes in Portugal  if, like them, it failed to provide economic development and decent standards of living to its citizens.  Relative to Western Europe, Portugal remained stagnant for most of the  Estado Novo  regime , but the modernization of the economy and development of the country still started in the last years of the regime, with a period of strong growth from 42 to 42 However, the gap between Portugal and most of Western Europe was still abysmal by mid42s. Overall, the Third Republic gave continuity to the growth started in the 42s and was marked by a major socio-economic development . ": null
    },
    {
        "GDP per capita": "gdp per capita"
    },
    {
        " rose from 42% of ": null
    },
    {
        "EC": "european economic community"
    },
    {
        "42 average in 42  to 42% in 42 which nonetheless represented an approach to the Western European standards of living without precedents in the previous centuries. Concurrent with the economic development, the Third Republic also witnessed major improvements in health, education, infrastructure, housing and welfare.  However, as of 42 Portugal still has not converged with the most advanced economies of Central and Northern Europe, as the economy has been stagnant since the early 42s.     In order to understand the economic lag of Portugal, it is worthwhile to note that — overall — the Portuguese economy declined in the centuries following the end of the ": null
    },
    {
        "Age of Discoveries": "portuguese discoveries"
    },
    {
        "  and neither the ": null
    },
    {
        "Constitutional Monarchy": "history of portugal"
    },
    {
        " nor the ": null
    },
    {
        "First Republic": "portuguese first republic"
    },
    {
        " were able to put the country in the path to ": null
    },
    {
        "industrializion": "industrial revolution"
    },
    {
        " and development. While ": null
    },
    {
        "António de Oliveira Salazar": "antónio de oliveira salazar"
    },
    {
        " managed to discipline the Portuguese ": null
    },
    {
        "public finances": "public finances"
    },
    {
        " in the 42s, the first three decades of the  Estado Novo  regime were also marked by a relative stagnation and underdevelopment. While Western world enjoyed ": null
    },
    {
        "strong economic growth": "post–world war ii economic expansion"
    },
    {
        ", Portugal remained behind.  As such, by 42 the Portuguese GDP per capita was only 42 percent of the ": null
    },
    {
        "EC": "european economic community"
    },
    {
        "42 average,   and Portugal was one the most backward countries in Europe.  However, things started to change in the late Estado Novo: starting in the early 42s, Portugal entered in a period of robust economic growth and structural modernization, owing to a liberalization of the economy and the rise of a new elite .  , Nos anos 42 e até 42 teve lugar, provavelmente, o mais rápido período de crescimento económico da nossa História, traduzido na industrialização, na expansão do turismo, no comércio com a EFTA, no desenvolvimento dos sectores financeiros, investimento estrangeiro e grandes projectos de infra-estruturas. Em consequência, os indicadores de rendimentos e consumo acompanham essa evolução, reforçados ainda pelas remessas de emigrantes. , ": null
    },
    {
        "SEDES": "sedes"
    },
    {
        "  As an expression of such economic opening, in 42 Portugal was one of the ": null
    },
    {
        "EFTA": "efta"
    },
    {
        " founding member states. Such remarkable growth period allowed the Portuguese GDP per capita to reach 42% of the EC42 average by 42 In the early 42s, the government of ": null
    },
    {
        "Marcelo Caetano": "marcelo caetano"
    },
    {
        " paved some foundations for a ": null
    },
    {
        "welfare state": "welfare state"
    },
    {
        " , with reforms in health and education . However, the new wealth acquired from the 42–42 growth was unevenly distributed, and the 42s were also marked by mass emigration.  The April 42 42 revolution happened when this growth period was fading, owing to the ": null
    },
    {
        "42 oil crisis": "1973 oil crisis"
    },
    {
        ". However, the political turmoil following the ": null
    },
    {
        "April 42 42 coup": "25 de abril"
    },
    {
        "  definitively led to the end of such economic growth period. Portugal lost suddenly and chaotically its African possessions and from May 42 to the end of the 42s, over a million Portuguese citizens from Portugals African territories left those territories and arrived at metropolitan Portugal as destitute refugees  – the retornados. The first 42 years of the Third Republic, in the context of the ": null
    },
    {
        "transition to democracy": "portuguese transition to democracy"
    },
    {
        ", were years of economic troubles, during which Portugal received two ": null
    },
    {
        "IMF": "international monetary fund"
    },
    {
        "-monitored bailouts . However, despite an overall crisis from 42 to 42 there were some years of very high economic growth, and reforms were enacted that allowed to improve standards of living and level of development, such as the construction of a true Social Security scheme, ": null
    },
    {
        "universal health coverage": "healthcare in portugal"
    },
    {
        " and the continuation of the process of ": null
    },
    {
        "increasing access to education": "education in portugalhistory"
    },
    {
        ".  In 42 Portugal leaved the second IMF bailout and in 42 the country entered the ": null
    },
    {
        "European Economic Community": "european economic community"
    },
    {
        " . Strong economic growth resumed. The growth of many of Portugals main exporting companies  and the European Unions ": null
    },
    {
        "structural and cohesion funds": "structural and cohesion funds"
    },
    {
        " were leading forces in a new period of robust economic growth and socio-economic development which would last  to the early 42s. In 42 GDP per capita surpassed the 42 level and by 42 it had achieved 42% of the EU42 average, which nonetheless constituted an approach to the Western European ": null
    },
    {
        "standards of living": "standards of living"
    },
    {
        " without precedents in the centuries before.  However, the ": null
    },
    {
        "economy": "economy of portugal"
    },
    {
        " has been stagnant since the early 42s  and was hit hard by the effects of the ": null
    },
    {
        "Great Recession": "great recession"
    },
    {
        ": public debt  shot up from 42% of GDP in 42 to 42% in 42  which was one of the factors that led to a 42-billion-euro ": null
    },
    {
        "IMF/EU-monitored bailout from 42 to 42": "economic adjustment programme for portugal"
    },
    {
        ". Economic growth seem to have resumed in mid42s.     Some indicators can be provided to illustrate the major socio-economic development Portugal endured in the Third Republic. Portuguese GDP per capita was at 42% of the average of Northern and Central European countries in 42  more or less the same level it was 42 years later , from when it rose from 42% in 42  to a virtually unprecedented 42% in 42 In 42 there were 42 physicians by 42 inhabitants, while in 42 there were 42 and in 42 there were 42  In 42 ": null
    },
    {
        "infant mortality rate": "infant mortality rate"
    },
    {
        " in Portugal was 42 per 42 live births .  Infant mortality rate declined to 42 in 42 and 42 in 42 . In 42 only 42% of ": null
    },
    {
        "deliveries": "childbirth"
    },
    {
        " were held in official health facilities, while by 42 such number had rosen to 42% and by 42 it was close to 42%.  According to a political analyst, almost all health data transport Portugal from the Third World to the First in two decades . In 42 only 42% of teenagers were enrolled in high school; such number rose to 42% in 42 42% in 42 and 42% in 42  The ": null
    },
    {
        "illiteracy rate": "illiteracy rate"
    },
    {
        " was 42% in 42 and declined to 42% in 42 and 42% in 42  In housing, major improvements happened: in 42 only 42% of households had piped ": null
    },
    {
        "water supply": "water supply"
    }
]