[
    {
        "          The history of modern Greece covers the history of ": null
    },
    {
        "Greece": "Greece"
    },
    {
        " from the recognition of its autonomy from the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        " by the Great Powers in 1828, after the ": null
    },
    {
        "Greek War of Independence": "Greek War Of Independence"
    },
    {
        ", to the present day.          The ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        " had ruled most of the Greek-speaking world since late Antiquity, but experienced a decline as a result of ": null
    },
    {
        "Muslim Arab": "Early Muslim Conquests"
    },
    {
        " and ": null
    },
    {
        "Seljuk Turkish": "Seljuk Empire"
    },
    {
        " invasions and was fatally weakened by the ": null
    },
    {
        "sacking of Constantinople": "Fourth Crusade"
    },
    {
        " by the ": null
    },
    {
        "Latin Crusaders": "Fourth Crusade"
    },
    {
        " in 1204. The establishment of Catholic ": null
    },
    {
        "Latin states": "Latinokratia"
    },
    {
        " on Greek soil, and the struggles of the Orthodox ": null
    },
    {
        "Byzantine Greeks": "Byzantine Greeks"
    },
    {
        " against them, led to the emergence of a distinct Greek national identity. The Byzantine Empire was restored by the ": null
    },
    {
        "Palaiologos": "Palaiologos"
    },
    {
        " dynasty in 1261, but it was a shadow of its former self, and constant civil wars and foreign attacks in the 14th century brought about its terminal decline. As a result, most of Greece gradually became part of the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        " in the late 14th and early 15th century, culminating in the ": null
    },
    {
        "Fall of Constantinople": "Fall Of Constantinople"
    },
    {
        " in 1453, the conquest of the ": null
    },
    {
        "Duchy of Athens": "Duchy Of Athens"
    },
    {
        " in 1458, and of the ": null
    },
    {
        "Despotate of the Morea": "Despotate Of The Morea"
    },
    {
        " in 1460.          Ottoman control was largely absent in the mountainous interior of Greece, and many fled there, often becoming brigands.  Otherwise, only the islands of the Aegean and a few coastal fortresses on the mainland, under ": null
    },
    {
        "Venetian": "Republic Of Venice"
    },
    {
        " and ": null
    },
    {
        "Genoese": "Republic Of Genoa"
    },
    {
        " rule, remained free from Ottoman rule, but by the mid-16th century, the Ottomans had conquered most of them as well. ": null
    },
    {
        "Rhodes": "Rhodes"
    },
    {
        " fell": "Siege Of Rhodes"
    },
    {
        " in 1522, ": null
    },
    {
        "Cyprus": "Cyprus"
    },
    {
        " in 1571, and the Venetians retained ": null
    },
    {
        "Crete": "Crete"
    },
    {
        " until 1670. The ": null
    },
    {
        "Ionian Islands": "Ionian Islands"
    },
    {
        " were only briefly ruled by the Ottomans , and remained primarily under the rule of Venice.     The first large-scale insurrection against Ottoman rule was the ": null
    },
    {
        "Orlov Revolt": "Orlov Revolt"
    },
    {
        " of the early 1770s, but it was brutally repressed. The same time, however, also marks the start of the ": null
    },
    {
        "Modern Greek Enlightenment": "Modern Greek Enlightenment"
    },
    {
        ", as Greeks who studied in Western Europe brought knowledge and ideas back to their homeland, and as Greek merchants and shipowners increased their wealth. As a result, especially in the aftermath of the ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        ", liberal and nationalist ideas began to spread across the Greek lands.     In 1821, the Greeks ": null
    },
    {
        "rose up": "Greek War Of Independence"
    },
    {
        " against the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        ". Initial successes were followed by infighting, which almost caused the Greek struggle to collapse; nevertheless, the prolongation of the fight forced the Great Powers to recognize the claims of the Greek rebels to separate statehood  and intervene against the Ottomans at the ": null
    },
    {
        "Battle of Navarino": "Battle Of Navarino"
    },
    {
        ". Greece was initially to be an ": null
    },
    {
        "autonomous": "Autonomous"
    },
    {
        " state under Ottoman ": null
    },
    {
        "suzerainty": "Suzerainty"
    },
    {
        ", but by 1832, in the ": null
    },
    {
        "Treaty of Constantinople": "Treaty Of Constantinople"
    },
    {
        ", it was recognized as a fully independent kingdom. In the meantime, the ": null
    },
    {
        "3rd National Assembly": "Third National Assembly At Troezen"
    },
    {
        " of the Greek insurgents called upon ": null
    },
    {
        "Ioannis Kapodistrias": "Ioannis Kapodistrias"
    },
    {
        ", a former foreign minister of Russia, to take over the governance of the fledgling state in 1827.            On his arrival, Kapodistrias launched a major reform and modernisation programme that covered all areas. He re-established military unity by bringing an end to the second phase of the civil war; re-organised the military, which was then able to reconquer territory lost to the Ottoman military during the civil wars; and introduced the first modern ": null
    },
    {
        "quarantine": "Quarantine"
    },
    {
        " system in Greece, which brought diseases such as ": null
    },
    {
        "typhoid fever": "Typhoid Fever"
    },
    {
        ", ": null
    },
    {
        "cholera": "Cholera"
    },
    {
        " and ": null
    },
    {
        "dysentery": "Dysentery"
    },
    {
        " under control for the first time since the start of the War of Independence.     Kapodistrias also negotiated with the Great Powers and the Ottoman Empire to establish the borders and degree of independence of the Greek state; signed the peace treaty that ended the War of Independence with the Ottomans; introduced the  phoenix , the first modern Greek currency; organised local administration; and, in an effort to raise the living standards of the population, introduced the cultivation of the ": null
    },
    {
        "potato": "Potato"
    },
    {
        " into Greece.          Furthermore, he tried to undermine the authority of the traditional clans that he considered the useless legacy of a bygone and obsolete era. John S. Koliopoulos, Brigands with a Cause: Brigandage and Irredentism in Modern Greece, 1821–1912, Clarendon Press Oxford , p. 67. However, he underestimated the political and military strength of the capetanei who had led the revolt against ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        " in 1821, and who had expected a leadership role in the post-revolution Government. When a dispute between the capetanei of ": null
    },
    {
        "Laconia": "Laconia"
    },
    {
        " and the appointed governor of the province escalated into an armed conflict, he called in Russian troops to restore order, because much of the army was controlled by capetanei who had been part of the rebellion.     George Finlays 1861 History of Greek Revolution records that by 1831 Kapodistriass government had become hated, chiefly by the independent ": null
    },
    {
        "Maniots": "Maniots"
    },
    {
        ", but also by the ": null
    },
    {
        "Roumeliotes": "Roumeliotes"
    },
    {
        " and the rich and influential merchant families of ": null
    },
    {
        "Hydra": "Hydra Island"
    },
    {
        ", ": null
    },
    {
        "Spetses": "Spetses"
    },
    {
        " and ": null
    },
    {
        "Psara": "Psara"
    },
    {
        ". The customs dues of the inhabitants of Hydra were the chief source of revenue for these municipalities, and they refused to hand these over to Kapodistrias. It appears that Kapodistrias had refused to convene the National Assembly and was ruling as a despot, possibly influenced by his Russian experiences. The municipality of Hydra instructed Admiral ": null
    },
    {
        "Miaoulis": "Andreas Vokos Miaoulis"
    },
    {
        " and ": null
    },
    {
        "Alexandros Mavrokordatos": "Alexandros Mavrokordatos"
    },
    {
        " to go to ": null
    },
    {
        "Poros": "Poros"
    },
    {
        " and seize the Hellenic Navys fleet there. This Miaoulis did so with the intention of preventing a blockade of the islands, so for a time it seemed as if the National Assembly would be called.     Kapodistrias called on the British and French residents to support him in putting down the rebellion, but this they refused to do. Nonetheless, an Admiral ": null
    },
    {
        "Rikord ": "Pyotr Ivanovich Ricord"
    },
    {
        " took his ships north to Poros. Colonel Kallergis took a half-trained force of Greek Army regulars and a force of irregulars in support. With less than 200 men, Miaoulis was unable to make much of a fight; Fort Heidek on ": null
    },
    {
        "Bourtzi": "Bourtzi"
    },
    {
        " Island was overrun by the regulars and the brig Spetses  sank by Ricords force. Encircled by the Russians in the harbor and Kallergis force on land, Poros surrendered. Miaoulis was forced to set charges in the flagship Hellas and the corvette Hydra to blow them up when he and his handful of followers returned to Hydra. Kallergis men were enraged by the loss of the ships and sacked Poros, carrying off plunder to Nauplion.     The loss of the best ships in the fleet crippled the Hellenic Navy for many years, but it also weakened Kapodistrias position. He did finally call the National Assembly, but his other actions triggered more opposition and that led to his downfall.                  In 1831, Kapodistrias ordered the imprisonment of ": null
    },
    {
        "Petrobey Mavromichalis": "Petros Mavromichalis"
    },
    {
        ", the ": null
    },
    {
        "Bey": "Bey"
    },
    {
        " of the ": null
    },
    {
        "Mani Peninsula": "Mani Peninsula"
    },
    {
        ", one of the wildest and most rebellious parts of Greece. This was a mortal offence to the Mavromichalis family, and on 9 October 1831  Kapodistrias was assassinated by Petros brother ": null
    },
    {
        "Konstantis": "Konstantinos Mavromichalis"
    },
    {
        " and son ": null
    },
    {
        "Georgios": "Georgios Mavromichalis"
    },
    {
        " on the steps of the church of ": null
    },
    {
        "Saint Spyridon": "Saint Spyridon"
    },
    {
        " in ": null
    },
    {
        "Nafplio": "Nafplio"
    },
    {
        ".     Ioannis Kapodistrias was succeeded as Governor by his younger brother, ": null
    },
    {
        "Augustinos Kapodistrias": "Augustinos Kapodistrias"
    },
    {
        ". Augustinos ruled only for six months, during which the country was very much plunged into chaos. Under the protocol signed at the ": null
    },
    {
        "London Conference of 1832": "London Conference Of 1832"
    },
    {
        " on 7 May 1832 between ": null
    },
    {
        "Bavaria": "Bavaria"
    },
    {
        " and the protecting Powers, Greece was defined as an independent kingdom, free of Ottoman control, with the Arta-Volos line as its northern frontier. The protocol also dealt with the way in which a Regency was to be managed until ": null
    },
    {
        "Otto of Bavaria": "Otto Of Greece"
    },
    {
        " reached his majority to assume the throne of Greece. The Ottoman Empire was indemnified in the sum of 40,000,000 piastres for the loss of territory in the new kingdom.               Ottos reign would prove troubled, but he managed to hang on for 30 years before he and his wife, ": null
    },
    {
        "Queen Amalia": "Queen Amalia Of Greece"
    },
    {
        ", left the same way they came, aboard a British warship. During the early years of his reign, a group of ": null
    },
    {
        "Bavaria": "Bavaria"
    },
    {
        "n Regents ruled in his name, and they made themselves very unpopular by trying to impose German ideas of rigid hierarchical government on the Greeks, while keeping most significant state offices away from them. Nevertheless, they laid the foundations of a Greek administration, army, justice system and education system. Otto was sincere in his desire to give Greece good government, but he suffered from two great handicaps: his ": null
    },
    {
        "Roman Catholic": "Roman Catholic"
    },
    {
        " faith and his childless marriage to ": null
    },
    {
        "Queen Amalia": "Queen Amalia Of Greece"
    },
    {
        ". This meant he could neither be crowned as King of Greece under the Orthodox rite nor establish a dynasty.     The Bavarian Regents ruled until 1837, when they were recalled at the insistence of ": null
    },
    {
        "Britain": "United Kingdom"
    },
    {
        " and ": null
    },
    {
        "France": "France"
    },
    {
        ". Otto thereafter appointed Greek ministers, although Bavarian officials still ran most of the administration and the army. At this time, Greece still had no legislature and no constitution. Discontent grew until the ": null
    },
    {
        "3 September 1843 Revolution": "3 September 1843 Revolution"
    },
    {
        " broke out in ": null
    },
    {
        "Athens": "Athens"
    },
    {
        ". Otto agreed to grant a constitution and convened a National Assembly that met in November of the same year. The ": null
    },
    {
        "Greek Constitution of 1844": "Greek Constitution Of 1844"
    },
    {
        " then created a ": null
    },
    {
        "bicameral parliament": "Bicameralism"
    },
    {
        " consisting of an Assembly  and a Senate . Power then passed into the hands of a group of Greek politicians, most of whom who had been commanders in the War of Independence against the Ottomans.     Greek politics in the 19th century was dominated by the national question. The majority of Greeks continued to live under Ottoman rule, and Greeks dreamed of liberating them all and reconstituting a state embracing all the Greek lands, with ": null
    },
    {
        "Constantinople": "Constantinople"
    },
    {
        " as its capital. This was called the Great Idea , and it was sustained by almost continuous rebellions against Ottoman rule in Greek-speaking territories, particularly ": null
    },
    {
        "Crete": "Crete"
    },
    {
        ", ": null
    },
    {
        "Thessaly": "Thessaly"
    },
    {
        " and ": null
    },
    {
        "Macedonia": "Macedonia"
    },
    {
        ".     When the ": null
    },
    {
        "Crimean War": "Crimean War"
    },
    {
        " broke out in 1854, Greece saw an opportunity to gain Ottoman-controlled territory that had large Greek populations. Greece, an Orthodox nation, had considerable support in Russia, but the Russian government decided it was too dangerous to help Greece expand its holdings. Orlando Figes, The Crimean War": null
    }
]