[
    {
        "           The ": null
    },
    {
        "Thai people": "Thai People"
    },
    {
        ", who originally lived in ": null
    },
    {
        "Khmer empire": "Khmer Empire"
    },
    {
        ", migrated into ": null
    },
    {
        "mainland Southeast Asia": "Mainland Southeast Asia"
    },
    {
        " over a period of many centuries. The word Siam  may have originated from ": null
    },
    {
        "Pali": "Pali"
    },
    {
        "  or ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " श्याम  or ": null
    },
    {
        "Mon": "Mon Language"
    },
    {
        " ရာမည , probably the same root as ": null
    },
    {
        "Shan": "Shan People"
    },
    {
        " and ": null
    },
    {
        "Ahom": "Ahom People"
    },
    {
        ".  was the name for the northern kingdom centred on ": null
    },
    {
        "Sukhothai": "Sukhothai Province"
    },
    {
        " and ": null
    },
    {
        "Sawankhalok": "Sawankhalok District"
    },
    {
        ", but to the Thai themselves, the name of the country has always been ": null
    },
    {
        "Mueang Thai": "Mueangthailand"
    },
    {
        ".      The countrys designation as Siam by Westerners likely came from the ": null
    },
    {
        "Portuguese": "Portuguese People"
    },
    {
        ". Portuguese chronicles noted that the ": null
    },
    {
        "Borommatrailokkanat": "Borommatrailokkanat"
    },
    {
        ", king of the ": null
    },
    {
        "Ayutthaya Kingdom": "Ayutthaya Kingdom"
    },
    {
        ", ": null
    },
    {
        "sent an expedition": "Borommatrailokkanatexpedition To Malacca"
    },
    {
        " to the ": null
    },
    {
        "Malacca Sultanate": "Malacca Sultanate"
    },
    {
        " at the southern tip of the ": null
    },
    {
        "Malay Peninsula": "Malay Peninsula"
    },
    {
        " in 1455. Following their ": null
    },
    {
        "conquest of Malacca": "Portuguese Malacca"
    },
    {
        " in 1511, the Portuguese sent a diplomatic mission to Ayutthaya. A century later, on 15 August 1612, The Globe, an ": null
    },
    {
        "East India Company": "East India Company"
    },
    {
        " merchantman bearing a letter from ": null
    },
    {
        "King James I": "James Vi And I"
    },
    {
        ", arrived in the ": null
    },
    {
        "Road": "Roadstead"
    },
    {
        " of Syam .   By the end of the 19th century, Siam had become so enshrined in geographical nomenclature that it was believed that by this name and no other would it continue to be known and styled.      ": null
    },
    {
        "Indianised kingdoms": "Indianised Kingdom"
    },
    {
        "such as the ": null
    },
    {
        "Mon": "Mon Kingdoms"
    },
    {
        ", the ": null
    },
    {
        "Khmer Empire": "Khmer Empire"
    },
    {
        " and Malay states of the Malay Peninsula and ": null
    },
    {
        "Sumatra": "Sumatra"
    },
    {
        " had ruled the region. The ": null
    },
    {
        "Thai": "Thai People"
    },
    {
        " established their own states: ": null
    },
    {
        "Ngoenyang": "Ngoenyang"
    },
    {
        ", the ": null
    },
    {
        "Sukhothai Kingdom": "Sukhothai Kingdom"
    },
    {
        ", the ": null
    },
    {
        "Kingdom of Chiang Mai": "Kingdom Of Chiang Mai"
    },
    {
        ", ": null
    },
    {
        "Lan Na": "Lan Na"
    },
    {
        ", and the Ayutthaya Kingdom. These states fought each other and were under constant threat from the ": null
    },
    {
        "Khmers": "Khmers"
    },
    {
        ", Burma and ": null
    },
    {
        "Vietnam": "Vietnam"
    },
    {
        ". Much later, the European colonial powers threatened in the 19th and early 20th centuries, but Thailand survived as the only Southeast Asian state to avoid European colonial rule because of centralising reforms enacted by King ": null
    },
    {
        "Chulalongkorn": "Chulalongkorn"
    },
    {
        " and because the French and the British decided it would be a ": null
    },
    {
        "neutral territory": "Neutral Territory"
    },
    {
        " to avoid conflicts between their colonies. After the end of the absolute monarchy in 1932, Thailand endured sixty years of almost permanent military rule before the establishment of a democratically elected-government system. In 2014 ": null
    },
    {
        "there was yet another coup détat": "2014 Thai Coup"
    },
    {
        ".          Prior to the southwards ": null
    },
    {
        "migration": "Human Migration"
    },
    {
        " of the ": null
    },
    {
        "Tai peoples": "Tai Peoples"
    },
    {
        " from ": null
    },
    {
        "Yunnan": "Yunnan"
    },
    {
        " in the 10th century, ": null
    },
    {
        "mainland Southeast Asia": "Mainland Southeast Asia"
    },
    {
        " had been a home to various indigenous communities for thousands of years. The discovery of ": null
    },
    {
        "Homo erectus": "Homo Erectus"
    },
    {
        " fossils such as ": null
    },
    {
        "Lampang man": "Prehistoric Thailand"
    },
    {
        " is an example of archaic hominids. The remains were first discovered during excavations in ": null
    },
    {
        "Lampang Province": "Lampang Province"
    },
    {
        ". The finds have been dated from roughly 1,000,000–500,000 years ago in the ": null
    },
    {
        "Pleistocene": "Pleistocene"
    },
    {
        ". Stone artefacts dating to 40,000 years ago have been recovered from, e.g., ": null
    },
    {
        "Tham Lod rockshelter": "Tham Lod Rockshelter"
    },
    {
        " in ": null
    },
    {
        "Mae Hong Son": "Mae Hong Son"
    },
    {
        " and Lang Rongrien Rockshelter in Krabi, peninsular Thailand. Anderson, D. 1990. Lang Rongrien Rockshelter: A Pleistocene–early Holocene Archaeological Site from Krabi, Southwestern Thailand. Philadelphia: The University Museum, University of Pennsylvania. The archaeological data between 18,000–3,000 years ago primarily derive from cave and rock shelter sites, and are associated with ": null
    },
    {
        "Hoabinhian": "Hoabinhian"
    },
    {
        " foragers. Lekenvall, Henrik. Late Stone Age Communities in the Thai-Malay Peninsula . Journal of Indo-Pacific Archaeology 32 : 78–86.               There are many sites in Thailand dating to the Bronze and Iron Ages . The most thoroughly researched of these sites are in the countrys northeast, especially in the ": null
    },
    {
        "Mun": "Mun River"
    },
    {
        " and ": null
    },
    {
        "Chi River": "Chi River"
    },
    {
        " valleys. The Mun River in particular is home to many moated sites composed of mounds surrounded by ditches and ramparts. The mounds contain evidence of prehistoric occupation.     Around the first century, according to ": null
    },
    {
        "epigraphy": "Epigraphy"
    },
    {
        " of the ": null
    },
    {
        "Kingdom of Funan": "Kingdom Of Funan"
    },
    {
        " and the records of Chinese historians, a number of trading settlements of the south appear to have been organised into several Malay states, among the earliest of which are believed to be ": null
    },
    {
        "Langkasuka": "Langkasuka"
    },
    {
        " and ": null
    },
    {
        "Tambralinga": "Tambralinga"
    },
    {
        ". Some trading settlements show evidence of trade with the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        ": a Roman gold coin showing Roman emperor ": null
    },
    {
        "Antoninus Pius": "Antoninus Pius"
    },
    {
        " has been found in southern Thailand.       Prior to the arrival of the Thai people and culture into what is now Thailand, the region hosted a number of indigenous ": null
    },
    {
        "Austroasiatic-speaking": "Austroasiatic Languages"
    },
    {
        " and ": null
    },
    {
        "Malayo-Sumbawan-speaking": "Malayo-Sumbawan Languages"
    },
    {
        " civilisations. However, little is known about Thailand before the 13th century, as the literary and concrete sources are scarce and most of the knowledge about this period is gleaned from archaeological evidence. Similar to other regions in Southeast Asia, Thailand was heavily influenced by the culture and religions of India, starting with the Kingdom of Funan around the first century until the Khmer Empire. . Encyclop?dia Britannica Online Indian influence on Siamese culture was partly the result of direct contact with Indian settlers, but mainly it was brought about indirectly via the Indianised kingdoms of ": null
    },
    {
        "Dvaravati": "Dvaravati"
    },
    {
        ", ": null
    },
    {
        "Srivijaya": "Srivijaya"
    },
    {
        " and the Khmer Empire. Some Aspects of Asian History and Culture by Upendra Thakur p.157 E. A. Voretzsch believes that Buddhism must have been flowing into Thailand from India at the time of the Indian emperor ": null
    },
    {
        "Ashoka": "Ashoka"
    },
    {
        " of the ": null
    },
    {
        "Maurya Empire": "Maurya Empire"
    },
    {
        " and into the first millennium. Later Thailand was influenced by the south Indian ": null
    },
    {
        "Pallava dynasty": "Pallava Dynasty"
    },
    {
        " and north Indian ": null
    },
    {
        "Gupta Empire": "Gupta Empire"
    },
    {
        ".             The ": null
    },
    {
        "Chao Phraya River": "Chao Phraya River"
    },
    {
        " in what is now central Thailand had once been the home of the Mon Dvaravati culture, which prevailed from the 7th century to the 10th century.  The existence of the civilisations had long been forgotten by the Thai when Samuel Beal discovered the polity among the Chinese writings on Southeast Asia as Duoluobodi . During the early 20th century archaeologists led by ": null
    },
    {
        "George Coedès": "George Coedès"
    },
    {
        " made excavations in what is now ": null
    },
    {
        "Nakhon Pathom Province": "Nakhon Pathom Province"
    },
    {
        " and found it to be a centre of Dvaravati culture. The constructed name Dvaravati was confirmed by a Sanskrit plate inscription containing the name Dvaravati .     Later on, many more Dvaravati sites were discovered throughout the Chao Phraya valley. The two most important sites were Nakorn Pathom and U Thong . The inscriptions of Dvaravati were in Sanskrit and Mon using the script derived from the ": null
    },
    {
        "Pallava alphabet": "Pallava Alphabet"
    },
    {
        " of the ": null
    },
    {
        "South India": "South India"
    },
    {
        "n Pallava dynasty.     The religion of Dvaravati is thought to be ": null
    },
    {
        "Theravada Buddhism": "Theravada"
    },
    {
        " through contacts with ": null
    },
    {
        "Sri Lanka": "Sri Lanka"
    },
    {
        ", with the ruling class also participating in ": null
    },
    {
        "Hindu": "Hindu"
    },
    {
        " rites. ": null
    },
    {
        "Dvaravati art": "Dvaravati Art"
    },
    {
        ", including the Buddha sculptures and ": null
    },
    {
        "stupa": "Stupa"
    },
    {
        "s, showed strong similarities to those of the Gupta Empire of India. The most prominent production of Dvaravati art is ": null
    },
    {
        "dharmachakra": "Dharmachakra"
    },
    {
        "s, stone wheels signifying Buddhist principles. The eastern parts of the Chao Phraya valley were subjected to a more Khmer and Hindu influence as the inscriptions are found in Khmer and Sanskrit. Brown, Robert L. . The Dvaravati wheels of law and the Indianization of South East Asia. Leiden: E.J.Brill     Dvaravati was not a kingdom but a network of city-states paying tribute to more powerful ones according to the ": null
    },
    {
        "mandala political model": "Mandala"
    },
    {
        ". Dvaravati culture expanded into ": null
    },
    {
        "Isan": "Isan"
    },
    {
        " as well as south as far as the ": null
    },
    {
        "Kra Isthmus": "Kra Isthmus"
    },
    {
        ". Dvaravati was a part of the ancient international trade as Roman artefacts were also found and Dvaravati tributes to the ": null
    },
    {
        "Tang Chinese": "Tang Dynasty"
    },
    {
        " court are recorded. The culture lost power around the 10th century when they submitted to the more unified Lavo-Khmer polity.       In what is modern Isan, another Indianised kingdom, Si Kottaboon, rose with the capital of Nakhon Phanom. The territory of Si Khottaboon encompassed mostly northern Isan and central ": null
    },
    {
        "Laos": "Laos"
    },
    {
        ".       Below the Kra Isthmus was the place of Malay civilisations. Primordial Malay kingdoms are described as tributaries to Funan by second-century Chinese sources, though most of them proved to be tribal organisations instead of full-fledged kingdoms.  From the sixth century on, two major mandalas ruled southern Thailand, the Kanduli and the ": null
    },
    {
        "Langkasuka": "Langkasuka"
    },
    {
        ". Kanduli centred on what is now ": null
    },
    {
        "Surat Thani Province": "Surat Thani Province"
    },
    {
        " and Langasuka in ": null
    },
    {
        "Pattani Province": "Pattani Province"
    },
    {
        ".     Southern Thailand was the centre of ": null
    },
    {
        "Hinduism": "Hinduism"
    },
    {
        " and ": null
    },
    {
        "Mahayana Buddhism": "Mahayana"
    },
    {
        ". The Tang monk ": null
    },
    {
        "Yijing": "Yijing"
    },
    {
        " stopped at Langkasuka to study ": null
    },
    {
        "Pali": "Pali"
    },
    {
        " grammar and Mahayana during his journey to India around 800. At that time, the kingdoms of Southern Thailand quickly fell under the influences of the Malay kingdom of ": null
    },
    {
        "Srivijaya": "Srivijaya"
    },
    {
        " from ": null
    },
    {
        "Sumatra": "Sumatra"
    },
    {
        ". ": null
    },
    {
        "Rajendra Chola I": "Rajendra Chola I"
    },
    {
        " of the ": null
    },
    {
        "Chola dynasty": "Chola Dynasty"
    },
    {
        " invaded the ": null
    },
    {
        "Tambralinga": "Tambralinga"
    },
    {
        " Kingdom in ": null
    },
    {
        "southern Thailand": "Southern Thailand"
    },
    {
        " in the 11th century.            From about the 10th century to the 14th century, Thailand is known through archaeological findings and a number of local legends. The period saw Khmer domination over a large portion of the Chao Phraya basin and Isan. The expansion of ": null
    },
    {
        "Tai tribes": "Tai Peoples"
    },
    {
        " and their culture southwards also happened during the classical era.               According to the  Cāmadevivaṃsa , the city of ": null
    },
    {
        "Hariphunchai": "Hariphunchai"
    },
    {
        "  was founded by ": null
    },
    {
        "hermit": "Hermit"
    },
    {
        "s. ": null
    },
    {
        "Camadevi": "Camadevi"
    },
    {
        ", a princess of the ": null
    },
    {
        "Lavo Kingdom": "Lavo Kingdom"
    },
    {
        ", was invited to rule the city around 700. However, this date is considered too early for the foundation of Hariphunchai as Camadevi brought no ": null
    },
    {
        "dharmachakras": "Dharmachakra"
    },
    {
        "to the north. Hariphunchai may be a later offshoot of the Lavo Kingdom or instead related to the ": null
    },
    {
        "Thaton Kingdom": "Thaton Kingdom"
    },
    {
        ".     Hariphunchai was the centre of Theravada in the north. The kingdom flourished during the reign of King Attayawong who built ": null
    },
    {
        "Wat Phra That Hariphunchai": "Wat Phra That Hariphunchai"
    },
    {
        " in 1108. The kingdom had strong relations with the Mon Kingdom of Thaton. During the 11th century, Hariphunchai waged lengthy wars with the Tai ": null
    },
    {
        "Ngoenyang": "Ngoenyang"
    },
    {
        " Kingdom of ": null
    },
    {
        "Chiang Saen": "Lanna"
    },
    {
        ". Weakened by Tai invasions, Hariphunchai eventually fell in 1293 to ": null
    },
    {
        "Mangrai": "Mangrai"
    },
    {
        ", king of ": null
    },
    {
        "Lan Na": "Lan Na"
    },
    {
        ", the successor state of the Ngoenyang Kingdom.               The most recent and accurate theory about the origin of the ": null
    },
    {
        "Tai people": "Tai Peoples"
    },
    {
        " stipulates that ": null
    },
    {
        "Guangxi": "Guangxi"
    },
    {
        " in China is really the Tai motherland instead of Yunnan. A large number of Tai people known as the ": null
    },
    {
        "Zhuang": "Zhuang People"
    },
    {
        " still live in Guangxi today. Around 700 CE, Tai people who did not come under Chinese influence settled in what is now ": null
    },
    {
        "Điện Biên Phủ": "Điện Biên Phủ"
    },
    {
        " in modern ": null
    },
    {
        "Vietnam": "Vietnam"
    },
    {
        " according to the ": null
    },
    {
        "Khun Borom": "Khun Borom"
    },
    {
        " legend. Based on layers of Chinese ": null
    },
    {
        "loanwords": "Loanword"
    },
    {
        "in proto-": null
    },
    {
        "Southwestern Tai": "Southwestern Tai"
    },
    {
        " and other historical evidence, Pittayawat Pittayaporn proposed that this migration must have taken place sometime between the 8th–10th centuries.  . MANUSYA: Journal of Humanities, Special Issue No 20: 47–64. Tai speaking tribes migrated southwestward along the rivers and over the lower passes into Southeast Asia, perhaps prompted by the Chinese expansion and suppression. Chinese historical texts record that, in 722, 400,000 Lao The term  Lao  used in this context refers to Tai-Kadai speaking peoples resided in what are now Guangdong, Guangxi, and northern Vietnam in general. It is not necessarily applied solely to the ancestor of ": null
    },
    {
        "the Lao": "Lao People"
    },
    {
        ". rose in revolt behind a leader who declared himself the king of ": null
    },
    {
        "Nanyue": "Nanyue"
    },
    {
        " in ": null
    },
    {
        "Guangdong": "Guangdong"
    },
    {
        ". After the 722 revolt, some 60,000 were beheaded. In 726, after the suppression of a rebellion by a Lao leader in the ": null
    },
    {
        "present-day Guangxi": "Guangxi"
    },
    {
        ", over 30,000 rebels were captured and beheaded. In 756, another revolt attracted 200,000 followers and lasted four years. In the 860s, many local people in what is now North Vietnam sided with attackers from ": null
    },
    {
        "Nanchao": "Nanchao"
    },
    {
        ", and in the aftermath, some 30,000 of them were beheaded. In the 1040s, a powerful matriarch-shamaness by the name of ": null
    },
    {
        "A Nong": "A Nong"
    },
    {
        ", her chiefly husband, and their son, ": null
    },
    {
        "Nong Zhigao": "Nong Zhigao"
    },
    {
        ", raised a revolt, took ": null
    },
    {
        "Nanning": "Nanning"
    },
    {
        ", besieged ": null
    },
    {
        "Guangzhou": "Guangzhou"
    },
    {
        " for fifty seven days, and slew the commanders of five Chinese armies sent against them before they were defeated, and many of their leaders were killed. As a result of these three bloody centuries, the Tai began to migrate southwestward.     The Simhanavati legend tells us that a Tai chief named ": null
    },
    {
        "Simhanavati": "Simhanavati"
    },
    {
        " drove out the native ": null
    },
    {
        "Wa people": "Wa People"
    },
    {
        " and founded the city of ": null
    },
    {
        "Chiang Saen": "Chiang Saen District"
    },
    {
        " around 800 CE. For the first time, the Tai people made contact with the ": null
    },
    {
        "India": "India"
    },
    {
        "nized civilisations of Southeast Asia. Through Hariphunchai, the Tais of Chiang Saen adopted Theravada Buddhism and ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " royal names. ": null
    },
    {
        "Wat Phrathat Doi Tong": "Doi Tungdescription"
    },
    {
        ", constructed around 850, signified the piety of Tai people on the Theravada religion. Around 900, major wars were fought between Chiang Saen and Hariphunchai. Mon forces captured Chiang Saen and its king fled. In 937, Prince Prom the Great took Chiang Saen back from the Mon and inflicted severe defeats on Hariphunchai.     Around 1000 CE, Chiang Saen was destroyed by an earthquake with many inhabitants killed.  A council was established to govern the kingdom for a while, and then a local Wa man known as Lavachakkaraj was elected king of the new city of Chiang Saen or ": null
    },
    {
        "Ngoenyang": "Ngoenyang"
    },
    {
        ". The Lavachakkaraj dynasty would rule over the region for about 500 years.     Overpopulation might have encouraged the Tais to seek their fortune further southwards. By 1100 CE, the Tai had established themselves as Po Khuns at ": null
    },
    {
        "Nan": "Nan, Thailand"
    },
    {
        ", ": null
    },
    {
        "Phrae": "Phrae"
    },
    {
        ", Songkwae, ": null
    },
    {
        "Sawankhalok": "Sawankhalok District"
    },
    {
        ", and Chakangrao on the upper ": null
    },
    {
        "Chao Phraya River": "Chao Phraya River"
    },
    {
        ". These southern Tai princes faced Khmer influence from the Lavo Kingdom. Some of them became subordinates to it.             Around the 10th century, the city-states of ": null
    },
    {
        "Dvaravati": "Dvaravati"
    },
    {
        " merged into two mandalas, the ": null
    },
    {
        "Lavo": "Lavo"
    },
    {
        "  and the ": null
    },
    {
        "Suvarnabhumi": "Suvarnabhumi"
    },
    {
        " . According to a legend in the Northern Chronicles, in 903, a king of ": null
    },
    {
        "Tambralinga": "Tambralinga"
    },
    {
        " invaded and took Lavo and installed a Malay prince on the Lavo throne. The Malay prince was married to a Khmer princess who had fled an Angkorian dynastic bloodbath. The son of the couple contested the Khmer throne and became ": null
    },
    {
        "Suryavarman I": "Suryavarman I"
    },
    {
        ", thus bringing Lavo under Khmer domination through the marital union. Suryavarman I also expanded into the ": null
    },
    {
        "Khorat Plateau": "Khorat Plateau"
    },
    {
        " , constructing many temples.     Suryavarman, however, had no male heirs and again Lavo was independent. After the death of King Narai of Lavo, however, Lavo was plunged into bloody civil war and the Khmer under ": null
    },
    {
        "Suryavarman II": "Suryavarman Ii"
    },
    {
        " took advantage by invading Lavo and installing his son as the King of Lavo.     The repeated but discontinued Khmer domination eventually Khmerized Lavo. Lavo was transformed from a Theravadin Mon Dvaravati city into a ": null
    },
    {
        "Hindu": "Hindu"
    },
    {
        " Khmer one. Lavo became the ": null
    },
    {
        "entrepôt": "Entrepôt"
    },
    {
        " of Khmer culture and power of the Chao Phraya river basin. The bas-relief at ": null
    },
    {
        "Angkor Wat": "Angkor Wat"
    },
    {
        " shows a Lavo army as one of the subordinates to Angkor. One interesting note is that a Tai army was shown as a part of Lavo army, a century before the establishment of the ": null
    },
    {
        "Sukhothai Kingdom": "Sukhothai Kingdom"
    },
    {
        " .             Thai city-states gradually became independent of the weakened ": null
    },
    {
        "Khmer Empire": "Khmer Empire"
    },
    {
        ". It is said that ": null
    },
    {
        "Sukhothai Kingdom": "Sukhothai Kingdom"
    },
    {
        " was established as a strong sovereign kingdom by ": null
    },
    {
        "Sri Indraditya": "Sri Indraditya"
    },
    {
        " in 1238. A political feature which classic Thai historians call father governs children existed at this time. Everybody could bring their problems to the king directly, as there was a bell in front of the palace for this purpose. The city briefly dominated the area under King ": null
    },
    {
        "Ram Khamhaeng": "Ram Khamhaeng"
    },
    {
        ", who tradition and legend states established the ": null
    },
    {
        "Thai alphabet": "Thai Alphabet"
    },
    {
        ", but after his death in 1365, Sukhothai fell into decline and became subject to another emerging Thai state, the ": null
    },
    {
        "Ayutthaya Kingdom": "Ayutthaya Kingdom"
    },
    {
        " in the lower Chao Phraya area.     Another Thai state that coexisted with Sukhothai was the eastern state of ": null
    },
    {
        "Lan Na": "Lan Na"
    },
    {
        " centred in ": null
    },
    {
        "Chiang Mai": "Chiang Mai"
    },
    {
        ". King ": null
    },
    {
        "Mangrai": "Mangrai"
    },
    {
        " was its founder. This city-state emerged in the same period as Sukhothai. Evidently, Lan Na became closely allied with Sukhothai. After the Ayutthaya Kingdom had emerged and expanded its influence from the Chao Phraya valley, Sukhothai was finally subdued. Fierce battles between Lan Na and Ayutthaya also constantly took place and Chiang Mai was eventually subjugated, becoming Ayutthayas ": null
    },
    {
        "vassal": "Vassal"
    },
    {
        ".     Lan Nas independent history ended in 1558, when it finally fell to the Burmese. It was dominated by Burma until the late-18th century. Local leaders then rose up against the Burmese with the help of the rising Thai kingdom of ": null
    },
    {
        "Thonburi": "Thonburi"
    },
    {
        " of King ": null
    },
    {
        "Taksin": "Taksin"
    },
    {
        ". The Northern City-States then became vassals of the lower Thai kingdoms of Thonburi and Bangkok. In the early 20th century they were annexed and became part of modern Siam, the country that is now called Thailand .             The city of ": null
    },
    {
        "Ayutthaya": "Phra Nakhon Si Ayutthaya"
    },
    {
        " was on a small island, encircled by three rivers. Due to its defensible location, Ayutthaya quickly became powerful, politically, and economically. Ayutthayas name is derived from ": null
    },
    {
        "Ayodhya": "Ayodhya"
    },
    {
        ", an Indian holy city.     The first ruler of the Kingdom of Ayutthaya, King ": null
    },
    {
        "Uthong": "Uthong"
    },
    {
        " , made two important contributions to Thai history: the establishment and promotion of Theravada Buddhism as the official religion to differentiate his kingdom from the neighbouring Hindu kingdom of Angkor and the compilation of the  Dharmaśāstra , a legal code based on Hindu sources and traditional Thai custom. The Dharmaśāstra remained a tool of Thai law until late in the 19th century.     In 1511 Duke ": null
    },
    {
        "Afonso de Albuquerque": "Afonso De Albuquerque"
    },
    {
        " dispatched ": null
    },
    {
        "Duarte Fernandes": "Duarte Fernandes"
    },
    {
        " as an envoy to the Ayutthaya Kingdom, known then to Europeans as the Kingdom of Siam . This contact with the West during the 16th century led to a period of economic growth as lucrative trade routes were established. Ayutthaya became one of the most prosperous cities in Southeast Asia. According to ": null
    },
    {
        "George Modelski": "George Modelski"
    },
    {
        ", Ayutthaya is estimated to have been the ": null
    },
    {
        "largest city in the world": "List Of Largest Cities Throughout History"
    },
    {
        " in 1700 CE, with a population around one million. ": null
    },
    {
        "George Modelski": "George Modelski"
    },
    {
        ", World Cities: 3000 to 2000, Washington DC: FAROS 2000, 2003. . Trade flourished, with the Dutch and Portuguese among the most active foreigners in the kingdom, together with the Chinese and Malayans.     The Ayutthaya Period is known as the golden age of ": null
    },
    {
        "Thai literature": "Thai Literature"
    },
    {
        ", ": null
    },
    {
        "Art": "Thai Art"
    },
    {
        " and Trade with the eastern and western world. In Ayutthaya period was also considered as golden age of medicine in Thailand due to progress in the field of medicine at that time. Rong Syamananda, A History of Thailand, ": null
    },
    {
        "Chulalongkorn University": "Chulalongkorn University"
    },
    {
        ", 1986, p 92               Starting in the middle of the 16th century, the kingdom came under repeated attacks by the ": null
    },
    {
        "Taungoo Dynasty": "Taungoo Dynasty"
    },
    {
        " of ": null
    },
    {
        "Burma": "Burma"
    },
    {
        ". The ": null
    },
    {
        "Burmese–Siamese War ": "Burmese–Siamese War"
    },
    {
        " began with a Burmese invasion and a failed siege of Ayutthaya. ": null
    },
    {
        "A second siege ": "Burmese–Siamese War"
    },
    {
        " led by King ": null
    },
    {
        "Bayinnaung": "Bayinnaung"
    },
    {
        " forced King ": null
    },
    {
        "Maha Chakkraphat": "Maha Chakkraphat"
    },
    {
        " to surrender in 1564. The royal family was taken to ": null
    },
    {
        "Bago, Burma": "Bago, Burma"
    },
    {
        ", with the kings second son ": null
    },
    {
        "Mahinthrathirat": "Mahinthrathirat"
    },
    {
        " installed as a vassal king.   In 1568, Mahinthrathirat revolted when his father managed to return from Bago as a ": null
    },
    {
        "Buddhist monk": "Bhikkhu"
    },
    {
        ". The ensuing ": null
    },
    {
        "third siege captured Ayutthaya in 1569": "Burmese–Siamese War"
    },
    {
        " and Bayinnaung made ": null
    },
    {
        "Mahathammarachathirat": "Mahathammarachathirat"
    },
    {
        " his vassal king.        After Bayinnaungs death in 1581, Uparaja ": null
    },
    {
        "Naresuan": "Naresuan"
    },
    {
        " proclaimed Ayutthayas independence in 1584. The Thai fought off repeated Burmese invasions , capped by an elephant duel between King ": null
    },
    {
        "Naresuan": "Naresuan"
    },
    {
        " and Burmese heir-apparent ": null
    },
    {
        "Mingyi Swa": "Mingyi Swa"
    },
    {
        " in 1593 during the fourth siege of Ayutthaya in which Naresuan famously slew Mingyi Swa. The ": null
    },
    {
        "Burmese–Siamese War ": "Burmese–Siamese War"
    },
    {
        " was a Thai attack on Burma, resulting in the capture of the ": null
    },
    {
        "Tanintharyi Region": "Tanintharyi Region"
    },
    {
        " as far as ": null
    },
    {
        "Mottama": "Mottama"
    },
    {
        " in 1595 and Lan Na in 1602. Naresuan even invaded mainland Burma as far as Taungoo in 1600, but was driven back.     Ayutthaya expanded its sphere of influence over a considerable area, ranging from the Islamic states on the ": null
    },
    {
        "Malay Peninsula": "Malay Peninsula"
    },
    {
        ", the ": null
    },
    {
        "Andaman": "Andaman Sea"
    },
    {
        " seaports of present-day India, the ": null
    },
    {
        "Angkor kingdom": "Khmer Empire"
    },
    {
        " of Cambodia, to states in northern Thailand. In the 18th century, the power of the Ayutthaya Kingdom gradually declined as fighting between princes and officials plagued its politics. Outlying principalities became more and more independent, ignoring the capitals orders and decrees.     In the 18th century, the last phase of the kingdom arrived. The ": null
    },
    {
        "Bamar people": "Bamar People"
    },
    {
        ", who had taken control of Lan Na and had also unified their kingdom under the powerful ": null
    },
    {
        "Konbaung Dynasty": "Konbaung Dynasty"
    },
    {
        ", launched several blows against Ayutthaya in the ": null
    },
    {
        "1750s and 1760s": "Burmese–Siamese War"
    },
    {
        ". Finally, ": null
    },
    {
        "in 1767": "Burmese–Siamese War"
    },
    {
        ", after several months of siege, the Burmese broke through Ayutthayas outer and inner walls, sacked the city, and burned it down. The royal family fled the city and Ayutthayas last king, ": null
    },
    {
        "Ekkathat": "Ekkathat"
    },
    {
        ", died of starvation ten days later while in hiding.       After more than 400 years of power, in 1767, the Kingdom of Ayutthaya was brought down by invading ": null
    },
    {
        "Burmese": "Burma"
    },
    {
        " armies, its capital burned, and the territory split. Despite its complete defeat and occupation by Burma, Siam made a rapid recovery. The resistance to Burmese rule was led by a noble of ": null
    },
    {
        "Chinese descent": "Chinese Descent"
    },
    {
        ", ": null
    },
    {
        "Taksin": "Taksin"
    },
    {
        ", a capable military leader. Initially based at ": null
    },
    {
        "Chanthaburi": "Chanthaburi"
    },
    {
        " in the southeast, within a year he had defeated the Burmese occupation army and re-established a Siamese state with its capital at ": null
    },
    {
        "Thonburi": "Thonburi"
    },
    {
        " on the west bank of the Chao Phraya, 20  km from the sea. In 1768 he was crowned as King Taksin .             After the sacking of Ayutthaya, the country had fallen apart, due to the disappearance of the central authority. Besides King Taksin, who had organised his force in the southeastern provinces, Prince Teppipit, King Boromakots son, who had been unsuccessful in a diversionary action against the Burmese in 1766, had set himself up as the ruler of ": null
    },
    {
        "Phimai": "Phimai"
    },
    {
        " holding sway over the eastern provinces including ": null
    },
    {
        "Nakhon Ratchasima": "Nakhon Ratchasima"
    },
    {
        " or Khorat, while the Governor of ": null
    },
    {
        "Phitsanulok": "Phitsanulok"
    },
    {
        ", whose first name was Ruang , had proclaimed himself independent, with the territory under his control extending to the province of ": null
    },
    {
        "Nakhon Sawan": "Nakhon Sawan"
    },
    {
        ". North of Phitsanulok was the town of Sawangburi , where a Buddhist monk named Ruan had made himself a prince, appointing fellow monks as army commanders. He had himself pursued Buddhist studies at Ayutthaya with such excellent results that he had been appointed the chief monk of Sawangburi by King Boromakot. The southern provinces as far north as ": null
    },
    {
        "Chumphon": "Chumphon"
    },
    {
        ", a Pra Palad who was the acting Governor of ": null
    },
    {
        "Nakhon Si Thammarat": "Nakhon Si Thammarat"
    },
    {
        " declared his independence and raised himself to a princely rank.     Having firmly established his power at Thonburi, King Taksin set out to reunify the old kingdom, crushing regional rivals. After a temporary repulse by the Governor of Phitsanulok, Damrong Rajanubhab, pp. 414–415 he concentrated on the defeat of the weakest one first. Prince Teppipit of Phimai was quelled and executed in 1768. Damrong Rajanubhab, pp. 418–419 Chao Narasuriyawongse, one of Taksins nephews, was substituted for him as governor. The last so-called ruler who still challenged the King was the Prince of Sawangburi or Chao Pra Fang, as he had just annexed Phitsanulok on the death of its Governor. King Taksin himself led an expedition against him and took it, but the prince disappeared and could not be found again. Damrong Rajanubhab, p. 430     In dealing with the Prince of Nakhon Si Thammarat, who was taken prisoner by the loyal Governor of ": null
    },
    {
        "Pattani": "Pattani"
    },
    {
        ", Damrong Rajanubhab, pp. 423–424 the king not only pardoned him but also favoured him with a residence at Thonburi.       In Thonburi period, the beginning of the ": null
    },
    {
        "Chinese mass immigration": "Thai Chinese"
    },
    {
        " fell to Siam. Through the availability of Chinese workers, trade, agriculture and craftsmen flourished. However, the first Chinese rebellions had to be suppressed. However, later due to stress and many factors, King Taksin went mad. After a coup détat removing Taksin from power was restored by General Chakri , Taksin was sentenced to death on Wednesday, 10 April 1782.              A noble of ": null
    },
    {
        "Mon descent": "Mon People"
    },
    {
        ", General Chakri succeeded Taksin in 1782 as ": null
    },
    {
        "Rama I": "Rama I"
    },
    {
        ", the first king of the ": null
    },
    {
        "Chakri dynasty": "Chakri Dynasty"
    },
    {
        ".  In the same year he founded a new capital city across the ": null
    },
    {
        "Chao Phraya River": "Chao Phraya River"
    },
    {
        " in an area known as ": null
    },
    {
        "Rattanakosin Island": "Rattanakosin Island"
    },
    {
        ".  In the 1790s, ": null
    },
    {
        "Burma was defeated and driven out": "Burmese–Siamese Warskonbaung–Bangkok"
    },
    {
        " of ": null
    },
    {
        "Siam": "Siam"
    },
    {
        ", as it was then called. ": null
    },
    {
        "Lan Na": "Lan Na"
    },
    {
        " also became free of Burmese occupation, but was reduced to the ": null
    },
    {
        "Kingdom of Chiang Mai": "Kingdom Of Chiang Mai"
    },
    {
        ". The king of the new dynasty was installed as a ": null
    },
    {
        "tributary ruler": "Tributary State"
    },
    {
        " of the ": null
    },
    {
        "Chakri monarch": "Chakri Dynasty"
    },
    {
        ".          After the coup of removing Taksin, it is probable that Chakri and his family had planned the ascent to the throne already during his predecessor ": null
    },
    {
        "Taksin": "Taksin"
    },
    {
        ". After his ": null
    },
    {
        "coronation": "Coronation Of The Thai Monarch"
    },
    {
        ", he operated a systematic bloody extermination of the followers of Taksin, which corresponds to the typical approach of the ": null
    },
    {
        "usurpers": "Usurpation"
    },
    {
        " in Thai history.     The new dynasty moved the capital of Thonburi to ": null
    },
    {
        "Rattanakosin": "Rattanakosin Island"
    },
    {
        ", todays ": null
    },
    {
        "Bangkok": "Bangkok"
    },
    {
        ". Bangkok had previously been a small settlement with a fort, but it was strategically located on the eastern shores of the ": null
    },
    {
        "Chao Phraya river": "Chao Phraya River"
    },
    {
        " and was known among the foreign traders as the key to Siam. New palaces and temples were built. The ": null
    },
    {
        "Emerald Buddha": "Emerald Buddha"
    },
    {
        " and ": null
    },
    {
        "Wat Phra Kaeo": "Wat Phra Kaeo"
    },
    {
        " were founded. The kings goal was to transfer the old splendor of Ayutthaya to the new capital. In his new capital, Rama I crowned himself in 1785 in a splendid ceremony.     During the reign of Rama I, the foreign policy was still focused on the threat represented by Burma. Burmas new king ": null
    },
    {
        "Bodawpaya": "Bodawpaya"
    },
    {
        " ordered the nine Burmese armies in a surprise attack against Siam, while in 1786 the Burmese army invaded the ": null
    },
    {
        "Three Pagoda Pass": "Three Pagoda Pass"
    },
    {
        ". It came to the ": null
    },
    {
        "Nine Armies Wars": "Burmese–Siamese War"
    },
    {
        " . In all cases, the Siamese remained victorious after the fighting. In 1805 ": null
    },
    {
        "Lanna": "Lanna"
    },
    {
        " was largely brought under control of Bangkok. Rama I also attempted unsuccessfully to conquer the important trading ports of ": null
    },
    {
        "Tenasserim": "Tenasserim Division"
    },
    {
        ".     At the time of Rama I, Cambodia was practically administered as a province of Siam, as rival Vietnam had to deal with internal problems. Only when the new Vietnamese emperor ": null
    },
    {
        "Gia Long": "Gia Long"
    },
    {
        " had ascended to the throne was the influence of Siam in Cambodia again contested. Relations with Vietnam took on a prominent place in this epoch. There were no significant relations with the European colonial powers during the reign of Rama I.     One of the most important achievements of Rama I was the codification of all the countrys laws into a work of 1,700 pages called the ": null
    },
    {
        "Three Seals Law": "Three Seals Law"
    },
    {
        ". This law remained valid in its basic traits until the beginning of the twentieth century.     Siam also had a high level of cultural achievement. The Buddhist canon  was collected and reformulated within the framework of a Grand Council. The arts were promoted, as well as the construction of new palaces and temples in the capital. Literature and theatre also thrived; in this epoch were produced works such as the important, 3,000-page ": null
    },
    {
        "Ramakian": "Ramakian"
    },
    {
        ". Works from Chinese, Mon, Javanese, Persian, and Indian languages were translated into Thai.     Rama I, the first king of the ": null
    },
    {
        "Chakri dynasty": "Chakri Dynasty"
    },
    {
        ", continued the traditions of Ayutthaya in many respects. However, the new empire was still more tightly centralised than its predecessors. A particularly important innovation was the stronger emphasis on rationality in the relationship between the monarch and his subjects. Rama I was the first king in the history of the country who justified his decisions before the highest officials.             King ": null
    },
    {
        "Rama II": "Rama Ii Of Siam"
    },
    {
        " was the son of Rama I. His accession to the throne was accompanied by a plot, during which 40 people were killed. The calmness of the interior and the exterior, which during the reign of Rama II and his successor ": null
    },
    {
        "Rama III": "Rama Iii"
    },
    {
        " , prevailed mainly through giving in to conflicts and building good relations with influential clans in the country.     During Rama IIs reign, the kingdom saw a cultural renaissance after the massive wars that plagued his predecessors reign; particularly in the fields of arts and literature. Poets employed by Rama II included ": null
    },
    {
        "Sunthorn Phu": "Sunthorn Phu"
    },
    {
        " the drunken writer  and ": null
    },
    {
        "Narin Dhibet": "Narin Dhibet"
    },
    {
        " .     Foreign relations were initially dominated by relations with the neighbouring states, while those with European colonial powers started to enter in the background. In Cambodia and Laos, Vietnam gained the supremacy, a fact which Rama II initially accepted. When a rebellion broke out in Vietnam under Rama III in 1833–34, he tried to subdue the Vietnamese militarily, but this led to a costly defeat for the Siamese troops. In the 1840s, however, the Khmer themselves succeeded in expelling the Vietnamese, which subsequently led to the greater influence of Siam in Cambodia. At the same time, Siam kept sending tribute to China.     There was a serious touch with British colonial interests when Siam conquered the Sultanate ": null
    },
    {
        "Kedah": "Kedah"
    },
    {
        " on the Malay Peninsula in 1821. Kedah belonged to the sphere of interest of Great Britain. In the following year, Siam had to recognise the pre-conquest status after tough negotiations with the British envoy ": null
    },
    {
        "John Crawfurd": "John Crawfurd"
    },
    {
        ". There was also the cautious resumption of trade and missionary activity in this epoch. In particular, British traders such as ": null
    },
    {
        "Robert Hunter": "Robert Hunter"
    },
    {
        "  or James Hayes, but also missionaries from Europe and the United States like ": null
    },
    {
        "Jacob Tomlin": "Jacob Tomlin"
    },
    {
        ", ": null
    },
    {
        "Karl Gützlaff": "Karl Gützlaff"
    },
    {
        ", ": null
    },
    {
        "Dan Beach Bradley": "Dan Beach Bradley"
    },
    {
        " and ": null
    },
    {
        "Jean-Baptiste Pallegoix": "Jean-Baptiste Pallegoix"
    },
    {
        " became active in Siam. In 1825 an agreement was signed with British emissary ": null
    },
    {
        "Henry Burney": "Henry Burney"
    },
    {
        "; Siam recognised British colonial possessions on the Malay Peninsula and made commercial concessions. This agreement was due not least to the rapid British success in the ": null
    },
    {
        "First Anglo-Burmese War": "First Anglo-Burmese War"
    },
    {
        ".     A potentially dangerous event occurred with the ": null
    },
    {
        "Anouvongs Rebellion": "Lao Rebellion"
    },
    {
        " in 1827, when the troops of the actually tributary king ": null
    },
    {
        "Anouvong": "Anouvong"
    },
    {
        " of ": null
    },
    {
        "Kingdom of Vientiane": "Kingdom Of Vientiane"
    },
    {
        " advanced towards Bangkok. They were, however, destroyed, which strengthened the position of Siam in Laos. The Lao-population of the areas west of the Mekong were relocated to Thai provinces in ": null
    },
    {
        "Isan": "Isan"
    },
    {
        ".     Under Rama II and Rama III, culture, dance, poetry and above all the theatre reached a climax. The temple ": null
    },
    {
        "Wat Pho": "Wat Pho"
    },
    {
        " was built by Rama III, known as the first ": null
    },
    {
        "university": "University"
    },
    {
        " of the country.     The reign of Rama III. was finally marked by a division of the aristocracy with regard to foreign policy. A small group of advocates of the takeover of Western technologies and other achievements were opposed by conservative circles, which proposed a stronger isolation instead. Since the kings Rama II and Rama III, the conservative-religious circles largely stuck with their isolationist tendency.     The death of Rama III in 1851 also signified the end of the old traditional Siamese monarchy: there were already clear signs of profound changes, which were implemented by the two successors of the king.              When King ": null
    },
    {
        "Mongkut": "Mongkut"
    },
    {
        " ascended the Siamese throne, he was severely threatened by the neighbouring states. The colonial powers of Britain and France had already advanced into territories which originally belonged to the Siamese sphere of influence. Mongkut and his successor ": null
    },
    {
        "Chulalongkorn": "Chulalongkorn"
    },
    {
        " recognised this situation and tried to strengthen the defence forces of Siam by modernisation, to absorb Western scientific and technical achievements, thus avoiding colonisation.     The two monarchs, who ruled in this epoch, were the first with Western formation. King Mongkut had lived 26 years as a wandering monk and later as an abbot of ": null
    },
    {
        "Wat Bowonniwet Vihara": "Wat Bowonniwet Vihara"
    },
    {
        ". He was not only skilled in the traditional culture and Buddhist sciences of Siam, but he had also dealt extensively with modern western science, drawing on the knowledge of European missionaries and his correspondence with Western leaders and the Pope. He was the first Siamese monarch to speak English.     As early as 1855, ": null
    },
    {
        "John Bowring": "John Bowring"
    },
    {
        ", the British governor in Hong Kong, appeared on a warship at the mouth of the Chao Phraya River. Under the influence of Britains achievements in neighbouring Burma, King Mongkut signed the so-called ": null
    },
    {
        "Bowring Treaty": "Bowring Treaty"
    },
    {
        " , which abolished the royal foreign trade monopoly, abolished import duties, and granted Britain a most favourable clause. The Bowring Treaty meant the integration of Siam into the world economy, but at the same time, the royal house lost its most important sources of income. Similar treaties were concluded with all ": null
    },
    {
        "Western powers": "Western Powers"
    },
    {
        " in the following years, such as in 1862 with ": null
    },
    {
        "Prussia": "Prussia"
    },
    {
        " and 1869 with ": null
    },
    {
        "Austria-Hungary": "Austria-Hungary"
    },
    {
        ". From the Prussian emissary Count ": null
    },
    {
        "Friedrich Albrecht zu Eulenburg": "Friedrich Albrecht Zu Eulenburg"
    },
    {
        " comes a much-respected travel report about Siam. The survival diplomacy, which Siam had cultivated abroad for a long time, reached its climax in this epoch.     The integration into the global economy meant to Siam that it became a sales market for Western industrial goods and an investment for Western capital. The export of agricultural and mineral raw materials began, including the three products rice, pewter and ": null
    },
    {
        "teakwood": "Teak Tree"
    },
    {
        ", which were used to produce 90% of the export turnover. King Mongkut actively promoted the expansion of agricultural land by tax incentives, while the construction of traffic routes  and the influx of Chinese immigrants allowed the agricultural development of new regions.     Mongkuts son, ": null
    },
    {
        "Chulalongkorn": "Chulalongkorn"
    },
    {
        " , ascended to the throne in 1868. He was the first Siamese king to have a full Western education, having been taught by a British governess, ": null
    },
    {
        "Anna Leonowens": "Anna Leonowens"
    },
    {
        ", whose place in Siamese history has been fictionalised as  The King and I . At first Rama Vs reign was dominated by the conservative regent, ": null
    },
    {
        "Somdet Chaophraya Sri Suriwongse": "Somdet Chaophraya Sri Suriwongse"
    },
    {
        ", but when the king came of age in 1873 he soon took control. He created a Privy Council and a Council of State, a formal court system and budget office. He announced that slavery would be gradually abolished and debt-bondage restricted.                  Two kings, Mongkut and Chulalongkorn, witnessed the expansion of both ": null
    },
    {
        "France": "French Colonial Empire"
    },
    {
        " and ": null
    },
    {
        "Great Britain": "British Empire"
    },
    {
        " to increase their colonial territories in Southeast Asia and encircle Siam. From the west, the British conquered ": null
    },
    {
        "India": "India"
    },
    {
        ", ": null
    },
    {
        "Burma": "Burma"
    },
    {
        " and ": null
    },
    {
        "Malaya": "Malay Peninsula"
    },
    {
        ", and from the east, the French conquered ": null
    },
    {
        "South Vietnam": "Cochinchina Campaign"
    },
    {
        ", ": null
    },
    {
        "Vietnam": "Vietnam"
    },
    {
        " and claimed to be protecting ": null
    },
    {
        "Cambodia": "Cambodia"
    },
    {
        ", while Siam lost its ": null
    },
    {
        "extraterritorial": "Extraterritorial"
    },
    {
        " rights in these areas to the new conquerors.     The construction of ": null
    },
    {
        "Kra Isthmus Canal": "Thai Canal"
    },
    {
        ", planned by a group of entrepreneurs led by the engineer ": null
    },
    {
        "Ferdinand de Lesseps": "Ferdinand De Lesseps"
    },
    {
        ", was not constructed after the British conquered ": null
    },
    {
        "Kongbaung-ruled Burma": "Konbaung Dynasty"
    },
    {
        " in the ": null
    },
    {
        "Third Anglo-Burmese War": "Third Anglo-Burmese War"
    },
    {
        " in 1885. A major event was the ": null
    },
    {
        "Paknam incident": "Paknam Incident"
    },
    {
        ", when, on 13 July 1893, French cannon boats entered the Chao Phraya River toward Bangkok and were fired upon from a Siamese coastal fort, leading to the ": null
    },
    {
        "Franco-Siamese War": "Franco-Siamese War"
    },
    {
        ". In the same year, Siam was compelled to conclude a treaty with France, in which the territory of Laos, located east of the ": null
    },
    {
        "Mekong": "Mekong"
    },
    {
        ", was annexed to French Indochina. The French forced Siam to refrain from any influence on its former vassal state. In 1887, the ": null
    },
    {
        "Indo-Chinese Union": "French Indochina"
    },
    {
        " was founded. In 1896, British and French concluded a treaty which made a border between their colonies, with Siam defined as a ": null
    },
    {
        "buffer state": "Buffer State"
    },
    {
        ".     After the ": null
    },
    {
        "Franco-Siamese War": "Franco-Siamese War"
    },
    {
        " of 1893, King Chulalongkorn realised the threat of the western colonial powers, and accelerated extensive reforms in the administration, military, economy and society of Siam, completing the development of the nation from a traditional feudalist structure based on personal domination and dependencies, whose peripheral areas were only indirectly bound to the central power , to a centrally-governed national state with established borders and modern political institutions.      The ": null
    },
    {
        "Entente Cordiale": "Entente Cordiale"
    },
    {
        " of 8 April 1904 ended the rivalry between Great Britain and France over Siam. French and British zones of influence in Siam, were outlined, with the eastern territories, adjacent to ": null
    },
    {
        "French Indochina": "French Indochina"
    },
    {
        ", becoming a French zone, and the western, adjacent to ": null
    },
    {
        "Burmese": "Colonial Burma"
    },
    {
        " Tenasserim": "Tenasserim Division"
    },
    {
        ", a British zone. The British recognised a French ": null
    },
    {
        "sphere of influence": "Sphere Of Influence"
    },
    {
        " to the east of the River ": null
    },
    {
        "Menams": "Menam"
    },
    {
        "basin; in turn, the French recognised British influence over the territory to the west of the Menam basin. Both parties disclaimed any idea of annexing Siamese territory. Minton F. Goldman, Franco-British Rivalry over Siam, 1896–1904. Journal of Southeast Asian Studies 3.2 : 210–228.     The ": null
    },
    {
        "Anglo-Siamese Treaty of 1909": "Anglo-Siamese Treaty Of 1909"
    },
    {
        " defined the modern border between Siam and ": null
    },
    {
        "British Malaya": "British Malaya"
    },
    {
        ". The treaty stated that Siam relinquished their claims over ": null
    },
    {
        "Kelantan": "Kelantan"
    },
    {
        ", ": null
    },
    {
        "Terengganu": "Terengganu"
    },
    {
        ", ": null
    },
    {
        "Kedah": "Kedah"
    },
    {
        " and ": null
    },
    {
        "Perlis": "Perlis"
    },
    {
        " to ": null
    },
    {
        "Great Britain": "Great Britain"
    },
    {
        ", which were previously part of the semi-independent Malay sultanates of Pattani and ": null
    },
    {
        "Kedah": "Kedah"
    },
    {
        ". A series of treaties with France fixed the countrys current eastern border with Laos and ": null
    },
    {
        "Cambodia": "Cambodia"
    },
    {
        ".     In 1904, 1907 and 1909, there were new border corrections in favour of France and Great Britain. When King Chulalongkorn died in 1910, Siam had achieved the borders of todays Thailand. In 1910 he was peacefully succeeded by his son ": null
    },
    {
        "Vajiravudh": "Vajiravudh"
    },
    {
        ", who reigned as Rama VI. He had been educated at ": null
    },
    {
        "Royal Military Academy Sandhurst": "Royal Military Academy Sandhurst"
    },
    {
        " and ": null
    },
    {
        "University of Oxford": "University Of Oxford"
    },
    {
        " and was an anglicised Edwardian gentleman. Indeed, one of Siams problems was the widening gap between the Westernised royal family and upper aristocracy and the rest of the country. It took another 20 years for Western education to extend to the rest of the bureaucracy and the army.             The successor of King Chulalongkorn was King Rama VI in October 1910, better known as ": null
    },
    {
        "Vajiravudh": "Vajiravudh"
    },
    {
        ". He had studied law and history as the Siamese crown prince in Great Britain. After his ascension to the throne, he forgave important officials for his devoted friends, who were not part of the nobility, and even less qualified than their predecessors, an action which had hitherto been unprecedented in Siam. In his reign many changes were made, which brought Siam closer to modern countries. For example, the ": null
    },
    {
        "Gregorian Calendar": "Gregorian Calendar"
    },
    {
        " was introduced, all the citizens of his country had to accept ": null
    },
    {
        "Family names": "Thai Name"
    },
    {
        ", women were encouraged to wear skirts and long hair fringements and a citizenship law, Principle of the ": null
    },
    {
        "Ius sanguinis": "Ius Sanguinis"
    },
    {
        " was adopted. In 1917 the ": null
    },
    {
        "Chulalongkorn University": "Chulalongkorn University"
    },
    {
        " was founded and ": null
    },
    {
        "school education": "School Education"
    },
    {
        " was introduced for all 7 to 14-year-olds.     King Vajiravudh was a favour of literature, theatre, he translated many foreign literatures into Thai. He created the spiritual foundation for a kind of Thai ": null
    },
    {
        "nationalism": "Nationalism"
    },
    {
        ", a phenomenon unknown in Siam. He was based on the unity of nation, Buddhism, and kingship, and demanded loyalty from his subjects to all these three institutions. King Vajiravudh also took refuge in an irrational and contradictory anti-Sinicism. As a result of the mass immigration, in contrast to previous immigration waves from China, women and entire families had also come into the country, which meant that the Chinese were less assimilated and retained their cultural independence. In an article published by King Vajiravudh under a pseudonym, he described the Chinese minority as Jews of the East.     King Vajiravudh also created some new social associations, for example, the ": null
    },
    {
        "Wild Tiger Corps": "Wild Tiger Corps"
    },
    {
        " , a kind of ": null
    },
    {
        "Scout movement": "Scout Movement"
    },
    {
        ".     In 1912, a ": null
    },
    {
        "Palace revolt": "Palace Revolt Of 1912"
    },
    {
        ", plotted by young military officers, tried unsuccessfully to overthrow and replace the king.  Their goals were to change the system of government, overthrowing the ": null
    },
    {
        "ancien régime": "Ancien Régimeterminology"
    },
    {
        " and replacing it with a modern, Westernised constitutional system, and perhaps to replace Rama VI with a prince more sympathetic to their beliefs.,   but the king went against the conspirators, and sentenced many of them to long prison sentences. The members of the conspiracy consisted of military and the navy, the status of the monarchy, had become challenged.               In 1917 Siam declared war on ": null
    },
    {
        "German Empire": "German Empire"
    },
    {
        " and ": null
    },
    {
        "Austria-Hungary": "Austria-Hungary"
    },
    {
        ", mainly to gain favour with the British and the French. Siams token participation in World War I secured it a seat at the ": null
    },
    {
        "Versailles Peace Conference": "Versailles Peace Conference"
    },
    {
        ", and Foreign Minister ": null
    },
    {
        "Devawongse": "Devawongse"
    },
    {
        " used this opportunity to argue for the repeal of the 19th-century ": null
    },
    {
        "unequal treaties": "Unequal Treaties"
    },
    {
        " and the restoration of full Siamese sovereignty. The United States obliged in 1920, while France and Britain followed in 1925. This victory gained the king some popularity, but it was soon undercut by discontent over other issues, such as his extravagance, which became more noticeable when a sharp postwar recession hit Siam in 1919. There was also the fact that the king had no son. He obviously preferred the company of men to women .     Thus when Rama VI died suddenly in 1925, aged only 44, the monarchy was already in a weakened state. He was succeeded by his younger brother ": null
    },
    {
        "Prajadhipok": "Prajadhipok"
    },
    {
        ".     By 1925–1926, Siamese ": null
    },
    {
        "extraterritorial": "Extraterritorial"
    },
    {
        " rights were restored a period of five years thereafter.                    A small circle from the rising bourgeoisie of former students , supported by some military men, seized power from the absolute monarchy on 24 June 1932 in an almost nonviolent revolution. This was also called the ": null
    },
    {
        "Siamese Revolution": "Siamese Revolution Of 1932"
    },
    {
        " . The group, which called themselves  Khana Ratsadon  or sponsors, gathered officers, intellectuals and bureaucrats, who represented the idea of the refusal of the absolute monarchy.     The Khana Ratsadon installed a ": null
    },
    {
        "constitutional monarchy": "Constitutional Monarchy"
    },
    {
        " with Prajadhipok as king at the top – a corresponding constitution was proclaimed on 10 December of the year. On the same day, the experienced and rather conservative lawyer ": null
    },
    {
        "Phraya Manopakorn Nititada": "Phraya Manopakorn Nititada"
    },
    {
        ", was appointed as first Siamese ": null
    },
    {
        "Prime Minister": "Prime Minister Of Thailand"
    },
    {
        ". By selecting a non-party head of government, the Khana Ratsadon wanted to avoid the suspicion that the coup had only been carried out in order to come to power itself. However, the overthrow of the monarchy did not lead to free elections, political unions were forbidden. Bureaucracy and the military shared the power in the ": null
    },
    {
        "National Assembly": "National Assembly"
    },
    {
        ". The constitution was annexed to the monarchist ideology as a fourth pillar.     In the following period it became clear how heterogeneous the group of Khana Ratsadon was, and it fell into several rival wings, especially those of the high officers, the younger officers and the civilians. For the predecessor of the liberal and civilian wing, ": null
    },
    {
        "Pridi Phanomyong": "Pridi Phanomyong"
    },
    {
        " it was not done with the mere change of government form. He sought a profound transformation of the countrys social and economic system. To this end, he presented an economic plan in January 1933, which became known as a Yellow Cover Dossier . Among other things, he proposed the ": null
    },
    {
        "nationalisation": "Nationalisation"
    },
    {
        " of farmland, ": null
    },
    {
        "Industrialization": "Industrialization"
    },
    {
        " by ": null
    },
    {
        "Public Company": "Public Company"
    },
    {
        ", general health care and pension insurance. The King, the rather conservative Prime Minister Phraya Manopakorn, but also the high-ranking officers in the Khana Ratsadon around ": null
    },
    {
        "Phraya Songsuradet": "Phraya Songsuradet"
    },
    {
        " and even Pridis friend and co-worker ": null
    },
    {
        "Prayun Phamonmontri": "Prayun Phamonmontri"
    },
    {
        ".     Fearing that Pridiss liberal wing, who had the majority in the National Assembly, would decide to take a decision, Phraya Manopakorn dissolved the parliament in April, imposed the emergency, and rescinded the constitutional part, which had not yet been a year old. He imposed a law against Communist activities, which was directed not so much against the almost insignificant ": null
    },
    {
        "Communist Party of Thailand": "Communist Party Of Thailand"
    },
    {
        ", but rather against the alleged Communist projects Pridis. However, the younger officers of the Khana Ratsadon resisted and countered the oppressive actions of Phraya Manopakorn lead to another ": null
    },
    {
        "coup détat": "Siamese Coup Détat Of 1933"
    },
    {
        " only one year later, in June 1933, resulting in the appointment of ": null
    },
    {
        "Phraya Phahon": "Phot Phahonyothin"
    },
    {
        " as Siams second prime minister.     After the fall of Phraya Manopakorn, Phraya Phahon became the new Prime Minister. In his reign, the younger officers of the Khana Ratsadon, chiefly their leader ": null
    },
    {
        "Phibunsongkhram": "Plaek Phibunsongkhram"
    },
    {
        ", played a decisive role. Pridi Phanomyong was expelled from the charge of communism, but his economic plan was largely ignored. Only a few of his ideas, such as the expansion of primary schools and industrialisation with state enterprises, were gradually implemented. In 1933, Pridis founded the ": null
    },
    {
        "Thammasat University": "Thammasat University"
    },
    {
        " in Bangkok, which with its liberal self-image has remained a symbol of freedom and democracy. At the same time, the nationalist group led by Phibunsongkhram strengthened in the Peoples Party, oriented to the totalitarian ideas of Italy, Germany, Japan, but also the young Turks .          The many unsettled constitutional roles of the crown and the dissatisfaction with Khana Ratsadons seizure of power culminated in October 1933 in a counter-coup, the ": null
    },
    {
        "Boworadet Rebellion": "Boworadet Rebellion"
    },
    {
        " staged by royalist factions. The royalists were led by ": null
    },
    {
        "Prince Boworadet": "Prince Boworadet"
    },
    {
        ", a grandson of ": null
    },
    {
        "Mongkut": "Mongkut"
    },
    {
        " and one-time minister of defence, led an armed revolt against the government. He ": null
    },
    {
        "mobilised": "Mobilised"
    },
    {
        " various provincial garrisons and marched on Bangkok, capturing the ": null
    },
    {
        "Don Muang Aerodrome": "Don Mueang International Airport"
    },
    {
        " along the way, this led Siam into small-scale civil War, The prince accused the government of disrespecting the king and promoting communism, and he demanded that the government leaders resign. He had hoped that some of the garrisons in the Bangkok area would join the revolt, but they remained loyal to the government. Meanwhile, the navy declared itself neutral and left for its bases in the south. After heavy fighting in the northern outskirts of Bangkok, the royalists were finally defeated and Prince Boworadet left for exile in ": null
    },
    {
        "French Indochina": "French Indochina"
    },
    {
        ". After the Boworadet rebellion, King Prajadhipok abdicated the throne and left Siam never to return, he exiled in Britain, He was replaced as king by his nine-year-old nephew Prince ": null
    },
    {
        "Ananda Mahidol": "Ananda Mahidol"
    },
    {
        " , who at that time was attending school in ": null
    },
    {
        "Lausanne": "Lausanne"
    },
    {
        ", ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        ", the Khana Ratsadon believing that he would be more pliable than Prajadhipok.     After the Boworadet Rebellion, ": null
    },
    {
        "Plaek Pibulsonggram": "Plaek Pibulsonggram"
    },
    {
        " influences over politics increased, to purge the country of his political enemies and rivals . The roots of the rebellion began during the Coup détat of June 1933, when Phraya Phahon Phonphayuhasena ousted Phraya Manopakorn Nititada and replace Phibun as Prime Minister. Phraya Songsuradet was a supporter of Phraya Manopakorn and many of his companions were barred from politics for life by Phibun.     When Phibulsonggram succeeded Phraya Phahon as Prime Minister of Thailand on 11 September 1938, there were many resistance to his premiership based on his dictatorial style and cronyism. The military, now led by Major General Phibun as Defence Minister, and the civilian liberals led by Pridi as Foreign Minister, worked together harmoniously for several years, but when Phibun became prime minister in December 1938 this co-operation broke down, and military domination became more overt.             In 1938, ": null
    },
    {
        "Phibunsongkhram": "Plaek Phibunsongkhram"
    },
    {
        ", an open supporter of Mussolini and Hitler, began moving the government towards the right. By 1942 he had issued a series of cultural decrees or Thai cultural mandates, which reflected the desire for social modernisation, but also an authoritarian and exaggerated nationalist spirit. First, in 1939 he changed the countrys name of ": null
    },
    {
        "Siam": "Siam"
    },
    {
        " to ": null
    },
    {
        "Thailand": "Thailand"
    },
    {
        "  . This was directed against the ethnic diversity in the country and is based on the idea of a Thai race , a ": null
    },
    {
        "Pan-Thai nationalism": "Pan-Thaiism"
    },
    {
        " whose program is the integration of the ": null
    },
    {
        "Shan": "Shan People"
    },
    {
        ", the ": null
    },
    {
        "Lao": "Lao People"
    },
    {
        " and other ": null
    },
    {
        "Tai peoples": "Tai Peoples"
    },
    {
        ", such as those in ": null
    },
    {
        "Vietnam": "Vietnam"
    },
    {
        ", Burma and South China, into a Great Kingdom of Thailand . Other decrees urged the citizens only to call themselves Thai , urged the use of regional dialects and other languages, demanded respect for the flag, the national and royal anthem, and the purchase of Thai products. Chinese names had to be changed into Thai ones, and candidates for the military academy had to prove that they were pure-blooded Thais. Finally, the use of Western clothing and customs was prescribed.     The defeat of France in ": null
    },
    {
        "Battle of France": "Battle Of France"
    },
    {
        " was the catalyst for Thai leadership to begin an attack on French colonies in ": null
    },
    {
        "Indochina": "Indochina"
    },
    {
        ". This began with smaller conflicts in 1940 and resulted in the ": null
    },
    {
        "Franco-Thai War": "Franco-Thai War"
    },
    {
        " in 1941. It had to accept a heavy defeat in the sea ": null
    },
    {
        "Battle of Ko Chang": "Battle Of Ko Chang"
    },
    {
        ", but it dominated on land and in the air. The ": null
    },
    {
        "Empire of Japan": "Empire Of Japan"
    },
    {
        ", already the dominant power in the Southeast Asian region, took over the role of the mediator. The negotiations ended the ": null
    },
    {
        "Franco-Thai War": "Franco-Thai War"
    },
    {
        " with Thai territorial gains in the French colonies ": null
    },
    {
        "Laos": "Laos"
    },
    {
        " and ": null
    },
    {
        "Cambodia": "Cambodia"
    },
    {
        ". In celebration of the victory, Phibun called himself Than phu nam  so as to run a ": null
    },
    {
        "personality cult": "Personality Cult"
    },
    {
        " around himself.          After the Franco-Thai war ended, the Thai government declared ": null
    },
    {
        "neutrality": "Country Neutrality"
    },
    {
        ". When the ": null
    },
    {
        "Japanese invaded Thailand": "Japanese Invasion Of Thailand"
    },
    {
        " on 8 December 1941, a few hours after the ": null
    },
    {
        "attack on Pearl Harbor": "Attack On Pearl Harbor"
    },
    {
        ", Japan demanded the right to move troops across Thailand to the Malayan frontier. ": null
    },
    {
        "Phibun": "Phibun"
    },
    {
        " turned crisis into opportunity by ordering an armistice. Shortly thereafter Japan was granted free passage, and on 21 December 1941, Thailand and Japan signed a military alliance. Subsequently, Thailand undertook to assist Japan in its war against the Allies. Phibun was forced to order a general ceasefire after just one day of resistance and allow the Japanese armies to use the country as a base for their invasions of Burma and Malaya.  Hesitancy, however, gave way to enthusiasm after the Japanese rolled their way through ": null
    },
    {
        "Malaya": "Malayan Campaign"
    },
    {
        " in a ": null
    },
    {
        "Bicycle": "Bicycle Infantryworld Wars"
    },
    {
        " Blitzkrieg with surprisingly little resistance.   On 21 December, Phibun signed a military alliance with Japan. The following month, on 25 January 1942, Phibun declared war on Britain and the United States. ": null
    },
    {
        "South Africa": "Union Of South Africa"
    },
    {
        " and ": null
    },
    {
        "New Zealand": "New Zealandforeign Relations And The Military"
    },
    {
        " declared war on Thailand on the same day. ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " followed soon after.  All who opposed the Japanese alliance were sacked from his government. ": null
    },
    {
        "Pridi Phanomyong": "Pridi Phanomyong"
    },
    {
        " was appointed acting regent for the absent King ": null
    },
    {
        "Ananda Mahidol": "Ananda Mahidol"
    },
    {
        ", while ": null
    },
    {
        "Direk Jayanama": "Direk Jayanama"
    },
    {
        ", the prominent foreign minister who had advocated continued resistance against the Japanese, was later sent to Tokyo as an ambassador. The United States considered Thailand to be a puppet of Japan and refused to declare war. When the allies were victorious, the United States blocked British efforts to impose a punitive peace. I.C.B Dear, ed, The Oxford companion to World War II p 1107     The Thais and Japanese agreed that ": null
    },
    {
        "Shan State": "Shan State"
    },
    {
        " and ": null
    },
    {
        "Kayah State": "Kayah State"
    },
    {
        " were to be under Thai control. The rest of Burma was to be under Japanese control. On 10 May 1942, the Thai ": null
    },
    {
        "Phayap Army": "Phayap Army"
    },
    {
        " entered Burmas eastern Shan State, the Thai Burma Area Army entered Kayah State and some parts of central Burma. Three Thai infantry and one cavalry division, spearheaded by armoured reconnaissance groups and supported by the air force, engaged the retreating Chinese 93rd Division. ": null
    },
    {
        "Kengtung": "Kengtung"
    },
    {
        ", the main objective, was captured on 27 May. Renewed offensives in June and November saw the Chinese retreat into ": null
    },
    {
        "Yunnan": "Yunnan"
    },
    {
        ".  The area containing the Shan States and Kayah State was annexed by Thailand in 1942. They would be ceded back to ": null
    },
    {
        "Burma": "Burma"
    },
    {
        " in 1945.     The ": null
    },
    {
        "Seri Thai": "Seri Thai"
    },
    {
        "  was an underground resistance movement against Japan founded by ": null
    },
    {
        "Seni Pramoj": "Seni Pramoj"
    },
    {
        ", the Thai ambassador in ": null
    },
    {
        "Washington": "Washington, D.C."
    },
    {
        ", with the assistance of the ": null
    },
    {
        "United States Office of Strategic Services": "United States Office Of Strategic Services"
    },
    {
        " . Led from within Thailand from the office of the ": null
    },
    {
        "regent": "Regent"
    },
    {
        " Pridi": "Pridi"
    },
    {
        ", it operated freely, often with support from members of the royal family such as Prince ": null
    },
    {
        "Chula Chakrabongse": "Chula Chakrabongse"
    },
    {
        ", and members of the government. As Japan neared defeat and the underground anti-Japanese resistance Seri Thai steadily grew in strength, the National Assembly forced out Phibun. His six-year reign as the military ": null
    },
    {
        "commander-in-chief": "Commander-In-Chief"
    },
    {
        " was at an end. His resignation was partly forced by his two grandiose plans gone awry. One was to relocate the capital from Bangkok to a remote site in the jungle near ": null
    },
    {
        "Phetchabun": "Phetchabun Province"
    },
    {
        " in north-central Thailand. The other was to build a Buddhist city near ": null
    },
    {
        "Saraburi": "Saraburi Province"
    },
    {
        ". Announced at a time of severe economic difficulty, these ideas turned many government officers against him.      At wars end, Phibun was put on trial at Allied insistence on charges of having committed ": null
    },
    {
        "war crime": "War Crime"
    },
    {
        "s, mainly that of collaborating with the Axis powers. However, he was acquitted amid intense public pressure. Public opinion was still favourable to Phibun, as he was thought to have done his best to protect Thai interests, specifically using alliance with Japan to support the expansion of Thai territory in ": null
    },
    {
        "Malaya": "Malayan Campaign"
    },
    {
        " and ": null
    },
    {
        "Burma": "Burma Campaign"
    },
    {
        ". Aldrich, Richard J. The Key to the South: Britain, the United States, and Thailand during the Approach of the Pacific War, 1929–1942. Oxford University Press, 1993.               After Japans defeat in 1945, British, Indian troops, and US observers landed in September, and during their brief occupation of parts of the country disarmed the Japanese troops. After repatriating them, the British left in March 1946. US support for Thailand blunted Allied demands, although the British demanded reparations in the form of rice sent to Malaya, and the French the return of territories lost in the ": null
    },
    {
        "Franco-Thai War": "Franco-Thai War"
    },
    {
        ". In exchange for supporting Thailands admission to the United Nations, the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " demanded the repeal of the anti-communist legislation. Former British POWs erected a monument expressing gratitude to the citizens of ": null
    },
    {
        "Ubon Ratchathani": "Ubon Ratchathani"
    },
    {
        " for their kindnesses.     In early September the leading elements of Major General ": null
    },
    {
        "Geoffrey Charles Evanss": "Geoffrey Charles Evans"
    },
    {
        " Indian 7th Infantry Division": "Indian 7Th Infantry Division"
    },
    {
        " landed, accompanied by ": null
    },
    {
        "Edwina Mountbatten": "Edwina Mountbatten"
    },
    {
        ". Later that month ": null
    },
    {
        "Seni Pramoj": "Seni Pramoj"
    },
    {
        " returned from Washington to succeed Tawee as prime minister. It was the first time in over a decade that the government had been controlled by civilians. But the ensuing factional scramble for power in late 1945 created political divisions in the ranks of the civilian leaders that destroyed their potential for making a common stand against the resurgent political force of the military in the post-war years.     Following the signature by Thailand of the Washington Accord of 1946,   the territories that had been annexed after the ": null
    },
    {
        "Franco-Thai War": "Franco-Thai War"
    },
    {
        ", which included ": null
    },
    {
        "Phibunsongkhram Province": "Phibunsongkhram Province"
    },
    {
        ", ": null
    },
    {
        "Nakhon Champassak Province": "Nakhon Champassak Province"
    },
    {
        ", ": null
    },
    {
        "Phra Tabong Province": "Phra Tabong Province"
    },
    {
        ", ": null
    },
    {
        "Koh Kong Province": "Koh Kong Province"
    },
    {
        " and ": null
    },
    {
        "Lan Chang Province": "Lan Chang Province"
    },
    {
        ", were returned to Cambodia and Laos.      Moreover, the post-war accommodations with the Allies weakened the civilian government. As a result of the contributions made to the Allied war effort by the Free Thai Movement, the United States, which unlike the other Allies had never officially been at war with Thailand, refrained from dealing with Thailand as an enemy country in post-war peace negotiations. Before signing a peace treaty, however, Britain demanded war reparations in the form of rice shipments to Malaya. An ": null
    },
    {
        "Anglo-Thai Peace Treaty": "Anglo-Thai Peace Treaty"
    },
    {
        " was signed on 1 January 1946, and an ": null
    },
    {
        "Australian–Thai Peace Treaty": "Australian–Thai Peace Treaty"
    },
    {
        " on 3 April. France refused to permit admission of Thailand to the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " until Indochinese territories annexed during the war were returned. The ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " insisted on the repeal of anti-communist legislation.            Elections were held in January 1946. These were the first elections in which political parties were legal, and Pridis Peoples Party and its allies won a majority. In March 1946 Pridi became Siams first democratically elected prime minister. In 1946, after he agreed to hand back the Indochinese territories occupied in 1941 as the price for admission to the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        ", all wartime claims against Siam were dropped and substantial US aid was received.     In December 1945, the young king ": null
    },
    {
        "Ananda Mahidol": "Ananda Mahidol"
    },
    {
        " had returned to Siam from Europe, but in June 1946 he was found shot dead in his bed, under mysterious circumstances. Three palace servants were tried and executed for his murder, although there are significant doubts as to their guilt and the case remains both murky and a highly sensitive topic in Thailand today. The king was succeeded by his younger brother, ": null
    },
    {
        "Bhumibol Adulyadej": "Bhumibol Adulyadej"
    },
    {
        ". In August Pridi was forced to resign amid suspicion that he had been involved in the regicide. Without his leadership, the civilian government foundered, and in November 1947 the army, its confidence restored after the debacle of 1945, seized power. After an interim Khuang-headed government, in April 1948 the army brought Phibun back from exile and made him prime minister. Pridi, in turn, was driven into exile, eventually settling in ": null
    },
    {
        "Beijing": "Beijing"
    },
    {
        " as a guest of the ": null
    },
    {
        "PRC": "China"
    },
    {
        ".     Phibuns return to power coincided with the onset of the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        " and the establishment of a communist regime in ": null
    },
    {
        "North Vietnam": "North Vietnam"
    },
    {
        ". He soon won the support of the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        ". Once again political opponents were arrested and tried, and some were executed. During this time, several of the key figures in the wartime Free Thai underground, including Thawin Udom, Thawi Thawethikul, Chan Bunnak, and Tiang Sirikhanth, were eliminated in extra-legal fashion by the Thai police, run by Phibuns ruthless associate ": null
    },
    {
        "Phao Sriyanond": "Phao Sriyanond"
    },
    {
        ". There were attempted counter-coups by Pridi supporters in 1948, 1949, and 1951, the second leading to heavy fighting between the army and navy before Phibun emerged victorious. In the navys 1951 attempt, popularly known as the ": null
    },
    {
        "Manhattan Coup": "Manhattan Coup"
    },
    {
        ", Phibun was nearly killed when the ship where he was held hostage was bombed by the pro-government air force.     Although nominally a constitutional monarchy, Thailand was ruled by a series of military governments, most prominently led by Phibun, interspersed with brief periods of democracy. Thailand ": null
    },
    {
        "took part": "Thailand In The Korean War"
    },
    {
        " in the ": null
    },
    {
        "Korean War": "Korean War"
    },
    {
        ". ": null
    },
    {
        "Communist Party of Thailand": "Communist Party Of Thailand"
    },
    {
        " guerrilla forces operated inside the country from the early-1960s to 1987. They included 12,000 full-time fighters at the peak of movement, but never posed a serious threat to the state.               By 1955 Phibun was losing his leading position in the army to younger rivals led by Field Marshal ": null
    },
    {
        "Sarit Thanarat": "Sarit Thanarat"
    },
    {
        " and General ": null
    },
    {
        "Thanom Kittikachorn": "Thanom Kittikachorn"
    },
    {
        ", the Sarits army staged a bloodless coup on 17 September 1957, ending Phibuns career for good. The coup beginning a long tradition of US-backed military regimes in Thailand. Thanom became prime minister until 1958, then yielded his place to Sarit, the real head of the regime. Sarit held power until his death in 1963, when Thanom again took the lead.          The regimes of Sarit and Thanom were strongly supported by the US. Thailand had formally become a US ally in 1954 with the formation of the ": null
    },
    {
        "SEATO": "Southeast Asia Treaty Organization"
    },
    {
        " While the war in Indochina was being fought between the Vietnamese and the French, Thailand stayed aloof, but once it became a war between the US and the Vietnamese communists, Thailand committed itself strongly to the US side, concluding a secret agreement with the US in 1961, sending troops to Vietnam and Laos, and allowing the US to use ": null
    },
    {
        "airbases": "Royal Thai Air Force Bases"
    },
    {
        " in the east of the country to conduct its bombing war against ": null
    },
    {
        "North Vietnam": "North Vietnam"
    },
    {
        ". The Vietnamese retaliated by supporting the ": null
    },
    {
        "Communist Party of Thailands": "Communist Party Of Thailand"
    },
    {
        "insurgency in the north, northeast, and sometimes in the south, where guerrillas co-operated with local discontented Muslims. In the postwar period, Thailand had close relations with the US, which it saw as a protector from communist revolutions in neighbouring countries. The Seventh and Thirteenth US Air Forces were headquartered at ": null
    },
    {
        "Udon Royal Thai Air Force Base": "Udon Royal Thai Air Force Base"
    },
    {
        ". Jeffrey D. Glasser, The Secret Vietnam War: The United States Air Force in Thailand, 1961–1975                Agent Orange, a herbicide and ": null
    },
    {
        "defoliant": "Defoliant"
    },
    {
        " chemical used by the U.S. military as part of its herbicidal warfare program, ": null
    },
    {
        "Operation Ranch Hand": "Operation Ranch Hand"
    },
    {
        ", was tested by the United States in Thailand during the war in Southeast Asia. Buried drums were uncovered and confirmed to be Agent Orange in 1999.  Workers who uncovered the drums fell ill while upgrading the airport near ": null
    },
    {
        "Hua Hin District": "Hua Hin District"
    },
    {
        ", 100  km south of Bangkok.      US Vietnam-era veterans whose service involved duty on or near the perimeters of military bases in Thailand anytime between 28 February 1961, and 7 May 1975, may have been exposed to herbicides and may qualify for VA benefits.       A declassified US Department of Defense report written in 1973 suggests that there was a significant use of herbicides on the fenced-in perimeters of military bases in Thailand to remove foliage that provided cover for enemy forces.          Between 1962 and 1965, 350 Thai nationals underwent an eight-month training course in ": null
    },
    {
        "North Vietnam": "North Vietnam"
    },
    {
        ". In the first half of 1965, the rebels smuggled approximately 3,000 US-made weapons and 90,000 rounds of ammunition from Laos.       Between 1961 and 1965, insurgents carried out 17 political assassinations. They avoided full scale guerrilla warfare until the summer of 1965, when militants began engaging Thai security forces. A total of 13 clashes were recorded during that period. The second half of 1965 was marked by a further 25 violent incidents, and starting in November 1965, ": null
    },
    {
        "Communist Party of Thailand": "Communist Party Of Thailand"
    },
    {
        " insurgents began undertaking more elaborate operations.     The insurgency spread to other parts of Thailand in 1966, although 90 percent of insurgency-related incidents occurred in the northeast of the country. On 14 January 1966, a spokesman representing the ": null
    },
    {
        "Thai Patriotic Front": "Thai Patriotic Front"
    },
    {
        " called for the start of a peoples war in Thailand. The statement marked an escalation of violence in the conflict.  The insurgency had come to an end only by 1983.                 The Vietnam War hastened the modernisation and Westernisation of Thai society. The American presence and the exposure to Western culture that came with it had an effect on almost every aspect of Thai life. Before the late 1960s, full access to Western culture was limited to a highly educated elite in society, but the Vietnam War brought the outside world face to face with large segments of the Thai society as never before. With US dollars pumping up the economy, the service, transportation, and construction industries grew phenomenally as did ": null
    },
    {
        "drug abuse": "Drug Abuse"
    },
    {
        " and ": null
    },
    {
        "prostitution": "Prostitute"
    },
    {
        ". The traditional rural family unit was broken down as more and more rural Thais moved to the city to find new jobs. This led to a clash of cultures as Thais were exposed to Western ideas about fashion, music, values, and moral standards.     The population began to grow explosively as the standard of living rose, and a flood of people began to move from the villages to the cities, and above all to Bangkok. Thailand had 30 million people in 1965, while by the end of the 20th century the population had doubled. Bangkoks population had grown tenfold since 1945 and had tripled since 1970.     Educational opportunities and exposure to mass media increased during the Vietnam War years. Bright university students learned more about ideas related to Thailands economic and political systems, resulting in a revival of student activism. The Vietnam War period also saw the growth of the Thai middle class which gradually developed its own identity and consciousness.     Economic development did not bring prosperity to all. During the 1960s many of the rural poor felt increasingly dissatisfied with their condition in society and disillusioned by their treatment by the central government in Bangkok. Efforts by the Thai government to develop poor rural regions often did not have the desired effect in that they contributed to the farmers awareness of how bad off they really were. It was not always the poorest of the poor who joined the anti-government insurgency. Increased government presence in the rural villages did little to improve the situation. Villagers became subject to increased military and police harassment and bureaucratic corruption. Villagers often felt betrayed when government promises of development were frequently not fulfilled. By the early 1970s rural discontent had manifested itself into a peasants activist movement.          Student demonstrations had started in 1968 and grew in size and numbers in the early 1970s despite the continued ban on political meetings. In June 1973, nine ": null
    },
    {
        "Ramkhamhaeng University": "Ramkhamhaeng University"
    },
    {
        " students were expelled for publishing an article in a student newspaper that was critical of the government. Shortly after, thousands of students held a protest at the ": null
    },
    {
        "Democracy Monument": "Democracy Monument"
    },
    {
        " demanding the re-enrolment of the nine students. The government ordered the universities to shut, but shortly afterwards allowed the students to be re-enrolled.     In October another 13 students were arrested on charges of conspiracy to overthrow the government. This time the student protesters were joined by workers, businessmen, and other ordinary citizens. The demonstrations swelled to several hundred thousand and the issue broadened from the release of the arrested students to demands for a new constitution and the replacement of the current government.     On 13 October, the government released the detainees. Leaders of the demonstrations, among them ": null
    },
    {
        "Seksan Prasertkul": "Seksan Prasertkul"
    },
    {
        ", called off the march in accordance with the wishes of the king who was publicly against the democracy movement. In a speech to graduating students, he criticised the pro-democracy movement by telling students to concentrate on their studies and leave politics to their elders     As the crowds were breaking up the next day, on 14 October, many students found themselves unable to leave because the police blocked the southern route to ": null
    },
    {
        "Rajavithi Road": "Rajavithi Road"
    },
    {
        ". Cornered and overwhelmed by the hostile crowd, the police responded with teargas and gunfire.     The military was called in, and tanks rolled down ": null
    },
    {
        "Ratchadamnoen Avenue": "Ratchadamnoen Avenue"
    },
    {
        " and helicopters fired down at ": null
    },
    {
        "Thammasat University": "Thammasat University"
    },
    {
        ". A number of students commandeered buses and fire engines in an attempt to halt the progress of the tanks by ramming into them. With chaos on the streets, King ": null
    },
    {
        "Bhumibol": "Bhumibol"
    },
    {
        " opened the gates of ": null
    },
    {
        "Chitralada Palace": "Chitralada Palace"
    },
    {
        " to the students who were being gunned down by the army. Despite orders from Thanom that the military action be intensified, army commander ": null
    },
    {
        "Kris Sivara": "Kris Sivara"
    },
    {
        " had the army withdrawn from the streets.     The king condemned the governments inability to handle the demonstrations and ordered Thanom, Praphas, and Narong to leave the country, and notably condemned the students supposed role as well. At 18:10 Field Marshal Thanom Kittikachorn resigned from his post as prime minister. An hour later, the king appeared on national television, asking for calm, and announcing that Field Marshal Thanom Kittikachorn had been replaced with Dr. ": null
    },
    {
        "Sanya Dharmasakti": "Sanya Dharmasakti"
    },
    {
        ", a respected law professor, as prime minister.            Post-1973 has been marked by a struggle to define the political contours of the state. It was won by the king and General ": null
    },
    {
        "Prem Tinsulanonda": "Prem Tinsulanonda"
    },
    {
        ", who favoured a monarchial constitutional order.     The post-1973 years have seen a difficult and sometimes bloody transition from military to civilian rule, with several reversals along the way. The revolution of 1973 inaugurated a brief, unstable period of democracy, with ": null
    },
    {
        "military rule": "Military Junta"
    },
    {
        " being reimposed after the ": null
    },
    {
        "6 October 1976 Massacre": "6 October 1976 Massacre"
    },
    {
        ". For most of the 1980s, Thailand was ruled by ": null
    },
    {
        "Prem Tinsulanonda": "Prem Tinsulanonda"
    },
    {
        ", a democratically inclined strongman who restored parliamentary politics. Thereafter the country remained a democracy apart from a brief period of military rule from 1991 to 1992.                     The populist ": null
    },
    {
        "Thai Rak Thai": "Thai Rak Thai"
    },
    {
        " party, led by Prime Minister ": null
    },
    {
        "Thaksin Shinawatra": "Thaksin Shinawatra"
    },
    {
        ", came to power in 2001. He was popular with the urban, suburban, and rural poor for his populist social programs. His rule came under attack from elites who saw danger in his parliamentary dictatorship . In mid-2005, ": null
    },
    {
        "Sondhi Limthongkul": "Sondhi Limthongkul"
    },
    {
        ", a well-known media tycoon, became the foremost Thaksin critic. Eventually, Sondhi and his allies developed the movement into a mass protest and later unified under the name of ": null
    },
    {
        "Peoples Alliance for Democracy": "Peoples Alliance For Democracy"
    },
    {
        " .     On 19 September 2006, after the dissolution of parliament, Thaksin became head of a provisional government. While he was in New York for a meeting of the UN, Army Commander-in-Chief Lieutenant General ": null
    },
    {
        "Sonthi Boonyaratglin": "Sonthi Boonyaratglin"
    },
    {
        " launched the bloodless ": null
    },
    {
        "September 2006 Thailand military coup détat": "September 2006 Thailand Military Coup Détat"
    },
    {
        " supported by anti-Thaksin elements in civil society and the ": null
    },
    {
        "Democrat Party": "Democrat Party"
    },
    {
        ". A general election on 23 December 2007 restored a civilian government, led by ": null
    },
    {
        "Samak Sundaravej": "Samak Sundaravej"
    },
    {
        " of the ": null
    },
    {
        "Peoples Power Party": "Peoples Power Party"
    },
    {
        ", as a successor to Thai Rak Thai.          Without meeting much resistance, a ": null
    },
    {
        "military junta": "Military Junta"
    },
    {
        " overthrew the interim government of ": null
    },
    {
        "Thaksin Shinawatra": "Thaksin Shinawatra"
    },
    {
        " on 19 September 2006. The ": null
    },
    {
        "junta": "Military Dictatorship"
    },
    {
        " abrogated": "Wikt:Abrogated"
    },
    {
        " the constitution, dissolved Parliament and the Constitutional Court, detained and later removed several members of the government, declared ": null
    },
    {
        "martial law": "Martial Law"
    },
    {
        ", and appointed one of the kings Privy Counselors, General ": null
    },
    {
        "Surayud Chulanont": "Surayud Chulanont"
    },
    {
        ", as the Prime Minister. The junta later wrote a highly abbreviated ": null
    },
    {
        "interim constitution": "2006 Interim Constitution Of Thailand"
    },
    {
        " and appointed a panel to draft a new permanent constitution. The junta also appointed a 250-member legislature, called by some critics a chamber of generals while others claimed that it lacks representatives from the poor majority. The Nation,  , 14 October 2006 The Nation,  , 14 October 2006     In this interim constitution draft, the head of the junta was allowed to remove the prime minister at any time. The legislature was not allowed to hold a vote of confidence against the cabinet and the public was not allowed to file comments on bills. The Nation,  , 27 September 2006 This interim constitution was later surpassed by ": null
    },
    {
        "the permanent constitution": "2007 Constitution Of Thailand"
    },
    {
        " on 24 August 2007. Martial law was partially revoked in January 2007. The ban on political activities was lifted in July 2007,  following the ": null
    },
    {
        "30 May dissolution": "Party Dissolution Charges In Thai Politics, 2006"
    },
    {
        " of the ": null
    },
    {
        "Thai Rak Thai": "Thai Rak Thai"
    },
    {
        " party. The new constitution was approved by referendum on 19 August, which led to a return to a ": null
    },
    {
        "democratic general election": "2007 Thai General Election"
    },
    {
        " on 23 December 2007.                  The ": null
    },
    {
        "Peoples Power Party ": "Peoples Power Party"
    },
    {
        " , led by ": null
    },
    {
        "Samak Sundaravej": "Samak Sundaravej"
    },
    {
        " formed a government with five smaller parties. Following several court rulings against him in a variety of scandals, and surviving a vote of no confidence, and protesters blockading government buildings and airports, in September 2008, Sundaravej was found guilty of conflict of interest by the ": null
    },
    {
        "Constitutional Court of Thailand": "Constitutional Court Of Thailand"
    },
    {
        " ,  and thus, ended his term in office.     He was replaced by PPP member ": null
    },
    {
        "Somchai Wongsawat": "Somchai Wongsawat"
    },
    {
        ". As of October 2008, Wongsawat was unable to gain access to his offices, which were occupied by protesters from the ": null
    },
    {
        "Peoples Alliance for Democracy": "Peoples Alliance For Democracy"
    },
    {
        ". On 2 December 2008, Thailands Constitutional Court in a highly controversial ruling found the Peoples Power Party . Der Spiegel, 2 December 2008 guilty of electoral fraud, which led to the dissolution of the party according to the law. It was later alleged in media reports that at least one member of the judiciary had a telephone conversation with officials working for the Office of the Privy Council and one other person. The phone call was taped and has since circulated on the Internet. In it, the callers discuss finding a way to ensure the ruling PPP party would be disbanded. Accusations of judicial interference were levelled in the media but the recorded call was dismissed as a hoax. However, in June 2010, supporters of the eventually disbanded PPP were charged with tapping a judges phone.     Immediately following what many media described as a judicial coup , a senior member of the armed forces met with factions of the governing coalition to get their members to join the opposition and the ": null
    },
    {
        "Democrat Party": "Democrat Party"
    },
    {
        " was able to form a government, a first for the party since 2001. The leader of the Democrat Party, and former leader of the opposition, ": null
    },
    {
        "Abhisit Vejjajiva": "Abhisit Vejjajiva"
    },
    {
        " was appointed and sworn-in as the 27th ": null
    },
    {
        "Prime Minister": "Prime Minister Of Thailand"
    },
    {
        ", together with a new cabinet, on 17 December 2008.     In April 2009, protests by the ": null
    },
    {
        "National United Front of Democracy Against Dictatorship": "National United Front Of Democracy Against Dictatorship"
    },
    {
        "  forced the cancellation of the ": null
    },
    {
        "Fourth East Asia Summit": "Fourth East Asia Summit"
    },
    {
        " after protesters stormed the Royal Cliff Hotel venue in Pattaya, smashing the glass doors of the venue to gain entry, and a blockade prevented the Chinese premier at the time, ": null
    },
    {
        "Wen Jiabao": "Wen Jiabao"
    },
    {
        ", from attending.       About a year later, a set of new ": null
    },
    {
        "Red Shirts protests": "2010 Thai Political Protests"
    },
    {
        " resulted in 87 deaths and 1,378 injured.  When the army tried to disperse protesters on 10 April 2010, the army was met with automatic gunfire, grenades, and fire bombs from an opposition faction in the army. This resulted in the army returning fire with rubber bullets and some live ammunition. During the time of the Red Shirt protests against the government, there were numerous grenade and bomb attacks against government offices and the homes of government officials. Gas grenades were fired at Yellow Shirt protesters who were protesting against the Red Shirts and in favour of the government, by unknown gunmen killing one pro-government protester, the government stated that the Red Shirts were firing the weapons at civilians. BBC News, , 11 April 2010 Aj Jazeera English, , 11 April 2010 , NST Online Australia, 11 April 2010 , Bangkok Post, 15 April 2010 Red Shirts continued to hold a position in the business district of Bangkok and it was shut down for several weeks.      On 3 July 2011, the opposition ": null
    },
    {
        "Pheu Thai Party": "Pheu Thai Party"
    },
    {
        ", led by ": null
    },
    {
        "Yingluck Shinawatra": "Yingluck Shinawatra"
    },
    {
        " , won the ": null
    },
    {
        "general election": "2011 Thai General Election"
    },
    {
        " by a landslide . She had never previously been involved in politics, Pheu Thai campaigning for her with the slogan Thaksin thinks, Pheu Thai acts . Yingluck was the nations first female prime minister and her role was officially endorsed in a ceremony presided over by King Bhumibol Adulyadej. The Pheu Thai Party is a continuation of Thaksins Thai Rak Thai party.                Protests recommenced in late 2013, as a broad alliance of protesters, led by former opposition deputy leader ": null
    },
    {
        "Suthep Thaugsuban": "Suthep Thaugsuban"
    },
    {
        ", demanded an end to the Thaksin regime. A blanket amnesty for people involved in the 2010 protests, altered at the last minute to include all political crimes, including all convictions against Thaksin, triggered a mass show of discontent, with numbers variously estimated between 98,500 and 400,000 , taking to the streets. The Senate was urged to reject the bill to quell the reaction, but the measure failed. A newly named group, the ": null
    },
    {
        "Peoples Democratic Reform Committee": "Peoples Democratic Reform Committee"
    },
    {
        " along with allied groups, escalated the pressure, with the opposition Democrat party resigning en masse to create a parliamentary vacuum. Protesters demand variously evolved as the movements numbers grew, extending a number of deadlines and demands that became increasingly unreasonable or unrealistic, yet attracting a groundswell of support. They called for the establishment of an indirectly elected people’s council , in place of Yinglucks government, that would cleanse Thai politics and eradicate the Thaksin regime.      In response to the protests, Yingluck dissolved parliament on 9 December 2013 and proposed a new election for 2 February 2014, a date that was later approved by the election commission.  The PDRC insisted that the prime minister stand down within 24 hours, regardless of her actions, with 160,000 protesters in attendance at Government House on 9 December. Yingluck insisted that she would continue her duties until ": null
    },
    {
        "the scheduled election in February 2014": "2014 Thai General Election"
    },
    {
        ", urging the protesters to accept her proposal: Now that the government has dissolved parliament, I ask that you stop protesting and that all sides work towards elections. I have backed down to the point where I dont know how to back down any further.      In response to the Electoral Commission s registration process for party-list candidates—for the scheduled election in February 2014—anti-government protesters marched to the Thai-Japanese sports stadium, the venue of the registration process, on 22 December 2013. Suthep and the PDRC led the protest, which security forces claimed that approximately 270,000 protesters joined. Yingluck and the Pheu Thai Party reiterated their election plan and anticipated presenting a list of 125 party-list candidates to the EC.      On 7 May 2014, the Constitutional Court ruled that Yingluck would have to step down as the prime minister as she was deemed to have abused her power in transferring a high-level government official.  On 21 August 2014 she was replaced by army chief General ": null
    },
    {
        "Prayut Chan-o-cha": "Prayut Chan-O-Cha"
    },
    {
        ".              On 20 May 2014 the Thai army declared martial law and began to deploy troops in the capital, denying that it was a coup attempt.  On 22 May, the army admitted that it was a coup and that it was taking control of the country and suspending the countrys constitution.   On the same day, the military imposed a curfew between the hours of 22:00–05:00, ordering citizens and visitors to remain indoors during this period.      On 21 August 2014 the ": null
    },
    {
        "National Assembly of Thailand": "National Assembly Of Thailand"
    },
    {
        " elected the army chief, General ": null
    },
    {
        "Prayut Chan-o-cha": "Prayut Chan-O-Cha"
    },
    {
        ", as prime minister. Martial law was declared formally ended on 1 April 2015.  Uniformed or ex-military men have led Thailand for 55 of the 83 years since absolute monarchy was overthrown in 1932,... observed one journalist in 2015.           The ruling junta led by Prayuth Chan-o-cha promised to hold new elections, but wants to enact a new constitution before the elections are held. An initial draft constitution was rejected by government officials in 2015. A national referendum, the first since the 2014 coup, on a newly drafted constitution was held on 7 August 2016.  There was a 55% turnout of which around 61% voted in favour of the constitution.  Under the new constitution an unelected person other than a member of parliament can be appointed as Prime Minister, which would open the post to a military official.  The new constitution also gives the National Council for Peace and Order the authority to make all the appointments to the 250-member Senate in the next government.           On 13 October 2016, King Bhumibol Adulyadej of Thailand died at the age of 89, in ": null
    },
    {
        "Siriraj Hospital": "Siriraj Hospital"
    },
    {
        " in Bangkok. On the night of 1 December 2016, the fiftieth day after the death of Bhumibol, Regent ": null
    },
    {
        "Prem Tinsulanonda": "Prem Tinsulanonda"
    },
    {
        " led the heads of the countrys three branches of government to an audience with Vajiralongkorn to invite him to ascend to the throne as the tenth king of the ": null
    },
    {
        "Chakri dynasty": "Chakri Dynasty"
    },
    {
        ".  In April 2017, King Vajiralongkorn signs the new constitution which will aid in the return to democracy.     In May 2017, Bangkok hospital was bombed, wounding 24 people on the third anniversary of the military coup of 2014. ": null
    }
]