[
    {
        "           Histology,   also known as microscopic anatomy or microanatomy, is the branch of ": null
    },
    {
        "biology": "biology"
    },
    {
        " which studies the microscopic ": null
    },
    {
        "anatomy": "anatomy"
    },
    {
        " of biological ": null
    },
    {
        " tissues": "tissue"
    },
    {
        ". Histology is the microscopic counterpart to ": null
    },
    {
        "gross anatomy": "gross anatomy"
    },
    {
        ", which looks at larger structures visible without a microscope. Although one may divide microscopic anatomy into organology, the study of organs, histology, the study of tissues, and  cytology , the study of ": null
    },
    {
        "cells": "cell"
    },
    {
        ", modern usage places these topics under the field of histology. In ": null
    },
    {
        "medicine": "medicine"
    },
    {
        ", ": null
    },
    {
        "histopathology": "histopathology"
    },
    {
        " is the branch of histology that includes the microscopic identification and study of diseased tissue. In the field of ": null
    },
    {
        "paleontology": "paleontology"
    },
    {
        ", the term paleohistology refers to the histology of ": null
    },
    {
        "fossil": "fossil"
    },
    {
        " organisms.                   There are four basic types of animal tissues: ": null
    },
    {
        "muscle tissue": "muscle tissue"
    },
    {
        ", ": null
    },
    {
        "nervous tissue": "nervous tissue"
    },
    {
        ", ": null
    },
    {
        "connective tissue": "connective tissue"
    },
    {
        ", and ": null
    },
    {
        "epithelial tissue": "epithelial tissue"
    },
    {
        ". All animal tissues are considered to be subtypes of these four principal tissue types .                For plants, the study of their tissues falls under the field of ": null
    },
    {
        "plant anatomy": "plant anatomy"
    },
    {
        ", with the following four main types:   ": null
    },
    {
        "Dermal tissue": "epidermis"
    },
    {
        " Vascular tissue": "vascular tissue"
    },
    {
        " Ground tissue": "ground tissue"
    },
    {
        " Meristematic tissue": "meristematic tissue"
    },
    {
        "         Histopathology": "histopathology"
    },
    {
        " is the branch of histology that includes the microscopic identification and study of diseased tissue. It is an important part of ": null
    },
    {
        "anatomical pathology": "anatomical pathology"
    },
    {
        " and ": null
    },
    {
        "surgical pathology": "surgical pathology"
    },
    {
        ", as accurate diagnosis of ": null
    },
    {
        "cancer": "cancer"
    },
    {
        " and other diseases often requires histopathological examination of tissue samples. Trained physicians, frequently licensed ": null
    },
    {
        "pathologist": "pathologist"
    },
    {
        "s, perform histopathological examination and provide diagnostic information based on their observations.       The field of histology that includes the preparation of tissues for microscopic examination is known as histotechnology. Job titles for the trained personnel who prepare histological specimens for examination are numerous and include histotechnicians, histotechnologists, histology technicians and technologists, ": null
    },
    {
        "medical laboratory technicians": "medical laboratory assistant"
    },
    {
        ", and ": null
    },
    {
        "biomedical scientist": "biomedical scientist"
    },
    {
        "s.         Most histological samples need preparation before microscopic observation; these methods depend on the specimen and method of observation.               Chemical ": null
    },
    {
        "fixatives": "fixation"
    },
    {
        " are used to preserve and maintain the structure of tissues and cells; fixation also hardens tissues which aids in cutting the thin sections of tissue needed for observation under the microscope. Fixatives generally preserve tissues by irreversibly cross-linking proteins. The most widely used fixative for light microscopy is 10% neutral buffered ": null
    },
    {
        "formalin": "formalin"
    },
    {
        ", or NBF .     For electron microscopy, the most commonly used fixative is ": null
    },
    {
        "glutaraldehyde": "glutaraldehyde"
    },
    {
        ", usually as a 2.5% solution in ": null
    },
    {
        "phosphate buffered saline": "phosphate buffered saline"
    },
    {
        ". Other fixatives used for electron microscopy are ": null
    },
    {
        "osmium tetroxide": "osmium tetroxide"
    },
    {
        " or ": null
    },
    {
        "uranyl acetate": "uranyl acetate"
    },
    {
        ".     The main action of these ": null
    },
    {
        "aldehyde": "aldehyde"
    },
    {
        " fixatives is to cross-link amino groups in proteins through the formation of ": null
    },
    {
        "methylene bridges": "methylene bridge"
    },
    {
        ", in the case of formaldehyde, or by C 5 H 10 cross-links in the case of glutaraldehyde. This process, while preserving the structural integrity of the cells and tissue can damage the biological functionality of proteins, particularly ": null
    },
    {
        "enzymes": "enzymes"
    },
    {
        ".     Formalin fixation leads to degradation of mRNA, miRNA, and DNA as well as denaturation and modification of proteins in tissues. However, extraction and analysis of nucleic acids and proteins from formalin-fixed, paraffin-embedded tissues is possible using appropriate protocols.       Selection is the choice of relevant tissue in cases where it is not necessary to put the entire original tissue mass through further processing. The remainder may remain fixated in case it needs to be examined at a later time.     Trimming is the cutting of tissue samples in order to expose the relevant surfaces for later sectioning. It also creates tissue samples of appropriate size to fit into cassettes.        Tissues are embedded in a harder medium both as a support and to allow the cutting of thin tissue slices. In general, water must first be removed from tissues and replaced with a medium that either solidifies directly, or with an intermediary fluid that is miscible with the embedding media.            For light microscopy, ": null
    },
    {
        "paraffin wax": "paraffin wax"
    },
    {
        " is the most frequently used embedding material. Paraffin is immiscible with water, the main constituent of biological tissue, so it must first be removed in a series of dehydration steps. Samples are transferred through a series of progressively more concentrated ": null
    },
    {
        "ethanol": "ethanol"
    },
    {
        " baths, up to 100% ethanol to remove remaining traces of water. Dehydration is followed by a clearing agent  which removes the alcohol and is ": null
    },
    {
        "miscible": "miscible"
    },
    {
        " with the wax, finally melted paraffin wax is added to replace the xylene and infiltrate the tissue. In most histology, or histopathology laboratories the dehydration, clearing, and wax infiltration are carried out in tissue processors which automate this process. Once infiltrated in paraffin, tissues are oriented in molds which are filled with wax; once positioned, the wax is cooled, solidifying the block and tissue.         Paraffin wax does not always provide a sufficiently hard matrix for cutting very thin sections . Paraffin wax may also be too soft in relation to the tissue, the heat of the melted wax may alter the tissue in undesirable ways, or the dehydrating or clearing chemicals may harm the tissue. Alternatives to paraffin wax include, ": null
    },
    {
        "epoxy": "epoxy"
    },
    {
        ", ": null
    },
    {
        "acrylic": "poly"
    },
    {
        ", ": null
    },
    {
        "agar": "agar"
    },
    {
        ", ": null
    },
    {
        "gelatin": "gelatin"
    },
    {
        ", ": null
    },
    {
        "celloidin": "micro_techniquecelloidin_method"
    },
    {
        ", and other types of waxes.     In electron microscopy epoxy resins are the most commonly employed embedding media, but acrylic resins are also used, particularly where ": null
    },
    {
        "immunohistochemistry": "immunohistochemistry"
    },
    {
        " is required.     For tissues to be cut in a frozen state, tissues are placed in a water-based embedding medium. Pre-frozen tissues are placed into molds with the liquid embedding material, usually a water-based glycol, ": null
    },
    {
        "OCT": "optimal cutting temperature compound"
    },
    {
        ", ": null
    },
    {
        "TBS": "tris-buffered saline"
    },
    {
        ", Cryogel, or resin, which is then frozen to form hardened blocks.               For light microscopy, a knife mounted in a microtome is used to cut tissue sections  which are mounted on a glass ": null
    },
    {
        "microscope slide": "microscope slide"
    },
    {
        ". For transmission electron microscopy , a diamond or glass knife mounted in an ": null
    },
    {
        "ultramicrotome": "ultramicrotome"
    },
    {
        " is used to cut between 50-150 ": null
    },
    {
        "nanometer": "nanometre"
    },
    {
        " thick tissue sections.            Biological tissue has little inherent contrast in either the light or electron microscope. ": null
    },
    {
        "Staining": "staining"
    },
    {
        " is employed to give both contrast to the tissue as well as highlighting particular features of interest. When the stain is used to target a specific chemical component of the tissue , the term ": null
    },
    {
        "histochemistry": "histochemistry"
    },
    {
        " is used.          ": null
    },
    {
        "Hematoxylin": "hematoxylin"
    },
    {
        " and ": null
    },
    {
        "eosin": "eosin"
    },
    {
        "  is one of the most commonly used stains in histology to show the general structure of the tissue. Hematoxylin stains cell ": null
    },
    {
        "nuclei": "cell nucleus"
    },
    {
        " blue; eosin, an ": null
    },
    {
        "acidic": "acid"
    },
    {
        " dye, stains the ": null
    },
    {
        "cytoplasm": "cytoplasm"
    },
    {
        " and other tissues in different stains of pink.     In contrast to H & E, which is used as a general stain, there are many techniques that more selectively stain cells, cellular components, and specific substances. A commonly performed histochemical technique that targets a specific chemical is the ": null
    },
    {
        "Perls Prussian blue": "perls prussian blue"
    },
    {
        " reaction, used to demonstrate iron deposits in diseases like ": null
    },
    {
        "hemochromatosis": "hemochromatosis"
    },
    {
        ". The ": null
    },
    {
        "Nissl method": "nissl method"
    },
    {
        " for Nissl substance and ": null
    },
    {
        "Golgis method": "golgis method"
    },
    {
        "  are useful in identifying ": null
    },
    {
        "neurons": "neuron"
    },
    {
        "are other examples of more specific stains.         In ": null
    },
    {
        "historadiography": "historadiography"
    },
    {
        ", a slide is X-rayed. More commonly, ": null
    },
    {
        "autoradiography": "autoradiography"
    },
    {
        " is used to visualize the locations to which a radioactive substance has been transported within the body, such as cells in ": null
    },
    {
        "S phase": "s phase"
    },
    {
        "  which incorporate tritiated ": null
    },
    {
        "thymidine": "thymidine"
    },
    {
        ", or sites to which radiolabeled ": null
    },
    {
        "nucleic acid": "nucleic acid"
    },
    {
        " probes bind in ": null
    },
    {
        "in situ hybridization": "in situ hybridization"
    },
    {
        ". For autoradiography on a microscopic level, the slide is typically dipped into liquid nuclear tract emulsion, which dries to form the exposure film. Individual silver grains in the film are visualized with ": null
    },
    {
        "dark field microscopy": "dark field microscopy"
    },
    {
        ".            Recently, ": null
    },
    {
        "antibodies": "antibodies"
    },
    {
        " have been used to specifically visualize proteins, carbohydrates, and lipids. This process is called ": null
    },
    {
        "immunohistochemistry": "immunohistochemistry"
    },
    {
        ", or when the stain is a ": null
    },
    {
        "fluorescent": "fluorescent"
    },
    {
        " molecule, ": null
    },
    {
        "immunofluorescence": "immunofluorescence"
    },
    {
        ". This technique has greatly increased the ability to identify categories of cells under a microscope. Other advanced techniques, such as nonradioactive in situ hybridization, can be combined with immunochemistry to identify specific DNA or RNA molecules with fluorescent probes or tags that can be used for immunofluorescence and enzyme-linked fluorescence amplification . ": null
    },
    {
        "Fluorescence microscopy": "fluorescence microscopy"
    },
    {
        " and ": null
    },
    {
        "confocal microscopy": "confocal microscopy"
    },
    {
        " are used to detect fluorescent signals with good intracellular detail.            For electron microscopy ": null
    },
    {
        "heavy metals": "heavy metals"
    },
    {
        " are typically used to stain tissue sections. ": null
    },
    {
        "Uranyl acetate": "uranyl acetate"
    },
    {
        " and lead citrate are commonly used to impart contrast to tissue in the electron microscope.                Similar to the ": null
    },
    {
        "frozen section procedure": "frozen section procedure"
    },
    {
        " employed in medicine, cryosectioning is a method to rapidly freeze, cut, and mount sections of tissue for histology. The tissue is usually sectioned on a ": null
    },
    {
        "cryostat": "cryostat"
    },
    {
        " or freezing microtome. The frozen sections are mounted on a glass slide and may be stained to enhance the contrast between different tissues. Unfixed frozen sections can be used for studies requiring enzyme localization in tissues and cells. Tissue fixation is required for certain procedures such as antibody-linked ": null
    },
    {
        "immunofluorescence": "immunofluorescence"
    },
    {
        " staining. Frozen sections are often prepared during surgical removal of ": null
    },
    {
        "tumors": "tumor"
    },
    {
        "to allow rapid identification of tumor margins, as in ": null
    },
    {
        "Mohs surgery": "mohs surgery"
    },
    {
        ", or determination of tumor malignancy, when a tumor is discovered incidentally during surgery.               Ultramicrotomy is a method of preparing extremely thin sections for ": null
    },
    {
        "transmission electron microscope": "transmission electron microscope"
    },
    {
        " analysis. Tissues are commonly embedded in ": null
    },
    {
        "epoxy": "epoxy"
    },
    {
        " or other plastic resin. Very thin sections are cut using diamond or glass knives on an ": null
    },
    {
        "ultramicrotome": "ultramicrotome"
    },
    {
        ".       Artifacts are structures or features in tissue that interfere with normal histological examination. Artifacts interfere with histology by changing the tissues appearance and hiding structures. Tissue processing artifacts can include pigments formed by fixatives, shrinkage, washing out of cellular components, color changes in different tissues types and alterations of the structures in the tissue. An example is mercury pigment left behind after using ": null
    },
    {
        "Zenkers fixative": "zenkers fixative"
    },
    {
        " to fix a section. Formalin fixation can also leave a brown to black pigment under acidic conditions.          In the 17th century, the ": null
    },
    {
        "Italian": "italians"
    },
    {
        " Marcello Malpighi": "marcello malpighi"
    },
    {
        " used microscopes to study tiny biological entities and has been considered by some to be the founder of the fields of histology and microscopic pathology. Malpighi analyzed several parts of the organs of bats, frogs and other animals under the microscope. Malpighi, while studying the structure of the lung, noticed its membranous alveoli and the hair-like connections between veins and arteries, which he named capillaries. His discovery established how the oxygen breathed in, enters the blood stream and serves the body.     In the 19th century, histology was an academic discipline in its own right. The French anatomist ": null
    },
    {
        "Marie François Xavier Bichat": "marie françois xavier bichat"
    },
    {
        " introduced the concept of ": null
    },
    {
        "tissue": "tissue"
    },
    {
        " in anatomy in 1801, and the term histology first appeared in a book of ": null
    },
    {
        "Karl Meyer": "august franz josef karl mayer"
    },
    {
        " in 1819.     Bichat described twenty-one human tissues, which can be subsumed under the four categories currently accepted by histologists. The usage of illustrations in histology, deemed as useless by Bichat, was promoted by ": null
    },
    {
        "Jean Cruveilhier": "jean cruveilhier"
    },
    {
        ".       In the early 1830, ": null
    },
    {
        "Purkynĕ": "jan evangelista purkyně"
    },
    {
        " invented a microtome with high precision.     During the 19th century, many ": null
    },
    {
        "fixation": "fixation"
    },
    {
        " techniques were developed by ": null
    },
    {
        "Adolph Hannover": "adolph hannover"
    },
    {
        " , ": null
    },
    {
        "Franz Schulze": "franz eilhard schulze"
    },
    {
        " and ": null
    },
    {
        "Max Schultze": "max schultze"
    },
    {
        " , ": null
    },
    {
        "Alexander Butlerov": "alexander butlerov"
    },
    {
        "  and ": null
    },
    {
        "Benedikt Stilling": "benedikt stilling"
    },
    {
        " .     ": null
    },
    {
        "Mounting": "microscope slidemounting"
    },
    {
        " techniques were developed by ": null
    },
    {
        "Rudolf Heidenhain": "rudolf heidenhain"
    },
    {
        " , ": null
    },
    {
        "Salomon Stricker": "salomon stricker"
    },
    {
        " , ": null
    },
    {
        "Andrew Pritchard": "andrew pritchard"
    },
    {
        "  and ": null
    },
    {
        "Edwin Klebs": "edwin klebs"
    },
    {
        " .      The 1906 ": null
    },
    {
        "Nobel Prize": "nobel prize"
    },
    {
        " in Physiology or Medicine was awarded to histologists ": null
    },
    {
        "Camillo Golgi": "camillo golgi"
    },
    {
        " and ": null
    },
    {
        "Santiago Ramon y Cajal": "santiago ramon y cajal"
    },
    {
        ". They had conflicting interpretations of the neural structure of the brain based on differing interpretations of the same images. Cajal won the prize for his correct theory, and Golgi for the ": null
    },
    {
        "silver staining": "silver staining"
    },
    {
        " technique": "golgis method"
    },
    {
        " he invented to make it possible.       ": null
    }
]