[
    {
        "         The ten years 4242 saw a radical transformation of the ": null
    },
    {
        "Russian Empire": "russian empire"
    },
    {
        " into a communist state, the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". ": null
    },
    {
        "Soviet Russia covers 4242": "russian soviet federative socialist republicearly years"
    },
    {
        " and ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " covers the years 42 to 42 After the ": null
    },
    {
        "Russian Civil War": "russian civil war"
    },
    {
        " , the ": null
    },
    {
        "Bolsheviks": "bolsheviks"
    },
    {
        " took dictatorial control. They were dedicated to a version of ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        " developed by ": null
    },
    {
        "Vladimir Lenin": "vladimir lenin"
    },
    {
        ". It promised the workers would rise, destroy ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        ", and create a socialist utopia under the leadership of the ": null
    },
    {
        "Communist Party of the Soviet Union": "communist party of the soviet union"
    },
    {
        ". The awkward problem was the small ": null
    },
    {
        "proletariat": "proletariat"
    },
    {
        ", in an overwhelmingly ": null
    },
    {
        "peasant": "peasant"
    },
    {
        " society with limited industry and a very small ": null
    },
    {
        "middle class": "middle class"
    },
    {
        ". Following the ": null
    },
    {
        "February Revolution": "february revolution"
    },
    {
        " in 42 that deposed ": null
    },
    {
        "Nicholas II of Russia": "nicholas ii of russia"
    },
    {
        ", a short-lived ": null
    },
    {
        "provisional government": "russian provisional government"
    },
    {
        " gave way to Bolsheviks in the ": null
    },
    {
        "October Revolution": "october revolution"
    },
    {
        ". The Bolshevik Party was renamed the ": null
    },
    {
        "Russian Communist Party": "communist party of the soviet union"
    },
    {
        " .     All politics and attitudes that were not strictly RCP were suppressed, under the premise that the RCP represented the ": null
    },
    {
        "proletariat": "proletariat"
    },
    {
        " and all activities contrary to the partys beliefs were counterrevolutionary or anti-socialist. Most rich families fled to exile. During 42 to 42 the Bolsheviks/Communists under Lenin surrendered to Germany in 42 then fought an intense ": null
    },
    {
        "Russian Civil War": "russian civil war"
    },
    {
        " against multiple enemies especially the ": null
    },
    {
        "White Army": "white movementarmed forces"
    },
    {
        ". They won the Russian heartland but lost most non-Russian areas that had been part of Imperial Russia. One by one defeating each opponent, the RCP established itself through the Russian heartland and some non-Russian areas such as Ukraine and the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        ", It became the ": null
    },
    {
        "Communist Party of the Soviet Union": "communist party of the soviet union"
    },
    {
        " following the ": null
    },
    {
        "creation": "treaty on the creation of the ussr"
    },
    {
        " of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " in 42 Following ": null
    },
    {
        "Lenins death": "lenins death"
    },
    {
        " in 42 ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        ", ": null
    },
    {
        "General Secretary of the CPSU": "general secretary of the cpsu"
    },
    {
        ", became the ": null
    },
    {
        "leader of the USSR": "list of leaders of the ussr"
    },
    {
        ", achieving full dictatorship power from the early 42s to his death in 42          During World War I, Tsarist Russia experienced military humiliation, famine and economic collapse. The demoralized ": null
    },
    {
        "Russian Army": "imperial russian army"
    },
    {
        " suffered severe military setbacks, and many captured soldiers deserted the front lines. Dissatisfaction with the monarchy and its policy of continuing the war grew among the Russian people. Tsar Nicholas II abdicated the throne following the February Revolution of 42 , causing widespread rioting in ": null
    },
    {
        "Petrograd": "saint petersburg"
    },
    {
        " and other major Russian cities.     The ": null
    },
    {
        "Russian Provisional Government": "russian provisional government"
    },
    {
        " was installed immediately following the fall of the Tsar by the ": null
    },
    {
        "Provisional Committee of the State Duma": "provisional committee of the state duma"
    },
    {
        " in early March 42 and received conditional support of the ": null
    },
    {
        "Mensheviks": "mensheviks"
    },
    {
        ". Led first by Prince ": null
    },
    {
        "Georgy Lvov": "georgy lvov"
    },
    {
        ", then ": null
    },
    {
        "Alexander Kerensky": "alexander kerensky"
    },
    {
        " the Provisional Government consisted mainly of the parliamentarians most recently elected to the ": null
    },
    {
        "State Duma of the Russian Empire": "state duma"
    },
    {
        ", which had been overthrown alongside Tsar Nicholas II. The new Provisional Government maintained its commitment to the war, remaining in the ": null
    },
    {
        "Triple Entente": "triple entente"
    },
    {
        " with Britain and France. The Provisional Government postponed the land reforms demanded by the Bolsheviks.     Lenin, embodying the Bolshevik ideology, viewed alliance with the capitalist countries of Western Europe and the United States as involuntary servitude of the proletariat, who was forced to fight the ": null
    },
    {
        "imperialists": "imperialism"
    },
    {
        " war. As seen by Lenin, Russia was reverting to the rule of the Tsar, and it was the job of Marxist revolutionaries, who truly represented socialism and the proletariat, to oppose such counter-socialistic ideas and support ": null
    },
    {
        "socialist revolutions in other countries": "proletarian internationalism"
    },
    {
        ".     Within the military, mutiny and desertion were pervasive among conscripts. The ": null
    },
    {
        "intelligentsia": "intelligentsia"
    },
    {
        " was dissatisfied over the slow pace of social reforms; poverty was worsening, income disparities and inequality were becoming out of control while the Provisional Government grew increasingly autocratic and inefficient. The government appeared to be on the verge of succumbing to a ": null
    },
    {
        "military junta": "military dictatorship"
    },
    {
        ". Deserting soldiers returned to the cities and gave their weapons to angry, and extremely hostile, socialist factory workers. The deplorable and inhumane poverty and starvation of major Russian centers produced optimum conditions for revolutionaries.     During the months between February and October 42 the power of the Provisional Government was consistently questioned by nearly all political parties. A system of dual power emerged, in which the Provisional Government held nominal power, though increasingly opposed by the ": null
    },
    {
        "Petrograd Soviet": "petrograd soviet"
    },
    {
        ", their chief adversary, controlled by the Mensheviks and Socialist Revolutionaries . The Soviet chose not to force further changes in government due to the belief that the February Revolution was Russias crowing overthrow of the ": null
    },
    {
        "bourgeois": "bourgeoisie"
    },
    {
        ". The Soviet also believed that the new Provisional Government would be tasked with implementing democratic reforms and pave the way for a ": null
    },
    {
        "proletarian revolution": "proletarian revolution"
    },
    {
        ". Though the creation of a government not based on the ": null
    },
    {
        "dictatorship of the proletariat": "dictatorship of the proletariat"
    },
    {
        " in any form, was viewed as a retrograde step in Vladmir Lenins ": null
    },
    {
        "April Theses": "april theses"
    },
    {
        ". However, the Provisional Government still remained an overwhelmingly powerful governing body.     Failed military offensives in summer 42 and large scale protesting and riots in major Russian cities  led to the deployment of troops in late August to restore order. The July Days were suppressed and blamed on the Bolsheviks, forcing Lenin into hiding. Still, rather than use force, many of the deployed soldiers and military personnel joined the rioters, disgracing the government and military at-large. It was during this time that support for the Bolsheviks grew and another of its leading figures, ": null
    },
    {
        "Leon Trotsky": "leon trotsky"
    },
    {
        ", was elected chair of the Petrograd Soviet, which had complete control over the defenses of the city, mainly, the citys military force.   On 42 October, in early days of the October Revolution, the Provisional Government moved against the Bolsheviks, arresting activists and destroying pro-Communist propaganda. The Bolsheviks were able to portray this as an attack against the Peoples Soviet and garnered support for the ": null
    },
    {
        "Red Guard of Petrograd": "red guards"
    },
    {
        " to take over the Provisional Government. The administrative offices and government buildings were taken with little opposition or bloodshed. The generally accepted end of this transitional revolutionary period, which will lead to the creation of the ": null
    },
    {
        "Union of Soviet Socialist Republics": "soviet union"
    },
    {
        " lies with the assault and capture of the poorly defended ": null
    },
    {
        "Winter Palace": "winter palace"
    },
    {
        " on the evening of 42 October 42     The Mensheviks and the right-wing of the Socialist Revolutionaries, outraged by the abusive and coercive acts carried out by the Red Guard and Bolsheviks, fled Petrograd, leaving control in the hands of the Bolsheviks and remaining Left Socialist Revolutionaries. On 42 October 42 the ": null
    },
    {
        "Sovnarkom": "council of peoples commissars"
    },
    {
        " was established by the ": null
    },
    {
        "Russian Constitution of 42": "russian constitution of 1918"
    },
    {
        " as the administrative arm of the ": null
    },
    {
        "All-Russian Congress of Soviets": "all-russian congress of soviets"
    },
    {
        ". By 42 January 42 the ": null
    },
    {
        "VTsIK": "all-russian central executive committee"
    },
    {
        ", supported by the Bolsheviks, ratified the dissolution of the ": null
    },
    {
        "Russian Constituent Assembly": "russian constituent assembly"
    },
    {
        ", which intended to establish the non-Bolshevik ": null
    },
    {
        "Russian Democratic Federative Republic": "russian democratic federative republic"
    },
    {
        " as the permanent form of government established at its Petrograd session held 42 and 42 January 42 At the third meeting of the All-Russian Congress of Soviets on 42 January 42 the unrecognised state was renamed the ": null
    },
    {
        "Russian Soviet Republic": "russian soviet republic"
    },
    {
        ".        :          Prior to the revolution, the Bolshevik doctrine of democratic centralism argued that only a tightly knit and secretive organization could successfully overthrow the government; after the revolution, they argued that only such an organization could prevail against foreign and domestic enemies. Fighting the civil war would actually force the party to put these principles into practice.     Arguing that the revolution needed not a mere parliamentary organization but a party of action which would function as a scientific body of direction, a vanguard of activists, and a central control organ, the ": null
    },
    {
        "Tenth Party Congress": "10th congress of the russian communist party"
    },
    {
        " banned factions within the party, initially intending it only to be a temporary measure after the shock of the ": null
    },
    {
        "Kronstadt rebellion": "kronstadt rebellion"
    },
    {
        ". It was also argued that the party should be an elite body of professional revolutionaries dedicating their lives to the cause and carrying out their decisions with iron discipline, thus moving toward putting loyal party activists in charge of new and old political institutions, army units, factories, hospitals, universities, and food suppliers. Against this backdrop, the  nomenklatura  system would evolve and become standard practice.     In theory, this system was to be democratic since all leading party organs would be elected from below, but also centralized since lower bodies would be accountable to higher organizations. In practice, democratic centralism was centralist, with decisions of higher organs binding on lower ones, and the composition of lower bodies largely determined by the members of higher ones. Over time, party cadres would grow increasingly careerist and professional. Party membership required exams, special courses, special camps, schools, and nominations by three existing members.     In December 42 the ": null
    },
    {
        "Cheka": "cheka"
    },
    {
        " was founded as the Bolsheviks first internal security force following the failed assassination attempt on Lenins life. Later it changed names to ": null
    },
    {
        "GPU": "state political directorate"
    },
    {
        ", ": null
    },
    {
        "OGPU": "joint state political directorate"
    },
    {
        ", ": null
    },
    {
        "MVD": "ministry of internal affairs"
    },
    {
        ", ": null
    },
    {
        "NKVD": "nkvd"
    },
    {
        " and finally ": null
    },
    {
        "KGB": "kgb"
    },
    {
        ".            The frontiers between Poland, which had established an unstable independent government following World War I, and the former Tsarist empire, were rendered chaotic by the repercussions of the Russian revolutions, the civil war and the winding down World War I. Polands ": null
    },
    {
        "Józef Piłsudski": "józef piłsudski"
    },
    {
        " envisioned a new federation , forming a Polish-led East European bloc to form a bulwark against Russia and Germany, while the ": null
    },
    {
        "Russian SFSR": "russian soviet federative socialist republic"
    },
    {
        " considered carrying the revolution westward by force. When Piłsudski carried out a ": null
    },
    {
        "military thrust into Ukraine in 42": "kiev offensive"
    },
    {
        ", he was met by a Red Army offensive that drove into Polish territory almost to Warsaw. However, Piłsudski halted the Soviet advance at the ": null
    },
    {
        "Battle of Warsaw": "battle of warsaw"
    },
    {
        " and resumed the offensive. The ": null
    },
    {
        "Peace of Riga": "peace of riga"
    },
    {
        " signed in early 42 split the territory of ": null
    },
    {
        "Belarus": "belarus"
    },
    {
        " and ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " between Poland and Soviet Russia.       On 42 December 42 a conference of plenipotentiary delegations from the ": null
    },
    {
        "Russian SFSR": "russian soviet federative socialist republic"
    },
    {
        ", the ": null
    },
    {
        "Transcaucasian SFSR": "transcaucasian socialist federative soviet republic"
    },
    {
        ", the ": null
    },
    {
        "Ukrainian SSR": "ukrainian soviet socialist republic"
    },
    {
        " and the ": null
    },
    {
        "Byelorussian SSR": "byelorussian soviet socialist republic"
    },
    {
        " approved the ": null
    },
    {
        "Treaty on the Creation of the USSR": "treaty on the creation of the ussr"
    },
    {
        " and the ": null
    },
    {
        "Declaration of the Creation of the USSR": "declaration of the creation of the ussr"
    },
    {
        ", forming the Union of Soviet Socialist Republics. These two documents were confirmed by the 42st ": null
    },
    {
        "Congress of Soviets": "congress of soviets"
    },
    {
        " of the USSR and signed by heads of delegations   ": null
    },
    {
        "Mikhail Kalinin": "mikhail kalinin"
    },
    {
        ", ": null
    },
    {
        "Mikhail Tskhakaya": "mikhail tskhakaya"
    },
    {
        ", ": null
    },
    {
        "Mikhail Frunze": "mikhail frunze"
    },
    {
        " and ": null
    },
    {
        "Grigory Petrovsky": "grigory petrovsky"
    },
    {
        ", ": null
    },
    {
        "Alexander Chervyakov": "alexander chervyakov"
    },
    {
        "   at Khronos.ru on 42 December 42            Many of the leading Bolsheviks who came to power in 42 had been pamphleteers or editors, including Lenin, Trotsky, Stalin, Bukharin, and Zinoviev. Lenin set up the daily newspaper Pravda in January 42 Before it was suppressed by the government in 42 It was a singularly effective propaganda and educational instrument which enabled the Bolsheviks to gain control of the Petersburg labor movement and to build up a mass base for their organization. Whitman Bassow, The Pre-Revolutionary Pravda and Tsarist Censorship, American Slavic and East European Review 42 pp. 4242  Under Lenin, the Bolsheviks controlled all of the media After 42 The major national newspapers were ": null
    },
    {
        "Izvestia": "izvestia"
    },
    {
        " , John C. Merrill, and Harold A. Fisher, The worlds great dailies: profiles of fifty newspapers pp 4242 and especially ": null
    },
    {
        "Pravda": "pravda"
    },
    {
        " . Merrill, and Fisher, The worlds great dailies: profiles of fifty newspapers pp 42–42 Pravda acquired the first and best printing equipment for illustrations. Katerina Romanenko, Photomontage for the Masses: The Soviet Periodical Press of the 42s. Design Issues 42 : 4242 The leading newspapers developed a specialized rhetorical vocabulary designed to enhance the totalitarian structure of society, with total truth emanating from the top, and all sorts of mischievous errors stemming from clumsy bureaucrats at lower levels, or from devious traitors and spies working on behalf of capitalism. Ludmila Pöppel, The rhetoric of Pravda editorials: A diachronic study of a political genre. .        The Communist leadership was rooted in printed propaganda. Taking over a nation where 42% could not read, they made schools and literacy a high priority in order to optimize printed journalism and propaganda through newspapers and magazines, as well as posters that reached the illiterate older generations. Boris N. Mironov, The Development of Literacy in Russia and the USSR from the Tenth to the Twentieth Centuries. History of Education Quarterly 42 : 4242 . Ben Eklof, Russian literacy campaigns, 42–42 in Harvey J. Graff and Robert F. Arnove, eds., National Literacy Campaigns and Movements: Historical and Comparative Perspectives  pp. 4242     Radio was not neglected--it was a major new technology, and was used for political speeches. Soviet authorities realized that the ham operator was highly individualistic and encouraged private initiative– too much so for the totalitarian regime. Criminal penalties were imposed but the working solution was to avoid broadcasting over the air. Instead radio programs were transmitted by copper wire, using a hub and spoke system, to loudspeakers in approved listening stations, such as the Red corner of a factory. Stephen Lovell, How Russia learned to listen: radio and the making of Soviet culture. p 4242     The Soviet style involved citizens listening to party leaders, using in-person speeches, radio talks or printed speeches. There was little role for the journalist to summarize or interpret the text; there was no commentary or background or discussion. No one questioned or challenged the leadership. There were no press conferences and little in the way of broadcast news. Stephen Lovell, Broadcasting Bolshevik: The radio voice of Soviet culture, 42s–42s. Journal of Contemporary History 42 : 4242 Jeffrey Brooks, Public and private values in the Soviet press, 4242 Slavic Review 42 : 4242     Foreign correspondents were strictly prevented from any access beyond official spokesmen. The result was a rosy depiction of Soviet life in the Western media before Khrushchev exposed Stalins horrors in the 42s. Whitman Bassow, Moscow Correspondents: From John Reed to Nicholas Daniloff . The most famous exemplar was ": null
    },
    {
        "Walter Duranty": "walter duranty"
    },
    {
        " of the New York Times. Sally J. Taylor, Stalins Apologist: Walter Duranty: The New York Timess Man in Moscow . R. B. Cockett, In Wartime Every Objective Reporter Should Be Shot.The Experience of British Press Correspondents in Moscow, 4242 Journal of Contemporary History 42 : 4242  Ralph Elphick, Moscows blue pencils and the green baize door, Historical Journal of Film, Radio & Television 42 pp 4242 Elphick was a Reuters correspondent in Moscow 4242       During the Civil War , the Bolsheviks adopted ": null
    },
    {
        "War communism": "war communism"
    },
    {
        ", which entailed the breakup of the ": null
    },
    {
        "landed estate": "landed property"
    },
    {
        "s and the forcible seizure of agricultural surpluses. In the cities there were intense food shortages and a breakdown in the money system . Many city dwellers fled to the countryside – often to tend the land that the Bolshevik breakup of the landed estates had transferred to the peasants. Even small scale capitalist production was suppressed. Alan M. Ball,Russias Last Capitalists: The Nepmen, 4242  pp 4242     The ": null
    },
    {
        "Kronstadt rebellion": "kronstadt rebellion"
    },
    {
        " signaled the growing unpopularity of War Communism in the countryside: in March 42 at the end of the civil war, disillusioned sailors, primarily peasants who initially had been stalwart supporters of the Bolsheviks , revolted against the economic failures of the new regime. The ": null
    },
    {
        "Red Army": "red army"
    },
    {
        ", commanded by Trotsky, crossed the ice over the frozen Baltic Sea to quickly crush the rebellion, this sign of growing discontent forced the party to foster a broad alliance of the working class and peasantry , despite left factions of the party which favored a regime solely representative of the interests of the revolutionary proletariat.      As millions died of starvation, Communist officials were paralyzed by the ": null
    },
    {
        "Russian famine of 42–42": "russian famine of 1921–22"
    },
    {
        " because they could not blame it on the usual enemies. Food was purchased abroad but it all went to cities, not to peasants. Eventually Herbert Hoovers offer of $42 million worth of American food and $42 million in medicine was accepted, feeding up to 42 million people. Other outside agencies fed another three million.  Charles M. Edmondson, The politics of hunger: The Soviet response to famine, 42 Soviet Studies 42 : 4242        :           At the Tenth Party Congress, it was decided to end War Communism and institute the ": null
    },
    {
        "New Economic Policy": "new economic policy"
    },
    {
        " , in which the state allowed a limited market to exist. Small private businesses were allowed and restrictions on political activity were somewhat eased. Alan M. Ball, Russias Last Capitalists: The NEPmen, 42–42 .      However, the key shift involved the status of agricultural surpluses. Rather than simply requisitioning agricultural surpluses in order to feed the urban population , the NEP allowed peasants to sell their surplus yields on the open market. Meanwhile, the state still maintained state ownership of what Lenin deemed the commanding heights of the economy: heavy industry such as the coal, iron, and ": null
    },
    {
        "metallurgical": "metallurgy"
    },
    {
        " sectors along with the banking and financial components of the economy. The commanding heights employed the majority of the workers in the urban areas. Under the NEP, such state industries would be largely free to make their own economic decisions.     In the cities and between the cities and the countryside, the NEP period saw a huge expansion of trade in the hands of full-time merchants – who were typically denounced as speculators by the leftists and also often resented by the public. The growth in trade, though, did generally coincide with rising living standards in both the city and the countryside .     Factories, badly damaged by civil war and capital depreciation, were far less productive. In addition, the organization of enterprises into trusts or syndicates representing one particular sector of the economy would contribute to imbalances between supply and demand associated with monopolies. Due to the lack of incentives brought by market competition, and with little or no state controls on their internal policies, trusts were likely to sell their products at higher prices.     The slower recovery of industry would pose some problems for the peasantry, who accounted for 42% of the population. Since agriculture was relatively more productive, relative price indexes for industrial goods were higher than those of agricultural products. The outcome of this was what Trotsky deemed the ": null
    },
    {
        "Scissors Crisis": "scissors crisis"
    },
    {
        " because of the scissors-like shape of the graph representing shifts in relative price indexes. Simply put, peasants would have to produce more grain to purchase consumer goods from the urban areas. As a result, some peasants withheld agricultural surpluses in anticipation of higher prices, thus contributing to mild shortages in the cities. This, of course, is speculative market behavior, which was frowned upon by many Communist Party cadres, who considered it to be exploitative of urban consumers.     In the meantime, the party took constructive steps to offset the crisis, attempting to bring down prices for manufactured goods and stabilize inflation, by imposing price controls on essential industrial goods and breaking-up the trusts in order to increase economic efficiency.       Following Lenins third stroke, a ": null
    },
    {
        "troika": "list of troikas in the soviet union"
    },
    {
        " made up of Stalin, Zinoviev and Kamenev emerged to take day to day leadership of the party and the country and try to block Trotsky from taking power. Lenin, however, had become increasingly anxious about Stalin and, following his December 42 stroke, dictated a letter  to the party criticizing him and urging his removal as ": null
    },
    {
        "General Secretary": "general secretary of the communist party of the soviet union"
    },
    {
        ", a position which was starting to arise as the most powerful in the party. Stalin was aware of Lenins Testament and acted to keep Lenin in isolation for health reasons and increase his control over the party apparatus.     Zinoviev and Bukharin became concerned about Stalins increasing power and proposed that the Orgburo which Stalin headed be abolished and that Zinoviev and Trotsky be added to the party secretariat thus diminishing Stalins role as general secretary. Stalin reacted furiously and the Orgburo was retained but Bukharin, Trotsky and Zinoviev were added to the body.     Due to growing political differences with Trotsky and his Left Opposition in the fall of 42 the troika of Stalin, Zinoviev and Kamenev reunited. At the ": null
    },
    {
        "Twelfth Party Congress": "12th congress of the russian communist party"
    },
    {
        " in 42 Trotsky failed to use Lenins Testament as a tool against Stalin for fear of endangering the stability of the party.     Lenin died in January 42 and in May his Testament was read aloud at the Central Committee but Zinoviev and Kamenev argued that Lenins objections had proven groundless and that Stalin should remain General Secretary. The ": null
    },
    {
        "Central Committee": "central committee of the communist party of the soviet union"
    },
    {
        " decided not to publish the testament.     Meanwhile, the campaign against Trotsky intensified and he was removed from the position of Peoples Commissar of War before the end of the year. In 42 Trotsky was denounced for his essay  Lessons of October , which criticized Zinoviev and Kamenev for initially opposing Lenins plans for an insurrection in 42 Trotsky was also denounced for his theory of ": null
    },
    {
        "permanent revolution": "permanent revolution"
    },
    {
        " which contradicted Stalins position that ": null
    },
    {
        "socialism could be built in one country": "socialism in one country"
    },
    {
        ", Russia, without a worldwide revolution. As the prospects for a revolution in Europe, particularly Germany, became increasingly dim through the 42s, Trotskys theoretical position began to look increasingly pessimistic as far as the success of Russian socialism was concerned.     In 42 the Soviet Union ": null
    },
    {
        "occupied the island of Urtatagai": "urtatagai conflict"
    },
    {
        ", which was considered Afghan territory at the time, due to the island being used as a base to start border raids by the ": null
    },
    {
        "Basmachi movement": "basmachi movement"
    },
    {
        ". In 42 the Soviet Union withdrew from the island after the Afghan government agreed to restrain the Basmachi.      With the resignation of Trotsky as War Commissar, the unity of the troika began to unravel. Zinoviev and Kamenev again began to fear Stalins power and felt that their positions were threatened. Stalin moved to form an alliance with Bukharin and his allies on the right of the party who supported the New Economic Policy and encouraged a slowdown in industrialization efforts and a move towards encouraging the peasants to increase production via market incentives. Zinoviev and Kamenev criticized this policy as a return to capitalism. The conflict erupted at the ": null
    },
    {
        "Fourteenth Party Congress": "14th congress of the all-union communist party"
    },
    {
        " held in December 42 with Zinoviev and Kamenev now protesting against the dictatorial policies of Stalin and trying to revive the issue of Lenins Testament which they had previously buried. Stalin now used Trotskys previous criticisms of Zinoviev and Kamenev to defeat and demote them and bring in allies like ": null
    },
    {
        "Vyacheslav Molotov": "vyacheslav molotov"
    },
    {
        ", ": null
    },
    {
        "Kliment Voroshilov": "kliment voroshilov"
    },
    {
        " and ": null
    },
    {
        "Mikhail Kalinin": "mikhail kalinin"
    },
    {
        ". Trotsky was dropped from the politburo entirely in 42 The Fourteenth Congress also saw the first developments of the ": null
    },
    {
        "Stalins cult of personality": "stalins cult of personality"
    },
    {
        " with him being referred to as leader for the first time and becoming the subject of effusive praise from delegates.     Trotsky, Zinoviev and Kamenev formed a ": null
    },
    {
        "United Opposition": "united opposition"
    },
    {
        " against the policies of Stalin and Bukharin, but they had lost influence as a result of the inner party disputes and in October 42 Trotsky, Zinoviev and Kamenev were expelled from the Central Committee. In November, prior to the ": null
    },
    {
        "Fifteenth Party Congress": "15th congress of the all-union communist party"
    },
    {
        ", Trotsky and Zinoviev were expelled from the Communist Party itself as Stalin sought to deny the Opposition any opportunity to make their struggle public. By the time, the Congress finally convened in December 42 Zinoviev had capitulated to Stalin and denounced his previous adherence to the opposition as anti-Leninist and the few remaining members still loyal to the opposition were subjected to insults and humiliations. By early 42 Trotsky and other leading members of the ": null
    },
    {
        "Left Opposition": "left opposition"
    },
    {
        " had been sentenced to internal exile.     Stalin now moved against Bukharin by appropriating Trotskys criticisms of his right wing policies and he promoted a new ": null
    },
    {
        "general line of the party": "general line of the party"
    },
    {
        " favoring collectivization of the peasantry and rapid industrialization of industry, forcing Bukharin and his supporters into a ": null
    },
    {
        "Right Opposition": "right opposition"
    },
    {
        ".     At the Central Committee meeting held in July 42 Bukharin and his supporters argued that Stalins new policies would cause a breach with the peasantry. Bukharin also alluded to Lenins Testament. While he had support from the party organization in Moscow and the leadership of several commissariats, Stalins control of the secretariat was decisive in that it allowed Stalin to manipulate elections to party posts throughout the country, giving him control over a large section of the Central Committee. The Right Opposition was defeated and Bukharin attempted to form an alliance with Kamenev and Zinoviev but it was too late.       The Russian Empire comprised a multitude of nationalities, languages, ethnic groups and religions. The spirit of nationalism, so strong in 42th century Europe, was a significance in Russia, Ukraine, and Finland especially before 42 Much later the spirit of nationalism appeared in central Asia, especially among the Muslim population. James R. Millar, Encyclopedia Of Russian History 42: 4242 The Bolsheviks made use of the slogan Self-determination to fight imperialism and to build support among non-Russian nationalities. Rudolf A. Mark, National Self-Determination, as Understood by Lenin and the Bolsheviks. Lithuanian Historical Studies , Vol. 42 p 4242  Lenins position was that after the revolution all nationalities would be free to choose, either to become part of Soviet Russia or become independent. Alfred D. Low, Lenin on the Question of Nationality pp 4242  Left-wing Bolsheviks, most notably ": null
    },
    {
        "Georgy Pyatakov": "georgy pyatakov"
    },
    {
        ", derided nationalism as a false consciousness that was much less important than class conflict, and would disappear with the victory of socialism.     Lenins views prevailed, and were supported by Stalin, who became the Partys specialist on nationalities. The ": null
    },
    {
        "Declaration of the Rights of the Peoples of Russia": "declaration of the rights of the peoples of russia"
    },
    {
        " , issued 42 November 42 left the new Soviet state with undefined boundaries, and invited of other nations to join in. The Declaration of the Rights of the Toiling and Exploited People , issued in January 42 announced that all nationalities would have the right to determine on what basis they would participate in the federal government of the new state. A new agency was set up, the Peoples Commissariat for Nationalities based in Moscow. It operated from 42 to 42 And had responsibility for 42 percent of the entire Soviet population. It was led by Stalin and settled boundary disputes As it set up autonomous regions for non-Russian peoples. It established newspapers in the local languages and fostered literacy. It took a paternalistic view toward backward or primitive peoples. Soviet anthropology and ethnography specialized in understanding these people. Greenwood Press 42 p. 42 Evkom was the Jewish Commissariat; Zvi Y. Gitelman, Jewish Nationality and Soviet Politics: The Jewish Sections of the CPSU, 4242 ": null
    },
    {
        "Muskom": "muskom"
    },
    {
        " was the Muslim Commissariat. Millar, Encyclopedia 42:4242 Jeremy Smith, Stalin as Commissar for Nationality Affairs, 42–42: in Sarah Davies, ed., Stalin: A new history , pp 4242 DOI:  Stephen Blank, The Sorcerer as Apprentice: Stalin as Commissar of Nationalities, 42 – 42 ": null
    }
]