[
    {
        "      The first written records of the region come from Arab traders in the 42th and 42th centuries. In medieval times, the region was dominated by the ": null
    },
    {
        "Trans-Saharan trade": "trans-saharan trade"
    },
    {
        " and was ruled by the ": null
    },
    {
        "Mali Empire": "mali empire"
    },
    {
        ". In the 42th century, the region came to be ruled by the ": null
    },
    {
        "Songhai Empire": "songhai empire"
    },
    {
        ". The first Europeans to visit the Gambia ": null
    },
    {
        "River": "gambia river"
    },
    {
        " were the ": null
    },
    {
        "Portuguese": "portuguese empire"
    },
    {
        " in the 42th century, who attempted to settle on the river banks, but no settlement of significant size was established. Descendants of the Portuguese settlers remained until the 42th century. In the late 42th century, ": null
    },
    {
        "English": "english people"
    },
    {
        " merchants attempted to begin a trade with the Gambia, reporting that it was a river of secret trade and riches concealed by the Portuguese.     In the early 42th century, the French attempted to settle the Gambia but failed. Further English expeditions from 42 to 42 including under ": null
    },
    {
        "Richard Jobson": "richard jobson"
    },
    {
        ", were attempted but resulted in huge losses. Merchants of the ": null
    },
    {
        "Commonwealth of England": "commonwealth of england"
    },
    {
        " sent expeditions to the Gambia in 42 but their ships were captured by ": null
    },
    {
        "Prince Rupert": "prince rupert of the rhine"
    },
    {
        " the following year. In 42 the ": null
    },
    {
        "Couronian colonization": "couronian colonization"
    },
    {
        " of the Gambia had also begun, with forts and outposts being erected on several islands. The ": null
    },
    {
        "Courlanders": "duchy of courland and semigallia"
    },
    {
        " remained dominant until 42 when their possessions were handed over to the ": null
    },
    {
        "Dutch West India Company": "dutch west india company"
    },
    {
        ". In 42 the Courlanders resumed possession, but the next year was expelled by the newly formed ": null
    },
    {
        "Royal Adventurers in Africa Company": "royal african company"
    },
    {
        ".     In 42 the rights of the Royal Adventurers to the Gambia were sublet to the Gambia Adventurers but later reverted to the new Royal African Company. 42 saw the beginning of a century-and-a-half-long struggle between the English and French for supremacy over the Gambia and ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        ". The English possessions were captured several times by the French, but in the ": null
    },
    {
        "Treaty of Utrecht": "treaty of utrecht"
    },
    {
        " in 42 the British rights to the region were recognized by the French. In the mid42th century, the Royal African Company began having serious financial problems and in 42 Parliament divested the company of its rights in the region. In 42 the Crown gained possession of the territory, and it formed part of the ": null
    },
    {
        "Senegambia": "senegambia confederation"
    },
    {
        " colony. In 42 Senegambia ceased existing as a British colony.     Following the cessation of Senegambia, the colony was in effect abandoned. The only Europeans were traders who existed in a few settlements on the river banks, such as Pisania. Following the end of the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", ": null
    },
    {
        "Alexander Grant": "alexander grant"
    },
    {
        " was sent to re-establish a presence in the Gambia. He established ": null
    },
    {
        "Bathurst": "banjul"
    },
    {
        " and the British possessions continued to grow in size through a series of treaties. It was administered from ": null
    },
    {
        "Sierra Leone": "sierra leone colony and protectorate"
    },
    {
        " until 42 when it was given its own ": null
    },
    {
        "Governor": "list of colonial governors of the gambia"
    },
    {
        ", but in 42 merged again with Sierra Leone. The ": null
    },
    {
        "cession of the Gambia to France": "proposed cession of the gambia to france"
    },
    {
        " was proposed in the late 42th century but was met with considerable protest in both the Gambia and in England. In 42 the colony regained its own government structure, and in 42 the Gambia ": null
    },
    {
        "Colony, and Protectorate": "gambia colony and protectorate"
    },
    {
        " was properly established along the lines it would continue to hold until independence.     In 42 legislative and executive councils were established for the Gambia, as well as the Gambia ": null
    },
    {
        "Company": "gambia regiment"
    },
    {
        " of the ": null
    },
    {
        "RWAFF": "royal west african frontier force"
    },
    {
        ". Gambian soldiers fought in ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", and in the 42s ": null
    },
    {
        "Edward Francis Small": "edward francis small"
    },
    {
        " led the push for emancipation, founding the ": null
    },
    {
        "Bathurst Trade Union": "bathurst trade union"
    },
    {
        " and the Rate Payers Association. During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the Gambia Company was raised to a regiment, and notably fought in the ": null
    },
    {
        "Burma Campaign": "burma campaign 1944–45"
    },
    {
        " in the latter years of the war. ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        "s visit to the Gambia in 42 was the first visit by a sitting ": null
    },
    {
        "US President": "president of the united states"
    },
    {
        " to the African continent": "united states presidential visits to sub-saharan africa"
    },
    {
        ". Following the war, the pace of reform increased, with an economic focus on the production of the  Peanut  and a failed programme called the Gambia Poultry Scheme by the ": null
    },
    {
        "Colonial Development Corporation": "cdc group"
    },
    {
        ". The push towards self-government increased its pace, and the ": null
    },
    {
        "House of Representatives": "house of representatives of the gambia"
    },
    {
        " was established in 42 ": null
    },
    {
        "Pierre Sarr NJie": "pierre sarr njie"
    },
    {
        " served as ": null
    },
    {
        "Chief Minister": "prime minister of the gambia"
    },
    {
        " from 42 to 42 though following the ": null
    },
    {
        "42 election": "gambian legislative election, 1962"
    },
    {
        " Dawda Jawara": "dawda jawara"
    },
    {
        " became Prime Minister, beginning the ": null
    },
    {
        "Peoples Progressive Party": "peoples progressive party"
    },
    {
        "s dominance of Gambian politics for the next thirty years. Full internal self-government was achieved in 42 and following extensive negotiations, the Gambia declared independence in 42     The Gambia gained independence as a constitutional monarchy that remained part of the Commonwealth, but in 42 became a presidential republic. Jawara was elected the first ": null
    },
    {
        "President": "president of the gambia"
    },
    {
        " and remained in this position until 42 A coup, led by ": null
    },
    {
        "Kukoi Sanyang": "kukoi sanyang"
    },
    {
        ", was attempted in 42 but failed after Senegalese intervention. From 42 to 42 the Gambia entered into the ": null
    },
    {
        "Senegambia Confederation": "senegambia confederation"
    },
    {
        ", which collapsed. In 42 Jawara was overthrown in a coup détat led by ": null
    },
    {
        "Yahya Jammeh": "yahya jammeh"
    },
    {
        ", who ruled as a military dictator for two years through the ": null
    },
    {
        "AFPRC": "armed forces provisional ruling council"
    },
    {
        ". He was elected President in ": null
    },
    {
        "42": "gambian presidential election, 1996"
    },
    {
        " and continued in this role until 42 During this time, Jammehs party, the ": null
    },
    {
        "APRC": "alliance for patriotic reorientation and construction"
    },
    {
        ", dominated Gambian politics. the Gambia left the ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        " in 42 and suffered an unsuccessful ": null
    },
    {
        "coup attempt": "2014 gambian coup détat attempt"
    },
    {
        " in 42 In the ": null
    },
    {
        "42 election": "gambian presidential election, 2016"
    },
    {
        ", ": null
    },
    {
        "Adama Barrow": "adama barrow"
    },
    {
        " was elected President, backed by a ": null
    },
    {
        "coalition of opposition parties": "coalition 2016"
    },
    {
        ". Jammehs refusal to step down led to a ": null
    },
    {
        "constitutional crisis": "2016–2017 gambian constitutional crisis"
    },
    {
        " and the ": null
    },
    {
        "intervention": "ecowas military intervention in the gambia"
    },
    {
        " of ": null
    },
    {
        "ECOWAS": "economic community of west african states"
    },
    {
        " forces.       It is possible that the ": null
    },
    {
        "Carthaginian": "ancient carthage"
    },
    {
        " explorer ": null
    },
    {
        "Hanno the Navigator": "hanno the navigator"
    },
    {
        " sailed as far as the Gambia on an expedition in the sixth or fifth century BC. Harden, Donald The Phoenicians. Harmondsworth: Penguin Books.       The first verifiable written accounts of the region come from records of ": null
    },
    {
        "Arab": "arab"
    },
    {
        " traders in the 42th and 42th centuries AD. In ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " times the area was dominated by the ": null
    },
    {
        "trans-Saharan trade": "trans-saharan trade"
    },
    {
        ". The ": null
    },
    {
        "Mali Empire": "mali empire"
    },
    {
        ", most renowned for the ": null
    },
    {
        "Mandinka": "mandinka people"
    },
    {
        " ruler ": null
    },
    {
        "Mansa": "mansa"
    },
    {
        " Kankan Musa": "kankan musa"
    },
    {
        ", brought worldwide recognition to the region due to its enormous wealth, scholarship, and civility.   From the early 42th century, the ": null
    },
    {
        "Kouroukan Fouga": "kouroukan fouga"
    },
    {
        ", ": null
    },
    {
        "Mali": "mali"
    },
    {
        "s constitution, was the law of the land. The North African scholar and traveler ": null
    },
    {
        "Ibn Battuta": "ibn battuta"
    },
    {
        " visited the area in 42 and said about its inhabitants:     The ": null
    },
    {
        "Songhai Empire": "songhai empire"
    },
    {
        ", named after the ": null
    },
    {
        "Songhai people": "songhai people"
    },
    {
        " whose king assumed formal control of the Empire, came to dominate the region in the 42th century.         The European discovery of the Gambia began in the 42th century, with the push toward exploration by the Portuguese ": null
    },
    {
        "Prince Henry the Navigator": "prince henry the navigator"
    },
    {
        ". In 42 Portuguese captain Nuno Tristao made contact with the inhabitants of ": null
    },
    {
        "Cape Vert": "cape vert"
    },
    {
        ", and made a treaty of commerce and friendship with them. Every year following, ships were sent from Portugal to trade with them. From them, information reached Henry the Navigator regarding the Gambia, and according to their reports, the banks of the river yielded large quantities of gold. In 42 Henry induced a Venetian called ": null
    },
    {
        "Luiz de Cadamosto": "alvise cadamosto"
    },
    {
        " to take a single ship on an expedition in search of the river. Later in the same year, he sent a Genoese trader called ": null
    },
    {
        "Antoniotto Usodimare": "antoniotto usodimare"
    },
    {
        " with two ships on the same quest. The two joined forces near Cape Verde and, by keeping close to the coast, easily found the mouth of the Gambia River. Gray, p. 42     They arrived at the ": null
    },
    {
        "River Gambia": "gambia river"
    },
    {
        " in 42 and proceeded a short way upstream. They repeated the voyage the next year, proceeding further upstream and making contact with some of the native chiefs. When they were near the rivers mouth, they cast anchor at an island where one of their sailors, who had previously died of a fever, was buried. As his name was Andrew, they named the island ": null
    },
    {
        "St Andrews Island": "kunta kinteh island"
    },
    {
        ".  This expedition was followed by Portuguese attempts to establish a settlement on the river banks. No settlement ever reached a significant size, and many of the settlers intermarried with the natives while maintaining Portuguese dress and customs and professing to be ": null
    },
    {
        "Christians": "christians"
    },
    {
        ". Communities of Portuguese descent continued to exist in the Gambia until the 42th century, with Portuguese churches existing at San Domingo, Geregia and Tankular in 42 The further Portuguese settlement up the river was at Setuku near ": null
    },
    {
        "Fattatenda": "fattatenda"
    },
    {
        ". By the end of the 42th century, the ": null
    },
    {
        "Songhai Empire": "songhai empire"
    },
    {
        ", under constant assault by Portugal, collapsed. The name Gambia comes from the Portuguese word for trade, cambio.      After the Portuguese throne was seized by ": null
    },
    {
        "Philip II": "philip ii of spain"
    },
    {
        " in 42 a number of Portuguese sought refuge in ": null
    },
    {
        "England": "england"
    },
    {
        ". One of these refugees, Francisco Ferreira, piloted two English ships to the Gambia in 42 and returned with a profitable cargo of hides and ivory. In 42 ": null
    },
    {
        "António, Prior of Crato": "antónio, prior of crato"
    },
    {
        ", who had a claim to the throne of Portugal, sold to London and Devon merchants the exclusive right to trade between the Rivers Senegal and Gambia. This grant was confirmed to the grantees for a period of ten years by ": null
    },
    {
        "letters patent": "letters patent"
    },
    {
        " of ": null
    },
    {
        "Queen Elizabeth I": "elizabeth i of england"
    },
    {
        ". The merchants sent several ships to the coast, but, owing to Portuguese hostility, did not venture further south than ": null
    },
    {
        "Joal": "joal-fadiouth"
    },
    {
        ": 42 miles to the north of the river mouth. They reported that the Gambia was a river of secret trade and riches concealed by the Portuguese.           In 42 an attempt by the ": null
    },
    {
        "French": "france"
    },
    {
        " to settle in the Gambia ended disastrously due to sickness spreading among the settlers. Letters patent conferring the right of the exclusive trade with the River Gambia were subsequently granted again in 42 42 and 42 to other English adventurers, but no attempts were made by the English to explore until 42 An expedition that year was commanded by George Thomson and its objective was to open up trade with ": null
    },
    {
        "Timbuktu": "timbuktu"
    },
    {
        ". Leaving his ships at Gassan, Thompson proceeded with a small party in boats as far as the River Neriko. During his absence, the crew of his ship were massacred by the Portuguese. However, some of his party managed on their return to make their way overland to ": null
    },
    {
        "Cape Verde": "cape verde"
    },
    {
        " and then to England. Thomson remained in the Gambia with seven companions but was killed by one of them in a sudden dispute.     In the meantime, a relief expedition had departed from England under the command of ": null
    },
    {
        "Richard Jobson": "richard jobson"
    },
    {
        ", who seized some Portuguese shipping as a reprisal for the massacre at Gassan. Jobson also made his way up to Neriko and subsequently gave a very positive account of the commercial opportunities of the River Gambia. During his expedition, Jobson refused slaves offered by an African merchant, Buckor Sano. He said that we were a people who did not deal in such commodities, neither did we buy or sell one another, or any that had our own shapes. His protests were noted as exceptional by ": null
    },
    {
        "Hugh Thomas": "hugh thomas, baron thomas of swynnerton"
    },
    {
        ". Thomas, p. 42 However, both his and Thompsons expedition had resulted in significant losses and a subsequent voyage that he made in 42 proved a complete failure. After a loss of £42, the patentees made no further attempts to exploit the resources of the Gambia but confined their attention to the ": null
    },
    {
        "Gold Coast": "gold coast"
    },
    {
        ".     In 42 the ": null
    },
    {
        "Commonwealth of England": "commonwealth of england"
    },
    {
        " granted a patent to certain London merchants who in that and the following year sent two expeditions to the River Gambia and established a trading post at Bintang. Members of the expedition proceeded as far as the Barakunda Falls in search of gold, but the climate took its toll. In 42 ": null
    },
    {
        "Prince Rupert of the Rhine": "prince rupert of the rhine"
    },
    {
        " entered the Gambia with three Royalist ships and captured the patentees vessels. After this heavy loss, they abandoned any further enterprise in the Gambia.       During this, ": null
    },
    {
        "Jacob Kettler": "jacob kettler"
    },
    {
        ", the ": null
    },
    {
        "Duke of Courland": "duchy of courland and semigallia"
    },
    {
        ", had in 42 obtained from several native chiefs the cession of St Andrews Island and land at Banyon Point , ": null
    },
    {
        "Juffure": "jufureh"
    },
    {
        " and Gassan. Settlers, merchants and missionaries were sent out from Courland and forts were erected on St Andrews Island and at Banyon Point. This was part of a period in Courlander history known as ": null
    },
    {
        "Couronian colonization": "couronian colonization"
    },
    {
        ", which also saw them ": null
    },
    {
        "colonise": "couronian colonization of the americas"
    },
    {
        " Tobago": "tobago"
    },
    {
        ". The Courlanders believed that the possession of these territories would give them control over the river and enable them to levy tolls on all those who used the waterway. They erected a fort built out of local sandstone, appointed a ": null
    },
    {
        "Lutheran": "lutheranism"
    },
    {
        " pastor, and positioned the cannons on the island so as to command both of the channels to the north and the south. The plan was to sell slaves to the colony in Tobago, but this did not prosper. Thomas, p. 42 In 42 Kettler was made a prisoner by the Swedes during ": null
    },
    {
        "a war between": "deluge"
    },
    {
        " Sweden and Poland. As a consequence, funds were no longer available to maintain the garrisons and settlements in the Gambia and in 42 the Duke of Courlands agent at ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        " entered into an agreement with the ": null
    },
    {
        "Dutch West India Company": "dutch west india company"
    },
    {
        " whereby the Dukes possessions in the Gambia were handed over to the company. In 42 the fort on St Andrews Island was captured and plundered by a French privateer in Swedish service. The Dutch thereafter abandoned the fort and the Courlanders resumed possession. After the ": null
    },
    {
        "Restoration": "restoration"
    },
    {
        " of the English monarchy in 42 English interest in the Gambia was revived due to the reported existence of a gold mine in the upper reaches of the river. A new patent was granted to a number of people who were styled as the ": null
    },
    {
        "Royal Adventurers in Africa Company": "royal african company"
    },
    {
        ". The most prominent among them were ": null
    },
    {
        "James, Duke of York": "james ii of england"
    },
    {
        ", and Prince Rupert. At the end of the year, the Adventurers dispatched an expedition to the Gambia under the command of ": null
    },
    {
        "Robert Holmes": "robert holmes"
    },
    {
        ", who had been with Prince Rupert in the Gambia in 42     Holmes arrived at the river mouth at the beginning of 42 He proceeded to occupy ": null
    },
    {
        "Dog Island": "dog island, gambia"
    },
    {
        ", which he renamed Charles Island, and to establish a temporary fort there. On 42 March 42 he sailed up to St Andrews Island and called on the Courlander officer-in-charge to surrender, threatening to bombard the fort if his request was ignored. There were only seven Europeans in the garrison, and the Courlanders had no alternative but to submit. On the following day, Holmes took possession of the fort, which was renamed James Fort after the Duke of York. An attempt was made in 42 by the Dutch West India Company to gain possession of the fort. Firstly, they attempted to incite the natives of ": null
    },
    {
        "Barra": "barra, gambia"
    },
    {
        " against the English, secondly they offered bribes to certain English officers, and, lastly, they attempted to bombard the fort. None of these efforts were successful and the English remained in control.       Meanwhile, the Duke of Courland had lodged a protest against the seizure of his possessions in a time of peace. On 42 November 42 after negotiations over the future of the territories, he relinquished in favour of Charles II all claims to his African possessions and in return was granted the island of ": null
    },
    {
        "Tobago": "tobago"
    },
    {
        " and the right for himself to personally trade in the River Gambia. In 42 the Royal Adventurers sublet their rights between Capes ": null
    },
    {
        "Blanco": "ras nouadhibou"
    },
    {
        " and ": null
    },
    {
        "Palmas": "cape palmas"
    },
    {
        " to another body of adventurers, who became known as the Gambia Adventurers. They were to exploit the Rivers Gambia, ": null
    },
    {
        "Sierra Leone": "sierra leone river"
    },
    {
        ", and ": null
    },
    {
        "Sherbro": "sherbro island"
    },
    {
        ".This group of adventurers enjoyed these rights for only a year, when, on the expiration of their lease, they reverted to the Royal African Company, which had purchased the rights and property of the Royal Adventurers six years earlier.     In 42 the French wrested the island of ": null
    },
    {
        "Gorée": "gorée"
    },
    {
        " from the Dutch. This began a century and a half period of struggle between England and France for political and commercial supremacy in the regions of ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        " and the Gambia. By 42 the French had acquired a small enclave at ": null
    },
    {
        "Albreda": "albreda"
    },
    {
        " opposite to James Island. Except for short period, during which trouble with the natives of Barra or hostilities with England compelled them to temporarily abandon the place, they retained a foothold there until 42           In the wars with ": null
    },
    {
        "France": "france"
    },
    {
        " following the ": null
    },
    {
        "Glorious Revolution": "glorious revolution"
    },
    {
        ", James Fort was captured on four occasions by the French, in 42 42 42 and 42 However, no attempt was made by France to occupy the fort permanently. At the ": null
    },
    {
        "Treaty of Utrecht": "treaty of utrecht"
    },
    {
        " in 42 the French recognised the right of the English to James Island and their settlements on the River Gambia. One of the results of these wars was an outbreak of piracy along the West African coast. The English trade in the Gambia suffered heavily from the efforts of the pirates. In 42 one pirate, ": null
    },
    {
        "Howel Davis": "howell davis"
    },
    {
        ", captured James Fort. In 42 part of the garrison of the fort mutinied under the leadership of Captain John Massey, seizing one of the companys ships and turning pirate. Finally, in 42 James Fort was extensively damaged by an accidental explosion of gunpowder.     Following these incidents, the Royal African Company enjoyed 42 years of comparative prosperity. Factories were established as far up the river as ": null
    },
    {
        "Fattatenda": "fattatenda"
    },
    {
        " and at other places and a fairly considerable trade was carried out with the interior of Africa. Nevertheless, despite an annual subsidy from the British government for the maintenance of their forts, the Royal African Company became involved in serious financial difficulties. In 42 James Island was found to be in a most miserable condition . In the following year, it was reported that the ": null
    },
    {
        "garrison": "garrison"
    },
    {
        " at James Fort had been reduced through sickness from around 42 men to between five and eight, and that, with all the officers being dead, a common soldier had succeeded to the command.     By 42 the position had become critical and an ": null
    },
    {
        "Act of Parliament": "acts of parliament in the united kingdom"
    },
    {
        " was passed divesting the Royal African Company of its charter and divesting its forts and settlements into a new company, controlled by a committee of merchants. The Act prohibited the new company from trading in its corporate capacity but allowed it an annual subsidy for the upkeep of the forts. It was hoped that this would prevent the monopolistic tendencies of rule by a joint stock company and at the same time to save the government the expense entailed by the creation of a colonial ": null
    },
    {
        "civil service": "civil service"
    },
    {
        ".       In 42 the fort and settlements were taken from this new company by another Act of Parliament and given to the Crown. For the next 42 years, the Gambia formed part of the ": null
    },
    {
        "Senegambia": "senegambia confederation"
    },
    {
        " colony. The government headquarters were at ": null
    },
    {
        "St Louis": "saint-louis, senegal"
    },
    {
        " at the mouth of the ": null
    },
    {
        "Senegal River": "senegal river"
    },
    {
        " and a Lieutenant Governor was appointed to take charge of James Fort and the settlements in the Gambia. In 42 the French captured James Fort for the fifth and final time. On this occasion, they so successfully demolished the fortifications that at the close of the war it was found impossible to rebuild them. Besides a brief period following the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", when the island was temporarily occupied by a handful of soldiers as an outpost, James Island stopped playing any part in the history of the Gambia.     In 42 the French privateer Senegal captured four vessels which had been part of the British garrison at ": null
    },
    {
        "Goree": "gorée"
    },
    {
        " sent to the Bintang Creek under the command of Major Houghton to obtain building material. The Senegal, in turn, was captured by HMS Zephyr after an engagement off Barra Point. In 42 St Louis and Goree were handed back to France and Senegambia ceased existing as a British colony.       It was once again handed back to the Royal African Company. However, they made no attempt to administer the Gambia. In 42 ": null
    },
    {
        "Lemain Island": "maccarthy island"
    },
    {
        " was acquired by the British government with the view of the establishment of a convict settlement, but nothing came of the plan. For the next thirty years, British influence in the Gambia was confined to the operations of a small number of traders. Settlements were established by these traders along the river banks. Among these settlements, the most important probably was Pisania. This settlement, which was already in operation by 42 was occupied by Dr John Laidley and a family by the name of Aynsley. Subsequently, Laidley and the Aynsleys rendered invaluable assistance to Major ": null
    },
    {
        "Daniel Houghton": "daniel houghton"
    },
    {
        " in 42 ": null
    },
    {
        "Mungo Park": "mungo park"
    },
    {
        " in 42 and 42 and Major William Grey in 42 in the course of their journeys into the interior of Africa.                At the beginning of the 42th century, Montgomery identified that most settlements on the Gambia ": null
    },
    {
        "River": "gambia river"
    },
    {
        " were British. However, to the north, there were several native kingdoms, including Barra, Boor Salum, Yani and Woolli. At the time, Barra had a population of 42 and its capital was Barra Inding, although the main trading place was Jillifrey. Boor Salum had a population of 42 and the smaller kingdoms of Yani and Woolli were to the north of it. The ": null
    },
    {
        "Mandinka people": "mandinka people"
    },
    {
        " were the inhabitants of all four kingdoms, which all conducted a considerable trade with the interior of Africa. Montgomery said that no considerable kingdom existed south of the Gambia. Montgomery, p. 42     In 42 the African slave trade was abolished by an Act of Parliament. At that time, the British were in control of Goree. With the help of the Royal Navy, the Goree garrison made efforts to suppress the slave traders operating in the River Gambia, who were primarily Spanish and American. On more than one occasion, the slavers offered a stubborn resistance and the Royal African Corps suffered several casualties.            Following the Treaty of Paris in 42 which ended the war with the French, the British forces and officials on the island of evacuated ": null
    },
    {
        "Gorée": "gorée"
    },
    {
        ". Captain ": null
    },
    {
        "Alexander Grant": "alexander grant"
    },
    {
        " was sent with a detachment of ": null
    },
    {
        "Royal African Corps": "royal african corps"
    },
    {
        " soldiers to explore the possibility of rebuilding Fort James on ": null
    },
    {
        "James Island": "kunta kinteh island"
    },
    {
        " but decided that more space would be provided by St Marys Island. Grant made a treaty with the King of Kombo on 42 April 42 that ceded the island to the UK. He also founded the town of ": null
    },
    {
        "Bathurst": "banjul"
    },
    {
        " on St Marys Island. In 42 the Royal African Company was dissolved by Act of Parliament and the Gambia was placed under the jurisdiction of the ": null
    },
    {
        "Governor of Sierra Leone": "list of colonial governors of sierra leone"
    },
    {
        ". Reeve, pp. 4242 It continued to be administered from ": null
    },
    {
        "Sierra Leone": "sierra leone"
    },
    {
        " until 42 when it became a separate colony. In 42 however, the Gambia and Sierra Leone were once again united under the same administration.     The British government continued to extend its territorial acquisitions beyond St Marys Island by concluding treaties with a number of native chiefs. ": null
    },
    {
        "Lemain Island": "maccarthy island"
    },
    {
        ", 42 miles up the river, was ceded to the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " in 42 by King Collie and renamed as MacCarthy Island. ": null
    },
    {
        "Georgetown": "janjanbureh, gambia"
    },
    {
        " was established on the island as a military barracks and settlement for liberated slaves. In 42 the Ceded Mile, a one-mile strip on the north bank of the River Gambia, was ceded by the King of Barra. Fattatenda and the surrounding district was ceded in 42 Commonwealth and Colonial Law by Kenneth Roberts-Wray, London, Stevens, 42 Pp. 4242 In 42 and 42 considerable areas of the mainland adjoining St Marys Island were obtained from the King of Kombo for the settlement of discharged soldiers of the ": null
    },
    {
        "West India Regiment": "west india regiment"
    },
    {
        "s and liberated Africans. Cessions of another land further upstream were obtained at various dates, including Albreda, the French enclave, which was obtained in 42                In the 42s, under the leadership of ": null
    },
    {
        "Louis Faidherbe": "louis faidherbe"
    },
    {
        ", the French colony of ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        " began a vigorous expansion until it virtually engulfed the Gambia. The colony assumed an importance to the French as a possible trade route, ": null
    },
    {
        "proposed cession of the Gambia": "proposed cession of the gambia to france"
    },
    {
        " for some other part of West Africa was first mooted in 42 It was seriously discussed again during 42 and 42 In 42 and 42 negotiations were entered into between the French and British government over the proposed cession of the Gambia in exchange for other territories in West Africa.      However, the proposal aroused such opposition in ": null
    },
    {
        "Parliament": "parliament of the united kingdom"
    },
    {
        " and among various mercantile bodies in England, as well as among the native inhabitants of the Gambia, that the British government was unable to press ahead with the scheme. This remarkably powerful Gambia lobby was revived whenever the topic of the proposed cession was brought up, and successfully saw that the British could not cede any land. In 42 the Gambia was once again separated from Sierra Leone and from that date until its independence operated as a separate colony. In 42 an agreement was reached between the French and British governments for the delimitation of the borders of the Gambia, Senegal, and ": null
    },
    {
        "Casamance": "casamance"
    },
    {
        ".     During this time, despite a number of small wars with the natives, the Gambian government was able to conclude a series of treaties with the chiefs living along the banks of the river. Some of these included the cession of small tracts of territory, but most conferred British protection. The last and most important of these was concluded in 42 with Musa Molloh, the paramount chief of Fuladu. In 42 an Ordinance was passed for the better administration of these districts which had not been ceded but merely placed under the protection of the British government. It was decided that it was not feasible to administer these places from the seat of government in Bathurst, so in 42 and the following years, ordinances were passed to bring these places under the control of the Protectorate. Finally, a Protectorate Ordinance passed in 42 brought the whole of the Gambia besides St Marys Island under the Protectorate system.         the Gambia received its own executive and legislative councils in 42 and gradually progressed toward self-government. Also in 42 the Gambia ": null
    },
    {
        "Company": "gambia regiment"
    },
    {
        ", the first colonial military unit of the Gambia, was founded. It was formed as part of the Sierra Leone Battalion of the new ": null
    },
    {
        "West African Frontier Force": "royal west african frontier force"
    },
    {
        " . A 42 ordinance abolished slavery.          During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the Gambia Company served alongside other British troops in the ": null
    },
    {
        "Kamerun campaign": "kamerun campaign"
    },
    {
        ", under the command of Captain V. B. Thurston of the ": null
    },
    {
        "Dorsetshire Regiment": "dorset regiment"
    },
    {
        ", and a number of its soldiers received gallantry medals for their conduct.     In 42 the ": null
    },
    {
        "National Congress of British West Africa": "national congress of british west africa"
    },
    {
        " was formed, an organisation working towards African emancipation, with ": null
    },
    {
        "Edward Francis Small": "edward francis small"
    },
    {
        " as the sole delegate. He returned and founded the Gambia Section of the Congress, the principal aim of which was to achieved elected representation in the government of the Gambia. It also frequently petitioned against unpopular government policies. It had some success, with Small founding the first Gambian trade union, the ": null
    },
    {
        "Bathurst Trade Union": "bathurst trade union"
    },
    {
        ", in 42 However, it failed to prevent its opponent, Ousman Jeng, being appointed to the Legislative Council in 42 and again in 42     In 42 Small founded the Rate Payers Association to oppose the unpopular policies of ": null
    },
    {
        "Richmond Palmer": "richmond palmer"
    },
    {
        ", the Governor, and of the conservative elements of Gambian politics, led by Forster and his nephew W. D. Carrol. By the end of 42 the RPA was winning all the seats on the Bathurst Urban District Council and its successor the Bathurst Advisory Town Council, however, had no representation in the Legislative Council.       During World War II, the Gambia Company became the Gambia Regiment, with a strength of two battalions from 42 It fought in the ": null
    },
    {
        "Burma campaign": "burma campaign"
    },
    {
        " and served for some time under the command of ": null
    },
    {
        "Antony Read": "antony read"
    },
    {
        ", later the ": null
    },
    {
        "Quartermaster-General to the Forces": "quartermaster-general to the forces"
    },
    {
        ". the Gambia itself was also important to the war effort. It was home to RAF Bathurst, a flying boat base, and RAF Yundum, an RAF station. HMS Melampus, a shore base, was also based at Bathurst for some of the war, and in 42 a ": null
    },
    {
        "light cruiser": "light cruiser"
    },
    {
        " named  was launched, which maintained ties to the colony until it was decommissioned in 42 Bathurst was also the nearest English-speaking port to Dakar, where, before the ": null
    },
    {
        "Battle of Dakar": "battle of dakar"
    },
    {
        ", the ": null
    },
    {
        "Vichy French": "vichy france"
    },
    {
        " battleship  had been told to travel to.      the Gambia was also home to 42 British General Hospital from 42 to 42 42 British General Hospital from 42 to 42 and 42 British General Hospital again from 42 to 42  During World War II, the Gambia also formed an Auxiliary Police, who, among other things, helped to enforce the blackout in Bathurst. Many air raid shelters were built across the Gambia too. In 42 ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        ", the ": null
    },
    {
        "President of the United States": "president of the united states"
    },
    {
        ", stopped overnight in Bathurst en route to and from the ": null
    },
    {
        "Casablanca Conference": "casablanca conference"
    },
    {
        ". This marked the first ": null
    },
    {
        "visit to the African continent": "united states presidential visits to sub-saharan africa"
    },
    {
        " by a sitting US President. The visit hardened his views against British colonial rule. Appalled, as he was, by the poverty and disease that was present there, he wrote to ": null
    },
    {
        "Churchill": "winston churchill"
    },
    {
        " describing the territory as a hell-hole .        After the Second World War, the pace of reform increased. The economy of the Gambia, like other African countries at the time, was very heavily orientated towards agriculture. Reliance on the ": null
    },
    {
        "groundnut": "faboideae"
    },
    {
        " became so strong that it made up almost the entirety of exports, making the economy vulnerable. Groundnuts were the only commodity subject to export duties;  these export duties resulted in the illegal smuggling of the product to ": null
    },
    {
        "French Senegal": "senegal"
    },
    {
        ".   Attempts were made to increase production of other goods for export: the Gambian Poultry Scheme pioneered by the ": null
    },
    {
        "Colonial Development Corporation": "cdc group"
    },
    {
        " aimed to produce twenty million ": null
    },
    {
        "eggs": "egg"
    },
    {
        " and one million ": null
    },
    {
        "lb": "pound"
    },
    {
        " of dressed poultry a year. The conditions in the Gambia proved unfavourable and ": null
    },
    {
        "typhoid": "typhoid"
    },
    {
        " killed much of the chicken stock, drawing criticism to the Corporation.      The River Gambia was the principal route of navigation and transport inland, with a port at Bathurst. The road network was mainly concentrated around Bathurst, with the remaining areas largely connected by dirt roads.   The only airport was at ": null
    },
    {
        "Yundum": "yundum airport"
    },
    {
        ", built in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ".  Post war it was used for passenger flights. Both ": null
    },
    {
        "British South American Airways": "british south american airways"
    },
    {
        " and the ": null
    },
    {
        "British Overseas Airways Corporation": "british overseas airways corporation"
    },
    {
        " had services, the former moving its service to ": null
    },
    {
        "Dakar": "dakar"
    },
    {
        ", which had a concrete runway .  The airport was rebuilt in 42 and the building is still in use today.     In anticipation of independence, efforts were made to create internal self-government. The 42 Constitution created a partly elected ": null
    },
    {
        "House of Representatives": "house of representatives"
    },
    {
        ", with 42 elected members and 42 chosen by the chiefs. This constitution proved flawed in the ": null
    },
    {
        "42 elections": "gambian legislative election, 1960"
    },
    {
        " when the two major parties tied with 42 seats each. With the support of the unelected chiefs, ": null
    },
    {
        "Pierra Sarr NJie": "pierre sarr njie"
    },
    {
        " of the ": null
    },
    {
        "United Party": "united party"
    },
    {
        " was appointed Chief Minister. ": null
    },
    {
        "Dawda Jawara": "dawda jawara"
    },
    {
        " of the ": null
    },
    {
        "Peoples Progressive Party": "peoples progressive party"
    },
    {
        " resigned as Minister of Education, triggering a Constitutional Conference arranged by the ": null
    },
    {
        "Secretary of State for the Colonies": "secretary of state for the colonies"
    },
    {
        ".      The Constitutional Conference paved the way for a new constitution that granted a greater degree of self-government and a House of Representatives with more elected members. Elections were held in ": null
    },
    {
        "42": "gambian legislative election, 1962"
    },
    {
        ", with Jawaras Progressive Party securing a majority of the elected seats. Under the new constitutional arrangements, Jawara was appointed Prime Minister: a position he held until it was abolished in 42 Following general elections in 42 full internal self-governance was granted in the following year.     Independent Gambia      At the Marlborough House constitutional conference in June 42 it was agreed between the British and Gambian delegations that the Gambia would become an independent country on 42 February 42 It was agreed that the ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        " would remain as the ": null
    },
    {
        "head of state": "head of state"
    },
    {
        ", and a ": null
    },
    {
        "Governor-General": "list of heads of state of the gambia"
    },
    {
        " would exercise executive powers on her behalf. On 42 February, ": null
    },
    {
        "Prince Edward, Duke of Kent": "prince edward, duke of kent"
    },
    {
        ", on behalf of the Queen, formally granted the country independence with Prime Minister Jawara representing the Gambia. It became the 42st independent member of the Commonwealth, with a constitution described as a sophisticated version of the Westminster export models. Darboe, p. 42     Following agreements between the ": null
    },
    {
        "British": "british government"
    },
    {
        " and Gambian Governments in July 42 the Gambia achieved ": null
    },
    {
        "independence": "gambia independence act 1964"
    },
    {
        " on 42 February 42 as a constitutional monarchy within the ": null
    },
    {
        "Commonwealth": "commonwealth of nations"
    },
    {
        ".     Shortly thereafter, the government held a referendum proposing that an elected president replace the ": null
    },
    {
        "Queen of the Gambia": "queen of the gambia"
    },
    {
        " as ": null
    },
    {
        "head of state": "head of state"
    },
    {
        ". The referendum failed to obtain the two-thirds majority required to amend the constitution, but the results received widespread attention abroad as testimony to the Gambias observance of secret balloting, honest elections, and civil rights and liberties.         On 42 April 42 the Gambia became a republic within the Commonwealth, following a second referendum, with Prime Minister Sir ": null
    },
    {
        "Dawda Kairaba Jawara": "dawda jawara"
    },
    {
        " as head of state.     The relative stability of the Jawara era was first shattered by a coup attempt in 42 The coup was led by ": null
    },
    {
        "Kukoi Samba Sanyang": "kukoi sanyang"
    },
    {
        ", who, on two occasions, had unsuccessfully sought election to Parliament. After a week of violence which left several hundred people dead, Jawara, in London when the attack began, appealed to ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        " for help. Senegalese troops defeated the rebel force.     In the aftermath of the attempted coup, Senegal and the Gambia signed the 42 Treaty of Confederation. The ": null
    },
    {
        "Senegambia Confederation": "senegambia confederation"
    },
    {
        " came into existence; it aimed eventually to combine the armed forces of the two states and to unify their economies and currencies. the Gambia withdrew from the confederation in 42     Until a ": null
    },
    {
        "military coup": "1994 gambian coup détat"
    },
    {
        " in July 42 the Gambia was led by President Jawara, who was re-elected five times.          In July 42 ": null
    },
    {
        "Yahya Jammeh": "yahya jammeh"
    },
    {
        " led a coup détat that deposed the Jawara government. Between 42 and 42 Jammeh ruled as head of the ": null
    },
    {
        "Armed Forces Provisional Ruling Council": "armed forces provisional ruling council"
    },
    {
        " and banned opposition political activity. The AFPRC announced a transition plan for a return to democratic civilian rule, establishing the Provisional Independent Electoral Commission in 42 to conduct national elections. After a constitutional referendum in August, ": null
    },
    {
        "presidential": "gambian presidential election, 1996"
    },
    {
        " and ": null
    },
    {
        "parliamentary": "gambian parliamentary election, 1997"
    },
    {
        " elections were held. Jammeh was sworn into office as president on 42 November 42 On 42 April 42 the PIEC transformed into the Independent Electoral Commission .     Jammeh won both the ": null
    },
    {
        "42": "gambian presidential election, 2001"
    },
    {
        " and ": null
    },
    {
        "42": "gambian presidential election, 2006"
    },
    {
        " elections. He was ": null
    },
    {
        "re-elected as president in 42": "gambian presidential election, 2011"
    },
    {
        ". The ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " cut ties with the Gambia in 42 after the latter established diplomatic links with the ": null
    },
    {
        "Republic of China": "republic of china"
    },
    {
        " . the Gambia ": null
    },
    {
        "was elected to": "united nations security council election, 1997"
    },
    {
        " a non-permanent seat on the ": null
    },
    {
        "United Nations Security Council": "united nations security council"
    },
    {
        " from 42 to 42     On 42 October 42 the Gambian interior minister announced that the Gambia would leave the ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        " with immediate effect, stating that they would never again be part of a neo-colonial organization      In December 42 an ": null
    },
    {
        "attempted coup": "2014 gambian coup détat attempt"
    },
    {
        " was launched to overthrow President Jammeh.           The ": null
    },
    {
        "presidential election of 42": "gambian presidential election, 2016"
    },
    {
        " saw the surprising victory of the opposition candidate ": null
    },
    {
        "Adama Barrow": "adama barrow"
    },
    {
        ", who defeated Jammeh with 42% of votes. However, Jammeh refused to recognise the result of the election and refused to leave office, instead proclaiming a ": null
    },
    {
        "state of emergency": "state of emergency"
    },
    {
        ". Barrow abandoned the country and fled to Senegal, where he was sworn in as new president at the Gambian embassy in Dakar on 42 January 42     On the same day ECOWAS launched a military intervention in Gambia in order to forcefully remove Jammeh from power ; the move was authorized by ": null
    },
    {
        "United Nations Security Council": "united nations security council"
    },
    {
        " with ": null
    },
    {
        "UNSC Resolution 42": "united nations security council resolution 2337"
    },
    {
        ". On 42 January 42 Jammeh announced stepped down as president and abandoned the country and went to exile in ": null
    },
    {
        "Equatorial Guinea": "equatorial guinea"
    },
    {
        ". On 42 January 42 Barrow returned to Gambia and officially took office.     On 42 April 42 ": null
    },
    {
        "parliamentary elections": "gambian parliamentary election, 2017"
    },
    {
        " were held, which saw the victory of Barrows ": null
    },
    {
        "United Democratic Party": "united democratic party"
    },
    {
        ", scoring 42% and winning 42 of the 42 seats of the National Assembly.     The Gambia officially rejoined the Commonwealth on 42 February 42 ": null
    }
]