[
    {
        "     Solomon Islands": "solomon islands"
    },
    {
        " is a sovereign state in the ": null
    },
    {
        "Melanesia": "melanesia"
    },
    {
        " subregion of ": null
    },
    {
        "Oceania": "oceania"
    },
    {
        " in the western ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        ".   This page is about the history of the nation state rather than the broader geographical area of the ": null
    },
    {
        "Solomon Islands archipelago": "solomon islands"
    },
    {
        ", which covers both Solomon Islands and ": null
    },
    {
        "Bougainville Island": "bougainville island"
    },
    {
        ", a province of ": null
    },
    {
        "Papua New Guinea": "papua new guinea"
    },
    {
        ". For the history of the archipelago not covered here refer to the former administration of the ": null
    },
    {
        "British Solomon Islands Protectorate": "british solomon islands"
    },
    {
        ", the ": null
    },
    {
        "North Solomon Islands": "north solomon islands"
    },
    {
        " and the ": null
    },
    {
        "History of Bougainville": "history of bougainville"
    },
    {
        ".             The human history of Solomon Islands  begins with the first ": null
    },
    {
        "Papuan": "papuan people"
    },
    {
        " settlement at least 30,000 years ago from ": null
    },
    {
        "New Guinea": "new guinea"
    },
    {
        ". They represented the furthest expansion of humans into the ": null
    },
    {
        "Pacific": "pacific ocean"
    },
    {
        " until the expansion of ": null
    },
    {
        "Austronesian-language speakers": "austronesian languages"
    },
    {
        " through the area around 4000 BC, bringing new agricultural and maritime technology. Most of the languages spoken today in Solomon Islands derive from this era, but some thirty languages of the pre-Austronesian settlers survive. Most of the people that settled there back then were ": null
    },
    {
        "Papuans": "papuans"
    },
    {
        " .     There are preserved numerous pre-European cultural monuments in Solomon Islands, notably Bao megalithic shrine complex , Nusa Roviana fortress and shrines , Vonavona Skull island – all in Western province. Nusa Roviana fortress, shrines and surrounding villages served as a hub of regional trade networks in 17th – 19th centuries. Skull shrines of Nusa Roviana are sites of legends. Better known is Tiola shrine – site of legendary stone dog which turned towards the direction where enemy of Roviana was coming from.  This complex of archaeological monuments characterises fast development of local Roviana culture, through trade and head hunting expeditions turning into regional power in 17th – 18th centuries.        Ships of the Spanish explorer ": null
    },
    {
        "Álvaro de Mendaña de Neira": "álvaro de mendaña de neira"
    },
    {
        " first sighted ": null
    },
    {
        "Santa Isabel island": "santa isabel island"
    },
    {
        " on 6 February 1568. Finding signs of alluvial gold on Guadalcanal, Mendaña believed he had found the source of ": null
    },
    {
        "King Solomons": "king solomon"
    },
    {
        "wealth, and consequently named the islands The Islands of Solomon .     In 1595 and 1605 Spain again sent several expeditions to find the islands and establish a colony; however these were unsuccessful. In 1767 Captain ": null
    },
    {
        "Philip Carteret": "philip carteret"
    },
    {
        " rediscovered the ": null
    },
    {
        "Santa Cruz Islands": "santa cruz islands"
    },
    {
        " and ": null
    },
    {
        "Malaita": "malaita"
    },
    {
        ". Later, Dutch, French and British navigators visited the islands; their reception was often hostile.     Museums with significant collections of Solomon Islands artifacts include the ": null
    },
    {
        "Bishop Museum": "bishop museum"
    },
    {
        ", the ": null
    },
    {
        "Peabody Museum of Salem": "peabody museum of salem"
    },
    {
        " and the ": null
    },
    {
        "South Sea Islands Museum": "south sea islands museum"
    },
    {
        ".          ": null
    },
    {
        "Sikaiana": "sikaiana"
    },
    {
        ", then known as the Stewart Islands, was annexed to the Hawaiian Kingdom in 1856. Hawaii did not formalize the annexation, and the United States refused to recognize Hawaiian sovereignty over Sikaiana when the United States annexed Hawaii in 1898.     Missionary activity then started at the mid 19th century and European colonial ambitions led to the establishment of a German Protectorate over the ": null
    },
    {
        "North Solomon Islands": "north solomon islands"
    },
    {
        ", which covered parts of what is now Solomon Islands, following an Anglo-German Treaty of 1886. A ": null
    },
    {
        "British Solomon Islands Protectorate": "british solomon islands"
    },
    {
        " over the southern islands was proclaimed in June 1893. ": null
    },
    {
        "German": "germany"
    },
    {
        " interests were transferred to the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " under the ": null
    },
    {
        "Samoa Tripartite Convention": "samoa tripartite convention"
    },
    {
        " of 1899, in exchange for recognition of the German claim to ": null
    },
    {
        "Western Samoa": "western samoa"
    },
    {
        ".     In 1927 District Commissioner ": null
    },
    {
        "William R. Bell": "william r. bell"
    },
    {
        " was killed on ": null
    },
    {
        "Malaita": "malaita"
    },
    {
        ", along with a cadet named Lillies and 13 Solomon Islanders in his charge. A massive ": null
    },
    {
        "punitive expedition": "punitive expedition"
    },
    {
        ", known as the ": null
    },
    {
        "Malaita massacre": "malaita massacre"
    },
    {
        ", ensued; at least 60 ": null
    },
    {
        "Kwaio": "kwaio"
    },
    {
        " were killed, nearly 200 detained in ": null
    },
    {
        "Tulagi": "tulagi"
    },
    {
        " ,and many sacred sites and objects were destroyed or desecrated. ": null
    },
    {
        "Basiana": "basiana"
    },
    {
        ", who had killed Bell, was hanged publicly on 29 June 1928.             ": null
    },
    {
        "Japan": "japan"
    },
    {
        "ese forces occupied the Solomon Islands in January 1942. The counter-attack was led by the ": null
    },
    {
        "United States": "united states"
    },
    {
        "; the 1st Division of the ": null
    },
    {
        "US Marine Corps": "us marines"
    },
    {
        " landed": "battle of guadalcanal"
    },
    {
        " on ": null
    },
    {
        "Guadalcanal": "guadalcanal"
    },
    {
        " and ": null
    },
    {
        "Tulagi": "tulagi"
    },
    {
        " in August 1942. Some of the most bitter fighting of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " took place on the islands for almost three years.     Tulagi, the seat of the British administration on the island of Nggela Sule in Central Province was destroyed in the heavy fighting following landings by the US Marines. Then the tough battle for Guadalcanal, which was centred on the capture of the airfield, Henderson field, led to the development of the adjacent town of ": null
    },
    {
        "Honiara": "honiara"
    },
    {
        " as the United States logistics centre.       Islanders ": null
    },
    {
        "Biuku Gasa and Eroni Kumana ": "biuku gasa and eroni kumana"
    },
    {
        " were Allies scouts during the war. They became famous when they were noted by ": null
    },
    {
        "National Geographic": "national geographic society"
    },
    {
        " for being the first men to find the shipwrecked ": null
    },
    {
        "John F. Kennedy": "john f. kennedy"
    },
    {
        " and his crew of the ": null
    },
    {
        "PT-109": "motor torpedo boat pt-109"
    },
    {
        " using a traditional ": null
    },
    {
        "dugout canoe": "dugout canoe"
    },
    {
        ". They suggested the idea of using a coconut which was later kept on the desk of the president to write a rescue message for delivery. Their names had not been credited in most movie and historical accounts, and they were turned back before they could visit President Kennedys inauguration, though the Australian coastwatcher would also meet the president. They were visited by a member of the Kennedy family in 2002, where they lived in traditional huts without electricity.       The impact of the war on islanders was profound. The destruction caused by the fighting and the longer-term consequences of the introduction of modern materials, machinery and western cultural artefacts, transformed traditional isolated island ways of life. The reconstruction was slow in the absence of war reparations and with the destruction of the pre-war plantations, formerly the mainstay of the economy. Significantly, Solomon Islanders experience as labourers with the Allies led some to a new appreciation of the importance of economic organisation and trade as the basis for material advancement. Some of these ideas were put into practice in the early post-war political movement ": null
    },
    {
        "Maasina Ruru": "maasina ruru"
    },
    {
        " – often corrupted to Marching Rule .       In 1956 a movement for social economic and political improvement using co-operatives economic enterprises in combination with a regard for custom and tradition to synthesise a new social order called ": null
    },
    {
        "Moro Movement": "moro movement"
    },
    {
        " began on Guadalcanal.     Stability was restored during the 1950s, as the British colonial administration built a network of official local councils. On this platform Solomon Islanders with experience on the local councils started participation in central government, initially through the bureaucracy and then, from 1960, through the newly established Legislative and Executive Councils. Positions on both Councils were initially appointed by the High Commissioner of the British Protectorate but progressively more of the positions were directly elected or appointed by electoral colleges formed by the local councils. The first national election was held in 1964 for the seat of Honiara, and by 1967 the first general election was held for all but one of the 15 representative seats on the Legislative Council .     Elections were held again in 1970 and a new constitution was introduced. The 1970 constitution replaced the Legislative and Executive Councils with a single Governing Council. It also established a committee system of government where all members of the Council sat on one or more of five committees. The aim of this system was to reduce divisions between elected representatives and the colonial bureaucracy, provide opportunities for training new representatives in managing the responsibilities of government.     It was also claimed that this system was more consistent with the Melanesian style of government. However this was quickly undermined by opposition to the 1970 constitution and the committee system by elected members of the council. As a result, a new constitution was introduced in 1974 which established a standard Westminster form of government and gave the Islanders both Chief Ministerial and Cabinet responsibilities. ": null
    },
    {
        "Solomon Mamaloni": "solomon mamaloni"
    },
    {
        " became the countrys first Chief Minister in July 1974.          As late as 1970, the British Protectorate did not envisage independence for Solomon Islands in the foreseeable future. Shortly thereafter, the financial costs of supporting the Protectorate became more trying, as the world economy was hit by the first oil price shock of 1973. The imminent independence of Papua New Guinea was also thought to have influenced the Protectorates administrators.     Outside of a very small educated elite in Honiara, there was little in the way of an indigenous independence movement in the Solomons. Self-government was granted in January 1976 and after July 1976, Sir ": null
    },
    {
        "Peter Kenilorea": "peter kenilorea"
    },
    {
        " became the Chief Minister who would lead the country to independence. Independence was granted on 7 July 1978, and Kenilorea automatically became the countrys first Prime Minister.          Before WWII the provincial capital of Guadalcanal was located at Aola, further down the coast from the present capital, Honiara. That area was then still occupied by the tribal owners of the land. Unfortunately for them Point Cruz had a deep-water harbour and was only a few miles away from the Guadalcanal Plains, where Henderson airfield was built by the Americans during the War. The landowners accepted the need for such military effort based on their land, presuming it would be returned to them afterwards. In the meantime they moved out, over to the Weather Coast on the opposite side of the island, settling in and around an area called Bambanakira.   But they were never compensated. Efforts to resolve this issue as late as 1998 by ": null
    },
    {
        "Ezekiel Alebua": "ezekiel alebua"
    },
    {
        ", then Guadalcanal Premiere, were thwarted and for just a few million dollars . Ethnic bias within the bureaucracy and authorities at the time was well known. As well, in the late 90s suburban development had been accelerating on the outskirts of Honiara, whole suburbs of squatters mainly of Malaitan origin. To exacerbate the problem the police had refused to properly investigate a growing series of violent murders, all of Guadalcanal men in and around Honiara.   In early 1999 long-simmering tensions between the local Gwale people on ": null
    },
    {
        "Guadalcanal": "guadalcanal"
    },
    {
        " and more recent migrants from the neighbouring island of ": null
    },
    {
        "Malaita": "malaita"
    },
    {
        " erupted into violence. The Guadalcanal Revolutionary Army, later called ": null
    },
    {
        "Isatabu Freedom Movement": "isatabu freedom movement"
    },
    {
        " , began terrorising Malaitans in the rural areas of the island to make them leave their homes. About 20,000 Malaitans fled to the capital and others returned to their home island; Gwale residents of Honiara fled. The city became a Malaitan enclave.     Meanwhile, the ": null
    },
    {
        "Malaita Eagle Force": "malaita eagle force"
    },
    {
        " was formed to uphold Malaitan interests. The Government appealed to the Commonwealth Secretary General for assistance. The Honiara Peace Accord was agreed on 28 June 1999. Despite this apparent success the underlying problems remained unresolved and had already resulted in the death or serious injury of 30,000 civilians. The accord soon broke down and fighting broke out again in June 2000.     Malaitans took over some armouries at their home island and ": null
    },
    {
        "Honiara": "honiara"
    },
    {
        " and helped by that, on 5 June 2000 the MEF seized the parliament by force. Through their spokesman ": null
    },
    {
        "Andrew Nori": "andrew nori"
    },
    {
        ", they claimed that the government of the then Prime Minister, ": null
    },
    {
        "Bartholomew Ulufaalu": "bartholomew ulufaalu"
    },
    {
        ", had failed to secure compensation for loss of Malaitan life and property. Ulufa’alu was forced to step down.     On 30 June 2000 Parliament elected by a narrow margin a new Prime Minister, ": null
    },
    {
        "Manasseh Sogavare": "manasseh sogavare"
    },
    {
        ". He established a Coalition for National Unity, Reconciliation and Peace, which released a program of action focused on resolving the ethnic conflict, restoring the economy and distributing the benefits of development more equally. However, Sogavares government was deeply corrupt and its actions led to the downward economic spiral and the deterioration of law and order.     The conflict was foremost about access to land and other resources and was centered on Honiara. Since the beginning of the civil war it is estimated that 100 have been killed. About 30,000 refugees, mainly Malaitans, had to leave their homes, and economic activity on Guadalcanal was severely disrupted.     Continuing civil unrest led to an almost complete breakdown in normal activity: civil servants remained unpaid for months at a time, and cabinet meetings had to be held in secret to prevent local ": null
    },
    {
        "warlords": "warlord"
    },
    {
        "from interfering. The security forces were unable to reassert control, largely because many police and security personnel were associated with one or another of the rival gangs.     In July 2003 the ": null
    },
    {
        "Governor General of Solomon Islands": "governor general of solomon islands"
    },
    {
        " issued an official request for international help, which was subsequently endorsed by a unanimous vote of the parliament. Technically, only the Governor Generals request for troops was necessary. However, the government then passed legislation to provide the international force with greater powers and resolve some legal ambiguities.     On 6 July 2003, in response to a proposal to send 300 police and 2,000 troops from ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ", ": null
    },
    {
        "Fiji": "fiji"
    },
    {
        " and ": null
    },
    {
        "Papua New Guinea": "papua new guinea"
    },
    {
        " to ": null
    },
    {
        "Guadalcanal": "guadalcanal"
    },
    {
        ", warlord ": null
    },
    {
        "Harold Keke": "harold keke"
    },
    {
        " announced a ": null
    },
    {
        "ceasefire": "ceasefire"
    },
    {
        " by faxing a signed copy of the announcement to the Solomons ": null
    },
    {
        "Prime Minister": "prime minister"
    },
    {
        ", Allan Kemakeza. Keke ostensibly leads the ": null
    },
    {
        "Guadalcanal Liberation Front": "guadalcanal liberation front"
    },
    {
        ", but has been described as marauding bandit based on the isolated southwestern coast of Guadalcanal. Despite this ceasefire, on 11 July 2003 the Solomon Islands Broadcasting Corporation broadcast unconfirmed reports that supporters of Harold Keke razed two villages.     In mid-July 2003, the Solomons parliament voted unanimously in favour of the proposed intervention. The international force began gathering at a training facility in ": null
    },
    {
        "Townsville": "townsville"
    },
    {
        ". In August 2003, an international peacekeeping force, known as the ": null
    },
    {
        "Regional Assistance Mission to Solomon Islands": "regional assistance mission to solomon islands"
    },
    {
        " and ": null
    },
    {
        "Operation Helpem Fren": "operation helpem fren"
    },
    {
        ", entered the islands. Australia committed the largest number of security personnel, but with substantial numbers also from other ": null
    },
    {
        "South Pacific Forum": "south pacific forum"
    },
    {
        " countries such as New Zealand, Fiji, and Papua New Guinea . It acts as an interim police force and is responsible for restoring law and order in the country because the Royal Solomon Islands Police force failed to do so for a variety of reasons. Peacekeeping forces have been successful in improving the countrys overall security conditions, including brokering the surrender of a notorious warlord Harold Keke in August 2003.     In 2006, ": null
    },
    {
        "riots": "regional assistance mission to solomon islandsriots following 2006 general election"
    },
    {
        " broke out following the election of ": null
    },
    {
        "Snyder Rini": "snyder rini"
    },
    {
        " as Prime Minister, destroying part of Chinatown and displacing more than 1,000 Chinese residents; the large Pacific Casino Hotel was also totally gutted.  The commercial heart of Honiara was virtually reduced to rubble and ashes. Three ": null
    },
    {
        "National Parliament": "national parliament of the solomon islands"
    },
    {
        " members, ": null
    },
    {
        "Charles Dausabea": "charles dausabea"
    },
    {
        ", ": null
    },
    {
        "Nelson Nee": "nelson nee"
    },
    {
        ", and ": null
    },
    {
        "Patrick Vahoe": "patrick vahoe"
    },
    {
        ",  were arrested during or as a result of the riots. The Regional Assistance Mission to Solomon Islands , the 16-country Pacific Islands Forum initiative set up in 2003 with assistance from Australia, intervened, sending in additional police and army officers to bring the situation under control. A vote of no confidence was passed against the Prime Minister. Following his resignation, a five-party Grand Coalition for Change Government was formed in May 2006, with Manasseh Sogavare as Prime Minister, quelling the riots and running the government. The military part of ": null
    },
    {
        "RAMSI": "regional assistance mission to solomon islands"
    },
    {
        " was withdrawn in 2013 and rebuilding took shape.      In 2009, the government is scheduled to set up a ": null
    },
    {
        "Truth and Reconciliation Commission": "truth and reconciliation commission"
    },
    {
        ", with the assistance of ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        "n Archbishop ": null
    },
    {
        "Desmond Tutu": "desmond tutu"
    },
    {
        ", to address people’s traumatic experiences during the five-year ethnic conflict on Guadalcanal .  , Solomon Times, 4 February 2009     The government continues to face serious problems, including an uncertain economic outlook, ": null
    },
    {
        "deforestation": "deforestation"
    },
    {
        ", and ": null
    },
    {
        "malaria": "malaria"
    },
    {
        " control. At one point, prior to the deployment of RAMSI forces, the country was facing a serious financial crisis. While economic conditions are improving, the situation remains unstable.       In 1992, ": null
    },
    {
        "Cyclone Tia": "cyclone tia"
    },
    {
        " struck the island of ": null
    },
    {
        "Tikopia": "tikopia"
    },
    {
        ", wiping out most housing and food crops.   In 1997, the Government asked for help from the US and Japan to clean up more than 50 sunken World War II ": null
    },
    {
        "shipwrecks": "shipwreck"
    },
    {
        "polluting ": null
    },
    {
        "coral reefs": "coral reef"
    },
    {
        "and killing marine life.     In December 2002, ": null
    },
    {
        "Severe Tropical Cyclone Zoe": "severe tropical cyclone zoe"
    },
    {
        " struck the island of Tikopia and ": null
    },
    {
        "Anuta": "anuta"
    },
    {
        ", cutting off contact with the 3,000 inhabitants. Due to funding problems, the Solomon Islands government could not send relief until the ": null
    },
    {
        "Australia": "australia"
    },
    {
        "n government provided funding.          In April 2014 the islands were struck by the ": null
    },
    {
        "tropical low": "tropical low"
    },
    {
        " that later became Cyclone Ita.     Throughout the Solomons, at least 23  people were killed while up to 40  others remained unaccounted for as of 6 April. An estimated 49,000  people were affected by the floods, of whom 9,000  were left homeless.       As the precursor tropical low to Ita affected the Islands, local authorities issued heavy flood warnings, tropical disturbance and cyclone watches.      Nearly two days of continuous heavy rains from the storm caused ": null
    },
    {
        "flash flood": "flash flood"
    },
    {
        "ing in the Islands. Over a four-day span, more than  fell at the ": null
    },
    {
        "Gold Ridge mine": "gold ridge"
    },
    {
        " in ": null
    },
    {
        "Guadalcanal": "guadalcanal"
    },
    {
        ", with  falling in a 24‑hour span.  The ": null
    },
    {
        "Matanikau River": "matanikau river"
    },
    {
        ", which runs through the capital city ": null
    },
    {
        "Honiara": "honiara"
    },
    {
        ", broke its banks on 3 April and devastated nearby communities. Thousands of homes along with the citys two main bridges were washed away, stranding numerous residents.  The national hospital had to evacuate 500  patients to other facilities due to flooding.  Graham Kenna from ": null
    },
    {
        "Save the Children": "save the children"
    },
    {
        " stated that, the scale of destruction is like something never seen before in the Solomon Islands.  According to Permanent Secretary Melchoir Mataki, the majority of homes destroyed in Honiara were built on a ": null
    },
    {
        "flood plain": "flood plain"
    },
    {
        " where construction was not allowed.     Severe flooding took place on Guadalcanal. Immediately following the floods, Honiara and Guadalcanal were declared disaster areas by the Solomon Government.  Debris left behind by the floods initially hampered relief efforts, with the runway at ": null
    },
    {
        "Honiara International Airport": "honiara international airport"
    },
    {
        " blocked by two destroyed homes. Food supplies started running low as the Red Cross provided aid to the thousands homeless. The airport was reopened on 6 April, allowing for supplies from Australia and New Zealand to be delivered. Roughly 20  percent of Honiaras population relocated to evacuation centers as entire communities were swept away. There were fears that the flooding could worsen an already ongoing ": null
    },
    {
        "dengue fever": "dengue fever"
    },
    {
        " outbreak and cause outbreaks of ": null
    },
    {
        "diarrhea": "diarrhea"
    },
    {
        " and ": null
    },
    {
        "conjunctivitis": "conjunctivitis"
    },
    {
        ".     New Zealand offered an immediate ": null
    },
    {
        "NZ$": "new zealand dollar"
    },
    {
        "300,000 in funds and deployed a ": null
    },
    {
        "C-130 Hercules": "lockheed c-130 hercules"
    },
    {
        " with supplies and emergency response personnel.  Australia donated ": null
    },
    {
        "A$": "australian dollar"
    },
    {
        "250,000 on 6 April and sent engineers and response teams to aid in relief efforts.  On 8 April, Australia increased its aid package to A$3  million while New Zealand provided an additional NZ$1.2  million.  ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " provided US$200,000 in funds. ": null
    }
]