[
    {
        "      The history of Qatar spans from its first duration of human occupation to its formation as a modern state. Human occupation of ": null
    },
    {
        "Qatar": "qatar"
    },
    {
        " dates back to 50,000 years ago, and ": null
    },
    {
        "Stone Age": "stone age"
    },
    {
        " encampments and tools have been unearthed in the peninsula. ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " was the ": null
    },
    {
        "first civilization": "first civilization"
    },
    {
        " to have a presence in the area during the ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " period, evidenced by the discovery of ": null
    },
    {
        "potsherds": "sherd"
    },
    {
        "originating from the ": null
    },
    {
        "Ubaid period": "ubaid period"
    },
    {
        " near coastal encampments.     The peninsula fell under the domain of several different empires during its early years of settlement, including the ": null
    },
    {
        "Seleucid": "seleucid empire"
    },
    {
        ", the ": null
    },
    {
        "Parthians": "parthian empire"
    },
    {
        " and the ": null
    },
    {
        "Sasanians": "sasanian empire"
    },
    {
        ". In 628 AD, the population was ": null
    },
    {
        "introduced": "spread of islam"
    },
    {
        " to ": null
    },
    {
        "Islam": "islam"
    },
    {
        " after ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        " sent an envoy to ": null
    },
    {
        "Munzir ibn Sawa": "munzir ibn sawa al tamimi"
    },
    {
        " who was the Sasanid governor of Eastern Arabia. It became a pearl trading center by the 8th century. The ": null
    },
    {
        "Abbasid": "abbasid caliphate"
    },
    {
        " era saw the rise of several settlements. After the ": null
    },
    {
        "Bani Utbah": "bani utbah"
    },
    {
        " and other Arab tribes conquered ": null
    },
    {
        "Bahrain": "bahrain"
    },
    {
        " in 1783, the ": null
    },
    {
        "Al Khalifa": "house of khalifa"
    },
    {
        " imposed their authority over Bahrain and mainland Qatar. Over the proceeding centuries, Qatar was a site of contention between the Wahhabi of ": null
    },
    {
        "Najd": "najd"
    },
    {
        " and the Al Khalifa. The ": null
    },
    {
        "Ottomans": "ottoman empire"
    },
    {
        " expanded their empire into Eastern Arabia in 1871, withdrawing from the area in 1915 after the beginning of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ".     In 1916, Qatar became a ": null
    },
    {
        "British protectorate": "protectoratebritish protectorates"
    },
    {
        " and ": null
    },
    {
        "Abdullah Al Thani": "abdullah bin jassim al thani"
    },
    {
        " signed a treaty stipulating that he could only cede territory to the British in return for protection from all aggression by sea and support in case of a land attack. A 1934 treaty granted more extensive protection. . ": null
    },
    {
        "U.S. Department of State": "u.s. department of state"
    },
    {
        " . This article incorporates text from this source, which is in the public domain . In 1935, a 75-year ": null
    },
    {
        "oil": "petroleum"
    },
    {
        " concession was granted to the ": null
    },
    {
        "Qatar Petroleum Company": "qatar petroleum"
    },
    {
        " and high-quality oil was discovered in 1940 in ": null
    },
    {
        "Dukhan": "dukhan"
    },
    {
        ".     During the 1950s and 1960s, increasing oil revenues brought prosperity, rapid ": null
    },
    {
        "immigration": "immigration"
    },
    {
        ", substantial ": null
    },
    {
        "social progress": "social progress"
    },
    {
        ", and the beginnings of the countrys modern history. After Britain announced a policy of ending the treaty relationships with the Persian Gulf ": null
    },
    {
        "sheikdoms": "sheikdom"
    },
    {
        "in 1968, Qatar joined the other eight states then under British protection in a plan to form a federation of Arab emirates. By mid-1971, as the termination date of the British treaty relationship approached, the nine still had not agreed on terms of union. Accordingly, Qatar declared its independence on September 3, 1971. In June 1995, deputy emir ": null
    },
    {
        "Hamad bin Khalifa": "hamad bin khalifa al thani"
    },
    {
        " became the new emir after his father ": null
    },
    {
        "Khalifa bin Hamad": "khalifa bin hamad al thani"
    },
    {
        " in a bloodless coup. The emir permitted more liberal press and municipal elections as a precursor to parliamentary elections. A new constitution was approved via public referendum in April 2003 and came into effect in June 2005.              Archaeological evidence has dated human occupation in the ": null
    },
    {
        "Qatar Peninsula": "qatar peninsula"
    },
    {
        " to 50,000 years in the past, when small groups of ": null
    },
    {
        "Stone Age": "stone age"
    },
    {
        " inhabitants built seasonal encampments and sites for working ": null
    },
    {
        "flint": "flint"
    },
    {
        ". At this time, the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        " was a dry river valley . The modern-day territory of Qatar was not peninsular and did not contain any ": null
    },
    {
        "relief": "terrainrelief"
    },
    {
        ", but was instead a part of the contiguous landmass stretching from ": null
    },
    {
        "Arabia": "arabian peninsula"
    },
    {
        " to the ": null
    },
    {
        "Iranian Plateau": "iranian plateau"
    },
    {
        ". As a result, it was probably only used as a winter grazing zone for hunter-gatherers who favored the more fertile land of the Persian Gulf valley.      In 1961, a Danish archaeological expedition carried out on the peninsula uncovered approximately 30,000 stone implements from 122 paleolithic sites. Most of the sites were situated along the coastline, and were divided into four separate cultural groups based on flint typology. Macrolithic tools such as ": null
    },
    {
        "scraper": "scraper"
    },
    {
        "s, ": null
    },
    {
        "arrowheads": "arrowheads"
    },
    {
        " and ": null
    },
    {
        "hand axes": "hand axe"
    },
    {
        "dating to the ": null
    },
    {
        "lower": "lower paleolithic"
    },
    {
        " and ": null
    },
    {
        "middle paleolithic": "middle paleolithic"
    },
    {
        " periods were among the discoveries.      The ": null
    },
    {
        "flooding of the Persian Gulf": "holocene glacial retreatpersian gulf"
    },
    {
        ", which occurred roughly 8,000 years ago,  resulted in the displacement of Persian Gulf inhabitants, the formation of the Qatari Peninsula and the occupation of Qatar to capitalize on its coastal resources. From this time onward, Qatar was regularly used as rangeland for nomadic tribes from the ": null
    },
    {
        "Najd": "najd"
    },
    {
        " and ": null
    },
    {
        "Al Hasa": "al hasa"
    },
    {
        " regions in ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        ", and a number of seasonal encampments were constructed around sources of water.       The earliest ": null
    },
    {
        "settlements": "human settlement"
    },
    {
        " on the peninsula are dated to the ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " period. Abdul Nayeem . p. 116. A site on the northwest coast called ": null
    },
    {
        "Wadi Debayan": "wadi debayan"
    },
    {
        " is one of the oldest known settlements in Qatar. Marine life remains, plant material and structural components were among the artifacts excavated. Carbon dating of organic remains revealed human habitation dating back to 7,500 years in the past. Fragments of pottery originating from the early ": null
    },
    {
        "Ubaid period": "ubaid period"
    },
    {
        "  were also recovered.  One of the earliest settlements found in the southern portion of Qatar is known as ": null
    },
    {
        "Shagra": "shagra"
    },
    {
        " and dates back to 6000 BC. A two-room structure, flints and remnants of fish and molluscs were found at the site.      Pottery originating from the later Ubaid period were uncovered in the peninsula in three separate expeditions during the 1970s and 1980s. ": null
    },
    {
        "Microprobe": "microprobe"
    },
    {
        " analyses carried out on the potsherds deduced that they originated from the southern region of Mesopotamia.  Owing to the fact that the Qatari Peninsula would not have accommodated the necessary conditions for a pottery-making civilization to flourish, it has been hypothesized that the pottery was produced in ": null
    },
    {
        "Ur": "ur"
    },
    {
        " and traded down the Persian Gulf settlements.  As there is a distinct absence of pottery in overland routes, it is believed that trading was primarily facilitated by sea routes.      ": null
    },
    {
        "Al Daasa": "al daasa"
    },
    {
        ", a settlement located on the northeast coast of Qatar, is the most extensive Ubaid site in the country. It was excavated by a Danish team in 1961.  The site is theorized to have accommodated a small seasonal encampment, possibly a lodging for a hunting-fishing-gathering group who made recurrent visits. This is evidenced by the discovery of nearly sixty fire pits at the site, which may have been used to cure and dry fish, in addition to flint tools such as scrapers, cutters, blades and arrow heads. Furthermore, many painted Ubaid potsherds and a ": null
    },
    {
        "carnelian": "carnelian"
    },
    {
        " bead were found in the fire pits, suggesting overseas connections.      In an excavation done in ": null
    },
    {
        "Al Khor": "al khor"
    },
    {
        " in 1977–78, several Ubaid-period graves were uncovered in what is considered the earliest recorded burial site in the country.  One grave contained the cremated remains of a young woman with no grave goods. Eight other graves contained grave goods, including beads made of shell, carnelian and obsidian. The obsidian most likely originated from ": null
    },
    {
        "Najran": "najran"
    },
    {
        " in south west Arabia.   235             The Qatari Peninsula was close enough to the ": null
    },
    {
        "Dilmun": "dilmun"
    },
    {
        " civilization in ": null
    },
    {
        "Bahrain": "bahrain"
    },
    {
        " to have felt its influence. Toth, Anthony. Qatar: Historical Background.  . ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " Federal Research Division": "federal research division"
    },
    {
        " . This article incorporates text from this source, which is in the public domain . Barbar pottery was excavated in two sites by the Qatar Archaeology Project, evidencing the countrys involvement in Dilmuns trade network. When the people of Dilmun began engaging in maritime activities around 2100 to 1700 BC, the inhabitants of Qatar started diving for pearls in the Persian Gulf.  The Qataris were engaged in the trading of pearls and ": null
    },
    {
        "date palms": "date palm"
    },
    {
        "during this era. Mohamed Althani, p. 15     It has been argued that the remains of Dilmun settlements found in Qatar do not represent major evidence of long-term human habitation. Qatar remained largely uninhabited during this period due to regular migration by nomadic Arab tribes searching for untapped sources food and water.  The settlements dating to the Dilmun period, particularly in ": null
    },
    {
        "Al Khor Island": "al khor island"
    },
    {
        ", may have been established to expedite trade journeys between Bahrain to the closest significant settlement in the Persian Gulf, ": null
    },
    {
        "Tell Abraq": "tell abraq"
    },
    {
        ". Another scenario entails that the encampments were created by visiting fishermen or ": null
    },
    {
        "pearl fishers": "pearl hunting"
    },
    {
        " from Dilmun. It has also been suggested that the presence of pottery is indicative of trade between the inhabitants of Qatar and the Dilmun civilization, though this is considered unlikely due to the scarce population of the peninsula during this period.      ": null
    },
    {
        "Kassite": "kassites"
    },
    {
        " Babylonia": "babylonia"
    },
    {
        "n-influenced materials dating back to the second millennium BC, which were found in ": null
    },
    {
        "Al Khor Island": "al khor island"
    },
    {
        ", reveal evidence of trade relations between the inhabitants of Qatar and the Kassite.  Among the findings were 3,000,000 crushed snail shells and Kassite potsherds. It has been asserted that Qatar was the site of the earliest known production of shellfish dye owing to a purple dye industry operated by the Kassite which existed on the island.  The dye was obtained from the ": null
    },
    {
        "Murex": "hexaplex trunculus"
    },
    {
        " snail and was known as ": null
    },
    {
        "Tyrian purple": "tyrian purple"
    },
    {
        " . Dye production may have been supervised by the Kassite administration in Bahrain with the purpose of exporting the dye to ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        ". Carter, Killick . p. 45.                 ": null
    },
    {
        "Assyria": "assyria"
    },
    {
        "n king ": null
    },
    {
        "Esarhaddon": "esarhaddon"
    },
    {
        " led a successful campaign against Bazu,  an area which encompassed Dilmun and Qatar,  in c. 680 BC. To date, no archaeological evidence of early Iron Age settlements have been discovered in the Peninsula.  This is likely due to adverse climatic changes rendering Qatar less inhabitable during this period.      In the 5th century BC, Greek historian ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        " published the earliest known description of the population of Qatar, describing its inhabitants as sea-faring ": null
    },
    {
        "Canaan": "canaan"
    },
    {
        "ites.           Around 325 BC, ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " sent his top admiral, ": null
    },
    {
        "Androsthenes of Thasos": "androsthenes of thasos"
    },
    {
        ", to survey the entire Persian Gulf. The requested charts arrived shortly after Alexander died in 323.  ": null
    },
    {
        "Seleucus I Nicator": "seleucus i nicator"
    },
    {
        " was awarded the eastern part of the Ancient Greek Empire after Alexanders death. Starting from 312, he expanded the ": null
    },
    {
        "Seleucid Empire": "seleucid empire"
    },
    {
        " eastward of Babylon, purportedly encompassing parts of Eastern Arabia.  Archaeological evidence of Greek-influenced materials has been discovered in Qatar. Excavations north of ": null
    },
    {
        "Dukhan": "dukhan"
    },
    {
        " uncovered potsherds of Selucid characteristic, and a cairnfield consisting of 100 burial mounds dating to the era was discovered in ": null
    },
    {
        "Ras Abrouq": "ras abrouq"
    },
    {
        ".  The relatively large number of cairns suggest a sizable sea-faring community prevailed in the area.      After losing most of their territories in the Persian Gulf, Seleucid influence ceased in the area by c. 250 BC.                 Following the eviction of the Seleucid by the ": null
    },
    {
        "Parthian Empire": "parthian empire"
    },
    {
        " in c. 250 BC, the latter gained dominion over the Persian Gulf and Arabian Coast.  As the Parthians were dependent on trade routes through the Persian Gulf, they established garrisons along the coast. Pottery recovered from expeditions in Qatar has demonstrated links to the Parthian Empire.      Ras Abrouq, a coastal city north of ": null
    },
    {
        "Dukhan": "dukhan"
    },
    {
        ", housed a fishing station which foreign vessels used to dry fish in 140 BC.  A number of stone structures and large quantities of fish bones were recovered from the site.     ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        ", a Roman author, wrote an account on the inhabitants of the peninsula around the mid-first century AD. He referred to them as the Catharrei and described them as nomads who constantly roamed in search of water and food. Around the second century, ": null
    },
    {
        "Ptolemy": "ptolemy"
    },
    {
        " produced the first known map to depict the landmass, referring to it as Catura .      In 224 AD, the ": null
    },
    {
        "Sasanian Empire": "sasanian empire"
    },
    {
        " gained control over the territories surrounding the Persian Gulf. Qatar played a role in the commercial activity of the Sasanids, contributing to at least two commodities: precious pearls and purple dye.  Sasanid pottery and glassware were found in Mezruah, a city north-west of ": null
    },
    {
        "Doha": "doha"
    },
    {
        ", and fragments of glassware and pottery were discovered in a settlement in Umm al-Maa.     Under the Sasanid reign, many of the inhabitants in Eastern Arabia were introduced to Christianity after the religion was dispersed eastward by Mesopotamian Christians.  Monasteries were constructed in Qatar during this era,  and further settlements were founded. During the latter part of the Christian era, Qatar was known by the ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " name Beth Qatraye .  A variant of this was Beth Catara.  The region was not limited to Qatar; it also included ": null
    },
    {
        "Bahrain": "bahrain"
    },
    {
        ", ": null
    },
    {
        "Tarout Island": "tarout island"
    },
    {
        ", Al-Khatt, and ": null
    },
    {
        "Al-Hasa": "al-hasa"
    },
    {
        ".  The dioceses of Beth Qatraye did not form an ": null
    },
    {
        "ecclesiastical province": "ecclesiastical province"
    },
    {
        ", except for a short period during the mid-to-late seventh century. They were instead subject to the Metropolitan of ": null
    },
    {
        "Fars": "fars"
    },
    {
        ".      ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        " sent ": null
    },
    {
        "Al-Alaa Al-Hadrami": "al-alaa al-hadrami"
    },
    {
        ", a Muslim envoy, to a Persian ruler in Eastern Arabia named ": null
    },
    {
        "Munzir ibn Sawa Al Tamimi": "munzir ibn sawa al tamimi"
    },
    {
        " in 628 and requested that he and his people accept Islam. Munzir obliged his request and most Arab tribes in Qatar converted to Islam.  It has been proposed by historian Habibur Rahman that Munzir ibn Sawas seat of administration existed in the ": null
    },
    {
        "Murwab": "murwab"
    },
    {
        " or Umm al-Maa area of Qatar. This theory is lent credence by an archaeological find of approximately 100 small stone-built Islamic-period houses and fortified palaces of a tribal leader in Murwab, which are thought to have originated from the early Islamic period. After the adoption of Islam, the Arabs led the ": null
    },
    {
        "Muslim conquest of Persia": "muslim conquest of persia"
    },
    {
        " which resulted in the fall of the Sasanian Empire.      It is likely that some settled populations in Qatar did not immediately convert to Islam. ": null
    },
    {
        "Isaac of Nineveh": "isaac of nineveh"
    },
    {
        ", a 7th-century ": null
    },
    {
        "Syriac Christian": "syriac christianity"
    },
    {
        " bishop regarded as a ": null
    },
    {
        "saint": "saint"
    },
    {
        " in some churches, was born in Beth Qatraye.  Other notable Christian scholars dating to this period who hailed from Beth Qatraye include ": null
    },
    {
        "Dadisho Qatraya": ":fr:dadicho qatraya"
    },
    {
        ", ": null
    },
    {
        "Gabriel of Qatar": ":de:gabriel von qatar"
    },
    {
        " and Ahob of Qatar. In 674, the bishops of Beth Qatraye stopped attending synods.                 Qatar was described as a famous horse and camel breeding centre during the ": null
    },
    {
        "Umayyad": "umayyad caliphate"
    },
    {
        " period.  It began benefiting from its commercially strategic position in the Persian Gulf during the 8th century,  going on to become a center of pearl trading.      During the ": null
    },
    {
        "Second Fitna": "second fitna"
    },
    {
        ", a renowned ": null
    },
    {
        "Khariji": "khawarij"
    },
    {
        " commander named ": null
    },
    {
        "Qatari ibn al-Fujaa": "qatari ibn al-fujaa"
    },
    {
        ", who was described as the most popular, admired and powerful Khariji leader,  led the Azariqa, a sub-sect of the Khawarij, in to numerous battles.  He held the title of ": null
    },
    {
        "Amir al-Muminin": "amir al-muminin"
    },
    {
        " and ruled over the radical Azariqa movement for more than 10 years.  Born in ": null
    },
    {
        "Al Khuwayr": "al khuwayr"
    },
    {
        " in Qatar,  he also minted the first known Kharjite coins, the earliest of which dated to 688 or 689.     The Umayyad Caliphate brought about much political and religious change in western Asia starting from the late seventh century.  As a result, there were many revolts against the Umayyad at the end of the seventh century, particularly in Qatar and Bahrain. Ibn al-Fujaa led an uprising against the Umayyad caliphs for more than twenty years.     In 750, discontent in the caliphate had reached a critical level due to the treatment of non-Arab citizens in the Empire. The ": null
    },
    {
        "Abbasid Revolution": "abbasid revolution"
    },
    {
        " resulted in the overthrow of the Umayyad Caliphate, ushering in the ": null
    },
    {
        "Abbasid": "abbasid caliphate"
    },
    {
        " period. Paul Rivlin, , p. 86. Cambridge: Cambridge University Press, 2009.              Several settlements, including ": null
    },
    {
        "Murwab": "murwab"
    },
    {
        ", were developed during the ": null
    },
    {
        "Abbasid": "abbasid caliphate"
    },
    {
        " period. Over 100 stone-built houses, two mosques, and an Abbasid fort were constructed in Murwab during this era.  Murwab fort is the oldest intact fort in the country and was built over the ruins of a previous fort which was destroyed by fire. The town was the site of the first sizable settlement established off the coastal area of Qatar. A similar site, containing ": null
    },
    {
        "Tang": "tang dynasty"
    },
    {
        " stoneware and dating to the 9th and 10th centuries, was discovered in Al Naman .        Substantial development in the pearling industry around the Qatari Peninsula occurred during the Abbasid era. Ships from ": null
    },
    {
        "Basra": "basra"
    },
    {
        " en route to ": null
    },
    {
        "India": "india"
    },
    {
        " and ": null
    },
    {
        "China": "china"
    },
    {
        " would make stops in the port of Qatar during this period. Chinese porcelain, West African coins and pieces from Thailand have been discovered in Qatar. Archaeological remains from the 9th century suggest that Qatars inhabitants used greater wealth, perhaps from pearl trade, to construct higher quality homes and public buildings. However, when the caliphates prosperity declined in Iraq, so too did it in Qatar.      Most of Eastern Arabia, particularly Bahrain and the Qatari Peninsula, were sites of revolt against the Abbasid Caliphate around 868. Mohamed Althani, p. 17 Mohammed ibn Ali, a revolutionary, roused the people of Bahrain and Qatar into a rebellion, but the rebellion was unsuccessful and he relocated to Basra. He was later successful in instigating the ": null
    },
    {
        "Zanj Rebellion": "zanj rebellion"
    },
    {
        ". Al-Tabari, Abu Jafar Muhammad ibn Jarir. The History of al-Tabari, Volume XXXVI: The Revolt of the Zanj. Trans. David Waines. Ed. Ehsan Yar-Shater. Albany, NY: State University of New York Press, 1992. . p. 31     A radical ": null
    },
    {
        "Ismaili": "ismailism"
    },
    {
        " group called the ": null
    },
    {
        "Qarmatians": "qarmatians"
    },
    {
        " established a utopian republic in Eastern Arabia in 899.  They considered the pilgrimage to ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        " a superstition and once in control of the Bahraini state they launched raids along the pilgrim routes crossing the ": null
    },
    {
        "Arabian Peninsula": "arabian peninsula"
    },
    {
        ". In 906 they ambushed the pilgrim caravan returning from Mecca and massacred 20,000 pilgrims.      Qatar is mentioned in 13th-century Muslim scholar ": null
    },
    {
        "Yaqut al-Hamawis": "yaqut al-hamawi"
    },
    {
        "book,  Mujam Al-Buldan , which alludes to the Qataris fine striped woven cloaks and their skills in improvement and finishing of spears, known as khattiyah spears.  The spears acquired their name as an homage to the region of Al-Khatt which encompassed present-day ": null
    },
    {
        "Qatif": "qatif"
    },
    {
        ", ": null
    },
    {
        "Uqair": "uqair"
    },
    {
        " and Qatar.               Much of Eastern Arabia was controlled by the ": null
    },
    {
        "Usfurids": "usfurids"
    },
    {
        " in 1253, but control of the region was later seized by the prince of ": null
    },
    {
        "Ormus": "ormus"
    },
    {
        " in 1320.  Qatars pearls provided the kingdom with one of its main sources of income. The Portuguese defeated the Ormus by 1507 following the destruction of their fleet by ": null
    },
    {
        "Afonso de Albuquerques": "afonso de albuquerque"
    },
    {
        "forces. However, Albuquerques captains grew rebellious and he was compelled to abandon the Ormus island. Ultimately, in 1515, ": null
    },
    {
        "King Manuel I": "manuel i of portugal"
    },
    {
        " killed Sultan Saifuddins ": null
    },
    {
        "vizier": "vizier"
    },
    {
        " Reis Hamed, pressuring the sultan to become a vassal of King Manuel.              Bahrain and mainland Qatar had been seized by the Portuguese in 1521.  After the Portuguese claimed control, they constructed a series of fortresses along the Arabian Coast. However, there have been no significant Portuguese ruins found in Qatar. The Portuguese focused on creating a commercial empire in Eastern Arabia, and exported gold, silver, silks, cloves, amber, horses and pearls.  The population of ": null
    },
    {
        "Al-Hasa": "al-hasa"
    },
    {
        " submitted voluntarily to the rule of the ": null
    },
    {
        "Ottomans": "ottoman empire"
    },
    {
        " in 1550, preferring them to the Portuguese.      After the Portuguese were expelled from the area in 1602  by the Dutch and British,  the Ottomans saw little need to maintain a military presence in the Al-Hasa region. As a result, the Ottomans were expelled by the ": null
    },
    {
        "Bani Khalid": "bani khalid"
    },
    {
        " in 1670.         The ": null
    },
    {
        "Al Bin Ali": "al bin ali"
    },
    {
        " Tribe are the original descendants of Bani Utbah tribe being that they are the only tribe to carry and nurture the last name Al-Utbi in their Ownerships documents of Palm gardens in Bahrain as early as the year 1699 - 1111 Hijri. Ownerships Document of a Palm Garden in Island of Sitra, Bahrain belonging to Shaikh Salama Bin Saif in which the owner carries the Al-Utbi last name dated 1699 - 1111 Hijri,  ,  , see also Ownerships Document of a Palm Garden in Island of Nabih Saleh, Bahrain belonging to Shaikh Mohamed Bin Derbas in which the owner carries the Al-Utbi last name dated 1804 - 1219 Hijri,  ,  ,  , also in the Precis Of Turkish Expansion On The Arab Littoral Of The Persian Gulf And Hasa And Katif Affairs. By J. A. Saldana; 1904, I.o. R R/15/1/724, assertion by British Foreign Secretary Of State in 1871 that Isa Bin Tarif belongs to the Original Uttoobees who conquered Bahrain, which means that he differentiates the Original Uttoobees whose descendants are the Al Bin Ali since they are the oldest tribe who officially carried the Al-Utbi last name in their ownerships documents, from the Uttoobees who entered under its umbrella such as the Al-Khalifa and Al-Sabah and other families They are specifically descendants of their great grand father Ali Al-Utbi who is a descendant of their great grand father Utbah hence the name Bani Utbah which means sons of Utbah. Utbah is the great grandfather of the Bani Utbah which is a section of Khafaf from Bani Sulaim bin Mansoor from Mudhar from Adnan. The plural word for Al-Utbi is Utub and the name of the tribe is Bani Utbah.          Having expelled the Ottomans, the Bani Khalid held jurisdiction over Qatar from 1670 onward.  In 1766,  the ": null
    },
    {
        "Utub": "utub"
    },
    {
        " clans of ": null
    },
    {
        "Al Jalahma": "al jalahma"
    },
    {
        " and ": null
    },
    {
        "Al Khalifa": "house of khalifa"
    },
    {
        " migrated from ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " to ": null
    },
    {
        "Zubarah": "zubarah"
    },
    {
        " in Qatar. Gazetteer of the Persian Gulf. Vol I. Historical. Part IA & IB. J G Lorimer. 1915 , p. 1001 By the time of their arrival in Zubarah, the Bani Khalid exercised weak power over Qatar, though the largest village was ruled by distant kin of the Bani Khalid.  After the Persian Occupation of ": null
    },
    {
        "Basra": "basra"
    },
    {
        " in 1777 many merchants and families moved from ": null
    },
    {
        "Basra": "basra"
    },
    {
        " and Kuwait to Zubarah. The town became a thriving center of trade and pearling in the Persian Gulf region after this movement.      The Al Khalifa claimed Qatar and Bahrain by 1783, whereas Bani Khalid control of neighboring Al-Hasa officially came to an end in 1795.              Following Persian aggression towards Zubarah, the Utub and other Arab tribes drove out the Persians from Bahrain in 1783.  Al Jalahma seceded from the ": null
    },
    {
        "Utub": "utub"
    },
    {
        " alliance sometime before the Utub annexed ": null
    },
    {
        "Bahrain": "bahrain"
    },
    {
        " in 1783 and returned to Zubarah. This left the Al Khalifa tribe in undisputed possession of Bahrain,  who then transferred their power base from Zubarah to ": null
    },
    {
        "Manama": "manama"
    },
    {
        ". They continued to exert authority over the mainland, and paid tribute to the ": null
    },
    {
        "Wahhabi": "wahhabism"
    },
    {
        " to ward off challenges on Qatar. However, Qatar did not develop a centralized authority because the Al Khalifa oriented their focus towards Bahrain. As a result, Qatar went through many periods of transitory sheikhs, with the most notable being ": null
    },
    {
        "Rahmah ibn Jabir al-Jalahimah": "rahmah ibn jabir al-jalahimah"
    },
    {
        ". By 1790, Zubarah was described as a safe heaven for merchants who enjoyed complete protection and no customs duties.         The town came under threat by the ": null
    },
    {
        "Wahhabi": "wahhabism"
    },
    {
        " from 1780 onward due to the intermittent raids launched on the Bani Khalid strongholds in ": null
    },
    {
        "Al-Hasa": "al-hasa"
    },
    {
        ".  The Wahhabi speculated that the population of Zubarah would conspire against their regime with the help of the Bani Khalid. They also believed that its residents practiced teachings contrary to the Wahhabi doctrine, and regarded the town as an important gateway to the Persian Gulf.  Saudi general Sulaiman ibn Ufaysan led a raid against the town in 1787. Five years later, a massive Wahhabi force conquered Al Hasa, forcing many refugees to flee to Zubarah.  Wahhabi forces besieged Zubarah and several neighboring settlements in 1794 later as punishment for accommodating asylum seekers. The local chieftains were allowed to continue carrying out administrative tasks but were required to pay a tax.      After defeating the Bani Khalid in 1795, the Wahhabi were attacked on two fronts. The Ottomans and ": null
    },
    {
        "Egyptians": "egyptian–wahhabi war"
    },
    {
        " assaulted the western front, while the Al Khalifa in Bahrain and the Omanis launched an attack against the eastern front.   The Wahhabi allied themselves with the Al Jalahmah tribe in Qatar, who proceeded to engage the Al Khalifa and Omanis on the eastern frontier.     Upon being made aware of advancements by the Egyptians on the western frontier, in 1811, the Wahhabi amir reduced his garrisons in Bahrain and Zubarah in order to re-position his troops. ": null
    },
    {
        "Said bin Sultan": "said bin sultan, sultan of muscat and oman"
    },
    {
        " of Muscat capitalized on this opportunity and attacked the Wahhabi garrisons in Bahrain and Zubarah. The fort in Zubarah was set ablaze and the Al Khalifa were effectively returned to power.                Britains desire for secure passage for ": null
    },
    {
        "East India Company": "east india company"
    },
    {
        " ships led it to impose its own order in the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ". An agreement known as the ": null
    },
    {
        "General Maritime Treaty": "general maritime treaty of 1820"
    },
    {
        " was signed between the East India Company and the sheikhs of the coastal area  in 1820. It acknowledged British authority in the Persian Gulf and sought to end piracy and the slave trade. Bahrain became a party to the treaty, and it was assumed that Qatar, as a dependency, was also a party to it.     A report compiled by Major Colebrook in 1820 gives the first descriptions of the major towns in Qatar. All of the coastal cities mentioned in his report were situated near the Persian Gulf pearl banks and had been practicing pearl fishing for millenniums.  Until the late eighteenth century, all of the principal towns of Qatar including Al Huwaila, ": null
    },
    {
        "Fuwayrit": "fuwayrit"
    },
    {
        ", ": null
    },
    {
        "Al Bidda": "al bidda"
    },
    {
        " and Doha were situated on the east coast. Doha developed around the largest of these, Al Bidda. The population consisted of nomadic and settled ": null
    },
    {
        "Arabs": "arab"
    },
    {
        "and a significant proportion of ": null
    },
    {
        "slaves brought from East Africa": "african slave trade"
    },
    {
        ". As punishment for piracy committed by the inhabitants of ": null
    },
    {
        "Doha": "doha"
    },
    {
        ", an ": null
    },
    {
        "East India Company": "east india company"
    },
    {
        " vessel bombarded the town in 1821. They razed the town, forcing between 300 and 400 natives to flee.      A survey carried out by the British in 1825 notes that Qatar did not have a central authority and was governed by local sheikhs.  Doha was ruled by the ": null
    },
    {
        "Al-Buainain": "al-buainain"
    },
    {
        " tribe. In 1828, a member of the Al-Buainain murdered a native of Bahrain, prompting the Bahraini sheikh to imprison the offender. The Al-Buainain tribe revolted, provoking the Al Khalifa to destroy their fort and expel them from Doha. The expulsion of the Al-Buainain granted the Al Khalifa more jurisdiction over Doha.           Desiring to keep surveillance over the proceedings of the ": null
    },
    {
        "Wahhabi": "wahhabi"
    },
    {
        ", Bahrain stationed a government official named ": null
    },
    {
        "Abdullah bin Ahmad Al-Khalifa": "house of khalifa"
    },
    {
        " on the coast of Qatar as early as 1833. Turning against the Bahrainis, he instigated the people of Al Huwailah to revolt against the Al Khalifa and open up a correspondence with the Wahhabi in 1835. Shortly after the revolt, a peace agreement was signed by both parties under the mediation of the son of the ": null
    },
    {
        "Sultan of Muscat": "said bin sultan, sultan of muscat and oman"
    },
    {
        ". As part of the stipulations, Al Huwailah was demolished and its residents were removed to Bahrain. Nephews of Abdullah bin Ahmed almost immediately violated the agreement when they incited members of the ": null
    },
    {
        "Al Kuwari": "al kuwari"
    },
    {
        " tribe to attack Al Huwailah, however.      Residents of the peninsula were susceptible to skirmishes between the forces of the sheikh of Bahrain and the Egyptian military commander of ": null
    },
    {
        "Al-Hasa": "al-hasa"
    },
    {
        ". At the end of 1839 or beginning of 1840, the governor of Al-Hasa dispatched troops to lay waste to Qatar following the refusal of the ": null
    },
    {
        "Al Nuaim": "al nuaim"
    },
    {
        " tribe of Zubarah to pay the demanded ": null
    },
    {
        "tribute": "tribute"
    },
    {
        ". The assassination of a governor in ": null
    },
    {
        "Hofuf": "hofuf"
    },
    {
        " prematurely ended the expedition before the forces could reach the country.     In 1847, Abdullah bin Ahmed Al Khalifa and a Qatari chief named ": null
    },
    {
        "Isa bin Tarif": "isa bin tarif"
    },
    {
        " formed a coalition against ": null
    },
    {
        "Mohammed bin Khalifa": "house of khalifa"
    },
    {
        ", the ruler of Bahrain. In November, bin Khalifa landed in ": null
    },
    {
        "Al Khor": "al khor"
    },
    {
        " with 500 troops and military support from the governors of ": null
    },
    {
        "Qatif": "qatif"
    },
    {
        " and Al-Hasa. The opposition forces numbered 600 troops and were led by bin Tarif. On 17 November, a decisive battle, which came to be known as the ": null
    },
    {
        "Battle of Fuwayrit": "fuwayritbattle of fuwayrit"
    },
    {
        ", took place between the coalition forces and the Bahraini forces. The coalition forces were defeated after bin Tarif and eighty of his men were killed.  After he defeated the resistance troop, bin Khalifa demolished ": null
    },
    {
        "Al Bidda": "al bidda"
    },
    {
        " and moved its inhabitants to Bahrain. He sent his brother, Ali bin Khalifa, as an envoy to Al Bidda. However, he did not exercise any administrative powers, and local tribal leaders remained responsible for the internal affairs of Qatar.      After having concocted a plan to invade Bahrain, the Wahhabi amir ": null
    },
    {
        "Faisal bin Turki": "faisal bin turki bin abdullah al saud"
    },
    {
        " left his headquarters in ": null
    },
    {
        "Najd": "najd"
    },
    {
        " with a platoon of troops in February 1851. Several offers of appeasement were made on behalf of Mohammed bin Khalifa, but these were met with rejection by Faisal. In anticipation of the impending invasion, Ali bin Khalifa moved to enlist military support in Qatar, but ": null
    },
    {
        "Mohammed bin Thani": "mohammed bin thani"
    },
    {
        " was persuaded to grant support to Faisals forces when they reached Al Bidda in May.  On June 8, forces loyal to Al Thani took possession of an important tower situated close to Ali bin Khalifas residence in the Al Bidda Fort. This prompted Bahrain to initiate negotiations for a protective treaty with the British in an attempt to thwart Faisals advances. They were initially unsuccessful in doing so, but the British reconsidered their position after receiving an intelligence report on the conflict and hastily situated a naval blockade in ": null
    },
    {
        "Manama": "manama"
    },
    {
        ". Accompanying a peace treaty on 25 July 1851, the sheikh of Bahrain agreed to pay a fee of 4,000 German ": null
    },
    {
        "krones": "austro-hungarian krone"
    },
    {
        " in return for the restoration of the Bahraini-occupied Al Bidda Fort and the disassociation of the Wahhabi from the inhabitants of Qatar.             In a move which angered Mohammed bin Khalifa, Faisal bin Turki provided a safe haven for Abdullah bin Ahmeds sons in ": null
    },
    {
        "Dammam": "dammam"
    },
    {
        " in 1852. Consequently, the Bahrainis attempted to drive away residents of Al Bidda and Doha who were suspected of being loyal to the Wahhabi by imposing an economic ": null
    },
    {
        "blockade": "blockade"
    },
    {
        " on the inhabitants which prevented them from engaging in ": null
    },
    {
        "pearl hunting": "pearl hunting"
    },
    {
        ". The blockade continued until the end of the year.  In February 1853, the Wahhabi began marching from ": null
    },
    {
        "Al-Hasa": "al-hasa"
    },
    {
        " to Al Khor. After Bahrain received assurance from the Qatar that they would not cooperate with the Wahhabi forces if they crossed into their borders, they sent Ali bin Khalifa to the mainland to act as a collaborator with the local resistance. A British-mediated peace agreement was reached between the two parties in 1853.     Hostilities were provoked again after the Bahraini sheikh, in response to the harboring of Bahraini fugitives in Dammam, stopped paying tribute to the Wahhabi amir in 1859 and proceeded to instigate Qatari tribes to attack its subjects. Following threats made by ": null
    },
    {
        "Abdullah bin Faisal": "house of saud"
    },
    {
        " to attack Bahrain, the British navy dispatched a ship off the coast of Dammam to prevent any attacks. The situation escalated in May 1860 when Abdullah threatened to occupy the coast of Qatar until the annual tribute was paid. In May 1861, Bahrain signed a treaty with the British government in which the latter agreed to offer protection and recognize Qatar as a dependent of Bahrain.  In February 1862, the treaty was ratified by the ": null
    },
    {
        "Indian": "british raj"
    },
    {
        " government.      Proceeding the British involvement, the sway that the Al Khalifa tribe held over Qatars affairs began declining. ": null
    },
    {
        "Mohammed bin Thani": "mohammed bin thani"
    },
    {
        " was described by ": null
    },
    {
        "Gifford Palgrave": "gifford palgrave"
    },
    {
        " as the acknowledged governor of the Qatar Peninsula in 1863.  Some of ": null
    },
    {
        "Al Wakrahs": "al wakrah"
    },
    {
        "inhabitants were forced to vacate the town by the Bahraini sheikh in April 1863 due to alleged links with the Wahhabi. The towns chief, Mohammed Bu Kuwara, was taken into custody on a similar charge.  In 1866, a report by the British revealed that Qatar was paying an annual ": null
    },
    {
        "zakat": "zakat"
    },
    {
        " of 4,000 German krones to the Wahhabi, in encroachment of the 1861 British treaty. The report also contended that the Al Khalifa were taxing the people of Qatar for the same annual payment.                In June 1867, a representative of Mohammed Al Khalifa seized a ": null
    },
    {
        "Bedouin": "bedouin"
    },
    {
        " from ": null
    },
    {
        "Al Wakrah": "al wakrah"
    },
    {
        " and deported him to Bahrain. Mohammed bin Thani demanded his release, but the representative refused. This prompted Mohammed bin Thani to expel him from Al Wakrah. Upon receiving news of this, Mohammed Al Khalifa released the Bedouin prisoner and expressed his desire of renewed peace talks. ": null
    },
    {
        "Jassim bin Mohammed Al Thani": "jassim bin mohammed al thani"
    },
    {
        ", the son of Mohammed bin Thani, traveled to Bahrain to negotiate on his behalf. He was imprisoned on arrival and a large number of ships and troops were soon sent to punish the people of Al Wakrah and ": null
    },
    {
        "Al Bidda": "al bidda"
    },
    {
        ". ": null
    },
    {
        "Abu Dhabi": "abu dhabi"
    },
    {
        " joined on Bahrains behalf due to the conception that Al Wakrah served as a refuge for fugitives from Oman. Later that year, the combined forces sacked the two aforementioned Qatari cities with 2,000 men in what would come to be known as the ": null
    },
    {
        "Qatari–Bahraini War": "qatari–bahraini war"
    },
    {
        ".   A British record later stated:  In June 1868, Qatari tribes retaliated against Bahrain and a battle ensued in which 60 boats were sunk and 1000 men were killed. Afterwards, the Bahraini sheikh agreed to free Jassim bin Mohammed in return for captured Bahraini prisoners.      The joint Bahraini-Abu Dhabi incursion and Qatari counterattack prompted the British political agent, Colonel ": null
    },
    {
        "Lewis Pelly": "lewis pelly"
    },
    {
        ", to impose a settlement in 1868. Pellys mission to Bahrain and Qatar and the peace treaty that resulted were milestones in Qatars history. It implicitly recognized the distinctness of Qatar from Bahrain and explicitly acknowledged the position of ": null
    },
    {
        "Mohammed bin Thani": "mohammed bin thani"
    },
    {
        " as an important representative of the Peninsulas tribes.                 The ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " expanded into Eastern Arabia in 1871. After establishing themselves on ": null
    },
    {
        "Al-Hasa": "al-hasa"
    },
    {
        " coast, they advanced towards Qatar. ": null
    },
    {
        "Al Bidda": "al bidda"
    },
    {
        " soon came to serve as a base of operations for Bedouins harassing the Ottomans in the south, and ": null
    },
    {
        "Abdullah II Al-Sabah": "abdullah ii al-sabah"
    },
    {
        " of Kuwait was sent to the town to secure a landing for the Ottoman troops. He brought with him four Ottoman flags for the most influential personages in Qatar. Mohammed bin Thani received and accepted one of the flags, but he sent it to ": null
    },
    {
        "Al Wakrah": "al wakrah"
    },
    {
        " and continued hoisting the local flag above his house. Jassim bin Mohammed accepted a flag and flew it above his house. A third flag was given to Ali bin Abdul Aziz, the ruler of ": null
    },
    {
        "Al Khor": "al khor"
    },
    {
        ".     The ": null
    },
    {
        "British": "british empire"
    },
    {
        " reacted negatively to the Ottomans advancements as they felt their interests were at stake. Receiving no response to their objections, the British gunboat Hugh Rose arrived in Qatar on 19 July 1871. After inspecting the situation, Sidney Smith, the assistant ": null
    },
    {
        "political resident in the Persian Gulf": "persian gulf residency"
    },
    {
        ", discovered that Qatar flew the flags willingly.  To further add to their apprehension, Jassim bin Mohammed, who assumed his fathers role during this period, authorized the Ottomans to send 100 troops and equipment to Al Bidda in December 1871. By January 1872, the Ottomans incorporated Qatar into their dominion. It was designated a province in ": null
    },
    {
        "Najd": "najd"
    },
    {
        " under the control of the ": null
    },
    {
        "sanjak of Najd": "najd sanjak"
    },
    {
        ". Jassim bin Mohammed was appointed as the ": null
    },
    {
        "Kaymakam": "kaymakam"
    },
    {
        " of the district, and most other Qataris were allowed to keep their positions in the new government.         Charles Grant, the assistant political resident, falsely reported that the Ottomans sent a contingent of 100 troops from ": null
    },
    {
        "Qatif": "qatif"
    },
    {
        " to ": null
    },
    {
        "Zubarah": "zubarah"
    },
    {
        " under the command of Hossein Effendi in August 1873. The sheikh of Bahrain reacted negatively to this because the Al Nuaim tribe which resided in Zubarah had signed a treaty agreeing to be subjects of his. Upon being confronted by the sheikh, Grant referred him to political resident Edward Ross. Ross informed the sheikh that he believed he had no right to protect tribes residing in Qatar.  In September, the sheikh reiterated his sovereignty over the town and tribe. Grant replied by arguing that there was no special mention of the Al Nuaim or Zubarah in any treaties signed with Bahrain. A British government official concurred with his views, stating that the sheikh of Bahrain should, as far as practicable abstain from interfering in complications on the mainland.      Another chance arose for the Al Khalifa to renew their claim on Zubarah in 1874 after an opposition leader named Nasir bin Mubarak moved to Qatar. They believed that Mubarak, with the assistance of Jassim bin Mohammed, would target the ": null
    },
    {
        "Al Nuaim": "al nuaim"
    },
    {
        " living in Zubarah as a prelude to an invasion. As a result, a contingent of Bahraini reinforcements were sent to Zubarah, much to the disapproval of the British who suggested that the sheikh was involving himself in complications. Edward Ross made it apparent that a government council decision advised the sheikh that he should not interfere in the affairs of Qatar.  The Al Khalifa remained in consistent contact with the Al Nuaim, drafting 100 members of the tribe in their army and offering financial assistance. Jassim bin Mohammed expelled some members of the tribe after they attacked ships near ": null
    },
    {
        "Al Bidda": "al bidda"
    },
    {
        " in 1878.      Despite the opposition of many prominent Qatari tribes, Jassim bin Mohammed continued to show support for the Ottomans. However, there were no signs of improvement in the partnership between the two parties, and relations further deteriorated when the Ottomans refused to aid Jassim in his expedition of ": null
    },
    {
        "Abu Dhabi": "abu dhabi"
    },
    {
        "-occupied ": null
    },
    {
        "Khawr al Udayd": "khawr al udayd"
    },
    {
        " in 1882. In addition, the Ottomans supported the Ottoman subject Mohammed bin Abdul Wahab who attempted to supplant Jassim bin Mohammed in 1888.              In February 1893, Mehmed Hafiz Pasha arrived in Qatar in the interests of seeking unpaid taxes and accosting Jassim bin Mohammeds opposition to proposed Ottoman administrative reforms. Fearing that he would face death or imprisonment, Jassim bin Mohammed moved to ": null
    },
    {
        "Al Wajbah": "al wajbah"
    },
    {
        " ; he was accompanied by several tribe members. Mehmed demanded that he disband his troops and pledge his loyalty to the Ottomans. However, Jassim bin Mohammed remained adamant in his refusal to comply with Ottoman authority. In March 1893, Mehmed imprisoned his brother, Ahmed bin Mohammed Al Thani, in addition to 13 prominent Qatari tribal leaders on the Ottoman ": null
    },
    {
        "corvette": "corvette"
    },
    {
        " Merrikh. After Mehmed declined an offer to release the captives for a fee of ten thousand ": null
    },
    {
        "liras": "turkish lira"
    },
    {
        ", he ordered a column of approximately 200 Ottoman troops to advance towards Jassim bin Mohammeds fortress in Al Wajbah under the command of Yusuf Effendi.      Shortly after arriving to Al Wajbah, Effendis troops came under heavy gunfire by Qatari infantry and cavalry troops, which totaled 3,000 to 4,000 men. They retreated to Shebaka fortress, where they once again sustained casualties from a Qatari incursion. After they retreated to the fortress of Al Bidda, Jassim bin Mohammeds advancing column besieged the fortress and cut off the water supply of the neighborhood. The Ottomans conceded defeat and agreed to relinquish the Qatari captives in return for the safe passage of Mehmed Pashas cavalry to ": null
    },
    {
        "Hofuf": "hofuf"
    },
    {
        " by land.  Although Qatar did not gain full independence from the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", the result of the battle forced a treaty that would later form the basis of Qatar emerging as an autonomous separate country within the empire.        On the cusp of Ottoman withdrawal from the Peninsula in 1915, the British government wrote the following description of the Ottoman presence in Qatar:             The Ottomans officially renounced sovereignty over Qatar in 1913, and in 1916 the new ruler ": null
    },
    {
        "Abdullah bin Jassim Al Thani": "abdullah bin jassim al thani"
    },
    {
        " signed a treaty with Britain, thereby instating the area under the trucial system. This meant that Qatar relinquished its autonomy in foreign affairs, such as the power to cede territory, and other affairs, in exchange for Britains military protection from external threats. The treaty also had provisions suppressing ": null
    },
    {
        "slavery": "slavery"
    },
    {
        ", ": null
    },
    {
        "piracy": "piracy"
    },
    {
        ", and ": null
    },
    {
        "gunrunning": "arms trafficking"
    },
    {
        ", but the British were not strict about enforcing those provisions.        Despite Qatar coming under British protection, Abdullah bin Jassims position was insecure. Recalcitrant tribes refused to pay tribute; disgruntled family members intrigued against him; and he felt vulnerable to the designs of Bahrain and the ": null
    },
    {
        "Wahhabi": "wahhabi"
    },
    {
        ". The Al Thani were merchant princes, reliant on trade and especially the pearl trade, and dependent on other tribes to do their fighting for them, primarily the Bani Hajer who owed their allegiance to ": null
    },
    {
        "Ibn Saud": "ibn saud"
    },
    {
        ", amir of the ": null
    },
    {
        "Najd": "najd"
    },
    {
        " and ": null
    },
    {
        "Al-Hasa": "al-hasa"
    },
    {
        ". Despite numerous requests by Abdullah bin Jassim for strong military support, weapons, and a loan, the British were reluctant to become involved in inland affairs. This changed in the 1930s, when competition for oil concessions in the region intensified.         The scramble for oil raised the stakes in regional territorial disputes and signified the need to establish territorial borders. The first move came in 1922 at a boundary conference in ": null
    },
    {
        "Uqair": "uqair"
    },
    {
        " when prospector Major ": null
    },
    {
        "Frank Holmes": "frank holmes"
    },
    {
        " attempted to include Qatar in an oil concession he was discussing with Ibn Saud. Sir ": null
    },
    {
        "Percy Cox": "percy cox"
    },
    {
        ", the British representative, saw through the ploy and drew a line on the map separating the Qatar Peninsula from the mainland. H.R.P. Dickson to the Political Resident, Bahrain, 4 July 1933, British Library India Office Records PS/12/2/213-0 The first oil survey took place in 1926 under the direction of ": null
    },
    {
        "George Martin Lees": "george martin lees"
    },
    {
        ", a geologist contracted to the ": null
    },
    {
        "Anglo-Persian Oil Company": "anglo-persian oil company"
    },
    {
        ", but no oil was found. The oil issue raised its head again in 1933 after an oil strike in Bahrain. Lees had already noted that, in such an eventuality, Qatar should be investigated again. Report of G.M. Lees of 21 March 1926, BP Archive, Warwick University, Archive reference 135500. After lengthy negotiations on 17 May 1935, Abdullah bin Jassim signed a concession agreement with Anglo-Persian representatives for a period of 75 years in return for 400,000 rupees on signature and 150,000 ": null
    },
    {
        "rupees": "rupee"
    },
    {
        "per annum with royalties. Diary of a Visit to Qatar, C.C. Mylles, BP Archive, Warwick University, Archive Reference 135500. As part of the agreement, Great Britain made more specific promises of assistance than they had in earlier treaties. Anglo-Persian transferred the concession to the ": null
    },
    {
        "IPC": "iraq petroleum company"
    },
    {
        " subsidiary company Petroleum Development Ltd. in order to meet its obligations under the ": null
    },
    {
        "Red Line Agreement": "red line agreement"
    },
    {
        ".        Bahrain claimed rule over a group of islands encompassing the two countries in 1936. The largest island was ": null
    },
    {
        "Hawar Islands": "hawar islands"
    },
    {
        ", situated off the west coast of Qatar, where the Bahrainis had established a small military garrison. Britain accepted the Bahraini claim over Abdullah bin Jassims objections, in large part because the Bahraini sheikhs personal British adviser was able to phrase their case in a legal manner familiar to British officials. In 1937, the Bahrainis again laid claim to the deserted town of ": null
    },
    {
        "Zubarah": "zubarah"
    },
    {
        " after being involved in a dispute involving the Al Nuaim tribe. Abdullah bin Jassim sent a large, heavily armed force and succeeded in defeating the Al Nuaim. The British political resident in Bahrain supported Qatars claim and warned Hamad ibn Isa Al Khalifa, the ruler of Bahrain, not to intervene militarily. Indignant over the loss of Zubarah, Hamad ibn Isa imposed a crushing ": null
    },
    {
        "embargo": "embargo"
    },
    {
        " on trade and travel to Qatar.     Drilling of the first oil well began in ": null
    },
    {
        "Dukhan": "dukhan"
    },
    {
        " in October 1938 and over a year later, the well struck oil in the ": null
    },
    {
        "Upper Jurassic": "late jurassic"
    },
    {
        " limestone. Unlike the Bahraini strike, this was similar to Saudi Arabias ": null
    },
    {
        "Dammam": "dammam"
    },
    {
        " field discovered three years before.  Production was halted between 1942 and 1947 because of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and its aftermath. The disruption of food supplies caused by the war prolonged a period of economic hardship in Qatar which began in the 1920s with the collapse of the pearl trade and was exacerbated in the early 1930s with the onsets of the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " and the Bahraini embargo. As was the case in previous times of privation, entire families and tribes moved to other parts of the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ", leaving many Qatari villages deserted. Abdullah bin Jassim went into debt and groomed his favored second son, ": null
    },
    {
        "Hamad bin Abdullah Al Thani": "hamad bin abdullah al thani"
    },
    {
        ", to be his successor in preparation for his retirement. However, Hamad bin Abdullahs death in 1948 led to a succession crisis in which the main candidates were Abdullah bin Jassims eldest son, ": null
    },
    {
        "Ali bin Abdullah Al Thani": "ali bin abdullah al thani"
    },
    {
        ", and Hamad bin Abdullahs teenage son, ": null
    },
    {
        "Khalifa bin Hamad Al Thani": "khalifa bin hamad al thani"
    },
    {
        ".        Oil exports and payments for offshore rights began in 1949 and marked a turning point in Qatar. The oil revenues would dramatically transform the economy and society and would also provide the focus for domestic disputes and foreign relations. This became apparent to Abdullah bin Jassim when several of his relatives threatened armed opposition if they did not receive increases in their allowances. Aged and anxious, Abdullah bin Jassim turned to the British. He promised to abdicate and agreed to an official British presence in Qatar in exchange for recognition and support of Ali bin Abdullah as ruler in 1949.     Under British tutelage, the 1950s witnessed the development of government structures and public services. ": null
    },
    {
        "Ali bin Abdullah": "ali bin abdullah al thani"
    },
    {
        " was at first reluctant to share power, which had centered in his household, with an infant bureaucracy run and staffed mainly by outsiders. Ali bin Abdullahs increasing financial difficulties and inability to control striking oil workers and obstreperous sheikhs led him to succumb to British pressure. The first official budget was drawn up by a British adviser in 1953. By 1954 there were forty-two Qatari government employees.            Large numbers of protests against the British and the ruling family occurred during the 1950s. One of the largest protests took place in 1956; it drew 2,000 participants, most of whom were high-ranking Qataris allied with ": null
    },
    {
        "Arab nationalists": "pan-arabism"
    },
    {
        " and dissatisfied oil workers.  During another protest which took place in August 1956, the participants waved ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        "ian flags and chanted anti-colonialism slogans.  In October 1956, protesters tried to sabotage oil pipelines in the Persian Gulf by destroying the pipelines with a bulldozer. These were major impetuses to the development of the British-run police force which was established by the British in 1949.  The demonstrations led Ali bin Abdullah to invest the police with his personal authority and support. This was a significant reversal of his previous reliance on his retainers and ": null
    },
    {
        "Bedouin": "bedouin"
    },
    {
        " fighters.     Public services developed slowly during the 1950s. The first telephone exchange opened in 1953, the first desalination plant in 1954, and the first power plant in 1957. Also built in this period were a dock, a customs warehouse, an airstrip, and a police headquarters. In the 1950s, 150 adult males of the ruling family received grants from the government. Sheikhs also received land and government positions. This mollified them as long as oil revenues increased. However, when revenues declined in the late 1950s, Ali bin Abdullah could not handle the family pressures this engendered. Discontent was fueled by his residence in ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ", extravagant spending, and hunting trips in ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        ", especially among those who were excluded from the regimes largesse and among other branches of Al Thani who desired more privileges. Seniority and proximity to the sheikh determined the size of allowances.     Succumbing to family pressures and poor health, Ali bin Abdullah abdicated in 1960. Instead of handing power over to Khalifa bin Hamad, who had been named heir apparent in 1948, he made his son, ": null
    },
    {
        "Ahmad bin Ali": "ahmad bin ali al thani"
    },
    {
        ", ruler. Nonetheless, Khalifa bin Hamad gained considerable power as ": null
    },
    {
        "heir apparent": "heir apparent"
    },
    {
        " and deputy ruler, in large part because Ahmad bin Ali spent much time outside the country. One of his first acts was to increase funding for the sheikhs at the expense of development projects and social services. In addition to allowances, adult male Al Thani were given government positions. This added to the anti-regime resentment already felt by, among others, oil workers, low-ranking Al Thani, dissident sheikhs, and some leading government officials. These individuals formed the ": null
    },
    {
        "National Unity Front": "qatar national unity front"
    },
    {
        " in response to a fatal shooting of a protester on 19 April 1963 by one of Sheikh Ahmad bin Alis nephews.  While the ": null
    },
    {
        "Saudi": "saudi arabia"
    },
    {
        " monarch was at the rulers palace on 20 April 1963, a demonstration occurred in front of the building. Police fired and killed three demonstrators, prompting the National Unity Front to organize a ": null
    },
    {
        "general strike": "general strike"
    },
    {
        " on 21 April. The strike lasted around two weeks, and most public services were affected.      The group made a statement that week where it listed 35 of its demands to the government entailing less authority for the ruling family; protection for oil workers; recognition of ": null
    },
    {
        "trade union": "trade union"
    },
    {
        "s; voting rights for citizens and the ": null
    },
    {
        "Arabization": "arabization"
    },
    {
        " of the leadership. Ahmed bin Ali rejected most of these demands and moved to arrest and detain fifty of the most prominent National Unity Front members and sympathizers without trial in early May.  The government also instituted some reforms in response to the movements. This included the provision of land and loans to poor farmers, instituting a policy of preferential hiring of Qatari citizens, and the election of a ": null
    },
    {
        "municipal council": "central municipal council"
    },
    {
        ".      The infrastructure, foreign labor force, and bureaucracy continued to grow in the 1960s, largely under the instruction of Khalifa bin Hamad. There were also some early attempts at diversifying Qatars economic base, most notably with the establishment of a cement factory, a national fishing company, and small-scale agriculture. An official gazette was first published in 1961, and in 1962, a nationality law was introduced.  No cabinets existed during this period, however, British and Egyptian advisers helped establish a number of governmental departments, such as the Department of Agriculture and a Department of Labor and Social Affairs.            In 1968, Britain announced its plans of withdrawing its military commitments east of ": null
    },
    {
        "Suez": "suez"
    },
    {
        " in the proceeding three years. Because of the Persian Gulf sheikhdoms vulnerability and small size, the rulers of Bahrain, Qatar and the ": null
    },
    {
        "Trucial Coast": "trucial coast"
    },
    {
        " contemplated forming a federation after the British withdrawal.  The federation was first proposed in February 1968, when the rulers of ": null
    },
    {
        "Abu Dhabi": "abu dhabi"
    },
    {
        " and ": null
    },
    {
        "Dubai": "dubai"
    },
    {
        " announced their intention to form a coalition, extending an invitation to other Gulf states to join. Later that month, in a summit meeting attended by the rulers of Bahrain, Qatar and the Trucial Coast, the government of Qatar proposed the formation of a federation of Arab Emirates to be governed by a higher council composed of nine rulers. This proposal was accepted and a declaration of union was approved. There were, however, several disagreements between the rulers on matters such as the location of the capital, the drafting of the constitution and the distribution of ministries.        The rulers remained divided on multiple issues despite ": null
    },
    {
        "Khalifa bin Hamads": "khalifa bin hamad al thani"
    },
    {
        "election as chairman of the Temporary Federal Council in July 1968 and the establishment of numerous ministries. Two opposing blocs surfaced soon after the initial proposal, with Qatar and Dubai aligning together to oppose the inclinations of Bahrain and Abu Dhabi. Bahrain, being backed by Abu Dhabi, made efforts to marginalize the other rulers roles in the union in an attempt to assume a leadership role and thus gain political leverage over their long-standing territorial disputes with ": null
    },
    {
        "Iran": "iran"
    },
    {
        ". The last meeting took place in October 1969 when ": null
    },
    {
        "Zayed Al Nahyan": "zayed bin sultan al nahyan"
    },
    {
        " and Khalifa bin Hamad were elected the first president and prime minister of the federation, respectively. There were stalemates on numerous issues during the meeting, including the position of vice-president, the defense of the federation, and whether a constitution was required.  Shortly after the meeting, the Political Agent in Abu Dhabi revealed the British governments interests in the outcome of the session, prompting Qatar and ": null
    },
    {
        "Ras al-Khaimah": "ras al-khaimah"
    },
    {
        " to withdraw from the federation over perceived foreign interference in internal affairs. The federation was consequently disbanded despite efforts by Saudi Arabia, Kuwait and Britain to reinvigorate discussions.      ": null
    },
    {
        "Ahmad bin Ali": "ahmad bin ali al thani"
    },
    {
        " subsequently promulgated a provisional constitution in April 1970 which declared Qatar an independent Arab Islamic state with the ": null
    },
    {
        "Sharia": "sharia"
    },
    {
        " as its basic law. Khalifa bin Hamad was appointed prime minister in May. The first ": null
    },
    {
        "Council of Ministers": "council of ministers"
    },
    {
        " was sworn in on 1 January 1970 and seven of its ten members were Al Thani. Khalifa bin Hamads argument prevailed with regard to the federation proposal.          Qatar declared its independence on 1 September 1971 and became an independent state on 3 September. When Ahmad bin Ali issued the formal announcement from his Swiss villa instead of from his palace in Doha, many Qataris were convinced that it was time for a change in leadership. On 22 February 1972, Khalifa bin Hamad deposed Ahmad bin Ali when he was on a hunting trip in ": null
    },
    {
        "Iran": "iran"
    },
    {
        ". Khalifa bin Hamad had the tacit support of the Al Thani and Britain and also had the political, financial and military support of Saudi Arabia.     In contrast to his predecessors policies, ": null
    },
    {
        "Khalifa bin Hamad": "khalifa bin hamad al thani"
    },
    {
        " cut family allowances and increased spending on social programs, including housing, health, education, and pensions. In addition, he filled many top government posts with close relatives. In 1993, Khalifa bin Hamad remained the ": null
    },
    {
        "Emir": "emir"
    },
    {
        ", but his son, ": null
    },
    {
        "Hamad bin Khalifa": "hamad bin khalifa al thani"
    },
    {
        ", the heir apparent and minister of defense, had taken over much of the day-to-day running of the country. The two consulted with each other on all matters of importance.     In 1991, Qatar played a significant role in the ": null
    },
    {
        "Gulf War": "gulf war"
    },
    {
        ", particularly during the ": null
    },
    {
        "Battle of Khafji": "battle of khafji"
    },
    {
        " in which Qatari tanks rolled through the streets of the town and provided fire support for ": null
    },
    {
        "Saudi Arabian National Guard": "saudi arabian national guard"
    },
    {
        " units which were engaging ": null
    },
    {
        "Iraqi Army": "iraqi army"
    },
    {
        " troops.  Qatar allowed coalition troops from Canada to use the country as an ": null
    },
    {
        "airbase": "canada dry one"
    },
    {
        " to launch aircraft on ": null
    },
    {
        "CAP": "combat air patrol"
    },
    {
        " duty, and also permitted air forces from the United States and France to operate in its territories.        On 27 June 1995, deputy emir Sheikh Hamad bin Khalifa deposed his father Khalifa in a bloodless coup. An ": null
    },
    {
        "unsuccessful counter-coup": "1996 qatari coup détat attempt"
    },
    {
        " was staged in 1996. The emir and his father are now reconciled, although some supporters of the counter-coup remain in prison. The emir announced his intention for Qatar to move toward democracy and permitted more liberal press and municipal elections as a precursor to expected parliamentary elections. A new constitution was approved via public referendum in April 2003 and came into effect in June 2005. Economic, ": null
    },
    {
        "social": "social issues"
    },
    {
        ", and democratic reforms occurred in the proceeding years. In 2003, a woman was appointed to the cabinet as ": null
    },
    {
        "minister of education": "minister of education"
    },
    {
        ".     Qatar and Bahrain have had disputes over the ownership of ": null
    },
    {
        "Hawar Islands": "hawar islands"
    },
    {
        " since the mid-20th century.  In 2001, the ": null
    },
    {
        "International Court of Justice": "international court of justice"
    },
    {
        " awarded Bahrain sovereignty over Hawar Islands while allotting Qatar sovereignty over smaller disputed islands and the Zubarah region in mainland Qatar.  During the trial, Qatar provided the court with 82 forged documents to substantiate their claims of sovereignty over the territories in question. These claims were withdrawn at a later stage after Bahrain discovered the forgeries.      In 2003, Qatar served as the US Central Command headquarters and one of the main launching sites of the ": null
    },
    {
        "invasion of Iraq": "2003 invasion of iraq"
    },
    {
        ".  In March 2005, a ": null
    },
    {
        "suicide bombing": "suicide attack"
    },
    {
        " killed a British teacher at the Doha Players Theatre, shocking the country, which had not previously experienced acts of terrorism. The bombing was carried out by Omar Ahmed Abdullah Ali, an Egyptian resident in Qatar who had suspected ties to ": null
    },
    {
        "Al-Qaeda in the Arabian Peninsula": "al-qaeda in the arabian peninsula"
    },
    {
        ".   In June 2013, Sheikh Hamad Bin Khalifa stepped down as emir and transferred leadership to his son and heir Sheikh ": null
    },
    {
        "Tamim bin Hamad Al Thani": "tamim bin hamad al thani"
    },
    {
        ".      As a means to manage the revenue gained from LNG sales, the ": null
    },
    {
        "Qatar Investment Authority": "qatar investment authority"
    },
    {
        " was established in 2005.  In 2008, the government launched ": null
    },
    {
        "Qatar National Vision 2030": "qatar national vision 2030"
    },
    {
        ", which provides a framework for Qatars long-term development as well as identifying threats and solutions.             Qatar played a role in the ": null
    },
    {
        "revolutionary wave": "revolutionary wave"
    },
    {
        " of ": null
    },
    {
        "demonstrations": "demonstration"
    },
    {
        ", protests and civil wars in the ": null
    },
    {
        "Arab world": "arab world"
    },
    {
        " collectively known as the ": null
    },
    {
        "Arab Spring": "arab spring"
    },
    {
        ". Having shifted from its traditional diplomatic role as a mediator, Qatar moved to support several transitional states and upheavals in the Middle East and ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ".      During the initial months of the Arab Spring, the countrys most extensive media network, ": null
    },
    {
        "Al Jazeera": "al jazeera"
    },
    {
        ", helped mobilize Arab support and shaped the narratives of protests and demonstrations.  Qatar sent hundreds of ground troops to support the ": null
    },
    {
        "National Transitional Council": "national transitional council"
    },
    {
        " during the 2011 ": null
    },
    {
        "Libyan Civil War": "libyan civil war"
    },
    {
        ".  The troops were primarily military advisers,  and were sometimes labelled as mercenaries by the media.  Qatar also participated in the aerial campaign alongside several other coalition members.      Qatar has taken a proactive role in the ": null
    },
    {
        "Syrian Civil War": "syrian civil war"
    },
    {
        ", which began in Spring of 2011. In 2012, Qatar announced they would begin arming and bankrolling the opposition.  It was further reported that Qatar had funded the Syrian rebellion by as much as $3 billion over the first two years of the civil war.       Beginning in 2015, Qatar has participated in the ": null
    },
    {
        "Saudi Arabian-led intervention in Yemen": "saudi arabian-led intervention in yemen"
    },
    {
        " against the ": null
    },
    {
        "Houthis": "houthis"
    },
    {
        " and forces loyal to former President ": null
    },
    {
        "Ali Abdullah Saleh": "ali abdullah saleh"
    },
    {
        ", who was deposed in the aftermath of the Arab Spring uprisings.  . ": null
    },
    {
        "CNN": "cnn"
    },
    {
        ". 27 March 2015.             In March 2014, in protest of Qatars alleged involvement in financing factions and political parties in ongoing Middle Eastern conflicts, Saudi Arabia, the UAE and Bahrain recalled their ambassadors to Qatar.  The three countries returned their ambassadors in November of that year after an agreement was reached.      On 5 June 2017, a number of countries led by Saudi Arabia, the UAE, Bahrain and Egypt ": null
    },
    {
        "severed ties": "2017–18 qatar diplomatic crisis"
    },
    {
        " with Qatar and enacted several punitive measures, such as closing air, land and sea borders to Qatar. Saudi Arabia also halted Qatari involvement in the ongoing war in Yemen.  The Quartet justified their actions by alluding to alleged Qatari ties to terrorist groups in the region. ": null
    }
]