[
    {
        "   The history of medicine shows how societies have changed in their approach to illness and disease from ancient times to the present. Early medical traditions include those of ": null
    },
    {
        "Babylon": "babylonian medicine"
    },
    {
        ", ": null
    },
    {
        "China": "traditional chinese medicine"
    },
    {
        ", ": null
    },
    {
        "Egypt": "ancient egyptian medicine"
    },
    {
        " and ": null
    },
    {
        "India": "ayurveda"
    },
    {
        ". ": null
    },
    {
        "The Indians": "sushruta"
    },
    {
        " introduced the concepts of ": null
    },
    {
        "medical diagnosis": "medical diagnosis"
    },
    {
        ", ": null
    },
    {
        "prognosis": "prognosis"
    },
    {
        ", and advanced ": null
    },
    {
        "medical ethics": "medical ethics"
    },
    {
        ". The ": null
    },
    {
        "Hippocratic Oath": "hippocratic oath"
    },
    {
        " was written in ": null
    },
    {
        "ancient Greece": "ancient greece"
    },
    {
        " in the 5th century BCE, and is a direct inspiration for oaths of office that physicians swear upon entry into the profession today. In the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", surgical practices inherited from the ancient masters were improved and then systematized in ": null
    },
    {
        "Rogeriuss": "rogerius"
    },
    {
        " The Practice of Surgery. Universities began systematic training of physicians around 1220 CE in Italy.     Invention of the microscope was a consequence of improved understanding, during the Renaissance. Prior to the 19th century, ": null
    },
    {
        "humorism": "humorism"
    },
    {
        " was thought to explain the cause of disease but it was gradually replaced by the ": null
    },
    {
        "germ theory of disease": "germ theory of disease"
    },
    {
        ", leading to effective treatments and even cures for many infectious diseases. Military doctors advanced the methods of trauma treatment and surgery. Public health measures were developed especially in the 19th century as the rapid growth of cities required systematic sanitary measures. Advanced research centers opened in the early 20th century, often connected with major hospitals. The mid-20th century was characterized by new biological treatments, such as antibiotics. These advancements, along with developments in chemistry, genetics, and ": null
    },
    {
        "radiography": "radiography"
    },
    {
        " led to ": null
    },
    {
        "modern medicine": "modern medicine"
    },
    {
        ". Medicine was heavily professionalized in the 20th century, and new careers opened to women as nurses and as physicians .          Although there is little record to establish when plants were first used for medicinal purposes , the use of plants as healing agents, as well as clays and soils is ancient. Over time, through emulation of the behavior of fauna, a medicinal knowledge base developed and passed between generations. Even earlier, Neanderthals may have engaged in medical practices.    As tribal culture specialized specific castes, ": null
    },
    {
        "shamans": "shaman"
    },
    {
        "and ": null
    },
    {
        "apothecaries": "apothecary"
    },
    {
        " fulfilled the role of healer.    The first known ": null
    },
    {
        "dentistry": "dentistry"
    },
    {
        " dates to c. 7000 BC in ": null
    },
    {
        "Baluchistan": "baluchistan"
    },
    {
        " where Neolithic dentists used flint-tipped drills and bowstrings.  The first known ": null
    },
    {
        "trepanning": "trepanning"
    },
    {
        " operation was carried out c. 5000 BC in ": null
    },
    {
        "Ensisheim": "ensisheim"
    },
    {
        ", France.  A possible ": null
    },
    {
        "amputation": "amputation"
    },
    {
        " was carried out c. 4,900 BC in Buthiers-Bulancourt, France.                   The ancient Mesopotamians had no distinction between rational science and ": null
    },
    {
        "magic": "magic"
    },
    {
        ".    When a person became ill, doctors would prescribe both magical formulas to be recited as well as medicinal treatments.  The earliest medical prescriptions appear in ": null
    },
    {
        "Sumerian": "sumerian language"
    },
    {
        " during the ": null
    },
    {
        "Third Dynasty of Ur": "third dynasty of ur"
    },
    {
        " .  The oldest Babylonian texts on medicine date back to the ": null
    },
    {
        "Old Babylonian": "first babylonian dynasty"
    },
    {
        " period in the first half of the ": null
    },
    {
        "2nd  millennium  BCE": "2nd millennium bce"
    },
    {
        ".  The most extensive Babylonian medical text, however, is the Diagnostic Handbook written by the ummânū, or chief scholar, ": null
    },
    {
        "Esagil-kin-apli": "esagil-kin-apli"
    },
    {
        " of ": null
    },
    {
        "Borsippa": "borsippa"
    },
    {
        ",  during the reign of the Babylonian king ": null
    },
    {
        "Adad-apla-iddina": "adad-apla-iddina"
    },
    {
        " . Marten Stol, Epilepsy in Babylonia, p. 55, Along with the Egyptians, the Babylonians introduced the practice of diagnosis, prognosis, physical examination, and remedies. In addition, the Diagnostic Handbook introduced the methods of ": null
    },
    {
        "therapy": "therapy"
    },
    {
        " and cause. The text contains a list of medical symptoms and often detailed empirical observations along with logical rules used in combining observed symptoms on the body of a patient with its diagnosis and prognosis.  The Diagnostic Handbook was based on a logical set of axioms and assumptions, including the modern view that through the examination and inspection of the symptoms of a patient, it is possible to determine the patients disease, its cause and future development, and the chances of the patients recovery. The symptoms and diseases of a patient were treated through therapeutic means such as bandages, herbs and ": null
    },
    {
        "creams": "cream"
    },
    {
        ".      In ": null
    },
    {
        "East Semitic": "east semitic"
    },
    {
        " cultures, the main medicinal authority was a kind of exorcist-healer known as an  āšipu . The profession was generally passed down from father to son and was held in extremely high regard. Of less frequent recourse was another kind of healer known as an asu, who corresponds more closely to a modern physician and treated physical symptoms using primarily ": null
    },
    {
        "folk remedies": "folk remedies"
    },
    {
        " composed of various herbs, animal products, and minerals, as well as potions, enemas, and ointments or ": null
    },
    {
        "poultices": "poultices"
    },
    {
        ". These physicians, who could be either male or female, also dressed wounds, set limbs, and performed simple surgeries. The ancient Mesopotamians also practiced ": null
    },
    {
        "prophylaxis": "prophylaxis"
    },
    {
        " and took measures to prevent the spread of disease.     Mental illnesses were well known in ancient ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        ",  where diseases and mental disorders were believed to be caused by specific deities.  Because ": null
    },
    {
        "hands": "hand"
    },
    {
        "symbolized control over a person, mental illnesses were known as hands of certain deities. One psychological illness was known as Qāt Ištar, meaning Hand of ": null
    },
    {
        "Ishtar": "ishtar"
    },
    {
        " . Others were known as Hand of ": null
    },
    {
        "Shamash": "shamash"
    },
    {
        " , Hand of the Ghost , and Hand of the God . Descriptions of these illnesses, however, are so vague that it is usually impossible to determine which illnesses they correspond to in modern terminology. Mesopotamian doctors kept detailed record of their patients ": null
    },
    {
        "hallucinations": "hallucination"
    },
    {
        "and assigned spiritual meanings to them. A patient who hallucinated that he was seeing a dog was predicted to die; whereas, if he saw a gazelle, he would recover. The royal family of ": null
    },
    {
        "Elam": "elam"
    },
    {
        " was notorious for its members frequently suffering from insanity. ": null
    },
    {
        "Erectile dysfunction": "erectile dysfunction"
    },
    {
        " was recognized as being rooted in psychological problems.               ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        " developed a large, varied and fruitful medical tradition. ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        " described the Egyptians as the healthiest of all men, next to the Libyans ,  because of the dry climate and the notable ": null
    },
    {
        "public health system": "public health system"
    },
    {
        " that they possessed. According to him, the practice of medicine is so specialized among them that each physician is a healer of one disease and no more. Although Egyptian medicine, to a considerable extent, dealt with the supernatural,  it eventually developed a practical use in the fields of anatomy, public health, and clinical diagnostics.     Medical information in the ": null
    },
    {
        "Edwin Smith Papyrus": "edwin smith papyrus"
    },
    {
        " may date to a time as early as 3000  BC. J.H. Breasted, The Edwin Smith Surgical Papyrus, University of Chicago Press, 1930 ": null
    },
    {
        "Imhotep": "imhotep"
    },
    {
        " in the ": null
    },
    {
        "3rd dynasty": "third dynasty of egypt"
    },
    {
        " is sometimes credited with being the founder of ancient Egyptian medicine and with being the original author of the Edwin Smith Papyrus, detailing cures, ailments and ": null
    },
    {
        "anatomical": "anatomical"
    },
    {
        " observations. The Edwin Smith Papyrus is regarded as a copy of several earlier works and was written c. 1600  BC. It is an ancient textbook on surgery almost completely devoid of magical thinking and describes in exquisite detail the examination, diagnosis, treatment, and prognosis of numerous ailments.      The ": null
    },
    {
        "Kahun Gynaecological Papyrus": "kahun gynaecological papyrus"
    },
    {
        " Griffith, F. Ll. The Petrie Papyri: Hieratic Papyri from Kahun and Gurob treats womens complaints, including problems with conception. Thirty four cases detailing diagnosis and treatment survive, some of them fragmentarily.  Dating to 1800  BCE, it is the oldest surviving medical text of any kind.     Medical institutions, referred to as Houses of Life are known to have been established in ancient Egypt as early as 2200 BC.      The earliest known physician is also credited to ": null
    },
    {
        "ancient Egypt": "history of ancient egypt"
    },
    {
        ": ": null
    },
    {
        "Hesy-Ra": "hesy-ra"
    },
    {
        ", Chief of Dentists and Physicians for King ": null
    },
    {
        "Djoser": "djoser"
    },
    {
        " in the 27th century  BCE. ": null
    },
    {
        "Helaine Selin": "helaine selin"
    },
    {
        ", Hugh Shapiro, eds., Medicine Across Cultures: History and Practice of Medicine in Non-Western Cultures, Springer 2003, p.35 Also, the earliest known woman physician, ": null
    },
    {
        "Peseshet": "peseshet"
    },
    {
        ", practiced in ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        " at the time of the ": null
    },
    {
        "4th dynasty": "fourth dynasty of egypt"
    },
    {
        ". Her title was Lady Overseer of the Lady Physicians. In addition to her supervisory role, Peseshet trained midwives at an ancient Egyptian medical school in ": null
    },
    {
        "Sais": "sais"
    },
    {
        ".                The ": null
    },
    {
        "Atharvaveda": "atharvaveda"
    },
    {
        ", a sacred text of ": null
    },
    {
        "Hinduism": "hinduism"
    },
    {
        " dating from the ": null
    },
    {
        "Early Iron Age": "iron age india"
    },
    {
        ", is one of the first Indian texts dealing with medicine. The Atharvaveda also contains prescriptions of herbs for various ailments. The use of herbs to treat ailments would later form a large part of ": null
    },
    {
        "Ayurveda": "ayurveda"
    },
    {
        ".     Ayurveda, meaning the complete knowledge for long life is another medical system of India. Its two most famous texts belong to the schools of ": null
    },
    {
        "Charaka": "charaka"
    },
    {
        " and ": null
    },
    {
        "Sushruta": "sushruta"
    },
    {
        ". The earliest foundations of Ayurveda were built on a synthesis of traditional herbal practices together with a massive addition of theoretical conceptualizations, new ": null
    },
    {
        "nosologies": "nosology"
    },
    {
        " and new therapies dating from about 600 BCE onwards, and coming out of the communities of thinkers which included the ": null
    },
    {
        "Buddha": "buddha"
    },
    {
        " and others. Kenneth G. Zysk, Asceticism and Healing in Ancient India: Medicine in the Buddhist Monastery, Oxford University Press, rev. ed.      According to the compendium of ": null
    },
    {
        "Charaka": "charaka"
    },
    {
        ", the ": null
    },
    {
        "Charakasamhitā": "charaka samhita"
    },
    {
        ", health and disease are not predetermined and life may be prolonged by human effort. The compendium of ": null
    },
    {
        "Suśruta": "sushruta"
    },
    {
        ", the ": null
    },
    {
        "Suśrutasamhitā": "sushruta samhita"
    },
    {
        " defines the purpose of medicine to cure the diseases of the sick, protect the healthy, and to prolong life. Both these ancient compendia include details of the examination, diagnosis, treatment, and prognosis of numerous ailments. The ": null
    },
    {
        "Suśrutasamhitā": "sushruta samhita"
    },
    {
        " is notable for describing procedures on various forms of ": null
    },
    {
        "surgery": "surgery"
    },
    {
        ", including ": null
    },
    {
        "rhinoplasty": "rhinoplasty"
    },
    {
        ", the repair of torn ear lobes, perineal ": null
    },
    {
        "lithotomy": "lithotomy"
    },
    {
        ", cataract surgery, and several other excisions and other surgical procedures. Most remarkable is Sushrutas penchant for scientific classification:   His medical treatise consists of 184 chapters, 1,120 conditions are listed, including injuries and illnesses relating to aging and mental illness.     The Ayurvedic classics mention eight branches of medicine: kāyācikitsā , śalyacikitsā , śālākyacikitsā , kaumārabhṛtya , bhūtavidyā , agada tantra , rasāyana , and vājīkaraṇa . Apart from learning these, the student of Āyurveda was expected to know ten arts that were indispensable in the preparation and application of his medicines: distillation, operative skills, cooking, horticulture, metallurgy, sugar manufacture, pharmacy, analysis and separation of minerals, compounding of metals, and preparation of ": null
    },
    {
        "alkalis": "alkalis"
    },
    {
        ". The teaching of various subjects was done during the instruction of relevant clinical subjects. For example, the teaching of anatomy was a part of the teaching of surgery, embryology was a part of training in pediatrics and obstetrics, and the knowledge of physiology and pathology was interwoven in the teaching of all the clinical disciplines.   The normal length of the students training appears to have been seven years. But the physician was to continue to learn. Dominik Wujastyk, ed., The Roots of Ayurveda, Penguin      As an alternative form of medicine in India, ": null
    },
    {
        "Unani medicine": "unani medicine"
    },
    {
        " found deep roots and royal patronage during medieval times. It progressed during the Indian sultanate and ": null
    },
    {
        "mughal": "mughal empire"
    },
    {
        " periods. Unani medicine is very close to Ayurveda. Both are based on the theory of the presence of the elements in the human body. According to followers of Unani medicine, these elements are present in different fluids and their balance leads to health and their imbalance leads to illness. Arab Medicine during the Ages by Hakim Syed Zillur Rahman, Studies in History of Medicine and Science, IHMMR, New Delhi, Vol. XIV, No. 1-2, 1996, p.  1–39     By the 18th century CE, Sanskrit medical wisdom still dominated. Muslim rulers built large hospitals in 1595 in ": null
    },
    {
        "Hyderabad": "hyderabad, india"
    },
    {
        ", and in ": null
    },
    {
        "Delhi": "history of delhi"
    },
    {
        " in 1719, and numerous commentaries on ancient texts were written. Deepak Kumar, India in Roy Porter, ed, The Cambridge History of Science: Volume 4: 18th-century Science pp.  680–83               China also developed a large body of traditional medicine. Much of the philosophy of ": null
    },
    {
        "traditional Chinese medicine": "traditional chinese medicine"
    },
    {
        " derived from empirical observations of disease and illness by ": null
    },
    {
        "Taoist": "taoist"
    },
    {
        " physicians and reflects the classical Chinese belief that individual human experiences express causative principles effective in the environment at all scales. These causative principles, whether material, essential, or mystical, correlate as the expression of the natural order of the universe.     The foundational text of Chinese medicine is the ": null
    },
    {
        "Huangdi neijing": "huangdi neijing"
    },
    {
        ", , written 5th century to 3rd century BCE. Unschuld , 1. Near the end of the 2nd century CE, during the Han dynasty, ": null
    },
    {
        "Zhang Zhongjing": "zhang zhongjing"
    },
    {
        ", wrote a  Treatise on Cold Damage , which contains the earliest known reference to the  Neijing Suwen . The ": null
    },
    {
        "Jin Dynasty": "jin dynasty"
    },
    {
        " practitioner and advocate of ": null
    },
    {
        "acupuncture": "acupuncture"
    },
    {
        " and ": null
    },
    {
        "moxibustion": "moxibustion"
    },
    {
        ", ": null
    },
    {
        "Huangfu Mi": "huangfu mi"
    },
    {
        " , also quotes the ": null
    },
    {
        "Yellow Emperor": "yellow emperor"
    },
    {
        " in his Jiayi jing, c. 265. During the ": null
    },
    {
        "Tang Dynasty": "tang dynasty"
    },
    {
        ", the Suwen was expanded and revised and is now the best extant representation of the foundational roots of traditional Chinese medicine. ": null
    },
    {
        "Traditional Chinese Medicine": "traditional chinese medicine"
    },
    {
        " that is based on the use of herbal medicine, acupuncture, massage and other forms of therapy has been practiced in China for thousands of years.     In the 18th century, during the Qing dynasty, there was a proliferation of popular books as well as more advanced encyclopedias on traditional medicine. Jesuit missionaries introduced Western science and medicine to the royal court, although the Chinese physicians ignored them. Frank Dikotter, China in Roy Porter, ed, The Cambridge History of Science: Volume 4: 18th-century Science pp.  695–97     Finally in the 19th century, Western medicine was introduced at the local level by Christian medical missionaries from the ": null
    },
    {
        "London Missionary Society": "london missionary society"
    },
    {
        " , the ": null
    },
    {
        "Methodist": "methodism"
    },
    {
        " Church and the ": null
    },
    {
        "Presbyterian Church ": "presbyterian church in the united states"
    },
    {
        ". ": null
    },
    {
        "Benjamin Hobson": "benjamin hobson"
    },
    {
        " in 1839, set up a highly successful Wai Ai Clinic in Guangzhou, China.  The ": null
    },
    {
        "Hong Kong College of Medicine for Chinese": "hong kong college of medicine for chinese"
    },
    {
        " was founded in 1887 by the ": null
    },
    {
        "London Missionary Society": "london missionary society"
    },
    {
        ", with its first graduate being ": null
    },
    {
        "Sun Yat-sen": "sun yat-sen"
    },
    {
        ", who later led the ": null
    },
    {
        "Chinese Revolution ": "chinese revolution"
    },
    {
        ". The ": null
    },
    {
        "Hong Kong College of Medicine for Chinese": "hong kong college of medicine for chinese"
    },
    {
        " was the forerunner of the School of Medicine of the ": null
    },
    {
        "University of Hong Kong": "university of hong kong"
    },
    {
        ", which started in 1911.     Because of the social custom that men and women should not be near to one another, the women of China were reluctant to be treated by male doctors. The missionaries sent women doctors such as Dr. ": null
    },
    {
        "Mary Hannah Fulton": "mary hannah fulton"
    },
    {
        " . Supported by the Foreign Missions Board of the Presbyterian Church she in 1902 founded the first medical college for women in China, the Hackett Medical College for Women, in Guangzhou.          When reading the ": null
    },
    {
        "Chinese classics": "chinese classics"
    },
    {
        ", it is important for scholars to examine these works from the Chinese perspective. Historians have noted two key aspects of Chinese medical history: understanding conceptual differences when translating the term shén , and observing the history from the perspective of ": null
    },
    {
        "cosmology": "cosmology"
    },
    {
        " rather than biology.      In Chinese classical texts, the term shén is the closest historical translation to the English word body because it sometimes refers to the physical human body in terms of being weighed or measured, but the term is to be understood as an “ensemble of functions” encompassing both the human psyche and emotions.  This concept of the human body is opposed to the European duality of a separate mind and body.  It is critical for scholars to understand the fundamental differences in concepts of the body in order to connect the medical theory of the classics to the “human organism” it is explaining.      Chinese scholars established a correlation between the cosmos and the “human organism.” The basic components of cosmology, qi, yin yang and the Five Phase theory, were used to explain health and disease in texts such as ": null
    },
    {
        "Huangdi neijing": "huangdi neijing"
    },
    {
        ".  ": null
    },
    {
        "Yin and yang": "yin and yang"
    },
    {
        " are the changing factors in cosmology, with ": null
    },
    {
        "qi": "qi"
    },
    {
        " as the vital force or energy of life. The Five phase theory ": null
    },
    {
        "Wu Xing": "wu xing"
    },
    {
        " of the Han dynasty contains the elements wood, fire, earth, metal, and water. By understanding medicine from a cosmology perspective, historians better understand Chinese medical and social classifications such as gender, which was defined by a domination or remission of yang in terms of yin.     These two distinctions are imperative when analyzing the history of traditional Chinese medical science.     A majority of Chinese medical history written after the classical canons comes in the form of primary source case studies where academic physicians record the illness of a particular person and the healing techniques used, as well as their effectiveness.  Historians have noted that Chinese scholars wrote these studies instead of “books of prescriptions or advice manuals;” in their historical and environmental understanding, no two illnesses were alike so the healing strategies of the practitioner was unique every time to the specific diagnosis of the patient.  Medical case studies existed throughout Chinese history, but “individually authored and published case history” was a prominent creation of the Ming Dynasty.  An example such case studies would be the literati physician, Cheng Congzhou, collection of 93 cases published in 1644.           Around 800 BCE ": null
    },
    {
        "Homer": "homer"
    },
    {
        " in ": null
    },
    {
        "The Iliad": "the iliad"
    },
    {
        " gives descriptions of wound treatment by the two sons of ": null
    },
    {
        "Asklepios": "asklepios"
    },
    {
        ", the admirable physicians ": null
    },
    {
        "Podaleirius": "podaleirius"
    },
    {
        " and ": null
    },
    {
        "Machaon": "machaon"
    },
    {
        " and one acting doctor, ": null
    },
    {
        "Patroclus": "patroclus"
    },
    {
        ". Because Machaon is wounded and Podaleirius is in combat ": null
    },
    {
        "Eurypylus": "eurypylus"
    },
    {
        " asks Patroclus to cut out this arrow from my thigh, wash off the blood with warm water and spread soothing ointment on the wound.  Asklepios like ": null
    },
    {
        "Imhotep": "imhotep"
    },
    {
        " becomes god of healing over time.          Temples dedicated to the healer-god ": null
    },
    {
        "Asclepius": "asclepius"
    },
    {
        ", known as  Asclepieia  , functioned as centers of medical advice, prognosis, and healing.  At these shrines, patients would enter a dream-like state of induced sleep known as enkoimesis  not unlike anesthesia, in which they either received guidance from the deity ": null
    },
    {
        "in a dream": "sleep temple"
    },
    {
        " or were cured by surgery.  Asclepeia provided carefully controlled spaces conducive to healing and fulfilled several of the requirements of institutions created for healing. In the Asclepeion of ": null
    },
    {
        "Epidaurus": "epidaurus"
    },
    {
        ", three large marble boards dated to 350 BCE preserve the names, case histories, complaints, and cures of about 70 patients who came to the temple with a problem and shed it there. Some of the surgical cures listed, such as the opening of an abdominal abscess or the removal of traumatic foreign material, are realistic enough to have taken place, but with the patient in a state of enkoimesis induced with the help of soporific substances such as opium. ": null
    },
    {
        "Alcmaeon of Croton": "alcmaeon of croton"
    },
    {
        " wrote on medicine between 500 and 450 BCE. He argued that channels linked the sensory organs to the brain, and it is possible that he discovered one type of channel, the optic nerves, by dissection.        A towering figure in the history of medicine was the physician ": null
    },
    {
        "Hippocrates": "hippocrates"
    },
    {
        " of ": null
    },
    {
        "Kos": "kos"
    },
    {
        " , considered the father of modern medicine.   The ": null
    },
    {
        "Hippocratic Corpus": "hippocratic corpus"
    },
    {
        " is a collection of around seventy early medical works from ancient Greece strongly associated with Hippocrates and his students. Most famously, the Hippocratics invented the ": null
    },
    {
        "Hippocratic Oath": "hippocratic oath"
    },
    {
        " for physicians. Contemporary physicians swear an oath of office which includes aspects found in early editions of the Hippocratic Oath.     ": null
    },
    {
        "Hippocrates": "hippocrates"
    },
    {
        " and his followers were first to describe many diseases and medical conditions. Though ": null
    },
    {
        "humorism": "humorism"
    },
    {
        " as a medical system predates 5th-century Greek medicine, Hippocrates and his students systemetized the thinking that illness can be explained by an imbalance of blood, phlegm, black bile, and yellow bile.  Hippocrates is given credit for the first description of ": null
    },
    {
        "clubbing": "nail clubbing"
    },
    {
        " of the fingers, an important diagnostic sign in chronic suppurative lung disease, ": null
    },
    {
        "lung cancer": "lung cancer"
    },
    {
        " and ": null
    },
    {
        "cyanotic heart disease": "cyanotic heart defect"
    },
    {
        ". For this reason, clubbed fingers are sometimes referred to as Hippocratic fingers .  Hippocrates was also the first physician to describe the ": null
    },
    {
        "Hippocratic face": "hippocratic face"
    },
    {
        " in Prognosis. ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        " famously alludes to this description when writing of ": null
    },
    {
        "Falstaffs": "falstaff"
    },
    {
        "death in Act II, Scene iii. of  Henry V .      Hippocrates began to categorize illnesses as ": null
    },
    {
        "acute": "acute"
    },
    {
        ", ": null
    },
    {
        "chronic": "chronic"
    },
    {
        ", ": null
    },
    {
        "endemic": "endemic"
    },
    {
        " and ": null
    },
    {
        "epidemic": "epidemic"
    },
    {
        ", and use terms such as, exacerbation, ": null
    },
    {
        "relapse": "relapse"
    },
    {
        ", resolution, crisis, ": null
    },
    {
        "paroxysm": "paroxysm"
    },
    {
        ", peak, and ": null
    },
    {
        "convalescence": "convalescence"
    },
    {
        ".        Another of Hippocratess major contributions may be found in his descriptions of the symptomatology, physical findings, surgical treatment and prognosis of ": null
    },
    {
        "thoracic empyema": "empyema"
    },
    {
        ", i.e. ": null
    },
    {
        "suppuration": "suppuration"
    },
    {
        " of the lining of the chest cavity. His teachings remain relevant to present-day students of ": null
    },
    {
        "pulmonary medicine": "pulmonology"
    },
    {
        " and surgery. Hippocrates was the first documented person to practise ": null
    },
    {
        "cardiothoracic surgery": "cardiothoracic surgery"
    },
    {
        ", and his findings are still valid.     Some of the techniques and theories developed by Hippocrates are now put into practice by the fields of Environmental and Integrative Medicine. These include recognizing the importance of taking a complete history which includes environmental exposures as well as foods eaten by the patient which might play a role in his or her illness.          Two great ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        "ns laid the foundations for the scientific study of anatomy and physiology, ": null
    },
    {
        "Herophilus of Chalcedon": "herophilus of chalcedon"
    },
    {
        " and ": null
    },
    {
        "Erasistratus of Ceos": "erasistratus of ceos"
    },
    {
        ".  Other Alexandrian surgeons gave us ligature , ": null
    },
    {
        "lithotomy": "lithotomy"
    },
    {
        ", ": null
    },
    {
        "hernia": "hernia"
    },
    {
        " operations, ": null
    },
    {
        "ophthalmic surgery": "ophthalmic surgery"
    },
    {
        ", ": null
    },
    {
        "plastic surgery": "plastic surgery"
    },
    {
        ", methods of reduction of dislocations and fractures, ": null
    },
    {
        "tracheotomy": "tracheotomy"
    },
    {
        ", and ": null
    },
    {
        "mandrake": "mandrake"
    },
    {
        " as an ": null
    },
    {
        "anaesthetic": "anaesthetic"
    },
    {
        ". Some of what we know of them comes from ": null
    },
    {
        "Celsus": "aulus cornelius celsus"
    },
    {
        " and ": null
    },
    {
        "Galen": "galen"
    },
    {
        " of Pergamum. Galen, On the Natural Faculties, Books I, II, and III, Loeb Classical Library, Harvard, 2000     ": null
    },
    {
        "Herophilus of Chalcedon": "herophilos"
    },
    {
        ", working at the medical school of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " placed intelligence in the brain, and connected the nervous system to motion and sensation. Herophilus also distinguished between ": null
    },
    {
        "veins": "vein"
    },
    {
        "and ": null
    },
    {
        "arteries": "artery"
    },
    {
        ", noting that the latter ": null
    },
    {
        "pulse": "pulse"
    },
    {
        " while the former do not. He and his contemporary, ": null
    },
    {
        "Erasistratus of Chios": "erasistratus"
    },
    {
        ", researched the role of veins and ": null
    },
    {
        "nerve": "nerve"
    },
    {
        "s, mapping their courses across the body. Erasistratus connected the increased complexity of the surface of the human brain compared to other animals to its superior ": null
    },
    {
        "intelligence": "intelligence"
    },
    {
        ". He sometimes employed ": null
    },
    {
        "experiments": "experiment"
    },
    {
        "to further his research, at one time repeatedly weighing a caged bird, and noting its weight loss between feeding times. In ": null
    },
    {
        "Erasistratus": "erasistratus"
    },
    {
        " physiology, air enters the body, is then drawn by the lungs into the heart, where it is transformed into vital spirit, and is then pumped by the arteries throughout the body. Some of this vital spirit reaches the ": null
    },
    {
        "brain": "human brain"
    },
    {
        ", where it is transformed into animal spirit, which is then distributed by the nerves. Mason, A History of the Sciences, p. 57       The Greek ": null
    },
    {
        "Galen": "galen"
    },
    {
        " was one of the greatest physicians of the ancient world, studying and traveling widely in ancient Rome. He dissected animals to learn about the body, and performed many audacious operations—including brain and eye surgeries—that were not tried again for almost two millennia. In Ars medica , he explained mental properties in terms of specific mixtures of the bodily parts.  Rudolph E. Siegel, Galens system of physiology and medicine .     Galens medical works were regarded as authoritative until well into the Middle Ages. Galen left a physiological model of the human body that became the mainstay of the medieval physicians university anatomy curriculum, but it suffered greatly from stasis and intellectual stagnation because some of Galens ideas were incorrect; he did not dissect a human body.  Greek and Roman taboos had meant that dissection was usually banned in ancient times, but in the Middle Ages it changed.       In 1523 Galens On the Natural Faculties was published in London. In the 1530s Belgian anatomist and physician ": null
    },
    {
        "Andreas Vesalius": "andreas vesalius"
    },
    {
        " launched a project to translate many of Galens Greek texts into Latin. Vesaliuss most famous work,  De humani corporis fabrica  was greatly influenced by Galenic writing and form. Peter Dear, Revolutionizing the Sciences: European Knowledge and Its Ambitions, 1500–1700. , 37–39.                 The ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        " invented numerous ": null
    },
    {
        "surgical instruments": "surgical instruments"
    },
    {
        ", including the first instruments unique to women,  as well as the surgical uses of ": null
    },
    {
        "forceps": "forceps"
    },
    {
        ", ": null
    },
    {
        "scalpel": "scalpel"
    },
    {
        "s, ": null
    },
    {
        "cautery": "cauteryhistory"
    },
    {
        ", ": null
    },
    {
        "cross-bladed scissors": "scissors"
    },
    {
        ", the ": null
    },
    {
        "surgical needle": "surgical needle"
    },
    {
        ", the ": null
    },
    {
        "sound": "sound"
    },
    {
        ", and ": null
    },
    {
        "speculas": "speculum"
    },
    {
        ".  ": null
    },
    {
        "William Alexander Greenhill": "william alexander greenhill"
    },
    {
        ",  Romans also performed ": null
    },
    {
        "cataract surgery": "cataract surgery"
    },
    {
        ".      The Roman army physician ": null
    },
    {
        "Dioscorides": "pedanius dioscorides"
    },
    {
        " , was a Greek botanist and pharmacologist. He wrote the encyclopedia  De Materia Medica  describing over 600 herbal cures, forming an influential pharmacopoeia which was used extensively for the following 1,500 years.                 Byzantine medicine encompasses the common medical practices of the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " from about 400 AD to 1453 AD. Byzantine medicine was notable for building upon the knowledge base developed by its Greco-Roman predecessors. In preserving medical practices from antiquity, Byzantine medicine influenced ": null
    },
    {
        "Islamic medicine": "islamic medicine"
    },
    {
        " as well as fostering the Western rebirth of medicine during the Renaissance.     Byzantine physicians often compiled and standardized medical knowledge into textbooks. Their records tended to include both diagnostic explanations and technical drawings. The ": null
    },
    {
        "Medical Compendium in Seven Books": "medical compendium in seven books"
    },
    {
        ", written by the leading physician ": null
    },
    {
        "Paul of Aegina": "paul of aegina"
    },
    {
        ", survived as a particularly thorough source of medical knowledge. This compendium, written in the late seventh century, remained in use as a standard textbook for the following 800 years.     Late antiquity ushered in a revolution in medical science, and historical records often mention civilian hospitals . ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " stood out as a center of medicine during the Middle Ages, which was aided by its crossroads location, wealth, and accumulated knowledge.     The first ever known example of separating conjoined twins occurred in the Byzantine Empire in the 10th century. The next example of separating conjoined twins will be first recorded many centuries later in Germany in 1689.       The ": null
    },
    {
        "Byzantine Empires": "byzantine empire"
    },
    {
        "neighbors, the Persian ": null
    },
    {
        "Sassanid Empire": "sasanian empire"
    },
    {
        ", also made their noteworthy contributions mainly with the establishment of the ": null
    },
    {
        "Academy of Gondeshapur": "academy of gondishapur"
    },
    {
        ", which was the most important medical center of the ancient world during the 6th and 7th centuries.  In addition, ": null
    },
    {
        "Cyril Elgood": "cyril elgood"
    },
    {
        ", British physician and a historian of medicine in Persia, commented that thanks to medical centers like the Academy of Gondeshapur, to a very large extent, the credit for the whole hospital system must be given to Persia.                The ": null
    },
    {
        "Islamic civilization": "islamic golden age"
    },
    {
        " rose to primacy in medical science as its ": null
    },
    {
        "physicians": "physician"
    },
    {
        "contributed significantly to the field of medicine, including ": null
    },
    {
        "anatomy": "anatomy"
    },
    {
        ", ": null
    },
    {
        "ophthalmology": "ophthalmology"
    },
    {
        ", ": null
    },
    {
        "pharmacology": "pharmacology"
    },
    {
        ", ": null
    },
    {
        "pharmacy": "pharmacy"
    },
    {
        ", ": null
    },
    {
        "physiology": "physiology"
    },
    {
        ", ": null
    },
    {
        "surgery": "surgery"
    },
    {
        ", and the ": null
    },
    {
        "pharmaceutical sciences": "pharmaceutical sciences"
    },
    {
        ". The Arabs were influenced by ancient Indian, Persian, Greek, Roman and Byzantine medical practices, and helped them develop further. Medieval Islamic Civilization: An Encyclopedia, by Josef W. Meri, Jere L. Bacharach p.783 ": null
    },
    {
        "Galen": "galen"
    },
    {
        " & ": null
    },
    {
        "Hippocrates": "hippocrates"
    },
    {
        " were pre-eminent authorities. The translation of 129 of Galens works into ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        " by the Nestorian Christian ": null
    },
    {
        "Hunayn ibn Ishaq": "hunayn ibn ishaq"
    },
    {
        " and his assistants, and in particular Galens insistence on a rational systematic approach to medicine, set the template for ": null
    },
    {
        "Islamic medicine": "islamic medicine"
    },
    {
        ", which rapidly spread throughout the ": null
    },
    {
        "Arab Empire": "abbasid caliphate"
    },
    {
        ". ": null
    },
    {
        "George Sarton": "george sarton"
    },
    {
        ", Introduction to the History of Science.  Britains male doctors preferred the old system, but Nightingale won out and her Nightingale Training School opened in 1860 and became a model. The Nightingale solution depended on the patronage of upper class women, and they proved eager to serve. Royalty became involved. In 1902 the wife of the British king took control of the nursing unit of the British army, became its president, and renamed it after herself as the ": null
    },
    {
        "Queen Alexandras Royal Army Nursing Corps": "queen alexandras royal army nursing corps"
    },
    {
        "; when she died the next queen became president. Today its Colonel In Chief is ": null
    },
    {
        "Sophie, Countess of Wessex": "sophie, countess of wessex"
    },
    {
        ", the daughter-in-law of ": null
    },
    {
        "Queen Elizabeth II": "queen elizabeth ii"
    },
    {
        ". In the United States, upper middle class women who already supported hospitals promoted nursing. The new profession proved highly attractive to women of all backgrounds, and schools of nursing opened in the late 19th century. They soon a function of large hospitals, where they provided a steady stream of low-paid idealistic workers. The International Red Cross began operations in numerous countries in the late 19th century, promoting nursing as an ideal profession for middle class women. M. Patricia Donahue, Nursing, The Finest Art: An Illustrated History pp.  112–25     The Nightingale model was widely copied. ": null
    },
    {
        "Linda Richards": "linda richards"
    },
    {
        " studied in London and became the first professionally trained American nurse. She established nursing training programs in the United States and Japan, and created the first system for keeping individual medical records for hospitalized patients.  The Russian Orthodox Church sponsored seven orders of nursing sisters in the late 19th century. They ran hospitals, clinics, almshouses, pharmacies, and shelters as well as training schools for nurses. In the Soviet era , with the aristocratic sponsors gone, nursing became a low-prestige occupation based in poorly maintained hospitals.        It was very difficult for women to become doctors in any field before the 1970s. ": null
    },
    {
        "Elizabeth Blackwell": "elizabeth blackwell"
    },
    {
        " became the first woman to formally study and practice medicine in the United States. She was a leader in womens medical education. While Blackwell viewed medicine as a means for social and moral reform, her student ": null
    },
    {
        "Mary Putnam Jacobi": "mary putnam jacobi"
    },
    {
        " focused on curing disease. At a deeper level of disagreement, Blackwell felt that women would succeed in medicine because of their humane female values, but Jacobi believed that women should participate as the equals of men in all medical specialties using identical methods, values and insights.  In the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " although the majority of medical doctors were women, they were paid less than the mostly male factory workers.        Paris and Vienna were the two leading medical centers on the Continent in the era 1750–1914.     In the 1770s–1850s Paris became a world center of medical research and teaching. The Paris School emphasized that teaching and research should be based in large hospitals and promoted the professionalization of the medical profession and the emphasis on sanitation and public health. A major reformer was ": null
    },
    {
        "Jean-Antoine Chaptal": "jean-antoine chaptal"
    },
    {
        " , a physician who was Minister of Internal Affairs. He created the Paris Hospital, health councils, and other bodies.        ": null
    },
    {
        "Louis Pasteur": "louis pasteur"
    },
    {
        " was one of the most important founders of ": null
    },
    {
        "medical microbiology": "medical microbiology"
    },
    {
        ". He is remembered for his remarkable breakthroughs in the causes and preventions of diseases. His discoveries reduced mortality from ": null
    },
    {
        "puerperal fever": "puerperal fever"
    },
    {
        ", and he created the first ": null
    },
    {
        "vaccines": "vaccine"
    },
    {
        "for ": null
    },
    {
        "rabies": "rabies"
    },
    {
        " and ": null
    },
    {
        "anthrax": "anthrax"
    },
    {
        ". His experiments supported the ": null
    },
    {
        "germ theory of disease": "germ theory of disease"
    },
    {
        ". He was best known to the general public for inventing a method to treat milk and wine in order to prevent it from causing sickness, a process that came to be called ": null
    },
    {
        "pasteurization": "pasteurization"
    },
    {
        ". He is regarded as one of the three main founders of ": null
    },
    {
        "microbiology": "microbiology"
    },
    {
        ", together with ": null
    },
    {
        "Ferdinand Cohn": "ferdinand cohn"
    },
    {
        " and ": null
    },
    {
        "Robert Koch": "robert koch"
    },
    {
        ". He worked chiefly in Paris and in 1887 founded the ": null
    },
    {
        "Pasteur Institute": "pasteur institute"
    },
    {
        " there to perpetuate his commitment to basic research and its practical applications. As soon as his institute was created, Pasteur brought together scientists with various specialties. The first five departments were directed by ": null
    },
    {
        "Emile Duclaux": "emile duclaux"
    },
    {
        "  and ": null
    },
    {
        "Charles Chamberland": "charles chamberland"
    },
    {
        " , as well as a biologist, ": null
    },
    {
        "Ilya Ilyich Mechnikov": "ilya ilyich mechnikov"
    },
    {
        " and two ": null
    },
    {
        "physician": "physician"
    },
    {
        "s, ": null
    },
    {
        "Jacques-Joseph Grancher": "jacques-joseph grancher"
    },
    {
        "  and ": null
    },
    {
        "Emile Roux": "emile roux"
    },
    {
        " . One year after the inauguration of the Institut Pasteur, Roux set up the first course of microbiology ever taught in the world, then entitled Cours de Microbie Technique . It became the model for numerous research centers around the world named Pasteur Institutes. Moira Davison Reynolds,  How Pasteur Changed History: The Story of Louis Pasteur and the Pasteur Institute Paul Weindling, Scientific elites and laboratory organization in fin de siècle Paris and Berlin: The Pasteur Institute and Robert Kochs Institute for Infectious Diseases compared, in Andrew Cunningham and Perry Williams, eds. The Laboratory Revolution in Medicine pp. 170–88.       The First Viennese School of Medicine, 1750–1800, was led by the Dutchman Gerard van Swieten , who aimed to put medicine on new scientific foundations—promoting unprejudiced clinical observation, botanical and chemical research, and introducing simple but powerful remedies. When the Vienna General Hospital opened in 1784, it at once became the worlds largest hospital and physicians acquired a facility that gradually developed into the most important research centre. Progress ended with the Napoleonic wars and the government shutdown in 1819 of all liberal journals and schools; this caused a general return to traditionalism and eclecticism in medicine. Nelly Tsouyopoulos, The Influence of John Browns Ideas in Germany Medical History . Supplement no. 8: pp. 63–74     Vienna was the capital of a diverse empire and attracted not just Germans but Czechs, Hungarians, Jews, Poles and others to its world-class medical facilities. After 1820 the Second Viennese School of Medicine emerged with the contributions of physicians such as Carl Freiherr von Rokitansky , Josef Škoda , Ferdinand Ritter von Hebra , and Ignaz Philipp Semmelweis . Basic medical science expanded and specialization advanced. Furthermore, the first dermatology , eye, as well as ear, nose, and throat clinics in the world were founded in Vienna. The textbook of ophthalmologist Georg Joseph Beer Lehre von den Augenkrankheiten combined practical research and philosophical speculations, and became the standard reference work for decades. Erna Lesky, The Vienna Medical School of the 19th Century       After 1871 Berlin, the capital of the new German Empire, became a leading center for medical research. Robert Koch was a representative leader. He became famous for isolating ": null
    },
    {
        "Bacillus anthracis": "bacillus anthracis"
    },
    {
        " , the ": null
    },
    {
        "Tuberculosis bacillus": "mycobacterium tuberculosis"
    },
    {
        " and ": null
    },
    {
        "Vibrio cholerae": "vibrio cholerae"
    },
    {
        " and for his development of Kochs postulates . He was awarded the Nobel Prize in Physiology or Medicine in 1905 for his tuberculosis findings. Koch is one of the founders of microbiology , inspiring such major figures as Paul Ehrlich and Gerhard Domagk .       thu hospital at Gettysburg , 1863     In the American Civil War , as was typical of the 19th century, more soldiers died of disease than in battle, and even larger numbers were temporarily incapacitated by wounds, disease and accidents. George Worthington Adams, Doctors in Blue: The Medical History of the Union Army in the Civil War , Glenna R. Schroeder-Lein, The Encyclopedia of Civil War Medicine Conditions were poor in the Confederacy , where doctors and medical supplies were in short supply. H.H. Cunningham, Doctors in Gray: The Confederate Medical Service The war had a dramatic long-term impact on medicine in the U.S., from surgical technique to hospitals to nursing and to research facilities. Weapon development -particularly the appearance of Springfield Model 1861 , mass-produced and much more accurate than muskets led to generals underestimating the risks of long range rifle fire; risks exemplified in the death of John Sedgwick and the disastrous Picketts Charge . The rifles could shatter bone forcing amputation and longer ranges meant casualties were sometimes not quickly found. Evacuation of the wounded from Second Battle of Bull Run took a week. As in earlier wars, untreated casualties sometimes survived unexpectedly due to maggots debriding the wound -an observation which led to the surgical use of maggots -still a useful method in the absence of effective antibiotics.     The hygiene of the training and field camps was poor, especially at the beginning of the war when men who had seldom been far from home were brought together for training with thousands of strangers. First came epidemics of the childhood diseases of chicken pox, mumps, whooping cough, and, especially, measles. Operations in the South meant a dangerous and new disease environment, bringing diarrhea, dysentery, typhoid fever, and malaria. There were no antibiotics, so the surgeons prescribed coffee, whiskey, and quinine. Harsh weather, bad water, inadequate shelter in winter quarters, poor policing of camps, and dirty camp hospitals took their toll.     This was a common scenario in wars from time immemorial, and conditions faced by the Confederate army were even worse. The Union responded by building army hospitals in every state. What was different in the Union was the emergence of skilled, well-funded medical organizers who took proactive action, especially in the much enlarged United States Army Medical Department, Mary C. Gillett, The Army Medical Department, 1818–1865 and the United States Sanitary Commission , a new private agency. William Quentin Maxwell, Lincolns Fifth Wheel: The Political History of the U.S. Sanitary Commission Numerous other new agencies also targeted the medical and morale needs of soldiers, including the United States Christian Commission as well as smaller private agencies. Justin Martin, Genius of Place: The Life of Frederick Law Olmsted pp.  178–230     The U.S. Army learned many lessons and in August 1886, it established the Hospital Corps.       thu of the causes of mortality in the army in the East by Florence Nightingale.     A major breakthrough in epidemiology came with the introduction of statistical maps and graphs. They allowed careful analysis of seasonality issues in disease incidents, and the maps allowed public health officials to identify critical loci for the dissemination of disease. John Snow in London developed the methods. In 1849, he observed that the symptoms of cholera, which had already claimed around 500 lives within a month, were vomiting and diarrhoea. He concluded that the source of contamination must be through ingestion, rather than inhalation as was previously thought. It was this insight that resulted in the removal of The Pump On Broad Street, after which deaths from cholera plummeted afterwards. English nurse Florence Nightingale pioneered analysis of large amounts of statistical data, using graphs and tables, regarding the condition of thousands of patients in the Crimean War to evaluate the efficacy of hospital services. Her methods proved convincing and led to reforms in military and civilian hospitals, usually with the full support of the government. Gunn, S. William A.; Masellis, Michele . Concepts and Practice of Humanitarian Medicine. Springer. pp. 87–. . http://www.ph.ucla.edu/epi/snow/Snow_Laura_Ball.pdf     By the late 19th and early 20th century English statisticians led by Francis Galton , Karl Pearson and Ronald Fisher developed the mathematical tools such as correlations and hypothesis tests that made possible much more sophisticated analysis of statistical data.     During the U.S. Civil War the Sanitary Commission collected enormous amounts of statistical data, and opened up the problems of storing information for fast access and mechanically searching for data patterns. The pioneer was John Shaw Billings . A senior surgeon in the war, Billings built the Library of the Surgeon Generals Office , the centerpiece of modern medical information systems. He also built the New York Public Library Billings figured out how to mechanically analyze medical and demographic data by turning facts into numbers and punching the numbers onto cardboard cards that could be sorted and counted by machine. The applications were developed by his assistant Herman Hollerith ; Hollerith invented the punch card and counter-sorter system that dominated statistical data manipulation until the 1970s. Holleriths company became International Business Machines in 1911.             Johns Hopkins Hospital , founded in 1889, originated several modern medical practices, including residency and rounds .       European ideas of modern medicine were spread widely through the world by medical missionaries, and the dissemination of textbooks. Japanese elites enthusiastically embraced Western medicine after the Meiji Restoration of the 1860s. However they had been prepared by their knowledge of the Dutch and German medicine, for they had some contact with Europe through the Dutch. Highly influential was the 1765 edition of Hendrik van Deventers pioneer work Nieuw Ligt on Japanese obstetrics, especially on Katakura Kakuryos publication in 1799 of Sanka Hatsumo . A cadre of Japanese physicians began to interact with Dutch doctors, who introduced smallpox vaccinations. By 1820 Japanese ranpô medical practitioners not only translated Dutch medical texts, they integrated their readings with clinical diagnoses. These men became leaders of the modernization of medicine in their country. They broke from Japanese traditions of closed medical fraternities and adopted the European approach of an open community of collaboration based on expertise in the latest scientific methods. Ann Jannetta, The Vaccinators: Smallpox, Medical Knowledge and the Opening of Japan     Kitasato Shibasaburō studied bacteriology in Germany under Robert Koch . In 1891 he founded the Institute of Infectious Diseases in Tokyo, which introduced the study of bacteriology to Japan. He and French researcher Alexandre Yersin went to Hong Kong in 1894, where; Kitasato confirmed Yersins discovery that the bacterium Yersinia pestis is the agent of the plague. In 1897 he isolates and described the organism that caused dysentery. He became the first dean of medicine at Keio University, and the first president of the Japan Medical Association.     Japanese physicians immediately recognized the values of X-Rays. They were able to purchase the equipment locally from the Shimadzu Company, which developed, manufactured, marketed, and distributed X-Ray machines after 1900. Japan not only adopted German methods of public health in the home islands, but implemented them in its colonies, especially Korea and Taiwan, and after 1931 in Manchuria. A heavy investment in sanitation resulted in a dramatic increase of life expectancy. Michael Shiyung Liu, Prescribing Colonization: The Role of Medical Practices and Policies in Japan-Ruled Taiwan, 1895–1945 286 pp.         thu , founded in 1796, gained international prominence as a centre for moral treatment and a model of asylum reform following the publication of Samuel Tuke s Description of the Retreat .     Until the nineteenth century, the care of the insane was largely a communal and family responsibility rather than a medical one. The vast majority of the mentally ill were treated in domestic contexts with only the most unmanageable or burdensome likely to be institutionally confined. ; ; ; This situation was transformed radically from the late eighteenth century as, amid changing cultural conceptions of madness, a new-found optimism in the curability of insanity within the asylum setting emerged. ; ; Increasingly, lunacy was perceived less as a physiological condition than as a mental and moral one ; to which the correct response was persuasion, aimed at inculcating internal restraint, rather than external coercion. ; This new therapeutic sensibility, referred to as moral treatment , was epitomised in French physician Philippe Pinel s quasi-mythological unchaining of the lunatics of the Bicêtre Hospital in Paris and realised in an institutional setting with the foundation in 1796 of the Quaker-run York Retreat in England.     thu , c. 1850–58. The asylum population in England and Wales rose from 1,027 in 1827 to 74,004 in 1900.     From the early nineteenth century, as lay-led lunacy reform movements gained in influence, ever more state governments in the West extended their authority and responsibility over the mentally ill. Small-scale asylums, conceived as instruments to reshape both the mind and behaviour of the disturbed, proliferated across these regions. ; By the 1830s, moral treatment, together with the asylum itself, became increasingly medicalised ; and asylum doctors began to establish a distinct medical identity with the establishment in the 1840s of associations for their members in France, Germany, the United Kingdom and America, together with the founding of medico-psychological journals. Medical optimism in the capacity of the asylum to cure insanity soured by the close of the nineteenth century as the growth of the asylum population far outstripped that of the general population. ; Processes of long-term institutional segregation, allowing for the psychiatric conceptualisation of the natural course of mental illness, supported the perspective that the insane were a distinct population, subject to mental pathologies stemming from specific medical causes. As degeneration theory grew in influence from the mid-nineteenth century, heredity was seen as the central causal element in chronic mental illness, ; ; and, with national asylum systems overcrowded and insanity apparently undergoing an inexorable rise, the focus of psychiatric therapeutics shifted from a concern with treating the individual to maintaining the racial and biological health of national populations. ; ; ; ;     Emil Kraepelin introduced new medical categories of mental illness , which eventually came into psychiatric usage despite their basis in behavior rather than pathology or underlying cause . Shell shock among frontline soldiers exposed to heavy artillery bombardment was first diagnosed by British Army doctors in 1915. By 1916, similar symptoms were also noted in soldiers not exposed to explosive shocks, leading to questions as to whether the disorder was physical or psychiatric. In the 1920s surrealist opposition to psychiatry was expressed in a number of surrealist publications. In the 1930s several controversial medical practices were introduced including inducing seizures or cutting parts of the brain apart . Both came into widespread use by psychiatry, but there were grave concerns and much opposition on grounds of basic morality, harmful effects, or misuse. G. E. Berrios and Roy Porter The History of Clinical Psychiatry     In the 1950s new psychiatric drugs , notably the antipsychotic chlorpromazine , were designed in laboratories and slowly came into preferred use. Although often accepted as an advance in some ways, there was some opposition, due to serious adverse effects such as tardive dyskinesia . Patients often opposed psychiatry and refused or stopped taking the drugs when not subject to psychiatric control. There was also increasing opposition to the use of psychiatric hospitals, and attempts to move people back into the community on a collaborative user-led group approach not controlled by psychiatry. Campaigns against masturbation were done in the Victorian era and elsewhere. Lobotomy was used until the 1970s to treat schizophrenia . This was denounced by the anti-psychiatric movement in the 1960s and later.           The ABO blood group system was discovered in 1901, and the Rhesus blood group system in 1937, facilitating blood transfusion .     During the 20th century, large-scale wars were attended with medic s and mobile hospital units which developed advanced techniques for healing massive injuries and controlling infections rampant in battlefield conditions. During the Mexican Revolution , General Pancho Villa organized hospital trains for wounded soldiers. Boxcars marked Servicio Sanitario were re-purposed as surgical operating theaters and areas for recuperation, and staffed by up to 40 Mexican and U.S. physicians. Severely wounded soldiers were shuttled back to base hospitals. Friedrich Katz , The Life and Times of Pancho Villa. Stanford: Stanford University Press 1998, 292. Canadian physician Norman Bethune , M.D. developed a mobile blood-transfusion service for frontline operations in the Spanish Civil War , but ironically, he himself died of blood poisoning.   Thousands of scarred troops provided the need for improved prosthetic limb s and expanded techniques in plastic surgery or reconstructive surgery . Those practices were combined to broaden cosmetic surgery and other forms of elective surgery .     During the second World War , Alexis Carrel and Henry Dakin developed the Carrel-Dakin method of treating wounds with an irrigation, Dakins solution, a germicide which helped prevent gangrene . Mark Harrison, The Medical War: British Military Medicine in the First World War     The War spurred the usage of Roentgen s X-ray , and the electrocardiograph , for the monitoring of internal bodily functions. This was followed in the inter-war period by the development of the first anti-bacterial agents such as the sulpha antibiotics.         Public health measures become particular important during the 1918 flu pandemic , which killed at least 50 million people around the world. John M. Barry, The Great Influenza: The Story of the Deadliest Pandemic in History It became an important case study in epidemiology . Fred R. Van Hartesveldt, The Doctors and the Flu: The British Medical Professions Response to the Influenza Pandemic of 1918–19, International Social Science Review 851 pp.  28–39, online Bristow shows there was a gendered response of health caregivers to the pandemic in the United States. Male doctors were unable to cure the patients, and they felt like failures. Women nurses also saw their patients die, but they took pride in their success in fulfilling their professional role of caring for, ministering, comforting, and easing the last hours of their patients, and helping the families of the patients cope as well. Nancy K. Bristow, American Pandemic: The Lost Worlds of the 1918 Influenza Epidemic     From 1917 to 1923, the American Red Cross moved into Europe with a battery of long-term child health projects. It built and operated hospitals and clinics, and organized antituberculosis and antityphus campaigns. A high priority involved child health programs such as clinics, better baby shows, playgrounds, fresh air camps, and courses for women on infant hygiene. Hundreds of U.S. doctors, nurses, and welfare professionals administered these programs, which aimed to reform the health of European youth and to reshape European public health and welfare along American lines. Julia F. Irwin, Sauvons les Bébés: Child Health and U.S. Humanitarian Aid in the First World War Era, Bulletin of the History of Medicine 861 pp.  37–65. John F. Hutchinson, Champions of Charity: War and the Rise of the Red Cross , pp. 224–77       thu during the Pacific War , 1943. Major wars showed the need for effective hygiene and medical treatment.     The advances in medicine made a dramatic difference for Allied troops, while the Germans and especially the Japanese and Chinese suffered from a severe lack of newer medicines, techniques and facilities. Harrison finds that the chances of recovery for a badly wounded British infantryman were as much as 25 times better than in the First World War. The reason was that:   : By 1944 most casualties were receiving treatment within hours of wounding, due to the increased mobility of field hospitals and the extensive use of aeroplanes as ambulances. The care of the sick and wounded had also been revolutionized by new medical technologies, such as active immunization against tetanus, sulphonamide drugs, and penicillin. Mark Harrison, Medicine and Victory: British Military Medicine in the Second World War p. 275       Unethical human subject research , and killing of patients with disabilities, peaked during the Nazi era, with Nazi human experimentation and Aktion T4 during the Holocaust as the most significant examples. Many of the details of these and related events were the focus of the Doctors Trial . Subsequently, principles of medical ethics , such as the Nuremberg Code , were introduced to prevent a recurrence of such atrocities. Horst H. Freyhofer, The Nuremberg Medical Trial: The Holocaust and the Origin of the Nuremberg Medical Code After 1937, the Japanese Army established programs of biological warfare in China. In Unit 731 , Japanese doctors and research scientists conducted large numbers of vivisections and experiments on human beings, mostly Chinese victims. Jing Bao Nie, et al.  Japans Wartime Medical Atrocities: Comparative Inquiries in Science, History, and Ethics         Starting in World War II, DDT was used as insecticide to combat insect vector s carrying malaria , which was endemic in most tropical regions of the world. James L.A. Webb Jr., Humanitys Burden: A Global History of Malaria ; Randall M. Packard, The Making of a Tropical Disease: A Short History of Malaria ; Leo B. Slater, War and Disease: Biomedical Research on Malaria in the Twentieth Century . The first goal was to protect soldiers, but it was widely adopted as a public health device. In Liberia, for example, the United States had large military operations during the war and the U.S. Public Health Service began the use of DDT for indoor residual spraying and as a larvicide, with the goal of controlling malaria in Monrovia, the Liberian capital. In the early 1950s, the project was expanded to nearby villages. In 1953, the World Health Organization launched an antimalaria program in parts of Liberia as a pilot project to determine the feasibility of malaria eradication in tropical Africa. However these projects encountered a spate of difficulties that foreshadowed the general retreat from malaria eradication efforts across tropical Africa by the mid-1960s. James L.A. Webb, The First Large-Scale Use of Synthetic Insecticide for Malaria Control in Tropical Africa: Lessons from Liberia, 1945–1962, Journal of the History of Medicine & Allied Sciences": null
    }
]