[
    {
        "The original inhabitants of ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        " were the ": null
    },
    {
        "Bafour": "bafour"
    },
    {
        ", presumably a ": null
    },
    {
        "Mande": "mande people"
    },
    {
        " ethnic group, connected to the contemporary ": null
    },
    {
        "Arabized": "arabized"
    },
    {
        " minor social group of  Imraguen  on the Atlantic coast.     The territory of Mauritania was on the fringe of geographical knowledge of ": null
    },
    {
        "Libya": "ancient libya"
    },
    {
        " in classical antiquity. ": null
    },
    {
        "Berber": "berber people"
    },
    {
        " immigration took place from about the 3rd century. Mauritania takes its name from the ancient Berber kingdom and later Roman province of ": null
    },
    {
        "Mauretania": "mauretania"
    },
    {
        ", and thus ultimately from the ": null
    },
    {
        "Mauri people": "mauri people"
    },
    {
        ", even though the respective territories do not overlap, historical Mauritania being considerably further north than modern Mauritania.     The ": null
    },
    {
        "Muslim conquest of the Maghreb": "muslim conquest of the maghreb"
    },
    {
        " in the 7th and 8th centuries did not reach as far south, and Islam came to Mauritania only gradually, from about the 11th century, in the context of the wider ": null
    },
    {
        "Islamization of the Sudan": "islamization of the sudan"
    },
    {
        " and medieval ": null
    },
    {
        "Arab slave trade": "arab slave trade"
    },
    {
        ".     The European ": null
    },
    {
        "colonial powers": "colonialism"
    },
    {
        " of the 19th century had little interest in Mauritania. The French Republic was mostly interested in the territory for strategic reason, as a connection between their possessions in North and in West Africa. Mauritania thus became part of ": null
    },
    {
        "French West Africa": "french west africa"
    },
    {
        " in 1904, but colonial control was mostly limited to the coast and the Saharan trade routes, and there were territories nominally within French West Africa which were not reached by European control as late as 1955.     In 1960, the Republic of Mauritania became independent of France. The conflict over the former Spanish territory of ": null
    },
    {
        "Western Sahara": "western sahara"
    },
    {
        " in 1976 resulted in partial annexation by Mauritania, withdrawn in favour of Morocco in 1979. The long-serving dictator ": null
    },
    {
        "Maaouya Ould SidAhmed Taya": "maaouya ould sidahmed taya"
    },
    {
        " was ousted by the ": null
    },
    {
        "military of Mauritania": "military of mauritania"
    },
    {
        " and replaced by the ": null
    },
    {
        "Military Council for Justice and Democracy": "military council for justice and democracy"
    },
    {
        " in a ": null
    },
    {
        "coup détat in 2005": "2005 mauritanian coup détat"
    },
    {
        ". A new constitution was passed in 2006. An indecisive election in 2007 triggered ": null
    },
    {
        "another coup in 2008": "2008 mauritanian coup détat"
    },
    {
        ". A leader of the 2005 coup, ": null
    },
    {
        "Mohamed Ould Abdel Aziz": "mohamed ould abdel aziz"
    },
    {
        ", was ": null
    },
    {
        "elected president in 2009": "mauritanian presidential election, 2009"
    },
    {
        ".            The ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        " has linked rather than divided the peoples who inhabit it and has served as an avenue for migration and conquest. Mauritania, lying next to the Atlantic coast at the western edge of the desert, received and assimilated into its complex society many waves of these migrants and conquerors.     What is now Mauritania was a dry savanna area during ": null
    },
    {
        "classical antiquity": "classical antiquity"
    },
    {
        ", where independent tribes like the Pharusii and the Perorsi did a seminomadic life facing a growing desertification.     ": null
    },
    {
        "Romans": "roman empire"
    },
    {
        " did ": null
    },
    {
        "explorations": "roman expeditions to sub-saharan africa"
    },
    {
        " toward this area and probably reached, with ": null
    },
    {
        "Suetonius Paulinus": "suetonius paulinus"
    },
    {
        ", the area of ": null
    },
    {
        "Adrar": "adrar plateau"
    },
    {
        ". There is evidence of Roman commerce in ": null
    },
    {
        "Akjoujt": "akjoujt"
    },
    {
        " and Tamkartkart near ": null
    },
    {
        "Tichit": "tichit"
    },
    {
        ".      ": null
    },
    {
        "Berbers": "berber people"
    },
    {
        " moved south to Mauritania beginning in the 3rd century, followed by Arabs in the 8th century, subjugating and assimilating Mauritanias original inhabitants. From the 8th through the 15th century, black kingdoms of the western ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        ", such as Ghana, Mali, and Songhai, brought their political culture from the south. Warner, Rachel. Historical setting . In  . ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " Federal Research Division": "federal research division"
    },
    {
        " . This article incorporates text from this source, which is in the public domain.     The divisive tendencies of the various groups within Mauritanian society have always worked against the development of Mauritanian unity. Both the ": null
    },
    {
        "Sanhadja Confederation": "sanhadja confederation"
    },
    {
        ", at its height from the 8th to the 10th century, and the ": null
    },
    {
        "Almoravid Empire": "almoravid empire"
    },
    {
        ", from the 11th to the 12th century, were weakened by internecine warfare, and both succumbed to further invasions from the ": null
    },
    {
        "Ghana Empire": "ghana empire"
    },
    {
        " and the ": null
    },
    {
        "Almohad Empire": "almohad empire"
    },
    {
        ", respectively.       The ": null
    },
    {
        "Islamization": "islamization"
    },
    {
        " of Mauritania was a gradual process that spanned more than 500 years. Beginning slowly through contacts with Berber and Arab merchants engaged in the important caravan trades and rapidly advancing through the Almoravid conquests, Islamization did not take firm hold until the arrival of Yemeni Arabs in the 12th and 13th centuries and was not complete until several centuries later. Gradual Islamization was accompanied by a process of ": null
    },
    {
        "Arabization": "arabization"
    },
    {
        " as well, during which the Berber masters of Mauritania lost power and became vassals of their Arab conquerors.     From the 15th to the 19th century, European contact with Mauritania was dominated by the trade for ": null
    },
    {
        "gum arabic": "gum arabic"
    },
    {
        ". Rivalries among European powers enabled the Arab-Berber population, the ": null
    },
    {
        "Maures": "maures"
    },
    {
        " , to maintain their independence and later to exact annual payments from France, whose sovereignty over the ": null
    },
    {
        "Senegal River": "senegal river"
    },
    {
        " and the Mauritanian coast was recognized by the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " in 1815. Although penetration beyond the coast and the Senegal River began in earnest under Louis Faidherbe, governor of Senegal in the mid-19th century, European conquest or pacification of the entire country did not begin until 1900. Because extensive European contact began so late in the countrys history, the traditional social structure carried over into modern times with little change.               The history of ": null
    },
    {
        "French colonial policy": "french colonial empire"
    },
    {
        " in Mauritania is closely tied to that of the other French possessions in West Africa, particularly to that of ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        ", on which Mauritania was economically, politically, and administratively dependent until independence. The French policy of assimilation and direct rule, however, was never applied with any vigor in Mauritania, where a system that corresponded more to ": null
    },
    {
        "Britains colonial policies": "british colonial empire"
    },
    {
        " of association and indirect rule developed. Colonial administrators relied extensively on Islamic religious leaders and the traditional warrior groups to maintain their rule and carry out their policies. Moreover, little attempt was made to develop the countrys economy.     After World War II, Mauritania, along with the rest of ": null
    },
    {
        "French West Africa": "french west africa"
    },
    {
        ", was involved in a series of reforms of the French colonial system, culminating in independence in 1960. These reforms were part of a trend away from the official policies of assimilation and direct rule in favor of administrative ": null
    },
    {
        "decentralization": "decentralization"
    },
    {
        " and internal autonomy. Although the ": null
    },
    {
        "nationalistic": "nationalistic"
    },
    {
        " fervor sweeping French West Africa at this time was largely absent in Mauritania, continuous politicking provided training for political leaders and awakened a political consciousness among the populace. On 28 July 1960 France agreed to Mauritania becoming fully independent.  Nevertheless, when Mauritania declared its independence on 28 November 1960, its level of political as well as economic development was, at best, embryonic.             As the country gained independence on November 28, 1960, the capital city ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        " was founded at the site of a small colonial village, the Ksar, while 90% of the population was still ": null
    },
    {
        "nomad": "nomad"
    },
    {
        "ic. With independence, larger numbers of ethnic ": null
    },
    {
        "Sub-Saharan Africa": "sub-saharan africa"
    },
    {
        "ns  entered Mauritania, moving into the area north of the ": null
    },
    {
        "Senegal River": "senegal river"
    },
    {
        ". As before independence, the sedentary lifestyle of these groups made them more receptive to and useful in state formation, and they quickly came to dominate state administration, even if the Moorish groups built up by the French remained in charge of the political process. Moors reacted to this change by increasing pressures for ": null
    },
    {
        "Arabization": "arabization"
    },
    {
        ", to Arabicize many aspects of Mauritanian life, such as law and language, and ethnic tension built up – helped by a common memory of warfare and slave raids.     ": null
    },
    {
        "President": "president of mauritania"
    },
    {
        " Moktar Ould Daddah": "moktar ould daddah"
    },
    {
        ", originally helped to the post by the French, rapidly reformed Mauritania into an authoritarian ": null
    },
    {
        "one-party state": "one-party state"
    },
    {
        " in 1964, with his new ": null
    },
    {
        "constitution": "constitution of mauritania"
    },
    {
        ". Daddahs own ": null
    },
    {
        "Parti du Peuple Mauritanien": "parti du peuple mauritanien"
    },
    {
        " became the ruling organization. The President justified this decision on the grounds that he considered Mauritania unready for western-style ": null
    },
    {
        "multi-party democracy": "multi-party system"
    },
    {
        ". Under this one-party constitution, Daddah was reelected in uncontested elections in 1966, 1971 and 1976.     To take advantage of the countrys sizable ": null
    },
    {
        "iron ore": "iron ore"
    },
    {
        " deposits in ": null
    },
    {
        "Zouérat": "zouérat"
    },
    {
        ", the new government built a 675-km railway and a ": null
    },
    {
        "mining": "mining"
    },
    {
        " port. Production began in 1963. The mines were operated by a foreign owned consortium that paid its approximately 3,000 expatriate workers handsomely – their salaries accounted for two-thirds of the countrys entire wages bill. When the Mauritanian miners went on a two-month ": null
    },
    {
        "strike": "strike action"
    },
    {
        " in the late 1960s the ": null
    },
    {
        "army": "military of mauritania"
    },
    {
        " intervened and eight miners were killed. ": null
    },
    {
        "Left-wing": "left-wing"
    },
    {
        " opposition to the government mounted and some miners formed a clandestine ": null
    },
    {
        "Marxist": "marxist"
    },
    {
        " union in 1973. President Ould Daddah survived the challenge from left-wing opponents by nationalising the company in 1974 and withdrawing from the ": null
    },
    {
        "franc": "franc"
    },
    {
        " zone, substituting the ": null
    },
    {
        "ouguiya": "ouguiya"
    },
    {
        " for the CFA.     In 1975, partly for nationalist reasons and partly for fear of ": null
    },
    {
        "Moroccan expansionism": "greater morocco"
    },
    {
        ",  Mauritania invaded and ": null
    },
    {
        "annexed": "annexation"
    },
    {
        " the southern third of the former ": null
    },
    {
        "Spanish Sahara": "spanish sahara"
    },
    {
        "  in 1975, renaming it ": null
    },
    {
        "Tiris al-Gharbiyya": "tiris al-gharbiyya"
    },
    {
        ". However, after nearly three years of raids by the ": null
    },
    {
        "Sahrawi": "sahrawi people"
    },
    {
        "guerrillas": "guerrilla warfare"
    },
    {
        "of the ": null
    },
    {
        "Polisario Front": "polisario front"
    },
    {
        ", Mauritanias economic and political stability began to crumble. Despite ": null
    },
    {
        "French and Moroccan military aid": "opération lamantin"
    },
    {
        ", Polisario raids against the Zouerate railway and mines threatened to bring about economic collapse, and there were deep misgivings in the military about the Saharan adventure. Ethnic unrest contributed to the disarray. Black Africans from the south were ": null
    },
    {
        "conscripted": "conscription"
    },
    {
        " as front-line soldiers, after the northern Sahrawi minorities and their Moorish kin had proven unreliable in the fight against Polisario, but many of the southerners rebelled against having to fight what they considered an inter-Arab war. After the government quarters in Nouakchott had twice been shelled by Polisario forces, unrest simmered, but Daddahs only response was to further tighten his hold on power.     On July 10, 1978, ": null
    },
    {
        "Col.": "col."
    },
    {
        " Mustafa Ould Salek": "mustafa ould salek"
    },
    {
        " led a bloodless ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        " that ousted the President, who would later go into exile in France. Power passed to the military strongmen of the ": null
    },
    {
        "Military Committee for National Recovery": "military committee for national recovery"
    },
    {
        " . Polisario immediately declared a ": null
    },
    {
        "cease-fire": "cease-fire"
    },
    {
        ", and peace negotiations began under the sponsorship of Polisarios main backer, ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        ". With the CMSNs leader reluctant to break with France and Mauritania, the country refused to give in to Polisario demands for a troop retreat, and Ould Saleks careless handling of the ethnic issue  contributed to further unrest. In early 1979, he was pushed aside by another group of officers, who renamed the junta the ": null
    },
    {
        "Military Committee for National Salvation": "military committee for national salvation"
    },
    {
        " . Col. ": null
    },
    {
        "Mohamed Khouna Ould Haidalla": "mohamed khouna ould haidalla"
    },
    {
        " soon emerged as its main strongman.             In 1979, Polisario broke off the cease-fire and unleashed a string of new attacks on military and government targets. Mauritania, under its new government, immediately returned to the table to meet Polisarios goals, declaring full peace, a troop retreat, relinquishing their portion of Western Sahara and recognizing the Front as the Sahrawi peoples sole representative. Morocco, occupying the northern half of Western Sahara and also involved in combat against Polisario, reacted with outrage, and launched a failed 1981 coup against the CMSN. Mauritania broke off relations with ": null
    },
    {
        "Rabat": "rabat"
    },
    {
        " in protest, although ties were later restored.     In interior policy, Haidallah sought to improve relations between White Moors and Black Moors, among other things officially decreeing the ban of ": null
    },
    {
        "slavery": "slavery"
    },
    {
        " for the first time in the countrys history, but he neither tried nor achieved a radical break with the sectarian and discriminating policies of previous regimes. An attempt to reinstate civilian rule was abandoned after the above-mentioned Moroccan-sponsored coup attempt nearly brought down the regime; foreign-backed plots also involved ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        " countries and ": null
    },
    {
        "Libya": "libya"
    },
    {
        ", and the country several times appeared to be under military threat from Morocco.     With Haidallahs ambitious political and social reform program undone by continuing instability, regime inefficiency and a plethora of coup attempts and intrigues from within the military establishment, the CMSN chairman turned increasingly autocratic, excluding other junta officers from power, and provoking discontent by frequently reshuffling the power hierarchy to prevent threats to his position.     On December 12, 1984, ": null
    },
    {
        "Maaouya Ould SidAhmed Taya": "maaouya ould sidahmed taya"
    },
    {
        " deposed Haidallah and declared himself Chairman of the CMSN. Like other rulers before him, he promised a swift transfer to ": null
    },
    {
        "democracy": "democracy"
    },
    {
        ", but then made little of these promises.     The discord between conflicting visions of Mauritanian society as either black or Arab, again rose to the surface during the inter-communal violence that broke out in April 1989 , when a ": null
    },
    {
        "Mauritania–Senegal border dispute": "mauritania–senegal border war"
    },
    {
        " escalated into violence between the two communities. Tens of thousands of black Mauritanians fled or were expelled from the country, and many ": null
    },
    {
        "remain in Senegal": "mauritanians in senegal"
    },
    {
        " as ": null
    },
    {
        "refugee": "refugee"
    },
    {
        "s. This is also where the black Mauritanian movement ": null
    },
    {
        "FLAM": "african liberation forces of mauritania"
    },
    {
        " is based. Although tension has since subsided, the Arab-African racial tension remains an important feature of the political dialog today. The country continues to experience ethnic tensions between its black minority population and the dominant ": null
    },
    {
        "Mauri": "mauri people"
    },
    {
        " populace. A significant number from both groups, however, seek a more diverse, pluralistic society.          Opposition parties were legalized and a new constitution approved in 1991 which put an end to formal military rule. However, Ould Tayas election wins were dismissed as fraudulent by both opposition groups and external observers. In 1998, Mauritania became the third Arab country to recognize ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", despite strong internal opposition.     In 2001, elections incorporated more safeguards against voter fraud, but opposition candidate ": null
    },
    {
        "Mohamed Khouna Ould Haidallah": "mohamed khouna ould haidallah"
    },
    {
        " was nevertheless arrested prior to election day on charges of planning a coup, released the same day and rearrested after the election. Attempted military coups and unrest instigated by ": null
    },
    {
        "Islamist": "islamist"
    },
    {
        " opponents of the regime marred the early years of the 21st century, and the Taya regimes heavy-handed crackdowns were criticized by ": null
    },
    {
        "human rights": "human rights"
    },
    {
        " groups.     On June 8, 2003, a failed coup attempt was made against President ": null
    },
    {
        "Maaouya Ould SidAhmed Taya": "maaouya ould sidahmed taya"
    },
    {
        " by forces unhappy with his imprisonment of Islamic leaders in the wake of the ": null
    },
    {
        "US-led invasion of Iraq": "2003 invasion of iraq"
    },
    {
        " and his establishment of full diplomatic relations with Israel. The coup was suppressed after one day of fighting in the capital when pro-Taya military forces arrived from the countryside. A number of government officials were detained after the coup including the head of the Supreme Court, ": null
    },
    {
        "Mahfoud Ould Lemrabott": "mahfoud ould lemrabott"
    },
    {
        ", and the Secretary of State for Womens Affairs, ": null
    },
    {
        "Mintata Mint Hedeid": "mintata mint hedeid"
    },
    {
        ". The coup leader, ": null
    },
    {
        "Saleh Ould Hanenna": "saleh ould hanenna"
    },
    {
        ", a former army colonel sacked for opposing Tayas pro-Israel policies, was not captured or killed during the coup.      On August 3, 2005, the Mauritanian military, including members of the presidential guard, seized control of key points in the capital of ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        ", performing a ": null
    },
    {
        "coup": "coup"
    },
    {
        " against the government of President ": null
    },
    {
        "Maaouya Ould SidAhmed Taya": "maaouya ould sidahmed taya"
    },
    {
        " who was out of the country attending the funeral of ": null
    },
    {
        "Saudi": "saudi arabia"
    },
    {
        " King Fahd": "king fahd"
    },
    {
        ". The officers released the following statement:     The national armed forces and security forces have unanimously decided to put a definitive end to the oppressive activities of the defunct authority, which our people have suffered from during the past years.      Taya was never able to return to the country and remains in exile. The new ": null
    },
    {
        "junta": "military dictatorship"
    },
    {
        " called itself the  Military Council for Justice and Democracy , and democracy and ": null
    },
    {
        "rule of law": "rule of law"
    },
    {
        ". ": null
    },
    {
        "Col.": "col."
    },
    {
        ". ": null
    },
    {
        "Ely Ould Mohamed Vall": "ely ould mohamed vall"
    },
    {
        " emerged as leader at an early stage. ": null
    },
    {
        "Dissidents": "dissident"
    },
    {
        "were released, and the political climate relaxed. A new constitution was approved in June 2006. ": null
    },
    {
        "Elections": "mauritanian presidential election, 2007"
    },
    {
        " were held in March 2007, ": null
    },
    {
        "Sidi Ould Cheikh Abdallahi": "sidi ould cheikh abdallahi"
    },
    {
        " was elected president and Vall stood down.     On August 6, 2008, Mauritanias presidential spokesman Abdoulaye Mamadouba said President ": null
    },
    {
        "Sidi Ould Cheikh Abdallahi": "sidi ould cheikh abdallahi"
    },
    {
        ", Prime Minister ": null
    },
    {
        "Yahya Ould Ahmed El Waghef": "yahya ould ahmed el waghef"
    },
    {
        " and the interior minister were arrested by renegade Senior Mauritanian army officers, unknown troops and a group of generals and were held under house arrest at the presidential palace in ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        ".    In the apparently successful and bloodless ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        ", Abdallahi daughter, Amal Mint Cheikh Abdallahi said: The security agents of the BASEP came to our home and took away my father.  The coup plotters are top fired Mauritanias security forces, which include General Muhammad Ould Abd Al-Aziz, General Muhammad Ould Al-Ghazwani, General Philippe Swikri, and Brigadier General Ahmad Ould Bakri.  Mauritanian lawmaker, Mohammed Al Mukhtar, announced that many of the countrys people were supporting the takeover attempt and the government is an authoritarian regime and that the president had marginalized the majority in parliament. ": null
    }
]