[
    {
        "   The history of ": null
    },
    {
        "London": "london"
    },
    {
        ", the capital city of ": null
    },
    {
        "England": "england"
    },
    {
        " and the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", extends over 2000 years. In that time, it has become one of the worlds most significant financial and cultural capital cities. It has withstood ": null
    },
    {
        "plague": "great plague of london"
    },
    {
        ", devastating ": null
    },
    {
        "fire": "great fire of london"
    },
    {
        ", ": null
    },
    {
        "civil war": "english civil war"
    },
    {
        ", ": null
    },
    {
        "aerial bombardment": "the blitz"
    },
    {
        ", ": null
    },
    {
        "terrorist attacks": "list of terrorist incidents in london"
    },
    {
        ", and ": null
    },
    {
        "riots": "list of riots in london"
    },
    {
        ".     The ": null
    },
    {
        "City of London": "city of london"
    },
    {
        ", often referred to simply as the City , is the historic core of the ": null
    },
    {
        "Greater London metropolis": "greater london built-up area"
    },
    {
        ", and is today its primary financial district, though it represents only a small part of the wider metropolis.       According to  Historia Regum Britanniae , by ": null
    },
    {
        "Geoffrey of Monmouth": "geoffrey of monmouth"
    },
    {
        ", London was found by ": null
    },
    {
        "Brutus of Troy": "brutus of troy"
    },
    {
        " about 1000–1100  B.C.E. after he defeated the native giant ": null
    },
    {
        "Gogmagog": "gogmagog"
    },
    {
        "; the settlement was known as ,  , which, according to a pseudo-etymology, was corrupted to  Trinovantum . ": null
    },
    {
        "Trinovantes": "trinovantes"
    },
    {
        " were the ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " tribe who inhabited the area prior to the Romans. Geoffrey provides prehistoric London with a rich array of legendary kings, such as ": null
    },
    {
        "Lud": "lud son of heli"
    },
    {
        "  who, he claims, renamed the town Caer Ludein, from which London was derived, and was buried at ": null
    },
    {
        "Ludgate": "ludgate"
    },
    {
        ".     Some recent discoveries indicate probable very early settlements near the Thames in the London area. In 1993, the remains of a ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " bridge were found on the Thamess south foreshore, upstream of ": null
    },
    {
        "Vauxhall Bridge": "vauxhall bridge"
    },
    {
        ".  This bridge either crossed the Thames, or went to a now lost island in the river. ": null
    },
    {
        "Dendrology": "dendrology"
    },
    {
        " dated the timbers to between 1750 B.C.E and 1285 B.C.E. URL:. Accessed: 2018-06-23.  In 2001, a further dig found that the timbers were driven vertically into the ground on the south bank of the ": null
    },
    {
        "Thames": "thames"
    },
    {
        " west of Vauxhall Bridge.  In 2010, the foundations of a large timber structure, dated to between 4,800 B.C.E. and 4,500 B.C.E. Londons Oldest Prehistoric Structure. BAJR. 2018-07-06. URL:. Accessed: 2018-07-06. were found, again on the foreshore south of Vauxhall Bridge.  The function of the mesolithic structure is not known. All these structures are on the south bank at a natural crossing point where the ": null
    },
    {
        "River Effra": "river effra"
    },
    {
        " flows into the Thames.     It is thought that the Thames was an important tribal boundary, and numerous finds have been made of ": null
    },
    {
        "spear": "spear"
    },
    {
        " heads and weaponry from the Bronze and Iron Ages near the banks of the Thames in the London area, many of which had clearly been used in battle.       Archaeologist Leslie Wallace notes that Because no ": null
    },
    {
        "LPRIA": "prehistoric britainlate pre-roman iron age"
    },
    {
        " settlements or significant domestic refuse have been found in London, despite extensive archaeological excavation, arguments for a purely Roman foundation of London are now common and uncontroversial.                      Londinium was established as a civilian town by the ": null
    },
    {
        "Romans": "roman empire"
    },
    {
        " about four years . Archaeology Data Service, The University of York. after the ": null
    },
    {
        "invasion of AD 43": "roman conquest of britain"
    },
    {
        ". London, like Rome, was founded on the point of the river where it was narrow enough to bridge and the strategic location of the city provided easy access to much of Europe. Early Roman London occupied a relatively small area, roughly equivalent to the size of ": null
    },
    {
        "Hyde Park": "hyde park, london"
    },
    {
        ". In around AD 60, it was destroyed by the ": null
    },
    {
        "Iceni": "iceni"
    },
    {
        " led by their queen ": null
    },
    {
        "Boudica": "boudica"
    },
    {
        ". The city was quickly rebuilt as a planned Roman town and recovered after perhaps 10 years, the city growing rapidly over the following decades.     During the 2nd century Londinium was at its height and replaced ": null
    },
    {
        "Colchester": "camulodunum"
    },
    {
        " as the capital of ": null
    },
    {
        "Roman Britain": "roman britain"
    },
    {
        " . Its population was around 60,000 inhabitants. It boasted major public buildings, including the largest ": null
    },
    {
        "basilica": "basilica"
    },
    {
        " north of the Alps, ": null
    },
    {
        "temples": "roman temple"
    },
    {
        ", ": null
    },
    {
        "bath houses": "thermae"
    },
    {
        ", an ": null
    },
    {
        "amphitheatre": "amphitheatre"
    },
    {
        " and a large ": null
    },
    {
        "fort": "fort"
    },
    {
        " for the city garrison. Political instability and recession from the 3rd century onwards led to a slow decline.     At some time between AD 180 and AD 225, the Romans built the defensive ": null
    },
    {
        "London Wall": "london wall"
    },
    {
        " around the landward side of the city. The wall was about  long,  high, and  thick. The wall would survive for another 1,600 years and define the ": null
    },
    {
        "City of Londons": "city of london"
    },
    {
        "perimeters for centuries to come. The perimeters of the present City are roughly defined by the line of the ancient wall.     Londonium was an ethnically diverse city with inhabitants from across the Roman Empire, including natives of Britannia, ": null
    },
    {
        "continental Europe": "continental europe"
    },
    {
        ", the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ", and ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ". , ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ", 23 November 2015     In the late 3rd century, Londinium was raided on several occasions by Saxon pirates.  This led, from around 255 onwards, to the construction of an additional riverside wall. Six of the traditional seven city gates of London are of Roman origin, namely: ": null
    },
    {
        "Ludgate": "ludgate"
    },
    {
        ", ": null
    },
    {
        "Newgate": "newgate"
    },
    {
        ", ": null
    },
    {
        "Aldersgate": "aldersgate"
    },
    {
        ", ": null
    },
    {
        "Cripplegate": "cripplegate"
    },
    {
        ", ": null
    },
    {
        "Bishopsgate": "bishopsgate"
    },
    {
        " and ": null
    },
    {
        "Aldgate": "aldgate"
    },
    {
        " .     By the 5th century, the Roman Empire was in rapid decline and in AD 410, the Roman occupation of Britannia came to an end. Following this, the Roman city also went into rapid decline and by the end of the 5th century was practically abandoned.          Until recently it was believed that ": null
    },
    {
        "Anglo-Saxon": "anglo-saxon"
    },
    {
        " settlement initially avoided the area immediately around Londinium. However, the discovery in 2008 of an Anglo-Saxon cemetery at ": null
    },
    {
        "Covent Garden": "covent garden"
    },
    {
        " indicates that the incomers had begun to settle there at least as early as the 6th century and possibly in the 5th. The main focus of this settlement was outside the Roman walls, clustering a short distance to the west along what is now the ": null
    },
    {
        "Strand": "strand, london"
    },
    {
        ", between the ": null
    },
    {
        "Aldwych": "aldwych"
    },
    {
        " and ": null
    },
    {
        "Trafalgar Square": "trafalgar square"
    },
    {
        ". It was known as Lundenwic, the -wic suffix here denoting a trading settlement. Recent excavations have also highlighted the population density and relatively sophisticated urban organisation of this earlier Anglo-Saxon London, which was laid out on a grid pattern and grew to house a likely population of 10-12,000.     Early Anglo-Saxon London belonged to a people known as the ": null
    },
    {
        "Middle Saxons": "middle saxons"
    },
    {
        ", from whom the name of the county of ": null
    },
    {
        "Middlesex": "middlesex"
    },
    {
        " is derived, but who probably also occupied the approximate area of modern ": null
    },
    {
        "Hertfordshire": "hertfordshire"
    },
    {
        " and ": null
    },
    {
        "Surrey": "surrey"
    },
    {
        ". However, by the early 7th century the London area had been incorporated into the kingdom of the ": null
    },
    {
        "East Saxons": "east saxons"
    },
    {
        ". In 604 King ": null
    },
    {
        "Saeberht of Essex": "saeberht of essex"
    },
    {
        " converted to Christianity and London received ": null
    },
    {
        "Mellitus": "mellitus"
    },
    {
        ", its first post-Roman bishop.     At this time Essex was under the overlordship of King ": null
    },
    {
        "Æthelberht of Kent": "æthelberht of kent"
    },
    {
        ", and it was under Æthelberhts patronage that Mellitus founded the first ": null
    },
    {
        "St. Pauls Cathedral": "st. pauls cathedral"
    },
    {
        ", traditionally said to be on the site of an old Roman Temple of Diana . It would have only been a modest church at first and may well have been destroyed after he was expelled from the city by Saeberhts ": null
    },
    {
        "pagan": "paganism"
    },
    {
        " successors.     The permanent establishment of Christianity in the East Saxon kingdom took place in the reign of King ": null
    },
    {
        "Sigeberht II": "sigeberht the good"
    },
    {
        " in the 650s. During the 8th century, the kingdom of ": null
    },
    {
        "Mercia": "mercia"
    },
    {
        " extended its dominance over south-eastern England, initially through overlordship which at times developed into outright annexation. London seems to have come under direct Mercian control in the 730s.             ": null
    },
    {
        "Viking": "viking"
    },
    {
        " attacks dominated most of the 9th century, becoming increasingly common from around 830 onwards. London was sacked in 842 and again in 851. The ": null
    },
    {
        "Danish": "denmark"
    },
    {
        " Great Heathen Army": "great heathen army"
    },
    {
        " , which had rampaged across England since 865, wintered in London in 871. The city remained in Danish hands until 886, when it was captured by the forces of King ": null
    },
    {
        "Alfred the Great": "alfred the great"
    },
    {
        " of ": null
    },
    {
        "Wessex": "wessex"
    },
    {
        " and reincorporated into Mercia, then governed under Alfreds sovereignty by his son-in-law ": null
    },
    {
        "Ealdorman": "ealdorman"
    },
    {
        " Æthelred": "earl aethelred of mercia"
    },
    {
        ".          Around this time the focus of settlement moved within the old Roman walls for the sake of defence, and the city became known as  Lundenburh . The Roman walls were repaired and the defensive ditch re-cut, while the bridge was probably rebuilt at this time. A second fortified ": null
    },
    {
        "Borough": "borough"
    },
    {
        " was established on the south bank at ": null
    },
    {
        "Southwark": "southwark"
    },
    {
        ", the Suthringa Geworc . The old settlement of Lundenwic became known as the ealdwic or old settlement , a name which survives today as Aldwich.     From this point, the City of London began to develop its own unique local government. Following Ethelreds death in 911 it was transferred to Wessex, preceding the absorption of the rest of Mercia in 918. Although it faced competition for political pre-eminence in the united ": null
    },
    {
        "Kingdom of England": "kingdom of england"
    },
    {
        " from the traditional West Saxon centre of ": null
    },
    {
        "Winchester": "winchester"
    },
    {
        ", Londons size and commercial wealth brought it a steadily increasing importance as a focus of governmental activity. King ": null
    },
    {
        "Athelstan": "athelstan of england"
    },
    {
        " held many meetings of the witan in London and issued laws from there, while King ": null
    },
    {
        "Æthelred the Unready": "æthelred the unready"
    },
    {
        " issued the ": null
    },
    {
        "Laws of London": "laws of london"
    },
    {
        " there in 978.     Following the resumption of Viking attacks in the reign of Ethelred, London was unsuccessfully attacked in 994 by an army under King ": null
    },
    {
        "Sweyn Forkbeard": "sweyn forkbeard"
    },
    {
        " of Denmark. As English resistance to the sustained and escalating Danish onslaught finally collapsed in 1013, London repulsed an attack by the Danes and was the last place to hold out while the rest of the country submitted to Sweyn, but by the end of the year it too capitulated and Æthelred fled abroad. Sweyn died just five weeks after having been proclaimed king and Æthelred was restored to the throne, but Sweyns son ": null
    },
    {
        "Cnut": "canute the great"
    },
    {
        " returned to the attack in 1015.     After Æthelreds death at London in 1016 his son ": null
    },
    {
        "Edmund Ironside": "edmund ironside"
    },
    {
        " was proclaimed king there by the  witangemot  and left to gather forces in Wessex. London was then subjected to a systematic siege by Cnut but was relieved by King Edmunds army; when Edmund again left to recruit reinforcements in Wessex the Danes resumed the siege but were again unsuccessful. However, following his defeat at the ": null
    },
    {
        "Battle of Assandun": "battle of assandun"
    },
    {
        " Edmund ceded to Cnut all of England north of the Thames, including London, and his death a few weeks later left Cnut in control of the whole country.     A Norse saga tells of a battle when King Æthelred returned to attack Danish-occupied London. According to the saga, the Danes lined ": null
    },
    {
        "London Bridge": "london bridge"
    },
    {
        " and showered the attackers with spears. Undaunted, the attackers pulled the roofs off nearby houses and held them over their heads in the boats. Thus protected, they were able to get close enough to the bridge to attach ropes to the piers and pull the bridge down, thus ending the Viking occupation of London. This story presumably relates to Æthelreds return to power after Sweyns death in 1014, but there is no strong evidence of any such struggle for control of London on that occasion.     Following the extinction of Cnuts dynasty in 1042 English rule was restored under ": null
    },
    {
        "Edward the Confessor": "edward the confessor"
    },
    {
        ". He was responsible for the foundation of ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " and spent much of his time at ": null
    },
    {
        "Westminster": "westminster"
    },
    {
        ", which from this time steadily supplanted the City itself as the centre of government. Edwards death at Westminster in 1066 without a clear heir led to a succession dispute and the ": null
    },
    {
        "Norman conquest of England": "norman conquest of england"
    },
    {
        ". Earl ": null
    },
    {
        "Harold Godwinson": "harold godwinson"
    },
    {
        " was elected king by the witangemot and crowned in Westminster Abbey but was defeated and killed by ": null
    },
    {
        "William the Bastard, Duke of Normandy": "william i of england"
    },
    {
        " at the ": null
    },
    {
        "Battle of Hastings": "battle of hastings"
    },
    {
        ". The surviving members of the witan met in London and elected King Edwards young nephew ": null
    },
    {
        "Edgar the Ætheling": "edgar the ætheling"
    },
    {
        " as king.     The ": null
    },
    {
        "Normans": "normans"
    },
    {
        " advanced to the south bank of the Thames opposite London, where they defeated an English attack and burned Southwark but were unable to storm the bridge. They moved upstream and crossed the river at ": null
    },
    {
        "Wallingford": "wallingford, oxfordshire"
    },
    {
        " before advancing on London from the north-west. The resolve of the English leadership to resist collapsed and the chief citizens of London went out together with the leading members of the Church and aristocracy to submit to William at ": null
    },
    {
        "Berkhamstead": "berkhamstead"
    },
    {
        ", although according to some accounts there was a subsequent violent clash when the Normans reached the city. Having occupied London, William was crowned king in Westminster Abbey.               The new Norman regime established new fortresses within the city to dominate the native population. By far the most important of these was the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        " at the eastern end of the city, where the initial timber fortification was rapidly replaced by the construction of the first stone castle in England. The smaller forts of ": null
    },
    {
        "Baynards Castle": "baynards castle"
    },
    {
        " and ": null
    },
    {
        "Montfichets Castle": "montfichets castle"
    },
    {
        " were also established along the waterfront. King William also granted a ": null
    },
    {
        "charter": "charter"
    },
    {
        " in 1067 confirming the citys existing rights, privileges and laws. London was a centre of Englands nascent ": null
    },
    {
        "Jewish population": "history of the jews in england"
    },
    {
        ", the first of whom arrived in about 1070. Jacobs, Joseph. TITLE. JewishEncyclopedia.com. 2018-07-04. URL:. Accessed: 2018-07-04.  Its growing self-government was consolidated by the election rights granted by ": null
    },
    {
        "King John": "john of england"
    },
    {
        " in 1199 and 1215.     In 1097, ": null
    },
    {
        "William Rufus": "william rufus"
    },
    {
        ", the son of William the Conqueror began the construction of Westminster Hall, which became the focus of the ": null
    },
    {
        "Palace of Westminster": "palace of westminster"
    },
    {
        ".     In 1176, construction began of the most famous incarnation of ": null
    },
    {
        "London Bridge": "london bridge"
    },
    {
        " which was built on the site of several earlier timber bridges. This bridge would last for 600 years, and remained the only bridge across the ": null
    },
    {
        "River Thames": "river thames"
    },
    {
        " until 1739.     Violence against Jews took place in 1190, after it was rumoured that the new King had ordered their massacre after they had presented themselves at his coronation.      In 1216, during the ": null
    },
    {
        "First Barons War": "first barons war"
    },
    {
        " London was occupied by ": null
    },
    {
        "Prince Louis of France": "louis viii of france"
    },
    {
        ", who had been called in by the baronial rebels against ": null
    },
    {
        "King John": "john of england"
    },
    {
        " and was acclaimed as King of England in ": null
    },
    {
        "St Pauls Cathedral": "old st. pauls cathedral"
    },
    {
        ". However, following Johns death in 1217 Louiss supporters reverted to their ": null
    },
    {
        "Plantagenet": "plantagenet"
    },
    {
        " allegiance, rallying round Johns son ": null
    },
    {
        "Henry III": "henry iii of england"
    },
    {
        ", and Louis was forced to withdraw from England.     In 1224, after an accusation of ": null
    },
    {
        "ritual murder": "ritual murder"
    },
    {
        ", the Jewish community was subjected to a steep punitive levy. Then in 1232, Henry III confiscated the principal ": null
    },
    {
        "synagogue": "synagogue"
    },
    {
        " of the London Jewish community because he claimed their chanting was audible in a neighboring church.  In 1264, during the ": null
    },
    {
        "Second Barons War": "second barons war"
    },
    {
        ", ": null
    },
    {
        "Simon de Montforts": "simon de montfort, 6th earl of leicester"
    },
    {
        "rebels occupied London and killed 500 Jews while attempting to seize records of debts. ; see p88-99     Londons Jewish community was forced to leave England by the ": null
    },
    {
        "expulsion": "edict of expulsion"
    },
    {
        " by ": null
    },
    {
        "Edward I": "edward i of england"
    },
    {
        " in 1290. They left for France, Holland and further afield; their property was seized, and many suffered robbery and murder as they departed.     Over the following centuries, London would shake off the heavy French cultural and linguistic influence which had been there since the times of the Norman conquest. The city would figure heavily in the development of ": null
    },
    {
        "Early Modern English": "early modern english"
    },
    {
        ".        During the ": null
    },
    {
        "Peasants Revolt": "peasants revolt"
    },
    {
        " of 1381, London was invaded by rebels led by ": null
    },
    {
        "Wat Tyler": "wat tyler"
    },
    {
        ". A group of peasants stormed the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        " and executed the ": null
    },
    {
        "Lord Chancellor": "lord chancellor"
    },
    {
        ", Archbishop ": null
    },
    {
        "Simon Sudbury": "simon sudbury"
    },
    {
        ", and the ": null
    },
    {
        "Lord Treasurer": "lord treasurer"
    },
    {
        ". The peasants looted the city and set fire to numerous buildings. Tyler was stabbed to death by the Lord Mayor ": null
    },
    {
        "William Walworth": "william walworth"
    },
    {
        " in a confrontation at ": null
    },
    {
        "Smithfield": "smithfield, london"
    },
    {
        " and the revolt collapsed.     Trade increased steadily during the Middle Ages, and London grew rapidly as a result. In 1100, Londons population was somewhat more than 15,000. By 1300, it had grown to roughly 80,000. London lost at least half of its population during the ": null
    },
    {
        "Black Death": "black death"
    },
    {
        " in the mid-14th century, but its economic and political importance stimulated a rapid recovery despite further epidemics. Trade in London was organised into various ": null
    },
    {
        "guild": "guild"
    },
    {
        "s, which effectively controlled the city, and elected the ": null
    },
    {
        "Lord Mayor of the City of London": "lord mayor of the city of london"
    },
    {
        ".     Medieval London was made up of narrow and twisting streets, and most of the buildings were made from combustible materials such as timber and straw, which made fire a constant threat, while sanitation in cities was of low-quality.                        In 1475, the ": null
    },
    {
        "Hanseatic League": "hanseatic league"
    },
    {
        " set up its main English trading base  in London, called Stalhof or  Steelyard . It existed until 1853, when the Hanseatic cities of ": null
    },
    {
        "Lübeck": "lübeck"
    },
    {
        ", ": null
    },
    {
        "Bremen": "bremen"
    },
    {
        " and ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " sold the property to ": null
    },
    {
        "South Eastern Railway": "south eastern railway, uk"
    },
    {
        ".  ": null
    },
    {
        "Woollen": "woollen"
    },
    {
        " cloth was shipped undyed and undressed from 14th/15th century London to the nearby shores of the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ", where it was considered indispensable. J. G. Pounds . An Historical Geography of Europe 450 B.C.-A.D. 1330, Part 1330 . p. 430. CUP Archive     During the ": null
    },
    {
        "Reformation": "english reformation"
    },
    {
        ", London was the principal early centre of ": null
    },
    {
        "Protestantism": "protestantism"
    },
    {
        " in England. Its close commercial connections with the Protestant heartlands in northern continental Europe, large foreign mercantile communities, disproportionately large number of literate inhabitants and role as the centre of the English print trade all contributed to the spread of the new ideas of religious reform. Before the Reformation, more than half of the area of London was the property of ": null
    },
    {
        "monasteries": "monasteries"
    },
    {
        ", ": null
    },
    {
        "nunneries": "nunnery"
    },
    {
        " and other religious houses. ": null
    },
    {
        "Nikolaus Pevsner": "nikolaus pevsner"
    },
    {
        ", London I: The Cities of London and Westminster rev. edition,1962, Introduction p 48.     ": null
    },
    {
        "Henry VIIIs": "henry viii of england"
    },
    {
        " Dissolution of the Monasteries": "dissolution of the monasteries"
    },
    {
        " had a profound effect on the city as nearly all of this property changed hands. The process started in the mid 1530s, and by 1538 most of the larger monastic houses had been abolished. Holy Trinity Aldgate went to ": null
    },
    {
        "Lord Audley": "john tuchet, 8th baron audley"
    },
    {
        ", and the ": null
    },
    {
        "Marquess of Winchester": "william paulet, 1st marquess of winchester"
    },
    {
        " built himself a house in part of its precincts. The ": null
    },
    {
        "Charterhouse": "london charterhouse"
    },
    {
        " went to Lord North, Blackfriars to ": null
    },
    {
        "Lord Cobham": "w:george brooke, 9th baron cobham"
    },
    {
        ", the leper hospital of St Giles to Lord Dudley, while the king took for himself the leper hospital of St James, which was rebuilt as ": null
    },
    {
        "St Jamess Palace": "st jamess palace"
    },
    {
        ".     The period saw London rapidly rising in importance among Europes commercial centres. Trade expanded beyond Western Europe to Russia, the Levant, and the Americas. This was the period of ": null
    },
    {
        "mercantilism": "mercantilism"
    },
    {
        " and monopoly trading companies such as the ": null
    },
    {
        "Muscovy Company": "muscovy company"
    },
    {
        " and the ": null
    },
    {
        "British East India Company": "british east india company"
    },
    {
        " were established in London by Royal Charter. The latter, which ultimately came to rule India, was one of the key institutions in London, and in Britain as a whole, for two and a half centuries. Immigrants arrived in London not just from all over England and Wales, but from abroad as well, for example Huguenots from France; the population rose from an estimated 50,000 in 1530 to about 225,000 in 1605. The growth of the population and wealth of London was fuelled by a vast expansion in the use of coastal shipping.     The late 16th and early 17th century saw the great flourishing of drama in London whose preeminent figure was ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        ". During the mostly calm later years of Elizabeths reign, some of her courtiers and some of the wealthier citizens of London built themselves country residences in ": null
    },
    {
        "Middlesex": "middlesex"
    },
    {
        ", ": null
    },
    {
        "Essex": "essex"
    },
    {
        " and ": null
    },
    {
        "Surrey": "surrey"
    },
    {
        ". This was an early stirring of the villa movement, the taste for residences which were neither of the city nor on an agricultural estate, but at the time of Elizabeths death in 1603, London was still very compact.          Xenophobia was rampant in London, and increased after the 1580s. Many immigrants became disillusioned by routine threats of violence and molestation, attempts at expulsion of foreigners, and the great difficulty in acquiring English citizenship. Dutch cities proved more hospitable, and many left London permanently. Bich Luu Lien, Taking the Bread Out of Our Mouths: Xenophobia in Early Modern London, Immigrants and Minorities, July 2000, Vol. 19 Issue 2, pp 1-22 Foreigners are estimated to have made up 4,000 of the 100,000 residents of London by 1600, many being Dutch and German workers and traders.                Londons expansion beyond the boundaries of the City was decisively established in the 17th century. In the opening years of that century the immediate environs of the City, with the principal exception of the aristocratic residences in the direction of Westminster, were still considered not conducive to health. Immediately to the north was ": null
    },
    {
        "Moorfields": "moorfields"
    },
    {
        ", which had recently been drained and laid out in walks, but it was frequented by beggars and travellers, who crossed it in order to get into London. Adjoining Moorfields were ": null
    },
    {
        "Finsbury": "finsbury"
    },
    {
        " Fields, a favourite practising ground for the archers, ": null
    },
    {
        "Mile End": "mile end"
    },
    {
        ", then a common on the Great Eastern Road and famous as a rendezvous for the troops.     The preparations for ": null
    },
    {
        "King James I": "james i of england"
    },
    {
        " becoming king were interrupted by a severe plague epidemic, which may have killed over thirty thousand people. The ": null
    },
    {
        "Lord Mayors Show": "lord mayors show"
    },
    {
        ", which had been discontinued for some years, was revived by order of the king in 1609. The dissolved monastery of the ": null
    },
    {
        "Charterhouse": "london charterhouse"
    },
    {
        ", which had been bought and sold by the courtiers several times, was purchased by ": null
    },
    {
        "Thomas Sutton": "thomas sutton"
    },
    {
        " for £13,000. The new hospital, chapel, and schoolhouse were begun in 1611. ": null
    },
    {
        "Charterhouse School": "charterhouse school"
    },
    {
        " was to be one of the principal ": null
    },
    {
        "public schools": "public school"
    },
    {
        " in London until it moved to Surrey in Victorian times, and the site is still used as a ": null
    },
    {
        "medical school": "barts and the london, queen marys school of medicine and dentistry"
    },
    {
        ". Sheila Hannah Williams, The Lord Mayors Show in Tudor and Stuart Times .     The general meeting-place of Londoners in the day-time was the nave of ": null
    },
    {
        "Old St. Pauls Cathedral": "old st. pauls cathedral"
    },
    {
        ". Merchants conducted business in the aisles, and used the font as a counter upon which to make their payments; lawyers received clients at their particular pillars; and the unemployed looked for work. St Pauls Churchyard was the centre of the book trade and ": null
    },
    {
        "Fleet Street": "fleet street"
    },
    {
        " was a centre of public entertainment. Under James I the theatre, which established itself so firmly in the latter years of Elizabeth, grew further in popularity. The performances at the public theatres were complemented by elaborate ": null
    },
    {
        "masques": "masques"
    },
    {
        " at the royal court and at the inns of court. Michael Berlin, Civic ceremony in early modern London. Urban History 13 : 15-27.. Civic ceremony in early modern London. Urban History 131 pp: 15-27.     ": null
    },
    {
        "Charles I": "charles i of england"
    },
    {
        " acceded to the throne in 1625. During his reign, aristocrats began to inhabit the ": null
    },
    {
        "West End": "west end of london"
    },
    {
        " in large numbers. In addition to those who had specific business at court, increasing numbers of country landowners and their families lived in London for part of the year simply for the social life. This was the beginning of the London season . ": null
    },
    {
        "Lincolns Inn Fields": "lincolns inn fields"
    },
    {
        " was built about 1629. Judith Milhous, Thomas Betterton and the management of Lincolns Inn Fields, 1695–1708 The piazza of ": null
    },
    {
        "Covent Garden": "covent garden"
    },
    {
        ", designed by Englands first classically trained architect ": null
    },
    {
        "Inigo Jones": "inigo jones"
    },
    {
        " followed in about 1632. The neighbouring streets were built shortly afterwards, and the names of Henrietta, Charles, James, King and York Streets were given after members of the royal family. John Summerson, Inigo Jones        In January 1642 ": null
    },
    {
        "five members": "five members"
    },
    {
        " of parliament whom the King wished to arrest were granted refuge in the City. In August of the same year the King raised his banner at ": null
    },
    {
        "Nottingham": "nottingham"
    },
    {
        ", and during the ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        " London took the side of the parliament. Initially the king had the upper hand in military terms and in November he won the ": null
    },
    {
        "Battle of Brentford": "battle of brentford"
    },
    {
        " a few miles to the west of London. The City organised a new makeshift army and Charles hesitated and retreated. Subsequently, an extensive system of fortifications was built to protect London from a renewed attack by the Royalists. This comprised a strong earthen rampart, enhanced with bastions and redoubts. It was well beyond the City walls and encompassed the whole urban area, including Westminster and Southwark. London was not seriously threatened by the royalists again, and the financial resources of the City made an important contribution to the parliamentarians victory in the war.     The unsanitary and overcrowded City of London has suffered from the numerous outbreaks of the plague many times over the centuries, but in Britain it is the last major outbreak which is remembered as the ": null
    },
    {
        "Great Plague": "great plague of london"
    },
    {
        " It occurred in 1665 and 1666 and killed around 60,000 people, which was one fifth of the population. ": null
    },
    {
        "Samuel Pepys": "samuel pepys"
    },
    {
        " chronicled the epidemic in his diary. On 4 September 1665 he wrote I have stayed in the city till above 7400 died in one week, and of them about 6000 of the plague, and little noise heard day or night but tolling of bells.  Walter George Bell, The Great Plague in London .          The Great Plague was immediately followed by another catastrophe, albeit one which helped to put an end to the plague. On the Sunday, 2 September 1666 the ": null
    },
    {
        "Great Fire of London": "great fire of london"
    },
    {
        " broke out at one oclock in the morning at a bakery in ": null
    },
    {
        "Pudding Lane": "pudding lane"
    },
    {
        " in the southern part of the City. Fanned by an eastern wind the fire spread, and efforts to arrest it by pulling down houses to make firebreaks were disorganised to begin with. On Tuesday night the wind fell somewhat, and on Wednesday the fire slackened. On Thursday it was extinguished, but on the evening of that day the flames again burst forth at the Temple. Some houses were at once blown up by gunpowder, and thus the fire was finally mastered. ": null
    },
    {
        "The Monument": "the monument"
    },
    {
        " was built to commemorate the fire: for over a century and a half it bore an inscription attributing the conflagration to a  popish frenzy . Peter Ackroyd, The great fire of London        The fire destroyed about 60% of the City, including ": null
    },
    {
        "Old St Pauls Cathedral": "old st pauls cathedral"
    },
    {
        ", 87 parish churches, 44 ": null
    },
    {
        "livery company": "livery company"
    },
    {
        " halls and the ": null
    },
    {
        "Royal Exchange": "royal exchange, london"
    },
    {
        ". However, the number of lives lost was surprisingly small; it is believed to have been 16 at most. Within a few days of the fire, three plans were presented to the king for the rebuilding of the city, by ": null
    },
    {
        "Christopher Wren": "christopher wren"
    },
    {
        ", ": null
    },
    {
        "John Evelyn": "john evelyn"
    },
    {
        " and ": null
    },
    {
        "Robert Hooke": "robert hooke"
    },
    {
        ". Thomas Fiddian Reddaway, The rebuilding of London after the great fire .     Wren proposed to build main thoroughfares north and south, and east and west, to insulate all the churches in conspicuous positions, to form the most public places into large piazzas, to unite the halls of the 12 chief livery companies into one regular square annexed to the ": null
    },
    {
        "Guildhall": "guildhall, london"
    },
    {
        ", and to make a fine quay on the bank of the river from ": null
    },
    {
        "Blackfriars": "blackfriars, london"
    },
    {
        " to the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        ". Wren wished to build the new streets straight and in three standard widths of thirty, sixty and ninety feet. Evelyns plan differed from Wrens chiefly in proposing a street from the church of ": null
    },
    {
        "St Dunstans in the East": "st dunstans in the east"
    },
    {
        " to the St Pauls, and in having no quay or terrace along the river. These plans were not implemented, and the rebuilt city generally followed the streetplan of the old one, and most of it has survived into the 21st century.          Nonetheless, the new City was different from the old one. Many aristocratic residents never returned, preferring to take new houses in the West End, where fashionable new districts such as ": null
    },
    {
        "St. Jamess": "st. jamess"
    },
    {
        " were built close to the main royal residence, which was ": null
    },
    {
        "Whitehall Palace": "whitehall palace"
    },
    {
        " until it was destroyed by fire in the 1690s, and thereafter ": null
    },
    {
        "St. Jamess Palace": "st. jamess palace"
    },
    {
        ". The rural lane of ": null
    },
    {
        "Piccadilly": "piccadilly"
    },
    {
        " sprouted courtiers mansions such as ": null
    },
    {
        "Burlington House": "burlington house"
    },
    {
        ". Thus the separation between the middle class mercantile City of London, and the aristocratic world of the court in ": null
    },
    {
        "Westminster": "palace of westminster"
    },
    {
        " became complete. Timothy Baker, London: rebuilding the city after the great fire     In the City itself there was a move from wooden buildings to stone and brick construction to reduce the risk of fire. Parliaments ": null
    },
    {
        "Rebuilding of London Act 1666": "rebuilding of london act 1666"
    },
    {
        " stated  building with brick not only more comely and durable, but also more safe against future perils of fire . From then on only doorcases, window-frames and shop fronts were allowed to be made of wood.      Christopher Wrens plan for a new model London came to nothing, but he was appointed to rebuild the ruined parish churches and to replace ": null
    },
    {
        "St Pauls Cathedral": "st pauls cathedral"
    },
    {
        ". His domed ": null
    },
    {
        "baroque": "baroque"
    },
    {
        " cathedral was the primary symbol of London for at least a century and a half. As city surveyor, ": null
    },
    {
        "Robert Hooke": "robert hooke"
    },
    {
        " oversaw the reconstruction of the Citys houses. The ": null
    },
    {
        "East End": "east end"
    },
    {
        ", that is the area immediately to the east of the city walls, also became heavily populated in the decades after the Great Fire. Londons docks began to extend downstream, attracting many working people who worked on the docks themselves and in the processing and distributive trades. These people lived in ": null
    },
    {
        "Whitechapel": "whitechapel"
    },
    {
        ", ": null
    },
    {
        "Wapping": "wapping"
    },
    {
        ", ": null
    },
    {
        "Stepney": "stepney"
    },
    {
        " and ": null
    },
    {
        "Limehouse": "limehouse"
    },
    {
        ", generally in slum conditions. Michael Alan Ralph Cooper, A More Beautiful City: Robert Hooke and the Rebuilding of London After the Great Fire     In the winter of 1683–1684, a ": null
    },
    {
        "frost fair": "thames frost fairs"
    },
    {
        " was held on the Thames. The frost, which began about seven weeks before Christmas and continued for six weeks after, was the greatest on record. The ": null
    },
    {
        "Revocation of the Edict of Nantes": "revocation of the edict of nantes"
    },
    {
        " in 1685 led to a large migration on ": null
    },
    {
        "Huguenots": "huguenots"
    },
    {
        " to London. They established a silk industry at ": null
    },
    {
        "Spitalfields": "spitalfields"
    },
    {
        ".      At this time the ": null
    },
    {
        "Bank of England": "bank of england"
    },
    {
        " was founded, and the British East India Company was expanding its influence. ": null
    },
    {
        "Lloyds of London": "lloyds of london"
    },
    {
        " also began to operate in the late 17th century. In 1700, London handled 80% of Englands imports, 69% of its exports and 86% of its re-exports. Many of the goods were luxuries from the Americas and Asia such as silk, sugar, tea and tobacco. The last figure emphasises Londons role as an ": null
    },
    {
        "entrepot": "entrepot"
    },
    {
        ": while it had many craftsmen in the 17th century, and would later acquire some large factories, its economic prominence was never based primarily on industry. Instead it was a great trading and redistribution centre. Goods were brought to London by Englands increasingly dominant merchant navy, not only to satisfy domestic demand, but also for re-export throughout Europe and beyond.      ": null
    },
    {
        "William III": "william iii of england"
    },
    {
        ", a Dutchman, cared little for London, the smoke of which gave him asthma, and after the first fire at Whitehall Palace he purchased Nottingham House and transformed it into ": null
    },
    {
        "Kensington Palace": "kensington palace"
    },
    {
        ". ": null
    },
    {
        "Kensington": "kensington"
    },
    {
        " was then an insignificant village, but the arrival of the court soon caused it to grow in importance. The palace was rarely favoured by future monarchs, but its construction was another step in the expansion of the bounds of London. During the same reign ": null
    },
    {
        "Greenwich Hospital": "greenwich hospital"
    },
    {
        ", then well outside the boundary of London, but now comfortably inside it, was begun; it was the naval complement to the ": null
    },
    {
        "Chelsea Hospital": "chelsea hospital"
    },
    {
        " for former soldiers, which had been founded in 1681. During the reign of ": null
    },
    {
        "Queen Anne": "anne, queen of great britain"
    },
    {
        " an act was passed authorising the building of 50 new churches to serve the greatly increased population living outside the boundaries of the City of London. Jason R. Ali and Peter Cunich. The Church East and West: Orienting the Queen Anne Churches, 1711-34. The Journal of the Society of Architectural Historians : 56-73.                   The 18th century was a period of rapid growth for London, reflecting an increasing national population, the early stirrings of the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        ", and Londons role at the centre of the evolving ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        ".     In 1707, an ": null
    },
    {
        "Act of Union": "acts of union 1707"
    },
    {
        " was passed merging the Scottish and the English Parliaments, thus establishing the Kingdom of Great Britain. A year later, in 1708 Christopher Wrens masterpiece, ": null
    },
    {
        "St Pauls Cathedral": "st pauls cathedral"
    },
    {
        " was completed on his birthday. However, the first service had been held on 2 December 1697; more than 10 years earlier. This Cathedral replaced the original St. Pauls which had been completely destroyed in the ": null
    },
    {
        "Great Fire of London": "great fire of london"
    },
    {
        ". This building is considered one of the finest in Britain and a fine example of ": null
    },
    {
        "Baroque architecture": "baroque architecture"
    },
    {
        ".          Many tradesmen from different countries came to London to trade goods and merchandise. Also, more immigrants moved to London making the population greater. More people also moved to London for work and for business making London an altogether bigger and busier city. ": null
    },
    {
        "Britains victory in the Seven Years War": "great britain in the seven years war"
    },
    {
        " increased the countrys international standing and opened large new markets to British trade, further boosting Londons prosperity.     During the Georgian period London spread beyond its traditional limits at an accelerating pace. This is shown in a series of detailed maps, particularly ": null
    },
    {
        "John Rocques": "john rocque"
    },
    {
        "1741–45 map  and his ": null
    },
    {
        "1746 Map of London": "john rocques map of london, 1746"
    },
    {
        ". New districts such as ": null
    },
    {
        "Mayfair": "mayfair"
    },
    {
        " were built for the rich in the West End, new bridges over the Thames encouraged an acceleration of development in ": null
    },
    {
        "South London": "south london"
    },
    {
        " and in the East End, the ": null
    },
    {
        "Port of London": "port of london"
    },
    {
        " expanded downstream from the City. During this period was also the uprising of the American colonies. In 1780, the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        " held its only American prisoner, former President of the ": null
    },
    {
        "Continental Congress": "continental congress"
    },
    {
        ", ": null
    },
    {
        "Henry Laurens": "henry laurens"
    },
    {
        ". In 1779, he was the Congresss representative of Holland, and got the countrys support for the Revolution. On his return voyage back to America, the Royal Navy captured him and charged him with treason after finding evidence of a reason of war between Great Britain and the Netherlands. He was released from the Tower on 21 December 1781 in exchange for General ": null
    },
    {
        "Lord Cornwallis": "charles cornwallis, 1st marquess cornwallis"
    },
    {
        ".     In 1762, ": null
    },
    {
        "George III": "george iii of great britain"
    },
    {
        " acquired ": null
    },
    {
        "Buckingham Palace": "buckingham palace"
    },
    {
        " from the Duke of Buckingham. It was enlarged over the next 75 years by architects such as John Nash.         ": null
    },
    {
        "A phenomenon of the era was the coffeehouse": "english coffeehouses in the 17th and 18th centuries"
    },
    {
        ", which became a popular place to debate ideas. Growing literacy and the development of the ": null
    },
    {
        "printing press": "printing press"
    },
    {
        " meant that news became widely available. ": null
    },
    {
        "Fleet Street": "fleet street"
    },
    {
        " became the centre of the embryonic national press during the century.     18th-century London was dogged by crime. The ": null
    },
    {
        "Bow Street Runners": "bow street runners"
    },
    {
        " were established in 1750 as a professional police force. Penalties for crime were harsh, with the death penalty being applied for fairly minor crimes. Public ": null
    },
    {
        "hangings": "hanging"
    },
    {
        "were common in London, and were popular public events.     In 1780, London was rocked by the ": null
    },
    {
        "Gordon Riots": "gordon riots"
    },
    {
        ", an uprising by ": null
    },
    {
        "Protestants": "protestant"
    },
    {
        "against ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " emancipation led by ": null
    },
    {
        "Lord George Gordon": "lord george gordon"
    },
    {
        ". Severe damage was caused to Catholic churches and homes, and 285 rioters were killed.     In the year 1787, freed slaves from London, America, and many of Britains colonies founded ": null
    },
    {
        "Freetown": "freetown"
    },
    {
        " in modern-day Sierra Leone.     Up until 1750, ": null
    },
    {
        "London Bridge": "london bridge"
    },
    {
        " was the only crossing over the ": null
    },
    {
        "Thames": "thames"
    },
    {
        ", but in that year ": null
    },
    {
        "Westminster Bridge": "westminster bridge"
    },
    {
        " was opened and, for the first time in history, London Bridge, in a sense, had a rival. In 1798, Frankfurt banker ": null
    },
    {
        "Nathan Mayer Rothschild": "nathan mayer rothschild"
    },
    {
        " arrived in London and set up a banking house in the city, with a large sum of money given to him by his father, ": null
    },
    {
        "Amschel Mayer Rothschild": "amschel mayer rothschild"
    },
    {
        ". The Rothschilds also had banks in Paris and Vienna. The bank financed numerous large-scale projects, especially regarding railways around the world and the Suez Canal. Niall Ferguson, The House of Rothschild 2:171-75, 297-304     The 18th century saw the breakaway of the American colonies and many other unfortunate events in London, but also great change and Enlightenment. This all led into the beginning of modern times, the 19th century.                  During the 19th century, London was transformed into the worlds largest city and capital of the British Empire. Its population expanded from 1  million in 1800 to 6.7  million a century later. During this period, London became a global political, financial, and trading capital. In this position, it was largely unrivalled until the latter part of the century, when ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and ": null
    },
    {
        "New York": "new york city"
    },
    {
        " began to threaten its dominance.     While the city grew wealthy as Britains holdings expanded, 19th-century London was also a city of poverty, where millions lived in overcrowded and unsanitary ": null
    },
    {
        "slum": "slum"
    },
    {
        "s. Life for the poor was immortalised by ": null
    },
    {
        "Charles Dickens": "charles dickens"
    },
    {
        " in such novels as ": null
    },
    {
        "Oliver Twist": "oliver twist"
    },
    {
        " In 1810, after the death of ": null
    },
    {
        "Sir Francis Baring": "sir francis baring"
    },
    {
        " and Abraham Goldsmid, Rothschild emerges as the major banker in London.     In 1829, the then Home Secretary ": null
    },
    {
        "Robert Peel": "robert peel"
    },
    {
        " established the ": null
    },
    {
        "Metropolitan Police": "metropolitan police service"
    },
    {
        " as a police force covering the entire urban area. The force gained the nickname of bobbies or peelers named after Robert Peel.     19th-century London was transformed by the coming of the railways. A new network of metropolitan railways allowed for the development of suburbs in neighbouring counties from which middle-class and wealthy people could commute to the centre. While this spurred the massive outward growth of the city, the growth of greater London also exacerbated the class divide, as the wealthier classes emigrated to the suburbs, leaving the poor to inhabit the inner city areas.     The first railway to be built in London was a line from ": null
    },
    {
        "London Bridge": "london bridge"
    },
    {
        " to ": null
    },
    {
        "Greenwich": "greenwich"
    },
    {
        ", which opened in 1836. This was soon followed by the opening of great rail termini which eventually linked London to every corner of Great Britain, including ": null
    },
    {
        "Euston station": "euston railway station"
    },
    {
        " , ": null
    },
    {
        "Paddington station": "paddington station"
    },
    {
        " , ": null
    },
    {
        "Fenchurch Street station": "fenchurch street station"
    },
    {
        " , ": null
    },
    {
        "Waterloo station": "london waterloo railway station"
    },
    {
        " , ": null
    },
    {
        "Kings Cross station": "london kings cross railway station"
    },
    {
        " , and ": null
    },
    {
        "St Pancras station": "st pancras station"
    },
    {
        " . From 1863, the first lines of the ": null
    },
    {
        "London Underground": "london underground"
    },
    {
        " were constructed.     The urbanised area continued to grow rapidly, spreading into ": null
    },
    {
        "Islington": "islington"
    },
    {
        ", ": null
    },
    {
        "Paddington": "paddington"
    },
    {
        ", ": null
    },
    {
        "Belgravia": "belgravia"
    },
    {
        ", ": null
    },
    {
        "Holborn": "holborn"
    },
    {
        ", ": null
    },
    {
        "Finsbury": "finsbury"
    },
    {
        ", ": null
    },
    {
        "Shoreditch": "shoreditch"
    },
    {
        ", ": null
    },
    {
        "Southwark": "southwark"
    },
    {
        " and ": null
    },
    {
        "Lambeth": "lambeth"
    },
    {
        ". Towards the middle of the century, Londons antiquated local government system, consisting of ancient parishes and ": null
    },
    {
        "vestries": "vestry"
    },
    {
        ", struggled to cope with the rapid growth in population. In 1855, the ": null
    },
    {
        "Metropolitan Board of Works": "metropolitan board of works"
    },
    {
        " was created to provide London with adequate infrastructure to cope with its growth. One of its first tasks was addressing Londons sanitation problems. At the time, raw ": null
    },
    {
        "sewage": "sewage"
    },
    {
        " was pumped straight into the ": null
    },
    {
        "River Thames": "river thames"
    },
    {
        ". This culminated in ": null
    },
    {
        "The Great Stink": "the great stink"
    },
    {
        " of 1858. Lee Jackson, Dirty Old London: The Victorian Fight Against Filth Parliament finally gave consent for the MBW to construct a large system of ": null
    },
    {
        "sewers": "sanitary sewer"
    },
    {
        ". The engineer put in charge of building the new system was ": null
    },
    {
        "Joseph Bazalgette": "joseph bazalgette"
    },
    {
        ". In what was one of the largest ": null
    },
    {
        "civil engineering": "civil engineering"
    },
    {
        " projects of the 19th century, he oversaw construction of over 2100  km of tunnels and pipes under London to take away sewage and provide clean drinking water. When the ": null
    },
    {
        "London sewerage system": "london sewerage system"
    },
    {
        " was completed, the death toll in London dropped dramatically, and epidemics of ": null
    },
    {
        "cholera": "cholera"
    },
    {
        " and other diseases were curtailed. Bazalgettes system is still in use today. Stephen Halliday, The great stink of London: Sir Joseph Bazalgette and the cleansing of the Victorian metropolis     One of the most famous events of 19th-century London was the ": null
    },
    {
        "Great Exhibition of 1851": "great exhibition of 1851"
    },
    {
        ". Held at ": null
    },
    {
        "The Crystal Palace": "the crystal palace"
    },
    {
        ", the fair attracted 6  million visitors from across the world and displayed Britain at the height of its Imperial dominance. Jeffrey A., Auerbach, ed. The Great Exhibition of 1851: a nation on display      As the capital of a massive empire, London became a magnet for immigrants from the colonies and poorer parts of Europe. A large Irish population settled in the city during the Victorian period, with many of the newcomers refugees from the ": null
    },
    {
        "Great Famine ": "great irish famine"
    },
    {
        ". At one point, Catholic Irish made up about 20% of Londons population; they typically lived in overcrowded slums. Lynn Hollen Lees, Exiles of Erin: Irish Migrants in Victorian London London also became home to ": null
    },
    {
        "a sizable Jewish community": "history of the jews in england"
    },
    {
        ", which was notable for its entrepreneurship in the clothing trade and merchandising. Andrew Godley, Jewish Immigrant Entrepreneurship in New York and London, 1880–1914     In 1888, the new ": null
    },
    {
        "County of London": "county of london"
    },
    {
        " was established, administered by the ": null
    },
    {
        "London County Council": "london county council"
    },
    {
        ". This was the first elected London-wide administrative body, replacing the earlier Metropolitan Board of Works, which had been made up of appointees. The County of London covered broadly what was then the full extent of the London conurbation, although the conurbation later outgrew the boundaries of the county. In 1900, the county was sub-divided into 28 ": null
    },
    {
        "metropolitan boroughs": "metropolitan boroughs of the county of london"
    },
    {
        ", which formed a more local tier of administration than the county council.     Many famous buildings and landmarks of London were constructed during the 19th century including:   ": null
    },
    {
        "Trafalgar Square": "trafalgar square"
    },
    {
        " Big Ben": "clock tower, palace of westminster"
    },
    {
        " and the ": null
    },
    {
        "Houses of Parliament": "palace of westminster"
    },
    {
        " Royal Albert Hall": "royal albert hall"
    },
    {
        " Victoria and Albert Museum": "victoria and albert museum"
    },
    {
        " Tower Bridge": "tower bridge"
    },
    {
        "                London entered the 20th century at the height of its influence as the capital of one of the largest empires in history, but the new century was to bring many challenges.     Londons population continued to grow rapidly in the early decades of the century, and ": null
    },
    {
        "public transport": "public transport"
    },
    {
        " was greatly expanded. A large tram network was constructed by the London County Council, through the ": null
    },
    {
        "LCC Tramways": "london county council tramways"
    },
    {
        "; the first ": null
    },
    {
        "motorbus": "bus"
    },
    {
        " service began in the 1900s. Improvements to Londons overground and underground rail network, including large scale electrification were progressively carried out.     During World War I, London experienced its first bombing raids carried out by German ": null
    },
    {
        "zeppelin": "zeppelin"
    },
    {
        " airship": "airship"
    },
    {
        "s; these killed around 700 people and caused great terror, but were merely a foretaste of what was to come. The city of London would experience many more terrors as a result of both World Wars. The largest explosion in London occurred during World War I: the ": null
    },
    {
        "Silvertown explosion": "silvertown explosion"
    },
    {
        ", when a munitions factory containing 50 tons of ": null
    },
    {
        "TNT": "trinitrotoluene"
    },
    {
        " exploded, killing 73 and injuring 400.     The ": null
    },
    {
        "period between the two World Wars": "interwar"
    },
    {
        " saw Londons geographical extent growing more quickly than ever before or since. A preference for lower density suburban housing, typically ": null
    },
    {
        "semi-detached": "semi-detached"
    },
    {
        ", by Londoners seeking a more rural lifestyle, superseded Londoners old predilection for ": null
    },
    {
        "terraced house": "terraced house"
    },
    {
        "s. This was facilitated not only by a continuing expansion of the rail network, including trams and the Underground, but also by slowly widening car ownership. Londons suburbs expanded outside the boundaries of the County of London, into the neighbouring counties of ": null
    },
    {
        "Essex": "essex"
    },
    {
        ", ": null
    },
    {
        "Hertfordshire": "hertfordshire"
    },
    {
        ", ": null
    },
    {
        "Kent": "kent"
    },
    {
        ", ": null
    },
    {
        "Middlesex": "middlesex"
    },
    {
        " and ": null
    },
    {
        "Surrey": "surrey"
    },
    {
        ".     Like the rest of the country, London suffered severe unemployment during the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " of the 1930s. In the ": null
    },
    {
        "East End": "east end of london"
    },
    {
        " during the 1930s, politically extreme parties of both right and left flourished. The ": null
    },
    {
        "Communist Party of Great Britain": "communist party of great britain"
    },
    {
        " and the ": null
    },
    {
        "British Union of Fascists": "british union of fascists"
    },
    {
        " both gained serious support. Clashes between right and left culminated in the ": null
    },
    {
        "Battle of Cable Street": "battle of cable street"
    },
    {
        " in 1936. The population of London reached an all-time peak of 8.6  million in 1939.     Large numbers of Jewish immigrants fleeing from ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " settled in London during the 1930s, mostly in the ": null
    },
    {
        "East End": "east end of london"
    },
    {
        ".     Labour Party politician ": null
    },
    {
        "Herbert Morrison": "herbert morrison"
    },
    {
        " was a dominant figure in local government in the 1920s and 1930s. He became mayor of Hackney and a member of the London County Council in 1922, and for a while was Minister of Transport in Ramsay MacDonalds cabinet. When Labour gained power in London in 1934, Morrison unified the bus, tram and trolleybus services with the Underground, by the creation of the ": null
    },
    {
        "London Passenger Transport Board": "london passenger transport board"
    },
    {
        " in 1933., He led the effort to finance and build the new ": null
    },
    {
        "Waterloo Bridge": "waterloo bridge"
    },
    {
        ". He designed the ": null
    },
    {
        "Metropolitan Green Belt": "metropolitan green belt"
    },
    {
        " around the suburbs and worked to clear slums, build schools, and reform public assistance. George W. Jones and Bernard Donoughue, Herbert Morrison: Portrait of a Politician pp 189-210.               During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", London, as many other British cities, suffered severe damage, being bombed extensively by the  Luftwaffe  as a part of ": null
    },
    {
        "The Blitz": "the blitz"
    },
    {
        ". Prior to the bombing, hundreds of thousands of children in London were evacuated to the countryside to avoid the bombing. Civilians took shelter from the air raids in underground stations.     The heaviest bombing took place during ": null
    },
    {
        "The Blitz": "the blitz"
    },
    {
        " between 7 September 1940 and 10 May 1941. During this period, London was subjected to 71 separate raids receiving over 18,000 tonnes of high explosive. One raid in December 1940, which became known as the ": null
    },
    {
        "Second Great Fire of London": "second great fire of london"
    },
    {
        ", saw a ": null
    },
    {
        "firestorm": "firestorm"
    },
    {
        " engulf much of the ": null
    },
    {
        "City of London": "city of london"
    },
    {
        " and destroy many historic buildings. ": null
    },
    {
        "St Pauls Cathedral": "st pauls cathedral"
    },
    {
        ", however, remained unscathed; a photograph showing the Cathedral shrouded in smoke became a famous image of the war. Maureen Hill, The Blitz. Marks and Spencer, 2002     Having failed to defeat Britain, Hitler turned his attention to the ": null
    },
    {
        "Eastern front": "eastern front"
    },
    {
        " and regular bombing raids ceased. They began again, but on a smaller scale with the ": null
    },
    {
        "Little Blitz": "operation steinbock"
    },
    {
        " in early 1944. Towards the end of the war, during 1944/45 London again came under heavy attack by pilotless ": null
    },
    {
        "V-1 flying bombs": "v-1 flying bomb"
    },
    {
        "and ": null
    },
    {
        "V-2 rocket": "v-2 rocket"
    },
    {
        "s, which were fired from Nazi occupied Europe. These attacks only came to an end when their launch sites were captured by advancing Allied forces.     London suffered severe damage and heavy casualties, the worst hit part being the ": null
    },
    {
        "Docklands": "port of london"
    },
    {
        " area. By the wars end, just under 30,000 Londoners had been killed by the bombing, and over 50,000 seriously injured,  homefront website tens of thousands of buildings were destroyed, and hundreds of thousands of people were made homeless. Amy Helen Bell, London was ours: Diaries and memoirs of the London Blitz              Three years after the war, the ": null
    },
    {
        "1948 Summer Olympics": "1948 summer olympics"
    },
    {
        " were held at the original ": null
    },
    {
        "Wembley Stadium": "wembley stadium"
    },
    {
        ", at a time when the city had barely recovered from the war. Londons rebuilding was slow to begin. However, in 1951 the ": null
    },
    {
        "Festival of Britain": "festival of britain"
    },
    {
        " was held, which marked an increasing mood of optimism and forward looking.     In the immediate postwar years housing was a major issue in London, due to the large amount of housing which had been destroyed in the war. The authorities decided upon high-rise ": null
    },
    {
        "blocks of flats": "tower block"
    },
    {
        " as the answer to housing shortages. During the 1950s and 1960s the skyline of London altered dramatically as tower blocks were erected, although these later proved unpopular. In a bid to reduce the number of people living in overcrowded housing, a policy was introduced of encouraging people to move into newly built ": null
    },
    {
        "new towns": "new townunited kingdom"
    },
    {
        " surrounding London. Richard Quentin Donald Hornsey, The Spiv and the Architect: Unruly Life in Postwar London .     Through the 19th and in the early half of the 20th century, Londoners used coal for heating their homes, which produced large amounts of smoke. In combination with climatic conditions this often caused a characteristic smog, and London became known for its typical London Fog , also known as Pea Soupers . London was sometimes referred to as The Smoke because of this. In 1952, this culminated in the disastrous ": null
    },
    {
        "Great Smog of 1952": "great smog of 1952"
    },
    {
        " which lasted for five days and killed over 4,000 people. In response to this, the ": null
    },
    {
        "Clean Air Act 1956": "clean air act 1956"
    },
    {
        " was passed, mandating the creating of smokeless zones where the use of smokeless fuels was required ; the Act was effective. Devra L. Davis, A look back at the London smog of 1952 and the half century since. Environmental health perspectives 110.12 : A734.        Starting in the mid-1960s, and partly as a result of the success of such UK musicians as ": null
    },
    {
        "the Beatles": "the beatles"
    },
    {
        " and ": null
    },
    {
        "The Rolling Stones": "the rolling stones"
    },
    {
        ", London became a centre for the worldwide ": null
    },
    {
        "youth culture": "youth culture"
    },
    {
        ", exemplified by the ": null
    },
    {
        "Swinging London": "swinging london"
    },
    {
        " subculture which made ": null
    },
    {
        "Carnaby Street": "carnaby street"
    },
    {
        " a household name of youth fashion around the world. Londons role as a trendsetter for youth fashion continued strongly in the 1980s during the ": null
    },
    {
        "new wave": "new wave music"
    },
    {
        " and ": null
    },
    {
        "punk": "punk rock"
    },
    {
        " eras and into the mid-1990s with the emergence of the ": null
    },
    {
        "Britpop": "britpop"
    },
    {
        " era.     From the 1950s onwards London became home to a large number of immigrants, largely from ": null
    },
    {
        "Commonwealth": "commonwealth of nations"
    },
    {
        " countries such as ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        ", ": null
    },
    {
        "Bangladesh": "bangladesh"
    },
    {
        ", ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        ", which dramatically changed the face of London, turning it into one of the most diverse cities in Europe. However, the integration of the new immigrants was not always easy. Racial tensions emerged in events such as the ": null
    },
    {
        "Brixton Riots": "1981 brixton riot"
    },
    {
        " in the early 1980s. Matt Cook, ‘Gay Times’: Identity, Locality, Memory, and the Brixton Squats in 1970s London. Twentieth Century British History 241 pp: 84-109.     From the beginning of ": null
    },
    {
        "The Troubles": "the troubles"
    },
    {
        " in ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        " in the early 1970s until the mid-1990s, London was subjected to repeated ": null
    },
    {
        "terrorist attacks": "list of terrorist incidents in london"
    },
    {
        " by the ": null
    },
    {
        "Provisional IRA": "provisional ira"
    },
    {
        ".     The outward expansion of London was slowed by the war, and the introduction of the ": null
    },
    {
        "Metropolitan Green Belt": "metropolitan green belt"
    },
    {
        ". Due to this outward expansion, in 1965 the old ": null
    },
    {
        "County of London": "county of london"
    },
    {
        " and the ": null
    },
    {
        "London County Council": "london county council"
    },
    {
        " were abolished, and the much larger area of ": null
    },
    {
        "Greater London": "greater london"
    },
    {
        " was established with a new ": null
    },
    {
        "Greater London Council": "greater london council"
    },
    {
        " to administer it, along with 32 new ": null
    },
    {
        "London borough": "london borough"
    },
    {
        "s.     Greater Londons population declined steadily in the decades after World War II, from an estimated peak of 8.6  million in 1939 to around 6.8  million in the 1980s. However, it then began to increase again in the late 1980s, encouraged by strong economic performance and an increasingly positive image.     Londons traditional status as a major port declined dramatically in the post-war decades as the old ": null
    },
    {
        "Docklands": "london docklands"
    },
    {
        " could not accommodate large modern container ships. The principal ports for London moved downstream to the ports of ": null
    },
    {
        "Felixstowe": "port of felixstowe"
    },
    {
        " and ": null
    },
    {
        "Tilbury": "port of tilbury"
    },
    {
        ". The docklands area had become largely derelict by the 1980s, but was redeveloped into flats and offices from the mid-1980s onwards. The ": null
    },
    {
        "Thames Barrier": "thames barrier"
    },
    {
        " was completed in the 1980s to protect London against tidal surges from the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        ".     In the early 1980s political disputes between the GLC run by ": null
    },
    {
        "Ken Livingstone": "ken livingstone"
    },
    {
        " and the ": null
    },
    {
        "Conservative": "conservative party"
    },
    {
        " government of ": null
    },
    {
        "Margaret Thatcher": "margaret thatcher"
    },
    {
        " led to the GLCs abolition in 1986, with most of its powers relegated to the ": null
    },
    {
        "London borough": "london borough"
    },
    {
        "s. This left London as the only large metropolis in the world without a central administration.     In 2000, London-wide government was restored, with the creation of the ": null
    },
    {
        "Greater London Authority": "greater london authority"
    },
    {
        " by ": null
    },
    {
        "Tony Blairs": "tony blair"
    },
    {
        "government, covering the same area of Greater London. The new authority had similar powers to the old GLC, but was made up of a directly elected ": null
    },
    {
        "Mayor": "mayor of london"
    },
    {
        " and a ": null
    },
    {
        "London Assembly": "london assembly"
    },
    {
        ". The first election took place on 4 May, with ": null
    },
    {
        "Ken Livingstone": "ken livingstone"
    },
    {
        " comfortably regaining his previous post. London was recognised as one of the nine ": null
    },
    {
        "regions of England": "regions of england"
    },
    {
        ". In global perspective, it was emerging as a ": null
    },
    {
        "World city": "world city"
    },
    {
        " widely compared to New York and Tokyo. Greg Clark, The Making of a World City: London 1991 to 2021            Around the start of the 21st century, London hosted the much derided ": null
    },
    {
        "Millennium Dome": "millennium dome"
    },
    {
        " at ": null
    },
    {
        "Greenwich": "greenwich"
    },
    {
        ", to mark the new century. Other Millennium projects were more successful. One was the largest observation wheel in the world, the Millennium Wheel , or the ": null
    },
    {
        "London Eye": "london eye"
    },
    {
        ", which was erected as a temporary structure, but soon became a fixture, and draws four million visitors a year. The ": null
    },
    {
        "National Lottery": "national lottery"
    },
    {
        " also released a flood of funds for major enhancements to existing attractions, for example the roofing of the Great Court at the ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        ".     The ": null
    },
    {
        "London Plan": "london plan"
    },
    {
        ", published by the ": null
    },
    {
        "Mayor of London": "mayor of london"
    },
    {
        " in 2004, estimated that the population would reach 8.1  million by 2016, and continue to rise thereafter. This was reflected in a move towards denser, more urban styles of building, including a greatly increased number of ": null
    },
    {
        "tall buildings": "tall buildings in london"
    },
    {
        ", and proposals for major enhancements to the public transport network. However, funding for projects such as ": null
    },
    {
        "Crossrail": "crossrail"
    },
    {
        " remained a struggle.     On 6 July 2005 London won ": null
    },
    {
        "the right to host the 2012 Olympics and Paralympics": "london 2012 olympic bid"
    },
    {
        " making it the first city to host the modern games three times. However, celebrations were cut short the following day when the city was rocked by ": null
    },
    {
        "a series of terrorist attacks": "7 july 2005 london bombings"
    },
    {
        ". More than 50 were killed and 750 injured in three bombings on ": null
    },
    {
        "London Underground": "london underground"
    },
    {
        " trains and a fourth on a double decker bus near Kings Cross.     London was the starting point for ": null
    },
    {
        "countrywide riots": "2011 england riots"
    },
    {
        " which occurred in August 2011, when thousands of people rioted in several city boroughs and in towns across England. In 2011, the population grew over 8 million people for the first time in decades. ": null
    },
    {
        "White British": "white british"
    },
    {
        " formed less than half of the population for ": null
    },
    {
        "the first time": "ethnic groups in london2011 census"
    },
    {
        ".     In the public there was ambivalence leading-up to the Olympics,  27 April 2012 though public sentiment changed strongly in their favour following a successful opening ceremony and when the anticipated organisational and transport problems never occurred.               ": null
    },
    {
        "Alexandra Palace": "alexandra palace"
    },
    {
        " Battersea Power Station": "battersea power station"
    },
    {
        " Buckingham Palace": "buckingham palace"
    },
    {
        " Croydon Airport": "croydon airport"
    },
    {
        " Hyde Park": "hyde park, london"
    },
    {
        " Monument to the Great Fire of London": "monument to the great fire of london"
    },
    {
        " Palace of Westminster": "palace of westminster"
    },
    {
        " Parliament Hill": "parliament hill, london"
    },
    {
        " Royal Observatory, Greenwich": "royal observatory, greenwich"
    },
    {
        " St Pauls Cathedral": "st pauls cathedral"
    },
    {
        " Tower Bridge": "tower bridge"
    },
    {
        " Tower of London": "tower of london"
    },
    {
        " Tyburn": "tyburn"
    },
    {
        " Vauxhall station": "vauxhall station"
    },
    {
        " Waterloo International station": "waterloo international railway station"
    },
    {
        " Westminster Abbey": "westminster abbey"
    },
    {
        "   ": null
    }
]