[
    {
        "              The ": null
    },
    {
        "Kingdom of Israel": "Kingdom Of Israel"
    },
    {
        " and the ": null
    },
    {
        "Kingdom of Judah": "Kingdom Of Judah"
    },
    {
        " were related kingdoms from the ": null
    },
    {
        "Iron Age": "Archaeology Of Israeliron Age/Israelite Period"
    },
    {
        " period of the ancient ": null
    },
    {
        "Levant": "History Of The Ancient Levant"
    },
    {
        ". The Kingdom of Israel emerged as an important local power by the 10th century  BCE before falling to the ": null
    },
    {
        "Neo-Assyrian Empire": "Neo-Assyrian Empire"
    },
    {
        " in 722  BCE. Israels southern neighbor, the Kingdom of Judah, emerged in the 8th or 9th century  BCE and later became a ": null
    },
    {
        "client state": "Client State"
    },
    {
        " of first the Neo-Assyrian Empire and then the ": null
    },
    {
        "Neo-Babylonian Empire": "Neo-Babylonian Empire"
    },
    {
        " before a revolt against the latter led to its destruction in 586  BCE. Following the fall of Babylon to the ": null
    },
    {
        "Achaemenid Empire": "Achaemenid Empire"
    },
    {
        " under ": null
    },
    {
        "Cyrus the Great": "Cyrus The Great"
    },
    {
        " in 539  BCE, some Judean exiles returned to ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        ", inaugurating the formative period in the development of a distinctive Judahite identity in the province of ": null
    },
    {
        "Yehud Medinata": "Yehud Medinata"
    },
    {
        ".     During the Hellenistic classic period, Yehud was absorbed into the subsequent ": null
    },
    {
        "Hellenistic kingdoms": "Diadochi"
    },
    {
        " that followed the conquests of ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        ", but in the 2nd century  BCE the Judaeans revolted against the ": null
    },
    {
        "Seleucid Empire": "Seleucid Empire"
    },
    {
        " and created the ": null
    },
    {
        "Hasmonean": "Hasmonean Dynasty"
    },
    {
        " kingdom. This, the last nominally independent kingdom of ": null
    },
    {
        "Israel": "Land Of Israel"
    },
    {
        ", gradually lost its independence from ": null
    },
    {
        "63  BCE": "Siege Of Jerusalem"
    },
    {
        " with its conquest by ": null
    },
    {
        "Pompey": "Pompey"
    },
    {
        " of Rome, becoming a Roman and later Parthian client kingdom. Following the installation of client kingdoms under the ": null
    },
    {
        "Herodian dynasty": "Herodian Dynasty"
    },
    {
        ", the ": null
    },
    {
        "Province of Judea": "Judea"
    },
    {
        " was wracked by civil disturbances, which culminated in the ": null
    },
    {
        "First Jewish–Roman War": "First Jewish–Roman War"
    },
    {
        ", the destruction of the Second Temple, the emergence of ": null
    },
    {
        "Rabbinic Judaism": "Rabbinic Judaism"
    },
    {
        " and ": null
    },
    {
        "Early Christianity": "Early Christianity"
    },
    {
        ". The name Judea ceased to be used by Greco-Romans after the ": null
    },
    {
        "Bar Kochba revolt": "Bar Kochba Revolt"
    },
    {
        " of 135 CE.       ": null
    },
    {
        "Iron Age": "Iron Agenear East Timeline"
    },
    {
        " I: 1200–1000  BCE   Iron Age II: 1000–586  BCE   Neo-Babylonian: 586–539  BCE   Persian: 539–332  BCE   Hellenistic: 333–53  BCE     Other academic terms often used are:   First Temple period , Ingeborg Rennert Center for Jerusalem Studies, Bar-Ilan University, last modified 1997, accessed 11 February 2019   ": null
    },
    {
        "Second Temple period": "Second Temple Period"
    },
    {
        "       The ": null
    },
    {
        "eastern Mediterranean": "Eastern Mediterranean"
    },
    {
        " seaboard the ": null
    },
    {
        "Levant": "Levant"
    },
    {
        " stretches 400 miles north to south from the ": null
    },
    {
        "Taurus Mountains": "Taurus Mountains"
    },
    {
        " to the ": null
    },
    {
        "Sinai Peninsula": "Sinai Peninsula"
    },
    {
        ", and 70 to 100 miles east to west between the sea and the ": null
    },
    {
        "Arabian Desert": "Arabian Desert"
    },
    {
        ". Miller 1986, p. 36. The coastal plain of the southern Levant, broad in the south and narrowing to the north, is backed in its southernmost portion by a zone of foothills, the ": null
    },
    {
        "Shfela": "Shfela"
    },
    {
        "; like the plain this narrows as it goes northwards, ending in the promontory of ": null
    },
    {
        "Mount Carmel": "Mount Carmel"
    },
    {
        ". East of the plain and the Shfela is a mountainous ridge, the hill country of Judah in the south, the hill country of Ephraim north of that, then ": null
    },
    {
        "Galilee": "Galilee"
    },
    {
        " and ": null
    },
    {
        "Mount Lebanon": "Mount Lebanon"
    },
    {
        ". To the east again lie the steep-sided valley occupied by the ": null
    },
    {
        "Jordan River": "Jordan River"
    },
    {
        ", the ": null
    },
    {
        "Dead Sea": "Dead Sea"
    },
    {
        ", and the ": null
    },
    {
        "wadi": "Wadi"
    },
    {
        " of the ": null
    },
    {
        "Arabah": "Arabah"
    },
    {
        ", which continues down to the eastern arm of the ": null
    },
    {
        "Red Sea": "Red Sea"
    },
    {
        ". Beyond the plateau is the Syrian desert, separating the Levant from Mesopotamia. To the southwest is Egypt, to the northeast Mesopotamia. The location and geographical characteristics of the narrow Levant made the area a battleground among the powerful entities that surrounded it. Coogan 1998, pp. 4–7.     ": null
    },
    {
        "Canaan": "Canaan"
    },
    {
        " in the Late Bronze Age was a shadow of what it had been centuries earlier: many cities were abandoned, others shrank in size, and the total settled population was probably not much more than a hundred thousand. Finkelstein 2001, p. 78. Settlement was concentrated in cities along the coastal plain and along major communication routes; the central and northern hill country which would later become the biblical kingdom of Israel was only sparsely inhabited Killebrew 2005, pp. 38–39. although letters from the Egyptian archives indicate that ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        " was already a Canaanite city-state recognising Egyptian overlordship. Cahill in Vaughn 1992, pp. 27–33. Politically and culturally it was dominated by Egypt, Kuhrt 1995, p. 317. each city under its own ruler, constantly at odds with its neighbours, and appealing to the Egyptians to adjudicate their differences.     The Canaanite city state system broke down during the ": null
    },
    {
        "Late Bronze Age collapse": "Late Bronze Age Collapse"
    },
    {
        ", Killebrew 2005, pp. 10–16. and Canaanite culture was then gradually absorbed into that of the ": null
    },
    {
        "Philistines": "Philistines"
    },
    {
        ", ": null
    },
    {
        "Phoenicia": "Phoenicia"
    },
    {
        "ns and ": null
    },
    {
        "Israelites": "Israelites"
    },
    {
        ". Golden 2004b, pp. 61–62. The process was gradual McNutt 1999, p. 47. and a strong ": null
    },
    {
        "Egyptian": "Ancient Egypt"
    },
    {
        " presence continued into the 12th century  BCE, and, while some Canaanite cities were destroyed, others continued to exist in Iron Age I. Golden 2004a, p. 155.          The name Israel first appears in the ": null
    },
    {
        "Merneptah Stele": "Merneptah Stele"
    },
    {
        " c. 1209  BCE: Israel is laid waste and his seed is no more. Stager in Coogan 1998, p. 91. This Israel was a cultural and probably political entity, well enough established for the Egyptians to perceive it as a possible challenge, but an ": null
    },
    {
        "ethnic group": "Ethnic Group"
    },
    {
        " rather than an organised state; Dever 2003, p. 206. Archaeologist Paula McNutt says: It is probably ... during Iron Age I a population began to identify itself as Israelite, differentiating itself from its neighbours via prohibitions on ": null
    },
    {
        "intermarriage": "Cultural Exogamy"
    },
    {
        ", an emphasis on ": null
    },
    {
        "family history": "Family History"
    },
    {
        " and ": null
    },
    {
        "genealogy": "Genealogy"
    },
    {
        ", and religion. McNutt 1999, p. 35.     In the Late Bronze Age there were no more than about 25 villages in the highlands, but this increased to over 300 by the end of Iron Age I, while the settled population doubled from 20,000 to 40,000. McNutt 1999, pp. 46–47. The villages were more numerous and larger in the north, and probably shared the highlands with ": null
    },
    {
        "pastoral": "Pastoralism"
    },
    {
        " nomad": "Nomad"
    },
    {
        "s, who left no remains. McNutt 1999, p. 69. Archaeologists and historians attempting to trace the origins of these villagers have found it impossible to identify any distinctive features that could define them as specifically Israelite ": null
    },
    {
        "collared-rim jars": "Pithos"
    },
    {
        " and four-room houses have been identified outside the highlands and thus cannot be used to distinguish Israelite sites, Miller 1986, p. 72. and while the pottery of the highland villages is far more limited than that of lowland Canaanite sites, it develops typologically out of Canaanite pottery that came before. Killebrew 2005, p. 13. ": null
    },
    {
        "Israel Finkelstein": "Israel Finkelstein"
    },
    {
        " proposed that the oval or circular layout that distinguishes some of the earliest highland sites, and the notable absence of pig bones from hill sites, could be taken as markers of ethnicity, but others have cautioned that these can be a common-sense adaptation to highland life and not necessarily revelatory of origins. Edelman in Brett 2002, pp. 46–47. Other Aramaean sites also demonstrate a contemporary absence of pig remains at that time, unlike earlier Canaanite and later Philistine excavations.        In  The Bible Unearthed  , Finkelstein and Silberman summarised recent studies. They described how, up until 1967, the Israelite heartland in the highlands of western Palestine was virtually an archaeological terra incognita. Since then, intensive surveys have examined the traditional territories of the tribes of Judah, Benjamin, Ephraim, and Manasseh. These surveys have revealed the sudden emergence of a new culture contrasting with the Philistine and Canaanite societies existing in the ": null
    },
    {
        "Land of Israel": "Land Of Israel"
    },
    {
        " earlier during Iron Age I. Finkelstein and Silberman Free Press, New York, p. 107,  This new culture is characterised by a lack of pork remains , by an abandonment of the Philistine/Canaanite custom of having highly decorated pottery, and by the practice of circumcision. The Israelite ethnic identity had originated, not from ": null
    },
    {
        "the Exodus": "The Exodus"
    },
    {
        " and a subsequent ": null
    },
    {
        "conquest": "Conquest Of Canaan"
    },
    {
        ", but from a transformation of the existing Canaanite-Philistine cultures. Avraham Faust, “How Did Israel Become a People? The Genesis of Israelite Identity”, Biblical Archaeology Review 201 : 62–69, 92–94.        Modern scholars therefore see Israel arising peacefully and internally from existing people in the highlands of Canaan.   Compare:           Unusually favourable climatic conditions in the first two centuries of Iron Age II brought about an expansion of population, settlements and trade throughout the region. Thompson 1992, p. 408. In the central highlands this resulted in unification in a kingdom with the ": null
    },
    {
        "city of Samaria": "Samaria"
    },
    {
        " as its capital, possibly by the second half of the 10th century  BCE when an inscription of the Egyptian pharaoh ": null
    },
    {
        "Shoshenq I": "Shoshenq I"
    },
    {
        ", the biblical ": null
    },
    {
        "Shishak": "Shishak"
    },
    {
        ", records a series of campaigns directed at the area. Mazar in Finkelstein 2007, p. 163. Israel had clearly emerged by the middle of the 9th century  BCE, when the Assyrian king ": null
    },
    {
        "Shalmaneser III": "Shalmaneser Iii"
    },
    {
        " names ": null
    },
    {
        "Ahab": "Ahab"
    },
    {
        " the Israelite among his enemies at the ": null
    },
    {
        "battle of Qarqar": "Battle Of Qarqar"
    },
    {
        " . At this time Israel was apparently engaged in a three-way contest with Damascus and Tyre for control of the ": null
    },
    {
        "Jezreel Valley": "Jezreel Valley"
    },
    {
        " and Galilee in the north, and with ": null
    },
    {
        "Moab": "Moab"
    },
    {
        ", ": null
    },
    {
        "Ammon": "Ammon"
    },
    {
        " and ": null
    },
    {
        "Aram Damascus": "Aram Damascus"
    },
    {
        " in the east for control of ": null
    },
    {
        "Gilead": "Gilead"
    },
    {
        "; the ": null
    },
    {
        "Mesha Stele": "Mesha Stele"
    },
    {
        " , left by a king of Moab, celebrates his success in throwing off the oppression of the House of ": null
    },
    {
        "Omri": "Omri"
    },
    {
        " . It bears what is generally thought to be the earliest extra-biblical reference to the name  Yahweh .  A century later Israel came into increasing conflict with the expanding ": null
    },
    {
        "Neo-Assyrian Empire": "Neo-Assyrian Empire"
    },
    {
        ", which first split its territory into several smaller units and then destroyed its capital, Samaria . Both the biblical and Assyrian sources speak of a massive deportation of people from Israel and their replacement with settlers from other parts of the empire such ": null
    },
    {
        "population exchanges": "Population Transfer"
    },
    {
        " were an established part of Assyrian imperial policy, a means of breaking the old power structure and the former Israel never again became an independent political entity. Lemche 1998, p. 85.        Judah emerged as an operational kingdom somewhat later than Israel, probably during the 9th century  BCE, but the subject is one of considerable controversy. Grabbe 2008, pp. 225–26. There are indications that during the 10th and 9th centuries  BCE, the southern highlands had been divided between a number of centres, none with clear primacy. Lehman in Vaughn 1992, p. 149. During the reign of ": null
    },
    {
        "Hezekiah": "Hezekiah"
    },
    {
        ", between c. 715 and 686  BCE, a notable increase in the power of the ": null
    },
    {
        "Judean": "Judean"
    },
    {
        " state can be observed. David M. Carr, Writing on the Tablet of the Heart: Origins of Scripture and Literature, Oxford University Press, 2005, 164. This is reflected in archaeological sites and findings, such as the ": null
    },
    {
        "Broad Wall": "Broad Wall"
    },
    {
        "; a defensive city wall in ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        "; and the ": null
    },
    {
        "Siloam tunnel": "Siloam Tunnel"
    },
    {
        ", an aqueduct designed to provide Jerusalem with water during an impending siege by the Neo-Assyrian Empire led by ": null
    },
    {
        "Sennacherib": "Sennacherib"
    },
    {
        "; and the ": null
    },
    {
        "Siloam inscription": "Siloam Inscription"
    },
    {
        ", a lintel inscription found over the doorway of a tomb, has been ascribed to comptroller ": null
    },
    {
        "Shebna": "Shebna"
    },
    {
        ". ": null
    },
    {
        "LMLK seals": "Lmlk Seal"
    },
    {
        "on storage jar handles, excavated from strata in and around that formed by Sennacheribs destruction, appear to have been used throughout Sennacheribs 29-year reign, along with ": null
    },
    {
        "bullae": "Bulla"
    },
    {
        " from sealed documents, some that belonged to Hezekiah himself and others that name his servants.      In the 7th century Jerusalem grew to contain a population many times greater than earlier and achieved clear dominance over its neighbours. Thompson 1992, pp. 410–11. This occurred at the same time that Israel was being destroyed by the Neo-Assyrian Empire, and was probably the result of a cooperative arrangement with the Assyrians to establish Judah as an Assyrian ": null
    },
    {
        "vassal state": "Vassal State"
    },
    {
        " controlling the valuable olive industry. Judah prospered as a vassal state , but in the last half of the 7th century  BCE, Assyria suddenly collapsed, and the ensuing competition between Egypt and the ": null
    },
    {
        "Neo-Babylonian Empire": "Neo-Babylonian Empire"
    },
    {
        " for control of the land led to the destruction of Judah in a series of campaigns between 597 and 582.             Babylonian Judah suffered a steep decline in both economy and population Grabbe 2004, p. 28. and lost the Negev, the Shephelah, and part of the Judean hill country, including Hebron, to encroachments from Edom and other neighbours. ": null
    },
    {
        "Lemaire": "André Lemaire"
    },
    {
        " in Blenkinsopp 2003, p. 291. Jerusalem, while probably not totally abandoned, was much smaller than previously, and the town of ": null
    },
    {
        "Mizpah in Benjamin": "Mizpah In Benjamin"
    },
    {
        " in the relatively unscathed northern section of the kingdom became the capital of the new Babylonian province of ": null
    },
    {
        "Yehud Medinata": "Yehud Medinata"
    },
    {
        ". Davies 2009. . Lipschits 2005, p. 48. There is also a strong probability that for most or all of the period the temple at ": null
    },
    {
        "Bethel": "Bethel"
    },
    {
        " in Benjamin replaced that at Jerusalem, boosting the prestige of Bethels priests against those of Jerusalem , now in exile in Babylon. Blenkinsopp in Blenkinsopp 2003, pp. 103–05.     The Babylonian conquest entailed not just the destruction of Jerusalem and its temple, but the liquidation of the entire infrastructure which had sustained Judah for centuries. Blenkinsopp 2009, p. 228. The most significant casualty was the state ideology of Zion theology, Middlemas 2005, pp. 1–2. the idea that the god of Israel had chosen Jerusalem for his dwelling-place and that the ": null
    },
    {
        "Davidic dynasty": "Davidic Dynasty"
    },
    {
        " would reign there forever. Miller 1986, p. 203. The fall of the city and the end of Davidic kingship forced the leaders of the exile community kings, priests, scribes and prophets to reformulate the concepts of community, faith and politics. Middlemas 2005, p. 2. The exile community in Babylon thus became the source of significant portions of the Hebrew Bible: ": null
    },
    {
        "Isaiah": "Book Of Isaiah"
    },
    {
        " 40–55; ": null
    },
    {
        "Ezekiel": "Book Of Ezekiel"
    },
    {
        "; the final version of ": null
    },
    {
        "Jeremiah": "Book Of Jeremiah"
    },
    {
        "; the work of the hypothesized ": null
    },
    {
        "priestly source": "Priestly Source"
    },
    {
        " in the ": null
    },
    {
        "Pentateuch": "Pentateuch"
    },
    {
        "; and the final form of the history of Israel from ": null
    },
    {
        "Deuteronomy": "Deuteronomy"
    },
    {
        " to ": null
    },
    {
        "2 Kings": "Books Of Kings"
    },
    {
        ". Middlemas 2005, p. 10. Theologically, the Babylonian exiles were responsible for the doctrines of individual responsibility and universalism and for the increased emphasis on purity and holiness. Most significantly, the trauma of the exile experience led to the development of a strong sense of Hebrew identity distinct from other peoples, Middlemas 2005, p. 17. with increased emphasis on symbols such as circumcision and Sabbath-observance to sustain that distinction. Bedford 2001, p. 48.     The concentration of the biblical literature on the experience of the exiles in Babylon disguises the fact that the great majority of the population remained in Judah; for them, life after the fall of Jerusalem probably went on much as it had before. Barstad 2008, p. 109. It may even have improved, as they were rewarded with the land and property of the deportees, much to the anger of the community of exiles remaining in Babylon. Albertz 2003a, p. 92. The assassination around 582 of the Babylonian governor by a disaffected member of the former royal House of David provoked a Babylonian crackdown, possibly reflected in the ": null
    },
    {
        "Book of Lamentations": "Book Of Lamentations"
    },
    {
        ", but the situation seems to have soon stabilised again. Albertz 2003a, pp. 95–96. Nevertheless, those unwalled cities and towns that remained were subject to slave raids by the Phoenicians and intervention in their internal affairs by ": null
    },
    {
        "Samaritan": "Samaritan"
    },
    {
        "s, Arabs, and Ammonites. Albertz 2003a, p. 96.          When Babylon fell to the Persian ": null
    },
    {
        "Cyrus the Great": "Cyrus The Great"
    },
    {
        " in 539  BCE, Judah  became an administrative division within the ": null
    },
    {
        "Persian empire": "Achaemenid Empire"
    },
    {
        ". Cyrus was succeeded as king by ": null
    },
    {
        "Cambyses": "Cambyses"
    },
    {
        ", who added Egypt to the empire, incidentally transforming Yehud and the Philistine plain into an important frontier zone. His death in 522 was followed by a period of turmoil until ": null
    },
    {
        "Darius the Great": "Darius The Great"
    },
    {
        " seized the throne in about 521. Darius introduced a reform of the administrative arrangements of the empire including the collection, codification and administration of local law codes, and it is reasonable to suppose that this policy lay behind the redaction of the Jewish ": null
    },
    {
        "Torah": "Torah"
    },
    {
        ". Blenkinsopp 1988, p. 64. After 404 the Persians lost control of Egypt, which became Persias main rival outside Europe, causing the Persian authorities to tighten their administrative control over Yehud and the rest of the Levant. Lipschits in Lipschits 2006, pp. 86–89. Egypt was eventually reconquered, but soon afterward Persia fell to ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        ", ushering in the Hellenistic period in the Levant.     Yehuds population over the entire period was probably never more than about 30,000 and that of Jerusalem no more than about 1,500, most of them connected in some way to the Temple. Grabbe 2004, pp. 29–30. According to the biblical history, one of the first acts of ": null
    },
    {
        "Cyrus": "Cyrus The Great"
    },
    {
        ", the Persian conqueror of Babylon, was to commission Jewish exiles to return to Jerusalem and rebuild their Temple, a task which they are said to have completed c. 515. Nodet 1999, p. 25. Yet it was probably not until the middle of the next century, at the earliest, that Jerusalem again became the capital of Judah. Davies in Amit 2006, p. 141. The Persians may have experimented initially with ruling Yehud as a Davidic client-kingdom under descendants of ": null
    },
    {
        "Jehoiachin": "Jehoiachin"
    },
    {
        ", Niehr in Becking 1999, p. 231. but by the mid–5th century  BCE, Yehud had become, in practice, a theocracy, ruled by hereditary high priests, Wylen 1996, p. 25. with a Persian-appointed governor, frequently Jewish, charged with keeping order and seeing that taxes were collected and paid. Grabbe 2004, pp. 154–55. According to the biblical history, ": null
    },
    {
        "Ezra": "Ezra"
    },
    {
        " and ": null
    },
    {
        "Nehemiah": "Nehemiah"
    },
    {
        " arrived in Jerusalem in the middle of the 5th century  BCE, the former empowered by the Persian king to enforce the Torah, the latter holding the status of governor with a royal commission to restore Jerusalems walls. Soggin 1998, p. 311. The biblical history mentions tension between the returnees and those who had remained in Yehud, the returnees rebuffing the attempt of the peoples of the land to participate in the rebuilding of the Temple; this attitude was based partly on the exclusivism that the exiles had developed while in Babylon and, probably, also partly on disputes over property. Miller 1986, p. 458. During the 5th century  BCE, ": null
    },
    {
        "Ezra": "Ezra"
    },
    {
        " and ": null
    },
    {
        "Nehemiah": "Nehemiah"
    },
    {
        " attempted to re-integrate these rival factions into a united and ritually pure society, inspired by the prophecies of ": null
    },
    {
        "Ezekiel": "Ezekiel"
    },
    {
        " and his followers. Blenkinsopp 2009, p. 229.     The Persian era, and especially the period between 538 and 400  BCE, laid the foundations for the unified Judaic religion and the beginning of a scriptural canon. Albertz 1994, pp. 437–38. Other important landmarks in this period include the replacement of Hebrew as the everyday language of Judah by Aramaic Kottsieper in Lipschits 2006, pp. 109–10. and Dariuss reform of the empires bureaucracy, which may have led to extensive revisions and reorganizations of the Jewish ": null
    },
    {
        "Torah": "Torah"
    },
    {
        ". The Israel of the Persian period consisted of descendants of the inhabitants of the old kingdom of Judah, returnees from the Babylonian exile community, Mesopotamians who had joined them or had been exiled themselves to Samaria at a far earlier period, Samaritans, and others. Becking in Albertz 2003b, p. 19.             The beginning of the Hellenistic Period is marked by the conquest of ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        " . When Alexander died in 323, he had no heirs that were able to take his place as ruler of his empire, so his generals divided the empire among themselves.  ": null
    },
    {
        "Ptolemy I": "Ptolemy I"
    },
    {
        " asserted himself as the ruler of Egypt in 322 and seized ": null
    },
    {
        "Yehud Medinata": "Yehud Medinata"
    },
    {
        " in 320, but his successors lost it in 198 to the ": null
    },
    {
        "Seleucids": "Seleucids"
    },
    {
        " of Syria. At first, relations between Seleucids and Jews were cordial, but the attempt of ": null
    },
    {
        "Antiochus IV Epiphanes": "Antiochus Iv Epiphanes"
    },
    {
        " to impose Hellenic cults on Judea sparked the ": null
    },
    {
        "Maccabean Revolt": "Maccabean Revolt"
    },
    {
        " that ended in the expulsion of the Seleucids and the establishment of an independent Jewish kingdom under the ": null
    },
    {
        "Hasmonean": "Hasmonean"
    },
    {
        " dynasty. Some modern commentators see this period also as a civil war between orthodox and ": null
    },
    {
        "hellenized Jews": "Hellenistic Judaism"
    },
    {
        ".   Hasmonean kings attempted to revive the Judah described in the Bible: a Jewish monarchy ruled from Jerusalem and including all territories once ruled by David and Solomon. In order to carry out this project, the ": null
    },
    {
        "Hasmoneans": "Hasmonean"
    },
    {
        "forcibly converted one-time Moabites, Edomites, and Ammonites to Judaism, as well as the lost kingdom of Israel. Davies 1992, pp. 149–50. Some scholars argue that the Hasmonean dynasty institutionalized the final ": null
    },
    {
        "Jewish biblical canon": "Development Of The Hebrew Bible Canon"
    },
    {
        ". Philip R. Davies in The Canon Debate, p. 50: With many other scholars, I conclude that the fixing of a canonical list was almost certainly the achievement of the Hasmonean dynasty.       Ptolemy I took control of Egypt in 322 BCE after the death of Alexander the Great. He also took control of Yehud Medinata in 320 because he was very aware that it was a great place to attack Egypt from and was also a great defensive position. However, there were others who also had their eyes on that area. Another former general, ": null
    },
    {
        "Antigonus Monophthalmus,": "Antigonus I Monophthalmus"
    },
    {
        " had driven out the ": null
    },
    {
        "satrap": "Satrap"
    },
    {
        " of Babylon, Seleucus, in 317 and continued on towards the Levant. Seleucus found refuge with Ptolemy and they both rallied troops against Antigonus’ son ": null
    },
    {
        "Demetrius": "Demetrius I Of Macedon"
    },
    {
        ", since Antigonus had retreated back to Asia Minor. Demetrius was defeated at the battle of Gaza and Ptolemy regained control of Yehud Medinata. However, not soon after this Antigonus came back and forced Ptolemy to retreat back to Egypt. This went on until the ": null
    },
    {
        "Battle of Ipsus": "Battle Of Ipsus"
    },
    {
        " in 301 where Seleucus armies defeated Antigonus. Seleucus was given the areas of Syria and Palestine, but Ptolemy would not give up those lands, causing the ": null
    },
    {
        "Syrian Wars": "Syrian Wars"
    },
    {
        " between the Ptolemies and Seleucids. Not much is known about the happenings of those in Yehud Medinata from the time of Alexanders death until the Battle of Ipsus due to the frequent battles.  At first, the Jews were content with Ptolemys rule over them. His reign brought them peace and economic stability. He also allowed them to keep their religious practices, so long as they paid their taxes and didn’t rebel.  After Ptolemy I came ": null
    },
    {
        "Ptolemy II Philadelphus": "Ptolemy Ii Philadelphus"
    },
    {
        ", who was able to keep the territory of Yehud Medinata and brought the dynasty to the peak of its power. He was victorious in both the first and second Syrian Wars, but after trying to end the conflict with the Seleucids by arranging a marriage between his daughter Berenice and the Seleucid king Antiochus II, he died. The arranged marriage did not work and Berenice, Antiochus, and their child were killed from an order of Antiochus former wife. This was one of the reasons for the third Syrian War. Before all of this, Ptolemy II fought and defeated the ": null
    },
    {
        "Nabataeans": "Nabataeans"
    },
    {
        ". In order to enforce his hold on them, he reinforced many cities in Palestine and built new ones. As a result of this, more Greeks and Macedonians moved to those new cities and brought over their customs and culture, or Hellenism. The Ptolemaic Rule also gave rise to tax farmers. These were the bigger farmers who collected the high taxes of the smaller farmers. These farmers made a lot of money off of this, but it also put a rift between the aristocracy and everyone else. During the end of the Third Syrian War, the high priest ": null
    },
    {
        "Onias II": "Onias Ii"
    },
    {
        " would not pay the tax to the ": null
    },
    {
        "Ptolemy III Euergetes": "Ptolemy Iii Euergetes"
    },
    {
        ". It is thought that this shows a turning point in the Jews support of the Ptolemies.  The Fourth and Fifth Syrian Wars marked the end of the Ptolemaic control of Palestine. Both of these wars hurt Palestine more than the previous three. That and the combination of the ineffective rulers ": null
    },
    {
        "Ptolemy IV Philopater": "Ptolemy Iv Philopator"
    },
    {
        " and ": null
    },
    {
        "Ptolemy V": "Ptolemy V Epiphanes"
    },
    {
        " and the might of the large Seleucid army ended the century-long rule of the Ptolemaic Dynasty over Palestine.           The Seleucid Rule of Palestine began in 198 BCE under ": null
    },
    {
        "Antiochus III": "Antiochus Iii The Great"
    },
    {
        ". He, like the Ptolemies, let the Jews keep their religion and customs and even went so far as to encourage the rebuilding of the temple and city after they welcomed him so warmly into Jerusalem.  However, Antiochus owed the Romans a great deal of money. In order to raise this money, he decided to rob a temple. The people at the temple of Bel in Elam were not pleased, so they killed Antiochus and everyone helping him in 187 BCE. He was succeeded by his son ": null
    },
    {
        "Seleucus IV Philopater": "Seleucus Iv Philopator"
    },
    {
        ". He simply defended the area of Palestine from Ptolemy V before being murdered by his minister in 175. His brother ": null
    },
    {
        "Antiochus IV Epiphanes": "Antiochus Iv Epiphanes"
    },
    {
        " took his place. Before he killed the king, the minister ": null
    },
    {
        "Heliodorus": "Heliodorus"
    },
    {
        " had tried to steal the treasures the temple in Jerusalem. He was informed of this knowledge by a rival of the current High Priest ": null
    },
    {
        "Onias III": "Onias Iii"
    },
    {
        ". Heliodorus was not allowed into the temple, but it required Onias to go explain to the king why one of his ministers was denied access somewhere. In his absence, his rivals put up a new high priest. Onias brother Jason took his place.  Now with Jason as high priest and Antiochus IV as king, many Jews adopted Hellenistic ways. Some of these ways, as stated in the Book of 1 Maccabees, were the building of a gymnasium, finding ways to hide their circumcision, and just generally not abiding by the holy covenant.  This leads to the beginning of the Maccabean Revolt.     According to the Book of Maccabees, many Jews were not happy with the way Hellenism had spread into Judea. Some of these Jews were Mattathias and his sons. Mattathias refused to offer sacrifice when the king told him to. He killed a Jew who was going to do so as well as the kings representative. Because of this, Mattathias and his sons had to flee. This marks the true beginning of the Maccabean Revolt. ": null
    },
    {
        "Judas Maccabeus": "Judas Maccabeus"
    },
    {
        " became the leader of the rebels. He proved to be a successful general, defeating an army lead by Apollonius. They started to catch the attention of King Antiochus IV in 165, who told his chancellor to put and end to the revolt. The chancellor, ": null
    },
    {
        "Lysias": "Lysias"
    },
    {
        ", sent three generals to do just that, but they were all defeated by the Maccabees. Soon after, Lysias went himself but, according to 1 and 2 Maccabees he is defeated. There is evidence to show that it was not that simple and that there was negotiation, but Lysias still left. After the death of Antiochus IV in 164, his son, ": null
    },
    {
        "Antiochus V": "Antiochus V Eupator"
    },
    {
        ", gave the Jews religious freedom. Lysias claimed to be his regent. Around this time was the re-dedication of the temple. During the siege of the Acra, one of Judas brothers, Eleazor, was killed. The Maccabees had to retreat back to Jerusalem, where they should have been beaten badly. However, Lysias had to pull out because of a contradiction of who was to be regent for Antiochus V. Shortly after, both were killed by ": null
    },
    {
        "Demetrius I Soter": "Demetrius I Soter"
    },
    {
        " who became the new king. The new high priest, ": null
    },
    {
        "Alcimus": "Alcimus"
    },
    {
        ", had come to Jerusalem with the company of an army lead by Bacchides.  A group of scribes called the ": null
    },
    {
        "Hasideans": "Hasideans"
    },
    {
        " asked him for his word that he would not harm anyone. He agreed, but killed sixty of them.  Around this time Judas is able to make a treaty with the Romans. Soon after this, Judas is killed in Jerusalem fighting Bacchides army. His brother ": null
    },
    {
        "Jonathan": "Jonathan Apphus"
    },
    {
        " succeeds him. For eight years, Jonathan doesnt do much. However, in 153 the Seleucid Empire started to face some problems. Jonathan used this chance to exchange his services of troops for Demetrius so that he could take back Jerusalem. He was appointed high priest by ": null
    },
    {
        "Alexander Balas": "Alexander Balas"
    },
    {
        " for the same thing. When conflicts between Egypt and the Seleucids arose, Jonathan occupied the Acra. As conflicts over the throne arose, he completely took control of the Acra. But in 142 he was killed.  His brother Simon took his place.        Simon was nominated for the title of high priest, general, and leader by a great assembly . He reached out to Rome to have them guarantee that Judea would be an independent land. ": null
    },
    {
        "Antiochus VII": "Antiochus Vii Sidetes"
    },
    {
        " wanted the cities of Gadara, Joppa, and the Acra back. He also wanted a very large tribute. Simon only wanted to pay a fraction of that for only two of the cites, so Antiochus sent his general Cendebaeus to attack. The general was killed and the army fled. Simon and two of his sons were killed in a plot to overthrow the Hasmoneans. His last remaining son, ": null
    },
    {
        "John Hyrcanus": "John Hyrcanus"
    },
    {
        ", was supposed to be killed as well, but he was informed of the plan and rushed to Jerusalem to keep it safe. Hyrcanus had many issues to deal with as the new high priest. Antiochus invaded Judea and besieged Jerusalem in 134 BCE. Due to lack of food, Hyrcanus had to make a deal with Antiochus. He had to pay a large sum of money, tear down the walls of the city, acknowledge Seleucid power over Judea, and help the Seleucids fight against the ": null
    },
    {
        "Parthians": "Parthian Empire"
    },
    {
        ". Hyrcanus agreed to this, but the war against the Parthians didnt work and Antiochus died in 128. Hyrcanus was able to take back Judea and keep his power. John Hyrcanus also kept good relations with the Roman and the Egyptians, owing to the large number of Jews living there, and conquered ": null
    },
    {
        "Transjordan": "Transjordan"
    },
    {
        ", ": null
    },
    {
        "Samaria": "Samaria"
    },
    {
        ", On the destruction of the Samaritan temple on Mount Gerizim by John Hyrcanus, see for instance: Menahem Mor, The Persian, Hellenistic and Hasmonean Period, in The Samaritans 1–18;  and ": null
    },
    {
        "Idumea": "Idumea"
    },
    {
        " .   ": null
    },
    {
        "Aristobulus I": "Aristobulus I"
    },
    {
        " was the first Hasmonean priest-king. He defied his fathers wishes that his mother should take over the government and instead had her and all of his brothers except for one thrown in prison. The one not thrown in prison was later killed on his orders. The most significant thing he did during his one-year-reign was conquer most of ": null
    },
    {
        "Galilee": "Galilee"
    },
    {
        ". After his death, he was succeeded by his brother ": null
    },
    {
        "Alexander Jannaeus": "Alexander Jannaeus"
    },
    {
        ", who was only concerned with power and conquest. He also married his brothers widow, showing little respect for Jewish law. His first conquest was Ptolemais. The people called to Ptolemy IX for aid, as he was in Cyprus. However, it was his mother, Cleopatra III, who came to help Alexander and not her son. Alexander was not a popular ruler. This caused a civil war in Jerusalem that lasted for six years. After Alexander Janaeaus death, his widow became ruler, but not high priest. The end of the Hasmonean Dynasty was in 63 when the Romans came at the request of the current priest-king Aristobulus II and his competitor Hyrcanus II. In 63  BCE the Roman general ": null
    },
    {
        "Pompey": "Pompey"
    },
    {
        " conquered Jerusalem and the Romans put Hyrcanus II up as high priest, but Judea became a client-kingdom of Rome. The dynasty came to an end in 40 BCE when Herod was crowned king of Judah by the Romans. With their help, Herod had seized Jerusalem by 37.        In 40–39  BCE, ": null
    },
    {
        "Herod the Great": "Herod The Great"
    },
    {
        " was appointed ": null
    },
    {
        "King of the Jews": "Herodian Dynasty"
    },
    {
        " by the ": null
    },
    {
        "Roman Senate": "Roman Senate"
    },
    {
        ", and in 6  CE the last ": null
    },
    {
        "ethnarch": "Ethnarch"
    },
    {
        " of Judea was deposed by the emperor ": null
    },
    {
        "Augustus": "Augustus"
    },
    {
        ", his territories combined with ": null
    },
    {
        "Idumea": "Idumea"
    },
    {
        " and ": null
    },
    {
        "Samaria": "Samaria"
    },
    {
        " and annexed as ": null
    },
    {
        "Iudaea Province": "Iudaea Province"
    },
    {
        " under direct ": null
    },
    {
        "Roman": "Roman Empire"
    },
    {
        " administration. Ben-Sasson 1976, p. 246.           ": null
    },
    {
        "Henotheism": "Henotheism"
    },
    {
        " is defined in the dictionary as adherence to one god out of several.  Many scholars believe that before monotheism in ancient Israel came a transitional period in between ": null
    },
    {
        "polytheism": "Polytheism"
    },
    {
        " and ": null
    },
    {
        "monotheism": "Monotheism"
    },
    {
        ". In this transitional period many followers of the Israelite religion worshiped the god Yahweh but did not deny the existence of other deities accepted throughout the region.  Some scholars attribute this henotheistic period to influences from Mesopotamia. There are strong arguments that Mesopotamia, particularly Assyria shared the concept of the cult of ": null
    },
    {
        "Ashur": "Ashur"
    },
    {
        " with Israel.  This concept entailed adopting the gods of other cultures into their ": null
    },
    {
        "pantheon": "Pantheon"
    },
    {
        ", with Ashur as the supreme god of all the others. This concept is believed to have influenced the transitional period in Israelite religion in which many people were henotheists. Israelite religion shares many characteristics with ": null
    },
    {
        "Canaanite religion": "Ancient Canaanite Religion"
    },
    {
        ", which itself was formed with influence from ": null
    },
    {
        "Mesopotamian religious": "Ancient Mesopotamian Religion"
    },
    {
        " traditions.  Using Canaanite religion as a base was natural due to the fact that the Canaanite culture inhabited the same region prior to the emergence of Israelite culture.  Canaanite religion was a polytheistic religion in which many gods represented unique concepts. Many scholars agree that the Israelite god of Yahweh was adopted from the Canaanite god ": null
    },
    {
        "El": "El"
    },
    {
        ". El was the creation god and as such it makes sense for the Israelite supreme god to have El’s characteristics. Monotheism in the region of ancient Israel and Judah did not take hold over night and during the intermediate stages most people are believed to have been henotheistic. Before the emergence of Yahweh as the patron god of the region of ancient Israel and Judah not all worshiped him alone, or even at all. The word Israel is based on the name El rather than Yahweh.         During this intermediate period of henotheism many families worshiped different gods. Religion was very much centered around the family, as opposed to the community. People sparsely populated the region of Israel and Judah during the time of Moses. As such many different areas worshiped different gods, due to social isolation.  It was not until later on in Israelite history that people started to worship Yahweh alone and fully convert to monotheistic values. That switch occurred with the growth of power and influence of the Israelite kingdom and its rulers and can be read about further in the Iron Age Yahwism section below. Evidence from the bible suggests that henotheism did exist: They went and served alien gods and paid homage to them, gods of whom they had no experience and whom he did not allot to them . Many believe that this quote goes to show that the early Israelite kingdom followed similar traditions as ancient Mesopotamia, where each major urban center had a supreme god. Each culture then embraced their patron god but did not deny the existence of other cultures patron gods. In Assyria, the patron god was Ashur, and in ancient Israel, it was Yahweh; however, both Israelite and Assyrian cultures recognized each others deities during this period.     Some scholars have used the Bible as evidence to argue that most of the people alive during the events recounted in the Old Testament, including Moses, were most likely henotheists. There are many quotes from the Old Testament support this point of view. One quote from Jewish and Christian tradition that supports this claim is the first commandment which in its entirety reads I am the LORD your God, who brought you out of the land of Egypt, out of the house of bondage. You shall have no other gods before me.  This quote does not deny the existence of other gods; it merely states that Jews and Christians should consider Yahweh or God the supreme god, incomparable to other supernatural beings. Some scholars attribute the concept of angels and demons found in Judaism and Christianity to the tradition of henotheism. Instead of completely getting rid of the concept of other supernatural beings, these religions changed former deities into angels and demons. Yahweh became the supreme god governing angels, demons and humans, with angels and demons considered more powerful than the average human. This tradition of believing in multiple forms of supernatural beings is attributed by many to the traditions of ancient Mesopotamia and Canaan and their pantheons of gods. Earlier influences from Mesopotamia and Canaan were important in creating the foundation of Israelite religion consistent with the Kingdoms of ancient Israel and Judah, and have since left lasting impacts on some of the biggest and most widespread religions in our world today.          The religion of the Israelites of Iron Age I, like the ": null
    },
    {
        "Ancient Canaanite religion": "Ancient Canaanite Religion"
    },
    {
        " from which it evolved and other ": null
    },
    {
        "religions of the ancient Near East": "Religions Of The Ancient Near East"
    },
    {
        ", was based on a cult of ancestors and worship of family gods . Tubbs, Jonathan The Canaanites Van der Toorn 1996, p. 4. With the emergence of the monarchy at the beginning of Iron Age II the kings promoted their family god, ": null
    },
    {
        "Yahweh": "Yahweh"
    },
    {
        ", as the ": null
    },
    {
        "god of the kingdom": "Henotheism"
    },
    {
        ", but beyond the royal court, religion continued to be both polytheistic and family-centered. Van der Toorn 1996, pp. 181–82. The major deities were not numerous ": null
    },
    {
        "El": "El"
    },
    {
        ", ": null
    },
    {
        "Asherah": "Asherah"
    },
    {
        ", and Yahweh, with ": null
    },
    {
        "Baal": "Baal"
    },
    {
        " as a fourth god, and perhaps ": null
    },
    {
        "Shamash": "Shamash"
    },
    {
        " in the early period. Smith 2002, p. 57. At an early stage El and Yahweh became fused and Asherah did not continue as a separate state cult, although she continued to be popular at a community level until Persian times. Dever , p.     Yahweh, the ": null
    },
    {
        "national god": "National God"
    },
    {
        " of both Israel and Judah, seems to have originated in ": null
    },
    {
        "Edom": "Edom"
    },
    {
        " and ": null
    },
    {
        "Midian": "Midian"
    },
    {
        " in southern Canaan and may have been brought to Israel by the ": null
    },
    {
        "Kenites": "Kenites"
    },
    {
        " and ": null
    },
    {
        "Midianites": "Midianites"
    },
    {
        " at an early stage. Van der Toorn 1999, pp. 911–13. There is a general consensus among scholars that the first formative event in the emergence of the distinctive religion described in the Bible was triggered by the destruction of Israel by Assyria in c. 722  BCE. Refugees from the northern kingdom fled to Judah, bringing with them laws and a prophetic tradition of Yahweh. This religion was subsequently adopted by the landowners of Judah, who in 640  BCE placed the eight-year-old ": null
    },
    {
        "Josiah": "Josiah"
    },
    {
        " on the throne. Judah at this time was a vassal state of Assyria, but Assyrian power collapsed in the 630s, and around 622 Josiah and his supporters launched a bid for independence expressed as loyalty to ": null
    },
    {
        "Yahweh alone": "Monolatrism"
    },
    {
        " .          According to the ": null
    },
    {
        "Deuteronomist": "Deuteronomist"
    },
    {
        "s, as scholars call these Judean nationalists, the treaty with Yahweh would enable Israels god to preserve both the city and the king in return for the peoples worship and obedience. The destruction of Jerusalem, its Temple, and the Davidic dynasty by Babylon in 587/586  BCE was deeply traumatic and led to revisions of the national ": null
    },
    {
        "mythos": "Traditional Story"
    },
    {
        " during the Babylonian exile. This revision was expressed in the ": null
    },
    {
        "Deuteronomistic history": "Deuteronomistic History"
    },
    {
        ", the books of ": null
    },
    {
        "Joshua": "Book Of Joshua"
    },
    {
        ", ": null
    },
    {
        "Judges": "Book Of Judges"
    },
    {
        ", ": null
    },
    {
        "Samuel": "Books Of Samuel"
    },
    {
        " and ": null
    },
    {
        "Kings": "Books Of Kings"
    },
    {
        ", which interpreted the Babylonian destruction as divinely-ordained punishment for the failure of Israels kings to worship Yahweh to the exclusion of all other deities. Dunn and Rogerson, pp. 153–54     The ": null
    },
    {
        "Second Temple period": "Second Temple Period"
    },
    {
        "  differed in significant ways from what had gone before. Avery Peck, p. 58 Strict ": null
    },
    {
        "monotheism": "Monotheism"
    },
    {
        " emerged among the priests of the Temple establishment during the seventh and sixth centuries  BCE, as did beliefs regarding ": null
    },
    {
        "angels": "Angel"
    },
    {
        "and ": null
    },
    {
        "demon": "Demon"
    },
    {
        "s. Grabbe , pp. 243–44. At this time, ": null
    },
    {
        "circumcision": "Religious Male Circumcisionin The Tanakh"
    },
    {
        ", dietary laws, and ": null
    },
    {
        "Sabbath-observance": "Shabbat"
    },
    {
        " gained more significance as symbols of ": null
    },
    {
        "Jewish identity": "Jewish Identity"
    },
    {
        ", and the institution of the ": null
    },
    {
        "synagogue": "Synagogue"
    }
]