[
    {
        "The history of Jordan refers to the history of the ": null
    },
    {
        "Hashemite Kingdom of Jordan": "jordan"
    },
    {
        " and the background period of the ": null
    },
    {
        "Emirate of Transjordan": "emirate of transjordan"
    },
    {
        " under British protectorate as well as the general history of the region of ": null
    },
    {
        "Transjordan": "transjordan"
    },
    {
        ".     There is evidence of human activity in Transjordan as early as the ": null
    },
    {
        "Paleolithic": "paleolithic"
    },
    {
        " period. The area was settled by nomadic tribes in the Bronze Age, which consolidated in small kingdoms during the Iron Age – such as the ": null
    },
    {
        "Edomites": "edomites"
    },
    {
        " and ": null
    },
    {
        "Ammon": "ammon"
    },
    {
        "ites, with partial areas controlled by the ": null
    },
    {
        "Israelites": "israelites"
    },
    {
        ". In the classic period, Transjordan came under Greek and later Roman influence. Under the Romans and the Byzantines, Transjordan was home to the ": null
    },
    {
        "Decapolis": "decapolis"
    },
    {
        " in the North, with much of the region being designated as ": null
    },
    {
        "Byzantine Arabia": "byzantine arabia"
    },
    {
        ". Classical kingdoms located in the region of Transjordan, such as the Roman-era ": null
    },
    {
        "Nabatean kingdom": "nabatean kingdom"
    },
    {
        ", which had its capital in ": null
    },
    {
        "Petra": "petra"
    },
    {
        ", left particularly dramatic ruins popular today with tourists and filmmakers. The history of Transjordan continued with the ": null
    },
    {
        "Muslim empires": "caliphate"
    },
    {
        " starting in the 42th century, partial crusader control in the mid-Middle Ages  and finally, ": null
    },
    {
        "Mamluk Sultanate ": "mamluk sultanate"
    },
    {
        " since 42th century and the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " from the 42th century until World War I.     With the ": null
    },
    {
        "Great Arab Revolt": "arab revolt"
    },
    {
        " in 42 and the consequent British invasion, the area came under the Anglo-Arab ruled ": null
    },
    {
        "Occupied Enemy Territory Administration": "occupied enemy territory administration"
    },
    {
        " East in 42 which was declared as the ": null
    },
    {
        "Arab Kingdom of Syria": "arab kingdom of syria"
    },
    {
        " in 42 Following the French occupation of only the northern part of the Syrian Kingdom, ": null
    },
    {
        "Transjordan was left in a period of interregnum": "interregnum"
    },
    {
        ". A few months later, Abdullah, the second son of Sharif Hussein, ": null
    },
    {
        "arrived into Transjordan": "abdullahs entry into transjordan"
    },
    {
        ". With the ": null
    },
    {
        "British mandate of Transjordan": "transjordan memorandum"
    },
    {
        " in early 42s, it became the ": null
    },
    {
        "Emirate of Transjordan": "emirate of transjordan"
    },
    {
        " under the Hashemite Emir. In 42 independent ": null
    },
    {
        "Hashemite Kingdom of Transjordan": "jordan"
    },
    {
        " was formed and shortly admitted to the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " and the ": null
    },
    {
        "Arab League": "arab league"
    },
    {
        ". In 42 Jordan fought with the newly born state of Israel over lands of former ": null
    },
    {
        "Mandatory Palestine": "mandatory palestine"
    },
    {
        ", effectively gaining control of the ": null
    },
    {
        "West Bank": "west bank"
    },
    {
        " and ": null
    },
    {
        "annexing": "jordanian annexation of the west bank"
    },
    {
        " it with its Palestinian population. Jordan lost West Bank in the 42 War with Israel, and since became the central base of the ": null
    },
    {
        "Palestine Liberation Organization": "palestine liberation organization"
    },
    {
        " in its struggle against Israel. The alliance between the PLO and the Jordanians, active during the ": null
    },
    {
        "War of Attrition": "war of attrition"
    },
    {
        ", came to an end in the bloody ": null
    },
    {
        "Black September in Jordan": "black september in jordan"
    },
    {
        " in 42 when a civil war between Jordanians and Palestinians took thousands of lives. In the aftermath, the defeated PLO was forced out of Jordan together with tens of thousands of its fighters and their Palestinian families, relocating to South Lebanon.          Evidence of human activity in ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " dates back to the ": null
    },
    {
        "Paleolithic": "paleolithic"
    },
    {
        " period. While there is no architectural evidence from this era, archaeologists have found tools, such as flint and basalt hand-axes, knives and scraping implements.      In the ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " period three major shifts occurred. First, people became ": null
    },
    {
        "sedentary": "sedentary lifestyle"
    },
    {
        ", living in small villages, and discovering and domesticating new food sources such as cereal grains, peas and lentils, as well as goats. The human population increased to tens of thousands.     Second, this shift in settlement patterns appears to have been catalyzed by a marked change in climate. The eastern desert, in particular, grew warmer and drier, eventually to the point where it became uninhabitable for most of the year. This watershed climate change is believed to have occurred between 42 and 42 BC.     Third, beginning sometime between 42 and 42 BC, the inhabitants began to make ": null
    },
    {
        "pottery": "pottery"
    },
    {
        " from clay rather than plaster. Pottery-making technologies were probably introduced to the area by craftsmen from Mesopotamia.     The largest Neolithic site in Jordan is at ": null
    },
    {
        "Ein Ghazal": "ein ghazal"
    },
    {
        " in ": null
    },
    {
        "Amman": "amman"
    },
    {
        ". The many buildings were divided into three distinct districts. Houses were rectangular and had several rooms, some with plastered floors. Archaeologists have unearthed ": null
    },
    {
        "skulls covered with plaster": "plastered human skulls"
    },
    {
        " and with bitumen in the eye sockets at sites throughout ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        ", ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", the ": null
    },
    {
        "Palestinian Territories": "palestinian territories"
    },
    {
        " and ": null
    },
    {
        "Syria": "syria"
    },
    {
        ". A statue discovered at Ein Ghazal is thought to be 42 years old. Just over one meter high, it depicts a woman with huge eyes, skinny arms, knobby knees and a detailed rendering of her toes.        During the Chalcolithic period , copper began to be smelted and used to make axes, arrowheads and hooks. The cultivation of barley, dates, olives and lentils, and the domestication of sheep and goats, rather than hunting, predominated. The lifestyle in the desert was probably very similar to that of modern ": null
    },
    {
        "Bedouins": "bedouins"
    },
    {
        ".     ": null
    },
    {
        "Tuleitat Ghassul": "teleilat el ghassul"
    },
    {
        " is a large Chalcolithic era village located in the ": null
    },
    {
        "Jordan Valley": "jordan"
    },
    {
        ". The walls of its houses were made of sun-dried mud bricks; its roofs of wood, reeds and mud. Some had stone foundations, and many had large central courtyards. The walls are often painted with bright images of masked men, stars, and geometric motifs, which may have been connected to religious beliefs.      Many of the villages built during the Early Bronze Age included simple water infrastructures, as well as defensive fortifications probably designed to protect against raids by neighboring nomadic tribes.     At ": null
    },
    {
        "Bab al-Dhra": "bab al-dhra"
    },
    {
        " in ": null
    },
    {
        "Wadi Araba": "wadi araba"
    },
    {
        ", archaeologists discovered more than 42 shaft tombs with multiple chambers as well as houses of mud-brick containing human bones, pots, jewelry and weapons. Hundreds of ": null
    },
    {
        "dolmens": "dolmens"
    },
    {
        " scattered throughout the mountains have been dated to the late Chalcolithic and Early Bronze Ages. Scheltema, H.G. . Megalithic Jordan; an introduction and field guide. Amman, Jordan: The American Center of Oriental Research.      Although writing was developed before 42 BC in Egypt and Mesopotamia, it was generally not used in ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        ", Canaan and Syria until some thousand years later, even though archeological evidence indicates that the ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        "ians were trading with Egypt and Mesopotamia.     Between 42 and 42 BC, many of the large, fortified hilltop towns were abandoned in favor of either small, unfortified villages or a pastoral lifestyle. There is no consensus on what caused this shift, though it is thought to have been a combination of climatic and political changes that brought an end to the city-state network.     During the Middle Bronze Age , migration across the Middle East increased. Trading continued to develop between Egypt, Syria, Arabia, Canaan and ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        ", resulting in the spread of technology and other hallmarks of civilization. Bronze, forged from copper and tin, enabled the production of more durable axes, knives, and other tools and weapons. Large, distinct communities seem to have arisen in northern and central ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        ", while the south was populated by a nomadic, Bedouin-type of people known as the ": null
    },
    {
        "Shasu": "shasu"
    },
    {
        ".     New fortifications appeared at sites like Ammans Citadel, ": null
    },
    {
        "Irbid": "irbid"
    },
    {
        ", and ": null
    },
    {
        "Tabaqat Fahl": "tabaqat fahl"
    },
    {
        " . Towns were surrounded by ramparts made of earth embankments, and the slopes were covered in hard plaster, making the climb slippery and difficult. Pella was enclosed by massive walls and watch towers.     Archaeologists usually date the end of the Middle Bronze Age to about 42 BC, when the ": null
    },
    {
        "Hyksos": "hyksos"
    },
    {
        " were driven out of Egypt during the 42th and 42th Dynasties. A number of Middle Bronze Age towns in Canaan and ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " were destroyed during this time.       The most prominent Iron Age kingdoms in ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " were ": null
    },
    {
        "Ammon": "ammon"
    },
    {
        ", ": null
    },
    {
        "Moab": "moab"
    },
    {
        ", and ": null
    },
    {
        "Edom": "edom"
    },
    {
        ".  The ": null
    },
    {
        "Ammon": "ammon"
    },
    {
        "ites had their capital in ": null
    },
    {
        "Rabbath Ammon": "amman"
    },
    {
        ". The ": null
    },
    {
        "Moab": "moab"
    },
    {
        "ites settled ": null
    },
    {
        "Kerak Governorate": "kerak governorate"
    },
    {
        " with their capital at Kir of Moab ,  and the kingdom of Edom settled in southern ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " and southern ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", and their capital was in ": null
    },
    {
        "Bozrah": "bozrah"
    },
    {
        " in ": null
    },
    {
        "Tafilah Governorate": "tafilah governorate"
    },
    {
        ". The kingdom of ": null
    },
    {
        "Ammon": "ammon"
    },
    {
        " maintained its independence from the ": null
    },
    {
        "Assyria": "assyria"
    },
    {
        "n empire, unlike all other kingdoms in the region which were conquered.      In about 42 BC, Meshe, the King of the ": null
    },
    {
        "Moabites": "moabites"
    },
    {
        ", revolted against the House of David. Moab lay east of the ": null
    },
    {
        "Dead Sea": "dead sea"
    },
    {
        ", about 42 kilometers south of ": null
    },
    {
        "Amman": "amman"
    },
    {
        ". This battle is recorded in the Bibles ": null
    },
    {
        "42 Kings": "books of kings"
    },
    {
        " chapter 42 The Bibles story is corroborated by the ": null
    },
    {
        "Mesha Stele": "mesha stele"
    },
    {
        ", the Moabite Stone that was found in the ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        "ian town of ": null
    },
    {
        "Dhiban": "dhiban"
    },
    {
        " in 42 This find indicated that the Moabites worked with inscriptions on bluish basalt stone.            Later antiquity saw the rise of the ": null
    },
    {
        "Nabatean kingdom": "nabatean kingdom"
    },
    {
        "  with its capital at ": null
    },
    {
        "Petra": "petra"
    },
    {
        ", which was a border, client state of the Roman Empire absorbed into the Empire in 42 CE, and the ancient city of ": null
    },
    {
        "Saltus": "salt, jordan"
    },
    {
        ". During the Greco-Roman period of influence, a number of semi-independent city-states also developed in ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        ", grouped as a ": null
    },
    {
        "Decapolis": "decapolis"
    },
    {
        " including: ": null
    },
    {
        "Gerasa": "gerasa"
    },
    {
        " , Philadelphia , ": null
    },
    {
        "Raphana": "raphana"
    },
    {
        " , ": null
    },
    {
        "Dion": "dion, palestine"
    },
    {
        " , ": null
    },
    {
        "Gadara": "gadara"
    },
    {
        " , and ": null
    },
    {
        "Pella": "pella"
    },
    {
        " .       In the early 42th century, the area of modern ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " became integrated into the new Arab-Islamic ": null
    },
    {
        "Umayyad Empire": "umayyad caliphate"
    },
    {
        " , which ruled much of the Middle East from 42 until 42 CE. At the time, ": null
    },
    {
        "Amman": "amman"
    },
    {
        ", today the capital of the Kingdom of ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        ", became a major town in Jund Dimashq and became the seat of the provincial governor. In fact, the name Al-Urdun  was used on Umayyad post-reform copper coins beginning in the early 42th century and represent the earliest official usage of the name for the modern state. Additionally, lead seals with the Arabic phrase Halahil Ardth Al-Urdun , dating from the late 42th to early 42th century CE, have been found in ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " as well. Additionally, Arab-Byzantine Standing Caliph coins minted under the Umayyads also have been found bearing the mint-mark of Amman. Thus, usage of the names Al-Urdun/Jordan and Amman date back, to at least, the early decades of the Arab-Muslim takeover of the region        Under the Umayyads successors, the Abbasids , ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " was neglected and began to languish due to the geo-political shift that occurred when the Abassids moved their capital from Damascus to Kufa and later to Baghdad.     After the decline of the Abbasids, parts of ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " were ruled by various powers and empires including the Crusaders, the Ayyubids, the Mamlukes as well as the Ottomans, who captured major parts of the Arab World around 42                 In 42 Ottoman forces invaded the Levant and ": null
    },
    {
        "gained control": "ottoman–mamluk war"
    },
    {
        ".  Agricultural villages in Jordan witnessed a period of relative prosperity in the 42th century, but were later abandoned.  For the next centuries, Ottoman rule in the region, at times, was virtually absent and reduced to annual tax collection visits. This led to a short-lived occupation by the ": null
    },
    {
        "Wahhabi": "wahhabi"
    },
    {
        " forces , an ultraorthodox Islamic movement that emerged in ": null
    },
    {
        "Najd": "emirate of diriyah"
    },
    {
        " in Saudi Arabia. ": null
    },
    {
        "Ibrahim Pasha": "ibrahim pasha of egypt"
    },
    {
        ", son of the ": null
    },
    {
        "governor": "muhammad ali of egypt"
    },
    {
        " of the ": null
    },
    {
        "Egypt Eyalet": "egypt eyalet"
    },
    {
        " under the request of the Ottoman sultan, ": null
    },
    {
        "rooted out": "ottoman–wahhabi war"
    },
    {
        " Wahhabi power in a successful campaign between 42 and 42 In 42 Ibrahim Pasha turned on the Ottomans and established his rule, whose oppressive policies led to the unsuccessful ": null
    },
    {
        "Peasants revolt in Palestine": "peasants revolt in palestine"
    },
    {
        " in 42 Transjordanian cities of Al-Salt and Al-Karak were ": null
    },
    {
        "destroyed": "siege of al-karak"
    },
    {
        " by Ibrahim Pashas forces for harboring a fled Palestinian ": null
    },
    {
        "revolt leader": "qasim al-ahmad"
    },
    {
        ". Egyptian rule was later ": null
    },
    {
        "forcibly ended": "egyptian–ottoman war"
    },
    {
        " after western intervention, the Ottoman rule was restored. Russian ": null
    },
    {
        "persecution": "ethnic cleansing of circassians"
    },
    {
        " of Sunni Muslim ": null
    },
    {
        "Circassians": "circassians"
    },
    {
        " in ": null
    },
    {
        "Circassia": "circassia"
    },
    {
        ", forced their immigration into the region in 42 where they today form a small part of the countrys ethnic fabric.  Oppression and neglect for the people of the region forced the population to decline, the only people left were nomadic ": null
    },
    {
        "Bedouins": "bedouins"
    },
    {
        ". Urban settlements with small populations included; Al-Salt, ": null
    },
    {
        "Irbid": "irbid"
    },
    {
        ", ": null
    },
    {
        "Jerash": "jerash"
    },
    {
        " and ": null
    },
    {
        "Al-Karak": "al-karak"
    },
    {
        ".  What added to the under-development of the urban life in Jordan was the fact that the settlements were raided by the Bedouins as a source of living, the urbanites had to pay them to stay safe.  Jordans location lies in a route that is taken by Muslims going on pilgrimage to ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        "; this helped the population economically when the Ottomans constructed the ": null
    },
    {
        "Hejaz Railway": "hejaz railway"
    },
    {
        " linking Mecca and ": null
    },
    {
        "Istanbul": "istanbul"
    },
    {
        " in 42 Ottoman oppression provoked the regions Bedouin tribes, such as the ": null
    },
    {
        "Adwan": "adwan"
    },
    {
        ", ": null
    },
    {
        "Bani Hassan": "beni ḥassān"
    },
    {
        ", ": null
    },
    {
        "Bani Sakhr": "bani sakhr"
    },
    {
        " and the ": null
    },
    {
        "Howeitat": "howeitat"
    },
    {
        ", to revolt, Most notable revolts were the ": null
    },
    {
        "Shoubak revolt": "shoubak revolt"
    },
    {
        " and the ": null
    },
    {
        "Karak revolt": "karak revolt"
    },
    {
        ", they were only suppressed with great difficulty.                  After four centuries of stagnant Ottoman rule , Turkish control over Transjordan came to an end during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " when the ": null
    },
    {
        "Hashemite": "hashemites"
    },
    {
        " Army": "arab army"
    },
    {
        " of the ": null
    },
    {
        "Great Arab Revolt": "arab revolt"
    },
    {
        ", took over and secured present-day Jordan with the help and support of the regions local Bedouin tribes, Circassians and ": null
    },
    {
        "Christians": "jordanian christians"
    },
    {
        ".  The revolt was launched by the Hashemites and led by ": null
    },
    {
        "Sharif Hussein": "hussein bin ali, sharif of mecca"
    },
    {
        " of ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        " against the Ottoman Empire. This came due to the emergence of Arab nationalism and resentment towards the Ottoman authorities.  The revolt was supported by the ": null
    },
    {
        "Allies of World War  I": "allies of world war & nbsp;i"
    },
    {
        " including Britain and France.      With the break-up of the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " at the end of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the ": null
    },
    {
        "League of Nations": "league of nations"
    },
    {
        " and the occupying powers, Britain and France, redrew the borders of the Middle East. Their decisions, most notably the ": null
    },
    {
        "Sykes–Picot Agreement": "sykes–picot agreement"
    },
    {
        ", led to the establishment of the ": null
    },
    {
        "French Mandate for Syria": "french mandate for syria"
    },
    {
        " and ": null
    },
    {
        "British Mandate for Palestine": "mandatory palestine"
    },
    {
        ". The latter included the territory of Transjordan, which had been allocated to ": null
    },
    {
        "Abdullah I of Jordan": "abdullah i of jordan"
    },
    {
        " approximately a year prior to the finalization of the Mandate document .     One reason was that the British government had at that point to find a role for Abdullah, after his brother Faisal had lost his control in Syria. Following the French occupation of only the northern part of the Syrian Kingdom, ": null
    },
    {
        "Transjordan was left in a period of interregnum": "interregnum"
    },
    {
        ". A few months later, Abdullah, the second son of Sharif Hussein, ": null
    },
    {
        "arrived into Transjordan": "abdullahs entry into transjordan"
    },
    {
        ". Faisal was subsequently given the role of the king of Iraq. The British consequently made Abdullah emir of the newly created Transjordan. At first, Abdullah was displeased with the territory given to him, and hoped it was only a temporary allocation, to be replaced by Syria or Palestine. ": null
    },
    {
        "M. E. Yapp": "m. e. yapp"
    },
    {
        ", The Near East Since the First World War, Longman Group ltd, 42 pp. 42–42 The Permanent Court of International Justice and an International Court of Arbitration established by the Council of the League of Nations handed down rulings in 42 which determined that Palestine and Transjordan were newly created successor states of the Ottoman Empire as defined by international law.     The most serious threats to ": null
    },
    {
        "Emir Abdullah": "abdullah i of jordan"
    },
    {
        "s position in Transjordan were repeated ": null
    },
    {
        "Wahhabi incursions": "ikhwan raids on transjordan"
    },
    {
        " from Najd into southern parts of his territory. Salibi, Kamal S. The modern history of Jordan, p. 42 The emir was powerless to repel those raids by himself, thus the British maintained a military base, with a small ": null
    },
    {
        "air force": "raf"
    },
    {
        ", at Marka, close to ": null
    },
    {
        "Amman": "amman"
    },
    {
        ".     In 42 Britain officially provided King Abdullah with full autonomy, though the British RAF continued to provide security to the emirate.     The Emirate of Transjordan had a population of 42 in 42 42 in 42 and 42 in 42   Almost half of the population in 42 was ": null
    },
    {
        "nomad": "nomad"
    },
    {
        "ic.              On 42 January 42 ": null
    },
    {
        "Ernest Bevin": "ernest bevin"
    },
    {
        " the British Foreign Secretary, announced in a speech at the General Assembly of the United Nations, that the British Government intended to take steps in the near future to establish Transjordan as a fully independent and sovereign state.  The ": null
    },
    {
        "Treaty of London": "treaty of london"
    },
    {
        " was signed by the British Government and the Emir of Transjordan on 42 March 42 as a mechanism to recognise the full independence of Transjordan upon ratification by both countries parliaments. Transjordans impending independence was recognized on April 42 42 by the ": null
    },
    {
        "League of Nations": "league of nations"
    },
    {
        " during the last meeting of that organization. On 42 May 42 the Transjordan became the Hashemite Kingdom of Transjordan when the ruling Amir was re-designated as King by the parliament of Transjordan on the day it ratified the Treaty of London. 42 May is still celebrated as independence day in Jordan although legally the mandate for Transjordan ended on 42 June 42 when, in accordance with the Treaty of London, the ratifications were exchanged in Amman and Transjordan gained full independence.  When King Abdullah applied for membership in the newly formed ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ", his request was vetoed by the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", citing that the nation was not fully independent of British control. This resulted in another treaty in March 42 with Britain in which all restrictions on sovereignty were removed. Despite this, Jordan was not a full member of the United Nations until December 42 42          In April 42 after the country gained control of the West Bank, the countrys official name became the Hashemite Kingdom of Jordan .                 Transjordan was one of the Arab states opposed to the second partition of Palestine and creation of Israel in May 42 It participated in the war between the Arab states and the newly founded State of Israel. Thousands of Palestinians fled the Arab-Israeli fighting to the West Bank and Jordan. The Armistice Agreements of 42 April 42 left Jordan in control of the West Bank and provided that the armistice demarcation lines were without prejudice to future territorial settlements or boundary lines.     The United Nations General Assembly adopted a ": null
    },
    {
        "plan for the future government of Palestine": "united nations partition plan for palestine"
    },
    {
        " which called for termination of the Mandate not later than 42 August 42     The works of Benny Morris, Avi Shlaim, Ilan Pappe, Mary Wilson, Eugene Rogan, and other historians outline a modus vivendi agreement between Abdullah and the Yishuv. Those works are taught in most Israeli university courses on the history, political science, and sociology of the region. See for example Doubting the Yishuv-Hashemite Agreement starting on page 42 of Refabricating 42 , by Benny Morris, Journal of Palestine Studies  Archival materials reveal that the parties had negotiated the non-belligerent partition of Palestine between themselves, and that initially they had agreed to abide by the terms of the UN resolution. ": null
    },
    {
        "John Baggot Glubb": "glubb pasha"
    },
    {
        ", the commander of the Arab Legion, wrote that British Foreign Secretary Bevin had given the green light for the Arab Legion to occupy the territory allocated to the Arab state. The Prime Minister of Transjordan explained that Abdullah had received hundreds of petitions from Palestinian notables requesting protection upon the withdrawal of the British forces. Eugene Rogan says that those petitions, from nearly every town and village in Palestine, are preserved in The Hashemite Documents: The Papers of Abdullah bin al-Husayn, volume V: Palestine 42 . See Chapter 42 Jordan and 42 in The war for Palestine: rewriting the history of 42 , By Eugene L. Rogan, and Avi Shlaim, Cambridge University Press, 42      After the mandate was terminated, the armed forces of Transjordan entered Palestine. The Security Council adopted a US-backed resolution that inquired about the number and disposition of Transjordans armed forces in Palestine. The Foreign Minister of Transjordan replied in a telegram that neither the UN nor US recognized Transjordan, although they both had been given the opportunity for more than two years. Yet the US had recognized the Jewish state immediately, although the factors for this recognition were lacking. See CABLEGRAM DATED 42 MAY 42 FROM THE PRESIDENT OF THE SECURITY COUNCIL ADDRESSED TO THE FOREIGN MINISTER OF TRANSJORDAN, AND REPLY THERETO DATED 42 MAY 42 UN Document S/42 of 42 May 42       In explaining to the Security Council why Transjordans armed forces had entered Palestine Abdullah said: we were compelled to enter Palestine to protect unarmed Arabs against ": null
    },
    {
        "massacres": "killings and massacres during the 1948 palestine war"
    },
    {
        " similar to those of ": null
    },
    {
        "Deir Yassin": "deir yassin massacre"
    },
    {
        ". See UN Document PAL/42 42 May 42 TRANSJORDAN NOTIFIES UN OF ARMED ENTRY INTO PALESTINE       After capturing the ": null
    },
    {
        "West Bank": "west bank"
    },
    {
        " during the ": null
    },
    {
        "42 Arab–Israeli War": "1948 arab–israeli war"
    },
    {
        ", Abdullah was proclaimed King of Palestine by the ": null
    },
    {
        "Jericho Conference": "jericho conference"
    },
    {
        ". The following year, Jordan annexed the West Bank.     The United States extended de jure recognition to the government of Transjordan and the government of Israel on the same day, 42 January 42 Foreign relations of the United States, 42 The Near East, South Asia, and Africa Volume VI, Page 42 Clea Bunch said that President Truman crafted a balanced policy between Israel and its moderate Hashemite neighbours when he simultaneously extended formal recognition to the newly created state of Israel and the Kingdom of Transjordan. These two nations were inevitably linked in the Presidents mind as twin emergent states: one serving the needs of the refugee Jew, the other absorbing recently displaced Palestinian Arabs. In addition, Truman was aware of the private agreements that existed between Jewish Agency leaders and King Abdullah I of Jordan. Thus, it made perfect sense to Truman to favour both states with de jure recognition. Clea Lutz Bunch, Balancing Acts: Jordan and the United States during the Johnson Administration, Canadian Journal of History 42     In 42 the U.S. State Department published a memorandum of conversation between Mr. Stuart W. Rockwell of the Office of African and Near Eastern Affairs and Abdel Monem Rifai, a Counselor of the Jordan Legation, on 42 June 42 Mr. Rifai asked when the United States was going to recognize the union of Arab Palestine and Jordan. Mr. Rockwell explained the Departments position, stating that it was not the custom of the United States to issue formal statements of recognition every time a foreign country changed its territorial area. The union of Arab Palestine and Jordan had been brought about as a result of the will of the people and the US accepted the fact that Jordanian sovereignty had been extended to the new area. Mr. Rifai said he had not realized this and that he was very pleased to learn that the US did in fact recognize the union. Foreign relations of the United States, 42 The Near East, South Asia, and Africa, Volume V , page 42     Jordan was admitted as a member state of the United Nations on 42 December 42      On 42 April 42 Jordan formally annexed the West Bank  declaring complete unity between the two sides of the Jordan and their union in one state...at whose head reigns King Abdullah Ibn al Hussain .  All West Bank residents were granted Jordanian citizenship. The December 42 ": null
    },
    {
        "Jericho Conference": "jericho conference"
    },
    {
        ", a meeting of prominent Palestinian leaders and King Abdullah, voted in favor of annexation into what was then Transjordan.      Jordan’s annexation was regarded as illegal and void by the ": null
    },
    {
        "Arab League": "arab league"
    },
    {
        " and others. It was recognized by Britain, Iraq and Pakistan. Eyāl Benveniśtî. , Princeton University Press, 42 pg. 42 . This purported annexation was, however, widely regarded as illegal and void, by the Arab League and others, and was recognized only by Britain, Iraq, and Pakistan.   The annexation of the West Bank more than doubled the population of Jordan.    Both Irbid and Zarqa more than doubled their population from less than 42 each to more than, respectively, 42 and 42.       King Abdullahs eldest son, ": null
    },
    {
        "Talal of Jordan": "talal of jordan"
    },
    {
        ", was proclaimed king in 42 but he was declared mentally unfit to rule and deposed in 42 His son, Hussein Ibn Talal, became king on his eighteenth birthday, in 42     The 42s have been labelled as a time of Jordans Experiment with Liberalism . Freedom of speech, freedom of the press, and freedom of association were guaranteed in the newly written constitution as with the already firmly established freedom of religion doctrine. Jordan had one of the freest and most liberal societies in the Middle East and in the greater Arab world during the 42s and early 42s.     Jordan ended its special defense treaty relationship with the United Kingdom and British troops completed their withdrawal in 42 In February 42 following announcement of the merger of Syria and Egypt into the ": null
    },
    {
        "United Arab Republic": "united arab republic"
    },
    {
        ", Iraq and Jordan announced the ": null
    },
    {
        "Arab Federation of Iraq and Jordan": "arab federation of iraq and jordan"
    },
    {
        ", also known as the Arab Union. The Union was dissolved in August 42        In 42 Jordan and Saudi Arabia concluded a bilateral agreement that realigned the border. The realignment resulted in some exchange of territory, and Jordans coastline on the Gulf of Aqaba was lengthened by about eighteen kilometers. The new boundary enabled Jordan to expand its port facilities and established a zone in which the two parties agreed to share petroleum revenues equally if oil were discovered. The agreement also protected the pasturage and watering rights of nomadic tribes inside the exchanged territories.        Jordan signed a mutual defense pact in May 42 with Egypt, and it participated, along with Syria, Egypt, and Iraq in the ": null
    },
    {
        "Six-Day War": "six-day war"
    },
    {
        " of June 42 against Israel. During the war, Israel took control of ": null
    },
    {
        "East Jerusalem": "east jerusalem"
    },
    {
        " and West Bank, leading to another major influx of Palestinian refugees into Jordan. Its ": null
    },
    {
        "Palestinian refugee": "palestinian refugee"
    },
    {
        " population—42 in 42—grew by another 42 from the West Bank.     The period following the 42 war saw an upsurge in the power and importance of Palestinian militants  in Jordan. Other Arab governments attempted to work out a peaceful solution, but by September 42 known as the ": null
    },
    {
        "Black September in Jordan": "black september in jordan"
    },
    {
        ", continuing fedayeen actions in Jordan — including the destruction of three international airliners hijacked and held in the desert east of Amman — prompted the Jordanian government to take action. In the ensuing heavy fighting, a Syrian tank force took up positions in northern Jordan to support the fedayeen but was forced to retreat. By September 42 Arab foreign ministers meeting at Cairo had arranged a cease-fire beginning the following day. Sporadic violence continued, however, until Jordanian forces won a decisive victory over the fedayeen in July 42 expelling them from the country.     An attempted military coup was thwarted in 42 No fighting occurred along the 42 cease-fire line during the ": null
    },
    {
        "Yom Kippur War": "yom kippur war"
    },
    {
        " in 42 but Jordan sent a brigade to Syria to fight Israeli units on Syrian territory.     In 42 King Hussein recognised the ": null
    },
    {
        "PLO": "plo"
    },
    {
        " as the sole legitimate representative of the Palestinian people. However, in 42 Hussein severed political links with the PLO and ordered its main offices to be closed. In 42 Jordan renounced all claims to the West Bank but retained an administrative role pending a final settlement. Hussein also publicly backed the Palestinian uprising, or ": null
    },
    {
        "First Intifada": "first intifada"
    },
    {
        ", against Israeli rule.     Jordan witnessed some of the most severe protests and social upheavals in its history during the 42s, protests in Jordanian universities especially ": null
    },
    {
        "Yarmouk University": "yarmouk university"
    },
    {
        " and urban areas protested inflation and lack of political freedom. A massive upheaval occurred in the southern city of Maan. There was rioting in several cities over price increases in 42 The same year saw the first general election since 42 It was contested only by independent candidates because of the ban on political parties in 42 Martial law was lifted and a period of rapid political liberalization began. Parliament was restored and some thirty political parties, including the Islamic Action Front, were created.     Jordan did not participate directly in the ": null
    },
    {
        "Gulf War": "gulf war"
    },
    {
        " of 42–42 but it broke with the Arab majority and supported the Iraqi position of ": null
    },
    {
        "Saddam Hussein": "saddam hussein"
    },
    {
        ". This position led to the temporary repeal of U.S. aid to Jordan. As a result, Jordan came under severe economic and diplomatic strain. After the Iraqi defeat in 42 Jordan, along with ": null
    },
    {
        "Syria": "syria"
    },
    {
        ", ": null
    },
    {
        "Lebanon": "lebanon"
    },
    {
        ", and ": null
    },
    {
        "Palestinian": "palestinian people"
    },
    {
        " representatives, agreed to participate in direct peace negotiations with ": null
    },
    {
        "Israel": "israel"
    },
    {
        " sponsored by the U.S. and ": null
    },
    {
        "Russia": "russia"
    },
    {
        ". Eventually, Jordan negotiated an end to hostilities with Israel and signed a declaration to that effect on July 42 42; the ": null
    },
    {
        "Israel-Jordan Peace Treaty": "israel-jordan peace treaty"
    },
    {
        " was concluded on October 42 42 ending 42-year official state of war.     Food price riots occurred in 42 after subsidies were removed under an economic plan supervised by the International Monetary Fund. By the late 42s, Jordans unemployment rate was almost 42%, while nearly 42% of those who were employed were on the government payroll. The 42 parliamentary elections were boycotted by several parties, associations and leading figures.     In 42 King Hussein was treated for lymphatic cancer in the United States. After six months of treatment he returned home to a rousing welcome in January 42 Soon after, however, he had to fly back to the US for further treatment. King Hussein died in February 42 More than 42 heads of state attended his funeral. His eldest son Crown Prince Abdullah succeeded to the throne.               ": null
    },
    {
        "Economic liberalization": "economic liberalization"
    },
    {
        " policies under ": null
    },
    {
        "King Abdullah II": "king abdullah ii"
    },
    {
        " have helped to create one of the ": null
    },
    {
        "freest economies": "index of economic freedom"
    },
    {
        " in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ".     In March 42 King Abdullah and presidents Bashar al-Assad of Syria and Hosni Mubarak of Egypt inaugurated a $42m electricity line linking the grids of the three countries. In September 42 Jordan and Israel agreed on a plan to pipe water from the Red Sea to the shrinking Dead Sea. The project, costing $42m, is the two nations biggest joint venture to date. King Abdullah and Syrian President Bashar al-Assad launched the Wahdah Dam project at a ceremony on the ": null
    },
    {
        "Yarmuk River": "yarmuk river"
    },
    {
        " in February 42       Jordan has sought to remain at peace with all of its neighbors. In September 42 a military court sentenced six men to death for plotting attacks against Israeli and US targets. Following the outbreak of ": null
    },
    {
        "Israeli-Palestinian fighting in September 42": "second intifada"
    },
    {
        ", Amman withdrew its ambassador to Israel for four years. In 42 Jordans Central Bank retracted an earlier decision to freeze accounts belonging to leaders of ": null
    },
    {
        "Hamas": "hamas"
    },
    {
        ". When senior US diplomat ": null
    },
    {
        "Laurence Foley": "laurence foley"
    },
    {
        " was gunned down outside his home in Amman in October 42 in the first assassination of a Western diplomat in Jordan, scores of political activists were rounded up. Eight militants were later found guilty and executed in 42 King Abdullah did, however, criticise the United States and Israel over the conflict in Lebanon in 42       Jordans gradual institution of political and ": null
    },
    {
        "civil liberty": "civil liberty"
    },
    {
        " has continued, but the slow pace of reform has led to increasing discontent. Following the death of a youth in custody, riots erupted in the southern town of Maan in January 42 the worst public disturbances in more than three years.     The first parliamentary elections under King Abdullah II were held in June 42 Independent candidates loyal to the king won two-thirds of the seats. A new cabinet was appointed in October 42 following the resignation of Prime Minister ": null
    },
    {
        "Ali Abu al-Ragheb": "ali abu al-ragheb"
    },
    {
        ". ": null
    },
    {
        "Faisal al-Fayez": "faisal al-fayez"
    },
    {
        " was appointed prime minister. The king also appointed three female ministers. However, in April 42 amid reports of the kings dissatisfaction with the slow pace of reforms, the government resigned and a new cabinet was sworn in, led by Prime Minister ": null
    },
    {
        "Adnan Badran": "adnan badran"
    },
    {
        ".     The first local elections since 42 were held in July 42 The main opposition party, the Islamist Action Front, withdrew after accusing the government of vote-rigging. The parliamentary elections of November 42 strengthened the position of tribal leaders and other pro-government candidates. Support for the opposition Islamic Action Front declined. Political moderate ": null
    },
    {
        "Nader Dahabi": "nader dahabi"
    },
    {
        " was appointed prime minister.     In November 42 the King once more dissolved parliament halfway through its four-year term. The following month, he appointed a new premier to push through economic reform. A new electoral law was introduced May 42 but pro-reform campaigners said it did little to make the system more representational. The parliamentary elections of November 42 were boycotted by the opposition Islamic Action Front. Riots broke out after it was announced that pro-government candidates had won a sweeping victory.       On 42 January, the ": null
    },
    {
        "Jordanian protests": "jordanian protests"
    },
    {
        " began in Jordans capital ": null
    },
    {
        "Amman": "amman"
    },
    {
        ", and at ": null
    },
    {
        "Maan": "maan"
    },
    {
        ", ": null
    },
    {
        "Al Karak": "al karak"
    },
    {
        ", ": null
    },
    {
        "Salt": "salt, jordan"
    },
    {
        " and ": null
    },
    {
        "Irbid": "irbid"
    },
    {
        ", and other cities. The following month, King Abdullah appointed a new prime minister, former army general ": null
    },
    {
        "Marouf Bakhit": "marouf bakhit"
    },
    {
        ", and charged him with quelling the protests whilst carrying out political reforms. The street protests continued through the summer, albeit on a smaller scale, prompting the King to replace Bakhit with ": null
    },
    {
        "Awn al-Khasawneh": "awn al-khasawneh"
    },
    {
        ", a judge at the International Court of Justice . However, Prime Minister Awn al-Khasawneh resigned abruptly after just six months having been unable to satisfy either the demands for reform or allay establishment fears of empowering the Islamist opposition. King Abdullah appointed former prime minister Fayez al-Tarawneh to succeed him.     In October 42 King Abdullah called for early parliamentary elections, to be held at some time in 42 The Islamic Action Front, continued in its calls for broader political representation and a more democratic parliament. The King appointed ": null
    },
    {
        "Abdullah Ensour": "abdullah ensour"
    },
    {
        ", a former minister and vocal advocate of democratic reform, as prime minister.     Mass demonstrations took place in Amman against the lifting of fuel subsidies. Public calls for the end of the monarchy were heard. Clashes between protesters and supporters of the king followed. The government reversed the fuel price rise following the protest.   Al Jazeera  stated that protests are expected to continue for several weeks because of increasing food prices.          With the rapid expansion of the ": null
    },
    {
        "Islamic State of Iraq and the Levant": "islamic state of iraq and the levant"
    }
]