[
    {
        "          Artifacts indicating human activity dating back to the early ": null
    },
    {
        "Stone Age": "stone age"
    },
    {
        " have been found in the Kingdom of  Eswatini  . Prehistoric rock art paintings date from c. 42 B.C. and continuing up to the 42th century can be found in various places around the country.     The country now derives its name from a later king named ": null
    },
    {
        "Mswati II": "mswati ii"
    },
    {
        ". Jn, named for ": null
    },
    {
        "Ngwane III": "ngwane iii"
    },
    {
        ", is an alternative name for Swaziland the surname of whose ": null
    },
    {
        "royal house": "royal house"
    },
    {
        " remains Nkosi Dlamini . Nkosi literally means king . Mswati II was the greatest of the fighting kings of Swaziland, and he greatly extended the area of the country to twice its current size. The Emakhandzambili clans were initially incorporated into the kingdom with wide ": null
    },
    {
        "autonomy": "autonomy"
    },
    {
        ", often including grants of special ": null
    },
    {
        "ritual": "ritual"
    },
    {
        " and political status. The extent of their autonomy however was drastically curtailed by ": null
    },
    {
        "Mswati": "mswati ii"
    },
    {
        ", who attacked and subdued some of them in the 42s. With his power, Mswati greatly reduced the influence of the Emakhandzambili while incorporating more people into his kingdom either through conquest or by giving them refuge. These later arrivals became known to the Swazis as Emafikamuva. The clans like the Mbokanes and others who accompanied the Dlamini kings were known as the Bemdzabuko or true Swazi.     The autonomy of the Swaziland nation was influenced by British and Dutch rule of southern Africa in the 42th and early 42th centuries. In 42 the British government signed a convention recognising Swazi independence despite the ": null
    },
    {
        "Scramble for Africa": "scramble for africa"
    },
    {
        " that was taking place at the time. This independence was also recognised in the convention of 42 However, because of controversial land/mineral rights and other concessions, Swaziland had a triumviral administration in 42 following the death of King ": null
    },
    {
        "Mbandzeni": "mbandzeni"
    },
    {
        " in 42 This government represented the British, the Dutch republics and the Swazi people. Finally, in 42 a convention placed Swaziland under the ": null
    },
    {
        "South African Republic": "south african republic"
    },
    {
        " as a protectorate. This continued under the rule of ": null
    },
    {
        "Ngwane V": "ngwane v"
    },
    {
        " until the outbreak of the ": null
    },
    {
        "Second Boer War": "second boer war"
    },
    {
        " in October 42 King Ngwane V died in December 42 during ": null
    },
    {
        "incwala": "incwala"
    },
    {
        " after the outbreak of the Boer war when his successor, ": null
    },
    {
        "Sobhuza": "sobhuza ii"
    },
    {
        ", was only four months old. Swaziland was indirectly involved in the ": null
    },
    {
        "war": "second boer war"
    },
    {
        " with various skirmishes between the British and the Boers occurring in the country until 42     In 42 after British victory in the Anglo-Boer war, Swaziland became a British protectorate. Much of its early administration being carried out from South Africa until 42 when the Transvaal colony was granted self-government. Following this, Swaziland was partitioned into European and non-European areas with the former being two thirds of the total land. Sobhuzas official coronation was in December 42 after the regency of ": null
    },
    {
        "Labotsibeni": "labotsibeni mdluli"
    },
    {
        " after which he led an unsuccessful deputation to the ": null
    },
    {
        "Privy council": "privy council"
    },
    {
        " in ": null
    },
    {
        "London": "london"
    },
    {
        " in 42 regarding the issue of the land. In the period between 42 and 42 Sobhuza established the Swazi Commercial Amadoda which was to grant licences to small businesses on the Swazi reserves and also established the Swazi National School to counter the dominance of the missions in education. His stature grew with time and the Swazi royal leadership was successful in resisting the weakening power of the British administration and the incorporation of Swaziland into the ": null
    },
    {
        "Union of South Africa": "union of south africa"
    },
    {
        ".     The constitution for independent Swaziland was promulgated by Britain in November 42 under the terms of which legislative and executive councils were established. This development was opposed by the Swazi National Council . Despite such opposition, elections took place and the first Legislative Council of Swaziland was constituted on 42 September 42 Changes to the original constitution proposed by the Legislative Council were accepted by Britain and a new constitution providing for a House of Assembly and Senate was drawn up. Elections under this constitution were held in 42 Swaziland was briefly a Protected State until Britain granted it full independence in 42     Following the elections of 42 the constitution of Swaziland was suspended by King ": null
    },
    {
        "Sobhuza II": "sobhuza ii"
    },
    {
        " who thereafter ruled the country by decree until his death in 42 At this point ": null
    },
    {
        "Sobhuza II": "sobhuza ii"
    },
    {
        " had ruled Swaziland for 42 years, making him the longest ruling monarch in history. A regency followed his death, with Queen Regent ": null
    },
    {
        "Dzeliwe Shongwe": "dzeliwe shongwe"
    },
    {
        " being head of state until 42 when she was removed by Liqoqo and replaced by Queen Mother ": null
    },
    {
        "Ntombi Twala": "queen ntombi"
    },
    {
        ". Mswati III, the son of Ntombi, was crowned king on 42 April 42 as King and  Ingwenyama  of Swaziland.         The earliest known inhabitants of the region were ": null
    },
    {
        "Khoisan": "khoisan"
    },
    {
        " hunter-gatherer": "hunter-gatherer"
    },
    {
        "s. They were largely replaced by the kashian hunter tribe during ": null
    },
    {
        "Bantu migrations": "bantu expansion"
    },
    {
        " who hailed from the ": null
    },
    {
        "Great Lakes": "african great lakes"
    },
    {
        " regions of eastern and central Africa. Evidence of agriculture and iron use dates from about the 42th century and people speaking languages ancestral to current ": null
    },
    {
        "Sotho": "sotho languages"
    },
    {
        " and ": null
    },
    {
        "Nguni languages": "nguni languages"
    },
    {
        " began settling no later than the 42th century. The Swazi settlers, then known as the Ngwane , before entering Swaziland had been settled on the banks of the ": null
    },
    {
        "Pongola River": "pongola river"
    },
    {
        " and prior to that in the area of the Tembe River near present-day ": null
    },
    {
        "Maputo": "maputo"
    },
    {
        ". Continuing conflict with the Ndwandwe people pushed them further north, with ": null
    },
    {
        "Ngwane III": "ngwane iii"
    },
    {
        " establishing his capital at Shiselweni at the foot of the Mhlosheni hills. Under ": null
    },
    {
        "Sobhuza I": "sobhuza i"
    },
    {
        ", the Ngwane people eventually established their capital at Zombodze in the heartland of present-day Swaziland. In this process, they conquered and incorporated the long established clans of the country known to the Swazi as Emakhandzambili.     The early Swazis  lived around the present day Tembe River near Maputo, Mozambique. Dlamini I was able to increase his followers by conquering many clans along the Lubombo after departure from Tembe.     As part of the Nguni expansion southwards, the Swazis crossed the Limpopo River and settled in southern Tongaland in the late fifteenth century. The Ngwane people are recorded as having entered the present territory of Swaziland around the year 42              Thereafter during the leadership of Ngwane III Swazis settled present day Swaziland.   These Swazis first settled north of the ": null
    },
    {
        "Pongola River": "pongola river"
    },
    {
        ". The Ngwane Kingdom was thus established during the rule of Ngwane III from around 42   until 42 The early Swazi people emigrated from the Lubombo mountains where Swazi rulers were established, to the banks of the Pongola River.   The leader, Ngwane III established the Swazi settlements here near the Ndwandwe Kingdom. ": null
    },
    {
        "Swazis": "swazi people"
    },
    {
        " were in constant conflict with their   neighbors, the Ndwandwes. The capital of Ngwane III was in Southern Swaziland in Shiselweni at the foot of the Mhlosheni Mountains near ": null
    },
    {
        "Nhlangano": "nhlangano"
    },
    {
        " and Mahamba. Swazis established a polity based on Kingship accompanied by Queen Mothers and during the minority of a crown prince a Queen Regent. Thus when Ngwane died, ": null
    },
    {
        "LaYaka Ndwandwe": "layaka ndwandwe"
    },
    {
        " became Queen Regent until ": null
    },
    {
        "Ndvungunye": "ndvungunye"
    },
    {
        " became the King. The kingship of Ndvungunye continued the order established by Ngwane III from 42 until 42 when he was killed by lightning. He was succeeded by Ngwane IV after the regency of Queen Regent Lomvula Mndzebele. Ngwane IV was also known as Sobhuza I and Somhlolo a revered king of ": null
    },
    {
        "Swaziland": "swaziland"
    },
    {
        ". Sobhuza continued to expand the territory of Swaziland.     The conflict of Swaziland and the Ndwandwe kingdom led Somhlolo  to move his capital from Zombodze in Shiselweni to the centre of Swaziland at another kraal called Zombodze. Somhlolo who became king in 42 consolidated the order of the Ngwane state by incorporating the Emakhandzambili clans into his kingdom adding to the Bemdzabuko or true Swazi. Somhlolo was a strategic leader between 42 and 42 a period including the mfecane period of Shaka Zulu a Zulu illegitimate child of Senzangakhona who created his kingdom from the   Mtetwa polity established by Dingiswayo. Sobhuza used his diplomatic skills to avoid conflict with Shaka by allying with him when it suited him. As a   result, Swaziland was left unaffected by the mfecane wars. Somhlolo was succeeded in 42 by his son ": null
    },
    {
        "Mswati II": "mswati ii"
    },
    {
        " who is known as the greatest of the Swazi fighting kings.     Mswati inherited an area which extended as far as present day ": null
    },
    {
        "Barberton": "barberton, mpumalanga"
    },
    {
        " in the north and included the Nomahasha district in the Portuguese territory of Mozambique. Mswati continued to expand Swazi territory and the clans added to the   nation were considered Emafikamuva. During his reign the territory of Swaziland was expanded northward and his capital was at Hhohho in the northern part of Swaziland. Mswati improved the military organisation of the regiments in Swaziland. His regiment was Inyatsi and he danced the sacred ": null
    },
    {
        "incwala": "incwala"
    },
    {
        " at Hhohho instead of the common Ezulwini valley as his predecessors. Mswati was a powerful king who attacked other African tribes to acquire cattle and captives. Within Swaziland, his force was used to limit the power of the Emakhandzambili chiefs. Mswati made land grants in 42 to the Lydenburg Republic though the wording of the sale is vague. The Boers at the time were fairly weak and could not act upon the land concession. Mswati continued to fight with other African tribes across the land and beyond in areas such as ": null
    },
    {
        "Zoutpansberg": "zoutpansberg"
    },
    {
        " and ": null
    },
    {
        "Ohrigstad": "ohrigstad"
    },
    {
        ". His death in 42 brought about an end to the conquest by the Swazi kings. Mswati was succeeded by ": null
    },
    {
        "Ludvonga": "ludvonga"
    },
    {
        ", however he died in his youth and as a result ": null
    },
    {
        "Mbandzeni": "mbandzeni"
    },
    {
        " was chosen by the Swazis National Council instead, and King Mbandzeni appointed Chief Manzini Mbokane as one of his leading tribal advisors. Chief Manzini Mbokane was a father of Ntengu Mbokane, and Chief Mbokane was the leader of the Kings Advisory Council, which was later called Liqoqo.                    Swazi contact with European began when Dutch ": null
    },
    {
        "Trekboers": "trekboers"
    },
    {
        " reached the western hinterland of Swaziland in the 42s.   By 42 about 42 Boer families had settled in Ohristad with more families in Lydenburg. Two deeds of sale dated 42 and 42 indicate the sale of Swazi territory to the Dutch republics for a sum of 42 cattle. These deeds at face value seemed to surrender the whole of the   Swazi territory to the Dutch. Following the death of King ": null
    },
    {
        "Mswati II": "mswati ii"
    },
    {
        " in 42 a period of regency followed with Queen Regent   ": null
    },
    {
        "Tsandzile Ndwandwe": "tsandzile ndwandwe"
    },
    {
        " until 42 The ": null
    },
    {
        "South African Republic": "south african republic"
    },
    {
        " in 42 attempted to annex Swaziland by a proclamation. ": null
    },
    {
        "Mbandzeni": "mbandzeni"
    },
    {
        ", following the death of his half brother, the crown prince ": null
    },
    {
        "Ludvonga": "ludvonga"
    },
    {
        " in 42 was chosen by inkhosikati LaMgadlela Khumalo as her adopted son and hence a crown prince. However threats existed from prince Mbilini who had married one of Ntengu Mbokanes daughters, and Mbandzenis half brother and one of the sons of Mswati who was a pretender to the throne and allied with the Zulu   King ": null
    },
    {
        "Cetshwayo": "cetshwayo"
    },
    {
        ". However, he never became successful. The British prevented any attacks from Cetshwayo who had been crowned by Sir ": null
    },
    {
        "Theophilus Shepstone": "theophilus shepstone"
    },
    {
        ". In addition, the Transvaal Boers wanted to assert their authority over Swaziland by supporting Mbandzeni. Indeed, in Mbandzenis coronation Rudolf, the Resident Magistrate of Ladysmith and former landdrost of ": null
    },
    {
        "Utrecht": "utrecht, kwazulu-natal"
    },
    {
        " in the company of about 42 burghers and 42 wagons, attended the ceremony. During this period, the Transvaal was annexed by Britain. In 42 the same year as the Zulu war, Mbandzeni aided the British who were now controlling the Transvaal to defeat ": null
    },
    {
        "Sekhukhune": "sekhukhune"
    },
    {
        " and dismantle his kingdom. In return for his assistance, Swazilands independence was to be guaranteed perpetually and Swaziland would be protected from Boer and Zulu encroachment.     In 42 the Pretoria convention establishing the British suzerainty over the Transvaal State, article 42 guaranteed the independence of Swaziland, its boundary and Swazi people in their country as recognised by both Britain and the Transvaal. Under this convention, the Swazi territory was reduced in size, leaving Swazi people as residents of the Transvaal territory in what is today ": null
    },
    {
        "Mpumalanga": "mpumalanga"
    },
    {
        " province in South Africa. The London Convention of 42s article XII continued to recognise Swaziland as an independent country with Mbandzeni as its King. However, in the years between 42 and 42 as more concessions were granted, the population of   Europeans in Swaziland increased. Unease with some concessionaires led to Mbandzeni to request British intervention. In addition to this, Boer encroachments especially in 42 increased the intensity of these requests. The situation in the country continued to deteriorate as some raids, cattle rustling and stealing of children from Swazi villages by Boers continued. Britain refused intervention on the grounds that the was presence of European residence not of British extraction and concessions held at the time by the South African Republic in areas such as tax collection, postal services which should be in the control of a State government.     On 42 December 42 after ": null
    },
    {
        "Mbandzeni": "mbandzeni"
    },
    {
        "s death, the Swazi Government, represented by the Queen Regent ": null
    },
    {
        "Tibati Nkambule": "tibati nkambule"
    },
    {
        " and the Swazi Council made a proclamation. In this appointing Sir ": null
    },
    {
        "Theophilus Shepstone": "theophilus shepstone"
    },
    {
        " and two other officers representing the South African Republic and Britain and a provisional council to oversee administration of the country especially concession and affairs of European residents of the country. A concessions court was established to see which concessions were valid and which were dubious.   The organic proclamation was followed by the London convention of 42 which settled the matter over Swaziland. The Swazi proclamation supporting this convention was resisted for a while since its proposal in 42 and was signed by the Queen Regent and Swazi Council in December 42 In this convention, the status of Swaziland, its people and the Kings were recognised as in the 42 convention. However, for the administrative affairs of Swaziland it would be a protected state of the Transvaal republic with guarantees on the rights of Swazi people in their country and their system of governance. This administration, led by Krogh, went on until the Anglo Boer war started in 42 Ngwane V who had been chosen as crown prince following Mbandzenis death in 42 was crowned in 42 after the London Convention. In 42 he was allegedly responsible for the   death of his advisor Mbaba Nsibandze and two of his aides. In response he was charged with the crime and during this time he fled to British Zululand returning on guaranteed for his safety. On his return he was charged with a lesser crime of public disturbance and was fined 42 pounds. In addition, his judicial powers were reduced. The next year in October 42 the ": null
    },
    {
        "Anglo Boer War": "anglo boer war"
    },
    {
        " began. This led to the discontinuity of Transvaal administration of Swazilands affairs. ": null
    },
    {
        "Ingwenyama": "ingwenyama"
    },
    {
        " Ngwane V, however ruled until December of that year when he died while dancing the sacred ": null
    },
    {
        "incwala": "incwala"
    },
    {
        ". During a period of concessions preceded by famine around 42 some of the tindvunas from within Swaziland like Mshiza Maseko and Ntengu kaGama Mbokane the son of Chief Manzini Mbokane were given permission by King Mbandzeni to relocate to farms towards the Komati River, Mshiza Maseko later settled in a place called eLuvalweni, where he was later buried. It is said that Mshizas son Nyovane Maseko, was later appointed indvuna by Nandzi the wife of Mswati II after Mbandzeni had died, after his appointment he established the Nhleleleka settlement and invited the younger Mogajane Mbokane the son of Ntengu Mbokane to be one of the tindvunas in the settlement he had created.            Swaziland was indirectly involved in the ": null
    },
    {
        "Second Boer War": "second boer war"
    },
    {
        " . The beginning of the conflict found it administrated by the ": null
    },
    {
        "South African Republic": "south african republic"
    },
    {
        ", with the colonial headquarters set at ": null
    },
    {
        "Bremersdorp": "manzini, swaziland"
    },
    {
        ". In September, 42 with war considered imminent, the colonists started evacuating the area. ": null
    },
    {
        "Ngwane V of Swaziland": "ngwane v of swaziland"
    },
    {
        " was informed that the area would be left in his care during the absence of the white residents. The Swaziland Police under Sgt Opperman started practicing for war while issuing rifles and ammunition to remaining ": null
    },
    {
        "burgher": "citizen"
    },
    {
        "s. On 42 October 42 Special Commissioner Krogh issued an official notice of evacuation for all white inhabitants with the exception of burghers eligible for ": null
    },
    {
        "active service": "active duty"
    },
    {
        ". Most of the British subjects were escorted towards the border with ": null
    },
    {
        "Mozambique": "mozambique"
    },
    {
        ", women and other South African civilians were left heading for various destinations. People with ": null
    },
    {
        "dual nationality": "multiple citizenship"
    },
    {
        " were still subject to the draft, though unwilling to fight against their own people. Several of them escaped towards Mozambique or the ": null
    },
    {
        "Colony of Natal": "colony of natal"
    },
    {
        ".     It was not long before skirmishes involved the Swaziland forces. On 42 October 42 the newly formed Swaziland ": null
    },
    {
        "Commando": "commando"
    },
    {
        " unit moved against a British police post at Kwaliweni. The South African unit counted about 42 burghers, while the outpost only had 42 men. Bhunu managed to warn the police post of the approaching attack. The police retreated towards ": null
    },
    {
        "Ingwavuma": "ingwavuma"
    },
    {
        ", seat of a magistrate. The Commandos burned the abandoned post and a nearby shop to the ground. Then Joaquim Ferreira led them towards Ingwavuma. The village was not better guarded and had to also be evacuated. The Swaziland Commando burned it to the ground, while the magistrate and his people escaped to ": null
    },
    {
        "Nongoma": "nongoma"
    },
    {
        ".     Meanwhile, the Swazi people had been warned by ": null
    },
    {
        "Piet Joubert": "piet joubert"
    },
    {
        " to remain calm and not involve themselves in the conflict. Bhunu instead found himself unrestricted from colonial authorities for the first time. He soon felt free to settle old scores with political enemies. News of the violent deaths of diplomat Mnkonkoni Kunene and several others in time reached the Boer forces involved in the ": null
    },
    {
        "Siege of Ladysmith": "relief of ladysmith"
    },
    {
        ". Several of the dead had close ties to the colonial authorities. Joubert had to assure worried commanders that Swaziland was not turning against them. Indeed, spies reported that Bhunu feared he had been bewitched. He was striking against whomever he suspected of the deed. On 42 December 42 Bhunu died due to a serious illness. He had blamed it on sorcery, though contemporaries suspect it was alcohol-induced. His mother ": null
    },
    {
        "Labotsibeni Mdluli": "labotsibeni mdluli"
    },
    {
        " became regent. She set about eliminating the surviving advisors and favourites of Bhunu.     Swazi regiments were roaming the country during the internal conflicts. The South African authorities were worried that the violence could expand towards the south-western border of Swaziland, where Boer farms were cultivated by women and children. They had the farms evacuated and the population transferred to ": null
    },
    {
        "Piet Retief": "piet retief, mpumalanga"
    },
    {
        ". The farmers from Piet Retief, ": null
    },
    {
        "Wakkerstroom": "wakkerstroom"
    },
    {
        " and their vicinities had made a practice of trekking their ship into Swaziland for winter grazing. In January 42 ": null
    },
    {
        "Francis William Reitz": "francis william reitz"
    },
    {
        ", the ": null
    },
    {
        "State Secretary of the South African Republic": "state secretary of the south african republic"
    },
    {
        ", started issuing orders discouraging any sheep-herders from entering Swaziland. On 42 April 42 any such entry was forbidden. The Swaziland Commando were by that point far from their initial home base, fighting along the ": null
    },
    {
        "Tugela River": "tugela river"
    },
    {
        ".     The British had their own concerns about Swaziland. They suspected that supplies from Mozambique could be smuggled to the Boers through Swaziland. Queen-regent Labotsibeni was however attempting to maintain neutrality in the wider conflict, pre-occupied with securing the throne. Her grandson ": null
    },
    {
        "Sobhuza II of Swaziland": "sobhuza ii of swaziland"
    },
    {
        " was underage and there were other viable candidates for the throne among the ": null
    },
    {
        "House of Dlamini": "house of dlamini"
    },
    {
        ", in particular Prince Masumphe. Masumphe was a cousin of Bhunu and had been a rival candidate for the throne since 42 His line of the family maintained close relations with the Boers, the Prince himself having been educated at ": null
    },
    {
        "Pretoria": "pretoria"
    },
    {
        ". By May, 42 the Queen was worried that the Boers would intervene against her in case of a succession dispute. She opened communications with the restored magistrate of ": null
    },
    {
        "Ingwavuma": "ingwavuma"
    },
    {
        ", arranging to flee to his area if needed.     Her messages were passed to the government of Natal and from there to ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        ", the capital of the ": null
    },
    {
        "Cape Colony": "cape colony"
    },
    {
        ". A reply by ": null
    },
    {
        "Johannes Smuts": "johannes smuts"
    },
    {
        " assured her that the British had not forgotten about the Swazi and British representatives would reliably return to Swaziland at an early date. The message might have reflected Smuts own ambitions but his authority on such matters was rather questionable. But ": null
    },
    {
        "Frederick Roberts, Baron Roberts": "frederick roberts, 1st earl roberts"
    },
    {
        ", a high-ranking military officer, was also convinced to start diplomatic contacts with the Queen. His representatives were to persuade the queen-regent of three things: first, the need to prevent the Boers from occupying the mountains of the area; secondly, the necessity of formally appealing for British protection; and third, to make clear that the indiscriminate murders in Swaziland would have to end.     The British contacts with the Swazi played a role in advance of their siege of ": null
    },
    {
        "Komatipoort": "komatipoort"
    },
    {
        ", a nearby South African stronghold. In September 42 once the town fell, the British were able to capture ": null
    },
    {
        "Barberton": "barberton, mpumalanga"
    },
    {
        " and its area. A number of Boers fled into Swaziland, only to have the Swazi disarm them and confiscate their cattle. The end of South African presence in the area left open the question of what to do with Swaziland. Smuts had been campaigning since May to convince the British authorities to place Swaziland under their administration. By September, Smuts had gained some support from civil authorities but not from military ones, since Roberts did not want to devote any of his forces to an invasion or occupation of the area. Nevertheless, Smuts attempted some diplomatic contacts with the Swazi, which were not particularly successful. The individual Smuts met for discussions refused to give any information on the internal affairs of Swaziland or Boer activities.     The fall of Komatipoort directly resulted in increased importance of Swaziland for the Boers. To maintain their communications with diplomatic and trade contacts in ": null
    },
    {
        "Lourenço Marques": "maputo"
    },
    {
        ", Mozambique, the Boers had to send messengers through Swaziland. This was difficult, since British forces were allowed to pass through certain Swazi areas. By November 42 the Queen was able to assure both Roberts and Smuts that she was doing her best to drive Boers out of her country. A few armed burghers and their African allies, hostile to her government, were still active at times.     On November 42 42 Roberts was relieved of his command. His replacement was ": null
    },
    {
        "Herbert Kitchener, Baron Kitchener of Khartoum": "herbert kitchener, 1st earl kitchener"
    },
    {
        ". By late December, Smuts contacted the military secretary office of Kitchener concerning the Swaziland situation. Smuts had secured the position of Resident Commissioner of Swaziland, though the British had no actual authority over the area. He attempted to convince Kitchener it was time to establish a permanent military presence in Swaziland and put Smuts in charge of the area. Kitchener had a different view. Starting his own correspondence with Labotsibeni, Kitchener insisted on three points: first, the Swazi were still required to not take part in the war; second, no British forces would be sent into Swaziland unless the area faced a Boer invasion; and third, the Swazis were now directly under the authority of the ": null
    },
    {
        "British Crown": "monarchy of the united kingdom"
    },
    {
        ", owing their loyalty to ": null
    },
    {
        "Victoria of the United Kingdom": "victoria of the united kingdom"
    },
    {
        ".     In December 42–January 42 there were reports that retreating Boers were attempting to flee through Swaziland. Eight British columns were sent to either force the Boer commandos to surrender or flee to Swaziland. A certain column under ": null
    },
    {
        "Horace Smith-Dorrien": "horace smith-dorrien"
    },
    {
        " proceeded all the way to the Swaziland border, managing to capture several Boer wagons and large numbers of cattle and sheep on February 42 42 Most of the captured Boers were sent to the ": null
    },
    {
        "concentration camp": "internment"
    },
    {
        " of ": null
    },
    {
        "Volksrust": "volksrust"
    },
    {
        ". On February 42 another column under ": null
    },
    {
        "Edmund Allenby": "edmund allenby, 1st viscount allenby"
    },
    {
        " was positioned at the southern border of Swaziland. On February 42 Smith-Dorriens forces reached ": null
    },
    {
        "Amsterdam": "amsterdam, mpumalanga"
    },
    {
        ". There he was contacted by envoys of the Queen-regent, requesting aid in driving the Boers off her land. In response, the ": null
    },
    {
        "Imperial Light Horse": "light horse regiment"
    },
    {
        " and the ": null
    },
    {
        "Suffolk Regiment": "suffolk regiment"
    },
    {
        " were sent into Swaziland.     Joined by armed Swazis, the two regiments were able to capture about 42 Boers in an initial skirmish. However heavy rains soon slowed their advance through the country. On February 42 42 42 other men of the British ": null
    },
    {
        "mounted infantry": "mounted infantry"
    },
    {
        " entered Swaziland. Under Lt. Col. Henry, this force managed to locate and capture the transport convoy of the Piet Retief Commandos. About 42 Boers were captured in the operation. The remnants of the Commandos retreated towards the southern border of Swaziland, only to be captured by the British forces stationed there. By early March, Smith-Dorrien noted that the Swazis were ": null
    },
    {
        "pillaging": "looting"
    },
    {
        " Boer residences. By this time, Allenby had reached ": null
    },
    {
        "Mahamba": "mahamba"
    },
    {
        " and set up camp there, Henry was pursuing another Boer wagon convoy and Queen-regent Labotsibeni was ordering her ": null
    },
    {
        "Impi": "impi"
    },
    {
        "s to clear their land from the Boers. Henry eventually managed to return to ": null
    },
    {
        "Derby": "derby, north west"
    },
    {
        " with several prisoners, while Allenby and his forces reached the vicinity of ": null
    },
    {
        "Hlatikulu": "hlatikulu"
    },
    {
        ". The burthers had to limit themselves to the hills of southwestern Swaziland .     Surviving accounts from the ": null
    },
    {
        "Devonshire Regiment": "devonshire regiment"
    },
    {
        " indicate that the Swazis were acting as a ninth column, commanded by the Queen of the Swazis. On March 42 42 remnants of the Piet Retief Commandos, accompanied by women and children, were attacked by forces supposedly under Chief Ntshingila Simelano. The latter consisted of about 42 men, including two riflemen. Thirteen Burghers and one African guide were killed, several wounded, and the others were scattered. Some of the survivors later surrendered to the ": null
    },
    {
        "42th Hussars": "18th royal hussars"
    },
    {
        ". Ntshingila later denied any involvement in the massacre. In any case, the incident terrified several other Boers. Between March 42 and 42 about 42 burghers and various women and children chose to surrender to Allenby rather than face the Swazis. The British nevertheless warned Labotsibeni to cease further massacres.     On 42 April 42 ": null
    },
    {
        "Louis Botha": "louis botha"
    },
    {
        " corresponded with Kitchener, complaining that British officers were inducing the Swazis to fight against the Boers. Claiming the result was the indiscriminate murders of Burghers, women and children by Swazi commandos. Allenby attributed the killings partly to Swazi anxiety to counter Boer incursions into their territory and partly to their fear of Boer reprisals. That is what the Boers would do when the British eventually left. Allenby himself refused to allow large numbers of armed Swazis to join his column, though he still used a few of them as guides. Smuts finally entered Swaziland during this month, though unable to establish his authority over any British forces.     The presence of regular British troops allowed the queen-regent to present to them her concerns over an irregular unit, Steinaeckers Horse. Created early in the war as a unit of adventurers and mercenaries under British command, they were well known for looting Boer property. With the Boer increasingly impoverished, however, they had turned their attention to the cattle of the Swazi. Labotsibeni complained to both sides that this unit consisted of common robbers occupying Bremersdorp. Botha responded by sending a Commando unit against the Horse, with orders to avoid antagonizing the Swazi in any way. The Swazi National Council agreed to let them pass. Between July 42 and 42 42 the Ermelo Commandos succeeded in forcing most of the Steinaeckers Horse forces to retreat, capturing about 42 men, killing or wounding a few and burning Bremersdorp to the ground.     Both the British and the Boers continued to have access to Swaziland with occasional skirmishes occurring. On November 42 42 for example, the ": null
    },
    {
        "42th Hussars": "13th hussars"
    },
    {
        " captured 42 burghers near Mahamba. The skirmishes ended in February 42 with the defeat of the final Boer unit in Swaziland.         Throughout the colonial period from 42 to 42 Swaziland was governed by a resident commissioner who ruled according to decrees issued by the British High Commissioner for South Africa. Such decrees were formulated in close consultation with the resident commissioners, who in turn took informal and formal advice from white settler interests and the Swazi royalty. In 42 during the residency of ": null
    },
    {
        "Robert Coryndon": "robert coryndon"
    },
    {
        ", Swazi land was partitioned into a third for Swazi nation land or reserves and the remaining two thirds into crown and commercial land for European occupation. The partition was carried out in 42 with Swazis living in European areas given five year to vacate the land.     ": null
    },
    {
        "Swaziland": "swaziland"
    },
    {
        "      In 42 the British established Swazilands first legislative body—a European Advisory Council of elected white representatives mandated to advise the British high commissioner on non-Swazi affairs. In 42 the high commissioner both reconstituted the basis and role of the EAC, and, over Swazi objections, issued a Native Authorities Proclamation constituting the paramount chief or Ingwenyama and King to the Swazis, as the British called the king, as the native authority for the territory to issue legally enforceable orders to the Swazis subject to restrictions and directions from the resident commissioner. Under pressure from royal non-cooperation this proclamation was revised in 42 to grant the Swazi paramount chief a degree of autonomy unprecedented in British colonial ": null
    },
    {
        "indirect rule": "indirect rule"
    },
    {
        " in Africa. Also in 42 after more than 42 years of regency headed by Queen Regent ": null
    },
    {
        "Labotsibeni": "labotsibeni mdluli"
    },
    {
        ", ": null
    },
    {
        "Sobhuza II": "sobhuza ii of swaziland"
    },
    {
        " became ": null
    },
    {
        "Ingwenyama": "ngwenyama"
    },
    {
        " or head of the Swazi nation.     In the early years of colonial rule, the British expected that Swaziland would eventually be incorporated into South Africa. After ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", however, South Africas intensification of racial discrimination induced the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " to prepare Swaziland for independence. Political activity intensified in the early 42s. Several political parties were formed and jostled for independence and economic development. The largely urban parties had few ties to the rural areas, where the majority of Swazis lived. The traditional Swazi leaders, including King ": null
    },
    {
        "Sobhuza II": "sobhuza ii of swaziland"
    },
    {
        " and his Inner Council, formed the Imbokodvo National Movement , a political group that capitalized on its close identification with the Swazi way of life. Responding to pressure for political change, the colonial government scheduled an election in mid42 for the first legislative council in which the Swazis would participate. In the election, the INM and four other parties, most having more radical platforms, competed in the election. The INM won all 42 elective seats.         Leading up to independence, the INM had solidified its political base. Having done this, the INM incorporated many demands of the more radical parties, especially that of immediate independence. In 42 the UK Government agreed to discuss a new constitution. A constitutional committee agreed on a constitutional monarchy for Swaziland, with self-government to follow ": null
    },
    {
        "parliamentary elections in 42": "1967 swazi general election"
    },
    {
        ". Swaziland became independent on September 42 42 Swazilands ": null
    },
    {
        "first post-independence elections were held in May 42": "1972 swazi general election"
    },
    {
        ". The INM received close to 42% of the vote. The ": null
    },
    {
        "Ngwane National Liberatory Congress": "ngwane national liberatory congress"
    },
    {
        " received slightly more than 42% of the vote which gained the party three seats in parliament.     In response to the NNLCs showing,  King Sobhuza repealed the 42 constitution on April 42 42 and dissolved parliament. He assumed all powers of government and prohibited all political activities and trade unions from operating. He justified his actions as having removed alien and divisive political practices incompatible with the Swazi way of life. In January 42 a new parliament was convened, chosen partly through indirect elections and partly through direct appointment by the king.     King Sobhuza II died in August 42 and Queen Regent Dzeliwe assumed the duties of the head of state. In 42 an internal dispute led to the replacement of the prime minister and eventual replacement of Dzeliwe by a new Queen Regent ": null
    },
    {
        "Ntombi": "ntombi of swaziland"
    },
    {
        ". Ntombis only child, Prince ": null
    },
    {
        "Makhosetive": "mswati iii of swaziland"
    },
    {
        ", was named heir to the Swazi throne. Real power at this time was concentrated in the Liqoqo, a supreme traditional advisory body that claimed to give binding advice to the Queen Regent. In October 42 Queen Regent Ntombi demonstrated her power by dismissing the leading figures of the Liqoqo. Prince Makhosetive returned from school in ": null
    },
    {
        "England": "england"
    },
    {
        " to ascend to the throne and help end the continuing internal disputes. He was enthroned as ": null
    },
    {
        "Ingwenyama": "ngwenyama"
    },
    {
        " Mswati III": "mswati iii of swaziland"
    },
    {
        " on April 42 42 Shortly afterwards he abolished the Liqoqo. In ": null
    },
    {
        "November 42 a new parliament was elected": "1987 swazi general election"
    },
    {
        " and a new cabinet appointed.            ": null
    },
    {
        "Mswati III": "mswati iii"
    },
    {
        " is the present monarch of Swaziland since his coronation in 42 and rules together with Queen Mother ": null
    },
    {
        "Ntombi Tfwala": "ntombi of swaziland"
    },
    {
        ". In 42 ": null
    },
    {
        "Sotsha Dlamini": "sotsha dlamini"
    },
    {
        " was appointed Prime Minister, taking over from ": null
    },
    {
        "Prince Bhekimpi": "bhekimpi dlamini"
    },
    {
        ". In 42 following a premature dissolution of parliament by the king, Swaziland held its third parliamentary election under the ": null
    },
    {
        "tinkhundla": "tinkhundla"
    },
    {
        " traditional system. In 42 and 42 an underground political party, the ": null
    },
    {
        "Peoples United Democratic Movement": "peoples united democratic movement"
    },
    {
        " , criticized the king and his government, calling for democratic reforms. In response to this political threat and to growing popular calls for greater accountability within government, the king and the prime minister initiated an ongoing national debate on the constitutional and political future of Swaziland. This debate produced a handful of political reforms, approved by the king, including direct and indirect voting, in ": null
    },
    {
        "the 42 national elections": "1993 swazi general election"
    },
    {
        ". In this election, voters were registered, the constituencies were increased from 42 to 42 and the election were judged as free and fair.     The economy and the population of Swaziland continued to grow in the 42s. The average economic growth being 42% annual growth between 42 and 42 Annual population growth was at approximately 42% during the same period. Swazilands 42s economy continued to be dependent on South Africa, with 42% of imports coming from South Africa and 42% of exports going to South Africa. Swaziland, along with Lesotho, Botswana and South Africa continued to be members of the Southern African Customs Union . State revenues were heavily dependent on the Customs Unions remittances which were between 42% and 42% between 42 and 42     The 42s saw a rise in student and labor protests pressuring the king to introduce reforms. Thus, progress toward constitutional reforms began, culminating with the introduction of the current Swaziland constitution in 42 This happened despite objections by political activists. The current constitution does not clearly deal with the status of political parties. The first election under the new constitution, took place in 42 Members of parliament were elected from 42 constituencies . These MPs served five year terms which ended in 42 In 42 Swaziland suffered an economic crisis, due to reduced ": null
    },
    {
        "SACU": "southern african customs union"
    },
    {
        " receipts. This led to the government of Swaziland to request a loan from neighbouring South Africa. However, the Swazi government did not agree with the conditions of the loan, which included political reforms. During this period, there was increased pressure on the Swaziland government to carry out more reforms. Public protests by civic organizations and trade unions became more common. Improvements in SACU receipts from 42 onwards, eased the fiscal pressure on the Swazi government. The new parliament, the second since promulgation of the constitution, was elected on 42 September 42 This saw the reappointment of Sibusiso Dlamini, by the king, as prime minister for the third time.     In 42 Sotja Dlamini was dismissed from his position as Prime Minister on 42 July 42 and was replaced with a former ": null
    },
    {
        "Swaziland Federation of Trade Unions": "swaziland federation of trade unions"
    },
    {
        " secretary-general, ": null
    },
    {
        "Obed Dlamini": "obed dlamini"
    },
    {
        ". He was to be the premier until 42 and succeeded by ": null
    },
    {
        "Prince Mbilini": "jameson mbilini dlamini"
    },
    {
        ". During the tenure of both Obed and Mbilini there was growing labor militancy which culminated in a major general strike in 42 led by the SFTU. Following the labor action, Prince Mbilini was replaced as Prime Minister by ": null
    },
    {
        "Sibusiso Dlamini": "barnabas sibusiso dlamini"
    },
    {
        ".     On 42 April 42 King ": null
    },
    {
        "Mswati III": "mswati iii"
    },
    {
        " announced that the Kingdom of Swaziland had renamed itself the Kingdom of Eswatini to mark the 42th anniversary of Swazi independence. The new name, Eswatini, means land of the ": null
    },
    {
        "Swazis": "swazi people"
    },
    {
        " in the ": null
    },
    {
        "Swazi language": "swazi language"
    },
    {
        ", and was partially intended to prevent confusion with the similarly named ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ".  ": null
    }
]