[
    {
        "This article is about the history of the United States National Security Council during the Eisenhower Administration, 42 & ndash;42.     Under ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " Dwight D. Eisenhower": "dwight d. eisenhower"
    },
    {
        ", the ": null
    },
    {
        "National Security Council": "united states national security council"
    },
    {
        " system evolved into the principal arm of the President in formulating and executing policy on ": null
    },
    {
        "military": "military"
    },
    {
        ", international, and internal security affairs. Where ": null
    },
    {
        "Harry S. Truman": "harry s. truman"
    },
    {
        " was uncomfortable with the NSC system and only made regular use of it under the pressure of the ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        ", Eisenhower embraced the NSC concept and created a structured system of integrated policy review. Eisenhower had a penchant for careful staff work, and believed that effective planning involved a creative process of discussion and debate among advisers compelled to work toward consensus recommendations.     The genesis of the new NSC system was a report prepared for the President in March 42 by ": null
    },
    {
        "Robert Cutler": "robert cutler"
    },
    {
        ", who became the Presidents ": null
    },
    {
        "Special Assistant for National Security Affairs": "assistant to the president for national security affairs"
    },
    {
        ". Cutler proposed a systematic flow of recommendation, decision, and implementation that he later described as the policy hill process. At the bottom of the hill, concerned agencies such as ": null
    },
    {
        "State": "united states department of state"
    },
    {
        " and ": null
    },
    {
        "Defense": "united states department of defense"
    },
    {
        " produced draft policy recommendations on specific topics and worked for consensus at the agency level. These draft NSC papers went up the hill through the Planning Board, created to review and refine the recommendations before passing them on for full NSC consideration. The NSC Planning Board met on Tuesday and Friday afternoons and was composed of officials at the Assistant Secretary level from the agencies with permanent or standing representation on the Council, as well as advisers from the ": null
    },
    {
        "Joint Chiefs of Staff": "joint chiefs of staff"
    },
    {
        " and ": null
    },
    {
        "Central Intelligence Agency": "central intelligence agency"
    },
    {
        ". Hundreds of hours were spent by the Board reviewing and reconstructing proposed papers for the NSC. Cutler resigned in 42 in exhaustion. The top of the foreign policy-making hill was the NSC itself, chaired by the President, which met regularly on Thursday mornings.     The Council consisted of the five statutory members: the President, ": null
    },
    {
        "Vice President": "vice president of the united states"
    },
    {
        ", ": null
    },
    {
        "Secretaries of State": "united states secretary of state"
    },
    {
        " and ": null
    },
    {
        "Defense": "united states secretary of defense"
    },
    {
        ", and Director of the ": null
    },
    {
        "Office of Defense Mobilization": "office of defense mobilization"
    },
    {
        ". Depending on the subject under discussion, as many as a score of other senior Cabinet members and advisers, including the ": null
    },
    {
        "Secretary of the Treasury": "united states secretary of the treasury"
    },
    {
        ", the ": null
    },
    {
        "Chairman of the Joint Chiefs of Staff": "chairman of the joint chiefs of staff"
    },
    {
        ", and the ": null
    },
    {
        "Director of Central Intelligence": "director of central intelligence"
    },
    {
        ", attended and participated. The agenda included regular briefings by the Director of Central Intelligence on worldwide developments affecting U.S. security, and consideration of the policy papers advanced by the Planning Board. The upshot of the discussions were recommendations to the President in the form of NSC Actions. The President, who participated in the discussion, normally endorsed the NSC Action, and the decision went down the hill for implementation to the ": null
    },
    {
        "Operations Coordinating Board": "operations coordinating board"
    },
    {
        ".     President Eisenhower created the Operations Coordinating Board to follow up on all NSC decisions. The OCB met regularly on Wednesday afternoons at the Department of State, and was composed of the ": null
    },
    {
        "Under Secretary of State for Political Affairs": "under secretary of state for political affairs"
    },
    {
        ", ": null
    },
    {
        "Deputy Secretary of Defense": "united states deputy secretary of defense"
    },
    {
        ", the Directors of the CIA, the ": null
    },
    {
        "United States Information Agency": "united states information agency"
    },
    {
        ", and ICA, and the Special Assistants to the President for National Security Affairs and Security Operations Coordination. The OCB was the coordinating and implementing arm of the NSC for all aspects of the implementation of national security policy. NSC action papers were assigned to a team from the OCB for follow-up. More than 42 interagency ": null
    },
    {
        "working group": "working group"
    },
    {
        "s were established with experts for various countries and subjects. This 42-person staff of the OCB supported these working groups in which officials from various agencies met each other for the first time.     The Presidents Special Assistant for National Security Affairs, a post held under Eisenhower by Cutler, ": null
    },
    {
        "Dillon Anderson": "dillon anderson"
    },
    {
        ", ": null
    },
    {
        "William Harding Jackson": "william harding jackson"
    },
    {
        ", and finally ": null
    },
    {
        "Gordon Gray": "gordon gray"
    },
    {
        ", oversaw the flow of recommendations and decisions up and down the policy hill, and functioned in Council meetings to brief the Council and summarize the sense of discussion. The Special Assistant was an essential facilitator of the decision-making system, but, unlike the National Security Adviser created under Kennedy, had no substantive role in the process. The NSC staff managed by the Special Assistant grew during the Eisenhower years, but again had no independent role in the policy process.     President Eisenhower had great confidence in the efficacy of covert operations as a viable supplement or alternative to previous normal foreign policy initiatives. The seeming clear success of the operations to ": null
    },
    {
        "overthrow": "1953 iranian coup détat"
    },
    {
        " Iranian populist leader ": null
    },
    {
        "Mossadegeh": "mohammed mosaddeq"
    },
    {
        " in 42 and ": null
    },
    {
        "overthrow": "1954 guatemalan coup détat"
    },
    {
        " the democratically elected, left-leaning President ": null
    },
    {
        "Jacobo Árbenz Guzmán": "jacobo árbenz guzmán"
    },
    {
        " in Guatemala in 42 was not without their crisis moments in the White House. In 42 NSC 42 provided for the establishment of a panel of designated representatives of the President and the Secretaries of State and Defense to meet regularly to review and recommend covert operations. Gordon Gray assumed the chairmanship of the ": null
    },
    {
        "42 Committee": "nsc 5412/2 special group"
    },
    {
        " as it was called, and all succeeding National Security Advisers have chaired similar successor committees, variously named 42 , 42 , Special Coordinating Committee, which, in later Presidential administrations, were charged with the review of CIA covert operations.     President Eisenhower also created the position of staff secretary with the responsibility to screen all foreign policy and military documents coming to the President. While Colonel ": null
    },
    {
        "Andrew Goodpaster": "andrew goodpaster"
    },
    {
        " held this position, he tended to eclipse the Special Assistant for National Security.     The strength of the NSC system under Eisenhower was that it provided for regular, fully staffed, interagency review of major foreign and national security issues, culminating in discussion and decision at the highest level of government. The resulting Presidentially approved NSC papers provided policy guidance at every level of implementation. Eisenhower felt that the regular policy discussions kept his principal advisers fully informed, in step with one another, and prepared to react knowledgeably in the event of crisis. His commitment to the system was such that he chaired every Council meeting he could attend . The NSC meetings, including prior briefings and subsequent review of NSC Actions, constituted the largest single item on his weekly agenda.     Secretary of State ": null
    },
    {
        "John Foster Dulles": "john foster dulles"
    },
    {
        ", on the other hand, had reservations about the NSC system. He was the strongest personality in the Eisenhower Cabinet and jealously guarded his role as principal adviser to the President on foreign policy. He had constant, direct access to the President and did not feel that some of the most sensitive issues should be discussed in groups as large as were involved in most NSC meetings. He drew a sharp line between the NSC policy review process and the day-to-day operations of foreign policy, which he maintained were the province of the Department of State. Dulles and his deputies also were not comfortable with the scope the NSC review system gave to Secretary of the Treasury ": null
    },
    {
        "George Humphrey": "george m. humphrey"
    },
    {
        ", another strong figure in the Cabinet, to intrude budgetary limitations into policy considerations. Dulles successfully resisted a proposal to substitute the Vice President for the Under Secretary of State as chairman of the OCB, arguing that such a change would impinge on his role as principal adviser to the President on foreign policy.     Critics of the Eisenhower NSC system have argued that it was inflexible, overstaffed, unable to anticipate and react to immediate crises, and weighed down by committees reporting in great detail on long checklists of minor policy concerns. The most thorough critique of the system emerged from the hearings conducted in 42 ": null
    }
]