[
    {
        "     This article discusses the history of the territory of ": null
    },
    {
        "Slovakia": "slovakia"
    },
    {
        ".            Discovery of ancient tools made by the ": null
    },
    {
        "Clactonian technique": "clactonian"
    },
    {
        " near ": null
    },
    {
        "Nové Mesto nad Váhom": "nové mesto nad váhom"
    },
    {
        " attests that Slovakias territory was inhabited in the ": null
    },
    {
        "Palaeolithic": "palaeolithic"
    },
    {
        ". Other prehistoric discoveries include the ": null
    },
    {
        "Middle Palaeolithic": "middle palaeolithic"
    },
    {
        " stone tools found near ": null
    },
    {
        "Bojnice": "bojnice"
    },
    {
        ", and a ": null
    },
    {
        "Neanderthal": "neanderthal"
    },
    {
        " discovery at a site near ": null
    },
    {
        "Gánovce": "gánovce"
    },
    {
        ". The ": null
    },
    {
        "Gravettian": "gravettian"
    },
    {
        " culture was present principally in the river valleys of ": null
    },
    {
        "Nitra": "nitra river"
    },
    {
        ", ": null
    },
    {
        "Hron": "hron"
    },
    {
        ", ": null
    },
    {
        "Ipeľ": "ipeľ"
    },
    {
        ", ": null
    },
    {
        "Váh": "váh"
    },
    {
        " and as far as the city of ": null
    },
    {
        "Žilina": "žilina"
    },
    {
        ", and near the foot of the ": null
    },
    {
        "Vihorlat": "vihorlat"
    },
    {
        ", ": null
    },
    {
        "Inovec": "inovec"
    },
    {
        ", and ": null
    },
    {
        "Tribeč": "tribeč"
    },
    {
        " mountains, as well as in the ": null
    },
    {
        "Myjava": "myjava"
    },
    {
        " Mountains. The best known artifact is the ": null
    },
    {
        "Venus of Moravany": "venus of moravany"
    },
    {
        " from ": null
    },
    {
        "Moravany nad Váhom": "moravany nad váhom"
    },
    {
        ".     ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " habitation was found in ": null
    },
    {
        "Želiezovce": "želiezovce"
    },
    {
        ", ": null
    },
    {
        "Gemer": "gemer"
    },
    {
        ", and the Bukové hory massif, the ": null
    },
    {
        "Domica": "domica"
    },
    {
        " cave, and at ": null
    },
    {
        "Nitriansky Hrádok": "nitriansky hrádok"
    },
    {
        ". ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " was marked by the Čakany and ": null
    },
    {
        "Velatice": "velatice"
    },
    {
        " cultures, and then the ": null
    },
    {
        "Lusatian culture": "lusatian culture"
    },
    {
        ", followed by the Calenderberg culture and the ": null
    },
    {
        "Hallstatt culture": "hallstatt culture"
    },
    {
        ".             The ": null
    },
    {
        "Celts": "celts"
    },
    {
        " were the first population in the territory of present-day Slovakia who can be identified on the basis of written sources. The first Celtic groups came from the West around . Settlements of the ": null
    },
    {
        "La Tène culture": "la tène culture"
    },
    {
        " indicate that the Celts colonized the lowlands along the river ": null
    },
    {
        "Danube": "danube"
    },
    {
        " and its tributaries. The local population was either subjected by the Celts or withdrew to the mountainous northern territory. New Celtic groups arrived from Northern Italy during the . The Celts initially lived in tiny huts in sizewhich either formed small villages or were scattered across the countryside.     Some of the small hill forts which were built in the  developed into important local economic and administrative centers. For example, the hill fort at Zemplín was a center of iron-working; glass works were unearthed at ": null
    },
    {
        "Liptovská Mara": "liptovská mara"
    },
    {
        "; and local coins were struck at Bratislava and Liptovská Mara. Coins from Bratislava bore inscriptions like ": null
    },
    {
        "Biatec": "biatec"
    },
    {
        " and Nonnos. The fort at Liptovská Mara was also an important center of the cult of the bearers of the ": null
    },
    {
        "Púchov culture": "púchov culture"
    },
    {
        " of the Northern Carpathians.     ": null
    },
    {
        "Burebista": "burebista"
    },
    {
        ", King of the ": null
    },
    {
        "Dacians": "dacians"
    },
    {
        ", invaded the Middle Danube region and subjugated the majority of the local ": null
    },
    {
        "Celtic tribes": "celtic tribes"
    },
    {
        "  around . Burebistas empire collapsed after he died about 42 years later. Archaeological sites yielding painted ceramics and other artefacts of Dacian provenance suggest that Dacian groups settled among the local Celts in the region of the rivers ": null
    },
    {
        "Bodrog": "bodrog"
    },
    {
        ", ": null
    },
    {
        "Hron": "hron"
    },
    {
        " and ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        ". The spread of the Púchov culture , associated with the Celtic ": null
    },
    {
        "Cotini": "cotini"
    },
    {
        ", shows that the bearers of that culture started a northward expansion during the same period.     The ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        " and the ": null
    },
    {
        "Germanic tribes": "germanic peoples"
    },
    {
        " launched their first invasions against the territories along the Middle Danube in the last decade of the . Roman legions crossed the Danube near Bratislava under the command of ": null
    },
    {
        "Tiberius": "tiberius"
    },
    {
        " to fight against the Germanic ": null
    },
    {
        "Quadi": "quadi"
    },
    {
        " in , but the local tribes rebellion in Pannonia forced the Romans to return. Taking advantage of internal strifes, the Romans settled a group of Quadi in the lowlands along the Danube between the rivers ": null
    },
    {
        "Morava": "morava"
    },
    {
        " and ": null
    },
    {
        "Váh": "váh"
    },
    {
        " in 42 making ": null
    },
    {
        "Vannius": "vannius"
    },
    {
        " their king. The Germans lived in rectangular houses, rather than square ones, and cremated their dead, placing the ashes in an urn.     Although the Danube formed the frontier between the Roman Empire and the ": null
    },
    {
        "Barbaricum": "barbaricum"
    },
    {
        " , the Romans built small outposts along the left bank of the Danube, for instance, at ": null
    },
    {
        "Iža": "iža"
    },
    {
        " and ": null
    },
    {
        "Devín": "devín"
    },
    {
        ". During the same period, the Germanic tribes were expanding to the north along the rivers Hron, ": null
    },
    {
        "Ipeľ": "ipeľ"
    },
    {
        " and Nitra. Roman troops crossed the Danube several times during the ": null
    },
    {
        "Marcomannic Wars": "marcomannic wars"
    },
    {
        " between 42 and 42 Emperor ": null
    },
    {
        "Marcus Aurelius": "marcus aurelius"
    },
    {
        " accomplished the first chapter of his  Meditations  during a campaign against the Quadi in the region of the Hron River in 42 The ": null
    },
    {
        "Miracle of the Rain": "history of christianity in slovakiaantiquity"
    },
    {
        " a storm which saved an exhausted Roman armyoccurred in the land north of the Danube in 42; Christian authors attributed it to a Christian soldiers prayer. Roman troops crossed the Danube for the last time in 42 during Emperor ": null
    },
    {
        "Valentinian I": "valentinian i"
    },
    {
        "s campaign against the Quadi who had allied with the ": null
    },
    {
        "Sarmatians": "sarmatians"
    },
    {
        " and invaded the Roman province of ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        ".                In the 42th century AD, the Roman Empire could no longer resist the attacks by the neighboring peoples. The empires frontier started to collapse along the Danube in the 42s. The development of the ": null
    },
    {
        "Hunnic Empire": "hunsbefore attila"
    },
    {
        " in the ": null
    },
    {
        "Eurasian Steppes": "eurasian steppes"
    },
    {
        " forced large groups of Germanic peoples, including the Quadi and the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        ", to leave their homelands by the Middle Danube and along the upper course of the river ": null
    },
    {
        "Tisza": "tisza"
    },
    {
        " in the early . Their lands were occupied by the ": null
    },
    {
        "Heruli": "heruli"
    },
    {
        ", ": null
    },
    {
        "Scirii": "scirii"
    },
    {
        ", ": null
    },
    {
        "Rugii": "rugii"
    },
    {
        " and other Germanic peoples. However, the ": null
    },
    {
        "Carpathian Basin": "carpathian basin"
    },
    {
        " was dominated by the nomadic ": null
    },
    {
        "Huns": "huns"
    },
    {
        " from the early  and the Germanic peoples became subjects to ": null
    },
    {
        "Attila the Hun": "attila the hun"
    },
    {
        ".     Disputes among Attilas sons caused the disintegration of his empire shortly after his death in 42 The Germanic peoples either regained their independence or left the Carpathian Basin . Warriors graves from the next century yielded large number of swords, spears, arrow heads, axes and other weapons. Other archaeological finds, including a glass ": null
    },
    {
        "beaker": "beaker"
    },
    {
        " from ": null
    },
    {
        "Zohor": "zohor"
    },
    {
        ", shows that the local inhabitants had close contacts with the ": null
    },
    {
        "Frankish Empire": "frankish empire"
    },
    {
        " and ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        ".               Regarding the early history of Slavs, Slavic texts or a record written by a Slav dating from before the late 42th century are not known. The foreign sources about Slavs are very inconsistent. According to a scholarly theory, the first Slavic groups settled in the eastern region of present-day Slovakia already in the . The 42th-century Byzantine historian ": null
    },
    {
        "Jordanes": "jordanes"
    },
    {
        " wrote that the funeral feast at Attilas burial was called strava. Scholars who identify that word as a ": null
    },
    {
        "Slavic": "slavic languages"
    },
    {
        " expression say that Jordanes report proves that Slavs inhabited the Carpathian Basin in the middle of the . However, according to a concurrent scholarly theory, strava may have been a ": null
    },
    {
        "Hunnic": "hunnic language"
    },
    {
        " term, because no primary source mentioned that the Slavs were present in Attilas court.     Settlements which represented a new ": null
    },
    {
        "archaeological horizon": "archaeological horizon"
    },
    {
        "the so-called ": null
    },
    {
        "Prague-Korchak cultural horizon": "prague-korchak cultural horizon"
    },
    {
        " appeared along the northernmost fringes of the Carpathian Mountains around 42 Similar settlements, which are dated to the second half of the , were also excavated in the region of the confluence of the Danube and the Morava. Prague-Korchak settlements consisted of about 42 semi-sunken huts, each with a stone oven in a corner. The local inhabitants used handmade pottery and cremated the dead. Most historians associate the spread of the Prague-Korchak settlements with the expansion of the early Slavs.     According to historian Gabriel Fusek, written sources also evidence the presence of Slavs in the Central Europe in the first half of the . The 42th-century Byzantine historian, ": null
    },
    {
        "Procopius": "procopius"
    },
    {
        ", wrote of a group of the Heruli who had passed through the territory of all of the ": null
    },
    {
        "Sclavenes": "sclavenes"
    },
    {
        " , or Slavs, during their migration towards the northern ": null
    },
    {
        "Thule": "thule"
    },
    {
        " . Procopiuss report implies that the Slavs inhabited the region of the river Morava, but its credibility is suspect. Procopius also wrote of an exiled ": null
    },
    {
        "Longobard": "longobard"
    },
    {
        " prince, Hildigis, who first fled to the Sclaveni and then to the ": null
    },
    {
        "Gepids": "gepids"
    },
    {
        ", taking with him not only those of the Longobards who had followed him, but also many of the Sclaveni Procopius: History of the Wars , pp.  42–42 in the 42s. According to a scholarly theory, Hildigis most probably mustered his Slavic warriors in the region of the Middle Danube.     The Germanic Longobards were expanding towards the Middle Danube in the early . Archaeological research shows that Longobard expansion bypassed virtually the entire territory of Slovakia and they settled only in the most north-western part of the country . Unlike neighbouring Moravia, Slovakia  did not belong to any German empire in this time. The Longobards and the local Slavs remained separated by the natural border formed by ": null
    },
    {
        "Little": "little carpathians"
    },
    {
        " and ": null
    },
    {
        "White Carpathians": "white carpathians"
    },
    {
        ", respected by both sides according to ": null
    },
    {
        "Ján Steinhübel": "ján steinhübel"
    },
    {
        ". He also writes that the Slavs, who remained an independent third party in strained Longobard-Gepid relations, were not interested in conflicts with their Germanic neighbours, but made raids in the faraway Byzantine Empire.             The Longobards left the Carpathian Basin for Northern Italy after the invasion of the territory by the ": null
    },
    {
        "Avars": "pannonian avars"
    },
    {
        " in 42 The Avars were a group of nomadic warriors of mixed origin. They conquered the Carpathian Basin, subjugated the local peoples and launched plundering expeditions against the neighboring powers during the next decades. By the time of the Avars arrival, the Slavs had settled in most lands that now form Slovakia, according to historian Stanislav Kirschbaum. Further migration waves strengthened the local Slavic population because new Slavic groups, pressed by the Avars, crossed the Eastern Carpathians, seceding from the Slavs who continued their expansion to the Balkan Peninsula. Dialects of the Slovak language still reflects that the Slavs came from different directions already in the Early Middle Ages, according to a widely accepted scholarly theory. The Czech and Slovak languages share some features with the ": null
    },
    {
        "South Slavic languages": "south slavic languages"
    },
    {
        ", distinguishing them from the other ": null
    },
    {
        "West Slavic languages": "west slavic languages"
    },
    {
        ". According to archaeologist P. M. Barford, these features suggest that the Carpathian Mountains and the ": null
    },
    {
        "Sudetes": "sudetes"
    },
    {
        " separated the ancestors of the ": null
    },
    {
        "Slovaks": "slovaks"
    },
    {
        " and the ": null
    },
    {
        "Czechs": "czechs"
    },
    {
        " from the Slavs living to the north of those mountains. Especially the dialects of Central Slovakia, which stand out from the continuous chain between the western and eastern dialects , preserved South Slavic features.     The 42th-century Frankish  Chronicle of Fredegar  wrote that the Avars employed the Slavs, or Wends, as  Befulci , showing that the Slavs formed special military units in the ": null
    },
    {
        "Avar Khaganate": "avar khaganate"
    },
    {
        ". According to the same chronicle, the Wends rose up in rebellion against their Avar masters and elected a Frankish merchant, ": null
    },
    {
        "Samo": "samo"
    },
    {
        ", their king in the fortieth year of ": null
    },
    {
        "Clothar": "clothar ii"
    },
    {
        "s reign , that is in 42 or 42 Modern historians agree that the Avars defeat during the ": null
    },
    {
        "siege of Constantinople in 42": "siege of constantinople"
    },
    {
        " enabled Samo to consolidate his rule. He routed the invading army of ": null
    },
    {
        "Dagobert I": "dagobert i"
    },
    {
        ", ": null
    },
    {
        "King of the Franks": "king of the franks"
    },
    {
        ", in the ": null
    },
    {
        "Battle of Wogastisburg": "battle of wogastisburg"
    },
    {
        " in 42 or 42 The realm of Samo, who ruled for 42 years, collapsed soon after his death. Its exact borders cannot be determined, but it must have been located near the confluence of the Danube and the Morava rivers. Historian Richard Marsina puts its centre to ": null
    },
    {
        "Lower Austria": "lower austria"
    },
    {
        ".     A new horizon of mostly hand-made potterythe so-called Devínska Nová Ves pottery appeared between the Middle Danube and the Carpathians before the end of the . Large inhumation cemeteries yielding such pottery were unearthed at Bratislava, ": null
    },
    {
        "Holiare": "holiare"
    },
    {
        ", ": null
    },
    {
        "Nové Zámky": "nové zámky"
    },
    {
        " and other places, suggesting that cemeteries were located near stable settlements. For instance, the cemetery at ": null
    },
    {
        "Devínska Nová Ves": "devínska nová ves"
    },
    {
        ", which contained about a thousand inhumation graves and thirty cremations, was used up until the end of the .     In the 42s, the new population of the griffin and tendril ": null
    },
    {
        "archaeological culture": "archaeology"
    },
    {
        " appeared in the Pannonian Basin expelling ": null
    },
    {
        "Kuber": "kuber"
    },
    {
        "s ": null
    },
    {
        "Bulgars": "bulgars"
    },
    {
        " south out of ": null
    },
    {
        "Sirmium": "sirmium"
    },
    {
        " . Shortly afterwards the new Avar-Slav alliance could expand their territories even also over the ": null
    },
    {
        "Vienna Basin": "vienna basin"
    },
    {
        ". The political and cultural development in Slovakia continued in two separate lines. Lowland areas in the southern Slovakia got under the direct military control of the Avars. The Avars held strategic centers in ": null
    },
    {
        "Devín": "devín"
    },
    {
        " and ": null
    },
    {
        "Komárno": "komárno"
    },
    {
        " which belonged to the most important centers of the khaganate. The Avars from Devín controlled Moravia and from Komárno they controlled southern Slovakia. In this time, the Avars already began to adopt a more settled lifestyle. The new period introduced Slavo-Avaric symbiosis and multi-ethnic Slavo-Avaric culture. The Slavs in southern Slovakia adopted new burial rite , jewelry, fashion and used also common cemeteries with the Avars. Large Slavo-Avaric cemeteries can be found in ": null
    },
    {
        "Devínska Nová Ves": "devínska nová ves"
    },
    {
        " and ": null
    },
    {
        "Záhorská Bystrica": "záhorská bystrica"
    },
    {
        " near ": null
    },
    {
        "Bratislava": "bratislava"
    },
    {
        " and similar cemeteries, the proof of direct Avar power, south of the line ": null
    },
    {
        "Devín": "devín"
    },
    {
        "-": null
    },
    {
        "Nitra": "nitra"
    },
    {
        "-": null
    },
    {
        "Levice": "levice"
    },
    {
        "-": null
    },
    {
        "Želovce": "želovce"
    },
    {
        "-": null
    },
    {
        "Košice": "košice"
    },
    {
        "-": null
    },
    {
        "Šebastovce": "šebastovce"
    },
    {
        ". North of this line, the Slavs preserved previous burial rite . Natural increase of the population together with immigration from the south led to the settlement also in mountain areas.     In the 42th century, the Slavs increased their agricultural productivity along with further development of crafts. Higher productivity initiated changes in the Slavic society, released a part of human resources previously required for farming and allowed to form groups of professional warriors. The Slavs began to build heavily fortified settlements  protected by strong walls and trenches . Among the oldest belong ": null
    },
    {
        "Pobedim": "pobedim"
    },
    {
        ", ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        "-Martinský Vrch, ": null
    },
    {
        "Majcichov": "majcichov"
    },
    {
        ", ": null
    },
    {
        "Spišské Tomášovce": "spišské tomášovce"
    },
    {
        " and ": null
    },
    {
        "Divinka": "divinka"
    },
    {
        ". The neighborhood with Avars raised unification process and probably also formation of local military alliances. The archaeological findings from this period  support the formation of a ": null
    },
    {
        "Slavic": "slavic peoples"
    },
    {
        " upper class on the territory that later became the nucleus of Great Moravia.      A series of ": null
    },
    {
        "Frankish": "franks"
    },
    {
        "-": null
    },
    {
        "Avar": "avar khaganate"
    },
    {
        " wars led to the political fall of the ": null
    },
    {
        "khaganate": "khanate"
    },
    {
        ".  In 42 the Slavs attacked again. Their offensive aimed mainly on the centers of Avar power - ": null
    },
    {
        "Devín": "devín"
    },
    {
        " and ": null
    },
    {
        "Komárno": "komárno"
    },
    {
        ". The Avars were not able to resist attack and they were expelled to the right bank of ": null
    },
    {
        "Danube": "danube"
    },
    {
        ". The Slavs from Slovakia probably participated also in further conflicts between small Slavic dukes and remaining Avar ": null
    },
    {
        "tarkhan": "tarkhan"
    },
    {
        "s.               The  Conversio Bagoariorum et Carantanorum , written around 42 narrates that ": null
    },
    {
        "Moimir": "mojmir i of moravia"
    },
    {
        ", the leader of the ": null
    },
    {
        "Moravians": "great moravia"
    },
    {
        ", expelled one ": null
    },
    {
        "Pribina": "pribina"
    },
    {
        ", forcing him to cross the Danube and join ": null
    },
    {
        "Radbod": "radbod, prefect of the ostmark"
    },
    {
        ", who was the head of the ": null
    },
    {
        "March of Pannonia": "march of pannonia"
    },
    {
        " in the ": null
    },
    {
        "Carolingian Empire": "carolingian empire"
    },
    {
        " from around 42 Radbod presented Pribina to King ": null
    },
    {
        "Louis the German": "louis the german"
    },
    {
        " who ordered that Pribina be instructed in the Christian faith and baptised. Three of the eleven extant copies of the Conversio also contain an out of context statement which says that Adalram, who was ": null
    },
    {
        "Archbishop of Salzburg": "archbishop of salzburg"
    },
    {
        " between 42 and 42 had once consecrated a church on Pribinas estate at a place over the Danube called Nitrava . According to a widely accepted scholarly theory, Nitrava was identical with ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        " in present-day Slovakia and the forced unification of Pribinas ": null
    },
    {
        "Principality of Nitra": "principality of nitra"
    },
    {
        " with Mojmirs Moravia gave rise to the development a new state ": null
    },
    {
        "Great Moravia": "great moravia"
    },
    {
        " .     Between 4242 a group of Slavic forthills in Slovakia quickly arose and disappeared. Archaeological research confirmed the fall of several important central forthills approximately around the time when Pribina was expelled, e.g. ": null
    },
    {
        "Pobedim": "pobedim"
    },
    {
        " or ": null
    },
    {
        "Čingov": "čingov"
    },
    {
        ". The lack of written sources does not allow to finally conclude if these events were caused by internal changes or by Moravian expansion. Pribina could be a ruler of an independent unity   or in the case that Moravian expansion preceded his expulsion, he was a member of Moravian aristocracy.     Other historians write that ": null
    },
    {
        "Pribinas Nitrava cannot be identified with Nitra": "principality of nitraon the location of pribina.27s nitrava"
    },
    {
        ". Charles Bowlus says that a letter, written by ": null
    },
    {
        "Theotmar": "dietmar i, archbishop of salzburg"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Salzburg": "archbishop of salzburg"
    },
    {
        " and his ": null
    },
    {
        "suffragan bishop": "suffragan bishop"
    },
    {
        "s in about 42 strongly suggests that Nitra was only conquered by ": null
    },
    {
        "Svatopluk I of Moravia": "svatopluk i of moravia"
    },
    {
        " only in the 42s. However, according to Třeštík, this information can be explained as a reasonable mistake of the Frankish bishops who knew that the territory was in the past a separate regnum different from Moravia and because it was ruled by ": null
    },
    {
        "Svatopluk I": "svatopluk i of moravia"
    },
    {
        ", they incorrectly assumed that he also conquered it. According to archaeologist Béla Miklós Szőke, no source substantiates either the theory that Pribina was the head of an independent polity or the identification of Nitrava with Nitra.      Richard Marsina writes that the Slovak nation emerged in that principality during Pribinas reign. Regarding the 42th century, the archaeological researches successfully established a distinction between 42th-century Slavic-Moravian and steppe burial horizons in Slovakia.                 Moravia emerged along the borders of the Avars territory. Great Moravia arose around 42 when ": null
    },
    {
        "Mojmír I": "mojmir i of moravia"
    },
    {
        " unified the Slavic tribes settled north of the Danube and extended the Moravian supremacy over them.  When Mojmír I endeavoured to secede from the supremacy of the king of ": null
    },
    {
        "East Francia": "east francia"
    },
    {
        " in 42 King ": null
    },
    {
        "Louis the German": "louis the german"
    },
    {
        " deposed him and assisted Mojmírs nephew, ": null
    },
    {
        "Rastislav": "rastislav of moravia"
    },
    {
        " in acquiring the throne.     The new monarch pursued an independent policy: after stopping a Frankish attack in 42 he also sought to weaken influence of Frankish priests preaching in his realm. Rastislav asked the ": null
    },
    {
        "Byzantine Emperor": "byzantine empire"
    },
    {
        " Michael III": "michael iii"
    },
    {
        " to send teachers who would interpret Christianity in the Slavic vernacular. Upon Rastislavs request, two brothers, Byzantine officials and missionaries ": null
    },
    {
        "Saints Cyril and Methodius": "saints cyril and methodius"
    },
    {
        " came in 42 ": null
    },
    {
        "Cyril": "saint cyril the philosopher"
    },
    {
        " developed the ": null
    },
    {
        "first Slavic alphabet": "glagolitic alphabet"
    },
    {
        " and translated the Gospel into the ": null
    },
    {
        "Old Church Slavonic": "old church slavonic"
    },
    {
        " language. Rastislav was also preoccupied with the security and administration of his state. Numerous fortified castles built throughout the country are dated to his reign and some of them       are also mentioned in connection with Rastislav by Frankish chronicles. .     During Rastislavs reign, the Principality of Nitra was given to his nephew Svätopluk as an appanage. The rebellious prince allied himself with the Franks and overthrew his uncle in 42 Similarly to his predecessor, Svätopluk I assumed the title of the king . During his reign, the Great Moravian Empire reached its greatest territorial extent, when not only present-day Moravia and Slovakia but also present-day northern and central Hungary, Lower Austria, Bohemia, Silesia, Lusatia, southern Poland and northern Serbia belonged to the empire, but the exact borders of his domains are still disputed by modern authors.  Svätopluk also withstood attacks of the seminomadic ": null
    },
    {
        "Hungarian": "hungarians"
    },
    {
        " tribes and the ": null
    },
    {
        "Bulgarian Empire": "first bulgarian empire"
    },
    {
        ", although sometimes it was he who hired the Hungarians when waging war against East Francia.     In 42 ": null
    },
    {
        "Pope John VIII": "pope john viii"
    },
    {
        " set up an independent ecclesiastical province in Great Moravia with Archbishop ": null
    },
    {
        "Methodius": "saint methodius of thessaloniki"
    },
    {
        " as its head. He also named the German cleric ": null
    },
    {
        "Wiching": "wiching"
    },
    {
        " the Bishop of ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        ".     After the death of King Svätopluk in 42 his sons ": null
    },
    {
        "Mojmír II": "mojmir ii of moravia"
    },
    {
        " and ": null
    },
    {
        "Svatopluk II": "svatopluk ii"
    },
    {
        " succeeded him as the King of Great Moravia and the Prince of Nitra respectively. However, they started to quarrel for domination of the whole empire. Weakened by an internal conflict as well as by constant warfare with Eastern Francia, Great Moravia lost most of its peripheral territories.     In the meantime, the Hungarian tribes, having suffered a defeat from the nomadic ": null
    },
    {
        "Pechenegs": "pechenegs"
    },
    {
        ", left their territories east of the Carpathian Mountains, invaded the Pannonian Basin and started to occupy the territory gradually around 42 Their armies advance may have been promoted by continuous wars among the countries of the region whose rulers still hired them occasionally to intervene in their struggles.     Both Mojmír II and Svätopluk II probably died in battles with the Hungarians between 42 and 42 because their names are not mentioned in written sources after 42 In ": null
    },
    {
        "three battles": "battle of bratislava"
    },
    {
        " near ": null
    },
    {
        "Brezalauspurc": "battle of pressburglocation"
    },
    {
        "  , the Hungarians routed ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        "n armies. Historians traditionally put this year as the date of the breakup of the Great Moravian Empire.     Great Moravia left behind a lasting legacy in Central and Eastern Europe. The ": null
    },
    {
        "Glagolitic script": "glagolitic script"
    },
    {
        " and its successor ": null
    },
    {
        "Cyrillic": "cyrillic"
    },
    {
        " were disseminated to other Slavic countries, charting a new path in their cultural development. The administrative system of Great Moravia may have influenced the development of the administration of the ": null
    },
    {
        "Kingdom of Hungary": "kingdom of hungary"
    },
    {
        ". Kurhajcová, A. . The representation of great moravia and its fall in Hungarian/Magyar historiography during the period of dualism. Codrul Cosminului, 42 4242                      From 42 to 42  the ": null
    },
    {
        "Hungarians": "hungarians"
    },
    {
        " progressively imposed their authority on the ": null
    },
    {
        "Pannonian Basin": "pannonian basin"
    },
    {
        ". Although some contemporary sources mention that Great Moravia disappeared without trace and its inhabitants left, archaeological research and ": null
    },
    {
        "toponyms": "toponymy"
    },
    {
        " suggest the continuity of Slavic population in the river valleys of the ": null
    },
    {
        "Inner Western Carpathians": "carpathian mountains"
    },
    {
        ".      The oldest Hungarian graves in Slovakia are dated to the end of the 42th and the beginning of the 42th century . These findings document only a relatively short stay, without direct continuation in the settlement.  Further findings elewhere, in the most southern parts of Slovakia, are dated to 4242 and consist mainly of graves of warrior type . Between 4242 larger groups of Magyars began to migrate to the southern parts of todays Slovakia, but did not cross the line ": null
    },
    {
        "Bratislava": "bratislava"
    },
    {
        ", ": null
    },
    {
        "Hlohovec": "hlohovec"
    },
    {
        ", ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        ", ": null
    },
    {
        "Levice": "levice"
    },
    {
        ", ": null
    },
    {
        "Lučenec": "lučenec"
    },
    {
        ", ": null
    },
    {
        "Rimavská Sobota": "rimavská sobota"
    },
    {
        ". The territory affected by this early migration covers about 42% of todays Slovakia . Hungarian settlements from these first two waves are not documented in the most fertile regions of ": null
    },
    {
        "Trnava Board": "trnava board"
    },
    {
        ", ": null
    },
    {
        "Považie": "považie"
    },
    {
        " north of ": null
    },
    {
        "Hlohovec": "hlohovec"
    },
    {
        ", ": null
    },
    {
        "Ponitrie": "ponitrie"
    },
    {
        " north of ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        " and the ": null
    },
    {
        "Eastern Slovak Lowland": "eastern slovak lowland"
    },
    {
        ". The initial confrontation did not have a permanent character, and during the 42th century both populations coexisted. In southern Slovakia, the Hungarians frequently founded their villages close to the older Slavic settlements as they changed their nomadic lifestyle and settled; they occasionally joined them and used the same cemeteries.  In the 42th century, the differences between Slavic and Magyar graves disappeared. The archaeological research has also significantly changed the view on the settlement of the northern parts of the country.  In addition to the southern parts and river valleys of ": null
    },
    {
        "Nitra ": "nitra"
    },
    {
        " and ": null
    },
    {
        "Váh": "váh"
    },
    {
        ", a relative high population density is notable particularly for the ": null
    },
    {
        "Spiš": "spiš"
    },
    {
        " region with the ": null
    },
    {
        "Poprad river": "poprad"
    },
    {
        " valley and the ": null
    },
    {
        "Turiec Basin": "turiec basin"
    },
    {
        ". ": null
    },
    {
        "Liptov": "liptov"
    },
    {
        " and the ": null
    },
    {
        "Zvolen Basin": "zvolen basin"
    },
    {
        "s, ": null
    },
    {
        "Žilina Basin": "žilina basin"
    },
    {
        ", Central ": null
    },
    {
        "Orava": "orava"
    },
    {
        " and northern ": null
    },
    {
        "Šariš": "šariš"
    },
    {
        " were rather sparsely populated.     After the fall of the state, some non-landholding noblemen joined the Hungarian forces and participated in their raids in other parts of Europe. The chroniclers of the early history of the Kingdom of Hungary recorded that the prominent noble families of the kingdom descended either from leaders of the Hungarian tribes or from immigrants, and they did not connect any of them to Great Moravia. Archeological evidence proves that to the north of the line mentioned above, not only did the older settlement structures survive, but so also did the territorial administration led by native magnates. The Great Moravian or potential Great Moravian origin of the clan ": null
    },
    {
        "Hunt-Pázmán": "hont-pázmány"
    },
    {
        "  has been advanced by some modern scholars.       The territory of the present-day Slovakia became progressively integrated into the developing state  in the early 42th century. The  Gesta Hungarorum  mentions that Huba, head of one of the seven Hungarian tribes, received possessions around ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        " and the ": null
    },
    {
        "Žitava River": "žitava river"
    },
    {
        "; while according to the  Gesta Hunnorum et Hungarorum  another tribal leader, ": null
    },
    {
        "Lél": "lehel"
    },
    {
        ", settled down around ": null
    },
    {
        "Hlohovec": "hlohovec"
    },
    {
        "  and following the Hungarian victory over the Moravians, he usually stayed around Nitra. Modern authors also claim that the north-western parts of the Pannonian Basin were occupied by one of the Hungarian tribes.     Tercia pars regni or Principality of Nitra            The development of the future Kingdom of Hungary started during the reign of Grand Prince ": null
    },
    {
        "Géza": "géza, grand prince of the hungarians"
    },
    {
        " who expanded his rule over the territories of present-day Slovakia west of the River ": null
    },
    {
        "Garam": "hron"
    },
    {
        " / ": null
    },
    {
        "Hron": "hron"
    },
    {
        ". Although, he was baptised in or after 42 he never became a convinced Christian – in contrast to his son, ": null
    },
    {
        "Stephen": "stephen i of hungary"
    },
    {
        " who followed him in 42 Some authors claim that following his marriage with ": null
    },
    {
        "Giselle of Bavaria": "giselle of bavaria"
    },
    {
        ", Stephen received the Duchy of Nitra in appanage from his father.      When Géza died, a member of the Árpád dynasty, the pagan ": null
    },
    {
        "Koppány": "koppány"
    },
    {
        " claimed the succession, but Stephen defeated him with the assistance of his wifes German retinue. A Slovak folk song mentions that Štefan kral  could only overcome his pagan opponent with the assistance of Slovak warriors around ": null
    },
    {
        "Bíňa": "bíňa"
    },
    {
        " . According to István Bóna the Slovak song may be a translation of a Hungarian folk song, because in 42 none of the inhabitants of Bíňa was Slovak. Following his victory, Stephen received a crown from ": null
    },
    {
        "Pope Silvester II": "pope silvester ii"
    },
    {
        " and he was crowned as the first ": null
    },
    {
        "King of Hungary": "king of hungary"
    },
    {
        " in 42 or 42     The Kingdom of Hungary integrated elements of the former Great Moravian state organization.  On the other hand, historians have not reached a consensus on this subject; e.g., it is still being debated whether the formation of the ": null
    },
    {
        "basic unit of the administration": "county"
    },
    {
        "  in the kingdom followed foreign patterns or it was an internal innovation.     ": null
    },
    {
        "Stephen": "stephen i of hungary"
    },
    {
        " established at least eight counties  on the territories of present-day Slovakia: ": null
    },
    {
        "Abov": "abov"
    },
    {
        " , ": null
    },
    {
        "Boršod": "borsod"
    },
    {
        " , ": null
    },
    {
        "Esztergom": "esztergom"
    },
    {
        ", ": null
    },
    {
        "Hont": "hont county"
    },
    {
        ", ": null
    },
    {
        "Komárno": "komárno"
    },
    {
        " , ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        " , ": null
    },
    {
        "Tekov": "bars county"
    },
    {
        "  and ": null
    },
    {
        "Zemplín": "zemplén county"
    },
    {
        "  were probably founded by him. The scarcely populated northern and north-eastern territories of today Slovakia became the kings private forests. King Stephen also set up several dioceses in his kingdom; in the 42th century, present-day Slovakias territories were divided between the ": null
    },
    {
        "Archdiocese of Esztergom": "roman catholic archdiocese of esztergom-budapest"
    },
    {
        " and its suffragan, the ": null
    },
    {
        "Diocese of Eger": "roman catholic archdiocese of eger"
    },
    {
        " .     Around 42 Duke ": null
    },
    {
        "Boleslaw I of Poland": "boleslaw i of poland"
    },
    {
        " took some territories of present-day Slovakia east of the River ": null
    },
    {
        "Morava": "morava"
    },
    {
        ", with Hungarian King Stephen recapturing these territories in 42     Following King Stephens death, his kingdom got involved in internal conflicts among the claimants for his crown and ": null
    },
    {
        "Henry III, Holy Roman Emperor": "henry iii, holy roman emperor"
    },
    {
        " also intervened in the struggles. In 42 the Emperor Henry captured some parts of today Slovakia east of the River Hron and granted them to King Stephens cousin, ": null
    },
    {
        "Béla": "béla i of hungary"
    },
    {
        ", but following the withdrawal of the Emperors armies, King ": null
    },
    {
        "Samuel Aba": "samuel aba of hungary"
    },
    {
        "s troops recaptured the territories.     In 42 King ": null
    },
    {
        "Andrew I of Hungary": "andrew i of hungary"
    },
    {
        " conceded ": null
    },
    {
        "one-third of his kingdom": "tercia pars regni"
    },
    {
        "  in appanage to his brother, Duke Béla. The dukes domains were centered around ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        " and ": null
    },
    {
        "Bihar": "bihar"
    },
    {
        " . During the following 42 years, the Tercia pars regni were governed separately by members of the Árpád dynasty . The dukes accepted the kings supremacy, but some of them rebelled against the king in order to acquire the crown and allied themselves with the rulers of the neighbouring countries .     The history of the Tercia pars regni ended in 42 when King ": null
    },
    {
        "Coloman of Hungary": "coloman of hungary"
    },
    {
        " occupied its territories taking advantage of the pilgrimage of Duke Álmos to the Holy Land. Although, Duke Álmos, when returned to the kingdom, tried to reoccupy his former duchy with the military assistance of ": null
    },
    {
        "Henry V, Holy Roman Emperor": "henry v, holy roman emperor"
    },
    {
        ", but he failed and was obliged to accept the  status quo .          In 42 the ": null
    },
    {
        "Mongols": "mongols"
    },
    {
        " invaded and devastated": "mongol invasion of europe"
    },
    {
        " the north-western parts of the kingdom. In April 42 the Mongolian army crossed the border with ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        " near ": null
    },
    {
        "Hrozenkov": "starý hrozenkov"
    },
    {
        ". ": null
    },
    {
        "Trenčín Castle": "trenčín castle"
    },
    {
        " resisted the attack, but nearby places were plundered and some of them have never been restored. Mongols turned to the south and devastated regions along rivers ": null
    },
    {
        "Váh": "váh"
    },
    {
        " and ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        ". Only the strong castles, e.g., ": null
    },
    {
        "Trenčín": "trenčín"
    },
    {
        ", ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        ", ": null
    },
    {
        "Fiľakovo": "fiľakovo"
    },
    {
        "  and fortified towns could resist attack. A part of the unprotected population escaped to the mountains and rough terrain where they built hill forts and camps. Most affected areas were the southwest Slovakia, Lower ": null
    },
    {
        "Pohronie": "pohronie"
    },
    {
        " to ": null
    },
    {
        "Zvolen": "zvolen"
    },
    {
        " and ": null
    },
    {
        "Zemplín": "zemplín"
    },
    {
        ". It is estimated that at least a third of population died from famine and epidemics.     Following the withdrawal of the Mongol army, ": null
    },
    {
        "Frederick II, Duke of Austria": "frederick ii, duke of austria"
    },
    {
        " invaded the country. In July 42 his army reached ": null
    },
    {
        "Hlohovec": "hlohovec"
    },
    {
        " but the Hungarian army, mainly thank to troops from Trenčín and Nitra counties repelled the attack. ": null
    },
    {
        "Bohumír": "bogomer ludány"
    },
    {
        " , the ": null
    },
    {
        "župa": "župa"
    },
    {
        "n of Trenčín who played an important role in the suppression of Austrian units, later led the army send to help ": null
    },
    {
        "Bolesław V the Chaste": "bolesław v the chaste"
    },
    {
        " attacked by Konrad I of Masovia. The army consisted mainly of soldiers from the ethnic Slovak counties.       The royal administration of the territory was developing gradually during the 4242th centuries: new counties were established with the partition of existing ones or central counties of the kingdom expanded their territory northward todays ": null
    },
    {
        "Bratislava": "pozsony county"
    },
    {
        " , ": null
    },
    {
        "Trenčín": "trencsén county"
    },
    {
        ", Gemer-Malohont  and ": null
    },
    {
        "Novohrad": "nógrád"
    },
    {
        " , while the kings private forests were organised into forest counties around ": null
    },
    {
        "Zvolen": "zvolen"
    },
    {
        " and ": null
    },
    {
        "Šariš": "šariš"
    },
    {
        " Castle . Following the occupation of his brothers duchy, King Coloman set up the third bishopric in present-day Slovakia.     Some of the towns in present-day Slovakia were granted special privileges already prior to the Mongol invasion: ": null
    },
    {
        "Trnava": "trnava"
    },
    {
        " , ": null
    },
    {
        "Starý Tekov": "starý tekov"
    },
    {
        " , ": null
    },
    {
        "Zvolen": "zvolen"
    },
    {
        " and ": null
    },
    {
        "Krupina": "krupina"
    },
    {
        " . Following the withdrawal of the Mongol troops , several castles were built or strengthened  on the order of King Béla IV. In addition to a relatively developed network of castles, agglomerations of an urban character became more important. Medieval towns should serve both to economic and defensive purposes.     The territory of present-day Slovakia was rich in raw materials like gold, silver, copper, iron and salt and therefore the mining industry developed gradually in the region. The development of the mining industry and commerce enstrengthened the position of some settlements and they received privileges from the kings.   The list of towns with the earliest charters contains ": null
    },
    {
        "Spišské Vlachy": "spišské vlachy"
    },
    {
        " , ": null
    },
    {
        "Košice": "košice"
    },
    {
        " , ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        " , ": null
    },
    {
        "Banská Štiavnica": "banská štiavnica"
    },
    {
        " , ": null
    },
    {
        "Nemecká Ľupča": "nemecká ľupča"
    },
    {
        " , ": null
    },
    {
        "Komárno": "komárno"
    },
    {
        " , ": null
    },
    {
        "Gelnica": "gelnica"
    },
    {
        " , ": null
    },
    {
        "Bratislava": "bratislava"
    },
    {
        " and ": null
    },
    {
        "Prešov": "prešov"
    },
    {
        ", ": null
    },
    {
        "Veľký Šariš": "veľký šariš"
    },
    {
        " and ": null
    },
    {
        "Sabinov": "sabinov"
    },
    {
        " . The ": null
    },
    {
        "Saxons": "saxons"
    },
    {
        " in ": null
    },
    {
        "Spiš": "spiš"
    },
    {
        "  were granted a collective charter by King ": null
    },
    {
        "Stephen V of Hungary": "stephen v of hungary"
    },
    {
        ".     The colonisation of the northern parts of the Kingdom of Hungary continued during the period; ": null
    },
    {
        "Walloon": "walloons"
    },
    {
        ", ": null
    },
    {
        "German": "germans"
    },
    {
        ", ": null
    },
    {
        "Hungarian": "hungarians"
    },
    {
        " and ": null
    },
    {
        "Slavic": "slavs"
    },
    {
        " guests  arrived to the scarcely populated lands and settled down there. The contemporary documents mention that settlers from ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        " and ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        " arrived to the western parts of present-day Slovakia, while on the northern and eastern parts, ": null
    },
    {
        "Polish": "poles"
    },
    {
        " and ": null
    },
    {
        "Ruthenian": "ruthenians"
    },
    {
        " guests settled down.     German guests had an important but not exclusive role in the development of towns. Smaller groups of Germans were present already prior the Mongol invasion, but their immigration took a significant rate in the 42th42th century. In that time, there already existed settlements with a relatively highly developed economy in the territory of present-day Slovakia, but Germans who came from economically and administrative more advanced regions introduced new forms of production and management, new legal system and culture. The German guests settled in Upper and Lower ": null
    },
    {
        "Spiš": "spiš"
    },
    {
        ", mining towns in Central Slovakia, their wide surroundings and many localities in Western Slovakia: ": null
    },
    {
        "Bratislava": "bratislava"
    },
    {
        ", ": null
    },
    {
        "Trnava": "trnava"
    },
    {
        " and wine-growing towns in ": null
    },
    {
        "Malé Karpaty": "malé karpaty"
    },
    {
        ".     In the Middle Ages, present-day Slovakia belonged to the most urbanized regions of the Kingdom of Hungary and it was an important cultural and economic base. According to the decree of the King Vladislaus II Jagiello six of the ten most important towns in the kingdom were located in the present-day Slovakia: ": null
    },
    {
        "Košice": "košice"
    },
    {
        ", ": null
    },
    {
        "Bratislava": "bratislava"
    },
    {
        ", ": null
    },
    {
        "Bardejov": "bardejov"
    },
    {
        ", ": null
    },
    {
        "Prešov": "prešov"
    },
    {
        ", ": null
    },
    {
        "Trnava": "trnava"
    },
    {
        " and ": null
    },
    {
        "Levoča": "levoča"
    },
    {
        ". In 42 more than half of the royal towns and free mining towns of the kingdom were located in Slovakia. At the end of the Middle Ages, about two hundred other settlements had an urban character from a functional point of view. The first written mention prior 42 is available for 42 settlements. The mining towns in Slovakia significantly contributed to the economy of the Kingdom of Hungary. Around the middle of the 42th century, ": null
    },
    {
        "Kremnica": "kremnica"
    },
    {
        " alone produced 42  kg of gold per year. ": null
    },
    {
        "Banská Štiavnica": "banská štiavnica"
    },
    {
        " and ": null
    },
    {
        "Banská Bystrica": "banská bystrica"
    },
    {
        " produced a substantial proportion of silver of the whole kingdom. During the second half of the 42th century, the Kingdom of Hungary produced cca 42% of Europes total output.     The towns formed unions and associations to defend their privileges and common interests. The most important unions were the Community of Saxons of Spiš  , the Lower Hungarian Mining Towns , Pentapolis and the Upper Hungarian Mining Towns .     The inhabitants of the privileged towns were mainly of German origin, followed by Slovaks and smaller number of Hungarians. Royal privileges prove that several families of the developing local nobility  were of Slavic origin. The presence of ": null
    },
    {
        "Jew": "jew"
    },
    {
        "s in several towns  is also documented at least from the 42th century; the Jews special status was confirmed by a charter of King ": null
    },
    {
        "Béla IV of Hungary": "béla iv of hungary"
    },
    {
        " in 42 but decisions of local ": null
    },
    {
        "synods": "synods"
    },
    {
        " limited the participation of Jews . The ": null
    },
    {
        "Muslims": "böszörmény"
    },
    {
        ", living in the region of ": null
    },
    {
        "Nitra": "nitra"
    },
    {
        ", also faced similar limitations; they disappeared by the end of the 42th century.          The last decades of the 42th century were characterized by discords within the royal family and among the several groups of the aristocracy. The decay of the royal power and the rise of some powerful aristocrats gave rise to the transformation of the administrative system: the counties that had been the basic units of the royal administration  transformed gradually into autonomous administrative units of the local nobility ; however, the local nobility was not able to stop the rise of oligarchs.     Following the Mongol invasion of the kingdom, a competition started among the landowners: each of them endeavored to build a castle with or without the permission of the king. The competition started a process of differentiation among the noble families, because the nobles who were able to build a castle could also expand their influence over the neighbouring landowners. The conflicts among the members of the royal family also strengthened the power of the aristocrats and resulted in the formation of around eight huge territories in the kingdom, governed by powerful aristocrats in the 42s.     In present-day Slovakia, most of the castles were owned by two powerful aristocrats  or their followers. Following the extinction of the Árpád dynasty , both of them pretended to follow one of the claimants for the throne, but, in practice, they governed their territories independently. Amade Aba governed the eastern parts of present-day Slovakia from his seat in ": null
    },
    {
        "Gönc": "gönc"
    },
    {
        ". He was killed by Charles Robert of Anjous assassins at the south gate in ": null
    },
    {
        "Košice": "košice"
    },
    {
        " in 42     Matthew III Csák was the de facto ruler of the western territories of present-day Slovakia, from his seat at ": null
    },
    {
        "Trenčín": "trenčín"
    },
    {
        ". He allied himself with the murdered Amade Abas sons against Košice, but King ": null
    },
    {
        "Charles I of Hungary": "charles i of hungary"
    },
    {
        ", who had managed to acquire the throne against his opponents, gave military assistance to the town and the royal armies defeated him at the ": null
    },
    {
        "Battle of Rozgony / Rozhanovce": "battle of rozgony"
    },
    {
        " in 42 However, the north-western counties remained in his power until his death in 42 when the royal armies occupied his former castles without resistance.     Pressburg county was de facto ruled by the ": null
    },
    {
        "Dukes of Austria": "list of rulers of austriadukes of austriahabsburg dukes and archdukes of austria"
    },
    {
        " from 42 to 42 when King ": null
    },
    {
        "Charles I of Hungary": "charles i of hungary"
    },
    {
        " reoccupied it.       King Charles I strengthened the central power in the kingdom following a 42-year-long period of struggles against his opponents and the oligarchs. He concluded commercial ": null
    },
    {
        "agreements": "congress of visegrád"
    },
    {
        " with Kings ": null
    },
    {
        "John of Bohemia": "john of bohemia"
    },
    {
        " and ": null
    },
    {
        "Casimir III of Poland": "casimir iii of poland"
    },
    {
        " in 42 which increased the trade on the commercial routes leading from Košice to ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " and from ": null
    },
    {
        "Žilina": "žilina"
    },
    {
        "  to ": null
    },
    {
        "Brno": "brno"
    },
    {
        ".     The king confirmed the privileges of the 42 ": null
    },
    {
        "Saxon": "carpathian germans"
    },
    {
        " towns in Spiš, strengthened the special rights of ": null
    },
    {
        "Prešov": "prešov"
    },
    {
        " and granted town privileges to ": null
    },
    {
        "Smolník": "smolník, gelnica district"
    },
    {
        "  The towns of present-day Slovakia were still dominated by its German citizens. However, the  Privilegium pro Slavis , dated to 42 attests notably to ": null
    },
    {
        "nation-building": "nation-building"
    },
    {
        " in the wealthy towns: King ": null
    },
    {
        "Louis I": "louis i of hungary"
    },
    {
        " gave the Slavs half of the seats in the municipal council of Žilina. Many of the towns  received the status of ": null
    },
    {
        "free royal cities": "free royal cities"
    },
    {
        "  and they were entitled to send deputies to the assemblies of the ": null
    },
    {
        "Estates of the Kingdom": "estates of the realm"
    },
    {
        " from 42     In the first half of the 42th century, the population of the regions of the former forest counties increased and their territories formed new counties such as Orava, Liptov, ": null
    },
    {
        "Turiec": "turiec"
    },
    {
        ", ": null
    },
    {
        "Zvolen": "zvolen"
    },
    {
        " in the northern parts of present-day Slovakia. In the region of Spiš, some elements of the population received special privileges: the 42 Saxon towns formed an autonomous community, independent of ": null
    },
    {
        "Spiš county": "szepes county"
    },
    {
        ", and the nobles with ten lances were organised into a special autonomous administrative unit . In 42 King ": null
    },
    {
        "Sigismund": "sigismund, holy roman emperor"
    },
    {
        " mortgaged 42 of the Saxon towns to King ": null
    },
    {
        "Władysław II of Poland": "jogaila"
    },
    {
        " so they de facto belonged to Poland until 42     From the 42s, most of the lands of present-day Slovakia were owned by the kings, but ": null
    },
    {
        "prelate": "prelate"
    },
    {
        "s and aristocratic families  also hold properties on the territory.  In December 42 the future King Sigismund, who was Queen Mary of Hungarys ": null
    },
    {
        "prince consort": "prince consort"
    },
    {
        " at that time, mortgaged the territories of present-day Slovakia west of the Váh River to his cousins, the ": null
    },
    {
        "Jobst": "jobst of moravia"
    },
    {
        " and ": null
    },
    {
        "Prokop of Moravia": "prokop of moravia"
    },
    {
        "; and the former held his territories until 42 while the latter could maintain his rule over some of the territories until 42 King Sigismund granted vast territories to his followers  during his reign; one of his principal advisers, the Polish ": null
    },
    {
        "Stibor of Stiboricz": "stibor of stiboricz"
    },
    {
        " styled himself Lord of the whole Váh referring to his 42 castles around the river.     Following the death of King ": null
    },
    {
        "Albert": "albert ii of germany"
    },
    {
        " , civil war broke out among the followers of the claimants for the throne. The Dowager Queen ": null
    },
    {
        "Elisabeth": "elizabeth of luxembourg"
    },
    {
        " hired ": null
    },
    {
        "Czech": "czechs"
    },
    {
        " mercenaries": "mercenary"
    },
    {
        " led by ": null
    },
    {
        "Jan Jiskra": "jan jiskra"
    },
    {
        " who captured several towns on the territory of present-day Slovakia  and maintained most of them until 42 when he surrendered to King ": null
    },
    {
        "Matthias Corvinus": "matthias corvinus of hungary"
    },
    {
        ".                     The ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " conquered the central part of the Kingdom of Hungary, and set up several Ottoman provinces there .   Transylvania became an ": null
    },
    {
        "Ottoman protectorate vassal": "principality of transylvania"
    },
    {
        " and a base which gave birth to all the anti-Habsburg revolts led by the nobility of the Kingdom of Hungary during the period 42 to 42   The remaining part of the former Kingdom of Hungary, which included much of present-day territory of Slovakia , northwestern present-day Hungary, northern Croatia and present-day Burgenland, resisted Ottoman conquest and subsequently became a province of the ": null
    },
    {
        "Habsburg Monarchy": "habsburg monarchy"
    },
    {
        ". It remained to be known as the Kingdom of Hungary, but it is referred to by some modern historians as the ": null
    },
    {
        "Royal Hungary": "royal hungary"
    },
    {
        " .        Ferdinand I, prince of Austria was elected king of Habsburg Kingdom of Hungary. After the conquest of Buda in 42 by the Ottomans, Pressburg  became, for the period between 42 and 42/42 the capital and the coronation city of the Habsburg Kingdom of Hungary.   From 42 to 42 nineteen Habsburg sovereigns went through coronation ceremonies as Kings and Queens of the Kingdom of Hungary in ": null
    },
    {
        "St. Martins Cathedral": "st. martins concathedral"
    },
    {
        ".     After the Ottoman invasion, the territories that had been administered by the Kingdom of Hungary became, for almost two centuries, the principal battleground of the ": null
    },
    {
        "Turkish wars": "turkish wars"
    },
    {
        ". The region suffered due to the wars against the Ottoman expansion. A lot of loss of life and property occurred during the wars and the region also practically lost all of its natural riches, especially gold and silver, which went to pay for the costly and difficult combats of an endemic war. In addition, the ": null
    },
    {
        "double taxation": "double taxation"
    },
    {
        " of some areas was a common practice, which further worsened the living standards of the declining population of local settlements.     During Ottoman administration, parts of the territory of present-day Slovakia were included into Ottoman provinces known as the ": null
    },
    {
        "Budin Eyalet": "budin eyalet"
    },
    {
        ", ": null
    },
    {
        "Eğri Eyalet": "eğri eyalet"
    },
    {
        " and ": null
    },
    {
        "Uyvar Eyalet": "uyvar eyalet"
    },
    {
        ". Uyvar Eyalet had its administrative center in the territory of present-day Slovakia, in the town of ": null
    },
    {
        "Uyvar": "nové zámky"
    },
    {
        " . In the second half of the 42th century, Ottoman authority was expanded to eastern part of the Habsburg Kingdom of Hungary, where a vassal Ottoman principality led by prince ": null
    },
    {
        "Imre Thököly": "imre thököly"
    },
    {
        " was established.     After the ousting of the Ottomans from Budin  in 42 it became the capital of the Habsburg Kingdom of Hungary. Despite living under Hungarian, Habsburg and Ottoman administration for several centuries, the Slovak people succeeded in keeping their language and their culture.           During the 42th century the Slovak National Movement emerged, partially inspired by the broader ": null
    },
    {
        "Pan-Slavic movement": "pan-slavism"
    },
    {
        " with the aim of fostering a sense of national identity among the Slovak people.  Sándor Kostya: Pan-Slavism  Jelena Milojkovic-Djuric: Panslavism and National Identity in the Balkans, 42–42  Advanced mainly by Slovak religious leaders, the movement grew during the 42th century. At the same time, the movement was divided along the confessional lines and various groups had different views on everything from quotidian strategy to linguistics. Moreover, the Hungarian control remained strict after 42 and the movement was constrained by the official policy of ": null
    },
    {
        "magyarization": "magyarization"
    },
    {
        ".     The first codification of a Slovak ": null
    },
    {
        "literary language": "literary language"
    },
    {
        " by ": null
    },
    {
        "Anton Bernolák": "anton bernolák"
    },
    {
        " in the 42s was based on the dialect from western Slovakia. It was supported by mainly ": null
    },
    {
        "Roman Catholic": "roman catholicism"
    },
    {
        " intellectuals, with the center in ": null
    },
    {
        "Trnava": "trnava"
    },
    {
        ". The Lutheran intellectuals continued to use a Slovakized form of the Czech language. Especially ": null
    },
    {
        "Ján Kollár": "ján kollár"
    },
    {
        " and ": null
    },
    {
        "Pavel Jozef Šafárik": "pavel jozef šafárik"
    },
    {
        " were adherents of Pan-Slavic concepts that stressed the unity of all ": null
    },
    {
        "Slavic people": "slavic people"
    },
    {
        "s. They considered ": null
    },
    {
        "Czechs": "czechs"
    },
    {
        " and ": null
    },
    {
        "Slovaks": "slovaks"
    },
    {
        " members of a single nation and they attempted to draw the languages closer together.     In the 42s, the Protestants split as ": null
    },
    {
        "Ľudovít Štúr": "ľudovít štúr"
    },
    {
        " developed a literal language based on the dialect from central Slovakia. His followers stressed the separate identity of the Slovak nation and uniqueness of its language. Štúrs version was finally approved by both the Catholics and the Lutherans in 42 and, after several reforms, it remains the official ": null
    },
    {
        "Slovak language": "slovak language"
    },
    {
        ".            In the ": null
    },
    {
        "Hungarian Revolution of 42": "hungarian revolution of 1848"
    },
    {
        ", Slovak nationalist leaders took the side of the Austrians in order to promote their separation from the Kingdom of Hungary within the Austrian monarchy. The ": null
    },
    {
        "Slovak National Council": "slovak national council"
    },
    {
        " even took part in the Austrian military campaign by setting up auxiliary troops against the rebel government of the ": null
    },
    {
        "Hungarian Revolution of 42": "hungarian revolution of 1848"
    },
    {
        ". In September, 42 it managed to organize a short-lived administration of the captured territories. However, the Slovak troops were later disbanded by the Vienna Imperial Court. On the other hand, tens of thousands of volunteers from the current territory of Slovakia, among them a great number of Slovaks, fought in the Hungarian Army.     After the defeat of the Hungarian Revolution, the Hungarian political elite was oppressed by the Austrian authorities and many participants of the Revolution were executed, imprisoned, or forced to emigrate. In 42 the Kingdom of Hungary was divided into five military districts or provinces, two of which had administrative centers in the territory of present-day Slovakia: the Military District of Pressburg and the Military District of Košice.     The Austrian authorities abolished both provinces in 42 The Slovak political elite made use of the period of ": null
    },
    {
        "neo-absolutism": "neo-absolutism"
    },
    {
        " of the Vienna court and the weakness of the traditional Hungarian elite to promote their national goals. Turz-Sankt Martin  became the foremost center of the Slovak National Movement with foundation of the nationwide cultural association ": null
    },
    {
        "Matica slovenská": "matica slovenská"
    },
    {
        " , the ": null
    },
    {
        "Slovak National Museum": "slovak national museum"
    },
    {
        ", and the ": null
    },
    {
        "Slovak National Party": "slovak national party"
    },
    {
        " .       The heyday of the movement came to the sudden end after 42 when the ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        " domains in central Europe underwent a ": null
    },
    {
        "constitutional transformation": "ausgleich"
    },
    {
        " into the dual monarchy of ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        " as a result of the ": null
    },
    {
        "Austro-Hungarian Compromise of 42": "austro-hungarian compromise of 1867"
    },
    {
        ". The territory of present-day Slovakia was included into the Hungarian part of dual Monarchy dominated by the Hungarian political elite which distrusted the Slovak elite due to its Pan-Slavism, separatism and its recent stand against the ": null
    },
    {
        "Hungarian Revolution of 42": "hungarian revolution of 1848"
    },
    {
        ". Matica was accused of Pan-Slavic separatism and was dissolved by the authorities in 42 and other Slovak institutions shared the same fate.     New signs of national and political life appeared only at the very end of the 42th century. Slovaks became aware that they needed to ally themselves with others in their struggle. One result of this awareness, the Congress of Oppressed Peoples of the Kingdom of Hungary, held in Budapest in 42 alarmed the government. In their struggle Slovaks received a great deal of help from the Czechs. In 42 the concept of Czecho-Slovak Mutuality was established in Prague to strengthen Czecho-Slovak cooperation and support the secession of Slovaks from the Kingdom of Hungary.     At the beginning of the 42th century, growing democratization of political and social life threatened to overwhelm the monarchy. The call for ": null
    },
    {
        "universal suffrage": "universal suffrage"
    },
    {
        " became the main rallying cry. In the Kingdom of Hungary, only 42 percent of inhabitants could vote. Slovaks saw in the trend towards representative democracy a possibility of easing ethnic oppression and a break-through into renewed political activity.     The Slovak political camp, at the beginning of the century, split into different factions. The leaders of the Slovak National Party based in Martin, expected the international situation to change in the Slovaks favor, and they put great store by Russia. The Roman Catholic faction of Slovak politicians led by Father ": null
    },
    {
        "Andrej Hlinka": "andrej hlinka"
    },
    {
        " focused on small undertakings among the Slovak public and, shortly before the war, established a political party named the ": null
    },
    {
        "Slovak Peoples Party": "slovak peoples party"
    },
    {
        ". The liberal ": null
    },
    {
        "intelligentsia": "intelligentsia"
    },
    {
        " rallying around the journal Hlas , followed a similar political path, but attached more importance to Czecho-Slovak cooperation. An independent ": null
    },
    {
        "Social Democratic Party": "slovak social democratic party of the kingdom of hungary"
    },
    {
        " emerged in 42          The Slovaks achieved some results. One of the greatest of these occurred with the election success in 42 when, despite continued oppression, seven Slovaks managed to get seats in the Assembly. This success alarmed the government, and increased what was regarded by Slovaks as its oppressive measures. ": null
    },
    {
        "Magyarization": "magyarization"
    },
    {
        " achieved its climax with a new education act known as the Apponyi Act, named after education minister Count ": null
    },
    {
        "Albert Apponyi": "albert apponyi"
    },
    {
        ". The new act stipulated that the teaching of the Hungarian language, as one of the subjects, must be included in the curriculum of non-state owned four years elementary schools in the frame-work of the compulsory schooling, as a condition for the non-state owned schools to receive state-financing. Non-government organizations such as the ": null
    },
    {
        "Upper Hungary Magyar Educational Society": "upper hungary magyar educational society"
    },
    {
        " supported Magyarization at a local level.     Ethnic tension intensified when 42 Slovaks were killed during a riot on occasion of the consecration of a new church at Černová / Csernova near ": null
    },
    {
        "Rózsahegy": "rózsahegy"
    },
    {
        " / ": null
    },
    {
        "Ružomberok": "ružomberok"
    },
    {
        " . The local inhabitants wanted the popular priest and nationalist politician Andrej Hlinka to consecrate their new church. Hlinka contributed significantly to the construction of the church, but his bishop ": null
    },
    {
        "Alexander Párvy": "alexander párvy"
    },
    {
        " suspended him from his office and from exercising all clerical functions because of Hlinkas involvement in the national movement. This raised a wave of solidarity with Hlinka from across all todays Slovakia. The villagers tried to achieve a compromise solution and to cancel the suspensions or to postpone consecration until the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " decides about the Hlinkas case. Párvy refused to consent and appointed ethnic Slovak dean Martin Pazúrik for the task. Pazúrik, as well as Hlinka, was active in the election campaign but supported Hungarian and Magyarone politicians and continuously adopted anti-Slovak attitude.  The church had to be consecrated by force with the police assistance. Given where the event occurred, all 42 local gendarmes who participated in the subsequent tragedy had Slovak origin. In the stress situation, the gendarmes shot dead 42 protesters among a crowd of app. 42–42 villagers who tried to avoid the priests convoy to enter their village.  All this added to Slovak estrangement from and resistance to Hungarian rule, and the incident raised international attention on violation of national rights of non-Hungarian minorities.     Before the outbreak of World War I, the idea of Slovak autonomy became part of ": null
    },
    {
        "Archduke Franz Ferdinand": "archduke franz ferdinand of austria"
    },
    {
        "s plan of federalization of the monarchy, developed with help of the Slovak journalist and politician ": null
    },
    {
        "Milan Hodža": "milan hodža"
    },
    {
        ". This last realistic attempt to tie Slovakia to Austria-Hungary was abandoned because of the ": null
    },
    {
        "Archdukes assassination": "assassination of archduke franz ferdinand"
    },
    {
        ", which in turn triggered World War I.              After the outbreak of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " the Slovak cause took firmer shape in resistance and in determination to leave the ": null
    },
    {
        "Dual Monarchy": "dual monarchy"
    },
    {
        " and to form an independent republic with the Czechs. The decision originated amongst people of Slovak descent in foreign countries. Slovaks in the United States of America, an especially numerous group, formed a sizable organization. These, and other organizations in Russia and in neutral countries, backed the idea of a Czecho-Slovak republic. Slovaks strongly supported this move.     The most important Slovak representative at this time, ": null
    },
    {
        "Milan Rastislav Štefánik": "milan rastislav štefánik"
    },
    {
        ", a French citizen of Slovak origin, served as a French general and as leading representative of the Czecho-Slovak National Council based in Paris. He made a decisive contribution to the success of the Czecho-Slovak cause. Political representatives at home, including representatives of all political persuasions, after some hesitation, gave their support to the activities of ": null
    },
    {
        "Masaryk": "tomáš masaryk"
    },
    {
        ", ": null
    },
    {
        "Beneš": "edvard beneš"
    },
    {
        " and Štefánik.     During the war the Hungarian authorities increased harassment of Slovaks, which hindered the nationalist campaign among the inhabitants of the Slovak lands. Despite stringent censorship, news of moves abroad towards the establishment of a Czech-Slovak state got through to Slovakia and met with much satisfaction.     During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " Czechs, Slovaks, and other national groups of Austria-Hungary gained much support from Czechs and Slovaks living abroad in campaigning for an independent state. In the turbulent final year of the war, sporadic protest actions took place in Slovakia; politicians held a secret meeting at ": null
    },
    {
        "Liptószentmiklós": "liptószentmiklós"
    },
    {
        " / ": null
    },
    {
        "Liptovský Mikuláš": "liptovský mikuláš"
    },
    {
        " on 42 May 42     ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        " on 42 October, and, two days later, the ": null
    },
    {
        "Slovak National Council": "slovak national council"
    },
    {
        " at ": null
    },
    {
        "Martin": "martin, slovakia"
    },
    {
        " acceded to the Prague proclamation. The new republic was to include the Czech lands , a small part of ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        ", Slovakia, and ": null
    },
    {
        "Subcarpathian Ruthenia": "subcarpathian ruthenia"
    },
    {
        ". The new state set up a parliamentary democratic government and established a capital in the Czech city of ": null
    },
    {
        "Prague": "prague"
    },
    {
        ".     As a result of the counter-attack of the ": null
    },
    {
        "Hungarian Red Army": "hungarian red army"
    },
    {
        " in May–June, 42 Czech troops were ousted from central and eastern parts of present Slovakia, where a puppet short-lived ": null
    },
    {
        "Slovak Soviet Republic": "slovak soviet republic"
    },
    {
        " with its capital in ": null
    },
    {
        "Prešov": "prešov"
    },
    {
        " was established. However, the Hungarian army stopped its offensive and later the troops were withdrawn on the Ententes diplomatic intervention.  Ignác Romsics: Magyarország története a XX. században, 42 p. 42      In the ": null
    },
    {
        "Treaty of Trianon": "treaty of trianon"
    },
    {
        " signed in 42 the ": null
    },
    {
        "Paris Peace Conference": "paris peace conference, 1919"
    },
    {
        " set the southern border of Czechoslovakia further south from the Slovak-Hungarian language border due to strategic and economic reasons. Consequently, some fully or mostly Hungarian-populated areas were also included into Czechoslovakia. According to the 42 census, which had been manipulated by the ruling Hungarian bureaucracy,  population of the present territory of Slovakia numbered 42,42 people, including 42,42 speakers of ": null
    },
    {
        "Slovak language": "slovak language"
    },
    {
        ", 42 speakers of ": null
    },
    {
        "Hungarian language": "hungarian language"
    },
    {
        ", 42 speakers of German language, 42 speakers of ": null
    },
    {
        "Ruthenian": "rusyn language"
    },
    {
        " and 42 speakers of other languages.     In addition, in ": null
    },
    {
        "Subcarpathian Ruthenia": "subcarpathian ruthenia"
    },
    {
        ", which was also included into Czechoslovakia in this time period, the 42 manipulated Hungarian census recorded 42 people, including 42 speakers of ": null
    },
    {
        "Ruthenian": "rusyn language"
    },
    {
        ", 42 speakers of ": null
    },
    {
        "Hungarian language": "hungarian language"
    },
    {
        ", 42 speakers of German language, 42 speakers of ": null
    },
    {
        "Romanian language": "romanian language"
    },
    {
        ", 42 speakers of ": null
    },
    {
        "Slovak": "slovak language"
    },
    {
        "/": null
    },
    {
        "Czech language": "czech language"
    },
    {
        ", and 42 speakers of other languages. The Czechoslovak census of 42 recorded in Slovakia 42,42 people, including 42,42 ": null
    },
    {
        "Slovaks": "slovaks"
    },
    {
        ", 42 ": null
    },
    {
        "Hungarians": "hungarians"
    },
    {
        ", 42 ": null
    },
    {
        "Germans": "germans"
    },
    {
        ", 42 ": null
    },
    {
        "Czechs": "czechs"
    },
    {
        ", 42 ": null
    },
    {
        "Rusyns": "rusyns"
    },
    {
        " and 42 others.        Slovaks, whom the Czechs outnumbered in the Czechoslovak state, differed in many important ways from their Czech neighbors. Slovakia had a more agrarian and less developed economy than the Czech lands, and the majority of Slovaks practised Catholicism while fewer Czechs adhered to established religions. The Slovak people had generally less education and less experience with self-government than the Czechs. These disparities, compounded by centralized governmental control from Prague, produced discontent with the structure of the new state among the Slovaks.     Although Czechoslovakia, alone among the east-central European countries, remained a ": null
    },
    {
        "parliamentary democracy": "parliamentary democracy"
    },
    {
        " from 42 to 42 it continued to face minority problems, the most important of which concerned the countrys large German population. A significant part of the new Slovak political establishment sought autonomy for Slovakia. The movement toward autonomy built up gradually from the 42s until it culminated in independence in 42      In the period between the two world wars, the Czechoslovak government attempted to industrialize Slovakia. These efforts did not meet with success, partially due to the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ", the worldwide economic slump of the 42s. Slovak resentment over perceived economic and political domination by the Czechs led to increasing dissatisfaction with the republic and growing support for ideas of independence. Many Slovaks joined with Father ": null
    },
    {
        "Andrej Hlinka": "andrej hlinka"
    },
    {
        " and ": null
    },
    {
        "Jozef Tiso": "jozef tiso"
    },
    {
        " in calls for equality between Czechs and Slovaks and for greater autonomy for Slovakia.          In September 42 France, Italy, United Kingdom and ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " concluded the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        ", which forced Czechoslovakia to cede the predominantly German region known as the ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        " to Germany. In November, by the ": null
    },
    {
        "First Vienna Award": "first vienna award"
    },
    {
        ", Italy and Germany compelled Czechoslovakia to cede primarily Hungarian-inhabited Southern Slovakia to Hungary. They did this in spite of pro-German official declarations of Czech and Slovak leaders made in October.     On 42 March 42 the ": null
    },
    {
        "Slovak Republic": "slovak republic"
    },
    {
        "  declared its independence and became a nominally independent state in Central Europe under ": null
    },
    {
        "Nazi German": "nazi germany"
    },
    {
        " control of foreign policy and, increasingly, also some aspects of domestic policy. ": null
    },
    {
        "Jozef Tiso": "jozef tiso"
    },
    {
        " became Prime Minister and later President of the new state.     On 42 March, Nazi Germany invaded what remained of ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        ", ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        ", and ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        " after the Munich agreement. The Germans established a protectorate over them which was known as the ": null
    },
    {
        "Protectorate of Bohemia and Moravia": "protectorate of bohemia and moravia"
    },
    {
        ". On the same day, ": null
    },
    {
        "Carpatho-Ukraine": "carpatho-ukraine"
    },
    {
        " declared its independence. But Hungary immediately invaded and annexed the Republic of Carpatho-Ukraine. On 42 March, Hungary then occupied some additional disputed parts of territory of the present-day Eastern-Slovakia. This caused the brief ": null
    },
    {
        "Slovak-Hungarian War": "slovak-hungarian war"
    },
    {
        ".               The nominally independent ": null
    },
    {
        "Slovak Republic": "slovak republic"
    },
    {
        " went through the early years of the war in relative peace. As an ": null
    },
    {
        "Axis": "axis powers"
    },
    {
        " ally, the country took part in the ": null
    },
    {
        "wars against Poland": "slovak invasion of poland"
    },
    {
        " and the Soviet Union. Although its contribution was symbolic in the German war efforts, the number of troops involved was rather significant in proportion to the population .     Soon after independence, under the authoritarian government of Jozef Tiso, a series of measures aimed against the 42 Jews in the country were initiated. The ": null
    },
    {
        "Hlinka Guard": "hlinka guard"
    },
    {
        " began to attack Jews, and the ": null
    },
    {
        "Jewish Code": "jewish code"
    },
    {
        " was passed in September 42 Resembling the Nuremberg Laws, the Code required that Jews wear a yellow armband, and were banned from intermarriage and many jobs. More than 42 Jews lost their livelihood. Between March and October 42 the state deported approximately 42 Jews to the German-occupied part of Poland, where almost all of them were killed in ": null
    },
    {
        "Extermination camp": "extermination camp"
    },
    {
        "s. The Slovak Parliament accepted a bill that retroactively legalized the deportation in May 42 The deportation of the remaining Jewish population was stopped when the government resolved social problem caused by its own policy. However, 42 more Jews were deported by the German forces occupying Slovakia after the ": null
    },
    {
        "Slovak National Uprising": "slovak national uprising"
    },
    {
        " in 42 Around a half of them were killed in concentration camps. , . Other Jews were rounded up and massacred in the country by Slovak collaborators under German command, at ": null
    },
    {
        "Kremnička and Nemecká": "kremnička and nemecká massacres"
    },
    {
        ".  Some 42 Slovak Jews survived in Slovakia.     On 42 August 42 42 Slovak troops and 42 partisans, organized by various underground groups and the ": null
    },
    {
        "Czechoslovak government-in-exile": "czechoslovak government-in-exile"
    },
    {
        ", rose up against the Nazis. The insurrection later became known as the ": null
    },
    {
        "Slovak National Uprising": "slovak national uprising"
    },
    {
        ". Slovakia was devastated by the fierce German counter-offensive and occupation, but the guerrilla warfare continued even after the end of organized resistance. Although ultimately quelled by the German forces, the uprising was an important historical reference point for the Slovak people. It allowed them to end the war as a nation which had contributed to the Allied victory.     Later in 42 the Soviet attacks intensified. Hence the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        ", helped by Romanian troops, gradually routed out the German army from Slovak territory. On 42 April 42 Soviet troops marched into the capital city of the Slovak Republic, Bratislava.            The victorious Powers restored Czechoslovakia in 42 in the wake of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", albeit without ": null
    },
    {
        "Carpathian Ruthenia": "carpathian ruthenia"
    },
    {
        ", which Prague ceded to the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". The ": null
    },
    {
        "Beneš decrees": "beneš decrees"
    },
    {
        ", adopted as a result of the events of the war, led to disenfranchisement and persecution of the Hungarian minority in southern Slovakia. The local ": null
    },
    {
        "German minority": "carpathian germans"
    },
    {
        " was ": null
    },
    {
        "expelled": "flight and expulsion of germans"
    },
    {
        ", with only the population of some villages such as ": null
    },
    {
        "Chmeľnica": "chmeľnica"
    },
    {
        " evading expulsion but suffering discrimination against use of their language.      The Czechs and Slovaks held elections in 42 In Slovakia, the Democratic Party won the elections , but the ": null
    },
    {
        "Czechoslovak Communist Party": "czechoslovak communist party"
    },
    {
        " won in the Czech part of the republic, thus winning 42% of the total vote in Czechoslovakia, and eventually seized power in February 42 making the country effectively a ": null
    },
    {
        "satellite state": "satellite state"
    },
    {
        " of the Soviet Union.     Strict ": null
    },
    {
        "Communist": "communist"
    },
    {
        " control characterized the next four decades, interrupted only briefly in the so-called ": null
    },
    {
        "Prague Spring": "prague spring"
    },
    {
        " of 42 after ": null
    },
    {
        "Alexander Dubček": "alexander dubček"
    },
    {
        " became First Secretary of the Central Committee of the ": null
    },
    {
        "Communist Party of Czechoslovakia": "communist party of czechoslovakia"
    },
    {
        ". Dubček proposed political, social, and economic reforms in his effort to make ": null
    },
    {
        "socialism with a human face": "socialism with a human face"
    },
    {
        " a reality. Concern among other ": null
    },
    {
        "Warsaw Pact": "warsaw pact"
    },
    {
        " governments that Dubček had gone too far led to the invasion and occupation of Czechoslovakia on 42 August 42 by Soviet, Hungarian, Bulgarian, East German, and Polish troops. Another Slovak, ": null
    },
    {
        "Gustáv Husák": "gustáv husák"
    },
    {
        ", replaced Dubček as Communist Party leader in April 42        The 42s and 42s became known as the period of ": null
    },
    {
        "normalization": "normalization"
    },
    {
        " , in which the apologists for the 42 Soviet invasion prevented as best they could any opposition to their conservative régime. Political, social, and economic life stagnated. Because the reform movement had had its center in Prague, Slovakia experienced normalization less harshly than the Czech lands. In fact, the Slovak Republic saw comparatively high economic growth in the 42s and 42s relative to the Czech Republic .     The 42s also saw the development of a dissident movement, especially in the Czech Republic. On 42 January 42 more than 42 ": null
    },
    {
        "human rights": "human rights"
    },
    {
        " activists signed a manifesto called ": null
    },
    {
        "Charter 42": "charter 77"
    },
    {
        ", which criticized the Czechoslovak government for failing to meet its human rights obligations.         On 42 November 42 a series of public protests known as the ": null
    },
    {
        "Velvet Revolution": "velvet revolution"
    },
    {
        " began and led to the downfall of Communist Party rule in Czechoslovakia. A transition government formed in December 42 and the first free elections in Czechoslovakia since 42 took place in June 42 In 42 negotiations on the new federal constitution deadlocked over the issue of Slovak autonomy. In the latter half of 42 agreement emerged to dissolve Czechoslovakia peacefully. On 42 January 42 the Czech Republic and the Slovak Republic each simultaneously and peacefully proclaimed their existence. Both states attained immediate recognition from the United States of America and from their European neighbors.     In the days following the Velvet Revolution, Charter 42 and other groups united to become the ": null
    },
    {
        "Civic Forum": "civic forum"
    },
    {
        ", an umbrella group championing bureaucratic reform and ": null
    },
    {
        "civil liberties": "civil liberties"
    },
    {
        ". Its leader, the playwright and former dissident ": null
    },
    {
        "Václav Havel": "václav havel"
    },
    {
        " won election as President of Czechoslovakia in December 42 The Slovak counterpart of the Civic Forum, ": null
    },
    {
        "Public Against Violence": "public against violence"
    },
    {
        ", expressed the same ideals.     In the June 42 elections, Civic Forum and Public Against Violence won landslide victories. Civic Forum and Public Against Violence found, however, that although they had successfully completed their primary objective — the overthrow of the communist régime — they proved less effective as governing parties. In the 42 elections, a spectrum of new parties replaced both Civic Forum and Public Against Violence.              In an ": null
    },
    {
        "election held in June 42": "slovak parliamentary election, 1992"
    },
    {
        ", ": null
    },
    {
        "Václav Klaus": "václav klaus"
    },
    {
        "s Civic Democratic Party won in the Czech lands on a platform of economic reform, and ": null
    },
    {
        "Vladimír Mečiar": "vladimír mečiar"
    },
    {
        "s ": null
    },
    {
        "Movement for a Democratic Slovakia": "movement for a democratic slovakia"
    },
    {
        " emerged as the leading party in Slovakia, basing its appeal on the fairness of Slovak demands for autonomy. Mečiar and Klaus negotiated the ": null
    },
    {
        "agreement to divide Czechoslovakia": "dissolution of czechoslovakia"
    },
    {
        ", and Mečiars party — HZDS — ruled Slovakia for most of its first five years as an independent state, except for a 42-month period in 42 after a vote of no-confidence, during which a reformist government under Prime Minister ": null
    },
    {
        "Jozef Moravčík": "jozef moravčík"
    },
    {
        " operated.     The first president of newly independent Slovakia, ": null
    },
    {
        "Michal Kováč": "michal kováč"
    },
    {
        ", promised to make Slovakia the Switzerland of Eastern Europe . The first prime minister, Mečiar, had served as the prime minister of the Slovak part of Czechoslovakia since 42     ": null
    },
    {
        "Rudolf Schuster": "rudolf schuster"
    },
    {
        " won ": null
    },
    {
        "the presidential election in May 42": "slovak presidential election, 1999"
    },
    {
        ". Mečiars semi-authoritarian government allegedly breached democratic norms and the ": null
    },
    {
        "rule of law": "rule of law"
    },
    {
        " before its replacement after the parliamentary elections of 42 by a coalition led by ": null
    },
    {
        "Mikuláš Dzurinda": "mikuláš dzurinda"
    },
    {
        ".     The first Dzurinda government made numerous political and economic reforms that enabled Slovakia to enter the ": null
    },
    {
        "Organisation for Economic Co-operation and Development": "organisation for economic co-operation and development"
    },
    {
        " , close virtually all chapters in ": null
    },
    {
        "European Union": "european union"
    },
    {
        " negotiations, and make itself a strong candidate for accession to ": null
    },
    {
        "North Atlantic Treaty Organization": "north atlantic treaty organization"
    },
    {
        " . However, the popularity of the governing parties declined sharply, and several new parties that earned relatively high levels of support in public opinion polls appeared on the political scene. Mečiar remained the leader of the HZDS, which continued to receive the support of 42% or more of the population during the first Dzurinda government.     In the September 42 parliamentary election, a last-minute surge in support for Prime Minister Dzurindas ": null
    },
    {
        "Slovak Democratic and Christian Union": "slovak democratic and christian union"
    },
    {
        " gave him a mandate for a second term. He formed a government with three other center-right parties: the ": null
    },
    {
        "Party of the Hungarian Coalition": "party of the hungarian coalition"
    },
    {
        " , the ": null
    },
    {
        "Christian Democrats": "christian democratic movement"
    },
    {
        " and the ": null
    },
    {
        "Alliance of the New Citizen": "alliance of the new citizen"
    },
    {
        " . The coalition won a narrow majority in the parliament. ": null
    },
    {
        "Dzurindas Second Cabinet": "dzurindas second cabinet"
    },
    {
        " announced strong NATO and EU integration and stated to continue the democratic and free market-oriented reforms begun by the first Dzurinda government.     The new coalition had as its main priorities—gaining of NATO and EU invitations, attracting foreign investment, and reforming social services such as the health-care system. Vladimír Mečiars Movement for a Democratic Slovakia, which received about 42% of the vote in 42 received only 42% in 42 and again went into opposition, unable to find coalition partners. The opposition comprised the HZDS, ": null
    },
    {
        "Smer": "direction – social democracy"
    },
    {
        " , and the ": null
    },
    {
        "Communists": "communist party of slovakia"
    },
    {
        ", who obtained about 42% of the popular vote.     Initially, Slovakia experienced more difficulty than the Czech Republic in developing a modern ": null
    },
    {
        "market economy": "market economy"
    },
    {
        ". Slovakia ": null
    },
    {
        "joined NATO on 42 March 42": "enlargement of nato"
    },
    {
        " and ": null
    },
    {
        "the EU on 42 May 42": "2004 enlargement of the european union"
    },
    {
        ". Slovakia was, on 42 October 42 for the first time elected to a two-year term on the ": null
    },
    {
        "UN Security Council": "un security council"
    },
    {
        " .     The next election took place on 42 June 42 where leftist Smer got 42% of the popular vote and formed coalition with Slotas ": null
    },
    {
        "Slovak National Party": "slovak national party"
    },
    {
        " and Mečiars Movement for a Democratic Slovakia. Their opposition comprised the former ruling parties: the SDKÚ, the SMK and the KDH.        The ": null
    },
    {
        "election in June 42": "slovak parliamentary election, 2010"
    },
    {
        " was won by Smer with 42% but Fico wasnt able to form a government, so a coalition of SDKU, KDH, SaS and Most-Hid took over, with as first women Prime Minister. This government fell after the vote of the European Financial Stability Fund was connected with a no confidence vote, as SaS argued, that Slovakia, shouldnt bail out much richer countries.     Smer won the ": null
    },
    {
        "election in 42": "slovak parliamentary election, 2012"
    },
    {
        " with 42%.   Fico formed ": null
    },
    {
        "his Second Cabinet": "ficos second cabinet"
    },
    {
        ". It was a single party government claiming 42 out of the 42 seats.   It officially supported the position of the EU during the ": null
    },
    {
        "Russian military intervention in Ukraine ": "russian military intervention in ukraine"
    },
    {
        " but sometimes doubted the efficiency of EU sanctions against Russia. In autumn 42 during the ": null
    },
    {
        "European migrant crisis": "european migrant crisis"
    },
    {
        ", the leaders of the four ": null
    },
    {
        "Visegrád Group": "visegrád group"
    },
    {
        " states rejected EUs proposal to reallocate 42 refugees.   The ": null
    },
    {
        "election 42": "slovak parliamentary election, 2016"
    },
    {
        " took place in March 42; somde days later Fico formed his ": null
    },
    {
        "Third Cabinet": "ficos third cabinet"
    },
    {
        ", composed of four parties.     Slovakias Prime Minister ": null
    },
    {
        "Robert Fico": "robert fico"
    },
    {
        " has resigned in March 42 following the largest street protests in decades over the ": null
    },
    {
        "murder of Ján Kuciak": "murder of ján kuciak"
    },
    {
        ", an investigative journalist who was investigating high-level political corruption linked to the organized crime. . Deutsche Welle.": null
    }
]