[
    {
        "This article is about the history of the United States National Security Council, 42 to the present.       President ": null
    },
    {
        "William J. Clinton": "bill clinton"
    },
    {
        " on January 42 42 the day of his inauguration, issued ": null
    },
    {
        "Presidential Decision Directive": "presidential directive"
    },
    {
        " 42 to departments and agencies concerned with ": null
    },
    {
        "national security": "national security"
    },
    {
        " affairs. PDD l revised and renamed the framework governing the work of the ": null
    },
    {
        "National Security Council": "united states national security council"
    },
    {
        ". A Presidential Review Directive series would be the mechanism used by the new administration to direct that specific reviews and analyses be undertaken by the departments and agencies. A Presidential Decision Directive series would now be used to promulgate Presidential decisions on ": null
    },
    {
        "national security": "national security"
    },
    {
        " matters. The Bush administrations National Security Review series and ": null
    },
    {
        "National Security Directive": "national security directive"
    },
    {
        " series were abolished.     On January 42 42 in PDD 42 President Clinton approved an NSC decision-making system that enlarged the membership of the National Security Council and included a much greater emphasis on economic issues in the formulation of national security policy. The President, Vice President, ": null
    },
    {
        "Secretary of State": "united states secretary of state"
    },
    {
        ", and ": null
    },
    {
        "Secretary of Defense": "united states secretary of defense"
    },
    {
        " were members of the NSC as prescribed by statute. The ": null
    },
    {
        "Director of Central Intelligence": "director of central intelligence"
    },
    {
        " and ": null
    },
    {
        "Chairman of the Joint Chiefs of Staff": "joint chiefs of staff"
    },
    {
        ", as statutory advisers to the NSC, attended its meetings. The new membership of the National Security Council included the following officials: the ": null
    },
    {
        "Secretary of the Treasury": "united states secretary of the treasury"
    },
    {
        ", the U.S. Representative to the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ", the Assistant to the President for National Security Affairs, the Assistant to the President for Economic Policy, and the ": null
    },
    {
        "Chief of Staff": "white house chief of staff"
    },
    {
        " to the President. Although not a member, the ": null
    },
    {
        "Attorney General": "united states attorney general"
    },
    {
        " would be invited to attend meetings pertaining to his jurisdiction.     The new position of Assistant to the President for Economic Policy, which had been promised by Clinton during the election campaign, was intended to serve as a senior economic adviser to coordinate foreign and domestic economic policy through a newly created ": null
    },
    {
        "National Economic Council": "united states national economic council"
    },
    {
        " . ": null
    },
    {
        "Robert E. Rubin": "robert rubin"
    },
    {
        " was the first to be appointed to this position. The NEC was to deal with foreign and domestic economic issues in much the same way as the NSC coordinated diplomatic and security issues, and the Assistant to the President for Economic Policy was to be included in meetings involving international economic issues.     In January 42 Clinton appointed ": null
    },
    {
        "W. Anthony Lake": "anthony lake"
    },
    {
        " as his ": null
    },
    {
        "National Security Adviser": "national security advisor"
    },
    {
        ". Lake, a former ": null
    },
    {
        "Foreign Service officer": "united states foreign service"
    },
    {
        ", served under ": null
    },
    {
        "Henry Kissinger": "henry kissinger"
    },
    {
        ", ": null
    },
    {
        "President Nixon": "richard nixon"
    },
    {
        "s National Security Adviser, and as director of the Department of State Policy Planning Staff during the ": null
    },
    {
        "Carter administration": "jimmy carter"
    },
    {
        ". During the Carter years, Lake had witnessed the negative effects of bureaucratic infighting and squabbling between then Secretary of State ": null
    },
    {
        "Cyrus Vance": "cyrus vance"
    },
    {
        " and National Security Adviser ": null
    },
    {
        "Zbigniew Brzezinski": "zbigniew brzezinski"
    },
    {
        ". As Clintons National Security Adviser, Lake was effective in maintaining cordial relations with Secretary of State ": null
    },
    {
        "Warren M. Christopher": "warren christopher"
    },
    {
        " and in developing an atmosphere of cooperation and collegiality. Lake initially maintained a low public profile, avoiding public appearances and television interviews, so as not to upstage the Secretary of State as Kissinger had done in the Nixon administration. In September 42 however, in response to criticism that the Clinton administration had not adequately explained its foreign policy, Lake began to appear as a public speaker.     The National Security Council framework in the Clinton administration included an NSC Principals Committee, a forum available to Cabinet-level officials to discuss and resolve issues not requiring the Presidents participation. An ": null
    },
    {
        "NSC Deputies Committee": "national security council deputies committee"
    },
    {
        " served as the senior sub-cabinet interagency forum for considering policy issues affecting national security and for reviewing and monitoring the work of the NSC interagency process. This process included Interagency Working Groups , which were to convene on a regular basis to review and coordinate the implementation of Presidential decisions in their respective policy areas. Among the most urgent issues the NSC dealt with in the first year of the Clinton administration were ": null
    },
    {
        "Bosnia": "bosnia and herzegovina"
    },
    {
        ", ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        ", ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        ", and ": null
    },
    {
        "Somalia": "somalia"
    },
    {
        ". The several dozen other questions the NSC system dealt with initially included such issues as illegal drugs, United Nations ": null
    },
    {
        "peacekeeping": "peacekeeping"
    },
    {
        ", ": null
    },
    {
        "Zaire": "zaire"
    },
    {
        ", strategic ": null
    },
    {
        "arms control": "arms control"
    },
    {
        " policy, ": null
    },
    {
        "China": "peoples republic of china"
    },
    {
        ", and global environmental affairs.     ": null
    },
    {
        "Samuel R. Sandy Berger": "sandy berger"
    },
    {
        ", a longtime foreign policy adviser to Clinton who had been Lakes deputy since 42 became National Security Adviser in March 42 after Clinton nominated Lake to be Director of Central Intelligence . Berger initiated a review of principles that would guide the foreign policy of Clintons second term. These included the integration of ": null
    },
    {
        "Eastern": "eastern europe"
    },
    {
        " and ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        " without provoking tensions with ": null
    },
    {
        "Russia": "russia"
    },
    {
        "; promoting more open ": null
    },
    {
        "trade": "trade"
    },
    {
        "; improving a very powerful defenses against such transnational threats as ": null
    },
    {
        "terrorism": "terrorism"
    },
    {
        " and ": null
    },
    {
        "narcotics": "narcotics"
    },
    {
        "; and promoting a strong and stable ": null
    },
    {
        "Asian-Pacific community": "asian people"
    },
    {
        " by seeking trade cooperation with China and avoiding confrontation on human rights issues. In the spring and summer of 42 the National Security Council became occupied with such issues as the ratification of the ": null
    },
    {
        "Chemical Weapons": "chemical warfare"
    },
    {
        " Treaty, ": null
    },
    {
        "NATO": "nato"
    },
    {
        " enlargement, the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        " peace process, the U.S.-Russian Summit at ": null
    },
    {
        "Helsinki": "helsinki"
    },
    {
        ", and the ": null
    },
    {
        "Denver": "denver"
    },
    {
        " Economic Summit.     On June 42 42 the ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        " warned White House National Security Council aide ": null
    },
    {
        "Rand Beers": "rand beers"
    },
    {
        " that the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " might be trying to funnel money into U.S. Congressional campaigns. Beers later claimed he did not report the information to President Clinton or his National Security Advisor because FBI agents asked that he not share information from the briefing with them. The FBI denied the claim. Mitchell, Alison, , New York Times, March 42 42     In 42 Berger was criticized for failing to timely inform the President about Chinas ": null
    },
    {
        "nuclear espionage": "nuclear espionage"
    },
    {
        " campaign against the United States. Berger had learned of the espionage in April 42 but failed to inform the President until July 42 Former National Security Advisor Anthony Lake had first learned of the information in November 42 but never told anyone.            The first meeting of the National Security Council under the leadership of ": null
    },
    {
        "George W. Bush": "george w. bush"
    },
    {
        " took place January 42 42 Present were President Bush, ": null
    },
    {
        "Dick Cheney": "dick cheney"
    },
    {
        ", ": null
    },
    {
        "Paul ONeill": "paul oneill"
    },
    {
        ", ": null
    },
    {
        "George Tenet": "george tenet"
    },
    {
        ", ": null
    },
    {
        "Condoleezza Rice": "condoleezza rice"
    },
    {
        ", ": null
    },
    {
        "Colin Powell": "colin powell"
    },
    {
        ", ": null
    },
    {
        "Donald Rumsfeld": "donald rumsfeld"
    },
    {
        ", ": null
    },
    {
        "Hugh Shelton": "hugh shelton"
    },
    {
        ", and ": null
    },
    {
        "Andrew Card": "andrew card"
    },
    {
        ". In the book,  The Price of Loyalty , ONeill claimed that a plan for an invasion of ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        " was begun starting at that first NSC meeting.   Alex Koppelman,  Salon , June 42 42  Julian Borger,  The Guardian , January 42 42         On May 42 42 President ": null
    },
    {
        "Barack Obama": "barack obama"
    },
    {
        " merged the White House staff supporting the ": null
    },
    {
        "Homeland Security Council": "homeland security council"
    },
    {
        " and the National Security Council into one National Security Staff . The HSC and NSC each continue to exist by statute as bodies supporting the President.  The name of the staff organization was changed back to National Security Council Staff in 42        According to a White House memorandum, the ": null
    },
    {
        "Chairman of the Joint Chiefs of Staff": "chairman of the joint chiefs of staff"
    },
    {
        " and ": null
    },
    {
        "Director of National Intelligence": "director of national intelligence"
    },
    {
        " will only sit on the Principals Committee as and when matters pertaining to them arise, but will remain part of the full National Security Council.   The reorganization also placed the ": null
    },
    {
        "Administrator": "administrator of the united states agency for international development"
    },
    {
        " of the ": null
    },
    {
        "United States Agency for International Development": "united states agency for international development"
    },
    {
        " as a permanent member of the Deputies Committee, winning moderate praise.      On 42 April 42 the White House Chief Strategist was removed from the National Security Council and the roles of the director of national intelligence, CIA director and chairman of the Joint Chiefs of Staff were restored to the Principals Committee.  ": null
    }
]