[
    {
        "This article is about the history of the United States National Security Council during the Johnson Administration, 42–42.     The abrupt transition of power to the ": null
    },
    {
        "Johnson": "lyndon johnson"
    },
    {
        " administration brought no dramatic change in the formal role of the ": null
    },
    {
        "National Security Council": "united states national security council"
    },
    {
        ". Like ": null
    },
    {
        "Kennedy": "john f. kennedy"
    },
    {
        ", Johnson much preferred small, informal advisory meetings to large Council meetings supported by an elaborately organized staff. According to one of his aides, Johnson felt the NSC was not a live institution, not suited to precise debate for the sake of decision. Moreover, Johnson thought NSC meetings were prone to leaks—they were like sieves, he once remarked—and he inherited advisers who shared his views. ": null
    },
    {
        "Secretary of State": "united states secretary of state"
    },
    {
        " Dean Rusk": "dean rusk"
    },
    {
        " later observed that during the Kennedy Presidency neither he nor ": null
    },
    {
        "Secretary of Defense": "united states secretary of defense"
    },
    {
        " Robert McNamara": "robert s. mcnamara"
    },
    {
        " liked to get into much discussion in the NSC with so many people sitting around the room and the possibility of leaks so great.     Despite his misgivings about the Council, Johnson started out convening it fairly regularly, about every 42 weeks on average during his first 42 months in office. The sessions dealt with a broad range of issues but were relatively brief in duration and, after May 42 consisted largely of briefings. With the approach of the Presidential election in November, Johnson suspended NSC meetings, but then in early 42 he shifted gears. From February 42 through mid42 he convened the NSC almost exclusively to discuss ": null
    },
    {
        "Vietnam": "vietnam war"
    },
    {
        ", doing so irregularly and, following a flurry of meetings in February 42 infrequently. Several participants later charged that Johnson used the NSC during 42 not to consult on Vietnam as he committed major U.S. ground forces but to rubber stamp decisions made beforehand. The other major foreign policy crisis of the period, the intervention in the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        " during April and May 42 was not brought before the Council at all.     As the Councils formal advisory role diminished, so too did its institutional support. Johnson treated the NSC staff as a personal staff, and dropped meetings of the NSC Standing Group, which convened intermittently under Kennedy to deal with planning and operations problems. Official records of Council actions were discontinued, and National Security Action Memorandums, which Kennedy had instituted to inform government agencies of Presidential decisions requiring follow-up action, were issued with decreasing frequency. Whereas Kennedy had issued 42 NSAMs in less than three years, Johnson issued 42 in 42 42 during 42 and 42 and a mere 42 during his final 42 years in office.     Disinclined to use the Council meetings for advice, Johnson, like Kennedy, relied heavily on his National Security Advisers: ": null
    },
    {
        "McGeorge Bundy": "mcgeorge bundy"
    },
    {
        ", who remained in office through February 42 and Bundys successor, Walt Rostow, who served to the end of the administration. Indeed, scholars looking at the evolution of the NSC from its inception to the 42s contend that the National Security Adviser and his White House centered staff increasingly assumed a more prominent role than the official National Security Council and that Johnson, like Kennedy before him, played a key role in this development. Focusing on Johnsons Presidency alone, however, some of his advisers, including Secretary of State Rusk and Walt Rostow, insisted that the Councils advisory role was actually performed principally by another institution, the Tuesday Lunch Group, and that those lunch meetings were in effect regular NSC meetings.     The small, informal, Tuesday luncheon meetings were much more to Johnsons liking than formal NSC meetings and quickly gained a prominent place in the decision-making process. Embracing the Secretaries of State and Defense and the National Security Adviser, the Tuesday Lunch Group met 42 times between February and September 42 In all Johnson convened some 42 Tuesday luncheons during his Presidency, and the group was gradually expanded to include his press secretary, the ": null
    },
    {
        "Director of Central Intelligence": "director of central intelligence"
    },
    {
        ", and the ": null
    },
    {
        "Chairman of the Joint Chiefs of Staff": "chairman of the joint chiefs of staff"
    },
    {
        ". The participants uniformly praised the strong collegial sense at the meetings and the opportunity for extraordinary candor, but subordinates often complained that the secrecy and informality that encouraged candor also made it hard for them to prepare their superiors properly for the meetings and implement the decisions that were reached.     Upon succeeding Bundy as National Security Adviser in 42 Rostow came to grips with the issue of how to make effective use of the formal Council, which by then was virtually moribund. He advised Johnson neither to pretend to use the Council meetings for making major decisions nor to focus on day-to-day operations. Instead he proposed regular, anticipatory-type sessions devoted, as Johnson explained at the first of the new series, to discussion of complex problems requiring careful exploration before they were to come to him for decision. Clearly intended to complement rather than challenge the primary advisory roles of the Tuesday luncheons and the National Security Adviser and his staff, NSC meetings for the balance of the administration considered a broad range of anticipated rather than pressing issues and gave little attention to Vietnam. As one NSC staff member put it, Council members now convened for reflective and educational discussions, rather than decision-making meetings.     When not relying for advice and support on the Tuesday Lunch Group and the National Security Adviser and his small staff, Johnson turned to a variety of ad hoc groups and trusted friends inside and outside the government. Following the outbreak of the ": null
    },
    {
        "Six-Day War": "six-day war"
    },
    {
        ", for example, he established an NSC Special Committee, modeled on the NSC Executive Committee that met during the ": null
    },
    {
        "Cuban Missile Crisis": "cuban missile crisis"
    },
    {
        ", to coordinate U.S. policy in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        " for several weeks. But none of these arrangements substituted fully for the functions that the NSCs Planning Board and the ": null
    },
    {
        "Operations Coordinating Board": "operations coordinating board"
    },
    {
        " provided under ": null
    },
    {
        "Eisenhower": "dwight d. eisenhower"
    },
    {
        ".     In March 42 the Johnson White House sought to remedy this situation through issuance of NSAM 42 the brainchild of General Maxwell Taylor. NSAM 42 assigned the Secretary of State official responsibility for the overall direction, coordination, and supervision of interdepartmental activities overseas and created a mechanism to carry out the responsibility consisting of the Senior Interdepartmental Group , chaired by the Under Secretary of State, and several Interdepartmental Regional Groups beneath it, each chaired by an Assistant Secretary of State. But following a fast-paced start, the SIG entered a period of quiescence that saw it meet only three times from late July 42 to mid-July 42 reflecting in part Under Secretary of State ": null
    },
    {
        "Nicholas Katzenbach": "nicholas katzenbach"
    },
    {
        "s initial hesitancy to exploit its possibilities upon taking office in October 42 The SIG gained new vitality in mid42 however, and together with the more active IRGs played a complementary and supporting role to the Secretary of State and the NSC, especially in easing the burdens of the national security adviser and his staff with respect to interagency coordination and follow-up.     The innovations of a Presidential administration often do not survive its close, reflecting as they do the distinctive views and management style of the President and his immediate advisers. The close of the Johnson administration brought an end to several of the adaptations it had made to manage foreign policy: Tuesday luncheons, anticipatory-type NSC meetings, and the SIG/IRG structure.                        ": null
    }
]