[
    {
        "This is a page on the history of the island of Martinique .       The island was originally inhabited by ": null
    },
    {
        "Arawak": "arawaks"
    },
    {
        " and ": null
    },
    {
        "Carib": "island caribs"
    },
    {
        " peoples. Circa 42 AD, the first Arawaks are believed to have arrived from South America. In 42 A.D , an eruption of ": null
    },
    {
        "Mount Pelée": "mount pelée"
    },
    {
        " resulted in the decimation of the islands population. Around 42 A.D, the Arawaks returned and repopulated the island. Around 42 A.D, the Caribs arrived. They exterminated the Arawaks and proceeded to settle on the island over the next few centuries.       ": null
    },
    {
        "Christopher Columbus": "christopher columbus"
    },
    {
        " charted the island in 42 making the region known to European interests, but it was not until June 42 42 on his fourth voyage, that he actually landed, leaving several pigs and goats on the island. However, the Spaniards ignored the island as other parts of the New World were of greater interest to them.       In 42 ": null
    },
    {
        "Cardinal Richelieu": "cardinal richelieu"
    },
    {
        " created the ": null
    },
    {
        "Compagnie des Îles de lAmérique": "compagnie des îles de lamérique"
    },
    {
        " . The company contracted with Messrs lOlive and Duplessis to occupy and govern on its behalf the Caribbean islands belonging to the French crown. This led on September 42 42 to ": null
    },
    {
        "Pierre Bélain dEsnambuc": "pierre belain desnambuc"
    },
    {
        " landing on Martinique with eighty to one hundred French settlers from ": null
    },
    {
        "Saint Cristophe": "saint kitts and nevis"
    },
    {
        ". They met some resistance that they were able to dispatch quickly because of their far superior weaponry and armor. They settled in the northwestern region that later became known as ": null
    },
    {
        "St. Pierre": "saint-pierre, martinique"
    },
    {
        " at the mouth of the Roxelane River, where they built Fort Saint Pierre. The first governor was ": null
    },
    {
        "Jean Dupont": "jean dupont"
    },
    {
        ".     The following year, dEsnambuc fell ill and passed the command of the settlement to his nephew, ": null
    },
    {
        "Jacques Dyel du Parquet": "jacques dyel du parquet"
    },
    {
        ". At this time the colonys population numbered some 42 men. The settlers cleared the land around St. Pierre to grow crops. They grew ": null
    },
    {
        "manioc": "manioc"
    },
    {
        " and ": null
    },
    {
        "potato": "potato"
    },
    {
        "es to live on and ": null
    },
    {
        "rocou": "roucou"
    },
    {
        ", ": null
    },
    {
        "indigo": "indigo"
    },
    {
        ", ": null
    },
    {
        "tobacco": "tobacco"
    },
    {
        ", and later ": null
    },
    {
        "cacao": "cocoa bean"
    },
    {
        " and ": null
    },
    {
        "cotton": "cotton"
    },
    {
        ", for export. French and foreign merchants frequently came to the island to buy these exotic products, transforming Martinique into a modestly prosperous colony. The colonists also established another fort, ": null
    },
    {
        "Fort Saint Louis": "fort saint louis"
    },
    {
        " in 42 This fort, like Fort Saint Pierre, was little more than a wooden stockade. In 42 the fort was improved to include a ditch, high stone walls and 42 cannons.     Over the next quarter of a century the French established full control of the island. They systematically killed the fiercely resisting Caribs as they expanded, forcing the survivors back to the Caravelle Peninsula in the Cabesterre .          Although labor-intensive, sugar was a lucrative product to trade, and cultivation on Martinique soon focused only on growing and trading sugar. In 42 King ": null
    },
    {
        "Louis XIV": "louis xiv of france"
    },
    {
        " proclaimed Le Code Noir , which aimed to provide a legal framework for the removal of Africans from their homeland and their transport to work as ": null
    },
    {
        "slaves": "slavery"
    },
    {
        " on the French sugar plantations. Ever since, a strong theme of ": null
    },
    {
        "Martiniquan culture": "culture of martinique"
    },
    {
        " has been ": null
    },
    {
        "creolization": "creole peoples"
    },
    {
        " or interaction between the French colonial settlers, known locally as békés, and the Africans they imported. For over two hundred years, slavery, and slave revolts, would be a major influence on the economy and politics of the island.     The French colonial settlers were peasants attracted by propaganda promising fortune and a life under the sun. The volunteers were ": null
    },
    {
        "indentured servant": "indentured servant"
    },
    {
        "s who had to work for their master for three years, after which they were promised their own land. However, the tiring work and hot climate resulted in few of the workers surviving their three years, with the result that constant immigration was necessary for maintaining the workforce. Still, under the directorship of du Parquet, Martiniques economy developed as it exported products to France and the neighboring English and Dutch colonies. In 42 the Sovereign council was established with several powers, among them the right to grant titles of nobility to families in the islands. In 42 the Company of the Isles of America started to wind up its affairs and in 42 du Parquet bought the island.     In 42 Father Jacques du Tetre built a still for converting the waste from the ": null
    },
    {
        "sugarcane": "sugarcane"
    },
    {
        " mills into molasses, which became a major export industry.     In 42 du Parquet allowed 42 Dutch Jews, who were fleeing Brazil following the Portuguese conquest, to settle Martinique, where they engaged in the sugar trade. This was by far the most sought after product in Europe and the crop soon became Martiniques biggest export.     After the death of du Parquet, his widow ruled on behalf of his children until 42 when ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        " resumed sovereignty over the island, paying an indemnity of £42 to the du Parquet children. At this time, Martiniques population numbered some 42 settlers and a few surviving Carib Indians. The ": null
    },
    {
        "Caribs": "carib expulsion"
    },
    {
        " were eventually exterminated or exiled in 42     In 42 ": null
    },
    {
        "Dominican Fathers": "dominican order"
    },
    {
        " built an estate at Fonds Saint-Jacques. From 42 to 42 this was the home of Père Labat, the French Dominican priest who improved the distillery. A colorful character, he was also an explorer, architect, engineer, and historian, and fought as a soldier against the English.     In 42 Louis transferred the island, this time to the newly established ": null
    },
    {
        "Compagnie des Indes Occidentales": "french west india company"
    },
    {
        ". The next year, during the ": null
    },
    {
        "Second Anglo-Dutch War": "second anglo-dutch war"
    },
    {
        ", a Dutch fleet under Admiral ": null
    },
    {
        "Michiel de Ruyter": "michiel de ruyter"
    },
    {
        " retired to Martinique to refit after the fleets indecisive encounter with an English force off ": null
    },
    {
        "Barbados": "barbados"
    },
    {
        ". Two years later a hurricane devastated Martinique and Guadelope, killing some 42 people. This was the first of several natural disasters that would devastate the population of Martinique over the next few centuries.     In 42 and 42 the English unsuccessfully attacked. The ": null
    },
    {
        "Treaty of Breda ": "treaty of breda"
    },
    {
        " ended the ": null
    },
    {
        "Second Anglo-Dutch War": "second anglo-dutch war"
    },
    {
        " and hence the hostilities.     In 42 ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        " ordered the construction of a citadel, ": null
    },
    {
        "Fort Saint Louis": "fort saint louis"
    },
    {
        ", at Fort Royal Bay to defend Martinique. The next year, the Compagnie des Indes Occidentales decided to establish a town at ": null
    },
    {
        "Fort Royal": "fort royal"
    },
    {
        ", even though the location was a malarial swamp. The Compagnie des Indes Occidentales failed in 42 and the colony reverted to the direct administration of the French crown. Martiniques administration was in the hands of council. The King appointed two members: the Lieutenant-general and the administrator. They chose the other council members . This organization lasted until 42     During the ": null
    },
    {
        "Third Anglo-Dutch War": "third anglo-dutch war"
    },
    {
        ", de Ruyter returned to Martinique in 42 this time with the intent to capture Fort Royal. Calm winds and French booms prevented him from sailing his fleet of 42 warships, nine supply ships, and 42 transports into the harbor. The French repulsed his attempt to land his 42 troops, causing him to lose 42 men, at a cost of 42 French lives.     In 42 the first ": null
    },
    {
        "Governor General of the West Indies": "list of governors general of the french antilles"
    },
    {
        ", ": null
    },
    {
        "Jean-Charles de Baas-Castelmore": "jean-charles de baas-castelmore"
    },
    {
        ", arrived in Martinique and served until 42 His successor was ": null
    },
    {
        "Charles de La Roche-Courbon, comte de Blénac": "charles de la roche-courbon, comte de blénac"
    },
    {
        ", who served for the first time from 42 to 42 He drew up a plan for the city of Fort Royal and improving the fortifications of ": null
    },
    {
        "Fort Saint Louis": "fort saint louis"
    },
    {
        ". de Blénac was responsible for the 42-year effort that resulted in the building of a 42-meter wall around the peninsula on which the Fort stood, the wall being four meters high and two meters thick, and cutting a ditch that separated from the town. de Blénac served as Governor General again from June 42 to February 42 and again from 42 Nov 42 until his death in 42     The growth of the town resulted in the progressive clearing and draining of the ": null
    },
    {
        "mangrove": "mangrove"
    },
    {
        " swamp. By 42 Fort-Royal was the administrative, military and political capital of Martinique. Still, Saint Pierre, with its better harbor, remained the commercial capital.     In 42 in France King ": null
    },
    {
        "Louis XIV": "louis xiv of france"
    },
    {
        " promulgated the ": null
    },
    {
        "Code Noir": "code noir"
    },
    {
        " , a collection of law texts whose 42 articles would regulate slavery in the colonies, and which was partially inspired by ": null
    },
    {
        "Jean-Baptiste Colbert": "jean-baptiste colbert"
    },
    {
        ". The code forbade some cruel acts, but institutionalized others and slavery itself, relegating the status of slaves to that of ": null
    },
    {
        "chattel": "personal property"
    },
    {
        ". It also ordered the expulsion of the Jews from all the French islands. These Jews then moved to the Dutch island of ": null
    },
    {
        "Curaçao": "curaçao"
    },
    {
        ", where they prospered.     In 42 Charles de La Roche-Courbon, Count of Blénac, the Governor and Lieutenant General of the French colonies in America, named Fort Royal as the capital city of Martinique. In 42 the English again unsuccessfully attacked Martinique.          In 42 a French naval officer, ": null
    },
    {
        "Gabriel de Clieu": "gabriel de clieu"
    },
    {
        ", procured a coffee plant seedling from the ": null
    },
    {
        "Royal Botanical Gardens": "jardin des plantes"
    },
    {
        " in Paris and transported it to Martinique. He transplanted it on the slopes of ": null
    },
    {
        "Mount Pelée": "mount pelée"
    },
    {
        " and was able to harvest his first crop in 42 or shortly thereafter. see ": null
    },
    {
        "Gabriel de Clieu": "gabriel de clieu"
    },
    {
        " for more detail By 42 the number of slaves in Martinique had risen to 42 people. In 42 Saint Pierre had about 42 inhabitants, and Fort Royal only about 42.     During the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        " the British ": null
    },
    {
        "42th Regiment of Foot": "76th regiment of foot"
    },
    {
        " under ": null
    },
    {
        "William Rufane": "william rufane"
    },
    {
        " captured Martinique": "invasion of martinique"
    },
    {
        " in early 42    Following ": null
    },
    {
        "Britains victory in the war": "great britain in the seven years war"
    },
    {
        " there was a strong possibility the island would be annexed by them. However, the ": null
    },
    {
        "sugar trade": "sugar trade"
    },
    {
        " made the island so valuable to the royal French government that at the ": null
    },
    {
        "Treaty of Paris ": "treaty of paris"
    },
    {
        ", which ended the Seven Years War, they gave up all of Canada in order to regain Martinique as well as the neighboring island of ": null
    },
    {
        "Guadeloupe": "guadeloupe"
    },
    {
        ". During the British occupation, Marie Josèph Rose Tascher de la Pagerie, the future ": null
    },
    {
        "Empress Joséphine": "empress joséphine"
    },
    {
        " was born to a noble family living on ": null
    },
    {
        "Les Trois-Îlets": "les trois-îlets"
    },
    {
        " across the bay from Fort Royal. Also, 42 saw a ": null
    },
    {
        "yellow fever": "yellow fever"
    },
    {
        " epidemic and in 42 the French established separate governments for Martinique and Guadeloupe.     August 42 42 saw the birth of Saint-Pierre de Louis Delgrès, a mixed-race free black who would serve in the French army and fight the British in 42 before becoming the leader of the unsuccessful resistance in ": null
    },
    {
        "Guadeloupe": "guadeloupe"
    },
    {
        " against General Richepance, whom ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " had sent to restore slavery to that colony. On August 42 a hurricane - apparently accompanied by an earthquake - struck the island; 4242 were killed.   , NOAA Technical Memorandum NWS NHC42 National Hurricane Center, 42 pp. Monsieur de la Pagerie, the father of the future Empress, was almost ruined. At the time, there were some 42 sugar mills in Martinique, and molasses was a major export. Four years later an earthquake shook the island. By 42 when a decree ended indentured servitude for whites, there were some 42 to 42 million coffee trees on the island.     In 42 the future ": null
    },
    {
        "Joséphine de Beauharnais": "joséphine de beauharnais"
    },
    {
        ", first Empress of the French, sailed for France to meet her husband for the first time. In the following year the ": null
    },
    {
        "Great Hurricane of 42": "great hurricane of 1780"
    },
    {
        ", one of the most damaging hurricanes in Western history, struck the island, killing 42 Over 42 French and Dutch merchantmen were lost.  In 42 Admiral ": null
    },
    {
        "de Grasse": "françois joseph paul, marquis de grasetilly, comte de grasse"
    },
    {
        " sailed from Martinique to rendezvous with Spanish forces in order to attack ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        ". The subsequent ": null
    },
    {
        "battle of the Saintes": "battle of the saintes"
    },
    {
        " resulted in a massive defeat for the French at the hands of the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ".       The ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " also affected ": null
    },
    {
        "Trinidad": "trinidad"
    },
    {
        " when Martiniquan planters and their slaves ": null
    },
    {
        "emigrated": "emigrated"
    },
    {
        " there and started to grow sugar and cocoa. Besson, Gerard. 42 The Land of Beginnings. A historical digest, Newsday, Sunday August 42 42 ": null
    },
    {
        "Médéric Louis Élie Moreau de Saint-Méry": "médéric louis élie moreau de saint-méry"
    },
    {
        ", the ": null
    },
    {
        "deputy": "list of members of the national constituent assembly of 1789"
    },
    {
        " to the ": null
    },
    {
        "National Constituent Assembly": "national constituent assembly"
    },
    {
        " for Martinique opposed representation for ": null
    },
    {
        "Free people of color": "free people of color"
    },
    {
        ".      On 42 April 42 the French ": null
    },
    {
        "Legislative Assembly": "legislative assembly"
    },
    {
        " extended citizenship to all ": null
    },
    {
        "men of color": "men of color"
    },
    {
        ". ": null
    },
    {
        "Donatien-Marie-Joseph de Vimeur, vicomte de Rochambeau": "donatien-marie-joseph de vimeur, vicomte de rochambeau"
    },
    {
        " was sent to Martinique to apply this law. The Constituent Assembly of Martinique agreed to promulgate this law. However they refused to allow Rochambeau to disembark with his troops. In 42 there was a small, unsuccessful slave rebellion in Saint Pierre. The French executed six of the ringleaders. On 42 February 42 ": null
    },
    {
        "Louis-Francois Dubuc": "louis-francois dubuc"
    },
    {
        " signed an accord in ": null
    },
    {
        "Whitehall": "whitehall"
    },
    {
        ", London, putting Martinique under British jurisdiction until the French Monarchy could be re-established. In doing so he forestalled the spread of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " to Martinique by giving the English an excuse to intervene. Notably, the accord guaranteed the continuation of slavery.     In 42 the ": null
    },
    {
        "French Convention": "french convention"
    },
    {
        " abolished slavery. However, before this decree could get to Martinique and be implemented, the British attacked the island and captured it. A British force under ": null
    },
    {
        "Admiral Sir John Jervis": "john jervis, 1st earl of st vincent"
    },
    {
        " and ": null
    },
    {
        "Lieutenant General Sir Charles Grey": "charles grey, 1st earl grey"
    },
    {
        " captured ": null
    },
    {
        "Fort Royal": "fort royal"
    },
    {
        " and ": null
    },
    {
        "Fort Saint Louis": "fort saint louis"
    },
    {
        " on 42 March and ": null
    },
    {
        "Fort Bourbon": "fort desaix"
    },
    {
        " two days later. At that point all resistance ceased. On 42 March 42 the British occupation reinstated the Old Regime, including the Monarchys Supreme Council and the ": null
    },
    {
        "seneschal": "seneschal"
    },
    {
        "s courts of ": null
    },
    {
        "Trinité": "la trinité, martinique"
    },
    {
        ", ": null
    },
    {
        "Le Marin": "le marin"
    },
    {
        ", and ": null
    },
    {
        "St Pierre": "saint-pierre, martinique"
    },
    {
        ". The Royalists regained possession of their properties and positions, slaves were returned to their masters, and emancipation was forbidden. The government also promulgated an ordinance banning all gatherings of blacks or meetings by slaves, and banned ": null
    },
    {
        "Carnival": "carnival"
    },
    {
        ". However, the British did require an oath of allegiance to the King of England.       Six years later, in 42 ": null
    },
    {
        "Jean Kina": "jean kina"
    },
    {
        ", an ex-slave from ": null
    },
    {
        "Saint Domingue": "saint domingue"
    },
    {
        " and aide-de-camp to a British officer, fled to Morne Lemaître and called on free blacks and slaves to join him in a rebellion in support of the rights of the free blacks. When Kinas small force marched on ": null
    },
    {
        "Fort-Royal": "fort-royal"
    },
    {
        ", British troops quickly responded and negotiated his surrender in return for amnesty. The British transported Kina to England, where they held him in ": null
    },
    {
        "Newgate Prison": "newgate prison"
    },
    {
        ".     In 42 the British returned the island to the French with the ": null
    },
    {
        "Treaty of Amiens": "treaty of amiens"
    },
    {
        ". When France regained control of Martinique, ": null
    },
    {
        "Napoléon Bonaparte": "napoleon"
    },
    {
        " reinstated slavery. Two years later, he married Martiniquan ": null
    },
    {
        "Joséphine de Beauharnais": "joséphine de beauharnais"
    },
    {
        " and crowned her Empress of France.     During the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", in 42 the British established a fort at ": null
    },
    {
        "Diamond Rock": "diamond rock"
    },
    {
        ", outside Fort de France, and garrisoned it with some 42 sailors and five cannons. The ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " commissioned the fort HMS Diamond Rock and from there were able for 42 months to harass vessels coming into the port. The French eventually sent a fleet of sixteen vessels that retook the island after a fierce bombardment.     The British again ": null
    },
    {
        "captured Martinique in 42": "invasion of martinique"
    },
    {
        ", and held it until 42 In 42 a hurricane killed 42 people in Martinique. During Napoleons ": null
    },
    {
        "42 Days": "hundred days"
    },
    {
        " in 42 he abolished the ": null
    },
    {
        "slave trade": "slave trade"
    },
    {
        ". At the same time the British briefly re-occupied Martinique. The British, who had abolished the slave trade in their empire in 42 forced Napoleons successor, ": null
    },
    {
        "Louis XVIII": "louis xviii of france"
    },
    {
        " to retain the proscription, though it did not become truly effective until 42          A slave insurrection in 42 resulted in two dead and seven injured. The government condemned 42 slaves to death, 42 to the galleys, six to whipping, and eight to helping with the executions.     Martinique has suffered from earthquakes as well as hurricanes. In 42 an earthquake believed to have measured 42 on the ": null
    },
    {
        "Richter magnitude scale": "richter magnitude scale"
    },
    {
        " killed some 42 to 42 people, caused severe damage in Saint Pierre, and almost totally destroyed ": null
    },
    {
        "Fort Royal": "fort royal"
    },
    {
        ". Fort Royal was rebuilt in wood, reducing the risk from earthquakes, but increasing the risk from fire. That same year, there were 42 sugar producers in Martinique, who produced some 42 tons of white gold .     In February 42 ": null
    },
    {
        "François Auguste Perrinon": "françois perrinon"
    },
    {
        " became head of the Committee of Colonists of Martinique. He was a member of the Commission for the abolition of slavery, led by ": null
    },
    {
        "Victor Schoelcher": "victor schoelcher"
    },
    {
        ". On April 42 Schoelcher obtained a decree abolishing slavery in the French Empire. Perrinon was appointed Commissioner General of Martinique, and charged with the task of abolishing slavery there. However, he and the decree did not arrive in Martinique until June 42 by which time Governor ": null
    },
    {
        "Claude Rostoland": "claude rostoland"
    },
    {
        " had already abolished slavery. The imprisonment of a slave at ": null
    },
    {
        "Le Prêcheur": "le prêcheur"
    },
    {
        " had led to a slave revolt on May 42; two days later Rostoland, under duress, had abolished slavery on the island to quell the revolt. That same year, following the establishment of the ": null
    },
    {
        "Second Republic": "french second republic"
    },
    {
        ", ": null
    },
    {
        "Fort Royal": "fort royal"
    },
    {
        " became ": null
    },
    {
        "Fort-de-France": "fort-de-france"
    },
    {
        ".  In 42 May 42 was declared a national holiday in celebration of emancipation. Elisa Bordin and Anna Scacchi , , Cambria Press, 42 p. 42     In 42 a law was passed authorizing the creation of two colonial banks with the authority to issue banknotes. This led to the founding of the Bank of Martinique in Saint Pierre, and the Bank of Guadeloupe. .     Indentured laborers from India started to arrive in Martinique in 42 Plantation owners recruited the Indians to replace the slaves, who once free, had fled the plantations. This led to the creation of the small but continuing ": null
    },
    {
        "Indian": "hinduism in martinique"
    },
    {
        " community in Martinique. This immigration repeated on a smaller scale the importation of Indians to such British colonies as ": null
    },
    {
        "British Guiana": "guyana"
    },
    {
        " and ": null
    },
    {
        "Trinidad and Tobago": "trinidad and tobago"
    },
    {
        " following the abolition of slavery in the British Empire in 42 Towards the end of the century, 42 Chinese also came as earlier they had come to ": null
    },
    {
        "Cuba": "chinese cuban"
    },
    {
        ".     The city government in 4242 cleared and filled the flood channel encircling Fort de France. The channel had become an open sewer and hence a health hazard. The filled-in channel, La Levee, marked the northern boundary of the city.     Martinique got its second enduring financial institution in 42 when the ": null
    },
    {
        "Crédit Foncier Colonial": "crédit foncier colonial"
    },
    {
        " opened its doors in Saint Pierre. Its objective was to make long-term loans for the construction or modernization of sugar factories. It replaced the Crédit Colonial, which had been established in 42 but seems hardly to have gotten going.     In 42 construction work on the Radoub Basin port facilities at Fort de France finally was completed. The improvements to the port would enable Fort de France better to compete in trade and commerce with ": null
    },
    {
        "Saint Pierre": "saint-pierre, martinique"
    },
    {
        ".     In 42 rising racial tensions led to the short-lived insurrection in southern Martinique and proclamation in ": null
    },
    {
        "Fort-de-France": "fort-de-france"
    },
    {
        " of a Martiniquan Republic. The insurrection started with an altercation between a local béké and a black tradesman. A crowd ": null
    },
    {
        "lynched": "lynched"
    },
    {
        " the béke and during the insurrection many sugar factories were torched. The authorities restored order by temporarily imprisoning some 42 rebels in Martiniques forts. Seventy-four were tried and found guilty, and the twelve principal leaders were shot to death. The authorities deported the rest to ": null
    },
    {
        "French Guiana": "french guiana"
    },
    {
        " or ": null
    },
    {
        "New Caledonia": "new caledonia"
    },
    {
        ".     By this time sugar cane fields covered some 42% of Martiniques arable land. Unfortunately, falling prices for sugar forced many small sugar works to merge. Producers turned to rum production in an attempt to improve their fortunes.     When France established the ": null
    },
    {
        "Third Republic": "french third republic"
    },
    {
        " in 42 the colonies, Martinique among them, gained representation in the National Assembly.     In 42 after visiting ": null
    },
    {
        "Panama": "panama"
    },
    {
        ", ": null
    },
    {
        "Paul Gauguin": "paul gauguin"
    },
    {
        " spent some months with his friend ": null
    },
    {
        "Charles Laval": "charles laval"
    },
    {
        ", also a painter, in a cabin some two kilometers south of Saint Pierre. During this period Gauguin produced several paintings featuring Martinique. There is now a small Gauguin museum in ": null
    },
    {
        "Le Carbet": "le carbet"
    },
    {
        " that has reproductions of his Martinique paintings. That same year  Harpers Weekly  sent the author and translator ": null
    },
    {
        "Lafcadio Hearn": "lafcadio hearn"
    },
    {
        " to Martinique for a short visit; he ended up staying for some two years. After his return to the United States he would publish two books, one an account of his daily life in Martinique and the other the story of a slave.     By 42 the population of Martinique had risen from about 42 people a decade earlier to 42. At the same time, natural disasters continued to plague the island. Much of Fort de France was devastated by a fire in 42 and then the next year a hurricane killed some 42 people.     In the 42s, the Paris architect ": null
    },
    {
        "Pierre-Henri Picq": "pierre-henri picq"
    },
    {
        " built the Schoelcher Library, an iron and glass structure that was exhibited in the ": null
    },
    {
        "Tuileries Gardens": "tuileries gardens"
    },
    {
        " during the 42 Paris ": null
    },
    {
        "Exposition Universelle": "exposition universelle"
    },
    {
        ", on the occasion of the 42th anniversary of the French Revolution. After the ": null
    },
    {
        "Exposition": "world exposition"
    },
    {
        " the building was shipped to Fort de France and reassembled there, the work being completed by 42 Initially, the library contained the 42 books that ": null
    },
    {
        "Victor Schoelcher": "victor schoelcher"
    },
    {
        " had donated to the island. Today it houses over 42 and stands as a tribute to the man who led the movement to abolish slavery in Martinique. In 42 Picq also built the ": null
    },
    {
        "Saint-Louis Cathedral": "fort-de-france cathedral"
    },
    {
        " in Fort-de-France.       The abolition of slavery did not end racially charged labor strife. In 42 a strike at a sugar factory owned by a Frenchman led to the police shooting dead 42 agricultural workers.       On May 42 42 a blast from the volcano ": null
    },
    {
        "Mont Pelée": "mount pelée"
    },
    {
        " destroyed the town of St. Pierre, killing almost all of its 42 inhabitants. The only survivors were a shoemaker and a prisoner who was saved by his position in a jail dungeon with only a single window. Because Saint Pierre was the commercial capital of the island, there were four banks in the city—the ": null
    },
    {
        "Banque de la Martinique": "banque de la martinique"
    },
    {
        ", ": null
    },
    {
        "Banque Transatlantique": "banque transatlantique"
    },
    {
        ", a branch of the Colonial Bank of London, and the ": null
    },
    {
        "Crédit Foncier Colonial": "crédit foncier colonial"
    },
    {
        ". All were destroyed. The town had to be completely rebuilt and lost its status as the commercial capital, a title which shifted to ": null
    },
    {
        "Fort-de-France": "fort-de-france"
    },
    {
        ". Due to the eruption, refugees from Martinique arrived in boats to the southern villages of ": null
    },
    {
        "Dominica": "dominica"
    },
    {
        " and some remained permanently on the island.       A hurricane in 42 killed 42 people and damaged the sugar crop and a strong earthquake off ": null
    },
    {
        "Saint Lucia": "saint lucia"
    },
    {
        " in 42 caused further damage in Martinique, but mercifully no deaths. As construction began on the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        ", more than 42 Martiniquans left to work on the project.     Resettlement of Saint Pierre began in 42 Even so, two years later the City of Saint Pierre was removed from the map of France with jurisdiction over the ruins transferring to ": null
    },
    {
        "Le Carbet": "le carbet"
    },
    {
        ". Elsewhere, political opponents assassinated the ": null
    },
    {
        "mayor": "mayor"
    },
    {
        " of ": null
    },
    {
        "Fort de France": "fort de france"
    },
    {
        ", Antoine Seger in 42     With war with Germany looming, in 42 France enacted compulsory military service in the colony, and called on Martinique to send 42 men per year to France for training. When World War I finally came, 42 Martiniquans took part, of whom 42 died. During the war, the French government requisitioned Martiniques rum production for the use of the ": null
    },
    {
        "French Army": "french army"
    },
    {
        ". Production doubled as sugar mills converted to distilleries, helping the recovery of the local economy.       In 42 Saint Pierre was reestablished as a municipality. Two years later, in Fort de France, the municipal council approved the ": null
    },
    {
        "Mayor": "mayor"
    },
    {
        "s proposal to redevelop the slum district of Terres Sainvilles as a workers city . The council would sell the new housing to the residents for 42 semi-annual interest-free payments.     With the collapse of the world market for sugar in 4242 cultivators sought a new crop. In 42 they introduced ": null
    },
    {
        "banana": "banana"
    },
    {
        "s.     Mont Pelée became active in 42 forcing the temporary evacuation of Saint Pierre. The Volcanological Observatory there did not get its first seismometer until some three years later.     In 42 the Martiniquan ": null
    },
    {
        "Aimé Césaire": "aimé césaire"
    },
    {
        " moved to Paris to attend the ": null
    },
    {
        "Lycée Louis-le-Grand": "lycée louis-le-grand"
    },
    {
        ", the ": null
    },
    {
        "École Normale Supérieure": "école normale supérieure"
    },
    {
        ", and finally the ": null
    },
    {
        "Sorbonne": "sorbonne"
    },
    {
        ". While in Paris, Césaire met ": null
    },
    {
        "Léopold Senghor": "léopold senghor"
    },
    {
        ", then a poet but later ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        "s first President. Césaire, Senghor, and ": null
    },
    {
        "Léon Damas": "léon damas"
    },
    {
        ", with whom Césaire had gone to school in Martinique at the Lycée Schoelcher, together formulated the concept of  négritude , defined as an affirmation of pride in being black, and promoted it as a movement.     In 42 ": null
    },
    {
        "André Aliker": "andré aliker"
    },
    {
        ", the editor of Justice, the ": null
    },
    {
        "Communist": "communist"
    },
    {
        " newspaper, documented that a M. Aubéry, the wealthy, white owner of the Lareinty Company, had bribed the judges of the Court of Appeal to dismiss charges of tax fraud against him. That same year, ": null
    },
    {
        "Félix Eboué": "félix eboué"
    },
    {
        " became the Acting Governor of the island, and an American, ": null
    },
    {
        "Frank Perret": "frank perret"
    },
    {
        ", established Le Musée Volcanologique at Saint Pierre.     In 42 persons unknown kidnapped and murdered André Aliker; his body washed up on the beach with his arms tied behind him. Aimé Césaire, Senghor, Damas, and others, founded LEtudiant, a Black student review.     In 42 the French cruiser Jeanne dArc arrived late in the year with Admiral Georges Robert, High Commissioner of the Republic to the Antilles and Guiana. Aimé Césaire returned to Martinique. He became a teacher at the Lycee Schoelcher in Fort de France, where his students included ": null
    },
    {
        "Frantz Fanon": "frantz fanon"
    },
    {
        " and ": null
    },
    {
        "Édouard Glissant": "édouard glissant"
    },
    {
        ".       Until mid42 Martinique was officially pro-": null
    },
    {
        "Vichy": "vichy france"
    },
    {
        ", with the US and Great Britain seeking to limit any effect of that stance on the war. The US did prepare plans for an invasion by an expeditionary force to capture the island, and at various times the US and Britain established blockades. For instance, from July to November 42 the British cruisers  and  maintained a watch to ensure that the French aircraft carrier ": null
    },
    {
        "Béarn": "french aircraft carrier béarn"
    },
    {
        " and the other French naval vessels in Martinique did not slip away to Europe.     In June 42 the French cruiser ": null
    },
    {
        "Émile Bertin": "french cruiser émile bertin"
    },
    {
        " arrived in Martinique with 42 tons of gold from the ": null
    },
    {
        "Bank of France": "bank of france"
    },
    {
        ". The original intent was that Banks gold reserve go to Canada for safekeeping, and a first shipment did go there. When France signed an armistice with Germany, plans changed and the second shipment was rerouted to Martinique. When it arrived in Martinique, Admiral Robert arranged for the storage of the gold in ": null
    },
    {
        "Fort Desaix": "fort desaix"
    },
    {
        ". Émile Bertin then stayed at ": null
    },
    {
        "Fort de France": "fort de france"
    },
    {
        " until Martinique declared for ": null
    },
    {
        "Charles de Gaulle": "charles de gaulle"
    },
    {
        " and the ": null
    },
    {
        "Free French": "free french"
    },
    {
        " forces. Essentially, in late 42 Admiral Robert agreed to keep the French naval vessels immobilized, in return for the Allies not bombarding and invading the French Antilles.     In mid42 Admiral Robert returned to France via ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        " and ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ", and Free French sympathizers took control of the gold at Fort Desaix and the French fleet.     In 42 the American film director ": null
    },
    {
        "Howard Hawks": "howard hawks"
    },
    {
        " directed ": null
    },
    {
        "Humphrey Bogart": "humphrey bogart"
    },
    {
        ", ": null
    },
    {
        "Lauren Bacall": "lauren bacall"
    },
    {
        ", ": null
    },
    {
        "Hoagy Carmichael": "hoagy carmichael"
    },
    {
        " and ": null
    },
    {
        "Walter Brennan": "walter brennan"
    },
    {
        " in the film  To Have and Have Not . Hawks more-or-less based the film on a novel that ": null
    },
    {
        "Ernest Hemingway": "ernest hemingway"
    },
    {
        " had written in 42 The essence of the plot is the conversion from neutrality to the Free French side of an American fishing boat captain operating out of Vichy-controlled Fort de France in 42     In 42 ": null
    },
    {
        "Aimé Césaire": "aimé césaire"
    },
    {
        " succeeded in getting elected ": null
    },
    {
        "Mayor": "mayor"
    },
    {
        " of Fort de France and Deputy from Martinique to the ": null
    },
    {
        "French National Assembly": "french national assembly"
    },
    {
        " as a member of the ": null
    },
    {
        "Communist Party": "communist party"
    },
    {
        ". Césaire remained mayor for 42 years. However, the Communist suppression of the ": null
    },
    {
        "Hungarian Revolution of 42": "hungarian revolution of 1956"
    },
    {
        " disillusioned him, causing him to quit the Communist Party. As a member of the Assembly, he was one of the principal drafters of the 42 law on departmentalizing former colonies, a role for which politicians favoring independence have often criticized him.     In 42 the High Court of Justice in Versailles tried Admiral Robert for ": null
    },
    {
        "collaboration": "collaboration"
    },
    {
        ". He received a sentence of 42 years at hard labor and national degradation for life. The Court released him from the hard labor after six months, and he received a pardon in 42       In 42 the French National Assembly voted unanimously to transform Martinique from a colony of France into a department, known in French as a ": null
    },
    {
        "Département doutre-mer": "département doutre-mer"
    },
    {
        " or DOM. Along with its fellow DOMs of ": null
    },
    {
        "Guadeloupe": "guadeloupe"
    },
    {
        ", ": null
    },
    {
        "Réunion": "réunion"
    },
    {
        ", and ": null
    },
    {
        "French Guiana": "french guiana"
    },
    {
        ", Martinique was intended to be legally identical to any department in the metropole. However, in reality, several key differences remained, particularly within social security payments and unemployment benefits.     French funding to the DOM has somewhat made up for the social and economic devastation of the slave trade and sugar crop monoculture. With French funding to Martinique, the island had one of the highest standards of living in the Caribbean. However, it remained dependent upon French aid, as when measured by what Martinique actually produced, it was one of the poorer islands in the region.            - Official site of the French Government             ": null
    }
]