[
    {
        "    Eritrea is an ancient name, associated its ancient ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " form Erythraia, Ἐρυθραία, and its derived ": null
    },
    {
        "Latin": "latin"
    },
    {
        " form Erythræa. This name is based on the Greek name for the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        ", then called the Erythræan Sea, from the Greek for red , ἐρυθρός, erythros. The ": null
    },
    {
        "Italians": "italians"
    },
    {
        " created the colony of Eritrea in the late 19th century around ": null
    },
    {
        "Asmara": "asmara"
    },
    {
        ". After ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " Eritrea became part of Ethiopia. In 1991 the ": null
    },
    {
        "Eritrean Peoples Liberation Front": "eritrean peoples liberation front"
    },
    {
        " defeated the ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        "n government forces. ": null
    },
    {
        "Eritrea": "eritrea"
    },
    {
        " officially celebrated its independence on 24 May 1991. Emperor Menelik gave Eritrea to the Italians. Eritrea used to be part of Ethiopia. colonised by the Italians. Menelik then defeated the Italians in war and claimed victory. After 30 year of war Eritrea was able to declare its independence from Ethiopia.          At Buya in Eritrea, one of the oldest ": null
    },
    {
        "hominids": "hominid"
    },
    {
        "representing a possible link between  Homo erectus  and an archaic  Homo sapiens  was found by Italian scientists. Dated to over 1 million years old, it is the oldest skeletal find of its kind and provides a link between hominids and the earliest ": null
    },
    {
        "anatomically modern humans": "anatomically modern humans"
    },
    {
        ".  It is believed that the section of the ": null
    },
    {
        "Danakil Depression": "danakil depression"
    },
    {
        " in Eritrea was also a major player in terms of human evolution, and may contain other traces of evolution from Homo erectus hominids to anatomically modern humans.      During the last interglacial period, the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        " coast of Eritrea was occupied by early anatomically modern humans.  It is believed that the area was on the route out of Africa that some scholars suggest was used by early humans to colonize the rest of the Old World.  In 1999, the Eritrean Research Project Team composed of Eritrean, Canadian, American, Dutch and French scientists discovered a ": null
    },
    {
        "Paleolithic": "paleolithic"
    },
    {
        " site with stone and obsidian tools dated to over 125,000 years old near the ": null
    },
    {
        "Bay of Zula": "gulf of zula"
    },
    {
        " south of ": null
    },
    {
        "Massawa": "massawa"
    },
    {
        ", along the Red Sea littoral. The tools are believed to have been used by early humans to harvest marine resources like clams and oysters.      According to linguists, the first ": null
    },
    {
        "Afroasiatic": "afroasiatic languages"
    },
    {
        "-speaking populations arrived in the region during the ensuing ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " era from the familys proposed ": null
    },
    {
        "urheimat": "afroasiatic urheimat"
    },
    {
        " in the ": null
    },
    {
        "Nile Valley": "nile valley"
    },
    {
        ", Zarins, Juris , Early Pastoral Nomadism and the Settlement of Lower Mesopotamia , or the ": null
    },
    {
        "Near East": "near east"
    },
    {
        ". Diamond J, Bellwood P Farmers and Their Languages: The First Expansions SCIENCE 300,  Other scholars propose that the Afroasiatic family developed in situ in the Horn, with its speakers subsequently dispersing from there.                  Together with ": null
    },
    {
        "Djibouti": "djibouti"
    },
    {
        ", ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        ", northern ": null
    },
    {
        "Somalia": "somalia"
    },
    {
        ", and the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        " coast of ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        ",  Eritrea is considered the most likely location of the land known to the ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        "ians as  Punt , whose first mention dates to the 25th century BC. Najovits, Simson Egypt, trunk of the tree, Volume 2, Algora Publishing, p. 258, . The ancient Puntites were a nation of people that had close relations with ": null
    },
    {
        "Pharaonic Egypt": "pharaoh"
    },
    {
        " during the times of ": null
    },
    {
        "Pharaoh": "pharaoh"
    },
    {
        " Sahure": "sahure"
    },
    {
        " and ": null
    },
    {
        "Queen": "queen regnant"
    },
    {
        " Hatshepsut": "hatshepsut"
    },
    {
        ".     In 2010, a genetic study was conducted on the mummified remains of ": null
    },
    {
        "baboons": "baboon"
    },
    {
        "that were brought back as gifts from Punt by the ancient Egyptians. Led by a research team from the ": null
    },
    {
        "Egyptian Museum": "egyptian museum"
    },
    {
        " and the ": null
    },
    {
        "University of California at Santa Cruz": "university of california, santa cruz"
    },
    {
        ", the scientists used oxygen ": null
    },
    {
        "isotope": "isotope"
    },
    {
        " analysis to examine hairs from two baboon mummies that had been preserved in the ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        ". One of the baboons had distorted isotopic data, so the others oxygen isotope values were compared to those of present-day baboon specimens from regions of interest. The researchers found that the mummies most closely matched modern baboon specimens in Eritrea and Ethiopia, which they suggested implied that Punt was likely a narrow region that included eastern Ethiopia, Somalia, and all of Eritrea. Owen Jarus ,          Excavations at ": null
    },
    {
        "Sembel": "sembel"
    },
    {
        " found evidence of an ancient pre-": null
    },
    {
        "Aksumite": "kingdom of aksum"
    },
    {
        " civilization in greater Asmara. This Ona urban culture is believed to have been among the earliest pastoral and agricultural communities in the Horn region. Artefacts at the site have been dated to between 800 BC and 400 BC, contemporaneous with other pre-Aksumite settlements in the Eritrean and Ethiopian highlands during the mid-first millennium BC.      Additionally, the Ona culture may have had connections with the ancient Land of Punt. In a tomb in ": null
    },
    {
        "Thebes": "thebes, egypt"
    },
    {
        " dated to the reign of Pharaoh ": null
    },
    {
        "Amenophis II": "amenhotep ii"
    },
    {
        " , long-necked pots similar to those made by the Ona people are depicted as part of the cargo in a ship from Punt.           Excavations in and near ": null
    },
    {
        "Agordat": "agordat"
    },
    {
        " in central Eritrea yielded the remains of an ancient pre-Aksumite civilization known as the Gash Group.  Ceramics were discovered that were related to those of the ": null
    },
    {
        "C-Group": "nubian c-group"
    },
    {
        " pastoral culture, which inhabited the ": null
    },
    {
        "Nile Valley": "nile valley"
    },
    {
        " between 2500–1500 BC.  Sherds akin to those of the ": null
    },
    {
        "Kerma": "kerma"
    },
    {
        " culture, another community that flourished in the Nile Valley around the same period, were also found at other local archaeological sites in the Barka valley belonging to the Gash Group. According to Peter Behrens and Marianne Bechaus-Gerst , linguistic evidence indicates that the C-Group and Kerma peoples spoke ": null
    },
    {
        "Afro-Asiatic languages": "afro-asiatic languages"
    },
    {
        " of the ": null
    },
    {
        "Berber": "berber languages"
    },
    {
        " and ": null
    },
    {
        "Cushitic": "cushitic languages"
    },
    {
        " branches, respectively.               ": null
    },
    {
        "Dmt": "dmt"
    },
    {
        " was a kingdom that encompassed most of Eritrea and the northern fringes of Ethiopia, it existed during the 8th and 7th centuries BC. Given the presence of a massive temple complex, its capital was most likely ": null
    },
    {
        "Yeha": "yeha, ethiopia"
    },
    {
        ". ": null
    },
    {
        "Qohaito": "qohaito"
    },
    {
        ", often identified as the town Koloe in the  Periplus of the Erythraean Sea , G.W.B. Huntingford, Historical Geography of Ethiopia from the first century AD to 1704 , pp. 38f as well as ": null
    },
    {
        "Matara": "matara, eritrea"
    },
    {
        " were important ancient Dmt kingdom cities in southern Eritrea.     The realm developed ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        " schemes, used ": null
    },
    {
        "plow": "plow"
    },
    {
        "s, grew ": null
    },
    {
        "millet": "millet"
    },
    {
        ", and made ": null
    },
    {
        "iron": "iron"
    },
    {
        " tools and weapons. After the fall of Dʿmt in the 5th century BC, the plateau came to be dominated by smaller successor kingdoms until the rise of one of these polities during the first century, the ": null
    },
    {
        "Kingdom of Aksum": "kingdom of aksum"
    },
    {
        ", which was able to reunite the area. Pankhurst, Richard K.P. , Addis Tribune             The ": null
    },
    {
        "Kingdom of Aksum": "kingdom of aksum"
    },
    {
        " was a trading empire centered in Eritrea and northern Ethiopia.  It existed from approximately 100–940 AD, growing from the proto-Aksumite ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " period c. 4th century BC to achieve prominence by the 1st century AD.     The Aksumites established bases on the northern highlands of the Ethiopian Plateau and from there expanded southward. The ": null
    },
    {
        "Persia": "sassanid empire"
    },
    {
        "n religious figure ": null
    },
    {
        "Mani": "mani"
    },
    {
        " listed Axum with ": null
    },
    {
        "Rome": "roman empire"
    },
    {
        ", Persia, and ": null
    },
    {
        "China": "china"
    },
    {
        " as one of the four great powers of his time. The origins of the Axumite Kingdom are unclear, although experts have offered their speculations about it. Even who should be considered the earliest known king is contested: although ": null
    },
    {
        "Carlo Conti Rossini": "carlo conti rossini"
    },
    {
        " proposed that ": null
    },
    {
        "Zoskales": "zoskales"
    },
    {
        " of Axum, mentioned in the  Periplus of the Erythraean Sea , should be identified with one Za Haqle mentioned in the Ethiopian King Lists , ": null
    },
    {
        "G.W.B. Huntingford": "g.w.b. huntingford"
    },
    {
        " argued that Zoskales was only a sub-king whose authority was limited to ": null
    },
    {
        "Adulis": "adulis"
    },
    {
        ", and that Conti Rossinis identification can not be substantiated. Expressed, for example, in his The Historical Geography of Ethiopia , p. 39.     According to the medieval Liber Axumae , Aksums first capital, Mazaber, was built by Itiyopis, son of Cush.  Munro-Hay cites the Muslim historian ": null
    },
    {
        "Abu Jafar al-Khwarazmi": "abu jafar al-khwarazmi"
    },
    {
        "/Kharazmi as stating that the capital of the kingdom of Habash was ": null
    },
    {
        "Jarma": "jarma"
    },
    {
        " . Stuart Munro-Hay, Aksum, pp. 95–98. The capital was later moved to ": null
    },
    {
        "Aksum": "axum"
    },
    {
        " in northern Ethiopia. The Kingdom used the name Ethiopia as early as the 4th century.  Paul B. Henze, Layers of Time: A History of Ethiopia, 2005.     The Aksumites erected a number of large ": null
    },
    {
        "stelae": "stele"
    },
    {
        ", which served a religious purpose in pre-Christian times. One of these granite columns is the largest such structure in the world, standing at 90 feet.  Under ": null
    },
    {
        "Ezana": "ezana of axum"
    },
    {
        " , Aksum later adopted ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ".  In 615, during the lifetime of ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        ", the Aksumite King ": null
    },
    {
        "Sahama": "sahama"
    },
    {
        " provided asylum to early ": null
    },
    {
        "Muslims": "muslim"
    },
    {
        "from ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        " fleeing persecution. Stuart Munro-Hay, Aksum, p.56. This journey is known in ": null
    },
    {
        "Islamic history": "islamic history"
    },
    {
        " as the ": null
    },
    {
        "First Hijra": "migration to abyssinia"
    },
    {
        ". The area is also the alleged resting place of the ": null
    },
    {
        "Ark of the Covenant": "ark of the covenant"
    },
    {
        " and the purported home of the ": null
    },
    {
        "Queen of Sheba": "queen of sheba"
    },
    {
        ".       The kingdom is mentioned in the Periplus of the Erythraean Sea as an important market place for ": null
    },
    {
        "ivory": "ivory trade"
    },
    {
        ", which was exported throughout the ancient world. Aksum was at the time ruled by Zoskales, who also governed the port of Adulis. , chs. 4, 5 The Aksumite rulers facilitated trade by minting their own ": null
    },
    {
        "Aksumite currency": "aksumite currency"
    },
    {
        ".     The state also established its hegemony over the declining ": null
    },
    {
        "Kingdom of Kush": "kingdom of kush"
    },
    {
        " and regularly entered the politics of the kingdoms on the ": null
    },
    {
        "Arabian peninsula": "arabian peninsula"
    },
    {
        ", eventually extending its rule over the region with the conquest of the ": null
    },
    {
        "Himyarite Kingdom": "himyarite kingdom"
    },
    {
        ". Inscriptions have been found in ": null
    },
    {
        "Southern Arabia": "southern arabia"
    },
    {
        " celebrating victories over one ": null
    },
    {
        "GDRT": "gdrt"
    },
    {
        ", described as nagashi of ": null
    },
    {
        "Habashat": "habesha people"
    },
    {
        " and of Axum. Other dated inscriptions are used to determine a floruit for GDRT around the beginning of the 3rd century. A bronze scepter or wand has been discovered at ": null
    },
    {
        "Atsbi Dera": "atsbi dera"
    },
    {
        " with in inscription mentioning GDR of Axum . Coins showing the royal portrait began to be minted under King ": null
    },
    {
        "Endubis": "endubis"
    },
    {
        " toward the end of the 3rd century.     Additionally, expeditions by ": null
    },
    {
        "Ezana": "ezana of axum"
    },
    {
        " into the ": null
    },
    {
        "Kingdom of Kush": "kingdom of kush"
    },
    {
        " at ": null
    },
    {
        "Meroe": "meroe"
    },
    {
        " in Sudan may have brought about the latter politys demise, though there is evidence that the kingdom was experiencing a period of decline beforehand. As a result of Ezanas expansions, Aksum bordered the Roman ": null
    },
    {
        "province of Egypt": "aegyptus"
    },
    {
        ". The degree of Aksums control over Yemen is uncertain. Though there is little evidence supporting Aksumite control of the region at that time, his title, which includes king of Saba and Salhen, Himyar and Dhu-Raydan , along with gold Aksumite coins with the inscriptions, king of the  Habshat  or Habashite, indicate that Aksum might have retained some legal or actual footing in the area. Stuart Munro-Hay, Aksum, p. 81.     Details of the Aksumite Kingdom, never abundant, become even more scarce after this point. The last king known to mint coins is ": null
    },
    {
        "Armah": "armah"
    },
    {
        ", whose coinage refers to the Persian conquest of Jerusalem in 614. Stuart Munro-Hay believes that Axum had been abandoned as the capital by Sahamas reign. However, Kobishchanov suggests that Ethiopians retained hegemony over the Arabian ports until at least as late as 702. Kobishchanov, Axum, p. 116.                 From the late first to early second millennium Eritrea witnessed a period of migrations: Since the late 7th century, so with the decline of Aksum, large parts of Eritrea, including the highlands, were overrun by pagan ": null
    },
    {
        "Beja": "beja people"
    },
    {
        ", who supposedly founded several kingdoms on its soil, like ": null
    },
    {
        "Baqlin": "kingdom of belgin"
    },
    {
        ", ": null
    },
    {
        "Jarin": "kingdom of jarin"
    },
    {
        " and ": null
    },
    {
        "Qata": "kingdom of qitaa"
    },
    {
        ". Dan Connell, Tom Killion : Historical Dictionary of Eritrea . The Scarecrow. Lanham, Toronto, Plymouth. p. 118-119 The Beja rule declined in the 13th century. Subsequently, the Beja were expelled from the highlands by Abyssinian settlers from the south. Kjetil Tronvoll : Mai Weini, a Highland Village in Eritrea: A Study of the People . p. 34-35 Another people, the ": null
    },
    {
        "Bellou": "bellou"
    },
    {
        ", originated from a similar millieu as the Beja. They appeared first in the 12th century, from then on they dominated parts of northwestern Eritrea until the 16th century. Dan Connell, Tom Killion : Historical Dictionary of Eritrea . The Scarecrow. Lanham, Toronto, Plymouth. p. 120-121 After 1270, with the destruction of the ": null
    },
    {
        "Zagwe Kingdom": "zagwe dynasty"
    },
    {
        ", many ": null
    },
    {
        "Agaw": "agaw"
    },
    {
        " fled to what is now Eritrea. Most were culturally and linguistically assimilated into the local Tigrinya culture, with the notable exception of the ": null
    },
    {
        "Bilen": "bilen people"
    },
    {
        ". Mussie Tesfagiorgis : Eritrea . ABC-CLIO. p. 33-34 Yet another people that arrived after the fall of Aksum were the ": null
    },
    {
        "Cushitic-speaking": "cushitic languages"
    },
    {
        " Saho": "saho people"
    },
    {
        ", who had established themselves in the highlands until the 14th century. Dan Connell, Tom Killion : Historical Dictionary of Eritrea . The Scarecrow. Lanham, Toronto, Plymouth. p. 54     Meanwhile, Eritrea witnessed a very slow, but steady intrusion of Islam. Muslims had already reached Eritrea in 613/615, during the ": null
    },
    {
        "First Hijra": "first hijra"
    },
    {
        ". In 702, Muslim pirates conquered the ": null
    },
    {
        "Dahlak islands": "dahlak archipelago"
    },
    {
        ". In 1060, a Yemeni dynasty fled to Dahlak and proclaimed the ": null
    },
    {
        "Sultanate of Dahlak": "sultanate of dahlak"
    },
    {
        ", which would last for almost 500 years. This sultanate also had sovereignty over the port town of ": null
    },
    {
        "Massawa": "massawa"
    },
    {
        ". Dan Connell, Tom Killion : Historical Dictionary of Eritrea . The Scarecrow. Lanham, Toronto, Plymouth. p. 159-160       The 15th century saw the rise of a new kingdom, ": null
    },
    {
        "Medri Bahri": "medri bahri"
    },
    {
        ". Richard Pankhurst : The Ethiopian Borderlands: Essays in Regional History from Ancient Times to the End of the 18th Century . Red Sea. Lawrenceville. Previously, this area has been known as Maikele Bahr , but during the reign of emperor ": null
    },
    {
        "Zara Yaqob": "zara yaqob of ethiopia"
    },
    {
        " it was rebranded as the domain of the Bahr Negash, the ": null
    },
    {
        "Medri Bahri": "medri bahri"
    },
    {
        " . Taddesse Tamrat, Church and State in Ethiopia , p. 74. Daniel Kendie, The Five Dimensions of the Eritrean Conflict 1941–2004: Deciphering the Geo-Political Puzzle. United States of America: Signature Book Printing, Inc., 2005, pp. 17–8. With its capital at ": null
    },
    {
        "Debarwa": "debarwa"
    },
    {
        ", Edward Denison, Guang Yu Ren, Naigzy Gebremedhin Asmara: Africas secret modernist city, 2003. the states main provinces were ": null
    },
    {
        "Hamasien": "hamasien"
    },
    {
        ", ": null
    },
    {
        "Serae": "serae"
    },
    {
        " and ": null
    },
    {
        "Akele Guzai": "akele guzai"
    },
    {
        ". In 1879, Medri Bahri was annexed by ": null
    },
    {
        "Ras Alula": "ras alula"
    },
    {
        ", who defended the area against the Italians until they finally occupied it in 1889. Dan Connell, Tom Killion : Historical Dictionary of Eritrea . The Scarecrow. Lanham, Toronto, Plymouth. pp. 66-67     The ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " made multiple advances further inland ": null
    },
    {
        "conquering Medri Bahri": "ottoman conquest of habesh"
    },
    {
        " in the 16th century.  The Ottoman state maintained only tenuous control over much of the territory over the following centuries until it was re-conquered under the ": null
    },
    {
        "Muhammad Ali dynasty": "muhammad ali dynasty"
    },
    {
        " in the 19th century.     In southern Eritrea, the ": null
    },
    {
        "Aussa Sultanate": "aussa sultanate"
    },
    {
        " succeeded the earlier ": null
    },
    {
        "Imamate of Aussa": "imamate of awsa"
    },
    {
        ". The latter polity had come into existence in 1577, when ": null
    },
    {
        "Muhammed Jasa": "muhammed jasa"
    },
    {
        " moved his capital from ": null
    },
    {
        "Harar": "harar"
    },
    {
        " to ": null
    },
    {
        "Aussa": "asaita"
    },
    {
        " with the split of the ": null
    },
    {
        "Adal Sultanate": "adal sultanate"
    },
    {
        " into Aussa and the ": null
    },
    {
        "Sultanate of Harar": "sultanate of harar"
    },
    {
        ". At some point after 1672, Aussa declined in conjunction with Imam ": null
    },
    {
        "Umar Din bin Adams": "umar din bin adam"
    },
    {
        "recorded ascension to the throne. Mordechai Abir, The era of the princes: the challenge of Islam and the re-unification of the Christian empire, 1769–1855 , p. 23 n.1. In 1734, the ": null
    },
    {
        "Afar": "afar people"
    },
    {
        " leader ": null
    },
    {
        "Kedafu": "kedafu"
    },
    {
        ", head of the Mudaito clan, seized power and established the ": null
    },
    {
        "Mudaito Dynasty": "mudaito dynasty"
    },
    {
        ". Mordechai Abir, The era of the princes: the challenge of Islam and the re-unification of the Christian empire, 1769–1855 , pp. 23–26.  This marked the start of a new and more sophisticated polity that would last into the colonial period.                 The boundaries of the present-day Eritrea nation state were established during the ": null
    },
    {
        "Scramble for Africa": "scramble for africa"
    },
    {
        ". In 1869 ": null
    },
    {
        "Ullendorff, Edward": "edward ullendorff"
    },
    {
        ". The Ethiopians: An Introduction to Country and People 2nd  ed., p. 90. ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        " , 1965r. 1889–1913It.  Ucciallir.  1889–19131888enlarged with northern Ethiopias regionsAfrica Orientale Italianafirst daughter-colony": null
    },
    {
        "ma": "ma"
    },
    {
        "rld War ": "rld war"
    },
    {
        "38–19411936–19": "38–19411936–19"
    },
    {
        "the organization was even backed up by the government of Italylike what happened with ": null
    },
    {
        "Italian Somalia": "italian somalia"
    },
    {
        "of Asmara and Massawa1947New York: HarperCollins, 2005New York: ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ", 1996": null
    },
    {
        "Woodrow Wilson International Center for Scholars": "woodrow wilson international center for scholars"
    },
    {
        " Cold War International History Project Working Paper 13, May 1995the Ethiopians supported by the Unionist Party played a big role in itUNCUPBMAIn the first car were armed Police, in the 2nd was the Asmara Administrator with his Arabic translator, in the third were the Mufti and the Abuna and in the 4th was the Asmara & Hamassein Judge and the vice of the AbunasimilarlyUNChristians and MoslemsVincluding commerce": null
    },
    {
        "fore 19": "fore 19"
    },
    {
        "ELM": null
    },
    {
        "litic": "litic"
    },
    {
        "ELFEPLFentered in The Congressional Record, May 6, 1992PGEissued on April 7, 1992UNDPI 1996, 159September 1, 199324 Apr. 1993Eritrean language24 Apr. 199327 Apr. 199330 Apr. 1993Observer 28 March 1993Addis Tribune 3 Dec. 1999PFDJUNMEEEEBCthe flash point of the conflict": null
    },
    {
        "litant gro": "litant gro"
    },
    {
        "IMG": null
    }
]