[
    {
        "     When studying the history of Central America one must first clarify just what Central America is. Today it is commonly taken to include ": null
    },
    {
        "Guatemala": "guatemala"
    },
    {
        ", ": null
    },
    {
        "Belize": "belize"
    },
    {
        ", ": null
    },
    {
        "El Salvador": "el salvador"
    },
    {
        ", ": null
    },
    {
        "Honduras": "honduras"
    },
    {
        ", ": null
    },
    {
        "Nicaragua": "nicaragua"
    },
    {
        ", ": null
    },
    {
        "Costa Rica": "costa rica"
    },
    {
        ", and ": null
    },
    {
        "Panama": "panama"
    },
    {
        ". This definition matches modern political borders. However, in some senses and at some times Central America begins in Mexico, at the ": null
    },
    {
        "Isthmus of Tehuantepec": "isthmus of tehuantepec"
    },
    {
        ", and the former country of ": null
    },
    {
        "Yucatán": "yucatán"
    },
    {
        " was part of Central America. At the other end, before its independence in 42 Panama was politically and culturally part of the South American country of ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        ", or its predecessors. At times English-speaking ": null
    },
    {
        "Belize": "belize"
    },
    {
        ", with a quite different history, has been considered as apart from Central America.     Long and narrow, Central America does not have an obvious center from a geographic point of view. While Guatemala has been historically and religiously a leader, other regions have been unwilling to be part of a confederation based in Guatemala. The geography has made the region hard to govern from any central point. The countries, furthermore, are more diverse than they appear at first glance. Some have a large indigenous or Native American population, others do not. Some El SalvadorBelize, Hondurasthe canalthe modern-day nation of ": null
    },
    {
        "Belize": "belize"
    },
    {
        "the treaty between Spain and The United Kingdom prohibited British colonies in the territorygranted by the kingdom of Spain to the British Crownnowadays part of Mexiconow part of Mexicoone for each stateor PUCA- Provincias Unidas De Centro-America in Spanishbetween 4242  Panama and Belize at the time were under separate ownership       ": null
    }
]