[
    {
        "   The recorded history of the Dominican Republic began when the ": null
    },
    {
        "Genoa": "republic of genoa"
    },
    {
        "-born navigator ": null
    },
    {
        "Christopher Columbus": "christopher columbus"
    },
    {
        ", working for the Spanish Crown, happened upon a large island in the region of the western Atlantic Ocean that later came to be known as the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        ". It was inhabited by the ": null
    },
    {
        "Taíno": "taíno"
    },
    {
        ", an ": null
    },
    {
        "Arawak": "arawak"
    },
    {
        "an people, who variously called their island Ayiti, Bohio, or Quisqueya . Columbus promptly claimed the island for the ": null
    },
    {
        "Spanish Crown": "spanish empire"
    },
    {
        ", naming it La Isla Española , later Latinized to ": null
    },
    {
        "Hispaniola": "hispaniola"
    },
    {
        ". What would become the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        " was the Spanish ": null
    },
    {
        "Captaincy General of Santo Domingo": "captaincy general of santo domingo"
    },
    {
        " until 1821, except for a time as a ": null
    },
    {
        "French colony": "era de francia"
    },
    {
        " from 1795 to 1809. It was then part of a ": null
    },
    {
        "unified Hispaniola": "unification of hispaniola"
    },
    {
        " with ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        " from 1822 until 1844. In 1844, Dominican independence was proclaimed and the republic, which was often known as Santo Domingo until the early 20th century, maintained its independence except for a short ": null
    },
    {
        "Spanish occupation": "spanish occupation of the dominican republic"
    },
    {
        " from 1861 to 1865 and ": null
    },
    {
        "occupation by the United States": "united states occupation of the dominican republic"
    },
    {
        " from 1916 to 1924.          The ": null
    },
    {
        "Taíno people": "taíno people"
    },
    {
        " called the island Quisqueya and Ayiti . At the time of Columbus arrival in 1492, the islands territory consisted of five chiefdoms: Marién, Maguá, Maguana, ": null
    },
    {
        "Jaragua": "jaragua, hispaniola"
    },
    {
        ", and Higüey. These were ruled respectively by  cacique s Guacanagarix, Guarionex, Caonabo, Bohechío, and Cayacoa.                 ": null
    },
    {
        "Christopher Columbus": "christopher columbus"
    },
    {
        " reached the island of Hispañola on his ": null
    },
    {
        "first voyage": "voyages of christopher columbus"
    },
    {
        ", in December 1492. On Columbus second voyage in 1493, the colony of ": null
    },
    {
        "La Isabela": "la isabela"
    },
    {
        " was built on the northeast shore. Isabela nearly failed because of hunger and disease. In 1496 ": null
    },
    {
        "Santo Domingo": "santo domingo"
    },
    {
        " was built and became the new capital. Here the New Worlds first cathedral was erected, and for a few decades, Santo Domingo was also the administrative heart of the expanding empire. Before they embarked on their prosperous endeavors, men like ": null
    },
    {
        "Hernán Cortés": "hernán cortés"
    },
    {
        " and ": null
    },
    {
        "Francisco Pizarro": "francisco pizarro"
    },
    {
        " lived and worked in Santo Domingo.     ": null
    },
    {
        "Caonabo": "caonabo"
    },
    {
        ", the cacique, , of ": null
    },
    {
        "Maguana": "san juan de la maguana"
    },
    {
        ", one of five Taino geographical divisions on Hispaniola, attacked Columbus on January 13, 1493. Shooting arrows and wounding a few Spaniards, the Tainos halted the invaders collection of provisions for Columbuss return trip to Spain. Caonabo struck again when his forces attacked and burned a fort built by Columbus, killing forty Spaniards. During the last trip of Christopher Columbus, in 1495, the Taino leader Guarionex, supported by Caonabo and other Taino leaders, staged the ": null
    },
    {
        "Battle of La Vega Real": "battle of la vega real"
    },
    {
        " against the Spanish in 1495. But while more than ten thousand Tainos fought against the Spanish, they succumbed to the power of the Spanish weaponry.     When Guarionex attacked the Spanish again, in 1497, both he and Caonabo were caught by the Spanish and both shipped to Spain; on the journey Caonabo died—according to legend, of rage—and Guarionex drowned. His wife, ": null
    },
    {
        "Anacaona": "anacaona"
    },
    {
        ", moved to the Xaragua division, where her brother, Bohechio, was cacique. After Bohechios death, she became cacique and subsequently extended refuge and assistance to runaway enslaved Tainos and Africans.     One hundred thousand Tainos died from 1494–1496, half of them by their own hand through self-starvation, poison, leaps from cliffs, etc.  The conquistador-turned-priest ": null
    },
    {
        "Bartolomé de las Casas": "bartolomé de las casas"
    },
    {
        " wrote an eyewitness history of the Spanish incursion into the island of Hispaniola that reported the conquistadors almost feral misconduct:               Hundreds of thousands of Tainos living on the island were enslaved to work in gold mines. As a consequence of disease, forced labor, famine, and mass killings, by 1508, only 60,000 were still alive.  In 1501, the Spanish monarchs, ": null
    },
    {
        "Ferdinand I": "ferdinand ii of aragon"
    },
    {
        " and ": null
    },
    {
        "Isabella": "isabella of castille"
    },
    {
        ", first granted permission to the colonists of the Caribbean to import African slaves, who began arriving to the island in 1503. The first enslaved blacks were purchased in Lisbon, Portugal. Some had been transported there from the West African Guinea coast, and others had been born and raised in Portugal or Spain. Southern Spain and Portugal were multiethnic and multiracial regions long before the “discovery” of the New World, and many Africans, free and enslaved, participated in the Iberian Peninsulas conquest and colonization of the Americas.      In 1510, the first sizable shipment, consisting of 250 ": null
    },
    {
        "Black Ladinos": "black ladinos"
    },
    {
        ", arrived in Hispaniola from Spain. Eight years later African-born slaves arrived in the ": null
    },
    {
        "West Indies": "west indies"
    },
    {
        ". Many of the Africans brutally jammed into the ": null
    },
    {
        "slave ships": "slave ship"
    },
    {
        "had been the losers in Africas endemic and endless wars. Others were kidnapped from the coast or taken from villages inland.  The Colony of Santo Domingo was organized as the ": null
    },
    {
        "Royal Audiencia of Santo Domingo": "royal audiencia of santo domingo"
    },
    {
        " in 1511. ": null
    },
    {
        "Sugar cane": "sugar cane"
    },
    {
        " was introduced to Hispaniola from the ": null
    },
    {
        "Canary Islands": "canary islands"
    },
    {
        ", and the first sugar mill in the New World was established in 1516, on Hispaniola. Sugar Cane: Past and Present, Peter Sharpe  The need for a labor force to meet the growing demands of sugar cane cultivation led to an exponential increase in the importation of slaves over the following two decades. The sugar mill owners soon formed a new colonial elite and convinced the Spanish king to allow them to elect the members of the ": null
    },
    {
        "Real Audiencia": "real audiencia"
    },
    {
        " from their ranks. Poorer colonists subsisted by hunting the herds of wild cattle that roamed throughout the island and selling their hides. The enslaved population numbered between twenty and thirty thousand in the mid-sixteenth century and included mine, plantation, cattle ranch, and domestic laborers. A small Spanish ruling class of about twelve hundred monopolized political and economic power, and it used ordenanzas and violence to control the population of color.     In 1517, a guerrilla war between the colonizers and Taino and African forces was initiated by the Taino leader ": null
    },
    {
        "Enriquillo": "enriquillo"
    },
    {
        ". Descending from the ": null
    },
    {
        "Bahoruco Mountains": "baoruco mountain range"
    },
    {
        " with his troops, Enriquillo killed Spaniards, devastated farms and property, and took Africans back with him. The crown appointed General ": null
    },
    {
        "Francisco Barrionuevo": ":es:francisco de barrionuevo"
    },
    {
        ", a veteran of many battles in Spain, as captain to lead the war against Enriquillo. Barrionuevo opted to negotiate, realizing that violence had not worked and that resources for more armed actions were scarce. In 1533 he met Enriquillo on what is todays Cabrito Island, in the middle of Lake Jaragua and reached a peace agreement that granted Enriquillo and his troops freedom and land.     The first known armed rebellion of enslaved Africans occurred in 1521. On Christmas Eve two hundred enslaved workers fled the plantation of ": null
    },
    {
        "Diego Columbus": "diego columbus"
    },
    {
        ", located on the Isabela River near Santo Domingo, and headed south toward ": null
    },
    {
        "Azua": "azua, dominican republic"
    },
    {
        ". Others from plantations in Nigua, San Cristóbal, and Baní joined them on the march, burning plantations and killing several Spaniards. According to official records, they stopped next at the Ocoa plantation, with the intention of killing more whites and recruiting more enslaved blacks and Indians, then moved on to Azua. After being informed of the insurrection, Columbus recruited a small army, which, mounted on horseback and shouting their battle cry ": null
    },
    {
        "Santiago": "santiago!"
    },
    {
        " , headed south in pursuit.  In the meantime, the rebels entered the plantation of Melchor de Castro near the Nizao River where they killed one Spaniard, sacked the house, and freed more enslaved persons, including Indians. Columbuss army confronted the rebels at the Nizao, the Spanish shooting at them with guns and the rebels responding by throwing stones and logs. Five days later the Spanish attacked again. They caught several rebels, whom they executed by lynching along the colonial road, but many more had escaped to face later attacks, in which more were killed or apprehended.     By the mid-sixteenth century, there were an estimated seven thousand ": null
    },
    {
        "maroons": "maroon"
    },
    {
        " beyond Spanish control on Hispaniola. The Bahoruco Mountains were their main area of concentration, although Africans had escaped to other areas of the island as well. From their refuges, they descended to attack the Spanish. In 1546 the slave Diego de Guzman led an insurrection that swept through the San Juan de la Maguana area, after which he escaped to the Bahoruco Mountains. After his capture, de Guzman was savagely killed and some of his fellow rebels were burned alive, others burned with branding irons, others hung, and others had their feet cut off. The most extended insurrection was led by ": null
    },
    {
        "Sebastián Lemba": "sebastián lemba"
    },
    {
        ". For fifteen years Lemba attacked Spanish towns, plantations, and farms with an army of four hundred Africans. Lemba was eventually caught and was executed in 1548. His head was mounted on the door that connected the Fort of San Gil to Fort Conde, and for centuries it was called the Lemba door . Insurrections continued to burden the colonys tranquility and economy. From 1548 to the end of the sixteenth century, maroons attacked farms, plantations, and villages. By 1560 the colony was unable to recruit and pay troops to pursue the rebels.     While sugar cane dramatically increased Spains earnings on the island, large numbers of the newly imported slaves fled into the nearly impassable mountain ranges in the islands interior, joining the growing communities of cimarrónes—literally, wild animals. By the 1530s,  cimarrón  bands had become so numerous that in rural areas the Spaniards could only safely travel outside their plantations in large armed groups. Beginning in the 1520s, the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        " was raided by increasingly numerous French pirates. In 1541 Spain authorized the construction of Santo Domingos fortified wall, and in 1560 decided to restrict sea travel to enormous, well-armed convoys. In another move, which would destroy ": null
    },
    {
        "Hispaniolas": "hispaniola"
    },
    {
        "sugar industry, in 1561 ": null
    },
    {
        "Havana": "havana"
    },
    {
        ", more strategically located in relation to the ": null
    },
    {
        "Gulf Stream": "gulf stream"
    },
    {
        ", was selected as the designated stopping point for the merchant  flotas , which had a royal monopoly on commerce with the Americas. In 1564, the islands main inland cities ": null
    },
    {
        "Santiago de los Caballeros": "santiago de los caballeros"
    },
    {
        " and ": null
    },
    {
        "Concepción de la Vega": "concepción de la vega"
    },
    {
        " were destroyed by an earthquake. In the 1560s English pirates joined the French in regularly raiding Spanish shipping in the Americas.      With the conquest of the American mainland, Hispaniola quickly declined. Most Spanish colonists left for the silver-mines of ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " and ": null
    },
    {
        "Peru": "peru"
    },
    {
        ", while new immigrants from Spain bypassed the island. Agriculture dwindled, new imports of slaves ceased, and white colonists, free blacks, and slaves alike lived in poverty, weakening the racial hierarchy and aiding intermixing, resulting in a population of predominantly mixed Spaniard, African, and Taíno descent. Except for the city of Santo Domingo, which managed to maintain some legal exports, Dominican ports were forced to rely on contraband trade, which, along with livestock, became the sole source of livelihood for the island dwellers.     In 1586, ": null
    },
    {
        "Sir Francis Drake": "francis drake"
    },
    {
        " captured the city of Santo Domingo, collecting a ransom for its return to Spanish rule. A third of the city lay in ruins and almost all of its civic, military and religious buildings had been either damaged or destroyed. During his occupation of Santo Domingo, Drake sent a black boy with a message to the governor. A ": null
    },
    {
        "Hidalgo": "hidalgo"
    },
    {
        " who was standing by considered this an insult and ran the boy through with his sword.  The English commander, infuriated, proceeded to the spot where the murder had been committed and had two friars hanged. He told the governor that he would hang two more friars every day until the murderer had been executed. The murderer was hanged by his own countrymen.     In 1592, ": null
    },
    {
        "Christopher Newport": "christopher newport"
    },
    {
        " attacked the town of Azua on the bay of Ocoa, which was taken and plundered.  In 1595 the Spanish, frustrated by the twenty-year ": null
    },
    {
        "rebellion of their Dutch subjects": "eighty years warfirst forty years"
    },
    {
        ", closed their home ports to rebel shipping from the Netherlands cutting them off from the critical salt supplies necessary for their herring industry. The Dutch responded by sourcing new salt supplies from Spanish America where colonists were more than happy to trade. So large numbers of Dutch traders/pirates joined their English and French brethren on the Spanish main.          In 1605, Spain was infuriated that Spanish settlements on the northern and western coasts of the island were carrying out large scale and illegal trade with the Dutch, who were at that time fighting a war of independence against Spain in Europe, and the English, a very recent enemy state, and so decided to forcibly resettle their inhabitants closer to the city of Santo Domingo. Knight, Franklin, The Caribbean: The Genesis of a Fragmented Nationalism, 3rd ed. p.54 New York, Oxford University Press 1990 This action, known as the Devastaciones de Osorio, proved disastrous; more than half of the resettled colonists died of starvation or disease, over 100,000 cattle were abandoned, and many slaves escaped. Rough Guide to the Dominican Republic, Pg. 352 Five of the existing thirteen settlements on the island were brutally razed by Spanish troops – many of the inhabitants fought, escaped to the jungle, or fled to the safety of passing Dutch ships. The settlements of La Yaguana, and Bayaja, on the west and north coasts respectively of modern-day Haiti were burned, as were the settlements of Monte Cristi and Puerto Plata on the north coast and San Juan de la Maguana in the southwestern area of the modern-day Dominican Republic.     The withdrawal of the colonial government from the northern coastal region opened the way for French ": null
    },
    {
        "buccaneer": "buccaneer"
    },
    {
        "s, who had a base on ": null
    },
    {
        "Tortuga Island": "tortuga"
    },
    {
        ", off the northwest coast of present-day Haiti, to settle on Hispaniola in the mid-seventeenth century. Although the Spanish destroyed the buccaneers settlements several times, the determined French would not be deterred or expelled. The creation of the ": null
    },
    {
        "French West India Company": "french west india company"
    },
    {
        " in 1664 signalled Frances intention to colonize western Hispaniola. Intermittent warfare went on between French and Spanish settlers over the next three decades; however, Spain, hard-pressed by warfare in Europe, could not maintain a garrison in Santo Domingo sufficient to secure the entire island against encroachment. In 1697, under the ": null
    },
    {
        "Treaty of Ryswick": "treaty of ryswick"
    },
    {
        ", Spain ceded the western third of the island to France.     In 1655, ": null
    },
    {
        "Oliver Cromwell": "oliver cromwell"
    },
    {
        " dispatched a fleet, commanded by Admiral ": null
    },
    {
        "Sir William Penn": "sir william penn"
    },
    {
        ", to conquer Santo Domingo. A Spanish defending force of perhaps 400–600 men, mostly militia, repulsed a landing force of 9,000 men.  Yet although the English had failed to overrun the island, they nevertheless ": null
    },
    {
        "seized nearby Jamaica": "invasion of jamaica"
    },
    {
        ", and other foreign strongholds subsequently began multiplying throughout the West Indies. Madrid sought to contest such encroachments by using Santo Domingo as an advance military base, but Spanish power was by now too depleted to expel the rival colonies. The city itself was furthermore subjected to a ": null
    },
    {
        "smallpox": "smallpox"
    },
    {
        " epidemic, cacao blight, and hurricane in 1666; another storm two years later; a second epidemic in 1669; a third hurricane in September 1672; plus an earthquake in May 1673 that killed two dozen residents.      During this seventeenth century of misery , the Spanish on Hispaniola continued to persecute maroons living peacefully in the islands interior mountains and valleys. With little to show for it, this policy of armed harassment added more public expense to a weak colonial economy, and the financial recovery of the Spanish colony in the eighteenth century led to increased slave insurrections and marronage.       The ": null
    },
    {
        "House of Bourbon": "house of bourbon"
    },
    {
        " replaced the ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        " in Spain in 1700 and introduced economic reforms that gradually began to revive trade in Santo Domingo. The crown progressively relaxed the rigid controls and restrictions on commerce between Spain and the colonies and among the colonies. The last flotas sailed in 1737; the monopoly port system was abolished shortly thereafter. By the middle of the century, the population was bolstered by emigration from the ": null
    },
    {
        "Canary Islands": "canary islands"
    },
    {
        ", resettling the northern part of the colony and planting tobacco in the ": null
    },
    {
        "Cibao Valley": "cibao valley"
    },
    {
        ", and importation of slaves was renewed. The population of Santo Domingo grew from about 6,000 in 1737 to approximately 125,000 in 1790. Of this number, about 40,000 were white landowners, about 25,000 were mulatto freedmen, and some 60,000 were slaves. However, it remained poor and neglected, particularly in contrast with its western, French neighbor ": null
    },
    {
        "Saint-Domingue": "saint-domingue"
    },
    {
        ", which became the wealthiest colony in the New World and had half a million inhabitants.  The Spanish settlers, whose blood by now was mixed with that of Tainos, Africans and Canary Guanches, said to themselves: It does not matter if the French are richer than us, we are still the true inheritors of this island. In our veins runs the blood of the heroic conquistadores who won this island of ours with sword and blood.      When the ": null
    },
    {
        "War of Jenkins Ear": "war of jenkins ear"
    },
    {
        " between Spain and Britain broke out in 1739, Spanish privateers, particularly from Santo Domingo, began to troll the Caribbean Sea, a development that lasted until the end of the eighteenth century. During this period, Spanish privateers from Santo Domingo sailed into enemy ports looking for ships to plunder, thus harming commerce with Britain and New York. As a result, the Spanish obtained stolen merchandise—foodstuffs, ships, enslaved persons—that were sold in Hispaniolas ports, with profits accruing to individual sea raiders. These practices of human traffic and terror facilitated capital accumulation. The revenue acquired in these acts of piracy was invested in the economic expansion of the colony and led to repopulation from Europe.      Dominicans constituted one of the many diverse units which fought alongside Spanish forces under ": null
    },
    {
        "Bernardo de Gálvez": "bernardo de gálvez"
    },
    {
        " during the ": null
    },
    {
        "conquest of British West Florida": "gulf coast campaign"
    },
    {
        " .       As restrictions on colonial trade were relaxed, the colonial elites of St. Domingue offered the principal market for Santo Domingos exports of beef, hides, mahogany, and tobacco. With the outbreak of the ": null
    },
    {
        "Haitian Revolution": "haitian revolution"
    },
    {
        " in 1791, the rich urban families linked to the colonial bureaucracy fled the island, while most of the rural hateros remained, even though they lost their principal market. Although the population of Spanish Santo Domingo was perhaps one-fourth that of French Saint-Domingue, this did not prevent the Spanish king from launching an invasion of the French side of the island in 1793, attempting to take advantage of the chaos sparked by the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ".  French forces checked Spanish progress toward Port-au-Prince in the south, but the Spanish pushed rapidly through the north, most of which they occupied by 1794.     Although the Spanish military effort went well on Hispaniola, it did not so in ": null
    },
    {
        "Europe": "war of the pyrenees"
    },
    {
        ". The Spanish colony was ceded first to France in 1795 as part of the ": null
    },
    {
        "Treaty of Basel": "peace of basel"
    },
    {
        " between the defeated Spanish and the French, then it was invaded by the British in 1796. Five years later, black slaves in rebellion invaded from Saint-Domingue. The devastated Spanish-speaking colony was then occupied by the French in 1802, in spite of the dramatic defeat of ": null
    },
    {
        "Napoleons": "napoleon"
    },
    {
        " forces at the hands of the former French slaves who proclaimed the independent Republic of ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        " in 1804. Santo Domingo was invaded again by Haitians in 1805 and then yet again by the British in 1809. The Spanish reclaimed it later that year but found the colony in economic ruins and demographic decline.          The population of the new Spanish colony stood at approximately 104,000. Of this number, about 30,000 were slaves, and the rest a mixture of white, Indian, and black. The European Spaniards were few, and consisted principally of ": null
    },
    {
        "Catalans": "catalans"
    },
    {
        ".  In 1812, a group of blacks and mulattoes staged a rebellion, with the goal of annexation to the Republic of Haiti. On August 15 and 16, mulattoes José Leocadio, Pedro Seda, and Pedro Henriquez, with other conspirators, attacked the Mendoza hacienda in Mojarra in the municipality of Guerra near the capital. Seda and Henriquez were apprehended and executed; Leocadio was captured within days, hanged, dismembered, and boiled in oil. A year later enslaved laborers in the rural community El Chavón also rebelled, but they were quickly caught and executed.     Spains hold over Santo Domingo remained precarious. The arrival of the fugitive ": null
    },
    {
        "Simón Bolívar": "simón bolívar"
    },
    {
        " and his followers in Haiti in 1815 alarmed the Spanish authorities in Santo Domingo. Following the rebellion of the Army in Spain during 1820, which restored the liberal constitution, some of the colonial administrators in Santo Domingo broke with the mother country; and on December 1, 1821, the Spanish Lieutenant Governor, ": null
    },
    {
        "José Núñez de Cáceres": "josé núñez de cáceres"
    },
    {
        ", proclaimed the independence of ": null
    },
    {
        "Spanish Haiti": "republic of spanish haiti"
    },
    {
        " .     Dominican leaders—recognizing their vulnerability both to Spanish and to Haitian attack and also seeking to maintain their slaves as property—attempted to annex themselves to ": null
    },
    {
        "Gran Colombia": "gran colombia"
    },
    {
        ". While this request was in transit, ": null
    },
    {
        "Jean-Pierre Boyer": "jean-pierre boyer"
    },
    {
        ", the ruler of Haiti, invaded Santo Domingo on February 9 with a 10,000-man army. Having no capacity to resist, Núñez de Cáceres surrendered the capital on February 9, 1822.          The twenty-two-year Haitian occupation that followed is recalled by Dominicans as a period of brutal military rule, though the reality is more complex. It led to large-scale land expropriations and failed efforts to force production of export crops, impose military services, restrict the use of the Spanish language, and eliminate traditional customs such as ": null
    },
    {
        "cockfighting": "cockfighting"
    },
    {
        ". It reinforced Dominicans perceptions of themselves as different from Haitians in language, race, religion and domestic customs . Moya Pons, Frank Between Slavery and Free Labor: The Spanish-speaking Caribbean in the 19th Century. Baltimore; Johns Hopkins University Press 1985 Yet, this was also a period that definitively ended slavery as an institution in the eastern part of the island.     Haitis constitution forbade whites from owning land, and the major landowning families were forcibly deprived of their properties. Most emigrated to the Spanish colonies of ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        " and ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        ", or to independent Gran Colombia, usually with the encouragement of Haitian officials, who acquired their lands. The Haitians, who associated the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        " with the French slave-masters who had exploited them before independence, confiscated all church property, deported all foreign clergy, and severed the ties of the remaining clergy to the ": null
    },
    {
        "Vatican": "holy see"
    },
    {
        ". ": null
    },
    {
        "Santo Domingos university": "universidad santo tomás de aquino"
    },
    {
        ", the oldest in the Western Hemisphere, lacking students, teachers, and resources, closed down. In order to receive diplomatic recognition from ": null
    },
    {
        "France": "france"
    },
    {
        ", Haiti was forced to pay an indemnity of 150 million francs to the former French colonists, which was subsequently lowered to 60 million francs, and Haiti imposed heavy taxes on the eastern part of the island. Since Haiti was unable to adequately provision its army, the occupying forces largely survived by commandeering or confiscating food and supplies at gunpoint.     Attempts to redistribute land conflicted with the system of communal land tenure , which had arisen with the ranching economy, and newly emancipated slaves resented being forced to grow cash crops under Boyers Code Rural. Terrenos comuneros arose because of scarce population, low value of the land, the absence of officials qualified to survey the lands, and the difficulty of dividing up the ranch in such a way that each would receive a share of the grasslands, forests, streams, palm groves, and small agricultural plots that, only when combined, made possible the exploitation of the ranch . Hoetink, The Dominican People: Notes for a Historical Sociology, transl. Stephen Ault, p. 83. Johns Hopkins Press: Baltimore, 1982 In rural areas, the Haitian administration was usually too inefficient to enforce its own laws. It was in the city of Santo Domingo that the effects of the occupation were most acutely felt, and it was there that the movement for independence originated.       ": null
    }
]