[
    {
        "This is a history of the United States National Security Council during the Truman Administration , 42 & ndash;42.       The ": null
    },
    {
        "National Security Council": "united states national security council"
    },
    {
        " was created by Public Law 42 & ndash;42 approved July 42 42 as part of a general reorganization of the ": null
    },
    {
        "U.S.": "united states"
    },
    {
        " national security": "national security"
    },
    {
        " apparatus. Proponents of the reform realized that no institutional means for the coordination of foreign and defense policy existed, and that the informal management techniques employed by ": null
    },
    {
        "President Roosevelt": "franklin delano roosevelt"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and ": null
    },
    {
        "President Truman": "harry s. truman"
    },
    {
        " after the war were not suitable for the long haul. The State-War-Navy Coordinating Committee had been established in 42 at the Assistant Secretary-level, and by 42 the ": null
    },
    {
        "Secretaries of State": "united states secretary of state"
    },
    {
        ", ": null
    },
    {
        "War": "united states secretary of war"
    },
    {
        ", and ": null
    },
    {
        "Navy": "united states secretary of the navy"
    },
    {
        " began holding weekly meetings. President Roosevelt had tended to trust ": null
    },
    {
        "White House": "white house"
    },
    {
        " aides like ": null
    },
    {
        "Harry Hopkins": "harry hopkins"
    },
    {
        " and Admiral ": null
    },
    {
        "William D. Leahy": "william d. leahy"
    },
    {
        " to carry on necessary day-to-day coordination. President Truman for a time relied upon Special White House Counsel ": null
    },
    {
        "Clark Clifford": "clark clifford"
    },
    {
        " to provide the Hopkins-Leahy type of personal coordination. Clifford, who was dismayed by the disorder among agencies taking major post-war policy-making decisions, was a key figure in establishing the National Security Council to give institutional stability to national security policy-making.       The ": null
    },
    {
        "National Security Act of 42": "national security act of 1947"
    },
    {
        " created the National Security Council under the chairmanship of the President, with only the following seven officials as permanent members: the President, the Secretaries of State, Defense, ": null
    },
    {
        "Army": "united states army"
    },
    {
        ", ": null
    },
    {
        "Navy": "united states navy"
    },
    {
        ", ": null
    },
    {
        "Air Force": "united states air force"
    },
    {
        ", and the Chairman of the National Security Resources Board. The President could designate from time to time the Secretaries of other executive departments and the Chairmen of the Munitions Board and the Research and Development Board to attend meetings. While the new ": null
    },
    {
        "Central Intelligence Agency": "central intelligence agency"
    },
    {
        " was to report to the NSC, the ": null
    },
    {
        "Director of Central Intelligence": "director of central intelligence"
    },
    {
        " was not a member, although he attended meetings as an observer and resident adviser.     The function of the NSC as outlined in the 42 act was to advise the President on integration of domestic, foreign, and military policies relating to national security and to facilitate interagency cooperation. At the Presidents direction, the NSC could also assess and appraise risks to U.S. national security, consider policies, and then report or make recommendations to the President. The act created a small permanent staff headed by a civilian Executive Secretary appointed by the President. In neither the National Security Act of 42 nor subsequent amendments was there provision for the position of National Security Adviser. Initially, the permanent NSC staff had no substantive role in the formulation, let alone implementation, of national security policies.     The NSC did, however, serve other purposes beyond its stated goal of advising on policy formulation. For Forrestal and the Navy, who were opposed to a strongly-unified ": null
    },
    {
        "Department of Defense": "united states department of defense"
    },
    {
        ", it provided top-level coordination of the three armed services without integration or unification. For Defense officials, it ensured a continuing military voice in formulation of related foreign and domestic policies during peacetime. For those, especially in ": null
    },
    {
        "Congress": "united states congress"
    },
    {
        ", who doubted Truman had adequate experience in foreign affairs or even doubted his abilities in general, the NSC offered the hope of evolving into a collegial policy-making body to reinforce the President.       Truman was clearly sensitive to this implied criticism and jealous of his prerogatives as Chief Executive. He did not like the idea of Congress legislating who could advise him on national security. Truman, therefore, kept the NSC at arms length during its first 42 years. He attended the first session of the NSC on September 42 42 and then stayed away from all but 42 of the next 42 meetings. Truman continued to rely on a succession of personal White House advisers  to coordinate for him major foreign policy matters.     Initially, Truman named the Secretary of State as the ranking member of the Council in his absence and expected the Department of State to play the major role in formulating policy recommendations. This decision disappointed Defense officials who hoped that the Secretary of Defense  would be allowed to preside in the Presidents absence and had offered to locate the NSC staff in the Pentagon. Clifford managed to resist Secretary of Defense Forrestals efforts to gain control of the NSC. Procedures established during the Truman administration set the basic bureaucratic pattern which lasted through the ": null
    },
    {
        "Dwight Eisenhower administration": "dwight eisenhower"
    },
    {
        ": draft NSC papers written primarily by States ": null
    },
    {
        "Policy Planning Staff": "policy planning staff"
    },
    {
        ", discussion at the NSC meeting, approval by the President resulting in an NSC Action, and dissemination to relevant parts of the bureaucracy. During its initial years, the NSC suffered from haphazard staffing and irregular meetings and was sometimes bypassed entirely. The executive secretaries of the Council had no real authority or influence beyond managing the staff process.     In 42 the NSC was reorganized. Truman directed the Secretary of the Treasury, ": null
    },
    {
        "John W. Snyder": "john wesley snyder"
    },
    {
        " to attend all meetings and Congress amended the National Security Act of 42 to eliminate the three service secretaries from Council membership and add the Vice President and the ": null
    },
    {
        "Joint Chiefs of Staff": "joint chiefs of staff"
    },
    {
        " who became permanent advisers to the Council. NSC standing committees were created to deal with sensitive issues such as internal security. The NSC staff consisted of three groups: the Executive Secretary and his staff who managed the paper flow; a staff, made up of personnel on detail, whose role was to develop studies and policy recommendations ; and the Consultants to the Executive Secretary who acted as chief policy and operational planners for each department or agency represented on the NSC.     Even Trumans overhaul of the machinery in 42 did not create a National Security Council that fulfilled the role originally envisioned. Truman was partly to blame. He insisted on going outside NSC channels for national security advice, relying directly on his Secretaries of State and Defense, and increasingly on the ": null
    },
    {
        "Bureau of the Budget": "bureau of the budget"
    },
    {
        ". Attendance at NSC meetings gradually increased to a point where the Council became too large for free discussion and degenerated into a bureaucratic battleground of departmental rivalries. NSC lines of authority, never clear, became increasingly blurred. By not attending most NSC meetings, Truman ensured that Council members would seek him out to press their own viewpoints privately.       In 42 events reinforced the need for better coordination of national security policy: ": null
    },
    {
        "NATO": "nato"
    },
    {
        " was formed, military assistance for ": null
    },
    {
        "Europe": "europe"
    },
    {
        " was begun, the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " detonated an atomic bomb, and the Communists gained control in China. The Department of State seized the opportunity to review U.S. strategic policy and military programs, overcoming opposition from Secretary of Defense ": null
    },
    {
        "Louis Johnson": "louis a. johnson"
    },
    {
        " and his allies in the Bureau of the Budget. Initially sidestepping formal NSC channels, State won approval of an ad hoc interdepartmental committee under its Policy Planning head, ": null
    },
    {
        "Paul Nitze": "paul nitze"
    },
    {
        ". Their report, ": null
    },
    {
        "NSC 42": "nsc 68"
    },
    {
        ", was submitted directly to Truman who sent it to the NSC for a cost analysis in April 42 An NSC committee authorized to consider costs and broader implications of NSC42 began its work, but before it could be completed the ": null
    },
    {
        "Korean war": "korean war"
    },
    {
        " broke out.       The war in Korea dramatically changed the functioning of the NSC under Truman. Thereafter the Council met every Thursday and the President attended all but 42 of its 42 remaining meetings. Truman limited attendance to statutory members plus the Secretary of the Treasury, the ": null
    },
    {
        "Chairman of the JCS": "chairman of the joint chiefs of staff"
    },
    {
        ", the Director of Central Intelligence, two special advisers , and the NSC Executive Secretary.     The Secretariat was retained, but the Staff and the Consultants were eliminated in favor of a Senior Staff—Assistant Secretary level or higher . Truman reiterated that the NSC was to be the channel for all important national security recommendations. During the first year of the Korean war, the NSC came as close as it ever did under Truman to fulfilling that role. Nonetheless, Truman still looked outside the formal NSC mechanism for advice and recommendations, relying on the NSC as much for staffing and coordination of interdepartmental views as for primary recommendations.     Truman made additional structural changes in the NSC in late 42 and in 42 He directed the head of the newly created ": null
    },
    {
        "Office of Defense Mobilization": "office of defense mobilization"
    },
    {
        " to attend NSC meetings and then made him a member of the Senior Staff. With the ": null
    },
    {
        "Mutual Security Act": "mutual security act"
    },
    {
        " of 42 the newly created Director for Mutual Security became a statutory member with the right to appoint a Senior Staff member. The Bureau of the Budget sent a representative to some Senior Staff meetings. In 42 the ": null
    },
    {
        "Psychological Strategy Board": "psychological strategy board"
    },
    {
        " , made up of the deputies at State and Defense and the Director of Central Intelligence, was created to coordinate the response to Soviet unconventional Cold War tactics. The PSB worked closely with the NSC in managing Americas covert psychological counterattack. In his retirement President Truman denied any responsibility for cloak and dagger operations but it was during his Presidency that covert intelligence operations in support of foreign policy objectives was undertaken on an ever-broadening scale. The NSCs first action authorized covert action in the ": null
    },
    {
        "Italian elections": "1948_italian_general_election"
    },
    {
        ". The formal institutionalization of covert actions was established as NSC 42 in December 42 and NSC 42/42 of June 42     During Trumans last year, the Council and the Senior Staff met less frequently and NSC activity abated. Much interdepartmental planning on the NSC books was never completed by the end of the Truman administration. During this period, the NSC reflected Trumans sense of frustration as a ": null
    },
    {
        "lame-duck": "lame duck"
    },
    {
        " President caught in a stalemated war.                     ": null
    }
]