[
    {
        "The modern state of ": null
    },
    {
        "Guinea": "guinea"
    },
    {
        " did not come into existence until 42 but the history of the area stretches back well before ": null
    },
    {
        "European colonization": "scramble for africa"
    },
    {
        ". Its current boundaries were determined during the colonial period by the ": null
    },
    {
        "Berlin Conference": "berlin conference"
    },
    {
        " and the French, who ruled Guinea until 42       What is now Guinea was on the fringes of the major ": null
    },
    {
        "West Africa": "west africa"
    },
    {
        "n empires. The ": null
    },
    {
        "Ghana Empire": "ghana empire"
    },
    {
        " is believed to be the earliest of these which grew on trade but contracted and ultimately fell due to the hostile influence of the ": null
    },
    {
        "Almoravids": "almoravids"
    },
    {
        ". It was in this period that Islam first arrived in the region.     The ": null
    },
    {
        "Sosso": "sosso"
    },
    {
        " kingdom briefly flourished in the void but the Islamic ": null
    },
    {
        "Mandinka": "mandinka people"
    },
    {
        " Mali Empire": "mali empire"
    },
    {
        " came to prominence when ": null
    },
    {
        "Soundiata Kéïta": "sundiata keita"
    },
    {
        " defeated the Sosso ruler, ": null
    },
    {
        "Sumanguru Kanté": "soumaoro kanté"
    },
    {
        " at the semi-historical ": null
    },
    {
        "Battle of Kirina": "battle of kirina"
    },
    {
        " in c. 42 The Mali Empire was ruled by ": null
    },
    {
        "Mansa": "mansa"
    },
    {
        " , the most famous being ": null
    },
    {
        "Kankou Moussa": "musa i of mali"
    },
    {
        ", who made a famous ": null
    },
    {
        "hajj": "hajj"
    },
    {
        " to Mecca in 42 Shortly after his reign the Mali Empire began to decline and was ultimately supplanted by its ": null
    },
    {
        "vassal": "vassal"
    },
    {
        " states in the 42th century.     The most successful of these was the ": null
    },
    {
        "Songhai Empire": "songhai empire"
    },
    {
        ", expanding its power from about 42 and eventually surpassing the Mali Empire in both territory and wealth. It continued to prosper until a civil war over succession followed the death of ": null
    },
    {
        "Askia Daoud": "askia daoud"
    },
    {
        " in 42 The weakened empire fell to invaders from ": null
    },
    {
        "Morocco": "morocco"
    },
    {
        " at the ": null
    },
    {
        "Battle of Tondibi": "battle of tondibi"
    },
    {
        " just 42 years later. The Moroccans proved unable to rule the kingdom effectively, however, and it split into many small kingdoms.       After the fall of the major West African empires, various kingdoms existed in what is now Guinea.          ": null
    },
    {
        "Fulani": "fulani"
    },
    {
        " Muslims migrated to ": null
    },
    {
        "Futa Jallon": "futa jallon"
    },
    {
        " in Central Guinea and established an Islamic state from 42 to 42 with a written constitution and alternate rulers.          The Wassoulou empire was a short-lived empire, led by ": null
    },
    {
        "Samory Touré": "samory touré"
    },
    {
        " in the predominantly ": null
    },
    {
        "Malinké": "mandinka people"
    },
    {
        " area of what is now upper ": null
    },
    {
        "Guinea": "guinea"
    },
    {
        " and southwestern ": null
    },
    {
        "Mali": "mali"
    },
    {
        " . It moved to ": null
    },
    {
        "Ivory Coast": "ivory coast"
    },
    {
        " before being conquered by the French.          The ": null
    },
    {
        "slave trade": "slave trade"
    },
    {
        " came to the coastal region of Guinea with European adventurers in the 42th century. Slavery had always been part of everyday life but the scale increased as slaves were exported to work elsewhere in the ": null
    },
    {
        "triangular trade": "triangular trade"
    },
    {
        ".     Guineas colonial period began with French military penetration into the area in the mid42th century. French domination was assured by the defeat in 42 of the armies of ": null
    },
    {
        "Samori Touré": "samori touré"
    },
    {
        ", Mansa of the ": null
    },
    {
        "Ouassoulou": "ouassoulou"
    },
    {
        " state and leader of Malinké descent, which gave France control of what today is Guinea and adjacent areas.     France negotiated Guineas present boundaries in the late 42th and early 42th centuries with the British for ": null
    },
    {
        "Sierra Leone": "sierra leone"
    },
    {
        ", the Portuguese for their Guinea colony , and ": null
    },
    {
        "Liberia": "liberia"
    },
    {
        ". Under the French, the country formed the ": null
    },
    {
        "Territory of Guinea": "french guinea"
    },
    {
        " within ": null
    },
    {
        "French West Africa": "french west africa"
    },
    {
        ", administered by a governor general resident in ": null
    },
    {
        "Dakar": "dakar"
    },
    {
        ". Lieutenant governors administered the individual colonies, including Guinea.       In 42 the ": null
    },
    {
        "French Fourth Republic": "french fourth republic"
    },
    {
        " collapsed due to political instability and its failures in dealing with its colonies, especially ": null
    },
    {
        "Indochina": "indochina"
    },
    {
        " and ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        ". The founding of a ": null
    },
    {
        "Fifth Republic": "french fifth republic"
    },
    {
        " was supported by the French people, while French President ": null
    },
    {
        "Charles de Gaulle": "charles de gaulle"
    },
    {
        " made it clear on 42 August 42 that Frances colonies were to be given a stark choice between more ": null
    },
    {
        "autonomy": "autonomous entity"
    },
    {
        " in a new ": null
    },
    {
        "French Community": "french community"
    },
    {
        " and immediate independence in the referendum to be held on 42 September 42     The other French colonies chose the former but Guinea — under the leadership of ": null
    },
    {
        "Ahmed Sékou Touré": "ahmed sékou touré"
    },
    {
        " whose ": null
    },
    {
        "Democratic Party of Guinea": "democratic party of guinea"
    },
    {
        " had won 42 of 42 seats in 42 territorial elections — voted overwhelmingly for independence. The French withdrew quickly, and on October 42 42 Guinea proclaimed itself a sovereign and independent republic, with Sékou Touré as president.            U.S. President Dwight D. Eisenhower was hostile to Touré, so the African nation quickly turned to the Soviet Union--making it the Kremlins first success story in Africa. Following Frances withdrawal, Guinea quickly aligned itself with the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and adopted socialist policies. This alliance was short lived, however, as Guinea moved towards a Chinese model of socialism. Nevertheless, President John F. Kennedy and his Peace Corps director ": null
    },
    {
        "Sargent Shriver": "sargent shriver"
    },
    {
        " tried even harder than the Kremlins ": null
    },
    {
        "Nikita Khrushchev": "nikita khrushchev"
    },
    {
        ". By 42 Guinea had shifted away from Moscow into a closer friendship with Washington. Philip E. Muehlenbeck, Kennedy and Toure: A success in personal diplomacy. Diplomacy and Statecraft 42 : 4242  Guinea relied more and more on aid and investment from the U.S. Even the relationship with France improved, after the election of ": null
    },
    {
        "Valéry Giscard dEstaing": "valéry giscard destaing"
    },
    {
        " as president, trade increased and the two countries exchanged diplomatic visits.     By 42 Touré had declared the PDG the only legal party. For the next 42 years, the government and the PDG were one. Touré was reelected unopposed to four seven-year terms as president, and every five years voters were presented with a single list of PDG candidates for the National Assembly. Advocating a hybrid ": null
    },
    {
        "African Socialism": "african socialism"
    },
    {
        " domestically and ": null
    },
    {
        "Pan-Africanism": "pan-africanism"
    },
    {
        " abroad, Touré quickly became a polarising leader, and his government became intolerant of dissent, imprisoning hundreds, and stifling free press.     At the same time, the Guinean government nationalised land, removed French appointed and traditional chiefs from power, and broke ties with French government and companies. Vacillating between support for the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and the United States, Guineas economic situation became as unpredictable as its diplomatic line. Alleging plots and conspiracies against him at home and abroad, Touré’s regime targeted real and imagined opponents, driving thousands of political opponents into exile.     In 42 Portuguese forces, from neighboring ": null
    },
    {
        "Portuguese Guinea": "portuguese guinea"
    },
    {
        ", staged ": null
    },
    {
        "Operation Green Sea": "operation green sea"
    },
    {
        ", a raid into Guinea with the support of exiled Guinean opposition forces. Among other goals, the Portuguese military wanted to kill or capture Sekou Toure due his support of the ": null
    },
    {
        "PAIGC": "paigc"
    },
    {
        ", a guerilla movement operating inside Portuguese Guinea.   Mr Sekou Touré, who gave the PAIGC unstinted support during its war against the Portuguese,...  , ": null
    },
    {
        "The Economist": "the economist"
    },
    {
        "   After several days of fierce fighting, the Portuguese forces retreated without achieving most of their goals. The regime of Sékou Touré increased the number of internal arrests and executions.     The ": null
    },
    {
        "Guinean Market Womens Revolt": "guinean market womens revolt"
    },
    {
        " in 42 resulted in the regimes softening of economic restrictions and began a turn away from the radical socialism previously practiced by the government.     Sékou Touré died on March 42 42 after a heart operation in the United States, and was replaced by ": null
    },
    {
        "Prime Minister": "heads of government of guinea"
    },
    {
        " Louis Lansana Beavogui": "louis lansana beavogui"
    },
    {
        ", who was to serve as interim president pending new elections.       The PDG was due to elect a new leader on April 42 42 Under the constitution, that person would have been the only candidate for president. However, hours before that meeting, Colonels ": null
    },
    {
        "Lansana Conté": "lansana conté"
    },
    {
        " and ": null
    },
    {
        "Diarra Traoré": "diarra traoré"
    },
    {
        " seized power in a bloodless ": null
    },
    {
        "coup": "coup"
    },
    {
        ". Conté assumed the role of president, with Traoré serving as prime minister until December.     Conté immediately denounced the previous regime’s record on ": null
    },
    {
        "human rights": "human rights"
    },
    {
        ", released 42 political prisoners and encouraged approximately 42 more to return from exile. He also made explicit the turn away from socialism, but this did little to alleviate poverty and the country showed no immediate signs of moving towards ": null
    },
    {
        "democracy": "democracy"
    },
    {
        ".     In 42 Conté announced a return to civilian rule, with a presidential poll in 42 followed by elections to parliament in 42  Despite his stated commitment to democracy, Contés grip on power remained tight. In September 42 the opposition leader ": null
    },
    {
        "Alpha Condé": "alpha condé"
    },
    {
        " was imprisoned for endangering state security, though he was pardoned 42 months later. He subsequently spent a period of exile in France.     In 42 Conté organized and won a referendum to lengthen the presidential term and in 42 begun his third term after elections were boycotted by the opposition. In January 42 Conté survived a suspected assassination attempt while making a rare public appearance in the capital ": null
    },
    {
        "Conakry": "conakry"
    },
    {
        ". His opponents claimed that he was a tired dictator      whose departure was inevitable, whereas his supporters believed that he was winning a battle with dissidents. Guinea still faces very real problems and according to ": null
    },
    {
        "Foreign Policy": "foreign policy"
    },
    {
        " is in danger of becoming a ": null
    },
    {
        "failed state": "failed state"
    },
    {
        ".          In 42 Guinea became embroiled in the instability which had long blighted the rest of ": null
    },
    {
        "West Africa": "west africa"
    },
    {
        " as rebels crossed the borders with ": null
    },
    {
        "Liberia": "liberia"
    },
    {
        " and ": null
    },
    {
        "Sierra Leone": "sierra leone"
    },
    {
        " and it seemed for a time that the country was headed for ": null
    },
    {
        "civil war": "civil war"
    },
    {
        ".      Conté blamed neighbouring leaders for coveting Guineas natural resources, though these claims were strenuously denied.  In 42 Guinea agreed plans with her neighbours to tackle the insurgents. In 42 there were ": null
    },
    {
        "big protests": "2007 guinean general strike"
    },
    {
        " against the government, resulting in the appointment of a new prime minister.            In a ": null
    },
    {
        "coup détat": "lansana conté1984 guinean coup"
    },
    {
        " several hours following ": null
    },
    {
        "Tourés": "ahmed sékou touré"
    },
    {
        " death, ": null
    },
    {
        "Lansana Conté": "lansana conté"
    },
    {
        " became the President. The constitution and parliament were suspended and a committee for national recovery was established. Conté remained in power until his death on 42 December 42          In several hours following his death, ": null
    },
    {
        "Moussa Dadis Camara": "moussa dadis camara"
    },
    {
        " seized control": "2008 guinean coup détat"
    },
    {
        " of Guinea as the head of a ": null
    },
    {
        "junta": "military junta"
    },
    {
        ".      On 42 September 42 the junta ordered its soldiers to attack people who had gathered to protest Camara’s presumed candidacy in the upcoming presidential elections.           The soldiers went on a rampage of rape, mutilation, and murder.          On 42 December 42 an aide shot Camara during a dispute about the rampage of September 42 Camara went to Morocco for medical care.  Vice-President ": null
    },
    {
        "Sékouba Konaté": "sékouba konaté"
    },
    {
        " flew back from ": null
    },
    {
        "Lebanon": "lebanon"
    },
    {
        " to run the country in Camaras absence.     . ": null
    },
    {
        "Xinhua": "xinhua"
    },
    {
        ". 42 December 42       On 42 January 42 Camara was flown from Morocco to ": null
    },
    {
        "Burkina Faso": "burkina faso"
    },
    {
        ".      After meeting in ": null
    },
    {
        "Ouagadougou": "ouagadougou"
    },
    {
        " on 42 and 42 January, Camara, Konaté and ": null
    },
    {
        "Blaise Compaoré": "blaise compaoré"
    },
    {
        ", President of Burkina Faso, produced a formal statement of twelve principles promising a return of Guinea to civilian rule within six months. It was agreed that the military would not contest the forthcoming elections, and Camara would continue his convalescence outside Guinea.  On 42 January 42 the military junta appointed ": null
    },
    {
        "Jean-Marie Doré": "jean-marie doré"
    },
    {
        " as Prime Minister of a six-month transition government, leading up to elections.    , Reuters, 42 January 42       The presidential election was set to take place on 42 June and 42 July 42    . Afrol.com. Retrieved on 42 June 42       . News.xinhuanet.com . Retrieved on 42 June 42   it was held as being the first free and fair election since independence in 42   The first round took place normally on 42 June 42 with ex Prime Minister ": null
    },
    {
        "Cellou Dalein Diallo": "cellou dalein diallo"
    },
    {
        " and his rival ": null
    },
    {
        "Alpha Condé": "alpha condé"
    },
    {
        " emerging as the two runners-up for the second round.        However, due to allegations of electoral fraud, the second round of the election was postponed until 42 September 42      A delay until 42 October was announced by the electoral commission , subject to approval by ": null
    },
    {
        "Sékouba Konaté": "sékouba konaté"
    },
    {
        ". . Reuters.com. Retrieved on 42 June 42 Yet another delay until 42 October was announced in early October.    . English.aljazeera.net . Retrieved on 42 June 42   Elections were finally held on 42 November. Voter turnout was high, and the elections went relatively smoothly.    . Bbc.co.uk . Retrieved on 42 June 42       42 November 42 ": null
    },
    {
        "Alpha Condé": "alpha condé"
    },
    {
        ", the leader of the opposition party ": null
    },
    {
        "Rally of the Guinean People": "rally of the guinean people"
    },
    {
        " , was officially declared the winner of a 42 November run-off in Guineas presidential election. He had promised to reform the security sector and review mining contracts if elected.    . IOL.co.za . Retrieved on 42 June 42       On the night of 42 July 42 President Condés residence was attacked in an attempted coup. The attack included a fierce firefight and rocket propelled grenades. The president was unharmed.    . allAfrica.com ..   Sixteen people have been charged with the attempted assassination. Most of those indicted are close associates of Konaté.   Jean, Tamba.  . allAfrica.com..       The ": null
    },
    {
        "National Assembly of Guinea": "national assembly of guinea"
    },
    {
        ", the countrys legislative body, has not met since 42 when it was dissolved after the military coup in December. ": null
    },
    {
        "Elections": "guinean legislative election, 2012"
    },
    {
        " have been postponed many times since 42 and, most recently, were scheduled for 42 July 42 In April 42 President Condé postponed the elections indefinitely, citing the need to ensure that they were transparent and democratic .      In February 42 a plane carrying the head of the Guinean armed forces, General Kelefa Diallo, and nine other military officials, crashed on its way to the Liberian capital, ": null
    },
    {
        "Monrovia": "monrovia"
    },
    {
        ".        The opposition coalition withdrew from the electoral process in mid-February, mainly due to President Condes insistence on using a suspicious South African firm ": null
    },
    {
        "Waymark Infotech": "waymark infotech"
    },
    {
        " to draw up the registered voter list.       In late February 42 ": null
    },
    {
        "political violence erupted in Guinea": "2013 guinea violence"
    },
    {
        " after protesters took to the streets to voice their concerns over the transparency of the upcoming May 42 elections. The demonstrations were fueled by the opposition coalition’s decision to step down from the electoral process in protest at the lack of transparency in the preparations for elections.          Nine people were killed during the protests, while around 42 were injured, and many of the deaths and injuries were caused by security forces using live fire on protesters.      The political violence also led to inter-ethnic clashes between the ": null
    },
    {
        "Fula": "fula people"
    },
    {
        " and ": null
    },
    {
        "Malinke": "malinke"
    },
    {
        " peoples, the latter forming the base of support for President Condé, with the former consisting mainly of the opposition.        On 42 March 42 the opposition party backed out of the negotiation with the government over the upcoming 42 May election. The opposition claimed that the government has not respected them, and have not kept any promises they agreed to. This is expected to lead to more protests and fighting in the streets of Guinea.            Beginning in July 42 Guinea suffered the most severe recorded ": null
    },
    {
        "outbreak": "2014 west africa ebola outbreak"
    },
    {
        " of ": null
    },
    {
        "Ebola": "ebola"
    },
    {
        " in history, which rapidly spread to neighbouring countries Liberia and Sierra Leone.      The epidemic was over by June 42   ": null
    }
]