[
    {
        "      The history of the ": null
    },
    {
        "island of Taiwan": "island of taiwan"
    },
    {
        " dates back tens of thousands of years to the earliest known evidence of human habitation. The sudden appearance of a culture based on ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        " around 42 BC is believed to reflect the arrival of the ancestors of todays ": null
    },
    {
        "Taiwanese indigenous peoples": "taiwanese indigenous peoples"
    },
    {
        ". The island was ": null
    },
    {
        "colonized by the Dutch": "dutch formosa"
    },
    {
        " in the 42th century, followed by an influx of Hoklo people including ": null
    },
    {
        "Hakka": "hakka people"
    },
    {
        " immigrants from the ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        " and ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        " areas of ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ", across the ": null
    },
    {
        "Taiwan Strait": "taiwan strait"
    },
    {
        ". The Spanish built a ": null
    },
    {
        "settlement in the north": "spanish formosa"
    },
    {
        " for a brief period but were driven out by the Dutch in 42     In 42 ": null
    },
    {
        "Koxinga": "koxinga"
    },
    {
        ", a loyalist of the ": null
    },
    {
        "Ming dynasty": "ming dynasty"
    },
    {
        " who had lost control of mainland China in 42 defeated the Dutch and established a ": null
    },
    {
        "base of operations": "kingdom of tungning"
    },
    {
        " on the island. His forces were defeated by the ": null
    },
    {
        "Qing dynasty": "qing dynasty"
    },
    {
        " in 42 and parts of Taiwan became increasingly ": null
    },
    {
        "integrated into the Qing empire": "taiwan under qing rule"
    },
    {
        ". Following the ": null
    },
    {
        "First Sino-Japanese War": "first sino-japanese war"
    },
    {
        " in 42 the Qing ": null
    },
    {
        "ceded the island": "1895 japanese conquest of taiwan"
    },
    {
        ", along with ": null
    },
    {
        "Penghu": "penghu"
    },
    {
        ", to the ": null
    },
    {
        "Empire of Japan": "empire of japan"
    },
    {
        ". Taiwan produced rice and sugar to be exported to the Empire of Japan, and also served as a base for the ": null
    },
    {
        "Japanese invasion of Southeast Asia": "south-east asian theatre of world war ii"
    },
    {
        " and ": null
    },
    {
        "the Pacific": "pacific war"
    },
    {
        " during World War II. ": null
    },
    {
        "Japanese imperial education": "education in the empire of japan"
    },
    {
        " was implemented in ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " and many Taiwanese also fought for Japan during the war.     In 42 following the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the ": null
    },
    {
        "nationalist government": "nationalist government"
    },
    {
        " of the ": null
    },
    {
        "Republic of China": "republic of china"
    },
    {
        " , led by the ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        " , took control of Taiwan. In 42 after losing control of ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        " in the ": null
    },
    {
        "Chinese Civil War": "chinese civil war"
    },
    {
        ", the ROC government under the KMT ": null
    },
    {
        "withdrew to Taiwan": "chinese nationalist party retreat to taiwan"
    },
    {
        " and ": null
    },
    {
        "Chiang Kai-shek": "chiang kai-shek"
    },
    {
        " declared ": null
    },
    {
        "martial law": "martial law"
    },
    {
        ". The KMT ruled Taiwan  as a ": null
    },
    {
        "single-party state": "single-party state"
    },
    {
        " for forty years, until democratic reforms in the 42s, which led to the first-ever ": null
    },
    {
        "direct presidential election": "1996 republic of china presidential election"
    },
    {
        " in 42 During the post-war period, Taiwan experienced rapid industrialization and economic growth known as the ": null
    },
    {
        "Taiwan Miracle": "taiwan miracle"
    },
    {
        " , and was known as one of the ": null
    },
    {
        "Four Asian Tigers": "four asian tigers"
    },
    {
        " .             In the ": null
    },
    {
        "Late Pleistocene": "late pleistocene"
    },
    {
        ", sea levels were about 42 m lower than in the present day, exposing the floor of the shallow ": null
    },
    {
        "Taiwan Strait": "taiwan strait"
    },
    {
        " as a land bridge that was crossed by mainland fauna. The oldest evidence of human presence on Taiwan consists of three cranial fragments and a molar tooth found at Chouqu and Gangzilin, in ": null
    },
    {
        "Zuojhen District": "zuojhen district"
    },
    {
        ", Tainan. These are estimated to be between 42 and 42 years old.  , Encyclopedia of Taiwan. The oldest artifacts are chipped-pebble tools of ": null
    },
    {
        "a Paleolithic culture": "changbin culture"
    },
    {
        " found in four caves in ": null
    },
    {
        "Changbin": "changbin"
    },
    {
        ", Taitung, dated 42 to 42 years ago, and similar to contemporary sites in Fujian. The same culture is found at sites at ": null
    },
    {
        "Eluanbi": "eluanbi"
    },
    {
        " on the southern tip of Taiwan, persisting until 42 years ago.  , Encyclopedia of Taiwan. At the beginning of the ": null
    },
    {
        "Holocene": "holocene"
    },
    {
        " 42 years ago, sea levels rose, forming the Taiwan Strait and cutting off the island from the Asian mainland.     In December 42 the ~42 year old Liangdao Man skeleton was found on ": null
    },
    {
        "Liang Island": "liang island"
    },
    {
        ". In 42 the mitochondrial DNA of the skeleton was found to belong to ": null
    },
    {
        "Haplogroup E": "haplogroup e"
    },
    {
        ", with two of the four mutations characteristic of the E42 subgroup.       The only Paleolithic burial that has been found on Taiwan was in Xiaoma cave in the southeast of the island, dating from about 42 BC, of a male similar in type to ": null
    },
    {
        "Negrito": "negrito"
    },
    {
        "s found in the Philippines. There are also references in Chinese texts and Taiwanese aboriginal oral traditions to pygmies on the island at some time in the past.      Around 42 BC, the Neolithic ": null
    },
    {
        "Dapenkeng culture": "dapenkeng culture"
    },
    {
        " abruptly appeared and quickly spread around the coast of the island. Their sites are characterized by corded-ware pottery, polished stone adzes and slate points. The inhabitants cultivated rice and millet, but were also heavily reliant on marine shells and fish. Most scholars believe this culture is not derived from the Changbin culture, but was brought across the Strait by the ancestors of todays ": null
    },
    {
        "Taiwanese aborigines": "taiwanese aborigines"
    },
    {
        ", speaking early ": null
    },
    {
        "Austronesian languages": "austronesian languages"
    },
    {
        ". , Encyclopedia of Taiwan. Some of these people later migrated from Taiwan to the islands of Southeast Asia and thence throughout the Pacific and Indian Oceans.   ": null
    },
    {
        "Malayo-Polynesian languages": "malayo-polynesian languages"
    },
    {
        " are now spoken across a huge area from ": null
    },
    {
        "Madagascar": "madagascar"
    },
    {
        " to ": null
    },
    {
        "Hawaii": "hawaii"
    },
    {
        ", ": null
    },
    {
        "Easter Island": "easter island"
    },
    {
        " and ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ", but form only one branch of the Austronesian family, the rest of whose branches are found only on Taiwan.     The Dapenkeng culture was succeeded by a variety of cultures throughout the island, including the ": null
    },
    {
        "Tahu": "tahu culture"
    },
    {
        " and ": null
    },
    {
        "Yingpu": "yingpu culture"
    },
    {
        " cultures.   Iron appeared at the beginning of the current era in such cultures as the ": null
    },
    {
        "Niaosung Culture": "niaosung culture"
    },
    {
        ".   The earliest metal artifacts were trade goods, but by around 42 AD ": null
    },
    {
        "wrought iron": "wrought iron"
    },
    {
        " was being produced locally using ": null
    },
    {
        "bloomeries": "bloomery"
    },
    {
        ", a technology possibly introduced from the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        ".     Early Chinese histories refer to visits to eastern islands that some historians identify with Taiwan. Troops of the ": null
    },
    {
        "Three Kingdoms": "three kingdoms"
    },
    {
        " state of ": null
    },
    {
        "Wu": "eastern wu"
    },
    {
        " are recorded as visiting an island known as Yizhou  in the 42rd century. The  Book of Sui  relates that ": null
    },
    {
        "Emperor Yang": "emperor yang of sui"
    },
    {
        " of the ": null
    },
    {
        "Sui dynasty": "sui dynasty"
    },
    {
        " sent three expeditions to a place called ": null
    },
    {
        "Liuqiu": "liuqiu"
    },
    {
        " early in the 42th century. Later the name Liuqiu  referred to the island chain to the northeast of Taiwan, but some scholars believe it may have referred to Taiwan in the Sui period. ": null
    },
    {
        "Okinawa Island": "okinawa island"
    },
    {
        " was referred to by the Chinese as Great Liuqiu and Taiwan as Lesser Liuqiu .      Portuguese sailors, passing Taiwan in 42 first jotted in a ships log the name of the island Ilha Formosa, meaning Beautiful Island . In 42 the survivors of a Portuguese shipwreck spent ten weeks battling ": null
    },
    {
        "malaria": "malaria"
    },
    {
        " and aborigines before returning to ": null
    },
    {
        "Macau": "macau"
    },
    {
        " on a raft.               A transient population of Han Chinese made out of traders and pirates started migrating to southwest Taiwan in the early 42th century before Dutch rule. Taiwans southwest was already home to a Chinese population numbering close to 42 before 42 when the Dutch first came.      The ": null
    },
    {
        "Dutch East India Company": "dutch east india company"
    },
    {
        " came to the area in search of an Asian trade and military base. Defeated by the Portuguese at the ": null
    },
    {
        "Battle of Macau": "battle of macau"
    },
    {
        " in 42 they attempted to occupy ": null
    },
    {
        "Penghu": "penghu"
    },
    {
        ", but were ": null
    },
    {
        "driven off by the Ming authorities": "sino–dutch conflicts"
    },
    {
        ". They then built ": null
    },
    {
        "Fort Zeelandia": "fort zeelandia"
    },
    {
        " on the islet of Tayowan off the southwest coast of Taiwan.  On the adjacent mainland, they built a smaller brick fort, ": null
    },
    {
        "Fort Provintia": "fort provintia"
    },
    {
        ".     In 42 the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        ", viewing the Dutch presence on Taiwan as a threat to ": null
    },
    {
        "their colony in the Philippines": "spanish philippines"
    },
    {
        ", established a settlement at ": null
    },
    {
        "Santísima Trinidad": "santísima trinidad"
    },
    {
        " on the northeast coast of Taiwan , building Fort San Salvador. They also built ": null
    },
    {
        "Fort Santo Domingo": "fort santo domingo"
    },
    {
        " in the northwest  in 42 but had abandoned it by 42 The small colony was plagued by disease and a hostile local population, and received little support from ": null
    },
    {
        "Manila": "manila"
    },
    {
        ". The Dutch Governor ": null
    },
    {
        "Pieter Nuyts": "pieter nuyts"
    },
    {
        " got entangled in a dispute with the Japanese Hamada Yahei.     The Dutch were defeated at the ": null
    },
    {
        "Battle of Liaoluo Bay": "battle of liaoluo bay"
    },
    {
        " by the Chinese ": null
    },
    {
        "Zheng Zhilong": "zheng zhilong"
    },
    {
        " in 42     The Dutch set out to turn Taiwan into a Dutch colony. The first order of business was to punish villages that had violently opposed the Dutch and unite the aborigines in allegiance with the VOC. The first punitive expedition was against the villages of Baccloan and Mattauw, north of ": null
    },
    {
        "Saccam": "fort provintia"
    },
    {
        " near Tayowan. The Mattauw campaign had been easier than expected and the tribe submitted after having their village razed by fire. The campaign also served as a threat to other villages from Tirossen  to Lonkjiaow . The ": null
    },
    {
        "42 punitive attack": "lamey island massacre"
    },
    {
        " on ": null
    },
    {
        "Lamay Island": "lamay island"
    },
    {
        " in response to the killing of the shipwrecked crews of the Beverwijck and the Golden Lion ended ten years later with the entire aboriginal population of 42 removed from the island including 42 Lamayans killed in a cave, having been trapped there by the Dutch and suffocated in the fumes and smoke pumped into the cave by the Dutch and their allied aborigines from Saccam, Soulang and Pangsoya. The men were forced into slavery in ": null
    },
    {
        "Batavia": "batavia, dutch east indies"
    },
    {
        "  and the women and children became servants and wives for the Dutch officers. The events on Lamay changed the course of Dutch rule to work closer with allied aborigines, though there remained plans to depopulate the outlying islands.     In 42 the Dutch ejected the Spanish from the north of the island. They then sought to establish control of the western plains between the new possessions and their base at ": null
    },
    {
        "Tayouan": "taoyuan, taiwan"
    },
    {
        ". After a brief but destructive campaign in 42 Pieter Boon was able to subdue the tribes in this area, including the ": null
    },
    {
        "Kingdom of Middag": "kingdom of middag"
    },
    {
        ".          The VOC administered the island and its predominantly aboriginal population until 42 setting up a tax system, schools to teach ": null
    },
    {
        "romanized script": "romanization"
    },
    {
        " of aboriginal languages and ": null
    },
    {
        "evangelizing Christianity": "evangelism"
    },
    {
        ". Although its control was mainly limited to the western plain of the island, the Dutch systems were adopted by succeeding occupiers. The first influx of migrants were the Hakkas and Hokkiens who came during the Dutch period, in which merchants and traders from the mainland Chinese coast sought to purchase hunting licenses from the Dutch or hide out in aboriginal villages to escape the Qing authorities. Most of the immigrants were young single males who were discouraged from staying on the island often referred to by Han as The Gate of Hell for its reputation in taking the lives of sailors and explorers.     The Dutch originally sought to use their castle Zeelandia at Tayowan as a trading base between Japan and China, but soon realized the potential of the huge deer populations that roamed in herds of thousands along the ": null
    },
    {
        "alluvial plain": "alluvial plain"
    },
    {
        "s of Taiwans western regions. Deer were in high demand by the Japanese, who were willing to pay exorbitant prices for use of the hides in ": null
    },
    {
        "samurai armor": "samurai armor"
    },
    {
        ". Other parts of the deer were sold to Han traders for meat and medical use. The Dutch paid aborigines for the deer brought to them and tried to manage the deer stocks to keep up with demand. The Dutch also employed Han to farm ": null
    },
    {
        "sugarcane": "sugarcane"
    },
    {
        " and rice for export. Some of these rice and sugarcane products reached as far as the markets of ": null
    },
    {
        "Persia": "persia"
    },
    {
        ". Unfortunately, the deer the aborigines had relied on for their livelihoods began to disappear, forcing the aborigines to adopt new means of survival.             On the mainland, ": null
    },
    {
        "Manchu": "manchu people"
    },
    {
        " forces broke through ": null
    },
    {
        "Shanhai Pass": "shanhai pass"
    },
    {
        " in 42 and ": null
    },
    {
        "rapidly overwhelmed": "manchu conquest"
    },
    {
        " the ": null
    },
    {
        "Ming dynasty": "ming dynasty"
    },
    {
        ". In 42 a naval fleet led by the Ming loyalist ": null
    },
    {
        "Koxinga": "koxinga"
    },
    {
        " arrived in Taiwan to oust the Dutch from ": null
    },
    {
        "Zeelandia": "fort zeelandia"
    },
    {
        " and establish a pro-Ming base in Taiwan. Koxinga was born to ": null
    },
    {
        "Zheng Zhilong": "zheng zhilong"
    },
    {
        ", a Chinese merchant and ": null
    },
    {
        "pirate": "pirate"
    },
    {
        ", and ": null
    },
    {
        "Tagawa Matsu": "tagawa matsu"
    },
    {
        ", a Japanese woman, in 42 in ": null
    },
    {
        "Hirado": "hirado, nagasaki"
    },
    {
        ", ": null
    },
    {
        "Nagasaki Prefecture": "nagasaki prefecture"
    },
    {
        ", Japan. He was raised there until seven and moved to ": null
    },
    {
        "Quanzhou": "quanzhou"
    },
    {
        ", in the ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        " province of China. In a family made wealthy from shipping and piracy, Koxinga inherited his fathers trade networks, which stretched from ": null
    },
    {
        "Nagasaki": "nagasaki, nagasaki"
    },
    {
        " to Macao. Following the Manchu advance on Fujian, Koxinga retreated from his stronghold in Amoy  and besieged ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " in the hope of establishing a strategic base to marshal his troops to retake his base at Amoy. In 42 following a nine-month siege, Koxinga captured the Dutch fortress ": null
    },
    {
        "Zeelandia": "fort zeelandia"
    },
    {
        " and Taiwan became his base .     The ": null
    },
    {
        "Taiwanese Aboriginal": "taiwanese aboriginal"
    },
    {
        " tribes who were previously allied with the Dutch against the Chinese during the ": null
    },
    {
        "Guo Huaiyi Rebellion": "guo huaiyi rebellion"
    },
    {
        " in 42 turned against the Dutch during the Siege of Fort Zeelandia and defected to ": null
    },
    {
        "Koxinga": "koxinga"
    },
    {
        "s Chinese forces.  The Aboriginals of Sincan defected to Koxinga after he offered them ": null
    },
    {
        "amnesty": "amnesty"
    },
    {
        ". The Sincan Aboriginals then proceeded to work for the Chinese and behead Dutch people in executions. The frontier aboriginals in the mountains and plains also surrendered and defected to the Chinese on 42 May 42 celebrating their freedom from ": null
    },
    {
        "compulsory education": "compulsory education"
    },
    {
        " under the Dutch rule by hunting down Dutch people and beheading them and trashing their Christian school textbooks.  Koxinga died four months after the siege was over, there were speculations that he died in a sudden fit of madness when his officers refused to carry out his orders to execute his son ": null
    },
    {
        "Zheng Jing": "zheng jing"
    },
    {
        ". Zheng Jing had an affair with his ": null
    },
    {
        "wet nurse": "wet nurse"
    },
    {
        " and conceived a child with her.  Other accounts are more straightforward, attributing Koxingas death to a case of ": null
    },
    {
        "malaria": "malaria"
    },
    {
        ".     Following the death of Koxinga, his son Zheng Jing took over the Zheng regime, leading the remaining 42 Ming loyalist troops to Taiwan. In response to raids by Zheng Jing and in an effort to starve out the forces in Taiwan, the Qing decreed to relocate all of the southern coastal towns and ports that had been the targets of raids by the Zheng fleet and thus provided supplies for the resistance. This measure largely backfired, and between 42 and 42 six major waves of immigration occurred from these coastal towns to Taiwan, spurred by the severe hardships incurred from the Qing relocation policy. In a move to take advantage of this Qing misstep, Zheng Jing promoted immigration to Taiwan by promising free eastern land cultivation and ownership for peasants in exchange for ": null
    },
    {
        "compulsory military service": "compulsory military service"
    },
    {
        " by all males in case the island was in danger of a Qing invasion.                 In 42 following a naval engagement with Admiral ": null
    },
    {
        "Shi Lang": "shi lang"
    },
    {
        ", one of Koxingas fathers trusted friends, Koxingas grandson ": null
    },
    {
        "Zheng Keshuang": "zheng keshuang"
    },
    {
        ", surrendered to the ": null
    },
    {
        "Qing dynasty": "qing dynasty"
    },
    {
        ".     There has been much confusion about Taiwans association with the rumored Island of Dogs, Island of Women, etc., which were thought, by Han literati, to lie beyond the seas. Taiwan was officially regarded by the ": null
    },
    {
        "Kangxi Emperor": "kangxi emperor"
    },
    {
        " as a ball of mud beyond the pale of civilization and did not appear on any map of the imperial domain until 42 The act of presenting a map to the emperor was equal to presenting the lands of the empire. It took several more years before the Qing court would recognize Taiwan as part of the Qing realm. Prior to the Qing dynasty, China was conceived as a land ": null
    },
    {
        "bound by mountains, rivers and seas": "four seas"
    },
    {
        ". The idea of an island as a part of China was unfathomable to the Han prior to the Qing frontier expansion effort of the 42th century.     Despite the expense of the military and diplomatic campaign that brought Taiwan into the imperial realm, the general sentiment in ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        " was ambivalent. The point of the campaign had been to destroy the Zheng-family regime, not to conquer the island. The Kangxi Emperor expressed the sentiment that Taiwan was the size of a pellet; taking it is no gain; not taking it is no loss . His ministers counseled that the island was a ball of mud beyond the sea, adding nothing to the breadth of China , and advocated removing all the Chinese to mainland China and abandoning the island. It was only the campaigning of admiral ": null
    },
    {
        "Shi Lang": "shi lang"
    },
    {
        " and other supporters that convinced the emperor not to abandon Taiwan. Koxingas followers were forced to depart from Taiwan to the more unpleasant parts of Qing controlled land. By 42 there were only 42 Chinese left on Taiwan as they had intermarried with aboriginal women and had property in Taiwan. The Koxinga reign had continued the tax systems of the Dutch, established schools and religious temples.     From 42 the ": null
    },
    {
        "Qing dynasty": "qing dynasty"
    },
    {
        " ruled the island as ": null
    },
    {
        "Taiwan Prefecture": "taiwan prefecture"
    },
    {
        " and in 42 divided the island into two prefectures, north and south. In 42 the island was declared as a separate ": null
    },
    {
        "Fokien-Taiwan Province": "taiwan provinceqing dynasty"
    },
    {
        ".     The Qing authorities tried to limit immigration to Taiwan and barred families from traveling to Taiwan to ensure the immigrants would return to their families and ancestral graves. ": null
    },
    {
        "Illegal immigration": "illegal immigration"
    },
    {
        " continued, but many of the men had few prospects in war-weary Fujian and thus married locally, resulting in the idiom has ": null
    },
    {
        "Tangshan": "names of chinatang"
    },
    {
        " father, no Tangshan mother .   The Qing tried to protect aboriginal land claims, but also sought to turn them into tax paying subjects. Chinese and tax paying aborigines were barred from entering the wilderness which covered most of the island for the fear of raising the ire of the non taxpaying, highland aborigines and inciting ": null
    },
    {
        "rebellion": "rebellion"
    },
    {
        ". A border was constructed along the western plain, built using pits and mounds of earth, called earth cows , to discourage ": null
    },
    {
        "squatting": "squatting"
    },
    {
        ".       From 42 to around 42 the Qing government limited immigration to Taiwan. Such restriction was relaxed following the 42s and by 42 there were more than two million Chinese immigrants on Taiwan. In 42 ": null
    },
    {
        "Taipeh Prefecture": "taipeh prefecture"
    },
    {
        " was established, under the jurisdiction of Fujian Province. Also, there had been various conflicts between Chinese immigrants. Most conflicts were between Han from Fujian and Han from ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        ", between people from different areas of Fujian, between Han and ": null
    },
    {
        "Hakka": "hakka people"
    },
    {
        " settlers, or simply between people of different surnames engaged in clan feuds. Because of the strong provincial loyalties held by these immigrants, the Qing government felt Taiwan was somewhat difficult to govern. Taiwan was also plagued by foreign invasions.     Given the strategic and commercial value of Taiwan, there were British suggestions in 42 and 42 to seize the island.   In September 42 during the ": null
    },
    {
        "First Opium War": "first opium war"
    },
    {
        ", the British transport ship  Nerbudda  became shipwrecked near Keelung Harbour due to a typhoon. The brig Ann also became shipwrecked in March 42 Most of the crew were Indian ": null
    },
    {
        "lascar": "lascar"
    },
    {
        "s. Survivors from both ships were transferred by authorities to the capital ": null
    },
    {
        "Tainan": "tainan"
    },
    {
        ". The Taiwan Qing commanders, Ta-hung-ah and Yao Ying, filed a disingenuous report to the emperor, claiming to have defended against an attack from the Keelung fort. In October 42 ": null
    },
    {
        "HMS Nimrod": "hms nimrod"
    },
    {
        " sailed to Keelung to search for the Nerbudda survivors, but after Captain Joseph Pearse found out that they were sent south for imprisonment, he ordered the bombardment of the harbour and destroyed 42 sets of cannon before returning to Hong Kong. Most of the survivors—over 42 from the Nerbudda and 42 from the Ann—were ": null
    },
    {
        "executed in Tainan": "nerbudda incident"
    },
    {
        " in August 42     The Aboriginals often slaughtered the shipwrecked crews of Western ships. In 42 the entire American crew of the Rover were massacred by aboriginals in the ": null
    },
    {
        "Rover incident": "rover incident"
    },
    {
        ". When the Americans launched the punitive ": null
    },
    {
        "Formosa Expedition": "formosa expedition"
    },
    {
        " in retaliation, the aboriginals defeated the Americans and forced them to retreat, killing an American marine while suffering no casualties themselves.     During the ": null
    },
    {
        "Sino-French War": "sino-french war"
    },
    {
        ", the French attempted an invasion of Taiwan during the ": null
    },
    {
        "Keelung Campaign": "keelung campaign"
    },
    {
        " in 42 ": null
    },
    {
        "Liu Mingchuan": "liu mingchuan"
    },
    {
        ", who was leading the defense of Taiwan, recruited Aboriginals to serve alongside the Chinese soldiers in fighting against the French. The French were defeated at the ": null
    },
    {
        "Battle of Tamsui": "battle of tamsui"
    },
    {
        " and the Qing forces pinned the French down at Keelung in an eight-month-long campaign before the French withdrew. Because of these incursions, the Qing government began constructing a series of coastal defenses and in 42 work commenced to make Taiwan a province, with Liu Mingchuan serving as the first governor. He divided Taiwan into eleven counties and tried to improve relations with the aborigines. He also developed a railway from ": null
    },
    {
        "Taipei": "taipei"
    },
    {
        " to ": null
    },
    {
        "Hsinchu": "hsinchu"
    },
    {
        ", established a mine in Keelung, and built an arsenal to improve Taiwans defensive capability against foreigners.     Following a shipwreck of a ": null
    },
    {
        "Ryukyuan": "ryukyu kingdom"
    },
    {
        " vessel on the southeastern tip of Taiwan in winter of 42 in which the heads of 42 crew members were taken by the aboriginal Taiwanese ": null
    },
    {
        "Paiwan people": "paiwan people"
    },
    {
        " in the ": null
    },
    {
        "Mudan incident": "mudan incident"
    },
    {
        ", the Japanese sought to use this incident as a pretext to have the Qing formally acknowledge Japanese sovereignty over the ": null
    },
    {
        "Ryukyu Islands": "ryukyu islands"
    },
    {
        " as Japanese territory and to test reactions to potential expansion into Taiwan. According to records from Japanese documents,  and , the ": null
    },
    {
        "Qing": "qing"
    },
    {
        " ministers at ": null
    },
    {
        "Zongli Yamen": "zongli yamen"
    },
    {
        " who handled the complaints from Japanese envoy , replied first that they had heard only of a massacre of Ryukyuans, not of Japanese, and quickly noted that Ryukyu was under ": null
    },
    {
        "Chinese suzerainty": "list of tributaries of imperial china"
    },
    {
        ", and therefore this issue was not Japans business. In addition, the governor-general of the Qing province ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        " had rescued the survivors of the massacre and returned them safely to Ryukyu. The Qing authorities explained that there were two kinds of aborigines on Taiwan: those governed by the Qing, and those unnaturalized raw barbarians  ... beyond the reach of Qing government and customs. They indirectly hinted that foreigners traveling in those areas settled by indigenous people must exercise caution.     After the Yanagihara-Yamen interview, the Japanese took their explanation to mean that the Qing government had not opposed Japans claims to sovereignty over the Ryukyu Islands, disclaimed any jurisdiction over Aboriginal Taiwanese, and had indeed consented to Japans expedition to Taiwan. The Qing dynasty made it clear to the Japanese that Taiwan was definitely within Qing jurisdiction, even though part of that islands aboriginal population was not yet under the influence of Chinese culture. The Qing also pointed to similar cases all over the world where an aboriginal population within a national boundary was not completely ": null
    },
    {
        "subjugated": "subjugated mentality"
    },
    {
        " by the ": null
    },
    {
        "dominant culture": "dominant culture"
    },
    {
        " of that country.     The Japanese nevertheless launched ": null
    },
    {
        "an expedition": "taiwan expedition of 1874"
    },
    {
        " to Mutan village with a force of 42 soldiers in 42 The number of killed ": null
    },
    {
        "Paiwan": "paiwan people"
    },
    {
        " was about thirty, and that for the Japanese was six. Eventually, the Japanese withdrew after being paid a massive ": null
    },
    {
        "indemnity": "indemnity"
    },
    {
        " by the Qing. This incident caused the Qing to re-think the importance of Taiwan in their maritime defense strategy and greater importance was placed on gaining control over the wilderness regions.     On the eve of the ": null
    },
    {
        "First Sino-Japanese War": "first sino-japanese war"
    },
    {
        ", about 42 percent of the island was administered under direct Qing administration while the remaining was lightly populated by ": null
    },
    {
        "Aborigines": "taiwanese aborigines"
    },
    {
        ". In a population of around 42 million, about 42 million were ": null
    },
    {
        "Han Chinese": "han chinese"
    },
    {
        " and the remaining two hundred thousand were classified as members of various indigenous tribes.          As part of the settlement for losing the Sino-Japanese War, the Qing empire ceded the islands of Taiwan and ": null
    },
    {
        "Penghu": "penghu"
    },
    {
        " to Japan on April 42 42 according to the terms of the ": null
    },
    {
        "Treaty of Shimonoseki": "treaty of shimonoseki"
    },
    {
        ". The loss of Taiwan would become a rallying point for the Chinese nationalist movement in the years that followed.                  Japan had sought to claim sovereignty over Taiwan  since 42 when ": null
    },
    {
        "Toyotomi Hideyoshi": "toyotomi hideyoshi"
    },
    {
        " undertook a policy of overseas expansion and extending Japanese influence southward and westward. To the west, ": null
    },
    {
        "Japan invaded Korea": "japanese invasions of korea"
    },
    {
        " in that time period, with the eventual conquest of China contemplated. To the south an initial attempt to invade Taiwan and subsequent sporadic invasion attempts spanning three centuries were unsuccessful due mainly to disease and attacks by aborigines on the island.     In 42 the ": null
    },
    {
        "Tokugawa shogunate": "tokugawa shogunate"
    },
    {
        " sent ": null
    },
    {
        "Harunobu Arima": "harunobu arima"
    },
    {
        " on an exploratory mission of the island. An attempted invasion in 42 led by ": null
    },
    {
        "Murayama Tōan": "murayama tōan"
    },
    {
        ", failed when the fleet was dispersed by a ": null
    },
    {
        "typhoon": "typhoon"
    },
    {
        " and the only ship to reach the island was repelled.      In the ": null
    },
    {
        "Mudan Incident of 42": "mudan incident of 1871"
    },
    {
        ", an ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        "n ship was wrecked on the southern tip of Taiwan and 42 crewmen were beheaded by ": null
    },
    {
        "Paiwan aborigines": "paiwan people"
    },
    {
        ". After the Qing government refused to make compensation, stating that the aboriginals were not under its control, Japan ": null
    },
    {
        "launched a punitive expedition": "japanese invasion of taiwan"
    },
    {
        " to the area in 42 withdrawing after the Qing promised to pay an indemnity.      Smits, Gregory . Visions of Ryūkyū: Identity and Ideology in Early-Modern Thought and Politics. Honolulu: University of Hawaii Press.       It was not until the defeat of the Chinese navy during the ": null
    },
    {
        "First Sino-Japanese War": "first sino-japanese war"
    },
    {
        " in 42–42 that Japan was finally able to gain possession of Taiwan, and with it saw the shifting of Asian dominance from China to Japan. The ": null
    },
    {
        "Treaty of Shimonoseki": "treaty of shimonoseki"
    },
    {
        " was signed on April 42 42 ceding Taiwan and ": null
    },
    {
        "the Penghu Islands": "penghu"
    },
    {
        " to Japan, which would rule the island for 42 years until its defeat in World War II.      After receiving sovereignty of Taiwan, the Japanese feared military ": null
    },
    {
        "resistance": "1895 japanese conquest of taiwan"
    },
    {
        " from Taiwanese who followed the establishment by the local elite of the short-lived ": null
    },
    {
        "Republic of Formosa": "republic of formosa"
    },
    {
        ". Taiwans elite hoped that by declaring themselves a republic the world would not stand by and allow a ": null
    },
    {
        "sovereign state": "sovereign state"
    },
    {
        " to be invaded by the Japanese, and therefore allied with the Qing. The plan quickly turned to chaos as standard Green troops and ": null
    },
    {
        "ethnic Yue": "yue people"
    },
    {
        " soldiers took to looting and pillaging Taiwan. Given the choice between chaos at the hands of Chinese or submission to the Japanese, the Taipei elite sent ": null
    },
    {
        "Koo Hsien-jung": "koo hsien-jung"
    },
    {
        " to ": null
    },
    {
        "Keelung": "keelung"
    },
    {
        " to invite the advancing Japanese forces to proceed to Taipei and restore order.      Armed resistance was sporadic, yet at times fierce, but was largely crushed by 42 although relatively minor rebellions occurred in subsequent years, including the ": null
    },
    {
        "Ta-pa-ni incident": "ta-pa-ni incident"
    },
    {
        " of 42 in ": null
    },
    {
        "Tainan County": "tainan county"
    },
    {
        ". ": null
    },
    {
        "Nonviolent means of resistance": "nonviolent resistance"
    },
    {
        " began to take place of armed rebellions and the most prominent organization was the ": null
    },
    {
        "Taiwanese Cultural Association": "taiwanese cultural association"
    },
    {
        ", founded in 42 Taiwanese resistance was caused by several different factors . Some were goaded by ": null
    },
    {
        "Chinese nationalism": "chinese nationalism"
    },
    {
        ", while others contained nascent Taiwanese self-determination. Rebellions were often caused by a combination of the effects of unequal colonial policies on local elites and extant ": null
    },
    {
        "millenarian": "millenarianism"
    },
    {
        " beliefs of the local Taiwanese and plains Aborigines. Aboriginal resistance to the heavy-handed Japanese policies of acculturation and pacification lasted up until the early 42s. The last major Aboriginal rebellion, the ": null
    },
    {
        "Musha Uprising": "musha incident"
    },
    {
        " in late 42 by the ": null
    },
    {
        "Atayal people": "atayal people"
    },
    {
        " angry over their treatment while laboring in the burdensome job of ": null
    },
    {
        "camphor": "camphor"
    },
    {
        " extraction, launched the last headhunting party in which over 42 Japanese officials were killed and beheaded during the opening ceremonies of a school. The uprising, led by ": null
    },
    {
        "Mona Rudao": "mona rudao"
    },
    {
        ", was crushed by 42–42 Japanese troops and Aboriginal auxiliaries with the help of ": null
    },
    {
        "poison gas": "poison gas"
    },
    {
        ".     ": null
    },
    {
        "Japanese colonization": "japanese colonial empire"
    },
    {
        " of the island fell under three stages. It began with an oppressive period of crackdown and ": null
    },
    {
        "paternalistic rule": "paternalism"
    },
    {
        ". The second page was a  period of aims to treat all people alike proclaimed by Taiwanese Nationalists who were inspired by the Self-Determination of Nations proposed by ": null
    },
    {
        "Woodrow Wilson": "woodrow wilson"
    },
    {
        " after ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". Finally, during World War II, a period of , a policy which aimed to turn Taiwanese into loyal subjects of the ": null
    },
    {
        "Japanese emperor": "emperor of japan"
    },
    {
        ".     Reaction to Japanese rule among the Taiwanese populace differed. Some felt that the safety of personal life and property was of utmost importance and went along with the Japanese colonial authorities. The second group of Taiwanese were eager to become imperial subjects, believing that such action would lead to equal status with Japanese nationals. The third group was influenced by ": null
    },
    {
        "Taiwan independence": "taiwan independence"
    },
    {
        " and tried to get rid of the Japanese colonials to establish a native Taiwanese rule. The fourth group on the other hand were influenced by ": null
    },
    {
        "Chinese nationalism": "chinese nationalism"
    },
    {
        " and fought for the return of Taiwan to Chinese rule. From 42 onwards, this last group staged many rebellions, the most famous one being led by , who was arrested and executed along with two hundred of his comrades in 42 Luo himself was a member of the ": null
    },
    {
        "Tongmenghui": "tongmenghui"
    },
    {
        ", an organization founded by ": null
    },
    {
        "Sun Yat-sen": "sun yat-sen"
    },
    {
        " and was the precursor to the ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        ". Several strategies of resistance were undertaken.           Initial infrastructural development took place quickly. The ": null
    },
    {
        "Bank of Taiwan": "bank of taiwan"
    },
    {
        " was established in 42 to encourage Japanese ": null
    },
    {
        "private sector": "private sector"
    },
    {
        "s, including ": null
    },
    {
        "Mitsubishi": "mitsubishi"
    },
    {
        " and the ": null
    },
    {
        "Mitsui Group": "mitsui"
    },
    {
        ", to invest in Taiwan. In 42 the third ": null
    },
    {
        "Governor-General of Taiwan": "governor-general of taiwan"
    },
    {
        " passed a budget which initiated the building of ": null
    },
    {
        "Taiwans railroad system": "rail transport in taiwan"
    },
    {
        " from Kirun  to Takao . By 42 the island had electric power supplied by water power in ": null
    },
    {
        "Sun-Moon Lake": "sun-moon lake"
    },
    {
        ", and in subsequent years Taiwan was considered the second-most developed region of East Asia . By 42 Taiwan was financially self-sufficient and had been weaned off of subsidies from Japans central government.     Under the governor ": null
    },
    {
        "Shimpei Goto": "shimpei goto"
    },
    {
        "s rule, many major public works projects were completed. The ": null
    },
    {
        "Taiwan rail system": "rail transport in taiwan"
    },
    {
        " connecting the south and the north and the modernizations of Kirun  and Takao  ports were completed to facilitate transport and shipping of raw material and agricultural products. Exports increased by fourfold. 42% of agricultural land was covered by dam-supported ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        " systems. Food production had increased fourfold and ": null
    },
    {
        "sugar cane": "sugarcane"
    },
    {
        " production had increased 42-fold between 42 and 42 and Taiwan became a major foodbasket serving Japans industrial economy. A health care system was widely established and ": null
    },
    {
        "infectious diseases": "infectious diseases"
    },
    {
        " were almost completely eradicated. The average lifespan for a Taiwanese resident would become 42 years by 42        In October 42 the Governor-General of Taiwan held an ": null
    },
    {
        "Exposition to Commemorate the 42th Anniversary of the Beginning of Administration in Taiwan": "the taiwan exposition: in commemoration of the first forty years of colonial rule"
    },
    {
        " , which served as a showcase for the achievements of Taiwans modernization process under Japanese rule. This attracted worldwide attention, including the ": null
    },
    {
        "Republic of China": "republic of china"
    },
    {
        "s ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        " regime which sent the Japanese-educated ": null
    },
    {
        "Chen Yi": "chen yi"
    },
    {
        " to attend the affair. He expressed his admiration about the efficiency of Japanese government in developing Taiwan, and commented on how lucky the Taiwanese were to live under such effective administration. Somewhat ironically, Chen Yi would later become the ROCs first Chief Executive of Taiwan, who would be infamous for the corruption that occurred under his watch.     The later period of Japanese rule saw a local elite educated and organized. During the 42s several home rule groups were created at a time when others around the world sought to end colonialism. In 42 the Taiwanese elected their first group of local legislators. By March 42 the Japanese legislative branch hastily modified election laws to allow Taiwanese representation in the ": null
    },
    {
        "Japanese Diet": "japanese diet"
    },
    {
        ".          As Japan embarked on ": null
    },
    {
        "full-scale war in China": "japanese invasion of china"
    },
    {
        " in 42 it expanded Taiwans industrial capacity to manufacture war material. By 42 industrial production had exceeded agricultural production in Taiwan. At the same time, the ": null
    },
    {
        "kōminka": "kōminka movement"
    },
    {
        " imperialization project was put under way to instill the Japanese Spirit in Taiwanese residents, and ensure the Taiwanese would remain loyal subjects of the Japanese Emperor ready to make sacrifices during wartime. Measures including Japanese-language education, the option of adopting Japanese names, and the worship of Japanese religion were instituted. In 42 42% of the children received 42-year compulsory education. From 42 to 42 42 Taiwanese joined and served in the ": null
    },
    {
        "military of the Japanese Empire": "imperial japanese army"
    },
    {
        ", while a further 42 were conscripted between 42 and 42 Of the sum total, 42, or 42%, died in ": null
    },
    {
        "Japans war in Asia": "japan in world war ii"
    },
    {
        ".     The ": null
    },
    {
        "Imperial Japanese Navy": "imperial japanese navy"
    },
    {
        " operated heavily out of Taiwan. The ": null
    },
    {
        "South Strike Group": "the japanese navy taiwan and south pacific mandate political project"
    },
    {
        " was based out of the ": null
    },
    {
        "Taihoku Imperial University": "taihoku imperial university"
    },
    {
        " in Taiwan. Many of the Japanese forces participating in the ": null
    },
    {
        "Aerial Battle of Taiwan-Okinawa": "aerial battle of taiwan-okinawa"
    },
    {
        " were based in Taiwan. Important Japanese military bases and industrial centers throughout Taiwan, like ": null
    },
    {
        "Takao": "takao, taiwan"
    },
    {
        " , were targets of heavy American bombing.     In 42 after the United States entered the war against Japan and on the side of China, the Chinese government under the ": null
    },
    {
        "KMT": "kmt"
    },
    {
        " renounced all treaties signed with Japan before that date and made Taiwans return to China  one of the wartime objectives. In the ": null
    },
    {
        "Cairo Declaration": "1943 cairo declaration"
    },
    {
        " of 42 the ": null
    },
    {
        "Allied Powers": "allies of world war ii"
    },
    {
        " declared the return of ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        "  to the Republic of China as one of several Allied demands. In 42 Japan unconditionally surrendered with signing of the ": null
    },
    {
        "instrument of surrender": "japanese instrument of surrender"
    },
    {
        " and ended its rule in Taiwan as the territory was put under the administrative control of the Republic of China government in 42 by the ": null
    },
    {
        "United Nations Relief and Rehabilitation Administration": "united nations relief and rehabilitation administration"
    },
    {
        ".  UNHCR  In accordance with the provisions of Article 42 of ": null
    },
    {
        "San Francisco Peace Treaty": "san francisco peace treaty"
    },
    {
        ", the Japanese formally renounced the territorial sovereignty of Taiwan and Penghu islands, and the treaty was signed in 42 and came into force in 42 At the date when the San Francisco Peace Treaty came into force, the political status of Taiwan and Penghu Islands was still uncertain. The Republic of China and Japan signed the ": null
    },
    {
        "Treaty of Taipei": "treaty of taipei"
    },
    {
        " on April 42 42 and the treaty came into force on August 42  Writing in the  American Journal of International Law , professors Jonathan I. Charney and J. R. V. Prescott argued that none of the post–World War II peace treaties explicitly ceded sovereignty over the covered territories to any specific state or government.                             The ": null
    },
    {
        "Cairo Conference": "cairo conference"
    },
    {
        " from November 42–42 42 in ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        ", Egypt was held to address the ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " position against Japan during World War II, and to make decisions about postwar Asia. One of the three main clauses of the ": null
    },
    {
        "Cairo Declaration": "1943 cairo declaration"
    },
    {
        " was that all the territories Japan has stolen from the Chinese, such as ": null
    },
    {
        "Manchuria": "manchuria"
    },
    {
        ", Formosa, and The ": null
    },
    {
        "Pescadores": "pescadores"
    },
    {
        ", shall be restored to the Republic of China . However, many challenged that the document was merely a ": null
    },
    {
        "statement of intent": "statement of intent"
    },
    {
        " or non-binding declaration, for possible reference used for those who would draft the post-war peace treaty and that as a press release it was without force of law to transfer sovereignty from Taiwan to the Republic of China. Additional rationale to support this claim is that the Act of Surrender, and SCAP General Order no. 42 authorised the surrender of Japanese forces, not Japanese territories.      The Republic of China established ": null
    },
    {
        "Taiwan Provincial Government": "taiwan provincial government"
    },
    {
        " in September 42   publisher: 麥田出版社, author: 黃英哲, December 42 42 and proclaimed on October 42 42 as Taiwan ": null
    },
    {
        "Retrocession Day": "retrocession day"
    },
    {
        ". This is the day in which the Japanese troops surrendered. The validity of the proclamation is subject to some debate, with some supporters of ": null
    },
    {
        "Taiwan independence": "taiwan independence"
    },
    {
        " arguing that it is invalid, and that the date only marks the beginning of ": null
    },
    {
        "military occupation": "military occupation"
    },
    {
        " that persists to the present.   By 42 about 42 Japanese lived in ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        ".  Between the Japanese surrender of Taiwan in 42 and April 42 42 the Republic of China forces repatriated 42% of the Japanese living in Taiwan to Japan.  During the immediate postwar period, the Kuomintang administration on Taiwan was repressive and extremely corrupt compared with the previous Japanese rule, leading to local discontent. Anti-": null
    },
    {
        "mainlander": "mainland chinese"
    },
    {
        " violence flared on February 42 42 prompted by an incident in which a cigarette seller was injured and a passerby was indiscriminately shot dead by Nationalist authorities. During the ensuing crackdown by the KMT administration in what became known as the ": null
    },
    {
        "February 42 Incident": "february 28 incident"
    },
    {
        ", tens of thousands of people were killed or arrested, and the incident became a ": null
    },
    {
        "taboo": "taboo"
    },
    {
        " topic of discussion for the entire ": null
    },
    {
        "martial law": "martial law"
    },
    {
        " era.     From the 42s onward the ": null
    },
    {
        "Chinese Civil War": "chinese civil war"
    },
    {
        " was underway in mainland China between ": null
    },
    {
        "Chiang Kai-shek": "chiang kai-shek"
    },
    {
        "s ROC government and the ": null
    },
    {
        "Communist Party of China": "communist party of china"
    },
    {
        " led by ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        ". When the Communists gained complete control of Mainland China in 42 two million refugees, predominantly from the Nationalist government, military, and business community, ": null
    },
    {
        "fled to Taiwan": "chinese nationalist party retreat to taiwan"
    },
    {
        ". On October 42 42 the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " was founded in mainland China by the victorious communists; several months before, Chiang Kai-shek had established a provisional ROC capital in ": null
    },
    {
        "Taipei": "taipei"
    },
    {
        " and moved his government there from ": null
    },
    {
        "Nanjing": "nanjing"
    },
    {
        ". Under Nationalist rule, the mainlanders dominated the government and civil services.               In the immediate aftermath of World War II, post-war economic conditions compounded with the then-ongoing ": null
    },
    {
        "Chinese Civil War": "chinese civil war"
    },
    {
        " caused severe ": null
    },
    {
        "inflation": "inflation"
    },
    {
        " across mainland China and in Taiwan, made worse by disastrous currency reforms and corruption. This gave way to the reconstruction process and new reforms.     The KMT took control of Taiwans monopolies that had been owned by the Japanese prior to World War II. They nationalized approximately 42% of Taiwans ": null
    },
    {
        "GNP": "gnp"
    },
    {
        " and voided Japanese bond certificates held by Taiwanese investors. These real estate holdings as well as American aid such as the ": null
    },
    {
        "China Aid Act": "china aid act"
    },
    {
        " and the ": null
    },
    {
        "Sino-American Joint Commission on Rural Reconstruction": "sino-american joint commission on rural reconstruction"
    },
    {
        " helped to ensure that Taiwan would recover quickly from war. The Kuomintang government also moved the entire ": null
    },
    {
        "gold reserve": "official gold reserves"
    },
    {
        " from the Chinese mainland to Taiwan, and used this reserve to back the newly issued ": null
    },
    {
        "New Taiwan dollar": "new taiwan dollar"
    },
    {
        " to stabilize the new currency and put a stop to ": null
    },
    {
        "hyperinflation": "hyperinflation"
    },
    {
        ".     The KMT authorities implemented a far-reaching and highly successful ": null
    },
    {
        "land reform": "land reform"
    },
    {
        " program on Taiwan during the 42s. The ": null
    },
    {
        "42 Rent Reduction Act": "375 rent reduction act"
    },
    {
        " alleviated tax burden on peasants and another act redistributed land among small farmers and compensated large landowners with commodities certificates and stock in state-owned industries. Although this left some large landowners impoverished, others turned their compensation into capital and started commercial and industrial enterprises. These entrepreneurs were to become Taiwans first ": null
    },
    {
        "industrial capitalists": "industrial capitalism"
    },
    {
        ". Together with businessmen who fled from mainland China, they once again revived Taiwans prosperity previously ceased along with Japanese withdrawal and managed Taiwans transition from an agricultural to a commercial, industrial economy.     From 42 to 42 Taiwan received a total of $42 billion in economic aid and $42 billion in military aid from the United States. In 42 all American aid ceased when Taiwan had established a solid financial base. Having accomplished that, ": null
    },
    {
        "ROC president": "president of the republic of china"
    },
    {
        " Chiang Ching-kuo": "chiang ching-kuo"
    },
    {
        "   started state projects such as the ": null
    },
    {
        "Ten Major Construction Projects": "ten major construction projects"
    },
    {
        " that provided the infrastructure for building a strong export-driven economy. Taiwan has developed steadily into a major international trading power with more than $42 billion in two-way trade and one of the highest ": null
    },
    {
        "foreign exchange reserves": "foreign exchange reserves"
    },
    {
        " in the world. Tremendous prosperity on the island was accompanied by economic and social stability. Taiwans phenomenal economic development earned it a spot as one of the ": null
    },
    {
        "Four Asian Tigers": "four asian tigers"
    },
    {
        ".       Until the early 42s, the Republic of China was recognized as the sole legitimate government of China by the United Nations and most Western nations; who refused to recognize the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " on account of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ". The KMT ruled Taiwan under ": null
    },
    {
        "martial law": "martial law"
    },
    {
        " until the late 42s, with the stated goal of being vigilant against Communist infiltration and preparing to retake mainland China. Therefore, political dissent was not tolerated.     The late 42s and early 42s were a turbulent time for Chinese people born in Taiwan, as many of the people who had originally been oppressed and left behind by economic changes became members of the Taiwans new middle class. Free enterprise had allowed native Taiwanese to gain a powerful bargaining chip in their demands for respect for their basic human rights. The ": null
    },
    {
        "Kaohsiung Incident": "kaohsiung incident"
    },
    {
        " would be a major turning point for democracy in Taiwan.     Taiwan also faced setbacks in the international sphere. In 42 the ROC government walked out of the United Nations shortly before it recognized the PRC government in Beijing as the legitimate holder of Chinas seat in the United Nations. The ROC had been offered dual representation, but Chiang Kai-shek demanded to retain a seat on the ": null
    },
    {
        "UN Security Council": "united nations security council"
    },
    {
        ", which was not acceptable to the PRC. Chiang expressed his decision in his famous ": null
    },
    {
        "the sky is not big enough for two suns": "the sky is not big enough for two suns"
    },
    {
        " speech. In October 42 ": null
    },
    {
        "Resolution 42": "china and the united nations"
    },
    {
        " was passed by the UN General Assembly and the representatives of Chiang Kai-shek were expelled from the UN and replaced as China by the PRC. In 42 the United States switched recognition from Taipei to Beijing.     Chiang Kai-shek died in April 42 and was succeeded to the presidency by ": null
    },
    {
        "Yen Chia-kan": "yen chia-kan"
    },
    {
        " while his son ": null
    },
    {
        "Chiang Ching-kuo": "chiang ching-kuo"
    },
    {
        " succeeded to the leadership of the Kuomintang . Formerly the head of the feared ": null
    },
    {
        "secret police": "secret police"
    },
    {
        ", Chiang Ching-kuo recognized gaining foreign support to securing the ROCs future security required reform. His administration saw a gradual loosening of political controls, a transition towards democracy, and moves toward ": null
    },
    {
        "Taiwanization": "taiwanization"
    },
    {
        " of the regime. Opponents of the Nationalists were no longer forbidden to hold meetings or publish papers. Though opposition political parties were still illegal, when the ": null
    },
    {
        "Democratic Progressive Party": "democratic progressive party"
    },
    {
        " was established as the first opposition party in 42 President Chiang decided against dissolving the group or persecuting its leaders. Its candidates officially ran in elections as independents in the ": null
    },
    {
        "Tangwai movement": "tangwai movement"
    },
    {
        ". In the following year, Chiang ended martial law and allowed family visits to ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ". Chiang selected ": null
    },
    {
        "Lee Teng-hui": "lee teng-hui"
    },
    {
        ", a Taiwan born technocrat to be his vice president; the first in the line of succession to the presidency. The move followed other reforms giving more power to native born citizens and calmed anti-KMT sentiments.     After Chiang Ching-kuo died in 42 his successor, President ": null
    },
    {
        "Lee Teng-hui": "lee teng-hui"
    },
    {
        ", continued to democratize the government. Lee transferred more government authority to Taiwanese born citizens, and Taiwan underwent a process of ": null
    },
    {
        "Taiwanization": "taiwanization"
    },
    {
        ". In this localization process, local culture and history was promoted over a pan-China viewpoint. Lees reforms included printing banknotes from the Central Bank instead of the usual Provincial Bank of Taiwan. He also largely suspended the operation of the ": null
    },
    {
        "Taiwan Provincial Government": "taiwan provincial government"
    },
    {
        ". In 42 the ": null
    },
    {
        "Legislative Yuan": "legislative yuan"
    },
    {
        " and ": null
    },
    {
        "National Assembly": "national assembly"
    },
    {
        " elected in 42 were forced to resign. These groups were originally created to represent mainland China constituencies. The restrictions on the use of ": null
    },
    {
        "Taiwanese languages": "languages of taiwan"
    },
    {
        " in the broadcast media and in schools were also lifted.     However, Lee failed to crack down on the massive corruption that pervaded the government and many KMT loyalists felt that Lee betrayed the ROC by taking reforms too far, while those in the opposition felt he did not take reforms far enough.       Lee ran as the incumbent in Taiwans first direct ": null
    },
    {
        "presidential election in 42": "1996 republic of china presidential election"
    },
    {
        " against DPP candidate and former dissident, Peng Min-ming. This election prompted the PRC to conduct a series of missile tests in the ": null
    },
    {
        "Taiwan Strait": "taiwan strait"
    },
    {
        " to intimidate the Taiwanese electorate so that electorates would vote for other pro-unification candidates, ": null
    },
    {
        "Chen Li-an": "chen li-an"
    },
    {
        " and ": null
    },
    {
        "Lin Yang-kang": "lin yang-kang"
    },
    {
        ". The aggressive tactic prompted U.S. President ": null
    },
    {
        "Clinton": "bill clinton"
    },
    {
        " to invoke the ": null
    },
    {
        "Taiwan Relations Act": "taiwan relations act"
    },
    {
        " and dispatch two aircraft carrier battle groups into the region off Taiwans southern coast to monitor the situation, and PRCs missile tests were forced to end earlier than planned. This incident is known as the ": null
    },
    {
        "42 Taiwan Straits Crisis": "third taiwan strait crisis"
    },
    {
        ".     One of Lees final acts as president was to declare on German radio that the ROC and the PRC have a ": null
    },
    {
        "special state to state relationship": "special state-to-state relations"
    },
    {
        ". Lees statement was met with the PRCs Peoples Army conducting military drills in Fujian and a frightening island-wide ": null
    },
    {
        "blackout": "power outage"
    },
    {
        " in Taiwan, causing many to fear an attack or cyberattack.     The ": null
    },
    {
        "42 presidential election": "2000 roc presidential election"
    },
    {
        " marked the end of the Kuomintang rule. DPP candidate ": null
    },
    {
        "Chen Shui-bian": "chen shui-bian"
    },
    {
        " won a three-way race that saw the ": null
    },
    {
        "Pan-Blue": "pan-blue"
    },
    {
        " vote split by independent ": null
    },
    {
        "James Soong": "james soong"
    },
    {
        " and Kuomintang candidate ": null
    },
    {
        "Lien Chan": "lien chan"
    },
    {
        ". Chen garnered 42% of the vote. Asia Society, Opposition Wins Taiwan Election, After the election, Soong formed the ": null
    },
    {
        "People First Party": "people first party"
    },
    {
        " .     ": null
    },
    {
        "In 42": "2004 taiwan presidential election"
    },
    {
        ", President Chen was re-elected to a second four-year term after an assassination attempt which occurred the day before the election. Two shots were fired, with one bullet grazing the Presidents belly after penetrating the windshield of a jeep and several layers of clothing and the other bullet penetrated the windshield and hitting the vice presidents knee cast. Police investigators have said that the most likely suspect is believed to have been ": null
    },
    {
        "Chen Yi-hsiung": "chen yi-hsiung"
    },
    {
        ", who was later found dead. Reuters, Taiwan election shooting suspect dead, Their injuries were not life-threatening, but the incident is believed by Pan-Blue to have gained them enough sympathy to influence the result.     That incident might also have given president Chen the ability to declare a state of emergency and martial law, which allegedly prevented the police and military, which were strongly Pan-Blue, from voting. Lien refused to concede, alleging voting irregularities. Kuomintang and PFP supporters held mass protests throughout the following weeks. Subsequently, Kuomintang and PFP took the case to the court. The ": null
    },
    {
        "High Court": "high court of taiwan"
    },
    {
        " ordered a recount and found no evidence to support the accusation made by Kuomintang and PFP. The Court decided that the election result was legitimate and valid.     During the ": null
    },
    {
        "legislative elections": "2004 taiwan legislative election"
    },
    {
        " held on December 42 42 the Kuomintang-PFP dominated Pan-Blue alliance gained a slim majority in the elections which resulted in President Chen resigning as DPP chairman. The cabinet of Premier ": null
    },
    {
        "Yu Shyi-kun": "yu shyi-kun"
    },
    {
        " resigned, and ": null
    },
    {
        "Frank Hsieh": "frank hsieh"
    },
    {
        " assumed premiership on January 42 42     In a move that some saw as a reaction to Chens re-election, the Peoples Republic of China enacted a proposed ": null
    },
    {
        "anti-secession law": "national unification promotion law of the peoples republic of china"
    },
    {
        " that allows the ": null
    },
    {
        "use of force": "use of force"
    },
    {
        " on Taiwan and the Republic of China government if it formally declares independence. However, this law was met with overwhelming protest from nearly all political parties and public figures of the Republic of China and disapproval from the western countries. Negotiations in January in ": null
    },
    {
        "Macau": "macau"
    },
    {
        " between the aviation authorities from both the Republic of China and Peoples Republic of China resulted in direct ": null
    },
    {
        "cross-strait charter flights": "cross-strait charter"
    },
    {
        " between mainland China and Taiwan during the ": null
    },
    {
        "Chinese Lunar New Year": "chinese new year"
    },
    {
        " Period.     In a twist of events, President Chen and PFP Chairman Soong held a summit and the independence-leaning president indicated that eventual ": null
    },
    {
        "reunification with mainland China": "chinese unification"
    },
    {
        " would be an option. Against the anti-secession law proposed by the Peoples Republic of China, President Chen held a video conference with the ": null
    },
    {
        "European Parliament": "european parliament"
    },
    {
        " in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        " urging the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " not to lift the arms embargo on the Peoples Republic of China.     Domestic politics during the Chen administration were largely a political stalemate as the Kuomintang and PFP together held a pan-Blue majority in the legislature. Among the many items that made little progress due to the political stalemate were a stalled arms procurement bill, which would have advanced defense capabilities of the Republic of China through the purchase of weaponry, such as sub-hunting ": null
    },
    {
        "P42 Orion": "p-3 orion"
    },
    {
        "s, from the US government, and banking reform legislation, which would have helped in the consolidation of the many banks in the Republic of China, none of which hold even 42% shares of the local market. The ": null
    },
    {
        "president of the Republic of China": "president of the republic of china"
    },
    {
        ", unlike the president of the United States, does not wield ": null
    },
    {
        "veto power": "veto power"
    },
    {
        ", providing him with little to no leverage in negotiating with an opposition legislature, regardless of how slim the majority.     The constitution was ": null
    },
    {
        "further amended": "additional articles of the constitution of the republic of china"
    },
    {
        " in 42 creating a two-vote electoral system, with ": null
    },
    {
        "single member plurality": "single member plurality"
    },
    {
        " seats and ": null
    },
    {
        "proportional representative": "proportional representation"
    },
    {
        " seats, and abolishing the National Assembly, transferring most of its former powers to the ": null
    },
    {
        "Legislative Yuan": "legislative yuan"
    },
    {
        ", and leaving further amendment voting to public referendums. The issue of formally declaring the ": null
    },
    {
        "independence of Taiwan": "taiwan independence"
    },
    {
        " is also a constant constitutional question. Arms purchases from the United States are still a controversial political question, with the ": null
    },
    {
        "Pan-Green Coalition": "pan-green coalition"
    },
    {
        " camp favoring the purchase, and the ": null
    },
    {
        "Pan-Blue Coalition": "pan-blue coalition"
    },
    {
        " opposing it.     Recent allegations about ": null
    },
    {
        "corruption": "political corruption"
    },
    {
        " inside the ": null
    },
    {
        "First Family": "first family"
    },
    {
        " had led to three ": null
    },
    {
        "recall motions": "recall election"
    },
    {
        " votes in the ": null
    },
    {
        "Legislative Yuan": "legislative yuan"
    },
    {
        " aimed at ousting President ": null
    },
    {
        "Chen Shui-bian": "chen shui-bian"
    },
    {
        ". All of them had failed since the Pan-Blue Coalition lacked the ": null
    },
    {
        "two-thirds majority": "two-thirds majority"
    },
    {
        " required to complete the process and the ": null
    },
    {
        "political parties": "political parties"
    },
    {
        " voted according to political lines. The ": null
    },
    {
        "First Lady": "first lady"
    },
    {
        ", ": null
    },
    {
        "Wu Shu-chen": "wu shu-chen"
    },
    {
        " was prosecuted for corruption, namely illegally using state funds for personal reasons.     The president faced similar accusations as his wife, but was protected from prosecution by presidential ": null
    },
    {
        "immunity": "legal immunity"
    },
    {
        ". He had promised to resign if his wife was found guilty. However, after his wife fainted in the preparation hearing, she had sought and obtained absence of leave from the Court 42 times citing health concerns before President Chen Shui-bians term was complete. , China Post     In December 42 municipal and mayoral elections were held in ": null
    },
    {
        "Taipei": "taipei"
    },
    {
        " and ": null
    },
    {
        "Kaohsiung": "kaohsiung"
    },
    {
        ". The ": null
    },
    {
        "KMT": "kmt"
    },
    {
        " retained a clear majority in the capital, while the ": null
    },
    {
        "DPP": "democratic progressive party"
    },
    {
        " and the KMT obtained very close results in the southern city of ": null
    },
    {
        "Kaohsiung": "kaohsiung"
    },
    {
        ". ": null
    },
    {
        "Huang Chun-ying": "huang chun-ying"
    },
    {
        " lost to ": null
    },
    {
        "Chen Chu": "chen chu"
    },
    {
        " by a margin of 42 percent; 42 votes to 42 votes, making ": null
    },
    {
        "Chen Chu": "chen chu"
    },
    {
        " the first female mayor of a ": null
    },
    {
        "special municipality": "special municipality"
    },
    {
        " in the Republic of China. In 42 the ROC applied for membership in the United Nations under the name Taiwan , and was rejected by the General Assembly.     In 42 President Chen proposed a policy of ": null
    },
    {
        "Four Wants and One Without": "four wants and one without"
    },
    {
        ", which in substance states that Taiwan wants independence; Taiwan wants the rectification of its name; Taiwan wants a new constitution; Taiwan wants development; and Taiwanese politics is without ": null
    },
    {
        "the question of left or right": "left–right political spectrum"
    },
    {
        ", but only the question of ": null
    },
    {
        "unification": "chinese unification"
    },
    {
        " or ": null
    },
    {
        "independence": "taiwan independence movement"
    },
    {
        ". The reception of this proposed policy in Taiwanese general public was unclear. It, however, was met with a cold reception by both the PRC and the United States. The PRC Foreign Minister emphasised that the ": null
    },
    {
        "Anti-Secession Law": "anti-secession law"
    },
    {
        " was not a piece of ": null
    },
    {
        "unenforceable legislation": "unenforceable"
    },
    {
        ", while the US Department of State spokesman Sean McCormack described Chens policy as unhelpful .      The KMT also retained control of the legislature in the ": null
    },
    {
        "Legislative Yuan elections in January 42": "2008 republic of china legislative election"
    },
    {
        ". In the ": null
    },
    {
        "presidential election in May 42": "2008 republic of china presidential election"
    },
    {
        ", KMT candidate ": null
    },
    {
        "Ma Ying-jeou": "ma ying-jeou"
    },
    {
        " ran on a platform supporting friendlier relations with mainland China and economic reforms, and defeated DPP candidate ": null
    },
    {
        "Frank Hsieh": "frank hsieh"
    },
    {
        " with 42% of the vote.     On the same day President Chen left office, losing presidential immunity, the Supreme Prosecutors Office announced that they were launching an inquiry into corruption charges regarding Chen.  Later in 42 members of his administration, including ": null
    },
    {
        "Chiou I-jen": "chiou i-jen"
    },
    {
        ", a former National Security Council secretary-general, and Yeh Sheng-mao, former director-general of the Ministry of Justices Investigation Bureau, were arrested on ": null
    },
    {
        "corruption charges": "chen shui-bian corruption charges"
    },
    {
        ". Chiou I-jen was found not guilty,  Taipei Times while Yeh Sheng-mao was convicted and sentenced to 42 years in prison.      Ma was re-elected, and the KMT retained its majority in the ": null
    },
    {
        "Legislative Yuan": "legislative yuan"
    },
    {
        ", in combined elections in January 42     In March and April 42 students protesting against undemocratic methods used by the KMT ": null
    },
    {
        "occupied the parliament building": "sunflower student movement"
    },
    {
        ". In the end, the government agreed to put on hold the ratification of an agreement with China which they had pushed through without proper debate. This event had far reaching consequences, and changed the mood of the electorate. In the ": null
    },
    {
        "combined elections in January 42": "2016 republic of china general election"
    },
    {
        " the opposition candidate for President, ": null
    },
    {
        "Tsai Ing-wen": "tsai ing-wen"
    },
    {
        ", of the DPP won with 42% of the vote, and the opposition DPP was catapulted into an outright majority in the parliament. The election marked the first time a non-KMT party won a majority in the legislature.     The elections held on November 42 42 resulted in a major setback for the DPP majority and led to President ": null
    },
    {
        "Tsai Ing-wen": "tsai ing-wen"
    },
    {
        " resignation as leader of the party.  The DPP lost a total of nine legislative seats, giving the KMT control of the majority of the 42 seats.  KMT mayoral candidates won in ": null
    },
    {
        "New Taipei City": "new taipei city"
    },
    {
        ", ": null
    },
    {
        "Taichung": "taichung"
    },
    {
        " and ": null
    },
    {
        "Kaohsiung": "kaohsiung"
    },
    {
        ", the latter of which has been a political stronghold for the DPP for 42 years. ": null
    }
]