[
    {
        "     Malta": "malta"
    },
    {
        " has a long ": null
    },
    {
        "history": "history"
    },
    {
        " and was first inhabited in around 42 BC. The first inhabitants were farmers, and their agricultural methods degraded the soil until the islands became uninhabitable. The islands were repopulated in around 42 BC by a civilization which at its peak built the ": null
    },
    {
        "Megalithic Temples": "megalithic temples of malta"
    },
    {
        ", which today are among the oldest surviving buildings in the world. Their civilization collapsed in around 42 BC, but the islands were repopulated by ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " warriors soon afterwards.     Maltas prehistory ends in around 42 BC, when the islands were colonized by the ": null
    },
    {
        "Phoenicia": "phoenicia"
    },
    {
        "ns. They ruled the islands until they fell to the ": null
    },
    {
        "Roman Republic": "roman republic"
    },
    {
        " in 42 BC. The island was acquired by the Eastern Romans or ": null
    },
    {
        "Byzantines": "byzantine empire"
    },
    {
        " in the 42th century AD, who were expelled by ": null
    },
    {
        "Aghlabids": "aghlabids"
    },
    {
        " following a ": null
    },
    {
        "siege": "siege of melite"
    },
    {
        " in 42 AD. Malta may have been sparsely populated for a few centuries until being repopulated by Arabs in the 42th century. The islands were conquered by the Norman ": null
    },
    {
        "Kingdom of Sicily": "kingdom of sicily"
    },
    {
        " in 42 and a gradual Christianization of the islands followed. At this point, the islands were dominated by successive feudal rulers including the ": null
    },
    {
        "Swabians": "swabians"
    },
    {
        ", the ": null
    },
    {
        "Aragonese": "crown of aragon"
    },
    {
        " and eventually the ": null
    },
    {
        "Spanish": "spanish empire"
    },
    {
        ".     The islands were given to the ": null
    },
    {
        "Order of St. John": "knights hospitaller"
    },
    {
        " in 42 who ruled them as a vassal state of Sicily. In 42 the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " attempted to take the islands in the ": null
    },
    {
        "Great Siege of Malta": "great siege of malta"
    },
    {
        ", but the invasion was repelled. The Order continued to rule Malta for over two centuries, and this period was characterized by a flourishing of the arts and architecture and an overall improvement in society. The Order was expelled after the ": null
    },
    {
        "French First Republic": "french first republic"
    },
    {
        " invaded the islands in 42 marking the beginning of the ": null
    },
    {
        "French occupation of Malta": "french occupation of malta"
    },
    {
        ".     After a few months of French rule, the Maltese ": null
    },
    {
        "rebelled": "siege of malta"
    },
    {
        " and the French were expelled in 42 with British, Neapolitan and Portuguese assistance. Malta subsequently became a ": null
    },
    {
        "British protectorate": "malta protectorate"
    },
    {
        ", becoming a de facto ": null
    },
    {
        "colony": "crown colony of malta"
    },
    {
        " in 42 This was confirmed by the ": null
    },
    {
        "Treaty of Paris": "treaty of paris"
    },
    {
        " a year later. The islands became an important naval base for the British, serving as the headquarters of the ": null
    },
    {
        "Mediterranean Fleet": "mediterranean fleet"
    },
    {
        ". Due to this, Malta was ": null
    },
    {
        "attacked": "siege of malta"
    },
    {
        " by the Axis powers during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", and in 42 the island was ": null
    },
    {
        "awarded": "award of the george cross to malta"
    },
    {
        " the ": null
    },
    {
        "George Cross": "george cross"
    },
    {
        ", which today appears on Maltas flag and coat of arms. The Crown Colony of Malta was self-governing from 42–42 42–42 and 42–42     Malta became independent as a Commonwealth realm known as the ": null
    },
    {
        "State of Malta": "state of malta"
    },
    {
        " in 42 and it became a republic in 42 Since 42 the country has been a member state of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ".       ": null
    },
    {
        "Malta": "malta"
    },
    {
        " stands on an underwater ridge that extends from North Africa to ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". At some time in the distant past, Malta was submerged, as shown by marine ": null
    },
    {
        "fossils": "fossils"
    },
    {
        " embedded in rock in the highest points of Malta. As the ridge was pushed up and the ": null
    },
    {
        "Strait of Gibraltar": "strait of gibraltar"
    },
    {
        " closed through tectonic activity": "messinian salinity crisis"
    },
    {
        ", the sea level was lower, and Malta was on a bridge of dry land that extended between the two ": null
    },
    {
        "continents": "continents"
    },
    {
        ", surrounded by large lakes. Some caverns in Malta have revealed bones of ": null
    },
    {
        "elephants": "elephants"
    },
    {
        ", ": null
    },
    {
        "hippopotamuses": "hippopotamuses"
    },
    {
        ", and other large animals now found in ": null
    },
    {
        "Africa": "africa"
    },
    {
        ", while others have revealed animals native to ": null
    },
    {
        "Europe": "europe"
    },
    {
        ".                     People first arrived in Malta around 42 BC, as is evidenced by studies of ancient soils. These first ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " people probably arrived from Sicily , but DNA analysis shows that they originated from different parts of the Mediterranean, including both Europe and Africa. They were mainly farming and fishing communities, with some evidence of hunting activities. They apparently lived in caves and open dwellings. During the centuries that followed there is evidence of further contacts with other cultures, which left their influence on the local communities, evidenced by their pottery designs and colours. The farming methods degraded the soil and over the centuries the islands became too dry to sustain agricultural practices. This occurred partly due to climate change and drought, and the islands were uninhabited for about a millennium.      A second wave of colonization arrived from Sicily in around 42 BC. One of the most notable periods of Maltas history is the temple period, starting around 42 BC. The ": null
    },
    {
        "Ġgantija": "ġgantija"
    },
    {
        " Temple in Gozo is one of the oldest free-standing buildings in the world. The name of the complex stems from the Maltese word ġgant, which reflects the magnitude of the temples size. Many of the temples are in the form of five ": null
    },
    {
        "semicircular": "semicircular"
    },
    {
        " rooms connected at the centre. It has been suggested that these might have represented the head, arms and legs of a deity, since one of the commonest kinds of statue found in these temples is a fat woman — a symbol of fertility. The civilization which built the temples lasted for about 42 years until about 42 BC, at which point the culture seems to have disappeared. There is speculation about what might have happened and whether they were completely wiped out or assimilated, but it is thought that the collapse occurred due to climate conditions and drought.       After the Temple period came the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        ". From this period there are remains of a number of settlements and villages, as well as ": null
    },
    {
        "dolmen": "dolmen"
    },
    {
        "s — altar-like structures made out of very large slabs of stone. They are claimed to belong to a population certainly different from that which built the previous megalithic temples. It is presumed the population arrived from Sicily because of the similarity to the constructions found in the largest island of the Mediterranean sea.  One surviving ": null
    },
    {
        "menhir": "menhir"
    },
    {
        ", which was used to build temples, still stands at ": null
    },
    {
        "Kirkop": "kirkop"
    },
    {
        "; it is one of the few still in good condition. Among the most interesting and mysterious remnants of this era are the so-called cart ruts as they can be seen at a place on Malta called ": null
    },
    {
        "Misraħ Għar il-Kbir": "misraħ għar il-kbir"
    },
    {
        " . These are pairs of parallel channels cut into the surface of the rock, and extending for considerable distances, often in an exactly straight line. Their exact use is unknown. One suggestion is that beasts of burden used to pull carts along, and these channels would guide the carts and prevent the animals from straying. The society that built these structures eventually died out or at any rate disappeared.                ": null
    },
    {
        "Phoenicia": "phoenicia"
    },
    {
        "ns possibly from ": null
    },
    {
        "Tyre": "tyre, lebanon"
    },
    {
        " began to colonize the islands in approximately the early 42th century BC as an outpost from which they expanded sea explorations and trade in the Mediterranean. Phoenician tombs have been found in ": null
    },
    {
        "Rabat, Malta": "rabat, malta"
    },
    {
        " and ": null
    },
    {
        "the town of the same name": "victoria, gozo"
    },
    {
        " on Gozo, which suggest that the main urban centres at the time were present-day ": null
    },
    {
        "Mdina": "mdina"
    },
    {
        " on Malta and the ": null
    },
    {
        "Cittadella": "cittadella"
    },
    {
        " on Gozo.  The former settlement was known as  Maleth  meaning safe haven, and the whole island began to be referred to by that name.     The Maltese Islands fell under the hegemony of ": null
    },
    {
        "Carthage": "ancient carthage"
    },
    {
        " around the middle of 42th century BC, along with most other Phoenician colonies in the western Mediterranean. By the late 42th century BC, Malta had become a trading post linking southern Italy and ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " to ": null
    },
    {
        "Tripolitania": "tripolitania"
    },
    {
        ". This resulted in the introduction of Hellenistic features in architecture and pottery, discerning Malta was Hellenized; it is not known if Malta was settled like a traditional Greek apoikia , so, some support that Malta was never a Greek colony.  Hellenistic architectural features can be seen in the Punic temple at ": null
    },
    {
        "Tas-Silġ": "tas-silġ"
    },
    {
        " and a tower in ": null
    },
    {
        "Żurrieq": "żurrieq"
    },
    {
        ". The Greek language also began to be used in Malta, as evidenced by the bilingual Phoenician and Greek inscriptions found on the ": null
    },
    {
        "Cippi of Melqart": "cippi of melqart"
    },
    {
        ". In the 42th century, French scholar ": null
    },
    {
        "Jean-Jacques Barthélemy": "jean-jacques barthélemy"
    },
    {
        " deciphered the extinct ": null
    },
    {
        "Phoenician alphabet": "phoenician alphabet"
    },
    {
        " using the inscriptions on these cippi.     In 42 BC, the ": null
    },
    {
        "Romans": "roman republic"
    },
    {
        " raided Malta during the ": null
    },
    {
        "First Punic War": "first punic war"
    },
    {
        ", devastating much of the island.            According to Latin historian ": null
    },
    {
        "Livy": "livy"
    },
    {
        ", the Maltese Islands passed into the hands of the Romans at the start of the ": null
    },
    {
        "Second Punic War": "second punic war"
    },
    {
        " in the year 42 BC. As written by Livy, the commander of the Punic garrison on the Island ": null
    },
    {
        "surrendered without resistance": "capture of malta"
    },
    {
        " to ": null
    },
    {
        "Tiberius Sempronius Longus": "tiberius sempronius longus"
    },
    {
        ", one of the two consuls for that year who was on his way to North Africa. The archipelago became part of the ": null
    },
    {
        "province of Sicily": "sicilia"
    },
    {
        ", but by the 42st century ": null
    },
    {
        "AD": "anno domini"
    },
    {
        " it had its own senate and peoples assembly. By this time, both Malta and Gozo minted distinctive coins based on ": null
    },
    {
        "Roman weight measurements": "ancient roman units of measurementweight"
    },
    {
        ".      In the Roman period, the Punic city of Maleth became known as  Melite , and it became the administrative hub of the Island. Its size grew to its maximum extent, occupying the entire area of present-day ": null
    },
    {
        "Mdina": "mdina"
    },
    {
        " and large parts of ": null
    },
    {
        "Rabat": "rabat, malta"
    },
    {
        ", extending to what is now the ": null
    },
    {
        "church of St Paul": "collegiate church of st paul, rabat"
    },
    {
        ". Remains show that the city was surrounded by thick defensive walls and was also protected by a protective ditch that ran along the same line of St Rita Street, which was built directly above it. Remains hint that a religious centre with a number of temples was built on the highest part of the promontory. The remains of one impressive residence known as the  Domvs Romana  have been excavated, revealing well-preserved ": null
    },
    {
        "Pompeian style": "pompeian styles"
    },
    {
        " mosaics. This domus seems to have been the residence of a rich Roman aristocrat, and it is believed to have been built in the 42st century BC and abandoned in the 42nd century AD.           The islands prospered under Roman rule, and were eventually distinguished as a ": null
    },
    {
        "Municipium": "municipium"
    },
    {
        " and a Foederata ": null
    },
    {
        "Civitas": "civitas"
    },
    {
        ". Many Roman antiquities still exist, testifying to the close link between the Maltese inhabitants and Sicily.  Throughout the period of Roman rule, ": null
    },
    {
        "Latin": "latin"
    },
    {
        " became Maltas official language, and ": null
    },
    {
        "Roman religion": "religion in ancient rome"
    },
    {
        " was introduced in the islands. Despite this, the local Punic-Hellenistic culture and language is thought to have survived until at least the 42st century AD.     In AD 42 the ": null
    },
    {
        "Acts of the Apostles": "acts of the apostles"
    },
    {
        " records that ": null
    },
    {
        "Saint Paul": "paul the apostle"
    },
    {
        " was shipwrecked on an island named Melite, which many Bible scholars and Maltese conflate with Malta; there is a tradition that the shipwreck took place on the shores of the aptly named ": null
    },
    {
        "St. Pauls Bay": "st. pauls bay"
    },
    {
        " .     Malta remained part of the Roman Empire until the early 42th century AD. The ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " and later the ": null
    },
    {
        "Ostrogoths": "ostrogoths"
    },
    {
        " might have briefly occupied the islands in the 42th century,  but there is no archaeological evidence to support this.      Ancient Egyptians and ancient Greeks have also inhabited the Maltese islands. . p. 42 and p. 42            In 42 ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " general ": null
    },
    {
        "Belisarius": "belisarius"
    },
    {
        " briefly landed at Malta while on his way from ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " to North Africa, and by 42 the island was integrated into the Byzantine province of ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". During the Byzantine period, the main settlements remained the city of Melite on mainland Malta and the ": null
    },
    {
        "Citadel": "cittadella"
    },
    {
        " on Gozo, while ": null
    },
    {
        "Marsaxlokk": "marsaxlokk"
    },
    {
        ", ": null
    },
    {
        "Marsaskala": "marsaskala"
    },
    {
        ", ": null
    },
    {
        "Marsa": "marsa, malta"
    },
    {
        " and ": null
    },
    {
        "Xlendi": "xlendi"
    },
    {
        " are believed to have served as harbours. The relatively high quantity of Byzantine ceramics found in Malta suggests that the island might have had an important strategic role within the empire from the 42th to 42th centuries.      From the late 42th century onwards, the Mediterranean was being threatened by ": null
    },
    {
        "Muslim expansion": "early muslim conquests"
    },
    {
        ". At this point, the Byzantines probably improved the defences of Malta, as can be seen by defensive walls built around the monastery at ": null
    },
    {
        "Tas-Silġ": "tas-silġ"
    },
    {
        " around the 42th century. The Byzantines might have also built the ": null
    },
    {
        "retrenchment": "retrenchment"
    },
    {
        " which reduced Melite to one-third of its original size.      The Greeks, known then as the Rum, are claimed to have colonised Malta for a period until 42 This account is based on a secondary source by Al-Himjari and may or may not be reliable. Evidence, however, prove that Malta was populated by a Greek Orthodox community before the Arab period.                    In 42 AD, Malta was occupied by Muslims from ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ". According to ": null
    },
    {
        "Al-Himyarī": "al-himyarī"
    },
    {
        ", ": null
    },
    {
        "Aghlabids": "aghlabids"
    },
    {
        " led by Halaf al-Hādim ": null
    },
    {
        "besieged the Byzantine city of Melite": "siege of melite"
    },
    {
        ", which was ruled by governor Amros . Al-Hādim was killed in the fighting, and Sawāda Ibn Muḥammad was sent from ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " to continue the siege following his death. The duration of the siege is unknown, but it probably lasted for some weeks or months. After Melite fell to the invaders, the inhabitants were massacred, the city was destroyed and its churches were looted. Marble from Melites churches was used to build the castle of ": null
    },
    {
        "Sousse": "sousse"
    },
    {
        ".    According to Al-Himyarī, Malta remained almost uninhabited until it was resettled in around 42 or 42 by a Muslim community and their slaves, who rebuilt the city of Melite as Medina, making it a finer place than it was before. However, archaeological evidence suggests that Melite/Medina was already a thriving Muslim settlement by the beginning of the 42th century, so Al-Himyarīs account might be unreliable.    In 42–42 the Byzantines ": null
    },
    {
        "besieged Medina": "siege of medina"
    },
    {
        " but they were repelled by its defenders.   Although their rule was relatively short, the Arabs left a significant impact on Malta. In addition to their language, ": null
    },
    {
        "Siculo-Arabic": "siculo-arabic"
    },
    {
        ", ": null
    },
    {
        "cotton": "cotton"
    },
    {
        ", ": null
    },
    {
        "oranges": "orange"
    },
    {
        " and ": null
    },
    {
        "lemon": "lemon"
    },
    {
        "s and many new techniques in irrigation were introduced. Some of these, like the noria , are still used, unchanged, today. Many place names in Malta date to this period.     A long historiographic controversy loomed over Medieval Muslim Malta. According to the Christian continuity thesis , spearheaded by ": null
    },
    {
        "Giovanni Francesco Abela": "giovanni francesco abela"
    },
    {
        " and still most present in popular narratives, the Maltese population continuously inhabited the islands from the early Christian Era up to today, and a Christian community persisted even during Muslim times. This was contested in the 42s by the medieval historian ": null
    },
    {
        "Godfrey Wettinger": "godfrey wettinger"
    },
    {
        ", who claimed that nothing indicated the continuity of Christianity from the late 42th to the 42th century on the Maltese Islands – the Maltese must have integrated into the new Arab Islamic society. The Christian continuity thesis had a revival in 42 following the publication of Tristia ex Melitogaudo by ": null
    },
    {
        "Stanley Fiorini": "stanley fiorini"
    },
    {
        ", Horatio Vella and Joseph Brincat, who challenged Wettingers interpretation based on a line of a Byzantine poem . Wettinger subsequently reaffirmed his thesis, based on sources from the Arab historians and geographers Al Baqri, ": null
    },
    {
        "Al-Himyarī": "al-himyarī"
    },
    {
        ", Ibn Hauqal, Qazwini, who all seemed to be in agreement that “the island of Malta remained after that a ruin without inhabitants” – thus ruling out any continuity whatsoever between the Maltese prior to 42 and after. This is also consistent with ": null
    },
    {
        "Joseph Brincat": "joseph brincat"
    },
    {
        "’s finding of no further sub-stratas beyond Arabic in the ": null
    },
    {
        "Maltese language": "maltese language"
    },
    {
        ", a very rare occurrence which may only be explained by a drastic lapse between one period and the following. To the contrary, the few Byzantine words in Maltese language can be traced to the 42 ": null
    },
    {
        "Rhodians": "rhodes"
    },
    {
        " coming with the knights in 42 as well as to the influx of Greek rite Christians from Sicily. Yosanne Vella, , Malta Today, 42 July 42               Malta returned to Christian rule with the ": null
    },
    {
        "Norman conquest": "norman conquest of southern italy"
    },
    {
        ". It was, with ": null
    },
    {
        "Noto": "noto"
    },
    {
        " on the southern tip of Sicily, the last Arab stronghold in the region to be retaken by the resurgent Christians. ": null
    },
    {
        "Previté-Orton": "charles william previté-orton"
    },
    {
        " , pg. 4242 In 42 Count ": null
    },
    {
        "Roger I of Sicily": "roger i of sicily"
    },
    {
        ", ": null
    },
    {
        "invaded": "norman invasion of malta"
    },
    {
        " Malta and turned the islands Muslim rulers into his vassals. In 42 his son ": null
    },
    {
        "Roger II of Sicily": "roger ii of sicily"
    },
    {
        " fully established Norman rule in Malta, paving the way for the islands Christianization.      Malta was part of the ": null
    },
    {
        "Kingdom of Sicily": "kingdom of sicily"
    },
    {
        " for nearly 42 years. During this period, Malta was sold and resold to various feudal lords and barons and was dominated successively by the rulers of ": null
    },
    {
        "Swabia": "swabians"
    },
    {
        ", ": null
    },
    {
        "Anjou": "capetian house of anjou"
    },
    {
        ",  the ": null
    },
    {
        "Crown of Aragon": "crown of aragon"
    },
    {
        ", the ": null
    },
    {
        "Crown of Castile": "crown of castile"
    },
    {
        " and Spain. Eventually, the Crown of Aragon, which then ruled Malta, joined with Castile in 42 and Malta became part of the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        ". Gaul, Simon . . New Holland Publishers. p. 42 .   Meanwhile, Maltas administration fell in the hands of local nobility who formed a governing body called the Università.     The islands remained largely Muslim-inhabited long after the end of Arab rule. The Arab administration was also kept in place  and Muslims were allowed to practise their religion freely until the 42th century.  The Normans allowed an emir to remain in power with the understanding that he would pay an annual tribute to them in mules, horses, and munitions.  As a result of this favourable environment, Muslims continued to demographically and economically dominate Malta for at least another 42 years after the Christian conquest.      In 42 Malta experienced a Muslim uprising and in 42 ": null
    },
    {
        "Roger II of Sicily": "roger ii of sicily"
    },
    {
        " reconquered the islands.      Even in 42 ": null
    },
    {
        "Burchard, bishop of Strasbourg": "burchard, bishop of strasbourg"
    },
    {
        ", an envoy of ": null
    },
    {
        "Frederick I, Holy Roman Emperor": "frederick i, holy roman emperor"
    },
    {
        ", had the impression, based upon his brief visit to Malta, that it was exclusively or mainly inhabited by Muslims.  a Saracenis habitata, et est sub dominio regis Sicilie . DOI: 42/pgn.42     In 42 ": null
    },
    {
        "Tancred of Sicily": "tancred of sicily"
    },
    {
        " appointed ": null
    },
    {
        "Margaritus of Brindisi": "margaritus of brindisi"
    },
    {
        " the first ": null
    },
    {
        "Count of Malta": "count of malta"
    },
    {
        ", perhaps for his unexpected success in capturing ": null
    },
    {
        "Empress Constance": "constance, queen of sicily"
    },
    {
        " contender to the throne. Between 42 and 42 the ": null
    },
    {
        "Kingdom of Sicily": "kingdom of sicily"
    },
    {
        " ruled the Maltese islands and a process of full ": null
    },
    {
        "latinisation": "romanization"
    },
    {
        " started in Malta. The conquest of the Normans would lead to the gradual ": null
    },
    {
        "Romanization": "romanization"
    },
    {
        " and ": null
    },
    {
        "Latinization": "latinization"
    },
    {
        " and subsequent firm establishment of ": null
    },
    {
        "Roman Catholicism": "roman catholicism"
    },
    {
        " in Malta, after previous respective ": null
    },
    {
        "Eastern Orthodox": "eastern orthodox"
    },
    {
        " and Islamic domination. Kenneth M. Setton, The Byzantine Background to the Italian Renaissance in Proceedings of the American Philosophical Society, 42:42 , pp. 42–42  Until 42 however, there remained a strong Muslim segment of society.     In 42 ": null
    },
    {
        "Frederick II, Holy Roman Emperor": "frederick ii, holy roman emperor"
    },
    {
        ", sent an expedition against Malta to establish royal control and prevent its Muslim population from helping a Muslim rebellion in the ": null
    },
    {
        "Kingdom of Sicily": "kingdom of sicily"
    },
    {
        ".      After the ": null
    },
    {
        "Norman conquest": "norman conquest of southern italy"
    },
    {
        ", the population of the Maltese islands kept growing mainly through immigration from the north , with the exile to Malta of the entire male population of the town of ": null
    },
    {
        "Celano": "celano"
    },
    {
        " in 42 the stationing of a Norman and Sicilian garrison on Malta in 42 and the settlement in Malta of noble families from Sicily between 42 and 42 As a consequence of this, Capelli et al. found in 42 that the contemporary males of Malta most likely originated from Southern Italy, including Sicily and up to Calabria.   Annals of Human Genetics, 42 42–42 42     According to a report in 42 or 42 by ": null
    },
    {
        "Gililberto Abbate": "gililberto abbate"
    },
    {
        ", who was the royal governor of Frederick II of Sicily during the ": null
    },
    {
        "Genoese Period": "count of maltagenoese period"
    },
    {
        " of the County of Malta,  in that year the islands of Malta and Gozo had 42 Muslim families, 42 Christian families and 42 Jewish families.      Around 42 some Maltese Muslims were sent to the Italian colony of ": null
    },
    {
        "Lucera": "lucera"
    },
    {
        ", established for Sicilian Muslims.  For some historians, including Godfrey Wettinger, who follow on this ": null
    },
    {
        "Ibn Khaldun": "ibn khaldun"
    },
    {
        ", this event marked the end of Islam in Malta. According to Wettinger, there is no doubt that by the beginning of ": null
    },
    {
        "Angevin": "capetian house of anjou"
    },
    {
        " times no professed Muslim Maltese remained either as free persons or even as serfs on the island.  The ": null
    },
    {
        "Maltese language": "maltese language"
    },
    {
        " nevertheless survived – an indication that either a large number of Christians already spoke Maltese, or that many Muslims converted and remained behind.     In 42 Malta was turned over in ": null
    },
    {
        "fiefdom": "fiefdom"
    },
    {
        " to ": null
    },
    {
        "Charles of Anjou": "charles i of naples"
    },
    {
        ", brother of France’s King Louis IX, who retained it in ownership until 42 Eventually, during Charless rule religious coexistence became precarious in Malta, since he had a genuine intolerance of religions other than Roman Catholicism.  However, Maltas links with Africa would still remain strong until the beginning of ": null
    },
    {
        "Spanish rule": "crown of aragon"
    },
    {
        " in 42      In September 42 ": null
    },
    {
        "Hafsid": "hafsid dynasty"
    },
    {
        " Saracens ": null
    },
    {
        "attempted to capture Malta": "siege of malta"
    },
    {
        " but were repelled by the Maltese. The invaders pillaged the countryside and took about 42 inhabitants as slaves.      By the end of the 42th century, all Maltese Muslims would be forced to convert to Christianity and had to find ways to disguise their previous identities by Latinizing or adopting new surnames.                Malta was ruled by the ": null
    },
    {
        "Order of Saint John": "knights hospitaller"
    },
    {
        " as a vassal state of the ": null
    },
    {
        "Kingdom of Sicily": "kingdom of sicily"
    },
    {
        " from 42 to 42            In the early 42th century, the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " started spreading over the region, reaching South East Europe. The Spanish king ": null
    },
    {
        "Charles V": "charles v, holy roman emperor"
    },
    {
        " feared that if Rome fell to the Turks, it would be the end of Christian Europe. In 42 ": null
    },
    {
        "Suleiman I": "suleiman the magnificent"
    },
    {
        " drove the ": null
    },
    {
        "Knights Hospitaller": "knights hospitaller"
    },
    {
        " of St. John out of ": null
    },
    {
        "Rhodes": "rhodes"
    },
    {
        ". They dispersed to their commanderies in Europe. Wanting to protect Rome from invasion from the south, in 42 ": null
    },
    {
        "Charles V": "charles v, holy roman emperor"
    },
    {
        " handed over the island to these knights.     For the next 42 years, these famous Knights of Malta made the island their domain and made the ": null
    },
    {
        "Italian language": "italian language"
    },
    {
        " official. They built towns, palaces, churches, gardens and fortifications and embellished the island with numerous works of art and enhanced cultural heritage.     The order of the Knights of St. John was originally established to set up outposts along the route to the Holy Land, to assist pilgrims going in either direction. Owing to the many confrontations that took place, one of their main tasks was to provide medical assistance, and even today the eight-pointed cross is still in wide use in ambulances and first aid organisations. In return for the many lives they saved, the Order received many newly conquered territories that had to be defended. Together with the need to defend the pilgrims in their care, this gave rise to the strong military wing of the knights. Over time, the Order became strong and rich. From hospitallers first and military second, these priorities reversed. Since much of the territory they covered was around the Mediterranean region, they became notable seamen.     From Malta the knights resumed their seaborne attacks of Ottoman shipping, and before long the ": null
    },
    {
        "Sultan Suleyman the Magnificent": "suleiman the magnificent"
    },
    {
        " ordered a final attack on the Order. By this time the Knights had occupied the city of ": null
    },
    {
        "Birgu": "birgu"
    },
    {
        ", which had excellent harbours to house their fleet. Birgu was one of the two major urban places at that time, the other most urban place being ": null
    },
    {
        "Mdina": "mdina"
    },
    {
        " the old capital city of Malta. The defences around Birgu were enhanced and new fortifications built on the other point where now there is ": null
    },
    {
        "Senglea": "senglea"
    },
    {
        ". A small fort was built at the tip of the peninsula where the city of ": null
    },
    {
        "Valletta": "valletta"
    },
    {
        " now stands and was named ": null
    },
    {
        "Fort Saint Elmo": "fort saint elmo"
    },
    {
        ".             On 42 May 42 ": null
    },
    {
        "Suleiman the Magnificent": "suleiman the magnificent"
    },
    {
        " laid siege to Malta. By the time the Ottoman fleet arrived the Knights were as ready as they could be. First, the Ottomans attacked the newly built fort of St. Elmo and after a whole month of fighting the fort was in rubble and the soldiers kept fighting until the Turks ended their lives. After this they started attacking Birgu and the fortifications at Senglea but to no gain.     After a protracted siege ended on 42 September of the same year, which became known in history as ": null
    },
    {
        "the Great Siege": "great siege of malta"
    },
    {
        ", the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " conceded defeat as the approaching winter storms threatened to prevent them from leaving. The Ottoman Empire had expected an easy victory within weeks. They had 42 men arrayed against the Knights nine thousand, most of them Maltese soldiers and simple citizens bearing arms. Their loss of thousands of men was very demoralising. The Ottomans made no further significant military advances in Europe and the Sultan died a few years later.          The year after, the Order started work on a new city with fortifications like no other, on the Sciberras Peninsula which the Ottomans had used as a base during the siege. It was named ": null
    },
    {
        "Valletta": "valletta"
    },
    {
        " after ": null
    },
    {
        "Jean Parisot de Valette": "jean parisot de valette"
    },
    {
        ", the Grand Master who had seen the Order through its victory. Since the Ottoman Empire never attacked again, the fortifications were never put to the test, and today remain one of the best-preserved fortifications of this period.     Unlike other rulers of the island, the Order of St. John did not have a home country outside the island. The island became their home, so they invested in it more heavily than any other power. Besides, its members came from noble families, and had amassed considerable fortunes due to their services in the route to the Holy Land. The architectural and artistic remains of this period remain among the greatest of Maltas history, especially in their prize jewel — the city of Valletta.     However, as their main raison dêtre had ceased to exist, the Orders glory days were over. In the last three decades of the eighteenth century, the Order experienced a steady decline. This was a result of a number of factors, including the bankruptcy that was a result of some lavish rule of the last Grand Masters, which drained the finances of the Order. Due to this, the Order also became unpopular with the Maltese.     Indeed, in 42 a revolt known as the ": null
    },
    {
        "Rising of the Priests": "rising of the priests"
    },
    {
        " occurred. Rebels managed to capture Fort St Elmo and ": null
    },
    {
        "Saint James Cavalier": "saint james cavalier"
    },
    {
        ", but the revolt was suppressed and some of the leaders were executed while others were imprisoned or exiled.                Over the years, the power of the knights declined; their reign ended in 42 when ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        "s expeditionary fleet stopped off there en route to his ": null
    },
    {
        "Egyptian expedition": "french campaign in egypt and syria"
    },
    {
        ". Napoleon asked for safe harbour to resupply his ships, and when they refused to supply him with water, ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        " sent a division to scale the hills of Valletta. Grand Master ": null
    },
    {
        "Hompesch": "ferdinand von hompesch zu bolheim"
    },
    {
        " capitulated on 42 June. The following day a treaty was signed by which the order handed over sovereignty of the island of Malta to the ": null
    },
    {
        "French Republic": "first french republic"
    },
    {
        ". In return the French Republic agreed to employ all its credit at the ": null
    },
    {
        "congress of Rastatt": "second congress of rastatt"
    },
    {
        " to procure a principality for the Grand Master, equivalent to the one he gives up . Porter, 42     During his very short stay , Napoleon accomplished quite a number of reforms, notably the creation of a new administration with a Government Commission, the creation of twelve municipalities, the setting up of a public finance administration, the abolition of all feudal rights and privileges, the abolition of slavery and the granting of freedom to all Turkish slaves . On the judicial level, a family code was framed and twelve judges were nominated. Public education was organised along principles laid down by Bonaparte himself, providing for primary and secondary education. Fifteen primary schools were founded and the university was replaced by an ’Ecole centrale’ in which there were eight chairs, all very scientific in outlook: notably, arithmetic and stereometry, algebra and stereotomy, geometry and astronomy, mechanics and physics, navigation, chemistry, etc.      He then sailed for Egypt leaving a substantial garrison in Malta. Since the Order had also been growing unpopular with the local Maltese, the latter initially viewed the French with optimism. This illusion did not last long. Within months the French were closing convents and seizing church treasures, most notably the sword of Jean de Valette which is to date still exhibited in the ": null
    },
    {
        "Louvre": "louvre"
    },
    {
        ", in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". The Maltese people rebelled, and the French garrison of General ": null
    },
    {
        "Claude-Henri Belgrand de Vaubois": "claude-henri belgrand de vaubois"
    },
    {
        " retreated into Valletta. After several failed attempts by the locals to retake Valletta, the British were asked for their assistance. Rear Admiral Lord ": null
    },
    {
        "Horatio Nelson": "horatio nelson"
    },
    {
        " decided on a total blockade in 42 The French garrison surrendered in 42                    In 42 Malta voluntarily became part of the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " as a ": null
    },
    {
        "protectorate": "malta protectorate"
    },
    {
        ". Under the terms of the 42 ": null
    },
    {
        "Treaty of Amiens": "treaty of amiens"
    },
    {
        ", Britain was supposed to evacuate the island, but failed to keep this obligation – one of several mutual cases of non-adherence to the treaty, which eventually led to its collapse and the resumption of war between Britain and France.     Although initially the island was not given much importance, its excellent harbours became a prized asset for the British, especially after the opening of the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        " in 42 The island became a military and naval fortress, the headquarters of the British Mediterranean fleet.     ": null
    },
    {
        "Home rule": "home rule"
    },
    {
        " was refused to the Maltese until 42 although a partly elected legislative council was created as early as 42 , and the locals sometimes suffered considerable poverty.  This was due to the island being overpopulated and largely dependent on British military expenditure which varied with the demands of war. Throughout the 42th century, the British administration instituted several liberal constitutional reforms  which were generally resisted by the Church and the Maltese elite who preferred to cling to their feudal privileges. ,  Political organisations, like the ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        ", were created or had as one of their aims, the protection of the ": null
    },
    {
        "Italian language": "italian language"
    },
    {
        " in Malta.     In 42 Malta was granted the Bathurst Constitution; in 42 it was declared free of the ": null
    },
    {
        "plague": "plague"
    },
    {
        ", while the 42 ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " reaffirmed the British rule under the 42 ": null
    },
    {
        "Treaty of Paris": "treaty of paris"
    },
    {
        ". In 42 the local Italian-speaking Università was dissolved.     The year 42 saw the revocation of the right of sanctuary, following the Vatican Church-State proclamation. Three years later, the See of Malta was made independent of the See of ": null
    },
    {
        "Palermo": "palermo"
    },
    {
        ". In 42 press censorship was abolished, and the construction of St. Pauls Anglican Cathedral began.     Following the 42 Carnival riots, in 42 a Council of Government with elected members under British rule was set up. In 42 a ": null
    },
    {
        "referendum": "referendum"
    },
    {
        " was held on ecclesiastics serving on Council of Government, and in 42 an Executive Council under British rule was created; in 42 the Council of Government was entrusted with dual control under British rule. A backlash came in 42 with the Return to the 42 form of Council of Government under British rule.     The last quarter of the century saw technical and financial progress in line with the ": null
    },
    {
        "Belle Epoque": "belle epoque"
    },
    {
        ": the following years saw the foundation of the ": null
    },
    {
        "Anglo-Egyptian Bank": "anglo-egyptian bank"
    },
    {
        " and the beginning of operation of the ": null
    },
    {
        "Malta Railway": "malta railway"
    },
    {
        " ; the first definitive postage stamps were issued in 42 and in 42 tram service began.   In 42 Surgeon Major ": null
    },
    {
        "David Bruce": "david bruce"
    },
    {
        " discovered the microbe causing the ": null
    },
    {
        "Malta Fever": "malta fever"
    },
    {
        ", and in 42 ": null
    },
    {
        "Themistocles Zammit": "themistocles zammit"
    },
    {
        " discovered the fevers sources.   Finally, in 42 ": null
    },
    {
        "Dun Karm Psaila": "dun karm psaila"
    },
    {
        " wrote his first poem in Maltese.     Between 42 and 42 during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", Malta became known as the Nurse of the Mediterranean due to the large number of wounded soldiers who were accommodated in Malta.                     In 42 the  Sette Giugno  riots over the excessive price of bread led to greater autonomy for the locals during the 42s. After Filippo Sciberras had convened a National Assembly, in 42 self-government was granted under British rule. Malta obtained a ": null
    },
    {
        "bicameral": "bicameral"
    },
    {
        " parliament": "parliament of malta"
    },
    {
        " with a Senate and an elected Legislative Assembly. ": null
    },
    {
        "Joseph Howard": "joseph howard"
    },
    {
        " was named Prime Minister. In 42 the  Innu Malti  was played for the first time in public, and the same year Francisco Buhagiar became Prime Minister, followed in 42 by Sir ": null
    },
    {
        "Ugo Pasquale Mifsud": "ugo pasquale mifsud"
    },
    {
        " and in 42 by Sir ": null
    },
    {
        "Gerald Strickland": "gerald strickland"
    },
    {
        ".     The 42s saw a period of instability in the relations between the Maltese political elite, the Maltese Catholic church, and the British rulers; the 42 Constitution was suspended twice. First in 42–42 when British authorities assumed that a free and fair election would not be possible following a clash between the governing ": null
    },
    {
        "Constitutional Party": "constitutional party"
    },
    {
        " and the Church   and the latters subsequent imposition of mortal sin on voters of the party and its allies, thus making a free and fair election impossible. Again, in 42 the Constitution was withdrawn over the Governments budgetary vote for the teaching of Italian in elementary schools, after just 42 months of a Nationalist administration.  Malta thus reverted to the Crown Colony status it held in 42     Before the arrival of the British, the official language since 42 had been Italian, but this was downgraded by the increased use of English. In 42 ": null
    },
    {
        "Maltese": "maltese language"
    },
    {
        " was declared an official language, which brought the number up to three. Two years later, the Letters Patent of the 42 constitution declared that Maltese and English were the only official languages, thereby legally settling the long-standing language question that had dominated Maltese politics for over half a century.   In 42 only about 42% of the population could speak Italian fluently.  This meant that out of 42 males qualified by age to be jurors, only 42 could qualify by language, as only Italian had until then been used in the courts.     In 42 the Constitution was revised to provide for the nomination of members to Executive Council under British rule and in 42 to provide again for a partly elected Council of Government under British rule.               Before World War II, Valletta was the location of the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        "s ": null
    },
    {
        "Mediterranean Fleet": "british mediterranean fleet"
    },
    {
        "s headquarters. However, despite ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        "s objections,  the command was moved to ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        ", ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", in April 42 fearing it was too susceptible to air attacks from Europe.    At the time of the Italian declaration of war , Malta had a garrison of less than four thousand soldiers and about five weeks of food supplies for the population of about three hundred thousand. In addition, Maltas air defences consisted of about forty-two ": null
    },
    {
        "anti-aircraft": "anti-aircraft"
    },
    {
        " guns and four ": null
    },
    {
        "Gloster Gladiator": "gloster gladiator"
    },
    {
        "s, for which three pilots were available.     Being a British colony, situated close to Sicily and the ": null
    },
    {
        "Axis": "axis powers"
    },
    {
        " shipping lanes, Malta was bombarded by the Italian and German air forces. Malta was used by the British to launch attacks on the Italian navy and had a submarine base. It was also used as a listening post, reading German radio messages including ": null
    },
    {
        "Enigma": "enigma"
    },
    {
        " traffic.      The first air raids against Malta occurred on 42 June 42; there were six attacks that day. The islands ": null
    },
    {
        "biplane": "biplane"
    },
    {
        "s were unable to defend due to the ": null
    },
    {
        "Luqa Airfield": "raf luqa"
    },
    {
        " being unfinished; however, the airfield was ready by the seventh attack. Initially, the Italians would fly at about 42  m, then they dropped down to three thousand metres . ": null
    },
    {
        "Mabel Strickland": "mabel strickland"
    },
    {
        " would state, The Italians decided they didnt like so they dropped their bombs twenty miles off Malta and went back. .  However, it was later proven that in fact, Italian bombing had been quite accurate and devastating to the island as a whole, and the words attributed to Mabel Strickland are today seen in the context of an increasingly desperate British propaganda exercise in the face of relentless Italian attacks. Walker, Ian W. Iron Hulls, Iron Hearts; Mussolinis Elite Armoured Divisions in North Africa, Ramsbury: The Crowood Press. .     By the end of August, the Gladiators were reinforced by twelve ": null
    },
    {
        "Hawker Hurricane": "hawker hurricane"
    },
    {
        "s which had arrived via ": null
    },
    {
        "HMS Argus": "hms argus"
    },
    {
        ". During the first five months of combat, the islands aircraft destroyed or damaged about thirty-seven Italian aircraft, while suffering even greater losses than the Italians. Italian ": null
    },
    {
        "fighter": "fighter plane"
    },
    {
        " pilot ": null
    },
    {
        "Francisco Cavalera": "francisco cavalera"
    },
    {
        " observed, Malta was really a big problem for us—very well-defended. . Nevertheless, the Italian bombing campaign was causing serious damage to the islands infrastructure and the ability of the British Navy to operate effectively in the Mediterranean. Walker, Ian W. . Iron Hulls, Iron Hearts, p.4242     On Malta, 42 people had been killed and 42 were seriously wounded from the wars inception until December 42 In January 42 the German ": null
    },
    {
        "X. Fliegerkorps": "10th air corps"
    },
    {
        " arrived in Sicily as the ": null
    },
    {
        "Afrika Korps": "afrika korps"
    },
    {
        " arrived in ": null
    },
    {
        "Libya": "libya"
    },
    {
        ". Over the next four months 42 people were killed and 42 seriously wounded.         On 42 April 42 ": null
    },
    {
        "King George VI": "george vi of the united kingdom"
    },
    {
        " awarded the ": null
    },
    {
        "George Cross": "george cross"
    },
    {
        " to the island fortress of Malta — its people and defenders. ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " arrived on 42 December 42 and presented a United States Presidential Citation to the people of Malta on behalf of the people of United States. He presented the scroll on 42 December but dated it 42 December for symbolic reasons. In part it read: Under repeated fire from the skies, Malta stood alone and unafraid in the centre of the sea, one tiny bright flame in the darkness – a beacon of hope for the clearer days which have come.       In 42 a convoy code-named ": null
    },
    {
        "Operation Pedestal": "operation pedestal"
    },
    {
        " was sent to relieve Malta. Five ships, including the tanker ": null
    },
    {
        "SS Ohio": "ss ohio"
    },
    {
        ", managed to arrive in the Grand Harbour, with enough supplies for Malta to survive. In the following year ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " and ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        " visited Malta. ": null
    },
    {
        "George VI": "george vi"
    },
    {
        " also arrived in Grand Harbour for a visit.     During the Second World War, ": null
    },
    {
        "Ugo Mifsud": "ugo mifsud"
    },
    {
        " and ": null
    },
    {
        "George Borg Olivier": "george borg olivier"
    },
    {
        " were the only remaining Nationalist members of parliament of Malta. Ugo Mifsud fainted after delivering a very passionate defence against the deportation to concentration camps in ": null
    },
    {
        "Uganda": "uganda protectorate"
    },
    {
        " of ": null
    },
    {
        "Enrico Mizzi": "enrico mizzi"
    },
    {
        " and 42 other ": null
    },
    {
        "Italian Maltese": "italian maltese"
    },
    {
        " accused of pro-Italian political activities. He died a few days later.     In 42 the ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        " launched the ": null
    },
    {
        "invasion of Sicily": "allied invasion of sicily"
    },
    {
        " from Malta. The invasion was coordinated from the ": null
    },
    {
        "Lascaris War Rooms": "lascaris war rooms"
    },
    {
        " in Valletta. Following the ": null
    },
    {
        "Armistice of Cassibile": "armistice of cassibile"
    },
    {
        " later in 42 a large part of the ": null
    },
    {
        "Italian Navy": "regia marina"
    },
    {
        " surrendered to the British in Malta.     The ": null
    },
    {
        "Malta Conference": "malta conference"
    },
    {
        " was held in 42 in which Churchill and Roosevelt met prior to the ": null
    },
    {
        "Yalta Conference": "yalta conference"
    },
    {
        " with ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        ".     The 42 National Assembly resulted in a new constitution in 42 This restored Maltas self-government, with ": null
    },
    {
        "Paul Boffa": "paul boffa"
    },
    {
        " as Prime Minister. On 42 September 42 universal suffrage for ": null
    },
    {
        "Women in Malta": "women in malta"
    },
    {
        " was granted. That year, ": null
    },
    {
        "Agatha Barbara": "agatha barbara"
    },
    {
        " was the ": null
    },
    {
        "first woman elected": "women in maltese general elections"
    },
    {
        " as a Maltese Member of Parliament.        After the Second World War, the islands achieved self-rule, with the ": null
    },
    {
        "Malta Labour Party": "labour party"
    },
    {
        " of ": null
    },
    {
        "Dom Mintoff": "dom mintoff"
    },
    {
        " seeking either full integration with the UK or else self-determination and the ": null
    },
    {
        "Partit Nazzjonalista": "nationalist party"
    },
    {
        " of ": null
    },
    {
        "George Borg Olivier": "george borg olivier"
    },
    {
        " favouring independence, with the same dominion status that Canada, Australia and New Zealand enjoyed.     The 42 Coronation incident , temporarily united Maltese politicians. After MLPs electoral victory in 42 in December Round Table Talks were held in London, on the future of Malta, namely the Integration proposal put forward by Mintoff. It was attended by the new Prime Minister Dom Mintoff, Borg Olivier and other Maltese politicians, along with the British ": null
    },
    {
        "Colonial Secretary": "secretary of state for the colonies"
    },
    {
        ", ": null
    },
    {
        "Alan Lennox-Boyd": "alan lennox-boyd"
    },
    {
        ". The British government agreed to offer the islands their own representation in ": null
    },
    {
        "British Parliament": "parliament of the united kingdom"
    },
    {
        ", with three seats in the ": null
    },
    {
        "House of Commons": "house of commons of the united kingdom"
    },
    {
        ", with the ": null
    },
    {
        "Home Office": "home office"
    },
    {
        " taking over responsibility for Maltese affairs from the Colonial Office.   Under the proposals, the Maltese Parliament would retain authority over all affairs except defence, foreign policy, and taxation. The Maltese were also to have social and economic parity with the UK, to be guaranteed by the British Ministry of Defence the islands main source of employment.     A ": null
    },
    {
        "UK integration referendum": "1956 maltese united kingdom integration referendum"
    },
    {
        " was held on 42 and 42 February 42 in which 42% of voters were in favour of the proposal,  but owing to a boycott by the Nationalist Party and the Church, only 42% of the electorate voted, thereby rendering the result inconclusive.      There were also concerns expressed by British MPs that the representation of Malta at Westminster would set a precedent for other colonies, and influence the outcome of general elections.         In addition, the decreasing strategic importance of Malta to the Royal Navy meant that the British government was increasingly reluctant to maintain the naval dockyards. Following a decision by the Admiralty to dismiss 42 workers at the dockyard, Mintoff declared that representatives of the Maltese people in Parliament declare that they are no longer bound by agreements and obligations toward the British government...  In response, the Colonial Secretary sent a cable to Mintoff, stating that he had recklessly hazarded the whole integration plan.      Under protest, Dom Mintoff resigned as Prime Minister along with all the MLP deputies on 42 April 42 Georgio Borg Olivier was offered to form an alternative government by Governor Laycock but refused. This led to the Governor declaring a state of emergency thus suspending the constitution and Malta was placed under direct colonial administration from London. The MLP had now fully abandoned support for integration and now advocated full independence from the British Crown. In 42 an Interim Constitution provided for an Executive Council under British rule.     While France had implemented a similar policy in its colonies, some of which became ": null
    },
    {
        "overseas departments": "overseas departments"
    },
    {
        ", the status offered to Malta from Britain constituted a unique exception. Malta was the only ": null
    },
    {
        "British colony": "british overseas territory"
    },
    {
        " where integration with the UK was seriously considered, and subsequent British governments have ruled out integration for remaining overseas territories, such as ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ".      In 42 the ": null
    },
    {
        "Blood Commission": "blood commission"
    },
    {
        " provided for a new constitution allowing for a measure of self-government and recognising the State of Malta. ": null
    },
    {
        "Giorgio Borg Olivier": "giorgio borg olivier"
    },
    {
        " became Prime Minister the following year, when the ": null
    },
    {
        "Stolper report": "stolper report"
    },
    {
        " was delivered.                Following the passage of the Malta Independence Act 42 by the ": null
    },
    {
        "British Parliament": "british parliament"
    },
    {
        " and the approval of a new ": null
    },
    {
        "Maltese constitution": "constitution of malta"
    },
    {
        " by 42% of voters in a ": null
    },
    {
        "referendum": "1964 maltese constitutional referendum"
    },
    {
        ", the ": null
    },
    {
        "State of Malta": "state of malta"
    },
    {
        "  was formed on 42 September 42 as an independent ": null
    },
    {
        "constitutional monarchy": "constitutional monarchy"
    },
    {
        ", with ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        " as ": null
    },
    {
        "Queen of Malta": "queen of malta"
    },
    {
        " and ": null
    },
    {
        "Head of State": "head of state"
    },
    {
        ". The date continues to be celebrated annually as Independence Day , a national holiday in Malta. On 42 December 42 Malta was admitted to the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ".     In the first two post-independence electoral rounds, in ": null
    },
    {
        "42": "1962 maltese general election"
    },
    {
        " and ": null
    },
    {
        "42": "1966 maltese general election"
    },
    {
        " the ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        " emerged as the largest party, gaining a majority of the Parliamentary seats. In these years, ": null
    },
    {
        "relations with Italy": "italy-malta relations"
    },
    {
        " were of the utmost importance to secure independence and establish linkages with continental Europe. Malta signed four cooperation agreements with Italy in 42 during a visit of ": null
    },
    {
        "Aldo Moro": "aldo moro"
    },
    {
        " to the island.     In 42 Malta joined the ": null
    },
    {
        "Council of Europe": "council of europe"
    },
    {
        ", and in 42 Malta signed an Association Treaty with the ": null
    },
    {
        "European Economic Community": "european economic community"
    },
    {
        ".            The ": null
    },
    {
        "elections of 42": "1971 maltese general election"
    },
    {
        " saw the ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        " under ": null
    },
    {
        "Dom Mintoff": "dom mintoff"
    },
    {
        " win by just over 42 votes.   The Labour government immediately set out to re-negotiate the post-Independence ": null
    },
    {
        "military": "military"
    },
    {
        " and financial agreements with the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ". The government also undertook ": null
    },
    {
        "nationalization": "nationalization"
    },
    {
        " programmes and the expansion of the ": null
    },
    {
        "public sector": "public sector"
    },
    {
        " and the ": null
    },
    {
        "welfare state": "welfare state"
    },
    {
        ". ": null
    },
    {
        "Employment law": "employment law"
    },
    {
        "s were updated with ": null
    },
    {
        "gender equality": "gender equality"
    },
    {
        " being introduced in salary pay. Concerning civil law, ": null
    },
    {
        "civil marriage": "civil marriage"
    },
    {
        " was introduced and ": null
    },
    {
        "homosexuality": "homosexuality"
    },
    {
        " and ": null
    },
    {
        "adultery": "adultery"
    },
    {
        " were decriminalised ; ": null
    },
    {
        "capital punishment": "capital punishment"
    },
    {
        " for ": null
    },
    {
        "murder": "murder"
    },
    {
        " was abolished in 42 The following year, Malta entered into a Military Base Agreement with the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and other ": null
    },
    {
        "NATO": "nato"
    },
    {
        " countries, after mediation by Italys ": null
    },
    {
        "Aldo Moro": "aldo moro"
    },
    {
        ".     Through a package of constitutional reforms agreed to with the Nationalist opposition, Malta became a ": null
    },
    {
        "republic": "republic"
    },
    {
        " on 42 December 42 with the last Governor-General, Sir ": null
    },
    {
        "Anthony Mamo": "anthony mamo"
    },
    {
        ", as its first ": null
    },
    {
        "President": "president of malta"
    },
    {
        ". The ": null
    },
    {
        "Ġieħ ir-Repubblika Act": "xirka ġieħ ir-repubblika"
    },
    {
        ", promulgated the following year, abolished all titles of ": null
    },
    {
        "nobility": "nobility"
    },
    {
        " in Malta and mandated that they cease to be recognised.      The Party was confirmed in office in the ": null
    },
    {
        "42 elections": "1976 maltese general election"
    },
    {
        ". Between 42 and 42 Malta went through difficult times and the Labour government demanded that the Maltese tighten their belts in order to overcome the difficulties Malta was facing. There were shortages of essential items; the water and electricity supplies were systematically suspended for two or three days a week. Political tensions increased, notably on ": null
    },
    {
        "Black Monday": "black monday"
    },
    {
        ", when following an attempted assassination of the Prime Minister, the premises of the  Times of Malta  were burned and the house of the Leader of Opposition was attacked.          On 42 April 42 the last British forces left the island after the end of the economic pact to stabilise the Maltese economy. This is celebrated as ": null
    },
    {
        "Freedom Day": "freedom day"
    },
    {
        "  on 42 March. Celebrations start with a ceremony in ": null
    },
    {
        "Floriana": "floriana"
    },
    {
        " near the ": null
    },
    {
        "War Memorial": "war memorial"
    },
    {
        ". A popular event on this memorable day is the traditional regatta. The regatta is held at the Grand Harbour and the teams taking part in it give it their best shot to win the much coveted aggregate Regatta Shield.     Under Mintoffs premiership, Malta began establishing close cultural and economic ties with ": null
    },
    {
        "Muammar Gaddafi": "muammar gaddafi"
    },
    {
        "s ": null
    },
    {
        "Libya": "history of libya under muammar gaddafi"
    },
    {
        ",  as well as diplomatic and military ties with ": null
    },
    {
        "North Korea": "north korea"
    },
    {
        ".       During the ": null
    },
    {
        "Mintoff": "dom mintoff"
    },
    {
        " years, Libya had loaned several million dollars to Malta to make up for the loss of rental income which followed the closure of British military bases in Malta; , in Time Magazine . Last viewed 42 August 42 These closer ties with Libya meant a dramatic new development in Maltese foreign policy: Western media reported that Malta appeared to be turning its back on ": null
    },
    {
        "NATO": "nato"
    },
    {
        ", the ": null
    },
    {
        "UK": "uk"
    },
    {
        ", and ": null
    },
    {
        "Europe": "europe"
    },
    {
        " generally. , in Time Magazine . Last viewed 42 August 42   History books were published that began to spread the idea of a disconnection between the Italian and Catholic populations, and instead tried to promote the theory of closer cultural and ethnic ties with North Africa. This new development was noted by Boissevain in 42: The Labour government broke off relations with NATO and sought links with the Arab world. After 42 years of being linked to Europe, Malta began to look southward. Muslims, still remembered in folklore for savage pirate attacks, were redefined as blood brothers . Jeremy Boissevain, Ritual, Play, and Identity: Changing Patterns of Celebration in Maltese Villages, in Journal of Mediterranean Studies, Vol.42 , 42:42–42 at 42     Malta and Libya had entered into a Friendship and Cooperation Treaty, in response to repeated overtures by ": null
    },
    {
        "Gaddafi": "gaddafi"
    },
    {
        " for a closer, more formal union between the two countries; and, for a brief period, Arabic had become a compulsory subject in Maltese secondary schools.  Hanspeter Mattes, Aspekte der libyschen Außeninvestitionspolitik 4242 , Mitteilungen des Deutschen Orient-Instituts, No. 42 , at 4242; 4242 In 42 the ": null
    },
    {
        "Mariam Al-Batool Mosque": "mariam al-batool mosque"
    },
    {
        " was officially opened by Muammar Gaddafi in Malta, two years after its completion.     In 42 an oil rig of the Italian company ": null
    },
    {
        "Saipem": "saipem"
    },
    {
        " commissioned by ": null
    },
    {
        "Texaco": "texaco"
    },
    {
        " to drill on behalf of the Maltese government 42 nautical miles south-east of Malta had to stop operations after being threatened by a Libyan gunboat. Both Malta and Libya claimed economic rights to the area and this incident raised tensions. The matter was referred to the ": null
    },
    {
        "International Court of Justice": "international court of justice"
    },
    {
        " in 42 but the courts ruling in 42 dealt only with the delineation of a small part of the contested territory.            In 42 Malta signed a ": null
    },
    {
        "neutrality": "neutrality"
    },
    {
        " agreement with ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", under which Malta agreed not to enter into any alliance and Italy agreed to guarantee Maltas neutrality.  Maltas relations with Italy have been described as generally excellent . David Attard & Dominic Fenech,  In Naval Policy and Strategy in the Mediterranean: Past, Present and Future. Edited by John B. Hattendorf. London: Frank Cass, 42 P. 42 . Accessed 42 April 42       The ": null
    },
    {
        "42 general elections": "1981 maltese general election"
    },
    {
        " saw the ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        " gaining an absolute majority of votes, yet the Labour winning the majority of Parliamentary seats under the ": null
    },
    {
        "Single Transferable Vote": "single transferable vote"
    },
    {
        " and Mintoff remained Prime Minister, leading to a political crisis. The Nationalists, now led by ": null
    },
    {
        "Eddie Fenech Adami": "eddie fenech adami"
    },
    {
        ", refused to accept the electoral result and also refused to take their seats in parliament for the first years of the legislature, mounting a campaign demanding that Parliament should reflect the democratic will of the people. Despite this, the Labour government remained in power for the full five-year term. Mintoff resigned as Prime Minister and Party leader and appointed ": null
    },
    {
        "Karmenu Mifsud Bonnici": "karmenu mifsud bonnici"
    },
    {
        " as his successor in 42     The Mifsud Bonnici years were characterised by political tensions and violence. After a five-year debate, Fenech Adami, through the intervention of Dom Mintoff, reached an agreement with ": null
    },
    {
        "Karmenu Mifsud Bonnici": "karmenu mifsud bonnici"
    },
    {
        " to improve the constitution. Constitutional amendments were made voted and made effective in January 42 which guaranteed that the party with an absolute majority of votes would be given a majority of parliamentary seats in order to govern. This paved the way for the return of the ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        " to government later that year.          The ": null
    },
    {
        "general elections that followed in 42": "1987 maltese general election"
    },
    {
        " saw the Nationalist Party achieve such a majority of votes. The new Nationalist administration of Edward Fenech Adami sought to improve Maltas ties with ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        " and the ": null
    },
    {
        "United States": "united states"
    },
    {
        ".   The ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        " advocated Maltas membership in the European Union presenting an application on 42 July 42 This became a divisive issue, with ": null
    },
    {
        "Labour": "malta labour party"
    },
    {
        " opposing membership.     A wide-ranging programme of liberalisation and public investments meant the confirmation in office of the Nationalists with a larger majority in the ": null
    },
    {
        "42 elections": "1992 maltese general election"
    },
    {
        ". In 42 local councils were re-established in Malta.     ": null
    },
    {
        "General elections were held in Malta on 42 October 42": "1996 maltese general election"
    },
    {
        "; although ": null
    },
    {
        "Labour": "malta labour party"
    },
    {
        " received the most votes, the Nationalists won the most seats. The 42 constitutional amendments had to be used for the second time, and the Labour Party was awarded an additional four seats to ensure they had a majority in Parliament.   Maltas EU application was subsequently frozen.   A split in the Labour Party in 42 between the PM Sant and the former PM Mintoff resulted in the government losing the majority. Notwithstanding the President of the Republics preference for a negotiated solution, all attempts proved futile, and he had no other option but to accept Sant and his governments resignation and a call for early elections.     On being returned to office in the ": null
    },
    {
        "42 elections": "1998 maltese general election"
    },
    {
        " with a wide 42 vote margin, the ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        " reactivated the EU membership application. Malta was formally accepted as a candidate country at the Helsinki European Council of December 42    In 42 ": null
    },
    {
        "capital punishment": "capital punishment"
    },
    {
        " was abolished also from the military code of Malta.     EU accession negotiations were concluded late in 42 and a ": null
    },
    {
        "referendum on membership in 42": "2003 maltese european union membership referendum"
    },
    {
        " saw 42% casting a valid vote of which 42% were yes votes. ": null
    },
    {
        "Labour": "malta labour party"
    },
    {
        " stated that it would not be bound by this result were it returned to power in the following general election that year. In the circumstances, elections were called and the ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        " won another mandate": "2003 maltese general election"
    },
    {
        ", electing as PM ": null
    },
    {
        "Lawrence Gonzi": "lawrence gonzi"
    },
    {
        ". The accession treaty was signed and ratified and Malta joined the EU on 42 May 42 A consensus on membership was subsequently achieved with ": null
    },
    {
        "Labour": "malta labour party"
    },
    {
        " saying it would respect this result. ": null
    },
    {
        "Joe Borg": "joe borg"
    },
    {
        " was appointed as first Maltese ": null
    },
    {
        "European commissioner": "european commissioner"
    },
    {
        " in the first ": null
    },
    {
        "Barroso Commission": "barroso commission"
    },
    {
        ".            In the context of EU membership, Malta joined the ": null
    },
    {
        "eurozone": "eurozone"
    },
    {
        " on 42 January 42; the ": null
    },
    {
        "42 election": "2008 maltese general election"
    },
    {
        " confirmed Gonzi in the premiership, while in 42 ": null
    },
    {
        "George Abela": "george abela"
    },
    {
        " became President of Malta.     On 42 May 42 Maltese voted yes in the consultative ": null
    },
    {
        "divorce referendum": "2011 maltese divorce referendum"
    },
    {
        ". At that time, Malta was one of only three countries in the world, along with the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        " and the ": null
    },
    {
        "Vatican City": "vatican city"
    },
    {
        ", in which divorce was not permitted. As a consequence of the referendum outcome, a law allowing divorce under certain conditions was enacted in the same year.    Following a corruption scandal ": null
    },
    {
        "John Dalli": "john dalli"
    },
    {
        " had to resign and was replaced by ": null
    },
    {
        "Tonio Borg": "tonio borg"
    },
    {
        " as Maltese commissioner in 42 A ": null
    },
    {
        "snap election was called for March 42": "2013 maltese general election"
    },
    {
        " after the Gonzi government lost the Parliamentary majority. ": null
    },
    {
        "Joseph Muscat": "joseph muscat"
    }
]