[
    {
        "      Angola  is a country in southwestern Africa. The countrys name derives from the ": null
    },
    {
        "Kimbundu": "kimbundu"
    },
    {
        " word for king. It was first settled by ": null
    },
    {
        "San": "san people"
    },
    {
        " hunter-gatherer societies before the northern domains came under the rule of ": null
    },
    {
        "Bantu": "bantu peoples"
    },
    {
        " states such as ": null
    },
    {
        "Kongo": "kingdom of kongo"
    },
    {
        " and ": null
    },
    {
        "Ndongo": "ndongo"
    },
    {
        ". From the 42th century, ": null
    },
    {
        "Portuguese colonists": "portuguese empire"
    },
    {
        " began trading, and a settlement was established at ": null
    },
    {
        "Luanda": "luanda"
    },
    {
        " during the 42th century. Portugal annexed territories in the region which were ": null
    },
    {
        "ruled as a colony": "colonial history of angola"
    },
    {
        " from 42 and Angola was incorporated as an ": null
    },
    {
        "overseas province of Portugal": "administrative divisions of portugal"
    },
    {
        " in 42 After the ": null
    },
    {
        "Angolan War of Independence": "angolan war of independence"
    },
    {
        ", which ended in April 42 with ": null
    },
    {
        "an army mutiny and leftist coup": "carnation revolution"
    },
    {
        " in ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ", Angola achieved independence on November 42 42 through the ": null
    },
    {
        "Alvor Agreement": "alvor agreement"
    },
    {
        ". A few months before independence, Angola entered a period of ": null
    },
    {
        "civil war": "angolan civil war"
    },
    {
        " that lasted up until 42          The area of current day ": null
    },
    {
        "Angola": "angola"
    },
    {
        " was inhabited during the ": null
    },
    {
        "paleolithic": "paleolithic"
    },
    {
        " and ": null
    },
    {
        "neolithic": "neolithic"
    },
    {
        " eras, as attested by remains found in Luanda, Congo, and the ": null
    },
    {
        "Namibe desert": "namibe desert"
    },
    {
        ". At the beginning of recorded history other cultures and people also arrived.     The first ones to settle were the ": null
    },
    {
        "San people": "san people"
    },
    {
        ". This changed at the beginning of the sixth century AD, when the ": null
    },
    {
        "Bantu": "bantu peoples"
    },
    {
        ", already in possession of metal-working technology, ceramics and agriculture began migrating from the north. When they reached what is now Angola they encountered the San and other groups. The establishment of the Bantu took many centuries and gave rise to various groupings that took on different ethnic characteristics.     The first large political entity in the area, known to history as the ": null
    },
    {
        "Kingdom of Kongo": "kingdom of kongo"
    },
    {
        ", appeared in the thirteenth century and stretched from ": null
    },
    {
        "Gabon": "gabon"
    },
    {
        " in the north to the ": null
    },
    {
        "river Kwanza": "river kwanza"
    },
    {
        " in the south, and from the Atlantic in the west to the ": null
    },
    {
        "river Cuango": "river cuango"
    },
    {
        " in the east.     The wealth of the Kongo came mainly from agriculture. Power was in the hands of the Mani, aristocrats who occupied key positions in the kingdom and who answered only to the all-powerful King of the Kongo. ": null
    },
    {
        "Mbanza": "mbanza"
    },
    {
        " was the name given to a territorial unit administered and ruled by a Mani; ": null
    },
    {
        "Mbanza Congo": "mbanza congo"
    },
    {
        ", the capital, had a population of over fifty thousand in the sixteenth century.     The Kingdom of Kongo was divided into six provinces and included some dependent kingdoms, such as ": null
    },
    {
        "Ndongo": "ndongo"
    },
    {
        " to the south. Trade was the main activity, based on highly productive agriculture and increasing exploitation of mineral wealth. In 42 ": null
    },
    {
        "Portuguese caravel": "portuguese caravel"
    },
    {
        "s commanded by ": null
    },
    {
        "Diogo Cão": "diogo cão"
    },
    {
        " arrived in the Congo and he explored the extreme north-western ": null
    },
    {
        "coast": "geography of angola"
    },
    {
        " of what today is Angola in 42 Other expeditions followed, and close relations were soon established between the two states. The Portuguese brought ": null
    },
    {
        "firearms": "firearms"
    },
    {
        " and many other ": null
    },
    {
        "technological": "technological"
    },
    {
        " advances, as well as a new religion ; in return, the King of the Congo offered plenty of ": null
    },
    {
        "slave": "slave"
    },
    {
        "s, ": null
    },
    {
        "ivory": "ivory"
    },
    {
        ", and ": null
    },
    {
        "minerals": "minerals"
    },
    {
        ".     The ": null
    },
    {
        "Portuguese colony of Angola": "portuguese west africa"
    },
    {
        " was founded in 42 with the arrival of ": null
    },
    {
        "Paulo Dias de Novais": "paulo dias de novais"
    },
    {
        " with a hundred families of colonists and four hundred soldiers. Its center at ": null
    },
    {
        "Luanda": "luanda"
    },
    {
        " was granted the status of city in 42     The King of the Kongo soon converted to Christianity and adopted a similar political structure to the Europeans. He became a well-known figure in Europe, to the point of receiving missives from the ": null
    },
    {
        "Pope": "pope"
    },
    {
        ".     To the south of the Kingdom of the Kongo, around the river Kwanza, there were various important states. The most important of these was the ": null
    },
    {
        "Kingdom of Ndongo": "kingdom of ndongo"
    },
    {
        " or Dongo, ruled by the ngolas. At the time of the arrival of the Portuguese, Ngola ": null
    },
    {
        "Kiluange": "kiluange"
    },
    {
        " was in power. By maintaining a policy of alliances with neighbouring states, he managed to hold out against the foreigners for several decades but was eventually beheaded in ": null
    },
    {
        "Luanda": "luanda"
    },
    {
        ". Years later, the Ndongo rose to prominence again when Jinga Mbandi  took power. A wily politician, she kept the Portuguese in check with carefully prepared agreements. After undertaking various journeys she succeeded in 42 in forming a grand coalition with the states of ": null
    },
    {
        "Matamba": "matamba"
    },
    {
        " and Ndongo, Kongo, ": null
    },
    {
        "Kassanje": "kassanje"
    },
    {
        ", ": null
    },
    {
        "Dembos": "dembos"
    },
    {
        " and ": null
    },
    {
        "Kissamas": "kissamas"
    },
    {
        ". At the head of this formidable alliance, she forced the Portuguese to retreat.     Meanwhile, Portugal had lost its King and the Spanish took control of the Portuguese monarchy. By this time, Portugals overseas territories had taken second place. The ": null
    },
    {
        "Dutch": "dutch empire"
    },
    {
        " took advantage of this situation and occupied Luanda in 42 Jinga entered into an alliance with the Dutch, thereby strengthening her coalition and confining the Portuguese to ": null
    },
    {
        "Massangano": "massangano"
    },
    {
        ", which they fortified strongly, sallying forth on occasion to capture slaves in the ": null
    },
    {
        "Kuata! Kuata! Wars": "kuata! kuata! wars"
    },
    {
        ". Slaves from Angola were essential to the development of the Portuguese colony of ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", but the traffic had been interrupted by these events. Portugal having regained its independence, a large force from Brazil under the command of ": null
    },
    {
        "Salvador Correia de Sá": "salvador correia de sá"
    },
    {
        " retook Luanda in 42 leading to the return of the Portuguese in large numbers. Jingas coalition then fell apart; the absence of their Dutch allies with their firearms and the strong position of Correia de Sá delivered a deadly blow to the morale of the native forces. Jinga died in 42; two years later, the King of the Congo committed all his forces to an attempt to capture the island of Luanda, occupied by Correia de Sá, but they were defeated and lost their independence. The ": null
    },
    {
        "Kingdom of Ndongo": "kingdom of ndongo"
    },
    {
        " submitted to the Portuguese Crown in 42     Trade was mostly with the ": null
    },
    {
        "Portuguese colony of Brazil": "colonial brazil"
    },
    {
        "; Brazilian ships were the most numerous in the ports of Luanda and Benguela. By this time, Angola, a Portuguese colony, was in fact like a colony of Brazil, paradoxically another Portuguese colony. A strong Brazilian influence was also exercised by the ": null
    },
    {
        "Jesuits": "jesuits"
    },
    {
        " in religion and education. War gradually gave way to the philosophy of trade. Slave-trading routes and the conquests that made them possible were the driving force for activities between the different areas; independent states were subjugated to the demands of American slavery. In the high plains , the most important states were those of ": null
    },
    {
        "Bié": "bié"
    },
    {
        " and ": null
    },
    {
        "Bailundo": "bailundo"
    },
    {
        ", the latter being noted for its production of foodstuffs and rubber. The interior remained largely free of Portuguese control as late as the 42th century.     The slave trade was not abolished until 42 and in 42 Angolas ports were opened to foreign shipping. This facilitated the continuation of slave smuggling to the United States and Brazil. By 42 Luanda was one of the largest Portuguese cities in the ": null
    },
    {
        "Portuguese Empire": "portuguese empire"
    },
    {
        " outside ": null
    },
    {
        "Mainland Portugal": "mainland portugal"
    },
    {
        " exporting  palm and peanut oil, wax, copal, timber, ivory, cotton, coffee, and cocoa, among many other products – almost all the produce of a continued forced labour system.     The ": null
    },
    {
        "Berlin Conference": "berlin conference"
    },
    {
        " compelled Portugal to move towards the immediate occupation of all the territories it laid claim to but had been unable to effectively conquer. The territory of ": null
    },
    {
        "Cabinda ": "cabinda"
    },
    {
        ", to the north of the river Zaire, was also ceded to Portugal on the legal basis of the ": null
    },
    {
        "Treaty of Simulambuko": "treaty of simulambuko"
    },
    {
        " Protectorate, concluded between the ": null
    },
    {
        "Portuguese Crown": "portuguese crown"
    },
    {
        " and the princes of Cabinda in 42 In the 42th century they slowly and hesitantly began to establish themselves in the interior. Angola as a ": null
    },
    {
        "Portuguese colony": "portuguese west africa"
    },
    {
        " encompassing the present territory was not established before the end of the 42th century, and effective occupation , as required by the ": null
    },
    {
        "Berlin Conference ": "berlin conference"
    },
    {
        " was achieved only by the 42s.     Colonial economic strategy was based on ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        " and the export of ": null
    },
    {
        "raw material": "raw material"
    },
    {
        "s. Trade in ": null
    },
    {
        "rubber": "rubber"
    },
    {
        " and ": null
    },
    {
        "ivory": "ivory"
    },
    {
        ", together with the taxes imposed on the population of the Empire , brought vast income to ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ".           Portuguese policy in Angola was modified by certain reforms introduced at the beginning of the twentieth century. The fall of the Portuguese monarchy and a favourable international climate led to reforms in administration, agriculture, and education. In 42 with the advent of the ": null
    },
    {
        "New State": "estado novo"
    },
    {
        " regime  extended to the colony, Angola became a province of Portugal , called the Província Ultramarina de Angola .     However, Portuguese rule remained characterized by deep-seated racism, mass forced labour, and an almost complete failure to modernize the country. By 42 after 42 years of colonial rule, there was not a single university in the entire territory.  To counter this lack of education facilities, overtly political organizations first appeared in the 42s, and began to make organized demands for human and civil rights, initiating diplomatic campaigns throughout the world in their fight for independence. The Portuguese regime, meanwhile, refused to accede to the nationalists demands for independence, thereby provoking the armed conflict that started in 42 when guerrillas attacked colonial assets in cross-border operations in northeastern Angola. The war came to be known as the ": null
    },
    {
        "Colonial War": "portuguese colonial war"
    },
    {
        ". See ": null
    },
    {
        "Christine Messiant": "christine messiant"
    },
    {
        ", L’Angola colonial, histoire et société: Les prémisses du mouvement nationaliste, Basle: Schlettwein, 42     In this struggle, the principal protagonists were the ": null
    },
    {
        "MPLA": "mpla"
    },
    {
        " , founded in 42 the FNLA , which appeared in 42 and UNITA , founded in 42 After many years of conflict, the nation gained its independence on 42 November 42 after the ": null
    },
    {
        "42 coup détat": "carnation revolution"
    },
    {
        " in ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ", Portugal. Portugals new leaders began a process of democratic change at home and acceptance of the independence of its former colonies.          A ": null
    },
    {
        "42 coup détat": "carnation revolution"
    },
    {
        " in Portugal established a military government led by President ": null
    },
    {
        "António de Spínola": "antónio de spínola"
    },
    {
        ". The Spínola government agreed to give all of Portugals colonies independence, and handed power in Angola over to a coalition of the three largest nationalist movements, the MPLA, UNITA, and the FNLA, through the ": null
    },
    {
        "Alvor Agreement": "alvor agreement"
    },
    {
        ". The coalition quickly broke down, however, and the country descended into civil war. The MPLA gained control of the capital Luanda and much of the rest of the country. With the support of the United States, ": null
    },
    {
        "Zaïre": "zaïre"
    },
    {
        " and South Africa intervened militarily in favour of the FNLA and UNITA with the intention of taking Luanda before the declaration of independence. In response, ": null
    },
    {
        "Cuba intervened": "cuban intervention in angola"
    },
    {
        " in favor of the MPLA. In the meantime the South Africans and UNITA had come as close as 42  km to the south of the capital, the FNLA and Zairian forces as far as Kifangondo, 42  km to the east.     With Cuban support, the MPLA held Luanda and declared independence as the ": null
    },
    {
        "Angolan Peoples Republic": "angolan peoples republic"
    },
    {
        " on November 42 42 the day the Portuguese left the country. ": null
    },
    {
        "Agostinho Neto": "agostinho neto"
    },
    {
        " became the first president. FNLA and UNITA proclaimed their own short-lived republics on November 42 42 for the zones they controlled with ": null
    },
    {
        "Holden Roberto": "holden roberto"
    },
    {
        " and ": null
    },
    {
        "Jonas Savimbi": "jonas savimbi"
    },
    {
        " as ": null
    },
    {
        "co-presidents": "heads of state of the democratic peoples republic of angola"
    },
    {
        " of the ": null
    },
    {
        "Angolan Peoples Democratic Republic": "angolan peoples democratic republic"
    },
    {
        " in Huambo. This joint FNLA-UNITA government was dissolved on February 42 42 after a MPLA offensive. By the end of January 42 the MPLA army and the Cubans had all but crushed FNLA, Zairians and UNITA, and the South African forces withdrew.      On May 42 42 a coup attempt, including some former members of the MPLA government such as ": null
    },
    {
        "Nito Alves": "nito alves"
    },
    {
        ", led to retaliation by the government and Cuban forces, resulting in the execution of thousands, if not tens of thousands.  Alves was tortured and killed. The movement is known as ": null
    },
    {
        "Fraccionismo": "fraccionismo"
    },
    {
        ".      The proxy war continued. The MPLA government, recognized internationally , requested that Cuban forces remain in the country. Led by Jonas Savimbi, UNITA received clandestine support from the U.S. and other nations and took up military resistance in the southeast of the country while the MPLA government was supported by the ": null
    },
    {
        "USSR": "ussr"
    },
    {
        " and ": null
    },
    {
        "Eastern Bloc": "eastern bloc"
    },
    {
        " countries. South Africa continued to pursue ": null
    },
    {
        "South-West Africa Peoples Organisation": "south-west africa peoples organisation"
    },
    {
        " forces in Southern Angola, soon established bases and increased support of UNITA, which gained control of more and more territory. In an effort to deliver a final blow to UNITA and to drive South Africa out of the country, in 42 the ": null
    },
    {
        "Peoples Armed Forces for the Liberation of Angola": "peoples armed forces for the liberation of angola"
    },
    {
        " , with Soviet support, launched a campaign fraught with failures and defeats. Again, the Cubans intervened, stopping UNITA and South African advances, leading to the ": null
    },
    {
        "Battle of Cuito Cuanavale": "battle of cuito cuanavale"
    },
    {
        " from January 42 to March 42 the largest battle in African history since World War II.     The MPLA and the U.S. had been in negotiations for a peaceful solution since June 42 The U.S. agreed to include Cuba in direct talks. Cuba joined the negotiations January 42 42; South Africa joined March 42 Angola, Cuba and South Africa signed the ": null
    },
    {
        "Tripartite Accord": "tripartite accord"
    },
    {
        " on December 42 42 in which the withdrawal of Cuban troops from Angola was linked to the retreat of South African soldiers from Angola and Namibia.     The ": null
    },
    {
        "Bicesse Accord": "bicesse accord"
    },
    {
        " in 42 spelled out an electoral process for a democratic Angola under the supervision of the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ". MPLA won the first round with 42% of the votes, against 42% for UNITA. UNITA leader Jonas Savimbi rejected the results and returned to war. From October 42 to November 42 42 the ": null
    },
    {
        "Halloween Massacre": "halloween massacre"
    },
    {
        " occurred in which thousands of UNITA and FNLA supporters in Luanda were killed by MPLA troops. Estimates for the death toll nationwide reach 42 to 42.   A second peace accord, the ": null
    },
    {
        "Lusaka Protocol": "lusaka protocol"
    },
    {
        ", was brokered in ": null
    },
    {
        "Lusaka": "lusaka"
    },
    {
        ", ": null
    },
    {
        "Zambia": "zambia"
    },
    {
        " and signed on November 42 42     The peace accord between the government and UNITA provided for the integration of former UNITA insurgents into the government and armed forces. However, in 42 localized fighting resumed. A national unity government was installed in April 42 but serious fighting resumed in late 42 when Savimbi renewed the war for a second time, claiming that the MPLA was not fulfilling its obligations. The ": null
    },
    {
        "UN Security Council": "un security council"
    },
    {
        " voted on August 42 42 to impose sanctions on UNITA. The Angolan military launched a massive offensive in 42 that destroyed UNITAs conventional capacity and recaptured all major cities previously held by Savimbis forces. Savimbi then declared that UNITA would return to guerrilla tactics, and much of the country remained in turmoil..     The extended civil war rendered hundreds of thousands of people homeless. Up to 42 million lives may have been lost in fighting over the past quarter century. It only ended when Savimbi was killed in 42             A Russian freighter delivered 42 tons of Ukrainian 42  mm ammunition to Simportex, a division of the Angolan government, with the help of a shipping agent in London on September 42 42 The ships captain declared his cargo fragile to minimize inspection.  The next day, the MPLA began attacking UNITA, winning victories in several battles from September 42–42 The government gained control over military bases and diamond mines  in ": null
    },
    {
        "Lunda Norte": "lunda norte"
    },
    {
        " and ": null
    },
    {
        "Lunda Sul": "lunda sul"
    },
    {
        ", hurting Savimbis ability to pay his troops.      Angola agreed to trade oil to Slovakia in return for arms, buying six ": null
    },
    {
        "Sukhoi Su42": "sukhoi su-17"
    },
    {
        " attack aircraft": "attack aircraft"
    },
    {
        " on April 42 42 The Spanish government in the ": null
    },
    {
        "Canary Islands": "canary islands"
    },
    {
        " prevented a Ukrainian freighter from delivering 42 tons of military equipment to Angola on February 42 42 The captain of the ship had inaccurately reported his cargo, falsely claiming the ship carried automobile parts. The Angolan government admitted Simportex had purchased arms from ": null
    },
    {
        "Rosvooruzhenie": "rosoboronexport"
    },
    {
        ", the Russian state-owned arms company, and acknowledged the captain might have violated Spanish law by misreporting his cargo, a common practice in arms smuggling to Angola.     Government troops captured and destroyed UNITAs Epongoloko base in Benguela province and Mufumbo base in Cuanza Sul in October 42 Martin . Page 42 The Slovak government sold fighter jets to the Angolan government in 42 in violation of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        " Code of Conduct on Arms Exports.      Government troops killed Savimbi on February 42 42 in Moxico province.  UNITA Vice President ": null
    },
    {
        "António Dembo": "antónio dembo"
    },
    {
        " took over, but died from diabetes twelve days later on March 42 and Secretary-General ": null
    },
    {
        "Paulo Lukamba": "paulo lukamba"
    },
    {
        " became UNITAs leader.  After Savimbis death, the government came to a crossroads over how to proceed. After initially indicating the counter-insurgency might continue, the government announced it would halt all ": null
    },
    {
        "military operation": "military operation"
    },
    {
        "s on March 42 Military commanders for UNITA and the MPLA met in ": null
    },
    {
        "Cassamba": "cassamba"
    },
    {
        " and agreed to a cease-fire. However, Carlos Morgado, UNITAs spokesman in Portugal, said that the UNITAs Portugal wing had been under the impression General Kamorteiro, the UNITA general who agreed to the ceasefire, had been captured more than a week earlier. Morgado did say that he had not heard from Angola since Savimbis death. The military commanders signed a Memorandum of Understanding as an addendum to the ": null
    },
    {
        "Lusaka Protocol": "lusaka protocol"
    },
    {
        " in ": null
    },
    {
        "Luena": "luena, moxico province"
    },
    {
        " on April 42 Dos Santos and Lukambo observing. Crocker, Aall, and Osler . Page 42      The ": null
    },
    {
        "United Nations Security Council": "united nations security council"
    },
    {
        " passed ": null
    },
    {
        "Resolution 42": "united nations security council resolution 1404"
    },
    {
        " on April 42 extending the monitoring mechanism of sanctions by six months. ": null
    },
    {
        "Resolutions 42": "united nations security council resolution 1412"
    },
    {
        " and ": null
    },
    {
        "42": "united nations security council resolution 1432"
    },
    {
        ", passed on May 42 and August 42 respectively, suspended the UN travel ban on UNITA officials for 42 days each, finally abolishing the ban through ": null
    },
    {
        "Resolution 42": "united nations security council resolution 1439"
    },
    {
        " on October 42 UNAVEM III, extended an additional two months by Resolution 42 ended on December 42      In August 42 UNITA declared itself a political party and officially demobilised its armed forces.  That same month, the United Nations Security Council replaced the United Nations Office in Angola with the United Nations Mission in Angola, a larger, non-military, political presence.      The civil war internally displaced four million people , one third of Angolas population. The government spent $42 million settling IDPs between April 42 42 and 42 after which the ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        " gave $42 million to continue the settling process. Militant forces laid approximately 42 million ": null
    },
    {
        "landmine": "landmine"
    },
    {
        "s by 42 The ": null
    },
    {
        "HALO Trust": "halo trust"
    },
    {
        " charity began demining in 42 destroying 42 by July 42 There are 42 Angolans and seven foreign workers who are working for HALO Trust in Angola, with operations expected to finish sometime between 42 and 42      ": null
    },
    {
        "Human Rights Watch": "human rights watch"
    },
    {
        " estimates UNITA and the government employed more than 42 and 42 ": null
    },
    {
        "child soldier": "child soldier"
    },
    {
        "s respectively, some forcibly impressed, during the war. Human rights analysts found 42 to 42 underage girls married to UNITA militants. Some girls were ordered to go and forage for food to provide for the troops. If the girls did not bring back enough food as judged by their commander, then the girls would not eat. After victories, UNITA commanders would be rewarded with women who were often then sexually abused. The government and UN agencies identified 42 child soldiers in the Angolan army and relocated seventy of them by November 42 but the government continued to knowingly employ other underage soldiers.      ": null
    },
    {
        "Fernando Vendrell": "fernando vendrell"
    },
    {
        " produced and ": null
    },
    {
        "Zézé Gamboa": "zézé gamboa"
    },
    {
        " directed  The Hero , a film about the life of average Angolans after the civil war, in 42 The film follows the lives of three individuals; Vitório, a ": null
    },
    {
        "war veteran": "war veteran"
    },
    {
        " crippled by a landmine who returns to Luanda, Manu, a young boy searching for his soldier father, and Joana, a teacher who mentors the boy and begins a love affair with Vitório. The Hero won the 42 ": null
    },
    {
        "Sundance": "sundance film festival"
    },
    {
        " World Dramatic Cinema Jury Grand Prize. A joint Angolan, Portuguese, and French production, Gamboa filmed The Hero entirely in Angola. ": null
    }
]