[
    {
        "The history of Tyrol, a historical region in the middle alpine area of ": null
    },
    {
        "Central Europe": "central europe"
    },
    {
        ", dates back to early human settlements at the end of the last glacier period, around 42 BC. Sedentary settlements of farmers and herders can be traced back to 42 BC. Many of the main and side valleys were settled during the early Bronze Age, from 42 to 42 BC. From these settlements, two prominent cultures emerged: the Laugen-Melaun culture in the Bronze Age, and the Fritzens-Sanzeno culture in the Iron Age.     The region was conquered by the ": null
    },
    {
        "Romans": "roman empire"
    },
    {
        " in 42 BC. The northern and eastern areas were incorporated into the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " as the provinces of ": null
    },
    {
        "Raetia": "raetia"
    },
    {
        " and ": null
    },
    {
        "Noricum": "noricum"
    },
    {
        ", leaving deep impressions on the culture and language, with the ": null
    },
    {
        "Rhaeto-Romance languages": "rhaeto-romance languages"
    },
    {
        ". Following the conquest of Italy by the ": null
    },
    {
        "Goths": "goths"
    },
    {
        ", Tyrol became part of the ": null
    },
    {
        "Ostrogothic Kingdom": "ostrogothic kingdom"
    },
    {
        " in the fifth and sixth centuries. In 42 southern Tyrol was incorporated into the ": null
    },
    {
        "Lombards": "lombards"
    },
    {
        " Kingdom of Italy": "kingdom of italy"
    },
    {
        ", northern Tyrol came under the influence of the ": null
    },
    {
        "Bavarii": "bavarii"
    },
    {
        ", and western Tyrol became part of ": null
    },
    {
        "Alamannia": "alamannia"
    },
    {
        "—the three areas meeting at present-day ": null
    },
    {
        "Bolzano": "bolzano"
    },
    {
        ".     In 42 Charlemagne conquered the Lombards, and as a consequence, Tyrol became an important bridgehead to Italy. In the eleventh century, the Emperors of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " granted the counties of ": null
    },
    {
        "Trento": "county of trento"
    },
    {
        ", ": null
    },
    {
        "Bolzano": "county of bolzano"
    },
    {
        ", and ": null
    },
    {
        "Vinschgau": "county of vinschgau"
    },
    {
        " to the ": null
    },
    {
        "Bishopric of Trent": "bishopric of trent"
    },
    {
        ", and the county of Norital and ": null
    },
    {
        "Puster Valley": "puster valley"
    },
    {
        " to the ": null
    },
    {
        "Bishopric of Brixen": "bishopric of brixen"
    },
    {
        "—effectually placing the region under the control of the Emperors.     In the coming centuries, the counts residing in ": null
    },
    {
        "Tirol Castle": "tirol castle"
    },
    {
        " near ": null
    },
    {
        "Merano": "merano"
    },
    {
        " extended their territory over the region. Later counts would hold much of their territory directly from the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ". The Meinhardinger family, originating in ": null
    },
    {
        "Gorizia": "gorizia"
    },
    {
        ", controlled the Tyrol, Gorizia, and the ": null
    },
    {
        "Duchy of Carinthia": "duchy of carinthia"
    },
    {
        ". By 42 the county and reign of Tyrol had established itself firmly in the Land on the Adige and Inn , as the region was then called. When the Meinhardiner dynasty died out in 42 the Tyrol was ceded to the ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        ", who ruled over the region for the next five and a half centuries, with a brief period of control in the early nineteenth century by the Bavarians during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ".     At the conclusion of World War I, the Treaty of Saint-Germain-en-Laye of 42 ceded the southern part of Tyrol to the Kingdom of Italy, including present day-South Tyrol with its large German-speaking majority. The northern part of Tyrol was retained by the First Austrian Republic. The historical region is formed by the present-day Austrian State of ": null
    },
    {
        "Tyrol": "tyrol"
    },
    {
        " and the Italian provinces of ": null
    },
    {
        "South Tyrol": "south tyrol"
    },
    {
        " and ": null
    },
    {
        "Trentino": "trentino"
    },
    {
        ". The boundaries of this ": null
    },
    {
        "Tyrol–South Tyrol–Trentino Euroregion": "tyrol–south tyrol–trentino euroregion"
    },
    {
        " correspond to the former Habsburg ": null
    },
    {
        "County of Tyrol": "county of tyrol"
    },
    {
        ", which gave this historical region its name.       Archaeological findings show people settled in the middle alpine region, later to be called Tyrol, when the glaciers retreated and flora and fauna revived, after the last ": null
    },
    {
        "ice age": "last glacial period"
    },
    {
        " ended around 42 BC. Artifacts found on the ": null
    },
    {
        "Seiser Alm": "seiser alm"
    },
    {
        " date to the ": null
    },
    {
        "Upper Paleolithic": "upper paleolithic"
    },
    {
        " era. In the valley bottoms near ": null
    },
    {
        "Bolzano": "bolzano"
    },
    {
        ", ": null
    },
    {
        "Brixen": "brixen"
    },
    {
        " and ": null
    },
    {
        "Salorno": "salorno"
    },
    {
        ", ": null
    },
    {
        "mesolithic": "mesolithic"
    },
    {
        " hunters resting places were discovered. Stone artefacts recovered there were dated to the 42th millennia BC. Discovery of ": null
    },
    {
        "Ötzi": "ötzi the iceman"
    },
    {
        " on the ": null
    },
    {
        "Similaun": "similaun"
    },
    {
        " glacier in 42 proved man had already crossed the highest Alpine passes 42 years ago. Sedentary settlements of farmers and herders can be traced back to 42 BC. There is ample evidence of settlements in the main and side valleys during the early and middle ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " . Preferred settlement sites were sunny terraces on the valleys slopes, and hill tops in the middle heights.     In the Bronze and Iron Ages the region was home to a series of autochthonous cultures occupying roughly the area of the later county of Tyrol. The most prominent are the late ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " Laugen-Melaun culture and ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " Fritzens-Sanzeno culture cultures.     The Laugen-Melaun culture, named after two important archaeological sites near the modern-day town of Brixen in ": null
    },
    {
        "South Tyrol": "south tyrol"
    },
    {
        ", originated in the 42th century BC, in the area of todays South Tyrol and ": null
    },
    {
        "Trentino": "trentino"
    },
    {
        ". It soon spread over the central area of the Southern Alps, encompassing South and East Tyrol, Trentino north of Rovereto and the ": null
    },
    {
        "Lower Engadine": "lower engadine"
    },
    {
        "; the northern part of ": null
    },
    {
        "Tyrol": "tyrol"
    },
    {
        " came under the influence of the ": null
    },
    {
        "Urnfield culture": "urnfield culture"
    },
    {
        ". Gleirscher 42 Distinguishing factors include its characteristic richly decorated pottery, while the metal-working is strongly influenced by adjacent cultures. As in the Urnfield culture, Laugen-Melaun-people cremated their dead, placing their ashes in ": null
    },
    {
        "urn": "urn"
    },
    {
        "s, and worshipping their gods in sanctuaries sometimes situated in remote areas, on mountain-tops or close to water. Rich burial objects show that from the 42th to 42th century BC, the Laugen-Melaun culture flourished, due to the mining of ": null
    },
    {
        "copper": "copper"
    },
    {
        ", the source material for the alloy ": null
    },
    {
        "bronze": "bronze"
    },
    {
        ".     Around 42 BC, the Fritzens-Sanzeno culture, also known as culture of the ": null
    },
    {
        "Raeti": "raeti"
    },
    {
        ", after the goddess ": null
    },
    {
        "Raetia": "raetia"
    },
    {
        " who according to ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " authors was the main deity of the people inhabiting the region, succeeded both the Laugen-Melaun culture of the southern and the Urnfield culture of the northern part of Tyrol. Gleirscher 42 As in the preceding culture, the richly ornamented pottery is very characteristic, while many aspects such as the metal-working, burial customs and religion are strongly influenced by its neighbours, primarily the ": null
    },
    {
        "Etruscans": "etruscan civilization"
    },
    {
        " and ": null
    },
    {
        "Celts": "celts"
    },
    {
        ". Nonetheless, the Fritzens-Sanzeno-people possessed important distinct cultural traits distinguishing them from adjacent groups, such as the typical mountain-sanctuaries already in use during the time of the Laugen-Melaun culture, certain types of ": null
    },
    {
        "fibulae": "fibula"
    },
    {
        ", bronze armor, and their own alphabet derived from one of North Etruscan alphabets . The language of the Raeti was kin to Etruscan, but different enough to suggest a very ancient divergence between them. Oettinger, Norbert. Seevoelker und Etrusker. // Pax Hethitica. Studies on the Hittites and their neighbors in honor of Itamar Singer. Wiesbaden, 42       In 42 BC, the region was conquered by the Romans, and its northern and eastern part incorporated into the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " as the provinces of ": null
    },
    {
        "Raetia": "raetia"
    },
    {
        " and Noricum respectively. The part south of and including the area around the modern day cities of ": null
    },
    {
        "Bolzano": "bolzano"
    },
    {
        " and ": null
    },
    {
        "Merano": "merano"
    },
    {
        " became part of ": null
    },
    {
        "Italias": "italy"
    },
    {
        " Regio X. As in the rest of Europe, the Roman era left deep impressions on the culture and language, with the ": null
    },
    {
        "Rhaeto-Romance languages": "rhaeto-romance languages"
    },
    {
        ".       After the conquest of Italy by the ": null
    },
    {
        "Goths": "goths"
    },
    {
        ", Tyrol became part of the ": null
    },
    {
        "Ostrogothic Kingdom": "ostrogothic kingdom"
    },
    {
        " from the 42th to the 42th century. After the fall of the Ostrogothic Kingdom in 42 the Germanic tribe of the ": null
    },
    {
        "Lombards": "lombards"
    },
    {
        " invaded Italy and founded the Lombard ": null
    },
    {
        "Kingdom of Italy": "kingdom of italy"
    },
    {
        ", which no longer included all of Tyrol, only its southern part. The northern part of Tyrol came under the influence of the ": null
    },
    {
        "Bavarii": "bavarii"
    },
    {
        ", while the west probably was part of ": null
    },
    {
        "Alamannia": "alamannia"
    },
    {
        ". Thus, Tyrol was divided among three spheres of influence that met in the approximate area of todays Bolzano. During the 42th century ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        " and Alamannia became ": null
    },
    {
        "stem duchies": "stem duchy"
    },
    {
        " of the ": null
    },
    {
        "Frankish Kingdom": "francia"
    },
    {
        ". On conquering the Lombard Kingdom of Italy in 42 ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        " had himself crowned King of the ": null
    },
    {
        "Lombards": "kingdom of the lombards"
    },
    {
        ". Consequently, Tyrol came to be of great importance as a bridgehead to Italy, which was re-affirmed during the Italian Campaign of ": null
    },
    {
        "Otto I": "otto i, holy roman emperor"
    },
    {
        ". In the years 42 and 42 the Emperors of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " granted the counties of ": null
    },
    {
        "Trento": "county of trento"
    },
    {
        ", ": null
    },
    {
        "Bolzano": "county of bolzano"
    },
    {
        " and ": null
    },
    {
        "Vinschgau": "county of vinschgau"
    },
    {
        " to the ": null
    },
    {
        "Bishopric of Trent": "bishopric of trent"
    },
    {
        ". In 42 the ": null
    },
    {
        "County of Norital": "county of norital"
    },
    {
        " was granted to the ": null
    },
    {
        "Bishopric of Brixen": "bishopric of brixen"
    },
    {
        ", followed in 42 by the ": null
    },
    {
        "County of Puster Valley": "county of puster valley"
    },
    {
        ". Since the Bishops were nominated directly by the Emperor and their office was not hereditary, putting the area under their control was intended to secure it to the Emperors.             Over the centuries, the ": null
    },
    {
        "Count": "county of tyrol"
    },
    {
        "s residing in ": null
    },
    {
        "Tirol Castle": "tirol castle"
    },
    {
        ", near ": null
    },
    {
        "Merano": "merano"
    },
    {
        ", extended their territory over the region. Later counts would hold much of their territory directly from the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ". The Meinhardinger family, originating in ": null
    },
    {
        "Gorizia": "gorizia"
    },
    {
        ", held not only Tyrol and Gorizia, but for a time the ": null
    },
    {
        "Duchy of Carinthia": "duchy of carinthia"
    },
    {
        ". At the end of count ": null
    },
    {
        "Meinhard II": "meinhard, duke of carinthia"
    },
    {
        "s rule the county and reign of Tyrol had established itself firmly in the Land on the ": null
    },
    {
        "Adige": "adige"
    },
    {
        " and ": null
    },
    {
        "Inn": "inn"
    },
    {
        " , as the region was then called. This happened on the expense of the power of the bishops, who were nominally the ": null
    },
    {
        "feudal": "feudalism"
    },
    {
        " lords of the counts of Tyrol. Meinhard II also introduced more efficient systems for the administration of his territories.     ": null
    },
    {
        "Margarete Maultasch ": "margaret, countess of tyrol"
    },
    {
        " was the last effective ruler of Tyrol from the Meinhardinger Dynasty. In 42 she was married to ": null
    },
    {
        "John-Henry": "john henry, margrave of moravia"
    },
    {
        " , who she repudiated with the help of the Tyrolean aristocracy in order to marry Duke ": null
    },
    {
        "Ludwig V": "louis v, duke of bavaria"
    },
    {
        " of ": null
    },
    {
        "Bavaria": "duchy of bavaria"
    },
    {
        ", a member of the powerful ": null
    },
    {
        "Wittelsbach dynasty": "house of wittelsbach"
    },
    {
        ". This weakened the position of the countess and strengthened the local nobility. The only son of Margarete and Louis, Meinhard, died in 42 two years after his father, leaving the countess without an heir.     Margarete Maultasch decided to bequeath Tyrol to Duke ": null
    },
    {
        "Rudolph IV": "rudolf iv, duke of austria"
    },
    {
        " of the ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        ", probably pressed by the aristocracy, an act which caused a conflict between Meinhards uncle ": null
    },
    {
        "Stephen II": "stephen ii, duke of bavaria"
    },
    {
        ", who forged an alliance with the powerful Lord of ": null
    },
    {
        "Milan": "milan"
    },
    {
        " Bernabò Visconti": "bernabò visconti"
    },
    {
        " to invade Tyrol, and the House of Habsburg. Stephen finally renounced Tyrol to the Habsburgs with the Peace of ": null
    },
    {
        "Schärding": "schärding"
    },
    {
        " for a huge financial compensation after the death of Margarete Maultasch in 42 The red eagle in Tyrols coat of arms derives from the red ": null
    },
    {
        "Brandenburg": "brandenburg"
    },
    {
        " eagle, dating from the time when Louis V and Margarete Maultasch governed Brandenburg as well.       The acquisition of Tyrol was strategically important to the Habsburg dynasty, since it allowed it to connect their Austrian territories with their territorial possessions in the area of todays Switzerland. From that time, Tyrol was ruled by various lines of the Habsburg family, who bore the title ": null
    },
    {
        "Count": "list of rulers of austria"
    },
    {
        ". Tyrol repeatedly became involved in the political and military conflicts of the Habsburgs with Milan, ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", Switzerland and the ": null
    },
    {
        "County of Gorizia": "county of görz"
    },
    {
        ", as well as ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        " and ": null
    },
    {
        "Swabia": "swabia"
    },
    {
        ".     The ": null
    },
    {
        "Battle of Sempach": "battle of sempach"
    },
    {
        " in 42 in which Duke ": null
    },
    {
        "Leopold III": "leopold iii, duke of austria"
    },
    {
        " of ": null
    },
    {
        "Austria": "duchy of austria"
    },
    {
        " was defeated by the ": null
    },
    {
        "Old Swiss Confederacy": "old swiss confederacy"
    },
    {
        " had important repercussions on Tyrol, and was the first of a series of military conflicts between the county and its neighbours. The ": null
    },
    {
        "4242 war": "appenzell wars"
    },
    {
        " against the Swiss ": null
    },
    {
        "Appenzell": "appenzell"
    },
    {
        "er, 42 the conflict with Venice and 42 the invasion of the lower Inn valley by the Bavarians. In 42 during the rule of ": null
    },
    {
        "Frederick IV Empty Pockets ": "frederick iv, duke of austria"
    },
    {
        ", the first meeting that could be called a Tyrolean Parliament met. It consisted of aristocrats, bourgeois and even peasant representatives. Chizzali. Tyrol: Impressions of Tyrol. p.42 During Frederick IVs tenure internal conflicts between the powerful local aristocracy and the duke arose, which eventually led to the decline of the nobles and of their traditional system of values, and strengthened the dukes rule over the country. This enabled ": null
    },
    {
        "Sigismund Rich in Coin ": "sigismund, archduke of austria"
    },
    {
        " to continue his fathers rule to the end of the 42th century and lead the county into the modern era.     Sigismunds opulent lifestyle and the misfortunes of war with ": null
    },
    {
        "Venice": "venice"
    },
    {
        " bled the treasury, leading to his decision to mortgage the Tyrolean silver mines. By42 Sigismund became so unpopular that he was forced to abdicate in favor of his more prosperous cousin, ": null
    },
    {
        "Maximilian": "maximilian i, holy roman emperor"
    },
    {
        ", King of the ": null
    },
    {
        "Germans": "kingdom of the germans"
    },
    {
        ". Three years after the succession, Maximilian became Holy Roman Emperor, making his preferred residence, ": null
    },
    {
        "Innsbruck": "innsbruck"
    },
    {
        ", the imperial capitol. Maximilian added ": null
    },
    {
        "Kufstein": "kufstein"
    },
    {
        ", ": null
    },
    {
        "Rattenberg": "rattenberg"
    },
    {
        " and ": null
    },
    {
        "Kitzbühel": "kitzbühel"
    },
    {
        " to Tyrol, and when he inherited the ": null
    },
    {
        "Puster Valley": "puster valley"
    },
    {
        " and ": null
    },
    {
        "East Tyrol": "east tyrol"
    },
    {
        " the borders of Tyrol were set, with the exception of the 42 addition of the Ziller Valley Chizzali. Tyrol: Impressions of Tyrol. p. 42          Following defeat by ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " in 42 ": null
    },
    {
        "Austria": "austria"
    },
    {
        " was forced to cede Tyrol to the ": null
    },
    {
        "Kingdom of Bavaria": "kingdom of bavaria"
    },
    {
        " in the ": null
    },
    {
        "Peace of Pressburg": "peace of pressburg"
    },
    {
        ". Tyrol, as a part of Bavaria, became a member of the ": null
    },
    {
        "Confederation of the Rhine": "confederation of the rhine"
    },
    {
        " in 42 Consequently, King ": null
    },
    {
        "Maximilian I of Bavaria": "maximilian i joseph of bavaria"
    },
    {
        " introduced far reaching economic, religious and administrative reforms. When in 42 a new constitution for the Kingdom of Bavaria was introduced, Tyrol was integrated into South Bavaria, and divided into three districts, losing its special status in the kingdom. Furthermore, Tyroleans were now subjected to the Bavarian conscription levies, and faced the prospect of having to fight against Austrian troops. This, together with the economic decline under Bavarian rule, and the kingdoms religious reforms which were opposed by the Catholic population, led to a growing conflict between the Tyrolean population and the Bavarian authorities. DAVEY WRIGHT Hamish, Andreas Hofer and the insurrection in the Tyrol, 42      In 42 delegates from Tyrol travelled to Vienna to make plans for an insurrection of the Tyrolean people. Among them was the later leader of the insurgents, ": null
    },
    {
        "Andreas Hofer": "andreas hofer"
    },
    {
        ".  The insurrection began on April 42 42 in ": null
    },
    {
        "Innsbruck": "innsbruck"
    },
    {
        ". On April 42 42 Innsbruck was freed by the Tyrolean Landsturm commanded by captain Martin Teimer in the battle later known as the ": null
    },
    {
        "First battle of the Bergisel": "battles of bergisel"
    },
    {
        ". One day later a military unit of 42 men consisting of Bavarian and French Troops approached Innsbruck from the ": null
    },
    {
        "Brenner Pass": "brenner pass"
    },
    {
        ", but was convinced to surrender by captain Teimer, who dressed up as a Major of the regular Austrian army and made the Bavarian officers believe that the Austrian army was approaching Innsbruck, when in fact it was still about 42 miles away. In order to convalidate the capitulation agreement, Teimer was subsequently appointed Major of the Austrian army.   Throughout Tyrol, the Bavarian troops were killed or driven out. The Tyroleans fought mainly as skirmishing sharpshooters, taking advantage of the mountainous nature of the land. They were highly mobile and made use of artificial avalanches to combat their enemies. Following the defeat of the Austrian Army on the Bavarian front, Napoleon dispatched ": null
    },
    {
        "Charles Lefebvre": "charles lefebvre-desnouettes"
    },
    {
        " to Tyrol, and by May 42 Innsbruck had been seized again and the rebellion seemed quelled.     After ": null
    },
    {
        "Archduke Karl’s": "archduke charles, duke of teschen"
    },
    {
        " Austrian": "austrian empire"
    },
    {
        " army was defeated by Napoleon at the ": null
    },
    {
        "Battle of Wagram": "battle of wagram"
    },
    {
        ", the ": null
    },
    {
        "Armistice of Znaim": "armistice of znaim"
    },
    {
        " was signed. Point IV of the agreement stated that Austria was to withdraw its troops from the territories of ": null
    },
    {
        "Vorarlberg": "vorarlberg"
    },
    {
        " and Tyrol, returning them to Bavarian rule. But the Bavarians and the French found it difficult to gain control of the territory, with Tyrolean sharpshooters occupying high places along the roads, blocking roads and setting off avalanches to harm the occupying army. The Tyroleans managed to hold off and inflict heavy casualties on the French and Bavarian troops, and on August 42 the Tyrolean peasant army rallied at the Bergisel again for the decisive Battle. 42 Bavarian, French and Saxon troops faced almost the same number of Tyrolean irregulars. Surrounded on all sides by the irregulars, and having sustained heavy casualties, Lefebvre was forced to withdraw. Andreas Hofer, who in the meantime had advanced to supreme commander of the insurgents, became regent of Tyrol in the name of the Emperor.     Following the ": null
    },
    {
        "Treaty of Schönbrunn": "treaty of schönbrunn"
    },
    {
        " Tyrol was again ceded to Bavaria by the Austrian Emperor. On October 42 Bavarian, French and Italian troops under the command of the Duke Drouet d’": null
    },
    {
        "Erlon": "duchy of erlon"
    },
    {
        " poured into Tyrol, forcing the Tyroleans to retreat to the Bergisel again. As Winter approached, supplies began to dwindle, and many men left to return to their homes. On 42/42 October, news of the peace treaty that had been signed by Austria reached Tyrol. This had catastrophic effects on the morale of the Tyroleans, and Andreas Hofer, betrayed by his emperor, resorted to drinking. The Tyrolean morale had been broken. On November 42 Drouet dErlon had recaptured Innsbruck and the Bergisel, and by 42 November 42 Tyrol was entirely occupied. Hofer fled into the mountains, and on 42 January 42 he was betrayed and denounced to the authorities. On 42 January, he, his wife and his son were taken to ": null
    },
    {
        "Bolzano": "bolzano"
    },
    {
        ". Napoleon learnt of the capture at the start of February and ordered Hofer to be tried and executed.  This order was acted upon soon and Hofer died at the dungeon of the fortress of ": null
    },
    {
        "Mantua": "mantua"
    },
    {
        " on February 42 42     The execution of Hofer, considered a Tyrolean hero until today, is the topic of the song  Zu Mantua in Banden , since 42 the ": null
    },
    {
        "Tyrol": "tyrol"
    },
    {
        "s official anthem.       Tyrol remained divided under Bavarian and ": null
    },
    {
        "Italian": "kingdom of italy"
    },
    {
        " authority for another four years, before its reunification and return to ": null
    },
    {
        "Austria": "austria"
    },
    {
        " following the decisions at the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " in 42 Integrated into the ": null
    },
    {
        "Austrian Empire": "austrian empire"
    },
    {
        ", from 42 onwards, it was a Kronland  of ": null
    },
    {
        "Cisleithania": "cisleithania"
    },
    {
        ", the western half of ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ".            On the eve of World War I, the southern part of the Austrian crown land of Tyrol was populated mainly by Italian speakers . Its border coincided with the present-day border between ": null
    },
    {
        "South Tyrol": "south tyrol"
    },
    {
        " and Trentino, crossing the ": null
    },
    {
        "Adige": "adige"
    },
    {
        " valley at ": null
    },
    {
        "Salorno": "salorno"
    },
    {
        " . Alcock 42 p. 42 The existence of areas largely populated by Italian-speaking populations under the rule of the ": null
    },
    {
        "Austrian Empire": "austrian empire"
    },
    {
        " was a constant cause of friction between Austria and Italy, a national state set on the unification of all Italians. Being part of the ": null
    },
    {
        "Triple Alliance": "triple alliance"
    },
    {
        " with Germany and Austria was an embarrassment, if not a contradiction for Italy. Italys fear that it would not get what it wanted in the event of a victorious Triple Alliance caused it to remain neutral during the first year of the war, and the preoccupation that it wouldnt get what it wanted from a victorious ": null
    },
    {
        "Entente": "allies of world war i"
    },
    {
        " either if it remained neutral led it to join the war on the side of the latter. Italy conducted intense negotiations with Austria, which was prepared to part with Trentino in exchange of Italys neutrality, but Italy wanted to reach the Alpine ": null
    },
    {
        "water divide": "drainage divide"
    },
    {
        ", which it claimed as its natural border, a demand which Austria refused, since it would have meant giving up a territory regarded as personal fief by the Habsburg Emperors. On 42 April 42 Italy signed the ": null
    },
    {
        "Treaty of London": "treaty of london"
    },
    {
        ", agreeing to declare war against the ": null
    },
    {
        "Central Powers": "central powers"
    },
    {
        " in exchange for the ": null
    },
    {
        "unredeemed": "italian irredentism"
    },
    {
        " territories of Trentino, ": null
    },
    {
        "Gorizia": "gorizia"
    },
    {
        ", ": null
    },
    {
        "Trieste": "trieste"
    },
    {
        " and ": null
    },
    {
        "Dalmatia": "dalmatia"
    },
    {
        ", as well as the part of German Tyrol south of the main Alpine divide. Alcock 42 p. 42 Apart from these territorial gains the alliance change enabled Italy to realise its aspiration: Italian military dominance in the Mediterranean. Rusconi 42 p. 4242 The ideals of irredentism were used to convince the population of the necessity of the war, but the true motive of the political leadership to join the war was their idea that Italy should become a great European power. Rusconi 42 p. 4242     War against the Austro-Hungarian Empire was declared May 42 42 This put Tyrol on the front line, which passed through some of the highest mountains in the ": null
    },
    {
        "Alps": "alps"
    },
    {
        ". The ensuing front became known as the War in ice and snow , as troops occupied the highest mountains and glaciers all year long. Twelve metres of snow were common during the winter of 42–42 and tens of thousands of soldiers disappeared in ": null
    },
    {
        "avalanche": "avalanche"
    },
    {
        "s. The remains of these soldiers are still being uncovered today. The Italian ": null
    },
    {
        "Alpini": "alpini"
    },
    {
        ", their Austrian counterparts , and the German ": null
    },
    {
        "Alpenkorps": "alpenkorps"
    },
    {
        " occupied every hill and mountain top. They began carving extensive fortifications and military quarters, even drilling tunnels inside the mountains and deep into glaciers, like at ": null
    },
    {
        "Marmolada": "marmolada"
    },
    {
        ". Hundreds of troops would drag guns over mountains up to 42 m . Streets, cable cars, mountain railways and walkways through the steepest of walls were built. The first to occupy higher ground became almost impossible to dislodge, so both sides turned to drilling tunnels under mountain peaks, filling them up with explosives, then detonating the entire mountain, including its defenders, such as ": null
    },
    {
        "Col di Lana": "col di lana"
    },
    {
        ", Monte Pasubio, Lagazuoi, etc. Climbing and skiing became essential skills for the troops of both sides and soon Ski Battalions and Special Climbing units were formed.     On May 42 42 the Austrian army ": null
    },
    {
        "staged an attack from the Trentino": "battle of asiago"
    },
    {
        ", unaided by the German army, whose command had advised against such a move. Several divisions were withdrawn from the Russian front to achieve necessary troop strength. The offensive was of limited tactical success. Austrians penetrated twelve miles into Italian territory, inflicting heavy casualties on the Italians, but fell short of their strategic and political goals. Rothenberg 42 p. 4242 This inconclusive attack weakened the eastern front, which enabled the Russian Army to overrun Austrian positions in Galicia and threaten the heart of the Habsburg Empire Rothenberg 42 p. 42       After the ": null
    },
    {
        "Battle of Asiago": "battle of asiago"
    },
    {
        " in 42 which ended in a stalemate and brought only minor territorial gains to Austria, the Tyrolean frontline remained largely static. The main battles were fought elsewhere. This changed in October, 42 with Austro-Hungarian defeat in the ": null
    },
    {
        "Battle of Vittorio Veneto": "battle of vittorio veneto"
    },
    {
        ", the Imperial army collapsed and started to withdraw and, on 42 October, the Austro-Hungarians asked for an armistice. On 42 October 42 the Austro-Hungarian army was split in two. The ": null
    },
    {
        "armistice": "armistice of villa giusti"
    },
    {
        " was signed at 42 p.m., November 42 to become effective 42 hours later, at 42 p.m., November 42   Following the signing of the armistice, Austrian ": null
    },
    {
        "General Weber": "viktor weber edler von webenau"
    },
    {
        " informed his Italian counterparts that the Imperial army had already laid down its weapons, due to a previous order and requested combat and Italian advancement to cease. The Italian General ": null
    },
    {
        "Pietro Badoglio": "pietro badoglio"
    },
    {
        " sharply rejected the proposal, and threatened to stop all negotiations and continue the war. General Weber repeated the request, with no results. Stato Maggiore dellEsercito, Lesercito italiano nella Grande Guerra , Ufficio Storico, vol. 42 Tomo 42, 42bis, Roma, 42 Even before the order to cease hostilities, the Imperial Army had already started to collapse, ceasing to exist as a combat force. Fritz Weber, Das Ende der alten Armee. Österreich-Ungarns Zusammenbruch, : Split in two the Imperial army collapsed, starting a chaotic retiring, since October, 42 Italian troops continued their advance until 42 p.m. on November 42 The occupation of all Tyrol, including ": null
    },
    {
        "Innsbruck": "innsbruck"
    },
    {
        ", was completed in the days that followed.      Under the terms of the Austrian-Italian Armistice of Villa Giusti, as well as being required to evacuate all territory occupied since August, Austria-Hungarys forces were required to withdraw from South Tyrol, ": null
    },
    {
        "Tarvisio": "tarvisio"
    },
    {
        ", the ": null
    },
    {
        "Isonzo valley": "soča"
    },
    {
        ", ": null
    },
    {
        "Gorizia": "gorizia"
    },
    {
        ", ": null
    },
    {
        "Trieste": "trieste"
    },
    {
        ", ": null
    },
    {
        "Istria": "istria"
    },
    {
        ", western ": null
    },
    {
        "Carniola": "carniola"
    },
    {
        ", and ": null
    },
    {
        "Dalmatia": "dalmatia"
    },
    {
        ". Terms mandated German forces expulsion from Austria-Hungary within 42 days or their internment, and the Allies were to have free use of Austria-Hungarys internal communications. They were also obliged to allow Entente armies transit, to reach Germany from the South.      The Italian General Rodolfo Grazianis 42th Italian army continued to advance, supported on the right by the 42th army. The result was that Austria-Hungary lost about 42 casualties and between 4242 prisoners . Italian losses numbered about 42, including 42 French and 42 Britons.     It appears that the large quantity of prisoners stemmed from the Austrian command decision that captivity in Italy was preferable to starvation at home. Rothenberg 42 p. 42 After the armistice, hundreds of thousands of Austrian soldiers without weapons, food and discipline made their way home through the alpine valleys. The alpine villages were caught between the retreating, half-starved soldiers who repeatedly resorted to theft and robbery to survive, and the advancing Italian army. At the same time, great numbers of Italian war prisoners were making their way south towards their homeland. Austria did not have the means to guarantee the orderly retreat of its own army or the organized return of Italian war prisoners. Pasquali 42 p. 42 In the meantime, Italian occupation of Tyrol was going as planned. On 42 November, Italian troops occupied the Brenner Pass and the Pass at ": null
    },
    {
        "Toblach": "toblach"
    },
    {
        ". To secure access to the ": null
    },
    {
        "Inn": "inn"
    },
    {
        " valley, crucial for an advance into southern Germany, ": null
    },
    {
        "Innsbruck": "innsbruck"
    },
    {
        ", capital of Tyrol, and the village ": null
    },
    {
        "Landeck": "landeck"
    },
    {
        " were occupied as well. On 42 January 42 the commander of the 42rd army corps, Gen. Ugo Sani, was appointed military governor of northern Tyrol with residence in Innsbruck.          The ": null
    },
    {
        "Treaty of Saint-Germain-en-Laye": "treaty of saint-germain-en-laye"
    },
    {
        " of 42 ruled that, according to the ": null
    },
    {
        "Treaty of London": "treaty of london"
    },
    {
        ", the southern part of Tyrol had to be ceded to the ": null
    },
    {
        "Kingdom of Italy": "kingdom of italy"
    },
    {
        ". Italys border was pushed northward to the strategically important Alpine ": null
    },
    {
        "water divide": "drainage divide"
    },
    {
        ", including present day-South Tyrol with its large German-speaking majority. Oscar Benvenuto : , Bozen/Bolzano 42 p. 42 Table 42 The northern part of Tyrol was retained by the ": null
    },
    {
        "First Austrian Republic": "republic of austria"
    },
    {
        ". In 42 towns of ": null
    },
    {
        "Buchenstein": "livinallongo del col di lana"
    },
    {
        ", ": null
    },
    {
        "Hayden": "cortina dampezzo"
    },
    {
        " and ": null
    },
    {
        "Verseil": "colle santa lucia"
    },
    {
        " were transferred from ": null
    },
    {
        "Province of Bolzano": "province of bolzano"
    },
    {
        " to ": null
    },
    {
        "Province of Belluno": "province of belluno"
    },
    {
        ". Also, ": null
    },
    {
        "Hastachtal": "pedemonte"
    },
    {
        " was transferred from ": null
    },
    {
        "Province of Trento": "province of trento"
    },
    {
        " to ": null
    },
    {
        "Province of Vicenza": "province of vicenza"
    },
    {
        " in 42 and towns of ": null
    },
    {
        "Magasa": "magasa, lombardy"
    },
    {
        " and ": null
    },
    {
        "Valvestino": "valvestino"
    },
    {
        " were transferred from ": null
    },
    {
        "Province of Trento": "province of trento"
    },
    {
        " to ": null
    },
    {
        "Province of Brescia": "province of brescia"
    }
]