[
    {
        "The history of science and technology  is a field of ": null
    },
    {
        "history": "history"
    },
    {
        " which examines how understanding of the natural world and ability to manipulate it  have changed over the centuries. This academic discipline also studies the cultural, economic, and political impacts of scientific innovation.     ": null
    },
    {
        "Histories of science": "historiography of science"
    },
    {
        " were originally written by practicing and retired scientists, starting primarily with ": null
    },
    {
        "William Whewell": "william whewell"
    },
    {
        ", as a way to communicate the virtues of science to the public. In the early 1930s, after a famous paper given by the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " historian ": null
    },
    {
        "Boris Hessen": "boris hessen"
    },
    {
        ", was focused into looking at the ways in which scientific practices were allied with the needs and motivations of their context. After ": null
    },
    {
        "World War  II": "world war & nbsp;ii"
    },
    {
        ", extensive resources were put into teaching and researching the discipline, with the hopes that it would help the public better understand both Science and Technology as they came to play an exceedingly prominent role in the world. In the 1960s, especially in the wake of the work done by ": null
    },
    {
        "Thomas Kuhn": "thomas kuhn"
    },
    {
        ", the discipline began to serve a very different function, and began to be used as a way to critically examine the scientific enterprise.     Modern engineering as it is understood today took form during the ": null
    },
    {
        "Scientific Revolution": "scientific revolution"
    },
    {
        ", though much of the mathematics and science was built on the work of the ": null
    },
    {
        "Greeks": "ancient greece"
    },
    {
        ", ": null
    },
    {
        "Egyptians": "ancient egypt"
    },
    {
        ", ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        "ns, ": null
    },
    {
        "Chinese": "history of science and technology in china"
    },
    {
        ", ": null
    },
    {
        "Indians": "science and technology in ancient india"
    },
    {
        ". See the main articles ": null
    },
    {
        "History of science": "history of science"
    },
    {
        " and ": null
    },
    {
        "History of technology": "history of technology"
    },
    {
        " for these respective topics.           ": null
    },
    {
        "Buenos Aires Institute of Technology": "buenos aires institute of technology"
    },
    {
        ", Argentina, has been offering courses on History of the Technology and the Science.   ": null
    },
    {
        "National Technological University": "national technological university"
    },
    {
        ", Argentina, has a complete history program on its offered careers.       ": null
    },
    {
        "The University of Sydney": "the university of sydney"
    },
    {
        " offers both undergraduate and postgraduate programmes in the History and Philosophy of Science, run by the Unit for the History and Philosophy of Science, within the Science Faculty. Undergraduate coursework can be completed as part of either a Bachelor of Science or a Bachelor of Arts Degree. Undergraduate study can be furthered by completing an additional Honours year. For postgraduate study, the Unit offers both coursework and research based degrees. The two course-work based postgraduate degrees are the Graduate Certificate in Science and the Graduate Diploma in Science . The two research based postgraduate degrees are a Master of Science and Doctor of Philosophy .        ": null
    },
    {
        "University of Liège": "university of liège"
    },
    {
        ", has a Department called Centre dhistoire des Sciences et Techniques.        ": null
    },
    {
        "Carleton University": "carleton university"
    },
    {
        " Ottawa offer courses in Ancient Science and Technology in its Technology, Society and Environment program.   ": null
    },
    {
        "University of Toronto": "university of toronto"
    },
    {
        " has a program in History and Philosophy of Science and Technology.    ": null
    },
    {
        "University of Kings College": "university of kings college"
    },
    {
        " in Halifax, Nova Scotia has a History of Science and Technology Program.        ": null
    },
    {
        "Nantes University": "nantes university"
    },
    {
        " has a dedicated Department called .   ": null
    },
    {
        "Paris Diderot University": "paris 7 - denis diderot university"
    },
    {
        " has a Department of History and Philosophy of Science.   A CNRS research center in History and Philosophy of Science , affiliated with Paris Diderot University, has a dedicated  section.   ": null
    },
    {
        "Pantheon-Sorbonne University": "university of paris 1 pantheon-sorbonne"
    },
    {
        " has a dedicated .   The ": null
    },
    {
        "École Normale Supérieure": "école normale supérieure"
    },
    {
        " de Paris has a history of science Department.       ": null
    },
    {
        "Technische Universität Berlin": "technische universität berlin"
    },
    {
        ", has a program in the History of Science and Technology.        The ": null
    },
    {
        "University of Athens": "university of athens"
    },
    {
        " has a Department of Philosophy and History of Science        History of science and technology is a well developed field in India. At least three generations of scholars can be identified.   The first generation includes D.D.Kosambi, Dharmpal, Debiprasad Chattopadhyay and Rahman. The second generation mainly consists of ": null
    },
    {
        "Ashis Nandy": "ashis nandy"
    },
    {
        ", ": null
    },
    {
        "Deepak Kumar": "deepak kumar"
    },
    {
        ", ": null
    },
    {
        "Dhruv Raina": "dhruv raina"
    },
    {
        ", ": null
    },
    {
        "S. Irfan Habib": "s. irfan habib"
    },
    {
        ", ": null
    },
    {
        "Shiv Visvanathan": "shiv visvanathan"
    },
    {
        ", ": null
    },
    {
        "Gyan Prakash": "gyan prakash"
    },
    {
        ", Stan Lourdswamy, V.V. Krishna, ": null
    },
    {
        "Itty Abraham": "itty abraham"
    },
    {
        ", Richard Grove, Kavita Philip, Mira Nanda and Rob Anderson. There is an emergent third generation that includes scholars like Abha Sur and Jahnavi Phalkey.     Departments and Programmes     The ": null
    },
    {
        "National Institute of Science, Technolology and Development Studies": "national institute of science, technology and development studies"
    },
    {
        " had a research group active in the 1990s which consolidated social history of science as a field of research in India.   Currently there are several institutes and university departments offering HST programmes.    has an Mphil-PhD program that offer specialisation in Social History of Science. It is at the History of Science and Education group of the  in the School of Social Sciences. Renowned Indian science historians Deepak Kumar and Dhruv Raina teach here. Also,  has an Mphil-PhD program that offers specialization in Science, Technology, and Society along with various allied subdisciplines.    has an  at the , where Social History of Science and Technology in India is a major emphasis for research and teaching.   ": null
    },
    {
        "Banaras Hindu University": "banaras hindu university"
    },
    {
        " has programs: one in History of Science and Technology at the Faculty of Science and one in Historical and Comparative Studies of the Sciences and the Humanities at the Faculty of Humanities.   ": null
    },
    {
        "Andhra University": "andhra university"
    },
    {
        " has now set History of Science and Technology as a compulsory subject for all the First year B-Tech students.       ": null
    },
    {
        "Tel Aviv University": "tel aviv university"
    },
    {
        ". The Cohn Institute for the History and Philosophy of Science and Ideas is a research and graduate teaching institute within the framework of the School of History of ": null
    },
    {
        "Tel Aviv University": "tel aviv university"
    },
    {
        ".    ": null
    },
    {
        "Bar Ilan University": "bar ilan university"
    },
    {
        " has a Department for Science and Technology Studies.        ": null
    },
    {
        "Kyoto University": "kyoto university"
    },
    {
        " has a program in the Philosophy and History of Science.    ": null
    },
    {
        "Tokyo Institute of Technology": "tokyo institute of technology"
    },
    {
        " has a program in the History, Philosophy, and Social Studies of Science and Technology.    ": null
    },
    {
        "The University of Tokyo": "the university of tokyo"
    },
    {
        " has a program in the History and Philosophy of Science.       ": null
    },
    {
        "Utrecht University": "utrecht university"
    },
    {
        ", has two co-operating programs: one in History and Philosophy of Science at the Faculty of Natural Sciences and one in Historical and Comparative Studies of the Sciences and the Humanities at the Faculty of Humanities.         ": null
    },
    {
        "University of the Basque Country": "university of the basque country"
    },
    {
        ", offers a masters degree and PhD programme in History and Philosophy of Science and runs since 1952 THEORIA. International Journal for Theory, History and Foundations of Science.   The university also sponsors the ": null
    },
    {
        "Basque Museum of the History of Medicine and Science": "basque museum of the history of medicine and science"
    },
    {
        ", the only open museum of History of Science of ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", that in the past offered also PhD courses.   ": null
    },
    {
        "Universitat Autònoma de Barcelona": "universitat autònoma de barcelona"
    },
    {
        ", offers a masters degree and PhD programme in HST together with the ": null
    },
    {
        "Universitat de Barcelona": "universitat de barcelona"
    },
    {
        ".    ": null
    },
    {
        "Universitat de València": "universitat de valència"
    },
    {
        ", offers a masters degree and PhD programme in HST together with the ": null
    },
    {
        "Consejo Superior de Investigaciones Científicas": "consejo superior de investigaciones científicas"
    },
    {
        ".        ": null
    },
    {
        "Linköpings universitet": "linköping university"
    },
    {
        ", has a Science, Technology, and Society program which includes HST.        ": null
    },
    {
        "University of Bern": "university of bern"
    },
    {
        ", has an undergraduate and a graduate program in the History and Philosophy of Science.        ": null
    },
    {
        "University of Kent": "university of kent"
    },
    {
        " has a Centre for the History of the Sciences, which offers Masters programmes and undergraduate modules.    ": null
    },
    {
        "University College Londons": "university college london"
    },
    {
        " Department of Science and Technology Studies": "department of science and technology studies"
    },
    {
        " offers undergraduate programme in History and Philosophy of Science, including two BSc single honour degrees , plus both major and minor streams in history, philosophy and social studies of science in UCLs Natural Sciences programme. The department also offers MSc degrees in History and Philosophy of Science and in the study of contemporary Science, Technology, and Society. An MPhil/PhD research degree is offered, too.  UCL also contains a Centre for the History of Medicine.  This operates a small teaching programme in History of Medicine.   ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        " has a one-year graduate course in History of Science: Instruments, Museums, Science, Technology associated with the ": null
    },
    {
        "Museum of the History of Science": "museum of the history of science"
    },
    {
        ".    ": null
    },
    {
        "University of Leeds": "university of leeds"
    },
    {
        " has both undergraduate and graduate programmes in History and Philosophy of Science in the Department of Philosophy.    ": null
    },
    {
        "University of Manchester": "university of manchester"
    },
    {
        " offers undergraduate modules and postgraduate study in History of Science, Technology and Medicine and is sponsored by the Wellcome Trust.    ": null
    },
    {
        "University of Bristol": "university of bristol"
    },
    {
        " has a masters and PhD program in the Philosophy and History of Science.    ": null
    },
    {
        "University of Cambridge": "university of cambridge"
    },
    {
        " has an undergraduate course and a large masters and PhD program in the History and Philosophy of Science .    ": null
    },
    {
        "University of Durham": "university of durham"
    },
    {
        " has several undergraduate History of Science modules in the Philosophy department, as well as Masters and PhD programs in the discipline.    ": null
    },
    {
        "London Centre for the History of Science, Medicine, and Technology": "london centre for the history of science, medicine, and technology"
    },
    {
        " - this Centre closes in 2013. It was formed in 1987 and ran a taught MSc programme, jointly taught by ": null
    },
    {
        "University College Londons": "university college london"
    },
    {
        " Department of Science and Technology Studies": "department of science and technology studies"
    },
    {
        " and ": null
    },
    {
        "Imperial College London": "imperial college london"
    },
    {
        ". The Masters programme transferred to UCL.        Academic study of the history of science as an independent discipline was launched by ": null
    },
    {
        "George Sarton": "george sarton"
    },
    {
        " at Harvard with his book Introduction to the History of Science and the ": null
    },
    {
        "Isis journal": "isis"
    },
    {
        " . Sarton exemplified the early 20th century view of the history of science as the history of great men and great ideas. He shared with many of his contemporaries a Whiggish belief in history as a record of the advances and delays in the march of progress. The History of Science was not a recognized subfield of American history in this period, and most of the work was carried out by interested Scientists and Physicians rather than professional Historians. Nathan Reingold, History of Science Today, 1. Uniformity as Hidden Diversity: History of Science in the United States, 1920-1940, British Journal for the History of Science 1986 19: 243-262 With the work of ": null
    },
    {
        "I. Bernard Cohen": "i. bernard cohen"
    },
    {
        " at Harvard, the history of Science became an established subdiscipline of history after 1945.      ": null
    },
    {
        "Arizona State Universitys": "arizona state university"
    },
    {
        "Center for Biology and Society offers several paths for MS or PhD students who are interested in issues surrounding the history and philosophy of the science, particularly biological sciences. The strength of the Center has much to do with the success of its director ": null
    },
    {
        "Jane Maienschein": "jane maienschein"
    },
    {
        ". With a concentration in Biology and Society one can focus on History and Philosophy of Science, Bioscience Ethics, Policy and Law, or Ecology, Economics, and Ethics of the Environment.    ": null
    },
    {
        "Brown University": "brown university"
    },
    {
        " has a program in ": null
    },
    {
        "Science and Technology Studies": "science and technology studies"
    },
    {
        "  and the ": null
    },
    {
        "History of Mathematics": "history of mathematics"
    },
    {
        ".    ": null
    },
    {
        "California Institute of Technology": "california institute of technology"
    },
    {
        " offers courses in the History and Philosophy of Science to fulfill its core humanities requirements.   ": null
    },
    {
        "Case Western Reserve University": "case western reserve university"
    },
    {
        " has an undergraduate interdisciplinary program in the History and Philosophy of Science  and a graduate program in the History of Science, Technology, Environment, and Medicine .    ": null
    },
    {
        "Cornell University": "cornell university"
    },
    {
        " offers a variety of courses within the Science and Technology course. One notable course is called Science and Technology History, taught currently by Professor ": null
    },
    {
        "Peter Dear": "peter dear"
    },
    {
        ", which centers upon the development of Science and Technology History from the Newtonian era up to the Einsteinian revolution. This class is one of the longest running classes at Cornell University and is offered by the ": null
    },
    {
        "College of Arts and Sciences": "cornell university college of arts and sciences"
    },
    {
        " and caters to students who want to learn more about the development of modern science.    ": null
    },
    {
        "Georgia Institute of Technology": "georgia institute of technology"
    },
    {
        " has an undergraduate and graduate program in the History of Technology and Society.    ": null
    },
    {
        "Harvard": "harvard"
    },
    {
        " has a large undergraduate and graduate program in History of Science, and is one of the largest departments currently in the world.    ": null
    },
    {
        "Indiana University": "indiana university"
    },
    {
        " offers undergraduate courses and a masters and PhD program in the History and Philosophy of Science.   ": null
    },
    {
        "Johns Hopkins University": "johns hopkins university"
    },
    {
        " has an undergraduate and graduate program in the History of Science, Medicine, and Technology.    University of Kings College has a degree program in History of Science and Technology   ": null
    },
    {
        "Lehigh University": "lehigh university"
    },
    {
        " offers an undergraduate level STS concentration and a graduate program with emphasis on the History of Industrial America.    ": null
    },
    {
        "Massachusetts Institute of Technology": "massachusetts institute of technology"
    },
    {
        " has a Science, Technology, and Society program which includes HST.    ": null
    },
    {
        "Michigan State University": "michigan state university"
    },
    {
        " offers an undergraduate major and minor in History, Philosophy, and Sociology of Science through its Lyman Briggs College.    ": null
    },
    {
        "New Jersey Institute of Technology": "new jersey institute of technology"
    },
    {
        " has a Science, Technology, and Society program which includes the History of Science and Technology    ": null
    },
    {
        "Oregon State University": "oregon state university"
    },
    {
        " offers a Masters and Ph.D. in History of Science through its Department of History.    ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        " has a program in the History of Science.    ": null
    },
    {
        "Rensselaer Polytechnic Institute": "rensselaer polytechnic institute"
    },
    {
        " has a Science and Technology Studies department   ": null
    },
    {
        "Rutgers": "rutgers"
    },
    {
        " has a graduate Program in History of Science, Technology, Environment, and Health.    ": null
    },
    {
        "Stanford": "stanford"
    },
    {
        " has a History and Philosophy of Science and Technology program.    ": null
    },
    {
        "Stevens Institute of Technology": "stevens institute of technology"
    },
    {
        " has an undergraduate and graduate program in the History of Science.   ": null
    },
    {
        "University of California, Berkeley": "university of california, berkeley"
    },
    {
        " offers a graduate degree in HST through its History program, and maintains a separate sub-department for the field.    ": null
    },
    {
        "University of California, Los Angeles": "university of california, los angeles"
    },
    {
        " has a relatively large group History of Science and Medicine faculty and graduate students within its History department, and also offers an undergraduate minor in the History of Science.    ": null
    },
    {
        "University of California Santa Barbara": "university of california santa barbara"
    },
    {
        " has an interdisciplinary graduate program emphasis in Technology & Society through the ": null
    },
    {
        "Center for Information Technology & Society": "center for information technology  &  society"
    },
    {
        ". The history department is affiliated with the emphasis.    ": null
    },
    {
        "University of Florida": "university of florida"
    },
    {
        " has a Graduate Program in History of Science, Technology, and Medicine at the University of Florida provides undergraduate and graduate degrees.    ": null
    },
    {
        "University of Minnesota": "university of minnesota"
    },
    {
        " has a Ph.D. program in History of Science, Technology, and Medicine as well as undergraduate courses in these fields. The Minnesota model integrates historians of science, technology, and medicine within the various science departments they study, each holding a joint appointment.    ": null
    },
    {
        "University of Oklahoma": "university of oklahoma"
    },
    {
        " has an undergraduate minor and a graduate degree program in History of Science.    ": null
    },
    {
        "University of Pennsylvania": "university of pennsylvania"
    },
    {
        " has a program in History and Sociology of Science.    ": null
    },
    {
        "University of Pittsburghs": "university of pittsburgh"
    },
    {
        "Department of History and Philosophy of Science offers graduate and undergraduate courses.    ": null
    },
    {
        "University of Puget Sound": "university of puget sound"
    },
    {
        " has a Science, Technology, and Society program, which includes the history of Science and Technology.    ": null
    },
    {
        "University of Wisconsin–Madison": "university of wisconsin–madison"
    },
    {
        " has one of the largest programs in History of Science, Medicine and Technology, with particular strength in Medical History, History of Biology, History of Science and Religion, and Environmental History. This program was the first to exist as an independent academic department. It offers M.A. and Ph.D. degrees as well as an undergraduate major.    ": null
    },
    {
        "Wesleyan University": "wesleyan university"
    },
    {
        " has a Science in Society program.    ": null
    },
    {
        "Yale University": "yale university"
    },
    {
        " has a program in the History of Science and Medicine.                ": null
    },
    {
        "Wiebe Bijker": "wiebe bijker"
    },
    {
        " Peter J. Bowler": "peter j. bowler"
    },
    {
        " Janet Browne": "janet browne"
    },
    {
        " Stephen G. Brush": "stephen g. brush"
    },
    {
        " James Burke": "james burke"
    },
    {
        " Edwin Arthur Burtt": "edwin arthur burtt"
    },
    {
        " Johann Beckmann": "johann beckmann"
    },
    {
        " Jim Bennett": "jim bennett"
    },
    {
        " Herbert Butterfield": "herbert butterfield"
    },
    {
        "   Martin Campbell-Kelly": "martin campbell-kelly"
    },
    {
        " Georges Canguilhem": "georges canguilhem"
    },
    {
        "   Allan Chapman": "allan chapman"
    },
    {
        " I. Bernard Cohen": "i. bernard cohen"
    },
    {
        "   A. C. Crombie": "a. c. crombie"
    },
    {
        "   E. J. Dijksterhuis": "e. j. dijksterhuis"
    },
    {
        " Pierre Duhem": "pierre duhem"
    },
    {
        "   A. Hunter Dupree": "a. hunter dupree"
    },
    {
        " George Dyson": "george dyson"
    },
    {
        " Jacques Ellul": "jacques ellul"
    },
    {
        " Eugene S. Ferguson": "eugene s. ferguson"
    },
    {
        " Peter Galison": "peter galison"
    },
    {
        " Sigfried Giedion": "sigfried giedion"
    },
    {
        " Charles Coulston Gillispie": "charles coulston gillispie"
    },
    {
        " Robert Gunther": "robert gunther"
    },
    {
        "   Paul Forman": "paul forman"
    },
    {
        " Donna Haraway": "donna haraway"
    },
    {
        " Peter Harrison": "peter harrison"
    },
    {
        " Ahmad Y Hassan": "ahmad y hassan"
    },
    {
        " John L. Heilbron": "john l. heilbron"
    },
    {
        " Boris Hessen": "boris hessen"
    },
    {
        " Reijer Hooykaas": "reijer hooykaas"
    },
    {
        " David A. Hounshell": "david a. hounshell"
    },
    {
        " Thomas P. Hughes": "thomas p. hughes"
    },
    {
        " Evelyn Fox Keller": "evelyn fox keller"
    },
    {
        " Daniel Kevles": "daniel kevles"
    },
    {
        " Alexandre Koyré": "alexandre koyré"
    },
    {
        "   Melvin Kranzberg": "melvin kranzberg"
    },
    {
        " Thomas Kuhn": "thomas kuhn"
    },
    {
        " Deepak Kumar": "deepak kumar"
    },
    {
        " Gilbert LaFreniere": "gilbert lafreniere"
    },
    {
        " Bruno Latour": "bruno latour"
    },
    {
        " David C. Lindberg": "david c. lindberg"
    },
    {
        " G. E. R. Lloyd": "g. e. r. lloyd"
    },
    {
        " Jane Maienschein": "jane maienschein"
    },
    {
        " Anneliese Maier": "anneliese maier"
    },
    {
        " Leo Marx": "leo marx"
    },
    {
        " Lewis Mumford": "lewis mumford"
    },
    {
        "   John E. Murdoch": "john e. murdoch"
    },
    {
        "   Otto Neugebauer": "otto neugebauer"
    },
    {
        "   William R. Newman": "william r. newman"
    },
    {
        " David Noble": "david f. noble"
    },
    {
        " Ronald Numbers": "ronald numbers"
    },
    {
        " David E. Nye": "david e. nye"
    },
    {
        " Abraham Pais": "abraham pais"
    },
    {
        "   Trevor Pinch": "trevor pinch"
    },
    {
        " Theodore Porter": "theodore porter"
    },
    {
        " Lawrence M. Principe": "lawrence m. principe"
    },
    {
        " Raúl Rojas": "raúl rojas"
    },
    {
        " Michael Ruse": "michael ruse"
    },
    {
        " A. I. Sabra": "a. i. sabra"
    },
    {
        " Jan Sapp": "jan sapp"
    },
    {
        " George Sarton": "george sarton"
    },
    {
        "   Simon Schaffer": "simon schaffer"
    },
    {
        " Howard Segal": "howard segal"
    },
    {
        " Steven Shapin": "steven shapin"
    },
    {
        " Wolfgang Schivelbusch": "wolfgang schivelbusch"
    },
    {
        " Charles Singer": "charles singer"
    },
    {
        " Merritt Roe Smith": "merritt roe smith"
    },
    {
        " Stephen Snobelen": "stephen snobelen"
    },
    {
        " M. Norton Wise": "m. norton wise"
    },
    {
        " Frances A. Yates": "frances a. yates"
    },
    {
        "     Annals of Science   The British Journal for the History of Science   Centaurus  Dynamis  History and Technology   History of Technology   Historical Studies in the Physical and Biological Sciences     Historical Studies in the Natural Sciences    ICON  IEEE Annals of the History of Computing   Isis  Journal of the History of Biology  Journal of the History of Medicine and Allied Sciences   Notes and Records of the Royal Society  Osiris Science & Technology Studies Science in Context Science, Technology, & Human Values Social History of Medicine   Social Studies of Science   ": null
    },
    {
        "Technology and Culture": "technology and culture"
    },
    {
        "   Transactions of the Newcomen Society": "transactions of the newcomen society"
    },
    {
        "   Historia Mathematica": "historia mathematica"
    },
    {
        "   Bulletin of the Scientific Instrument Society": null
    }
]