[
    {
        "Mali is located in Africa.   The history of the territory of modern ": null
    },
    {
        "Mali": "mali"
    },
    {
        " may be divided into:   Pre-Imperial Mali, before the 42th century   the history of the eponymous Mali Empire and of the Songhai Empire during the 42th to 42th centuries     The borders of Mali are those of French Sudan, drawn in 42 They are artificial, and unite part of the larger ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        " region with parts of the Sahara.   As a consequence, Mali is a multiethnic country, with a majority of its population consisting of ": null
    },
    {
        "Mandé peoples": "mandé peoples"
    },
    {
        ".     Malis history is dominated by its role in trans-Saharan trade, connecting West Africa and the Maghreb. The Malian city ": null
    },
    {
        "Timbuktu": "timbuktu"
    },
    {
        " is exemplary of this: situated on the southern fringe of the Sahara and close to the ": null
    },
    {
        "River Niger": "niger river"
    },
    {
        ", it has played an important role in the trans-Saharan trade from the 42th century on, with the establishment of the ": null
    },
    {
        "Mali Empire": "mali empire"
    },
    {
        ".       The Mali Empire became Islamic in the early 42th century, under ": null
    },
    {
        "Musa I": "musa i"
    },
    {
        " of Mali. From that time until the 42th century, Timbuktu remained important as an outpost at the southwestern fringe of the Muslim world and a hub of the ": null
    },
    {
        "Arab slave trade": "arab slave trade"
    },
    {
        ".     ": null
    },
    {
        "Mandinka": "mandinka people"
    },
    {
        " from c. 42 to c. 42 The empire was founded by ": null
    },
    {
        "Sundiata Keita": "sundiata keita"
    },
    {
        " and became known for the ": null
    },
    {
        "wealth": "wealth"
    },
    {
        " of its rulers, especially ": null
    },
    {
        "Mansa": "mansa"
    },
    {
        " Musa I": "mansa musa"
    },
    {
        ". The Mali Empire had many profound cultural influences on West Africa, allowing the spread of its language, laws and customs along the ": null
    },
    {
        "Niger River": "niger river"
    },
    {
        ". It extended over a large area and consisted of numerous ": null
    },
    {
        "vassal kingdom": "vassal kingdom"
    },
    {
        "s and provinces.     The Mali Empire began to weaken in the 42th century, but it remained dominant for much of the 42th. It survived into the 42th century, but by then had lost much of its former strength and importance.       The Mali Empire began to weaken by the mid 42th century. The ": null
    },
    {
        "Songhai": "songhai people"
    },
    {
        " took advantage of this and asserted their independence. The Songhai made Gao their capital and began an imperial expansion of their own throughout the western ": null
    },
    {
        "Sahel": "sahel"
    },
    {
        ". And by 42 Songhai was strong enough to exact tribute from Masina.   The emerging ": null
    },
    {
        "Songhai Empire": "songhai empire"
    },
    {
        " and the declining ": null
    },
    {
        "Mali Empire": "mali empire"
    },
    {
        " co-existed during much of the later 42th and throughout the 42th century. In the later 42th century, control of ": null
    },
    {
        "Timbuktu": "timbuktu"
    },
    {
        " shifted to the Songhai Empire.       The Songhai empire eventually collapsed under the pressure from the Moroccan ": null
    },
    {
        "Saadi dynasty": "saadi dynasty"
    },
    {
        ". The turning-point was the ": null
    },
    {
        "Battle of Tondibi": "battle of tondibi"
    },
    {
        " of 42 March 42 Morocco subsequently controlled ": null
    },
    {
        "Gao": "gao"
    },
    {
        ", ": null
    },
    {
        "Timbuktu": "pashalik of timbuktu"
    },
    {
        ", ": null
    },
    {
        "Djenné": "djenné"
    },
    {
        " , and related trade routes with much difficulty until around the end of the 42th century.        After the collapse of the Songhai Empire, no single state controlled the region. The Moroccans only succeeded in occupying a few portions of the country, and even in those locations where they did attempt to rule, their hold was weak and challenged by rivals. Several small successor kingdoms arose. the most notable in what is now Mali were:             The Bambara Empire existed as a centralized state from 42 to 42 was based at ": null
    },
    {
        "Ségou": "ségou"
    },
    {
        " and also Timbuktu , and ruled parts of central and southern Mali. It existed until El Hadj ": null
    },
    {
        "Umar Tall": "umar tall"
    },
    {
        ", a ": null
    },
    {
        "Toucouleur": "toucouleur people"
    },
    {
        " conqueror swept across West Africa from ": null
    },
    {
        "Futa Tooro": "futa tooro"
    },
    {
        ". Umar Talls mujahideen readily defeated the Bambara, seizing Ségou itself on March 42 42 and declaring an end to the empire.          A split in the Coulibaly dynasty in Ségou led to the establishment of a second Bambara state, the kingdom of Kaarta, in what is now western Mali, in 42 It was defeated in 42 by ": null
    },
    {
        "Umar Tall": "umar tall"
    },
    {
        ", leader of ": null
    },
    {
        "Toucouleur Empire": "toucouleur empire"
    },
    {
        ", before his war with Ségou.          The ": null
    },
    {
        "Senufo": "senufo people"
    },
    {
        " Kenedugu Kingdom originated in the 42th century in the area around what is now the border of Mali and ": null
    },
    {
        "Burkina Faso": "burkina faso"
    },
    {
        ". In 42 the capital was moved to ": null
    },
    {
        "Sikasso": "sikasso"
    },
    {
        ". It resisted the effort of ": null
    },
    {
        "Samori Ture": "samori"
    },
    {
        ", leader of ": null
    },
    {
        "Wassoulou Empire": "wassoulou empire"
    },
    {
        ", in 42 to conquer it, and was one of the last kingdoms in the area to fall to the French in 42          An Islamic-inspired uprising in the largely ": null
    },
    {
        "Fula": "fula people"
    },
    {
        " Inner Niger Delta": "inner niger delta"
    },
    {
        " region against rule by Ségou in 42 led to establishment of a separate state. It later allied with ": null
    },
    {
        "Bambara Empire": "bambara empire"
    },
    {
        " against ": null
    },
    {
        "Umar Tall": "umar tall"
    },
    {
        "s ": null
    },
    {
        "Toucouleur Empire": "toucouleur empire"
    },
    {
        " and was also defeated by it in 42          This empire, founded by ": null
    },
    {
        "El Hadj Umar Tall": "el hadj umar tall"
    },
    {
        " of the ": null
    },
    {
        "Toucouleur people": "toucouleur people"
    },
    {
        "s, beginning in 42 ruled eventually most of what is now Mali until the French conquest of the region in 42 This was in some ways a turbulent period, with ongoing resistance in Massina and increasing pressure from the French.          The Wassoulou or Wassulu Empire was a short-lived empire, led by ": null
    },
    {
        "Samori Ture": "samori"
    },
    {
        " in the predominantly ": null
    },
    {
        "Malinké": "mandinka people"
    },
    {
        " area of what is now upper ": null
    },
    {
        "Guinea": "guinea"
    },
    {
        " and southwestern Mali . It later moved to ": null
    },
    {
        "Ivory Coast": "ivory coast"
    },
    {
        " before being conquered by the French.            Mali fell under French colonial rule in 42  In 42 the French appointed a civilian governor of the territory they called Soudan Français , but active resistance to French rule continued. By 42 most of the area was under firm French control.     French Sudan was administered as part of the Federation of ": null
    },
    {
        "French West Africa": "french west africa"
    },
    {
        " and supplied labor to France’s colonies on the coast of West Africa. In 42 the renamed Sudanese Republic obtained complete internal autonomy and joined the French Community. In early 42 the Sudanese Republic and Senegal formed the Federation of Mali. On 42 March 42 France agreed to the Federation of Mali becoming fully independent.  On 42 June 42 the Federation of Mali became an independent country and ": null
    },
    {
        "Modibo Keïta": "modibo keïta"
    },
    {
        " became its first President.          Following the withdrawal of Senegal from the federation in August 42 the former Sudanese Republic became the Republic of Mali on 42 September 42 with Modibo Keïta as president.     President ": null
    },
    {
        "Modibo Keïta": "modibo keïta"
    },
    {
        ", whose ": null
    },
    {
        "Sudanese Union-African Democratic Rally": "sudanese union-african democratic rally"
    },
    {
        " party had dominated pre-independence politics , moved quickly to declare a single-party state and to pursue a ": null
    },
    {
        "socialist": "socialist"
    },
    {
        " policy based on extensive ": null
    },
    {
        "nationalization": "nationalization"
    },
    {
        ". Keïta withdrew from the French Community and also had close ties to the ": null
    },
    {
        "Eastern bloc": "eastern bloc"
    },
    {
        ". A continuously deteriorating economy led to a decision to rejoin the Franc Zone in 42 and modify some of the economic excesses.       On November 42 42 a group of young officers staged a bloodless coup and set up a 42-member Military Committee for National Liberation , with Lt. ": null
    },
    {
        "Moussa Traoré": "moussa traoré"
    },
    {
        " as president. The military leaders attempted to pursue economic reforms, but for several years faced debilitating internal political struggles and the disastrous Sahelian drought.     A new constitution, approved in 42 created a one-party state and was designed to move Mali toward civilian rule. However, the military leaders remained in power. In September 42 a new political party was established, the Democratic Union of the Malian People , based on the concept of ": null
    },
    {
        "democratic centralism": "democratic centralism"
    },
    {
        ". Single-party presidential and legislative elections were held in June 42 and Gen. Moussa Traoré received 42% of the votes. His efforts at consolidating the single-party government were challenged in 42 by student-led anti-government demonstrations that led to three coup attempts, which were brutally quashed.     The political situation stabilized during 42 and 42 and remained generally calm throughout the 42s. In late December 42 however, a border dispute between Mali and ": null
    },
    {
        "Burkina Faso": "burkina faso"
    },
    {
        " over the mineral rich ": null
    },
    {
        "Agacher strip": "agacher strip war"
    },
    {
        " erupted into a brief war. The UDPM spread its structure to ": null
    },
    {
        "Cercle": "cercle"
    },
    {
        "s and Arrondissements across the land.     Shifting its attention to Malis economic difficulties, the government approved plans for some reforms of the state enterprise system, and attempted to control public corruption. It implemented cereal marketing liberalization, created new incentives to private enterprise, and worked out a new structural adjustment agreement with the ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        " . But the populace became increasingly dissatisfied with the austerity measures imposed by the IMF plan as well as their perception that the ruling elite was not subject to the same strictures. In response to the growing demands for multiparty democracy then sweeping the continent, the Traoré regime did allow some limited political liberalization. In National Assembly elections in June 42 multiple UDPM candidates were permitted to contest each seat, and the regime organized nationwide conferences to consider how to implement democracy within the one-party framework. Nevertheless, the regime refused to usher in a full-fledged democratic system.     However, by 42 cohesive opposition movements began to emerge, including the National Democratic Initiative Committee and the ": null
    },
    {
        "Alliance for Democracy in Mali": "alliance for democracy in mali"
    },
    {
        " . The increasingly turbulent political situation was complicated by the rise of ethnic violence in the north in mid42 The return to Mali of large numbers of ": null
    },
    {
        "Tuareg": "tuareg people"
    },
    {
        " who had migrated to ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        " and ": null
    },
    {
        "Libya": "libya"
    },
    {
        " during the prolonged drought increased tensions in the region between the nomadic Tuareg and the sedentary population. Ostensibly fearing a Tuareg secessionist movement in the north, the Traoré regime imposed a state of emergency and harshly repressed Tuareg unrest. Despite the signing of a peace accord in January 42 unrest and periodic armed clashes continued.       As in other African countries, demands for multi-party democracy increased. The Traoré government allowed some opening of the system, including the establishment of an independent press and independent political associations, but insisted that Mali was not ready for democracy. In early 42 student-led anti-government rioting broke out again, but this time it was supported also by government workers and others. On March 42 42 after 42 days of intense anti-government rioting, a group of 42 military officers, led by ": null
    },
    {
        "Amadou Toumani Touré": "amadou toumani touré"
    },
    {
        ", arrested President Traoré and suspended the constitution.     Within days, these officers joined with the Coordinating Committee of Democratic Associations to form a predominantly civilian, 42-member ruling body, the ": null
    },
    {
        "Transitional Committee for the Salvation of the People .": "transitional committee for the salvation of the people of the republic of mali"
    },
    {
        " The CTSP then appointed a civilian-led government. A national conference held in August 42 produced a draft constitution , a charter for political parties, and an electoral code. Political parties were allowed to form freely. Between January and April 42 a president, National Assembly, and municipal councils were elected. On June 42 42 ": null
    },
    {
        "Alpha Oumar Konaré": "alpha oumar konaré"
    },
    {
        ", the candidate of ADEMA, was inaugurated as the president of Malis Third Republic.     In 42 attempts to renew national institutions through democratic elections ran into administrative difficulties, resulting in a court-ordered annulment of the legislative elections held in April 42 The exercise, nonetheless, demonstrated the overwhelming strength of President Konarés ADEMA party, causing some other historic parties to boycott subsequent elections. President Konaré won the presidential election against scant opposition on May 42 In the two-round legislative elections conducted on July 42 and August 42 ADEMA secured over 42% of the National Assembly seats.         Konaré stepped down after his constitutionally mandated limit of two terms and did not run in the 42 elections. Touré then reemerged, this time as a civilian. Running as an independent on a platform of national unity, Touré won the presidency in a runoff against the candidate of Adema, which had been divided by infighting and suffered from the creation of a spin-off party, the ": null
    },
    {
        "Rally for Mali": "rassemblement pour le mali"
    },
    {
        ". Touré had retained great popularity because of his role in the transitional government in 42–42 The 42 election was a milestone, marking Malis first successful transition from one democratically elected president to another, despite the persistence of electoral irregularities and low voter turnout. In the 42 legislative elections, no party gained a majority; Touré then appointed a politically inclusive government and pledged to tackle Mali’s pressing social and economic development problems. Mali country profile, p. 42          In January 42 ": null
    },
    {
        "an insurgency": "2012 insurgency in the azawad"
    },
    {
        " has begun, led by the ": null
    },
    {
        "National Movement for the Liberation of Azawad": "national movement for the liberation of azawad"
    },
    {
        " . . News42 . Retrieved on: 42 Feb 42     On 42 March 42 it was reported that rebel troops from the military appeared on state TV announcing they had ": null
    },
    {
        "seized control of the country": "2012 mali coup détat attempt"
    },
    {
        ". . Bbc.co.uk . Retrieved on 424242 Unrest over the presidents handling of the conflict with the rebels was a motivating force. The former President was forced into hiding.     However, due to the ": null
    },
    {
        "42 insurgency in northern Mali": "2012 insurgency in northern mali"
    },
    {
        ", the military government controls only the southern third of the country, leaving the north of the country  to MNLA rebels. The rebels control Timbuktu, 42  km from the capital. . Bbc.co.uk . Retrieved on 424242 In response, the ": null
    },
    {
        "Economic Community of West African States": "economic community of west african states"
    },
    {
        " froze assets and imposed an embargo, leaving some with only days of fuel. Mali is dependent on fuel imports trucked overland from ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        " and ": null
    },
    {
        "Ivory Coast": "ivory coast"
    },
    {
        ". . Theglobeandmail.com . Retrieved on 424242     As of July 42 42 the ": null
    },
    {
        "Tuareg rebels": "tuareg rebellion"
    },
    {
        " have since been pushed out by their allies, the ": null
    },
    {
        "Islamists": "islamists"
    },
    {
        ", ": null
    },
    {
        "Ansar Dine": "ansar dine"
    },
    {
        ", and ": null
    },
    {
        "Al Qaeda in the Islamic Maghreb ": "al qaeda in the islamic maghreb"
    },
    {
        ".  An extremist ministate in northern Mali is the unexpected result from the collapse of the earlier ": null
    },
    {
        "coup detat": "coup detat"
    },
    {
        " by the angry army officers.     Refugees in the 42-person refugee camp at ": null
    },
    {
        "Mbera": "mbera"
    },
    {
        ", ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        ", describe the Islamists as intent on imposing an Islam of lash and gun on Malian Muslims. The Islamists in Timbuktu have destroyed about a half-dozen venerable above-ground tombs of revered holy men, proclaiming the tombs contrary to ": null
    },
    {
        "Shariah": "shariah"
    },
    {
        ". One refugee in the camp spoke of encountering Afghans, Pakistanis and Nigerians.     ": null
    },
    {
        "Ramtane Lamamra": "ramtane lamamra"
    },
    {
        ", the ": null
    },
    {
        "African Union": "african union"
    },
    {
        "s peace and security commissioner, said the African Union has discussed sending a military force to reunify Mali and that negotiations with terrorists had been ruled out but negotiations with other armed factions is still open.     On 42 December 42 Prime Minister ": null
    },
    {
        "Cheick Modibo Diarra": "cheick modibo diarra"
    },
    {
        " was arrested by soldiers and taken to a military base in ": null
    },
    {
        "Kati": "kati, mali"
    },
    {
        ".  Hours later, the Prime Minister announced his resignation and the resignation of his government on national television.      On 42 January 42 Islamist forces captured the strategic town of ": null
    },
    {
        "Konna": "konna"
    },
    {
        ", located 42  km from the capital, from the Malian army.  The following day, the French military launched ": null
    },
    {
        "Opération Serval": "opération serval"
    },
    {
        ", intervening in the conflict.      By 42 February, the Islamist-held territory had been re-taken by the Malian military, with help from the international coalition. Tuareg separatists have continued to fight the Islamists as well, although the ": null
    },
    {
        "MNLA": "national movement for the liberation of azawad"
    },
    {
        " has also been accused of carrying out attacks against the Malian military.      A peace deal between the government and Tuareg rebels was signed on 42 June 42     ": null
    },
    {
        "Presidential elections": "malian presidential election, 2013"
    },
    {
        " were held in ": null
    },
    {
        "Mali": "mali"
    },
    {
        " on 42 July 42 with a second round run-off held on 42 August.  Al Jazeera, 42 May 42 ": null
    },
    {
        "Ibrahim Boubacar Keïta": "ibrahim boubacar keïta"
    },
    {
        " defeated ": null
    },
    {
        "Soumaïla Cissé": "soumaïla cissé"
    },
    {
        " in the run-off to become the new ": null
    },
    {
        "President of Mali": "president of mali"
    }
]