[
    {
        "     In ": null
    },
    {
        "baseball statistics": "Baseball Statistics"
    },
    {
        ", a hit , also called a base hit, is credited to a ": null
    },
    {
        "batter": "Batting"
    },
    {
        " when the batter safely reaches ": null
    },
    {
        "first base": "First Baseman"
    },
    {
        " after hitting the ball into ": null
    },
    {
        "fair": "Fair Ball"
    },
    {
        " territory, without the benefit of an ": null
    },
    {
        "error": "Error"
    },
    {
        " or a ": null
    },
    {
        "fielders choice": "Fielders Choice"
    },
    {
        ".       To achieve a hit, the batter must reach first base before any fielder can either ": null
    },
    {
        "tag": "Tag Out"
    },
    {
        " him with the ball, throw to another player protecting the base before the batter reaches it, or ": null
    },
    {
        "tag first base": "Force Play"
    },
    {
        " while carrying the ball. The hit is scored the moment the batter reaches first base safely; if he is put out while attempting to stretch his hit to a ": null
    },
    {
        "double": "Double"
    },
    {
        " or ": null
    },
    {
        "triple": "Triple"
    },
    {
        " or home run on the same play, he still gets credit for a hit .     If a batter reaches first base because of offensive interference by a preceding runner , he is also credited with a hit.       A hit for one base is called a ": null
    },
    {
        "single": "Single"
    },
    {
        ", for two bases a ": null
    },
    {
        "double": "Double"
    },
    {
        ", and for three bases a ": null
    },
    {
        "triple": "Triple"
    },
    {
        ". A ": null
    },
    {
        "home run": "Home Run"
    },
    {
        " is also scored as a hit. Doubles, triples, and home runs are also called ": null
    },
    {
        "extra base hit": "Extra Base Hit"
    },
    {
        "s.     An ": null
    },
    {
        "infield hit": "Infield Hit"
    },
    {
        " is a hit where the ball does not leave the infield. Infield hits are uncommon by nature, and most often earned by speedy runners.       A ": null
    },
    {
        "no-hitter": "No-Hitter"
    },
    {
        " is a game in which one of the teams prevented the other from getting a hit. Throwing a no-hitter is rare and considered an extraordinary accomplishment for a pitcher or pitching staff. In most cases in the professional game, no-hitters are accomplished by a single pitcher who throws a complete game. A pitcher who throws a no-hitter could still allow runners to reach base safely, by way of ": null
    },
    {
        "walk": "Base On Balls"
    },
    {
        "s, ": null
    },
    {
        "error": "Error"
    },
    {
        "s, ": null
    },
    {
        "hit batsmen": "Hit By Pitch"
    },
    {
        ", or batter reaching base due to interference or obstruction. If the pitcher allows no runners to reach base in any manner whatsoever , the no-hitter is a ": null
    },
    {
        "perfect game": "Perfect Game"
    },
    {
        ".          In ": null
    },
    {
        "1887": "1887 In Baseball"
    },
    {
        ", ": null
    },
    {
        "Major League Baseball": "Major League Baseball"
    },
    {
        " counted ": null
    },
    {
        "bases on balls": "Base On Balls"
    },
    {
        " as hits. The result was skyrocketing ": null
    },
    {
        "batting average": "Batting Average"
    },
    {
        "s, including some near .500; ": null
    },
    {
        "Tip ONeill": "Tip Oneill"
    },
    {
        " of the ": null
    },
    {
        "St. Louis Browns": "St. Louis Browns"
    },
    {
        " batted .485 that season, which would still be a major league record if recognized. The experiment was abandoned the following season.     There is controversy regarding how the records of 1887 should be interpreted. The number of legitimate walks and at-bats are known for all players that year, so computing averages using the same method as in other years is straightforward. In 1968, Major League Baseball formed a Special Baseball Records Committee to resolve this issues. The Committee ruled that walks in 1887 should not be counted as hits. In 2000, Major League Baseball reversed its decision, ruling that the statistics which were recognized in each years official records should stand, even in cases where they were later proven incorrect. Most current sources list ONeills 1887 average as .435, as calculated by omitting his walks. He would retain his ": null
    },
    {
        "American Association": "American Association"
    },
    {
        " batting championship. However, the variance between methods results in differing recognition for the 1887 ": null
    },
    {
        "National League": "National League"
    },
    {
        " batting champion. ": null
    },
    {
        "Cap Anson": "Cap Anson"
    },
    {
        " would be recognized, with his .421 average, if walks are included, but ": null
    },
    {
        "Sam Thompson": "Sam Thompson"
    },
    {
        " would be the champion at .372 if they are not.       The official rulebook of ": null
    },
    {
        "Major League Baseball": "Major League Baseball"
    },
    {
        " states in Rule 10.05: ": null
    }
]