[
    {
        "In ": null
    },
    {
        "cryptography": "Cryptography"
    },
    {
        ", an HMAC  is a specific type of ": null
    },
    {
        "message authentication code": "Message Authentication Code"
    },
    {
        " involving a ": null
    },
    {
        "cryptographic hash function": "Cryptographic Hash Function"
    },
    {
        " and a secret ": null
    },
    {
        "cryptographic key": "Cryptographic Key"
    },
    {
        ". It may be used to simultaneously verify both the  data integrity  and the  authenticity  of a ": null
    },
    {
        "message": "Cleartext"
    },
    {
        ", as with any MAC. Any cryptographic hash function, such as ": null
    },
    {
        "SHA-256": "Sha-256"
    },
    {
        " or ": null
    },
    {
        "SHA-3": "Sha-3"
    },
    {
        ", may be used in the calculation of an HMAC; the resulting MAC algorithm is termed HMAC-X, where X is the hash function used . The cryptographic strength of the HMAC depends upon the ": null
    },
    {
        "cryptographic strength": "Cryptographic Strength"
    },
    {
        " of the underlying hash function, the size of its hash output, and the size and quality of the key.     HMAC uses two passes of hash computation. The secret key is first used to derive two keys – inner and outer. The first pass of the algorithm produces an internal hash derived from the message and the inner key. The second pass produces the final HMAC code derived from the inner hash result and the outer key. Thus the algorithm provides better immunity against ": null
    },
    {
        "length extension attack": "Length Extension Attack"
    },
    {
        "s.     An iterative hash function breaks up a message into blocks of a fixed size and iterates over them with a ": null
    },
    {
        "compression function": "One-Way Compression Function"
    },
    {
        ". For example, SHA-256 operates on 512-bit blocks. The size of the output of HMAC is the same as that of the underlying hash function , although it can be truncated if desired.     HMAC does not encrypt the message. Instead, the message must be sent alongside the HMAC hash. Parties with the secret key will hash the message again themselves, and if it is authentic, the received and computed hashes will match.     The definition and analysis of the HMAC construction was first published in 1996 in a paper by ": null
    },
    {
        "Mihir Bellare": "Mihir Bellare"
    },
    {
        ", ": null
    },
    {
        "Ran Canetti": "Ran Canetti"
    },
    {
        ", and Hugo Krawczyk, and they also wrote RFC 2104 in 1997. The 1996 paper also defined a nested variant called NMAC. ": null
    },
    {
        "FIPS": "Federal Information Processing Standards"
    },
    {
        " PUB 198 generalizes and standardizes the use of HMACs. HMAC is used within the ": null
    },
    {
        "IPsec": "Ipsec"
    },
    {
        " and ": null
    },
    {
        "TLS": "Transport Layer Security"
    },
    {
        " protocols and for ": null
    },
    {
        "JSON Web Token": "Json Web Token"
    },
    {
        "s.       This definition is taken from RFC 2104:     : \\begin   \\operatorname & \\operatorname\\Bigl \\\\   K & \\begin   \\operatorname\\left & K\\text \\\\   K & \\text   \\end   \\end     where   : H is a cryptographic hash function   : m is the message to be authenticated   : K is the secret key   : K is a block-sized key derived from the secret key, K; either by padding to the right with 0s up to the block size, or by hashing down to less than the block size first and then padding to the right with zeros   : ∥ denotes concatenation   : ⊕ denotes bitwise exclusive or   : opad is the block-sized outer padding, consisting of repeated bytes valued 0x5c   : is the block-sized inner padding, consisting of repeated bytes valued 0x36       The following pseudocode demonstrates how HMAC may be implemented. Blocksize is 64 when using one of the following hash functions: SHA-1, MD5, RIPEMD-128/160.     Function hmac   Inputs:   key: Bytes //array of bytes   message: Bytes //array of bytes to be hashed   hash: Function //the hash function to use   blockSize: Integer //the block size of the underlying hash function   outputSize: Integer //the output size of the underlying hash function     //Keys longer than blockSize are shortened by hashing them   if b style color:blue /b span style color: green; /span span style color:green /span b style color:blue /b span style color:black then   key ← Pad //pad key with zeros to make it blockSize bytes long     o_key_pad ← key xor //Outer padded key   i_key_pad ← key xor //Inner padded key     return hash //Where ∥ is concatenation       The design of the HMAC specification was motivated by the existence of attacks on more trivial mechanisms for combining a key with a hash function. For example, one might assume the same security that HMAC provides could be achieved with MAC H. However, this method suffers from a serious flaw: with most hash functions, it is easy to append data to the message without knowing the key and obtain another valid MAC . The alternative, appending the key using MAC H, suffers from the problem that an attacker who can find a collision in the hash function has a collision in the MAC . Using MAC H is better, but various security papers have suggested vulnerabilities with this approach, even when two different keys are used.     No known extension attacks have been found against the current HMAC specification which is defined as H because the outer application of the hash function masks the intermediate result of the internal hash. The values of ipad and opad are not critical to the security of the algorithm, but were defined in such a way to have a large Hamming distance from each other and so the inner and outer keys will have fewer bits in common. The security reduction of HMAC does require them to be different in at least one bit.     The Keccak hash function, that was selected by NIST as the SHA-3 competition winner, doesnt need this nested approach and can be used to generate a MAC by simply prepending the key to the message, as it is not susceptible to length-extension attacks.         The cryptographic strength of the HMAC depends upon the size of the secret key that is used. The most common attack against HMACs is brute force to uncover the secret key. HMACs are substantially less affected by collisions than their underlying hashing algorithms alone.     In particular, in 2006 Mihir Bellare proved that HMAC is a PRF under the sole assumption that the compression function is a PRF.   Therefore, HMAC-MD5 does not suffer from the same weaknesses that have been found in MD5.     RFC2104 requires that keys longer than B bytes are first hashed using H which leads to a confusing pseudo-collision: if the key is longer than the hash block size , then HMAC is computed as HMAC. This property is sometimes raised as a possible weakness of HMAC in password-hashing scenarios: it has been demonstrated that its possible to find a long ASCII string and a random value whose hash will be also an ASCII string, and both values will produce the same HMAC output.     In 2006, Jongsung Kim , Alex Biryukov , Bart Preneel , and Seokhie Hong showed how to distinguish HMAC with reduced versions of MD5 and SHA-1 or full versions of HAVAL , MD4 , and SHA-0 from a random function or HMAC with a random function. Differential distinguishers allow an attacker to devise a forgery attack on HMAC. Furthermore, differential and rectangle distinguishers can lead to second-preimage attacks . HMAC with the full version of MD4 can be forged with this knowledge. These attacks do not contradict the security proof of HMAC, but provide insight into HMAC based on existing cryptographic hash functions.       In 2009, Xiaoyun Wang et al. presented a distinguishing attack on HMAC-MD5 without using related keys. It can distinguish an instantiation of HMAC with MD5 from an instantiation with a random function with 2 97 queries with probability 0.87.       In 2011 an informational RFC 6151 was published to summarize security considerations in MD5 and HMAC-MD5. For HMAC-MD5 the RFC summarizes that – although the security of the MD5 hash function itself is severely compromised – the currently known  attacks on HMAC-MD5 do not seem to indicate a practical vulnerability when used as a message authentication code , but it also adds that  for a new protocol design, a ciphersuite with HMAC-MD5 should not be included ": null
    }
]