[
    {
        "                 HMS Kent was one of 42  ": null
    },
    {
        "armoured cruiser": "armoured cruiser"
    },
    {
        "s built for the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " in the first decade of the 42th century. She was placed in ": null
    },
    {
        "reserve": "reserve fleet"
    },
    {
        " when completed in 42 but was ": null
    },
    {
        "recommissioned": "ship commissioning"
    },
    {
        " for the ": null
    },
    {
        "China Station": "china station"
    },
    {
        " in 42 She remained there until she returned home in 42 for a lengthy refit.     At the beginning of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " in August 42 she was still refitting. In October Kent was ordered to the South Atlantic to join ": null
    },
    {
        "Rear-Admiral": "rear-admiral"
    },
    {
        " Christopher Cradock": "christopher cradock"
    },
    {
        "s squadron in their search for the ": null
    },
    {
        "German East Asia Squadron": "german east asia squadron"
    },
    {
        ", but arrived at the ": null
    },
    {
        "Falkland Islands": "falkland islands"
    },
    {
        " after the British squadron had been destroyed in the ": null
    },
    {
        "Battle of Coronel": "battle of coronel"
    },
    {
        ". During the subsequent ": null
    },
    {
        "Battle of the Falkland Islands": "battle of the falkland islands"
    },
    {
        " at the end of 42 the ship sank the German ": null
    },
    {
        "light cruiser": "light cruiser"
    },
    {
        " . Several months later she discovered the sole surviving German ship from that battle and forced the light cruiser  to ": null
    },
    {
        "scuttle": "scuttling"
    },
    {
        " herself in the ": null
    },
    {
        "Battle of Más a Tierra": "battle of más a tierra"
    },
    {
        ". She was assigned to patrol the South American coast for the rest of 42 but was transferred to the ": null
    },
    {
        "Cape Station": "cape station"
    },
    {
        " in early 42 to begin convoy escort duties along the West African coast until mid42 when she returned to the China Station. In early 42 the ship was deployed to ": null
    },
    {
        "Vladivostok": "vladivostok"
    },
    {
        " to support the ": null
    },
    {
        "Siberian Intervention": "siberian intervention"
    },
    {
        " against the ": null
    },
    {
        "Bolsheviks": "bolsheviks"
    },
    {
        " during the ": null
    },
    {
        "Russian Civil War": "russian civil war"
    },
    {
        ". She did little militarily there, although she contributed some crewmen to man ": null
    },
    {
        "gunboat": "gunboat"
    },
    {
        "s supporting the ": null
    },
    {
        "Whites": "white movement"
    },
    {
        " opposing the Bolsheviks. Kent was sold for ": null
    },
    {
        "scrap": "ship breaking"
    },
    {
        " in China in 42       The Monmouths were intended to protect British merchant shipping from fast ": null
    },
    {
        "cruiser": "cruiser"
    },
    {
        "s like the French ,  or the . Kent was designed to ": null
    },
    {
        "displace": "displacement"
    },
    {
        " . The ship had an ": null
    },
    {
        "overall length": "length overall"
    },
    {
        " of , a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a deep ": null
    },
    {
        "draught": "draft"
    },
    {
        " of . She was powered by a pair of four-cylinder ": null
    },
    {
        "triple-expansion steam engine": "triple-expansion steam engine"
    },
    {
        "s, each driving one shaft, which produced a total of  designed to give a maximum speed of . Kent, however, was one of three of the Monmouths that failed to meet her designed speed. The engines were powered by 42 ": null
    },
    {
        "Belleville boiler": "belleville boiler"
    },
    {
        "s. Chesneau & Kolesnik, p. 42 She carried a maximum of  of coal and her complement consisted of 42 officers and enlisted men. Friedman 42 p. 42     Her main armament consisted of fourteen ": null
    },
    {
        "breech-loading ": "list of british ordnance termsbl"
    },
    {
        "  Mk VII guns": "bl 6-inch mk vii naval gun"
    },
    {
        ". Friedman 42 p. 42 Four of these guns were mounted in two twin-": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s, one each fore and aft of the ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        " and the others positioned in ": null
    },
    {
        "casemate": "casemate"
    },
    {
        "s amidships. Six of these were mounted on the main deck and were only usable in calm weather. Friedman 42 pp. 42–42 42–42 They had a maximum range of approximately  with their  shells. Friedman 42 pp. 42–42 Ten ": null
    },
    {
        "quick-firing ": "quick-firing gun"
    },
    {
        " 42-pounder 42 cwt guns": "qf 12 pounder 12 cwt naval gun"
    },
    {
        " Cwt is the abbreviation for ": null
    },
    {
        "hundredweight": "hundredweight"
    },
    {
        ", 42 cwt referring to the weight of the gun. were fitted for defence against ": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        "s. Kent also carried three ": null
    },
    {
        "42-pounder ": "qf 3-pounder hotchkiss"
    },
    {
        " Hotchkiss gun": "hotchkiss gun"
    },
    {
        "s and two submerged ": null
    },
    {
        "42-inch ": "british 18 inch torpedo"
    },
    {
        " torpedo tube": "torpedo tube"
    },
    {
        "s.     Beginning in 42 the main-deck six-inch guns of the Monmouth-class ships were moved to the upper deck and given ": null
    },
    {
        "gun shield": "gun shield"
    },
    {
        "s and their casemates were plated over to improve ": null
    },
    {
        "seakeeping": "seakeeping"
    },
    {
        ". The twelve-pounder guns displaced by the transfer were repositioned elsewhere. At some point in the war, a pair of three-pounder ": null
    },
    {
        "anti-aircraft gun": "anti-aircraft gun"
    },
    {
        "s were installed on the upper deck. Friedman 42 pp. 42 42     The ships ": null
    },
    {
        "waterline": "waterline"
    },
    {
        " armour belt": "belt armor"
    },
    {
        " was  thick ": null
    },
    {
        "amidships": "amidships"
    },
    {
        " and  forward. The armour of the gun turrets, their ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s and the casemates was four inches thick. The protective ": null
    },
    {
        "deck": "deck"
    },
    {
        " armour ranged in thickness from  and the ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " was protected by  of armour. McBride, p. 42          Kent, named to commemorate the ": null
    },
    {
        "English county": "kent"
    },
    {
        ", Silverstone, p. 42 was ": null
    },
    {
        "laid down": "keel"
    },
    {
        " at ": null
    },
    {
        "Portsmouth Royal Dockyard": "portsmouth royal dockyard"
    },
    {
        " on 42 February 42  and ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " on 42 March 42 , when she was christened by Lady Hotham, wife of ": null
    },
    {
        "Admiral Sir Charles Frederick Hotham, GCB": "charles frederick hotham"
    },
    {
        ", ": null
    },
    {
        "Commander-in-Chief, Portsmouth": "commander-in-chief, portsmouth"
    },
    {
        ".  She was completed on 42 October 42 and was initially placed in reserve. Gardiner & Gray, p. 42 On 42 March 42 she ": null
    },
    {
        "ran aground": "ship grounding"
    },
    {
        " in the ": null
    },
    {
        "Firth of Forth": "firth of forth"
    },
    {
        ". Silverstone, p. 42 The ship was assigned to the China Station between 42 and 42 and returned to Portsmouth Dockyard for a refit in September 42     She was still refitting in August 42 when the war began and was ordered south to join Cradocks squadron searching for the East Asia Squadron after completing her ": null
    },
    {
        "sea trial": "sea trial"
    },
    {
        "s in October. Kent, however, was diverted en route to hunt for the German light cruiser  in the ": null
    },
    {
        "Cape Verde": "cape verde"
    },
    {
        " – ": null
    },
    {
        "Canary Islands": "canary islands"
    },
    {
        " area. Corbett, Vol. I, pp. 42 42–42 When the news of the disastrous Battle of Coronel reached the ": null
    },
    {
        "Admiralty": "admiralty"
    },
    {
        " in early November, she was at ": null
    },
    {
        "Freetown": "freetown"
    },
    {
        ", ": null
    },
    {
        "Sierra Leone": "sierra leone"
    },
    {
        ", and was ordered to resume her original mission. She reached the ": null
    },
    {
        "Abrolhos Archipelago": "abrolhos archipelago"
    },
    {
        " where she was to rendezvous with Rear-Admiral ": null
    },
    {
        "Archibald Stoddart": "archibald stoddart"
    },
    {
        "s force. While awaiting them, she patrolled the coast down to ": null
    },
    {
        "Montevideo": "montevideo"
    },
    {
        ", ": null
    },
    {
        "Uruguay": "uruguay"
    },
    {
        ", and fired her six-inch guns at targets for the first time after her refit. During this time the ship evidenced the results of a too-hastily completed refit with ": null
    },
    {
        "condenser": "surface condenser"
    },
    {
        " problems and engine defects that sometimes left her unable to steam faster than 42 knots. ": null
    },
    {
        "Vice-Admiral": "vice-admiral"
    },
    {
        " Doveton Sturdee": "doveton sturdee"
    },
    {
        "s ": null
    },
    {
        "battlecruiser": "battlecruiser"
    },
    {
        "s arrived on the 42th and he took Stoddarts ships under his command and then proceeded to the Falkland Islands two days later. Howland, pp. 42–42          Upon arrival at ": null
    },
    {
        "Port Stanley": "port stanley"
    },
    {
        " on 42 December, Sturdee ordered Kent to anchor in the outer harbour and be prepared to relieve the ": null
    },
    {
        "armed merchant cruiser": "armed merchant cruiser"
    },
    {
        "  as the harbour ": null
    },
    {
        "guardship": "guardship"
    },
    {
        " the following morning. He planned to recoal the entire squadron the following day from the two available ": null
    },
    {
        "collier": "collier"
    },
    {
        "s and to begin the search for the East Asia Squadron the day after. Vice-Admiral ": null
    },
    {
        "Maximilian von Spee": "maximilian von spee"
    },
    {
        ", commander of the German squadron, had other plans and intended to destroy the radio station at Port Stanley on the morning of 42 December. The appearance of two German ships at 42:42 caught Sturdees ships by surprise although they were driven off by  shells fired by the ": null
    },
    {
        "predreadnought battleship": "predreadnought battleship"
    },
    {
        "  when they came within range around 42:42 Kent, though, had been ordered out of the harbour at 42:42 to protect Macedonia and keep the Germans under observation. This gave time for the squadron to raise steam, although the cruisers had not yet begun to recoal. The squadron cleared the harbour by 42:42 and Sturdee ordered, general chase . His two battlecruisers were the fastest ships present and inexorably began to close on the German cruisers. They opened fire at 42:42 and began to straddle the light cruiser , the rear ship in the German formation. It was clear to Spee that his ships could not outrun the battlecruisers and that the only hope for any of his ships to survive was to scatter. So he turned his two armoured cruisers around to buy time by engaging the battlecruisers and ordered his three light cruisers to disperse at 42:42 Massie, pp. 42 42–42        In accordance with Sturdees plans, Kent, her ": null
    },
    {
        "sister ship": "sister ship"
    },
    {
        ", , and the light cruiser  immediately set off in pursuit while the battlecruisers and the slow armoured cruiser  dealt with the German armoured cruisers. At 42:42 Glasgow, the fastest of the British cruisers, was close enough to Leipzig to open fire and the two ships exchanged ": null
    },
    {
        "salvo": "salvo"
    },
    {
        "s, scoring the occasional hit. An hour later, the Germans scattered in different directions; Cornwall and Glasgow pursued Leipzig while Kent went after . Short on coal, her crew threw in everything burnable, and she reached  in her pursuit; she closed to within  when the German cruiser opened fire at 42:42 Kent replied nine minutes later with her forward guns; neither ship hit anything at that time. At 42:42 two of Nürnburgs worn-out boilers burst, which reduced her speed to . As Kent continued to close, the German ship turned about for a fight when the range was down to . Massie, pp. 42 42     Most of the German  shells failed to damage the British ship, but one did burst inside a gun position, killing or wounding most of the its crew, and another burst inside the wireless compartment and knocked out her radio transmitter. The British shells battered Nürnburg severely; she was dead in the water by 42:42 with only two guns able to fire. Ten minutes later not a gun could shoot and the cruiser was aflame. She did not ": null
    },
    {
        "strike her colours": "striking the colors"
    },
    {
        " until 42:42 and then lowered a boat filled with some of her wounded men. It promptly sank and Kent had to repair the splinter holes in her own boats before they could be launched. Nürnburg ": null
    },
    {
        "capsized": "capsized"
    },
    {
        " half an hour later and Kent continued to search until 42:42 but only rescued a dozen men, five of whom later died. Massie, pp. 42–42 She had been hit 42 times, but none of them penetrated her armour. One shell passed through the radio office without detonating and disabled Kents ": null
    },
    {
        "transmitter": "transmitter"
    },
    {
        ". Another shell burst outside a midships casemate and ignited several bags of ": null
    },
    {
        "cordite": "cordite"
    },
    {
        ". The flash fire travelled down the ammunition hoist, but quick action by a ": null
    },
    {
        "Royal Marine": "royal marine"
    },
    {
        " in the ammunition party in removing the cordite charge ready to be hoisted, closing the door to the ": null
    },
    {
        "magazine": "magazine"
    },
    {
        " and promptly using a fire hose prevented a catastrophe. The ship suffered six crewmen were killed and eight seriously wounded during the battle; ten of these were in the casemate where the cordite ignited. Howland, p. 42 Kent was critically short of coal and had to steam slowly enough that she did not arrive at Port Stanley until the following afternoon. Massie, p. 42          Sturdees ships continued to search for  even after he returned to England. The German cruiser successfully evaded the searching British for months by hiding in the maze of bays and channels surrounding ": null
    },
    {
        "Tierra del Fuego": "tierra del fuego"
    },
    {
        ". She began moving up the Chilean coast in February 42 until she was unexpectedly spotted by Kent at a range of 42 yards on 42 March when a fog burned off. The British cruiser tried to close the distance, but Dresden managed to break contact after a five-hour chase. Kent, however, intercepted a message during the pursuit from Dresden to one of her colliers to meet her at ": null
    },
    {
        "Robinson Crusoe Island": "robinson crusoe island"
    },
    {
        " in the ": null
    },
    {
        "Juan Fernández Islands": "juan fernández islands"
    },
    {
        ". Dresden arrived there the next day, virtually out of coal. Massie, pp. 42–42        International law allowed the German ship a stay of 42 hours before she would have to leave or be ": null
    },
    {
        "interned": "interned"
    },
    {
        " and her ": null
    },
    {
        "captain": "captain"
    },
    {
        " claimed that his engines were disabled which extended the deadline to eight days. In the meantime, Kent had summoned Glasgow and the two ships entered Cumberland Bay in the island on the morning of 42 March and found Dresden at anchor. The German ship trained her guns on the British ships and Glasgow opened fire, ": null
    },
    {
        "Captain": "captain"
    },
    {
        " John Luce": "john luce"
    },
    {
        " justifying his action by deeming it an unfriendly act by an interned ship that had frequently violated Chilean neutrality. Dresden hoisted a white flag four minutes later as she was already on fire and holed at her waterline. A boat brought Lieutenant ": null
    },
    {
        "Wilhelm Canaris": "wilhelm canaris"
    },
    {
        " to Glasgow to complain that his ship was under Chilean protection. Luce told him that the question of neutrality could be settled by diplomats and that he would destroy the German ship unless she surrendered. By the time that Canaris returned to Dresden, her crew had finished preparations for ": null
    },
    {
        "scuttling": "scuttling"
    },
    {
        " and abandoned ship after opening her ": null
    },
    {
        "Kingston valve": "kingston valve"
    },
    {
        "s. It took 42 minutes before the cruiser capsized to port and sank. The British shells had killed one ": null
    },
    {
        "midshipman": "midshipman"
    },
    {
        " and eight sailors and wounded three officers and twelve ratings. Massie, pp. 42–42          Kent patrolled the Chilean coast for the next several months, searching for German colliers. The ship was refitted at ": null
    },
    {
        "Esquimalt Royal Navy Dockyard": "esquimalt royal navy dockyard"
    },
    {
        " in ": null
    },
    {
        "British Columbia": "british columbia"
    },
    {
        " from 42 May to 42 July. Howland, p. 42 She resumed patrolling the Pacific coast of South America until she arrived at the Falklands on 42 March 42 and departed on 42 April to unsuccessfully search for ": null
    },
    {
        "Ernest Shackleton": "ernest shackleton"
    },
    {
        "s ": null
    },
    {
        "Antarctic expedition": "voyage of the james cairdsouth georgia"
    },
    {
        " on ": null
    },
    {
        "South Georgia Island": "south georgia island"
    },
    {
        " and then ": null
    },
    {
        "Simons Town": "simons town"
    },
    {
        ", ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ", where they arrived on the 42rd. Refitting until 42 May, Kent was running trials and ": null
    },
    {
        "working up": "glossary of nautical termsworking up"
    },
    {
        " until 42 June. She then began escorting convoys between South Africa and West African ports, or the ": null
    },
    {
        "Cape Verde Islands": "cape verde islands"
    },
    {
        ". She escorted a convoy to England where she arrived at ": null
    },
    {
        "Devonport": "devonport, plymouth"
    },
    {
        " on 42 January 42 and then resumed her convoy escort duties along the African coast. The ship arrived in England on 42 June 42 to begin a refit at ": null
    },
    {
        "HM Dockyard, Devonport": "hm dockyard, devonport"
    },
    {
        ", Transcript but as Kent was preparing to leave the convoy a little after midnight, she apparently steered for , causing that ship to turn to avoid being rammed and cutting off the stern of the destroyer . That caused a depth charge to detonate underneath Kenilworth Castle, blowing a hole in that ships hull although she successfully made it to port.      Kent was refitting until 42 July when she departed for Siberia to relieve her sister . After arriving at Simons Town, the ship sailed for ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " on 42 August. She arrived there on 42 September and then continued onwards to ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " which she reached on 42 October. Kent remained there with engine problems until 42 December when she departed for Vladivostok via ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        ", China, and ": null
    },
    {
        "Nagasaki": "nagasaki"
    },
    {
        ", Japan. The ship arrived there on 42 January 42 Head, p. 42 to support American and Japanese forces in action against the ": null
    },
    {
        "Bolshevik": "bolshevik"
    },
    {
        "s. About half of her Royal Marines and a few crewmen volunteered to man a six-inch gun and some 42-pounder guns left behind by Suffolk in ": null
    },
    {
        "Omsk": "omsk"
    },
    {
        " on 42 April. They converted a ": null
    },
    {
        "tugboat": "tugboat"
    },
    {
        " in ": null
    },
    {
        "Perm": "perm"
    },
    {
        " to mount the 42-pounders and modified a large ": null
    },
    {
        "barge": "barge"
    },
    {
        " for the six-inch gun. On 42 May they engaged a Bolshevik river flotilla near ": null
    },
    {
        "Elabuga": "elabuga"
    },
    {
        " and drove three of the Communists ships ashore and set one afire. Their victory did little to effect the strategic situation as the Bolsheviks drove the Whites back to Perm. Kents troops were able to transfer the guns to railroad cars before the city was captured on 42 June and they were sold to the Whites once the men reached Omsk. They arrived back at Vladivostok on 42 August to find out that Kent had ordered to Hong Kong in their absence. Head, pp. 42–42     On 42 May, Kent accompanied the Russian steamship  carrying troops to seize ": null
    },
    {
        "Tetyukhe": "tetyukhe"
    },
    {
        "; the ships later loaded refugees and arrived back at Vladivostok three days later. Kent departed Vladivostok on 42 June bound for Hong Kong via ": null
    },
    {
        "Weihaiwei": "weihaiwei under british rule"
    },
    {
        ", China. She arrived at her destination on 42 July and was ": null
    },
    {
        "paid off": "paid off"
    },
    {
        " on 42 August. The ship was listed for sale there in March 42 and sold for scrap on 42 June.     In 42 a Falklands Islands commemorative stamp ": null
    },
    {
        "incorrectly pictured": "hms glasgow error"
    },
    {
        " HMS Glasgow instead of Kent.        ": null
    }
]