[
    {
        "            In ": null
    },
    {
        "Abrahamic religions": "abrahamic religions"
    },
    {
        ", the Holy Spirit is an aspect or agent of ": null
    },
    {
        "God": "god in abrahamic religions"
    },
    {
        ", by means of which people become His messenger or servant. The term is also used to describe aspects of other religions and belief structures.       The word  spirit   appears either alone or with other words, in the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        "  and the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        ". Combinations include expressions such as the Holy Spirit , Spirit of ": null
    },
    {
        "God": "god in abrahamic religions"
    },
    {
        " , and in Christianity, Spirit of ": null
    },
    {
        "Christ": "christ"
    },
    {
        " .     The word spirit is rendered as רוּחַ  in Hebrew-language parts of the Old Testament. In ": null
    },
    {
        "its Aramaic parts": "biblical aramaic"
    },
    {
        ", the term is rûacḥ.  The Greek translation of the Old Testament, the ": null
    },
    {
        "Septuagint": "septuagint"
    },
    {
        ", translates the word as πνεῦμα .  This is the same word that is used throughout the New Testament, written originally in Greek.     The English term spirit comes from its Latin origin, spiritus, which is how the ": null
    },
    {
        "Vulgate": "vulgate"
    },
    {
        " translates both the Old and New Testament concept.  The alternative term, Holy Ghost , comes from ": null
    },
    {
        "Old English": "old english"
    },
    {
        " translations of spiritus.        The Hebrew Bible contains the term ": null
    },
    {
        "spirit of God": "holy spirit in judaism"
    },
    {
        "  in the sense of the might of a unitary ": null
    },
    {
        "God": "god in judaism"
    },
    {
        ". This meaning is different from the ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " concept of ": null
    },
    {
        "Holy Spirit": "holy spirit in christianity"
    },
    {
        " as one personality of ": null
    },
    {
        "God": "god in christianity"
    },
    {
        " in the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        ".      The Christian concept tends to emphasize the ": null
    },
    {
        "moral": "morality"
    },
    {
        " aspect of the Holy Spirit more than ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        ", evident in the epithet  Spirit that appeared in Jewish religious writings only relatively late but was a common expression in the Christian New Testament.      According to ": null
    },
    {
        "theologian": "theology"
    },
    {
        " Rudolf Bultmann": "rudolf bultmann"
    },
    {
        ", there are two ways to think about the Holy Spirit: animistic and dynamistic . In animistic thinking, it is an independent agent, a personal power which like a demon can fall upon a man and take possession of him, enabling him or compelling him to perform manifestations of power while in dynamistic thought it appears as an impersonal force which fills a man like a fluid . Both kinds of thought appear in Jewish and Christian scripture, but animistic is more typical of the Old Testament whereas dynamistic is more common in the New Testament. The distinction coincides with the Holy Spirit as either a temporary or permanent gift. In the Old Testament and Jewish thought, it is primarily temporary with a specific situation or task in mind, whereas in the Christian concept the gift resides in man permanently.     On the surface, the Holy Spirit appears to have an equivalent in non-Abrahamic ": null
    },
    {
        "Hellenistic mystery religions": "greco-roman mysteries"
    },
    {
        ". These religions included a distinction between the ": null
    },
    {
        "spirit": "spirit"
    },
    {
        " and ": null
    },
    {
        "psyche": "soul in the bible"
    },
    {
        ", which is also seen in the ": null
    },
    {
        "Pauline epistles": "pauline epistles"
    },
    {
        ". According to proponents of the ": null
    },
    {
        "History of religions school": "history of religions school"
    },
    {
        ", the Christian concept of the Holy Spirit cannot be explained from Jewish ideas alone without reference to the Hellenistic religions. However, according to theologian Erik Konsmo, the views are so dissimilar that the only legitimate connection one can make is with the Greek term πνεῦμα  pneuma , Spirit itself .     Another link with ancient Greek thought is the ": null
    },
    {
        "Stoic": "stoicism"
    },
    {
        " idea of the spirit as  anima mundi —or world soul—that unites all people. Some believe that this can be seen in Pauls formulation of the concept of the Holy Spirit that unites ": null
    },
    {
        "Christians": "christians"
    },
    {
        " in ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " Christ": "christ"
    },
    {
        " and love for one another, but Konsmo again thinks that this position is difficult to maintain. In his Introduction to the 1964 book  Meditations , the Anglican priest Maxwell Staniforth wrote:     Another Stoic concept which offered inspiration to the Church was that of divine Spirit. Cleanthes, wishing to give more explicit meaning to Zenos creative fire, had been the first to hit upon the term pneuma, or spirit, to describe it. Like fire, this intelligent spirit was imagined as a tenuous substance akin to a current of air or breath, but essentially possessing the quality of warmth; it was immanent in the universe as God, and in man as the soul and life-giving principle. Clearly it is not a long step from this to the Holy Spirit of Christian theology, the Lord and Giver of life, visibly manifested as tongues of fire at Pentecost and ever since associated – in the Christian as in the Stoic mind – with the ideas of vital fire and beneficent warmth.             The Hebrew language phrase ruach ha-kodesh  is a term used in the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        " and Jewish writings to refer to the spirit of ": null
    },
    {
        "YHWH": "yhwh"
    },
    {
        " .  The Hebrew terms ruacḥ qodshəka, thy holy spirit , and ruacḥ qodshō, his holy spirit also occur .     The Holy Spirit in Judaism generally refers to the divine aspect of prophecy and wisdom. It also refers to the divine force, quality, and influence of the Most High God, over the universe or over his creatures, in given contexts. Alan Unterman and Rivka Horowitz, Ruah ha-Kodesh, Encyclopaedia Judaica .          For the large majority of ": null
    },
    {
        "Christians": "christians"
    },
    {
        ", the Holy Spirit  is the third  member of the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        ": The Triune God manifested as ": null
    },
    {
        "Father": "god the father"
    },
    {
        ", ": null
    },
    {
        "Son": "god the son"
    },
    {
        ", and Holy Spirit; each Person being God.   Grudem, Wayne A. . Systematic Theology: An Introduction to Biblical Doctrine. Leicester, England: Inter-Varsity Press; Grand Rapids, MI: ": null
    },
    {
        "Zondervan": "zondervan"
    },
    {
        ". p. 226. Two symbols from the New Testament canon are associated with the Holy Spirit in Christian ": null
    },
    {
        "iconography": "iconography"
    },
    {
        ": a winged dove, and tongues of fire. Luke 3:22, NIV Acts 2:3, NIV Each depiction of the Holy Spirit arose from different historical accounts in the ": null
    },
    {
        "Gospel": "gospel"
    },
    {
        " narratives; the first being at the ": null
    },
    {
        "baptism of Jesus": "baptism of jesus"
    },
    {
        " in the ": null
    },
    {
        "Jordan River": "jordan river"
    },
    {
        " where the Holy Spirit was said to descend in the form of a dove as the voice of God the Father spoke as described in ": null
    },
    {
        "Matthew": "gospel of matthew"
    },
    {
        ", ": null
    },
    {
        "Mark": "gospel of mark"
    },
    {
        ", and ": null
    },
    {
        "Luke": "gospel of luke"
    },
    {
        "; the second being from the day of ": null
    },
    {
        "Pentecost": "pentecost"
    },
    {
        ", fifty days after ": null
    },
    {
        "Pascha": "easter"
    },
    {
        " where the descent of the Holy Spirit came upon the ": null
    },
    {
        "Apostles": "apostle"
    },
    {
        " and other followers of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        ", as tongues of fire as described in the ": null
    },
    {
        "Acts of the Apostles": "acts of the apostles"
    },
    {
        " .    Called the unveiled ": null
    },
    {
        "epiphany of God": "theophany"
    },
    {
        " ,  the Holy Spirit is the One who empowers the followers of Jesus with spiritual gifts I Corinthians 13:4-11, NIV  and power ": null
    },
    {
        "Acts 1:8": "acts 1:8"
    },
    {
        " Johnson, Bill. When Heaven Invades Earth ": null
    },
    {
        "as a dove": "doves as symbols"
    },
    {
        ", by ": null
    },
    {
        "Gian Lorenzo Bernini": "gian lorenzo bernini"
    },
    {
        ", in the ": null
    },
    {
        "apse": "apse"
    },
    {
        " of ": null
    },
    {
        "Saint Peters Basilica": "saint peters basilica"
    },
    {
        " God the Holy Spirit": "holy spirit"
    },
    {
        "      The Holy Spirit  is mentioned four times in the ": null
    },
    {
        "Quran": "quran"
    },
    {
        ",  searchtruth.com. where it acts as an agent of divine action or communication. While there are similarities to the Holy Spirit mentioned in Christian and Jewish sources, it is unclear if these four references refer to the same Holy Spirit. The ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " interpretation of the Holy Spirit is generally consistent with other interpretations based upon the Old and the New Testaments. On the basis of narrations in certain ": null
    },
    {
        "Hadith": "hadith"
    },
    {
        " some Muslims identify it with the angel ": null
    },
    {
        "Gabriel": "gabriel"
    },
    {
        " .  The Spirit  is described, among other things, as the creative spirit from God by which God enlivened ": null
    },
    {
        "Adam": "adam in islam"
    },
    {
        ", and which inspired in various ways Gods messengers and prophets, including ": null
    },
    {
        "Jesus": "jesus in islam"
    },
    {
        " and ": null
    },
    {
        "Abraham": "abraham in islam"
    },
    {
        ". The belief in a Holy Trinity , according to the Quran, is forbidden and deemed to be ": null
    },
    {
        "blasphemy": "blasphemy"
    },
    {
        ". The same prohibition applies to any idea of the ": null
    },
    {
        "duality": "dualistic cosmology"
    },
    {
        " of ": null
    },
    {
        "God": "god in islam"
    },
    {
        " . Griffith, Sidney H. Holy Spirit, ": null
    },
    {
        "Encyclopaedia of the Quran": "encyclopaedia of the quran"
    },
    {
        ". ": null
    },
    {
        "Thomas Patrick Hughes": "thomas patrick hughes"
    },
    {
        ", A Dictionary of Islam, p. 605.            The ": null
    },
    {
        "Baháí Faith": "baháí faith"
    },
    {
        " has the concept of the Most Great Spirit, seen as the bounty of God.  It is usually used to describe the descent of the Spirit of God upon the ": null
    },
    {
        "messengers/prophets of God": "manifestations of god"
    },
    {
        " who include, among others, Jesus, ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        " and ": null
    },
    {
        "Baháulláh": "baháulláh"
    },
    {
        ".      In Baháí belief, the Holy Spirit is the ": null
    },
    {
        "conduit": "conduit"
    },
    {
        " through which the wisdom of God becomes directly associated with his messenger, and it has been described variously in different religions such as the ": null
    },
    {
        "burning bush": "burning bush"
    },
    {
        " to Moses, the ": null
    },
    {
        "sacred fire": "atar"
    },
    {
        " to Zoroaster, ": null
    },
    {
        "the dove": "baptism of jesus"
    },
    {
        " to Jesus, the angel Gabriel to Muhammad, and the ": null
    },
    {
        "Maid of Heaven": "maid of heaven"
    },
    {
        " to Baháulláh.  The Baháí view rejects the idea that the Holy Spirit is a partner to God in the Godhead, but rather is the pure essence of Gods attributes.          Other religions reference a spirit that has a name resembling the Holy Spirit found in the Christian and Jewish faiths, but similar to Islam, this is a different spirit with a different purpose that is unique to those religions, as is seen below:         The ": null
    },
    {
        "Hinduism": "hinduism"
    },
    {
        " concept of ": null
    },
    {
        "Advaita": "advaita"
    },
    {
        " is linked to Trinity and has been briefly explained by ": null
    },
    {
        "Raimon Panikkar": "raimon panikkar"
    },
    {
        ", Professor of Comparative Religion and History of Religions, Department of Religious Studies of the University of California. He states that the Holy Spirit, as one of the Three Persons of the Trinity of father, Logos and Holy Spirit , is a bridge builder between Christianity and Hinduism. He explains that “The meeting of spiritualistic can take place in the Spirit. No new system has primarily to come of this encounter, but a new and yet old spirit must emerges.  Atman is ": null
    },
    {
        "Vedic": "vedas"
    },
    {
        " terminology elaborated in ": null
    },
    {
        "Hindu scriptures": "hindu scriptures"
    },
    {
        " such as ": null
    },
    {
        "Upanishads": "upanishads"
    },
    {
        " and ": null
    },
    {
        "Vedanta": "vedanta"
    },
    {
        " signifies the ": null
    },
    {
        "Ultimate Reality": "ultimate reality"
    },
    {
        " and ": null
    },
    {
        "Absolute": "absolute"
    },
    {
        ".        In ": null
    },
    {
        "Zoroastrianism": "zoroastrianism"
    },
    {
        ", the Holy Spirit, also known as ": null
    },
    {
        "Spenta Mainyu": "amesha spentadoctrine"
    },
    {
        ", is a ": null
    },
    {
        "hypostasis": "hypostasis"
    },
    {
        " of ": null
    },
    {
        "Ahura Mazda": "ahura mazda"
    },
    {
        ", the supreme Creator God of Zoroastrianism; the Holy Spirit is seen as the source of all goodness in the universe, the spark of all life within humanity, and is the ultimate guide for humanity to righteousness and communion with God. The Holy Spirit is put in direct opposition to its eternal dual counterpart, ": null
    },
    {
        "Angra Mainyu": "angra mainyu"
    },
    {
        ", who is the source of all wickedness and who leads humanity astray.  ": null
    }
]