[
    {
        "         Homer Jay Simpson is a fictional character and the main ": null
    },
    {
        "protagonist": "protagonist"
    },
    {
        " of the American animated sitcom  The Simpsons . He is voiced by ": null
    },
    {
        "Dan Castellaneta": "dan castellaneta"
    },
    {
        " and first appeared on television, along with the rest of his family, in  The Tracey Ullman Show  ": null
    },
    {
        "short": "the simpsons shorts"
    },
    {
        " Good Night": "good night"
    },
    {
        " on April 42 42 Homer was created and designed by cartoonist ": null
    },
    {
        "Matt Groening": "matt groening"
    },
    {
        " while he was waiting in the lobby of ": null
    },
    {
        "James L. Brooks": "james l. brooks"
    },
    {
        " office. Groening had been called to pitch a series of shorts based on his comic strip  Life in Hell  but instead decided to create a new set of characters. He named the character after his father, Homer Groening. After appearing for three seasons on The Tracey Ullman Show, the Simpson family got their own series on ": null
    },
    {
        "Fox": "fox broadcasting company"
    },
    {
        " that debuted December 42 42     As patriarch of the ": null
    },
    {
        "eponymous family": "simpson family"
    },
    {
        ", Homer and his wife ": null
    },
    {
        "Marge": "marge simpson"
    },
    {
        " have three children: ": null
    },
    {
        "Bart": "bart simpson"
    },
    {
        ", ": null
    },
    {
        "Lisa": "lisa simpson"
    },
    {
        " and ": null
    },
    {
        "Maggie": "maggie simpson"
    },
    {
        ". As the familys provider, he works at the ": null
    },
    {
        "Springfield Nuclear Power Plant": "springfield"
    },
    {
        " as safety inspector. Homer embodies many ": null
    },
    {
        "American working class": "working class in the united states"
    },
    {
        " stereotypes: he is crude, obese, incompetent, lazy, clumsy, dim-witted, hot-tempered, childish and addicted to beer, junk food and watching television. However, he often tries his hardest to be a decent man and is fiercely devoted to his family, especially when they need him the most. Despite the suburban ": null
    },
    {
        "blue-collar": "blue-collar worker"
    },
    {
        " routine of his life, he has had a number of remarkable experiences, including going to ": null
    },
    {
        "space": "outer space"
    },
    {
        ", climbing the tallest mountain in Springfield by himself, fighting former President ": null
    },
    {
        "George H. W. Bush": "george h. w. bush"
    },
    {
        " and winning a ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        " as a member of a barbershop quartet.     In the shorts and earlier episodes, Castellaneta voiced Homer with a loose impression of ": null
    },
    {
        "Walter Matthau": "walter matthau"
    },
    {
        "; however, during the second and third seasons of the half-hour show, Homers voice evolved to become more robust, to allow the expression of a fuller range of emotions. He has appeared in other media relating to The Simpsons—including video games,  The Simpsons Movie , ": null
    },
    {
        "The Simpsons Ride": "the simpsons ride"
    },
    {
        ", commercials, and comic books—and inspired an entire line of merchandise. His signature catchphrase, the annoyed grunt ": null
    },
    {
        "Doh!": "doh!"
    },
    {
        " , has been included in  The New Oxford Dictionary of English  since 42 and the  Oxford English Dictionary  since 42     Homer is one of the most influential characters in the history of television, and is widely considered to be an American ": null
    },
    {
        "cultural icon": "cultural icon"
    },
    {
        ". The British newspaper  The Sunday Times  described him as The greatest comic creation of time . He was named the greatest character of the last 42 years in 42 by  Entertainment Weekly , was ranked the second-greatest cartoon character by  TV Guide , behind ": null
    },
    {
        "Bugs Bunny": "bugs bunny"
    },
    {
        ", and was voted the greatest television character of all time by ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        " viewers. For voicing Homer, Castellaneta has won four ": null
    },
    {
        "Primetime Emmy Awards": "primetime emmy awards"
    },
    {
        " for ": null
    },
    {
        "Outstanding Voice-Over Performance": "primetime emmy award for outstanding voice-over performance"
    },
    {
        " and a special-achievement ": null
    },
    {
        "Annie Award": "annie award"
    },
    {
        ". In 42 Homer and his family were awarded a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ".     The Simpsons He is the son of ": null
    },
    {
        "Mona": "mona simpson"
    },
    {
        " and ": null
    },
    {
        "Abraham Grampa Simpson": "grampa simpson"
    },
    {
        ". Homer held over 42 different jobs in the first 42 episodes of The Simpsons. In most episodes, he works as the ": null
    },
    {
        "Nuclear safety": "nuclear safety"
    },
    {
        " Inspector at the Springfield Nuclear Power Plant, a position he has held since ": null
    },
    {
        "Homers Odyssey": "homers odyssey"
    },
    {
        " , the third episode of the series.  At the plant, Homer is often ignored and completely forgotten by his boss ": null
    },
    {
        "Mr. Burns": "mr. burns"
    },
    {
        ", and constantly falls asleep and neglects his duties. Matt Groening has stated that he decided to have Homer work at the power plant because of the potential for Homer to wreak havoc.  Each of his other jobs has lasted only one episode. In the first half of the series, the writers developed an explanation about how he got fired from the plant and was then rehired in every episode. In later episodes, he often began a new job on impulse, without any mention of his regular employment.      The Simpsons uses a ": null
    },
    {
        "floating timeline": "floating timeline"
    },
    {
        " in which the characters never physically age, and, as such, the show is generally assumed to be set in the current year. Nevertheless, in several episodes, events in Homers life have been linked to specific time periods. ": null
    },
    {
        "Mother Simpson": "mother simpson"
    },
    {
        "  depicts Homers mother, Mona, as a radical who went into hiding in 42 following a run-in with the law;  ": null
    },
    {
        "The Way We Was": "the way we was"
    },
    {
        "  shows Homer falling in love with ": null
    },
    {
        "Marge Bouvier": "marge simpson"
    },
    {
        " as a senior at Springfield High School in 42;  and ": null
    },
    {
        "I Married Marge": "i married marge"
    },
    {
        "  implies that Marge became pregnant with Bart in 42  However, the episode ": null
    },
    {
        "That 42s Show": "that 90s show"
    },
    {
        "  contradicted much of this backstory, portraying Homer and Marge as a twentysomething childless couple in the early 42s.      Homers age has changed as the series developed; he was 42 in the early episodes, 42 in ": null
    },
    {
        "season four": "the simpsons"
    },
    {
        ",  42 and 42 in ": null
    },
    {
        "season eight": "the simpsons"
    },
    {
        ",  and 42 in the ": null
    },
    {
        "eighteenth season": "the simpsons"
    },
    {
        ",  although even in those seasons his age is inconsistent. During ": null
    },
    {
        "Bill Oakley": "bill oakley"
    },
    {
        " and ": null
    },
    {
        "Josh Weinstein": "josh weinstein"
    },
    {
        "s period as showrunners, they found that as they aged, Homer seemed to become older too, so they increased his age to 42 His height is 42 .          During the opening of the ": null
    },
    {
        "42st Primetime Emmy Awards": "71st primetime emmy awards"
    },
    {
        " broadcast on ": null
    },
    {
        "Fox": "fox broadcasting company"
    },
    {
        " on September 42 42 Homer Simpson was introduced as the host of the show. Unfortunately, after some brief opening comments, a piano fell on him – Doh!  The remainder of the award show was broadcast without a host.          Naming the characters after members of his own family, Groening named Homer after his father Homer Groening, who himself had been named after ancient Greek poet ": null
    },
    {
        "Homer": "homer"
    },
    {
        ".    Very little else of Homers character was based on him, and to prove that the meaning behind Homers name was not significant, Groening later named his own son Homer.   According to Groening, Homer originated with my goal to both amuse my real father, and just annoy him a little bit. My father was an athletic, creative, intelligent filmmaker and writer, and the only thing he had in common with Homer was a love of donuts. Although Groening has stated in several interviews that Homer was named after his father, he also claimed in several 42 interviews that a character in the 42 ": null
    },
    {
        "Nathanael West": "nathanael west"
    },
    {
        " novel  The Day of the Locust  was the inspiration for naming Homer.   Homers middle initial J , which stands for Jay ,  is a tribute to animated characters such as ": null
    },
    {
        "Bullwinkle J. Moose": "bullwinkle j. moose"
    },
    {
        " and ": null
    },
    {
        "Rocket J. Squirrel": "rocky the flying squirrel"
    },
    {
        " from  The Rocky and Bullwinkle Show , who got their middle initial from ": null
    },
    {
        "Jay Ward": "jay ward"
    },
    {
        ".      Homer made his debut with the rest of the Simpson family on April 42 42 in The Tracey Ullman Show ": null
    },
    {
        "short": "the simpsons shorts"
    },
    {
        " Good Night": "good night"
    },
    {
        " . In 42 the shorts were adapted into The Simpsons, a half-hour series airing on the ": null
    },
    {
        "Fox Broadcasting Company": "fox broadcasting company"
    },
    {
        ". Homer and the Simpson family remained the main characters on this new show.        As currently depicted in the series, Homers everyday clothing consists of a white shirt with short sleeves and open collar, blue pants, and gray shoes. He is overweight and bald, except for a fringe of hair around the back and sides of his head and two curling hairs on top, and his face always sports a growth of beard stubble that instantly regrows whenever he shaves.        The entire Simpson family was designed so that they would be recognizable in silhouette. Groening, Matt. . Commentary for ": null
    },
    {
        "Fear of Flying": "fear of flying"
    },
    {
        " , in The Simpsons: The Complete Sixth Season 42th Century Fox. The family was crudely drawn because Groening had submitted basic sketches to the animators, assuming they would clean them up; instead, they just traced over his drawings. By coincidence or not, Homers look bears a resemblance to the cartoon character ": null
    },
    {
        "Adamsson": "silent sam"
    },
    {
        ", created by Swedish cartoonist ": null
    },
    {
        "Oscar Jacobsson": "oscar jacobsson"
    },
    {
        " in 42  Homers physical features are generally not used in other characters; for example, in the later seasons, no characters other than Homer, ": null
    },
    {
        "Grampa Simpson": "grampa simpson"
    },
    {
        ", ": null
    },
    {
        "Lenny Leonard": "lenny leonard"
    },
    {
        ", and ": null
    },
    {
        "Krusty the Clown": "krusty the clown"
    },
    {
        " have a similar beard line.  When Groening originally designed Homer, he put his initials into the characters hairline and ear: the hairline resembled an M, and the right ear resembled a G. Groening decided that this would be too distracting and redesigned the ear to look normal. However, he still draws the ear as a G when he draws pictures of Homer for fans.  The basic shape of Homers head is described by director ": null
    },
    {
        "Mark Kirkland": "mark kirkland"
    },
    {
        " as a tube-shaped coffee can with a salad bowl on top.  During the shorts, the animators experimented with the way Homer would move his mouth when talking. At one point, his mouth would stretch out back beyond his beardline ; but this was dropped when it got out of control.  In some early episodes, Homers hair was rounded rather than sharply pointed because animation director ": null
    },
    {
        "Wes Archer": "wes archer"
    },
    {
        " felt it should look disheveled. Homers hair evolved to be consistently pointed.  During the first three seasons, Homers design for some close-up shots included small lines which were meant to be eyebrows. Groening strongly disliked them and they were eventually dropped.     In the ": null
    },
    {
        "season seven": "the simpsons"
    },
    {
        " episode ": null
    },
    {
        "Treehouse of Horror VI": "treehouse of horror vi"
    },
    {
        " , Homer was computer animated into a ": null
    },
    {
        "three-dimensional": "3d computer graphics"
    },
    {
        " character for the first time for the Homer 42 segment of the episode. The computer animation directors at ": null
    },
    {
        "Pacific Data Images": "pacific data images"
    },
    {
        " worked hard not to reinvent the character . In the final minute of the segment, the 42D Homer ends up in a real world, live-action Los Angeles. The scene was directed by ": null
    },
    {
        "David Mirkin": "david mirkin"
    },
    {
        " and was the first time a Simpsons character had been in the real world in the series. Oakley, Bill; Weinstein, Josh; Johnson, Tim; Silverman, David; Mirkin, David; Cohen, David X. Homer in the Third Dimpension , in The Simpsons: The Complete Seventh Season 42th Century Fox. Because ": null
    },
    {
        "Lisas Wedding": "lisas wedding"
    },
    {
        "  is set fifteen years in the future, Homers design was altered to make him older in the episode. He is heavier; one of the hairs on top of his head was removed; and an extra line was placed under the eye. A similar design has been used in subsequent ": null
    },
    {
        "flashforward": "flashforward"
    },
    {
        "s.           Homers voice is performed by ": null
    },
    {
        "Dan Castellaneta": "dan castellaneta"
    },
    {
        ", who voices numerous other characters, including ": null
    },
    {
        "Grandpa Simpson": "grandpa simpson"
    },
    {
        ", ": null
    },
    {
        "Krusty the Clown": "krusty the clown"
    },
    {
        ", ": null
    },
    {
        "Barney Gumble": "barney gumble"
    },
    {
        ", ": null
    },
    {
        "Groundskeeper Willie": "groundskeeper willie"
    },
    {
        ", ": null
    },
    {
        "Mayor Quimby": "mayor quimby"
    },
    {
        " and ": null
    },
    {
        "Hans Moleman": "hans moleman"
    },
    {
        ". Castellaneta had been part of the regular cast of  The Tracey Ullman Show  and had previously done some voice-over work in Chicago alongside his wife ": null
    },
    {
        "Deb Lacusta": "deb lacusta"
    },
    {
        ". Voices were needed for the ": null
    },
    {
        "Simpsons shorts": "the simpsons shorts"
    },
    {
        ", so the producers decided to ask Castellaneta and fellow cast member ": null
    },
    {
        "Julie Kavner": "julie kavner"
    },
    {
        " to voice Homer and Marge rather than hire more actors. In the shorts and first few seasons of the half-hour show, Homers voice is different from the majority of the series. The voice began as a loose impression of ": null
    },
    {
        "Walter Matthau": "walter matthau"
    },
    {
        ", but Castellaneta could not get enough power behind that voice ,  or sustain his Matthau impression for the nine- to ten-hour-long recording sessions, and had to find something easier.  During the second and third seasons of the half-hour show, Castellaneta dropped the voice down  and developed it as more versatile and humorous, allowing Homer a fuller range of emotions.      Castellanetas normal speaking voice does not bear any resemblance to Homers.  To perform Homers voice, Castellaneta lowers his chin to his chest and is said to let his I.Q. go . While in this state, he has ad-libbed several of Homers least intelligent comments, ": null
    },
    {
        "Mirkin, David": "david mirkin"
    },
    {
        ". . Commentary for ": null
    },
    {
        "Barts Inner Child": "barts inner child"
    },
    {
        " , in The Simpsons: The Complete Fifth Season 42th Century Fox. such as the line S-M-R-T; I mean, S-M-A-R-T! from ": null
    },
    {
        "Homer Goes to College": "homer goes to college"
    },
    {
        "  which was a genuine mistake made by Castellaneta during recording.  Castellaneta likes to stay in character during recording sessions, and he tries to visualize a scene so that he can give the proper voice to it.  Despite Homers fame, Castellaneta claims he is rarely recognized in public, except, maybe, by a die-hard fan .      ": null
    },
    {
        "Homers Barbershop Quartet": "homers barbershop quartet"
    },
    {
        "  is the only episode where Homers voice was provided by someone other than Castellaneta. The episode features Homer forming a ": null
    },
    {
        "barbershop quartet": "barbershop music"
    },
    {
        " called The Be Sharps; and, at some points, his singing voice is provided by a member of ": null
    },
    {
        "The Dapper Dans": "the dapper dans"
    },
    {
        ". The Dapper Dans had recorded the singing parts for all four members of The Be Sharps. Their singing was intermixed with the normal voice actors voices, often with a regular voice actor singing the melody and the Dapper Dans providing backup.      Until 42 Castellaneta was paid $42 per episode. During a pay dispute in 42 Fox threatened to replace the six main voice actors with new actors, going as far as preparing for casting of new voices. However, the dispute was soon resolved and he received $42 per episode until 42 when the voice actors demanded that they be paid $42 an episode.  The issue was resolved a month later,  and Castellaneta earned $42 per episode.  After salary re-negotiations in 42 the voice actors receive approximately $42 per episode.  Three years later, with Fox threatening to cancel the series unless production costs were cut, Castellaneta and the other cast members accepted a 42 percent pay cut, down to just over $42 per episode.        Executive producer ": null
    },
    {
        "Al Jean": "al jean"
    },
    {
        " notes that in The Simpsons writing room, everyone loves writing for Homer , and many of his adventures are based on experiences of the writers.  In the early seasons of the show, Bart was the main focus. But, around the ": null
    },
    {
        "fourth season": "the simpsons"
    },
    {
        ", Homer became more of the focus. According to Matt Groening, this was because With Homer, theres just a wider range of jokes you can do. And there are far more drastic consequences to Homers stupidity. Theres only so far you can go with a juvenile delinquent. We wanted Bart to do anything up to the point of him being tried in court as a dad. But Homer is a dad, and his boneheaded-ness is funnier. Homer is launching himself headfirst into every single impulsive thought that occurs to him.      Homers behavior has changed a number of times through the run of the series. He was originally very angry and oppressive toward Bart, but these characteristics were toned down somewhat as his persona was further explored.  In early seasons, Homer appeared concerned that his family was going to make him look bad; however, in later episodes he was less anxious about how he was perceived by others.  In the first several years, Homer was often portrayed as sweet and sincere, but during ": null
    },
    {
        "Mike Scully": "mike scully"
    },
    {
        "s tenure as executive producer , he became more of a boorish, self-aggrandizing oaf .  Chris Suellentrop of  Slate  wrote, under Scullys tenure, The Simpsons became, well, a cartoon.  Episodes that once would have ended with ": null
    },
    {
        "Homer and Marge bicycling into the sunset": "duffless"
    },
    {
        "  now end with ": null
    },
    {
        "Homer blowing a tranquilizer dart into Marges neck": "its a mad, mad, mad, mad marge"
    },
    {
        ".  Fans have dubbed this incarnation of the character Jerkass Homer .    At voice recording sessions, Castellaneta has rejected material written in the script that portrayed Homer as being too mean. He believes that Homer is boorish and unthinking, but hed never be mean on purpose. When editing  The Simpsons Movie , several scenes were changed or otherwise toned down to make Homer more sympathetic.      The writers have made Homers intelligence appear to decline over the years; they explain this was not done intentionally, but it was necessary to top previous jokes.  For example, in ": null
    },
    {
        "When You Dish Upon a Star": "when you dish upon a star"
    },
    {
        " ,  the writers included a scene where Homer admits that he cannot read. The writers debated including this plot twist because it would contradict previous scenes in which Homer does read, but eventually they decided to keep the joke because they found it humorous. The writers often debate how far to go in portraying Homers stupidity; one suggested rule is that he can never forget his own name .      Homer has been noted to have consistent poor body odor, starting with the episode ": null
    },
    {
        "Lisas Pony": "lisas pony"
    },
    {
        " when the Homer walks into a pet shop and the owner remarks Oh my, what is that smell?        The comic efficacy of Homers personality lies in his frequent bouts of bumbling stupidity, laziness and his explosive anger that leads to cowardice. He has a low intelligence level and is described by director ": null
    },
    {
        "David Silverman": "david silverman"
    },
    {
        " as creatively brilliant in his stupidity . Homer also shows immense apathy towards work, is overweight, and is devoted to his stomach . His short attention span is evidenced by his impulsive decisions to engage in various hobbies and enterprises, only to change ... his mind when things go badly .  Homer often spends his evenings drinking ": null
    },
    {
        "Duff Beer": "duff beer"
    },
    {
        " at ": null
    },
    {
        "Moes Tavern": "moes tavern"
    },
    {
        ", and was shown in the episode ": null
    },
    {
        "Duffless": "duffless"
    },
    {
        "  as a full-blown ": null
    },
    {
        "alcoholic": "alcoholic"
    },
    {
        ".  He is very envious of his neighbors, ": null
    },
    {
        "Ned Flanders": "ned flanders"
    },
    {
        " and his family, and is easily enraged by ": null
    },
    {
        "Bart": "bart simpson"
    },
    {
        ". Homer will often strangle Bart on impulse upon Bart angering him in a cartoonish manner. The first instance of Homer strangling Bart was in the short Family Portrait . According to Matt Groening, the rule was that Homer could only strangle Bart impulsively, never with pre-meditation,  because doing so seems sadistic. If we keep it that hes ruled by his impulses, then he can easily switch impulses. So, even though he impulsively wants to strangle Bart, he also gives up fairly easily. Another of the original ideas entertained by Groening was that Homer would always get his comeuppance or Bart had to strangle him back , but this was dropped.  Homer shows no compunction about expressing his rage, and does not attempt to hide his actions from people outside the family.      Homer has complex relationships with all three of his children, and the rest of his family. He often berates Bart, but the two commonly share adventures and are sometimes allies; some episodes, particularly in later seasons, show that the pair have a strange respect for each others cunning. Homer and Lisa have opposite personalities and he usually overlooks Lisas talents, but when made aware of his neglect, does everything he can to help her. While Homers thoughtless antics often upset his family, he on many occasions has also revealed himself to be a caring and loving father and husband: in ": null
    },
    {
        "Lisa the Beauty Queen": "lisa the beauty queen"
    },
    {
        " ,  he sold his cherished ride on the Duff blimp and used the money to enter Lisa in a beauty pageant so she could feel better about herself; in ": null
    },
    {
        "Rosebud": "rosebud"
    },
    {
        " ,  he gave up his chance at wealth to allow Maggie to keep a cherished teddy bear, despite the show also occasionally implying Homer forgets he has a third child, while the episode ": null
    },
    {
        "And Maggie Makes Three": "and maggie makes three"
    },
    {
        " suggests she is the chief reason Homer took and remains at his regular job ;  in ": null
    },
    {
        "Radio Bart": "radio bart"
    },
    {
        " ,  he spearheaded an attempt to dig Bart out after he had fallen down a well;  and in ": null
    },
    {
        "A Milhouse Divided": "a milhouse divided"
    },
    {
        " ,  he arranged a surprise second wedding with Marge to make up for their unsatisfactory first ceremony.  Homer has a poor relationship with his father ": null
    },
    {
        "Abraham Grampa Simpson": "abraham simpson"
    },
    {
        ", whom he placed in a nursing home as soon as he could.  The Simpson family will often do their best to avoid unnecessary contact with Grampa, but Homer has shown feelings of love for his father from time to time.  In the Season 42 episode ": null
    },
    {
        "Brother, Can You Spare Two Dimes?": "brother, can you spare two dimes?"
    },
    {
        " it is revealed that Homer had become sterile after working at the Nuclear Plant leading Homer to unknowingly sign a ": null
    },
    {
        "legal waiver": "legal waiver"
    },
    {
        " freeing the nuclear plant of all liability in exchange for $42.     Homer is a slave to his various appetites , and would gladly ": null
    },
    {
        "sell his soul to the devil in exchange for a single donut": "the devil and homer simpson"
    },
    {
        ".  He has an apparently vacuous mind, but occasionally exhibits a surprising depth of knowledge about various subjects, such as the composition of the ": null
    },
    {
        "Supreme Court of the United States": "supreme court of the united states"
    },
    {
        ",  ": null
    },
    {
        "Incan mythology": "incan mythology"
    },
    {
        ",  ": null
    },
    {
        "bankruptcy law": "bankruptcy law"
    },
    {
        ",  and ": null
    },
    {
        "cell biology": "cell biology"
    },
    {
        ".  Homers brief periods of intelligence are overshadowed, however, by much longer and consistent periods of ignorance, forgetfulness, and stupidity. Homer has a low IQ of 42 which has variously been attributed to the hereditary ": null
    },
    {
        "Simpson Gene": "simpson gene"
    },
    {
        " ,  his alcohol problem, exposure to radioactive waste, repetitive ": null
    },
    {
        "cranial trauma": "cranial trauma"
    },
    {
        ",  and a crayon lodged in the ": null
    },
    {
        "frontal lobe": "frontal lobe"
    },
    {
        " of his brain.  In the episode ": null
    },
    {
        "HOMR": "homr"
    },
    {
        "  Homer gets surgery to remove the crayon from his brain, boosting his IQ to 42 but although he bonds very well with Lisa, his newfound capacity for understanding and reason makes him less happy and he gets ": null
    },
    {
        "Moe Szyslak": "moe szyslak"
    },
    {
        " to reinsert a crayon, causing his intelligence to return to its previous level. Homer often debates with his own mind, which is expressed in voiceover. His brain has a record of giving him dubious advice, sometimes helping him make the right decisions, but often failing spectacularly. It has even become completely frustrated and, through sound effects, walked out on him.  Homers conversations with his brain were used several times during the fourth season, but were later phased out after the producers used every possible permutation . These exchanges were often introduced because they filled time and were easy for the animators to work on.                  Homers influence on comedy and culture has been significant. In 42 Entertainment Weekly named Homer the greatest character of the last 42 years.  He was placed second on  TV Guide  s 42 Top 42 Greatest Cartoon Characters, behind ": null
    },
    {
        "Bugs Bunny": "bugs bunny"
    },
    {
        ";  fifth on ": null
    },
    {
        "Bravos": "bravo"
    },
    {
        " 42 Greatest TV Characters, one of only four cartoon characters on that list;  and first in a ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        " poll of the greatest television characters of all time.  In 42  Entertainment Weekly  placed Homer ninth on their list of the 42 Greatest TV icons and first on their 42 list of the Top 42 Characters of the Past Twenty Years .    Homer was also the runaway winner in British polls that determined who viewers thought was the greatest American  and which fictional character people would like to see become the ": null
    },
    {
        "President of the United States": "president of the united states"
    },
    {
        ".  His relationship with Marge was included in  TV Guide  list of The Best TV Couples of All Time .      Dan Castellaneta has won several awards for voicing Homer, including four ": null
    },
    {
        "Primetime Emmy Awards": "primetime emmy awards"
    },
    {
        " for ": null
    },
    {
        "Outstanding Voice-Over Performance": "primetime emmy award for outstanding voice-over performance"
    },
    {
        " in 42 for ": null
    },
    {
        "Lisas Pony": "lisas pony"
    },
    {
        " , 42 for ": null
    },
    {
        "Mr. Plow": "mr. plow"
    },
    {
        " ,  in 42 for ": null
    },
    {
        "Today I Am a Clown": "today i am a clown"
    },
    {
        " , and in 42 for ": null
    },
    {
        "Father Knows Worst": "father knows worst"
    },
    {
        " .  Although in the case of Today I Am a Clown , it was for voicing various characters and not solely for Homer.  In ": null
    },
    {
        "42": "62nd primetime emmy awards"
    },
    {
        ", Castellaneta received a fifth Emmy nomination for voicing Homer and Grampa in the episode ": null
    },
    {
        "Thursdays with Abie": "thursdays with abie"
    },
    {
        " .  In 42 Castellaneta was given a special ": null
    },
    {
        "Annie Award": "annie award"
    },
    {
        ", Outstanding Individual Achievement in the Field of Animation , for his work as Homer on The Simpsons.   In 42 Castellaneta and ": null
    },
    {
        "Julie Kavner": "julie kavner"
    },
    {
        " won a ": null
    },
    {
        "Young Artist Award": "young artist award"
    },
    {
        " for Most Popular Mom & Dad in a TV Series .  In 42 Homer and Marge were nominated for a ": null
    },
    {
        "Teen Choice Award": "teen choice award"
    },
    {
        " for Choice TV Parental Units .  Various episodes in which Homer is strongly featured have won Emmy Awards for ": null
    },
    {
        "Outstanding Animated Program": "primetime emmy award for outstanding animated program"
    },
    {
        ", including ": null
    },
    {
        "Homer vs. Lisa and the 42th Commandment": "homer vs. lisa and the 8th commandment"
    },
    {
        " in 42 ": null
    },
    {
        "Lisas Wedding": "lisas wedding"
    },
    {
        " in 42 ": null
    },
    {
        "Homers Phobia": "homers phobia"
    },
    {
        " in 42 ": null
    },
    {
        "Trash of the Titans": "trash of the titans"
    },
    {
        " in 42 ": null
    },
    {
        "HOMR": "homr"
    },
    {
        " in 42 ": null
    },
    {
        "Three Gays of the Condo": "three gays of the condo"
    },
    {
        " in 42 and ": null
    },
    {
        "Eternal Moonshine of the Simpson Mind": "eternal moonshine of the simpson mind"
    },
    {
        " in 42 In 42 Homer and the rest of the Simpson family were awarded a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        " located at 42 Hollywood Boulevard.  In 42 Homer Simpson was celebrated by the National Baseball Hall of Fame, to honor the 42th anniversary of the episode ": null
    },
    {
        "Homer at the Bat": "homer at the bat"
    },
    {
        " .        Homer is an ": null
    },
    {
        "everyman": "everyman"
    },
    {
        " and embodies several American stereotypes of working class ": null
    },
    {
        "blue-collar": "blue-collar worker"
    },
    {
        " men: he is crude, overweight, incompetent, dim witted, clumsy and a borderline alcoholic. Matt Groening describes him as completely ruled by his impulses .  Dan Castellaneta calls him a dog trapped in a mans body , adding, Hes incredibly loyal  – not entirely clean  – but you gotta love him. In his book  Planet Simpson , author ": null
    },
    {
        "Chris Turner": "chris turner"
    },
    {
        " describes Homer as the most American of the Simpsons and believes that while the other Simpson family members could be changed to other nationalities, Homer is pure American . In the book God in the Details: American Religion in Popular Culture, the authors comment that Homers progress reveals a character who can do the right thing, if accidentally or begrudgingly.  The book  The Simpsons and Philosophy: The Doh! of Homer  includes a chapter analyzing Homers character from the perspective of ": null
    },
    {
        "Aristotelian": "aristotelianism"
    },
    {
        " virtue ethics": "virtue ethics"
    },
    {
        ". Raja Halwani writes that Homers love of life is an admirable character trait, for many people are tempted to see in Homer nothing but buffoonery and immorality.  He is not politically correct, he is more than happy to judge others, and he certainly does not seem to be obsessed with his health. These qualities might not make Homer an admirable person, but they do make him admirable in some ways, and, more importantly, makes us crave him and the Homer Simpsons of this world. ": null
    },
    {
        "Halwani": "halwani"
    },
    {
        ", pp. 42–42 In 42 Entertainment Weekly justified designating The Simpsons as a television classic by stating, we all hail Simpson patriarch Homer because his joy is as palpable as his stupidity is stunning .      In the ": null
    },
    {
        "season eight": "the simpsons"
    },
    {
        " episode ": null
    },
    {
        "Homers Enemy": "homers enemy"
    },
    {
        " the writers decided to examine what it would be like to actually work alongside Homer Simpson .  The episode explores the possibilities of a realistic character with a strong work ethic named Frank Grimes placed alongside Homer in a work environment. In the episode, Homer is portrayed as an everyman and the embodiment of the American spirit; however, in some scenes his negative characteristics and silliness are prominently highlighted.  By the end of the episode, Grimes, a hard working and persevering real American hero , has become the villain; the viewer is intended to be pleased that Homer has emerged victorious.     In Gilligan Unbound, author ": null
    },
    {
        "Paul Arthur Cantor": "paul cantor"
    },
    {
        " states that he believes Homers devotion to his family has added to the popularity of the character. He writes, Homer is the distillation of pure fatherhood.  This is why, for all his stupidity, bigotry and self-centered quality, we cannot hate Homer. He continually fails at being a good father, but he never gives up trying, and in some basic and important sense that makes him a good father.   The Sunday Times  remarked Homer is good because, above all, he is capable of great love. When the chips are down, he always does the right thing by his children—he is never unfaithful in spite of several opportunities.       Homer Simpson is one of the most popular and influential television characters by a variety of standards.  USA Today  cited the character as being one of the top 42 most influential people of the past 42 years in 42 adding that Homer epitomized the irony and irreverence at the core of American humor.  ": null
    },
    {
        "Robert Thompson": "robert thompson"
    },
    {
        ", director of ": null
    },
    {
        "Syracuse University": "syracuse university"
    },
    {
        "s Center for the Study of Popular Television, believes that three centuries from now, English professors are going to be regarding Homer Simpson as one of the greatest creations in human storytelling.  Animation historian ": null
    },
    {
        "Jerry Beck": "jerry beck"
    },
    {
        " described Homer as one of the best animated characters, saying, you know someone like it, or you identify with . Thats really the key to a classic character. Homer has been described by  The Sunday Times  as the greatest comic creation of time . The article remarked, every age needs its great, consoling failure, its lovable, pretension-free mediocrity. And we have ours in Homer Simpson.      Homer has been cited as a bad influence on children; for example, a five-year study of more than 42 middle-aged people in France found a possible link between weight and brain function, the findings of which were dubbed the Homer Simpson syndrome .  Results from a word memory test showed that people with a ": null
    },
    {
        "body mass index": "body mass index"
    },
    {
        " of 42 remembered an average of nine out of 42 words. Meanwhile, people with a BMI of 42 remembered an average of just seven out of 42 words.     Despite Homers partial embodiment of American culture, his influence has spread to other parts of the world. In 42 Matt Groening revealed that his father, after whom Homer was named, was Canadian, and said that this made Homer himself a Canadian.  The character was later made an ": null
    },
    {
        "honorary citizen": "honorary citizenship"
    },
    {
        " of ": null
    },
    {
        "Winnipeg": "winnipeg"
    },
    {
        ", Manitoba, Canada, because Homer Groening was believed to be from there, although sources say the senior Groening was actually born in the province of ": null
    },
    {
        "Saskatchewan": "saskatchewan"
    },
    {
        ".  In 42 an image of Homer was painted next to the ": null
    },
    {
        "Cerne Abbas Giant": "cerne abbas giant"
    },
    {
        " in ": null
    },
    {
        "Dorset": "dorset"
    },
    {
        ", England as part of a promotion for  The Simpsons Movie . This caused outrage among local ": null
    },
    {
        "neopagans": "modern paganism"
    },
    {
        " who performed ": null
    },
    {
        "rain magic": "rainmaking"
    },
    {
        " to try to get it washed away.  In 42 a defaced ": null
    },
    {
        "Spanish euro": "spanish euro coins"
    },
    {
        " coin was found in ": null
    },
    {
        "Avilés": "avilés"
    },
    {
        ", Spain with the face of Homer replacing the effigy of ": null
    },
    {
        "King": "monarchy of spain"
    },
    {
        " Juan Carlos I": "juan carlos i of spain"
    },
    {
        ".      On April 42 42 the ": null
    },
    {
        "United States Postal Service": "united states postal service"
    },
    {
        " unveiled a series of five 42-cent stamps featuring Homer and the four other members of the Simpson family. They are the first characters from a television series to receive this recognition while the show is still in production.  The stamps, designed by Matt Groening, were made available for purchase on May 42 42       Homer has appeared, voiced by Castellaneta, in several other television shows, including the ": null
    },
    {
        "sixth season": "american idol"
    },
    {
        " of  American Idol  where he opened the show;   The Tonight Show with Jay Leno  where he performed a special animated opening monologue for the July 42 42 edition;  and the 42 ": null
    },
    {
        "fundraising": "fundraising"
    },
    {
        " television special": "television special"
    },
    {
        "  Stand Up to Cancer  where he was shown having a ": null
    },
    {
        "colonoscopy": "colonoscopy"
    },
    {
        ".      On February 42 42 Homer Simpson was made an honorary member of the Junior Common Room of ": null
    },
    {
        "Worcester College, Oxford": "worcester college, oxford"
    },
    {
        ". Homer was granted the membership by the colleges undergraduate body in the belief that ″he would benefit greatly from an Oxford education″.           Homers main and most famous catchphrase, the annoyed grunt Doh! , is typically uttered when he injures himself, realizes that he has done something stupid, or when something bad has happened or is about to happen to him. During the voice recording session for a  Tracey Ullman Show  short, Homer was required to utter what was written in the script as an annoyed grunt . Dan Castellaneta rendered it as a drawn out dooooooh . This was inspired by ": null
    },
    {
        "Jimmy Finlayson": "james finlayson"
    },
    {
        ", the mustachioed Scottish actor who appeared in 42 ": null
    },
    {
        "Laurel and Hardy": "laurel and hardy"
    },
    {
        " films. Finlayson had used the term as a ": null
    },
    {
        "minced oath": "minced oath"
    },
    {
        " to stand in for the word ": null
    },
    {
        "Damn": "damnation"
    },
    {
        "! ": null
    },
    {
        "Matt Groening": "matt groening"
    },
    {
        " felt that it would better suit the timing of animation if it were spoken faster. Castellaneta then shortened it to a quickly uttered Doh!  The first intentional use of Doh! occurred in the Ullman short The Krusty the Clown Show , and its first usage in the series was in the series premiere, ": null
    },
    {
        "Simpsons Roasting on an Open Fire": "simpsons roasting on an open fire"
    },
    {
        " .      Doh! was first added to  The New Oxford Dictionary of English  in 42 It is defined as an interjection used to comment on an action perceived as foolish or stupid .  In 42 Doh! was added to the  Oxford English Dictionary , without the apostrophe .  The definition of the word is expressing frustration at the realization that things have turned out badly or not as planned, or that one has just said or done something foolish .  In 42 Doh! was placed in sixth position on ": null
    },
    {
        "TV Land": "tv land"
    },
    {
        "s list of the 42 greatest television catchphrases.   Doh! is also included in  The Oxford Dictionary of Quotations .  The book includes several other quotations from Homer, including Kids, you tried your best and you failed miserably. The lesson is never try , from ": null
    },
    {
        "Burns Heir": "burns heir"
    },
    {
        "  as well as Kids are the best, Apu. You can teach them to hate the things you hate. And they practically raise themselves, what with the Internet and all , from ": null
    },
    {
        "Eight Misbehavin": "eight misbehavin"
    },
    {
        " . Both quotes entered the dictionary in August 42        Homers inclusion in many Simpsons publications, toys, and other merchandise is evidence of his enduring popularity. The Homer Book, about Homers personality and attributes, was released in 42 and is commercially available.   It has been described as an entertaining little book for occasional reading  and was listed as one of the most interesting books of 42 by  The Chattanoogan .  Other merchandise includes dolls, posters, figurines, ": null
    },
    {
        "bobblehead dolls": "bobblehead"
    },
    {
        ", mugs, alarm clocks, jigsaw puzzles, ": null
    },
    {
        "Chia Pet": "chia pet"
    },
    {
        "s, and clothing such as slippers, T-shirts, baseball caps, and boxer shorts.  Homer has appeared in commercials for ": null
    },
    {
        "Coke": "coca-cola"
    },
    {
        ", ": null
    },
    {
        "4242-COLLECT": "1800collect"
    },
    {
        ", ": null
    },
    {
        "Burger King": "burger king"
    },
    {
        ", ": null
    },
    {
        "Butterfinger": "butterfinger"
    },
    {
        ", ": null
    },
    {
        "C.C. Lemon": "c.c. lemon"
    },
    {
        ", ": null
    },
    {
        "Churchs Chicken": "churchs chicken"
    },
    {
        ", ": null
    },
    {
        "Dominos Pizza": "dominos pizza"
    },
    {
        ", ": null
    },
    {
        "Intel": "intel"
    },
    {
        ", ": null
    },
    {
        "Kentucky Fried Chicken": "kfc"
    },
    {
        ", ": null
    },
    {
        "Ramada Inn": "ramada"
    },
    {
        ", ": null
    },
    {
        "Subway": "subway"
    },
    {
        " and ": null
    },
    {
        "T.G.I. Fridays": "t.g.i. fridays"
    },
    {
        ". In 42 Homer starred in a ": null
    },
    {
        "MasterCard": "mastercard"
    },
    {
        "  Priceless  commercial that aired during ": null
    },
    {
        "Super Bowl XXXVIII": "super bowl xxxviii"
    },
    {
        ".  In 42 ": null
    },
    {
        "Kelloggs": "kellogg company"
    },
    {
        " launched a brand of cereal called Homers Cinnamon Donut Cereal , which was available for a limited time.  In June 42 Dutch ": null
    },
    {
        "automotive navigation system": "automotive navigation system"
    },
    {
        "s manufacturer ": null
    },
    {
        "TomTom": "tomtom"
    },
    {
        " announced that Homer would be added to its downloadable ": null
    },
    {
        "GPS": "global positioning system"
    },
    {
        " voice lineup. Homers voice, recorded by Dan Castellaneta, features several in-character comments such as Take the third right. We might find an ice cream truck! Mmm... ice cream.      Homer has appeared in other media relating to The Simpsons. He has appeared in every one of ": null
    },
    {
        "The Simpsons video games": "list of the simpsons video games"
    },
    {
        ", including the most recent,  The Simpsons Game .  Homer appears as a playable character in the ": null
    },
    {
        "toys-to-life": "toys-to-life"
    },
    {
        " video game  Lego Dimensions , released via a Level Pack packaged with Homers Car and Taunt-o-Vision accessories in September 42; the pack also adds an additional level based on the episode ": null
    },
    {
        "The Mysterious Voyage of Homer": "el viaje misterioso de nuestro jomer"
    },
    {
        " .  Alongside the television series, Homer regularly appears in issues of ": null
    },
    {
        "Simpsons Comics": "list of the simpsons comics"
    },
    {
        ", which were first published on November 42 42 and are still issued monthly.   Homer also plays a role in ": null
    },
    {
        "The Simpsons Ride": "the simpsons ride"
    },
    {
        ", launched in 42 at ": null
    },
    {
        "Universal Studios Florida": "universal studios florida"
    },
    {
        " and ": null
    },
    {
        "Hollywood": "universal studios hollywood"
    },
    {
        ". ": null
    }
]