[
    {
        "               In ": null
    },
    {
        "baseball": "baseball"
    },
    {
        ", a home run  is scored when the ball is hit in such a way that the ": null
    },
    {
        "batter": "batting"
    },
    {
        " is able to circle the bases and reach home   ": null
    },
    {
        "safely": "safe"
    },
    {
        " in one play without any ": null
    },
    {
        "errors": "error"
    },
    {
        " being committed by the defensive team in the process. In modern baseball, the feat is typically achieved by hitting the ball over the ": null
    },
    {
        "outfield": "outfield"
    },
    {
        " fence between the ": null
    },
    {
        "foul poles": "foul pole"
    },
    {
        " without first touching the ground, resulting in an automatic home run. There is also the ": null
    },
    {
        "inside-the-park": "inside-the-park home run"
    },
    {
        " home run where the batter reaches home safely while the baseball is in play on the field. A home run with a high exit velocity and good launch angle is sometimes called a no-doubter, because it leaves no doubt that it is going to leave the park when it leaves the bat.     When a home run is scored, the batter is also credited with a ": null
    },
    {
        "hit": "hit"
    },
    {
        " and a run scored, and an ": null
    },
    {
        "RBI": "rbi"
    },
    {
        " for each runner that scores, including himself. Likewise, the pitcher is recorded as having given up a hit and a run, with additional runs charged for each runner that scores other than the batter.     Home runs are among the most popular aspects of baseball and, as a result, prolific home run hitters are usually the most popular among fans and consequently the highest paid by teams—hence the old saying, Home run hitters drive ": null
    },
    {
        "Cadillac": "cadillac"
    },
    {
        "s, and singles hitters drive ": null
    },
    {
        "Fords": "ford motor company"
    },
    {
        " . Johnson, Vince. . Pittsburgh Post-Gazette. January 7, 1949. Retrieved December 2, 2018. Once, while Kiner was trying futilely to place his hits, old Fritz Ostermueller came through with a sage observation. Ralph, he said, the right-hand batters who hit to right field are driving Fords. The right-hand batters who hit over the fence in left are driving Cadillacs. Kiner, by the way, is driving a Cadillac. Kiner, Ralph; Peary, Danny. . The New York Times. April 4, 2004. Retrieved December 2, 2018. Another quote that has been attributed to me is, Home-run hitters drive Cadillacs and singles hitters drive Fords. That was actually first said by my Pirates teammate, pitcher Fritz Ostermueller.          In modern times a home run is most often scored when the ball is hit over the outfield wall between the foul poles  before it touches the ground , and without being caught or deflected back onto the field by a fielder. A batted ball is also a home run if it touches either foul pole or its attached screen before touching the ground, as the foul poles are by definition in fair territory. Additionally, many major-league ballparks have ": null
    },
    {
        "ground rules": "ground rules"
    },
    {
        " stating that a batted ball in flight that strikes a specified location or fixed object is a home run; this usually applies to objects that are beyond the outfield wall but are located such that it may be difficult for an umpire to judge.     In professional baseball, a batted ball that goes over the outfield wall after touching the ground becomes an automatic ": null
    },
    {
        "double": "double"
    },
    {
        ". This is colloquially referred to as a ": null
    },
    {
        "ground rule double": "ground rule double"
    },
    {
        " because the rule is not strictly written into the rules of baseball, but is rather a ": null
    },
    {
        "rule": "ground rules"
    },
    {
        " of the field being used.     A fielder is allowed to reach over the wall to attempt to catch the ball as long as his feet are on or over the field during the attempt, and if the fielder successfully catches the ball while it is in flight the batter is out, even if the ball had already passed the vertical plane of the wall. However, since the fielder is not part of the field, a ball that bounces off a fielder and over the wall without touching the ground is still a home run. A fielder may not deliberately throw his ": null
    },
    {
        "glove": "baseball glove"
    },
    {
        ", ": null
    },
    {
        "cap": "baseball cap"
    },
    {
        ", or any other equipment or apparel to stop or deflect a fair ball, and an ": null
    },
    {
        "umpire": "umpire"
    },
    {
        " may award a home run to the batter if a fielder does so on a ball that, in the umpires judgment, would have otherwise been a home run .      A home run accomplished in any of the above manners is an automatic home run. The ball is dead, even if it rebounds back onto the field , and the batter and any preceding runners cannot be put out at any time while running the bases. However, if one or more runners fail to touch a base or one runner passes another before reaching home plate, that runner or runners can be called out on ": null
    },
    {
        "appeal": "appeal play"
    },
    {
        ", though in the case of not touching a base a runner can go back and touch it if doing so wont cause them to be passed by another preceding runner and they have not yet touched the next base . This stipulation is in Approved Ruling of Rule 7.10.           An ": null
    },
    {
        "inside-the-park home run": "inside-the-park home run"
    },
    {
        " occurs when a batter hits the ball into play and is able to circle the bases before the fielders can put him out. Unlike with an outside-the-park home run, the batter-runner and all preceding runners are liable to be put out by the defensive team at any time while running the bases. This can only happen if the ball does not leave the ballfield.     In the early days of baseball, outfields were relatively much more spacious, reducing the likelihood of an over-the-fence home run, while increasing the likelihood of an inside-the-park home run, as a ball getting past an outfielder had more distance that it could roll before a fielder could track it down.     Modern outfields are much less spacious and more uniformly designed than in the games early days, therefore inside-the-park home runs are now a rarity. They usually occur when a fast runner hits the ball deep into the outfield and the ball bounces in an unexpected direction away from the nearest outfielder , the nearest outfielder is injured on the play and cannot get to the ball, or an outfielder misjudges the flight of the ball in a way that he cannot quickly recover from the mistake . The speed of the runner is crucial as even ": null
    },
    {
        "triples": "triple"
    },
    {
        " are relatively rare in most modern ballparks.      If any defensive play on an inside-the-park home run is labeled an ": null
    },
    {
        "error": "error"
    },
    {
        " by the official scorer, a home run is not scored; instead, it is scored as a ": null
    },
    {
        "single": "single"
    },
    {
        ", ": null
    },
    {
        "double": "double"
    },
    {
        ", or ": null
    },
    {
        "triple": "triple"
    },
    {
        ", and the ": null
    },
    {
        "batter-runner": "batter-runner"
    },
    {
        " and any applicable preceding runners are said to have taken all additional bases on error. All runs scored on such a play, however, still count.     An example of an unexpected bounce occurred during the ": null
    },
    {
        "2007 Major League Baseball All-Star Game": "2007 major league baseball all-star game"
    },
    {
        " at ": null
    },
    {
        "AT & T Park": "at & t park"
    },
    {
        " in San Francisco on July 10, 2007. ": null
    },
    {
        "Ichiro Suzuki": "ichiro suzuki"
    },
    {
        " of the ": null
    },
    {
        "American League": "american league"
    },
    {
        " team hit a fly ball that caromed off the right-center field wall in the opposite direction from where ": null
    },
    {
        "National League": "national league"
    },
    {
        " right fielder ": null
    },
    {
        "Ken Griffey, Jr.": "ken griffey jr."
    },
    {
        " was expecting it to go. By the time the ball was relayed, Ichiro had already crossed the plate standing up. This was the first inside-the-park home run in ": null
    },
    {
        "All-Star Game": "major league baseball all-star game"
    },
    {
        " history, and led to Suzuki being named the games ": null
    },
    {
        "Most Valuable Player": "major league baseball most valuable player award"
    },
    {
        ".       Home runs are often characterized by the number of runners on base at the time. A home run hit with the bases empty is seldom called a one-run homer , but rather a solo home run, solo homer, or solo shot . With one runner on base, two runs are scored and thus the home run is often called a two-run homer or two-run shot. Similarly, a home runs with two runners on base is a three-run homer or three-run shot.     The term four-run homer is seldom used; instead, it is nearly always called a grand slam . Hitting a grand slam is the best possible result for the batters turn at bat and the worst possible result for the pitcher and his team.          A grand slam occurs when the bases are loaded and the batter hits a home run. According to The Dickson Baseball Dictionary, the term originated in the card game of ": null
    },
    {
        "contract bridge": "contract bridge"
    },
    {
        ". An inside-the-park grand slam is a grand slam that is also an ": null
    },
    {
        "inside-the-park home run": "inside-the-park home run"
    },
    {
        ", a home run without the ball leaving the field, and it is very rare, due to the relative rarity of loading the bases along with the significant rarity of inside-the-park home runs.     On July 25, 1956, ": null
    },
    {
        "Roberto Clemente": "roberto clemente"
    },
    {
        " became the only MLB player to have ever scored a walk-off inside-the-park grand slam in a 9–8 ": null
    },
    {
        "Pittsburgh Pirates": "pittsburgh pirates"
    },
    {
        " win over the ": null
    },
    {
        "Chicago Cubs": "chicago cubs"
    },
    {
        ", at ": null
    },
    {
        "Forbes Field": "forbes field"
    },
    {
        ".     On April 23, 1999, ": null
    },
    {
        "Fernando Tatís": "fernando tatís"
    },
    {
        " made history by hitting two grand slams in one inning, both against ": null
    },
    {
        "Chan Ho Park": "chan ho park"
    },
    {
        " of the Los Angeles Dodgers. With this feat, Tatís also set a Major League record with 8 RBI in one inning.     On July 29, 2003 against the Texas Rangers, ": null
    },
    {
        "Bill Mueller": "bill mueller"
    },
    {
        " of the ": null
    },
    {
        "Boston Red Sox": "boston red sox"
    },
    {
        " became the only player in major league history to hit two grand slams in one game from opposite sides of the plate; he hit three home runs in that game, and his two grand slams were in consecutive at-bats.     On August 25, 2011 the New York Yankees became the first team to hit three grand slams in one game vs the Oakland As. The Yankees eventually went on to win the game 22–9, after trailing 7–1.       These types of home runs are characterized by the specific game situation in which they occur, and can theoretically occur on either an outside-the-park or inside-the-park home run.          A walk-off home run is a home run hit by the ": null
    },
    {
        "home team": "home team"
    },
    {
        " in the bottom of the ninth inning, any ": null
    },
    {
        "extra inning": "extra inning"
    },
    {
        ", or other scheduled final inning, which gives the home team the lead and thereby ends the game. The term is attributed to ": null
    },
    {
        "Hall of Fame": "national baseball hall of fame and museum"
    },
    {
        " relief pitcher": "relief pitcher"
    },
    {
        " Dennis Eckersley": "dennis eckersley"
    },
    {
        ",  so named because after the run is scored, the losing team has to walk off the field.     Two ": null
    },
    {
        "World Series": "world series"
    },
    {
        " have ended via the walk-off home run. The first was the ": null
    },
    {
        "1960 World Series": "1960 world series"
    },
    {
        " when ": null
    },
    {
        "Bill Mazeroski": "bill mazeroski"
    },
    {
        " of the ": null
    },
    {
        "Pittsburgh Pirates": "pittsburgh pirates"
    },
    {
        " hit a 9th inning solo home run in the 7th game of the series off ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " pitcher ": null
    },
    {
        "Ralph Terry": "ralph terry"
    },
    {
        " to give the Pirates the World Championship. The second time was the ": null
    },
    {
        "1993 World Series": "1993 world series"
    },
    {
        " when ": null
    },
    {
        "Joe Carter": "joe carter"
    },
    {
        " of the ": null
    },
    {
        "Toronto Blue Jays": "toronto blue jays"
    },
    {
        " hit a 9th inning 3-run home run off ": null
    },
    {
        "Philadelphia Phillies": "philadelphia phillies"
    },
    {
        " pitcher ": null
    },
    {
        "Mitch Williams": "mitch williams"
    },
    {
        " in Game 6 of the series, to help the Toronto Blue Jays capture their second World Series Championship in a row.     Such a home run can also be called a ": null
    },
    {
        "sudden death": "sudden death"
    },
    {
        " or sudden victory home run. That usage has lessened as walk-off home run has gained favor. Along with Mazeroskis 1960 shot, the most famous walk-off or sudden-death homer would probably be the ": null
    },
    {
        "Shot Heard Round the World": "shot heard round the world"
    },
    {
        " hit by ": null
    },
    {
        "Bobby Thomson": "bobby thomson"
    },
    {
        " to win the 1951 National League pennant for the ": null
    },
    {
        "New York Giants": "new york giants"
    },
    {
        ", along with many other game-ending home runs that famously ended some of the most important and suspenseful baseball games.     A walk-off home run over the fence is an exception to baseballs one-run rule. Normally if the home team is tied or behind in the ninth or extra innings the game ends as soon as the home team scores enough runs to achieve a lead. If the home team has two outs in the inning, and the game is tied, the game will officially end either the moment the batter successfully reaches 1st base or the moment the runner touches home plate—whichever happens last. However, this is superseded by the ground rule , which provides automatic doubles and home runs . In the latter case, all base runners including the batter are allowed to cross the plate.       A leadoff home run is a home run hit by the first batter of a team, the ": null
    },
    {
        "leadoff hitter": "leadoff hitter"
    },
    {
        " of the first inning of the game. In ": null
    },
    {
        "MLB": "mlb"
    },
    {
        ", ": null
    },
    {
        "Rickey Henderson": "rickey henderson"
    },
    {
        " holds the career record with 81 lead-off home runs.     ": null
    },
    {
        "Craig Biggio": "craig biggio"
    },
    {
        " holds the ": null
    },
    {
        "National League": "national league"
    },
    {
        " career record with 53, third overall to Henderson, and ": null
    },
    {
        "Alfonso Soriano": "alfonso soriano"
    },
    {
        " with 54.  As of 2018, ": null
    },
    {
        "Ian Kinsler": "ian kinsler"
    },
    {
        " held the career record among active players, with 48 leadoff home runs, which also ranked him fourth all-time. Maria Guardado .  mlb.com.      In 1996, ": null
    },
    {
        "Brady Anderson": "brady anderson"
    },
    {
        " set a Major League record by hitting a lead-off home run in four consecutive games.          When two consecutive batters each hit a home run, this is described as back-to-back home runs. It is still considered back-to-back even if both batters hit their home runs off different pitchers. A third batter hitting a home run is commonly referred to as back-to-back-to-back.     Four home runs in a row by consecutive batters has only occurred nine times in the history of Major League Baseball. Following convention, this is called back-to-back-to-back-to-back. The most recent occurrence was on June 9, 2019, when the ": null
    },
    {
        "Washington Nationals": "washington nationals"
    },
    {
        " hit four in a row against the ": null
    },
    {
        "San Diego Padres": "san diego padres"
    },
    {
        " in ": null
    },
    {
        "Petco Park": "petco park"
    },
    {
        " as ": null
    },
    {
        "Howie Kendrick": "howie kendrick"
    },
    {
        ", ": null
    },
    {
        "Trea Turner": "trea turner"
    },
    {
        ", ": null
    },
    {
        "Adam Eaton": "adam eaton"
    },
    {
        " and ": null
    },
    {
        "Anthony Rendon": "anthony rendon"
    },
    {
        " homered off pitcher ": null
    },
    {
        "Craig Stammen": "craig stammen"
    },
    {
        ".  Stammen became the fifth pitcher to surrender back-to-back-to-back-to-back home runs, following ": null
    },
    {
        "Paul Foytack": "paul foytack"
    },
    {
        " on July 31, 1963, ": null
    },
    {
        "Chase Wright": "chase wright"
    },
    {
        " on April 22, 2007, ": null
    },
    {
        "Dave Bush": "dave bush"
    },
    {
        " on August 10, 2010, and ": null
    },
    {
        "Michael Blazek": "michael blazek"
    },
    {
        " on July 27, 2017.     On August 14, 2008, the Chicago White Sox defeated the Kansas City Royals 9–2. In this game, Jim Thome, Paul Konerko, Alexei Ramírez, and Juan Uribe hit back-to-back-to-back-to-back home runs in that order. Thome, Konerko, and Ramirez blasted their homers off of Joel Peralta, while Uribe did it off of Rob Tejeda. The next batter, veteran backstop Toby Hall, tried aimlessly to hit the ball as far as possible, but his effort resulted in a strike out.     On April 22, 2007 the ": null
    },
    {
        "Boston Red Sox": "boston red sox"
    },
    {
        " were trailing the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " 3–0 when ": null
    },
    {
        "Manny Ramirez": "manny ramirez"
    },
    {
        ", ": null
    },
    {
        "J. D. Drew": "j. d. drew"
    },
    {
        ", ": null
    },
    {
        "Mike Lowell": "mike lowell"
    },
    {
        " and ": null
    },
    {
        "Jason Varitek": "jason varitek"
    },
    {
        " hit back-to-back-to-back-to-back home runs to put them up 4–3. They eventually went on to win the game 7–6 after a three-run home run by Mike Lowell in the bottom of the 7th inning. On September 18, 2006 trailing 9–5 to the San Diego Padres in the 9th inning, ": null
    },
    {
        "Jeff Kent": "jeff kent"
    },
    {
        ", ": null
    },
    {
        "J. D. Drew": "j. d. drew"
    },
    {
        ", ": null
    },
    {
        "Russell Martin": "russell martin"
    },
    {
        ", and ": null
    },
    {
        "Marlon Anderson": "marlon anderson"
    },
    {
        " of the Los Angeles Dodgers hit back-to-back-to-back-to-back home runs to tie the game. After giving up a run in the top of the 10th, the Dodgers won the game in the bottom of the 10th, on a walk-off two run home run by ": null
    },
    {
        "Nomar Garciaparra": "nomar garciaparra"
    },
    {
        ". J. D. Drew has been part of two different sets of back-to-back-to-back-to-back home runs. In both occurrences, his homer was the second of the four.     On September 30, 1997, in the sixth inning of Game One of the ": null
    },
    {
        "American League Division Series": "american league division series"
    },
    {
        " between the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " and ": null
    },
    {
        "Cleveland Indians": "cleveland indians"
    },
    {
        ", ": null
    },
    {
        "Tim Raines": "tim raines"
    },
    {
        ", ": null
    },
    {
        "Derek Jeter": "derek jeter"
    },
    {
        " and ": null
    },
    {
        "Paul ONeill": "paul oneill"
    },
    {
        " hit back-to-back-to-back home runs for the Yankees. Raines home run tied the game. New York went on to win 8–6. This was the first occurrence of three home runs in a row ever in postseason play. The ": null
    },
    {
        "Boston Red Sox": "boston red sox"
    },
    {
        " repeated the feat in Game Four of the ": null
    },
    {
        "2007 American League Championship Series": "2007 american league championship series"
    },
    {
        ", also against the Indians. The Indians returned the favor in Game One of the ": null
    },
    {
        "2016 American League Division Series": "2016 american league division series"
    },
    {
        ".     Twice in MLB history have two brothers hit back-to-back home runs. On April 23, 2013, brothers ": null
    },
    {
        "Melvin Upton, Jr.": "melvin upton, jr."
    },
    {
        " and ": null
    },
    {
        "Justin Upton": "justin upton"
    },
    {
        " hit back-to-back home runs.  The first time was on September 15, 1938, when ": null
    },
    {
        "Lloyd Waner": "lloyd waner"
    },
    {
        " and ": null
    },
    {
        "Paul Waner": "paul waner"
    },
    {
        " performed the feat.      Simple back-to-back home runs are a relatively frequent occurrence. If a pitcher gives up a homer, he might have his concentration broken and might alter his normal approach in an attempt to make up for it by striking out the next batter with some fastballs. Sometimes the next batter will be expecting that and will capitalize on it. A notable back-to-back home run of that type in ": null
    },
    {
        "World Series": "world series"
    },
    {
        " play involved ": null
    },
    {
        "Babe Ruths called shot": "babe ruths called shot"
    },
    {
        " in 1932, which was accompanied by various Ruthian theatrics, yet the pitcher, ": null
    },
    {
        "Charlie Root": "charlie root"
    },
    {
        ", was allowed to stay in the game. He delivered just one more pitch, which ": null
    },
    {
        "Lou Gehrig": "lou gehrig"
    },
    {
        " drilled out of the park for a back-to-back shot, after which Root was removed from the game.     In Game 3 of the ": null
    },
    {
        "1976 NLCS": "1976 national league championship series"
    },
    {
        ", ": null
    },
    {
        "George Foster": "george foster"
    },
    {
        " and ": null
    },
    {
        "Johnny Bench": "johnny bench"
    },
    {
        " hit back-to-back homers in the last of the ninth off ": null
    },
    {
        "Ron Reed": "ron reed"
    },
    {
        " to tie the game. The Series-winning run was scored later in the inning.     Another notable pair of back-to-back home runs occurred on ": null
    },
    {
        "September 14, 1990": "1990 in baseballevents"
    },
    {
        ", when ": null
    },
    {
        "Ken Griffey, Sr.": "ken griffey, sr."
    },
    {
        " and ": null
    },
    {
        "Ken Griffey, Jr.": "ken griffey, jr."
    },
    {
        " hit back-to-back home runs, off ": null
    },
    {
        "Kirk McCaskill": "kirk mccaskill"
    },
    {
        ", the only father-and-son duo to do so in Major League history.     On ": null
    },
    {
        "May 2, 2002": "2002 in baseballmay"
    },
    {
        ", ": null
    },
    {
        "Bret Boone": "bret boone"
    },
    {
        " and ": null
    },
    {
        "Mike Cameron": "mike cameron"
    },
    {
        " of the ": null
    },
    {
        "Seattle Mariners": "seattle mariners"
    },
    {
        " hit back-to-back home runs off of starter ": null
    },
    {
        "Jon Rauch": "jon rauch"
    },
    {
        " in the first inning of a game against the ": null
    },
    {
        "Chicago White Sox": "chicago white sox"
    },
    {
        ". The Mariners batted around in the inning, and Boone and Cameron came up to bat against reliever ": null
    },
    {
        "Jim Parque": "jim parque"
    },
    {
        " with two outs, again hitting back-to-back home runs and becoming the only pair of teammates to hit back-to-back home runs twice in the same inning.      On June 19, 2012, ": null
    },
    {
        "José Bautista": "josé bautista"
    },
    {
        " and ": null
    },
    {
        "Colby Rasmus": "colby rasmus"
    },
    {
        " hit back-to-back home runs and back-to-back-to-back home runs with ": null
    },
    {
        "Edwin Encarnación": "edwin encarnación"
    },
    {
        " for a lead change in each instance.     On July 23, 2017 Whit Merrifield, Jorge Bonifacio, and Eric Hosmer of the Kansas City Royals hit back to back to back home runs in the fourth inning against the Chicago White Sox. The Royals went on to win the game 5–4.     On June 20, 2018 ": null
    },
    {
        "George Springer": "george springer"
    },
    {
        ", ": null
    },
    {
        "Alex Bregman": "alex bregman"
    },
    {
        ", and ": null
    },
    {
        "José Altuve": "josé altuve"
    },
    {
        " of the Houston Astros hit back to back to back home runs in the sixth inning against the Tampa Bay Rays. The Astros went on to win the game 5–1.     On April 3, 2018, the St. Louis Cardinals began the game against the Milwaukee Brewers with back-to-back homers from Dexter Fowler and Tommy Pham. Then in the bottom of the ninth, with two outs and the Cardinals leading 4–3, Christian Yelich homered to tie the game; and Ryan Braun hit the next pitch for a walk-off homer. This is the only major league game to begin and end with back-to-back homers.     On May 5, 2019, ": null
    },
    {
        "Eugenio Suarez": "eugenio suarez"
    },
    {
        ", ": null
    },
    {
        "Jesse Winker": "jesse winker"
    },
    {
        " and ": null
    },
    {
        "Derek Dietrich": "derek dietrich"
    },
    {
        " of the Cincinnati Reds, hit back-to-back-to-back home runs on three straight pitches against ": null
    },
    {
        "Jeff Samardzija": "jeff samardzija"
    },
    {
        " of the ": null
    },
    {
        "San Francisco Giants": "san francisco giants"
    },
    {
        " in the bottom of the first inning.          The record for consecutive home runs by a batter under any circumstances is four. Of the sixteen players who have hit four in one game, six have hit them consecutively. Twenty-eight other batters have hit four consecutive across two games.     Bases on balls do not count as at-bats, and ": null
    },
    {
        "Ted Williams": "ted williams"
    },
    {
        " holds the record for consecutive home runs across the most games, four in four games played, during September 17–22, 1957, for the Red Sox.  Williams hit a pinch-hit homer on the 17th; walked as a pinch-hitter on the 18th; there was no game on the 19th; hit another pinch-homer on the 20th; homered and then was lifted for a pinch-runner after at least one walk, on the 21st; and homered after at least one walk on the 22nd. All in all, he had four walks interspersed among his four homers.     In ": null
    },
    {
        "World Series": "world series"
    },
    {
        " play, ": null
    },
    {
        "Reggie Jackson": "reggie jackson"
    },
    {
        " hit a record three in one Series game, the final game in 1977. But those three were a part of a much more impressive feat. He walked on four pitches in the second inning of game 6. Then he hit his three home runs on the first pitch of his next three at bats, off of three different pitchers . He had also hit one in his last at bat of the previous game, giving him four home runs on four consecutive swings. The four in a row set the record for consecutive homers across two Series games.     In Game 3 of the World Series in 2011, ": null
    },
    {
        "Albert Pujols": "albert pujols"
    },
    {
        " hit three home runs to tie the record with Babe Ruth and Reggie Jackson. The St. Louis Cardinals went on to win the World Series in Game 7 at Busch Stadium. In Game 1 of the World Series in 2012, ": null
    },
    {
        "Pablo Sandoval": "pablo sandoval"
    },
    {
        " of the ": null
    },
    {
        "San Francisco Giants": "san francisco giants"
    },
    {
        " hit three home runs on his first three at-bats of the Series.     ": null
    },
    {
        "Nomar Garciaparra": "nomar garciaparra"
    },
    {
        " holds the record for consecutive home runs in the shortest time in terms of innings: three homers in two innings, on July 23, 2002, for the ": null
    },
    {
        "Boston Red Sox": "boston red sox"
    },
    {
        ".          An offshoot of ": null
    },
    {
        "hitting for the cycle": "hitting for the cycle"
    },
    {
        ", a home run cycle is where a player hits a solo, 2-run, 3-run, and grand slam all in one game. This is an extremely rare feat, as it requires the batter to not only hit four home runs in a game , but also to hit those home runs with the specific number of runners already on base. Although it is a rare accomplishment, it is largely dependent on circumstances outside the players control, such as his preceding teammates ability to get on base, as well as the order in which he comes to bat in any particular inning.     Another variant of the home run cycle would be the natural home run cycle , which would require a batter to hit a solo, 2-run, 3-run, and grand slam in that order.     Though multiple home run cycles have been recorded in collegiate baseball,   the only home run cycle in a professional baseball game belongs to ": null
    },
    {
        "Tyrone Horne": "tyrone horne"
    },
    {
        ", playing for the ": null
    },
    {
        "minor league": "minor league"
    },
    {
        ", Double-A ": null
    },
    {
        "Arkansas Travelers": "arkansas travelers"
    },
    {
        " in a game against the ": null
    },
    {
        "San Antonio Missions": "san antonio missions"
    },
    {
        " on July 27, 1998.      A major league player has come close to hitting for the home run cycle several times. Recent examples include:   April 2, 1997, ": null
    },
    {
        "Tino Martinez": "tino martinez"
    },
    {
        " of the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        ", was a grand slam away from accomplishing this feat against his former team, the ": null
    },
    {
        "Seattle Mariners": "seattle mariners"
    },
    {
        ". He hit a 3-run home run in the first inning, a 2-run home run in the third inning and a solo shot in the fifth inning; all off starting pitcher ": null
    },
    {
        "Scott Sanders": "scott sanders"
    },
    {
        ".    April 26, 2005 ": null
    },
    {
        "Alex Rodriguez": "alex rodriguez"
    },
    {
        " of the New York Yankees hit 3 home runs off ": null
    },
    {
        "Los Angeles Angels": "los angeles angels"
    },
    {
        " pitcher ": null
    },
    {
        "Bartolo Colón": "bartolo colón"
    },
    {
        ". Rodriguez hit a 3-run home run, 2-run home run, and a grand slam in the first, third, and fourth innings, respectively. Against the Angels bullpen he singled in the sixth inning and flied out with the bases loaded in the eighth inning.     May 16, 2008 ": null
    },
    {
        "Jayson Werth": "jayson werth"
    },
    {
        " of the ": null
    },
    {
        "Philadelphia Phillies": "philadelphia phillies"
    },
    {
        " hit 3 home runs off ": null
    },
    {
        "Toronto Blue Jays": "toronto blue jays"
    },
    {
        " pitchers ": null
    },
    {
        "David Purcey": "david purcey"
    },
    {
        " and ": null
    },
    {
        "Jesse Litsch": "jesse litsch"
    },
    {
        ". Werth hit a 3-run home run, a grand slam, and a solo home run in the second, third, and fifth innings, respectively.    June 26, 2009, ": null
    },
    {
        "Andre Ethier": "andre ethier"
    },
    {
        " of ": null
    },
    {
        "Los Angeles Dodgers": "los angeles dodgers"
    },
    {
        " hit a three-run home run off ": null
    },
    {
        "Jason Vargas": "jason vargas"
    },
    {
        " in the second, a two-run home run off ": null
    },
    {
        "Roy Corcoran": "roy corcoran"
    },
    {
        " in the sixth, and a solo home run off ": null
    },
    {
        "Miguel Batista": "miguel batista"
    },
    {
        " in the eighth inning in a game against Seattle Mariners.    July 7, 2009, ": null
    },
    {
        "Paul Konerko": "paul konerko"
    },
    {
        " of the ": null
    },
    {
        "Chicago White Sox": "chicago white sox"
    },
    {
        " hit a solo home run in the second inning off ": null
    },
    {
        "Cleveland Indians": "cleveland indians"
    },
    {
        " pitcher ": null
    },
    {
        "Jeremy Sowers": "jeremy sowers"
    },
    {
        ", a grand slam in the sixth inning off reliever ": null
    },
    {
        "Chris Perez": "chris perez"
    },
    {
        ", and a two-run home run in the seventh inning off reliever ": null
    },
    {
        "Winston Abreu": "winston abreu"
    },
    {
        ".    August 1, 2009, ": null
    },
    {
        "Andrew McCutchen": "andrew mccutchen"
    },
    {
        " of the ": null
    },
    {
        "Pittsburgh Pirates": "pittsburgh pirates"
    },
    {
        " hit a solo home run in the first inning, a two run home run in the fourth inning, and a three run home run in the sixth inning of a game against the ": null
    },
    {
        "Washington Nationals": "washington nationals"
    },
    {
        ".    September 17, 2010, ": null
    },
    {
        "Shin-Soo Choo": "shin-soo choo"
    },
    {
        " of the Cleveland Indians, hit three home runs against the ": null
    },
    {
        "Kansas City Royals": "kansas city royals"
    },
    {
        ". Choo hit a 2-run homer in the fourth inning, a Grand Slam in the sixth inning and a solo home run in the eighth inning.    June 21, 2015, ": null
    },
    {
        "J.D. Martinez": "j.d. martinez"
    },
    {
        " of the ": null
    },
    {
        "Detroit Tigers": "detroit tigers"
    },
    {
        ", hit three home runs against the New York Yankees. Martinez hit a 2-run homer in the first inning, a solo home run in the fifth inning and a 3-run homer in the sixth inning    August 21, 2015, ": null
    },
    {
        "Yoenis Céspedes": "yoenis céspedes"
    },
    {
        " of the ": null
    },
    {
        "New York Mets": "new york mets"
    },
    {
        ", hit three home runs against the ": null
    },
    {
        "Colorado Rockies": "colorado rockies"
    },
    {
        ": a grand slam in the second inning, a solo home run in the fourth inning, and a two-run home run in the sixth inning.    August 29, 2015, ": null
    },
    {
        "Edwin Encarnación": "edwin encarnación"
    },
    {
        " of the ": null
    },
    {
        "Toronto Blue Jays": "toronto blue jays"
    },
    {
        " hit three home runs against the ": null
    },
    {
        "Detroit Tigers": "detroit tigers"
    },
    {
        ": a 3-run home run in the first inning, a 2-run home run in the sixth inning, and a grand slam in the seventh inning.    September 26, 2015, ": null
    },
    {
        "Jarrett Parker": "jarrett parker"
    },
    {
        " of the ": null
    },
    {
        "San Francisco Giants": "san francisco giants"
    },
    {
        " hit three home runs against the ": null
    },
    {
        "Oakland Athletics": "oakland athletics"
    },
    {
        ": a solo home run in the second inning, a 2-run home run in the seventh inning, and a grand slam in the eighth inning.    June 6, 2017, ": null
    },
    {
        "Scooter Gennett": "scooter gennett"
    },
    {
        " of the ": null
    },
    {
        "Cincinnati Reds": "cincinnati reds"
    },
    {
        " hit four home runs against the ": null
    },
    {
        "St. Louis Cardinals": "st. louis cardinals"
    },
    {
        ": a grand slam in the third inning, a 2-run home run in the fourth inning, a solo home run in the sixth inning, and a 2-run home run in the eighth inning. He had an opportunity for a 3-run home run in the first inning, which resulted in a RBI single.    June 20, 2017, ": null
    },
    {
        "Corey Seager": "corey seager"
    },
    {
        " of the ": null
    },
    {
        "Los Angeles Dodgers": "los angeles dodgers"
    },
    {
        " hit three home runs against the ": null
    },
    {
        "New York Mets": "new york mets"
    },
    {
        ": a 2-run home run in the first inning, a solo home run in the fourth inning, and a three home run in the fifth inning.           In the ": null
    },
    {
        "early days of the game": "history of baseball in the united states"
    },
    {
        ", when the ball was less lively and the ballparks generally had very large outfields, most home runs were of the inside-the-park variety. The first home run ever hit in the ": null
    },
    {
        "National League": "national league"
    },
    {
        " was by Ross Barnes of the Chicago White Stockings , in 1876. The home run was literally descriptive. Home runs over the fence were rare, and only in ballparks where a fence was fairly close. Hitters were discouraged from trying to hit home runs, with the conventional wisdom being that if they tried to do so they would simply fly out. This was a serious concern in the 19th century, because in baseballs early days a ball caught after one bounce was still an out. The emphasis was on place-hitting and what is now called manufacturing runs or small ball .     The home runs place in baseball changed dramatically when the ": null
    },
    {
        "live-ball era": "live-ball era"
    },
    {
        " began after World War I. First, the materials and manufacturing processes improved significantly, making the now-mass-produced, cork-centered ball somewhat more lively. Batters such as ": null
    },
    {
        "Babe Ruth": "babe ruth"
    },
    {
        " and ": null
    },
    {
        "Rogers Hornsby": "rogers hornsby"
    },
    {
        " took full advantage of rules changes that were instituted during the 1920s, particularly prohibition of the ": null
    },
    {
        "spitball": "spitball"
    },
    {
        ", and the requirement that balls be replaced when worn or dirty. These changes resulted in the baseball being easier to see and hit, and easier to hit out of the park. Meanwhile, as the games popularity boomed, more outfield seating was built, shrinking the size of the outfield and increasing the chances of a long fly ball resulting in a home run. The teams with the sluggers, typified by the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        ", became the championship teams, and other teams had to change their focus from the inside game to the power game in order to keep up.     Before 1931, a ball that bounced over an outfield fence during a major league game was considered a home run. The rule was changed to require the ball to clear the fence on the fly, and balls that reached the seats on a bounce became ": null
    },
    {
        "ground rule doubles": "ground rule double"
    },
    {
        "in most parks. A carryover of the old rule is that if a player deflects a ball over the outfield fence without it touching the ground, it is a home run.          Also, until approximately that time, the ball had to not only go over the fence in fair territory, but to land in the ": null
    },
    {
        "bleachers": "bleacher"
    },
    {
        "in fair territory or to still be visibly fair when disappearing behind a wall. The rule stipulated fair when last seen by the ": null
    },
    {
        "umpires": "umpire"
    },
    {
        ". Photos from that era in ballparks, such as the ": null
    },
    {
        "Polo Grounds": "polo grounds"
    },
    {
        " and ": null
    },
    {
        "Yankee Stadium": "yankee stadium"
    },
    {
        ", show ropes strung from the foul poles to the back of the bleachers, or a second foul pole at the back of the bleachers, in a straight line with the foul line, as a visual aid for the umpire. Ballparks still use a visual aid much like the ropes; a net or screen attached to the foul poles on the fair side has replaced ropes. As with American football, where a touchdown once required a literal touch down of the ball in the end zone but now only requires the breaking of the plane of the goal line, in baseball the ball need only break the plane of the fence in fair territory .     ": null
    },
    {
        "Babe Ruths": "babe ruth"
    },
    {
        "60th home run in 1927 was somewhat controversial, because it landed barely in fair territory in the stands down the ": null
    },
    {
        "right field": "right field"
    },
    {
        " line. Ruth lost a number of home runs in his career due to the when-last-seen rule. Bill Jenkinson, in The Year Babe Ruth Hit 104 Home Runs, estimates that Ruth lost at least 50 and as many as 78 in his career due to this rule.     Further, the rules once stipulated that an over-the-fence home run in a sudden-victory situation would only count for as many bases as was necessary to force the winning run home. For example, if a team trailed by two runs with the bases loaded, and the batter hit a fair ball over the fence, it only counted as a triple, because the runner immediately ahead of him had technically already scored the game-winning run. That rule was changed in the 1920s as home runs became increasingly frequent and popular. Babe Ruths career total of 714 would have been one higher had that rule not been in effect in the early part of his career.       Major League Baseball keeps running totals of all-time home runs by team, including teams no longer active as well as by individual players. ": null
    },
    {
        "Gary Sheffield": "gary sheffield"
    },
    {
        " hit the 250,000th home run in MLB history with a grand slam on September 8, 2008.  Sheffield had hit MLBs 249,999th home run against ": null
    },
    {
        "Gio González": "gio gonzález"
    },
    {
        " in his previous at-bat.     The all-time, verified professional baseball record for career home runs for one player, excluding the U.S. Negro Leagues during the era of segregation, is held by ": null
    },
    {
        "Sadaharu Oh": "sadaharu oh"
    },
    {
        ". Oh spent his entire career playing for the ": null
    },
    {
        "Yomiuri Giants": "yomiuri giants"
    },
    {
        " in Japans ": null
    },
    {
        "Nippon Professional Baseball": "nippon professional baseball"
    },
    {
        ", later managing the Giants, the ": null
    },
    {
        "Fukuoka SoftBank Hawks": "fukuoka softbank hawks"
    },
    {
        " and the 2006 World Baseball Classic Japanese team. Oh holds the all-time home run world record, having hit 868 home runs in his career.     In ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        ", the career record is 762, held by ": null
    },
    {
        "Barry Bonds": "barry bonds"
    },
    {
        ", who broke Hank Aarons record on August 7, 2007, when he hit his 756th home run at ": null
    },
    {
        "AT & T Park": "at & t park"
    },
    {
        " off pitcher ": null
    },
    {
        "Mike Bacsik": "mike bacsik"
    },
    {
        ". Although Major League Baseball recognizes these records as official, some baseball historians decline to accept records accumulated by players like Barry Bonds, Mark McGwire, Sammy Sosa and others with the alleged assistance of ": null
    },
    {
        "steroids": "steroids"
    },
    {
        " or other ": null
    },
    {
        "performance-enhancing drugs": "performance-enhancing drugs"
    },
    {
        " Only eight other major league players have hit as many as 600: ": null
    },
    {
        "Hank Aaron": "hank aaron"
    },
    {
        " , ": null
    },
    {
        "Babe Ruth": "babe ruth"
    },
    {
        " , ": null
    },
    {
        "Alex Rodriguez": "alex rodriguez"
    },
    {
        " , ": null
    },
    {
        "Willie Mays": "willie mays"
    },
    {
        " , ": null
    },
    {
        "Albert Pujols": "albert pujols"
    },
    {
        " , ": null
    },
    {
        "Ken Griffey, Jr.": "ken griffey, jr."
    },
    {
        " , ": null
    },
    {
        "Jim Thome": "jim thome"
    },
    {
        " , and ": null
    },
    {
        "Sammy Sosa": "sammy sosa"
    },
    {
        " ; Pujols holds the record for active MLB players.     The single season record is 73, set by Barry Bonds in 2001. Other notable single season records were achieved by Babe Ruth who hit 60 in 1927, ": null
    },
    {
        "Roger Maris": "roger maris"
    },
    {
        ", with 61 home runs in 1961, and ": null
    },
    {
        "Mark McGwire": "mark mcgwire"
    },
    {
        ", who hit 70 in 1998.     ": null
    },
    {
        "Negro League": "negro league baseball"
    },
    {
        " slugger ": null
    },
    {
        "Josh Gibsons": "josh gibson"
    },
    {
        "Baseball Hall of Fame plaque says he hit almost 800 home runs in his career. The  Guinness Book of World Records  lists Gibsons lifetime home run total at 800. Ken Burns award-winning series,  Baseball , states that his actual total may have been as high as 950. Gibsons true total is not known, in part due to inconsistent record keeping in the Negro Leagues. The 1993 edition of the MacMillan Baseball Encyclopedia attempted to compile a set of Negro League records, and subsequent work has expanded on that effort. Those records demonstrate that Gibson and Ruth were of comparable power. The 1993 book had Gibson hitting 146 home runs in the 501 official Negro League games they were able to account for in his 17-year career, about 1 homer every 3.4 games. Babe Ruth, in 22 seasons , hit 714 in 2503 games, or 1 homer every 3.5 games. The large gap in the numbers for Gibson reflect the fact that Negro League clubs played relatively far fewer league games and many more barnstorming or exhibition games during the course of a season, than did the major league clubs of that era.     Other legendary home run hitters include ": null
    },
    {
        "Jimmie Foxx": "jimmie foxx"
    },
    {
        ", ": null
    },
    {
        "Mel Ott": "mel ott"
    },
    {
        ", ": null
    },
    {
        "Ted Williams": "ted williams"
    },
    {
        ", ": null
    },
    {
        "Mickey Mantle": "mickey mantle"
    },
    {
        " , ": null
    },
    {
        "Reggie Jackson": "reggie jackson"
    },
    {
        ", ": null
    },
    {
        "Harmon Killebrew": "harmon killebrew"
    },
    {
        ", ": null
    },
    {
        "Ernie Banks": "ernie banks"
    },
    {
        ", ": null
    },
    {
        "Mike Schmidt": "mike schmidt"
    },
    {
        ", ": null
    },
    {
        "Dave Kingman": "dave kingman"
    },
    {
        ", ": null
    },
    {
        "Sammy Sosa": "sammy sosa"
    },
    {
        " , ": null
    },
    {
        "Ken Griffey, Jr.": "ken griffey, jr."
    },
    {
        " and ": null
    },
    {
        "Eddie Mathews": "eddie mathews"
    },
    {
        ". In 1987, ": null
    },
    {
        "Joey Meyer": "joey meyer"
    },
    {
        " of the ": null
    },
    {
        "Denver Zephyrs": "denver zephyrs"
    },
    {
        " hit the longest verifiable home run in professional baseball history.      The location of where Hank Aarons record 755th home run landed has been monumented in Milwaukee.  The spot sits outside Miller Park, where the Milwaukee Brewers currently play. Similarly, the point where Aarons 715th homer landed, upon breaking Ruths career record in 1974, is marked in the ": null
    },
    {
        "Turner Field": "turner field"
    },
    {
        " parking lot. A red-painted seat in ": null
    },
    {
        "Fenway Park": "fenway park"
    },
    {
        " marks the landing place of the 502-ft home run ": null
    },
    {
        "Ted Williams": "ted williams"
    },
    {
        " hit in 1946, the longest measured homer in Fenways history; a red stadium seat mounted on the wall of the ": null
    },
    {
        "Mall of America": "mall of america"
    },
    {
        " in Bloomington, Minnesota, marks the landing spot of ": null
    },
    {
        "Harmon Killebrews": "harmon killebrew"
    },
    {
        "record 520-foot shot in old ": null
    },
    {
        "Metropolitan Stadium": "metropolitan stadium"
    },
    {
        ".     May 2019 saw 1,135 MLB home runs, the highest ever number of home runs in a single month in Major League Baseball history. During this month, 44.5% of all runs came during a homer, breaking the previous record of 42.3%.           Replays to get the call right have been used extremely sporadically in the past, but the use of instant replay to determine boundary calls —home runs and foul balls—was not officially allowed until 2008.     In a game on May 31, 1999, involving the ": null
    },
    {
        "St. Louis Cardinals": "st. louis cardinals"
    },
    {
        " and ": null
    },
    {
        "Florida Marlins": "florida marlins"
    },
    {
        ", a hit by ": null
    },
    {
        "Cliff Floyd": "cliff floyd"
    },
    {
        " of the Marlins was initially ruled a double, then a home run, then was changed back to a double when umpire ": null
    },
    {
        "Frank Pulli": "frank pulli"
    },
    {
        " decided to review video of the play. The Marlins protested that video replay was not allowed, but while the National League office agreed that replay was not to be used in future games, it declined the protest on the grounds it was a judgment call, and the play stood.       In November 2007, the ": null
    },
    {
        "general managers": "general manager"
    },
    {
        " of Major League Baseball voted in favor of implementing ": null
    },
    {
        "instant replay": "instant replay"
    },
    {
        " reviews on boundary home run calls.  The proposal limited the use of instant replay to determining whether a boundary/home run call is:   A fair or foul ball   A live ball , ": null
    },
    {
        "ground rule double": "ground rule double"
    },
    {
        " , or home run    ": null
    },
    {
        "Spectator interference": "spectator interference"
    },
    {
        " or home run .     On August 28, 2008, instant replay review became available in MLB for reviewing calls in accordance with the above proposal. It was first utilized on September 3, 2008 in a game between the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " and the ": null
    },
    {
        "Tampa Bay Rays": "tampa bay rays"
    },
    {
        " at ": null
    },
    {
        "Tropicana Field": "tropicana field"
    },
    {
        ".  ": null
    },
    {
        "Alex Rodriguez": "alex rodriguez"
    },
    {
        " of the Yankees hit what appeared to be a home run, but the ball hit a catwalk behind the foul pole. It was at first called a home run, until Tampa Bay manager ": null
    },
    {
        "Joe Maddon": "joe maddon"
    },
    {
        " argued the call, and the umpires decided to review the play. After 2 minutes and 15 seconds, the umpires came back and ruled it a home run.     About two weeks later, on September 19, also at Tropicana Field, a boundary call was overturned for the first time. In this case, ": null
    },
    {
        "Carlos Peña": "carlos peña"
    },
    {
        " of the Rays was given a ground rule double in a game against the ": null
    },
    {
        "Minnesota Twins": "minnesota twins"
    },
    {
        " after an umpire believed a fan reached into the field of play to catch a fly ball in right field. The umpires reviewed the play, determined the fan did not reach over the fence, and reversed the call, awarding Peña a home run.     Aside from the two aforementioned reviews at Tampa Bay, replay was used four more times in the 2008 MLB regular season: twice at Houston, once at Seattle, and once at San Francisco. The San Francisco incident is perhaps the most unusual. ": null
    },
    {
        "Bengie Molina": "bengie molina"
    },
    {
        ", the Giants catcher, hit what was first called a single. Molina then was replaced in the game by Emmanuel Burriss, a pinch-runner, before the umpires re-evaluated the call and ruled it a home run. In this instance though, Molina was not allowed to return to the game to complete the run, as he had already been replaced. Molina was credited with the home run, and two RBIs, but not for the run scored which went to Burriss instead.     On October 31, 2009, in the fourth inning of Game 3 of the World Series, Alex Rodriguez hit a long fly ball that hit a camera protruding over the wall and into the field of play in deep right field. The ball ricocheted off the camera and re-entered the field, initially ruled a double. However, after the umpires consulted with each other after watching the instant replay, the hit was ruled a home run, marking the first time an instant replay home run was hit in a playoff game. ": null
    }
]