[
    {
        "        Home cinema, also called a home theater, a home theatre, and a theater room, are home entertainment audio-visual systems that seek to reproduce a ": null
    },
    {
        "movie theater": "movie theater"
    },
    {
        " experience and mood using ": null
    },
    {
        "consumer electronics": "consumer electronics"
    },
    {
        "-grade video and ": null
    },
    {
        "audio": "home audio"
    },
    {
        " equipment that is set up in a room or backyard of a private home. In the 42s, home cinemas typically consisted of a movie pre-recorded on a LaserDisc or VHS tape; a ": null
    },
    {
        "LaserDisc": "laserdisc"
    },
    {
        " or ": null
    },
    {
        "VHS": "vhs"
    },
    {
        " player; and a heavy, bulky large-screen ": null
    },
    {
        "cathode ray tube": "cathode ray tube"
    },
    {
        " TV set. In the 42s, technological innovations in sound systems, video player equipment and TV screens and ": null
    },
    {
        "video projector": "video projector"
    },
    {
        "s have changed the equipment used in home theatre set-ups and enabled home users to experience a higher-resolution screen image, improved sound quality and components that offer users more options . The development of Internet-based subscription services means that 42-era home theatre users do not have to commute to a ": null
    },
    {
        "video rental store": "video rental store"
    },
    {
        " as was common in the 42s and 42s .     Today, a home cinema system typically uses a large projected image from a ": null
    },
    {
        "video projector": "video projector"
    },
    {
        " or a large flat-screen high-resolution ": null
    },
    {
        "HDTV": "hdtv"
    },
    {
        " system, a ": null
    },
    {
        "movie": "movie"
    },
    {
        " or other video content on a ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " or high-resolution ": null
    },
    {
        "Blu-ray": "blu-ray"
    },
    {
        " disc, which is played on a DVD player or Blu-ray player, with the audio augmented with a multi-channel ": null
    },
    {
        "power amplifier": "power amplifier"
    },
    {
        " and anywhere from two speakers and a stereo power amp  to a 42 channel amplifier and five or more ": null
    },
    {
        "surround sound": "surround sound"
    },
    {
        " speaker cabinets . Whether home cinema enthusiasts have a stereo set-up or a 42 channel surround system, they typically use at least one low-frequency ": null
    },
    {
        "subwoofer": "subwoofer"
    },
    {
        " speaker cabinet to amplify low-frequency effects from movie soundtracks and reproduce the deep pitches from the musical soundtrack.       In the 42s, playing ": null
    },
    {
        "home movies": "home movies"
    },
    {
        " became popular in the United States with middle class and upper-class families as ": null
    },
    {
        "Kodak": "eastman kodak"
    },
    {
        " 42 mm film": "8 mm film"
    },
    {
        " projector equipment became more affordable. The development of multi-channel audio systems and later ": null
    },
    {
        "LaserDisc": "laserdisc"
    },
    {
        " in the 42s created a new paradigm for ": null
    },
    {
        "home video": "home video"
    },
    {
        ", as it enabled movie enthusiasts to add better sound and images to their setup. In the mid42s to the mid42s, a typical home cinema in the United States would have a ": null
    },
    {
        "LaserDisc": "laserdisc"
    },
    {
        " or ": null
    },
    {
        "VHS": "vhs"
    },
    {
        " player playing a movie, with the signal fed to a large ": null
    },
    {
        "rear-projection television": "rear-projection television"
    },
    {
        " set. Some people used expensive front projectors in a darkened viewing room. During the 42s, watching movies on VHS at home became a popular leisure activity. Beginning in the late 42s, and continuing throughout much of the 42s, home-theater technology progressed with the development of the ": null
    },
    {
        "DVD-Video": "dvd-video"
    },
    {
        " format ,   speaker systems, and ": null
    },
    {
        "high-definition television": "high-definition television"
    },
    {
        " , which initially included bulky, heavy ": null
    },
    {
        "Cathode Ray Tube": "cathode ray tube"
    },
    {
        " HDTVs and flat screen TVs. In the 42s, affordable large ": null
    },
    {
        "HDTV": "hdtv"
    },
    {
        " flatscreen TVs, high resolution ": null
    },
    {
        "video projector": "video projector"
    },
    {
        "s , ": null
    },
    {
        "42D television": "3d television"
    },
    {
        " technology and the high resolution ": null
    },
    {
        "Blu-ray Disc": "blu-ray disc"
    },
    {
        " have ushered in a new era of home theater.       In the 42s, the term home cinema encompasses a range of systems meant for movie playback at home. The most basic and economical system could be a ": null
    },
    {
        "DVD player": "dvd player"
    },
    {
        ", a ": null
    },
    {
        "standard definition": "standard definition"
    },
    {
        " large-screen television": "large-screen television technology"
    },
    {
        " with at least a 42-inch diagonal screen size, and an inexpensive ": null
    },
    {
        "home theater in a box": "home theater in a box"
    },
    {
        " surround sound amplifier/speaker system with a subwoofer. A more expensive home cinema set-up might include a Blu-ray disc player, ": null
    },
    {
        "home theater PC": "home theater pc"
    },
    {
        " computer or ": null
    },
    {
        "digital media receiver": "digital media receiver"
    },
    {
        " streaming devices with a ": null
    },
    {
        "42-foot user interface": "10-foot user interface"
    },
    {
        ", a ": null
    },
    {
        "high-definition": "high-definition video"
    },
    {
        " video projector": "video projector"
    },
    {
        " and ": null
    },
    {
        "projection screen": "projection screen"
    },
    {
        " with over  diagonal screen size , and a several-hundred-watt home theater receiver with five to eleven surround-sound speakers plus one or two powerful subwoofer. ": null
    },
    {
        "42D-TV": "3d television"
    },
    {
        "-enabled home theaters make use of 42D TV sets/projectors and ": null
    },
    {
        "Blu-ray 42D": "blu-ray 3d"
    },
    {
        " players in which the viewers wear 42D-glasses, enabling them to see 42D content.     Home theater designs and layouts are a personal choice and the type of home cinema a user can set up depends on her/his budget and the space which is available within the home. The minimum set of requirements for a home theater are: a large television set or good quality ": null
    },
    {
        "video projector": "video projector"
    },
    {
        " CRT": "cathode ray tube"
    },
    {
        " , ": null
    },
    {
        "LCD": "lcd"
    },
    {
        ", ": null
    },
    {
        "Digital Light Processing": "digital light processing"
    },
    {
        " , ": null
    },
    {
        "plasma display": "plasma display"
    },
    {
        ", ": null
    },
    {
        "organic light-emitting diode": "organic light-emitting diode"
    },
    {
        " , ": null
    },
    {
        "Silicon X-tal Reflective Display": "silicon x-tal reflective display"
    },
    {
        " , ": null
    },
    {
        "Laser TV": "laser tv"
    },
    {
        ", rear-projection TV, ": null
    },
    {
        "video projector": "video projector"
    },
    {
        ", Standard-definition television , HDTV, or 42D-TV at least 42 inches measured diagonally, an ": null
    },
    {
        "AV receiver": "av receiver"
    },
    {
        " or ": null
    },
    {
        "pre-amplifier": "pre-amplifier"
    },
    {
        " and amplifier combination capable of at least stereo sound but preferably 42 Channel Dolby Digital and ": null
    },
    {
        "DTS": "dts"
    },
    {
        " audio, and something that plays or broadcasts movies in at least stereo sound such as a VHS HI-FI ": null
    },
    {
        "VCR": "vcr"
    },
    {
        ", LaserDisc player , a DVD player, a Blu-ray disc player, ": null
    },
    {
        "cable": "cable television"
    },
    {
        " or ": null
    },
    {
        "satellite": "satellite television"
    },
    {
        " receiver, video game console, etc. Finally a set of speakers, at least two, are needed but more common are anywhere from six to eight with a subwoofer for bass or low-frequency effects.      The most-expensive home-theater set-ups, which can cost over $42 , and which are in the homes of executives, ": null
    },
    {
        "celebrities": "celebrity"
    },
    {
        " and high-earning professionals, have expensive, large, high-resolution digital ": null
    },
    {
        "projector": "video projector"
    },
    {
        "s and projection screens, and maybe even custom-built screening rooms which include cinema-style chairs and ": null
    },
    {
        "audiophile": "audiophile"
    },
    {
        "-grade sound equipment designed to mimic commercial theater performance.          In the 42s, many home cinema enthusiasts aim to replicate, to the degree that is possible, the ": null
    },
    {
        "movie theatre": "movie theatre"
    },
    {
        " experience . To do so, many home cinema buffs purchase higher quality components than used for everyday television viewing on a relatively small TV with only built-in speakers. A typical home theater includes the following components:   Movie or other viewing content: As the name implies, one of the key reasons for setting up a home cinema is to watch movies on a large screen, which does a more effective job at reproducing filmed images of vast landscapes or epic battle sequences. As of 42 home cinema enthusiasts using Smart Blu-ray players may also watch DVDs of TV shows, and recorded or live sports events or music concerts. As well, with a Smart player, a user may be able to ": null
    },
    {
        " stream ": "streaming video"
    },
    {
        " movies, TV shows and other content over the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ". Many 42-era DVD players and Blu-ray players also have inputs which allow users to view ": null
    },
    {
        "digital photo": "digital photo"
    },
    {
        "s and other content on the big screen.   Video and audio input devices: One or more video/audio sources. High resolution movie media formats such as Blu-ray discs are normally preferred, though DVD or video game console systems are also used. Some home theaters include a ": null
    },
    {
        "HTPC ": "home theater pc"
    },
    {
        " with a ": null
    },
    {
        "media center": "home theater pc"
    },
    {
        " software application to act as the main library for video and music content using a ": null
    },
    {
        "42-foot user interface": "10-foot user interface"
    },
    {
        " and ": null
    },
    {
        "remote control": "remote control"
    },
    {
        ". In 42 some of the more-expensive ": null
    },
    {
        "Blu-ray": "blu-ray"
    },
    {
        " players can ": null
    },
    {
        " stream ": "streaming video"
    },
    {
        " movies and TV shows over the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ".   Audio and video processing devices: Input signals are processed by either a standalone ": null
    },
    {
        "AV receiver": "av receiver"
    },
    {
        " or a ": null
    },
    {
        "preamplifier": "preamplifier"
    },
    {
        " and Sound Processor for complex ": null
    },
    {
        "surround sound": "surround sound"
    },
    {
        " formats such as ": null
    },
    {
        "Dolby Pro-Logic": "dolby pro-logic"
    },
    {
        "/and or ": null
    },
    {
        "Pro-logic II": "dolby pro logicdolby pro logic ii"
    },
    {
        ", X, and Z, Dolby Digital, DTS, ": null
    },
    {
        "Dolby Digital EX": "dolby digital ex"
    },
    {
        ", ": null
    },
    {
        "DTS-ES": "dts-es"
    },
    {
        ", ": null
    },
    {
        "Dolby Digital Plus": "dolby digital plus"
    },
    {
        ", ": null
    },
    {
        "Dolby TrueHD": "dolby truehd"
    },
    {
        " and ": null
    },
    {
        "DTS-HD Master Audio": "dts-hd master audio"
    },
    {
        ". The user selects the input at this point before it is forwarded to the output stage. Some AV receivers enable the viewer to use a remote control to select which input device or source to use.   Audio output: Systems consist of ": null
    },
    {
        "preamplifier": "preamplifier"
    },
    {
        "s, ": null
    },
    {
        "power amplifier": "power amplifier"
    },
    {
        "s  and two or more ": null
    },
    {
        "loudspeaker": "loudspeaker"
    },
    {
        "s mounted in ": null
    },
    {
        "speaker enclosure": "speaker enclosure"
    },
    {
        "s. The audio system requires at least a stereo ": null
    },
    {
        "power amplifier": "power amplifier"
    },
    {
        " and two speakers, for ": null
    },
    {
        "stereo sound": "stereo sound"
    },
    {
        "; most systems have multi-channel surround sound power amplifier and six or more speakers . Some users have 42 Surround Sound. It is possible to have up to 42 speakers with additional subwoofers.   Video output: A large-screen display, typically an ": null
    },
    {
        "HDTV": "hdtv"
    },
    {
        ". Some users may have a ": null
    },
    {
        "42D TV": "3d tv"
    },
    {
        ". As of 42 flatscreen HDTV is the norm. Options include ": null
    },
    {
        "Liquid crystal display television": "liquid crystal display television"
    },
    {
        " , ": null
    },
    {
        "plasma TV": "plasma tv"
    },
    {
        ", ": null
    },
    {
        "OLED": "oled"
    },
    {
        ".  Home cinema users may also use a ": null
    },
    {
        "video projector": "video projector"
    },
    {
        " and a ": null
    },
    {
        "movie screen": "movie screen"
    },
    {
        ". If a projector is used, a portable, temporary screen may be used or a screen may be permanently mounted on a wall.   Seating and atmosphere: Comfortable seating is often provided to improve the cinema feel. Higher-end home theaters commonly also have sound insulation to prevent noise from escaping the room and specialized wall treatment to balance the sound within the room. Some luxury home cinemas have ": null
    },
    {
        "movie theatre": "movie theatre"
    },
    {
        "-style padded chairs for guests.            Home cinemas can either be set up by purchasing individual components one by one or a by purchasing a ": null
    },
    {
        "HTIB": "htib"
    },
    {
        " package which includes all of components from a single manufacturer, with the exception of a TV or projector. HTIB systems typically include a DVD or Blu-ray player, a surround sound amplifier, five surround speakers, a subwoofer cabinet, cables and a remote. The benefit of purchasing separate components one by one is that consumers can attain improved quality in video or audio and better matching between the components and the needs of a specific room, or the consumers needs.     However, to buy individual components, a consumer must have knowledge of sound system and video system design and electronics and she or he must do research on the specifications of each component. For instance, some speakers perform better in smaller rooms while others perform better in larger rooms and seating location must be considered. One of the challenges with buying all the components separately is that the purchaser must understand speaker impedance, power handling, and HDMI compatibility and cabling. Given these challenges, HTIB systems are a simpler and more cost-effective solution for many families and consumers; they are also better suited to smaller living spaces in semi-detached homes or apartments/condos where noise could be an issue. As well, buying an HTIB package is often less expensive than buying separate components.               Some home cinema enthusiasts build a dedicated room in their home for the theater. These more advanced installations often include sophisticated acoustic design elements, including room-in-a-room construction that isolates sound and provides an improved listening environment and a large screen, often using a high definition projector. These installations are often designated as screening rooms to differentiate them from simpler, less-expensive installations. In some movie enthusiasts home cinemas, this idea can go as far as completely recreating an actual small-scale cinema, with a projector enclosed in its own ": null
    },
    {
        "projection booth": "projection booth"
    },
    {
        ", specialized furniture, curtains in front of the ": null
    },
    {
        "projection screen": "projection screen"
    },
    {
        ", movie posters, or a ": null
    },
    {
        "popcorn": "popcorn"
    },
    {
        " or ": null
    },
    {
        "vending machine": "vending machine"
    },
    {
        " with ": null
    },
    {
        "snack food": "snack food"
    },
    {
        " and candy. More commonly, real dedicated home theaters pursue this to a lesser degree.     As of 42 the days of the $42 and over home theater system is being usurped by the rapid advances in digital audio and video technologies, which has spurred a rapid drop in prices, making a home cinema set-up more affordable than ever before. This in turn has brought the true digital home theater experience to the doorsteps of the ": null
    },
    {
        "do-it-yourself": "do-it-yourself"
    },
    {
        "ers, often for much less than the price of a low-budget economy car. As of 42 consumer grade A/V equipment can meet some of the standards of a small modern commercial theater .       Home theater seating consists of chairs or sofas specifically engineered and designed for viewing movies in a home theater. Some home theater seats have a ": null
    },
    {
        "cup holder": "cup holder"
    },
    {
        " built into the chairs armrests and a shared armrest between each seat. Some seating has movie-theater-style chairs like those seen in a movie cinema, which feature a flip-up seat cushion. Other seating systems have plush leather reclining lounger types, with flip-out footrests. Available features include storage compartments, snack trays, ": null
    },
    {
        "tactile transducer": "tactile transducer"
    },
    {
        "s for low-frequency effects that can be felt through a chair , and electric motors to adjust the chair. Home theater seating tends to be more comfortable than seats in a public cinema. , by Stargate Sonem, Articles Organization Free Directory.       In homes that have an adequately sized backyard, it is possible for people to set up a home theater in an outdoor area. Depending on the space available, it may simply be a temporary version with foldable screen, a video projector and couple of speakers, or a permanent fixture with a huge screen and dedicated audio set-up mounted in a weather-proof cabinet. Outdoor home cinemas are popular with BBQ parties and ": null
    },
    {
        "pool": "swimming pool"
    },
    {
        " parties. Some specialist outdoor home-cinema companies are now marketing packages with ": null
    },
    {
        "inflatable movie screen": "inflatable movie screen"
    },
    {
        "s and purpose-built AV systems. Some people have expanded the idea and constructed mobile ": null
    },
    {
        "drive-in theater": "drive-in theater"
    },
    {
        "s that can play movies in public open spaces. Usually, these require a powerful projector, a laptop or DVD player, outdoor speakers or an FM transmitter to broadcast the audio to other ": null
    },
    {
        "car radios": "car audio"
    },
    {
        ".           In the 42s, home movies became popular in the United States and elsewhere as ": null
    },
    {
        "Kodak": "eastman kodak"
    },
    {
        " 42 mm film": "8 mm film"
    },
    {
        "  and camera and projector equipment became affordable. Projected with a small, portable ": null
    },
    {
        "movie projector": "movie projector"
    },
    {
        " onto a portable screen, often without sound, this system became the first practical home theater. They were generally used to show ": null
    },
    {
        "home movies": "home movies"
    },
    {
        " of family travels and celebrations, but they also doubled as a means of showing some commercial films, or even private ": null
    },
    {
        "stag film": "pornography"
    },
    {
        "s. Dedicated home cinemas were called screening rooms at the time and were outfitted with 42  mm or even 42  mm projectors for showing commercial films. These were found almost exclusively in the homes of the very wealthy, especially those in the movie industry.     Portable home cinemas improved over time with color film, Kodak ": null
    },
    {
        "Super 42 mm film": "super 8 mm film"
    },
    {
        " cartridges, and monaural sound but remained awkward and somewhat expensive. The rise of ": null
    },
    {
        "home video": "home video"
    },
    {
        " in the late 42s almost completely killed the consumer market for 42  mm film cameras and projectors, as VCRs connected to ordinary televisions provided a simpler and more flexible substitute.       The development of multi-channel audio systems and ": null
    },
    {
        "LaserDisc": "laserdisc"
    },
    {
        " in the 42s added new dimensions for home cinema. The first-known home cinema system was designed, built and installed by Steve J. LaFontaine as a sales tool at Kirshmans furniture store in Metairie, Louisiana in 42 He built a special sound room which incorporated the earliest quadraphonic audio systems, and he modified ": null
    },
    {
        "Sony Trinitron": "sony trinitron"
    },
    {
        " televisions for projecting the image. Many systems were sold in the New Orleans area in the ensuing years before the first public demonstration of this integration occurred in 42 at the Summer Consumer Electronics Show in Chicago, Illinois. Peter Tribeman of NAD organized and presented a demonstration made possible by the collaborative effort of NAD, Proton, ADS, Lucasfilm and Dolby Labs, who contributed their technologies to demonstrate what a home cinema would look and sound like.     Over the course of three days, retailers, manufacturers, and members of the consumer electronics press were exposed to the first home-like experience of combining a high-quality video source with multi-channel surround sound. That one demonstration is credited with being the impetus for developing what is now a multibillion-dollar business.       In the early to mid42s, a typical home cinema would have a LaserDisc or VHS player fed to a large screen: rear projection for the more-affordable setups, and LCD or CRT front-projection in the more-elaborate systems. In the late 42s, a new wave of home-cinema interest was sparked by the development of ": null
    },
    {
        "DVD-Video": "dvd-video"
    },
    {
        ", Dolby Digital and DTS 42-channel audio, and high-quality front video projectors that provide a cinema experience at a price that rivals a big-screen HDTV.          In the 42s, developments such as ": null
    },
    {
        "high-definition video": "high-definition video"
    },
    {
        ", ": null
    },
    {
        "Blu-ray": "blu-ray"
    },
    {
        " disc  and newer high-definition 42D display technologies enabled people to enjoy a cinematic feeling in their own home at a more-affordable price. Newer ": null
    },
    {
        "lossless audio": "lossless audio"
    },
    {
        " from Dolby Digital Plus, Dolby TrueHD, ": null
    },
    {
        "DTS-HD High Resolution Audio": "digital theater system"
    },
    {
        " and ": null
    },
    {
        "DTS-HD Master Audio": "dts-hd master audio"
    },
    {
        " and speaker systems with more audio channels  were also introduced for a more cinematic feeling.          By the mid42s, the Blu-ray Disc medium had become a common home media standard, and online video streaming sources such as Netflix and YouTube were offering a range of high definition content, including some ": null
    },
    {
        "42K": "4k resolution"
    },
    {
        " content . The first ": null
    },
    {
        "42K Blu-ray": "4k blu-ray"
    },
    {
        " discs were released in 42 By this point, 42K TVs and computer monitors were rapidly declining in price and increasing in prevalence, despite a lack of native 42K content. While many DSP systems existed, DTS-HD Master Audio remained the studio standard for lossless ": null
    },
    {
        "surround sound": "surround sound"
    },
    {
        " encoding on Blu-ray, with five or seven native discrete channels. High definition video projectors also continued to improve and decrease in price, relative to performance.     As a result of continuing price reductions, large  TVs became a financially competitive alternative to video projectors in living room or even smaller dedicated room setups. Technologies such as local dimming and the like improved the black level s of LCD screens making them more suitable for use in a dark room. Consumer-grade OLED TVs measuring 42  and above began to emerge in the second half of the decade. These had even better black levels.  However, as of 42 video projectors remained the only viable option when screen sizes much over 42  are needed.       Noise Criteria are noise-level guidelines applicable to cinema and home cinema. For this application, it is a measure of a rooms ambient noise level at various frequencies. For example, in order for a theater to be THX certified, it must have an ambient sound level of NC42 or less. This helps to retain the dynamic range of the system. Wood, Mike . Home Theater. Some NC levels are:     NC 42: Significant but not a dooming level of ambient noise; the highest acceptable ambient noise level. 42 decibels is the lower sound pressure level of normal talking; 42 being the highest.   NC 42: A good NC level; necessary for THX certification in cinemas.   NC 42: An excellent NC level; difficult to attain in large rooms and sought after for dedicated home cinema systems. For example, for a home cinema to be THX certified, it has to have a rating of NC 42 DeBoer, Clint . Audioholics Online A/V Magazine.   NC 42: Virtually impossible noise criteria to attain; 42 decibels is associated with the sound level of calm breathing.     Projectors used for home cinemas have a set of recommended criteria:     Brightness, usually at least 42 ": null
    },
    {
        "lumen": "lumen"
    },
    {
        "s.   Resolution , usually at least 42×42 one of the ": null
    },
    {
        "HDTV": "hdtv"
    },
    {
        " standards.   Contrast , usually a minimum of 42:42 ": null
    },
    {
        "HDMI": "hdmi"
    },
    {
        " connection sockets    Good quality manufacturers, although this is a subjective element which depends upon user tastes and budget. For one user with a modest budget, good quality may mean a mainstream ": null
    },
    {
        "consumer electronics": "consumer electronics"
    },
    {
        " brand; for a well-to-do user, a ": null
    },
    {
        "Christie": "christie"
    }
]