[
    {
        "      Quintus Horatius Flaccus , known in the English-speaking world as Horace , was the leading ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " lyric poet": "lyric poetry"
    },
    {
        " during the time of ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        " . The rhetorician ": null
    },
    {
        "Quintilian": "quintilian"
    },
    {
        " regarded his  Odes  as just about the only Latin lyrics worth reading: He can be lofty sometimes, yet he is also full of charm and grace, versatile in his figures, and felicitously daring in his choice of words. Quintilian 10.1.96. The only other lyrical poet Quintilian thought comparable with Horace was the now obscure poet/metrical theorist, ": null
    },
    {
        "Caesius Bassus": "caesius bassus"
    },
    {
        "      Horace also crafted elegant ": null
    },
    {
        "hexameter verses": "prosody"
    },
    {
        "  and caustic ": null
    },
    {
        "iambic poetry": "iambus"
    },
    {
        " . The hexameters are amusing yet serious works, friendly in tone, leading the ancient satirist ": null
    },
    {
        "Persius": "persius"
    },
    {
        " to comment: as his friend laughs, Horace slyly puts his finger on his every fault; once let in, he plays about the heartstrings . Translated from Persius own Satires 1.116–17: omne vafer vitium ridenti Flaccus amico / tangit et admissus circum praecordia ludit.     His career coincided with Romes momentous change from a ": null
    },
    {
        "republic": "republic"
    },
    {
        " to an ": null
    },
    {
        "empire": "empire"
    },
    {
        ". An officer in the republican army defeated at the ": null
    },
    {
        "Battle of Philippi": "battle of philippi"
    },
    {
        " in 42 BC, he was befriended by Octavians right-hand man in civil affairs, ": null
    },
    {
        "Maecenas": "maecenas"
    },
    {
        ", and became a spokesman for the new regime. For some commentators, his association with the regime was a delicate balance in which he maintained a strong measure of independence J. Michie, The Odes of Horace, 14 but for others he was, in ": null
    },
    {
        "John Drydens": "john dryden"
    },
    {
        "phrase, a well-mannered court slave . N. Rudd, The Satires of Horace and Persius, 10 Quoted by ": null
    },
    {
        "N. Rudd": "niall rudd"
    },
    {
        " from John Drydens Discourse Concerning the Original and Progress of Satire, excerpted from W.P.Kers edition of Drydens essays, Oxford 1926, vol. 2, pp. 86–7          Horace can be regarded as the worlds first autobiographer R. Barrow R., The Romans Pelican Books, 119 – In his writings, he tells us far more about himself, his character, his development, and his way of life than any other great poet in antiquity. Some of the biographical writings contained in his writings can be supplemented from the short but valuable Life of Horace by ": null
    },
    {
        "Suetonius": "suetonius"
    },
    {
        " . Fraenkel, Eduard. Horace. Oxford: 1957, p. 1.   For the Life of Horace by Suetonius, see:        He was born on 8 December 65 BC The year is given in Odes 3.21.1 , the month in Epistles 1.20.27, the day in Suetonius biography Vita  in the ": null
    },
    {
        "Samnite": "samnites"
    },
    {
        " south of ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". Brills Companion to Horace, edited by Hans-Christian Günther, Brill, 2012, p.7,  His home town, ": null
    },
    {
        "Venusia": "venosa"
    },
    {
        ", lay on a trade route in the border region between ": null
    },
    {
        "Apulia": "apulia"
    },
    {
        " and ": null
    },
    {
        "Lucania": "lucania"
    },
    {
        " . Various Italic dialects were spoken in the area and this perhaps enriched his feeling for language. He could have been familiar with Greek words even as a young boy and later he poked fun at the jargon of mixed Greek and Oscan spoken in neighbouring ": null
    },
    {
        "Canusium": "canusium"
    },
    {
        ". Satires 1.10.30 One of the works he probably studied in school was the Odyssia of ": null
    },
    {
        "Livius Andronicus": "livius andronicus"
    },
    {
        ", taught by teachers like the ": null
    },
    {
        "Orbilius": "orbilius"
    },
    {
        " mentioned in one of his poems. Epistles 2.1.69 ff. Army veterans could have been settled there at the expense of local families uprooted by Rome as punishment for their part in the ": null
    },
    {
        "Social War ": "social war"
    },
    {
        ". E. Fraenkel, Horace, 2–3 Such state-sponsored migration must have added still more linguistic variety to the area. According to a local tradition reported by Horace, Satires 2.1.34 a colony of Romans or Latins had been installed in Venusia after the ": null
    },
    {
        "Samnites": "samnites"
    },
    {
        " had been driven out early in the third century. In that case, young Horace could have felt himself to be a Roman T. Frank, Catullus and Horace, 133–34 A. Campbell, Horace: A New Interpretation, 84 though there are also indications that he regarded himself as a Samnite or ": null
    },
    {
        "Sabellus": "sabellus"
    },
    {
        " by birth. Epistles 1.16.49 R. Nisbet, Horace: life and chronology, 7 Italians in modern and ancient times have always been devoted to their home towns, even after success in the wider world, and Horace was no different. Images of his childhood setting and references to it are found throughout his poems. E. Fraenkel, Horace, 3–4     Horaces father was probably a Venutian taken captive by Romans in the Social War, or possibly he was descended from a ": null
    },
    {
        "Sabine": "sabine"
    },
    {
        " captured in the ": null
    },
    {
        "Samnite Wars": "samnite wars"
    },
    {
        ". Either way, he was a slave for at least part of his life. He was evidently a man of strong abilities however and managed to gain his freedom and improve his social position. Thus Horace claimed to be the free-born son of a prosperous coactor. V. Kiernan, Horace: Poetics and Politics, 24 The term coactor could denote various roles, such as tax collector, but its use by Horace Satires 1.6.86 was explained by ": null
    },
    {
        "scholia": "scholia"
    },
    {
        " as a reference to coactor argentareus i.e. an auctioneer with some of the functions of a banker, paying the seller out of his own funds and later recovering the sum with interest from the buyer. E. Fraenkel, Horace, 4–5     The father spent a small fortune on his sons education, eventually accompanying him to ": null
    },
    {
        "Rome": "rome"
    },
    {
        " to oversee his schooling and moral development. The poet later paid tribute to him in a poem Satires 1.6 that one modern scholar considers the best memorial by any son to his father. No son ever set a finer monument to his father than Horace did in the sixth satire of Book I...Horaces description of his father is warm-hearted but free from sentimentality or exaggeration. We see before us one of the common people, a hard-working, open-minded, and thoroughly honest man of simple habits and strict convictions, representing some of the best qualities that at the end of the Republic could still be found in the unsophisticated society of the Italian municipia E. Fraenkel, Horace, 5–6 The poem includes this passage:       If my character is flawed by a few minor faults, but is otherwise decent and moral, if you can point out only a few scattered blemishes on an otherwise immaculate surface, if no one can accuse me of greed, or of prurience, or of profligacy, if I live a virtuous life, free of defilement , and if I am to my friends a good friend, my father deserves all the credit... As it is now, he deserves from me unstinting gratitude and praise. I could never be ashamed of such a father, nor do I feel any need, as many people do, to apologize for being a freedmans son.  Satire s 1.6.65–92       He never mentioned his mother in his verses and he might not have known much about her. Perhaps she also had been a slave.       Horace left Rome, possibly after his fathers death, and continued his formal education in Athens, a great centre of learning in the ancient world, where he arrived at nineteen years of age, enrolling in ": null
    },
    {
        "The Academy": "platonic academy"
    },
    {
        ". Founded by ": null
    },
    {
        "Plato": "plato"
    },
    {
        ", The Academy was now dominated by ": null
    },
    {
        "Epicureans": "epicureans"
    },
    {
        " and ": null
    },
    {
        "Stoics": "stoics"
    },
    {
        ", whose theories and practises made a deep impression on the young man from Venusia. V. Kiernan, Horace: Poetics and Politics, 25 Meanwhile, he mixed and lounged about with the elite of Roman youth, such as Marcus, the idle son of ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        ", and the Pompeius to whom he later addressed a poem. Odes 2.7 It was in Athens too that he probably acquired deep familiarity with the ancient tradition of Greek lyric poetry, at that time largely the preserve of grammarians and academic specialists . E. Fraenkel, Horace, 8–9     Romes troubles following the assassination of ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        " were soon to catch up with him. ": null
    },
    {
        "Marcus Junius Brutus": "marcus junius brutus"
    },
    {
        " came to Athens seeking support for the republican cause. Brutus was fêted around town in grand receptions and he made a point of attending academic lectures, all the while recruiting supporters among the young men studying there, including Horace. E. Fraenkel, Horace, 9–10 An educated young Roman could begin military service high in the ranks and Horace was made ": null
    },
    {
        "tribunus militum": "tribunus militum"
    },
    {
        " , a post usually reserved for men of senatorial or equestrian rank and which seems to have inspired jealousy among his well-born confederates. Satires 1.6.48 R. Nisbet, Horace: life and chronology, 8 He learned the basics of military life while on the march, particularly in the wilds of northern Greece, whose rugged scenery became a backdrop to some of his later poems. V. Kiernan, Horace, 25 It was there in 42 BC that ": null
    },
    {
        "Octavian": "octavian"
    },
    {
        "  and his associate ": null
    },
    {
        "Mark Antony": "mark antony"
    },
    {
        " crushed the republican forces at the ": null
    },
    {
        "Battle of Philippi": "battle of philippi"
    },
    {
        ". Horace later recorded it as a day of embarrassment for himself, when he fled without his shield, Odes 2.7.10 but allowance should be made for his self-deprecating humour. Moreover, the incident allowed him to identify himself with some famous poets who had long ago abandoned their shields in battle, notably his heroes ": null
    },
    {
        "Alcaeus": "alcaeus of mytilene"
    },
    {
        " and ": null
    },
    {
        "Archilochus": "archilochus"
    },
    {
        ". The comparison with the latter poet is uncanny: Archilochus lost his shield in a part of Thrace near Philippi, and he was deeply involved in the Greek colonization of ": null
    },
    {
        "Thasos": "thasos"
    },
    {
        ", where Horaces die-hard comrades finally surrendered.     Octavian offered an early amnesty to his opponents and Horace quickly accepted it. On returning to Italy, he was confronted with yet another loss: his fathers estate in Venusia was one of many throughout Italy to be confiscated for the settlement of veterans . Horace later claimed that he was reduced to poverty and this led him to try his hand at poetry. Epistles 2.2.51–2 In reality, there was no money to be had from versifying. At best, it offered future prospects through contacts with other poets and their patrons among the rich. V. Kiernan, Horace: Poetics and politics Meanwhile, he obtained the sinecure of scriba quaestorius, a civil service position at the aerarium or Treasury, profitable enough to be purchased even by members of the ordo equester and not very demanding in its work-load, since tasks could be delegated to scribae or permanent clerks. E. Fraenkel, Horace, 14–15 It was about this time that he began writing his Satires and Epodes.            The Epodes belong to ": null
    },
    {
        "iambic poetry": "iambic poetry"
    },
    {
        ". Iambic poetry features insulting and obscene language; Christopher Brown, in A Companion to the Greek Lyric Poets, D.E.Gerber , Leiden 1997, pages 13–88 Douglas E. Gerber, Greek Iambic Poetry, Loeb Classical Library , Introduction pages i–iv sometimes, it is referred to as blame poetry. D. Mankin, Horace: Epodes, C.U.P., 8 Blame poetry, or shame poetry, is poetry written to blame and shame fellow citizens into a sense of their social obligations. Horace modelled these poems on the poetry of ": null
    },
    {
        "Archilochus": "archilochus"
    },
    {
        ". Social bonds in Rome had been decaying since the destruction of ": null
    },
    {
        "Carthage": "carthage"
    },
    {
        " a little more than a hundred years earlier, due to the vast wealth that could be gained by plunder and corruption. D. Mankin, Horace: Epodes, 6 These social ills were magnified by rivalry between Julius Caesar, Mark Antony and confederates like ": null
    },
    {
        "Sextus Pompey": "sextus pompey"
    },
    {
        ", all jockeying for a bigger share of the spoils. One modern scholar has counted a dozen civil wars in the hundred years leading up to 31 BC, including the ": null
    },
    {
        "Spartacus": "spartacus"
    },
    {
        " rebellion, eight years before Horaces birth. R. Conway, New Studies of a Great Inheritance, 49–50 As the heirs to Hellenistic culture, Horace and his fellow Romans were not well prepared to deal with these problems:          Horaces Hellenistic background is clear in his Satires, even though the genre was unique to Latin literature. He brought to it a style and outlook suited to the social and ethical issues confronting Rome but he changed its role from public, social engagement to private meditation. F. Muecke, The Satires, 109–10 Meanwhile, he was beginning to interest Octavians supporters, a gradual process described by him in one of his satires. The way was opened for him by his friend, the poet Virgil, who had gained admission into the privileged circle around Maecenas, Octavians lieutenant, following the success of his  Eclogues . An introduction soon followed and, after a discreet interval, Horace too was accepted. He depicted the process as an honourable one, based on merit and mutual respect, eventually leading to true friendship, and there is reason to believe that his relationship was genuinely friendly, not just with Maecenas but afterwards with Augustus as well. R. Lyne, Augustan Poetry and Society, 599 On the other hand, the poet has been unsympathetically described by one scholar as a sharp and rising young man, with an eye to the main chance. J. Griffin, Horace in the Thirties, 6 There were advantages on both sides: Horace gained encouragement and material support, the politicians gained a hold on a potential dissident. R. Nisbet, Horace: life and chronology, 10 His republican sympathies, and his role at Philippi, may have caused him some pangs of remorse over his new status. However most Romans considered the civil wars to be the result of contentio dignitatis, or rivalry between the foremost families of the city, and he too seems to have accepted the principate as Romes last hope for much needed peace. D. Mankin, Horace: Epodes, 5     In 37 BC, Horace accompanied Maecenas on a journey to ": null
    },
    {
        "Brundisium": "brundisium"
    },
    {
        ", described in one of his poems Satires 1.5 as a series of amusing incidents and charming encounters with other friends along the way, such as Virgil. In fact the journey was political in its motivation, with Maecenas en route to negotiatie the ": null
    },
    {
        "Treaty of Tarentum": "treaty of tarentum"
    },
    {
        " with Antony, a fact Horace artfully keeps from the reader . Horace was probably also with Maecenas on one of Octavians naval expeditions against the piratical Sextus Pompeius, which ended in a disastrous storm off ": null
    },
    {
        "Palinurus": "palinurus"
    },
    {
        " in 36 BC, briefly alluded to by Horace in terms of near-drowning. Odes 3.4.28 Odes 3.4.28: nec Sicula Palinurus unda ; nor did Palinurus extinguish me with Sicilian waters . Maecenas involvement is recorded by ": null
    },
    {
        "Appian": "appian"
    },
    {
        " Bell. Civ. 5.99 but Horaces ode is the only historical reference to his own presence there, depending however on interpretation.  There are also some indications in his verses that he was with Maecenas at the ": null
    },
    {
        "Battle of Actium": "battle of actium"
    },
    {
        " in 31 BC, where Octavian defeated his great rival, Antony. Epodes 1 and 9 The point is much disputed among scholars and hinges on how the text is interpreted. Epodes 9 for example may offer proof of Horaces presence if ad hunc frementis is a misreading of at huc...verterent in lines describing the defection of the Galatian cavalry, ad hunc frementis verterunt bis mille equos / Galli canentes Caesarem . By then Horace had already received from Maecenas the famous gift of his ": null
    },
    {
        "Sabine farm": "horaces villa"
    },
    {
        ", probably not long after the publication of the first book of Satires. The gift, which included income from five tenants, may have ended his career at the Treasury, or at least allowed him to give it less time and energy. E. Fraenkel, Horace, 15 It signalled his identification with the Octavian regime yet, in the second book of Satires that soon followed, he continued the apolitical stance of the first book. By this time, he had attained the status of eques Romanus, Satires 2.7.53 perhaps as a result of his work at the Treasury. R. Nisbet, Horace: life and chronology, 11         Odes 1–3 were the next focus for his artistic creativity. He adapted their forms and themes from Greek lyric poetry of the seventh and sixth centuries BC. The fragmented nature of the ": null
    },
    {
        "Greek world": "greek world"
    },
    {
        " had enabled his literary heroes to express themselves freely and his semi-retirement from the Treasury in Rome to ": null
    },
    {
        "his own estate": "horaces villa"
    },
    {
        " in the Sabine hills perhaps empowered him to some extent also V. Kiernan, Horace: Poetics and Politics, 61–2 yet even when his lyrics touched on public affairs they reinforced the importance of private life. Nevertheless, his work in the period 30–27 BC began to show his closeness to the regime and his sensitivity to its developing ideology. In Odes 1.2, for example, he eulogized Octavian in hyperboles that echo Hellenistic court poetry. The name Augustus, which Octavian assumed in January 27 BC, is first attested in Odes 3.3 and 3.5. In the period 27–24 BC, political allusions in the Odes concentrated on foreign wars in Britain , Arabia Spain and Parthia . He greeted Augustus on his return to Rome in 24 BC as a beloved ruler upon whose good health he depended for his own happiness . R. Nisbet, Horace: life and chronology, 13     The public reception of Odes 1–3 disappointed him, however. He attributed the lack of success to jealousy among imperial courtiers and to his isolation from literary cliques. Epistles 1.19.35–44 Perhaps it was disappointment that led him to put aside the genre in favour of verse letters. He addressed his first book of Epistles to a variety of friends and acquaintances in an urbane style reflecting his new social status as a knight. In the opening poem, he professed a deeper interest in moral philosophy than poetry Epistles 1.1.10 but, though the collection demonstrates a leaning towards stoic theory, it reveals no sustained thinking about ethics. V. Kiernan, Horace: Poetics and Politics, 149, 153 Maecenas was still the dominant confidante but Horace had now begun to assert his own independence, suavely declining constant invitations to attend his patron. Epistles 1.7 In the final poem of the first book of Epistles, he revealed himself to be forty-four years old in the consulship of Lollius and Lepidus i.e. 21 BC, and of small stature, fond of the sun, prematurely grey, quick-tempered but easily placated . Epistles 1.20.24–5 R. Nisbet, Horace: life and chronology, 14–15     According to Suetonius, the second book of Epistles was prompted by Augustus, who desired a verse epistle to be addressed to himself. Augustus was in fact a prolific letter-writer and he once asked Horace to be his personal secretary. Horace refused the secretarial role but complied with the emperors request for a verse letter. E. Fraenkel, Horace, 17–18 The letter to Augustus may have been slow in coming, being published possibly as late as 11 BC. It celebrated, among other things, the 15 BC military victories of his stepsons, Drusus and Tiberius, yet it and the following letter Epistles 2.2 were largely devoted to literary theory and criticism. The literary theme was explored still further in Ars Poetica, published separately but written in the form of an epistle and sometimes referred to as Epistles 2.3 . R. Ferri, The Epistles, 121 He was also commissioned to write odes commemorating the victories of Drusus and Tiberius Odes 4.4 and 4.14 and one to be sung in a temple of Apollo for the ": null
    },
    {
        "Secular Games": "secular games"
    },
    {
        ", a long-abandoned festival that Augustus revived in accordance with his policy of recreating ancient customs .     Suetonius recorded some gossip about Horaces sexual activities late in life, claiming that the walls of his bedchamber were covered with obscene pictures and mirrors, so that he saw erotica wherever he looked. Suetonius signals that the report is based on rumours by employing the terms traditur...dicitur / it is reported...it is said  The poet died at 56 years of age, not long after his friend Maecenas, near whose tomb he was laid to rest. Both men bequeathed their property to Augustus, an honour that the emperor expected of his friends. E. Fraenkel, Horace, 23            The dating of Horaces works isnt known precisely and scholars often debate the exact order in which they were first published. There are persuasive arguments for the following chronology: R Nisbet, Horace: life and chronology, 17–21    Satires 1     Satires 2     Epodes     Odes 1–3  According to a recent theory, the three books of Odes were issued separately, possibly in 26, 24 and 23 BC     Epistles 1     Carmen Saeculare     Epistles 2  19 BC is the usual estimate but c. 11 BC has good support too ": null
    }
]