[
    {
        "   Hormizd IV  was ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " King of Kings": "king of kings"
    },
    {
        " of ": null
    },
    {
        "Iran": "iran"
    },
    {
        " from 42 to 42 He was the son and successor of ": null
    },
    {
        "Khosrow I": "khosrow i"
    },
    {
        "  and his mother was a ": null
    },
    {
        "Khazar": "khazar"
    },
    {
        " princess.     During his reign, Hormizd IV had the high aristocracy and ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " priesthood slaughtered, whilst supporting the landed gentry . His reign was marked by constant warfare: to the west, he fought a long and indecisive war with the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ", which had been ongoing since the reign of his father; and to the east, the Iranian general ": null
    },
    {
        "Bahram Chobin": "bahram chobin"
    },
    {
        " successfully contained and defeated the ": null
    },
    {
        "Western Turkic Khaganate": "western turkic khaganate"
    },
    {
        " during the ": null
    },
    {
        "First Perso-Turkic War": "first perso-turkic war"
    },
    {
        ". Jealous of Bahrams success, Hormizd IV had him disgraced and dismissed, which led to a rebellion led by Bahram, which marked the start of the ": null
    },
    {
        "Sasanian civil war of 4242": "sasanian civil war of 589-591"
    },
    {
        ". Another faction, led by two other dissatisfied nobles, ": null
    },
    {
        "Vistahm": "vistahm"
    },
    {
        " and ": null
    },
    {
        "Vinduyih": "vinduyih"
    },
    {
        ", had Hormizd IV deposed and killed, and elevated his son ": null
    },
    {
        "Khosrow II": "khosrow ii"
    },
    {
        " as the new king .     Hormizd IV was noted for his religious tolerance, declining appeals by the Zoroastrian priesthood to persecute the ": null
    },
    {
        "Christian population of the country": "christianity in iran"
    },
    {
        ". Contemporary sources generally considered him to be a tyrannical figure, due to his policies. Modern historiography presents a milder view of him, and considers him a well-meaning ruler who strived to continue his fathers policies, albeit overambitiously.       Hormizd  is the ": null
    },
    {
        "Middle Persian": "middle persian"
    },
    {
        " version of the name of the supreme ": null
    },
    {
        "deity": "deity"
    },
    {
        " in ": null
    },
    {
        "Zoroastrianism": "zoroastrianism"
    },
    {
        ", known in ": null
    },
    {
        "Avestan": "avestan"
    },
    {
        " as ": null
    },
    {
        "Ahura Mazda": "ahura mazda"
    },
    {
        ". The ": null
    },
    {
        "Old Persian": "old persian"
    },
    {
        " equivalent is Auramazdā, while the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " transliteration": "transliteration"
    },
    {
        " is Hormisdas.          Hormizd was the son of ": null
    },
    {
        "Khosrow I": "khosrow i"
    },
    {
        ", one of the most celebrated of the ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " shah": "shah"
    },
    {
        "s. Oriental sources and modern scholars have associated Hormizds maternal grandfather with ": null
    },
    {
        "Sinjibu": "istämi"
    },
    {
        ", the ": null
    },
    {
        "khagan": "khagan"
    },
    {
        " of the ": null
    },
    {
        "Turks": "western turkic khaganate"
    },
    {
        ", who allied himself with Khosrow I in  to put an end to the ": null
    },
    {
        "Hephthalites": "hephthalites"
    },
    {
        ", which the two allied powers accomplished at the ": null
    },
    {
        "Battle of Gol-Zarriun": "battle of gol-zarriun"
    },
    {
        ". Khosrow I was given the daughter of Sinjibu in marriage, who reportedly gave birth to Hormizd. Hormizd is thus called a Torkzad in the ": null
    },
    {
        "Shahnameh": "shahnameh"
    },
    {
        ", or son of a Turk. This is, however, rejected by the ": null
    },
    {
        "Iranologist": "iranologist"
    },
    {
        " Shapur Shahbazi": "shapur shahbazi"
    },
    {
        ", who called such a relationship a chronological difficulty , due to sources mentioning Hormizd being sent by his father to contain the threat posed by Sinjibu, following the division of Hephthalite territory between the Sasanians and Turks.     Historians consider it more plausible that Hormizd was born around 42: his son ": null
    },
    {
        "Khosrow II": "khosrow ii"
    },
    {
        " was thus born in . The 42th-century ": null
    },
    {
        "Armenian": "armenians"
    },
    {
        " historian ": null
    },
    {
        "Sebeos": "sebeos"
    },
    {
        " called Hormizds mother a daughter of the khagan of the Turks and referred to her as Kayen, whilst ": null
    },
    {
        "Masudi": "masudi"
    },
    {
        " called her Faqom, stating that she was the daughter of the ruler of the ": null
    },
    {
        "Khazars": "khazars"
    },
    {
        ". Shahbazi supported the German ": null
    },
    {
        "orientalist": "oriental studies"
    },
    {
        " Josef Markwart": "josef markwart"
    },
    {
        " in his deduction that Hormizds maternal grandfather was the khagan of the Khazars , and that Sebeos had referred to Hormizds mother by her fathers name . The medieval Iranian geographer ": null
    },
    {
        "Ibn Khordadbeh": "ibn khordadbeh"
    },
    {
        " also mentioned Khosrow I and the Khazar king organizing to marry each others daughters. Hormizd was thus not only an offspring of the highly esteemed Khosrow I of the ruling family of Iran, but also belonged to a royal Turkic dynasty, which according to Sebeos made Hormizd even greater than his paternal ancestors and equally greater and wilder than his maternal relatives .          Khosrow I, aware that Hormizd had showed himself as a leader of quality, appointed Hormizd as his heir. The decision was also politically motivated, due to Hormizds maternal line being of noble lineage, whilst the mothers of Khosrow Is other sons were more lowly. Hormizd came to the throne in 42: according to the narratives included in the history of ": null
    },
    {
        "al-Tabari": "al-tabari"
    },
    {
        ", Hormizd was well learned and full of good aspirations of kindness toward the poor and weak. Hormizd appears to have strived his best to continue the policies of his father—supporting the landed gentry  against the aristocracy and protecting the rights of the lower classes, as well as thwarting efforts by the ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " priesthood to reassert themselves. He did, however, resort to executions in order to maintain his fathers policies, and as a result became the subject of hostility by the Zoroastrians. He declined an appeal by the priesthood to persecute the ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " population by asserting his wish that all his subjects were to exercise their religion freely . He reportedly had many members of the priesthood killed, including the chief priest  himself.     He strained his relationship with the aristocracy by having thousands of them killed. Many had been distinguished figures under Hormizds father, such as the latters famous minister  ": null
    },
    {
        "Bozorgmehr": "bozorgmehr"
    },
    {
        "; the military commander  of ": null
    },
    {
        "Khwarasan": "khwarasan"
    },
    {
        ", ": null
    },
    {
        "Chihr-Burzen": "chihr-burzen"
    },
    {
        "; the spahbed of  Nemroz , ": null
    },
    {
        "Bahram-i Mah Adhar": "bahram-i mah adhar"
    },
    {
        "; the distinguished dignitary ": null
    },
    {
        "Izadgushasp": "izadgushasp"
    },
    {
        "; the spahbed of the southwest , Shapur, an ": null
    },
    {
        "Ispahbudhan": "house of ispahbudhan"
    },
    {
        " nobleman who was the father of ": null
    },
    {
        "Vistahm": "vistahm"
    },
    {
        "; ": null
    },
    {
        "Vinduyih": "vinduyih"
    },
    {
        "; and an unnamed daughter whom Hormizd had married. Hormizd was himself related to the family, with his paternal grandmother being a sister of ": null
    },
    {
        "Bawi": "bawi"
    },
    {
        ", the father of Shapur. Hormizd was not the first Sasanian shah to kill a close relative from the Ispahbudhan family: his father Khosrow I had ordered the execution of Bawi in the early 42s. Nevertheless, the Ispahbudhans continued to enjoy such a high status that they were acknowledged as kin and partners of the Sasanians , with Vistahm being appointed as the successor of his father by Hormizd.     Due to his persecutions against the nobility and clergy, Hormizd thus became viewed with hostility in Persian sources. This was not unusual: the 42th-century Sasanian ruler ": null
    },
    {
        "Yazdegerd I": "yazdegerd i"
    },
    {
        " is portrayed very negatively in Persian sources due to his tolerant policy towards his non-Zoroastrian subjects, and his refusal to comply with the demands of the aristocracy and priesthood, thus becoming known as the sinner . Although met with hostility in medieval sources, Hormizd is portrayed in a more positive light in modern sources. The ": null
    },
    {
        "German": "germany"
    },
    {
        " orientalist": "oriental studies"
    },
    {
        " Theodor Nöldeke": "theodor nöldeke"
    },
    {
        " deemed the negative portrayal of Hormizd as unreasonable, and considered the shah to be a well-meaning sovereign who intended to restrain the nobility and clergy and ease the burden of the lower classes: his effort was on the whole justified, but the unhappy outcome shows that he was not the man to reach such lofty goals with peace and competence .          From his father, Hormizd had inherited an ": null
    },
    {
        "ongoing war": "roman–persian war of 572–591"
    },
    {
        " against the ": null
    },
    {
        "East Roman Empire": "byzantine empire"
    },
    {
        ". Negotiations of peace had just begun with the Emperor ": null
    },
    {
        "Tiberius II": "tiberius ii"
    },
    {
        ", who offered to give up all claims to ": null
    },
    {
        "Armenia": "sasanian armenia"
    },
    {
        " and interchange the Byzantine-occupied Arzenere for the Iranian-occupied ": null
    },
    {
        "Dara": "dara"
    },
    {
        " . Hormizd, however, further demanded the payment of the yearly tribute that was made during the reign of ": null
    },
    {
        "Justinian I": "justinian i"
    },
    {
        " , and thus caused the negotiations to be broken off. No campaign in ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " was undertaken by either of the empires due to the negotiations, however they continued to clash in Armenia, where ": null
    },
    {
        "Varaz Vzur": "varaz vzur"
    },
    {
        " succeeded ": null
    },
    {
        "Tamkhosrow": "tamkhosrow"
    },
    {
        " as the new Sasanian governor of Armenia.     The Byzantines were successful at their endeavors, securing a noteworthy victory under the commanders ": null
    },
    {
        "Cours": "cours"
    },
    {
        " and ": null
    },
    {
        "John Mystacon": "john mystacon"
    },
    {
        ", albeit also suffering a defeat at the hands of the Sasanians. In early 42 the clients and vassals of the Sasanians, the ": null
    },
    {
        "Lakhmids": "lakhmids"
    },
    {
        ", were defeated at the hands of the ": null
    },
    {
        "Ghassanids": "ghassanids"
    },
    {
        ", vassals of the Byzantines. In the same year, a Byzantine army ravaged ": null
    },
    {
        "Garamig ud Nodardashiragan": "garamig ud nodardashiragan"
    },
    {
        ", reaching as far as ": null
    },
    {
        "Media": "media"
    },
    {
        ". Around the same time, Hormizd appointed Khosrow as the governor of ": null
    },
    {
        "Caucasian Albania": "caucasian albania"
    },
    {
        ", who negotiated with the Iberian aristocracy and won their support, so successfully bringing ": null
    },
    {
        "Iberia": "kingdom of iberia"
    },
    {
        " back under Sasanian rule.     The following year, an ambitious campaign by the Byzantine commander ": null
    },
    {
        "Maurice": "maurice"
    },
    {
        ", supported by Ghassanid forces under ": null
    },
    {
        "al-Mundhir III": "al-mundhir iii ibn al-harith"
    },
    {
        ", targeted the Sasanian capital of ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ". The combined force moved south along the river ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        ", accompanied by a fleet of ships. The army stormed the fortress of Anatha and moved on until it reached the region of ": null
    },
    {
        "Beth Aramaye": "beth aramaye"
    },
    {
        " in central Mesopotamia, near Ctesiphon. There they found the bridge over the Euphrates destroyed by the Iranians. In response to Maurices advance, the Iranian general ": null
    },
    {
        "Adarmahan": "adarmahan"
    },
    {
        " was ordered to operate in northern Mesopotamia, threatening the Byzantine armys supply line. Adarmahan raided ": null
    },
    {
        "Osrhoene": "osrhoene"
    },
    {
        ", and was successful in capturing its capital, ": null
    },
    {
        "Edessa": "edessa, mesopotamia"
    },
    {
        ". He then marched his army toward ": null
    },
    {
        "Callinicum": "raqqa"
    },
    {
        " on the Euphrates. With the possibility of a march to Ctesiphon gone, Maurice was forced to retreat. The retreat was arduous for the tired army, and Maurice and al-Mundhir exchanged recriminations for the expeditions failure. However, they cooperated in forcing Adarmahan to withdraw, and defeated him at Callinicum. ; .     Tiberius tried afterwards to renew negotiations by sending Zachariah to the frontier to meet Andigan. The negotiations broke off once more after Andigan attempted to pressurize him by drawing the attention of the nearby Iranian contingent led by Tamkhosrow. In 42 Tamkhosrow, along with Adarmahan, invaded Byzantine territory and headed for the town of ": null
    },
    {
        "Constantina": "constantia"
    },
    {
        ". Maurice, who had been expecting and preparing for such an attack, fought the Iranians outside the city in June 42 The Iranian army suffered a heavy defeat, and Tamkhosrow was killed. Not long afterwards, the deteriorating physical condition of Tiberius forced Maurice to return immediately to Constantinople to assume the crown. Meanwhile, John Mystacon, who had replaced Maurice as the commander of the east, attacked the Sasanians at the junction of the ": null
    },
    {
        "Nymphius": "batman river"
    },
    {
        " and the ": null
    },
    {
        "Tigris": "tigris"
    },
    {
        ", but was defeated and forced to withdraw. He was shortly replaced by ": null
    },
    {
        "Philippicus": "philippicus"
    },
    {
        ". The war continued inconclusively through raids and counter-raids, punctuated by abortive peace talks—the one significant clash was a Byzantine victory at the ": null
    },
    {
        "Battle of Solachon": "battle of solachon"
    },
    {
        " in 42 ; . The war ultimately achieved very little for either side.          In 42 the ": null
    },
    {
        "Turkic": "western turkic khaganate"
    },
    {
        " Khagan": "khagan"
    },
    {
        " Bagha Qaghan": "bagha qaghan"
    },
    {
        " , together with his ": null
    },
    {
        "Hephthalite": "hephthalite empire"
    },
    {
        " subjects, ": null
    },
    {
        "invaded": "first perso-turkic war"
    },
    {
        " the Sasanian territories south of the ": null
    },
    {
        "Oxus": "oxus"
    },
    {
        ", where they attacked and routed the Sasanian soldiers stationed in ": null
    },
    {
        "Balkh": "balkh"
    },
    {
        ". After conquering the city, they proceeded to take ": null
    },
    {
        "Talaqan": "taloqan"
    },
    {
        ", ": null
    },
    {
        "Badghis": "badghis"
    },
    {
        ", and ": null
    },
    {
        "Herat": "herat"
    },
    {
        ". In a council of war, ": null
    },
    {
        "Bahram Chobin": "bahram chobin"
    },
    {
        " of the ": null
    },
    {
        "Parthia": "parthia"
    },
    {
        "n ": null
    },
    {
        "Mihranid family": "house of mihran"
    },
    {
        " was chosen to lead an army against them and was given the governorship of ": null
    },
    {
        "Khorasan": "greater khorasan"
    },
    {
        ". Bahrams army, supposedly consisting of 42 hand-picked horsemen, ambushed a large army of Turks and Hephthalites in April 42 at the Battle of Hyrcanian Rock. In 42 he retook Balkh, where he captured the Turkic treasury and the golden throne of the Khagan. He then proceeded to cross the Oxus river and won a decisive victory over the Turks, personally killing Bagha Qaghan with an arrowshot. He managed to reach as far as Baykand, near ": null
    },
    {
        "Bukhara": "bukhara"
    },
    {
        ", and also contain an attack by the son of the deceased Khagan, Birmudha, whom Bahram had captured and sent to Ctesiphon.      Birmudha was well received there by Hormizd, who forty days later had him sent back to Bahram with the order that the Turkic prince should get sent back to Transoxiana. The Sasanians now held suzerainty over the ": null
    },
    {
        "Sogdia": "sogdia"
    },
    {
        "n cities of ": null
    },
    {
        "Chach": "tashkent"
    },
    {
        " and ": null
    },
    {
        "Samarkand": "samarkand"
    },
    {
        ", where Hormizd minted coins. After Bahrams great victory against the Turks he was sent to ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " to repel an invasion of nomads, possibly the Khazars, where he was victorious. He was once again made commander of the Sasanian forces against the Byzantines, and successfully defeated a Byzantine force in ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        ". However, he then suffered a minor defeat by a Byzantine army on the banks of the ": null
    },
    {
        "Aras": "aras"
    },
    {
        ". Hormizd, who was jealous of Bahram, used this defeat as an excuse to dismiss him from his office, and had him humiliated.     According to one source, Bahram was the subject of jealousy by others after his victory against the Turks. Hormizds minister ": null
    },
    {
        "Azen Gushnasp": "azen gushnasp"
    },
    {
        ", who was reportedly jealous of Bahram, accused him of having kept the best part of the booty for himself and only sending a small part to Hormizd. According to other sources, it was Birmudha or the courtiers that raised Hormizds suspicion. Regardless, Hormizd could not tolerate the rising fame of Bahram, and thus had him disgraced and removed from office for supposedly having kept some of the booty for himself. Furthermore, Hormizd sent him a chain and a ": null
    },
    {
        "spindle": "spindle"
    },
    {
        " to show that he considered him as a lowly slave as ungrateful as a woman . Enraged, Bahram, who was still in the east, rebelled against Hormizd. The version of Bahram rebelling after his defeat against the Byzantines was supported by Nöldeke in 42 However, a source found ten years later confirmed Bahrams rebellion took in fact place while he was still in the east.          Due to his noble status and great military knowledge, Bahrams soldiers and many others joined the rebellion, which marked the start of the ": null
    },
    {
        "Sasanian civil war of 4242": "sasanian civil war of 589-591"
    },
    {
        ". Bahram then appointed a new governor for Khorasan, and afterwards set for Ctesiphon. The legitimacy of the ": null
    },
    {
        "House of Sasan": "house of sasan"
    },
    {
        " had been established in the credence that the halo of kingship, the  xwarrah , was given to the first Sasanian shah, ": null
    },
    {
        "Ardashir I": "ardashir i"
    },
    {
        "  and his family following the latters conquest of the ": null
    },
    {
        "Parthian Empire": "parthian empire"
    },
    {
        ". This was now, however, disputed by Bahram, thus marking the first time in Sasanian history that a Parthian dynast challenged the legitimacy of the Sasanian family by rebelling. Azen Gushnasp was sent to suppress the rebellion, but was murdered in ": null
    },
    {
        "Hamadan": "hamadan"
    },
    {
        " by Zadespras, one of his own men. Another force under ": null
    },
    {
        "Sarames the Elder": "sarames the elder"
    },
    {
        " was also sent to stop Bahram, who defeated him and had him trampled to death by ": null
    },
    {
        "war elephants": "persian war elephants"
    },
    {
        ". The route taken by Bahram was presumably the northern edge of the ": null
    },
    {
        "Iranian plateau": "iranian plateau"
    },
    {
        ", where in 42 he had repelled a Byzantine-funded attack by Iberians and others on ": null
    },
    {
        "Adurbadagan": "adurbadagan"
    },
    {
        ", and suffered a minor setback by a Byzantine force employed in Transcaucasia. He then marched southwards ": null
    },
    {
        "Media": "media"
    },
    {
        ", where Sasanian monarchs, including Hormizd, ordinarily resided during the summer.        Hormizd then left for the ": null
    },
    {
        "Great Zab": "great zab"
    },
    {
        " in order to cut communications between Ctesiphon and the Iranian soldiers on the Byzantine border. Around that time the soldiers, who were situated outside ": null
    },
    {
        "Nisibis": "nisibis"
    },
    {
        ", the chief city in northern Mesopotamia, rebelled against Hormizd and pledged their allegiance to Bahram. The influence and popularity of Bahram continued to grow: Sasanian loyalist forces sent north against the Iranian rebels at Nisibis were flooded with rebel propaganda. The loyalist forces eventually also rebelled and killed their commander, which made the position of Hormizd become unsustainable. He decided to navigate the ": null
    },
    {
        "Tigris river": "tigris river"
    },
    {
        " and take sanctuary in ": null
    },
    {
        "al-Hira": "al-hira"
    },
    {
        ", the capital of the ": null
    },
    {
        "Lakhmids": "lakhmids"
    },
    {
        ".     During Hormizds stay at Ctesiphon, he was overthrown in a seemingly bloodless palace revolution by his brothers-in-law ": null
    },
    {
        "Vistahm": "vistahm"
    },
    {
        " and ": null
    },
    {
        "Vinduyih": "vinduyih"
    },
    {
        ", who according to the ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " writer ": null
    },
    {
        "Joshua the Stylite": "joshua the stylite"
    },
    {
        ", both equally hated Hormizd . They had Hormizd blinded with a red-hot needle, and put his oldest son ": null
    },
    {
        "Khosrow II": "khosrow ii"
    },
    {
        " on the throne. Sometime in the summer of 42 the two brothers then had Hormizd killed, with at least the implicit approval of Khosrow II. Nevertheless, Bahram continued his march to Ctesiphon, now with the pretext of claiming to avenge Hormizd. Hormizds death continued to be a controversial matter—a few years later, Khosrow II ordered the execution of both his uncles as well as other nobles who had a hand in the killing of his father. A few decades later, Khosrow II, after being overthrown in a coup by his son ": null
    },
    {
        "Kavad II": "kavad ii"
    },
    {
        ", was accused of ": null
    },
    {
        "regicide": "regicide"
    },
    {
        " against his father.       Hormizd, like all other Sasanian rulers, was an adherent of Zoroastrianism. Since the 42th-century, the Sasanian monarchs had been made aware of the significance of the religious minorities in the realm, and as a result tried to homogenize them into a structure of administration where according to legal principles, all would be treated straightforwardly as mard / zan ī šahr, i.e. man/woman citizen . ": null
    },
    {
        "Jews": "jews"
    },
    {
        " and Christians had accepted the concept of Iran and considered themselves part of the nation. Hormizd, aware of the importance of the Christians and their support, refused to attack them when asked by the Zoroastrian clergy, whom he reportedly urged to acknowledge the input of the Christians. According to al-Tabaris  History of Prophets and Kings  and the  Chronicle of Seert , which both drew some of their work from the Middle Persian history book  Khwaday-Namag  , Hormizd told the clergy:          Hormizd was himself married to a Christian woman and prayed to the martyr ": null
    },
    {
        "St. Sergius": "sergius and bacchus"
    },
    {
        ", a military saint whose cult rapidly increased beyond political and cultural borders from the 42th to the 42th-century. He was as a result suspected of harboring Christian beliefs. However, his son Khosrow II also paid tribute to Sergius, more than once. Hormizd superstitiously wore a ": null
    },
    {
        "talisman": "talisman"
    },
    {
        " against death, and stressed the importance of ": null
    },
    {
        "astrology": "astrology"
    },
    {
        ".       Two of Hormizds wives are known, one of them being an ": null
    },
    {
        "Ispahbudhan": "ispahbudhan"
    },
    {
        " noblewoman, who was the daughter of ": null
    },
    {
        "Bawi": "bawi"
    },
    {
        ", whilst the other one was a Christian woman.     Besides Khosrow II , Hormizd also had an unnamed daughter, who married ": null
    },
    {
        "Shahrbaraz": "shahrbaraz"
    },
    {
        " of the ": null
    },
    {
        "House of Mihran": "house of mihran"
    },
    {
        ".       ": null
    }
]