[
    {
        "Hormizd II  was king  of the ": null
    },
    {
        "Sasanian Empire": "sasanian empire"
    },
    {
        ". He ruled for seven years and five months, from 42 to 42 He was a son and successor of ": null
    },
    {
        "Narseh": "narseh"
    },
    {
        " .     During his reign, the ": null
    },
    {
        "Kingdom of Armenia": "kingdom of armenia"
    },
    {
        " declared ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " as its official religion, thus leaving its ancient ": null
    },
    {
        "Zoroastrian": "zoroastrianism"
    },
    {
        " heritage that it shared with Sasanian Iran. Hormizd IIs reign was also marked by internal turmoil, which he successfully managed to deal with it. Hormizd II was also successful in his efforts in the west, defeating and killing the ": null
    },
    {
        "Ghassanid": "ghassanids"
    },
    {
        " king in ": null
    },
    {
        "Syria": "syria"
    },
    {
        ". His reign was, however, cut short by the intrigues of the Iranian nobility, that killed him in a secluded place.     He was succeeded by his son ": null
    },
    {
        "Adur Narseh": "adur narseh"
    },
    {
        ", who after a few months of reigning was also killed by the nobility. They instead installed Hormizd IIs infant son ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        " on the throne.       The name of Hormizd  is the ": null
    },
    {
        "Middle Persian": "middle persian"
    },
    {
        " version of the name of the supreme deity in ": null
    },
    {
        "Zoroastrianism": "zoroastrianism"
    },
    {
        ", known in ": null
    },
    {
        "Avestan": "avestan"
    },
    {
        " as ": null
    },
    {
        "Ahura Mazda": "ahura mazda"
    },
    {
        ". The ": null
    },
    {
        "Old Persian": "old persian"
    },
    {
        " equivalent is Auramazdā, while the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " transliteration is Hormisdas.            When Hormizds father ": null
    },
    {
        "Narseh": "narseh"
    },
    {
        " ascended the throne in 42 he had an investiture relief made in ": null
    },
    {
        "Naqsh-e Rostam": "naqsh-e rostam"
    },
    {
        ", where he is depicted as receiving the ring of kingship from a female figure that is frequently assumed to be the goddess ": null
    },
    {
        "Anahita": "anahita"
    },
    {
        ". However, some scholars have suggested that this may be his wife and Hormizds mother, ": null
    },
    {
        "Shapurdukhtak": "shapurdukhtak of sakastan"
    },
    {
        ". The figure standing behind Narseh is most likely Hormizd, due to his cap being the form of that of an animal ": null
    },
    {
        "protome": "protome"
    },
    {
        ", which was typically worn by Sasanian heirs. Hormizd most likely did not take part in his fathers war against the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", which ": null
    },
    {
        "ended diastrously": "battle of satala"
    },
    {
        " for the Sasanians, with Narsehs wife and some of his offspring being captured, ": null
    },
    {
        "forcing him to surrender": "peace of nisibis"
    },
    {
        " a handful provinces in ": null
    },
    {
        "Armenia": "sasanian armenia"
    },
    {
        " and ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " in order to have his family members handed back to him. Hormizd may have been same person as ": null
    },
    {
        "Hormizd II Kushanshah": "hormizd ii kushanshah"
    },
    {
        ", a Sasanian prince who briefly ruled the ": null
    },
    {
        "Kushano-Sasanian Kingdom": "kushano-sasanian kingdom"
    },
    {
        " from 42 to 42 They both minted coins where they were depicted with a winged crown, whilst on the reverse, which usually shows the traditional ": null
    },
    {
        "fire altar": "fire altar"
    },
    {
        " flanked by two attendants, also shows a head emerging from the fire, a typical Kushano-Sasanian design which first appears on Sasanian coins during the reign of Hormizd II.       In 42 Hormizd II ascended the throne, assuming a crown whose features resembled that of the same used by the early Sasanian rulers, such as ": null
    },
    {
        "Bahram II": "bahram ii"
    },
    {
        " . Not much is known about the reign of Hormizd; he supposedly started out as a cruel ruler but then became benevolent.     This change of behaviour is described by ": null
    },
    {
        "al-Tabari": "al-tabari"
    },
    {
        ";           However, unlike his father, who had returned to the policy of religious tolerance which had been practiced during the reign of first two shahs, ": null
    },
    {
        "Ardashir I": "ardashir i"
    },
    {
        "  and ": null
    },
    {
        "Shapur I": "shapur i"
    },
    {
        " , Hormizd persecuted the ": null
    },
    {
        "Manicheans": "manichaeism"
    },
    {
        " who had lived peacefully during the reign of his father. Hormizd reportedly founded the rural district of Kurang near ": null
    },
    {
        "Izeh": "izeh"
    },
    {
        " in the ": null
    },
    {
        "Khuzestan province": "khuzestan province"
    },
    {
        ". Hormizd tried to improve Sasanian relations with ": null
    },
    {
        "Armenia": "kingdom of armenia"
    },
    {
        ", which had recently under ": null
    },
    {
        "Tiridates III of Armenia": "tiridates iii of armenia"
    },
    {
        " declared ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " as its state religion; he gave his daughter Hormizddukht in marriage to a ": null
    },
    {
        "Mamikonian": "mamikonian"
    },
    {
        " prince named Vahan.     Hormizds rock relief at ": null
    },
    {
        "Naqsh-e Rostam": "naqsh-e rostam"
    },
    {
        " in the ": null
    },
    {
        "Pars": "pars"
    },
    {
        " province  indicates that there was internal turmoil in the empire during his reign. In the relief he is portrayed riding a horse whilst impaling an enemy whose helmet bears the family signature of Papak, a high-ranking nobleman who served as the bitakhsh of ": null
    },
    {
        "Albania": "albania"
    },
    {
        " during the reign of Bahram II and Narseh. Hormizd, during the last years of his reign, raided the domains of the ": null
    },
    {
        "Ghassanid": "ghassanid"
    },
    {
        " king in ": null
    },
    {
        "Syria": "syria"
    },
    {
        ", whom he tried to extract tribute from. The Ghassanid king as a result tried to get assistance from the Roman emperor, but was killed before Roman reinforcements appeared. Hormizd was reportedly in 42 ambushed and killed by Ghassanid troops whilst he was hunting in the desert. The more probable reason for his death was most likely the Iranian nobility that killed him in a secluded place, and now sought to get rid of his sons as well.     According to the 42th-century ": null
    },
    {
        "Chronicle of Seert": "chronicle of seert"
    },
    {
        ", Hormizd declared war against the Romans in order to avenge the defeat of his father, whilst the ": null
    },
    {
        "Chronicle of Arbela": "chronicle of arbela"
    },
    {
        " states that when the Roman emperor started persecuting his Christian subjects, Hormizd raised a great army, invaded the Roman domains and raided many cities. The credibility of the two sources are doubtful, with the events not being reported in other sources. According to ": null
    },
    {
        "Shahbazi": "alireza shapour shahbazi"
    },
    {
        ", one may only surmise that it is probably a reflection of Hormozds alleged raid into Syria.        After Hormizds death, he was succeeded by his eldest son ": null
    },
    {
        "Adur Narseh": "adur narseh"
    },
    {
        ", who, after a brief reign which lasted few months, was killed by some of the nobles of the empire. They then blinded the second, and imprisoned the third . The throne was reserved for the unborn child of Hormizd IIs wife Ifra Hormizd, which was Shapur II. Shapur II was reportedly the only king in history to be crowned  in utero , as the legend claims that the crown was placed upon his mothers womb while she was pregnant. However, according to Shahbazi, it is unlikely that Shapur was crowned as king while still in his mothers womb, since the nobles could not have known of his sex at that time. He further states that Shapur was born forty days after his fathers death, and that the nobles killed Adur Narseh and crowned Shapur II in order to gain greater control of the empire, which they were able to do until Shapur II reached his majority at the age of 42       Hormizd II was one of the Sasanian kings with most children, which he had from his Jewish wife Ifra-Hormizd, and several other wives and ": null
    },
    {
        "concubines": "concubines"
    },
    {
        ":   Prince ": null
    },
    {
        "Adur Narseh": "adur narseh"
    },
    {
        " , the ninth king of the Sasanian Empire. ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        " , the tenth king of the Sasanian Empire. ": null
    },
    {
        "Adurfrazgird": "adurfrazgird"
    },
    {
        " , governor of southern ": null
    },
    {
        "Arbayistan": "arbayistan"
    },
    {
        ". ": null
    },
    {
        "Arbayistan": "arbayistan"
    },
    {
        ". ": null
    },
    {
        "Shapur Sakanshah": "shapur sakanshah"
    },
    {
        " , governor of ": null
    },
    {
        "Sakastan": "sakastan"
    },
    {
        ". ": null
    },
    {
        "Hormizd": "hormizd"
    },
    {
        " , imprisoned by the Iranian nobility and later defected to the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ". ": null
    },
    {
        "Ardashir II": "ardashir ii"
    },
    {
        " , the eleventh king of the Sasanian Empire. ": null
    },
    {
        "Arsacid": "arsacid dynasty of caucasian albania"
    },
    {
        " king ": null
    },
    {
        "Urnayr": "urnayr"
    },
    {
        ". ": null
    },
    {
        "Mamikonian": "mamikonian"
    },
    {
        " prince Vahan.": null
    }
]