[
    {
        "               A horseshoe is a fabricated product, normally made of ": null
    },
    {
        "metal": "Metal"
    },
    {
        ", although sometimes made partially or wholly of modern synthetic materials, designed to protect a ": null
    },
    {
        "horse hoof": "Horse Hoof"
    },
    {
        " from ": null
    },
    {
        "wear": "Wear"
    },
    {
        ". Shoes are attached on the palmar surface of the hooves, usually ": null
    },
    {
        "nail": "Nail"
    },
    {
        "ed through the insensitive hoof wall that is anatomically akin to the human ": null
    },
    {
        "toenail": "Nail"
    },
    {
        ", although much larger and thicker. However, there are also cases where shoes are ": null
    },
    {
        "glue": "Glue"
    },
    {
        "d.     The fitting of horseshoes is a professional occupation, conducted by a ": null
    },
    {
        "farrier": "Farrier"
    },
    {
        ", who specializes in the preparation of feet, assessing potential lameness issues, and fitting appropriate shoes, including remedial features where required. In some countries, such as the U.K., horseshoeing is legally restricted to only people with specific qualifications and experience. In others, such as the United States, where professional licensing is not legally required, professional organizations provide certification programs that publicly identify qualified individuals.     Horseshoes are available in a wide variety of materials and styles, developed for different types of horse and for the work they do. The most common materials are ": null
    },
    {
        "steel": "Steel"
    },
    {
        " and ": null
    },
    {
        "aluminium": "Aluminium"
    },
    {
        ", but specialized shoes may include use of ": null
    },
    {
        "rubber": "Rubber"
    },
    {
        ", ": null
    },
    {
        "plastic": "Plastic"
    },
    {
        ", ": null
    },
    {
        "magnesium": "Magnesium"
    },
    {
        ", ": null
    },
    {
        "titanium": "Titanium"
    },
    {
        ", or ": null
    },
    {
        "copper": "Copper"
    },
    {
        ". Price, Steven D. The Whole Horse Catalog: Revised and Updated New York:Fireside 1998 , pp. 84–87. Steel tends to be preferred in sports in which a strong, long-wearing shoe is needed, such as ": null
    },
    {
        "polo": "Polo"
    },
    {
        ", ": null
    },
    {
        "eventing": "Eventing"
    },
    {
        ", ": null
    },
    {
        "show jumping": "Show Jumping"
    },
    {
        ", and ": null
    },
    {
        "western riding": "Western Riding"
    },
    {
        " events. Aluminium shoes are lighter, making them common in ": null
    },
    {
        "horse racing": "Horse Racing"
    },
    {
        ", where a lighter shoe is desired; and often facilitate certain types of movement, and so are favored in the discipline of ": null
    },
    {
        "dressage": "Dressage"
    },
    {
        ". Evans, J. Warren, et al. The Horse. Second edition, New York: Freeman, 1990, , pp. 731–739. Some horseshoes have ": null
    },
    {
        "caulkins": "Caulkin"
    },
    {
        " , caulks , or calks : protrusions at the toe or heels of the shoe, or both, to provide additional traction.     When kept as a ": null
    },
    {
        "talisman": "Talisman"
    },
    {
        ", a horseshoe is said to bring good ": null
    },
    {
        "luck": "Luck"
    },
    {
        ".  A stylized variation of the horseshoe is used for a popular throwing game, ": null
    },
    {
        "horseshoes": "Horseshoes"
    },
    {
        ".          Since the early history of ": null
    },
    {
        "domestication of the horse": "Domestication Of The Horse"
    },
    {
        ", ": null
    },
    {
        "working animals": "Working Animal"
    },
    {
        "were found to be exposed to many conditions that created breakage or excessive hoof wear. Ancient people recognized the need for the walls of domestic horses hooves to have additional protection over and above any natural hardness. An early form of hoof protection was seen in ancient Asia, where horses hooves were wrapped in rawhide, leather or other materials for both therapeutic purposes and protection from wear.  From archaeological finds in ": null
    },
    {
        "Great Britain": "Great Britain"
    },
    {
        ", the ": null
    },
    {
        "Romans": "Ancient Rome"
    },
    {
        " appeared to have attempted to protect their horses feet with a strap-on, solid-bottomed ": null
    },
    {
        "hipposandal": "Hipposandal"
    },
    {
        " that has a slight resemblance to the modern ": null
    },
    {
        "hoof boot": "Hoof Boot"
    },
    {
        ".      Historians differ on the origin of the horseshoe. Because ": null
    },
    {
        "iron": "Iron"
    },
    {
        " was a valuable commodity, and any worn out items were generally reforged and reused, it is difficult to locate clear ": null
    },
    {
        "archaeological": "Archaeology"
    },
    {
        " evidence.  Archived 8 February 1998. Although some credit the ": null
    },
    {
        "Druids": "Druids"
    },
    {
        ", there is no hard evidence to support this claim. In 1897 four bronze horseshoes with what are apparently nail holes were found in an Etruscan tomb dated around 400  BC.  The assertion by some historians that the Romans invented the mule shoes sometime after 100  BC is supported by a reference by ": null
    },
    {
        "Catullus": "Catullus"
    },
    {
        " who died in 54  BC. Robert E. Krebs, Groundbreaking Scientific Experiments, Inventions, and Discoveries of the Ancient World, , , pp. 27–28. However, these references to use of horseshoes and muleshoes in Rome, may have been to the hipposandal —leather boots, reinforced by an iron plate, rather than to nailed horseshoes. Rodney Carlisle, Scientific American Inventions and Discoveries , , John Wiley, p. 117.     Existing references to the nailed shoe are relatively late, first known to have appeared around AD  900, but there may have been earlier uses given that some have been found in layers of dirt. There are no extant references to nailed horseshoes prior to the reign of Emperor ": null
    },
    {
        "Leo VI": "Leo Vi The Wise"
    },
    {
        " and by 973 occasional references to them can be found. The earliest clear written record of iron horseshoes is a reference to crescent figured irons and their nails in AD 910.  There is very little evidence of any sort that suggests the existence of nailed-on shoes prior to AD  500 or 600, though there is a find dated to the 5th century AD of a horseshoe, complete with nails, found in the tomb of the Frankish King ": null
    },
    {
        "Childeric I": "Childeric I"
    },
    {
        " at ": null
    },
    {
        "Tournai": "Tournai"
    },
    {
        ", Belgium. Horseshoe. Encyclopædia Britannica. 15th edn. Vol. 20. 2005. 651–51. Print.        Around 1000  AD, cast bronze horseshoes with nail holes became common in Europe. A design with a scalloped outer rim and six nail holes was common. The 13th and 14th centuries brought the widespread manufacturing of iron horseshoes.  By the time of the ": null
    },
    {
        "Crusades": "Crusades"
    },
    {
        " , horseshoes were widespread and frequently mentioned in various written sources. In that period, due to the value of iron, horseshoes were even accepted in lieu of coin to pay taxes.     By the 13th century, shoes were forged in large quantities and could be bought ready-made. Hot shoeing, the process of shaping a heated horseshoe immediately before placing it on the horse, became common in the 16th century. From the need for horseshoes, the craft of blacksmithing became one of the great staple crafts of medieval and modern times and contributed to the development of metallurgy. A treatise titled No Foot, No Horse was published in England in 1751.     In 1835, the first U.S. ": null
    },
    {
        "patent": "Patent"
    },
    {
        " for a horseshoe manufacturing machine capable of making up to 60 horseshoes per hour was issued to Henry Burden. In mid-19th-century Canada, marsh horseshoes kept horses from sinking into the soft intertidal mud during dike-building. In a common design, a metal horseshoe holds a flat wooden shoe in place. Gray, Charlotte, The Museum Called Canada: 25 Rooms of Wonder, Random House, 2004.                 Many changes brought about by the ": null
    },
    {
        "domestication of the horse": "Domestication Of The Horse"
    },
    {
        " have led to a need for shoes for numerous reasons, mostly linked to management that results in horses hooves hardening less and being more vulnerable to injury. In the wild, a horse may travel up to  per day to obtain adequate forage. While horses in the wild cover large areas of terrain, they usually do so at relatively slow speeds, unless being chased by a predator. They also tend to live in arid steppe climates. The consequence of slow but nonstop travel in a dry climate is that horses feet are naturally worn to a small, smooth, even and hard state. The continual stimulation of the sole of the foot keeps it thick and hard. However, in ": null
    },
    {
        "domestication": "Domestication"
    },
    {
        ", the ways horses are used differ from what they would encounter in their natural environment. Domesticated horses are brought to colder and wetter areas than their ancestral habitat. These softer and heavier soils soften the hooves and make them prone to splitting, making hoof protection necessary. Consequently, it was in northern Europe that the nailed horseshoe arose in its modern form.     Domesticated horses are also subject to inconsistent movement between stabling and work; they must carry or pull additional weight, and in modern times, they are often kept and worked on very soft footing, such as irrigated land, arena footing, or stall bedding. In some cases, management is also inadequate. The hooves of horses that are kept in stalls or small turnouts, even when cleaned adequately, are exposed to more moisture than would be encountered in the wild, as well as to ammonia from urine. The hoof capsule is mostly made from keratin, a ": null
    },
    {
        "protein": "Protein"
    },
    {
        ", and is weakened by this exposure, becoming even more fragile and soft. Shoes do not prevent or reduce damage from moisture and ammonia exposure. Rather, they protect already weakened hooves. Further, without the natural conditioning factors present in the wild, the feet of horses grow overly large and long unless trimmed regularly. Hence, protection from rocks, pebbles, and hard, uneven surfaces is lacking. A balanced diet with proper ": null
    },
    {
        "nutrition": "Equine Nutrition"
    },
    {
        " also is a factor. Without these precautions, cracks in overgrown and overly brittle hoof walls are a danger, as is bruising of the soft tissues within the foot because of inadequately thick and hard sole material.       Abnormal stress: Horses hooves can become quite worn out when subjected to the added weight and stress of a rider, pack load, cart, or ": null
    },
    {
        "wagon": "Wagon"
    },
    {
        ". Ensminger, M. E. Horses and Horsemanship: Animal Agriculture Series. Sixth edition. Interstate Publishers, 1990, , pp. 367–371.    ": null
    },
    {
        "Farriers": "Farrier"
    },
    {
        "may forge custom shoes to help horses with bone or musculature problems in their legs, Ensminger, M. E. Horses & Tack: A Complete One Volume Reference on Horses and Their Care. Rev. edn Boston: Houghton Mifflin Co., 1991, , pp. 267–269. or fit commercially available remedial shoes.   Traction: Traction devices such as ": null
    },
    {
        "borium": "Borium"
    },
    {
        " for ice, ": null
    },
    {
        "horse shoe studs": "Horse Shoe Studs"
    },
    {
        " for muddy or slick conditions, calks, ": null
    },
    {
        "carbide": "Tungsten Carbide"
    },
    {
        "-tipped road nails and rims are useful for performance horses such as ": null
    },
    {
        "eventers": "Eventing"
    },
    {
        ", ": null
    },
    {
        "show jumpers": "Show Jumping"
    },
    {
        ", ": null
    },
    {
        "polo ponies": "Polo"
    },
    {
        ", and other horses that perform at high speeds, over changing terrain, or in less-than-ideal footing.   Gait manipulation: Some breeds such as the ": null
    },
    {
        "Saddlebred": "Saddlebred"
    },
    {
        ", ": null
    },
    {
        "Tennessee Walking Horse": "Tennessee Walking Horse"
    },
    {
        ", and other gaited horses are judged on their high-stepping movement. Special shoeing can help enhance their natural movement.   Racing horses with weakness in their foot or leg require specialized horseshoes.        Horseshoes have long been viewed as an aid to assist horses hooves when subjected to the various unnatural conditions brought about by domestication, whether due to work conditions or stabling and management. Many generations of domestic horses bred for size, color, speed, and other traits with little regard for hoof quality and soundness make some ": null
    },
    {
        "breeds": "List Of Horse Breeds"
    },
    {
        " more dependent on horseshoes than ": null
    },
    {
        "feral horses": "Feral Horse"
    },
    {
        "such as ": null
    },
    {
        "mustang": "Mustang"
    },
    {
        "s, which develop strong hooves as a matter of ": null
    },
    {
        "natural selection": "Natural Selection"
    },
    {
        ".        Nonetheless, domestic horses do not always require shoes. When possible, a barefoot hoof, at least for part of every year, is a healthy option for most horses. However, horseshoes have their place and can help prevent excess or abnormal hoof wear and injury to the foot. Many horses go without shoes year-round, some using temporary protection such as ": null
    },
    {
        "hoof boots": "Hoof Boot"
    },
    {
        "for short-term use. McBane, Susan, A Natural Approach to Horse Management, London: Methuen, 1992, , pp. 57–60.                   Shoeing, when performed correctly, causes no pain to the animal. Farriers trim  the insensitive part of the hoof, which is the same area into which they drive the nails. This is analogous to a ": null
    },
    {
        "manicure": "Manicure"
    },
    {
        " on a human fingernail, only on a much larger scale.     Before beginning to shoe, the farrier removes the old shoe using pincers and trims the hoof wall to the desired length with nippers, a sharp pliers-like tool, and the sole and ": null
    },
    {
        "frog": "Frog"
    },
    {
        " of the hoof with a hoof knife. Shoes do not allow the hoof to wear down as it naturally would in the wild, and it can then become too long. The coffin bone inside the hoof should line up straight with both bones in the ": null
    },
    {
        "pastern": "Pastern"
    },
    {
        ". If the excess hoof is not trimmed, the bones will become misaligned, which would place stress on the legs of the animal. Evans, J. Warren, et al. The Horse. Second edition, New York: Freeman, 1990, , pp. 742–747.     Shoes are then measured to the foot and bent to the correct shape using a hammer, anvil, forge, and other modifications, such as taps for ": null
    },
    {
        "shoe studs": "Caulkin"
    },
    {
        ", are added. Farriers may either cold shoe, in which they bend the metal shoe without heating it, or hot shoe, in which they place the metal in a forge before bending it. Hot shoeing can be more time-consuming, and requires the farrier to have access to a forge; however, it usually provides a better fit, as the mark made on the hoof from the hot shoe can show how even it lies. It also allows the farrier to make more modifications to the shoe, such as drawing toe- and quarter-clips. The farrier must take care not to hold the hot shoe against the hoof too long, as the heat can damage the hoof.     Hot shoes are placed in water to cool them off. The farrier then nails the shoes on, by driving the nails into the hoof wall at the ": null
    },
    {
        "white line": "Horse Hoof"
    },
    {
        " of the hoof. The nails are shaped in such a way that they bend outward as they are driven in, avoiding the sensitive inner part of the foot, so they emerge on the sides of the hoof. When the nail has been completely driven, the farrier cuts off the sharp points and uses a clincher or a clinching block with hammer to bend the rest of the nail so it is almost flush with the hoof wall. This prevents the nail from getting caught on anything, and also helps to hold the nail, and therefore the shoe, in place.     The farrier then uses a rasp , to smooth the edge where it meets the shoe and eliminate any sharp edges left from cutting off the nails.       Mistakes are sometimes made by even a skilled farrier, especially if the horse does not stand still. This may sometimes result in a nail coming too close to the sensitive part of the hoof , or a nail that is driven slightly into the sensitive hoof, called quicking or ": null
    },
    {
        "nail prick": "Nail Prick"
    },
    {
        "ing. This occurs when a nail penetrates the wall and hits the sensitive internal structures of the foot. Quicking results in bleeding and pain and the horse may show signs of ": null
    },
    {
        "lameness": "Lameness"
    },
    {
        " or may become lame in following days. Whenever it happens, the farrier must remove the offending nail. Usually a horse that is quicked will react immediately, though some cases where the nail is close to sensitive structures may not cause immediate problems. These mistakes are made occasionally by anyone who shoes horses, and in most cases is not an indication that the farrier is unskilled. It happens most commonly when horses move around while being shod, but also may occur if the hoof wall is particularly thin , or if the hoof wall is brittle or damaged. It may also occur with an inexperienced or unskilled horseshoer who misdrives a nail, uses a shoe that is too small, or has not fitted the shoe to the shape of the horses hoof. Occasionally, manufacturing defects in nails or shoes may also cause a misdriven nail that quicks a horse.     However, the term farrier implies a professional horseshoer with skill, education, and training. Some people who shoe horses are untrained or unskilled, and likely to do more harm than good for the horse. People who do not understand the horses foot will not trim the hoof correctly. This can cause serious problems for the animal, resulting in chronic lameness and damage to the hoof wall. Poor trimming will usually place the hoof at an incorrect angle, leave the foot laterally unbalanced and may cut too much off certain areas of the hoof wall, or trim too much of the frog or sole. Some horseshoers will rasp the hoof down to fit an improperly shaped or too-small size of shoe, which is damaging to the movement of the horse and can damage the hoof itself if trimmed or rasped too short. A poor horseshoer can also make mistakes in the shoeing process itself, not only quicking a horse, but also putting the shoe on crooked, using the wrong type of shoe for the job at hand, shaping the shoe improperly, or setting it on too far forward or back.                    Horseshoes have long been considered lucky. They were originally made of iron, a material that was believed to ward off evil spirits, and traditionally were held in place with seven nails, seven being the luckiest number.  The superstition acquired a further Christian twist due to a legend surrounding the 10th-century saint ": null
    },
    {
        "Dunstan": "Dunstan"
    },
    {
        ", who worked as a blacksmith before becoming Archbishop of Canterbury. The legend recounts that, one day, the Devil walked into Dunstans shop and asked him to shoe his horse. Dunstan pretended not to recognize him, and agreed to the request; but rather than nailing the shoe to the horses hoof, he nailed it to the Devils own foot, causing him great pain. Dunstan eventually agreed to remove the shoe, but only after extracting a promise that the Devil would never enter a household with a horseshoe nailed to the door.      Opinion is divided as to which way up the horseshoe ought to be nailed. Some say the ends should point up, so that the horseshoe catches the luck, and that the ends pointing down allow the good luck to be lost; others say they should point down, so that the luck is poured upon those entering the home.   Superstitious sailors believe that nailing a horseshoe to the mast will help their vessel avoid storms. Eyers, Jonathan . Dont Shoot the Albatross!: Nautical Myths and Superstitions. London: A & C Black, .           In heraldry, horseshoes most often occur as ": null
    },
    {
        "canting": "Canting Arms"
    },
    {
        " charges, such as in the arms of families with names like Farrier, Marshall and Smith. A horseshoe also appears in the arms of ": null
    },
    {
        "Hammersmith and Fulham": "London Borough Of Hammersmith And Fulham"
    },
    {
        ", a borough in London.  The flag of ": null
    },
    {
        "Rutland": "Rutland"
    },
    {
        ", Englands smallest ": null
    },
    {
        "historic county": "Historic Counties Of England"
    },
    {
        ", consists of a golden horseshoe laid over a field scattered with acorns.  This references an ancient tradition in which every noble visiting Oakham, Rutlands county town, presents a horseshoe to the Lord of the Manor, which is then nailed to the wall of ": null
    },
    {
        "Oakham Castle": "Oakham Castle"
    },
    {
        ". Over the centuries, the Castle has amassed a vast collection of horseshoes, the oldest of which date from the 15th century.           The sport of ": null
    },
    {
        "horseshoes": "Horseshoes"
    }
]