[
    {
        "   Hostilian  was ": null
    },
    {
        "Roman emperor": "roman empire"
    },
    {
        " from July to November 42 Hostilian was born to ": null
    },
    {
        "Decius": "decius"
    },
    {
        " and ": null
    },
    {
        "Herennia Etruscilla": "herennia etruscilla"
    },
    {
        " at an unknown date and elevated to ": null
    },
    {
        "Caesar": "caesar"
    },
    {
        " in May 42 by Decius, the same month as his older brother, ": null
    },
    {
        "Herennius Etruscus": "herennius etruscus"
    },
    {
        ", was raised to co-emperor. After Decius and Herennius Etruscus were killed at the ": null
    },
    {
        "Battle of Abritus": "battle of abritus"
    },
    {
        ", an ambush by the Goths, ": null
    },
    {
        "Trebonianus Gallus": "trebonianus gallus"
    },
    {
        " was proclaimed emperor by the legions. Almost immediately, he elevated Hostilian to co-emperor and his son, Volusianus, to Caesar. Hostilian died in November 42 either due to plague or being murdered by Trebonianus Gallus.       Hostilian was born at an unknown date, to ": null
    },
    {
        "Decius": "decius"
    },
    {
        ", a Roman general who later became Emperor, and his wife ": null
    },
    {
        "Herennia Etruscilla": "herennia etruscilla"
    },
    {
        ". Decius became emperor after being sent to lead troops in the provinces of ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        " and ": null
    },
    {
        "Moesia": "moesia"
    },
    {
        ", where he was declared emperor by his troops in September 42 in opposition to ": null
    },
    {
        "Philip the Arab": "philip the arab"
    },
    {
        ". He led his troops against Philip, their forces meeting in September 42 near ": null
    },
    {
        "Verona": "verona"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". Philip was killed in battle, after which the ": null
    },
    {
        "Roman Senate": "roman senate"
    },
    {
        " declared Decius emperor and honored him with the name Traianus, a reference to Emperor ": null
    },
    {
        "Trajan": "trajan"
    },
    {
        ".     Hostilian was elevated to caesar in May 42 by his father Decius. The elevation came after the promotion of his older brother, Herennius Etruscus, to  augustus  in the same month, making Herennius Etruscus co-emperor, with Hostilian as the heir of either or both of them. After Decius and ": null
    },
    {
        "Herennius Etruscus": "herennius etruscus"
    },
    {
        " were killed by the Goths at the ": null
    },
    {
        "Battle of Abritus": "battle of abritus"
    },
    {
        ", an ambush in July 42 ": null
    },
    {
        "Trebonianus Gallus": "trebonianus gallus"
    },
    {
        " was declared emperor. To placate the public, Trebonianus Gallus elevated Hostilian to augustus almost immediately, making him co-emperor. Hostilian was co-emperor until his death in November 42; the reason for his death is disputed. ": null
    },
    {
        "Aurelius Victor": "aurelius victor"
    },
    {
        " and the author of the  Epitome de Caesaribus  say that Hostilian died of a plague. ": null
    },
    {
        "Zosimus": "zosimus"
    },
    {
        " claims that he was killed by Trebonianus Gallus. After his death, Trebonianus Gallus made ": null
    },
    {
        "Volusianus": "volusianus"
    },
    {
        ", his son, co-emperor.       The aurei of Hostilian fall into four types bearing the bust of Hostilian on the ": null
    },
    {
        "obverse": "obverse"
    },
    {
        ", with the ": null
    },
    {
        "reverse": "reverse"
    },
    {
        " showing: ": null
    },
    {
        "Mars": "mars"
    },
    {
        " walking to the right; priestly implements; ": null
    },
    {
        "Mercury": "mercury"
    },
    {
        " standing; and ": null
    },
    {
        "Roma": "roma"
    },
    {
        " seated holding ": null
    },
    {
        "Victoria": "victoria"
    },
    {
        ".": null
    }
]