[
    {
        "               A hotel is an establishment that provides paid ": null
    },
    {
        "lodging": "Lodging"
    },
    {
        " on a short-term basis. Facilities provided may range from a modest-quality mattress in a small room to large suites with bigger, higher-quality beds, a dresser, a refrigerator and other kitchen facilities, upholstered chairs, a flat screen television, and ": null
    },
    {
        "en-suite bathroom": "En-Suite"
    },
    {
        "s. Small, lower-priced hotels may offer only the most basic guest services and facilities. Larger, higher-priced hotels may provide additional guest facilities such as a swimming pool, business centre , childcare, conference and event facilities, tennis or basketball courts, gymnasium, restaurants, day spa, and social function services. Hotel rooms are usually ": null
    },
    {
        "numbered": "Room Number"
    },
    {
        "  to allow guests to identify their room. Some boutique, high-end hotels have custom decorated rooms. Some hotels offer meals as part of a room and board arrangement. In the United Kingdom, a hotel is required by law to serve food and drinks to all guests within certain stated hours. In ": null
    },
    {
        "Japan": "Japan"
    },
    {
        ", ": null
    },
    {
        "capsule hotels": "Capsule Hotel"
    },
    {
        "provide a tiny room suitable only for sleeping and shared bathroom facilities.     The precursor to the modern hotel was the ": null
    },
    {
        "inn": "Inn"
    },
    {
        " of ": null
    },
    {
        "medieval Europe": "Medieval Europe"
    },
    {
        ". For a period of about 200 years from the mid-17th century, ": null
    },
    {
        "coaching inns": "Coaching Inn"
    },
    {
        "served as a place for lodging for ": null
    },
    {
        "coach": "Coach"
    },
    {
        " travelers. Inns began to cater to richer clients in the mid-18th century. One of the first hotels in a modern sense was opened in ": null
    },
    {
        "Exeter": "Exeter"
    },
    {
        " in 1768. Hotels proliferated throughout ": null
    },
    {
        "Western Europe": "Western Europe"
    },
    {
        " and ": null
    },
    {
        "North America": "North America"
    },
    {
        " in the early 19th century, and luxury hotels began to spring up in the later part of the 19th century.     Hotel operations vary in size, function, complexity, and cost. Most hotels and major hospitality companies have set industry standards to classify hotel types. An upscale full-service hotel facility offers ": null
    },
    {
        "luxury": "Luxury Goods"
    },
    {
        " amenities, full service accommodations, an on-site ": null
    },
    {
        "restaurant": "Restaurant"
    },
    {
        ", and the highest level of personalized service, such as a ": null
    },
    {
        "concierge": "Concierge"
    },
    {
        ", ": null
    },
    {
        "room service": "Room Service"
    },
    {
        ", and clothes pressing staff. ": null
    },
    {
        "Full service hotels": "Conference And Resort Hotels"
    },
    {
        " often contain upscale full-service facilities with many full-service accommodations, an on-site full-service ": null
    },
    {
        "restaurant": "Restaurant"
    },
    {
        ", and a variety of on-site ": null
    },
    {
        "amenities": "Amenity"
    },
    {
        ". ": null
    },
    {
        "Boutique hotels": "Boutique Hotel"
    },
    {
        "are smaller independent, non-branded hotels that often contain upscale facilities. Small to medium-sized hotel establishments offer a limited amount of on-site ": null
    },
    {
        "amenities": "Amenity"
    },
    {
        ". Economy hotels are small to medium-sized hotel establishments that offer basic accommodations with little to no services. ": null
    },
    {
        "Extended stay hotels": "Extended Stay Hotel"
    },
    {
        "are small to medium-sized hotels that offer longer-term full service accommodations compared to a traditional hotel.     ": null
    },
    {
        "Timeshare": "Timeshare"
    },
    {
        " and ": null
    },
    {
        "destination clubs": "Destination Clubs"
    },
    {
        " are a form of property ownership involving ownership of an individual unit of accommodation for seasonal usage. A ": null
    },
    {
        "motel": "Motel"
    },
    {
        " is a small-sized low-rise lodging with direct access to individual rooms from the car park. ": null
    },
    {
        "Boutique hotels": "Boutique Hotel"
    },
    {
        "are typically hotels with a unique environment or intimate setting. A number of hotels have entered the public consciousness through popular culture, such as the ": null
    },
    {
        "Ritz Hotel": "The Ritz London Hotel"
    },
    {
        " in ": null
    },
    {
        "London": "London"
    },
    {
        ". Some hotels are built specifically as a destination in itself, for example at ": null
    },
    {
        "casinos": "Casino"
    },
    {
        "and holiday ": null
    },
    {
        "resort": "Resort"
    },
    {
        "s.     Most hotel establishments are run by a ": null
    },
    {
        "General Manager": "General Manager"
    },
    {
        " who serves as the head executive , department heads who oversee various departments within a hotel , ": null
    },
    {
        "middle manager": "Middle Manager"
    },
    {
        "s, ": null
    },
    {
        "administrative": "Administration Of Business"
    },
    {
        " staff, and line-level supervisors. The organizational chart and volume of job positions and hierarchy varies by hotel size, function and class, and is often determined by hotel ownership and managing companies.       The word hotel is derived from the ": null
    },
    {
        "French": "French Language"
    },
    {
        " hôtel , which referred to a French version of a building seeing frequent visitors, and providing care, rather than a place offering accommodation. In contemporary French usage, hôtel now has the same meaning as the English term, and  hôtel particulier  is used for the old meaning, as well as hôtel in some place names such as ": null
    },
    {
        "Hôtel-Dieu": "Hôtel-Dieu De Paris"
    },
    {
        " , which has been a hospital since the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ". The French spelling, with the ": null
    },
    {
        "circumflex": "Circumflex"
    },
    {
        ", was also used in English, but is now rare. The circumflex replaces the s found in the earlier  hostel  spelling, which over time took on a new, but closely related meaning. Grammatically, hotels usually take the ": null
    },
    {
        "definite article": "Definite Article"
    },
    {
        " – hence The Astoria Hotel or simply The Astoria.          Facilities offering hospitality to travellers have been a feature of the earliest civilizations. In ": null
    },
    {
        "Greco-Roman culture": "Greco-Roman Culture"
    },
    {
        " and ": null
    },
    {
        "ancient Persia": "Ancient Persia"
    },
    {
        ", hospitals for recuperation and rest were built at ": null
    },
    {
        "thermal bath": "Thermal Bath"
    },
    {
        "s. Japans ": null
    },
    {
        "Nishiyama Onsen Keiunkan": "Nishiyama Onsen Keiunkan"
    },
    {
        ", founded in 705, was officially recognised by the ": null
    },
    {
        "Guinness World Records": "Guinness World Records"
    },
    {
        " as the oldest hotel in the world.  During the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ", various religious orders at ": null
    },
    {
        "monasteries": "Monastery"
    },
    {
        " and ": null
    },
    {
        "abbeys": "Abbey"
    },
    {
        "would offer accommodation for travellers on the road.     The precursor to the modern hotel was the ": null
    },
    {
        "inn": "Inn"
    },
    {
        " of ": null
    },
    {
        "medieval Europe": "Medieval Europe"
    },
    {
        ", possibly dating back to the rule of ": null
    },
    {
        "Ancient Rome": "Ancient Rome"
    },
    {
        ". These would provide for the needs of travellers, including food and lodging, ": null
    },
    {
        "stabling": "Stable"
    },
    {
        " and ": null
    },
    {
        "fodder": "Fodder"
    },
    {
        " for the travellers horse and fresh horses for the ": null
    },
    {
        "mail coach": "Mail Coach"
    },
    {
        ". Famous London examples of inns include the ": null
    },
    {
        "George": "The George, Southwark"
    },
    {
        " and the ": null
    },
    {
        "Tabard": "The Tabard"
    },
    {
        ". A typical layout of an inn had an inner court with bedrooms on the two sides, with the ": null
    },
    {
        "kitchen": "Kitchen"
    },
    {
        " and ": null
    },
    {
        "parlour": "Parlour"
    },
    {
        " at the front and the stables at the back.      For a period of about 200 years from the mid-17th century, ": null
    },
    {
        "coaching inns": "Coaching Inn"
    },
    {
        "served as a place for lodging for ": null
    },
    {
        "coach": "Coach"
    },
    {
        " travellers . Coaching ": null
    },
    {
        "inns": "Inn"
    },
    {
        "stabled teams of ": null
    },
    {
        "horses": "Horse"
    },
    {
        "for ": null
    },
    {
        "stagecoach": "Stagecoach"
    },
    {
        "es and ": null
    },
    {
        "mail coach": "Mail Coach"
    },
    {
        "es and replaced tired teams with fresh teams. Traditionally they were seven miles apart, but this depended very much on the terrain.        Some ": null
    },
    {
        "English": "England"
    },
    {
        " towns had as many as ten such ": null
    },
    {
        "inns": "Inn"
    },
    {
        "and rivalry between them was intense, not only for the income from the stagecoach operators but for the revenue for food and drink supplied to the wealthy passengers. By the end of the century, coaching inns were being run more professionally, with a regular timetable being followed and fixed menus for food. Coaching Era, The: Stage and Mail Coach Travel in and Around Bath, Bristol and Somerset, Roy Gallop, Fiducia ,      Inns began to cater for richer clients in the mid-18th century, and consequently grew in grandeur and the level of service provided. One of the first hotels in a modern sense was ": null
    },
    {
        "opened": "Royal Clarence Hotel"
    },
    {
        " in ": null
    },
    {
        "Exeter": "Exeter"
    },
    {
        " in 1768, although the idea only really caught on in the early 19th century. In 1812, Mivarts Hotel opened its doors in ": null
    },
    {
        "London": "London"
    },
    {
        ", later changing its name to ": null
    },
    {
        "Claridges": "Claridges"
    },
    {
        ".      Hotels proliferated throughout ": null
    },
    {
        "Western Europe": "Western Europe"
    },
    {
        " and ": null
    },
    {
        "North America": "North America"
    },
    {
        " in the 19th century, and luxury hotels, including the ": null
    },
    {
        "Savoy Hotel": "Savoy Hotel"
    },
    {
        " in the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " and the ": null
    },
    {
        "Ritz chain of hotels": "César Ritz"
    },
    {
        " in ": null
    },
    {
        "London": "London"
    },
    {
        " and ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " and ": null
    },
    {
        "Tremont House": "Tremont House"
    },
    {
        " and ": null
    },
    {
        "Astor House": "Astor House"
    },
    {
        " in the ": null
    },
    {
        "United States": "United States"
    },
    {
        ",  began to spring up in the later part of the century, catering to an extremely wealthy clientele.       Hotels cater to travelers from many countries and languages, since no one country dominates the travel industry.            Hotel operations vary in size, function, and cost. Most hotels and major hospitality companies that operate hotels have set widely accepted industry standards to classify hotel types. General categories include the following:     International luxury      International luxury hotels offer high quality amenities, full service accommodations, on-site full-service restaurants, and the highest level of personalized and professional service in major or capital cities. International luxury hotels are classified with at least a ": null
    },
    {
        "Five Diamond": "Aaa Five Diamond Award"
    },
    {
        " rating or ": null
    },
    {
        "Five Star": "Star"
    },
    {
        " hotel rating": "Hotel Rating"
    },
    {
        " depending on the country and local classification standards. Examples include: Grand Hyatt , Waldorf Astoria , Conrad , InterContinental , Sofitel , Mandarin Oriental , Four Seasons , The Peninsula , Rosewood , St. Regis , JW Marriott and The Ritz-Carlton .     Lifestyle luxury resorts      Lifestyle luxury ": null
    },
    {
        "resorts": "Resorts"
    },
    {
        " are branded hotels that appeal to a guest with lifestyle or personal image in specific locations. They are typically full-service and classified as luxury. A key characteristic of lifestyle resorts are focus on providing a unique guest experience as opposed to simply providing lodging. Normally, lifestyle resorts are classified with a Five Star hotel rating depending on the country and local classification standards. Examples include: ": null
    },
    {
        "W Hotels": "W Hotels"
    },
    {
        ", ": null
    },
    {
        "Shangri-La": "Shangri-La Hotels And Resorts"
    },
    {
        ", ": null
    },
    {
        "Sheraton": "Sheraton Hotels And Resorts"
    },
    {
        ", ": null
    },
    {
        "Oberoi": "The Oberoi Group"
    },
    {
        ", ": null
    },
    {
        "Belmond": "Belmond Limited"
    },
    {
        ", ": null
    },
    {
        "Jumeirah": "Jumeirah"
    },
    {
        ", ": null
    },
    {
        "Aman": "Aman Resorts"
    },
    {
        ", ": null
    },
    {
        "Taj Hotels": "Taj Hotels"
    },
    {
        ", ": null
    },
    {
        "Hoshino": "Hoshino Resorts"
    },
    {
        ", ": null
    },
    {
        "Raffles": "Raffles Hotels  &  Resorts"
    },
    {
        ", ": null
    },
    {
        "Fairmont": "Fairmont Hotels And Resorts"
    },
    {
        ", ": null
    },
    {
        "Banyan Tree": "Banyan Tree Holdings"
    },
    {
        ", ": null
    },
    {
        "Regent": "Regent Hotels  &  Resorts"
    },
    {
        " and ": null
    },
    {
        "Park Hyatt": "Park Hyatt"
    },
    {
        ".     Upscale full-service": null
    },
    {
        "Upscale full service hotels": "Conference And Resort Hotels"
    },
    {
        " often provide a wide array of guest services and on-site facilities. Commonly found amenities may include: on-site food and beverage , meeting and conference services and facilities, fitness center, and business center. Upscale full-service hotels range in quality from upscale to luxury. This classification is based upon the quality of facilities and amenities offered by the hotel.  Examples include: ": null
    },
    {
        "Langham": "Langham Hospitality Group"
    },
    {
        ", ": null
    },
    {
        "Kempinski": "Kempinski"
    },
    {
        ",   ": null
    },
    {
        "Kimpton Hotels": "Kimpton Hotels  &  Restaurants"
    },
    {
        ", ": null
    },
    {
        "Hilton": "Hilton Hotels  &  Resorts"
    },
    {
        ", ": null
    },
    {
        "Lotte": "Lotte Hotels  &  Resorts"
    },
    {
        ", ": null
    },
    {
        "Renaissance": "Renaissance Hotels"
    },
    {
        ", ": null
    },
    {
        "Marriott": "Marriott International"
    },
    {
        " and ": null
    },
    {
        "Hyatt Regency": "Hyatt Regency"
    },
    {
        " brands.     Boutique": null
    },
    {
        "Boutique hotels": "Boutique Hotel"
    },
    {
        "are smaller independent non-branded hotels that often contain mid-scale to upscale facilities of varying size in unique or intimate settings with full service accommodations. These hotels are generally 100 rooms or fewer.      Focused or select service": null
    },
    {
        "Hyatt Place": "Hyatt Place"
    },
    {
        ", ": null
    },
    {
        "Holiday Inn": "Holiday Inn"
    },
    {
        ", ": null
    },
    {
        "Courtyard by Marriott": "Courtyard By Marriott"
    },
    {
        " and ": null
    },
    {
        "Hilton Garden Inn": "Hilton Garden Inn"
    },
    {
        ".     Economy and limited service": null
    },
    {
        "Ibis Budget": "Ibis Budget"
    },
    {
        ", ": null
    },
    {
        "Hampton Inn": "Hampton Inn"
    },
    {
        ", ": null
    },
    {
        "Aloft": "Aloft Hotels"
    },
    {
        ", ": null
    },
    {
        "Holiday Inn Express": "Holiday Inn Express"
    },
    {
        ", ": null
    },
    {
        "Fairfield Inn": "Fairfield Inn By Marriott"
    },
    {
        ", ": null
    },
    {
        "Four Points by Sheraton": "Four Points By Sheraton"
    },
    {
        ".     Extended stay": null
    },
    {
        "Extended stay hotels": "Extended Stay Hotel"
    },
    {
        "are small to medium-sized hotels that offer longer term full service accommodations compared to a traditional hotel. Extended stay hotels may offer non-traditional pricing methods such as a weekly rate that caters towards travelers in need of short-term accommodations for an extended period of time. Similar to limited and select service hotels, on-site amenities are normally limited and most extended stay hotels lack an on-site restaurant. Examples include ": null
    },
    {
        "Staybridge Suites": "Staybridge Suites"
    },
    {
        ", ": null
    },
    {
        "Candlewood Suites": "Candlewood Suites"
    },
    {
        ", ": null
    },
    {
        "Homewood Suites by Hilton": "Homewood Suites By Hilton"
    },
    {
        ", ": null
    },
    {
        "Home2 Suites by Hilton": "Home2 Suites By Hilton"
    },
    {
        ", ": null
    },
    {
        "Residence Inn by Marriott": "Residence Inn By Marriott"
    },
    {
        ", ": null
    },
    {
        "Element": "Element By Westin"
    },
    {
        ", and ": null
    },
    {
        "Extended Stay America": "Extended Stay America"
    },
    {
        ".     Timeshare and destination clubs": null
    },
    {
        "Timeshare": "Timeshare"
    },
    {
        " and ": null
    },
    {
        "Destination clubs": "Destination Clubs"
    },
    {
        " are a form of property ownership also referred to as a vacation ownership involving the purchase and ownership of an individual unit of accommodation for seasonal usage during a specified period of time. Timeshare resorts often offer amenities similar that of a Full service hotel with on-site restaurant, swimming pools, recreation grounds, and other leisure-oriented amenities. Destination clubs on the other hand may offer more exclusive private accommodations such as private houses in a neighborhood-style setting. Examples of timeshare brands include ": null
    },
    {
        "Hilton Grand Vacations": "Hilton Grand Vacations"
    },
    {
        ", ": null
    },
    {
        "Marriott Vacation Club International": "Marriott Vacation Club International"
    },
    {
        ", ": null
    },
    {
        "Westgate Resorts": "Westgate Resorts"
    },
    {
        ", ": null
    },
    {
        "Disney Vacation Club": "Disney Vacation Club"
    },
    {
        ", and ": null
    },
    {
        "Holiday Inn Club Vacations": "Holiday Inn"
    },
    {
        ".     Motel": null
    },
    {
        "motel": "Motel"
    },
    {
        ", an abbreviation for motor hotel , is a small-sized low-rise lodging establishment similar to a limited service, lower-cost hotel, but typically with direct access to individual rooms from the car park. Motels were built to serve road travellers, including travellers on road trip vacations and workers who drive for their job . Common during the 1950s and 1960s, motels were often located adjacent to a major highway, where they were built on inexpensive land at the edge of towns or along stretches of freeway.     New motel construction is rare in the 2000s as hotel chains have been building economy-priced, limited service franchised properties at freeway exits which compete for largely the same clientele, largely saturating the market by the 1990s. Motels are still useful in less populated areas for driving travelers, but the more populated an area becomes, the more hotels move in to meet the demand for accommodation. While many motels are unbranded and independent, many of the other motels which remain in operation joined national franchise chains, often rebranding themselves as hotels, inns or lodges. Some examples of chains with motels include ": null
    },
    {
        "EconoLodge": "Econolodge"
    },
    {
        ", ": null
    },
    {
        "Motel 6": "Motel 6"
    },
    {
        ", ": null
    },
    {
        "Super 8": "Super 8 Motels"
    },
    {
        ", and ": null
    },
    {
        "Travelodge": "Travelodge"
    },
    {
        ".     Motels in some parts of the world are more often regarded as places for romantic assignations where rooms are often rented by the hour. This is fairly common in parts of ": null
    },
    {
        "Latin America": "Latin America"
    },
    {
        ".     Microstay": null
    },
    {
        "microstay": "Microstay"
    },
    {
        "s,  a type of booking for less than 24 hours where the customer chooses the check in time and the length of the stay. This allows the hotel increased revenue by reselling the same room several times a day.           Hotel management is a globally accepted professional career field and academic field of study. Degree programs such as ": null
    },
    {
        "hospitality management studies": "Hospitality Management Studies"
    },
    {
        ", a ": null
    },
    {
        "business degree": "Business Degree"
    },
    {
        ", and/or certification programs formally prepare hotel managers for industry practice.     Most hotel establishments consist of a ": null
    },
    {
        "General Manager": "General Manager"
    },
    {
        " who serves as the head executive , department heads who oversee various departments within a hotel, ": null
    },
    {
        "middle manager": "Middle Manager"
    },
    {
        "s, ": null
    },
    {
        "administrative": "Administration Of Business"
    },
    {
        " staff, and line-level supervisors. The organizational chart and volume of job positions and hierarchy varies by hotel size, function, and is often determined by hotel ownership and managing companies.     Unique and specialty hotels Historic inns and boutique hotels    ": null
    },
    {
        "Boutique hotels": "Boutique Hotel"
    },
    {
        "are typically hotels with a unique environment or intimate setting.   Some hotels have gained their renown through tradition, by hosting significant events or persons, such as Schloss ": null
    },
    {
        "Cecilienhof": "Cecilienhof"
    },
    {
        " in ": null
    },
    {
        "Potsdam": "Potsdam"
    },
    {
        ", ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", which derives its fame from the ": null
    },
    {
        "Potsdam Conference": "Potsdam Conference"
    },
    {
        " of the ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " allies ": null
    },
    {
        "Winston Churchill": "Winston Churchill"
    },
    {
        ", ": null
    },
    {
        "Harry Truman": "Harry Truman"
    },
    {
        " and ": null
    },
    {
        "Joseph Stalin": "Joseph Stalin"
    },
    {
        " in 1945.  The ": null
    },
    {
        "Taj Mahal Palace & Tower": "Taj Mahal Palace  &  Tower"
    },
    {
        " in ": null
    },
    {
        "Mumbai": "Mumbai"
    },
    {
        " is one of Indias most famous and historic hotels because of its association with the ": null
    },
    {
        "Indian independence movement": "Indian Independence Movement"
    },
    {
        ". Some establishments have given name to a particular meal or beverage, as is the case with the ": null
    },
    {
        "Waldorf Astoria": "Waldorf-Astoria Hotel"
    },
    {
        " in ": null
    },
    {
        "New York City": "New York City"
    },
    {
        ", United States where the ": null
    },
    {
        "Waldorf Salad": "Waldorf Salad"
    },
    {
        " was first created or the ": null
    },
    {
        "Hotel Sacher": "Hotel Sacher"
    },
    {
        " in ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        ", Austria, home of the ": null
    },
    {
        "Sachertorte": "Sachertorte"
    },
    {
        ". Others have achieved fame by association with dishes or cocktails created on their premises, such as the ": null
    },
    {
        "Hotel de Paris": "Hotel De Paris"
    },
    {
        " where the ": null
    },
    {
        "crêpe Suzette": "Crêpe Suzette"
    },
    {
        " was invented or the ": null
    },
    {
        "Raffles Hotel": "Raffles Hotel"
    },
    {
        " in ": null
    },
    {
        "Singapore": "Singapore"
    },
    {
        ", where the ": null
    },
    {
        "Singapore Sling": "Singapore Sling"
    },
    {
        " cocktail was devised.           A number of hotels have entered the public consciousness through popular culture, such as the ": null
    },
    {
        "Ritz Hotel": "The Ritz London Hotel"
    },
    {
        " in ": null
    },
    {
        "London": "London"
    },
    {
        ", through its association with ": null
    },
    {
        "Irving Berlins": "Irving Berlin"
    },
    {
        " song, ": null
    },
    {
        "Puttin on the Ritz": "Puttin On The Ritz"
    },
    {
        ". The ": null
    },
    {
        "Algonquin Hotel": "Algonquin Hotel"
    },
    {
        " in New York City is famed as the meeting place of the literary group, the ": null
    },
    {
        "Algonquin Round Table": "Algonquin Round Table"
    },
    {
        ", and ": null
    },
    {
        "Hotel Chelsea": "Hotel Chelsea"
    },
    {
        ", also in New York City, has been the subject of a number of songs and the scene of the stabbing of ": null
    },
    {
        "Nancy Spungen": "Nancy Spungen"
    },
    {
        " .     Resort hotels   Some hotels are built specifically as a destination in itself to create a captive trade, example at ": null
    },
    {
        "casino": "Casino"
    },
    {
        "s, ": null
    },
    {
        "amusement parks": "Amusement Park"
    },
    {
        "and holiday ": null
    },
    {
        "resort": "Resort"
    },
    {
        "s. Though hotels have always been built in popular destinations, the defining characteristic of a ": null
    },
    {
        "resort hotel": "Resort Hotel"
    },
    {
        " is that it exists purely to serve another attraction, the two having the same owners.     On the ": null
    },
    {
        "Las Vegas Strip": "Las Vegas Strip"
    },
    {
        " there is a tradition of ": null
    },
    {
        "one-upmanship": "One-Upmanship"
    },
    {
        " with luxurious and extravagant hotels in a concentrated area. This trend now has extended to other resorts worldwide, but the concentration in Las Vegas is still the worlds highest: nineteen of the worlds twenty-five largest hotels by room count are on the Strip, with a total of over 67,000 rooms.           ": null
    },
    {
        "Burj al-Arab": "Burj Al-Arab"
    },
    {
        " hotel in ": null
    },
    {
        "Dubai": "Dubai"
    },
    {
        ", ": null
    },
    {
        "United Arab Emirates": "United Arab Emirates"
    },
    {
        ", built on an artificial island, is structured in the shape of a boats sail.   The ": null
    },
    {
        "Library Hotel": "Library Hotel"
    },
    {
        " in New York City, is unique in that each of its ten floors is assigned one category from the ": null
    },
    {
        "Dewey Decimal System": "Dewey Decimal Classification"
    },
    {
        ".   The Jailhotel Löwengraben in ": null
    },
    {
        "Lucerne, Switzerland": "Lucerne, Switzerland"
    },
    {
        " is a converted prison now used as a hotel.   The ": null
    },
    {
        "Luxor": "Luxor"
    },
    {
        ", a hotel and casino on the Las Vegas Strip in ": null
    },
    {
        "Paradise, Nevada": "Paradise, Nevada"
    },
    {
        ", United States is unusual due to its pyramidal structure.   The ": null
    },
    {
        "Liberty Hotel": "Liberty Hotel"
    },
    {
        " in ": null
    },
    {
        "Boston": "Boston"
    },
    {
        " used to be the ": null
    },
    {
        "Charles Street Jail": "Charles Street Jail"
    },
    {
        ".   Hotel Kakslauttanen in ": null
    },
    {
        "Finland": "Finland"
    },
    {
        ", a collection of glass igloos in Lapland that allow you to watch the Northern Lights    Built in ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        " and completed in 1936, The former ": null
    },
    {
        "ocean liner": "Ocean Liner"
    },
    {
        "  in ": null
    },
    {
        "Long Beach, California": "Long Beach, California"
    },
    {
        ", United States uses its first-class staterooms as a hotel, after retiring in 1967 from Transatlantic service.   The ": null
    },
    {
        "Wigwam Motels": "Wigwam Motel"
    },
    {
        "used patented ": null
    },
    {
        "novelty architecture": "Novelty Architecture"
    },
    {
        " in which each motel room was a free-standing concrete wigwam or teepee.   Various ": null
    },
    {
        "Caboose Motel": "Caboose"
    },
    {
        " or Red Caboose Inn properties are built from decommissioned rail cars.   Throughout the world there are several hotels built from converted airliners.       The ": null
    },
    {
        "Null Stern Hotel": "Null Stern Hotel"
    },
    {
        " in ": null
    },
    {
        "Teufen": "Teufen Ar"
    },
    {
        ", ": null
    },
    {
        "Appenzellerland": "Appenzellerland"
    },
    {
        ", ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        " and the Concrete Mushrooms in ": null
    },
    {
        "Albania": "Albania"
    },
    {
        "  are former nuclear ": null
    },
    {
        "bunkers": "Bunker"
    },
    {
        "transformed into hotels.       The Cuevas Pedro Antonio de Alarcón  in ": null
    },
    {
        "Guadix": "Guadix"
    },
    {
        ", Spain, as well as several hotels in ": null
    },
    {
        "Cappadocia": "Cappadocia"
    },
    {
        ", Turkey, are notable for being built into natural cave formations, some with rooms underground. The Desert Cave Hotel in ": null
    },
    {
        "Coober Pedy, South Australia": "Coober Pedy, South Australia"
    },
    {
        " is built into the remains of an ": null
    },
    {
        "opal": "Opal"
    },
    {
        " mine.          Located on the coast but high above sea level, these hotels offer unobstructed panoramic views and a great sense of privacy without the feeling of total isolation. Some examples from around the globe are the Riosol Hotel in Gran Canaria, Caruso Belvedere Hotel in Amalfi Coast , Aman Resorts Amankila in Bali, Birkenhead House in Hermanus , The Caves in Jamaica and Caesar Augustus in Capri.           ": null
    },
    {
        "Capsule hotels": "Capsule Hotel"
    },
    {
        "are a type of economical hotel first introduced in Japan, where people sleep in stacks of rectangular containers.       Some hotels fill daytime occupancy with ": null
    },
    {
        "day rooms": "Day Room"
    },
    {
        ", for example, ": null
    },
    {
        "Rodeway Inn and Suites": "Rodeway Inn And Suites"
    },
    {
        " near ": null
    },
    {
        "Port Everglades": "Port Everglades"
    },
    {
        " in ": null
    },
    {
        "Fort Lauderdale": "Fort Lauderdale"
    },
    {
        ", ": null
    },
    {
        "Florida": "Florida"
    },
    {
        ".  Day rooms are booked in a block of hours typically between 8 am and 5 pm,  before the typical night shift. These are similar to transit hotels in that they appeal to travelers, however, unlike transit hotels, they do not eliminate the need to go through Customs.       ": null
    },
    {
        "Garden hotels": "Garden Hotels"
    },
    {
        ", famous for their gardens before they became hotels, include Gravetye Manor, the home of garden designer ": null
    },
    {
        "William Robinson": "William Robinson"
    },
    {
        ", and ": null
    },
    {
        "Cliveden": "Cliveden"
    },
    {
        ", designed by ": null
    },
    {
        "Charles Barry": "Charles Barry"
    },
    {
        " with a rose garden by ": null
    },
    {
        "Geoffrey Jellicoe": "Geoffrey Jellicoe"
    },
    {
        ".             The Ice Hotel in ": null
    },
    {
        "Jukkasjärvi": "Jukkasjärvi"
    },
    {
        ", ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ", was the first ice hotel in the world; first built in 1990, it is built each winter and melts every spring. Other ice hotels include the Igloo Village in Kakslauttanen, Finland, and the Hotel de Glace in Duschenay, Canada. They can also be included within larger ice complexes; for example, the Mammut Snow Hotel in Finland is located within the walls of the ": null
    },
    {
        "Kemi": "Kemi"
    },
    {
        " snow castle; and the Lainio Snow Hotel is part of a snow village near ": null
    },
    {
        "Ylläs": "Ylläs"
    },
    {
        ", Finland.          A love hotel is a type of short-stay hotel found around the world, operated primarily for the purpose of allowing guests privacy for ": null
    },
    {
        "sexual activities": "Human Sexual Activity"
    },
    {
        ", typically for one to three hours, but with overnight as an option. Styles of premises vary from extremely low-end to extravagantly appointed. In Japan, love hotels have a history of over 400 years.           A referral hotel is a hotel chain that offers branding to independently-operated hotels; the chain itself is founded by or owned by the member hotels as a group. Many former referral chains have been converted to franchises; the largest surviving member-owned chain is ": null
    },
    {
        "Best Western": "Best Western"
    },
    {
        ".             The first recorded purpose-built railway hotel was the ": null
    },
    {
        "Great Western Hotel": "Great Western Hotel, Reading"
    },
    {
        ", which opened adjacent to ": null
    },
    {
        "Reading railway station": "Reading Railway Station"
    },
    {
        " in 1844, shortly after the ": null
    },
    {
        "Great Western Railway": "Great Western Railway"
    },
    {
        " opened its line from London. The building still exists, and although it has been used for other purposes over the years, it is now again a hotel and a member of the ": null
    },
    {
        "Malmaison hotel chain": "Malmaison"
    },
    {
        ".        Frequently, expanding railway companies built grand hotels at their termini, such as the ": null
    },
    {
        "Midland Hotel, Manchester": "Midland Hotel, Manchester"
    },
    {
        " next to ": null
    },
    {
        "the former Manchester Central Station": "Manchester Central Railway Station"
    },
    {
        ", and in London the ones above ": null
    },
    {
        "St Pancras railway station": "St Pancras Railway Station"
    },
    {
        " and ": null
    },
    {
        "Charing Cross railway station": "Charing Cross Railway Station"
    },
    {
        ". London also has the Chiltern Court Hotel above ": null
    },
    {
        "Baker Street tube station": "Baker Street Tube Station"
    },
    {
        ", there are also ": null
    },
    {
        "Canadas grand railway hotels": "Canadas Grand Railway Hotels"
    },
    {
        ". They are or were mostly, but not exclusively, used by those traveling by rail.       The Maya Guesthouse in Nax Mont-Noble in the Swiss Alps, is the first hotel in Europe built entirely with straw bales. Due to the insulation values of the walls it needs no conventional heating or air conditioning system, although the Maya Guesthouse is built at an altitude of  in the Alps.           Transit hotels are short stay hotels typically used at international airports where passengers can stay while waiting to change airplanes. The hotels are typically on the ": null
    },
    {
        "airside": "Airside"
    },
    {
        " and do not require a visa for a stay or re-admission through security checkpoints.       Some hotels are built with living trees as structural elements, for example the Treehotel near ": null
    },
    {
        "Piteå": "Piteå"
    },
    {
        ", ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ", the Costa Rica Tree House in the Gandoca-Manzanillo Wildlife Refuge, ": null
    },
    {
        "Costa Rica": "Costa Rica"
    },
    {
        "; the ": null
    },
    {
        "Treetops Hotel": "Treetops Hotel"
    },
    {
        " in ": null
    },
    {
        "Aberdare National Park": "Aberdare National Park"
    },
    {
        ", ": null
    },
    {
        "Kenya": "Kenya"
    },
    {
        "; the ": null
    },
    {
        "Ariau Towers": "Ariau Towers"
    },
    {
        " near ": null
    },
    {
        "Manaus": "Manaus"
    },
    {
        ", ": null
    },
    {
        "Brazil": "Brazil"
    },
    {
        ", on the ": null
    },
    {
        "Rio Negro": "Rio Negro"
    },
    {
        " in the ": null
    },
    {
        "Amazon": "Amazon Basin"
    },
    {
        "; and Bayrams Tree Houses in ": null
    },
    {
        "Olympos": "Olympos"
    },
    {
        ", ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        ".          Some hotels have accommodation underwater, such as ": null
    },
    {
        "Utter Inn": "Utter Inn"
    },
    {
        " in ": null
    },
    {
        "Lake Mälaren": "Lake Mälaren"
    },
    {
        ", Sweden. ": null
    },
    {
        "Hydropolis": "Hydropolis"
    },
    {
        ", project in ": null
    },
    {
        "Dubai": "Dubai"
    },
    {
        ", would have had suites on the bottom of the ": null
    },
    {
        "Persian Gulf": "Persian Gulf"
    },
    {
        ", and ": null
    },
    {
        "Jules Undersea Lodge": "Jules Undersea Lodge"
    },
    {
        " in ": null
    },
    {
        "Key Largo": "Key Largo"
    },
    {
        ", ": null
    },
    {
        "Florida": "Florida"
    },
    {
        " requires ": null
    },
    {
        "scuba diving": "Scuba Diving"
    },
    {
        " to access its rooms.          A ": null
    },
    {
        "resort island": "Resort Island"
    },
    {
        " is an island or an archipelago that contains resorts, hotels, overwater bungalows, restaurants, tourist attractions and its amenities. ": null
    },
    {
        "Maldives": "Maldives"
    },
    {
        " has the most overwater bungalows resorts.              In 2006,  Guinness World Records  listed the ": null
    },
    {
        "First World Hotel": "First World Hotel"
    },
    {
        " in ": null
    },
    {
        "Genting Highlands": "Genting Highlands"
    },
    {
        ", ": null
    },
    {
        "Malaysia": "Malaysia"
    },
    {
        ", as the worlds largest hotel with a total of 6,118 rooms .  The ": null
    },
    {
        "Izmailovo Hotel": "Izmailovo Hotel"
    },
    {
        " in ": null
    },
    {
        "Moscow": "Moscow"
    },
    {
        " has the most beds, with 7,500, followed by ": null
    },
    {
        "The Venetian": "The Venetian Las Vegas"
    },
    {
        " and ": null
    },
    {
        "The Palazzo": "The Palazzo"
    },
    {
        " complex in Las Vegas and ": null
    },
    {
        "MGM Grand Las Vegas": "Mgm Grand Las Vegas"
    },
    {
        " complex .        According to the ": null
    },
    {
        "Guinness Book of World Records": "Guinness Book Of World Records"
    },
    {
        ", the oldest hotel in operation is the ": null
    },
    {
        "Nisiyama Onsen Keiunkan in Yamanashi": "Nisiyama Onsen Keiunkan In Yamanashi"
    },
    {
        ", Japan. The hotel, first opened in AD 707, has been operated by the same family for forty-six generations. The title was held until 2011 by the ": null
    },
    {
        "Hoshi Ryokan": "Hoshi Ryokan"
    },
    {
        ", in the Awazu Onsen area of ": null
    },
    {
        "Komatsu": "Komatsu, Ishikawa"
    },
    {
        ", Japan, which opened in the year 718, as the history of the Nisiyama Onsen Keiunkan was virtually unknown.        The ": null
    },
    {
        "Rosewood Guangzhou": "Rosewood Guangzhou"
    },
    {
        " located on the top 39 floors of the 108-story ": null
    },
    {
        "Guangzhou CTF Finance Centre": "Guangzhou Ctf Finance Centre"
    },
    {
        " in ": null
    },
    {
        "Tianhe District": "Tianhe District"
    },
    {
        ", ": null
    },
    {
        "Guangzhou": "Guangzhou"
    },
    {
        ", China. Soaring to 530-meters at its highest point, earns the singular status as the world’s highest hotel.         In October 2014, the ": null
    },
    {
        "Anbang Insurance Group": "Anbang Insurance Group"
    },
    {
        ", based in ": null
    },
    {
        "China": "China"
    },
    {
        ", purchased the ": null
    },
    {
        "Waldorf Astoria New York": "Waldorf Astoria New York"
    },
    {
        " in ": null
    },
    {
        "Manhattan": "Manhattan"
    },
    {
        " for US$1.95 billion, making it the worlds most expensive hotel ever sold.              A number of public figures have notably chosen to take up semi-permanent or permanent residence in hotels.   Fashion designer ": null
    },
    {
        "Coco Chanel": "Coco Chanel"
    },
    {
        " lived in the ": null
    },
    {
        "Hôtel Ritz": "Hôtel Ritz"
    },
    {
        ", Paris, on and off for more than 30 years.   Inventor ": null
    },
    {
        "Nikola Tesla": "Nikola Tesla"
    },
    {
        " lived the last ten years of his life at the ": null
    },
    {
        "New Yorker Hotel": "New Yorker Hotel"
    },
    {
        " until he died in his room in 1943.   ": null
    },
    {
        "Larry Fine": "Larry Fine"
    },
    {
        "  and his family lived in hotels, due to his extravagant spending habits and his wifes dislike for housekeeping. They first lived in the President Hotel in ": null
    },
    {
        "Atlantic City, New Jersey": "Atlantic City, New Jersey"
    },
    {
        ", where his daughter Phyllis was raised, then the Knickerbocker Hotel in ": null
    },
    {
        "Hollywood": "Hollywood"
    },
    {
        ". Not until the late 1940s did Larry buy a home in the ": null
    },
    {
        "Los Feliz area of Los Angeles": "Los Feliz, Los Angeles"
    },
    {
        ".   The ": null
    },
    {
        "Waldorf-Astoria Hotel": "Waldorf-Astoria Hotel"
    },
    {
        " and its affiliated Waldorf Towers has been the home of many famous persons over the years including former President ": null
    },
    {
        "Herbert Hoover": "Herbert Hoover"
    },
    {
        " who lived there from the end of his presidency in 1933 until his death in 1964. General ": null
    },
    {
        "Douglas MacArthur": "Douglas Macarthur"
    },
    {
        " lived his last 14 years in the penthouse of the Waldorf Towers. And the composer ": null
    },
    {
        "Cole Porter": "Cole Porter"
    },
    {
        " also spent the last 25 years of his life in an apartment at the Waldorf Towers.   Billionaire ": null
    },
    {
        "Howard Hughes": "Howard Hughes"
    },
    {
        " lived in hotels during the last ten years of his life , primarily in Las Vegas, as well as ": null
    },
    {
        "Acapulco": "Acapulco"
    },
    {
        ", ": null
    },
    {
        "Beverly Hills": "Beverly Hills"
    },
    {
        ", ": null
    },
    {
        "Boston": "Boston"
    },
    {
        ", ": null
    },
    {
        "Freeport": "Freeport, Bahamas"
    },
    {
        ", ": null
    },
    {
        "London": "London"
    },
    {
        ", ": null
    },
    {
        "Managua": "Managua"
    },
    {
        ", ": null
    },
    {
        "Nassau": "Nassau, Bahamas"
    },
    {
        ", ": null
    },
    {
        "Vancouver": "Vancouver"
    },
    {
        ", and others.   ": null
    },
    {
        "Vladimir Nabokov": "Vladimir Nabokov"
    },
    {
        " and his wife Vera lived in the ": null
    },
    {
        "Montreux Palace": "Fairmont Le Montreux Palace"
    },
    {
        " Hotel in ": null
    },
    {
        "Montreux": "Montreux"
    },
    {
        ", ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        " .   Actor ": null
    },
    {
        "Richard Harris": "Richard Harris"
    },
    {
        " lived at the Savoy Hotel while in London. Hotel archivist Susan Scott recounts an anecdote that, when he was being taken out of the building on a stretcher shortly before his death in 2002, he raised his hand and told the diners it was the food.    Egyptian actor ": null
    },
    {
        "Ahmed Zaki": "Ahmed Zaki"
    },
    {
        " lived his last 15 years in Ramses ": null
    },
    {
        "Hilton": "Hilton Worldwide"
    },
    {
        " Hotel – ": null
    },
    {
        "Cairo": "Cairo"
    },
    {
        ".   British ": null
    },
    {
        "entrepreneur": "Entrepreneur"
    },
    {
        " Jack Lyons": "Jack Lyons"
    },
    {
        " lived in the Hotel Mirador Kempinski in Switzerland for several years until his death in 2008.   American actress ": null
    },
    {
        "Elaine Stritch": "Elaine Stritch"
    },
    {
        " lived in the ": null
    },
    {
        "Savoy Hotel": "Savoy Hotel"
    },
    {
        " in London for over a decade.    Uruguayan-Argentinian tango composer ": null
    },
    {
        "Horacio Ferrer": "Horacio Ferrer"
    },
    {
        " lived almost 40 years, from 1976 until his death in 2014, in an apartment inside the ": null
    },
    {
        "Alvear Palace Hotel": "Alvear Palace Hotel"
    },
    {
        ", in Buenos Aires, one of the most exclusive hotels in the city. ": null
    }
]