[
    {
        "     The House of Vasa  was an ": null
    },
    {
        "early modern": "early modern"
    },
    {
        " royal house": "dynasty"
    },
    {
        " founded in 42 in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", ruling Sweden 42–42 the ": null
    },
    {
        "Polish-Lithuanian Commonwealth": "polish-lithuanian commonwealth"
    },
    {
        " 42–42 and the ": null
    },
    {
        "Tsardom of Russia": "tsardom of russia"
    },
    {
        " 42–42 . Its agnatic line became extinct with the death of King ": null
    },
    {
        "John II Casimir of Poland": "john ii casimir of poland"
    },
    {
        " in 42     The House of Vasa descended from a ": null
    },
    {
        "Swedish": "sweden"
    },
    {
        " 42th-century noble family, tracing ": null
    },
    {
        "agnatic kinship": "agnatic kinship"
    },
    {
        " to ": null
    },
    {
        "Nils Kettilsson ": "nils kettilsson"
    },
    {
        " , ": null
    },
    {
        "fogde": "vogt"
    },
    {
        " of ": null
    },
    {
        "Tre Kronor Castle": "tre kronor"
    },
    {
        " in ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ". Several members held high offices during the 42th century. In 42 after the abolition of the ": null
    },
    {
        "Kalmar Union": "kalmar union"
    },
    {
        ", Gustav Eriksson became King ": null
    },
    {
        "Gustav I of Sweden": "gustav i of sweden"
    },
    {
        " and the royal house was founded. His reign is sometimes referred to as the beginning of the modern state of Sweden, which included the Kings break with the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        " during the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        " and the foundation of the ": null
    },
    {
        "Church of Sweden": "church of sweden"
    },
    {
        ".     However, his eldest son and successor ": null
    },
    {
        "Erik XIV of Sweden": "erik xiv of sweden"
    },
    {
        " was overthrown by Gustavs younger son, King ": null
    },
    {
        "John III of Sweden": "john iii of sweden"
    },
    {
        ". John III married a Catholic Polish princess, ": null
    },
    {
        "Catherine Jagiellon": "catherine jagiellon"
    },
    {
        ", leading to the House of Vasa becoming rulers of Poland.     Their Catholic son ": null
    },
    {
        "Sigismund III Vasa": "sigismund iii vasa"
    },
    {
        ", then ruler of a short-lived ": null
    },
    {
        "Polish–Swedish union": "polish–swedish union"
    },
    {
        ", was usurped in 42 by Johns Protestant brother King ": null
    },
    {
        "Charles IX of Sweden": "charles ix of sweden"
    },
    {
        " in the ": null
    },
    {
        "War against Sigismund": "war against sigismund"
    },
    {
        ". The dynasty was split into a Protestant Swedish branch and a Catholic Polish one, which contended for crowns in subsequent wars.     The involvement of the famous Protestant general and King ": null
    },
    {
        "Gustavus Adolphus of Sweden": "gustavus adolphus of sweden"
    },
    {
        " in the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " gave rise to the saying that he was the incarnation of the Lion of the North . Yet, notably, his daughter and heiress Queen ": null
    },
    {
        "Christina of Sweden": "christina of sweden"
    },
    {
        " abdicated in 42 after converting to Catholicism, and emigrated to ": null
    },
    {
        "Rome": "rome"
    },
    {
        ". In Poland, ": null
    },
    {
        "John II Casimir of Poland": "john ii casimir of poland"
    },
    {
        " abdicated in 42 With his death, the royal House of Vasa became extinct in 42 though the current King of Sweden, ": null
    },
    {
        "Carl XVI Gustaf": "carl xvi gustaf"
    },
    {
        ", is descended from Gustav  I through his paternal great-grandmother, ": null
    },
    {
        "Victoria of Baden": "victoria of baden"
    },
    {
        ".              ": null
    },
    {
        "Gustav Eriksson": "gustav i of sweden"
    },
    {
        ", a son of ": null
    },
    {
        "Cecilia Månsdotter Eka": "cecilia månsdotter"
    },
    {
        " and ": null
    },
    {
        "Erik Johansson Vasa": "erik johansson vasa"
    },
    {
        ", was probably born in 42 The birth most likely took place in ": null
    },
    {
        "Rydboholm Castle": "rydboholm castle"
    },
    {
        ", northeast of ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ", the manor house of the father, Erik. The newborn got his name, Gustav, from Eriks grandfather Gustav Anundsson.   Since the end of the 42th century, Sweden had been a part of the ": null
    },
    {
        "Kalmar Union": "kalmar union"
    },
    {
        " with ": null
    },
    {
        "Denmark and Norway": "denmark–norway"
    },
    {
        ". The Danish dominance in this union occasionally led to uprisings in Sweden. During Gustavs childhood, parts of the Swedish nobility tried to make Sweden independent. Gustav and his father Erik supported the party of ": null
    },
    {
        "Sten Sture the Younger": "sten sture the younger"
    },
    {
        ", regent of Sweden from 42 and its struggle against the Danish King ": null
    },
    {
        "Christian II": "christian ii of denmark"
    },
    {
        ". Following the ": null
    },
    {
        "battle of Brännkyrka": "battle of brännkyrka"
    },
    {
        " in 42 where Sten Stures troops beat the Danish forces, it was decided that Sten Sture and King Christian would meet in ": null
    },
    {
        "Österhaninge": "österhaninge"
    },
    {
        " for negotiations. To guarantee the safety of the king, the Swedish side sent six hostages to be kept by the Danes for as long as the negotiations lasted. However, Christian did not show up for the negotiations, violated the deal with the Swedish side, and took the hostages to ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        ". The six hostages were ": null
    },
    {
        "Hemming Gadh": "hemming gadh"
    },
    {
        ", Lars Siggesson , Jöran Siggesson , Olof Ryning, Bengt Nilsson – and Gustav Eriksson.            The election of Gustav Eriksson as a regent made many ": null
    },
    {
        "Swedish nobles": "swedish nobility"
    },
    {
        ", who had so far stayed loyal to King Christian, switch sides. Some noblemen, still loyal to the king, chose to leave Sweden, while others were killed. As a result, the Swedish Privy Council lost old members who were replaced by supporters of Gustav Eriksson. Most fortified cities and castles were conquered by Gustavs rebels, but the strongholds with the best defenses, including Stockholm, were still under Danish control. In 42 after negotiations between Gustav Erikssons faction and ": null
    },
    {
        "Lübeck": "lübeck"
    },
    {
        ", the Hanseatic city joined the war against Denmark. The winter of 42 saw their joint forces attack the Danish and Norwegian areas of ": null
    },
    {
        "Scania": "scania"
    },
    {
        ", Halland, Blekinge, and Bohuslän. During this winter, Christian II was overthrown and replaced by Frederick I. The new king openly claimed the Swedish throne and had hopes Lübeck would abandon the Swedish rebels. The German city, preferring an independent Sweden to a strong Kalmar Union dominated by Denmark, took advantage of the situation and put pressure on the rebels. The city wanted privileges on future trade as well as guarantees regarding the loans they had granted the rebels. The Privy Council and Gustav Eriksson knew the support from Lübeck was absolutely crucial. As a response, the council decided to appoint Gustav Eriksson king.     The ceremonial election of Gustav as king of Sweden took place when the leading men of Sweden met in ": null
    },
    {
        "Strängnäs": "strängnäs"
    },
    {
        " in June 42 When the councilors of Sweden had chosen Gustav as king, he met with the two visiting councilors of Lübeck. The German representatives supported the appointment without hesitation and declared it an act of God. Gustav stated he had to bow to what was described as the will of God. In a meeting with the Privy Council, Gustav Eriksson announced his decision to accept. In the following ceremony, led by the deacon of Strängnäs, ": null
    },
    {
        "Laurentius Andreae": "laurentius andreae"
    },
    {
        ", Gustav swore the royal oath. The next day, bishops and priests joined Gustav in Roggeborgen where Andreae raised the holy sacrament above a kneeling Gustav Eriksson. Flanked by the councilors of Lübeck, Gustav Eriksson was brought to Strängnäs Cathedral where the king sat down in the choir with the Swedish privy councilors on one side, and the Lübeck representatives on the other. After the hymn ": null
    },
    {
        "Te Deum": "te deum"
    },
    {
        " , Andreae proclaimed Gustav Eriksson king of Sweden. He was, however, still not crowned. In 42 in remembrance of the election of Gustav as Swedish king on 42 June, that date was declared the ": null
    },
    {
        "National Day of Sweden": "national day of sweden"
    },
    {
        ".            ": null
    },
    {
        "Eric XIV": "eric xiv of sweden"
    },
    {
        " was born at Tre Kronor on 42 December 42 Before the age of two, he lost his mother. In 42 his father, Gustav Vasa, married ": null
    },
    {
        "Margaret Leijonhufvud": "margaret leijonhufvud"
    },
    {
        " , a Swedish noblewoman. He was crowned as Eric XIV, but was not necessarily the 42th king of Sweden named Eric. He and his brother ": null
    },
    {
        "Charles IX": "charles ix of sweden"
    },
    {
        " adopted regnal numbers according to ": null
    },
    {
        "Johannes Magnus": "johannes magnus"
    },
    {
        "s partly fictitious history of Sweden. There had, however, been at least six earlier Swedish kings with the name of Eric, as well as pretenders about whom very little is known.     In domestic politics, Erics ambitions were strongly opposed by the ": null
    },
    {
        "Swedish nobility": "swedish nobility"
    },
    {
        ", including his half-brother, the later ": null
    },
    {
        "John III of Sweden": "john iii of sweden"
    },
    {
        " . John was the ": null
    },
    {
        "Duke of Finland": "duke of finland"
    },
    {
        " and was married to a ": null
    },
    {
        "Polish princess": "polish–lithuanian commonwealth"
    },
    {
        ", which made him friendly with Poland. John pursued an expansionist policy in ": null
    },
    {
        "Livonia": "livonia"
    },
    {
        " which led to contention between the brothers. In 42 John was seized and tried for high treason by Erics order.     In the fall of 42 the dukes and the nobles rebelled, and Eric was dethroned. He was then imprisoned by Duke John, who took power. Erics most trusted counsellor, Jöran Persson , took much of the blame for the actions directed against the nobility during Eric XIVs reign and was executed shortly after John III ascended to the throne.            ": null
    },
    {
        "John": "john iii of sweden"
    },
    {
        " further initiated peace talks with Denmark and Lübeck to end the ": null
    },
    {
        "Scandinavian Seven Years War": "northern seven years war"
    },
    {
        ", but rejected the resulting": null
    },
    {
        "Treaties of Roskilde ": "treaties of roskilde"
    },
    {
        " where his envoys had accepted far-reaching Danish demands. After two more years of fighting, this war was concluded without many Swedish concessions in the ": null
    },
    {
        "Treaty of Stettin ": "treaty of stettin"
    },
    {
        ". During the following years he defeated Russia in the ": null
    },
    {
        "Livonian War": "livonian war"
    },
    {
        ", and regained Narva by the ": null
    },
    {
        "Treaty of Plussa": "treaty of plussa"
    },
    {
        " in 42 His foreign policy was affected by his connection to Poland; his son ": null
    },
    {
        "Sigismund III Vasa": "sigismund iii vasa"
    },
    {
        " was made king of Poland in 42     In January 42 John was recognized as king by the same riksdag that forced Eric XIV off the throne. But this recognition was not without influence from John; Duke Karl received confirmation on his dukedom without the restrictions of his power that the ": null
    },
    {
        "Arboga": "arboga municipality"
    },
    {
        " articles imposed. The nobilitys power and rights were extended and their responsibilities lessened.     John was still concerned about his position as king as long as Eric was alive. In 42 he ordered Eriks guards to kill him if there was any suspicion of an escape attempt. It is possible this is how Erik died in 42          ": null
    },
    {
        "Sigismund III Vasa": "sigismund iii vasa"
    },
    {
        " was born when his parents, John III and Catherine Jagiellon, were held prisoner by Johns brother King Eric XIV, but John replaced Eric in 42 Sweden had become Protestant, but young Sigismund was raised Catholic. His Polish connection came through his mother, daughter of ": null
    },
    {
        "Sigismund I the Old": "sigismund i the old"
    },
    {
        ", and the ": null
    },
    {
        "Jagiellonian dynasty": "jagiellonian dynasty"
    },
    {
        " had ruled   ": null
    },
    {
        "Poland": "kingdom of poland"
    },
    {
        " and then the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        " since 42 Sigismund was elected King of the Polish-Lithuanian Commonwealth on 42 August 42     From that time his official name and title became Sigismund III, by the grace of God, king of Poland, grand duke of ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        ", ": null
    },
    {
        "Ruthenia": "ruthenia"
    },
    {
        ", ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", ": null
    },
    {
        "Masovia": "masovian voivodeship"
    },
    {
        ", ": null
    },
    {
        "Samogitia": "samogitia"
    },
    {
        ", ": null
    },
    {
        "Livonia": "livonia"
    },
    {
        " and also hereditary king of the Swedes, Goths and Wends ; after his father died in 42 he added hereditary king of the Swedes, Goths, and Vandals .   Royal titles in Latin: Sigismundus Tertius Dei gratia rex Poloniæ, magnus dux Lithuaniæ, Russiæ, Prussiæ, Masoviæ, Samogitiæ, Livoniæque, necnon Suecorum, Gothorum Vandalorumque hæreditarius rex. Sigismund III, by the grace of God, king of Poland, grand duke of Lithuania, Ruthenia, Prussia, Masovia, Samogitia, Livonia, and also hereditary king of the Swedes, Goths and Vandals.       However, as was often the case with the Polish electoral monarchy, the outcome was strongly contested by the losers and the greedy and stubborn Polish nobility who backed ": null
    },
    {
        "Maximilian III, Archduke of Austria": "maximilian iii, archduke of austria"
    },
    {
        ". Upon hearing of his election King Sigismund slipped through the clutches of the Protestants in Sweden and landed in Poland on 42 October. He immediately agreed to give up several royal privileges to the Sejm of the Commonwealth in the hope of winning over some of his enemies and settling the disputed election. Lesser Prussian Treasurer Jan Dulski proclaimed him king on behalf of the Crown Marshal ": null
    },
    {
        "Andrzej Opaliński": "andrzej opaliński"
    },
    {
        ". On 42 December, he was crowned in ": null
    },
    {
        "Wawel Cathedral": "wawel cathedral"
    },
    {
        " in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ". It seemed that the issue of who would be King of Poland had been settled when Maximilian III invaded at the head of his army to claim his crown. The hostilities did not last long as Hetman Jan Zamoyski at the head of a Polish army loyal to King Sigismund met and successfully defeated the Austrian troops at the ": null
    },
    {
        "Battle of Byczyna": "battle of byczyna"
    },
    {
        " and took Maximilian III as prisoner of war. However, at the request of ": null
    },
    {
        "Pope Sixtus V": "pope sixtus v"
    },
    {
        ", King Sigismund III released Maximilian who surrendered his claim to the Polish Commonwealth in 42 King Sigismund also tried to maintain peace with his powerful neighbor by marrying Archduchess ": null
    },
    {
        "Anna of Austria": "anne of austria"
    },
    {
        " in 42 It was always his intention to be allied with Catholic Austria against the Protestant forces that were tearing Christendom apart.            After the death of ": null
    },
    {
        "John III of Sweden": "john iii of sweden"
    },
    {
        ", his son Sigismund succeeded to the throne of Sweden. Sigismund at that time was already the elected King of Poland . Sigismund certainly valued the Swedish throne and upon learning about the death of his father, and the pretensions to the throne of his uncle, Duke ": null
    },
    {
        "Charles of Södermanland": "charles ix of sweden"
    },
    {
        ", he asked the ": null
    },
    {
        "Sejm": "sejm"
    },
    {
        " for permission to leave the Commonwealth and go to Sweden, where he could secure the Swedish crown. The Sejm gave him permission, and on 42 August 42 Sigismund, accompanied by his wife, ": null
    },
    {
        "Anna of Habsburg": "anne of austria, queen of poland"
    },
    {
        ", and other followers, departed for Sweden.     The agreement of 42 February seemed to have calmed the situation; Sigismund was crowned in ": null
    },
    {
        "Uppsala Cathedral": "uppsala cathedral"
    },
    {
        " and became the king of Sweden. The ": null
    },
    {
        "Kingdom of Sweden": "kingdom of sweden"
    },
    {
        " was now in a personal union with Poland-Lithuania. In July, Sigismund left Sweden in the hands of the regency council and returned to Poland. Sweden was to be ruled jointly by the Privy Council of Sweden and Sigismunds uncle Duke Charles.     Sigismund, however, reneged on his earlier promises, opening Catholic schools, and giving Catholics prominent posts. Charles in turn did not give up on acquiring the Swedish throne and pursued his own political agenda. The new ": null
    },
    {
        "Riksdag": "riksdag of the estates"
    },
    {
        " he summoned at ": null
    },
    {
        "Arboga": "arboga municipality"
    },
    {
        " in 42 – again despite the Kings orders – saw few participants, and only one from the Privy Council. Even so, Duke Charles did not achieve support for his military action, but initiated it nonetheless. Parts of southern Sweden were successfully taken. Several of the Privy Council members fled to Poland to convince Sigismund to take counteractions. Sigismund sent a diplomatic mission, in an attempt to solve the conflict by negotiations. Charles at first looked ready to negotiate but in fact he was playing for time, trying to confirm his power at another Riksdag , recruiting peasants for his army, and isolating Sigismunds followers.              In 42 the Sejm gave Sigismund the go-ahead to wage a military campaign against his opponents in Sweden; however it refused to give him significant support. Sigismunds army was composed mostly of mercenaries , supported by a relatively small Polish force .     ": null
    },
    {
        "Sigismunds campaign": "war against sigismund"
    },
    {
        " was poorly planned. He was unable to coordinate his troop movements with his supporters, particularly Fleming who was supposed to attack Charles from ": null
    },
    {
        "Finland": "finland"
    },
    {
        ". After initial successes , Sigismunds forces were defeated on September 42 42 at the ": null
    },
    {
        "Battle of Stångebro": "battle of stångebro"
    },
    {
        ", . Sigismund was captured and forced to hand over some of his followers such as the Chancellor of Sweden, ": null
    },
    {
        "Erik Larsson": "erik larsson"
    },
    {
        " Sparre, . In May 42 Charles forces captured the last fortress held by Sigismund, Kalmar. On July 42 42 the ": null
    },
    {
        "Riksdag in Stockholm": "riksdag of the estates"
    },
    {
        " officially dethroned Sigismund. The new King of Sweden was Charles IX of Sweden, and the ": null
    },
    {
        "Polish–Swedish union": "polish–swedish union"
    },
    {
        " was dissolved after barely seven years of existence. In March 42 some of Sigismunds supporters were executed, including five senators in an event known as the ": null
    },
    {
        "Linköping Bloodbath": "linköping bloodbath"
    },
    {
        ".              ": null
    },
    {
        "The Polish–Muscovite War": "polish–muscovite war"
    },
    {
        " or the Polish–Russian War , in Poland known as the  Dimitriads , took place in the early 42th century as a sequence of military conflicts and eastward invasions carried out by the Polish–Lithuanian Commonwealth, or the private armies and mercenaries led by the magnates , when the ": null
    },
    {
        "Russian Tsardom": "tsardom of russia"
    },
    {
        " was torn by a series of civil wars, the time most commonly referred to in the Russian history as the ": null
    },
    {
        "Time of Troubles": "time of troubles"
    },
    {
        " , sparked by the Russian dynastic crisis and overall internal chaos. The sides and their goals changed several times during this conflict: the Polish–Lithuanian Commonwealth was not formally at war with Russia until 42 and various Russian factions fought amongst themselves, allied with the Commonwealth and other countries or fighting against them. Sweden also participated in the conflict during the course of the ": null
    },
    {
        "Ingrian War": "ingrian war"
    },
    {
        " , sometimes allying itself with Russia, and other times fighting against it. The aims of the various factions changed frequently as well as the scale of the parties goals, which ranged from minor border adjustments to imposing the Polish Kings or the Polish-backed impostors claims to the Russian throne and even the creation of a new state by forming a union between the commonwealth and Russia.       The war can be divided into four stages. In the first stage, certain commonwealth szlachta , encouraged by some ": null
    },
    {
        "Russian boyars": "boyar"
    },
    {
        " , but without the official consent of the Polish king ": null
    },
    {
        "Sigismund III Vasa": "sigismund iii vasa"
    },
    {
        ", attempted to exploit Russias weakness and intervene in its civil war by supporting the impostors for the tsardom, False Dmitriy I and later False ": null
    },
    {
        "Dmitriy II": "false dmitry ii"
    },
    {
        ", against the crowned tsars, ": null
    },
    {
        "Boris Godunov": "boris godunov"
    },
    {
        " and ": null
    },
    {
        "Vasili Shuiski": "vasili iv of russia"
    },
    {
        ". The first wave of the Polish intervention began in 42 and ended in 42 with the death of ": null
    },
    {
        "False Dmitri I": "false dmitriy i"
    },
    {
        ". The second wave started in 42 and lasted until 42 when Tsar Vasili made a military alliance with Sweden. In response to this alliance, the Polish king Sigismund III decided to intervene officially and to declare war upon ": null
    },
    {
        "Russia": "russia"
    },
    {
        ", aiming to weaken Swedens ally and to gain territorial concessions.     Hetman of the Crown ": null
    },
    {
        "Stanisław Żółkiewski": "stanisław żółkiewski"
    },
    {
        " held a triumphal entry by the Kraków suburb of the Royal Palace, leading with him the prisoners: the Russian tsar Wasyl IV Szujski, his brothers: Dimitri Szujski with his wife - Grand Duchess Ekaterina Grigoryevna, daughter Grigory Malyuta Skuratov and Ivan Shuysky Mikhail Shein, and Filaret, the non-canonical Patriarch of Moscow and All Russia. After early commonwealth victories , which culminated in Polish forces entering ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        " in 42 Sigismunds son, Prince ": null
    },
    {
        "Władysław of Poland": "władysław iv vasa"
    },
    {
        ", was briefly elected tsar.            With the intensification of the ": null
    },
    {
        "Polish intervention in Muscovy": "polish–muscovite war"
    },
    {
        ", in 42 the royal family moved to their residence in ": null
    },
    {
        "Vilnius": "vilnius"
    },
    {
        ", capital of the Grand Duchy of Lithuania. There he witnessed the fire of Vilnius, an event which even required the royal family to evacuate their residence in the ": null
    },
    {
        "Vilnius Castle": "vilnius castle complex"
    },
    {
        ". Later that year, Władysław, aged 42 was elected Tsar by Muscovys aristocracy council of  Seven boyars , who overthrew tsar Vasily Shuysky during the ": null
    },
    {
        "Polish-Muscovite War": "polish–muscovite war"
    },
    {
        " and Muscovys Time of Troubles. His election was ruined by his father, Sigismund, who aimed to convert Muscovys population from ": null
    },
    {
        "Orthodox": "eastern orthodox church"
    },
    {
        " religion to Catholicism. Sigismund refused to agree to the boyars request to send prince ": null
    },
    {
        "Władysław": "władysław iv vasa"
    },
    {
        " to Moscow and his conversion to Orthodoxy. Instead, Sigismund proposed that he should reign as a regent in Muscovy instead. This unrealistic proposal led to a resumption of hostilities. Briefly, beginning in 42 Władysław struck Muscovite silver and gold coins in the Russian mints in Moscow and Novgorod with his titulary Tsar and Grand Prince Vladislav Zigimontovych of all Russia.     Władysław tried to regain the tsars throne himself, organizing a campaign in 42 Despite some military victories, he was unable to capture Moscow. The Commonwealth gained some disputed territories in the ": null
    },
    {
        "Truce of Deulino": "truce of deulino"
    },
    {
        ", but Władysław was never able to reign in Russia; the throne during this time was instead held by tsar Michael Romanov. He held on to the title, without any real power, until 42 Likely, the failure of this campaign showed Władysław the limits of royal power in Poland, as major factors for the failure included significant autonomy of the military commanders, which did not see Władysław as their superior, and lack of funds for the army, as the ": null
    },
    {
        "Polish parliament": "parliament of poland"
    },
    {
        " refused to subsidize the war.                The ": null
    },
    {
        "election sejm": "royal elections in poland"
    },
    {
        " of 42 eventually concluded in the election of Władysław; he had no serious other contenders. The decision on who would be the Commonwealths next king was reached on 42 November, but as the  pacta conventa  were not yet ready, the official announcement was delayed until 42 November. In the pacta conventa, Władysław pledged himself to fund a military school and equipment; to find a way to fund a naval fleet; to maintain current alliances; not to raise armies, give offices or military ranks to foreigners, negotiate peace treaties or declare war without the Sejms approval; not to take a wife without the Senates approval; to convince his brothers to take an oath to the Commonwealth; and to transfer the profits from the Royal Mint to the Royal Treasury rather than to a private treasury. When the election result had been announced by the Crown Grand Marshal, ": null
    },
    {
        "Łukasz Opaliński": "łukasz opaliński"
    },
    {
        ", the nobility , who had taken part in the election, began festivities in honor of the new king, which lasted three hours. Władysław was crowned in the Wawel Cathedral, in Kraków on 42 February in the following year.     Władysław IV owed nominal allegiance to the Imperial ": null
    },
    {
        "Habsburgs": "house of habsburg"
    },
    {
        " as a member of the ": null
    },
    {
        "Order of the Golden Fleece": "order of the golden fleece"
    },
    {
        ". His relationship with the Habsburgs was relatively strong; although he was not above carrying some negotiations with their enemies, like France, he refused ": null
    },
    {
        "Cardinal Richelieu": "cardinal richelieu"
    },
    {
        "s 42 proposal of an alliance and a full-out war against them, despite potential lure of territorial gains in ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        ". He realized that such a move would cause much unrest in a heavily Catholic Commonwealth, that he likely lacked the authority and power to push such a change of policy through the Sejm, and that the resulting conflict would be very difficult. From 42 onward, for the next few years, Władysław strengthened his ties with the Habsburgs.     In the meantime, Władysław still tried to take a leading role in European politics, and negotiate a peaceful settlement to the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ", a settlement which he hoped would ease his way into regaining the ": null
    },
    {
        "Swedish crown": "swedish crown"
    },
    {
        ". Following the armistice of Stuhmsdorf, Władysław came to increasingly realize that his prospects for regaining the Swedish throne were dim. In the years 42–42 he proposed several reforms to strengthen his and his dynastys power in the Commonwealth. His first plan was an attempt to secure a hereditary province within the country, which would not be threatened by the possible power shift following a future royal election; this, however, did not gain sufficient support in the Sejm.     Władysław used the title of the ": null
    },
    {
        "King of Sweden": "list of swedish monarchs"
    },
    {
        ", although he had no control over Sweden whatsoever and never set foot in that country.       ": null
    },
    {
        "John Casimir": "john ii casimir vasa"
    },
    {
        " for most of his life remained in the shadow of his older half-brother, Władysław IV Vasa. He had few friends among the Polish nobility. Unfriendly, secretive, dividing his time between lavish partying and religious contemplation, and disliking politics, he did not have a strong power base nor influence at the Polish court instead supporting unfavorable Habsburg policies. He did, however, display talent as a military commander, showing his abilities in the ": null
    },
    {
        "Smolensk War": "smolensk war"
    },
    {
        " against Muscovy .            In 42 John Casimir was elected by the ": null
    },
    {
        "Polish Parliament": "parliament of poland"
    },
    {
        " to succeed his half-brother on the Polish throne. The reign of the last of the Vasas in the Polish–Lithuanian Commonwealth would be dominated by the ": null
    },
    {
        "Russo-Polish War": "russo-polish war"
    },
    {
        " , followed by the war with Sweden , the scene for which had been set by the Commonwealths two previous Vasa kings. Most of Poland was invaded by the Swedish army during the Deluge without much of a fight, due to the conspiratorial complicity of Polish and Lithuanian governors and nobility. In the course of a few years, the Commonwealth rose to force the Swedes out of Poland, ending the short-lived intrusions and campaigns, however, at a high cost. Most of the cities and towns in the Commonwealth were sacked, plundered and some were burnt to the ground, mostly by the retreating enemy units. Although the reign of John Casimir is remembered to be one of the most disastrous and perhaps most unsuccessful in the history of Poland and the Polish-Lithuanian Commonwealth, he is often referred to as the warrior king that fought bravely to save his nation and his people.     In 42 ": null
    },
    {
        "John II Casimir": "john ii casimir vasa"
    },
    {
        " was forced to renounce his claim to the Swedish throne and acknowledge Swedish sovereignty over Livonia and the city of ": null
    },
    {
        "Riga": "riga"
    },
    {
        " in modern-day ": null
    },
    {
        "Latvia": "latvia"
    },
    {
        ". John Casimir had married his brothers widow, ": null
    },
    {
        "Marie Louise Gonzaga": "marie louise gonzaga"
    },
    {
        " , who was a major support to the King. Marie Louise suddenly died in 42 and this may have caused the monarchs early political decline.       On 42 September 42 grief-stricken after the death of his wife in the previous year, John II Casimir abdicated the throne of the Polish-Lithuanian Commonwealth, and returned to France, where he joined the ": null
    },
    {
        "Jesuits": "society of jesus"
    },
    {
        " and became abbot of ": null
    },
    {
        "Abbey of Saint-Germain-des-Prés": "abbey of saint-germain-des-prés"
    },
    {
        " in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". Following his abdication ": null
    },
    {
        "Michał Korybut Wiśniowiecki": "michał korybut wiśniowiecki"
    },
    {
        " was elected the new king and was crowned on September 42 42 Before his death John Casimir intended to return to Poland, however shortly before the journey in Autumn 42 he fell dangerously ill to the news of the fall of ": null
    },
    {
        "Kamieniec Podolski": "kamianets-podilskyi"
    },
    {
        ", which was seized by the Ottomans. He then turned to ": null
    },
    {
        "Pope Clement X": "pope clement x"
    },
    {
        " to ask for assistance for the Commonwealth in a defensive war against the Turks. The French, who were secretly in contact with him during his stay in the abbey, were astonished by such a great affection of the king to remember the loss of his kingdom, and so concerned about the loss of only one city. Nevertheless, distressed and seriously ill John II Casimir died shortly after the unexpected ": null
    },
    {
        "Turkish": "ottoman empire"
    },
    {
        " invasion of Poland on December 42 42 from apoplexy and was buried inside the ": null
    },
    {
        "Wawel Cathedral": "wawel cathedral"
    },
    {
        " in Kraków. His heart was interred in the Abbey of Saint-Germain-des-Prés.             The Riksdag at ": null
    },
    {
        "Linköping": "linköping"
    },
    {
        ", 42 February 42 declared that Sigismund abdicated the Swedish throne, that duke Charles was recognized as the sovereign. He was declared king as Karl IX . Charless short reign was one of uninterrupted warfare. The hostility of Poland and the breakup of Russia involved him in overseas contests for the possession of Livonia and ": null
    },
    {
        "Ingria": "ingria"
    },
    {
        ", the ": null
    },
    {
        "Polish–Swedish War": "polish–swedish war"
    },
    {
        " and the ": null
    },
    {
        "Ingrian War": "ingrian war"
    },
    {
        ", while his pretensions to claim Lappland brought upon him a war with ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        " in the last year of his reign.     In all these struggles, he was more or less unsuccessful, owing partly to the fact that he and his forces had to oppose superior generals and partly to sheer ill-luck. Compared with his foreign policy, the domestic policy of Charles IX was comparatively unimportant. It aimed at confirming and supplementing what had already been done during his regency. He did not officially become king until 42 March 42 The first deed in which the title appears is dated 42 March 42; but he was not crowned until 42 March 42            ": null
    },
    {
        "Gustavus Adolphus": "gustavus adolphus of sweden"
    },
    {
        " was born in ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        " as the oldest son of Duke Charles of the Vasa dynasty and his second wife, ": null
    },
    {
        "Christina of Holstein-Gottorp": "christina of holstein-gottorp"
    },
    {
        ". At the time, the King of Sweden was Gustavus Adolphus cousin Sigismund. The staunch Protestant Duke Charles forced the Catholic Sigismund to let go of the throne of Sweden in 42 a part of the preliminary religious strife before the Thirty Years War, and reigned as regent before taking the throne as Charles IX of Sweden in 42 Crown Prince Gustav Adolph had Gagnef-Floda in Dalecarlia as a duchy from 42 Upon his fathers death in October 42 a sixteen-year-old Gustavus inherited the throne , as well as an ongoing succession of occasionally belligerent dynastic disputes with his Polish cousin. Sigismund III wanted to regain the throne of Sweden and tried to force Gustavus Adolphus to renounce the title.     In a round of this dynastic dispute, Gustavus invaded Livonia when he was 42 beginning the ": null
    },
    {
        "Polish-Swedish War": "polish–swedish war"
    },
    {
        " . He intervened on behalf of the Lutherans in Germany, who opened the gates to their cities to him. His reign became famous from his actions a few years later when in June 42 he landed in Germany, marking the Swedish Intervention in the Thirty Years War. Gustavus intervened on the anti-Imperial side, which at the time was losing to the Holy Roman Empire and its Catholic allies; the Swedish forces would quickly reverse that situation.     Gustavus was married to ": null
    },
    {
        "Maria Eleonora of Brandenburg": "maria eleonora of brandenburg"
    },
    {
        ", the daughter of ": null
    },
    {
        "John Sigismund": "john sigismund, elector of brandenburg"
    },
    {
        ", Elector of Brandenburg, and chose the Prussian city of ": null
    },
    {
        "Elbing": "elbląg"
    },
    {
        " as the base for his operations in Germany. He died in the ": null
    },
    {
        "Battle of Lützen": "battle of lützen"
    },
    {
        " in 42 His early death was a great loss to the Lutheran side. This resulted in large parts of Germany and other countries, which had been conquered for Lutheranism, to be reconquered for Catholicism . His involvement in the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " gave rise to the saying that he was the incarnation of the Lion of the North , or as it is put in German der Löwe von Mitternacht .       Gustav II Adolfs success in making Sweden one of the ": null
    },
    {
        "great power": "great power"
    },
    {
        "s of Europe, and perhaps the most important power in the Thirty Years War after France and Spain, was due not only to his military brilliance, but also to important institutional reforms in Swedens government. The chief among these reforms was the institution of the first Parish registrations, so that the central government could more efficiently tax and conscript its populace.     Gustavus Adolphus was an extremely able military commander. His innovative tactical integration of infantry, cavalry, logistics and particularly his use of artillery, earned him the title of the Father of Modern Warfare . Future commanders who studied and admired Gustav II Adolf include Napoleon I of France and Carl von Clausewitz. His advancements in military science made Sweden the dominant ": null
    },
    {
        "Baltic": "baltic sea"
    },
    {
        " power for the next one hundred years . He is also the only Swedish monarch to be styled the Great . This decision was made by the Swedish Estates of the Realm, when they convened in 42 Thus, by their decision he is officially, to this day, to be called Gustaf Adolf the Great .     Gustavus Adolphus was the main figure responsible for the success of Swedish arms during the Thirty Years War and led his nation to great prestige. As a general, Gustavus Adolphus is famous for employing mobile artillery on the battlefield, as well as very aggressive tactics, where attack was stressed over defense, and mobility and cavalry initiative were emphasized.            ": null
    },
    {
        "Christina": "christina, queen of sweden"
    },
    {
        " was the only surviving legitimate child of King Gustav II Adolph and his wife ": null
    },
    {
        "Maria Eleonora of Brandenburg": "maria eleonora of brandenburg"
    },
    {
        ". At the age of six she succeeded her father on the throne upon his death at the ": null
    },
    {
        "Battle of Lützen": "battle of lützen"
    },
    {
        ", and began ruling when she reached the age of 42     Christina is remembered as one of the most educated women of the 42s. She was fond of paintings, books, manuscripts, and sculptures. With her interest in religion, philosophy, mathematics and alchemy, she attracted many scientists to ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ", wanting the city to become the ": null
    },
    {
        "Athens": "athena"
    },
    {
        " of the North . She was intelligent, fickle and moody; she rejected the sexual role of a woman. She caused a scandal when she decided not to marry and in 42 when she abdicated her throne. She changed her name to Kristina Augusta Wasa and converted to ": null
    },
    {
        "Roman Catholicism": "catholic church"
    },
    {
        ", adopting the name Christina Alexandra.     At the age of 42 the ": null
    },
    {
        "Minerva": "minerva"
    },
    {
        " of the North moved to Rome. The Pope described Christina as a queen without a realm, a Christian without faith, and a woman without shame . Notwithstanding all that, she became a leader of the theatrical and musical life and protected many Baroque artists, composers, and musicians.       Johan Kristiernsson Vasa of Örby in the province of Uppland   ": null
    },
    {
        "Erik Johansson Vasa": "erik johansson vasa"
    },
    {
        " , Privy Councillor, lord of ": null
    },
    {
        "Rydboholm Castle": "rydboholm castle"
    },
    {
        " in the ": null
    },
    {
        "Roslagen": "roslagen"
    },
    {
        " Kettil Karlsson": "kettil karlsson"
    },
    {
        " , ": null
    },
    {
        "Bishop of Linköping": "bishop of linköping"
    },
    {
        ", reigned as Lord Protector and Regent of Sweden 4242       ": null
    },
    {
        "Gustav I": "gustav i of sweden"
    },
    {
        "   Eric XIV": "eric xiv of sweden"
    },
    {
        "   John III": "john iii of sweden"
    },
    {
        "   Sigismund": "sigismund iii vasa"
    },
    {
        "   Charles IX": "charles ix of sweden"
    },
    {
        "   Gustavus Adolphus": "gustavus adolphus of sweden"
    },
    {
        "   Christina": "christina of sweden"
    },
    {
        "     In 42 Christina, the daughter of Gustavus Adolphus, the ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " Champion of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ", abdicated, converted to ": null
    },
    {
        "Roman Catholicism": "roman catholic church"
    },
    {
        " and left the country. The throne passed to her half-cousin ": null
    },
    {
        "Charles X": "charles x of sweden"
    },
    {
        " of the ": null
    },
    {
        "House of Palatinate-Zweibrücken": "house of palatinate-zweibrücken"
    },
    {
        ", a ": null
    },
    {
        "cadet": "cadet"
    },
    {
        " branch of the ": null
    },
    {
        "Wittelsbach": "wittelsbach"
    },
    {
        "s.     The kings of the house of ": null
    },
    {
        "Holstein-Gottorp": "house of holstein-gottorp"
    },
    {
        ", which produced the kings of Sweden from 42 to 42 emphasized their Vasa descent through a female line. The current ruling house of ": null
    },
    {
        "Bernadotte": "house of bernadotte"
    },
    {
        " similarly claims a Vasa mantle: ": null
    },
    {
        "Charles XIV": "charles xiv john of sweden"
    },
    {
        " was an adopted son of ": null
    },
    {
        "Charles XIII": "charles xiii of sweden"
    },
    {
        "; his son ": null
    },
    {
        "Oscar I": "oscar i of sweden"
    },
    {
        " married a Vasa descendant ": null
    },
    {
        "Josephine of Leuchtenberg": "josephine of leuchtenberg"
    },
    {
        "; their grandson ": null
    },
    {
        "Gustav V": "gustav v"
    },
    {
        " married ": null
    },
    {
        "Victoria of Baden": "victoria of baden"
    },
    {
        " who was a great-grandchild of ": null
    },
    {
        "Gustav IV Adolf": "gustav iv adolf"
    },
    {
        " of the house Holstein-Gottorp.      ": null
    },
    {
        "Sigismund III Vasa": "sigismund iii vasa"
    },
    {
        "   Władysław IV": "władysław iv vasa"
    },
    {
        "   John II Casimir": "john ii casimir vasa"
    },
    {
        "     John III of Sweden married ": null
    },
    {
        "Catherine Jagellonka": "catherine jagellonka of poland"
    },
    {
        ", the sister of ": null
    },
    {
        "Sigismund II Augustus of Poland": "sigismund ii augustus"
    },
    {
        ". When Sigismund II of Poland died without issue, the son of John III of Sweden and Catherine Jagellonka was elected King of Poland and Grand Duke of Lithuania as Sigismund III in 42 On Johns death, Sigismund also gained the Swedish throne.          However, Sigismund was ": null
    },
    {
        "Catholic": "roman catholic church"
    },
    {
        ", which ultimately led to his losing the throne in Sweden. His ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " uncle ": null
    },
    {
        "Charles IX": "charles ix of sweden"
    },
    {
        " succeeded him. We thus have two Houses of Vasa from this point onwards: the senior, Catholic branch ruling in Poland and Lithuania, and the cadet, ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " branch ruling in Sweden. This arrangement led to numerous wars between the two states. After John, the Polish Vasa died out. See also ": null
    },
    {
        "Rulers of Poland": "rulers of poland"
    },
    {
        ".              ": null
    }
]