[
    {
        "           Hugo Grotius , also known as Huig de Groot  or Hugo de Groot , was a Dutch jurist. Along with the earlier works of ": null
    },
    {
        "Francisco de Vitoria": "francisco de vitoria"
    },
    {
        " and ": null
    },
    {
        "Alberico Gentili": "alberico gentili"
    },
    {
        ", he laid the foundations for ": null
    },
    {
        "international law": "international law"
    },
    {
        ", based on ": null
    },
    {
        "natural law": "natural law"
    },
    {
        ". A teenage intellectual prodigy, he was born in ": null
    },
    {
        "Delft": "delft"
    },
    {
        " and studied at ": null
    },
    {
        "Leiden University": "leiden university"
    },
    {
        ". He was imprisoned for his involvement in the intra-": null
    },
    {
        "Calvinist": "calvinism"
    },
    {
        " disputes of the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        ", but escaped hidden in a chest of books. Grotius wrote most of his major works in exile in ": null
    },
    {
        "France": "france"
    },
    {
        ".     It is thought that Hugo Grotius was not the first to formulate the ": null
    },
    {
        "international society": "international society"
    },
    {
        " doctrine, but he was one of the first to define expressly the idea of one society of states, governed not by ": null
    },
    {
        "force": "force"
    },
    {
        " or ": null
    },
    {
        "warfare": "warfare"
    },
    {
        " but by actual laws and mutual agreement to enforce those laws. As ": null
    },
    {
        "Hedley Bull": "hedley bull"
    },
    {
        " declared in 42: The idea of international society which Grotius propounded was given concrete expression in the ": null
    },
    {
        "Peace of Westphalia": "peace of westphalia"
    },
    {
        ", and Grotius may be considered the intellectual father of this first general peace settlement of modern times.  Additionally, his contributions to ": null
    },
    {
        "Arminian": "arminianism"
    },
    {
        " theology": "theology"
    },
    {
        " helped provide the seeds for later Arminian-based movements, such as ": null
    },
    {
        "Methodism": "methodism"
    },
    {
        " and ": null
    },
    {
        "Pentecostalism": "pentecostalism"
    },
    {
        "; Grotius is acknowledged as a significant figure in the ": null
    },
    {
        "Arminian-Calvinist debate": "arminian-calvinist debate"
    },
    {
        ". Because of his theological underpinning of free trade, he is also considered an economic theologist .            Born in ": null
    },
    {
        "Delft": "delft"
    },
    {
        " during the ": null
    },
    {
        "Dutch Revolt": "eighty years war"
    },
    {
        ", Hugo was the first child of Jan de Groot and Alida van Overschie. His father was a man of learning, once having studied with the eminent ": null
    },
    {
        "Justus Lipsius": "justus lipsius"
    },
    {
        " at ": null
    },
    {
        "Leiden": "leiden"
    },
    {
        ", as well as of political distinction, and he groomed his son from an early age in a traditional ": null
    },
    {
        "humanist": "humanism"
    },
    {
        " and ": null
    },
    {
        "Aristotelian": "aristotelianism"
    },
    {
        " education. A ": null
    },
    {
        "prodigious": "child prodigy"
    },
    {
        " learner, Hugo entered the ": null
    },
    {
        "University of Leiden": "leiden university"
    },
    {
        " when he was just eleven years old. There he studied with some of the most acclaimed intellectuals in northern Europe, including ": null
    },
    {
        "Franciscus Junius": "franciscus junius"
    },
    {
        ", ": null
    },
    {
        "Joseph Justus Scaliger": "joseph justus scaliger"
    },
    {
        ", and ": null
    },
    {
        "Rudolph Snellius": "rudolph snellius"
    },
    {
        ".     At age sixteen he published his first book: a scholarly edition of the ": null
    },
    {
        "late antique": "late antiquity"
    },
    {
        " author ": null
    },
    {
        "Martianus Capella": "martianus capella"
    },
    {
        "s work on the ": null
    },
    {
        "seven liberal arts": "seven liberal arts"
    },
    {
        ". Martiani Minei Felicis Capellæ Carthaginiensis viri proconsularis Satyricon...      In Holland, Grotius earned an appointment as advocate to ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        " in 42 and then as official ": null
    },
    {
        "historiographer": "historiographer"
    },
    {
        " for the States of Holland in 42 His first occasion to write systematically on issues of international justice came in 42 when he became involved in the legal proceedings following the seizure by Dutch merchants of a Portuguese ": null
    },
    {
        "carrack": "carrack"
    },
    {
        " and its cargo in the ": null
    },
    {
        "Singapore Strait": "singapore strait"
    },
    {
        ".     De Indis and Mare Liberum     The Dutch were at ": null
    },
    {
        "war with Spain": "eighty years war"
    },
    {
        "; although Portugal was ": null
    },
    {
        "closely allied": "dynastic union"
    },
    {
        " with Spain, it was not yet ": null
    },
    {
        "at war with the Dutch": "dutch–portuguese war"
    },
    {
        ". The war began when Grotiuss cousin captain ": null
    },
    {
        "Jacob van Heemskerk": "jacob van heemskerk"
    },
    {
        " captured a loaded Portuguese ": null
    },
    {
        "carrack": "carrack"
    },
    {
        " merchant ship,  Santa Catarina , off present-day Singapore in 42 Heemskerk was employed with the United Amsterdam Company , and though he did not have authorization from the company or the government to initiate the use of force, many shareholders were eager to accept the riches that he brought back to them.     Not only was the legality of keeping the ": null
    },
    {
        "prize": "prize"
    },
    {
        " questionable under Dutch statute, but a faction of shareholders  in the Company also objected to the forceful seizure on moral grounds, and of course, the Portuguese demanded the return of their cargo. The scandal led to a public judicial hearing and a wider campaign to sway public opinion.  It was in this wider context that representatives of the Company called upon Grotius to draft a ": null
    },
    {
        "polemic": "polemic"
    },
    {
        "al defence of the seizure.          The result of Grotius efforts in 42/42 was a long, theory-laden treatise that he provisionally entitled De Indis . Grotius sought to ground his defense of the seizure in terms of the natural principles of justice. In this, he had cast a net much wider than the case at hand; his interest was in the source and ground of wars lawfulness in general. The treatise was never published in full during Grotius lifetime, perhaps because the court ruling in favor of the Company preempted the need to garner public support.     In The Free Sea  Grotius formulated the new principle that the sea was international territory and all ": null
    },
    {
        "nation": "nation"
    },
    {
        "s were free to use it for seafaring ": null
    },
    {
        "trade": "trade"
    },
    {
        ". Grotius, by claiming free seas , provided suitable ideological justification for the Dutch breaking up of various trade ": null
    },
    {
        "monopolies": "monopoly"
    },
    {
        " through its formidable naval power .  ": null
    },
    {
        "England": "england"
    },
    {
        ", competing fiercely with the Dutch for domination of world trade, opposed this idea and claimed in ": null
    },
    {
        "John Selden": "john selden"
    },
    {
        "s  Mare clausum  , That the Dominion of the British Sea, or That Which Incompasseth the Isle of Great Britain, is, and Ever Hath Been, a Part or Appendant of the Empire of that Island.      It is generally assumed that Grotius first propounded the principle of ": null
    },
    {
        "freedom of the seas": "freedom of the seas"
    },
    {
        ", although all countries in the ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        " and other Asian seas accepted the right of ": null
    },
    {
        "unobstructed navigation": "freedom of navigation"
    },
    {
        " long before Grotius wrote his De Jure Praedae  in the year of 42 Additionally, 42th century Spanish theologian ": null
    },
    {
        "Francisco de Vitoria": "francisco de vitoria"
    },
    {
        " had postulated the idea of freedom of the seas in a more rudimentary fashion under the principles of  jus gentium . Grotiuss notion of the freedom of the seas would persist until the mid-twentieth century, and it continues to be applied even to this day for much of the ": null
    },
    {
        "high seas": "high seas"
    },
    {
        ", though the application of the concept and the scope of its reach is changing.             Aided by his continued association with ": null
    },
    {
        "Van Oldenbarnevelt": "johan van oldenbarnevelt"
    },
    {
        ", Grotius made considerable advances in his political career, being retained as Oldenbarnevelts resident advisor in 42 Advocate General of the ": null
    },
    {
        "Fisc": "fisc"
    },
    {
        " of ": null
    },
    {
        "Holland": "holland"
    },
    {
        ", ": null
    },
    {
        "Zeeland": "zeeland"
    },
    {
        " and ": null
    },
    {
        "Friesland": "friesland"
    },
    {
        " in 42 and then as ": null
    },
    {
        "Pensionary": "pensionary"
    },
    {
        " of ": null
    },
    {
        "Rotterdam": "rotterdam"
    },
    {
        " in 42 In 42 he married ": null
    },
    {
        "Maria van Reigersberch": "maria van reigersberch"
    },
    {
        ", with whom he would have eight children and who would be invaluable in helping him and the family to weather the storm to come.     In these years a great ": null
    },
    {
        "theological": "theology"
    },
    {
        " controversy broke out between the chair of theology at Leiden ": null
    },
    {
        "Jacobus Arminius": "jacobus arminius"
    },
    {
        " and his followers  and the strongly ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        " theologian, ": null
    },
    {
        "Franciscus Gomarus": "franciscus gomarus"
    },
    {
        ", whose supporters are termed Gomarists or Counter-Remonstrants.  Leiden University was under the authority of the States of Holland  – they were responsible, among other things, for the policy concerning appointments at this institution, which was governed in their name by a board of Curators  – and, in the final instance, the States were responsible for dealing with any cases of heterodoxy among the professors.  The domestic dissension resulting over Arminius professorship was overshadowed by the continuing war with Spain, and the professor died in 42 on the eve of the ": null
    },
    {
        "Twelve Years Truce": "twelve years truce"
    },
    {
        ". The new peace would move the peoples focus to the controversy and Arminius followers.       The controversy expanded when the Remonstrant theologian ": null
    },
    {
        "Conrad Vorstius": "conrad vorstius"
    },
    {
        " was appointed to replace Jacobus Arminius as the theology chair at Leiden. Vorstius was soon seen by Counter-Remonstrants as moving beyond the teachings of Arminius into ": null
    },
    {
        "Socinianism": "socinianism"
    },
    {
        " and he was accused of teaching irreligion. Leading the call for Vorstius removal was theology professor ": null
    },
    {
        "Sibrandus Lubbertus": "sibrandus lubbertus"
    },
    {
        ". On the other side ": null
    },
    {
        "Johannes Wtenbogaert": "johannes wtenbogaert"
    },
    {
        " and ": null
    },
    {
        "Johan van Oldenbarnevelt": "johan van oldenbarnevelt"
    },
    {
        ", Grand Pensionary of Holland, had strongly promoted the appointment of Vortius and began to defend their actions. Gomarus resigned his professorship at Leyden, in protest that Vorstius was not removed. The Counter-Remonstrants were also supported in their opposition by King ": null
    },
    {
        "James I of England": "james i of england"
    },
    {
        " who thundered loudly against the Leyden nomination and gaudily depicted Vorstius as a horrid heretic. He ordered his books to be publicly burnt in London, Cambridge, and Oxford, and he exerted continual pressure through his ambassador in the Hague, Ralph Winwood, to get the appointment cancelled.  James began to shift his confidence from Oldenbarnevelt towards Maurice.     Grotius joined the controversy by defending the civil authorities power to appoint whomever they wished to a universitys faculty. He did this by writing  Ordinum Pietas , a pamphlet...directed against an opponent, the Calvinist Franeker professor Lubbertus; it was ordered by Grotius masters the States of Holland, and thus written for the occasion  – though Grotius may already have had plans for such a book.      The work is twenty-seven pages long, is polemical and acrimonious and only two-thirds of it speaks directly about ecclesiastical politics . The work met with a violent reaction from the Counter-Remonstrants, and It might be said that all Grotius next works until his arrest in 42 form a vain attempt to repair the damage done by this book.  Grotius would later write De Satisfactione aiming at proving that the Arminians are far from being Socinians.      Decretum pro pace ecclesiarum ": null
    },
    {
        "States of Holland": "states of holland"
    },
    {
        " took an official position of ": null
    },
    {
        "religious toleration": "religious toleration"
    },
    {
        " towards Remonstrants and Counter-Remonstrants. Grotius, was eventually asked to draft an edict to express the policy of toleration. This edict, Decretum pro pace ecclesiarum was completed in late 42 or early 42 The edict put into practice a view that Grotius had been developing in his writings on ": null
    },
    {
        "church and state": "separation of church and state"
    },
    {
        " : that only the basic tenets necessary for undergirding civil order  ought to be enforced while differences on obscure theological doctrines should be left to private conscience.          The edict imposing moderation and toleration on the ministry , was backed up by Grotius with thirty-one pages of quotations, mainly dealing with the Five Remonstrant Articles.  In response to Grotius Ordinum Pietas, Professor Lubbertus published Responsio Ad Pietatem Hugonis Grotii in 42 Later that year Grotius anonymously published Bona Fides Sibrandi Lubberti in response to Lubbertus.     ": null
    },
    {
        "Jacobus Trigland": "jacobus trigland"
    },
    {
        " joined Lubberdus in expressing the view that tolerance in matters of doctrine was inadmissible, and in his 42 works Den Recht-gematigden Christen: Ofte vande waere Moderatie and Advys Over een Concept van moderatie Trigland denounced Grotius stance.     In late 42 when Middelburg professor ": null
    },
    {
        "Antonius Walaeus": "antonius walaeus"
    },
    {
        " published Het Ampt der Kerckendienaren  he sent Grotius a copy out of friendship. This was a work on the relationship between ecclesiastical and secular government from the moderate counter-remonstrant viewpoint. In early 42 Grotius also received the 42 page letter championing a remonstrant view Dissertatio epistolica de Iure magistratus in rebus ecclesiasticis from his friend ": null
    },
    {
        "Gerardus Vossius": "gerardus vossius"
    },
    {
        ".     The letter was a general introduction on tolerance, mainly on the subject of predestination and the sacrament... an extensive, detailed and generally unfavourable review of Walaeus Ampt, stuffed with references to ancient and modern authorities.  When Grotius wrote asking for some notes he received a treasure-house of ecclesiastical history. ...offering ammunition to Grotius, who gratefully accepted it . Around this time Grotius went to Amsterdam as part of his official duties, trying to persuade the civil authorities there to join Hollands majority view about church politics.     In early 42 Grotius debated the question of giving counter-remonstrants the chance to preach in the ": null
    },
    {
        "Kloosterkerk in The Hague": "kloosterkerk, the hague"
    },
    {
        " which had been closed. During this time lawsuits were brought against the States of Holland by counter-remonstrant ministers and riots over the controversy broke out in Amsterdam.     De Imperio Summarum Potestatum circa Sacra      As the conflict between civil and religious authorities escalated, in order to maintain civil order Oldenbarnevelt eventually proposed that local authorities be given the power to raise troops . Such a measure putatively undermined the authority of the Captain-General of the republic, ": null
    },
    {
        "Maurice of Nassau, Prince of Orange": "maurice of nassau, prince of orange"
    },
    {
        ". Maurice seized the opportunity to solidify the preeminence of the ": null
    },
    {
        "Gomarist": "gomarist"
    },
    {
        "s, whom he had supported, and to eliminate the nuisance he perceived in Oldenbarnevelt . During this time Grotius made another attempt to address ecclesiastical politics by completing De Imperio Summarum Potestatum circa Sacra, on the relations between the religious and secular authorities...Grotius had even cherished hopes that publication of this book would turn the tide and bring back peace to church and state .          The conflict between Maurice and the States of Holland, led by Oldenbarnevelt and Grotius, about the Sharp Resolution and Hollands refusal to allow a National Synod, came to a head in July 42 when a majority in the States General authorized Maurice to disband the auxiliary troops in Utrecht. Grotius went on a mission to the States of Utrecht to stiffen their resistance against this move, but Maurice prevailed. The States General then authorized him to arrest Oldenbarnevelt, Grotius and ": null
    },
    {
        "Rombout Hogerbeets": "rombout hogerbeets"
    },
    {
        " on 42 August 42 They were tried by a court of delegated judges from the States General. Van Oldenbarnevelt was sentenced to death and was beheaded in 42 Grotius was sentenced to life imprisonment and transferred to Loevestein Castle.     From his imprisonment in Loevestein, Grotius made a written justification of his position as to my views on the power of the Christian authorities in ecclesiastical matters, I refer to my...booklet De Pietate Ordinum Hollandiae and especially to an unpublished book De Imperio summarum potestatum circa sacra, where I have treated the matter in more detail...I may summarize my feelings thus: that the authorities should scrutinize Gods Word so thoroughly as to be certain to impose nothing which is against it; if they act in this way, they shall in good conscience have control of the public churches and public worship  – but without persecuting those who err from the right way.  Because this stripped Church officials of any power some of their members  declared Grotius ideas diabolical.          In 42 with the help of his wife and his maidservant, ": null
    },
    {
        "Elsje van Houwening": "elsje van houwening"
    },
    {
        ", Grotius managed to escape the castle in a book chest and fled to ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". In the Netherlands today, he is mainly famous for this daring escape. Both the ": null
    },
    {
        "Rijksmuseum": "rijksmuseum"
    },
    {
        " in ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        " and the museum ": null
    },
    {
        "Het Prinsenhof": "prinsenhof"
    },
    {
        " in Delft claim to have the original book chest in their collection.     Grotius was well received in Paris by his former acquaintances and was granted a royal pension under ": null
    },
    {
        "Louis XIII": "louis xiii"
    },
    {
        ". It was there in France that Grotius completed his most famous philosophical works.     On The Truth of the Christian ReligionBewijs van den waren Godsdienst, was published in 42 the Latin treatise in 42 under the title De veritate religionis Christianae.       Grotius also developed a particular view of the ": null
    },
    {
        "atonement": "atonement in christianity"
    },
    {
        " of Christ known as the ": null
    },
    {
        "Governmental": "atonement"
    },
    {
        " or Moral government theory. He theorized that Jesus sacrificial death occurred in order for the Father to forgive while still maintaining his just rule over the universe. This idea, further developed by theologians such as ": null
    },
    {
        "John Miley": "john miley"
    },
    {
        ", became one of the prominent views of the atonement in ": null
    },
    {
        "Methodist": "methodist"
    },
    {
        " Arminianism": "arminianism"
    },
    {
        ".      De Jure Belli ac Pacis        Living in the times of the ": null
    },
    {
        "Eighty Years War": "eighty years war"
    },
    {
        " between ": null
    },
    {
        "Spain": "spain"
    },
    {
        " and the Netherlands and the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " between Catholic and Protestant European nations , it is not surprising that Grotius was deeply concerned with matters of conflicts between nations and religions. His most lasting work, begun in prison and published during his exile in Paris, was a monumental effort to restrain such conflicts on the basis of a broad moral consensus. Grotius wrote:       Fully convinced...that there is a common law among nations, which is valid alike for war and in war, I have had many and weighty reasons for undertaking to write upon the subject. Throughout the Christian world I observed a lack of restraint in relation to war, such as even barbarous races should be ashamed of; I observed that men rush to arms for slight causes, or no cause at all, and that when arms have once been taken up there is no longer any respect for law, divine or human; it is as if, in accordance with a general decree, frenzy had openly been let loose for the committing of all crimes.        De jure belli ac pacis libri tres   was first published in 42 dedicated to Grotius current patron, Louis XIII. The treatise advances a system of principles of natural law, which are held to be binding on all people and nations regardless of local custom. The work is divided into three books:   Book I advances his conception of ": null
    },
    {
        "war": "philosophy of war"
    },
    {
        " and of natural ": null
    },
    {
        "justice": "justice"
    },
    {
        ", arguing that there are some circumstances in which war is justifiable.   Book II identifies three just causes for war: ": null
    },
    {
        "self-defense": "self-defense"
    },
    {
        ", ": null
    },
    {
        "reparation of injury": "restitution"
    },
    {
        ", and ": null
    },
    {
        "punishment": "punishment"
    },
    {
        "; Grotius considers a wide variety of circumstances under which these rights of war attach and when they do not.   Book III takes up the question of what rules govern the conduct of war once it has begun; influentially, Grotius argued that all parties to war are bound by such rules, whether their cause is just or not.            Grotius concept of natural law had a strong impact on the philosophical and theological debates and political developments of the 42th and 42th centuries. Among those he influenced were ": null
    },
    {
        "Samuel Pufendorf": "samuel pufendorf"
    },
    {
        " and ": null
    },
    {
        "John Locke": "john locke"
    },
    {
        ", and by way of these philosophers his thinking became part of the cultural background of the ": null
    },
    {
        "Glorious Revolution": "glorious revolution"
    },
    {
        " in England and the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        ". In Grotius understanding, ": null
    },
    {
        "nature": "nature"
    },
    {
        " was not an entity in itself, but Gods ": null
    },
    {
        "creation": "creationism"
    },
    {
        ". Therefore, his concept of natural law had a theological foundation. The ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        " contained moral precepts , which ": null
    },
    {
        "Christ": "christ"
    },
    {
        " confirmed and therefore were still valid. They were useful in interpreting the content of natural law. Both Biblical ": null
    },
    {
        "revelation": "revelation"
    },
    {
        " and natural law originated in God and could therefore not contradict each other.       Many exiled Remonstrants began to return to the Netherlands after the death of Prince Maurice in 42 when toleration was granted to them. In 42 they were allowed complete freedom to build and run churches and schools and to live anywhere in Holland. The Remonstrants guided by ": null
    },
    {
        "Johannes Wtenbogaert": "johannes wtenbogaert"
    },
    {
        " set up a presbyterial organization. They established a theological seminary at Amsterdam where Grotius came to teach alongside ": null
    },
    {
        "Episcopius": "simon episcopius"
    },
    {
        ", ": null
    },
    {
        "van Limborch": "philipp van limborch"
    },
    {
        ", ": null
    },
    {
        "de Courcelles": "étienne de courcelles"
    },
    {
        ", and ": null
    },
    {
        "Leclerc": "jean leclerc"
    },
    {
        ".     In 42 Grotius was given the opportunity to serve as ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        "s ambassador to ": null
    },
    {
        "France": "france"
    },
    {
        ". The recently deceased Swedish king, ": null
    },
    {
        "Gustavus Adolphus": "gustavus adolphus"
    },
    {
        ", had been an admirer of Grotius . His successors regent, ": null
    },
    {
        "Axel Oxenstierna": "axel oxenstierna"
    },
    {
        ", was keen to have Grotius in his employ. Grotius accepted the offer and took up ": null
    },
    {
        "diplomatic": "diplomacy"
    },
    {
        " residence in Paris, which remained his home until he was released from his post in 42     While departing from his last visit to Sweden, Grotius was ": null
    },
    {
        "shipwreck": "shipwreck"
    },
    {
        "ed on the voyage. He washed up on the shore of ": null
    },
    {
        "Rostock": "rostock"
    },
    {
        ", ill and weather-beaten, and on August 42 42 he died; his body at last returned to the country of his youth, being laid to rest in the ": null
    },
    {
        "Nieuwe Kerk": "nieuwe kerk"
    },
    {
        " in Delft.            Grotius personal motto was Ruit hora ; his last words were By understanding many things, I have accomplished nothing . Significant friends and acquaintances of his included the theologian ": null
    },
    {
        "Franciscus Junius": "franciscus junius"
    },
    {
        ", the poet ": null
    },
    {
        "Daniel Heinsius": "daniel heinsius"
    },
    {
        ", the philologist ": null
    },
    {
        "Gerhard Johann Vossius": "gerhard johann vossius"
    },
    {
        ", the historian ": null
    },
    {
        "Johannes Meursius": "johannes meursius"
    },
    {
        ", the engineer ": null
    },
    {
        "Simon Stevin": "simon stevin"
    },
    {
        ", the historian ": null
    },
    {
        "Jacques Auguste de Thou": "jacques auguste de thou"
    },
    {
        ", the Orientalist and Arabic scholar ": null
    },
    {
        "Erpinius": "thomas van erpe"
    },
    {
        ", and the French ambassador in the Dutch Republic, ": null
    },
    {
        "Benjamin Aubery du Maurier": "benjamin aubery du maurier"
    },
    {
        ", who allowed him to use the French diplomatic mail in the first years of his exile. He was also friends with the ": null
    },
    {
        "Brabantian": "duchy of brabant"
    },
    {
        " Jesuit": "jesuit"
    },
    {
        " Andreas Schottus": "andreas schottus"
    },
    {
        ".     Grotius was the father of regent and diplomat ": null
    },
    {
        "Pieter de Groot": "pieter de groot"
    },
    {
        ".       ": null
    },
    {
        "Andrew Dickson White": "andrew dickson white"
    },
    {
        " wrote:       Into the very midst of all this welter of evil, at a point in time to all appearance hopeless, at a point in space apparently defenseless, in a nation of which every man, woman, and child was under sentence of death from its sovereign, was born a man who wrought as no other has ever done for a redemption of civilization from the main cause of all that misery; who thought out for Europe the precepts of right reason in international law; who made them heard; who gave a noble change to the course of human affairs; whose thoughts, reasonings, suggestions, and appeals produced an environment in which came an evolution of humanity that still continues.       In contrast, ": null
    },
    {
        "Robert A. Heinlein": "robert a. heinlein"
    },
    {
        " satirized the Grotian ": null
    },
    {
        "governmental": "governmental theory of atonement"
    },
    {
        " approach to theology in  Methuselahs Children : There is an old, old story about a theologian who was asked to reconcile the ": null
    },
    {
        "doctrine": "doctrine"
    },
    {
        " of ": null
    },
    {
        "Divine Mercy": "divine mercy"
    },
    {
        " with the doctrine of ": null
    },
    {
        "infant damnation": "original sin"
    },
    {
        ". The Almighty, he explained, finds it ": null
    },
    {
        "necessary": "predeterminism"
    },
    {
        " to do things in His official and public capacity which in His private and personal capacity He deplores.                The ": null
    },
    {
        "Peace Palace Library": "peace palace library"
    },
    {
        " in ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        " holds the Grotius Collection, which has a large number of books by and about Hugo Grotius. The collection was based on a donation from ": null
    },
    {
        "Martinus Nijhoff": "martinus nijhoff"
    },
    {
        " of 42 editions of De jure belli ac pacis libri tres.     Works are listed in order of publication, with the exception of works published posthumously or after long delay . Where an English translation is available, the most recently published translation is listed beneath the title.     Martiani Minei Felicis Capellæ Carthaginiensis viri proconsularis Satyricon, in quo De nuptiis Philologiæ & Mercurij libri duo, & De septem artibus liberalibus libri singulares. Omnes, & emendati, & Notis, siue Februis Hug. Grotii illustrati - 42   Adamus exul – The Hague, 42   De republica emendanda – pub. The Hague, 42   Parallelon rerumpublicarum – pub. Haarlem 42–42   De Indis – pub. 42 as De Jure Praedae Christus patiens – Leiden, 42   Mare Liberum  – Leiden, 42   De antiquitate reipublicae Batavicae – Leiden, 42    :The Antiquity of the Batavian Republic, ed. Jan Waszink and others .   Meletius – pub. Leiden, 42   :Meletius, ed. G.H.M. Posthumus Meyjes .   Annales et Historiae de rebus Belgicis – pub. Amsterdam, 42   :The Annals and History of the Low-Countrey-warrs, ed. Thomas Manley :   : Modern Dutch translation of the Annales only in: Hugo de Groot, Kroniek van de Nederlandse Oorlog. De Opstand 4242 , ed. Jan Waszink , with introduction, index, plates.   Ordinum Hollandiae ac Westfrisiae pietas – Leiden, 42   :Ordinum Hollandiae ac Westfrisiae pietas, ed. Edwin Rabbie .   De imperio summarum potestatum circa sacra – pub. Paris, 42   :De imperio summarum potestatum circa sacra, ed. Harm-Jan van Dam .   De satisfactione Christi adversus Faustum Socinum  – Leiden, 42   :Defensio fidei catholicae de satisfactione Christi, ed. Edwin Rabbie .   :, tr. Frank Hugh Foster .   Inleydinge tot de Hollantsche rechtsgeleertheit – pub. The Hague, 42   :The Jurisprudence of Holland, ed. R.W. Lee .   Bewijs van den waaren godsdienst – Rotterdam, 42   Apologeticus ": null
    }
]