[
    {
        "     Hugo Laurenz August Hofmann von Hofmannsthal  was an Austrian prodigy, a ": null
    },
    {
        "novelist": "novelist"
    },
    {
        ", ": null
    },
    {
        "librettist": "libretto"
    },
    {
        ", ": null
    },
    {
        "poet": "poetry"
    },
    {
        ", ": null
    },
    {
        "dramatist": "playwright"
    },
    {
        ", narrator, and ": null
    },
    {
        "essay": "essay"
    },
    {
        "ist.          Hofmannsthal was born in ": null
    },
    {
        "Landstraße": "landstraße"
    },
    {
        ", Vienna, the son of an upper-class Christian Austrian mother, Anna Maria Josefa Fohleutner , and a Christian Austrian–Italian bank manager, Hugo August Peter Hofmann, Edler von Hofmannsthal .     His great-grandfather, ": null
    },
    {
        "Isaak Löw Hofmann, Edler von Hofmannsthal": "isaak löw hofmann, edler von hofmannsthal"
    },
    {
        ", from whom his family inherited the noble title ": null
    },
    {
        "Edler": "edler"
    },
    {
        " von Hofmannsthal , was a Jewish tobacco farmer ennobled by the Austrian emperor.     He began to write poems and plays from an early age. Some of his early works were written under pseudonyms, such as Loris Melikow and Theophil Morren, because he was not allowed to publish as a student. He met the German poet ": null
    },
    {
        "Stefan George": "stefan george"
    },
    {
        " at the age of seventeen and had several poems published in Georges journal, Blätter für die Kunst. He studied ": null
    },
    {
        "law": "law"
    },
    {
        " and later ": null
    },
    {
        "philology": "philology"
    },
    {
        " in Vienna but decided to devote himself to writing upon graduating in 42 Along with ": null
    },
    {
        "Peter Altenberg": "peter altenberg"
    },
    {
        " and ": null
    },
    {
        "Arthur Schnitzler": "arthur schnitzler"
    },
    {
        ", he was a member of the  avant garde  group ": null
    },
    {
        "Young Vienna": "young vienna"
    },
    {
        " .       In 42 Hofmannsthal met the ": null
    },
    {
        "composer": "composer"
    },
    {
        " Richard Strauss": "richard strauss"
    },
    {
        " for the first time. He later wrote ": null
    },
    {
        "libretti": "libretto"
    },
    {
        " for several of his ": null
    },
    {
        "opera": "opera"
    },
    {
        "s, including  Elektra  ,  Der Rosenkavalier  with Harry von Kessler,  Ariadne auf Naxos  ,  Die Frau ohne Schatten  ,  Die ägyptische Helena  , and  Arabella  .     In 42 he adapted the 42th century English ": null
    },
    {
        "morality play": "morality play"
    },
    {
        "  Everyman  as  Jedermann , and ": null
    },
    {
        "Jean Sibelius": "jean sibelius"
    },
    {
        " wrote ": null
    },
    {
        "incidental music": "incidental music"
    },
    {
        " for it. The play later became a staple at the ": null
    },
    {
        "Salzburg Festival": "salzburg festival"
    },
    {
        ".     During the First World War Hofmannsthal held a government post. He wrote speeches and articles supporting the war effort, and emphasizing the cultural tradition of ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ". The end of the war spelled the end of the ": null
    },
    {
        "Habsburg monarchy": "habsburg monarchy"
    },
    {
        " in Austria; this was a blow from which the patriotic and conservative-minded Hofmannsthal never fully recovered.     Nevertheless, the years after the war were very productive ones for Hofmannsthal; he continued with his earlier literary projects, almost without a break. He wrote several new libretti for Richard Strauss operas. In 42 Hofmannsthal, along with ": null
    },
    {
        "Max Reinhardt": "max reinhardt"
    },
    {
        ", founded the Salzburg Festival. His later plays revealed a growing interest in ": null
    },
    {
        "religious": "religion"
    },
    {
        ", particularly ": null
    },
    {
        "Roman Catholic": "roman catholicism in austria"
    },
    {
        ", themes. Among his writings was a screenplay for ": null
    },
    {
        "a film version": "der rosenkavalier"
    },
    {
        " of Der Rosenkavalier directed by ": null
    },
    {
        "Robert Wiene": "robert wiene"
    },
    {
        ".       In 42 he married Gertrud Gerty Schlesinger, the daughter of a Viennese banker. Gerty, who was Jewish, converted to Christianity before their marriage. They settled in ": null
    },
    {
        "Rodaun": ":de:rodaun"
    },
    {
        " , not far from ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", and had three children, Christiane, Franz, and Raimund.     On 42 July 42 his son Franz committed suicide. Two days later, shortly after attending Franzs funeral, Hugo himself died of a stroke at Rodaun. He was buried wearing the habit of a ": null
    },
    {
        "Franciscan tertiary": "third order of saint francis"
    },
    {
        ", as he had requested.     In early 42 his daughter Christiane married German ": null
    },
    {
        "indologist": "indology"
    },
    {
        ", ": null
    },
    {
        "Heinrich Zimmer": "heinrich zimmer"
    },
    {
        ", who taught at ": null
    },
    {
        "University of Greifswald": "university of greifswald"
    },
    {
        ", ": null
    },
    {
        "Heidelberg University": "heidelberg university"
    },
    {
        ", and ": null
    },
    {
        "Balliol College, Oxford": "balliol college, oxford"
    },
    {
        " . After they moved to ": null
    },
    {
        "New Rochelle, New York": "new rochelle, new york"
    },
    {
        ", her husband became a Visiting Lecturer in Philosophy at ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        ".     On 42 January 42 his son Raimund married ": null
    },
    {
        "Ava Alice Muriel Astor": "ava alice muriel astor"
    },
    {
        ", daughter of ": null
    },
    {
        "John Jacob Astor IV": "john jacob astor iv"
    },
    {
        " and ": null
    },
    {
        "Ava Lowle Willing": "ava lowle willing"
    },
    {
        ". After divorcing Ava in 42 Raimund later married Lady Elizabeth Paget, daughter of ": null
    },
    {
        "the sixth Marquess of Anglesey": "charles paget, 6th marquess of anglesey"
    },
    {
        ".       On 42 October 42 Hofmannsthal published a fictive letter in the Berlin Daily, Der Tag  titled simply ": null
    },
    {
        " Ein Brief ": "the lord chandos letter"
    },
    {
        ". It was purportedly written in 42 by Philip, Lord Chandos to ": null
    },
    {
        "Francis Bacon": "francis bacon"
    },
    {
        ". In this letter Chandos says that he has stopped writing because he has lost completely the ability to think or to speak of anything coherently ; he has given up on the possibility of language to describe the world. This letter reflects the growing distrust of and dissatisfaction with language that so characterizes the Modern era, and Chandoss dissolving personality is not only individual but societal.     Growing up the son of a wealthy merchant who was well connected with the major artists of the time, Hofmannsthal was raised in what ": null
    },
    {
        "Carl Schorske": "carl emil schorske"
    },
    {
        " refers to as the temple of art . This perfect setting for aesthetic isolation allowed Hofmannsthal the unique perspective of the privileged artist, but also allowed him to see that art had become a flattened documenting of humanity, which took our instincts and desires and framed them for viewing without acquiring any of the living, passionate elements. Because of this realization, Hofmannsthal’s idea of the role of the artist began to take shape as someone who created works that would inspire or inflame the instinct, rather than merely preserving it in a creative form. He also began to think that the artist should not be someone isolated and left to his art, but rather a man of the world, immersed in both politics and art.     Hofmannsthal saw in English culture the ideal setting for the artist. This was because the English simultaneously admired ": null
    },
    {
        "Admiral Nelson": "horatio nelson, 1st viscount nelson"
    },
    {
        " and ": null
    },
    {
        "John Milton": "john milton"
    },
    {
        ", both war heroes and poets, while still maintaining a solid national identity. In view, the division between artist and man of action does not exist in England. Britain provides her subjects with a common base of energy which functions as equilibrium, a force lacking in fragmented Germany . This singular and yet pragmatic identity must have appealed to Hofmannsthal to a certain degree due to the large scale fragmentation of Austria at the time, which was in the throes of radical nationalism and anti-Semitism, a nation in which the progressive artist and the progressive politician were growing more different and hostile to each other by the day.       The ": null
    },
    {
        "Austria": "austria"
    },
    {
        "n author ": null
    },
    {
        "Stefan Zweig": "stefan zweig"
    },
    {
        " wrote in his memoirs  The World of Yesterday  on Hofmannsthals early accomplishments and their influence on Zweigs generation:          Plays   Libretti   Narrations and fictitious conversations   Novel    Essays, speeches, prose   Poetry": null
    }
]