[
    {
        "           The ": null
    },
    {
        "United States Navy": "United States Navy"
    },
    {
        ", ": null
    },
    {
        "United States Coast Guard": "United States Coast Guard"
    },
    {
        ", and United States ": null
    },
    {
        "National Oceanic and Atmospheric Administration": "National Oceanic And Atmospheric Administration"
    },
    {
        " use a hull classification symbol  to identify their ships by type and by individual ship within a type. The system is analogous to the ": null
    },
    {
        "pennant number": "Pennant Number"
    },
    {
        " system that the ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        " and other European and ": null
    },
    {
        "Commonwealth": "Commonwealth Of Nations"
    },
    {
        " navies use.           The U.S. Navy began to assign unique ": null
    },
    {
        "Naval Registry Identification Numbers": "Naval Registry Identification Number"
    },
    {
        "to its ships in the 1890s. The system was a simple one in which each ship received a number which was appended to its ship type, fully spelled out, and added parenthetically after the ships name when deemed necessary to avoid confusion between ships. Under this system, for example, the ": null
    },
    {
        "battleship": "Battleship"
    },
    {
        " Indiana": "Uss Indiana"
    },
    {
        " was USS Indiana , the ": null
    },
    {
        "cruiser": "Cruiser"
    },
    {
        " Olympia": "Uss Olympia"
    },
    {
        " was USS Olympia , and so on. Beginning in 1907, some ships also were referred to alternatively by single-letter or three-letter codes—for example, USS Indiana could be referred to as USS Indiana and USS Olympia could also be referred to as USS Olympia , while USS Pennsylvania could be referred to as USS Pennsylvania . However, rather than replacing it, these codes coexisted and were used interchangeably with the older system until the modern system was instituted on 17 July 1920.     During ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ", the U.S. Navy acquired large numbers of privately owned and commercial ships and craft for use as ": null
    },
    {
        "patrol vessel": "Patrol Vessel"
    },
    {
        "s, ": null
    },
    {
        "mine warfare vessels": "Minelayer"
    },
    {
        ", and various types of naval ": null
    },
    {
        "auxiliary ship": "Auxiliary Ship"
    },
    {
        "s, some of them with identical names. To keep track of them all, the Navy assigned unique identifying numbers to them. Those deemed appropriate for patrol work received ": null
    },
    {
        "section patrol": "Section Patrol"
    },
    {
        " numbers , while those intended for other purposes received identification numbers , generally abbreviated Id. No. or ID; some ships and craft changed from an SP to an ID number or vice versa during their careers, without their unique numbers themselves changing, and some ships and craft assigned numbers in anticipation of naval service never were acquired by the Navy. The SP/ID numbering sequence was unified and continuous, with no SP number repeated in the ID series or vice versa so that there could not be, for example, both an SP-435 and an Id. No 435 . The SP and ID numbers were used parenthetically after each boats or ships name to identify it; although this system pre-dated the modern hull classification system and its numbers were not referred to at the time as hull codes or hull numbers, it was used in a similar manner to todays system and can be considered its precursor. Naval History and heritage Command Online Library of Selected Images .       The ": null
    },
    {
        "United States Revenue Cutter Service": "United States Revenue Cutter Service"
    },
    {
        ", which merged with the ": null
    },
    {
        "United States Lifesaving Service": "United States Lifesaving Service"
    },
    {
        " in January 1915 to form the modern ": null
    },
    {
        "United States Coast Guard": "United States Coast Guard"
    },
    {
        ", began following the Navys lead in the 1890s, with its ": null
    },
    {
        "cutters": "United States Coast Guard Cutter"
    },
    {
        " having parenthetical numbers called ": null
    },
    {
        "Naval Registry Identification Numbers": "Naval Registry Identification Number"
    },
    {
        "following their names, such as , etc. This persisted until the Navys modern hull classification systems introduction in 1920, which included Coast Guard ships and craft.         Like the U.S. Navy, the ": null
    },
    {
        "United States Coast and Geodetic Survey": "United States Coast And Geodetic Survey"
    },
    {
        " – a uniformed seagoing service of the ": null
    },
    {
        "United States Government": "United States Government"
    },
    {
        " and a predecessor of the ": null
    },
    {
        "National Oceanic and Atmospheric Administration": "National Oceanic And Atmospheric Administration"
    },
    {
        " – adopted a hull number system for its fleet in the 20th century. Its largest vessels, Category I ": null
    },
    {
        "oceanographic": "Oceanography"
    },
    {
        " survey ship": "Survey Ship"
    },
    {
        "s, were classified as ocean survey ships and given the designation OSS . Intermediate-sized Category II oceanographic survey ships received the designation MSS for medium survey ship, and smaller Category III oceanographic survey ships were given the classification CSS for coastal survey ship. A fourth designation, ASV for auxiliary survey vessel, included even smaller vessels. In each case, a particular ship received a unique designation based on its classification and a unique hull number separated by a space rather than a hyphen; for example, the third Coast and Geodetic Survey ship named Pioneer was an ocean survey ship officially known as ": null
    },
    {
        "USC & GS Pioneer ": "Usc & Gs Pioneer"
    },
    {
        ".   The Coast and Geodetic Surveys system persisted after the creation of NOAA in 1970, when NOAA took control of the Surveys fleet, but NOAA later changed to its modern hull classification system.             The U.S. Navy instituted its modern hull classification system on 17 July 1920, doing away with section patrol numbers, identification numbers , and the other numbering systems described above. In the new system, all hull classification symbols are at least two letters; for basic types the symbol is the first letter of the type name, doubled, except for aircraft carriers.     The combination of symbol and hull number identifies a modern Navy ship uniquely. A heavily modified or re-purposed ship may receive a new symbol, and either retain the hull number or receive a new one. For example, the heavy gun cruiser  was converted to a gun/missile cruiser, changing the hull number to CAG-1. Also, the system of symbols has changed a number of times both since it was introduced in 1907 and since the modern system was instituted in 1920, so ships symbols sometimes change without anything being done to the physical ship. Derdall and DiGiulian,      Hull numbers are assigned by classification. Duplication between, but not within, classifications is permitted. Hence, CV-1 was the ": null
    },
    {
        "aircraft carrier": "Aircraft Carrier"
    },
    {
        "  and BB-1 was the battleship .     Ship types and classifications have come and gone over the years, and many of the symbols listed below are not presently in use. The ": null
    },
    {
        "Naval Vessel Register": "Naval Vessel Register"
    },
    {
        " maintains an online database of U.S. Navy ships showing which symbols are presently in use.     After ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " until 1975, the U.S. Navy defined a ": null
    },
    {
        "frigate": "Frigate"
    },
    {
        " as a type of surface warship larger than a ": null
    },
    {
        "destroyer": "Destroyer"
    },
    {
        " and smaller than a cruiser. In other navies, such a ship generally was referred to as a ": null
    },
    {
        "flotilla leader": "Flotilla Leader"
    },
    {
        " , or destroyer leader . Hence the U.S. Navys use of DL for frigate prior to 1975, while frigates in other navies were smaller than destroyers and more like what the U.S. Navy termed a ": null
    },
    {
        "destroyer escort": "Destroyer Escort"
    },
    {
        " , ": null
    },
    {
        "ocean escort": "Ocean Escort"
    },
    {
        " , or DE . The ": null
    },
    {
        "United States Navy 1975 ship reclassification": "United States Navy 1975 Ship Reclassification"
    },
    {
        " of ": null
    },
    {
        "cruiser": "Cruiser"
    },
    {
        "s, frigates, and ocean escorts brought U.S. Navy classifications into line with other nations classifications, at least cosmetically in terms of terminology, and eliminated the perceived ": null
    },
    {
        " cruiser gap ": "United States Navy 1975 Ship Reclassificationthe   Cruiser Gap"
    },
    {
        " with the ": null
    },
    {
        "Soviet Navy": "Soviet Navy"
    },
    {
        " by redesignating the former frigates as cruisers .       If a U.S. Navy ships hull classification symbol begins with T- , it is part of the ": null
    },
    {
        "Military Sealift Command": "Military Sealift Command"
    },
    {
        ", has a primarily civilian crew, and is a ": null
    },
    {
        "United States Naval Ship": "United States Naval Ship"
    },
    {
        " in non-commissioned service – as opposed to a ": null
    },
    {
        "commissioned": "Ship Commissioning"
    },
    {
        " United States Ship": "United States Ship"
    },
    {
        " with an all-military crew.       If a ships hull classification symbol begins with W , it is a ship of the ": null
    },
    {
        "United States Coast Guard": "United States Coast Guard"
    },
    {
        ". Until 1965, the Coast Guard used U.S. Navy hull classification codes, prepending a W to their beginning. In 1965, it retired some of the less mission-appropriate Navy-based classifications and developed new ones of its own, most notably WHEC for ": null
    },
    {
        "high endurance cutter": "High Endurance Cutter"
    },
    {
        " and WMEC for ": null
    },
    {
        "medium endurance cutter": "Medium Endurance Cutter"
    },
    {
        " .       The ": null
    },
    {
        "National Oceanic and Atmospheric Administration": "National Oceanic And Atmospheric Administration"
    },
    {
        " , a component of the ": null
    },
    {
        "United States Department of Commerce": "United States Department Of Commerce"
    },
    {
        ", includes the ": null
    },
    {
        "National Oceanic and Atmospheric Administration Commissioned Officer Corps": "National Oceanic And Atmospheric Administration Commissioned Officer Corps"
    },
    {
        " , one of the seven ": null
    },
    {
        "uniformed services of the United States": "Uniformed Services Of The United States"
    },
    {
        ", and operates a fleet of seagoing research and survey ships. The ": null
    },
    {
        "NOAA fleet": "Noaa Ships And Aircraft"
    },
    {
        " also uses a hull classification symbol system, which it also calls hull numbers, for its ships.     After NOAA took over the former Coast and Geodetic Survey fleet in 1970 along with research vessels of other government agencies, it adopted a new system of ship classification. In its system, the NOAA fleet is divided into two broad categories, ": null
    },
    {
        "research ships": "Research Ship"
    },
    {
        "and ": null
    },
    {
        "survey ship": "Survey Ship"
    },
    {
        "s. The research ships, which include ": null
    },
    {
        "oceanographic": "Oceanography"
    },
    {
        " and ": null
    },
    {
        "fisheries": "Fishery"
    },
    {
        " research vessels, are given hull numbers beginning with R , while the survey ships, generally ": null
    },
    {
        "hydrographic": "Hydrography"
    },
    {
        " survey vessels, receive hull numbers beginning with S . The letter is followed by a three-digit number; the first digit indicates the NOAA class of the vessel, which NOAA assigns based on the ships ": null
    },
    {
        "gross ton": "Gross Ton"
    },
    {
        "nage and ": null
    },
    {
        "horsepower": "Horsepower"
    },
    {
        ", while the next two digits combine with the first digit to create a unique three-digit identifying number for the ship.     Generally, each NOAA hull number is written with a space between the letter and the three-digit number, as in, for example,  or . Wertheim, The Naval Institute Guide to Combat Fleets of the World, 15th Edition: Their Ships, Aircraft, and Systems, p. 1005.     Unlike the Navy, once an older NOAA ship leaves service, a newer one can be given the same hull number; for example, S 222 was assigned to , then assigned to NOAAS Thomas Jefferson , which entered NOAA service after Mount Mitchell was stricken.         The U.S. Navys system of alpha-numeric ship designators, and its associated hull numbers, have been for several decades a unique method of categorizing ships of all types: combatants, auxiliaries and district craft. Though considerably changed in detail and expanded over the years, this system remains essentially the same as when formally implemented in 1920. It is a very useful tool for organizing and keeping track of naval vessels, and also provides the basis for the identification numbers painted on the bows of most U.S. Navy ships.     The ship designator and hull number systems roots extend back to the late 1880s, when ship type serial numbers were assigned to most of the new-construction warships of the emerging Steel Navy . During the course of the next thirty years, these same numbers were combined with filing codes used by the Navys clerks to create an informal version of the system that was put in place in 1920. Limited usage of ship numbers goes back even earlier, most notably to the Jeffersonian Gunboats of the early 1800s and the Tinclad river gunboats of the Civil War Mississippi Squadron.     It is important to understand that hull number letter prefixes are not acronyms, and should not be carelessly treated as abbreviations of ship type classifications. Thus, DD does not stand for anything more than Destroyer . SS simply means Submarine . And FF is the post-1975 type code for Frigate.      The hull classification codes for ships in active duty in the United States Navy are governed under Secretary of the Navy Instruction 5030.8B        Warships are designed to participate in combat operations.     The origin of the two-letter code derives from the need to distinguish various cruiser subtypes. Derdall and DiGiulian,           Aircraft carriers are ships designed primarily for the purpose of conducting combat operations by aircraft which engage in attacks against airborne, surface, sub-surface and shore targets. Contrary to popular belief, the CV hull classification symbol does not stand for carrier vessel . CV derives from the cruiser designation, with the v for French voler, to fly  . Aircraft carriers are designated in two sequences: the first sequence runs from CV-1 USS  Langley  to the very latest ships, and the second sequence, CVE for escort carriers, ran from CVE-1 ": null
    },
    {
        "Long Island": "Uss Long Island"
    },
    {
        " to CVE-127 ": null
    },
    {
        "Okinawa": "Uss Okinawa"
    },
    {
        " before being discontinued.   AV: ": null
    },
    {
        "Seaplane Tender": "Seaplane Tender"
    },
    {
        "   AVG: ": null
    },
    {
        "Auxiliary Aircraft Ferry": "Auxiliary Aircraft Ferry"
    },
    {
        "    AVD: ": null
    },
    {
        "Seaplane Tender Destroyer": "Seaplane Tender Destroyer"
    },
    {
        "   AVP: ": null
    },
    {
        "Seaplane Tender": "Seaplane Tender"
    },
    {
        ", Small   AVT Auxiliary Aircraft Transport   AVT Auxiliary Training Carrier   ACV: ": null
    },
    {
        "Auxiliary Aircraft Carrier": "Auxiliary Aircraft Carrier"
    },
    {
        "   CV: ": null
    },
    {
        "Fleet aircraft carrier": "Fleet Aircraft Carrier"
    },
    {
        " , multi-purpose ": null
    },
    {
        "aircraft carrier": "Aircraft Carrier"
    },
    {
        "   CVA: Aircraft Carrier, Attack   CV: Aircraft Carrier, Night   CVAN: Aircraft Carrier, Attack, Nuclear-powered   CVB: Aircraft Carrier, Large    CVE: ": null
    },
    {
        "Escort aircraft carrier": "Escort Aircraft Carrier"
    },
    {
        "   CVHA: Aircraft Carrier, Helicopter Assault    CVHE: Aircraft Carrier, Helicopter, Escort   CVL: ": null
    },
    {
        "Light aircraft carrier": "Light Aircraft Carrier"
    },
    {
        " or Aircraft Carrier, Small   United States. Office of Naval Records and History. Glossary of US Naval Abbreviations. 5th ed. Washington: U.S. Govt. Print. Off., 1949. . accessed 6 May 2017.   CVN: Aircraft Carrier, Nuclear-powered   CVS: ": null
    },
    {
        "Antisubmarine Aircraft Carrier": "Antisubmarine Aircraft Carrier"
    },
    {
        "   CVT: Aircraft Carrier, Training   CVU: Aircraft Carrier, Utility   CVG: Aircraft Carrier, Guided Missile   CVV:  ": null
    },
    {
        "Aircraft Carrier, Vari-Purpose, Medium": "Aircraft Carrier"
    },
    {
        "       Surface combatants are ships which are designed primarily to engage enemy forces on the high seas. The primary surface combatants are battleships, cruisers and destroyers. Battleships are very heavily armed and armored; cruisers moderately so; destroyers and smaller warships, less so. Before 1920, ships were called no. X , with the type fully pronounced. The types were commonly abbreviated in ship lists to B-X , C-X , D-X et cetera—for example, before 1920,  would have been called USS Minnesota, Battleship number  22 orally and USS Minnesota, B-22 in writing. After 1920, the ships name would have been both written and pronounced USS Minnesota . In generally decreasing size, the types are:   ACR: Armored Cruiser   AFSB: ": null
    },
    {
        "Afloat Forward Staging Base": "Afloat Forward Staging Base"
    },
    {
        "   B: ": null
    },
    {
        "Battleship": "Battleship"
    },
    {
        "   BB: ": null
    },
    {
        "Battleship": "Battleship"
    },
    {
        " Arsenal Ship": "Arsenal Ship"
    },
    {
        " See .   BM: ": null
    },
    {
        "Monitor": "Monitor"
    },
    {
        "   C: ": null
    },
    {
        "Cruiser": "Cruiser"
    },
    {
        "    CA: Cruiser, Armored   CA: ": null
    },
    {
        "Heavy Cruiser": "Heavy Cruiser"
    },
    {
        ", category later renamed Gun Cruiser   CAG: Cruiser, Guided Missile   CB: Large cruiser   CBC: Large Command Cruiser See .   CC: ": null
    },
    {
        "Battlecruiser": "Battlecruiser"
    },
    {
        " See .   CC: Command Ship See .   CLC: Command Cruiser   CG: Cruiser, Guided Missile   CGN: Cruiser, Guided Missile, Nuclear-powered:  and  ": null
    },
    {
        "Light Cruiser": "Light Cruiser"
    },
    {
        " Cruiser Light   CLAA: Cruiser, Light, Anti-aircraft   CLG: Cruiser, Light, Guided Missile   CLGN: Cruiser, Light, Guided Missile, Nuclear-powered   CLK: Cruiser, Hunter-Killer see .   CM: Cruiser-minelayer   CS: Scout Cruiser   CSGN: ": null
    },
    {
        "Strike Cruiser": "Strike Cruiser"
    },
    {
        " Cruiser, Strike, Guided Missile, Nuclear-powered   D: Destroyer   DD: ": null
    },
    {
        "Destroyer": "Destroyer"
    },
    {
        "    DDE: ": null
    },
    {
        "Escort Destroyer": "Escort Destroyer"
    },
    {
        ", a Destroyer converted for ": null
    },
    {
        "antisubmarine warfare": "Antisubmarine Warfare"
    },
    {
        " – category abolished 1962.    DDG: ": null
    },
    {
        "Destroyer, Guided Missile": "Guided Missile Destroyer"
    },
    {
        " Radar Picket": "Radar Picket"
    },
    {
        "   DE: ": null
    },
    {
        "Destroyer Escort": "Destroyer Escort"
    },
    {
        "    DE: ": null
    },
    {
        "Ocean escort": "Ocean Escort"
    },
    {
        "   DEG: Guided Missile Ocean Escort   DER: Radar Picket Destroyer Escort There were two distinct breeds of DE, the World War II Destroyer Escorts and the postwar DE/DEG classes, which were known as Ocean Escorts despite carrying the same type symbol as the World War II Destroyer Escorts. All DEs, DEGs, and DERs were reclassified as FFs, FFGs, or FFRs, 30 June 1975.   DL: Destroyer Leader   DLG: Frigate, Guided Missile   DLGN: Frigate, Guided Missile, Nuclear-Propulsion The DL category was established in 1951 with the abolition of the CLK category. CLK 1 became DL 1 and DD 927–930 became DL 2–5. By the mid-1950s the term Destroyer Leader had been dropped in favor of Frigate. Most DLGs and DLGNs were reclassified as CGs and CGNs, 30 June 1975. However, DLG 6–15 became DDG 37–46. The old DLs were already gone by that time. Only applied to .   DM: Destroyer, Minelayer   DMS: Destroyer, Minesweeper   FF: ": null
    },
    {
        "Frigate": "Frigate"
    },
    {
        "    FFL: Frigate, Light   FFR: Frigate, Radar Picket   FFT: Frigate The FF, FFG, and FFR designations were established 30 June 1975 as new type symbols for ex-DEs, DEGs, and DERs. The first new-built ships to carry the FF/FFG designation were the s. In January 2015, it was announced that the LCS ship types would be redesignated as FF.   PG: Patrol Gunboat   PCH: ": null
    },
    {
        "Patrol Craft, Hydrofoil": "Uss High Point"
    },
    {
        "   PHM: ": null
    },
    {
        "Patrol, Hydrofoil, Missile": "Pegasus-Class Hydrofoil"
    },
    {
        "   K: ": null
    },
    {
        "Corvette": "Corvette"
    },
    {
        "   LCS: ": null
    },
    {
        "Littoral Combat Ship": "Littoral Combat Ship"
    },
    {
        " In January 2015, the Navy announced that the up-gunned LCS will be reclassified as a frigate, since the requirements of the ": null
    },
    {
        "SSC Task Force": "Littoral Combat Shipsmall Surface Combatant"
    },
    {
        " was to upgrade the ships with frigate-like capabilities. Hull designations will be changed from LCS to FF; existing LCSs back-fitted with modifications may also earn the FF label.  – News.USNI.org, 15 January 2015 The Navy is hoping to start retrofitting technological upgrades onto existing and under construction LCSs before 2019.  – Military.com, 4 March 2015   M: ": null
    },
    {
        "Monitor": "Monitor_"
    },
    {
        "   TB: ": null
    },
    {
        "Torpedo boat": "Torpedo Boat"
    },
    {
        "       Submarines are all self-propelled submersible types regardless of whether employed as combatant, auxiliary, or research and development vehicles which have at least a residual combat capability. While some classes, including all diesel-electric submarines, are retired from USN service, non-U.S. navies continue to employ SS, SSA, SSAN, SSB, SSC, SSG, SSM, and SST types. Russia still employs several SSA and SSAN class submarines like the Delta Stretch as well as one SST, China has older SSB and SSG types such as the Golf and Mod Romeo classes, and North Korea has built many SSCs and SSMs. See 2007–2008 Janes Fighting Ships. With the advent of new ": null
    },
    {
        "Air Independent Propulsion": "Air Independent Propulsion"
    },
    {
        "/Power systems, both SSI and SSP are used to distinguish the types within the USN, but SSP has been declared the preferred term. SSK, retired by the USN, continues to be used colloquially and interchangeably with SS for diesel-electric attack/patrol submarines within the USN, and, more formally, by the Royal Navy and British firms such as ": null
    },
    {
        "Janes Information Group": "Janes Information Group"
    },
    {
        ".   SC: Cruiser Submarine   SF: Fleet ": null
    },
    {
        "Submarine": "Submarine"
    },
    {
        "   SM: Submarine Minelayer   SS: Submarine, ": null
    },
    {
        "Attack Submarine": "Attack Submarine"
    },
    {
        "     SSA: Submarine Auxiliary, Auxiliary/Cargo Submarine   SSAN: Submarine Auxiliary Nuclear, Auxiliary/Cargo Submarine, Nuclear-powered   SSB: Submarine Ballistic, ": null
    },
    {
        "Ballistic Missile Submarine": "Ballistic Missile Submarine"
    },
    {
        " Ballistic Missile Submarine": "Ballistic Missile Submarine"
    },
    {
        ", Nuclear-powered   SSC: Coastal Submarine, over 150 tons   SSG: Guided Missile Submarine   SSGN: ": null
    },
    {
        "Guided Missile Submarine": "Cruise Missile Submarine"
    },
    {
        ", Nuclear-powered   SSI: Attack Submarine    SSK: ": null
    },
    {
        "Hunter-Killer": "Hunter-Killer Submarine"
    },
    {
        "/ASW Submarine     SSM: Midget Submarine, under 150 tons   SSN: ": null
    },
    {
        "Attack Submarine": "Ssn"
    },
    {
        ", Nuclear-powered   SSNR: Special ": null
    },
    {
        "Attack Submarine": "Attack Submarine"
    },
    {
        " This odd entry is not recognised by the U.S. Naval Vessel Register, and appears only in MIL-STD-2525A: Common Warfighting Symbology and later editions . It seems to refer to some kind of nuclear-powered submarine used by Special Operations Forces.   SSO: Submarine Oiler   SSP: Attack Submarine , formerly Submarine Transport   SSQ: Auxiliary Submarine, Communications   SSQN: Auxiliary Submarine, Communications, Nuclear-powered     SSR: ": null
    },
    {
        "Radar Picket Submarine": "Radar Picket"
    },
    {
        "   SSRN: Radar Picket Submarine, Nuclear-powered   SST: Training Submarine    ": null
    },
    {
        "Naval Nuclear Power School": "Naval Nuclear Power School"
    },
    {
        " Training Platform; Reconditioned SSBNsPibber or PBR-Vietnam Vietnam                                                                                                     ": null
    }
]