[
    {
        "   Hunedoara  is a ": null
    },
    {
        "city": "municipiu"
    },
    {
        " in ": null
    },
    {
        "Hunedoara County": "hunedoara county"
    },
    {
        ", ": null
    },
    {
        "Transylvania": "transylvania"
    },
    {
        ", ": null
    },
    {
        "Romania": "romania"
    },
    {
        ". It is located in southwestern Transylvania near the Poiana Ruscă Mountains, and administers five villages: Boș , Groș , Hășdat , Peștișu Mare  and Răcăștia .     The city includes the most important ": null
    },
    {
        "Gothic": "gothic architecture"
    },
    {
        "-style secular building in Transylvania: the ": null
    },
    {
        "Hunyad Castle": "hunyad castle"
    },
    {
        ", which is closely connected with the ": null
    },
    {
        "Hunyadi family": "hunyadi family"
    },
    {
        ". The castle was destroyed by fire five times, but underwent many reconstructions from ": null
    },
    {
        "Austro-Hungarian": "austro-hungarian"
    },
    {
        " and later ": null
    },
    {
        "Romania": "romania"
    },
    {
        "n authorities. Besides the castle, the town developed as a production center for iron and a market for the mountain regions nearby. During the 42th century, Hunedoaras population increased to 42 inhabitants. The city contained ": null
    },
    {
        "the largest steel works in Romania": "hunedoara steel works"
    },
    {
        " , but activity gradually diminished after the ": null
    },
    {
        "fall of the Iron Curtain": "revolutions of 1989"
    },
    {
        " due to the loss of the market. This was a blow to the overall prosperity of the town, which is now recovering through new investments.     The population consists of a majority of ": null
    },
    {
        "Romanians": "romanians"
    },
    {
        ", with ": null
    },
    {
        "Hungarians": "hungarians"
    },
    {
        " and ": null
    },
    {
        "Roma": "romani people"
    },
    {
        " as the most important minorities. The city contains numerous parks, with poplars and chestnut trees flanking the streets. There are many tourist attractions, including a large dam, with tourist facilities, located a few kilometers from the city, in the mountains.       The name of the town seems inexorably linked to the name of the ": null
    },
    {
        "Hunyadi family": "hunyadi family"
    },
    {
        " . The most probable explanation for the ": null
    },
    {
        "Romanian": "romanian language"
    },
    {
        " name Hunedoara is the transliteration of the Hungarian name Hunyadvár meaning Castle of Hunyad , as many Hungarian towns have this ": null
    },
    {
        "suffix": "suffix"
    },
    {
        ". Historically, the following names were recorded: Hungnod , Huniad , Hwnyadwar , Vayda Hunyadi . The latter Hungarian name Vajdahunyad is a direct referral to ": null
    },
    {
        "John Hunyadi": "john hunyadi"
    },
    {
        ". The etymology of the Hunyadi family implies a ": null
    },
    {
        "Vlach": "vlach"
    },
    {
        " origin.       ": null
    },
    {
        "Stone Age": "stone age"
    },
    {
        " tools were discovered in the Sânpetru hill near the castle and in the surrounding villages. The region was very rich in iron, which had been extracted in the area since the ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " by ": null
    },
    {
        "Thracian": "thracian"
    },
    {
        " tribes. The Dacian fortresses of ": null
    },
    {
        "Orăştie": "orăştie"
    },
    {
        " mountains, most notably ": null
    },
    {
        "Sarmiszegetusa": "sarmizegetusa regia"
    },
    {
        ", which became the most important religious and political center of ": null
    },
    {
        "Dacia": "dacia"
    },
    {
        ", was located close to Hunedoara and was supplied by the iron produced here. The remains of eight ": null
    },
    {
        "Dacia": "dacia"
    },
    {
        "n iron furnaces have been found at the Sânpetru hill near the castle. The discovery of important monetary treasures of Dacian coins and Roman imperial coins testifies to the importance of the site.     After Dacia was conquered around 42 AD and turned into a Roman province, the iron-rich region attracted the attention of the Romans, who began to exploit it by building furnaces. A Villa Rustica emerged in Teliuc, a Roman fortification on Sanpetru hill, outpost of the famous ": null
    },
    {
        "legio XIII Gemina": "roman legion"
    },
    {
        " whose main ": null
    },
    {
        "castrum": "castrum"
    },
    {
        " was at ": null
    },
    {
        "Apullum": "alba iulia"
    },
    {
        " in Dacia. Other Roman artifacts were discovered in the city area, and also in Pestis, where the remains of a Roman village were discovered. The new capital city of the Roman province of Dacia, ": null
    },
    {
        "Ulpia Traiana Sarmizegetusa": "ulpia traiana sarmizegetusa"
    },
    {
        ", was also situated in the proximity.     After the Roman military and administrative retreat during the ": null
    },
    {
        "Migration Period": "migration period"
    },
    {
        " the region had no significant historic sites, although it may be possible that the iron activity continued. The ethnic structure of the region changed significantly, most notably with ": null
    },
    {
        "Goths": "goths"
    },
    {
        ", ": null
    },
    {
        "Huns": "huns"
    },
    {
        ", ": null
    },
    {
        "Slavs": "slavs"
    },
    {
        ", ": null
    },
    {
        "Pechenegs": "pechenegs"
    },
    {
        ", ": null
    },
    {
        "Magyars": "magyars"
    },
    {
        " and ": null
    },
    {
        "Cumans": "cumans"
    },
    {
        ".     There is an ongoing scholarly debate over the ethnicity of Transylvanias population before the Hungarian conquest . After 42 as part of ": null
    },
    {
        "Kingdom of Hungary": "kingdom of hungary"
    },
    {
        ", under Slavic influence small political feuds grew . South of the Carpathians the ": null
    },
    {
        "Pechenegs": "pechenegs"
    },
    {
        " and ": null
    },
    {
        "Cumans": "cumans"
    },
    {
        " held political power, and Hunedoara acted as a buffer zone for the Hungarian Crown. In time, the Vlach populations in the mountains nearby developed an original highlander culture. Their land is called Tara Padurenilor and they began to dominate the area demographically. The region also had a sizable population of German ": null
    },
    {
        "Saxons": "saxons"
    },
    {
        ", colonizers brought by the Hungarian Crown after the ": null
    },
    {
        "Mongol Invasion": "mongol invasion"
    },
    {
        " and later, ": null
    },
    {
        "Romani": "romani people"
    },
    {
        " who migrated from the Indian subcontinent.     The first recorded evidence of the city was made in 42 under the name Hungnod as a hub for ": null
    },
    {
        "leather tanning": "leather tanning"
    },
    {
        " and ": null
    },
    {
        "wool processing": "woolprocessing"
    },
    {
        ". The city of Hunedoara became an important iron extracting and processing center in Transylvania. Corpus Inscriptiorum Latinorum refers to a local inhabitant as natas ibi, ubi ferum nascitur , that is, born where the iron was born . As the backbone for the manufacture of weapons and tools, the town industry was vital for the region.     The city has been known since the 42th century mainly as the residence of the ": null
    },
    {
        "Hunyadi": "hunyadi family"
    },
    {
        " family. On October 42 42 ": null
    },
    {
        "Voicu": "voicu"
    },
    {
        " , was rewarded for military bravery by ": null
    },
    {
        "Sigismund of Luxembourg": "sigismund of luxembourg"
    },
    {
        ", and received the domain of Hunedoara.     Voicu was a ": null
    },
    {
        "Wallachia": "wallachia"
    },
    {
        "n, Christian Orthodox faith from the area of todays ": null
    },
    {
        "Argeş County": "argeş county"
    },
    {
        " . In a village called Corbi are the remains of a fortress attributed to Voicu.  The citadels remainings can still be visited today. Information provided based on a compilation of the published articles under the signature of the Mr. Sorin Preda and Horia Turcanu, corroborated with the elements provided by the professor Grigore Constantinescu and the priest Petre Grigorescu, and of the data collected from the Romanian National Archives and from the writings of Mr. Constantin Radulescu-Codin, historian, and of Mrs. Clara Laura Dumitrescu. Voicus father, ": null
    },
    {
        "Şerban": "şerban"
    },
    {
        " migrated into Transylvania from ": null
    },
    {
        "Wallachia": "wallachia"
    },
    {
        ". This is attested by the Medieval writer Thuroczy who said Quod ad genus tuum attinet, te ab ipsis vetustissimis Valachorum principibus originem ducere, patre natus Stephano Olacho, viro praestanti, cujus etiam aliqui tua familia Daciae Transalpinae, quae nunc Valachorum patria est, principes fuerint. He also continues later inter quos Valachi gentiles tui minime postremos habent...  Müncheni Reichsarchív. Brandenburgica. c. CCIX. f. 42, citing: Dr. Karácsonyi János., page 42 Buda, 42 márcziits 42     The same document that recorded Voicus reward for military bravery by ": null
    },
    {
        "Sigismund of Luxembourg": "sigismund of luxembourg"
    },
    {
        " also mentions his three sons: Mogoş, Radu and ": null
    },
    {
        "Ioannus Corvinus": "john hunyadi"
    },
    {
        " . Both names Mogoş  name of Wallah origin, currently a common Romanian name and Radu  name of Wallah origin, currently a common Romanian name. are of Wallah origin, proving the ethnicity of Voicu once more. ": null
    },
    {
        "Ioannus Corvinus": "john hunyadi"
    },
    {
        " spent his childhood here. His mother was a Hungarian princess with ": null
    },
    {
        "Croatian": "croats"
    },
    {
        " origins. He married ": null
    },
    {
        "Erzsébet Szilágyi": "erzsébet szilágyi"
    },
    {
        ", a Hungarian noblewoman. Hunedoara received town privileges in 42 from the King of Hungary. John Hunyadi consolidated the citadel on top of an ancient fortress, creating the two main halls, for Diet and Knights. A ": null
    },
    {
        "Franciscan": "franciscan"
    },
    {
        " abbey was built nearby the castle in 42 and ": null
    },
    {
        "John of Capistrano": "john of capistrano"
    },
    {
        ", a famous Italian monk, was sent by the Pope to organize a crusade against the Turks, and lived in the castle. John of Capistrano became instrumental later in inciting the peasantry to crusade, starting from Frankfurt and marching towards Belgrade.     John Hunyadi was to become one of the heroes of the fight against the encroaching ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ". He fought in the service of ": null
    },
    {
        "Sigismund": "sigismund of luxembourg"
    },
    {
        ", mastering military tactics in the Hussite Wars and the ": null
    },
    {
        "Italian": "italy"
    },
    {
        " republics, and became the most skillful warrior of Hungary. He was elevated and named Voivode of Transylvania, which was at the time an autonomous part of the Kingdom of Hungary. Elected regent of Hungary, he formed a coalition with the principalities of Moldavia and Wallachia and engaged in ": null
    },
    {
        "crusade": "crusade"
    },
    {
        "s against the ": null
    },
    {
        "Turks": "ottoman empire"
    },
    {
        " to free Serbia and Bulgaria. The crusade, for a brief period, united the diverging forces of the Balkans, and the victories gained in battles managed to secure the Kingdom of Hungary from Ottoman occupation for over a century. Although he died in a military camp, his son Mátyás  later became the most famous of Hungarian kings. Pope ": null
    },
    {
        "Aeneas Sylvius Piccolomini ": "pope pius ii"
    },
    {
        " called him ": null
    },
    {
        "Athleta Christi": "athleta christi"
    },
    {
        " and The White Knight of Wallachia,  ": null
    },
    {
        "Neagu Djuvara": "neagu djuvara"
    },
    {
        " believes le cavaler Blanche was actually a mistake on part of foreign French authors when they copied the word Blache also writing  the Hungarians being occupied in the wars with the Turks under the leadership of Hunyadi, remained more as winners than as losers. This man was a Dacian and not of noble birth, but well learned in weapons, and was the first to show the Hungarians that the Turks could be defeated. . Statues of John Hunyadi can be found in Hunedoara and various other locations in Romania and Hungary.     In 42 Matthias gave permission to the Wallachian serfs to build an orthodox church, beautifully decorated with paintings and preserved until today. He continued to consolidate the castle and the feudal domain of Hunedoara. The castle of Hunedoara became one of the biggest in the medieval world, standing as a witness to the greatness of his family of noble warriors and statesmen, in an era of war and despair for the region, as the Ottoman Empire approached Central Europe. In the times of Hunyadi rule, Hunedoara became a market for iron. Matthias Corvinus named the city a tax-free area, and this privilege lasted until the 42th century. The population varied between 42 people in 42 and 42 people in the 42th century. After Matthias died, Hunedoara passed to his son, ": null
    },
    {
        "John": "jános corvinus"
    },
    {
        " , but he too died young. His wife, Beatrice de Frangepan, married ": null
    },
    {
        "Georg of Hohenzollern": "georg of hohenzollern"
    },
    {
        ", Marquis of Brandenburg in 42 But Georg de Brandenburg would not reside in Hunedoara, instead appointed a representative, György Stolcz.      In 42 during the peasant revolt of ": null
    },
    {
        "György Dózsa": "györgy dózsa"
    },
    {
        ", some were imprisoned in the castle and probably tortured. The town numbered 42 houses, a considerable size for the time, and was ruled by an appointed ": null
    },
    {
        "Orthodox": "eastern orthodox church"
    },
    {
        " priest. In 42 a fire destroyed 42 houses. In 42 as the Kingdom of Hungary was conquered by the Ottoman Turks, the castle was besieged during the rebellion of ": null
    },
    {
        "Czibak Imre": "czibak imre"
    },
    {
        ", the bishop of ": null
    },
    {
        "Oradea": "oradea"
    },
    {
        " and two years later John Zápolya donated the castle along with other possessions to ": null
    },
    {
        "Török Bálint": "török bálint"
    },
    {
        " making him the richest nobleman of Hungary. In 42 ": null
    },
    {
        "Török János": "török jános"
    },
    {
        ", a proselytizer of Reformation is mentioned to have killed his unfaithful wife ": null
    },
    {
        "Kendi Anna": "kendi anna"
    },
    {
        " in the castle. In 42 the castle was besieged by the Wallachian army of ": null
    },
    {
        "Michael the Brave": "michael the brave"
    },
    {
        " in his campaign - while ruling Wallachia, Moldavia and Transylvania - against the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", and to switch the Ottoman vassalage to the ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        "s.     The town and the castle survived relatively unharmed by the Counter-Reformation of ": null
    },
    {
        "Giorgio Basta": "giorgio basta"
    },
    {
        ", general of the Habsburg Empire. By 42 ownership of the castle passed to the Bethlen family. ": null
    },
    {
        "Gabriel Bethlen": "gabriel bethlen"
    },
    {
        " Voivode of Transylvania consolidated and enlarged the castle, and gave it to his nephew ": null
    },
    {
        "Stephen Betlen": "stephen betlen"
    },
    {
        " who lived here with his wife ": null
    },
    {
        "Mary Széchy": "mary széchy"
    },
    {
        ", famed for her beauty.     The ": null
    },
    {
        "Reformed Church of Hungary": "reformed church in hungary"
    },
    {
        " was established in Hunedoara in 42 and ": null
    },
    {
        "Imre Thököly": "imre thököly"
    },
    {
        ", one the leaders of the ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " anti-Habsburg uprising and later Prince of Transylvania owned the castle and spent much time living in it. By 42 the castle passed into the possession of ": null
    },
    {
        "Michael Apafi": "michael i apafi"
    },
    {
        ", the pro-Habsburg Prince of Transylvania. In 42 the old church was returned to the Franciscans, and in 42 it reacquired its monastic rank. By this time, the majority of population was Romanian.     Most of current Hunedoara was at that time a lush plain through which the Cerna river was meandering. The first blast furnace was built by 42 followed by another four. The modern iron operations began at the foot of Saint Peter hill , close to the most distant tower of the castle called Nebojša, . The mine shaft can still be viewed. Iron manufactures were also situated nearby.     In 42 there was already a steel mill on the Cerna river producing 42 tons of pig iron and 42 tons of iron by 42 In 42 Georg Steinhilbert made a second one and a third was made in 42 In 42 the operations were handled directly by the Treasury. Of the mills mentioned, one was located under the main bridge and its walls are now in ruins.     The first tall industrial furnace in the world for iron extracting, it has been argued, was built in 42 in ": null
    },
    {
        "Topliţa": "topliţa"
    },
    {
        " near Hunedoara, and ": null
    },
    {
        "a later one": "govăjdia blast furnace"
    },
    {
        " in ": null
    },
    {
        "Govăşdia": "govăşdia"
    },
    {
        " in 42 Both furnaces can be visited today. To reach it by road could only be through ": null
    },
    {
        "Teliucu Inferior": "teliucu inferior"
    },
    {
        " and ": null
    },
    {
        "Teliucu Superior": "teliucu superior"
    },
    {
        " . Until 42 there was a ": null
    },
    {
        "system of narrow-gauge railway": "transylvanian mining railway"
    },
    {
        " built in the 42th and 42th centuries that ran from Hunedoara ": null
    },
    {
        "castle": "castle"
    },
    {
        ", near Zlaşti through a 42 and a 42 meter long ": null
    },
    {
        "tunnel": "tunnel"
    },
    {
        " through the mountain, and the breathtaking landscape of Ţara Pădurenilor before arriving to Govăjdia. It was dismantled and scrapped from Zlaşti to Govăjdia and ": null
    },
    {
        "Crăciuneasa": "crăciuneasa"
    },
    {
        " by the last owner the Talc-Dolomită Zlaşti company. The last remaining  long narrow-gauge rail system from the Hunedoara castle to ": null
    },
    {
        "Zlaşti": "zlaşti"
    },
    {
        " was in use by the ": null
    },
    {
        "Talc-Dolomită Zlaşti": "talc-dolomită zlaşti"
    },
    {
        " company till 42 In the summer of 42 they have removed this last remaining section of this line. There are efforts now for restoring the train line for tourism purposes.     In the 42th and part of the 42th century, as the town of Hunedoara became more and more industrialized, peasants from regions nearby began to move to the city and the population increased. Only the German, Hungarian and Székelys of Transylvania were represented in the Diet . The Romanians who at the time formed about approx. 42% of the population felt exploited and revolted on several occasions. The peasants of Hunedoara county supported the ": null
    },
    {
        "Revolt of Horea, Cloşca and Crişan": "revolt of horea, cloşca and crişan"
    },
    {
        " in 42 when they unsuccessfully besieged the nearby fortress of Deva.     The castle in Hunedoara gave refuge to the local nobility, and it was its last function as military defense. Later representatives from the region were sent to the Romanian national assemblies held in Blaj during the ": null
    },
    {
        "42 Revolution": "1848 revolution"
    },
    {
        " where Romanians decided to demand equal rights and resist the attempt of Hungary of gaining independence from the Habsburg House. This started a small scale insurrection across Transylvania that was quickly quieted by the Hungarian army, except for the ": null
    },
    {
        "Apuseni Mountains": "apuseni mountains"
    },
    {
        ", on the north of Hunedoara, where the tribune ": null
    },
    {
        "Avram Iancu": "avram iancu"
    },
    {
        " struggled to keep the Hungarian forces away from controlling the gold mines. The subsequent failures of the later Austro-Hungarian monarchy to fulfill to the demands of the Romanians together with the ": null
    },
    {
        "Magyarization": "magyarization"
    },
    {
        " campaigns further exacerbated and alienated the Romanian population of Hunedoara.     During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " the Romanians from Hunedoara county actively supported the Romanian Army and the Romanian National Assembly declared the ": null
    },
    {
        "Union of Transylvania with Romania": "union of transylvania with romania"
    },
    {
        " in 42 After the ending of the war Transylvania became part of Romania. The Romanian populations in and around the city quickly earned political rights and representation, and industrial development continued at an ever-increasing rate.     During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " the steel works were part of the war effort for the Axis. The Romanian Army lost 42 soldiers on the Eastern Front and the Allies, an additional 42 soldiers fighting against the Axis.     After the Soviet occupation and the subsequent communist regime, industry was favored, and Hunedoara had for a time the biggest steel-producing plant in Romania and the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ". The city grew larger, and the factories extended so much that they equaled or exceeded the size of the city. The population also increased to over 42. The football team, Corvinul Hunedoara, was for a very long time one of the highest-rated football teams in Romania, rivaling ": null
    },
    {
        "Steaua": "fc steaua bucureşti"
    },
    {
        " or ": null
    },
    {
        "Dinamo": "fc dinamo bucureşti"
    },
    {
        ". A large stadium was built along with other sports facilities such as covered swimming pools and a skating ring. Besides the Corvinul sports club, two other sport clubs were constructed, Constructorul and Siderurgistul, each offering different sport facilities. Other notable constructions included a theater house, several large cinemas, many schools and high-schools and an engineering faculty.          The ": null
    },
    {
        "communist collapse": "romanian revolution of 1989"
    },
    {
        " meant that the old markets for steel vanished, and many enterprises had to be closed or abandoned. However, investment from Romanian and foreign capital ventures started offering new job opportunities for the people. Currently ": null
    },
    {
        "Arcelor-Mittal": "arcelor mittal"
    },
    {
        " runs what is left of the steel works. The steel mill now operates the No. 42 Electric Steel Mill, Continuous Caster and the rolling mills. Production is scheduled to rise above 42 tons of steel in 42 and beyond. The rest of the production facilities have been demolished or have been sold to private investors.            Before modern times, the ethnic balance of Hunedoara was more diverse, as was the case elsewhere in the region. During the rise of nationalism in the region the Romanians already had a solid majority and there was little of the ethnic friction that were to be found elsewhere in Transylvania .     The 42 census registered 42 residents, consisting of 42 Romanians, 42 Hungarians, 42 Germans, 42 Slovaks and 42 Roma. The religious denominations included 42 Orthodox, 42 Greek Catholics, 42 Roman Catholics, 42 Reformed, 42 Evangelic and 42 Jews. The 42 census registered 42 residents, consisting of 42 Romanians, 42 Hungarians, 42 Germans, and 42 Slovaks.     The number of Hungarians dwindled after the ": null
    },
    {
        "Treaty of Trianon": "treaty of trianon"
    },
    {
        " of 42 when Transylvania became part of ": null
    },
    {
        "Romania": "kingdom of romania"
    },
    {
        " and the fall of Communism in December 42 saw most German families leaving the town and the country to ": null
    },
    {
        "Germany": "germany"
    },
    {
        ".     During the Communist era, as the Steel Works were functioning the population peaked at 42, as workers moved in from the surrounding countryside as well as Oltenia and Moldova. In the transition era that followed the fall of communism, a large percentage of the Romanian population lost their jobs and many left the town in search for better opportunities elsewhere. According to the last census, from 42 there were 42 people living within the city of Hunedoara,  making it the 42nd largest city in Romania. The ethnic makeup is as follows:   ": null
    },
    {
        "Romanians": "romanians"
    },
    {
        ": 42%   ": null
    },
    {
        "Hungarians": "hungarians"
    },
    {
        ": 42%   ": null
    },
    {
        "Roma": "romani people"
    },
    {
        ": 42%   Other: 42%              The Castle is known both by the name Corvins Castle and ": null
    },
    {
        "Hunyadi Castle": "castle of vajdahunyad"
    },
    {
        " . Hunyadi is more internationally recognized name for the same family, Corvins being used mostly by Romanians.     The impressive size and architectural beauty sets it among the most impressive monuments of medieval art, with subsequent developments added ": null
    },
    {
        "Gothic": "gothic style"
    },
    {
        " and then ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " and ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        ". The building lies on a rock around which flows the ": null
    },
    {
        "Zlaști River": "zlaști river"
    },
    {
        ". It has an impressive draw bridge, countless towers, a number of interior courts, and two large halls, Knight Hall and Diet Hall , as it housed the ": null
    },
    {
        "Diet of Transylvania": "transylvanian diet"
    },
    {
        " for a short period.     The castle history is mostly related to the Hunyadi family, being the place where ": null
    },
    {
        "John Hunyadi": "john hunyadi"
    },
    {
        " spent his childhood. Today the castle is being cared for by the municipality, as there are no recorded descendants of the Hunyadi that could pledge for it. ": null
    },
    {
        "Vlad Dracul": "vlad ii dracul"
    },
    {
        ", the ruler of Wallachia, the father of the notorious ": null
    },
    {
        "Vlad Dracula": "vlad the impaler"
    },
    {
        ", was imprisoned here, as he had fallen into disgrace with Hunyadi, not providing the help promised . The castle and surroundings are often used by international film companies for the production of movies about medieval times.            Unfortunately the Iron Museum no longer exists.         Standing on a hill near Hunedoara, is a spot to get a view of the city.         Located near the forest of Chizid, the zoo houses, among other animals, lions, bears, and wolves.         Built in the 4242 to supply industrial water for the steel mill in Hunedoara on the Cerna river, it covers the remains of five villages: Cinciş Cerna, Valea Ploştii, Banea Lui Crai, Moara Ungurului, Ciuleni. Before flooding the area, the villages were relocated uphill from the lake. The remains of the villages are still under water: foundations, walls of houses, churches wells, etc. Today the lake developed into a small resort for Romanian and foreign tourists.         Vast and easily accessible by foot or by car, the mountains are inhabited by an ancient population of Romanians, called pǎdureni . They have retained their culture and a sense of identity, and hold a number of festivals annually. The Romans mined marble in the nearby quarry.         The caves contain cultural artefacts and burial grounds of ": null
    },
    {
        "Neanderthals": "neanderthals"
    },
    {
        ". As of February 42 they are closed to the public.                  The natural reservation contains fossilized snails and fish.         Hunedoara boasts one of Europes most modern bowling alleys, that hosted the 42 Bowling World Cup. Other sports facilities include red-clay tennis courts and an indoor swimming pool. Some of the notable athletes originating from Hunedoara include ": null
    },
    {
        "Mihai Leu": "mihai leu"
    },
    {
        ", former WBO boxing world champion and national rally champion, ": null
    },
    {
        "Michael Klein ": "michael klein"
    },
    {
        ", as well as ": null
    },
    {
        "Maria Cioncan": "maria cioncan"
    },
    {
        ", Olympic bronze-medal winner and ": null
    },
    {
        "Bogdan Lobonț": "bogdan lobonț"
    }
]