[
    {
        "              The Huns were a ": null
    },
    {
        "nomadic people": "nomadic people"
    },
    {
        " who lived in ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        ", the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        ", and ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        ", between the 4th and 6th century AD. According to European tradition, they were first reported living east of the ": null
    },
    {
        "Volga River": "volga river"
    },
    {
        ", in an area that was part of ": null
    },
    {
        "Scythia": "scythia"
    },
    {
        " at the time; the Huns arrival is associated with the migration westward of an ": null
    },
    {
        "Iranian people": "iranian peoples"
    },
    {
        ", the ": null
    },
    {
        "Alans": "alans"
    },
    {
        ". By 370 AD, the Huns had arrived on the Volga, and by 430 the Huns had established a vast, if short-lived, dominion in Europe, conquering the ": null
    },
    {
        "Goths": "goths"
    },
    {
        " and many other ": null
    },
    {
        "Germanic peoples": "germanic peoples"
    },
    {
        " living outside of ": null
    },
    {
        "Roman borders": "borders of the roman empire"
    },
    {
        ", and causing many others to flee into Roman territory. The Huns, especially under their King ": null
    },
    {
        "Attila": "attila"
    },
    {
        ", made frequent and devastating raids into the ": null
    },
    {
        "Eastern Roman Empire": "eastern roman empire"
    },
    {
        ". In 451, the Huns invaded the ": null
    },
    {
        "Western Roman": "western roman empire"
    },
    {
        " province of ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        ", where they fought a combined army of Romans and ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " at the ": null
    },
    {
        "Battle of the Catalaunian Fields": "battle of the catalaunian fields"
    },
    {
        ", and in 452 they invaded ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". After Attilas death in 453, the Huns ceased to be a major threat to Rome and lost much of their empire following the ": null
    },
    {
        "Battle of Nedao": "battle of nedao"
    },
    {
        " . Descendants of the Huns, or successors with similar names, are recorded by neighbouring populations to the south, east, and west as having occupied parts of ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        " and Central Asia from about the 4th to 6th centuries. Variants of the Hun name are recorded in the Caucasus until the early 8th century.     In the 18th century, the French scholar ": null
    },
    {
        "Joseph de Guignes": "joseph de guignes"
    },
    {
        " became the first to propose a link between the Huns and the ": null
    },
    {
        "Xiongnu": "xiongnu"
    },
    {
        " people, who were northern neighbours of ": null
    },
    {
        "China": "china"
    },
    {
        " in the 3rd century BC. Since Guignes time, considerable scholarly effort has been devoted to investigating such a connection. The issue remains controversial. Their relationships to other peoples known collectively as the ": null
    },
    {
        "Iranian Huns": "iranian huns"
    },
    {
        " are also disputed.     Very little is known about Hunnic culture and very few archaeological remains have been conclusively associated with the Huns. They are believed to have used bronze cauldrons and to have performed ": null
    },
    {
        "artificial cranial deformation": "artificial cranial deformation"
    },
    {
        ". No description exists of the Hunnic religion of the time of Attila, but practices such as ": null
    },
    {
        "divination": "divination"
    },
    {
        " are attested, and the existence of ": null
    },
    {
        "shamans": "shamanism"
    },
    {
        " likely. It is also known that the Huns had a ": null
    },
    {
        "language of their own": "hunnic language"
    },
    {
        ", however only three words and personal names attest to it. Economically, they are known to have practiced a form of ": null
    },
    {
        "nomadic pastoralism": "nomadic pastoralism"
    },
    {
        "; as their contact with the Roman world grew, their economy became increasingly tied with Rome through tribute, raiding, and trade. They do not seem to have had a unified government when they entered Europe, but rather to have developed a unified tribal leadership in the course of their wars with the Romans. The Huns ruled over a variety of peoples who spoke various languages and some of whom maintained their own rulers. Their main military technique was ": null
    },
    {
        "mounted archery": "mounted archery"
    },
    {
        ".     The Huns may have stimulated the ": null
    },
    {
        "Great Migration": "migration period"
    },
    {
        ", a contributing factor in the collapse of the ": null
    },
    {
        "Western Roman Empire": "western roman empire"
    },
    {
        ". The memory of the Huns also lived on in various Christian ": null
    },
    {
        "saints lives": "hagiography"
    },
    {
        ", where the Huns play the roles of antagonists, as well as in Germanic heroic legend, where the Huns are variously antagonists or allies to the Germanic main figures. In Hungary, a legend developed based on medieval chronicles that the ": null
    },
    {
        "Hungarians": "hungarians"
    },
    {
        ", and the ": null
    },
    {
        "Székely": "székely"
    },
    {
        " ethnic group in particular, are descended from the Huns. However, mainstream scholarship dismisses a close connection between the Hungarians and Huns. Modern culture generally associates the Huns with extreme cruelty and barbarism.          The origins of the Huns and their links to other steppe people remain uncertain: scholars generally agree that they originated in Central Asia but disagree on the specifics of their origins. Classical sources assert that they appeared in Europe suddenly around 370. Most typically, Roman writers attempts to elucidate the origins of the Huns simply equated them with earlier steppe peoples. Roman writers also repeated a tale that the Huns had entered the domain of the Goths while they were pursuing a wild stag, or else one of their cows that had gotten loose, across the ": null
    },
    {
        "Kerch Strait": "kerch strait"
    },
    {
        " into ": null
    },
    {
        "Crimea": "crimea"
    },
    {
        ". Discovering the land good, they then attacked the Goths. Jordanes Getica relates that the Goths held the Huns to be offspring of unclean spirits Getica 24:121 and Gothic witches.             Since ": null
    },
    {
        "Joseph de Guignes": "joseph de guignes"
    },
    {
        " in the , modern historians have associated the Huns who appeared on the borders of Europe in the  with the ": null
    },
    {
        "Xiongnu": "xiongnu"
    },
    {
        " who had invaded China from the territory of present-day ": null
    },
    {
        "Mongolia": "mongolia"
    },
    {
        " between the  and the . Due to the ": null
    },
    {
        "devastating defeat by the Chinese Han dynasty": "han–xiongnu war"
    },
    {
        ", the northern branch of the Xiongnu had retreated north-westward; their descendants may have migrated through ": null
    },
    {
        "Eurasia": "eurasia"
    },
    {
        " and consequently they may have some degree of cultural and genetic continuity with the Huns. Scholars also discussed the relationship between the Xiongnu, the Huns, and a number of people in central Asia who were also known as or came to be identified with the name Hun or ": null
    },
    {
        "Iranian Huns": "iranian huns"
    },
    {
        " . The most prominent of these were ": null
    },
    {
        "Chionites": "chionites"
    },
    {
        ", the ": null
    },
    {
        "Kidarites": "kidarites"
    },
    {
        ", and the ": null
    },
    {
        "Hephthalites": "hephthalites"
    },
    {
        " .     ": null
    },
    {
        "Otto J. Maenchen-Helfen": "otto j. maenchen-helfen"
    },
    {
        " was the first to challenge the traditional approach, based primarily on the study of written sources, and to emphasize the importance of archaeological research. Since Maenchen-Helfens work, the identification of the Xiongnu as the Huns ancestors has become controversial. Additionally, several scholars have questioned the identification of the Iranian Huns with the European Huns. Walter Pohl cautions that   none of the great confederations of steppe warriors was ethnically homogenous, and the same name was used by different groups for reasons of prestige, or by outsiders to describe their lifestyle or geographic origin. It is therefore futile to speculate about identity or blood relationships between Hiung-nu, Hephthalites, and Attilas Huns, for instance. All we can safely say is that the name Huns, in late antiquity, described prestigious ruling groups of steppe warriors.     Recent scholarship, particularly by Hyun Jin Kim and Etienne de la Vaissière, has revived the hypothesis that the Huns and the Xiongnu are one and the same. De la Vaissière argues that ancient Chinese and Indian sources used Xiongnu and Hun to translate each other, and that the various Iranian Huns were similarly identified with the Xiongnu. Kim believes that the term Hun was not primarily an ethnic group, but a political category  and argues for a fundamental political and cultural continuity between the Xiongnu and the European Huns, as well as between the Xiongnu and the Iranian Huns .       The name Hun is attested in classical European sources as Greek Οὖννοι  and Latin Hunni or Chuni. ": null
    },
    {
        "John Malalas": "john malalas"
    },
    {
        " records their name as Οὖννα . Another possible Greek variant may be Χοὖνοι , although this groups identification with the Huns is disputed. Classical sources also frequently use the names of older and unrelated steppe nomads instead of the name Hun, calling them ": null
    },
    {
        "Massagetae": "massagetae"
    },
    {
        ", ": null
    },
    {
        "Scythians": "scythians"
    },
    {
        " and ": null
    },
    {
        "Cimmerians": "cimmerians"
    },
    {
        ", among other names.     The etymology of Hun is unclear. Various proposed etymologies generally assume at least that the names of the various Eurasian groups known as Huns are related. There have been a number of proposed ": null
    },
    {
        "Turkic": "turkic languages"
    },
    {
        " etymologies, deriving the name variously from Turkic ön, öna , qun , kün, gün, a plural suffix supposedly meaning people , qun , and hün . Otto Maenchen-Helfen dismisses all of these Turkic etymologies as mere guesses . Maenchen-Helfen himself proposes an ": null
    },
    {
        "Iranian": "iranian languages"
    },
    {
        " etymology, from a word akin to ": null
    },
    {
        "Avestan": "avestan"
    },
    {
        " hūnarā , hūnaravant- , and suggests that it may originally have designated a rank rather than an ethnicity. Robert Werner has suggested an etymology from ": null
    },
    {
        "Tocharian": "tocharian languages"
    },
    {
        " ku , suggesting based on the fact that the Chinese called the Xiongnu dogs that the dog was the ": null
    },
    {
        "totem": "totem"
    },
    {
        " animal of the Hunnic tribe. He also compares the name Massagetae, noting that the element saka in that name means dog. Others such as Harold Bailey, S. Parlato, and Jamsheed Choksy have argued that the name derives from an Iranian word akin to Avestan Ẋyaona, and was a generalized term meaning hostiles, opponents . Christopher Atwood dismisses this possibility on phonological and chronological grounds. While not arriving at an etymology per se, Atwood derives the name from the ": null
    },
    {
        "Ongi River": "ongi river"
    },
    {
        " in ": null
    },
    {
        "Mongolia": "mongolia"
    },
    {
        ", which was pronounced the same or similar to the name Xiongnu, and suggests that it was originally a dynastic name rather than an ethnic name.       Ancient descriptions of the Huns are uniform in stressing their strange appearance from a Roman perspective. These descriptions typically caricature the Huns as monsters. Jordanes stressed that the Huns were short of stature and had tanned skin. Various writers mention that the Huns had small eyes and flat noses. The Roman writer Priscus gives the following eyewitness description of Attila: Short of stature, with a broad chest and a large head; his eyes were small, his beard thin and sprinkled with grey; and he had a flat nose and tanned skin, showing evidence of his origin.      Many scholars take these to be unflattering depictions of East Asian  racial characteristics. Maenchen-Helfen argues that, while many Huns had East Asian racial characteristics, they were unlikely to have looked as Asiatic as the ": null
    },
    {
        "Yakut": "yakuts"
    },
    {
        " or ": null
    },
    {
        "Tungus": "tungus"
    },
    {
        ". He notes that archaeological finds of presumed Huns suggest that they were a racially mixed group containing only some individuals with East Asian features. Kim similarly cautions against seeing the Huns as a homogenous racial group, while still arguing that they were partially or predominantly of Mongoloid extraction .  Some archaeologists have argued that archaeological finds have failed to prove that the Huns had any Mongoloid features at all, and some scholars have argued that the Huns were predominantly ": null
    },
    {
        "Caucasian": "caucasian race"
    },
    {
        " in appearance. Other archaeologists have argued that Mongoloid features are found primarily among members of the Hunnic aristocracy, which, however, also included Germanic leaders who were integrated into the Hun polity. Kim argues that the composition of the Huns became progressively more Caucasian during their time in Europe; he notes that by the Battle of Chalons , the vast majority of Attilas entourage and troops appears to have been of European origin, while Attila himself seems to have had East Asian features.                   The Romans became aware of the Huns when the latters invasion of the ": null
    },
    {
        "Pontic steppes": "pontic steppes"
    },
    {
        " forced thousands of Goths to move to the Lower Danube to seek refuge in the Roman Empire in 376. The Huns conquered the ": null
    },
    {
        "Alans": "alans"
    },
    {
        ", most of the ": null
    },
    {
        "Greuthungi": "greuthungi"
    },
    {
        " or Western Goths, and then most of the ": null
    },
    {
        "Thervingi": "thervingi"
    },
    {
        " or Eastern Goths, with many fleeing into the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ". In 395 the Huns began their first large-scale attack on the Eastern Roman Empire. Huns attacked in Thrace, overran ": null
    },
    {
        "Armenia": "armenia"
    },
    {
        ", and pillaged ": null
    },
    {
        "Cappadocia": "cappadocia"
    },
    {
        ". They entered parts of ": null
    },
    {
        "Syria": "syria"
    },
    {
        ", threatened ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        ", and passed through the province of ": null
    },
    {
        "Euphratesia": "euphratesia"
    },
    {
        ". At the same time, the Huns invaded the ": null
    },
    {
        "Sasanian Empire": "sasanian empire"
    },
    {
        ". This invasion was initially successful, coming close to the capital of the empire at ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        "; however, they were defeated badly during the ": null
    },
    {
        "Persian": "persian empire"
    },
    {
        " counterattack.     During their brief diversion from the ": null
    },
    {
        "Eastern Roman": "eastern roman"
    },
    {
        " Empire, the Huns may have threatened tribes further west. ": null
    },
    {
        "Uldin": "uldin"
    },
    {
        ", the first Hun identified by name in contemporary sources, headed a group of Huns and Alans fighting against Radagaisus in defense of Italy. Uldin was also known for defeating Gothic rebels giving trouble to the East Romans around the Danube and beheading the Goth ": null
    },
    {
        "Gainas": "gainas"
    },
    {
        " around 400–401. The East Romans began to feel the pressure from Uldins Huns again in 408. Uldin crossed the Danube and pillaged Thrace. The East Romans tried to buy Uldin off, but his sum was too high so they instead bought off Uldins subordinates. This resulted in many desertions from Uldins group of Huns. Uldin himself escaped back across the Danube, after which he is not mentioned again.     Hunnish mercenaries are mentioned on several occasions being employed by the East and West Romans, as well as the Goths, during the late 4th and 5th century. In 433 some parts of ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        " were ceded to them by ": null
    },
    {
        "Flavius Aetius": "flavius aetius"
    },
    {
        ", the ": null
    },
    {
        "magister militum": "magister militum"
    },
    {
        " of the ": null
    },
    {
        "Western Roman Empire": "western roman empire"
    },
    {
        ".              From 434 the brothers ": null
    },
    {
        "Attila": "attila"
    },
    {
        " and ": null
    },
    {
        "Bleda": "bleda"
    },
    {
        " ruled the Huns together. Attila and Bleda were as ambitious as their uncle ": null
    },
    {
        "Rugila": "rugila"
    },
    {
        ". In 435 they forced the Eastern Roman Empire to sign the ": null
    },
    {
        "Treaty of Margus": "treaty of margus"
    },
    {
        ", giving the Huns trade rights and an annual tribute from the Romans. When the Romans breached the treaty in 440, Attila and Bleda attacked Castra Constantias, a Roman fortress and marketplace on the banks of the ": null
    },
    {
        "Danube": "danube"
    },
    {
        ". War broke out between the Huns and Romans, and the Huns overcame a weak ": null
    },
    {
        "Roman army": "roman army"
    },
    {
        " to raze the cities of Margus, ": null
    },
    {
        "Singidunum": "singidunum"
    },
    {
        " and ": null
    },
    {
        "Viminacium": "viminacium"
    },
    {
        ". Although a truce was concluded in 441, two years later ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " again failed to deliver the tribute and war resumed. In the following campaign, Hun armies approached Constantinople and sacked several cities before defeating the Romans at the ": null
    },
    {
        "Battle of Chersonesus": "gallipoli"
    },
    {
        ". The Eastern Roman Emperor ": null
    },
    {
        "Theodosius II": "theodosius ii"
    },
    {
        " gave in to Hun demands and in autumn 443 signed the ": null
    },
    {
        "Peace of Anatolius": "peace of anatolius"
    },
    {
        " with the two Hun kings. Bleda died in 445, and Attila became the sole ruler of the Huns.     In 447, Attila invaded the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and Thrace. The war came to an end in 449 with an agreement in which the Romans agreed to pay Attila an annual tribute of 2100 pounds of gold. Throughout their raids on the Eastern Roman Empire, the Huns had maintained good relations with the Western Empire. However, ": null
    },
    {
        "Honoria": "honoria"
    },
    {
        ", sister of the Western Roman Emperor ": null
    },
    {
        "Valentinian III": "valentinian iii"
    },
    {
        ", sent Attila a ring and requested his help to escape her betrothal to a senator. Attila claimed her as his bride and half the ": null
    },
    {
        "Western Roman Empire": "western roman empire"
    },
    {
        " as dowry. Additionally, a dispute arose about the rightful heir to a king of the ": null
    },
    {
        "Salian Franks": "salian franks"
    },
    {
        ". In 451, Attilas forces entered ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        ". Once in Gaul, the Huns first attacked ": null
    },
    {
        "Metz": "metz"
    },
    {
        ", then his armies continued westwards, passing both Paris and ": null
    },
    {
        "Troyes": "troyes"
    },
    {
        " to lay siege to ": null
    },
    {
        "Orléans": "orléans"
    },
    {
        ". ": null
    },
    {
        "Flavius Aetius": "flavius aetius"
    },
    {
        " was given the duty of relieving Orléans by Emperor Valentinian III. A combined army of Roman and ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        " then defeated the Huns at the ": null
    },
    {
        "Battle of the Catalaunian Plains": "battle of the catalaunian plains"
    },
    {
        ".          The following year, Attila renewed his claims to Honoria and territory in the Western Roman Empire. Leading his army across the Alps and into Northern Italy, he sacked and razed a number of cities. Hoping to avoid the sack of Rome, Emperor Valentinian III sent three envoys, the high civilian officers Gennadius Avienus and Trigetius, as well as ": null
    },
    {
        "Pope Leo I": "pope leo i"
    },
    {
        ", who met Attila at ": null
    },
    {
        "Mincio": "mincio"
    },
    {
        " in the vicinity of ": null
    },
    {
        "Mantua": "mantua"
    },
    {
        ", and obtained from him the promise that he would withdraw from Italy and negotiate peace with the emperor. The new Eastern Roman Emperor ": null
    },
    {
        "Marcian": "marcian"
    },
    {
        " then halted tribute payments, resulting in Attila planning to attack Constantinople. However, in 453 he died of a haemorrhage on his wedding night.       After Attilas death in 453, the Hunnic Empire faced an internal power struggle between its vassalized Germanic peoples and the Hunnic ruling body. Led by ": null
    },
    {
        "Ellak": "ellac"
    },
    {
        ", Attilas favored son and ruler of the ": null
    },
    {
        "Akatziri": "akatziri"
    },
    {
        ", the Huns engaged the ": null
    },
    {
        "Gepid": "gepids"
    },
    {
        " king ": null
    },
    {
        "Ardaric": "ardaric"
    },
    {
        " at the ": null
    },
    {
        "Battle of Nedao": "battle of nedao"
    },
    {
        ", who led a coalition of Germanic Peoples to overthrow Hunnic imperial authority. The ": null
    },
    {
        "Amali": "amali dynasty"
    },
    {
        " Goths would revolt the same year under ": null
    },
    {
        "Valamir": "valamir"
    },
    {
        ", allegedly defeating the Huns in a separate engagement. However, this did not result in the complete collapse of Hunnic power in the Carpathian region, but did result in the loss of many of their Germanic vassals. At the same time, the Huns were also dealing with the arrival of more ": null
    },
    {
        "Oghur": "oghur"
    },
    {
        " Turkic-speaking": "turkic languages"
    },
    {
        " peoples from the East, including the ": null
    },
    {
        "Oghurs": "oghur"
    },
    {
        ", ": null
    },
    {
        "Saragurs": "saragurs"
    },
    {
        ", ": null
    },
    {
        "Onogurs": "onogurs"
    },
    {
        ", and the ": null
    },
    {
        "Sabirs": "sabirs"
    },
    {
        ". In 463, the Saragurs defeated the Akatziri, or Akatir Huns, and asserted dominance in the Pontic region.     The western Huns under ": null
    },
    {
        "Dengizich": "dengizich"
    },
    {
        " experienced difficulties in 461, when they were defeated by Valamir in a war against the ": null
    },
    {
        "Sadages": "sadages"
    },
    {
        ", a people allied with the Huns. His campaigning was also met with dissatisfaction from ": null
    },
    {
        "Ernak": "ernak"
    },
    {
        ", ruler of the Akatziri Huns, who wanted to focus on the incoming Oghur speaking peoples. Dengzich attacked the Romans in 467, without the assistance of Ernak. He was surrounded by the Romans and besieged, and came to an agreement that they would surrender if they were given land and his starving forces given food. During the negotiations, a Hun in service of the Romans named Chelchel persuaded the enemy Goths to attack their Hun overlords. The Romans, under their General ": null
    },
    {
        "Aspar": "aspar"
    },
    {
        " and with the help of his ": null
    },
    {
        "bucellarii": "bucellarii"
    },
    {
        ", then attacked the quarreling Goths and Huns, defeating them. In 469, Dengizich was defeated and killed in Thrace.     After Dengizichs death, the Huns seem to have been absorbed by other ethnic groups such as the ": null
    },
    {
        "Bulgars": "bulgars"
    },
    {
        ". Kim, however, argues that the Huns continued under Ernak, becoming the ": null
    },
    {
        "Kutrigur": "kutrigurs"
    },
    {
        " and ": null
    },
    {
        "Utigur": "utigurs"
    },
    {
        " Hunno-": null
    },
    {
        "Bulgars": "bulgars"
    },
    {
        ". This conclusion is still subject to some controversy. Some scholars also argue that another group identified in ancient sources as Huns, the ": null
    },
    {
        "North Caucasian Huns": "north caucasian huns"
    },
    {
        ", were genuine Huns. The rulers of various post-Hunnic steppe peoples are known to have claimed descent from Attila in order to legitimize their right to the power, and various steppe peoples were also called Huns by Western and Byzantine sources from the fourth century onward.           The Huns have traditionally been described as ": null
    },
    {
        "pastoral nomads": "nomadpastoralism"
    },
    {
        ", living off of herding and moving from pasture to pasture to graze their animals. Hyun Jin Kim, however, holds the term nomad to be misleading:   e term nomad, if it denotes a wandering group of people with no clear sense of territory, cannot be applied wholesale to the Huns. All the so-called nomads of Eurasian steppe history were peoples whose territory/territories were usually clearly defined, who as pastoralists moved about in search of pasture, but within a fixed territorial space.   Maenchen-Helfen notes that pastoral nomads typically alternate between summer pastures and winter quarters: while the pastures may vary, the winter quarters always remained the same. This is, in fact, what Jordanes writes of the Hunnic Altziagiri tribe: they pastured near ": null
    },
    {
        "Cherson": "chersonesus"
    },
    {
        " on the ": null
    },
    {
        "Crimea": "crimea"
    },
    {
        " and then wintered further north, with Maenchen-Helfen holding the ": null
    },
    {
        "Syvash": "syvash"
    },
    {
        " as a likely location. Ancient sources mention that the Huns herds consisted of various animals, including cattle, horses, and goats; sheep, though unmentioned in ancient sources, are more essential to the steppe nomad even than horses  and must have been a large part of their herds. Additionally, Maenchen-Helfen argues that the Huns may have kept small herds of ": null
    },
    {
        "Bactrian camels": "bactrian camel"
    },
    {
        "in the part of their territory in modern Romania and Ukraine, something attested for the Sarmatians.     Ammianus says that the majority of the Huns diet came from the meat of these animals, Ammianus 31.2.3 with Maenchen-Helfen arguing, on the basis of what is known of other steppe nomads, that they likely mostly ate mutton, along with sheeps cheese and milk. They also certainly ate horse meat, drank mares milk, and likely made cheese and ": null
    },
    {
        "kumis": "kumis"
    },
    {
        ". In times of starvation, they may have boiled their horses blood for food.     Ancient sources uniformly deny that the Huns practiced any sort of agriculture. Thompson, taking these accounts at their word, argues that thout the assistance of the settled agricultural population at the edge of the steppe they could not have survived . He argues that the Huns were forced to supplement their diet by hunting and gathering. Maenchen-Helfen, however, notes that archaeological finds indicate that various steppe nomad populations did grow grain; in particular, he identifies a find at Kunya Uaz in ": null
    },
    {
        "Khwarezm": "khwarezm"
    },
    {
        " on the ": null
    },
    {
        "Ob River": "ob river"
    },
    {
        " of agriculture among a people who practiced artificial cranial deformation as evidence of Hunnic agriculture. Kim similarly argues that all steppe empires have possessed both pastoralist and sedentary populations, classifying the Huns as agro-pastoralist .          As a nomadic people, the Huns spent a great deal of time riding horses: Ammianus claimed that the Huns are almost glued to their horses , Ammianus 31.2.6  Zosimus claimed that they live and sleep on their horses , and Sidonius claimed that arce had an infant learnt to stand without his mothers aid when a horse takes him on his back . They appear to have spent so much time riding that they walked clumsily, something observed in other nomadic groups. Roman sources characterize the Hunnic horses as ugly. It is not possible to determine the exact breed of horse the Huns used, despite relatively good Roman descriptions. Sinor believes that it was likely a breed of Mongolian pony. However, horse remains are absent from all identified Hun burials. Based on anthropological descriptions and archaeological finds of other nomadic horses, Maenchen-Helfen believes that they rode mostly ": null
    },
    {
        "geldings": "geldings"
    },
    {
        ".     Besides horses, ancient sources mention that the Huns used wagons for transportation, which Maenchen-Helfen believes were primarily used to transport their tents, booty, and the old people, women, and children.       The Huns received a large amount of gold from the Romans, either in exchange for fighting for them as mercenaries or as tribute. Raiding and looting also furnished the Huns with gold and other valuables. Denis Sinor has argued that at the time of Attila, the Hunnic economy became almost entirely dependent on plunder and tribute from the Roman provinces.          Civilians and soldiers captured by the Huns might also be ransomed back, or else sold to Roman slave dealers as slaves. The Huns themselves, Maenchen-Helfen argued, had little use for slaves due to their nomadic pastoralist lifestyle. More recent scholarship, however, has demonstrated that pastoral nomadists are actually more likely to use slave labor than sedentary societies: the slaves would have been used to manage the Huns herds of cattle, sheep, and goats. Priscus attests that slaves were used as domestic servants, but also that educated slaves were used by the Huns in positions of administration or even architects. Some slaves were even used as warriors.     The Huns also traded with the Romans. E. A. Thompson argued that this trade was very large scale, with the Huns trading horses, furs, meat, and slaves for Roman weapons, linen, and grain, and various other luxury goods. While Maenchen-Helfen concedes that the Huns traded their horses for what he considered to have been a very considerable source of income in gold , he is otherwise skeptical of Thompsons argument. He notes that the Romans strictly regulated trade with the Barbarians and that, according to Priscus, trade only occurred at a fair once a year. While he notes that smuggling also likely occurred, he argues that the volume of both legal and illegal trade was apparently modest . He does note that wine and silk appear to have been imported into the Hunnic Empire in large quantities, however. Roman gold coins appear to have been in circulation as currency within the whole of the Hunnic Empire.       Christopher Atwood has suggested that the reason for the original Hunnic incursion into Europe may have been to establish an outlet to the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        " for the ": null
    },
    {
        "Sogdian": "sogdian people"
    },
    {
        " merchants under their rule, who were involved in the trade along the ": null
    },
    {
        "Silk Road": "silk road"
    },
    {
        " to ": null
    },
    {
        "China": "china"
    },
    {
        ". Atwood notes that Jordanes describes how the Crimean city of ": null
    },
    {
        "Cherson": "chersonesus"
    },
    {
        ", where the avaricious traders bring in the goods of Asia , was under the control of the Akatziri Huns in the sixth century.       Hunnic governmental structure has long been debated. Peter Heather argues that the Huns were a disorganized confederation in which leaders acted completely independently and that eventually established a ranking hierarchy, much like Germanic societies. Denis Sinor similarly notes that, with the exception of the historically uncertain ": null
    },
    {
        "Balamber": "balamber"
    },
    {
        ", no Hun leaders are named in the sources until ": null
    },
    {
        "Uldin": "uldin"
    },
    {
        ", indicating their relative unimportance. Thompson argues that permanent kingship only developed with the Huns invasion of Europe and the near constant warfare that followed. Regarding the organization of Hunnic rule under Attila, Peter Golden comments it can hardly be called a state, much less an empire . Golden speaks instead of a Hunnic confederacy . Kim, however, argues that the Huns were far more organized and centralized, with some basis in organization of the Xiongnu state. Walter Pohl notes the correspondences of Hunnic government to those of other steppe empires, but nevertheless argues that the Huns do not appear to have been a unified group when they arrived in Europe.     Ammianus said that the Huns of his day had no kings, but rather that each group of Huns instead had a group of leading men  for times of war . Ammianus 31.2.4 E.A. Thompson supposes that even in war the leading men had little actual power. He further argues that they most likely did not acquire their position purely heriditarily. Heather, however, argues that Ammianus merely means that the Huns didnt have a single ruler; he notes that Olympiodorus mentions the Huns having several kings, with one being the first of the kings . Ammianus also mentions that the Huns made their decisions in a general council  while seated on horse back. He makes no mention of the Huns organization into tribes, but Priscus and other writers do, naming some of them.     The first Hunnic ruler known by name is ": null
    },
    {
        "Uldin": "uldin"
    },
    {
        ". Thompson takes Uldins sudden disappearance after he was unsuccessful at war as a sign that the Hunnic kingship was democratic at this time rather than a permanent institution. Kim however argues that Uldin is actually a title and that he was likely merely a subking. Priscus calls Attila king or emperor , but it is unknown what native title he was translating. With the exception of the sole rule of Attila, the Huns often had two rulers; Attila himself later appointed his son Ellac as co-king. Subject peoples of the Huns were led by their own kings.     Priscus also speaks of picked men or logades  forming part of Attilas government, naming five of them. Some of the picked men seem to have been chosen because of birth, others for reasons of merit. Thompson argued that these picked men were the hinge upon which the entire administration of the Hun empire turned : he argues for their existence in the government of Uldin, and that each had command over detachments of the Hunnic army and ruled over specific portions of the Hunnic empire, where they were responsible also for collecting tribute and provisions. Maenchen-Helfen, however, argues that the word logades denotes simply prominent individuals and not a fixed rank with fixed duties. Kim affirms the importance of the logades for Hunnic administration, but notes that there were differences of rank between them, and suggests that it was more likely lower ranking officials who gathered taxes and tribute. He suggests that various Roman defectors to the Huns may have worked in a sort of imperial bureaucracy.                    There are two sources for the material culture and art of the Huns: ancient descriptions and archaeology. Unfortunately, the nomadic nature of Hun society means that they have left very little in the archaeological record. Indeed, although a great amount of archaeological material has been unearthed since 1945, as of 2005 there were only 200 positively identified Hunnic burials producing Hunnic material culture. It can be difficult to distinguish Hunnic archaeological finds from those of the Sarmatians, as both peoples lived in close proximity and seem to have had very similar material cultures. Kim thus cautions that it is difficult to assign any artifact to the Huns ethnically. It is also possible that the Huns in Europe adopted the material culture of their Germanic subjects. Roman descriptions of the Huns, meanwhile, are often highly biased, stressing their supposed primitiveness.     Archaeological finds have produced a large number of cauldrons that have since the work of Paul Reinecke in 1896 been identified as having been produced by the Huns. Although typically described as bronze cauldrons , the cauldrons are often made of copper, which is generally of poor quality. Maenchen-Helfen lists 19 known finds of Hunnish cauldrons from all over Central and Eastern Europe and Western Siberia. He argues from the state of the bronze castings that the Huns were not very good metalsmiths, and that it is likely that the cauldrons were cast in the same locations where they were found. They come in various shapes, and are sometimes found together with vessels of various other origins. Maenchen-Helfen argues that the cauldrons were cooking vessels for boiling meat, but that the fact that many are found deposited near water and were generally not buried with individuals may indicate a sacral usage as well. The cauldrons appear to derive from those used by the Xiongnu. Ammianus also reports that the Huns had iron swords. Thompson is skeptical that the Huns cast them themselves, but Maenchen-Helfen argues that e idea that the Hun horsemen fought their way to the walls of Constantinople and to the Marne with bartered and captured swords is absurd.      Both ancient sources and archaeological finds from graves confirm that the Huns wore elaborately decorated golden or gold-plated ": null
    },
    {
        "diadem": "diadem"
    },
    {
        "s. Maenchen-Helfen lists a total of six known Hunnish diadems. Hunnic women seem to have worn necklaces and bracelets of mostly imported beads of various materials as well. The later common early medieval practice of decorating jewelry and weapons with gemstones appears to have originated with the Huns. They are also known to have made small mirrors of an originally Chinese type, which often appear to have been intentional broken when placed into a grave.     Archaeological finds indicate that the Huns wore gold plaques as ornaments on their clothing, as well as imported glass beads. Ammianus reports that they wore clothes made of linen or the furs of marmots and leggings of goatskin.     Ammianus reports that the Huns had no buildings, but in passing mentions that the Huns possessed tents and wagons. Maenchen-Helfen believes that the Huns likely had tents of felt and sheepskin : Priscus once mentions Attilas tent, and Jordanes reports that Attila lay in state in a silk tent. However, by the middle of the fifth century, the Huns are also known to have also owned permanent wooden houses, which Maenchen-Helfen believes were built by their Gothic subjects.              Various archaeologists have argued that the Huns, or the nobility of the Huns, as well as Germanic tribes influenced by them, practiced ": null
    },
    {
        "artificial cranial deformation": "artificial cranial deformation"
    },
    {
        ", the process of artificially lengthening the skulls of babies by binding them. The goal of this process was to create a clear physical distinction between the nobility and the general populace . While Eric Crubézy has argued against a Hunnish origin for the spread this practice, the majority of scholars hold the Huns responsible for the spread of this custom in Europe. The practice was not originally introduced to Europe by the Huns, however, but rather with the ": null
    },
    {
        "Alans": "alans"
    },
    {
        ", with whom the Huns were closely associated, and ": null
    },
    {
        "Sarmatians": "sarmatians"
    },
    {
        ". It was also practiced by other peoples called Huns in Asia.          A variety of languages were spoken within the Hun Empire. Priscus noted that the ": null
    },
    {
        "Hunnic language": "hunnic language"
    },
    {
        " differed from other languages spoken at Attilas court. He recounts how Attilas ": null
    },
    {
        "jester": "jester"
    },
    {
        " Zerco": "zerco"
    },
    {
        " made Attilas guests laugh also by the promiscuous jumble of words, Latin mixed with Hunnish and Gothic.  Priscus said that Attilas ": null
    },
    {
        "Scythian": "scythian"
    },
    {
        " subjects spoke besides their own barbarian tongues, either Hunnish, or Gothic, or, as many have dealings with the Western Romans, Latin; but not one of them easily speaks Greek, except captives from the Thracian or Illyrian frontier regions . Some scholars have argued that the ": null
    },
    {
        "Gothic": "gothic language"
    },
    {
        " was used as the  lingua franca  of the Hunnic Empire. Hyun Jin Kim argues that the Huns may have used as many as four languages at various levels of government, without any one being dominant: Hunnic, Gothic, ": null
    },
    {
        "Latin": "latin language"
    },
    {
        ", and ": null
    },
    {
        "Sarmatian": "scythian languages"
    },
    {
        ".     As to the Hunnic language itself, only three words are recorded in ancient sources as being Hunnic, all of which appear to be from an ": null
    },
    {
        "Indo-European language": "indo-european languages"
    },
    {
        ". All other information on Hunnic is contained in personal names and tribal ethnonyms. On the basis of these names, scholars have proposed that Hunnic may have been a ": null
    },
    {
        "Turkic language": "turkic languages"
    },
    {
        ", a language between ": null
    },
    {
        "Mongolic": "mongolic languages"
    },
    {
        " and Turkic, or a ": null
    },
    {
        "Yeniseian language": "yeniseian languages"
    },
    {
        ". However, given the small corpus, many scholars hold the language to be unclassifiable.       The elites of the Huns practiced ": null
    },
    {
        "polygamy": "polygamy"
    },
    {
        ", while the commoners were probably monogamous. Ammianus Marcellinus claimed that the Hunnish women lived in seclusion, however the first-hand account of Priscus shows them freely moving and mixing with men. Priscus describes Hunnic women swarming around Attila as he entered a village, as well as the wife of Attilas minister ": null
    },
    {
        "Onegesius": "onegesius"
    },
    {
        " offering the king food and drink with her servants. Priscus was able to enter the tent of Attilas chief wife, ": null
    },
    {
        "Hereca": "kreka"
    },
    {
        ", without difficulty.     Priscus also attests that the widow of Attilas brother Bleda was in command of a village that the Roman ambassadors rode through: her territory may have included a larger area. Thompson notes that other steppe peoples such as the ": null
    },
    {
        "Utigurs": "utigurs"
    },
    {
        " and the ": null
    },
    {
        "Sabirs": "sabirs"
    },
    {
        ", are known to have had female tribal leaders, and argues that the Huns probably held widows in high respect. Due to the pastoral nature of the Huns economy, the women likely had a large degree of authority over the domestic household.       Almost nothing is known about the religion of the Huns. Roman writer Ammianus Marcellinus claimed that the Huns had no religion, while the fifth-century Christian writer Salvian classified them as pagans. Jordanes Getica also records that the Huns worshipped the sword of Mars , an ancient sword that signified Attilas right to rule the whole world. Maenchen-Helfen notes a widespread worship of a war god in the form of a sword among steppe peoples, including among the Xiongnu. Denis Sinor, however, holds the worship of a sword among the Huns to be aprocryphal. Maenchen-Helfen also argues that, while the Huns themselves do not appear to have regarded Attila as divine, some of his subject people clearly did. A belief in prophecy and divination is also attested among the Huns. Maenchen-Helfen argues that the performers of these acts of soothsaying and divination were likely ": null
    },
    {
        "shaman": "shaman"
    },
    {
        "s. Sinor also finds it likely that the Huns had shamans, although they are completely unattested. Maenchen-Helfen also deduces a belief in water-spirits from a custom mentioned in Ammianus. He further suggests that the Huns may have made small metal, wooden, or stone idols, which are attested among other steppe tribes, and which a Byzantine source attests for the Huns in Crimea in the sixth century. He also connects archaeological finds of Hunnish bronze cauldrons found buried near or in running water to possible rituals performed by the Huns in the Spring.     John Man argues that the Huns of Attilas time likely worshipped the sky and the steppe deity ": null
    },
    {
        "Tengri": "tengri"
    },
    {
        ", who is also attested as having been worshipped by the Xiongnu. Maenchen-Helfen also suggests the possibility that the Huns of this period may have worshipped Tengri, but notes that the god is not attested in European records until the ninth century.  Worship of Tengri under the name Tangri Khan is attested among the ": null
    },
    {
        "Caucasian Huns": "north caucasian huns"
    },
    {
        " in the Armenian chronicle attributed to Movses Dasxuranci during the later seventh-century. Movses also records that the Caucasian Huns worshipped trees and burnt horses as sacrifices to Tengri, and that they made sacrifices to fire and water and to certain gods of the roads, and to the moon and to all creatures considered in their eyes to be in some way remarkable.  There is also some evidence for human sacrifice among the European Huns. Maenchen-Helfen argues that humans appear to have been sacrificed at Attilas funerary rite, recorded in Jordanes under the name strava. Priscus claims that the Huns sacrificed their prisoners to victory after they entered Scythia, but this is not otherwise attested as a Hunnic custom and may be fiction.     In addition to these pagan beliefs, there are numerous attestations of Huns converting to Christianity and receiving Christian missionaries. The missionary activities among the Huns of the Caucasas seem to have been particularly successful, resulting in the conversion of the Hunnish prince ": null
    },
    {
        "Alp Ilteber": "alp ilteber"
    },
    {
        ". Attila appears to have tolerated both ": null
    },
    {
        "Nicene": "nicene christianity"
    },
    {
        " and ": null
    },
    {
        "Arian Christianity": "arianism"
    },
    {
        " among his subjects. However, a pastoral letter by ": null
    },
    {
        "Pope Leo the Great": "pope leo the great"
    },
    {
        " to the church of ": null
    },
    {
        "Aquileia": "aquileia"
    },
    {
        " indicates that Christian slaves taken from there by the Huns in 452 were forced to participate in Hunnic religious activities.                Hun warfare as a whole is not well studied. One of the principal sources of information on Hunnic warfare is Ammianus Marcellinus, who includes an extended description of the Huns methods of war:   They also sometimes fight when provoked, and then they enter the battle drawn up in wedge-shaped masses, while their medley of voices makes a savage noise. And as they are lightly equipped for swift motion, and unexpected in action, they purposely divide suddenly into scattered bands and attack, rushing about in disorder here and there, dealing terrific slaughter; and because of their extraordinary rapidity of movement they are never seen to attack a rampart or pillage an enemys camp. And on this account you would not hesitate to call them the most terrible of all warriors, because they fight from a distance with missiles having sharp bone, instead of their usual points, joined to the shafts with wonderful skill; then they gallop over the intervening spaces and fight hand to hand with swords, regardless of their own lives; and while the enemy are guarding against wounds from the sabre-thrusts, they throw strips of cloth plaited into nooses over their opponents and so entangle them that they fetter their limbs and take from them the power of riding or walking. Ammianus Marcellinus, 31.2.8–9 .   Based on Ammianus description, Maenchen-Helfen argues that the Huns tactics did not differ markedly from those used by other nomadic horse archers. He argues that the wedge-shaped masses  mentioned by Ammianus were likely divisions organized by tribal clans and families, whose leaders may have been called a cur . This title would then have been inherited as it was passed down the clan. Like Ammianus, the sixth-century writer Zosimus also emphasizes the Huns almost exclusive use of horse archers and their extreme swiftness and mobility. These qualities differed from other nomadic warriors in Europe at this time: the ": null
    },
    {
        "Sarmatians": "sarmatians"
    },
    {
        ", for instance, relied on heavily armored ": null
    },
    {
        "cataphracts": "cataphracts"
    },
    {
        " armed with lances. The Huns use of terrible war cries are also found in other sources. However, a number of Ammianuss claims have been challenged by modern scholars. In particular, while Ammianus claims that the Huns knew no metalworking, Maenchen-Helfen argues that a people so primitive could never have been successful in war against the Romans.     Hunnic armies relied on their high mobility and a shrewd sense of when to attack and when to withdraw . An important strategy used by the Huns was a feigned retreat−pretending to flee and then turning and attacking the disordered enemy. This is mentioned by the writers Zosimus and Agathias. They were, however, not always effective in pitched battle, suffering defeat at ": null
    },
    {
        "Toulouse": "battle of toulouse"
    },
    {
        " in 439, barely winning at the ": null
    },
    {
        "Battle of the Utus": "battle of the utus"
    },
    {
        " in 447, likely losing or stalemating at the ": null
    },
    {
        "Battle of the Catalaunian Plains": "battle of the catalaunian plains"
    },
    {
        " in 451, and losing at the ": null
    },
    {
        "Battle of Nedao": "battle of nedao"
    },
    {
        " . Christopher Kelly argues that Attila sought to avoid as far as possible, large-scale engagement with the Roman army . War and the threat of war were frequently used tools to extort Rome; the Huns often relied on local traitors to avoid losses. Accounts of battles note that the Huns fortified their camps by using portable fences or creating a circle of wagons.     The Huns nomadic lifestyle encouraged features such as excellent horsemanship, while the Huns trained for war by frequent hunting.Several scholars have suggested that the Huns had trouble maintaining their horse cavalry and nomadic lifestyle after settling on the Hungarian Plain, and that this in turn led to a marked decrease in their effectiveness as fighters.     The Huns are almost always noted as fighting alongside non-Hunnic, Germanic or Iranian subject peoples or, in earlier times, allies. As Heather notes, the Huns military machine increased, and increased very quickly, by incorporating ever larger numbers of the Germani of central and eastern Europe . At the Battle of the Catalaunian Plains, Attila is noted by Jordanes to have placed his subject peoples in the wings of the army, while the Huns held the center.     A major source of information on steppe warfare from the time of the Huns comes from the 6th-century ": null
    },
    {
        "Strategikon": "strategikon of maurice"
    },
    {
        ", which describes the warfare of Dealing with the Scythians, that is, Avars, Turks, and others whose way of life resembles that of the Hunnish peoples. The Strategikon describes the Avars and Huns as devious and very experienced in military matters. They are described as preferring to defeat their enemies by deceit, surprise attacks, and cutting off supplies. The Huns brought large numbers of horses to use as replacements and to give the impression of a larger army on campaign. The Hunnish peoples did not set up an entrenched camp, but spread out across the grazing fields according to clan, and guard their necessary horses until they began forming the battle line under the cover of early morning. The Strategikon states the Huns also stationed sentries at significant distances and in constant contact with each other in order to prevent surprise attacks.     According to the Strategikon, the Huns did not form a battle line in the method that the Romans and Persians used, but in irregularly sized divisions in a single line, and keep a separate force nearby for ambushes and as a reserve. The Strategikon also states the Huns used deep formations with a dense and even front. The Strategikon states that the Huns kept their spare horses and baggage train to either side of the battle line at about a mile away, with a moderate sized guard, and would sometimes tie their spare horses together behind the main battle line. The Huns preferred to fight at long range, utilizing ambush, encirclement, and the feigned retreat. The Strategikon also makes note of the wedge shaped formations mentioned by Ammianus, and corroborated as familial regiments by Maenchen-Helfen. Ammianus Marcellinus, Res Gestae, 31.2.8 The Strategikon states the Huns preferred to pursue their enemies relentlessly after a victory and then wear them out by a long siege after defeat.     Peter Heather notes that the Huns were able to successfully besiege walled cities and fortresses in their campaign of 441: they were thus capable of building siege engines. Heather makes note of multiple possible routes for acquisition of this knowledge, suggesting that it could have been brought back from service under Aetius, acquired from captured Roman engineers, or developed through the need to pressure the wealthy silk road city states and carried over into Europe. David Nicolle agrees with the latter point, and even suggests they had a complete set of engineering knowledge including skills for constructing advanced fortifications, such as the fortress of Igdui-Kala in Kazakhstan.       The Strategikon states the Huns typically used ": null
    },
    {
        "mail": "mail"
    },
    {
        ", swords, bows, and lances, and that most Hunnic warriors were armed with both the bow and lance and used them interchangeably as needed. It also states the Huns used quilted linen, wool, or sometimes iron barding for their horses and also wore quilted coifs and kaftans. This assessment is largely corroborated by archaeological finds of Hun military equipment, such as the Volnikovka and Brut Burials.     A ": null
    },
    {
        "late Roman ridge helmet": "late roman ridge helmet"
    },
    {
        " of the Berkasovo-Type was found with a Hun burial at ": null
    },
    {
        "Concesti": "concești"
    },
    {
        ". A Hunnic helmet of the segmentehelm type was found at Chudjasky, a Hunnic spangenhelmet at Tarasovsky grave 1784, and another of the bandhelm type at Turaevo. Fragments of lamellar helmets dating to the Hunnic period and within the Hunnic sphere have been found at Iatrus, Illichevka, and Kalkhni. Hun ": null
    },
    {
        "lamellar armour": "lamellar armour"
    },
    {
        " has not been found in Europe, although two fragments of likely Hun origin have been found on the Upper Ob and in West Kazakhstan dating to the 3rd–4th centuries.  A find of lamellar dating to about 520 from the Toprachioi warehouse in the fortress of Halmyris near Badabag, Romania, suggests a late 5th or early 6th century introduction. It is known that the Eurasian Avars introduced Lamellar armor to the Roman Army and Migration Era Germanics in the Middle 6th Century, but this later type does not appear before then.     It is also widely accepted that the Huns introduced the ": null
    },
    {
        "langseax": "seax"
    },
    {
        ", a 60  cm cutting blade that became popular among the migration era Germanics and in the ": null
    },
    {
        "Late Roman Army": "late roman army"
    },
    {
        ", into Europe. It is believed these blades originated in China and that the Sarmatians and Huns served as a transmission vector, using shorter seaxes in Central Asia that developed into the narrow langseax in Eastern Europe during the late 4th and first half of the 5th century. These earlier blades date as far back as the 1st century AD, with the first of the newer type appearing in Eastern Europe being the Wien-Simmerming example, dated to the late 4th century AD. Other notable Hun examples include the Langseax from the more recent find at Volnikovka in Russia.     The Huns used a type of ": null
    },
    {
        "spatha": "spatha"
    },
    {
        " in the Iranic or ": null
    },
    {
        "Sassanid": "sasanian empire"
    },
    {
        " style, with a long, straight approximately 83  cm blade, usually with a diamond shaped iron guard plate. Swords of this style have been found at sites such as Altlussheim, Szirmabesenyo, Volnikovka, Novo-Ivanovka, and Tsibilium 61. They typically had gold foil hilts, gold sheet scabbards, and scabbard fittings decorated in the polychrome style. The sword was carried in the Iranian style attached to a swordbelt, rather than on a baldric.     The most famous weapon of the Huns is the Qum Darya-type composite recurve bow, often called the Hunnish Bow . This bow was invented some time in the 3rd or 2nd centuries BC with the earliest finds near Lake Baikal, but spread across Eurasia long before the Hunnic migration. These bows were typified by being asymmetric in cross-section between 145–155  cm in length, having between 4–9 lathes on the grip and in the siyahs. Although whole bows rarely survive in European climatic conditions, finds of bone Siyahs are quite common and characteristic of steppe burials. Complete specimens have been found at sites in the Tarim Basin and Gobi Desert such as Niya, Qum Darya, and Shombuuziin-Belchir. Eurasian nomads such as the Huns typically used trilobate diamond shaped iron arrowheads, attached using birch tar and a tang, with typically 75  cm shafts and fletching attached with tar and sinew whipping. Such trilobate arrowheads are believed to be more accurate and have better penetrating power or capacity to injure than flat arrowheads. Finds of bows and arrows in this style in Europe are limited but archaeologically evidenced. The most famous examples come from Wien-Simmerming, although more fragments have been found in the Northern Balkans and Carpathian regions.                After the fall of the Hunnic Empire, various legends arose concerning the Huns. Among these are a number of Christian ": null
    },
    {
        "hagiographic": "hagiography"
    },
    {
        " legends in which the Huns play a role. In an anonymous medieval biography of ": null
    },
    {
        "Pope Leo I": "pope leo i"
    },
    {
        ", Attilas march into Italy in 452 is stopped because, when he meets Leo outside Rome, the apostles ": null
    },
    {
        "Peter": "saint peter"
    },
    {
        " and ": null
    },
    {
        "Paul": "paul the apostle"
    },
    {
        " appear to him holding swords over his head and threatening to kill him unless he follows the popes command to turn back. In other versions, Attila takes the pope hostage and is forced by the saints to release him. In the legend of ": null
    },
    {
        "Saint Ursula": "saint ursula"
    },
    {
        ", Ursula and her 11,000 holy virgins arrive at ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " on their way back from a pilgrimage just as the Huns, under an unnamed prince, are besieging the city. Ursula and her virgins killed by the Huns with arrows after they refuse the Huns sexual advances. Afterwards, however, the souls of the slaughtered virgins form a heavenly army that drives away the Huns and saves Cologne. Other cities with legends regarding the Huns and a saint include ": null
    },
    {
        "Orleans": "orleans"
    },
    {
        ", ": null
    },
    {
        "Troyes": "troyes"
    },
    {
        ", ": null
    },
    {
        "Dieuze": "dieuze"
    },
    {
        ", ": null
    },
    {
        "Metz": "metz"
    },
    {
        ", ": null
    },
    {
        "Modena": "modena"
    },
    {
        ", and ": null
    },
    {
        "Reims": "reims"
    },
    {
        ". In legends surrounding Saint ": null
    },
    {
        "Servatius of Tongeren": "servatius of tongeren"
    },
    {
        " dating to at least the eighth century, Servatius is said to have converted Attila and the Huns to Christianity, before they later became apostates and returned to their paganism.            The Huns also play an important role in medieval Germanic legends, which frequently convey versions of events from the ": null
    },
    {
        "migration period": "migration period"
    },
    {
        " and were originally transmitted orally. Memories of the conflicts between the Goths and Huns in Eastern Europe appear to be maintained in the ": null
    },
    {
        "Old English": "old english"
    },
    {
        " poem  Widsith  as well as in the ": null
    },
    {
        "Old Norse": "old norse"
    },
    {
        " poem ": null
    },
    {
        "The Battle of the Goths and Huns": "the battle of the goths and huns"
    },
    {
        " , which is transmitted in the thirteenth-century Icelandic  Hervarar Saga . Widsith also mentions Attila having been ruler of the Huns, placing him at the head of a list of various legendary and historical rulers and peoples and marking the Huns as the most famous. The name Attila, rendered in Old English as Ætla, was a given name in use in ": null
    },
    {
        "Anglo-Saxon": "anglo-saxons"
    },
    {
        " England": "england"
    },
    {
        "  and its use in England at the time may have been connected to the heroic kings legend represented in works such as Widsith. Maenchen-Helfen, however, doubts the use of the name by the Anglo-Saxons had anything to do with the Huns, arguing that it was not a rare name.  ": null
    },
    {
        "Bede": "bede"
    },
    {
        ", in his  Ecclesiastical History of the English People , lists the Huns among other peoples living in Germany when the ": null
    },
    {
        "Anglo-Saxons": "anglo-saxons"
    },
    {
        " invaded England. This may indicate that Bede viewed the Anglo-Saxons as descending partially from the Huns.     The Huns and Attila also form central figures in the two most-widespread Germanic legendary cycles, that of the ": null
    },
    {
        "Nibelungs": "nibelung"
    },
    {
        "and of ": null
    },
    {
        "Dietrich von Bern": "dietrich von bern"
    },
    {
        " . The Nibelung legend, particularly as recorded in the Old Norse  Poetic Edda  and  Völsunga saga , as well as in the German  Nibelungenlied , connects the Huns and Attila to the destruction of the ": null
    },
    {
        "Burgundian": "burgundians"
    },
    {
        " kingdom on the Rhine in 437. In the legends about Dietrich von Bern, Attila and the Huns provide Dietrich with a refuge and support after he has been driven from his kingdom at Verona. A version of the events of the Battle of Nadao may be preserved in a legend, transmitted in two differing versions in the Middle High German  Rabenschlacht  and Old Norse  Thidrekssaga , in which the sons of Attila fall in battle. The legend of ": null
    },
    {
        "Walter of Aquitaine": "walter of aquitaine"
    },
    {
        ", meanwhile, shows the Huns to receive child hostages as tribute from their subject peoples. Generally, the continental Germanic traditions paint a more positive picture of Attila and the Huns than the Scandinavian sources, where the Huns appear in a distinctly negative light.     In medieval German legend, the Huns were identified with the Hungarians, with their capital of Etzelburg being identified with ": null
    },
    {
        "Esztergom": "esztergom"
    },
    {
        " or ": null
    },
    {
        "Buda": "buda"
    },
    {
        ". The Old Norse  Thidrekssaga , however, which is based on North German sources, locates Hunaland in northern Germany, with a capital at ": null
    },
    {
        "Soest": "soest, germany"
    },
    {
        " in ": null
    },
    {
        "Westphalia": "westphalia"
    },
    {
        ". In other Old Norse sources, the term Hun is sometimes applied indiscriminately to various people, particularly from south of Scandinavia. From the thirteenth-century onward, the Middle High German word for Hun, hiune, became a synonym for giant, and continued to be used in this meaning in the forms Hüne and Heune into the modern era.  In this way, various prehistoric ": null
    },
    {
        "megalithic structures": "megalith"
    },
    {
        ", particularly in Northern Germany, came to be identified as Hünengräber or Hünenbetten .                      Beginning in the High Middle Ages, Hungarian sources have claimed descent from or a close relationship between the Hungarians and the Huns. The claim appears to have first arisen in non-Hungarian sources and only gradually been taken up by the Hungarians themselves because of its negative connotations. The anonymous  Gesta Hungarorum  is the first Hungarian source to mention that the line of ": null
    },
    {
        "Árpádian kings": "hungarymedieval_hungary_895%e2%80%931526"
    },
    {
        " were descendants of Attila, but he makes no claim that the Hungarian and Hun peoples are related. The first Hungarian author to claim that Hun and Hungarian peoples were related was ": null
    },
    {
        "Simon of Kéza": "simon of kéza"
    },
    {
        " in his  Gesta Hunnorum et Hungarorum  . Simon claimed that the Huns and Hungarians were descended from two brothers, named ": null
    },
    {
        "Hunor and Magor": "hunor and magor"
    },
    {
        ". These claims gave the Hungarians an ancient pedegree and served to legitimize their conquest of ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        ".     Modern scholars largely dismiss these claims. Regarding the claimed Hunnish origins found in these chronicles, ": null
    },
    {
        "Jenő Szűcs": "jenő szűcs"
    },
    {
        " writes:   The Hunnish origin of the Magyars is, of course, a fiction, just like the Trojan origin of the French or any of the other origo gentis theories fabricated at much the same time. The Magyars in fact originated from the Ugrian branch of the Finno-Ugrian peoples; in the course of their wanderings in the steppes of Eastern Europe they assimiliated a variety of cultural and ethnic elements, but they had neither genetic nor historical links to the Huns.   Generally, the proof of the relationship between the ": null
    },
    {
        "Hungarian": "hungarian language"
    },
    {
        " and the ": null
    },
    {
        "Finno-Ugric": "finno-ugric"
    },
    {
        " languages in the nineteenth century is taken to have scientifically disproven the Hunnic origins of the Hungarians. Another claim, also derived from Simon of Kéza, is that the Hungarian-speaking ": null
    },
    {
        "Székely": "székely"
    },
    {
        " people of ": null
    },
    {
        "Transylvania": "transylvania"
    },
    {
        " are descended from Huns, who fled to Transylvania after Attilas death, and remained there until the Hungarian conquest of Pannonia. While the origins of the Székely are unclear, modern scholarship is skeptical that they are related to the Huns. László Makkai notes as well that some archaeologists and historians believe Székelys were a Hungarian tribe or an Onogur-Bulgar tribe drawn into the Carpathian Basin at the end of the 7th century by the ": null
    },
    {
        "Avars": "pannonian avars"
    },
    {
        " . Unlike in the legend, the Székely were resettled in Transylvania from Western Hungary in the eleventh century. Their language similarly shows no evidence of a change from any non-Hungarian language to Hungarian, as one would expect if they were Huns. While the Hungarians and the Székelys may not be descendants of the Huns, they were historically closely associated with Turkic peoples. Pál Engel notes that it cannot be wholly excluded that Arpadian kings may have been descended from Attila, however, and believes that it is likely the Hungarians once lived under the rule of the Huns. Hyun Jin Kim supposes that the Hungarians might be linked to the Huns via the ": null
    },
    {
        "Bulgars": "bulgars"
    },
    {
        " and Avars, both of whom he holds to have had Hunnish elements.     While the notion that the Hungarians are descended from the Huns has been rejected by mainstream scholarship, the idea has continued to exert a relevant influence on Hungarian nationalism and national identity. A majority of the Hungarian aristocracy continued to ascribe to the Hunnic view into the early twentieth century. The ": null
    },
    {
        "Fascist": "fascism"
    },
    {
        " Arrow Cross Party": "arrow cross party"
    },
    {
        " similarly referred to Hungary as Hunnia in its propaganda. Hunnic origins also played a large role in the ideology of the modern radical right-wing party ": null
    },
    {
        "Jobbiks": "jobbik"
    },
    {
        "ideology of ": null
    },
    {
        "Pan-Turanism": "turanism"
    },
    {
        ". Legends concerning the Hunnic origins of the Székely minority in ": null
    },
    {
        "Romania": "romania"
    },
    {
        ", meanwhile, continue to play a large role in that groups ethnic identity. The Hunnish origin of the Székelys remains the most widespread theory of their origins among the Hungarian general public.             On 27 July 1900, during the ": null
    },
    {
        "Boxer Rebellion": "boxer rebellion"
    },
    {
        " in ": null
    },
    {
        "China": "qing dynasty"
    },
    {
        ", ": null
    },
    {
        "Kaiser": "kaiser"
    },
    {
        " Wilhelm II": "wilhelm ii, german emperor"
    },
    {
        " of ": null
    },
    {
        "Germany": "german empire"
    },
    {
        " gave the order to act ruthlessly towards the rebels: Mercy will not be shown, ": null
    },
    {
        "prisoners will not be taken": "no quarter"
    },
    {
        ". Just as a thousand years ago, the Huns under Attila won a reputation of might that lives on in legends, so may the name of Germany in China, such that no Chinese will even again dare so much as to look askance at a German. Weser-Zeitung, 28 July 1900, second morning edition, p. 1: Wie vor tausend Jahren die Hunnen unter ihrem König Etzel sich einen Namen gemacht, der sie noch jetzt in der Überlieferung gewaltig erscheinen läßt, so möge der Name Deutschland in China in einer solchen Weise bekannt werden, daß niemals wieder ein Chinese es wagt, etwa einen Deutschen auch nur schiel anzusehen. This comparison was later heavily employed by British and English-language propaganda during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", and to a lesser extent during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", in order to paint the Germans as savage barbarians.": null
    }
]