[
    {
        "   Hunt the Wumpus is a ": null
    },
    {
        "text-based": "Text-Based Game"
    },
    {
        " adventure game": "Adventure Game"
    },
    {
        " developed by ": null
    },
    {
        "Gregory Yob": "Gregory Yob"
    },
    {
        " in 1973. In the game, the player moves through a series of connected caves, arranged in a ": null
    },
    {
        "dodecahedron": "Dodecahedron"
    },
    {
        ", as they hunt a monster named the Wumpus. The ": null
    },
    {
        "turn-based": "Turns, Rounds And Time-Keeping Systems In Games"
    },
    {
        " game has the player trying to avoid fatal ": null
    },
    {
        "bottomless pits": "Glossary_Of_Video_Game_Termsbottomless_Pit"
    },
    {
        " and super bats that will move them around the cave system; the goal is to fire one of their crooked arrows through the caves to kill the Wumpus. Yob created the game in early 1973 due to his annoyance at the multiple ": null
    },
    {
        "hide-and-seek": "Hide-And-Seek"
    },
    {
        " games set in caves in a grid pattern, and it and multiple variations were sold via mail order by Yob and the ": null
    },
    {
        "Peoples Computer Company": "Peoples Computer Company"
    },
    {
        ". The ": null
    },
    {
        "source code": "Source Code"
    },
    {
        " to the game was published in  Creative Computing  in 1975 and republished in The Best of Creative Computing the following year.     The game sparked multiple variations and expanded versions and was ported to several systems, including the ": null
    },
    {
        "TI-99/4A": "Texas Instruments Ti-99/4A"
    },
    {
        " home computer": "Home Computer"
    },
    {
        ". It has been cited as an early example of the ": null
    },
    {
        "survival horror": "Survival Horror"
    },
    {
        " genre, and was listed in 2012 on  Time s All-Time 100 greatest video games list. The Wumpus monster has appeared in several forms in media since 1973, including other video games, a novella, and  Magic: The Gathering  cards.          Hunt the Wumpus is a ": null
    },
    {
        "text-based": "Text-Based Game"
    },
    {
        " adventure game": "Adventure Game"
    },
    {
        " set in a series of caves connected by tunnels. In one of the twenty caves is a Wumpus , which the player is attempting to kill. Additionally, two of the caves contain bottomless pits, while two others contain super bats which will pick up the player and move them to a random cave. The game is ": null
    },
    {
        "turn-based": "Turns, Rounds And Time-Keeping Systems In Games"
    },
    {
        "; each cave is given a number by the game, and each turn begins with the player being told which cave they are in and which caves are connected to it by tunnels. The player then elects to either move to one of those connected caves or shoot one of their five crooked arrows , named for their ability to change direction while in flight. Each cave is connected to three others, and the system as a whole is equivalent to a ": null
    },
    {
        "dodecahedron": "Dodecahedron"
    },
    {
        ".     The caves are in complete darkness, so the player cannot see into adjacent caves; instead, upon moving to a new empty cave, the game describes if they can smell a Wumpus, hear a bat, or feel a draft from a pit in one of the connected caves. Entering a cave with a pit ends the game due to the player falling in, while entering the cave with the Wumpus startles them; the Wumpus will either move to another cave or remain and kill the player. If the player chooses to fire an arrow, they first select how many caves, up to five, that the arrow will travel through, and then enters each cave that the arrow moves through. If the player enters a cave number that is not connected to where the arrow is, the game picks a valid option at random. If the arrow hits the player while it is travelling, the player loses; if it hits the Wumpus, they win. If the arrow does not hit anything, then the Wumpus is startled and may move to a new cave; unlike the player, the Wumpus is not affected by super bats or pits. If the Wumpus moves to the players location, they lose.          In early 1973, ": null
    },
    {
        "Gregory Yob": "Gregory Yob"
    },
    {
        " was looking through some of the games published by the ": null
    },
    {
        "Peoples Computer Company": "Peoples Computer Company"
    },
    {
        " , and grew annoyed that there were multiple games, including Hurkle and  Mugwump , that had the player hide and seek in a 10 by 10 grid. Yob was inspired to make a game that used a non-grid pattern, where the player would move through points connected through some other type of topology. Yob came up with the name Hunt the Wumpus that afternoon, and decided from there that the player would traverse through rooms arranged in a non-grid pattern, with a monster called a Wumpus somewhere in them. Yob chose a dodecahedron because it was his favorite ": null
    },
    {
        "platonic solid": "Platonic Solid"
    },
    {
        ", and because he had once made a kite shaped like one. From there, Yob added the arrows to shoot between rooms, terming it the crooked arrow as it would need to change directions to go through multiple caves, and decided that the player could only sense nearby caves by smell, as a light would wake the Wumpus up. He then added the bottomless pits, and a couple days later the super bats. Finally, feeling that players would want to create a map, he made the cave map fixed and gave each cave a number. Yob later claimed that, to his knowledge, most players did not create maps of the cave system, nor follow his expected strategy of carefully moving around the system to determine exactly where the Wumpus was before firing an arrow. While playtesting the game, Yob found it unexciting that the Wumpus always stayed in one place, and so changed it to be able to move. He then delivered a copy of the game, written in ": null
    },
    {
        "BASIC": "Basic"
    },
    {
        ", to the PCC.     In May 1973, one month after he had finished coding the game, Yob went to a conference at ": null
    },
    {
        "Stanford University": "Stanford University"
    },
    {
        " and discovered that in the section of the conference where the PCC had set up computer terminals, multiple players were engrossed in playing Wumpus, making it, in his opinion, a hit game. The PCC first mentioned the game in its newsletter in September 1973 as a cave game that would be available to order through them soon, and gave it a full two-page description in its next issue in November 1973. Tapes containing Wumpus were sold via mail order by both the PCC and Yob himself. The PCC description was republished along with ": null
    },
    {
        "source code": "Source Code"
    },
    {
        " in its book What to Do After You Hit Return in 1977, while a description of the game and its source code was published in  Creative Computing  in its October 1975 issue, and republished in The Best of Creative Computing the following year. It also appeared in other books of BASIC games, such as Computer Programs in BASIC in 1981.       Multiple versions of Hunt the Wumpus were created and distributed after the games release. Yob made Wumpus 2 and Wumpus 3, beginning immediately after finishing the original game, with Wumpus 2 adding different cave arrangements and Wumpus 3 adding more hazards. The source code for Wumpus 2 was published in Creative Computing and republished in The Best of Creative Computing 2 , along with a description of Wumpus 3. The PCC announced in the same November 1973 newsletter issue as it discussed the original game that a version from them titled Super Wumpus would be available soon, and listed it in its order catalog in its January 1974 issue. In 1978, a book titled Superwumpus, by Jack Emmerichs, was published containing source code for both BASIC and ": null
    },
    {
        "assembly language": "Assembly Language"
    },
    {
        " versions of his unrelated version of Hunt the Wumpus.     In addition to the original BASIC games, versions of Hunt the Wumpus have been created for numerous other systems. Yob had seen or heard of versions in several languages, such as ": null
    },
    {
        "IBM RPG": "Ibm Rpg"
    },
    {
        " and ": null
    },
    {
        "Fortran": "Fortran"
    },
    {
        ", by 1975. A version in ": null
    },
    {
        "C": "C"
    },
    {
        ", written in November 1973 by ": null
    },
    {
        "Ken Thompson": "Ken Thompson"
    },
    {
        ", creator of the ": null
    },
    {
        "Unix": "Unix"
    },
    {
        " operating system, was released in 1974; a later C version can still be found in the bsdgames package on modern ": null
    },
    {
        "BSD": "Berkeley Software Distribution"
    },
    {
        " and ": null
    },
    {
        "Linux": "Linux"
    },
    {
        " operating systems. A version was released for the ": null
    },
    {
        "HP-41C": "Hp-41C"
    },
    {
        " calculator in 1981, and a commercial port for the ": null
    },
    {
        "TI-99/4A": "Texas Instruments Ti-99/4A"
    },
    {
        " home computer": "Home Computer"
    },
    {
        " was published by ": null
    },
    {
        "Texas Instruments": "Texas Instruments"
    },
    {
        " in 1980, with graphics and a ": null
    },
    {
        "torus": "Torus"
    },
    {
        " shape of caves displayed in a grid pattern instead of a dodecahedron.     Hunt the Wumpus has been cited as an early example of a ": null
    },
    {
        "survival horror": "Survival Horror"
    },
    {
        " game; the book Vampires and Zombies claims that it was an early example of the genre, while the paper Restless dreams in Silent Hill states that from a historical perspective the genres roots lie in Hunt the Wumpus . Other sources, however, such as the book The World of Scary Video Games, claim that the game lacks elements needed for a horror game, as the player hunts rather than is hunted by the Wumpus, and nothing in the game is explicitly intended to frighten the player, making it more of an early adventure or puzzle game. Kevin Cogger of ": null
    },
    {
        "1Up.com": "1Up.Com"
    },
    {
        " claimed that Wumpus, whether or not it is an adventure game, introduced a number of concepts that would come to define the adventure genre , such as presenting the game from the perspective of the player-character, and non-grid-based map design. In 2012, Hunt the Wumpus was listed on  Time s All-Time 100 greatest video games list. The Wumpus monster has appeared in several different forms of media, including a Hunted Wumpus  Magic: The Gathering  card, the 1983 video game  M.U.L.E. , and ": null
    },
    {
        "Cory Doctorows": "Cory Doctorow"
    },
    {
        "2011 novella  The Great Big Beautiful Tomorrow ": null
    }
]