[
    {
        "           Hunter Stockton Thompson was an American journalist and author, and the founder of the ": null
    },
    {
        "gonzo journalism": "gonzo journalism"
    },
    {
        " movement. He first rose to prominence with the publication of  Hells Angels  , a book for which he spent a year living and riding with the ": null
    },
    {
        "Hells Angels": "hells angels"
    },
    {
        " motorcycle gang in order to write a first-hand account of the lives and experiences of its members.     In 1970, he wrote an unconventional magazine feature titled ": null
    },
    {
        "The Kentucky Derby Is Decadent and Depraved": "the kentucky derby is decadent and depraved"
    },
    {
        " for  Scanlans Monthly  which both raised his profile and established him as a writer with ": null
    },
    {
        "counterculture": "counterculture"
    },
    {
        " credibility. It also set him on a path to establishing his own sub-genre of ": null
    },
    {
        "New Journalism": "new journalism"
    },
    {
        " which he called Gonzo, which was essentially an ongoing experiment in which the writer becomes a central figure and even a participant in the events of the narrative.     Thompson remains best known for  Fear and Loathing in Las Vegas  , a book first serialized in  Rolling Stone  in which he grapples with the implications of what he considered the failure of the ": null
    },
    {
        "1960s counterculture": "counterculture of the 1960s"
    },
    {
        " movement. It was adapted on film twice: loosely in  Where the Buffalo Roam  starring ": null
    },
    {
        "Bill Murray": "bill murray"
    },
    {
        " as Thompson in 1980, and directly in 1998 by director ": null
    },
    {
        "Terry Gilliam": "terry gilliam"
    },
    {
        " in a ": null
    },
    {
        "film": "fear and loathing in las vegas"
    },
    {
        " starring ": null
    },
    {
        "Johnny Depp": "johnny depp"
    },
    {
        " and ": null
    },
    {
        "Benicio del Toro": "benicio del toro"
    },
    {
        ". The  Doonesbury  cartoon character Duke – who was modeled after Thompson – pens an essay about my shoplifting conviction titled Fear and Loathing at Macys Menswear , a reference to Thompsons book.     Politically minded, Thompson ran unsuccessfully for ": null
    },
    {
        "sheriff": "sheriff"
    },
    {
        " of ": null
    },
    {
        "Pitkin County, Colorado": "pitkin county, colorado"
    },
    {
        " in 1970 on the Freak Power ticket. He became well known for his dislike of ": null
    },
    {
        "Richard Nixon": "richard nixon"
    },
    {
        ", who he claimed represented that dark, venal, and incurably violent side of the American character .  He covered Nixons ": null
    },
    {
        "1972 reelection campaign": "1972 united states presidential election"
    },
    {
        " for Rolling Stone and later collected the stories in book form as  Fear and Loathing on the Campaign Trail 72 .     Thompsons output notably declined from the mid-1970s, as he struggled with the consequences of fame, and he complained that he could no longer merely report on events as he was too easily recognized. He was also known for his lifelong use of ": null
    },
    {
        "alcohol": "alcoholic beverage"
    },
    {
        " and illegal narcotics, his love of ": null
    },
    {
        "firearm": "firearm"
    },
    {
        "s, and his ": null
    },
    {
        "iconoclastic": "iconoclasm"
    },
    {
        " contempt for ": null
    },
    {
        "authoritarianism": "authoritarianism"
    },
    {
        ". He often remarked: I hate to advocate drugs, alcohol, violence, or insanity to anyone, but theyve always worked for me.     Thompson committed suicide at the age of 67, following a series of health problems. In accordance with his wishes, his ashes were fired out of a cannon in a ceremony funded by his friend ": null
    },
    {
        "Johnny Depp": "johnny depp"
    },
    {
        " and attended by friends including then-Senator ": null
    },
    {
        "John Kerry": "john kerry"
    },
    {
        " and ": null
    },
    {
        "Jack Nicholson": "jack nicholson"
    },
    {
        ". ": null
    },
    {
        "Hari Kunzru": "hari kunzru"
    },
    {
        " wrote that the true voice of Thompson is revealed to be that of American moralist  ... one who often makes himself ugly to expose the ugliness he sees around him.        Thompson was born into a middle-class family in ": null
    },
    {
        "Louisville, Kentucky": "louisville, kentucky"
    },
    {
        ", the first of three sons of Virginia Ray Davison , who worked as head librarian at the ": null
    },
    {
        "Louisville Free Public Library": "louisville free public library"
    },
    {
        " and Jack Robert Thompson , a ": null
    },
    {
        "public insurance adjuster": "public insurance adjusting"
    },
    {
        " and ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " veteran.  His parents were introduced to each other by a friend from Jacks fraternity at the ": null
    },
    {
        "University of Kentucky": "university of kentucky"
    },
    {
        " in September 1934, and married on November 2, 1935.  Thompsons first name came from a purported ancestor on his mothers side, the Scottish surgeon ": null
    },
    {
        "John Hunter": "john hunter"
    },
    {
        ".  Hunter Stockton was named for his maternal grandparents, Prestly Stockton Ray and Lucille Hunter.      On December 2, 1943, when Thompson was six years old, the family settled at 2437 Ransdell Avenue in the affluent ": null
    },
    {
        "Cherokee Triangle": "cherokee triangle, louisville"
    },
    {
        " neighborhood of ": null
    },
    {
        "The Highlands": "the highlands"
    },
    {
        ".  On July 3, 1952, when Thompson was 14 years old, his father, aged 58, died of ": null
    },
    {
        "myasthenia gravis": "myasthenia gravis"
    },
    {
        ". Hunter and his brothers were raised by their mother. Virginia worked as a librarian to support her children, and is described as having become a heavy drinker following her husbands death.        Interested in sports and athletically inclined from a young age, Thompson co-founded the Hawks Athletic Club while attending ": null
    },
    {
        "I.N. Bloom Elementary School": "public schools in louisville, kentuckyelementary schools"
    },
    {
        ",  which led to an invitation to join Louisvilles Castlewood Athletic Club, a club for adolescents that prepared them for ": null
    },
    {
        "high-school sports": "amateur sports"
    },
    {
        ". Ultimately he never joined any sports teams in high school.     Thompson attended I.N. Bloom Elementary School,  ": null
    },
    {
        "Highland Middle School": "highland middle school"
    },
    {
        ", and ": null
    },
    {
        "Atherton High School": "atherton high school"
    },
    {
        ", before transferring to ": null
    },
    {
        "Louisville Male High School": "louisville male high school"
    },
    {
        " in September 1952. Also in 1952, he was accepted as a member of the Athenaeum ": null
    },
    {
        "Literary Association": "literary society"
    },
    {
        ", a school-sponsored literary and social club that dated to 1862. Its members at the time, generally drawn from Louisvilles wealthy ": null
    },
    {
        "upper-class": "american upper class"
    },
    {
        " families, included ": null
    },
    {
        "Porter Bibb": "porter bibb"
    },
    {
        ", who later became the first publisher of  Rolling Stone  at Thompsons behest. During this time, Thompson read and admired ": null
    },
    {
        "J.  P. Donleavys": "j. & nbsp;p. donleavy"
    },
    {
        "  The Ginger Man .      As an Athenaeum member, Thompson contributed articles to and helped produce the clubs ": null
    },
    {
        "yearbook": "yearbook"
    },
    {
        " The Spectator. The group ejected Thompson in 1955, citing his legal problems. Charged as an ": null
    },
    {
        "accessory": "accessory"
    },
    {
        " to robbery after being in a car with the perpetrator, Thompson was sentenced to 60 days in Kentuckys ": null
    },
    {
        "Jefferson County": "jefferson county, kentucky"
    },
    {
        " Jail. He served 31 days and, a week after his release, enlisted in the ": null
    },
    {
        "United States Air Force": "united states air force"
    },
    {
        ". While he was in jail, the school ": null
    },
    {
        "superintendent": "superintendent"
    },
    {
        " refused him permission to take his high-school final examinations, and as a result he did not graduate.       Thompson completed ": null
    },
    {
        "basic training": "recruit training"
    },
    {
        " at ": null
    },
    {
        "Lackland Air Force Base": "lackland air force base"
    },
    {
        " in ": null
    },
    {
        "San Antonio, Texas": "san antonio, texas"
    },
    {
        ", and transferred to ": null
    },
    {
        "Scott Air Force Base": "scott air force base"
    },
    {
        " in ": null
    },
    {
        "Belleville, Illinois": "belleville, illinois"
    },
    {
        ", to study ": null
    },
    {
        "electronics": "electronics"
    },
    {
        ". He applied to become an aviator, but the Air Forces ": null
    },
    {
        "aviation": "military aviation"
    },
    {
        "-": null
    },
    {
        "cadet": "cadet"
    },
    {
        " program rejected his application. In 1956, he transferred to ": null
    },
    {
        "Eglin Air Force Base": "eglin air force base"
    },
    {
        " near ": null
    },
    {
        "Fort Walton Beach, Florida": "fort walton beach, florida"
    },
    {
        ". While serving at Eglin, he took evening classes at ": null
    },
    {
        "Florida State University": "florida state university"
    },
    {
        ".  At Eglin, he landed his first professional writing job as ": null
    },
    {
        "sports editor": "sports journalism"
    },
    {
        " of The Command Courier by lying about his job experience. As sports editor, Thompson traveled around the United States with the Eglin Eagles ": null
    },
    {
        "football": "american football"
    },
    {
        " team, covering its games. In early 1957 he wrote a sports column for  The Playground News , a local newspaper in ": null
    },
    {
        "Fort Walton Beach, Florida": "fort walton beach, florida"
    },
    {
        ". His name did not appear on the column because Air Force regulations forbade outside employment.     Thompson was discharged from the Air Force in November 1957 as an ": null
    },
    {
        "Airman First Class": "airman first class"
    },
    {
        ", his commanding officer having recommended him for an early ": null
    },
    {
        "honorable discharge": "honorable discharge"
    },
    {
        ". In summary, this airman, although talented, will not be guided by policy, chief of information services ": null
    },
    {
        "Colonel": "colonel"
    },
    {
        " William S. Evans wrote to the Eglin personnel office. Sometimes his rebel and superior attitude seems to rub off on other airmen staff members.          After leaving the Air Force, Thompson worked as sports editor for a newspaper in ": null
    },
    {
        "Jersey Shore, Pennsylvania": "jersey shore, pennsylvania"
    },
    {
        "  before relocating to New York City. There he audited several courses at the ": null
    },
    {
        "Columbia University School of General Studies": "columbia university school of general studies"
    },
    {
        ". During this time he worked briefly for ": null
    },
    {
        "Time": "time"
    },
    {
        " as a ": null
    },
    {
        "copy boy": "copy boy"
    },
    {
        " for $51 a week. While working, he used a typewriter to copy ": null
    },
    {
        "F. Scott Fitzgeralds": "f. scott fitzgerald"
    },
    {
        "  The Great Gatsby  and ": null
    },
    {
        "Ernest Hemingways": "ernest hemingway"
    },
    {
        "  A Farewell to Arms  in order to learn about the writing styles of the authors. In 1959 Time fired him for ": null
    },
    {
        "insubordination": "insubordination"
    },
    {
        ".  Later that year he worked as a reporter for ": null
    },
    {
        "The Middletown Daily Record": "times herald-record"
    },
    {
        " in ": null
    },
    {
        "Middletown": "middletown, orange county, new york"
    },
    {
        ", New York. He was fired from this job after damaging an office ": null
    },
    {
        "candy machine": "vending machine"
    },
    {
        " and arguing with the owner of a local restaurant who happened to be an advertiser with the paper.     In 1960 Thompson moved to ": null
    },
    {
        "San Juan, Puerto Rico": "san juan, puerto rico"
    },
    {
        " to take a job with the sporting magazine El Sportivo, which folded soon after his arrival. Thompson applied for a job with the Puerto Rican English-language daily  The San Juan Star , but its managing editor, future novelist ": null
    },
    {
        "William J. Kennedy": "william j. kennedy"
    },
    {
        ", turned him down. Nonetheless, the two became friends, and after the demise of El Sportivo Thompson worked as a ": null
    },
    {
        "stringer": "stringer"
    },
    {
        " for the  New York Herald Tribune  and for a few stateside papers on Caribbean issues, with Kennedy working as his editor.   After returning to the United States, Thompson ": null
    },
    {
        "hitchhiked": "hitchhiking"
    },
    {
        " along ": null
    },
    {
        "U.S. Highway 40": "u.s. route 40"
    },
    {
        ", eventually ending up in ": null
    },
    {
        "Big Sur": "big sur"
    },
    {
        " working as a security guard and ": null
    },
    {
        "caretaker": "property caretaker"
    },
    {
        " at ": null
    },
    {
        "Slates Hot Springs": "slates hot springs"
    },
    {
        " for an eight-month period in 1961, just before it became the ": null
    },
    {
        "Esalen Institute": "esalen institute"
    },
    {
        ". While there, he published his first magazine feature  on the ": null
    },
    {
        "artisan": "artisan"
    },
    {
        " and ": null
    },
    {
        "bohemian": "bohemianism"
    },
    {
        " culture of Big Sur.     During this period Thompson wrote two novels,  Prince Jellyfish  and ": null
    },
    {
        "The Rum Diary": "the rum diary"
    },
    {
        ", and submitted many ": null
    },
    {
        "short stories": "short story"
    },
    {
        " to publishers – with little success. The Rum Diary, based on Thompsons experiences in Puerto Rico, was not published until .     From May 1962 to May 1963 Thompson traveled to South America as a correspondent for a ": null
    },
    {
        "Dow Jones": "dow jones  &  company"
    },
    {
        "-owned weekly newspaper, the ": null
    },
    {
        "National Observer": "national observer"
    },
    {
        ".  In ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " he spent several months as a reporter for the Brazil Herald, the countrys only English-language ": null
    },
    {
        "daily": "newspapertypes"
    },
    {
        ", published in ": null
    },
    {
        "Rio de Janeiro": "rio de janeiro"
    },
    {
        ". His longtime girlfriend Sandra Dawn Conklin later joined him in Rio. They married on May 19, 1963, shortly after returning to the United States, and lived briefly in ": null
    },
    {
        "Aspen, Colorado": "aspen, colorado"
    },
    {
        ", where they had a son, Juan Fitzgerald Thompson . Hunter and Sandy divorced in 1980.     In 1964 the family relocated to ": null
    },
    {
        "Glen Ellen, California": "glen ellen, california"
    },
    {
        ", where Thompson continued to write for the National Observer on an array of domestic subjects. One story told of his 1964 visit to ": null
    },
    {
        "Ketchum, Idaho": "ketchum, idaho"
    },
    {
        " to investigate the reasons for ": null
    },
    {
        "Ernest Hemingways": "ernest hemingway"
    },
    {
        " suicide": "ernest hemingwayidaho and suicide"
    },
    {
        ".  While there he stole a pair of ": null
    },
    {
        "elk": "elk"
    },
    {
        " antlers hanging above the front door of Hemingways cabin. Thompson severed his ties with the Observer after his editor refused to print his review of ": null
    },
    {
        "Tom Wolfes": "tom wolfe"
    },
    {
        "1965 essay-collection  The Kandy-Kolored Tangerine-Flake Streamline Baby , Brinkley, Douglas or Sadler, Shelby.  Introduction to letter to Tom Wolfe, p. 43. and moved to San Francisco. He immersed himself in the ": null
    },
    {
        "drug": "drug culture"
    },
    {
        " and ": null
    },
    {
        "hippie": "hippie"
    },
    {
        " culture ": null
    },
    {
        "taking root in the area": "history of san francisco  summer of love   and counterculture movement"
    },
    {
        ", and soon began writing for the ": null
    },
    {
        "Berkeley": "berkeley, california"
    },
    {
        " underground paper": "underground press"
    },
    {
        " Spider.          Hells Angels        In 1965 ": null
    },
    {
        "Carey McWilliams": "carey mcwilliams"
    },
    {
        ", editor of  The Nation , hired Thompson to write a story about the ": null
    },
    {
        "Hells Angels": "hells angels"
    },
    {
        " motorcycle club": "outlaw motorcycle club"
    },
    {
        " in California. The article appeared on May 17, 1965, and after that Thompson received several book offers and spent the next year living and riding with the club. The relationship broke down when the bikers perceived that Thompson was exploiting them for personal gain and demanded a share of the profits from his writings. An argument at a party resulted in Thompson suffering a savage beating . ": null
    },
    {
        "Random House": "random house"
    },
    {
        " published the hard-cover  Hells Angels: The Strange and Terrible Saga of the Outlaw Motorcycle Gangs  in 1966, and the fight between Thompson and the Angels was well-marketed. ": null
    },
    {
        "CBC Television": "cbc television"
    },
    {
        " even broadcast an encounter between Thompson and Hells Angel Skip Workman before a live studio audience.      A reviewer for  The New York Times  praised the work as an angry, knowledgeable, fascinating and excitedly written book , that shows the Hells Angels not so much as dropouts from society but as total misfits, or unfits—emotionally, intellectually and educationally unfit to achieve the rewards, such as they are, that the contemporary ": null
    },
    {
        "social order": "social order"
    },
    {
        " offers . The reviewer also praised Thompson as a spirited, witty, observant and original writer; his ": null
    },
    {
        "prose": "prose"
    },
    {
        " crackles like motorcycle exhaust .   Fremont-Smith, Eliot , Books of The Times; Motorcycle Misfits—Fiction and Fact. The New York Times, p. 33.       Following the success of Hells Angels, Thompson successfully sold articles to several national magazines including  The New York Times Magazine ,  Esquire ,  Pageant , and  Harpers .      In 1967, shortly before the ": null
    },
    {
        "Summer of Love": "summer of love"
    },
    {
        " Thompson wrote The Hashbury is the Capital of the Hippies for The New York Times Magazine. He criticized San Franciscos ": null
    },
    {
        "Hippies": "hippie movement"
    },
    {
        " as devoid of both the political convictions of the ": null
    },
    {
        "New Left": "new left"
    },
    {
        " and the artistic core of the ": null
    },
    {
        "Beats": "beat generation"
    },
    {
        ", resulting in a culture overrun with young people who spent their time in the pursuit of ": null
    },
    {
        "drugs": "psychedelic drug"
    },
    {
        ". The thrust is no longer for change or progress or revolution but merely to escape, to live on the far perimeter of a world that might have been — perhaps should have been — and strike a bargain for survival on purely personal terms, he wrote.      By late 1967, Thompson and his family moved back to Colorado and rented a house in ": null
    },
    {
        "Woody Creek": "woody creek, colorado"
    },
    {
        ", a small mountain hamlet outside Aspen. In early 1969, Thompson received a $15,000 royalty check for the paperback sales of Hells Angels and used two-thirds of the money for a ": null
    },
    {
        "down payment": "down payment"
    },
    {
        " on a modest home and property where he would live for the rest of his life.  He named the house Owl Farm and often described it as his fortified compound.     In early 1968, Thompson signed the ": null
    },
    {
        "Writers and Editors War Tax Protest": "writers and editors war tax protest"
    },
    {
        " pledge, vowing to refuse tax payments in protest against the Vietnam War. Writers and Editors War Tax Protest , New York Post, January 30, 1968. According to Thompsons letters and his later writings, at this time he planned to write a book called The Joint Chiefs about the death of the ": null
    },
    {
        "American Dream": "american dream"
    },
    {
        ". He used a $6,000 advance from ": null
    },
    {
        "Random House": "random house"
    },
    {
        " to travel the 1968 Presidential campaign trail and attend the ": null
    },
    {
        "1968 Democratic Convention": "1968 democratic convention"
    },
    {
        " in Chicago for research. From his hotel room in Chicago, Thompson watched the clashes between police and protesters, which he wrote had a great effect on his political views. The book was never finished, and the theme of the death of the American dream would be carried over into his later work. The contract with Random House was eventually fulfilled with the 1972 book Fear and Loathing in Las Vegas.  He also signed a deal with ": null
    },
    {
        "Ballantine Books": "ballantine books"
    },
    {
        " in 1968 to write a satirical book called The Johnson File about ": null
    },
    {
        "Lyndon B. Johnson": "lyndon b. johnson"
    },
    {
        ". A few weeks after the contract was signed, however, Johnson announced that he would not seek re-election, and the deal was canceled.                 In 1970, Thompson ran for ": null
    },
    {
        "sheriff": "sheriffs in the united states"
    },
    {
        " of ": null
    },
    {
        "Pitkin County, Colorado": "pitkin county, colorado"
    },
    {
        ", as part of a group of citizens running for local offices on the ": null
    },
    {
        " Freak Power ": "the battle of aspen"
    },
    {
        " ticket. The platform included promoting the ": null
    },
    {
        "decriminalization of drugs": "drug liberalization"
    },
    {
        " , tearing up the streets and turning them into grassy ": null
    },
    {
        "pedestrian mall": "pedestrian mall"
    },
    {
        "s, banning any building so tall as to obscure the view of the mountains, disarming all police forces, and renaming Aspen Fat City to deter investors.  Thompson, having shaved his head, referred to the ": null
    },
    {
        "crew cut": "crew cut"
    },
    {
        "-wearing ": null
    },
    {
        "Republican": "republican party"
    },
    {
        " candidate as my ": null
    },
    {
        "long-haired": "hippy"
    },
    {
        " opponent .      With polls showing him with a slight lead in a three-way race, Thompson appeared at Rolling Stone magazine headquarters in San Francisco with a six-pack of beer in hand, and declared to editor ": null
    },
    {
        "Jann Wenner": "jann wenner"
    },
    {
        " that he was about to be elected Sheriff of Aspen, Colorado, and wished to write about the Freak Power movement.  Thus, Thompsons first article in Rolling Stone was published as  The Battle of Aspen  with the byline By: Dr. Hunter S. Thompson . Despite the publicity, Thompson narrowly lost the election. While carrying the city of Aspen, he garnered only 44% of the county-wide vote in what had become a two-way race. The Republican candidate agreed to withdraw a few days before the election in order to consolidate the anti-Thompson votes, in return for the ": null
    },
    {
        "Democrats": "democratic party"
    },
    {
        " withdrawing their candidate for county commissioner. Thompson later remarked that the Rolling Stone article mobilized his opposition far more than his supporters. Hunter S. Thompson ,  Kingdom of Fear , Simon & Schuster, p. 95.          Also in 1970, Thompson wrote an article entitled  The Kentucky Derby Is Decadent and Depraved  for the short-lived ": null
    },
    {
        "new journalism": "new journalism"
    },
    {
        " magazine  Scanlans Monthly . For that article, editor ": null
    },
    {
        "Warren Hinckle": "warren hinckle"
    },
    {
        " paired Thompson with illustrator ": null
    },
    {
        "Ralph Steadman": "ralph steadman"
    },
    {
        ", who drew ": null
    },
    {
        "expressionist": "expressionism"
    },
    {
        " illustrations with lipstick and eyeliner. Thompson and Steadman collaborated regularly after that. Although it was not widely read, the article was the first to use the techniques of ": null
    },
    {
        "Gonzo journalism": "gonzo journalism"
    },
    {
        ", a style Thompson would later employ in almost every literary endeavor. The manic ": null
    },
    {
        "first-person": "first-person narrative"
    },
    {
        " subjectivity of the story was reportedly the result of sheer desperation; he was facing a looming deadline and started sending the magazine pages ripped out of his notebook.     The first use of the word Gonzo to describe Thompsons work is credited to the journalist ": null
    },
    {
        "Bill Cardoso": "bill cardoso"
    },
    {
        ". Cardoso first met Thompson on a bus full of journalists covering the ": null
    },
    {
        "1968 New Hampshire primary": "new hampshire primary1968"
    },
    {
        ". In 1970, Cardoso  wrote to Thompson praising the Kentucky Derby piece as a breakthrough: This is it, this is pure Gonzo. If this is a start, keep rolling. According to Steadman, Thompson took to the word right away and said, Okay, thats what I do. Gonzo.  Thompsons first published use of the word appears in Fear and Loathing in Las Vegas: Free Enterprise. The ": null
    },
    {
        "American Dream": "american dream"
    },
    {
        ". ": null
    },
    {
        "Horatio Alger": "horatio alger"
    },
    {
        " gone mad on drugs in ": null
    },
    {
        "Las Vegas": "las vegas valley"
    },
    {
        ". Do it now: pure Gonzo journalism.     Fear and Loathing in Las Vegas   The book for which Thompson gained most of his fame had its genesis during the research for ": null
    },
    {
        "Strange Rumblings in Aztlan": "strange rumblings in aztlan"
    },
    {
        " , an exposé for Rolling Stone on the 1970 killing of the ": null
    },
    {
        "Mexican-American": "mexican american"
    },
    {
        " television journalist ": null
    },
    {
        "Rubén Salazar": "rubén salazar"
    },
    {
        ". Salazar had been shot in the head at close range with a tear gas canister fired by officers of the ": null
    },
    {
        "Los Angeles County Sheriffs Department": "los angeles county sheriffs department"
    },
    {
        " during the ": null
    },
    {
        "National Chicano Moratorium March": "chicano moratorium"
    },
    {
        " against the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ". One of Thompsons sources for the story was ": null
    },
    {
        "Oscar Zeta Acosta": "oscar zeta acosta"
    },
    {
        ", a prominent Mexican-American activist and attorney. Finding it difficult to talk in the racially tense atmosphere of Los Angeles, Thompson and Acosta decided to travel to Las Vegas, and take advantage of an assignment by  Sports Illustrated  to write a 250-word photograph caption on the ": null
    },
    {
        "Mint 400": "mint 400"
    },
    {
        " motorcycle race held there.     What was to be a short caption quickly grew into something else entirely. Thompson first submitted to Sports Illustrated a manuscript of 2,500 words, which was, as he later wrote, aggressively rejected. Rolling Stone publisher ": null
    },
    {
        "Jann Wenner": "jann wenner"
    },
    {
        " was said to have liked the first 20 or so jangled pages enough to take it seriously on its own terms and tentatively scheduled it for publication  — which gave me the push I needed to keep working on it , Thompson later wrote.      The result of the trip to Las Vegas became the 1972 book Fear and Loathing in Las Vegas, which first appeared in the November 1971 issues of Rolling Stone as a two-part series. It is written as a first-person account by a journalist named ": null
    },
    {
        "Raoul Duke": "raoul duke"
    },
    {
        " on a trip to Las Vegas with ": null
    },
    {
        "Dr. Gonzo": "oscar zeta acosta"
    },
    {
        ", his 300-pound ": null
    },
    {
        "Samoan": "samoans"
    },
    {
        " attorney , to cover a ": null
    },
    {
        "narcotics officers": "prohibition"
    },
    {
        " convention and the fabulous Mint 400 . During the trip, Duke and his companion become sidetracked by a search for the ": null
    },
    {
        "American Dream": "american dream"
    },
    {
        ", with two bags of ": null
    },
    {
        "grass": "cannabis"
    },
    {
        ", seventy-five pellets of ": null
    },
    {
        "mescaline": "mescaline"
    },
    {
        ", five sheets of high-powered ": null
    },
    {
        "blotter acid": "lysergic acid diethylamide"
    },
    {
        ", a salt shaker half full of ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        ", and a whole galaxy of multi-colored ": null
    },
    {
        "uppers": "amphetamine"
    },
    {
        ", ": null
    },
    {
        "downers": "barbiturates"
    },
    {
        ", ": null
    },
    {
        "screamers": "methamphetamine"
    },
    {
        ", ": null
    },
    {
        "laughers": "nitrous oxide"
    },
    {
        "  ... and also a quart of tequila, a quart of rum, a case of Budweiser, a pint of raw ": null
    },
    {
        "ether": "diethyl ether"
    },
    {
        ", and two dozen ": null
    },
    {
        "amyls": "amyl nitrite"
    },
    {
        ".     Coming to terms with the failure of the 1960s ": null
    },
    {
        "countercultural movement": "counterculture"
    },
    {
        " is a major theme of the novel, and the book was greeted with considerable critical acclaim, including being heralded by  The New York Times  as by far the best book yet written on the decade of dope .  The Vegas Book , as Thompson referred to it, was a mainstream success and introduced his Gonzo journalism techniques to a wide public.     Fear and Loathing on the Campaign Trail 72   Beginning in late 1971 Thompson wrote extensively for Rolling Stone on the ": null
    },
    {
        "election campaigns": "u.s. presidential election"
    },
    {
        " of President ": null
    },
    {
        "Richard Nixon": "richard nixon"
    },
    {
        " and his unsuccessful opponent, Senator ": null
    },
    {
        "George McGovern": "george mcgovern"
    },
    {
        ". The articles were soon combined and published as  Fear and Loathing on the Campaign Trail 72 . As the title suggests, Thompson spent nearly all of his time traveling the campaign trail , focusing largely on the ": null
    },
    {
        "Democratic Partys": "democratic party"
    },
    {
        "primaries. Nixon, as the Republican incumbent, performed little campaign work, while McGovern competed with rival candidates ": null
    },
    {
        "Edmund Muskie": "edmund muskie"
    },
    {
        " and ": null
    },
    {
        "Hubert Humphrey": "hubert humphrey"
    },
    {
        ". Thompson was an early supporter of McGovern and wrote unflattering coverage of the rival campaigns in the increasingly widely read Rolling Stone.     Thompson went on to become a fierce critic of Nixon, both during and after his presidency. After Nixons death in 1994, Thompson described him in Rolling Stone as a man who could shake your hand and stab you in the back at the same time , and said his casket have been launched into one of those open-sewage canals that empty into the ocean just south of Los Angeles. He was a swine of a man and a jabbering dupe of a president. was an evil man—evil in a way that only those who believe in the physical reality of the ": null
    },
    {
        "Devil": "devil"
    },
    {
        " can understand it. Thompson, Hunter S.  , Rolling Stone. Following Nixons pardon by Gerald Ford in 1974, Hunter ruminated on the approximately $400,000 pension Nixon maneuvered his way into, by resigning before being formally indicted. While The Washington Post was lamenting Nixons lonely and depressed state after being forced from the White House, Hunter wrote that there were any such thing as true justice in this world, his rancid carcass would be somewhere down around Easter Island right now, in the belly of a hammerhead shark.  There was however one passion shared by Thompson and Nixon: a love of football, discussed in  Fear and Loathing on the Campaign Trail 72 .       Thompsons journalistic work began to seriously suffer after his trip to Africa to cover ": null
    },
    {
        "The Rumble in the Jungle": "the rumble in the jungle"
    },
    {
        " —the world heavyweight boxing match between ": null
    },
    {
        "George Foreman": "george foreman"
    },
    {
        " and ": null
    },
    {
        "Muhammad Ali": "muhammad ali"
    },
    {
        "—in 1974. He missed the match while intoxicated at his hotel, and did not submit a story to the magazine. As Wenner put it to the film critic Roger Ebert in the 2008 documentary Gonzo: The Life and Work of Dr. Hunter S. Thompson, After Africa he just couldnt write. He couldnt piece it together .      Plans for Thompson to cover the ": null
    },
    {
        "1976 presidential campaign": "1976 united states presidential election"
    },
    {
        " for Rolling Stone and later publish a book fell through after Wenner canceled the project without informing Thompson. Wenner then assigned Thompson to travel to ": null
    },
    {
        "Vietnam": "vietnam"
    },
    {
        " to cover what appeared to be the end of the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ". Thompson arrived in ": null
    },
    {
        "Saigon": "ho chi minh city"
    },
    {
        " just as ": null
    },
    {
        "South Vietnam was collapsing": "fall of saigon"
    },
    {
        " and as other journalists were leaving the country. Again, Wenner pulled the plug on the project. The incidents strained Thompsons relationship with Wenner and Rolling Stone.     From the late 1970s on, most of Thompsons literary output appeared as a four-volume series of books entitled  The Gonzo Papers . Beginning with The Great Shark Hunt in 1979 and ending with  Better Than Sex  in 1994, the series is largely a collection of rare newspaper and magazine pieces from the pre-gonzo period, along with almost all of his Rolling Stone pieces.     Starting in about 1980, Thompson became more reclusive. Aside from paid appearances, he largely retreated to his compound in Woody Creek, rejecting projects and assignments or failing to complete them. Despite a lack of new material, Wenner kept Thompson on the Rolling Stone ": null
    },
    {
        "masthead": "masthead"
    },
    {
        " as chief of the National Affairs Desk , a position he would hold until his death.     In 1980, Thompson divorced wife Sandra Conklin. The same year marked the release of  Where the Buffalo Roam , a loose film adaptation based on Thompsons early 1970s work, starring ": null
    },
    {
        "Bill Murray": "bill murray"
    },
    {
        " as the writer. Murray eventually became one of Thompsons trusted friends. Later that year Thompson relocated to ": null
    },
    {
        "Hawaii": "hawaii"
    },
    {
        " to research and write,  The Curse of Lono , a Gonzo-style account of the 1980 ": null
    },
    {
        "Honolulu Marathon": "honolulu marathon"
    },
    {
        ". Extensively illustrated by ": null
    },
    {
        "Ralph Steadman": "ralph steadman"
    },
    {
        ", the piece first appeared in Running in 1981 as The Charge of the Weird Brigade and was later excerpted in  Playboy  in 1983.      In 1983, he covered the ": null
    },
    {
        "U.S. invasion of Grenada": "invasion of grenada"
    },
    {
        " but didnt write or discuss the experiences until the publication of  Kingdom of Fear  in 2003. Later that year, at the behest of ": null
    },
    {
        "Terry McDonell": "terry mcdonell"
    },
    {
        ", he wrote A Dog Took My Place , an exposé for Rolling Stone of the scandalous ": null
    },
    {
        "Roxanne Pulitzer": "roxanne pulitzer"
    },
    {
        " divorce case and what he called the ": null
    },
    {
        "Palm Beach": "palm beach, florida"
    },
    {
        " lifestyle . The story included dubious insinuations of ": null
    },
    {
        "bestiality": "bestiality"
    },
    {
        " but was widely considered to be a return by Thompson to his proper form. In 1985 Thompson accepted an advance to write about couples pornography for Playboy. As part of his research, he spent evenings at the ": null
    },
    {
        "Mitchell Brothers OFarrell Theatre": "mitchell brothers ofarrell theatre"
    },
    {
        " striptease club": "striptease club"
    },
    {
        " in San Francisco. The experience evolved into an as-yet-unpublished novel tentatively entitled The Night Manager.          Thompson next accepted a role as weekly media columnist and critic for  The San Francisco Examiner . The position was arranged by former editor and fellow Examiner columnist Warren Hinckle.  His editor at The Examiner, David McCumber described One week it would be acid-soaked gibberish with a charm of its own. The next week it would be incisive political analysis of the highest order.      Many of these columns were collected in  Gonzo Papers, Vol. 2: Generation of Swine: Tales of Shame and Degradation in the 80s  and  Gonzo Papers, Vol. 3: Songs of the Doomed: More Notes on the Death of the American Dream  , a collection of autobiographical reminiscences, articles and previously unpublished material.     Throughout the early 1990s, Thompson claimed to be at work on a novel entitled  Polo Is My Life . It was briefly excerpted in Rolling Stone in 1994, and Thompson himself described it in 1996 as a sex book  — you know, sex, drugs and rock and roll. Its about the manager of a sex theater whos forced to leave and flee to the mountains. He falls in love and gets in even more trouble than he was in the sex theater in ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " .  The novel was slated to be released by ": null
    },
    {
        "Random House": "random house"
    },
    {
        " in 1999, and was even assigned , but was never published.     Thompson continued to publish irregularly in Rolling Stone, ultimately contributing 17 pieces to the magazine between 1984 and 2004.  Fear and Loathing in Elko, published in 1992, was a well-received fictional rallying cry against the nomination of ": null
    },
    {
        "Clarence Thomas": "clarence thomas"
    },
    {
        " to a seat on the ": null
    },
    {
        "Supreme Court of the United States": "supreme court of the united states"
    },
    {
        ". Trapped in Mr. Bills Neighborhood was a largely factual account of an interview with ": null
    },
    {
        "Bill Clinton": "bill clinton"
    },
    {
        " at a ": null
    },
    {
        "Little Rock, Arkansas": "little rock, arkansas"
    },
    {
        " steakhouse. Rather than traveling the campaign trail as he had done in previous presidential elections, Thompson monitored the proceedings on cable television; Better Than Sex: Confessions of a Political Junkie, his account of the ": null
    },
    {
        "1992 presidential": "1992 united states presidential election"
    },
    {
        " campaign, is composed of reactive faxes to Rolling Stone. In 1994, the magazine published He Was a Crook, a scathing obituary of Richard Nixon.      In November 2004, Rolling Stone published Thompsons final magazine feature The Fun-Hogs in the Passing Lane: Fear and Loathing, Campaign 2004 , a brief account of the 2004 presidential election in which he compared the outcome of the  Bush v. Gore  court case to the ": null
    },
    {
        "Reichstag fire": "reichstag fire"
    },
    {
        " and formally endorsed ": null
    },
    {
        "Senator": "united states senate"
    },
    {
        " John Kerry": "john kerry"
    },
    {
        ", a longtime friend, for president.     Fear and Loathing reduxFear and Loathing in Las Vegas. New editions of the book were published, introducing Thompsons work to a new generation of readers. The same year, an early novel  The Rum Diary  was published, as were the two volumes of collected letters.     Thompsons next, and penultimate, collection,  Kingdom of Fear: Loathsome Secrets of a Star-Crossed Child In the Final Days of the American Century , was widely publicized as Thompsons first memoir. Published in 2003, it combined new material , selected newspaper and digital clippings, and other older works.     Thompson finished his journalism career in the same way it had begun: Writing about sports. From 2000 until his death in 2005, he wrote a weekly column for ": null
    },
    {
        "ESPN": "espn"
    },
    {
        ".coms ": null
    },
    {
        "Page 2": "page 2"
    },
    {
        " entitled Hey, Rube. In 2004 ": null
    },
    {
        "Simon & Schuster": "simon  &  schuster"
    },
    {
        " collected some of the columns from the first few years and released it in mid-2004 as  Hey Rube: Blood Sport, the Bush Doctrine, and the Downward Spiral of Dumbness .     Thompson married assistant Anita Bejmuk on April 23, 2003.       At 5:42  p.m. on February 20, 2005, Thompson died from a ": null
    },
    {
        "suicidal": "suicide"
    },
    {
        " gunshot wound to the head at Owl Farm, his fortified compound in ": null
    },
    {
        "Woody Creek, Colorado": "woody creek, colorado"
    },
    {
        ". His son Juan, daughter-in-law Jennifer, and grandson were visiting for the weekend. His wife Anita, who was at the Aspen Club, was on the phone with him as he cocked the gun. According to the Aspen Daily News, Thompson asked her to come home to help him write his ESPN column, then set the receiver on the counter. Anita said she mistook the cocking of the gun for the sound of his typewriter keys and hung up as he fired. Will and Jennifer were in the next room when they heard the gunshot, but mistook the sound for a book falling and did not check on Thompson immediately. Juan Thompson found his fathers body. According to the police report and Anitas cell phone records,  he called the sheriffs office half an hour later, then walked outside and fired three shotgun blasts into the air to mark the passing of his father . The police report stated that in Thompsons typewriter was a piece of paper with the date Feb. 22 05 and a single word, counselor .      Thompsons inner circle told the press that he had been depressed and always found February a gloomy month, with football season over and the harsh Colorado winter weather. He was also upset over his advancing age and chronic medical problems, including a hip replacement; he would frequently mutter This kid is getting old. Rolling Stone published what Doug Brinkley described as a ": null
    },
    {
        "suicide note": "suicide note"
    },
    {
        " written by Thompson to his wife, titled Football Season Is Over . It read:          Thompsons collaborator and friend ": null
    },
    {
        "Ralph Steadman": "ralph steadman"
    },
    {
        " wrote:            On August 20, 2005, in a private funeral, Thompsons ashes were fired from a cannon. This was accompanied by red, white, blue and green fireworks—all to the tune of ": null
    },
    {
        "Norman Greenbaums": "norman greenbaum"
    },
    {
        " Spirit in the Sky": "spirit in the sky"
    },
    {
        " and ": null
    },
    {
        "Bob Dylans": "bob dylan"
    },
    {
        " Mr. Tambourine Man": "mr. tambourine man"
    },
    {
        " .  The cannon was placed atop a  tower which had the shape of a ": null
    },
    {
        "double-thumbed fist clutching a peyote button": ":file:gonzo.svg"
    },
    {
        ", a symbol originally used in his 1970 campaign for Sheriff of Pitkin County, Colorado. The plans for the monument were initially drawn by Thompson and Steadman, and were shown as part of an  Omnibus  program on the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " titled  Fear and Loathing in Gonzovision  . It is included as a special feature on the second disc of the 2004 ": null
    },
    {
        "Criterion Collection": "criterion collection"
    },
    {
        " DVD release of Fear and Loathing in Las Vegas, and labeled as Fear and Loathing on the Road to Hollywood.     According to his widow, Anita, the $3 million funeral was funded by actor ": null
    },
    {
        "Johnny Depp": "johnny depp"
    },
    {
        ", who was a close friend of Thompson. Depp told the  Associated Press , All Im doing is trying to make sure his last wish comes true. I just want to send my pal out the way he wants to go out. An estimated 280 people attended, including ": null
    },
    {
        "U.S. Senators": "united states senate"
    },
    {
        " John Kerry Patricia Brooks, Jonathan Brooks, Laid to Rest in California: A Guide to the Cemeteries and Grave SItes of the Rich and Famous , p. 321. and ": null
    },
    {
        "George McGovern": "george mcgovern"
    },
    {
        ";  60 Minutes  correspondents ": null
    },
    {
        "Ed Bradley": "ed bradley"
    },
    {
        " and ": null
    },
    {
        "Charlie Rose": "charlie rose"
    },
    {
        "; actors ": null
    },
    {
        "Jack Nicholson": "jack nicholson"
    },
    {
        ", ": null
    },
    {
        "John Cusack": "john cusack"
    },
    {
        ", ": null
    },
    {
        "Bill Murray": "bill murray"
    },
    {
        ", ": null
    },
    {
        "Benicio del Toro": "benicio del toro"
    },
    {
        ", ": null
    },
    {
        "Sean Penn": "sean penn"
    },
    {
        ", and ": null
    },
    {
        "Josh Hartnett": "josh hartnett"
    },
    {
        "; musicians ": null
    },
    {
        "Lyle Lovett": "lyle lovett"
    },
    {
        ", ": null
    },
    {
        "John Oates": "john oates"
    },
    {
        " and ": null
    },
    {
        "David Amram": "david amram"
    },
    {
        ", and artist and long-time friend ": null
    },
    {
        "Ralph Steadman": "ralph steadman"
    },
    {
        ".            Thompson is often credited as the creator of Gonzo journalism, a style of writing that blurs distinctions between fiction and nonfiction. His work and style are considered to be a major part of the ": null
    },
    {
        "New Journalism": "new journalism"
    },
    {
        " literary movement of the 1960s and 1970s, which attempted to break free from the purely objective style of mainstream reportage of the time. Thompson almost always wrote in the ": null
    },
    {
        "first person": "first person narrative"
    },
    {
        ", while extensively using his own experiences and emotions to color the story he was trying to follow.     Despite him having personally described his work as Gonzo , it fell to later observers to articulate what the term actually meant. While Thompsons approach clearly involved injecting himself as a participant in the events of the narrative, it also involved adding invented, metaphoric elements, thus creating, for the uninitiated reader, a seemingly confusing amalgam of facts and fiction notable for the deliberately blurred lines between one and the other. Thompson, in a 1974 interview in  Playboy  addressed the issue himself, saying Unlike Tom Wolfe or Gay Talese, I almost never try to reconstruct a story. Theyre both much better reporters than I am, but then, I dont think of myself as a reporter. ": null
    },
    {
        "Tom Wolfe": "tom wolfe"
    },
    {
        " would later describe Thompsons style as ...  part journalism and part personal memoir admixed with powers of wild invention and wilder rhetoric.  Or as one description of the differences between Thompson and Wolfes styles would elaborate, While Tom Wolfe mastered the technique of being a fly on the wall, Thompson mastered the art of being a ": null
    },
    {
        "fly in the ointment": "fly in the ointment"
    },
    {
        ".      The majority of Thompsons most popular and acclaimed work appeared within the pages of Rolling Stone magazine. Along with ": null
    },
    {
        "Joe Eszterhas": "joe eszterhas"
    },
    {
        " and David Felton, Thompson was instrumental in expanding the focus of the magazine past music criticism; indeed, Thompson was the only staff writer of the epoch never to contribute a music feature to the magazine. Nevertheless, his articles were always peppered with a wide array of pop music references ranging from ": null
    },
    {
        "Howlin Wolf": "howlin wolf"
    },
    {
        " to ": null
    },
    {
        "Lou Reed": "lou reed"
    },
    {
        ". Armed with early ": null
    },
    {
        "fax": "fax"
    },
    {
        " machines wherever he went, he became notorious for haphazardly sending sometimes illegible material to the magazines San Francisco offices as an issue was about to go to press.     Robert Love, Thompsons editor of 23 years at Rolling Stone, wrote that the dividing line between fact and fancy rarely blurred, and we didnt always use italics or some other typographical device to indicate the lurch into the fabulous. But if there were living, identifiable humans in a scene, we took certain steps  ... Hunter was a close friend of many prominent Democrats, veterans of the ten or more presidential campaigns he covered, so when in doubt, wed call the press secretary. People will believe almost any twisted kind of story about politicians or Washington, he once said, and he was right.     Discerning the line between the fact and the fiction of Thompsons work presented a practical problem for editors and fact-checkers of his work. Love called fact-checking Thompsons work one of the sketchiest occupations ever created in the publishing world , and for the first-timer  ... a trip through a journalistic fun house, where you didnt know what was real and what wasnt. You knew you had better learn enough about the subject at hand to know when the riff began and reality ended. Hunter was a stickler for numbers, for details like gross weight and model numbers, for lyrics and ": null
    },
    {
        "caliber": "caliber"
    },
    {
        ", and there was no faking it. Love, Robert.           Thompson often used a blend of fiction and fact when portraying himself in his writing as well, sometimes using the name ": null
    },
    {
        "Raoul Duke": "raoul duke"
    },
    {
        " as an ": null
    },
    {
        "author surrogate": "author surrogate"
    },
    {
        " whom he generally described as a callous, erratic, self-destructive journalist who constantly drank alcohol and took hallucinogenic drugs. Fantasizing about causing bodily harm to others was also a characteristic in his work used to comedic effect and an example of his brand of humor.     In the late sixties, Thompson acquired the ": null
    },
    {
        "title of": "honorary degree"
    },
    {
        " Doctor from the ": null
    },
    {
        "Universal Life Church": "universal life church"
    },
    {
        ".      A number of critics have commented that as he grew older the line that distinguished Thompson from his literary self became increasingly blurred.    Thompson admitted during a 1978 BBC interview that he sometimes felt pressured to live up to the fictional self that he had created, adding Im never sure which one people expect me to be. Very often, they conflict  — most often, as a matter of fact.  ... Im leading a normal life and right alongside me there is this myth, and it is growing and mushrooming and getting more and more warped. When I get invited to, say, speak at universities, Im not sure if they are inviting Duke or Thompson. Im not sure who to be.      Thompsons writing style and eccentric persona gave him a ": null
    },
    {
        "cult following": "cult following"
    },
    {
        " in both literary and drug circles, and his cult status expanded into broader areas after being portrayed three times in major motion pictures. Hence, both his writing style and persona have been widely imitated, and his likeness has even become a popular costume choice for ": null
    },
    {
        "Halloween": "halloween"
    },
    {
        ".        Thompson was a ": null
    },
    {
        "firearms": "firearm"
    },
    {
        "and ": null
    },
    {
        "explosives": "explosive material"
    },
    {
        " enthusiast and owned a vast collection of ": null
    },
    {
        "handgun": "handgun"
    },
    {
        "s, ": null
    },
    {
        "rifle": "rifle"
    },
    {
        "s, ": null
    },
    {
        "shotgun": "shotgun"
    },
    {
        "s, and various ": null
    },
    {
        "automatic": "automatic firearm"
    },
    {
        " and ": null
    },
    {
        "semi-automatic": "semi-automatic firearm"
    },
    {
        " weapons, along with numerous forms of ": null
    },
    {
        "gaseous crowd control": "lachrymatory agent"
    },
    {
        " and many homemade devices. He was a proponent of the ": null
    },
    {
        "right to bear arms": "second amendment to the united states constitution"
    },
    {
        " and ": null
    },
    {
        "privacy rights": "fourth amendment to the united states constitution"
    },
    {
        ".  A member of the ": null
    },
    {
        "National Rifle Association": "national rifle association"
    },
    {
        ",  Thompson was also co-creator of The Fourth Amendment Foundation , an organization to assist victims in defending themselves against unwarranted ": null
    },
    {
        "search and seizure": "search and seizure"
    },
    {
        ".      Part of his work with The Fourth Amendment Foundation centered around support of Lisl Auman, a ": null
    },
    {
        "Colorado": "colorado"
    },
    {
        " woman who was sentenced for ": null
    },
    {
        "life": "life imprisonment"
    },
    {
        " in 1997 under ": null
    },
    {
        "felony murder": "felony murder rule"
    },
    {
        " charges for the death of police officer Bruce VanderJagt, despite contradictory statements and dubious evidence.  Thompson organized rallies, provided legal support, and co-wrote an article in the June 2004 issue of  Vanity Fair  outlining the case. The ": null
    },
    {
        "Colorado Supreme Court": "colorado supreme court"
    },
    {
        " eventually overturned Aumans sentence in March 2005, shortly after Thompsons death, and Auman is now free. Aumans supporters claim Thompsons support and publicity resulted in the successful appeal.      Thompson was also an ardent supporter of ": null
    },
    {
        "drug legalization": "drug liberalization"
    },
    {
        " and became known for his detailed accounts of his own ": null
    },
    {
        "drug use": "recreational drug use"
    },
    {
        ". He was an early supporter of the ": null
    },
    {
        "National Organization for the Reform of Marijuana Laws": "national organization for the reform of marijuana laws"
    },
    {
        " and served on the groups advisory board for over 30 years, until his death.  He told an interviewer in 1997 that drugs should be legalized ross the board. It might be a little rough on some people for a while, but I think its the only way to deal with drugs. Look at ": null
    },
    {
        "Prohibition": "prohibition in the united states"
    },
    {
        ": all it did was make a lot of criminals rich.     In a 1965 letter to his friend Paul Semonin, Thompson explained an affection for the ": null
    },
    {
        "Industrial Workers of the World": "industrial workers of the world"
    },
    {
        ", I have in recent months come to have a certain feeling for ": null
    },
    {
        "Joe Hill": "joe hill"
    },
    {
        " and the Wobbly crowd who, if nothing else, had the right idea. But not the right mechanics. I believe the IWW was probably the last human concept in American politics. Hunter S. Thompson The Proud Highway: 1955–67, Saga of a Desperate Southern Gentleman, p. 509. In another letter to Semonin, Thompson wrote that he agreed with ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        ", and compared him to ": null
    },
    {
        "Thomas Jefferson": "thomas jefferson"
    },
    {
        ". Hunter S. Thompson The Proud Highway, p. 493. In a letter to ": null
    },
    {
        "William Kennedy": "william kennedy"
    },
    {
        ", Thompson confided that he was coming to view the ": null
    },
    {
        "free enterprise": "free enterprise"
    },
    {
        " system as the single greatest evil in the history of human savagery. Hunter S. Thompson The Proud Highway, p. 456. In the documentary  Breakfast with Hunter , Hunter S. Thompson is seen in several scenes wearing different ": null
    },
    {
        "Che Guevara": "che guevara"
    },
    {
        " T-shirts. Additionally, actor and friend ": null
    },
    {
        "Benicio del Toro": "benicio del toro"
    },
    {
        " has stated that Thompson kept a big ": null
    },
    {
        "picture of Che": "guerrillero heroico"
    },
    {
        " in his kitchen.  by Alex Gibney, The Sunday Times, December 14, 2008 Thompson wrote on behalf of African-American rights and the ": null
    },
    {
        "civil rights movement": "civil rights movement"
    },
    {
        ". Hunter S. Thompson, The Great Shark Hunt , pp.  43–51. He strongly criticized the dominance in American society of, what he called, white power structures . Hunter S. Thompson, The Great Shark Hunt, , pp.  44–50.     After the ": null
    },
    {
        "September 11 attacks": "september 11 attacks"
    },
    {
        ", Thompson voiced skepticism regarding the ": null
    },
    {
        "official story on who was responsible for the attacks": "9/11 commission report"
    },
    {
        ". He speculated to several interviewers that it may have been ": null
    },
    {
        "conducted by": "false flag"
    },
    {
        " the U.S. Government or with the governments assistance": "9/11 conspiracy theories"
    },
    {
        ", though readily admitting he had no way to prove his theory.      In 2004, Thompson wrote: ": null
    },
    {
        "Nixon": "richard nixon"
    },
    {
        " was a professional politician, and I despised everything he stood for—but if he were running for president this year against the evil ": null
    },
    {
        "Bush": "george w. bush"
    },
    {
        "–": null
    },
    {
        "Cheney": "dick cheney"
    },
    {
        " gang, I would happily vote for him.               Thompson wrote a number of books, publishing from 1966 to the end of his life. His best-known works include  Hells Angels: The Strange and Terrible Saga of the Outlaw Motorcycle Gangs ,  Fear and Loathing in Las Vegas , and  The Rum Diary .       As a journalist over the course of decades, Thompson published numerous articles in various ": null
    },
    {
        "periodicals": "periodical literature"
    },
    {
        ". He wrote for many publications, including  Rolling Stone ,  Esquire ,  The Boston Globe ,  Chicago Tribune ,  The New York Times ,  The San Francisco Examiner ,  Time ,  Vanity Fair ,  The San Juan Star , and  Playboy . He was also guest editor for a single edition of The Aspen Daily News. A collection of 100 of his columns from The San Francisco Examiner was published in 1988 as  Gonzo Papers, Vol. 2: Generation of Swine: Tales of Shame and Degradation in the 80s . A collection of his articles for Rolling Stone was released in 2011 as  Fear and Loathing at Rolling Stone: The Essential Writings of Hunter S. Thompson . The book was edited by the magazines co-founder and publisher, Jann S. Wenner, who also provided an introduction to the collection.       Thompson wrote many letters, which were his primary means of personal communication. He made ": null
    },
    {
        "carbon copies": "carbon copy"
    },
    {
        " of all his letters, usually typed, a habit begun in his teenage years.     The Fear and Loathing Letters is a three-volume collection of selections from Thompsons correspondence, edited by the historian ": null
    },
    {
        "Douglas Brinkley": "douglas brinkley"
    },
    {
        ". The first volume, The Proud Highway was published in 1997, and contains letters from 1955 to 1967.  Fear and Loathing in America  was published in 2000 and contains letters dating from 1968 to 1976. A third volume, titled The Mutineer: Rants, Ravings, and Missives from the Mountaintop 1977–2005 was edited by Douglas Brinkley and published by Simon & Schuster in 2005. As of March 2019, it has yet to be sold to the public. It contains a special introduction by Johnny Depp.       Accompanying the eccentric and colorful writing of Hunter Thompson, illustrations by British artist ": null
    },
    {
        "Ralph Steadman": "ralph steadman"
    },
    {
        " offer visual representations of the Gonzo style. Steadman and Thompson developed a close friendship, and often traveled together. Though his illustrations occur in most of Thompsons books, they are conspicuously featured in full-page color in Thompsons  The Curse of Lono , set in Hawaii.       Thompson was an avid amateur photographer throughout his life and his photos have been exhibited since his death at art galleries in the United States and United Kingdom. In late 2006, AMMO Books published a limited-edition 224-page collection of Thompson photos called Gonzo: Photographs by Hunter S. Thompson, with an introduction by Johnny Depp. Thompsons snapshots were a combination of the subjects he was covering, stylized self-portraits, and artistic ": null
    },
    {
        "still life": "still life"
    },
    {
        " photos. The  London Observer  called the photos astonishingly good and noted that Thompsons pictures remind us, brilliantly in every sense, of very real people, real colours.        The film  Where the Buffalo Roam  depicts heavily fictionalized attempts by Thompson to cover the ": null
    },
    {
        "Super Bowl": "super bowl"
    },
    {
        " and the ": null
    },
    {
        "1972 U.S. presidential election": "1972 united states presidential election"
    },
    {
        ". It stars ": null
    },
    {
        "Bill Murray": "bill murray"
    },
    {
        " as Thompson and ": null
    },
    {
        "Peter Boyle": "peter boyle"
    },
    {
        " as Thompsons attorney ": null
    },
    {
        "Oscar Zeta Acosta": "oscar zeta acosta"
    },
    {
        ", referred to in the movie as Carl Lazlo, Esq.     ": null
    },
    {
        "The 1998 film adaptation": "fear and loathing in las vegas"
    },
    {
        " of Fear and Loathing in Las Vegas was directed by ": null
    },
    {
        "Monty Python": "monty python"
    },
    {
        " veteran ": null
    },
    {
        "Terry Gilliam": "terry gilliam"
    },
    {
        " and starred ": null
    },
    {
        "Johnny Depp": "johnny depp"
    },
    {
        " as ": null
    },
    {
        "Raoul Duke": "raoul duke"
    },
    {
        " and ": null
    },
    {
        "Benicio del Toro": "benicio del toro"
    },
    {
        " as ": null
    },
    {
        "Dr. Gonzo": "oscar zeta acosta"
    },
    {
        ". The film has achieved something of a ": null
    },
    {
        "cult following": "cult film"
    },
    {
        ".     In the 2001 film  Ali , Thompson is briefly portrayed by actor Lee Cummings.     ": null
    },
    {
        "The film adaptation": "the rum diary"
    },
    {
        " of Thompsons novel  The Rum Diary  was released in October 2011, also starring Johnny Depp as the main character, Paul Kemp. The novels premise was inspired by Thompsons own experiences in Puerto Rico. The film was written and directed by ": null
    },
    {
        "Bruce Robinson": "bruce robinson"
    },
    {
        ".     At a press junket for The Rum Diary shortly before the films release, Depp said that he would like to adapt  The Curse of Lono , ": null
    },
    {
        "The Kentucky Derby Is Decadent and Depraved": "the kentucky derby is decadent and depraved"
    },
    {
        " , and  Hells Angels  for the big screen: Id just keep playing Hunter. Theres a great comfort in it for me, because I get a great visit with my old friend who I miss dearly.         Fear and Loathing in Gonzovision  is an extended television profile by the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ". It can be found on disc 2 of ": null
    },
    {
        "The Criterion Collection": "the criterion collection"
    },
    {
        " edition of Fear and Loathing in Las Vegas.     The ": null
    },
    {
        "Mitchell brothers": "mitchell brothers"
    },
    {
        ", owners of the OFarrell Theatre in San Francisco, made a documentary about Thompson in 1988 called Hunter S. Thompson: The Crazy Never Die.     ": null
    },
    {
        "Wayne Ewing": "wayne ewing"
    },
    {
        " created three documentaries about Thompson. The film  Breakfast with Hunter  was directed and edited by Ewing. It documents Thompsons work on the movie Fear and Loathing in Las Vegas, his arrest for ": null
    },
    {
        "drunk driving": "drunk driving"
    },
    {
        ", and his subsequent fight with the court system. When I Die is a video chronicle of making Thompsons final farewell wishes a reality, and documents the send-off itself. Free Lisl: Fear and Loathing in Denver chronicles Thompsons efforts in helping to free Lisl Auman, who was sentenced to life in prison without parole for the shooting of a police officer, a crime she didnt commit. All three films are only available online.      In Come on Down: Searching for the American Dream  Thompson gives director Adamm Liley insight into the nature of the American Dream over drinks at the Woody Creek Tavern.      Buy the Ticket, Take the Ride: Hunter S. Thompson on Film  was directed by ": null
    },
    {
        "Tom Thurman": "tom thurman"
    },
    {
        ", written by Tom Marksbury, and produced by the ": null
    },
    {
        "Starz Entertainment Group": "starz entertainment group"
    },
    {
        ". The original documentary features interviews with Thompsons inner circle of family and friends, but the thrust of the film focuses on the manner in which his life often overlapped with numerous Hollywood celebrities who became his close friends, such as Johnny Depp, ": null
    },
    {
        "Benicio del Toro": "benicio del toro"
    },
    {
        ", ": null
    },
    {
        "Bill Murray": "bill murray"
    },
    {
        ", ": null
    },
    {
        "Sean Penn": "sean penn"
    },
    {
        ", ": null
    },
    {
        "John Cusack": "john cusack"
    },
    {
        ", Thompsons wife Anita, son Juan, former Senators ": null
    },
    {
        "George McGovern": "george mcgovern"
    },
    {
        " and ": null
    },
    {
        "Gary Hart": "gary hart"
    },
    {
        ", writers ": null
    },
    {
        "Tom Wolfe": "tom wolfe"
    },
    {
        " and ": null
    },
    {
        "William F. Buckley": "william f. buckley, jr."
    },
    {
        ", actors ": null
    },
    {
        "Gary Busey": "gary busey"
    },
    {
        " and ": null
    },
    {
        "Harry Dean Stanton": "harry dean stanton"
    },
    {
        ", and the illustrator ": null
    },
    {
        "Ralph Steadman": "ralph steadman"
    },
    {
        " among others.     Blasted!!! The Gonzo Patriots of Hunter S. Thompson , produced, directed, photographed and edited by Blue Kraning, is a documentary about the scores of fans who volunteered their privately owned artillery to fire the ashes of the late author, Hunter S. Thompson. Blasted!!! premiered at the 2006 Starz Denver International Film Festival, part of a tribute series to Hunter S. Thompson held at the Denver Press Club.     In 2008, ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        "-winning documentarian ": null
    },
    {
        "Alex Gibney": "alex gibney"
    },
    {
        "  wrote and directed a documentary on Thompson, titled  Gonzo: The Life and Work of Dr. Hunter S. Thompson . The film premiered on January 20, 2008, at the ": null
    },
    {
        "Sundance Film Festival": "sundance film festival"
    },
    {
        ". Gibney uses intimate, never-before-seen home videos, interviews with friends, enemies and lovers, and clips from films adapted from Thompsons material to document his turbulent life.       Lou Steins adaptation of Fear and Loathing in Las Vegas was performed at the Battersea Theatre. Stein persuades Londons Time Out magazine to put Thompson up for a fortnight, in exchange for him writing a cover story to publicize the play. Thompson doesnt write the story, but does rampage around London on Time Out s expense account. The play was revived for the Vault Fringe Festival in 2014.     GONZO: A Brutal Chrysalis is a one-man show about Thompson written by Paul Addis, who also played the author. Set in the writing den of Thompsons Woody Creek home, the show portrays his life between 1968 and 1971. James Cartee began playing the role soon after Addiss arrest in 2009, and again after Addiss death in 2012.       Thompson was named a ": null
    },
    {
        "Kentucky colonel": "kentucky colonel"
    },
    {
        " by the Governor of ": null
    },
    {
        "Kentucky": "kentucky"
    },
    {
        " in a December 1996 tribute ceremony where he also received keys to the city of Louisville.    Author ": null
    },
    {
        "Tom Wolfe": "tom wolfe"
    },
    {
        " has called Thompson the greatest American comic writer of the 20th century.   Asked in an interview with Jody Denberg on KGSR Studio, in 2000, whether he would ever consider writing a book like buddy Hunter S. Thompson , the musician ": null
    },
    {
        "Warren Zevon": "warren zevon"
    },
    {
        " responded: Lets remember that Hunter S. Thompson is the finest writer of our generation; he didnt just toss off a book the other day...    Thompson appeared on the cover of the 1,000th issue of Rolling Stone, May 18 – June 1, 2006, as a devil playing the guitar next to the two L s in the word Rolling . Johnny Depp also appeared on the cover.    The Thompson-inspired character ": null
    },
    {
        "Uncle Duke": "uncle duke"
    },
    {
        " appears on a recurring basis in  Doonesbury , the daily newspaper comic strip by ": null
    },
    {
        "Garry Trudeau": "garry trudeau"
    },
    {
        ". When the character was first introduced, Thompson protested, quoted in an interview as saying that he would set Trudeau on fire if the two ever met,  although it was reported that he liked the character in later years. Between March 7, 2005 and March 12, 2005, Doonesbury ran a tribute to Hunter, with Uncle Duke lamenting the death of the man he called his inspiration . The first of these strips featured a panel with artwork similar to that of ": null
    },
    {
        "Ralph Steadman": "ralph steadman"
    },
    {
        ", and later strips featured various ": null
    },
    {
        "non-sequiturs": "non sequitur"
    },
    {
        " which seemed to mirror some of the effects of hallucinogenic drugs described in Fear and Loathing in Las Vegas.   General Hunter Gathers in the ": null
    },
    {
        "Adult Swim": "adult swim"
    },
    {
        " animated series  The Venture Bros. ": null
    }
]