[
    {
        "            Hydropower or water power  is ": null
    },
    {
        "power": "power"
    },
    {
        " derived from the ": null
    },
    {
        "energy": "energy"
    },
    {
        " of falling or fast-running water, which may be harnessed for useful purposes. Since ancient times, hydropower from many kinds of ": null
    },
    {
        "watermills": "watermill"
    },
    {
        "has been used as a ": null
    },
    {
        "renewable energy": "renewable energy"
    },
    {
        " source for ": null
    },
    {
        "irrigation": "irrigation"
    },
    {
        " and the operation of various mechanical devices, such as ": null
    },
    {
        "gristmill": "gristmill"
    },
    {
        "s, ": null
    },
    {
        "sawmill": "sawmill"
    },
    {
        "s, ": null
    },
    {
        "textile": "textile"
    },
    {
        " mills, ": null
    },
    {
        "trip hammer": "trip hammer"
    },
    {
        "s, dock ": null
    },
    {
        "cranes": "crane"
    },
    {
        ", domestic ": null
    },
    {
        "lifts": "elevator"
    },
    {
        ", and ": null
    },
    {
        "ore": "ore"
    },
    {
        " mills. A ": null
    },
    {
        "trompe": "trompe"
    },
    {
        ", which produces compressed air from falling water, is sometimes used to power other machinery at a distance.       In the late 19th century, hydropower became a source for generating ": null
    },
    {
        "electricity": "electricity"
    },
    {
        ". ": null
    },
    {
        "Cragside": "cragside"
    },
    {
        " in Northumberland was the first house powered by ": null
    },
    {
        "hydroelectricity": "hydroelectricity"
    },
    {
        " in 1878  and the first commercial hydroelectric power plant was built at ": null
    },
    {
        "Niagara Falls": "niagara falls"
    },
    {
        " in 1879. In 1881, street lamps in the city of Niagara Falls were powered by hydropower.     Since the early 20th century, the term has been used almost exclusively in conjunction with the modern development of hydroelectric power. International institutions such as the ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        " view hydropower as a means for ": null
    },
    {
        "economic development": "economic development"
    },
    {
        " without adding substantial amounts of carbon to the atmosphere,    but ": null
    },
    {
        "dams": "dam"
    },
    {
        "can have significant negative ": null
    },
    {
        "social": "social impact assessment"
    },
    {
        " and ": null
    },
    {
        "environmental impacts": "environmental impact assessment"
    },
    {
        ". Nikolaisen, Per-Ivar.    Teknisk Ukeblad , 17 January 2015. Retrieved 22 January 2015.                  The earliest evidence of ": null
    },
    {
        "water wheels": "water wheel"
    },
    {
        "and ": null
    },
    {
        "watermills": "watermill"
    },
    {
        "date back to the ": null
    },
    {
        "ancient Near East": "ancient near east"
    },
    {
        " in the 4th century BC, Terry S. Reynolds, Stronger than a Hundred Men: A History of the Vertical Water Wheel, JHU Press, 2002 , p. 14 specifically in the ": null
    },
    {
        "Persian Empire": "persian empire"
    },
    {
        " before 350  BCE, in the regions of ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        ", ": null
    },
    {
        "Iran": "iran"
    },
    {
        ",  and ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ".  In China, watermills were widely used since the ": null
    },
    {
        "Han dynasty": "han dynasty"
    },
    {
        " . In China and the rest of the Far East, hydraulically operated pot wheel pumps raised water into crop or irrigation canals. In the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " , water-powered mills produced flour from grain, and were also used for sawing timber and stone.     The power of a wave of water released from a tank was used for extraction of metal ores in a method known as ": null
    },
    {
        "hushing": "hushing"
    },
    {
        ". The method was first used at the ": null
    },
    {
        "Dolaucothi Gold Mines": "dolaucothi gold mines"
    },
    {
        " in ": null
    },
    {
        "Wales": "wales"
    },
    {
        " from 75 AD onwards, but had been developed in Spain at such mines as ": null
    },
    {
        "Las Médulas": "las médulas"
    },
    {
        ". Hushing was also widely used in ": null
    },
    {
        "Britain": "great britain"
    },
    {
        " in the ": null
    },
    {
        "Medieval": "middle ages"
    },
    {
        " and later periods to extract ": null
    },
    {
        "lead": "lead"
    },
    {
        " and ": null
    },
    {
        "tin": "tin"
    },
    {
        " ores.  It later evolved into ": null
    },
    {
        "hydraulic mining": "hydraulic mining"
    },
    {
        " when used during the ": null
    },
    {
        "California Gold Rush": "california gold rush"
    },
    {
        ".     In the ": null
    },
    {
        "Muslim world": "muslim world"
    },
    {
        " during the ": null
    },
    {
        "Islamic Golden Age": "islamic golden age"
    },
    {
        " and ": null
    },
    {
        "Arab Agricultural Revolution": "arab agricultural revolution"
    },
    {
        " , engineers made wide use of hydropower as well as early uses of ": null
    },
    {
        "tidal power": "tidal power"
    },
    {
        ", ": null
    },
    {
        "Ahmad Y. al-Hassan": "ahmad y. al-hassan"
    },
    {
        " . Taqi al-Din and Arabic Mechanical Engineering, pp. 34–35. Institute for the History of Arabic Science, ": null
    },
    {
        "University of Aleppo": "university of aleppo"
    },
    {
        ". and large hydraulic ": null
    },
    {
        "factory": "factory"
    },
    {
        " complexes. Maya Shatzmiller, p. 36. A variety of water-powered industrial mills were used in the Islamic world, including ": null
    },
    {
        "fulling": "fulling"
    },
    {
        " mills, ": null
    },
    {
        "gristmill": "gristmill"
    },
    {
        "s, ": null
    },
    {
        "paper mill": "paper mill"
    },
    {
        "s, ": null
    },
    {
        "hullers": "rice huller"
    },
    {
        ", ": null
    },
    {
        "sawmill": "sawmill"
    },
    {
        "s, ": null
    },
    {
        "ship mill": "ship mill"
    },
    {
        "s, ": null
    },
    {
        "stamp mill": "stamp mill"
    },
    {
        "s, ": null
    },
    {
        "steel mill": "steel mill"
    },
    {
        "s, ": null
    },
    {
        "sugar mills": "sugar refinery"
    },
    {
        ", and ": null
    },
    {
        "tide mill": "tide mill"
    },
    {
        "s. By the 11th century, every province throughout the Islamic world had these industrial mills in operation, from ": null
    },
    {
        "Al-Andalus": "al-andalus"
    },
    {
        " and ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        " to the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        " and ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        ". Adam Robert Lucas , Industrial Milling in the Ancient and Medieval Worlds: A Survey of the Evidence for an Industrial Revolution in Medieval Europe , Technology and Culture 46 , pp. 1–30 Muslim engineers also used ": null
    },
    {
        "water turbine": "water turbine"
    },
    {
        "s, employed ": null
    },
    {
        "gears": "gear"
    },
    {
        "in watermills and water-raising machines, and pioneered the use of ": null
    },
    {
        "dams": "dams"
    },
    {
        " as a source of water power, used to provide additional power to watermills and water-raising machines. ": null
    },
    {
        "Ahmad Y. al-Hassan": "ahmad y. al-hassan"
    },
    {
        ",       Islamic mechanical engineer ": null
    },
    {
        "Al-Jazari": "al-jazari"
    },
    {
        " described designs for 50 devices, many of them water powered, in his book, The Book of Knowledge of Ingenious Mechanical Devices, including clocks, a device to serve wine, and five devices to lift water from rivers or pools, though three are animal-powered and one can be powered by animal or water. These include ": null
    },
    {
        "an endless belt with jugs attached": "scoop wheel"
    },
    {
        ", a cow-powered ": null
    },
    {
        "shadoof": "shadoof"
    },
    {
        ", and a reciprocating device with hinged valves.       In 1753, French engineer ": null
    },
    {
        "Bernard Forest de Bélidor": "bernard forest de bélidor"
    },
    {
        " published Architecture Hydraulique which described vertical- and horizontal-axis hydraulic machines.  The growing demand for the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " would drive development as well.      ": null
    },
    {
        "Hydraulic power networks": "hydraulic power network"
    },
    {
        "used pipes to carry pressurized water and transmit mechanical power from the source to end users. The power source was normally a head of water, which could also be assisted by a pump. These were extensive in ": null
    },
    {
        "Victorian": "victorian era"
    },
    {
        " cities in the United Kingdom. A hydraulic power network was also developed in ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        ", Switzerland. The world-famous ": null
    },
    {
        "Jet dEau": "jet deau"
    },
    {
        " was originally designed as the over-pressure relief valve for the network.      At the beginning of the Industrial Revolution in Britain, water was the main source of power for new inventions such as ": null
    },
    {
        "Richard Arkwrights": "richard arkwright"
    },
    {
        " water frame": "water frame"
    },
    {
        ".  Although the use of water power gave way to steam power in many of the larger mills and factories, it was still used during the 18th and 19th centuries for many smaller operations, such as driving the bellows in small ": null
    },
    {
        "blast furnaces": "blast furnace"
    },
    {
        "   and ": null
    },
    {
        "gristmill": "gristmill"
    },
    {
        "s, such as those built at ": null
    },
    {
        "Saint Anthony Falls": "saint anthony falls"
    },
    {
        ", which uses the 50-foot drop in the ": null
    },
    {
        "Mississippi River": "mississippi river"
    },
    {
        ".     In the 1830s, at the early peak in the US ": null
    },
    {
        "canal": "canal"
    },
    {
        "-building, hydropower provided the energy to transport ": null
    },
    {
        "barge": "barge"
    },
    {
        " traffic up and down steep hills using ": null
    },
    {
        "inclined plane railroads": "cable railway"
    },
    {
        ". As railroads overtook canals for transportation, canal systems were modified and developed into hydropower systems; the ": null
    },
    {
        "history of Lowell, Massachusetts": "history of lowell, massachusetts"
    },
    {
        " is a classic example of commercial development and industrialization, built upon the availability of water power.      Technological advances had moved the open water wheel into an enclosed ": null
    },
    {
        "turbine": "turbine"
    },
    {
        " or ": null
    },
    {
        "water motor": "water engine"
    },
    {
        ". In 1848 ": null
    },
    {
        "James B. Francis": "james b. francis"
    },
    {
        ", while working as head engineer of Lowells Locks and Canals company, improved on these designs to create a turbine with 90% efficiency. He applied scientific principles and testing methods to the problem of turbine design. His mathematical and graphical calculation methods allowed the confident design of high-efficiency turbines to exactly match a sites specific flow conditions. The ": null
    },
    {
        "Francis reaction turbine": "francis turbine"
    },
    {
        " is still in wide use today. In the 1870s, deriving from uses in the California mining industry, ": null
    },
    {
        "Lester Allan Pelton": "lester allan pelton"
    },
    {
        " developed the high efficiency ": null
    },
    {
        "Pelton wheel impulse turbine": "pelton wheel"
    },
    {
        ", which utilized hydropower from the high head streams characteristic of the mountainous California interior.       A hydropower resource can be evaluated by its available ": null
    },
    {
        "power": "power"
    },
    {
        ". Power is a function of the ": null
    },
    {
        "hydraulic head": "hydraulic head"
    },
    {
        " and ": null
    },
    {
        "volumetric flow rate": "volumetric flow rate"
    },
    {
        ". The head is the energy per unit weight of water. The static head is proportional to the difference in height through which the water falls. Dynamic head is related to the velocity of moving water. Each unit of water can do an amount of work equal to its weight times the head.     The power available from falling water can be calculated from the flow rate and density of water, the height of fall, and the local acceleration due to gravity:     :: \\dot_ -\\eta \\ -\\eta \\     :where   :: \\dot_  is the useful power output    :: \\eta  is the efficiency of the turbine    :: \\dot is the ": null
    },
    {
        "mass flow rate": "mass flow rate"
    },
    {
        "    :: \\rho  is the ": null
    },
    {
        "density": "density"
    },
    {
        " of water    :: \\dot is the ": null
    },
    {
        "volumetric flow rate": "volumetric flow rate"
    },
    {
        "   :: g is the ": null
    },
    {
        "acceleration due to gravity": "standard gravity"
    },
    {
        "    :: \\Delta h  is the difference in height between the outlet and inlet     To illustrate, the power output of a turbine that is 85% efficient, with a flow rate of 80 cubic metres per second and a head of 145 metres , is 97 Megawatts:   : \\dot_ 0.85\\times 1000 \\ \\times 80 \\ \\times 9.81 \\ \\times 145 \\ \\text 97 \\times 10^6 \\ 97 \\ \\text     Operators of hydroelectric stations will compare the total electrical energy produced with the theoretical potential energy of the water passing through the turbine to calculate efficiency. Procedures and definitions for calculation of efficiency are given in test codes such as ": null
    },
    {
        "ASME": "asme"
    },
    {
        " PTC 18 and ": null
    },
    {
        "IEC": "international electrotechnical commission"
    },
    {
        " 60041. Field testing of turbines is used to validate the manufacturers guaranteed efficiency. Detailed calculation of the efficiency of a hydropower turbine will account for the head lost due to flow friction in the power canal or penstock, rise in tail water level due to flow, the location of the station and effect of varying gravity, the temperature and barometric pressure of the air, the density of the water at ambient temperature, and the altitudes above sea level of the forebay and tailbay. For precise calculations, errors due to rounding and the number of ": null
    },
    {
        "significant digits": "significant digit"
    },
    {
        "of constants must be considered.     Some hydropower systems such as ": null
    },
    {
        "water wheels": "water wheel"
    },
    {
        "can draw power from the flow of a body of water without necessarily changing its height. In this case, the available power is the ": null
    },
    {
        "kinetic energy": "kinetic energy"
    },
    {
        " of the flowing water. Over-shot water wheels can efficiently capture both types of energy.    The water flow in a stream can vary widely from season to season. Development of a hydropower site requires analysis of ": null
    },
    {
        "flow records": "streamflow"
    },
    {
        ", sometimes spanning decades, to assess the reliable annual energy supply. Dams and reservoirs provide a more dependable source of power by smoothing seasonal changes in water flow. However reservoirs have significant ": null
    },
    {
        "environmental impact": "environmental impact of reservoirs"
    },
    {
        ", as does alteration of naturally occurring stream flow. The design of dams must also account for the worst-case, probable maximum flood that can be expected at the site; a ": null
    },
    {
        "spillway": "spillway"
    },
    {
        " is often included to bypass flood flows around the dam. A computer ": null
    },
    {
        "model of the hydraulic basin": "hydrological model"
    },
    {
        " and rainfall and snowfall records are used to predict the maximum flood.       Large dams can ruin river ecosystems, cover large areas of land causing green house gas emissions from underwater rotting vegetation and displace thousands of people and affect their livelihood.  BBC, 2018 Moran, Emilio F. et al  Proceedings of the National Academy of Sciences 115.47 : 11891-11898. Web. 30 Oct. 2019.                             Where there is a plentiful head of water it can be made to generate ": null
    },
    {
        "compressed air": "compressed air"
    },
    {
        " directly without moving parts. In these designs, a falling column of water is purposely mixed with air bubbles generated through turbulence or a venturi pressure reducer at the high-level intake. This is allowed to fall down a shaft into a subterranean, high-roofed chamber where the now-compressed air separates from the water and becomes trapped. The height of the falling water column maintains compression of the air in the top of the chamber, while an outlet, submerged below the water level in the chamber allows water to flow back to the surface at a lower level than the intake. A separate outlet in the roof of the chamber supplies the compressed air. A facility on this principle was built on the ": null
    },
    {
        "Montreal River": "montreal river"
    },
    {
        " at Ragged Shutes near ": null
    },
    {
        "Cobalt, Ontario": "cobalt, ontario"
    },
    {
        " in 1910 and supplied 5,000 horsepower to nearby mines.           Hydroelectricity is the application of hydropower to generate electricity.   It is the primary use of hydropower today.   ": null
    },
    {
        "Hydroelectric power plants": "hydroelectric power plant"
    },
    {
        "can include a ": null
    },
    {
        "reservoir": "reservoir"
    },
    {
        "  to exploit the energy of falling water, or can use the ": null
    },
    {
        "kinetic energy": "kinetic energy"
    },
    {
        " of water as in ": null
    },
    {
        "run-of-the-river hydroelectricity": "run-of-the-river hydroelectricity"
    },
    {
        ".   Hydroelectric plants can vary in size from small community sized plants  to very large plants supplying power to a whole country.   As of 2019, the ": null
    },
    {
        "five largest power stations in the world": "list of largest power stations"
    },
    {
        " are conventional hydroelectric power stations with dams.     Hydroelectricity can also be used to store energy in the form of ": null
    },
    {
        "potential energy": "potential energy"
    },
    {
        " between two reservoirs at different heights with ": null
    },
    {
        "pumped-storage hydroelectricity": "pumped-storage hydroelectricity"
    },
    {
        ".   Water is pumped uphill into reservoirs during periods of low demand to be released for generation when demand is high or system generation is low.     Other forms of electricity generation with hydropower include ": null
    },
    {
        "tidal stream generators": "tidal stream generator"
    },
    {
        "using energy from ": null
    },
    {
        "tidal power": "tidal power"
    },
    {
        " generated from oceans, rivers, and human-made canal systems to generating electricity.  ": null
    },
    {
        "conventional": "hydroelectricitygenerating methods"
    },
    {
        " Chief Joseph Dam": "chief joseph dam"
    },
    {
        " near ": null
    },
    {
        "Bridgeport, Washington": "bridgeport, washington"
    },
    {
        ", is a major ": null
    },
    {
        "run-of-the-river station": "run-of-the-river hydroelectricity"
    },
    {
        " Micro hydro": "micro hydro"
    },
    {
        " Ffestiniog Pumped Storage Scheme": "ffestiniog power station"
    },
    {
        " in ": null
    },
    {
        "Wales": "wales"
    }
]