[
    {
        "           I, Robot is a ": null
    },
    {
        "fixup": "Fixup"
    },
    {
        " novel of ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        " short stories or essays by American writer ": null
    },
    {
        "Isaac Asimov": "Isaac Asimov"
    },
    {
        ". The stories originally appeared in the American magazines  Super Science Stories  and  Astounding Science Fiction  between 1940 and 1950 and were then compiled into a book for stand-alone publication by ": null
    },
    {
        "Gnome Press": "Gnome Press"
    },
    {
        " in 1950, in an initial edition of 5,000 copies. The stories are woven together by a ": null
    },
    {
        "framing narrative": "Framing Narrative"
    },
    {
        " in which the fictional Dr. ": null
    },
    {
        "Susan Calvin": "Susan Calvin"
    },
    {
        " tells each story to a reporter in the 21st century. Although the stories can be read separately, they share a theme of the interaction of humans, ": null
    },
    {
        "robot": "Robot"
    },
    {
        "s, and ": null
    },
    {
        "morality": "Morality"
    },
    {
        ", and when combined they tell a larger story of Asimovs fictional history of ": null
    },
    {
        "robotics": "Robotics"
    },
    {
        ".     Several of the stories feature the character of Dr. Calvin, chief ": null
    },
    {
        "robopsychologist": "Robopsychology"
    },
    {
        " at ": null
    },
    {
        "U.S. Robots and Mechanical Men": "U.S. Robots And Mechanical Men"
    },
    {
        ", Inc., the major manufacturer of robots. Upon their publication in this collection, Asimov wrote a ": null
    },
    {
        "framing sequence": "Framing Sequence"
    },
    {
        " presenting the stories as Calvins reminiscences during an interview with her about her lifes work, chiefly concerned with aberrant behaviour of robots and the use of ": null
    },
    {
        "robopsychology": "Robopsychology"
    },
    {
        " to sort out what is happening in their ": null
    },
    {
        "positronic brain": "Positronic Brain"
    },
    {
        ". The book also contains the short story in which Asimovs ": null
    },
    {
        "Three Laws of Robotics": "Three Laws Of Robotics"
    },
    {
        " first appear, which had large influence on later science fiction and had impact on thought on ": null
    },
    {
        "ethics of artificial intelligence": "Ethics Of Artificial Intelligence"
    },
    {
        " as well. Other characters that appear in these short stories are ": null
    },
    {
        "Powell and Donovan": "Powell And Donovan"
    },
    {
        ", a field-testing team which locates flaws in USRMMs prototype models.     The collection shares a title with the 1939 short story ": null
    },
    {
        "I, Robot": "I, Robot"
    },
    {
        " by ": null
    },
    {
        "Eando Binder": "Eando Binder"
    },
    {
        " , which greatly influenced Asimov. Asimov had wanted to call his collection Mind and Iron and objected when the publisher made the title the same as Binders. In his introduction to the story in Isaac Asimov Presents the Great SF Stories , Asimov wrote:            Introduction   ": null
    },
    {
        "Robbie": "Robbie"
    },
    {
        "   Runaround": "Runaround"
    },
    {
        "   Reason": "Reason"
    },
    {
        "   Catch That Rabbit": "Catch That Rabbit"
    },
    {
        "   Liar!": "Liar!"
    },
    {
        "   Little Lost Robot": "Little Lost Robot"
    },
    {
        "   Escape!": "Escape!"
    },
    {
        "   Evidence": "Evidence"
    },
    {
        "   The Evitable Conflict": "The Evitable Conflict"
    },
    {
        "        The New York Times  described I, Robot as an exciting science thriller could be fun for those whose nerves are not already made raw by the potentialities of the atomic age. Realm of the Spacemen,  The New York Times Book Review , February 4, 1951   Describing it as continuously fascinating , ": null
    },
    {
        "Groff Conklin": "Groff Conklin"
    },
    {
        " Unreservedly recommended the book.  ": null
    },
    {
        "P. Schuyler Miller": "P. Schuyler Miller"
    },
    {
        " recommended the collection For puzzle situations, for humor, for warm character, for most of the values of plain good writing . Book Reviews ,  Astounding Science Fiction , September 1951, pp. 124–25.           At least three of the short stories from I, Robot have been adapted for television. The first was a 1962 episode of  Out of this World  hosted by ": null
    },
    {
        "Boris Karloff": "Boris Karloff"
    },
    {
        " called ": null
    },
    {
        "Little Lost Robot": "Little Lost Robot"
    },
    {
        " with ": null
    },
    {
        "Maxine Audley": "Maxine Audley"
    },
    {
        " as ": null
    },
    {
        "Susan Calvin": "Susan Calvin"
    },
    {
        ". Two short stories from the collection were made into episodes of  Out of the Unknown : The Prophet , based on ": null
    },
    {
        "Reason": "Reason"
    },
    {
        " ; and ": null
    },
    {
        "Liar!": "Liar!"
    },
    {
        " .  The 12th episode of the ": null
    },
    {
        "USSR": "Ussr"
    },
    {
        " science fiction TV series  This Fantastic World , filmed in 1987 and entitled Dont Joke with Robots, was based on works by ": null
    },
    {
        "Aleksandr Belyaev": "Aleksandr Belyaev"
    },
    {
        " and ": null
    },
    {
        "Fredrik Kilander": "Fredrik Kilander"
    },
    {
        " as well as Asimovs ": null
    },
    {
        "Liar!": "Liar!"
    },
    {
        " story.        Both the ": null
    },
    {
        "original": "The Outer Limits"
    },
    {
        " and ": null
    },
    {
        "revival series": "The Outer Limits"
    },
    {
        " of The Outer Limits include episodes named I, Robot ; however, both are adaptations of the Earl and Otto Binder story of that name and are unconnected with Asimovs work.           In the late 1970s, ": null
    },
    {
        "Warner Bros.": "Warner Bros."
    },
    {
        " acquired the ": null
    },
    {
        "option": "Option"
    },
    {
        " to make a film based on the book, but no screenplay was ever accepted. The most notable attempt was one by ": null
    },
    {
        "Harlan Ellison": "Harlan Ellison"
    },
    {
        ", who collaborated with Asimov himself to create a version which captured the spirit of the original. Asimov is quoted as saying that this screenplay would lead to the first really adult, complex, worthwhile science fiction movie ever made.     Ellisons script builds a framework around Asimovs short stories that involves a reporter named Robert Bratenahl tracking down information about Susan Calvins alleged former lover Stephen Byerly. Asimovs stories are presented as ": null
    },
    {
        "flashbacks": "Flashback"
    },
    {
        "that differ from the originals in their stronger emphasis on Calvins character. Ellison placed Calvin into stories in which she did not originally appear and fleshed out her characters role in ones where she did. In constructing the script as a series of flashbacks that focused on character development rather than action, Ellison used the film  Citizen Kane  as a model.      Although acclaimed by critics, the screenplay is generally considered to have been unfilmable based upon the technology and average film budgets of the time. Asimov also believed that the film may have been scrapped because of a conflict between Ellison and the producers: when the producers suggested changes in the script, instead of being diplomatic as advised by Asimov, Ellison reacted violently and offended the producers. Isaac Asimov, Hollywood and I . In  Asimovs Science Fiction , May 1979. The script was serialized in  Asimovs Science Fiction  magazine in late 1987, and eventually appeared in book form under the title I, Robot: The Illustrated Screenplay, in 1994 .          The film ": null
    },
    {
        "I, Robot": "I, Robot"
    },
    {
        ", starring ": null
    },
    {
        "Will Smith": "Will Smith"
    },
    {
        ", was released by ": null
    },
    {
        "Twentieth Century Fox": "Twentieth Century Fox"
    },
    {
        " on July 16, 2004 in the United States. Its plot incorporates elements of ": null
    },
    {
        "Little Lost Robot": "Little Lost Robot"
    },
    {
        " , some of Asimovs character names and the Three Laws. However, the plot of the movie is mostly original work adapted from the screenplay Hardwired by ": null
    },
    {
        "Jeff Vintar": "Jeff Vintar"
    },
    {
        ", completely unlinked to Asimovs stories  and has been compared to Asimovs  The Caves of Steel , which revolves around the murder of a roboticist . Unlike the books by Asimov, the movie featured hordes of killer robots.       ": null
    },
    {
        "BBC Radio 4": "Bbc Radio 4"
    },
    {
        " aired an audio drama adaptation of five of the I, Robot stories on their ": null
    },
    {
        "15 Minute Drama": "15 Minute Drama"
    },
    {
        " in 2017, dramatized by Richard Kurti and starring ": null
    },
    {
        "Hermione Norris": "Hermione Norris"
    },
    {
        ".   Robbie    Reason    Little Lost Robot    Liar    The Evitable Conflict    These also aired in a single program on ": null
    },
    {
        "BBC Radio 4 Extra": "Bbc Radio 4 Extra"
    },
    {
        " as Isaac Asimovs I, Robot: Omnibus.               ": null
    },
    {
        "Mickey Zucker Reichert": "Mickey Zucker Reichert"
    },
    {
        " was asked to write three prequels of I, Robot by Asimovs estate, because she is a science fiction writer with a medical degree. She first met Asimov when she was 23, although she did not know him well. She is the first female writer to be authorized to write stories based on Asimovs novels; follow-ups to his Foundation series were written by ": null
    },
    {
        "Gregory Benford": "Gregory Benford"
    },
    {
        ", ": null
    },
    {
        "Greg Bear": "Greg Bear"
    },
    {
        " and ": null
    },
    {
        "David Brin": "David Brin"
    },
    {
        ". The prequels were ordered by ": null
    },
    {
        "Berkley Books": "Berkley Books"
    },
    {
        ", and consist of:     I Robot: To Protect   I Robot: To Obey   I Robot: To Preserve          In 2004  The Saturday Evening Post  said that I, Robots Three Laws revolutionized the science fiction genre and made robots far more interesting than they ever had been before. I, Robot has influenced many aspects of modern popular culture, particularly with respect to science fiction and technology. One example of this is in the technology industry. The name of the real-life modem manufacturer named U.S. Robotics was directly inspired by I, Robot. The name is taken from the name of a robot manufacturer that appears throughout Asimovs robot short stories. U.S. Robotics Press Kit, 2004, p3     Many works in the field of science fiction have also paid homage to Asimovs collection.     An episode of the original ": null
    },
    {
        "Star Trek": "Star Trek: The Original Series"
    },
    {
        " series, I, Mudd , which depicts a planet of androids in need of humans references I, Robot. Another reference appears in the title of a ": null
    },
    {
        "Star Trek: The Next Generation": "Star Trek: The Next Generation"
    },
    {
        " episode, I, Borg , in which Geordi La Forge befriends a lost member of the Borg collective and teaches it a sense of individuality and free will.     ": null
    },
    {
        "Doctor Who": "Doctor Who"
    },
    {
        "s 1977 story, ": null
    },
    {
        "The Robots of Death": "The Robots Of Death"
    },
    {
        ", references I, Robot with the First Principle stating: It is forbidden for robots to harm humans .     In ": null
    },
    {
        "Aliens": "Aliens"
    },
    {
        ", a 1986 movie, the synthetic person Bishop paraphrases Asimovs First Law in the line: It is impossible for me to harm, or by omission of action allow to be harmed, a human being.     An episode of ": null
    },
    {
        "The Simpsons": "The Simpsons"
    },
    {
        " entitled I Doh Bot has Professor Frink build a robot named Smashius Clay that follows all three of Asimovs laws of robotics.     The animated science fiction/comedy ": null
    },
    {
        "Futurama": "Futurama"
    },
    {
        " makes several references to I, Robot. The title of the episode I, Roommate is a spoof on I, Robot although the plot of the episode has little to do with the original stories. Additionally, the episode The Cyber House Rules included an optician named Eye Robot and the episode Anthology of Interest II included a segment called I, Meatbag. Also in Benders Game the psychiatrist is shown a logical fallacy and explodes when the assistant shouts Liar! a la Liar! . Leela once told Bender to cover his ears so that he would not hear the robot-destroying paradox which she used to destroy Robot Santa , causing a total breakdown; additionally, Bender has stated that he is Three Laws Safe.     The positronic brain , which Asimov named his robots central processors, is what powers Data from Star Trek: The Next Generation, as well as other Soong type androids. Positronic brains have been referenced in a number of other television shows including ": null
    },
    {
        "Doctor Who": "Doctor Who"
    },
    {
        ", ": null
    },
    {
        "Once Upon a Time... Space": "Once Upon A Time... Space"
    },
    {
        ", ": null
    },
    {
        "Perry Rhodan": "Perry Rhodan"
    },
    {
        ", ": null
    },
    {
        "The Number of the Beast": "The Number Of The Beast"
    },
    {
        ", and others.     Author Cory Doctorow has written a story called I, Robot as homage to Asimov, Doctorow, Cory. Cory Doctorows Craphound.com . http://www.craphound.com/?p189 as well as I, Row-Boat , both released in the short story collection ": null
    },
    {
        "Overclocked: Stories of the Future Present": "Overclocked: Stories Of The Future Present"
    },
    {
        ". He has also said, If I return to this theme, it will be with a story about uplifted cheese sandwiches, called I, Rarebit. Doctorow, Cory. Cory Doctorows Craphound.com . http://www.craphound.com/?p1676     Other cultural references to the book are less directly related to science fiction and technology. The 1977 album ": null
    },
    {
        "I Robot": "I Robot"
    },
    {
        ", by The Alan Parsons Project , was inspired by Asimovs I, Robot. In its original conception, the album was to follow the themes and concepts presented in the short story collection. The Alan Parsons Project were not able to obtain the rights in spite of Asimovs enthusiasm; he had already assigned the rights elsewhere. Thus, the albums concept was altered slightly although the name was kept . The 2009 album, ": null
    },
    {
        "I, Human": "I, Human"
    },
    {
        ", by Singaporean band Deus Ex Machina draws heavily upon Asimovs principles on robotics and applies it to the concept of cloning.     The Indian science fiction film ": null
    },
    {
        "Endhiran": "Endhiran"
    },
    {
        ", released in 2010, refers to Asimovs three laws for artificial intelligence for the fictional character Chitti: The Robot. When a scientist takes in the robot for evaluation, the panel enquires whether the robot was built using the Three Laws of Robotics.     The theme for Burning Man 2018 was I, Robot .                                              ": null
    }
]