[
    {
        "                     The Iazyges , were an ancient ": null
    },
    {
        "Sarmatian": "sarmatians"
    },
    {
        " tribe that traveled westward in BC from ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        " to the ": null
    },
    {
        "steppe": "steppe"
    },
    {
        "s of what is now Ukraine. In BC, they moved into modern-day Hungary and Serbia near the ": null
    },
    {
        "Dacia": "dacia"
    },
    {
        "n steppe between the ": null
    },
    {
        "Danube": "danube river"
    },
    {
        " and ": null
    },
    {
        "Tisza": "tisza river"
    },
    {
        " rivers, where they adopted a semi-": null
    },
    {
        "sedentary": "sedentism"
    },
    {
        " lifestyle.     In their early relationship with ": null
    },
    {
        "Rome": "roman empire"
    },
    {
        ", the Iazyges were used as a ": null
    },
    {
        "buffer state": "buffer state"
    },
    {
        " between the Romans and the Dacians; this relationship later developed into one of overlord and ": null
    },
    {
        "client state": "client state"
    },
    {
        ", with the Iazyges being nominally sovereign subjects of Rome. Throughout this relationship, the Iazyges carried out raids on Roman land, which often caused ": null
    },
    {
        "punitive expedition": "punitive expedition"
    },
    {
        "s to be made against them.     Almost all of the major events of the Iazyges, such as the two ": null
    },
    {
        "Dacian Wars": "trajans dacian wars"
    },
    {
        "—in both of which the Iazyges fought, assisting Rome in subjugating the Dacians in the first war and conquering them in the second—are connected with war. Another such war is the ": null
    },
    {
        "Marcomannic War": "marcomannic war"
    },
    {
        " that occurred between 42 and 42 in which the Iazyges fought against Rome but were defeated by ": null
    },
    {
        "Marcus Aurelius": "marcus aurelius"
    },
    {
        " and had severe penalties imposed on them.            Although the Iazyges were ": null
    },
    {
        "nomad": "nomad"
    },
    {
        "s before their migration to the Tisza plain, they became semi-sedentary once there, and lived in towns, although they migrated between these towns to allow their cattle to ": null
    },
    {
        "graze": "grazing"
    },
    {
        ". Their language was a dialect of ": null
    },
    {
        "Old Iranian": "old iranian"
    },
    {
        ", which was quite different from most of the other Sarmatian dialects of Old Iranian. According to the Roman writer ": null
    },
    {
        "Gaius Valerius Flaccus": "gaius valerius flaccus"
    },
    {
        ", when an Iazyx became too old to fight in battle, they were killed by their sons or, according to Roman geographer ": null
    },
    {
        "Pomponius Mela": "pomponius mela"
    },
    {
        ", threw themselves from a rock.       The Iazyges name was ": null
    },
    {
        "Latinized": "latinisation of names"
    },
    {
        " as   or , or sometimes as . They were occasionally referred to as the , , , , and Iazuges. Several corruptions of these names, such as , , , and  existed. The root of the name may be ": null
    },
    {
        "Proto-Iranian": "proto-iranian language"
    },
    {
        " yaz-, to sacrifice , perhaps indicating a caste or tribe specializing in religious sacrifices.        According to ": null
    },
    {
        "Peter Edmund Laurent": "wikisource:laurent, peter edmund"
    },
    {
        " , a French classical scholar, the Iazyges Metanastæ, a warlike Sarmatian race, which had migrated during the reign of the Roman Emperor ": null
    },
    {
        "Claudius": "claudius"
    },
    {
        ", and therefore received the name of Metanastæ , resided in the mountains west of the Theiss  and east of the Gran and ": null
    },
    {
        "Danube": "danube"
    },
    {
        ". The Greek Metanastæ  means migrants . The united Scythians and Sarmatæ called themselves Iazyges, which in Sclavonic signifies  the people .            The graves made by the Iazyges were often rectangular or circular, although some were ovoid, hexagonal, or even octagonal. They were flat and were grouped like burials in modern cemeteries. Most of the graves access openings face south, southeast, or southwest. The access openings are between  and  wide. The graves themselves are between  and  in diameter.     After their migration to the Tisza plain, the Iazyges were in serious poverty. This is reflected in the poor furnishings found at burial sites, which are often filled with clay vessels, beads, and sometimes brooches. Iron daggers and swords were very rarely found in the burial site. Their brooches and arm-rings were of the ": null
    },
    {
        "La Tène type": "la tène culture"
    },
    {
        ", showing the Dacians had a distinct influence on the Iazyges. Later tombs showed an increase in material wealth; tombs of the 42nd to early 42th century had weapons in them 42% of the time and armor in them 42% of the time. Iazygian tombs along the Roman border show a strong Roman influence.            The Iazyges used hanging, asymmetrical, barrel-shaped pots that had uneven weight distribution. The rope used to hang the pot was wrapped around the edges of the side collar; it is believed the rope was tied tightly to the pot, allowing it to spin in circles. Due to the spinning motion, there are several theories about the pots uses. It is believed the small hanging pots were used to ferment alcohol using the seeds of touch-me-not balsam , and larger hanging pots were used to churn butter and make cheese. The Iazyges were cattle breeders; they required salt to preserve their meat but there were no salt mines within their territory. According to ": null
    },
    {
        "Cassius Dio": "cassius dio"
    },
    {
        ", the Iazyges received grain from the Romans.       The Iazyges wore heavy armor, such as ": null
    },
    {
        "Sugarloaf helm": "sugarloaf helm"
    },
    {
        "s, and ": null
    },
    {
        "scale armor": "scale armor"
    },
    {
        " made of iron, bronze, ": null
    },
    {
        "horn": "horn"
    },
    {
        ", or ": null
    },
    {
        "horse hoof": "horse hoof"
    },
    {
        ", which was sown onto a leather gown so the scales would partially overlap. They used long, two-handed lances called ": null
    },
    {
        "Contus": "contus"
    },
    {
        "; they wielded these from horses, which they ": null
    },
    {
        "barded": "barding"
    },
    {
        ". Their military was exclusively cavalry. They are believed to have used ": null
    },
    {
        "saddle blanket": "saddle blanket"
    },
    {
        "s on their horses. Although it was originally ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        "ic, it is believed the Iazyges used the ": null
    },
    {
        "Carnyx": "carnyx"
    },
    {
        ", a trumpet-like wind instrument.       One of the Iazygian towns, ": null
    },
    {
        "Bormanon": "bormanon"
    },
    {
        ", is believed to have had ": null
    },
    {
        "hot spring": "hot spring"
    },
    {
        "s because settlement names starting with Borm were commonly used among European tribes to denote that the location had hot springs, which held religious importance for many ": null
    },
    {
        "Celtic": "celts"
    },
    {
        " tribes. It is not known, however, whether the religious significance of the hot springs was passed on to the Iazyges with the concept itself. The Iazyges used horse-tails in their religious rituals.       When the Iazyges migrated to the plain between the Tisza and the Danube, their economy suffered severely. Many explanations have been offered for this, such as their trade with the ": null
    },
    {
        "Pontic Steppe": "pontic steppe"
    },
    {
        " and ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        " being cut off and the absence of any mineable resources within their territory making their ability to trade negligent. Additionally, Rome proved more difficult to raid than the Iazyges previous neighbors, largely due to Romes ": null
    },
    {
        "well-organized army": "roman army"
    },
    {
        ". The Iazyges had no large-scale organized production of goods for most of their history. As such, most of their trade goods were gained via small-scale raids upon neighboring peoples, although they did have some incidental horticulture. Several pottery workshops have been found in ": null
    },
    {
        "Banat": "banat"
    },
    {
        ", which was within the territory of the Iazyges, close to their border with Rome. These pottery workshops were built from the late 42rd century and have been found at ": null
    },
    {
        "Vršac–Crvenka": "vršac–crvenka"
    },
    {
        ", ": null
    },
    {
        "Grădinari–Selişte": "grădinari–selişte"
    },
    {
        ", ": null
    },
    {
        "Timişoara–Freidorf": "timişoara–freidorf"
    },
    {
        ", ": null
    },
    {
        "Timişoara–Dragaşina": "timişoara–dragaşina"
    },
    {
        ", ": null
    },
    {
        "Hodoni": "hodoni"
    },
    {
        ", ": null
    },
    {
        "Pančevo": "pančevo"
    },
    {
        ", ": null
    },
    {
        "Dolovo": "dolovo, pančevo"
    },
    {
        ", and ": null
    },
    {
        "Izvin şi Jabuca": "izvin şi jabuca"
    },
    {
        ".     The Iazyges trade with the Pontic Steppe and Black Sea was extremely important to their economy; after the Marcomannic War, Marcus Aurelius offered them the concession of movement through Dacia to trade with the ": null
    },
    {
        "Roxolani": "roxolani"
    },
    {
        ", which reconnected them with the Pontic Steppe trade network. This trade route lasted until 42 when the ": null
    },
    {
        "Goths": "goths"
    },
    {
        " took over ": null
    },
    {
        "Tyras": "tyras"
    },
    {
        " and ": null
    },
    {
        "Olbia": "olbia"
    },
    {
        ", cutting off both the Roxolanis and the Iazyges trade with the Pontic Steppe. The Iazyges also traded with the Romans, although this trade was smaller in scale. While there are ": null
    },
    {
        "Roman bronze coins": "roman currency"
    },
    {
        " scattered along the entirety of the Roman ": null
    },
    {
        "Danubian Limes": "danubian limes"
    },
    {
        ", the highest concentration of them appear in the Iazyges terrirory.       Because the Iazyges had no organized production for most of their history, imported pottery finds are sparse. Some goods, such as bronze or silver vessels, ": null
    },
    {
        "amphorae": "amphorae"
    },
    {
        ", terracotta wares, and lamps are extremely rare or nonexistent. Some amphorae and lamps have been found in Iazygian territory, often near major river crossings near the border with Rome, but the location of the sites make it impossible to determine whether these goods are part of an Iazygain site, settlement, or cemetery; or merely the lost possessions of Roman soldiers stationed in or near the locations.     The most commonly found imported ware was  Terra sigillata . At Iazygian cemeteries, a single complete terra sigillata vessel and a large number of fragments have been found in Banat.  Terra sigillata  finds in Iazygian settlements are confusing in some cases; it can sometimes be impossible to determine the timeframe of the wares in relation to its area and thus impossible to determine whether the wares came to rest there during Roman times or after the Iazyges took control. Finds of terra sigillata of an uncertain age have been found in ": null
    },
    {
        "Deta": "deta, romania"
    },
    {
        ", ": null
    },
    {
        "Kovačica–Čapaš": "kovačica–čapaš"
    },
    {
        ", ": null
    },
    {
        "Kuvin": "kuvin"
    },
    {
        ", ": null
    },
    {
        "Banatska Palanka": "banatska palanka"
    },
    {
        ", ": null
    },
    {
        "Pančevo": "pančevo"
    },
    {
        ", ": null
    },
    {
        "Vršac": "vršac"
    },
    {
        ", ": null
    },
    {
        "Zrenjanin–Batka": "zrenjanin–batka"
    },
    {
        ", ": null
    },
    {
        "Dolovo": "dolovo, pančevo"
    },
    {
        ", ": null
    },
    {
        "Delibata": "delibata"
    },
    {
        ", ": null
    },
    {
        "Perlez": "perlez"
    },
    {
        ", ": null
    },
    {
        "Aradac": "aradac"
    },
    {
        ", ": null
    },
    {
        "Botoš": "botoš"
    },
    {
        ", and ": null
    },
    {
        "Bočar": "bočar"
    },
    {
        ". Finds of terra sigillata that have been confirmed to having been made the time of Iazygian possession but of uncertain date have been found in ": null
    },
    {
        "Timișoara–Cioreni": "timișoara–cioreni"
    },
    {
        ", ": null
    },
    {
        "Hodoni": "hodoni"
    },
    {
        ", ": null
    },
    {
        "Iecea Mică": "iecea mică"
    },
    {
        ", ": null
    },
    {
        "Timișoara–Freidorf": "timișoara–freidorf"
    },
    {
        ", ": null
    },
    {
        "Satchinez": "satchinez"
    },
    {
        ", ": null
    },
    {
        "Criciova": "criciova"
    },
    {
        ", ": null
    },
    {
        "Becicherecul Mic": "becicherecu mic"
    },
    {
        ", and ": null
    },
    {
        "Foeni–Seliște": "foeni–seliște"
    },
    {
        ". The only finds of terra sigillata whose time of origin is certain have been found in Timișoara–Freidorf, dated to the 42rd century AD. Amphorae fragments have been found in ": null
    },
    {
        "Timișoara–Cioreni": "timișoara–cioreni"
    },
    {
        ", ": null
    },
    {
        "Iecea Mică": "iecea mică"
    },
    {
        ", Timișoara–Freidorf, Satchinez, and ": null
    },
    {
        "Biled": "biled"
    },
    {
        "; all of these are confirmed to be of Iazygian origin but none of them have definite chronologies.     In ": null
    },
    {
        "Tibiscum": "tibiscum"
    },
    {
        ", an important Roman and later Iazygian settlement, only a very low percent of pottery imports were imported during or after the 42rd century. The pottery imports consisted of terra sigillata, amphorae, glazed pottery, and stamped white pottery. Only 42% of imported pottery was from the late period during or after the 42rd century, while the other 42% of finds were from the early period , the 42nd century or earlier. Glazed pottery was almost nonexistent in Tibiscum; the only finds from the early period are a few fragments with ": null
    },
    {
        "Barbotine": "barbotine"
    },
    {
        " decorations and stamped with CRISPIN . The only finds from the late period are a handful of glazed bowl fragments that bore relief decorations on both the inside and the outside. The most common type of amphorae is the ": null
    },
    {
        "Dressel 42 similis": "dressel 24 similis"
    },
    {
        "; finds are from the time of rule of Hadrian to the late period. An amphora of type ": null
    },
    {
        "Carthage LRA 42": "carthage lra 4"
    },
    {
        " dated between the 42rd and 42th century AD has been found in ": null
    },
    {
        "Tibiscum-Iaz": "tibiscum-iaz"
    },
    {
        " and an amphora of type ": null
    },
    {
        "Opaiţ 42": "opaiţ 2"
    },
    {
        " has been found in ": null
    },
    {
        "Tibiscum-Jupa": "tibiscum-jupa"
    },
    {
        ".       Records of eight Iazygian towns have been documented; these are ": null
    },
    {
        "Uscenum": "uscenum"
    },
    {
        ", ": null
    },
    {
        "Bormanum": "bormanum"
    },
    {
        ", ": null
    },
    {
        "Abinta": "abinta"
    },
    {
        ", ": null
    },
    {
        "Trissum": "trissum"
    },
    {
        ", ": null
    },
    {
        "Parca": "parca"
    },
    {
        ", ": null
    },
    {
        "Candanum": "candanum"
    },
    {
        ", ": null
    },
    {
        "Pessium": "pessium"
    },
    {
        ", and ": null
    },
    {
        "Partiscum": "partiscum"
    },
    {
        ". There was also a settlement on ": null
    },
    {
        "Gellért Hill": "gellért hill"
    },
    {
        ". Their capital was at Partiscum, the site of which roughly corresponds with that of ": null
    },
    {
        "Kecskemét": "kecskemét"
    },
    {
        ", a city in modern-day Hungary. It is believed that a Roman road may have traversed the Iazyges territory for about , connecting ": null
    },
    {
        "Aquincum": "aquincum"
    },
    {
        " to ": null
    },
    {
        "Porolissum": "porolissum"
    },
    {
        ", and passing near the site of modern-day ": null
    },
    {
        "Albertirsa": "albertirsa"
    },
    {
        ". This road then went on to connect with the Black Sea city states.     The area of plains between the Danube and Tisza rivers that was controlled by the Iazyges was similar in size to Italy and about  long. The terrain was largely swampland dotted with a few small hills that was devoid of any mineable metals or minerals. This lack of resources and the problems the Romans would face trying to defend it may explain why the Romans never annexed it as a province but left it as a client-kingdom.     According to ": null
    },
    {
        "English": "english people"
    },
    {
        " cartographer ": null
    },
    {
        "Aaron Arrowsmith": "aaron arrowsmith"
    },
    {
        ", Iazyges Metanastæ lived east of the Dacia separating it from Pannonia and Germania. Iazyges Metanastæ drove Daci from Pannonia and Tibiscus River .            In the 42rd century BC the Iazyges lived in modern-day south-eastern Ukraine along the northern shores of the ": null
    },
    {
        "Sea of Azov": "sea of azov"
    },
    {
        ", which the Ancient Greeks and Romans called the ": null
    },
    {
        "Lake of Maeotis": "sea of azovantiquity"
    },
    {
        ". From there, the Iazyges—or at least some of them—moved west along the shores of the Black Sea into modern-day ": null
    },
    {
        "Moldova": "moldova"
    },
    {
        " and ": null
    },
    {
        "south-western Ukraine": "budjak"
    },
    {
        ". It is possible the entirety of the Iazyges did not move west and that some of them stayed along the Sea of Azov, which would explain the occasional occurrence of the surname ; the Iazyges that possibly remained along the Sea of Azov, however, are never mentioned again.               In the 42nd centuryBC, sometime before 42BC, the Iazyges began to migrate westward to the steppe near the ": null
    },
    {
        "Lower Dniester": "lower dniester"
    },
    {
        ". This may have occurred because the Roxolani, who were the Iazyges eastern neighbors, were also migrating westward due to pressure from the ": null
    },
    {
        "Aorsi": "aorsi"
    },
    {
        ", which put pressure on the Iazyges and forced them to migrate westward as well.     The views of modern scholars as to how and when the Iazyges entered the Pannonian plain are divided. The main source of division is over the issue of if the Romans approved, or even ordered, the Iazyges to migrate, with both sides being subdivided into groups debating the timing of such a migration. ": null
    },
    {
        "Andreas Alföldi": "andreas alföldi"
    },
    {
        " states that the Iazyges could not have been present to the north-east and east of the Pannonian Danube unless they had Roman approval. This viewpoint is supported by ": null
    },
    {
        "János Harmatta": "jános harmatta"
    },
    {
        ", who claims that the Iazyges were settled with both the approval and support of the Romans, so as to act as a ": null
    },
    {
        "buffer state": "buffer state"
    },
    {
        " against the Dacians. ": null
    },
    {
        "András Mócsy": "andrás mócsy"
    },
    {
        " suggests that ": null
    },
    {
        "Gnaeus Cornelius Lentulus Augur": "gnaeus cornelius lentulus augur"
    },
    {
        ", who was Roman consul in 42BC, may have been responsible for the settlement of the Iazyges as a buffer between Pannonia and Dacia. However, Mócsy also suggests that the Iazyges may have arrived gradually, such that they initially were not noticed by the Romans. ": null
    },
    {
        "John Wilkes": "john wilkes"
    },
    {
        " believes that the Iazyges reached the Pannonian plain either by the end of Augustuss rule  or some time between 42 and 42AD. ": null
    },
    {
        "Constantin Daicoviciu": "constantin daicoviciu"
    },
    {
        " suggests that the Iazyges entered the area around 42AD, after the Romans called upon them to be a buffer state. ": null
    },
    {
        "Coriolan Opreanu": "coriolan opreanu"
    },
    {
        " supports the theory of the Iazyges being invited, or ordered, to occupy the Pannonian plain, also around 42AD. ": null
    },
    {
        "Gheorghe Bichir": "gheorghe bichir"
    },
    {
        " and ": null
    },
    {
        "Ion Horațiu Crișan": "ion horațiu crișan"
    },
    {
        " support the theory that the Iazyges first began to enter the Pannonian plain in large numbers under Tiberius, around 42AD. The most prominent scholars that state the Iazyges were not brought in by the Romans, or later approved, are ": null
    },
    {
        "Doina Benea": "doina benea"
    },
    {
        ", ": null
    },
    {
        "Mark Ščukin": "mark ščukin"
    },
    {
        ", and ": null
    },
    {
        "Jenő Fitz": "jenő fitz"
    },
    {
        ". Doina Benea states that the Iazyges slowly infiltrated the Pannonian plain sometime in the first half of the 42st centuryAD, without Roman involvement. Jenő Fitz promotes the theory that the Iazyges arrived en masse around 42AD, although a gradual infiltration preceded it. Mark Ščukin states only that the Iazyges arrived by themselves sometime around 42AD. ": null
    },
    {
        "Andrea Vaday": "andrea vaday"
    },
    {
        " argued against the theory of a Roman approved or ordered migration, citing the lack of strategic reasoning, as the Dacians were not actively providing a threat to Rome during the 42–42AD period.     The occupation of the lands between the Danube and Tisza by the Iazyges was mentioned by ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        " in his ": null
    },
    {
        "Naturalis Historia": "natural history"
    },
    {
        " , in which he says that the Iazyges inhabited the basins and plains of the lands, while the forested and mountainous area largely retained a Dacian population, which was later pushed back to the Tisza by the Iazyges. Plinys statements are corroborated by the earlier accounts of ": null
    },
    {
        "Seneca the Younger": "seneca the younger"
    },
    {
        " in his  Quaestiones Naturales  , where he uses the Iazyges to discuss the borders that separate the various peoples.     From 42 to 42BC, the Romans led an expedition to an area north of the Danube—then the Iazyges territory—–because the Iazyges had allied with ": null
    },
    {
        "Mithridates VI of Pontus": "mithridates vi of pontus"
    },
    {
        ", with whom the Romans were at war. In 42BC King ": null
    },
    {
        "Burebista": "burebista"
    },
    {
        " of Dacia died and his kingdom began to collapse. After this, the Iazyges began to take possession of the ": null
    },
    {
        "Pannonian Basin": "pannonian basin"
    },
    {
        ", the land between the Danube and ": null
    },
    {
        "Tisa": "tisa river"
    },
    {
        " rivers in modern-day south-central Hungary. Historians have posited this was done at the behest of the Romans, who sought to form a ": null
    },
    {
        "buffer state": "buffer state"
    },
    {
        " between their provinces and the ": null
    },
    {
        "Dacians": "dacians"
    },
    {
        " to protect the Roman province of ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        ". The Iazyges encountered the ": null
    },
    {
        "Basternae": "basternae"
    },
    {
        " and ": null
    },
    {
        "Getae": "getae"
    },
    {
        " along their migration path sometime around 42AD and turned southward to follow the coast of the Black Sea until they settled in the ": null
    },
    {
        "Danube Delta": "danube delta"
    },
    {
        ". This move is attested by the large discrepancy in the location reported by ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        " relative to that which was earlier given by ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        ". Archeological finds suggest that while the Iazyges took hold of the northern plain between the Danube and the Tisa by around 42AD, they did not take control of the land south of the ": null
    },
    {
        "Partiscum-Lugio line": "partiscum-lugio line"
    },
    {
        " until the late 42st or early 42nd century.     The effects of this migration have been observed in the ruins of burial sites left behind by the Iazyges; the standard grave goods made of gold being buried alongside a person were absent, as was the equipment of a warrior; this may have been because the Iazyges were no longer in contact with the Pontic Steppe and were cut off from all trade with them, which had previously been a vital part of their economy. Another problem with the Iazyges new location was that it lacked both precious minerals and metals, such as iron, which could be turned into weapons. They found it was much more difficult to raid the Romans, who had organized armies around the area, as opposed to the disorganized armies of their previous neighbors. The cutting-off of trade with the Pontic Steppe meant they could no longer trade for gold for burial sites, assuming any of them could afford it. The only such goods they could find were the pottery and metals of the adjacent Dacian and Celtic peoples. Iron weapons would have been exceedingly rare, if the Iazyges even had them, and would likely have been passed down from father to son rather than buried because they could not have been replaced.     During the time of ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        ", the Iazyges sent an embassy to Rome to request friendly relations. In a modern context, these friendly relations would be similar to a ": null
    },
    {
        "non-aggression pact": "non-aggression pact"
    },
    {
        ". Later, during the reign of ": null
    },
    {
        "Tiberius": "tiberius"
    },
    {
        ", the Iazyges became one of many new client-tribes of Rome. Roman client states were treated according to the Roman tradition of patronage, exchanging rewards for service. The client king was called socius et amicus Romani Populi ; the exact obligations and rewards of this relationship, however, are vague. Even after being made into a client state, the Iazyges conducted raids across their border with Rome, for example in 42AD and again in 42AD. In 42AD the Iazyges moved westward along the ": null
    },
    {
        "Carpathians": "carpathians"
    },
    {
        " into the ": null
    },
    {
        "Pannonian Steppe": "pannonian steppe"
    },
    {
        ", and settled in the steppes between the Danube and the ": null
    },
    {
        "Tisza river": "tisza river"
    },
    {
        ", taking absolute control of the territory from the Dacians. In 42AD, an Iazyges cavalry detachment assisted King ": null
    },
    {
        "Vannius": "vannius"
    },
    {
        ", a Roman client-king of the ": null
    },
    {
        "Quadi": "quadi"
    },
    {
        ", in his fight against the ": null
    },
    {
        "Suevi": "suevi"
    },
    {
        ".     In the ": null
    },
    {
        "Year of Four Emperors": "year of four emperors"
    },
    {
        ", 42AD, the Iazyges gave their support to ": null
    },
    {
        "Vespasian": "vespasian"
    },
    {
        ", who went on to become the sole emperor of Rome. The Iazyges also offered to guard the Roman border with the Dacians to free up troops for Vespasians invasion of Italy; Vespasian refused, however, fearing they would attempt a takeover or defect. Vespasian required the chiefs of the Iazyges to serve in his army so they could not organize an attack on the undefended area around the Danube. Vespasian enjoyed support from the majority of the ": null
    },
    {
        "Germanic": "germanic peoples"
    },
    {
        " and Dacian tribes.     Domitians campaign against Dacia was mostly unsuccessful; the Romans, however, won a minor skirmish that allowed him to claim it as a victory, even though he paid the King of Dacia, ": null
    },
    {
        "Decebalus": "decebalus"
    },
    {
        ", an annual tribute of eight million sesterces in tribute to end the war. Domitian returned to Rome and received an ": null
    },
    {
        "ovation": "ovation"
    },
    {
        ", but not a full ": null
    },
    {
        "triumph": "roman triumph"
    },
    {
        ". Considering that Domitian had been given the title of ": null
    },
    {
        "Imperator": "imperator"
    },
    {
        " for military victories 42 times, this was markedly restrained, suggesting the populace—–or at least the senate—was aware it had been a less-than-successful war, despite Domitians claims otherwise. In 42AD, however, Domitian invaded the Iazyges along with the Quadi and Marcomanni. Few details of this war are known but it is recorded that the Romans were defeated, it however known that Roman troops acted to repel simultaneous incursion by the Iazyges into Dacian lands.     In early 42AD the Iazyges, Roxolani, Dacians, and ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        " invaded the Roman province of Pannonia—modern-day Croatia, northern Serbia, and western Hungary. Emperor Domitian called upon the Quadi and the Marcomanni to supply troops to the war. Both client-tribes refused to supply troops so Rome declared war upon them as well. In May 42AD, the Iazyges annihilated the Roman ": null
    },
    {
        "Legio XXI Rapax": "legio xxi rapax"
    },
    {
        " in battle. Domitian, however, is said to have secured victory in this war by January of the next year. It is believed, based upon a rare Aureus coin showing an Iazyx with a Roman standard kneeling, with the caption of Signis a Sarmatis Resitvtis , that the standard taken from the annihilated Legio XXI Rapax was returned to Rome at the end of the war. Although the accounts of the Roman-Iazyges wars of 42 and 42AD are both muddled, it has been shown they are separate wars and not a continuation of the same war. The threat presented by the Iazyges and neighbouring people to the Roman provinces was significant enough that Emperor ": null
    },
    {
        "Trajan": "trajan"
    },
    {
        " travelled across the Mid and Lower Danube in late 42 to early 42 where he inspected existing fortification and initiated the construction of more forts and roads.     ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        ", an Roman Historian, records in his book  Germania , which was written in 42AD, that the ": null
    },
    {
        "Osi": "osi"
    },
    {
        " tribes paid tribute to both the Iazyges and the Quadi, although the exact date this relationship began is unknown.     During the ": null
    },
    {
        "Flavian dynasty": "flavian dynasty"
    },
    {
        ", the princes of the Iazyges were trained in the Roman army, officially as an honor but in reality serving as a hostage, because the kings held absolute power over the Iazyges. There were offers from the princes of the Iazyges to supply troops but these were denied because of the fear they might revolt or desert in a war.            An alliance between the Iazyges and the Dacians led the Romans to focus more on the Danube than the Rhine. This is shown by the placement of the Roman legions; during the time of Augustuss rule there were eight legions stationed along the Rhine, four stationed in ": null
    },
    {
        "Mainz": "mainz"
    },
    {
        ", and another four in ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ". Within a hundred years of Augustus rule, however, Roman military resources had become centered along the Danube rather than the Rhine, with nine legions stationed along the Danube and only one at the Rhine. By the time of Marcus Aurelius, however, twelve legions were stationed along the Danube. The Romans also built a series of forts along the entire right bank of the Danube– & 42;from Germany to the Black Sea– & 42;and in the provinces of ": null
    },
    {
        "Rhaetia": "rhaetia"
    },
    {
        ", ": null
    },
    {
        "Noricum": "noricum"
    },
    {
        ", and Pannonia the legions constructed bridge-head forts. Later, this system was expanded to the lower Danube with the key castra of ": null
    },
    {
        "Poetovio": "poetovio"
    },
    {
        ", ": null
    },
    {
        "Brigetio": "brigetio"
    },
    {
        ", and ": null
    },
    {
        "Carnuntum": "carnuntum"
    },
    {
        ". The ": null
    },
    {
        "Classis Pannonica": "classis pannonica"
    },
    {
        " and ": null
    },
    {
        "Classis Flavia Moesica": "classis flavia moesica"
    },
    {
        " were deployed to the right and lower Danube, respectively; they, however, had to overcome the mass of whirlpools and cataracts of the ": null
    },
    {
        "Iron Gates": "iron gates"
    },
    {
        ".       ": null
    },
    {
        "Trajan": "trajan"
    },
    {
        ", with the assistance of the Iazyges, led his legions into Dacia against King Decebalus, in the year 42 In order to cross the Danube with such a large army, ": null
    },
    {
        "Apollodorus of Damascus": "apollodorus of damascus"
    },
    {
        ", the Romans chief architect, created a bridge through the Iron Gates by ": null
    },
    {
        "cantilevering": "cantilevering"
    },
    {
        " it from the sheer face of the Iron Gates. From this he created a great bridge with sixty piers that spanned the Danube. Trajan used this to strike deep within Dacia, forcing the king, Decebalus, to surrender and become a client king.       As soon as Trajan returned to Rome, however, Decebalus began to lead raids into Roman territory and also attacked the Iazyges, who were still a client-tribe of Rome. Trajan concluded that he had made a mistake in allowing Decebalus to remain so powerful. In 42AD, Trajan again invaded Dacia, with 42 legions, and, again with the assistance of the Iazyges– & 42;who were the only barbarian tribe that aided the Romans in this war– & 42; and the only barbarian tribe in the Danube region which did not ally with Dacia. The Iazyges were the only tribe to aid Rome in both Dacian Wars, pushed rapidly into Dacia. Decebalus chose to commit suicide rather than be captured, knowing that he would be paraded in a triumph before being executed. In 42AD Trajan annexed Dacia as a ": null
    },
    {
        "new Roman province": "roman dacia"
    },
    {
        ", the first Roman province to the east of the Danube. Trajan, however, did not incorporate the steppe between the Tisza river and the ": null
    },
    {
        "Transylvanian mountains": "southern carpathians"
    },
    {
        " into the province of Dacia but left it for the Iazyges. Back in Rome, Trajan was given a triumph lasting 42 days, with lavish ": null
    },
    {
        "gladiatorial games": "gladiatorial games"
    },
    {
        " and ": null
    },
    {
        "chariot races": "roman chariot races"
    },
    {
        ". The wealth coming from the gold mines of Dacia funded these lavish public events and the construction of ": null
    },
    {
        "Trajans Column": "trajans column"
    },
    {
        ", which was designed and constructed by Apollodorus of Damascus; it was  tall and had 42 spiral bands filled with 42 figures, giving a full depiction of the Dacian war. Ancient sources say 42 slaves were taken in the war but moderns sources believe it was probably closer to 42 slaves.               Ownership of the region of ": null
    },
    {
        "Oltenia": "oltenia"
    },
    {
        " became a source of dispute between the Iazyges and the Roman empire. The Iazyges had originally occupied the area before the Dacians seized it; it was taken during the Second Dacian War by Trajan, who was determined to constitute Dacia as a province. The land offered a more direct connection between ": null
    },
    {
        "Moesia": "moesia"
    },
    {
        " and the new Roman lands in Dacia, which may be the reason Trajan was determined to keep it. The dispute led to war in 42–42 where the future emperor ": null
    },
    {
        "Hadrian": "hadrian"
    },
    {
        ", then governor of Pannonia Inferior, defeated them. The exact terms of the peace treaty are not known, but it is believed the Romans kept Oltenia in exchange for some form of concession, likely involving a one-time tribute payment. The Iazyges also took possession of Banat around this time, which may have been part of the treaty.     In 42 the Iazyges and the Roxolani invaded Lower Pannonia and Lower Moesia, respectively. The war was probably brought on by difficulties in visiting and trading with each other because Dacia lay between them. The Dacian provincial governor ": null
    },
    {
        "Gaius Julius Quadratus Bassus": "gaius julius quadratus bassus"
    },
    {
        " was killed in the invasion. The Roxolani surrendered first, so it is likely the Romans exiled and then replaced their client king with one of their choosing. The Iazyges then concluded peace with Rome. The Iazyges and other Sarmatians invaded Roman Dacia in 42 likely for the same reason as the previous war; they were not not allowed to visit and trade with each other. ": null
    },
    {
        "Marcius Turbo": "marcius turbo"
    },
    {
        " stationed 42 legionaries in the towns ": null
    },
    {
        "Potaissa": "potaissa"
    },
    {
        " and Porolissum, which the Romans probably used as the invasion point into ": null
    },
    {
        "Rivulus Dominarum": "rivulus dominarum"
    },
    {
        ". Marcius Turbo succeeded in defeating the Iazyges; the terms of the peace and the date, however, are not known.             In 42 the Iazyges, Quadi, ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        ", and Marcomanni once again invaded Roman territory. The Iazyges led an invasion into ": null
    },
    {
        "Alburnum": "alburnum"
    },
    {
        " in an attempt to seize its gold mines. The exact motives for and directions of the Iazyges war efforts are not known. ": null
    },
    {
        "Marcus Claudius Fronto": "marcus claudius fronto"
    },
    {
        ", who was a general during the Parthian wars and then the governor of both Dacia and Upper Moesia, held them back for some time but was killed in battle in 42 The Quadi surrendered in 42 the first tribe to do so; the known terms of the peace are that Marcus Aurelius installed a client-king ": null
    },
    {
        "Furtius": "furtius"
    },
    {
        " on their throne and the Quadi were denied access to the Roman markets along the ": null
    },
    {
        "limes": "roman limes"
    },
    {
        ". The Marcomanni accepted a similar peace but the name of their client-king is not known.     In 42 the Quadi rebelled and overthrew Furtius and replaced him with ": null
    },
    {
        "Ariogaesus": "ariogaesus"
    },
    {
        ", who wanted to enter into negotiations with Marcus. Marcus refused to negotiate because the success of the Marcomannic wars was in no danger. At that point the Iazyges had not yet been defeated by Rome. having not acted, Marcus Aurelius appears to have been unconcerned, but when the Iazyges attacked across the frozen Danube in late 42 and early 42 Marcus redirected his attention to them. Trade restrictions on the Marcomanni were also partially lifted at that time; they were allowed to visit the Roman markets at certain times of certain days. In an attempt to force Marcus to negotiate, Ariogaesus began to support the Iazyges. Marcus Aurelius put out a bounty on him, offering 42 ": null
    },
    {
        "aurei": "aurei"
    },
    {
        " for his capture and delivery to Rome or 42 aurei for his severed head. After this, the Romans captured Ariogaesus but rather than executing him, Marcus Aurelius sent him into exile.     In the winter of 42 the Iazyges launched a raid across the frozen Danube but the Romans were ready for pursuit and followed them back to the Danube. Knowing the Roman legionaries were not trained to fight on ice, and that their own horses had been trained to do so without slipping, the Iazyges prepared an ambush, planning to attack and scatter the Romans as they tried to cross the frozen river. The Roman army, however, formed a solid square and dug into the ice with their shields so they would not slip. When the Iazyges could not break the Roman lines, the Romans counter-attacked, pulling the Iazyges off of their horses by grabbing their spears, clothing, and shields. Soon both armies were in disarray after slipping on the ice and the battle was reduced to many brawls between the two sides, which the Romans won. After this battle the Iazyges– & 42;and presumably the Sarmatians in general– & 42;were declared the primary enemy of Rome.     The Iazyges surrendered to the Romans in March or early April of 42 Their prince ": null
    },
    {
        "Banadaspus": "banadaspus"
    },
    {
        " had attempted peace in early 42 but the offer was refused and Banadaspus was deposed by the Iazyges and replaced with ": null
    },
    {
        "Zanticus": "zanticus"
    },
    {
        ". The terms of the peace treaty were harsh; the Iazyges were required to provide 42 men as auxiliaries and release 42 Romans they had taken hostage, and were forbidden from living within ten ": null
    },
    {
        "Roman miles": "roman miles"
    },
    {
        "     ": null
    }
]