[
    {
        "              Ida Minerva Tarbell was an American writer, ": null
    },
    {
        "investigative journalist": "investigative journalism"
    },
    {
        ", ": null
    },
    {
        "biographer": "list of biographers"
    },
    {
        " and lecturer. She was one of the leading ": null
    },
    {
        "muckraker": "muckraker"
    },
    {
        "s of the ": null
    },
    {
        "Progressive Era": "progressive era"
    },
    {
        " of the late 42th and early 42th centuries and pioneered ": null
    },
    {
        "investigative journalism": "investigative journalism"
    },
    {
        ". Born in Pennsylvania at the onset of the oil boom, Tarbell is best known for her 42 book,  The History of the Standard Oil Company . The book was published as a series of articles in  McClures Magazine  from 42 to 42 It has been called a masterpiece of investigative journalism , by historian J. North Conway, as well as the single most influential book on business ever published in the United States by historian Daniel Yergin. The work would contribute to the dissolution of the ": null
    },
    {
        "Standard Oil": "standard oil"
    },
    {
        " monopoly and helped usher in the ": null
    },
    {
        "Hepburn Act": "hepburn act"
    },
    {
        " of 42 the ": null
    },
    {
        "Mann-Elkins Act": "mann–elkins act"
    },
    {
        ", the creation of the ": null
    },
    {
        "Federal Trade Commission": "federal trade commission"
    },
    {
        " and the ": null
    },
    {
        "Clayton Antitrust Act": "clayton antitrust act of 1914"
    },
    {
        ".     Tarbell also wrote several biographies over the course of her career which spanned 42 years. She wrote biographies on ": null
    },
    {
        "Madame Roland": "madame roland"
    },
    {
        " and ": null
    },
    {
        "Napoleon Bonaparte": "napoleon"
    },
    {
        ". Tarbell believed that the Truth and motivations of powerful human beings could be discovered. That Truth, she became convinced, could be conveyed in such a way as to precipitate meaningful social change.  She wrote numerous books and works on ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        " including ones that focused on his early life and career. After her exposé on Standard Oil and character study of ": null
    },
    {
        "John D. Rockefeller": "john d. rockefeller"
    },
    {
        ", she wrote biographies on businessmen ": null
    },
    {
        "Elbert H. Gary": "elbert henry gary"
    },
    {
        ", chairman of ": null
    },
    {
        "U.S. Steel": "u.s. steel"
    },
    {
        ", as well as ": null
    },
    {
        "Owen D. Young": "owen d. young"
    },
    {
        ", president of ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        ".     A prolific writer and lecturer, Tarbell was known for taking complex subjects—the oil industry, ": null
    },
    {
        "tariff": "tariff"
    },
    {
        "s, ": null
    },
    {
        "labor practices": "unfair labor practice"
    },
    {
        "—and breaking them down into informative and easy to understand articles. Her articles drove circulation at ": null
    },
    {
        "McClure’s Magazine": "mcclures"
    },
    {
        " and  The American Magazine  and many of her books were popular with the general American public. After a successful career as both writer and editor for McClure’s Magazine, Tarbell left with several other editors to buy and publish  The American Magazine . Tarbell also traveled to all then 42 states on the lecture circuit and spoke on subjects including the evils of war, ": null
    },
    {
        "world peace": "world peace"
    },
    {
        ", ": null
    },
    {
        "American politics": "politics of the united states"
    },
    {
        ", trusts, ": null
    },
    {
        "tariff": "tariff"
    },
    {
        "s, labor practices, and women’s issues.     Tarbell took part in professional organizations and served on two Presidential committees. She helped form the ": null
    },
    {
        "Authors’ League": "authors guild"
    },
    {
        " and was President of the Pen and Brush Club for 42  years. During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", she served on ": null
    },
    {
        "President Woodrow Wilson’s": "woodrow wilson"
    },
    {
        " Women’s Committee on the ": null
    },
    {
        "Council of National Defense": "council of national defense"
    },
    {
        ". After the war, Tarbell served on President ": null
    },
    {
        "Warren G. Harding’s": "warren g. harding"
    },
    {
        " 42 Unemployment Conference.     Tarbell, who never married, is often considered a ": null
    },
    {
        "feminist": "feminism"
    },
    {
        " by her actions, although she was critical of the ": null
    },
    {
        "womens suffrage movement": "womens suffrage in the united states"
    },
    {
        ".       Ida Minerva Tarbell was born on a farm in ": null
    },
    {
        "Erie County, Pennsylvania": "erie county, pennsylvania"
    },
    {
        ", on November 42 42 to Esther Ann , a teacher, and Franklin Summer Tarbell, a teacher and a ": null
    },
    {
        "joiner": "joiner"
    },
    {
        " and later an oilman. She was born in the log cabin home of her maternal grandfather, Walter Raleigh McCullough, a Scots-Irish pioneer, and his wife. Her fathers distant immigrant ancestors had settled in New England in the 42th  century. Tarbell was told by her grandmother that they were descended from Sir ": null
    },
    {
        "Walter Raleigh": "walter raleigh"
    },
    {
        ", a member of ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        "s staff, and also the first American Episcopalian bishop. Tarbell had three younger siblings: Walter, Franklin, Jr., and Sarah. Franklin, Jr. died of ": null
    },
    {
        "scarlet fever": "scarlet fever"
    },
    {
        " at a young age and Sarah, also afflicted, would remain physically weakened throughout her life. Walter became an oilman like his father, while Sarah was an artist.   Ida Tarbells early life in the oil fields of Pennsylvania would have an impact when she later wrote on the Standard Oil Company and on labor practices. The ": null
    },
    {
        "Panic of 42": "panic of 1857"
    },
    {
        " hit the Tarbell family hard as banks collapsed and the Tarbells lost their savings. Franklin Tarbell was away in Iowa building a family homestead when Ida was born. Franklin had to abandon the Iowan house and return to Pennsylvania. With no money, he walked across the states of Illinois, Indiana, and Ohio to return, and supported himself along the way by teaching in rural schools. When he returned, ragged from his 42-month journey, young Ida Tarbell was said to have told him, Go away, bad man!      The Tarbells fortune would turn as the ": null
    },
    {
        "Pennsylvania oil rush": "pennsylvania oil rush"
    },
    {
        " began in 42 They lived in the western region of Pennsylvania as new ": null
    },
    {
        "oil fields": "petroleum industry"
    },
    {
        " were being developed, utterly changing the regional economy. Oil, she would write in her autobiography, opened “a rich field for tricksters, swindlers, exploiters of vice in every known form.”  Tarbell’s father first used his trade to build wooden oil storage tanks. The family lived in a shack with a workshop for Franklin in an oil field with twenty-five oil wells. Oil was everywhere in the sand, pits, and puddles. Tarbell wrote of the experience, No industry of man in its early days has ever been more destructive of beauty, order, decency, than the production of petroleum.      In 42 Idas father moved the family to ": null
    },
    {
        "Rouseville, Pennsylvania": "rouseville, pennsylvania"
    },
    {
        ". Accidents that occurred in Rouseville impacted Ida Tarbell deeply. Town founder and neighbor Henry Rouse was drilling for oil when a flame hit natural gas coming from a pump. Rouse survived a few hours, which gave him just enough time to write his will and leave his million-dollar estate to the other settlers to build roads. In total, 42  men were killed and the Tarbells mother, Esther, cared for one of the burn victims in their home. In another incident, three women died in a kitchen explosion. Tarbell was not allowed to see the bodies, but she snuck into the room where the women awaited burial. Tarbell suffered from nightmares for the rest of her life.     After the Rouseville boom was finished in 42 the family moved to ": null
    },
    {
        "Titusville, Pennsylvania": "titusville, pennsylvania"
    },
    {
        ". Tarbells father built a family house at 42 Main Street using lumber and fixtures from the defunct Bonta Hotel in ": null
    },
    {
        "Pithole, Pennsylvania": "pithole, pennsylvania"
    },
    {
        ".     Tarbells father later became an oil producer and refiner in ": null
    },
    {
        "Venango County": "venango county, pennsylvania"
    },
    {
        ". Franklins business, along with those of many other small businessmen, was adversely affected by the ": null
    },
    {
        "South Improvement Company": "south improvement company"
    },
    {
        " scheme between the railroads and more substantial oil interests. Later, Tarbell would vividly recall this event in her writing, in which she accused the leaders of the ": null
    },
    {
        "Standard Oil Company": "standard oil company"
    },
    {
        " of using unfair tactics to put her father and many small oil companies out of business. The South Improvement Company secretly worked with the railroads to raise the rates on oil shipment for independent oil men. The members of South Improvement Company received discounts and rebates to offset the rates and put the independents out of business. Franklin Tarbell participated against the South Improvement Company through marches and tipping over Standard Oil railroad tankers. The government of Pennsylvania eventually moved to disband the South Improvement Company.     The Tarbells were socially active, entertaining ": null
    },
    {
        "prohibitionists": "prohibitionists"
    },
    {
        " and womens suffragists. Her family subscribed to  Harpers Weekly , ": null
    },
    {
        "Harpers Monthly": "harpers magazine"
    },
    {
        ", and ": null
    },
    {
        "the New York Tribune": "new-york tribune"
    },
    {
        " and it was there that Ida Tarbell followed the events of ": null
    },
    {
        "the Civil War": "american civil war"
    },
    {
        ". Tarbell would also sneak into the family workers bunkhouse to read copies of ": null
    },
    {
        "the Police Gazette": "national police gazette"
    },
    {
        "—a gruesome tabloid. Her family was Methodist and attended church twice a week. Esther Tarbell supported womens rights and entertained women such as ": null
    },
    {
        "Mary Livermore": "mary livermore"
    },
    {
        " and ": null
    },
    {
        "Frances E. Willard": "frances willard"
    },
    {
        ".        Ida Tarbell was intelligent—but also undisciplined in the classroom. According to reports by Tarbell herself, she paid little attention in class and was often truant until one teacher set her straight: She told me the plain and ugly truth about myself that day, and as I sat there, looking her straight in the face, too proud to show any feeling, but shamed as I never had been before and never have been since.  Tarbell was especially interested in the sciences, and she began comparing the landscape around her in Pennsylvania to what she was learning in school. Here I was suddenly on a ground which meant something to me. From childhood, plants, insects, stones were what I saw when I went abroad, what I brought home to press, to put into bottles, to litter up the house... I had never realized that they were subjects for study... School suddenly became exciting.      Tarbell graduated at the head of her high school class in Titusville and went on to study biology at ": null
    },
    {
        "Allegheny College": "allegheny college"
    },
    {
        " in 42 where she was the only woman in her class of 42 Tarbell had an interest in evolutionary biology—at her childhood home she spent many hours with a microscope—and said of her interest in science, The quest for the truth had been born in me... the most essential of mans quests.  One of Tarbells professors, Jeremiah Tingley, allowed her to use the colleges microscope for study and Tarbell used it to study the ": null
    },
    {
        "Common Mudpuppy": "common mudpuppy"
    },
    {
        ", a foot-long amphibian that used both gills and a lung and thought to be a missing link.     Tarbell displayed leadership at Allegheny. She was a founding member of the local sorority that became the Mu chapter of the ": null
    },
    {
        "Kappa Alpha Theta": "kappa alpha theta"
    },
    {
        " sorority in 42 Tarbell also led the charge to place a  on campus dedicated to learning and with the Latin phrase, Spes sibi quisque, which translates to Everyone is his/her own hope . She was a member of the campus womens literary society, the Ossoli Society, named after writer ": null
    },
    {
        "Margaret Fuller Ossoli": "margaret fuller"
    },
    {
        ", and wrote for the societys publication, the Mosaic.     Tarbell graduated in 42 with an A.B. degree and an M.A. degree in 42 Tarbell would go on to support the university by serving on the board of trustees, to which she was first elected in 42 She was the second woman to serve as a trustee and would hold the post for more than three decades.       Tarbell left school wanting to contribute to society but unsure of how to do it, she became a teacher. Tarbell began her career as headmistress at ": null
    },
    {
        "Poland Union Seminary": "poland seminary"
    },
    {
        " in ": null
    },
    {
        "Poland, Ohio": "poland, ohio"
    },
    {
        " in August 42 The school was both a high school and provided continuing education courses for local teachers. Tarbell taught classes in geology, botany, geometry, and trigonometry as well as languages: Greek, Latin, French, and German. After two years, she realized teaching was too much for her, and she returned home. She was exhausted by the workload and exasperated by the low wages which meant she had to borrow money from her parents.     Tarbell returned to Pennsylvania, where she met Theodore L. Flood, editor of The Chautauquan, a teaching supplement for ": null
    },
    {
        "home study course": "home study course"
    },
    {
        "s at ": null
    },
    {
        "Chautauqua, New York": "chautauqua, new york"
    },
    {
        ". Tarbells family was familiar with the movement which encouraged adult education and self-study. She was quick to accept Floods offer to write for the publication. Initially, Tarbell worked two weeks at the Meadville, Pennsylvania headquarters and worked two weeks at home. This allowed her to continue her own study at home in biology using microscopes. She became managing editor in 42 and her duties included proofreading, answering reader questions, providing proper pronunciation of certain words, translating foreign phrases, identifying characters, and defining words.     Tarbell began writing brief items for the magazine and then worked up to longer features as she established her writing style and voice. Her first article was The Arts and Industries of ": null
    },
    {
        "Cincinnati": "cincinnati"
    },
    {
        " and appeared in December 42 According to Steve Weinberg in Taking on the Trust, this was when Tarbell established a style that would carry throughout her career: Tarbell would imbue her articles, essays, and books with moral content, grounded in her unwavering rectitude. That rectitude, while sometimes suggesting inflexibility, drove her instincts for reform, a vital element in her future confrontation with Rockefeller.      Tarbell wrote two articles that showcased her conflicting views on the roles of women that would follow her through her life. Tarbells article, Women as Inventors, was published in the March 42 issue of The Chautauquan. When an article written by Mary Lowe Dickinson claimed the number of women patent owners to be about 42—and that women would never become successful inventors—Tarbells curiosity was sparked and she began her own investigation. Tarbell traveled to the Patent Office in Washington, D.C. and met with the head of the department, R. C. McGill. McGill had put together a list of close to 42 women. Tarbell wrote in the article, Three things worth knowing and believing: that women have invented a large number of useful articles; that these patents are not confined to clothes and kitchen devices as the skeptical masculine mind avers; that invention is a field in which woman has large possibilities.  Tarbell later followed this article up with a showcase on women in journalism in April 42 The article contained history, journalism practices, and advice including a warning that journalism was an open field for women, and yet women should refrain from shedding tears easily and appearing weak.     Tarbell balked at being a hired gal and decided to strike out on her own after a falling out with Theodore Flood. Tarbell decided to follow her fathers philosophy that it was better to work for oneself than to be a hired hand. She began researching women from history including ": null
    },
    {
        "Germaine de Staël": "germaine de staël"
    },
    {
        " and ": null
    },
    {
        "Madame Roland": "madame roland"
    },
    {
        " for inspiration and as subject matter for her writing. The real reason for the fall-out with Flood remains a mystery, but one reason may have been the placement of his sons name on the Masthead above Tarbells own. Another hinted that her family had reason to seek revenge on him.       Leaving the security of The Chautauquan, Tarbell moved to Paris in 42 at age 42 to live and work. She shared an apartment on the Rue du Sommerard with three women friends from The Chautauquan. The apartment was within a few blocks of the ": null
    },
    {
        "Panthéon": "panthéon"
    },
    {
        ", ": null
    },
    {
        "Notre-Dame de Paris": "notre-dame de paris"
    },
    {
        ", and the ": null
    },
    {
        "Sorbonne": "sorbonne"
    },
    {
        ". This was an exciting time in Paris, as ": null
    },
    {
        "the Eiffel Tower": "eiffel tower"
    },
    {
        " had been finished recently in 42 Tarbell and her friends enjoyed the art produced by ": null
    },
    {
        "Impressionists": "impressionism"
    },
    {
        " including ": null
    },
    {
        "Degas": "edgar degas"
    },
    {
        ", ": null
    },
    {
        "Monet": "claude monet"
    },
    {
        ", ": null
    },
    {
        "Manet": "édouard manet"
    },
    {
        ", and ": null
    },
    {
        "Van Gogh": "vincent van gogh"
    },
    {
        ". Tarbell described the color of the art as the blues and greens fairly howl they are so bright and intense.  Tarbell attended the ": null
    },
    {
        "Can-can": "can-can"
    },
    {
        " at the ": null
    },
    {
        "Moulin Rouge": "moulin rouge"
    },
    {
        " and in a letter to her family she advised them to read ": null
    },
    {
        "Mark Twain": "mark twain"
    },
    {
        "s description of it in The Innocents Abroad as she didnt like to write about it.     Tarbell had an active social life in Paris. She and her flatmates hosted a language salon where both English and French speakers could come together and practice their non-native language skills. Her landlady, Madame Bonnet, held weekly dinners for the women and her other tenants. These tenants included young men from Egypt, and among them was Prince Said Toussoum, a cousin of the Egyptian ruler. Tarbell met and had a possible romance with Charles Downer Hazen, a future French historian and professor at Smith College.      Tarbell set about making her career as a writer in Paris. She supported herself by writing for several American newspapers including the  Pittsburgh Dispatch , the  Cincinnati Times-Star , and the  Chicago Tribune . Tarbell published the short story, France Adorée, in the December 42 issue of ": null
    },
    {
        "Scribners Magazine": "scribners magazine"
    },
    {
        ". All of this work, along with a tutorship, helped Tarbell as she worked on her first biography, a book on ": null
    },
    {
        "Madame Roland": "madame roland"
    },
    {
        ": the leader of an influential  salon  during the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". Tarbell already wanted to rescue women from the obscurity of history. Her research led her to an introduction to Leon Marillier, a descendant of Roland who provided access to Rolands letters and family papers. Mariller invited Tarbell to visit the Roland Country estate, Le Clos.     Tarbell continued her education in Paris and also learned investigative and research techniques used by French historians. Tarbell attended lectures at the Sorbonne—including those on the history of the French revolution, 42th-century literature, and period painting. She learned from French historians how to present evidence in a clear, compelling style.     What Tarbell discovered about Madame Roland changed her own worldview. She began the biography with admiration for Roland, but grew disillusioned as she researched and learned more. Tarbell determined that Roland, who followed her husbands lead, was not the independent thinker she had imagined and was complicit in creating an atmosphere where violence lead to the Terror and her own execution. She wrote of Roland, This woman had been one of the steadiest influences to violence, willing, even eager, to use this terrible revolutionary force, so bewildering and terrifying to me, to accomplish her ends, childishly believing herself and her friends strong enough to control it when they needed it no longer. The heaviest blow to my self-confidence so far was my loss of faith in revolution as a divine weapon. Not since I discovered the world not to have been made in six days...had I been so intellectually and spiritually upset.      It was during this time that Tarbell received bad news and then a shock. Franklin Tarbells business partner had committed suicide, leaving Franklin in debt. Subsequently, a July 42 newspaper announced that Tarbells hometown of Titusville had been completely destroyed by flood and fire. Over 42 people died, and she feared her family was among them. Oil Creek had flooded and inflammable material on the water had ignited and exploded. Tarbell was relieved when she received a one-word cablegram that read: Safe!  Her family and their home had been spared.        McClures Magazine    Syndicate publisher ": null
    },
    {
        "Samuel McClure": "s. s. mcclure"
    },
    {
        " showed up at Tarbells door in Paris to offer her the editor position for his new  McClures Magazine. Tarbell had published articles with McClures syndicate, and McClure had read a Tarbell article on the paving of French streets. McClure told his partner John S. Philips, This girl can write. We need to get her to do some work for our magazine . Tarbell described McClure as a ": null
    },
    {
        "will-of-the-wisp": "will-o-the-wisp"
    },
    {
        " . He overstayed his visit, missed his train, and had to borrow $42 from Tarbell to travel on to ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        ". Tarbell assumed she would never see the money which was for her vacation, again, but his offices wired over the money the next day. Tarbell initially turned him down so she could continue working on the Roland biography but McClure was determined. Next, the art director for McClures, August Jaccaci, made a visit to Tarbell to show her the maiden issue of the magazine.     Instead of taking up the editor position at McClures, Tarbell began writing freelance articles for the magazine. She wrote articles about women intellectuals and writers in Paris as well as scientists. She hoped articles such as A Paris Press Woman for the ": null
    },
    {
        "Boston Transcript": "boston evening transcript"
    },
    {
        " in 42 would provide a blueprint for women journalists and writers. She interviewed ": null
    },
    {
        "Louis Pasteur": "louis pasteur"
    },
    {
        " for an 42 article, visiting with Pasteur and going through his family photographs for the magazine. She returned to Pasteur again to find out his views on the future. This piece turned into a regular report on The Edge of the Future.  Others interviewed for the report included ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        ", ": null
    },
    {
        "Alphonse Daudet": "alphonse daudet"
    },
    {
        ", and ": null
    },
    {
        "Alexandre Dumas": "alexandre dumas"
    },
    {
        ". Tarbell took on the role of the magazines Paris representative. Tarbell was then offered the position of youth editor to replace ": null
    },
    {
        "Frances Hodgson Burnett": "frances hodgson burnett"
    },
    {
        ". When her biography of Madame Roland was finished, Tarbell returned home and joined the staff of McClures for a salary of $42 a year.       Tarbell returned from Paris in 42 and, after a visit with family in Titusville, moved to New York City. In June of that year, Samuel McClure contacted her in order to commission a biographical series on ": null
    },
    {
        "Napoleon Bonaparte": "napoleon"
    },
    {
        ". McClure had heard that  the Century Magazine , McClures rival, was working on a series of articles about Bonaparte. Tarbell stayed at ": null
    },
    {
        "Twin Oaks": "twin oaks"
    },
    {
        " in ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        ", the home of ": null
    },
    {
        "Gardiner Green Hubbard": "gardiner greene hubbard"
    },
    {
        ", while working on the series. Tarbell made use of Hubbards extensive collection of Napoleon material and memorabilia as well as resources at the Library of Congress and the U.S. State Department. Tarbells schedule for the book was tight—the first installment came out only six weeks after she initially started her work. Tarbell called this biography on a gallop.      The series proved to be a training ground for Tarbells style and methodology for biographies. Tarbell believed in the ": null
    },
    {
        "Great man theory": "great man theory"
    },
    {
        " of biography and that extraordinary individuals could shape their society at least as much as society shaped them. While working on the series, Tarbell was introduced to historian and educator ": null
    },
    {
        "Herbert B. Adams": "herbert baxter adams"
    },
    {
        " of ": null
    },
    {
        "Johns Hopkins University": "johns hopkins university"
    },
    {
        ". Adams believed in the objective interpretation of primary sources which would also become Tarbells method for writing about her subjects. Adams also taught at ": null
    },
    {
        "Smith College": "smith college"
    },
    {
        " and was a proponent for womens education.     This series of articles would solidify Tarbells reputation as a writer, opening up new avenues for her. The Napoleon series proved popular and doubled circulation up to over 42 on McClures magazine—quadrupling the readership by the final seventh Napoleon installment. It included illustrations from the Gardiner Green Hubbard collection. The articles were folded into a book which would be a best seller and earn Tarbell royalties for the rest of her life—over 42  copies were made of the first edition. Tarbell said that her sketch of Napoleon turned her plans topsy-turvy. Because of its popularity, Tarbell was also finally able to find a publisher—Scribners—for her Madame Roland book.       Tarbell continued to display her talents as a researcher and writer as she worked on her 42-part series, The Life of Abraham Lincoln. At first, Tarbell was reluctant to take up work on Lincoln as she later said, If you once get into American history, I told myself, you know well enough that will finish France. At the same time, however, Tarbell had been fascinated with Lincoln since she was a young girl. She remembered the news of his assassination and her parents reaction to it: her father coming home from his shop, her mother burying her face in her apron, running into her room sobbing as if her heart would break.     The series was another McClures story meant to compete against a Century Magazine series which had been written by Lincolns private secretaries, John Nicolay and John Hay . When Tarbell first approached John Nicolay, he told her that he and Hay had written all that was worth telling of Lincoln . Tarbell decided to begin with Lincolns origins and his humble beginnings. Tarbell traveled the country meeting with and interviewing people who had known Lincoln—including his son Robert Todd Lincoln . Robert Lincoln shared with Tarbell an early and previously unpublished daguerreotype of Lincoln as a younger man. She followed up on a lost 42 speech by Lincoln by tracking down Henry Clay Whitney —who claimed to have written down notes—and then confirming his notes via other witnesses. Whitneys version of the speech was published in McClures, but has since been disproved by other historians.     Tarbells research in the backwoods of Kentucky and Illinois uncovered the true story of Lincolns childhood and youth. She wrote to and interviewed hundreds of people who knew or had contact with Lincoln. She tracked down leads and then confirmed their sources. She sent hundreds of letters looking for images of Lincoln and found evidence of more than three hundred previously unpublished Lincoln letters and speeches. Tarbell met with John H. Finley while visiting Knox College where Lincoln famously debated Stephen Douglas in 42 Finley was the young college President, and he would go on to contribute to Tarbells work on Standard Oil and rise to become the editor of ": null
    },
    {
        "The New York Times": "the new york times"
    },
    {
        ". Tarbell traveled abroad to Europe, discovering that a rumor that Lincoln had appealed to Queen Victoria to not recognize the Confederacy was, in fact, false.     By December 42 the popular series by Tarbell once again helped boost McClures circulation to over 42 which climbed to over 42, by 42 making it higher than its rivals. This occurred even as the editors at Centurys Magazine sneered, They got a girl to write the Life of Lincoln. McClure would go on to use the money generated by Tarbells articles to buy a printing plant and a bindery.     It was at this time that Tarbell decided to be a writer and not an editor. The articles were collected in a book, giving Tarbell a national reputation as a major writer and the leading authority on the slain president. Tarbell published five books about Lincoln and traveled on the lecture circuit, recounting her discoveries to large audiences.     The tight writing schedules and frequent travel eventually impacted Tarbells health. On the verge of physical collapse, she checked into the Clifton Springs Sanitarium near Rochester, New York in 42 Besides rest and relaxation, her treatment included taking the water cure . She would visit the Sanitarium numerous times over the next thirty years.     McClures Editor McClures in 42 She was paid $42 a year and given shares in the company, which made her a part-owner. She rented an apartment in Greenwich Village which reminded her of France . She frequented the Hotel Brevoort, where Samuel Clemens also dined.     Her position as editor was to fill in for Samuel McClure, as he was planning to be away from the office for several months. Tarbell was to become known as an anchor in the office while the magazine built out its roster of investigative editors and authors. She and Phillips were described as the control to S. S. McClures motor. McClures sent Stephen Crane to cover Cuba during the War. Ray Stannard Baker was hired by the magazine to report on the Pullman Strike. Fiction editor Violo Roseboro discovered writers such as O. Henry , Jack London , and Willa Cather . John Huston Finley quit his job as president of Knox College and became an editor for McClures.         In 42 she began publishing serialized articles in McClures that were later collected in the book, ": null
    },
    {
        "The History of the Standard Oil Company": "the history of the standard oil company"
    },
    {
        " . The book became a bestseller and was called a masterpiece of investigative journalism by author and historian J. North Conway . Magazine historian Frank Luther Mott called it, one of the greatest serials ever to appear in an American magazine. It would contribute to the dissolution of Standard Oil as a monopoly and lead to the Clayton Antitrust Act . Her book would also lead to the passage of the Hepburn Act in 42 to oversee the railroads, the 42 Mann-Elkins Act which gave the Interstate Commerce Commission power over oil rates, and the creation of the Federal Trade Commission in 42 thu     Tarbell handed over the desk editor role to Lincoln Steffens in 42 and began researching the Standard Oil trust with the help of an assistant, John Siddall. There were a number of reasons why the magazine decided to publish a story on Standard Oil . The magazine had begun an effort to expose the ills of American society. They had recently published a series on crime in America and were looking for another big topic to cover. Tarbell and the other editors at McClures decided to look into the growth of the trusts—steel and sugar were both considered. But it was Tarbells own first-hand experience with life in the Pennsylvania oil fields and the fact that Standard Oil was a trust represented by only one person, Rockefeller, and therefore might make the story easier to follow. Tarbell traveled to Europe and met with S. S. McClure to get his buy-in for the idea. McClure had been resting from exhaustion, but Tarbells article idea spurred him into action. They discussed the idea over many days at a spa in Milan . McClure felt that Tarbell should use the same biographical sketch format she used for Napoleon.     On her return to the states, Samuel Clemens , introduced Tarbell to Henry H. Rogers , Vice-President at Standard Oil and considered to be the third man after John D. Rockefeller and his brother William Rockefeller . Rogers had begun his career during the American Civil War in western Pennsylvania oil regions where Tarbell had grown up. Rockefeller had bought out Rogers and his partner, but then Rogers joined the trust. In early 42 she conducted detailed interviews with the Standard Oil magnate. Rogers, wily and normally guarded in matters related to business and finance, may have been under the impression her work was to be complimentary. Rogers met with Tarbell numerous times at Standard Oils headquarters and he was apparently unusually forthcoming. However, Tarbells interviews with Rogers formed the basis for her negative exposé of the business practices of industrialist John D. Rockefeller and the massive Standard Oil organization. Her investigative journalism was serialized from 42 to 42 in ": null
    },
    {
        "McClures Magazine": "mcclures magazine"
    },
    {
        "; her first article on Standard Oil was published with pieces by Lincoln Steffens and Ray Stannard Baker . Together these nineteen articles ushered in the era of muckraking journalism. Tarbells biggest obstacle, however, was neither her gender nor Rockefellers opposition. Rather, her biggest obstacle was the craft of journalism as practiced at the turn of the twentieth century. She investigated Standard Oil and Rockefeller by using documents— hundreds of thousands of pages scattered throughout the nation—and then amplified her findings through interviews with the corporations executives and competitors, government regulators, and academic experts past and present. In other words, she proposed to practice what today is considered investigative reporting, which did not exist in 42 Indeed, she invented a new form of journalism.       The first book-length investigation of Standard Oil had appeared in 42 by newspaperman Henry Demarest Lloyd . However, this book, Wealth Against Commonwealth , contained factual errors and appeared to be too accusatory in nature to garner popular acclaim.     Her stories on Standard Oil began in the November 42 issue of McClures and lasted for nineteen issues. She was meticulous in detailing Rockefellers early interest in oil and how the industry began. After the series was over, she wrote a profile of Rockefeller, perhaps the first CEO profile ever, though she never met or even talked to him. Rockefeller called Tarbell, Miss Tarbarrel .     Tarbells father expressed concern to her about publishing the articles warning her that Rockefeller would stop at nothing and would ruin the magazine. One of Rockefellers banks did indeed threaten the magazines financial status to which Tarbell shocked the bank executive by replying, Of course that makes no difference to me .   le   Tarbell developed investigative reporting techniques, delving into private archives and public documents across the country. The documentation and oral interviews she gathered proved Standard Oil had used strong-arm tactics and manipulated competitors, railroad companies and others to reach its corporate goals. Organized by Tarbell into a cogent history, they became a damning portrayal of big business and a personal account of petty persecution by Rockfeller. A subhead on the cover of Weinbergs book encapsulates it this way: How a female investigative journalist brought down the worlds greatest tycoon and broke up the Standard Oil monopoly .     Tarbell was able to find one critical piece of information that had gone missing—a book called the Rise and Fall of the South Improvement Company which had been published in 42 Standard Oil and Rockefeller had its roots in the South Improvement Companys illegal schemes. Standard Oil had attempted to destroy all available copies of the book, but Tarbell was finally able to locate one copy in the New York Public Library .     Another break in the story came from within Standard Oil itself and proved that the company was still using illegal and shady practices. An office boy working at the Standard Oil headquarters was given the job of destroying records which included evidence that railroads were giving the company advance information about refiners shipments. This allowed them to undercut the refiners. The young man happened to notice his Sunday school teachers name on several documents. The teacher was a refiner, and the young man took the papers to his teacher who passed them along to Tarbell in 42 The series and book on Standard Oil brought Tarbell fame. The book was adapted into a play in 42 called The Lion and the Mouse. The play was a hit even though Ida had turned down the lead role and an offer of $42 in salary per week for the twenty-week run.     President Theodore Roosevelt gave Tarbell and her peers including Lincoln Steffens and Ray Stannard Baker the label, muckraker s. Tarbells exposé of Standard Oil first appeared in the January 42 issue of McClures along with Steffans investigation of political corruption in Minneapolis and Bakers exposé on labor union practices. The term muckraker came from John Bunyan s ": null
    },
    {
        "Pilgrims Progress": "the pilgrims progress"
    },
    {
        " describing a Man with a Muckrake forever clearing muck from the floor. Roosevelt said of the muckrakers, The man who never does anything else, who never thinks or speaks or writes save of his feats with the muckrake, speedily becomes, not a help to society, not an incitement to good, but one of the most potent forces of evil . Tarbell disliked the muckraker label and wrote an article, Muckraker or Historian, in which she justified her efforts for exposing the oil trust. She referred to this classification of muckraker, which I did not like. All the radical element, and I numbered many friends among them, were begging me to join their movements. I soon found that most of them wanted attacks. They had little interest in balanced findings. Now I was convinced that in the long run the public they were trying to stir would weary of vituperation, that if you were to secure permanent results the mind must be convinced. thu     The American Magazine McClures Magazine for ": null
    },
    {
        "The American Magazine": "the american magazine"
    },
    {
        ", buying a 42-acre farm in Redding Ridge, Connecticut which she named Twin Oaks. After Tarbell bought her farm in 42 her household expanded to include a number of family members. Tarbell resided with her sister Sarah in Easton, Connecticut , at Rock House and Valley Roads. Over the years, several other family members also lived on the property, including her niece and nephew, Clara and Tristram Tripper, who lived in a cottage. Tarbells brother Walter and his wife also came to live there after Walter suffered an emotional breakdown.     Mark Twain and other New York publishing people lived nearby and Tarbell frequently entertained friends there. Tarbell wrote of the work required on a farm: Things happened: the roof leaked; the grass must be cut if I was to have a comfortable sward to sit on; water in the house was imperative. And what I had not reckoned with came from all the corners of my land: incessant calls—fields calling to be rid of underbrush and weeds and turned to their proper work; a garden spot calling for a chance to show what it could do; apple trees begging to be trimmed and sprayed. I had bought an abandoned farm, and it cried loud to go about its business.     Tarbell had written for McClures from 42 until 42 By then, S. S. McClure had become an increasingly absentee publisher, occasionally dropping in to override ideas and Tarbells orders. Tarbell and John Phillips both resigned from McClures and were followed by Ray Stannard Baker , Lincoln Steffens , and John Siddall. Tarbell and Philips raised money to form the Phillips Publishing Company and to purchase ": null
    },
    {
        "The American Magazine": "the american magazine"
    },
    {
        " . Phillips became President and Tarbell was not a member of management. Instead of focusing on muckraking journalism, the magazine steered away from reporting what was wrong in society and focused on what was right. Tarbell became the associate editor of The American Magazine and remained there until 42     Tarbell wrote a series of essential articles at The American Magazine. She investigated tariffs and their impact on American businesses and consumers. Tarbell also traveled to Chicago to investigate their public transportation. She met Jane Addams and stayed at Hull House in 42 There, she participated in the groups programs which included teaching immigrant women English, job and homemaking skills.     Tarbell and the other editors decided to sell The American Magazine to the Crowell Publishing company in 42 John Phillips sold his remaining interests to Crowell Publishing Company in 42 Phillips became a consultant to the magazine, John Siddell became the editor, and Tarbell turned to write freelance.     Tarbell examined the positive side of American business in a series of articles written between 42 and 42 She toured the United States and met with factory owners and workers and their families. Tarbell said of her own muckraking reputation, Was it not the duty of those who were called muckrakers to rake up the good earth as well as the noxious? She was fascinated by Thomas Lynch of the Frick Coke Company, who was committed to providing decent living conditions for his workers and believed that Safety First was preferable to accidents. Tarbell also admired and wrote about Ford Motor Company founder Henry Ford and his belief that offering high pay would create excellent work, as well as his ideas around mass production.       thu     Steve Weinberg wrote that Ida Tarbell was a feminist by example, but not by ideology . Feminist scholars viewed Tarbell as an enigma as she seemed to both embrace the movement and act as a critic. While her accomplishments were many, Tarbell also challenged and questioned the logic of womens suffrage. Early in life, Tarbell was exposed to the suffragette movement when her mother hosted meetings in their home. Tarbell was put off by women such as Mary Livermore and Frances Willard who she said never paid attention to her. By contrast, Tarbell noted, the men her father hosted showed interest in her. Tarbell did say that the movement sparked in her a desire to attend college and receive an education.     Starting in 42 Tarbell wrote more about women and traditional roles. Tarbell was alienated by the more militant aspects of the movement and described it as anti-male. She recommended that women embrace home life and the family, saying they had a true role as wives, mothers, and homemakers . Her biographer Emily Arnold McCully, believed that her emotional, rather than reasoned stance, on womens issues may have tarnished her long-term legacy. Tarbell felt that the drive for suffrage was a misguided war on men . Former allies among suffragists were dismayed at her change and her speaking to anti-suffragist organizations. Tarbell published the article Making a Man of Herself in American magazine in 42 which infuriated her readers and activists. Historian Robert Stinson believed that she was making new public statements about the ambiguity she had lived in her own life, which defined womens roles based upon their nature and saw attempts to push the boundaries into mens realms as unnatural. McCully wrote, that suffrage was a humans rights issue seemed not to occur to her, perhaps because, as a historian, she was much better looking backward than she was at anticipating the future.     Tarbell collected her essays on women and published them in a book called The Business of Being a Woman. The book, which was poorly received, contained tributes to early supporters of women including Susan B. Anthony and Elizabeth Cady Stanton . Tarbell said of the book: That title was like a red rag to many of my militant friends. The idea that woman had a business assigned by nature and society which was of more importance than public life disturbed them; even if it was so, they did not want it emphasized . Even Tarbells own mother, Esther, who was a lifelong suffragette, criticized Idas position.     Tarbell switched course and embraced suffrage after American women won the right to vote in 42 She wrote an article for ": null
    },
    {
        "Good Housekeeping": "good housekeeping"
    },
    {
        " in 42 to dispel the myth that suffrage had failed. She wrote: twenty million women did vote and should vote. When asked if she believed that a woman would one day be President of the United States, Tarbell pointed out that women had ruled nations in some cases better than kings and pointed to examples of Catherine the Great of Russia, Louise of Mecklenburg-Strelitz of Prussia, Elizabeth I of England and Catherine de Medici of France.     Tarbell worked to help women who had no choice but to work, often under horrifying conditions. She wrote about workplace safety and covered the realities of factories where women worked. She became an advocate for Taylorism , a system for scientific management of production, encouraging its use in home economics . She became a member of the Taylor Society . She visited more than fifty-five businesses for the article, The Golden Rule of Business, to see how scientific management and Christian values worked together. She decided it was the best way to protect workers and at the same time maximize profits.     Tarbell was a founding member of the Authors League in 42: a collective to support working writers which later became the Authors Guild .     Tarbells career shifted in 42 when American Magazine named John Siddall as editor. Tarbell joined the Chautauqua Science and Literary Circuit, a lecture and entertainment tour filled with public speakers, singers and other acts such as trained dogs and yodelers. Before the tour, Tarbell trained for public speaking with Frank Sargent of the American Academy of Dramatic Arts. The tour schedule was brutal. Tarbell said, ...I signed up for a seven weeks circuit, forty-nine days in forty-nine different places . Tarbell was exhausted at the end but went on to sign up for more over the next few years. Tarbell lectured throughout the United States on subjects from the evils of war, peace, politics, trusts, tariffs, labor and labors of women.       thu   When the United States joined World War I in April 42 President Woodrow Wilson invited Tarbell to take part in a new committee: the Womens Committee of the Council of National Defense . The Suffragettes on the committee were initially unhappy about Tarbells appointment, but her warmth and group spirit won them over. The goal of the womens committee was to mobilize the war efforts of American women and the first issue addressed was a developing food crisis. The group encouraged women to plant vegetable gardens and promoted both drying and canning of foods. Other efforts included knitting, sewing, bandage making, and the opening of day-care centers to operate while women began working in factories. Tarbell often served as a go-between with the Mens Council and the Womans Committee.     Tarbell had a number of setbacks in 42 Her mother died in September, and upon Tarbells return to Washington, D.C. the following year, Tarbell collapsed.   She was sent to Johns Hopkins where she was diagnosed with tuberculosis, and she spent three months in the hospital recovering. Tarbell also began showing beginning signs of Parkinsons disease . Her doctor did not share his diagnosis with her. It was not until years later, as her tremors worsened and affected her handwriting, that she finally learned of the diagnosis.     The Womens Committee was disbanded with the end of the war in 42 and Tarbell traveled once again to Paris, France. Some of her former McClures colleagues were also there for the Paris Peace Conference: John S. Phillips as editor of the Red Cross Magazine and Ray Stannard Baker as an assistant to President Woodrow Wilson . President Wilson had wanted Tarbell in the official U.S. legation, but, unbeknownst to Tarbell, Secretary of State Robert Lansing had refused to have a female on his team.     Tarbell wrote for the Red Cross magazine and interviewed Parisians about how the war had affected them. She also traveled to the countryside to interview farmers living in the wreckage of their former homes. Tarbell focused on the experience of the average Frenchwoman with such articles as The French Woman and Her New World, The Homing Instinct of Woman, and That Brave Northwest.       Tarbells later career included writing, lecturing, and social work. Tarbell continued working as a freelancing journalist and traveling the lecture circuit. She served on two Presidential Conferences. Tarbell was a member of President Wilsons Industrial Conference in 42 representing the Pen and Brush Club of Gramercy Park , New York City, and served on a committee looking into hours of labor along with Robert Brookings . Among recommendations of Tarbells committee were protections aimed at the health of women workers including an eight-hour day, six-day work week and no work between the hours of 42 p.m. and 42 a.m. John D. Rockefeller was also a representative at the Conference. Tarbell also participated in President Warren G. Hardings 42 Unemployment Conference, the conference suggested by Herbert Hoover to address a recession. Among the committees Tarbell served on were Organization, Public Works, Civic Emergency Measures, Publications, and Standing Committee of the Conference.     Tarbell published her only novel, The Rising of the Tide, in 42 She wrote articles about the disarmament conference for McClures syndicate and published them later in the book, Peacemakers—Blessed and Otherwise.     Tarbell also wrote another biography, this one of Judge Elbert H. Gary , the chairman of U.S. Steel Corporation . She was not initially interested in the biography, but Gary convinced her that if she uncovered any wrongdoings committed by his company, he meant to correct them. She earned $42 for the book, and although she thought her work was courageous, critics described her work as cowardly. One review was titled, The Taming of Ida Tarbell, and accused her of falling in with her sworn enemy, big business.     Tarbell completed a series of articles on Benito Mussolini for McCalls magazine in the 42s. The portrait Tarbell painted of Mussolini, comparing him to Napoleon, was flattering. Her former colleague, Viola Roseboro, remarked after meeting up with Tarbell in Italy, I heard her let go about that dimple several times. All those things that are at such a variance with the old work horse she calls herself and to the serious worker she is and is known for pleases me a lot . It was speculated that in Tarbells eyes she may have imagined Mussolini as finishing the work of the Progressive Era at the small price of a few civil liberties .     Tarbells final business biography was a profile of Owen D. Young, the president of General Electric and founder of Radio Corporation of America and then NBC. Amidst speculation that Young was gearing up for a Presidential run, the biography was reviewed as a campaign biography.     Tarbell was approached by Arthur Schlesinger Sr. to contribute to his series A History of American Life in 42 She didnt complete The Nationalizing of Business until 42     In addition to serving as the President of the Pen and Brush Club for 42 years beginning in 42 Tarbell was also a member of the Colony Club and the Cosmopolitan Club .       Tarbell completed her autobiography, All in a Days Work, in 42 when she was 42 Reviews were mixed for the book. She was working on another book, Life After Eighty, when she died of pneumonia at Bridgeport Hospital in Bridgeport, Connecticut on January 42 42 She had been in the hospital since December 42 She was 42     In 42 the Ida Tarbell House in Easton, Connecticut was declared a National Historic Landmark . In 42 Tarbell was inducted posthumously into the National Womens Hall of Fame in Seneca Falls, New York . On September 42 42 the United States Postal Service issued a commemorative stamp honoring Tarbell as part of a series of four stamps honoring women journalists.     Long past Tarbells life, she has received praise and accolades for her contribution to journalism and American history. Everett E. Dennis, Executive Director of the Freedom Forum Media Studies Center at Columbia University stated in 42 that Tarbell helped invent modern journalism. Historian and Professor of History at the University of New Hampshire, Ellen F. FitzPatrick, called Tarbell one of the great American journalists of the 42th century. The History of the Standard Oil Company was listed as No. 42 in a 42 list by New York University of the top 42 works of 42th-century American journalism. Historian Doris Kearns Goodwin , in her book The Bully Pulpit, would call Tarbells series on Standard Oil, a landmark series that would affirm her reputation as the leading investigative journalist of her day . Economic historian Daniel Yergin , in his Pulitzer-Prize winning book, The Prize: The Epic Quest for Oil, Money, and Power , described Tarbells book on Standard Oil, as arguably, the single most influential book on business ever published in the United States .     The investigative techniques she developed while researching this volume influenced Steve Weinberg, one-time executive director of the non-profit Investigative Reporters and Editors, Inc. , to base training programs for the NGO and classrooms using her methodology. While yellow journalists and muckrakers both rejected the notion of neutrality, yellow journalists focused on sensationalism and were not overly concerned with verifying the veracity of their stories. Muckrakers like Tarbell and Upton Sinclair , on the other hand, wrote detailed, thoroughly verified, and accurate descriptions of the social issues of their day, laying the groundwork for legal changes, ethical standards in journalism, and what is now known as investigative journalism.       Tarbells methodology for writing was to work and work hard. Tarbells early background in the sciences brought a touch of scientific inquiry to her investigations. Each statement she made was supported by facts so much so that her early works have been described as drowning in facts. Her method was also scholarly and driven by the demands of magazine deadlines. She could dictate as many as twenty letters a day from a To Be Answered pile on her desk.     Tarbell was extremely thorough when conducting research. At the time she began Lincolns biography, he had been dead for only 42 years, and Tarbell traveled far and wide interviewing Lincolns contemporaries. Her research uncovered more than 42 documents including unpublished speeches, letters, pictures and personal anecdotes. It was through the use of well-selected anecdotes in her biographies that Tarbell was able to breathe life into the subject and offer new perspectives. When writing a biography, Tarbell suggested that the writer should start by wiping out of his mind all that he knows about the man, start as if you had never before heard of him. Everything then is fresh, new. Your mind, feeding on this fresh material, sees things in a new way . Tarbells inclusion of anecdotes gave new perspectives to her subjects. Tarbell double-checked the Lincoln articles for accuracy by sending them out to those whose information she had included.     Tarbells writing has been described as fair and professional, and her methods have been used widely to train other investigative journalists. When conducting and presenting the details about Standard Oils business practices she wanted to present her materials as historical documentation and narrative. Tarbells technique in researching corporations through government documents, lawsuits, and interviews managed to break through a secretive corporation and evasive CEO.     Tarbell liked to work from a desk covered in research materials. While working on The History of Standard Oil, Tarbell worked from home in her study with a break once a day to go to the McClures office. At home in New York, she sat on a bentwood chair at a partners desk with messy heaps of paper. Tarbell would gather the books, transcripts, and clippings she needed, put them in order and write. When a chapter was finished and handed in, she reviewed the material again and rearranged its order for her next installment. On her Connecticut farm, Tarbell worked from a mahogany desk in a sunny library.       Charles Kleins political play, The Lion and the Mouse , opened soon after Tarbells series on Standard Oil had been published in McClures Magazine, and the plot was thought to be based on her campaign. Its 42 continuous performances set a record for any American play in New York, and four road companies took the play on the road.          New York: S.S. McClure , 42    New York: Scribners , 42    New York: McClure Phillips, 42   ": null
    },
    {
        "A Life of Napoleon Bonaparte: with a sketch of Josephine, Empress of the French": "iarchive:alifeofnapoleon00tarbmiss"
    },
    {
        " New York: Macmillan , 42   The History of the Standard Oil Company, 42 vols. New York: McClure, 42    New York: Doubleday Page, 42   ": null
    },
    {
        "Father Abraham": "iarchive:fatherabraham02tarb"
    },
    {
        " New York: Moffat, Yard and Company, 42   ": null
    },
    {
        "The Tariff in Our Times.": "iarchive:cu31924032519310"
    },
    {
        " New York: Macmillan Company , 42   The Business of Being a Woman. New York: Macmillan, 42   ": null
    },
    {
        "The Ways of Woman": "iarchive:wayswoman00tarbgoog"
    },
    {
        ". New York: Macmillan, 42   ": null
    },
    {
        "New Ideals in Business, An Account of Their Practice and Their Effects upon Men and Profits": "iarchive:newidealsinbusi00tarbgoog"
    },
    {
        ". New York: Macmillan, 42   ": null
    },
    {
        "The Rising of the Tide; The Story of Sabinsport": "iarchive:cu31924021707900"
    },
    {
        " New York, Macmillan, 42   ": null
    },
    {
        "In Lincolns Chair.": "iarchive:inlincolnschair00tarb"
    },
    {
        " New York: Macmillan,42   ": null
    },
    {
        "Boy scouts life of Lincoln": "iarchive:boyscoutslifeofl00tarb"
    },
    {
        ". New York: Macmillan, 42   ": null
    },
    {
        "He knew Lincoln, and other Billy Brown stories.": "iarchive:heknewlincolnoth02tarb"
    },
    {
        " New York: Macmillan, 42   ": null
    },
    {
        "Peacemakers—blessed and otherwise; observations, reflections and irritations at an international conference.": "iarchive:peacemakersbless00tarbrich"
    },
    {
        " New York: Macmillan, 42   The Life of Elbert H. Gary: The Story of Steel. New York: Appleton, 42   A reporter for Lincoln; story of Henry E. Wing, soldier and newspaperman. New York: Book League of America, 42   Owen D. Young: A New Type of Industrial Leader. Macmillan Company, 42 .   All in the days work : an autobiography. New York: Macmillan Company, 42       The Arts and Industries of Cincinnati. Chautauquan, December 42 42–42   Women as Inventors. Chautauquan, March 42 42–42   Women in Journalism. Chautauquan, April 42 42–42   Pasteur at Home. McClures Magazine, September 42 42–42   In the Streets of Paris. New England Magazine, November 42 42–42   The Identification of Criminals. McClures Magazine, March 42 42–42   Napoleon Bonaparte. McClures Magazine, November 42 – April 42   Abraham Lincoln. McClures Magazine, November 42 – November 42   The History of the Standard Oil Company. McClures Magazine, November 42 – July 42; December 42 – October 42   John D. Rockefeller: A Character Study. Parts 42 and 42 McClures Magazine, July 42 42–42; August 42 42–42   Commercial Machiavellianism. McClures Magazine, March 42 42–42   Tariff in Our Times. American Magazine, December 42 January 42 March–June 42   Roosevelt vs. Rockefeller. American Magazine, December 42 – February 42   The American Woman. American Magazine, November 42 – May 42   The Uneasy Woman. American Magazine, January 42   The Business of Being a Woman. American Magazine, March 42 42–42   Flying — A Dream Come True! American Magazine, November 42 42–42   The Golden Rule in Business American Magazine, October 42 – September 42   Florida — and Then What? McCalls Magazine, May–August 42   The Greatest Story in the World Today? McCalls Magazine, November 42 – February 42   As Ida Tarbell Looks at Prohibition Delineator": null
    }
]