[
    {
        "In ": null
    },
    {
        "number theory": "number theory"
    },
    {
        ", the ideal class group  of an ": null
    },
    {
        "algebraic number field": "algebraic number field"
    },
    {
        "  is the quotient group  where  is the group of ": null
    },
    {
        "fractional ideal": "fractional ideal"
    },
    {
        "s of the ": null
    },
    {
        "ring of integers": "ring of integers"
    },
    {
        " of , and  is its subgroup of ": null
    },
    {
        "principal ideal": "principal ideal"
    },
    {
        "s. The class group is a measure of the extent to which ": null
    },
    {
        "unique factorization": "unique factorization"
    },
    {
        " fails in the ring of integers of . The ": null
    },
    {
        "order": "order"
    },
    {
        " of the group, which is finite, is called the class number of .     The theory extends to ": null
    },
    {
        "Dedekind domain": "dedekind domain"
    },
    {
        "s and their ": null
    },
    {
        "field of fractions": "field of fractions"
    },
    {
        ", for which the multiplicative properties are intimately tied to the structure of the class group. For example, the class group of a Dedekind domain is trivial if and only if the ring is a ": null
    },
    {
        "unique factorization domain": "unique factorization domain"
    },
    {
        ".         Ideal class groups were studied some time before the idea of an ": null
    },
    {
        "ideal": "ideal"
    },
    {
        " was formulated. These groups appeared in the theory of ": null
    },
    {
        "quadratic form": "quadratic form"
    },
    {
        "s: in the case of binary integral quadratic forms, as put into something like a final form by ": null
    },
    {
        "Gauss": "carl friedrich gauss"
    },
    {
        ", a composition law was defined on certain equivalence classes of forms. This gave a finite ": null
    },
    {
        "abelian group": "abelian group"
    },
    {
        ", as was recognised at the time.     Later ": null
    },
    {
        "Kummer": "ernst kummer"
    },
    {
        " was working towards a theory of ": null
    },
    {
        "cyclotomic field": "cyclotomic field"
    },
    {
        "s. It had been realised that failure to complete proofs in the general case of ": null
    },
    {
        "Fermats last theorem": "fermats last theorem"
    },
    {
        " by factorisation using the ": null
    },
    {
        "roots of unity": "roots of unity"
    },
    {
        " was for a very good reason: a failure of the ": null
    },
    {
        "fundamental theorem of arithmetic": "fundamental theorem of arithmetic"
    },
    {
        " to hold in the ": null
    },
    {
        "ring": "ring"
    },
    {
        "s generated by those roots of unity was a major obstacle. Out of Kummers work for the first time came a study of the obstruction to the factorisation. We now recognise this as part of the ideal class group: in fact Kummer had isolated the p-": null
    },
    {
        "torsion": "torsion subgroup"
    },
    {
        " in that group for the field of p-roots of unity, for any prime number p, as the reason for the failure of the standard method of attack on the Fermat problem .     Somewhat later again ": null
    },
    {
        "Dedekind": "richard dedekind"
    },
    {
        " formulated the concept of ": null
    },
    {
        "ideal": "ideal"
    },
    {
        ", Kummer having worked in a different way. At this point the existing examples could be unified. It was shown that while rings of ": null
    },
    {
        "algebraic integer": "algebraic integer"
    },
    {
        "s do not always have unique factorization into primes , they do have the property that every proper ideal admits a unique factorization as a product of ": null
    },
    {
        "prime ideal": "prime ideal"
    },
    {
        "s . The size of the ideal class group can be considered as a measure for the deviation of a ring from being a principal ideal domain; a ring is a principal domain if and only if it has a trivial ideal class group.         If R is an ": null
    },
    {
        "integral domain": "integral domain"
    },
    {
        ", define a ": null
    },
    {
        "relation": "relation"
    },
    {
        " ~ on nonzero ": null
    },
    {
        "fractional ideal": "fractional ideal"
    },
    {
        "s of R by I ~ J whenever there exist nonzero elements a and b of R such that I J.  It is easily shown that this is an ": null
    },
    {
        "equivalence relation": "equivalence relation"
    },
    {
        ". The ": null
    },
    {
        "equivalence class": "equivalence class"
    },
    {
        "es are called the ideal classes of R.   Ideal classes can be multiplied: if I denotes the equivalence class of the ideal I, then the multiplication IJ IJ is well-defined and ": null
    },
    {
        "commutative": "commutative"
    },
    {
        ". The principal ideals form the ideal class R which serves as an ": null
    },
    {
        "identity element": "identity element"
    },
    {
        " for this multiplication. Thus a class I has an inverse J if and only if there is an ideal J such that IJ is a principal ideal. In general, such a J may not exist and consequently the set of ideal classes of R may only be a ": null
    },
    {
        "monoid": "monoid"
    },
    {
        ".     However, if R is the ring of ": null
    },
    {
        "algebraic integers": "algebraic integers"
    },
    {
        " in an ": null
    },
    {
        "algebraic number field": "algebraic number field"
    },
    {
        ", or more generally a ": null
    },
    {
        "Dedekind domain": "dedekind domain"
    },
    {
        ", the multiplication defined above turns the set of fractional ideal classes into an ": null
    },
    {
        "abelian group": "abelian group"
    },
    {
        ", the ideal class group of R. The group property of existence of ": null
    },
    {
        "inverse element": "inverse element"
    },
    {
        "s follows easily from the fact that, in a Dedekind domain, every non-zero ideal  is a product of ": null
    },
    {
        "prime ideals": "prime ideals"
    },
    {
        ".       The ideal class group is trivial if and only if all ideals of R are principal. In this sense, the ideal class group measures how far R is from being a ": null
    },
    {
        "principal ideal domain": "principal ideal domain"
    },
    {
        ", and hence from satisfying unique prime factorization .     The number of ideal classes  may be infinite in general. In fact, every abelian group is isomorphic to the ideal class group of some Dedekind domain.  But if R is in fact a ring of algebraic integers, then the class number is always finite. This is one of the main results of classical algebraic number theory.     Computation of the class group is hard, in general; it can be done by hand for the ring of integers in an ": null
    },
    {
        "algebraic number field": "algebraic number field"
    },
    {
        " of small ": null
    },
    {
        "discriminant": "discriminant of an algebraic number field"
    },
    {
        ", using ": null
    },
    {
        "Minkowskis bound": "minkowskis bound"
    },
    {
        ". This result gives a bound, depending on the ring, such that every ideal class contains an ": null
    },
    {
        "ideal norm": "ideal norm"
    },
    {
        " less than the bound. In general the bound is not sharp enough to make the calculation practical for fields with large discriminant, but computers are well suited to the task.     The mapping from rings of integers R to their corresponding class groups is functorial, and the class group can be subsumed under the heading of ": null
    },
    {
        "algebraic K-theory": "algebraic k-theory"
    },
    {
        ", with K 42  being the functor assigning to R its ideal class group; more precisely, K 42  Z & times;C, where C is the class group. Higher K groups can also be employed and interpreted arithmetically in connection to rings of integers.       It was remarked above that the ideal class group provides part of the answer to the question of how much ideals in a ": null
    },
    {
        "Dedekind domain": "dedekind domain"
    },
    {
        " behave like elements. The other part of the answer is provided by the multiplicative ": null
    },
    {
        "group": "group"
    },
    {
        " of ": null
    },
    {
        "unit": "unit"
    },
    {
        "s of the Dedekind domain, since passage from principal ideals   to their generators requires the use of units :     Define a map from R & times; to the set of all nonzero fractional ideals of R by sending every element to the principal ideal it generates. This is a ": null
    },
    {
        "group homomorphism": "group homomorphism"
    },
    {
        "; its ": null
    },
    {
        "kernel": "kernel"
    },
    {
        " is the group of units of R, and its cokernel is the ideal class group of R. The failure of these groups to be trivial is a measure of the failure of the map to be an isomorphism: that is the failure of ideals to act like ring elements, that is to say, like numbers.         The rings  Z , ": null
    },
    {
        "Z[ω": "eisenstein integers"
    },
    {
        ", and ": null
    },
    {
        "Z[i": "gaussian integers"
    },
    {
        ", where ω is a cube root of 42 and i is a fourth root of 42 , are all principal ideal domains , and so have class number 42: that is, they have trivial ideal class groups.   If k is a field, then the ": null
    },
    {
        "polynomial ring": "polynomial ring"
    },
    {
        " kX 42 , X 42 , X 42 , ... is an integral domain. It has a countably infinite set of ideal classes.       If d is a ": null
    },
    {
        "square-free integer": "square-free integer"
    },
    {
        " other than 42 then Q is a ": null
    },
    {
        "quadratic extension of Q": "quadratic field"
    },
    {
        ". If d  42 then it is unknown whether there are infinitely many fields Q with class number 42 Computational results indicate that there are a great many such fields. However, it is not even known if there are infinitely many ": null
    },
    {
        "number field": "number field"
    },
    {
        "s with class number 42       For d  42 the ideal class group may be half the size since the class group of integral binary quadratic forms is isomorphic to the ": null
    },
    {
        "narrow class group": "narrow class group"
    },
    {
        " of Q.      For real quadratic integer rings, the class number is given in ; for the imaginary case, they are given in .         The ": null
    },
    {
        "quadratic integer": "quadratic integer"
    },
    {
        " ring R Z is the ring of integers of Q. It does not possess unique factorization; in fact the class group of R is cyclic of order 42 Indeed, the ideal   : J    is not principal, which can be proved by contradiction as follows. R has a ": null
    },
    {
        "norm": "field norm"
    },
    {
        " function N a^42 + 42 b^42 , which satisfies N NN , and N 42 if and only if u is a unit in R . First of all, J \\ne R , because the quotient ring of R modulo the ideal is isomorphic to \\mathbf / 42 \\mathbf , so that the ": null
    },
    {
        "quotient ring": "quotient ring"
    },
    {
        " of R modulo J is isomorphic to \\mathbf / 42 \\mathbf . If J were generated by an element x of R, then x would divide both 42 and 42 + . Then the norm N would divide both N 42 and N 42 , so N would divide 42 If N 42 , then x is a unit, and J R , a contradiction. But N cannot be 42 either, because R has no elements of norm 42 because the ": null
    },
    {
        "Diophantine equation": "diophantine equation"
    },
    {
        " b^42 + 42 c^42 42 has no solutions in integers, as it has no solutions modulo 42     One also computes that J 42 , which is principal, so the class of J in the ideal class group has order two. Showing that there arent any other ideal classes requires more effort.     The fact that this J is not principal is also related to the fact that the element 42 has two distinct factorisations into irreducibles:   : 42 42 & times; 42  & times; .         ": null
    },
    {
        "Class field theory": "class field theory"
    },
    {
        " is a branch of ": null
    },
    {
        "algebraic number theory": "algebraic number theory"
    },
    {
        " which seeks to classify all the ": null
    },
    {
        "abelian extension": "galois theory"
    },
    {
        "s of a given algebraic number field, meaning Galois extensions with abelian ": null
    },
    {
        "Galois group": "galois group"
    },
    {
        ". A particularly beautiful example is found in the ": null
    },
    {
        "Hilbert class field": "hilbert class field"
    },
    {
        " of a number field, which can be defined as the maximal ": null
    },
    {
        "unramified": "unramified"
    },
    {
        " abelian extension of such a field. The Hilbert class field L of a number field K is unique and has the following properties:     Every ideal of the ring of integers of K becomes principal in L, i.e., if I is an integral ideal of K then the image of I is a principal ideal in L.   L is a Galois extension of K with Galois group isomorphic to the ideal class group of K": null
    }
]