[
    {
        "     An ideogram or ideograph  is a ": null
    },
    {
        "graphic": "Graphic"
    },
    {
        " symbol": "Symbol"
    },
    {
        " that represents an ": null
    },
    {
        "idea": "Idea"
    },
    {
        " or concept, independent of any particular language, and specific words or phrases. Some ideograms are comprehensible only by familiarity with prior convention; others convey their meaning through pictorial resemblance to a physical object, and thus may also be referred to as ": null
    },
    {
        "pictogram": "Pictogram"
    },
    {
        "s.                   In ": null
    },
    {
        "proto-writing": "Proto-Writing"
    },
    {
        ", used for inventories and the like, physical objects are represented by stylized or conventionalized pictures, or ": null
    },
    {
        "pictogram": "Pictogram"
    },
    {
        "s. For example, the pictorial ": null
    },
    {
        "Dongba symbols": "Dongba Symbols"
    },
    {
        " without ": null
    },
    {
        "Geba": "Geba Syllabary"
    },
    {
        " annotation cannot represent the ": null
    },
    {
        "Naxi language": "Naxi Language"
    },
    {
        ", but are used as a mnemonic for reciting oral literature.    Some systems also use ideograms, symbols denoting abstract concepts.     The term ideogram is often used to describe symbols of ": null
    },
    {
        "writing systems": "Writing System"
    },
    {
        "such as ": null
    },
    {
        "Egyptian hieroglyphs": "Egyptian Hieroglyphs"
    },
    {
        ", ": null
    },
    {
        "Sumerian cuneiform": "Sumerian Cuneiform"
    },
    {
        " and ": null
    },
    {
        "Chinese character": "Chinese Character"
    },
    {
        "s. However, these symbols are ": null
    },
    {
        "logogram": "Logogram"
    },
    {
        "s, representing words or morphemes of a particular language rather than objects or concepts. In these writing systems, a variety of strategies were employed in the design of logographic symbols.   Pictographic symbols depict the object referred to by the word, such as an icon of a bull denoting the Semitic word ʾālep ox .   Some words denoting abstract concepts may be represented iconically, but most other words are represented using the ": null
    },
    {
        "rebus": "Rebus"
    },
    {
        " principle, borrowing a symbol for a similarly-sounding word. Later systems used selected symbols to represent the sounds of the language, for example the adaptation of the logogram for ʾālep ox as the ": null
    },
    {
        "letter": "Letter"
    },
    {
        " aleph": "Aleph"
    },
    {
        " representing the initial sound of the word, a ": null
    },
    {
        "glottal stop": "Glottal Stop"
    },
    {
        ".     Many signs in ": null
    },
    {
        "hieroglyphic": "Egyptian Hieroglyphs"
    },
    {
        " as well as in ": null
    },
    {
        "cuneiform writing": "Cuneiform Writing"
    },
    {
        " could be used either logographically or phonetically. For example, the Akkadian sign ": null
    },
    {
        "AN": "Dingir"
    },
    {
        "  could be an ideograph for ": null
    },
    {
        "deity": "Deity"
    },
    {
        " , an ideogram for the god ": null
    },
    {
        "Anum": "An"
    },
    {
        " in particular, a logograph for the Akkadian stem  il-  deity , a logograph for the Akkadian word šamu sky , or a ": null
    },
    {
        "syllabogram": "Syllabogram"
    },
    {
        " for either the syllable an or il.     Although Chinese characters are logograms, two of the smaller classes in the ": null
    },
    {
        "traditional classification": "Chinese Character Classification"
    },
    {
        " are ideographic in origin:   Simple ideographs  are abstract symbols such as 上 shàng up and 下 xià down or numerals such as 三 sān three .   Semantic compounds  are semantic combinations of characters, such as 明 míng bright , composed of 日 rì sun and 月 yuè moon , or 休 xiū rest , composed of 人 rén person and 木 mù tree . In the light of the modern understanding of ": null
    },
    {
        "Old Chinese phonology": "Old Chinese Phonology"
    },
    {
        ", researchers now believe that most of the characters originally classified as semantic compounds have an at least partially phonetic nature.      An example of ideograms is the ": null
    },
    {
        "collection of 50 signs": "Dot Pictograms"
    },
    {
        " developed in the 1970s by the ": null
    },
    {
        "American Institute of Graphic Arts": "American Institute Of Graphic Arts"
    },
    {
        " at the request of the ": null
    },
    {
        "US Department of Transportation": "Us Department Of Transportation"
    },
    {
        ". , AIGA. The system was initially used to mark airports and gradually became more widespread.         Mathematical symbols are a type of ideogram.             Inspired by inaccurate early descriptions of Chinese and Japanese characters as ideograms, many Western thinkers have sought to design universal written languages, in which symbols denote concepts rather than words. An early proposal was  An Essay towards a Real Character, and a Philosophical Language  by ": null
    },
    {
        "John Wilkins": "John Wilkins"
    },
    {
        ". A recent example is the system of ": null
    },
    {
        "Blissymbols": "Blissymbols"
    },
    {
        ", which was proposed by ": null
    },
    {
        "Charles K. Bliss": "Charles K. Bliss"
    }
]