[
    {
        "An idiom dictionary is a ": null
    },
    {
        "dictionary": "dictionary"
    },
    {
        " or ": null
    },
    {
        "phrase book": "phrase book"
    },
    {
        " that lists and explains ": null
    },
    {
        "idiom": "idiom"
    },
    {
        "s  – distinctive words or phrases having a ": null
    },
    {
        "figurative meaning": "literal and figurative language"
    },
    {
        " that goes beyond the original ": null
    },
    {
        "semantics": "semantics"
    },
    {
        " of the word. For example, the phrase keep your breath to cool your porridge is more likely to be a rebuke to mind your own business than literal advice at breakfast.          An idiom is a phrase whose meaning could not be readily deduced from the meaning of its individual words. The word comes from the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " ἰδίωμα  – the distinctive style of a particular person. The traditional example is ": null
    },
    {
        "kick the bucket": "kick the bucket"
    },
    {
        " which is normally understood to mean dying. The extent to which a phrase is thought idiomatic is a matter of degree and native speakers of English consider a phrase like pop the question to be less idiomatic than kick the bucket .       An idiom dictionary may be a traditional book or expressed in another medium such as a database within software for ": null
    },
    {
        "machine translation": "machine translation"
    },
    {
        ". Examples of the genre include  Brewers Dictionary of Phrase and Fable , which explains traditional allusions and proverbs, and  Fowlers Modern English Usage , which was conceived as an idiom dictionary following the completion of the  Concise Oxford English Dictionary , which itself contained many idioms.        Some multilingual dictionaries of idioms are available on-line.   One of them is  which is freely accessible.     The main readership and market for idiom dictionaries are ": null
    },
    {
        "deaf": "deaf"
    },
    {
        " people and learners of ": null
    },
    {
        "English as a foreign language": "english as a foreign language"
    },
    {
        " . The first major dictionary of idioms in ": null
    },
    {
        "American English": "american english"
    },
    {
        " was A Dictionary of Idioms for the Deaf; published in 42 by the ": null
    },
    {
        "American School for the Deaf": "american school for the deaf"
    },
    {
        ". Subsequent editions were published under the more general title of A Dictionary of American Idioms.       Idioms may vary considerably in their presentation. The keywords may vary  – green fingers or a green thumb . The grammar may vary  – turn the tables or the tables are turned . A phrase may even be recast completely, just following a pattern  – a few gallons shy of a full tank or one sandwich short of a picnic . This variation makes organisation of an idiom dictionary difficult. The idioms may be organised in simple alphabetical order, as in The Oxford Dictionary of Current Idiomatic English. They may be grouped by keyword, as in the Longman Dictionary of English Idioms. Or they may be grouped by domain so that, for example, all idioms based upon ": null
    },
    {
        "nautical expressions": "glossary of nautical terms"
    },
    {
        " such as show him the ropes and three sheets to the wind are put together.       Bilingual dictionaries have an additional problem when dealing with idioms  – as well as explaining the idiom, they also have to translate it. In doing so, they will commonly provide both a ": null
    },
    {
        "literal translation": "literal translation"
    },
    {
        " and a ": null
    },
    {
        "free translation": "free translation"
    },
    {
        ". For example, the phrase can be counted on the fingers of one hand , meaning few in number, may translated literally into Chinese as qu zhe ke shu and, more sensibly, as liao liao wu ji .": null
    }
]