[
    {
        "In ": null
    },
    {
        "Inuit mythology": "inuit mythology"
    },
    {
        ", Igaluk is one of the most powerful gods of the pantheon. He is a ": null
    },
    {
        "lunar deity": "lunar deity"
    },
    {
        ". In ": null
    },
    {
        "Greenland": "greenland"
    },
    {
        ", he is known as Aningaaq.       According to Inuit mythology, Igaluk and his sister ": null
    },
    {
        "Malina": "malina"
    },
    {
        " lived together in a village. They were very close when young, but came to live apart as they grew older, in the lodges for women and for men. One day, as Igaluk looked at the women, he found that his sister was the most beautiful. And so that night, as everyone slept, he crept into the womens dwelling and forced himself upon her. As it was dark, Malina was unable to tell who her attacker was, but the next night, when the same thing happened, she covered her hands with the soot from the lamps and smeared the Anningans face with it. Afterwards, she took a lamp and looked through the skylight of the mens lodge. She was surprised to find that the man was Igaluk, her own brother. So Malina sharpened her ": null
    },
    {
        "knife": "ulu"
    },
    {
        " and cut off her breasts. She put them in a bowl and carried this to the mens lodge, and presented it to Igaluk, saying If you enjoy me so much, then eat these, and ran away out the door, grabbing a torch as she went. Igaluk chased after her, likewise taking a torch, and was able to easily follow her path, as her footsteps were marked with great pools of blood. However, he tripped and dropped his torch, and the flame was put out, except for a faint glow. Eventually however, Igaluk caught up to his sister, and the two ran so fast that they took off into the sky and became the moon and the sun.       Tulok, according to Inuit mythology, is the nemesis of Aningan. A true warrior who, after hearing of the incest of Anningan, decided to challenge him to battle. As by this time Aningan had become the sun he devised a plan to run so fast he could reach into the sky and pour a bucket of mythical water over the sun to put out its flames. But upon hearing this, Malina, realising the devastating effect of the loss of the sun, banded together with Aningan and became an eclipse, so that when Tulok reached the sky he would become trapped. It is said after this he split to a thousand pieces, and became the stars.                      ": null
    }
]