[
    {
        "     Ignaz Philipp Semmelweis  was a ": null
    },
    {
        "Hungarian": "kingdom of hungary"
    },
    {
        " physician and scientist, now known as an early pioneer of antiseptic procedures. Described as the saviour of mothers , Semmelweis discovered that the ": null
    },
    {
        "incidence": "incidence"
    },
    {
        " of ": null
    },
    {
        "puerperal fever": "puerperal fever"
    },
    {
        " could be drastically cut by the use of hand disinfection in ": null
    },
    {
        "obstetrical": "obstetrics"
    },
    {
        " clinics. Puerperal fever was common in mid42th-century hospitals and often fatal. Semmelweis proposed the practice of ": null
    },
    {
        "washing hands": "hand washing"
    },
    {
        " with ": null
    },
    {
        "chlorinated lime solutions": "calcium hypochlorite"
    },
    {
        " in 42 while working in ": null
    },
    {
        "Vienna General Hospital": "vienna general hospital"
    },
    {
        "s First Obstetrical Clinic, where doctors wards had three times the mortality of ": null
    },
    {
        "midwives": "midwifery"
    },
    {
        " wards. He published a book of his findings in  Etiology, Concept and Prophylaxis of Childbed Fever .     Despite various publications of results where hand washing reduced ": null
    },
    {
        "mortality": "death"
    },
    {
        " to below 42%, Semmelweiss observations conflicted with the established scientific and medical opinions of the time and his ideas were rejected by the medical community. Semmelweis could offer no acceptable scientific explanation for his findings, and some doctors were offended at the suggestion that they should wash their hands and mocked him for it. In 42 Semmelweis supposedly suffered a nervous breakdown and was treacherously committed to an ": null
    },
    {
        "asylum": "psychiatric hospital"
    },
    {
        " by his colleague, where he died, a mere 42 days later, at the age of 42 after being beaten by the guards, from a gangrenous wound, due to an infection on his right hand which might have been caused by the beating . Semmelweiss practice earned widespread acceptance only years after his death, when ": null
    },
    {
        "Louis Pasteur": "louis pasteur"
    },
    {
        " confirmed the ": null
    },
    {
        "germ theory": "germ theory of disease"
    },
    {
        ", and ": null
    },
    {
        "Joseph Lister": "joseph lister, 1st baron lister"
    },
    {
        ", acting on the French ": null
    },
    {
        "microbiologist": "microbiologist"
    },
    {
        "s research, practised and operated, using hygienic methods, with great success.             Ignaz Semmelweis was born on 42 July 42 in ": null
    },
    {
        "Tabán": "tabán"
    },
    {
        ", neighbourhood of ": null
    },
    {
        "Buda": "buda"
    },
    {
        ", ": null
    },
    {
        "Hungary": "kingdom of hungary"
    },
    {
        ", today part of ": null
    },
    {
        "Budapest": "budapest"
    },
    {
        ". He was the fifth child out of ten of the prosperous ": null
    },
    {
        "grocer": "grocer"
    },
    {
        " family of József Semmelweis and Teréz Müller.     Of ": null
    },
    {
        "German": "germans of hungary"
    },
    {
        " ancestry, his father was an ethnic German  born in ": null
    },
    {
        "Kismarton": "eisenstadt"
    },
    {
        ", then part of Hungary, now ": null
    },
    {
        "Eisenstadt": "eisenstadt"
    },
    {
        ", Austria. He achieved permission to set up a shop in Buda in 42 and, in the same year, opened a wholesale business for spices and general consumer goods. The company was named zum Weißen Elefanten in Meindl-Haus in ": null
    },
    {
        "Tabán": "tabán"
    },
    {
        " . By 42 he was a wealthy man and married Teréz Müller, daughter of the coach builder Fülöp Müller.     Ignaz Semmelweis began studying law at the ": null
    },
    {
        "University of Vienna": "university of vienna"
    },
    {
        " in the autumn of 42 but by the following year, for reasons that are no longer known, he had switched to medicine. He was awarded his doctorate degree in medicine in 42 Later, after failing to obtain an appointment in a clinic for internal medicine, Semmelweis decided to specialize in obstetrics. His teachers included ": null
    },
    {
        "Carl von Rokitansky": "carl von rokitansky"
    },
    {
        ", ": null
    },
    {
        "Joseph Škoda": "joseph škoda"
    },
    {
        " and ": null
    },
    {
        "Ferdinand von Hebra": "ferdinand ritter von hebra"
    },
    {
        ".             Semmelweis was appointed assistant to Professor ": null
    },
    {
        "Johann Klein": "johann klein"
    },
    {
        " in the First Obstetrical Clinic of the ": null
    },
    {
        "Vienna General Hospital": "vienna general hospital"
    },
    {
        " on July 42 42 A comparable position today in a United States hospital would be chief resident.  His duties were to examine patients each morning in preparation for the professors rounds, supervise difficult deliveries, teach students of obstetrics and be clerk of records.     Maternity institutions were set up all over Europe to address problems of ": null
    },
    {
        "infanticide": "infanticide"
    },
    {
        " of illegitimate children. They were set up as gratis institutions and offered to care for the infants, which made them attractive to underprivileged women, including prostitutes. In return for the free services, the women would be subjects for the training of doctors and midwives. Two maternity clinics were at the Viennese hospital. The First Clinic had an average ": null
    },
    {
        "maternal": "maternal bond"
    },
    {
        " mortality rate": "mortality rate"
    },
    {
        " of about 42% due to puerperal fever. The Second Clinics rate was considerably lower, averaging less than 42%. This fact was known outside the hospital. The two clinics admitted on alternate days, but women begged to be admitted to the Second Clinic, due to the bad reputation of the First Clinic. Semmelweis described desperate women begging on their knees not to be admitted to the First Clinic. Some women even preferred to give birth in the streets, pretending to have given sudden birth en route to the hospital , which meant they would still qualify for the child care benefits without having been admitted to the clinic. Semmelweis was puzzled that puerperal fever was rare among women giving street births. To me, it appeared logical that patients who experienced street births would become ill at least as frequently as those who delivered in the clinic. What protected those who delivered outside the clinic from these destructive unknown endemic influences?      Semmelweis was severely troubled that his First Clinic had a much higher mortality rate due to puerperal fever than the Second Clinic. It made me so miserable that life seemed worthless . The two clinics used almost the same techniques, and Semmelweis started a meticulous process of eliminating all possible differences, including even religious practices. The only major difference was the individuals who worked there. The First Clinic was the teaching service for medical students, while the Second Clinic had been selected in 42 for the instruction of midwives only.             He excluded overcrowding as a cause, since the Second Clinic was always more crowded and yet the mortality was lower. He eliminated climate as a cause because the climate was the same. The breakthrough occurred in 42 following the death of his good friend ": null
    },
    {
        "Jakob Kolletschka": "jakob kolletschka"
    },
    {
        ", who had been accidentally poked with a students scalpel while performing a ": null
    },
    {
        "post mortem examination": "autopsy"
    },
    {
        ". Kolletschkas own autopsy showed a ": null
    },
    {
        "pathology": "pathology"
    },
    {
        " similar to that of the women who were dying from puerperal fever. Semmelweis immediately proposed a connection between ": null
    },
    {
        "cadaver": "cadaver"
    },
    {
        "ic contamination and puerperal fever.     He concluded that he and the medical students carried cadaverous particles on their hands from the autopsy room to the patients they examined in the First Obstetrical Clinic. This explained why the student ": null
    },
    {
        "midwives": "midwife"
    },
    {
        " in the Second Clinic, who were not engaged in autopsies and had no contact with corpses, saw a much lower mortality rate.     The ": null
    },
    {
        "germ theory of disease": "germ theory of disease"
    },
    {
        " had not yet been accepted in Vienna. Thus, Semmelweis concluded some unknown cadaverous material caused childbed fever. He instituted a policy of using a solution of chlorinated lime  for washing hands between autopsy work and the examination of patients. He did this because he found that this chlorinated solution worked best to remove the putrid smell of infected autopsy tissue, and thus perhaps destroyed the causal poisonous or contaminating cadaveric agent hypothetically being transmitted by this material.     The result was the mortality rate in the First Clinic dropped 42%, and was then comparable to that in the Second Clinic. The mortality rate in April 42 was 42%. After ": null
    },
    {
        "hand washing": "hand washing"
    },
    {
        " was instituted in mid-May, the rates in June were 42%, July 42%, August 42% and, for the first time since the introduction of anatomical orientation, the death rate was zero in two months in the year following this discovery.       Semmelweiss hypothesis, that there was only one cause, that all that mattered was cleanliness, was extreme at the time, and was largely ignored, rejected, or ridiculed. He was dismissed from the hospital for political reasons and harassed by the medical community in Vienna, being eventually forced to move to Budapest.     Semmelweis was outraged by the indifference of the medical profession and began writing open and increasingly angry letters to prominent European obstetricians, at times denouncing them as irresponsible murderers. His contemporaries, including his wife, believed he was losing his mind, and in 42 nearly twenty years after his breakthrough, he was committed to the Landesirrenanstalt Döbling  . He died there of ": null
    },
    {
        "septic shock": "sepsis"
    },
    {
        " only 42 days later, possibly as the result of being severely beaten by guards. Semmelweiss practice earned widespread acceptance only years after his death, when Louis Pasteur developed the germ theory of disease, offering a theoretical explanation for Semmelweiss findings. He is considered a pioneer of antiseptic procedures.               Semmelweiss observations conflicted with the established scientific and medical opinions of the time. The theory of diseases was highly influenced by ideas of an imbalance of the basic ": null
    },
    {
        "four humours": "humorism"
    },
    {
        " in the body, a theory known as ": null
    },
    {
        "dyscrasia": "dyscrasia"
    },
    {
        ", for which the main treatment was ": null
    },
    {
        "bloodletting": "bloodletting"
    },
    {
        "s. Medical texts at the time emphasized that each case of disease was unique, the result of a personal imbalance, and the main difficulty of the medical profession was to establish precisely each patients unique situation, case by case.     The findings from autopsies of deceased women also showed a confusing multitude of physical signs, which emphasized the belief that puerperal fever was not one, but many different, yet unidentified, diseases.     The rejection of Semmelweiss empirical observations is often traced to ": null
    },
    {
        "belief perseverance": "belief perseverance"
    },
    {
        ", the psychological tendency of clinging to discredited beliefs. Also, some historians of science argue that resistance to path-breaking contributions of obscure scientists is common and constitutes the single most formidable block to scientific advances.     As a result, his ideas were rejected by the medical community. Other, more subtle, factors may also have played a role. Some doctors, for instance, were offended at the suggestion that they should wash their hands, feeling that their social status as gentlemen was inconsistent with the idea that their hands could be unclean.     Semmelweiss results lacked scientific explanation at the time. That became possible only some decades later, when Louis Pasteur, Joseph Lister, and others developed the germ theory of disease.     During 42 Semmelweis widened the scope of his washing protocol, to include all instruments coming in contact with patients in labour, and used mortality rates ": null
    },
    {
        "time series": "time series"
    },
    {
        " to document his success in virtually eliminating puerperal fever from the hospital ward.          Toward the end of 42 accounts of Semmelweiss work began to spread around Europe. Semmelweis and his students wrote letters to the directors of several prominent maternity clinics describing their recent observations. ": null
    },
    {
        "Ferdinand von Hebra": "ferdinand ritter von hebra"
    },
    {
        ", the editor of a leading Austrian medical journal, announced Semmelweiss discovery in the December 42 and April 42 issues of the medical journal. Hebra claimed that Semmelweiss work had a practical significance comparable to that of ": null
    },
    {
        "Edward Jenner": "edward jenner"
    },
    {
        "s introduction of cowpox inoculations to prevent smallpox.     In late 42 one of Semmelweiss former students wrote a lecture explaining Semmelweiss work. The lecture was presented before the Royal Medical and Surgical Society in London and a review published in  The Lancet , a prominent medical journal. A few months later, another of Semmelweiss former students published a similar essay in a French periodical.     As accounts of the dramatic reduction in mortality rates in Vienna were being circulated throughout Europe, Semmelweis had reason to expect that the chlorine washings would be widely adopted, saving tens of thousands of lives. Early responses to his work also gave clear signs of coming trouble, however. Some physicians had clearly misinterpreted his claims. ": null
    },
    {
        "James Young Simpson": "james young simpson"
    },
    {
        ", for instance, saw no difference between Semmelweiss groundbreaking findings and the British idea suggested by ": null
    },
    {
        "Oliver Wendell Holmes": "oliver wendell holmes sr."
    },
    {
        " in 42 that childbed fever was contagious . Indeed, initial responses to Semmelweiss findings were that he had said nothing new.     In fact, Semmelweis was warning against all decaying organic matter, not just against a specific contagion that originated from victims of childbed fever themselves. This misunderstanding, and others like it, occurred partly because Semmelweiss work was known only through secondhand reports written by his colleagues and students. At this crucial stage, Semmelweis himself had published nothing. These and similar misinterpretations continued to cloud discussions of his work throughout the century.     Some accounts emphasize that Semmelweis refused to communicate his method officially to the learned circles of Vienna, nor was he eager to explain it on paper.       In 42 ": null
    },
    {
        "a series of tumultuous revolutions": "revolutions of 1848"
    },
    {
        " swept across Europe. The resulting political turmoil would affect Semmelweiss career. In Vienna on 42 March 42 students demonstrated in favor of increased civil rights, including trial by jury and freedom of expression. The demonstrations were led by medical students and young faculty members and were joined by workers from the suburbs. Two days later in Hungary, demonstrations and uprisings led to the ": null
    },
    {
        "Hungarian Revolution of 42": "hungarian revolution of 1848"
    },
    {
        " and a full-scale war against the ruling ": null
    },
    {
        "Habsburgs": "house of habsburg"
    },
    {
        " of the ": null
    },
    {
        "Austrian Empire": "austrian empire"
    },
    {
        ". In Vienna, the March demonstration was followed by months of general unrest.     No evidence indicates Semmelweis was personally involved in the events of 42 Some of his brothers were punished for active participation in the Hungarian independence movement, and the Hungarian-born Semmelweis likely was sympathetic to the cause. Semmelweiss superior, professor ": null
    },
    {
        "Johann Klein": "johann klein"
    },
    {
        ", was a conservative Austrian, likely uneasy with the independence movements and alarmed by the other ": null
    },
    {
        "revolutions of 42 in the Habsburg areas": "revolutions of 1848 in the habsburg areas"
    },
    {
        ". Klein probably mistrusted Semmelweis.     When Semmelweiss term was about to expire, ": null
    },
    {
        "Carl Braun": "carl braun"
    },
    {
        " also applied for the position of assistant in the First Clinic, possibly at Kleins own invitation. Semmelweis and Braun were the only two applicants for the post. Semmelweiss predecessor, ": null
    },
    {
        "Franz Breit": "franz breit"
    },
    {
        ", had been granted a two-year extension. Semmelweiss application for an extension was supported by ": null
    },
    {
        "Joseph Škoda": "joseph škoda"
    },
    {
        " and ": null
    },
    {
        "Carl von Rokitansky": "carl freiherr von rokitansky"
    },
    {
        " and by most of the medical faculty, but Klein chose Braun for the position. Semmelweis was obliged to leave the obstetrical clinic when his term expired on March 42 42     The day his term expired, Semmelweis petitioned the Viennese authorities to be made ": null
    },
    {
        "docent": "privatdozent"
    },
    {
        " of obstetrics. A docent was a private lecturer who taught students and who had access to some university facilities. At first, because of Kleins opposition, Semmelweiss petition was denied. He reapplied, but had to wait until 42 October 42 , before finally being appointed docent of theoretical obstetrics. The terms refused him access to cadavers and limited him to teaching students by using leather-fabricated ": null
    },
    {
        "mannequin": "mannequin"
    },
    {
        "s only. A few days after being notified of his appointment, Semmelweis left Vienna abruptly and returned to Pest. He apparently left without so much as saying good-bye to his former friends and colleagues, a move that might have offended them. According to his own account, he left Vienna because he was unable to endure further frustrations in dealing with the Viennese medical establishment .          During 42–42 some  troops from the ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        "-ruled ": null
    },
    {
        "Austrian Empire": "austrian empire"
    },
    {
        " thwarted the ": null
    },
    {
        "Hungarian independence movement": "hungarian revolution of 1848"
    },
    {
        ", executed or imprisoned its leaders and in the process destroyed parts of ": null
    },
    {
        "Pest": "pest, hungary"
    },
    {
        ". Semmelweis, upon arriving from the Habsburg Vienna in 42 likely was not warmly welcomed in Pest.     On 42 May 42 Semmelweis took the relatively insignificant, unpaid, honorary head-physician position of the obstetric ward of Pests small ": null
    },
    {
        "Szent Rókus": "saint roch"
    },
    {
        " Hospital. He held that position for six years, until June 42 Childbed fever was rampant at the clinic; at a visit in 42 just after returning to Pest, Semmelweis found one fresh corpse, another patient in severe agony, and four others seriously ill with the disease. After taking over in 42 Semmelweis virtually eliminated the disease. During 42–42 only eight patients died from childbed fever out of 42 births .     Despite the impressive results, Semmelweiss ideas were not accepted by the other obstetricians in Budapest. The professor of obstetrics at the University of Pest, ": null
    },
    {
        "Ede Flórián Birly": "ede flórián birly"
    },
    {
        ", never adopted Semmelweiss methods. He continued to believe that puerperal fever was due to uncleanliness of the bowel. Therefore, extensive purging was the preferred treatment.     After Birly died in 42 Semmelweis applied for the position. So did Carl Braun  — Semmelweiss nemesis and successor as ": null
    },
    {
        "Johann Klein": "johann klein"
    },
    {
        "s assistant in Vienna  — and Braun received more votes from his Hungarian colleagues than Semmelweis did. Semmelweis was eventually appointed in 42 but only because the Viennese authorities overruled the wishes of the Hungarians, as Braun did not speak Hungarian. As professor of obstetrics, Semmelweis instituted chlorine washings at the University of Pest maternity clinic. Once again, the results were impressive.     Semmelweis declined an offer in 42 to become professor of obstetrics at the ": null
    },
    {
        "University of Zurich": "university of zurich"
    },
    {
        ". The same year, Semmelweis married Mária Weidenhofer , 42 years his junior and the daughter of a successful merchant in Pest. They had five children:   Antónia Tici  would have children of her own.   Mária  died at the age of four months.   Ignác  died shortly after birth.   Margit Máci  would remain unmarried.   Béla  committed suicide at age 42 .                Semmelweiss views were much more favorably received in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " than on the continent, but he was more often cited than understood. The British consistently regarded Semmelweis as having supported their theory of contagion. A typical example was W. Tyler Smith, who claimed that Semmelweis made out very conclusively that ": null
    },
    {
        "miasms": "homeopathy"
    },
    {
        " derived from the dissecting room will excite puerperal disease.  One of the first to respond to Semmelweiss 42 communications was ": null
    },
    {
        "James Young Simpson": "james young simpson"
    },
    {
        ", who wrote a stinging letter. Simpson surmised that the British obstetrical literature must be totally unknown in Vienna, or Semmelweis would have known that the British had long regarded childbed fever as contagious and would have employed chlorine washing to protect against it.     In 42 Semmelweiss assistant Josef Fleischer reported the successful results of hand washing activities at St. Rochus and Pest maternity institutions in the Viennese Medical Weekly . The editor remarked sarcastically that it was time people stopped being misled about the theory of chlorine washings. Two years later, Semmelweis finally published his own account of his work in an essay entitled The Etiology of Childbed Fever . Two years later, he published a second essay, The Difference in Opinion between Myself and the English Physicians regarding Childbed Fever . In 42 Semmelweis finally published his main work Die Ätiologie, der Begriff und die Prophylaxis des Kindbettfiebers . In his 42 book, Semmelweis lamented the slow adoption of his ideas: Most medical lecture halls continue to resound with lectures on epidemic childbed fever and with discourses against my theories. In published medical works my teachings are either ignored or attacked. The medical faculty at Würzburg awarded a prize to a monograph written in 42 in which my teachings were rejected .     In a textbook, Carl Braun, Semmelweiss successor as assistant in the first clinic, identified 42 causes of childbed fever; only the 42th of these was cadaverous infection. Other causes included conception and pregnancy, uremia, pressure exerted on adjacent organs by the shrinking uterus, emotional traumata, mistakes in diet, chilling, and atmospheric epidemic influences.     Despite this opposition, Braun, who was Assistant in the First Division in the period April 42 to Summer 42 maintained a relatively low mortality rate in the First Division, roughly consistent with the rate Semmelweis himself achieved, as ": null
    },
    {
        "mortality rates": "historical mortality rates of puerperal fevermortality rates at the vienna general hospitalyearly mortality rates for birthgiving women 1833-1858 for first and second clinics"
    },
    {
        " in the period April 42 to end 42 show. These results suggest that Braun continued, assiduously, to require the chlorine washings.     At a conference of German physicians and ": null
    },
    {
        "natural scientist": "natural scientist"
    },
    {
        "s, most of the speakers rejected his doctrine, including the celebrated ": null
    },
    {
        "Rudolf Virchow": "rudolf virchow"
    },
    {
        ", who was a scientist of the highest authority of his time. Virchows great authority in medical circles contributed potently to Semmelweis lack of recognition. ": null
    },
    {
        "Ede Flórián Birly": "ede flórián birly"
    },
    {
        ", Semmelweiss predecessor as Professor of Obstetrics at the University of Pest, never accepted Semmelweiss teachings; he continued to believe that puerperal fever was due to uncleanliness of the bowel. ": null
    },
    {
        "August Breisky": "august breisky"
    },
    {
        ", an obstetrician in Prague, rejected Semmelweiss book as naïve and he referred to it as the Koran of puerperal theology . Breisky objected that Semmelweis had not proved that puerperal fever and ": null
    },
    {
        "pyemia": "pyemia"
    },
    {
        " are identical, and he insisted that other factors beyond decaying organic matter certainly had to be included in the ": null
    },
    {
        "etiology": "etiology"
    },
    {
        " of the disease. ": null
    },
    {
        "Carl Edvard Marius Levy": "carl edvard marius levy"
    },
    {
        ", head of the Copenhagen maternity hospital and an outspoken critic of Semmelweiss ideas, had reservations concerning the unspecific nature of cadaverous particles and that the supposed quantities were unreasonably small. In fact, ": null
    },
    {
        "Robert Koch": "robert koch"
    },
    {
        " later used precisely this fact to prove that various infecting materials contained living organisms which could reproduce in the human body; that is, since the poison could be neither chemical nor physical in operation, it must be biological.     It has been contended that Semmelweis could have had an even greater impact if he had managed to communicate his findings more effectively and avoid antagonising the medical establishment, even given the opposition from entrenched viewpoints.             Beginning in 42 Semmelweis suffered from various nervous complaints. He suffered from severe depression and became absentminded. Paintings from 42 to 42 show a progression of aging. He turned every conversation to the topic of childbed fever.     After a number of unfavorable foreign reviews of his 42 book, Semmelweis lashed out against his critics in a series of Open Letters. They were addressed to various prominent European obstetricians, including ": null
    },
    {
        "Späth": "joseph späth"
    },
    {
        ", ": null
    },
    {
        "Scanzoni": "friedrich wilhelm scanzoni von lichtenfels"
    },
    {
        ", ": null
    },
    {
        "Siebold": "eduard caspar jacob von siebold"
    },
    {
        ", and to all obstetricians . They were full of bitterness, desperation, and fury and were highly polemical and superlatively offensive , at times denouncing his critics as irresponsible murderers or ignoramuses. He also called upon Siebold to arrange a meeting of German obstetricians somewhere in Germany to provide a forum for discussions on puerperal fever, where he would stay until all have been converted to his theory.      In mid42 his public behaviour became irritating and embarrassing to his associates. He also began to drink immoderately; he spent progressively more time away from his family, sometimes in the company of a prostitute; and his wife noticed changes in his sexual behavior. On July 42 42 the Semmelweis family visited friends, and during the visit Semmelweiss behavior seemed particularly inappropriate.     The exact nature of Semmelweiss affliction has been a subject of some debate. According to K Codell Carter, in his biography of Semmelweis, the exact nature of his affliction cannot be determined: It is impossible to appraise the nature of Semmelweiss disorder. ... It might have been ": null
    },
    {
        "Alzheimers disease": "alzheimers disease"
    },
    {
        ", a type of dementia, which is associated with rapid cognitive decline and mood changes. It might have been third-stage ": null
    },
    {
        "syphilis": "syphilis"
    },
    {
        ", a then-common disease of obstetricians who examined thousands of women at gratis institutions, or it might have been emotional exhaustion from overwork and stress. In 42 ": null
    },
    {
        "János Balassa": "jános balassa"
    },
    {
        " wrote a document referring Semmelweis to a mental institution. On July 42 Ferdinand Ritter von Hebra lured him, under the pretense of visiting one of Hebras new Institutes , to a Viennese insane asylum located in Lazarettgasse . Semmelweis surmised what was happening and tried to leave. He was severely beaten by several guards, secured in a ": null
    },
    {
        "straitjacket": "straitjacket"
    },
    {
        ", and confined to a darkened cell. Apart from the straitjacket, treatments at the ": null
    },
    {
        "mental institution": "mental institution"
    },
    {
        " included dousing with cold water and administering ": null
    },
    {
        "castor oil": "castor oil"
    },
    {
        ", a ": null
    },
    {
        "laxative": "laxative"
    },
    {
        ". He died after two weeks, on August 42 42 aged 42 from a ": null
    },
    {
        "gangrenous": "gangrene"
    },
    {
        " wound, due to an infection on his right hand which might have been caused by the struggle. The autopsy gave the cause of death as ": null
    },
    {
        "pyemia": "pyemia"
    },
    {
        "—": null
    },
    {
        "blood poisoning": "blood poisoning"
    },
    {
        ".     Semmelweis was buried in Vienna on August 42 42 Only a few people attended the service. Brief announcements of his death appeared in a few medical periodicals in Vienna and Budapest. Although the rules of the Hungarian Association of Physicians and Natural Scientists specified that a commemorative address be delivered in honor of a member who had died in the preceding year, there was no address for Semmelweis; his death was never even mentioned.     János Diescher was appointed Semmelweiss successor at the Pest University maternity clinic. Immediately, mortality rates jumped sixfold to 42%, but the physicians of Budapest said nothing; there were no inquiries and no protests. Almost no one  — either in Vienna or in Budapest  — seems to have been willing to acknowledge Semmelweiss life and work.     His remains were transferred to Budapest in 42 On 42 October 42 they were transferred once more to the house in which he was born. The house is now a historical museum and library, honoring Ignaz Semmelweis.                  Semmelweis advice on chlorine washings was probably more influential than he realized. Many doctors, particularly in Germany, appeared quite willing to experiment with the practical ": null
    },
    {
        "hand washing": "hand washing"
    },
    {
        " measures that he proposed, but virtually everyone rejected his basic and ground-breaking theoretical innovation  — that the disease had only one cause, lack of cleanliness. Professor ": null
    },
    {
        "Gustav Adolf Michaelis": "gustav adolf michaelis"
    },
    {
        " from a maternity institution in ": null
    },
    {
        "Kiel": "kiel"
    },
    {
        " replied positively to Semmelweis suggestions  — eventually he committed suicide, however, because he felt responsible for the death of his own cousin, whom he had examined after she gave birth.     Only belatedly did his observational evidence gain wide acceptance; more than twenty years later, ": null
    },
    {
        "Louis Pasteur": "louis pasteur"
    },
    {
        "s work offered a theoretical explanation for Semmelweis observations  — the germ theory of disease. As such, the Semmelweis story is often used in university courses with ": null
    },
    {
        "epistemology": "epistemology"
    },
    {
        " content, e.g. philosophy of science courses—demonstrating the virtues of ": null
    },
    {
        "empiricism": "empiricism"
    },
    {
        " or ": null
    },
    {
        "positivism": "positivism"
    },
    {
        " and providing a historical account of which types of knowledge count as scientific knowledge, and which do not. It has been seen as an irony that Semmelweis critics considered themselves positivists, but even positivism suffers problems in the face of theories which seem magical or superstitious, such as the idea that corpse particles might turn a person into a corpse, with no causal mechanism being stipulated, after a simple contact. To his contemporaries, Semmelweis seemed to be reverting to the speculative theories of earlier decades that were so repugnant to his positivist contemporaries.        The so-called ": null
    },
    {
        "Semmelweis reflex": "semmelweis reflex"
    },
    {
        "  — a metaphor for a certain type of human behaviour characterized by reflex-like rejection of new knowledge because it contradicts entrenched norms, beliefs, or paradigms  — is named after Semmelweis, whose ideas were ridiculed and rejected by his contemporaries.     Other legacies of Semmelweis include:   Semmelweis is now recognized as a pioneer of ": null
    },
    {
        "antiseptic": "antiseptic"
    },
    {
        " policy   ": null
    },
    {
        "Semmelweis University": "semmelweis university"
    },
    {
        ", a university for medicine and health-related disciplines , is named after Semmelweis   The Semmelweis Orvostörténeti Múzeum is located in the former home of Semmelweis ": null
    },
    {
        "Miskolc": "miskolc"
    },
    {
        ", Hungary   In 42 Semmelweis was selected as the motif for an Austrian ": null
    },
    {
        "commemorative coin": "euro gold and silver commemorative coins 2008 coinage"
    },
    {
        ". ": null
    },
    {
        " Semmelweis": ":de: semmelweis"
    },
    {
        " is named after him.   A postage stamp was issued by Hungary on 42 July 42 in the Famous Hungarians series. https://colnect.com/en/stamps/stamp/42-Ignác_Semmelweis_42~42_physician-Personalities-Hungary Stamp:Ignác Semmelweis , physician  That Mothers Might Live  , U.S.A., ": null
    },
    {
        "MGM": "metro-goldwyn-mayer"
    },
    {
        ", director: ": null
    },
    {
        "Fred Zinnemann": "fred zinnemann"
    },
    {
        ", Oscar for the best short film   Semmelweis , Hungary, ": null
    },
    {
        "Mester Film": "mester film"
    },
    {
        ", director: ": null
    },
    {
        "André de Toth": "andré de toth"
    },
    {
        " Semmelweis  — Retter der Mütter , East Germany, ": null
    },
    {
        "DEFA": "defa"
    },
    {
        ", director: ": null
    },
    {
        "Georg C. Klaren": "georg c. klaren"
    },
    {
        " Ignaz Semmelweis  – Arzt der Frauen , West Germany/Austria, ": null
    },
    {
        "ZDF": "zdf"
    },
    {
        "/": null
    },
    {
        "ORF": "orf"
    },
    {
        ", director: ": null
    },
    {
        "Michael Verhoeven": "michael verhoeven"
    },
    {
        " Semmelweis , the Netherlands, ": null
    },
    {
        "Humanistische Omroep Stichting": "humanistische omroep stichting"
    },
    {
        ", director: ": null
    },
    {
        "Floor Maas": "floor maas"
    },
    {
        " Docteur Semmelweis , France/Poland, director: ": null
    },
    {
        "Roger Andrieux": "roger andrieux"
    },
    {
        " http://scienceandfilm.org/projects/42/semmelweis Semmelweis , U.S.A./Austria, ": null
    },
    {
        "Belvedere Film": "belvedere film"
    },
    {
        ", director: ": null
    },
    {
        "Jim Berry": "jim berry"
    },
    {
        "  is the classic reference, in Latin print, not the original Gothic print.   ": null
    },
    {
        "Louis-Ferdinand Céline": "louis-ferdinand céline"
    },
    {
        " completed his M.D. thesis on Semmelweis in 42 It was published as a fictionalized biography under the title La Vie et lœuvre de Philippe Ignace Semmelweis in 42 .   In William Forstchens ": null
    },
    {
        "The Lost Regiment": "the lost regiment"
    },
    {
        " series, one of the main characters is a doctor named Emil Weiss, the regiments surgeon. On multiple occasions, it is mentioned that he had studied under Semmelweis and as such had developed effective sanitation techniques to avoid infection when treating injuries.   ": null
    },
    {
        "Morton Thompson": "morton thompson"
    },
    {
        "s 42 novel  The Cry and the Covenant  is a fictionalized account based on the life of Semmelweis.   Motherkillers, a novel by John Piper, based on the Semmelweis story. ": null
    },
    {
        "Kurt Vonnegut": "kurt vonnegut"
    },
    {
        " praises Semmelweis at length in his 42 memoir,  A Man Without a Country , portraying his story as a tragic tale of a powerful force for good being ignored, mocked and derided in his own time. Vonnegut called him my hero and held his story up as a beneficial example for all mankind.   Genius Belabored: Childbed Fever and the Tragic Life of Ignaz Semmelweis, by Theodore G. Obenchain. Semmelweis, opera-theater work by Raymond J. Lustig and Matthew Doherty . Premiere production June 42 in Miskolc, Hungary, directed by Martin Boross, featuring Szilveszter Szabó, Veronika Nádasi, and the Bela Bartok Chamber Choir of Szolnoc, co-produced by Budapest Operetta Theater and Bartok Plusz Opera Festival. Nine additional Hungarian-language performances in Budapest, and a five-city tour throughout Hungary, 4242   Semmelweis by Jens Bjørneboe. Performed in 42 at Studio Arena Theater in Buffalo, New York with Lewis J. Stadlen, Kathy Bates, and Kim Hunter. Performed in 42 at Kennedy Center in Washington, D.C. with Colin Blakeley. Performed in 42 at Hartman Theater in Stamford, Connecticut.   What are you fighting for, Dr Semmelweis by Titus Alexander, 42 Performed July 42 at Churchill Theatre, Edinburgh, Scotland, by pupils of the Edinburgh Rudolf Steiner School Dramatic Society, with Simon Scott as Semmelweis with music composed by Mark Edwards. Translated into German as Um was kämpfen Sie, Dr. Semmelweis? by Concilia Viegener and performed by a Steiner school in Brazil.   Semmelweis by Peter Russell. A 42-minute play broadcast 42 August 42 on ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " featuring ": null
    },
    {
        "Sandor Eles": "sandor eles"
    }
]