[
    {
        "              In the ": null
    },
    {
        "Matter of Britain": "matter of britain"
    },
    {
        ", Igraine  is the mother of ": null
    },
    {
        "King Arthur": "king arthur"
    },
    {
        ". She is also known in ": null
    },
    {
        "Latin": "latin"
    },
    {
        " as Igerna, in ": null
    },
    {
        "Welsh": "welsh language"
    },
    {
        " as Eigr , in French as Ygraine , in ": null
    },
    {
        "Thomas Malory": "thomas malory"
    },
    {
        "s Le Morte dArthur as Ygrayne—often modernised as Igraine or Igreine—and in ": null
    },
    {
        "Wolfram von Eschenbach": "wolfram von eschenbach"
    },
    {
        "s  Parzival  as Arnive. She becomes the wife of ": null
    },
    {
        "Uther Pendragon": "uther pendragon"
    },
    {
        ", but her first husband was ": null
    },
    {
        "Gorlois": "gorlois"
    },
    {
        "; her daughters by Gorlois are ": null
    },
    {
        "Elaine": "elaine elaine of garlot"
    },
    {
        ", ": null
    },
    {
        "Morgause": "morgause"
    },
    {
        " and ": null
    },
    {
        "Morgan le Fay": "morgan le fay"
    },
    {
        ".            In ": null
    },
    {
        "Geoffrey of Monmouth": "geoffrey of monmouth"
    },
    {
        "s  Historia Regum Britanniae , Igerna enters the story as the wife of ": null
    },
    {
        "Gorlois": "gorlois"
    },
    {
        ", ": null
    },
    {
        "Duke of Cornwall": "list of legendary rulers of cornwall"
    },
    {
        ". King ": null
    },
    {
        "Uther Pendragon": "uther pendragon"
    },
    {
        " falls in love with her and attempts to force his attentions on her at his court. She informs her husband, who departs with her to Cornwall without asking leave. This sudden departure gives Uther Pendragon an excuse to make war on Gorlois. Gorlois conducts the war from the castle of Dimilioc but places his wife in safety in ": null
    },
    {
        "Tintagel Castle": "tintagel castle"
    },
    {
        ". Disguised as Gorlois by ": null
    },
    {
        "Merlin": "merlin"
    },
    {
        ", Uther Pendragon is able to enter Tintagel to satisfy his lust. He manages to rape Igraine by deceit – she believes that she is lying with her husband and becomes pregnant with Arthur. Her husband Gorlois dies in battle that same night. Geoffrey does not say, and later accounts disagree, as to whether Gorlois died before or after Arthur was begotten . Uther Pendragon later marries Igraine.     According to Geoffrey, Igraine also bore a daughter, Anna , to Uther Pendragon, and this Anna later becoming the mother of ": null
    },
    {
        "Gawain": "gawain"
    },
    {
        " and ": null
    },
    {
        "Mordred": "mordred"
    },
    {
        ". Yet Geoffrey also refers to King ": null
    },
    {
        "Hoel": "hoel"
    },
    {
        " of ": null
    },
    {
        "Brittany": "brittany"
    },
    {
        " as Arthurs nephew and presents a prophecy that to Uthers daughter will be born a line of seven kings, something true if Hoel is Annas son, but not true if only Gawain or Mordred are Annas sons. There is confusion here, especially as Welsh genealogies name an Anna as Hoels mother, but one not connected to Uther Pendragon.     In medieval Welsh literature and genealogical tracts Eigr is one of several children of ": null
    },
    {
        "Amlawdd Wledig": "amlawdd wledig"
    },
    {
        ". Her siblings include Gwyar, the mother of Gwalchmai , who is mentioned in  Culhwch and Olwen . The same source mentions Gormant son of Rica, half-brother to ": null
    },
    {
        "Arthur": "king arthur"
    },
    {
        " on his mothers side, while his father is the chief elder of ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        ".            In ": null
    },
    {
        "Robert de Boron": "robert de boron"
    },
    {
        "s poem  Merlin , Igraines previous husband is an unnamed Duke of Tintagel and it is by him that she becomes the mother of two unnamed daughters. One marries ": null
    },
    {
        "King Lot": "king lot"
    },
    {
        " and by him becomes the mother of Gawain, Mordred, ": null
    },
    {
        "Gaheriet": "gareth"
    },
    {
        " and ": null
    },
    {
        "Guerrehet": "gaheris"
    },
    {
        ". A second daughter, also unnamed in some variants but in some named Morgaine, is married to ": null
    },
    {
        "King Nentres": "king nentres"
    },
    {
        " of Garlot, who is identified with ": null
    },
    {
        "Budic II of Brittany": "budic ii of brittany"
    },
    {
        ". According to Robert de Boron, Igraine died before her second husband. A third illegitimate daughter of the Duke of Tintagel is sent to a school and there learns so much she becomes the great sorceress ": null
    },
    {
        "Morgan": "morgan le fay"
    },
    {
        " .     In the ": null
    },
    {
        "Lancelot-Grail": "lancelot-grail"
    },
    {
        " Vulgate Merlin, Igraine is provided with two earlier husbands, one named Hoel who is the father of two daughters: Gawains mother and a daughter named Blasine who marries King Nentres of Garlot. After Hoels death Ygraine marries the Duke of Tintagel and by him becomes mother of three more daughters: a third daughter who marries a King Briadas and becomes mother of King Angusel of Scotland , a fourth daughter named Hermesent who marries King ": null
    },
    {
        "Urien": "urien"
    },
    {
        " of ": null
    },
    {
        "Rheged": "rheged"
    },
    {
        " and becomes mother of ": null
    },
    {
        "Ywain": "ywain"
    },
    {
        " the Great and a fifth daughter, Morgan.     In the ": null
    },
    {
        "Post-Vulgate Cycle": "post-vulgate cycle"
    },
    {
        " and Sir ": null
    },
    {
        "Thomas Malory": "thomas malory"
    },
    {
        "s  Le Morte dArthur , it is Morgan le Fay who becomes the wife of King Urien and mother of Ywain . In other accounts Ywain is not Arthurs nephew, although sometimes he is Gawains cousin when their respective fathers are presented as brothers.     In the Brut Tysilio, Duke ": null
    },
    {
        "Cador": "cador"
    },
    {
        " of Cornwall is the son of Gorlois, one would guess by Igraine. The same appears in ": null
    },
    {
        "Richard Hardyng": "richard hardyng"
    },
    {
        "s Chronicle where Cador is called Arthurs brother of his mothers syde. Opposing views appear in ": null
    },
    {
        "Layamon": "layamon"
    },
    {
        "s Brut where Cador appears first as a leader who takes charge of Uthers host when they are attacked by Gorlois while Uther is secretly lying beside Igraine in Tintagel. In the English ": null
    },
    {
        "Alliterative Morte Arthure": "alliterative morte arthure"
    },
    {
        " Cador is continually called Arthurs cousin .     Le Morte dArthur names the first daughter Margawse, the second Elayne and the third Morgan . ": null
    },
    {
        "Lancelot": "lancelot"
    },
    {
        " is the son of Arthurs sister Clarine in ": null
    },
    {
        "Ulrich von Zatzikhoven": "ulrich von zatzikhoven"
    },
    {
        "s  Lanzelet , ": null
    },
    {
        "Caradoc": "caradoc"
    },
    {
        " is Arthurs sisters son in the Prose Lancelot, ": null
    },
    {
        "Percival": "percival"
    },
    {
        " is son of Arthurs sister Acheflour in the English romance Syr Percyvelle. Arthurian tales are not consistent with one another and sisters of Arthur seem to have been created at desire by any teller who wished to make a hero into Arthurs nephew.     The Lancelot-Grail relates that when Igraine became Uthers wife she left behind in the dukedom of Tintagel a son of the Duke of Tintagel by a previous marriage. Some romances show her alive after Uthers death. In ": null
    },
    {
        "Chrétien de Troyes": "chrétien de troyes"
    },
    {
        "s  Perceval, the Story of the Grail  she and her daughter Gawains mother are discovered by Gawain in an enchanted castle named the Castle of Marvels. Gawain had thought both his mother and grandmother to be long dead. This same account appears in ": null
    },
    {
        "Wolfram von Eschenbach": "wolfram von eschenbach"
    },
    {
        "s  Parzival  and in ": null
    },
    {
        "Heinrich von dem Türlin": "heinrich von dem türlin"
    },
    {
        "s  Diu Crône . In both of these it is explained that Igraine was abducted  by the magician who has enchanted the castle. In the French Livre dArtus, an incomplete alternate conclusion to the French Vulgate Merlin, it is mentioned that Ygraine dwells hidden in ": null
    },
    {
        "Corbenic": "corbenic"
    },
    {
        ", the castle of the ": null
    },
    {
        "Holy Grail": "holy grail"
    },
    {
        ". This is apparently a version of the same tradition since in the late Lancelot-Grail, the enchantments of the Grail castle are very similar to and seem to be based on the enchantments found in Chrétiens Castle of Marvels.       ": null
    },
    {
        "Jack Whyte": "jack whyte"
    },
    {
        "s  A Dream of Eagles  portrays Igraine as the daughter of Athol, a ruler from Ireland. She is married off to Lot, the Duke of Cornwall. She flees the cruel Lot for his arch enemy, Uther Pendragon. She is killed by Derek, king of Ravenglass, one of Lots allies, shortly after he kills Uther. She dies telling Merlyn, Uthers cousin and commander of the forces of Camulod, of her son by Uther, Arthur Pendragon.   In the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " series  Merlin , Ygraine is the wife of Uther, but dead for many years by the time the events of the series begins. She could not conceive, and so Uther asked for the help of the sorceress ": null
    },
    {
        "Nimueh": "list of merlin charactersnimueh"
    },
    {
        " so that they could have a child. Igraine gives birth to Arthur, but because magic was invoked in his conception, Uther had to pay the price of asking for a life from magic—that of losing the life of someone he treasured equally, his wife. It is Igraines death that sparks Uthers hatred and persecution of all magic users within his kingdom.   In the 42 film  King Arthur: Legend of the Sword , Igraine is portrayed by ": null
    },
    {
        "Poppy Delevingne": "poppy delevingne"
    }
]