[
    {
        "Illative  is, in the ": null
    },
    {
        "Finnish language": "finnish language"
    },
    {
        ", the ": null
    },
    {
        "Estonian language": "estonian language"
    },
    {
        ", the ": null
    },
    {
        "Lithuanian language": "lithuanian language"
    },
    {
        ", and the ": null
    },
    {
        "Hungarian language": "hungarian language"
    },
    {
        ", the third of the ": null
    },
    {
        "locative": "locative case"
    },
    {
        " cases": "declension"
    },
    {
        " with the basic meaning of into . An example from Hungarian is a házba . An example from Estonian is majasse and majja , formed from maja . An example from Finnish is taloon , formed from talo . An example from Lithuanian is laivan formed from laivas .       The case is formed by adding -hVn, where V represents the last vowel, and then removing the h if a simple ": null
    },
    {
        "long vowel": "long vowel"
    },
    {
        " would result. For example, talo + Vn becomes taloon with a simple long oo; cf. maa + hVn becomes maahan, without the elision of h. This unusually complex way of adding a suffix can be explained by its reconstructed origin: a ": null
    },
    {
        "voiced palatal fricative": "voiced palatal fricative"
    },
    {
        ".  In the dialect of ": null
    },
    {
        "Pohjanmaa": "ostrobothnia"
    },
    {
        ", the h is not removed; one says talohon.     The other locative cases in Finnish, Estonian and Hungarian are:   ": null
    },
    {
        "Inessive case": "inessive case"
    },
    {
        "   Elative case": "elative case"
    },
    {
        "   Adessive case": "adessive case"
    },
    {
        "   Allative case": "allative case"
    },
    {
        "   Ablative case": "ablative case"
    },
    {
        "       The illative case, denoting direction of movement, is now less common in the standard language but is common in the spoken language, especially in certain dialects. Its singular form, heard more often than the plural, appears in books, newspapers, etc. Most Lithuanian nouns can take the illative ending, indicating that from the descriptive point of view the illative still can be treated as a case in Lithuanian. Since the beginning of the 42th century it isnt included in the lists of standard Lithuanian cases in most grammar books and textbooks, and the prepositional construction į+": null
    },
    {
        "accusative": "accusative case"
    },
    {
        " is more frequently used today to denote direction. The illative case was used extensively in older Lithuanian; the first Lithuanian grammar book, by ": null
    },
    {
        "Daniel Klein": "daniel klein"
    },
    {
        ", mentions both illative and į+accusative but calls the usage of the illative more elegant . Later, it has often appeared in the written texts of the authors who grew up in ": null
    },
    {
        "Dzukija": "dzukija"
    },
    {
        " or Eastern ": null
    },
    {
        "Aukštaitija": "aukštaitija"
    },
    {
        ", such as ": null
    },
    {
        "Vincas Krėvė-Mickevičius": "vincas krėvė-mickevičius"
    },
    {
        ".     The illative case in Lithuanian has its own ": null
    },
    {
        "ending": "ending"
    },
    {
        "s, which are different for each declension paradigm, although quite regular, compared with some other Lithuanian cases. An ending of the illative always ends with n in the singular, and sna is the final part of an ending of the illative in the plural.     Certain fixed phrases in the standard language are illatives, such as patraukti atsakomybėn , dešinėn! .     Examples:   Masculine gender words   karas, karan, karai, karuosna, war   lokys, lokin, lokiai, lokiuosna, bear   akmuo, akmenin, akmenys, akmenysna, stone   Feminine gender words :   upė, upėn, upės, upėsna, river   jūra, jūron, jūros, jūrosna, sea   obelis, obelin, obelys, obelysna, appletree          from www.HungarianReference.com          ": null
    }
]