[
    {
        "Immanuel ben Solomon ben Jekuthiel of Rome   was an ": null
    },
    {
        "Italian": "italy"
    },
    {
        "-": null
    },
    {
        "Jew": "jew"
    },
    {
        "ish scholar and satirical ": null
    },
    {
        "poet": "poet"
    },
    {
        ".       He was a member of a prominent, wealthy family and occupied an important position in Rome, possibly secretary or treasurer of the Jewish community there. He preached on ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        " and delivered discourses on special occasions. In 42 he lost his entire fortune and was obliged to leave his home. All his friends deserted him and, bowed by poverty and the double burden of age, he wandered through Italy until he found refuge in 42 in Fermo in the march of ": null
    },
    {
        "Ancona": "ancona"
    },
    {
        " at the home of a patron named Daniel, who provided for his old age and enabled him to devote himself to poetry.     Immanuels studies consisted not only of ": null
    },
    {
        "biblical": "bible"
    },
    {
        " and ": null
    },
    {
        "talmud": "talmud"
    },
    {
        "ic literature, but also ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ", ": null
    },
    {
        "medicine": "medicine"
    },
    {
        ", and ": null
    },
    {
        "Islam": "islam"
    },
    {
        "ic and ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " philosophy": "philosophy"
    },
    {
        ". He had an excellent memory and spoke ": null
    },
    {
        "Italian": "italian language"
    },
    {
        ", ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        ", ": null
    },
    {
        "Latin": "latin"
    },
    {
        " and perhaps some ": null
    },
    {
        "Greek": "greek language"
    },
    {
        ". He especially devoted himself to writing verse, encouraged in this by his cousin ": null
    },
    {
        "Judah Romano": "judah romano"
    },
    {
        ", one of the foremost Jewish philosophers of his time. Immanuel, whose poetic gifts appeared at an early age, devoted himself to the study of rhyme, took lessons in versification, and read the works of the foremost Jewish and Christian poets. Among his teachers he mentions ": null
    },
    {
        "Benjamin ben Joab": "benjamin ben joab"
    },
    {
        " and his cousin Daniel. He may also have been a pupil of ": null
    },
    {
        "Zerahiah ben Shealtiel Hen": "zerahiah ben shealtiel hen"
    },
    {
        ".       Immanuels varied scientific activity corresponded with his wide scholarship, though he confined his activity exclusively to Jewish subjects. With the exception of an introductory poem, his first work, dealing with the letter ": null
    },
    {
        "symbol": "symbol"
    },
    {
        "ism  popular at that time, is lost. A second work, Even Bohan concerns biblical ": null
    },
    {
        "hermeneutics": "hermeneutics"
    },
    {
        ", dealing with the different meaning of verbs in different constructions, with the addition, omission, and interchange of letters, and with other ": null
    },
    {
        "linguistic": "linguistics"
    },
    {
        " questions. More important are his biblical commentaries, which cover all the books of the Bible, though some have since been lost. Following his Jewish and Christian contemporaries, he interpreted the Bible ": null
    },
    {
        "allegorically": "allegory"
    },
    {
        ", ": null
    },
    {
        "symbol": "symbol"
    },
    {
        "ically, and ": null
    },
    {
        "mystic": "mysticism"
    },
    {
        "ally, endeavoring to find in it his own philosophical and religious views, though not disregarding the simple, literal meaning, which he placed above the symbolic. The sole value of his commentaries lies in the fact that his wide range of reading enabled him to make the works of other exegetes and philosophers accessible to his contemporaries and countrymen.       The originality that Immanuel lacked as a scholar, he possessed as a poet. In his verse this is given free play, and his poems assured him a place in history. A product of his time, in sympathy with the social and intellectual life of medieval Italy, he had acquired the then-prevalent pleasing, easy, humorous, harmlessly flippant tone and the art of treating questionable subjects wittily and elegantly. He composed in both ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " and Italian, but only a few of his Italian poems have survived. In a truly national spirit, they portray and satirize the political and religious conditions of that time. Immanuel was held in high regard by his contemporaneous Italian poets. Two Italian sonnets referring to his death have been preserved, which place him as a poet beside ": null
    },
    {
        "Dante": "dante alighieri"
    },
    {
        ". In fact, Immanuel knew Dantes works and drew upon them His Italian and Hebrew poems are both full of traces of Dantes style and themes.       Immanuel introduced the form of the ": null
    },
    {
        "sonnet": "sonnet"
    },
    {
        " from ": null
    },
    {
        "Italian literature": "italian literature"
    },
    {
        " into Hebrew, and in this respect he is justified in saying that he excelled his models, the Spaniards, because he introduced alternate rhyme instead of single rhyme. He also excelled in his inventiveness and humor. In his old age, during his sojourn in Fermo, he collected his Hebrew poems in the manner of ": null
    },
    {
        "Yehuda Alharizi": "yehuda alharizi"
    },
    {
        ", producing a  diwan  entitled Mehaberot. Out of gratitude to his generous friend, he put these poems in a setting that made it appear as if they had been composed entirely during his stay with him in Fermo and as if stimulated by him, though they were really composed at various periods.     The poems deal with all the events and episodes of Jewish life and are replete with clever witticisms, harmless fun, caustic satire, and at times, frivolity. The Hebrew idiom in which Immanuel wrote lends a special charm to his work. His parodies of biblical and talmudic sentences, his clever allusions and puns, and his equivocations are such gems of diction that it is almost impossible to translate his poetry into another language.     There are twenty-seven poems all together, including satires and letters, prayers and dirges, on a great variety of themes, both serious and humorous. A vision entitled Ha-Tofet ve-ha-Eden , at the end of the diwan is a sublime finale, the seriousness of which is tempered by lighter passages, the humorist asserting himself even when dealing with the supernatural world. In it, the poet recounts how, as an old man of sixty, he was overcome by the consciousness of his sins and the fear of his fate after death, when a recently deceased young friend, Daniel, appeared to him, offering to lead him through the tortures of ": null
    },
    {
        "Hell": "hell"
    },
    {
        " to the flowering fields of the blessed. There then follows a minute description of Hell and ": null
    },
    {
        "Heaven": "heaven"
    },
    {
        ". It need hardly be said that Immanuels poem is patterned in idea as well as in execution on Dantes  Divine Comedy . It has even been asserted that he intended to set a monument to his friend Dante in the person of the highly praised Daniel, for whom he found a magnificent throne prepared in Paradise. This theory, however, is untenable, and there remains only that positing his imitation of Dante. Though the poem lacks the depth, sublimity, and significant references to the religious, scientific, and political views of the time, which have made Dantes work immortal, nevertheless, Immanuels poem is not without merit. His description, free from dogmatism, is true to human nature. It takes a humane point of view and is tolerant toward those of a different belief.     Despite several printings of the diwan as a whole and the final poem individual, and despite some attempts at translation, the book is little known or disseminated. His contemporaries even censured Immanuel as a wanton scoffer, because he is occasionally flippant even in religious matters. He fared worse with later critics, and ": null
    },
    {
        "Yosef Karo": "yosef karo"
    },
    {
        ", author of the  Shulchan Aruch ": null
    }
]