[
    {
        "Immunoperoxidase is a type of ": null
    },
    {
        "immunostain": "immunostaining"
    },
    {
        " used in ": null
    },
    {
        "molecular biology": "molecular biology"
    },
    {
        ", medical research, and clinical diagnostics. In particular, immunoperoxidase reactions refer to a sub-class of immunohistochemical or immunocytochemical procedures in which the antibodies are visualized via a peroxidase-catalyzed reaction.     ": null
    },
    {
        "Immunohistochemistry": "immunohistochemistry"
    },
    {
        " and ": null
    },
    {
        "immunocytochemistry": "immunocytochemistry"
    },
    {
        " are methods used to determine in which cells or parts of cells a particular ": null
    },
    {
        "protein": "protein"
    },
    {
        " or other ": null
    },
    {
        "macromolecule": "macromolecule"
    },
    {
        " are located. These stains use  antibodies  to bind to specific  antigen s, usually of protein or ": null
    },
    {
        "glycoprotein": "glycoprotein"
    },
    {
        " origin. Since antibodies are normally invisible, special strategies must be employed to detect these bound antibodies. In an immunoperoxidase procedure, an ": null
    },
    {
        "enzyme": "enzyme"
    },
    {
        " known as a ": null
    },
    {
        "peroxidase": "peroxidase"
    },
    {
        " is used to ": null
    },
    {
        "catalyze": "catalysis"
    },
    {
        " a ": null
    },
    {
        "chemical reaction": "chemical reaction"
    },
    {
        " to produce a coloured product.     Simply, a very thin slice of tissue is fixed onto glass, incubated with antibody or a series of antibodies, the last of which is chemically linked to peroxidase. After developing the stain by adding the chemical ": null
    },
    {
        "substrate": "substrate"
    },
    {
        ", the distribution of the stain can be examined by ": null
    },
    {
        "microscopy": "light microscopy"
    },
    {
        ".       Originally all antibodies produced for immunostaining were  polyclonal , i.e. raised by normal antibody reactions in animals such as horses or rabbits. Now, many are  monoclonal , i.e. produced in tissue culture. Monoclonal antibodies that consist of only one type of antibody tend to provide greater antigen specificity, and also tend to be more consistent between batches.         The first step in immunoperoxidase staining is the binding of the specific antibody to the cell or tissue sample. The detection of the primary antibody can be then accomplished directly or indirectly .     :Example 42 The primary antibody can be directly tagged with the enzyme  peroxidase  which is then used to catalyse a chemical reaction to generate a coloured product.     :Example 42 The primary antibody can be tagged with a small molecule that can be recognised by a peroxidase-conjugated binding molecule with high affinity. The most common example of this is a ": null
    },
    {
        "biotin": "biotin"
    },
    {
        " linked primary antibody that binds to an enzyme-bound ": null
    },
    {
        "streptavidin": "streptavidin"
    },
    {
        ". This method can be used to ": null
    },
    {
        "amplify": "amplifier"
    },
    {
        " the signal.     :Example 42 An untagged primary antibody is detected using a general ": null
    },
    {
        "secondary antibody": "secondary antibody"
    },
    {
        " that recognises all antibodies originating from same animal species as the primary. The secondary antibody is tagged with peroxidase.     Optimal staining depends on a number of factors including the antibody dilution, the staining chemicals, the preparation and/or fixation of the cells/tissue, and length of incubation with antibody/staining reagents. These are often determined by ": null
    },
    {
        "trial and error": "trial and error"
    },
    {
        " rather than any sort of systematic approach.         Other catalytic enzymes such as ": null
    },
    {
        "alkaline phosphatase": "alkaline phosphatase"
    },
    {
        " can be used instead of peroxidases for both direct and indirect staining methods. Alternatively, the primary antibody can be detected using ": null
    },
    {
        "fluorescent": "fluorescence"
    },
    {
        " label , or be attached to colloidal gold particles for  electron microscopy .         Immunoperoxidase staining is used in clinical diagnostics and in laboratory research.     In clinical diagnostics, immunostaining can be used on tissue biopsies for more detailed ": null
    },
    {
        "histopathological": "histopathology"
    },
    {
        " study. In the case of cancer, it can aid in sub-classifying tumours. Immunostaining can also be used to help diagnose skin conditions, ": null
    },
    {
        "glomerulonephritis": "glomerulonephritis"
    },
    {
        " and to sub classify ": null
    },
    {
        "amyloid": "amyloid"
    },
    {
        " deposits. Related techniques are also useful in sub-typing ": null
    },
    {
        "lymphocyte": "lymphocyte"
    },
    {
        "s which all look quite similar on light microscopy.     In laboratory research, antibodies against specific markers of ": null
    },
    {
        "cellular differentiation": "cellular differentiation"
    }
]