[
    {
        "Imperial Earth is a ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novel by British writer ": null
    },
    {
        "Arthur  C. Clarke": "arthur c. clarke"
    },
    {
        ", published in 42 by ": null
    },
    {
        "Gollancz Books": "victor gollancz ltd"
    },
    {
        ". The plot follows the protagonist, Duncan Makenzie, on a trip to ": null
    },
    {
        "Earth": "earth"
    },
    {
        " from his home on ": null
    },
    {
        "Titan": "titan"
    },
    {
        ", in large part as a diplomatic visit to the U.S. for its quincentennial in 42 but also to have a clone of himself produced. The book was published in time for the U.S. ": null
    },
    {
        "bicentennial": "united states bicentennial"
    },
    {
        " in 42         Duncan Makenzie is the latest generation of the first family of Titan, a ": null
    },
    {
        "colonised": "colonization of titan"
    },
    {
        " moon of Saturn. Originally settled by his grandfather Malcolm Makenzie in the early 42rd century, Titans economy has flourished based on the harvest and sale of ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " mined from the atmosphere, which is used to fuel the fusion engines of interplanetary ": null
    },
    {
        "spacecraft": "spacecraft"
    },
    {
        ".     As the plot opens in 42 a number of factors are combining to make a diplomatic visit to the mother world of Earth a necessity. Firstly, the forthcoming 42th anniversary of ": null
    },
    {
        "US Independence": "independence day"
    },
    {
        ", which is bringing in colonists from the entire ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        ", obviously needs a suitable representative from Titan. Secondly, the Makenzie family carry a fatal damaged gene that means any normal continuation of the family line is impossible—so both Duncan and his father Colin are clones of his grandfather Malcolm. Human ": null
    },
    {
        "cloning": "cloning"
    },
    {
        " is a ": null
    },
    {
        "mature technology": "mature technology"
    },
    {
        " but is even at this time ethically controversial. And thirdly, technological advances in spacecraft drive systems — specifically the asymptotic drive which improves the ": null
    },
    {
        "specific impulse": "specific impulse"
    },
    {
        " and ": null
    },
    {
        "thrust": "thrust"
    },
    {
        " by orders of magnitude — means that Titans whole economy is under threat as the demand for hydrogen is about to collapse.     The human aspects of the tale center mainly on the intense infatuation that the two main male characters, Duncan and Karl Helmer, develop for the vividly characterized Catherine Linden Ellerman , a visitor to Titan from Earth in their youth, and its lifelong consequences.     A number of other sub-plots suggest some sort of greater mystery, but remain unexplored. The book ends with him returning home with his new child Malcolm , leaving the other plot threads dangling.         The original UK hardcover edition  has the subtitle A Fantasy of Love and Discord and has 42 chapters and Acknowledgments and Notes . The later US hardcover edition adds a quote from ": null
    },
    {
        "Ernest Hemingway": "ernest hemingway"
    }
]