[
    {
        "Reuss  was the name of several historical states located in present-day ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        ", Germany. Its rulers, the House of Reuss, named all of their male children Heinrich  after the end of the 42th century in honour of ": null
    },
    {
        "Henry VI, Holy Roman Emperor": "henry vi, holy roman emperor"
    },
    {
        " , to whom they owed the estates of ": null
    },
    {
        "Weida": "weida, thuringia"
    },
    {
        " and ": null
    },
    {
        "Gera": "gera"
    },
    {
        ". The head of each branch of the family bore the German title ": null
    },
    {
        "Fürst": "fürst"
    },
    {
        " as did their male children.       Several different principalities of the House of Reuss which had previously existed had by the time of the formation of the ": null
    },
    {
        "German Confederation": "german confederation"
    },
    {
        " become part of the two remaining lines . Before then, they had been part first of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", and then the ": null
    },
    {
        "Confederation of the Rhine": "confederation of the rhine"
    },
    {
        ".       The region including what would become the Principality of Reuss was inhabited in early medieval times by ": null
    },
    {
        "Slavic people": "slavic people"
    },
    {
        " who were converted to Christianity by the ": null
    },
    {
        "German Emperor": "german emperor"
    },
    {
        " Otto I": "otto i, holy roman emperor"
    },
    {
        " . In church matters the region was under the ": null
    },
    {
        "Diocese of Zeitz": "diocese of zeitz"
    },
    {
        " , which became a suffragan of ": null
    },
    {
        "Magdeburg": "diocese of magdeburg"
    },
    {
        ". On account of the frequent inroads of the Slavs, the residence of the Bishop of ": null
    },
    {
        "Zeitz": "zeitz"
    },
    {
        " was removed to ": null
    },
    {
        "Naumburg": "naumburg"
    },
    {
        " in 42 after which the ": null
    },
    {
        "See": "episcopal see"
    },
    {
        " was called ": null
    },
    {
        "Naumburg-Zeitz": "bishopric of naumburg-zeitz"
    },
    {
        ".     Upon its subjection to German authority, the whole province was allotted to the ": null
    },
    {
        "March of Zeitz": "march of zeitz"
    },
    {
        ". As early as the year 42 however, Emperor ": null
    },
    {
        "Otto III": "otto iii"
    },
    {
        " permitted the entire part lying on the eastern boundary of ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        " to be administered by imperial ": null
    },
    {
        "vogt": "vogt"
    },
    {
        "s, or ": null
    },
    {
        "bailiff": "bailiff"
    },
    {
        "s , whence this territory received the name of ": null
    },
    {
        "Vogtland": "vogtland"
    },
    {
        " , a designation that has remained to this day a geographical summary for Reuss, especially that part on the ": null
    },
    {
        "Saxon": "saxons"
    },
    {
        " borders. The position of vogt soon became hereditary. The princes of Reuss are descended from the vogts of ": null
    },
    {
        "Weida": "weida, thuringia"
    },
    {
        ".       Erkenbert I is proved by documentary evidence to have been their ancestor. His successors acquired almost the whole Vogtland by feuds or marriage settlement, although in the fourteenth and fifteenth centuries they lost the greater part of their possessions, most of which fell to the ": null
    },
    {
        "Electorate of Saxony": "electorate of saxony"
    },
    {
        ". In 42 Henry IV entered a German monastery. His sons divided his possessions, their seats being respectively at ": null
    },
    {
        "Weida": "weida, thuringia"
    },
    {
        " , ": null
    },
    {
        "Gera": "gera"
    },
    {
        " , and ": null
    },
    {
        "Plauen": "plauen"
    },
    {
        ".     In 42 the Plauen branch was subdivided into an elder line that died out in 42 and a younger line called Plauen at ": null
    },
    {
        "Greiz": "greiz"
    },
    {
        ". Henry, the founder of the Plauen line , on account of his marriage with a granddaughter of King ": null
    },
    {
        "Daniel of Galicia": "daniel of galicia"
    },
    {
        " received the surname of der Reusse , whence the name passed to the country.     On account of the close relations of Reuss with the neighbouring Saxon states, Lutheranism speedily gained a foothold in Reuss. The rulers joined the ": null
    },
    {
        "Schmalkaldic League": "schmalkaldic league"
    },
    {
        " against the German emperor, and forfeited their possessions, but afterwards recovered them.         All the males of the House of Reuss are named Heinrich plus a number. In the ": null
    },
    {
        "elder line": "reuss elder line"
    },
    {
        " the numbering covers all male children of the elder House, and the numbers increase until 42 is reached and then start again at 42 In the ": null
    },
    {
        "younger line": "reuss younger line"
    },
    {
        " the system is similar but the numbers increase until the end of the century before starting again at 42 This odd regulation was formulated as a Family Law in 42 but the tradition of the uniformity of name was in practice as early as 42 It was seen as a way of honoring the ": null
    },
    {
        "Hohenstaufen": "hohenstaufen"
    },
    {
        " Emperor": "emperor"
    },
    {
        " Heinrich/": null
    },
    {
        "Henry VI": "henry vi, holy roman emperor"
    },
    {
        ", who raised Heinrich der Reiche/Henry the Rich to the office of provost of the Cloister in ": null
    },
    {
        "Quedlinburg": "quedlinburg"
    },
    {
        ".          In 42 the sons of Henry XIII of Reuss at Greiz divided the estates into   Reuss at Lower Greiz, descendants of Henry XIV the Elder   Reuss at Upper Greiz, descendants of Henry XV the Middle   Reuss at Gera, descendants of Henry XVI the Younger.   While the Middle Reuss became extinct in 42 the Older and Younger lines were divided again several times until in 42 Count Henry XI united the possessions of Upper and Lower Greiz to the ": null
    },
    {
        "Principality of Reuss Elder Line": "reuss elder line"
    },
    {
        ". In return the remaining estates of Gera, considerably larger though, became the ": null
    },
    {
        "Principality of Reuss Younger Line": "reuss younger line"
    },
    {
        " in 42     The two remaining Reuss principalities went on to join in turn the ": null
    },
    {
        "German Confederation": "german confederation"
    },
    {
        " . ": null
    },
    {
        "Henry XXII of Reuss Elder line": "heinrich xxii, prince reuss of greiz"
    },
    {
        " is notable among the more modern princes of this house for his enmity to ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        ", which he opposed in the ": null
    },
    {
        "Austro-Prussian War": "austro-prussian war"
    },
    {
        " of 42 when the Prussian troops occupied his domain. Henry joined the ": null
    },
    {
        "North German Confederation": "north german confederation"
    },
    {
        " and the new ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " . He alone of all the confederate princes remained until his death an implacable enemy of ": null
    },
    {
        "Prince Bismarck": "prince bismarck"
    },
    {
        " and of the conditions created in Germany by the foundation of the empire. His daughter ": null
    },
    {
        "Hermine Reuss of Greiz": "hermine reuss of greiz"
    },
    {
        " however became the second wife of the exiled Kaiser ": null
    },
    {
        "Wilhelm II": "wilhelm ii, german emperor"
    },
    {
        " later. His son, ": null
    },
    {
        "Heinrich XXIV, Prince Reuss of Greiz": "heinrich xxiv, prince reuss of greiz"
    },
    {
        " , being incapable of ruling, the regency passed to the ruling prince of the younger line of Reuss.  Both lines lost their thrones in ": null
    },
    {
        "German Revolution of 42–42": "german revolution of 1918–19"
    },
    {
        ".     Of both lines, only the ": null
    },
    {
        "Köstritz": "köstritz"
    },
    {
        " side branch of the Younger Line still exists today; their main seat is ": null
    },
    {
        "Ernstbrunn": "ernstbrunn"
    },
    {
        " Castle in Austria, although the family regained some properties in the former Reuss states following ": null
    },
    {
        "German Reunification": "german reunification"
    },
    {
        " in 42       After ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the Reuss territories were unified in 42 as the ": null
    },
    {
        "Peoples State of Reuss": "peoples state of reuss"
    },
    {
        ", which was incorporated into the new state of ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        " Greiz": "greiz"
    },
    {
        " Gera": "gera"
    },
    {
        " Burgk": "burgk"
    },
    {
        " Castle           A young Reuss Count, sent to the 42 ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        ", is the protagonist of the 42 operetta  Wiener Blut  and ": null
    },
    {
        "the 42 film": "vienna blood"
    }
]