[
    {
        "The imperative mood is a ": null
    },
    {
        "grammatical mood": "grammatical mood"
    },
    {
        " that forms a command or request.     An example of a ": null
    },
    {
        "verb": "verb"
    },
    {
        " used in the imperative mood is the ": null
    },
    {
        "English": "english grammar"
    },
    {
        " sentence Leave! Such imperatives imply a ": null
    },
    {
        "second-person": "grammatical person"
    },
    {
        " subject , but some other languages also have first- and third-person imperatives, with the meaning of lets or let him/her/them .     Imperative mood can be denoted by the ": null
    },
    {
        "glossing abbreviation": "list of glossing abbreviations"
    },
    {
        " . It is one of the ": null
    },
    {
        "irrealis mood": "irrealis mood"
    },
    {
        "s.       Imperative mood is often expressed using special ": null
    },
    {
        "conjugated": "grammatical conjugation"
    },
    {
        " verb forms. Like other ": null
    },
    {
        "finite verb": "finite verb"
    },
    {
        " forms, imperatives often inflect for ": null
    },
    {
        "person": "grammatical person"
    },
    {
        " and ": null
    },
    {
        "number": "grammatical number"
    },
    {
        ". Second-person imperatives are most common, but some languages also have imperative forms for the first and third persons .     In ": null
    },
    {
        "English": "english language"
    },
    {
        ", the imperative is formed using the bare ": null
    },
    {
        "infinitive": "infinitive"
    },
    {
        " form of the verb . This is usually also the same as the second-person present ": null
    },
    {
        "indicative": "indicative"
    },
    {
        " form, except in the case of the verb to be, where the imperative is be while the indicative is are.  The imperative form is understood as being in the second person , with no explicit indication of singular or plural. First and third person imperatives are expressed ": null
    },
    {
        "periphrastically": "periphrasis"
    },
    {
        ", using a construction with the imperative of the verb let:   Let me see! Letsequivalent to a first person plural imperative": null
    },
    {
        "Royal we": "royal we"
    },
    {
        " in an equivalent to a first person passive imperative; also constructions like We are to be heard equivalent to a third person imperative; constructions with ": null
    },
    {
        "may": "english modal verbsmay"
    },
    {
        " are also usedEqivalent to a third person passive imperativetu vs. vous, du vs. Sie, você vs. tu, tu vs. usted, etc.": null
    },
    {
        "amm": "amm"
    },
    {
        "abbreviated": "list of glossing abbreviations"
    },
    {
        " see ": null
    },
    {
        "below": "english"
    },
    {
        "or not to do Install the file, then restart your computer Stop ; Give way ; Do not enter more polite than Come here! for Make us a drink! for Stop! for instance, ": null
    },
    {
        "indirect speech acts": "speech actindirect speech acts"
    },
    {
        "ed.Cambridge and London, 42 Cambridge University Press: 4242invitationpermissionwishapology": null
    },
    {
        "cohortative": "cohortative"
    },
    {
        "sand possibly other people": null
    },
    {
        "jussive": "jussive"
    },
    {
        "sindicativeimperative; subject pronoun you omittedas in Dont work! which does not use do-support in the indicativeindicativeimperativesometimes42nd pers. singular42nd pers. plural to love  to advise/warn  to hear  to not want  dont stand , 42nd pers. singular42nd pers. plural stand , 42nd pers. singular42nd pers. pluralsingularpluralamantō, monentō, audiuntō42“You should have called!”,  If only you had called “You should have come!”,  If only you had come In most verbs, both ways are correct.“thou; you “you “Go away!” – “Why, you go away!”For details see ": null
    },
    {
        "German grammar": "german grammar"
    },
    {
        ".“you”“let’s sing!”“may you sing!”“you shall sing!”42nd pers. singular42nd pers. plural42st person plural, lets eat  to eat  to be  ": null
    },
    {
        "let them eat cake": "let them eat cake"
    },
    {
        "  Give it to them.  Dont give it to them. prohibitivepast imperative or imperative of ": null
    },
    {
        "future perfect": "perfect future"
    },
    {
        "  Get up tomorrow before eight oclock.neFinish the work before it gets dark.Write the book tomorrow.Leave at noon.Let us complete homework at 42 oclock.tú": null
    },
    {
        "alternative to tú": "voseo"
    },
    {
        "usually with slightly different emphasisplural familiar second person  Tell me You tell me it or You tell it to me , can also mean You tell me as lo usually isnt translated Tell me it , Tell it to me , Tell me singular formal second personplural second personplural first personas well as tú, vos, and vosotrose.g. No cantes, Dont sing tu / vósvocênós e Tell me  Tell me spokene Tell me it , Tell it to me e.g. ná cloisim sin arís let me not hear that again lōṭ lakārnafrom Sanskrit māin addition, umlaut vowel changes in the verb root might take place to go standard formcolloquialsing. mene, plur. menkääsing. menköön, plur. menköötכ.ת.ב. ك.ت.ب": null
    },
    {
        "ciolinguisti": "ciolinguisti"
    },
    {
        "אַל In Hebrew, some of the Bs sounds like V, and some like B  write –nasai–kudasai“go” do  to drink , also to smoke a cigarette or similar  not to drink  Dont drink! ": null
    }
]