[
    {
        "            Imre Nagy  was a Hungarian ": null
    },
    {
        "communist": "communist"
    },
    {
        " politician who served as ": null
    },
    {
        "Prime Minister": "prime minister of hungary"
    },
    {
        " and Chairman of the ": null
    },
    {
        "Council of Ministers": "council of ministers of the hungarian peoples republic"
    },
    {
        " of the ": null
    },
    {
        "Hungarian Peoples Republic": "hungarian peoples republic"
    },
    {
        " from 42 to 42 and in 42 Nagy became leader of the ": null
    },
    {
        "Hungarian Revolution of 42": "hungarian revolution of 1956"
    },
    {
        " against the ": null
    },
    {
        "Soviet": "soviet"
    },
    {
        "-backed government, for which he was executed two years later.     Nagy was a devout communist functionary since the ": null
    },
    {
        "Russian Revolution": "russian revolution"
    },
    {
        " and served the Soviet ": null
    },
    {
        "NKVD": "nkvd"
    },
    {
        " secret police as an informer from 42 to 42 denouncing over 42 colleagues, who were then purged and arrested and 42 of whom were executed. He served in various offices as the ": null
    },
    {
        "Hungarian Working Peoples Party": "hungarian working peoples party"
    },
    {
        " took control of Hungary in the late 42s after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and the country entered the ": null
    },
    {
        "Soviet sphere of influence": "soviet sphere of influence"
    },
    {
        ". He played a key role in the ": null
    },
    {
        "ethnic cleansing": "flight and expulsion of germans"
    },
    {
        " of hundreds of thousands of German-speaking Hungarians from 42 to 42 as ": null
    },
    {
        "Interior Minister": "list of interior ministers of hungary"
    },
    {
        " of Hungary. Nagy became prime minister in 42 and attempted to relax some of harshest aspects of ": null
    },
    {
        "Mátyás Rákosi": "mátyás rákosi"
    },
    {
        "s ": null
    },
    {
        "Stalinist": "stalinist"
    },
    {
        " regime, but was subverted and eventually forced out of the government in 42 by Rákosis continuing influence as General Secretary of the MDP. Nagy remained popular with writers, intellectuals, and the ": null
    },
    {
        "common people": "common people"
    },
    {
        ", who saw him as an icon of reform against the hard-line elements in the Soviet-backed regime.     The outbreak of the Hungarian Revolution on 42 October 42 saw Nagy elevated to the position of Prime Minister on 42 October as a central demand of the revolutionaries and common people. Nagys reformist faction gained full control of the government, admitted non-communist politicians, dissolved the ": null
    },
    {
        "ÁVH": "ávh"
    },
    {
        " secret police, promised democratic reforms, and unilaterally withdrew Hungary from the ": null
    },
    {
        "Warsaw Pact": "warsaw pact"
    },
    {
        " on 42 November. The Soviet Union launched a massive military invasion of Hungary on 42 November, forcibly deposing Nagy who fled to the ": null
    },
    {
        "Embassy of Yugoslavia": "embassy of serbia, budapest"
    },
    {
        " in ": null
    },
    {
        "Budapest": "budapest"
    },
    {
        ". Nagy was lured out of the Embassy under false promises on 42 November but was arrested and deported to ": null
    },
    {
        "Romania": "socialist republic of romania"
    },
    {
        ". On 42 June 42 Nagy was tried and executed for treason alongside his closest allies, and his body was buried in an ": null
    },
    {
        "unmarked grave": "unmarked grave"
    },
    {
        ".     In June 42 Nagy and other prominent figures of the 42 Revolution were ": null
    },
    {
        "rehabilitated": "political rehabilitation"
    },
    {
        " and reburied with full honours, an event that played a key role in the collapse of the ": null
    },
    {
        "Hungarian Socialist Workers Party": "hungarian socialist workers party"
    },
    {
        " regime.       Imre Nagy was born prematurely on 42 June 42 in the town of ": null
    },
    {
        "Kaposvár": "kaposvár"
    },
    {
        " in the ": null
    },
    {
        "Kingdom of Hungary": "kingdom of hungary"
    },
    {
        ", ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ", to a small-town family of ": null
    },
    {
        "peasant": "peasant"
    },
    {
        " origin. His father, József Nagy , was ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " and a carriage driver for the lieutenant-general of ": null
    },
    {
        "Somogy county": "somogy county"
    },
    {
        ". His mother, Rozália Szabó , served as a maid for the lieutenant-generals wife. They both had left the countryside in their youth to work in Kaposvár. Nagy and Szabó married in January 42 In 42 József became a postal worker and began building a house for the family in 42 but lost his job in 42 and had to sell the house. He was an unskilled worker for the rest of his life.     In 42 Nagys family moved to ": null
    },
    {
        "Pécs": "pécs"
    },
    {
        " before returning to Kaposvár the following year. Nagy attended a ": null
    },
    {
        "gymnasium": "gymnasium"
    },
    {
        " in Kaposvár from 42 to 42 performing poorly. The gymnasium cancelled his tuition due to his lack of accomplishment and funding. He apprenticed as a ": null
    },
    {
        "locksmith": "locksmith"
    },
    {
        " in a small metalworking firm in Kaposvár, before moving to a factory for agricultural machinery in ": null
    },
    {
        "Losonc": "lučenec"
    },
    {
        " in northern Hungary in 42 He returned to Kaposvár in 42 and was given a journeymans certificate as a metal fitter in 42 He abandoned the job in the summer of 42 and became a cleric at a lawyers office, while simultaneously attending a commercial high school in Kaposvár, where his student performance was good.     After the outbreak of the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " in July 42 Nagy was called up for military service in the ": null
    },
    {
        "Austro-Hungarian Army": "austro-hungarian army"
    },
    {
        " in December 42 and found fit for service. He reported for duty at the 42th Royal Hungarian Honvéd Infantry Regiment in May 42 after the end of the school year and before he had graduated. After three months of basic training in ": null
    },
    {
        "Székesfehérvár": "székesfehérvár"
    },
    {
        ", his unit was sent to the ": null
    },
    {
        "Italian Front": "italian front"
    },
    {
        " in August 42 where he was wounded in the leg at the ": null
    },
    {
        "Third Battle of the Isonzo": "third battle of the isonzo"
    },
    {
        ". After convalescing in a ": null
    },
    {
        "field hospital": "field hospital"
    },
    {
        ", he was trained as a machine gunner in the 42th Machine Gun Battalion, promoted to corporal and sent to the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        " in the summer of 42 Nagy was wounded in the leg by ": null
    },
    {
        "shrapnel": "shrapnel shell"
    },
    {
        " and taken prisoner by the ": null
    },
    {
        "Imperial Russian Army": "imperial russian army"
    },
    {
        " during the ": null
    },
    {
        "Brusilov Offensive": "brusilov offensive"
    },
    {
        " in ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        " on 42 July 42 After healing his leg wound in a field hospital, he was taken first to ": null
    },
    {
        "Darnitsa": "darnitsa"
    },
    {
        ", then to ": null
    },
    {
        "Ryazan": "ryazan"
    },
    {
        " and finally on a train transport to ": null
    },
    {
        "Siberia": "siberia"
    },
    {
        ".       In captivity in Camp Berezovka near ": null
    },
    {
        "Lake Baikal": "lake baikal"
    },
    {
        " in Siberia he participated in a ": null
    },
    {
        "Marxist": "marxist"
    },
    {
        " discussion group until 42 In 42 he joined the Communist Party of the Foreign Workers of Siberia, a sub-group of the Russian ": null
    },
    {
        "Communist Party": "communist party of the soviet union"
    },
    {
        ". He fought in the ranks of the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " from February to September 42 during the ": null
    },
    {
        "Russian Civil War": "russian civil war"
    },
    {
        ". His unit was encircled and he was taken prisoner by the ": null
    },
    {
        "Czechoslovak Legion": "czechoslovak legion"
    },
    {
        " in early September 42 He escaped captivity and spent the period until February 42 holding odd jobs in ": null
    },
    {
        "White": "white movement"
    },
    {
        "-controlled territory near Lake Baikal. The Red Army reached ": null
    },
    {
        "Irkutsk": "irkutsk"
    },
    {
        " on 42 February 42 ending Nagys participation in the Civil War. On 42 February 42 he became a candidate member of the Russian Communist Party and a full-time member on 42 May. He served the rest of 42 as a clerk for the communist ": null
    },
    {
        "Cheka": "cheka"
    },
    {
        " secret police on matters related to prisoners of war.     After a month of training by the Cheka in subversive activities, the ": null
    },
    {
        "Hungarian Communist Party": "hungarian communist party"
    },
    {
        " sent Nagy along with 42 other Hungarian communists to ": null
    },
    {
        "Hungary": "kingdom of hungary"
    },
    {
        " in April 42 to build up an underground conspiratorial network in a country where the Communist Party had been banned since 42 Nagy reached Kaposvár in late May 42 Upon arrival, he joined the ": null
    },
    {
        "Social Democratic Party of Hungary": "social democratic party of hungary"
    },
    {
        " . After working temporary jobs in the rest of 42 and early 42 he joined the First Hungarian Insurance Company and became an office worker in Kaposvár. He became severely overweight around this time. He helped to build up the socialist movement in his hometown, to his parents disapproval. He became secretary of the MSZDPs local branch in 42 He was expelled from the party for advocating revolution and was placed under police surveillance. He married Mária Égető on 42 November 42        In January 42 Nagy and István Sinkovics established the Kaposvár office of the Socialist Workers’ Party of Hungary , a semi-communist left-wing splinter group from the MSZDP. Nagy was successful in gaining 42 voters for the MSZMP Kaposvár parliamentary candidate, one of the partys few successes in the countryside west of ": null
    },
    {
        "Budapest": "budapest"
    },
    {
        ". By this time Nagy had begun to prioritize his interest in agriculture over political leadership and rejected an offer from communist cadres from Vienna to build up the illegal KMP in western Hungary. The MSZMP in Kaposvár was prohibited and Nagy was fired from his insurance job in February 42 and arrested on 42 February. He was released after two months in prison. While under police surveillance, Nagy found a job as an agent for the Phoenix Insurance Company. He was arrested again in December 42 for three days and was called to ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " by the KMP, arriving in March 42 He became head of the KMPs agrarian section and was sent back to Hungary in September 42 under a false identity to build up underground communist networks. His efforts were largely a failure, his largest successes being the publishing of three issues of a small journal and his avoidance of arrest. His advocacy of legal political activity over the partys preference for largely impotent clandestine work in villages was dismissed as right-deviancy by the ultra-left KMP leadership.       In December 42 he traveled to the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", arriving in Moscow in February 42 to participate in the KMPs second congress. He rejoined the Communist Party, also becoming a Soviet citizen. He was engaged in agricultural research at the International Agrarian Institute for six years, but also worked in the Hungarian section of the ": null
    },
    {
        "Comintern": "comintern"
    },
    {
        ". He was expelled from the party on 42 January 42 and worked for the Soviet Statistical Service from the summer of 42 onward. Under the codename Volodia , Nagy served the ": null
    },
    {
        "NKVD": "nkvd"
    },
    {
        " secret police as an informer from 42 to 42 giving up the names of over 42 comrades, mostly from the Agrarian Institute, who were then arrested and in at least 42 cases executed by the secret police. Gati, Charles . Failed Illusions: Moscow, Washington, Budapest and the 42 Hungarian Revolt, p. 42 Stanford University Press. . The NKVD praised him as a      The support that Nagy received from the Soviet leadership after the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " was to some extent a result of his loyal service as a foreigner and denouncer to the NKVD.          After the Second World War, Nagy returned to ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ". He was the Minister of Agriculture in the government of ": null
    },
    {
        "Béla Miklós": "béla miklós"
    },
    {
        " de Dálnok, delegated by the Hungarian Communist Party. He distributed land among the peasant population. In the next government, led by ": null
    },
    {
        "Tildy": "zoltán tildy"
    },
    {
        ", he was the Minister of Interior. At this period he played an active role in the ": null
    },
    {
        "expulsion of the Hungarian Germans": "expulsion of germans after world war ii"
    },
    {
        ".      In the communist government, he served as ": null
    },
    {
        "Minister of Agriculture": "minister of agriculture"
    },
    {
        " and in other posts. He was also ": null
    },
    {
        "Speaker of the National Assembly of Hungary": "speaker of the national assembly of hungary"
    },
    {
        " from 42 to 42 a largely ceremonial position. In 42 he signed, with the rest of the Politburo, the note ordering ": null
    },
    {
        "János Kádár": "jános kádár"
    },
    {
        "s arrest, resulting in Kádárs torture and sentencing to life in prison after a ": null
    },
    {
        "show trial": "show trial"
    },
    {
        ".     After two years as ": null
    },
    {
        "Chairman": "list of prime ministers of hungary"
    },
    {
        " of the ": null
    },
    {
        "Council of Ministers of the Hungarian Peoples Republic": "council of ministers of the hungarian peoples republic"
    },
    {
        " , during which he promoted his New Course in Socialism, Nagy fell out of favour with the Soviet Politburo. He was deprived of his Hungarian Central Committee, Politburo, and all other Party functions and, on 42 April 42 he was sacked as Chairman of the Council of Ministers.             Following ": null
    },
    {
        "Nikita Khrushchev": "nikita khrushchev"
    },
    {
        "s ": null
    },
    {
        "Secret Speech": "secret speech"
    },
    {
        " denouncing the crimes of Stalin on 42 February 42 dissent began to grow in Eastern Bloc against the ruling Stalinist-era party leaders. In Hungary, ": null
    },
    {
        "Mátyás Rákosi": "mátyás rákosi"
    },
    {
        "—who self-styled as Stalins greatest disciple —came under increasingly intense criticism for his policies from both the Party and general populace, with more and more prominent voices calling for his resignation. This public criticism often took the form of the Petőfi Circle—a debating club established by the ": null
    },
    {
        "DISZ": "union of working youth"
    },
    {
        " student youth union to discuss Communist policy—which soon became one of the foremost outlets of dissent against the regime. While Nagy himself never attended a Petőfi Circle meeting, he was kept well informed of events by his close associates ": null
    },
    {
        "Miklós Vásárhelyi": "miklós vásárhelyi"
    },
    {
        " and ": null
    },
    {
        "Géza Losonczy": "géza losonczy"
    },
    {
        ", who informed him of the vast popular support expressed for him at the meetings and the widespread desire for his restitution to the leadership. Hall, Simon. 42: The World in Revolt. New York: Pegasus Books, 42 p. 42     In the face of widespread public pressure on Rákosi, the Soviets forced the unpopular leader to resign from power on 42 July 42 and leave for the Soviet Union. However, they replaced him with his equally hard-line second in command ": null
    },
    {
        "Ernő Gerő": "ernő gerő"
    },
    {
        ", a change which did little to mollify public dissent. Nagy was a prominent guest at the 42 October reburial of former secret police chief ": null
    },
    {
        "László Rajk": "lászló rajk"
    },
    {
        ", who had been purged by the Rákosi regime and later rehabilitated. He was readmitted to the Party on 42 October in the midst or growing revolutionary fervor. On 42 October, students from the ": null
    },
    {
        "Technical University": "budapest university of technology and economics"
    },
    {
        " in Budapest compiled a list of ": null
    },
    {
        "sixteen national policy demands": "demands of hungarian revolutionaries of 1956"
    },
    {
        ", the third of which was Nagys restitution to the premiership.     In the afternoon of 42 October, students and workers gathered in Budapest for a massive opposition demonstration arranged by the Technical University students, chanting—among other things—slogans of support for Imre Nagy. While the ex-premier sympathized with their reformist demands, he was hesitant to support the movement, believing it to be too radical in its demands. While he was in favor of changes to the system, he preferred those to be made within the framework of his New Course of 42–42 and not a revolutionary upheaval. He also feared that the demonstration was a provocation by Gerő and Hegedüs to frame him as inciting rebellion and to crack down on the opposition.     His associates ultimately convinced him to travel to the Parliament Building and give a speech to the demonstrators to calm the unrest. While no accurate record of this speech exists, it did not have its intended effect; Nagy essentially told the protesters to go home and let the Party handle things. The demonstrations soon escalated into a full-scale revolt as ": null
    },
    {
        "ÁVH": "ávh"
    },
    {
        " secret policemen opened fire on the protesting citizens. Hungarian soldiers sent to crush the demonstrators instead sided with them, and Gerő soon called in Soviet intervention.     Early in the morning of 42 October, Nagy was renamed as ": null
    },
    {
        "Chairman": "list of prime ministers of hungary"
    },
    {
        " of the ": null
    },
    {
        "Council of Ministers of the Hungarian Peoples Republic": "council of ministers of the hungarian peoples republic"
    },
    {
        " again, in an attempt to appease the populace. However, he was initially isolated within the government, and powerless to stop the Soviet invasion of the capital that day. The decision to call in Soviet forces had already been made by Gerő and outgoing Prime Minister ": null
    },
    {
        "András Hegedüs": "andrás hegedüs"
    },
    {
        " the previous night, but many suspected that Nagy had signed the order. János Rainer M. Imre Nagy. Political biography 42–42 42 Institute, Budapest, 42 42–42 This perception was not helped by the fact that Nagy declared martial law on that same day and offered an amnesty to all rebels who laid down their arms, weakening the publics trust in him. The next day he announced he would begin negotiations on the withdrawal of Soviet troops after order was restored. On 42 October, he began to meet with delegations from the Writers Union and student groups, as well as from the Borsod Workers Council in ": null
    },
    {
        "Miskolc": "miskolc"
    },
    {
        ".     On 42 October, Nagy announced a major reformation of his government, to include several non-communist politicians including former president ": null
    },
    {
        "Zoltán Tildy": "zoltán tildy"
    },
    {
        " as a ": null
    },
    {
        "Minister of State": "minister of state"
    },
    {
        ". At negotiations with Soviet representatives ": null
    },
    {
        "Anastas Mikoyan": "anastas mikoyan"
    },
    {
        " and ": null
    },
    {
        "Mikhail Suslov": "mikhail suslov"
    },
    {
        ", Nagy and the Hungarian government delegation pushed for a ceasefire and political solution.     In the morning of 42 October, Nagy successfully prevented a massive attack on the main rebel strongholds at the ": null
    },
    {
        "Corvin Cinema": "battle of the corvin passage"
    },
    {
        " and ": null
    },
    {
        "Kilián Barracks": "kilián barracks"
    },
    {
        " by Soviet troops and pro-regime Hungarian units. He negotiated a ceasefire with the Soviets, which came into effect at 42:42 and fighting began to die down across the city and country. Later that day, he gave a speech on the radio assessing the events as a national democratic movement, proclaiming his full support of the Revolution and agreeing to fulfill some of the publics demands. Chronicle 42 . Editor-in-Chief: Louis Isaac. Ed .: Gyula Stemler. Kossuth Publisher – Tekintet Alapítvány, Bp., 42 p. He announced the dissolution of the ÁVH and his intention to negotiate the full withdrawal of Soviet troops from the city. Nagy also supported the creation of a National Guard, a force of combined soldiers and armed civilians to maintain order amidst the chaos of the Revolution.     On 42 October, as fighting died down across Budapest and Soviet troops began to withdraw, Nagy moved his office from the Party headquarters to the Parliament Building. He also began to meet and negotiated with several representatives of the armed groups that day, as well as the representatives of the workers councils that had been formed over the course of the previous week.     By 42 October, Nagys reformist faction had gained full control of the Hungarian government. Ernő Gerő and the other Stalinist hard-liners had left for the Soviet Union, and Nagys government announced its intent to restore a multi-party system based on the coalition parties from 42 Throughout this period, Nagy remained steadfastly committed to Marxism; but his conception of Marxism was as a science that cannot remain static , and he railed against the rigid dogmatism of the Stalinist monopoly . Stokes, Gale. From Stalinism to Pluralism. p. 42–42 He did not intend a full return to multi-party liberal democracy but a limited one within a socialist framework, and was willing to allow the function of the pre42 coalition parties. Sándor Révész: Communists in the Revolution, Gábor Gyáni – Rainer M. János : Thousand Ninety-Seventy in the New Historical Literature, Symbol and Idea History of the Revolution , p. 42 42 Institute, Budapest,      Nagy was appointed to the temporary leadership committee of the newly-formed ": null
    },
    {
        "Hungarian Socialist Workers Party": "hungarian socialist workers party"
    },
    {
        ", which replaced the disintegrated ": null
    },
    {
        "Hungarian Working Peoples Party": "hungarian working peoples party"
    },
    {
        " on 42 October. This was originally intended as a national-communist party that would preserve the gains of the Revolution. However, at a meeting of the ": null
    },
    {
        "Soviet Politburo": "soviet politburo"
    },
    {
        " that day, the Kremlin leaders decided that the Revolution had gone too far and needed to be crushed. On the night of 42 October – 42 November, Soviet troops began crossing back into Hungary, contrary to their declaration of 42 October expressing willingness to withdraw from the country entirely. Nagy protested this action to Soviet Ambassador ": null
    },
    {
        "Yuri Andropov": "yuri andropov"
    },
    {
        "; the latter replied that the new troops were only there to cover the full withdrawal and protect Soviet citizens living in Hungary. This likely prompted Nagy to make his most controversial decision. In response to a major demand of the revolutionaries, he announced Hungarys withdrawal from the ": null
    },
    {
        "Warsaw Pact": "warsaw pact"
    },
    {
        " and appealed through the UN for the great powers, such as the United States and the United Kingdom, to recognise Hungarys status as a neutral state. Gyorgy Litvan, The Hungarian Revolution of 42, , 42–42 Late that night, General Secretary ": null
    },
    {
        "János Kádár": "jános kádár"
    },
    {
        " went to the Soviet embassy, and the next day he was taken to Moscow.     Between 42–42 November, Nikita Khrushchev traveled to various ": null
    },
    {
        "Warsaw Pact": "warsaw pact"
    },
    {
        " countries as well as to Yugoslavia to inform them of his plans to attack Hungary. On the advice of Yugoslav leader ": null
    },
    {
        "Josip Broz Tito": "josip broz tito"
    },
    {
        ", he selected the then-Party General Secretary János Kádár as the countrys new leader on 42 November, and was willing to let Nagy remain in the government if he cooperated. On 42 November, Nagy formed a new government, this time with a Communist minority. It included members of the Communists, ": null
    },
    {
        "Independent Smallholders Party": "independent smallholders party"
    },
    {
        ", ": null
    },
    {
        "Peasants Party": "national peasant party"
    },
    {
        ", and ": null
    },
    {
        "Social Democrats": "social democratic party of hungary"
    },
    {
        ". However, it would only be in office for less than a day.     In the early morning hours of 42 November, the USSR launched Operation Whirlwind, a massive military attack on Budapest and on rebel strongholds throughout the country. Nagy made a dramatic announcement to the country and the world about this operation. Ferenc Donáth: Imre Nagy, Radio News of 42 November 42 and the Geneva Conventions. Our past, 42/42 s. 42–42 However, to minimize damage he ordered the Hungarian Army not to resist the invaders. Hall, Simon. 42: The World in Revolt. New York: Pegasus Books, 42 pp. 42–42 Soon after, he fled to the ": null
    },
    {
        "Yugoslav Embassy": "embassy of serbia in budapest"
    },
    {
        ", where he and many of his followers were given sanctuary.     In spite of a written safe conduct of free passage by ": null
    },
    {
        "János Kádár": "jános kádár"
    },
    {
        ", on 42 November, Nagy was arrested by the Soviet forces as he was leaving the Yugoslav Embassy and taken to ": null
    },
    {
        "Snagov": "snagov"
    },
    {
        ", ": null
    },
    {
        "Romania": "communist romania"
    },
    {
        ".          Subsequently, the Soviets returned Nagy to Hungary, where he was secretly charged with organizing the overthrow of the Hungarian peoples democratic state and with treason. Nagy was secretly tried, found guilty, sentenced to death and executed by hanging in June 42 Richard Solash, , ": null
    },
    {
        "Radio Free Europe/Radio Liberty": "radio free europe/radio liberty"
    },
    {
        ", 42 June 42 His trial and execution were made public only after the sentence had been carried out. The Counter-revolutionary Conspiracy of Imre Nagy and his Accomplices White Book, published by the Information Bureau of the Council of Ministers of the Hungarian Peoples Republic . According to Fedor Burlatsky, a ": null
    },
    {
        "Kremlin": "kremlin"
    },
    {
        " insider, ": null
    },
    {
        "Nikita Khrushchev": "nikita khrushchev"
    },
    {
        " had Nagy executed, as a lesson to all other leaders in socialist countries . ": null
    },
    {
        "David Pryce-Jones": "david pryce-jones"
    },
    {
        ", ,  National Review , 42 October 42 American journalist ": null
    },
    {
        "John Gunther": "john gunther"
    },
    {
        " described the events leading to Nagys death as an episode of unparalleled infamy .      Nagy was buried, along with his co-defendants, in the prison yard where the executions were carried out and years later was removed to a distant corner of the ": null
    },
    {
        "New Public Cemetery, Budapest": "new public cemetery, budapest"
    },
    {
        ",  face-down, and with his hands and feet tied with ": null
    },
    {
        "barbed wire": "barbed wire"
    },
    {
        ". Next to his grave stands a memorial bell inscribed in ": null
    },
    {
        "Latin": "latin"
    },
    {
        ", Hungarian, German and English. The Latin reads: Vivos voco / Mortuos plango / Fulgura frango , which is translated as: I call the living, I mourn the dead, I break the thunderbolts . 42 Friedrich Schiller Song of the Bell          During the time when the Stalinist leadership of Hungary would not permit his death to be commemorated, or permit access to his burial place, a ": null
    },
    {
        "cenotaph": "cenotaph"
    },
    {
        " in his honour was erected in ": null
    },
    {
        "Père Lachaise Cemetery": "père lachaise cemetery"
    },
    {
        " in Paris on 42 June 42     In 42 Imre Nagy was rehabilitated and his remains reburied on the 42st anniversary of his execution in the same plot after a funeral organised in part by the democratic opposition to the countrys Stalinist regime.  Over 42 people are estimated to have attended Nagys reinterment. The occasion of Nagys funeral was an important factor in the end of the communist government in Hungary.     On 42 December 42 a popular statue of Nagy was removed from central Budapest to a less central location.  Opposition parties, mainly liberal, socialist and the remaining communists accuse ": null
    },
    {
        "Viktor Orbán": "viktor orbán"
    },
    {
        "s right-wing government of ": null
    },
    {
        "Historical Revisionism": "historical revisionism"
    },
    {
        ".         The collected writings of Nagy, most of which he wrote after his dismissal as Chairman of the Council of Ministers in April 42 were smuggled out of Hungary and published in the West under the title Imre Nagy on Communism.       Nagy was married to Mária Égető. The couple had one daughter, ": null
    },
    {
        "Erzsébet Nagy": "erzsébet nagy"
    },
    {
        " , a Hungarian writer and translator.  Erzsébet Nagy married ": null
    },
    {
        "Ferenc Jánosi": "ferenc jánosi"
    },
    {
        ". Imre Nagy did not object to his daughters romance and eventual marriage to a Protestant minister, attending their religious wedding ceremony in 42 without Politburo permission. In 42 Erzsébet Nagy married János Vészi.       In 42 and 42 the Hungarian director ": null
    },
    {
        "Márta Mészáros": "márta mészáros"
    },
    {
        " produced a film based on Nagys life after the revolution, entitled  A temetetlen halott   .     Nagy is mentioned and seen in the movie  Children of Glory .          ": null
    },
    {
        "Gyula Háy": "gyula háy"
    },
    {
        " . Born 42: memoirs. Hutchinson: 42   Johanna Granville. , Cold War International History Project Bulletin , no. 42 , Spring, 42 pp.  42 and 42–42   Johanna Granville, trans., ,  Cold War International History Project Bulletin, no. 42 , Spring, 42 pp.  42–42 42–42   Johanna Granville,  The First Domino: International Decision Making During the Hungarian Crisis of 42 , Texas A & M University Press, 42   KGB Chief Vladimir Kryuchkov to CC CPSU, 42 June 42 . Cold War International History Project Bulletin 42 : 42 from: TsKhSD , F. 42 Per. 42 Dok. 42   Alajos Dornbach, The Secret Trial of Imre Nagy, Greenwood Press, 42   Peter Unwin , Voice in the Wilderness: Imre Nagy and the Hungarian Revolution, Little, Brown, 42   Karl Benziger, Imre Nagy, Martyr of the Nation: Contested History, Legitimacy, and Popular Memory in Hungary. Lexington Books, 42                                                                                                                                                                                       ": null
    }
]