[
    {
        "         In vitro  ": null
    },
    {
        "studies": "Research"
    },
    {
        " are performed with ": null
    },
    {
        "microorganism": "Microorganism"
    },
    {
        "s, ": null
    },
    {
        "cells": "Cell"
    },
    {
        ", or ": null
    },
    {
        "biological molecules": "Biological Molecule"
    },
    {
        "outside their normal biological context. Colloquially called ": null
    },
    {
        "test-tube": "Test-Tube"
    },
    {
        " experiments , these studies in ": null
    },
    {
        "biology": "Biology"
    },
    {
        " and its subdisciplines are traditionally done in labware such as test tubes, flasks, ": null
    },
    {
        "Petri dish": "Petri Dish"
    },
    {
        "es, and ": null
    },
    {
        "microtiter plate": "Microtiter Plate"
    },
    {
        "s. Studies conducted using components of an ": null
    },
    {
        "organism": "Organism"
    },
    {
        " that have been isolated from their usual biological surroundings permit a more detailed or more convenient analysis than can be done with whole organisms; however, results obtained from in vitro experiments may not fully or accurately predict the effects on a whole organism. In contrast to in vitro experiments,  in vivo  studies are those conducted in living organisms, including humans, and whole plants.       In vitro  studies are conducted using components of an organism that have been isolated from their usual biological surroundings, such as microorganisms, cells, or biological molecules. For example, microorganisms or cells can be studied in artificial ": null
    },
    {
        "culture media": "Culture Medium"
    },
    {
        ", and proteins can be examined in ": null
    },
    {
        "solution": "Solution"
    },
    {
        "s. Colloquially called test-tube experiments , these studies in biology, medicine, and their subdisciplines are traditionally done in test tubes, flasks, Petri dishes, etc. They now involve the full range of techniques used in molecular biology, such as the omics.     In contrast, studies conducted in living beings are called in vivo .       Examples of in vitro studies include: the isolation, growth and identification of cells derived from ": null
    },
    {
        "multicellular organisms": "Multicellular Organisms"
    },
    {
        " in ; subcellular components ; cellular or subcellular extracts ; purified molecules such as ": null
    },
    {
        "protein": "Protein"
    },
    {
        "s, ": null
    },
    {
        "DNA": "Dna"
    },
    {
        ", or ": null
    },
    {
        "RNA": "Rna"
    },
    {
        "HepG2, HepaRG": null
    },
    {
        "d remov": "D Remov"
    },
    {
        "e.g. antibodiese.g. HIV-1typically cell culturetypically small animals, primates, and humans in successionas in “human on chip” systemsPKPDparent molecule or metabolites": null
    },
    {
        "PBPK": "Pbpk"
    }
]