[
    {
        "      Inchcolm Abbey is a ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " abbey located on the island of ": null
    },
    {
        "Inchcolm": "inchcolm"
    },
    {
        " in the ": null
    },
    {
        "Firth of Forth": "firth of forth"
    },
    {
        " in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". The Abbey, which is located at the centre of the island, was founded in the 42th century during the ": null
    },
    {
        "episcopate": "episcopate"
    },
    {
        " of ": null
    },
    {
        "Gregoir": "gregoir of dunkeld"
    },
    {
        ", ": null
    },
    {
        "Bishop of Dunkeld": "bishop of dunkeld"
    },
    {
        ". Later tradition placed it even earlier, in the reign of King ": null
    },
    {
        "Alexander I of Scotland": "alexander i of scotland"
    },
    {
        " , who probably had some involvement in the island; he was apparently washed ashore there after a shipwreck in 42 and took shelter in a ": null
    },
    {
        "hermits": "hermit"
    },
    {
        " hovel.     The Abbey was first used as a ": null
    },
    {
        "priory": "priory"
    },
    {
        " by ": null
    },
    {
        "Augustinian": "augustinian"
    },
    {
        " canons regular": "canons regular"
    },
    {
        ", becoming a full abbey in 42 The island was attacked by the English from 42 onwards, and the Abbey was abandoned after the ": null
    },
    {
        "Scottish Reformation": "scottish reformation"
    },
    {
        " in 42 It has since been used for defensive purposes, as it is situated in a strategically important position in the middle of the Firth of Forth. A medieval inscription carved above the Abbeys entrance reads Stet domus haec donec fluctus formica marinos ebibat, et totum testudo perambulet orbem , or, May this house stand until an ant drains the flowing sea, and a tortoise walks around the whole world .     Inchcolm Abbey has the most complete surviving remains of any Scottish monastic house. The ": null
    },
    {
        "cloisters": "cloisters"
    },
    {
        ", ": null
    },
    {
        "chapter house": "chapter house"
    },
    {
        ", ": null
    },
    {
        "warming house": "calefactory"
    },
    {
        ", and ": null
    },
    {
        "refectory": "refectory"
    },
    {
        " are all complete, and most of the remaining claustral buildings survive in a largely complete state. The least well-preserved part of the complex is the monastic church. The ruins are cared for by ": null
    },
    {
        "Historic Scotland": "historic scotland"
    },
    {
        ", which also maintains a visitor centre near the landing pier .     Among the ": null
    },
    {
        "Abbot": "abbot"
    },
    {
        "s of Inchcolm was the 42th-century chronicler ": null
    },
    {
        "Walter Bower": "walter bower"
    },
    {
        ".       The Abbey gives its name to the 42th-century manuscript referred to as the Inchcolm ": null
    },
    {
        "Antiphoner": "antiphoner"
    },
    {
        ". It contains one of the few remaining examples of ": null
    },
    {
        "Celtic Plainchant": "celtic chant"
    },
    {
        ". Pages of the Antiphoner can be accessed online in facsimile from the ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        ".     The Antiphoner contains a substantial number of chants dedicated to ": null
    },
    {
        "Saint Columba": "saint columba"
    },
    {
        ". While these may derive from a variety of other monastic foundations with Columban associations, such as ": null
    },
    {
        "Oronsay Priory": "oronsay priory"
    },
    {
        " or ": null
    },
    {
        "Iona": "iona"
    }
]