[
    {
        "     The incompatible-properties argument is the idea that no description of ": null
    },
    {
        "God": "God"
    },
    {
        " is consistent with ": null
    },
    {
        "reality": "Reality"
    },
    {
        ". For example, if one takes the definition of God to be described fully from the ": null
    },
    {
        "Bible": "Bible"
    },
    {
        ", then the claims of what properties God has described therein might be argued to lead to a ": null
    },
    {
        "contradiction": "Contradiction"
    },
    {
        ".       The ": null
    },
    {
        "problem of evil": "Problem Of Evil"
    },
    {
        " is the ": null
    },
    {
        "argument": "Argument"
    },
    {
        " that the existence of evil is incompatible with the concept of an omnipotent and perfectly good God.     A variation does not depend on the existence of evil. A truly omnipotent God could create all possible worlds. A good God can create only good worlds. A God that created all possible worlds would have no moral qualities whatsoever, and could be replaced by a random generator. The standard response is to argue a distinction between could create and would create. In other words, God could create all possible worlds but that is simply not in Gods nature. This has been argued by theologians for centuries. However, the result is that a good God is incompatible with some possible worlds, thus incapable of creating them without losing the property of being a totally different God. Yet, it is not necessary for God to be good . He simply is good, but is capable of evil.       One argument based on incompatible properties rests on a definition of God that includes a will, plan or purpose and an existence outside of ": null
    },
    {
        "time": "Time"
    },
    {
        ". To say that a being possesses a purpose implies an inclination or tendency to steer events toward some state that does not yet exist. This, in turn, implies a privileged direction, which we may call ": null
    },
    {
        "time": "Time"
    },
    {
        " . It may be one direction of ": null
    },
    {
        "causality": "Causality"
    },
    {
        ", the direction of increasing ": null
    },
    {
        "entropy": "Entropy"
    },
    {
        ", or some other ": null
    },
    {
        "emergent property": "Emergent Property"
    },
    {
        " of a world. These are not identical, but one must exist in order to progress toward a goal.     In general, Gods time would not be related to our time. God might be able to operate within our time without being constrained to do so. However, God could then step outside this game for any purpose. Thus Gods time must be aligned with our time if human activities are relevant to Gods purpose.      A God existing outside of any sort of time could not create anything because creation substitutes one thing for another, or for nothing. Creation requires a creator that existed, by definition, prior to the thing created.            Another pair of alleged incompatible properties is ": null
    },
    {
        "omniscience": "Omniscience"
    },
    {
        " and either ": null
    },
    {
        "indeterminacy": "Indeterminism"
    },
    {
        " or ": null
    },
    {
        "free will": "Free Will"
    },
    {
        ". Omniscience concerning the past and present is not a problem, but there is an argument that omniscience regarding the future implies it has been determined, what seems possible only in a deterministic world.       Another pair is ": null
    },
    {
        "divine simplicity": "Divine Simplicity"
    },
    {
        " and omniscience.": null
    }
]