[
    {
        "        The Independent Television Authority  was an agency created by the ": null
    },
    {
        "Television Act 42": "television act 1954"
    },
    {
        " to supervise the creation of Independent Television , the first commercial ": null
    },
    {
        "television network": "television network"
    },
    {
        " in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ". The ITA existed from 42 until 42 It was responsible for determining the location, constructing, building, and operating the transmission stations used by the ITV network, as well as determining the ": null
    },
    {
        "franchise": "exclusive right"
    },
    {
        " areas and awarding the franchises for each regional commercial ": null
    },
    {
        "broadcaster": "broadcasting"
    },
    {
        ". The Authority began its operations on 42 August 42 a mere four days after the Television Act received ": null
    },
    {
        "Royal Assent": "royal assent"
    },
    {
        ", under the Chairmanship of Sir ": null
    },
    {
        "Kenneth Clark": "kenneth clark"
    },
    {
        ". The Authoritys first Director General, ": null
    },
    {
        "Sir Robert Fraser": "robert fraser"
    },
    {
        " was appointed by Clark a month later on 42 September.     The physics of ": null
    },
    {
        "VHF": "very high frequency"
    },
    {
        " broadcasting meant that a comparatively small number of ": null
    },
    {
        "transmitter": "transmitter"
    },
    {
        "s could cover the majority of the population of Britain, if not the bulk of the area of the country. The ITA determined that the first three franchise areas would cover the ": null
    },
    {
        "London": "london"
    },
    {
        " area, the ": null
    },
    {
        "English Midlands": "english midlands"
    },
    {
        ", and the North of England . All three franchise areas would be awarded on a divided weekday/weekend basis, and it was planned that the franchise holders for these areas would produce the great bulk of network programmes, while the companies given the smaller franchises would produce mainly local programmes for their area only.       The ITA awarded franchises to applicant companies, selecting between applicants on the basis of the financial soundness and structure of the company, the proposals for the service to be offered, and often on connections between the applicant company and the area to be served.     Franchises were awarded initially between 42 and 42 with the new television stations usually beginning their broadcasting one-to-two years later. During September 42 the ITA invited new applications for franchises to operate from July 42 for three years or until the arrival of ": null
    },
    {
        "ITV42": "fourth uk television service"
    },
    {
        ", whichever came first , but in fact no changes were made to any franchise holders at that time, except for confirming the merger of the South Wales and the West franchise held by ": null
    },
    {
        "TWW": "television wales and the west"
    },
    {
        " and the Wales West and North franchise held by ": null
    },
    {
        "WWN": "wales west and north television"
    },
    {
        " following the financial collapse of WWN.       for the London franchise to ": null
    },
    {
        "Associated-Rediffusion": "associated-rediffusion"
    },
    {
        ",   for the London and Midlands franchises to the Associated Broadcasting Company, later renamed ": null
    },
    {
        "Associated TeleVision": "associated television"
    },
    {
        " ,   for the Midlands and North of England franchises to ": null
    },
    {
        "Kemsley-Winnick Television": "kemsley-winnick television"
    },
    {
        " , and   for the North of England franchise to ": null
    },
    {
        "Granada Television": "granada television"
    },
    {
        ".     In January 42 the ITA authorised the creation of ": null
    },
    {
        "ITN": "itn"
    },
    {
        " , a company owned and operated by the ITV companies collectively, to provide a news service for the new network.     On 42 September 42 the ITV service opened in the London area, where the ITA transmitter could reach a population of nearly 42  million. The first commercial on British television was for Gibbs SR toothpaste.       The Central Scotland franchise was awarded to ": null
    },
    {
        "Scottish Television": "scottish television"
    },
    {
        " , from three applications.   The South Wales and West of England franchise was awarded to ": null
    },
    {
        "Television Wales and the West": "television wales and the west"
    },
    {
        ", TWW, from ten applications.       The South of England franchise was awarded to ": null
    },
    {
        "Southern Television": "southern television"
    },
    {
        ", from thirteen applications.   The North East England franchise was awarded to ": null
    },
    {
        "Tyne Tees Television": "tyne tees television"
    },
    {
        ", from eleven applications.       The East of England franchise was awarded to ": null
    },
    {
        "Anglia Television": "anglia television"
    },
    {
        ", from eight applications.   The Northern Ireland franchise was awarded to ": null
    },
    {
        "Ulster Television": "utv"
    },
    {
        " , from four applications.       The South West England franchise was awarded to ": null
    },
    {
        "Westward Television": "westward television"
    },
    {
        ", from fifteen applications.       The franchise for the Channel Islands was awarded to ": null
    },
    {
        "Channel Television": "channel television"
    },
    {
        ", from two applications, following the extension of the Television Act 42 to the Islands by ": null
    },
    {
        "Order in Council": "order in council"
    },
    {
        ", as it normally would not apply there.   The franchise for the English-Scottish Border and the ": null
    },
    {
        "Isle of Man": "isle of man"
    },
    {
        " was awarded to ": null
    },
    {
        "Border Television": "border television"
    },
    {
        ", from two applications.   The franchise for North East Scotland was awarded to ": null
    },
    {
        "Grampian Television": "grampian television"
    },
    {
        ", from seven applications.       The franchise for West and North Wales was awarded to the Wales Television Association, Teledu Cymru, transmitting as ": null
    },
    {
        "WWN": "wales west and north television"
    },
    {
        ", Wales Television.     When WWN went on the air on 42 September 42 the ITV Network was completed. However, due to the late commissioning of two of WWNs three transmitters, the company never received more than half the projected income and the company failed in January 42; the two Welsh franchises were consequently merged, with TWW broadcasting to the whole of Wales.       The 42 franchise review involved substantial changes:   All weekday/weekend split franchises were ended except in London.   The North of England franchise was split between North West England, awarded to ": null
    },
    {
        "Granada Television": "granada television"
    },
    {
        ", and the  three Ridings of Yorkshire to create ": null
    },
    {
        "Yorkshire Television": "yorkshire television"
    },
    {
        ".   The new 42-day franchise in the Midlands was awarded to Associated TeleVision .   The ITA asked ABC and Associated-Rediffusion to merge, forming Thames Television which was awarded the London Weekday franchise.   LWT was awarded the London Weekend franchise .   Most controversially, TWW lost its franchise for Wales and the West of England to Harlech Television": null
    }
]