[
    {
        "Indirect self-reference describes an object ": null
    },
    {
        "referring to itself": "self-reference"
    },
    {
        " indirectly.     For example, define the function f such that f x. Any function passed as an argument to f is invoked with itself as an argument, and thus in any use of that argument is indirectly referring to itself.     This example is similar to the ": null
    },
    {
        "Scheme": "scheme"
    },
    {
        " expression , which is expanded to itself by beta reduction, and so its evaluation loops indefinitely despite the lack of explicit looping constructs. An equivalent example can be formulated in ": null
    },
    {
        "lambda calculus": "lambda calculus"
    },
    {
        ".     Indirect self-reference is special in that its self-referential quality is not explicit, as it is in the sentence this sentence is false. The phrase this sentence refers directly to the sentence as a whole. An indirectly self-referential sentence would replace the phrase this sentence with an expression that effectively still referred to the sentence, but did not use the pronoun this.     An example will help to explain this. Suppose we define the ": null
    },
    {
        "quine": "quine"
    },
    {
        " of a phrase to be the quotation of the phrase followed by the phrase itself. So, the quine of:   is a sentence fragment   would be:   is a sentence fragment is a sentence fragment   which, incidentally, is a true statement.     Now consider the sentence:   when quined, makes quite a statement when quined, makes quite a statement     The quotation here, plus the phrase when quined, indirectly refers to the entire sentence. The importance of this fact is that the remainder of the sentence, the phrase makes quite a statement, can now make a statement about the sentence as a whole. If we had used a pronoun for this, we could have written something like this sentence makes quite a statement.     It seems silly to go through this trouble when pronouns will suffice , but in systems of ": null
    },
    {
        "mathematical logic": "mathematical logic"
    },
    {
        ", there is generally no analog of the pronoun. It is somewhat surprising, in fact, that self-reference can be achieved at all in these systems.     Upon closer inspection, it can be seen that in fact, the ": null
    },
    {
        "Scheme": "scheme"
    },
    {
        " example above uses a ": null
    },
    {
        "quine": "quine"
    },
    {
        ", and f is actually the quine function itself.     Indirect self-reference was studied in great depth by ": null
    },
    {
        "W. V. Quine": "willard van orman quine"
    },
    {
        " , and occupies a central place in the proof of ": null
    },
    {
        "Gödels incompleteness theorem": "gödels incompleteness theorem"
    }
]