[
    {
        "In many ": null
    },
    {
        "common law": "common law"
    },
    {
        "jurisdictions": "jurisdiction"
    },
    {
        " , an indictable offence is an offence which can only be tried on an ": null
    },
    {
        "indictment": "indictment"
    },
    {
        " after a preliminary hearing to determine whether there is a  prima facie  case to answer or by a ": null
    },
    {
        "grand jury": "grand jury"
    },
    {
        " . In the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", a crime of similar severity and rules is called a ": null
    },
    {
        "felony": "felony"
    },
    {
        ", which also requires an indictment.       In relation to ": null
    },
    {
        "England and Wales": "england and wales"
    },
    {
        ", the expression indictable offence means an offence which, if committed by an adult, is triable on ": null
    },
    {
        "indictment": "indictment"
    },
    {
        ", whether it is exclusively so triable or ": null
    },
    {
        "triable either way": "triable either way"
    },
    {
        "; and the term indictable, in its application to offences, is to be construed accordingly. In this definition, references to the way or ways in which an offence is triable are to be construed without regard to the effect, if any, of section 22 of the ": null
    },
    {
        "Magistrates Courts Act 1980": "magistrates courts act 1980"
    },
    {
        " on the mode of trial in a particular case. The ": null
    },
    {
        "Interpretation Act 1978": "interpretation act 1978"
    },
    {
        ", section 5 and Schedule 1 , as amended by section 154 of, and paragraph 169 of Schedule 7 to, the ": null
    },
    {
        "Magistrates Courts Act 1980": "magistrates courts act 1980"
    },
    {
        ".     An either-way offence allows the defendant to elect between trial by jury on indictment in the ": null
    },
    {
        "Crown Court": "crown court"
    },
    {
        " and summary trial in a ": null
    },
    {
        "magistrates court": "magistrates court"
    },
    {
        ". However, the election may be overruled by the magistrates court if the facts suggest that the ": null
    },
    {
        "sentencing": "sentence"
    },
    {
        " powers of a magistrates court would be inadequate to reflect the seriousness of the offence.     In relation to some indictable offences, for example criminal damage, only summary trial is available unless the damage caused exceeds £5,000.     A youth court has jurisdiction to try all indictable offences with the exception of homicide and certain firearms offences, and will normally do so provided that the available sentencing power of two years detention is adequate to punish the offender if found guilty.       See section 64 of the ": null
    },
    {
        "Criminal Law Act 1977": "criminal law act 1977"
    },
    {
        ".     Grand juries were abolished in 1933.       Some offences such as ": null
    },
    {
        "murder": "murder"
    },
    {
        " and ": null
    },
    {
        "rape": "rape"
    },
    {
        " are considered so serious that they can only be tried on indictment at the ": null
    },
    {
        "Crown Court": "crown court"
    },
    {
        " where the widest range of sentencing powers is available to the ": null
    },
    {
        "judge": "judge"
    },
    {
        ".     The expression indictable-only offence was defined by  of the ": null
    },
    {
        "Crime and Disorder Act 1998": "crime and disorder act 1998"
    },
    {
        ", as originally enacted, as an offence triable only on indictment. Sections 51 and 52 of, and Schedule 3 to, that Act abolished committal proceedings for such offences and made other provisions in relation to them.     When the accused is charged with an indictable-only offence, he or she will be tried in the Crown Court. The rules are different in England and Wales in respect of those under 18 years of age.     See also section 14 of the ": null
    },
    {
        "Criminal Law Act 1977": "criminal law act 1977"
    },
    {
        ".       Similarly in New Zealand, a rape or murder charge will be tried at the High Court, while less serious offences such as theft, will be tried at the District Court. However, the District Court can hold both jury and summary trials.       For differences between indictable offences and summary offences see ": null
    },
    {
        "summary offences": "summary offencecanada"
    },
    {
        ".       In United States penal law, other than a felony, court findings of, or an act of ": null
    },
    {
        "gross negligence": "gross negligence"
    }
]