[
    {
        "         In ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", the Indo-European ablaut  is a system of ": null
    },
    {
        "apophony": "apophony"
    },
    {
        "  in the ": null
    },
    {
        "Proto-Indo-European language": "proto-indo-european language"
    },
    {
        ". All modern ": null
    },
    {
        "Indo-European languages": "indo-european languages"
    },
    {
        " have inherited the feature, though its prevalence and productivity strongly varies.     An example of ablaut in English is the ": null
    },
    {
        "strong verb": "germanic strong verb"
    },
    {
        " sing, sang, sung and its related noun song, a paradigm inherited directly from the Proto-Indo-European stage of the language.       The term  ablaut   was coined in the early nineteenth century by linguist ": null
    },
    {
        "Jacob Grimm": "jacob grimm"
    },
    {
        ". However, the phenomenon of the Indo-European ablaut itself was first recorded more than 42 years earlier by the ": null
    },
    {
        "Sanskrit grammar": "sanskrit grammar"
    },
    {
        "ians and was codified by ": null
    },
    {
        "Pāṇini": "pāṇini"
    },
    {
        " in his ": null
    },
    {
        "Ashtadhyayi": "ashtadhyayi"
    },
    {
        ", where the terms   and   were used to describe the phenomena now known respectively as the full grade and lengthened grade.     In the context of European languages, the phenomenon was first described in the early 42th century by the Dutch linguist ": null
    },
    {
        "Lambert ten Kate": "lambert ten kate"
    },
    {
        ", in his book Gemeenschap tussen de Gottische spraeke en de Nederduytsche .       Since ablaut was a regular system in Proto-Indo-European but survives only as irregular or partially regular variations in the recorded languages, any explanation of ablaut has to begin with an overview of PIE.     Proto-Indo-European is the hypothetical parent language from which most of the modern and ancient European languages evolved. By comparing the recorded forms from PIEs ": null
    },
    {
        "daughter language": "daughter language"
    },
    {
        "s, linguists can infer the forms of the parent language. However, it is not possible to be certain how the reconstructed forms were pronounced, and the reconstructions are to be understood as an encoding of the deduced phonemes, rather than a reliable indication of the actual pronunciations.     Established convention marks all PIE forms with an asterisk to indicate that they are hypothetical. For more details on these reconstructions, see ": null
    },
    {
        "Proto-Indo-European language": "proto-indo-european language"
    },
    {
        ", ": null
    },
    {
        "Laryngeal theory": "laryngeal theory"
    },
    {
        " and ": null
    },
    {
        "Comparative method": "comparative method"
    },
    {
        ".          Vowel gradation is any vowel difference between two related words  or two forms of the same word . The difference need not be indicated in the spelling. There are many kinds of vowel gradation in English and other languages, which are discussed generally in the article ": null
    },
    {
        "apophony": "apophony"
    },
    {
        ". Some involve a variation in vowel length, others in vowel coloring  and others the complete disappearance of a vowel .     For the study of European languages, one of the most important instances of vowel gradation is the Indo-European ablaut, remnants of which can be seen in the English verbs ride, rode, ridden, or fly, flew, flown. For simply learning English grammar, it is enough to note that these verbs are ": null
    },
    {
        "irregular": "irregular verb"
    },
    {
        ", but understanding why they have unusual forms that seem irregular requires an understanding of the grammar of the ": null
    },
    {
        "reconstructed proto-language": "reconstructed language"
    },
    {
        ", where they were regular.     Ablaut is the oldest and most extensive single source of vowel gradation in the Indo-European languages and must be distinguished clearly from other forms of gradation, which developed later, such as Germanic ": null
    },
    {
        "umlaut": "germanic umlaut"
    },
    {
        "  or the results of modern English word-stress patterns . Confusingly, in some contexts, the terms ablaut, vowel gradation, apophony and vowel alternation are used synonymously, especially in ": null
    },
    {
        "synchronic": "wikt:synchronic"
    },
    {
        " comparisons, but ": null
    },
    {
        "historical linguists": "historical linguistics"
    },
    {
        " prefer to keep ablaut for the specific Indo-European phenomenon, which is the meaning intended by the linguists who first coined the word.       In Proto-Indo-European, the basic, inherent vowel of most syllables was a short e. Ablaut is the name of the process whereby this short e changed, becoming short o, long ē, long ō or sometimes disappearing entirely to leave no vowel at all.     Thus, ablaut turned short e into the following sounds:          If a syllable had a short e, it is said to be in the e-grade or full grade . When it had no vowel, it is said to be in the zero grade . Syllables with long vowels are said to be in lengthened grade .      A classic example of the five grades of ablaut in a single root is provided by the different case forms of two closely related Greek words. In the following table, an acute accent marks the syllable carrying the word stress; a macron marks long vowels and the syllable in bold is the one illustrating the different vowel gradations.     ::     In this unusually neat example, the following can be seen:   A switch to the zero-grade when the word stress moves to the following syllable.   A switch to the o-grade when the word stress moves to the preceding syllable.   A lengthening of the vowel when the syllable is in word-final position.     As with most reconstructions, however, scholars differ about the details of this example.     One way to think of this system is that Proto-Indo-European originally had only one vowel, short e, and over time, it changed according to phonetic context, so the language started to develop a more complex vowel system. Thus, it has often been speculated that an original e-grade underwent two changes in some phonetic environments: under certain circumstances, it changed to o and in others, it disappeared entirely .     However, that is not certain: the phonetic conditions that controlled ablaut have never been determined, and the position of the word stress may not have been a key factor at all. There are many counterexamples to the proposed rules: deywós and its nominative plural deywóes show pretonic and posttonic e-grade, respectively, and wĺ̥kʷos has an accented zero grade.       Many examples of lengthened grades, including those listed above, are not directly conditioned by ablaut. Instead, they are a result of sound changes like ": null
    },
    {
        "Szemerényis law": "szemerényis law"
    },
    {
        " and ": null
    },
    {
        "Stangs law": "stangs law"
    },
    {
        ", which caused ": null
    },
    {
        "compensatory lengthening": "compensatory lengthening"
    },
    {
        " of originally-short vowels. In the examples above, Szemerényis law affected the older sequences ph 42 -tér-s and n̥-péh 42 -tor-s, changing them to ph 42 -tḗr and n̥-péh 42 -tōr. Thus, these forms were originally in the regular, unlengthened e-grade and o-grade. Such lengthened vowels were, however, later ": null
    },
    {
        "grammaticalised": "grammaticalization"
    },
    {
        " and spread to other words in which the change did not occur.     Nevertheless, there are examples of true lengthened grades, in which short e alternates with long ē. Examples are the verbs with ": null
    },
    {
        " Narten inflection": "narten present"
    },
    {
        ", and nouns like mḗh₁-n̥s moon , genitive méh₁-n̥s-os. Alternations of this type were rare, however, and the e ~ o ~ ∅ alternation was the most common by far. The long ō grade was rarer still and may not have actually been a part of the ablaut system at all.       The zero grade of ablaut may appear difficult for speakers of English. However, there are several languages who show fricatives and even plosives in syllable nuclei. In the case of ph 42 trés, which may already have been pronounced something like , it is not difficult to imagine it as a contraction of an older ph 42 terés, pronounced perhaps , as this combination of consonants and vowels would be possible in English as well. In other cases, however, the absence of a vowel strikes the speaker of a modern western European language as unpronounceable.     To understand, one must be aware that there were a number of sounds that were consonants in principle but could operate in ways analogous to vowels: the four syllabic sonorants, the three ": null
    },
    {
        "laryngeals": "laryngeal theory"
    },
    {
        " and the two semi-vowels:     The ": null
    },
    {
        "syllabic sonorants": "syllabic consonant"
    },
    {
        " are m, n, r and l, which could be consonants much as they are in English, but they could also be held on as continuants and carry a full syllable stress and then are transcribed with a small circle beneath them.   The laryngeals could be pronounced as consonants, in which case they were probably variations on the h sound and so normally transcribed as h 42 , h 42 and h 42 . However, they could also carry a syllable stress, in which case they were more like vowels. Thus, some linguists prefer to transcribe them ə 42 , ə 42 and ə 42 . The vocalic pronunciation may have originally involved the consonantal sounds with a very slight schwa before and/or after the consonant.   In pre-vocalic positions, the phonemes u and i were semi-vowels, probably pronounced like English w and y, but they could also become pure vowels when the following ablaut vowel reduced to zero.     When u and i came in postvocalic positions, the result was a diphthong. Ablaut is nevertheless regular and looks like this:          Thus, any of these could replace the ablaut vowel when it was reduced to the zero-grade: the pattern CVrC  could become CrC .     However, not every PIE syllable was capable of forming a zero grade; some consonant structures inhibited it in particular cases, or completely. Thus, for example, although the ": null
    },
    {
        "preterite": "preterite"
    },
    {
        " plural of a Germanic strong verb is derived from the zero grade, classes 42 and 42 have instead vowels representing the lengthened e-grade, as the stems of these verbs could not have sustained a zero grade in this position.     Zero grade is said to be from pre-PIE ": null
    },
    {
        "syncope": "syncope"
    },
    {
        " in unaccented syllables, but in some cases the lack of accent does not cause zero grade: deywó-, nominative plural -es god . There does not seem to be a rule governing the unaccented syllables that take zero grade and the ones that take stronger grades.       It is still a matter of debate whether PIE had an original a-vowel at all. In later PIE, the disappearance of the laryngeal h 42 could leave an a-colouring and this may explain all occurrences of a in later PIE. However, some argue controversially that the e-grade could sometimes be replaced by an a-grade without the influence of a laryngeal, which might help to explain the vowels in class 42 ": null
    },
    {
        "Germanic verbs": "germanic strong verb"
    },
    {
        ", for example.       Although PIE had only this one, basically regular, ablaut sequence, the development in the daughter languages is frequently far more complicated, and few reflect the original system as neatly as Greek. Various factors, such as ": null
    },
    {
        "vowel harmony": "vowel harmony"
    },
    {
        ", assimilation with nasals, or the effect of the presence of laryngeals in the Indo-European roots as well as their subsequent loss in most daughter languages, mean that a language may have several different vowels representing a single vowel in the parent language.     In particular, the zero grade was often subject to modification from changes in the pronunciation of syllabic sonorants. For example, in Germanic, syllabic sonorants acquired an ": null
    },
    {
        "epenthetic": "epenthesis"
    },
    {
        " -u-, thus converting the original zero grade to a new u-grade in many words. Thus, while ablaut survives in some form in all Indo-European languages, it became progressively less systematic over time.     Ablaut explains vowel differences between related words of the same language. For example:   English strike and stroke both come from the same IE root streyg-. The former comes from the e-grade, the latter from the o-grade.   German Berg and Burg both come from the root bʰergʰ-, which presumably meant high . The former comes from the e-grade, the latter from the zero-grade.    Ablaut also explains vowel differences between cognates in different languages.   English tooth comes from Germanic tanþ-s , genitive tund-iz . This form is related to Latin dens, dentis and Greek , , with the same meaning, and is reflected in the English words dentist and orthodontic. One reconstructed IE form is dónts, genitive dn̥tés. The consonant differences can be explained by regular sound shifts in primitive Germanic but not the vowel differences: by the regular laws of sound changes, Germanic a can originate from PIE o, but un usually goes back to a syllabic n̥.     :The explanation is that the Germanic and Greek nominative forms developed from the o-grade, the Latin word and the Germanic genitive from the zero-grade . Going a step further back, some scholars reconstruct h 42 dónts, from the zero grade of the root h 42 ed- to eat and the participle -ont- and explain it as the eating one.   English foot comes from the lengthened o-grade of ped-. Greek ,  and Latin pes, pedis , come from the o-grade and the e-grade respectively.     For the English-speaking non-specialist, a good reference work for quick information on IE roots, including the difference of ablaut grade behind related lexemes, is ": null
    },
    {
        "Calvert Watkins": "calvert watkins"
    },
    {
        ", The American Heritage Dictionary of Indo-European Roots, 42nd edition, Boston & New York 42           In PIE, there were already ablaut differences within the paradigms of verbs and nouns. These were not the main markers of grammatical form, since the inflection system served this purpose, but they must have been significant secondary markers.     An example of ablaut in the paradigm of the noun in PIE can be found in pértus, from which the English words ford and port are derived .     ::     An example in a verb is bʰeydʰ- to wait .     ::     In the daughter languages, these came to be important markers of grammatical distinctions. The vowel change in the Germanic strong verb, for example, is the direct descendant of that seen in the Indo-European verb paradigm. Examples in modern English are the following:     ::     It was in this context of Germanic verbs that ablaut was first described, and this is still what most people primarily associate with the phenomenon. A fuller description of ablaut operating in English, German and Dutch verbs and of the historical factors governing these can be found at the article ": null
    },
    {
        "Germanic strong verb": "germanic strong verb"
    },
    {
        ".     The same phenomenon is displayed in the verb tables of ": null
    },
    {
        "Latin": "latin"
    },
    {
        ", ": null
    },
    {
        "Ancient Greek": "greek language"
    },
    {
        " and ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        ". Examples of ablaut as a grammatical marker in Latin are the vowel changes in the perfect stem of verbs.     ::     Ablaut can often explain apparently random irregularities. For example, the verb to be in Latin has the forms est and sunt . The equivalent forms in German are very similar: ist and sind. The same forms are present in Slavic languages: est and sut.     The difference between singular and plural in these languages is easily explained: the PIE root is h 42 es-. In the singular, the stem is stressed, so it remains in the e-grade, and it takes the inflection -ti. In the plural, however, the inflection -énti was stressed, causing the stem to reduce to the zero grade: h 42 es-énti → h 42 s-énti. See main article: ": null
    },
    {
        "Indo-European copula": "indo-european copula"
    },
    {
        ".     Some of the morphological functions of the various grades are as follows:     e-grade:   Present tense of thematic verbs; root stress.   Present singular of athematic verbs; root stress.   Accusative and vocative singular, nominative, accusative and vocative dual, nominative plural of nouns.     o-grade:   Verbal nouns   stem-stressed masculine action nouns ": null
    }
]