[
    {
        "Inductively coupled plasma mass spectrometry  is a type of ": null
    },
    {
        "mass spectrometry": "mass spectrometry"
    },
    {
        " that uses an ": null
    },
    {
        "Inductively coupled plasma": "inductively coupled plasma"
    },
    {
        " to ": null
    },
    {
        "ionize": "ionization"
    },
    {
        " the sample. It atomizes the sample and creates atomic and small polyatomic ": null
    },
    {
        "ions": "ions"
    },
    {
        ", which are then detected. It is known and used for its ability to detect ": null
    },
    {
        "metals": "metals"
    },
    {
        " and several ": null
    },
    {
        "non-metals": "non-metals"
    },
    {
        " in liquid samples at very low concentrations. It can detect different ": null
    },
    {
        "isotope": "isotope"
    },
    {
        "s of the same element, which makes it a versatile tool in ": null
    },
    {
        "Isotopic labeling": "isotopic labeling"
    },
    {
        ".     Compared to ": null
    },
    {
        "atomic absorption spectroscopy": "atomic absorption spectroscopy"
    },
    {
        ", ICP-MS has greater speed, precision, and sensitivity. However, compared with other types of mass spectrometry, such as ": null
    },
    {
        "thermal ionization mass spectrometry": "thermal ionization mass spectrometry"
    },
    {
        " and ": null
    },
    {
        "glow discharge": "glow discharge"
    },
    {
        " mass spectrometry , ICP-MS introduces many interfering species: argon from the plasma, component gases of air that leak through the cone orifices, and contamination from glassware and the cones.     Due to possible applications in nuclear technologies, ICP-MS hardware is a subject for special ": null
    },
    {
        "export": "export"
    },
    {
        "ing regulations.              An ": null
    },
    {
        "inductively coupled plasma": "inductively coupled plasma"
    },
    {
        " is a ": null
    },
    {
        "plasma": "plasma"
    },
    {
        " that is energized  by ": null
    },
    {
        "inductively heating": "induction heating"
    },
    {
        " the gas with an ": null
    },
    {
        "electromagnetic coil": "electromagnetic coil"
    },
    {
        ", and contains a sufficient concentration of ": null
    },
    {
        "ion": "ion"
    },
    {
        "s and ": null
    },
    {
        "electron": "electron"
    },
    {
        "s to make the gas ": null
    },
    {
        "electrically conductive": "electrically conductive"
    },
    {
        ". Even a partially ionized gas in which as little as 42% of the particles are ionized can have the characteristics of a plasma . The plasmas used in spectrochemical analysis are essentially electrically neutral, with each positive charge on an ion balanced by a free electron. In these plasmas the positive ions are almost all singly charged and there are few negative ions, so there are nearly equal amounts of ions and electrons in each unit volume of plasma.     What makes Inductively Coupled Plasma Mass Spectrometry unique to other forms of inorganic mass spectrometry is its ability to sample the analyte continuously, without interruption. This is in contrast to other forms of inorganic mass spectrometry; ": null
    },
    {
        "Glow Discharge Mass Spectrometry": "glow_dischargeuse_in_analytical_chemistry"
    },
    {
        " and ": null
    },
    {
        "Thermal Ionization Mass Spectrometry": "thermal ionization mass spectrometry"
    },
    {
        " , that require a two stage process: Insert sample into a vacuum chamber, seal the vacuum chamber, pump down the vacuum, energize sample, thereby sending ions into the mass analyzer. With ICP-MS the sample to be analyzed is sitting at atmospheric pressure. Through the effective use of differential pumping; multiple vacuum stages separate by differential apertures , the ions created in the argon plasma are, with the aid of various electrostatic focusing techniques, transmitted through the mass analyzer to the detector and counted. Not only does this enable the analyst to radically increase sample throughput , but has also made it possible to do what is called time resolved acquisition . Hyphenated techniques like ": null
    },
    {
        "Liquid Chromatography": "liquid chromatography-mass spectrometry"
    },
    {
        " ICP-MS ; ": null
    },
    {
        "Laser Ablation": "laser ablation"
    },
    {
        " ICP-MS ; ": null
    },
    {
        "Flow Injection": "flow injection analysis"
    },
    {
        " ICP-MS , etc. have benefited from the unique quality of this technology, that is barely 42 years old. The power of time resolved analysis can not be overstated. It has stimulated the development new and exciting tools for research as varied as geochemistry and forensic chemistry; biochemistry and oceanography. Additionally, increases in sample throughput from dozens of samples a day to hundreds of samples a day has revolutionized environmental analysis, reducing costs. Fundamentally, this is all due to the fact that while the sample sits at environmental pressure, the analyzer and detector is at 42/42,42 of that same pressure during normal operation.     An inductively coupled plasma for spectrometry is sustained in a torch that consists of three concentric tubes, usually made of ": null
    },
    {
        "quartz": "quartz"
    },
    {
        ", although the inner tube can be sapphire if hydrofluoric acid is being used. The end of this torch is placed inside an induction coil supplied with a radio-frequency electric current. A flow of ": null
    },
    {
        "argon": "argon"
    },
    {
        " gas is introduced between the two outermost tubes of the torch and an ": null
    },
    {
        "electric spark": "electric spark"
    },
    {
        " is applied for a short time to introduce free electrons into the gas stream. These electrons interact with the radio-frequency magnetic field of the induction coil and are accelerated first in one direction, then the other, as the field changes at high frequency . The accelerated electrons collide with argon atoms, and sometimes a collision causes an argon atom to part with one of its electrons. The released electron is in turn accelerated by the rapidly changing magnetic field. The process continues until the rate of release of new electrons in collisions is balanced by the rate of recombination of electrons with argon ions . This produces a ‘fireball’ that consists mostly of argon atoms with a rather small fraction of free electrons and argon ions. The temperature of the plasma is very high, of the order of 42 K. The plasma also produces ultraviolet light, so for safety should not be viewed directly.     The ICP can be retained in the quartz torch because the flow of gas between the two outermost tubes keeps the plasma away from the walls of the torch. A second flow of argon is usually introduced between the central tube and the intermediate tube to keep the plasma away from the end of the central tube. A third flow of gas is introduced into the central tube of the torch. This gas flow passes through the centre of the plasma, where it forms a channel that is cooler than the surrounding plasma but still much hotter than a chemical flame. Samples to be analyzed are introduced into this central channel, usually as a mist of liquid formed by passing the liquid sample into a nebulizer.     To maximise plasma temperature and stability, the sample should be introduced through the central tube with as little liquid as possible, and with consistent droplet sizes. A nebuliser can be used for liquid samples, followed by a spray chamber to remove larger droplets, or a desolvating nebuliser can be used to evaporate most of the solvent before it reaches the torch. Solid samples can also be introduced using laser ablation. The sample enters the central channel of the ICP, evaporates, molecules break apart, and then the constituent atoms ionise. At the temperatures prevailing in the plasma a significant proportion of the atoms of many chemical elements are ionized, each atom losing its most loosely bound electron to form a singly charged ion. The plasma temperature is selected to maximise ionisation efficiency for elements with a high first ionisation energy, while minimising second ionisation for elements that have a low second ionisation energy.          For coupling to ": null
    },
    {
        "mass spectrometry": "mass spectrometry"
    },
    {
        ", the ions from the plasma are extracted through a series of cones into a mass spectrometer, usually a ": null
    },
    {
        "quadrupole": "quadrupole mass analyzer"
    },
    {
        ". The ions are separated on the basis of their mass-to-charge ratio and a detector receives an ion signal ": null
    },
    {
        "proportional": "proportionality"
    },
    {
        " to the concentration.     The concentration of a sample can be determined through calibration with ": null
    },
    {
        "certified reference material": "certified reference material"
    },
    {
        " such as single or multi-element reference standards. ICP-MS also lends itself to quantitative determinations through ": null
    },
    {
        "isotope dilution": "isotopic dilution"
    },
    {
        ", a single point method based on an isotopically enriched standard.     Other mass analyzers coupled to ICP systems include double focusing magnetic-electrostatic sector systems with both single and multiple collector, as well as ": null
    },
    {
        "time of flight": "time-of-flight mass spectrometry"
    },
    {
        " systems .       One of the largest volume uses for ICP-MS is in the medical and forensic field, specifically, toxicology. A physician may order a metal assay for a number of reasons, such as suspicion of heavy metal poisoning, metabolic concerns, and even hepatological issues. Depending on the specific parameters unique to each patients diagnostic plan, samples collected for analysis can range from whole blood, urine, plasma, serum, to even packed red blood cells. Another primary use for this instrument lies in the environmental field. Such applications include water testing for municipalities or private individuals all the way to soil, water and other material analysis for industrial purposes. In the forensic field, glass ICP-MS is popular for glass analysis. Trace elements on glass can be detected using the LA-ICP-MS. The trace elements from the glass can be used to match a sample found at the crime scene to a suspect.     In recent years, industrial and biological monitoring has presented another major need for metal analysis via ICP-MS. Individuals working in factories where exposure to metals is likely and unavoidable, such as a battery factory, are required by their employer to have their blood or urine analyzed for metal toxicity on a regular basis. This monitoring has become a mandatory practice implemented by ": null
    },
    {
        "OSHA": "occupational safety and health administration"
    },
    {
        ", in an effort to protect workers from their work environment and ensure proper rotation of work duties .     Regardless of the sample type, blood, water, etc., it is important that it be free of clots or other particulate matter, as the smallest clot can disrupt sample flow and block or clog the sample tips within the spray chamber. Very high concentrations of salts can eventually lead to blockages as some of the ions reunite after leaving the torch and build up around the orifice of the skimmer cone. This can be avoided by diluting samples whenever high salt concentrations are suspected, though at a cost to detection limits.     ICP-MS is also used widely in the geochemistry field for radiometric dating, in which it is used to analyze relative abundance of different isotopes, in particular uranium and lead. ICP-MS is more suitable for this application than the previously used ": null
    },
    {
        "thermal ionization mass spectrometry": "thermal ionization mass spectrometry"
    },
    {
        ", as species with high ": null
    },
    {
        "ionization energy": "ionization energy"
    },
    {
        " such as ": null
    },
    {
        "osmium": "osmium"
    },
    {
        " and ": null
    },
    {
        "tungsten": "tungsten"
    },
    {
        " can be easily ionized. For high precision ratio work, multiple collector instruments are normally used to reduce the effect noise on the calculated ratios.     In the field of ": null
    },
    {
        "flow cytometry": "flow cytometry"
    },
    {
        ", a new technique uses ICP-MS to replace the traditional ": null
    },
    {
        "fluorochromes": "fluorochromes"
    },
    {
        ". Briefly, instead of labelling ": null
    },
    {
        "antibodies": "antibodies"
    },
    {
        " with fluorochromes, each antibody is labelled with a distinct combinations of ": null
    },
    {
        "lanthanides": "lanthanides"
    },
    {
        ". When the sample of interest is analysed by ICP-MS in a specialised flow cytometer, each antibody can be identified and quantitated by virtue of a distinct ICP footprint . In theory, hundreds of different biological probes can thus be analysed in an individual cell, at a rate of ca. 42 cells per second. Because elements are easily distinguished in ICP-MS, the problem of compensation in multiplex flow cytometry is effectively eliminated.     In the pharmaceutical industry, ICP-MS is used for detecting inorganic impurities in ": null
    },
    {
        "pharmaceuticals": "pharmaceuticals"
    },
    {
        " and their ingredients. New and reduced maximum permitted exposure levels of heavy metals form dietary supplements, introduced in USP  Elemental Impurities—Limits  and USP Elemental Impurities—Procedures,  will increase the need for ICP-MS technology, where, previously, other analytic methods have been sufficient.   Laser ablation inductively coupled plasma mass spectrometry is a powerful technique for the elemental analysis of a wide variety of materials encountered in forensic casework. has already successfully been applied to applications in forensics, metals, glasses, soils, car paints, bones and teeth, printing inks, trace elemental, fingerprint, and Paper. Among these, forensic glass analysis stands out as an application for which this technique has great utility to provide highly.   Car hit and runs, burglaries, assaults, drive-by shootings and bombings such as these situations may cause glass fragments that could be used as evidence of association in glass transfer conditions. LA-ICP-MS is considered one of the best techniques for analysis of glass due to the short time for sample preparation and sample, small sample size of less than 42 nanograms. In addition there is no need for complex procedure and handling of dangerous materials that is used for digestion of the samples. This allows detecting major, minor and tracing elements with high level of precision and accuracy. There are set of properties that are used to measure glass sample such as physical and optical properties including color, thickness, density, refractive index and also, if necessary, elemental analysis can be conducted in order to enhance the value of an association. Tatiana. T, Waleska. C; Jose. R. : Elemental Analysis of Glass and Paint Materials by Laser Ablation Inductively Coupled Plasma Mass Spectrometry for Forensic Application, 42   Cosmetics, such as lipstick, recovered from a crime scene may provide valuable forensic information. Lipstick smears left on cigarette butts, glassware, clothing, bedding; napkins, paper, etc. may be valuable evidence. Lipstick recovered from clothing or skin may also indicate physical contact between individuals. Forensic analysis of recovered lipstick smear evidence can provide valuable information on the recent activities of a victim or suspect. Trace elemental analysis of lipstick smears could be used to complement existing visual comparative procedures to determine the lipstick brand and color.     Previous forensic techniques employed for the organic analysis of lipsticks by compositional comparison include thin layer chromatography , gas chromatography , and high-performance liquid chromatography . These methods provide useful information regarding the identification of lipsticks. However, they all require long sample preparation times and destroy the sample. Nondestructive techniques for the forensic analysis of lipstick smears include UV fluorescence observation combined with purge-and-trap gas chromatography, microspectrophotometry and scanning electron microscopy-energy dispersive spectroscopy , and Raman spectroscopy. Berry, Jonna Elizabeth . Trace metal analysis by laser ablation inductively coupled plasma-mass spectrometry and x-ray K-edge densitometry of forensic samples.Graduate Theses and Dissertations. Paper 42       A growing trend in the world of elemental analysis has revolved around the ": null
    },
    {
        "speciation": "ion speciation"
    },
    {
        ", or determination of ": null
    },
    {
        "oxidation state": "oxidation state"
    },
    {
        " of certain metals such as ": null
    },
    {
        "chromium": "chromium"
    },
    {
        " and ": null
    },
    {
        "arsenic": "arsenic"
    },
    {
        ". One of the primary techniques to achieve this is to separate the chemical species with ": null
    },
    {
        "high-performance liquid chromatography": "high-performance liquid chromatography"
    },
    {
        " or ": null
    },
    {
        "field flow fractionation": "field flow fractionation"
    },
    {
        " and then measure the concentrations with ICP-MS.       There is an increasing trend of using ICP-MS as a tool in speciation analysis, which normally involves a front end ": null
    },
    {
        "chromatograph": "chromatograph"
    },
    {
        " separation and an ": null
    },
    {
        "elemental selective detector": "elemental selective detector"
    },
    {
        ", such as AAS and ICP-MS. For example, ICP-MS may be combined with ": null
    },
    {
        "size exclusion chromatography": "size exclusion chromatography"
    },
    {
        " and quantitative preparative native continuous polyacrylamide gel electrophoresis  for identifying and quantifying native ": null
    },
    {
        "metal cofactor containing proteins": "metalloprotein"
    },
    {
        " in biofluids. Also the phosphorylation status of proteins can be analyzed.     In 42 a new type of protein tagging reagents called ": null
    },
    {
        "metal-coded affinity tag": "metal-coded affinity tag"
    },
    {
        "s were introduced to label proteins quantitatively with metals, especially lanthanides.  The MeCAT labelling allows relative and absolute quantification of all kind of proteins or other biomolecules like peptides. MeCAT comprises a site-specific biomolecule tagging group with at least a strong chelate group which binds metals. The MeCAT labelled proteins can be accurately quantified by ICP-MS down to low attomol amount of analyte which is at least 42–42 orders of magnitude more sensitive than other mass spectrometry based quantification methods. By introducing several MeCAT labels to a biomolecule and further optimization of LC-ICP-MS detection limits in the ": null
    },
    {
        "zeptomol": "zepto-"
    },
    {
        " range are within the realm of possibility. By using different lanthanides MeCAT multiplexing can be used for ": null
    },
    {
        "pharmacokinetics": "pharmacokinetics"
    },
    {
        " of proteins and peptides or the analysis of the differential expression of proteins  e.g. in biological fluids. Breakable PAGE ": null
    },
    {
        "SDS-PAGE": "sds-page"
    },
    {
        " , ": null
    },
    {
        "two-dimensional gel electrophoresis": "two-dimensional gel electrophoresis"
    },
    {
        " or ": null
    },
    {
        "chromatography": "chromatography"
    },
    {
        " is used for separation of MeCAT labelled proteins. Flow-injection ICP-MS analysis of protein bands or spots from DPAGE SDS-PAGE gels can be easily performed by dissolving the DPAGE gel after electrophoresis and staining of the gel. MeCAT labelled proteins are identified and relatively quantified on peptide level by MALDI-MS or ESI-MS.       The ICP-MS allows determination of ": null
    },
    {
        "elements": "chemical element"
    },
    {
        " with atomic mass ranges 42 to 42 , and sometimes higher. Some masses are prohibited such as 42 due to the abundance of argon in the sample. Other blocked regions may include mass 42 , and mass 42 , the latter of which greatly hinders ": null
    },
    {
        "Fe": "iron"
    },
    {
        " analysis unless the instrumentation is fitted with a reaction chamber. Such interferences can be reduced by using a high resolution ICP-MS which uses two or more slits to constrict the beam and distinguish between nearby peaks. This comes at the cost of sensitivity. For example, distinguishing iron from argon requires a resolving power of about 42, which may reduce the iron sensitivity by around 42%.     A single collector ICP-MS may use a multiplier in pulse counting mode to amplify very low signals, an attenuation grid or a multiplier in analogue mode to detect medium signals, and a Faraday cup/bucket to detect larger signals. A multi-collector ICP-MS may have more than one of any of these, normally Faraday buckets which are much less expensive. With this combination, a dynamic range of 42 orders of magnitude, from 42 ppq to 42 ppm is possible.     ICP-MS is a method of choice for the determination of ": null
    },
    {
        "cadmium": "cadmium"
    },
    {
        " in biological samples.      Unlike ": null
    },
    {
        "atomic absorption spectroscopy": "atomic absorption spectroscopy"
    },
    {
        ", which can only measure a single element at a time, ICP-MS has the capability to scan for all elements simultaneously. This allows rapid sample processing. A simultaneous ICP-MS that can record the entire analytical spectrum from lithium to uranium in every analysis won the Silver Award at the 42 ": null
    },
    {
        "Pittcon Editors Awards": "pittcon editors awards"
    },
    {
        ". An ICP-MS may use multiple scan modes, each one striking a different balance between speed and precision. Using the magnet alone to scan is slow, due to hysteresis, but is precise. Electrostatic plates can be used in addition to the magnet to increase the speed, and this, combined with multiple collectors, can allow a scan of every element from Lithium 42 to Uranium Oxide 42 in less than a quarter of a second. For low detection limits, interfering species and high precision, the counting time can increase substantially. The rapid scanning, large dynamic range and large mass range is ideally suited to measuring multiple unknown concentrations and isotope ratios in samples that have had minimal preparation , for example seawater, urine, and digested whole rock samples. It also lends well to laser ablated rock samples, where the scanning rate is so quick that a real time plot of any number of isotopes is possible. This also allows easy spatial mapping of mineral grains.       ": null
    },
    {
        "In terms of input and output": "black box"
    },
    {
        ", ICP-MS instrument consumes prepared sample material and translates it into mass-spectral data. Actual analytical procedure takes some time; after that time the instrument can be switched to work on the next sample. Series of such sample measurements requires the instrument to have plasma ignited, meanwhile a number of technical parameters has to be stable in order for the results obtained to have feasibly accurate and precise interpretation. Maintaining the plasma requires a constant supply of carrier gas and increased power consumption of the instrument. When these additional running costs are not considered justified, plasma and most of auxiliary systems can be turned off. In such standby mode only pumps are working to keep proper vacuum in mass-spectrometer.     The constituents of ICP-MS instrument are designed to allow for reproducible and/or stable operation.       The first step in analysis is the introduction of the sample. This has been achieved in ICP-MS through a variety of means.     The most common method is the use of  analytical nebulizers . Nebulizer converts liquids into an aerosol, and that aerosol can then be swept into the plasma to create the ions. Nebulizers work best with simple liquid samples . However, there have been instances of their use with more complex materials like a ": null
    },
    {
        "slurry": "slurry"
    },
    {
        ". Many varieties of nebulizers have been coupled to ICP-MS, including pneumatic, cross-flow, Babington, ultrasonic, and desolvating types. The aerosol generated is often treated to limit it to only smallest droplets, commonly by means of a Peltier cooled double pass or cyclonic spray chamber. Use of autosamplers makes this easier and faster, especially for routine work and large numbers of samples. A Desolvating Nebuliser may also be used; this uses a long heated capillary, coated with a fluoropolymer membrane, to remove most of the solvent and reduce the load on the plasma. Matrix removal introduction systems are sometimes used for samples, such as seawater, where the species of interest are at trace levels, and are surrounded by much more abundant contaminants.     ": null
    },
    {
        "Laser ablation": "laser ablation"
    },
    {
        " is another method. While being less common in the past, is rapidly becoming popular has been used as a means of sample introduction, thanks to increased ICP-MS scanning speeds. In this method, a pulsed UV laser is focused on the sample and creates a plume of ablated material which can be swept into the plasma. This allows geochemists to spacially map the isotope composition in cross-sections of rock samples, a tool which is lost if the rock is digested and introduced as a liquid sample. Lasers for this task are built to have highly controllable power outputs and uniform radial power distributions, to produce craters which are flat bottomed and of a chosen diameter and depth.     For both Laser Ablation and Desolvating Nebulisers, a small flow of Nitrogen may also be introduced into the Argon flow. Nitrogen exists as a dimer, so has more vibrational modes and is more efficient at receiving energy from the RF coil around the torch.     Other methods of sample introduction are also utilized. Electrothermal vaporization and in torch vaporization use hot surfaces to vaporize samples for introduction. These can use very small amounts of liquids, solids, or slurries. Other methods like vapor generation are also known.            The plasma used in an ICP-MS is made by partially ionizing argon gas . The energy required for this reaction is obtained by pulsing an alternating electric current in wires that surround the argon gas.     After the sample is injected, the plasmas extreme temperature causes the sample to separate into individual atoms . Next, the plasma ionizes these atoms so that they can be detected by the mass spectrometer.     An inductively coupled plasma for spectrometry is sustained in a torch that consists of three concentric tubes, usually made of quartz. The two major designs are the Fassel and Greenfield torches.  The end of this torch is placed inside an induction coil supplied with a radio-frequency electric current. A flow of argon gas is introduced between the two outermost tubes of the torch and an electrical spark is applied for a short time to introduce free electrons into the gas stream. These electrons interact with the radio-frequency magnetic field of the induction coil and are accelerated first in one direction, then the other, as the field changes at high frequency . The accelerated electrons collide with argon atoms, and sometimes a collision causes an argon atom to part with one of its electrons. The released electron is in turn accelerated by the rapidly changing magnetic field. The process continues until the rate of release of new electrons in collisions is balanced by the rate of recombination of electrons with argon ions . This produces a ‘fireball’ that consists mostly of argon atoms with a rather small fraction of free electrons and argon ions.       Making the plasma from argon, instead of other gases, has several advantages. First, argon is abundant  and therefore cheaper than other ": null
    },
    {
        "noble gases": "noble gases"
    },
    {
        ". Argon also has a higher first ": null
    },
    {
        "ionization potential": "ionization energy"
    },
    {
        " than all other elements except ": null
    },
    {
        "He": "helium"
    },
    {
        ", ": null
    },
    {
        "F": "fluorine"
    },
    {
        ", and ": null
    },
    {
        "Ne": "neon"
    },
    {
        ". Because of this high ionization energy, the reaction is more energetically favorable than the reaction . This ensures that the sample remains ionized so that the mass spectrometer can detect it.     Argon can be purchased for use with the ICP-MS in either a refrigerated liquid or a gas form. However it is important to note that whichever form of argon purchased, it should have a guaranteed purity of 42% Argon at a minimum. It is important to determine which type of argon will be best suited for the specific situation. Liquid argon is typically cheaper and can be stored in a greater quantity as opposed to the gas form, which is more expensive and takes up more tank space. If the instrument is in an environment where it gets infrequent use, then buying argon in the gas state will be most appropriate as it will be more than enough to suit smaller run times and gas in the cylinder will remain stable for longer periods of time, whereas liquid argon will suffer loss to the environment due to venting of the tank when stored over extended time frames. However, if the ICP-MS is to be used routinely and is on and running for eight or more hours each day for several days a week, then going with liquid argon will be the most suitable. If there are to be multiple ICP-MS instruments running for long periods of time, then it will most likely be beneficial for the laboratory to install a bulk or micro bulk argon tank which will be maintained by a gas supply company, thus eliminating the need to change out tanks frequently as well as minimizing loss of argon that is left over in each used tank as well as down time for tank changeover.     ": null
    },
    {
        "Helium": "helium"
    },
    {
        " can be used either in place of, or mixed with, argon for plasma generation.   Heliums higher first ionisation energy allows greater ionisation and therefore higher sensitivity for hard-to-ionise elements. The use of pure helium also avoids argon-based intereferences such as ArO.  However, many of the interferences can be mitigated by use of a ": null
    },
    {
        "collision cell": "collision cell"
    },
    {
        ", and the greater cost of helium has prevented its use in commercial ICP-MS.        The carrier gas is sent through the central channel and into the very hot plasma. The sample is then exposed to ": null
    },
    {
        "radio frequency": "radio frequency"
    },
    {
        " which converts the gas into a ": null
    },
    {
        "plasma": "plasma"
    },
    {
        ". The high temperature of the plasma is sufficient to cause a very large portion of the sample to form ions. This fraction of ionization can approach 42% for some elements , but this is dependent on the ionization potential. A fraction of the formed ions passes through a ~42  mm hole and then a ~42  mm hole . The purpose of which is to allow a ": null
    },
    {
        "vacuum": "vacuum"
    },
    {
        " that is required by the ": null
    },
    {
        "mass spectrometer": "mass spectrometer"
    },
    {
        ".     The vacuum is created and maintained by a series of pumps. The first stage is usually based on a roughing pump, most commonly a standard rotary vane pump. This removes most of the gas and typically reaches a pressure of around 42 Pa. Later stages have their vacuum generated by more powerful vacuum systems, most often turbomolecular pumps. Older instruments may have used oil diffusion pumps for high vacuum regions.         Before mass separation, a beam of positive ions has to be extracted from the plasma and focused into the mass-analyzer. It is important to separate the ions from UV photons, energetic neutrals and from any solid particles that may have been carried into the instrument from the ICP. Traditionally, ICP-MS instruments have used transmitting ion lens arrangements for this purpose. Examples include the Einzel lens, the Barrel lens, Agilents Omega Lens Kenichi Sakata et al., Inductively coupled plasma mass spectrometer and method, US patent 42 B42 and Perkin-Elmers Shadow Stop. Scott D. Tanner et al., Device and method preventing ion source gases from entering reaction cell, US patent 42 B42 Another approach is to use ion guides to guide the ions into mass analyzer along a path away from the trajectory of photons or neutral particles. Yet another approach is ": null
    },
    {
        "Varian": "varian, inc."
    },
    {
        " patented used by ": null
    },
    {
        "Analytik Jena": "analytik jena"
    },
    {
        " ICP-MS Iouri Kalinitchenko Ion Optical System for a Mass Spectrometer, United States Patent Number 42,42 B42 . 42 degrees reflecting parabolic Ion Mirror optics, which are claimed to provide more efficient ion transport into the mass-analyzer, resulting in better sensitivity and reduced background. Analytik Jena ICP-MS PQMS is the most sensitive instrument on the market. Shane Elliott, Michael Knowles, and Iouri Kalinitchenko, A Change in Direction in ICP-MS, published in Mar 42 in American Laboratory,    Shane Elliott, Barry Sturman, Stephen Anderson, Elke Brouwers, Jos Beijnen, ICP-MS: When Sensitivity Does Matter, Spectroscopy Magazine, April 42 42          A sector ICP-MS will commonly have four sections: an extraction acceleration region, steering lenses, an electrostatic sector and a magnetic sector. The first region takes ions from the plasma and accelerates them using a high voltage. The second uses may use a combination of parallel plates, rings, quadrupoles, hexapoles and octopoles to steer, shape and focus the beam so that the resulting peaks are symmetrical, flat topped and have high transmission. The electrostatic sector may be before or after the magnetic sector depending on the particular instrument, and reduces the spread in kinetic energy caused by the plasma. This spread is particularly large for ICP-MS, being larger than Glow Discharge and much larger than TIMS. The geometry of the instrument is chosen so that the instrument the combined focal point of the electrostatic and magnetic sectors is at the collector, known as Double Focussing .     If the mass of interest has a low sensitivity and is just below a much larger peak, the low mass tail from this larger peak can intrude onto the mass of interest. A Retardation Filter might be used to reduce this tail. This sits near the collector, and applies a voltage equal but opposite to the accelerating voltage; any ions that have lost energy while flying around the instrument will be decelerated to rest by the filter.          The collision/reaction cell is used to remove interfering ions through ion/neutral reactions.  Collision/reaction cells are known under several names. The dynamic reaction cell is located before the ": null
    },
    {
        "quadrupole": "quadrupole"
    },
    {
        " in the ICP-MS device.     The chamber has a quadrupole and can be filled with reaction gases , with one gas type at a time or a mixture of two of them, which reacts with the introduced sample, eliminating some of the interference.     The integrated Collisional Reaction Cell used by Analytik Jena ICP-MS is a mini-collision cell installed in front of the parabolic ion mirror optics that removes interfering ions by injecting a collisional gas , or a reactive gas , or a mixture of the two, directly into the plasma as it flows through the skimmer cone and/or the sampler cone. I. Kalinitchenko, Patent WO 42/42 A42  The iCRC removed interfering ions using a collisional kinetic energy discrimination phenomenon and chemical reactions with interfering ions similarly to traditionally used larger collision cells.       As with any piece of instrumentation or equipment, there are many aspects of maintenance that need to be encompassed by daily, weekly and annual procedures. The frequency of maintenance is typically determined by the sample volume and cumulative run time that the instrument is subjected to.     One of the first things that should be carried out before the calibration of the ICP-MS is a sensitivity check and optimization. This ensures that the operator is aware of any possible issues with the instrument and if so, may address them before beginning a calibration. Typical indicators of sensitivity are Rhodium levels, Cerium/Oxide ratios and DI water blanks.     One of the most frequent forms of ": null
    },
    {
        "routine maintenance": "planned maintenance"
    },
    {
        " is replacing sample and waste tubing on the peristaltic pump, as these tubes can get worn fairly quickly resulting in holes and clogs in the sample line, resulting in skewed results. Other parts that will need regular cleaning and/or replacing are sample tips, nebulizer tips, sample cones, skimmer cones, injector tubes, torches and lenses. It may also be necessary to change the oil in the interface roughing pump as well as the vacuum backing pump, depending on the workload put on the instrument.       For most clinical methods using ICP-MS, there is a relatively simple and quick sample prep process. The main component to the sample is an internal standard, which also serves as the diluent. This internal standard consists primarily of ": null
    },
    {
        "deionized water": "deionized water"
    }
]