[
    {
        "The  industrial archaeology of Dartmoor  covers a number of the industries which have, over the ages, taken place on Dartmoor, and the remaining evidence surrounding them. Currently only three industries are economically significant, yet all three will inevitably leave their own traces on the moor: china clay mining, farming and tourism.     A good general guide to the commercial activities on Dartmoor at the end of the 19th century is ": null
    },
    {
        "William Crossings": "william crossing"
    },
    {
        " The Dartmoor Worker.             In former times, lead, silver, tin and copper were mined extensively on Dartmoor. The most obvious evidence of mining to the casual visitor to Dartmoor are the remains of the old engine-house at ": null
    },
    {
        "Wheal Betsy": "wheal betsy"
    },
    {
        " which is alongside the ": null
    },
    {
        "A386 road": "a386 road"
    },
    {
        " between ": null
    },
    {
        "Tavistock": "tavistock, devon"
    },
    {
        " and ": null
    },
    {
        "Okehampton": "okehampton"
    },
    {
        ". The word Wheal has a particular meaning in ": null
    },
    {
        "Devon": "devon"
    },
    {
        " and ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        " being either a ": null
    },
    {
        "tin": "tin"
    },
    {
        " or a ": null
    },
    {
        "copper": "copper"
    },
    {
        " mine, however in the case of Wheal Betsy it was principally lead and silver which were mined.     Once widely practised by many miners across the moor, by the early 1900s only a few tinners remained, and mining had almost completely ceased twenty years later. Some of the more significant mines were ": null
    },
    {
        "Eylesbarrow": "eylesbarrow mine"
    },
    {
        ", ": null
    },
    {
        "Knock Mine": "knock mine"
    },
    {
        ", ": null
    },
    {
        "Vitifer Mine": "vitifer mine"
    },
    {
        " and ": null
    },
    {
        "Hexworthy Mine": "hexworthy mine"
    },
    {
        ". The last active mine in the Dartmoor area was ": null
    },
    {
        "Great Rock Mine": "great rock mine"
    },
    {
        ", which shut down in 1969.  . Dartmoor National Park Authority. Retrieved on 2007-06-15.            Dartmoor granite has been used in many Devon and Cornish buildings. The prison at ": null
    },
    {
        "Princetown": "princetown, england"
    },
    {
        " was built from granite taken from ": null
    },
    {
        "Walkhampton Common": "walkhampton common"
    },
    {
        ". When the horse tramroad from ": null
    },
    {
        "Plymouth": "plymouth"
    },
    {
        " to ": null
    },
    {
        "Princetown": "princetown, england"
    },
    {
        " was completed in 1823, large quantities of granite were more easily transported.     There were three major granite quarries on the moor: Haytor, Foggintor and Merrivale. The granite quarries around ": null
    },
    {
        "Haytor": "haytor"
    },
    {
        " were the source of the stone used in several famous structures, including the ": null
    },
    {
        "New London Bridge": "london bridgenew london bridge"
    },
    {
        ", completed in 1831. This granite was transported from the moor via the ": null
    },
    {
        "Haytor Granite Tramway": "haytor granite tramway"
    },
    {
        ", stretches of which are still visible.     The extensive quarries at Foggintor provided granite for the construction of Londons ": null
    },
    {
        "Nelsons Column": "nelsons column"
    },
    {
        " in the early 1840s, and ": null
    },
    {
        "New Scotland Yard": "new scotland yard"
    },
    {
        " was faced with granite from the quarry at Merrivale. Mercer 2009, pp.270–271 Merrivale Quarry continued excavating and working its own granite until the 1970s, producing gravestones and ": null
    },
    {
        "agricultural rollers": "roller"
    },
    {
        ". Work at Merrivale continued until the 1990s, for the last 20 years imported stone such as ": null
    },
    {
        "gabbro": "gabbro"
    },
    {
        " from Norway and Italian marble was dressed and polished. Mercer 2009, pp.271–272 The unusual pink granite at Great Trowlesworthy Tor was also quarried, and there were many other small granite quarries dotted around the moor. Various metamorphic rocks were also quarried in the ": null
    },
    {
        "metamorphic aureole": "metamorphic aureole"
    },
    {
        " around the edge of the moor, most notably at ": null
    },
    {
        "Meldon": "meldon quarry"
    },
    {
        ". Mercer 2009, p.273          In 1844 a factory for making gunpowder was built on the open moor, not far from ": null
    },
    {
        "Postbridge": "postbridge"
    },
    {
        ". Gunpowder was needed for the tin mines and granite quarries then in operation on the moor. The buildings were widely spaced from one another for safety and the mechanical power for grinding the powder was derived from waterwheels driven by a ": null
    },
    {
        "leat": "leat"
    },
    {
        ".     Now known as Powdermills or Powder Mills , there are extensive remains of this factory still visible. Two chimneys still stand and the walls of the two sturdily-built incorporating mills with central waterwheels survive well: they were built with substantial walls but flimsy roofs so that in the event of an explosion, the force of the blast would be directed safely upwards. The ruins of a number of ancillary buildings also survive. A proving ": null
    },
    {
        "mortar": "mortar"
    },
    {
        "—a type of small cannon used to gauge the strength of the gunpowder—used by the factory still lies by the side of the road to the nearby pottery.        Peat-cutting for fuel occurred at some locations on Dartmoor until certainly the 1970s, usually for personal use. The right of ": null
    },
    {
        "Dartmoor commoners": "dartmoor commoners"
    },
    {
        " to cut peat for fuel is known as turbary. These rights were conferred a long time ago, pre-dating most written records. The area once known as the Turbary of Alberysheved between the ": null
    },
    {
        "River Teign": "river teign"
    },
    {
        " and the headwaters of the ": null
    },
    {
        "River Bovey": "river bovey"
    },
    {
        " is mentioned in the Perambulation of the ": null
    },
    {
        "Forest of Dartmoor": "forest of dartmoor"
    },
    {
        " of 1240 .     An attempt was made to commercialise the cutting of peat in 1901 at ": null
    },
    {
        "Rattle Brook Head": "rattle brook head"
    },
    {
        ", however this quickly failed.       From at least the 13th century until early in the 20th, rabbits were kept on a commercial scale, both for their flesh and their fur. Documentary evidence for this exists in place names such as Trowlesworthy Warren and ": null
    },
    {
        "Warren House Inn": "warren house inn"
    },
    {
        ". The physical evidence, in the form of ": null
    },
    {
        "pillow mounds": "pillow mounds"
    },
    {
        " is also plentiful, for example there are 50 pillow mounds at Legis Tor Warren. Mercer 2009, pp.296–298 The sophistication of the warreners is shown by the existence of vermin traps that were placed near the warrens to capture weasels and stoats attempting to get at the rabbits.     The significance of the term  warren  nowadays is not what it once was. In the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " it was a privileged place, and the creatures of the warren were protected by the king for his princely delight and pleasure.     The subject of warrening on Dartmoor was addressed in ": null
    },
    {
        "Eden Phillpotts": "eden phillpotts"
    },
    {
        " story The River.       Farming has been practised on Dartmoor since time immemorial. The ": null
    },
    {
        "dry-stone wall": "dry-stone wall"
    }
]