[
    {
        "           An inflorescence is a group or cluster of ": null
    },
    {
        "flower": "flower"
    },
    {
        "s arranged on a ": null
    },
    {
        "stem": "plant stem"
    },
    {
        " that is composed of a main ": null
    },
    {
        "branch": "branch"
    },
    {
        " or a complicated arrangement of branches. ": null
    },
    {
        "Morphologically": "morphology"
    },
    {
        ", it is the modified part of the ": null
    },
    {
        "shoot": "shoot"
    },
    {
        " of ": null
    },
    {
        "seed plants": "spermatophytes"
    },
    {
        " where ": null
    },
    {
        "flower": "flower"
    },
    {
        "s are formed. The modifications can involve the length and the nature of the ": null
    },
    {
        "internode": "internode"
    },
    {
        "s and the ": null
    },
    {
        "phyllotaxis": "phyllotaxis"
    },
    {
        ", as well as variations in the proportions, compressions, swellings, ": null
    },
    {
        "adnation": "adnation"
    },
    {
        "s, ": null
    },
    {
        "connation": "connation"
    },
    {
        "s and reduction of main and secondary axes.   Inflorescence can also be defined as the reproductive portion of a plant that bears a cluster of flowers in a specific pattern.     The stem holding the whole inflorescence is called a ": null
    },
    {
        "peduncle": "peduncle"
    },
    {
        " and the major axis holding the flowers or more branches within the inflorescence is called the  rachis . The stalk of each single flower is called a ": null
    },
    {
        "pedicel": "pedicel"
    },
    {
        ". A flower that is not part of an inflorescence is called a solitary flower and its stalk is also referred to as a peduncle. Any flower in an inflorescence may be referred to as a floret, especially when the individual flowers are particularly small and borne in a tight cluster, such as in a ": null
    },
    {
        "pseudanthium": "pseudanthium"
    },
    {
        ".   The ": null
    },
    {
        "fruit": "fruit"
    },
    {
        "ing stage of an inflorescence is known as an ": null
    },
    {
        "infructescence": "infructescence"
    },
    {
        ".     Inflorescences may be simple or complex . The rachis may be one of several types, including single, composite, umbel, spike or ": null
    },
    {
        "raceme": "raceme"
    },
    {
        ".       Inflorescences are described by many different characteristics including how the flowers are arranged on the peduncle, the blooming order of the flowers and how different clusters of flowers are grouped within it. These terms are general representations as plants in nature can have a combination of types.       Inflorescences usually have modified shoots foliage different from the ": null
    },
    {
        "vegetative": "vegetation"
    },
    {
        " part of the plant. Considering the broadest meaning of the term, any leaf associated with an inflorescence is called a  bract  . A bract is usually located at the node where the main stem of the inflorescence forms, joined to the main stem of the plant, but other bracts can exist within the inflorescence itself. They serve a variety of functions which include attracting pollinators and protecting young flowers. According to the presence or absence of bracts and their characteristics we can distinguish:   Ebracteate inflorescences: No bracts in the inflorescence.   Bracteate inflorescences: The bracts in the inflorescence are very specialised, sometimes reduced to small scales, divided or dissected.   Leafy inflorescences: Though often reduced in size, the bracts are unspecialised and look like the typical leaves of the plant, so that the term flowering stem is usually applied instead of inflorescence. This use is not technically correct, as, despite their normal appearance, these leaves are considered, in fact, bracts, so that leafy inflorescence is preferable.   Leafy-bracted inflorescences: Intermediate between bracteate and leafy inflorescence.     If many bracts are present and they are strictly connected to the stem, like in the family ": null
    },
    {
        "Asteraceae": "asteraceae"
    },
    {
        ", the bracts might collectively be called an involucre. If the inflorescence has a second unit of bracts further up the stem, they might be called an involucel.       Image:Brakteose beblätterung .svg|Ebracteate inflorescence.   Image:Wisteria sinensisPNPG.jpg|Ebracteate of  Wisteria sinensis    Image:Brakteose_beblätterung_42_.svg|Bracteate inflorescence.   Image:Pedicularis verticillata a42jpg|Bracteate inflorescence of  Pedicularis verticillata .   Image:Frondobrakteose Beblätterung .svg|Leafy-bracted inflorescence.   Image:Rhinanthus angustifolius.jpg|Leafy-bracted inflorescence of  Rhinanthus angustifolius .   Image:Frondose beblätterung .svg|Leafy inflorescence.   Image:Unknown plant 42 bgiu.jpg|Leafy inflorescence of  Aristolochia clematitis .         Plant organs can grow according to two different schemes, namely ": null
    },
    {
        "monopodial": "monopodial"
    },
    {
        " or  racemose  and ": null
    },
    {
        "sympodial": "sympodial"
    },
    {
        " or cymose. In inflorescences these two different growth patterns are called ": null
    },
    {
        "indeterminate": "indeterminate growth"
    },
    {
        " and determinate respectively, and indicate whether a terminal flower is formed and where flowering starts within the inflorescence.   Indeterminate inflorescence: ": null
    },
    {
        "Monopodial": "monopodial"
    },
    {
        " growth. The terminal bud keeps growing and forming lateral flowers. A terminal flower is never formed.   Determinate inflorescence: ": null
    },
    {
        "Sympodial": "sympodial"
    },
    {
        " growth. The terminal bud forms a terminal flower and then dies out. Other flowers then grow from lateral buds.     Indeterminate and determinate inflorescences are sometimes referred to as open and closed inflorescences respectively. The indeterminate patterning of flowers is derived from determinate flowers. It is suggested that indeterminate flowers have a common mechanism that prevents terminal flower growth. Based on phylogenetic analyses, this mechanism arose independently multiple times in different species.      In an indeterminate inflorescence there is no true terminal flower and the stem usually has a rudimentary end. In many cases the last true flower formed by the terminal bud  straightens up, appearing to be a terminal flower. Often a vestige of the terminal bud may be noticed higher on the stem.       Image:Offener_Blütenstand_.svg|Indeterminate inflorescence with a perfect acropetal maturation.   Image:Offener_Blütenstand__m_K.svg|Indeterminate inflorescence with an acropetal maturation and lateral flower buds.   Image:Pseudoterminalbluete .svg|Indeterminate inflorescence with the subterminal flower to simulate the terminal one       In determinate inflorescences the terminal flower is usually the first to mature , while the others tend to mature starting from the bottom of the stem. This pattern is called acropetal maturation. When flowers start to mature from the top of the stem, maturation is  basipetal , while when the central mature first, divergent.       Image:Akropetale Effloration .svg|Determinate inflorescence with acropetal maturation   Image:Basipetale effloration .svg|Determinate inflorescence with basipetal maturation   Image:Divergente effloration .svg|Determinate inflorescence with divergent maturation         As with ": null
    },
    {
        "leaves": "leaf"
    },
    {
        ", flowers can be arranged on the stem according to many different patterns. See ": null
    },
    {
        "Phyllotaxis": "phyllotaxis"
    },
    {
        " for in-depth descriptions       Image:Inflorescences Raceme Kwiatostan Grono.svg|Alternate flowers   Image:Traube dekussiert .svg|Opposite flowers     Similarly arrangement of leaf in bud is called Ptyxis.         When a single or a cluster of flower is located at the axil of a bract, the location of the bract in relation to the stem holding the flower is indicated by the use of different terms and may be a useful diagnostic indicator.     Typical placement of bracts include:   Some plants have bracts that subtend the inflorescence, where the flowers are on branched stalks; the bracts are not connected to the stalks holding the flowers, but are ": null
    },
    {
        "adnate": "adnation"
    },
    {
        " or attached to the main stem   Other plants have the bracts subtend the ": null
    },
    {
        "pedicel": "pedicel"
    },
    {
        " or peduncle of single flowers.     Metatopic placement of bracts include:   When the bract is attached to the stem holding the flower , it is said to be recaulescent; sometimes these bracts or bracteoles are highly modified and appear to be appendages of the flower calyx. Recaulescences is the fusion of the subtending leaf with the stem holding the bud or the bud itself, Kubitzki, Klaus, and Clemens Bayer. 42 Flowering plants, Dicotyledons: Malvales, Capparales, and non-betalain Caryophyllales. The Families and genera of vascular plants, 42 Berlin: Springer. p. 42 thus the leaf or bract is adnate to the stem of flower.   When the formation of the bud is shifted up the stem distinctly above the subtending leaf, it is described as concaulescent.     Image:Bluete und Tragblatt .svg|Flower and subtending bract   Image:Türkenbund dunkel.jpg| Lilium martagon    Image:Konkauleszenz .svg|Concaulescence   Image:Tomato scanned.jpg| Solanum lycopersicum    Image:Rekauleszenz .svg|Recaulescence   Image:Tilia cordata Owoce lipy 42jpg| Tilia cordata          There is no general consensus in defining the different inflorescences. The following is based on ": null
    },
    {
        "Focko Weberling": "focko weberling"
    },
    {
        "s Morphologie der Blüten und der Blütenstände . The main groups of inflorescences are distinguished by branching. Within these groups, the most important characteristics are the intersection of the axes and different variations of the model. They may contain many flowers  or a few . Inflorescences can be simple or compound.              Indeterminate simple inflorescences are generally called racemose . The main kind of racemose inflorescence is the raceme . Oxford English Dictionary. Raceme 42 Bot. A type of inflorescence in which the flowers are arranged on short, nearly equal, lateral pedicels, at equal distances along a single elongated axis The other kind of racemose inflorescences can all be derived from this one by dilation, compression, swelling or reduction of the different axes. Some passage forms between the obvious ones are commonly admitted.   A  raceme  is an unbranched, ": null
    },
    {
        "indeterminate": "indeterminate growth"
    },
    {
        " inflorescence with pedicellate flowers along the axis.   A  spike  is a type of raceme with flowers that do not have a pedicel.   A racemose  corymb  is an unbranched, indeterminate inflorescence that is flat-topped or convex due to their outer pedicels which are progressively longer than inner ones.   An  umbel  is a type of raceme with a short axis and multiple floral pedicels of equal length that appear to arise from a common point. It is characteristic of ": null
    },
    {
        "Umbelliferae": "umbelliferae"
    },
    {
        ".   A  spadix  is a spike of flowers densely arranged around it, enclosed or accompanied by a highly specialised bract called a  spathe . It is characteristic of the family ": null
    },
    {
        "Araceae": "araceae"
    },
    {
        ".   A  flower head  or capitulum is a very contracted raceme in which the single sessile flowers share are borne on an enlarged stem. It is characteristic of ": null
    },
    {
        "Dipsacaceae": "dipsacaceae"
    },
    {
        ".   A  catkin  or ament is a scaly, generally drooping spike or raceme. Cymose or other complex inflorescences that are superficially similar are also generally called thus.       Image:Traube .svg|": null
    },
    {
        "Raceme": "raceme"
    },
    {
        "   Image:Epilobe feuilles etroites 42jpg| Epilobium angustifolium    Image:Inflorescences Spike Kwiatostan Kłos.svg|Spike   Image:Plantagomedia.JPG| Plantago media    Image:Schirmtraube .svg| Racemose ": null
    },
    {
        "corymb": "corymb"
    },
    {
        "   Image:Schleifenblume42jpg| Iberis umbellata    Image:Inflorescences Umbel Kwiatostan Baldach.svg|": null
    },
    {
        "Umbel": "umbel"
    },
    {
        "   Image:Astrantia minor.jpg| Astrantia minor    Image:Kolben .svg|": null
    },
    {
        "Spadix": "spadix"
    },
    {
        "   Image:Arum maculatum.jpeg| Arum maculatum    Image:Koepfchen .svg|": null
    },
    {
        "Head": "pseudanthium"
    },
    {
        "   Image:Fleur 42 - VTdJ.JPG| Dipsacus fullonum    Image:Kaetzchen .svg|": null
    },
    {
        "Catkin": "catkin"
    },
    {
        "   Image:Alnus incana rugosa catkin.jpg| Alnus incana          Determinate simple inflorescences are generally called cymose. The main kind of cymose inflorescence is the cyme . Oxford English Dictionary. Cyme Bot. A species of inflorescence wherein the primary axis bears a single terminal flower which develops first, the system being continued by axes of secondary and higher orders which develop successively in like manner; a centrifugal or definite   inflorescence: opposed to ": null
    },
    {
        "Raceme": "raceme"
    },
    {
        ". Applied esp. to compound inflorescences of this type forming a more or less flat head. Cymes are further divided according to this scheme:   Only one secondary axis: monochasium helicoid cyme or bostryx drepanium scorpoid cyme cincinnus    The successive pedicels follow a zig-zag path on the same plane: rhipidium    Two secondary axes: dichasial cyme dichasium    Secondary axis monochasia: double scorpioid cyme or double helicoid cyme pleiochasium       Image:Doppelwickel .svg|Double cyme   Image:Doppelschraubel .svg|Double cyme   Image:Schroef .jpg|Bostryx   Image:Saint Johns wort flowers.jpg| Hypericum perforatum    Image:Sikkel .jpg|Drepanium   Image:Gladiolus imbricatus a42jpg| Gladiolus imbricatus    Image:Schicht.jpg|Cincinnus   Image:Symphytum officinale 42jpg| Symphytum officinale    Image:Waaier .jpg|Rhipidium   Image:Canna Endeavour 42jpg|  Canna sp.   Image:Dichasium .svg|Dichasium   Image:Dichasium .svg|Dichasium, top view   Image:424242Silene dioica42jpg| Silene dioica        A cyme can also be so compressed that it looks like an umbel. Strictly speaking this kind of inflorescence could be called umbelliform cyme, although it is normally called simply umbel.     Another kind of definite simple inflorescence is the raceme-like cyme or botryoid; that is as a raceme with a terminal flower and is usually improperly called raceme.       Image:Inflorescences Umbel Kwiatostan Baldach.svg|Umbelliform cyme   Image:Fiore di geranio.JPG| Pelargonium zonale    Image:Botryoid .svg|Botryoid   Image:Berberis vernae MS 42jpg|Berberis vernae       A reduced raceme or cyme that grows in the ": null
    },
    {
        "axil": "axil"
    },
    {
        " of a bract is called a fascicle. A verticillaster is a fascicle with the structure of a dichasium; it is common among the ": null
    },
    {
        "Lamiaceae": "lamiaceae"
    },
    {
        ". Many verticillasters with reduced bracts can form a spicate inflorescence that is commonly called a spike.       Image:Gentiana lutea42JPG| Gentiana lutea    Image:Lamium orvala42jpg| Lamium orvala    Image:Mentha longifolia 42.42 42.42jpg| Mentha longifolia          Simple inflorescences are the basis for compound inflorescences or synflorescences. The single flowers are there replaced by a simple inflorescence, which can be both a racemose or a cymose one. Compound inflorescences are composed of branched stems and can involve complicated arrangements that are difficult to trace back to the main branch.     A kind of compound inflorescence is the double inflorescence, in which the basic structure is repeated in the place of single florets. For example, a double raceme is a raceme in which the single flowers are replaced by other simple racemes; the same structure can be repeated to form triple or more complex structures.     Compound raceme inflorescences can either end with a final raceme , or not . A compound raceme is often called a panicle. Note that this definition is very different from that given by ": null
    },
    {
        "Weberling": "focko weberling"
    },
    {
        ".     Compound umbels are umbels in which the single flowers are replaced by many smaller umbels called umbellets. The stem attaching the side umbellets to the main stem is called a ray.       Image:Doppeltraube_.svg|Homeothetic compound raceme   Image:Melilotus officinalis42jpg| Melilotus officinalis    Image:Doppeltraube_42_.svg|Heterothetic compound raceme   Image:Hebe albicans.jpg| Hebe albicans    Image:Inflorescences Muktispike Kwiatostan KłosZłożony.svg|Compound spike   Image:Lolium multiflorum detail.jpeg| Lolium temulentum    Image:Doppelkoepfchen_.svg|Compound capitulum   Image:Echinops Ain France.jpg| Echinops ritro    Image:Inflorescences Umbel Kwiatostan BaldachZłożony.svg|Compound umbel   Image:Laserpitium latifolium42jpg| Laserpicium latifolium    Image:Dreifachdolde_.svg|Compound umbel       The most common kind of definite compound inflorescence is the panicle . A panicle is a definite inflorescence that is increasingly more strongly and irregularly branched from the top to the bottom and where each branching has a terminal flower.     The so-called cymose corymb is similar to a racemose corymb but has a panicle-like structure. Another type of panicle is the anthela. An anthela is a cymose corymb with the lateral flowers higher than the central ones.       Image:Inflorescences Panicle Kwiatostan Wiecha.svg|": null
    },
    {
        "Panicle": "panicle"
    },
    {
        "   Image:Vigne inflorescence 42jpg| Vitis vinifera    Image:Schirmrispe .svg|Cymose ": null
    },
    {
        "corymb": "corymb"
    },
    {
        "   Image:Sambucus nigra 42jpg| Sambucus nigra    Image:Spirre .svg|Anthela   Image:Juncus inflexus.jpeg| Juncus inflexus        A raceme in which the single flowers are replaced by cymes is called a thyrse. The secondary cymes can be of any of the different types of dichasia and monochasia. A botryoid in which the single flowers are replaced by cymes is a definite thyrse or thyrsoid. Thyrses are often confusingly called panicles.       Homöokladische Thyrse .svg|Thyrse   Aesculus hippocastanum flori.jpg| Aesculus hippocastanum    Dichasialer zymus .svg|Thyrsoid   Syringa42jpg| Syringa vulgaris        Other combinations are possible. For example, heads or umbels may be arranged in a corymb or a panicle.       Achillea - 42JPG| Achillea  sp.   Starr 4242 Hedera helix.jpg| Hedera helix          The family ": null
    },
    {
        "Asteraceae": "asteraceae"
    },
    {
        " is characterised by a highly specialised head technically called a  calathid  . The family ": null
    },
    {
        "Poaceae": "poaceae"
    },
    {
        " has a peculiar inflorescence of small spikes  organised in panicles or spikes that are usually simply and improperly referred to as spike and panicle. The genus  Ficus   has an inflorescence called  syconium  and the genus  Euphorbia  has  cyathia  , usually organised in umbels.       Chamomile@original size.jpg| Matricaria chamomilla    Wheat close-up.JPG| Triticum aestivum    Lemont rice.jpg| Oryza sativa    Some figs.jpg| Ficus carica    Euphorbia tridentata ies.jpg| Euphorbia tridentata    Euphorbia cyparissias 42 bgiu.jpg| Euphorbia cyparissias    Coleus inflorescence.JPG|               Genes that shape inflorescence development have been studied at great length in  Arabidopsis . LEAFY is a gene that promotes ": null
    },
    {
        "floral meristem": "meristem"
    },
    {
        " identity, regulating inflorescence development in Arabidopsis.  Any alterations in timing of LFY expression can cause formation of different inflorescences in the plant.  Genes similar in function to LFY include APETALA42 . Mutations in LFY, AP42 and similar promoting genes can cause conversion of flowers into shoots. In contrast to LEAFY, genes like terminal flower support the activity of an inhibitor that prevents flowers from growing on the inflorescence apex , maintaining inflorescence meristem identity.  Both types of genes help shape flower development in accordance with the ": null
    },
    {
        "ABC model of flower development": "abc model of flower development"
    },
    {
        ". Studies have been recently conducted or are ongoing for homologs of these genes in other flower species.       Inflorescence-feeding insect herbivores shape inflorescences by reducing lifetime fitness , seed production by the inflorescences, and plant density, among other traits.  In the absence of this herbivory, inflorescences usually produce more flower heads and seeds. Temperature can also variably shape inflorescence development. High temperatures can impair the proper development of flower buds or delay bud development in certain species, while in others, an increase in temperature can hasten inflorescence development.          The shift from the vegetative to reproductive phase of a flower involves the development of an inflorescence meristem that generates floral meristems.  Plant inflorescence architecture depends on which meristems becomes flowers and which become shoots.  Consequently, genes that regulate floral meristem identity play major roles in determining inflorescence architecture because their expression domain will direct where the plants flowers are formed.     On a larger scale, inflorescence architecture affects the quality and quantity of offspring from selfing and outcrossing, as the architecture can influence pollination success. For example,  Asclepias  inflorescences have been shown to have an upper size limit, shaped by self-pollination levels due to crosses between inflorescences on the same plant or between flowers on the same inflorescence.  In  Aesculus sylvatica , it has been shown that the most common inflorescence sizes are correlated with the highest fruit production as well.        Some species have flower and inflorescence intermediates. In these cases, some reproductive structures of certain flowers appear as transitional between inflorescences and flowers, making it difficult to accurately categorize and identify the structure as one or the other. For example, the genus Potamogeton of the family Potamogetonaceae are considered to have inflorescences that appear like an individual flower. ": null
    }
]