[
    {
        "A transaction is a change of state, an information-transfer transaction is a transaction in which one of the following changes occurs: content, ownership, location, format, etc. An information-transfer transaction usually consists of three consecutive phases called the ": null
    },
    {
        "access phase": "access phase"
    },
    {
        ", the ": null
    },
    {
        "information transfer": "information transfer"
    },
    {
        " phase, and the ": null
    },
    {
        "disengagement phase": "disengagement phase"
    },
    {
        ". Examples of these consecutive phases are the copying and transporting of information. Once a transaction occurs there are also costs to consider, which are associated with that certain transaction. When it comes to the transfer of information some ": null
    },
    {
        "transaction cost": "transaction cost"
    },
    {
        "s include time and means .       There are many social systems and devices that have contributed to information-transfer transactions; starting from people writing letters using postal systems to emailing using ": null
    },
    {
        "information technology": "information technology"
    },
    {
        ". Two main examples of information-transfer transactions technology development is the copying and transportation of information.          Copying is the process of duplicating information with the change of location or format of the original information. The transfer transaction of information through copying has been going on for ages and there has been many advances in technology to decrease the time it takes to make copies of said information. The art of copying started with people having to write a copy out by hand, then the ": null
    },
    {
        "printing press": "printing press"
    },
    {
        ", all the way to ": null
    },
    {
        "digital copying": "digital copying"
    },
    {
        " with ": null
    },
    {
        "ICTs": "icts"
    },
    {
        ". These developments lead to quicker information-transfer transactions in the form of distributing copies of original information to others through a changes of location or format.          Transporting is the movement of information with the change of location or ownership of the original information. The transfer transaction of information through transporting has been going on for ages and there has been social and technological developments to decrease the time it takes for information to change ownership or location. The transportation of information started with people sending letters by foot, then by horse, the public and international postal service, all the way down to technology networks. It is these developments which led to the ability to send information further and quicker through information-transfer transactions.          Every time a transaction occurs, there are always costs to be considered. In the case of information-transfer transactions, one most consider the costs of time and means . Both of these costs are corollated with one another in that to decrease one, you must increase the other. For example, say Person 42 sends a letter through the ": null
    },
    {
        "mail": "mail"
    },
    {
        ", while Person 42 sends letters through ": null
    },
    {
        "email": "email"
    },
    {
        ". For Person 42 to send their letter they had to buy paper, means of writing, envelopes, stamps, etc., while Person 42 needed to buy a source of electricity, internet, computer technology, etc. to send an email. It seems like Person 42 has lower transaction costs then Person 42 in terms of means; however, when you look at both information-transfer transactions in terms of time that is a different story. For Person 42 although they had little costs in sending their letter, the time it takes for the transfer of that letter is about 42+ days, while Person 42s transfer through email happens in less than minutes, but they endured high mean costs. Therefore, for information-transfer transaction times to decrease, the costs of means have to increase and vice versa.       In ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        ", an information-transfer transaction is a coordinated ": null
    },
    {
        "sequence": "sequence"
    },
    {
        " of ": null
    },
    {
        "user": "user"
    },
    {
        " and ": null
    },
    {
        "telecommunications system": "telecommunications system"
    },
    {
        " actions that cause ": null
    },
    {
        "information": "information"
    },
    {
        " present at a ": null
    },
    {
        "source user": "source user"
    }
]