[
    {
        "   The information industry or information industries are ": null
    },
    {
        "industries": "industry"
    },
    {
        " that are ": null
    },
    {
        "information": "information"
    },
    {
        " intensive in one way or the other. It is considered one of the most important ": null
    },
    {
        "economic sector": "economic sector"
    },
    {
        "s for a variety of reasons.     There are many different kinds of information industries, and many different ways to classify them. Although there is no standard or distinctively better way of organizing those different views, the following section offers a review of what the term information industry might entail, and why. Alternative conceptualizations are that of ": null
    },
    {
        "knowledge": "knowledge"
    },
    {
        " industry and information-related occupation. The term information industry is mostly identified with ": null
    },
    {
        "computer programming": "computer programming"
    },
    {
        ", system design, telecommunications, and others.         First, there are companies which produce and sell information in the form of goods or services. ": null
    },
    {
        "Media": "mass media"
    },
    {
        " products such as ": null
    },
    {
        "television": "television"
    },
    {
        " programs and ": null
    },
    {
        "movies": "movies"
    },
    {
        ", published books and periodicals would constitute probably among the most accepted part of what information goods can be. Some information is provided not as a tangible commodity but as a service. Consulting is among the least controversial of this kind. However, even for this category, disagreements can occur due to the vagueness of the term information. For some, information is knowledge about a subject, something one can use to improve the performance of other activities—it does not include arts and entertainments. For others, information is something that is mentally processed and consumed, either to improve other activities or for personal enjoyment; it would include artists and architects. For yet others, information may include anything that has to do with sensation, and therefore information industries may include even such things as restaurant, amusement parks, and prostitution to the extent that food, park ride, and sexual intercourse have to do with senses. In spite of the definitional problems, industries producing information goods and services are called information industries.         Second, there are ": null
    },
    {
        "information processing": "information processing"
    },
    {
        " services. Some services, such as ": null
    },
    {
        "legal": "legal"
    },
    {
        " services, ": null
    },
    {
        "banking": "banking"
    },
    {
        ", ": null
    },
    {
        "insurance": "insurance"
    },
    {
        ", ": null
    },
    {
        "computer programming": "computer programming"
    },
    {
        ", ": null
    },
    {
        "data processing": "data processing"
    },
    {
        ", testing, and market research, require intensive and intellectual processing of information. Although those services do not necessarily provide information, they often offer expertise in making decisions on behalf of clients. These kinds of service industries can be regarded as an information-intensive part of various industries that is externalized and specialized.         Third, there are industries that are vital to the dissemination of the information goods mentioned above. For example, ": null
    },
    {
        "telephone": "telephone"
    },
    {
        ", ": null
    },
    {
        "broadcasting": "broadcasting"
    },
    {
        " and book retail industries do not produce much information, but their core business is to disseminate information others produced. These industries handle predominantly information and can be distinguished from wholesale or retail industries in general. It is just a coincidence, one can argue, that some of those industries are separately existing from the more obvious information-producing industries. For example, in the United States, as well as some other countries, broadcasting stations produce very limited amount of programs they broadcast. But this is not the only possible form of division of labor. If legal, economic, ": null
    },
    {
        "cultural": "cultural"
    },
    {
        ", and ": null
    },
    {
        "historical": "historical"
    },
    {
        " circumstances were different, the broadcasters would have been the producers of their own programs. Therefore, in order to capture the information related activities of the economy, it might be a good idea to include this type of industry. These industries show how much of an economy is about information, as opposed to materials. It is useful to differentiate production of valuable information from processing that information in a sophisticated way, from the movement of information.         Fourth, there are manufacturers of information-processing devices that require research and sophisticated decision-making. These products are vital to information-processing activities of above mentioned industries. The products include computers of various levels and many other microelectronic devices, as well as software programs. Printing and copying machines, measurement and recording devices of various kinds, electronic or otherwise, are also in this category. The role of these tools are to automate certain information-processing activities. The use of some of these tools may be very simple , and the processing done by the tools may be very simple rather than intellectual and sophisticated. In other words, the specialization of these industries in an economy is neither production of information nor sophisticated decision-making. Instead, this segment serves as an infrastructure for those activities, making production of information and decision-making services will be a lot less efficient. In addition, these industries tend to be ": null
    },
    {
        "high-tech": "high-tech"
    },
    {
        " or research intensive - trying to find more efficient ways to boost efficiency of information production and sophisticated decision-making. For example, the function of a standard calculator is quite simple and it is easy to how to use it. However, manufacturing a well-functioning standard calculator takes a lot of processes, far more than the task of calculation performed by the users.         Fifth, there are very ": null
    },
    {
        "research-intensive": "research"
    },
    {
        " industries that do not serve as infrastructure to information-production or sophisticated decision-making. Pharmaceutical, food-processing, some apparel design, and some other high-tech industries belong to this type. These products are not exclusively for information production or sophisticated decision-making, although many are helpful. Some services, such as medical examination are in this category as well. One can say these industries involve a great deal of sophisticated decision-making, although that part is combined with manufacturing or non-informational activities.         Finally, there are industries that are not research intensive, but serve as ": null
    },
    {
        "infrastructure": "infrastructure"
    },
    {
        " for information production and sophisticated decision-making. Manufacturing of office furniture would be a good example, although it sometimes involves research in ergonomics and development of new materials.     As stated above, this list of candidates for information industries is not a definitive way of organizing differences that researchers may pay attention to when they define the term. Among the difficulties is, for example, the position of advertising industry.         Information industries are considered important for several reasons. Even among the experts who think industries are important, disagreements may exist regarding which reason to accept and which to reject.     First, information industries is a rapidly growing part of economy. The demand for information goods and services from consumers is increasing. In case of consumers, media including music and motion picture, personal computers, video game-related industries, are among the information industries. In case of businesses, information industries include computer programming, system design, so-called FIRE industries, telecommunications, and others. When demand for these industries are growing nationally or internationally, that creates an opportunity for an urban, regional, or national economy to grow rapidly by specializing on these sectors.     Second, information industries are considered to boost innovation and productivity of other industries. An economy with a strong information industry might be a more competitive one than others, other factors being equal.     Third, some believe that the effect of the changing economic structure is related to the broader social change. As information becomes the central part of our economic activities we evolve into an ": null
    },
    {
        "information society": "information society"
    }
]