[
    {
        "   Infrared spectroscopy  involves the interaction of ": null
    },
    {
        "infrared": "infrared"
    },
    {
        " radiation with ": null
    },
    {
        "matter": "matter"
    },
    {
        ". It covers a range of techniques, mostly based on ": null
    },
    {
        "absorption spectroscopy": "absorption spectroscopy"
    },
    {
        ". As with all spectroscopic techniques, it can be used to identify and study ": null
    },
    {
        "chemical substance": "chemical substance"
    },
    {
        "s. Samples may be solid, liquid, or gas. The method or technique of infrared spectroscopy is conducted with an instrument called an infrared spectrometer to produce an infrared spectrum. An IR spectrum can be visualized in a graph of infrared light ": null
    },
    {
        "absorbance": "absorbance"
    },
    {
        "  on the vertical axis vs. frequency or wavelength on the horizontal axis. Typical ": null
    },
    {
        "units": "units of measurement"
    },
    {
        "of frequency used in IR spectra are ": null
    },
    {
        "reciprocal centimeters": "reciprocal centimeters"
    },
    {
        " , with the symbol cm −1 . Units of IR wavelength are commonly given in ": null
    },
    {
        "micrometers": "micrometre"
    },
    {
        ", symbol μm, which are related to wave numbers in a ": null
    },
    {
        "reciprocal": "multiplicative inverse"
    },
    {
        " way. A common laboratory instrument that uses this technique is a ": null
    },
    {
        "Fourier transform infrared": "fourier transform infrared spectroscopy"
    },
    {
        " spectrometer": "spectrometer"
    },
    {
        ". Two-dimensional IR is also possible as discussed ": null
    },
    {
        "below": "infrared spectroscopytwo-dimensional ir"
    },
    {
        ".     The infrared portion of the ": null
    },
    {
        "electromagnetic spectrum": "electromagnetic spectrum"
    },
    {
        " is usually divided into three regions; the ": null
    },
    {
        "near-": "near-infrared spectroscopy"
    },
    {
        ", mid- and ": null
    },
    {
        "far-": "far infrared"
    },
    {
        " infrared, named for their relation to the visible spectrum. The higher-energy near-IR, approximately 14000–4000  cm −1 can excite ": null
    },
    {
        "overtone": "overtones"
    },
    {
        " or ": null
    },
    {
        "harmonic": "harmonic"
    },
    {
        " molecular vibration": "molecular vibration"
    },
    {
        "s. The mid-infrared, approximately 4000–400  cm −1 may be used to study the fundamental vibrations and associated ": null
    },
    {
        "rotational-vibrational": "rotational-vibrational spectroscopy"
    },
    {
        " structure. The far-infrared, approximately 400–10  cm −1 , lying adjacent to the ": null
    },
    {
        "microwave": "microwave"
    },
    {
        " region, has low energy and may be used for ": null
    },
    {
        "rotational spectroscopy": "rotational spectroscopy"
    },
    {
        ". The names and classifications of these subregions are conventions, and are only loosely based on the relative molecular or electromagnetic properties.          Infrared spectroscopy exploits the fact that molecules absorb frequencies that are characteristic of their ": null
    },
    {
        "structure": "chemical structure"
    },
    {
        ". These absorptions occur at ": null
    },
    {
        "resonant frequencies": "resonant frequency"
    },
    {
        ", i.e. the frequency of the absorbed radiation matches the vibrational frequency. The energies are affected by the shape of the molecular ": null
    },
    {
        "potential energy surface": "potential energy surface"
    },
    {
        "s, the masses of the atoms, and the associated ": null
    },
    {
        "vibronic coupling": "vibronic coupling"
    },
    {
        ".      In particular, in the ": null
    },
    {
        "Born–Oppenheimer": "born–oppenheimer approximation"
    },
    {
        " and harmonic approximations, i.e. when the ": null
    },
    {
        "molecular Hamiltonian": "molecular hamiltonian"
    },
    {
        " corresponding to the electronic ": null
    },
    {
        "ground state": "ground state"
    },
    {
        " can be approximated by a ": null
    },
    {
        "harmonic oscillator": "quantum harmonic oscillator"
    },
    {
        " in the neighborhood of the equilibrium ": null
    },
    {
        "molecular geometry": "molecular geometry"
    },
    {
        ", the resonant frequencies are associated with the ": null
    },
    {
        "normal modes": "normal modes"
    },
    {
        " corresponding to the molecular electronic ground state potential energy surface. The resonant frequencies are also related to the strength of the bond and the ": null
    },
    {
        "mass of the atoms": "atomic mass"
    },
    {
        " at either end of it. Thus, the frequency of the vibrations are associated with a particular normal mode of motion and a particular bond type.       In order for a vibrational mode in a sample to be IR active , it must be associated with changes in the dipole moment. A permanent dipole is not necessary, as the rule requires only a change in dipole moment.      A molecule can vibrate in many ways, and each way is called a vibrational mode. For molecules with N number of atoms, linear molecules have 3N  –  5 degrees of vibrational modes, whereas nonlinear molecules have 3N  –  6 degrees of vibrational modes . As an example ": null
    },
    {
        "H 2 O": "water"
    },
    {
        ", a non-linear molecule, will have 3  ×  3  –  6    3 degrees of vibrational freedom, or modes.     Simple ": null
    },
    {
        "diatomic molecules": "diatomic molecule"
    },
    {
        "have only one bond and only one vibrational band. If the molecule is symmetrical, e.g. N 2 , the band is not observed in the IR spectrum, but only in the ": null
    },
    {
        "Raman spectrum": "raman spectrum"
    },
    {
        ". Asymmetrical diatomic molecules, e.g. ": null
    },
    {
        "CO": "carbon monoxide"
    },
    {
        ", absorb in the IR spectrum. More complex molecules have many bonds, and their vibrational spectra are correspondingly more complex, i.e. big molecules have many peaks in their IR spectra.     The atoms in a CH 2 X 2 group, commonly found in ": null
    },
    {
        "organic compounds": "organic compound"
    },
    {
        "and where X can represent any other atom, can vibrate in nine different ways. Six of these vibrations involve only the ": null
    },
    {
        "CH 2 ": "methylene group"
    },
    {
        " portion: symmetric and antisymmetric stretching, scissoring, rocking, wagging and twisting, as shown below. Structures that do not have the two additional X groups attached have fewer modes because some modes are defined by specific relationships to those other attached groups. For example, in water, the rocking, wagging, and twisting modes do not exist because these types of motions of the H atoms represent simple rotation of the whole molecule rather than vibrations within it.               These figures do not represent the ": null
    },
    {
        "recoil": "recoil"
    },
    {
        " of the ": null
    },
    {
        "C": "carbon"
    },
    {
        " atoms, which, though necessarily present to balance the overall movements of the molecule, are much smaller than the movements of the lighter ": null
    },
    {
        "H": "hydrogen"
    },
    {
        " atoms.     The simplest and most important or fundamental IR bands arise from the excitations of normal modes, the simplest distortions of the molecule, from the ": null
    },
    {
        "ground state": "ground state"
    },
    {
        " with ": null
    },
    {
        "vibrational quantum number": "molecular vibrationquantum mechanics"
    },
    {
        " v 0 to the first ": null
    },
    {
        "excited state": "excited state"
    },
    {
        " with vibrational quantum number v 1. In some cases, ": null
    },
    {
        "overtone bands": "overtone band"
    },
    {
        "are observed. An overtone band arises from the absorption of a photon leading to a direct transition from the ground state to the second excited vibrational state . Such a band appears at approximately twice the energy of the fundamental band for the same normal mode. Some excitations, so-called combination modes, involve simultaneous excitation of more than one normal mode. The phenomenon of ": null
    },
    {
        "Fermi resonance": "fermi resonance"
    },
    {
        " can arise when two modes are similar in energy; Fermi resonance results in an unexpected shift in energy and intensity of the bands etc.       The infrared spectrum of a sample is recorded by passing a beam of infrared light through the sample. When the frequency of the IR is the same as the vibrational frequency of a bond or collection of bonds, absorption occurs. Examination of the transmitted light reveals how much energy was absorbed at each frequency . This measurement can be achieved by scanning the wavelength range using a ": null
    },
    {
        "monochromator": "monochromator"
    },
    {
        ". Alternatively, the entire wavelength range is measured using a ": null
    },
    {
        "Fourier transform": "fourier transform"
    },
    {
        " instrument and then a ": null
    },
    {
        "transmittance": "transmittance"
    },
    {
        " or ": null
    },
    {
        "absorbance": "absorbance"
    },
    {
        " spectrum is generated using a dedicated procedure.     This technique is commonly used for analyzing samples with ": null
    },
    {
        "covalent bond": "covalent bond"
    },
    {
        "s. Simple spectra are obtained from samples with few IR active bonds and high levels of purity. More complex molecular structures lead to more absorption bands and more complex spectra.            Gaseous samples require a sample cell with a long ": null
    },
    {
        "pathlength": "pathlength"
    },
    {
        " to compensate for the diluteness. The pathlength of the sample cell depends on the concentration of the compound of interest. A simple glass tube with length of 5 to 10  cm equipped with infrared-transparent windows at the both ends of the tube can be used for concentrations down to several hundred ppm. Sample gas concentrations well below ppm can be measured with a ": null
    },
    {
        "Whites cell": "white cell"
    },
    {
        " in which the infrared light is guided with mirrors to travel through the gas. Whites cells are available with optical pathlength starting from 0.5 m up to hundred meters.     Liquid samples can be sandwiched between two plates of a salt .    The plates are transparent to the infrared light and do not introduce any lines onto the spectra.     Solid samples can be prepared in a variety of ways. One common method is to crush the sample with an oily mulling agent . A thin film of the mull is applied onto salt plates and measured. The second method is to grind a quantity of the sample with a specially purified salt  finely . This powder mixture is then pressed in a mechanical ": null
    },
    {
        "press": "machine press"
    },
    {
        " to form a translucent pellet through which the beam of the spectrometer can pass. A third technique is the cast film technique, which is used mainly for polymeric materials. The sample is first dissolved in a suitable, non hygroscopic solvent. A drop of this solution is deposited on surface of KBr or NaCl cell. The solution is then evaporated to dryness and the film formed on the cell is analysed directly. Care is important to ensure that the film is not too thick otherwise light cannot pass through. This technique is suitable for qualitative analysis. The final method is to use ": null
    },
    {
        "microtomy": "microtomy"
    },
    {
        " to cut a thin film from a solid sample. This is one of the most important ways of analysing failed plastic products for example because the integrity of the solid is preserved.     In ": null
    },
    {
        "photoacoustic spectroscopy": "photoacoustic spectroscopy"
    },
    {
        " the need for sample treatment is minimal. The sample, liquid or solid, is placed into the sample cup which is inserted into the photoacoustic cell which is then sealed for the measurement. The sample may be one solid piece, powder or basically in any form for the measurement. For example, a piece of rock can be inserted into the sample cup and the spectrum measured from it.          It is typical to record spectrum of both the sample and a reference . This step controls for a number of variables, e.g. ": null
    },
    {
        "infrared detector": "infrared detector"
    },
    {
        ", which may affect the spectrum. The reference measurement makes it possible to eliminate the instrument influence.     The appropriate reference depends on the measurement and its goal. The simplest reference measurement is to simply remove the sample . However, sometimes a different reference is more useful. For example, if the sample is a dilute solute dissolved in water in a beaker, then a good reference measurement might be to measure pure water in the same beaker. Then the reference measurement would cancel out not only all the instrumental properties , but also the light-absorbing and light-reflecting properties of the water and beaker, and the final result would just show the properties of the solute .     A common way to compare to a reference is sequentially: first measure the reference, then replace the reference by the sample and measure the sample. This technique is not perfectly reliable; if the infrared lamp is a bit brighter during the reference measurement, then a bit dimmer during the sample measurement, the measurement will be distorted. More elaborate methods, such as a two-beam setup , can correct for these types of effects to give very accurate results. The ": null
    },
    {
        "Standard addition": "standard addition"
    },
    {
        " method can be used to statistically cancel these errors.     Nevertheless, among different absorption based techniques which are used for gaseous species detection, ": null
    },
    {
        "Cavity ring-down spectroscopy": "cavity ring-down spectroscopy"
    },
    {
        " can be used as a calibration free method. The fact that CRDS is based on the measurements of photon life-times makes it needless for any calibration and comparison with a reference               Fourier transform infrared spectroscopy is a measurement technique that allows one to record infrared spectra. Infrared light is guided through an ": null
    },
    {
        "interferometer": "interferometer"
    },
    {
        " and then through the sample . A moving mirror inside the apparatus alters the distribution of infrared light that passes through the interferometer. The signal directly recorded, called an interferogram , represents light output as a function of mirror position. A data-processing technique called ": null
    },
    {
        "Fourier transform": "fourier transform"
    },
    {
        " turns this raw data into the desired result : Light output as a function of infrared ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        " . As described above, the samples spectrum is always compared to a reference.     An alternate method for acquiring spectra is the dispersive or scanning ": null
    },
    {
        "monochromator": "monochromator"
    },
    {
        " method. In this approach, the sample is irradiated sequentially with various single wavelengths. The dispersive method is more common in ": null
    },
    {
        "UV-Vis spectroscopy": "ultraviolet-visible spectroscopy"
    },
    {
        ", but is less practical in the infrared than the FTIR method. One reason that FTIR is favored is called ": null
    },
    {
        "Fellgetts advantage": "fellgetts advantage"
    },
    {
        " or the multiplex advantage : The information at all frequencies is collected simultaneously, improving both speed and ": null
    },
    {
        "signal-to-noise ratio": "signal-to-noise ratio"
    },
    {
        ". Another is called Jacquinots Throughput Advantage : A dispersive measurement requires detecting much lower light levels than an FTIR measurement.  There are other advantages, as well as some disadvantages, but virtually all modern infrared spectrometers are FTIR instruments.       Ultrahigh energy resolution ": null
    },
    {
        "electron energy loss spectroscopy": "electron energy loss spectroscopy"
    },
    {
        " has recently emerged as a new technique for performing infrared spectroscopy in the ": null
    },
    {
        "transmission electron microscope": "transmission electron microscopy"
    },
    {
        " .  In combination with the high spatial resolution of the TEM, unprecedented experiments have been performed, such as nano-scale temperature measurements,   mapping of isotopically labeled molecules,  mapping of phonon modes in position- and momentum-space,   vibrational surface and bulk mode mapping on nanocubes,  or investigations of polariton modes in van der Waals crystals.    Analysis of vibrational modes that are IR-inactive but appear in ": null
    },
    {
        "Inelastic Neutron Scattering": "inelastic neutron scattering"
    },
    {
        " is also possible at high spatial resolution using EELS.        IR spectroscopy is often used to identify structures because ": null
    },
    {
        "functional groups": "functional group"
    },
    {
        "give rise to characteristic bands both in terms of intensity and position . The positions of these bands are summarized in correlation tables as shown below.             A spectrograph is often interpreted as having two regions.    functional group region \\geq 1500 \\text^   In the functional region there are one to a few troughs per functional group.   fingerprint region ": null
    }
]