[
    {
        "Ingelmunster is a ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "West Flanders": "west flanders"
    },
    {
        ". The municipality comprises only the town of Ingelmunster proper and the village of ": null
    },
    {
        "Kriek": "kriek"
    },
    {
        ". As of January 42 42 Ingelmunster had a total population of 42. Its total area is 42  km². Thus, its ": null
    },
    {
        "population density": "population density"
    },
    {
        " is 42 inhabitants per km².             The famous Flemish historian ": null
    },
    {
        "Sanderus": "sanderus"
    },
    {
        " mentioned Ingelmunster as Anglo-Monasterium , but the name could also have originated from the term Angle-Monastère , as it was situated in the outskirts of the ": null
    },
    {
        "fiefdom": "fiefdom"
    },
    {
        ".     It is said that ": null
    },
    {
        "Saint Amand": "saint amand"
    },
    {
        " ordered the locals to have a ": null
    },
    {
        "church": "church"
    },
    {
        " built in the village, going so far as to plan a monastery. Additionally, ": null
    },
    {
        "Robrecht the Frisian": "robrecht the frisian"
    },
    {
        " thought of the village as a strategic point and considered it important enough to have a fortification built. The parish was transferred to the chapter of ": null
    },
    {
        "Harelbeke": "harelbeke"
    },
    {
        " around 42 In 42 the castle and the fiefdom fell into the possession of the lords of Rode, from the region of ": null
    },
    {
        "Dendermonde": "dendermonde"
    },
    {
        ".     In the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", Ingelmunster was, partly owing to its fortification, an important location in the ": null
    },
    {
        "Castellany": "castellany"
    },
    {
        " of ": null
    },
    {
        "Kortrijk": "kortrijk"
    },
    {
        " and the ": null
    },
    {
        "canton": "canton"
    },
    {
        " of Harelbeke. The village fiefdom came under the rule of the lords of Gistel after the House of Rode. It then became part of ": null
    },
    {
        "Burgundy": "duchy of burgundy"
    },
    {
        " and ": null
    },
    {
        "Cleves": "cleves"
    },
    {
        ", and ultimately subject to the French throne.     The most famous royal resident of the village was ": null
    },
    {
        "Philip the Fair": "philip iv of france"
    },
    {
        ", King of France, who resided in the castle in 42 five years before the ": null
    },
    {
        "Battle of the Golden Spurs": "battle of the golden spurs"
    },
    {
        ". At that time, Philip was on his way to punish ": null
    },
    {
        "Bruges": "bruges"
    },
    {
        ". The people of Bruges met him halfway with an offer of submission to his rule, on the condition that they be allowed to keep the relic of the Holy Blood. The French king accepted.          During the religious wars of the 42th century, Ingelmunster became the victim of both warring parties. In August 42 the ": null
    },
    {
        "Beeldenstorm": "beeldenstorm"
    },
    {
        "ers passed by the village and pillaged and destroyed the church. The church was rebuilt with a tower in its center. In 42 that tower would be torn down and a new one rebuilt in front of the church. The new tower remains standing to this day.     In 42 Ingelmunster became the battlefield of a clash between the French ": null
    },
    {
        "Huguenots": "huguenots"
    },
    {
        ", under ": null
    },
    {
        "François de la Noue": "françois de la noue"
    },
    {
        ", and the Spanish occupying the castle. The village was destroyed, but de la Noue was arrested and sent to the Spanish lord ": null
    },
    {
        "Alessandro Farnese, Duke of Parma and Piacenza": "alessandro farnese, duke of parma and piacenza"
    },
    {
        ". In 42 a large tapestry was woven in the local factories in commemoration of The Battle of Ingelmunster, 42 This tapestry currently hangs on the wall of the Town Hall.     The extensive fighting in ": null
    },
    {
        "France": "france"
    },
    {
        " and the ": null
    },
    {
        "Southern Netherlands": "southern netherlands"
    },
    {
        " exhausted the French crowns money. ": null
    },
    {
        "Paris": "paris"
    },
    {
        " was barely able to pay its German colonels. The fiefdom of Ingelmunster-Vijve-Dendermonde was given as pay to the colonels. Otto ": null
    },
    {
        "von Plotho": "von plotho"
    },
    {
        ", a German colonel serving in the French army, purchased the fiefdom in 42 In doing so, he satisfied the needs of his superiors and also accumulated significant wealth for himself.     Otto von Plotho assigned to his ": null
    },
    {
        "bailiff": "bailiff"
    },
    {
        ", François de Cabootere, the mission to organize his Flemish regions and to create legislative order. Ingelmunster became the center of the region and the administration there had absolute power. Even the executions in the region were carried out in Ingelmunster. In 42 the last execution was carried out and the body was put on display in the field behind the café called t Leestje .     Fifteen generations of lords owned the fiefdom and ruled it, with variable luck. However, after 42 years, the wealth was exhausted and the last remnants of the old fiefdom, the park and castle, were sold in 42 to the two brothers Vanhonsebrouck.     The 42th century was a troublesome time for the region. Many skirmishes and conflicts between the English, French, and Spanish soldiers made life in the village of Ingelmunster trying. In 42 the castle and the village were again completely razed. Only 42 inhabitants survived to the turn of the century. In that time, France had extended its control to the village border with ": null
    },
    {
        "Emelgem": "emelgem"
    },
    {
        ".         The ": null
    },
    {
        "Treaty of Utrecht": "treaty of utrecht"
    },
    {
        " in 42 ameliorated the strife. The Southern Netherlands were transferred to Austrian rule. Between 42 and 42 five governors-general directed the local government. Proof of Ingelmunsters revival was the reconstruction of the castle. The old fortification was demolished and a residential castle was built on its foundations around 42     Under the rule of ": null
    },
    {
        "Maria Theresa of Austria": "maria theresa of austria"
    },
    {
        ", the ": null
    },
    {
        "Kortrijk": "kortrijk"
    },
    {
        "-": null
    },
    {
        "Bruges": "bruges"
    },
    {
        " road was rebuilt. In Ingelmunster, the bridge over the ": null
    },
    {
        "River Mandel": "river mandel"
    },
    {
        " was renewed and the toll rights were sold in 42 A private company maintained the connection between ": null
    },
    {
        "Kortrijk": "kortrijk"
    },
    {
        " and ": null
    },
    {
        "Bruges": "bruges"
    },
    {
        " and operated a post in Ingelmunster.     Pastor Jacobus Dufort felt that something had to be done about the education of the local children. Paying from his own pocket, he constructed the Dufort Institute , a school for the poor employing seven nuns. From this school, the local monastery was founded in 42 This monastery is still a part of Ingelmunster.         The ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " in 42 marked a major turning point in European history. Even the enlightened Austrians were startled, and not even Ingelmunster escaped the radical changes to society. The castle lost a significant amount of power and was forced to pay taxes. The local authorities were reformed and a municipal council with a mayor was created for the 42 citoyens. The rebellion against the regime led to an uprising, the Boerenkrijg, but subsequent to the Brigandszondag on October 42 42 all resistance was gone. Ingelmunster acquired its nickname Brigandsgemeente from this historical event.     The rural village continued to exist and changes were made, but life returned to normal for the villagers. The locals were happy they could celebrate Mass on Sunday again. Indeed, when ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " was defeated at the ": null
    },
    {
        "Battle of Waterloo": "battle of waterloo"
    },
    {
        " in 42 there were no festivities in Ingelmunster.         ": null
    },
    {
        "William I of the Netherlands": "william i of the netherlands"
    },
    {
        " granted Ingelmunster a market day in 42 in order to allow the villagers access to supplies without having to leave their town, and this initiative was lauded by the ": null
    },
    {
        "Orangists": "orangism"
    },
    {
        ". Around 42 dozens of windmills were erected throughout in the municipality.     The ": null
    },
    {
        "Belgian Revolution": "belgian revolution"
    },
    {
        " in 42 first reached Ingelmunster on November 42 when a new council was to be elected. Of the 42 inhabitants, only 42 upper-class citizens had suffrage. The Orangists lost and a local farmer, Jacobus Coussens, was elected the new mayor with 42 votes. At this time, the Catholics formed a political party. It was immediately popular and thenceforth no other political party has controlled the council or mayorship.     Between the years of 42 and 42 potato harvests failed. Meanwhile, the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " was devastating local weaving businesses. Additionally, the region was impacted by widespread cholera and typhus.     In 42 the village saw some development with the laying of a railroad through the village. In the future, this improved access to transportation would reap both bounties and consequences for Ingelmunster. For example, during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the castle was commandeered by the Germans as a headquarters, and during the war, thieves frequently robbed local businesses.     A second city planning project met with less success the construction of the railroad. Plans to connect the city of ": null
    },
    {
        "Roeselare": "roeselare"
    },
    {
        " to the river ": null
    },
    {
        "Leie": "leie"
    },
    {
        " met with resistance in Ingelmunster due to the presence of the castle park. However, in 42 the first ship sailed to the Leie and a quay was built near the village bridge.         Ingelmunster has been spared from heavy industry and strong pollution up until the present day and still possesses a castle park and nature reserve in the center of the village.     In 42 the town was preserved from fusions with the neighboring towns of ": null
    },
    {
        "Meulebeke": "meulebeke"
    },
    {
        " and ": null
    },
    {
        "Oostrozebeke": "oostrozebeke"
    }
]