[
    {
        "      Ink is a ": null
    },
    {
        "liquid": "liquid"
    },
    {
        " or paste that contains ": null
    },
    {
        "pigments": "pigment"
    },
    {
        "or ": null
    },
    {
        "dyes": "dye"
    },
    {
        "and is used to color a surface to produce an ": null
    },
    {
        "image": "image"
    },
    {
        ", ": null
    },
    {
        "text": "writing"
    },
    {
        ", or ": null
    },
    {
        "design": "design"
    },
    {
        ". Ink is used for ": null
    },
    {
        "drawing": "drawing"
    },
    {
        " or ": null
    },
    {
        "writing": "writing"
    },
    {
        " with a ": null
    },
    {
        "pen": "pen"
    },
    {
        ", ": null
    },
    {
        "brush": "brush"
    },
    {
        ", or ": null
    },
    {
        "quill": "quill"
    },
    {
        ". Thicker inks, in paste form, are used extensively in ": null
    },
    {
        "letterpress": "letterpress"
    },
    {
        " and ": null
    },
    {
        "lithographic": "lithographic"
    },
    {
        " printing": "printing"
    },
    {
        ".     Ink can be a complex medium, composed of ": null
    },
    {
        "solvent": "solvent"
    },
    {
        "s, pigments, dyes, ": null
    },
    {
        "resin": "resin"
    },
    {
        "s, ": null
    },
    {
        "lubricant": "lubricant"
    },
    {
        "s, ": null
    },
    {
        "solubilizer": "solubilizer"
    },
    {
        "s, ": null
    },
    {
        "surfactant": "surfactant"
    },
    {
        "s, ": null
    },
    {
        "particulate matter": "suspended solids"
    },
    {
        ", ": null
    },
    {
        "fluorescents": "fluorescence"
    },
    {
        ", and other materials. The components of inks serve many purposes; the inks carrier, colorants, and other additives affect the flow and thickness of the ink and its dry appearance.     In 2011 worldwide consumption of printing inks generated revenues of more than 20  billion US dollars. Demand by traditional print media is shrinking, on the other hand more and more printing inks are consumed for packagings.         Many ancient cultures around the world have independently discovered and formulated inks for the purposes of writing and drawing. The knowledge of the inks, their recipes and the techniques for their production comes from archaeological analysis or from written text itself. The earliest inks from all civilisations are believed to have been made with  lampblack , a kind of ": null
    },
    {
        "soot": "soot"
    },
    {
        ", as this would have been easily collected as a by-product of fire.      Ink was used in ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        " for writing and drawing on ": null
    },
    {
        "papyrus": "papyrus"
    },
    {
        " from at least the 26th century BC.  Chinese inks may go back as far as three  or maybe four millennia, Woods, Michael; Woods, Mary . Ancient Communication: Form Grunts to Graffiti.pp 51–52. Minneapolis: Runestone Press; an imprint of Lerner Publishing Group..... to the ": null
    },
    {
        "Chinese Neolithic Period": "list of neolithic cultures of china"
    },
    {
        ". These used plants, animal, and mineral inks based on such materials as ": null
    },
    {
        "graphite": "graphite"
    },
    {
        " that were ground with water and applied with ": null
    },
    {
        "ink brush": "ink brush"
    },
    {
        "es. Direct evidence for the earliest Chinese inks, similar to modern ": null
    },
    {
        "inkstick": "inkstick"
    },
    {
        "s, is around 256 BC in the end of the ": null
    },
    {
        "Warring States period": "warring states period"
    },
    {
        " and produced from ": null
    },
    {
        "soot": "soot"
    },
    {
        " and ": null
    },
    {
        "animal glue": "animal glue"
    },
    {
        ".  The best inks for drawing or painting on paper or silk are produced from the resin of the pine tree. They must be between 50 and 100 years old. The Chinese inkstick is produced with a fish glue, whereas Japanese glue is from cow or stag. Yuuko Suzuki, Introduction to Japanese calligraphy, Search Press 2005, Calligraphie japonaise, 2003, éd. Fleurus, Paris     ": null
    },
    {
        "India ink": "india ink"
    },
    {
        " was first invented in China, Smith, Joseph A. . The Pen and Ink Book: Materials and Techniques for Todays Artist.p. 23. New York: Watson-Guptill Publications. . though materials were often traded from India, hence the name. Gottsegen, Mark D. . The Painters Handbook: A Complete Reference.Page 30, New York: Watson-Guptill Publications. . The traditional Chinese method of making the ink was to grind a mixture of ": null
    },
    {
        "hide glue": "animal glue"
    },
    {
        ", ": null
    },
    {
        "carbon black": "carbon black"
    },
    {
        ", lampblack, and ": null
    },
    {
        "bone black": "bone char"
    },
    {
        " pigment with a ": null
    },
    {
        "pestle and mortar": "pestle and mortar"
    },
    {
        ", then pouring it into a ceramic dish to dry. To use the dry mixture, a wet brush would be applied until it reliquified. The manufacture of India ink was well-established by the ": null
    },
    {
        "Cao Wei": "cao wei"
    },
    {
        " Dynasty . Sung, Sun & Sun, page 286-288. Indian documents written in ": null
    },
    {
        "Kharosthi": "kharosthi"
    },
    {
        " with ink have been unearthed in ": null
    },
    {
        "Chinese Turkestan": "chinese turkestan"
    },
    {
        ". Sircar, page 206 The practice of writing with ink and a sharp pointed needle was common in early ": null
    },
    {
        "South India": "south india"
    },
    {
        ". Several ": null
    },
    {
        "Buddhist": "buddhism"
    },
    {
        " and ": null
    },
    {
        "Jain": "jain"
    },
    {
        " sutras in India were compiled in ink.     In ": null
    },
    {
        "ancient Rome": "ancient rome"
    },
    {
        ", ": null
    },
    {
        "atramentum": "atramentum"
    },
    {
        " was used; in an article for the  Christian Science Monitor , Sharon J. Huntington describes these other historical inks:      About 1,600 years ago, a popular ink recipe was created. The recipe was used for centuries. Iron salts, such as ferrous sulfate , were mixed with tannin from ": null
    },
    {
        "gall": "gall"
    },
    {
        "nuts and a thickener. When first put to paper, this ink is bluish-black. Over time it fades to a dull brown.     Scribes in ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " Europe": "europe"
    },
    {
        " wrote principally on ": null
    },
    {
        "parchment": "parchment"
    },
    {
        " or ": null
    },
    {
        "vellum": "vellum"
    },
    {
        ". One 12th century ink recipe called for hawthorn branches to be cut in the spring and left to dry. Then the bark was pounded from the branches and soaked in water for eight days. The water was boiled until it thickened and turned black. Wine was added during boiling. The ink was poured into special bags and hung in the sun. Once dried, the mixture was mixed with wine and iron salt over a fire to make the final ink.  , Christian Science Monitor, September 21, 2004     The reservoir pen, which may have been the first ": null
    },
    {
        "fountain pen": "fountain pen"
    },
    {
        ", dates back to 953, when ": null
    },
    {
        "Maād al-Muizz": "al muizz"
    },
    {
        ", the ": null
    },
    {
        "caliph": "caliph"
    },
    {
        " of ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", demanded a pen that would not stain his hands or clothes, and was provided with a pen that held ink in a reservoir. CE Bosworth, A Mediaeval Islamic Prototype of the Fountain Pen? Journal of Semitic Studies, 26:229–234, 1981     In the 15th century, a new type of ink had to be developed in Europe for the ": null
    },
    {
        "printing press": "printing press"
    },
    {
        " by ": null
    },
    {
        "Johannes Gutenberg": "johannes gutenberg"
    },
    {
        ".  According to Martyn Lyons in his book Books: A Living History, Gutenbergs dye was indelible, oil-based, and made from the soot of lamps mixed with varnish and egg white. Lyons, M. . Books: A living history. Los Angeles: J. Paul Getty Museum. Two types of ink were prevalent at the time: the Greek and Roman writing ink and the 12th century variety composed of ferrous sulfate, gall, gum, and water. Many recipes for ": null
    },
    {
        "iron gall inks": "iron gall ink"
    },
    {
        "are featured in A booke of secrets: shewing diuers waies to make and prepare all sorts of inke... tr. out of Dutch into Englishe by W.P. London, 1596. Neither of these handwriting inks could adhere to printing surfaces without creating blurs. Eventually an oily, ": null
    },
    {
        "varnish": "varnish"
    },
    {
        "-like ink made of soot, ": null
    },
    {
        "turpentine": "turpentine"
    },
    {
        ", and walnut oil was created specifically for the printing press.            Ink formulas vary, but commonly involve two components:   Colorants   Vehicles     Inks generally fall into four classes:    Aqueous   Liquid   Paste   Powder                Pigment inks are used more frequently than dyes because they are more color-fast, but they are also more expensive, less consistent in color, and have less of a ": null
    },
    {
        "color range": "gamut"
    },
    {
        " than dyes.   Pigments are solid, opaque particles suspended in ink to provide color. Pigment molecules typically link together in ": null
    },
    {
        "crystal": "crystal"
    },
    {
        "line structures that are 0.1–2 ": null
    },
    {
        "µm": "micrometre"
    },
    {
        " in size and comprise 5–30 percent of the ink volume. Qualities such as ": null
    },
    {
        "hue": "hue"
    },
    {
        ", ": null
    },
    {
        "saturation": "saturation"
    },
    {
        ", and ": null
    },
    {
        "lightness": "lightness"
    },
    {
        " vary depending on the source and type of pigment.       Dye-based inks are generally much stronger than pigment-based inks and can produce much more color of a given density per unit of mass. However, because dyes are dissolved in the liquid phase, they have a tendency to soak into paper, potentially allowing the ink to bleed at the edges of an image.     To circumvent this problem, dye-based inks are made with solvents that dry rapidly or are used with quick-drying methods of printing, such as blowing hot air on the fresh print. Other methods include harder paper ": null
    },
    {
        "sizing": "sizing"
    },
    {
        " and more specialized paper coatings. The latter is particularly suited to inks used in non-industrial settings , such as ": null
    },
    {
        "inkjet printer": "inkjet printer"
    },
    {
        " inks. Another technique involves coating the paper with a charged coating. If the dye has the opposite charge, it is attracted to and retained by this coating, while the solvent soaks into the paper. ": null
    },
    {
        "Cellulose": "cellulose"
    },
    {
        ", the wood-derived material most paper is made of, is naturally charged, and so a compound that complexes with both the dye and the papers surface aids retention at the surface. Such a compound is commonly used in ink-jet printing inks.     An additional advantage of dye-based ink systems is that the dye ": null
    },
    {
        "molecules": "molecule"
    },
    {
        "can interact with other ink ingredients, potentially allowing greater benefit as compared to pigmented inks from ": null
    },
    {
        "optical brighteners": "optical brightener"
    },
    {
        "and color-enhancing agents designed to increase the intensity and appearance of dyes.     A more recent development in dye-based inks are dyes that react with cellulose to permanently color the paper. Such inks are not affected by water, alcohol, and other solvents. As such, their use is recommended to prevent frauds that involve removing signatures, such as ": null
    },
    {
        "check washing": "check washing"
    },
    {
        ". This kind of ink is most commonly found in gel inks and in certain ": null
    },
    {
        "fountain pen inks": "fountain pen inks"
    },
    {
        ".             There is a misconception that ink is non-toxic even if swallowed. Once ingested, ink can be hazardous to ones health. Certain inks, such as those used in digital printers, and even those found in a common pen can be harmful. Though ink does not easily cause death, repeated skin contact or ingestion can cause effects such as severe headaches, skin irritation, or nervous system damage.  These effects can be caused by solvents, or by pigment ingredients such as ": null
    },
    {
        "p-Anisidine": "p-anisidine"
    },
    {
        ", which helps create some inks color and shine.     Three main environmental issues with ink are:   ": null
    },
    {
        "Heavy metals": "heavy metal"
    },
    {
        "Volatile organic compounds": "volatile organic compound"
    },
    {
        "    Some regulatory bodies have set standards for the amount of heavy metals in ink.  There is a trend toward ": null
    },
    {
        "vegetable oils": "vegetable oil"
    },
    {
        "rather than ": null
    },
    {
        "petroleum oils": "petroleum oil"
    },
    {
        "in recent years in response to a demand for better ": null
    },
    {
        "environmental sustainability": "sustainability"
    },
    {
        " performance.     Ink uses up non-renewable oils and metals, which has a negative impact on the environment.           Carbon inks were commonly made from lampblack or soot and a binding agent such as ": null
    },
    {
        "gum arabic": "gum arabic"
    },
    {
        " or ": null
    },
    {
        "animal glue": "animal glue"
    },
    {
        ". The binding agent keeps carbon particles in suspension and adhered to paper. Carbon particles do not fade over time even when bleached or when in sunlight. One benefit is that carbon ink does not harm paper. Over time, the ink is chemically stable and therefore does not threaten the papers strength. Despite these benefits, carbon ink is not ideal for permanence and ease of preservation. Carbon ink tends to smudge in humid environments and can be washed off surfaces. The best method of preserving a document written in carbon ink is to store it in a dry environment .     Recently, carbon inks made from carbon nanotubes have been successfully created. They are similar in composition to traditional inks in that they use a polymer to suspend the carbon nanotubes. These inks can be used in inkjet printers and produce electrically conductive patterns.           Iron gall inks became prominent in the early 12th century; they were used for centuries and were widely thought to be the best type of ink. However, iron gall ink is corrosive and damages paper over time . Items containing this ink can become brittle and the writing fades to brown. The original scores of ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " are threatened by the destructive properties of iron gall ink. The majority of his works are held by the German State Library, and about 25% of those are in advanced stages of decay . The rate at which the writing fades is based on several factors, such as proportions of ink ingredients, amount deposited on the paper, and paper composition . Corrosion is caused by acid catalysed hydrolysis and iron-catalysed oxidation of cellulose .     Treatment is a controversial subject. No treatment undoes damage already caused by acidic ink. Deterioration can only be stopped or slowed. Some think it best not to treat the item at all for fear of the consequences. Others believe that non-aqueous procedures are the best solution. Yet others think an aqueous procedure may preserve items written with iron gall ink. Aqueous treatments include distilled water at different temperatures, calcium hydroxide, calcium bicarbonate, magnesium carbonate, magnesium bicarbonate, and calcium phytate. There are many possible side effects from these treatments. There can be mechanical damage, which further weakens the paper. Paper color or ink color may change, and ink may bleed. Other consequences of aqueous treatment are a change of ink texture or formation of plaque on the surface of the ink .     Iron gall inks require storage in a stable environment, because fluctuating ": null
    },
    {
        "relative humidity": "relative humidity"
    },
    {
        " increases the rate that formic acid, acetic acid, and furan derivatives form in the material the ink was used on. Sulfuric acid acts as a catalyst to cellulose hydrolysis, and iron sulfate acts as a catalyst to cellulose oxidation. These chemical reactions physically weaken the paper, causing ": null
    },
    {
        "brittleness": "brittle books program"
    },
    {
        ". Henk J. Porck and René Teygeler, Preservation Science Survey .             Indelible means unremovable . Some types of indelible ink have a very short shelf life because of the quickly evaporating solvents used. ": null
    },
    {
        "India": "india"
    },
    {
        ", ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        ", ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        ", ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        " and other developing countries have used indelible ink in the form of ": null
    },
    {
        "electoral stain": "electoral stain"
    },
    {
        " to prevent ": null
    },
    {
        "electoral fraud": "electoral fraud"
    },
    {
        ". The Indian Scientist Dr. M.L. Goel is the founding father of indelible ink in India and gave the secret formula to NPL of India.     The Election Commission in India has used indelible ink for many elections. Indonesia used it in its last election in ": null
    },
    {
        "Aceh": "aceh"
    },
    {
        ". In ": null
    },
    {
        "Mali": "mali"
    },
    {
        ", the ink is applied to the fingernail. Indelible ink itself is not infallible as it can be used to commit electoral ": null
    },
    {
        "fraud": "fraud"
    },
    {
        " by marking opponent party members before they have chances to cast their votes. There are also reports of indelible ink washing off voters fingers in Afghanistan. ": null
    }
]