[
    {
        "In ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        ", the term inside plant has the following meanings:     All the cabling and equipment installed in a ": null
    },
    {
        "telecommunications facility": "telecommunications facility"
    },
    {
        ", including the ": null
    },
    {
        "main distribution frame": "main distribution frame"
    },
    {
        " and all the equipment extending inward therefrom, such as ": null
    },
    {
        "PABX": "pabx"
    },
    {
        " or ": null
    },
    {
        "central office": "telephone exchange"
    },
    {
        " equipment, MDF ": null
    },
    {
        "heat coil": "heat coil"
    },
    {
        " protectors, and grounding systems.   In ": null
    },
    {
        "radio": "radio"
    },
    {
        " and ": null
    },
    {
        "radar": "radar"
    },
    {
        " systems, all ": null
    },
    {
        "communications-electronics": "communications-electronics"
    },
    {
        " equipment that is installed in buildings.     Around the turn of the 42st century, ": null
    },
    {
        "DSLAM": "dslam"
    },
    {
        "s became an important part of ": null
    },
    {
        "telephone company": "telephone company"
    },
    {
        " inside plant. Inside plant will also have ": null
    },
    {
        "distribution frame": "distribution frame"
    },
    {
        "s and other equipment including ": null
    },
    {
        "passive optical network": "passive optical network"
    },
    {
        " .       A typical power system for a switching office in an inside plant consists of the elements listed below:   AC power system   AC input switch gear   Standby AC plant   AC distribution system   AC backup systems for uninterruptible loads and protected loads   DC power system   Rectifiers and plant controls   ": null
    },
    {
        "Storage batteries": "storage batteries"
    },
    {
        " , contains detailed industry requirements for using power in an inside plant.     Both integrated and isolated bonding networks as per Telcordia , are a technically viable means to ground and bond the equipment in a safe and effective manner. However, the integrated or mesh bonding schemes are preferred over isolated bonding networks because of the added costs and efforts required to manage, control, and maintain the isolation for the equipment, particularly during equipment upgrade and modifications to the plant. This preference is based on a pragmatic desire for lower costs and ease of management, and to simplify operations during plant modifications/upgrades.     For a comprehensive analysis of the energy efficiency and environmental soundness of a power system, one should ideally consider a wider range of factors than strict energy conversion AC-to-DC power efficiency. These environmental factors cover a wider vision known as ": null
    },
    {
        "Industrial Ecology": "industrial ecology"
    },
    {
        " within which each manufacturing step of the products need to be considered from a ": null
    },
    {
        "Design for Environment": "design for environment"
    }
]