[
    {
        "The insulin-like growth factors are ": null
    },
    {
        "proteins": "protein"
    },
    {
        "with high ": null
    },
    {
        "sequence similarity": "homology"
    },
    {
        " to ": null
    },
    {
        "insulin": "insulin"
    },
    {
        ". IGFs are part of a ": null
    },
    {
        "complex system": "complex system"
    },
    {
        " that cells use to communicate with their ": null
    },
    {
        "physiologic": "physiology"
    },
    {
        " environment. This complex system consists of two ": null
    },
    {
        "cell-surface receptors": "cell-surface receptor"
    },
    {
        ", two ": null
    },
    {
        "ligands": "ligand"
    },
    {
        " , a family of seven high-affinity ": null
    },
    {
        "IGF-binding proteins": "insulin-like growth factor-binding protein"
    },
    {
        " , as well as associated ": null
    },
    {
        "IGFBP": "insulin-like growth factor-binding protein"
    },
    {
        " degrading ": null
    },
    {
        "enzyme": "enzyme"
    },
    {
        "s, referred to collectively as ": null
    },
    {
        "protease": "protease"
    },
    {
        "s.         The IGF axis is also commonly referred to as the Growth Hormone/IGF-1 Axis. ": null
    },
    {
        "Insulin-like growth factor 1": "insulin-like growth factor 1"
    },
    {
        "  is mainly secreted by the liver as a result of stimulation by ": null
    },
    {
        "growth hormone": "growth hormone"
    },
    {
        " . IGF-1 is important for both the regulation of normal physiology, as well as a number of pathological states, including ": null
    },
    {
        "cancer": "cancer"
    },
    {
        ". The IGF axis has been shown to play roles in the promotion of ": null
    },
    {
        "cell proliferation": "cell proliferation"
    },
    {
        " and the inhibition of ": null
    },
    {
        "cell death": "cell death"
    },
    {
        " . ": null
    },
    {
        "Insulin-like growth factor 2": "insulin-like growth factor 2"
    },
    {
        " is thought to be a primary ": null
    },
    {
        "growth factor": "growth factor"
    },
    {
        " required for early development while ": null
    },
    {
        "IGF-1": "igf-1"
    },
    {
        " expression is required for achieving maximal growth. ": null
    },
    {
        "Gene knockout": "gene knockout"
    },
    {
        " studies in mice have confirmed this, though other animals are likely to regulate the expression of these genes in distinct ways. While IGF-2 may be primarily ": null
    },
    {
        "fetal": "fetus"
    },
    {
        " in action it is also essential for development and function of organs such as the ": null
    },
    {
        "brain": "brain"
    },
    {
        ", ": null
    },
    {
        "liver": "liver"
    },
    {
        ", and ": null
    },
    {
        "kidney": "kidney"
    },
    {
        ".     Factors that are thought to cause variation in the levels of GH and IGF-1 in the circulation include an individuals genetic make-up, the time of day, age, sex, exercise status, stress levels, nutrition level, ": null
    },
    {
        "body mass index": "body mass index"
    },
    {
        " , disease state, race, estrogen status, and ": null
    },
    {
        "xenobiotic": "xenobiotic"
    },
    {
        " intake.     IGF-1 has an involvement in regulating ": null
    },
    {
        "neural development": "neural development"
    },
    {
        " including ": null
    },
    {
        "neurogenesis": "neurogenesis"
    },
    {
        ", ": null
    },
    {
        "myelination": "myelination"
    },
    {
        ", ": null
    },
    {
        "synaptogenesis": "synaptogenesis"
    },
    {
        ", and ": null
    },
    {
        "dendritic": "dendrite"
    },
    {
        " branching and ": null
    },
    {
        "neuroprotection": "neuroprotection"
    },
    {
        " after neuronal damage. Increased serum levels of IGF-I in children have been associated with higher ": null
    },
    {
        "IQ": "iq"
    },
    {
        ".      IGF-1 shapes the development of the ": null
    },
    {
        "cochlea": "cochlea"
    },
    {
        " through controlling ": null
    },
    {
        "apoptosis": "apoptosis"
    },
    {
        ". Its deficit can cause ": null
    },
    {
        "hearing": "hearing"
    },
    {
        " loss. Serum level of it also underlies a correlation between short ": null
    },
    {
        "height": "human height"
    },
    {
        " and reduced hearing abilities particularly around 3–5 years of age, and at age 18 .           The IGFs are known to bind the ": null
    },
    {
        "IGF-1 receptor": "igf-1 receptor"
    },
    {
        ", the ": null
    },
    {
        "insulin receptor": "insulin receptor"
    },
    {
        ", the ": null
    },
    {
        "IGF-2 receptor": "insulin-like growth factor 2 receptor"
    },
    {
        ", the insulin-related receptor and possibly other receptors. The ": null
    },
    {
        "IGF-1 receptor": "igf-1 receptor"
    },
    {
        " is the physiological receptor—": null
    },
    {
        "IGF-1": "igf-1"
    },
    {
        " binds to it at significantly higher affinity than it binds the insulin receptor. Like the insulin receptor, the IGF-1 receptor is a ": null
    },
    {
        "receptor tyrosine kinase": "receptor tyrosine kinase"
    },
    {
        "—meaning the receptor signals by causing the addition of a phosphate molecule on particular tyrosines. The IGF-2 receptor only binds IGF-2 and acts as a clearance receptor —it activates no intracellular signaling pathways, functioning only as an IGF-2 sequestering agent and preventing IGF-2 signaling.         Since many distinct tissue types express the ": null
    },
    {
        "IGF-1 receptor": "igf-1 receptor"
    },
    {
        ", IGF-1s effects are diverse. It acts as a ": null
    },
    {
        "neurotrophic": "neurotrophic"
    },
    {
        " factor, inducing the survival of neurons. It may catalyse ": null
    },
    {
        "skeletal muscle": "skeletal muscle"
    },
    {
        " hypertrophy": "hypertrophy"
    },
    {
        ", by inducing ": null
    },
    {
        "protein synthesis": "protein synthesis"
    },
    {
        ", and by blocking ": null
    },
    {
        "muscle atrophy": "muscle atrophy"
    },
    {
        ". It is protective for ": null
    },
    {
        "cartilage": "cartilage"
    },
    {
        " cells, and is associated with activation of ": null
    },
    {
        "osteocytes": "osteocytes"
    },
    {
        ", and thus may be an anabolic factor for ": null
    },
    {
        "bone": "bone"
    },
    {
        ". Since at high concentrations it is capable of activating the ": null
    },
    {
        "insulin receptor": "insulin receptor"
    },
    {
        ", it can also complement for the effects of ": null
    },
    {
        "insulin": "insulin"
    },
    {
        ". Receptors for IGF-1 are found in vascular smooth muscle, while typical receptors for insulin are not found in vascular smooth muscle.          IGF-1 and IGF-2 are regulated by a family of proteins known as the ": null
    },
    {
        "IGF-Binding Proteins": "insulin-like growth factor-binding protein"
    },
    {
        ". These proteins help to modulate IGF action in complex ways that involve both inhibiting IGF action by preventing binding to the IGF-1 receptor as well as promoting IGF action possibly through aiding in delivery to the receptor and increasing IGF half-life. Currently, there are seven characterized IGF Binding Proteins . There is currently significant data suggesting that IGFBPs play important roles in addition to their ability to regulate IGFs.   IGF-1 and IGFBP-3 are GH dependent, whereas IGFBP-1 is insulin regulated.   IGFBP-1 production from the liver is significantly elevated during insulinopenia while serum levels of bioactive IGF-1 is increased by insulin.         Studies of recent interest show that the Insulin/IGF axis play an important role in ": null
    },
    {
        "aging": "senescence"
    },
    {
        ".  ": null
    },
    {
        "Nematode": "nematode"
    },
    {
        "s, ": null
    },
    {
        "fruit-flies": "drosophila melanogaster"
    },
    {
        ", and other organisms have an increased life span when the gene equivalent to the mammalian insulin is ": null
    },
    {
        "knocked out": "gene knockout"
    },
    {
        ". It is somewhat difficult to relate this finding to the mammals, however, because in the smaller organism there are many genes  that are insulin-like or IGF-1-like , whereas in the mammals insulin-like proteins comprise only seven members . The human insulin-like genes have apparently distinct roles with some but less crosstalk presumably because there are multiple insulin-receptor-like proteins in humans. Simpler organisms typically have fewer receptors; for example, only one insulin-like receptor exists in the nematode C. elegans.  Additionally, C. elegans do not have specialized organs such as the , which sense insulin in response to glucose homeostasis. Moreover, IGF1 affects lifespan in nematodes by causing dauer formation, a developmental stage of C. elegans larva. There is no mammalian correlate. Therefore, it is an open question as to whether either IGF-1 or insulin in the mammal may perturb aging, although there is the suggestion that dietary restriction phenomena may be related.     Other studies are beginning to uncover the important role the IGFs play in diseases such as ": null
    },
    {
        "cancer": "cancer"
    },
    {
        " and ": null
    },
    {
        "diabetes": "diabetes"
    },
    {
        ", showing for instance that IGF-1 stimulates growth of both prostate and breast cancer cells. Researchers are not in complete agreement about the degree of cancer risk that IGF-1 poses.                  ": null
    }
]