[
    {
        "In ": null
    },
    {
        "statistics": "statistics"
    },
    {
        ", interval estimation is the use of ": null
    },
    {
        "sample data": "sample"
    },
    {
        " to calculate an ": null
    },
    {
        "interval": "interval"
    },
    {
        " of possible values of an unknown ": null
    },
    {
        "population parameter": "population parameter"
    },
    {
        "; this is in contrast to ": null
    },
    {
        "point estimation": "point estimation"
    },
    {
        ", which gives a single value. ": null
    },
    {
        "Jerzy Neyman": "jerzy neyman"
    },
    {
        " identified interval estimation as distinct from ": null
    },
    {
        "point estimation": "point estimation"
    },
    {
        " . In doing so, he recognized that then-recent work quoting results in the form of an ": null
    },
    {
        "estimate": "estimator"
    },
    {
        " plus-or-minus a ": null
    },
    {
        "standard deviation": "standard deviation"
    },
    {
        " indicated that interval estimation was actually the problem ": null
    },
    {
        "statisticians": "statisticians"
    },
    {
        " really had in mind.     The most prevalent forms of interval estimation are:   ": null
    },
    {
        "confidence interval": "confidence interval"
    },
    {
        "s ; and   ": null
    },
    {
        "credible interval": "credible interval"
    },
    {
        "s .     Other forms include:   ": null
    },
    {
        "likelihood interval": "likelihood interval"
    },
    {
        "s ; and   ": null
    },
    {
        "fiducial interval": "fiducial interval"
    },
    {
        "s .     Other forms of statistical intervals, which do not estimate parameters, include:   ": null
    },
    {
        "tolerance interval": "tolerance interval"
    },
    {
        "s ; and   ": null
    },
    {
        "prediction interval": "prediction interval"
    },
    {
        "s .     Non-statistical methods that can lead to interval estimates include ": null
    },
    {
        "fuzzy logic": "fuzzy logic"
    },
    {
        ". An interval estimate is one type of outcome of a statistical analysis. Some other types of outcome are ": null
    },
    {
        "point estimates": "point estimation"
    },
    {
        " and ": null
    },
    {
        "decisions": "decision theory"
    },
    {
        ".          The scientific problems associated with interval estimation may be summarised as follows:   :When interval estimates are reported, they should have a commonly held interpretation in the scientific community and more widely. In this regard, credible intervals are held to be most readily understood by the general public. Interval estimates derived from fuzzy logic have much more application-specific meanings.   :For commonly occurring situations there should be sets of standard procedures that can be used, subject to the checking and validity of any required assumptions. This applies for both confidence intervals and credible intervals.   :For more novel situations there should be guidance on how interval estimates can be formulated. In this regard confidence intervals and credible intervals have a similar standing but there are differences:   ::credible intervals can readily deal with prior information, while confidence intervals cannot.   ::confidence intervals are more flexible and can be used practically in more situations than credible intervals: one area where credible intervals suffer in comparison is in dealing with non-parametric models .     :There should be ways of testing the performance of interval estimation procedures. This arises because many such procedures involve approximations of various kinds and there is a need to check that the actual performance of a procedure is close to what is claimed. The use of stochastic simulations makes this is straightforward in the case of confidence intervals, but it is somewhat more problematic for credible intervals where prior information needs to be taken properly into account. Checking of credible intervals can be done for situations representing no-prior-information but the check involves checking the long-run frequency properties of the procedures.     Severini discusses conditions under which credible intervals and confidence intervals will produce similar results, and also discusses both the ": null
    },
    {
        "coverage probabilities": "coverage probability"
    },
    {
        " of credible intervals and the posterior probabilities associated with confidence intervals.     In ": null
    },
    {
        "decision theory": "decision theory"
    },
    {
        ", which is a common approach to and justification for Bayesian statistics, interval estimation is not of direct interest. The outcome is a decision, not a interval estimate, and thus Bayesian decision theorists use a ": null
    },
    {
        "Bayes action": "bayes action"
    }
]