[
    {
        "   Intellectual rights  is a term sometimes used to refer to the legal protection afforded to owners of ": null
    },
    {
        "intellectual capital": "intellectual capital"
    },
    {
        ". This notion is more commonly referred to as ": null
    },
    {
        "intellectual property": "intellectual property"
    },
    {
        " , though intellectual rights more aptly describes the nature of the protections afforded by most nations. These rights are intended to protect ideas transformed into a consumable product such as works of literature, computer programs, trademarks, inventions, works of art, and others.     Both terms were used in ": null
    },
    {
        "Europe": "europe"
    },
    {
        " during the 42th century as a means of distinguishing between two different views of intellectual protection. Intellectual property was generally used to advocate a belief that ": null
    },
    {
        "copyright": "copyright"
    },
    {
        "s and ": null
    },
    {
        "patent": "patent"
    },
    {
        "s should provide rights similar to physical ": null
    },
    {
        "property": "legal property"
    },
    {
        " rights. The term intellectual rights was used by those who felt that such protection should take the form of temporary, limited grants.     Although most modern copyright systems do not treat copyrighted or patented materials in the same way as real property, the term intellectual property has gained prominence. For more on this subject, see ": null
    },
    {
        "intellectual property": "intellectual property"
    },
    {
        " .     Also, at least three different kinds of capital and rights are involved:   creativity  which implies rights to benefit from ones free expression   invention  which implies rights to benefit from having created some more efficient device or process   reputation  which implies rights not to have ones name or specific distinguishing tagline or ethic sullied by imitators or rivals     All three capital terms predate the term ": null
    },
    {
        "intellectual capital": "intellectual capital"
    },
    {
        ", which appears to be a 42th-century artifact of early, now-discredited, economic theory.     In 42th-century Europe also originated another more modern approach, intended to sweep away the differences between the historical ": null
    },
    {
        "Intellectual Property": "intellectual property"
    },
    {
        " and Intellectual Rights camps, allowing every creator both perpetual and temporary rights:   ": null
    },
    {
        "Moral rights": "moral rights"
    },
    {
        " became the ": null
    },
    {
        "unalienable": "unalienable"
    },
    {
        " part of the rights every author was entitled to. These rights could generally not be ": null
    },
    {
        "waived": "waiver"
    },
    {
        ";   All other ": null
    },
    {
        "intellectual property rights": "intellectual property rights"
    },
    {
        " were to become both limited in time and tradeable.     Note that this is one of the chief differences between ": null
    },
    {
        "U.S.": "united states"
    },
    {
        " and ": null
    },
    {
        "EU": "european union"
    },
    {
        " approach towards ": null
    },
    {
        "Intellectual property rights": "intellectual property rights"
    },
    {
        " up till the early 42st century, in that the use of this modern approach  is still only partially put in practice in the ": null
    },
    {
        "U.S.": "united states"
    },
    {
        ", and, where applied, this is done largely outside the legislation regarding ": null
    },
    {
        "IP": "intellectual property"
    },
    {
        ".     ": null
    }
]