[
    {
        "   The Intermontane Plateaus of the ": null
    },
    {
        "Western United States": "western united states"
    },
    {
        " is one of eight ": null
    },
    {
        "U.S. Physiographic regions ": "physiographic regions of the united states"
    },
    {
        " of the ": null
    },
    {
        "physical geography": "physical geography"
    },
    {
        " of the ": null
    },
    {
        "contiguous United States": "contiguous united states"
    },
    {
        ". The region is composed of ": null
    },
    {
        "intermontane": "intermontane"
    },
    {
        " plateau": "plateau"
    },
    {
        "s and ": null
    },
    {
        "mountain range": "mountain range"
    },
    {
        "s. It is subdivided into ": null
    },
    {
        "physiographic province": "physiographic province"
    },
    {
        "s, which are each subdivided into physiographic sections.              The Columbia Plateau Province is a ": null
    },
    {
        "large igneous province": "large igneous province"
    },
    {
        " of ": null
    },
    {
        "flood basalt": "flood basalt"
    },
    {
        "s erupted in ": null
    },
    {
        "Miocene": "miocene"
    },
    {
        " and early ": null
    },
    {
        "Pliocence": "pliocence"
    },
    {
        " epoch": "epoch"
    },
    {
        "s across the states of ": null
    },
    {
        "Washington": "washington"
    },
    {
        ", ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        ", ": null
    },
    {
        "Idaho": "idaho"
    },
    {
        ", ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        ", and ": null
    },
    {
        "California": "california"
    },
    {
        ".       The province was uplifted and divided into great blocks by faults or monoclinal flexures and thus exposed to long-lasting denudation in a mid-Tertiary cycle of erosion. They were then broadly elevated again with renewed movement on some of the fault lines. The current erosion cycle was introduced in late Tertiary time during which the deep canyons of the region have been trenched. The results of the first cycle of erosion are seen in the widespread exposure of the resistant Carboniferous limestone as a broad platform in the south-western area of greater uplift through central ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        " where the higher formations were worn away. They are also seen in the development of a series of huge, south-facing, ": null
    },
    {
        "retreating": "scarp retreat"
    },
    {
        " escarpment": "escarpment"
    },
    {
        "s of irregular outline on the edges of the higher formations farther north. Each escarpment stands forth where a resistant formation overlies a weaker one. Each escarpment is separated from the next higher one by a broad step of weaker strata.     A wonderful series of these forms occurs in southern ": null
    },
    {
        "Utah": "utah"
    },
    {
        ", where in passing northward from the Carboniferous platform one ascends in succession the ": null
    },
    {
        "Chocolate Cliffs": "chocolate cliffs"
    },
    {
        " , ": null
    },
    {
        "Vermilion": "vermillion cliffs"
    },
    {
        " and ": null
    },
    {
        "White Cliffs": "white cliffs"
    },
    {
        " , the ": null
    },
    {
        "Gray Cliffs": "gray cliffs"
    },
    {
        " , and finally the ": null
    },
    {
        "Pink Cliffs": "pink cliffs"
    },
    {
        "  of the high, forested plateaus. Associated with these irregular escarpments are occasional rectilinear ridges, the work of extensive erosion on monoclinal structures. A good example of this is ": null
    },
    {
        "Echo Cliffs": "echo cliffs"
    },
    {
        " lying east of the ": null
    },
    {
        "Painted Desert": "painted desert, arizona"
    },
    {
        ". The ": null
    },
    {
        "Mogollon Rim": "mogollon rim"
    },
    {
        " escarpment is part of the transition zone between the ": null
    },
    {
        "Mogollon Plateau": "mogollon plateau"
    },
    {
        " of the Colorado Plateau Province and the ": null
    },
    {
        "Sonoran Desert": "sonoran desert"
    },
    {
        " of the ": null
    },
    {
        "Basin and Range Province": "basin and range province"
    },
    {
        ".     With the renewal of uplift by which the earlier cycle of erosion was interrupted and the present cycle introduced, inequalities of surface due to renewed faulting were again introduced. These still appear as cliffs, of more nearly rectilinear front than the retreating escarpments formed in the previous cycle. These cliffs are peculiar in gradually passing from one formation to another, and in having a height dependent on the displacement of the fault rather than on the structures in the fault face. They are already somewhat battered and dissected by erosion. The most important line of cliffs of this class is associated with the western and southern boundary of the Plateau Province where it was uplifted from the lower ground. The few rivers of the region must have reached the quiescence of old age in the earlier cycle, but were revived by uplift to a vigorous youth in the current cycle. It is to this newly introduced cycle of physiographic evolution that the deep canyons of the Plateau province are due. Thus the ": null
    },
    {
        "Virgin River": "virgin river"
    },
    {
        ", a northern ": null
    },
    {
        "tributary": "tributary"
    },
    {
        " of the ": null
    },
    {
        "Colorado River": "colorado river"
    },
    {
        ", has cut a vertical slit, 42  ft. deep, hardly wider at the top than at the bottom, in the heavy Triassic sandstones of southern Utah. However the most famous example is the ": null
    },
    {
        "Grand Canyon": "grand canyon"
    },
    {
        " of ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        ", eroded by the ": null
    },
    {
        "Colorado": "colorado river"
    },
    {
        " river across the uplifted platform of Carboniferous limestone.     During the current cycle of erosion, several of the ": null
    },
    {
        "fault": "fault"
    },
    {
        "s, whose scarps had been worn away in the previous cycle, have been brought to light again as ": null
    },
    {
        "topographic": "topography"
    },
    {
        " features by the removal of the weak strata along one side of the fault line, leaving the harder strata on the other side in relief. Such scarps are known as fault-line scarps, in distinction from the original ": null
    },
    {
        "fault scarp": "fault scarp"
    },
    {
        "s. They are peculiar in having their altitude dependent on the depth of revived erosion, instead of the amount of faulting, and they are sometimes topographically reversed, in that the revived scarp overlooks a lowland worn on a weak formation in the upheaved fault-block. Another consequence of revived erosion is seen in the occurrence of great ": null
    },
    {
        "landslide": "landslide"
    },
    {
        "s, where the removal of weak  clays has sapped the face of the Vermilion Cliffs, so that huge slices of the cliff face have slid down and forward , all shattered into a confused tumult of forms for a  or more along the cliff base.       Volcanic features occur in abundance in the Plateau province. Some of the high plateaus in the north are capped with remnants of heavy lava flows of early eruption. A group of large volcanoes occurs on the limestone platform south of the Grand Canyon, culminating in ": null
    },
    {
        "Mount San Francisco ": "humphreys peak"
    },
    {
        " ": null
    }
]