[
    {
        "International judicial institutions can be divided into ": null
    },
    {
        "court": "court"
    },
    {
        "s, arbitral ": null
    },
    {
        "tribunal": "tribunal"
    },
    {
        "s and ": null
    },
    {
        "quasi-judicial": "quasi-judicial body"
    },
    {
        " institutions. Courts are permanent bodies, with near the same composition for each case. Arbitral tribunals, by contrast, are constituted anew for each case. Both courts and arbitral tribunals can make binding decisions. Quasi-judicial institutions, by contrast, make rulings on cases, but these rulings are not in themselves legally binding; the main example is the individual complaints mechanisms available under the various UN human rights treaties.     Institutions can also be divided into global and regional institutions.     The listing below incorporates both currently existing institutions, defunct institutions that no longer exist, institutions which never came into existence due to non-ratification of their constitutive instruments, and institutions which do not yet exist, but for which constitutive instruments have been signed. It does not include mere proposed institutions for which no instrument was ever signed.       ": null
    },
    {
        "International Court of Justice": "international court of justice"
    },
    {
        " International Tribunal for the Law of the Sea": "international tribunal for the law of the sea"
    },
    {
        " International Criminal Tribunal for the Former Yugoslavia": "international criminal tribunal for the former yugoslavia"
    },
    {
        " International Criminal Tribunal for Rwanda": "international criminal tribunal for rwanda"
    },
    {
        " International Criminal Court": "international criminal court"
    },
    {
        " International Military Tribunal": "international military tribunal"
    },
    {
        "   International Military Tribunal for the Far East": "international military tribunal for the far east"
    },
    {
        "   International Prize Court": "international prize court"
    },
    {
        "   Permanent Court of International Justice": "permanent court of international justice"
    },
    {
        "       Permanent Court of Arbitration": "permanent court of arbitration"
    },
    {
        " WTO Appelate Body": "wto appelate body"
    },
    {
        " WTO Dispute Settlement Panels": "wto dispute settlement panels"
    },
    {
        " NAFTA Dispute Settlement Panels": "north american free trade agreement"
    },
    {
        " International Centre for the Settlement of Investment Disputes": "international centre for the settlement of investment disputes"
    },
    {
        " Court of Arbitration for Sport": "court of arbitration for sport"
    },
    {
        " OSCE Court of Conciliation and Arbitration": "organization for security and co-operation in europe"
    },
    {
        "          Human Rights Committee": "human rights committee"
    },
    {
        " Committee on the Elimination of Racial Discrimination": "committee on the elimination of racial discrimination"
    },
    {
        " Committee on the Elimination of Discrimination Against Women": "committee on the elimination of all forms of discrimination against women"
    },
    {
        " Committee on Economic, Social and Cultural Rights": "committee on economic, social and cultural rights"
    },
    {
        " Committee on the Rights of the Child": "committee on the rights of the child"
    },
    {
        " Committee Against Torture": "united nations convention against torturecommittee against torture"
    },
    {
        " Committee on Migrant Workers": "united on the protection of the rights of all migrant workers and members of their families"
    },
    {
        " Committee on the Rights of Persons with Disabilities": "convention on the rights of persons with disabilities"
    },
    {
        " African Court on Human and Peoples Rights": "african court on human and peoples rights"
    },
    {
        " Court of Justice of the African Union": "african court of justice"
    },
    {
        "   Court of Justice of the Common Market for Eastern and Southern Africa": "common market for eastern and southern africainstitutions"
    },
    {
        " Community Court of Justice of the Economic Community of West African States": "economic community of west african statesthe community court of justice"
    },
    {
        " East African Court of Justice": "east african court of justice"
    },
    {
        " Southern African Development Community Tribunal": "southern african development communitystructure and decision-making procedures"
    },
    {
        " Inter-American Court of Human Rights": "inter-american court of human rights"
    },
    {
        " Central American Court of Justice": "central american court of justice"
    },
    {
        " Court of Justice of the Andean Community": "andean community of nationsorganization"
    },
    {
        " Caribbean Court of Justice": "caribbean court of justice"
    },
    {
        " Eastern Caribbean Supreme Court": "eastern caribbean supreme court"
    },
    {
        " European Court of Justice": "european court of justice"
    },
    {
        " General Court": "general court"
    },
    {
        " European Court of Human Rights": "european court of human rights"
    },
    {
        " Court of Justice of the European Free Trade Agreement States": "efta court"
    },
    {
        " Benelux Court of Justice": "beneluxlaw"
    },
    {
        " Economic Court of the Commonwealth of Independent States": "economic court of the commonwealth of independent states"
    },
    {
        " European Nuclear Energy Tribunal": "european nuclear energy tribunal"
    },
    {
        "   Western European Union Tribunal": "western european union"
    },
    {
        "   European Tribunal in Matters of State Immunity": "european tribunal in matters of state immunity"
    },
    {
        "           ": null
    }
]