[
    {
        "   An Intergovernmental Conference  is the formal procedure for negotiating amendments to the founding treaties of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ". Under the treaties, an IGC is called into being by the ": null
    },
    {
        "European Council": "european council"
    },
    {
        ", and is composed of representatives of the member states, with the ": null
    },
    {
        "Commission": "european commission"
    },
    {
        ", and to a lesser degree the ": null
    },
    {
        "Parliament": "european parliament"
    },
    {
        " also participating.     An IGC will conclude with a meeting of the European Council, at which any political issues requiring resolution at the level of Heads of State or Government will be resolved, and final political agreement will be reached. A final treaty text in each of the community languages will then be prepared by the legal and linguistic experts of the member states, before being presented to the member states for signature and ratification.     There was much criticism of the functioning of this process in the negotiation of the ": null
    },
    {
        "Treaty of Nice": "treaty of nice"
    },
    {
        " in 42 especially in regard to the ": null
    },
    {
        "Nice European Council": "nice european council"
    },
    {
        " which concluded the IGC. The next IGC, due to meet in October 42 was prepared for by the ": null
    },
    {
        "Convention on the Future of Europe": "convention on the future of europe"
    },
    {
        ", which was modelled after the Convention which negotiated the ": null
    },
    {
        "Charter of Fundamental Rights": "charter of fundamental rights of the european union"
    },
    {
        ". One of the recommendations of the Convention is that a convention be used to prepare for future IGCs; this has now indeed been incorporated into the treaty as a requirement for future treaty revisions, unless the European Parliament decides that it is not necessary .   The European Council of 42–42 June 42 delivered to the Portuguese Presidency the mandate to call an IGC. Its objective was to draw up a Treaty amending the existing Treaties with a view to enhancing the efficiency and democratic legitimacy of the enlarged Union, as well as the coherence of its external action. The mandate provided the exclusive basis and framework for the work of and defines the timetable for completing this task. This IGC concluded its work on 42 October 42 presenting the ": null
    },
    {
        "Reform Treaty": "reform treaty"
    }
]