[
    {
        "        Interstellar travel is ": null
    },
    {
        "crewed": "Human Spaceflight"
    },
    {
        " or uncrewed travel between ": null
    },
    {
        "stars": "Star"
    },
    {
        "or ": null
    },
    {
        "planetary system": "Planetary System"
    },
    {
        "s. Interstellar travel will be much more difficult than ": null
    },
    {
        "interplanetary spaceflight": "Interplanetary Spaceflight"
    },
    {
        "; the distances between the ": null
    },
    {
        "planets": "Planet"
    },
    {
        "in the ": null
    },
    {
        "Solar System": "Solar System"
    },
    {
        " are less than 30 ": null
    },
    {
        "astronomical units": "Astronomical Unit"
    },
    {
        "—whereas the distances between stars are typically hundreds of thousands of AU, and usually expressed in ": null
    },
    {
        "light-year": "Light-Year"
    },
    {
        "s. Because of the vastness of those distances, interstellar travel would require a high percentage of the ": null
    },
    {
        "speed of light": "Speed Of Light"
    },
    {
        "; huge travel time, lasting from decades to millennia or longer.     The speeds required for interstellar travel in a human lifetime far exceed what current methods of ": null
    },
    {
        "spacecraft propulsion": "Spacecraft Propulsion"
    },
    {
        " can provide. Even with a hypothetically perfectly efficient propulsion system, the ": null
    },
    {
        "kinetic energy": "Kinetic Energy"
    },
    {
        " corresponding to those speeds is enormous by todays standards of ": null
    },
    {
        "energy development": "Energy Development"
    },
    {
        ". Moreover, collisions by the spacecraft with ": null
    },
    {
        "cosmic dust": "Cosmic Dust"
    },
    {
        " and gas can produce very dangerous effects both to passengers and the spacecraft itself.     A number of strategies have been proposed to deal with these problems, ranging from ": null
    },
    {
        "giant arks that would carry entire societies and ecosystems": "Generation Ship"
    },
    {
        ", to microscopic ": null
    },
    {
        "space probe": "Space Probe"
    },
    {
        "s. Many different ": null
    },
    {
        "spacecraft propulsion": "Spacecraft Propulsion"
    },
    {
        " systems have been proposed to give spacecraft the required speeds, including ": null
    },
    {
        "nuclear propulsion": "Nuclear Propulsion"
    },
    {
        ", ": null
    },
    {
        "beam-powered propulsion": "Beam-Powered Propulsion"
    },
    {
        ", and methods based on speculative physics.      For both crewed and uncrewed interstellar travel, considerable technological and economic challenges need to be met. Even the most optimistic views about interstellar travel see it as only being feasible decades from now. However, in spite of the challenges, if or when interstellar travel is realised, a wide range of scientific benefits is expected.      Most interstellar travel concepts require a developed space logistics system capable of moving millions of tons to a construction / operating location, and most would require gigawatt-scale power for construction or power . Such a system could grow organically if ": null
    },
    {
        "space-based solar power": "Space-Based Solar Power"
    },
    {
        " became a significant component of Earths energy mix. Consumer demand for a multi-terawatt system would automatically create the necessary multi-million ton/year logistical system. Conclusion of the 2016 Tennessee Valley Interstellar Workshop Space Solar Power Working Track run by Peter Garretson & Robert Kennedy.                Distances between the planets in the Solar System are often measured in astronomical units , defined as the average distance between the Sun and Earth, some . ": null
    },
    {
        "Venus": "Venus"
    },
    {
        ", the closest other planet to Earth is 0.28 AU away. ": null
    },
    {
        "Neptune": "Neptune"
    },
    {
        ", the farthest planet from the Sun, is 29.8 AU away. As of October 30, 2019, ": null
    },
    {
        "Voyager  1": "Voyager & Nbsp;1"
    },
    {
        ", the farthest human-made object from Earth, is 147.9 AU away.      The closest known star, ": null
    },
    {
        "Proxima Centauri": "Proxima Centauri"
    },
    {
        ", is approximately  away, or over 9,000 times farther away than Neptune.            Because of this, distances between stars are usually expressed in ": null
    },
    {
        "light-years": "Light-Year"
    },
    {
        "  or in ": null
    },
    {
        "parsecs": "Parsec"
    },
    {
        " . Light in a vacuum travels around  per second, so 1 light-year is about  or  AU. Proxima Centauri, the nearest star, is 4.243 light-years away.     Another way of understanding the vastness of interstellar distances is by scaling: One of the closest stars to the Sun, ": null
    },
    {
        "Alpha Centauri A": "Alpha Centauri A"
    },
    {
        " , can be pictured by scaling down the ": null
    },
    {
        "Earth–Sun distance": "Astronomical Unit"
    },
    {
        " to . On this scale, the distance to Alpha Centauri A would be  .     The fastest outward-bound spacecraft yet sent, ": null
    },
    {
        "Voyager 1": "Voyager 1Interstellar Mission"
    },
    {
        ", has covered 1/600 of a light-year in 30 years and is currently moving at 1/18,000 the speed of light. At this rate, a journey to Proxima Centauri would take 80,000 years.        A significant factor contributing to the difficulty is the energy that must be supplied to obtain a reasonable travel time. A lower bound for the required energy is the ": null
    },
    {
        "kinetic energy": "Kinetic Energy"
    },
    {
        " K \\tfracmv^2 where m is the final mass. If ": null
    },
    {
        "deceleration": "Deceleration"
    },
    {
        " on arrival is desired and cannot be achieved by any means other than the engines of the ship, then the lower bound for the required energy is doubled to mv^2 .      The velocity for a manned round trip of a few decades to even the nearest star is several thousand times greater than those of present space vehicles. This means that due to the v^2 term in the kinetic energy formula, millions of times as much energy is required. Accelerating one ton to one-tenth of the speed of light requires at least     , without factoring in efficiency of the propulsion mechanism. This energy has to be generated onboard from stored fuel, harvested from the interstellar medium, or projected over immense distances.       A knowledge of the properties of the ": null
    },
    {
        "interstellar gas and dust": "Interstellar Medium"
    },
    {
        " through which the vehicle must pass is essential for the design of any interstellar space mission. A major issue with traveling at extremely high speeds is that interstellar dust may cause considerable damage to the craft, due to the high relative speeds and large kinetic energies involved. Various shielding methods to mitigate this problem have been proposed.  Larger objects are far less common, but would be much more destructive. The risks of impacting such objects, and methods of mitigating these risks, have been discussed in literature, but many unknowns remain  and, owing to the inhomogeneous distribution of interstellar matter around the Sun, will depend on direction travelled.  Although a high density interstellar medium may cause difficulties for many interstellar travel concepts, ": null
    },
    {
        "interstellar ramjets": "Bussard Ramjet"
    },
    {
        ", and some proposed concepts for decelerating interstellar spacecraft, would actually benefit from a denser interstellar medium.       The crew of an interstellar ship would face several significant hazards, including the psychological effects of long-term ": null
    },
    {
        "isolation": "Solitude"
    },
    {
        ", the effects of exposure to ": null
    },
    {
        "ionizing radiation": "Ionizing Radiation"
    },
    {
        ", and the physiological effects of ": null
    },
    {
        "weightlessness": "Weightlessness"
    },
    {
        " to the muscles, joints, bones, immune system, and eyes. There also exists the risk of impact by ": null
    },
    {
        "micrometeoroids": "Micrometeoroid"
    },
    {
        "and other ": null
    },
    {
        "space debris": "Space Debris"
    },
    {
        ". These risks represent challenges that have yet to be overcome.        It has been argued that an interstellar mission that cannot be completed within 50 years should not be started at all. Instead, assuming that a civilization is still on an increasing curve of propulsion system velocity and not yet having reached the limit, the resources should be invested in designing a better propulsion system. This is because a slow spacecraft would probably be passed by another mission sent later with more advanced propulsion .     On the other hand, Andrew Kennedy has shown that if one calculates the journey time to a given destination as the rate of travel speed derived from growth increases, there is a clear minimum in the total time to that destination from now.  Voyages undertaken before the minimum will be overtaken by those that leave at the minimum, whereas voyages that leave after the minimum will never overtake those that left at the minimum.       There are 59 known ": null
    },
    {
        "stellar systems": "Stellar System"
    },
    {
        "within 40 light years of the Sun, containing 81 visible stars. The following could be considered prime targets for interstellar missions:           Existing and near-term astronomical technology is capable of finding planetary systems around these objects, increasing their potential for exploration              Slow interstellar missions based on current and near-future propulsion technologies are associated with trip times starting from about one hundred years to thousands of years. These missions consist of sending a robotic probe to a nearby star for exploration, similar to interplanetary probes such as used in the ": null
    },
    {
        "Voyager program": "Voyager Program"
    },
    {
        ".  By taking along no crew, the cost and complexity of the mission is significantly reduced although technology lifetime is still a significant issue next to obtaining a reasonable speed of travel. Proposed concepts include ": null
    },
    {
        "Project Daedalus": "Project Daedalus"
    },
    {
        ", ": null
    },
    {
        "Project Icarus": "Project Icarus"
    },
    {
        ", ": null
    },
    {
        "Project Dragonfly": "Project Dragonfly"
    },
    {
        ", ": null
    },
    {
        "Project Longshot": "Project Longshot"
    },
    {
        ",  and more recently ": null
    },
    {
        "Breakthrough Starshot": "Breakthrough Starshot"
    },
    {
        ".               Near-lightspeed nano spacecraft might be possible within the near future built on existing microchip technology with a newly developed nanoscale thruster. Researchers at the ": null
    },
    {
        "University of Michigan": "University Of Michigan"
    },
    {
        " are developing thrusters that use nanoparticles as propellant. Their technology is called nanoparticle field extraction thruster , or ": null
    },
    {
        "nanoFET": "Nano-Particle Field Extraction Thruster"
    },
    {
        ". These devices act like small particle accelerators shooting conductive nanoparticles out into space. Daniel H. Wilson. . msnbc.msn.com.     ": null
    },
    {
        "Michio Kaku": "Michio Kaku"
    },
    {
        ", a theoretical physicist, has suggested that clouds of smart dust be sent to the stars, which may become possible with advances in ": null
    },
    {
        "nanotechnology": "Nanotechnology"
    },
    {
        ". Kaku also notes that a large number of nanoprobes would need to be sent due to the vulnerability of very small probes to be easily deflected by magnetic fields, micrometeorites and other dangers to ensure the chances that at least one nanoprobe will survive the journey and reach the destination.      Given the light weight of these probes, it would take much less energy to accelerate them. With onboard solar cells, they could continually accelerate using solar power. One can envision a day when a fleet of millions or even billions of these particles swarm to distant stars at nearly the speed of light and relay signals back to Earth through a vast interstellar communication network.     As a near-term solution, small, laser-propelled interstellar probes, based on current CubeSat technology were proposed in the context of ": null
    },
    {
        "Project Dragonfly": "Project Dragonfly"
    },
    {
        ".       In crewed missions, the duration of a slow interstellar journey presents a major obstacle and existing concepts deal with this problem in different ways.  They can be distinguished by the state in which humans are transported on-board of the spacecraft.          A ": null
    },
    {
        "generation ship": "Generation Ship"
    },
    {
        "  is a type of ": null
    },
    {
        "interstellar ark": "Interstellar Ark"
    },
    {
        " in which the crew that arrives at the destination is descended from those who started the journey. Generation ships are not currently feasible because of the difficulty of constructing a ship of the enormous required scale and the great biological and sociological problems that life aboard such a ship raises.                Scientists and writers have postulated various techniques for ": null
    },
    {
        "suspended animation": "Suspended Animation"
    },
    {
        ". These include human ": null
    },
    {
        "hibernation": "Hibernation"
    },
    {
        " and ": null
    },
    {
        "cryonic preservation": "Cryonics"
    },
    {
        ". Although neither is currently practical, they offer the possibility of ": null
    },
    {
        "sleeper ships": "Sleeper Ship"
    },
    {
        "in which the passengers lie inert for the long duration of the voyage.           A ": null
    },
    {
        "robotic": "Robotic"
    },
    {
        " interstellar mission carrying some number of frozen early stage human ": null
    },
    {
        "embryos": "Embryo"
    },
    {
        "is another theoretical possibility. This method of ": null
    },
    {
        "space colonization": "Space Colonization"
    },
    {
        " requires, among other things, the development of an ": null
    },
    {
        "artificial uterus": "Artificial Uterus"
    },
    {
        ", the prior detection of a habitable ": null
    },
    {
        "terrestrial planet": "Terrestrial Planet"
    },
    {
        ", and advances in the field of fully autonomous ": null
    },
    {
        "mobile robots": "Robotics"
    },
    {
        " and educational robots that would replace human parents.        Interstellar space is not completely empty; it contains trillions of icy bodies ranging from small asteroids  to possible ": null
    },
    {
        "rogue planet": "Rogue Planet"
    },
    {
        "s. There may be ways to take advantage of these resources for a good part of an interstellar trip, slowly hopping from body to body or setting up waystations along the way.        If a spaceship could average 10  percent of light speed , this would be enough to reach ": null
    },
    {
        "Proxima Centauri": "Proxima Centauri"
    },
    {
        " in forty years. Several propulsion concepts have been proposed  that might be eventually developed to accomplish this , but none of them are ready for near-term developments at acceptable cost.            Physicists generally believe faster-than-light travel is impossible.   Relativistic ": null
    },
    {
        "time dilation": "Time Dilation"
    },
    {
        " allows a traveler to experience time more slowly, the closer their speed is to the speed of light.  This apparent slowing becomes noticeable when velocities above 80% of the speed of light are attained. Clocks aboard an interstellar ship would run slower than Earth clocks, so if a ships engines were capable of continuously generating around 1  g of acceleration , the ship could reach almost anywhere in the galaxy and return to Earth within 40 years ship-time . Upon return, there would be a difference between the time elapsed on the astronauts ship and the time elapsed on Earth.     For example, a spaceship could travel to a star 32 light-years away, initially accelerating at a constant 1.03g for 1.32 years , then stopping its engines and coasting for the next 17.3 years at a constant speed, then decelerating again for 1.32 ship-years, and coming to a stop at the destination. After a short visit, the astronaut could return to Earth the same way. After the full round-trip, the clocks on board the ship show that 40 years have passed, but according to those on Earth, the ship comes back 76 years after launch.     From the viewpoint of the astronaut, onboard clocks seem to be running normally. The star ahead seems to be approaching at a speed of 0.87 light years per ship-year. The universe would appear contracted along the direction of travel to half the size it had when the ship was at rest; the distance between that star and the Sun would seem to be 16 light years as measured by the astronaut.     At higher speeds, the time on board will run even slower, so the astronaut could travel to the center of the ": null
    },
    {
        "Milky Way": "Milky Way"
    },
    {
        " and back in 40 years ship-time. But the speed according to Earth clocks will always be less than 1 light year per Earth year, so, when back home, the astronaut will find that more than 60 thousand years will have passed on Earth.                 Regardless of how it is achieved, a propulsion system that could produce acceleration continuously from departure to arrival would be the fastest method of travel. A constant acceleration journey is one where the propulsion system accelerates the ship at a constant rate for the first half of the journey, and then decelerates for the second half, so that it arrives at the destination stationary relative to where it began. If this were performed with an acceleration similar to that experienced at the Earths surface, it would have the added advantage of producing artificial gravity for the crew. Supplying the energy required, however, would be prohibitively expensive with current technology. Crowell, Benjamin , Light and Matter Section 4.3     From the perspective of a planetary observer, the ship will appear to accelerate steadily at first, but then more gradually as it approaches the speed of light . It will undergo ": null
    },
    {
        "hyperbolic motion": "Hyperbolic Motion"
    },
    {
        ".  The ship will be close to the speed of light after about a year of accelerating and remain at that speed until it brakes for the end of the journey.     From the perspective of an onboard observer, the crew will feel a ": null
    },
    {
        "gravitational field": "Gravitational Field"
    },
    {
        " opposite the engines acceleration, and the universe ahead will appear to fall in that field, undergoing hyperbolic motion. As part of this, distances between objects in the direction of the ships motion will gradually contract until the ship begins to decelerate, at which time an onboard observers experience of the gravitational field will be reversed.     When the ship reaches its destination, if it were to exchange a message with its origin planet, it would find that less time had elapsed on board than had elapsed for the planetary observer, due to ": null
    },
    {
        "time dilation": "Time Dilation"
    },
    {
        " and ": null
    },
    {
        "length contraction": "Length Contraction"
    },
    {
        ".     The result is an impressively fast journey for the crew.           All rocket concepts are limited by the ": null
    },
    {
        "rocket equation": "Rocket Equation"
    },
    {
        ", which sets the characteristic velocity available as a function of exhaust velocity and mass ratio, the ratio of initial  to final  mass.     Very high ": null
    },
    {
        "specific power": "Power-To-Weight Ratio"
    },
    {
        ", the ratio of thrust to total vehicle mass, is required to reach interstellar targets within sub-century time-frames.  Some heat transfer is inevitable and a tremendous heating load must be adequately handled.     Thus, for interstellar rocket concepts of all technologies, a key engineering problem is limiting the heat transfer from the exhaust stream back into the vehicle.        A type of electric propulsion, spacecraft such as ": null
    },
    {
        "Dawn": "Dawn"
    },
    {
        " use an ": null
    },
    {
        "ion engine": "Ion Engine"
    },
    {
        ". In an ion engine, electric power is used to create charged particles of the propellant, usually the gas xenon, and accelerate them to extremely high velocities. The exhaust velocity of conventional rockets is limited by the chemical energy stored in the fuels molecular bonds, which limits the thrust to about 5  km/s. They produce a high thrust , but they have a low specific impulse, and that limits their top speed. By contrast, ion engines have low force, but the top speed in principle is limited only by the electrical power available on the spacecraft and on the gas ions being accelerated. The exhaust speed of the charged particles range from 15  km/s to 35  km/s.           ": null
    },
    {
        "Electrically powered spacecraft propulsion": "Electrically Powered Spacecraft Propulsion"
    },
    {
        " powered by a portable power-source, say a ": null
    },
    {
        "nuclear reactor": "Nuclear Reactor"
    },
    {
        ", producing only small accelerations, would take centuries to reach for example 15% of the ": null
    },
    {
        "velocity of light": "Velocity Of Light"
    },
    {
        ", thus unsuitable for interstellar flight during a single human lifetime.      ": null
    },
    {
        "Fission-fragment rockets": "Fission-Fragment Rocket"
    },
    {
        "use ": null
    },
    {
        "nuclear fission": "Nuclear Fission"
    },
    {
        " to create high-speed jets of fission fragments, which are ejected at speeds of up to . With fission, the energy output is approximately 0.1% of the total mass-energy of the reactor fuel and limits the effective exhaust velocity to about 5% of the velocity of light. For maximum velocity, the reaction mass should optimally consist of fission products, the ash of the primary energy source, so no extra reaction mass need be bookkept in the mass ratio.        Based on work in the late 1950s to the early 1960s, it has been technically possible to build spaceships with ": null
    },
    {
        "nuclear pulse propulsion": "Nuclear Pulse Propulsion"
    },
    {
        " engines, i.e. driven by a series of nuclear explosions. This propulsion system contains the prospect of very high ": null
    },
    {
        "specific impulse": "Specific Impulse"
    },
    {
        " and high ": null
    },
    {
        "specific power": "Power-To-Weight Ratio"
    },
    {
        ".      ": null
    },
    {
        "Project Orion": "Project Orion"
    },
    {
        " team member ": null
    },
    {
        "Freeman Dyson": "Freeman Dyson"
    },
    {
        " proposed in 1968 an interstellar spacecraft using nuclear pulse propulsion that used pure ": null
    },
    {
        "deuterium fusion": "Deuterium Fusion"
    },
    {
        " detonations with a very high fuel-": null
    },
    {
        "burnup": "Burnup"
    },
    {
        " fraction. He computed an exhaust velocity of 15,000  km/s and a 100,000-tonne space vehicle able to achieve a 20,000  km/s ": null
    },
    {
        "delta-v": "Delta-V"
    },
    {
        " allowing a flight-time to ": null
    },
    {
        "Alpha Centauri": "Alpha Centauri"
    },
    {
        " of 130 years.  Later studies indicate that the top cruise velocity that can theoretically be achieved by a Teller-Ulam thermonuclear unit powered Orion starship, assuming no fuel is saved for slowing back down, is about 8% to 10% of the speed of light . Cosmos by Carl Sagan An atomic Orion can achieve perhaps 3%-5% of the speed of light. A nuclear pulse drive starship powered by fusion-antimatter catalyzed nuclear pulse propulsion units would be similarly in the 10% range and pure matter-antimatter annihilation rockets would be theoretically capable of obtaining a velocity between 50% to 80% of the speed of light. In each case saving fuel for slowing down halves the maximum speed. The concept of using a ": null
    },
    {
        "magnetic sail": "Magnetic Sail"
    },
    {
        " to decelerate the spacecraft as it approaches its destination has been discussed as an alternative to using propellant, this would allow the ship to travel near the maximum theoretical velocity.  Alternative designs utilizing similar principles include ": null
    },
    {
        "Project Longshot": "Project Longshot"
    },
    {
        ", ": null
    },
    {
        "Project Daedalus": "Project Daedalus"
    },
    {
        ", and ": null
    },
    {
        "Mini-Mag Orion": "Mini-Mag Orion"
    },
    {
        ". The principle of external nuclear pulse propulsion to maximize survivable power has remained common among serious concepts for interstellar flight without external power beaming and for very high-performance interplanetary flight.     In the 1970s the Nuclear Pulse Propulsion concept further was refined by ": null
    },
    {
        "Project Daedalus": "Project Daedalus"
    },
    {
        " by use of externally triggered ": null
    },
    {
        "inertial confinement fusion": "Inertial Confinement Fusion"
    },
    {
        ", in this case producing fusion explosions via compressing fusion fuel pellets with high-powered electron beams. Since then, ": null
    },
    {
        "laser": "Laser"
    },
    {
        "s, ": null
    },
    {
        "ion beam": "Ion Beam"
    },
    {
        "s, ": null
    },
    {
        "neutral particle beams": "Neutral Particle Beam"
    },
    {
        "and hyper-kinetic projectiles have been suggested to produce nuclear pulses for propulsion purposes.      A current impediment to the development of any nuclear-explosion-powered spacecraft is the ": null
    },
    {
        "1963 Partial Test Ban Treaty": "Partial Test Ban Treaty"
    },
    {
        ", which includes a prohibition on the detonation of any nuclear devices in outer space. This treaty would, therefore, need to be renegotiated, although a project on the scale of an interstellar mission using currently foreseeable technology would probably require international cooperation on at least the scale of the ": null
    },
    {
        "International Space Station": "International Space Station"
    },
    {
        ".     Another issue to be considered, would be the ": null
    },
    {
        "g-forces": "G-Force"
    },
    {
        "imparted to a rapidly accelerated spacecraft, cargo, and passengers inside .       ": null
    },
    {
        "Fusion rocket": "Fusion Rocket"
    },
    {
        " starships, powered by ": null
    },
    {
        "nuclear fusion": "Nuclear Fusion"
    },
    {
        " reactions, should conceivably be able to reach speeds of the order of 10% of that of light, based on energy considerations alone. In theory, a large number of stages could push a vehicle arbitrarily close to the speed of light. These would burn such light element fuels as deuterium, tritium, 3 He, 11 B, and 7 Li. Because fusion yields about 0.3–0.9% of the mass of the nuclear fuel as released energy, it is energetically more favorable than fission, which releases  300  km/s with an acceleration of ~1.7•10 −3 g, with a ship initial mass of ~1700 metric tons, and payload fraction above 10%. Although these are still far short of the requirements for interstellar travel on human timescales, the study seems to represent a reasonable benchmark towards what may be approachable within several decades, which is not impossibly beyond the current state-of-the-art. Based on the concepts 2.2% ": null
    },
    {
        "burnup": "Burnup"
    },
    {
        " fraction it could achieve a pure fusion product exhaust velocity of ~3,000  km/s.             An ": null
    },
    {
        "antimatter rocket": "Antimatter Rocket"
    },
    {
        " would have a far higher energy density and specific impulse than any other proposed class of rocket. If energy resources and efficient production methods are found to make ": null
    },
    {
        "antimatter": "Antimatter"
    },
    {
        " in the quantities required and store   it safely, it would be theoretically possible to reach speeds of several tens of percent that of light. Whether antimatter propulsion could lead to the higher speeds  ref name crawist /  sup /sup ref name crawist /  sup /sup  ref name AA-20120821  /ref  ref name geoffreylandis.com  /ref  ref name crawist / ref  /ref  ref  /ref  ref  /ref ref  /ref ref  /ref ref  /ref  ref name Forward1984RoundtripInterstellar  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  /ref   /ref  ref name Interstellar rendezvous missions employing fission propulsion systems  /ref  ref name crawftl  /ref  ref  /ref  ref name crawftl /  ref name Warp Alcubierre  /ref  ref name Warp Alcubierre /  ref name cranewestmoreland2009  /ref ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref ref name NASAWarpDriveBreakthruTechs  /ref  ref name Malik20020319  /ref  ref  /ref  ref name icarusinterstellar.org  /ref  ref  /ref  ref  /ref  ref  /ref  ref name Starshot home  /ref ref name concept  /ref ref  /ref  ref  /ref  ref  /ref  ref name icarusinterstellar.org /  ref name   /ref ref  /ref ref  /ref ref name O’Neill  /ref ref name O’Neill / ref name Odenwald  /ref  ref  /ref ref  /ref  ref  /ref math /math math /math  ref  /ref  ref name NASA Press Release Feb 22nd 2017 ": null
    }
]