[
    {
        "   The Internet Protocol  is the principal ": null
    },
    {
        "communications protocol": "communications protocol"
    },
    {
        " in the ": null
    },
    {
        "Internet protocol suite": "internet protocol suite"
    },
    {
        " for relaying ": null
    },
    {
        "datagrams": "datagram"
    },
    {
        "across network boundaries. Its ": null
    },
    {
        "routing": "routing"
    },
    {
        " function enables ": null
    },
    {
        "internetworking": "internetworking"
    },
    {
        ", and essentially establishes the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ".     IP has the task of delivering ": null
    },
    {
        "packets": "packet"
    },
    {
        " from the source ": null
    },
    {
        "host": "host"
    },
    {
        " to the destination host solely based on the ": null
    },
    {
        "IP address": "ip address"
    },
    {
        "es in the packet ": null
    },
    {
        "headers": "header"
    },
    {
        ". For this purpose, IP defines packet structures that ": null
    },
    {
        "encapsulate": "encapsulation"
    },
    {
        " the data to be delivered. It also defines addressing methods that are used to label the datagram with source and destination information.     Historically, IP was the ": null
    },
    {
        "connectionless": "connectionless communication"
    },
    {
        " datagram service in the original Transmission Control Program introduced by ": null
    },
    {
        "Vint Cerf": "vint cerf"
    },
    {
        " and ": null
    },
    {
        "Bob Kahn": "bob kahn"
    },
    {
        " in 1974, which was complemented by a connection-oriented service that became the basis for the ": null
    },
    {
        "Transmission Control Protocol": "transmission control protocol"
    },
    {
        " . The Internet protocol suite is therefore often referred to as TCP/IP.     The first major version of IP, ": null
    },
    {
        "Internet Protocol Version 4": "ipv4"
    },
    {
        " , is the dominant protocol of the Internet. Its successor is ": null
    },
    {
        "Internet Protocol Version 6": "ipv6"
    },
    {
        " , which has been in increasing ": null
    },
    {
        "deployment": "ipv6 deployment"
    },
    {
        " on the public Internet since c. 2006.          The Internet Protocol is responsible for addressing ": null
    },
    {
        "host interface": "host interface"
    },
    {
        "s, encapsulating data into datagrams  and routing datagrams from a source host interface to a destination host interface across one or more IP networks.  For these purposes, the Internet Protocol defines the format of packets and provides an addressing system.     Each datagram has two components: a ": null
    },
    {
        "header": "header"
    },
    {
        " and a ": null
    },
    {
        "payload": "payload"
    },
    {
        ". The ": null
    },
    {
        "IP header": "ip header"
    },
    {
        " includes source IP address, destination IP address, and other metadata needed to route and deliver the datagram. The payload is the data that is transported. This method of nesting the data payload in a packet with a header is called encapsulation.     IP addressing entails the assignment of IP addresses and associated parameters to host interfaces. The address space is divided into ": null
    },
    {
        "subnetwork": "subnetwork"
    },
    {
        "s, involving the designation of network prefixes. IP routing is performed by all hosts, as well as ": null
    },
    {
        "routers": "router"
    },
    {
        ", whose main function is to transport packets across network boundaries. Routers communicate with one another via specially designed ": null
    },
    {
        "routing protocol": "routing protocol"
    },
    {
        "s, either ": null
    },
    {
        "interior gateway protocols": "interior gateway protocol"
    },
    {
        "or ": null
    },
    {
        "exterior gateway protocol": "exterior gateway protocol"
    },
    {
        "s, as needed for the topology of the network.          In May 1974, the ": null
    },
    {
        "Institute of Electrical and Electronics Engineers": "institute of electrical and electronics engineers"
    },
    {
        " published a paper entitled A Protocol for Packet Network Intercommunication . Vinton G. Cerf, Robert E. Kahn, A Protocol for Packet Network Intercommunication , IEEE Transactions on Communications, Vol. 22, No. 5, May 1974 pp. 637–648 The papers authors, ": null
    },
    {
        "Vint Cerf": "vint cerf"
    },
    {
        " and ": null
    },
    {
        "Bob Kahn": "bob kahn"
    },
    {
        ", described an ": null
    },
    {
        "internetworking": "internetworking"
    },
    {
        " protocol for sharing resources using ": null
    },
    {
        "packet switching": "packet switching"
    },
    {
        " among ": null
    },
    {
        "network node": "network node"
    },
    {
        "s. A central control component of this model was the Transmission Control Program that incorporated both connection-oriented links and datagram services between hosts. The monolithic Transmission Control Program was later divided into a modular architecture consisting of the ": null
    },
    {
        "Transmission Control Protocol": "transmission control protocol"
    },
    {
        " and ": null
    },
    {
        "User Datagram Protocol": "user datagram protocol"
    },
    {
        " at the ": null
    },
    {
        "transport layer": "transport layer"
    },
    {
        " and the Internet Protocol at the ": null
    },
    {
        "internet layer": "internet layer"
    },
    {
        ". The model became known as the Department of Defense Internet Model and  Internet protocol suite , and informally as TCP/IP.     IP versions 0 to 3 were experimental versions, used between 1977 and 1979. The following ": null
    },
    {
        "Internet Experiment Note": "internet experiment note"
    },
    {
        " documents describe versions of the Internet Protocol prior to the modern version of IPv4:    , dated August 1977 describes the need to separate the TCP and Internet Protocol functionalities It proposes the first version of the IP header, using 0 for the version field.    , dated February 1978 describes a version of the IP header that uses a 1-bit version field.    , dated February 1978 describes IPv2.    , dated June 1978 describes the first protocol to be called IPv4. The IP header is different from the modern IPv4 header.    , dated June 1978 describes another version of IPv4, also with a header different from the modern IPv4 header.    , dated September 1978 is the first description of IPv4 using the header that would be standardized in .     The dominant internetworking protocol in the ": null
    },
    {
        "Internet Layer": "internet layer"
    },
    {
        " in use is ": null
    },
    {
        "IPv4": "ipv4"
    },
    {
        "; the number 4 is the protocol version number carried in every IP datagram. IPv4 is described in  .     Version number 5 was used by the ": null
    },
    {
        "Internet Stream Protocol": "internet stream protocol"
    },
    {
        ", an experimental streaming protocol.     The successor to IPv4 is ": null
    },
    {
        "IPv6": "ipv6"
    },
    {
        ". IPv6 was a result of several years of experimentation and dialog during which various protocol models were proposed, such as TP/IX , PIP  and TUBA . Its most prominent difference from version 4 is the size of the addresses. While IPv4 uses ": null
    },
    {
        "32 bits": "32-bit"
    },
    {
        " for addressing, yielding c. 4.3 ": null
    },
    {
        "billion": "1,000,000,000"
    },
    {
        "  addresses, IPv6 uses ": null
    },
    {
        "128-bit": "128-bit"
    },
    {
        " addresses providing ca. 340 ": null
    },
    {
        "undecillion": "undecillion"
    },
    {
        ", or  addresses. Although adoption of IPv6 has been slow, , all ": null
    },
    {
        "United States government": "united states government"
    },
    {
        " systems have demonstrated basic infrastructure support for IPv6.  , gcn.com     The assignment of the new protocol as IPv6 was uncertain until due diligence revealed that IPv6 had not yet been used previously.  Other Internet Layer protocols have been assigned version numbers,  such as 7 , 8 and 9 . Notably, on April 1, 1994, the ": null
    },
    {
        "IETF": "ietf"
    },
    {
        " published an ": null
    },
    {
        "April Fools Day": "april fools day"
    },
    {
        " joke about IPv9. : A Historical Perspective On The Usage Of IP Version 9. April 1, 1994.       The design of the Internet protocol suite adheres to the ": null
    },
    {
        "end-to-end principle": "end-to-end principle"
    },
    {
        ", a concept adapted from the ": null
    },
    {
        "CYCLADES": "cyclades"
    },
    {
        " project. Under the end-to-end principle, the network infrastructure is considered inherently unreliable at any single network element or transmission medium and is dynamic in terms of availability of links and nodes. No central monitoring or performance measurement facility exists that tracks or maintains the state of the network. For the benefit of reducing ": null
    },
    {
        "network complexity": "network complexity"
    },
    {
        ", the intelligence in the network is purposely located in the ": null
    },
    {
        "end node": "end node"
    },
    {
        "s.     As a consequence of this design, the Internet Protocol only provides ": null
    },
    {
        "best-effort delivery": "best-effort delivery"
    },
    {
        " and its service is characterized as ": null
    },
    {
        "unreliable": "reliability"
    },
    {
        ". In network architectural language, it is a ": null
    },
    {
        "connectionless protocol": "connectionless protocol"
    },
    {
        ", in contrast to ": null
    },
    {
        "connection-oriented communication": "connection-oriented communication"
    },
    {
        ". Various error conditions may occur, such as ": null
    },
    {
        "data corruption": "data corruption"
    },
    {
        ", ": null
    },
    {
        "packet loss": "packet loss"
    },
    {
        " and duplication. Because routing is dynamic, meaning every packet is treated independently, and because the network maintains no state based on the path of prior packets, different packets may be routed to the same destination via different paths, resulting in ": null
    },
    {
        "out-of-order delivery": "out-of-order delivery"
    },
    {
        " to the receiver.     All error conditions in the network must be detected and compensated by the participating end nodes. The ": null
    },
    {
        "upper layer protocols": "upper layer protocol"
    },
    {
        "of the Internet protocol suite are responsible for resolving reliability issues. For example, a host may ": null
    },
    {
        "buffer": "data buffer"
    },
    {
        " network data to ensure correct ordering before the data is delivered to an application.     IPv4 provides safeguards to ensure that the header of an IP packet is error-free. A routing node discards packets that fail a header ": null
    },
    {
        "checksum": "checksum"
    },
    {
        " test. Although the ": null
    },
    {
        "Internet Control Message Protocol": "internet control message protocol"
    },
    {
        " provides notification of errors, a routing node is not required to notify either end node of errors. IPv6, by contrast, operates without header checksums, since current ": null
    },
    {
        "link layer": "link layer"
    },
    {
        " technology is assumed to provide sufficient error detection.  section 6.2        The dynamic nature of the Internet and the diversity of its components provide no guarantee that any particular path is actually capable of, or suitable for, performing the data transmission requested. One of the technical constraints is the size of data packets allowed on a given link. Facilities exist to examine the ": null
    },
    {
        "maximum transmission unit": "maximum transmission unit"
    },
    {
        " size of the local link and ": null
    },
    {
        "Path MTU Discovery": "path mtu discovery"
    },
    {
        " can be used for the entire intended path to the destination.     The IPv4 internetworking layer has the ability to automatically ": null
    },
    {
        "fragment": "ip fragmentation"
    },
    {
        " the original datagram into smaller units for transmission. In this case, IP provides re-ordering of fragments delivered out of order. Siyan, Karanjit. Inside TCP/IP, New Riders Publishing, 1997.  An IPv6 network does not perform fragmentation or reassembly, and as per the ": null
    },
    {
        "end-to-end principle": "end-to-end principle"
    },
    {
        ", requires end stations and higher-layer protocols to avoid exceeding the networks MTU.      The ": null
    },
    {
        "Transmission Control Protocol": "transmission control protocol"
    },
    {
        " is an example of a protocol that adjusts its segment size to be smaller than the MTU. The ": null
    },
    {
        "User Datagram Protocol": "user datagram protocol"
    },
    {
        " and ICMP disregard MTU size, thereby forcing IP to fragment oversized datagrams.        During the design phase of the ARPANET and the early Internet, the security aspects and needs of a public, international network could not be adequately anticipated. Consequently, many Internet protocols exhibited vulnerabilities highlighted by network attacks and later security assessments. In 2008, a thorough security assessment and proposed mitigation of problems was published.  The IETF has been pursuing further studies. ": null
    }
]