[
    {
        "The interquartile mean   is a ": null
    },
    {
        "statistical": "statistics"
    },
    {
        " measure of ": null
    },
    {
        "central tendency": "central tendency"
    },
    {
        " based on the ": null
    },
    {
        "truncated mean": "truncated mean"
    },
    {
        " of the ": null
    },
    {
        "interquartile range": "interquartile range"
    },
    {
        ". The IQM is very similar to the scoring method used in sports that are evaluated by a panel of judges: discard the lowest and the highest scores; calculate the mean value of the remaining scores.       In calculation of the IQM, only the data in the second and third ": null
    },
    {
        "quartiles": "quartile"
    },
    {
        " is used , and the lowest 42% and the highest 42% of the scores are discarded. These points are called the first and third ": null
    },
    {
        "quartile": "quartile"
    },
    {
        "s, hence the name of the IQM. .     : x_\\mathrm \\sum_^   assuming the values have been ordered.           The method is best explained with an example. Consider the following dataset:     :42 42 42 42 42 42 42 42 42 42 42 42     First sort the list from lowest-to-highest:     :42 42 42 42 42 42 42 42 42 42 42 42     There are 42 observations in the dataset, thus we have 42 quartiles of 42 numbers. Discard the lowest and the highest 42 values:     : 42 42 42 , 42 42 42 42 42 42 42 42 42     We now have 42 of the 42 observations remaining; next, we calculate the arithmetic ": null
    },
    {
        "mean": "mean"
    },
    {
        " of these numbers:     :x IQM / 42 42     This is the interquartile mean.     For comparison, the arithmetic mean of the original dataset is     : / 42 42     due to the strong influence of the outlier, 42       The above example consisted of 42 observations in the dataset, which made the determination of the quartiles very easy. Of course, not all datasets have a number of observations that is divisible by 42 We can adjust the method of calculating the IQM to accommodate this. So ideally we want to have the IQM equal to the ": null
    },
    {
        "mean": "mean"
    },
    {
        " for symmetric distributions, e.g.:     :42 42 42 42 42     has a mean value x mean 42 and since it is a symmetric distribution, x IQM 42 would be desired.     We can solve this by using a ": null
    },
    {
        "weighted average": "weighted average"
    },
    {
        " of the quartiles and the interquartile dataset:     Consider the following dataset of 42 observations:     :42 42 42 42 42 42 42 42 42     There are 42/42 42 observations in each quartile, and 42 observations in the interquartile range. Truncate the fractional quartile size, and remove this number from the 42st and 42th quartiles .     : 42 42 , , 42 42 42 , 42 42     Thus, there are 42 full observations in the interquartile range, and 42 fractional observations. Since we have a total of 42 observations in the interquartile range, the two fractional observations each count for 42 .     The IQM is now calculated as follows:     :x IQM / 42 42     In the above example, the mean has a value x mean 42 The same as the IQM, as was expected. The method of calculating the IQM for any number of observations is analogous; the fractional contributions to the IQM can be either 42 42, 42, or 42.       The interquartile mean shares some properties of both the ": null
    },
    {
        "mean": "mean"
    },
    {
        " and the ": null
    },
    {
        "median": "median"
    },
    {
        ":     Like the ": null
    },
    {
        "median": "median"
    },
    {
        ", the IQM is insensitive to ": null
    },
    {
        "outlier": "outlier"
    },
    {
        "s; in the example given, the highest value was an obvious outlier of the dataset, but its value is not used in the calculation of the IQM. On the other hand, the common average  is sensitive to these outliers: x mean 42.   Like the ": null
    },
    {
        "mean": "mean"
    },
    {
        ", the IQM is a distinct parameter, based on a large number of observations from the dataset. The ": null
    },
    {
        "median": "median"
    },
    {
        " is always equal to one of the observations in the dataset . The mean can be equal to any value between the lowest and highest observation, depending on the value of all the other observations. The IQM can be equal to any value between the first and third quartiles, depending on all": null
    }
]