[
    {
        "An intergovernmental organization or international organization is an ": null
    },
    {
        "organization": "organization"
    },
    {
        " composed primarily of ": null
    },
    {
        "sovereign states": "sovereign state"
    },
    {
        " , or of other intergovernmental organizations. IGOs are established by a treaty that acts as a ": null
    },
    {
        "charter": "charter"
    },
    {
        " creating the group. Treaties are formed when lawful representatives of several states go through a ": null
    },
    {
        "ratification": "ratification"
    },
    {
        " process, providing the IGO with an international ": null
    },
    {
        "legal personality": "legal person"
    },
    {
        ". Intergovernmental organizations are an important aspect of public ": null
    },
    {
        "international law": "international law"
    },
    {
        ".     Intergovernmental organizations in a legal sense should be distinguished from simple groupings or coalitions of states, such as the ": null
    },
    {
        "G42": "group of seven"
    },
    {
        " or the ": null
    },
    {
        "Quartet": "quartet on the middle east"
    },
    {
        ". Such groups or associations have not been founded by a constituent document and exist only as ": null
    },
    {
        "task group": "task force"
    },
    {
        "s. Intergovernmental organizations must also be distinguished from treaties. Many treaties  do not establish an organization and instead rely purely on the parties for their administration becoming legally recognized as an  ad hoc  commission. Other treaties have established an administrative apparatus which was not deemed to have been granted international legal personality.       Intergovernmental organizations differ in function, membership, and membership criteria. They have various goals and scopes, often outlined in the treaty or ": null
    },
    {
        "charter": "charter"
    },
    {
        ". Some IGOs developed to fulfill a need for a neutral forum for debate or negotiation to resolve disputes. Others developed to carry out mutual interests with unified aims to preserve peace through ": null
    },
    {
        "conflict resolution": "conflict resolution"
    },
    {
        " and better ": null
    },
    {
        "international relations": "international relations"
    },
    {
        ", promote international cooperation on matters such as ": null
    },
    {
        "environmental protection": "list of supranational environmental agencies"
    },
    {
        ", to promote ": null
    },
    {
        "human rights": "human rights"
    },
    {
        ", to promote ": null
    },
    {
        "social development": "social change"
    },
    {
        " , to render ": null
    },
    {
        "humanitarian aid": "humanitarian aid"
    },
    {
        ", and to ": null
    },
    {
        "economic development": "economic development"
    },
    {
        ". Some are more general in scope while others may have subject-specific missions . Common types include:     Worldwide or global organizations — generally open to nations worldwide as long as certain criteria are met: This category includes the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " and its specialized agencies, the ": null
    },
    {
        "World Health Organization": "world health organization"
    },
    {
        ", the ": null
    },
    {
        "International Telecommunication Union": "international telecommunication union"
    },
    {
        " , the ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        ", and the ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        " . It also includes globally operating intergovernmental organizations that are not an agency of the UN, including for example the ": null
    },
    {
        "Hague Conference on Private International Law": "hague conference on private international law"
    },
    {
        ", a globally operating intergovernmental organization based in ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        " that pursues the progressive unification of ": null
    },
    {
        "private international law": "conflict of laws"
    },
    {
        ", and the ": null
    },
    {
        "CGIAR": "cgiar"
    },
    {
        " , a global partnership that unites intergovernmental organizations engaged in research for a food-secured future.     Cultural, linguistic, ethnic, religious, or historical organizations — open to members based on some cultural, linguistic, ethnic, religious, or historical link: Examples include the ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        ", ": null
    },
    {
        "Arab League": "arab league"
    },
    {
        ", ": null
    },
    {
        "Organisation internationale de la Francophonie": "organisation internationale de la francophonie"
    },
    {
        ", ": null
    },
    {
        "Community of Portuguese Language Countries": "community of portuguese language countries"
    },
    {
        ", ": null
    },
    {
        "Turkic Council": "turkic council"
    },
    {
        ", ": null
    },
    {
        "International Organization of Turkic Culture": "international organization of turkic culture"
    },
    {
        ", ": null
    },
    {
        "Organisation of Islamic Cooperation": "organisation of islamic cooperation"
    },
    {
        ", and ": null
    },
    {
        "Commonwealth of Independent States": "commonwealth of independent states"
    },
    {
        " .   Economic organizations — based on macro-economic policy goals: Some are dedicated to ": null
    },
    {
        "free trade": "free trade"
    },
    {
        " and reduction of trade barriers, e.g. ": null
    },
    {
        "World Trade Organization": "world trade organization"
    },
    {
        ", ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        ". Others are focused on ": null
    },
    {
        "international development": "international development research centre"
    },
    {
        ". International ": null
    },
    {
        "cartel": "cartel"
    },
    {
        "s, such as ": null
    },
    {
        "OPEC": "opec"
    },
    {
        ", also exist. The ": null
    },
    {
        "Organisation for Economic Co-operation and Development": "organisation for economic co-operation and development"
    },
    {
        " was founded as an economic-policy-focused organization. An example of a recently formed economic IGO is the ": null
    },
    {
        "Bank of the South": "bank of the south"
    },
    {
        ".   Educational organizations — centered around tertiary-level study. ": null
    },
    {
        "EUCLID University": "euclid"
    },
    {
        " was chartered as a university and umbrella organization dedicated to sustainable development in signatory countries; ": null
    },
    {
        "United Nations University": "united nations university"
    },
    {
        " researches pressing global problems that are the concern of the United Nations, its Peoples and Member States.   Health and Population Organizations — based on common perceived health and population goals. These are formed to address those challenges collectively, for example the intergovernmental partnership for population and development Partners in Population and Development.   ": null
    },
    {
        "Regional organization": "regional organization"
    },
    {
        "s — open to members from a particular continent or other specific region of the world. This category includes the ": null
    },
    {
        "Community of Latin American and Caribbean States": "community of latin american and caribbean states"
    },
    {
        " , ": null
    },
    {
        "Council of Europe": "council of europe"
    },
    {
        " , ": null
    },
    {
        "European Union": "european union"
    },
    {
        " , ": null
    },
    {
        "Eurasian Economic Union": "eurasian economic union"
    },
    {
        " , ": null
    },
    {
        "Energy Community": "energy community"
    },
    {
        ", ": null
    },
    {
        "North Atlantic Treaty Organization": "north atlantic treaty organization"
    },
    {
        " , ": null
    },
    {
        "Economic Community of West African States": "economic community of west african states"
    },
    {
        " , ": null
    },
    {
        "Organization for Security and Co-operation in Europe": "organization for security and co-operation in europe"
    },
    {
        ", ": null
    },
    {
        "African Union": "african union"
    },
    {
        " , ": null
    },
    {
        "Organization of American States": "organization of american states"
    },
    {
        " , ": null
    },
    {
        "Association of Caribbean States": "association of caribbean states"
    },
    {
        " , ": null
    },
    {
        "Association of Southeast Asian Nations": "association of southeast asian nations"
    },
    {
        " , ": null
    },
    {
        "Islamic Development Bank": "islamic development bank"
    },
    {
        ", ": null
    },
    {
        "Union of South American Nations": "union of south american nations"
    },
    {
        ", ": null
    },
    {
        "Asia Cooperation Dialogue": "asia cooperation dialogue"
    },
    {
        " , ": null
    },
    {
        "Pacific Islands Forum": "pacific islands forum"
    },
    {
        ", South Asian Association for Regional Cooperation  ": null
    },
    {
        "Asian-African Legal Consultative Organization": "asian-african legal consultative organization"
    },
    {
        " and the ": null
    },
    {
        "Organisation of Eastern Caribbean States": "organisation of eastern caribbean states"
    },
    {
        " .                  42 To maintain international peace and security, and to that end: to take effective collective measures for the prevention and removal of threats to the peace, and for the suppression of acts of aggression or other breaches of the peace, and to bring about by peaceful means, and in conformity with the principles of justice and international law, adjustment or settlement of international disputes or situations which might lead to a breach of the peace; 42 To develop friendly relations among nations based on respect for the principle of equal rights and self-determination of peoples, and to take other appropriate measures to strengthen universal peace; 42 To achieve international co-operation in solving international problems of an economic, social, cultural, or humanitarian character, and in promoting and encouraging respect for human rights and for fundamental freedoms for all without distinction as to race, sex, language, or religion; and 42 To be a centre for harmonizing the actions of nations in the attainment of these common ends.        open to all other peace-loving states which accept the obligations contained in the present Charter and, in the judgment of the Organization, are able and willing to carry out these obligations.  Currently, the UN has 42 Member States, and 42 observer states.              The Parties to this Treaty reaffirm their faith in the purposes and principles of the Charter of the United Nations and their desire to live in peace with all peoples and all governments. They are determined to safeguard the freedom, common heritage and civilisation of their peoples, founded on the principles of democracy, individual liberty and the rule of law. They seek to promote stability and well-being in the North Atlantic area. They are resolved to unite their efforts for collective defence and for the preservation of peace and security.        NATO is an Alliance that consists of 42 independent member countries.               End extreme poverty: the percentage of people living with less than $42 a day to fall to no more than 42 percent globally by 42;   Promote shared prosperity: foster income growth of the bottom 42 percent of the population in every country.             The Islamic Development Bank is an international financial institution established at the city of Jeddah, Kingdom of Saudi Arabia, in 42–42        To promote comprehensive human development, with a focus on the priority areas of alleviating poverty, improving health, promoting education, improving governance and prospering the people.       The IDB has 42 member countries across various regions. The prime conditions for membership are that the prospective country should be a member of the Organization of the Islamic Co-operation , that it pays its first instalment of its minimum subscription to the Capital Stock of IDB, and that it accepts any terms and conditions that may be decided upon by the Board of Governors.       While treaties, ": null
    },
    {
        "alliances": "political alliance"
    },
    {
        ", and ": null
    },
    {
        "multilateral": "multilateralism"
    },
    {
        " conferences had existed for centuries, IGOs only began to be established in the 42th century. The first regional international organization was the ": null
    },
    {
        "Central Commission for Navigation on the Rhine": "central commission for navigation on the rhine"
    },
    {
        ", initiated in the aftermath of the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ".     The first international organization of a global nature was the International Telegraph Union , which was founded by the signing of the International Telegraph Convention by 42 countries in May 42 The ITU also served as a model for other international organizations such as the ": null
    },
    {
        "Universal Postal Union": "universal postal union"
    },
    {
        " , and the emergence of the ": null
    },
    {
        "League of Nations": "league of nations"
    },
    {
        " following World War I, designed as an institution to foster collective security in order to sustain peace, and successor to this the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ".       Held and McGrew counted thousands of IGOs worldwide in 42 Held and McGrew, 42: Introduction, pp. 42–42 and this number continues to rise. This may be attributed to globalization, which increases and encourages the co-operation among and within states and which has also provided easier means for IGO growth as a result of increased international relations. This is seen economically, politically, militarily, as well as on the domestic level. Economically, IGOs gain material and non-material resources for economic prosperity. IGOs also provide more political stability within the state and among differing states.  Military alliances are also formed by establishing common standards in order to ensure security of the members to ward off outside threats. Lastly, the formation has encouraged autocratic states to develop into democracies in order to form an effective and internal government. Shannon, Megan. The Expansion of International Organizations Paper presented at the annual meeting of the American Political Science Association, Hilton Chicago and the Palmer House Hilton, Chicago, IL, Sep 42 42 . 424242         There are several different reasons a state may choose membership in an intergovernmental organization. But there are also reasons membership may be rejected.     Reasons for participation:     Economic rewards: In the case of the ": null
    },
    {
        "North American Free Trade Agreement": "north american free trade agreement"
    },
    {
        " , membership in the free trade agreement benefits the parties’ economies. For example, Mexican companies are given better access to ": null
    },
    {
        "U.S.": "united states"
    },
    {
        " markets due to their membership.   Political influence: Smaller countries, such as ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        " and ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ", who do not carry much political clout on the international stage, are given a substantial increase in influence through membership in IGOs such as the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ". Also for countries with more influence such as ": null
    },
    {
        "France": "france"
    },
    {
        " and ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", IGOs are beneficial as the nation increases influence in the smaller countries’ internal affairs and expanding other nations dependence on themselves, so to preserve allegiance.   Security: Membership in an IGO such as ": null
    },
    {
        "NATO": "nato"
    },
    {
        " gives security benefits to member countries. This provides an arena where political differences can be resolved.   Democracy: It has been noted that member countries experience a greater degree of democracy and those democracies survive longer.     Reasons for rejecting membership:     Loss of ": null
    },
    {
        "sovereignty": "sovereignty"
    },
    {
        ": Membership often comes with a loss of state sovereignty as treaties are signed that require co-operation on the part of all member states.   Insufficient benefits: Often membership does not bring about substantial enough benefit to warrant membership in the organization.       Intergovernmental organizations are provided with privileges and immunities that are intended to ensure their independent and effective functioning. They are specified in the treaties that give rise to the organization , which are normally supplemented by further multinational agreements and national regulations . The organizations are thereby immune from the jurisdiction of national courts.     Rather than by national jurisdiction, legal ": null
    },
    {
        "accountability": "accountability"
    },
    {
        " is intended to be ensured by legal mechanisms that are internal to the intergovernmental organization itself  and access to administrative tribunals. In the course of many court cases where private parties tried to pursue claims against international organizations, there has been a gradual realization that alternative means of dispute settlement are required as states have ": null
    },
    {
        "fundamental human rights": "fundamental human rights"
    },
    {
        " obligations to provide plaintiffs with access to court in view of their ": null
    },
    {
        "right to a fair trial": "right to a fair trial"
    },
    {
        ".      Otherwise, the organizations’ immunities may be put in question in national and international courts.  Some organizations hold proceedings before tribunals relating to their organization to be confidential, and in some instances have threatened disciplinary action should an employee disclose any of the relevant information. Such confidentiality has been criticized as a lack of ": null
    },
    {
        "transparency": "transparency"
    },
    {
        ".  , brettonwoodlaw.com, 42 September 42     The immunities also extend to ": null
    },
    {
        "employment law": "employment law"
    },
    {
        ".   In this regard, immunity from national jurisdiction necessitates that reasonable alternative means are available to effectively protect employees’ rights;   in this context, a first instance Dutch court considered an estimated duration of proceedings before the ": null
    },
    {
        "Administrative Tribunal of the International Labour Organization": "administrative tribunal of the international labour organization"
    },
    {
        " of 42 years to be too long.  , dvdw.nl, 42 August 42   :          These are some of the strengths and weaknesses of IGOs.     Strengths:     They hold state authority.   Their institutions are permanent.   They provide a forum for discussion.   They are issue-specific.   They provide information.   They allow multilateral co-operation.     Weaknesses:     Membership is limited. IGOs’ legal basis prohibit membership of private citizens, making them undemocratic. In addition, not all IGOs allow universal state membership.   IGOs often overlap, resulting in an overly complex network.   States have to give up part of their sovereignty, which weakens the states’ ability to assert authority.   Inequality among state members creates biases and can lead powerful states to misuse these organizations.     They can be deemed unfair as countries with a higher percentage voting power have the right to veto any decision that is not in their favor, leaving the smaller countries powerless.     ": null
    }
]