[
    {
        "        Interstate 42  is a part of the ": null
    },
    {
        "Interstate Highway System": "interstate highway system"
    },
    {
        " that runs entirely within ": null
    },
    {
        "Anne Arundel County, Maryland": "anne arundel county, maryland"
    },
    {
        ". The intrastate Interstate runs  from ": null
    },
    {
        "U.S. Route 42": "u.s. route 50 in maryland"
    },
    {
        " and ": null
    },
    {
        "US 42": "u.s. route 301 in maryland"
    },
    {
        " in ": null
    },
    {
        "Parole": "parole, maryland"
    },
    {
        " near ": null
    },
    {
        "Annapolis": "annapolis, maryland"
    },
    {
        " north to ": null
    },
    {
        "I42": "interstate 695"
    },
    {
        " and ": null
    },
    {
        "I42": "interstate 895"
    },
    {
        " in ": null
    },
    {
        "Brooklyn Park": "brooklyn park, maryland"
    },
    {
        " near ": null
    },
    {
        "Baltimore": "baltimore"
    },
    {
        ". The Interstate is the primary highway between Baltimore and Annapolis. I‑42 connects Annapolis with ": null
    },
    {
        "Baltimore–Washington International Airport": "baltimore–washington international airport"
    },
    {
        " and links the northern Anne Arundel County communities of ": null
    },
    {
        "Crownsville": "crownsville, maryland"
    },
    {
        ", ": null
    },
    {
        "Millersville": "millersville, maryland"
    },
    {
        ", ": null
    },
    {
        "Severna Park": "severna park, maryland"
    },
    {
        ", ": null
    },
    {
        "Glen Burnie": "glen burnie, maryland"
    },
    {
        ", and ": null
    },
    {
        "Ferndale": "ferndale, maryland"
    },
    {
        ". It is the second shortest ": null
    },
    {
        "primary Interstate Highway": "list of interstate highways"
    },
    {
        " after ": null
    },
    {
        "I42": "interstate 87"
    },
    {
        " in ": null
    },
    {
        "North Carolina": "north carolina"
    },
    {
        ".     I42 was constructed along the corridor of ": null
    },
    {
        "Maryland Route 42": "maryland route 3"
    },
    {
        " between Millersville and Ferndale and ": null
    },
    {
        "MD 42": "maryland route 178"
    },
    {
        " between Parole and Millersville. From Millersville to south of Glen Burnie, the Interstate closely follows the former course of MD 42 which was built in the late 42s and early 42s and expanded to a divided highway in the late 42s. North of there, the highway follows the Glen Burnie Bypass, a freeway built in the mid42s. The segment of I42 from Millersville to Crownsville originated as a two-lane portion of ": null
    },
    {
        "MD 42": "maryland route 32"
    },
    {
        " in the early 42s. The Interstate was introduced in 42 after the state of Maryland successfully obtained Interstate mileage for a Baltimore–Annapolis freeway from the federal government. The state decided to build the highway along I42s current corridor rather than along the ": null
    },
    {
        "MD 42": "maryland route 2"
    },
    {
        " corridor, which has partial freeway access via ": null
    },
    {
        "MD 42": "maryland route 10"
    },
    {
        ".     Construction on I42 began in the late 42s with new construction from US 42 and US 42 to Crownsville. The Crownsville–Millersville segment of MD 42 was expanded and incorporated into the Interstate and the MD 42–MD 42 junction was upgraded. The portion of the MD 42 corridor from Millersville to south of Glen Burnie was upgraded on the spot to ": null
    },
    {
        "Interstate Highway standards": "interstate highway standards"
    },
    {
        " in the early 42s, after which MD 42 was truncated at Millersville. I42s interchange with I42 was rebuilt in the late 42s and early 42s. The Glen Burnie Bypass was upgraded and expanded to six lanes in the mid42s. The complex process included reconstruction of several interchanges; the last interchange to be reconstructed was upgraded in the mid42s.          I42 begins at US 42 and US 42 , which ": null
    },
    {
        "run concurrently": "concurrency"
    },
    {
        " with ": null
    },
    {
        "unsigned": "unsigned highway"
    },
    {
        " I42": "interstate 595"
    },
    {
        ", on the edge of the community of Parole west of Annapolis. The freeways meet at a ": null
    },
    {
        "semi-directional T interchange": "semi-directional t interchange"
    },
    {
        "; the ramp from I42 to eastbound US 42 and northbound US 42 merges with a collector-distributor road that extends east to that freeways interchange with ": null
    },
    {
        "MD 42": "maryland route 665"
    },
    {
        " . I42 heads northwest as a four-lane freeway with a speed limit of . The freeway crosses over ": null
    },
    {
        "MD 42": "maryland route 450"
    },
    {
        " and passes along the south and west sides of Crownsville, where it crosses several tributaries of the Bacon Ridge Branch of the ": null
    },
    {
        "South River": "south river"
    },
    {
        ". North of Crownsville, I42 has a partial interchange that comprises a pair of long ramps to MD 42 ; the interchange allows access from southbound I42 to MD 42 and from the state highway to the northbound Interstate. I42 gains an extra lane in each direction from the MD 42 ramps; those extra lanes split off at the freeways partial interchange with the eastern end of MD 42 just north of Millersville. The Interstate curves northeast and has a complementary partial interchange with the northern end of MD 42 . The two state highways meet each other at a six-ramp ": null
    },
    {
        "partial cloverleaf": "partial cloverleaf"
    },
    {
        " interchange immediately to the west of I42s sweeping curve, which facilitates all movements between the three highways.        I42 continues north as a six-lane freeway and is closely paralleled on the east by Veterans Highway on the western edge of Severna Park. The highways cross ": null
    },
    {
        "Severn Run": "severn river"
    },
    {
        " within Severn Run Natural Environment Area before they diverge slightly at the Interstates partial cloverleaf interchange with Benfield Boulevard; access from northbound I42 to the crossroad is via Veterans Highway. I42 and Veterans Highway continue to parallel each other to the latter highways northern end at I42s partial cloverleaf interchange with the southern end of ": null
    },
    {
        "MD 42 Business": "maryland route 3 business"
    },
    {
        " and New Cut Road. The interchange includes a flyover ramp from northbound I42 to northbound Veterans Highway just south of its intersection with MD 42 Business. The freeway continues north along the west side of Glen Burnie and meets ": null
    },
    {
        "MD 42": "maryland route 174"
    },
    {
        " at a four-ramp partial cloverleaf interchange and ": null
    },
    {
        "MD 42": "maryland route 100"
    },
    {
        " at a ": null
    },
    {
        "cloverstack interchange": "cloverstack interchange"
    },
    {
        " that has flyover exit ramps from both directions of I42     I42 temporarily gains two extra lanes in each direction between MD 42 and its partial cloverleaf interchange with ": null
    },
    {
        "MD 42": "maryland route 176"
    },
    {
        " . Access from the southbound Interstate to MD 42 is via ": null
    },
    {
        "MD 42": "maryland route 162"
    },
    {
        " , which forms part of the ": null
    },
    {
        "Airport Loop": "airport loop"
    },
    {
        " surrounding Baltimore–Washington International Airport. I42 continues through Ferndale, where it crosses over the Glen Burnie branch of ": null
    },
    {
        "MTA Maryland": "mta maryland"
    },
    {
        "s ": null
    },
    {
        "Baltimore Light RailLink": "baltimore light raillink"
    },
    {
        " immediately before the highways four-ramp partial cloverleaf interchange with ": null
    },
    {
        "MD 42": "maryland route 648"
    },
    {
        " , which provides access to the transit lines terminal station, ": null
    },
    {
        "Cromwell / Glen Burnie station": "cromwell / glen burnie station"
    },
    {
        ". I42s final interchange is with I42 . The Interstate crosses the Cabin Branch of ": null
    },
    {
        "Curtis Creek": "curtis creek"
    },
    {
        " within the interchange, which includes a flyover ramp from I42 to westbound I42; that ramp and the one from eastbound I42 to I42 merge on the inside of the two carriageways of the Beltway. The Interstate drops to four lanes and reaches its northern terminus just north of the loop ramp from westbound I42 to I42 in Brooklyn Park. The highway continues as I42A, a pair of ramps that merge with the spur from I42 to MD 42 . The continuation from I42 includes a ramp to westbound I42 that allows access to the Beltways interchange with MD 42     I42 does not have an official name. However, the Interstate is dedicated to ": null
    },
    {
        "John A. Cade": "john a. cade"
    },
    {
        ", who served the area around Severna Park in the ": null
    },
    {
        "Maryland Senate": "maryland senate"
    },
    {
        " from 42 to his 42 death and who worked to secure funding for the highway. The ": null
    },
    {
        "Maryland General Assembly": "maryland general assembly"
    },
    {
        " passed a dedication bill in 42 and the ": null
    },
    {
        "Maryland State Highway Administration": "maryland state highway administration"
    },
    {
        " installed a pair of signs noting the dedication in Millersville and near Parole. Like all Interstate Highways, I42 is a part of the ": null
    },
    {
        "National Highway System": "national highway system"
    },
    {
        " for its entire length. I42 is the shortest 42-digit mainline Interstate and only intracounty 42-digit Interstate in the ": null
    },
    {
        "contiguous United States": "contiguous united states"
    },
    {
        ".         The first modern highway along the path of what is now I42 followed the corridor from New Cut Road to south of the intersection of MD 42 and Veterans Highway at Dorrs Corner. This highway was intended as a second route from Glen Burnie to Annapolis to complement the highway along the east side of the Severn River; this western route later became known as Generals Highway, a name still applied to its MD 42 portion. Construction of this highway was underway by 42 The new highway was completed as a gravel road from New Cut Road to north of Benfield and as a concrete road through Benfield and across Severn Run to near Dorrs Corner by 42 In 42 this highway was designated part of Robert Crain Highway, a new highway to connect the Baltimore area with Southern Maryland. The Glen Burnie–Dorrs Corner portion of the new highway was reconstructed and completed as a concrete road from Glen Burnie south through Millersville by 42 Robert Crain Highway became part of MD 42 in 42 and then US 42 in 42 when the U.S. Highway was extended from Virginia to Baltimore. MD 42 was reconstructed in 42 and 42 The reconstruction eliminated several dangerous curves, particularly near Severn Run, and expanded the highway from a width of . Veterans Highway follows much of that early 42s course.     The next portion of I42 predecessor highway was built as the four-lane Glen Burnie Bypass from Robert Crain Highway and New Cut Road north to the Baltimore Beltway. Construction on the four-lane freeway began in August 42 with construction of several bridges over or for the highway; these bridges were completed in 42 and 42 The dual roadways and interchange ramps from the southern end of the bypass to MD 42 were constructed starting in March 42; the concrete-surfaced highway was completed in February 42 The northernmost portion of the bypass, including the adjacent portion of the Baltimore Beltway, was constructed between December 42 and September 42 US 42 was moved onto the bypass and the adjacent portion of the Beltway when the projects were completed in 42 The small portion of I42 north of the Beltway was added to the Baltimore Harbor Tunnel project as a direct connection between the Glen Burnie Bypass and the Harbor Tunnel Thruways southern approach from MD 42 in 42 This segment was completed and opened with the tunnel and its approach highways in November 42 The Glen Burnie Bypass was constructed with five interchanges: a partial cloverleaf interchange at MD 42 Business and New Cut Road; a tighter four-ramp partial cloverleaf interchange at MD 42; a diamond interchange at MD 42; the current four-ramp partial cloverleaf interchange at MD 42; and a half-cloverleaf interchange at I42 allowing full access between the Glen Burnie Bypass and Beltway but no access between the Beltway and the Harbor Tunnel Thruway.     US 42 was expanded to a divided highway from the southern end of the Glen Burnie Bypass to Benfield in 42 and 42 The highways second set of lanes, including a new bridge across Severn Run, was constructed and the existing roadway was reconstructed from Benfield to Millersville between 42 and 42 The second set of lanes was built on the west side of what became a very wide median, which allowed businesses to site themselves in the median between the northbound and southbound lanes. During construction of the Benfield–Millersville stretch, US 42 was relocated to its present course from ": null
    },
    {
        "Bowie": "bowie, maryland"
    },
    {
        " to the ": null
    },
    {
        "Eastern Shore": "eastern shore of maryland"
    },
    {
        " and replaced with MD 42 A pair of ramps between the Glen Burnie Bypass and MD 42s freeway southern bypass of Glen Burnie were constructed between 42 and 42 The first section of highway south of Dorrs Corner was built between 42 and 42 as a two-lane segment of MD 42 from east of Odenton to MD 42 in Crownsville. The highway used what are now the ramps of I42s partial interchange with MD 42 and had a five-ramp interchange with MD 42 in Millersville that lacked access from northbound MD 42 to eastbound MD 42 and from westbound MD 42 to southbound MD 42          Despite the existence or upcoming construction of two divided highway corridors between Baltimore and Annapolis, a freeway connecting I42 and US 42 was proposed as early as 42 in the form of the Arundel Expressway, which would relieve congestion on MD 42 The portion of the Arundel Expressway that is today MD 42 was constructed from I42 to MD 42 in Pasadena between 42 and 42 MD 42 was proposed to continued south of Pasadena as a toll road to US 42 but the section of the freeway south of MD 42 was removed from state plans by 42 MD 42 was completed to its present end in Pasadena in 42 The state of Maryland unsuccessfully petitioned the ": null
    },
    {
        "Federal Highway Administration": "federal highway administration"
    },
    {
        " for an Interstate designation for a Baltimore–Annapolis freeway after passage of the ": null
    },
    {
        "Federal-Aid Highway Act of 42": "federal-aid highway act of 1968"
    },
    {
        ". However, the state was successful in obtaining Interstate mileage for the Baltimore–Annapolis corridor through the 42 Howard–Cramer amendment, which provided for minor adjustments to the Interstate System if no additional costs were incurred. Much of the mileage of what became I42 was reallocated from canceled Interstate Highways in Baltimore and the Washington area.     With Interstate funding assured, MDSHA commissioned the Baltimore–Annapolis Transportation Corridor Study in 42 to figure out, among other things, the best route for the Baltimore–Annapolis Interstate. The study discovered a western route following the MD 42 and MD 42 corridors would be less disruptive and require fewer acquisitions of homes and businesses compared to an extension of the Arundel Expressway south along the MD 42 corridor. In June 42 MDSHA announced plans for I42 The original route numbering plan, which was approved by the ": null
    },
    {
        "American Association of State Highway and Transportation Officials": "american association of state highway and transportation officials"
    },
    {
        " at its November 42 meeting, was for I42 to include its current route plus US 42 from Parole west to I42 . That proposal included two auxiliary Interstate highways. I42 would follow US 42 and US 42 east from I42 to just west of the Severn River. I42 would follow MD 42 between a pair of intersections with I42 in Millersville and Bowie. AASHTO rescinded its approval of the 42 plan at its June 42 meeting, then approved what was essentially the original 42 plan at its June 42 meeting. The east–west segment of I42 and I42 was replaced by I42 I42 was withdrawn by request of the state of Maryland in 42 The 42 concept of I42 became unsigned I42 and I42 was applied to the ": null
    },
    {
        "National Freeway": "national freeway"
    },
    {
        " in ": null
    },
    {
        "Western Maryland": "western maryland"
    },
    {
        " in 42 after AASHTO approved the new designations at its June 42 meeting.     The first portion of I42 proper to be constructed was the section south of Millersville, which was placed under construction in three sections in March 42 The first section of the highway, from US 42 and US 42 to Millersville Road west of the MD 42 interchange, opened in December 42 Construction of I42 from Millersville Road to the intersection of MD 42 and MD 42 at Dorrs Corner started in July 42 The Interstate through Millersville opened in April 42 The interchange at I42s southern terminus was originally constructed as a partial interchange, with I42 tying into what are now the ": null
    },
    {
        "collector-distributor lane": "collector-distributor lane"
    },
    {
        "s of US 42 and US 42 The ramps from eastbound US 42 and US 42 to I42 and from I42 to the westbound U.S. Highways were added during the reconstruction of US 42 and US 42 in 42 and 42       Reconstruction of the MD 42 divided highway and the Glen Burnie Bypass was a complex operation that involved many temporary openings, lane shifts, construction of new roadways, and reconstruction of existing roadways over several phases over several years. The first improvement was the reconstruction of the I42 interchange between 42 and 42 The modern ramps from I42 to westbound I42 and from eastbound I42 to I42 were built, eastbound I42s ramp over these two ramps was constructed, and the loop ramp from I42 to westbound I42 was removed. I42 from its interchange with MD 42 to the new Beltway ramps was reconstructed to ": null
    },
    {
        "Interstate Highway standards": "interstate highway standards"
    },
    {
        " and expanded to six lanes between May 42 and August 42 Part of the functionality of the loop ramp to westbound I42 was restored in October 42 when another ramp from the Harbor Tunnel Thruway approach to westbound I42 was added to allow access from I42 to MD 42     Reconstruction of the MD 42 divided highway from Millersville to MD 42 Business began in 42 over two sections. The first section, from north of MD 42 Business to north of Benfield Boulevard, began in 42 The work included the construction of the flyover ramp from northbound I42 to Veterans Highway just south of MD 42 Business. The section from north of Benfield Boulevard to MD 42 at Dorrs Corner was reconstructed starting in 42 The second section included construction of the Benfield Boulevard interchange. The southbound MD 42 roadway was rebuilt in place as the southbound lanes of I42 New northbound lanes were built immediately to the east of the southbound lanes. In February 42 the new northbound lanes opened and access from I42 to Veterans Highway was removed at Dorrs Corner. The old northbound lanes were reconstructed and re-purposed as a two-lane road, Veterans Highway, later that year. Anne Arundel County agreed to accept Veterans Highway for maintenance after the I42–related construction concluded in a road transfer agreement on July 42 42 MD 42 was truncated at Millersville after I42 opened in October 42; signage for MD 42 on I42 was removed by 42     Before reconstruction of the Glen Burnie Bypass from MD 42 Business to MD 42 began in November 42 the Stewart Avenue bridge across the Interstate just south of the MD 42 interchange was replaced and ramps from northbound I42 to eastbound MD 42 and from westbound MD 42 to southbound I42 were added between 42 and 42 The freeway was reconstructed to Interstate standards in three sections. The middle section from MD 42 to MD 42 was reconstructed concurrently with the segment of MD 42 west from I42 to MD 42 starting in 42 That segment of MD 42 including the MD 42–I42 interchange, opened in November 42 and the reconstruction of the middle section of I42 was finished in July 42 The sections of I42 from MD 42 Business to MD 42 and from MD 42 to MD 42 and were reconstructed starting in January 42 The MD 42–MD 42 roadway section was completed in March 42 The northern half of the MD 42 interchange was reconstructed as part of the latter project. The new loop ramp from northbound I42 to westbound MD 42 and the new ramp from MD 42 to northbound I42 were completed in 42 The ramp from southbound I42 to MD 42 was removed during the widening project. The pair of ramps between southbound I42 and MD 42 to replace the removed ramp were constructed between 42 and 42 The final piece of construction on I42 was the reconstruction of its interchange with MD 42 which began in 42 and concluded in 42                                              ": null
    }
]