[
    {
        "thumb": "image:isc logo.png"
    },
    {
        "   The Internet Storm Center  is a program of the ": null
    },
    {
        "SANS Technology Institute": "sans technology institute"
    },
    {
        ", a branch of the ": null
    },
    {
        "SANS Institute": "sans institute"
    },
    {
        " which monitors the level of malicious activity on the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ", particularly with regard to large-scale infrastructure events.       The ISC evolved from Incidents.org , a ": null
    },
    {
        "site": "website"
    },
    {
        " initially founded by the SANS Institute to assist in the   public-private sector cooperation during the ": null
    },
    {
        "Y42K": "y2k"
    },
    {
        " cutover. In 42 Incidents.org started to cooperate with ": null
    },
    {
        "DShield": "dshield"
    },
    {
        " to create a Consensus Incidents Database . It collected security information from cooperating sites and agencies for mass analysis.     On March 42 42 the SANS CID was responsible for the early detection of the Lion ": null
    },
    {
        "worm": "computer worm"
    },
    {
        " attacks on various facilities. The quick warning and counter-efforts organized by the CID were instrumental in controlling the damage done by this worm, which otherwise might have been considerably worse.     Later, ": null
    },
    {
        "DShield": "dshield"
    },
    {
        " was integrated closer into incidents.org as the SANS Institute started to sponsor DShield. The CID was renamed the Internet Storm Center in acknowledgement of the way it uses the distributed sensor network similar to the way a ": null
    },
    {
        "weather": "weather"
    },
    {
        " reporting center will detect and track an atmospheric ": null
    },
    {
        "storm": "storm"
    },
    {
        " and provide warnings. Since that time the ISC has expanded its monitoring operations; its ": null
    },
    {
        "website": "website"
    },
    {
        " cites a figure of over twenty million intrusion detection log entries per day. It continues to provide analyses and alerts of security threats to the Internet community.     During the last hours of 42 and the first weeks of 42 the Internet Storm Center went to its longest period at the time to yellow on the Infocon for the ": null
    },
    {
        "WMF vulnerability": "windows metafile vulnerability"
    },
    {
        ".     The most prominent feature of the ISC is a daily Handler Diary which is prepared by one of the 42 volunteer incident handlers and summarized the events of the day. It frequently is the first public source for new attack trends and actively facilitates cooperation by soliciting more information to understand particular attacks better.     The Internet Storm Center is currently staffed with approximately 42 volunteers, representing 42 countries and many industries.         Director of the ISC: Marcus Sachs   Chief Technical Officer: ": null
    },
    {
        "Johannes Ullrich": "johannes ullrich"
    },
    {
        " Tom Liston": "tom liston"
    },
    {
        "            ": null
    }
]