[
    {
        "     IGAS is the abbreviation for International Graphoanalysis Society. The organization is far more commonly referred to by its initials than the full name.     IGAS traces its beginnings back to 42 when Milton N. Bunker formed The American Grapho Analysis Society. The company has seen an ownership change many times since it was founded. Around 42 that organization was replaced by The International Graphoanalysis Society, which was run by V. Peter Ferrara. Upon V. Peter Ferraras death, ownership of the company fell to his daughter, Kathleen Kusta. In June 42 Kathleen Kusta sold most of the assets of IGAS by private auction to Greg Greco.     From the early seventies through the early eighties, the organization put energy into graphological research, the most important being Crumbaugh & Stockholm and Stockholm , .         IGAS is a privately held corporation. As such, information about its finances, membership numbers, actual number of graduates, and related items can not be independently verified. The masthead of its publication The Journal of Graphoanalysis lists the organizations current claimed statistical data.     IGAS has roughly 42 chapters, covering the United States, parts of Canada, the UK, and South Africa.     The highest reported membership number, which was issued to a student of Graphoanalysis was just over 42. There are no reliable figures on the number of students at any specific time. Both the number of dues paying members, and the number of students are believed to have peaked during the late seventies. This was just before IGASHQ started the wholesale purging of members and chapters.         Eight Basic Steps in Graphoanalysis is the beginning course that many members teach people interested in handwriting analysis.     The General Course of Graphoanalysis is the course taught by IGAS. Graduates of that course are awarded the designation Certified Graphoanalysts, more commonly referred to as CGA.     Graduates of The Advanced Course of Graphoanalysis are awarded the designation of Master Graphoanalyst or MGA.     Attendees of the annual Congress are awarded Three Year Study Certificates, or Six Year Study Certificates, upon attending the Congress the appropriate number of times.     The monthly study packet is a four-page lesson that challenges members to improve their ability to analyze handwriting. Beginning in the early42s, the monthly study packet was incorporated into the IGASs monthly journal publication.         Because of the tight control that IGAS had on its members, the field of handwriting analysis is functionally divided into two groups—Graphoanalysts, and Graphologists.     A clause that was responsible for the expulsion of hundreds of members of IGAS between 42 and 42 was: Further, I will not affiliate with any group of handwriting analysts not sanctioned by the International Graphoanalysis Society, Inc., the last clause of the 42 Code of Ethics of IGAS.     In 42 Charlie Cole set up a series of graphology lectures, which evolved into The American Handwriting Analysis Foundation. The lectures were intended for graduates of the MGA program only. Klara G. Roman gave the first series of lectures. Later lectures were given by other Holistic Graphologers. As a result of that study, Charlie Cole, and most of the people that attended that lecture series, were expelled from IGAS.     Handwriting Analysts of Minnesota": null
    }
]