[
    {
        "   Intravenous therapy  is a ": null
    },
    {
        "therapy": "therapy"
    },
    {
        " that delivers ": null
    },
    {
        "fluid": "fluid"
    },
    {
        "s directly into a ": null
    },
    {
        "vein": "vein"
    },
    {
        ". The intravenous ": null
    },
    {
        "route of administration": "route of administration"
    },
    {
        " can be used both for ": null
    },
    {
        "injections": "injection"
    },
    {
        ", using a ": null
    },
    {
        "syringe": "syringe"
    },
    {
        " at higher ": null
    },
    {
        "pressure": "pressure"
    },
    {
        "s; as well as for infusions, typically using only the pressure supplied by gravity. Intravenous infusions are commonly referred to as drips.     The intravenous route is the fastest way to deliver ": null
    },
    {
        "medications": "pharmaceutical drug"
    },
    {
        " and ": null
    },
    {
        "fluid replacement": "fluid replacement"
    },
    {
        " throughout the body, because they are introduced directly into the ": null
    },
    {
        "circulation": "circulatory system"
    },
    {
        ". Intravenous therapy may be used for fluid volume replacement, to correct ": null
    },
    {
        "electrolyte imbalance": "electrolyte imbalance"
    },
    {
        "s, to deliver medications, and for ": null
    },
    {
        "blood transfusion": "blood transfusion"
    },
    {
        "s.             Intravenous systems can be categorized by which type of vein the inserted tube, called the catheter, empties into.          A peripheral intravenous line is used on ": null
    },
    {
        "peripheral vein": "peripheral vascular system"
    },
    {
        "s . This is the most common type of IV therapy used.             ": null
    },
    {
        "Central IV lines": "central venous catheter"
    },
    {
        " have their catheters that are advanced through a vein and empty into a large central vein , usually the  superior vena cava ,  inferior vena cava  or even the right atrium of the heart.     Indications for a central line over the more common peripheral IV line commonly includes poor peripheral venous access for a PIV. Another common indication is when patients would require infusions over a prolonged period of time, such as antibiotic therapy over a few weeks for osteomyelitis. Another indication is when the substances to be administered could irritate the blood vessel lining such as ": null
    },
    {
        "total parenteral nutrition": "total parenteral nutrition"
    },
    {
        ", whose high glucose content can damage blood vessels, and some ": null
    },
    {
        "chemotherapy": "chemotherapy"
    },
    {
        " regimens. There is less damage to the blood vessels because central veins have a larger diameter than peripheral veins, have faster blood flow, and would get diluted as it is quickly distributed to the rest of the body. Vasopressors are typically infused through central lines to minimize the risk of ": null
    },
    {
        "extravasation": "extravasation"
    },
    {
        ".     Other advantages are that multiple medications can be delivered at once, even if they would not be chemically compatible within a single tube as there is room for multiple parallel compartments within the catheter. It is commonly believed that fluid can be pushed faster through a central line; however, the diameter of each lumen is often smaller than that of a large-bore peripheral ": null
    },
    {
        "cannula": "cannula"
    },
    {
        ". Caregivers can also measure ": null
    },
    {
        "central venous pressure": "central venous pressure"
    },
    {
        " and other physiological variables through the central line. They are also longer and, as reflected by ": null
    },
    {
        "Poiseuilles law": "poiseuilles law"
    },
    {
        ", require higher pressure to achieve the same flow, all other variables being equal.     Central IV lines carry risks of bleeding, infection, ": null
    },
    {
        "gangrene": "gangrene"
    },
    {
        ", ": null
    },
    {
        "thromboembolism": "thromboembolism"
    },
    {
        " and ": null
    },
    {
        "gas embolism": "gas embolism"
    },
    {
        " . They are often more difficult to insert correctly as the veins are not usually palpable and rely on an experienced clinician knowing the appropriate landmarks and/or using an ": null
    },
    {
        "ultrasound probe": "medical ultrasonography"
    },
    {
        " to safely locate and enter the vein. Surrounding structures such as the ": null
    },
    {
        "pleura": "pleura"
    },
    {
        " and ": null
    },
    {
        "carotid artery": "carotid artery"
    },
    {
        " are also at risk of damage with the potential for ": null
    },
    {
        "pneumothorax": "pneumothorax"
    },
    {
        " or even cannulation of the artery.     There are several types of central IV access, depending on the route that the catheter takes from the outside of the body to the vein.         The PICC line is inserted through a sheath into a peripheral vein sometimes using the ": null
    },
    {
        "Seldinger technique": "seldinger technique"
    },
    {
        " or modified Seldinger technique, under ultrasound guidance, usually in the arm, and then carefully advanced upward until the catheter is in the superior vena cava or the right atrium. This is usually done by measuring the distance to an external landmark, such as the suprasternal notch, to estimate the optimal length. An X-ray must be used to verify that the tip is in the right place when fluoroscopy was not used during the insertion. More modern technology utilizes EKG technology to determine when the tip is in the correct location.     A PICC may have a single tube and connector, two or three compartments, each with its own external connector. Power-injectable PICCs are now available as well. From the outside, a single-lumen PICC resembles a peripheral IV line, except that the tubing is slightly wider.     The insertion site requires better protection than that of a peripheral IV line, due to the higher risk of serious infection if bacteria travel up the catheter. However, a PICC poses less of a systemic infection risk than other central IV lines, because the insertion site is usually cooler and drier than the sites typically used for other central lines. This helps to slow the growth of bacteria which could reach the bloodstream by traveling under the skin along the outside of the catheter.     The chief advantage of a PICC over other types of central lines is that it is safer to insert with a relatively low risk of uncontrollable bleeding and essentially no risks of damage to the lungs or major blood vessels. Although special training is required, a PICC does not require the skill level of a physician or surgeon. It is also externally unobtrusive, and with proper hygiene and care can be left in place for months to years if needed for patients who require extended treatment.     The chief disadvantage is that it must be inserted and then travel through a relatively small peripheral vein which can take a less predictable course on the way to the superior vena cava and is therefore somewhat more time consuming and more technically difficult to place in some patients. As a PICC travels through the axilla, it can also become kinked, causing poor function.          While some central lines have their catheter pass through the skin and then directly into the vein, other central lines called tunneled catheters insert through the skin and then pass or tunnel a significant distance before inserting into the vein. This reduces the risk of infection, since bacteria from the skin surface are not able to travel directly into the vein. These catheters are often made of materials that resist infection and clotting. These include the ": null
    },
    {
        "Hickman line": "hickman line"
    },
    {
        " or Broviac catheter.       A ": null
    },
    {
        "port": "port"
    },
    {
        "  is a central venous line that does not have an external connector; instead, it has a small reservoir that is covered with silicone rubber and is implanted under the skin. Medication is administered intermittently by placing a small needle through the skin, piercing the silicone, into the reservoir. When the needle is withdrawn, the reservoir cover reseals itself. The cover can accept hundreds of needle sticks during its lifetime. It is possible to leave the ports in the patients body for years; if this is done, the port must be accessed monthly and flushed with an anti-coagulant, or the patient risks it getting plugged up. If it is plugged, it becomes a hazard as a ": null
    },
    {
        "thrombus": "thrombus"
    },
    {
        " will eventually form with an accompanying risk of ": null
    },
    {
        "embolisation": "embolisation"
    },
    {
        ". Removal of a port is usually a simple outpatient procedure; however, installation is more complex and a good implant is fairly dependent on the skill of the radiologist. Ports cause less inconvenience and have a lower risk of infection than PICCs, and are therefore commonly used for patients on long-term intermittent treatment.       A third type is a midline catheter which is inserted into a peripheral vein and advances through the vein, similar to a peripheral IV line, but falls short of emptying into a central vein.       If intravenous access is unavailable, an ": null
    },
    {
        "intraosseous infusion": "intraosseous infusion"
    },
    {
        " may be used as an alternative ": null
    },
    {
        "route of administration": "route of administration"
    },
    {
        ".         A continuous infusion is primarily used to correct fluid and electrolyte imbalances. This is as opposed to intermittent infusion, when a patient requires medications only at certain times, such as secondary IV and IV push.       The tubing from the bag of fluid being administered that connects directly to the patient is called the primary tubing. Any additional IVs to be administered are connected to the primary tubing and are called secondary IV, or IV piggyback; this is done instead of placing multiple catheters in the patient. When administering a secondary IV medication, the primary bag is held lower than the secondary bag so that the secondary medication can flow into the primary tubing, rather than fluid from the primary bag flowing into the secondary tubing. The fluid from the primary bag is needed to help flush any remaining medication from the secondary IV from the tubing into the patient.       Some medications are also given by IV push or bolus. A syringe containing the medication is connected to an access port in the primary tubing and the medication is administered through the port. The syringe plunger is pressed slowly, if it might irritate the vein or cause a too-rapid effect. Certain medications, such as potassium, are never to be administered by IV push because the spike in medication in the blood from the IV push could be fatal. Once a medicine has been injected into the fluid stream of the IV tubing, there must be some means of ensuring that it gets from the tubing to the patient. Usually this is accomplished by allowing the fluid stream to flow normally and thereby carry the medicine into the bloodstream; however, a second fluid injection is sometimes used, a flush , following the injection to push the medicine into the bloodstream more quickly.          Substances that may be infused intravenously include volume expanders, blood-based products, blood substitutes, medications and nutrition.             There are two main types of volume expander: crystalloids and colloids. Crystalloids are aqueous ": null
    },
    {
        "solution": "solution"
    },
    {
        "s of mineral salts or other water-soluble molecules. Colloids contain larger insoluble molecules, such as ": null
    },
    {
        "gelatin": "gelatin"
    },
    {
        ". ": null
    },
    {
        "Blood": "blood"
    },
    {
        " is a colloid.   The most commonly used crystalloid fluid is normal ": null
    },
    {
        "saline": "saline"
    },
    {
        ", a solution of ": null
    },
    {
        "sodium chloride": "sodium chloride"
    },
    {
        " at 42% concentration, which is close to the concentration in the blood . Lactated Ringers  and the closely related Ringers acetate, are mildly ": null
    },
    {
        "hypotonic": "hypotonic"
    },
    {
        " solutions often used in those who have significant ": null
    },
    {
        "burn": "burn"
    },
    {
        "s.   Colloids preserve a high ": null
    },
    {
        "colloid osmotic pressure": "colloid osmotic pressure"
    },
    {
        " in the blood, while, on the other hand, this parameter is decreased by crystalloids due to hemodilution.  by Gregory S. Martin, MD, MSc There does not appear to be a benefit of using colloids over crystalloids. Crystalloids generally are much cheaper than colloids.   Volume expanders may either be isotonic, hypotonic, or ": null
    },
    {
        "hypertonic": "hypertonic"
    },
    {
        ". Hypotonic fluids are not generally recommended in children due to increased risk of adverse effects.      The best way to determine if a person will benefit from fluids is by doing a ": null
    },
    {
        "passive leg raise": "passive leg raise"
    },
    {
        " followed by measuring the ": null
    },
    {
        "output from the heart": "cardiac output"
    },
    {
        ".        ": null
    },
    {
        "Medication": "medication"
    },
    {
        "s may be mixed into the fluids mentioned above. Compared with other ": null
    },
    {
        "routes of administration": "route of administration"
    },
    {
        ", such as ": null
    },
    {
        "oral medications": "oral administration"
    },
    {
        ", the intravenous route is the fastest way to deliver fluids and medications throughout the body. The ": null
    },
    {
        "bioavailability": "bioavailability"
    },
    {
        " of the IV medication is 42%, unlike oral medications where much of the medication is lost in digestion before entering circulation. Certain types of medications can only be given intravenously, such as when there is insufficient uptake by other ": null
    },
    {
        "routes of administration": "routes of administration"
    },
    {
        " such as ": null
    },
    {
        "enteral": "enteral"
    },
    {
        "ly. Examples include ": null
    },
    {
        "intravenous immunoglobulin": "intravenous immunoglobulin"
    },
    {
        " and ": null
    },
    {
        "propofol": "propofol"
    },
    {
        ".             A ": null
    },
    {
        "blood product": "blood product"
    },
    {
        "  is any component of ": null
    },
    {
        "blood": "blood"
    },
    {
        " which is collected from a donor for use in a ": null
    },
    {
        "blood transfusion": "blood transfusion"
    },
    {
        ". Blood transfusions can be life-saving in some situations, such as massive blood loss due to ": null
    },
    {
        "trauma": "physical trauma"
    },
    {
        ", or can be used to replace blood lost during ": null
    },
    {
        "surgery": "surgery"
    },
    {
        ". Blood transfusions may also be used to treat a severe ": null
    },
    {
        "anaemia": "anaemia"
    },
    {
        " or ": null
    },
    {
        "thrombocytopenia": "thrombocytopenia"
    },
    {
        " caused by a ": null
    },
    {
        "blood disease": "blood disease"
    },
    {
        ". People with ": null
    },
    {
        "hemophilia": "hemophilia"
    },
    {
        " usually need a replacement of clotting factor, which is a small part of whole blood. People with ": null
    },
    {
        "sickle-cell disease": "sickle-cell disease"
    },
    {
        " may require frequent blood transfusions. Early blood transfusions consisted of ": null
    },
    {
        "whole blood": "whole blood"
    },
    {
        ", but modern medical practice commonly uses only components of the blood, such as ": null
    },
    {
        "fresh frozen plasma": "fresh frozen plasma"
    },
    {
        " or ": null
    },
    {
        "cryoprecipitate": "cryoprecipitate"
    },
    {
        ".     Blood substitutes are artificial substances aiming to provide an alternative to blood-based products acquired from donors. The main blood substitutes used today are volume expanders such as crystalloids and colloids mentioned above. Also, oxygen-carrying substitutes are emerging.       ": null
    },
    {
        "Buffer solution": "buffer solution"
    },
    {
        "s are used to correct ": null
    },
    {
        "acidosis": "acidosis"
    },
    {
        " or ": null
    },
    {
        "alkalosis": "alkalosis"
    },
    {
        ". ": null
    },
    {
        "Lactated Ringers solution": "lactated ringers solution"
    },
    {
        " also has some buffering effect. A solution more specifically used for buffering purpose is ": null
    },
    {
        "intravenous sodium bicarbonate": "intravenous sodium bicarbonate"
    },
    {
        ".       ": null
    },
    {
        "Parenteral nutrition": "parenteral nutrition"
    },
    {
        " is feeding a person intravenously, bypassing the usual process of ": null
    },
    {
        "eating": "eating"
    },
    {
        " and ": null
    },
    {
        "digestion": "digestion"
    },
    {
        ". The person receives nutritional formulas containing ": null
    },
    {
        "salt": "salt"
    },
    {
        "s, ": null
    },
    {
        "glucose": "glucose"
    },
    {
        ", ": null
    },
    {
        "amino acid": "amino acid"
    },
    {
        "s, ": null
    },
    {
        "lipid": "lipid"
    },
    {
        "s and added ": null
    },
    {
        "vitamin": "vitamin"
    },
    {
        "s.          A standard IV infusion set consists of a pre-filled, sterile container of fluids with an attachment that allows the fluid to flow one drop at a time, making it easy to see the flow rate ; a long sterile tube with a clamp to regulate or stop the flow; a connector to attach to the access device; and ": null
    },
    {
        "Y-sets": "y-set"
    },
    {
        " to allow piggybacking of another infusion set onto the same line, e.g., adding a dose of ": null
    },
    {
        "antibiotics": "antibiotics"
    },
    {
        " to a continuous fluid drip.       An ": null
    },
    {
        "infusion pump": "infusion pump"
    },
    {
        " allows precise control over the flow rate and total amount delivered.   The volume to be infused of the mainline IV bag is usually programmed for about 42 milliliters less than the stated volume of that IV bag to avoid letting the IV line or tubing run dry. The VTBI for a secondary bag or piggybag should usually be programmed for 42 to 42 milliliters more than is stated to be in that medication IV bag, to make sure that in addition to the bag being emptied, the entire medication dose is flushed through the IV tubing from the mainline bag. Because of its design, the short, secondary IV line cannot run dry. Thus, the registered nurse programs the IV pump for a 42 milliliter bag of IV antibiotics volume to be infused for at least 42 milliliters. The 42 milliliter bag of antibiotics usually needs a VTBI of about 42 milliliters.   In cases where a change in the flow rate would not have serious consequences, or if pumps are not available, the drip is often left to flow simply by placing the bag above the level of the patient and using the clamp to regulate the rate; this is a gravity drip.        The simplest form of intravenous access is by passing a hollow ": null
    },
    {
        "needle": "hypodermic needle"
    },
    {
        " through the skin directly into the vein. This needle can be connected directly to a syringe or may be connected to a length of tubing and thence whichever collection or infusion system is desired.     The most convenient site is often the arm, especially the veins on the back of the hand, or the ": null
    },
    {
        "median cubital vein": "median cubital vein"
    },
    {
        " at the elbow, but any identifiable vein can be used. Often it is necessary to use a ": null
    },
    {
        "tourniquet": "tourniquet"
    },
    {
        " which restricts the venous drainage of the limb and makes the vein bulge. Once the needle is in place, it is common to draw back slightly on the syringe to aspirate blood, thus verifying that the needle is really in a vein. The tourniquet should be removed before injecting to prevent ": null
    },
    {
        "extravasation": "extravasation"
    },
    {
        " of the medication.          Many systems of administration employ a ": null
    },
    {
        "drip chamber": "drip chamber"
    },
    {
        ", which prevents air from entering the blood stream , and allows an estimation of flow rate.                  A peripheral ": null
    },
    {
        "cannula": "cannula"
    },
    {
        " is the most common intravenous access method utilized in both ": null
    },
    {
        "hospital": "hospital"
    },
    {
        "s and ": null
    },
    {
        "pre-hospital": "pre-hospital"
    },
    {
        " services. A ": null
    },
    {
        "peripheral IV line ": "peripheral venous catheter"
    },
    {
        " consists of a short ": null
    },
    {
        "catheter": "catheter"
    },
    {
        " inserted through the skin into a ": null
    },
    {
        "peripheral vein": "peripheral vein"
    },
    {
        " . This is usually in the form of a ": null
    },
    {
        "cannula": "cannula"
    },
    {
        "-over-needle device, in which a flexible plastic ": null
    },
    {
        "cannula": "cannula"
    },
    {
        " comes mounted over a metal ": null
    },
    {
        "trocar": "trocar"
    },
    {
        ". Once the tip of the needle and cannula are introduced into the vein via venipuncture, the cannula is advanced inside the vein over the trocar to the appropriate position and secured, the trocar is then withdrawn and discarded. Blood samples may be drawn directly after the initial IV cannula insertion.     Any accessible vein can be used although ": null
    },
    {
        "arm": "arm"
    },
    {
        " and ": null
    },
    {
        "hand": "hand"
    },
    {
        " veins are used most commonly, with ": null
    },
    {
        "leg": "human leg"
    },
    {
        " and ": null
    },
    {
        "foot": "foot"
    },
    {
        " veins used to a much lesser extent. In ": null
    },
    {
        "infants": "infants"
    },
    {
        ", the ": null
    },
    {
        "scalp": "scalp"
    },
    {
        " veins are sometimes used.     The caliber of needles and catheters can be given in ": null
    },
    {
        "Birmingham gauge": "birmingham gauge"
    },
    {
        " or ": null
    },
    {
        "French gauge": "french catheter scale"
    },
    {
        ". A Birmingham gauge of 42 is a very large cannula and 4242 is the smallest. The most common sizes are 42-gauge , 42- and 42-gauge , and 42-gauge . 42- and 42-gauge peripheral lines are capable of delivering large volumes of fluid very fast, accounting for their popularity in ": null
    },
    {
        "emergency medicine": "emergency medicine"
    },
    {
        ". These lines are frequently called large bores or trauma lines .     To make the procedure more tolerable for children, medical staff may apply a topical local anaesthetic  to the skin of the chosen venipuncture area about 42 minutes beforehand.     The part of the catheter that remains outside the skin is called the connecting hub; it can be connected to a ": null
    },
    {
        "syringe": "syringe"
    },
    {
        " or an intravenous infusion line, or capped with a  or saline lock, a needleless connection filled with a small amount of heparin or saline solution to prevent clotting, between uses of the catheter. Ported ": null
    },
    {
        "cannula": "cannula"
    },
    {
        "e have an injection port on the top that is often used to administer medicine.     In cases of shock, a central venous catheter, a peripherally inserted central catheter , ": null
    },
    {
        "venous cutdown": "venous cutdown"
    },
    {
        " or ": null
    },
    {
        "intraosseous infusion": "intraosseous infusion"
    },
    {
        " may be necessary.        If the cannula is not sited correctly, or the vein is particularly fragile and ruptures, blood may extravasate into the surrounding tissues, this situation is known as a blown vein or tissuing . Using this cannula to administer medications causes ": null
    },
    {
        "extravasation": "extravasation"
    },
    {
        " of the drug which can lead to ": null
    },
    {
        "edema": "edema"
    },
    {
        ", causing pain and tissue damage, and even ": null
    },
    {
        "necrosis": "necrosis"
    },
    {
        " depending on the medication. The person attempting to obtain the access must find a new access site proximal to the blown area to prevent extravasation of medications through the damaged vein. For this reason it is advisable to site the first cannula at the most distal appropriate vein.     If a patient needs frequent venous access, the veins may scar and narrow, making any future access extremely difficult or impossible.     A peripheral IV cannot be left in the vein indefinitely out of concern for the risk of infection and phlebitis, among other potential complications. However, recent studies have found that there is no increased risk of complications in patients whose IVs were replaced only when clinically indicated versus patients whose IVs were replaced routinely.   Thus, it is becoming more common to replace IVs only when clinically indicated. There is no need to replace peripheral IVs more frequently than 42–42 hours as long as the IV was placed aseptically.      Catheter shearing is a very infrequent complication, but a very real danger. Shearing occurs when part of the catheter is cut by the sharp bevelled edge of the trochar. The sheared section may completely separate from the main body of the catheter, and become free floating in the blood stream. The majority of the time, it is due to poor technique, but infrequently a poorly manufactured catheter may break from the hub or shear. Infection, and a foreign body embolus are the two threats to the patient.       A rapid infuser can be used if the patient requires a high flow rate and the IV access device is of a large enough diameter to accommodate it. This is either an inflatable cuff placed around the fluid bag to force the fluid into the patient or a similar electrical device that may also heat the fluid being infused.                An injection inherently causes pain when the skin is broken and is ": null
    },
    {
        "medically invasive": "invasiveness of surgical procedures"
    },
    {
        ". In cases in which a choice between intravenous therapy and oral treatment may be made to achieve the same outcome, such as in the case of mild or moderate ": null
    },
    {
        "dehydration": "dehydration"
    },
    {
        " treatment , then one should avoid using intravenous therapy in place of the less invasive oral option. , which cites    Children in ": null
    },
    {
        "emergency departments": "emergency departments"
    },
    {
        " being treated for dehydration in particular have better outcomes with oral treatment because it does not cause the pain or risk the complications of an injection.     ": null
    },
    {
        "Cold spray": "vapocoolant"
    },
    {
        " can decrease the pain of putting in an IV.        Any break in the skin carries a risk of infection. Although IV insertion is an aseptic procedure, skin-dwelling organisms such as  Coagulase-negative staphylococcus  or  Candida albicans  may enter through the insertion site around the catheter, or bacteria may be accidentally introduced inside the catheter from contaminated equipment. Moisture introduced to unprotected IV sites through washing or bathing substantially increases the infection risks.     Infection of IV sites is usually local, causing easily visible swelling, redness, and fever. If bacteria do not remain in one area but spread through the bloodstream, the infection is called ": null
    },
    {
        "sepsis": "sepsis"
    },
    {
        " and can be rapid and life-threatening. An infected central IV poses a higher risk of sepsis, as it can deliver bacteria directly into the central circulation.       ": null
    },
    {
        "Phlebitis": "phlebitis"
    },
    {
        " is inflammation of a vein that may be caused by infection, the mere presence of a foreign body or the fluids or medication being given. Symptoms are warmth, swelling, pain, and redness around the vein. The IV device must be removed and if necessary re-inserted into another extremity.     Due to frequent injections and recurring phlebitis, scar tissue can build up along the vein. The peripheral veins of intravenous drug addicts, and of cancer patients undergoing chemotherapy, become sclerotic and difficult to access over time, sometimes forming a hard, painful “venous cord”.       Infiltration occurs when an IV fluid or medication accidentally enters the surrounding tissue rather than the vein. It may occur when the vein itself ruptures , when the vein is damaged during insertion of the intravascular access device, when the device is not sited correctly, from increased vein porosity or when the entry point of the device into the vein becomes the path of least resistance . Infiltration is an inadvertent administration of a nonvesicant solution/drug into the tissue, which happens so often when the tourniquet isnt removed in a timely fashion. Infiltration is characterized by coolness and pallor to the skin as well as localized swelling or edema. It is treated by removing the intravenous access device and elevating the affected limb so that the collected fluids can drain away. Sometimes injections of ": null
    },
    {
        "hyaluronidase": "hyaluronidase"
    },
    {
        " can be used to speed the dispersal of the fluid/drug. Infiltration is one of the most common adverse effects of IV therapy  and is usually not serious unless the infiltrated fluid is a medication damaging to the surrounding tissue, most commonly a ": null
    },
    {
        "vesicant": "blister agent"
    },
    {
        " or ": null
    },
    {
        "chemotherapeutic agent": "chemotherapeutic agent"
    },
    {
        ", in which case it is called ": null
    },
    {
        "extravasation": "extravasation"
    },
    {
        " and extensive ": null
    },
    {
        "necrosis": "necrosis"
    },
    {
        " can occur.  Know The Difference: Infiltration vs. Extravasation  Accessed 42/42/42       This occurs when fluids are given at a higher rate or in a larger volume than the system can absorb or excrete. Possible consequences include ": null
    },
    {
        "hypertension": "hypertension"
    },
    {
        ", ": null
    },
    {
        "heart failure": "heart failure"
    },
    {
        ", and ": null
    },
    {
        "pulmonary edema": "pulmonary edema"
    },
    {
        ".       The human body is at risk of accidentally induced hypothermia when large amounts of cold fluids are infused. Rapid temperature changes in the heart may precipitate ventricular fibrillation.       Administering a too-diluted or too-concentrated solution can disrupt the patients balance of sodium, potassium, magnesium, chloride, and other ": null
    },
    {
        "electrolyte": "electrolyte"
    },
    {
        "s. Hospital patients usually receive blood tests to monitor these levels. It is essential to correct these imbalances if they occur, as they can lead to the clinical symptoms of ": null
    },
    {
        "electrolyte imbalance": "water–electrolyte imbalance"
    },
    {
        ", which, if left untreated, can lead to ": null
    },
    {
        "acidosis": "acidosis"
    },
    {
        "/": null
    },
    {
        "alkalosis": "alkalosis"
    },
    {
        ", and ultimately death.       A blood clot or other solid mass, as well as an air bubble, can be delivered into the circulation through an IV and end up blocking a vessel; this is called ": null
    },
    {
        "embolism": "embolism"
    },
    {
        ". It is nearly impossible to inject air through a peripheral IV at a dangerous rate. The risk is greater with a central IV.     Air bubbles of less than 42 microliters are thought to dissolve into the circulation harmlessly. A larger amount of air, if delivered all at once, can cause life-threatening damage, or, if extremely large , can stop the heart.     One reason veins are preferred over arteries for intravascular administration is because the flow will pass through the lungs before passing through the body. Air bubbles can leave the blood through the lungs. A patient with a ": null
    },
    {
        "right-to-left shunt": "right-to-left shunt"
    },
    {
        " is vulnerable to embolism from smaller amounts of air. Fatality by air embolism is rare, although this may be in part because it is so difficult to determine when this is the cause of death.       Intravenous glucose is used in some Asian countries such as Korea as a pick-me-up, for energy, but is not a part of routine medical care in the United States where a glucose solution is a prescription drug. Asian immigrants to the United States are at risk if they seek intravenous glucose treatment. It may be had at store-front clinics catering to Asian immigrants, but, despite having no more effect than drinking sugared water, poses medical risks such as the possibility of infection. It is commonly called ringer.        IV rehydration was formerly a common technique for athletes. The ": null
    },
    {
        "World Anti-Doping Agency": "world anti-doping agency"
    },
    {
        " prohibits intravenous injection of more than 42mL per 42 hours, except under a medical exemption. The ": null
    },
    {
        "United States Anti-Doping Agency": "united states anti-doping agency"
    },
    {
        " notes that, as well as the dangers inherent in IV therapy, IVs can be used to change ": null
    },
    {
        "blood test": "blood test"
    },
    {
        " results , mask ": null
    },
    {
        "urine test": "urine test"
    },
    {
        " results or by administering prohibited substances in a way that will more quickly be cleared from the body in order to beat an anti-doping test .  Sportspeople suspended after attending ": null
    },
    {
        "boutique IV": "boutique iv"
    },
    {
        " clinics include footballer ": null
    },
    {
        "Samir Nasri": "samir nasri"
    },
    {
        " in 42  and swimmer ": null
    },
    {
        "Ryan Lochte": "ryan lochte"
    },
    {
        " in 42        In the 42s, John Myers developed the ": null
    },
    {
        "Myers cocktail": "myers cocktail"
    },
    {
        " , a non-prescription IV solution of vitamins and minerals marketed as a ": null
    },
    {
        "hangover cure": "hangover cure"
    },
    {
        " and general ": null
    },
    {
        "wellness": "wellness"
    },
    {
        " remedy. The first boutique IV clinic, offering similar treatments, opened in Tokyo in 42 These clinics, whose target market was described by  Elle  as health nuts who moonlight as heavy drinkers , have been publicized in the 42s by glamorous celebrity customers.        Intravenous technology stems from studies on ": null
    },
    {
        "cholera": "cholera"
    },
    {
        " treatment in 42 by ": null
    },
    {
        "Dr Thomas Latta": "thomas latta"
    },
    {
        " of ": null
    },
    {
        "Leith": "leith"
    },
    {
        ".  Intravenous therapy was pioneered by Italian physician ": null
    },
    {
        "Guido Baccelli": "guido baccelli"
    },
    {
        " in the late 42s See, for example, the Nobel Prize Nomination Database:  and further developed in the 42s by Hirschfeld, Hyman and ": null
    },
    {
        "Wanger": "justine johnstone"
    },
    {
        "     but was not widely available until the 42s.     ": null
    }
]