[
    {
        "        Invertebrates are ": null
    },
    {
        "animals": "animal"
    },
    {
        "that neither possess nor develop a ": null
    },
    {
        "vertebral column": "vertebral column"
    },
    {
        " , derived from the ": null
    },
    {
        "notochord": "notochord"
    },
    {
        ". This includes all ": null
    },
    {
        "animals": "animal"
    },
    {
        "apart from the ": null
    },
    {
        "subphylum": "subphylum"
    },
    {
        " Vertebrata": "vertebrate"
    },
    {
        ". Familiar examples of invertebrates include ": null
    },
    {
        "arthropods": "arthropods"
    },
    {
        " , ": null
    },
    {
        "mollusks": "mollusks"
    },
    {
        " , ": null
    },
    {
        "annelids": "annelids"
    },
    {
        " , and ": null
    },
    {
        "cnidarians": "cnidarians"
    },
    {
        " .     The majority of animal species are invertebrates; one estimate puts the figure at 97%.  Many invertebrate ": null
    },
    {
        "taxa": "taxon"
    },
    {
        " have a greater number and variety of species than the entire subphylum of Vertebrata.      Some so-called invertebrates, such as the ": null
    },
    {
        "Tunicata": "tunicate"
    },
    {
        " and ": null
    },
    {
        "Cephalochordata": "lancelet"
    },
    {
        " are more closely related to vertebrates than to other invertebrates. This makes the invertebrates ": null
    },
    {
        "paraphyletic": "paraphyly"
    },
    {
        ", so the term has little meaning in ": null
    },
    {
        "taxonomy": "taxonomy"
    },
    {
        ".       The word invertebrate comes from the Latin word vertebra, which means a joint in general, and sometimes specifically a joint from the spinal column of a vertebrate. The jointed aspect of vertebra is derived from the concept of turning, expressed in the root verto or vorto, to turn.  The prefix in- means not or without .        The term invertebrates is not always precise among non-biologists since it does not accurately describe a ": null
    },
    {
        "taxon": "taxon"
    },
    {
        " in the same way that ": null
    },
    {
        "Arthropod": "arthropod"
    },
    {
        "a, ": null
    },
    {
        "Vertebrata": "vertebrata"
    },
    {
        " or ": null
    },
    {
        "Manidae": "manidae"
    },
    {
        " do. Each of these terms describes a valid taxon, ": null
    },
    {
        "phylum": "phylum"
    },
    {
        ", ": null
    },
    {
        "subphylum": "subphylum"
    },
    {
        " or ": null
    },
    {
        "family": "family"
    },
    {
        ". Invertebrata is a term of convenience, not a taxon; it has very little ": null
    },
    {
        "circumscriptional": "circumscription"
    },
    {
        " significance except within the ": null
    },
    {
        "Chordata": "chordate"
    },
    {
        ". The Vertebrata as a ": null
    },
    {
        "subphylum": "taxonomic rank"
    },
    {
        " comprises such a small proportion of the ": null
    },
    {
        "Metazoa": "animal"
    },
    {
        " that to speak of the ": null
    },
    {
        "kingdom": "kingdom"
    },
    {
        " Animal": "animal"
    },
    {
        "ia in terms of Vertebrata and Invertebrata has limited practicality. In the more formal taxonomy of Animalia other attributes that logically should precede the presence or absence of the vertebral column in constructing a ": null
    },
    {
        "cladogram": "cladogram"
    },
    {
        ", for example, the presence of a ": null
    },
    {
        "notochord": "notochord"
    },
    {
        ". That would at least circumscribe the Chordata. However, even the notochord would be a less fundamental criterion than aspects of embryological development and symmetry  or perhaps ": null
    },
    {
        "bauplan": "body plan"
    },
    {
        ".      Despite this, the concept of invertebrates as a taxon of animals has persisted for over a century among the ": null
    },
    {
        "laity": "laity"
    },
    {
        ",  and within the zoological community and in its literature it remains in use as a term of convenience for animals that are not members of the Vertebrata.  The following text reflects earlier scientific understanding of the term and of those animals which have constituted it. According to this understanding, invertebrates do not possess a skeleton of bone, either internal or external. They include hugely varied ": null
    },
    {
        "body plan": "body plan"
    },
    {
        "s. Many have fluid-filled, hydrostatic skeletons, like ": null
    },
    {
        "jellyfish": "jellyfish"
    },
    {
        " or worms. Others have hard ": null
    },
    {
        "exoskeleton": "exoskeleton"
    },
    {
        "s, outer shells like those of ": null
    },
    {
        "insects": "insect"
    },
    {
        "and ": null
    },
    {
        "crustacean": "crustacean"
    },
    {
        "s. The most familiar invertebrates include the ": null
    },
    {
        "Protozoa": "protozoa"
    },
    {
        ", ": null
    },
    {
        "Porifera": "porifera"
    },
    {
        ", ": null
    },
    {
        "Coelenterata": "coelenterata"
    },
    {
        ", ": null
    },
    {
        "Platyhelminthes": "platyhelminthes"
    },
    {
        ", ": null
    },
    {
        "Nematoda": "nematoda"
    },
    {
        ", ": null
    },
    {
        "Annelida": "annelida"
    },
    {
        ", ": null
    },
    {
        "Echinodermata": "echinodermata"
    },
    {
        ", ": null
    },
    {
        "Mollusca": "mollusca"
    },
    {
        " and ": null
    },
    {
        "Arthropoda": "arthropoda"
    },
    {
        ". Arthropoda include ": null
    },
    {
        "insect": "insect"
    },
    {
        "s, ": null
    },
    {
        "crustaceans": "crustacean"
    },
    {
        "and ": null
    },
    {
        "arachnid": "arachnid"
    },
    {
        "s.       By far the largest number of described invertebrate species are insects. The following table lists the number of described ": null
    },
    {
        "extant": "extant taxa"
    },
    {
        " species for major invertebrate groups as estimated in the ": null
    },
    {
        "IUCN Red List of Threatened Species": "iucn red list of threatened species"
    },
    {
        ", 2014.3. The World Conservation Union. 2014. ": null
    },
    {
        "IUCN Red List of Threatened Species": "iucn red list of threatened species"
    },
    {
        ", 2014.3. Summary Statistics for Globally Threatened Species.       The IUCN estimates that 66,178 extant vertebrate species have been described, which means that over 95% of the described animal species in the world are invertebrates.       The trait that is common to all invertebrates is the absence of a vertebral column : this creates a distinction between invertebrates and vertebrates. The distinction is one of convenience only; it is not based on any clear biologically homologous trait, any more than the common trait of having wings functionally unites insects, bats, and birds, or than not having wings unites tortoise s, snail s and sponge s. Being animals, invertebrates are heterotrophs, and require sustenance in the form of the consumption of other organisms. With a few exceptions, such as the Porifera , invertebrates generally have bodies composed of differentiated tissues. There is also typically a digestive chamber with one or two openings to the exterior.       The body plan s of most multicellular organism s exhibit some form of symmetry , whether radial, bilateral, or spherical. A minority, however, exhibit no symmetry. One example of asymmetric invertebrates includes all gastropod species. This is easily seen in snail s and sea snail s, which have helical shells. Slug s appear externally symmetrical, but their pneumostome is located on the right side. Other gastropods develop external asymmetry, such as Glaucus atlanticus that develops asymmetrical cerata as they mature. The origin of gastropod asymmetry is a subject of scientific debate.     Other examples of asymmetry are found in fiddler crab s and hermit crab s. They often have one claw much larger than the other. If a male fiddler loses its large claw, it will grow another on the opposite side after moulting . Sessile animals such as sponge s are asymmetrical cited at FactMonster.com from ": null
    },
    {
        "The Columbia Electronic Encyclopedia": "the columbia electronic encyclopedia"
    },
    {
        " . alongside coral colonies ; alpheidae claws that lack pincers; and some copepod s, polyopisthocotylea ns, and monogenea ns which parasitize by attachment or residency within the gill chamber of their fish hosts 19681996197819702011199719842009anatomyarthropods1998biology anastomose physiologyarthropod ecdysis 1967 Porifera anatomyAsteroideaEchinoideaOphiuroideaHolothuroideaCrinoideaPoriferaCtenophoraCnidariaEchinodermataPlatyhelminthesNematodaAnnelidaArthropodaMolluscaabout 5  mm wide worm ssee Paraphyly ": null
    }
]