[
    {
        "         Ion implantation is a low-temperature process by which ": null
    },
    {
        "ions": "ion"
    },
    {
        "of one element are accelerated into a solid target, thereby changing the physical, chemical, or electrical properties of the target. Ion implantation is used in ": null
    },
    {
        "semiconductor device fabrication": "fabrication"
    },
    {
        " and in metal finishing, as well as in ": null
    },
    {
        "materials science": "materials science"
    },
    {
        " research. The ions can alter the elemental composition of the target if they stop and remain in the target. Ion implantation also causes chemical and physical changes when the ions impinge on the target at high energy. The ": null
    },
    {
        "crystal structure": "crystal structure"
    },
    {
        " of the target can be damaged or even destroyed by the energetic ": null
    },
    {
        "collision cascade": "collision cascade"
    },
    {
        "s, and ions of sufficiently high energy can cause ": null
    },
    {
        "nuclear transmutation": "nuclear transmutation"
    },
    {
        ".          Ion implantation equipment typically consists of an ": null
    },
    {
        "ion source": "ion source"
    },
    {
        ", where ions of the desired element are produced, an ": null
    },
    {
        "accelerator": "particle accelerator"
    },
    {
        ", where the ions are electrostatically accelerated to a high energy, and a target chamber, where the ions impinge on a target, which is the material to be implanted. Thus ion implantation is a special case of ": null
    },
    {
        "particle radiation": "particle radiation"
    },
    {
        ". Each ion is typically a single atom or molecule, and thus the actual amount of material implanted in the target is the integral over time of the ion current. This amount is called the dose. The currents supplied by implants are typically small , and thus the dose which can be implanted in a reasonable amount of time is small. Therefore, ion implantation finds application in cases where the amount of chemical change required is small.     Typical ion energies are in the range of 10 to 500 ": null
    },
    {
        "keV": "electronvolt"
    },
    {
        " . Energies in the range 1 to 10 keV can be used, but result in a penetration of only a few nanometers or less. Energies lower than this result in very little damage to the target, and fall under the designation ": null
    },
    {
        "ion beam deposition": "ion beam deposition"
    },
    {
        ". Higher energies can also be used: accelerators capable of 5 MeV are common. However, there is often great structural damage to the target, and because the depth distribution is broad , the net composition change at any point in the target will be small.     The energy of the ions, as well as the ion species and the composition of the target determine the depth of penetration of the ions in the solid: A monoenergetic ion beam will generally have a broad depth distribution. The average penetration depth is called the range of the ions. Under typical circumstances ion ranges will be between 10 nanometers and 1 micrometer. Thus, ion implantation is especially useful in cases where the chemical or structural change is desired to be near the surface of the target. Ions gradually lose their energy as they travel through the solid, both from occasional collisions with target atoms and from a mild drag from overlap of electron orbitals, which is a continuous process. The loss of ion energy in the target is called ": null
    },
    {
        "stopping": "stopping power"
    },
    {
        " and can be simulated with the ": null
    },
    {
        "binary collision approximation": "binary collision approximation"
    },
    {
        " method.     Accelerator systems for ion implantation are generally classified into medium current , high current , high energy , and very high dose .     All varieties of ion implantation beamline designs contain certain general groups of functional components . The first major segment of an ion beamline includes a device known as an ion source to generate the ion species. The source is closely coupled to biased electrodes for extraction of the ions into the beamline and most often to some means of selecting a particular ion species for transport into the main accelerator section. The mass selection is often accompanied by passage of the extracted ion beam through a magnetic field region with an exit path restricted by blocking apertures, or slits , that allow only ions with a specific value of the product of mass and velocity/charge to continue down the beamline. If the target surface is larger than the ion beam diameter and a uniform distribution of implanted dose is desired over the target surface, then some combination of beam scanning and wafer motion is used. Finally, the implanted surface is coupled with some method for collecting the accumulated charge of the implanted ions so that the delivered dose can be measured in a continuous fashion and the implant process stopped at the desired dose level.          ": null
    },
    {
        "Semiconductor doping": "doping"
    },
    {
        " with boron, phosphorus, or arsenic is a common application of ion implantation. When implanted in a semiconductor, each dopant atom can create a charge carrier in the semiconductor after ": null
    },
    {
        "annealing": "annealing"
    },
    {
        ". A ": null
    },
    {
        "hole": "electron hole"
    },
    {
        " can be created for a ": null
    },
    {
        "p-type": "p-type semiconductor"
    },
    {
        " dopant, and an electron for an ": null
    },
    {
        "n-type": "n-type semiconductor"
    },
    {
        " dopant. This modifies the conductivity of the semiconductor in its vicinity. The technique is used, for example, for adjusting the threshold of a ": null
    },
    {
        "MOSFET": "mosfet"
    },
    {
        ".     Ion implantation was developed as a method of producing the p-n junction of photovoltaic devices in the late 1970s and early 1980s, A. J. Armini, S. N. Bunker and M. B. Spitzer, Non-mass-analyzed Ion Implantation Equipment for high Volume Solar Cell Production, Proc. 16th IEEE Photovoltaic Specialists Conference, 27-30 Sep 1982, San Diego California, pp. 895-899. along with the use of pulsed-electron beam for rapid annealing, G. Landis et al., Apparatus and Technique for Pulsed Electron Beam Annealing for Solar Cell Production, Proc. 15th IEEE Photovoltaic Specialists Conf., Orlando FL; 976-980 . although it has not to date been used for commercial production.       One prominent method for preparing silicon on insulator substrates from conventional ": null
    },
    {
        "silicon": "silicon"
    },
    {
        " substrates is the SIMOX process, wherein a buried high dose oxygen implant is converted to silicon oxide by a high temperature ": null
    },
    {
        "annealing": "annealing"
    },
    {
        " process.       Mesotaxy is the term for the growth of a crystallographically matching phase underneath the surface of the host crystal . In this process, ions are implanted at a high enough energy and dose into a material to create a layer of a second phase, and the temperature is controlled so that the crystal structure of the target is not destroyed. The crystal orientation of the layer can be engineered to match that of the target, even though the exact crystal structure and lattice constant may be very different. For example, after the implantation of nickel ions into a silicon wafer, a layer of ": null
    },
    {
        "nickel silicide": "nickel silicide"
    },
    {
        " can be grown in which the crystal orientation of the silicide matches that of the silicon.         Nitrogen or other ions can be implanted into a tool steel target . The structural change caused by the implantation produces a surface compression in the steel, which prevents crack propagation and thus makes the material more resistant to fracture. The chemical change can also make the tool more resistant to corrosion.       In some applications, for example prosthetic devices such as artificial joints, it is desired to have surfaces very resistant to both chemical corrosion and wear due to friction. Ion implantation is used in such cases to engineer the surfaces of such devices for more reliable performance. As in the case of tool steels, the surface modification caused by ion implantation includes both a surface compression which prevents crack propagation and an alloying of the surface to make it more chemically resistant to corrosion.         Ion implantation can be used to achieve ": null
    },
    {
        "ion beam mixing": "ion beam mixing"
    },
    {
        ", i.e. mixing up atoms of different elements at an interface. This may be useful for achieving graded interfaces or strengthening adhesion between layers of immiscible materials.     ": null
    },
    {
        "nanoparticle": "nanoparticle"
    },
    {
        " formation": null
    },
    {
        "sapphire": "sapphire"
    },
    {
        " and ": null
    },
    {
        "silica": "silica"
    },
    {
        ". The particles may be formed as a result of precipitation of the ion implanted species, they may be formed as a result of the production of an mixed oxide species that contains both the ion-implanted element and the oxide substrate, and they may be formed as a result of a reduction of the substrate, first reported by Hunt and Hampikian.    Typical ion beam energies used to produce nanoparticles range from 50 to 150 keV, with ion fluences that range from 10 16 to 10 18 ions/cm 2 .          The table below summarizes some of the work that has been done in this field for a sapphire substrate. A wide variety of nanoparticles can be formed, with size ranges from 1  nm on up to 20  nm and with compositions that can contain the implanted species, combinations of the implanted ion and substrate, or that are comprised solely from the cation associated with the substrate.     Composite materials based on dielectrics such as sapphire that contain dispersed metal nanoparticles are promising materials for ": null
    },
    {
        "optoelectronics": "optoelectronics"
    },
    {
        " and ": null
    },
    {
        "nonlinear optics": "nonlinear optics"
    },
    {
        ".     ": null
    }
]