[
    {
        "An IRC channel takeover is an acquisition of ": null
    },
    {
        "IRC channel operator": "irc channel operator"
    },
    {
        " status by someone other than the channels owner. It has largely been eliminated due to the increased use of ": null
    },
    {
        "services": "irc services"
    },
    {
        " on IRC networks.       The most common variety of channel takeover uses disconnections caused by a ": null
    },
    {
        "netsplit": "netsplit"
    },
    {
        "; this is called riding the split. After such mass disconnections, a channel may be left without users, allowing the first rejoining user to recreate the channel and gain operator status. When the servers merge, any pre-existing operators retain their status, allowing the new user to kick out the original operators and take over the channel.     A simple prevention mechanism involves  timestamp ing , or checking the creation dates of the channels being merged. This was first implemented by ": null
    },
    {
        "Undernet": "undernet"
    },
    {
        "  and is now common in many IRC servers. If both channels were created at the same time, all user statuses are retained when the two are combined; if one is newer than the other, special statuses are removed from those in the newer channel.     Additionally, a newer protection involving timestamping is used when a server splits away from the main network , it disallows anyone creating a channel to be given operator privileges.       Another popular form of channel takeover abuses nickname collision protection, which keeps two users from having the same nickname at once. A user on one side of a netsplit takes the nickname of a target on the other side of the split; when the servers reconnect, the nicks collide and both users are kicked from the server. The attacker then reconnects or switches nicks in a second client while the target reconnects, and proceeds to ": null
    },
    {
        "jupe": "jupe"
    },
    {
        " the targets nickname for a period of time.     User timestamping is often used to detect these kinds of attacks in a fashion similar to channel timestamping, with the user who selected that nickname later being kicked from the server. Another protection method, called nickhold, disallows the use of recently split nicknames. This causes fewer kicks, but causes more inconvenience to users. For this reason, timestamping is generally more common. Some servers, such as ircd-ratbox, do both. ": null
    },
    {
        "IRC services": "irc services"
    },
    {
        " and ": null
    },
    {
        "bots": "irc bot"
    },
    {
        "can also protect against such attacks by requiring that a password be supplied to use a certain nick. Users who do not provide a password are killed after a certain amount of time.       Other methods can be used to take over a channel, though they are unrelated to flaws in IRC itself; for example, ": null
    },
    {
        "cracking": "hacker"
    },
    {
        " the computers of channel operators, compromising channel bot ": null
    },
    {
        "shell account": "shell account"
    },
    {
        "s, or obtaining services passwords through ": null
    },
    {
        "social engineering": "social engineering"
    },
    {
        ".       According to Hypermedia Seduction for Terrorist Recruiting , exploiting ": null
    },
    {
        "ICMP": "internet control message protocol"
    },
    {
        " ping responses from broadcast addresses at multiple hosts sharing an Internet address, and forging the ping packets return address to match a target machines address, a single malformed packet sent to the smurf amplifier will be echoed to the target machine. This has been used to take over IRC servers. Ganor, Boaz; von Knop, Katharina; Duarte, Carlos A. M. . . ": null
    },
    {
        "IOS Press": "ios press"
    },
    {
        ". ": null
    }
]