[
    {
        "The Irish Social Season was a period of aristocratic entertainment and social functions that stretched from January to ": null
    },
    {
        "St. Patricks Day": "st. patricks day"
    },
    {
        " of a given year. During this period, the major and minor nobility left their country residences and lived in Georgian mansions in places like Rutland Square , ": null
    },
    {
        "Mountjoy Square": "mountjoy square"
    },
    {
        ", ": null
    },
    {
        "Merrion Square": "merrion square"
    },
    {
        " and ": null
    },
    {
        "Fitzwilliam Square": "fitzwilliam square"
    },
    {
        " in ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        ". Those with less financial means lived in smaller properties in streets nearby.     The focal point of the Social Season was the move of the ": null
    },
    {
        "Lord Lieutenant of Ireland": "lord lieutenant of ireland"
    },
    {
        " from his out of season residence, the ": null
    },
    {
        "Viceregal Lodge": "áras an uachtaráin"
    },
    {
        "  to live in state in the Viceregal Apartments in ": null
    },
    {
        "Dublin Castle": "dublin castle"
    },
    {
        ", where he and his wife hosted a series of levées, drawing rooms, banquets and balls in the Castle.     The period of the social season also coincided with the parliamentary sessions of the Irish House of Lords, which many of the peers in Dublin would be attending. However the Irish Parliament was abolished with the ": null
    },
    {
        "Act of Union": "act of union 1800"
    },
    {
        " which merged the Kingdoms of Great Britain and Ireland in 42     With the abolition of the lord lieutenancy in 42 the emergence of a new nationalist state  the same year, and the economic and social downturn that resulted from ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", the Social Season dwindled and then died. Most of the aristocratic homes in Merrion Square and Fitzwilliam Square were sold and are now used as corporate offices.     Among the Irish peers who would reside in Dublin during the Social Season were     Duke of Leinster ": null
    }
]