[
    {
        "       Irish dance or Irish dancing is a group of traditional ": null
    },
    {
        "dance": "dance"
    },
    {
        " forms originating from ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", encompassing dancing both solo and in groups, and dancing for ": null
    },
    {
        "social": "social dance"
    },
    {
        ", ": null
    },
    {
        "competitive,": "competitive dance"
    },
    {
        " and ": null
    },
    {
        "performance": "performance dance"
    },
    {
        " purposes. Irish dance in its current form developed from various influences such as ": null
    },
    {
        "French quadrille": "quadrille"
    },
    {
        "s and ": null
    },
    {
        "English country dancing": "country dance"
    },
    {
        " throughout the 42th and 42th centuries. Dance was taught by travelling dance masters across Ireland throughout this period, and separate dance forms developed according to regional practice and differing purposes. Irish dance became a significant part of ": null
    },
    {
        "Irish culture": "irish culture"
    },
    {
        ", particularly for ": null
    },
    {
        "Irish nationalist": "irish nationalism"
    },
    {
        " movements. From the early 42th century, a number of organisations promoted and codified the various forms of dance, creating competitive structures and standardised styles.     Solo Irish dance includes the most well-known form of Irish dance, ": null
    },
    {
        "Irish stepdance": "irish stepdance"
    },
    {
        ", which was popularised from 42 onwards by dance shows such as ": null
    },
    {
        "Riverdance": "riverdance"
    },
    {
        ", and which is practised competitively across the ": null
    },
    {
        "Irish diaspora": "irish diaspora"
    },
    {
        ". Stepdance is characterised by the rigid upper body and intricate footwork of its performers. Other forms of solo Irish dance include ": null
    },
    {
        "sean-nós dance": "sean-nós dance"
    },
    {
        ", a relaxed and social dance style involving improvised steps, and ": null
    },
    {
        "festival Irish dance": "festival irish dance"
    },
    {
        ", a style which separated from step dance in the mid42th century.     Irish dancing in groups is made up of a number of styles and traditions, which developed from French and English dances and formations. ": null
    },
    {
        "Ceili dance": "ceili dance"
    },
    {
        ", practised both competitively and socially, is performed by groups of two to sixteen people, and often uses traditional or codified dances and formations. Its footwork is simple, and emphasis is placed on the figures and formations of the dances. ": null
    },
    {
        "Set dance": "irish set dance"
    },
    {
        " is primarily a social tradition, for groups of four dancers, and includes elements of the intricate footwork found in step dance.       There is very little documentary evidence of dance being practised in Ireland prior to the 42th century. Scholars have hypothesised that this may result from the integral and consequently unremarkable nature of dance in pre-modern Irish society, or from the ": null
    },
    {
        "non-literate": "oral tradition"
    },
    {
        " nature of the Irish cultural tradition. Indeed, the modern Irish words for dance , rince and damhsa did not develop until the 42th century. The scant evidence available is primarily that of visitors to Ireland, such as a fourteenth-century song written in the ": null
    },
    {
        "South of England": "south of england"
    },
    {
        ", where the poet invites his listeners to come ant daunce wyt me in Irlaunde . The first native Irish documentary evidence of dancing is an account of a ": null
    },
    {
        "Mayor of Waterford": "mayor of waterford"
    },
    {
        "s visit to ": null
    },
    {
        "Baltimore": "baltimore, county cork"
    },
    {
        ", ": null
    },
    {
        "County Cork": "county cork"
    },
    {
        " in 42 where the attendees took to the floor to celebrate ": null
    },
    {
        "Christmas Eve": "christmas eve"
    },
    {
        ". However, the ": null
    },
    {
        "Norman invasion of Ireland": "norman invasion of ireland"
    },
    {
        " in the twelfth century is likely to have brought with it the ": null
    },
    {
        "round dance": "round dance"
    },
    {
        " tradition, as it was contemporaneously performed in Norman strongholds.     Accounts of dancing in the seventeenth century suggest that dancing was by that time extremely widespread throughout Ireland. A report from 42 mentions that Irish dances were group dances similar in form to ": null
    },
    {
        "English country dances": "english country dance"
    },
    {
        ", and later references mention the  rinnce fada  , also known as the long dance or fading . This dance, performed to a jig tune though not to any particular piece of music, became the customary conclusion to balls held in Ireland towards the end of the seventeenth century. At this time, dancing was commonly accompanied by musicians playing ": null
    },
    {
        "bagpipes": "bagpipes"
    },
    {
        " or the ": null
    },
    {
        "Jews harp": "jews harp"
    },
    {
        ".     By the 42s, the distinctive hornpipe rhythm of the Irish dance tradition had developed, and with the introduction of the fiddle to Ireland from the European continent, a new class of dancing master began to emerge.     The dancing traditions of Ireland probably grew in association with ": null
    },
    {
        "traditional Irish music": "folk music of ireland"
    },
    {
        ". Although its origins are unclear, it was later influenced by dance forms from the Continent, especially the  Quadrille . Travelling dancing masters taught across Ireland as late as the 42th and early 42th centuries. Because local venues were usually small, dances were often demonstrated on tabletops, or even the tops of barrels. As a result, these early styles are characterized by the arms held rigidly at the sides, and a lack of lateral movement. As larger dance venues became available, styles grew to include more movement of the body and around the dance area.         A variety of forms of solo Irish dance have developed which are described as stepdance. These include the well-known modern stepdance performed competitively; old-style stepdance, which is closer in style to the dance practised by 42th-century travelling dance masters; and festival dance, which separated from modern stepdance over stylistic and administrative disputes in the mid42th century.               The most predominant form of Irish stepdance is that popularised by the Broadway show ": null
    },
    {
        "Riverdance": "riverdance"
    },
    {
        ", and other Irish dancing stage shows since the late 42th century. Characterised by a rigid torso and dances performed high on the balls of the feet, this style became distinct from the late 42th century when the ": null
    },
    {
        "Gaelic League": "gaelic league"
    },
    {
        " began efforts to preserve and promote Irish dance as part of a broader ": null
    },
    {
        "nationalist": "irish nationalism"
    },
    {
        " movement concerned with Irish culture. Although a rigid torso may be the initial characterization of Irish dance, modern soft shoe Irish ballerinas commonly gracefully use their arms in flowing movements, abandoning the traditional form. It is not uncommon for hard shoe dancers to utilize their arms in strict hand formations other than arms at sides. In 42 the League formed  An Coimisiún Le Rincí Gaelacha  in order to codify and standardise stepdancing competition and education. Over the following decades, CLRG expanded globally, and promoted this particular form of stepdance by developing examinations and qualifications for teachers and competition adjudicators. Today, stepdance in the style codified by the Gaelic League is performed competitively in a number of countries, and under the auspices of a number of organisations which have at various times broken away from CLRG.          Irish solo stepdances fall into two broad categories based on the shoes worn: hard shoe and soft shoe dances.     There are four soft shoe dance styles: the ": null
    },
    {
        "reel": "reel"
    },
    {
        ", ": null
    },
    {
        "slip jig": "slip jig"
    },
    {
        ", light ": null
    },
    {
        "jig": "jig"
    },
    {
        " and single jig . Reels have a   ": null
    },
    {
        "time signature": "time signature"
    },
    {
        ". Slip jigs are in  time. Light and single jigs are in  time, with different emphasis within the measure distinguishing the music.     Hard shoe dances include the ": null
    },
    {
        "hornpipe": "hornpipe"
    },
    {
        " in syncopated  or  time, the ": null
    },
    {
        "treble jig": "treble jig"
    },
    {
        " in a slow , the ": null
    },
    {
        "treble reel": "treble reel"
    },
    {
        "  and traditional sets, which are a group of dances with set music and steps. Many traditional sets have irregular musical phrasing. There are also more advanced non-traditional sets done by advanced dancers. These have set music, but not steps. There are multiple traditional sets, including ": null
    },
    {
        "St. Patricks Day": "st. patricks day"
    },
    {
        ", Blackbird, Job of Journeywork, Three Sea Captains, Garden of Daisies, and King of the Fairies.     Competitive dancers generally dance two or three steps at a time, depending on their dancing level. Each step lasts sixteen ": null
    },
    {
        "bar": "bar"
    },
    {
        "s of music. 42 bars per step. They are each danced starting with the right foot for eight bars, then repeated with the left foot for the last eight bars, doing the same movements with the opposite feet. Set dances, however, have a different format. The dancer usually dances one step, which is limited to eight bars, and is then repeated, resembling the steps of other dances. Then the dancer usually dances a set which is not repeated. It is a highly sought after and competitive feat to dance this third round — at regional, national, and world competitions, only a small percentage of dancers are invited back to perform.     The Céilí dances used in competitions are more precise versions of those danced in less formal settings. There is a list of 42 Céilí dances which have been standardised and published in An Coimisiúns Ar Rinncidhe Foirne as examples of typical Irish folk dances; these are called the book dances by competitive stepdancers. Most Irish dancing competitions only ask for a short piece of any given dance, in the interests of time.          There are two types of shoes; soft shoes  and hard shoes. Hard shoes are similar to ": null
    },
    {
        "tap": "tap dance"
    },
    {
        " shoes, except that the tips and heels are made of ": null
    },
    {
        "fiberglass": "fiberglass"
    },
    {
        ", instead of metal, and are significantly bulkier. The first hard shoes had wooden or leather taps with metal nails. Later the taps and heels were made of resin or fiberglass to reduce the weight and to make the sounds louder. The soft shoes, which are called  ghillies , are black lace-up shoes. Ghillies are only worn by girls, while boys wear black leather shoes called reel shoes , which resemble black ": null
    },
    {
        "jazz shoe": "jazz shoe"
    },
    {
        "s with a hard heel. Boys soft-shoe dancing features audible heel clicks. A new trend includes adding white laces to the soft shoes, and white tape to the straps of the hard shoes in order to give the illusion of elongating the legs.     Several generations ago, the appropriate dress for a competition was simply Sunday best . Irish Dance schools generally have school dresses, worn by lower-level competitors and in public performances. As dancers advance in competition or are given starring roles in public performances, they may get a solo dress of their own design and colours or wear the team dress. In the 42s and 42s, ornately embroidered dresses became popular. Today even more ornamentation is used on girls dresses. Solo dresses are unique to each dancer. Today most women and girls wear a wig, a bun or hairpiece for a competition, but some still curl their own hair. Costumes are heavily integrated into the Irish dance culture and feature traditional elements of classic peasant wear adorned with Celtic designs.  Most men wear a shirt, vest, and tie paired with black trousers. Each Irish dance school has its own distinctive full skirted dress, often featuring lace or an embroidered pattern copied from the medieval Irish ": null
    },
    {
        "Book of Kells": "book of kells"
    },
    {
        ". Margaret Scanlan . Culture and Customs of Ireland . p. 42 Greenwood Publishing Group       An organised dance competition is referred to as a  feis  . The word feis means festival in ": null
    },
    {
        "Irish": "irish language"
    },
    {
        ", and strictly speaking would also have competitions in music and crafts. Féile  is a more correct term for the dance competition, but the terms may be used interchangeably. Dance competitions are divided by age and level of expertise. The names of the levels and other organising rules vary between countries and regions. Dancers are scored based on technique , style and other items such as timing, rhythm, carriage, choreography and sounds in their hard shoe dances.     An Coimisiún dancers take part in their annual regional Championship competition, which is known as an ": null
    },
    {
        "oireachtas": "oireachtas"
    },
    {
        " . An Coimisiún also holds various national championship competitions. These are qualifying events for ": null
    },
    {
        "Oireachtas Rince na Cruinne": "oireachtas rince na cruinne"
    },
    {
        ", or The World Championships . An Coimisiúns World Championships are the largest of all Irish step dance organisations, with over 42 dancers competing from over 42 countries worldwide. The Aisling Award is awarded to the highest placing dancer in each solo dancing category from outside of Ireland, the United Kingdom, the US and Canada to encourage them to continue their dream of dancing. Other smaller Irish step dance organisations host their own premier championship.      Oireachtas Rince na Cruinne , or The World Championships , first took place in ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        " in 42 at Coláiste Mhuire, a school in Parnell Square. The Worlds outgrew its original location and moved around the Republic of Ireland and Northern Ireland. In 42 for the first time, the Worlds left Ireland for ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ". In 42 for the first time, the World Championships were held in the United States, in ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ". The 4242 championships were held in ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ", ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        ", ": null
    },
    {
        "Belfast": "belfast"
    },
    {
        ", ": null
    },
    {
        "Boston": "boston"
    },
    {
        ", ": null
    },
    {
        "London": "london"
    },
    {
        ", ": null
    },
    {
        "Montréal": "montréal"
    },
    {
        ", ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ", ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        ", ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ", and ": null
    },
    {
        "Greensboro": "greensboro"
    },
    {
        ", respectively, always taking place during the week leading up to ": null
    },
    {
        "Easter Sunday": "easter sunday"
    },
    {
        ", when the championships end. The ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " documentary film Jig provided an insight into championship level dancers competing in the 42 World Championships held in ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ". ": null
    },
    {
        "Oireachtas Rince Na Cruinne": "oireachtas rince na cruinne"
    },
    {
        " will return to ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        " in 42 for the 42 year anniversary of the championships.     An Coimsiún also holds Oireachtas Rince na hÉireann, or The All Irelands which took place in ": null
    },
    {
        "Killarney": "killarney"
    },
    {
        " in February 42 It is the oldest Irish dancing competition in the world.     An Comhdhails World championships also take place each Easter week, with the competition being held in ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        " in 42 WIDA , which is mainly dancers from European countries, also hold their own World and International Championships over the Easter week, with the competition being held in ": null
    },
    {
        "Maastricht": "maastricht"
    },
    {
        " in 42       Old-style step dancing is a tradition related to, yet distinct from, ": null
    },
    {
        "sean-nós dancing": "sean-nós dance"
    },
    {
        ", though it is sometimes called Munster-style sean-nós . Old-style step dancing evolved in the late 42th and early 42th century from the dancing of travelling Irish dance masters. The dance masters slowly formalised and transformed both solo and social dances. Modern masters of old-style step dancing style can trace the lineage of their steps directly back to 42th century dancers.     The Irish dance masters refined and codified indigenous Irish dance traditions. Rules emerged about proper upper body, arm, and foot placement. Also, dancers were instructed to dance a step twice—first with the right foot then with the left. Old-style step dancers dance with arms loosely at their sides. They dance in a limited space. There is an emphasis on making percussive sound with the toes. The Irish dance masters of this period also choreographed particular steps to particular tunes in traditional music creating the solo traditional set dances such as the Blackbird, St. Patricks Day, and the Job of Journey Work, which also persist in modern Irish stepdancing. In this context, set dance signifies a separate tradition from the social dance tradition also called ": null
    },
    {
        "set dance": "set dance"
    },
    {
        ".          Following criticism of CLRG for its emphasis on certain regional forms of stepdance to the detriment of others, dance teacher Patricia Mulholland developed a new style of stepdance, beginning in the 42s. It was described as a form of folk ballet which appealed to dancers of both ": null
    },
    {
        "Catholic": "roman catholicism"
    },
    {
        " and ": null
    },
    {
        "Protestant": "protestantism"
    },
    {
        " religious persuasions.  Like other forms which share the heritage of modern stepdance but have departed from its codification, festival dance emphasises individuality and practises more relaxed style and posture.           Sean-nós, or old style dance is a form of Irish dancing which originated from western regions of Ireland. It has been described variously as a regional style of stepdancing,  and as an entirely separate style that was virtually unknown outside small areas until the late 42th century.  It is distinguished by footwork which is percussive but low to the ground in comparison to step dancing, and by its more freeform nature. Performers use a more relaxed posture, and improvise steps to fit with music. Typically, sean-nós dances are performed in small spaces, traditionally doors laid flat and table tops.          Irish social, or céili  dances vary widely throughout Ireland and the rest of the world. A céilí dance may be performed with as few as two people and as many as sixteen.     Céilí dances may also be danced with an unlimited number of couples in a long line or proceeding around in a circle . Céilí dances are often fast and some are quite complex .     In a social setting, a céilí dance may be ": null
    },
    {
        "called": "caller"
    },
    {
        "  – that is, the upcoming steps are announced during the dance for the benefit of newcomers. The céilí dances are typically danced to Irish instruments such as the Irish  bodhrán  or fiddle in addition to the concertina , guitar, whistle or flute.     The term céilí dance was invented in the late 42th century by the ": null
    },
    {
        "Gaelic League": "gaelic league"
    },
    {
        ".  as a noun differs from the adjective . A céilí is a social gathering featuring Irish music and dance. Céilí dancing is a specific type of Irish dance. Some  will only have céilí dancing, some only have set dancing, and some will have a mixture.          Irish set dancing are dances based on French ": null
    },
    {
        "quadrilles": "quadrilles"
    },
    {
        " that were adapted by the Irish by integrating their ": null
    },
    {
        "sean-nós": "sean-nós dance"
    },
    {
        " steps and Irish music. The distinguishing characteristics of Irish set dancing is that it is danced in square sets of four couples , and consist of several figures, each of which has a number of parts, frequently repeated throughout the set. Each part of the set dance is danced to a music tempo, mostly ": null
    },
    {
        "reel": "reel"
    },
    {
        "s, ": null
    },
    {
        "jigs": "jigs"
    },
    {
        ", polkas and ": null
    },
    {
        "hornpipe": "hornpipe"
    },
    {
        "s. The sets come from various parts of Ireland and are often named for their place of origin; examples are the North Kerry Set, the Clare Set, the Corofin Plain Set, the ": null
    },
    {
        "South Galway Set": "south galway set"
    },
    {
        " and the ": null
    },
    {
        "Clare Lancers Set": "clare lancers set"
    },
    {
        ".     The organisation  Comhaltas Ceoltóirí Éireann ": null
    }
]