[
    {
        "                 Iron Maiden are an English ": null
    },
    {
        "heavy metal": "heavy metal music"
    },
    {
        " band formed in ": null
    },
    {
        "Leyton": "leyton"
    },
    {
        ", East London, in 42 by bassist and primary songwriter ": null
    },
    {
        "Steve Harris": "steve harris"
    },
    {
        ". The bands ": null
    },
    {
        "discography": "iron maiden discography"
    },
    {
        " has grown to thirty-nine albums, including sixteen studio albums, twelve live albums, four ": null
    },
    {
        "EPs": "extended play"
    },
    {
        ", and seven ": null
    },
    {
        "compilations": "compilation album"
    },
    {
        ".     Pioneers of the ": null
    },
    {
        "new wave of British heavy metal": "new wave of british heavy metal"
    },
    {
        ", Iron Maiden achieved initial success during the early 42s. After several line-up changes, the band went on to release a series of UK and US platinum and gold albums, including 42s  The Number of the Beast , 42s  Piece of Mind , 42s  Powerslave , 42s live release  Live After Death , 42s  Somewhere in Time  and 42s  Seventh Son of a Seventh Son . Since the return of lead vocalist ": null
    },
    {
        "Bruce Dickinson": "bruce dickinson"
    },
    {
        " and guitarist ": null
    },
    {
        "Adrian Smith": "adrian smith"
    },
    {
        " in 42 the band has undergone a resurgence in popularity, with their 42 studio offering,  The Final Frontier , peaking at No.  42 in 42  countries and receiving widespread critical acclaim. Their sixteenth studio album,  The Book of Souls , was released on 42 September 42 to similar success.     Despite little radio or television support, Iron Maiden are considered one of the most successful heavy metal bands in history, with  The Sunday Times  reporting in 42 that the band have sold over 42  million copies of their albums worldwide. The band won the ": null
    },
    {
        "Ivor Novello Award": "ivor novello awards"
    },
    {
        " for international achievement in 42 , the band have played over ": null
    },
    {
        "42 live shows": "list of iron maiden concert tours"
    },
    {
        " throughout their career. For 42  years the band have been supported by their famous mascot, ": null
    },
    {
        "Eddie": "eddie"
    },
    {
        " , who has appeared on almost all of their album and single covers, as well as in their live shows.                Iron Maiden were formed on Christmas Day, 42 December 42 by bassist ": null
    },
    {
        "Steve Harris": "steve harris"
    },
    {
        " shortly after he left his previous group, Smiler. Harris attributed the bands name to a film adaptation of  The Man in the Iron Mask  from the novel by ": null
    },
    {
        "Alexandre Dumas": "alexandre dumas"
    },
    {
        ", the title of which reminded him of the ": null
    },
    {
        "iron maiden torture device": "iron maiden"
    },
    {
        ". After months of rehearsal, Iron Maiden made their debut at St. Nicks Hall in Poplar on 42 May 42 before taking up a semi-residency at the Cart and Horses Pub in ": null
    },
    {
        "Maryland": "maryland, london"
    },
    {
        ", Stratford.     The original line-up was short-lived, with vocalist ": null
    },
    {
        "Paul Day": "paul day"
    },
    {
        " being the first casualty as, according to Harris, he lacked energy or charisma on stage . He was replaced by Dennis Wilcock, a ": null
    },
    {
        "Kiss": "kiss"
    },
    {
        " fan who used make-up and fake blood during live performances. Wilcocks friend, ": null
    },
    {
        "Dave Murray": "dave murray"
    },
    {
        ", was invited to join, much to the dismay of the bands guitarists Dave Sullivan and Terry Rance. Their frustration led Harris to temporarily disband Iron Maiden in 42 though the group reformed soon after with Murray as the sole guitarist. Harris and Murray remain the bands longest-standing members and have performed on all of their releases.        Iron Maiden recruited yet another guitarist in 42 Bob Sawyer, who was sacked for embarrassing the band on stage by pretending to play guitar with his teeth. Tension ensued again, causing a rift between Murray and Wilcock, who convinced Harris to fire Murray, as well as original drummer Ron Matthews. A new line-up was put together, including future ": null
    },
    {
        "Cutting Crew": "cutting crew"
    },
    {
        " member ": null
    },
    {
        "Tony Moore": "tony moore"
    },
    {
        " on keyboards, Terry Wapram on guitar, and drummer ": null
    },
    {
        "Barry Purkis": "thunderstick"
    },
    {
        " . A poor performance at the Bridgehouse, a pub located in Canning Town, in November 42 was the line-ups first and only concert. Afterwards, Iron Maiden fired Purkis and replaced him with ": null
    },
    {
        "Doug Sampson": "doug sampson"
    },
    {
        ". At the same time, Moore was asked to leave as Harris decided that keyboards did not suit the bands sound. A few months later, Dennis Wilcock decided to leave Iron Maiden to form his own band, V42 and Dave Murray was immediately reinstated. As he preferred to be the bands sole guitarist, Wapram disapproved of Murrays return, and was also dismissed.     Harris, Murray, and Sampson spent the summer and autumn of 42 rehearsing while they searched for a singer to complete the bands new line-up. A chance meeting at the Red Lion pub in ": null
    },
    {
        "Leytonstone": "leytonstone"
    },
    {
        " in November 42 evolved into a successful audition for vocalist ": null
    },
    {
        "Paul DiAnno": "paul dianno"
    },
    {
        ". Steve Harris stated, Theres sort of a quality in Pauls voice, a raspiness in his voice, or whatever you want to call it, that just gave it this great edge.  At this time, Murray would typically act as their sole guitarist, with Harris commenting, Davey was so good he could do a lot of it on his own. The plan was always to get a second guitarist in, but finding one that could match Davey was really difficult.             On New Years Eve 42 Iron Maiden recorded a demo, consisting of four songs, at Spaceward Studios in Cambridge. Hoping that the recording would help them secure more gigs, the band presented a copy to ": null
    },
    {
        "Neal Kay": "neal kay"
    },
    {
        ", then managing a heavy metal club called Bandwagon Heavy Metal Soundhouse , located in Kingsbury Circle, northwest London. Upon hearing the tape, Kay began playing the demo regularly at the Bandwagon, and one of the songs, Prowler , eventually went to No.  42 in the Soundhouse charts, which were published weekly in  Sounds  magazine. A copy was also acquired by ": null
    },
    {
        "Rod Smallwood": "rod smallwood"
    },
    {
        ", who soon became the bands manager, and, as Iron Maidens popularity increased, they released the demo on their own record label as  The Soundhouse Tapes , named after the club. Featuring only three tracks  all five thousand copies were sold out within weeks.     In December 42 the band secured a major record deal with ": null
    },
    {
        "EMI": "emi"
    },
    {
        ", and asked Dave Murrays childhood friend, ": null
    },
    {
        "Adrian Smith": "adrian smith"
    },
    {
        " of ": null
    },
    {
        "Urchin": "urchin"
    },
    {
        ", to join the group as their second guitarist. Due to his commitment to Urchin, Smith declined and ": null
    },
    {
        "Dennis Stratton": "dennis stratton"
    },
    {
        " was hired instead. Shortly afterwards, ": null
    },
    {
        "Doug Sampson": "doug sampson"
    },
    {
        " left due to health issues, and was replaced by ex-": null
    },
    {
        "Samson": "samson"
    },
    {
        " drummer ": null
    },
    {
        "Clive Burr": "clive burr"
    },
    {
        " at Strattons suggestion on 42 December 42 Iron Maidens first appearance on an album was on the  Metal for Muthas  compilation with two early versions of ": null
    },
    {
        "Sanctuary": "sanctuary"
    },
    {
        " and Wrathchild . The release led to an ": null
    },
    {
        "ensuing tour": "metal for muthas tour"
    },
    {
        " which featured several other bands linked with the ": null
    },
    {
        "new wave of British heavy metal": "new wave of british heavy metal"
    },
    {
        ".        Iron Maiden released their eponymous ": null
    },
    {
        "self-titled album": "iron maiden"
    },
    {
        " in 42 which debuted at No.  42 in the ": null
    },
    {
        "UK Albums Chart": "uk albums chart"
    },
    {
        ". In addition to the title track , the album includes other early favourites such as ": null
    },
    {
        "Running Free": "running free"
    },
    {
        " , Transylvania , Phantom of the Opera , and ": null
    },
    {
        "Sanctuary": "sanctuary"
    },
    {
        " – which was not on the original UK release, but appeared on the US version and subsequent remasters. The band embarked on a ": null
    },
    {
        "headline tour of the UK": "iron maiden tour"
    },
    {
        ", before opening for ": null
    },
    {
        "Kiss": "kiss"
    },
    {
        " on their 42 ": null
    },
    {
        "Unmasked Tour": "unmasked tour"
    },
    {
        "s European leg as well as supporting ": null
    },
    {
        "Judas Priest": "judas priest"
    },
    {
        " on ": null
    },
    {
        "select dates": "british steel tour"
    },
    {
        ". Iron Maiden also appeared, to much acclaim, at the Reading Festival 42 They were second to top of the bill on the Saturday, with ": null
    },
    {
        "UFO": "ufo"
    },
    {
        " headlining. After the Kiss tour, ": null
    },
    {
        "Dennis Stratton": "dennis stratton"
    },
    {
        " was dismissed from the band as a result of creative and personal differences, and was replaced by ": null
    },
    {
        "Adrian Smith": "adrian smith"
    },
    {
        " in October 42     In 42 Iron Maiden released their second studio album,  Killers . Containing many tracks written prior to their debut release, only two new songs were written for the record: Prodigal Son and Murders in the Rue Morgue  . Unsatisfied with the production on their debut album, the band hired veteran producer ": null
    },
    {
        "Martin Birch": "martin birch"
    },
    {
        ", who would go on to work for Iron Maiden until his retirement in 42 The record was followed by the bands first ": null
    },
    {
        "world tour": "killer world tour"
    },
    {
        ", which included their debut performance in the United States, opening for Judas Priest at ": null
    },
    {
        "The Aladdin Casino": "planet hollywood resort and casino"
    },
    {
        " in Las Vegas.            By 42 ": null
    },
    {
        "Paul DiAnno": "paul dianno"
    },
    {
        " was demonstrating increasingly self-destructive behaviour, particularly due to his drug usage, about which DiAnno comments, it wasnt just that I was snorting a bit of coke, though; I was just going for it non-stop, 42 hours a day, every day  ... the band had commitments piling up that went on for months, years, and I just couldnt see my way to the end of it. I knew Id never last the whole tour. It was too much.  With his performances waning, DiAnno was immediately dismissed following the Killer World Tour, at which point the band had already selected his replacement.     After a meeting with Rod Smallwood at the ": null
    },
    {
        "Reading Festival": "reading and leeds festivals"
    },
    {
        ", ": null
    },
    {
        "Bruce Dickinson": "bruce dickinson"
    },
    {
        ", previously of ": null
    },
    {
        "Samson": "samson"
    },
    {
        ", auditioned for Iron Maiden in September 42 and was immediately hired. The following month, Dickinson went out on the road with the band on a small headlining tour in Italy, as well as a one-off show at the ": null
    },
    {
        "Rainbow Theatre": "rainbow theatre"
    },
    {
        " in the UK. For the last show, and in anticipation of their forthcoming album, the band played Children of the Damned and 42 Acacia Avenue , introducing fans to the sound towards which they were progressing.     In 42 Iron Maiden released their third studio album,  The Number of the Beast , which gave the band their first UK Albums Chart No.  42 record and additionally became a Top Ten hit in many other countries. At the time, Dickinson was in the midst of legal difficulties with Samsons management, and was not permitted to add his name to any of the songwriting credits, although he still made what he described as a moral contribution to Children of the Damned , The Prisoner and ": null
    },
    {
        "Run to the Hills": "run to the hills"
    },
    {
        " . For the second time the band embarked on a world tour, dubbed ": null
    },
    {
        "The Beast on the Road": "the beast on the road"
    },
    {
        ", during which they visited North America, Japan, Australia, and Europe, including a headline appearance at the Reading Festival. A new and hugely successful chapter in Iron Maidens future was cemented; in 42  The New York Times  reported that the album had sold over 42 million copies worldwide.     The Beast on the Roads US leg proved controversial when an American conservative political lobbying group claimed that Iron Maiden were ": null
    },
    {
        "Satanic": "satanism"
    },
    {
        " because of the new albums title track, to the point where a group of Christian ": null
    },
    {
        "activists": "activism"
    },
    {
        " destroyed Iron Maiden records as a protest against the band. In recent years, Dickinson stated that the band treated this as silliness , and that the demonstrations in fact gave them loads of publicity .        In December 42 drummer ": null
    },
    {
        "Clive Burr": "clive burr"
    },
    {
        " was fired from the band and replaced by ": null
    },
    {
        "Nicko McBrain": "nicko mcbrain"
    },
    {
        ", who previously played for ": null
    },
    {
        "Trust": "trust"
    },
    {
        ". Although Harris stated that his dismissal took place because his live performances were affected by offstage activities, Burr objected to this, and claimed that he was unfairly ousted from the band. Soon afterwards, the band journeyed for the first time to The Bahamas to record the first of three consecutive albums at ": null
    },
    {
        "Compass Point Studios": "compass point studios"
    },
    {
        ". In 42 they released their fourth studio album,  Piece of Mind , which reached the No.  42 spot in the UK, and was the bands debut in the North American charts, reaching No.  42 on the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        ". Piece of Mind includes the successful singles, ": null
    },
    {
        "The Trooper": "the trooper"
    },
    {
        " and ": null
    },
    {
        "Flight of Icarus": "flight of icarus"
    },
    {
        " , the latter of which being particularly notable as one of the bands few songs to gain substantial airplay in the US.     Soon after the success of Piece of Mind and its ": null
    },
    {
        "supporting tour": "world piece tour"
    },
    {
        ", the band released their fifth studio album,  Powerslave , on 42 September 42 The album features the singles ": null
    },
    {
        "42 Minutes to Midnight": "2 minutes to midnight"
    },
    {
        " , ": null
    },
    {
        "Aces High": "aces high"
    },
    {
        " , as well as Rime of The Ancient Mariner , based on ": null
    },
    {
        "Samuel Taylor Coleridge": "samuel taylor coleridge"
    },
    {
        "s ": null
    },
    {
        "poem of the same name": "rime of the ancient mariner"
    },
    {
        ", and running over 42 minutes in length.     The tour, following the album, dubbed the ": null
    },
    {
        "World Slavery Tour": "world slavery tour"
    },
    {
        ", was the bands largest to date, and consisted of 42 shows in 42 countries over 42 months, playing to an estimated 42,42 people. Many shows were played back-to-back in the same city, such as in Long Beach, California, where the band played four consecutive concerts. Their first live album,  Live After Death , was recorded, which became a critical and commercial success, peaking at No.  42 in the UK. Iron Maiden also made their debut appearance in South America, where they co-headlined  the ": null
    },
    {
        "Rock in Rio": "rock in rio"
    },
    {
        " festival to an estimated 42 in attendance. The tour was physically gruelling for the band, who demanded six months off when it ended . This was the first substantial break in the groups history, including the cancellation of a proposed supporting tour for the new live album, with Bruce Dickinson threatening to quit unless the tour ended.            Returning from their time off, the band adopted a different style for their 42 studio album, entitled  Somewhere in Time , featuring, for the first time in the bands history, ": null
    },
    {
        "synthesised": "synthesiser"
    },
    {
        " bass and guitars to add textures and layers to the sound. The release charted well across the world, particularly with the single ": null
    },
    {
        "Wasted Years": "wasted years"
    },
    {
        " , but notably included no writing credits from Dickinson, whose material was rejected by the rest of the band. While Dickinson was focused on his own music, guitarist Adrian Smith, who typically collaborated with the vocalist, was left to own devices and began writing songs on his own, coming up with Wasted Years , Sea of Madness , and ": null
    },
    {
        "Stranger in a Strange Land": "stranger in a strange land"
    },
    {
        " , the last of which would be the albums second single.     The experimentation evident on Somewhere in Time continued on their next album, entitled  Seventh Son of a Seventh Son , which was released in 42 A ": null
    },
    {
        "concept album": "concept album"
    },
    {
        ", based on the 42 novel  Seventh Son  by ": null
    },
    {
        "Orson Scott Card": "orson scott card"
    },
    {
        ", would be the bands first record to include keyboards, performed by Harris and Smith, as opposed to ": null
    },
    {
        "guitar synthesisers": "guitar synthesizer"
    },
    {
        " on the previous release. After his contributions were not used for Somewhere in Time, Dickinsons enthusiasm was renewed as his ideas were accepted for this album. Another popular release, it became Iron Maidens second album to hit No.  42 in the UK charts, although it only achieved a Gold certification in the US, in contrast to its four predecessors.     During the following ": null
    },
    {
        "tour": "seventh tour of a seventh tour"
    },
    {
        ", the band headlined the ": null
    },
    {
        "Monsters of Rock": "monsters of rock"
    },
    {
        " festival at ": null
    },
    {
        "Donington Park": "donington park"
    },
    {
        " for the first time on 42 August 42 playing to the largest crowd in the festivals history, with an estimated 42 in attendance. Also included on the bill were ": null
    },
    {
        "Kiss": "kiss"
    },
    {
        ", ": null
    },
    {
        "David Lee Roth": "david lee roth"
    },
    {
        ", ": null
    },
    {
        "Megadeth": "megadeth"
    },
    {
        ", ": null
    },
    {
        "Guns N Roses": "guns n roses"
    },
    {
        ", and ": null
    },
    {
        "Helloween": "helloween"
    },
    {
        ". The festival was marred, however, by the deaths of two fans in a crowd-surge during the aforementioned Guns N Roses performance; the following years festival was cancelled as a result. The tour concluded with several headline shows in the UK in November and December 42 with the concerts at the ": null
    },
    {
        "NEC Arena": "national exhibition centre"
    },
    {
        ", Birmingham recorded for a live video, entitled  Maiden England . Throughout the tour, Harris bass technician, Michael Kenney, provided live keyboards. Kenney has acted as the bands live keyboard player ever since, also performing on the bands four following albums before Harris took over as the groups sole studio keyboardist from 42s  Brave New World .            During another break in 42 guitarist Adrian Smith released a solo album with his band ": null
    },
    {
        "ASAP": "asap"
    },
    {
        ", entitled  Silver and Gold , and vocalist Bruce Dickinson began work on a solo album with former ": null
    },
    {
        "Gillan": "gillan"
    },
    {
        " guitarist ": null
    },
    {
        "Janick Gers": "janick gers"
    },
    {
        ", releasing  Tattooed Millionaire  in 42 followed by a tour. At the same time, to mark the bands ten-year recording anniversary, Iron Maiden released a compilation collection,  The First Ten Years , a series of ten CDs and double ": null
    },
    {
        "42-inch single": "12-inch single"
    },
    {
        "s. Between 42 February and 42 April 42 the individual parts were released one-by-one, each containing two of Iron Maidens singles, including the original B-sides.     Soon afterwards, Iron Maiden regrouped to work on a new studio record. During the pre-production stages, Adrian Smith left the band due to differences with Steve Harris, regarding the direction the band should be taking, disagreeing with the stripped down style that they were leaning towards. Janick Gers, having worked on Dickinsons solo project, was chosen to replace Smith, and became the bands first new member in seven years. The album,  No Prayer for the Dying , was released in October 42 and contained ": null
    },
    {
        "Bring Your Daughter... to the Slaughter": "bring your daughter... to the slaughter"
    },
    {
        " , the bands first ": null
    },
    {
        "UK Singles Chart": "uk singles chart"
    },
    {
        " No.  42 originally recorded by Dickinsons solo outfit for the soundtrack to  A Nightmare on Elm Street 42: The Dream Child . The song was banned by the BBC and only a 42-second live clip on Top of the Pops was shown.     After another ": null
    },
    {
        "tour": "no prayer on the road"
    },
    {
        " and some more time off, the band recorded their next studio album,  Fear of the Dark , which was released in 42 and included the stand-out ": null
    },
    {
        "title track": "fear of the dark"
    },
    {
        ", which is now a regular fixture in the bands concert setlists. Achieving their third No.  42 in the UK albums chart, the disc also featured the No.  42 single ": null
    },
    {
        "Be Quick or Be Dead": "be quick or be dead"
    },
    {
        " and the No.  42 single ": null
    },
    {
        "From Here to Eternity": "from here to eternity"
    },
    {
        " . The album featured the first songwriting by Gers, and no collaboration at all between Harris and Dickinson on songs. The ": null
    },
    {
        "extensive worldwide tour that followed": "fear of the dark tour"
    },
    {
        " included their first ever Latin American leg , and headlining the ": null
    },
    {
        "Monsters of Rock": "monsters of rock"
    },
    {
        " festivals in seven European countries. Iron Maidens second performance at ": null
    },
    {
        "Donington Park": "donington park"
    },
    {
        ", to an audience of 42 , was filmed for the audio and video release,  Live at Donington , and featured a guest appearance by Adrian Smith, who joined the band to perform Running Free .     In 42 Dickinson left the band to further pursue his solo career, but agreed to remain for a ": null
    },
    {
        "farewell tour": "real live tour"
    },
    {
        " and two live albums . The first,  A Real Live One , featured songs from 42 to 42 and was released in March 42 The second,  A Real Dead One , featured songs from 42 to 42 and was released after Dickinson had left the band. The tour did not go well, with Steve Harris claiming that Dickinson would only perform properly for high-profile shows, and that at several concerts, he would only mumble into the microphone. Dickinson denied that he was under-performing, stating that it was impossible to make like Mr Happy Face if the vibe wasnt right , saying that news of his exit from the band had prevented any chance of a good atmosphere during the tour. He played his farewell show with Iron Maiden on 42 August 42 which was filmed, broadcast by the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ", and released on video under the name  Raising Hell .     The X Factor and Virtual XI      In 42 the band listened to hundreds of tapes sent in by vocalists before convincing ": null
    },
    {
        "Blaze Bayley": "blaze bayley"
    },
    {
        ", formerly of the band ": null
    },
    {
        "Wolfsbane": "wolfsbane"
    },
    {
        ", who had supported Iron Maiden in 42 to audition for them. Harris preferred choice from the outset, Bayley had a different vocal style from his predecessor, which ultimately received a mixed reception among fans.     After a two-year hiatus , Iron Maiden returned in 42 Releasing their next studio album,  The X Factor , the band had their lowest chart position since 42 for an album in the UK , although it would go on to win Album of the Year awards in France and Germany. The record included the 42-minute epic Sign of the Cross , the bands longest song since Rime of the Ancient Mariner , as well as the singles, ": null
    },
    {
        "Man on the Edge": "man on the edge"
    },
    {
        " , based on the film  Falling Down , and ": null
    },
    {
        "Lord of the Flies": "lord of the flies"
    },
    {
        " , based on the ": null
    },
    {
        "novel of the same name": "lord of the flies"
    },
    {
        ". The release is notable for its dark tone, inspired by Steve Harris divorce. ": null
    },
    {
        "The band toured": "the x factour"
    },
    {
        " for the rest of 42 and 42 playing for the first time in Israel and South Africa, and ending in the ": null
    },
    {
        "Americas": "americas"
    },
    {
        ". After the tour, Iron Maiden released a compilation album,  Best of the Beast . The bands first compilation, it included a new single, ": null
    },
    {
        "Virus": "virus"
    },
    {
        " , in which the lyrics attack the critics, who had recently written off the band.     In 42 Iron Maiden released  Virtual XI , whose chart scores were the bands lowest to date, failing to score one million worldwide sales for the first time in the bands history. The album peaked at No.  42 in the UK; the bands lowest for a new studio record. At the same time, Steve Harris assisted in remastering the bands entire discography, up to and including Live at Donington .     Bayleys tenure in Iron Maiden ended in January 42 when he was asked to leave during a band meeting. The dismissal took place due to issues Bayley had experienced with his voice during the ": null
    },
    {
        "Virtual XI World Tour": "virtual xi world tour"
    },
    {
        ", although Janick Gers stated that this was partly the bands fault for forcing him to perform songs pitched outside the natural range of his voice.     Brave New World         While the group were considering a replacement for Bayley, Rod Smallwood convinced Steve Harris to invite Bruce Dickinson back into the band. Although Harris admitted that he wasnt really into it at first, he then thought, Well, if the change happens, who should we get? The thing is, we know Bruce and we know what hes capable of, and you think, Well, better the devil you know. I mean, we got on well professionally for, like, eleven years, and so  ... after I thought about it, I didnt really have a problem with it.      The band entered into talks with Dickinson, who agreed to rejoin during a meeting in Brighton in January 42 along with guitarist Adrian Smith, who was telephoned a few hours later. With Gers, Smiths replacement, remaining, Iron Maiden now had a three-guitar line-up, and embarked on a hugely successful reunion tour. Dubbed ": null
    },
    {
        "The Ed Hunter Tour": "the ed hunter tour"
    },
    {
        ", it tied in with the bands newly released greatest hits collection,  Ed Hunter , whose track listing was decided by a poll on the groups website, and also contained a computer game of the same name starring ": null
    },
    {
        "the bands mascot": "eddie"
    },
    {
        ".     One of Dickinsons primary concerns on rejoining the group was whether we would in fact be making a real state-of-the-art record and not just a comeback album,  which eventually took the form of 42s  Brave New World . Having disliked the results from Harris personal studio, Barnyard Studios located on his property in Essex, which had been used for the last four Iron Maiden studio albums, the band recorded the new release at Guillaume Tell Studios in Paris, France in November 42 with producer ": null
    },
    {
        "Kevin Shirley": "kevin shirley"
    },
    {
        ". Thematic influences continued with ": null
    },
    {
        "The Wicker Man": "the wicker man"
    },
    {
        " – based on the 42 British ": null
    },
    {
        "cult film of the same name": "the wicker man"
    },
    {
        " – and Brave New World – title taken from the ": null
    },
    {
        "Aldous Huxley": "aldous huxley"
    },
    {
        " novel of the same name": "brave new world"
    },
    {
        ". The album furthered the more progressive and melodic sound present in some earlier recordings, with elaborate song structures and keyboard orchestration.     ": null
    },
    {
        "The world tour": "brave new world tour"
    },
    {
        " that followed consisted of well over 42  dates and culminated on 42 January 42 in a show at the ": null
    },
    {
        "Rock in Rio": "rock in rio"
    },
    {
        " festival in Brazil, where Iron Maiden played to an audience of around 42. While the performance was being produced for a CD and DVD release in March 42 under the name  Rock in Rio , the band took a year off from touring, during which they played three consecutive shows at ": null
    },
    {
        "Brixton Academy": "brixton academy"
    },
    {
        " in aid of former drummer ": null
    },
    {
        "Clive Burr": "clive burr"
    },
    {
        ", who had recently announced that he had been diagnosed with ": null
    },
    {
        "multiple sclerosis": "multiple sclerosis"
    },
    {
        ". The band performed two further concerts for Burrs MS Trust Fund charity in 42 and 42 before his death in 42     Dance of Death and A Matter of Life and Death      Following their ": null
    },
    {
        "Give Me Ed... Til Im Dead Tour": "give me ed... til im dead tour"
    },
    {
        " in the summer of 42 Iron Maiden released  Dance of Death , their thirteenth studio album, which was met by worldwide critical and commercial success. Produced by Kevin Shirley, now the bands regular producer, many critics also felt that this release matched up to their earlier efforts, such as Killers, Piece of Mind and The Number of the Beast. As usual, historical, and literary references were present, with Montségur in particular being about the ": null
    },
    {
        "Cathar": "catharism"
    },
    {
        " stronghold conquered in 42 and Paschendale relating to ": null
    },
    {
        "the significant battle": "battle of passchendaele"
    },
    {
        " which took place during ": null
    },
    {
        "the First World War": "world war i"
    },
    {
        ". During the ": null
    },
    {
        "following tour": "dance of death world tour"
    },
    {
        ", the bands performance at ": null
    },
    {
        "Westfalenhalle": "westfalenhalle"
    },
    {
        ", in Dortmund, Germany, was recorded and released in August 42 as a live album and DVD, entitled  Death on the Road .     In 42 the band announced the ": null
    },
    {
        "Eddie Rips Up the World Tour": "eddie rips up the world tour"
    },
    {
        ", which, tying in with their 42 DVD entitled  The History of Iron Maiden – Part 42: The Early Days , only featured material from their first four albums. As part of this celebration of their earlier years, The Number of the Beast single was re-released and went straight to No.  42 in the UK Chart. The tour included many headlining stadium and festival dates, including a performance at ": null
    },
    {
        "Ullevi Stadium": "ullevi stadium"
    },
    {
        " in Sweden to an audience of almost 42. This concert was also broadcast live on satellite television all over Europe to approximately 42 million viewers. Following this run of European shows, the band co-headlined the US festival tour, ": null
    },
    {
        "Ozzfest": "ozzfest"
    },
    {
        ", with ": null
    },
    {
        "Black Sabbath": "black sabbath"
    },
    {
        ", their final performance at which earned international press coverage after their show was sabotaged by singer ": null
    },
    {
        "Ozzy Osbourne": "ozzy osbourne"
    },
    {
        "s family, who took offence to Dickinsons remarks against reality-TV. The band completed the tour by headlining the ": null
    },
    {
        "Reading and Leeds Festivals": "reading and leeds festivals"
    },
    {
        " on the 42–42 August, and the ": null
    },
    {
        "RDS Stadium": "rds arena"
    },
    {
        " in Ireland on 42 August. For the second time, the band played a charity show for The Clive Burr MS Trust Fund, which took place at the ": null
    },
    {
        "Hammersmith Apollo": "hammersmith apollo"
    },
    {
        ". The same year, the band were inducted into the ": null
    },
    {
        "Hollywood RockWalk": "guitar centerhollywoods rockwalk"
    },
    {
        " in ": null
    },
    {
        "Sunset Boulevard": "sunset boulevard"
    },
    {
        ", Los Angeles.          At the end of 42 Iron Maiden began work on  A Matter of Life and Death , their fourteenth studio album, released in autumn 42 While not a concept album, war and religion are recurring themes in the lyrics, as well as in the cover artwork. The release was a critical and commercial success, earning the band their first top ten in the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " and receiving the Album of the Year award at the 42 ": null
    },
    {
        "Classic Rock Roll of Honour Awards": "classic rock"
    },
    {
        ". A ": null
    },
    {
        "supporting tour": "a matter of life and death tour"
    },
    {
        " followed, during which they played the album in its entirety; response to this was mixed.     The second part of the A Matter of Life and Death tour, which took place in 42 was dubbed A Matter of the Beast to celebrate the 42th anniversary of The Number of the Beast album, and included appearances at several major festivals worldwide. The tour opened in the Middle East with the bands first performance in Dubai at the ": null
    },
    {
        "Dubai Desert Rock Festival": "dubai desert rock festival"
    },
    {
        ", after which they played to over 42  people at the ": null
    },
    {
        "Bangalore Palace": "bangalore palace"
    },
    {
        " Grounds, marking the first concert by any major heavy metal band in the Indian sub-continent. The band went on to play a string of European dates, including an appearance at ": null
    },
    {
        "Download Festival": "download festival"
    },
    {
        ", their fourth headline performance at ": null
    },
    {
        "Donington Park": "donington park"
    },
    {
        ", to approximately 42 people. On 42 June they ended the tour with a performance at Londons ": null
    },
    {
        "Brixton Academy": "brixton academy"
    },
    {
        " in aid of The Clive Burr ": null
    },
    {
        "MS": "multiple sclerosis"
    },
    {
        " Trust fund.     Flight 42      On 42 September 42 the band announced their ": null
    },
    {
        "Somewhere Back in Time World Tour": "somewhere back in time world tour"
    },
    {
        ", which tied in with the DVD release of their Live After Death album. The setlist for the tour consisted of successes from the 42s, with a specific emphasis on the Powerslave era for set design. The first part of the tour, commencing in Mumbai, India on 42 February 42 consisted of 42 concerts in 42 cities, travelling nearly 42 miles in the bands own chartered aeroplane, named Ed Force One . They played their first ever concerts in Costa Rica and Colombia and their first shows in Australia and Puerto Rico since 42          The tour led to the release of a new compilation album, entitled  Somewhere Back in Time , which included a selection of tracks from their 42 eponymous debut to 42s Seventh Son of a Seventh Son, as well as several live versions from Live After Death.     The Somewhere Back in Time World Tour continued with two further legs in the US and Europe in the summer of 42 during which the band used a more expansive stage-set, including further elements of the original Live After Death show. With the sole UK concert taking place at ": null
    },
    {
        "Twickenham Stadium": "twickenham stadium"
    },
    {
        ", this would be the first time the band would headline a stadium in their own country. The three 42 legs of the tour were remarkably successful; it was the second highest-grossing tour of the year for a British artist.     The last part of the tour took place in February and March 42 with the band, once again, using Ed Force One . The final leg included the bands first ever appearances in Peru and Ecuador, as well as their return to Venezuela and New Zealand after 42 years. The band also played another show in India at the ": null
    },
    {
        "Rock in India": "rock in india"
    },
    {
        " festival to a crowd of 42. At their concert in São Paulo on 42 March, Dickinson announced on stage that it was the largest non-festival show of their career, with an overall attendance of 42  people. The final leg ended in Florida on 42 April after which the band took a break. Overall, the tour reportedly had an attendance of over two million people worldwide over both years.     At the ": null
    },
    {
        "42 BRIT Awards": "2009 brit awards"
    },
    {
        ", Iron Maiden won the award for best British live act. Voted for by the public, the band reportedly won by a landslide.     On 42 January 42 the band announced that they were to release a full-length documentary film in select cinemas on 42 April 42 Entitled  Iron Maiden: Flight 42 , it was filmed during the first part of the Somewhere Back in Time World Tour between February and March 42 Flight 42 was co-produced by Banger Productions and was distributed in cinemas by Arts Alliance Media and ": null
    },
    {
        "EMI": "emi"
    },
    {
        ", with ": null
    },
    {
        "D & E Entertainment": "d & e entertainment"
    },
    {
        " sub-distributing in the US. The film went on to have a Blu-ray, DVD, and CD release in May and June, topping the music DVD charts in 42 countries.     The Final Frontier and Maiden England World Tour      Following announcements that the band had begun composition of new material and booked studio time in early 42 with ": null
    },
    {
        "Kevin Shirley": "kevin shirley"
    },
    {
        " producing,  The Final Frontier  was announced on 42 March. The album, the bands fifteenth, was released on 42 August, garnering critical acclaim and the bands greatest commercial success in their history, reaching No.  42 in twenty-eight countries worldwide. Although Steve Harris had been quoted in the past as claiming that the band would only produce fifteen studio releases, band members have since confirmed that there will be at least one further record.     The albums ": null
    },
    {
        "supporting tour": "the final frontier world tour"
    },
    {
        " saw the band perform 42 shows across the globe to an estimated audience of over 42 million, including their first visits to Singapore, Indonesia, and South Korea, before concluding in London on 42 August 42 As the tours 42 leg preceded The Final Frontiers release, the band made ": null
    },
    {
        "El Dorado": "el dorado"
    },
    {
        " available as a free download on 42 June, which would go on to win the ": null
    },
    {
        "award": "grammy award"
    },
    {
        " for ": null
    },
    {
        "Best Metal Performance": "grammy award for best metal performance"
    },
    {
        " at the ": null
    },
    {
        "42 Grammy Awards": "2011 grammy awards"
    },
    {
        " on 42 February 42 It was the bands first win following two previous Grammy nominations .     On 42 March, a new compilation to accompany 42s  Somewhere Back in Time  was announced. Entitled  From Fear to Eternity , the original release date was set at 42 May, but was later delayed to 42 June. The double disc set covers the period 42–42 , and, as on Somewhere Back in Time, live versions with ": null
    },
    {
        "Bruce Dickinson": "bruce dickinson"
    },
    {
        " were included in place of original recordings which featured other vocalists, in this case ": null
    },
    {
        "Blaze Bayley": "blaze bayley"
    },
    {
        ".     In a press release regarding From Fear to Eternity, band manager ": null
    },
    {
        "Rod Smallwood": "rod smallwood"
    },
    {
        " revealed that Iron Maiden would release a new concert video to DVD in 42 filmed in Santiago, Chile and Buenos Aires, Argentina during The Final Frontier World Tour. On 42 January 42 the band announced that the new release, entitled  En Vivo! , based on footage from the Chile concert, would be made available worldwide on CD, LP, DVD, and Blu-ray on 42 March, except for the United States and Canada . In addition to the concert footage, the video release includes an 42-minute tour documentary, entitled Behind The Beast, containing interviews with the band and their crew. In December 42 one song from the release was nominated for a ": null
    },
    {
        "Grammy Award for Best Hard Rock/Metal Performance": "grammy award for best hard rock/metal performance"
    },
    {
        " at the ": null
    },
    {
        "42 Grammy Awards": "2013 grammy awards"
    },
    {
        ".     On 42 February 42 the band announced the ": null
    },
    {
        "Maiden England World Tour": "maiden england world tour"
    },
    {
        " 42–42 which was based around the ": null
    },
    {
        "video of the same name": "maiden england"
    },
    {
        ". The tour commenced in North America in the summer of 42 and was followed by further dates in 42 and 42 which included the bands record-breaking fifth headline performance at ": null
    },
    {
        "Donington Park": "donington park"
    },
    {
        ", their first show at the newly built ": null
    },
    {
        "national stadium": "friends arena"
    },
    {
        " in Stockholm, a return to the ": null
    },
    {
        "Rock in Rio": "rock in rio"
    },
    {
        " festival in Brazil, and their debut appearance in Paraguay. In August 42 Steve Harris stated that the Maiden England video would be re-issued in 42 with a release date later set for 42 March 42 in DVD, CD, and LP formats under the title Maiden England 42.     The Book of Souls and Legacy of the Beast    Following confirmation from the group that 42s The Final Frontier would not be their last album, Bruce Dickinson revealed plans for a sixteenth studio record in July 42 with a potential release date in 42 In February 42 drummer Nicko McBrain revealed that a new album had been completed, although the release was put on hold as Dickinson was recovering from treatment for a cancerous tumour found on his tongue. On 42 May, after Dickinson was cleared for activities, manager Rod Smallwood confirmed that the album would be released in 42 although the band would not tour until 42 to allow Dickinson to continue recuperating. On 42 June 42 the bands website announced its title,  The Book of Souls , and confirmed a release date of 42 September 42 It is the bands first original studio album not to be issued by EMI outside North America, following ": null
    },
    {
        "Parlophone": "parlophone"
    },
    {
        "s acquisition by ": null
    },
    {
        "Warner Music Group": "warner music group"
    },
    {
        " in 42 A critical and commercial success, it received positive reviews and became the bands fifth UK No. 42 album.      The new record was recorded at Guillaume Tell Studios, Paris, which they had previously used for 42s Brave New World, with regular producer Kevin Shirley in late summer 42 With a total run time of 42 minutes, it is the groups first double studio album. In addition, the releases closing song, ": null
    },
    {
        "Empire of the Clouds": "empire of the clouds"
    },
    {
        " , penned by Dickinson, surpassed Rime of the Ancient Mariner  as Iron Maidens longest song, at 42 minutes in length. A music video for the song ": null
    },
    {
        "Speed of Light": "speed of light"
    },
    {
        " was issued on 42 August.     In February 42 the band embarked on ": null
    },
    {
        "The Book of Souls World Tour": "the book of souls world tour"
    },
    {
        ", which saw them play concerts in 42 countries in North and South America, Asia, Australasia, Africa, and Europe, including their first ever performances in China, El Salvador, and Lithuania. As with 4242s Somewhere Back in Time World Tour and 4242s The Final Frontier World Tour, the group travelled in a customised aeroplane, flown by Dickinson and nicknamed Ed Force One , although they used a ": null
    },
    {
        "Boeing 4242": "boeing 747-400"
    },
    {
        " jumbo jet. The band completed the tour in 42 with further European and North American shows. On 42 September 42  The Book of Souls: Live Chapter  was announced. Recorded throughout The Book of Souls World Tour, it was released on 42 November 42     In the summer of 42 the group launched a ": null
    },
    {
        "mobile game": "mobile game"
    },
    {
        ", Iron Maiden: Legacy of the Beast and a ": null
    },
    {
        "pinball": "pinball"
    },
    {
        " game with the same name in 42  Inspired by the games title, the band would undertake the ": null
    },
    {
        "Legacy of the Beast World Tour": "legacy of the beast world tour"
    },
    {
        ", commencing in Europe in 42 with North and South American shows following in 42 On 42 September 42 the band announced they would play the 42 Belsonic Festival in Belfast and a headline show at Donington Park, England, as part of 42 Download Festival.  On 42 November 42 they announced Australian shows throughout May 42 joined by ": null
    },
    {
        "Killswitch Engage": "killswitch engage"
    },
    {
        ". . Musicfeeds.com. Retrieved 42 November 42       Iron Maiden were ranked No.  42 in ": null
    },
    {
        "VH42": "vh1"
    },
    {
        "s 42 Greatest Artists of Hard Rock , No.  42 in ": null
    },
    {
        "MTV": "mtv"
    },
    {
        "s Top 42 Greatest Heavy Metal Bands of All Time  and No.  42 in ": null
    },
    {
        "VH42 Classic": "vh1 classic"
    },
    {
        "s Top 42 Metal Bands . The band also won the ": null
    },
    {
        "Ivor Novello Award": "ivor novello award"
    },
    {
        " for international achievement in 42 and were inducted into the ": null
    },
    {
        "Hollywood RockWalk": "guitar centerhollywoods rockwalk"
    },
    {
        " whilst touring in the US in 42     Iron Maiden frequently use the slogan Up the Irons in their disc liner notes, and the phrase can also be seen on several T-shirts officially licensed by the band. It is a paraphrase of Up the Hammers , the phrase which refers to the London ": null
    },
    {
        "football": "association football"
    },
    {
        " club, ": null
    },
    {
        "West Ham United": "west ham united"
    },
    {
        ", of which founder Steve Harris is a fan.     Iron Maidens ": null
    },
    {
        "mascot": "mascot"
    },
    {
        ", ": null
    },
    {
        "Eddie": "eddie"
    },
    {
        ", is a perennial fixture in the bands science fiction and horror-influenced album cover art, as well as in ": null
    },
    {
        "live": "concert"
    },
    {
        " shows. Originally a papier-mâché mask incorporated in their backdrop which would squirt fake blood during their live shows, the name would be transferred to the character featured in the bands debut album cover, created by ": null
    },
    {
        "Derek Riggs": "derek riggs"
    },
    {
        ". Eddie was painted exclusively by Riggs until 42 at which point the band began using artwork from numerous other artists as well, including ": null
    },
    {
        "Melvyn Grant": "melvyn grant"
    },
    {
        ". Eddie is also featured in the bands ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        " video game,  Ed Hunter , as well as their ": null
    },
    {
        "mobile": "mobile operating system"
    },
    {
        " role-playing game": "role-playing game"
    },
    {
        ", Iron Maiden: Legacy of the Beast, in addition to numerous T-shirts, posters and other band-related merchandise. In 42 he was awarded the Icon Award at the  Metal Hammer  Golden Gods, while ": null
    },
    {
        "Gibson.com": "gibson guitar corporation"
    },
    {
        " describes him as the most recognisable metal icon in the world and one of the most versatile too .     Iron Maidens distinct logo has adorned all of the bands releases since their debut, 42s  The Soundhouse Tapes  EP. The typeface originates with ": null
    },
    {
        "Vic Fair": "vic fair"
    },
    {
        "s poster design for the 42 science fiction film,  The Man Who Fell to Earth , also used by ": null
    },
    {
        "Gordon Giltrap": "gordon giltrap"
    },
    {
        ", although Steve Harris claims that he designed it himself, using his abilities as an architectural draughtsman. The song ": null
    },
    {
        "Always Look on the Bright Side of Life": "always look on the bright side of life"
    },
    {
        "  is a staple at their concerts, where the recording is played after the final encore.      In May 42 the band filed a $42 million lawsuit against video game company ": null
    },
    {
        "42D Realms": "3d realms"
    },
    {
        " for infringing on their trademark via the planned release of a game called ": null
    },
    {
        "Ion Maiden": "ion maiden"
    },
    {
        ", which the band claims “is nearly identical to the Iron Maiden trademark in appearance, sound and overall commercial impression.” The suit further accuses 42D Realms of causing “confusion among consumers” by depicting a skull icon similar to the bands Eddie mascot and that Ion Maiden is similar to the bands own Legacy of the Beast video game.        According to  Guitar World , Iron Maidens music has influenced generations of newer metal acts, from legends like ": null
    },
    {
        "Metallica": "metallica"
    },
    {
        " to current stars like ": null
    },
    {
        "Avenged Sevenfold": "avenged sevenfold"
    },
    {
        ",  with Metallica drummer ": null
    },
    {
        "Lars Ulrich": "lars ulrich"
    },
    {
        " commenting that he has always had an incredible amount of respect and admiration for them.  ": null
    },
    {
        "Kerry King": "kerry king"
    },
    {
        " of ": null
    },
    {
        "Slayer": "slayer"
    },
    {
        " stated that they meant so much to in their early days and ": null
    },
    {
        "Scott Ian": "scott ian"
    },
    {
        " of ": null
    },
    {
        "Anthrax": "anthrax"
    },
    {
        " said that they had a major impact on life.      ": null
    },
    {
        "M. Shadows": "m. shadows"
    },
    {
        " of Avenged Sevenfold stated that Iron Maiden are by far the best live band in the world and their music is timeless , while ": null
    },
    {
        "Trivium": "trivium"
    },
    {
        " singer ": null
    },
    {
        "Matt Heafy": "matt heafy"
    },
    {
        " comments that without Iron Maiden, Trivium surely wouldnt exist . ": null
    },
    {
        "Slipknot": "slipknot"
    },
    {
        " and ": null
    },
    {
        "Stone Sour": "stone sour"
    },
    {
        " frontman ": null
    },
    {
        "Corey Taylor": "corey taylor"
    },
    {
        " said that Steve Harris does more with four fingers than Ive ever seen anybody do. And Bruce Dickinson? Dude! To me, he was the quintessential old-school heavy metal singer. He could hit notes that were just sick, and he was a great showman. Everything made me a fan. And there wasnt a dude that I hung out with that wasnt trying to draw Eddie on their schoolbooks , while their music also helped ": null
    },
    {
        "Jesper Strömblad": "jesper strömblad"
    },
    {
        " of ": null
    },
    {
        "In Flames": "in flames"
    },
    {
        " to pioneer the ": null
    },
    {
        "melodic death metal": "melodic death metal"
    },
    {
        " genre, stating that he had wanted to combine ": null
    },
    {
        "death metal": "death metal"
    },
    {
        " with Iron Maidens melodic guitar sounds.     Other heavy metal artists who cite the band as an influence include ": null
    },
    {
        "Chris Jericho": "chris jericho"
    },
    {
        ", a WWE wrestler and lead singer of ": null
    },
    {
        "Fozzy": "fozzy"
    },
    {
        ", ": null
    },
    {
        "Cam Pipes": "cam pipes"
    },
    {
        ", lead vocalist of ": null
    },
    {
        "42 Inches of Blood": "3 inches of blood"
    },
    {
        ", Vitaly Dubinin, bassist of ": null
    },
    {
        "Aria": "aria"
    },
    {
        ", ": null
    },
    {
        "Mikael Åkerfeldt": "mikael åkerfeldt"
    },
    {
        ", guitarist and lead vocalist of ": null
    },
    {
        "Opeth": "opeth"
    },
    {
        ", and ": null
    },
    {
        "X Japan": "x japan"
    },
    {
        " drummer ": null
    },
    {
        "Yoshiki": "yoshiki"
    },
    {
        " and former guitarist ": null
    },
    {
        "hide": "hide"
    },
    {
        ". Both current and former ": null
    },
    {
        "Dream Theater": "dream theater"
    },
    {
        " members ": null
    },
    {
        "John Petrucci": "john petrucci"
    },
    {
        ", ": null
    },
    {
        "John Myung": "john myung"
    },
    {
        ", and ": null
    },
    {
        "Mike Portnoy": "mike portnoy"
    },
    {
        " have stated that Iron Maiden were one of their biggest influences when their band first formed.       The bands name has been mentioned prominently in several songs, such as the singles ": null
    },
    {
        "Teenage Dirtbag": "teenage dirtbag"
    },
    {
        " by ": null
    },
    {
        "Wheatus": "wheatus"
    },
    {
        ", ": null
    },
    {
        "Back to the 42s": "back to the 80s"
    },
    {
        " by Danish dance-pop band ": null
    },
    {
        "Aqua": "aqua"
    },
    {
        ". and ": null
    },
    {
        "Fat Lip": "fat lip"
    },
    {
        " by ": null
    },
    {
        "Sum 42": "sum 41"
    },
    {
        ". Iron Maiden have also been referenced in ": null
    },
    {
        "Weezer": "weezer"
    },
    {
        "s Heart Songs , ": null
    },
    {
        "Blues Traveler": "blues traveler"
    },
    {
        "s Psycho Joe , and ": null
    },
    {
        "NOFX": "nofx"
    },
    {
        "s Eddie, Bruce and Paul , which ": null
    },
    {
        "Sputnikmusic": "sputnikmusic"
    },
    {
        " describes as a humorous retelling of Paul DiAnnos departure .     In 42  Kerrang!  released  Maiden Heaven: A Tribute to Iron Maiden , an album composed of Iron Maiden cover songs performed by Metallica, ": null
    },
    {
        "Machine Head": "machine head"
    },
    {
        ", ": null
    },
    {
        "Dream Theater": "dream theater"
    },
    {
        ", Trivium, ": null
    },
    {
        "Coheed and Cambria": "coheed and cambria"
    },
    {
        ", Avenged Sevenfold, and other groups influenced by the band. In 42 ": null
    },
    {
        "Maiden uniteD": "maiden united"
    },
    {
        ", an acoustic tribute band consisting of members of ": null
    },
    {
        "Ayreon": "ayreon"
    },
    {
        ", ": null
    },
    {
        "Threshold": "threshold"
    },
    {
        " and ": null
    },
    {
        "Within Temptation": "within temptation"
    },
    {
        ", released  Mind the Acoustic Pieces , a re-interpretation of the entire  Piece of Mind  album. Many other Iron Maiden cover albums exist , including piano, electro, string quartet and hip-hop tributes.     Iron Maiden songs have been featured in the soundtracks of several video games, including  Carmageddon 42 ,  Grand Theft Auto: Vice City ,  Grand Theft Auto: Episodes from Liberty City ,  Grand Theft Auto IV: The Lost and Damned ,  Tony Hawks Pro Skater 42 ,  SSX on Tour  and  Madden NFL 42 . Their music also appears in the  Guitar Hero and  Rock Band  series of ": null
    },
    {
        "rhythmic video games": "music video game"
    },
    {
        ". Iron Maiden songs have also appeared in films, such as  Phenomena  , and  Murder by Numbers ; while MTVs animated duo ": null
    },
    {
        "Beavis and Butt-Head": "beavis and butt-head"
    },
    {
        " have commented favourably on the band several times.     ": null
    },
    {
        "Transformers": "transformers"
    },
    {
        " author Bill Forster is an avowed Iron Maiden fan and made several Iron Maiden references, including song lyrics and the phrase Up the Irons in his books, including  The Ark  series and The AllSpark Almanac series.       In 42 the band released one of their most popular, controversial and acclaimed albums,  The Number of the Beast . The artwork and title track led to Christian groups in the United States branding the band as ": null
    },
    {
        "Satanists": "satanism"
    },
    {
        ", encouraging people to destroy copies of the release. The bands manager, Rod Smallwood, later commented that Christians initially burnt the records, but later decided to destroy them with hammers through fear of breathing in the melting vinyls fumes. The protests were not restricted to the US, with Christian organisations preventing Iron Maiden from performing in Chile in 42     Contrary to the accusations, the band have always denied the notion that they are Satanists, with lead vocalist, Bruce Dickinson, doing so on-stage in the  Live After Death  concert video. Steve Harris has since commented that, It was mad. They completely got the wrong end of the stick. They obviously hadnt read the lyrics. They just wanted to believe all that rubbish about us being Satanists.  Harris has also stated that ": null
    },
    {
        "The Number of the Beast": "the number of the beast"
    },
    {
        " song was inspired by a nightmare he had after watching  Damien: Omen II , and also influenced by ": null
    },
    {
        "Robert Burns": "robert burns"
    },
    {
        "  Tam o Shanter . Furthermore, the bands drummer, ": null
    },
    {
        "Nicko McBrain": "nicko mcbrain"
    },
    {
        ", has been a born-again Christian since 42          For their ": null
    },
    {
        "Somewhere Back in Time World Tour": "somewhere back in time world tour"
    },
    {
        " in 42 and 42 Iron Maiden commissioned an ": null
    },
    {
        "Astraeus Airlines": "astraeus airlines"
    },
    {
        " Boeing 42": "boeing 757"
    },
    {
        " as transport. The aeroplane was converted into a ": null
    },
    {
        "combi": "combi aircraft"
    },
    {
        " configuration, which enabled it to carry the band, their crew and stage production, thereby allowing the group to perform in countries which were previously deemed unreachable logistically. It was also repainted with a special Iron Maiden livery, which the airline decided to retain after receiving positive feedback from customers.        The aircraft, named Ed Force One after a competition on the bands website, was flown by Dickinson, as he was also a commercial airline pilot for Astraeus, and plays a major role in the award-winning documentary,  Iron Maiden: Flight 42 , which was released in cinemas in 42 countries in April 42 A different aeroplane  was used for ": null
    },
    {
        "The Final Frontier World Tour": "the final frontier world tour"
    },
    {
        " in 42 with altered livery, adopting the artwork of  The Final Frontier  album, and features heavily in the 42 documentary ": null
    },
    {
        "Behind the Beast": "en vivo!"
    },
    {
        " . For ": null
    },
    {
        "The Book of Souls World Tour": "the book of souls world tour"
    },
    {
        " in 42 the band upgraded to an ex-": null
    },
    {
        "Air France": "air france"
    },
    {
        " Boeing 4242": "boeing 747-400"
    },
    {
        " jumbo jet, supplied by ": null
    },
    {
        "Air Atlanta Icelandic": "air atlanta icelandic"
    },
    {
        "  and customised by ": null
    },
    {
        "Volga-Dnepr Gulf": "volga-dnepr airlines"
    },
    {
        ", which allows for more space without the aircraft having to undergo a significant conversion to carry their equipment.          Steve Harris, Iron Maidens bassist and primary songwriter, has stated that his influences include ": null
    },
    {
        "Black Sabbath": "black sabbath"
    },
    {
        ", ": null
    },
    {
        "Deep Purple": "deep purple"
    },
    {
        ", ": null
    },
    {
        "Led Zeppelin": "led zeppelin"
    },
    {
        ", ": null
    },
    {
        "Uriah Heep": "uriah heep"
    },
    {
        ", ": null
    },
    {
        "Pink Floyd": "pink floyd"
    },
    {
        ", ": null
    },
    {
        "Genesis": "genesis"
    },
    {
        ", ": null
    },
    {
        "Yes": "yes"
    },
    {
        ", ": null
    },
    {
        "Jethro Tull": "jethro tull"
    },
    {
        ", ": null
    },
    {
        "Thin Lizzy": "thin lizzy"
    },
    {
        ", ": null
    },
    {
        "UFO": "ufo"
    },
    {
        ", ": null
    },
    {
        "Queen": "queen"
    },
    {
        " and ": null
    },
    {
        "Wishbone Ash": "wishbone ash"
    },
    {
        ". In 42 Harris stated, I think if anyone wants to understand Maidens early thing, in particular the harmony guitars, all they have to do is listen to Wishbone Ashs  Argus  album. Thin Lizzy too, but not as much. And then we wanted to have a bit of a prog thing thrown in as well, because I was really into bands like Genesis and Jethro Tull. So you combine all that with the heavy riffs and the speed, and youve got it.  In 42 Harris explained that the bands heaviness was inspired by Black Sabbath and Deep Purple with a bit of Zeppelin thrown in.  On top of this, Harris developed his own playing style, which guitarist Janick Gers describes as more like a rhythm guitar,  cited as responsible for the bands galloping style, heard in such songs as ": null
    },
    {
        "The Trooper": "the trooper"
    },
    {
        "  and Run to the Hills.      The bands guitarists, Dave Murray, Adrian Smith, and Janick Gers, each have their own individual influences and playing style. Dave Murray is known for his ": null
    },
    {
        "legato": "legato"
    },
    {
        " technique which, he claims, evolved naturally. Id heard ": null
    },
    {
        "Jimi Hendrix": "jimi hendrix"
    },
    {
        " using legato when I was growing up, and I liked that style of playing.  Stating that he was inspired by ": null
    },
    {
        "blues rock": "blues rock"
    },
    {
        " rather than metal, Adrian Smith was influenced by ": null
    },
    {
        "Johnny Winter": "johnny winter"
    },
    {
        " and ": null
    },
    {
        "Pat Travers": "pat travers"
    },
    {
        ", leading to him becoming a melodic player.  Janick Gers, on the other hand, prefers a more improvised style, largely inspired by ": null
    },
    {
        "Ritchie Blackmore": "ritchie blackmore"
    },
    {
        ", which he claims is in contrast to Smiths rhythmic sound.     Singer Bruce Dickinson, who typically works in collaboration with guitarist Adrian Smith, has an operatic vocal style, inspired by ": null
    },
    {
        "Arthur Brown": "arthur brown"
    },
    {
        ", ": null
    },
    {
        "Peter Hammill": "peter hammill"
    },
    {
        ", ": null
    },
    {
        "Ian Anderson": "ian anderson"
    },
    {
        " and ": null
    },
    {
        "Ian Gillan": "ian gillan"
    },
    {
        ", and is often considered to be one of the best heavy metal vocalists of all time. Although Nicko McBrain has only received one writing credit, on the Dance of Death album, Harris often relies on him while developing songs. Adrian Smith commented, Steve loves playing with him. used to work for hours going over these bass and drum patterns.      Throughout their career, the bands style has remained largely unchanged, in spite of the addition of guitar synthesisers on 42s Somewhere in Time, keyboards on 42s Seventh Son of a Seventh Son, and an attempt to return to the stripped down production of their earlier material on  No Prayer for the Dying. In recent years, however, the band have begun using more ": null
    },
    {
        "progressive": "progressive rock"
    },
    {
        " elements in their songs, which Steve Harris describes as not progressive in the modern sense, but like ": null
    },
    {
        "Dream Theater": "dream theater"
    },
    {
        ", more in a 42s way . According to Harris, Seventh Son of a Seventh Son was the bands first album which was more progressive , while they would only return to this style from 42s The X Factor, which he states is like an extension of Seventh Son..., in the sense of the progressive element to it . The development contrasts with the bands raw-sounding earlier material, which ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        " states was clearly drawing from elements of punk rock , although Harris firmly denies this.                  ": null
    },
    {
        "Bandit Rock Awards": "bandit rock"
    },
    {
        ":   42: Best International Live Act   The Book of Souls     ": null
    },
    {
        "Brit Awards": "brit awards"
    },
    {
        ":   42: Best British Live Act   ": null
    },
    {
        "Classic Rock Roll of Honour Awards": "classic rock"
    },
    {
        ":   42: Album of the Year –  A Matter of Life and Death  ": null
    },
    {
        "Rod Smallwood": "rod smallwood"
    },
    {
        ", Iron Maiden   The Book of Souls    ": null
    },
    {
        "Echo Music Prize": "echo music prize"
    },
    {
        ":   42: Rock Alternative/International   ": null
    },
    {
        "Emma-gaala": "emma-gaala"
    },
    {
        ":   42: The audience vote for Best Foreign Artist    ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        "s:   42: ": null
    },
    {
        "Grammy Award for Best Metal Performance": "grammy award for best metal performance"
    },
    {
        " – ": null
    },
    {
        "El Dorado": "el dorado"
    },
    {
        "    Hollywoods RockWalk": "guitar centerhollywoods rockwalk"
    },
    {
        ":   42: RockWalk of Fame Inductee   ": null
    },
    {
        "Ivor Novello Awards": "ivor novello awards"
    },
    {
        ":   42: International Achievement   ": null
    },
    {
        "Juno Award": "juno award"
    },
    {
        "s:   42: ": null
    },
    {
        "Juno Award for Music DVD of the Year": "juno award for music dvd of the year"
    },
    {
        " –  Iron Maiden: Flight 42        ": null
    },
    {
        "Kerrang! Awards": "kerrang! awards"
    },
    {
        ":   42: Kerrang! Hall of Fame Kerrang! Inspiration Kerrang! Legend   ": null
    },
    {
        "Metal Hammer Golden Gods Awards": "metal hammer golden gods awards"
    },
    {
        ":   42: Best UK Act  ": null
    },
    {
        "Eddie": "eddie"
    },
    {
        "    UK Tour": "the final frontier world tour"
    },
    {
        "   The Book of Souls  Iron Maiden: Legacy of the Beast   ": null
    },
    {
        "Metal Storm Awards": "metal storm awards"
    },
    {
        ":   42: Best Heavy Metal Album – A Matter of Life and Death Iron Maiden: Flight 42   42: Best Video – The Final Frontier   Silver Clef Award :   42: Special Achievement Award   42: O42 Silver Clef Award 42   Rockbjörnen :   42: Best Hard Rock Live Act   SXSW Film Festival :   42: 42 Beats Per Second – Iron Maiden: Flight 42                 Current members   Steve Harris – bass , backing vocals , keyboard s   Dave Murray – guitar s   Adrian Smith – guitars, backing vocals , keyboards   Bruce Dickinson – lead vocals , piano   Nicko McBrain – drums   Janick Gers – guitars     Touring musicians   Michael Kenney – keyboards       Former members   Doug Sampson – drums   Paul DiAnno – lead vocals   Dennis Stratton – guitars, backing vocals   Clive Burr – drums   Blaze Bayley – lead vocals                 ": null
    },
    {
        "Iron Maiden": "iron maiden"
    },
    {
        "   Killers": "killers"
    },
    {
        "   The Number of the Beast": "the number of the beast"
    },
    {
        "   Piece of Mind": "piece of mind"
    },
    {
        "   Powerslave": "powerslave"
    },
    {
        "   Somewhere in Time": "somewhere in time"
    },
    {
        "   Seventh Son of a Seventh Son": "seventh son of a seventh son"
    },
    {
        "   No Prayer for the Dying": "no prayer for the dying"
    },
    {
        "   Fear of the Dark": "fear of the dark"
    },
    {
        "   The X Factor": "the x factor"
    },
    {
        "   Virtual XI": "virtual xi"
    },
    {
        "   Brave New World": "brave new world"
    },
    {
        "   Dance of Death": "dance of death"
    },
    {
        "   A Matter of Life and Death": "a matter of life and death"
    },
    {
        "   The Final Frontier": "the final frontier"
    },
    {
        "   The Book of Souls": "the book of souls"
    }
]