[
    {
        "              Iron Man is a fictional ": null
    },
    {
        "superhero": "superhero"
    },
    {
        " appearing in ": null
    },
    {
        "American comic book": "american comic book"
    },
    {
        "s published by ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        ". The character was co-created by writer and editor ": null
    },
    {
        "Stan Lee": "stan lee"
    },
    {
        ", developed by scripter ": null
    },
    {
        "Larry Lieber": "larry lieber"
    },
    {
        ", and designed by artists ": null
    },
    {
        "Don Heck": "don heck"
    },
    {
        " and ": null
    },
    {
        "Jack Kirby": "jack kirby"
    },
    {
        ". The character made his ": null
    },
    {
        "first appearance": "first appearance"
    },
    {
        " in  Tales of Suspense  42 , and received his own title in  Iron Man  42 .     A wealthy American ": null
    },
    {
        "business magnate": "business magnate"
    },
    {
        ", ": null
    },
    {
        "playboy": "playboy"
    },
    {
        ", and ingenious ": null
    },
    {
        "scientist": "scientist"
    },
    {
        ", Anthony Edward Tony Stark suffers a severe chest injury during a kidnapping. When his captors attempt to force him to build a ": null
    },
    {
        "weapon of mass destruction": "weapon of mass destruction"
    },
    {
        ", he instead creates a ": null
    },
    {
        "mechanized suit of armor": "iron mans armor"
    },
    {
        " to save his life and escape captivity. Later, Stark develops his suit, adding weapons and other technological devices he designed through his company, ": null
    },
    {
        "Stark Industries": "stark industries"
    },
    {
        ". He uses the suit and successive versions to protect the world as Iron Man. Although at first concealing his true identity, Stark eventually declared that he was, in fact, Iron Man in a public announcement.     Initially, Iron Man was a vehicle for Stan Lee to explore ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " themes, particularly the role of American technology and industry in the fight against ": null
    },
    {
        "communism": "communism"
    },
    {
        ". Subsequent re-imaginings of Iron Man have transitioned from Cold War motifs to contemporary matters of the time.      Throughout most of the characters publication history, Iron Man has been a founding member of the superhero team the ": null
    },
    {
        "Avengers": "avengers"
    },
    {
        " and has been featured in several incarnations of his own various comic book series. Iron Man has been adapted for several animated TV shows and films. The ": null
    },
    {
        "Marvel Cinematic Universe character": "tony stark"
    },
    {
        " was portrayed by ": null
    },
    {
        "Robert Downey Jr.": "robert downey jr."
    },
    {
        " in the ": null
    },
    {
        "Marvel Cinematic Universe": "marvel cinematic universe"
    },
    {
        " films  Iron Man  ,  The Incredible Hulk  in a cameo,  Iron Man 42  ,  The Avengers  ,  Iron Man 42  ,  Avengers: Age of Ultron  ,  Captain America: Civil War  ,  Spider-Man: Homecoming  ,  Avengers: Infinity War  ,  Avengers: Endgame  , and will reprise his role in  Black Widow  .     Iron Man was ranked 42th on ": null
    },
    {
        "IGN": "ign"
    },
    {
        "s Top 42 Comic Book Heroes in 42  and third in their list of The Top 42 Avengers in 42                    Iron Mans ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        " premiere in Tales of Suspense 42  was a collaboration among editor and story-plotter ": null
    },
    {
        "Stan Lee": "stan lee"
    },
    {
        ", scripter ": null
    },
    {
        "Larry Lieber": "larry lieber"
    },
    {
        ", story-artist ": null
    },
    {
        "Don Heck": "don heck"
    },
    {
        ", and cover-artist and character-designer ": null
    },
    {
        "Jack Kirby": "jack kirby"
    },
    {
        ".  In 42 Lee had been toying with the idea of a businessman superhero.  He wanted to create the quintessential capitalist , a character that would go against the spirit of the times and Marvels readership.  Lee said,          He set out to make the new character a wealthy, glamorous ladies man, but one with a secret that would plague and torment him as well. Lee, Son of Origins of Marvel Comics pp. 4242 Writer ": null
    },
    {
        "Gerry Conway": "gerry conway"
    },
    {
        " said, Here you have this character, who on the outside is invulnerable, I mean, just cant be touched, but inside is a wounded figure. Stan made it very much an in-your-face wound, you know, his heart was broken, you know, literally broken. But theres a metaphor going on there. And thats, I think, what made that character interesting. Lee based this playboys looks and personality on ": null
    },
    {
        "Howard Hughes": "howard hughes"
    },
    {
        ",  explaining, Howard Hughes was one of the most colorful men of our time. He was an inventor, an adventurer, a multi-billionaire, a ladies man and finally a nutcase. Lee, Stan . Stans Soapbox from ": null
    },
    {
        "Bullpen Bulletins": "bullpen bulletins"
    },
    {
        " Marvel Comics": "marvel comics"
    },
    {
        ". Without being crazy, he was Howard Hughes, Lee said.     While Lee intended to write the story himself, Lee, Son of Origins, p. 42 a minor deadline emergency eventually forced him to hand over the premiere issue to Lieber, who fleshed out the story. The art was split between Kirby and Heck. He designed the costume, Heck said of Kirby, because he was doing the cover. The covers were always done first. But I created the look of the characters, like Tony Stark and his secretary ": null
    },
    {
        "Pepper Potts": "pepper potts"
    },
    {
        ".  In a 42 interview, when asked if he had a specific model for Tony Stark and the other characters? , Heck replied No, I would be thinking more along the lines of some characters I like, which would be the same kind of characters that ": null
    },
    {
        "Alex Toth": "alex toth"
    },
    {
        " liked, which was an ": null
    },
    {
        "Errol Flynn": "errol flynn"
    },
    {
        " type.  Iron Man first appeared in 42- to 42-page stories in Tales of Suspense, which featured ": null
    },
    {
        "anthology": "anthology"
    },
    {
        " science fiction": "science fiction"
    },
    {
        " and ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        " stories. The characters original costume was a bulky gray armored suit, replaced by a golden version in the second story . It was redesigned as sleeker, red-and-golden armor in issue 42 by that issues interior artist, ": null
    },
    {
        "Steve Ditko": "steve ditko"
    },
    {
        ", although Kirby drew it on the cover. As Heck recalled in 42 e second costume, the red and yellow one, was designed by Steve Ditko. I found it easier than drawing that bulky old thing. The earlier design, the robot-looking one, was more Kirbyish. Heck, quoted in      In his premiere, Iron Man was an ": null
    },
    {
        "anti-communist": "anti-communism"
    },
    {
        " hero, defeating various Vietnamese agents. Lee later regretted this early focus.  Throughout the characters ": null
    },
    {
        "comic book": "comic book"
    },
    {
        " series, technological advancement and ": null
    },
    {
        "national defense": "national security"
    },
    {
        " were constant themes for Iron Man, but later issues developed Stark into a more complex and vulnerable character as they depicted his battle with ": null
    },
    {
        "alcoholism": "alcoholism"
    },
    {
        "  and other personal difficulties.     From issue 42 to its final issue 42 , the anthological ": null
    },
    {
        "science-fiction": "science-fiction"
    },
    {
        " backup stories in Tales of Suspense were replaced by a feature starring the superhero ": null
    },
    {
        "Captain America": "captain america"
    },
    {
        ". Lee and Heck introduced several adversaries for the character including the ": null
    },
    {
        "Mandarin": "mandarin"
    },
    {
        " in issue 42 , DeFalco 42s in Gilbert , p. 42: Following the tradition of Sax Rohmers Fu Manchu and Atlas own Yellow Claw, the Mandarin first appeared in Tales of Suspense 42 in a story written by Stan Lee and illustrated by Don Heck. the ": null
    },
    {
        "Black Widow": "black widow"
    },
    {
        " in 42 DeFalco 42s in Gilbert , p. 42: The Black Widow was a Russian spy assigned to capture American industrialist Tony Stark...Her story was plotted by Stan Lee, written by...Don Rico, and drawn by Don Heck. and ": null
    },
    {
        "Hawkeye": "hawkeye"
    },
    {
        " five issues later. DeFalco 42s in Gilbert , p. 42: A case of mistaken identity led the police to assume was part of gang. The Black Widow saved him from capture but also tricked him into fighting Iron Man     Lee said that of all the comic books we published at Marvel, we got more fan mail for Iron Man from women, from females, than any other title ... We didnt get much fan mail from girls, but whenever we did, the letter was usually addressed to Iron Man.     Lee and Kirby included Iron Man in  The Avengers  42 as a founding member of the superhero team. The character has since appeared in every subsequent volume of the series.     Writers have updated the war and locale in which Stark is injured. In the original 42 story, it was the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ". In the 42s, it was updated to be the first ": null
    },
    {
        "Gulf War": "gulf war"
    },
    {
        ",  and in the 42s updated again to be the ": null
    },
    {
        "war in Afghanistan": "war in afghanistan"
    },
    {
        ". Starks time with the Asian ": null
    },
    {
        "Nobel Prize": "nobel prize"
    },
    {
        "-winning scientist ": null
    },
    {
        "Ho Yinsen": "ho yinsen"
    },
    {
        " is consistent through nearly all incarnations of the Iron Man origin, depicting Stark and Yinsen building the original armor together. One exception is the ": null
    },
    {
        "direct-to-DVD": "direct-to-dvd"
    },
    {
        " animated feature film  The Invincible Iron Man , in which the armor Stark uses to escape his captors is not the first Iron Man suit.       The original Iron Man title explored ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " themes, as did other ": null
    },
    {
        "Stan Lee": "stan lee"
    },
    {
        " projects in the early years of ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        ". Where  The Fantastic Four  and  The Incredible Hulk  respectively focused on American domestic and government responses to the Communist threat, Iron Man explored industrys role in the struggle. Tony Starks real-life model, ": null
    },
    {
        "Howard Hughes": "howard hughes"
    },
    {
        ", was a significant defense contractor who developed new weapons technologies. Hughes was an icon both of American individualism and of the burdens of fame.      Historian Robert Genter, in  The Journal of Popular Culture , writes that Tony Stark specifically presents an idealized portrait of the American inventor. Where earlier decades had seen important technological innovations come from famous individuals , the 42s saw new technologies being developed mainly by the research teams of corporations. As a result, little room remained for the inventor who wanted credit for, and creative and economic control over, his/her own creations.     Issues of entrepreneurial autonomy, government supervision of research, and ultimate loyalty figured prominently in early Iron Man stories—the same issues affecting American scientists and engineers of that era. Tony Stark, writes Genter, is an inventor who finds motive in his ": null
    },
    {
        "emasculation": "emasculated"
    },
    {
        " as an autonomous creative individual. This blow is symbolized by his chest wound, inflicted at the moment he is forced to invent things for the purposes of others, instead of just himself. To Genter, Starks transformation into Iron Man represents Starks effort to reclaim his autonomy, and thus his manhood. The characters pursuit of women in bed or in battle, writes Genter, represents another aspect of this effort. The pattern finds parallels in other works of 42s popular fiction by authors such as ": null
    },
    {
        "Ian Fleming": "ian fleming"
    },
    {
        " , ": null
    },
    {
        "Mickey Spillane": "mickey spillane"
    },
    {
        " , and ": null
    },
    {
        "Norman Mailer": "norman mailer"
    },
    {
        ", who made unregulated sexuality a form of authenticity.       After issue 42 , the Tales of Suspense series was renamed Captain America. An Iron Man story appeared in the ": null
    },
    {
        "one-shot": "one-shot"
    },
    {
        " comic  Iron Man and Sub-Mariner  , before the Golden Avenger  made his solo debut with  Iron Man  42 . DeFalco 42s in Gilbert , p. 42: Hailing 42 as the beginning of the Second Age of Marvel Comics, and with more titles to play with, editor Stan Lee discarded his split books and gave more characters their own titles. The series ": null
    },
    {
        "indicia": "indicia"
    },
    {
        " gives its ": null
    },
    {
        "copyright": "copyright"
    },
    {
        " title Iron Man, while the ": null
    },
    {
        "trademark": "trademark"
    },
    {
        "ed cover logo of most issues is The Invincible Iron Man.     This initial series ended with issue 42 . ": null
    },
    {
        "Jim Lee": "jim lee"
    },
    {
        ", ": null
    },
    {
        "Scott Lobdell": "scott lobdell"
    },
    {
        ", and ": null
    },
    {
        "Jeph Loeb": "jeph loeb"
    },
    {
        " authored a second volume of the series which was ": null
    },
    {
        "drawn": "penciler"
    },
    {
        " primarily by ": null
    },
    {
        "Whilce Portacio": "whilce portacio"
    },
    {
        " and ": null
    },
    {
        "Ryan Benjamin": "ryan benjamin"
    },
    {
        ". This volume took place in a ": null
    },
    {
        "parallel universe": "parallel universe"
    },
    {
        " Manning, Matthew K. 42s in Gilbert , p. 42: Part of the Heroes Reborn event, Iron Man was relaunched into a new universe courtesy of writer Scott Lobdell and Jim Lee, with pencils by Whilce Portacio. and ran 42 issues .   in the Unofficial Handbook of Marvel Comics Creators Volume 42 whose first 42 issues were written by ": null
    },
    {
        "Kurt Busiek": "kurt busiek"
    },
    {
        " Manning 42s in Gilbert , p. 42: Tony Stark returned in style...in this new ongoing series by writer Kurt Busiek and artist Sean Chen. and then by Busiek and ": null
    },
    {
        "Roger Stern": "roger stern"
    },
    {
        ", ran 42 issues . Later writers included ": null
    },
    {
        "Joe Quesada": "joe quesada"
    },
    {
        ", ": null
    },
    {
        "Frank Tieri": "frank tieri"
    },
    {
        ", ": null
    },
    {
        "Mike Grell": "mike grell"
    },
    {
        ", and ": null
    },
    {
        "John Jackson Miller": "john jackson miller"
    },
    {
        ". Issue 42 was additionally numbered 42 reflecting the start of dual numbering starting from the premiere issue of volume one in 42 The final issue was dual-numbered as 42   in the Unofficial Handbook of Marvel Comics Creators The next Iron Man series, Iron Man vol. 42 debuted in early 42 with the ": null
    },
    {
        "Warren Ellis": "warren ellis"
    },
    {
        "-written storyline ": null
    },
    {
        "Extremis": "extremis"
    },
    {
        " , with artist ": null
    },
    {
        "Adi Granov": "adi granov"
    },
    {
        ". Manning 42s in Gilbert , p. 42: Writer Warren Ellis teamed up with illustrator Adi Granov to create a new spin on Iron Man that would have long-lasting effects.  It ran 42 issues , with the cover logo simply Iron Man beginning with issue 42 and Iron Man: Director of S.H.I.E.L.D. , beginning issue 42 On the final three issues, the cover logo was overwritten by War Machine, Weapon of S.H.I.E.L.D. ,   in the Unofficial Handbook of Marvel Comics Creators which led to the launch of a  War Machine  ongoing series.      The Invincible Iron Man vol. 42 by writer ": null
    },
    {
        "Matt Fraction": "matt fraction"
    },
    {
        " and artist ": null
    },
    {
        "Salvador Larroca": "salvador larroca"
    },
    {
        ", began with a premiere issue cover-dated July 42  For a seven-month overlap, Marvel published both volume four and volume five simultaneously.   ComicBookDB This Invincible volume jumped its numbering of issues from 42 to 42 cover dated March 42 to reflect the start from the premiere issue of volume one in 42     After the conclusion of The Invincible Iron Man a new Iron Man series was started as a part of ": null
    },
    {
        "Marvel Now!": "marvel now!"
    },
    {
        ". Written by ": null
    },
    {
        "Kieron Gillen": "kieron gillen"
    },
    {
        " and illustrated by ": null
    },
    {
        "Greg Land": "greg land"
    },
    {
        ", it began with issue 42 in November 42      Many Iron Man ": null
    },
    {
        "annuals": "annual publication"
    },
    {
        ", ": null
    },
    {
        "miniseries": "miniseries"
    },
    {
        ", and ": null
    },
    {
        "one-shot": "one-shot"
    },
    {
        " titles have been published through the years, such as Age of Innocence: The Rebirth of Iron Man , Iron Man: The Iron Age 42–42 , Iron Man: Bad Blood 42–42 , Iron Man House of M 42–42 , Fantastic Four / Iron Man: Big in Japan 42–42 , Iron Man: The Inevitable 42–42 , Iron Man / Captain America: Casualties of War , Iron Man: Hypervelocity 42–42 , Iron Man: Enter the Mandarin 42–42 , and Iron Man: Legacy of Doom . Publications have included such spin-offs as the one-shot Iron Man 42 , featuring a different Iron Man in the future, and the ": null
    },
    {
        "animated TV series": "animated tv series"
    },
    {
        " adaptations Marvel Action Hour, Featuring Iron Man 42–42 and Marvel Adventures Iron Man 42–42 .   at the ": null
    },
    {
        "Grand Comics Database": "grand comics database"
    },
    {
        "                 Anthony Edward Stark is the son of wealthy industrialist and head of ": null
    },
    {
        "Stark Industries": "stark industries"
    },
    {
        ", ": null
    },
    {
        "Howard Stark": "howard stark"
    },
    {
        ", and ": null
    },
    {
        "Maria Stark": "maria stark"
    },
    {
        ". A boy genius, he enters ": null
    },
    {
        "MIT": "massachusetts institute of technology"
    },
    {
        " at the age of 42 to study ": null
    },
    {
        "engineering": "engineering"
    },
    {
        " and later receives masters degrees in engineering and physics. After his parents are killed in a car accident, he inherits his fathers company.     Stark is injured by a booby trap and captured by enemy forces led by ": null
    },
    {
        "Wong-Chu": "wong-chu"
    },
    {
        ". Wong-Chu orders Stark to build weapons, but Starks injuries are dire and shrapnel is moving towards his heart. His fellow prisoner, ": null
    },
    {
        "Ho Yinsen": "ho yinsen"
    },
    {
        ", a ": null
    },
    {
        "Nobel Prize": "nobel prize"
    },
    {
        "-winning ": null
    },
    {
        "physicist": "physicist"
    },
    {
        " whose work Stark had greatly admired during college, constructs a ": null
    },
    {
        "magnetic": "magnetism"
    },
    {
        " chest plate to keep the shrapnel from reaching Starks heart. In secret, Stark and Yinsen use the workshop to design and construct a ": null
    },
    {
        "suit": "iron mans armor"
    },
    {
        " of ": null
    },
    {
        "powered armor": "powered exoskeleton"
    },
    {
        ", which Stark uses to escape. During the escape attempt, Yinsen sacrifices his life to save Starks by distracting the enemy as Stark recharges. Stark takes revenge on his kidnappers and rejoins the American forces, on his way meeting a wounded American ": null
    },
    {
        "Marine": "united states marine corps"
    },
    {
        " fighter pilot, ": null
    },
    {
        "James Rhodey Rhodes": "war machine"
    },
    {
        ".     Back home, Stark discovers that the shrapnel fragment lodged in his chest cannot be removed without killing him, and he is forced to wear the armors chestplate beneath his clothes to act as a regulator for his heart. He must recharge the chestplate every day or else risk the shrapnel killing him. The ": null
    },
    {
        "cover story": "cover-up"
    },
    {
        " that Stark tells the news media and general public is that Iron Man is his robotic personal ": null
    },
    {
        "bodyguard": "bodyguard"
    },
    {
        ", and corporate mascot. To that end, Iron Man fights threats to his company , as well as independent villains like the ": null
    },
    {
        "Mandarin": "mandarin"
    },
    {
        " . No one suspects Stark of being Iron Man, as he cultivates a strong public image of being a rich playboy and industrialist. Two notable members of the series supporting cast, at this point, are his personal chauffeur ": null
    },
    {
        "Harold Happy Hogan": "happy hogan"
    },
    {
        ", and secretary ": null
    },
    {
        "Virginia Pepper Potts": "pepper potts"
    },
    {
        "—to both of whom he eventually reveals his dual identity. Meanwhile, James Rhodes finds his own niche as Starks personal pilot, ultimately revealing himself to be a man of extraordinary skill and daring in his own right.     The series took an anti-Communist stance in its early years, which was softened as public opposition rose to the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ". This change evolved in a series of storylines featuring Stark reconsidering his political opinions, and the morality of manufacturing weapons for the U.S. military. Stark shows himself to be occasionally arrogant, and willing to act unethically in order to let the ends justify the means.   This leads to personal conflicts with the people around him, both in his civilian and superhero identities. Stark uses his vast personal fortune not only to outfit his own armor, but also to develop weapons for ": null
    },
    {
        "S.H.I.E.L.D.": "s.h.i.e.l.d."
    },
    {
        "; other technologies ; and the image inducers used by the ": null
    },
    {
        "X-Men": "x-men"
    },
    {
        ". Eventually, Starks heart condition is resolved with an artificial ": null
    },
    {
        "heart transplant": "heart transplantation"
    },
    {
        ".        Stark expands on his armor designs and begins to build his arsenal of specialized armors for particular situations such as for ": null
    },
    {
        "space travel": "human spaceflight"
    },
    {
        "  and ": null
    },
    {
        "stealth": "stealth technology"
    },
    {
        ". DeFalco 42s in Gilbert , p. 42: In Iron Man 42 Iron Man unveiled his all-black stealth armor.  Stark also develops a serious dependency on ": null
    },
    {
        "alcohol": "alcoholism"
    },
    {
        " in the ": null
    },
    {
        "Demon in a Bottle": "demon in a bottle"
    },
    {
        " storyline.  The first time it becomes a problem is when Stark discovers that the national security agency ": null
    },
    {
        "S.H.I.E.L.D.": "s.h.i.e.l.d."
    },
    {
        " has been buying a controlling interest in his company in order to ensure Starks continued weapons development for them. At the same time, it is revealed that several minor supervillains armed with advanced weapons who had bedeviled Stark throughout his superhero career are in fact in the employ of Starks business rival, ": null
    },
    {
        "Justin Hammer": "justin hammer"
    },
    {
        ", who begins to plague Stark more directly.   At one point in Hammers manipulations, the Iron Man armor is taken over and used to murder a diplomat. Although Iron Man is not immediately under suspicion, Stark is forced to hand the armor over to the authorities.  Eventually Stark and Rhodes, who is now his personal pilot and confidant, track down and defeat those responsible, although Hammer would return to bedevil Stark again.  With the support of his then-girlfriend, ": null
    },
    {
        "Bethany Cabe": "bethany cabe"
    },
    {
        ", his friends and his employees, Stark pulls through these crises and overcomes his dependency on alcohol.  Even as he recovers from this harrowing personal trial, Starks life is further complicated when he has a confrontation with ": null
    },
    {
        "Doctor Doom": "doctor doom"
    },
    {
        " that is interrupted by an opportunistic enemy sending them back in time to the time of ": null
    },
    {
        "King Arthur": "king arthur"
    },
    {
        ".  Once there, Iron Man thwarts Dooms attempt to solicit the aid of ": null
    },
    {
        "Morgan Le Fay": "morgan le fay"
    },
    {
        ", and the Latverian ruler swears deadly vengeance—to be indulged sometime after the two return to their own time.  This incident was collected and published as  Doomquest .     Some time later, a ruthless rival, ": null
    },
    {
        "Obadiah Stane": "iron monger"
    },
    {
        ", manipulates Stark emotionally into a serious relapse. As a result, Stark loses control of Stark International to Stane, becomes a homeless alcoholic vagrant and gives up his armored identity to Rhodes, who becomes the new Iron Man. Eventually, Stark recovers and joins a new startup, Circuits Maximus. Stark concentrates on new technological designs, including building a new set of armor as part of his recuperative therapy. Rhodes continues to act as Iron Man but steadily grows more aggressive and paranoid, due to the armor not having been calibrated properly for his use. Eventually Rhodes goes on a rampage, and Stark has to don a replica of his original armor to stop him. Fully recovered, Stark confronts Stane who has himself designed armor based on designs seized along with Stark International, dubbing himself the Iron Monger. Defeated in battle, Stane, rather than give Stark the satisfaction of taking him to trial, commits suicide.  Shortly thereafter, Stark regains his personal fortune, but decides against repurchasing Stark International until much later; he instead creates Stark Enterprises, headquartered in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ".       In an attempt to stop other people from misusing his designs, Stark goes about ": null
    },
    {
        "disabling other armored heroes and villains": "armor wars"
    },
    {
        " who are using suits based on the Iron Man technology, the designs of which were stolen by his enemy ": null
    },
    {
        "Spymaster": "spymaster spymaster i"
    },
    {
        ". His quest to destroy the stolen technology—originally called Stark Wars but is more commonly known as the ": null
    },
    {
        "Armor Wars": "armor wars"
    },
    {
        " —severely hurts his reputation as Iron Man. After attacking and disabling a series of minor villains such as ": null
    },
    {
        "Stilt-Man": "stilt-man"
    },
    {
        ", he attacks and defeats the government operative known as ": null
    },
    {
        "Stingray": "stingray"
    },
    {
        ". The situation worsens when Stark realizes that Stingrays armor does not incorporate any of his designs. He publicly fires Iron Man while covertly pursuing his agenda. He uses the cover story of wanting to help disable the rogue Iron Man to infiltrate and disable the armor of the S.H.I.E.L.D. operatives known as the ": null
    },
    {
        "Mandroid": "mandroid"
    },
    {
        "s, as well as the armor of the ": null
    },
    {
        "Guardsmen": "guardsman"
    },
    {
        ". In the process, Iron Man and Jim Rhodes allow some of the villains in the ": null
    },
    {
        "Vault": "vault"
    },
    {
        " to escape. This leads the ": null
    },
    {
        "United States government": "federal government of the united states"
    },
    {
        " to declare Iron Man a danger and an outlaw, and severely sours Starks relationship with Steve Rogers . Iron Man travels to Russia where he inadvertently causes the death of the Soviet ": null
    },
    {
        "Titanium Man": "titanium mantitanium man ii - the gremlin"
    },
    {
        " during a fight. Returning to the U.S., he faces an enemy commissioned by the government named ": null
    },
    {
        "Firepower": "firepower"
    },
    {
        ". Unable to defeat him head on, Stark fakes Iron Mans demise,  intending to retire the suit permanently. When Firepower goes rogue, Stark creates a new suit, claiming a new person is in the armor.     Soon after, Stark is nearly killed by Kathy Dare, a mentally unbalanced former lover. She shoots him dead center in his torso which injures his spine, paralyzing him.  Stark undergoes special surgery to have a nerve chip implanted into his spine to regain his mobility.  Unbeknownst to the industrialist, the nerve chip is a clandestine means by which to gain control over his body. Rival businessmen the Marrs Twins and their cohort ": null
    },
    {
        "Kearson DeWitt": "kearson dewitt"
    },
    {
        " are behind the machinations in what came to be known as Armor Wars II.  After several successful tests by DeWitt at manipulating Stark, Tony finds that using his Encephalo Armor can counteract DeWitts controls.  In response, DeWitt suddenly releases his control resulting in excruciating agony throughout Starks body.  The constant battle for control of Starks nervous system and subsequent abdication on DeWitts end lead to massive nerve damage throughout Tonys body. Starks nervous system continues its slide towards failure, and he constructs a skin made up of artificial nerve circuitry to assist it.  Stark begins to pilot a remote-controlled Iron Man armor, but when faced with the Masters of Silence, the ": null
    },
    {
        "telepresence": "telepresence"
    },
    {
        " suit proves inadequate.  Stark designs a more heavily armed version of the suit to wear, the Variable Threat Response Battle Suit , which becomes known as the ": null
    },
    {
        "War Machine armor": "war machine"
    },
    {
        ". Ultimately, the damage to his nervous system becomes too extensive. Faking his death, Stark places himself in ": null
    },
    {
        "suspended animation": "suspended animation"
    },
    {
        " to heal as Rhodes takes over both the running of Stark Enterprises and the mantle of Iron Man, although he uses the War Machine armor.  Stark eventually makes a full recovery by using a chip to create an entirely new nervous system, and resumes as Iron Man in a new ": null
    },
    {
        "Telepresence Armor": "iron mans armorntu-150 telepresence armor"
    },
    {
        ".  When Rhodes learns that Stark has manipulated his friends by faking his own death, he becomes enraged and the two friends part ways. Rhodes continues on as War Machine in a solo career.     The Avengers story arc The Crossing reveals Iron Man as a traitor among the teams ranks, due to years of manipulation by the time-traveling dictator ": null
    },
    {
        "Kang the Conqueror": "kang the conqueror"
    },
    {
        ". Stark, as a sleeper agent in Kangs thrall, kills Marilla, the nanny of ": null
    },
    {
        "Crystal": "crystal"
    },
    {
        " and ": null
    },
    {
        "Quicksilvers": "quicksilver"
    },
    {
        " daughter Luna, as well as Rita DeMara, the female ": null
    },
    {
        "Yellowjacket": "yellowjacket"
    },
    {
        ", then Amanda Chaney, an ally of the Avengers. The ": null
    },
    {
        "Avengers Forever": "avengers forever"
    },
    {
        " limited series ": null
    },
    {
        "retcon": "retroactive continuity"
    },
    {
        "s these events as the work of a disguised ": null
    },
    {
        "Immortus": "immortus"
    },
    {
        ", not Kang, and that the mental control had gone back only a few months.      Needing help to defeat both Stark and Kang, the team travels back in time to recruit a teenaged Anthony Stark from an alternate timeline to assist them. The young Stark steals an Iron Man suit in order to aid the Avengers against his older self. The sight of his younger self shocks the older Stark enough for him to regain momentary control of his actions, and he sacrifices his life to stop Kang.  The young Stark later builds his own suit to become the new Iron Man and remains in the present day.     During the battle with the creature called ": null
    },
    {
        "Onslaught": "onslaught"
    },
    {
        ", the teenage Stark dies, along with many other superheroes. ": null
    },
    {
        "Franklin Richards": "franklin richards"
    },
    {
        " preserves these dead heroes in the ": null
    },
    {
        "Heroes Reborn": "heroes reborn"
    },
    {
        " pocket universe, in which Stark is once again an adult hero; Franklin recreates the heroes in the pocket universe in the forms he is most familiar with rather than what they are at the present. The reborn adult Stark, upon returning to the normal Marvel Universe, merges with the original Stark, who had died during The Crossing , but was resurrected by Franklin Richards. This new Anthony Stark possesses the memories of both the original and teenage Anthony Stark, and thus considers himself to be essentially both of them. With the aid of the law firm ": null
    },
    {
        "Nelson & Murdock": "daredevil"
    },
    {
        ", he regains his fortune and, with Stark Enterprises having been sold to the Fujikawa Corporation following Starks death, sets up a new company, Stark Solutions. He returns from the pocket universe with a restored and healthy heart. After the Avengers reform, Stark demands a hearing be convened to look into his actions just prior to the Onslaught incident. Cleared of wrongdoing, he rejoins the Avengers.        At one point, Starks armor becomes sentient despite fail-safes to prevent its increasingly sophisticated computer systems from doing so.  Initially, Stark welcomes this living armor for its improved tactical abilities. The armor begins to grow more aggressive, killing indiscriminately and eventually desiring to replace Stark altogether. In the final confrontation on a desert island, Stark suffers another heart attack. The armor sacrifices its own existence to save its creators life, giving up essential components to give Stark a new, artificial heart. This new heart solves Starks health problems, but it does not have an internal power supply, so Stark becomes once again dependent on periodic recharging. The sentient armor incident so disturbs Stark that he temporarily returns to using an unsophisticated early model version of his armor to avoid a repeat incident.  He dabbles with using liquid metal circuitry known as S.K.I.N. that forms into a protective shell around his body, but eventually returns to more conventional hard metal armors.      During this time, Stark engages in a romance with ": null
    },
    {
        "Rumiko Fujikawa": "rumiko fujikawa"
    },
    {
        ", Iron Man 42 a wealthy heiress and daughter of the man who had taken over his company during the Heroes Reborn period. Her relationship with Stark endures many highs and lows, including infidelity with Starks rival, Tiberius Stone, in part because the fun-loving Rumiko believes that Stark is too serious and dull. Their relationship ends with Rumikos death at the hands of an Iron Man impostor in Iron Man 42     In Iron Man 42 , Stark publicly reveals his dual identity as Iron Man, not realizing that by doing so, he has invalidated the agreements protecting his armor from government duplication, since those contracts state that the Iron Man armor would be used by an employee of Tony Stark, not by Stark himself. When he discovers that the ": null
    },
    {
        "United States military": "military of the united states"
    },
    {
        " is again using his technology, and its defective nature nearly causes a disaster in Washington, D.C. which Iron Man barely manages to avert, Stark accepts a ": null
    },
    {
        "Presidential": "president of the united states"
    },
    {
        " appointment as ": null
    },
    {
        "Secretary of Defense": "united states secretary of defense"
    },
    {
        ". In this way, he hopes to monitor and direct how his designs are used.           In the ": null
    },
    {
        "Avengers Disassembled": "avengers disassembled"
    },
    {
        " storyline, Stark is forced to resign after launching into a tirade against the ": null
    },
    {
        "Latveria": "latveria"
    },
    {
        "n ambassador at the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ", being manipulated by the mentally imbalanced ": null
    },
    {
        "Scarlet Witch": "scarlet witch"
    },
    {
        ", who destroys Avengers Mansion and kills several members. Stark publicly stands down as Iron Man, but continues using the costume. He joins the Avengers in stopping the breakout in progress from the Raft and even saves Captain America from falling.  Tony changes the Avengers base to ": null
    },
    {
        "Stark Tower": "stark tower"
    },
    {
        ".  The ": null
    },
    {
        "Ghost": "ghost"
    },
    {
        ", the ": null
    },
    {
        "Living Laser": "living laser"
    },
    {
        " and ": null
    },
    {
        "Spymaster": "spymaster"
    },
    {
        " reappear and shift Iron Man from standard superhero stories to dealing with ": null
    },
    {
        "politics": "politics"
    },
    {
        " and ": null
    },
    {
        "industrialism": "industrialism"
    },
    {
        ".       New Avengers: Illuminati  42 reveals that years before, Stark had participated with a secret group that included the ": null
    },
    {
        "Black Panther": "black panther"
    },
    {
        ", ": null
    },
    {
        "Professor X": "professor x"
    },
    {
        ", ": null
    },
    {
        "Mister Fantastic": "mister fantastic"
    },
    {
        ", ": null
    },
    {
        "Black Bolt": "black bolt"
    },
    {
        ", ": null
    },
    {
        "Doctor Strange": "doctor strange"
    },
    {
        ", and ": null
    },
    {
        "Namor": "namor"
    },
    {
        ". The goal of the group  was to strategize overarching menaces, in which the Black Panther rejects a membership offer. Starks goal is to create a governing body for all superheroes in the world, but the beliefs of its members instead force them all to share vital information.       In the ": null
    },
    {
        "Civil War": "civil war"
    },
    {
        " storyline, after the actions of inexperienced superheroes ": null
    },
    {
        "the New Warriors": "the new warriors"
    },
    {
        " result in the destruction of several city blocks in Stamford, Connecticut, there is an outcry across America against superhumans. Learning of the Governments proposed plans, Tony Stark suggests a new plan to instigate a ": null
    },
    {
        "Superhuman Registration Act": "superhuman registration act"
    },
    {
        ". The Act would force every superpowered individual in the U.S. to register their identity with the government and act as licensed agents. The Act would force inexperienced superhumans to receive training in how to use and control their abilities, something in which Tony strongly believes. Since his struggle with alcoholism, Stark has carried a tremendous burden of guilt after nearly killing an innocent bystander while piloting the armor drunk. While Reed Richards and ": null
    },
    {
        "Dr. Henry Hank Pym": "hank pym"
    },
    {
        " both agree with Starks proposal, not everyone does. After ": null
    },
    {
        "Captain America": "captain america"
    },
    {
        " is ordered to bring in anyone who refuses to register, he and other anti-registration superheroes go rogue, coming into conflict with the pro-registration heroes, led by Iron Man. The war ends when Captain America surrenders to prevent further collateral damage and civilian casualties, although he had defeated Stark by defusing his armor. Stark is appointed the new director of S.H.I.E.L.D.,  and organizes a new government-sanctioned group of ": null
    },
    {
        "Avengers": "the mighty avengers"
    },
    {
        ". Shortly afterwards, Captain America is assassinated while in custody.  This leaves Stark with a great amount of guilt and misgivings about the cost of his victory.        To tie into the 42  Iron Man  feature film, Marvel launched a new Iron Man ongoing series, The Invincible Iron Man, with writer ": null
    },
    {
        "Matt Fraction": "matt fraction"
    },
    {
        " and artist ": null
    },
    {
        "Salvador Larroca": "salvador larroca"
    },
    {
        ". The series inaugural six-part storyline was The Five Nightmares , which saw Stark targeted by ": null
    },
    {
        "Ezekiel Stane": "ezekiel stane"
    },
    {
        ", the son of Starks former nemesis, Obadiah Stane.      In the ": null
    },
    {
        "Secret Invasion": "secret invasion"
    },
    {
        " storyline, after Tony Stark survives an attempt by ": null
    },
    {
        "Ultron": "ultron"
    },
    {
        " to take over his body, he is confronted in the hospital by ": null
    },
    {
        "Spider-Woman": "spider-woman"
    },
    {
        ", holding the corpse of a ": null
    },
    {
        "Skrull": "skrull"
    },
    {
        " posing as ": null
    },
    {
        "Elektra": "elektra"
    },
    {
        ". Realizing this is the start of an invasion by the Skrulls, Tony reveals the corpse to the Illuminati and declares that they are at war. After ": null
    },
    {
        "Black Bolt": "black bolt"
    },
    {
        " reveals himself as a Skrull and is killed by ": null
    },
    {
        "Namor": "namor"
    },
    {
        ", a squadron of Skrulls attack, forcing Tony to evacuate the other Illuminati members and destroy the area, killing all the Skrulls. Realizing that they are incapable of trusting each other, the members all separate to form individual plans for the oncoming invasion.      Stark is discredited and publicly vilified after his inability to anticipate or prevent the ": null
    },
    {
        "secret infiltration and invasion": "secret invasion"
    },
    {
        " of Earth by the Skrulls, and by the Skrull disabling of his StarkTech technology, which had a virtual monopoly on worldwide defense.  After the invasion, the U.S. government removes him as head of ": null
    },
    {
        "S.H.I.E.L.D.": "s.h.i.e.l.d."
    },
    {
        " and disbands the ": null
    },
    {
        "Avengers": "avengers"
    },
    {
        ", handing control of the ": null
    },
    {
        "Initiative": "fifty state initiative"
    },
    {
        " over to ": null
    },
    {
        "Norman Osborn": "green goblin"
    },
    {
        ".             With his Extremis powers failing, Stark uploads a virus to destroy all records of the Registration Act, thus preventing Osborn from learning the identities of his fellow heroes and anything that Osborn could use, including his repulsor generators. The only copy of the database is in Starks brain, which he tries to delete while on the run from Osborn.  Stark goes so far as to inflict ": null
    },
    {
        "brain damage": "brain damage"
    },
    {
        " on himself in order to ensure that the relevant information is wiped. When Osborn catches up to the debilitated Stark and beats him savagely, ": null
    },
    {
        "Pepper Potts": "pepper potts"
    },
    {
        " broadcasts the beatings worldwide, costing Osborn credibility and giving Stark public sympathy. Stark goes into a vegetative state, having previously granted ": null
    },
    {
        "Donald Blake": "thor"
    },
    {
        " power of attorney.  A holographic message stored in Peppers armor reveals that Stark had developed a means of rebooting his mind from his current state prior to his destruction of the database, with Blake and Bucky resolving to use it to restore him to normal. Meanwhile, Stark is trapped in his subconscious, where figments of his own mind prevent him from returning to the waking world. When the procedure fails to work, Bucky calls in Doctor Strange, who succeeds in restoring Stark back to consciousness. The backup Stark created was made prior to the Civil War, and as such he does not remember anything that took place during the event, although he still concludes after reviewing his past actions that he would not have done anything differently. His brain damage means he is now dependent on an arc reactor to sustain his bodys autonomous functions.             In the ": null
    },
    {
        "Siege": "siege"
    },
    {
        " storyline, Tony Stark is seen under the care of ": null
    },
    {
        "Dr. Donald Blake": "thor"
    },
    {
        " and ": null
    },
    {
        "Maria Hill": "maria hill"
    },
    {
        " when Asgard is attacked.  ": null
    },
    {
        "Thor": "thor"
    },
    {
        " is ambushed by ": null
    },
    {
        "Osborn": "green goblin"
    },
    {
        " and the ": null
    },
    {
        "Sentry": "sentry"
    },
    {
        ", but rescued by Hill. Osborn declares ": null
    },
    {
        "martial law": "martial law"
    },
    {
        " and unleashes ": null
    },
    {
        "Daken": "daken"
    },
    {
        " and the Sentry on Broxton to root out Thor and Hill. Hill returns to Starks hiding place to move him to a safer location and are joined by ": null
    },
    {
        "Speed": "speed"
    },
    {
        " of the ": null
    },
    {
        "Young Avengers": "young avengers"
    },
    {
        ", who has a set of Iron Mans MK III armor that ": null
    },
    {
        "Edwin Jarvis": "edwin jarvis"
    },
    {
        " had given Captain America. While Osborn is battling the ": null
    },
    {
        "New Avengers": "the new avengers"
    },
    {
        ", Stark appears and disables Osborns Iron Patriot armor. Osborn orders the Sentry to annihilate Asgard, rather than allow the Avengers to have it. After Asgard falls, Stark stands alongside his fellow heroes, as Osborn exclaims they are all doomed and he was saving them from him pointing up towards a ": null
    },
    {
        "Void": "sentry void"
    },
    {
        "-possessed Sentry.  As the Void tears apart the teams, Loki gives them the power to fight back through the ": null
    },
    {
        "Norn Stones": "norn stones"
    },
    {
        ". The Void kills Loki, enraging Thor. Tony tells Thor to get the Void away from Asgard, which allows Tony to drop a commandeered H.A.M.M.E.R. Helicarrier on the Void. Thor is forced to killed Sentry when the Void resurfaces. Sometime later, the Super-Human Registration Act is repealed and Tony is given back his company and armor. As a symbol for their heroics and their new unity, Thor places an Asgardian tower on Stark Tower where the Watchtower once stood.           In the 42–42 Stark: Resilient storyline, Tony builds the Bleeding Edge armor with the help of Mister Fantastic. This new armor fully uses the repulsor tech battery embedded in his chest to power Tonys entire body and mind, thus allowing him access to Extremis once more. Furthermore, the battery operates as his heart and is the only thing keeping him alive.  Tony announces he will form a new company, Stark Resilient. He states that he will no longer develop weapons, but will use his repulsor technology to give free energy to the world. Justine and Sasha Hammer create their own armored hero, Detroit Steel, to take Starks place as the Armys leading weapons-builder. Starks plan consists of building two repulsor-powered cars. The Hammers try to foil his efforts. The first car is destroyed by sabotage, while Detroit Steel attacks Stark Resilients facilities while Tony tests the second car. Through a legal maneuver, Tony is able to get the Hammers to stop their attacks and releases a successful commercial about his new car.         In the 42 ": null
    },
    {
        "Fear Itself": "fear itself"
    },
    {
        " storyline, Earth is attacked by the ": null
    },
    {
        "Serpent": "serpent"
    },
    {
        ", the God of Fear and the long-forgotten brother of Odin.  In Paris, Iron Man fights ": null
    },
    {
        "Grey Gargoyle": "grey gargoyle"
    },
    {
        ", who has become Mokk, Breaker of Faith, one of the Serpents Worthy. Mokk leaves Iron Man unconscious and transforms Detroit Steel and the citizens of Paris into stone.   To defeat the Serpents army, Tony drinks a bottle of wine to gain an audience with Odin, who allows Tony to enter the realm of Svartalfheim. Tony and the dwarves of Svartalfheim build enchanted weapons.  Tony upgrades his armor with uru-infused enchantments and delivers the finished weapons to the Avengers, who use them for the final battle against the Serpents forces. Iron Man watches as Thor kills the Serpent, but dies in the process. After the battle is over, Tony melts down the weapons he created and repairs Captain Americas shield, which had been broken by Serpent, and gives it back to Captain America.  During a subsequent argument with Odin about the gods lack of involvement in the recent crisis, Odin gives Tony a brief opportunity to see the vastness of the universe the way he sees it. As thanks for Tonys role in the recent crisis, Odin restores all the people that the Grey Gargoyle killed during his rampage.        In the storylines Demon and The Long Way Down , Stark is subpoenaed by the U.S. government after evidence surfaces of him using the Iron Man armor while under the influence. Mandarin and Zeke Stane upgrade some of Iron Mans old enemies and send them to commit acts of terrorism across the world, intending to discredit Iron Man. General Bruce Babbage forces Stark to wear a tech governor, a device that allows Babbage to deactivate Starks armor whenever he wants. To fight back, Tony undergoes a surgical procedure that expels the Bleeding Edge technology out of his body and replaces his repulsor node with a new model, forcing Babbage to remove the tech governor off his chest. He announces his retirement as Iron Man, faking Rhodes death and giving him a new armor so that he becomes the new Iron Man.  This leads into the next storyline, The Future , in which the Mandarin takes control of Starks mind and uses him to create new armored bodies for the alien spirits inhabiting his rings, but Stark allies himself with some of his old enemies, who have also been imprisoned by Mandarin, and manages to defeat him. The final issue of this storyline concluded Matt Fractions series.      In the ongoing series that premiered in 42 as part of the ": null
    },
    {
        "Marvel NOW!": "marvel now!"
    },
    {
        " relaunch, Tony Stark has hit a technological ceiling. After the death of Dr. Maya Hansen and the destruction of all of the Extremis Version 42 kits that were being sold to the black market, Tony decides that the Earth is not safe without him learning more from whats in the final frontier. He takes his new suit, enhanced with an artificial intelligence named P.E.P.P.E.R. and joins ": null
    },
    {
        "Peter Quill": "peter quill"
    },
    {
        " and The ": null
    },
    {
        "Guardians of the Galaxy": "guardians of the galaxy"
    },
    {
        " after helping them thwart a Badoon attack on Earth.        Tony Starks personality is inverted during the events of  AXIS , bringing out more dark aspects of himself like irresponsibility, egotism and alcoholism.  Stark relocates to ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " and builds a new, all-white armor. He supplies the citizens of San Francisco with the Extremis 42 app, a version of the techno-virus that offers beauty, health or even immortality, free.  When every person in the city viewed Iron Man as a messiah for making their dreams come true, he ended the free trial mode and started charging a daily fee of $42, causing many to resort to crime to pay for the upgrade.  ": null
    },
    {
        "Daredevil": "daredevil"
    },
    {
        " confronts Stark at his new ": null
    },
    {
        "Alcatraz Island": "alcatraz island"
    },
    {
        " penthouse, but is easily brushed off.  Iron Man uses Extremis 42 to temporarily restore Daredevils sight, just to prove his point.  Daredevil deduces that Stark had added Extremis to the water supply and the phones only transmit an activation signal, but Stark subjects Murdock to minor brain damage to prevent him from sharing this revelation with others.      After discovering that new villain Teen Abomination is the son of Happy Hogan, Stark decides to help him,  but this minor act of redemption is too late for Pepper Potts, who attacks Stark with the aid of an A.I. based on Starks mind.  This culminates in a confrontation between the two Starks, as Stark calls on the unwitting aid of all infected with the Extremis upgrade while the A.I. uses Starks various old armors to attack him.  Although Stark technically wins the battle as he destroys his other armors and deletes the A.I. backup, Pepper states that she plans to reveal the truth about his goals with Extremis, bluntly informing him that if he continues his Extremis upgrade project, he will have to do it alone, accepting his fate of being regarded as a monster by all who know him.        During the ": null
    },
    {
        "Time Runs Out": "time runs out"
    },
    {
        " storyline, an attempt at reclaiming Wakanda from the Cabal that Namor had created to destroy incursive Earths results in Tony being held captive in the Necropolis.  After the Cabal are apparently killed, the Illuminati free Tony, who is forced to flee due to the Illuminatis unwillingness to let Stark be there with them when they meet Rogers and the Avengers. When the Shiar and their allies arrive to destroy Earth, the Avengers and the Illuminati unsuccessfully try to retaliate. Iron Man uses Sols Hammer to destroy the fleet.  The incursions continue, and Rogers confronts Stark about what he knows. A fight ensues between them and Stark admits that he had lied and had known about the incursions all along. During the final incursion, Earth42s S.H.I.E.L.D. launches a full-scale attack on Earth42 during which Stark and Rogers are crushed by a Helicarrier.        After the events of the Secret Wars crossover, Stark returns to his normal self with no signs of his inverted personality. Eight months following the return of the universe as seen in the ": null
    },
    {
        "All-New, All-Different Marvel": "all-new, all-different marvel"
    },
    {
        " event, Tony works in his laboratory non-stop after his position as an innovator had been put in doubt. Because an M.I.T. student reverse-engineered some of his technology, Stark develops a new armor which can change shape according to the situation he would find himself. When Starks new A.I. ": null
    },
    {
        "F.R.I.D.A.Y.": "f.r.i.d.a.y."
    },
    {
        " informs him that Madame Masque has broken into the ruins of Castle Doom, he travels to Latveria to invfestigate and runs into some revolutionaries who are then defeated by a man in a suit. To his amazement, Iron Mans armor computer identifies him as Doctor Doom with his face restored. Doctor Doom claims that he wanted to help Iron Man.      After learning from Doctor Doom that Madame Masque has taken a decoy of the Wand of Watoomb, Tony Stark confronts Madame Masque. Upon learning that Madame Masque is not allied with Doctor Doom, Tony is attacked by her with a burst of energy that damages his armor.  F.R.I.D.A.Y. manages to gain control of the suit and takes Tony to a safe location. Iron Man tracks Madame Masque to Marina del Rey. After finding a tape recorder with her messages, Tony is attacked by several black silhouettes with swords.      Iron Man escapes the ninjas that are attacking him and manages to defeat most of them, but they kill themselves before he can interrogate any of them. Iron Man and Doctor Doom arrive at ": null
    },
    {
        "Mary Jane Watson": "mary jane watson"
    },
    {
        "s newest Chicago night club Jackpot when Madame Masque attacks it.  As Mary Jane distracts Madame Masque by knocking off her mask, Iron Man and Doctor Doom discover that Madame Masque is possessed by a demon. Doctor Doom is able to perform an exorcism on her.     Doctor Strange arrives and tells Iron Man he will take Madame Masque with him to fix her metaphysically and then hand her over at S.H.I.E.L.D. Iron Man also informs him of Doctor Dooms help who had left the scene some time ago. Three days later, Iron Man offers Mary Jane a job to make up for the damage to her nightclub.  After speaking with War Machine, Tony Stark meets up at a diner with Amara Perera when they are unexpectedly joined by Doctor Doom who wanted to make sure that the demonic possession that affected Madame Masque has not affected Stark or Amara.  Stark shows Mary Jane the demonstration on the people that he will be working with. They are interrupted by F.R.I.D.A.Y. who tells Tony that War Machine is missing. Before heading to Tokyo, Tony receives from Mary Jane the emergency number for Peter Parker. In Tokyo, Iron Man is contacted by Spider-Man at War Machines last known location as he is being observed by ninjas.      During the  Civil War II  storyline, Iron Man protests the logic of using precognitive powers to stop future crimes after the recently emerged Inhuman ": null
    },
    {
        "Ulysses": "ulysses"
    },
    {
        " predicted ": null
    },
    {
        "Thanos": "thanos"
    },
    {
        "s attack on Project Pegasus. Three weeks later, Iron Man is summoned to the Triskelion after War Machine is killed in battle against Thanos. When Iron Man learns that War Machine and the Ultimates used Ulysses power to ambush Thanos, he vows to stop anyone from using that power again.  Iron Man infiltrates New Attilan and makes off with Ulysses. At Stark Tower, Iron Man vows to find out how Ulysses precognition works. The Inhumans attack Stark Tower but are stopped by the Avengers, the ": null
    },
    {
        "Ultimates": "ultimates"
    },
    {
        ", and S.H.I.E.L.D. During the confrontation, Ulysses has another vision which he projects to Iron Man and everyone present, showing a rampaging Hulk standing over the corpses of the defeated superheroes.  The heroes confront Banner, who is killed by Hawkeye. Barton claims that Banner was about to transform and Banner had previously asked Hawkeye to kill him if he should turn back into the Hulk. Tony is disgusted at this use of Ulysses power. When his analysis of Ulysses brain is completed,  Tony reveals that Ulysses does not actually see the future, but simply assembles large quantities of data to project likely outcomes. While Danvers continues to use the visions as a resource, Tony objects to the concept of profiling people. This results in a stand-off when Tonys side abducts a woman from custody after Ulysses visions identified her as a deep-cover ": null
    },
    {
        "HYDRA": "hydra"
    },
    {
        " agent, despite the lack of supporting evidence.      Iron Man learns that his biological mother was actually Amanda Armstrong , who had given him up for adoption and that his biological father was a Hydra double agent named Jude . S.H.I.E.L.D. had Armstrongs baby adopted by Howard and Maria Stark.        In July 42 it was announced that Tony Stark would hand off the mantle of Iron Man to a 42-year-old girl named ": null
    },
    {
        "Riri Williams": "ironheart"
    },
    {
        ". Riri is an MIT student who built her own Iron Man suit out of scrap pieces and, as such, attracted Starks attention. Early depictions of Williams suit depict it without the Arc Reactor, but leaves the power source for the suit unclear.  Another Iron Man-based series titled  Infamous Iron Man  debuted featuring Doctor Doom sporting his version of the Iron Man armor.  This is revealed to be the result of serious injuries sustained by Stark during his final confrontation with Captain Marvel. Danvers beating leaves Stark in a coma, but he is left alive due to unspecified experiments Stark has carried out on himself over the years. Civil War II 42       Following the revelation that Stark experimented on himself at the end of Civil War II, Beast concludes that the only option is to let the experiments do their job in healing Tony and recover on his own. In Invincible Iron Man 42 an employee of Stark sends Riri Williams an artificial intelligence housing a copy of Tony Starks consciousness to help her control and mentor in her own version of the Iron Man armor. This A.I. is directly copied from Tonys brain, granting sentience, with Williams commenting on Stark existing as a techno-ghost . As an A.I., Stark can walk around as a hard-light object and gains the ability to remote control his vast armory of Iron Man suits.  In The Mighty Captain Marvel 42 the Tony Stark A.I. goes to Antarctica and visits Captain Marvel with the intent on settling their differences from the Second Civil War, she apologizes to him for her regrets, reconciles with him eventually and they become allies once more. Then in ": null
    },
    {
        "Secret Empire": "secret empire"
    },
    {
        ", the Tony Stark A.I. suits up as Iron Man once again and learns of Captain Americas betrayal to Hydra and how he ended up like this. As Hydra tightens its grip across America, the Tony Stark A.I. leads a team known as the Underground to find the Cosmic Cubes to restore Rogers to his normal self. When things start to escalate, Tony and his crew go rogue and in search for answers for the Cube. As Iron Man and the Underground search for them they are intercepted by Captain America and his Hydra team. With both teams encountering each other, they are captured by the Ultron/Hank Pym hybrid, who forces both teams to sit at a dinner table. During dinner , Ultron reveals information about the Hydra Avengers - such as Odinson working with Hydra to reclaim Mjolnir, Scarlet Witch being possessed by Chthon, and Vision being affected by an A.I. virus. Ultron argues that he is doing this because the Avengers have become less of a family over the years as so many of them jump to obey Captain America or Iron Man, despite past experience confirming that this is not always a good idea, but Tony counters that the only reason the team failed as a family was because of Hanks abuse towards Wasp. Enraged, Ultron is about to kill everyone, but Ant-Man is able to calm him down by arguing that Hank remains his own inspiration. Ultron allows the Underground to leave with the fragment, arguing that neither side should have an advantage over the other. Back in America, Hydra Supreme has put Namor in a position where he will be forced to sign a peace treaty that gives Rogers access to the Cosmic Cube fragment in Atlantis, but Hydra Supreme muses that he is unconcerned about who will acquire the fragments, as he has an inside man in the Underground. After the Mount was attacked by Thor and the resurrected Hulk led by Hydra, the Underground evacuated the civilians thanks to Hawkeye and the rest of the heroes. Captain America and Iron Man fight as the Mount collapses around them. The Tony Stark A.I. initiates the Mounts Clean Slate Protocol , and blows up the Mount, killing Madame Hydra, then apologizes to Steve Rogers about their past differences, but the A.I survives and, in the aftermath, helps the heroes pull the pieces back together to take down Hydra. When Iron Man confronts Hydra Supreme, he and the other heroes are easily overpowered by him and watch the original Captain America defeat his Hydra self and into celebrating their victory. Secret Empire4242          Mary Jane Watson and other Stark employees find that Starks body has completely vanished from its pod, despite tests taken mere hours ago showing no sign of improvement or brain activity. Marvel Legacy 42 It was discovered that Tony Starks comatose body was taken to the Stark Industries Complex in Dover. Invincible Iron Man 42 Marvel Comics. Upon awakening when his biological systems rebooted, Tony Stark went into hiding until he fully recovered. Invincible Iron Man 42 Marvel Comics. Wanting to make sure that James Rhodes was in a similar state that he was in, Tony Stark exhumed his body from Arlington Cemetery and kick-started the biological systems in him. Afterwards, Iron Man and War Machine fought Hood to keep Stark Industries from falling into Hoods hands where he switched to a version of his Extremis armor. Then he proceeded to defeat Jude when he turned up alive. Invincible Iron Man 42 Marvel Comics.                 Iron Man possesses ": null
    },
    {
        "powered armor": "powered exoskeleton"
    },
    {
        " that gives him superhuman strength and durability, flight, and an array of weapons. The armor is invented and worn by Stark . Other people who have assumed the Iron Man identity include Starks long-time partner and best friend ": null
    },
    {
        "James Rhodes": "war machine"
    },
    {
        "; DeFalco 42s in Gilbert , p. 42: Jim was the natural choice to replace as Iron Man when Tonys problems with alcohol prevented him from doing the job. Jim continued in his role until Iron Man 42 . close associates ": null
    },
    {
        "Harold Happy Hogan": "happy hogan"
    },
    {
        "; Eddie March; Sanderson 42s in Gilbert , p. 42: Boxer Eddie March was the first African-American to wear Iron Mans armor.  ": null
    },
    {
        "Michael OBrien": "guardsman"
    },
    {
        " and Riri Williams.     The weapons systems of the suit have changed over the years, but Iron Mans standard offensive weapons have always been the repulsor rays that are fired from the palms of his ": null
    },
    {
        "gauntlet": "gauntlet"
    },
    {
        "s. Other weapons built into various incarnations of the armor include: the uni-beam projector in its chest; pulse bolts ; an ": null
    },
    {
        "electromagnetic pulse": "electromagnetic pulse"
    },
    {
        " generator; and a defensive energy shield that can be extended up to 42 degrees. Other capabilities include: generating ultra-": null
    },
    {
        "freon": "freon"
    },
    {
        " ; creating and manipulating ": null
    },
    {
        "magnetic field": "magnetic field"
    },
    {
        "s; emitting sonic blasts; and projecting 42-dimensional ": null
    },
    {
        "hologram": "hologram"
    },
    {
        "s .     In addition to the general-purpose model he wears, Stark has developed several specialized ": null
    },
    {
        "suits": "space suit"
    },
    {
        " for ": null
    },
    {
        "space travel": "spaceflight"
    },
    {
        ", ": null
    },
    {
        "deep-sea diving": "atmospheric diving suit"
    },
    {
        ", ": null
    },
    {
        "stealth": "stealth technology"
    },
    {
        ", and other special purposes. Stark has modified suits, like the Hulkbuster heavy armor. The Hulkbuster armor is composed of add-ons to his so-called modular armor, designed to enhance its strength and durability enough to engage the ": null
    },
    {
        "Hulk": "hulk"
    },
    {
        " in a fight. A later model, created with the help of ": null
    },
    {
        "Odin": "odin"
    },
    {
        " and the Asgardian metal Uru, is similar to the ": null
    },
    {
        "Destroyer": "destroyer"
    },
    {
        ". Stark develops an electronics pack during the Armor Wars that, when attached to armors that use Stark technologies, will burn out those components, rendering the suit useless. This pack is ineffective on later models. While it is typically associated with ": null
    },
    {
        "James Rhodes": "war machine"
    },
    {
        ", the War Machine armor began as one of Starks specialty armors.     The most recent models of Starks armor, beginning with the Extremis armor, are now stored in the hollow portions of Starks bones, and the personal area networking implement used to control it is implanted into his forearm, and connected directly to his ": null
    },
    {
        "central nervous system": "central nervous system"
    },
    {
        ".     The Extremis has since been removed, and he now uses more conventional armors. Some armors still take a liquid form, but are not stored within his body. His Endo-Sym Armor incorporates a combination of the liquid smart-metal with the alien Venom symbiote, psionically controlled by Stark.     Post-Secret Wars, Stark uses a more streamlined suit of armor that uses ": null
    },
    {
        "nanotechnology": "nanotechnology"
    },
    {
        " to shape shift into other armors or weapons.        After being critically injured during a battle with the Extremis-enhanced Mallen, Stark injects his nervous system with modified techno-organic virus-like body restructuring machines .  By rewriting his own biology, Stark is able to save his life, gain an enhanced ": null
    },
    {
        "healing factor": "healing factor"
    },
    {
        ", and partially merge with the Iron Man armor, superseding the need for bulky, AI-controlled armors in favor of lighter designs, technopathically controlled by his own brain. His enhanced technopathy extends to every piece of technology, limitless and effortlessly due to his ability to interface with communication satellites and wireless connections to increase his range . Some components of the armor-sheath are now stored in Tonys body, able to be recalled, and extruded from his own skin, at will.     During the ": null
    },
    {
        "Secret Invasion": "secret invasion"
    },
    {
        " storyline the Extremis package is catastrophically shut down by a virus, forcing him again to rely on the previous iteration of his armor, and restoring his previous limitations. Furthermore, Osborns takeover of most of the few remaining Starktech factories, with Ezekiel Stane systematically crippling the others, limits Tony to the use of lesser, older and weaker armors.      After being forced to wipe out his brain to prevent Norman Osborn from gaining his information, Tony Stark is forced to have a new arc reactor, of ": null
    },
    {
        "Rand": "iron fist"
    },
    {
        " design installed in his chest. The process greatly improves his strength, stamina and intellect. The procedure left him with virtually no autonomic functions: as his brain was stripped of every biological function, Tony is forced to rely on a digital backup of his memories and on software routine in the arc reactor for basic stimuli reaction, such as blinking and breathing.   The Bleeding Edge package of armor and physical enhancement is now equal in power, if not a more advanced, version of the old Extremis tech.       Tony Stark is an inventive genius whose expertise in the fields of ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", ": null
    },
    {
        "physics": "physics"
    },
    {
        ", ": null
    },
    {
        "chemistry": "chemistry"
    },
    {
        ", and ": null
    },
    {
        "computer science": "computer science"
    },
    {
        " rivals that of ": null
    },
    {
        "Reed Richards": "mister fantastic"
    },
    {
        ", ": null
    },
    {
        "Hank Pym": "hank pym"
    },
    {
        ", and ": null
    },
    {
        "Bruce Banner": "hulk"
    },
    {
        ", and his expertise in ": null
    },
    {
        "electrical engineering": "electrical engineering"
    },
    {
        " and ": null
    },
    {
        "mechanical engineering": "mechanical engineering"
    },
    {
        " surpasses even theirs. He is regarded as one of the most intelligent characters in the Marvel Universe. He graduated with advanced degrees in physics and engineering at the age of 42 from ": null
    },
    {
        "Massachusetts Institute of Technology": "massachusetts institute of technology"
    },
    {
        "  and further developed his knowledge ranging from ": null
    },
    {
        "artificial intelligence": "artificial intelligence"
    },
    {
        " to ": null
    },
    {
        "quantum mechanics": "quantum mechanics"
    },
    {
        " as time progressed. His expertise extends to his ingenuity in dealing with difficult situations, such as difficult foes and deathtraps, in which he is capable of using available tools, including his suit, in unorthodox but effective ways. He is well respected in the business world, able to command peoples attention when he speaks on economic matters, having over the years built up several multimillion-dollar companies from virtually nothing. He is noted for the loyalty he commands from and returns to those who work for him, as well as for his business ethics. Thus he immediately fired an employee who made profitable, but illegal, sales to ": null
    },
    {
        "Doctor Doom": "doctor doom"
    },
    {
        ". He strives to be environmentally responsible in his businesses.     At a time when Stark was unable to use his armor for a period, he received some combat training from ": null
    },
    {
        "Captain America": "captain america"
    },
    {
        " and has become physically formidable on his own when the situation demands it.  In addition, Stark possesses great business and political acumen. On multiple occasions he reacquired control of his companies after losing them amid corporate takeovers.      Due to his membership in the Illuminati, Iron Man was given the Space ": null
    },
    {
        "Infinity Gem": "infinity gem"
    },
    {
        " to safeguard.  It allows the user to exist in any location , move any object anywhere throughout the universe and warp or rearrange space.                                In 42 Iron Man was featured in a series of cartoons.  In 42 Iron Man guest appeared in  Spider-Man and His Amazing Friends , but only as Tony Stark.  He went on to feature again in his own series in the 42s as part of the  Marvel Action Hour  with the Fantastic Four; ": null
    },
    {
        "Robert Hays": "robert hays"
    },
    {
        " provided his voice in these animated cartoons. Iron Man makes an appearance in the episode Shell Games of  Fantastic Four: Worlds Greatest Heroes .   Apart from comic books, Iron Man appears in Capcoms  Vs.  video games, including  Marvel Super Heroes ,  Marvel vs. Capcom 42: New Age of Heroes ,  Marvel vs. Capcom 42: Fate of Two Worlds , and  Ultimate Marvel vs. Capcom 42 . Iron Man is a playable character in  Iron Man , the 42 arcade game  Captain America and the Avengers ,  Marvel: Ultimate Alliance  and ": null
    },
    {
        "its sequel": "marvel: ultimate alliance 2"
    },
    {
        ", and  Marvel Nemesis: Rise of the Imperfects , as well as being featured as an unlockable character in  X-Men Legends II: Rise of Apocalypse  and  Tony Hawks Underground .  In the 42 animated series,  Iron Man: Armored Adventures , most of the characters, including Tony Stark, are teenagers. An ": null
    },
    {
        "anime adaptation": "marvel anime"
    },
    {
        " began airing in Japan in October 42 as part of a collaboration between ": null
    },
    {
        "Marvel Animation": "marvel animation"
    },
    {
        " and ": null
    },
    {
        "Madhouse": "madhouse"
    },
    {
        ", in which Stark, voiced by ": null
    },
    {
        "Keiji Fujiwara": "keiji fujiwara"
    },
    {
        ", travels to Japan where he ends up facing off against the Zodiac.       In 42 a film adaptation titled  Iron Man  was released, starring ": null
    },
    {
        "Robert Downey Jr.": "robert downey jr."
    },
    {
        " as Tony Stark and directed by ": null
    },
    {
        "Jon Favreau": "jon favreau"
    },
    {
        ". Iron Man received very positive reviews from film critics,  grossing $42 million domestically and $42 million worldwide, and became the first in a series of over 42 films known as the ": null
    },
    {
        "Marvel Cinematic Universe": "marvel cinematic universe"
    },
    {
        ".  The character of Tony Stark, again played by Robert Downey Jr., appeared at the end of the 42 film  The Incredible Hulk . Downey reprised his role in  Iron Man 42  ,  Marvels The Avengers  ,  Iron Man 42  ,  Avengers: Age of Ultron  ,  Captain America: Civil War  ,  Spider-Man: Homecoming  ,  Avengers: Infinity War  ,  Avengers: Endgame  , and the upcoming  Black Widow  .       In 42 Playtech released an online casino slot machine game called Iron Man. After that they created two more games, Iron Man 42 and Iron Man 42      In October 42 ": null
    },
    {
        "Eoin Colfer": "eoin colfer"
    },
    {
        " released a young adult novel called Iron Man: The Gauntlet.         ": null
    },
    {
        "rapper": "rapping"
    },
    {
        " Ghostface Killah": "ghostface killah"
    },
    {
        ", a member of ": null
    },
    {
        "Wu-Tang Clan": "wu-tang clan"
    },
    {
        ", titled his 42 debut solo album  Ironman , and has since continued to use lyrics related to the Iron Man comics and ": null
    },
    {
        "samples": "sampling"
    },
    {
        " from the animated TV shows on his records.   He has adopted the nickname Tony Starks as one of his numerous alter-egos, and was featured in a scene deleted from the ": null
    },
    {
        "Iron Man film": "iron man"
    },
    {
        ".   ": null
    },
    {
        "Paul McCartney": "paul mccartney"
    },
    {
        "s song ": null
    },
    {
        "Magneto and Titanium Man": "magneto and titanium man"
    },
    {
        " was inspired by the ": null
    },
    {
        "X-Men": "x-men"
    },
    {
        "s nemesis and the original version of the Iron Man villain. Another Iron Man villain, the Crimson Dynamo, is mentioned in the lyrics to this song.     The British band ": null
    },
    {
        "Razorlight": "razorlight"
    },
    {
        " mentions Tony Stark in a verse of their song, Hang By, Hang By .    The character of ": null
    },
    {
        "Nathan Stark": "nathan stark"
    },
    {
        " on the television show  Eureka  is inspired by Tony Stark.    In 42 ": null
    },
    {
        "IGN": "ign"
    },
    {
        " ranked Iron Man 42th in the Top 42 Comic Book Heroes.   Two Iron Man-themed trucks compete in the ": null
    },
    {
        "Monster Jam": "monster jam"
    },
    {
        " monster truck racing series. Debuted in Atlanta on 42 January 42 they are driven by Lee O Donnell and Morgan Kane.    In 42 ": null
    },
    {
        "University of Central Florida": "university of central florida"
    },
    {
        " engineering student Albert Manero, who builds and donates affordable ": null
    },
    {
        "42D-printed": "3d-printed"
    },
    {
        " bionic limbs to those in need, constructed a ": null
    },
    {
        "bionic arm": "bionic arm"
    },
    {
        " based on Iron Mans suit for 42-year-old Alex Pring, a superhero fan who was born with a partially formed right arm. He then delivered the Iron Man arm to Pring with the help of Robert Downey Jr. in character as Tony Stark.   ABC News on YouTube   For ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        " Players Weekend": "players weekend"
    },
    {
        " in August 42 ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " second baseman ": null
    },
    {
        "Gleyber Torres": "gleyber torres"
    },
    {
        " designed his custom cleats after Iron Mans suit.    A TV show demonstrated a ": null
    },
    {
        "hovering": "hover"
    },
    {
        " bullet-mitigating": "bulletproofing"
    },
    {
        " suit with some of the official Marvel design features in 42  ": null
    }
]