[
    {
        "   Isaac Ambrose was an ": null
    },
    {
        "English": "england"
    },
    {
        " Puritan": "puritan"
    },
    {
        " divine": "anglicanismanglican divines"
    },
    {
        ". He graduated with a BA. from ": null
    },
    {
        "Brasenose College, Oxford": "brasenose college, oxford"
    },
    {
        ", on 42 He obtained the curacy of ": null
    },
    {
        "St Edmund’s Church, Castleton": "st edmund’s church, castleton"
    },
    {
        ", Derbyshire, in 42 He was one of kings four preachers in Lancashire in 42 He was twice imprisoned by commissioners of array. He worked for establishment of Presbyterianism; successively at Leeds, Preston, and Garstang, whence he was ejected for nonconformity in 42 He also published religious works.       Ambrose was born in 42 He was the son of Richard Ambrose, vicar of ": null
    },
    {
        "Ormskirk": "ormskirk"
    },
    {
        ", and was probably descended from the Ambroses of ": null
    },
    {
        "Lowick": "lowick, cumbria"
    },
    {
        " in ": null
    },
    {
        "Furness": "furness"
    },
    {
        ", a well-known ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " family. He entered ": null
    },
    {
        "Brasenose College, Oxford": "brasenose college, oxford"
    },
    {
        ", in 42 in his seventeenth year.     Having graduated B.A. in 42 and been ordained, Ambroses received in 42 the little cure of ": null
    },
    {
        "Castleton": "castleton, derbyshire"
    },
    {
        " in ": null
    },
    {
        "Derbyshire": "derbyshire"
    },
    {
        ". By the influence of ": null
    },
    {
        "William Russell, earl of Bedford": "william russell, 1st duke of bedford"
    },
    {
        ", he was appointed one of the kings itinerant preachers in ": null
    },
    {
        "Lancashire": "lancashire"
    },
    {
        ", and after living for a time in ": null
    },
    {
        "Garstang": "garstang"
    },
    {
        ", he was selected by the Lady Margaret Hoghton as vicar of ": null
    },
    {
        "Preston": "preston, lancashire"
    },
    {
        ". He associated himself with ": null
    },
    {
        "Presbyterianism": "presbyterianism"
    },
    {
        ", and was on the celebrated committee for the ejection of scandalous and ignorant ministers and schoolmasters during the ": null
    },
    {
        "Commonwealth": "commonwealth of england"
    },
    {
        ".     So long as Ambrose continued at Preston he was favoured with the warm friendship of the Hoghton family, their ancestral woods and the tower near ": null
    },
    {
        "Blackburn": "blackburn"
    },
    {
        " affording him sequestered places for those devout meditations and experiences that give such a charm to his ": null
    },
    {
        "diary": "diary"
    },
    {
        ", portions of which are quoted in his Prima Media and Ultima . The immense auditory of his sermon  at the funeral of Lady Hoghton was long a living tradition all over the county. On account of the feeling engendered by the civil war Ambrose left his great church of Preston in 42 and became minister of Garstang, whence, however, in 42 he was ejected along two thousand ministers who refused to conform . His after years were passed among old friends and in quiet meditation at Preston. He died of ": null
    },
    {
        "apoplexy": "apoplexy"
    },
    {
        " about 42 January 42       As a religious writer Ambrose has a vividness and freshness of imagination possessed by scarcely any of the ": null
    },
    {
        "Puritan": "puritan"
    },
    {
        " Nonconformists. Many who have no love for Puritan doctrine, nor sympathy with Puritan experience, have appreciated the ": null
    },
    {
        "pathos": "pathos"
    },
    {
        " and beauty of his writings, and his Looking unto Jesus long held its own in popular appreciation with the writings of ": null
    },
    {
        "John Bunyan": "john bunyan"
    },
    {
        ".     Dr ": null
    },
    {
        "Edmund Calamy the Elder": "edmund calamy the elder"
    },
    {
        " wrote about him:        In the opinion of John Eglington Bailey , his character has been misrepresented by Wood. He was of a peaceful disposition; and though he put his name to the fierce Harmonious Consent , he was not naturally a partisan. He evaded the political controversies of the time. His gentleness of character and earnest presentation of the gospel attached him to his people. He was much given to secluding himself, retiring every May into the woods of Hoghton Tower and remaining there a month.     Bailey continues that Dr. Halley justly characterises him as the most meditative puritan of Lancashire. This quality pervades his writings, which abound, besides, in deep feeling and earnest piety. Mr. Hunter has called attention to his recommendation of diaries as a means of advancing personal piety, and has remarked, in reference to the fragments from Ambroses diary quoted in the Media , that with such passages before us we cannot but lament that the carelessness of later times should have suffered such a curious and valuable document to perish; for perished it is to be feared it has .       ": null
    }
]