[
    {
        "              Isaac Manuel Francisco Albéniz y Pascual  was a ": null
    },
    {
        "Spanish": "spain"
    },
    {
        " virtuoso": "virtuoso"
    },
    {
        " pianist": "pianist"
    },
    {
        ", ": null
    },
    {
        "composer": "composer"
    },
    {
        ", and ": null
    },
    {
        "conductor": "conductor"
    },
    {
        ". He is one of the foremost composers of the Post-Romantic era who also had a significant influence on his contemporaries and younger composers. He is best known for his ": null
    },
    {
        "piano": "piano"
    },
    {
        " works based on Spanish ": null
    },
    {
        "folk music": "folk music"
    },
    {
        " idioms.     Transcriptions of many of his pieces, such as  Asturias ,  Granada ,  Sevilla ,  Cadiz ,  Córdoba ,  Cataluña ,  Mallorca , and  Tango in D , are important pieces for classical guitar, though he never composed for the guitar. The personal papers of Albéniz are preserved, among other institutions, in the  Biblioteca de Catalunya .              Born in ": null
    },
    {
        "Camprodon": "camprodon"
    },
    {
        ", province of ": null
    },
    {
        "Girona": "girona"
    },
    {
        ", to Ángel Albéniz and his wife, Dolors Pascual, Albéniz was a ": null
    },
    {
        "child prodigy": "child prodigy"
    },
    {
        " who first performed at the age of four. At age seven, after apparently taking lessons from ": null
    },
    {
        "Antoine François Marmontel": "antoine françois marmontel"
    },
    {
        ", he passed the entrance examination for piano at the ": null
    },
    {
        "Conservatoire de Paris": "conservatoire de paris"
    },
    {
        ", but he was refused admission because he was believed to be too young. By the time he had reached 12, he had made many attempts to run away from home.     His concert career began at the age of nine when his father toured both Isaac and his sister, Clementina, throughout northern Spain. A popular myth is that at the age of twelve Albéniz stowed away in a ship bound for ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        ". He then found himself in ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        ", then to the United States, giving concerts in New York and San Francisco and then travelled to ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", ": null
    },
    {
        "London": "london"
    },
    {
        " and ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ".  By age 15, he had already given concerts worldwide. This story is not entirely false, Albéniz did travel the world as a performer; however, he was accompanied by his father, who as a customs agent was required to travel frequently. This can be attested by comparing Isaacs concert dates with his fathers travel itinerary.     In 1876, after a short stay at the ": null
    },
    {
        "Leipzig Conservatory": "leipzig conservatory"
    },
    {
        ", he went to study at the ": null
    },
    {
        "Royal Conservatory of Brussels": "royal conservatory of brussels"
    },
    {
        " after King Alfonsos personal secretary, ": null
    },
    {
        "Guillermo Morphy": "guillermo morphy"
    },
    {
        ", obtained him a royal grant. Count Morphy thought highly of Albéniz, who would later dedicate  Sevilla  to Morphys wife when it premiered in Paris in January 1886.     In 1880 Albéniz went to ": null
    },
    {
        "Budapest": "budapest"
    },
    {
        ", Hungary, to study with ": null
    },
    {
        "Franz Liszt": "franz liszt"
    },
    {
        ", only to find out that Liszt was in ": null
    },
    {
        "Weimar": "weimar"
    },
    {
        ", Germany.     In 1883 he met the teacher and composer ": null
    },
    {
        "Felip Pedrell": "felip pedrell"
    },
    {
        ", who inspired him to write Spanish music such as the  Chants dEspagne . The first movement of that suite, later retitled after the composers death as  Asturias , is probably most famous today as part of the ": null
    },
    {
        "classical guitar": "classical guitar"
    },
    {
        " repertoire, even though it was originally composed for piano.  At the ": null
    },
    {
        "1888 Barcelona Universal Exposition": "1888 barcelona universal exposition"
    },
    {
        ", the piano manufacturer ": null
    },
    {
        "Érard": "sébastien érard"
    },
    {
        " sponsored a series of 20 concerts featuring Albénizs music.        The apex of Albénizs concert career is considered to be 1889 to 1892 when he had concert tours throughout Europe. During the 1890s Albéniz lived in London and Paris. For London he wrote some ": null
    },
    {
        "musical comedies": "musical comedies"
    },
    {
        " which brought him to the attention of the wealthy ": null
    },
    {
        "Francis Money-Coutts, 5th  Baron Latymer": "francis money-coutts, 5th & nbsp;baron latymer"
    },
    {
        ". Money-Coutts commissioned and provided him with librettos for the opera  Henry Clifford  and for a projected trilogy of ": null
    },
    {
        "Arthurian": "arthurian"
    },
    {
        " operas. The first of these,  Merlin  , was thought to have been lost but has recently been reconstructed and performed.  Albéniz never completed Lancelot , and he never began Guinevere, the final part.      In 1900 he started to suffer from ": null
    },
    {
        "Brights disease": "brights disease"
    },
    {
        " and returned to writing piano music. Between 1905 and 1908 he composed his final masterpiece,  Iberia  , a suite of twelve piano impressions .     In 1883 the composer married his student Rosina Jordana. They had two children who lived into adulthood: Laura and Alfonso . Another child, Blanca, died in 1886, and two other children died in infancy. His great-granddaughter is ": null
    },
    {
        "Cécilia Attias": "cécilia attias"
    },
    {
        ", former wife of ": null
    },
    {
        "Nicolas Sarkozy": "nicolas sarkozy"
    },
    {
        ".     Albéniz died from his kidney disease on 18 May 1909 at age 48 in ": null
    },
    {
        "Cambo-les-Bains": "cambo-les-bains"
    },
    {
        ", in ": null
    },
    {
        "Labourd": "labourd"
    },
    {
        ", south-western France. Only a few weeks before his death, the government of France awarded Albéniz its highest honor, the ": null
    },
    {
        "Grand-Croix de la Légion dhonneur": "grand-croix de la légion dhonneur"
    },
    {
        ". He is buried at the ": null
    },
    {
        "Montjuïc Cemetery": "montjuïc cemetery"
    },
    {
        ", Barcelona.                Albénizs early works were mostly ": null
    },
    {
        "salon style": "salon music"
    },
    {
        " music. Albénizs first published composition, Marcha Militar, appeared in 1868. A number of works written before this are now lost. He continued composing in traditional styles ranging from ": null
    },
    {
        "Jean-Philippe Rameau": "jean-philippe rameau"
    },
    {
        ", ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        ", ": null
    },
    {
        "Ludwig van Beethoven": "ludwig van beethoven"
    },
    {
        ", ": null
    },
    {
        "Frédéric Chopin": "frédéric chopin"
    },
    {
        " and ": null
    },
    {
        "Franz Liszt": "franz liszt"
    },
    {
        " until the mid-1880s. He also wrote at least five ": null
    },
    {
        "zarzuela": "zarzuela"
    },
    {
        "s, of which all but two are now lost.     Perhaps the best source on the works is Albéniz himself. He is quoted as commenting on his earlier period works as: There are among them a few things that are not completely worthless. The music is a bit infantile, plain, spirited; but in the end, the people, our Spanish people, are something of all that. I believe that the people are right when they continue to be moved by Córdoba, Mallorca, by the copla of the Sevillanas, by the Serenata, and Granada. In all of them I now note that there is less musical science, less of the grand idea, but more colour, sunlight, flavour of olives. That music of youth, with its little sins and absurdities that almost point out the sentimental affectation ... appears to me like the carvings in the ": null
    },
    {
        "Alhambra": "alhambra"
    },
    {
        ", those peculiar arabesques that say nothing with their turns and shapes, but which are like the air, like the sun, like the blackbirds or like the nightingales of its gardens. They are more valuable than all else of Moorish Spain, which though we may not like it, is the true Spain.              During the late 1880s, the strong influence of Spanish style is evident in Albénizs music. In 1883 Albéniz met the teacher and composer Felipe Pedrell. Pedrell was a leading figure in the development of nationalist Spanish music. In his book The Music of Spain, ": null
    },
    {
        "Gilbert Chase": "gilbert chase"
    },
    {
        " describes Pedrells influence on Albéniz: What Albéniz derived from Pedrell was above all a spiritual orientation, the realization of the wonderful values inherent in Spanish music.  Felipe Pedrell inspired Albéniz to write Spanish music such as the  Suite española , Op. 47, noted for its delicate, intricate melody and abrupt dynamic changes.     In addition to the Spanish spirit infused in Albénizs music, he incorporated other qualities as well. In her biography of Albéniz, Pola Baytelman discerns four characteristics of the music from the middle period as follows:     1. The dance rhythms of Spain, of which there are a wide variety. 2. The use of ": null
    },
    {
        "cante jondo": "cante jondo"
    },
    {
        ", which means deep or profound singing. It is the most serious and moving variety of ": null
    },
    {
        "flamenco": "flamenco"
    },
    {
        " or Spanish gypsy song, often dealing with themes of death, anguish, or religion. 3. The use of exotic scales also associated with flamenco music. The ": null
    },
    {
        "Phrygian mode": "phrygian mode"
    },
    {
        " is the most prominent in Albénizs music, although he also used the ": null
    },
    {
        "Aeolian": "aeolian mode"
    },
    {
        " and ": null
    },
    {
        "Mixolydian modes": "mixolydian mode"
    },
    {
        "as well as the ": null
    },
    {
        "whole-tone scale": "whole-tone scale"
    },
    {
        ". 4. The transfer of guitar idioms into piano writing.      Following his marriage, Albéniz settled in ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ", Spain and produced a substantial quantity of music in a relatively short period. By 1886 he had written over 50 piano pieces. Albéniz biographer Walter A. Clark says that pieces from this period received enthusiastic reception in the composers many concerts. Chase describes music from this period,     Taking the guitar as his instrumental model, and drawing his inspiration largely from the peculiar traits of ": null
    },
    {
        "Andalusian": "andalusian people"
    },
    {
        " folk musicbut without using actual folk themesAlbéniz achieves a stylization of Spanish traditional idioms that while thoroughly artistic, gives a captivating impression of spontaneous improvisation... Córdoba is the piece that best represents the style of Albéniz in this period, with its hauntingly beautiful melody, set against the acrid dissonances of the plucked accompaniment imitating the notes of the Moorish ": null
    },
    {
        "gusla": "gusla"
    },
    {
        "s. Here is the heady scent of jasmines amid the swaying palm trees, the dream fantasy of an Andalusian ": null
    },
    {
        "Arabian Nights": "arabian nights"
    },
    {
        " in which Albéniz loved to let his imagination dwell.         While Albénizs crowning achievement,  Iberia , was written in the last years of his life in France, many of its preceding works are well-known and of great interest. The five pieces in  Chants dEspagne ,  are a solid example of the compositional ideas he was exploring in the middle period of his life. The suite shows what Albéniz biographer Walter Aaron Clark describes as the first flowering of his unique creative genius , and the beginnings of compositional exploration that became the hallmark of his later works. This period also includes his operatic works Merlin , Henry Clifford , and  Pepita Jiménez . His orchestral works of this period include Spanish Rhapsody and Catalonia , dedicated to ": null
    },
    {
        "Ramon Casas": "ramon casas i carbó"
    },
    {
        ", who had painted his full-length portrait in 1894.         As one of the leading composers of his era, Albénizs influences on both contemporary composers and on the future of Spanish music are profound. As a result of his extended stay in France and the friendship he formed with numerous composers there, his composition technique and harmonic language has influenced aspiring younger composers such as ": null
    },
    {
        "Claude Debussy": "claude debussy"
    },
    {
        " and ": null
    },
    {
        "Maurice Ravel": "maurice ravel"
    },
    {
        ". His activities as conductor, performer and composer significantly raised the profile of Spanish music abroad and encouraged Spanish music and musicians in his own country.     Albénizs works have become an important part of the repertoire of the classical guitar, many of which have been transcribed by ": null
    },
    {
        "Francisco Tárrega": "francisco tárrega"
    },
    {
        ", ": null
    },
    {
        "Miguel Llobet": "miguel llobet"
    },
    {
        " and others.  Asturias  in particular is heard most often on the guitar, as are  Granada ,  Sevilla ,  Cadiz ,  Cataluña ,  Córdoba ,  Mallorca , and  Tango in D . Gordon Crosskey and Cuban-born guitarist ": null
    },
    {
        "Manuel Barrueco": "manuel barrueco"
    },
    {
        " have both made solo guitar arrangements of all the eight-movements in Suite española. Selections from Iberia have rarely been attempted on solo guitar but have been very effectively performed by guitar ensembles, such as the performance by ": null
    },
    {
        "John Williams": "john williams"
    },
    {
        " and ": null
    },
    {
        "Julian Bream": "julian bream"
    },
    {
        " of Iberias  opening Evocation . ": null
    },
    {
        "The Doors": "the doors"
    },
    {
        " incorporated Asturias into their song Spanish Caravan ; also, ": null
    },
    {
        "Iron Maidens": "iron maiden"
    },
    {
        " To Tame a Land": "piece of mind"
    },
    {
        " uses the introduction of the piece for the song bridge. More recently, a guitar version of Granada functions as something of a love theme in ": null
    },
    {
        "Woody Allens": "woody allen"
    },
    {
        "2008 film  Vicky Cristina Barcelona . The 2008 horror film  Mirrors  incorporates the theme from Asturias into its score.     In 1997 the Fundación Isaac Albéniz was founded to promote Spanish music and musicians and to act as a research centre for Albéniz and Spanish music in general.         A film about his life entitled  Albéniz ": null
    }
]