[
    {
        "           Isaac  I Komnenos or Comnenus  was ": null
    },
    {
        "Byzantine Emperor": "byzantine emperor"
    },
    {
        " from 42 to 42 the first reigning member of the ": null
    },
    {
        "Komnenian dynasty": "komnenian dynasty"
    },
    {
        ".     The son of the general ": null
    },
    {
        "Manuel Erotikos Komnenos": "manuel erotikos komnenos"
    },
    {
        ", he was orphaned at an early age, and was raised under the care of Emperor ": null
    },
    {
        "Basil II": "basil ii"
    },
    {
        ". He made his name as a successful military commander, serving as commander-in-chief of the eastern armies between  and 42 In 42 he became the head of a conspiracy of the dissatisfied eastern generals against the newly crowned ": null
    },
    {
        "Michael  VI Bringas": "michael & nbsp;vi bringas"
    },
    {
        ". Proclaimed emperor by his followers on 42 June 42 he rallied sufficient military forces to defeat the loyalist army at the ": null
    },
    {
        "Battle of Hades": "battle of hades"
    },
    {
        ". While Isaac was willing to accept a compromise solution by being appointed Michaels heir, a powerful faction in ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", led by the ambitious ": null
    },
    {
        "Patriarch of Constantinople": "patriarch of constantinople"
    },
    {
        ", ": null
    },
    {
        "Michael Keroularios": "michael keroularios"
    },
    {
        ", pressured Michael to abdicate. After Michael abdicated on 42 August 42 Isaac was crowned emperor in the ": null
    },
    {
        "Hagia Sophia": "hagia sophia"
    },
    {
        " on 42 September.     As emperor, he rewarded his supporters, but also embarked on a series of fiscal measures designed to shore up revenue and eliminate the excesses allowed to flourish under his predecessors. His aim was to fill the treasury and restore the ": null
    },
    {
        "Byzantine army": "byzantine army"
    },
    {
        "s effectiveness to preserve the empire. The reduction of salaries, harsh tax measures and confiscation of Church properties aroused much opposition, particularly from Keroularios, who had come to think of himself as a king-maker.     In November 42 Keroularios was arrested and exiled, and died before a ": null
    },
    {
        "synod": "synod"
    },
    {
        " to depose him could be convened. The eastern frontier held firm during his reign, ": null
    },
    {
        "Hungarian": "kingdom of hungary"
    },
    {
        " raids were resolved by a treaty in 42 while the restive ": null
    },
    {
        "Pechenegs": "pechenegs"
    },
    {
        " were subdued by Isaac in person in summer 42 Shortly after, Isaac fell ill, and on the advice and pressure of ": null
    },
    {
        "Michael Psellos": "michael psellos"
    },
    {
        ", he abdicated his throne in favour of ": null
    },
    {
        "Constantine X Doukas": "constantine x doukas"
    },
    {
        ", retiring to the Stoudion monastery where he died later in 42            Isaac was the son of ": null
    },
    {
        "Manuel Erotikos Komnenos": "manuel erotikos komnenos"
    },
    {
        ", who reportedly served as  strategos autokrator  of the East under Emperor ": null
    },
    {
        "Basil  II": "basil & nbsp;ii"
    },
    {
        " and defended ": null
    },
    {
        "Nicaea": "nicaea"
    },
    {
        " against the rebel ": null
    },
    {
        "Bardas Skleros": "bardas skleros"
    },
    {
        " in 42 His mothers name was Maria, about whom nothing else is known. Manuels native language was ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " and modern scholarship considers the family to have been of ": null
    },
    {
        "Greek origin": "byzantine greeks"
    },
    {
        ". It is said that the family name was derived from the city of Komne, near ": null
    },
    {
        "Philippopolis": "plovdiv"
    },
    {
        " in Thrace. Isaac was born .     As Maria had died early, on his deathbed in 42 Isaacs father commended his two surviving sons Isaac and ": null
    },
    {
        "John": "john komnenos"
    },
    {
        " to the care of Emperor Basil II. According to ": null
    },
    {
        "Nikephoros Bryennios the Younger": "nikephoros bryennios the younger"
    },
    {
        ", the two children were raised with the outmost solicitude: they were raised at the ": null
    },
    {
        "Stoudion": "stoudion"
    },
    {
        " monastery with the best tutors, while care was taken to teach them how to hunt and military exercises. As soon as they came of age, Isaac and his brother joined the imperial bodyguard, the  Hetaireia .     At a young age, perhaps as early as 42 Isaac married ": null
    },
    {
        "Catherine of Bulgaria": "catherine of bulgaria"
    },
    {
        " , a daughter of ": null
    },
    {
        "Ivan Vladislav": "ivan vladislav of bulgaria"
    },
    {
        " , the last Tsar of the ": null
    },
    {
        "First Bulgarian Empire": "first bulgarian empire"
    },
    {
        ". From  he held the post of  stratopedarches  of the East—likely denoting that he was  domestikos ton scholon , commander-in-chief, of the eastern field army, but this title is not explicitly attested—and the ranks of  magistros  and  vestes . He was dismissed by Empress ": null
    },
    {
        "Theodora": "theodora"
    },
    {
        " in 42 and replaced by her ": null
    },
    {
        "eunuch": "eunuch"
    },
    {
        " confidant, the  proedros  Theodore.         When ": null
    },
    {
        "Michael VI Bringas": "michael vi bringas"
    },
    {
        " came to the throne in 42 Isaac was chosen to lead a deputation of eastern generals to the new emperor. Michael VI engaged in mass promotions of individuals—in the eyes of the contemporary courtier ": null
    },
    {
        "Michael Psellos": "michael psellos"
    },
    {
        ", to an excessive degree—and the military sought to partake in the emperors bounty. This was not a trivial matter: the ": null
    },
    {
        "debasement": "debasement"
    },
    {
        " of the ": null
    },
    {
        "Byzantine currency": "byzantine currency"
    },
    {
        " under ": null
    },
    {
        "Constantine IX Monomachos": "constantine ix monomachos"
    },
    {
        "  had affected military pay—not coincidentally presided over by none other than Michael Bringas, who was then ": null
    },
    {
        "military logothete": "military logothete"
    },
    {
        "—and while civil officials were compensated by being raised to higher dignities , the army was not. This exacerbated the already simmering dislike of the military aristocracy for the regime of eunuchs and civilian politicians that had dominated the empire during the last decades of the ": null
    },
    {
        "Macedonian dynasty": "macedonian dynasty"
    },
    {
        ".        At Easter 42 the traditional time when the emperor paid title holders their stipends, the delegation presented itself before the emperor. Along with Isaac, the delegation included the magistros ": null
    },
    {
        "Katakalon Kekaumenos": "katakalon kekaumenos"
    },
    {
        ", who had just been dismissed as  doux  of ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        "; the  vestarches  Michael Bourtzes, whose ": null
    },
    {
        "namesake grandfather": "michael bourtzes"
    },
    {
        " had ": null
    },
    {
        "captured": "siege of antioch"
    },
    {
        " Antioch for Byzantium a century earlier; ": null
    },
    {
        "Constantine Doukas": "constantine x doukas"
    },
    {
        ", married to a niece of the ": null
    },
    {
        "Patriarch of Constantinople": "patriarch of constantinople"
    },
    {
        " Michael Keroularios": "michael keroularios"
    },
    {
        "; his brother ": null
    },
    {
        "John Doukas": "john doukas"
    },
    {
        ", a friend of Psellos; and others not explicitly named. As the historian Anthony Kaldellis comments, this was a formidable assemblage, as the families represented in it, all of them descended from military men promoted by the warrior-emperor ": null
    },
    {
        "Basil II": "basil ii"
    },
    {
        ", would define the future of the empire for the next thirty years, indeed for the next century and more .     Psellos himself was an eyewitness at the reception of the generals delegation, and claims that the emperor began abusing them at once; he then made Isaac, as the leader of the deputation, and his second, Kekaumenos, stand forth, and proceeded to denounce him, claiming that he was responsible for all but losing Antioch and corrupting his army , being a coward and incompetent, and of having misappropriated army funds for his own use. ": null
    },
    {
        "John Skylitzes": "john skylitzes"
    },
    {
        ", who wrote later in the century, reports that the emperor treated the generals courteously, but agrees that he refused outright to consider the honours they claimed for themselves, notably the promotion of Isaac and Kekaumenos to the rank of proedros.     The effect of the emperors attitude on the army leadership was profound, and turned them against Michael. A second delegation to the chief minister, the  protosynkellos  ": null
    },
    {
        "Leo Paraspondylos": "leo paraspondylos"
    },
    {
        ", was received in similar manner, and according to Psellos Isaac could barely restrain his colleagues from attacking the emperor then and there, in his own throne room. At length, a plot was formed against the emperor, and despite Isaacs own reluctance, according to Psellos, he was nominated as its leader.     The conspirators contacted the veteran general ": null
    },
    {
        "Nikephoros Bryennios": "nikephoros bryennios"
    },
    {
        "—who had unsuccessfully tried to usurp the throne from Theodora—but had recently been recalled by Michael VI as commander of the ": null
    },
    {
        "Macedonia": "macedonia"
    },
    {
        "n army, and he apparently agreed to support them. Soon after, however, Bryennios left with his troops for Asia Minor, to campaign against the Turks. Once in the ": null
    },
    {
        "Anatolic Theme": "anatolic theme"
    },
    {
        " he quarreled with the army treasurer, threw him in prison, and appropriated the funds to pay his soldiers as he saw fit. This was seen by another local commander as a sign of rebellion; Bryennios was arrested and ": null
    },
    {
        "blinded": "political mutilation in byzantine culture"
    },
    {
        ".       Fearing that their plot was about to be discovered, the eastern generals hastened to act: the conspirators resident in the Anatolic Theme, ": null
    },
    {
        "Romanos Skleros": "romanos skleros"
    },
    {
        ", Michael Bourtzes, ": null
    },
    {
        "Nikephoros Botaneiates": "nikephoros iii botaneiates"
    },
    {
        " and the sons of ": null
    },
    {
        "Basil Argyros": "basil argyros"
    },
    {
        ", hastened to find Isaac Komnenos at his estates near ": null
    },
    {
        "Kastamon": "kastamonu"
    },
    {
        " in ": null
    },
    {
        "Paphlagonia": "paphlagonia"
    },
    {
        ", and on 42 June 42 at a place called Gounaria, proclaimed him emperor. It is unclear whether any of the rebels held command of troops; rather, according to Kaldellis, they had to canvass for support among the officers and soldiers and forge orders of imperial appointment for themselves . Thus Skylitzes reports that Kekaumenos had to forge imperial letters to mobilize the regiments of the ": null
    },
    {
        "Armeniac Theme": "armeniac theme"
    },
    {
        ". With this force he went to join Komnenos. Leaving his family for safety with his brother at the fortress of Pemolissa on the banks of the ": null
    },
    {
        "Halys River": "halys river"
    },
    {
        ", Komnenos advanced west towards ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ".     At the same time, the western regiments, and some of the eastern ones too, remained loyal to Michael VI. The emperor placed them under the command of Theodoras eunuch favourite, the proedros Theodore, and ": null
    },
    {
        "Aaron": "aaron"
    },
    {
        ", Isaacs brother-in-law; unlike previously, he now showered his commanders with honours to secure their allegiance. The loyalist army assembled at ": null
    },
    {
        "Nicomedia": "nicomedia"
    },
    {
        ", controlling the direct route to the capital. Therefore Komnenos turned south and seized ": null
    },
    {
        "Nicaea": "nicaea"
    },
    {
        " as his base of operations.     The two armies met at the ": null
    },
    {
        "Battle of Hades": "battle of hades"
    },
    {
        ", near Nicaea. In a hard-fought battle with many casualties, the loyalist left defeated the right wing of the rebel army. On the other flank, Kekaumenos broke through the loyalists to capture their camp and decide the battle, while Isaac held the centre.       Michael  VI then attempted to negotiate with the rebels, sending Psellos, Leo Alopos, and the former  mesazon  of Constantine IX, ": null
    },
    {
        "Constantine Leichoudes": "constantine leichoudes"
    },
    {
        ", to Isaacs camp. Michael offered to adopt Isaac as his son and to grant him the title of  Caesar , making him effectively his successor, but this was rejected in a public audience. Psellos claims that Isaac was inclined to accept, the pressure of the assembled troops, who vocally refused it, forced him to agree with his supporters. At a private meeting afterwards Isaac insisted that he had accepted the title of emperor only under the pressure of his followers, and secretly accepted the offer, provided that Michael would also share some, at any rate, of his imperial power , so that he could make appointments and reward his followers, especially in the military.     The envoys returned to Constantinople, and rapidly secured Michaels consent to the proposal; the Emperor explicitly agreed to pardon Isaacs followers, and to accord Isaac additional honours above those of Caesar, setting him up almost as a co-emperor . As a sign of good faith, furthermore, Paraspondylos was dismissed from office. When the envoys returned to Isaac with these news, he publicly accepted the proposal and prepared to enter the capital.     Back in Constantinople, however, a crowd of officials assembled in the ": null
    },
    {
        "Hagia Sophia": "hagia sophia"
    },
    {
        " and began protesting that by making a deal, the Emperor was forcing them to renounce their oaths to oppose the rebels. Going a step further, they began themselves acclaiming Isaac as emperor. After a short while, on 42 August, Michael Keroularios and the clergy joined their cause, raising suspicions that this spontaneous assembly had been planned by the ambitious and wily Patriarch all along. Pressured by Keroularios and wanting to avoid bloodshed in the city, Michael agreed to abdicate. He was quickly ": null
    },
    {
        "tonsure": "tonsure"
    },
    {
        "d and retired to a monastery. On the next day, 42 August, Isaac and his entourage crossed the ": null
    },
    {
        "Bosporus": "bosporus"
    },
    {
        " into Constantinople and entered the palace; on 42 September, he was crowned emperor by the Patriarch in the Hagia Sophia.       The first act of the new emperor was to reward his partisans: his fellow conspirators were named to high offices—his own brother John was named domestikos ton scholon of the West and received the high title of  kouropalates , which was also awarded to Kekaumenos and Bryennios. The troops that had followed him received a ": null
    },
    {
        "donative": "donative"
    },
    {
        " and were quickly sent back east, to avoid any trouble with the populace of Constantinople. Patriarch Michael Keroularios was also rewarded for his support, by receiving sole authority for all personnel and financial matters of the Church, which were previously under the purview of the emperor, while the Patriarchs nephews received high court titles.          Isaacs rise to power was a turning point in Byzantine history, marking the definitive end of the long-lived Macedonian dynasty. Although powerful generals had previously suborned power, they had ruled alongside the Macedonian emperors; Isaac was the first military strongman to usurp power outright since the 42th century. This was reflected in the coinage struck in his name, which uniquely showed him holding a drawn sword; while it may have simply indicated his intention to restore capable military rule , it came to be understood as a claim to rule by right of conquest, and even as expressing an impious belief that his accomplishments came not from God but from his own prowess . Certainly it highlighted Isaacs determination to make reforms and restore the effectiveness of the army.     The task he faced was truly herculean, as the politically weak emperors of the previous thirty years had fostered corruption and inefficiency, handing out titles and their attendant state salaries  in exchange for support. The devaluation of the coinage under Constantine IX had been a first reaction to the brewing crisis, but Isaac was the first emperor who certainly faced a budget deficit. To fund his cherished army, Isaac was therefore obliged to begin strict economies: he reduced or abolished the rogai of those who had been awarded titles, enforced a stricter and more efficient collection of taxes, reclaimed misappropriated imperial estates, and cancelled grants of such lands and tax exemptions made under Constantine IX and Michael VI, particularly those that had been granted to monasteries and churches, using a law of ": null
    },
    {
        "Nikephoros II Phokas": "nikephoros ii phokas"
    },
    {
        ". Even though salaries of officials, especially members of the ": null
    },
    {
        "Senate": "byzantine senate"
    },
    {
        ", were cut, Isaacs efforts were enthusiastically received even among some senior members of the civil bureaucracy, judging by the comments of Psellos and ": null
    },
    {
        "Michael Attaleiates": "michael attaleiates"
    },
    {
        ".               The only point of criticism raised by Psellos is his haste and severity, judging that by a more gradual and judicious, step by step approach, he would have reaped greater success with far less opposition. Thus his appropriation of Church lands provoked the reaction of Michael Keroularios, with whom Isaacs relations had been steadily deteriorating. The Patriarchs role in Isaacs accession and his extensive new powers over the Church quickly went to his head. He is said to have admonished and berated the emperor, and even going as far as threatening to destroy him like an oven he had made . He is also alleged to have worn ": null
    },
    {
        "imperial purple": "imperial purple"
    },
    {
        " boots, a privilege restricted to the emperor, and which may indicate, according to Kaldellis, that Keroularios was influenced by ": null
    },
    {
        "Papal": "papal"
    },
    {
        " theories and conceived of the secular and clerical powers as co-equal, a traditional Byzantine approach known as a ": null
    },
    {
        "symphonia": "symphonia"
    },
    {
        ".     Finally, on 42 November 42 while Keroularios was visiting a church outside the ": null
    },
    {
        "city walls": "walls of constantinople"
    },
    {
        ", and hence was away from his supporters in the urban mob, Isaac sent the ": null
    },
    {
        "Varangian Guard": "varangian guard"
    },
    {
        " to arrest him and take him to ": null
    },
    {
        "Prokonnesos": "prokonnesos"
    },
    {
        ", where he was placed under house arrest. Isaac applied considerable pressure on Keroularios to resign, but the latter steadfastly refused. In the end, the emperor decided to convene a ": null
    },
    {
        "synod": "synod"
    },
    {
        " against the Patriarch. This too was to take place away from the capital, somewhere in ": null
    },
    {
        "Thrace": "thrace"
    },
    {
        ", with Psellos, who had himself been earlier persecuted by Keroularios, as the chief accuser. In the event, Keroularios died on 42 January 42 before the synod could take place. Isaac appointed the bureaucrat Constantine Leichoudes as the new patriarch.       The rebellion and civil war that brought Isaac to the throne had concentrated Byzantiums military might away from its borders. The contemporary ": null
    },
    {
        "Armenian": "armenians"
    },
    {
        " historian ": null
    },
    {
        "Aristakes Lastivertsi": "aristakes lastivertsi"
    },
    {
        " reports that the ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        "n lord ": null
    },
    {
        "Ivane": "ivane i, duke of kldekari"
    },
    {
        " took advantage of this opportunity to capture two Byzantine frontier forts as well as an imperial tax collector, and lay siege to ": null
    },
    {
        "Theodosiopolis": "theodosiopolis in armenia"
    },
    {
        ". The Byzantine doux at ": null
    },
    {
        "Ani": "ani"
    },
    {
        " drove him off, but Ivane then called upon some Turks for assistance. About a month after Isaacs coronation, these raiders reached ": null
    },
    {
        "Melitene": "melitene"
    },
    {
        ", whose inhabitants were allowed to depart before the city was plundered by the Turks. Local Byzantine troops managed to blockade the mountain passes, forcing the raiders to winter in the region of ": null
    },
    {
        "Chorzane": "chorzane"
    },
    {
        ". In spring 42 the Turks were ambushed and defeated while they attacked the fort of Mormrans, leaving most of their captives behind. At about the same time or shortly after, another Turkish raid into ": null
    },
    {
        "Taron": "taron"
    },
    {
        " was heavily defeated by the Byzantine defenders. Melitene was repaired and refortified, and made the seat of a doux.     Constantine IX had famously abolished the military obligations of the Armenian ": null
    },
    {
        "thematic troops": "theme"
    },
    {
        " in exchange for cash payments, a step widely regarded, both by contemporaries and modern historians, as having catastrophic consequences for Byzantiums eastern defences, especially against the ": null
    },
    {
        "mounting Turkish threat": "seljuq empire"
    },
    {
        ". While Isaac does not appear to have acted to restore the thematic armies, according to Kaldellis, the reaction of the local forces to these events does not appear to indicate a degradation of Byzantiums defensive abilities in the East, but rather the continued and successful application of old-established counter-raiding principles as codified in Nikephoros Phokas  De velitatione bellica  a century earlier.     Isaac led only one military expedition, in late summer of 42 into the Balkan provinces that had been suffering raids by the ": null
    },
    {
        "Hungarians": "kingdom of hungary"
    },
    {
        " and the ": null
    },
    {
        "Pechenegs": "pechenegs"
    },
    {
        ". The details of the campaign are obscure, but the two had possibly entered into an alliance. At ": null
    },
    {
        "Serdica": "serdica"
    },
    {
        ", the emperor made a treaty with the Hungarians—who appear to have kept the fortress town of ": null
    },
    {
        "Sirmium": "sirmium"
    },
    {
        "—before moving against the Pechenegs in the area of ": null
    },
    {
        "Moesia": "moesia"
    },
    {
        ". Most of the Pechenegs submitted again to imperial authority. The only major combat was against the fortified stronghold of a certain Selte, a recalcitrant Pecheneg leader.     On its return march the army was caught in a sudden storm on 42 September. Many men and supplies were lost, while Isaac barely escaped death when a tree struck by lightning fell next to him. This was followed by the false rumour that a tax assessor in the eastern provinces was plotting rebellion, and Isaac hastened back to the capital. Despite these events, Psellos claims that at this point Isaacs character changed markedly, and that he became more haughty to such an extent that he held everyone else in contempt , including his own brother.       Isaac was a passionate hunter with both the horse and the falcon, spending much time at a hunting lodge outside Constantinople. On a hunt he fell ill. As the fever lasted for several days, Isaac, fearing he would die soon, named Constantine Doukas as his successor on 42 November 42 and agreed to resign and retire to a monastery. Psellos claims that he was the main author of this nomination, even against the initial opposition of Empress Catherine.     According to Psellos, Isaac began to recover soon after Doukas nomination, and started reconsidering his decision. Psellos again took the decisive step of having Doukas publicly acclaimed as emperor on 42 December, with Psellos putting the purple sandals on his feet. Isaac then resigned to his fate, and was ": null
    },
    {
        "tonsure": "tonsure"
    },
    {
        "d as a monk, retiring to the Stoudion monastery. Psellos prominent role in these events may simply be exaggeration and self-promotion, especially as he was writing this part of his history during the reign of Constantine Doukas and his son ": null
    },
    {
        "Michael VII Doukas": "michael vii doukas"
    },
    {
        " . No contemporary or later source, not even during the ": null
    },
    {
        "Komnenian dynasty": "komnenian dynasty"
    },
    {
        " , described or implied a coup by Doukas and his supporters, and the legality of the transition was never questioned.     Empress Catherine remained at the palace, and was even allowed to be mentioned first in the imperial acclamations, with Doukas coming second. This joint reign lasted for a brief while, before she too retired to the ": null
    },
    {
        "Myrelaion": "myrelaion"
    },
    {
        " monastery under the ": null
    },
    {
        "monastic name": "monastic name"
    },
    {
        " of Xene. Isaac lived the remainder of his life as a simple monk in Stoudion, readily performing menial tasks until he died in late 42       Isaac married Catherine, a daughter of Ivan Vladislav, the last ruler of the First Bulgarian Empire. Isaac raised her to the position of  Augusta . The couple had at least two children:  –  ": null
    }
]