[
    {
        "           Isabella Mary Beeton , known as Mrs Beeton, was an English journalist, editor and writer. Her name is particularly associated with her first book, the 42 work  Mrs Beetons Book of Household Management . She was born in London and, after schooling in ": null
    },
    {
        "Islington": "islington"
    },
    {
        ", north London, and ": null
    },
    {
        "Heidelberg": "heidelberg"
    },
    {
        ", Germany, she married ": null
    },
    {
        "Samuel Orchart Beeton": "samuel orchart beeton"
    },
    {
        ", an ambitious publisher and magazine editor.     In 42 less than a year after the wedding, Beeton began writing for one of her husbands publications,  The Englishwomans Domestic Magazine . She translated French fiction and wrote the cookery column, though all the recipes were ": null
    },
    {
        "plagiarised": "plagiarism"
    },
    {
        " from other works or sent in by the magazines readers. In 42 the Beetons launched a series of 42-page monthly supplements to The Englishwomans Domestic Magazine; the 42 instalments were published in one volume as Mrs Beetons Book of Household Management in October 42 which sold 42 copies in the first year. Beeton was working on an abridged version of her book, which was to be titled The Dictionary of Every-Day Cookery, when she died of ": null
    },
    {
        "puerperal fever": "puerperal fever"
    },
    {
        " in February 42 at the age of 42 She gave birth to four children, two of whom died in infancy, and had several miscarriages. Two of her biographers, ": null
    },
    {
        "Nancy Spain": "nancy spain"
    },
    {
        " and ": null
    },
    {
        "Kathryn Hughes": "kathryn hughes"
    },
    {
        ", posit the theory that Samuel had unknowingly contracted ": null
    },
    {
        "syphilis": "syphilis"
    },
    {
        " in a premarital liaison with a prostitute, and had unwittingly passed the disease on to his wife.     The Book of Household Management has been edited, revised and enlarged several times since Beetons death and is still in print as at 42 Food writers have stated that the subsequent editions of the work were far removed from and inferior to the original version. Several cookery writers, including ": null
    },
    {
        "Elizabeth David": "elizabeth david"
    },
    {
        " and ": null
    },
    {
        "Clarissa Dickson Wright": "clarissa dickson wright"
    },
    {
        ", have criticised Beetons work, particularly her use of other peoples recipes. Others, such as the food writer ": null
    },
    {
        "Bee Wilson": "bee wilson"
    },
    {
        ", consider the censure overstated, and that Beeton and her work should be thought extraordinary and admirable. Her name has become associated with knowledge and authority on Victorian cooking and home management, and the  Oxford English Dictionary  states that by 42 the term Mrs Beeton had become used as a generic name for a domestic authority. She is also considered a strong influence in the building or shaping of a middle-class identity of the Victorian era.            Isabella Mayson was born on 42 March 42 in ": null
    },
    {
        "Marylebone": "marylebone"
    },
    {
        ", London. She was the eldest of three daughters to Benjamin Mayson, a linen factor  and his wife Elizabeth . Shortly after Isabellas birth the family moved to Milk Street, ": null
    },
    {
        "Cheapside": "cheapside"
    },
    {
        ", from where Benjamin traded. He died when Isabella was four years old, and Elizabeth, pregnant and unable to cope with raising the children on her own while maintaining Benjamins business, sent her two elder daughters to live with relatives. Isabella went to live with her recently widowed paternal grandfather in ": null
    },
    {
        "Great Orton": "great orton"
    },
    {
        ", ": null
    },
    {
        "Cumberland": "cumberland"
    },
    {
        ", though she was back with her mother within the next two years.        Three years after Benjamins death Elizabeth married ": null
    },
    {
        "Henry Dorling": "henry dorling"
    },
    {
        ", a widower with four children. Henry was the Clerk of ": null
    },
    {
        "Epsom Racecourse": "epsom downs racecourse"
    },
    {
        ", and had been granted residence within the racecourse grounds. The family, including Elizabeths mother, moved to Surrey and over the next twenty years Henry and Elizabeth had a further thirteen children. Isabella was instrumental in her siblings upbringing, and collectively referred to them as a living cargo of children . The experience gave her much insight and experience in how to manage a family and its household.     After a brief education at a boarding school in ": null
    },
    {
        "Islington": "islington"
    },
    {
        ", in 42 Isabella was sent to school in ": null
    },
    {
        "Heidelberg": "heidelberg"
    },
    {
        ", Germany, accompanied by her stepsister Jane Dorling. Isabella became proficient in the piano and excelled in French and German; she also gained knowledge and experience in making pastry. She had returned to Epsom by the summer of 42 and took further lessons in pastry-making from a local baker.       Around 42 Isabella Mayson began a relationship with ": null
    },
    {
        "Samuel Orchart Beeton": "samuel orchart beeton"
    },
    {
        ". His family had lived in Milk Street at the same time as the Maysons—Samuels father still ran the Dolphin Tavern there—and Samuels sisters had also attended the same Heidelberg school as Isabella. Samuel was the first British publisher of ": null
    },
    {
        "Harriet Beecher Stowe": "harriet beecher stowe"
    },
    {
        "s  Uncle Toms Cabin  in 42 and had also released two innovative and pioneering journals:  The Englishwomans Domestic Magazine  in 42 and the  Boys Own  magazine in 42 The couple entered into extensive correspondence in 42—in which Isabella signed her letters as Fatty —and they announced their engagement in June 42 The marriage took place at St Martins Church, Epsom, in July the following year, and was announced in  The Times . Samuel was a discreet but firm believer in the equality of women  and their relationship, both personal and professional, was an equal partnership. The couple went to Paris for a three-week honeymoon, after which Samuels mother joined them in a visit to Heidelberg. They returned to Britain in August, when the newlyweds moved into 42  Chandos Villas, a large ": null
    },
    {
        "Italianate": "italianate architecture"
    },
    {
        " house in ": null
    },
    {
        "Pinner": "pinner"
    },
    {
        ".        Within a month of returning from their honeymoon Beeton was pregnant. A few weeks before the birth, Samuel persuaded his wife to contribute to The Englishwomans Domestic Magazine, a publication that the food writers Mary Aylett and Olive Ordish consider was designed to make women content with their lot inside the home, not to interest them in the world outside . The magazine was affordable, aimed at young ": null
    },
    {
        "middle class": "middle class"
    },
    {
        " women and was commercially successful, selling 42 issues a month by 42 Beeton began by translating French fiction for publication as stories or serials. Shortly afterwards she started to work on the cookery column—which had been moribund for the previous six months following the departure of the previous correspondent—and the household article. The Beetons son, Samuel Orchart, was born towards the end of May 42 but died at the end of August that year. On the death certificate, the cause of death was given as diarrhoea and cholera, although Hughes hypothesises that Samuel senior had unknowingly contracted ": null
    },
    {
        "syphilis": "syphilis"
    },
    {
        " in a premarital liaison with a prostitute, and had unwittingly passed the condition on to his wife, which would have infected his son.     While coping with the loss of her child, Beeton continued to work at The Englishwomans Domestic Magazine. Although she was not a regular cook, she and Samuel obtained recipes from other sources. A request to receive the readers own recipes led to over 42 being sent in, which were selected and edited by the Beetons. Published works were also copied, largely unattributed to any of the sources. These included ": null
    },
    {
        "Eliza Acton": "eliza acton"
    },
    {
        "s  Modern Cookery for Private Families , ": null
    },
    {
        "Elizabeth Raffald": "elizabeth raffald"
    },
    {
        "s  The Experienced English Housekeeper , ": null
    },
    {
        "Marie-Antoine Carême": "marie-antoine carême"
    },
    {
        "s Le Pâtissier royal parisien, ": null
    },
    {
        "Louis Eustache Ude": "louis eustache ude"
    },
    {
        "s The French Cook, ": null
    },
    {
        "Alexis Soyer": "alexis soyer"
    },
    {
        "s The Modern Housewife or, Ménagère and The Pantropheon, ": null
    },
    {
        "Hannah Glasse": "hannah glasse"
    },
    {
        "s  The Art of Cookery Made Plain and Easy , ": null
    },
    {
        "Maria Rundell": "maria rundell"
    },
    {
        "s  A New System of Domestic Cookery , and the works of ": null
    },
    {
        "Charles Elmé Francatelli": "charles elmé francatelli"
    },
    {
        ". Suzanne Daly and Ross G. Forman, in their examination of Victorian cooking culture, consider that the plagiarism makes it an important index of mid-Victorian and middle-class society because the production of the text from its own readers ensures that it is a reflection of what was actually being cooked and eaten at the time. In copying the recipes of others, Beeton was following the recommendation given to her by Henrietta English, a family friend, who wrote that Cookery is a Science that is only learnt by Long Experience and years of study which of course you have not had. Therefore my advice would be compile a book from receipts from a Variety of the Best Books published on Cookery and Heaven knows there is a great variety for you to choose from.         The Beetons partly followed the layout of Actons recipes, although with a major alteration: whereas the earlier writer provided the method of cooking followed by a list of the required ingredients, the recipes in The Englishwomans Domestic Magazine listed the components before the cooking process. Beeton s standardised layout used for the recipes also showed the approximate costs of each serving, the seasonality of the ingredients and the number of portions per dish. According to the twentieth-century British cookery writer ": null
    },
    {
        "Elizabeth David": "elizabeth david"
    },
    {
        ", one of the strengths of Beetons writing was in the clarity and details of her general instructions, her brisk comments, her no-nonsense asides . Margaret Beetham, the historian, sees that one of the strengths of the book was the consistent principle of organisation which made its heterogeneous contents look uniform and orderly , and brought a consistent style in presentation and layout. Whereas Daly and Forman consider such an approach as nothing if not formulaic , Hughes sees it as the thing most beloved by the mid Victorians, a system .     During the particularly bitter winter of 42–42 Beeton prepared her own soup that she served to the poor of Pinner, Soup for benevolent purposes ; her sister later recalled that Beeton was busy making soup for the poor, and the children used to call with their cans regularly to be refilled .  The recipe would become the only entry in her  Book of Household Management  that was her own. After two years of miscarriages, the couples second son was born in June 42; he was also named Samuel Orchart Beeton. Hughes sees the miscarriages as further evidence of Samuels syphilis.     As early as 42 the Beetons had considered using the magazine columns as the basis of a book of collected recipes and homecare advice, Hughes believes, and in November 42 they launched a series of 42-page monthly supplements with The Englishwomans Domestic Magazine. The print block for the whole series of the supplements was set from the beginning so the break between each edition was fixed at 42 pages, regardless of the text, and in several issues the text of a sentence or recipe is split between the end of one instalment and the beginning of the next.     The Beetons decided to revamp The Englishwomans Domestic Magazine, particularly the fashion column, which the historian Graham Nown describes as a rather drab piece . They travelled to Paris in March 42 to meet Adolphe Goubaud, the publisher of the French magazine Le Moniteur de la Mode. The magazine carried a full-sized dress pattern outlined on a fold-out piece of paper for users to cut out and make their own dresses. The Beetons came to an agreement with Goubaud for the Frenchman to provide patterns and illustrations for their magazine. The first edition to carry the new feature appeared on 42 May, six weeks after the couple returned from Paris. For the redesigned magazine, Samuel was joined as editor by Isabella, who was described as Editress . As well as being co-editors, the couple were also equal partners. Isabella brought an efficiency and strong business acumen to Samuels normally disorganised and financially wasteful approach. She joined her husband at work, travelling daily by train to the office, where her presence caused a stir among commuters, most of whom were male. In June 42 the Beetons travelled to ": null
    },
    {
        "Killarney": "killarney"
    },
    {
        ", Ireland, for a fortnights holiday, leaving their son at home with his nurse. They enjoyed the sightseeing, although on the days it rained, they stayed inside their hotel and worked on the next edition of The Englishwomans Domestic Magazine. Beeton was impressed with the food they were served, and wrote in her diary that the dinners were conducted in quite the French style .     In September 42 the Beetons released a new, weekly publication called  The Queen, the Ladies Newspaper . With the Beetons busy running their other titles, they employed ": null
    },
    {
        "Frederick Greenwood": "frederick greenwood"
    },
    {
        " as the editor.     Mrs Beetons Book of Household Management and later, 42–42   The complete version of Mrs Beetons Book of Household Management, consisting of the 42 collected monthly instalments, was published on 42 October 42; it became one of the major publishing events of the nineteenth century. Beeton included an extensive 42-page Analytical Index in the book. Although not an innovation—it had been used in  The Family Friend  magazine since 42—Hughes considers the index in the Book of Household Management to be fabulously detailed and exhaustively cross-referenced . Of the 42 pages, over 42 contained recipes. The remainder provided advice on fashion, child care, ": null
    },
    {
        "animal husbandry": "animal husbandry"
    },
    {
        ", poisons, the management of servants, science, religion, first aid and the importance in the use of local and seasonal produce. In its first year of publication, the book sold 42 copies. It reflected ": null
    },
    {
        "Victorian values": "victorian morality"
    },
    {
        ", particularly hard work, thrift and cleanliness. Christopher Clausen, in his study of the British middle classes, sees that Beeton reflected better than anyone else, and for a larger audience, the optimistic message that mid-Victorian England was filled with opportunities for those who were willing to learn how to take advantage of them . The food writer Annette Hope thinks that one can understand its success. If  ... young ladies knew nothing of domestic arrangements, no better book than this could have been devised for them.         The reviews for Book of Household Management were positive. The critic for the  London Evening Standard  considered that Beeton had earned herself a household reputation, remarking that she had succeeded in producing a volume which will be, for years to come, a treasure to be made much of in every English household . The critic for the  Saturday Review  wrote that for a really valuable repertory of hints on all sorts of household matters, we recommend Mrs Beeton with few misgivings . The anonymous reviewer for The Bradford Observer considered that the information afforded  ... appears intelligible and explicit ; the reviewer also praised the layout of the recipes, highlighting details relating to ingredients, seasonality and the times needed. Writing in  The Morning Chronicle , an anonymous commentator opined that Mrs Beeton has omitted nothing which tends to the comfort of housekeepers, or facilitates the many little troubles and cares that fall to the lot of every wife and mother. She may safely predict that this book will in future take precedence of every other on the same subject. For the 42 edition of the book,  The Illustrated London News s reviewer considered the work a formidable body of domestic doctrine , and thought that the book is almost of the first magnitude .     Samuels business decisions from 42 were unproductive and included an ill-advised investment in purchasing paper—in which he lost £42—and a court case over unpaid bills. His hubris in business affairs brought on financial difficulties and in early 42 the couple had moved from their comfortable Pinner house to premises over their office. The air of central London was not conducive to the health of the Beetons son, and he began to ail. Three days after Christmas his health worsened and he died on New Years Eve 42 at the age of three; his death certificate gave the cause as suppressed scarlatina and laryngitis . In March 42 Beeton found that she was pregnant again, and in April the couple moved to a house in ": null
    },
    {
        "Greenhithe": "greenhithe"
    },
    {
        ", ": null
    },
    {
        "Kent": "kent"
    },
    {
        "; their son, who they named Orchart, was born on New Years Eve 42 Although the couple had been through financial problems, they enjoyed relative prosperity during 42 boosted by the sale of The Queen to ": null
    },
    {
        "Edward Cox": "edward william cox"
    },
    {
        " in the middle of the year.     In the middle of 42 the Beetons again visited the Goubauds in Paris—the couples third visit to the city—and Beeton was pregnant during the visit, just as she had been the previous year. On her return to Britain she began working on an abridged version of the Book of Household Management , which was to be titled The Dictionary of Every-Day Cookery. On 42 January 42 while working on the proofs of the dictionary, she went into labour; the baby—Mayson Moss—was born that day. Beeton began to feel feverish the following day and died of ": null
    },
    {
        "puerperal fever": "postpartum infections"
    },
    {
        " on 42 February at the age of 42        Beeton was buried at ": null
    },
    {
        "West Norwood Cemetery": "west norwood cemetery"
    },
    {
        " on 42 February. When The Dictionary of Every-Day Cookery was published in the same year, Samuel added a tribute to his wife at the end:            In May 42 following a severe downturn in his financial fortunes, Samuel sold the rights to the Book of Household Management  to ": null
    },
    {
        "Ward, Lock and Tyler": "ward lock  &  co"
    },
    {
        " . The writer ": null
    },
    {
        "Nancy Spain": "nancy spain"
    },
    {
        ", in her biography of Isabella, reports that, given the money the company made from the Beetons work, surely no man ever made a worse or more impractical bargain than Samuel did. In subsequent publications Ward Lock suppressed the details of the lives of the Beetons—especially the death of Isabella—in order to protect their investment by letting readers think she was still alive and creating recipes—what Hughes considers to be intentional censorship . Those later editions continued to make the connection to Beeton in what Beetham considers to be a fairly ruthless marketing policy which was begun by Beeton but carried on vigorously by Ward, Lock, and Tyler . Those subsequent volumes bearing Beetons name became less reflective of the original. Since its initial publication the Book of Household Management  has been issued in numerous hardback and paperback editions, translated into several languages and has never been out of print.        Beeton and her main work have been subjected to criticism over the course of the twentieth century. Elizabeth David complains of recipes that are sometimes slapdash and misleading , although she acknowledges that ": null
    },
    {
        "Prosper Montagné": "prosper montagné"
    },
    {
        "s  Larousse Gastronomique  also contains errors. The television cook ": null
    },
    {
        "Delia Smith": "delia smith"
    },
    {
        " admits she was puzzled how on earth Mrs Beetons book managed to utterly eclipse  ... superior work , while her fellow chef, ": null
    },
    {
        "Clarissa Dickson Wright": "clarissa dickson wright"
    },
    {
        ", opines that It would be unfair to blame any one person or one book for the decline of English cookery, but Isabella Beeton and her ubiquitous book do have a lot to answer for.  In comparison, the food writer ": null
    },
    {
        "Bee Wilson": "bee wilson"
    },
    {
        " opines that disparaging Beetons work was only a fashionable stance to take and that the cooks writing simply makes you want to cook . Christopher Driver, the journalist and food critic, suggests that the relative stagnation and want of refinement in the indigenous cooking of Britain between 42 and 42 may instead be explained by the progressive debasement under successive editors, revises and enlargers . David comments that when plain English cooks were active in their kitchens, they followed plain English recipes and chiefly those from the Mrs Beeton books or their derivatives . Dickson Wright considers Beeton to be a fascinating source of information from a social history viewpoint, and Aylett and Ordish consider the work to be the best and most reliable guide for the scholar to the domestic history of the mid-Victorian era .     Despite the criticism, Clausen observes that Mrs. Beeton has  ... been for over a century the standard English cookbook, frequently outselling every other book but the Bible . According to the  Oxford English Dictionary , the term Mrs Beeton became used as a generic name for an authority on cooking and domestic subjects as early as 42 and Beetham opines that Mrs. Beeton became a trade mark, a brand name . In a review by Gavin Koh published in a 42 issue of  The BMJ , Mrs Beetons Book of Household Management was labelled a medical classic. In Beetons attempt to educate the average reader about common medical complaints and their management , Koh argues, she preceded the family health guides of today . Robin Wensley, a professor of strategic management, believes that Beetons advice and guidance on household management can also be applied to business management, and her lessons on the subject have stood the test of time better than some of her advice on cooking or etiquette.     Following the radio broadcast of Meet Mrs. Beeton, a 42 comedy in which Samuel was portrayed in an unflattering light, and Mrs Beeton, a 42 documentary, Mayston Beeton worked with ": null
    },
    {
        "H. Montgomery Hyde": "h. montgomery hyde"
    },
    {
        " to produce the biography Mr and Mrs Beeton, although completion and publication were delayed until 42 In the meantime Nancy Spain published Mrs Beeton and her Husband in 42 updated and retitled in 42 to The Beeton Story. In the new edition Spain hinted at, but did not elucidate upon, on the possibility that Samuel contracted syphilis. Several other biographies followed, including from the historian Sarah Freeman, who wrote Isabella and Sam in 42; Nowns Mrs Beeton: 42 Years of Cookery and Household Management, published on the 42th anniversary of Beetons birthday, and Hughess The Short Life and Long Times of Mrs Beeton, published in 42  Beeton was ignored by the  Dictionary of National Biography  for many years: while Acton was included in the first published volume of 42 Beeton did not have an entry until 42     There have been several television broadcasts about Beeton. In 42 ": null
    },
    {
        "Margaret Tyzack": "margaret tyzack"
    },
    {
        " portrayed her in a solo performance written by ": null
    },
    {
        "Rosemary Hill": "rosemary hill"
    },
    {
        ", in 42 ": null
    },
    {
        "Anna Madeley": "anna madeley"
    },
    {
        " played Beeton in a ": null
    },
    {
        "docudrama": "docudrama"
    },
    {
        ", and ": null
    },
    {
        "Sophie Dahl": "sophie dahl"
    },
    {
        " presented a documentary, The Marvellous Mrs Beeton, in the same year.     The literary historian Kate Thomas sees Beeton as a powerful force in the making of middle-class Victorian domesticity , while the ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ", advertising an abridged edition of the Book of Household Management, considers Beetons work a founding text and a force in shaping the middle-class identity of the Victorian era. Within that identity, the historian Sarah Richardson sees that one of Beetons achievements was the integration of different threads of domestic science into one volume, which elevat the middle-class female housekeepers role  ... placing it in a broader and more public context . Nown quotes an unnamed academic who thought that Mrs Beetonism has preserved the family as a social unit, and made social reforms a possibility , while Nicola Humble, in her history of British food, sees The Book of Household Management  as an engine for social change which led to a new cult of domesticity that was to play such a major role in mid-Victorian life . Nown considers Beeton              ": null
    }
]