[
    {
        "   The phrase Islamization of knowledge has been used in ": null
    },
    {
        "contemporary Islamic philosophy": "contemporary islamic philosophy"
    },
    {
        " since the later 42th century to refer to attempts to reconcile ": null
    },
    {
        "Islam and modernity": "islam and modernity"
    },
    {
        ", specifically seeking for a way to adopt the ": null
    },
    {
        "scientific method": "scientific method"
    },
    {
        " in a way consistent with ": null
    },
    {
        "Islamic ethical norms": "islamic ethics"
    },
    {
        ".       The phrase ": null
    },
    {
        "Islamisation": "islamisation"
    },
    {
        " of knowledge was first used and proposed by the ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        "n scholar ": null
    },
    {
        "Syed Muhammad Naquib al-Attas": "syed muhammad naquib al-attas"
    },
    {
        " in his book Islam and Secularism  .     It was also proposed by the ": null
    },
    {
        "Palestinian": "palestinian people"
    },
    {
        " philosopher": "philosopher"
    },
    {
        " Ismail Al-Faruqi": "ismail al-faruqi"
    },
    {
        ", in 42 in response to what he called the malaise of the ": null
    },
    {
        "ummah": "ummah"
    },
    {
        " . He argued that by using tools, categories, concepts and modes of analysis that originated wholly in the secular West , there was a disconnect between the ecological and social reality of Muslim nations, and worse, a total inability to respect or even notice the violations of ethics of ": null
    },
    {
        "Islam": "islam"
    },
    {
        " itself. In his view, clashes between traditionalist ": null
    },
    {
        "ulema": "ulema"
    },
    {
        " and reformers seeking to revive Muslim society with modern science and professional categories, were inevitable without the strong ethical constraints that applied to methods of ": null
    },
    {
        "early Muslim philosophy": "early muslim philosophy"
    },
    {
        ". He proposed therefore to revive those methods, restore ": null
    },
    {
        "ijtihad": "ijtihad"
    },
    {
        " and integrate ": null
    },
    {
        "scientific method": "scientific method"
    },
    {
        " within Islamic limits.     A significant example of the movement to islamize knowledge is the ": null
    },
    {
        "International Institute of Islamic Thought": "international institute of islamic thought"
    },
    {
        ", based in the US state of Virginia and closely linked to the Muslim Brotherhood. Beyond its academic work, the Institute has been controversial due to its links to terrorist groups.     A body of modern knowledge that had been so Islamized would not offend the traditionalists, since it would place ethics before knowledge or curiosity or power, and provide for curtailment of scientific or professional activities that offended those ethics. However, if it were sufficiently broad and integrative to support inquiry across all vital fields including medicine, agriculture, ecology, and technology, it would provide ample opportunity for a modern professional class to mentally and economically liberate the Muslim societies. They would ally with, not fight with, the ulema.     Al-Faruqi died in 42 but his program has already had a profound effect, especially on ": null
    },
    {
        "Islamic economics": "islamic economics"
    },
    {
        ", which operates under traditional zero-interest, participatory labor-capital structures, and supports stronger community control of land . These practices were already well on the way to revival before Al-Faruqis work, however. Islamic banks remain a relatively minor force in world finance.     There are also debates on ": null
    },
    {
        "Islamic science": "islamic science"
    },
    {
        " and what it would mean to do science in a way that reflects the ethical teachings of Islam, and accept direction from the ": null
    },
    {
        "ijma": "ijma"
    },
    {
        " on the priorities of such research.     Al-Faruqis analysis, called the Islamization of Knowledge: General Principles and Workplan remains the primary source for this program. ": null
    },
    {
        "Nasr": "hossein nasr"
    },
    {
        "s work on the congruence between classical Islam and the modern ": null
    },
    {
        "ecology movement": "ecology movement"
    },
    {
        " is thought by some to be even more fundamental, and to suggest parallels between the ethical constraints that secular activists seek to place on science and technology, and the ethical constraints that ": null
    },
    {
        "Islam": "islam"
    },
    {
        " sought to place on philosophy and politics. An Islamic ": null
    },
    {
        "ecotheology": "ecotheology"
    },
    {
        " would then converge with economics and put Islamic pillars under a form of ": null
    },
    {
        "ecological economics": "ecological economics"
    },
    {
        ", with religious authority backing up ": null
    },
    {
        "sustainable development": "sustainable development"
    },
    {
        ". This would be a significant first step towards Al-Faruqis overall program.         Critics argue that there are vast differences between the kind of ethics that are applied in the modern ": null
    },
    {
        "labour movement": "labour movement"
    },
    {
        " or the ": null
    },
    {
        "anti-globalization movement": "anti-globalization movement"
    },
    {
        ", for example, and those that would be applied by any believer in the literal interpretation of the ": null
    },
    {
        "Quran": "quran"
    },
    {
        ". Thus, any cooperation of modern ethical reformers and those seeking guidance from classical Islam would be doomed from the start.     There are, however, debates regarding ": null
    },
    {
        "Islamic feminism": "islamic feminism"
    },
    {
        " and ": null
    },
    {
        "ethics of technology": "ethics of technology"
    },
    {
        " wherein secular concerns  seem to often echo the terms of reference of a classical critique:     Catholic theology was well integrated with scientific knowledge from the time of ": null
    },
    {
        "Aquinas": "thomas aquinas"
    },
    {
        " to the time of ": null
    },
    {
        "Galileo": "galileo galilei"
    },
    {
        ", and that too was a deliberate program. Critics suggest that this also demonstrates the futility of trying to inhibit scientific research with reference to any ": null
    },
    {
        "religious fundamentalism": "religious fundamentalism"
    },
    {
        ".     In modern times, Pope John Paul II called at times for restraining the sciences to work strictly within a Christian ethical framework, and respect the boundaries between what is known by faith versus reason - his ": null
    },
    {
        "Fides et Ratio": "fides et ratio"
    },
    {
        " and ": null
    },
    {
        "Gospel of Life": "gospel of life"
    }
]