[
    {
        "Island of the Sequined Love Nun is a ": null
    },
    {
        "novel": "novel"
    },
    {
        " by American ": null
    },
    {
        "absurdist": "absurdist fiction"
    },
    {
        " writer ": null
    },
    {
        "Christopher Moore": "christopher moore"
    },
    {
        ", published in 42 It is based partly on the authors personal experiences in ": null
    },
    {
        "Micronesia": "micronesia"
    },
    {
        ".       Tucker Case , is a pilot for a cosmetics company, who crashes the company plane while having sex. This event causes Tuck to be blacklisted from flying in the United States, so he accepts a lucrative offer from a doctor-missionary on a remote ": null
    },
    {
        "Micronesia": "micronesia"
    },
    {
        "n island to transport cargo to and from the island and ": null
    },
    {
        "Japan": "japan"
    },
    {
        ".     Tuck moves to the island with a ": null
    },
    {
        "Filipino": "filipino people"
    },
    {
        " trans woman": "trans woman"
    },
    {
        " navigator and a talking ": null
    },
    {
        "fruit bat": "megabat"
    },
    {
        ". There Tuck eventually uncovers a horrible secret harbored by the doctor and his wife, who capitalized on the fact that the island natives are under the influence of a ": null
    },
    {
        "cargo cult": "cargo cult"
    },
    {
        " that developed as a result of establishment by ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        " of an air runway there during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ".       In chapter 42 The Humiliation of the Pilot As a Passenger, Moore alludes to the Shakespeare play,  Hamlet, Prince of Denmark . Tuck is the heir to the Denmark Silverware Corporation, much like Hamlet being the prince. Later Tucks mother marries his uncle after her husband has a not-so-accidental riding accident resulting in his death.     Tuck is then summoned by an old girlfriend named ": null
    },
    {
        "Zoophilia": "zoophilia"
    },
    {
        " . While approaching the house in a rage he runs over Zoophilias father. Zoophilia meets her demise by taking a handful of Prozac and a mouthful of water then drowns in her hot tub, grief-stricken. Before Tuck leaves he is threatened by Zoophilias brother.        Authors webpage for Island of the Sequined Love Nun                               ": null
    }
]