[
    {
        "      Israel Shahak  was an Israeli professor of ": null
    },
    {
        "organic chemistry": "organic chemistry"
    },
    {
        ", at Hebrew University of Jerusalem, a ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        " survivor, a public intellectual of Liberal political bent, and a civil-rights advocate and activist on behalf of Jew and gentile. For twenty years, he headed the ": null
    },
    {
        "Israeli League for Human and Civil Rights": "israeli league for human and civil rights"
    },
    {
        " and was a public critic of the policies of the governments of Israel. As a public intellectual, Shahaks works about ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " proved controversial, especially the book Jewish History, Jewish Religion: The Weight of Three Thousand Years .       Israel Shahak was born Israel Himmelstaub, in 42 in Warsaw, Poland, and was the youngest child of a cultured, Zionist family of ": null
    },
    {
        "Ashkenazi Jew": "ashkenazi jew"
    },
    {
        "s. During the Second World War, the ": null
    },
    {
        "Nazi Occupation of Poland": "occupation of poland"
    },
    {
        " interned the Shahak family to the ": null
    },
    {
        "Warsaw Ghetto": "warsaw ghetto"
    },
    {
        "; yet his elder brother escaped Poland to Britain, where he joined the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        ". Meanwhile, life in occupied Poland forced Shahaks mother to pay a Roman Catholic family to hide Israel, whom they returned when she could not afford their safe-keeping him from the Nazis.     In 42 the Nazis sent the Shahak family to the ": null
    },
    {
        "Poniatowa concentration camp": "poniatowa concentration camp"
    },
    {
        ", to the west of Lublin, where his father died. Fortuitously, the ten-year-old boy and his mother escaped from the Poniatowacamp, and returned to Warsaw; yet, within a year, whilst emptying the city of Jews, the Nazis recaptured Israel and his mother, and imprisoned them in the ": null
    },
    {
        "Bergen-Belsen concentration camp": "bergen-belsen concentration camp"
    },
    {
        ", where they survived for 42 years, until the camp and its inmates were liberated in 42 by the British Army. Age 42 in 42 he reexamined the idea of Gods existence and concluded evidence for the theory was lacking. As ": null
    },
    {
        "displaced persons": "displaced persons camp"
    },
    {
        " mother and son managed to emigrate to the ": null
    },
    {
        "British Mandate of Palestine": "mandatory palestine"
    },
    {
        ", where Shahaks application to join a ": null
    },
    {
        "kibbutz": "kibbutz"
    },
    {
        " was denied, because he was judged to be physically too slender.     Post-war, the twelve-year-old Israel worked and studied and supported his sickly mother: surviving Bergen-Belsen had broken her health. After a religious Jewish education at boarding school, in the village of ": null
    },
    {
        "Kfar Hassidim": "kfar hassidim"
    },
    {
        ", Israel and his mother moved to the city of ": null
    },
    {
        "Tel Aviv": "tel aviv"
    },
    {
        ". Upon graduation from secondary school, Shahak soldiered in the ": null
    },
    {
        "Israel Defense Forces": "israel defense forces"
    },
    {
        " ; after military service, he earned a doctorate in chemistry, at ": null
    },
    {
        "Hebrew University": "hebrew university"
    },
    {
        ".     In the course of his professional career as a scientist, Shahaks work in ": null
    },
    {
        "organic chemistry": "organic chemistry"
    },
    {
        " produced science about ": null
    },
    {
        "organic compounds": "organic compounds"
    },
    {
        " of the element ": null
    },
    {
        "fluorine": "fluorine"
    },
    {
        " , contributed to cancer research, for which he gained an international reputation and included posting as an assistant to ": null
    },
    {
        "Ernst David Bergmann": "ernst david bergmann"
    },
    {
        ", the ": null
    },
    {
        "nuclear physicist": "nuclear physics"
    },
    {
        " who was chairman of the Israel Atomic Energy Commission . In 42 Shahak pursued post-doctoral studies at ": null
    },
    {
        "Stanford University": "stanford university"
    },
    {
        ", in the U.S.; in 42 he returned to Israel, where he became a popular lecturer and researcher in chemistry, at Hebrew University; moreover, by 42 Prof. Shahak actively participated in the Israeli politics of the day.     In 42 the academic Shahak retired from the faculty of Hebrew University, because of poor health  and greater interest in research work in other fields of intellectual enquiry. For most of his adult life, Prof. Israel Shahak, Ph.D., resided in the ": null
    },
    {
        "Rehavia": "rehavia"
    },
    {
        " neighborhood in ": null
    },
    {
        "West Jerusalem": "west jerusalem"
    },
    {
        "; at the age of 42 years, he died of diabetic complications, and was buried in the ": null
    },
    {
        "Givat Shaul": "givat shaul"
    },
    {
        " cemetery.     Shahak had a deep affinity with ": null
    },
    {
        "Spinoza": "spinoza"
    },
    {
        ":": null
    },
    {
        "ino": "ino"
    },
    {
        "42 October 42 – 42 November 42religious and cultural42–42 June 42ghettoescivil and militaryreligious, political, academicJune 42 – June 42": null
    },
    {
        "b": "b"
    },
    {
        "42424242Jewish lawnewspaperKnown in JudahTalmudicidolater4242 medical personnel, 42 per cent Orthodox42": null
    },
    {
        "ilosop": "ilosop"
    },
    {
        "the legal system of Classical Judaism42pp. 4242p. 42though Shahaks sporadic use of footnotes makes it difficult to check all of themADL": null
    },
    {
        "gal syst": "gal syst"
    },
    {
        " edStudies in Geophysical Optics and Remote Sensing Special Reports, No. 42ed.a translation of Oded Yinons A Strategy for Israel in the Nineteen Eighties or the Yinon Plan , Association of Arab-American University Graduates, Inc., October 42 paperback,  Jewish History, Jewish Religion: The Weight of Three Thousand Years: Pluto Press, London, 42 ; Pluto Press, London, 42  Open Secrets: Israeli Foreign and Nuclear Policies, Pluto Press, London, 42   Israel Shahak and Norton Mezvinsky, Jewish Fundamentalism in Israel , Pluto Press , October 42 hardcover, 42 pages, ; trade paperback, Pluto Press, , October 42 ; 42nd edition with new introduction by Norton Mezvinsky, trade paperback July 42 42 pages                                                              , ": null
    },
    {
        "Anti-Defamation League": "anti-defamation league"
    },
    {
        ", February 42                                                                   ": null
    }
]