[
    {
        "          Giulio Cesare  was one of three  ": null
    },
    {
        "dreadnought battleships": "dreadnought battleship"
    },
    {
        "built for the Royal Italian Navy  in the 1910s. Completed in 1914, she was little used and saw no combat during the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ". The ship supported operations during the ": null
    },
    {
        "Corfu Incident": "corfu incident"
    },
    {
        " in 1923 and spent much of the rest of the decade in ": null
    },
    {
        "reserve": "reserve fleet"
    },
    {
        ". She was rebuilt between 1933 and 1937 with more powerful guns, additional armor and considerably more speed than before.     During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", both Giulio Cesare and her ": null
    },
    {
        "sister ship": "sister ship"
    },
    {
        ", , participated in the ": null
    },
    {
        "Battle of Calabria": "battle of calabria"
    },
    {
        " in July 1940, when the former was lightly damaged. They were both present when British ": null
    },
    {
        "torpedo bombers": "torpedo bomber"
    },
    {
        " attacked": "battle of taranto"
    },
    {
        " the fleet at ": null
    },
    {
        "Taranto": "taranto"
    },
    {
        " in November 1940, but Giulio Cesare was not damaged. She escorted several convoys to ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        " and participated in the ": null
    },
    {
        "Battle of Cape Spartivento": "battle of cape spartivento"
    },
    {
        " in late 1940 and the ": null
    },
    {
        "First Battle of Sirte": "first battle of sirte"
    },
    {
        " in late 1941. She was designated as a ": null
    },
    {
        "training ship": "training ship"
    },
    {
        " in early 1942, and escaped to ": null
    },
    {
        "Malta": "malta"
    },
    {
        " after the ": null
    },
    {
        "Italian armistice": "armistice of cassibile"
    },
    {
        " the following year. The ship was transferred to the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " in 1949 and renamed Novorossiysk . The Soviets also used her for training until she was sunk in 1955, with the loss of 608 men, when an old German ": null
    },
    {
        "mine": "naval mine"
    },
    {
        " exploded. She was ": null
    },
    {
        "salvaged": "marine salvage"
    },
    {
        " the following year and later ": null
    },
    {
        "scrapped": "ship breaking"
    },
    {
        ".       The Conte di Cavour class was designed to counter the French  dreadnoughts which caused them to be slower and more heavily armored than the first Italian dreadnought, . Giorgerini, p. 269 The ships were  ": null
    },
    {
        "long at the waterline": "length at the waterline"
    },
    {
        " and  ": null
    },
    {
        "overall": "length overall"
    },
    {
        ". They had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of , and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . Gardiner & Gray, p. 259 The Conte di Cavour-class ships ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  at normal load, and  at ": null
    },
    {
        "deep load": "deep load"
    },
    {
        ". They had a crew of 31 officers and 969 enlisted men. Giorgerini, pp. 270, 272 The ships were powered by three sets of ": null
    },
    {
        "Parsons": "parsons marine steam turbine company"
    },
    {
        " steam turbine": "steam turbine"
    },
    {
        "s, two sets driving the outer ": null
    },
    {
        "propeller shafts": "propeller shaft"
    },
    {
        "and one set the two inner shafts. Steam for the turbines was provided by 24 ": null
    },
    {
        "Babcock & Wilcox boiler": "babcock  &  wilcox boiler"
    },
    {
        "s, half of which burned ": null
    },
    {
        "fuel oil": "fuel oil"
    },
    {
        " and the other half burning both oil and coal. Designed to reach a maximum speed of  from , Giulio Cesare failed to reach this goal on her ": null
    },
    {
        "sea trial": "sea trial"
    },
    {
        "s, reaching only  from . The ships carried enough coal and oil Giorgerini, pp. 268, 272 to give them a range of  at .          The ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of the Conte di Cavour class consisted of thirteen ": null
    },
    {
        "305-millimeter Model 1909 guns": "305 mm /46 model 1909"
    },
    {
        ", in five ": null
    },
    {
        "centerline": "glossary of nautical termsc"
    },
    {
        " gun turret": "gun turret"
    },
    {
        "s, with a twin-gun turret ": null
    },
    {
        "superfiring": "superfire"
    },
    {
        " over a triple-gun turret in fore and aft pairs, and a third triple turret ": null
    },
    {
        "amidships": "amidships"
    },
    {
        ". Hore, p. 175 Their ": null
    },
    {
        "secondary armament": "battleship secondary armament"
    },
    {
        " consisted of eighteen  guns mounted in ": null
    },
    {
        "casemates": "casemate"
    },
    {
        "on the sides of the hull. For defense against ": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        "s, the ships carried fourteen ": null
    },
    {
        " guns": "qf 14 pounder naval gun mk i  &  ii naval gun"
    },
    {
        "; thirteen of these could be mounted on the turret tops, but they could be positioned in 30 different locations, including some on the ": null
    },
    {
        "forecastle": "forecastle"
    },
    {
        " and upper decks. They were also fitted with three submerged  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, one on each ": null
    },
    {
        "broadside": "broadside"
    },
    {
        " and the third in the stern. Giorgerini, pp. 268, 277–278     The Conte di Cavour-class ships had a complete ": null
    },
    {
        "waterline": "waterline"
    },
    {
        " armor belt": "belt armor"
    },
    {
        " that had a maximum thickness of  amidships, which reduced to  towards the stern and  towards the bow. They had two armored ": null
    },
    {
        "deck": "deck"
    },
    {
        "s: the main deck was  thick on the flat that increased to  on the slopes that connected it to the main belt. The second deck was  thick. Frontal armor of the gun turrets was  in thickness and the sides were  thick. The armor protecting their ": null
    },
    {
        "barbettes": "barbette"
    },
    {
        "ranged in thickness from . The walls of the forward ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " were 280 millimeters thick. Giorgerini, pp. 270–272 McLaughlin, p. 421          Shortly after the end of World War I, the number of 76.2  mm guns was reduced to 13, all mounted on the turret tops, and six new 76.2-millimeter ": null
    },
    {
        "anti-aircraft guns": "anti-aircraft gun"
    },
    {
        " were installed abreast the aft funnel. In addition two ": null
    },
    {
        "license-built": "license-built"
    },
    {
        " 2-pounder ": "qf 2 pounder naval gun"
    },
    {
        " AA guns were mounted on the forecastle deck. In 1925–1926 the foremast was replaced by a four-legged mast, which was moved forward of the ": null
    },
    {
        "funnel": "funnel"
    },
    {
        "s, Giorgerini, p. 277 the ": null
    },
    {
        "rangefinders": "rangefinder"
    },
    {
        "were upgraded, and the ship was equipped to handle a ": null
    },
    {
        "Macchi M.18": "macchi m.18"
    },
    {
        " seaplane": "seaplane"
    },
    {
        " mounted on the amidships turret. Around that same time, either one or both of the ships was equipped with a fixed ": null
    },
    {
        "aircraft catapult": "aircraft catapult"
    },
    {
        " on the port side of the forecastle.     Giulio Cesare began an extensive reconstruction in October 1933 at the ": null
    },
    {
        "Cantieri del Tirreno": "cantiere navale di riva trigoso"
    },
    {
        " shipyard in ": null
    },
    {
        "Genoa": "genoa"
    },
    {
        " that lasted until October 1937. Bargoni & Gay, p. 19 A new bow section was grafted over the existing bow which increased her length by  to  and her beam increased to . The ships draft at deep load increased to . All of the changes made increased her displacement to  at ": null
    },
    {
        "standard load": "displacement standard displacement"
    },
    {
        " and  at deep load. The ships crew increased to 1,260 officers and enlisted men. Brescia, p. 58 Two of the propeller shafts were removed and the existing turbines were replaced by two Belluzzo geared steam turbines rated at . The boilers were replaced by eight ": null
    },
    {
        "Yarrow boiler": "yarrow boiler"
    },
    {
        "s. On her sea trials in December 1936, before her reconstruction was fully completed, Giulio Cesare reached a speed of  from . McLaughlin 2003, p. 422 In service her maximum speed was about  and she had a range of  at a speed of . Bagnasco & Grossman, pp. 64–65     The main guns were bored out to  and the center turret and the torpedo tubes were removed. All of the existing secondary armament and AA guns were replaced by a dozen 120  mm guns in six twin-gun turrets and eight  AA guns in twin turrets. In addition the ship was fitted with a dozen ": null
    },
    {
        "Breda": "società italiana ernesto breda"
    },
    {
        "  light AA guns in six twin-gun mounts and twelve ": null
    },
    {
        " Breda M31 anti-aircraft": "breda model 1931 machine gun"
    },
    {
        " machine gun": "machine gun"
    },
    {
        "s, also in twin mounts. Bagnasco & Grossman, p. 65 In 1940 the 13.2  mm machine guns were replaced by  AA guns in twin mounts. Giulio Cesare received two more twin mounts as well as four additional 37  mm guns in twin mounts on the forecastle between the two turrets in 1941. The tetrapodal mast was replaced with a new forward conning tower, protected with  thick armor. Bargoni & Gay, p. 21 Atop the conning tower there was a ": null
    },
    {
        "fire-control director": "fire-control systemnaval fire control"
    },
    {
        " fitted with two large stereo-rangefinders, with a base length of .     The deck armor was increased during the reconstruction to a total of  over the engine and boiler rooms and  over the ": null
    },
    {
        "magazine": "magazine"
    },
    {
        "s, although its distribution over three decks, meant that it was considerably less effective than a single plate of the same thickness. The armor protecting the barbettes was reinforced with  plates. All this armor weighed a total of . The existing underwater protection was replaced by the ": null
    },
    {
        "Pugliese torpedo defense system": "pugliese torpedo defense system"
    },
    {
        " that consisted of a large cylinder surrounded by fuel oil or water that was intended to absorb the blast of a torpedo ": null
    },
    {
        "warhead": "warhead"
    },
    {
        ". It lacked, however, enough depth to be fully effective against contemporary torpedoes. A major problem of the reconstruction was that the ships increased draft meant that their waterline armor belt was almost completely submerged with any significant load. McLaughlin 2003, pp. 421–22             Giulio Cesare, named after ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        ", Silverstone, p. 298 was ": null
    },
    {
        "laid down": "keel"
    },
    {
        " at the ": null
    },
    {
        "Gio. Ansaldo & C.": "gio. ansaldo  &  c."
    },
    {
        " shipyard in Genoa on 24 June 1910 and ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " on 15 October 1911. She was completed on 14 May 1914 and served as a ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " in the southern ": null
    },
    {
        "Adriatic Sea": "adriatic sea"
    },
    {
        " during World War I. Preston, p. 176 She saw no action, however, and spent little time at sea. Admiral ": null
    },
    {
        "Paolo Thaon di Revel": "paolo thaon di revel"
    },
    {
        ", the Italian naval chief of staff, believed that Austro-Hungarian ": null
    },
    {
        "submarines": "submarine"
    },
    {
        "and minelayers could operate too effectively in the narrow waters of the Adriatic. Halpern, p. 150 The threat from these underwater weapons to his capital ships was too serious for him to use the fleet in an active way. Instead, Revel decided to implement a blockade at the relatively safer southern end of the Adriatic with the battle fleet, while smaller vessels, such as the ": null
    },
    {
        "MAS torpedo boats": "mas"
    },
    {
        ", conducted raids on Austro-Hungarian ships and installations. Meanwhile, Revels battleships would be preserved to confront the Austro-Hungarian battle fleet in the event that it sought a decisive engagement. Halpern, pp. 141 & ndash;142     Giulio Cesare made port visits in the ": null
    },
    {
        "Levant": "levant"
    },
    {
        " in 1919 and 1920. Both Giulio Cesare and Conte di Cavour supported Italian operations on ": null
    },
    {
        "Corfu": "corfu"
    },
    {
        " in 1923 after an Italian general and his staff ": null
    },
    {
        "were murdered at the Greek–Albanian frontier": "corfu incident"
    },
    {
        "; ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        ", who had been looking for a pretext to seize Corfu, ordered Italian troops to occupy the island. Cesare became a gunnery training ship in 1928, after having been in reserve since 1926. She was reconstructed at ": null
    },
    {
        "Cantieri del Tirreno": "cantieri del tirreno"
    },
    {
        ", Genoa, between 1933 and 1937. Both ships participated in a naval review by ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " in the ": null
    },
    {
        "Bay of Naples": "bay of naples"
    },
    {
        " in May 1938 and covered the ": null
    },
    {
        "invasion of Albania": "invasion of albania"
    },
    {
        " in May 1939. Whitley, pp. 158–61          Early in World War II, the ship took part in the Battle of Calabria , together with Conte di Cavour, on 9 July 1940, as part of the 1st Battle Squadron, commanded by Admiral ": null
    },
    {
        "Inigo Campioni": "inigo campioni"
    },
    {
        ", during which she engaged major elements of the British ": null
    },
    {
        "Mediterranean Fleet": "mediterranean fleet"
    },
    {
        ". The British were escorting a convoy from Malta to ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        ", while the Italians had finished escorting another from ": null
    },
    {
        "Naples": "naples"
    },
    {
        " to ": null
    },
    {
        "Benghazi": "benghazi"
    },
    {
        ", Libya. Admiral ": null
    },
    {
        "Andrew Cunningham": "andrew cunningham, 1st viscount cunningham of hyndhope"
    },
    {
        ", commander of the Mediterranean Fleet, attempted to interpose his ships between the Italians and their base at Taranto. Crew on the fleets spotted each other in the middle of the afternoon and the battleships opened fire at 15:53 at a range of nearly . The two leading British battleships,  and , replied a minute later. Three minutes after she opened fire, shells from Giulio Cesare began to straddle Warspite which made a small turn and increased speed, to throw off the Italian ships aim, at 16:00. Some rounds fired by Giulio Cesare overshot Warspite and near-missed the destroyers ": null
    },
    {
        "HMS Decoy": "hms decoy"
    },
    {
        " and  Hereward , puncturing their superstructures with splinters. At that same time, a shell from Warspite struck Giulio Cesare at a distance of about . The shell pierced the rear funnel and detonated inside it, blowing out a hole nearly  across. Fragments started several fires and their smoke was drawn into the boiler rooms, forcing four boilers off-line as their operators could not breathe. This reduced the ships speed to . Uncertain how severe the damage was, Campioni ordered his battleships to turn away in the face of superior British numbers and they successfully disengaged. OHara, pp. 28–35 Repairs to Giulio Cesare were completed by the end of August and both ships unsuccessfully attempted to intercept British convoys to ": null
    },
    {
        "Malta": "malta"
    },
    {
        " in August and September. Whitley, p. 161     On the night of 11 November 1940, Giulio Cesare and the other Italian battleships were at anchor in Taranto harbor when they were attacked by 21 ": null
    },
    {
        "Fairey Swordfish": "fairey swordfish"
    },
    {
        "torpedo bombers": "torpedo bomber"
    },
    {
        "from the British ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        " , along with several other warships. One torpedo sank  Conte di Cavour  in shallow water, but Giulio Cesare was not hit during the attack. Cernuschi & OHara, p. 81 She participated in the ": null
    },
    {
        "Battle of Cape Spartivento": "battle of cape spartivento"
    },
    {
        " on 27 November 1940, but never got close enough to any British ships to fire at them. The ship was damaged in January 1941 by splinters from a near miss during an air raid on Naples by ": null
    },
    {
        "Vickers Wellington": "vickers wellington"
    },
    {
        " bombers of the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        "; repairs at Genoa were completed in early February. On 8 February, she sailed from to the ": null
    },
    {
        "Straits of Bonifacio": "straits of bonifacio"
    },
    {
        " to intercept what the Italians thought was a Malta convoy, but was actually a raid on Genoa. She failed to make contact with any British forces. She participated in the ": null
    },
    {
        "First Battle of Sirte": "first battle of sirte"
    },
    {
        " on 17 December 1941, providing distant cover for a convoy bound for Libya, and briefly engaging the escort force of a British convoy. She also provided distant cover for another convoy to North Africa in early January 1942. Whitley, pp. 161–162 Giulio Cesare was reduced to a training ship afterwards at Taranto and later ": null
    },
    {
        "Pola": "pula"
    },
    {
        ". Brescia, p. 59 After the Italian surrender on 9 September 1943, she steamed to Taranto, putting down a ": null
    },
    {
        "mutiny": "mutiny"
    },
    {
        " and enduring an ineffective attack by five German aircraft en route. She then sailed for Malta where she arrived on 12 September to be interned. The ship remained there until 17 June 1944 when she returned to Taranto where she remained for the next four years. Whitley, p. 162 Bargoni & Gay, p. 71           After the war, Giulio Cesare was allocated to the Soviet Union as part of the ": null
    },
    {
        "war reparations": "paris peace treaties, 1947"
    },
    {
        ". She was moved to ": null
    },
    {
        "Augusta, Sicily": "augusta, sicily"
    },
    {
        ", on 9 December 1948, where an unsuccessful attempt was made at sabotage. The ship was stricken from the naval register on 15 December and turned over to the Soviets on 6 February 1949 under the temporary name of Z11 in ": null
    },
    {
        "Vlorë": "vlorë"
    },
    {
        ", Albania. She was renamed Novorossiysk, after the Soviet city ": null
    },
    {
        "of that name": "novorossiysk"
    },
    {
        " on the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        ". The Soviets used her as a training ship, and gave her eight refits. In 1953, all Italian light AA guns were replaced by eighteen ": null
    },
    {
        "37 mm 70-K": "37 mm automatic air defense gun m1939"
    },
    {
        " AA guns in six twin mounts and six singles. Also replaced were her fire-control systems and ": null
    },
    {
        "radar": "radar"
    },
    {
        "s. The Soviets intended to rearm her with their own ": null
    },
    {
        "305  mm guns": "obukhovskii 12  /52 pattern 1907 gun"
    },
    {
        ", but this was forestalled by her loss. While at anchor in ": null
    },
    {
        "Sevastopol": "sevastopol"
    },
    {
        " on the night of 28/29 October 1955, an explosion ripped a  hole in the forecastle forward of A turret. The flooding could not be controlled, and she ": null
    },
    {
        "capsized": "capsized"
    },
    {
        " with the loss of 608 men, including men sent from other ships to assist. McLaughlin 2003, pp. 419, 422     The cause of the explosion is still unclear. The official cause, regarded as the most probable, was a magnetic RMH or LMB ": null
    },
    {
        "bottom mine": "bottom mine"
    },
    {
        ", laid by the Germans during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and triggered by the dragging of the battleships anchor chain before ": null
    },
    {
        "mooring": "wikt:moor"
    },
    {
        " for the last time. Subsequent searches located 32 mines of these types, some of them within  of the explosion. The damage was consistent with an explosion of  of ": null
    },
    {
        "TNT": "tnt"
    },
    {
        ", and more than one mine may have detonated. Nonetheless, other explanations for the ships loss have been proposed, and the most popular of these is that she was sunk by Italian ": null
    },
    {
        "frogmen": "frogmen"
    },
    {
        " of the wartime special operations unit  Decima Flottiglia MAS  who – more than ten years after the cessation of hostilities – were either avenging the transfer of the former Italian battleship to the USSR or sinking it on behalf of ": null
    },
    {
        "NATO": "nato"
    },
    {
        ". McLaughlin 2003, p. 423 McLaughlin 2007, pp. 142–52   Greene & Massignani, pp. 195–98 Novorossiysk was stricken from the ": null
    },
    {
        "naval register": "naval register"
    },
    {
        " on 24 February 1956, salvaged on 4 May 1957, and subsequently scrapped.             ": null
    }
]