[
    {
        "                    Ivanhoe  is a ": null
    },
    {
        "historical novel": "Historical Novel"
    },
    {
        " by ": null
    },
    {
        "Sir Walter Scott": "Sir Walter Scott"
    },
    {
        ", first published in late 1819 in three volumes and subtitled A Romance. At the time it was written it represented a shift by Scott away from fairly realistic novels set in ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        " in the comparatively recent past, to a somewhat fanciful depiction of medieval ": null
    },
    {
        "England": "England"
    },
    {
        ". It has proved to be one of the best known and most influential of Scotts novels.     Ivanhoe is set in 12th-century England with colourful descriptions of a tournament, outlaws, a witch trial and divisions between ": null
    },
    {
        "Jews": "Jews"
    },
    {
        " and ": null
    },
    {
        "Christians": "Christians"
    },
    {
        ". It has been credited for increasing interest in ": null
    },
    {
        "romance": "Chivalric Romance"
    },
    {
        " and ": null
    },
    {
        "medievalism": "Medievalism"
    },
    {
        "; ": null
    },
    {
        "John Henry Newman": "John Henry Newman"
    },
    {
        " claimed Scott had first turned mens minds in the direction of the Middle Ages , while ": null
    },
    {
        "Thomas Carlyle": "Thomas Carlyle"
    },
    {
        " and ": null
    },
    {
        "John Ruskin": "John Ruskin"
    },
    {
        " made similar assertions of Scotts overwhelming influence over the revival, based primarily on the publication of this novel. Alice Chandler, Sir Walter Scott and the Medieval Revival , Nineteenth-Century Fiction 19.4 : 315–332. It has also had an important influence on popular perceptions of ": null
    },
    {
        "Richard the Lionheart": "Richard The Lionheart"
    },
    {
        ", ": null
    },
    {
        "King John": "John, King Of England"
    },
    {
        " and ": null
    },
    {
        "Robin Hood": "Robin Hood"
    },
    {
        ".     There have been several adaptations for stage, film and television.       In June 1819, Scott was still suffering from the severe stomach pains that had forced him to dictate the last part of  The Bride of Lammermoor  and most of  A Legend of the Wars of Montrose , finishing at the end of May. But by the beginning of July at the latest he had started dictating his new novel Ivanhoe, again with ": null
    },
    {
        "John Ballantyne": "John Ballantyne"
    },
    {
        " and ": null
    },
    {
        "William Laidlaw": "William Laidlaw"
    },
    {
        " as amanuenses. He was able to take up the pen himself for the second half of the novel and completed it in early November.     For detailed information about the middle ages Scott drew on three works by the antiquarian ": null
    },
    {
        "Joseph Strutt": "Joseph Strutt"
    },
    {
        ": Horda Angel-cynnan or a Compleat View of the Manners, Customs, Arms, Habits etc. of the Inhabitants of England , Dress and Habits of the People of England , and Sports and Pastimes of the People of England . Two historians gave him a solid grounding in the period: ": null
    },
    {
        "Robert Henry": "Robert Henry"
    },
    {
        " with his The History of Great Britain , and ": null
    },
    {
        "Sharon Turner": "Sharon Turner"
    },
    {
        " with The History of the Anglo-Saxons from the Earliest Period to the Norman Conquest . His clearest debt to an original medieval source involved the Templar Rule, reproduced in The Theatre of Honour and Knight-Hood translated from the French of André Favine. Scott was happy to introduce details from the later middle ages, and ": null
    },
    {
        "Chaucer": "Geoffrey Chaucer"
    },
    {
        " was particularly helpful, as was the fourteenth-century romance  Richard Coeur de Lion .       Ivanhoe was published by ": null
    },
    {
        "Archibald Constable": "Archibald Constable"
    },
    {
        " in Edinburgh. All first editions carry the date of 1820, but it was released on 20 December 1819 and issued in ": null
    },
    {
        "London": "London"
    },
    {
        " on the 29th. As with all of the ": null
    },
    {
        "Waverley novels": "Waverley Novels"
    },
    {
        " before 1827, publication was anonymous. It is possible that Scott was involved in minor changes to the text during the early 1820s but his main revision was carried out in 1829 for the Magnum edition where the novel appeared in Volumes 16 and 17 in September and October 1830. The standard modern edition, by Graham Tulloch, appeared as Volume 8 of ": null
    },
    {
        "the Edinburgh Edition of the Waverley Novels": "The Edinburgh Edition Of The Waverley Novels"
    },
    {
        " in 1998: this is based on the first edition with emendations principally from Scotts manuscript in the second half of the work; the new Magnum material is included in Volume 25b.       Ivanhoe is the story of one of the remaining ": null
    },
    {
        "Anglo-Saxon": "Anglo-Saxons"
    },
    {
        " noble families at a time when the nobility in England was overwhelmingly ": null
    },
    {
        "Norman": "Normans"
    },
    {
        ". It follows the Saxon protagonist, Sir Wilfred of Ivanhoe, who is out of favour with his father for his allegiance to the Norman king ": null
    },
    {
        "Richard the Lionheart": "Richard I Of England"
    },
    {
        ". The story is set in 1194, after the failure of the ": null
    },
    {
        "Third Crusade": "Third Crusade"
    },
    {
        ", when many of the Crusaders were still returning to their homes in Europe. King Richard, who had been captured by ": null
    },
    {
        "Leopold of Austria": "Leopold V, Duke Of Austria"
    },
    {
        " on his return journey to England, was believed to still be in captivity.           Protagonist Wilfred of Ivanhoe is disinherited by his father Cedric of Rotherwood for supporting the Norman King Richard and for falling in love with the Lady Rowena, a ward of Cedric and descendant of the Saxon Kings of England. Cedric planned to have Rowena marry the powerful Lord Athelstane, a ": null
    },
    {
        "pretender": "Pretender"
    },
    {
        " to the Crown of England by his descent from the last Saxon King, ": null
    },
    {
        "Harold Godwinson": "Harold Godwinson"
    },
    {
        ". Ivanhoe accompanies King Richard on the ": null
    },
    {
        "Crusades": "Crusades"
    },
    {
        ", where he is said to have played a notable role in the ": null
    },
    {
        "Siege of Acre": "Siege Of Acre"
    },
    {
        "; and tends to Louis of Thuringia, who suffers from ": null
    },
    {
        "malaria": "Malaria"
    },
    {
        ".     The book opens with a scene of Norman knights and prelates seeking the hospitality of Cedric. They are guided there by a ": null
    },
    {
        "pilgrim": "Pilgrim"
    },
    {
        ", known at that time as a ": null
    },
    {
        "palmer": "Palmer"
    },
    {
        ". Also returning from the ": null
    },
    {
        "Holy Land": "Holy Land"
    },
    {
        " that same night, Isaac the Count of ": null
    },
    {
        "York": "York"
    },
    {
        ", a Jewish moneylender, seeks refuge at Rotherwood. Following the nights meal, the palmer observes one of the Normans, the ": null
    },
    {
        "Templar": "Templar"
    },
    {
        " Brian de Bois-Guilbert, issue orders to his ": null
    },
    {
        "Saracen": "Saracen"
    },
    {
        " soldiers to capture Isaac.     The palmer then assists in Isaacs escape from Rotherwood, with the additional aid of the ": null
    },
    {
        "swineherd": "Swineherd"
    },
    {
        " Gurth.     Isaac of York offers to repay his debt to the palmer with a suit of armour and a ": null
    },
    {
        "war horse": "Destrier"
    },
    {
        " to participate in the ": null
    },
    {
        "tournament": "Tournament"
    },
    {
        " at ": null
    },
    {
        "Ashby-de-la-Zouch": "Ashby-De-La-Zouch"
    },
    {
        " Castle, on his inference that the palmer was secretly a knight. The palmer is taken by surprise, but accepts the offer.       The tournament is presided over by ": null
    },
    {
        "Prince John": "John, King Of England"
    },
    {
        ". Also in attendance are Cedric, Athelstane, Lady Rowena, Isaac of York, his daughter Rebecca, ": null
    },
    {
        "Robin of Locksley": "Robin Hood"
    },
    {
        " and his men, Prince Johns advisor Waldemar Fitzurse, and numerous Norman ": null
    },
    {
        "knight": "Knight"
    },
    {
        "s.     On the first day of the tournament, in a bout of individual ": null
    },
    {
        "joust": "Joust"
    },
    {
        "ing, a mysterious knight, identifying himself only as Desdichado , defeats Bois-Guilbert. The masked knight declines to reveal himself despite Prince Johns request, but is nevertheless declared the champion of the day and is permitted to choose the Queen of the Tournament. He bestows this honour upon Lady Rowena.     On the second day, at a ": null
    },
    {
        "melee": "Tournament Melee"
    },
    {
        ", Desdichado is the leader of one party, opposed by his former adversaries. Desdichados side is soon hard pressed and he himself beset by multiple foes until rescued by a knight nicknamed Le Noir Faineant , who thereafter departs in secret. When forced to unmask himself to receive his coronet , Desdichado is identified as Wilfred of Ivanhoe, returned from the Crusades. This causes much consternation to Prince John and his court who now fear the imminent return of King Richard.     Ivanhoe is severely wounded in the competition yet his father does not move quickly to tend to him. Instead, Rebecca, a skilled ": null
    },
    {
        "healer": "Healer"
    },
    {
        ", tends to him while they are lodged near the tournament and then convinces her father to take Ivanhoe with them to their home in York, when he is fit for that trip. The conclusion of the tournament includes feats of archery by Locksley, such as splitting a willow reed with his arrow. Prince John’s dinner for the local Saxons ends in insults.       In the forests between Ashby and York, Isaac, Rebecca and the wounded Ivanhoe are abandoned by their guards, who fear bandits and take all of Isaac’s horses. Cedric, Athelstane and the Lady Rowena meet them and agree to travel together. The party is captured by de Bracy and his companions and taken to Torquilstone, the castle of Front-de-Boeuf. The swineherd Gurth and Wamba the jester manage to escape, and then encounter Locksley, who plans a rescue.          The Black Knight, having taken refuge for the night in the hut of ": null
    },
    {
        "local friar": "Friar Tuck"
    },
    {
        ", the Holy Clerk of Copmanhurst, volunteers his assistance on learning about the captives from Robin of Locksley. They then besiege the Castle of Torquilstone with Robins own men, including the friar and assorted Saxon yeomen. Inside Torquilstone, de Bracy expresses his love for the Lady Rowena but is refused. Brian de Bois-Guilbert tries to seduce Rebecca and is rebuffed. Front-de-Boeuf tries to wring a hefty ransom from Isaac of York, but Isaac refuses to pay unless his daughter is freed.     When the besiegers deliver a note to yield up the captives, their Norman captors demand a priest to administer the ": null
    },
    {
        "Final Sacrament": "Final Sacrament"
    },
    {
        " to Cedric; whereupon Cedrics ": null
    },
    {
        "jester": "Jester"
    },
    {
        " Wamba slips in disguised as a priest, and takes the place of Cedric, who escapes and brings important information to the besiegers on the strength of the garrison and its layout. The besiegers storm the castle. The castle is set aflame during the assault by Ulrica, the daughter of the original lord of the castle, Lord Torquilstone, as revenge for her fathers death. Front-de-Boeuf is killed in the fire while de Bracy surrenders to the Black Knight, who identifies himself as King Richard and releases de Bracy. Bois-Guilbert escapes with Rebecca while Isaac is rescued by the Clerk of Copmanhurst. The Lady Rowena is saved by Cedric, while the still-wounded Ivanhoe is rescued from the burning castle by King Richard. In the fighting, Athelstane is wounded and presumed dead while attempting to rescue Rebecca, whom he mistakes for Rowena.       Following the battle, Locksley plays host to King Richard. Word is conveyed by de Bracy to Prince John of the Kings return and the fall of Torquilstone. In the meantime, Bois-Guilbert rushes with his captive to the nearest Templar Preceptory, where Lucas de Beaumanoir, the ": null
    },
    {
        "Grand Master of the Templars": "Grand Masters Of The Knights Templar"
    },
    {
        ", takes umbrage at Bois-Guilberts infatuation and subjects Rebecca to a trial for witchcraft. At Bois-Guilberts secret request, she claims the right to ": null
    },
    {
        "trial by combat": "Trial By Combat"
    },
    {
        "; and Bois-Guilbert, who had hoped for the position, is devastated when the Grand-Master orders him to fight against Rebeccas champion. Rebecca then writes to her father to procure a champion for her. Cedric organises Athelstanes funeral at ": null
    },
    {
        "Coningsburgh": "Conisbrough"
    },
    {
        ", in the midst of which the Black Knight arrives with a companion. Cedric, who had not been present at Locksleys carousal, is ill-disposed towards the knight upon learning his true identity; but Richard calms Cedric and reconciles him with his son. During this conversation, Athelstane emerges – not dead, but laid in his coffin alive by monks desirous of the funeral money. Over Cedrics renewed protests, Athelstane pledges his homage to the Norman King Richard and urges Cedric to marry Rowena to Ivanhoe; to which Cedric finally agrees.     Soon after this reconciliation, Ivanhoe receives word from Isaac beseeching him to fight on Rebeccas behalf. Ivanhoe, riding day and night, arrives in time for the trial by combat, but horse and man are exhausted, with little chance of victory. The two knights make one charge at each other with lances, Bois-Guilbert appearing to have the advantage. However, Bois-Guilbert, a man trying to have it all without offering to marry Rebecca, dies of natural causes in the saddle before the combat can continue.     Fearing further persecution, Rebecca and her father plan to leave England for ": null
    },
    {
        "Granada": "Granada"
    },
    {
        ". Before leaving, Rebecca comes to bid Rowena a fond farewell on her wedding day. Ivanhoe and Rowena marry and live a long and happy life together. Ivanhoes military service ends with the death of King Richard.        Cedric the Saxon, of Rotherwood   Wilfred of Ivanhoe, his son   Rowena, his ward   Athelstane, his kinsman   Gurth, his swineherd   Wamba, his jester   Oswald, his cup-bearer   Elgitha, Rowenas waiting-woman   Albert Malvoisin, Preceptor of Templestowe   Philip Malvoisin, his brother   Hubert, Philips forester   The Prior of Aymer, Abbot of Jorvaulx   Ambrose, a monk attending him   Brian de Bois-Guilbert, a ": null
    },
    {
        "Templar": "Knights Templar"
    },
    {
        " Isaac of York, a money-lender   Rebecca, his daughter   Nathan, a rabbi and physician    King Richard    ": null
    },
    {
        "Prince John": "John, King Of England"
    },
    {
        ", his brother   Locksley, alias ": null
    },
    {
        "Robin Hood": "Robin Hood"
    },
    {
        ", an outlaw   Reginald Front-de-Bœuf, a Templar   Maurice de Bracy, a Templar   Hugh de Grantmesnil, a Templar   Ralph de Vipont, a Templar    Friar Tuck , of Copmanhurst   Ulrica, of Torquilstone, alias Urfried   Lucas de Beaumanoir, grand-master of the Templars   Conrade Mountfitchet, his attendant knight   Higg, a peasant   Kirjath Jairam of Leicester, a rich Jew   Hubert, a forester   ": null
    },
    {
        "Alan-a-Dale": "Alan-A-Dale"
    },
    {
        ", a minstrel       Dedicatory Epistle: An imaginary letter from the Rev. Dr Dryasdust from Laurence Templeton who has found the materials for the following tale mostly in the Anglo-Norman Wardour Manuscript. He wishes to provide an English counterpart to the preceding Waverley novels, in spite of various difficulties arising from the chronologically remote setting made necessary by the earlier progress of civilisation south of the Border.         Ch. 1: Historical sketch. Gurth the swineherd and Wamba the jester discuss life under Norman rule.     Ch. 2: Wamba and Gurth wilfully misdirect a group of horsemen headed by Prior Aymer and Brian de Bois-Guilbert seeking shelter at Cedrics Rotherwood. Aymer and Bois-Guilbert discuss the beauty of Cedrics ward Rowena and are redirected, this time correctly, by a palmer     Ch. 3: Cedric anxiously awaits the return of Gurth and the pigs. Aymer and Bois-Guilbert arrive.     Ch. 4: Bois-Guilbert admires Rowena as she enters for the evening feast.     Ch. 5: During the feast: Isaac enters and is befriended by the palmer; Cedric laments the decay of the Saxon language; the palmer refutes Bois-Guilberts assertion of Templar supremacy in a tournament in Palestine, where Ivanhoe defeated him; the palmer and Rowena give a pledge for a return match; and Isaac is thunderstruck by Bois-Guilberts denial of his assertion of poverty.     Ch. 6: On the road to Sheffield, the palmer tells Rowena that Ivanhoe will soon be home. In the morning he offers to protect Isaac from Bois-Guilbert, whom he has overheard giving instructions for his capture. Isaac mentions a source of horse and armour of which he guesses the palmer has need.     Ch. 7: As the audience for a tournament at Ashby assembles, Prince John amuses himself by making fun of Athelstane and Isaac.     Ch. 8: After a series of Saxon defeats in the tournament the Disinherited Knight triumphs over Bois-Guilbert.     Ch. 9: The Disinherited Knight nominates Rowena as Queen of the Tournament.     Ch. 10: The Disinherited Knight refuses to ransom Bois-Guilberts armour, declaring that their business is not concluded. He instructs his attendant, Gurth in disguise, to convey money to Isaac to repay him for arranging the provision of his horse and armour. Gurth does so, but Rebecca secretly refunds the money.     Ch. 11: Gurth is assailed by a band of outlaws, but they spare him on hearing his story and after he has defeated one of their number, a miller, at quarter-staves.     Ch. 12: The Disinherited Knights party triumph at the tournament, with the aid of a knight in black he is revealed as Ivanhoe and faints as a result of the wounds he has incurred.     Ch. 13: John encourages De Bracy to court Rowena and receives a warning from France that Richard has escaped. Locksley triumphs in an archery contest.     Ch. 14: At the tournament banquet Cedric continues to disown his son but drinks to the health of Richard, rather than John, as the noblest of that race.         Ch. 1 : De Bracy tells Fitzurse of his plan to capture Rowena and then rescue her in his own person.     Ch. 2 : The Black Knight is entertained by a hermit at Copmanhurst.     Ch. 3 : The Black Knight and the hermit exchange songs.     Ch. 4 : Cedric finds Athelstane unresponsive to his attempts to interest him in Rowena, who is herself only attracted by Ivanhoe.     Ch. 5 : Rowena persuades Cedric to escort Isaac and Rebecca, who have been abandoned by their hired protectors. Wamba helps Gurth to escape again. De Bracy mounts his attack, during which Wamba escapes. He meets up with Gurth and they encounter Locksley who, after investigation, advises against a counter-attack, the captives not being in immediate danger.     Ch. 6 : Locksley sends two of his men to watch De Bracy. At Copmanhurst he meets the Black Knight who agrees to join in the rescue.     Ch. 7 : De Bracy tells Bois-Guilbert he has decided to abandon his rescue plan, mistrusting his companion though the Templar says it is Rebecca he is interested in. On arrival at Torquilstone castle Cedric laments its decline.     Ch. 8 : Under threat of torture Front-de-Bœuf forces Isaac to agree to pay him a thousand pounds, but only if Rebecca is released.     Ch. 9 : De Bracy uses Ivanhoes danger from Front-de-Bœuf to put pressure on Rowena, but he is moved by her resulting distress. The narrator refers the reader to historical instances of baronial oppression in medieval England.     Ch. 10 : A hag Urfried warns Rebecca of her forthcoming fate. Rebecca impresses Bois-Guilbert by her spirited resistance to his advances.     Ch. 11 : Front-de-Bœuf rejects a written challenge from Gurth and Wamba. Wamba offers to spy out the castle posing as a confessor.     Ch. 12 : Entering the castle, Wamba exchanges clothes with Cedric who encounters Rebecca and Urfried.     Ch. 13 : Urfried recognises Cedric as a Saxon and, revealing herself as Ulrica, tells her story which involves Front-de-Bœuf murdering his father, who had killed her father and seven brothers when taking the castle, and had become her detested lover. She says she will give a signal when the time is ripe for storming the castle. Front-de-Bœuf sends the presumed friar with a message to summon reinforcements. Athelstane defies him, claiming that Rowena is his fiancée. The monk Ambrose arrives seeking help for Aymer who has been captured by Locksleys men.     Ch. 14 :     Ch. 15 : Rebecca describes the assault on Torquilstone to the wounded Ivanhoe, disagreeing with his exalted view of chivalry.     Ch. 16 : Front-de-Bœuf and De Bracy discuss how best to repel the besiegers. Ulrica sets fire to the castle and Front-de-Bœuf dies in the flames.         Ch. 1 : The Black Knight defeats De Bracy, making himself known to him as Richard, and rescues Ivanhoe. Bois-Guilbert rescues Rebecca, striking down Athelstane who thinks she is Rowena. Ulrica perishes in the flames after singing a wild pagan hymn.     Ch. 2 : Locksley supervises the orderly division of the spoil. Friar Tuck brings Isaac whom he has rescued and made captive, and engages in good-natured buffeting with the Black Knight.     Ch. 3 : Locksley arranges ransom terms for Isaac and Aymer.     Ch. 4 : De Bracy informs John that Richard is in England. Together with Fitzurse he threatens to desert John, but the prince responds cunningly.     Ch. 5 : At York, Nathan is horrified by Isaacs determination to seek Rebecca at Templestowe. At the priory Beaumanoir tells Mountfitchet that he intends to take a hard line with Templar irregularities. Arriving, Isaac shows him a letter from Aymer to Bois-Guilbert referring to Rebecca.     Ch. 6 : Beaumanoir tells Albert Malvoisin of his outrage at Rebeccas presence in the preceptory. Albert insists to Bois-Guilbert that her trial for sorcery must proceed. Mountfichet says he will seek evidence against her.     Ch. 7 : Rebecca is tried and found guilty. At Bois-Guilberts secret prompting she demands that a champion defend her in trial by combat.     Ch. 8 : Rebeccas demand is accepted, Bois-Guilbert being appointed champion for the prosecution. Bearing a message to her father, Higg meets him and Nathan on their way to the preceptory, and Isaac goes in search of Ivanhoe.     Ch. 9 : Rebecca rejects Bois-Guilberts offer to fail to appear for the combat in return for her love. Albert persuades him that it is in his interest to appear.     Ch. 10 : The Black Knight leaves Ivanhoe to travel to Coningsburgh castle for Athelstanes funeral, and Ivanhoe follows him the next day. The Black Knight is rescued by Locksley from an attack carried out by Fitzurse on Johns orders, and reveals his identity as Richard to his companions, prompting Locksley to identify himself as Robin Hood.     Ch. 11 : Richard talks to Ivanhoe and dines with the outlaws before Robin arranges a false alarm to put an end to the delay. The party arrive at Coningsburgh.     Ch. 12 : Richard procures Ivanhoes pardon from his father. Athelstane appears, not dead, giving his allegiance to Richard and surrendering Rowena to Ivanhoe.     Ch. 13 : Ivanhoe appears as Rebeccas champion, and Bois-Guilbert dies the victim of his contending passions.     Ch. 14 : Beaumanoir and his Templars leave Richard defiantly. Cedric agrees to the marriage of Ivanhoe and Rowena. Rebecca takes her leave of Rowena before her father and she leave England to make a new life under the tolerant King of Grenada.       Critics of the novel have treated it as a romance intended mainly to entertain boys. Ivanhoe maintains many of the elements of the ": null
    },
    {
        "Romance genre": "Romance Genre"
    },
    {
        ", including the quest, a chivalric setting, and the overthrowing of a corrupt social order to bring on a time of happiness.  Other critics assert that the novel creates a realistic and vibrant story, idealising neither the past nor its main character.        Scott treats themes similar to those of some of his earlier novels, like  Rob Roy  and  The Heart of Midlothian , examining the conflict between heroic ideals and modern society. In the latter novels, industrial society becomes the centre of this conflict as the backward Scottish nationalists and the advanced English have to arise from chaos to create unity. Similarly, the Normans in Ivanhoe, who represent a more sophisticated culture, and the Saxons, who are poor, disenfranchised, and resentful of Norman rule, band together and begin to mould themselves into one people. The conflict between the Saxons and Normans focuses on the losses both groups must experience before they can be reconciled and thus forge a united England. The particular loss is in the extremes of their own cultural values, which must be disavowed in order for the society to function. For the Saxons, this value is the final admission of the hopelessness of the Saxon cause. The Normans must learn to overcome the materialism and violence in their own codes of chivalry. Ivanhoe and Richard represent the hope of reconciliation for a unified future.     Ivanhoe, though of a more noble lineage than some of the other characters, represents a middling individual in the medieval class system who is not exceptionally outstanding in his abilities, as is expected of other quasi-historical fictional characters, such as the ": null
    },
    {
        "Greek hero": "Greek Hero"
    },
    {
        "es. Critic ": null
    },
    {
        "György Lukács": "György Lukács"
    },
    {
        " points to middling main characters like Ivanhoe in Sir Walter Scotts other novels as one of the primary reasons Scotts historical novels depart from previous historical works, and better explore social and cultural history.        The location of the novel is centred upon southern ": null
    },
    {
        "Yorkshire": "Yorkshire"
    },
    {
        " and northern ": null
    },
    {
        "Nottinghamshire": "Nottinghamshire"
    },
    {
        " in England. Castles mentioned within the story include ": null
    },
    {
        "Ashby de la Zouch Castle": "Ashby De La Zouch Castle"
    },
    {
        " , York  and Coningsburgh, which is based upon ": null
    },
    {
        "Conisbrough Castle": "Conisbrough Castle"
    },
    {
        ", in the ancient town of ": null
    },
    {
        "Conisbrough": "Conisbrough"
    },
    {
        " near ": null
    },
    {
        "Doncaster": "Doncaster"
    },
    {
        " . Reference is made within the story to ": null
    },
    {
        "York Minster": "York Minster"
    },
    {
        ", where the climactic wedding takes place, and to the Bishop of Sheffield, although the ": null
    },
    {
        "Diocese of Sheffield": "Diocese Of Sheffield"
    },
    {
        " did not exist at either the time of the novel or the time Scott wrote the novel and was not founded until 1914. Such references suggest that Robin Hood lived or travelled in the region.     Conisbrough is so dedicated to the story of Ivanhoe that many of its streets, schools, and public buildings are named after characters from the book.       The modern conception of Robin Hood as a cheerful, decent, patriotic rebel owes much to Ivanhoe.     Locksley becomes Robin Hoods title in the Scott novel, and it has been used ever since to refer to the legendary ": null
    },
    {
        "outlaw": "Outlaw"
    },
    {
        ". Scott appears to have taken the name from an anonymous ": null
    },
    {
        "manuscript": "Manuscript"
    },
    {
        " – written in 1600 – that employs Locksley as an epithet for Robin Hood. Owing to Scotts decision to make use of the manuscript, Robin Hood from Locksley has been transformed for all time into Robin of Locksley , alias Robin Hood.      Scott makes the 12th-centurys Saxon-Norman conflict a major theme in his novel. The original medieval ballads about Robin Hood did not mention any conflict between Saxons and Normans; it was Scott who introduced this theme into the legend. Siobhan Brownlie, Memory and Myths of the Norman Conquest.Woodbridge, Suffolk; Boydell & Brewer Ltd., 2013.  The characters in Ivanhoe refer to Prince John and King Richard I as Normans ; contemporary medieval documents from this period do not refer to either of these two rulers as Normans. Recent re-tellings of the story retain Scott emphasis on the Norman-Saxon conflict. Scott also shunned the late 16th-century depiction of Robin as a dispossessed nobleman . This, however, has not prevented Scott from making an important contribution to the noble-hero strand of the legend, too, because some subsequent motion picture treatments of Robin Hoods adventures give Robin traits that are characteristic of Ivanhoe as well. The most notable Robin Hood films are the lavish ": null
    },
    {
        "Douglas Fairbanks": "Douglas Fairbanks"
    },
    {
        " 1922 silent film": "Robin Hood"
    },
    {
        ", the 1938 triple Academy Award-winning ": null
    },
    {
        "Adventures of Robin Hood": "The Adventures Of Robin Hood"
    },
    {
        " with Errol Flynn as Robin , and the 1991 box-office success  Robin Hood: Prince of Thieves  with Kevin CostnerRowena and Marian, respectively": null
    },
    {
        "ilosoph": "Ilosoph"
    },
    {
        "pp. 825-6outside the aristocracy": null
    },
    {
        "Scotlands union with England in 1707": "Acts Of Union 1707"
    },
    {
        " – about the same length of time had elapsed before Scotts writing and the resurgence in his time of Scottish nationalism evidenced by the cult of ": null
    },
    {
        "Robert Burns": "Robert Burns"
    },
    {
        ", the famous poet who deliberately chose to work in Scots vernacular though he was an educated man and spoke modern English eloquently": null
    },
    {
        "nguisti": "Nguisti"
    },
    {
        "disguised as a monkNew York and London, 1972Edinburgh and London, 1943writing anonymously, like all the reviewers 195619842003manga20061913 U.S. film  1952 film": null
    },
    {
        "t": "T"
    },
    {
        "1965an Italian  peplum 1971an Italian  peplum Баллада о доблестном рыцаре Айвенго": null
    },
    {
        "58 TV seri": "58 Tv Seri"
    },
    {
        "70 TV seri": "70 Tv Seri"
    },
    {
        "1982 film1997 TV seriesentitled  Ivanhoe  Ivanhoé IvanhoéRebeccaRébeccaIl Templario Der Templer und die Jüdin an opera in which the music for a new text is chosen from pre-existent music by one or more composers2008": null
    }
]