[
    {
        "        Ivo Caprino was a ": null
    },
    {
        "Norwegian": "Norway"
    },
    {
        " film director and writer, best known for his ": null
    },
    {
        "puppet": "Puppet"
    },
    {
        " films. His most famous film is  Flåklypa Grand Prix  , made in 1975.             In the mid-1940s, Caprino helped his mother design puppets for a puppet theatre, which inspired him to try making a film using his mothers designs. The result of their collaboration was Tim og Tøffe, an 8-minute film released in 1949.     Several films followed in the next couple of years, including two 15-minute shorts that are still shown regularly in Norway today, Veslefrikk med Fela , based on a Norwegian folk tale, and Karius og Baktus, a story by ": null
    },
    {
        "Thorbjørn Egner": "Thorbjørn Egner"
    },
    {
        " of two little trolls, representing ": null
    },
    {
        "Caries": "Dental Caries"
    },
    {
        " and ": null
    },
    {
        "Bacterium": "Bacteria"
    },
    {
        ", living in a boys teeth. Ingeborg Gude made the puppets for these films as well, as she would continue to do up until her death in the mid sixties.     When making Tim og Tøffe, Caprino invented an ingenious method for controlling the puppets movements in real time. The technique can be described as a primitive, mechanical version of ": null
    },
    {
        "animatronics": "Audio-Animatronics"
    },
    {
        ".     Caprinos films received rave reviews, and he quickly became a celebrity in Norway. In particular, the public were fascinated with the secret technology used to make his films. When he switched to traditional ": null
    },
    {
        "stop motion": "Stop Motion"
    },
    {
        ", Caprino tried to maintain the impression that he was still using some kind of magic technology to make the puppets move, even though all his later films were made with traditional stop motion techniques.     In addition to the short films, Caprino produced dozens of advertising films with puppets. In 1959, he directed a live action feature film, Ugler i Mosen, which also contained stop motion sequences. He then embarked on his most ambitious project, a feature film about ": null
    },
    {
        "Peter Christen Asbjørnsen": "Peter Christen Asbjørnsen"
    },
    {
        ", who travelled around Norway in the 19th century collecting traditional folk tales.     The plan was to use live action for the sequences showing Asbjørnsen, and then to realise the folk tales using stop motion. Unfortunately, Caprino was unable to secure funding for the project, so he ended up making the planned folk tale sequences as separate 16-minute puppet films, bookended by live action sequences showing Asbjørnsen.     The Pinchcliffe Grand Prix   In 1970, Caprino and his small team of collaborators, started work on a 25 minutes TV special, which would eventually become  The Pinchcliffe Grand Prix . Based on a series of books by Norwegian cartoonist and author ": null
    },
    {
        "Kjell Aukrust": "Kjell Aukrust"
    },
    {
        ", it featured a group of eccentric characters all living in the small village of Pinchcliffe. The TV special was a collection of sketches based on Aukrusts books, with no real story line. After 1.5 years of work, it was decided that it didnt really work as a whole, so production on the TV special was stopped , and Caprino and Aukrust instead wrote a screenplay for a feature film using the characters and environments that had already been built.     The result was The Pinchcliffe Grand Prix, which stars Theodore Rimspoke  and his two assistants, Sonny Duckworth , a cheerful and optimistic bird, and Lambert , a nervous, pessimistic and melancholic hedgehog. Theodore works as a bicycle repairman, though he spends most of his time inventing weird ": null
    },
    {
        "Rube Goldberg": "Rube Goldberg"
    },
    {
        "-like contraptions. One day, the trio discover that one of Theodores former assistants, Rudolph Gore-Slimey , has stolen his design for a race car engine, and has become a world champion ": null
    },
    {
        "Formula One": "Formula One"
    },
    {
        " driver.     Sonny secures funding from an Arab oil sheik who happens to be vacationing in Pinchcliffe, and the trio then build a gigantic racing car,  Il Tempo Gigante   – a fabulous construction with two engines, radar and its own blood bank. Theodore then enters a race, and ends up winning, beating Gore-Slimey despite his attempts at sabotage.     The film was made in 3.5 years by a team of approximately 5 people. Caprino directed and animated, Bjarne Sandemose built the sets and the cars, and was in charge of the technical side, Ingeborg Riiser modeled the puppets and Gerd Alfsen made the costumes and props.     When it came out in 1975, The Pinchcliffe Grand Prix was an enormous success in Norway, selling 1 million tickets in its first year of release. It remains the biggest box office hit of all time in Norway and was also released in many other countries.     To help promote the film abroad, Caprino and Sandemose built a full-scale replica of Il Tempo Gigante that is legal for public roads, but is usually exposited at ": null
    },
    {
        "Hunderfossen Familiepark": "Hunderfossen Familiepark"
    },
    {
        ".          Except for some TV work in the late 1970s, Caprino made no more puppet films, focusing instead on creating attractions for the  Hunderfossen  theme park outside ": null
    },
    {
        "Lillehammer": "Lillehammer"
    },
    {
        " based on his folk tale movies, and making tourist films using a custom built multi camera setup of his own design that shoots 280 degrees panorama movies.       Caprino was the son of Italian furniture designer Mario Caprino and the artist Ingeborg Gude,  who was a granddaughter of the painter ": null
    },
    {
        "Hans Gude": "Hans Gude"
    },
    {
        ". He was born and died in ": null
    },
    {
        "Oslo": "Oslo"
    },
    {
        ", but lived all of his life at ": null
    },
    {
        "Snarøya": "Snarøya"
    },
    {
        " in ": null
    },
    {
        "Bærum": "Bærum"
    },
    {
        ". He died in 2001 after having lived several years with a cancer diagnosis.  ": null
    },
    {
        "Verdens Gang": "Verdens Gang"
    },
    {
        ", retrieved 9 January 2013 Since Caprinos death, his son Remo has had great success developing a computer game based on  Flåklypa Grand Prix .         Flåklypa Grand Prix   Gutten som kappåt med trollet   Sjuende far i huset   Papirdragen   1962  – ": null
    },
    {
        "Reveenka": "Reve-Enka"
    },
    {
        "   1961  – ": null
    },
    {
        "Askeladden og de gode hjelperne": "Askeladden Og De Gode Hjelperne"
    },
    {
        "  Ugler i mosen   Et hundeliv med meg   Den standhaftige tinnsoldat   Klatremus i knipe   Karius og Baktus   Veslefrikk med fela   Musikk på loftet/En dukkedrøm   Tim og Tøffe ": null
    }
]