[
    {
        "           Ivo Andrić  was a Yugoslav novelist, poet and ": null
    },
    {
        "short story": "short story"
    },
    {
        " writer who won the ": null
    },
    {
        "Nobel Prize in Literature": "nobel prize in literature"
    },
    {
        " in 42 His writings dealt mainly with life in his native ": null
    },
    {
        "Bosnia": "bosnia"
    },
    {
        " under ": null
    },
    {
        "Ottoman rule": "ottoman bosnia and herzegovina"
    },
    {
        ".     Born in ": null
    },
    {
        "Travnik": "travnik"
    },
    {
        " in ": null
    },
    {
        "Austrian-occupied Bosnia": "austro-hungarian rule in bosnia and herzegovina"
    },
    {
        ", Andrić attended high school in ": null
    },
    {
        "Sarajevo": "sarajevo"
    },
    {
        ", where he became an active member of several ": null
    },
    {
        "South Slav": "south slavs"
    },
    {
        " national youth organizations.   Following the ": null
    },
    {
        "assassination": "assassination of archduke franz ferdinand of austria"
    },
    {
        " of Archduke ": null
    },
    {
        "Franz Ferdinand": "archduke franz ferdinand of austria"
    },
    {
        " in June 42 Andrić was arrested and imprisoned by the Austro-Hungarian police, who suspected his involvement in the plot. As the authorities were unable to build a strong case against him, he spent much of the war under ": null
    },
    {
        "house arrest": "house arrest"
    },
    {
        ", only being released following a general amnesty for such cases in July 42 After the war, he studied South Slavic history and literature at universities in ": null
    },
    {
        "Zagreb": "zagreb"
    },
    {
        " and ": null
    },
    {
        "Graz": "graz"
    },
    {
        ", eventually attaining his ": null
    },
    {
        "Ph.D": "doctor of philosophy"
    },
    {
        " in Graz in 42 He worked in the diplomatic service of the ": null
    },
    {
        "Kingdom of Yugoslavia": "kingdom of yugoslavia"
    },
    {
        " from 42 to 42 and again from 42 to 42 In 42 he became Yugoslavias ambassador to ": null
    },
    {
        "Germany": "nazi germany"
    },
    {
        ", but his tenure ended in April 42 with the ": null
    },
    {
        "German-led invasion of his country": "invasion of yugoslavia"
    },
    {
        ". Shortly after the invasion, Andrić returned to German-occupied ": null
    },
    {
        "Belgrade": "belgrade"
    },
    {
        ". He lived quietly in a friends apartment for the duration of World War II, in conditions likened by some biographers to house arrest, and wrote some of his most important works, including  Na Drini ćuprija  .     Following the war, Andrić was named to a number of ceremonial posts in Yugoslavia, which had since come under communist rule. In 42 the ": null
    },
    {
        "Nobel Committee": "nobel committee"
    },
    {
        " awarded him the Nobel Prize in Literature, selecting him over writers such as ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        ", ": null
    },
    {
        "Robert Frost": "robert frost"
    },
    {
        ", ": null
    },
    {
        "John Steinbeck": "john steinbeck"
    },
    {
        " and ": null
    },
    {
        "E. M. Forster": "e. m. forster"
    },
    {
        ". The Committee cited the epic force with which he  ... traced themes and depicted human destinies drawn from his countrys history . Afterwards, Andrićs works found an international audience and were translated into a number of languages. In subsequent years, he received a number of awards in his native country. Andrićs health declined substantially in late 42 and he died in Belgrade the following March.     In the years following Andrićs death, the Belgrade apartment where he spent much of World War II was converted into a museum and a nearby street corner was named in his honour. A number of other cities in the former ": null
    },
    {
        "Yugoslavia": "yugoslavia"
    },
    {
        " also have streets bearing his name. In 42 filmmaker ": null
    },
    {
        "Emir Kusturica": "emir kusturica"
    },
    {
        " began construction of an ethno-town in eastern Bosnia that is ": null
    },
    {
        "named after Andrić": "andrićgrad"
    },
    {
        ". As Yugoslavias only Nobel Prize-winning writer, Andrić was well known and respected in his native country during his lifetime. In Bosnia and Herzegovina, beginning in the 42s and continuing past the ": null
    },
    {
        "breakup of Yugoslavia": "breakup of yugoslavia"
    },
    {
        ", his works have been disparaged by Bosniak literary critics for their supposed anti-Muslim bias. In Croatia, his works were long shunned for nationalist reasons, and even briefly blacklisted following Yugoslavias dissolution, but were rehabilitated by the literary community at the start of the 42st century. He is highly regarded in Serbia for his contributions to ": null
    },
    {
        "Serbian literature": "serbian literature"
    },
    {
        ".            Ivan Andrić was born in the village of ": null
    },
    {
        "Dolac": "dolac, travnik"
    },
    {
        ", near ": null
    },
    {
        "Travnik": "travnik"
    },
    {
        ", on 42 October 42 while his mother, Katarina , was in the town visiting relatives. Andrićs parents were both ": null
    },
    {
        "Catholic": "roman catholicism"
    },
    {
        " Croats": "croats"
    },
    {
        ". He was his parents only child. His father, Antun, was a struggling ": null
    },
    {
        "silversmith": "silversmith"
    },
    {
        " who resorted to working as a school janitor in ": null
    },
    {
        "Sarajevo": "sarajevo"
    },
    {
        ", where he lived with his wife and infant son. At the age of 42 Antun died of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        ", like most of his siblings. Andrić was only two years old at the time. Widowed and penniless, Andrićs mother took him to ": null
    },
    {
        "Višegrad": "višegrad"
    },
    {
        " and placed him in the care of her sister-in-law Ana and brother-in-law Ivan Matković, a police officer. The couple were financially stable but childless, so they agreed to look after the infant and brought him up as their own. Meanwhile, Andrićs mother returned to Sarajevo seeking employment.     Andrić was raised in a country that had changed little since the ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " period despite being ": null
    },
    {
        "mandated to Austria-Hungary": "austro-hungarian rule in bosnia and herzegovina"
    },
    {
        " at the ": null
    },
    {
        "Congress of Berlin": "congress of berlin"
    },
    {
        " in 42 Eastern and Western culture intermingled in Bosnia to a far greater extent than anywhere else in the Balkan peninsula. Having lived there from an early age, Andrić came to cherish Višegrad, calling it my real home . Though it was a small provincial town , Višegrad proved to be an enduring source of inspiration. It was a multi-ethnic and multi-confessional town, the predominant groups being ": null
    },
    {
        "Serbs": "serbs"
    },
    {
        " and ": null
    },
    {
        "Bosnian Muslims": "bosniaks"
    },
    {
        " . From an early age, Andrić closely observed the customs of the local people. These customs, and the particularities of life in eastern ": null
    },
    {
        "Bosnia": "bosnia"
    },
    {
        ", would later be detailed in his works. Andrić made his first friends in Višegrad, playing with them along the ": null
    },
    {
        "Drina": "drina"
    },
    {
        " River and the towns famous ": null
    },
    {
        "Mehmed Paša Sokolović Bridge": "mehmed paša sokolović bridge"
    },
    {
        ".       At age six, Andrić began ": null
    },
    {
        "primary school": "primary school"
    },
    {
        ". He later recounted that these were the happiest days of his life. At the age of ten, he received a three-year ": null
    },
    {
        "scholarship": "scholarship"
    },
    {
        " from a Croat cultural group called Napredak to study in Sarajevo. In the autumn of 42 he was registered at the Great Sarajevo Gymnasium , the oldest ": null
    },
    {
        "secondary school": "secondary school"
    },
    {
        " in Bosnia. While in Sarajevo, Andrić lived with his mother, who worked in a rug factory. At the time, the city was overflowing with civil servants from all parts of Austria-Hungary, and thus many languages could be heard in its restaurants, cafés and on its streets. Culturally, the city boasted a strong Germanic element, and the curriculum in educational institutions was designed to reflect this. From a total of 42 teachers that worked at Andrićs school over a twenty-year period, only three were natives of Bosnia and Herzegovina. The teaching program, biographer Celia Hawkesworth notes, was devoted to producing dedicated supporters of the Monarchy. Andrić disapproved. All that came  ... at secondary school and university, he wrote, was rough, crude, automatic, without concern, faith, humanity, warmth or love.      Andrić experienced difficulty in his studies, finding mathematics particularly challenging, and had to repeat the sixth grade. For a time, he lost his scholarship due to poor grades. Hawkesworth attributes Andrićs initial lack of academic success at least partly to his alienation from most of his teachers. Nonetheless, he excelled in languages, particularly Latin, Greek and German. Although he initially showed substantial interest in natural sciences, he later began focusing on literature, likely under the influence of his two Croat instructors, writer and politician ": null
    },
    {
        "Đuro Šurmin": "đuro šurmin"
    },
    {
        " and poet . Of all his teachers in Sarajevo, Andrić liked Alaupović best, and the two became lifelong friends.     Andrić felt he was destined to become a writer. He began writing in secondary school, but received little encouragement from his mother. He recalled that when he showed her one of his first works, she replied: Did you write this? What did you do that for?  Andrić published his first two poems in 42 in a journal called Bosanska vila , which promoted Serbo-Croat unity. At the time, he was still a secondary school student. Prior to ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", his poems, essays, reviews, and translations appeared in journals such as Vihor , Savremenik , Hrvatski pokret , and Književne novine . One of Andrićs favorite literary forms was ": null
    },
    {
        "lyrical reflective prose": "prose poetry"
    },
    {
        ", and many of his essays and shorter pieces are prose poems. The historian ": null
    },
    {
        "Wayne S. Vucinich": "wayne s. vucinich"
    },
    {
        " describes Andrićs poetry from this period as subjective and mostly melancholic . Andrićs translations of ": null
    },
    {
        "August Strindberg": "august strindberg"
    },
    {
        ", ": null
    },
    {
        "Walt Whitman": "walt whitman"
    },
    {
        ", and a number of Slovene authors also appeared around this time.            In 42 Austria-Hungary officially ": null
    },
    {
        "annexed": "bosnian crisis"
    },
    {
        " Bosnia and Herzegovina, to the chagrin of South Slav nationalists like Andrić. In late 42 Andrić was elected the first president of the Serbo-Croat Progressive Movement , a Sarajevo-based secret society that promoted unity and friendship between Serb and Croat youth and opposed the Austro-Hungarian occupation. Its members were vehemently criticized by both Serb and Croat nationalists, who dismissed them as traitors to their nations . Unfazed, Andrić continued agitating against the Austro-Hungarians. On 42 February 42 he spoke before a crowd of 42 student protesters at Sarajevos railway station, urging them to continue their demonstrations. The Austro-Hungarian police later began harassing and prosecuting SHNO members. Ten were expelled from their schools or penalized in some other way, though Andrić himself escaped punishment. Andrić also joined the South Slav student movement known as ": null
    },
    {
        "Young Bosnia": "young bosnia"
    },
    {
        ", becoming one of its most prominent members.     In 42 Andrić registered at the ": null
    },
    {
        "University of Zagreb": "university of zagreb"
    },
    {
        ", having received a scholarship from an educational foundation in Sarajevo. He enrolled in the department of mathematics and natural sciences because these were the only fields for which scholarships were offered, but was able to take some courses in Croatian literature. Andrić was well received by South Slav nationalists there, and regularly participated in on-campus demonstrations. This led to his being reprimanded by the university. In 42 after completing two semesters in Zagreb, Andrić transferred to the University of Vienna, where he resumed his studies. While in Vienna, he joined South Slav students in promoting the cause of Yugoslav unity and worked closely with two Yugoslav student societies, the Serbian cultural society Zora and the Croatian student club Zvonimir, which shared his views on integral Yugoslavism .     Despite finding like-minded students in Vienna, the citys climate took a toll on Andrićs health. He contracted tuberculosis and became seriously ill, then asked to leave Vienna on medical grounds and continue his studies elsewhere, though Hawkesworth believes he may actually have been taking part in a protest of South Slav students that were boycotting German-speaking universities and transferring to Slavic ones. For a time, Andrić had considered transferring to a school in Russia but ultimately decided to complete his fourth semester at ": null
    },
    {
        "Jagiellonian University": "jagiellonian university"
    },
    {
        " in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ". He transferred in early 42 and continued to publish translations, poems and reviews.            On 42 June 42 Andrić learned of the ": null
    },
    {
        "assassination": "assassination of archduke franz ferdinand of austria"
    },
    {
        " of Archduke ": null
    },
    {
        "Franz Ferdinand": "archduke franz ferdinand of austria"
    },
    {
        " in Sarajevo. The assassin was ": null
    },
    {
        "Gavrilo Princip": "gavrilo princip"
    },
    {
        ", a Young Bosnian and close friend of Andrić who had been one of the first to join the SHNO in 42 Upon hearing the news, Andrić decided to leave Kraków and return to Bosnia. He travelled by train to Zagreb, and in mid-July, departed for the coastal city of ": null
    },
    {
        "Split": "split, croatia"
    },
    {
        " with his friend, the poet and fellow South Slav nationalist ": null
    },
    {
        "Vladimir Čerina": ":hr:vladimir čerina"
    },
    {
        ". Andrić and Čerina spent the rest of July at the latters summer home. As the month progressed, the two became increasingly uneasy about the ": null
    },
    {
        "escalating political crisis": "july crisis"
    },
    {
        " that followed the Archdukes assassination and eventually led to the outbreak of World War I. They then went to ": null
    },
    {
        "Rijeka": "rijeka"
    },
    {
        ", where Čerina left Andrić without explanation, only saying he urgently needed to go to Italy. Several days later, Andrić learned that Čerina was being sought by the police.     By the time war was declared, Andrić had returned to Split feeling exhausted and ill. Given that most of his friends had already been arrested for nationalist activities, he was certain the same fate would befall him. Despite not being involved in the assassination plot, in late July or early August, Andrić was arrested for anti-state activities , and imprisoned in Split. He was subsequently transferred to a prison in ": null
    },
    {
        "Šibenik": "šibenik"
    },
    {
        ", then to Rijeka and finally to ": null
    },
    {
        "Maribor": "maribor"
    },
    {
        ", where he arrived on 42 August. Plagued by tuberculosis, Andrić passed the time reading, talking to his cellmates and learning languages.     By the following year, the case against Andrić was dropped due to lack of evidence, and he was released from prison on 42 March 42 The authorities exiled him to the village of ": null
    },
    {
        "Ovčarevo": "ovčarevo"
    },
    {
        ", near Travnik. He arrived there on 42 March and was placed under the supervision of local ": null
    },
    {
        "Franciscan": "franciscan"
    },
    {
        " friars. Andrić soon befriended the ": null
    },
    {
        "friar": "friar"
    },
    {
        " Alojzije Perčinlić and began researching the history of Bosnias Catholic and Orthodox Christian communities under Ottoman rule. Andrić lived in the parish headquarters, and the Franciscans gave him access to the monastery chronicles. In return, he assisted the parish priest and taught religious songs to pupils at the monastery school. Andrićs mother soon came to visit him and offered to serve as the parish priests housekeeper. Mother is very happy, Andrić wrote. It has been three whole years since she saw me. And she cant grasp all that has happened to me in that time, nor the whole of my crazy, cursed existence. She cries, kisses me and laughs in turn. Like a mother.      Andrić was later transferred to a prison in ": null
    },
    {
        "Zenica": "zenica"
    },
    {
        ", where Perčinlić regularly visited him. The ": null
    },
    {
        "Austro-Hungarian Army": "austro-hungarian army"
    },
    {
        " declared Andrić a political threat in March 42 and exempted him from armed service. He was thus registered with a non-combat unit until February of the following year. On 42 July 42 Emperor ": null
    },
    {
        "Charles": "charles i of austria"
    },
    {
        " declared a general amnesty for all of Austria-Hungarys political prisoners. His freedom of movement restored, Andrić visited Višegrad and reunited with several of his school friends. He remained in Višegrad until late July, when he was mobilized. Because of his poor health, Andrić was admitted to a Sarajevo hospital and thus avoided service. He was then transferred to the Reservospital in Zenica, where he received treatment for several months before continuing to Zagreb. There, Andrić again fell seriously ill and sought treatment at the Sisters of Mercy hospital, which had become a gathering place for dissidents and former political prisoners.     In January 42 Andrić joined several South Slav nationalists in editing a short-lived pan-Yugoslav periodical called Književni jug . Here and in other periodicals, Andrić published book reviews, plays, verse, and translations. Over the course of several months in early 42 Andrićs health began to deteriorate, and his friends believed he was nearing death. However, he recovered and spent the spring of 42 in ": null
    },
    {
        "Krapina": "krapina"
    },
    {
        " writing Ex ponto, a book of prose poetry that was published in July. It was his first book.       The end of World War I saw the disintegration of Austria-Hungary, which was replaced by a newly established South Slav state, the ": null
    },
    {
        "Kingdom of Serbs, Croats and Slovenes": "kingdom of yugoslavia"
    },
    {
        " . In late 42 Andrić re-enrolled at the University of Zagreb and resumed his studies. By January 42 he fell ill again and was back in the hospital. Fellow writer ": null
    },
    {
        "Ivo Vojnović": "ivo vojnović"
    },
    {
        " became worried for his friends life and appealed to Andrićs old schoolteacher Tugomir Alaupović to use his connections and help Andrić pay for treatment abroad. In February, Andrić wrote Alaupović and asked for help finding a government job in Belgrade. Eventually, Andrić chose to seek treatment in Split, where he stayed for the following six months. During his time on the ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        " coast, Andrić completed a second volume of prose poetry, titled Nemiri , which was published the following year. By the time Andrić left, he had almost fully recovered, and quipped that he was cured by the air, sun and figs.  Troubled by news that his uncle was seriously ill, Andrić left Split in August and went to him in Višegrad. He returned to Zagreb two weeks later.          In the immediate aftermath of the war, Andrićs tendency to identify with Serbdom became increasingly apparent. In a correspondence dated December 42 Vojnović described the young writer as a Catholic  ... a Serb from Bosnia.  By 42 Andrić had acquired his undergraduate degree in South Slavic history and literature at the University of Zagreb. He was perennially impoverished, and earned a meagre sum through his writing and editorial work. By mid42 he realized that he would be unable to financially support himself and his aging mother, aunt and uncle for much longer, and his appeals to Alaupović for help securing a government job became more frequent. In September 42 Alaupović offered him a secretarial position at the Ministry of Religion, which Andrić accepted.     In late October, Andrić left for ": null
    },
    {
        "Belgrade": "belgrade"
    },
    {
        ". He became involved in the citys literary circles and soon acquired the distinction of being one of Belgrades most popular young writers. Though the Belgrade press wrote positively of him, Andrić disliked being a public figure, and went into seclusion and distanced himself from his fellow writers. At the same time, he grew dissatisfied with his government job and wrote to Alaupović asking for a transfer to the ": null
    },
    {
        "Ministry of Foreign Affairs": "ministry of foreign affairs"
    },
    {
        ". On 42 February, Andrićs request was granted and he was assigned to the Foreign Ministrys mission at the ": null
    },
    {
        "Vatican": "holy see"
    },
    {
        ".     Andrić left Belgrade soon after, and reported for duty in late February. At this time, he published his first short story, Put Alije Đerzeleza . He complained that the consulate was understaffed and that he did not have enough time to write. All evidence suggests he had a strong distaste for the ceremony and pomp that accompanied his work in the diplomatic service, but according to Hawkesworth, he endured it with dignified good grace . Around this time, he began writing in the ": null
    },
    {
        "Ekavian dialect": "shtokavian dialectthe yat reflexes"
    },
    {
        " used in Serbia, and ceased writing in the Ijekavian dialect used in his native Bosnia. Andrić soon requested another assignment, and in November, he was transferred to ": null
    },
    {
        "Bucharest": "bucharest"
    },
    {
        ". Once again, his health deteriorated. Nevertheless, Andrić found his consular duties there did not require much effort, so he focused on writing, contributed articles to a Romanian journal and even had time to visit his family in Bosnia. In 42 Andrić requested another reassignment. He was transferred to the consulate in ": null
    },
    {
        "Trieste": "trieste"
    },
    {
        ", where he arrived on 42 December. The citys damp climate only caused Andrićs health to deteriorate further, and on his doctors advice, he transferred to ": null
    },
    {
        "Graz": "graz"
    },
    {
        " in January 42 He arrived in the city on 42 January, and was appointed vice-consul. Andrić soon enrolled at the ": null
    },
    {
        "University of Graz": "university of graz"
    },
    {
        ", resumed his schooling and began working on his doctoral dissertation in ": null
    },
    {
        "Slavic studies": "slavic studies"
    },
    {
        ".            In August 42 Andrić experienced an unexpected career setback. A law had been passed stipulating that all civil servants had to have a doctoral degree. As Andrić had not completed his dissertation, he was informed that his employment would be terminated. Andrićs well-connected friends intervened on his behalf and appealed to Foreign Minister ": null
    },
    {
        "Momčilo Ninčić": "momčilo ninčić"
    },
    {
        ", citing Andrićs diplomatic and linguistic abilities. In February 42 the Foreign Ministry decided to retain Andrić as a day worker with the salary of a vice-consul. This gave him the opportunity to complete his ": null
    },
    {
        "Ph.D": "doctor of philosophy"
    },
    {
        ". Three months later, on 42 May, Andrić submitted his dissertation to a committee of examiners at the University of Graz, who gave it their approval. This allowed Andrić to take the examinations necessary for his Ph.D to be confirmed. He passed both his exams, and on 42 July, received his Ph.D. The committee of examiners recommended that Andrićs dissertation be published. Andrić chose the title Die Entwicklung des geistigen Lebens in Bosnien unter der Einwirkung der türkischen Herrschaft . In it, he characterized the Ottoman occupation as ": null
    },
    {
        "a yoke": ":wikt:under the yoke"
    },
    {
        " that still loomed over Bosnia. The effect of Turkish rule was absolutely negative, he wrote. The Turks could bring no cultural content or sense of higher mission, even to those ": null
    },
    {
        "South Slavs who accepted Islam": "south slavic muslims"
    },
    {
        ".      Several days after receiving his Ph.D, Andrić wrote the Foreign Minister asking to be reinstated and submitted a copy of his dissertation, university documents and a medical certification that deemed him to be in good health. In September, the Foreign Ministry granted his request. Andrić stayed in Graz until 42 October, when he was assigned to the Foreign Ministrys Belgrade headquarters. During the two years he was in Belgrade, Andrić spent much of his time writing. His first collection of short stories was published in 42 and he received a prize from the Serbian Royal Academy . In October 42 he was assigned to the consulate in ": null
    },
    {
        "Marseille": "marseille"
    },
    {
        " and again appointed vice-consul. On 42 December 42 he was transferred to the Yugoslav embassy in Paris. Andrićs time in France was marked by increasing loneliness and isolation. His uncle had died in 42 his mother the following year, and upon arriving in France, he was informed that his aunt had died as well. Apart from official contacts, he wrote Alaupović, I have no company whatever.  Andrić spent much of his time in the Paris archives poring over the reports of the French consulate in Travnik between 42 and 42 material he would use in Travnička hronika , one of his future novels.     In April 42 Andrić was posted to ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        " as vice-consul. While there, he wrote essays on ": null
    },
    {
        "Simón Bolívar": "simón bolívar"
    },
    {
        " and ": null
    },
    {
        "Francisco Goya": "francisco goya"
    },
    {
        ", and began work on the novel Prokleta avlija . In June 42 he was named secretary of the Yugoslav ": null
    },
    {
        "legation": "legation"
    },
    {
        " to Belgium and ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        " in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ". On 42 January 42 he was sent to Switzerland as part of Yugoslavias permanent delegation to the ": null
    },
    {
        "League of Nations": "league of nations"
    },
    {
        " in ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        ", and was named deputy delegate the following year. In 42 Andrić returned to Belgrade; two years later, he was named head of the political department of the Ministry of Foreign Affairs. On 42 November 42 Andrić became assistant to ": null
    },
    {
        "Milan Stojadinović": "milan stojadinović"
    },
    {
        ", Yugoslavias ": null
    },
    {
        "Prime Minister": "prime minister of yugoslavia"
    },
    {
        " and Foreign Minister. That year, France decorated him with the Order of the Grand Officer of the ": null
    },
    {
        "Legion of Honour": "legion of honour"
    },
    {
        ".            Andrić was appointed Yugoslavias ambassador to ": null
    },
    {
        "Germany": "nazi germany"
    },
    {
        " in late March or early April 42 This appointment, Hawkesworth writes, shows that he was highly regarded by his countrys leadership. Yugoslavias King ": null
    },
    {
        "Alexander": "alexander i of yugoslavia"
    },
    {
        " had been assassinated in ": null
    },
    {
        "Marseille": "marseille"
    },
    {
        " in 42 He was succeeded by his ten-year-old son ": null
    },
    {
        "Peter": "peter ii of yugoslavia"
    },
    {
        ", and a regency council led by Peters uncle ": null
    },
    {
        "Paul": "prince paul of yugoslavia"
    },
    {
        " was established to rule in his place until he turned 42 Pauls government established closer economic and political ties with Germany. In March 42 Yugoslavia signed the ": null
    },
    {
        "Tripartite Pact": "tripartite pact"
    },
    {
        ", pledging support for Germany and Italy. Though the negotiations had occurred behind Andrićs back, in his capacity as ambassador he was obliged to attend the documents signing in Berlin. Andrić had previously been instructed to delay agreeing to the Axis powers demands for as long as possible. He was highly critical of the move, and on 42 March, wrote to the Ministry of Foreign Affairs asking to be relieved of his duties. Ten days later, a group of pro-Western ": null
    },
    {
        "Royal Yugoslav Air Force": "royal yugoslav air force"
    },
    {
        " officers ": null
    },
    {
        "overthrew": "yugoslav coup détat"
    },
    {
        " the regency and proclaimed Peter of age. This led to a breakdown in relations with Germany and prompted ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " to order Yugoslavias ": null
    },
    {
        "invasion": "invasion of yugoslavia"
    },
    {
        ". Given these circumstances, Andrićs position was an extremely difficult one. Nevertheless, he used the little influence he had and attempted unsuccessfully to assist Polish prisoners following the German ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        " in September 42     Prior to their invasion of his country, the Germans had offered Andrić the opportunity to evacuate to neutral Switzerland. He declined on the basis that his staff would not be allowed to go with him. On 42 April 42 the Germans and their allies invaded Yugoslavia. The country capitulated on 42 April and was subsequently partitioned between the Axis powers. In early June, Andrić and his staff were taken back to German-occupied Belgrade, where some were jailed. Andrić was retired from the diplomatic service, but refused to receive his pension or cooperate in any way with the puppet government that the Germans had installed in Serbia. He was spared jail, but the Germans kept him under close surveillance throughout the occupation. Because of his Croat heritage, they had offered him the chance to settle in Zagreb, then the capital of the ": null
    },
    {
        "fascist": "fascist"
    },
    {
        " puppet state": "puppet state"
    },
    {
        " known as the ": null
    },
    {
        "Independent State of Croatia": "independent state of croatia"
    },
    {
        ", but he declined. Andrić spent the following three years in a friends Belgrade apartment in conditions that some biographers liken to ": null
    },
    {
        "house arrest": "house arrest"
    },
    {
        ". In August 42 the puppet authorities in German-occupied Serbia issued the ": null
    },
    {
        "Appeal to the Serbian Nation": "appeal to the serbian nation"
    },
    {
        ", calling upon the countrys inhabitants to abstain from the ": null
    },
    {
        "communist": "communism"
    },
    {
        "-led rebellion against the Germans; Andrić refused to sign. He directed most of his energies towards writing, and during this time completed two of his best known novels,  Na Drini ćuprija   and Travnička hronika.     In mid42 Andrić sent a message of sympathy to ": null
    },
    {
        "Draža Mihailović": "draža mihailović"
    },
    {
        ", the leader of the royalist ": null
    },
    {
        "Chetniks": "chetniks"
    },
    {
        ", one of two resistance movements vying for power in Axis-occupied Yugoslavia, the other being ": null
    },
    {
        "Josip Broz Tito": "josip broz tito"
    },
    {
        "s communist ": null
    },
    {
        "Partisans": "yugoslav partisans"
    },
    {
        ". In 42 Andrić was forced to leave his friends apartment during the ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " bombing": "allied bombing of yugoslavia in world war ii"
    },
    {
        " of Belgrade and evacuate the city. As he joined a column of refugees, he became ashamed that he was fleeing by himself, in contrast to the masses of people accompanied by their children, spouses and infirm parents. I looked myself up and down, he wrote, and saw I was saving only myself and my overcoat. In the ensuing months, Andrić refused to leave the apartment, even during the heaviest bombing. That October, the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " and the Partisans drove the Germans out of Belgrade, and Tito proclaimed himself Yugoslavias ruler.            Andrić initially had a precarious relationship with the communists because he had previously been an official in the royalist government. He returned to public life only once the Germans had been forced out of Belgrade. Na Drini ćuprija was published in March 42 It was followed by Travnička hronika that September and Gospođica  that November. Na Drini ćuprija came to be regarded as Andrićs  magnum opus  and was proclaimed a classic of Yugoslav literature by the communists. It chronicles the history of the Mehmed Paša Sokolović Bridge and the town of Višegrad from the bridges construction in the 42th century until the outbreak of World War I. The second novel, Travnička hronika, follows a French diplomat in Bosnia during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ". The third, Gospođica, revolves around the life of a Sarajevan woman. In the post-war period, Andrić also published several short story collections, some travel memoirs, and a number of essays on writers such as ": null
    },
    {
        "Vuk Karadžić": "vuk karadžić"
    },
    {
        ", ": null
    },
    {
        "Petar II Petrović-Njegoš": "petar ii petrović-njegoš"
    },
    {
        ", and ": null
    },
    {
        "Petar Kočić": "petar kočić"
    },
    {
        ".     In November 42 Andrić was elected vice-president of the Society for the Cultural Cooperation of Yugoslavia with the Soviet Union. The same month, he was named president of the Yugoslav Writers Union. The following year, he became a member of the Peoples Assembly of Bosnia and Herzegovina. In 42 Andrić published a collection of short stories he had written during the war. His work came to influence writers such as ": null
    },
    {
        "Branko Ćopić": "branko ćopić"
    },
    {
        ", ": null
    },
    {
        "Vladan Desnica": "vladan desnica"
    },
    {
        ", ": null
    },
    {
        "Mihailo Lalić": "mihailo lalić"
    },
    {
        " and ": null
    },
    {
        "Meša Selimović": "meša selimović"
    },
    {
        ". In April 42 Andrić became a deputy in the ": null
    },
    {
        "National Assembly of Yugoslavia": "parliament of yugoslavia"
    },
    {
        ". He was decorated by the Presidium of the National Assembly for his services to the Yugoslav people in 42 In 42 his career as a parliamentary deputy came to an end. The following year, Andrić published the ": null
    },
    {
        "novella": "novella"
    },
    {
        " Prokleta avlija , which tells of life in an Ottoman prison in ": null
    },
    {
        "Istanbul": "istanbul"
    },
    {
        ". That December, he was admitted into the ": null
    },
    {
        "League of Communists of Yugoslavia": "league of communists of yugoslavia"
    },
    {
        ", the countrys ruling party. According to Hawkesworth, it is unlikely he joined the party out of ideological conviction, but rather to serve his country as fully as possible .     On 42 September 42 the 42-year-old Andrić married Milica Babić, a costume designer at the ": null
    },
    {
        "National Theatre of Serbia": "national theatre of serbia"
    },
    {
        " who was almost twenty years his junior. Earlier, he had announced it was probably better that a writer never marry. He was perpetually persecuted by a kind of fear, a close friend recalled. It seemed as though he had been born afraid, and that is why he married so late. He simply did not dare enter that area of life.           By the late 42s, Andrićs works had been translated into a number of languages. On 42 October 42 he was awarded the ": null
    },
    {
        "Nobel Prize in Literature": "nobel prize in literature"
    },
    {
        " by the ": null
    },
    {
        "Swedish Academy": "swedish academy"
    },
    {
        ". Documents released 42 years later revealed that the ": null
    },
    {
        "Nobel Committee": "nobel committee"
    },
    {
        " had selected Andrić over writers such as ": null
    },
    {
        "J.R.R. Tolkien": "j.r.r. tolkien"
    },
    {
        ", ": null
    },
    {
        "Robert Frost": "robert frost"
    },
    {
        ", ": null
    },
    {
        "John Steinbeck": "john steinbeck"
    },
    {
        " and ": null
    },
    {
        "E.M. Forster": "e.m. forster"
    },
    {
        ". The Committee cited the epic force with which he has traced themes and depicted human destinies drawn from his countrys history . Once the news was announced, Andrićs Belgrade apartment was swarmed by reporters, and he publicly thanked the Nobel Committee for selecting him as the winner of that years prize. Andrić donated the entirety of his prize money, which amounted to some 42 million ": null
    },
    {
        "dinar": "yugoslav dinar"
    },
    {
        "s, and prescribed that it be used to purchase library books in Bosnia and Herzegovina.     The Nobel Prize ensured Andrić received global recognition. The following March, he fell ill while on a trip to ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " and had to return to Belgrade for an operation. He was obliged to cancel all promotional events in Europe and North America, but his works continued to be reprinted and translated into numerous languages. Judging by letters he wrote at the time, Andrić felt burdened by the attention but did his best not to show it publicly. Upon receiving the Nobel Prize, the number of awards and honours bestowed upon him multiplied. He received the Order of the Republic in 42 as well as 42 July Award of Bosnia-Herzegovina, the ": null
    },
    {
        "AVNOJ": "anti-fascist council for the national liberation of yugoslavia"
    },
    {
        " Award in 42 and the ": null
    },
    {
        "Order of the Hero of Socialist Labour": "order of the hero of socialist labour"
    },
    {
        " in 42 In addition to being a member of the ": null
    },
    {
        "Yugoslav": "croatian academy of sciences and arts"
    },
    {
        " and ": null
    },
    {
        "Serbian": "serbian academy of sciences and arts"
    },
    {
        " academies of sciences and arts, he also became a correspondent of their ": null
    },
    {
        "Bosnian": "academy of sciences and arts of bosnia and herzegovina"
    },
    {
        " and ": null
    },
    {
        "Slovenian": "slovenian academy of sciences and arts"
    },
    {
        " counterparts, and received honorary doctorates from the universities of ": null
    },
    {
        "Belgrade": "university of belgrade"
    },
    {
        ", ": null
    },
    {
        "Sarajevo": "university of sarajevo"
    },
    {
        " and Kraków.     Andrićs wife died on 42 March 42 His health deteriorated steadily and he travelled little in his final years. He continued to write until 42 when his health took another turn for the worse. In December 42 he was admitted to a Belgrade hospital. He soon fell into a coma, and died in the ": null
    },
    {
        "Military Medical Academy": "military medical academy"
    },
    {
        " at 42:42  a.m. on 42 March 42 aged 42 His remains were cremated, and on 42 April, the ": null
    },
    {
        "urn": "urn"
    },
    {
        " containing his ashes was buried at the Alley of Distinguished Citizens in Belgrades ": null
    },
    {
        "New Cemetery": "new cemetery, belgrade"
    },
    {
        ". The ceremony was attended by about 42 residents of Belgrade.          Andrić was an avid reader in his youth. The young Andrićs literary interests varied greatly, ranging from the Greek and Latin ": null
    },
    {
        "Classics": "classics"
    },
    {
        " to the works of past and contemporary literary figures, including German and Austrian writers such as ": null
    },
    {
        "Johann Wolfgang von Goethe": "johann wolfgang von goethe"
    },
    {
        ", ": null
    },
    {
        "Heinrich Heine": "heinrich heine"
    },
    {
        ", ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        ", ": null
    },
    {
        "Franz Kafka": "franz kafka"
    },
    {
        ", ": null
    },
    {
        "Rainer Maria Rilke": "rainer maria rilke"
    },
    {
        " and ": null
    },
    {
        "Thomas Mann": "thomas mann"
    },
    {
        ", the French writers ": null
    },
    {
        "Michel de Montaigne": "michel de montaigne"
    },
    {
        ", ": null
    },
    {
        "Blaise Pascal": "blaise pascal"
    },
    {
        ", ": null
    },
    {
        "Gustave Flaubert": "gustave flaubert"
    },
    {
        ", ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        " and ": null
    },
    {
        "Guy de Maupassant": "guy de maupassant"
    },
    {
        ", and the British writers ": null
    },
    {
        "Thomas Carlyle": "thomas carlyle"
    },
    {
        ", ": null
    },
    {
        "Walter Scott": "walter scott"
    },
    {
        " and ": null
    },
    {
        "Joseph Conrad": "joseph conrad"
    },
    {
        ". Andrić also read the works of the Spanish writer ": null
    },
    {
        "Miguel de Cervantes": "miguel de cervantes"
    },
    {
        ", the Italian poet and philosopher ": null
    },
    {
        "Giacomo Leopardi": "giacomo leopardi"
    },
    {
        ", the Russian writer ": null
    },
    {
        "Nikolay Chernyshevsky": "nikolay chernyshevsky"
    },
    {
        ", the Norwegian writer ": null
    },
    {
        "Henrik Ibsen": "henrik ibsen"
    },
    {
        ", the American writers ": null
    },
    {
        "Walt Whitman": "walt whitman"
    },
    {
        " and ": null
    },
    {
        "Henry James": "henry james"
    },
    {
        ", and the Czechoslovak philosopher ": null
    },
    {
        "Tomáš Garrigue Masaryk": "tomáš garrigue masaryk"
    },
    {
        ". Andrić was especially fond of Polish literature, and later stated that it had greatly influenced him. He held several Serb writers in high esteem, particularly Karadžić, Njegoš, Kočić and ": null
    },
    {
        "Aleksa Šantić": "aleksa šantić"
    },
    {
        ". Andrić also admired the Slovene poets ": null
    },
    {
        "Fran Levstik": "fran levstik"
    },
    {
        ", ": null
    },
    {
        "Josip Murn": "josip murn"
    },
    {
        " and ": null
    },
    {
        "Oton Župančič": "oton župančič"
    },
    {
        ", and translated some of their works. Kafka appears to have had a significant influence on Andrićs prose, and his philosophical outlook was informed strongly by the works of Danish philosopher ": null
    },
    {
        "Søren Kierkegaard": "søren kierkegaard"
    },
    {
        ". At one point in his youth, Andrić even took an interest in Chinese and Japanese literature.     Much of Andrićs work was inspired by the traditions and peculiarities of life in Bosnia, and examines the complexity and cultural contrasts of the regions Muslim, Serb and Croat inhabitants. His two best known novels, Na Drini ćuprija and Travnička hronika, subtly contrast Ottoman Bosnias oriental propensities to the Western atmosphere first introduced by the French and later the Austro-Hungarians. His works contain many words of Turkish, Arabic or Persian origin that found their way into the languages of the South Slavs during Ottoman rule. According to Vucinich, Andrić uses these words to express oriental nuances and subtleties that cannot be rendered as well in his own Serbo-Croatian .     In the opinion of literary historian ": null
    },
    {
        "Nicholas Moravcevich": "nikola moravčević"
    },
    {
        ", Andrićs work frequently betrays his profound sadness over the misery and waste inherent in the passing of time . Na Drini ćuprija remains his most famous novel and has received the most scholarly analysis of all his works. Most scholars have interpreted the eponymous bridge as a ": null
    },
    {
        "metonym": "metonym"
    },
    {
        " for Yugoslavia, which was itself a bridge between East and West during the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ". In his Nobel acceptance speech, Andrić described the country as one which, at break-neck speed and at the cost of great sacrifices and prodigious efforts, is trying in all fields, including the field of culture, to make up for those things of which it has been deprived by a singularly turbulent and hostile past.  In Andrićs view, the seemingly conflicting positions of Yugoslavias disparate ethnic groups could be overcome by knowing ones history. This, he surmised, would help future generations avoid the mistakes of the past, and was in line with his cyclical view of time. Andrić expressed hope that these differences could be bridged and histories demystified .          Shortly before his death, Andrić stated that he wished for all his possessions to be preserved as part of an endowment to be used for general cultural and humanitarian purposes . In March 42 an administrative committee decided that the purpose of the endowment would be to promote the study of Andrićs work, as well as art and literature in general. The Ivo Andrić Endowment has since organized a number of international conferences, made grants to foreign scholars studying the writers works and offered financial aid to cover the publication costs of books relating to Andrić. An annual yearbook, titled Sveske Zadužbine Ive Andrića , is published by the organization. Andrićs ": null
    },
    {
        "will and testament": "will and testament"
    },
    {
        " stipulated that an award be given annually to the author of each subsequent years best collection of short stories. The street that runs beside Belgrades ": null
    },
    {
        "New Palace": "novi dvor"
    },
    {
        ", now the seat of the ": null
    },
    {
        "President of Serbia": "president of serbia"
    },
    {
        ", was posthumously named Andrićev venac in his honour. It includes a life-sized statue of the writer. The flat in which Andrić spent his final years has been turned into a museum. Opened over a year after Andrićs death, it houses books, manuscripts, documents, photographs and personal belongings. Several of Serbias other major cities, such as ": null
    },
    {
        "Novi Sad": "novi sad"
    },
    {
        " and ": null
    },
    {
        "Kragujevac": "kragujevac"
    },
    {
        ", have streets named after Andrić. ,  Streets in a number of cities in Bosnia and Herzegovina, such as Sarajevo, Banja Luka, Tuzla, and Višegrad, also carry his name. , , ,      Andrić remains the only writer from the former Yugoslavia to have been awarded the Nobel Prize. Given his use of the Ekavian dialect, and the fact that most of his novels and short stories were written in Belgrade, his works have become associated almost exclusively with ": null
    },
    {
        "Serbian literature": "serbian literature"
    },
    {
        ". The Slavonic studies professor ": null
    },
    {
        "Bojan Aleksov": "bojan aleksov"
    },
    {
        " characterizes Andrić as one of Serbian literatures two central pillars, the other being Njegoš. The plasticity of his narrative, Moravcevich writes, the depth of his psychological insight, and the universality of his symbolism remain unsurpassed in all of Serbian literature.  Due to his self-identification as a Serb, many in the Bosniak and Croat literary establishments have come to reject or limit Andrićs association with their literatures . Following ": null
    },
    {
        "Yugoslavias disintegration": "breakup of yugoslavia"
    },
    {
        " in the early 42s, Andrićs works were blacklisted in Croatia under ": null
    },
    {
        "President": "president of croatia"
    },
    {
        " Franjo Tuđman": "franjo tuđman"
    },
    {
        ". The Croatian historian and politician ": null
    },
    {
        "Ivo Banac": "ivo banac"
    },
    {
        " characterizes Andrić as a writer who missed the Chetnik train by a very small margin . Though Andrić remains a controversial figure in Croatia, the Croatian literary establishment largely rehabilitated his works following Tuđmans death in 42     Bosniak scholars have objected to the ostensibly negative portrayal of Muslim characters in Andrićs works. During the 42s, his most vocal Bosniak detractors accused him of being a ": null
    },
    {
        "plagiarist": "plagiarism"
    },
    {
        ", ": null
    },
    {
        "homosexual": "homosexuality"
    },
    {
        " and Serbian nationalist. Some went so far as to call for his Nobel Prize to be taken away. Most Bosniak criticism of his works appeared in the period immediately prior to the breakup of Yugoslavia and in the aftermath of the ": null
    },
    {
        "Bosnian War": "bosnian war"
    },
    {
        ". In early 42 a Bosniak nationalist in Višegrad destroyed a statue of Andrić with a sledgehammer. In 42 Nezim Halilović, the ": null
    },
    {
        "imam": "imam"
    },
    {
        " of Sarajevos ": null
    },
    {
        "King Fahd Mosque": "king fahd mosque"
    },
    {
        ", derided Andrić as a Chetnik ideologue during a sermon. In 42 the filmmaker ": null
    },
    {
        "Emir Kusturica": "emir kusturica"
    },
    {
        " and Bosnian Serb ": null
    },
    {
        "President": "president of republika srpska"
    },
    {
        " Milorad Dodik": "milorad dodik"
    },
    {
        " unveiled another statue of Andrić in Višegrad, this time as part of the construction of an ethno-town called ": null
    },
    {
        "Andrićgrad": "andrićgrad"
    },
    {
        ", sponsored by Kusturica and the ": null
    },
    {
        "Government of Republika Srpska": "government of republika srpska"
    },
    {
        ". Andrićgrad was officially inaugurated in June 42 on the occasion of the 42th anniversary of the assassination of Franz Ferdinand.          Source:     Ex Ponto. Književni jug, Zagreb   42 Nemiri. Sv. Kugli, Zagreb   42 Put Alije Đerzeleza. S. B. Cvijanović, Belgrade   42 Pripovetke I.  Srpska književna zadruga , Belgrade   42 Pripovetke. Srpska književna zadruga, Belgrade   42 Pripovetke II. Srpska književna zadruga, Belgrade   42 Izabrane pripovetke. Svjetlost, Sarajevo   42  Na Drini ćuprija . Prosveta, Belgrade   42 Travnička hronika. Državni izdavački zavod Jugoslavije, Belgrade   42 Gospođica. Svjetlost, Belgrade   42 Most na Žepi: Pripovetke. Prosveta, Belgrade   42 Pripovijetke. Matica Hrvatska, Zagreb   42 Nove pripovetke. Kultura, Belgrade   42 Priča o vezirovom slonu. Nakladni zavod Hrvatske, Zagreb   42 Priča o kmetu Simanu. Novo pokoljenje, Zagreb   42 Pod gradićem: Pripovetke o životu bosanskog sela. Seljačka knjiga, Sarajevo   42 Prokleta avlija. Matica srpska, Novi Sad   42 Panorama. Prosveta, Belgrade   42 Priča o vezirovom slonu, i druge pripovetke. Rad, Belgrade   42 Ljubav u kasabi: Pripovetke. Nolit, Belgrade   42 Aska i vuk: Pripovetke. Prosveta, Belgrade   42 Eseji i kritike. Svjetlost, Sarajevo   42 Pisma : Privatna pošta. Matica srpska, Novi Sad          ": null
    }
]