[
    {
        "   Jack Hodgins  is a Canadian novelist and short story writer.   Critically acclaimed, among his best received works is Broken Ground , a ": null
    },
    {
        "historical novel": "historical novel"
    },
    {
        " set after the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        ", for which he received the ": null
    },
    {
        "Ethel Wilson Fiction Prize": "ethel wilson fiction prize"
    },
    {
        " and many other accolades.       Jack Hodgins grew up in Merville, a small town in the Comox Valley of British Columbia. He left home for Vancouver, where he attended the ": null
    },
    {
        "University of British Columbia": "university of british columbia"
    },
    {
        ", and was encouraged by ": null
    },
    {
        "Earle Birney": "earle birney"
    },
    {
        ", graduating with a bachelors degree in Education. Hodgins spent the next 42 years of his career teaching English in Nanaimo, back on Vancouver Island.     In 42 his first piece of literary work was accepted by a publication, and the exposure allowed him the chance to expand his work in print. With the publication of his first book of short stories, Spit Delaney’s Island , and his first novel The Invention of the World , Jack Hodgins was well on his way to becoming a recognized name in Canadian literature, before taking a position at the ": null
    },
    {
        "University of Victoria": "university of victoria"
    },
    {
        " in the Creative Writing Department.     He began receiving short-term teaching positions at universities throughout Canada, including Simon Fraser University and the University of Ottawa. . His passion to educate led him around the world- he lectured in countries such as Japan, Finland, Norway, Germany, Spain, and Australia. In 42 he accepted a position as a professor of Creative Writing at the University of Victoria. He and his family settled themselves in Victoria and stayed through until the time of his retirement from teaching, in 42     Hodgins continues his life in Victoria today and occasionally gives lectures on writing and speaks at a workshop in Mallorca, Spain annually. Hodgins has received much recognition for his work including the ": null
    },
    {
        "Eatons BC Book Award": "eatons bc book award"
    },
    {
        " for Spit Delaney’s Island, the ": null
    },
    {
        "Lieutenant Governors Award for Literary Excellence": "lieutenant governors award for literary excellence"
    },
    {
        " in 42 and the Terasen Lifetime Achievement Award. In 42 a play based on several short stories from his book The Barclay Family Theatre was made into an opera by composer Christopher Donnison and premiered on stage in Victoria, BC. His life has been commemorated in a National Film Board Film entitled Jack Hodgins Island.       Hodgins close relationship with the environment stems from his personal experiences within the temperate rainforests and seasides of British Columbia. Places like Comox Valley, Nanaimo, and Victoria, as well as his travels abroad, have influenced his writing and the contents of his books. His characters in Innocent Cities are based on actual residents of the city of Victoria in the late 42s, as well as people he met on his travels to Australia. The Invention of the World is based on the legendary cult leader Brother Twelve and his followers from outside Nanaimo, BC. The Macken Charm , set in 42 illustrates the Comox Valley with characters inspired by influential people in his life. He based the many settings in Spit Delaneys Island around places he has lived or previously travelled.   \tIn an email interview with students from the University of Victoria, Hodgins elaborates on place affecting his writing, and uses Macken Charm as his example.     In The Macken Charm the family gathers at the site of a burnt hotel owned by the family. This place exists still. My own memories go back to playing as a child in that hotel when it was no longer in use. I knew that my parents began their married life in that hotel—the old uncle who owned it asked them to move in and look after it and them. My mother learned to cook   on a stove big enough for a hotel dining room full of guests! All of this is in the novel, pretty well just as it happens, though the characters are fictitious replacements for the originals. The beach, the trees, the roads, the cars of 42 the store, the funeral parlour, the bridge over the river in Courtenay, the glacier—theyre all there. The story is fiction but the place is real.       42 Member of the Order of Canada   42 Lieutenant Governors Award for Literary Excellence   42 Terasen Lifetime Achievement Award for an outstanding literary career in British Columbia   42 Honorary D.Litt , University of Victoria   42 Distance: shortlisted for the inaugural City of Victoria Book Award   42 Distance: longlisted for the IMPAC/Dublin Award   42 Broken Ground: the Torgi Talking Book of the Year   42 Broken Ground: longlisted for the IMPAC/Dublin Award   42 Broken Ground: the Ethel Wilson Prize for fiction in British Columbia   42 Broken Ground: The Drummer General Award   42 Broken Ground: jury choice as Best Novel of the Year in Quill and Quire   42 Broken Ground: in Globe and Mail Top Ten   42 Elected to the Royal Society of Canada   42 Honorary D.Litt, Malaspina University-College   42 Finding Merville : first place in Neville Shanks Memorial Award for Historical Writing   42 Honorary D.Litt, University of British Columbia   42 The Honorary Patron: short listed for the Stephen Leacock Award for Humour   42 The Honorary Patron: the Commonwealth Literature Prize   42 The Canada-Australia Prize   42 The Resurrection of Joseph Bourne: The Governor Generals Literary Award for Fiction   42 The Invention of the World: shortlisted for the Books in Canada First Novel Award   42 The Invention of the World: Gibsons First Novel Award   42 Spit Delaneys Island: short listed for the Governor Generals Award   42 Spit Delaneys Island: the Eatons B.C. Book Award   42 After the Season : the Presidents Medal, University of Western Ontario           The Invention of the World – 42   The Resurrection of Joseph Bourne – 42   The Honorary Patron – 42   Innocent Cities – 42   The Macken Charm – 42   Broken Ground – 42   Distance – 42   The Master of Happy Endings - 42       Spit Delaneys Island –42   By The River   The Barclay Family Theatre – 42   Damage Done by the Storm – 42       Left Behind in Squabble Bay – 42       Over Forty in Broken Hill – 42   A Passion for Narrative: A Guide for Writing Fiction – 42       Short stories and articles have been published in several magazines in Canada, France, Australia, and the US, including:     Northwest Review   ": null
    },
    {
        "Antigonish Review": "antigonish review"
    },
    {
        "   Wascana Review": "wascana review"
    },
    {
        "   Descant   ": null
    },
    {
        "Capilano Review": "capilano review"
    },
    {
        "   Prism International": "prism international"
    },
    {
        "   Paris Intercontinental   Saturday Night   Vancouver   Westerly   Story   ": null
    },
    {
        "Toronto Life": "toronto life"
    },
    {
        "   North American Review": "north american review"
    },
    {
        "   Event   Canadian Fiction Magazine   Sound Heritage   Alphabet   Viva   Journal of Canadian Fiction   ": null
    },
    {
        "The Canadian Forum": "the canadian forum"
    },
    {
        "   Forum    Island No.42   ": null
    },
    {
        "Meanjin": "meanjin"
    },
    {
        "   The Literary Half-yearly   ": null
    },
    {
        "Overland": "overland"
    }
]