[
    {
        "        Jacques Maroger  was a ": null
    },
    {
        "painter": "painting"
    },
    {
        " and the technical director of the ": null
    },
    {
        "Louvre Museums": "louvre museum"
    },
    {
        "laboratory in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". He devoted his life to understanding the oil-based media of the ": null
    },
    {
        "Old Masters": "old masters"
    },
    {
        ". He emigrated to the United States in 1939 and became an influential teacher. His book, The Secret Formulas and Techniques of the Masters, has been criticized by some modern writers on painting who say that the painting medium Maroger promoted is unsound.       In 1907, Maroger began to study with ": null
    },
    {
        "Louis Anquetin": "louis anquetin"
    },
    {
        " and worked under his direction until Anquetins death in 1932. Anquetin worked closely and exhibited with the artists ": null
    },
    {
        "Vincent van Gogh": "vincent van gogh"
    },
    {
        ", ": null
    },
    {
        "Charles Angrand": "charles angrand"
    },
    {
        ", ": null
    },
    {
        "Émile Bernard": "émile bernard"
    },
    {
        ", ": null
    },
    {
        "Paul Gauguin": "paul gauguin"
    },
    {
        ", ": null
    },
    {
        "Camille Pissarro": "camille pissarro"
    },
    {
        ", ": null
    },
    {
        "Georges Seurat": "georges seurat"
    },
    {
        ", ": null
    },
    {
        "Paul Signac": "paul signac"
    },
    {
        " and ": null
    },
    {
        "Henri de Toulouse-Lautrec": "henri de toulouse-lautrec"
    },
    {
        ". He was very active in the ": null
    },
    {
        "Impressionist": "impressionist"
    },
    {
        " movement of the time. In his later years, Anquetin became very interested in the works of the Flemish masters. As Marogers teacher, Anquetin provided guidance in the study of drawing, anatomy and master painting techniques. Maroger began to become famous around 1931, when the ": null
    },
    {
        "National Academy of Design": "national academy of design"
    },
    {
        " in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " reported Marogers painting discoveries.     From 1930 to 1939, Maroger started to work at the Louvre Museum in Paris as Technical Director of the Louvre Laboratory. He served as a professor at the Louvre School, a Member of the Conservation Committee, General Secretary of the International Experts, and President of the Restorers of France. In 1937, he received the ": null
    },
    {
        "Légion dhonneur": "légion dhonneur"
    },
    {
        ", and his pride at the honor is reflected in his self-portrait of the time, in which one can see his Legion pin on his lapel.     He emigrated to the United States in 1939 and became a lecturer at the ": null
    },
    {
        "Parsons School of Design": "parsons school of design"
    },
    {
        " in New York. His New York students, ": null
    },
    {
        "Reginald Marsh": "reginald marsh"
    },
    {
        ", ": null
    },
    {
        "John Koch": "john koch"
    },
    {
        ", ": null
    },
    {
        "Fairfield Porter": "fairfield porter"
    },
    {
        " and ": null
    },
    {
        "Frank Mason": "frank herbert mason"
    },
    {
        " adopted his Old Master painting techniques, and taught it in turn to their own students.     In 1942, Maroger became a Professor at the ": null
    },
    {
        "Maryland Institute College of Art": "maryland institute college of art"
    },
    {
        " in ": null
    },
    {
        "Baltimore": "baltimore, maryland"
    },
    {
        " and established a school of painting. At the Maryland Institute he led a group of painters who came to be known as the ": null
    },
    {
        "Baltimore Realists": "baltimore realists"
    },
    {
        ", including the painters ": null
    },
    {
        "Earl Hofmann": "earl hofmann"
    },
    {
        ", , , ": null
    },
    {
        "Ann Didusch Schuler": "ann didusch schuler"
    },
    {
        ", ": null
    },
    {
        "Frank Redelius": "frank redelius"
    },
    {
        ", John Bannon, ": null
    },
    {
        "Evan Keehn": "evan keehn"
    },
    {
        ", and .     Maroger published The Secret Formulas and Techniques of the Masters in 1948. When Marogers book became available, Reginald Marsh drew on Marogers book-jacket an airplane dropping an atomic bomb on the Maryland Art Institute, a reference to the controversy Maroger was causing in the local press over the abstract art versus realism debate.     Marogers formula and techniques have been studied by many modern painters who wish to obtain the paint quality of the Old Masters. The secret formula that Maroger devised during his lifetime included the main ingredient ": null
    },
    {
        "white lead": "white lead"
    },
    {
        ". White lead when cooked into linseed oil acts as a drying agent, accelerating the polymerization of the oil film.     Maroger claimed to have introduced to the modern day artist what the masters achieved centuries before in their paintings, a way to ensure permanence and color quality in oils without sacrificing fluid and subtle paint handling. Equipped with these formulas, the artist could once again blend his paint easily without losing control of his brush. The paint stays where it is applied and does not run off the panel. It dries very fast so that he can paint on the same areas the very next day, which speeds up painting.     Frank Redelius, one of Marogers protégés from the Baltimore Realists group, wrote a book that updates, builds upon and revises Jacques Marogers research of the painting techniques and formulas of the Old Masters. Redelius was assisting Maroger with a revision of The Secret Formulas and Techniques of the Masters before Marogers death in 1962. Frank Redelius book, published in 2009, is titled The Master Keys: A Painters Treatise On The Pictorial Technique Of Oil Painting.       Maroger has been criticized by some modern writers on painting because of his bold claims about having found the secret formulas of the Masters. The most commonly used of Marogers recipes today is in fact nothing other than a renamed version of the ages-old ": null
    },
    {
        "megilp": "megilp"
    },
    {
        " , also known as macguilp , meglip , meguilp , and a variety of other names. Megilp/maroger medium is simply the thixotropic gel resulting from the equal combination of mastic varnish and black oil. Megilp and related media have been in use for centuries, Mayer, Ralph . The Artists Handbook of Materials and Techniques. New York: Viking Press. p. 188. . and such media were readily available from many artists colormen during the time of Marogers research.     The archival quality of the medium itself is controversial in art circles, in part because its documented use dates back less than a century. This is from Michael Skalka, Conservation Administrator,   National Gallery of Art, Washington, DC.:     See the work of Lance Mayer and Gay Myers for more information on Curry and Maroger.     This criticism can be misleading, however. Many of the media involved in Currys work bear no resemblance whatsoever to the modern mastic varnish/black oil recipe. Maroger medium which is not made properly may contain a large amount of dirt and impurities from improperly filtered mastic varnish, or the black oil may be overcooked, both of which would contribute to darkening and weakening of the work. In addition the overuse of megilp media tends to create weak paint films. Conservation science has shown that the presence of natural resins like mastic in the paint film causes embrittlement, darkening, and continued solubility. See the work of Leslie Carlyle or Joyce Townsend for problems related to 18th-century painting that contain megilp.           Lead Medium – attributed to ": null
    },
    {
        "Antonello da Messina": "antonello da messina"
    },
    {
        " – One part litharge or lead white, combined by cooking with three to four parts linseed.   Lead Medium – attributed to ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        " – One part litharge or lead white, combined by cooking with three to four parts raw linseed oil, and three to four parts water.   Lead Medium – attributed to the Venetian painters – ": null
    },
    {
        "Giorgione": "giorgione"
    },
    {
        ", ": null
    },
    {
        "Titian": "titian"
    },
    {
        " and ": null
    },
    {
        "Tintoretto": "tintoretto"
    },
    {
        " – One or two parts litharge or lead white, combined by cooking with 20 parts raw linseed or walnut oil.   Lead Medium – attributed to ": null
    },
    {
        "Peter Paul Rubens": "peter paul rubens"
    },
    {
        " -This medium was allegedly based on the black oil of Giorgione with an addition of mastic resin, Venice turpentine and beeswax. One or two parts litharge or lead white, combines by cooking with 20 parts raw linseed. A little more than one spoonful of black oil combined with even one spoonful of mastic varnish resulted in the jelly medium thought to be Megilp .   Lead Medium – This medium was the same as the one used by Rubens, but did not include beeswax.   Lead Medium – attributed to ": null
    },
    {
        "Velázquez": "diego velázquez"
    },
    {
        " – One part verdigris , combined by cooking with 20 parts raw linseed or walnut oil.     The majority of these recipes are not employed today, as there are few companies that produce them. The primary form of Maroger medium known today is black oil and mastic varnish combined in approximately equal parts to form a gel.     While Maroger medium is usually mixed directly with oil paints, its proportion should be kept to no more than 20% of the mixture. A useful technique is to rub a very thin film of Maroger medium over the area to be painted and paint into that—known as painting into the couch. This lubricates the brush stroke. Maroger medium should never be used as a final picture varnish, as Maroger requires reaction by admixture with oil paint in order to dry.     The reduced availability of lead, combined with injunctions against lead use in household products and other factors has caused most major paint makers to discontinue the production of Marogers medium. Many paint makers now offer faux-marogers media or faux-megilps, generally made by substituting different materials, such as lime, for genuine lead, or by creating a similar product out of specially thickened alkyd medium. These products produce effects similar to, but not the same as those of real Maroger medium, which depends on specific chemical reactions between leaded oil, mastic resin, and turpentine .       The white gingerbread cottage that was Marogers home in Baltimore is found on the east campus of ": null
    },
    {
        "Loyola College in Maryland": "loyola college in maryland"
    },
    {
        " and is used for ": null
    },
    {
        "drawing": "drawing"
    },
    {
        " and ": null
    },
    {
        "painting": "painting"
    }
]