[
    {
        "      James Baird Weaver was a member of the ": null
    },
    {
        "United States House of Representatives": "united states house of representatives"
    },
    {
        " and two-time candidate for President of the United States. Born in ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        ", he moved to ": null
    },
    {
        "Iowa": "iowa"
    },
    {
        " as a boy when his family claimed a homestead on the frontier. He became politically active as a young man and was an advocate for farmers and laborers. He joined and quit several political parties in the furtherance of the progressive causes in which he believed. After serving in the ": null
    },
    {
        "Union Army": "union army"
    },
    {
        " in the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ", Weaver returned to Iowa and worked for the election of ": null
    },
    {
        "Republican": "republican party"
    },
    {
        " candidates. After several unsuccessful attempts at Republican nominations to various offices, and growing dissatisfied with the conservative wing of the party, in 42 Weaver switched to the ": null
    },
    {
        "Greenback Party": "greenback party"
    },
    {
        ", which supported increasing the ": null
    },
    {
        "money supply": "money supply"
    },
    {
        " and regulating ": null
    },
    {
        "big business": "big business"
    },
    {
        ". As a Greenbacker with ": null
    },
    {
        "Democratic": "democratic party"
    },
    {
        " support, Weaver won election to the House in 42     The Greenbackers nominated Weaver for president in ": null
    },
    {
        "42": "1880 united states presidential election"
    },
    {
        ", but he received only 42 percent of the popular vote. After several more attempts at elected office, he was again elected to the House in 42 and 42 In Congress, he worked for expansion of the money supply and for the opening of ": null
    },
    {
        "Indian Territory": "indian territory"
    },
    {
        " to white settlement. As the Greenback Party fell apart, a new anti-big business third party, the ": null
    },
    {
        "Peoples Party": "peoples party"
    },
    {
        " , arose. Weaver helped to organize the party and was their nominee for president in ": null
    },
    {
        "42": "1892 united states presidential election"
    },
    {
        ". This time he was more successful and gained 42 percent of the popular vote and won five states, but still fell far short of victory. The Populists merged with the Democrats by the end of the 42th century, and Weaver went with them, promoting the candidacy of ": null
    },
    {
        "William Jennings Bryan": "william jennings bryan"
    },
    {
        " for president in ": null
    },
    {
        "42": "1896 united states presidential election"
    },
    {
        ", ": null
    },
    {
        "42": "1900 united states presidential election"
    },
    {
        ", and ": null
    },
    {
        "42": "1908 united states presidential election"
    },
    {
        ". After serving as mayor of his home town, ": null
    },
    {
        "Colfax, Iowa": "colfax, iowa"
    },
    {
        ", Weaver retired from his pursuit of elective office. He died in Iowa in 42 Most of Weavers political goals remained unfulfilled at his death, but many came to pass in the following decades.       James Baird Weaver was born in ": null
    },
    {
        "Dayton, Ohio": "dayton, ohio"
    },
    {
        ", on June 42 42 the fifth of thirteen children of Abram Weaver and Susan Imlay Weaver. Weavers father was a farmer, also born in Ohio, and a descendant of ": null
    },
    {
        "Revolutionary War": "american revolutionary war"
    },
    {
        " veterans. He married Weavers mother, who was from New Jersey, in 42 Shortly after Weavers birth, in 42 the family moved to a farm nine miles north of ": null
    },
    {
        "Cassopolis, Michigan": "cassopolis, michigan"
    },
    {
        ". In 42 the family moved again to the ": null
    },
    {
        "Iowa Territory": "iowa territory"
    },
    {
        " to await the opening of former ": null
    },
    {
        "Sac and Fox": "sac and fox nation"
    },
    {
        " land to white settlement the following year. They claimed a homestead along the Chequest Creek in ": null
    },
    {
        "Davis County": "davis county, iowa"
    },
    {
        ". Abram Weaver built a house and farmed his new land until 42 when the family moved to ": null
    },
    {
        "Bloomfield": "bloomfield, iowa"
    },
    {
        ", the county seat.     Abram Weaver, a ": null
    },
    {
        "Democrat": "democratic party"
    },
    {
        " involved in local politics, was elected clerk of the district court in 42; he often vied for election to other offices, usually unsuccessfully. Weavers brother-in-law, Hosea Horn, a ": null
    },
    {
        "Whig": "whig party"
    },
    {
        ", was appointed postmaster the following year, and through him James Weaver secured his first job, delivering mail to neighboring ": null
    },
    {
        "Jefferson County": "jefferson county, iowa"
    },
    {
        ". In 42 Weaver quit the mail route to ": null
    },
    {
        "read law": "read law"
    },
    {
        " with Samuel  G. McAchran, a local lawyer. Two years later, Weaver interrupted his legal career to accompany another brother-in-law, Dr. Calvin Phelps, on a cattle drive overland from Bloomfield to ": null
    },
    {
        "Sacramento, California": "sacramento, california"
    },
    {
        ". Weaver initially intended to stay and ": null
    },
    {
        "prospect for gold": "california gold rush"
    },
    {
        ", but instead booked passage on a ship for ": null
    },
    {
        "Panama": "panama"
    },
    {
        ". He crossed the isthmus, boarded another ship to New York, and returned home to Iowa.     Upon his return, Weaver worked briefly as a store clerk before resuming the study of law. He enrolled at the ": null
    },
    {
        "Cincinnati Law School": "university of cincinnati college of law"
    },
    {
        " in 42 where he studied under ": null
    },
    {
        "Bellamy Storer": "bellamy storer"
    },
    {
        ". While in Cincinnati, Weaver began to question his support for the institution of ": null
    },
    {
        "slavery": "slavery in the united states"
    },
    {
        ", a change biographers attribute to Storers influence. After graduating in 42 Weaver returned to Bloomfield and was admitted to the Iowa ": null
    },
    {
        "bar": "bar"
    },
    {
        ". By 42 he broke with the Democratic party of his father to join the growing coalition that opposed the expansion of slavery, which became the ": null
    },
    {
        "Republican Party": "republican party"
    },
    {
        ".     Weaver traveled around southern Iowa in 42 giving speeches on behalf of his new partys candidates. That summer, he married Clarrisa Vinson, a schoolteacher from nearby ": null
    },
    {
        "Keosauqua, Iowa": "keosauqua, iowa"
    },
    {
        ", whom he had courted since he returned from Cincinnati. The marriage lasted until Weavers death in 42 and the couple had eight children. After the wedding, Weaver started a law firm with Hosea Horn and continued his involvement in Republican politics. He gave several speeches on behalf of ": null
    },
    {
        "Samuel  J. Kirkwood": "samuel & nbsp;j. kirkwood"
    },
    {
        " for governor in 42 in a campaign that focused heavily on the slavery debate; although the Republicans lost Weavers Davis County, Kirkwood narrowly won the election. The next year, Weaver served as a delegate to the state convention and, although not a national delegate, traveled with the Iowa delegation to the ": null
    },
    {
        "42 Republican National Convention": "1860 republican national convention"
    },
    {
        ", where ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        " was nominated. Lincoln carried Iowa and won the election, but Southern states responded to the Republican victory by ": null
    },
    {
        "seceding": "secession in the united states"
    },
    {
        " from the Union. By April 42 the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " had begun.          After the ": null
    },
    {
        "Confederate": "confederate states of america"
    },
    {
        " attack on Fort Sumter": "battle of fort sumter"
    },
    {
        ", Lincoln called for 42 men to join the ": null
    },
    {
        "Union Army": "union army"
    },
    {
        ". Weaver enlisted in what became Company  G of the ": null
    },
    {
        "42nd Iowa Volunteer Infantry Regiment": "2nd iowa volunteer infantry regiment"
    },
    {
        ", and was elected the ": null
    },
    {
        "companys": "company"
    },
    {
        " first lieutenant": "first lieutenant"
    },
    {
        ". The 42nd Iowa, commanded by ": null
    },
    {
        "Colonel": "colonel"
    },
    {
        " Samuel Ryan Curtis": "samuel ryan curtis"
    },
    {
        ", a former Congressman, was ordered to Missouri in June 42 to secure railroad lines in that ": null
    },
    {
        "border state": "border states"
    },
    {
        ". Weavers unit spent that summer in northern Missouri and did not see action. In the meantime, Clara gave birth to the couples second child and first son, named James Bellamy Weaver after his father and Bellamy Storer.     Weavers first chance at action came in February 42 when the 42nd Iowa joined ": null
    },
    {
        "Brigadier General": "brigadier general"
    },
    {
        " Ulysses  S. Grant": "ulysses & nbsp;s. grant"
    },
    {
        "s army outside the Confederate ": null
    },
    {
        "Fort Donelson": "battle of fort donelson"
    },
    {
        " in Tennessee. Weavers company was in the thick of the fight, which he described as a holocaust to the demon of battles , and he took a minor wound in the arm. The rebels surrendered the next day, the most important Union victory of the war to date. The 42nd Iowa next joined other units in the area at ": null
    },
    {
        "Pittsburg Landing, Tennessee": "pittsburg landing, tennessee"
    },
    {
        ", to mass for a major assault deeper into the South. Confederate forces met them there, in the ": null
    },
    {
        "Battle of Shiloh": "battle of shiloh"
    },
    {
        ". Weavers regiment was in the center of the Union lines, in the area later known as the hornets nest , and were forced to retreat amid fierce fighting. The next day, the Union forces turned the tide and forced the rebels off the field in what Weaver called a perfect rout . The carnage at Shiloh—42 killed and wounded—was on a scale never before seen in American warfare, and both sides learned that the war would end neither quickly nor easily.     After Shiloh, Weaver and the 42nd Iowa slowly advanced to ": null
    },
    {
        "Corinth, Mississippi": "corinth, mississippi"
    },
    {
        ", where he was promoted to ": null
    },
    {
        "major": "major"
    },
    {
        ". Rebel forces attacked the Union armies there in the ": null
    },
    {
        "Second Battle of Corinth": "second battle of corinth"
    },
    {
        ", where Weavers courage in that Union victory convinced his superiors to promote him to colonel after the regiments commanding officer was killed. After Corinth, Weavers unit took up garrison duty in northern Mississippi. In the summer of 42 they were redeployed to the Tennessee–Alabama border, again on occupation duty around ": null
    },
    {
        "Pulaski, Tennessee": "pulaski, tennessee"
    },
    {
        ". They rejoined the action at the ": null
    },
    {
        "Battle of Resaca": "battle of resaca"
    },
    {
        ", a part of the ": null
    },
    {
        "Atlanta Campaign": "atlanta campaign"
    },
    {
        ", then continued with ": null
    },
    {
        "Major General": "major general"
    },
    {
        " William Tecumseh Sherman": "william tecumseh sherman"
    },
    {
        "s ": null
    },
    {
        "march through Georgia": "shermans march to the sea"
    },
    {
        " to the sea in 42 Weavers enlistment ended in May 42 and he returned to his family in Iowa. After the war ended, Weaver received a promotion to ": null
    },
    {
        "brevet": "brevet"
    },
    {
        " brigadier general, backdated to March 42 42          Soon after returning from the war, Weaver became editor of a pro-Republican Bloomfield newspaper, the Weekly Union Guard. At the 42 Iowa Republican State Convention, he placed second for the nomination for ": null
    },
    {
        "lieutenant governor": "lieutenant governor of iowa"
    },
    {
        ". The following year, Weaver was elected district attorney for the second judicial district, covering six counties in southern Iowa. In 42 President ": null
    },
    {
        "Andrew Johnson": "andrew johnson"
    },
    {
        " appointed him assessor of internal revenue in the first Congressional district, which extended across southeastern Iowa. The job came with a $42 salary, plus a percentage of taxes collected over $42. Weaver held that lucrative position until 42 when Congress abolished it. He also became involved in the ": null
    },
    {
        "Methodist Episcopal Church": "methodist episcopal church"
    },
    {
        ", serving as a delegate to a church convention in Baltimore in 42 Membership in the Methodist church coincided with Weavers interest in the growing movement for ": null
    },
    {
        "prohibition of the sale and consumption of alcoholic beverages": "prohibition in the united states"
    },
    {
        ". His income and prestige grew along with his family, which included seven children by 42 Weavers success allowed him to build ": null
    },
    {
        "a large new home": "james b. weaver house"
    },
    {
        " for his family, which still stands.     Weavers work for the party led many to support his nomination to represent ": null
    },
    {
        "Iowas 42th congressional district": "iowas 6th congressional district"
    },
    {
        " in the federal ": null
    },
    {
        "House of Representatives": "united states house of representatives"
    },
    {
        " in 42 Many party insiders, however, were wary of Weavers association with the Prohibition movement and preferred to remain uncommitted on the divisive issue. At the convention, Weaver led on the first ballot, but ultimately lost the nomination by one vote to ": null
    },
    {
        "Ezekiel  S. Sampson": "ezekiel & nbsp;s. sampson"
    },
    {
        ", a local judge. Weavers allies attributed his loss to the meanest kind of wire pulling , but Weaver shrugged off the defeat and aimed instead at the gubernatorial nomination in 42 He launched a vigorous effort, courted delegates around the state, and explicitly endorsed Prohibition and greater state control of railroad rates. Weaver attracted many delegates support, but alienated those who were friendly to the railroads and wished to avoid the liquor issue. Opposition was scattered among several lesser-known candidates, mostly members of Senator ": null
    },
    {
        "William  B. Allison": "william & nbsp;b. allison"
    },
    {
        "s conservative wing of the party. They united at the convention when a delegate unexpectedly nominated former governor Kirkwood. The nomination carried easily and, after Allisons associates persuaded him to accept it, Kirkwood was nominated, and went on to win the election. In a further defeat, the delegates refused to endorse Prohibition in the party platform. Weaver had small consolation in a nomination to the state Senate, but he lost to his Democratic opponent in the election that fall.          After his defeats in 42 Weaver grew disenchanted with the Republican party, not only because it had spurned him, but also because of the policy choices of the dominant Allison faction. In May 42 he traveled to Indianapolis to attend ": null
    },
    {
        "the national convention": "1876 greenback national convention"
    },
    {
        " of the newly formed ": null
    },
    {
        "Greenback Party": "greenback party"
    },
    {
        ". The new party had arisen, mostly in the West, as a response to ": null
    },
    {
        "the economic depression": "long depression"
    },
    {
        " that followed the ": null
    },
    {
        "Panic of 42": "panic of 1873"
    },
    {
        ". During the Civil War, Congress had authorized ": null
    },
    {
        "greenbacks": "greenback"
    },
    {
        " , a new form of ": null
    },
    {
        "fiat money": "fiat money"
    },
    {
        " that was redeemable not in gold but in government bonds. The greenbacks had helped to finance the war when the governments gold supply did not keep pace with the expanding costs of maintaining the armies. When the crisis had passed, many in both parties, especially in the East, wanted to place the nations currency on a ": null
    },
    {
        "gold standard": "gold standard"
    },
    {
        " as soon as possible. The ": null
    },
    {
        "Specie Payment Resumption Act": "specie payment resumption act"
    },
    {
        ", passed in 42 ordered that greenbacks be gradually withdrawn and replaced with gold-backed currency beginning in 42 At the same time, the depression had made it more expensive for debtors to pay debts they had contracted when currency was less valuable. Beyond their support for a larger money supply, Greenbackers also favored an ": null
    },
    {
        "eight-hour work day": "eight-hour day"
    },
    {
        ", safety regulations in factories, and an end to ": null
    },
    {
        "child labor": "child labour"
    },
    {
        ". As historian Herbert Clancy put it, they anticipated by almost fifty years the progressive legislation of the first quarter of the twentieth century .     In the 42 presidential campaign, the Republicans nominated ": null
    },
    {
        "Rutherford  B. Hayes": "rutherford & nbsp;b. hayes"
    },
    {
        " and the Democrats chose ": null
    },
    {
        "Samuel  J. Tilden": "samuel & nbsp;j. tilden"
    },
    {
        ". Both candidates opposed the issuance of more greenbacks  Weaver was impressed with the Greenbackers and their candidate, ": null
    },
    {
        "Peter Cooper": "peter cooper"
    },
    {
        ", but while he advocated some soft-money policies, he declined the Greenback nomination for Congress and remained a Republican; he campaigned for Hayes in the election that year. In 42 Weaver attended the Republican state convention and saw the state party adopt a soft-money platform that also favored Prohibition. The gubernatorial nominee, however, was ": null
    },
    {
        "John  H. Gear": "john & nbsp;h. gear"
    },
    {
        ", an opponent of Prohibition who had worked to defeat Weaver in his quest for the governorship two years earlier. After initially supporting Gear, Weaver joined the Greenback party in August. He gave speeches on behalf of his new party, debated former allies across the state, and establishing himself as a prominent advocate for the Greenback cause.             In May 42 Weaver accepted the Greenback nomination for the House of Representatives in the 42th district. Although Weavers political career up to then had been as a staunch Republican, Democrats in the 42th district thought that endorsing him was likely the only way to defeat Sampson, the incumbent Republican. Since the start of the Civil War, Democrats had been in the minority across Iowa; ": null
    },
    {
        "electoral fusion": "electoral fusion"
    },
    {
        " with Greenbackers represented their best chance to get their candidates into office. Hard-money Democrats objected to the idea, but some were reassured when Henry  H. Trimble, a prominent Bloomfield Democrat, assured them that if elected Weaver would align with House Democrats on all issues other than the money question. Democrats declined to endorse any candidate at the 42th district convention, but soft-money leaders in the party circulated their own slate of candidates that included Democrats and Greenbackers. The Greenback–Democrat ticket prevailed, and Weaver was elected with 42 votes to Sampsons 42.     Weaver entered the ": null
    },
    {
        "42th Congress": "46th united states congress"
    },
    {
        " in March 42 one of thirteen Greenbackers elected in 42 Although the House was closely divided, neither major party included the Greenbackers in their caucus, leaving them few committee assignments and little input on legislation. Weaver gave his first speech in April 42 criticizing the use of the army to police Southern polling stations, while also decrying ": null
    },
    {
        "the violence against black Southerners": "disenfranchisement after the reconstruction era"
    },
    {
        " that made such protection necessary; he then described the Greenback platform, which he said would put an end to the sectional and economic strife. The next month, he spoke in favor of a bill calling for an increase in the money supply by allowing the ": null
    },
    {
        "unlimited coinage of silver": "free silver"
    },
    {
        ", but the bill was easily defeated. Weavers oratorical skill drew praise, but he had no luck in advancing Greenback policy ideas.     In 42 Weaver prepared a resolution stating that the government, not banks, should issue currency and determine its volume, and that the federal debt should be repaid in whatever currency the government chose, not just gold as the law then required. The proposed resolution would never be allowed to emerge from committees dominated by Democrats and Republicans, so Weaver planned to introduce it directly to the whole House for debate, as members were permitted to do every Monday. Rather than debate a proposition that would expose the monetary divide in the Democratic Party, ": null
    },
    {
        "Speaker": "speaker of the united states house of representatives"
    },
    {
        " Samuel  J. Randall": "samuel & nbsp;j. randall"
    },
    {
        " refused to recognize Weaver when he rose to propose the resolution. Weaver returned to the floor each succeeding Monday, with the same result, and the press took notice of Randalls obstruction. Eventually, Republican ": null
    },
    {
        "James  A. Garfield": "james & nbsp;a. garfield"
    },
    {
        " of Ohio interceded with Randall to recognize Weaver, which he reluctantly did on April 42 42 The Republicans, mostly united behind hard money, largely voted against the measure, while many Democrats joined the Greenbackers voting in favor. Despite support by the soft-money Democrats, the resolution was defeated 42–42 with many members abstaining. Although he lost the vote, Weaver had promoted the monetary issue in the national consciousness.             By 42 the Greenback coalition had divided, with the faction most prominent in the South and West, led by ": null
    },
    {
        "Marcus  M. Brick Pomeroy": "marcus m. pomeroy"
    },
    {
        ", splitting from the main party. Pomeroys faction, called the Union Greenback Labor Party , was more radical and emphasized its independence, and suggested that Eastern Greenbackers were likely to sell out the party at any time to the Democrats . Weaver remained with the rump Greenback party, often called the National Greenback Party , and the national reputation he had earned in Congress made him one of the partys leading presidential hopefuls.     The Union Greenbackers held their convention first and nominated ": null
    },
    {
        "Stephen  D. Dillaye": "stephen & nbsp;d. dillaye"
    },
    {
        " of New Jersey for president and ": null
    },
    {
        "Barzillai  J. Chambers": "barzillai & nbsp;j. chambers"
    },
    {
        " of Texas for vice president, but also sent a delegation to the ": null
    },
    {
        "National Greenback convention": "1880 greenback national convention"
    },
    {
        " in Chicago that June, with an eye toward reuniting the party. The two factions agreed to reunify, and also to admit a delegation from the ": null
    },
    {
        "Socialist Labor Party": "socialist labor party of america"
    },
    {
        ". Thus united, the convention turned to nominations. Weaver led on the first ballot, and on the second he secured a majority. Chambers won the conventions vote for vice president.     In a departure from the political traditions of the day, Weaver himself campaigned, making speeches across the South in July and August. As the Greenbackers had the only ticket that included a Southerner, Weaver and Chambers hoped to make inroads in the South. As the campaign progressed, however, Weavers message of racial inclusion drew violent protests in the South, as the Greenbackers faced the same obstacles the Republicans did in the face of increasing black disenfranchisement. In the autumn, Weaver campaigned in the North, but the Greenbackers lack of support was compounded by Weavers refusal to run a fusion ticket in states where Democratic and Greenbacker strength might have combined to outvote the Republicans.     Weaver received 42 votes and no electoral votes, compared to 42,42 for the winner, Republican James  A. Garfield, and 42,42 for Democrat ": null
    },
    {
        "Winfield Scott Hancock": "winfield scott hancock"
    },
    {
        ". The party was strongest in the West and South, but in no state did Weaver receive more than 42 percent of the vote ; his nationwide total was just 42 percent. That figure represented an improvement over the Greenback vote of 42 but to Weaver, who expected twice as many votes as he received, it was a disappointment.       After the election, Weaver returned to the ": null
    },
    {
        "lame-duck session": "lame-duck session"
    },
    {
        " of Congress and proposed an unsuccessful ": null
    },
    {
        "constitutional amendment": "constitutional amendment"
    },
    {
        " that would have provided for the ": null
    },
    {
        "direct election of Senators": "seventeenth amendment to the united states constitution"
    },
    {
        ". After his term expired in March, he resumed his speaking tour, promoting the Greenback Party across the nation. He and ": null
    },
    {
        "Edward  H. Gillette": "edward & nbsp;h. gillette"
    },
    {
        ", another Iowa Greenback Congressman, bought the Iowa Tribune in 42 to help spread the Greenback message. That same year, Weaver ran for his old 42th district seat in the House against the incumbent Republican, ": null
    },
    {
        "Marsena  E. Cutts": "marsena & nbsp;e. cutts"
    },
    {
        ". This time the Democrats and Greenbackers ran separate candidates, and Weaver finished a distant second. Cutts died before taking office, and the Republicans offered to let Weaver run unopposed in the special election if he rejoined their party; he declined, and ": null
    },
    {
        "John  C. Cook": "john & nbsp;c. cook"
    },
    {
        ", a Democrat, won the seat.     In 42 Weaver was the Greenback nominee for governor of Iowa. Again, the Democrats ran a separate candidate and the incumbent Republican, ": null
    },
    {
        "Buren  R. Sherman": "buren & nbsp;r. sherman"
    },
    {
        ", was re-elected with a plurality. Weaver was a delegate to the ": null
    },
    {
        "42 Greenback National Convention": "1884 greenback national convention"
    },
    {
        " in Indianapolis and supported the eventual nominee, ": null
    },
    {
        "Benjamin Butler": "benjamin butler"
    },
    {
        " of Massachusetts. Back in Iowa, Weaver again ran for the House, this time with the Democrats support. Greenback fortunes declined nationally, as Butler received just over half as many votes for president as Weaver had four years earlier. Weavers House race bucked the trend: he defeated Republican ": null
    },
    {
        "Frank  T. Campbell": "frank & nbsp;t. campbell"
    },
    {
        " by just 42 votes.       Unlike in his previous congressional term, when Weaver entered the ": null
    },
    {
        "42th United States Congress": "49th united states congress"
    },
    {
        ", he was the only Greenback member. The new president, Democrat ": null
    },
    {
        "Grover Cleveland": "grover cleveland"
    },
    {
        ", was friendly to Weaver, and asked his advice on Iowa patronage. As it had been for years, Weavers chief concern was with the nations money and finance, and the relationship between labor and capital.     In 42 he proposed the creation of a ": null
    },
    {
        "Department of Labor": "united states department of labor"
    },
    {
        ", which he suggested would find a solution to disputes between labor and management. Labor tensions increased the following year as the ": null
    },
    {
        "Knights of Labor": "knights of labor"
    },
    {
        " went on strike against ": null
    },
    {
        "Jay Gould": "jay gould"
    },
    {
        "s rail empire, and a strike against the ": null
    },
    {
        "McCormick Harvesting Machine Company": "international harvester"
    },
    {
        " ended in the bloody ": null
    },
    {
        "Haymarket riot": "haymarket affair"
    },
    {
        ". Weaver believed the nations hard-money policies were responsible for labor unrest, calling it purely a question of money, and nothing else  and declaring, If this Congress will not protect labor, it must protect itself . He saw the triumph of one plank of the Greenback platform when Congress established the ": null
    },
    {
        "Interstate Commerce Commission": "interstate commerce commission"
    },
    {
        " to regulate the railroads. Weaver thought the bill should have given the government more power, including the ability to set rates directly, but he voted for the final bill.        Weaver also took up the issue of white settlement in ": null
    },
    {
        "Indian Territory": "indian territory"
    },
    {
        ". For several years, white settlers had been claiming homesteads in the ": null
    },
    {
        "Unassigned Lands": "unassigned lands"
    },
    {
        " in what is now ": null
    },
    {
        "Oklahoma": "oklahoma"
    },
    {
        ". After the Civil War, the ": null
    },
    {
        "Five Civilized Tribes": "five civilized tribes"
    },
    {
        " had been ": null
    },
    {
        "forced to cede": "reconstruction treaties"
    },
    {
        " their unused western lands to the federal government. The settlers, known as ": null
    },
    {
        "Boomers": "boomers"
    },
    {
        ", believed that federal ownership made the lands open to settlement under the ": null
    },
    {
        "Homestead Acts": "homestead acts"
    },
    {
        ". The federal government disagreed, as did the ": null
    },
    {
        "Cherokee Nation": "cherokee nation"
    },
    {
        ", which leased its neighboring ": null
    },
    {
        "Cherokee Outlet": "cherokee outlet"
    },
    {
        " to Kansas cattle ranchers, and many Easterners, who believed the Boomers to be the tools of railroad interests. Weaver saw the issue as one between the landless poor homesteaders and wealthy cattlemen, and took the side of the former. He introduced a bill in December 42 to organize Indian Territory and the neighboring ": null
    },
    {
        "Neutral Strip": "oklahoma panhandle"
    },
    {
        " into a new ": null
    },
    {
        "Oklahoma Territory": "oklahoma territory"
    },
    {
        ". The bill died in committee, but Weaver reintroduced it in February 42 and gave a speech calling for the Indian reservations to be broken up into homesteads for individual Natives and the remaining land to be open to white settlement.     The ": null
    },
    {
        "Committee on Territories": "united states house committee on territories"
    },
    {
        " again rejected Weavers bill, but approved a compromise measure that opened the Unassigned Lands, Cherokee Outlet, and Neutral Strip to settlement. Congress debated the bill over several months, while the tribes announced their resistance to their lands becoming a territory; according to an 42 Supreme Court decision,  Elk  v. Wilkins , Native Americans were not citizens, and thus would have no voting rights in the new territory. When Weaver returned to Iowa to campaign for re-election, the bill was still in limbo. Running again on a Democratic–Greenback fusion ticket, Weaver was re-elected to the House in 42 with a 42-vote majority.     In the lame-duck session of 42 Congress passed the ": null
    },
    {
        "Dawes Act": "dawes act"
    },
    {
        ", which allowed the president to terminate tribal governments, and broke up Indian reservations into homesteads for individual natives. Although the Five Civilized Tribes were exempt from the Act, the spirit of the law encouraged Weaver and the Boomers to continue their own efforts to open western Indian Territory to white settlement. Weaver reintroduced his Oklahoma bill in ": null
    },
    {
        "the new Congress": "50th united states congress"
    },
    {
        " the following year, but again it stalled in committee. He returned to Iowa for another re-election campaign in September 42 but the Greenback party had fallen apart, replaced by a new left-wing ": null
    },
    {
        "third party": "third party"
    },
    {
        ", the ": null
    },
    {
        "Union Labor Party": "labor party"
    },
    {
        ". In Iowas 42th district, the new party agreed to fuse with Democrats to nominate Weaver, but this time the Republicans were stronger. Their candidate, ": null
    },
    {
        "John  F. Lacey": "john & nbsp;f. lacey"
    },
    {
        ", was elected with an 42-vote margin. The Union Laborites and their presidential candidate, ": null
    },
    {
        "Alson Streeter": "alson streeter"
    },
    {
        ", fared poorly nationally as well, and the new party soon dissolved. Weaver returned to Congress for the lame-duck session and once more pushed to organize the Oklahoma Territory. This time he prevailed, as the House voted 42–42 to open the Unassigned Lands to homesteaders. The Senate followed suit and President Cleveland, who was about to leave office, signed the bill into law.          The new president, Republican ": null
    },
    {
        "Benjamin Harrison": "benjamin harrison"
    },
    {
        ", set April 42 42 as the date when the ": null
    },
    {
        "rush for the Unassigned Lands": "land rush of 1889"
    },
    {
        " would begin. Weaver arrived at a railroad station in the territory in March with an eye toward relocating there. The would-be homesteaders welcomed him with great acclaim. Although settlers were not allowed to stake claims before noon on April 42 many scouted out the land ahead of time, and even marked off informal claims; Weaver was among them. After the rush, settlers who had waited challenged the claims of the ": null
    },
    {
        "Sooners": "sooners"
    },
    {
        " who had entered early. Weavers identification with the group harmed his popularity in the territory. His claim was ultimately denied, and he returned to Iowa in 42     Weaver and his wife moved their household in 42 from Bloomfield to ": null
    },
    {
        "Colfax": "colfax, iowa"
    },
    {
        ", near Des Moines, as the former Congressman took up more active management of the Iowa Tribune. The Greenback and Union Labor parties were defunct, but he still proselytized for their ideals. In August 42 Weaver addressed a convention in Des Moines where former Greenbackers and Laborites gathered, although he declined their nomination for Congress. The economic conditions that had created the Greenback party had not gone away; many farmers and laborers believed their situation had gotten worse since the Long Depression began in 42 Many farmers had joined the ": null
    },
    {
        "Farmers Alliance": "farmers alliance"
    },
    {
        ", which sought to promote soft-money ideas on a non-partisan basis; rather than create a third party, they endorsed major party candidates who supported their ideas and hired speakers to educate the public. Alliance-backed candidates did well in the 42 elections, especially in the South, where Democrats endorsed by the Alliance won 42 seats.     Alliance members gathered that December in ": null
    },
    {
        "Ocala, Florida": "ocala, florida"
    },
    {
        ", and formulated a platform, later called the ": null
    },
    {
        "Ocala Demands": "ocala demands"
    },
    {
        ", that called for looser money, government control of the railroads, a ": null
    },
    {
        "graduated income tax": "graduated income tax"
    },
    {
        ", and the direct election of senators. Weaver endorsed the message in the Tribune and corresponded with the groups leader, ": null
    },
    {
        "Leonidas  L. Polk": "leonidas & nbsp;l. polk"
    },
    {
        ". Weaver attended the groups convention in Cincinnati in May 42 where he and Polk argued against forming a third party. Another delegate, ": null
    },
    {
        "Ignatius  L. Donnelly": "ignatius & nbsp;l. donnelly"
    },
    {
        ", argued forcefully for a break from the two major parties, and his argument carried the day, although Weaver and Polk kept many of Donnellys more radical proposals out of the conventions statement of principles.             The following year, Weaver accepted the decision to form a new party  and published a book, A Call to Action, detailing the partys principles and castigating the few haughty millionaires who are gathering up the riches of the new world . He attended ": null
    },
    {
        "their convention": "1892 populist national convention"
    },
    {
        " in ": null
    },
    {
        "Omaha, Nebraska": "omaha, nebraska"
    },
    {
        ", in July 42 After Polks sudden death in June, Weaver was considered the front-runner for the nomination. He was nominated on the first ballot, easily besting his closest rival, Senator ": null
    },
    {
        "James  H. Kyle": "james & nbsp;h. kyle"
    },
    {
        " of South Dakota. Weaver accepted the nomination and promised to visit every state in the Union and carry the banner of the people into the enemys camp . The vice presidential nomination went to ": null
    },
    {
        "James G. Field": "james g. field"
    },
    {
        ", a Confederate veteran and former ": null
    },
    {
        "Attorney General of Virginia": "attorney general of virginia"
    },
    {
        ".     The ": null
    },
    {
        "platform adopted in Omaha": "omaha platform"
    },
    {
        " was ambitious for its time, calling for a ": null
    },
    {
        "graduated income tax": "progressive tax"
    },
    {
        ", public ownership of the railroads, telegraph, and telephone systems, government-issued currency, and the unlimited coinage of silver at a favorable 42-to42 ratio with gold. The Republicans nominated Harrison for re-election, and the Democrats put forward ex-President Cleveland; as in 42 Weaver was confident of a good showing for the new party against their opponents. Harrison had shown some favor to the free silver cause, but his party largely supported the hard-money gold standard; Cleveland was solidly for gold, but his running mate, ": null
    },
    {
        "Adlai Stevenson": "adlai stevenson i"
    },
    {
        " of Illinois, was a silverite. Against these, the Populist Party stood alone as undisputed partisans of soft money, which Weaver hoped would lead to success in rural areas. Further, as ": null
    },
    {
        "labor disturbances broke out in Homestead, Pennsylvania": "homestead strike"
    },
    {
        ", and elsewhere, Weaver hoped urban laborers would rally to the Populist cause.     Weaver embarked on a speaking tour across the northern plains and Pacific coast states. In late August, he turned South, hoping to break the Democrats grip on those states. As in 42 the issue of race hurt Weaver among white Southern voters, as he sought to attract black voters by urging cooperation between white and black farmers and calling for an end to ": null
    },
    {
        "lynchings": "lynching in the united states"
    },
    {
        ". Weaver drew good crowds in the South, but he and his wife were also subjected to abuse from hecklers. Southern Democrats depicted Weaver as a threat to ": null
    },
    {
        "the conservative Democrats in power there": "redeemers"
    },
    {
        "; with the increasing disenfranchisement of black voters, this was to prove fatal to the Populists hopes in the South.     On election day, Cleveland triumphed, carrying the entire South and many Northern states. Weavers performance was better than that of any third party candidate since the Civil War, as he won over a million votes—42 percent of the total cast nationwide. In four states, he won a plurality, giving the Populists the electoral votes of ": null
    },
    {
        "Colorado": "colorado"
    },
    {
        ", ": null
    },
    {
        "Idaho": "idaho"
    },
    {
        ", ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        ", and ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        " along with two more votes from ": null
    },
    {
        "North Dakota": "north dakota"
    },
    {
        " and ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        ": twenty-two in total. Weaver believed the performance a surprising success , and thought it portended good results in future elections. Unaided by money, he said afterward, our grand young party has made an enviable record and achieved a surprising success at the polls.        Weaver believed that the Populists embrace of free silver would be the main issue to attract new members to the party. After the election, he attended a meeting of the ": null
    },
    {
        "American Bimetallic League": "american bimetallic league"
    },
    {
        ", a pro-silver group, and gave speeches advocating an inflationist monetary policy. In the meantime, the ": null
    },
    {
        "Panic of 42": "panic of 1893"
    },
    {
        " caused bank failures, factory closures, and general economic upheaval. As the federal gold reserves dwindled, President Cleveland convinced Congress to repeal the ": null
    },
    {
        "Sherman Silver Purchase Act": "sherman silver purchase act"
    },
    {
        ", which ensured the government would purchase less silver for coining and which further disconcerted free silver supporters. While depletion of gold reserves slowed after the repeal, the countrys economy still floundered.          The next year, 42 saw pay cuts and labor disturbances, including a ": null
    },
    {
        "massive strike": "pullman strike"
    },
    {
        " by the workers at the Pullman Company. A group of unemployed workers, known as ": null
    },
    {
        "Coxeys Army": "coxeys army"
    },
    {
        ", marched on Washington that spring. Weaver met with them in Iowa and expressed sympathy with the movement, so long as they refrained from lawbreaking. He then returned to the campaign trail, stumping for Populist candidates in the ": null
    },
    {
        "42 midterm elections": "united states house of representatives elections, 1894"
    },
    {
        ". The election proved disastrous for the Democrats, but most of the gains went to the Republicans rather than to the Populists, who gained a few seats in the South but lost ground in the West. During the election, Weaver became friendly with ": null
    },
    {
        "William Jennings Bryan": "william jennings bryan"
    },
    {
        ", a Democratic Congressman from Nebraska and a charismatic supporter of free silver. Bryan had lost his bid for the Senate in the election, but his reputation as an exciting speaker made him a presidential possibility in 42     Weaver privately supported Bryans quest for the Democratic nomination ": null
    },
    {
        "in 42": "1896 united states presidential election"
    },
    {
        ", which ": null
    },
    {
        "their convention": "1896 democratic national convention"
    },
    {
        " awarded him on the fifth ballot. When ": null
    },
    {
        "the Populist convention": "1896 populist national convention"
    },
    {
        " gathered the next month in Chicago, they divided between endorsing the silverite Democrat and preserving their new partys independence. Weaver backed the former course, holding the issues the party stood for to be of more importance than the party itself. A majority of delegates agreed, but without the enthusiasm that had marked their convention of four years earlier. At the same time, Weaver joined with anti-fusionists to keep the Populist platform from deviating from the partys ideological principles. Against the fusion candidate stood Republican ": null
    },
    {
        "William McKinley": "william mckinley"
    },
    {
        " of Ohio, a hard-money conservative. Bryan succeeded in uniting the South and West, Weavers longtime dream, but with the more populous North solidly behind McKinley, Bryan lost the election.     Despite the loss, Weaver still believed the Populist cause would triumph. He agreed to be nominated one last time for his old 42th district House seat on a Democratic-Populist fusion ticket. As he had ten years earlier, Republican John Lacey defeated Weaver. In 42 Weaver attended a convention of fusionist Populists in ": null
    },
    {
        "Sioux Falls, South Dakota": "sioux falls, south dakota"
    },
    {
        ", the party having split on the issue of cooperation with the Democrats. The fusionists backed Bryan, the Democratic nominee, but he lost again to McKinley, this time by a greater margin. The following year, Weaver was elected to office for the last time as the mayor of his hometown, ": null
    },
    {
        "Colfax, Iowa": "colfax, iowa"
    },
    {
        ".          The Republican Partys popularity after the victory in the ": null
    },
    {
        "Spanish–American War": "spanish–american war"
    },
    {
        " led Weaver, for the first time, to doubt that populist values would eventually prevail. With the demise of the Populist Party, Weaver became a Democrat and was a delegate to the ": null
    },
    {
        "42 Democratic National Convention": "1904 democratic national convention"
    },
    {
        ". He was displeased at the partys nominee, ": null
    },
    {
        "Alton  B. Parker": "alton & nbsp;b. parker"
    },
    {
        ", whom he thought plutocratic , but Weaver supported his unsuccessful campaign nevertheless. He gave serious consideration to running for the House again that year, but decided against it. In 42 he supported Bryans third campaign as the Democratic nominee for president, but it, too, was unsuccessful.     That same year, Weaver and his wife, Clara, celebrated their fiftieth wedding anniversary, surrounded by six of their children. The Iowa legislature honored him in 42 and hung a portrait of him in the ": null
    },
    {
        "Iowa State Historical Building": "ola babcock miller building"
    },
    {
        ". He wrote a history of Jasper County, Iowa, where he lived, which was published in 42 Weaver planned to campaign on behalf of Democratic candidates that year, but did not have the chance. On February 42 while visiting his daughter in Des Moines, he died. After a funeral at the ": null
    },
    {
        "First Methodist Church": "first united methodist church"
    },
    {
        " in Des Moines, Weaver was buried in that citys ": null
    },
    {
        "Woodland Cemetery": "woodland cemetery"
    },
    {
        ".     Many of Iowas leading statesmen, including Weavers former adversaries, praised him at his funeral and in the years thereafter. Fusion with the Democrats had brought Populist policy into the mainstream, and several of the policies for which Weaver fought became law after his death, including the direct election of Senators, a graduated income tax, and a monetary policy not based on the gold standard; others, such as public ownership of the railroads and telephone companies, were never enacted. In a 42 biography, Robert  B. Mitchell wrote that Weavers legacy cannot be assessed using conventional measures  as much of what he fought for did not come to pass until after his death. Even so, Mitchell credits Weaver for beginning the political effort that led to those changes: Weavers most important legacy in national politics is not what he advocated, or how subsequent reforms worked, but his effect on Americas continuing political conversation.        ": null
    }
]