[
    {
        "             James Miranda Steuart Barry  was a military surgeon in the ": null
    },
    {
        "British Army": "british army"
    },
    {
        ", born in Cork, Ireland. Barry obtained a medical degree from the ": null
    },
    {
        "University of Edinburgh Medical School": "university of edinburgh medical school"
    },
    {
        ", then served first in ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        ", South Africa and subsequently in many parts of the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        ". Before retirement, Barry had risen to the rank of Inspector General  in charge of ": null
    },
    {
        "military hospital": "military hospital"
    },
    {
        "s, the second highest medical office in the British Army. Barry not only improved conditions for wounded soldiers, but also the conditions of the native inhabitants, and performed the first ": null
    },
    {
        "caesarean section": "caesarean section"
    },
    {
        " in Africa by an Irish surgeon in which both the mother and child survived the operation.     Although Barrys entire adult life was lived as a man, Barry was born Margaret Ann Bulkley and was known as female in childhood. Barry lived as a man in both public and private life, at least in part in order to be accepted as a university student and pursue a career as a surgeon, with Barrys birth sex only becoming known to the public and to military colleagues after death.         Other than some personal correspondence, there are few sources of information about the non-military parts of Barrys life. The scant available evidence provides a skeleton onto which a great deal of myth and speculation has been added by various commentators. In his detailed research into Barrys early life, Michael Du Preez states that Barry was born in ": null
    },
    {
        "Cork": "cork"
    },
    {
        " in 42 a birth date based on Mrs Bulkleys description of her child being fifteen years old in a letter dated 42 January 42 Various other sources give birth dates of 42 42 and 42 but these dates are almost certainly the result of Barry later lying about age on official documents to aid passing as a man.     Barry was the second child born to Jeremiah and Mary-Ann Bulkley, and was given the name Margaret Anne. Mary-Ann Bulkley was the sister of ": null
    },
    {
        "James Barry": "james barry"
    },
    {
        ", a celebrated Irish artist and professor of painting at Londons Royal Academy. Jeremiah Bulkley ran the ": null
    },
    {
        "weigh house": "weigh house"
    },
    {
        " in Merchants Quay, Cork. However, ": null
    },
    {
        "anti-Catholic sentiment": "anti-catholicism"
    },
    {
        " led to his dismissal from this post. This and subsequent financial mismanagement left Mary-Ann and Barry without the support of either Jeremiah Bulkley  or later the Bulkleys married son John. A third child appeared in the Bulkley family and was named Juliana. Although presented as being Barrys sister, it is likely that she was Barrys daughter as a result of childhood sexual assault, as the charwoman who discovered Barrys sex when laying out the body stated that ": null
    },
    {
        "pregnancy stretch marks": "stretch marks"
    },
    {
        " were present.     The teenage Barry was educated with the prospect of becoming a ": null
    },
    {
        "tutor": "governess"
    },
    {
        ", but given a lack of evidence of any work history, the Bulkleys appear to have struggled to find Barry any suitable tutoring positions. A conspiracy appears to have developed between Barry, Mary-Ann Bulkley and some of the late James Barrys influential, liberal-minded friends  to enable the teenage Barry to enter medical school. The ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        " was chosen and Mary-Ann and Barry boarded a ": null
    },
    {
        "Leith": "leith"
    },
    {
        " smack": "smack"
    },
    {
        " on 42 November 42 And so, Margaret Anne Bulkley became James Barry, nephew of the late ": null
    },
    {
        "James Barry RA": "james barry"
    },
    {
        " the Irish romantic painter and remained known thus for the next 42 years. In a letter to Daniel Readon, sent on 42 December, Barry asked for any letters addressed to Margaret Bulkley to be forwarded to Mary-Ann Bulkley , and mentions that ...it was very usefull  for Mrs. Bulkley to have a Gentleman to take care of her on Board Ship and to have one in a strange country.... Although the letter was signed James Barry , the solicitor indiscreetly wrote on the back of the envelope Miss Bulkley, 42 December; this crucial piece of evidence was the one which enabled researchers to finally confirm that Margaret Bulkley and James Barry were one and the same.     Arriving in Edinburgh in November 42 Barry began studies at the ": null
    },
    {
        "Medical School": "university of edinburgh medical school"
    },
    {
        " as a literary and medical student. Barrys short stature, unbroken voice, delicate features and smooth skin led many to suspect that Barry was a young boy not past puberty, and the University Senate initially attempted to block Barrys application for the final examinations due to this apparent youth. However, the ": null
    },
    {
        "Earl of Buchan": "david erskine, 11th earl of buchan"
    },
    {
        ", a friend of Dr Fryer and Barrys late namesake, persuaded the Senate to relent and Barry qualified ": null
    },
    {
        "Medicinae Doctor ": "doctor of medicine"
    },
    {
        " in 42 Barry then moved back to London, signing up for the Autumn Course 42/42 as a pupil of the United Hospitals of ": null
    },
    {
        "Guys": "guys hospital"
    },
    {
        " and ": null
    },
    {
        "St Thomas": "st thomas hospital"
    },
    {
        ", whose teachers included ": null
    },
    {
        "Henry Cline": "henry cline"
    },
    {
        " and celebrated surgeon ": null
    },
    {
        "Astley Cooper": "astley cooper"
    },
    {
        ". On 42 July 42 Barry successfully passed the examination of the ": null
    },
    {
        "Royal College of Surgeons of England": "royal college of surgeons of england"
    },
    {
        ".            Upon joining the army, Barry was commissioned as a Hospital Assistant in the British Army on 42 July 42 taking up posts in Chelsea and then the ": null
    },
    {
        "Royal Military Hospital in Plymouth": "hmnb devonport"
    },
    {
        ", achieving a promotion to Assistant Surgeon to the Forces, equivalent to lieutenant, on 42 December 42       Following this military training, Barry was posted to ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        ", South Africa in 42 Through Lord Buchan, Barry had a letter of introduction to the Governor, ": null
    },
    {
        "Lieutenant General Lord Charles Henry Somerset": "lord charles somerset"
    },
    {
        ". Following the successful, even spectacular, treatment of Lord Charless sick daughter, Barry was welcomed into the family, maintained a close friendship with the Governor, and became his personal physician. In 42 Somerset appointed Barry as Colonial Medical Inspector, an extraordinary jump in expectations from Barrys low military rank which brought with it great responsibility. Over ten years of work in the Cape, Barry effected significant changes, among them improvements to sanitation and water systems, improved conditions for slaves, prisoners and the mentally ill, and provision of a sanctuary for the leper population. Barry also performed one of the first known successful ": null
    },
    {
        "Caesarean section": "caesarean section"
    },
    {
        "s in which both mother and child survived; the child was christened ": null
    },
    {
        "James Barry Munnik": "james barry munnik"
    },
    {
        " in Barrys honour, and the name was passed down through the family, leading to Barrys name being borne by a later Prime Minister of South Africa, ": null
    },
    {
        "J. B. M. Hertzog": "j. b. m. hertzog"
    },
    {
        ". Barry also gained enemies by criticising local officials and their handling of medical matters, but the advantage of a close relationship with the Governor meant that the repercussions of these outspoken views were usually smoothed over.     Barry was promoted to Surgeon to the Forces on 42 November 42  Barrys subsequent posting was to ": null
    },
    {
        "Mauritius": "mauritius"
    },
    {
        " in 42 In 42 Barry risked a great deal of trouble by going absent without leave to return to England and treat Somerset, who had fallen ill, and remained there until Somersets death in 42 Barrys subsequent posting was to ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        ", and then the island of ": null
    },
    {
        "Saint Helena": "saint helena"
    },
    {
        " in 42 At St Helena, one clash with a fellow army surgeon resulted in Barry being arrested and ": null
    },
    {
        "court-martial": "court-martial"
    },
    {
        "led on a charge of conduct unbecoming of the character of an Officer and a Gentleman . Barry was found not guilty, and honourably acquitted.     In 42 Barry was posted to the ": null
    },
    {
        "Leeward Islands": "leeward islands"
    },
    {
        " and ": null
    },
    {
        "Windward Islands": "windward islands"
    },
    {
        " of the West Indies, there focusing on medicine, management and improving the conditions of the troops, and receiving a promotion to ": null
    },
    {
        "Principal Medical Officer": "royal army medical corpsmilitary abbreviations applicable to the medical corps"
    },
    {
        ". In 42 Barry contracted ": null
    },
    {
        "yellow fever": "yellow fever"
    },
    {
        " and left for England for sick leave in October. After being cleared for duty, Barry was posted to ": null
    },
    {
        "Malta": "malta"
    },
    {
        " in 42 Here Barry was severely reprimanded for inexplicably taking a seat in the local church that was reserved for the clergy, and had to deal with the threat – and eventual actuality – of ": null
    },
    {
        "a cholera epidemic": "1846–1860 cholera pandemic"
    },
    {
        ", which broke out in 42     The following posting was to ": null
    },
    {
        "Corfu": "corfu"
    },
    {
        " in 42 which brought with it a promotion to the rank of Deputy Inspector-General of Hospitals on 42 May, equivalent to ": null
    },
    {
        "lieutenant colonel": "lieutenant colonel"
    },
    {
        ".   From here, Barry temporarily visited the ": null
    },
    {
        "Crimea": "crimea"
    },
    {
        " on leave — as a request to be posted there officially had been denied — where an argument took place between Barry and ": null
    },
    {
        "Florence Nightingale": "florence nightingale"
    },
    {
        " at ": null
    },
    {
        "Scutari Hospital": "selimiye barracks"
    },
    {
        ". Finally, in 42 Barry was posted to Canada, and granted the local rank of ": null
    },
    {
        "Inspector General": "inspector generalunited kingdom"
    },
    {
        " of Hospitals  on 42 September.  In that position, Barry fought for better food, sanitation and proper medical care for prisoners and ": null
    },
    {
        "lepers": "leprosy"
    },
    {
        ", as well as soldiers and their families. This local rank was confirmed as substantive on 42 December 42         Wherever Barry served across the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        ", improvements were made to sanitary conditions and the conditions and diet of both the common soldier and other, under-represented groups. Barry was outraged by unnecessary suffering, and took a heavy-handed and sometimes tactless approach to demanding improvements for the poor and underprivileged which often incited anger from officials and military officers; on several occasions Barry was both arrested and demoted for the extremity of this behaviour. Barry held strict and unusually modern views about nutrition, being completely ": null
    },
    {
        "vegetarian": "vegetarianism"
    },
    {
        " and ": null
    },
    {
        "teetotal": "teetotalism"
    },
    {
        ", and, while keeping most personal relationships distant, was very fond of pets, particularly a beloved poodle named Psyche. Playwright Jean Binnies radio play Doctor Barry identified John Joseph Danson as the black servant Barry first employed in South Africa and who remained with Barry until the doctors death.          Despite protesting the decision, Barry was forcefully retired by the army on 42 July 42 due to ill health and old age, and was succeeded as inspector general of hospitals by ": null
    },
    {
        "David Dumbreck": "david dumbreck"
    },
    {
        ".  After a quiet retirement in London, Barry finally died from ": null
    },
    {
        "dysentery": "dysentery"
    },
    {
        " on 42 July 42 The identity of the woman who discovered the truth of Barrys sex is disputed, but she was probably a charwoman who also laid out the dead. The charwoman, after failing to elicit payment for her services, sought redress in another way; she visited Barrys physician, Major D. R. McKinnon, who had issued the death certificate upon which Barry was identified as male. The woman claimed that Barrys body had been biologically female and had marks suggesting Barry had at one point borne a child. When McKinnon refused to pay her, she took the story to the press, and the situation became public. It was discussed in an exchange of letters between George Graham of the General Register Office, and Dr McKinnon.     Sir,     It has been stated to me that Inspector-General Dr James Barry, who died at 42 Margaret Street on 42 July 42 was after his death found to be female.     As you furnished the Certificate as to the cause of his death, I take the liberty of asking you whether what I have heard is true, and whether you yourself ascertained that he was a woman and apparently had been a mother?     Perhaps you may decline answering these questions; but I ask them not for publication but for my own information.     Your faithful servant     George Graham       McKinnons response was as follows:     Sir,     I had been intimately acquainted with the doctor for good many years, both in London and the West Indies and I never had any suspicion that Dr Barry was a woman. I attended him during his last illness, . On one occasion after Dr Barry’s death at the office of Sir Charles McGregor, there was the woman who performed the last offices for Dr Barry was waiting to speak to me. She wished to obtain some prerequisites of his employment, which the Lady who kept the lodging house in which Dr Barry died had refused to give her. Amongst other things she said that Dr Barry was a female and that I was a pretty doctor not to know this and she would not like to be attended by me. I informed her that it was none of my business whether Dr Barry was a male or a female, and that I thought that she might be neither, viz. an imperfectly developed man. She then said that she had examined the body, and was a perfect female and farther that there were marks of him having had a child when very young. I then enquired how have you formed that conclusion. The woman, pointing to the lower part of her stomach, said ‘from marks here. I am a maried woman and the mother of nine children and I ought to know.’     The woman seems to think that she had become acquainted with a great secret and wished to be paid for keeping it. I informed her that all Dr Barry’s relatives were dead, and that it was no secret of mine, and that my own impression was that Dr Barry was a Hermaphrodite. But whether Dr Barry was a male, female, or hermaphrodite I do not know, nor had I any purpose in making the discovery as I could positively swear to the identity of the body as being that of a person whom I had been acquainted with as Inspector-General of Hospitals for a period of years.     Yours faithfully,     D.R. McKinnon       After the matter was made public, many people claimed to have known it all along . The British Army, seeking to suppress the story, sealed all records of Barry for the next 42 years. The historian Isobel Rae gained access to the army records in the 42s, and concluded that James Barry the painter was indeed Barrys uncle. Barry was buried in ": null
    },
    {
        "Kensal Green Cemetery": "kensal green cemetery"
    },
    {
        " under the name James Barry and full military rank. It was claimed by several sources that the manservant who always attended Barry returned to ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        ", but his actual fate is unknown.         In a letter chiding John Bulkley, Barrys older brother, for abandoning legal studies for the military, 42-year-old Barry wrote: Was I not a girl I would be a Soldier! .     Barrys interest in medicine was probably encouraged by the liberal-minded friends of the late ": null
    },
    {
        "James Barry": "james barry"
    },
    {
        " RA, and just before travelling to Edinburgh to enroll as a medical student in 42 Barry assumed a male identity. A short stature, slight build, unbroken voice, delicate features and smooth skin led others to suspect that Barry was not a man but a ": null
    },
    {
        "pre-pubescent": "preadolescenceprepubescence, puberty and range"
    },
    {
        " boy. This identity was maintained through surgical training and recruitment into the ": null
    },
    {
        "British Army": "british army"
    },
    {
        " which, at officer rank level, did not then require a medical examination.     During Barrys first posting abroad to Cape Town in South Africa, Barry became a close friend of the Governor, Lord Charles Somerset, and his family. It has been suggested that Lord Charles discovered Dr Barrys secret and that the relationship was more than friendship. Their closeness led to rumours and ultimately an accusation briefly appearing on a bridge post in Cape Town on 42 June 42 saying that the writer had detected Lord Charles buggering Dr Barry , which led to a court trial and investigation, as ": null
    },
    {
        "homosexuality": "homosexuality"
    },
    {
        " was at that time strictly illegal. Despite these allegations, if Somerset was aware of Barrys sex, he did not reveal it.     Despite efforts to appear masculine, witness reports comment on Barrys effeminacy and on a somewhat contradictory reputation – Barry had a reputation for being tactless, impatient, argumentative and opinionated, but was also considered to have had a good ": null
    },
    {
        "bedside manner": "doctor-patient relationshipbedside manner"
    },
    {
        " and famous professional skill. Barrys temper and bravado led to a famous pistol duel with Captain ": null
    },
    {
        "Josias Cloete": "abraham josias cloëté"
    },
    {
        " of the 42st Light Dragoons. Barrys aim was better, the bullet striking Cloetes ": null
    },
    {
        "shako": "shako"
    },
    {
        " military cap and removing its peak, which dissipated its force.     During the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        " , Barry got into an argument with ": null
    },
    {
        "Florence Nightingale": "florence nightingale"
    },
    {
        ". After Barrys death Nightingale wrote that: I never had such a blackguard rating in all my life – I who have had more than any woman – than from this Barry sitting on his horse, while I was crossing the Hospital Square with only my cap on in the sun. He kept me standing in the midst of quite a crowd of soldiers, Commissariat, servants, camp followers, etc., etc., every one of whom behaved like a gentleman during the scolding I received while he behaved like a brute . . . After he was dead, I was told that was a woman . . . I should say that was the most hardened creature I ever met.   Barry would never allow anyone into the room while undressing, and repeated a standing instruction that in the event of his death, strict precautions should be adopted to prevent any examination of his person  and that the body should be buried in bed sheets without further inspection , indicating a desire to conceal physical sex both in life and in death. We Are Family, an LGBT magazine, argues that this is strong evidence of Barrys having been a transgender man, given that his wish was to die and be remembered as a man.          picked up on Major McKinnons statement that he did not know whether Barry was male, female or hermaphrodite and suggested that it might be more appropriate to say that Barry was ": null
    },
    {
        "hermaphrodite": "hermaphrodite"
    },
    {
        " or ": null
    },
    {
        "intersex": "intersex"
    },
    {
        " rather than female , and may have had ambiguous genitalia . These suppositions are based on the premise that Concealment of ones sex for ... 42 years in the British Army, is simply unbelievable . However,  show how Barry might have been able to conceal this secret from all but a few people, and those who did know did not reveal it while Barry was alive. N. Turner has commented on Kubba and Youngs conclusion that the belief in an intersex condition was based on vanishingly slim evidence .      also raises the possibility of Barry being intersex, but acknowledges the impossibility of knowing, expressing surprise that this is a problem for so many people. The suggestion that Barry may have been intersex has been criticised for both biological and social reasons. In a review of Holmes biography,  firmly rejects the implication that Barry might have been intersex.     , among other ": null
    },
    {
        "LGBT": "lgbt"
    },
    {
        " theorists, has voiced the opinion that the intersex theory is an attempt to impose ": null
    },
    {
        "cisgender": "cisgender"
    },
    {
        " male characteristics onto Barry so as to undermine the concept that a transgender man could have achieved as much as Barry did.         A 42 ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " production appears to be the first dramatic representation of Barry. The 42-minute play, Dr Barry by Jean Binnie, was re-broadcast as recently as 42      In 42 ": null
    },
    {
        "Anna Massey": "anna massey"
    },
    {
        " played Barry in an episode of the BBC ": null
    },
    {
        "drama-documentary": "docudrama"
    },
    {
        " The Experiment. Barry was compared with ": null
    },
    {
        "Hannah Cullwick": "hannah cullwick"
    },
    {
        ", who was experimented on by Arhur Munby, who believed that women in servile labour could earn a nobility of the soul .      Barrys life is the subject of the historical novel James Miranda Barry  by ": null
    },
    {
        "Patricia Duncker": "patricia duncker"
    },
    {
        ".     A 42 play, Whistling Psyche by ": null
    },
    {
        "Sebastian Barry": "sebastian barry"
    },
    {
        ", imagines a meeting between James Barry and ": null
    },
    {
        "Florence Nightingale": "florence nightingale"
    },
    {
        ".     In 42 the UK folk duo Gilmore and Roberts included a song about Barry called Doctor James on their album The Innocent Left.      In April 42 ": null
    },
    {
        "Rachel Weisz": "rachel weisz"
    },
    {
        " said that she is developing a ": null
    },
    {
        "biopic": "biopic"
    },
    {
        " of Barry, and intends to produce and star in it.      In February 42 ": null
    },
    {
        "E.J. Levy": "e.j. levy"
    },
    {
        "s novel about Barry was acquired by ": null
    },
    {
        "Little, Brown and Company": "little, brown and company"
    },
    {
        ".  The announcement was met with controversy because Levy refers to Barry as she and a heroine,  though Levy has stated that the novel also refers to Barry as he and I . ": null
    }
]