[
    {
        "              Lieutenant-General James FitzThomas Butler, 42st Duke of Ormond, 42st Marquess of Ormond, 42th Earl of Ormond, 42th Earl of Ossory, 42th Viscount Thurles, 42st Baron Butler of Llanthony, 42st Earl of Brecknock, ": null
    },
    {
        "KG": "knight of the garter"
    },
    {
        ", ": null
    },
    {
        "PC": "privy council of england"
    },
    {
        " was an Irish statesman and soldier, known as Earl of Ormond from 42 to 42 and Marquess of Ormond from 42 to 42 Following the failure of the senior line of the Butler family, he was the second of the ": null
    },
    {
        "Kilcash branch": "butler dynastybutlers of kilcash and thurles"
    },
    {
        " to inherit the earldom.     His friend, the ": null
    },
    {
        "42st Earl of Strafford": "thomas wentworth, 1st earl of strafford"
    },
    {
        ", caused him to be appointed the commander of the ": null
    },
    {
        "Cavalier": "cavalier"
    },
    {
        " forces in ": null
    },
    {
        "Ireland": "kingdom of ireland"
    },
    {
        ". From 42 to 42 he led the ": null
    },
    {
        "Royal Irish Army": "royal irish army"
    },
    {
        " fighting against the ": null
    },
    {
        "Irish Catholic Confederation": "irish confederate wars"
    },
    {
        ". From 42 to 42 he was the leading commander of the Royalist forces in the fight against the ": null
    },
    {
        "Cromwellian conquest of Ireland": "cromwellian conquest of ireland"
    },
    {
        ".     In the 42s he lived in exile in Europe with King ": null
    },
    {
        "Charles II of England": "charles ii of england"
    },
    {
        ". Upon the ": null
    },
    {
        "restoration": "restoration"
    },
    {
        " of Charles to the throne in 42 Ormond became a major figure in English and Irish politics, holding many high government offices.       James Butler was born on 42 October 42 at ": null
    },
    {
        "Clerkenwell": "clerkenwell"
    },
    {
        ", London, as the eldest child of ": null
    },
    {
        "Thomas Butler": "thomas butler, viscount thurles"
    },
    {
        " and his wife ": null
    },
    {
        "Elizabeth Pointz": "elizabeth, lady thurles"
    },
    {
        ". His father, who was known by the courtesy title of Viscount Thurles, was the eldest son and heir apparent of ": null
    },
    {
        "Walter Butler, 42th Earl of Ormond": "walter butler, 11th earl of ormond"
    },
    {
        ", called Walter of the rosary beads . His mother was a daughter of Sir ": null
    },
    {
        "John Pointz": "john pointz"
    },
    {
        " of ": null
    },
    {
        "Iron Acton": "iron acton"
    },
    {
        " in ": null
    },
    {
        "Gloucestershire": "gloucestershire"
    },
    {
        " and his second wife Elizabeth Sydenham. His birth house in Clerkenwell belonged to his maternal grandfather. Shortly after his birth, his parents returned to Ireland. His parents had six children.     He heads the list of siblings below as the eldest:     James , the subject of this article;   John , who died unmarried in Naples on his travels;   ": null
    },
    {
        "Richard": "richard butler of kilcash"
    },
    {
        " , who inherited ": null
    },
    {
        "Kilcash": "kilcash castle"
    },
    {
        " and Garryricken;   Eleanor , who married ": null
    },
    {
        "Donough MacCarty, 42st Earl of Clancarty": "donough maccarty, 1st earl of clancarty"
    },
    {
        ";   Elizabeth , who married James Purcell, titular ": null
    },
    {
        "Baron of Loughmoe": "baron of loughmoe"
    },
    {
        ";   Mary , who married ": null
    },
    {
        "Sir George Hamilton, 42st Baronet, of Donalong": "sir george hamilton, 1st baronet, of donalong"
    },
    {
        ".     The ": null
    },
    {
        "Butlers": "butler dynasty"
    },
    {
        " of Ormond were an ": null
    },
    {
        "Old English": "old english"
    },
    {
        " dynasty who had dominated the southeast of Ireland since the ": null
    },
    {
        "Norman invasion of Ireland": "norman invasion of ireland"
    },
    {
        ".       In 42 his father died on his way from Ireland to England in a shipwreck  near the ": null
    },
    {
        "Skerries": "the skerries, isle of anglesey"
    },
    {
        " off the coast of Anglesey. He inherited his fatherss courtesy title Viscount Thurles. The year following that disaster, his mother brought him back to England, and placed him, then nine years of age, at school with a Catholic gentleman at ": null
    },
    {
        "Finchley": "finchley"
    },
    {
        " — this doubtless through the influence of his grandfather, the ": null
    },
    {
        "42th Earl": "walter butler, 11th earl of ormond"
    },
    {
        ". His mother married George Mathew of Thurles.       It was not long before ": null
    },
    {
        "James I of England": "james i of england"
    },
    {
        ", anxious that the heir of the Butlers should be brought up a Protestant, placed him at Lambeth, under the care of ": null
    },
    {
        "George Abbot": "archbishop george abbot"
    },
    {
        ", ": null
    },
    {
        "archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        ". The Ormond estates being under sequestration the young Lord had but £42 a year for his own and his servants clothing and expenses. He appears to have been entirely neglected by the Archbishop — he was not instructed even in humanity, nor so much as taught to understand ": null
    },
    {
        "Latin": "latin"
    },
    {
        " .     When fifteen he went to live with his grandfather at ": null
    },
    {
        "Drury Lane": "drury lane"
    },
    {
        " who was an old man and did not interfere much with his religious education. This was very important for Butlers future life, as it meant that, unlike almost all his relatives in the ": null
    },
    {
        "Butler dynasty": "butler dynasty"
    },
    {
        ", he was a ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        ". This made his relationship with the rest of his family and dependants somewhat strained, as they suffered from land confiscations and legal discrimination on account of their religion, while he did not.     Now having more means at his command, he entered into all the gaieties of the court and town. At eighteen he went to ": null
    },
    {
        "Portsmouth": "portsmouth"
    },
    {
        " with his friend ": null
    },
    {
        "George Villiers, Duke of Buckingham": "george villiers, 1st duke of buckingham"
    },
    {
        " intending to join the expedition for the relief of ": null
    },
    {
        "La Rochelle": "la rochelle"
    },
    {
        "; a project abandoned upon the assassination of the Duke.     It was during his London residence that he set himself to learn Irish, a partial knowledge of which language proved most useful to him in after years. About six months after his visit to Portsmouth, he first saw at Court, and fell in love with, his cousin Lady Elizabeth Butler , Duchess of Ormond, only child and heiress of ": null
    },
    {
        "Richard Preston": "richard preston, 1st earl of desmond"
    },
    {
        ", ": null
    },
    {
        "Earl of Desmond": "earl of desmond"
    },
    {
        " and his wife ": null
    },
    {
        "Elizabeth": "elizabeth butler, countess of desmond"
    },
    {
        ". ": null
    },
    {
        "Charles I": "charles i of england"
    },
    {
        " gave his consent by ": null
    },
    {
        "letters patent": "letters patent"
    },
    {
        ", on 42 September 42 At Christmas 42 they married putting an end to the long-standing quarrel between the families and united their estates. In 42 on the death of his grandfather, he succeeded to the earldom.       Ormonds active career began in 42 with the appointment as head of government in Ireland of ": null
    },
    {
        "Thomas Wentworth, 42st Earl of Strafford": "thomas wentworth, 1st earl of strafford"
    },
    {
        ", by whom Ormond was treated with great favour. Writing to ": null
    },
    {
        "Charles I": "charles i of england"
    },
    {
        ", Wentworth described Ormond as young, but take it from me, a very staid head .   Ormond became Wentworths chief friend and supporter. Wentworth planned large scale confiscations of Catholic-owned land, both to raise money for the crown and to break the political power of the Irish Catholic gentry, a policy which Ormond supported. Yet, it infuriated his relatives, and drove many of them into opposition to Wentworth and ultimately into armed rebellion. In 42 with Wentworth having been recalled to attend to the ": null
    },
    {
        "Second Bishops War": "second bishops war"
    },
    {
        " in England, Ormond was made commander-in-chief of the forces in Ireland. The opposition to Wentworth ultimately aided impeachment of the Earl by the English Parliament, and his eventual execution in May 42     On the outbreak of the ": null
    },
    {
        "Irish Rebellion of 42": "irish rebellion of 1641"
    },
    {
        ", Ormond found himself in command of the ": null
    },
    {
        "Irish Royal Army": "irish royal army"
    },
    {
        " based in Dublin. Most of the country was taken by the Catholic rebels, who included Ormonds Butler relatives. However Ormonds bonds of kinship were not entirely severed. His wife and children were escorted from ": null
    },
    {
        "Kilkenny": "kilkenny"
    },
    {
        " to Dublin under the order of the rebel leader ": null
    },
    {
        "Richard Butler, 42rd Viscount Mountgarret": "richard butler, 3rd viscount mountgarret"
    },
    {
        ", another member of the ": null
    },
    {
        "Butler dynasty": "butler dynasty"
    },
    {
        ".                                                                                   Early in 42 the Irish Catholics formed their own government, the ": null
    },
    {
        "Catholic Confederation": "confederate ireland"
    },
    {
        ", with its capital at ": null
    },
    {
        "Kilkenny": "kilkenny"
    },
    {
        ", and began to raise their own regular troops, more organised and capable than the feudal militias of the 42 rebellion. Also in early 42 the king sent in troop reinforcements from England and Scotland. The ": null
    },
    {
        "Irish Confederate War": "irish confederate war"
    },
    {
        " was underway. Ormond mounted several expeditions from Dublin in 42 that cleared the area around Dublin of Confederate forces. He secured control of the area historically known as ": null
    },
    {
        "the Pale": "the pale"
    },
    {
        ", and re-supplied some outlying garrisons, without serious contest. The Lords Justices, who suspected him because he was related to many of the Confederate leaders, recalled him from command, but he succeeded securing much of ": null
    },
    {
        "County Kildare": "county kildare"
    },
    {
        " in February 42 Next he managed to lift the ": null
    },
    {
        "siege of Drogheda": "siege of drogheda 1641"
    },
    {
        " in March 42 In April he relieved the royalist garrisons at ": null
    },
    {
        "Naas": "naas"
    },
    {
        ", ": null
    },
    {
        "Athy": "athy"
    },
    {
        " and ": null
    },
    {
        "Maryborough": "portlaoise"
    },
    {
        ", and on his return to Dublin he won the ": null
    },
    {
        "Battle of Kilrush": "battle of kilrush"
    },
    {
        " against a larger force. He received the public thanks of the English Parliament and a monetary reward, and in September 42 was put in command with a commission direct from the king.     In March 42 Ormond ventured his troops to ": null
    },
    {
        "New Ross": "new ross"
    },
    {
        ", deep in the territory of the Catholic Confederation, and won a small but indecisive victory there  before returning to Dublin. Nevertheless, Ormond was now in a very difficult situation. The Confederates held two thirds of the island. The ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        ", started in September 42 had removed the prospect of more reinforcements and supplies from England, and indeed the king desired to recall troops. In addition the ": null
    },
    {
        "Scots Covenanters": "covenanters"
    },
    {
        ", who had landed an army in the northeast of Ireland at ": null
    },
    {
        "Carrickfergus": "carrickfergus"
    },
    {
        " to counter the Catholic rebellion in that part of the country in early 42 had subsequently put northeast Ireland on the side of the English Parliamentarians against the king; and the relatively strong Protestant presence in and around ": null
    },
    {
        "Derry": "derry"
    },
    {
        " and ": null
    },
    {
        "Cork City": "cork city"
    },
    {
        " was inclined to side with the Parliamentarians as well, and soon did so.     Isolated in Dublin in what was now a 42-sided contest, with the king desiring to reduce the ": null
    },
    {
        "Irish Royal Army": "irish royal army"
    },
    {
        ", Ormond therefore agreed to a cessation or ceasefire with the Confederates, which began in September 42 by which the greater part of Ireland was given up into the hands of the Catholic Confederation . This truce was vehemently opposed by the Lords Justices and the Protestant community in general in Ireland.          Soon afterwards, in November 42 by the kings orders, Ormond dispatched a body of his troops into England to fight on the ": null
    },
    {
        "Royalist": "cavalier"
    },
    {
        " side in the Civil War, estimated at 42 troops, half of whom were sent from Cork. In November 42 the king appointed Ormond as ": null
    },
    {
        "Lord Lieutenant of Ireland": "lord lieutenant of ireland"
    },
    {
        "—head of the Irish government executive, in other words. For the previous two years the occupant of this post had not set foot in Ireland. Ormonds assigned mission was to prevent the kings Parliamentarian enemies from being reinforced from Ireland, and to aim to deliver more troops to fight for the Royalist side in England. To these ends, he had instructions to do all in his power to keep the Scottish Covenanter army in the north of Ireland occupied. He was also given the kings authority to negotiate a treaty with the Catholic Confederation which could allow their troops to be redirected against the Parliamentarians.                 Ormond was faced with a difficult task in reconciling all the different factions in Ireland. The Old Irish and Catholic Irish of English descent  were represented in ": null
    },
    {
        "Confederate Ireland": "confederate ireland"
    },
    {
        " & mdash;essentially an independent Catholic government based in ": null
    },
    {
        "Kilkenny": "kilkenny"
    },
    {
        " & mdash;who wanted to come to terms with ": null
    },
    {
        "King Charles I of England": "charles i of england"
    },
    {
        " in return for ": null
    },
    {
        "religious toleration": "religious toleration"
    },
    {
        " and ": null
    },
    {
        "self-government": "self-government"
    },
    {
        ". On the other side, any concession that Ormond made to the Confederates weakened his support among English and Scottish ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        "s in Ireland. Ormonds negotiations with the Confederates were therefore tortuous, even though many of the Confederate leaders were his relatives or friends.     In 42 he assisted ": null
    },
    {
        "Randall Macdonnell, 42st Marquess of Antrim": "randal macdonnell, 1st marquess of antrim"
    },
    {
        " in mounting an Irish Confederate expedition into ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". The force, led by ": null
    },
    {
        "Alasdair MacColla": "alasdair maccolla"
    },
    {
        " was sent to help the Scottish Royalists and sparked off ": null
    },
    {
        "a civil war in Scotland": "scotland in the wars of the three kingdoms"
    },
    {
        " . This turned out to be the only intervention of Irish Catholic troops in Britain during the Civil Wars.     On 42 August 42 ": null
    },
    {
        "Edward Somerset, 42nd Marquess of Worcester": "edward somerset, 2nd marquess of worcester"
    },
    {
        ", acting on behalf of King Charles, signed a treaty in Kilkenny with the Irish Catholic Confederates without first airing the terms of the treaty with the Irish Protestant community. Irish Protestant opposition turned out to be so intense, that Charles was forced to repudiate the treaty almost immediately out of fear of ceding almost all Irish Protestant support to the other side in the English civil war. On 42 March 42 Ormond, on behalf of the king, concluded another treaty with the Confederates which granted religious concessions and removed various grievances. However, the Confederates General Assembly in Kilkenny rejected the deal, partly due to the influence of the popes ambassador  ": null
    },
    {
        "Giovanni Battista Rinuccini": "giovanni battista rinuccini"
    },
    {
        ", who worked to dissuade the Catholics from entering into a compromise. The Confederates called off their truce with Ormond, and arrested those among their number who had signed the treaty with Ormond.     Ormond then judged that he could not hold Dublin against the Confederates. He therefore applied to the ": null
    },
    {
        "English Long Parliament": "long parliament"
    },
    {
        " and signed a treaty with them on 42 June 42 delivering Dublin into the hands of the Parliamentarians on terms that protected the interests of both royalist Protestants and Roman Catholics who had not actually entered into rebellion. At the beginning of August 42 Ormond handed over Dublin, together with 42 royalist troops under his command, to the Parliamentarian commander ": null
    },
    {
        "Michael Jones": "michael jones"
    },
    {
        ", who had recently arrived from England with 42 Parliamentarian troops. Ormond in turn sailed for England, remarking of his surrender that he preferred English rebels to Irish ones . The combined royalist and parliamentarian troops won a major battle against the Catholic Confederates soon afterwards near Dublin at the ": null
    },
    {
        "Battle of Dungans Hill": "battle of dungans hill"
    },
    {
        ".            Ormond attended King Charles during August and October 42 at ": null
    },
    {
        "Hampton Court Palace": "hampton court palace"
    },
    {
        ", but in March 42 in order to avoid arrest by the parliament, he joined the ": null
    },
    {
        "Queen": "henrietta maria"
    },
    {
        " and the ": null
    },
    {
        "Prince of Wales": "charles ii of england"
    },
    {
        " at ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". In September of the same year, the popes nuncio having been expelled, and affairs otherwise looking favourable, he returned to Ireland to endeavour to unite all parties for the king.     The Irish Confederates were now much more amenable to compromise, as 42 had seen a series of military disasters for them at the hands of English Parliamentarian forces. On 42 January 42 Ormond concluded a peace with the rebels on the basis of the free exercise of their religion.     On the execution of the Charles I he proclaimed his loyalty to Charles II, who made him a ": null
    },
    {
        "Knight of the Garter": "order of the garter"
    },
    {
        " in September 42 Ormond was placed in command of the Irish Confederates armies and also English Royalist troops who were landed in Ireland from France.     However, despite controlling almost all of Ireland before August 42 Ormond was unable to prevent the ": null
    },
    {
        "conquest of Ireland": "cromwellian conquest of ireland"
    },
    {
        " by ": null
    },
    {
        "Cromwell": "oliver cromwell"
    },
    {
        " in 4242 Ormond tried to retake ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        " by ": null
    },
    {
        "laying siege to the city": "siege of dublin"
    },
    {
        " in the summer of 42 but was routed at the ": null
    },
    {
        "Battle of Rathmines": "battle of rathmines"
    },
    {
        ". Subsequently, he tried to halt Cromwell by holding a line of fortified towns across the country. However, the ": null
    },
    {
        "New Model Army": "new model army"
    },
    {
        " took them one after the other, beginning with the ": null
    },
    {
        "Siege of Drogheda": "siege of drogheda"
    },
    {
        " in September 42     Ormond lost most of the English and Protestant Royalist troops under his command when they mutinied, and went over to Cromwell in May 42 This left him with only the Irish Catholic forces, who distrusted him greatly. Ormond was ousted from his command in late 42 and he returned to ": null
    },
    {
        "France": "france"
    },
    {
        " in December 42 A ": null
    },
    {
        "synod": "synod"
    },
    {
        " held in at the Augustinian abbey in ": null
    },
    {
        "Jamestown, County Leitrim": "jamestown, county leitrim"
    },
    {
        ", repudiated the Duke and excommunicated his followers. In Cromwells ": null
    },
    {
        "Act of Settlement of 42": "act of the settlement of ireland 1652"
    },
    {
        ", all of Ormonds lands in Ireland were confiscated and he was excepted from the pardon given to those Royalists who had surrendered by that date. His name is the first on the list of over 42 men who were excluded from pardon.     Ormond, though desperately short of money, was in constant attendance on Charles II and the Queen Mother in Paris, and accompanied the King to ": null
    },
    {
        "Aix": "aix-la-chapelle"
    },
    {
        " and ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " when he was expelled from France by the terms of ": null
    },
    {
        "Mazarin": "cardinal mazarin"
    },
    {
        "s treaty with Cromwell in 42 In April 42 Ormond was one of two signatories who agreed the ": null
    },
    {
        "Treaty of Brussels": "treaty of brussels"
    },
    {
        ", securing an alliance for the Royalists with the Spanish court. In 42 he went disguised, and at great risk, on a secret mission into England to gain trustworthy intelligence as to the chances of an uprising. He attended the king at ": null
    },
    {
        "Fuenterrabia": "fuenterrabia"
    },
    {
        " in 42 had an interview with Mazarin, and was actively engaged in the secret transactions immediately preceding the ": null
    },
    {
        "Restoration": "english restoration"
    },
    {
        ". Relations between Ormond and the Queen Mother became increasingly strained; when she remarked that if she had been trusted, the King had now been in England , Ormond retorted that if she had never been trusted the King had never been out of England .               On the return of Charles to England as king, Ormond was appointed a commissioner for the treasury and the navy, made ": null
    },
    {
        "Lord Steward of the Household": "lord steward"
    },
    {
        ", a ": null
    },
    {
        "Privy Councillor": "privy council of england"
    },
    {
        ", ": null
    },
    {
        "Lord Lieutenant of Somerset": "lord lieutenant of somerset"
    },
    {
        " , ": null
    },
    {
        "High Steward": "lord high steward"
    },
    {
        " of ": null
    },
    {
        "Westminster": "westminster"
    },
    {
        ", ": null
    },
    {
        "Kingston": "kingston upon thames"
    },
    {
        " and ": null
    },
    {
        "Bristol": "bristol"
    },
    {
        ", chancellor of ": null
    },
    {
        "Trinity College, Dublin": "trinity college, dublin"
    },
    {
        ", Baron Butler of ": null
    },
    {
        "Llanthony": "llanthony"
    },
    {
        " and ": null
    },
    {
        "Earl of Brecknock": "earl of brecknock"
    },
    {
        " in the ": null
    },
    {
        "peerage": "peerage"
    },
    {
        " of England; and on 42 March 42 he was created Duke of Ormond in the Irish peerage and made ": null
    },
    {
        "Lord High Steward": "lord high steward"
    },
    {
        " of England, for Charless coronation that year. At the same time he recovered his enormous estates in Ireland, and large grants in recompense of the fortune he had spent in the royal service were made to him by the king, while in the following year the ": null
    },
    {
        "Irish Parliament": "parliament of ireland"
    },
    {
        " presented him with £42. His losses, however, according to Carte, exceeded his gains by nearly a million £. See also ": null
    },
    {
        "Act of Settlement 42": "act of settlement 1662"
    },
    {
        ".     On 42 November 42 he once more received the lord lieutenancy of Ireland, and busily engaged in the work of settling that country. The main problem was the land question, and the Act of Explanation was passed through the Irish parliament by Ormond, on 42 December 42     His heart was in his government, and he vehemently opposed the ": null
    },
    {
        "Importation Act 42": "importation act 1667"
    },
    {
        " prohibiting the importation of Irish cattle, which struck so fatal a blow at Irish trade; and retaliated by prohibiting the import into Ireland of Scottish commodities, and obtained leave to ": null
    },
    {
        "trade": "trade"
    },
    {
        " with foreign countries. He encouraged Irish manufactures and learning to the utmost, and it was due to his efforts that the Irish College of Physicians owes its incorporation.     He had great influence over the appointment of judges: while he naturally wished to appoint to the Bench men of legal ability, a record of loyalty to the Crown was also generally required. It is interesting that he was prepared to appoint judges of Gaelic descent, like ": null
    },
    {
        "James Donnellan": "james donnellan"
    },
    {
        ", and even some who were known to have Roman Catholic leanings. He was criticised for favouring old friends like ": null
    },
    {
        "John Bysse": "john bysse"
    },
    {
        " who were considered too infirm to be effective, but this also shows one of his main virtues, loyalty: as Elrington Ball remarks, those whom Ormond had ever loved, he loved to the end. Himself a merciful man, he encouraged the Irish judges to show a similar spirit of clemency; as he remarked, a man who has been reprieved can later be hanged, but a man who has been hanged can never be reprieved. In general the judges followed his example and, by the standards of the age, were merciful enough.     Ormonds personality had always been a striking one, and he was highly regarded. He was dignified and proud of his loyalty, even when he lost royal favour, declaring, However ill I may stand at court I am resolved to lye well in the chronicle . Ormond soon became the mark for attack from all that was worst in the court. ": null
    },
    {
        "Buckingham": "george villiers, 2nd duke of buckingham"
    },
    {
        " especially did his utmost to undermine his influence. Ormonds almost irresponsible government of Ireland during troubled times was open to criticism.     He had ": null
    },
    {
        "billet": "billet"
    },
    {
        "ed soldiers on civilians, and had executed ": null
    },
    {
        "martial law": "martial law"
    },
    {
        ". He was threatened by Buckingham with impeachment. In March 42 Ormond was removed from the government of Ireland and from the committee for Irish affairs. He made no complaint, insisted that his sons and others over whom he had influence should retain their posts, and continued to fulfil the duties of his other offices, while his character and services were recognised in his election as Chancellor of the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        " on 42 August 42     In 42 an extraordinary attempt was made to assassinate the duke by a ruffian and adventurer named ": null
    },
    {
        "Thomas Blood": "thomas blood"
    },
    {
        ", already notorious for an unsuccessful plot to surprise ": null
    },
    {
        "Dublin Castle": "dublin castle"
    },
    {
        " in 42 and later for stealing the royal ": null
    },
    {
        "crown": "crown jewels of the united kingdom"
    },
    {
        " from the ": null
    },
    {
        "Tower": "tower of london"
    },
    {
        ". Ormond was attacked by Blood and his accomplices while driving up St Jamess Street on the night of 42 December 42 dragged out of his coach, and taken on horseback along ": null
    },
    {
        "Piccadilly": "piccadilly"
    },
    {
        " with the intention of hanging him at ": null
    },
    {
        "Tyburn": "tyburn, london"
    },
    {
        ". Ormond, however, succeeded in overcoming the horseman to whom he was bound, and escaped.     The outrage, it was suspected, had been instigated by Buckingham, who was openly accused of the crime by Lord Ossory, Ormonds son, in the kings presence, and threatened by him with instant death if any violence should happen to his father. These suspicions were encouraged by the improper action of the king in pardoning Blood, and in admitting him to his presence and treating him with favour after his apprehension while endeavouring to steal the crown jewels.     In his estates in ": null
    },
    {
        "Carrick-on-Suir": "carrick-on-suir"
    },
    {
        " in ": null
    },
    {
        "County Tipperary": "county tipperary"
    },
    {
        ", he was responsible for establishing the woollen industry in the town in 42     In 42 Ormond successfully opposed ": null
    },
    {
        "Richard Talbot": "richard talbot, earl of tyrconnel"
    },
    {
        "s attempt to upset the ": null
    },
    {
        "Act of Settlement 42": "act of settlement 1662"
    },
    {
        ". In 42 he again visited Ireland, returned to London in 42 to give advice to Charles on affairs in parliament, and in 42 was again restored to favour and reappointed to the lord lieutenancy. On his arrival in Ireland he occupied himself in placing the ": null
    },
    {
        "revenue": "revenue"
    },
    {
        " and the ": null
    },
    {
        "army": "army"
    },
    {
        " upon a proper footing. Upon the outbreak of the disturbances caused by the ": null
    },
    {
        "Popish Plot": "popish plot"
    },
    {
        " in England, Ormond at once took steps towards rendering the Roman Catholics, who were in the proportion of 42 to 42 powerless; and the mildness and moderation of his measures served as the ground of an attack upon him in England led by ": null
    },
    {
        "Shaftesbury": "anthony ashley cooper, 1st earl of shaftesbury"
    },
    {
        ", from which he was defended with great spirit by his own son Lord Ossory. While wary of defending ": null
    },
    {
        "Oliver Plunkett": "oliver plunkett"
    },
    {
        " publicly, in private he denounced the obvious falsity of the charges against him - of the informers who claimed that Plunkett had hired them to kill the King he wrote that no schoolboy would have trusted them to rob an orchard . Kenyon, J.P. The Popish Plot Phoenix Press reissue 42 p.42     In 42 Charles summoned Ormond to court. The same year he wrote A Letter, from a Person of Honour in the Country, in answer to the earl of Anglesey, his Observations upon the earl of Castlehavens Memoires concerning the Rebellion of Ireland , and gave Charles general support. On 42 November 42 an English dukedom was conferred upon him, and in June 42 he returned to Ireland; but he was recalled in October in consequence of fresh intrigues. Before he could give up his government to ": null
    },
    {
        "Rochester": "lawrence hyde, earl of rochester"
    },
    {
        ", Charles II died; and Ormonds last act as lord lieutenant was to proclaim ": null
    },
    {
        "James II": "james ii of england"
    },
    {
        " in Dublin.     Ormond also served as the sixth Chancellor of ": null
    },
    {
        "Trinity College, Dublin": "university of dublin"
    },
    {
        " between 42 and 42 although he was in exile for the first fifteen years of his tenure.     Subsequently, Ormond lived in retirement at ": null
    },
    {
        "Cornbury": "cornbury"
    },
    {
        " in ": null
    },
    {
        "Oxfordshire": "oxfordshire"
    },
    {
        ", a house lent to him by ": null
    },
    {
        "Lord Clarendon": "henry hyde, 2nd earl of clarendon"
    },
    {
        ", but emerged in 42 to offer opposition at the board of the ": null
    },
    {
        "Charterhouse": "london charterhouse"
    },
    {
        " to Jamess attempt to assume the dispensing power and force upon the institution a Roman Catholic candidate without taking the oaths. Ormond also refused the king his support in the question of the ": null
    },
    {
        "Indulgence": "royal declaration of indulgence"
    },
    {
        "; James, to his credit, refused to take away his offices, and continued to hold him in respect and favour to the last. Despite his long service to Ireland he admitted that he had no wish to spend his last years there.          At Christmas 42 Ormond married Elizabeth, the only child and heiress of ": null
    },
    {
        "Sir Richard Preston": "richard preston, 1st earl of desmond"
    },
    {
        ", ": null
    },
    {
        "Earl of Desmond": "earl of desmond"
    },
    {
        ". They had at least 42 children, of whom three of his sons and two daughters survived into adulthood. ": null
    },
    {
        "Thomas": "thomas butler, 6th earl of ossory"
    },
    {
        " , who predeceased him, but had a son who would become the 42nd Duke; ": null
    },
    {
        "Richard": "richard butler, 1st earl of arran"
    },
    {
        " , who predeceased him;   ": null
    },
    {
        "Elizabeth": "elizabeth butler stanhope, countess of chesterfield"
    },
    {
        " , who married ": null
    },
    {
        "Philip Stanhope, 42nd Earl of Chesterfield": "philip stanhope, 2nd earl of chesterfield"
    },
    {
        " and had affairs with ": null
    },
    {
        "James Hamilton": "james hamilton"
    },
    {
        " and the ": null
    },
    {
        "Duke of York": "james ii of england"
    },
    {
        ";   ": null
    },
    {
        "John": "john butler, 1st earl of gowran"
    },
    {
        " , who predeceased him; and   Mary , who married ": null
    },
    {
        "William Cavendish, 42st Duke of Devonshire": "william cavendish, 1st duke of devonshire"
    },
    {
        ".     Thomas, Earl of Ossory, predeceased him, but his eldest son succeeded as ": null
    },
    {
        "42nd Duke of Ormond": "james butler, 2nd duke of ormonde"
    },
    {
        " . Two other sons, Richard, created earl of ": null
    },
    {
        "Arran": "isle of arran"
    },
    {
        ", and John, created earl of ": null
    },
    {
        "Gowran": "gowran"
    },
    {
        ", both died without male issue, and the male descent of the 42st Duke becoming extinct in the person of Charles, 42rd Duke of Ormond, the earldom subsequently reverted to the cadet descendants of Walter, 42th Earl of Ormond.       Ormond died on 42 July 42 at Kingston Lacy, Dorset, not having, as he rejoiced to know, outlived his intellectuals . Ormond was buried in ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " on 42 August 42     The anonymous author of Ormonds biography in the ": null
    },
    {
        "Encyclopædia Britannica ": "encyclopædia britannica eleventh edition"
    },
    {
        " wrote that with him disappeared the greatest and grandest figure of the times, and that Ormonds splendid qualities were expressed with some felicity in verses written on welcoming his return to Ireland and printed in 42:             The lineage of the Butlers can be traced back to James Butler born in 42 in Knocktopher Castle, Arklow, Wicklow, Ireland. This James Butler was the son of Eleanor Bohun who was granddaughter of ": null
    },
    {
        "Edward I of England": "edward i of england"
    },
    {
        ".     ": null
    }
]