[
    {
        "           James Whale was an English film director, theater director and actor, who spent the greater part of his career in ": null
    },
    {
        "Hollywood": "Cinema Of The United States"
    },
    {
        ". He is best remembered for several ": null
    },
    {
        "horror film": "Horror Film"
    },
    {
        "s:  Frankenstein  ,  The Old Dark House  ,  The Invisible Man  and  Bride of Frankenstein  , all considered classics. Whale also directed films in other genres, including the 1936 ": null
    },
    {
        "film version": "Show Boat"
    },
    {
        " of the musical  Show Boat . He became increasingly disenchanted with his association with horror, and many of his non-horror films have fallen into obscurity.     Whale was born into a large family in ": null
    },
    {
        "Dudley": "Dudley"
    },
    {
        ", ": null
    },
    {
        "Worcestershire": "Worcestershire"
    },
    {
        ". He discovered his artistic talent early on and studied art. With the outbreak of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " he enlisted in the ": null
    },
    {
        "British Army": "British Army"
    },
    {
        " and became an officer. He was captured by the Germans and during his time as a ": null
    },
    {
        "prisoner of war": "Prisoner Of War"
    },
    {
        " he realized he was interested in drama. Following his release at the end of the war he became an actor, set designer and director. His success directing the 1928 play  Journeys End  led to his move to the US, first to direct the play on ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " and then to ": null
    },
    {
        "Hollywood": "Hollywood"
    },
    {
        ", ": null
    },
    {
        "California": "California"
    },
    {
        ", to direct films. He lived in Hollywood for the rest of his life, most of that time with his longtime companion, producer ": null
    },
    {
        "David Lewis": "David Lewis"
    },
    {
        ". Apart from  Journeys End  , which was released by Tiffany Films, and  Hells Angels  , released by ": null
    },
    {
        "United Artists": "United Artists"
    },
    {
        ", he directed a dozen films for ": null
    },
    {
        "Universal Pictures": "Universal Pictures"
    },
    {
        " between 1931 and 1937, developing a style characterized by the influence of ": null
    },
    {
        "German Expressionism": "German Expressionism"
    },
    {
        " and a highly mobile camera.     At the height of his career as a director Whale directed  The Road Back  , a sequel to  All Quiet on the Western Front . Studio interference, possibly spurred by political pressure from ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        ", led to the films being altered from Whales vision and it was a critical and commercial failure. A run of similar box-office disappointments followed and, while he would make one final short film in 1950, by 1941 his film directing career was effectively over. He continued to direct for the stage and also rediscovered his love for painting and travel. His investments made him wealthy and he lived a comfortable retirement until suffering ": null
    },
    {
        "strokes": "Stroke"
    },
    {
        "in 1956 that robbed him of his vigor and left him in pain. He committed suicide on 29 May 1957 by drowning himself in his swimming pool.     Whale was openly gay throughout his career, something that was very unusual in the 1920s and 1930s. As knowledge of his sexual orientation has become more common, some of his films, Bride of Frankenstein in particular, have been interpreted as having a gay ": null
    },
    {
        "subtext": "Subtext"
    },
    {
        " and it has been claimed that his refusal to remain in the closet led to the end of his career.          Whale was born in ": null
    },
    {
        "Dudley": "Dudley"
    },
    {
        ", ": null
    },
    {
        "Worcestershire": "Worcestershire"
    },
    {
        ", at the heart of the ": null
    },
    {
        "Black Country": "Black Country"
    },
    {
        ", the sixth of seven children of William, a ": null
    },
    {
        "blast furnace": "Blast Furnace"
    },
    {
        "man, Curtis, p. 8. and Sarah, a nurse. Ellis, p. 20. He attended ": null
    },
    {
        "Kates Hill Board School": "Kates Hill Primary School"
    },
    {
        ", followed by Bayliss ": null
    },
    {
        "Charity School": "Charity School"
    },
    {
        " and finally ": null
    },
    {
        "Dudley Blue Coat School": "The Blue Coat School, Dudley"
    },
    {
        ". His attendance stopped in his teenage years because the cost would have been prohibitive and his labor was needed to help support the family. Thought not physically strong enough to follow his brothers into the local heavy industries, Whale started work as a ": null
    },
    {
        "cobbler": "Shoemaker"
    },
    {
        ", reclaiming the nails he recovered from replaced soles and selling them for scrap for extra money. He discovered he had some artistic ability and earned additional money lettering signs and price tags for his neighbors. Curtis, p. 11. He used his additional income to pay for evening classes at the Dudley School of Arts and Crafts.     ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " broke out in early August 1914. Although Whale had little interest in the politics behind the war, he realized that ": null
    },
    {
        "conscription": "Conscription"
    },
    {
        " was inevitable so he voluntarily enlisted just before it was introduced into the ": null
    },
    {
        "British Armys": "British Army"
    },
    {
        " Inns of Court Officer Training Corps": "Inns Of Court Regiment"
    },
    {
        " in October 1915, and was stationed initially at ": null
    },
    {
        "Bristol": "Bristol"
    },
    {
        ". He was subsequently commissioned as a ": null
    },
    {
        "second lieutenant": "Second Lieutenant"
    },
    {
        " into the ": null
    },
    {
        "Worcestershire Regiment": "Worcestershire Regiment"
    },
    {
        " in July 1916. Curtis, p. 17. He was taken ": null
    },
    {
        "prisoner of war": "Prisoner Of War"
    },
    {
        " in battle on the ": null
    },
    {
        "Western Front": "Western Front"
    },
    {
        " in ": null
    },
    {
        "Flanders": "Flanders"
    },
    {
        " in August 1917, and was held at ": null
    },
    {
        "Holzminden Officers Camp": "Holzminden Prisoner-Of-War Camp"
    },
    {
        ", where he remained until the wars end, being repatriated to England in December 1918. Curtis, p. 20.  While imprisoned he became actively involved, as an actor, writer, producer and set-designer, in the amateur theatrical productions that took place in the camp, finding them a source of great pleasure and amusement . Whale 1919, p. 318. Early, pp. 140–41. He also developed a talent for poker, and after the war he cashed in the chits and IOUs from his fellow prisoners that he had amassed in gambling to provide himself with finances for re-entry into civilian life. Curtis, p. 25.         After the ": null
    },
    {
        "armistice": "Armistice Of 11 November 1918"
    },
    {
        ", he returned to ": null
    },
    {
        "Birmingham": "Birmingham"
    },
    {
        " and tried to find work as a cartoonist. He sold two cartoons to the  Bystander  in 1919 but was unable to secure a permanent position. Later that year he embarked on a professional stage career. Under the tutelage of actor-manager ": null
    },
    {
        "Nigel Playfair": "Nigel Playfair"
    },
    {
        ", he worked as an actor, set designer and builder, stage director  and director. Skal, et al., p. 50. In 1922, while with Playfair, he met ": null
    },
    {
        "Doris Zinkeisen": "Doris Zinkeisen"
    },
    {
        ". They were considered a couple for some two years, despite Whales living as an openly gay man. They were reportedly engaged in 1924, but by 1925 the engagement was off. Curtis, p. 32.     In 1928 Whale was offered the opportunity to direct two private performances of ": null
    },
    {
        "R. C. Sherriffs": "R. C. Sherriff"
    },
    {
        "then-unknown play  Journeys End  for the ": null
    },
    {
        "Incorporated Stage Society": "Stage Society"
    },
    {
        ", a theatre society that mounted private Sunday performances of plays.  Set over a four-day period in March 1918 in the trenches at ": null
    },
    {
        "Saint-Quentin, France": "Saint-Quentin, France"
    },
    {
        ", Journeys End gives a glimpse into the experiences of the officers of a British infantry company in World War I. The key conflict is between Capt. Stanhope, the company commander, and Lt. Raleigh, the brother of Stanhopes fiancée. Green, et al., p. 272. Whale offered the part of Stanhope to the then barely known ": null
    },
    {
        "Laurence Olivier": "Laurence Olivier"
    },
    {
        ". Olivier initially declined the role, Cottrell, p. 53. but after meeting the playwright agreed to take it on. ": null
    },
    {
        "Maurice Evans": "Maurice Evans"
    },
    {
        " was cast as Raleigh.  The play was well received and transferred to the ": null
    },
    {
        "Savoy Theatre": "Savoy Theatre"
    },
    {
        " in Londons ": null
    },
    {
        "West End": "West End Theatre"
    },
    {
        ", opening on 21 January 1929. A young ": null
    },
    {
        "Colin Clive": "Colin Clive"
    },
    {
        " was now in the lead role, Williamson, p. 29. Olivier having accepted an offer to take the lead in a production of  Beau Geste . Coleman, p. 31. The play was a tremendous success, with critics uniform and effusive in their praise and with audiences sometimes sitting in stunned silence following its conclusion only to burst into thunderous ovations. Curtis, p. 70. As Whale biographer James Curtis wrote, the play managed to coalesce, at the right time and in the right manner, the impressions of a whole generation of men who were in the war and who had found it impossible, through words or deeds, to adequately express to their friends and families what the trenches had been like . Curtis, p. 71. After three weeks at the Savoy, Journeys End transferred to the ": null
    },
    {
        "Prince of Wales Theatre": "Prince Of Wales Theatre"
    },
    {
        ", where it ran for the next two years. Coleman, p. 32.          With the success of Journeys End at home, ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " producer ": null
    },
    {
        "Gilbert Miller": "Gilbert Miller"
    },
    {
        " acquired the rights to mount a New York production with an all-British cast headed by ": null
    },
    {
        "Colin Keith-Johnston": "Colin Keith-Johnston"
    },
    {
        " as Stanhope and Derek Williams as Raleigh. Whale also directed this version, which premiered at ": null
    },
    {
        "Henry Millers Theatre": "Henry Millers Theatre"
    },
    {
        " on 22 March 1929. The play ran for over a year and cemented its reputation as the greatest play about World War I. Bordman, p. 381.       The success of the various productions of Journeys End brought Whale to the attention of movie producers. Coming at a time when motion pictures were making the transition from silent to talking, producers were interested in hiring actors and directors with experience with dialogue. Whale traveled to Hollywood in 1929 and signed a contract with ": null
    },
    {
        "Paramount Pictures": "Paramount Pictures"
    },
    {
        ". He was assigned as dialogue director for a film called The Love Doctor . Curtis, p. 79. He completed work on the film in 15 days and his contract was allowed to expire. It was at around this time that he met ": null
    },
    {
        "David Lewis": "David Lewis"
    },
    {
        ". Curtis, p. 81.     Whale was hired by independent film producer and aviation pioneer ": null
    },
    {
        "Howard Hughes": "Howard Hughes"
    },
    {
        ", who planned to turn the previously silent Hughes production  Hells Angels  into a ": null
    },
    {
        "talkie": "Sound Film"
    },
    {
        ". Whale directed the dialogue sequences.  When his work for Hughes was completed, he headed to ": null
    },
    {
        "Chicago": "Chicago"
    },
    {
        " to direct another production of Journeys End. Curtis, p. 83.     Having purchased the film rights to Journeys End, British producers ": null
    },
    {
        "Michael Balcon": "Michael Balcon"
    },
    {
        " and Thomas Welsh agreed that Whales experience directing the London and Broadway productions of the play made him the best choice to direct the film. The two partnered with a small American studio, ": null
    },
    {
        "Tiffany-Stahl": "Tiffany Pictures"
    },
    {
        ", to shoot it in New York. Low, et al. p. 171. Colin Clive reprised his role as Stanhope,  and ": null
    },
    {
        "David Manners": "David Manners"
    },
    {
        " was cast as Raleigh. Kelly , p. 65. Filming got underway on 6 December 1929 Curtis, p. 98. and wrapped on 22 January 1930. Curtis, p. 102.  Journeys End  was released in Great Britain on 14 April and in the United States on 15 April. Curtis, p. 104. On both sides of the Atlantic the film was a tremendous critical and commercial success. Curtis, pp 104–05       ": null
    },
    {
        "Universal Studios": "Universal Studios"
    },
    {
        " signed Whale to a five-year contract in 1931 and his first project was  Waterloo Bridge .  Based on the Broadway play by ": null
    },
    {
        "Robert E. Sherwood": "Robert E. Sherwood"
    },
    {
        ", the film stars ": null
    },
    {
        "Mae Clarke": "Mae Clarke"
    },
    {
        " as Myra, a chorus girl in World War I London who becomes a prostitute. It too was a critical and popular success. At around this time, Whale and Lewis began living together. Anger, p. 210.     In 1931, Universal chief ": null
    },
    {
        "Carl Laemmle, Jr.": "Carl Laemmle, Jr."
    },
    {
        " offered Whale his choice of any property the studio owned. He chose  Frankenstein , mostly because none of Universals other properties particularly interested him and he wanted to make something other than a war picture. Skal, p. 129. While the novel itself was in the public domain, Universal owned the filming rights to a stage adaptation by ": null
    },
    {
        "Peggy Webling": "Peggy Webling"
    },
    {
        ". Whale cast Colin Clive as Henry Frankenstein and ": null
    },
    {
        "Mae Clarke": "Mae Clarke"
    },
    {
        " as his fiancée Elizabeth. For the ": null
    },
    {
        "Monster": "Frankensteins Monster"
    },
    {
        ", he turned to an unknown actor named ": null
    },
    {
        "Boris Karloff": "Boris Karloff"
    },
    {
        ". Shooting began on 24 August 1931 and wrapped on 3 October. Buehrer, p. 89. Previews were held 29 October, Curtis, p. 151. with wide release on 21 November. Curtis, p. 153. Frankenstein was an instant hit with critics and the public. The film received glowing reviews and shattered box office records across the United States, Curtis, p. 157. earning Universal $12 million on first release.     Next from Whale were  The Impatient Maiden  and  The Old Dark House  . The Impatient Maiden made little impression but The Old Dark House is credited with reinventing the dark house subgenre of horror films. Bansak, et al., p. 95. Thought ": null
    },
    {
        "lost": "Lost Film"
    },
    {
        " for some years, a print was found by filmmaker ": null
    },
    {
        "Curtis Harrington": "Curtis Harrington"
    },
    {
        " in the Universal vaults in 1968. It was restored by ": null
    },
    {
        "George Eastman House": "George Eastman House"
    },
    {
        ", and released on Blu-ray disk in 2017.     Whales next film was  The Kiss Before the Mirror  , a critical success but a box-office failure. He returned to horror with  The Invisible Man  . Shot from a script approved by ": null
    },
    {
        "H. G. Wells": "H. G. Wells"
    },
    {
        ", Skal, et al., p. 71. the film was a blended horror with humor and confounding visual effects. Much admired,  The New York Times  placed it in their list of the ten best films of the year,  and the film broke box-office records in cities across America. So highly regarded was the film that France, which restricted the number of theatres in which undubbed American films could play, granted it a special waiver because of its extraordinary artistic merit . Curtis, p. 221.     Also in 1933 Whale directed the romantic comedy By Candlelight which gained good reviews and was a modest box office hit. Curtis, p. 219. In 1934 he directed One More River, an adaptation of the novel of the same name by ": null
    },
    {
        "John Galsworthy": "John Galsworthy"
    },
    {
        ". The film tells the story of a woman desperate to escape her abusive marriage to a member of the British aristocracy. This was the first of Whales films for which ": null
    },
    {
        "Production Code Administration": "Production Code Administration"
    },
    {
        " approval was required and Universal had a difficult time securing that approval because of the elements of ": null
    },
    {
        "sexual sadism": "Sadomasochism"
    },
    {
        " implicit in the husbands abusive behavior. Curtis, pp. 224–25.         Bride of Frankenstein  was Whales next project. He had resisted making a sequel to Frankenstein as he feared being pigeonholed as a horror director. Bride hearkened back to an episode from ": null
    },
    {
        "Mary Shelleys": "Mary Shelley"
    },
    {
        "original novel in which the Monster promises to leave Frankenstein and humanity alone if Frankenstein makes him a mate. He does, but the mate is repelled by the monster who then, setting Frankenstein and his wife free to live, chooses to destroy himself and his bride. The film was a critical and box office success, having earned some $2 million for Universal by 1943. Curtis, p. 251. Lauded as the finest of all ": null
    },
    {
        "gothic horror": "Gothic Horror"
    },
    {
        " movies ,  Bride is frequently hailed as Whales masterpiece. Gifford, p. 55.      With the success of Bride, Laemmle was eager to put Whale to work on  Draculas Daughter  , the sequel to Universals first big horror hit of the sound era. Whale, wary of doing two horror films in a row and concerned that directing Draculas Daughter could interfere with his plans for the first all-sound version of Show Boat , instead convinced Laemmle to buy the rights to a novel called The Hangover Murders. The novel is a comedy-mystery in the style of  The Thin Man , about a group of friends who were so drunk the night one of them was murdered that none can remember anything. Curtis, pp. 254–55. Retitled  Remember Last Night? , the film was one of Whales personal favorites, but met with sharply divided reviews and commercial disinterest. Curtis, p. 259.     With the completion of Remember Last Night? Whale immediately went to work on  Show Boat  . Whale gathered as many of those as he could who had been involved in one production or another of the musical, including ": null
    },
    {
        "Helen Morgan": "Helen Morgan"
    },
    {
        ", ": null
    },
    {
        "Paul Robeson": "Paul Robeson"
    },
    {
        ", ": null
    },
    {
        "Charles Winninger": "Charles Winninger"
    },
    {
        ", ": null
    },
    {
        "Sammy White": "Sammy White"
    },
    {
        ", conductor ": null
    },
    {
        "Victor Baravalle": "Victor Baravalle"
    },
    {
        ", orchestrator ": null
    },
    {
        "Robert Russell Bennett": "Robert Russell Bennett"
    },
    {
        ", and, as Magnolia, ": null
    },
    {
        "Irene Dunne": "Irene Dunne"
    },
    {
        ", who believed that Whale was the wrong director for the piece.  The 1936 version of Show Boat, faithfully adapted from the original stage production, is believed to be the definitive film version of the musical by many critics. Anger, p. 209. Whales is by far the best of the three screen versions of Jerome Kerns musical.  but became unavailable following the ": null
    },
    {
        "1951 remake": "Show Boat"
    },
    {
        ". In February 2014, a restoration of the film became available on DVD in the U.S. as part of ": null
    },
    {
        "Warner Home Videos": "Warner Home Video"
    },
    {
        " Archive Collection line": "Warner Archive Collection"
    },
    {
        ".  The initial inventory will be filled by manufactured DVDs; subsequent inventory will be filled by DVDs-on-demand .     This was the last of Whales films to be produced under the Laemmle family. The studio was now bankrupt, and the Laemmles lost control to ": null
    },
    {
        "J. Cheever Cowdin": "J. Cheever Cowdin"
    },
    {
        ", head of the Standard Capital Corporation, and ": null
    },
    {
        "Charles R. Rogers": "Charles R. Rogers"
    },
    {
        ", who was installed in Junior Laemmles old job.        Whales career went into sharp decline following the release of his next film,  The Road Back  . The sequel to ": null
    },
    {
        "Erich Maria Remarques": "Erich Maria Remarque"
    },
    {
        "  All Quiet on the Western Front , which Universal had filmed in 1930, the novel and film follow the lives of several young German men who have returned from the trenches of World War I and their struggles to re-integrate into society. The Los Angeles ": null
    },
    {
        "consul": "Consul"
    },
    {
        " for Nazi Germany, George Gyssling, learned that the film was in production. He protested to PCA enforcer ": null
    },
    {
        "Joseph Breen": "Joseph Breen"
    },
    {
        ", arguing that the film gave an untrue and distorted picture of the German people . Glancy, p. 45. Gyssling eventually met Whale, but nothing came of it. Curtis, p. 296. Gyssling then sent letters to members of the cast, threatening that their participation in the film might lead to difficulties in obtaining German filming permits for them and for anyone associated in a film with them. Glancy, p. 46. While the low volume of business conducted by Universal in Germany made such threats largely hollow, the ": null
    },
    {
        "State Department": "United States Department Of State"
    },
    {
        ", under pressure from the ": null
    },
    {
        "Hollywood Anti-Nazi League": "Hollywood Anti-Nazi League"
    },
    {
        " and the ": null
    },
    {
        "Screen Actors Guild": "Screen Actors Guild"
    },
    {
        ", Kelly , p. 141. stepped in and the German government backed down. Curtis, p. 299. Whales original cut of the film was given generally positive reviews, but sometime between preview screenings and the films general release, Rogers capitulated to the Germans, ordering that cuts be made and additional scenes be shot and inserted. Whale was furious, Curtis, p. 306. and the altered film was banned in Germany anyway. Kelly , p. 144. The Germans were successful in persuading China, Greece, Italy and Switzerland to ban the film as well.     Following the debacle of The Road Back, Charles Rogers tried to get out of his contract with Whale; Whale refused. Rogers then assigned him to a string of ": null
    },
    {
        "B movies": "B Movie"
    },
    {
        "to run out his contractual obligation. Whale only made one additional successful feature film,  The Man in the Iron Mask  , before retiring from the film industry in 1941.        With his film career behind him, Whale found himself at a loose end. He was offered the occasional job, including the opportunity to direct  Since You Went Away  for ": null
    },
    {
        "David O. Selznick": "David O. Selznick"
    },
    {
        ", Hofler, p. 97. but turned them down.  Lewis, meanwhile, was busier than ever with his production duties and often worked late hours, leaving Whale lonely and bored. Lewis bought him a supply of paint and canvasses and Whale re-discovered his love of painting. Eventually he built a large studio for himself. Curtis, p. 347.     With the outbreak of ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", Whale volunteered his services to make a ": null
    },
    {
        "training film": "Training Film"
    },
    {
        " for the ": null
    },
    {
        "United States Army": "United States Army"
    },
    {
        ". He shot the film, called Personnel Placement in the Army, in February 1942. Later that year, in association with actress ": null
    },
    {
        "Claire DuBrey": "Claire Dubrey"
    },
    {
        ", he created the Brentwood Service Players. Curtis, p. 350. The Players took over a 100–seat theatre. Sixty seats were provided free of charge to service personnel; the remaining were sold to the public, with the box office proceeds donated to wartime charities.  The group expanded to the Playtime Theatre during the summer, where a series of shows ran through October. Curtis, p. 351.     Whale returned to Broadway in 1944 to direct the psychological thriller Hand in Glove.  It was his first return to Broadway since his failed One, Two, Three! in 1930. Curtis, p. 353. Hand in Glove would fare no better than his earlier play, running the same number of performances, 40. Curtis, p. 421.     Whale directed his final film in 1950, a short subject based on the ": null
    },
    {
        "William Saroyan": "William Saroyan"
    },
    {
        " one-act play  Hello Out There . The film, financed by supermarket heir ": null
    },
    {
        "Huntington Hartford": "Huntington Hartford"
    },
    {
        ", was the story of a man in a Texas jail falsely accused of rape and the woman who cleans the jail. Hartford intended for the short to be part of an ": null
    },
    {
        "anthology film": "Anthology Film"
    },
    {
        " along the lines of  Quartet .  However, attempts to find appropriate short fiction companion pieces to adapt were unsuccessful and Hello Out There was never commercially released. Curtis, p. 367.     Whales last professional engagement was directing Pagan in the Parlour, a farce about two New England spinster sisters who are visited by a Polynesian whom their father, when shipwrecked years earlier, had married. The production was mounted in ": null
    },
    {
        "Pasadena": "Pasadena, California"
    },
    {
        " for two weeks in 1951. Plans were made to take it to New York, but Whale suggested taking the play to London first. Curtis, pp. 369–71. Before opening the play in England, Whale decided to tour the art museums of Europe. In France he renewed his acquaintanceship with ": null
    },
    {
        "Curtis Harrington": "Curtis Harrington"
    },
    {
        ", whom he had met in 1947. While visiting Harrington in Paris, he went to some gay bars. At one he met a 25-year-old bartender named Pierre Foegel, whom Harrington believed was nothing but a ": null
    },
    {
        "hustler": "Male Prostitute"
    },
    {
        " out for what he could get . The 62-year-old Whale was smitten with the younger man and hired him as his chauffeur. Curtis, p. 374.     A provincial tour of Pagan in the Parlour began in September 1952 and it appeared that the play would be a hit. However, ": null
    },
    {
        "Hermione Baddeley": "Hermione Baddeley"
    },
    {
        ", starring in the play as the cannibal Noo-ga , was drinking heavily and began engaging in bizarre antics and disrupting performances. Because she had a run of the play contract she could not be replaced and so producers were forced to close the show. Curtis, pp. 375–76.     Whale returned to California in November 1952 and advised David Lewis that he planned to bring Foegel over early the following year. Appalled, Lewis moved out of their home. Curtis, pp. 376–77. While this ended their 23-year romantic relationship, the two men remained friends. Lewis bought a small house and dug a swimming pool, prompting Whale to have his own pool dug, although he did not himself swim in it. He began throwing all-male swim parties and would watch the young men cavort in and around the pool. Curtis, pp. 377–78. Foegel moved in with Whale in early 1953 and remained there for several months before returning to France. He returned in 1954 permanently, and Whale installed him as manager of a gas station that he owned. Curtis, p. 380.     Whale and Foegel settled into a quiet routine until the spring of 1956, when Whale suffered a small ": null
    },
    {
        "stroke": "Stroke"
    },
    {
        ". A few months later he suffered a larger stroke and was hospitalized. While in the hospital he was treated for ": null
    },
    {
        "depression": "Depression"
    },
    {
        " with ": null
    },
    {
        "shock treatments": "Electroconvulsive Therapy"
    },
    {
        ". Anger, p. 211.     Upon his release, Whale hired one of the male nurses from the hospital to be his personal live-in nurse. Curtis, p. 381. A jealous Foegel maneuvered the nurse out of the house and hired a female nurse as a non live-in replacement. Curtis, pp. 383–84. Whale suffered from mood swings and grew increasingly and frustratingly more dependent on others as his mental faculties were diminishing. Curtis, p. 383.       Whale committed suicide by drowning himself in his ": null
    },
    {
        "Pacific Palisades": "Pacific Palisades, California"
    },
    {
        " swimming pool on 29 May 1957 at the age of 67.  He left a ": null
    },
    {
        "suicide note": "Suicide Note"
    },
    {
        ", which Lewis withheld until shortly before his own death decades later. Because the note was suppressed, the death was initially ruled accidental.  The note read in part:        Whales body was cremated as per his request, and his ashes were interred in the ": null
    },
    {
        "Columbarium": "Columbarium"
    },
    {
        " of Memory at ": null
    },
    {
        "Forest Lawn Memorial Park, Glendale": "Forest Lawn Memorial Park, Glendale"
    },
    {
        ". Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 . McFarland & Company, Inc., Publishers. Kindle Edition. Because of his habit of periodically revising his date of birth, his niche lists the incorrect date of 1893. Curtis, p. 387. When his longtime companion David Lewis died in 1987, his executor and Whale biographer James Curtis had his ashes interred in a niche across from Whales. Curtis, p. 389.       James Whale lived as an openly gay man throughout his career in the British theatre and in Hollywood, something that was virtually unheard of in the 1920s and 1930s. He and ": null
    },
    {
        "David Lewis": "David Lewis"
    },
    {
        " lived together as a couple from around 1930 to 1952. While he did not go out of his way to publicize his homosexuality, he did not do anything to conceal it either. As filmmaker Curtis Harrington, a friend and confidant of Whales, put it, Not in the sense of screaming it from the rooftops or coming out. But yes, he was openly homosexual. Any sophisticated person who knew him knew he was gay. While there have been suggestions that Whales career was terminated because of ": null
    },
    {
        "homophobia": "Homophobia"
    },
    {
        ", Bryant, p. 46. Russo, pp. 50–51. and Whale was supposedly dubbed The Queen of Hollywood , Benshoff, p. 41. Harrington states that nobody made a thing out of it as far as I could perceive .     With knowledge of his sexuality becoming more common beginning in the 1970s, some film historians and gay studies scholars have detected homosexual themes in Whales work, particularly in  Bride of Frankenstein  in which a number of the creative people associated with the cast, including ": null
    },
    {
        "Ernest Thesiger": "Ernest Thesiger"
    },
    {
        " and ": null
    },
    {
        "Colin Clive": "Colin Clive"
    },
    {
        ",  were alleged to be gay or bisexual. Scholars have identified a gay sensibility suffused through the film, especially a ": null
    },
    {
        "camp": "Camp"
    },
    {
        " sensibility, Skal, p. 184. particularly embodied in the character of ": null
    },
    {
        "Pretorius": "Doctor Septimus Pretorius"
    },
    {
        " and his relationship with ": null
    },
    {
        "Henry Frankenstein": "Victor Frankenstein"
    },
    {
        " .     Gay film historian ": null
    },
    {
        "Vito Russo": "Vito Russo"
    },
    {
        ", in considering Pretorius, stops short of identifying the character as gay, instead referring to him as sissified Russo, p. 50. . Pretorius serves as a gay ": null
    },
    {
        "Mephistopheles": "Mephistopheles"
    },
    {
        " , Skal, p. 185. a figure of seduction and temptation, going so far as to pull Frankenstein away from his bride on their wedding night to engage in the unnatural act of non-procreative life. A novelisation of the film published in England made the implication clear, having Pretorius say to Frankenstein Be fruitful and multiply. Let us obey the Biblical injunction: you of course, have the choice of natural means; but as for me, I am afraid that there is no course open to me but the scientific way. Egremont, Michael, quoted in Skal, p. 189. Russo goes so far as to suggest that Whales homosexuality is expressed in both Frankenstein and Bride as a vision both films had of the monster as an antisocial figure in the same way that gay people were things that should not have happened . Russo, p. 49.     The Monster, whose affections for the male hermit and the female Bride he discusses with identical language , has been read as sexually unsettled and bisexual. Writes gender studies author Elizabeth Young: He has no innate understanding that the male-female bond he is to forge with the bride is assumed to be the primary one or that it carries a different sexual valence from his relationships with all affective relationships are as easily friendships as marriages. Young, p. 134. Indeed, his relationship with the hermit has been interpreted as a same-sex marriage that heterosexual society will not tolerate: No mistake—this is a marriage, and a viable one , writes cultural critic Gary Morris for Bright Lights Film Journal. But Whale reminds us quickly that society does not approve. The monster—the outsider—is driven from his scene of domestic pleasure by two gun-toting rubes who happen upon this startling alliance and quickly, instinctively, proceed to destroy it. The creation of the Bride scene has been called Whales reminder to the audience—his Hollywood bosses, peers, and everyone watching—of the majesty and power of the homosexual creator .     However, Harrington dismisses this as a younger critics evaluation. All artists do work that comes out of the unconscious mind and later on you can analyze it and say the symbolism may mean something, but artists dont think that way and I would bet my life that James Whale would never have had such concepts in mind.  Specifically in response to the majesty and power reading, Harrington states My opinion is thats just pure bullshit. Thats a critical interpretation that has nothing to do with the original inspiration. He concludes, I think the closest you can come to a homosexual metaphor in his films is to identify that certain sort of camp humor.     Whales companion David Lewis stated flatly that Whales sexual orientation was not germane to his filmmaking. Jimmy was first and foremost an artist, and his films represent the work of an artist—not a gay artist, but an artist. Quoted in Curtis, p. 144. Whales biographer Curtis rejects the notion that Whale would have identified with the Monster from a homosexual perspective, Curtis, p. 144. stating that if the highly class-conscious Whale felt himself to be an antisocial figure, it would have been based not in his sexuality but in his origin in the lower classes. Curtis, p. 143.       Whale was heavily influenced by ": null
    },
    {
        "German Expressionism": "German Expressionism"
    },
    {
        ". He was a particular admirer of the films of ": null
    },
    {
        "Paul Leni": "Paul Leni"
    },
    {
        ", combining as they did elements of gothic horror and comedy. This influence was most evident in Bride of Frankenstein. Worland, p. 66. Expressionist influence is also in evidence in Frankenstein, drawn in part from the work of ": null
    },
    {
        "Paul Wegener": "Paul Wegener"
    },
    {
        " and his films  The Golem  and  The Golem: How He Came into the World  Young, et al., p. 188. along with  The Cabinet of Dr. Caligari  from ": null
    },
    {
        "Robert Wiene": "Robert Wiene"
    },
    {
        ", which Whale reportedly screened repeatedly while preparing to shoot Frankenstein. Curtis, p. 149. Frankenstein roughly alternates between distorted expressionistic shots and more conventional styles, with the character of Dr. Waldman serving as a bridge between everyday and expressionist spaces . Worland, p. 163. Expressionist influence is also evident in the acting, costuming and the design of the Monster. Worland, p. 168. Whale and makeup artist ": null
    },
    {
        "Jack Pierce": "Jack Pierce"
    },
    {
        " may also have been influenced by the ": null
    },
    {
        "Bauhaus": "Bauhaus"
    },
    {
        " school of design. Skal, p. 130. The expressionist influence lasted throughout Whales career, with Whales final film, Hello Out There, praised by  Sight & Sound  as a virtuoso pattern of light and shade, a piece of fully blown expressionist filmmaking plonked down unceremoniously in the midst of neo-realisms heyday . Quoted in Curtis, p. 364.     Whale was known for his use of camera movement. He is credited with being the first director to use a 360-degree ": null
    },
    {
        "panning": "Panning"
    },
    {
        " shot in a feature film, included in Frankenstein. Robertson, p. 126. Whale used a similar technique during the  Ol Man River  sequence in Show Boat, in which the camera tracked around ": null
    },
    {
        "Paul Robeson": "Paul Robeson"
    },
    {
        " as he sang the song. Often singled out for praise in Frankenstein is the series of shots used to introduce the Monster: Nothing can ever quite efface the thrill of watching the successive views Whales mobile camera allows us of the lumbering figure . Prawer, p. 28. These shots, starting with a medium shot and culminating in two close-ups of the Monsters face, were repeated by Whale to introduce Griffin in The Invisible Man and the abusive husband in One More River. Modified to a single cut rather than two, Whale uses the same technique in The Road Back to signal the instability of a returning World War I veteran.            Influential film critic ": null
    },
    {
        "Andrew Sarris": "Andrew Sarris"
    },
    {
        ", in his 1968 ranking of directors, lists Whale as lightly likable . Noting that Whales reputation has been subsumed by the Karloff cult , Sarris cites Bride of Frankenstein as the true gem of the Frankenstein series and concludes that Whales career reflects the stylistic ambitions and dramatic disappointments of an expressionist in the studio-controlled Hollywood of the thirties . Sarris, p. 187.     Whales final months are the subject of the novel  Father of Frankenstein  by ": null
    },
    {
        "Christopher Bram": "Christopher Bram"
    },
    {
        ". The novel focuses on the relationship between Whale and a fictional gardener named Clayton Boone. Father of Frankenstein served as the basis of the 1998 film  Gods and Monsters  with ": null
    },
    {
        "Ian McKellen": "Ian Mckellen"
    },
    {
        " as Whale and ": null
    },
    {
        "Brendan Fraser": "Brendan Fraser"
    },
    {
        " as Boone.  McKellen was nominated for an ": null
    },
    {
        "Academy Award": "Academy Award"
    },
    {
        " for his portrayal of Whale.  Brams novel has also been adapted as a play which premiered in London at the ": null
    },
    {
        "Southwark Playhouse": "Southwark Playhouse"
    },
    {
        " in February 2015.      Only two of Whales films received Oscar nominations: The Man in the Iron Mask , and Bride of Frankenstein .     A memorial statue was erected for Whale in September 2001 on the grounds of a new multiplex cinema in his home town of Dudley. The statue, by ": null
    },
    {
        "Charles Hadcock": "Charles Hadcock"
    },
    {
        ", depicts a roll of film with the face of ": null
    },
    {
        "Frankensteins monster": "Frankensteins Monster"
    },
    {
        " engraved into the ": null
    },
    {
        "frames": "Film Frame"
    },
    {
        ", and the names of his most famous films etched into a cast concrete base in the shape of film canisters. Other sculptures related to Whales cinema career were planned, referencing his early work in a local sheet metal factory, but none had been installed as of 2019. Noszlopy, et al., p. 51.     Horror in Hollywood: The James Whale Story, a retrospective of Whales artwork, opened at the ": null
    },
    {
        "Dudley Museum and Art Gallery": "Dudley Museum And Art Gallery"
    },
    {
        " in October 2012 and ran through to January 2013.        ": null
    }
]