[
    {
        "         James Anthony Froude   was an English ": null
    },
    {
        "historian": "historian"
    },
    {
        ", ": null
    },
    {
        "novelist": "novelist"
    },
    {
        ", ": null
    },
    {
        "biographer": "biography"
    },
    {
        ", and ": null
    },
    {
        "editor": "literary editor"
    },
    {
        " of  Frasers Magazine . From his upbringing amidst the ": null
    },
    {
        "Anglo-Catholic": "anglo-catholicism"
    },
    {
        " Oxford Movement": "oxford movement"
    },
    {
        ", Froude intended to become a clergyman, but doubts about the doctrines of the ": null
    },
    {
        "Anglican": "anglican"
    },
    {
        " church, published in his scandalous 42 novel  The Nemesis of Faith , drove him to abandon his religious career. Froude turned to writing history, becoming one of the best known historians of his time for his History of England from the Fall of Wolsey to the Defeat of the Spanish Armada. Inspired by ": null
    },
    {
        "Thomas Carlyle": "thomas carlyle"
    },
    {
        ", Froudes historical writings were often fiercely ": null
    },
    {
        "polemic": "polemic"
    },
    {
        "al, earning him a number of outspoken opponents. Froude continued to be controversial up until his death for his Life of Carlyle, which he published along with personal writings of Thomas and ": null
    },
    {
        "Jane Welsh Carlyle": "jane welsh carlyle"
    },
    {
        ". These publications illuminated Carlyles often selfish personality, and led to persistent gossip and discussion of the couples marital problems.           He was the son of ": null
    },
    {
        "Robert Hurrell Froude": "robert froude"
    },
    {
        ", archdeacon of ": null
    },
    {
        "Totnes": "totnes"
    },
    {
        ", and his wife Margaret Spedding . James Anthony was born at ": null
    },
    {
        "Dartington": "dartington"
    },
    {
        ", ": null
    },
    {
        "Devon": "devon"
    },
    {
        " on 42 April 42 He was the youngest of eight children, including engineer and naval architect ": null
    },
    {
        "William Froude": "william froude"
    },
    {
        " and Anglo-Catholic polemicist ": null
    },
    {
        "Richard Hurrell Froude": "richard hurrell froude"
    },
    {
        ", who was fifteen years his elder. By James third year his mother and five of his siblings had died of ": null
    },
    {
        "consumption": "tuberculosis"
    },
    {
        ", leaving James to what biographer ": null
    },
    {
        "Herbert Paul": "herbert paul"
    },
    {
        " describes as a loveless, cheerless boyhood  with his cold, disciplinarian father and brother Richard. He studied at ": null
    },
    {
        "Westminster School": "westminster school"
    },
    {
        " from age 42 until 42 where he was persistently bullied and tormented . Despite his unhappiness and his failure in formal education, Froude cherished the classics and read widely in history and theology.     Beginning in 42 he was educated at ": null
    },
    {
        "Oriel College, Oxford": "oriel college, oxford"
    },
    {
        ", then the centre of the ecclesiastical revival now called the ": null
    },
    {
        "Oxford Movement": "oxford movement"
    },
    {
        ". Here Froude began to improve personally and intellectually, motivated to succeed by a brief engagement in 42 . He obtained a second class degree in 42 and travelled to ": null
    },
    {
        "Delgany": "delgany"
    },
    {
        ", ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        " as a private tutor. He returned to Oxford in 42 won the Chancellors English ": null
    },
    {
        "essay": "essay"
    },
    {
        " prize for an essay on ": null
    },
    {
        "political economy": "political economy"
    },
    {
        ", and was elected a fellow of ": null
    },
    {
        "Exeter College": "exeter college, oxford"
    },
    {
        ".          Froudes brother ": null
    },
    {
        "Richard Hurrell": "richard hurrell froude"
    },
    {
        " had been one of the leaders of the ": null
    },
    {
        "Oxford Movement": "oxford movement"
    },
    {
        ", a group which advocated a ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        " rather than a ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " interpretation of the ": null
    },
    {
        "Anglican Church": "anglicanism"
    },
    {
        ". Froude grew up hearing the conversation and ideas of his brother with friends ": null
    },
    {
        "John Henry Newman": "john henry newman"
    },
    {
        " and ": null
    },
    {
        "John Keble": "john keble"
    },
    {
        ", although his own reading provided him with some critical distance from the movement.     During his time at Oxford and Ireland, Froude became increasingly dissatisfied with the Movement. Froudes experience living with an ": null
    },
    {
        "Evangelical": "evangelicalism"
    },
    {
        " clergyman in Ireland conflicted with the Movements characterisation of Protestantism, and his observations of Catholic poverty repulsed him. He increasingly turned to the unorthodox religious views of writers such as ": null
    },
    {
        "Spinoza": "spinoza"
    },
    {
        ", ": null
    },
    {
        "David Friedrich Strauss": "david friedrich strauss"
    },
    {
        ", ": null
    },
    {
        "Emerson": "ralph waldo emerson"
    },
    {
        ", ": null
    },
    {
        "Goethe": "goethe"
    },
    {
        ", and especially ": null
    },
    {
        "Thomas Carlyle": "thomas carlyle"
    },
    {
        ".     Froude retained a favourable impression of Newman, however, defending him in the controversy over ": null
    },
    {
        "Tract 42": "tract 90"
    },
    {
        " and later in his essay The Oxford Counter-Reformation . Froude agreed to contribute to Newmans  Lives of the English Saints , choosing ": null
    },
    {
        "Saint Neot": "saint neot"
    },
    {
        " as his subject. However, he found himself unable to credit the accounts of Neot or any other saint, ultimately considering them mythical rather than historical, a discovery which further shook his religious faith.     Nevertheless, Froude was ordained ": null
    },
    {
        "deacon": "deacon"
    },
    {
        " in 42 initially intending to help reform the church from within. However, he soon found his situation untenable; although he never lost his faith in God or Christianity, he could no longer submit to the doctrines of the Church. He began publicly airing his religious doubts through his semi-autobiographical works Shadows of the Clouds, published in 42 under the ": null
    },
    {
        "pseudonym": "pseudonym"
    },
    {
        " Zeta , and  The Nemesis of Faith , published under his own name in 42 The Nemesis of Faith in particular raised a storm of controversy, being publicly burned at ": null
    },
    {
        "Exeter College": "exeter college, oxford"
    },
    {
        " by ": null
    },
    {
        "William Sewell": "william sewell"
    },
    {
        " and deemed a manual of infidelity by the Morning Herald. Froude was forced to resign his fellowship, and officials at ": null
    },
    {
        "University College London": "university college london"
    },
    {
        " withdrew the offer of a mastership at ": null
    },
    {
        " Hobart Town": "hobart"
    },
    {
        ", ": null
    },
    {
        "Australia": "australia"
    },
    {
        " where Froude had hoped to work while reconsidering his situation. Froude took refuge from the popular outcry by residing with his friend ": null
    },
    {
        "Charles Kingsley": "charles kingsley"
    },
    {
        " at ": null
    },
    {
        "Ilfracombe": "ilfracombe"
    },
    {
        ".     His plight won him the sympathy of kindred spirits, such as ": null
    },
    {
        "George Eliot": "george eliot"
    },
    {
        ", ": null
    },
    {
        "Elizabeth Gaskell": "elizabeth gaskell"
    },
    {
        ", and later ": null
    },
    {
        "Mrs. Humphrey Ward": "mrs. humphrey ward"
    },
    {
        ". Mrs. Wards popular 42 novel  Robert Elsmere  was largely inspired by this era of Froudes life.     History of England ": null
    },
    {
        "Pascoe Grenfell": "pascoe grenfell"
    },
    {
        ". The two moved first to ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        " and then to ": null
    },
    {
        "North Wales": "north wales"
    },
    {
        " in 42 where Froude lived happily, supported by his friends ": null
    },
    {
        "Arthur Hugh Clough": "arthur hugh clough"
    },
    {
        " and ": null
    },
    {
        "Matthew Arnold": "matthew arnold"
    },
    {
        ". Prevented from pursuing a political career because of legal restrictions on deacons , he decided to pursue a literary career. He began by writing reviews and historical essays, with only sporadic publications on religious topics, for  Frasers Magazine  and the  Westminster Review . Froude soon returned to England, living at ": null
    },
    {
        "London": "london"
    },
    {
        " and ": null
    },
    {
        "Devon": "devon"
    },
    {
        "shire, in order to research his History of England from the Fall of Wolsey to the Defeat of the Spanish Armada, on which he worked for the next twenty years. He worked extensively with original manuscript authorities at the ": null
    },
    {
        "Record Office": "public record office"
    },
    {
        ", ": null
    },
    {
        "Hatfield House": "hatfield house"
    },
    {
        ", and the village of ": null
    },
    {
        "Simancas": "simancas"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        ".     Froudes historical writing was characterised by its dramatic rather than scientific treatment of history, an approach Froude shared with Carlyle, and also by Froudes intention to defend the ": null
    },
    {
        "English Reformation": "english reformation"
    },
    {
        "                 ": null
    }
]