[
    {
        "      James Robert Flynn ": null
    },
    {
        "FRSNZ": "royal society of new zealand"
    },
    {
        " is a New Zealand ": null
    },
    {
        "intelligence researcher": "intelligence"
    },
    {
        ". An Emeritus Professor of Political Studies at the ": null
    },
    {
        "University of Otago": "university of otago"
    },
    {
        " in ": null
    },
    {
        "Dunedin": "dunedin"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ", he is famous for his publications about the continued year-after-year increase of ": null
    },
    {
        "IQ": "iq"
    },
    {
        " scores throughout the world, which is now referred to as the ": null
    },
    {
        "Flynn effect": "flynn effect"
    },
    {
        ". The Flynn effect is the subject of a multiple-author monograph published by the ": null
    },
    {
        "American Psychological Association": "american psychological association"
    },
    {
        " in 1998.  This review of contemporary research includes chapters by ": null
    },
    {
        "Ulric Neisser": "ulric neisser"
    },
    {
        ", James R. Flynn, Carmi Schooler, Patricia M. Greenfield, ": null
    },
    {
        "Wendy M. Williams": "wendy m. williams"
    },
    {
        ", Marian Sigman, Shannon E. Whaley, ": null
    },
    {
        "Reynaldo Martorell": "reynaldo martorell"
    },
    {
        ", ": null
    },
    {
        "Richard Lynn": "richard lynn"
    },
    {
        ", ": null
    },
    {
        "Robert M. Hauser": "robert m. hauser"
    },
    {
        ", David W. Grissmer, Stephanie Williamson, Sheila Nataraj Kirby, Mark Berends, ": null
    },
    {
        "Stephen J. Ceci": "stephen j. ceci"
    },
    {
        ", Tina B. Rosenblum, Matthew Kumpf, Min-Hsiung Huang, Irwin D. Waldman, ": null
    },
    {
        "Samuel H. Preston": "samuel h. preston"
    },
    {
        ", and ": null
    },
    {
        "John C. Loehlin": "john c. loehlin"
    },
    {
        ". Originally from ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        " and educated at the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        ", Flynn emigrated to New Zealand in 1963.     Flynns son ": null
    },
    {
        "Victor": "victor flynn"
    },
    {
        " is a mathematics professor at ": null
    },
    {
        "New College, Oxford": "new college, oxford"
    },
    {
        ".       Flynn has written a variety of books. His research interests include humane ideals and ideological debate, classics of ": null
    },
    {
        "political philosophy": "political philosophy"
    },
    {
        ", and race, class and IQ .  His books combine political and moral philosophy with ": null
    },
    {
        "psychology": "psychology"
    },
    {
        " to examine problems such as justifying humane ideals and whether it makes sense to rank ": null
    },
    {
        "races": "race"
    },
    {
        " and ": null
    },
    {
        "classes": "social class"
    },
    {
        " by merit. He is currently a member of the editorial board of  Intelligence   and on the Honorary International Advisory Editorial Board of the ": null
    },
    {
        "Mens Sana Monographs": "mens sana monographs"
    },
    {
        ".      Flynn defines intelligence to be independent of culture, emphasising that the style of thought required to deal with problems of survival in a desert , is different from that required to do well in the modern West , but that both undoubtedly require intelligence.     In 1987, ": null
    },
    {
        "Arthur Jensen": "arthur jensen"
    },
    {
        " praised Flynns criticism of Jensens own work in a chapter summarizing an academic book about Jensens research on human intelligence.     Now and then I am asked by colleagues, students, and journalists: who, in my opinion, are the most respectable critics of my position on the race-IQ issue? The name James R. Flynn is by far the first that comes to mind. His book, Race, IQ and Jensen , is a distinguished contribution to the literature on this topic, and, among the critiques I have seen of my position, is virtually in a class by itself for objectivity, thoroughness, and scholarly integrity.        A 1999 article published in  American Psychologist  summarises much of his research. On the alleged genetic inferiority of Blacks on IQ tests, he lays out the argument and evidence for such a belief and then contests each point. He interprets the direct evidence—when Blacks are raised in settings that are less disadvantageous—as suggesting that environmental factors explain genetic differences. And yet, he argues that the environmental explanation gained force after the discovery that IQ scores were rising over time. Inter-generational IQ differences among Whites and across nations were larger than the Black-White IQ Gap and could not be accounted for by genetic factors, which, if anything, should have reduced IQ, according to scholars he references. He posits that the Black-White IQ score gap can be entirely explained by environmental factors if the average environment for Blacks in 1995 matches the quality of the average environment for Whites in 1945 .     Flynns 2007 book  What Is Intelligence?  impressed ": null
    },
    {
        "Charles Murray": "charles murray"
    },
    {
        ", a co-author of the book  The Bell Curve , who wrote in a statement published on the books back cover, This book is a gold mine of pointers to interesting work, much of which was new to me. All of us who wrestle with the extraordinarily difficult questions about intelligence that Flynn discusses are in his debt .      Flynn believes in racial equality. He advocates for open scientific debate about controversial social science claims, and is critical of the suppression of research into race and intelligence.  He urges those who believe in racial equality to use solid evidence to advance those beliefs.      Flynns 2010 book The Torchlight List proposes that a person can learn more from reading great works of literature than they can from going to university.  In 2019, ": null
    },
    {
        "Emerald Insight": "emerald insight"
    },
    {
        " reversed its decision to publish Flynns then upcoming book In Defence of Free Speech. Their letter to Flynn cited concerns that the book would potentially violate ": null
    },
    {
        "hate speech laws in the United Kingdom": "hate speech laws in the united kingdom"
    },
    {
        ".      Flynn has described himself as an atheist, a scientific realist, a social democrat .              The Flynn effect is the substantial and long-sustained increase in intelligence test scores measured in many parts of the world. When ": null
    },
    {
        "intelligence quotient": "intelligence quotient"
    },
    {
        " tests are initially ": null
    },
    {
        "standardised": "standard scorestandardizing in mathematical statistics"
    },
    {
        " using a ": null
    },
    {
        "sample": "sample"
    },
    {
        " of test-takers, by convention the average of the test results is set to 100 and their ": null
    },
    {
        "standard deviation": "standard deviation"
    },
    {
        " is set to 15 IQ points. When IQ tests are revised they are again standardised using a new sample of test-takers, usually born more recently than the first. Again, the average result is set to 100. However, when the new test subjects take the older tests, in almost every case their average scores are significantly above 100.     Test score increases have been continuous and approximately linear from the earliest years of testing to the present. For the ": null
    },
    {
        "Ravens Progressive Matrices": "ravens progressive matrices"
    },
    {
        " test, subjects born over a 100-year period were compared in ": null
    },
    {
        "Des Moines": "des moines"
    },
    {
        ", ": null
    },
    {
        "Iowa": "iowa"
    },
    {
        ", and separately in ": null
    },
    {
        "Dumfries": "dumfries"
    },
    {
        ", ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". Improvements were remarkably consistent across the whole period, in both countries.  This effect of an apparent increase in IQ has also been observed in various other parts of the world, though the rates of increase vary.      There are numerous proposed explanations of the Flynn effect, as well as some scepticism about its implications. Similar improvements have been reported for other cognitions such as ": null
    },
    {
        "semantic": "semantic memory"
    },
    {
        " and ": null
    },
    {
        "episodic memory": "episodic memory"
    },
    {
        ".  Recent research suggests that the Flynn effect may have ended in at least a few developed nations, possibly allowing ": null
    },
    {
        "national differences in IQ scores": "race and intelligence"
    },
    {
        "  to diminish if the Flynn effect continues in nations with lower average national IQs.      Flynn himself, with co-worker William Dickens, has suggested an explanatory model which points to two-way causality between IQ and environment: a cognitively challenging environment raises an individuals IQ, while in addition, a higher individual IQ makes it more likely that an individual will self-select or be sorted into more cognitively challenging environments. Dickens, William T., and James R. Flynn. Heritability estimates versus large environmental effects: the IQ paradox resolved. Psychological Review 108.2 : 346.       In 1967, Flynn served as a chairperson for the ": null
    },
    {
        "Congress of Racial Equality": "congress of racial equality"
    },
    {
        " , a civil rights organisation in the US South.      Flynn campaigns passionately for left-wing causes, and became an initiating member of both the ": null
    },
    {
        "NewLabour Party": "newlabour party"
    },
    {
        " and of the ": null
    },
    {
        "Alliance": "alliance"
    },
    {
        ". He also advised ": null
    },
    {
        "Labour": "new zealand labour party"
    },
    {
        " Prime Minister ": null
    },
    {
        "Norman Kirk": "norman kirk"
    },
    {
        " on ": null
    },
    {
        "foreign policy": "foreign policy"
    },
    {
        ". He has stood as a ": null
    },
    {
        "parliamentary": "new zealand house of representatives"
    },
    {
        " candidate in general elections on several occasions, for example in the  electorate in the  and s on the ": null
    },
    {
        "Alliance": "alliance"
    },
    {
        " list": "party lists in the new zealand general election, 1996alliance"
    },
    {
        ",   and most recently in  again as an Alliance ": null
    },
    {
        "list": "party lists in the new zealand general election, 2005alliance"
    },
    {
        " candidate. In 2008 he acted as the Alliance spokesperson for finance and taxation.       During 2007, new research from the ": null
    },
    {
        "2006 New Zealand census": "2006 new zealand census"
    },
    {
        " showed that women without a tertiary education had produced 2.57 babies each, compared to 1.85 babies for those women with a higher education. During July 2007,  The Sunday Star-Times  quoted Flynn as saying that New Zealand ": null
    },
    {
        "risked having a less intelligent population": "dysgenics"
    },
    {
        " and that a persistent genetic trend which lowered the genetic quality for brain physiology would have some effect eventually . He referred to hypothetical ": null
    },
    {
        "eugenicists": "eugenicists"
    },
    {
        " suggestions for reversing the trend, including some sort of ": null
    },
    {
        "oral contraceptive": "oral contraceptive"
    },
    {
        " in the water supply and … an antidote to conceive.      Flynn later articulated his own views on the  Close Up  television program in an interview with ": null
    },
    {
        "Paul Henry": "paul henry"
    },
    {
        ", suggesting that the Sunday Star-Times had grossly misrepresented his opinions. In the article, Flynn argued that he never intended for his suggestion to be taken seriously, as he only said this to illustrate a particular point.       In July 2012, several media outlets reported Flynn as claiming that women had, for the first time in a century, surpassed men on IQ tests based on a study he conducted in 2010.   However, Flynn announced that the media had seriously distorted his results and went beyond his claims, revealing that he had instead discovered that the differences between men and women on one particular test, the ": null
    },
    {
        "Ravens Progressive Matrices": "ravens progressive matrices"
    },
    {
        ", had become minimal in five modernised nations . Women, he argued, caught up to men in these nations as a result of exposure to modernity by entering the professions and being allowed greater educational access. Therefore, he claimed, when a total account of the Flynn effect is considered, womens closing the gap had moved them up in IQ slightly faster than men as a result. Flynn had previously documented this same trend among ethnic minorities and other disadvantaged groups. According to Flynn, the sexes are dead equal on cognitive factors ... in their ability to deal with using logic on the abstract problems of Ravens, but that temperamental differences in the way boys and girls take the tests likely account for the tiny variations in mean scores, rather than any difference in intellectual ability.     In 2019 Flynn was told that his new book In Defence of Free Speech: The University as Censor would not be published by an English publisher who had previously accepted it and scheduled it for publication. But it was thought too controversial under the United Kingdoms laws about hate speech as the intent is irrelevant if it is thought likely that racial hatred could be stirred up as a result of the work.  Academica Press later agreed to publish the book.         - Reviews the debate, as of 1980, about the research of ": null
    },
    {
        "Arthur Jensen": "arthur jensen"
    },
    {
        " and his critics.                 ": null
    }
]