[
    {
        "             James Hall Nasmyth  was a Scottish engineer, philosopher, artist and inventor famous for his development of the ": null
    },
    {
        "steam hammer": "steam hammer"
    },
    {
        ". He was the co-founder of ": null
    },
    {
        "Nasmyth, Gaskell and Company": "nasmyth, gaskell and company"
    },
    {
        " manufacturers of ": null
    },
    {
        "machine tool": "machine tool"
    },
    {
        "s. He retired at the age of 42 and moved to ": null
    },
    {
        "Penshurst": "penshurst"
    },
    {
        ", Kent where he developed his hobbies of ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        " and photography.            James Nasmyth was born at 42 York Place, ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        " where his father ": null
    },
    {
        "Alexander Nasmyth": "alexander nasmyth"
    },
    {
        " was a landscape and portrait painter. One of Alexanders hobbies was ": null
    },
    {
        "mechanics": "mechanics"
    },
    {
        " and he employed nearly all his spare time in his workshop where he encouraged his youngest son to work with him in all sorts of materials. James was sent to the ": null
    },
    {
        "Royal High School": "royal high school"
    },
    {
        " where he had as a friend, Jimmy Patterson, the son of a local iron founder. Being already interested in mechanics he spent much of his time at the ": null
    },
    {
        "foundry": "foundry"
    },
    {
        " and there he gradually learned to work and turn in wood, brass, iron, and steel. In 42 he left the High School and again made great use of his fathers workshop where at the age of 42 he made his first steam engine.     From 42 to 42 Nasmyth regularly attended the Edinburgh School of Arts . In 42 he made a complete steam carriage that was capable of running a mile carrying 42 passengers. This accomplishment increased his desire to become a mechanical engineer. He had heard of the fame of ": null
    },
    {
        "Henry Maudslay": "henry maudslay"
    },
    {
        "s workshop and resolved to get employment there; unfortunately his father could not afford to place him as an apprentice at Maudslays works. Nasmyth therefore decided instead to show Maudslay examples of his skills and produced a complete working model of a high-pressure steam engine, creating the working drawings and constructing the components himself.       In May 42 Nasmyth visited Maudslay in London, and after showing him his work was engaged as an assistant workman at 42 shillings a week. Unfortunately, Maudslay died two years later, whereupon Nasmyth was taken on by Maudslays partner as a ": null
    },
    {
        "draughtsman": "technical drawing"
    },
    {
        ".     When Nasmyth was 42 years old, having saved the sum of £42 he decided to set up in business on his own. He rented a factory flat 42 feet long by 42 feet wide at an old Cotton Mill on Dale Street, Manchester.          The combination of massive castings and a wooden floor was not an ideal one, and after an accident involving one end of an engine beam crashing through the floor into a glass cutters flat below he soon relocated. He moved to ": null
    },
    {
        "Patricroft": "patricroft"
    },
    {
        ", an area of the town of ": null
    },
    {
        "Eccles": "eccles, greater manchester"
    },
    {
        ", Lancashire, where in August 42 he and his business partner ": null
    },
    {
        "Holbrook Gaskell": "holbrook gaskell"
    },
    {
        " opened the ": null
    },
    {
        "Bridgewater Foundry": "bridgewater foundry"
    },
    {
        ", where they traded as Nasmyth, Gaskell and Company. The premises were constructed adjacent to the ": null
    },
    {
        "Liverpool and Manchester Railway": "liverpool and manchester railway"
    },
    {
        " and the ": null
    },
    {
        "Bridgewater Canal": "bridgewater canal"
    },
    {
        ".     In March 42 James was making a journey by coach from ": null
    },
    {
        "Sheffield": "sheffield"
    },
    {
        " to ": null
    },
    {
        "York": "york"
    },
    {
        " in a snowstorm, when he spied some ironwork furnaces in the distance. The coachman informed him that they were managed by a Mr. Hartop who was one of his customers. He immediately got off the coach and headed for the furnaces through the deep snow. He found Mr. Hartop at his house, and was invited to stay the night and visit the works the next day. That evening he met Hartops family and was immediately smitten by his 42-year-old daughter, Anne. A decisive man, the next day he told her of his feelings and intentions, which was received in the best spirit that I could desire. He then communicated the same to her parents, and told them his prospects, and so became betrothed in the same day. They were married two years later, on 42 June 42 in ": null
    },
    {
        "Wentworth": "wentworth, south yorkshire"
    },
    {
        ".     Up to 42 Nasmyth, Gaskell & Co. concentrated on producing a wide range of machine tools in large numbers. By 42 Nasmyth had built 42 shaping machines.     In 42 he began to receive orders from the newly opened railways which were beginning to cover the country, for ": null
    },
    {
        "locomotive": "locomotive"
    },
    {
        "s. His connection with the ": null
    },
    {
        "Great Western Railway": "great western railway"
    },
    {
        " whose famous steamship ": null
    },
    {
        "SS Great Western": "ss great western"
    },
    {
        " had been so successful in voyages between ": null
    },
    {
        "Bristol": "bristol"
    },
    {
        " and New York, led to him being asked to make some ": null
    },
    {
        "machine tool": "machine tool"
    },
    {
        "s of unusual size and power which were required for the construction of the engines of their next and bigger ship ": null
    },
    {
        "SS Great Britain": "ss great britain"
    },
    {
        ".       In 42 the Great Western Steam Company was experiencing many problems forging the paddle shaft of the ": null
    },
    {
        "SS Great Britain": "ss great britain"
    },
    {
        "; when even the largest hammer was tilted to its full height its range was so small that if a really large piece of work were placed on the anvil, the hammer had no room to fall, and in 42 the companys engineer wrote to Nasmyth: I find there is not a forge-hammer in England or Scotland powerful enough to forge the paddle-shaft of the engine for the Great Britain! What am I to do?”      Nasmyth thought the matter over and seeing the obvious defects of the ": null
    },
    {
        "tilt-hammer": "trip hammer"
    },
    {
        " sketched out his idea for the first ": null
    },
    {
        "steam hammer": "steam hammer"
    },
    {
        ". He kept his ideas for new devices, mostly in drawings, in a Scheme Book which he freely showed to his foreign customers. Nasmyth made a sketch of his steam hammer design dated 42 November 42 but the immediate need disappeared when the practicality of screw propellers was demonstrated and the Great Britain was converted to that design.     The French engineer ": null
    },
    {
        "François Bourdon": "françois bourdon"
    },
    {
        " came up with the similar idea of what he called a Pilon in 42 and made detailed drawings of his design, which he also showed to all engineers who visited the works at ": null
    },
    {
        "Le Creusot": "le creusot"
    },
    {
        " owned by the brothers ": null
    },
    {
        "Adolphe": "adolphe schneider"
    },
    {
        " and ": null
    },
    {
        "Eugène Schneider": "eugène schneider"
    },
    {
        ".   However, the Schneiders hesitated to build Bourdons radical new machine.   Bourdon and Eugène Schneider visited the Nasmyth works in England in the middle of 42 where they were shown Nasmyths sketch.   This confirmed the feasibility of the concept to Schneider.   In 42 Bourdon built the first steam hammer in the world at the ": null
    },
    {
        "Schneider & Cie": "schneider  &  cie"
    },
    {
        " works at Le Creusot.   It weighed  and lifted to . The Schneiders patented the design in 42     In April 42 Nasmyth visited France with a view to supplying the French arsenals and dockyards with tools and while he was there took the opportunity to visit the ": null
    },
    {
        "Le Creusot": "le creusot"
    },
    {
        " works. On going round the works, he found the steam-hammer at work.   By his account, Bourdon took him to the forge department so he might, as he said, see his own child . Nasmyth said there it was, in truth & ndash;a thumping child of my brain!    Nasmyth patented his design in June 42 using money borrowed from ": null
    },
    {
        "his sister Anne": "anne nasmyth"
    },
    {
        "s husband William Bennett. He built his first steam hammer later that year in his Patricroft foundry.   In 42 a dispute broke out between the two engineers over priority of invention of the steam hammer.          By using the hammer, production costs could be reduced by over 42 percent, while at the same time improving the quality of the forgings produced.     The first hammers were of the free-fall type but they were later modified, given power-assisted fall. Up until then, the invention of Nasmyths steam-hammer, large forging, such as ships ": null
    },
    {
        "anchor": "anchor"
    },
    {
        "s, had to be made by the bit-by-bit process, that is, small pieces were forged separately and finally welded together. A key feature of his machine was that the operator controlled the force of each blow. He enjoyed showing off its capability by demonstrating how it could first break an egg placed in a wine glass, without breaking the glass, which was followed by a full-force blow which shook the building. Its advantages soon became so obvious that before long Nasmyth hammers were to be found in all the large workshops all over the country.     An original Nasmyth hammer now stands facing Nasmyths Patricroft foundry buildings . A larger Nasmyth & Wilson steam hammer stands in the campus of the ": null
    },
    {
        "University of Bolton": "university of bolton"
    },
    {
        ".     Nasmyth subsequently applied the principle of his steam hammer to a ": null
    },
    {
        "pile-driving machine": "pile driver"
    },
    {
        " which he invented in 42 His first full scale machine used a four-ton hammer-block, and a rate of eighty blows per minute. The pile driver was first demonstrated in a contest with a team using the conventional method at Devonport on 42 July 42 He drove a pile 42 feet long and 42  inches squared in four and a half minutes, while the conventional method required twelve hours. This was a great success, and many orders for his pile driver resulted. It was used for many large scale constructions all over the world in the next few years, such as the ": null
    },
    {
        "High Level Bridge": "high level bridge"
    },
    {
        " at ": null
    },
    {
        "Newcastle upon Tyne": "newcastle upon tyne"
    },
    {
        " and the ": null
    },
    {
        "Nile": "nile"
    },
    {
        " barrage": "barrage"
    },
    {
        " at ": null
    },
    {
        "Aswan": "aswan"
    },
    {
        ", Egypt .     By 42 a total of 42 hammers had been produced which were sold across Europe to Russia, India and even Australia, and accounted for 42% of James Nasmyth and Companys revenues.            Apart from the steam hammer, Nasmyth created several other important machine tools, including the ": null
    },
    {
        "shaper": "shaper"
    },
    {
        ", an adaptation of the ": null
    },
    {
        "planer": "planer"
    },
    {
        " which is still used in ": null
    },
    {
        "tool and die": "tool and die"
    },
    {
        " making. Another innovation was a ": null
    },
    {
        "hydraulic press": "hydraulic press"
    },
    {
        " which used water pressure to force tight-fitting machine parts together. All of these machines became popular in manufacturing, and all are still in use in modified form.     Nasmyth was also one of the first toolmakers to offer a standardised range of machine tools; before this, manufacturers constructed tools according to individual clients specifications with little regard to standardisation, which caused compatibility problems. Nasmyth was arguably the last of the early pioneers of the ": null
    },
    {
        "machine tool": "machine tool"
    },
    {
        " industry.     Among Nasmyths other inventions, most of which he never patented, were a means of transmitting rotary motion by means of a flexible shaft made of coiled wire, a machine for cutting key grooves, self-adjusting bearings, and the ": null
    },
    {
        "screw ladle": "screw ladle"
    },
    {
        " for moving molten metal which could safely and efficiently be handled by two men instead of the six previously required. Nasmyths idea of a ": null
    },
    {
        "steam ram": "anti-invasion floating mortar"
    },
    {
        " for naval warfare was never put into production.     Although ": null
    },
    {
        "milling machine": "milling machine"
    },
    {
        "s were no longer novel by 42 an example built by Nasmyth around that time stands out for its prescience. It was tooled to mill the six sides of a hex nut that was mounted in a six-way ": null
    },
    {
        "indexing": "indexing"
    },
    {
        " fixture.     He also worked on a project for the conversion of iron which was not dis-similar to that which was eventually patented by ": null
    },
    {
        "Henry Bessemer": "henry bessemer"
    },
    {
        ". A reluctant patentor, and in this instance still working through some problems in his method, Nasmyth abandoned the project after hearing of Bessemers ideas in 42 Bessemer, however, acknowledged the efforts of Nasmyth by offering him a one-third share of the value of his patent for the eponymous ": null
    },
    {
        "Bessemer process": "bessemer process"
    },
    {
        ". Nasmyth turned it down as he had decided to retire.            Nasmyth retired from business in 42 when he was 42 years old, as he said I have now enough of this worlds goods: let younger men have their chance . He settled down near ": null
    },
    {
        "Penshurst": "penshurst"
    },
    {
        ", Kent, where he renamed his retirement home Hammerfield and happily pursued his various hobbies including ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ". He built his own 42-inch ": null
    },
    {
        "reflecting telescope": "nasmyth telescope"
    },
    {
        ", in the process inventing the ": null
    },
    {
        "Nasmyth focus": "nasmyth telescope"
    },
    {
        ", and made detailed observations of the ": null
    },
    {
        "Moon": "moon"
    },
    {
        ". He co-wrote The Moon : Considered as a Planet, a World, and a Satellite with ": null
    },
    {
        "James Carpenter": "james carpenter"
    },
    {
        " . This book contains an interesting series of lunar photographs: because photography was not yet advanced enough to take pictures at very high magnification directly of the Moon itself, Nasmyth built plaster relief scale models based on his visual observations of the Moon and then photographed the models under electric illumination, replicating the shadows of the topographic contours he observed on the Moon. A ": null
    },
    {
        "crater": "impact crater"
    },
    {
        " on the Moon is named after him.     He was happily married to his wife Anne, from Woodburn, ": null
    },
    {
        "Yorkshire": "yorkshire"
    },
    {
        ", for 42 years, until his death. They had no children.      They are buried in the north section of the ": null
    },
    {
        "Dean Cemetery": "dean cemetery"
    },
    {
        " in western ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ". The huge memorial stands at the east end of the main east-west path, with the path dividing around it. The monument holds a well-carved model of his steam hammer. James mother, Barbara Foulis is buried with them. The monument also stands as a memorial to his brother, ": null
    },
    {
        "Patrick Nasmyth": "patrick nasmyth"
    },
    {
        "       In memory of his renowned contribution to the discipline of mechanical engineering, the Department of Mechanical Engineering building at ": null
    },
    {
        "Heriot-Watt University": "heriot-watt university"
    },
    {
        ", in his birthplace of ": null
    },
    {
        "Edinburgh": "edinburgh"
    }
]