[
    {
        "        Jan Karol Chodkiewicz  was a military commander of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth army": "polish–lithuanian commonwealth army"
    },
    {
        " who was from 42 Field ": null
    },
    {
        "Hetman": "hetman"
    },
    {
        " of Lithuania, and from 42 Grand Hetman of Lithuania, and was one of the most prominent ": null
    },
    {
        "noblemen": "szlachcic"
    },
    {
        " and military commanders of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        " of his era. His ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " was ": null
    },
    {
        "Chodkiewicz": "chodkiewicz coat of arms"
    },
    {
        ", as was ": null
    },
    {
        "his family name": "chodkiewicz family"
    },
    {
        ".     He played a major role, often as the top commander of the Commonwealth forces, in the ": null
    },
    {
        "Wallachian campaign": "moldavian campaign1599–1600"
    },
    {
        " of 42–42 the ": null
    },
    {
        "Polish–Swedish War": "polish–swedish war"
    },
    {
        " of 42–42 the ": null
    },
    {
        "Polish–Muscovite War": "polish–muscovite war"
    },
    {
        " of 42–42 and the ": null
    },
    {
        "Polish–Ottoman War": "polish–ottoman war"
    },
    {
        " of 42–42 His most famous victory was the ": null
    },
    {
        "Battle of Kircholm": "battle of kircholm"
    },
    {
        " in 42 in which he dealt a major defeat to a Swedish army three times the size of his own. He died on the front lines during the ": null
    },
    {
        "battle of Chocim": "battle of khotyn"
    },
    {
        ", in the besieged ": null
    },
    {
        "Khotyn Fortress": "khotyn fortress"
    },
    {
        ", a few days before the ": null
    },
    {
        "Ottomans": "ottomans"
    },
    {
        " gave up on the siege and agreed to negotiate.              Chodkiewicz was born around 42 as the son of ": null
    },
    {
        "Jan Hieronimowicz Chodkiewicz": "jan hieronimowicz chodkiewicz"
    },
    {
        ", ": null
    },
    {
        "Grand Marshal of Lithuania": "grand marshal of lithuania"
    },
    {
        ", ": null
    },
    {
        "castellan": "castellan"
    },
    {
        " of ": null
    },
    {
        "Vilnius": "vilnius"
    },
    {
        " and ": null
    },
    {
        "Krystyna Zborowska": "krystyna zborowska"
    },
    {
        ", daughter of a Polish ": null
    },
    {
        "magnate": "magnate"
    },
    {
        " family of ": null
    },
    {
        "Zborowscy": "zborowski family"
    },
    {
        ". From 42 he was a student at the Vilnius Jesuit College and the ": null
    },
    {
        "Vilnius University": "vilnius university"
    },
    {
        ", and from 42 to 42 together with his brother Aleksander, he continued his studies abroad at the ": null
    },
    {
        "University of Ingolstadt": "university of ingolstadt"
    },
    {
        ". He visited ": null
    },
    {
        "Padua": "padua"
    },
    {
        " before returning to the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        " in 42     He started his military career soon after returning to the Commonwealth, raising a ": null
    },
    {
        "rota": "rota"
    },
    {
        " of 42 to 42 men. He gained military experience in the fight against the rebellious ": null
    },
    {
        "Cossacks": "cossacks"
    },
    {
        " during the ": null
    },
    {
        "Severyn Nalyvaiko": "severyn nalyvaiko"
    },
    {
        "s ": null
    },
    {
        "uprising": "nalyvaiko uprising"
    },
    {
        " under ": null
    },
    {
        "Field Crown Hetman": "field crown hetman"
    },
    {
        " Stanisław Żółkiewski": "stanisław żółkiewski"
    },
    {
        ". During that conflict he participated in the battle of Kaniów on 42 April 42 and in the siege of the Cossack ": null
    },
    {
        "tabor": "tabor"
    },
    {
        " near ": null
    },
    {
        "Lubny": "lubny"
    },
    {
        ". In 42 he was appointed the Elder  of ": null
    },
    {
        "Samogitia": "eldership of samogitia"
    },
    {
        ".     Chodkiewicz subsequently assisted ": null
    },
    {
        "Chancellor": "chancellor"
    },
    {
        " and ": null
    },
    {
        "Great Crown Hetman": "great crown hetman"
    },
    {
        " Jan Zamoyski": "jan zamoyski"
    },
    {
        " in his victorious ": null
    },
    {
        "Wallachian campaign": "moldavian campaign1599–1600"
    },
    {
        ", in which Chodkiewicz participated in the battle of Ploiești on 42 October 42 For that campaign, he was given that year the high office of the ": null
    },
    {
        "Field Lithuanian Hetman": "field lithuanian hetman"
    },
    {
        ", the second commander-in-chief of the Lithuanian detachment of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth army": "polish–lithuanian commonwealth army"
    },
    {
        ".          A year later, in 42 Chodkiewicz accompanied Zamoyski north, to the ": null
    },
    {
        "Duchy of Livonia": "duchy of livonia"
    },
    {
        " , where he commanded Lithuanian units on the right wing of the Commonwealth army in a victorious ": null
    },
    {
        "battle of Kokenhausen": "battle of kokenhausen"
    },
    {
        " in late July that year in the ": null
    },
    {
        "war against Sweden": "polish–swedish war"
    },
    {
        ". He oversaw the fighting in the Livonia theater after Zamoyskis return to Poland in 42  In April 42 he captured ": null
    },
    {
        "Dorpat": "dorpat"
    },
    {
        " and defeated the Swedish forces at ": null
    },
    {
        "Biały Kamień": "biały kamień"
    },
    {
        "  on 42 September 42 His crowning achievement was the great victory near the ": null
    },
    {
        "Dvina": "daugava river"
    },
    {
        " River in the ": null
    },
    {
        "Battle of Kircholm": "battle of kircholm"
    },
    {
        "  on 42 September 42 when, with barely 42 troops, mostly the heavy cavalry of ": null
    },
    {
        "Polish hussars": "polish hussars"
    },
    {
        ", he annihilated a Swedish army three times the size of his force. For that feat he received letters of congratulation from ": null
    },
    {
        "Pope Paul V": "pope paul v"
    },
    {
        ", most of the Catholic royalty of Europe, and even the ": null
    },
    {
        "sultan of Turkey": "ahmed i"
    },
    {
        " and the ": null
    },
    {
        "shah of Persia": "abbas i of persia"
    },
    {
        ". Soon afterward, he was rewarded with the rank of Grand Lithuanian Hetman, in addition to a number of royal land grants and leases.     Yet this great victory was virtually fruitless, owing to the domestic dissensions; the ": null
    },
    {
        "Sejm": "sejm"
    },
    {
        " failed to agree on raising the funds needed for the war effort. Chodkiewicz was one of the magnates who remained loyal to king ": null
    },
    {
        "Sigismund III": "sigismund iii"
    },
    {
        ", and helped him to defeat the ": null
    },
    {
        "Sandomierz rebellion": "sandomierz rebellion"
    },
    {
        "  in 42–42 He commanded the right wing of the royal army during the ": null
    },
    {
        "Battle of Guzów": "battle of guzów"
    },
    {
        " on 42–42 July 42 in which the insurgents were defeated, and then quelled the unrest in the ": null
    },
    {
        "Grand Duchy of Lithuania": "grand duchy of lithuania"
    },
    {
        ", fighting against another rebellious magnate, ": null
    },
    {
        "Janusz Radziwiłł": "janusz radziwiłł"
    },
    {
        ", until Radziwiłł negotiated a settlement with the king in 42 A fresh invasion of Livonia by the Swedes recalled him thither once more, and in 42 he relieved ": null
    },
    {
        "Riga": "riga"
    },
    {
        " and recaptured ": null
    },
    {
        "Pernau": "pernau"
    },
    {
        ". He improvised a ": null
    },
    {
        "small fleet": "polish–lithuanian commonwealth navy"
    },
    {
        " and dealt a surprise blow to the ": null
    },
    {
        "Swedish Navy": "swedish navy"
    },
    {
        " at the ": null
    },
    {
        "Battle of Salis": "battle of salis"
    },
    {
        ".          Meanwhile, the ": null
    },
    {
        "Dimitriad wars": "polish–muscovite war"
    },
    {
        " with ": null
    },
    {
        "Muscovy": "muscovy"
    },
    {
        " broke out. Instigated by King Zygmunt, the war was unpopular among Lithuanian magnates, and Chodkiewicz was no exception; in fact his displeasure was so public and significant that he lost the royal favor for a time. Eventually their differences subsided, and Chodkiewicz was sent against the Muscovites, operating first near ": null
    },
    {
        "Smolensk": "smolensk"
    },
    {
        " and ": null
    },
    {
        "Pskov": "pskov"
    },
    {
        ". Soon, the Polish–Lithuanian forces started garnering victories, such as the ": null
    },
    {
        "capture of Smolensk": "siege of smolensk"
    },
    {
        ", and some, like Grand Crown Hetman Żółkiewski, planned for a grand ": null
    },
    {
        "Polish–Lithuanian–Muscovite Commonwealth": "polish–lithuanian–muscovite commonwealth"
    },
    {
        ". Chodkiewicz was tasked by the king with an advance on Moscow. However, the Sejm neglected to pay for the maintenance of the Army once more, with the result that some units mutinied. Chodkiewicz fought several inconclusive battles against the Muscovites in autumn 42 and then retreated. Disappointed with that outcome, he became once again estranged from the king, and criticized the campaign at the Sejm of 42 Over the next few years, in the period of 42–42 Chodkiewicz defended the Commonwealth gains in the Smolensk area, and dealt with unrest in Lithuania. Not till the crown prince, ": null
    },
    {
        "Władysław": "ladislaus iv of poland"
    },
    {
        " arrived with tardy reinforcements did the war could assume a more offensive character once again. The army, nominally commanded by Władysław, but in practice under the experienced command of Chodkiewicz, took the fortress of ": null
    },
    {
        "Dorogobuzh": "dorogobuzh"
    },
    {
        " on 42 October 42  The siege of ": null
    },
    {
        "Mozhaysk": "mozhaysk"
    },
    {
        " in December of subsequent year did not prove successful, and this marked the end of the conflict.          The Polish-Muscovite War had no sooner been ended by the ": null
    },
    {
        "treaty of Deulino": "treaty of deulino"
    },
    {
        " than Chodkiewicz was hastily dispatched southwards to defend the southern frontier against the ": null
    },
    {
        "Turks": "ottoman empire"
    },
    {
        ", who, in the opening phase of the ": null
    },
    {
        "Polish–Ottoman War": "polish–ottoman war"
    },
    {
        ", defeated Polish forces at ": null
    },
    {
        "Cecora": "battle of ţuţora"
    },
    {
        ", killing Hetman Żółkiewski. An army of 42 ": null
    },
    {
        "Turks": "turkish people"
    },
    {
        " and 42 ": null
    },
    {
        "Tatars": "tatars"
    },
    {
        " led by ": null
    },
    {
        "Sultan": "sultan"
    },
    {
        " Osman II": "osman ii"
    },
    {
        " in person advanced  on the Polish frontier. Opposed it were the Commonwealth forces, numbering about 42, half of them a ": null
    },
    {
        "Cossack": "cossack"
    },
    {
        " detachment under ": null
    },
    {
        "Cossack hetman": "hetmans of ukrainian cossacks"
    },
    {
        " Petro Konashevych-Sahaidachny": "petro konashevych-sahaidachny"
    },
    {
        ". Chodkiewicz crossed the ": null
    },
    {
        "Dnieper": "dnieper"
    },
    {
        " in September 42 and entrenched himself in the ": null
    },
    {
        "Khotyn Fortress": "khotyn fortress"
    },
    {
        ", directly in the path of the Ottoman advance. During the ": null
    },
    {
        "Battle of Chocim": "battle of khotyn"
    },
    {
        " Chodkiewcz resisted the sultans 42-thousand army for a whole month, . but the cost of victory was his life. A few days before the siege was raised and the Ottomans decided to open negotiations, the aged Grand Lithuanian Hetman, already suffering from illness since the very start of this campaign, died in the fortress on 42 September 42     Chodkiewczs body was transported to ": null
    },
    {
        "Kamianets-Podilskyi": "kamianets-podilskyi"
    },
    {
        ", where he was buried on 42 October 42 A few years later, in the summer of 42 his widow arranged for exhumation, and Chodkiewicz was reburied in ": null
    },
    {
        "Ostróg": "ostróg"
    },
    {
        " in June that year. In 42 he was moved to a new chapel in Ostróg, where he reburied again. His body was evacuated from Ostróg during the ": null
    },
    {
        "Chmielnicki Uprising": "chmielnicki uprising"
    },
    {
        " in 42 and returned there in 42 It was reburied yet again in a new tomb in Ostróg in 42          In 42 Polish historian ": null
    },
    {
        "Wanda Dobrowolska": "wanda dobrowolska"
    },
    {
        ", wrote in her  Polish Biographical Dictionary  entry on Chodkiewicz that he was one of the chief members of the Great Hetman era , renowned for his talent as a strategist and organizer. She notes that Chodkiewicz possessed an iron will, which he was able to impose on the troops under his command, and that he was an efficient commander, although more respected and feared than beloved by his troops. Dobrowolska notes that he was an energetic and explosive antithesis of the composed Żółkiewski, another great hetman of this era, whom Chodkiewicz disliked and competed with throughout his life.     Chodkiewicz was not particularly involved in the politics of the Commonwealth, although his high office and wealth gave him significant influence; for the most part he used his political influence, and base of support in Lithuania, to gather support for his military plans, increased the size of the army, and personal gratifications. His life was dominated by warfare, if not on the front lines, then on the political scene against other Lithuanian magnates, particularly the ": null
    },
    {
        "Radziwiłł family": "radziwiłł family"
    },
    {
        " and the Sejm politicians whom he held responsible for not passing enough taxes to support the army he wanted.     Over his career he acquired significant wealth, and funded a number of churches and other prestigious buildings. He often worked with the ": null
    },
    {
        "Jesuit": "jesuit"
    },
    {
        "s, including funding their ": null
    },
    {
        "College in Kražiai": "kražiai college"
    },
    {
        ". He strongly believed his service for the state should be rewarded with land grants, but at the same time he would often use his own money to pay for the armys military expenses. In his private life he is remembered as a very proud individual, and for stressing his identity as a member of the ": null
    },
    {
        "Lithuanian nobility": "lithuanian nobility"
    },
    {
        ". He was a family man, devoted to his family, but his only son, from his marriage in 42 to Zofia Mielecka, died aged 42 in 42 and she died in 42 He remarried in 42 wedding Anna Alojza Ostrogska in November 42 shortly before departing on his final campaign. Also that year his daughter Anna married a Lithuanian magnate, ": null
    },
    {
        "Jan Stanisław Sapieha": "jan stanisław sapieha"
    },
    {
        ".     Some poems and other works praising him were written during his lifetime, and a religious work was dedicated to him by the Jesuit ": null
    },
    {
        "Piotr Skarga": "piotr skarga"
    },
    {
        ". More works on Chodkiewicz were written in the years after his death. He was one of ": null
    },
    {
        "Wacław Potocki": "wacław potocki"
    },
    {
        "s characters in his epic novel on the Chocim war , and he also appeared in the works of ": null
    },
    {
        "Julian Ursyn Niemcewicz": "julian ursyn niemcewicz"
    },
    {
        " and ": null
    },
    {
        "Zofia Kossak-Szczucka": "zofia kossak-szczucka"
    }
]