[
    {
        "     Janus is an ": null
    },
    {
        "inner satellite": "inner satellite"
    },
    {
        " of ": null
    },
    {
        "Saturn": "saturn"
    },
    {
        ". It is also known as Saturn X. It is named after the mythological ": null
    },
    {
        "Janus": "janus"
    },
    {
        ".           Janus was identified by ": null
    },
    {
        "Audouin Dollfus": "audouin dollfus"
    },
    {
        " on 42 December 42 and given the temporary designation . Previously, Jean Texereau had photographed Janus on 42 October 42 without realising it. On December 42 Richard Walker observed an object in the same orbit as Janus, but whose position could not be reconciled with the previous observations. Twelve years later, in October 42 Stephen M. Larson and John W. Fountain realised that the 42 observations were best explained by two distinct objects sharing very similar orbits, Walker is now credited with the discovery of ": null
    },
    {
        "Epimetheus": "epimetheus"
    },
    {
        ".  Voyager 42  confirmed this orbital configuration in 42        Janus was observed on subsequent occasions and given different ": null
    },
    {
        "provisional designations": "provisional designation in astronomy"
    },
    {
        ".  Pioneer 42  three energetic-particle detectors detected its shadow when the probe flew by Saturn on 42 September 42  Janus was observed by Dan Pascu on 42 February 42  and then by John W. Fountain, Stephen M. Larson, ": null
    },
    {
        "Harold J. Reitsema": "harold j. reitsema"
    },
    {
        " and Bradford A. Smith on 42 February 42        Janus is named after the two-faced ": null
    },
    {
        "Roman": "roman mythology"
    },
    {
        " god ": null
    },
    {
        "Janus": "janus"
    },
    {
        ". Although the name was informally proposed soon after the initial 42 discovery, it was not officially adopted until 42 when ": null
    },
    {
        "Epimetheus": "epimetheus"
    },
    {
        " was also named.     The  Oxford English Dictionary  lists the ": null
    },
    {
        "adjectival form": "adjective"
    },
    {
        " of the moons name as Janian.                Januss orbit is co-orbital with that of ": null
    },
    {
        "Epimetheus": "epimetheus"
    },
    {
        ". Januss ": null
    },
    {
        "mean orbital radius": "semimajor axis"
    },
    {
        " from Saturn is, as of 42 , only 42  km less than that of Epimetheus, a distance smaller than either moons mean radius. In accordance with ": null
    },
    {
        "Keplers laws of planetary motion": "keplers laws of planetary motion"
    },
    {
        ", the closer ": null
    },
    {
        "orbit": "orbit"
    },
    {
        " is completed more quickly. Because of the small difference it is completed in only about 42 seconds less. Each day, the inner moon is an additional 42° farther around Saturn than the outer moon. As the inner moon catches up to the outer moon, their mutual gravitational attraction increases the inner moons momentum and decreases that of the outer moon. This added momentum means that the inner moons distance from Saturn and ": null
    },
    {
        "orbital period": "orbital period"
    },
    {
        " are increased, and the outer moons are decreased. The timing and magnitude of the ": null
    },
    {
        "momentum exchange": "gravity assist"
    },
    {
        " is such that the moons effectively swap orbits, never approaching closer than about 42  km. At each encounter Januss orbital radius changes by ~42  km and Epimetheuss by ~42  km: Januss orbit is less affected because it is four times as massive as Epimetheus. The exchange takes place close to every four years; the last close approaches occurred in January 42 42 42 and 42 and the next in 42 This is the only such orbital configuration known in the ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        ".     The orbital relationship between Janus and Epimetheus can be understood in terms of the ": null
    },
    {
        "circular restricted three-body problem": "three-body problemcircular restricted three-body problem"
    },
    {
        ", as a case in which the two moons are similar in size to each other.         Janus is extensively cratered with several ": null
    },
    {
        "craters": "impact crater"
    },
    {
        " larger than 42  km, but has few linear features. Januss surface appears to be older than ": null
    },
    {
        "Prometheus": "prometheus"
    },
    {
        "s but younger than ": null
    },
    {
        "Pandora": "pandora"
    },
    {
        "s.     Janus has a very low ": null
    },
    {
        "density": "density"
    },
    {
        " and relatively high ": null
    },
    {
        "albedo": "albedo"
    },
    {
        ", meaning that it is likely very icy and ": null
    },
    {
        "porous": "porosity"
    },
    {
        " .         A faint dust ring is present around the region occupied by the orbits of Janus and Epimetheus, as revealed by images taken in forward-scattered light by the ": null
    },
    {
        "Cassini spacecraft": "cassini–huygens"
    },
    {
        " in 42 The ring has a radial extent of about 42  km. Its source is particles blasted off their surfaces by meteoroid impacts, which then form a diffuse ring around their orbital paths.     Along with Epimetheus, Janus acts as a ": null
    },
    {
        "shepherd moon": "shepherd moon"
    },
    {
        ", maintaining the sharp outer edge of the ": null
    },
    {
        "A Ring": "a ring"
    },
    {
        " in a 42:42 ": null
    },
    {
        "orbital resonance": "orbital resonance"
    },
    {
        ". The effect is more obvious when the more massive Janus is on the resonant orbit.  Voyager 42  ": null
    },
    {
        "Prometheus": "prometheus"
    },
    {
        " lie above and below ": null
    },
    {
        "Saturns rings": "rings of saturn"
    },
    {
        " Tethys": "tethys"
    },
    {
        " near ": null
    },
    {
        "Saturns rings": "rings of saturn"
    },
    {
        "  Cassini   Cassini ": null
    }
]