[
    {
        "A  may take the form of:     a short ": null
    },
    {
        "saying": "saying"
    },
    {
        " ,   an ": null
    },
    {
        "idiom": "idiom"
    },
    {
        "atic phrase , or   a four-character idiom .     Although proverb and saying are practically synonymous, the same cannot be said about idiomatic phrase and four-character idiom . Not all kanyōku and yojijukugo are proverbial. For instance, the kanyōku 狐の嫁入り  kitsune no yomeiri   and the yojijukugo 小春日和 koharubiyori  are not proverbs. To be considered a proverb, a word or phrase must express a common ": null
    },
    {
        "truth": "truth"
    },
    {
        " or ": null
    },
    {
        "wisdom": "wisdom"
    },
    {
        "; it cannot be a mere noun.       Japanese commonly use proverbs, often citing just the first part of common phrases for brevity. For example, one might say  to refer to the proverb . Whereas proverbs in English are typically multi-worded phrases , Japanese  borrows from Chinese and compactly conveys the concept in one word .     The heavy employment of proverbs enables Japanese language to be concise. Evidence might be found in ": null
    },
    {
        "Japanese animation": "japanese animation"
    },
    {
        " and ": null
    },
    {
        "manga": "manga"
    },
    {
        ", but also appears in news and cultural programs, and in much fiction.        Because traditional Japanese culture was tied to agriculture, many Japanese proverbs are derived from agricultural customs and practices. Some are from the ": null
    },
    {
        "Go game": "go"
    },
    {
        " , the ": null
    },
    {
        "tea ceremony": "japanese tea ceremony"
    },
    {
        " , and ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        ". Many four-character idioms are from ": null
    },
    {
        "Chinese philosophy": "chinese philosophy"
    },
    {
        " written in ": null
    },
    {
        "Classical Chinese": "classical chinese"
    },
    {
        ", in particular The ": null
    },
    {
        "Analects": "analects"
    },
    {
        " by Confucius.      Lists of Japanese proverbs can be found at ": null
    },
    {
        "Wiktionary:Category:Japanese proverbs": "wiktionary:category:japanese proverbs"
    },
    {
        " and ": null
    },
    {
        "Wikiquote:Japanese proverbs": "wikiquote:japanese proverbs"
    },
    {
        ".          案ずるより産むが易し。   Anzuru yori umu ga yasushi. Deru kui wa utareru. Shiranu ga hotoke. Minu ga hana. Hana wa sakuragi, hito wa bushi. ": null
    },
    {
        "Of flowers, the cherry blossom; of men, the warrior": "hana wa sakuragi, hito wa bushi"
    },
    {
        ".   Meaning: As the cherry blossom is considered foremost among flowers, so the warrior is foremost among men.       ": null
    },
    {
        "猫に小判": "wikt:猫に小判"
    },
    {
        " Neko ni koban ": null
    },
    {
        "pearls before swine": "wikt:cast pearls before swine"
    },
    {
        " / Giving something of value to a recipient that does not value it.   七転び八起き   Nanakorobi yaoki Saru mo ki kara ochiru ": null
    },
    {
        "monkey": "monkey"
    },
    {
        "s fall from ": null
    },
    {
        "tree": "tree"
    },
    {
        "s   Meaning: Anyone can make a mistake.   花より団子   Hana yori dango ": null
    },
    {
        "Dumplings": "dango"
    },
    {
        " rather than flowers   Meaning: To prefer substance over form, as in to prefer to be given functional, useful items instead of merely decorative items .        jūnin toiro inga ōhō ": null
    },
    {
        "karmic retribution": "karmic retribution"
    },
    {
        ".   弱肉強食   jaku niku kyō shoku ": null
    },
    {
        "Survival of the fittest": "survival of the fittest"
    }
]