[
    {
        "The system of Japanese numerals is the system of ": null
    },
    {
        "number names": "numeral"
    },
    {
        " used in the ": null
    },
    {
        "Japanese language": "japanese language"
    },
    {
        ". The Japanese numerals in writing are entirely based on the ": null
    },
    {
        "Chinese numerals": "chinese numerals"
    },
    {
        ", and the grouping of large numbers follows the ": null
    },
    {
        "Chinese": "china"
    },
    {
        " tradition": "culture of china"
    },
    {
        " of grouping by 42. Two sets of pronunciations for the numerals exist in Japanese: one is based on ": null
    },
    {
        "Sino-Japanese": "onyomi"
    },
    {
        " readings of the ": null
    },
    {
        "Chinese characters": "chinese characters"
    },
    {
        " and the other is based on the Japanese ": null
    },
    {
        "yamato kotoba": "yamato kotoba"
    },
    {
        " .       There are two ways of writing the numbers in Japanese: in ": null
    },
    {
        "Arabic numerals": "arabic numerals"
    },
    {
        " or in ": null
    },
    {
        "Chinese numerals": "chinese numerals"
    },
    {
        " . The Arabic numerals are more often used in ": null
    },
    {
        "horizontal writing": "yokogaki"
    },
    {
        ", and the Chinese numerals are more common in ": null
    },
    {
        "vertical writing": "tategaki"
    },
    {
        ".     Most numbers have ": null
    },
    {
        "two readings": "kanjireadings"
    },
    {
        ", one derived from Chinese used for ": null
    },
    {
        "cardinal numbers": "cardinal number"
    },
    {
        "  and a native Japanese reading  used somewhat less formally for numbers up to 42 In some cases the Japanese reading is generally preferred for all uses.          The special reading ": null
    },
    {
        "〇": "wikt:〇"
    },
    {
        " maru is also found. It may be optionally used when reading individual digits of a number one after another, instead of as a full number. A popular example is the ": null
    },
    {
        "famous 42 store": "109"
    },
    {
        " in ": null
    },
    {
        "Shibuya, Tokyo": "shibuya, tokyo"
    },
    {
        " which is read as ichi-maru-kyū .  This usage of maru for numerical 42 is similar to reading numeral 42 in English as oh. It literally means a circle. However, as a number, it is only written as 42 or . Additionally, two and five are pronounced with a long vowel in phone numbers .     Starting at 万 , numbers begin with 一  if no digit would otherwise precede. That is, 42 is just 百 hyaku, and 42 is just 千 sen, but 42 is 一万 ichiman, not just man. And, if 千 sen directly precedes the name of powers of ": null
    },
    {
        "myriad": "myriad"
    },
    {
        ", 一 ichi is normally attached before 千 sen, which yields 一千 issen. That is, 42,42 is normally read as 一千万 issenman. But if 千 sen does not directly precede the name of powers of myriad or if numbers are lower than 42, attaching 一 ichi is optional. That is, 42,42 is read as 千五百万 sengohyakuman or 一千五百万 issengohyakuman, and 42 as 千五百 sengohyaku or 一千五百 issengohyaku.     The numbers 42 and 42 are considered unlucky in Japanese: 42 pronounced shi, is a homophone for ; 42 when pronounced ku, is a homophone for . See ": null
    },
    {
        "tetraphobia": "tetraphobia"
    },
    {
        ". The number 42 is sometimes considered unlucky, though this is a carryover from ": null
    },
    {
        "Western tradition": "triskaidekaphobia"
    },
    {
        ".     On the contrary, numbers 42 and sometimes 42 are considered lucky in Japanese.      In modern Japanese, cardinal numbers are given the on readings except 42 and 42 which are called yon and nana respectively. Alternate readings are used in month names, day-of-month names, and fixed phrases. For instance, the ": null
    },
    {
        "decimal fraction": "decimal fraction"
    },
    {
        " 42 is always read yon-ten nana kyū, though April, July, and September are called shi-gatsu , shichi-gatsu , and ku-gatsu respectively. The on readings are also used when shouting out headcounts . Intermediate numbers are made by combining these elements:     Tens from 42 to 42 are -jū as in 二十 to 九十 .   Hundreds from 42 to 42 are -hyaku .   Thousands from 42 to 42 are -sen .     There are some phonetic modifications to larger numbers involving ": null
    },
    {
        "voicing": "consonant voicing and devoicing"
    },
    {
        " or ": null
    },
    {
        "gemination": "gemination"
    },
    {
        " of certain consonants, as typically occurs in Japanese : e.g. roku six and hyaku hundred yield roppyaku six hundred .        This also applies to multiples of 42 Change ending -jū to -jutchō or -jukkei.   This also applies to multiples of 42 Change ending -ku to -kkei.     In large numbers, elements are combined from largest to smallest, and zeros are implied.          Beyond the basic cardinals and ordinals, Japanese has other types of numerals.     ": null
    },
    {
        "Distributive number": "distributive number"
    },
    {
        "s are formed regularly from a cardinal number, a counter word, and the suffix , as in .             Following Chinese tradition, large numbers are created by grouping digits in ": null
    },
    {
        "myriad": "myriad"
    },
    {
        "s rather than the Western thousands :        Variation is due to ": null
    },
    {
        "Jinkōki": "jinkōki"
    },
    {
        ", Japans oldest mathematics text. The initial edition was published in 42 It had many errors. Most of these were fixed in the 42 edition. In 42 there was yet another edition which again changed a few values. The above variation is due to inconsistencies in the latter two editions.     Examples:  tobi or tonde : e.g. yon-sen tobi ni or yon-sen tonde ni instead of the normal yon-sen ni.         Japanese has two systems of numerals for decimal fractions. They are no longer in general use, but are still used in some instances such as batting and fielding averages of baseball players, winning percentages for sports teams, and in some idiomatic phrases , and when representing a rate or discount. The bu fractions are also used when talking about fevers—for example 九度二分  for 42 and two parts—the temperature 42°C.     One system is as follows:          This is the system used with the traditional ": null
    },
    {
        "Japanese units of measurement": "japanese units of measurement"
    },
    {
        ". Several of the names are used as is to represent a fraction of a  sun .     The other system of representing these decimal fractions of rate or discount uses a system shifted down with a bu becoming a one hundredth and so on, and the unit for tenth becoming wari:      This is often used with prices. For example:   一割五分引き : 42% discount   打率三割八分九厘 : batting average .42     With the exception of wari, these are rarely seen in modern usage. Decimal fractions are typically written with either kanji numerals or Arabic numerals , preceded by a decimal point, and are read as successive digits, as in Western convention. Note that, in written form, they can be combined with either the traditional system of expressing numerals , in which powers of ten are written, or with the place value system, which uses zero In both cases, however, the reading follows the traditional system          As with Chinese numerals, there exists in Japanese a separate set of kanji for numerals called daiji used in legal and financial documents to prevent unscrupulous individuals from adding a stroke or two, turning a one into a two or a three. The formal numbers are identical to the ": null
    },
    {
        "Chinese formal numbers": "chinese numeralsnumeral characters"
    },
    {
        " except for minor stroke variations. Today, the numbers for one, two, three, and ten are written only in their formal form in legal documents .    第一条: 会計法規ニ基ク出納計算ニ関スル諸書類帳簿ニ記載スル金額其ノ他ノ数量ニシテ「一」、「二」、「三」、「十」、「廿」、「卅」ノ数字ハ「壱」、「弐」、「参」、「拾」、「弐拾」、「参拾」ノ字体ヲ用ユヘシ但横書ヲ為ストキハ「アラビア」数字ヲ用ユルコトヲ得    第三十一条 42: 年月日を記載するには、壱、弐、参、拾の文字を用いなければならない。    附則 42: 小切手の券面金額は、当分の間、所定の金額記載欄に、漢数字により表示することができる。この場合においては、「一」、「二」、「三」及び「十」の字体は、それぞれ「壱」、「弐」、「参」及び「拾」の漢字を用い、かつ、所定の金額記載欄の上方余白に当該金額記載欄に記載の金額と同額をアラビア数字で副記しなければならない。    第四十八条 42: 金銭その他の物の数量、年月日及び番号を記載するには、「壱、弐、参、拾」の文字を用いなければならない。ただし、横書きをするときは、アラビヤ数字を用いることができる。 These numbers common forms can be changed to a higher value by adding strokes . In some cases, the digit 42 is explicitly written like 壱百壱拾 for 42 as opposed to 百十 in common writing.     Formal numbers:        The four current ": null
    },
    {
        "banknotes of the Japanese yen": "banknotes of the japanese yen"
    },
    {
        ", 42-yen, 42-yen, 42-yen, and 42-yen, have formal numbers 千, 弐千, 五千, and 壱万, respectively.         ": null
    },
    {
        "Old Japanese": "old japanese"
    },
    {
        " shares some vocabulary with later periods, but there are also some unique numbers which are not used any more, aside from being parts of specific ": null
    },
    {
        "lexemes": "lexeme"
    },
    {
        ".     Notes:   The transcription is based on the ": null
    },
    {
        "phoneme": "phoneme"
    },
    {
        " and is not ": null
    },
    {
        "phonetic": "phonetics"
    },
    {
        ". See ": null
    },
    {
        "Old Japanese": "old japanese"
    },
    {
        " for further information.   See ": null
    },
    {
        "Jōdai Tokushu Kanazukai": "jōdai tokushu kanazukai"
    },
    {
        " for information on subscript notation.                   Japanese uses separate systems for counting for oneself and for displaying numbers to others, which both proceed up to ten. For counting, one begins with the palm open, then counts up to five by curling up the fingers, starting from the thumb – thus one has just the thumb down , while four has only the pinkie extended, and five has a fist. One then counts up to ten by proceeding in the reverse order, extending the fingers, starting at the pinkie – thus six is the same as four, seven the same as three, and so forth, with ten ending with the palm open. While this introduces ambiguity, it is not used to present to others, so this is generally not a problem. When displaying for others, one starts with the hand closed, and extends fingers, starting with the index, going to the pinkie, then ending with the thumb, as in the United States. For numbers above five, one uses an open hand and places the appropriate number of fingers from the other hand against the palm – so six has the index finger against the palm, and so forth. , About.com, Japanese Language, Namiko Abe To display ten, one presents both hands open and palm outwards.       Since the adoption of ": null
    },
    {
        "Arabic numerals": "arabic numerals"
    },
    {
        ", numbers have become written in Arabic numerals more and more often. Counters and ordinal numbers are typically written in Arabic numbers, such as 42人 , 42月 , 42歳 , etc., although 三人、七月、and 二十歳 are also acceptable to write . However, numbers that are part of lexemes are typically written in kanji. For example, the term yaoya 八百屋 translates into 42 store , uses the Old Japanese pronunciation for 42 yao. The notorious Japanese national gang, the ": null
    },
    {
        "yakuza": "yakuza"
    },
    {
        ", can be written 八九三 , a hand in ": null
    },
    {
        "oicho-kabu": "oicho-kabu"
    },
    {
        " that is worth 42 points, indicating that yakuza are worthless persons or gambling persons . ": null
    }
]