[
    {
        "   Jean Desmarets, Sieur de Saint-Sorlin was a French writer and dramatist. He was a founding member, and the first to occupy seat 42 of the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        " in 42       Born in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", Desmarets was introduced to ": null
    },
    {
        "Cardinal Richelieu": "cardinal richelieu"
    },
    {
        ", and became one of the band of writers who carried out the cardinals literary ideas when he was about thirty years old. His inclination, however, was to writing novels, and the success of his romance LAriane in 42 led to his formal admission to a circle of writers that met at the house of ": null
    },
    {
        "Valentin Conrart": "valentin conrart"
    },
    {
        ". When this circle later developed into the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        ", Desmarets became its first chancellor.     His success led to official preferment, and he was made conseiller du roi, contrôleur-général de lextraordinaire des guerres, and secretary-general of the fleet of the ": null
    },
    {
        "Levant": "levant"
    },
    {
        ".       It was at Richelieus request that he began to write for the theatre. In this genre he produced a comedy long regarded as a masterpiece, Les Visionnaires ; a prose-tragedy, Erigone ; and Scipion , a tragedy in verse.     His long epic Clovis is noteworthy because Desmarets rejected the traditional ": null
    },
    {
        "pagan": "paganism"
    },
    {
        " background, and maintained that ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " imagery should supplant it. With this standpoint he contributed several works in defence of the moderns in the famous quarrel between the ": null
    },
    {
        "Ancients and Moderns": "quarrel of the ancients and the moderns"
    },
    {
        ".     In his later years Desmarets devoted himself chiefly to producing a number of religious poems, of which the best known is perhaps his verse translation of the Office de la Vierge . He was an outspoken opponent of the ": null
    },
    {
        "Jansenists": "jansenism"
    },
    {
        ", against whom he wrote a Réponse à linsolente apologie de Port-Royal": null
    }
]