[
    {
        "Marie Jean Pierre Flourens , father of ": null
    },
    {
        "Gustave Flourens": "gustave flourens"
    },
    {
        ", was a French ": null
    },
    {
        "physiologist": "physiologist"
    },
    {
        ", the founder of experimental ": null
    },
    {
        "brain": "brain"
    },
    {
        " science and a pioneer in ": null
    },
    {
        "anesthesia": "anesthesia"
    },
    {
        ". Through the study of ": null
    },
    {
        "ablation": "ablative brain surgery"
    },
    {
        "s on animals, he was the first to prove that the ": null
    },
    {
        "mind": "mind"
    },
    {
        " was located in the brain, not the ": null
    },
    {
        "heart": "heart"
    },
    {
        ".       He was born at ": null
    },
    {
        "Maureilhan": "maureilhan"
    },
    {
        ", near ": null
    },
    {
        "Béziers": "béziers"
    },
    {
        ", in the  département  of ": null
    },
    {
        "Hérault": "hérault"
    },
    {
        ". At fifteen he began studying ": null
    },
    {
        "medicine": "medicine"
    },
    {
        " at ": null
    },
    {
        "Montpellier": "montpellier"
    },
    {
        ", where in 42 he received the degree of ": null
    },
    {
        "doctor": "doctor of medicine"
    },
    {
        ". In the following year he went to ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        ", carrying an introduction from ": null
    },
    {
        "A. P. de Candolle": "a. p. de candolle"
    },
    {
        ", the botanist, to ": null
    },
    {
        "Georges Cuvier": "georges cuvier"
    },
    {
        ", who received him kindly, and took an interest in him. At Paris Flourens engaged in ": null
    },
    {
        "physiological research": "physiology"
    },
    {
        ", occasionally contributing to publications; and in 42 at the ": null
    },
    {
        "Athénée": "athénée"
    },
    {
        ", he gave a course of lectures on the physiological theory of the ": null
    },
    {
        "sensations": "wikt:sensation"
    },
    {
        ", which attracted much attention amongst men of science.     In 42 Flourens pioneered the experimental method of carrying out localized lesions of the brain in living ": null
    },
    {
        "rabbits": "rabbits"
    },
    {
        " and ": null
    },
    {
        "pigeons": "pigeons"
    },
    {
        " and carefully observing their effects on motricity, sensibility and ": null
    },
    {
        "behavior": "behavior"
    },
    {
        ". His intention was to investigate localisationism, i.e., whether different parts of the brain had different functions, as the Austrian physician ": null
    },
    {
        "Franz Joseph Gall": "franz joseph gall"
    },
    {
        ", the founder of ": null
    },
    {
        "phrenology": "phrenology"
    },
    {
        ", was proposing. The trouble was that Gall did not use a proper scientific approach to his affirmations.     Flourens was able to demonstrate convincingly for the first time that the main divisions of the brain were indeed responsible for largely different functions. By removing the ": null
    },
    {
        "cerebral hemisphere": "cerebral hemisphere"
    },
    {
        "s, for instance, all perceptions, motricity, and ": null
    },
    {
        "judgment": "judgment"
    },
    {
        " were abolished. The removal of the ": null
    },
    {
        "cerebellum": "cerebellum"
    },
    {
        " affected the animals ": null
    },
    {
        "equilibrium": "sense of balance"
    },
    {
        " and ": null
    },
    {
        "motor coordination": "motor coordination"
    },
    {
        ", while the destruction of the ": null
    },
    {
        "brainstem": "brainstem"
    },
    {
        " caused death. These experiments led Flourens to the conclusion that the cerebral hemispheres are responsible for higher cognitive functions, that the cerebellum regulates and integrates movements, and that the medulla controls vital functions, such as ": null
    },
    {
        "circulation": "circulatory system"
    },
    {
        ", ": null
    },
    {
        "respiration": "respiration"
    },
    {
        " and general bodily stability. On the other hand, he was unable to find specific regions for ": null
    },
    {
        "memory": "memory"
    },
    {
        " and ": null
    },
    {
        "cognition": "cognition"
    },
    {
        ", which led him to believe that they are represented in a diffuse form around the brain. So, different functions could indeed be ascribed to particular regions of the brain, but a finer localization was lacking.     Jean Pierre Flourens, by destroying the horizontal semicircular canal of ": null
    },
    {
        "pigeon": "pigeon"
    },
    {
        "s, noted that they continue to fly in a circle, showing the purpose of the semicircular canals     Flourens was chosen by Cuvier in 42 to deliver a course of lectures on natural history at the ": null
    },
    {
        "Collège de France": "collège de france"
    },
    {
        ", and in the same year became, in succession to ": null
    },
    {
        "LAG Bosc": "louis augustin guillaume bosc"
    },
    {
        ", a member of the Institute, in the division Economic rurale. In 42 he became Cuviers substitute as lecturer on human ": null
    },
    {
        "anatomy": "anatomy"
    },
    {
        " at the ": null
    },
    {
        "Jardin du Roi": "jardin des plantes"
    },
    {
        ", and in 42 was elected to the post of titular professor, which he vacated for the professorship of ": null
    },
    {
        "comparative anatomy": "comparative anatomy"
    },
    {
        " created for him at the museum of the Jardin the same year. In 42 Flourens, in accordance with the dying request of Cuvier, was appointed a perpetual secretary of the Academy of Sciences; and in 42 he was returned as a deputy for the arrondissement of Béziers. In 42 he was elected, in preference to ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        ", to succeed ": null
    },
    {
        "Jean François Michaud": "joseph françois michaud"
    },
    {
        " at the ": null
    },
    {
        "French Academy": "french academy"
    },
    {
        "; and in 42 he was created a commander of the  légion dhonneur , and in the next year a peer of France. In 42 he was elected a foreign member of the ": null
    },
    {
        "Royal Swedish Academy of Sciences": "royal swedish academy of sciences"
    },
    {
        ".     In March 42 Flourens drew the attention of the Academy of Sciences to the ": null
    },
    {
        "anesthetic": "anesthesia"
    },
    {
        " effect of ": null
    },
    {
        "chloroform": "chloroform"
    },
    {
        " on animals.     On the revolution of 42 he withdrew completely from political life; and in 42 he accepted the professorship of natural history at the ": null
    },
    {
        "Collège de France": "collège de france"
    },
    {
        ". He died at Montgeron, near Paris on 42 December 42         Flourens was an opponent of ": null
    },
    {
        "Darwinism": "darwinism"
    },
    {
        " and criticized the idea of ": null
    },
    {
        "natural selection": "natural selection"
    },
    {
        ". In 42 he authored Examen du livre du M. Darwin sur lOrigine des Espèces. He refuted the arguments of ": null
    },
    {
        "spontaneous generation": "spontaneous generation"
    },
    {
        ". Henry, Freeman G. . Anti-Darwinism in France: Science and the Myth of Nation.  Nineteenth-Century French Studies  42 42/42: 4242     He was a ": null
    },
    {
        "creationist": "creationism"
    },
    {
        " and defended the fixity of species. Clark, Linda L. . Social Darwinism in France. University of Alabama. p. 42  Simonton, Dean Keith. . Creativity in Science: Chance, Logic, Genius, and Zeitgeist. Cambridge University Press. p. 42  Flourens criticized ": null
    },
    {
        "Charles Darwin": "charles darwin"
    },
    {
        " for personifying nature. He argued that natural selection is a contradictory term as nature does not select. Huxley, Thomas Henry. . . London: Macmillan & Co. pp. 4242 Flourens book was never translated into English and no reviewers attempted to refute his arguments in detail. However, ": null
    },
    {
        "Thomas Henry Huxley": "thomas henry huxley"
    },
    {
        " took issue with his criticism of Darwinism, noting that his objections to details are of the old sort, so battered and hackneyed on this side of the Channel, that not even a Quarterly Reviewer could be induced to pick them up for the purpose of pelting Mr. Darwin over again.       Besides numerous shorter scientific memoirs, Flourens published:     Essai sur quelques points de la doctrine de la revulsion et de la derivation   Experiences sur le système nerveux   Cours sur la génération, lovologie, et leinhryologie   Analyse raisonnée des travaux de G. Cuvier   Recherches sur le développement des os et des dents   Anatomie générale de la peau et des membranes muqueuses    Buffon , histoire de ses travaux et de ses idées   Fontenelle, ou de la philosophie moderne relativement aux sciences physiques   Théorie expérémentale de la formation des os   Œuvres complètes de Buffon   De la longévité humaine et de la quantité de vie sur le globe , numerous editions   Histoire de la découverte de la circulation du sang   Cours de physiologie comparée   Recuesi des lloges historiques   De la vie et de lintelligence   De la raison, du genie, et de la folie   Ontologie naturelle   ": null
    }
]