[
    {
        "Jean-Philibert Damiron  was a ": null
    },
    {
        "French": "france"
    },
    {
        " philosopher": "philosopher"
    },
    {
        ".       Damiron was born at ": null
    },
    {
        "Belleville": "belleville, paris"
    },
    {
        ". At nineteen he entered the normal school, where he studied under ": null
    },
    {
        "Eugène Burnouf": "eugène burnouf"
    },
    {
        ", ": null
    },
    {
        "Abel-Francois Villemain": "abel-francois villemain"
    },
    {
        ", and ": null
    },
    {
        "Victor Cousin": "victor cousin"
    },
    {
        ". After teaching for several years in provincial towns, he came to ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        ", where he lectured on philosophy in various institutions, and finally became professor in the normal school, and titular professor at the ": null
    },
    {
        "Sorbonne": "university of paris"
    },
    {
        ". In 42 he joined ": null
    },
    {
        "Paul-François Dubois": "paul-françois dubois"
    },
    {
        " and ": null
    },
    {
        "Théodore Simon Jouffroy": "théodore simon jouffroy"
    },
    {
        " in establishing  Le Globe ; and he was also a member of the committee of the society which took for its motto  Aide-toi, le ciel taidera . In 42 he was appointed chevalier of the Legion of Honour, and in 42 member of the ": null
    },
    {
        "Academy of Moral Sciences": "académie des sciences morales et politiques"
    },
    {
        ". Damiron died in Paris.       Damiron works are known for his accounts of French philosophers:   Nouveaux mélanges philosophiques de Jouffroy , one edition contained a notice of the author, in which Damiron softened and omitted several expressions used by Jouffroy, which were opposed to the system of education adopted by the Sorbonne.   De la mutilation des manuscrits de M. Jouffroy , an article which gave rise to a bitter controversy, and to a book by ": null
    },
    {
        "Pierre Leroux": "pierre leroux"
    },
    {
        ", .   Essai sur lhistoire de la philosophie en France au XIX e siècle   Essai sur lhistoire de la philosophie en France au XVII e siècle   Mémoires a servir pour lhistoire de la philosophie en France au XVIII e siècle   Cours de la philosophie De la Providence": null
    }
]