[
    {
        "        Jean-Baptiste Massillon, Cong. Orat.  , was a French ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        " bishop and famous preacher, who served as ": null
    },
    {
        "Bishop of Clermont": "bishop of clermont"
    },
    {
        " from 42 until his death.           Massillon was born at ": null
    },
    {
        "Hyères": "hyères"
    },
    {
        " in ": null
    },
    {
        "Provence": "provence"
    },
    {
        " where his father was a royal notary. At the age of eighteen he joined the ": null
    },
    {
        "French Oratory": "french oratory"
    },
    {
        " and taught for a time in the colleges of his congregation at ": null
    },
    {
        "Pézenas": "pézenas"
    },
    {
        ", and ": null
    },
    {
        "Montbrison": "montbrison, loire"
    },
    {
        " and at the Seminary of Vienne. On the death of ": null
    },
    {
        "Henri de Villars": "henri de villars"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Vienne": "archbishop of vienne"
    },
    {
        ", in 42 he was commissioned to deliver a funeral oration, and this was the beginning of his fame. In obedience to ": null
    },
    {
        "Cardinal de Noailles": "louis-antoine, cardinal de noailles"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Paris": "archbishop of paris"
    },
    {
        ", he left the ": null
    },
    {
        "Trappist": "trappist"
    },
    {
        " Abbey of Sept-Fons": "abbey of sept-fons"
    },
    {
        ", to which he had retired, and settled in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", where he was placed at the head of the famous Oratorian Seminary of ": null
    },
    {
        "Saint Magloire": "saint magloire"
    },
    {
        ".       Massillon soon gained a wide reputation as a preacher and was selected to be the ": null
    },
    {
        "Advent": "advent"
    },
    {
        " preacher at the court of ": null
    },
    {
        "Versailles": "palace of versailles"
    },
    {
        " in 42 He was made Bishop of Clermont in 42 and two years later was elected a member of the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        ". The last years of his life were spent in the faithful discharge of his episcopal duties; his death took place at Clermont on September 42 42 Massillon enjoyed in the 42th century a reputation equal to that of ": null
    },
    {
        "Jacques-Bénigne Bossuet": "jacques-bénigne bossuet"
    },
    {
        " and of ": null
    },
    {
        "Louis Bourdaloue": "louis bourdaloue"
    },
    {
        ", and was much praised for his eloquence by ": null
    },
    {
        "Voltaire": "voltaire"
    },
    {
        ", ": null
    },
    {
        "DAlembert": "jean le rond dalembert"
    },
    {
        " and kindred spirits among the ": null
    },
    {
        "Encyclopaedists": "encyclopaedists"
    },
    {
        ".     Massillons popularity was probably because in his sermons he lays little stress on dogmatic questions, but treats generally of moral subjects, in which the secrets of the human heart and the processes of mans reason are described with poetical feeling. He has usually been contrasted with his predecessor Bourdaloue, the latter having the credit of vigorous denunciation, Massillon that of gentle persuasiveness. Besides the Petit Carême, a sermon which he delivered before the young King ": null
    },
    {
        "Louis XV of France": "louis xv of france"
    },
    {
        " in 42 his sermons on the ": null
    },
    {
        "Prodigal Son": "prodigal son"
    },
    {
        ", on the small number of the elect, on death, for ": null
    },
    {
        "Christmas Day": "christmas day"
    },
    {
        ", and for the ": null
    },
    {
        "Fourth Sunday in Advent": "fourth sunday in advent"
    },
    {
        ", may be perhaps cited as his masterpieces. His funeral oration on King ": null
    },
    {
        "Louis XIV of France": "louis xiv of france"
    },
    {
        " is only noted now for the opening sentence: Dieu seul est grand. But, in truth, Massillon is singularly free from inequality. His great literary power, his reputation for benevolence, and his known toleration and dislike of doctrinal disputes caused him to be much more favourably regarded than most churchmen by the philosophers of the 42th century.     The first edition of Massillons complete works was published by his nephew, also an Oratorian , and upon this, in the absence of manuscripts, succeeding reprints were based. The best modern edition is that of the ": null
    },
    {
        "Abbé Blampignon": "abbé blampignon"
    }
]