[
    {
        "        Jennifer Jones , also known as Jennifer Jones Simon, was an American actress and ": null
    },
    {
        "mental health": "mental health"
    },
    {
        " advocate. Over the course of her career that spanned over five decades, she was nominated for the ": null
    },
    {
        "Oscar": "academy awards"
    },
    {
        " five times, including one win for ": null
    },
    {
        "Best Actress": "academy award for best actress"
    },
    {
        ", as well as a ": null
    },
    {
        "Golden Globe Award": "golden globe award"
    },
    {
        " win for ": null
    },
    {
        "Best Actress in a Drama": "golden globe award for best actress in a motion picture – drama"
    },
    {
        ". Jones is among the ": null
    },
    {
        "youngest actresses to receive an Academy Award": "list of oldest and youngest academy award winners and nominees"
    },
    {
        ", having won on her 42th birthday.     A native of ": null
    },
    {
        "Tulsa, Oklahoma": "tulsa, oklahoma"
    },
    {
        ", Jones worked as a model in her youth before transitioning to acting, appearing in two serial films in 42 Her third role was a lead part as ": null
    },
    {
        "Bernadette Soubirous": "bernadette soubirous"
    },
    {
        " in  The Song of Bernadette  , which earned her the Academy Award and Golden Globe for Best Actress that year. She went on to star in several films that garnered her significant critical acclaim and a further three Academy Award nominations in the early42s, including  Since You Went Away  ,  Love Letters  , and  Duel in the Sun      In 42 Jones married film producer ": null
    },
    {
        "David O. Selznick": "david o. selznick"
    },
    {
        ", and appeared as the titular ": null
    },
    {
        "Madame Bovary": "madame bovary"
    },
    {
        " in ": null
    },
    {
        "Vincente Minnelli": "vincente minnelli"
    },
    {
        "s ": null
    },
    {
        "42 adaptation": "madame bovary"
    },
    {
        ". She appeared in several films throughout the 42s, including  Ruby Gentry  , ": null
    },
    {
        "John Huston": "john huston"
    },
    {
        "s adventure comedy  Beat the Devil  , and ": null
    },
    {
        "Vittorio De Sica": "vittorio de sica"
    },
    {
        "s drama  Terminal Station  . Jones earned her fifth Academy Award nomination for her performance as a ": null
    },
    {
        "Eurasian": "eurasian"
    },
    {
        " doctor in  Love is a Many-Splendored Thing  .     After Selznicks death in 42 Jones married industrialist ": null
    },
    {
        "Norton Simon": "norton simon"
    },
    {
        " and went into semi-retirement. She made her final film appearance in  The Towering Inferno  . Jones suffered from mental health problems during her life and survived a 42 ": null
    },
    {
        "suicide": "suicide"
    },
    {
        " attempt in which she jumped from a cliff in Malibu Beach. After her own daughter committed suicide in 42 Jones became profoundly interested in mental health education. In 42 she founded the Jennifer Jones Simon Foundation for Mental Health and Education. She spent the remainder of her life withdrawn from the public, residing in ": null
    },
    {
        "Malibu, California": "malibu, california"
    },
    {
        ", where she died in 42 aged 42         Jones was born Phylis Lee Isley in ": null
    },
    {
        "Tulsa, Oklahoma": "tulsa, oklahoma"
    },
    {
        " on March 42 42 the daughter of Flora Mae and Phillip Ross Isley. Her father was originally from ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        ", while her mother was a native of ": null
    },
    {
        "Sacramento, California": "sacramento"
    },
    {
        ". An only child, Jones was raised ": null
    },
    {
        "Roman Catholic": "catholic church"
    },
    {
        ". Her parents, both aspiring stage actors, toured the ": null
    },
    {
        "Midwest": "midwest"
    },
    {
        " in a traveling tent show that they owned and operated. Jones accompanied them, performing on occasion as part of the Isley Stock Company.     In 42 Jones enrolled at Edgemere Public School in ": null
    },
    {
        "Oklahoma City": "oklahoma city, oklahoma"
    },
    {
        ", then subsequently attended ": null
    },
    {
        "Monte Cassino": "monte cassino school"
    },
    {
        ", a Catholic girls school and junior college in Tulsa. After graduating, she enrolled as a drama major at ": null
    },
    {
        "Northwestern University": "northwestern university"
    },
    {
        " in Illinois, where she was a member of ": null
    },
    {
        "Kappa Alpha Theta": "kappa alpha theta"
    },
    {
        " sorority before transferring to the ": null
    },
    {
        "American Academy of Dramatic Arts": "american academy of dramatic arts"
    },
    {
        " in New York City in September, 42 It was there that she met and fell in love with fellow acting student ": null
    },
    {
        "Robert Walker": "robert walker"
    },
    {
        ", a native of ": null
    },
    {
        "Ogden, Utah": "ogden, utah"
    },
    {
        ". The couple married on January 42 42        Jones and Walker returned to Tulsa for a 42-week radio program arranged by her father and then made their way to Hollywood. She landed two small roles, first in a 42 ": null
    },
    {
        "John Wayne": "john wayne"
    },
    {
        " Western titled  New Frontier , which she filmed in the summer of 42 for ": null
    },
    {
        "Republic Pictures": "republic pictures"
    },
    {
        ". Her second project was the ": null
    },
    {
        "serial": "serial film"
    },
    {
        " entitled  Dick Tracys G-Men  , also for Republic. In both films, she was credited as Phylis Isley. After having failed a screen test for ": null
    },
    {
        "Paramount Pictures": "paramount pictures"
    },
    {
        ", Jones became disenchanted with Hollywood and decided to return to New York City.       Shortly after Jones married Walker, she gave birth to two sons: ": null
    },
    {
        "Robert Walker Jr.": "robert walker"
    },
    {
        " , and Michael Walker . While Walker found steady work in radio programs, Jones worked part-time modeling hats for the ": null
    },
    {
        "Powers Agency": "john robert powers"
    },
    {
        ", as well as posing for  Harpers Bazaar  while looking for possible acting jobs. When she learned of auditions for the lead role in Claudia, ": null
    },
    {
        "Rose Franken": "rose franken"
    },
    {
        "s hit play, in the summer of 42 she presented herself to David O. Selznicks New York office but fled in tears after what she thought was a bad reading. However, Selznick had overheard her audition and was impressed enough to have his secretary call her back. Following an interview, she was signed to a seven-year contract.        She was carefully groomed for stardom and given a new name: Jennifer Jones. Director ": null
    },
    {
        "Henry King": "henry king"
    },
    {
        " was impressed by her screen test as ": null
    },
    {
        "Bernadette Soubirous": "bernadette soubirous"
    },
    {
        " for  The Song of Bernadette  and she won the coveted role over hundreds of applicants. In ": null
    },
    {
        "42": "16th academy awards"
    },
    {
        ", on her 42th birthday, Jones won the ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        " for her performance as Bernadette Soubirous, her third screen role.     Simultaneous to her rise to notoriety for The Song of Bernadette, Jones began an affair with producer Selznick. She separated from Walker in November 42 co-starred with him in  Since You Went Away  , and formally divorced him in June 42  For her performance in Since You Went Away, she was nominated for her second Academy Award, this time for Best Supporting Actress. She earned a third successive Academy Award nomination for her performance opposite ": null
    },
    {
        "Joseph Cotten": "joseph cotten"
    },
    {
        " in the ": null
    },
    {
        "film noir": "film noir"
    },
    {
        "  Love Letters  .     Joness dark beauty and initial saintly image — as shown in her first starring role — was a stark contrast three years later when she was cast as a provocative ": null
    },
    {
        "bi-racial": "multiracial"
    },
    {
        " woman in Selznicks controversial ": null
    },
    {
        "Western": "western film"
    },
    {
        "  Duel in the Sun  , in which she portrayed a ": null
    },
    {
        "Mestiza": "mestizo"
    },
    {
        " orphan in Texas who falls in love with an Anglo man . The same year, she starred as the title character in ": null
    },
    {
        "Ernst Lubitsch": "ernst lubitsch"
    },
    {
        "s romantic comedy  Cluny Brown , playing a working-class English woman who falls in love just prior to ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". In 42 she filmed  Portrait of Jennie , a fantasy film released in 42 based on the ": null
    },
    {
        "novella of the same name": "portrait of jennie"
    },
    {
        " by ": null
    },
    {
        "Robert Nathan": "robert nathan"
    },
    {
        ". The film reunited her with co-star Cotten, who portrayed a painter who becomes obsessed with her character, the titular Jennie. It was a commercial failure, grossing only $42 million in rentals against a $42 million budget.          Jones married Selznick at sea on July 42 42 en route to Europe, after having carried on a relationship for five years. Over the following two decades, she would appear in numerous films he produced, and they established a working relationship. The year they married, Jones starred opposite ": null
    },
    {
        "John Garfield": "john garfield"
    },
    {
        " in ": null
    },
    {
        "John Huston": "john huston"
    },
    {
        "s adventure film  We Were Strangers . ": null
    },
    {
        "Bosley Crowther": "bosley crowther"
    },
    {
        " of  The New York Times  felt that Joness performance was lacking, noting: There is neither understanding nor passion in the stiff, frigid creature she achieves.  She was subsequently cast as the title character of ": null
    },
    {
        "Vincente Minnelli": "vincente minnelli"
    },
    {
        "s  Madame Bovary  , a role originally intended for ": null
    },
    {
        "Lana Turner": "lana turner"
    },
    {
        ", but that she had turned down.  Variety  deemed the film interesting to watch, but hard to feel, though it was noted that Jones answers to every demand of direction and script.  In 42 Jones starred in the ": null
    },
    {
        "Powell and Pressburger": "powell and pressburger"
    },
    {
        "-directed fantasy  Gone to Earth , portraying a superstitious gypsy woman in the English countryside.     Next, Jones starred in ": null
    },
    {
        "William Wyler": "william wyler"
    },
    {
        "s drama  Carrie  , opposite ": null
    },
    {
        "Laurence Olivier": "laurence olivier"
    },
    {
        ". Crowther of The New York Times was unenthused by her performance, writing: Mr. Olivier gives the film its closest contact with the book, while Miss Jones soft, seraphic portrait of Carrie takes it furthest away.  Also in 42 she co-starred with ": null
    },
    {
        "Charlton Heston": "charlton heston"
    },
    {
        " in  Ruby Gentry , playing a ": null
    },
    {
        "femme fatale": "femme fatale"
    },
    {
        " in rural North Carolina who becomes embroiled in a murder conspiracy after marrying a local man. The role had previously been offered to ": null
    },
    {
        "Joan Fontaine": "joan fontaine"
    },
    {
        ", who declined it as she felt she was unsuited to play backwoods.  In their review, Variety deemed the film a sordid drama neither Jennifer Jones nor Charlton Heston gaining any sympathy in their characters.         In 42 Jones was cast opposite ": null
    },
    {
        "Montgomery Clift": "montgomery clift"
    },
    {
        " in Italian director ": null
    },
    {
        "Vittorio De Sica": "vittorio de sica"
    },
    {
        "s  Terminal Station  , a Rome-set drama concerning a romance between an American woman and an Italian man. The film, produced by Selznick, had a troubled production history, with Selznick and De Sica disputing over the screenplay and tone of the film. Clift sided with De Sica, and reportedly called Selznick an interfering fuck-face on set. Aside from the tensions between cast and crew, Jones herself was mourning the recent death of her first husband, Robert Walker, and also missed her two sons, who were staying in ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " during production. Terminal Station was screened at the ": null
    },
    {
        "42 Cannes Film Festival": "1953 cannes film festival"
    },
    {
        ", and subsequently released in a heavily-truncated form in the United States, bearing the title Indiscretion of an American Wife. Also in 42 Jones re-teamed with director John Huston to star in his film  Beat the Devil  , and adventure comedy co-starring ": null
    },
    {
        "Humphrey Bogart": "humphrey bogart"
    },
    {
        ". The film was a box-office flop and was critically panned upon release, leading even Bogart to distance himself from it. However, it would undergo reevaluation in later years from such critics as ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        ", who included it in his list of Great Movies and cited it as the first ": null
    },
    {
        "camp": "camp"
    },
    {
        " film.  In August 42 Jones gave birth to her third child, daughter Mary Jennifer Selznick.       Jones was subsequently cast as ": null
    },
    {
        "Eurasian": "eurasian"
    },
    {
        " doctor ": null
    },
    {
        "Han Suyin": "han suyin"
    },
    {
        " in the drama  Love Is a Many-Splendored Thing  , a role that earned her her fifth Academy Award nomination. Crowther of The New York Times lauded her performance as lovely and intense. Her dark beauty reflects sunshine and sadness.  Next, she starred as a schoolteacher in  Good Morning, Miss Dove  , opposite ": null
    },
    {
        "Robert Stack": "robert stack"
    },
    {
        ", followed by a lead role opposite Gregory Peck in  The Man in the Gray Flannel Suit , a drama about a World War II veteran.     In 42 she starred as the poet ": null
    },
    {
        "Elizabeth Barrett Browning": "elizabeth barrett browning"
    },
    {
        " in the historical drama  The Barretts of Wimpole Street , based on the 42 ": null
    },
    {
        "play": "the barretts of wimpole street"
    },
    {
        " by ": null
    },
    {
        "Rudolf Besier": "rudolf besier"
    },
    {
        ". She followed this with a lead in the ": null
    },
    {
        "Ernest Hemingway": "ernest hemingway"
    },
    {
        " adaptation  A Farewell to Arms  , opposite ": null
    },
    {
        "Rock Hudson": "rock hudson"
    },
    {
        ". The film received mixed reviews, with Variety noting that the relationship between Rock Hudson and Jennifer Jones never takes on real dimensions.  Joness next project, another literary adaptation , came five years later in 42s  Tender Is the Night , in which she portrayed the emotionally troubled Nicole Diver, who observes her husbands falling in love with another woman while in the south of France.       Selznick died at age 42 on June 42 42 and after his death, Jones semi-retired from acting. Her first role in four years was a lead part in the British drama  The Idol  , as the mother of a rebellious son in the ": null
    },
    {
        "Swinging Sixties": "swinging sixties"
    },
    {
        " London. On November 42 42 the same day her close friend, ": null
    },
    {
        "Charles Bickford": "charles bickford"
    },
    {
        " died of a blood infection, Jones attempted ": null
    },
    {
        "suicide": "suicide"
    },
    {
        " by jumping from the base of a cliff overlooking Malibu Beach. According to biographer Paul Green, it was news of Bickfords death that triggered Joness suicide attempt. She was hospitalized in a ": null
    },
    {
        "coma": "coma"
    },
    {
        " from the incident before eventually recovering.   She returned to film with  Angel, Angel, Down We Go  in 42 about a teenage girl who uses her association with a ": null
    },
    {
        "rock": "rock music"
    },
    {
        " band to manipulate her family.        On May 42 42 Jones married her third husband, ": null
    },
    {
        "Norton Simon": "norton simon"
    },
    {
        ", a multi-millionaire industrialist, art collector and philanthropist from ": null
    },
    {
        "Portland, Oregon": "portland, oregon"
    },
    {
        ". The marriage took place aboard a tugboat five miles off the English coast, and was conducted by ": null
    },
    {
        "Unitarian": "general assembly of unitarian and free christian churches"
    },
    {
        " minister Eirion Phillips. Years before, Simon had attempted to buy the portrait of her that was used in the film  Portrait of Jennie ; Simon later met Jones at a party hosted by fellow industrialist and art collector ": null
    },
    {
        "Walter Annenberg": "walter annenberg"
    },
    {
        ".  Her last big-screen appearance came in the smash-hit disaster film  The Towering Inferno  , which concerned the burning of a ": null
    },
    {
        " San Francisco": "san francisco"
    },
    {
        " skyscraper. Her performance as a doomed guest in the building earned her a ": null
    },
    {
        "Golden Globe": "golden globe award"
    },
    {
        " nomination for Best Supporting Actress.  Early scenes in the film showed paintings lent to the production by the art gallery of Jones husband Simon.     Two years later, on May 42 42 Jones 42-year-old daughter, Marythen a student at ": null
    },
    {
        "Occidental College": "occidental college"
    },
    {
        "committed suicide by jumping from the roof of a 42-floor hotel in downtown ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ".   This led to Jones subsequent interest in mental health issues. In 42 with husband Simon , she founded the Jennifer Jones Simon Foundation For Mental Health and Education, which she ran until 42 One of Joness primary goals with the Foundation was to de-stigmatize mental illness.   I cringe when I admit Ive been suicidal, had mental problems, but why should I? Jones said in 42 I hope we can reeducate the world to see theres no more need for stigma in mental illness than there is for ": null
    },
    {
        "cancer": "cancer"
    },
    {
        ". At the time, she also divulged that she had been a patient of ": null
    },
    {
        "psychotherapy": "psychotherapy"
    },
    {
        " since age 42     Jones spent the remainder of her life outside of the public eye. Four years before the death of her husband Simon in June 42 he resigned as President of ": null
    },
    {
        "Norton Simon Museum": "norton simon museum"
    },
    {
        " in ": null
    },
    {
        "Pasadena": "pasadena, california"
    },
    {
        " and Jennifer Jones Simon was appointed Chairman of the Board of Trustees, President and Executive Officer. In 42 she began working with architect ": null
    },
    {
        "Frank Gehry": "frank gehry"
    },
    {
        " and landscape designer Nancy Goslee Power on renovating the museum and gardens. She remained active as the director of the Norton Simon Museum until 42 when she was given ": null
    },
    {
        "emeritus": "emeritus"
    },
    {
        " status.           Jones enjoyed a quiet retirement, living with her son ": null
    },
    {
        "Robert Walker Jr.": "robert walker"
    },
    {
        " and his family in Malibu for the last six years of her life. She granted no interviews and rarely appeared in public. Jones participated in Gregory Pecks ": null
    },
    {
        "AFI Life Achievement Award": "afi life achievement award"
    },
    {
        " ceremony in 42 and appeared at the 42th and 42th Academy Awards as part of the shows tributes to past Oscar winners.     She died of natural causes on December 42 42 at age 42  She was cremated and her ashes were interred with her second husband in the Selznick private room at the ": null
    },
    {
        "Forest Lawn Memorial Park": "forest lawn memorial park"
    },
    {
        " in Glendale, California.       Jones suffered from ": null
    },
    {
        "shyness": "shyness"
    },
    {
        " for much of her life, and avoided discussing her past and personal life with journalists. She was also averse to discussing ": null
    },
    {
        "critical analysis": "film studies"
    },
    {
        " of her work. Public discussion of Joness working relationship with her husband, David O. Selznick, has often overshadowed her career. Biographer Paul Green contends that, while Selznick helped facilitate her career and seek roles for her, Jones excelled because she not only possessed outstanding beauty but she also possessed genuine talent.                 Academy Awards          Golden Globe Awards     ": null
    }
]