[
    {
        "              Jeremy Bentham  was an English ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        ", ": null
    },
    {
        "jurist": "jurist"
    },
    {
        ", and ": null
    },
    {
        "social reformer": "social reformer"
    },
    {
        " regarded as the founder of modern ": null
    },
    {
        "utilitarianism": "utilitarianism"
    },
    {
        ".     Bentham defined as the fundamental axiom of his philosophy the principle that it is the greatest happiness of the greatest number that is the measure of right and wrong.  He became a leading theorist in Anglo-American ": null
    },
    {
        "philosophy of law": "philosophy of law"
    },
    {
        ", and a political radical whose ideas influenced the development of ": null
    },
    {
        "welfarism": "welfarism"
    },
    {
        ". He advocated ": null
    },
    {
        "individual": "individualism"
    },
    {
        " and ": null
    },
    {
        "economic freedom": "economic freedom"
    },
    {
        "s, the ": null
    },
    {
        "separation of church and state": "separation of church and state"
    },
    {
        ", ": null
    },
    {
        "freedom of expression": "freedom of expression"
    },
    {
        ", equal rights for women, the right to divorce, and the decriminalising of homosexual acts. He called for the abolition of ": null
    },
    {
        "slavery": "abolitionism"
    },
    {
        ", ": null
    },
    {
        "capital punishment": "capital_punishmentabolition_of_capital_punishment"
    },
    {
        " and ": null
    },
    {
        "physical punishment": "physical punishment"
    },
    {
        ", including that of children. He has also become known as an early advocate of ": null
    },
    {
        "animal rights": "animal rights"
    },
    {
        ". Though strongly in favour of the extension of ": null
    },
    {
        "individual legal rights": "individual and group rights"
    },
    {
        ", he opposed the idea of ": null
    },
    {
        "natural law": "natural law"
    },
    {
        " and ": null
    },
    {
        "natural rights": "natural rights"
    },
    {
        " , calling them nonsense upon stilts .  Bentham was also a sharp critic of ": null
    },
    {
        "legal fiction": "legal fiction"
    },
    {
        "s.     Benthams students included his secretary and collaborator ": null
    },
    {
        "James Mill": "james mill"
    },
    {
        ", the latters son, ": null
    },
    {
        "John Stuart Mill": "john stuart mill"
    },
    {
        ", the legal philosopher ": null
    },
    {
        "John Austin": "john austin"
    },
    {
        ", as well as ": null
    },
    {
        "Robert Owen": "robert owen"
    },
    {
        ", one of the founders of ": null
    },
    {
        "utopian socialism": "utopian socialism"
    },
    {
        ". He had considerable influence on the reform of prisons, schools, poor laws, law courts, and Parliament itself.      On his death in 42 Bentham left instructions for his body to be first dissected, and then to be permanently preserved as an auto-icon , which would be his memorial. This was done, and the auto-icon is now on public display at ": null
    },
    {
        "University College London": "university college london"
    },
    {
        " . Because of his arguments in favour of the general availability of education, he has been described as the spiritual founder of UCL. However, he played only a limited direct part in its foundation.                Bentham was born on 42 February 42 in ": null
    },
    {
        "Houndsditch": "houndsditch"
    },
    {
        ", ": null
    },
    {
        "London": "london"
    },
    {
        ", to a wealthy family that supported the ": null
    },
    {
        "Tory party": "tory party"
    },
    {
        ". He was reportedly a child prodigy: he was found as a toddler sitting at his fathers desk reading a multi-volume history of England, and he began to study ": null
    },
    {
        "Latin": "latin"
    },
    {
        " at the age of three. He learnt to play the ": null
    },
    {
        "violin": "violin"
    },
    {
        ", and at the age of seven Bentham would perform ": null
    },
    {
        "sonata": "sonata"
    },
    {
        "s by ": null
    },
    {
        "Handel": "handel"
    },
    {
        " during dinner parties. He had one surviving sibling, ": null
    },
    {
        "Samuel Bentham": "samuel bentham"
    },
    {
        " , with whom he was close.     He attended ": null
    },
    {
        "Westminster School": "westminster school"
    },
    {
        "; in 42 at age 42 his father sent him to ": null
    },
    {
        "The Queens College, Oxford": "the queens college, oxford"
    },
    {
        ", where he completed his bachelors degree in 42 and his masters degree in 42 He trained as a lawyer and, though he never practised, was called to the ": null
    },
    {
        "bar": "bar"
    },
    {
        " in 42 He became deeply frustrated with the complexity of English law, which he termed the Demon of Chicane . When the American colonies published their ": null
    },
    {
        "Declaration of Independence": "united states declaration of independence"
    },
    {
        " in July 42 the British government did not issue any official response but instead secretly commissioned London lawyer and pamphleteer ": null
    },
    {
        "John Lind": "john lind"
    },
    {
        " to publish a rebuttal. His 42-page tract was distributed in the colonies and contained an essay titled Short Review of the Declaration written by Bentham, a friend of Lind, which attacked and mocked the Americans ": null
    },
    {
        "political philosophy": "political philosophy"
    },
    {
        ".       In 42 and 42 Bentham travelled to ": null
    },
    {
        "Krichev": "krychaw"
    },
    {
        " in White Russia  to visit his brother, ": null
    },
    {
        "Samuel": "samuel bentham"
    },
    {
        ", who was engaged in managing various industrial and other projects for ": null
    },
    {
        "Prince Potemkin": "grigory potemkin"
    },
    {
        ". It was Samuel who conceived the basic idea of a circular building at the hub of a larger compound as a means of allowing a small number of managers to oversee the activities of a large and unskilled workforce.      Bentham began to develop this model, particularly as applicable to prisons, and outlined his ideas in a series of letters sent home to his father in England. He supplemented the supervisory principle with the idea of contract management; that is, an administration by contract as opposed to trust, where the director would have a ": null
    },
    {
        "pecuniary": "pecuniary"
    },
    {
        " interest in lowering the average rate of mortality. The ": null
    },
    {
        "Panopticon": "panopticon"
    },
    {
        " was intended to be cheaper than the prisons of his time, as it required fewer staff; Allow me to construct a prison on this model, Bentham requested to a Committee for the Reform of Criminal Law, I will be the ": null
    },
    {
        "gaoler": "gaoler"
    },
    {
        ". You will see  ... that the gaoler will have no salary—will cost nothing to the nation. As the watchmen cannot be seen, they need not be on duty at all times, effectively leaving the watching to the watched. According to Benthams design, the prisoners would also be used as menial labour, walking on wheels to spin ": null
    },
    {
        "loom": "loom"
    },
    {
        "s or run a ": null
    },
    {
        "water wheel": "water wheel"
    },
    {
        ". This would decrease the cost of the prison and give a possible source of income.     The ultimately abortive proposal for a panopticon prison to be built in England was one among his many proposals for legal and social reform. But Bentham spent some sixteen years of his life developing and refining his ideas for the building and hoped that the government would adopt the plan for a National Penitentiary appointing him as contractor-governor. Although the prison was never built, the concept had an important influence on later generations of thinkers. Twentieth-century French philosopher ": null
    },
    {
        "Michel Foucault": "michel foucault"
    },
    {
        " argued that the panopticon was paradigmatic of several 42th-century disciplinary institutions. Bentham remained bitter throughout his later life about the rejection of the panopticon scheme, convinced that it had been thwarted by the King and an aristocratic elite. It was largely because of his sense of injustice and frustration that he developed his ideas of sinister interest —that is, of the vested interests of the powerful conspiring against a wider public interest—which underpinned many of his broader arguments for reform.         On his return to England from Russia, Bentham had commissioned drawings from an architect, ": null
    },
    {
        "Willey Reveley": "willey reveley"
    },
    {
        ". In 42 he published the material he had written as a book, although he continued to refine his proposals for many years to come. He had by now decided that he wanted to see the prison built: when finished, it would be managed by himself as contractor-governor, with the assistance of Samuel. After unsuccessful attempts to interest the authorities in Ireland and revolutionary France, Semple 42 pp. 42–42 42–42 he started trying to persuade the prime minister, ": null
    },
    {
        "William Pitt": "william pitt the younger"
    },
    {
        ", to revive an earlier abandoned scheme for a National Penitentiary in England, this time to be built as a panopticon. He was eventually successful in winning over Pitt and his advisors, and in 42 was paid £42 for preliminary work on the project. Semple 42 pp. 42–42 42     The intended site was one that had been authorised  for the earlier Penitentiary, at ": null
    },
    {
        "Battersea": "battersea"
    },
    {
        " Rise; but the new proposals ran into technical legal problems and objections from the local landowner, ": null
    },
    {
        "Earl Spencer": "george spencer, 2nd earl spencer"
    },
    {
        ". Semple 42 pp. 42–42 Other sites were considered, including one at Hanging Wood, near ": null
    },
    {
        "Woolwich": "woolwich"
    },
    {
        ", but all proved unsatisfactory. Semple 42 pp. 42–42 Eventually Bentham turned to a site at Tothill Fields, near ": null
    },
    {
        "Westminster": "westminster"
    },
    {
        ". Although this was common land, with no landowner, there were a number of parties with interests in it, including ": null
    },
    {
        "Earl Grosvenor": "richard grosvenor, 1st earl grosvenor"
    },
    {
        ", who owned a house on an adjacent site and objected to the idea of a prison overlooking it. Again, therefore, the scheme ground to a halt. Semple 42 pp. 42–42 At this point, however, it became clear that a nearby site at ": null
    },
    {
        "Millbank": "millbank"
    },
    {
        ", adjoining the ": null
    },
    {
        "Thames": "river thames"
    },
    {
        ", was available for sale, and this time things ran more smoothly. Using government money, Bentham bought the land on behalf of the Crown for £42 in November 42 Semple 42 pp. 42–42     From his point of view, the site was far from ideal, being marshy, unhealthy, and too small. When he asked the government for more land and more money, however, the response was that he should build only a small-scale experimental prison—which he interpreted as meaning that there was little real commitment to the concept of the panopticon as a cornerstone of penal reform. Semple 42 pp. 42–42 Negotiations continued, but in 42 Pitt resigned from office, and in 42 the new ": null
    },
    {
        "Addington": "henry addington, 1st viscount sidmouth"
    },
    {
        " administration decided not to proceed with the project. Semple 42 pp. 42–42 Bentham was devastated: They have murdered my best days. Semple 42 p. 42     Nevertheless, a few years later the government revived the idea of a National Penitentiary, and in 42 and 42 returned specifically to the idea of a panopticon. Semple 42 pp. 42–42 Bentham, now aged 42 was still willing to be governor. However, as it became clear that there was still no real commitment to the proposal, he abandoned hope, and instead turned his attentions to extracting financial compensation for his years of fruitless effort. His initial claim was for the enormous sum of nearly £42, but he eventually settled for the more modest sum of £42. Semple 42 pp. 42–42 An Act of Parliament in 42 transferred his title in the site to the Crown. Penitentiary House, etc. Act: 42 Geo. III, c. 42 .     More successful was his cooperation with ": null
    },
    {
        "Patrick Colquhoun": "patrick colquhoun"
    },
    {
        " in tackling the corruption in the ": null
    },
    {
        "Pool of London": "pool of london"
    },
    {
        ". This resulted in the ": null
    },
    {
        "Thames Police Bill of 42": "thames police bill"
    },
    {
        ", which was passed in 42 The bill created the ": null
    },
    {
        "Thames River Police": "thames river police"
    },
    {
        ", which was the first preventive police force in the country and was a precedent for ": null
    },
    {
        "Robert Peel": "robert peel"
    },
    {
        "s reforms 42 years later.       Bentham was in correspondence with many influential people. In the 42s, for example, Bentham maintained a correspondence with the aging ": null
    },
    {
        "Adam Smith": "adam smith"
    },
    {
        ", in an unsuccessful attempt to convince Smith that interest rates should be allowed to freely float. As a result of his correspondence with ": null
    },
    {
        "Mirabeau": "honoré gabriel riqueti, comte de mirabeau"
    },
    {
        " and other leaders of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ", Bentham was declared an honorary citizen of France. He was an outspoken critic of the revolutionary discourse of ": null
    },
    {
        "natural rights": "natural rights"
    },
    {
        " and of the violence that arose after the ": null
    },
    {
        "Jacobin": "jacobin"
    },
    {
        "s took power . Between 42 and 42 he held a personal friendship with ": null
    },
    {
        "Latin American": "latin american wars of independence"
    },
    {
        " revolutionary ": null
    },
    {
        "Francisco de Miranda": "francisco de miranda"
    },
    {
        " and paid visits to Mirandas Grafton Way house in London. He also developed links with ": null
    },
    {
        "José Cecilio del Valle": "josé cecilio del valle"
    },
    {
        ".         Bentham contributed to a plan to ": null
    },
    {
        "found a new colony in South Australia": "european settlement of south australia"
    },
    {
        ": in 42 a Proposal to His Majestys Government for founding a colony on the Southern Coast of Australia was prepared under the auspices of ": null
    },
    {
        "Robert Gouger": "robert gouger"
    },
    {
        ", ": null
    },
    {
        "Charles Grey, 42nd Earl Grey": "charles grey, 2nd earl grey"
    },
    {
        ", ": null
    },
    {
        "Anthony Bacon": "anthony bacon"
    },
    {
        " and Bentham, but its ideas were considered too radical, and it was unable to attract the required investment.      In 42 he co-founded  The Westminster Review  with ": null
    },
    {
        "James Mill": "james mill"
    },
    {
        " as a journal for the ": null
    },
    {
        "Philosophical Radicals": "radicalism political reform"
    },
    {
        " —a group of younger disciples through whom Bentham exerted considerable influence in British public life. One was ": null
    },
    {
        "John Bowring": "john bowring"
    },
    {
        ", to whom Bentham became devoted, describing their relationship as son and father : he appointed Bowring political editor of The Westminster Review and eventually his ": null
    },
    {
        "literary executor": "literary executor"
    },
    {
        ". Another was ": null
    },
    {
        "Edwin Chadwick": "edwin chadwick"
    },
    {
        ", who wrote on hygiene, sanitation and policing and was a major contributor to the ": null
    },
    {
        "Poor Law Amendment Act": "poor law amendment act"
    },
    {
        ": Bentham employed Chadwick as a secretary and bequeathed him a large legacy.       An insight into his character is given in Michael St. John Packes The Life of John Stuart Mill:          A ": null
    },
    {
        "psychobiographical": "psychobiography"
    },
    {
        " study by Philip Lucas and Anne Sheeran argues that he may have had ": null
    },
    {
        "Aspergers syndrome": "asperger syndrome"
    },
    {
        ". Bentham was an atheist.                  Bentham died on 42 June 42 aged 42 at his residence in Queen Square Place in ": null
    },
    {
        "Westminster": "westminster"
    },
    {
        ", ": null
    },
    {
        "London": "london"
    },
    {
        ", England. He had continued to write up to a month before his death, and had made careful preparations for the ": null
    },
    {
        "dissection": "dissection"
    },
    {
        " of his body after death and its preservation as an auto-icon. As early as 42 when Bentham was 42 years old, he made a will leaving his body for dissection to a family friend, the physician and chemist ": null
    },
    {
        "George Fordyce": "george fordyce"
    },
    {
        ", whose daughter, Maria Sophia , married Jeremys brother ": null
    },
    {
        "Samuel Bentham": "samuel bentham"
    },
    {
        ". A paper written in 42 instructing ": null
    },
    {
        "Thomas Southwood Smith": "thomas southwood smith"
    },
    {
        " to create the auto-icon, was attached to his last will, dated 42 May 42     On 42 June 42 two days after his death, invitations were distributed to a select group of friends, and on the following day at 42 p.m., Southwood Smith delivered a lengthy oration over Benthams remains in the Webb Street School of Anatomy & Medicine in ": null
    },
    {
        "Southwark": "southwark"
    },
    {
        ", London. The printed oration contains a frontispiece with an engraving of Benthams body partly covered by a sheet.     Afterward, the skeleton and head were preserved and stored in a wooden cabinet called the Auto-icon , with the skeleton padded out with hay and dressed in Benthams clothes. Originally kept by his disciple ": null
    },
    {
        "Thomas Southwood Smith": "thomas southwood smith"
    },
    {
        ", it was acquired by ": null
    },
    {
        "University College London": "university college london"
    },
    {
        " in 42 It is normally kept on public display at the end of the South Cloisters in the main building of the college; however, for the retirement of Sir ": null
    },
    {
        "Malcolm Grant": "malcolm grant"
    },
    {
        " as provost of the College in 42 it was brought to attend his final council meeting. This was the only time that the body has been taken to a UCL council meeting; there is a persistent myth that he is taken to all meetings. Benthams body was only taken to that one meeting because of the persistent myth about Benthams attendance, and the curator at the time, Nick Booth, thought it would be a good idea for Bentham to attend once. This will never happen again, as there is a risk that the beetles in the carpet could contaminate the body and slowly consume it.      Bentham had intended the Auto-icon to incorporate his actual head, ": null
    },
    {
        "mummified": "mummymodern mummies"
    },
    {
        " to resemble its appearance in life. Southwood Smiths experimental efforts at mummification, based on practices of the indigenous people of New Zealand and involving placing the head under an air pump over sulfuric acid and drawing off the fluids, although technically successful, left the head looking distastefully macabre, with dried and darkened skin stretched tautly over the skull. The auto-icon was therefore given a ": null
    },
    {
        "wax": "wax"
    },
    {
        " head, fitted with some of Benthams own hair. The real head was displayed in the same case as the auto-icon for many years, but became the target of repeated ": null
    },
    {
        "student prank": "student prank"
    },
    {
        "s. It is now locked away securely.     In 42 plans were announced to re-exhibit the head and at the same time obtain a DNA sample for sequencing with the goal of identifying genetic evidence of ": null
    },
    {
        "autism": "autism"
    },
    {
        ".     In 42 Jeremy Benthams auto-icon was on display in New York City at the Metropolitan Museum of Art Breuer location.                Benthams ambition in life was to create a Pannomion , a complete ": null
    },
    {
        "utilitarian": "utilitarianism"
    },
    {
        " code of law. He not only proposed many legal and social reforms, but also expounded an underlying moral principle on which they should be based. This philosophy of ": null
    },
    {
        "utilitarianism": "utilitarianism"
    },
    {
        " took for its fundamental axiom , it is the greatest happiness of the greatest number that is the measure of right and wrong . Bentham claimed to have borrowed this concept from the writings of ": null
    },
    {
        "Joseph Priestley": "joseph priestley"
    },
    {
        ", although the closest that Priestley in fact came to expressing it was in the form the good and happiness of the members, that is the majority of the members of any state, is the great standard by which every thing relating to that state must finally be determined .     The ": null
    },
    {
        "greatest happiness principle": "greatest happiness principle"
    },
    {
        " , or the principle of utility, forms the cornerstone of all Benthams thought. By happiness , he understood a predominance of pleasure over pain . He wrote in The Principles of Morals and Legislation:          Bentham was a rare major figure in the history of philosophy to endorse ": null
    },
    {
        "psychological egoism": "psychological egoism"
    },
    {
        ".     Bentham was a determined opponent of religion. Crimmins observes: Between 42 and 42 Jeremy Bentham carried out an exhaustive examination of religion with the declared aim of extirpating religious beliefs, even the idea of religion itself, from the minds of men.      Bentham suggested a procedure for estimating the moral status of any action, which he called the hedonistic or ": null
    },
    {
        "felicific calculus": "felicific calculus"
    },
    {
        ". Utilitarianism was revised and expanded by Benthams student ": null
    },
    {
        "John Stuart Mill": "john stuart mill"
    },
    {
        ". Mill sharply criticized Benthams view of human nature, which failed to recognize conscience as a human motive. Mill considered Benthams view to have done and to be doing very serious evil. Mill, John Stuart Early Essays of John Stuart Mill pp. 4242 In Mills hands, Benthamism became a major element in the ": null
    },
    {
        "liberal": "classical liberalism"
    },
    {
        " conception of state policy objectives.     Benthams critics have claimed that he undermined the foundation of a free society by rejecting natural rights. Historian Gertrude Himmelfarb wrote The principle of the greatest happiness of the greatest number was as inimical to the idea of liberty as to the idea of rights.      In his exposition of the felicific calculus, Bentham proposed a classification of 42 pains and 42 pleasures, by which we might test the happiness factor of any action. Nonetheless, it should not be overlooked that Benthams hedonistic theory , unlike Mills, is often criticised for lacking a principle of fairness embodied in a conception of ": null
    },
    {
        "justice": "justice"
    },
    {
        ". In Bentham and the Common Law Tradition, Gerald J. Postema states: No moral concept suffers more at Benthams hand than the concept of justice. There is no sustained, mature analysis of the notion...  Thus, some critics object, it would be acceptable to ": null
    },
    {
        "torture": "torture"
    },
    {
        " one person if this would produce an amount of happiness in other people outweighing the unhappiness of the tortured individual. However, as P. J. Kelly argued in Utilitarianism and Distributive Justice: Jeremy Bentham and the Civil Law, Bentham had a theory of justice that prevented such consequences. According to Kelly, for Bentham the law provides the basic framework of social interaction by delimiting spheres of personal inviolability within which individuals can form and pursue their own conceptions of well-being . It provides security, a precondition for the formation of expectations. As the hedonic calculus shows expectation utilities to be much higher than natural ones, it follows that Bentham does not favour the sacrifice of a few to the benefit of the many. Law professor Alan Dershowitz has quoted Bentham to argue that torture should sometimes be permitted.     Benthams  An Introduction to the Principles of Morals and Legislation  focuses on the principle of utility and how this view of morality ties into legislative practices. His principle of utility regards good as that which produces the greatest amount of pleasure and the minimum amount of pain and evil as that which produces the most pain without the pleasure. This concept of pleasure and pain is defined by Bentham as physical as well as spiritual. Bentham writes about this principle as it manifests itself within the legislation of a society. He lays down a set of criteria for measuring the extent of pain or pleasure that a certain decision will create.     The criteria are divided into the categories of intensity, duration, certainty, proximity, productiveness, purity, and extent. Using these measurements, he reviews the concept of punishment and when it should be used as far as whether a punishment will create more pleasure or more pain for a society. He calls for legislators to determine whether punishment creates an even more evil offence. Instead of suppressing the evil acts, Bentham argues that certain unnecessary laws and punishments could ultimately lead to new and more dangerous vices than those being punished to begin with, and calls upon legislators to measure the pleasures and pains associated with any legislation and to form laws in order to create the greatest good for the greatest number. He argues that the concept of the individual pursuing his or her own happiness cannot be necessarily declared right , because often these individual pursuits can lead to greater pain and less pleasure for a society as a whole. Therefore, the legislation of a society is vital to maintain the maximum pleasure and the minimum degree of pain for the greatest number of people.          Benthams opinions about ": null
    },
    {
        "monetary economics": "money"
    },
    {
        " were completely different from those of ": null
    },
    {
        "David Ricardo": "david ricardo"
    },
    {
        "; however, they had some similarities to those of ": null
    },
    {
        "Henry Thornton": "henry thornton"
    },
    {
        ". He focused on ": null
    },
    {
        "monetary expansion": "monetary expansion"
    },
    {
        " as a means of helping to create ": null
    },
    {
        "full employment": "full employment"
    },
    {
        ". He was also aware of the relevance of forced saving, ": null
    },
    {
        "propensity to consume": "propensity to consume"
    },
    {
        ", the saving-investment relationship, and other matters that form the content of modern income and employment analysis. His monetary view was close to the fundamental concepts employed in his model of utilitarian decision making. His work is considered to be an early precursor of modern ": null
    },
    {
        "welfare economics": "welfare economics"
    },
    {
        ".     Bentham stated that pleasures and pains can be ranked according to their value or dimension such as intensity, duration, certainty of a pleasure or a pain. He was concerned with maxima and minima of pleasures and pains; and they set a precedent for the future employment of the maximisation principle in the economics of the consumer, the firm and the search for an optimum in welfare economics.     Bentham advocated Pauper Management which involved the creation of a chain of large workhouses.         Bentham was the first person to be an aggressive advocate for the ": null
    },
    {
        "codification": "codification"
    },
    {
        " of all of the ": null
    },
    {
        "common law": "common law"
    },
    {
        " into a coherent set of statutes; he was actually the person who coined the verb to codify to refer to the process of drafting a legal code. He lobbied hard for the formation of codification commissions in both England and the United States, and went so far as to write to President ": null
    },
    {
        "James Madison": "james madison"
    },
    {
        " in 42 to volunteer to write a complete legal code for the young country. After he learned more about American law and realised that most of it was state-based, he promptly wrote to the governors of every single state with the same offer.     During his lifetime, Benthams codification efforts were completely unsuccessful. Even today, they have been completely rejected by almost every common law jurisdiction, including England. However, his writings on the subject laid the foundation for the moderately successful codification work of ": null
    },
    {
        "David Dudley Field II": "david dudley field ii"
    },
    {
        " in the United States a generation later.       Bentham is widely regarded as one of the earliest proponents of ": null
    },
    {
        "animal rights": "animal rights"
    },
    {
        ". He argued and believed that the ability to suffer, not the ability to reason, should be the benchmark, or what he called the insuperable line . If reason alone were the criterion by which we judge who ought to have rights, human infants and adults with certain forms of disability might fall short, too. In 42 alluding to the limited degree of legal protection afforded to ": null
    },
    {
        "slave": "slave"
    },
    {
        "s in the ": null
    },
    {
        "French West Indies": "french west indies"
    },
    {
        " by the ": null
    },
    {
        "Code Noir": "code noir"
    },
    {
        ", he wrote:          Earlier in that paragraph, Bentham makes clear that he accepted that animals could be killed for food, or in defence of human life, provided that the animal was not made to suffer unnecessarily. Bentham did not object to ": null
    },
    {
        "medical experiments": "animal testing"
    },
    {
        " on animals, providing that the experiments had in mind a particular goal of benefit to humanity, and had a reasonable chance of achieving that goal. He wrote that otherwise he had a decided and insuperable objection to causing pain to animals, in part because of the harmful effects such practices might have on human beings. In a letter to the editor of the Morning Chronicle in March 42 he wrote:            Bentham said that it was the placing of women in a legally inferior position that made him choose, at the age of eleven, the career of a reformist. Bentham spoke for a complete equality between sexes.   Bentham nevertheless thought women inferior to men regarding such qualities as strength of intellectual powers and firmness of mind .     The essay Paederasty  argued for the liberalisation of laws prohibiting homosexual sex. The essay remained unpublished during his lifetime for fear of offending public morality. Some of Benthams writings on sexual non-conformity were published for the first time in 42 but Paederasty was not published until 42 Journal of Homosexuality, v.42:42 p.4242; continued in v.42:42 Bentham does not believe homosexual acts to be unnatural, describing them merely as irregularities of the venereal appetite . The essay chastises the society of the time for making a disproportionate response to what Bentham appears to consider a largely private offence—public displays or forced acts being dealt with rightly by other laws. When the essay was published in the Journal of Homosexuality in 42 the Abstract stated that Benthams essay was the first known argument for homosexual law reform in England .       For Bentham, transparency had moral value. For example, journalism puts power-holders under moral scrutiny. However, Bentham wanted such transparency to apply to everyone. This he describes by picturing the world as a gymnasium in which each gesture, every turn of limb or feature, in those whose motions have a visible impact on the general happiness, will be noticed and marked down . He considered both surveillance and transparency to be useful ways of generating understanding and improvements for peoples lives.       Bentham distinguished among fictional entities what he called fabulous entities like ": null
    },
    {
        "Prince Hamlet": "prince hamlet"
    },
    {
        " or a ": null
    },
    {
        "centaur": "centaur"
    },
    {
        ", from what he termed fictitious entities , or necessary objects of discourse, similar to ": null
    },
    {
        "Kant": "kant"
    },
    {
        "s categories, such as nature, custom, or the social contract.       Bentham is widely associated with the foundation in 42 of London University , though he was 42 years old when the University opened and played only an indirect role in its establishment. His direct involvement was limited to his buying a single £42 share in the new University, making him just one of over a thousand shareholders.        Bentham and his ideas can nonetheless be seen as having inspired several of the actual founders of the University. He strongly believed that education should be more widely available, particularly to those who were not wealthy or who did not belong to the established church; in Benthams time, membership of the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        " and the capacity to bear considerable expenses were required of students entering the Universities of ": null
    },
    {
        "Oxford": "university of oxford"
    },
    {
        " and ": null
    },
    {
        "Cambridge": "university of cambridge"
    },
    {
        ". As the University of London was the first in England to admit all, regardless of ": null
    },
    {
        "race": "race"
    },
    {
        ", creed or political belief, it was largely consistent with Benthams vision. There is some evidence that, from the sidelines, he played a more than passive part in the planning discussions for the new institution, although it is also apparent that his interest was greater than his influence . He failed in his efforts to see his disciple ": null
    },
    {
        "John Bowring": "john bowring"
    },
    {
        " appointed professor of English or History, but he did oversee the appointment of another pupil, ": null
    },
    {
        "John Austin": "john austin"
    },
    {
        ", as the first professor of ": null
    },
    {
        "Jurisprudence": "jurisprudence"
    },
    {
        " in 42     The more direct associations between Bentham and UCL—the Colleges custody of his Auto-icon and of the majority of his surviving papers—postdate his death by some years: the papers were donated in 42 and the Auto-icon in 42 A large painting by ": null
    },
    {
        "Henry Tonks": "henry tonks"
    },
    {
        " hanging in UCLs ": null
    },
    {
        "Flaxman Gallery": "john flaxman"
    },
    {
        " depicts Bentham approving the plans of the new university, but it was executed in 42 and the scene is entirely imaginary. Since 42 UCL has hosted the Bentham Project, which is progressively publishing a ": null
    },
    {
        "definitive edition of Benthams writings": "the collected works of jeremy bentham"
    },
    {
        ".     UCL now endeavours to acknowledge Benthams influence on its foundation, while avoiding any suggestion of direct involvement, by describing him as its spiritual founder .                 Bentham was an obsessive writer and reviser, but was constitutionally incapable, except on rare occasions, of bringing his work to completion and publication. Most of what appeared in print in his lifetime was prepared for publication by others. Several of his works first appeared in French translation, prepared for the press by ": null
    },
    {
        "Étienne Dumont": "pierre étienne louis dumont"
    },
    {
        ", for example, Theory of Legislation, Volume 42 42 Weeks, Jordan, & Company. Boston. Some made their first appearance in English in the 42s as a result of back-translation from Dumonts 42 collection of Benthams writing on civil and penal legislation.               This was an unsparing criticism of some introductory passages relating to political theory in ": null
    },
    {
        "William Blackstone": "william blackstone"
    },
    {
        "s  Commentaries on the Laws of England . The book, published anonymously, was well received and credited to some of the greatest minds of the time. Bentham disagreed with Blackstones defence of judge-made law, his defence of legal fictions, his theological formulation of the doctrine of mixed government, his appeal to a social contract and his use of the vocabulary of natural law. Benthams Fragment was only a small part of a Commentary on the Commentaries, which remained unpublished until the twentieth century.     An attack on the ": null
    },
    {
        "United States Declaration of Independence": "united states declaration of independence"
    },
    {
        ".    Bentham wrote a series of thirteen Letters addressed to Adam Smith, published in 42 as Defence of Usury. Benthams main argument against the restriction is that projectors generate positive ": null
    },
    {
        "externalities": "externalities"
    },
    {
        ". ": null
    },
    {
        "G.K. Chesterton": "g.k. chesterton"
    },
    {
        " identified Benthams essay on usury as the very beginning of the modern world . Benthams arguments were very influential. Writers of eminence moved to abolish the restriction, and repeal was achieved in stages and fully achieved in England in 42 There is little evidence as to Smiths reaction. He did not revise the offending passages in  The Wealth of Nations , but Smith made little or no substantial revisions after the third edition of 42      An attack on the Declaration of the Rights of Man decreed by the French Revolution, and critique of the natural rights philosophy underlying it.   Traités de législation civile et pénale   Punishments and Rewards   Panopticon versus New South Wales: or, the Panopticon Penitentiary System, Compared. Containing, 42 Two Letters to Lord Pelham, Secretary of State, Comparing the two Systems on the Ground of Expediency. 42 Plea for the Constitution: Representing the Illegalities involved in the Penal Colonization System. Anno 42 printed: now first published       The Influence of Natural Religion upon the Temporal Happiness of Mankind    Not Paul But Jesus               On his death, Bentham left manuscripts amounting to an estimated 42 million words, which are now largely held by UCLs Special Collections and the ": null
    },
    {
        "British Library": "british library"
    },
    {
        " .       ": null
    },
    {
        "John Bowring": "john bowring"
    },
    {
        ", the young radical writer who had been Benthams intimate friend and disciple, was appointed his ": null
    },
    {
        "literary executor": "literary executor"
    },
    {
        " and charged with the task of preparing a collected edition of his works. This appeared in 42 volumes in 42–42 Bowring based much of his edition on previously published texts rather than Benthams own manuscripts, and elected not to publish Benthams works on religion at all. The edition was described by the  Edinburgh Review  on first publication as incomplete, incorrect and ill-arranged , and has since been repeatedly criticised both for its omissions and for errors of detail; while Bowrings memoir of Benthams life included in volumes 42 and 42 was described by Sir ": null
    },
    {
        "Leslie Stephen": "leslie stephen"
    },
    {
        " as one of the worst biographies in the language . Nevertheless, Bowrings remained the standard edition of most of Benthams writings for over a century, and is still only partially superseded: it includes such interesting writings on international relations as Benthams ": null
    },
    {
        "A Plan for an Universal and Perpetual Peace": "a plan for an universal and perpetual peace"
    },
    {
        " written 42–42 which forms part IV of the ": null
    },
    {
        "Principles of International Law": "principles of international law"
    },
    {
        ".       In 42–42 ": null
    },
    {
        "Werner Stark": "werner stark"
    },
    {
        " published a three-volume set, Jeremy Benthams Economic Writings, in which he attempted to bring together all of Benthams writings on economic matters, including both published and unpublished material. Although a significant achievement, the work is considered by scholars to be flawed in many points of detail, and a new edition of the economic writings is currently in preparation by the Bentham Project.          In 42 the Bentham Committee was established under the auspices of University College London with the aim of producing a definitive edition of Benthams writings. It set up the Bentham Project to undertake the task, and the first volume in  The Collected Works of Jeremy Bentham  was published in 42 The Collected Works are providing many unpublished works, as well as much-improved texts of works already published. To date, 42 volumes have appeared; the complete edition is projected to run to around seventy. The volume Of Laws in General was found to contain many errors and has been replaced by Of the Limits of the Penal Branch of Jurisprudence  In June 42 Volumes 42–42 were re-published in open access by UCL Press.     To assist in this task, the Bentham papers at UCL are being digitised by crowdsourcing their transcription. ": null
    },
    {
        "Transcribe Bentham": "transcribe bentham"
    },
    {
        " is an award-winning ": null
    },
    {
        "crowdsourced": "crowdsourced"
    },
    {
        " manuscript transcription project, run by ": null
    },
    {
        "University College London": "university college london"
    },
    {
        "s Bentham Project, in partnership with UCLs ": null
    },
    {
        "UCL Centre for Digital Humanities": "ucl centre for digital humanities"
    },
    {
        ", UCL Library Services, UCL Learning and Media Services, the ": null
    },
    {
        "University of London Computer Centre": "university of london computer centre"
    },
    {
        ", and the online community. The project was launched in September 42 and is making freely available, via a specially designed transcription interface, digital images of UCLs vast Bentham Papers collection—which runs to some 42 manuscript folios—to engage the public and recruit volunteers to help transcribe the material. Volunteer-produced transcripts will contribute to the Bentham Projects production of the new edition of The Collected Works of Jeremy Bentham, and will be uploaded to UCLs digital Bentham Papers repository, widening access to the collection for all and ensuring its long-term preservation. Manuscripts can be viewed and transcribed by signing-up for a transcriber account at the Transcription Desk, via the Transcribe Bentham website.     Free, flexible textual search of the full collection of Bentham Papers is now   possible through an experimental handwritten text image indexing and search system, developed by the PRHLT research center in the framework of the READ project.         The ": null
    },
    {
        "Faculty of Laws": "ucl faculty of laws"
    },
    {
        " at ": null
    },
    {
        "University College London": "university college london"
    },
    {
        " occupies Bentham House, next to the main UCL campus.     Benthams name was adopted by the Australian ": null
    },
    {
        "litigation funder": "legal financing"
    }
]