[
    {
        "Jerry Cornelius is a character, an urban adventurer created by author ": null
    },
    {
        "Michael Moorcock": "michael moorcock"
    },
    {
        ". Cornelius is a hipster of ambiguous and occasionally polymorphous ": null
    },
    {
        "gender": "gender"
    },
    {
        ". Many of the same characters feature in each of several Cornelius books, though the individual books have little connection with one another, having a more ": null
    },
    {
        "metafiction": "metafiction"
    },
    {
        "al than causal relationship. The first Jerry Cornelius book,  The Final Programme , was made into ": null
    },
    {
        "a 42 film": "the final programme"
    },
    {
        " starring ": null
    },
    {
        "Jon Finch": "jon finch"
    },
    {
        " and ": null
    },
    {
        "Jenny Runacre": "jenny runacre"
    },
    {
        ". ": null
    },
    {
        "Notting Hill": "notting hill"
    },
    {
        " in ": null
    },
    {
        "London": "london"
    },
    {
        " features prominently in the stories.       The series draws plot elements from Moorcocks ": null
    },
    {
        "Elric": "elric"
    },
    {
        " series, as well as the  Commedia dellArte . Moorcock hints in many places that Cornelius may be an aspect of the ": null
    },
    {
        "Eternal Champion": "eternal champion"
    },
    {
        ". Characters from the Cornelius novels show up in much of Moorcocks other fiction:  The Dancers at the End of Time  series has a character called ": null
    },
    {
        "Jherek Carnelian": "jherek carnelian"
    },
    {
        " who is the son of Lord Jagged of Canaria, and there are several hints in the series that Lord Jagged may be a guise of Jerry Cornelius; the Cornelius-series character ": null
    },
    {
        "Una Persson": "una persson"
    },
    {
        " also appears in the Dancers series and the ": null
    },
    {
        "Oswald Bastable": "oswald bastable"
    },
    {
        " books, and may also be the character Oona in the later ": null
    },
    {
        "Elric": "elric"
    },
    {
        " books; ": null
    },
    {
        "Colonel Pyat": "colonel pyat"
    },
    {
        " has his own non-SF series of books by Moorcock, beginning with  Byzantium Endures .     At least five other variants of the name occur in other Moorcock works . A space pirate named Captain Cornelius  appears in Moorcocks  Doctor Who  novel,  The Coming of the Terraphiles .     ": null
    },
    {
        "The Cornelius Quartet": "the cornelius quartet"
    },
    {
        "  The Final Programme    : Jerry battles his brother Frank who has kidnapped his beloved sister Catherine. Frank dies, but Catherine is also killed. Jerry is sucked into the plans of ": null
    },
    {
        "Miss Brunner": "miss brunner"
    },
    {
        " to create the perfect being by merging the bodies of Jerry and herself together. When this is done, a radiantly charismatic hermaphroditic being emerges from the machinery. All who see the new creature fall quaking to their knees. The creature itself announces that this is a very tasty world .    A Cure for Cancer    : Jerry is solo again, existing as negative character with black skin and white hair. He moves through a landscape of destroyed English cities and occupying American armies, a metaphor for contemporary ": null
    },
    {
        "Vietnam": "vietnam"
    },
    {
        ". He runs a clandestine ": null
    },
    {
        "transmogrification": "transmogrification"
    },
    {
        " service for people who want to cast off their old selves, flesh and all. We meet the gluttonous Bishop Beesley, and his daughter Mitzi. Eventually Jerry drives the Americans to madness, causing them to burn everything, including themselves.    The English Assassin    : All the supporting characters, particularly Una Persson, drive this novel while Jerry is nothing more than a whimpering heap of rags washed up on a beach and carried in the back of a lorry to safety. There are episodes in settings ranging from the cockpit of a ": null
    },
    {
        "Dornier Do X": "dornier do x"
    },
    {
        ", the deck of an Edwardian sailing ship, the anarchic steppes of revolutionary Russia, and Victorian music-hall. Finally Jerry is able to revive as the character Pierrot, forever mourning his lost Columbine, who is Catherine.    The Condition of Muzak    : Taking its title from the ": null
    },
    {
        "Walter Pater": "walter pater"
    },
    {
        " quote All art constantly aspires towards the condition of music , this is a series of vignettes that cast Jerry as a teenager in Notting Hill, a character in the commedia dellarte, a secret agent and a fool. Particularly notable are the Notting Hill scenes, which seem to reduce all the other parts of the canon to fantasies in the adolescent Jerrys mind. Other scenes fill in detail, if any were needed, between the novels. In the final scene Jerrys foul-mouthed mother dies, and on her deathbed she reveals the familys history as a distorted version of the canon which Jerry and his now-pregnant sister Catherine seem doomed to continue.       Jerry Cornelius, secret agent, superhero, adventurer, all things to all men . A figure of almost complete anarchy. Typically destroys repressive authority. Later exposed as a false ": null
    },
    {
        "Harlequin": "harlequin"
    },
    {
        ", a tragic ": null
    },
    {
        "Pierrot": "pierrot"
    },
    {
        " at heart, or simply an adolescent fantasy.   Miss Brunner, Jerrys opposite. Representing stifling authority. Also follows a more mystical path than Jerrys fatalistic realism.   Bishop Beesley, endlessly corrupt gluttonous villain. Thirsts for power, money, pleasure.   Una Persson, a female version of Jerry, even to the extent of being Catherines lover. In The Condition of Muzak she is revealed to be a true ": null
    },
    {
        "Harlequin": "harlequin"
    },
    {
        ".   Catherine Cornelius, Jerrys sister and incestuous lover. Usually dies tragically. Often pregnant by Jerry. In some stories, a masochistic figure.   Major Nye, a retired British Army officer, participant in secret missions, and Una Perssons sometime lover.   Colonel Pyat, a Russian emigre officer, also a sometime lover of Una Persson.   Cornelius Brunner, proclaimed Messiah of the Age of Science, a ": null
    },
    {
        "hermaphrodite": "hermaphrodite"
    },
    {
        " amalgam of Jerry Cornelius and Miss Brunner in The Final Programme.   Professor Hira, occasionally another of Jerrys lovers. Counterpart to Jerrys character, always calm and in control.   Frank Cornelius, Jerrys scheming brother, ": null
    },
    {
        "Cain": "cain"
    },
    {
        " to Jerrys ": null
    },
    {
        "Abel": "abel"
    },
    {
        ". Usually killed by Jerry, but always returns.   Mrs. Cornelius, fat, libidinous, foul-mouthed mother to Frank, Jerry and Catherine. The quintessential urban survivor, a modern ": null
    },
    {
        "Mother Courage": "mother courage and her children"
    },
    {
        ".   Shaky Mo Collier, a companion on many adventures, and also supplier of many and varied drugs to almost everyone. He almost acts as Jerrys right-hand man always there when needed, although somewhat unreliable in execution of tasks.           The Final Programme   A Cure for Cancer   The English Assassin   The Condition of Muzak   The Lives and Times of Jerry Cornelius   The Adventures of Una Persson and Catherine Cornelius in the Twentieth Century   ": null
    },
    {
        "The Distant Suns": "the distant suns"
    },
    {
        "   Doctor Who: The Coming of the Terraphiles": "the coming of the terraphiles"
    },
    {
        "       The Entropy Tango": "the entropy tango"
    },
    {
        "   The Great Rock n Roll Swindle . Ties the Sex Pistols in with the Cornelius mythos.   ": null
    },
    {
        "The Alchemists Question": "the alchemists question"
    },
    {
        "   Firing the Cathedral": "firing the cathedral"
    },
    {
        "       The Peking Junction   The Delhi Division   The Tank Trapeze   The Nature of the Catastrophe   The Swastika Set-up   The Sunset Perspective   Sea Wolves   Voortrekker   Dead Singers   The Longford Cup   The Entropy Circuit   The Entropy Tango   The Murderers Song   The Gangrene Collection   The Roumanian Question   The Dodgem Decision    All the Way Round Again    The Spencer Inheritance   The Camus Connection   Cheering for the Rockets   Modem Times    A Twist in the Lines   Pegging the President         The Adventures of Jerry Cornelius , co-written with M. John Harrison and illustrated by Mal Dean   Midnight Kiss , written by Tony Lee and illustrated by Ryan Stegman   The Airtight Garage by Moebius.       ": null
    },
    {
        "The Final Programme": "the final programme"
    },
    {
        " was a 42 movie adaptation of The Final Programme, directed by Robert Fuest       In 42 The Entropy Tango & Gloriana Demo Sessions by Michael Moorcock & The Deep Fix was released. These were sessions for planned albums based on two Moorcock novels: Glorianna and The Entropy Tango. Two of the Jerry Cornelius/Entropy Tango tracks were reworked with additional musicians and appeared on the Spirits Burning CD Alien Injection, also released in 42     The Entropy Tango by Spirits Burning    Every Gun Plays Its Own Tune by Spirits Burning    Needle Gun by Hawkwind    Veteran of the Psychic Wars by Blue Öyster Cult    Kings of Speed by Hawkwind          One possible link is Jeronimus Cornelisz who led one of the bloodiest mutinies in history after the merchant ship ": null
    },
    {
        "Batavia": "batavia"
    },
    {
        " was wrecked off the west coast of Australia.         Moorcock encouraged other authors and artists to create works about Jerry Cornelius, in a sort of early open source shared world attempt at open brand sharing. One example is Norman Spinrad s The Last Hurrah of the Golden Horde; another is Mœbius s The ": null
    },
    {
        "Airtight Garage": "airtight garage"
    },
    {
        ".  The Nature of the Catastrophe, a collection of Jerry Cornelius stories and comic strips which had appeared in the ": null
    },
    {
        "International Times": "international times"
    },
    {
        " by various hands, was published in 42 It includes works by Moorcock himself, James Sallis , Brian Aldiss , Langdon Jones , M. John Harrison , Richard Glyn Jones, Alex Krislov and Maxim Jakubowski.     The story  ...the price is worth it.  by Graeme K Talboys and the subsequent novels in the Stormlight quartet  are centred on Charlie Cornelius, a daughter of the Cornelius clan with uncertain parentage.     In comics various writers have used elements of the character, most notably Bryan Talbot s character Luther Arkwright . Currently, Image publishes Matt Fraction s ": null
    },
    {
        "Casanova": "casanova"
    },
    {
        " series which also pays homage to Cornelius. Tony Lee s ": null
    },
    {
        "Midnight Kiss": "midnight kiss"
    },
    {
        " actually features Cornelius, with Michael Moorcocks blessing. . Grant Morrison created an Oscar Wilde -inspired steampunk version of Jerry Cornelius in ": null
    },
    {
        "Sebastian O": "sebastian o"
    },
    {
        ", the original Vertigo mini-series. Another Morrison character, Gideon Stargrave of ": null
    },
    {
        "The Invisibles": "the invisibles"
    },
    {
        ", is one of the few interpretations of the character that Moorcock has issues with, as he considers the character little more than a straight lift of Cornelius.     The name of the protagonist of The Airtight Garage was changed in later editions to Lewis Carnelian . In 42 on his website, Moorcock himself wrote:       Bad Voltage, a 42s cyberpunk novel by Jonathan Littell that also dealt with themes of bisexuality and violence, features guest appearances by a decidedly has-been Jerry Cornelius and a substance-abusing Shaky Mo Collier. The independent comic Elf-Thing featured not only Cornelius but members of his supporting cast in a very close homage. Cornelius is also seen in Alan Moore s ": null
    },
    {
        "The League of Extraordinary Gentlemen: Black Dossier": "the league of extraordinary gentlemen: black dossier"
    },
    {
        " as a child. Cornelius appears in the second part of Alan Moore s three-part comic ": null
    },
    {
        "The League of Extraordinary Gentlemen, Volume III: Century": "the league of extraordinary gentlemen, volume iii: century"
    },
    {
        ". Jerry Cornelius also appears briefly in Neurotwistin, a French novel by Laurent Queyssi .   You can also find a version of Jerry Cornelius in Michael Moorcocks 42 graphic novel Multiverse . There is an ongoing presentation of new Cornelius stories on Moorcocks Jeremiah Cornelius Facebook page.     Carter Kaplan plays a variation on Jerry Cornelius in his novel Tally-Ho, Cornelius!.     Author Bruce Sterling has described his recurring character Leggy Starlitz, star of a series of short stories and the novel Zeitgeist, as a nonlinear descendant of Moorcocks Jerry Cornelius. ": null
    }
]