[
    {
        "   Jerónimo  de Zurita y Castro or simply Jerónimo  de Zurita was a ": null
    },
    {
        "Spanish": "spanish people"
    },
    {
        " historian of the sixteenth century who founded the modern tradition of historical scholarship in Spain.     Born at ": null
    },
    {
        "Zaragoza": "zaragoza"
    },
    {
        ", ": null
    },
    {
        "Kingdom of Aragon": "kingdom of aragon"
    },
    {
        ", he studied at ": null
    },
    {
        "Alcalá de Henares": "alcalá de henares"
    },
    {
        " under the ": null
    },
    {
        "Hellenist": "hellenism"
    },
    {
        " Hernán Nuñez": "hernán nuñez"
    },
    {
        ". Through the influence of his father, ": null
    },
    {
        "Miguel de Zurita": "miguel de zurita"
    },
    {
        ", physician to ": null
    },
    {
        "Charles V, Holy Roman Emperor": "charles v, holy roman emperor"
    },
    {
        ", he entered the public service as magistrate at ": null
    },
    {
        "Barbastro": "barbastro"
    },
    {
        ", and in 42 was appointed assistant-secretary of the ": null
    },
    {
        "Inquisition": "inquisition"
    },
    {
        ". In 42 Zurita was nominated official chronicler of the Kingdom of ": null
    },
    {
        "Aragon": "aragon"
    },
    {
        ", and in 42 ": null
    },
    {
        "Philip II of Spain": "philip ii of spain"
    },
    {
        " attached him as secretary to the council of the Inquisition, delegating to him the conduct of all matters sufficiently important to require the kings signature. Zurita resigned these posts on the January 42 42 obtained a sinecure at Zaragoza, and dedicated himself wholly to the composition of his  Anales de la Corona de Aragón , the first part of which had appeared in 42; he lived to see the last volume printed at Zaragoza on the April 42 42 and died on the November 42 following.     Zuritas style is somewhat crabbed and dry, but his authority is unquestionable; he displayed a new conception of an historians duties, and, not content with the ample materials stored in the Archives of Aragon, continued his researches in the libraries of ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", ": null
    },
    {
        "Naples": "naples"
    },
    {
        " and ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ".       Historians use legends as geographers do fabulous animals-to symbolize unknown countries in their maps - quoted from Spanish Historiography and Iberian Reality by J. N. Hillgarth, History and Theory, Vol. 42 No. 42 , pp.  42–42                                      ": null
    }
]