[
    {
        "              Jesus Christ Superstar is a 42 ": null
    },
    {
        "rock opera": "rock opera"
    },
    {
        " with music by ": null
    },
    {
        "Andrew Lloyd Webber": "andrew lloyd webber"
    },
    {
        " and lyrics by ": null
    },
    {
        "Tim Rice": "tim rice"
    },
    {
        ". The musical started as a rock opera ": null
    },
    {
        "concept album": "jesus christ superstar"
    },
    {
        " before its ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " debut in 42 The musical is mostly ": null
    },
    {
        "sung-through": "sung-through"
    },
    {
        ", with little spoken dialogue. The story is loosely based on the ": null
    },
    {
        "Gospels accounts": "life of jesus in the new testament"
    },
    {
        " of the last week of ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        "s life, beginning with the preparation for the arrival of Jesus and his ": null
    },
    {
        "disciples": "apostle"
    },
    {
        " in Jerusalem and ending with the ": null
    },
    {
        "crucifixion": "crucifixion of jesus"
    },
    {
        ". It depicts political and interpersonal struggles between ": null
    },
    {
        "Judas Iscariot": "judas iscariot"
    },
    {
        " and Jesus that are not present in the ": null
    },
    {
        "Bible": "bible"
    },
    {
        ".     The works depiction offers a free interpretation of the psychology of Jesus and other characters. Much of the plot centers on Judas, who is dissatisfied with the direction in which Jesus is steering his disciples.     Contemporary attitudes, sensibilities, and slang pervade the rock-operas lyrics, and ironic allusions to modern life are scattered throughout the depiction of political events. Stage and film productions accordingly contain many intentional ": null
    },
    {
        "anachronism": "anachronism"
    },
    {
        "s.                ": null
    },
    {
        "Judas Iscariot": "judas iscariot"
    },
    {
        ", one of the ": null
    },
    {
        "Twelve Apostles": "12 apostles"
    },
    {
        ", worries that the followers of Jesus are getting out of control and may be seen as a threat by the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", who might harshly suppress them . The other apostles anticipate going to ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " with Jesus and ask him about his plans, but Jesus tells them not to worry about the future . ": null
    },
    {
        "Mary Magdalene": "mary magdalene"
    },
    {
        " tries to help Jesus relax. Judas tells Jesus that he should not associate with Mary, because a relationship with a prostitute could be seen as inconsistent with his own teachings and be used against him . Jesus tells Judas that he should not judge others unless he is without sin. Jesus then reproaches the apostles and complains that none of them truly cares about him. Mary Magdalene tries to reassure Jesus while anointing him with oil . Judas angrily says that the money spent on oil should have been used to help the poor. Jesus answers that they do not have the resources to end poverty, and that they should be glad for what comforts they have.     Meanwhile, ": null
    },
    {
        "Caiaphas": "caiaphas"
    },
    {
        ", the ": null
    },
    {
        "High Priest of Israel": "high priest of israel"
    },
    {
        ", assembles the ": null
    },
    {
        "Pharisees": "pharisees"
    },
    {
        " and priests. Like Judas they fear that Jesuss followers will be seen as a threat by the Romans, and that many Jews might suffer the consequences. Caiaphas concludes that for the greater good, Jesus must be killed . As Jesus and his followers arrive exultantly in Jerusalem, they are confronted by Caiaphas, who demands that Jesus disperse the crowd. Jesus instead greets the happy crowd . Then ": null
    },
    {
        "Simon the Zealot": "simon the zealot"
    },
    {
        " suggests that Jesus lead his mob in a war against Rome and gain absolute power. Jesus rejects this, stating that none of his followers understand what true power is .     ": null
    },
    {
        "Pontius Pilate": "pontius pilate"
    },
    {
        ", the governor of Judea, has a dream in which he meets a Galilean and then receives the blame for the mans violent death at the hands of a mob . Jesus arrives at the Temple and finds that it is being used as a marketplace; angered by this, he ": null
    },
    {
        "drives everyone out": "cleansing of the temple"
    },
    {
        " . A group of ": null
    },
    {
        "lepers": "leprosy"
    },
    {
        " ask Jesus to heal them. Their number increases, and overwhelmed, Jesus rejects them. Mary Magdalene sings him to sleep. While he sleeps, Mary acknowledges that she is in love with him, and it frightens her .     Conflicted, Judas seeks out the Pharisees and proposes helping them arrest Jesus, believing that Jesus is out of control and that Jesus himself would approve of his action. In exchange for his help, Judas is offered ": null
    },
    {
        "thirty pieces of silver": "thirty pieces of silver"
    },
    {
        ". Judas initially refuses, then accepts when Caiaphas suggests that he can use the money to help the poor .           At the ": null
    },
    {
        "Last Supper": "last supper"
    },
    {
        ", Jesus is stung when the others get drunk and pay little attention to him. He remarks that for all you care the wine they are drinking could be his blood and the bread his body. He asks them to remember him, then frustrated by their lack of understanding, he predicts that ": null
    },
    {
        "Peter": "saint peter"
    },
    {
        " will ": null
    },
    {
        "deny him three times": "denial of peter"
    },
    {
        " that night, and that another one of them will betray him. Judas admits that he is the one who will betray Jesus and, saying that he does not understand why Jesus did not plan things better, he leaves.     The remaining apostles fall asleep, and Jesus retreats to the Garden of Gethsemane to pray . He tells God his doubts about whether his mission has had any success, and angrily demands to know why he should continue and suffer the horrible death that awaits him. Receiving no answer, he realises that he cannot defy Gods will, and surrenders to God.     Judas arrives with Roman soldiers and identifies Jesus by ": null
    },
    {
        "kissing him on the cheek": "kiss of judas"
    },
    {
        " . When Jesus is ": null
    },
    {
        "brought to trial before the Sanhedrin": "sanhedrin trial of jesus"
    },
    {
        ", Caiaphas demands to know if he calls himself the Son of God, and Jesus responds merely Thats what you say . Caiaphas says that this is sufficient evidence and sends him to Pilate. Meanwhile, Peter is confronted by three people, to whom he denies that he knows Jesus . Mary observes that Jesus had predicted this.     Pilate asks Jesus if he is the King of the Jews. Jesus again answers Thats what you say . Since Jesus is from Galilee, Pilate says that he is not under his jurisdiction and sends him to ": null
    },
    {
        "King Herod": "herod antipas"
    },
    {
        " . The flamboyant King Herod asks Jesus to prove his divinity by performing miracles , but Jesus ignores him. Herod angrily sends him back to Pilate. In the Broadway production a scene is added wherein Mary Magdalene, Peter, and the apostles remember when they first began following Jesus, and wish that they could return to a time of peace .     Judas is horrified at Jesuss harsh treatment. He expresses regret to the Pharisees, fearing that he will forever be remembered as a traitor. Caiaphas and Annas assure him that he has done the right thing. Judas throws down the money he was given and storms out. He curses God for manipulating him, and commits suicide .     At Jesuss trial, Pilate attempts to interrogate Jesus, but is cut off by a bloodthirsty mob which demands that Jesus be ": null
    },
    {
        "crucified": "crucifixion"
    },
    {
        ". In the Broadway production, a stanza is added where Pilate admonishes the crowd for their sudden respect for Caesar, as well as for how they produce Messiahs by the sackful ; this was kept for the film and subsequent productions. He tells the mob that Jesus has committed no crime and does not deserve to die, but to satisfy the mob he will have Jesus ": null
    },
    {
        "flogged": "flagellation of christ"
    },
    {
        " . Pilate pleads with Jesus to defend himself, but Jesus says weakly that everything has been determined by God. The crowd still calls for Jesuss death and finally Pilate reluctantly agrees to crucify Jesus.     As Jesus awaits crucifixion, he is haunted by the ghost of Judas, who asks why Jesus chose to arrive in the manner and time that he did, and if it was all part of a divine plan . Jesus is crucified, recites his final words and dies .                  42 ": null
    },
    {
        "flute": "flute"
    },
    {
        "s, ": null
    },
    {
        "clarinet": "clarinet"
    },
    {
        ", 42 ": null
    },
    {
        "bassoon": "bassoon"
    },
    {
        "s, 42 ": null
    },
    {
        "saxophone": "saxophone"
    },
    {
        "s , 42 ": null
    },
    {
        "horn": "horn"
    },
    {
        "s, 42 ": null
    },
    {
        "trumpet": "trumpet"
    },
    {
        "s, 42 ": null
    },
    {
        "trombone": "trombone"
    },
    {
        "s, ": null
    },
    {
        "drum set": "drum kit"
    },
    {
        ", percussion set, 42 ": null
    },
    {
        "guitar": "guitar"
    },
    {
        "s , 42 ": null
    },
    {
        "piano": "piano"
    },
    {
        "s, ": null
    },
    {
        "electric piano": "electric piano"
    },
    {
        ", 42 ": null
    },
    {
        "organ": "organ"
    },
    {
        "s, ": null
    },
    {
        "positive organ": "positive organ"
    },
    {
        ", and ": null
    },
    {
        "strings": "string instrument"
    },
    {
        ". Additional vocals are provided by a ": null
    },
    {
        "choir": "choir"
    },
    {
        ", a ": null
    },
    {
        "childrens choir": "boys choir"
    },
    {
        " , and other singers . Credits listing on the original album.             Act One ": null
    },
    {
        "Everythings Alright": "everythings alright"
    },
    {
        " – Mary, Judas, Jesus, Women, Apostles   ": null
    },
    {
        "This Jesus Must Die": "this jesus must die"
    },
    {
        " – Caiaphas, Annas, Priests   Hosanna – Jesus, Caiaphas and Company   Simon Zealotes/Poor Jerusalem - Jesus, Simon and Company   Pilates Dream – Pilate   The Temple – Jesus, Ensemble   Everythings Alright – Mary, Jesus   ": null
    },
    {
        "I Dont Know How to Love Him": "i dont know how to love him"
    },
    {
        " – Mary   Damned For All Time/Blood Money - Judas, Annas, Caiaphas, Choir      Act Two ": null
    },
    {
        "King Herods Song": "king herods song"
    },
    {
        " – Herod and Company   Could We Start Again Please? – Mary and Peter   Judas Death – Judas, Annas, Caiaphas, Ensemble   Trial Before Pilate – Pilate, Caiaphas, Jesus, Ensemble   ": null
    },
    {
        "Superstar": "superstar"
    },
    {
        " – Judas, Soul Sisters, Angels   The Crucifixion – Jesus, Ensemble   John Nineteen: Forty-One – Orchestra                  The songs were first written and conceived as a ": null
    },
    {
        "concept album": "concept album"
    },
    {
        ", before the musical was created and staged.  On the original album, the part of Jesus was sung by ": null
    },
    {
        "Ian Gillan": "ian gillan"
    },
    {
        ", with ": null
    },
    {
        "Murray Head": "murray head"
    },
    {
        " as Judas, ": null
    },
    {
        "Michael dAbo": "mike dabo"
    },
    {
        " as ": null
    },
    {
        "King Herod": "herod antipas"
    },
    {
        ", ": null
    },
    {
        "Yvonne Elliman": "yvonne elliman"
    },
    {
        " as Mary Magdalene, and ": null
    },
    {
        "Barry Dennen": "barry dennen"
    },
    {
        " as Pilate. In July 42 the first authorised American concert of the ": null
    },
    {
        "rock opera": "rock opera"
    },
    {
        " took place in front of an audience of 42 people at ": null
    },
    {
        "Pittsburgh": "pittsburgh"
    },
    {
        ", Pennsylvanias ": null
    },
    {
        "Civic Arena": "civic arena"
    },
    {
        " with ": null
    },
    {
        "Jeff Fenholt": "jeff fenholt"
    },
    {
        " singing the role of Jesus, ": null
    },
    {
        "Carl Anderson": "carl anderson"
    },
    {
        " as Judas and Elliman repeating as Mary Magdalene.  Entertainment Weekly , 42 July 42         The musical opened on Broadway on 42 October 42 directed by ": null
    },
    {
        "Tom OHorgan": "tom ohorgan"
    },
    {
        ", at the ": null
    },
    {
        "Mark Hellinger Theatre": "mark hellinger theatre"
    },
    {
        ". It starred ": null
    },
    {
        "Jeff Fenholt": "jeff fenholt"
    },
    {
        " as Jesus, ": null
    },
    {
        "Ben Vereen": "ben vereen"
    },
    {
        " as Judas and ": null
    },
    {
        "Bob Bingham": "bob bingham"
    },
    {
        " as Caiaphas. Dennen and Elliman played the roles that they had sung on the album. ": null
    },
    {
        "Kurt Yaghjian": "kurt yaghjian"
    },
    {
        " was Annas. Anderson replaced Vereen when he fell ill, and the two performers later took turns playing the role. The show closed on 42 June 42 after 42 performances. The production received mixed reviews;   the bold casting of African-Americans as Judas was lauded, but reviewer ": null
    },
    {
        "Clive Barnes": "clive barnes"
    },
    {
        " from  The New York Times  said, the real disappointment was not in the music ... but in the conception.   The show was nominated for five ": null
    },
    {
        "Tony Award": "tony award"
    },
    {
        "s, including Best Score, but won none. Lloyd Webber won a ": null
    },
    {
        "Drama Desk Award": "drama desk award"
    },
    {
        " as Most Promising Composer , and Vereen won a ": null
    },
    {
        "Theatre World Award": "theatre world award"
    },
    {
        ".       The Broadway show and subsequent productions were condemned by some religious groups. Tim Rice was quoted as saying It happens that we dont see Christ as God but simply the right man at the right time at the right place. Time magazine, 42 November 42 Rice went on to say we are basically trying to tell the story of Christ as a man. I think he increases in stature by looking at him as a man. Life magazine, 42 May 42 Some ": null
    },
    {
        "Christians": "christians"
    },
    {
        " considered such comments to be ": null
    },
    {
        "blasphemous": "blasphemy"
    },
    {
        ", the character of Judas too sympathetic and some of his criticisms of Jesus offensive.  The musicals lack of allusion to the ": null
    },
    {
        "resurrection of Jesus": "resurrection of jesus"
    },
    {
        " has resulted in criticism similar to that of fellow musical  Godspell , which also did not clearly depict the resurrection.     At the same time, some ": null
    },
    {
        "Jew": "jew"
    },
    {
        "s claimed that it bolstered the ": null
    },
    {
        "antisemitic": "antisemitism"
    },
    {
        " belief that the Jews were responsible for Jesuss death by showing most of the villains as Jewish  and showing the crowd in Jerusalem calling for the crucifixion. , The New York Times  The musical was banned in South Africa for being ": null
    },
    {
        "irreligious": "irreligion"
    },
    {
        " .   A 42 production of the play was banned in the ": null
    },
    {
        "Hungarian Peoples Republic": "hungarian peoples republic"
    },
    {
        " for distribution of religious propaganda .           Superstar opened at the ": null
    },
    {
        "Palace Theatre": "palace theatre, london"
    },
    {
        " in London in 42 starring ": null
    },
    {
        "Paul Nicholas": "paul nicholas"
    },
    {
        " as Jesus, ": null
    },
    {
        "Stephen Tate": "stephen tate"
    },
    {
        " as Judas and ": null
    },
    {
        "Dana Gillespie": "dana gillespie"
    },
    {
        " as Mary Magdalene. It was directed by Australian ": null
    },
    {
        "Jim Sharman": "jim sharman"
    },
    {
        ". This production was much more successful than the original production on Broadway, running for eight years and becoming the United Kingdoms longest-running musical at the time. ": null
    },
    {
        "Dmitri Shostakovich": "dmitri shostakovich"
    },
    {
        " attended this production in London just before his death. He regretted that he could not have composed something like it; he lauded especially a rock band underpinning full symphonic strings, brass and woodwind.      One of the earliest foreign productions was ": null
    },
    {
        "a five-day run in Sweden": "jesus christ superstar"
    },
    {
        " at ": null
    },
    {
        "Scandinavium": "scandinavium"
    },
    {
        " in ": null
    },
    {
        "Gothenburg": "gothenburg"
    },
    {
        ", opening on 42 February 42 and playing to 42 people . Starring as Mary Magdalene was ": null
    },
    {
        "Agnetha Fältskog": "agnetha fältskog"
    },
    {
        ". On 42 March 42 an oratorio version was performed at ": null
    },
    {
        "Memorial Drive Park": "memorial drive park"
    },
    {
        " in Adelaide, South Australia as part of the ": null
    },
    {
        "Adelaide Festival of the Arts": "adelaide festival of the arts"
    },
    {
        ".  This was followed in May by the first full Australian production, at the ": null
    },
    {
        "Capitol Theatre, Sydney": "capitol theatre, sydney"
    },
    {
        ", later moving to the ": null
    },
    {
        "Palais Theatre": "palais theatre"
    },
    {
        " in Melbourne.  Sharman again directed, and the cast included Trevor White as Jesus, ": null
    },
    {
        "Jon English": "jon english"
    },
    {
        " as Judas, and ": null
    },
    {
        "Michele Fawdon": "michele fawdon"
    },
    {
        " and ": null
    },
    {
        "Marcia Hines": "marcia hines"
    },
    {
        " as Mary Magdalene. Hines was the first black woman to play the role. Other cast members included ": null
    },
    {
        "Reg Livermore": "reg livermore"
    },
    {
        ", ": null
    },
    {
        "John Paul Young": "john paul young"
    },
    {
        ", ": null
    },
    {
        "Stevie Wright": "stevie wright"
    },
    {
        ", and ": null
    },
    {
        "Graham Russell": "graham russell"
    },
    {
        " and ": null
    },
    {
        "Russell Hitchcock": "russell hitchcock"
    },
    {
        ", who met during the production and subsequently formed the band ": null
    },
    {
        "Air Supply": "air supply"
    },
    {
        ". The production ran until February 42 In June 42 the show opened in ": null
    },
    {
        "Belgrade": "belgrade"
    },
    {
        ", ": null
    },
    {
        "Yugoslavia": "sfry"
    },
    {
        ", in ": null
    },
    {
        "Atelje 42": "atelje 212"
    },
    {
        " theatre, in adaptation by ": null
    },
    {
        "Jovan Ćirilov": "jovan ćirilov"
    },
    {
        ".  The role of Jesus Christ was played by ": null
    },
    {
        "Korni Grupa": "korni grupa"
    },
    {
        " vocalist ": null
    },
    {
        "Zlatko Pejaković": "zlatko pejaković"
    },
    {
        ", the role of Mary Magdalene by Azra Halinović and the role of Pontius Pilate by ": null
    },
    {
        "Branko Milićević": "branko milićević"
    },
    {
        ". The premiere was directly broadcast by ": null
    },
    {
        "Radio Television of Belgrade": "radio television of belgrade"
    },
    {
        ". ": null
    },
    {
        "Bora Đorđević": "bora đorđević"
    },
    {
        " and ": null
    },
    {
        "Srđan Marjanović": "srđan marjanović"
    },
    {
        ", at the time little known musicians, also participated as members of the choir.   The production was praised by the Yugoslav public.     In 42 the show opened in Paris at the ": null
    },
    {
        "Théâtre de Chaillot": "théâtre national de chaillot"
    },
    {
        " in a French adaptation by ": null
    },
    {
        "Pierre Delanoë": "pierre delanoë"
    },
    {
        ". The title role was sung by ": null
    },
    {
        "Daniel Beretta": "daniel beretta"
    },
    {
        ", and Mary Magdalena was ": null
    },
    {
        "Anne-Marie David": "anne-marie david"
    },
    {
        ". The critics were unimpressed, and the production stopped after 42 performances. In the same year, ": null
    },
    {
        "Noel Pearson": "noel pearson"
    },
    {
        " produced the show at the ": null
    },
    {
        "Gaiety Theatre, Dublin": "gaiety theatre, dublin"
    },
    {
        ", ": null
    },
    {
        "Republic of Ireland": "republic of ireland"
    },
    {
        ", with ": null
    },
    {
        "Luke Kelly": "luke kelly"
    },
    {
        " giving a critically acclaimed performance as King Herod.  In 42 first Spanish-language production ran in Mexico with the title Jesucristo Super Estrella . ": null
    },
    {
        "Julissa": "julissa"
    },
    {
        " played Mary Magdalen. The musical was seen in 42 in Peru and Singapore.      ": null
    },
    {
        "Robert Stigwood": "robert stigwood"
    },
    {
        " launched two road touring companies in 42 to cover North America, with ": null
    },
    {
        "Robert Corff": "robert corff"
    },
    {
        " and Tom Westerman as Jesus, respectively. The first major US National Tour, however began In 42 managed by ": null
    },
    {
        "Laura Shapiro Kramer": "laura shapiro kramer"
    },
    {
        ". The tour continued until 42 In 42 the show had its first Broadway revival, running from 42 November 42 to 42 February 42 It was directed by William Daniel Grey, with choreography by Kelly Carrol and starred William Daniel Grey as Jesus, Patrick Jude as Judas, and Barbara Niles as Mary Magdalene.  Regional productions followed.     In 42 Emilio de Soto directed an English-language version in Venezuela, with 42 actors. From 42 to 42 an Australian production toured Australia and South-East Asia, directed by Trevor White, who also reprised his role of Jesus. The cast included ": null
    },
    {
        "Doug Parkinson": "doug parkinson"
    },
    {
        " as Judas and ": null
    },
    {
        "Marcia Hines": "marcia hines"
    },
    {
        " .       The ": null
    },
    {
        "North America": "north america"
    },
    {
        "n touring revival of Superstar in 42 starred Neeley and Anderson reprising their respective Broadway and ": null
    },
    {
        "42 film roles": "jesus christ superstar"
    },
    {
        " as Jesus and Judas, receiving positive reviews for their performances. This production also starred both ": null
    },
    {
        "Dennis DeYoung": "dennis deyoung"
    },
    {
        " as Pilate, and ": null
    },
    {
        "Syreeta": "syreeta"
    },
    {
        " and ": null
    },
    {
        "Irene Cara": "irene cara"
    },
    {
        " sharing Mary Magdalene. Originally expected to run for three to four months, the tour ended up running for five years. Original cast replacements to this tour included Christine Rea as Mary Magdalene, ": null
    },
    {
        "Jason Raize": "jason raize"
    },
    {
        " as Pontius Pilate and ": null
    },
    {
        "Simone": "simone"
    },
    {
        " as the Maid by the Fire and understudy for Mary. In 42 a New Zealand production starred Darryl Lovegrove as Jesus, ": null
    },
    {
        "Jay Lagaaia": "jay lagaaia"
    },
    {
        " as Judas and ": null
    },
    {
        "Frankie Stevens": "frankie stevens"
    },
    {
        " as Caiaphas. Also in 42 a stage version titled Jesus Christ Superstar: A Resurrection was performed in ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        ", ": null
    },
    {
        "Austin": "austin, texas"
    },
    {
        " and ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        " featuring ": null
    },
    {
        "Amy Ray": "amy ray"
    },
    {
        " as Jesus, ": null
    },
    {
        "Emily Saliers": "emily saliers"
    },
    {
        " as Mary Magdalene and ": null
    },
    {
        "Michael Lorant": "michael lorant"
    },
    {
        " as Judas.     In 42 the musical was revived in London at the ": null
    },
    {
        "Lyceum Theatre": "lyceum theatre, london"
    },
    {
        " and ran for a year and a half. Directed by ": null
    },
    {
        "Gale Edwards": "gale edwards"
    },
    {
        ", it starred ": null
    },
    {
        "Steve Balsamo": "steve balsamo"
    },
    {
        " and ": null
    },
    {
        "Zubin Varla": "zubin varla"
    },
    {
        " as Jesus and Judas, and ": null
    },
    {
        "Joanna Ampil": "joanna ampil"
    },
    {
        " as Mary Magdalene and ": null
    },
    {
        "Alice Cooper": "alice cooper"
    },
    {
        " as King Herod. The production was nominated for a ": null
    },
    {
        "Olivier Award": "laurence olivier award"
    },
    {
        " for Best Musical Revival but did not win. It was followed by a UK tour. This production was revived on Broadway at the ": null
    },
    {
        "Ford Center for the Performing Arts": "foxwoods theatre"
    },
    {
        " in 42 starring ": null
    },
    {
        "Glenn Carter": "glenn carter"
    },
    {
        " as Jesus and ": null
    },
    {
        "Tony Vincent": "tony vincent"
    },
    {
        " as Judas. It opened to mixed reviews and ran for 42 performances.  It was nominated for a Tony Award for Best Revival of a Musical but did not win. In 42 a national tour starred ": null
    },
    {
        "Sebastian Bach": "sebastian bach"
    },
    {
        " as Jesus and Anderson once again as Judas. Bach received mixed reviews while Anderson was again praised. In April 42 Bach was replaced by ": null
    },
    {
        "Eric Kunze": "eric kunze"
    },
    {
        ". Anderson left the show later in 42 after being diagnosed with leukaemia and died in 42 The tour closed shortly after Andersons departure.     In 42 a year-long UK tour began, directed by Bob Tomson and ": null
    },
    {
        "Bill Kenwright": "bill kenwright"
    },
    {
        ". Carter reprised his role as Jesus, with ": null
    },
    {
        "James Fox": "james fox"
    },
    {
        " as Judas. In 42 a successful Scandinavian tour starred Australian Peter Murphy , American Kristen Cummings , Englishman Jon Boydon née Stokes , Frenchman ": null
    },
    {
        "Jérôme Pradon": "jérôme pradon"
    },
    {
        " and Australian Michael-John Hurney . A US tour starring Neeley, reprising his role as Jesus, ": null
    },
    {
        "Corey Glover": "corey glover"
    },
    {
        " as Judas, and Christine Rea as Mary, began in 42 and played for five years. A Chilean ": null
    },
    {
        "heavy metal": "heavy metal music"
    },
    {
        " version has played annually in ": null
    },
    {
        "Santiago": "santiago"
    },
    {
        " since 42  In Boston, ": null
    },
    {
        "Gary Cherone": "gary cherone"
    },
    {
        " portrayed Jesus in productions in 42 42 and 42 and Judas in 42       A new production of Jesus Christ Superstar was mounted at the ": null
    },
    {
        "Stratford Shakespeare Festival": "stratford shakespeare festival"
    },
    {
        ", in ": null
    },
    {
        "Stratford, Ontario": "stratford, ontario"
    },
    {
        ", in 42 Directed by ": null
    },
    {
        "Des McAnuff": "des mcanuff"
    },
    {
        ", the cast starred Paul Nolan as Jesus, ": null
    },
    {
        "Josh Young": "josh young"
    },
    {
        " as Judas, ": null
    },
    {
        "Brent Carver": "brent carver"
    },
    {
        " as Pilate, ": null
    },
    {
        "Chilina Kennedy": "chilina kennedy"
    },
    {
        " as Mary Magdalene, ": null
    },
    {
        "Bruce Dow": "bruce dow"
    },
    {
        " as Herod and ": null
    },
    {
        "Melissa ONeil": "melissa oneil"
    },
    {
        " as Martha. This moved to ": null
    },
    {
        "La Jolla Playhouse": "la jolla playhouse"
    },
    {
        " later in the year and transferred to the ": null
    },
    {
        "Neil Simon Theatre": "neil simon theatre"
    },
    {
        " on Broadway in 42 with ": null
    },
    {
        "Tom Hewitt": "tom hewitt"
    },
    {
        " taking over the role of Pilate.  Reviews were mixed.   The revival was nominated for two Tonys: Best Revival and, for Young, Best Actor.  Neither award was won, but Young won a ": null
    },
    {
        "Theatre World Award": "theatre world award"
    },
    {
        ". The revival closed after 42 performances and 42 previews.      Through a 42 ": null
    },
    {
        "ITV": "itv"
    },
    {
        " competition TV show called  Superstar , produced by ": null
    },
    {
        "Andrew Lloyd Webber": "andrew lloyd webber"
    },
    {
        ", the UK public chose ": null
    },
    {
        "Ben Forster": "ben forster"
    },
    {
        " for the role of Jesus in an ": null
    },
    {
        "arena": "arena"
    },
    {
        " tour of the musical, beginning at ": null
    },
    {
        "O42": "the o2 arena"
    },
    {
        " in September 42  The production also starred ": null
    },
    {
        "Tim Minchin": "tim minchin"
    },
    {
        " as Judas, ": null
    },
    {
        "Melanie C": "melanie c"
    },
    {
        " as Mary Magdalene and ": null
    },
    {
        "Chris Moyles": "chris moyles"
    },
    {
        " as King Herod.  Lloyd Webber stated, The funny thing is that Jesus Christ Superstar is what we actually intended it to be. When it is done in a conventional proscenium theatre production it feels shoe-horned in. That is why I wanted to do this. The tour resumed in March 42 in the UK, and an Australian leg of the tour commenced in Perth in May 42  ": null
    },
    {
        "Andrew OKeefe": "andrew okeefe"
    },
    {
        " played King Herod in Australia, with ": null
    },
    {
        "Jon Stevens": "jon stevens"
    },
    {
        " as Pilate. Stevens had played Judas in an Australian arena tour in 42       In 42 celebrating 42 years since the musical debuted on Broadway, Jesus Christ Superstar returned to London at ": null
    },
    {
        "Regents Park Open Air Theatre": "regents park open air theatre"
    },
    {
        ", directed by ": null
    },
    {
        "Timothy Sheader": "timothy sheader"
    },
    {
        ". The production won the ": null
    },
    {
        "BBC Radio 42": "bbc radio 2"
    },
    {
        " Audience Award for Best Musical at the ": null
    },
    {
        "Evening Standard Theatre Awards": "evening standard theatre awards"
    },
    {
        ",  and a ": null
    },
    {
        "Laurence Olivier Award": "laurence olivier award"
    },
    {
        " for Best Musical Revival.  The production returned to the Open Air Theatre as part of the 42 season, running from 42 August 42 to 42 September.  Additionally, the ": null
    },
    {
        "Lyric Opera of Chicago": "lyric opera of chicago"
    },
    {
        " hosted a run of the production from late April 42 to late May 42 LyricOpera.com before returning to London at the ": null
    },
    {
        "Barbican Centre": "barbican centre"
    },
    {
        " from 42 July to 42 August 42 prior to a 42th anniversary US tour from October 42             Two notable Jesuses were ": null
    },
    {
        "Takeshi Kaga": "takeshi kaga"
    },
    {
        ", in the 42 Japanese production, and ": null
    },
    {
        "Camilo Sesto": "camilo sesto"
    },
    {
        " in the 42 Spanish production. Mary Magdalene was ": null
    },
    {
        "Rocío Banquells": "rocío banquells"
    },
    {
        " in a 42 production in Mexico. A Czech version premiered in 42 in ": null
    },
    {
        "Prague": "prague"
    },
    {
        "s Spirála Theatre and ran until 42 with 42 performances.  In the 42s, a Venezuelan production ran for two years , directed by ": null
    },
    {
        "Michel Hausmann": "michel hausmann"
    },
    {
        ". A Spanish production produced by ": null
    },
    {
        "Stage Entertainment": "stage entertainment"
    },
    {
        " ran from 42 to 42 followed by long-running productions in Italy and Sweden  and Norway.     Concerts of the show have been mounted in Vienna, Austria, since 42 including one on Easter of 42 starring ": null
    },
    {
        "Drew Sarich": "drew sarich"
    },
    {
        " in the title role. , Musical Vienna, accessed 42 September 42     In 42 an Australian production presented by ": null
    },
    {
        "Harvest Rain Theatre Company": "harvest rain theatre company"
    },
    {
        " was directed by ": null
    },
    {
        "Tim OConnor": "tim oconnor"
    },
    {
        ". ": null
    },
    {
        "Luke Kennedy": "luke kennedy"
    },
    {
        " appeared as Jesus, ": null
    },
    {
        "Naomi Price": "naomi price"
    },
    {
        " as Mary, ": null
    },
    {
        "Tod Strike": "tod strike"
    },
    {
        " as Judas, and ": null
    },
    {
        "Steven Tandy": "steven tandy"
    },
    {
        " as Herod. A 42 Professional Australian Production was staged at the ": null
    },
    {
        "Arts Centre Melbourne": "arts centre melbourne"
    },
    {
        " and starred ": null
    },
    {
        "Rob Mills": "rob mills"
    },
    {
        " as Jesus.     A 42 production in ": null
    },
    {
        "São Paulo": "são paulo"
    },
    {
        ", Brazil starred ": null
    },
    {
        "Igor Rickli": "igor rickli"
    },
    {
        " as Jesus. ": null
    },
    {
        "Negra Li": "negra li"
    },
    {
        " was Mary Magdalene.  A 42 production in ": null
    },
    {
        "Lima": "lima"
    },
    {
        ", Peru, at the Sarita Colonia prison, as part of a rehabilitation program for inmates, received some press.  Eighty prisoners mounted the production, directed by inmate Freddy Battifora, who also played the role of Jesus.  The Catholic Church approved of the production.     In 42 a new production, directed by Michael Hunt was premiered at the Academic Theatre - Teatr-Teatr in Perm City, Russia. Hunt worked closely with The Really Useful Group on a new translation together with the concept for a new staging. This rock opera is very popular in Russia but is the first authorised production to receive the support of the Really Useful Group.       The ": null
    },
    {
        "original 42 concept album": "jesus christ superstar"
    },
    {
        " was very popular; its 42 release topped the US ": null
    },
    {
        "Billboard Pop Albums": "billboard"
    },
    {
        ".  The ": null
    },
    {
        "42 and 42 Australian cast recordings": "jesus christ superstar"
    },
    {
        " were also both highly successful.      In 42 a studio recording under the name of Jesus Christ Superstar: A Resurrection was released.     A 42 radio production for ": null
    },
    {
        "BBC Radio 42": "bbc radio 2"
    },
    {
        " starred ": null
    },
    {
        "Tony Hadley": "tony hadley"
    },
    {
        " as Jesus, ": null
    },
    {
        "Roger Daltrey": "roger daltrey"
    },
    {
        " as Judas, ": null
    },
    {
        "Frances Ruffelle": "frances ruffelle"
    },
    {
        " as Mary Magdalene and ": null
    },
    {
        "Julian Clary": "julian clary"
    },
    {
        " as King Herod; this production was re-broadcast on ": null
    },
    {
        "BBC Radio 42 Extra": "bbc radio 4 extra"
    },
    {
        " on 42 August 42      In May 42 Aztec Records released a 42 live recording of the Australian production; previous recordings of that production were released as bootleg copies.        A ": null
    },
    {
        "film adaptation of Jesus Christ Superstar": "jesus christ superstar"
    },
    {
        " was released in 42 and was the eighth highest-grossing film of that year. The film, directed by ": null
    },
    {
        "Norman Jewison": "norman jewison"
    },
    {
        ", was shot in ": null
    },
    {
        "Israel": "israel"
    },
    {
        "  and other Middle Eastern locations. ": null
    },
    {
        "Ted Neeley": "ted neeley"
    },
    {
        ", ": null
    },
    {
        "Carl Anderson": "carl anderson"
    },
    {
        " and ": null
    },
    {
        "Yvonne Elliman": "yvonne elliman"
    },
    {
        " were each nominated for a ": null
    },
    {
        "Golden Globe Award": "31st golden globe awards"
    },
    {
        " for their portrayals of Jesus, Judas and Mary Magdalene, respectively. ": null
    },
    {
        "Bob Bingham": "bob bingham"
    },
    {
        " and ": null
    },
    {
        "Barry Dennen": "barry dennen"
    },
    {
        " also reprised their roles. A new song, called Then We Are Decided and phrased as a dialogue between Caiaphas and Annas, was written and composed for this adaptation.     A second adaptation was filmed in 42 and released around the world on video in 42 and 42 . TimRice.co.uk. Retrieved 42 October 42 It starred ": null
    },
    {
        "Glenn Carter": "glenn carter"
    },
    {
        " as Jesus, ": null
    },
    {
        "Jérôme Pradon": "jérôme pradon"
    },
    {
        " as Judas, Reneé Castle as Mary Magdalene, and ": null
    },
    {
        "Rik Mayall": "rik mayall"
    },
    {
        " as Herod, and was directed by ": null
    },
    {
        "Gale Edwards": "gale edwards"
    },
    {
        " and ": null
    },
    {
        "Nick Morris": "nick morris"
    },
    {
        ". It was released on video in the UK in October 42 .  BBC News . 42 October 42 In the U.S. it was released on VHS and DVD in March 42 and aired on ": null
    },
    {
        "PBS": "pbs"
    },
    {
        "s  Great Performances  series in April 42 Ehren, Christine. .  Playbill . April 42 42 It won the ": null
    },
    {
        "International Emmy Award": "international emmy award"
    },
    {
        " for Best Performing Arts Film in November 42 Guider, Elizabeth. .  Variety . 42 November 42 The style of the film is more like the stage version than the location-based 42 adaptation, and it used many of the ideas from the 42–42 UK production.       On Easter Sunday, April 42 42 ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " aired a ": null
    },
    {
        "live concert version of the show": "jesus christ superstar live in concert"
    },
    {
        " featuring ": null
    },
    {
        "John Legend": "john legend"
    },
    {
        " as Jesus, ": null
    },
    {
        "Sara Bareilles": "sara bareilles"
    },
    {
        " as Mary Magdalene, ": null
    },
    {
        "Brandon Victor Dixon": "brandon victor dixon"
    },
    {
        " as Judas, ": null
    },
    {
        "Alice Cooper": "alice cooper"
    },
    {
        " as King Herod, ": null
    },
    {
        "Norm Lewis": "norm lewis"
    },
    {
        " as Caiaphas, ": null
    },
    {
        "Ben Daniels": "ben daniels"
    },
    {
        " as Pilate, Jin Ha as Annas, ": null
    },
    {
        "Erik Grönwall": "erik grönwall"
    },
    {
        " as Simon Zealotes and ": null
    },
    {
        "Jason Tam": "jason tam"
    },
    {
        " as Peter.         ": null
    }
]