[
    {
        "        A jetboat is a ": null
    },
    {
        "boat": "boat"
    },
    {
        " propelled by a jet of water ejected from the back of the craft. Unlike a ": null
    },
    {
        "powerboat": "powerboat"
    },
    {
        " or ": null
    },
    {
        "motorboat": "motorboat"
    },
    {
        " that uses an external ": null
    },
    {
        "propeller": "propeller"
    },
    {
        " in the water below or behind the boat, a jetboat draws the water from under the boat through an ": null
    },
    {
        "intake": "intake"
    },
    {
        " and into a ": null
    },
    {
        "pump-jet": "pump-jet"
    },
    {
        " inside the boat, before expelling it through a ": null
    },
    {
        "nozzle": "nozzle"
    },
    {
        " at the ": null
    },
    {
        "stern": "stern"
    },
    {
        ".     Jetboats were originally designed by ": null
    },
    {
        "Sir William Hamilton": "bill hamilton"
    },
    {
        " for operation in the fast-flowing and shallow rivers of ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ", specifically to overcome the problem of propellers striking rocks in such waters.     Previous attempts at waterjet propulsion had very short lifetimes, generally due to the inefficient design of the units and the fact that they offered few advantages over conventional propellers. Unlike these previous waterjet developments, such as ": null
    },
    {
        "Campinis": "secondo campini"
    },
    {
        " and the Hanley Hydrojet, Hamilton had a specific need for a propulsion system to operate in very shallow water, and the waterjet proved to be the ideal solution. From this, the popularity of the jet unit and jetboat increased rapidly. Through further developments, it was found the waterjet offered several other advantages over propellers for a wide range of vessel types, and as such, waterjets are used widely today for many high-speed vessels, including passenger ferries, rescue craft, patrol boats and offshore supply vessels.     Jetboats are highly maneuverable, and many can, from full speed, be reversed and brought to a stop within little more than their own length, in a maneuver known as a crash stop . The well known Hamilton turn or jet spin is a high-speed maneuver where the boats engine throttle is cut, the steering is turned sharply and the throttle opened again, causing the boat to spin quickly around with a large spray of water.     There is no engineering limit to the size of jetboats, though the validity of their use depends a lot on the type of application. Classic prop-drives are generally more efficient and economical at low speeds, up to about , but as boat speed increases beyond this, the extra ": null
    },
    {
        "hull": "hull"
    },
    {
        " resistance generated by struts, ": null
    },
    {
        "rudder": "rudder"
    },
    {
        "s, shafts means waterjets are more efficient in the 42–42 knot range . Also, in situations with very large propellers turning at slow speeds , the equivalent size waterjet would be too big to be practical. For these reasons, the vast majority of waterjet units are installed in high-speed vessels and in particular situations where shallow draught, maneuverability, and load flexibility are main concerns.     The biggest jet-driven vessels are found in military use or the high-speed passenger/car ferry industry. South Africas  s  and the United States ": null
    },
    {
        "Littoral Combat Ship": "littoral_combat_ship"
    },
    {
        " are among the biggest jet-propelled vessels so far. Even these vessels are capable of performing crash stops .            A conventional screw propeller works within the body of water below a boat hull, effectively screwing through the water to drive a vessel forward by generating a difference in pressure between the forward and rear surfaces of the propeller blades and by ": null
    },
    {
        "accelerating": "acceleration"
    },
    {
        " a mass of water rearward. By contrast, a waterjet unit delivers a high-pressure push from the stern of a vessel by accelerating a volume of water as it passes through a specialised pump mounted above the waterline inside the boat hull. Both methods yield thrust due to ": null
    },
    {
        "Newton": "isaac newton"
    },
    {
        "s ": null
    },
    {
        "third law": "newtons laws of motion"
    },
    {
        "— every action has an equal and opposite reaction.     In a jetboat, the waterjet draws water from beneath the hull, where it passes through a series of ": null
    },
    {
        "impeller": "impeller"
    },
    {
        "s and ": null
    },
    {
        "stator": "stator"
    },
    {
        "s – known as stages – which increase the velocity of the waterflow. Most modern jets are single-stage, while older waterjets may have as many as three stages. The tail section of the waterjet unit extends out through the ": null
    },
    {
        "transom": "transom"
    },
    {
        " of the hull, above the waterline. This jetstream exits the unit through a small nozzle at high velocity to push the boat forward. Steering is accomplished by moving this nozzle to either side, or less commonly, by small gates on either side that deflect the jetstream. Because the jetboat relies on the flow of water through the nozzle for control, it is not possible to steer a conventional jetboat without the engine running.          Unlike conventional propeller systems where the rotation of the propeller is reversed to provide astern movement, a waterjet will continue to pump normally while a deflector is lowered into the jetstream after it leaves the outlet nozzle. This deflector redirects thrust forces forward to provide reverse thrust. Most highly developed reverse deflectors redirect the jetstream down and to each side to prevent recirculation of the water through the jet again, which may cause aeration problems, or increase reverse thrust. Steering is still available with the reverse deflector lowered so the vessel will have full maneuverability. With the deflector lowered about halfway into the jetstream, forward and reverse thrust are equal so the boat maintains a fixed position, but steering is still available to allow the vessel to turn on the spot – something which is impossible with a conventional single propeller.     Unlike ": null
    },
    {
        "hydrofoil": "hydrofoil"
    },
    {
        "s, which use underwater ": null
    },
    {
        "wing": "wing"
    },
    {
        "s or struts to lift the vessel clear of the water, standard jetboats use a conventional ": null
    },
    {
        "planing hull": "planing"
    },
    {
        " to ride across the water surface, with only the rear portion of the hull displacing any water. With the majority of the hull clear of the water, there is reduced drag, greatly enhancing speed and maneuverability, so jetboats are normally operated at ": null
    },
    {
        "planing": "planing"
    },
    {
        " speed. At slower speeds with less water pumping through the jet unit, the jetboat will lose some steering control and maneuverability and will quickly slow down as the hull comes off its planing state and hull resistance is increased. However, loss of steering control at low speeds can be overcome by lowering the reverse deflector slightly and increasing throttle – so an operator may increase thrust and thus control without increasing boat speed itself. A conventional river-going jetboat will have a shallow-angled hull to improve its high-speed cornering control and stability, while also allowing it to traverse very shallow water. At speed, jetboats can be safely operated in less than 42  cm of water.        One of the most significant breakthroughs, in the development of the waterjet, was to change the design so it expelled the jetstream above the water line, contrary to many peoples intuition. Hamilton discovered early on that this greatly improved performance, compared to expelling below the waterline, while also providing a clean hull bottom to allow the boat to skim through very shallow water. It makes no difference to the amount of thrust generated whether the outlet is above or below the waterline, but having it above the waterline reduces hull resistance and draught. Hamiltons first waterjet design had the outlet below the hull and actually in front of the inlet. This probably meant that disturbed water was entering the jet unit and reducing its performance, and the main reason why the change to above the waterline made such a difference.     ": null
    },
    {
        "Queenstown, New Zealand": "queenstown, new zealand"
    },
    {
        ", where jetboats are used extensively for ": null
    },
    {
        "adventure tourism": "adventure travel"
    },
    {
        ", claims to be the jetboat capital of the world, and jetboats are very common for many coastal and riverine tourism activities in the country, such as the ": null
    },
    {
        "Excitor": "excitor"
    },
    {
        " in the ": null
    },
    {
        "Bay of Islands": "bay of islands"
    },
    {
        ".            Applications for jetboats include most activities where conventional propellers are also used, but in particular passenger ferry services, coastguard and police patrol, navy and military, adventure tourism , pilot boat operations, ": null
    },
    {
        "surf rescue": "lifeboat"
    },
    {
        ", ": null
    },
    {
        "farming": "farming"
    },
    {
        ", ": null
    },
    {
        "fishing": "fishing"
    },
    {
        ", ": null
    },
    {
        "exploration": "exploration"
    },
    {
        ", ": null
    },
    {
        "pleasure boating": "pleasure boating"
    },
    {
        ", and other water activities where motor boats are used. Jetboats can also be raced for sport, both on rivers  and on specially designed racecourses known as sprint tracks. Recently there has been increasing use of jetboats in the form of ": null
    },
    {
        "rigid-hulled inflatable boat": "rigid-hulled inflatable boat"
    },
    {
        "s and as ": null
    },
    {
        "luxury yacht tender": "luxury yacht tender"
    },
    {
        "s. Many jetboats are small enough to be carried on a trailer and towed by car.     One very important feature of the jetboat is the fact that it has no external rotating parts; it is thus safer for swimmers and ": null
    },
    {
        "marine life": "marine life"
    },
    {
        ", though these can still be struck by the hull. The safety benefit itself can sometimes be reason enough to use this type of propulsion.     In 42 Sir ": null
    },
    {
        "Edmund Hillary": "edmund hillary"
    },
    {
        " led a jetboat expedition, titled Ocean to Sky , from the mouth of the Ganges River to its source. One of the jetboats was sunk by a friend of Hillary.        The fuel efficiency and performance of a jetboat can be affected by anything that disrupts the smooth flow of water through the jet unit. For example, a plastic bag sucked onto the jet units intake grill can have quite an adverse effect.     Another disadvantage of jetboats appears to be that they are more sensitive to engine/jet unit mismatch, compared with the problem of engine/propeller mismatch in propeller-driven craft.": null
    }
]