[
    {
        "   Religious pluralism": "religious pluralism"
    },
    {
        " is a set of religious world views that hold that ones religion is not the sole and exclusive source of truth, and thus recognizes that some level of truth and value exists in other religions. As such, religious pluralism goes beyond religious tolerance, which is the condition of peaceful existence between adherents of different religions or religious denominations.     Within the Jewish community there lies a common history, a shared language of prayer, a shared Bible and a shared set of ": null
    },
    {
        "rabbinic literature": "rabbinic literature"
    },
    {
        ", thus allowing for Jews of significantly different world views to share some common values and goals.           Traditionally, Jews believe that God chose the Jewish people to be in a ": null
    },
    {
        "unique covenant with God": "jews as a chosen people"
    },
    {
        ", described by the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " itself, with particular obligations and responsibilities elucidated in the ": null
    },
    {
        "Oral Torah": "oral torah"
    },
    {
        ". Sometimes this choice is seen as charging the Jewish people with a specific mission & mdash; to be a ": null
    },
    {
        "light unto the nations": "light unto the nations"
    },
    {
        ", practice ": null
    },
    {
        "Tikkun olam": "tikkun olam"
    },
    {
        " and to exemplify the ": null
    },
    {
        "covenant": "covenant"
    },
    {
        " with God as described in the ": null
    },
    {
        "Torah": "torah"
    },
    {
        ". This view, however, did not preclude a belief that ": null
    },
    {
        "God": "god"
    },
    {
        " has a relationship with other peoples & mdash; rather, Judaism held that God had entered into a covenant with all humankind, and that Jews and non-Jews alike have a relationship with God. Each nation with its own unique relationship with God.     Biblical references as well as rabbinic literature support this view: Moses refers to the God of the spirits of all flesh , and the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        "  also identifies ": null
    },
    {
        "prophet": "prophet"
    },
    {
        "s outside the community of Israel. Based on these statements, some rabbis theorized that, in the words of ": null
    },
    {
        "Nathanel ben Fayyumi": "natanel_al-fayyumi"
    },
    {
        ", a Yemenite Jewish theologian of the 42th century, God permitted to every people something he forbade to others... God sends a prophet to every people according to their own language. The ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        " states that Humanity was produced from one man, Adam, to show Gods greatness. When a man mints a coin in a press, each coin is identical. But when the King of Kings, the Holy One, blessed be He, creates people in the form of Adam not one is similar to any other. The ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        " continues, and states that anyone who kills or saves a single human life, Jewish or not-Jewish, has killed or saved an entire world. The Tosefta, a supplement to the Mishnah, states: ": null
    },
    {
        "Righteous people of all nations": "righteous among the nations"
    },
    {
        " have a share in the ": null
    },
    {
        "world to come": "olam haba"
    },
    {
        " . The Midrash adds: -Why does the Holy One, blessed be He, love the righteous? Because righteousness is not due to inheritance or family connections... If a man wants to become a Kohen or a Levite, he cannot. Why? Because his father was neither a Kohen nor a Levite. However, if someone wants to become righteous, even if he is a gentile, he can, because righteousness is not inherited.     A traditional Jewish view is that rather than being obligated to obey the whole ": null
    },
    {
        "42 mitzvot": "613 mitzvot"
    },
    {
        " that the Jews are obligated to, the other nation adhere to a common list of commandments under seven categories that God required of the children of ": null
    },
    {
        "Noah": "noah"
    },
    {
        "; ": null
    },
    {
        "Noahide laws": "noahide laws"
    },
    {
        ", .Gilui Arayos in the Ashkenazi pronunciationtraditionally, ": null
    },
    {
        "incest": "incest"
    },
    {
        ", ": null
    },
    {
        "bestiality": "bestiality"
    },
    {
        ", ": null
    },
    {
        "adultery": "adultery"
    },
    {
        "Tosefta, Sanhedrin 42in addition to their denouncing the Jews sinsi.e. worshiping multiple deitiessuch as human sacrifice, murder, and miscarriages of justicei.e. to a ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        " of gods and to ": null
    },
    {
        "statue": "statue"
    },
    {
        "s and ": null
    },
    {
        "saints": "saints"
    },
    {
        "see Babylonian Talmud Hullin, 42bsee Tosafot on Babylonian Talmud Avodah Zarah 42aJacob Katz, Exclusiveness and Tolerance, Oxford Univ. Press, 42 Ch.42in the case of Christianity, called ": null
    },
    {
        "Supersessionism": "supersessionism"
    },
    {
        "Maimonides, ": null
    },
    {
        "Mishneh Torah": "mishneh torah"
    },
    {
        ", XI.4242–4242–42which areRCAformer President of the RCALawrence Kaplan, Revisionism and the Rav: The Struggle for the Soul of Modern Orthodoxy Judaism, Summer, 42Disputation and Dialogue: Readings in the Jewish Christian Encounter, Ed. F.E. Talmage, Ktav, 42 p.  42Tradition:A Journal of Orthodox Thought, Vol. 42 42": null
    },
    {
        "b": "b"
    },
    {
        "CJCUC42Hebrew BibleSee ": null
    },
    {
        "Marcion": "marcion"
    },
    {
        " for the historical source of this interpretation42see also ": null
    },
    {
        "Antinomianism": "antinomianism"
    },
    {
        "42, the ": null
    },
    {
        "Great Commandment": "great commandment"
    },
    {
        "4242": null
    },
    {
        "ristiani": "ristiani"
    },
    {
        "Source: The Root and the Branch , Chapter 42 Robert Gordis, Univ. of Chicago Press, 42 Speak the Truth ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        "Yehezkel Kaufman, The Religion of Israel , Univ. of Chicago Press, 42; J. H. Hertz, Pentateuch and Haftorahs Soncino Press, 42 p.  42athough the same can be said of modern-day ": null
    },
    {
        "pagans": "paganism"
    },
    {
        "bcdor perceived monotheistsmissee also ": null
    },
    {
        "Hindu views on monotheism": "hindu views on monotheism"
    }
]