[
    {
        "              Jewish prayer  are the ": null
    },
    {
        "prayer": "prayer"
    },
    {
        " recitations and ": null
    },
    {
        "Jewish meditation traditions": "jewish meditation"
    },
    {
        " that form part of the observance of Rabbinic ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        ". These prayers, often with instructions and commentary, are found in the  siddur , the traditional Jewish prayer book. However, the term tefillah as referenced in the Talmud refers specifically to the ": null
    },
    {
        "Shemoneh Esreh": "shemoneh esreh"
    },
    {
        ".     Prayer—as a service of the heart —is in principle a Torah-based ": null
    },
    {
        "commandment": "mitzvah"
    },
    {
        ". Tractate ": null
    },
    {
        "Taanit": "taanit"
    },
    {
        " 2a It is not time-dependent and is mandatory for both Jewish men and women.           However, in general, today, Jewish men are obligated to conduct  tefillah  three times a day ": null
    },
    {
        "within specific time ranges ": "zmanim"
    },
    {
        ", while, according to some posekim , women are only required to engage in tefillah once a day, others say at least twice a day.      Traditionally, since the Second Temple period, three prayer services are recited daily:   Morning prayer:  Shacharit  or Shaharit , from the ": null
    },
    {
        "Hebrew": "hebrew"
    },
    {
        " shachar or shahar  morning light ,   Afternoon prayer:  Mincha  or Minha , the afternoon prayers named for the flour offering that accompanied sacrifices at the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ",   Additional prayer:  Arvit  or  Maariv  , from nightfall .   Further additional prayers:    Musaf   are recited by ": null
    },
    {
        "Orthodox": "orthodox judaism"
    },
    {
        " and ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        " congregations on ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        ", major ": null
    },
    {
        "Jewish holidays": "jewish holiday"
    },
    {
        " , and ": null
    },
    {
        "Rosh Chodesh": "rosh chodesh"
    },
    {
        ".   A fifth prayer service,  Neila  , is recited only on ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        ", the Day of Atonement.     The ": null
    },
    {
        "Talmud Bavli": "talmud bavli"
    },
    {
        " gives two reasons why there are three basic prayers  de-rabbanan  since the early ": null
    },
    {
        "Second Temple period": "second temple period"
    },
    {
        " on: to recall the daily sacrifices at the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ", and/or because each of the ": null
    },
    {
        "Patriarchs": "patriarchs"
    },
    {
        " instituted one prayer: ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        " the morning, ": null
    },
    {
        "Isaac": "isaac"
    },
    {
        " the afternoon and ": null
    },
    {
        "Jacob": "jacob"
    },
    {
        " the evening prayer. Tractate Berachoth 26b: the morning sacrifice Tamid, the afternoon Tamid, and the overnight burning of the afternoon offering. The latter view is supported with Biblical quotes indicating that the Patriarchs prayed at the times mentioned. However, even according to this view, the exact times of when the services are held, and moreover the entire concept of a mussaf service, are still based on the sacrifices. The ": null
    },
    {
        "Talmud yerushalmi": "talmud yerushalmi"
    },
    {
        " states that the ": null
    },
    {
        "Anshei Knesset HaGedola": "anshei knesset hagedola"
    },
    {
        " learned and understood the beneficial concept of regular daily prayer from personal habits of the forefathers  as hinted in the Tanach, and instituted the three daily prayers. “Anshei Knesset HaGedolah – Men of the Great Assembly; founded by Ezra in approximately 520 B.C.E.; instituted the “Shemoneh Esray” Prayer , and the enacting of many laws to protect and bolster the observance of the Torah commands.” ~  A distinction is made between individual prayer and communal prayer, which requires a ": null
    },
    {
        "quorum": "quorum"
    },
    {
        " known as a  minyan , with communal prayer being preferable as it permits the inclusion of prayers that otherwise would be omitted.     ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " relates that until the ": null
    },
    {
        "Babylonian exile": "babylonian exile"
    },
    {
        " , all Jews had composed their own prayers, but thereafter the sages of the ": null
    },
    {
        "Great Assembly": "great assembly"
    },
    {
        " in the early Second Temple period composed the main portions of the siddur. Mishneh Torah, Laws of Prayer 1:4 Modern scholarship dating from the ": null
    },
    {
        "Wissenschaft des Judentums": "wissenschaft des judentums"
    },
    {
        " movement of 19th-century Germany, as well as textual analysis influenced by the 20th-century discovery of the ": null
    },
    {
        "Dead Sea Scrolls": "dead sea scrolls"
    },
    {
        ", suggests that dating from this period there existed liturgical formulations of a communal nature designated for particular occasions and conducted in a centre totally independent of Jerusalem and the Temple, making use of terminology and theological concepts that were later to become dominant in Jewish and, in some cases, Christian prayer.  The language of the prayers, while clearly from the ": null
    },
    {
        "Second Temple period": "second temple period"
    },
    {
        " , ″Some explain that this means that prayers were instituted after the destruction of the Temple to replace the offerings. However, these prayers were already extant throughout the Second Temple era with virtually the same formula that was instituted later, with certain known differences. Furthermore, there were already synagogues at that time, some even in close proximity to the Temple. There is a dispute in the Talmud about whether the prayers were instituted to parallel the offerings, or whether they have an independent source, unrelated to the Temple service.″  often employs Biblical idiom. Jewish prayerbooks emerged during the early ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " during the period of the ": null
    },
    {
        "Geonim": "geonim"
    },
    {
        " of ": null
    },
    {
        "Babylonia": "babylonia"
    },
    {
        "      Over the last two thousand years traditional variations have emerged among the traditional ": null
    },
    {
        "liturgical": "liturgy"
    },
    {
        " customs": "minhag"
    },
    {
        " of different Jewish communities, such as ": null
    },
    {
        "Ashkenazic": "ashkenazic"
    },
    {
        ", ": null
    },
    {
        "Sephardic": "sephardic"
    },
    {
        ", ": null
    },
    {
        "Yemenite": "yemenite jews"
    },
    {
        ", ": null
    },
    {
        "Eretz Yisrael": "palestinian minhag"
    },
    {
        " and others, or rather recent liturgical inventions such as ": null
    },
    {
        "Hassidic": "hassidic"
    },
    {
        ", ": null
    },
    {
        "Chabad": "nusach ari"
    },
    {
        ", ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        ", and various ": null
    },
    {
        "Reform minhagim": "reform judaismpractice"
    },
    {
        ". However the differences are minor compared with the commonalities. Halachically, Jews can switch from one ": null
    },
    {
        "nusach": "nusach"
    },
    {
        " tefillah to another at any time, even on a daily basis, and are not bound to follow the nusach of their forefathers. Most of the Jewish liturgy is sung or chanted with traditional melodies or ": null
    },
    {
        "trope": "cantillation"
    },
    {
        ". ": null
    },
    {
        "Synagogues": "synagogue"
    },
    {
        "may designate or employ a professional or lay  hazzan  for the purpose of leading the congregation in prayer, especially on Shabbat or holidays.           According to the ": null
    },
    {
        "Talmud Bavli": "talmud bavli"
    },
    {
        " , tefillah is a ": null
    },
    {
        "Biblical command": "mitzvah"
    },
    {
        ": You shall serve God with your whole heart.  What service is performed with the heart? This is tefillah. Prayer is therefore referred to as Avodah sheba-Lev . It is not time-dependent and is mandatory for both Jewish men and women. Mentioning tefillah, the Talmud always refers to the  Amidah , that is also called  Shemoneh Esreh . The noted rabbi ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " likewise categorizes tefillah as a Biblical command of ": null
    },
    {
        "Written law": "written law"
    },
    {
        ", ": null
    },
    {
        "Mishneh Torah": "mishneh torah"
    },
    {
        ", Laws of Prayer 1:1. as the Babylon Talmud says. However, corresponding with the Jerusalem Talmud, the ": null
    },
    {
        "RaMBaM": "maimonides"
    },
    {
        " did hold that the number of tefillot and their times are not a Biblical command of Written law and that the forefathers did not institute such a ": null
    },
    {
        "Takkanah": "takkanah"
    },
    {
        ", rather it was a rabbinical command  de-rabbanan  based on a takkanah of the ": null
    },
    {
        "Anshei Knesset HaGedola": "anshei knesset hagedola"
    },
    {
        " .       The ": null
    },
    {
        "Oral law": "oral laworal law in judaism"
    },
    {
        ", according to the ": null
    },
    {
        "Talmud Bavli": "talmud bavli"
    },
    {
        " gives two reasons why there are three basic prayers:   According to Rabbi ": null
    },
    {
        "Jose b. Hanina": "jose b. hanina"
    },
    {
        ", each of the ": null
    },
    {
        "Patriarchs": "patriarchs"
    },
    {
        " instituted one prayer: ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        " the morning, ": null
    },
    {
        "Isaac": "isaac"
    },
    {
        " the afternoon and ": null
    },
    {
        "Jacob": "jacob"
    },
    {
        " the evening prayers. This view is supported with Biblical quotes indicating that the Patriarchs prayed at the times mentioned. However, even according to this view, the exact times of when the services are held, and moreover the entire concept of a mussaf service, are still based on the sacrifices.   Each service was instituted parallel to a sacrificial act in the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ": the morning Tamid ": null
    },
    {
        "offering": "korban"
    },
    {
        ", the afternoon Tamid offering, and the overnight burning of this last offering.          The ": null
    },
    {
        "Oral Torah": "oral torah"
    },
    {
        ", according to the ": null
    },
    {
        "Talmud yerushalmi": "talmud yerushalmi"
    },
    {
        " states why there are three basic tefillot and who instituted them:   Rabbi Yehoshua said that the ": null
    },
    {
        "Anshei Knesset HaGedola": "anshei knesset hagedola"
    },
    {
        " learned and understood the beneficial concept of regular daily tefillot from the habit of the forefathers  Avraham, Isaac and Yaakov. Therefore, the Anshei Knesset HaGedola based their ": null
    },
    {
        "Takkanah": "takkanah"
    },
    {
        " that Jewish men were required to pray three times a day from hints to personal habits of the forefathers in the tanach.         Additional references in the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        " have been interpreted to suggest that ": null
    },
    {
        "King David": "david"
    },
    {
        " and the prophet ": null
    },
    {
        "Daniel": "daniel"
    },
    {
        " prayed three times a day. In ": null
    },
    {
        "Psalms": "book of psalms"
    },
    {
        ", David states:      As in the ": null
    },
    {
        "Book of Daniel": "book of daniel"
    },
    {
        ":        ": null
    },
    {
        "Orthodox": "orthodox judaism"
    },
    {
        ", ": null
    },
    {
        "Modern Orthodox": "modern orthodox judaism"
    },
    {
        " and ": null
    },
    {
        "Sefardic": "sefardic judaism"
    },
    {
        " strands of Judaism regard  halakha   as requiring Jewish men to say tefillot three times daily and four times daily on the ": null
    },
    {
        "Sabbath": "shabbat"
    },
    {
        " and most ": null
    },
    {
        "Jewish holiday": "jewish holiday"
    },
    {
        "s, and five times on ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        ". Some of those movements regard the system of multiple daily prayer services within specific time frames as optional for women due to their need to be constantly taking care of small children, but—in accordance with halakha—they are still required to pray at least daily, without a specific time requirement. The daily tefillah is to fulfill the Biblical requirement based on Maimonides view as above. Moreover, it is generally accepted by Orthodox, Modern Orthodox, and Sephardic religious authorities that women are exempt from the evening prayer. Mishna Berurah, Laws of Evening Prayers. ": null
    },
    {
        "Conservative Judaism": "conservative judaism"
    },
    {
        " regards the halakhic system of multiple daily services as mandatory. Since 2002, Jewish women from Conservative congregations have been regarded as having undertaken a communal obligation to pray the same prayers at the same times as men, with traditional communities and individual women permitted to opt out.   ": null
    },
    {
        "Reform": "reform judaism"
    },
    {
        " and ": null
    },
    {
        "Reconstructionist": "reconstructionist judaism"
    },
    {
        " congregations do not regard halakha as binding and hence regard appropriate prayer times as matters of personal spiritual decision rather than a matter of religious requirement.       According to ": null
    },
    {
        "halakha": "halakha"
    },
    {
        ", all individual prayers and virtually all communal prayers may be said in any language that the person praying understands. For example, the  Mishnah  mentions that the  Shema  need not be said in Hebrew ": null
    },
    {
        "Berakhot 2:3": "s:mishnah/seder zeraim/tractate berakhot/chapter 2/3"
    },
    {
        " A list of prayers that must be said in Hebrew is given in the Mishna, ": null
    },
    {
        "Sotah 7:2": "s:mishnah/seder nashim/tractate sotah/chapter 7/2"
    },
    {
        " and among these only the ": null
    },
    {
        "Priestly Blessing": "priestly blessing"
    },
    {
        " is in use today, as the others are prayers that are to be said only in a ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ", by a ": null
    },
    {
        "priest": "kohen"
    },
    {
        ", or by a reigning ": null
    },
    {
        "King": "jewish messiah"
    },
    {
        ".     Despite this, the tradition of most ": null
    },
    {
        "Ashkenazi": "ashkenazi"
    },
    {
        " Orthodox": "orthodox judaism"
    },
    {
        " synagogues is to use Hebrew  for all except a small number of prayers, including the ": null
    },
    {
        "Aramaic": "aramaic"
    },
    {
        "  Kaddish  , and the notable ": null
    },
    {
        "Gott Fun Avraham": "god of abraham"
    },
    {
        ", which was written in Yiddish. In other streams of Judaism there is considerable variability: ": null
    },
    {
        "Sephardic": "sephardic"
    },
    {
        " communities may use ": null
    },
    {
        "Ladino": "ladino language"
    },
    {
        " or ": null
    },
    {
        "Portuguese": "portuguese language"
    },
    {
        " for many prayers; ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        " synagogues tend to use the local language to a varying degree; and at some ": null
    },
    {
        "Reform": "reform judaism"
    },
    {
        " synagogues almost the whole service may be in the local language.     Maimonides relates that until the ": null
    },
    {
        "Babylonian exile": "babylonian captivity"
    },
    {
        ", all Jews composed their own prayers. After the exile, however, the sages of the time  found the ability of the people insufficient to continue the practice, and they legendarily composed the main portions of the  siddur , such as the  Amidah , from which no fragments survived. The origins of modern Jewish prayer were established during the period of the ": null
    },
    {
        "Tannaim": "tannaim"
    },
    {
        ", from their traditions, later committed to writing, we learn that the generation of rabbis active at the time of the destruction of the Second Temple gave Jewish prayer its structure and, in outline form at least, its contents.  This liturgy included the twice-daily recitation of the Shema, the ": null
    },
    {
        "Amidah": "amidah"
    },
    {
        ", or Shmoneh Esrei, including 18 blessings recited several times daily, and the ": null
    },
    {
        "public recitation of the Torah": "torah reading"
    },
    {
        " in installments. The oldest prayer books date from the time of the ": null
    },
    {
        "Geonim": "geonim"
    },
    {
        " of ": null
    },
    {
        "Babylonia": "babylonia"
    },
    {
        "; some were composed by respected rabbinic scholars at the request of far-flung communities seeking an authoritative text of the required prayers for daily use, Shabbat, and holidays.     The language of the prayers, while clearly being from the Second Temple period, often employs Biblical idiom, and according to some authorities it should not contain rabbinic or Mishnaic idiom apart from in the sections of Mishnah that are featured .     Over the last two thousand years, the various branches of Judaism have resulted in small variations in the Rabbinic liturgy ": null
    },
    {
        "customs": "minhag"
    },
    {
        " among different Jewish communities, with each community having a slightly different ": null
    },
    {
        "Nusach": "minhagnusach"
    },
    {
        " . The principal difference is between ": null
    },
    {
        "Ashkenazic": "ashkenazic"
    },
    {
        " and ": null
    },
    {
        "Sephardic": "sephardic"
    },
    {
        " customs, although there are other communities , and rather recent liturgical inventions such as ": null
    },
    {
        "Hassidic": "hassidic"
    },
    {
        ", ": null
    },
    {
        "Chabad": "nusach ari"
    },
    {
        ", ": null
    },
    {
        "Reform": "reform judaismpractice"
    },
    {
        " and other communities also have distinct customs, variations, and special prayers. The differences are quite minor compared with the commonalities. The idea that a Jew should not change his Nusach Tefillah and has to continue to pray in the way of his forefathers is an invented Halacha of the ": null
    },
    {
        "galut": "galut"
    },
    {
        " .  According to ": null
    },
    {
        "halakha": "halakha"
    },
    {
        ", a Jew may change his nusach tefilla at any time, even on a daily basis.            The earliest parts of Jewish prayer are the  Shema Yisrael  , and the ": null
    },
    {
        "Priestly Blessing": "priestly blessing"
    },
    {
        " , which are in the ": null
    },
    {
        "Torah": "torah"
    },
    {
        ". A set of eighteen blessings called the Shemoneh Esreh or the  Amidah  , is traditionally ascribed to the ": null
    },
    {
        "Great Assembly": "great assembly"
    },
    {
        " in the time of ": null
    },
    {
        "Ezra": "ezra"
    },
    {
        ", at the end of the Biblical period.     The name Shemoneh Esreh, literally eighteen , is an historical anachronism, since it now contains nineteen blessings. It was only near the end of the ": null
    },
    {
        "Second Temple": "second temple"
    },
    {
        " period that the eighteen prayers of the weekday Amidah became standardized. Even at that time their precise wording and order was not yet fixed, and varied from locale to locale. It was not until several centuries later that the prayers began to be formally fixed. By the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " the texts of the prayers were nearly fixed, and in the form in which they are still used today.     The siddur was printed by ": null
    },
    {
        "Soncino": "soncino family"
    },
    {
        " in Italy as early as 1486, though a siddur was first mass-distributed only in 1865. The siddur began appearing in the ": null
    },
    {
        "vernacular": "vernacular"
    },
    {
        " as early as 1538. The first English ": null
    },
    {
        "translation": "translation"
    },
    {
        ", by Gamaliel ben Pedahzur , appeared in London in 1738; a different translation was released in the United States in 1837.       Readings from the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " and the ": null
    },
    {
        "Neviim": "neviim"
    },
    {
        " form part of the prayer services. To this framework various Jewish sages added, from time to time, various prayers, and, for festivals especially, numerous hymns.     The earliest existing codification of the prayerbook was drawn up by Rav ": null
    },
    {
        "Amram Gaon": "amram gaon"
    },
    {
        " of Sura, Babylon, about 850 CE. Half a century later Rav ": null
    },
    {
        "Saadia Gaon": "saadia gaon"
    },
    {
        ", also of Sura, composed a ": null
    },
    {
        "siddur": "siddur of saadia gaon"
    },
    {
        ", in which the rubrical matter is in ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        ". These were the basis of Simcha ben Samuels ": null
    },
    {
        "Machzor Vitry": "machzor vitry"
    },
    {
        " , which was based on the ideas of his teacher, ": null
    },
    {
        "Rashi": "rashi"
    },
    {
        ". Another formulation of the prayers was that appended by Maimonides to the laws of prayer in his ": null
    },
    {
        "Mishneh Torah": "mishneh torah"
    },
    {
        ": this forms the basis of the Yemenite liturgy, and has had some influence on other rites. From this point forward, all Jewish prayerbooks had the same basic order and contents.       ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        " services generally use the same basic format for services as in Orthodox Judaism, with some doctrinal leniencies and some prayers in English. In practice, there is wide variation among Conservative congregations. In traditionalist congregations the liturgy can be almost identical to that of ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        ", almost entirely in Hebrew , with a few minor exceptions, including excision of a study session on Temple sacrifices, and modifications of prayers for the restoration of the ": null
    },
    {
        "sacrificial": "korban"
    },
    {
        " system. In more liberal Conservative synagogues there are greater changes to the service, with up to a third of the service in English; abbreviation or omission of many of the preparatory prayers; and replacement of some traditional prayers with more contemporary forms. There are some changes for doctrinal reasons, including ": null
    },
    {
        "egalitarian": "egalitarian"
    },
    {
        " language, fewer references to restoring ": null
    },
    {
        "sacrifices": "korban"
    },
    {
        " in the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ", and an option to eliminate special roles for ": null
    },
    {
        "Kohanim": "kohen"
    },
    {
        " and ": null
    },
    {
        "Levite": "levite"
    },
    {
        "s.     The liturgies of ": null
    },
    {
        "Reform": "reform judaism"
    },
    {
        " and ": null
    },
    {
        "Reconstructionist": "reconstructionist judaism"
    },
    {
        " are based on traditional elements, but contains language more reflective of liberal belief than the traditional liturgy. Doctrinal revisions generally include revising or omitting references to traditional doctrines such as bodily ": null
    },
    {
        "resurrection": "resurrection"
    },
    {
        ", a personal ": null
    },
    {
        "Jewish Messiah": "jewish messiah"
    },
    {
        ", and other elements of traditional ": null
    },
    {
        "Jewish eschatology": "jewish eschatology"
    },
    {
        ", Divine revelation of the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " at ": null
    },
    {
        "Mount Sinai": "mount sinai"
    },
    {
        ", ": null
    },
    {
        "angels": "jewish angelarchy"
    },
    {
        ", conceptions of reward and punishment, and other personal miraculous and supernatural elements. Services are often from 40% to 90% in the vernacular.     ": null
    },
    {
        "Reform Judaism": "reform judaism"
    },
    {
        " has made greater alterations to the traditional service in accord with its more liberal ": null
    },
    {
        "theology": "theology"
    },
    {
        " including dropping references to traditional elements of ": null
    },
    {
        "Jewish eschatology": "jewish eschatology"
    },
    {
        " such as a personal ": null
    },
    {
        "Messiah": "jewish messiah"
    },
    {
        ", a bodily ": null
    },
    {
        "resurrection": "resurrection"
    },
    {
        " of the dead, and others. The Hebrew portion of the service is substantially abbreviated and modernized and modern prayers substituted for traditional ones. In addition, in keeping with their view that the laws of ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " are inapplicable to modern circumstances, Reform services often play instrumental or recorded music with prayers on the ": null
    },
    {
        "Jewish Sabbath": "shabbat"
    },
    {
        ". All Reform synagogues are ": null
    },
    {
        "Egalitarian": "egalitarian"
    },
    {
        " with respect to gender roles.          In ": null
    },
    {
        "Jewish philosophy": "jewish philosophy"
    },
    {
        " and in ": null
    },
    {
        "Rabbinic literature": "rabbinic literature"
    },
    {
        ", it is noted that the Hebrew verb for prayer—hitpallel התפלל—is in fact the ": null
    },
    {
        "reflexive form": "reflexive verb"
    },
    {
        " of palal פלל, to judge. Thus, to pray conveys the notion of judging oneself : This interpretation is ": null
    },
    {
        "homiletic": "homily"
    },
    {
        " rather than scholarly, as it is historically more likely that the root meaning of hitpallel is to seek judgement for oneself , in other words to present a legal pleading. ultimately, the purpose of prayer— tefilah  תפלה—is to transform ourselves.       This ": null
    },
    {
        "etymology": "etymology"
    },
    {
        " is consistent with the ": null
    },
    {
        "Jewish conception": "divine simplicityin jewish thought"
    },
    {
        " of ": null
    },
    {
        "divine simplicity": "divine simplicity"
    },
    {
        ". It is not God that changes through our prayer—Man does not influence God as a defendant influences a human judge who has emotions and is subject to change—rather it is man himself who is changed.  It is further consistent with ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " view": "divine providence maimonides"
    },
    {
        " on ": null
    },
    {
        "Divine Providence": "divine providence"
    },
    {
        ". Here, Tefillah is the medium which God gave to man by means of which he can change himself, and thereby establish a new relationship with God—and thus a new destiny for himself in life;  see ": null
    },
    {
        "also": "psalmsuse of the psalms in jewish ritual"
    },
    {
        " under ": null
    },
    {
        "Psalms": "psalms"
    },
    {
        ".       In this view, the ultimate goal of prayer is to help train a person to focus on divinity through philosophy and intellectual contemplation. This approach was taken by ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " and the other medieval rationalists.       In this view, prayer is not a conversation. Rather, it is meant to inculcate certain attitudes in the one who prays, but not to influence. This has been the approach of Rabbenu Bachya, ": null
    },
    {
        "Yehuda Halevy": "yehuda halevy"
    },
    {
        ", ": null
    },
    {
        "Joseph Albo": "joseph albo"
    },
    {
        ", ": null
    },
    {
        "Samson Raphael Hirsch": "samson raphael hirsch"
    },
    {
        ", and ": null
    },
    {
        "Joseph Dov Soloveitchik": "joseph dov soloveitchik"
    },
    {
        ". This view is expressed by Rabbi ": null
    },
    {
        "Nosson Scherman": "nosson scherman"
    },
    {
        " in the overview to the ": null
    },
    {
        "Artscroll": "artscroll"
    },
    {
        " Siddur ; note that Scherman goes on to also affirm the Kabbalistic view .       ": null
    },
    {
        "Kabbalah": "kabbalah"
    },
    {
        " uses a series of kavanot, directions of intent, to specify the path the prayer ascends in the dialogue with God, to increase its chances of being answered favorably. Kabbalism ascribes a higher meaning to the purpose of prayer, which is no less than affecting the very fabric of reality itself, restructuring and repairing the universe in a real fashion. In this view, every word of every prayer, and indeed, even every letter of every word, has a precise meaning and a precise effect. Prayers thus literally affect the mystical forces of the universe, and repair the fabric of creation.     This approach has been taken by the ": null
    },
    {
        "Chassidei Ashkenaz": "chassidei ashkenaz"
    },
    {
        " , the ": null
    },
    {
        "Zohar": "zohar"
    },
    {
        ", the ": null
    },
    {
        "Arizals": "isaac luria"
    },
    {
        " Kabbalist tradition, the ": null
    },
    {
        "Ramchal": "moshe chaim luzzatto"
    },
    {
        ", most of ": null
    },
    {
        "Hassidism": "hasidic judaism"
    },
    {
        ", the ": null
    },
    {
        "Vilna Gaon": "vilna gaon"
    },
    {
        " and ": null
    },
    {
        "Jacob Emden": "jacob emden"
    },
    {
        ".     ": null
    },
    {
        "Hassidism": "hasidic judaism"
    },
    {
        ", although incorporating the kabbalistic worldview and its corresponding kavanot, also emphasized straightforward sincerity and depth of emotional engagement in prayer. Green, Arthur et al, Speaking Torah: Spiritual Teachings From Around the Maggids Table, Jewish Lights, 2013, p.13. The ": null
    },
    {
        "Baal Shem Tovs": "baal shem tov"
    },
    {
        "great-grandson, ": null
    },
    {
        "Rebbe Nachman of Breslov": "nachman of breslov"
    },
    {
        ", particularly emphasized speaking to God in ones own words, which he called ": null
    },
    {
        "Hitbodedut": "hitbodedut"
    },
    {
        " and advised setting aside an hour to do this every day .           Daven is the originally exclusively Eastern Yiddish verb meaning pray ; it is widely used by ": null
    },
    {
        "Ashkenazic": "ashkenazic"
    },
    {
        " Orthodox Jews": "orthodox judaism"
    },
    {
        ". In ": null
    },
    {
        "Yinglish": "yinglish"
    },
    {
        ", this has become the ": null
    },
    {
        "Anglicise": "anglicise"
    },
    {
        "d davening.     The origin of the word is obscure, but is thought by some to have come from ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " , ": null
    },
    {
        "French": "french language"
    },
    {
        " , ": null
    },
    {
        "Latin": "latin"
    },
    {
        "  or even ": null
    },
    {
        "English": "english language"
    },
    {
        " .  Others believe that it derives from a ": null
    },
    {
        "Slavic": "slavonic languages"
    },
    {
        " word meaning to give . Some claim that it originates from an Aramaic word, deavuhon or davinun, meaning of their/our forefathers, as the three prayers are said to have been invented by ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        ", ": null
    },
    {
        "Isaac": "isaac"
    },
    {
        " and ": null
    },
    {
        "Jacob": "jacob"
    },
    {
        ". Another Aramaic derivation, proposed by Avigdor Chaikin, cites the Talmudic phrase, ka davai lamizrach , gazing wistfully to the east . Kevin A. Brook, The Jews of Khazaria, 2nd ed. Rowman & Littlefield 2006, p. 206 cites Zeidens suggestion Herbert Zeiden, Davenen: a Turkic Etymology , Yiddish 10, nos. 2–3 , pp. 96–97 that the word daven comes from the Turkish root tabun- meaning to pray, and that in ": null
    },
    {
        "Kipchak Turkish": "kipchak turkish"
    },
    {
        ", the initial t morphs into d.     In Western Yiddish, the term for pray is oren, a word with clear roots in ": null
    },
    {
        "Romance languages": "romance languages"
    },
    {
        "—compare Spanish and Portuguese orar and Latin orare.              Individual prayer is considered acceptable, but prayer with a quorum of ten Jewish adults—a  minyan —is the most highly recommended form of prayer and is required for some prayers. An adult in this context means over the age of 12 or 13 . Judaism had originally counted only men in the minyan for formal prayer, on the basis that one does not count someone who is not obligated to participate. The rabbis had exempted women from almost all time-specific positive mitzvot , including those parts of the prayer that cannot be recited without a quorum, due to women in the past being bound up in an endless cycle of pregnancy, birthing and nursing from a very early age. Orthodox Judaism still follows this reasoning and excludes women from the minyan.     Since 1973, ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        " congregations have overwhelmingly become egalitarian and count women in the minyan. A very small number of congregations that identify themselves as Conservative have resisted these changes and continue to exclude women from the minyan. Those Reform and Reconstructionist congregations that consider a minyan mandatory for communal prayer, count both men and women for a minyan. All denominations of Judaism except for Orthodox Judaism ordain female rabbis and cantors. Jewish Womens Archive. . Retrieved 2015-05-07. Jewish Virtual Archive. . Retrieved 2015-05-07.     There is a publicly said prayer, called ": null
    },
    {
        "Birkhat HaGomel": "hagomel"
    },
    {
        ", for giving thanks for surviving an illness or danger.  which, in addition to needing a Minyan, also needs a Torah scroll taken out for a scheduled Torah reading.       Head covering. In most synagogues, it is considered a sign of respect for male attendees to wear a head covering, either a dress hat or a ": null
    },
    {
        "kippa": "kippa"
    },
    {
        " . It is common practice for both Jews and non-Jews who attend a synagogue to wear a head covering. ": null
    },
    {
        "International Council of Christians and Jews": "international council of christians and jews"
    },
    {
        ", , Non-Jewish male visitors to the synagogue are offered skull caps at the entrance and are asked to wear them. Rabbi Amy R. Scheinerman, , Non-Jews who are guests in a synagogue can cover their heads; it is a sign of respect and not at all inappropriate for people who are not Jewish. Some Conservative synagogues may also encourage women to cover their heads. Many Reform and Progressive temples do not require people to cover their heads, although individual worshipers, both men and women, may choose to. Many Orthodox and some conservative men and women wear a head covering throughout their day, even when not attending religious services.    Tallit  is traditionally worn during all morning services, during Aliyah to the Torah, as well as during all the services of ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        ". During the daily afternoon and evening services, the hazzan alone wears a tallit. In Orthodox synagogues they are expected to be worn only by men who are halakhically Jewish and though in some Conservative synagogues they should be worn only by men, in other Conservative synagogues both men and women who are halakhically Jewish should wear a tallit. In most Orthodox ": null
    },
    {
        "Ashkenazi": "ashkenazi"
    },
    {
        " synagogues they are worn only by men who are or have been married.   ": null
    },
    {
        "Mordechai Becher": "mordechai becher"
    },
    {
        ", Gateway to Judaism: The What, How, And Why of Jewish Life, ": null
    },
    {
        "Mesorah Publications": "mesorah publications"
    },
    {
        ", 2005, p. 328.   Joyce Eisenberg, Ellen Scolnic, Dictionary of Jewish Words, ": null
    },
    {
        "Jewish Publication Society": "jewish publication society"
    },
    {
        ", 2006, p. 166.     Tefillin  are a set of small cubic leather boxes painted black, containing scrolls of parchment inscribed with verses from the Torah. They are tied to the head and arm with leather straps dyed black, and worn by Jews only, during weekday morning prayers. In Orthodox synagogues they are expected to be worn only by men; in Conservative synagogues they are also worn by some women. The Karaite Jews, however, do not don tefillin.    Tzeniut  applies to men and women. When attending Orthodox synagogues, women will likely be expected to wear long sleeves , long skirts , a high neckline , and if married, to cover their hair with a wig, scarf, hat or a combination of the above. For men, short pants or sleeveless shirts are generally regarded as inappropriate. In some Conservative and Reform synagogues the dress code may be more lax, but still respectful.              The Shacharit  prayer is recited in the morning. Halacha limits parts of its recitation to the first three or four hours of the day, where hours are 1/12 of daylight time, making these times dependent on the season.     Various prayers are said upon arising; the tallit katan  is donned at this time. The ": null
    },
    {
        "tallit": "tallit"
    },
    {
        " is donned before or during the actual prayer service, as are the ": null
    },
    {
        "tefillin": "tefillin"
    },
    {
        " ; both are accompanied by blessings.     The service starts with the morning blessings , including blessings for the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " . In Orthodox services this is followed by a series of readings from Biblical and rabbinic writings recalling the ": null
    },
    {
        "offerings": "korban"
    },
    {
        " made in the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ". The section concludes with the Rabbis ": null
    },
    {
        "Kaddish": "kaddish"
    },
    {
        " .     The next section of morning prayers is called Pesukei DZimrah , containing several ": null
    },
    {
        "psalms": "psalms"
    },
    {
        " , and prayers  made from a tapestry of Biblical verses, followed by the ": null
    },
    {
        "Song at the Sea": "exodus 15.1–15.18"
    },
    {
        " .     Barechu, the formal public call to prayer, introduces a series of expanded blessings embracing the recitation of the  Shema . This is followed by the core of the prayer service, the  Amidah  or Shemoneh Esreh, a series of 19 blessings. The next part of the service, is  Tachanun , supplications, which is omitted on days with a festive character .     On Mondays and Thursdays a ": null
    },
    {
        "Torah reading": "torah reading"
    },
    {
        " service is inserted, and a longer version of Tachanun takes place.     Concluding prayers  and ": null
    },
    {
        "Aleinu": "aleinu"
    },
    {
        " then follow, with the Kaddish of the mourners generally after Aleinu.          Mincha or Minha may be recited from half an hour after halachic noontime. This earliest time is referred to as mincha gedola . There is, however, another time to daven mincha, which is then known as mincha ketana . Ideally, one should complete the prayers before sunset, although many authorities permit reciting Mincha until nightfall. Mincha is allowed to be recited during any of the hours between mincha gedola and mincha ketana also.     ": null
    },
    {
        "Sephardi": "sephardi"
    },
    {
        "m and ": null
    },
    {
        "Italian Jews": "italian jews"
    },
    {
        " start the Mincha prayers with ": null
    },
    {
        "Psalm 84": "psalm 84"
    },
    {
        " and Korbanot , and usually continue with the Pittum hakketoret. The opening section is concluded with . Western Ashkenazim recite the Korbanot only.     Ashrei, containing verses from ": null
    },
    {
        "Psalms": "psalm"
    },
    {
        " ,  and the entire , is recited, immediately followed by  Chatzi Kaddish  and the Shemoneh Esreh . This is followed by  Tachanun , supplications, and then the full Kaddish. Sephardim insert Psalm  or , followed by the Mourners Kaddish. After this follows, in most modern rites, the  Aleinu . Ashkenazim then conclude with the Mourners Kaddish. Service leaders often wear a tallit even on normal days, and must wear one during the ": null
    },
    {
        "fast days": "taanit"
    },
    {
        ".                 In many congregations, the afternoon and evening prayers are recited back-to-back on a working day, to save people having to attend synagogue twice. In strict law, one should only recite Mincha between sunset and nightfall if one recites Arvit after nightfall; conversely one should only recite Arvit between sunset and nightfall if one recites Mincha before sunset; in other words one should not take advantage of both flexibilities at once so as to combine the prayers. The prevailing practice, of doing exactly that, is regarded as an emergency measure. On yet another view, the disputed period is not that between sunset and nightfall but the last seasonally adjusted hour and a quarter before sunset. The ": null
    },
    {
        "Vilna Gaon": "vilna gaon"
    },
    {
        " discouraged this practice, and followers of his set of customs commonly wait until after nightfall to recite Maariv . One reason for this is that, while the prevailing practice may satisfy the law concerning the timing of Arvit in the sense of the evening Amidah, it means that the evening Shema is recited too early.     This service begins with the Barechu, the formal public call to prayer, and Shema Yisrael embraced by two benedictions before and two after. ": null
    },
    {
        "Ashkenazi": "ashkenazi"
    },
    {
        "m outside of Israel  then add another blessing , which is made from a tapestry of biblical verses.  This is followed by the Half-Kaddish, and the Shemoneh Esreh , bracketed with the full Kaddish. ": null
    },
    {
        "Sephardi": "sephardi"
    },
    {
        "m then say Psalm 121, say the Mourners Kaddish, and repeat Barechu before concluding with the Aleinu. ": null
    },
    {
        "Ashkenazi": "ashkenazi"
    },
    {
        "m, in the ": null
    },
    {
        "diaspora": "jewish diaspora"
    },
    {
        ", do neither say Psalm 121 nor repeat Barechu, but conclude with Aleinu followed by the Mourners Kaddish .       On ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " , prayers are similar in structure to those on weekdays, although almost every part is lengthened. One exception in the  Amidah , the main prayer, which is abridged. The first three and last three blessings are recited as usual, but the middle thirteen are replaced with a single blessing known as sanctity of the day, describing the Sabbath. Atypically, this middle blessing is different for each of the prayers.       ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " services begin on Friday evening with the weekday Mincha , followed in some communities by the ": null
    },
    {
        "Song of Songs": "song of songs"
    },
    {
        ", and then in most communities by the Kabbalat Shabbat, the mystical prelude to Shabbat services composed by 16th-century ": null
    },
    {
        "Kabbalists": "kabbalists"
    },
    {
        ". This ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " term literally means Receiving the Sabbath . In many communities, the piyut  Yedid Nefesh  introduces the Kabbalat Shabbat prayers.     Kabbalat Shabbat is, except amongst many ": null
    },
    {
        "Italian": "italian jews"
    },
    {
        " and ": null
    },
    {
        "Spanish and Portuguese Jews": "spanish and portuguese jews"
    },
    {
        ", composed of six psalms,  to , and , representing the six week-days. Next comes the poem  Lekha Dodi . Composed by Rabbi ": null
    },
    {
        "Shlomo Halevi Alkabetz": "shlomo halevi alkabetz"
    },
    {
        " in the mid-16th century, it is based on the words of the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        "ic sage Hanina: Come, let us go out to meet the Queen Sabbath . Kabbalat Shabbat is concluded by  and . Many add a study section here, including Bameh Madlikin and Amar rabbi Elazar and the concluding Kaddish deRabbanan and is then followed by the Maariv service; other communities delay the study session until after Maariv. Still other customs add here a passage from the ": null
    },
    {
        "Zohar": "zohar"
    },
    {
        ". In modern times the Kabbalat Shabbat has been set to music by many composers including: ": null
    },
    {
        "Robert Strassburg": "robert strassburg"
    },
    {
        "    and ": null
    },
    {
        "Samuel Adler": "samuel adler"
    },
    {
        "      The ": null
    },
    {
        "Shema": "shema yisrael"
    },
    {
        " section of the Friday night service varies in some details from the weekday services—mainly in the different ending of the Hashkivenu prayer and the omission of Baruch Adonai le-Olam prayer in those traditions where this section is otherwise recited. In the ": null
    },
    {
        "Italian rite": "italian jewsitalian rite jews"
    },
    {
        ", there are also different versions of the Maariv aravim prayer  and the Ahavat olam prayer.     Most commemorate the Shabbat at this point with VeShameru . The custom to recite the biblical passage at this point has its origins in the Lurianic ": null
    },
    {
        "Kabbalah": "kabbalah"
    },
    {
        ", and does not appear before the 16th century. It is therefore absent in traditions and prayer books less influenced by the Kabbalah , or those that opposed adding additional readings to the siddur based upon the Kabbalah .     The middle blessing of the  Amidah  discusses the conclusion of the Creation, quoting the relevant verses from ": null
    },
    {
        "Genesis": "book of genesis"
    },
    {
        ". This is then followed by the ": null
    },
    {
        "hazzans": "hazzan"
    },
    {
        "mini-repetition of the Amidah, Magen Avot, a digest of the ": null
    },
    {
        "seven benedictions": "seven-faceted blessing"
    },
    {
        " . In some ": null
    },
    {
        "Ashkenazi": "ashkenazi"
    },
    {
        " Orthodox": "orthodox judaism"
    },
    {
        " synagogues the second chapter of ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        " tractate Shabbat, Bameh Madlikin, is read at this point, instead of earlier. ": null
    },
    {
        "Kiddush": "kiddush"
    },
    {
        " is recited in the synagogue in Ashkenazi and a few Sephardi communities. The service then follows with ": null
    },
    {
        "Aleinu": "aleinu"
    },
    {
        ". Most Sephardi and many Ashkenazi synagogues end with the singing of  Yigdal , a poetic adaptation of ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " 13 principles of Jewish faith. Other Ashkenazi synagogues end with  Adon olam  instead.          ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " morning prayers commence as on week-days. Of the hymns, Psalm 100 , is omitted because the todah or Thanksgiving ": null
    },
    {
        "offering": "korbanot"
    },
    {
        " could not be offered on ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " in the days of the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ". Its place is taken in the ": null
    },
    {
        "Ashkenazi": "ashkenazi"
    },
    {
        " tradition by Psalms , , , , , , , , . ": null
    },
    {
        "Sephardi": "sephardi"
    },
    {
        "c Jews maintain a different order, add several psalms and two religious poems. The Nishmat prayer is recited at the end of the Pesukei DZimrah. The blessings before Shema are expanded, and include the hymn El Adon, which is often sung communally.     The intermediary benediction of the Shacharit Amidah  begins with Yismach Moshe and discusses Moses receiving of the Torah . ": null
    },
    {
        "Kedushah": "kedushah"
    },
    {
        ", which is always recited during the ": null
    },
    {
        "Hazzans": "hazzan"
    },
    {
        "repetition of the third blessing, is significantly expanded. After the repetition is concluded, the Torah scroll is taken out of the Ark in a ritual much longer than the ritual during the week, and the ": null
    },
    {
        "weekly portion": "parsha"
    },
    {
        " is ": null
    },
    {
        "read": "torah reading"
    },
    {
        ", followed by the  haftarah .     After the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " reading, three prayers for the community are recited. Two prayers starting with  Yekum Purkan , composed in Babylon in ": null
    },
    {
        "Aramaic": "aramaic language"
    },
    {
        ", are similar to the subsequent Mi sheberakh, a blessing for the leaders and patrons of the synagogue. The Sephardim omit much of the Yekum Purkan. Prayers are then recited for the government of the country, for peace, and for the State of ": null
    },
    {
        "Israel": "israel"
    },
    {
        ".     After these prayers, Ashrei is repeated and the Torah scroll is returned to the Ark in a procession through the Synagogue. Many congregations allow children to come to the front in order to kiss the scroll as it passes. In many Orthodox communities, the Rabbi delivers a sermon at this point, usually on the topic of the Torah reading.           The Musaf service starts with the silent recitation of the  Amidah . The middle blessing includes the Tikanta Shabbat reading on the holiness of ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        ", and then by a reading from the biblical ": null
    },
    {
        "Book of Numbers": "book of numbers"
    },
    {
        " about the sacrifices that used to be performed in the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ". Next comes Yismechu, They shall rejoice in Your sovereignty , and Eloheynu, Our God and God of our Ancestors, may you be pleased with our rest        In the event one of the prayers was missed inadvertently, the Amidah prayer is said twice in the next service—a procedure known as tefillat tashlumin. Brachot 26a       Many Jews sway their body back and forth during prayer. This practice  is not mandatory, and in fact the ": null
    },
    {
        "kabbalist": "kabbalah"
    },
    {
        " Isaac Luria": "isaac luria"
    },
    {
        " felt that it should not be done. In contrast, the German Medieval authority  Maharil  linked the practice to a statement in the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " that the Mishnaic sage ": null
    },
    {
        "Rabbi Akiva": "rabbi akiva"
    },
    {
        " would sway so forcefully that he ended up at the other side of the room when praying .     Many are accustomed to giving charity before, during  or after prayer, in the hopes that this will make their prayer more likely to be heard.       Men are obligated to perform public prayer three times a day with additional services on ": null
    },
    {
        "Jewish holidays": "jewish holidays"
    },
    {
        ". According to Jewish law, each prayer must be performed ": null
    },
    {
        "within specific time ranges ": "zmanim"
    },
    {
        ", based on the time that the communal ": null
    },
    {
        "sacrifice": "korban"
    },
    {
        " the prayer is named after would have been performed in the days of the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ".     According to the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " women are generally exempted from obligations that have to be performed at a certain time. Orthodox authorities have generally interpreted this exemption due to womens higher spiritual level and therefore a lack of need to connect to God at specific times, since they are always connected to God. In accordance with the general exemption from time-bound obligations, most Orthodox authorities have exempted women from performing evening prayers , but most believe that women are obligated to pray ": null
    },
    {
        "Shacharit": "shacharit"
    },
    {
        " and ": null
    },
    {
        "Mincha": "mincha"
    },
    {
        ", the morning and afternoon prayers, respectively, when possible. According to the Mishna, women are exempt from the morning and evening ": null
    },
    {
        "Shema": "shema yisrael"
    },
    {
        ".              Orthodox authorities have been careful to note that although some women with small children have been exempted from praying at specific fixed times, they are not exempted from the obligation of prayer itself. The 19th-century ": null
    },
    {
        "posek": "posek"
    },
    {
        " Yechiel Michel Epstein": "yechiel michel epstein"
    },
    {
        ", author of the  Arukh HaShulkhan , notes: Even though the rabbis set prayer at fixed times in fixed language, it was not their intention to issue a leniency and exempt women from this ritual act . Traditionally women were also reciting individual ": null
    },
    {
        "tkhine": "tkhine"
    },
    {
        " prayers in Yiddish.     Authorities have disagreed on the minimum amount that womens prayer should contain. Many Jewish women have relied on an idea expressed by Rabbi ": null
    },
    {
        "Avraham Gombiner": "avraham gombiner"
    },
    {
        " in his  Magen Avraham  commentary on the  Shulkhan Arukh , ": null
    },
    {
        "Shulkhan Arukh": "shulkhan arukh"
    },
    {
        " section  Orach Chayim  106:2 and more recently the  Rabbi ": null
    },
    {
        "Ovadia Yosef": "ovadia yosef"
    },
    {
        " , that women are only required to pray once a day, in any form they choose, so long as the prayer contains praise of , requests to , and thanks of God.  ,  Nishmat  However, most Orthodox authorities agree that women are not completely exempt from time-bound prayer. The  Mishnah Berurah  by Rabbi ": null
    },
    {
        "Yisrael Meir Kagan": "yisrael meir kagan"
    },
    {
        ", an important code of ": null
    },
    {
        "Ashkenzic": "ashkenazi judaism"
    },
    {
        " Jewish law, holds that the Men of the ": null
    },
    {
        "Great Assembly": "great assembly"
    },
    {
        " obligated women to say Shacharit and Minchah prayer services each day, just like men . The Mishnah Berurah also states that although women are exempt from reciting the ": null
    },
    {
        "Shema Yisrael": "shema yisrael"
    },
    {
        ", they should nevertheless say it anyway. Nonetheless, even the most liberal Orthodox authorities hold that women cannot count in a minyan for purposes of public prayer.     Throughout ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        ", including its most liberal forms, men and women are required to sit in separate sections with a ": null
    },
    {
        "mechitza": "mechitza"
    },
    {
        " separating them. Historically, a learned woman in the weibershul of a synagogue took on the informal role of precentress or ": null
    },
    {
        "firzogerin": "firzogerin"
    },
    {
        " for the women praying in parallel to the main service led in the mens section. Conservative/Masorti Judaism permits mixed seating . All Reform and Reconstructionist congregations have mixed seating.     ": null
    },
    {
        "Haredi": "haredi"
    },
    {
        " and the vast majority of ": null
    },
    {
        "Modern Orthodox": "modern orthodox"
    },
    {
        " Judaism has a blanket prohibition on women leading public congregational prayers. Conservative Judaism has developed a blanket justification for women leading all or virtually all such prayers, holding that although only obligated individuals can lead prayers and women were not traditionally obligated, Conservative Jewish women in modern times have as a collective whole voluntarily undertaken such an obligation.   Reform and Reconstructionist congregations permit women to perform all prayer roles because they do not regard ": null
    },
    {
        "halakha": "halakha"
    },
    {
        " as binding.     A small liberal wing within Modern Orthodox Judaism, particularly rabbis friendly to the ": null
    },
    {
        "Jewish Orthodox Feminist Alliance": "jewish orthodox feminist alliance"
    },
    {
        " , has begun re-examining the role of women in prayers based on an individual, case-by-case look at the historical role of specific prayers and services, doing so within classical halakhic interpretation. Accepting that where obligation exists only the obligated can lead, this small group has typically made three general arguments for expanded womens roles:      Because women were required to perform certain ": null
    },
    {
        "korbanot": "korbanot"
    },
    {
        " in the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ", women today are required to perform, and hence can lead , the specific prayers substituting for these specific sacrifices. Birchat Hagomel falls in this category.   Because certain parts of the service were added after the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " defined mandatory services, such prayers are equally voluntary on everyone and hence can be led by women . Pseukei DZimrah in the morning and Kabbalat Shabbat on Friday nights fall in this category.   In cases where the Talmud indicates that women are generally qualified to lead certain services but do not do so because of the dignity of the congregation , modern congregations are permitted to waive such dignity if they wish. Torah reading on Shabbat falls in this category. An argument that women are permitted to lead the services removing and replacing the Torah in the Ark on Shabbat extends from their ability to participate in Torah reading then.     A very small number of Modern Orthodox congregations accept some such arguments, but very few Orthodox congregations or authorities accept all or even most of them. Many of those who do not accept this reasoning point to kol isha, the tradition that prohibits a man from hearing a woman other than his wife or close blood relative sing. JOFA refers to congregations generally accepting such arguments as ": null
    },
    {
        "Partnership Minyan": "partnership minyan"
    },
    {
        "im. On Shabbat in a Partnership Minyan, women can typically lead Kabbalat Shabbat, the Pseukei DZimrah, the services for removing the Torah from and replacing it to the Ark, and Torah reading, as well as give a DVar Torah or sermon.     The first Orthodox Jewish womens prayer group was created on the holiday of ": null
    },
    {
        "Simhat Torah": "simhat torah"
    },
    {
        " at ": null
    },
    {
        "Lincoln Square Synagogue": "lincoln square synagogue"
    },
    {
        " in Manhattan in the late 1960s.      ": null
    },
    {
        "Ephraim Mirvis": "ephraim mirvis"
    },
    {
        ", an Orthodox rabbi who serves as the Chief Rabbi of the United Hebrew Congregations of the Commonwealth, supports ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " prayer groups for Orthodox women, saying, Some of our congregations have women prayer groups for Friday night, some Saturday mornings. This is without women reading from the Torah. But for women to come together as a group to pray, this is a good thing.        In most divisions of ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " boys prior to ": null
    },
    {
        "Bar Mitzvah": "bar mitzvah"
    },
    {
        " cannot act as a ": null
    },
    {
        "Chazzen": "hazzan"
    },
    {
        " for prayer services that contain devarim shebkidusha, i.e. ": null
    },
    {
        "Kaddish": "kaddish"
    },
    {
        ", Barechu, the amida, etc., or receive an aliya or chant the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " for the congregation. Since ": null
    },
    {
        "Kabbalat Shabbat": "friday night services"
    },
    {
        " is just ": null
    },
    {
        "psalms": "psalms"
    },
    {
        " and does not contain devarim shebkidusha, it is possible for a boy under Bar Mitzvah to lead until Barechu of Maariv. As well, the conclusion of the service on Shabbat and Chagim may be led by children. Under the Moroccan, Yemenite, and Mizrachi customs, a boy under bar mitzvah may lead certain prayers, read the Torah, and have an aliyah. Epstein, Morris. All About Jewish Holidays and Customs. Ktav Publishing House, 1959. p. 89 It is customary among many Ashkenazim to have children sing Adon Olam after Mussaf and Yigdal after Shabat and Holiday Maariv. Among Sefardim, Mizrachim, Yemenites, and some Askenazim, a child leads the congregation in ": null
    },
    {
        "Kriyat Shema": "kiryat shema"
    }
]