[
    {
        "Johannes Oecolampadius   was a ": null
    },
    {
        "German": "germans"
    },
    {
        " Protestant": "protestant"
    },
    {
        " reformer": "protestant reformation"
    },
    {
        " in the ": null
    },
    {
        "Reformed tradition": "reformed tradition"
    },
    {
        " from the ": null
    },
    {
        "Electoral Palatinate": "electorate of the palatinate"
    },
    {
        ". He was the leader of the Protestant faction in the Baden Disputation of 42 and he was one of the founders of ": null
    },
    {
        "Protestant theology": "protestant theology"
    },
    {
        ", engaging in disputes with ": null
    },
    {
        "Erasmus": "erasmus"
    },
    {
        ", ": null
    },
    {
        "Zwingli": "zwingli"
    },
    {
        ", ": null
    },
    {
        "Luther": "martin luther"
    },
    {
        " and ": null
    },
    {
        "Martin Bucer": "martin bucer"
    },
    {
        ". Calvin adopted his view on the ": null
    },
    {
        "eucharist dispute": "real presence of christ in the eucharist"
    },
    {
        " .     His ": null
    },
    {
        "German surname": "german surname"
    },
    {
        " was Hussgen , which he etymologized to Hausschein and graecicized to Oecolampadius .       He was born as Johannes Heussgen in ": null
    },
    {
        "Weinsberg": "weinsberg"
    },
    {
        ", then part of the ": null
    },
    {
        "Electorate of the Palatinate": "electorate of the palatinate"
    },
    {
        ". He attended school at Weinsberg and ": null
    },
    {
        "Heilbronn": "heilbronn"
    },
    {
        ", and then, intending to study law, he went to ": null
    },
    {
        "Bologna": "bologna"
    },
    {
        ", but soon returned to ": null
    },
    {
        "Heidelberg": "university of heidelberg"
    },
    {
        " and took up ": null
    },
    {
        "theology": "theology"
    },
    {
        ". Enthusiastic about the ": null
    },
    {
        "new learning": "new learning"
    },
    {
        ", he passed from the study of Greek to that of ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        ", taking his bachelors degree in 42 He became cathedral preacher at ": null
    },
    {
        "Basel": "basel"
    },
    {
        " in 42 serving under ": null
    },
    {
        "Christoph von Utenheim": "christoph von utenheim"
    },
    {
        ", the humanist ": null
    },
    {
        "bishop of Basel": "bishop of basel"
    },
    {
        ". In Basel, Oecolampadius became an editorial assistant and Hebrew consultant to ": null
    },
    {
        "Erasmus": "erasmus"
    },
    {
        " first edition of the ": null
    },
    {
        "Greek New Testament": "novum instrumentum omne"
    },
    {
        ", and wrote that editions epilogue in praise of his master.       From the beginning the sermons of Oecolampadius centred on ": null
    },
    {
        "atonement": "atonement in christianity"
    },
    {
        ", and his first reformatory zeal showed itself in a protest  against the introduction of humorous stories into ": null
    },
    {
        "Easter": "easter"
    },
    {
        " sermons. In 42 he published his Greek Grammar. Two years later, he received an invitation to become preacher in the high church in ": null
    },
    {
        "Augsburg": "augsburg"
    },
    {
        ". Germany was ablaze with the questions raised by ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        "s ": null
    },
    {
        "theses": "95 theses"
    },
    {
        ", and Oecolampadiuss introduction into this environment, when he championed Luthers position, especially in his anonymous Canonici indocti , seems to have compelled him to severe self-examination, which ended in his becoming a ": null
    },
    {
        "monk": "monk"
    },
    {
        ". A short experience convinced him that this was not for him the ideal Christian life . His position as priest in Augsburg was filled by ": null
    },
    {
        "Urbanus Rhegius": "urbanus rhegius"
    },
    {
        ".     In February 42 he made his way to ": null
    },
    {
        "Ebernburg": "ebernburg"
    },
    {
        ", near ": null
    },
    {
        "Creuznach": "kreuznach"
    },
    {
        ", where he acted as chaplain to a little group of men holding the new opinions who had settled there under the leadership of ": null
    },
    {
        "Franz von Sickingen": "franz von sickingen"
    },
    {
        ".        Oecolampadius returned to ": null
    },
    {
        "Basel": "basel"
    },
    {
        " in November 42 as vicar of St Martins, and reader of the ": null
    },
    {
        "Holy Scripture": "holy scripture"
    },
    {
        " at the ": null
    },
    {
        "University of Basel": "university of basel"
    },
    {
        ". Lecturing on  Isaiah , he condemned current ecclesiastical abuses, and in a public disputation gained such success that Erasmus writing to ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        " said, Oecolampadius has the upper hand amongst us. He became ": null
    },
    {
        "Huldrych Zwingli": "huldrych zwingli"
    },
    {
        "s loyal friend and ally, and after more than a year of earnest preaching and four public disputations in which the popular verdict went in favour of Oecolampadius and his friends, the authorities of Basel began to see the need for ": null
    },
    {
        "Reformation": "protestant reformation"
    },
    {
        ".     At last Oecolampadius was able to refrain from some practices he believed to be superstitious. Basel was slow to accept the Reformation; the news of the ": null
    },
    {
        "Peasants War": "german peasants war"
    },
    {
        " of 4242 and the inroads of ": null
    },
    {
        "Anabaptists": "anabaptists"
    },
    {
        " prevented progress; but by 42 it seemed as if the authorities were resolved to listen to schemes for restoring the purity of worship and teaching. In the midst of these hopes and difficulties Oecolampadius married, in the beginning of 42 ": null
    },
    {
        "Wibrandis Rosenblatt": "wibrandis rosenblatt"
    },
    {
        ", the widow of Ludwig Keller, who proved a suitable wife. After his death she married ": null
    },
    {
        "Wolfgang Fabricius Capito": "wolfgang fabricius capito"
    },
    {
        ", and, when Capito died, ": null
    },
    {
        "Martin Bucer": "martin bucer"
    },
    {
        ". She died in 42     In January 42 Oecolampadius and Zwingli took part in the disputation at ": null
    },
    {
        "Bern": "bern"
    },
    {
        " which led to the adoption of the new faith in that ": null
    },
    {
        "canton": "cantons of switzerland"
    },
    {
        ", and in the following year to the discontinuance of the ": null
    },
    {
        "Mass": "mass"
    },
    {
        " at Basel. In 42 he became officially the  Antistes  of the ": null
    },
    {
        "Reformed Church": "reformed church"
    },
    {
        " in Basel. The ": null
    },
    {
        "Anabaptist": "anabaptist"
    },
    {
        "s claimed Oecolampadius for their views, but in a disputation with them he dissociated himself from most of their positions.     He died on 42 November 42          Oecolampadius was considered to be a brilliant Protestant theologian, who conversed with ": null
    },
    {
        "Johannes Eck": "johannes eck"
    },
    {
        ", ": null
    },
    {
        "Philipp Melanchthon": "philipp melanchthon"
    },
    {
        " and was Professor of theology at the University of Basel. As a theologian, he did not have the glamour of Luther, Zwingli or ": null
    },
    {
        "Calvin": "john calvin"
    },
    {
        ", but he became a trusted religious leader. He was respected even among Catholic scholars of his time and was quoted over forty years after his death by the ": null
    },
    {
        "Jesuit": "jesuit"
    },
    {
        " St.": "saint"
    },
    {
        " Peter Canisius": "peter canisius"
    },
    {
        " in his work De Maria Virgine. With Zwingli he represented the Swiss at the Marburg Colloquy. His views on the Eucharist upheld the metaphorical against the literal interpretation of the word body, but he asserted that believers partook of the sacrament more for the sake of others than for their own, though later he emphasized it as a means of grace for the Christian life. To Luthers doctrine of the ubiquity of Christs body he opposed that of the presence and activity of the Holy Spirit in the church. His views on the Eucharist prompted Luther to publish several sermons on the subject in his 42  The Sacrament of the Body and Blood of Christ—Against the Fanatics . He did not minutely analyse the doctrine of predestination as Luther, Calvin and Zwingli did, contenting himself with the summary Our Salvation is of God, our perdition of ourselves.     Theologically he was considered to be close to Zwingli, with whom he shared a friendly attitude towards ": null
    },
    {
        "Mary": "protestant views of mary"
    },
    {
        " and ": null
    },
    {
        "Marian veneration": "blessed virgin mary"
    },
    {
        ". He is considered an example of Protestant Marian piety of his time, largely in light of his sermons. He calls Mary the ": null
    },
    {
        "mediatrix": "mediatrix"
    },
    {
        " or mediator  of all graces, to whom the Lord had entrusted the treasure of Grace Thesaurus gratiarum. Oecolampadius borrowed from ": null
    },
    {
        "Radulfus Ardens": "radulfus ardens"
    },
    {
        " and others the image of Mary as the neck who mediates all graces of Christ to his mystical body, the church. This view was defended in the 42th century by ": null
    },
    {
        "Gabriel Roschini": "gabriel roschini"
    },
    {
        ", and more generally, by ": null
    },
    {
        "Pope Pius XII": "pope pius xii"
    },
    {
        " in his encyclical  Mystici corporis  as official doctrine of the Catholic Church.     In De laudando in Maria Deo given in ": null
    },
    {
        "Augsburg": "augsburg"
    },
    {
        " 42 he states that God cannot be praised more in any creature than through Mary. His gifts and graces are expressed in her. God honoured her by becoming human through her. Mary surpassed ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        " with her faith, ": null
    },
    {
        "Isaac": "isaac"
    },
    {
        " with her patience and Joseph with her chastity. She is queen of all heavenly powers. Yet, according to Oecolampadius, ": null
    },
    {
        "Catholic veneration of Mary": "blessed virgin mary"
    },
    {
        " went too far, because of the numerous titles given to Mary: they surpass in number and content the veneration of Christ himself. The ": null
    },
    {
        "rosary": "rosary"
    },
    {
        " is cited as an example with its 42 Hail Marys and only ten prayers to God. He is also critical of popular customs, by which every Saturday is solemnly observed in her honour, with abstinence from wine and sexual relations, while the following Lord’s day is characterized by heavy drinking and all kinds of entertainments. Throughout his life, Oecolampadius preached the ": null
    },
    {
        "perpetual virginity": "perpetual virginity"
    },
    {
        " of Mary, who through her life and her works gave a shining example of Christian virtues. Mary’s life was a life of service and compassion as documented in her visit to Elizabeth.          ": null
    }
]