[
    {
        "   Johann Caspar von Orelli , was a ": null
    },
    {
        "Swiss": "switzerland"
    },
    {
        " classical scholar.     He was born at ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        " of a distinguished Italian family which had taken refuge in Switzerland at the time of the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        ". His cousin, Johann Conrad Orelli , was the author of several works in the department of later ": null
    },
    {
        "Greek literature": "greek literature"
    },
    {
        ".     From 42 to 42 Orelli worked as preacher in the reformed community of ": null
    },
    {
        "Bergamo": "bergamo"
    },
    {
        ", where he acquired the taste for ": null
    },
    {
        "Italian literature": "italian literature"
    },
    {
        " which led to the publication of Contributions to the History of Italian Poetry and a biography of ": null
    },
    {
        "Vittorino da Feltre": "vittorino da feltre"
    },
    {
        ", his ideal of a teacher.     In 42 he became teacher of modern languages and history at the cantonal school at ": null
    },
    {
        "Chur": "chur"
    },
    {
        "; in 42 professor of eloquence and ": null
    },
    {
        "hermeneutics": "hermeneutics"
    },
    {
        " at the ": null
    },
    {
        "Carolinum, Zürich": "carolinum, zürich"
    },
    {
        ", and in 42 professor at the new ": null
    },
    {
        "University of Zürich": "university of zürich"
    },
    {
        ", the foundation of which was largely due to his efforts. His attention during this period was mainly devoted to classical literature and antiquities. He had already published an edition, with critical notes and commentary, of the  Antidosis  of ": null
    },
    {
        "Isocrates": "isocrates"
    },
    {
        ", the complete text of which, based upon the manuscripts in the Ambrosian and Laurentian libraries, had been made known by ": null
    },
    {
        "Andreas Mustoxydis": "andreas mustoxydis"
    },
    {
        " of ": null
    },
    {
        "Corfu": "corfu"
    },
    {
        ".     The three works upon which his reputation rests are the following:   A complete edition of ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        " in seven volumes . The first four volumes contained the text , the fifth the old Scholiasts, the remaining three  a life of Cicero, a bibliography of previous editions, indexes of geographical and historical names, of laws and legal formulae, of Greek words, and the consular annals. After his death, the revised edition of the text was completed by ": null
    },
    {
        "JG Baiter": "johann georg baiter"
    },
    {
        " and ": null
    },
    {
        "K Halm": "karl felix halm"
    },
    {
        ", and contained numerous emendations by ": null
    },
    {
        "Theodor Mommsen": "theodor mommsen"
    },
    {
        " and ": null
    },
    {
        "JN Madvig": "johan nicolai madvig"
    },
    {
        ".   The works of Horace  . The exegetical commentary, although confessedly only a compilation from the works of earlier commentators, shows great taste and extensive learning, although hardly up to the exacting standard of modern criticism.   Inscriptionum Latinarum Selectarum Collectio , extremely helpful for the study of Roman public and private life and religion. His editions of ": null
    },
    {
        "Plato": "plato"
    },
    {
        "  and ": null
    },
    {
        "Tacitus": "gaius cornelius tacitus"
    },
    {
        " also deserve mention.     He was a most liberal-minded man, both in politics and religion, an enthusiastic supporter of popular education and a most inspiring teacher. He took great interest in the struggle of the Greeks for independence, and strongly favoured the appointment of the notorious ": null
    },
    {
        "David Strauss": "david strauss"
    },
    {
        " to the chair of ": null
    },
    {
        "dogmatic theology": "dogmatic theology"
    }
]