[
    {
        "   Johann Heinrich Voss  was a ": null
    },
    {
        "German": "germans"
    },
    {
        " classicist and poet, known mostly for his translation of ": null
    },
    {
        "Homer": "homer"
    },
    {
        "s  Odyssey  and  Iliad  into ": null
    },
    {
        "German": "german language"
    },
    {
        ".       Voss was born at ": null
    },
    {
        "Sommersdorf": "sommersdorf"
    },
    {
        " in ": null
    },
    {
        "Mecklenburg-Strelitz": "duchy of mecklenburg-strelitz"
    },
    {
        " as the son of a farmer. After attending the ": null
    },
    {
        "Gymnasium": "gymnasium"
    },
    {
        " at ": null
    },
    {
        "Neubrandenburg": "neubrandenburg"
    },
    {
        " from 42–42 he was obliged to accept a private tutorship in order to earn money to enable him to study at a university.     At the invitation of ": null
    },
    {
        "Heinrich Christian Boie": "heinrich christian boie"
    },
    {
        ", whose attention he had attracted by poems contributed to the Göttinger Musenalmanach, he went to the ": null
    },
    {
        "University of Göttingen": "university of göttingen"
    },
    {
        " in 42 Here he studied ": null
    },
    {
        "philology": "philology"
    },
    {
        ", his studies encompassing both ": null
    },
    {
        "classical": "classics"
    },
    {
        " and ": null
    },
    {
        "modern language": "modern language"
    },
    {
        "s, and became one of the leading spirits in the famous Hain or Dichterbund. In 42 Boie made over to him the editorship of the  Musenalmanach , which he continued to issue for several years. He married Boies sister Ernestine in 42     In 42 Voss was appointed rector of the school at ": null
    },
    {
        "Otterndorf": "otterndorf"
    },
    {
        ". In 42 after the publication of several treatises, he produced a ": null
    },
    {
        "German-language": "german language"
    },
    {
        " text for ": null
    },
    {
        "Homer": "homer"
    },
    {
        "s  Odyssey . This work made the poem national with the ": null
    },
    {
        "Germans": "german people"
    },
    {
        " .     In 42 Voss accepted the rectorship of the gymnasium at ": null
    },
    {
        "Eutin": "eutin"
    },
    {
        ". There, in 42 he published translations of ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        "s  Eclogues  and  Georgics . In 42 his translation of Homers Iliad appeared, along with the Odyssey in a new form. He also produced two volumes of controversial letters addressed to ": null
    },
    {
        "Christian Gottlob Heine": "christian gottlob heine"
    },
    {
        " .     He retired from Eutin in 42 with a pension of 42 ": null
    },
    {
        "thaler": "thaler"
    },
    {
        "s, and settled at ": null
    },
    {
        "Jena": "jena"
    },
    {
        ". In 42 although ": null
    },
    {
        "Johann Wolfgang von Goethe": "johann wolfgang von goethe"
    },
    {
        " used his utmost endeavours to persuade him to stay, Voss accepted a call to a professorship of classical literature at the ": null
    },
    {
        "University of Heidelberg": "university of heidelberg"
    },
    {
        ". Here, in the enjoyment of a considerable salary, he devoted himself entirely to his literary labours, translations and antiquarian research until his death.                   Voss was a man of a remarkably independent and vigorous character. From 42 to 42 he published in two volumes a collection of original poems, to which he afterwards made many additions. An edition of his poems in four volumes was issued in 42 Of these original works, the idyllic poem Luise, is uniformly singled out as his most successful. It was first printed in 42 and reissued with changes in 42 In this work, he sought to apply the style and methods of classical poetry to the expression of modern German thought and sentiment. The later works Wie ward Fritz Stolberg ein Unfreier and Antisymbolik , the latter written in opposition to ": null
    },
    {
        "Georg Friedrich Creuzer": "georg friedrich creuzer"
    },
    {
        ", have been characterized as painstaking and dignified, but dreary.     His poems were often set by contemporary composers such as ": null
    },
    {
        "C.P.E. Bach": "c.p.e. bach"
    },
    {
        ", ": null
    },
    {
        "Johann Friedrich Reichardt": "johann friedrich reichardt"
    },
    {
        ", and ": null
    },
    {
        "Johann Abraham Peter Schulz": "johann abraham peter schulz"
    },
    {
        ", and also later composers such as ": null
    },
    {
        "Felix Mendelssohn": "felix mendelssohn"
    },
    {
        ", ": null
    },
    {
        "Carl Maria von Weber": "carl maria von weber"
    },
    {
        ", and ": null
    },
    {
        "Johannes Brahms": "johannes brahms"
    },
    {
        ". Many of his poems and settings of them were published in the Musenalmanach. Based on his correspondence with Schulz, he favored a folklike style of Lied composition.      Vosss Mythologische Briefe, his Antisymbolik, and other writings made important contributions to the study of ": null
    },
    {
        "mythology": "mythology"
    },
    {
        ". He was also prominent as an advocate of the right of free judgment in religion, and at the time when some members of the Romantic school were being converted to the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ", he produced a strong impression by a powerful article, in Sophronizon, on his friend ": null
    },
    {
        "Friedrich von Stolberg": "friedrich leopold zu stolberg-stolberg"
    },
    {
        "s repudiation of ": null
    },
    {
        "Protestantism": "protestantism"
    },
    {
        " .        According to the Metzler Lexikon, the heroines of the Vosss ballad Der Freier and a ": null
    },
    {
        "German traditional song": "der ritter und die magd"
    },
    {
        " share not only the black colour of hair , but also some primitive — or even erotic — ″sensuality .        It is, however, as a translator that Voss chiefly owes his place in German literature. His translations indicate not only sound scholarship but a thorough mastery of the laws of German diction and rhythm. The most famous of his translations are those of Homer. The translation of the  Odyssey , as originally issued in 42 is singled out as the most successful. He also translated ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        " , ": null
    },
    {
        "Theocritus": "theocritus"
    },
    {
        ", ": null
    },
    {
        "Bion": "bion of smyrna"
    },
    {
        " and ": null
    },
    {
        "Moschus": "moschus"
    },
    {
        " , the whole of ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        " , ": null
    },
    {
        "Horace": "horace"
    },
    {
        " , ": null
    },
    {
        "Tibullus": "tibullus"
    },
    {
        " , ": null
    },
    {
        "Propertius": "propertius"
    },
    {
        " and selections from ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        " . He prepared a critical edition of Tibullus. From 42 to 42 a translation of ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "s plays in 42 volumes was published. This work Voss completed with the help of his sons Heinrich and Abraham, both of whom were scholars and writers of considerable ability, though the result has been characterized as less successful than ": null
    },
    {
        "Schlegel": "august wilhelm schlegel"
    },
    {
        "s work.     Vosss Sämtliche poetische Werke were published by his son Abraham in 42; new ed. 42 A selection is in A. Sauer, Der Göttinger Dichterbund, vol. i. . His Letters were published by his son in 42 or 42 volumes . Voss left a short autobiography, Abriß meines Lebens . See also ": null
    },
    {
        "Wilhelm Herbst": "wilhelm herbst"
    },
    {
        ", Johann Heinrich Voß ; ": null
    },
    {
        "Friedrich Heussner": "friedrich heussner"
    },
    {
        ", Johann Heinrich Voß als Schulmann in Eutin. Festschrift zum hundertjährigen Gedenktage seiner Ankunft daselbst ; and another life by Paulus ; also Prutz, Der Göttinger Dichterbund .     According to  Bartletts Familiar Quotations , Voss is the most likely source for the phrase Wein, Weib und Gesang, or, in English,  wine, women and song . Vosss full phrase is Wer nicht liebt Wein, Weib und Gesang / Der bleibt ein Narr sein Lebelang .       ": null
    }
]