[
    {
        "Johann Jakob Reiske  was a ": null
    },
    {
        "German": "germany"
    },
    {
        " scholar and ": null
    },
    {
        "physician": "physician"
    },
    {
        ". He was a pioneer in the fields of Arabic and Byzantine philology as well as ": null
    },
    {
        "Islamic numismatics": "numismatics"
    },
    {
        ".       Reiske was born at ": null
    },
    {
        "Zörbig": "zörbig"
    },
    {
        ", in the ": null
    },
    {
        "Electorate of Saxony": "electorate of saxony"
    },
    {
        ".     From the ": null
    },
    {
        "orphanage": "orphanage"
    },
    {
        " in ": null
    },
    {
        "Halle": "halle, saxony-anhalt"
    },
    {
        " he passed in 42 to the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        ", and there spent five years. He tried to find his own way in middle ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " literature, to which German schools then gave little attention; but, as he had not mastered the ": null
    },
    {
        "grammar": "grammar"
    },
    {
        ", he soon found this a sore task and took up ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        ". He was poor, having almost nothing beyond his allowance, which for the five years was only two hundred ": null
    },
    {
        "thaler": "thaler"
    },
    {
        "s. But everything of which he could cheat his appetite was spent on Arabic books, and when he had read all that was then printed he thirsted for manuscripts, and in March 42 started on foot for ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        ", joyous though totally unprovided, on his way to ": null
    },
    {
        "Leiden": "leiden"
    },
    {
        " and the treasures of the ": null
    },
    {
        "Warnerianum": "leiden university library"
    },
    {
        ".     At Hamburg, he got some money and letters of recommendation from the Hebraist ": null
    },
    {
        "Friedrich August Wolf": "friedrich august wolf"
    },
    {
        ", and took ship to ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ". There dOrville, to whom he had an introduction, proposed to retain him as his amanuensis at a salary of six hundred ": null
    },
    {
        "guilder": "dutch gulden"
    },
    {
        "s. Reiske refused, though he thought the offer very generous; he did not want money, he wanted manuscripts. When he reached ": null
    },
    {
        "Leiden": "university of leiden"
    },
    {
        " , he found that the lectures were over for the term and that the manuscripts were not open to him.     But dOrville and ": null
    },
    {
        "Albert Schultens": "albert schultens"
    },
    {
        " helped him to private teaching and reading for the press, by which he was able to live. He heard the lectures of A. Schultens, and practised himself in Arabic with his son J.J. Schultens. Through Schultens too he got at Arabic manuscripts, and was even allowed sub rosa to take them home with him. Ultimately he seems to have got free access to the collection, which he catalogued—the work of almost a whole summer, for which the curators rewarded him with nine guilders.     Reiskes first years in Leiden were not unhappy, until he got into serious trouble by introducing emendations of his own into the second edition of Burmanns Petronius, which he had to see through the press. His patrons withdrew from him, and his chance of perhaps becoming professor was gone; dOrville indeed soon came round, for he could not do without Reiske, who did work of which his patron, after dressing it up in his own style, took the credit. But A. Schultens was never the same as before to him; Reiske indeed was too independent, and hurt him by his open criticisms of his masters way of making Arabic mainly a handmaid of ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        ". Reiske himself, however, admitted that Schultens always behaved honourably to him. In 42 by Schultens advice Reiske took up medicine as a study by which he might hope to live if he could not do so by ": null
    },
    {
        "philology": "philology"
    },
    {
        ". In 42 he graduated as M.D., the fees being remitted at Schultens intercession. It was Schultens too who conquered the difficulties opposed to his graduation at the last moment by the faculty of ": null
    },
    {
        "theology": "theology"
    },
    {
        " on the ground that some of his theses had a materialistic ring.     On June 42 42 he left the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " and settled in ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ", where he hoped to get medical practice. But his shy, proud nature was not fitted to gain patients, and the Leipzig doctors would not recommend one who was not a Leipzig graduate. In 42 an Arabic dedication to the electoral prince of ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        " got him the title of professor, but neither the faculty of arts nor that of medicine was willing to admit him among them, and he never delivered a course of lectures. He had still to go on doing literary task-work, but his labour was much worse paid in Leipzig than in Leiden. Still he could have lived and sent his old mother, as his custom was, a yearly present of a piece of leather to be sold in retail if he had been a better manager. But, careless for the morrow, he was always printing at his own cost great books which found no buyers. In his autobiography Lebensbeschreibung he depicted his academical colleagues as hostile; and suspected ": null
    },
    {
        "Ernesti": "johann august ernesti"
    },
    {
        ", under a show of friendship, secretly hindered his promotion. On the other hand, his unsparing reviews made bad blood with the pillars of the university.     In 42 to 42 he turned his attention to Oriental coins. The custodian at the ": null
    },
    {
        "Royal Coin Cabinet": "münzkabinett"
    },
    {
        " in Dresden, Richter, invited him to study the coins with Arabic inscriptions. Richter asked him to explain the texts on the coins. His resulting letters on Arabic coinage were posthumously published by ": null
    },
    {
        "Johann Gottfried Eichhorn": "johann gottfried eichhorn"
    },
    {
        ". He did it very eagerly with the hope to find a suitable bread job in Dresden. However, the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        " ended all hopes to find anything in Oriental studies. His letters on Arabic coinage were the first serious attempt to compare the historical information gathered from the Islamic coins - bearing up to 42 words – with the information from chronicles, to achieve new insights in medieval Islamic history. Among the Orientalists at his time he was now known as someone knowledgeable on Islamic coins. He was later approached by ": null
    },
    {
        "Carsten Niebuhr": "carsten niebuhr"
    },
    {
        " to identify the coins which he brought with him from his travels. But Reiske never came back seriously to this topic.     At length in 42 the magistrates of Leipzig rescued him from his misery by giving him the rectorate of St. Nicolai, and, though he still made no way with the leading men of the university and suffered from the hostility of men like ": null
    },
    {
        "Ruhnken": "david ruhnken"
    },
    {
        " and ": null
    },
    {
        "J.D. Michaelis": "johann david michaelis"
    },
    {
        ", he was compensated for this by the esteem of ": null
    },
    {
        "Frederick the Great": "frederick the great"
    },
    {
        ", of ": null
    },
    {
        "Lessing": "gotthold ephraim lessing"
    },
    {
        ", Niebuhr, and many foreign scholars.     The last decade of his life was made cheerful by his marriage with Ernestine Müller, who shared all his interests and learned ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " to help him with collations. In proof of his gratitude, her portrait stands beside his in the first volume of the Oratores Graeci. Reiske died in Leipzig on 42 August 42 and his manuscript remains passed, through Lessings mediation, to the Danish historian ": null
    },
    {
        "P.F. Suhm": "peter frederik suhm"
    },
    {
        ", and are now in the ": null
    },
    {
        "Royal Library, Copenhagen": "royal library, copenhagen"
    },
    {
        ".         Reiske excelled as a scholar of ": null
    },
    {
        "Arabic literature": "arabic literature"
    },
    {
        ". Interested in the history and the realia of the literature, he cared less for the verse of the poets than for the historical notices to be found in their scholia - the much praised poetry of Hariri seemed to him a grammatical pedant. The scholia on ": null
    },
    {
        "Jarir": "jarir"
    },
    {
        " provided information on the prevalence of ": null
    },
    {
        "Buddhist": "buddhism"
    },
    {
        " doctrine and ": null
    },
    {
        "asceticism": "asceticism"
    },
    {
        " in ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        " under the ": null
    },
    {
        "Omayyad": "omayyad"
    },
    {
        "s. In the Adnotationes historicae to his  Abulfeda  , he collected a veritable treasure of sound and original research; he knew the ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " writers as thoroughly as the Arabic authors, and was alike at home in modern works of travel in all languages and in ancient and medieval authorities. He was interested too in ": null
    },
    {
        "numismatics": "numismatics"
    },
    {
        ".     To comprehensive knowledge and very wide reading he added a sound historical judgment. He was not, like ": null
    },
    {
        "Schultens": "albert schultens"
    },
    {
        ", deceived by the pretended antiquity of the ": null
    },
    {
        "Yemen": "yemen"
    },
    {
        "ite  Qasida s. Errors no doubt he made, as in the attempt to ascertain the date of the breach of the dam of ": null
    },
    {
        "Marib": "marib"
    },
    {
        ".     Although Abulfeda as a late ": null
    },
    {
        "epitomator": "epitomator"
    },
    {
        " afforded no starting point for methodical study of the sources, Reiskes edition with his version and notes laid the foundation for research into Arab history, and a historical criticism of ": null
    },
    {
        "Oriental numismatics": "oriental numismatics"
    },
    {
        " with his letters on Arabic coinage . The foundation of Arabic philology, however, was laid not by him but by ": null
    },
    {
        "Silvestre de Sacy": "antoine isaac silvestre de sacy"
    },
    {
        ". Reiskes linguistic knowledge was great, but he used it only to understand his authors; he had no feeling for form, for language as language, or for metre.     In Leipzig Reiske worked mainly at Greek, while he continued to draw on his Arabic stores accumulated in Leiden. His merit as an Arabist was sooner recognized than the value of his Greek work. Reiske the Greek scholar has been rightly valued only in recent years, and it is now recognized that he was the first German since ": null
    },
    {
        "Sylburg": "friedrich sylburg"
    },
    {
        " who had a living knowledge of the Greek tongue. His reputation does not rest on his numerous editions, often hasty or even made to booksellers orders, but in his remarks, especially his conjectures. He himself designates the Animadversiones in scriptores Graecos as flos ingenii sui, and in truth these thin booklets outweigh his big editions.     Closely following the authors thought he removes obstacles whenever he meets them, but he is so steeped in the language and thinks so truly like a Greek that the difficulties he feels often seem to us to lie in mere points of style. His criticism is empirical and unmethodical, based on immense and careful reading, and applied only when he feels a difficulty; and he is most successful when he has a large mass of tolerably homogeneous literature to lean on, whilst on isolated points he is often at a loss. His corrections are often hasty and false, but a surprisingly large proportion of them have since received confirmation from manuscripts, and, though his merits as a Grecian lie mainly in his conjectures, his realism is felt in this sphere also; his German translations especially show more freedom and practical insight, more feeling for actual life, than is common with the scholars of that age.           Abulfedae annales Moslemici. Latinos ex arabicis fecit Io. Iacobus Reiske. .       Briefe über das arabische Münzwesen von Johann Jacob Reiske mit Anmerkungen und Zusätzen von Johann Gottfried Eichhorn. In: Repertorium für Biblische und Morgenländische Litteratur 42 , pp.  42–42; 42 , pp.  42–42; 42 , pp.  42–42         Constantini Porphyrogeniti libri II. de ceremoniis aulae Byzant. vol. iii.    Animadv. ad Graecos auctores   Oratorum Graec. quae supersunt   Apparatus Criticus et Exegeticus ad Demosthenem   Maximus Tyr.   Plutarchus   Dionys. Halic.   Libanius .       Von ihm selbst aufgesetzte Lebensbeschreibung. .          ": null
    }
]