[
    {
        "     Johnny Dodds  was an American ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " clarinetist and alto saxophonist based in New Orleans, best known for his recordings under his own name and with bands such as those of ": null
    },
    {
        "Joe King Oliver": "joe   king   oliver"
    },
    {
        ", ": null
    },
    {
        "Jelly Roll Morton": "jelly roll morton"
    },
    {
        ", ": null
    },
    {
        "Lovie Austin": "lovie austin"
    },
    {
        " and ": null
    },
    {
        "Louis Armstrong": "louis armstrong"
    },
    {
        ". Dodds  was the older brother of the drummer ": null
    },
    {
        "Warren Baby Dodds": "warren   baby   dodds"
    },
    {
        ", one of the first important jazz drummers. They worked together in the ": null
    },
    {
        "New Orleans Bootblacks": "new orleans wanderers"
    },
    {
        " in 42 Dodds is an important figure in jazz history. He was the premier clarinetist of his era and, in recognition of his artistic contributions, he was posthumously inducted into the ": null
    },
    {
        "Jazz Hall of Fame": "down beat"
    },
    {
        ". He has been described as a prime architect in the creation of the ": null
    },
    {
        "Jazz Age": "jazz age"
    },
    {
        ".        Dodds was born in ": null
    },
    {
        "Waveland, Mississippi": "waveland, mississippi"
    },
    {
        ". His childhood environment was a musical one. His father and uncle were violinists, his sister played a ": null
    },
    {
        "melodeon": "diatonic button accordion"
    },
    {
        ", and in adolescence Johnny sang high tenor in the family quartet. According to legend, his instrumental skill began with a toy flute which had been purchased for his brother, ": null
    },
    {
        "Warren Baby Dodds": "warren   baby   dodds"
    },
    {
        ".     He moved to New Orleans in his youth and studied the clarinet with ": null
    },
    {
        "Lorenzo Tio": "lorenzo tio"
    },
    {
        " and Charlie McCurdy. He played with the bands of ": null
    },
    {
        "Frankie Duson": "frankie duson"
    },
    {
        ", ": null
    },
    {
        "Kid Ory": "kid ory"
    },
    {
        ", and ": null
    },
    {
        "Joe King Oliver": "joe   king   oliver"
    },
    {
        ". Dodds went to Chicago and played with Olivers Creole Jazz Band, with which he first recorded in 42 He also worked frequently with his good friend ": null
    },
    {
        "Natty Dominique": "natty dominique"
    },
    {
        " during this period, a professional relationship that would last a lifetime. After the breakup of Olivers band in 42 Dodds replaced ": null
    },
    {
        "Alcide Nunez": "alcide nunez"
    },
    {
        " as the house clarinetist and bandleader of ": null
    },
    {
        "Kellys Stables": "kellys stables"
    },
    {
        ". From 42 to 42 Dodds worked regularly at Kellys Stables in Chicago. He recorded with numerous small groups in Chicago, notably Louis Armstrongs ": null
    },
    {
        "Hot Five": "hot five"
    },
    {
        " and ": null
    },
    {
        "Hot Seven": "hot seven"
    },
    {
        " and Jelly Roll Mortons ": null
    },
    {
        "Red Hot Peppers": "red hot peppers"
    },
    {
        ". He also recorded prolifically under his own name between 42 and 42 for Paramount, Brunswick/Vocalion, and Victor. He became a big star on the Chicago jazz scene of the 42s, but his career precipitously declined with the Great Depression. Although his career gradually recovered, he did not record for most of the 42s, affected by ill-health; he recorded only two sessions—January 42 42 and June 42 42—both for Decca. He died of a heart attack in August 42 in Chicago.     Known for his professionalism and virtuosity as a musician and his heartfelt, heavily blues-laden style, Dodds was an important influence on later clarinetists, notably ": null
    },
    {
        "Benny Goodman": "benny goodman"
    },
    {
        ", who stated that no one ever surpassed Dodds in achieving a finer tone with the clarinet. Dodds was inducted into the ": null
    },
    {
        "Jazz Hall of Fame": "down beat"
    },
    {
        " in 42       Several accounts suggest the Dodds brothers did not always get along. When the brothers were young children, Johnny received a clarinet from his father while Baby did not get a drum even though he asked for one.  In The Baby Dodds Story, Baby Dodds discusses his jealousy of his older brother when they were children. As they grew up, Johnny refused to let Baby play music with him because Baby was a heavy drinker and Johnny did not drink. When Joe Oliver hired Baby to join his band, Johnny realized how much Babys talent as a drummer had grown, however, Johnny changed his mind. Although they continued to argue about Babys excessive drinking, they grew closer as brothers and musicians. Baby was greatly affected by his brothers death.       Releases featuring Johnny Dodds include the following.    ": null
    }
]