[
    {
        "              John Barrymore  was an American actor on stage, screen and radio. A member of the ": null
    },
    {
        "Drew and Barrymore theatrical families": "barrymore family"
    },
    {
        ", he initially tried to avoid the stage, and briefly attempted a career as an artist, but appeared on stage together with his father ": null
    },
    {
        "Maurice": "maurice barrymore"
    },
    {
        " in 42 and then his sister ": null
    },
    {
        "Ethel": "ethel barrymore"
    },
    {
        " the following year. He began his career in 42 and first gained attention as a stage actor in light comedy, then high drama, culminating in productions of  Justice  ,  Richard III  and  Hamlet  ; his portrayal of Hamlet led to him being called the greatest living American tragedian .     After a success as Hamlet in London in 42 Barrymore left the stage for 42 years and instead focused entirely on films. In the ": null
    },
    {
        "silent film": "silent film"
    },
    {
        " era, he was well received in such pictures as  Dr. Jekyll and Mr. Hyde  ,  Sherlock Holmes  and  The Sea Beast  . During this period, he gained his nickname, the Great Profile. His stage-trained voice proved an asset when ": null
    },
    {
        "sound film": "sound film"
    },
    {
        "s were introduced, and three of his works,  Grand Hotel  ,  Twentieth Century  and  Midnight  have been inducted into the ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        ".     Barrymores personal life has been the subject of much attention before and since his death. He struggled with alcohol abuse from the age of 42 was married and divorced four times, and declared bankruptcy later in life. Much of his later work involved self-parody and the portrayal of drunken has-beens. His obituary in  The Washington Post  observed that with the passing of the years  – and as his private life became more public  – he became, despite his genius in the theater, a tabloid character. Although film historians have opined that Barrymores contribution to the art of cinematic acting began to fade after the mid42s, Barrymores biographer, Martin Norden, considers him to be perhaps the most influential and idolized actor of his day .                Barrymore was born John Sidney Blyth in ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ", and was known by family, friends and colleagues as Jack . Although the Barrymore ": null
    },
    {
        "family Bible": "family bible"
    },
    {
        " puts his date of birth as February 42 42 his birth certificate shows February 42 He was the youngest of three children. His siblings were ": null
    },
    {
        "Lionel": "lionel barrymore"
    },
    {
        " , and ": null
    },
    {
        "Ethel": "ethel barrymore"
    },
    {
        " . His father was ": null
    },
    {
        "Maurice Barrymore": "maurice barrymore"
    },
    {
        ", an ": null
    },
    {
        "Indian": "india"
    },
    {
        "-born British actor who had been born Herbert Blyth, and had adopted Barrymore as a stage name after seeing it on a poster in the ": null
    },
    {
        "Haymarket Theatre": "haymarket theatre"
    },
    {
        " in London. Barrymores mother, ": null
    },
    {
        "Georgie Drew Barrymore": "georgiana drew"
    },
    {
        ", was born into a prominent ": null
    },
    {
        "theatrical family": "barrymore family"
    },
    {
        ". Barrymores maternal grandparents were ": null
    },
    {
        "Louisa Lane Drew": "louisa lane drew"
    },
    {
        ", a well-known 42th-century American actress and the manager of the ": null
    },
    {
        "Arch Street Theatre": "arch street theatre"
    },
    {
        ", and ": null
    },
    {
        "John Drew": "john drew"
    },
    {
        ", also an actor whose specialty was comedy. Barrymores maternal uncles were two more thespians, ": null
    },
    {
        "John Drew Jr.": "john drew jr."
    },
    {
        " and ": null
    },
    {
        "Sidney": "mr.  &  mrs. sidney drew"
    },
    {
        ". , May 42 42 Section 42 Special Feature Supplement...a rundown of Barrymores life and family up to 42     Much of Barrymores early life was unsettled. In October 42 the family toured in the US for a season with Polish actress ": null
    },
    {
        "Helena Modjeska": "helena modjeska"
    },
    {
        ". The following year his parents toured again with Modjeska but left the children behind. Modjeska was influential in the family, and she insisted that all three children be baptized into the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ". In 42 the family traveled to London as part of ": null
    },
    {
        "Augustin Daly": "augustin daly"
    },
    {
        "s theatrical company, returning to the US two years later. As a child, Barrymore was sometimes badly behaved, and he was sent away to schools in an attempt to instill discipline. The strategy was not always successful, and he attended elementary schools in four states. He was sent first to the boys annex of the Convent of Notre Dame in Philadelphia. One punishment that he received there was being made to read a copy of ": null
    },
    {
        "Dante": "dante alighieri"
    },
    {
        "s  Inferno ; he later recounted that, as he looked at the illustrations by ": null
    },
    {
        "Gustave Doré": "gustave doré"
    },
    {
        ", my interest was aroused, and a new urge was born within me. I wanted to be an artist . He was expelled from the school in 42 and was sent to ": null
    },
    {
        "Seton Hall Preparatory School": "seton hall preparatory school"
    },
    {
        " in New Jersey, where Lionel was already studying. Barrymore was unhappy at Seton and was soon withdrawn, after which he attended several public schools in New York, including the ": null
    },
    {
        "Mount Pleasant Military Academy": "mt. pleasant military academy"
    },
    {
        ".     In 42 his grandmother Louisa Drews business began to suffer, and she lost control of her theater, causing disruption in the family. The following year, when Barrymore was 42 years old, his mother died from ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        "; her consistent touring and his absence at school meant that he barely knew her, and he was mostly raised by his grandmother. The loss of their mothers income prompted both Ethel and Lionel to seek work as professional actors. Barrymores father was mostly absent from the family home while on tour, and when he returned he would spend time at ": null
    },
    {
        "The Lambs": "the lambs"
    },
    {
        ", a New York actors club.     In 42 Barrymore entered ": null
    },
    {
        "Georgetown Preparatory School": "georgetown preparatory school"
    },
    {
        ", then located on Georgetown University Campus, but he was expelled in November 42 probably after being caught waiting in a ": null
    },
    {
        "brothel": "brothel"
    },
    {
        ". One of his biographers, Michael A. Morrison, posits the alternate theory that Barrymore was expelled after the staff saw him inebriated. By the time he left Georgetown he was, according to Martin Norden in his biography of Barrymore, already in the early stages of a chronic drinking problem . 42 was an emotionally challenging year for Barrymore: he lost his virginity when he was seduced by his step-mother, Mamie Floyd, and in August his grandmother, the main female role model in his life, died.  August 42 42 MRS. JOHN DREW DYING. The Last Scenes in a Notable Dramatic Career     Barrymore traveled with his father to England in 42 where he joined ": null
    },
    {
        "Kings College School": "kings college school"
    },
    {
        ", ": null
    },
    {
        "Wimbledon": "wimbledon, london"
    },
    {
        ". A year later he joined the ": null
    },
    {
        "Slade School of Fine Art": "slade school of fine art"
    },
    {
        ", to study literature and art. After a year of formal study, he left and devoted much of his subsequent stay in London to bohemianism and nocturnal adventures , according to his biographer ": null
    },
    {
        "Margot Peters": "margot peters"
    },
    {
        ". Barrymore returned to New York in the summer of 42 and by November he found work as an illustrator on  The New York Evening Journal , at a salary of $42 a week.        Barrymore had always professed a dislike of the acting profession, but in 42 he was persuaded by his father to join him on stage for a few performances of a short play, A Man of the World . He appeared in the same piece again the following year, but he still thought of the experience as merely a way to supplement his income, rather than as a possible future career. In October 42 Ethel was appearing in Philadelphia in Captain Jinks of the Horse Marines when one of the younger actors became temporarily unavailable. She persuaded the director to allow Barrymore to accept the part of the minor character, and Barrymore traveled from New York, learning his lines on the train. In the first act, he stopped in the middle of his dialogue, unable to remember the text, and asked the audience and his fellow actors, Ive blown up. Where do we go from here? , which led the cast to improvise the remainder of the scene.     An incident in 42 had a major impact on Barrymore. In March, his father had a mental breakdown as a result of ": null
    },
    {
        "tertiary syphilis": "tertiary syphilis"
    },
    {
        ", and Barrymore took him to ": null
    },
    {
        "Bellevue hospital": "bellevue hospital center"
    },
    {
        ". He was later transferred to a private institution in ": null
    },
    {
        "Amityville": "amityville, new york"
    },
    {
        ", Long Island, where he suffered a rapid descent into madness . The Encyclopedia of World Biography states that Barrymore was constantly haunted by the bright and dark spell of his father , and his close friend ": null
    },
    {
        "Gene Fowler": "gene fowler"
    },
    {
        " reported that the bleak overtone of this breaking of his parents reason never quite died away in Barrymores mind, and he was haunted by fears he would suffer the same fate . The same year, Barrymore began an affair with a beautiful ": null
    },
    {
        "artists model": "gibson girl"
    },
    {
        ",  Florodora  girl and aspiring actress named ": null
    },
    {
        "Evelyn Nesbit": "evelyn nesbit"
    },
    {
        ", who was a mistress of architect ": null
    },
    {
        "Stanford White": "stanford white"
    },
    {
        ". Barrymore later described Nesbit as the most maddening woman.  ... She was the first woman I ever loved , and he proposed marriage to her. Nesbits mother did not think that, as a struggling artist, Barrymore was a good match for her daughter. To break off their relationship her mother sent Nesbit away to school in New Jersey. In 42 White was shot in public by Nesbits then-husband, ": null
    },
    {
        "Pittsburgh": "pittsburgh"
    },
    {
        " millionaire ": null
    },
    {
        "Harry K. Thaw": "harry k. thaw"
    },
    {
        ". Barrymore expected to testify at Thaws murder trial on the issue of Nesbits morality; he worried that he might be asked whether he had arranged for Nesbit to have an ": null
    },
    {
        "abortion": "abortion"
    },
    {
        ", disguised as an ": null
    },
    {
        "appendectomy": "appendectomy"
    },
    {
        ", even though Nesbit had undergone two previous appendectomies . Barrymore was never called as a witness because Thaw pleaded not guilty by reason of insanity.     In May 42 Barrymore was fired from his newspaper position after producing a poor illustration for the paper while hung over. He spent time as a poster designer but realized it was not lucrative enough for his lifestyle, which was being partly financed by Ethel, who was also paying for their fathers care. While discussing his future with his brother, Barrymore said it looks as though Ill have to succumb to the family curse, acting , and he later admitted that there isnt any romance about how I went on stage.  ... I needed the money.                Barrymore began to contact his familys theatrical connections to find work and approached ": null
    },
    {
        "Charles Frohman": "charles frohman"
    },
    {
        ", who had been the producer of Captain Jinks and had also been an employer of Barrymores mother Georgie a decade earlier. Frohman thought that Barrymore had comedic potential but needed more experience before making a ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " debut. Barrymore joined the company of McKee Rankin, Sidney Drews father-in-law, on the Chicago leg of their tour, at the W. S. Cleveland Theatre in October 42 He first played the minor role of Lt. Max von Wendlowski in Magda, and in November when the troupe produced Leah the Forsaken, he took the small part of Max, a village idiot with one spoken line.     A year later Barrymore appeared in his first Broadway production, in a small role in the comedy Glad of It, which only had a short run. Afterwards he played the role of Charles Hyne in the farce The Dictator at the Criterion Theatre, which starred ": null
    },
    {
        "William Collier": "william collier sr."
    },
    {
        ". During the plays run and subsequent tour across the US, Collier became a mentor to the young actor, although his patience was continually tested by Barrymores drinking, which led to occasional missed performances, drunken stage appearances, and general misbehavior. Collier taught Barrymore much about acting, including coaching him in comic timing, but at times regretted his sponsorship of his apprentice. In March 42 while The Dictator was playing in Buffalo, Barrymores father died in Amityville and was buried at Glenwood Cemetery in Philadelphia. At the close of the US tour, The Dictator visited Britain from April 42 where it played at the ": null
    },
    {
        "Comedy Theatre": "harold pinter theatre"
    },
    {
        ". The critic for  The Observer  wrote that Barrymore admirably seconded Collier.     When he returned to America, Barrymore appeared at the Criterion Theatre in a double bill of works by ": null
    },
    {
        "J. M. Barrie": "j. m. barrie"
    },
    {
        "; he played a clown in Pantaloon opposite his brother, and Stephen Rollo in Alice Sit-by-the-Fire opposite his sister. Both plays ran for 42 performances from December 42 and then went on tour.  Barrymore continued drinking and lacked discipline, which affected his performances. Ethel was angry with her brother and had the producers fire him from the show, but re-hire him the following day, to teach him a lesson. After a tour of the US and Australia with Collier in On the Quiet and The Dictator, Barrymore joined his sister in the 42 comedy His Excellency the Governor at the ": null
    },
    {
        "Empire Theatre": "empire theatre"
    },
    {
        ". He received mixed reviews for his performances, and  The Wichita Daily Eagle  commented that Barrymore seems to imitate John Drew too much ever to be a good actor. Why doesnt young Barrymore imitate a real actor if he must copy someone.        Barrymore gained his first leading role in early 42 in the comedy The Boys of Company B at the ": null
    },
    {
        "Lyceum Theatre": "lyceum theatre"
    },
    {
        ". Although he was well received by the critics  –  The Washington Post  noted that his work has been pronounced astonishingly clever by the critics wherever he played  – at times he continued his unprofessional stage behavior, which led to a rebuke from John Drew, who attended a performance. After a short run in Toddles at the ": null
    },
    {
        "Garrick Theatre": "garrick theatre"
    },
    {
        ", Barrymore was given the lead role of Mac in  A Stubborn Cinderella , both on tour and at the Broadway Theatre in Boston. He had previously been earning $42 a week during his sporadic employment but now enjoyed a wage increase to $42 He briefly appeared in The Candy Shop in mid42 before he played the lead role in ": null
    },
    {
        "Winchell Smith": "winchell smith"
    },
    {
        "s play The Fortune Hunter at the ": null
    },
    {
        "Gaiety Theatre": "gaiety theatre"
    },
    {
        " in September the same year. It was his longest-held role, running for 42 performances until May 42 initially at the Gaiety Theatre in New York, and then on tour.  The critic for  The New York Times  thought the play was, acted with fine comedy spirit by John Barrymore  ... gave indisputable signs last night of grown and growing powers.     In mid42 Barrymore met socialite ": null
    },
    {
        "Katherine Corri Harris": "katherine corri harris"
    },
    {
        ", and the couple married in September that year. Harris father objected to the relationship and refused to attend the wedding. Shortly after the ceremony, The Dictator went on tour, and Harris was given a small role in the play. According to Peters, Barrymore began to think of his marriage as a bus accident. Film critic ": null
    },
    {
        "Hollis Alpert": "hollis alpert"
    },
    {
        " wrote that, within a week of the wedding, Katherine was complaining that she saw her new husband too infrequently. Barrymores increasing ": null
    },
    {
        "dependence on alcohol": "alcoholism"
    },
    {
        " was also a cause of marital problems, and he explained that unhappiness increased the drink, and drink increased the unhappiness .        Barrymores next two plays  – Uncle Sam and Princess Zim-Zim, both from 42  – were critically and commercially weak, but the second work introduced him to playwright ": null
    },
    {
        "Edward Sheldon": "edward sheldon"
    },
    {
        ", who would reshape  ... entire career . In January 42 Barrymore appeared together with his sister in A Slice of Life at the Empire Theatre on Broadway, which ran for 42 performances. Charles Darnton, a critic for  The Evening World , observed that Barrymore takes delight in kidding his part not only to the limit, but perhaps beyond . A review in  The Washington Times  stated that Barrymore inimitably imitates his uncle John Drew .     Barrymore may have appeared in his first films in 42 In four short films, a cast member is listed as Jack Barrymore ; this is probably John Barrymore, although Norden notes that we may never know for certain if are in fact Barrymore movies.  The four films were Dream of a Motion Picture Director,  The Widow Caseys Return ,  A Prize Package  and  One on Romance  . The films were produced by the Philadelphia-based ": null
    },
    {
        "Lubin Manufacturing Company": "lubin manufacturing company"
    },
    {
        " and were ": null
    },
    {
        "lost": "lost film"
    },
    {
        " in an explosion and fire at the Lubin vaults in 42     In July 42 Barrymore went to Los Angeles, where he appeared in three short-running plays at the Belasco Theatre. He returned to New York in October, where he took the lead role in 42 performances of the comedy  The Affairs of Anatol  at the ": null
    },
    {
        "Little Theatre": "helen hayes theatre"
    },
    {
        ". Although the critical response was lukewarm, Barrymores salary for the play was $42 a week. He began the following year by appearing in a short run of  A Thief for a Night  in McVickers Theatre, Chicago, before returning to New York, and the Thirty-Ninth St. Theatre, for a two-month run in Believe Me Xantippe.            In late 42 Barrymore made his first confirmed feature film, the romantic comedy  An American Citizen , with ": null
    },
    {
        "Adolph Zukor": "adolph zukor"
    },
    {
        "s ": null
    },
    {
        "Famous Players Film Company": "famous players film company"
    },
    {
        ". When the film was released in January 42 Barrymore delighted movie audiences with an inimitable light touch that made a conventional romance joyous, writes Peters. A reviewer for  The Oregon Daily Journal  thought that Barrymore gave a portrayal of unusual quality . The success of the picture led to further film work, including  The Man from Mexico  ,  Are You a Mason? ,  The Dictator  and  The Incorrigible Dukane  . Except for The Incorrigible Dukane, all of these early films are presumed ": null
    },
    {
        "lost": "lost film"
    },
    {
        ".     Despite the film work and the higher fees he earned from it, Barrymore continued to seek stage work, and in January 42 he played the lead in  The Yellow Ticket  at New Yorks ": null
    },
    {
        "Eltinge Theatre": "empire theatre"
    },
    {
        ". The role marked a departure from the light comedy of his previous performances, a result of Sheldon urging him to turn towards more dramatic parts. The Yellow Ticket was not the breakthrough that Barrymore wanted. A few months before the outbreak of World War One, he took a vacation to Italy with Sheldon to enjoy a temporary break from his worsening marriage. He returned from Italy and accepted another serious stage role, that of an ex-convict in Kick In, at New Yorks ": null
    },
    {
        "Longacre Theatre": "longacre theatre"
    },
    {
        ". The play was a success, and Barrymore received praise from the critics; The New York Times reviewer thought that in a play that had uncommonly able and sincere playing , Barrymore acted his role with intelligence and vigor and impart to it a deal of charm .     Barrymore spent the second half of 42 making three films, including  The Red Widow , which he called the worst film I ever made in his 42 autobiography. In April 42 he starred in ": null
    },
    {
        "John Galsworthy": "john galsworthy"
    },
    {
        "s prison drama ": null
    },
    {
        "Justice": "justice"
    },
    {
        ", again at the instigation of Sheldon. The play was a critical success, and The New York Times thought the audience saw Barrymore play as he had never played before, and so, by his work as the wretched prisoner in Justice, step forward into a new position on the American stage. The critic went on to say that Barrymore gave an extraordinary performance in every detail of appearance and manner, in every note of deep feeling  ... a superb performance.        From early 42 Barrymore had been living apart from Katherine, and she sued for divorce in November 42 By the time the divorce was finalized in December 42 he had taken ": null
    },
    {
        "the lead role": "a. j. raffles"
    },
    {
        " in the film  Raffles, the Amateur Cracksman . He had also tried to enlist in the U.S. Army following the countrys entry into World War  I, but Army doctors revealed that he had ": null
    },
    {
        "varicose veins": "varicose veins"
    },
    {
        ", and he was not accepted for military service. For over a year beginning in April 42 he appeared together with Lionel in ": null
    },
    {
        "a stage version": "peter ibbetson"
    },
    {
        " of ": null
    },
    {
        "George du Maurier": "george du maurier"
    },
    {
        "s 42 novel  Peter Ibbetson . The play and the two Barrymores were warmly regarded by the critics. Around this time, Barrymore began a relationship with a married mother of two, ": null
    },
    {
        "Blanche Oelrichs": "blanche oelrichs"
    },
    {
        ", a ": null
    },
    {
        "suffragist": "suffragist"
    },
    {
        " from an elite Rhode Island family with what Peters calls anarchistic self-confidence . Oelrichs also published poetry under the name Michael Strange. While their relationship began in secret, it became more open after Oelrichs husband was commissioned into the army and then posted to France.     Both Oelrichs and Sheldon urged Barrymore to take on his next role, Fedya Vasilyevich Protasov, in ": null
    },
    {
        "Leo Tolstoy": "leo tolstoy"
    },
    {
        "s play  Redemption  at the ": null
    },
    {
        "Plymouth Theatre": "gerald schoenfeld theatre"
    },
    {
        ". The critic for The New York Times felt that, although Barrymores performance was marred by vocal monotony , overall the performance was a distinct step forward in Mr. Barrymores artistic development  ... There is probably not another actor on our stage who has a temperament so fine and spiritual, an art so flexible and sure. In 42 Barrymore starred in the romantic comedy film  On the Quiet ; the  Iowa City Press-Citizen  considered the film superior to the original Broadway performance.        In 42 Barrymore portrayed a struggling lawyer in the ": null
    },
    {
        "film adaptation": "here comes the bride"
    },
    {
        " of the Broadway show Here Comes the Bride, which he followed with  The Test of Honor . The latter film marked his first straight dramatic role on screen after years of performing in comedy dramas. Later that year, when Barrymore again appeared on stage with Lionel in ": null
    },
    {
        "Sem Benelli": "sem benelli"
    },
    {
        "s historical drama The Jest, audience members agree that the American stage had never witnessed finer acting , according to Peters. ": null
    },
    {
        "Alexander Woollcott": "alexander woollcott"
    },
    {
        ", writing in The New York Times, thought that John and Lionel Barrymore hold spellbound each breathless audience , and he commented that Barrymore contributes to that appeal by every step, every hand, every posture of a body grown unexpectedly eloquent in recent years . In November, Barrymore began filming  Dr. Jekyll and Mr. Hyde , playing the ": null
    },
    {
        "dual leading role": "dr. jekyll and mr. hyde"
    },
    {
        ", and the film was released in theaters the following year.  Wids Daily  thought that it is the stars picture from the very outset, and it is the star that makes it , going on to say that Barrymores portrayal was a thing of fine shadows and violent emotions . The Washington Post was in agreement, and considered the performance to be a masterpiece , and a remarkable piece of work . The film was so successful that the US Navy used stills of Barrymore in its recruiting posters.     After planning for over a year  – largely in secret  – Barrymore played his first ": null
    },
    {
        "Shakespeare": "william shakespeare"
    },
    {
        " part, ": null
    },
    {
        "the title role": "richard iii of england"
    },
    {
        " in  Richard III . Conscious of the criticism of his vocal range, he underwent training with Margaret Carrington, the voice and diction trainer, to ensure he sounded right for the part, and the pair worked together daily for up to six hours a day for six weeks. After the debut in March 42 the critics were effusive in their praise. The  Washington Herald  observed that the audience were held by the sheer power of Barrymores performance , which was remarkable for  ... unexpected vocal richness , while Woollcott, in The New York Times, thought the performance marked a measurable advance in the gradual process of bringing technical fluency abreast with his winged imagination and his real genius for the theatre .        Although a commercial and critical success, the play closed after 42 performances when Barrymore collapsed, suffering a nervous breakdown. , April 42 42 LAST EDITION - 42 P.M. Since appearing in Redemption he had worked ceaselessly, appearing on stage in the evenings, while planning or rehearsing the next production during the day, and by the time he appeared as Richard, he was spending his daytimes filming Dr. Jekyll and Mr. Hyde. He spent six weeks recuperating under the ministrations of his fathers friend, wrestler ": null
    },
    {
        "William Muldoon": "william muldoon"
    },
    {
        ", who ran a sanitarium. During the summer of 42 Oelrichs became pregnant with Barrymores child, and a quick divorce was arranged with her husband, which left her and Barrymore free to marry in August that year; a daughter, ": null
    },
    {
        "Diana Barrymore": "diana barrymore"
    },
    {
        ", followed in March 42 Soon after the birth, he began rehearsals for Clair de Lune, which his wife had adapted from ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        "s 42 novel  The Man Who Laughs . Barrymore persuaded Ethel to play the role of the Queen  – it was the first time the two had appeared on stage together in over a decade. The play was a critical flop, although the presence of the siblings ensured that it ran for over 42 performances.     In 42 Barrymore portrayed a wealthy Frenchman in New York in the film  The Lotus Eater , with ": null
    },
    {
        "Colleen Moore": "colleen moore"
    },
    {
        ". In September, Barrymore and Oelrichs went to Europe on holiday; cracks were appearing in their relationship, and she fell in love with a poet during their extended stay in Venice. In October, Oelrichs returned to New York and Barrymore traveled to London to film the exterior scenes for his latest movie,  Sherlock Holmes , in which he played the title role. He then returned to New York to work on the films interior scenes in January 42 Barrymore became involved in the pre-production work for the film and provided designs for ": null
    },
    {
        "Moriartys": "professor moriarty"
    },
    {
        " lair. The film was released later that year and was generally thought a little dull and ponderous, with too many ": null
    },
    {
        "intertitle": "intertitle"
    },
    {
        "s , although James W. Dean of  The Evening News  of Harrisburg opined that the personality of Barrymore is the films transcendent quality .        Barrymore decided next to star in  Hamlet  on stage, with ": null
    },
    {
        "Arthur Hopkins": "arthur hopkins"
    },
    {
        " directing. They spent six months preparing, cutting over 42 lines from the text as they did so, and Barrymore opted to play Hamlet as a mans man , according to Norden. Barrymore later described his Hamlet as a normal, healthy, lusty young fellow who simply got into a mess that was too thick for him  ... he was a great fencer, an athlete, a man who led an active, healthy life. How can you make a sickly half-wit out of a man like that?  Barrymore again used Carrington as a vocal coach; rehearsals started in October, and the play opened on November 42 The production was a box-office success, and the critics were lavish in their praise. Woollcott, writing for the  New York Herald , opined that it was an evening that will be memorable in the history of the American theater . while ": null
    },
    {
        "John Corbin": "john corbin"
    },
    {
        ", the drama critic for The New York Times, agreed, writing that in all likelihood we have a new and a lasting Hamlet . The reviewer for Brooklyn Life stated that Barrymore had doubtless won the right to be called the greatest living American tragedian . In 42 ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        " said that Barrymore was the best Hamlet he had seen, describing the character as not so much princely  – he was a man of genius who happened to be a prince, and he was tender, and virile, and witty, and dangerous .     Barrymore and Hopkins decided to end the run at 42 performances, just breaking the record of one hundred by ": null
    },
    {
        "Edwin Booth": "edwin booth"
    },
    {
        ", before the play closed in February 42 In November and December that year, a three-week run of the play was staged at the ": null
    },
    {
        "Manhattan Opera House": "manhattan center"
    },
    {
        ", followed by a brief tour that closed at the end of January 42       News of Barrymores success in Hamlet piqued the interest of ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        ", which signed him as ": null
    },
    {
        "the lead": "beau brummell"
    },
    {
        " in the 42 film  Beau Brummel . Unhappy in his marriage, Barrymore  – aged 42 at the time  – sought solace elsewhere and had an affair with his 42-year-old co-star ": null
    },
    {
        "Mary Astor": "mary astor"
    },
    {
        " during filming. Although the film was not an unqualified success, the cast, including Barrymore, was generally praised. Around this time, Barrymore acquired the nickname the Great Profile , as posters and photographs of him tended to favor the left-hand side. He later said: The right side of my face looks like a fried egg. The left side has features that are to be found in almost any normal anthropological specimen, and those are the apples I try to keep on top of the barrel.         In February 42 Barrymore staged Hamlet in London at the Haymarket Theatre, which the  Manchester Guardian  later said had the most memorable first night for years . The reviews were positive, and although none of the London critics found Barrymore superior to ": null
    },
    {
        "[Henry] Irving": "henry irving"
    },
    {
        " and ": null
    },
    {
        "[Johnston] Forbes-Robertson": "johnston forbes-robertson"
    },
    {
        ", many were favorable in their comparisons . Among the audience members was the 42-year-old actor ": null
    },
    {
        "John Gielgud": "john gielgud"
    },
    {
        ", who wrote in his program Barrymore is romantic in appearance and naturally gifted with grace, looks and a capacity to wear period clothes, which makes his brilliantly intellectual performance classical without being unduly severe, and he has tenderness, remoteness, and neurosis all placed with great delicacy and used with immense effectiveness and admirable judgment . Looking back in the 42s, he said: The handsome middle-aged stars of the Edwardian theatre romanticised the part. Even John Barrymore, whose Hamlet I admired very much, cut the play outrageously so that he could, for instance, play the closet scene all out for sentiment with the emphasis on the ": null
    },
    {
        "Oedipus complex": "oedipus complex"
    },
    {
        "  – sobbing on Gertrudes bosom. Yet Barrymore  ... had a wonderful edge and a demonic sense of humour.      At the end of this run of Hamlet, Barrymore traveled to Paris, where Oelrichs had stayed during his residence in London, but the reunion was not a happy one and the couple argued frequently. When he returned to America, she remained in Paris, and the couple drew up a separation agreement that provided Oelrichs with $42 a year and stated that neither could sue for divorce on the grounds of adultery. While he had been in London, Warner Bros and Barrymore entered into a contact for three further films at a salary of $42 per picture. He later claimed that his motivation for moving from stage to films was the lack of repetition—the continual playing of a part, which is so ruinous to an actor, is entirely eliminated .        Barrymores first film under the contract was  The Sea Beast  , loosely based on the 42 novel  Moby-Dick , in which he played ": null
    },
    {
        "Captain Ahab Ceeley": "captain ahab"
    },
    {
        ". This was one of the biggest money-makers of the year for Warner Bros. Although Barrymore wanted Astor to play the female lead, she was unavailable, and ": null
    },
    {
        "Dolores Costello": "dolores costello"
    },
    {
        " was cast in her place. He later said that I fell in love with her instantly. This time I knew I was right , and the couple began an affair. Costellos father was angered by the relationship, but his complaints were ignored by both Costello and her mother: Costellos parents separated and were divorced as a result. The film was well received by critics, and ": null
    },
    {
        "Mordaunt Hall": "mordaunt hall"
    },
    {
        ", the film critic of The New York Times, praised the energy, earnestness and virility Barrymore displayed in the role of Ceeley.     As filming finished on The Sea Beast, work began on  Don Juan , the first feature-length film with synchronized ": null
    },
    {
        "Vitaphone": "vitaphone"
    },
    {
        " sound effects and a musical ": null
    },
    {
        "soundtrack": "soundtrack"
    },
    {
        ". Although Barrymore wanted to play opposite Costello again, ": null
    },
    {
        "Jack L. Warner": "jack l. warner"
    },
    {
        ", the films producer, signed Astor. After completing his Warner Bros. contract with  When a Man Loves , with Costello, Barrymore joined ": null
    },
    {
        "United Artists": "united artists"
    },
    {
        " under a three-film deal. For the next three years, according to Morrison, he enjoyed unprecedented prosperity and spent lavishly . Nevertheless, he received some harsh reviews. Critic and essayist ": null
    },
    {
        "Stark Young": "stark young"
    },
    {
        " wrote in  The New Republic  that Barrymores films were rotten, vulgar, empty, in bad taste, dishonest, noisome with a silly and unwholesome exhibitionism, and odious with a kind of stale and degenerate studio adolescence. Their appeal is cheap, cynical and specious .     In 42 Barrymore planned to revive Hamlet at the ": null
    },
    {
        "Hollywood Bowl": "hollywood bowl"
    },
    {
        ", but in August he canceled the production, without explanation, and began filming the third of the UA pictures,  Eternal Love , for which he was paid $42. In February 42 Barrymore obtained a quiet divorce from Oelrichs; she eagerly agreed to the separation, as she was in a relationship with a lawyer, ": null
    },
    {
        "Harrison Tweed": "harrison tweed"
    },
    {
        ", whom she later married. Barrymore and Costello married in November that year; their daughter, Dolores, was born in April 42 and a son, ": null
    },
    {
        "John Drew Barrymore": "john drew barrymore"
    },
    {
        ", followed in June 42 Barrymore purchased and converted an estate in the Hollywood Hills into 42 different buildings with 42 rooms, gardens, ": null
    },
    {
        "skeet ranges": "skeet shooting"
    },
    {
        ", swimming pools, fountains and a totem pole.        By the late 42s, ": null
    },
    {
        "sound film": "sound film"
    },
    {
        "s had become common, following the 42 sensation,  The Jazz Singer . Actors with trained voices were in demand by the studios, and Barrymore was offered a five-film deal with Warner Bros. at $42 per picture, and a share of the profits. Before he began this contract, he played his first speaking role on film: a one-off section in  The Show of Shows  , playing Richard, Duke of Gloucester in  Henry VI, Part 42 . His first two films under contract were  General Crack  and  The Man from Blankleys , each of which were modestly successful. As he had been frustrated at the inability of making The Sea Beast as a sound film, Barrymore returned to Moby Dick as the source for a 42 film ": null
    },
    {
        "of the same name": "moby dick"
    },
    {
        ". Peters thinks little of the film, describing it as a seesaw between the cosmic and the comic, a travesty of Melville as well as a silly film all on its own .     The following year, Barrymore played the title role of a manipulative voice coach in  Svengali , opposite ": null
    },
    {
        "Marian Marsh": "marian marsh"
    },
    {
        ". Martin Dickstein, the critic for the  Brooklyn Daily Eagle , wrote that Barrymore registers a personal triumph in the role , calling his performance brilliant  ... one of the best of his movie career . Later in 42 he played a crippled puppeteer, who tries to fulfill his frustrated ambitions by manipulating the life of a young male ballet dancer and the dancers lover in  The Mad Genius ; the film was a commercial failure. With disappointing box office returns from their five-film deal, Warner Bros. decided not to offer Barrymore a contract renewal. Instead, Barrymore signed a non-exclusive contract with ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer"
    },
    {
        " and took a $42 salary cut per film.       Barrymores first film for MGM was the 42 mystery  Arsène Lupin , in which he co-starred with his brother Lionel. In The New York Times, Hall called Barrymores performance admirable and wrote that it is a pleasure to see again in something in a lighter vein. The same year, Barrymore starred as jewel thief Baron Felix von Geigern together with ": null
    },
    {
        "Greta Garbo": "greta garbo"
    },
    {
        " in the 42 film  Grand Hotel , in which Lionel also appeared. Critical opinion of Barrymores acting was divided; ": null
    },
    {
        "John Gilbert": "john gilbert"
    },
    {
        "s biographer Eve Golden refers to Barrymore as seeming more like  ... affectionate father than her lover , while George Blaisdell of International Photographer praised the dialogue and wrote that a viewer would be deeply impressed with the rarity in screen drama on which he is looking.  Grand Hotel won the ": null
    },
    {
        "Academy Award for Best Picture": "academy award for best picture"
    },
    {
        " and was one of the highest-grossing films of the year. It was later added to the ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        ".        In 42 Barrymore went to ": null
    },
    {
        "RKO Pictures": "rko pictures"
    },
    {
        " where he played a borderline-alcoholic lawyer in  States Attorney , and an escaped lunatic in  A Bill of Divorcement , opposite ": null
    },
    {
        "Katharine Hepburn": "katharine hepburn"
    },
    {
        " in her screen debut. Film scholar ": null
    },
    {
        "Daniel Bernardi": "daniel bernardi"
    },
    {
        " later noted the ": null
    },
    {
        "humanism": "humanism"
    },
    {
        " demonstrated between Barrymores character and his family, particularly the close bond between father and daughter. In his final film of the year, he returned to MGM for  Rasputin and the Empress , Barrymore, Ethel and Lionel co-starred. Physically, Barrymore had deteriorated since filming Svengali, and he had gained weight because of his drinking. Peters notes the dissipation of the once ascetic face, a dissipation only underlined by the studios attempt to reconstruct with lights, filters and make-up a spiritual beauty that had been corrupted. The film was a critical and commercial failure, and MGM lost significant amounts of money.  The New Yorker  thought the three Barrymores had produced their worst work.     The year 42 was a busy one for Barrymore, and his decline began to be evident. He appeared in five films during the year, including as a meek schoolteacher-turned-businessman in  Topaze , opposite ": null
    },
    {
        "Myrna Loy": "myrna loy"
    },
    {
        ", and  Dinner at Eight , with Lionel. Peters opines that Barrymores portrayal of a washed-up alcoholic actor could well have fixed  ... in the publics and MGMs mind that John Barrymore was a drunken has-been.  After the run of films with MGM, the company ended its contact with Barrymore amid its financial woes caused by the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ". He then signed with ": null
    },
    {
        "Universal Studios": "universal studios"
    },
    {
        " to portray a troubled Jewish lawyer in  Counsellor at Law . During filming he struggled to remember his lines for even small scenes. Filming was stopped on one occasion after more than 42 takes when he struggled to recall the right lines; it was a problem with which he began to suffer regularly. Despite the problems, Norden believes that this was one of his best film performances .        In December 42 Barrymore agreed with RKO to film Hamlet. He underwent screen tests and hired Carrington to act as vocal coach again, but during one session, his memory failed him again, and the project was eventually scrapped. Barrymore starred in two films released in 42 the drama  Long Lost Father  and the ": null
    },
    {
        "screwball comedy": "screwball comedy film"
    },
    {
        "  Twentieth Century . In the latter film, Barrymore played madcap Broadway impresario Oscar Jaffe, a role in which he demonstrated a rare genius as a comedian . Morrison writes that the portrayal was one that many consider to be his finest contribution to film . In 42 the picture was added to the National Film Registry, where it was described as Barrymores last great film role .     In May 42 Barrymore was filming  Hat, Coat and Glove  for RKO when, during the filming of one scene, he again forgot his lines and even the name of his character. Filming was postponed until the following day, but the result was the same. After he took a break for a few days, he returned to the set, but he still could not remember any of the script, and RKO replaced him with ": null
    },
    {
        "Ricardo Cortez": "ricardo cortez"
    },
    {
        ". Soon afterwards, he suffered a mental and physical breakdown and was hospitalized. Costello confirmed that his drinking over the previous two years had worsened, and she described him as a hopeless alcoholic . Barrymores relationship with Costello was deeply troubled and, believing she was going to declare him mentally incompetent, he left their home in Los Angeles and traveled first to London and then to India. He returned to the US in early 42 and settled in New York, leaving his wife in Los Angeles. Shortly after his return, he was hospitalized for a month with bronchitis and influenza. A 42-year-old fan, ": null
    },
    {
        "Elaine Jacobs": "elaine barrie"
    },
    {
        ", visited him, and the two became good friends. On his release from the hospital, her mother invited him to recuperate at their house. She changed her name to Elaine Barrie, which she explained was to get as near to Barrymore as I dared , and they began a relationship. In May, the couple underwent the first of several professional collaborations, when they appeared on ": null
    },
    {
        "Rudy Vallée": "rudy vallée"
    },
    {
        "s  The Fleischmanns Yeast Hour  radio show.     The relationship was widely reported in the ": null
    },
    {
        "tabloid press": "tabloid journalism"
    },
    {
        ", who labeled the couple ": null
    },
    {
        "Caliban": "caliban"
    },
    {
        " and ": null
    },
    {
        "Ariel": "ariel"
    },
    {
        ". Costello filed for divorce, but after a series of arguments with Barrie, Barrymore considered the relationship with Barrie to be at an end, and he left for Los Angeles. A newspaper editor chartered a plane and flew Barrie to Chicago, to meet Barrymores train; she broadcast a plea for him to return, and her pursuit became national news. Morrison thinks that the headlines established a new reputation for Barrymore of the aging satyr, the has-been alcoholic, the much-married ham . This was a blow to his self-respect, but he faced his troubles with aplomb and a sense of humor , according to Morrison. To escape from the spotlight, Barrymore took vacations on his yacht; it cost him over $42 a year to run, and so he sold it in 42 after encountering financial difficulties.          Barrymores alcohol dependence meant most studios were unwilling to employ him, but MGM risked casting him in the role of ": null
    },
    {
        "Mercutio": "mercutio"
    },
    {
        " in their 42 film  Romeo and Juliet . To minimize disruption to the schedule, the studio put Barrymore in Kelleys Rest Home, a sanatorium for alcoholics, but he continued to drink covertly and was disruptive on set. ": null
    },
    {
        "Basil Rathbone": "basil rathbone"
    },
    {
        ", who was playing ": null
    },
    {
        "Tybalt": "tybalt"
    },
    {
        ", later recounted that he was drinking and unreliable on the set  ... It was sad to see him in such a state.  Opinions on his portrayal were divided. Some critics, such as Welford Beaton of the Hollywood Spectator, thought Barrymore is an acting gem , although Gielgud was uncomplimentary, writing to ": null
    },
    {
        "Peggy Ashcroft": "peggy ashcroft"
    },
    {
        " that Barrymore, who is like a monstrous old male impersonator jumping through a hoop, should really have been shot.      Word about Barrymores problems on and off the set spread around the industry, and he did not work on another film for over a year, when he had a supporting role in the musical film  Maytime . His divorce from Costello was finalized in October 42 and he married Barrie in November the same year. The couple had a heated argument in public shortly afterwards, and he again spent time in Kelleys Rest Home and hospital, which cost him an average of $42 daily, draining his finances. When he came out, he collapsed on the Maytime set. On January 42 42 he was served with divorce papers, and a month later he filed for bankruptcy protection, with debts of $42. The divorce was granted in April, but the couple reconciled before it was finalized.     Barrymore decided to work on more Shakespeare roles. In June 42 he signed up with ": null
    },
    {
        "NBC Radio": "blue network"
    },
    {
        " to produce a series of six episodes under the name Streamlined Shakespeare, which also featured Barrie. The first program was Hamlet, which was well received by critics. The New York Times commented that Shakespeares lines uttered dramatically by the voice of John Barrymore sweep through the ether with a sound of finality; it seems that they are his words and no one else could speak them with such lifelike force .  Peters disagrees however, and considers that because he was desperate he pressed too hard and ended by caricaturing, not capturing, his great Shakespearean acting .        Throughout the NBC series, Barrymore had been reliable, sober and responsible, and the studios reacted positively with offers of work. This led to appearances in nine films in 42 and 42 including as Colonel Nielson in three ": null
    },
    {
        "Bulldog Drummond": "bulldog drummond"
    },
    {
        " films, and roles in  True Confession  and  Marie Antoinette . He was offered predominantly supporting roles, but he worked conscientiously on the films and as a consequence was able to honor his debts. His memory was still problematic, and he used ": null
    },
    {
        "cue cards": "cue cards"
    },
    {
        " as an aid; his fellow actors and the directors of the films were sympathetic to his condition. When he filmed his last serious role, Gregory Vance in the 42 film  The Great Man Votes , the director, ": null
    },
    {
        "Garson Kanin": "garson kanin"
    },
    {
        ", ensured that the cast and crew addressed him as Mr. Barrymore as a mark of respect.        Barrymore and his wife both appeared in supporting roles in the 42 screwball comedy  Midnight , her only film role. The New York Times thought the film was one of the liveliest, gayest, wittiest and naughtiest comedies of a long hard season and that Barrymore, the ": null
    },
    {
        "[Lou] Gehrig": "lou gehrig"
    },
    {
        " of eye-brow batting, rolls his phrases with his usual richly humorous effect . The film was inducted into the National Film Registry in 42 Barrymore and his wife appeared together in the stage farce My Dear Children, which opened in March 42 at ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        "s ": null
    },
    {
        "McCarter Theatre": "mccarter theatre"
    },
    {
        ". He played the lead role, Allan Manville, an ageing hammy Shakespearean has-been. Because of his failing memory, Barrymore ad-libbed constantly throughout the show. In some points the new additions were an improvement, but he also greeted friends in the audience, and used profanities freely. Nevertheless, the show was a success.  Life  magazine wrote that People flock to see not for polished performance, but because he converts the theater into a rowdy histrionic madhouse. Sometimes he arrives late. Sometimes he is tight. Usually he forgets his lines. But he always puts on a great show. When the show reached Broadway, Life wrote that Barrymores return to Times Square was a huge professional triumph . ": null
    },
    {
        "Brooks Atkinson": "brooks atkinson"
    },
    {
        ", writing for The New York Times thought that Barrymore was still the most gifted actor in this country.  ... Although he has recklessly played the fool for a number of years, he is nobodys fool in My Dear Children but a superbly gifted actor on a tired holiday. Barrymore and his wife continued to argue during the plays run, and she left the play part way through the tour. They attempted a reconciliation when the production reached New York, but the couple divorced in late 42      In 42 Barrymore appeared in  The Great Profile , a spoof of his life in the months prior to My Dear Children. Barrymore played Evans Garrick, closely modeled on his own experience, and ": null
    },
    {
        "Mary Beth Hughes": "mary beth hughes"
    },
    {
        " played his wife. The critics reacted harshly to the film, and to Barrymores association with it. The New York Times wrote that As a play it is a feeble thing, hardly matching the spectacular public accounts of his amours  ... for all of Mr. Barrymores shenanigans and devastating wit, The Great Profile is more than a little pathetic. In the Winter of his Discontent Mr. Barrymore is selling his talent at cut-rate . In terms of his reputation, worse was to come in his final film,  Playmates  , which amply illustrated the depths to which he had fallen; he played an alcoholic Shakespearean ham named John Barrymore .     In October 42 Barrymore returned to the NBC Radio network to work on Rudy Vallées show, now called the Sealtest Show. Barrymore recorded 42 episodes of the program, continuing in the vein of self-parody, with jokes about his drinking, declining career and marital issues. On May 42 42 while recording a line from Romeo and Juliet for the show, Barrymore collapsed. He was taken to the Hollywood Presbyterian Hospital and died there on May 42 from ": null
    },
    {
        "cirrhosis": "cirrhosis"
    },
    {
        " of the liver and kidney failure, complicated by ": null
    },
    {
        "pneumonia": "pneumonia"
    },
    {
        ". Shortly before his death, Barrymore returned to the faith of the Catholic Church. Although ": null
    },
    {
        "Errol Flynn": "errol flynn"
    },
    {
        "s memoirs claim that the film director ": null
    },
    {
        "Raoul Walsh": "raoul walsh"
    },
    {
        " borrowed Barrymores body before burial to leave his corpse propped in a chair for a drunken Flynn to discover when he returned home, Gene Fowler, a close friend of Barrymore, stayed with the body all night and denies the story. Barrymore was buried at ": null
    },
    {
        "Calvary Cemetery": "calvary cemetery"
    },
    {
        " in Los Angeles on June 42 In 42 Barrymores son had his fathers body reinterred at Philadelphias ": null
    },
    {
        "Mount Vernon Cemetery": "mount vernon cemetery"
    },
    {
        ".               The New York Times obituary stated that during the period when Barrymores performed in Justice, Richard III and Hamlet, the actor was accepted by most critics as the foremost English-speaking actor of his time  ... equipped both by nature and by art. The Washington Post agreed, noting that during his stage triumphs and early years in film, he was the great profile, the darling of the royal family of the stage. Many of the obituaries made the point that Barrymore fell short of his potential. The Manchester Guardian thought that he might with some self-discipline have added his name to the list of truly great actors  ... yet he dissipated his energies . The New York Times noted that he could twist his abilities to parody, burlesque himself and play the clown , and they considered that it was unfortunate that the public in recent years saw him in  ... mood. It was a mood of careless abdication . The Washington Post observed that with the passing of the years  – and as his private life became more public  – he became, despite his genius in the theater, a tabloid character.     According to Morrison, Barrymores stage portrayals of Richard III and Hamlet were a model for modern performances of these roles. His interpretation along psychological lines was innovative, and his dynamic portrayals  ... changed the direction of subsequent revivals.  Barrymores natural acting style reversed the stage conventions of the time; his colloquial verse speaking introduced to the stage the vocal manner of a postwar gentleman.         Barrymore was honored on few occasions by the entertainment industry and its members. Although both his brother and sister won ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        "s, the only award Barrymore ever received for his screen work was from ": null
    },
    {
        "Rudolph Valentino": "rudolph valentino"
    },
    {
        " in 42 for Beau Brummel. Valentino created an award in his own name and felt that his fellow actors should receive accolades for their screen work. When Barrymore attended his ceremony at ": null
    },
    {
        "Graumans Chinese Theatre": "graumans chinese theatre"
    },
    {
        " in 42 he left more than the customary ": null
    },
    {
        "hand and footprints": "list of tcl chinese theatre handprint ceremonies"
    },
    {
        " in the theaters forecourt: aided by the owner, ": null
    },
    {
        "Sid Grauman": "sid grauman"
    },
    {
        ", Barrymore left a cement imprint of his facial profile. In February 42 for his contribution to the motion picture industry, Barrymore was inducted into the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        " with a ": null
    },
    {
        "star": "list of actors with hollywood walk of fame motion picture stars"
    },
    {
        " at 42 ": null
    },
    {
        "Hollywood Boulevard": "hollywood boulevard"
    },
    {
        "; Barrymore, along with his two siblings, is included in the ": null
    },
    {
        "American Theater Hall of Fame": "american theater hall of fame"
    },
    {
        ". The Barrymore Royal Family of actors continued through two of his children  – his son with Costello, ": null
    },
    {
        "John Drew Barrymore": "john drew barrymore"
    },
    {
        " and his daughter with Oelrichs, ": null
    },
    {
        "Diana": "diana barrymore"
    },
    {
        "  – both of whom became actors, as did John Jr.s daughter ": null
    },
    {
        "Drew": "drew barrymore"
    },
    {
        ". Barrymores brother Lionel died on November 42 42 and their sister Ethel died on June 42 42        Barrymores achievements and his colorful life have ensured that several biographical studies followed his 42 autobiography, Confessions of an Actor. Alma Power-Waters produced a 42 study, authorized by the subject, John Barrymore: The Legend and the Man; Fowler, wrote Good Night, Sweet Prince: The Life and Times of John Barrymore ; Alpert published The Barrymores ; and John Kobler wrote Damned in Paradise: The Life of John Barrymore , although Norden noted in 42 that many of these earlier works are less than reliable. Those he identified as being more thoroughly researched are Peters 42 history, The House of Barrymore, and his own study of the actors work in John Barrymore: A Bio-Bibliography . Subsequent to Nordens comments on the available literature, Morrison published the positively reviewed John Barrymore, Shakespearean Actor in 42 which focuses on Barrymores stage work.     There were several celebratory events in 42 on the centenary of Barrymores birth. The ": null
    },
    {
        "Academy of Motion Picture Arts and Sciences": "academy of motion picture arts and sciences"
    },
    {
        " and the ": null
    },
    {
        "Museum of Modern Art": "museum of modern art"
    },
    {
        " jointly hosted a commemorative program of his work, which included numerous excerpts from his films and interviews with some who knew him, including Barrie and his one-time co-star Myrna Loy. The same year, in celebration of the centenary of the ": null
    },
    {
        "Actors Fund of America": "actors fund of america"
    },
    {
        ", the ": null
    },
    {
        "US Postal Service": "united states postal service"
    },
    {
        " issued a postage stamp featuring Barrymore and his siblings. In February 42 an intersection in ": null
    },
    {
        "Fort Lee, New Jersey": "fort lee, new jersey"
    },
    {
        ", was renamed John Barrymore Way on what would have been the actors 42th birthday. The intersection marked the spot of the former Buckheisters Hotel, where Barrymore had his 42 stage debut in A Man of the World .          Barrymore has been used as the inspiration for characters on stage and film. He performed as himself in a number of works , and in the  Ziegfeld Follies  of 42 he was played by his friend ": null
    },
    {
        "W. C. Fields": "w. c. fields"
    },
    {
        ". In 42 the Barrymore family was parodied in  The Royal Family  in which a character based on him was portrayed by ": null
    },
    {
        "Fredric March": "fredric march"
    },
    {
        ", whose performance Barrymore admired. The play was staged in London in 42 as Theatre Royal, with ": null
    },
    {
        "Laurence Olivier": "laurence olivier"
    },
    {
        " in the Barrymore role, and ": null
    },
    {
        "adapted as a film in 42": "the royal family of broadway"
    },
    {
        ", with March reprising his performance.     In 42 ": null
    },
    {
        "Paul Rudnick": "paul rudnick"
    },
    {
        "s comedy  I Hate Hamlet , performed at the ": null
    },
    {
        "Walter Kerr Theatre": "walter kerr theatre"
    },
    {
        ", was set in Barrymores former apartment. He returns after a séance, dressed in his Hamlet costume. ": null
    },
    {
        "Nicol Williamson": "nicol williamson"
    },
    {
        " played the Barrymore role. Three years later, a London production, Jack: A Night on the Town with John Barrymore, ran for 42 performances at the ": null
    },
    {
        "Criterion Theatre": "criterion theatre"
    },
    {
        ", and Williamson again played the lead.  Barrymore , a two-person play by ": null
    },
    {
        "William Luce": "william luce"
    },
    {
        ", premiered in 42 and depicts Barrymore shortly before his death in 42 as he is rehearsing a revival of his Richard III. ": null
    },
    {
        "Christopher Plummer": "christopher plummer"
    },
    {
        " played the title role. A film version was released in 42 with Plummer again taking the main role.     Barrymore had been a friend and drinking companion of Fields. In the 42 film  W.C. Fields and Me , Barrymore was played by ": null
    },
    {
        "Jack Cassidy": "jack cassidy"
    },
    {
        ". Barrymores friend, Errol Flynn, played him in a 42 film  Too Much, Too Soon , an adaptation of the autobiography of Diana Barrymore, with ": null
    },
    {
        "Dorothy Malone": "dorothy malone"
    },
    {
        " playing the female lead. ": null
    },
    {
        "Howard Thompson": "howard thompson"
    },
    {
        ", the film critic of The New York Times, wrote that Flynn, as the late John Barrymore, a moody, wild-drinking ruin of a great actor, steals the picture, lock, stock and keg. It is only in the scenes of his savage disintegration, as the horrified girl hangs on, that the picture approaches real tragedy.              ": null
    }
]