[
    {
        "      Johnny Brennan is an American actor, film writer, and voice actor. Johnny Brennan is the creator of the ": null
    },
    {
        "Jerky Boys": "jerky boys"
    },
    {
        ".     In 42 Johnny Brennan wrote and starred with Ahmed in a motion picture portraying the antics of Johnnys Jerky Boys characters called  The Jerky Boys: The Movie  . In 42 Johnny appeared in the ": null
    },
    {
        "Mariah Carey": "mariah carey"
    },
    {
        " music video Honey . Brennan is more recently known for his voice work in the Emmy-nominated animated series  Family Guy  where he performs the voices of ": null
    },
    {
        "Mort Goldman": "mort goldman"
    },
    {
        " and ": null
    },
    {
        "Horace": "list of characters from family guyhorace"
    },
    {
        " the bartender of the Drunken Clam. He appears as himself as a member of the Jerky Boys in an episode of  Space Ghost Coast to Coast  in 42     In 42 Brennan released the first solo release under the Jerky Boys name, titled  Sols Rusty Trombone . It was the first Jerky Boys release since 42 In April, Brennan reprised his role of Frank Rizzo on the animated web series Clock Suckers in the episode If You Cant Beat Em, Then Youre a Pussy .     In 42 Brennan released two ": null
    },
    {
        "iOS": "ios"
    },
    {
        " apps, titled The Jerky Boys Prank Caller and The Jerky Boys Pinball developed by  Inner Four .     Brennan launched The Jerky Boys Show with Johnny Brennan as a free podcast in October 42 On the show, Brennan discussed the history behind Jerky Boys tracks and allowed fans to call in with questions. Sixteen episodes of the podcast aired before it ended in February 42 In November 42 a seventeenth episode was released, featuring a prerecorded interview that had taken place at Gotham Comedy Club in New York City.        Big Money Hustlas  ... actor    The Jerky Boys: The Movie  ... actor, writer        Space Ghost Coast to Coast  – Himself    Family Guy  – ": null
    },
    {
        "Mort Goldman": "mort goldman"
    },
    {
        " , ": null
    },
    {
        "Horace": "horace"
    },
    {
        "                                                   ": null
    }
]