[
    {
        "John George Hohman , who was active between 42 and 42 was a ": null
    },
    {
        "German": "germany"
    },
    {
        "-": null
    },
    {
        "American": "united states"
    },
    {
        " printer": "printer"
    },
    {
        ", ": null
    },
    {
        "book seller": "book seller"
    },
    {
        " and compiler of collections of ": null
    },
    {
        "herbal remedies": "herbal remedies"
    },
    {
        ", ": null
    },
    {
        "magical": "magic"
    },
    {
        " healings": "healings"
    },
    {
        ", and ": null
    },
    {
        "charms": "spell"
    },
    {
        ". He immigrated to the USA from Germany in 42 settled in the area around ": null
    },
    {
        "Reading, Pennsylvania": "reading, pennsylvania"
    },
    {
        ", in the ": null
    },
    {
        "Pennsylvania Dutch": "pennsylvania dutch"
    },
    {
        " community, where he printed and sold ": null
    },
    {
        "broadsides": "street literature"
    },
    {
        ", ": null
    },
    {
        "chapbooks": "chapbooks"
    },
    {
        " and ": null
    },
    {
        "books": "books"
    },
    {
        " and practised and instructed in the arts of ": null
    },
    {
        "folk": "folklore"
    },
    {
        " magic and ": null
    },
    {
        "folk religion": "folk religion"
    },
    {
        " which became known as ": null
    },
    {
        "pow-wow": "pow-wow"
    },
    {
        ".     Hohmans best known work is the collection of prayers and recipes for folk-healing titled Pow-Wows, or the Long Lost Friend, published in German in 42 as Der Lange Verborgene Freund and in two English translations—the first in 42 in a rather crude translation by Hohman himself and the second in 42 by a different and more fluent translator . The name Pow-Wows was only added to the book in late 42th century reprints in the wake of the sudden popularity of ": null
    },
    {
        "Spiritualism": "spiritualism"
    },
    {
        " in the United States, in which Indian Spirit Guides were frequently seen during ": null
    },
    {
        "seance": "seance"
    },
    {
        "s.     In addition to The Long-Lost-Friend, Hohman also wrote and published, or at least had attributed to him, a number of further books in German, including Unsers Herran Jesu Christi Kinderbuch, oder, Merkwurdige Historische Beschreibung Von Joachim Und Anna , and  Albertus Magnus , oder, Der Lange Verborgene und Getreuer und Christlicher Unterricht fur Jedermann . The last book attributed to Hohman was published in 42        Excerpt from The Pennsylvania German Broadside: A History and Guide by Don Yoder                    ": null
    }
]