[
    {
        "            Sir John Grey Gorton  was the ": null
    },
    {
        "nineteenth": "list of prime ministers of australia"
    },
    {
        " Prime Minister of Australia": "prime minister of australia"
    },
    {
        ", in office from 42 to 42 He led the ": null
    },
    {
        "Liberal Party": "liberal party of australia"
    },
    {
        " during that time, having previously been a long-serving government minister.     Gorton was born out of wedlock and had a turbulent childhood. He studied at ": null
    },
    {
        "Brasenose College, Oxford": "brasenose college, oxford"
    },
    {
        ", after finishing his secondary education at ": null
    },
    {
        "Geelong Grammar School": "geelong grammar school"
    },
    {
        ", and then returned to Australia to take over his fathers property in northern ": null
    },
    {
        "Victoria": "victoria"
    },
    {
        ". Gorton enlisted in the ": null
    },
    {
        "Royal Australian Air Force": "royal australian air force"
    },
    {
        " in 42 and served as a fighter pilot in ": null
    },
    {
        "Malaya": "malayan campaign"
    },
    {
        " and ": null
    },
    {
        "New Guinea": "new guinea campaign"
    },
    {
        " during the Second World War. He suffered severe facial injuries in a crash landing on ": null
    },
    {
        "Bintan Island": "bintan island"
    },
    {
        " in 42 and whilst being evacuated; his ship was torpedoed and sunk by a Japanese submarine. He returned to farming after being discharged in 42 and was elected to the ": null
    },
    {
        "Kerang Shire Council": "shire of kerang"
    },
    {
        " in 42; he later served a term as shire president.     After a previous unsuccessful candidacy at state level, Gorton was elected to the ": null
    },
    {
        "Senate": "australian senate"
    },
    {
        " at the ": null
    },
    {
        "42 federal election": "1949 australian federal election"
    },
    {
        ". He took a keen interest in foreign policy, and gained a reputation as a strident ": null
    },
    {
        "anti-Communist": "anti-communist"
    },
    {
        ". Gorton was promoted to the ministry in 42 and over the following decade held a variety of different portfolios in the governments of ": null
    },
    {
        "Robert Menzies": "robert menzies"
    },
    {
        " and ": null
    },
    {
        "Harold Holt": "harold holt"
    },
    {
        ". He was responsible at various times for the Navy, public works, education, and science. He was elevated to the Cabinet in 42 and the following year, he was promoted to ": null
    },
    {
        "Leader of the Government in the Senate": "leader of the government in the senate"
    },
    {
        ".     Gorton ": null
    },
    {
        "defeated": "1968 liberal party of australia leadership election"
    },
    {
        " three other candidates for the Liberal leadership after ": null
    },
    {
        "Harold Holts disappearance": "disappearance of harold holt"
    },
    {
        " on 42 December 42 He became the first and only senator to assume the office of Prime Minister, but soon transferred to the ": null
    },
    {
        "House of Representatives": "australian house of representatives"
    },
    {
        " in line with constitutional convention. The ": null
    },
    {
        "Gorton Government": "gorton government"
    },
    {
        " continued ": null
    },
    {
        "Australian involvement": "military history of australia during the vietnam war"
    },
    {
        " in the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", but began withdrawing troops amid growing public discontent. It retained office at the ": null
    },
    {
        "42 federal election": "1969 australian federal election"
    },
    {
        ", albeit with a severely reduced majority. Gortons domestic policies, which emphasised ": null
    },
    {
        "centralisation": "centralisation"
    },
    {
        " and ": null
    },
    {
        "economic nationalism": "economic nationalism"
    },
    {
        ", were often controversial in his own party, and his individualistic style alienated many of his Cabinet members. He resigned as Liberal leader in 42 after a ": null
    },
    {
        "confidence motion": "confidence motion"
    },
    {
        " in his leadership was tied, and was replaced by ": null
    },
    {
        "William McMahon": "william mcmahon"
    },
    {
        ".     After losing the premiership, Gorton was elected deputy leader under McMahon and appointed ": null
    },
    {
        "Minister for Defence": "minister for defence"
    },
    {
        ". He was sacked for disloyalty after a few months. After the Coalitions defeat at the ": null
    },
    {
        "42 federal election": "1972 australian federal election"
    },
    {
        ", Gorton ": null
    },
    {
        "unsuccessfully stood": "1972 liberal party of australia leadership election"
    },
    {
        " as McMahons replacement. He briefly served as an opposition ": null
    },
    {
        "frontbencher": "frontbencher"
    },
    {
        " under ": null
    },
    {
        "Billy Snedden": "billy snedden"
    },
    {
        ", but stood down in 42 and spent the rest of his career as a ": null
    },
    {
        "backbencher": "backbencher"
    },
    {
        ". Gorton resigned from the Liberal Party when ": null
    },
    {
        "Malcolm Fraser": "malcolm fraser"
    },
    {
        " was elected leader, and at the ": null
    },
    {
        "42 election": "1975 australian federal election"
    },
    {
        " mounted an unsuccessful campaign for the Senate as an ": null
    },
    {
        "independent": "independent politician"
    },
    {
        ". He later spent several years as a political commentator, retiring from public life in 42               John Grey Gorton was the second child of Alice Sinn and John Rose Gorton; his older sister Ruth was born in 42 He had no birth certificate, but on official forms recorded his date of birth as 42 September 42 and his place of birth as ": null
    },
    {
        "Wellington": "wellington"
    },
    {
        ", New Zealand. His birth was registered in the state of ": null
    },
    {
        "Victoria": "victoria"
    },
    {
        " as occurring on that date, but in the inner ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        " suburb of ": null
    },
    {
        "Prahran": "prahran, victoria"
    },
    {
        ". However, that document contained a number of inaccuracies – his name was given as John Alga Gordon , his parents were recorded as husband and wife, his fathers name was incorrect, and his sister was recorded as deceased.  At some point, Gortons father told him that he had actually been born in Wellington. There are no records of his birth in New Zealand, but his parents are known to have travelled there on several occasions. Hancock , p. 42 John Gorton apparently believed he was born in Wellington, listing the city as his place of birth on his RAAF enlistment papers. , National Archives of Australia. Retrieved 42 November 42     If John Gorton was indeed born in New Zealand, this would have made him a New Zealand citizen from 42 January 42 under changes to ": null
    },
    {
        "New Zealand nationality law": "new zealand nationality law"
    },
    {
        ". Holding dual-citizenship would have rendered Gorton ineligible to sit in Australias federal parliament under ": null
    },
    {
        "Section 42 of the Australian Constitution": "section 44 of the australian constitution"
    },
    {
        ". Gortons eligibility to have sat in parliament throughout his career is therefore unclear. , William Summers . Retrieved 42 November 42     Gortons father was born to a middle-class family in ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        ", UK. As a young man he moved to ": null
    },
    {
        "Johannesburg": "johannesburg"
    },
    {
        ", South Africa, where he went into business as a merchant – during the ": null
    },
    {
        "Boer War": "second boer war"
    },
    {
        ", he developed a reputation as a ": null
    },
    {
        "war profiteer": "war profiteering"
    },
    {
        ". He reputedly escaped the ": null
    },
    {
        "Siege of Ladysmith": "siege of ladysmith"
    },
    {
        " by sneaking through Boer lines, and then made his way to Australia. Hancock , p. 42 He was involved in various business schemes in multiple states, and was to said to have lived on the brink of a fortune which never quite materialised . Hancock , p. 42 One of his business partners was the inventor ": null
    },
    {
        "George Julius": "george julius"
    },
    {
        ". At some point, Gortons father separated from his first wife, Kathleen OBrien, and began living with Alice Sinn – born in Melbourne to a German father and an Irish mother. However, Kathleen refused to grant him a divorce. Some official documents record Gortons parents as having married in New Zealand at some point, but there are no records of this occurring; any such marriage would have been bigamous. Gorton never denied his illegitimacy as an adult, but it did not become generally known until a biography was published during his premiership.          Gorton spent his early years living with his maternal grandparents in ": null
    },
    {
        "Port Melbourne": "port melbourne, victoria"
    },
    {
        ", as his parents were frequently away on business trips. When he was about four years old, his parents took him to live with them in Sydney, where they had an apartment at ": null
    },
    {
        "Edgecliff": "edgecliff, new south wales"
    },
    {
        ". Gorton began his education at Edgecliff Preparatory School. Hancock , p. 42 When he was eight years old, his mother contracted tuberculosis and was sent to a ": null
    },
    {
        "sanatorium": "sanatorium"
    },
    {
        " to avoid passing on the disease. She died in September 42 aged 42 Gortons grieving father sent his son to live with his estranged wife Kathleen. There, he met his sister Ruth for the first time; he had previously been told that she was dead. Although she was his full sibling, she had been raised by Kathleen since birth, and rarely saw her biological parents. Gorton initially lived with Kathleen and Ruth at their home in ": null
    },
    {
        "Cronulla": "cronulla, new south wales"
    },
    {
        ". They later moved into a larger house in ": null
    },
    {
        "Killara": "killara, new south wales"
    },
    {
        ", in the north of Sydney. Hancock , p. 42     While living in Killara, Gorton began attending Headfort College, a short-lived private school run by a former Anglican minister. In 42 he began boarding at ": null
    },
    {
        "Sydney Church of England Grammar School": "sydney church of england grammar school"
    },
    {
        " , initially on a weekly basis but later on a full-time one. Hancock , p. 42 He did not excel academically, failing the ": null
    },
    {
        "Intermediate Certificate": "intermediate certificate"
    },
    {
        " on his first attempt, but was a well-liked boy and good at sports. Hancock , p. 42 Gorton began spending his holidays with his father, who had purchased a property in ": null
    },
    {
        "Mystic Park, Victoria": "mystic park, victoria"
    },
    {
        ", and planted a citrus orchard. Hancock , p. 42 He left Shore at the end of 42 and the following year began boarding at ": null
    },
    {
        "Geelong Grammar School": "geelong grammar school"
    },
    {
        ", which he would attend for four years from 4242 Hancock , p. 42 He represented the school in athletics, ": null
    },
    {
        "football": "australian rules football"
    },
    {
        ", and rowing, and in his final year was a school prefect and house captain. Hancock , p. 42       After leaving Geelong Grammar, Gorton spent a year working on his fathers property in Mystic Park. His father then took out a second mortgage to allow him to travel to England and attend ": null
    },
    {
        "Oxford University": "oxford university"
    },
    {
        ". Gorton arrived in England in early42 and after a period at a cramming school passed the exam to enter ": null
    },
    {
        "Brasenose College": "brasenose college, oxford"
    },
    {
        ". He also took flying lessons around the same time, and was awarded a pilots licence in June 42 Gorton began his degree in October 42 and finished in June 42 with an ": null
    },
    {
        "upper second": "upper-second class"
    },
    {
        " in History, Politics, and Economics. He was initially something of an outsider, with relatively little money and no social connections. However, his prowess in rowing – he won the O.U.B.C. Fours in his first year, and was Captain of the ": null
    },
    {
        "Brasenose College Boat Club": "brasenose college boat club"
    },
    {
        " – saw him elected to ": null
    },
    {
        "Vincents Club": "vincents club"
    },
    {
        " and ": null
    },
    {
        "Leander Club": "leander club"
    },
    {
        ". In 42 while on holiday in ": null
    },
    {
        "Spain": "second spanish republic"
    },
    {
        ", he met his future wife ": null
    },
    {
        "Bettina Brown": "bettina gorton"
    },
    {
        ", the younger sister of one of his College friends. They married in early42 , Biographical Dictionary of the Australian Senate . Retrieved 42 March 42       After his graduation, Gorton and his wife returned to Australia via the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", spending some time with her family in ": null
    },
    {
        "Maine": "maine"
    },
    {
        ". He had expected to take up a position at ": null
    },
    {
        "The Herald and Weekly Times": "the herald and weekly times"
    },
    {
        ", ": null
    },
    {
        "Keith Murdoch": "keith murdoch"
    },
    {
        "s newspaper group. However, he arrived in Melbourne to find his father in failing health; he died in August 42 Gorton had taken over the management of his fathers orchard as soon as he entered hospital. He inherited an overdraft of £42, which took several years to pay off. However, the property – located on the western side of ": null
    },
    {
        "Kangaroo Lake": "north victorian wetlands"
    },
    {
        " – was in good condition, requiring only minor improvements. He employed up to ten seasonal workers during picking season. Mystic Park remained his primary residence until he was appointed to the ministry, at which point he and his family moved to Canberra.                 On 42 May 42 following the outbreak of World War II, Gorton enlisted in the ": null
    },
    {
        "Royal Australian Air Force": "royal australian air force"
    },
    {
        " Reserve. Hancock: 42 At the age of 42 Gorton was considered too old for pilot training, but he re-applied in September after this rule was relaxed. Gorton was accepted and commissioned into the RAAF on 42 November 42 Hancock: 42 He trained as a fighter pilot at ": null
    },
    {
        "Somers, Victoria": "somers, victoria"
    },
    {
        " and ": null
    },
    {
        "Wagga Wagga": "wagga wagga"
    },
    {
        ", ": null
    },
    {
        "New South Wales": "new south wales"
    },
    {
        ", before being sent to the UK. Gorton completed his training at ": null
    },
    {
        "RAF Heston": "raf heston"
    },
    {
        " and ": null
    },
    {
        "RAF Honiley": "raf honiley"
    },
    {
        ", Trengrove: 42 with ": null
    },
    {
        "No. 42 Operational Training Unit RAF": "no. 61 operational training unit raf"
    },
    {
        ", flying ": null
    },
    {
        "Supermarine Spitfire": "supermarine spitfire"
    },
    {
        "s. Hancock: 42 He was disappointed when his first operational posting was ": null
    },
    {
        "No. 42 Squadron RAF": "no. 135 squadron raf"
    },
    {
        ", a ": null
    },
    {
        "Hawker Hurricane": "hawker hurricane"
    },
    {
        " unit, as he considered the type greatly inferior to Spitfires.     During late 42 Gorton and other members of his squadron became part of the ": null
    },
    {
        "cadre": "en cadre"
    },
    {
        " of a Hurricane ": null
    },
    {
        "wing": "wing"
    },
    {
        " being formed for service in the Middle East. They were sent by sea, with 42 Hurricanes in crates, travelling around Africa to reduce the risk of attack. In December, when the ship was at ": null
    },
    {
        "Durban": "durban"
    },
    {
        ", South Africa, it was diverted to Singapore, after ": null
    },
    {
        "Japan entered the war": "pacific war"
    },
    {
        ". Trengrove: 42 As it approached its destination in mid-January, ": null
    },
    {
        "Japanese": "empire of japan"
    },
    {
        " forces were ": null
    },
    {
        "advancing down the Malayan Peninsula": "battle of malaya"
    },
    {
        ". The ship was attacked on at least one occasion by Japanese aircraft, but arrived and unloaded safely after tropical storms made enemy air raids impossible. Trengrove: 42–42 As the Hurricanes were assembled, the pilots were formed into a composite operational squadron, ": null
    },
    {
        "No. 42 Squadron RAF": "no. 232 squadron raf"
    },
    {
        ".     In late January 42 the squadron became operational and joined the remnants of several others that had been in Malaya, operating out of ": null
    },
    {
        "RAF Seletar": "seletar airport"
    },
    {
        " and RAF ": null
    },
    {
        "Kallang": "kallang"
    },
    {
        ". Trengrove: 42 During one of his first ": null
    },
    {
        "sortie": "sortie"
    },
    {
        "s, Gorton was involved in a brief dogfight over the ": null
    },
    {
        "South China Sea": "south china sea"
    },
    {
        ", after which he suffered engine failure and was forced to land on ": null
    },
    {
        "Bintan": "bintan"
    },
    {
        " island, 42  km south east of Singapore. As he landed, one of the Hurricanes wheels hit an embankment and flipped over. Gorton was not properly strapped in and his face hit the gun sight and windscreen, mutilating his nose and breaking both cheekbones. Trengrove: 42 He also suffered severe lacerations to both arms. He made his way out of the wreck and was rescued by members of the ": null
    },
    {
        "Royal Dutch East Indies Army": "royal dutch east indies army"
    },
    {
        ", who provided some medical treatment. Gorton later claimed that his face was so badly cut and bruised, that a member of the RAF sent to collect him assumed he was near death, collected his personal effects and returned to Singapore without him. By chance, one week later, Sgt Matt OMara of ": null
    },
    {
        "No. 42 Squadron RAAF": "no. 453 squadron raaf"
    },
    {
        " also crash landed on Bintan, and arranged for them to be collected. Trengrove: 42     They arrived back in Singapore, on 42 February, three days after ": null
    },
    {
        "the island had been invaded": "battle of singapore"
    },
    {
        ". As the Allied air force units on Singapore had been destroyed or evacuated by this stage, Gorton was put on the Derrymore, an ammunition ship bound for ": null
    },
    {
        "Batavia": "jakarta"
    },
    {
        " . On 42 February, as it neared its destination, the ship was torpedoed by Japanese submarine I42 ": null
    },
    {
        "Kaidai class submarine": "kaidai class submarine"
    },
    {
        " and the Derrymore was abandoned. Gorton then spent almost a day on a crowded liferaft, in shark-infested waters, with little drinking water, until the raft was spotted by ": null
    },
    {
        "HMAS Ballarat": "hmas ballarat"
    },
    {
        ", which picked up the passengers and took them to Batavia. Trengrove: 42        Two schoolfriends, who had also been evacuated from Singapore to Batavia, heard that Gorton was in hospital, arranged for them to be put on a ship for ": null
    },
    {
        "Fremantle": "fremantle"
    },
    {
        ", which left on 42 February and treated Gortons wounds. Trengrove: 42 When the ship arrived in Fremantle, on 42 March, one of Gortons arm wounds had become septic and needed extensive treatment. However, he was more concerned about the effect that the sight of his mutilated face would have on his wife. It is reported that Betty Gorton, who had been running the farm in his absence, was relieved to see Gorton alive. Trengrove: 42         After arriving in Australia he was posted to ": null
    },
    {
        "Darwin": "darwin, northern territory"
    },
    {
        " on 42 August 42 with ": null
    },
    {
        "No. 42 Squadron RAAF": "no. 77 squadron raaf"
    },
    {
        " . During this time he was involved in his second air accident. While flying ": null
    },
    {
        "P42E": "p-40e"
    },
    {
        " A4242 on 42 September 42 he was forced to land due to an incorrectly set fuel cock. Both Gorton and his aircraft were recovered several days later after spending time in the bush. On 42 February 42 the squadron was relocated to ": null
    },
    {
        "Milne Bay": "milne bay"
    },
    {
        ", ": null
    },
    {
        "New Guinea": "new guinea"
    },
    {
        ".      Gortons final air incident came on 42 March 42 His A4242 Kittyhawks engine failed on take off, causing the aircraft to flip at the end of the strip. Gorton was unhurt. In March 42 Gorton was sent back to Australia with the rank of Flight Lieutenant. His final posting was as a Flying Instructor with ": null
    },
    {
        "No. 42 Operational Training Unit": "no. 2 operational conversion unit raaf"
    },
    {
        " at ": null
    },
    {
        "Mildura": "mildura"
    },
    {
        ", Victoria. He was then discharged from the RAAF on 42 December 42     During late 42 Gorton went to ": null
    },
    {
        "Heidelberg Hospital": "austin hospital, melbourne"
    },
    {
        " for surgery which could not fully repair his facial injuries; he was left permanently disfigured.       After resuming his life in Mystic Park, Gorton was elected unopposed to the ": null
    },
    {
        "Kerang Shire Council": "shire of kerang"
    },
    {
        " in September 42 He remained on the council until 42 overlapping with his first term in the Senate, and from 42 to 42 served as shire president. Hancock , p. 42 Although he had little previous experience, Gorton began to develop a reputation as a powerful public speaker. His first major speech, in April 42 was an address to a welcome-home gathering for returned soldiers at the Mystic Park Hall. In what ": null
    },
    {
        "John Brogden": "john brogden"
    },
    {
        " has described as Australias best unknown political speech ,  he exhorted his audience to honour those who had died in the war by building a world in which meanness and poverty, tyranny and hate, have no existence . Gortons next major speech was made in September 42 at a rally against the ": null
    },
    {
        "Chifley Government": "chifley government"
    },
    {
        "s attempt to nationalise private banks. He told the crowd in ": null
    },
    {
        "Kerang": "kerang"
    },
    {
        " that they should oppose the establishment of banks run by politicians, and objected in particular to the governments decision not to take the issue to a referendum. Hancock , p. 42 According to his biographer Ian Hancock, the bank nationalisation issue marked his advance beyond purely local politics and stamped him firmly and publicly as an anti-socialist . Hancock , p. 42     Gorton had been a supporter of the ": null
    },
    {
        "Country Party": "country party"
    },
    {
        " before the war, along with most of his neighbours. Over time, he became frustrated with the partys frequent squabbles with the ": null
    },
    {
        "Liberal Party": "liberal party of australia"
    },
    {
        " and its willingness to cooperate with the ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        ". Hancock , p. 42 After the Victorian Country Party withdrew from ": null
    },
    {
        "its coalition": "coalition"
    },
    {
        " with the Liberals in December 42 Gorton became involved in efforts to form a new anti-socialist movement that would absorb both parties. At some point he was introduced to ": null
    },
    {
        "Magnus Cormack": "magnus cormack"
    },
    {
        ", the state president of the Liberals, who became something of a mentor. Hancock , pp. 42–42 In March 42 Gorton was elected to the state executive of the new organisation, which named itself the ": null
    },
    {
        "Liberal and Country Party": "liberal and country party"
    },
    {
        " . Hancock , p. 42 On a number of occasions he addressed Country Party gatherings, urging its members to join the new party and stressing that it would not neglect rural interests, as many feared. Hancock , p. 42 However, the LCP did not achieve its goal of uniting the anti-Labor forces, as most Country Party members viewed it as simply a takeover attempt; the new party affiliated with the federal ": null
    },
    {
        "Liberal Party of Australia": "liberal party of australia"
    },
    {
        ".     In June 42 Gorton stood for the ": null
    },
    {
        "Victorian Legislative Council": "victorian legislative council"
    },
    {
        " as the LCP candidate in ": null
    },
    {
        "Northern Province": "northern province"
    },
    {
        ". It was a safe Country Party seat, and at the preceding three elections no other parties had bothered to field a candidate. Making right-wing unity the focal point of his campaign, Gorton polled 42 percent of the vote to finish less than 42 votes behind the sitting member, ": null
    },
    {
        "George Tuckett": "george tuckett"
    },
    {
        ". The result impressed the LCPs leadership, Hancock , p. 42 and the following month he was ": null
    },
    {
        "preselected": "preselection"
    },
    {
        " in third place on its joint ": null
    },
    {
        "Senate": "australian senate"
    },
    {
        " ticket with the Country Party. He was relatively unknown within the party, and his rural background was a major factor in his selection. Hancock , p. 42 The Coalition won a large majority at the ": null
    },
    {
        "42 federal election": "1949 australian federal election"
    },
    {
        ", including four out of Victorias seven senators. The LCP candidates joined the parliamentary Liberal Party. Hancock , p. 42            Gortons term in the Senate began on 42 February 42 He was re-elected to additional terms at the ": null
    },
    {
        "42": "1951 australian federal election"
    },
    {
        ", ": null
    },
    {
        "42": "1953 australian senate election"
    },
    {
        ", ": null
    },
    {
        "42": "1958 australian federal election"
    },
    {
        ", and ": null
    },
    {
        "42 elections": "1964 australian senate election"
    },
    {
        ", and from 42 occupied first place on the Coalitions ticket in Victoria. Gortons early speeches on domestic policy foreshadowed the stances and policy initiatives he would later adopt as prime minister, such as economic nationalism, support for a strong central government, and support for nuclear energy. One of his first notable actions in the Senate came in November 42 when he successfully moved a motion opposing any substantial measure of ownership or control over any Australian broadcasting station being granted to non-Australians. In his early speeches on foreign policy, Gorton drew analogies between the actions of the Soviet Union and Communist China and those of Nazi Germany. He developed a reputation as a hardline ": null
    },
    {
        "anti-communist": "anti-communism"
    },
    {
        " , speaking in favour of the Communist Party Dissolution Bill and campaigning for the Yes vote during the ": null
    },
    {
        "42 referendum": "1951 australian communist party ban referendum"
    },
    {
        " to ban the ": null
    },
    {
        "Communist Party": "communist party of australia"
    },
    {
        ". At a campaign rally in September 42 he had to be restrained by police after attempting to drag a heckler from his seat and shouting at him to come outside, you yellow rat .      From 42 to 42 Gorton served on the Joint Parliamentary Committee on Foreign Affairs, including as chairman for a period. He developed a keen interest in Asia, which was rooted in his anti-communism, and joined parliamentary delegations to Malaya, South Vietnam, Thailand, and the Philippines. He strongly supported Australia joining the ": null
    },
    {
        "Southeast Asia Treaty Organisation": "southeast asia treaty organisation"
    },
    {
        " , a collective defence initiative designed to ": null
    },
    {
        "prevent the spread of communism": "domino theory"
    },
    {
        " in the region. He also supported ": null
    },
    {
        "Taiwanese independence": "taiwanese independence"
    },
    {
        " and opposed Australian recognition of the Peoples Republic of China . On a number of occasions, Gorton spoke of the need for Australia to develop a foreign policy independent of Britain and the United States. In May 42 he told the Senate that Australia should acquire its own nuclear deterrent, including intercontinental missiles.            Gorton was elevated to the ministry after the ": null
    },
    {
        "42 election": "1958 australian federal election"
    },
    {
        ", as ": null
    },
    {
        "Minister for the Navy": "minister for the navy"
    },
    {
        ". This was a junior position subordinate to the Minister for Defence, ": null
    },
    {
        "Athol Townley": "athol townley"
    },
    {
        ". Although his promotion was unexpected, he would serve as Minister for the Navy for more than five years, the longest-serving navy minister in Australias history. Gorton regularly attended meetings of the ": null
    },
    {
        "Naval Board": "australian commonwealth naval board"
    },
    {
        ", unlike previous ministers, and championed its recommendations at cabinet meetings. He was able to secure most elements of the boards desired modernisation program, despite Townley showing more interest in the air force. During Gortons tenure, the navy acquired four Australian-built frigates and six British-built minesweepers, as well as placing orders for three ": null
    },
    {
        "Charles F. Adams-class destroyer": "charles f. adams-class destroyer"
    },
    {
        "s and four ": null
    },
    {
        "Oberon-class submarine": "oberon-class submarine"
    },
    {
        "s. He postponed the phasing out of the ": null
    },
    {
        "Fleet Air Arm": "fleet air arm"
    },
    {
        ", due to occur in 42 and secured the purchase of 42 ": null
    },
    {
        "Westland Wessex": "westland wessex"
    },
    {
        " helicopters.     Gorton was a supporter and admirer of Robert Menzies, who was sympathetic to his ambitions for higher office and assigned him additional responsibilities. In 42 he was tasked with securing the passage of the Matrimonial Causes Bill, which introduced uniform divorce laws; he described it as a systematic attempt to make a new approach to the problem of divorce . The bill was opposed by religious conservatives on both sides of politics, but it eventually passed the Senate with only a single amendment. Gorton was appointed assistant minister to the ": null
    },
    {
        "Minister for External Affairs": "minister for foreign affairs"
    },
    {
        " in February 42 working under Menzies and later under ": null
    },
    {
        "Garfield Barwick": "garfield barwick"
    },
    {
        " and ": null
    },
    {
        "Paul Hasluck": "paul hasluck"
    },
    {
        ". In February 42 he was also made minister-in-charge of the ": null
    },
    {
        "CSIRO": "csiro"
    },
    {
        ". During ": null
    },
    {
        "question time": "question time"
    },
    {
        " in the Senate, he represented ministers from the House of Representatives, allowing him to gain experience in portfolios beyond his own.          After the ": null
    },
    {
        "42 election": "1963 australian federal election"
    },
    {
        ", Gorton relinquished the navy portfolio and was placed in charge of the governments activities in education and scientific research. He was also made ": null
    },
    {
        "Minister for Works": "department of works"
    },
    {
        " and ": null
    },
    {
        "Minister for the Interior": "department of the interior"
    },
    {
        ", relatively low-profile positions dealing mostly with administrative matters; the latter post was taken over by ": null
    },
    {
        "Doug Anthony": "doug anthony"
    },
    {
        " after a few months. Menzies had a personal interest in education, having previously handled the portfolio himself, and told Gorton that it should be his primary focus. He was given oversight of the Australian Universities Commission, the ": null
    },
    {
        "Australian National University": "australian national university"
    },
    {
        ", the ": null
    },
    {
        "Commonwealth Archives Office": "national archives of australia"
    },
    {
        ", the ": null
    },
    {
        "Commonwealth Literary Fund": "commonwealth literary fund"
    },
    {
        ", and the ": null
    },
    {
        "National Library of Australia": "national library of australia"
    },
    {
        ". In January 42 Menzies retired and ": null
    },
    {
        "Harold Holt": "harold holt"
    },
    {
        " became prime minister. Gorton was elevated to ": null
    },
    {
        "cabinet": "cabinet of australia"
    },
    {
        ", and at the end of the year was given the title ": null
    },
    {
        "Minister for Education and Science": "minister for education"
    },
    {
        ". He was placed in charge of the new ": null
    },
    {
        "Department of Education and Science": "department of education and science"
    },
    {
        ", the first time those portfolios had been given a separate department at federal level.         Gorton presided over a major intrusion of the federal government into the education sector. His tenure saw significant increases in the number of university scholarships available, the number of new university entrants, and overall funding of education. One of the first major issues Gorton confronted was that of state aid to non-government schools. He believed that private schools should have equal access to federal government funding, and in 42 announced that the government would fund science laboratories for private schools. This stance, supported by the ": null
    },
    {
        "Catholic education sector": "catholic education in australia"
    },
    {
        " but opposed by secularists and most Protestant schools, eventually achieved widespread acceptance.  In September 42 Gorton created the Commonwealth Advisory Committee on Advanced Education, tasked with advising the government on non-university ": null
    },
    {
        "technical and further education": "technical and further education"
    },
    {
        " . He announced that the federal government would fund technical colleges on a pro-rata basis with the states, and personally oversaw the establishment of the Canberra College of Advanced Education, the forerunner of the ": null
    },
    {
        "University of Canberra": "university of canberra"
    },
    {
        ". As science minister, he lent his support to the ": null
    },
    {
        "Anglo-Australian Telescope": "anglo-australian telescope"
    },
    {
        " project, securing cabinet approval for its construction in April 42               ": null
    },
    {
        "Harold Holt": "harold holt"
    },
    {
        " disappeared while swimming on 42 December 42 and was declared presumed drowned two days later. His presumed successor was Liberal deputy leader ": null
    },
    {
        "William McMahon": "william mcmahon"
    },
    {
        ". However, on 42 December, the Country Party leader and Deputy Prime Minister ": null
    },
    {
        "John McEwen": "john mcewen"
    },
    {
        " announced that if McMahon were named the new Liberal leader, he and his party would not serve under him. His reasons were never stated publicly, but in a private meeting with McMahon, he said I will not serve under you because I do not trust you . Gavin Souter, Acts of Parliament, 42 pp. 42–42 McEwens shock declaration triggered a leadership crisis within the Liberal Party; even more significantly, it raised the threat of a possible breaking of the Coalition, which would spell electoral disaster for the Liberals. Up to that time, the Liberals had never won enough seats in any House of Representatives election to be able to govern without Country Party support. Indeed, since the Coalitions formation in 42 the major non-": null
    },
    {
        "Labor": "australian labor party"
    },
    {
        " party had only been able to govern alone once, during ": null
    },
    {
        "Joseph Lyons": "joseph lyons"
    },
    {
        " first ministry. Even then, Lyons ": null
    },
    {
        "United Australia Party": "united australia party"
    },
    {
        " had come up four seats short of a majority in its own right, and was only able to garner a bare majority of two when the five members of the ": null
    },
    {
        "Emergency Committee of South Australia": "emergency committee of south australia"
    },
    {
        " joined the UAP party room.     The Governor-General ": null
    },
    {
        "Lord Casey": "richard casey, baron casey"
    },
    {
        " swore McEwen in as Prime Minister, on an interim basis pending the Liberal Party electing its new leader. McEwen agreed to accept an interim appointment provided there was no formal statement of time limit. This appointment was in keeping with previous occasions when a conservative Coalition government had been deprived of its leader. In 42 when ": null
    },
    {
        "Joseph Lyons": "joseph lyons"
    },
    {
        " died suddenly, and in 42 when ": null
    },
    {
        "Robert Menzies": "robert menzies"
    },
    {
        " resigned, the Governor-General had commissioned the Deputy Prime Minister, who was the leader of the Country Party, to serve as Prime Minister until the major coalition partner—then the UAP—could choose its new leader. Casey also concurred in the view put to him by McEwen that to commission a Liberal temporarily as Prime Minister would give that person an unfair advantage in the forthcoming party room ballot for the permanent leader.      In the subsequent ": null
    },
    {
        "leadership struggle": "1968 liberal party of australia leadership election"
    },
    {
        ", Gorton was championed by Army Minister ": null
    },
    {
        "Malcolm Fraser": "malcolm fraser"
    },
    {
        ", Government Whip in the Senate ": null
    },
    {
        "Malcolm Scott": "malcolm scott"
    },
    {
        " and Liberal Party Whip ": null
    },
    {
        "Dudley Erwin": "dudley erwin"
    },
    {
        ", and with their support he was able to defeat rivals ": null
    },
    {
        "Paul Hasluck": "paul hasluck"
    },
    {
        ", ": null
    },
    {
        "Les Bury": "les bury"
    },
    {
        " and ": null
    },
    {
        "Billy Snedden": "billy snedden"
    },
    {
        " to become Liberal leader even though he was a member of the Senate. He was elected party leader on 42 January 42 and appointed Prime Minister on 42 January, replacing McEwen. He was the only Senator in Australias history to be Prime Minister and the only Prime Minister to have ever served in the Senate. He remained a Senator until, in accordance with the ": null
    },
    {
        "Westminster": "westminster system"
    },
    {
        " tradition that the Prime Minister is a member of the lower house of parliament, he resigned on 42 February 42 to contest the by-election for Holts old House of Representatives seat of ": null
    },
    {
        "Higgins": "division of higgins"
    },
    {
        " in south Melbourne. The by-election in this comfortably safe Liberal seat was held on 42 February; there were three other candidates, but Gorton achieved a massive 42% of the formal vote. He visited all the polling booths during the day, but was unable to vote for himself as he was still enrolled in ": null
    },
    {
        "Mallee": "division of mallee"
    },
    {
        ", in rural western Victoria. the agemagazine, p. 42 Between 42 and 42 February he was a member of neither house of parliament.          Gorton was initially a very popular Prime Minister. He carved out a style quite distinct from those of his predecessors – the aloof Menzies and the affable, sporty Holt. Gorton liked to portray himself as a man of the people who enjoyed a beer and a gamble, with a bit of a ": null
    },
    {
        " larrikin ": "larrikinism"
    },
    {
        " streak about him. Unfortunately for him, this reputation later came back to haunt him.     He also began to follow new policies, pursuing independent defence and foreign policies and distancing Australia from its traditional ties to Britain. But he continued to support Australias involvement in the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", a position he had reluctantly inherited from Holt, which became increasingly unpopular after 42 On domestic issues, he favoured centralist policies at the expense of the states, which alienated powerful Liberal state leaders like Sir ": null
    },
    {
        "Henry Bolte": "henry bolte"
    },
    {
        " of Victoria and ": null
    },
    {
        "Bob Askin": "robert askin"
    },
    {
        " of New South Wales. He also fostered an independent ": null
    },
    {
        "Australian film industry": "australian film industry"
    },
    {
        " and increased government funding for the arts.   Gorton proved to be a surprisingly poor media performer and public speaker, and was portrayed by the media as a foolish and incompetent administrator. He was unlucky to come up against a new and formidable Labor Opposition Leader in ": null
    },
    {
        "Gough Whitlam": "gough whitlam"
    },
    {
        ". Also, he was subjected to media speculation about his drinking habits and his involvements with women. He generated great resentment within his party, and his opponents became increasingly critical of his reliance on an inner circle of advisers – most notably his private secretary ": null
    },
    {
        "Ainsley Gotto": "ainsley gotto"
    },
    {
        ".     The Coalition suffered a 42% swing against it at the ": null
    },
    {
        "42 election": "1969 australian federal election"
    },
    {
        ", and Labor outpolled it on the ": null
    },
    {
        "two-party-preferred vote": "two-party-preferred vote"
    },
    {
        ". During the close election Gorton promised to waive all future government rent on residential leaseholders in Canberra.  After surviving the election Gorton came through on his promise, giving away an estimated $42  million in equity to leaseholders and abandoning future government rent revenue.  Still, Gorton saw the sizeable 42-seat majority he had inherited from Holt cut down to only seven. Indeed, the Coalition might have lost government had it not been for the ": null
    },
    {
        "Democratic Labor Party": "democratic labor party"
    },
    {
        "s longstanding practice of preferencing against the ALP. The Coalition was only assured of a ninth term in government when DLP preferences tipped four marginal seats in Melbourne —the DLPs heartland—to the Liberals. Had those preferences gone the other way, Whitlam would have become Prime Minister.  by ": null
    },
    {
        "Antony Green": "antony green"
    },
    {
        "       After the 42 election, Gorton ": null
    },
    {
        "was unsuccessfully challenged for the Liberal leadership": "liberal party of australia leadership spill, 1969"
    },
    {
        " by McMahon and National Development Minister ": null
    },
    {
        "David Fairbairn": "david fairbairn"
    },
    {
        ". With the Liberals falling further behind Labor in the polls in 42 a challenge was launched in March when Defence Minister ": null
    },
    {
        "Malcolm Fraser": "malcolm fraser"
    },
    {
        " resigned. Fraser had strongly supported Gorton for the leadership two years earlier, but now attacked Gorton on the floor of parliament in his resignation speech, saying that Gorton was not fit to hold the great office of Prime Minister.     Gorton called ": null
    },
    {
        "a Liberal caucus meeting": "liberal party of australia leadership spill, 1971"
    },
    {
        " for 42 March 42 to settle the matter. A motion of confidence in his leadership was tied. Under Liberal caucus rules of the time, a tied vote meant the motion was passed and hence Gorton could have remained as party leader and Prime Minister without further ado. However, he took it upon himself to resign, saying Well, that is not a vote of confidence, so the party will have to elect a new leader. Neil Brown, On the Other Hand ... Sketches and Reflections from Political Life, The Popular Press, 42 p. 42 A ballot was held and McMahon was elected leader and thus Prime Minister. Australian television marked the end of Gortons stormy premiership with a newsreel montage accompanied by ": null
    },
    {
        "Sinatras": "frank sinatra"
    },
    {
        " anthem ": null
    },
    {
        "My Way": "my way"
    },
    {
        " .     In a surprise move, Gorton contested and won the position of Deputy Leader, forcing McMahon to make him Defence Minister. This farcical situation ended within five months when McMahon sacked him for disloyalty.          A number of polls during McMahons prime ministership had Gorton as both the preferred Liberal leader and the preferred prime minister. In 42 businessman ": null
    },
    {
        "David Hains": "david hains"
    },
    {
        " commissioned a series of polls in marginal electorates that showed the Coalition would significantly increase its vote if Gorton mounted a successful comeback; for instance, polling in the ": null
    },
    {
        "Division of Henty": "division of henty"
    },
    {
        " found that his return would add eight points to the Liberal vote. However, Gorton generally downplayed the polling and did not mount an active campaign to oust McMahon. Hancock , pp. 42–42 Labor went on to win a nine-seat majority at the ": null
    },
    {
        "42 election": "1972 australian federal election"
    },
    {
        ", ending 42 consecutive years of Coalition rule. Hancock , p. 42 A number of Gortons contemporaries – including Country Party leader ": null
    },
    {
        "Doug Anthony": "doug anthony"
    },
    {
        " and Labor ministers ": null
    },
    {
        "Clyde Cameron": "clyde cameron"
    },
    {
        ", ": null
    },
    {
        "Doug McClelland": "doug mcclelland"
    },
    {
        ", and ": null
    },
    {
        "John Wheeldon": "john wheeldon"
    },
    {
        " – retrospectively expressed doubts as to whether Whitlam could have won if Gorton had returned to the prime ministership. ": null
    },
    {
        "Rupert Murdoch": "rupert murdoch"
    },
    {
        ", whose newspapers endorsed the Labor Party, stated in 42 that we would most certainly have supported the re-election of a Gorton Government in 42 And he would have won! . Hancock , p. 42     McMahon resigned as Liberal leader a few weeks after the 42 election. Gorton was one of five candidates who stood ": null
    },
    {
        "the resulting leadership ballot": "1972 liberal party of australia leadership election"
    },
    {
        ", but polled only the fourth-highest total as ": null
    },
    {
        "Billy Snedden": "billy snedden"
    },
    {
        " won a narrow victory over ": null
    },
    {
        "Nigel Bowen": "nigel bowen"
    },
    {
        ".  Snedden subsequently appointed him to the opposition frontbench as spokesman for urban and regional development, the environment, and conservation.  Soon after being sworn in as prime minister, Whitlam responded to a congratulatory letter from Gorton by promising to advance some of the causes which you were the first Australian Prime Minister to identify . Over the following years, several failed initiatives from Gortons prime ministership were passed into law by the ": null
    },
    {
        "Whitlam Government": "whitlam government"
    },
    {
        ". This included the establishment of the ": null
    },
    {
        "Australian Film, Television and Radio School": "australian film, television and radio school"
    },
    {
        " and the assertion of sovereignty over the territorial seabed and continental shelf. Hancock , pp. 42–42       In October 42 Gorton introduced a motion in the House of Representatives calling for the ": null
    },
    {
        "decriminalisation of homosexuality": "lgbt rights in australia"
    },
    {
        ", co-sponsored by Labors ": null
    },
    {
        "Moss Cass": "moss cass"
    },
    {
        ". It was modelled on the recommendations of the UKs ": null
    },
    {
        "Wolfenden report": "wolfenden report"
    },
    {
        ". While noting his personal objections to homosexuality, Gorton stated that most gay people hurt no one, harm no one and yet have this hanging over them . He dismissed arguments that decriminalisation would violate Gods law , noting that many religious leaders were in favour of a change, and stated that the existing law had led to ": null
    },
    {
        "bashing": "gay bashing"
    },
    {
        " , blackmail, and suicides. The motion passed by 42 votes, with all parties receiving a ": null
    },
    {
        "conscience vote": "conscience vote"
    },
    {
        ". However, it was of no legal effect as homosexuality law was the province of state and governments. Hancock , pp. 42–42 , Hansard, 42 October 42     Earlier in 42 Gorton had stated his public support of abortion on request, under certain conditions ; he was opposed to compulsory pregnancy . He nonetheless voted against ": null
    },
    {
        "David McKenzie": "david mckenzie"
    },
    {
        " and ": null
    },
    {
        "Tony Lamb": "tony lamb"
    },
    {
        "s private members bill to legalise abortion in the Australian Capital Territory, as he believed it did not provide clear enough guidelines for medical practitioners. He preferred the conditions of the ": null
    },
    {
        "Menhennitt ruling": "menhennitt ruling"
    },
    {
        ". Hancock , pp. 42–42 Gorton was also a supporter of no-fault divorce. During the debate over what became the  Family Law Act 42 , he ": null
    },
    {
        "crossed the floor": "cross the floor"
    },
    {
        " to oppose a Coalition amendment which he thought complicated the requirements for divorce through separation. Hancock , p. 42       Gorton was re-elected at the ": null
    },
    {
        "42 election": "1974 australian federal election"
    },
    {
        " with an increased majority. Hancock , p. 42 He was dropped from shadow cabinet after the election.  In November 42 following an unsuccessful attempt to install ": null
    },
    {
        "Malcolm Fraser": "malcolm fraser"
    },
    {
        " as Liberal leader, he condemned those involved and stated they had caused irreparable damage to the party. Hancock , p. 42 On 42 March 42 as leadership tensions continued to build, Gorton announced that he would not recontest his seat in parliament at the next election, citing his unwillingness to be a perpetual backbencher. He also stated: If Fraser got in, it would be a disaster. He is extreme right-wing. The Liberal Party cant be a right-leaning affair. Hancock , p. 42 When Fraser won ": null
    },
    {
        "a leadership spill": "liberal party of australia leadership spill, 1975"
    },
    {
        " on 42 March, Gorton reportedly stormed out of the meeting and slammed the door behind him.     On 42 May 42 Gorton announced his resignation from the Liberal Party and his intention to be an independent candidate for one of the new ": null
    },
    {
        "Australian Capital Territory": "australian capital territory"
    },
    {
        " Senate seats. He hoped to join ": null
    },
    {
        "Steele Hall": "steele hall"
    },
    {
        " on the ": null
    },
    {
        "crossbench": "crossbench"
    },
    {
        " and secure the ": null
    },
    {
        "balance of power": "balance of power"
    },
    {
        ". Opinion polling shortly after his announcement showed him winning 42 percent of the primary vote. His candidacy received endorsements from the small local branches of the ": null
    },
    {
        "Liberal Movement": "liberal movement"
    },
    {
        " and the ": null
    },
    {
        "Australia Party": "australia party"
    },
    {
        ". Hancock , p. 42 Gough Whitlam was dismissed as prime minister on 42 November, sparking ": null
    },
    {
        "an early election": "1975 australian federal election"
    },
    {
        " on 42 December. During ": null
    },
    {
        "the preceding constitutional crisis": "1975 australian constitutional crisis"
    },
    {
        ", Gorton had denounced Frasers actions in blocking ": null
    },
    {
        "supply": "supply"
    },
    {
        " in the Senate. Hancock , p. 42 In the election, he polled 42 percent of the ACT Senate vote running on a two-man ticket with ": null
    },
    {
        "Harold Hird": "harold hird"
    },
    {
        ". It was the second-highest percentage for an independent candidate nation-wide, after ": null
    },
    {
        "Brian Harradine": "brian harradine"
    },
    {
        "s 42 percent in Tasmania, but nowhere near enough to win election. He had campaigned mainly on local issues, which obscured his candidacy somewhat in an election that was a virtual referendum on the Whitlam Government. Hancock , p. 42          Gorton retired to ": null
    },
    {
        "Canberra": "canberra"
    },
    {
        ", where he largely kept out of the political limelight. However, in March 42 he congratulated ": null
    },
    {
        "Bob Hawke": "bob hawke"
    },
    {
        " for rolling that bastard Fraser at ": null
    },
    {
        "that years election": "1983 australian federal election"
    },
    {
        ".      In 42 Gorton was recruited to record a series of three-minute radio broadcasts on current affairs, titled Sir John Gortons viewpoints . He wrote and recorded around 42 segments over the following four years, which were syndicated and broadcast by over 42 radio stations around the country. His broadcasts covered a wide range of issues – he supported the decriminalisation of marijuana and prostitution, called on Australians to welcome ": null
    },
    {
        "Vietnamese boat people": "vietnamese boat people"
    },
    {
        ", opposed the creation of ": null
    },
    {
        "SBS": "special broadcasting service"
    },
    {
        ", denounced the cacophony known as modern music , opposed Aboriginal land rights, supported uranium mining, and opposed ": null
    },
    {
        "republicanism": "republicanism in australia"
    },
    {
        ". He frequently criticised the ": null
    },
    {
        "Fraser Government": "fraser government"
    },
    {
        ", but grudgingly admired Frasers ability to get his way as prime minister. Hancock , pp. 42–42     In the 42s, Gorton quietly rejoined the Liberal Party; ": null
    },
    {
        "John Hewson": "john hewson"
    },
    {
        " credited himself with returning Gorton to the fold. ABC TV Midday Report , Interview w. J Hewson, 42 May 42 In 42 Gorton was invited to open the Liberal Partys campaign headquarters for the ": null
    },
    {
        "42 election": "1993 australian federal election"
    },
    {
        ". He endorsed Hewsons ": null
    },
    {
        "Fightback!": "fightback!"
    },
    {
        " package.  In his old age he was rehabilitated by the Liberals; his 42th birthday party was attended by Prime Minister ": null
    },
    {
        "John Howard": "john howard"
    },
    {
        " who said at the event: He was a person who above everything else was first, second and last an Australian. Although he was back within Liberal circles, he never forgave Fraser; as late as 42 he told his biographer Ian Hancock that he still could not tolerate being in the same room as Fraser. Cameron Stewart, Buried alive, Weekend Australian, 42–42 March 42     Gorton died at Sydneys ": null
    },
    {
        "St Vincents Hospital": "st vincents hospital, sydney"
    },
    {
        " at the age of 42 in May 42  A ": null
    },
    {
        "State funeral": "state funeral"
    },
    {
        "  and memorial service was held on 42 May at ": null
    },
    {
        "St Andrews Cathedral": "st andrews cathedral, sydney"
    },
    {
        " where extremely critical remarks of Fraser, who was in attendance with wife ": null
    },
    {
        "Tamie": "tamie fraser"
    },
    {
        ", were delivered during the eulogy by Gortons former Attorney-General ": null
    },
    {
        "Tom Hughes": "tom hughes"
    },
    {
        ". Current and former Prime Ministers Howard, ": null
    },
    {
        "Gough Whitlam": "gough whitlam"
    },
    {
        " and ": null
    },
    {
        "Bob Hawke": "bob hawke"
    },
    {
        " were also in attendance.  Gorton was cremated after a private service and his ashes interred within the Prime Ministers Garden at ": null
    },
    {
        "Melbourne General Cemetery": "melbourne general cemetery"
    },
    {
        ".            During a holiday in Spain while still an undergraduate, Gorton met ": null
    },
    {
        "Bettina Brown": "bettina gorton"
    },
    {
        " of ": null
    },
    {
        "Bangor, Maine": "bangor, maine"
    },
    {
        ", United States. She was a language student at the ": null
    },
    {
        "Sorbonne": "sorbonne"
    },
    {
        ". This meeting came about through Gortons friend from Oxford, Arthur Brown, who was Bettinas brother. In 42 Gorton and Bettina Brown were married in Oxford. After his studies were finished, they settled in Australia, taking over his fathers orchard, Mystic Park , at ": null
    },
    {
        "Lake Kangaroo": "lake kangaroo, victoria"
    },
    {
        " near ": null
    },
    {
        "Kerang": "kerang"
    },
    {
        ", Victoria. They had three children: Joanna, Michael and Robin. Gortons first wife died of cancer in 42 In 42 he remarried to Nancy Home a long-time acquaintance.        Gorton was a nominal Christian at least in the early part of his life, but was not a churchgoer. Some sources have identified him as agnostic or even atheist. He attended Anglican schools, and was influenced by the ": null
    },
    {
        "Christian socialist": "christian socialist"
    },
    {
        " views of ": null
    },
    {
        "James Ralph Darling": "james ralph darling"
    },
    {
        ", his headmaster at ": null
    },
    {
        "Geelong Grammar": "geelong grammar"
    },
    {
        ". Williams, Roy . In God They Trust?, Bible Society Australia, p. 42 In a 42 speech, Gorton said that the story of Christianity is the most tremendous in the history of the world . Williams: 42 However, in the lead-up to the ": null
    },
    {
        "42 referendum": "1999 australian republic referendum"
    },
    {
        " he publicly opposed mentioning God in the preamble. According to his biographer Ian Hancock: Gorton may not have been a believing, let alone a practising, Christian, and when he spoke of religion of the soul he did not have a particular faith in mind. Rather, his religion was founded upon the injunction in the ": null
    },
    {
        "Book of Deuteronomy": "book of deuteronomy"
    },
    {
        ": Man doth not live by bread only. Hancock: 42          Gorton was appointed a ": null
    },
    {
        "Privy Counsellor": "privy council of the united kingdom"
    },
    {
        " in 42 a ": null
    },
    {
        "Companion of Honour": "order of the companions of honour"
    },
    {
        " in 42  – Companion of Honour a Knight Grand Cross of the ": null
    },
    {
        "Order of St Michael and St George": "order of st michael and st george"
    },
    {
        " in 42  – Knight Grand Cross of the Order of St Michael and St George and a Companion of the ": null
    },
    {
        "Order of Australia": "order of australia"
    },
    {
        " in 42  – Companion of the Order of Australia He was awarded the ": null
    },
    {
        "Centenary Medal": "centenary medal"
    },
    {
        " in 42 ": null
    }
]