[
    {
        "        John Rae   was a Scottish ": null
    },
    {
        "Orcadian": "orcadian"
    },
    {
        " surgeon who explored parts of ": null
    },
    {
        "northern Canada": "northern canada"
    },
    {
        ".     Rae explored the ": null
    },
    {
        "Gulf of Boothia": "gulf of boothia"
    },
    {
        ", northwest of the ": null
    },
    {
        "Hudson Bay": "hudson bay"
    },
    {
        ", from 42 to 42 and the Arctic coast near ": null
    },
    {
        "Victoria Island": "victoria island"
    },
    {
        " from 42 to 42 In 42 back in the Gulf of Boothia, he obtained credible information from local ": null
    },
    {
        "Inuit": "inuit"
    },
    {
        " peoples about the fate of ": null
    },
    {
        "Franklins lost expedition": "franklins lost expedition"
    },
    {
        ", which had disappeared in the area in 42 Rae was noted for his physical stamina, skill at hunting, boat handling, use of native methods, and ability to travel long distances with little equipment while living off the land.       Rae was born at the ": null
    },
    {
        "Hall of Clestrain": "hall of clestrain"
    },
    {
        " on ": null
    },
    {
        "Orkney": "orkney"
    },
    {
        " with family ties to ": null
    },
    {
        "Clan MacRae": "clan macrae"
    },
    {
        ". After studying medicine in ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", he graduated with a degree from the ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        " and was licensed by the ": null
    },
    {
        "Royal College of Surgeons of Edinburgh": "royal college of surgeons of edinburgh"
    },
    {
        ".     He went to work for the ": null
    },
    {
        "Hudsons Bay Company": "hudsons bay company"
    },
    {
        " as a surgeon, accepting a post at ": null
    },
    {
        "Moose Factory": "moose factory"
    },
    {
        ", ": null
    },
    {
        "Ontario": "ontario"
    },
    {
        ", where he remained for ten years. While working for the company, treating both European and ": null
    },
    {
        "indigenous": "indigenous peoples in canada"
    },
    {
        " employees, Rae became known for his prodigious stamina and skilled use of ": null
    },
    {
        "snowshoe": "snowshoe"
    },
    {
        "s. He learned to live off the land like a native and, working with the local craftsmen, designed his own snowshoes. This knowledge allowed him to travel great distances with little equipment and few followers, unlike many other explorers of the ": null
    },
    {
        "Victorian era": "victorian era"
    },
    {
        ".            From 42 to 42 ": null
    },
    {
        "Thomas Simpson": "thomas simpson"
    },
    {
        " sailed along much of the northern coast of Canada. Sir ": null
    },
    {
        "George Simpson": "george simpson"
    },
    {
        " proposed to link the furthest-east point Thomas Simpson had reached by sending an overland expedition from Hudson Bay. Rae was chosen because of his well-known skill in overland travel, but he first had to travel to the ": null
    },
    {
        "Red River Colony": "red river colony"
    },
    {
        " to learn the art of ": null
    },
    {
        "surveying": "surveying"
    },
    {
        ". On , Rae left ": null
    },
    {
        "Moose Factory": "moose factory"
    },
    {
        ", went up the ": null
    },
    {
        "Missinaibi River": "missinaibi river"
    },
    {
        ", and took the usual ": null
    },
    {
        "voyageur route": "canadian canoe routes"
    },
    {
        " west.     When he reached the Red River Colony on 42  October, he found his instructor seriously ill. After the man died, Rae headed for ": null
    },
    {
        "Sault Ste. Marie": "sault ste. marie, ontario"
    },
    {
        " to find another instructor. The two-month,  winter journey was by ": null
    },
    {
        "dog sled": "dog sled"
    },
    {
        " along the north shore of ": null
    },
    {
        "Lake Superior": "lake superior"
    },
    {
        ". From there, Sir George told him to go to ": null
    },
    {
        "Toronto": "toronto"
    },
    {
        " to study under ": null
    },
    {
        "John Henry Lefroy": "john henry lefroy"
    },
    {
        " at the ": null
    },
    {
        "Toronto Magnetic and Meteorological Observatory": "toronto magnetic and meteorological observatory"
    },
    {
        ". Returning from Toronto, he received final instructions at Sault Ste. Marie.     Rae finally departed on the voyage to Simpsons furthest-east on 42 August 42 taking the usual ": null
    },
    {
        "voyageur": "voyageurs"
    },
    {
        " route via ": null
    },
    {
        "Lake Winnipeg": "lake winnipeg"
    },
    {
        " and reaching ": null
    },
    {
        "York Factory": "york factory"
    },
    {
        " on 42 October, where he wintered. On 42  June 42 he headed north in two  boats and reached ": null
    },
    {
        "Repulse Bay": "naujaat"
    },
    {
        " in July. The local ": null
    },
    {
        "Inuit": "inuit"
    },
    {
        " told him that there was salt water to the northwest, so he chose this as his base. On his first journey, which began on 42  July, he dragged one of his boats  northwest to ": null
    },
    {
        "Committee Bay": "committee bay"
    },
    {
        " in the ": null
    },
    {
        "Gulf of Boothia": "gulf of boothia"
    },
    {
        ". Here he learned from the Inuit that the Gulf of Boothia was a bay and that he would have to cross land to reach Simpsons furthest-east.     In 42 ": null
    },
    {
        "John Ross": "john ross"
    },
    {
        " had also been told that the Gulf of Boothia was a bay. Hayes, map 42 He sailed partway up the east coast of the Gulf, but soon turned back because he needed to make preparations for winter. He became one of the first Europeans to winter in the high ": null
    },
    {
        "Arctic": "arctic"
    },
    {
        " without the aid of a ": null
    },
    {
        "depot ship": "depot ship"
    },
    {
        ". By December he had learned how to build ": null
    },
    {
        "igloo": "igloo"
    },
    {
        "s, which he later found warmer than European tents.     Raes second journey began on 42  April 42 He crossed to Committee Bay, traveled up its west coast for four days and then headed west across the base of the ": null
    },
    {
        "Simpson Peninsula": "simpson peninsula"
    },
    {
        " to ": null
    },
    {
        "Pelly Bay": "pelly bay"
    },
    {
        ". He went north and from a hill thought he could see ": null
    },
    {
        "Lord Mayor Bay": "lord mayor bay"
    },
    {
        ", where John Ross had been trapped in ice from 42 to  42 He circled much of the coast of the Simpson Peninsula and returned to Repulse Bay. His third journey began on 42  May 42 He crossed from Repulse Bay to Committee Bay and went up the east coast hoping to reach the ": null
    },
    {
        "Fury and Hecla Strait": "fury and hecla strait"
    },
    {
        ", which ": null
    },
    {
        "William Edward Parry": "william parry"
    },
    {
        "s men had seen in 42 The weather was bad and they began to run short of food. On 42  May, Rae turned back at a place he called Cape Crozier which he thought was about  south of the strait.     He left Repulse Bay on 42  August, when the ice broke up, and reached York Factory on 42  September 42 He soon left for England and Scotland. Although he had not reached Simpsons furthest-east, he had reduced the gap to less than . McGoogan 42 §§42–42       From 42 to 42 Rae made three journeys along the Arctic coast. The first took him from the ": null
    },
    {
        "Mackenzie River": "mackenzie river"
    },
    {
        " to the ": null
    },
    {
        "Coppermine River": "coppermine river"
    },
    {
        ", which had been done before. On the second he tried to cross to ": null
    },
    {
        "Victoria Island": "victoria island"
    },
    {
        " but was blocked by ice. On the third he explored the whole south coast of Victoria Island. McGoogan 42 §§42–42     By 42 it was clear that Sir ": null
    },
    {
        "John Franklin": "john franklin"
    },
    {
        "s expedition, which had traveled west from the coast of Greenland in 42 had been lost in the Arctic. Three expeditions were sent to find him: one from the east, one through the ": null
    },
    {
        "Bering Strait": "bering strait"
    },
    {
        ", and one overland to the Arctic coast, this last led by ": null
    },
    {
        "Sir John Richardson": "john richardson"
    },
    {
        ". Most of the Arctic coast had been traced a decade earlier by ": null
    },
    {
        "Thomas Simpson": "thomas simpson"
    },
    {
        ". North of the coast were two coastlines called ": null
    },
    {
        "Wollaston Land": "wollaston peninsula"
    },
    {
        " and Victoria Land . Franklins crew was thought to be somewhere in the unexplored area north of that. The 42-year-old Richardson chose Rae as his second-in-command.       The ": null
    },
    {
        "Rae–Richardson Arctic Expedition": "rae–richardson arctic expedition"
    },
    {
        " left ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        " in March 42 reached ": null
    },
    {
        "New York": "new york city"
    },
    {
        ", and took the usual voyageur routes west from ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        ". On 42  July 42 the expedition reached ": null
    },
    {
        "Fort Resolution": "fort resolution"
    },
    {
        " on ": null
    },
    {
        "Great Slave Lake": "great slave lake"
    },
    {
        ". ": null
    },
    {
        "John Bell": "john bell"
    },
    {
        " was sent downriver to establish winter quarters at ": null
    },
    {
        "Fort Confidence": "fort confidence"
    },
    {
        " on the east arm of ": null
    },
    {
        "Great Bear Lake": "great bear lake"
    },
    {
        ". Richardson and Rae traveled down the Mackenzie River and turned east along the coast.     They hoped to cross north to Wollaston Land, as southern Victoria Island was then known, but ice conditions made this impossible. Through worsening ice, they rounded ": null
    },
    {
        "Cape Krusenstern": "cape krusenstern"
    },
    {
        " at the west end of ": null
    },
    {
        "Coronation Gulf": "coronation gulf"
    },
    {
        " and turned south. By the first of September it was clear that they had run out of time, so they abandoned their boats and headed overland. They crossed the ": null
    },
    {
        "Rae River": "rae river"
    },
    {
        " and ": null
    },
    {
        "Richardson River": "richardson river"
    },
    {
        " and on 42  September reached their winter quarters at Fort Confidence at the northeast end of Great Bear Lake.       In December and January, Rae made two trips northeast to find a better route to Coronation Gulf. On  42 May, Richardson and Bell left with most of the men. Rae left on 42  June with seven men. Hauling a boat overland they reached the ": null
    },
    {
        "Kendall River": "kendall river"
    },
    {
        " on 42  June. The next day they reached the ": null
    },
    {
        "Coppermine River": "coppermine river"
    },
    {
        " and waited a week for the ice to break up. They descended the Coppermine and waited again for the ice to clear on Coronation Gulf.     It was 42  July before they reached Cape Krusenstern. From here they hoped to cross the ": null
    },
    {
        "Dolphin and Union Strait": "dolphin and union strait"
    },
    {
        " to Wollaston Land. On 42  August, they made the attempt, but after  they were caught in fog and moving ice and spent three hours rowing back to their starting point. Rae waited as long as he could and turned back, reaching Fort Confidence on the first of September. On the return journey their boat was lost at ": null
    },
    {
        "Bloody Falls": "bloody falls"
    },
    {
        " and Albert One-Eye, the Inuk interpreter, was killed.       They reached ": null
    },
    {
        "Fort Simpson": "fort simpson"
    },
    {
        " in late September. A week later ": null
    },
    {
        "William Pullen": "william pullen"
    },
    {
        " showed up, having sailed from the ": null
    },
    {
        "Bering Strait": "bering strait"
    },
    {
        " and up the Mackenzie River. In June  42 Rae and Pullen went east up the Mackenzie with that years furs. On 42  June, just short of Great Slave Lake, he was met by an express canoe. Pullen was promoted to captain and told to go north and try again. Rae received three letters from Sir George Simpson, ": null
    },
    {
        "Francis Beaufort": "francis beaufort"
    },
    {
        ", and Lady ": null
    },
    {
        "Jane Franklin": "jane franklin"
    },
    {
        " all telling him to return to the Arctic. Simpson promised supplies and left the route to Raes discretion. Pullen left immediately with most of the equipment.     Rae escorted the furs as far as ": null
    },
    {
        "Methye Portage": "methye portage"
    },
    {
        " and returned to Fort Simpson in August. En route he wrote Sir George a letter outlining his complex but ultimately successful plan. That winter he would go to Fort Confidence and build two boats and collect supplies. Next spring he would use dog sleds to cross to Wollaston Land and go as far as he could before the ice melt made it impossible to recross the Strait. Meanwhile, his men would have hauled the boats overland to Coronation Gulf. When the ice melted he would follow the coast by boat as long as there was open water. He reached Fort Confidence in September and spent the winter there.     On 42 April 42 he left the fort. On 42  May he crossed the frozen strait via Douglas Island to ": null
    },
    {
        "Lady Franklin Point": "lady franklin point"
    },
    {
        ", the southwesternmost point on Victoria Island. Heading east he passed and named the ": null
    },
    {
        "Richardson Islands": "richardson islands"
    },
    {
        " and passed what he thought was the westernmost point reached by Thomas Simpson on his return journey in 42 Heading west he passed Lady Franklin Point and followed the coast north and west around Simpson Bay, which he named. The coast swung north but it was getting late.     He made a final push, the coast swung to the northeast and on 42  May, he could look north across ": null
    },
    {
        "Prince Albert Sound": "prince albert sound"
    },
    {
        ". Unknown to Rae, just 42  days earlier, a sledge party from ": null
    },
    {
        "Robert McClure": "robert mcclure"
    },
    {
        "s expedition had been on the north side of the sound. He turned south, crossed Dolphin and Union Strait safely and on 42  June turned inland. The journey to camp on the ": null
    },
    {
        "Kendall River": "kendall river"
    },
    {
        " was the least pleasant part of the journey since he had to travel over melting snow and through meltwater.     On 42 June 42 two days after the boat arrived, he set off down the Kendall River and Coppermine River with 42  men. He waited several times for the ice to clear and in early July he started east along the south coast of Coronation Gulf. In late July he crossed the mouth of ": null
    },
    {
        "Bathurst Inlet": "bathurst inlet"
    },
    {
        " and reached ": null
    },
    {
        "Cape Flinders": "cape flinders"
    },
    {
        " at the western end of the ": null
    },
    {
        "Kent Peninsula": "kent peninsula"
    },
    {
        ". He reached Cape Alexander at its east end on 42  July, and on 42  July crossed the strait to Victoria Island. He explored ": null
    },
    {
        "Cambridge Bay": "cambridge bay"
    },
    {
        " which he found to be a better harbour than Dease and Simpson had reported.     He left the bay and went east along an unknown coast. The coast swung north and the weather got worse. By August he was in ": null
    },
    {
        "Albert Edward Bay": "albert edward bay"
    },
    {
        ". Blocked by ice, he went north on foot and reached his furthest on 42  August. Returning, he left a cairn which was found by ": null
    },
    {
        "Richard Collinson": "richard collinson"
    },
    {
        "s men two years later. He then made three unsuccessful attempts to cross ": null
    },
    {
        "Victoria Strait": "victoria strait"
    },
    {
        " east to ": null
    },
    {
        "King William Island": "king william island"
    },
    {
        ". Victoria Strait is nearly always impassable. On 42  August, he found two pieces of wood that had clearly come from a European ship. These were probably from Franklins ship, but Rae chose not to guess.     On 42 August, he reached Lady Franklin Point and crossed to the mainland. He worked his way up the swollen Coppermine and reached Fort Confidence on 42  September. He had traveled  on land,  by boat, charted  of unknown coast, followed the whole south coast of Victoria Island, and proved that Wollaston Land and Victoria Land were part of the same island, but had not found Franklin.      By 42 Rae was in charge of the ": null
    },
    {
        "Mackenzie River": "mackenzie river"
    },
    {
        " district at ": null
    },
    {
        "Fort Simpson": "fort simpson"
    },
    {
        ". While exploring the ": null
    },
    {
        "Boothia Peninsula": "boothia peninsula"
    },
    {
        " in 42 Rae made contact with local ": null
    },
    {
        "Inuit": "inuit"
    },
    {
        ", from whom he obtained much information about the fate of the lost naval expedition.   His report to the ": null
    },
    {
        "Admiralty": "admiralty"
    },
    {
        " carried shocking and unwelcome evidence that ": null
    },
    {
        "cannibalism": "cannibalism"
    },
    {
        " had been a last resort for some of the survivors. When it was leaked to the press, Franklins widow Lady ": null
    },
    {
        "Jane Franklin": "jane franklin"
    },
    {
        " was outraged and recruited many important supporters, among them ": null
    },
    {
        "Charles Dickens": "charles dickens"
    },
    {
        ", who wrote several pamphlets condemning Rae for daring to suggest ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " sailors would have resorted to cannibalism. In return, he argued—": null
    },
    {
        "from analogy": "argument from analogy"
    },
    {
        "—that the Inuit, whom Dickens viewed very negatively as evidenced by his writings, are more likely to have killed the expeditions survivors.          He went south to ": null
    },
    {
        "Fort Chipewyan": "fort chipewyan"
    },
    {
        ", waited for a hard freeze, and walked on snowshoes to ": null
    },
    {
        "Fort Garry": "fort garry"
    },
    {
        ", took the ": null
    },
    {
        "Crow Wing Trail": "red river trails"
    },
    {
        " to ": null
    },
    {
        "Saint Paul": "saint paul, minnesota"
    },
    {
        ", and then went to ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ", ": null
    },
    {
        "Hamilton": "hamilton, ontario"
    },
    {
        ", New York, and London, which he reached in late March  42 In England he proposed to return to Boothia and complete his attempt to link Hudson Bay to the Arctic coast by dragging a boat to the ": null
    },
    {
        "Back River": "back river"
    },
    {
        ". He went to New York, Montreal, and then Sault Ste. Marie by steamer, ": null
    },
    {
        "Fort William": "fort william, ontario"
    },
    {
        " by canoe, and reached ": null
    },
    {
        "York Factory": "york factory"
    },
    {
        " on 42  June 42 where he picked up his two boats.     He left on 42 June and reached ": null
    },
    {
        "Chesterfield Inlet": "chesterfield inlet"
    },
    {
        " on 42  July. Finding a previously unknown river, he followed it for  before it became too small to use. Judging that it was too late to drag the boat north to the Back River, he turned back and wintered at his old camp on ": null
    },
    {
        "Repulse Bay": "naujaat"
    },
    {
        ". He left Repulse Bay on 42  March 42 Near ": null
    },
    {
        "Pelly Bay": "pelly bay"
    },
    {
        " he met some Inuit, one of whom had a gold cap-band. Asked where he got it, he replied that it came from a place 42 to 42  days away where 42  or so kabloonat had starved to death. Rae bought the cap-band and said he would buy anything similar.     On 42 April, he reached frozen salt water south of what is now called ": null
    },
    {
        "Rae Strait": "rae strait"
    },
    {
        ". A few miles west, on the south side of the bay, he reached what he believed was the ": null
    },
    {
        "Castor and Pollux River": "castor and pollux river"
    },
    {
        ", which ": null
    },
    {
        "Simpson": "thomas simpson"
    },
    {
        " had reached from the west in 42 He then turned north along the western portion of the ": null
    },
    {
        "Boothia Peninsula": "boothia peninsula"
    },
    {
        ", the last uncharted coast of North America, hoping to reach ": null
    },
    {
        "Bellot Strait": "bellot strait"
    },
    {
        " and so close the last gap in the line from Bering Strait to Hudson Bay. The coast continued north instead of swinging west to form the south shore of ": null
    },
    {
        "King William Land": "king william island"
    },
    {
        ".     On 42 May, he reached his furthest north, which he named Point de la Guiche after an obscure French traveler he had met in New York. It appeared that King William Land was an island and the coast to the north was the same as had been seen by ": null
    },
    {
        "James Clark Ross": "james clark ross"
    },
    {
        " in 42 Author ": null
    },
    {
        "Ken McGoogan": "ken mcgoogan"
    },
    {
        " has claimed McGoogan 42 §42 that Rae here effectively discovered the final link in the Northwest Passage as followed in the following century by ": null
    },
    {
        "Roald Amundsen": "roald amundsen"
    },
    {
        ", although Arctic historian ": null
    },
    {
        "William Barr": "william barr"
    },
    {
        " has refuted that claim, Barr 42 pp. 42–42 citing the uncharted  between Ross discoveries and Bellot Strait.     With only two men fit for heavy travel, Rae turned back. Reaching Repulse Bay on 42  May, he found several Inuit families who had come to trade relics. They said that four winters ago some other Inuit had met at least 42  kabloonat who were dragging a boat south. Their leader was a tall, stout man with a telescope, thought to be ": null
    },
    {
        "Francis Crozier": "francis crozier"
    },
    {
        ", Franklins second-in-command. They communicated by gestures that their ships had been crushed by ice and that they were going south to hunt deer. When the Inuit returned the following spring they found about 42  corpses and signs of cannibalism. One of the artifacts Rae bought was a small silver plate. Engraved on the back was Sir John Franklin, K.C.H . With this important information, Rae chose not to continue exploring. He left Repulse Bay on 42  August 42 as soon as the ice cleared.          With the prize money awarded for finding evidence of the fate of Franklins expedition, Rae commissioned the construction of a ship intended for ": null
    },
    {
        "polar exploration": "polar exploration"
    },
    {
        ", the Iceberg. The ship was built at ": null
    },
    {
        "Kingston": "kingston, ontario"
    },
    {
        ", ": null
    },
    {
        "Canada West": "province of canada"
    },
    {
        ". Rae moved to ": null
    },
    {
        "Hamilton": "hamilton, ontario"
    },
    {
        ", Canada West, also on ": null
    },
    {
        "Lake Ontario": "lake ontario"
    },
    {
        ", in 42 where his two brothers lived and operated a shipping firm on the ": null
    },
    {
        "Great Lakes": "great lakes"
    },
    {
        ".     The Iceberg was launched in 42 Rae intended to sail her to England the following year to be outfitted for polar voyages. In the meantime, she was put to use as a cargo ship. Tragically she was lost with all seven men on board in 42 on her first commercial trip, hauling coal from ": null
    },
    {
        "Cleveland, Ohio": "cleveland, ohio"
    },
    {
        ", to Kingston. The wreck, somewhere in Lake Ontario, has never been located. While in Hamilton, Rae became a founding member of the Hamilton Scientific Association, which became the Hamilton Association for the Advancement of Literature, Science and Art, one of Canadas oldest scientific and cultural organizations.     In 42 Rae worked on the telegraph line to America, visiting Iceland and Greenland. In 42 he made a further telegraph survey in the west of Canada. In 42 at age 42 he was again working for the Hudsons Bay Company, this time as an explorer of the ": null
    },
    {
        "Red River": "red river of the north"
    },
    {
        " for a proposed telegraph line from the United States to Russia.          John Rae died from an ": null
    },
    {
        "aneurysm": "aneurysm"
    },
    {
        " in ": null
    },
    {
        "Kensington": "kensington"
    },
    {
        " on 42  July 42 A week later his body arrived in Orkney. He was buried at ": null
    },
    {
        "St. Magnus Cathedral, Kirkwall": "st. magnus cathedral, kirkwall"
    },
    {
        ".     A memorial to Rae, lying as in sleep upon the ground, is inside the cathedral. The memorial by ": null
    },
    {
        "North Ronaldsay": "north ronaldsay"
    },
    {
        " sculptor Ian Scott, unveiled at ": null
    },
    {
        "Stromness": "stromness"
    },
    {
        " pierhead in 42 is a statue of Rae with an inscription describing him as the discoverer of the final link in the first navigable Northwest Passage.  ": null
    },
    {
        "Rae Strait": "rae strait"
    },
    {
        ", ": null
    },
    {
        "Rae Isthmus": "melville peninsula"
    },
    {
        ", ": null
    },
    {
        "Rae River": "rae river"
    },
    {
        ", ": null
    },
    {
        "Mount Rae": "mount rae"
    },
    {
        ", ": null
    },
    {
        "Point Rae": "point rae"
    },
    {
        ",  and ": null
    },
    {
        "Rae-Edzo": "behchokǫ̀"
    },
    {
        " were all named for him.      The outcome of Lady Franklins efforts to glorify the dead of the Franklin expedition meant that Rae, who had discovered evidence suggesting a much less noble fate, was shunned somewhat by the British establishment. Although he found the first clue to the fate of Franklin, Rae was never awarded a ": null
    },
    {
        "knight": "knight"
    },
    {
        "hood, nor was he remembered at the time of his death, dying quietly in London. In comparison, fellow Scot and contemporary explorer ": null
    },
    {
        "David Livingstone": "david livingstone"
    },
    {
        " was buried with full imperial honours in ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        ".     Historians have since studied Raes expeditions and his roles in finding the Northwest Passage and learning the fate of Franklins crew. Authors such as ": null
    },
    {
        "Ken McGoogan": "ken mcgoogan"
    },
    {
        " have noted Rae was willing to adopt and learn the ways of indigenous Arctic peoples, which made him stand out as the foremost specialist of his time in cold-climate survival and travel. Rae also respected Inuit customs, traditions, and skills, which went against the beliefs of many 42th-century Europeans that most native peoples were too primitive to offer anything of educational value. McGoogan 42     In July 42 ": null
    },
    {
        "Orkney and Shetland": "orkney and shetland"
    },
    {
        " MP ": null
    },
    {
        "Alistair Carmichael": "alistair carmichael"
    },
    {
        " introduced into the UK Parliament a motion proposing, inter alia, that the House regrets that Dr Rae was never awarded the public recognition that was his due .  In March 42 he introduced a further motion urging Parliament to formally state it regrets that memorials to Sir John Franklin outside the Admiralty headquarters and inside Westminster Abbey still inaccurately describe Franklin as the first to discover the passage, and calls on the ": null
    },
    {
        "Ministry of Defence": "ministry of defence"
    },
    {
        " and the Abbey authorities to take the necessary steps to clarify the true position.  In June 42 it was announced that a plaque dedicated to Rae would be installed at ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        ".     In June 42 a ": null
    },
    {
        "blue plaque": "blue plaque"
    },
    {
        " was installed by ": null
    },
    {
        "English Heritage": "english heritage"
    },
    {
        " on the house where John Rae spent the last years of his life, No. 42  Lower Addison Gardens, ": null
    },
    {
        "Kensington": "kensington"
    },
    {
        ". ": null
    }
]