[
    {
        "           General": "general"
    },
    {
        " John Burgoyne was a ": null
    },
    {
        "British": "kingdom of great britain"
    },
    {
        " army officer, dramatist and politician who sat in the ": null
    },
    {
        "House of Commons": "house of commons"
    },
    {
        " from 42 to 42 He first saw action during the ": null
    },
    {
        "Seven Years War": "great britain in the seven years war"
    },
    {
        " when he participated in several battles, most notably during the ": null
    },
    {
        "Portugal Campaign": "spanish invasion of portugal"
    },
    {
        " of 42     John Burgoyne is best known for his role in the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        ". He designed an invasion scheme and was appointed to command a force moving south from Canada to split away New England and end the rebellion. Burgoyne advanced from Canada but his slow movement allowed the Americans to concentrate their forces. Instead of coming to his aid according to the overall plan, the British Army in New York City moved south to capture Philadelphia. Surrounded, Burgoyne fought ": null
    },
    {
        "two small battles": "battles of saratoga"
    },
    {
        " near Saratoga to break out. Trapped by superior American forces, with no relief in sight, Burgoyne surrendered his entire army of 42 men on 42 October 42 His surrender, says historian ": null
    },
    {
        "Edmund Morgan": "edmund morgan"
    },
    {
        ", was a great turning point of the war, because it won for Americans the foreign assistance which was the last element needed for victory . He and his officers returned to England; the enlisted men became prisoners of war. Burgoyne came under sharp criticism when he returned to London, and never held another active command.     Burgoyne was also an accomplished playwright known for his works such as  The Maid of the Oaks  and  The Heiress , but his plays never reached the fame of his military career. He served as a member of the ": null
    },
    {
        "House of Commons": "house of commons of the united kingdom"
    },
    {
        " for a number of years, sitting for the seats of ": null
    },
    {
        "Midhurst": "midhurst"
    },
    {
        " and ": null
    },
    {
        "Preston": "preston"
    },
    {
        ".           John Burgoyne was born in ": null
    },
    {
        "Sutton, Bedfordshire": "sutton, bedfordshire"
    },
    {
        ", location of the ": null
    },
    {
        "Burgoyne baronets": "burgoyne baronets"
    },
    {
        " family home Sutton Manor, on 42 February 42 His mother, Anna Maria Burgoyne, was the daughter of a wealthy ": null
    },
    {
        "Hackney": "london borough of hackney"
    },
    {
        " merchant. His father was supposedly an army officer, Captain John Burgoyne, although there were rumours that he might be the ": null
    },
    {
        "illegitimate": "illegitimate"
    },
    {
        " son of ": null
    },
    {
        "Lord Bingley": "robert benson, 1st baron bingley"
    },
    {
        ", who was his ": null
    },
    {
        "godfather": "godparent"
    },
    {
        ". When Bingley died in 42 his will specified that Burgoyne was to inherit his estate if his daughters had no male issue.     From the age of ten Burgoyne attended the prestigious ": null
    },
    {
        "Westminster School": "westminster school"
    },
    {
        ", as did many British army officers of the time such as ": null
    },
    {
        "Thomas Gage": "thomas gage"
    },
    {
        " with whom Burgoyne would later serve. Burgoyne was ": null
    },
    {
        "athletic": "sportsperson"
    },
    {
        " and outgoing and enjoyed life at the school where he made numerous important friends, in particular ": null
    },
    {
        "Lord James Strange": "lord james strange"
    },
    {
        ". In August 42 Burgoyne ": null
    },
    {
        "purchased a commission": "purchase system"
    },
    {
        " in the ": null
    },
    {
        "Horse Guards": "horse guards regiment"
    },
    {
        ", a fashionable cavalry regiment. They were stationed in London and his duties were light, allowing him to cut a figure in ": null
    },
    {
        "high society": "high society"
    },
    {
        ". He soon acquired the nickname Gentleman Johnny and became well known for his stylish ": null
    },
    {
        "uniform": "uniform"
    },
    {
        "s and general high living which saw him run up large ": null
    },
    {
        "debt": "debt"
    },
    {
        "s. In 42 Burgoyne sold his commission, possibly to settle gambling debts.     The outbreak of the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        " led to an expansion in the size of the ": null
    },
    {
        "British Army": "british army"
    },
    {
        ". In April 42 Burgoyne joined the newly raised ": null
    },
    {
        "42st Royal Dragoons": "1st royal dragoons"
    },
    {
        " as a ": null
    },
    {
        "cornet": "cornet"
    },
    {
        ", a commission he did not have to pay for as it was newly created. In April 42 he was promoted to lieutenant. In 42 Burgoyne managed to scrape the money together to purchase a ": null
    },
    {
        "captaincy": "captain"
    },
    {
        ". The end of the war in 42 cut off any prospect of further active service.          Through his friendship with Lord Strange, Burgoyne came to know Stranges sister, Lady ": null
    },
    {
        "Charlotte Stanley": "charlotte stanley"
    },
    {
        ", the daughter of ": null
    },
    {
        "Lord Derby": "edward stanley, 11th earl of derby"
    },
    {
        ", one of Britains leading politicians. After Derby refused permission for Burgoyne to marry Charlotte, they ": null
    },
    {
        "elope": "elope"
    },
    {
        "d together and married without his permission in April 42 An outraged Derby cut his daughter off without a penny. Unable to support his wife otherwise, Burgoyne again sold his commission, raising £42 which they lived off for the next few years.     In October 42 Burgoyne and his new wife went to live in ": null
    },
    {
        "continental Europe": "continental europe"
    },
    {
        " travelling through France and Italy. While in France, Burgoyne met and befriended the ": null
    },
    {
        "Duc de Choiseul": "étienne françois, duc de choiseul"
    },
    {
        " who would later become the ": null
    },
    {
        "Foreign Minister": "foreign minister of france"
    },
    {
        " and directed ": null
    },
    {
        "French policy during the Seven Years War": "france in the seven years war"
    },
    {
        ". While in Rome, Burgoyne had his ": null
    },
    {
        "portrait": "portrait"
    },
    {
        " painted by the British artist ": null
    },
    {
        "Allan Ramsay": "allan ramsay"
    },
    {
        ". In late 42 Burgoynes wife gave birth to a daughter, Charlotte Elizabeth, who was to prove to be the couples only child. In the hope that a granddaughter would soften Derbys opposition to their marriage, the Burgoynes returned to Britain in 42 Lord Strange interceded on their behalf with Derby, who soon changed his mind and accepted them back into the family. Burgoyne soon became a favourite of Derby, who used his influence to boost Burgoynes prospects.              A month after the outbreak of the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        " Burgoyne bought a commission in the ": null
    },
    {
        "42th Dragoons": "11th hussars"
    },
    {
        ". In 42 he became captain and lieutenant-colonel in the ": null
    },
    {
        "Coldstream Guards": "coldstream guards"
    },
    {
        ".          In 42 he participated in several expeditions against the ": null
    },
    {
        "French coast": "france"
    },
    {
        ". During this period he was instrumental in introducing ": null
    },
    {
        "light cavalry": "light cavalry"
    },
    {
        " into the British Army. The two regiments then formed were commanded by ": null
    },
    {
        "George Eliott": "george augustus eliott, 1st baron heathfield"
    },
    {
        "  and Burgoyne. This was a revolutionary step, and Burgoyne was a pioneer in the early development of British light cavalry. Burgoyne admired independent thought amongst common soldiers, and encouraged his men to use their own initiative, in stark contrast to the established system employed at the time by the British army.          In 42 he sat in parliament for ": null
    },
    {
        "Midhurst": "midhurst"
    },
    {
        ",  and in the following year he served as a ": null
    },
    {
        "brigadier-general": "brigadier general"
    },
    {
        " in Portugal which had just entered the war. Burgoyne won particular distinction by leading his cavalry in the capture of ": null
    },
    {
        "Valencia de Alcántara": "valencia de alcántara"
    },
    {
        " and of ": null
    },
    {
        "Vila Velha de Ródão": "battle of vila velha"
    },
    {
        " following the ": null
    },
    {
        "Battle of Valencia de Alcántara": "battle of valencia de alcántara"
    },
    {
        ", compensating for the Portuguese ": null
    },
    {
        "loss of Almeida": "siege of almeida"
    },
    {
        ". This played a major part in repulsing a large ": null
    },
    {
        "Spanish force bent on invading Portugal": "spanish invasion of portugal"
    },
    {
        ".     In 42 he was elected to the House of Commons for ": null
    },
    {
        "Preston": "city of preston, lancashire"
    },
    {
        ", and for the next few years he occupied himself chiefly with his parliamentary duties, in which he was remarkable for his general outspokenness and, in particular, for his attacks on ": null
    },
    {
        "Lord Clive": "robert clive"
    },
    {
        ", who was at the time considered the nations leading soldier. He achieved prominence in 42 by demanding an investigation of the ": null
    },
    {
        "East India Company": "east india company"
    },
    {
        " alleging widespread corruption by its officials. At the same time, he devoted much attention to art and drama .             In the army he had been promoted to major-general. On the outbreak of the American war, he was appointed to a command, and arrived in Boston in May 42 a few weeks after the first shots of the war had been fired. He participated as part of the garrison during the ": null
    },
    {
        "Siege of Boston": "siege of boston"
    },
    {
        ", although he did not see action at the ": null
    },
    {
        "Battle of Bunker Hill": "battle of bunker hill"
    },
    {
        ", in which the ": null
    },
    {
        "British forces": "british army during the american war of independence"
    },
    {
        " were led by ": null
    },
    {
        "William Howe": "william howe, 5th viscount howe"
    },
    {
        " and ": null
    },
    {
        "Henry Clinton": "henry clinton"
    },
    {
        ". Frustrated by the lack of opportunities, he returned to England long before the rest of the garrison, which evacuated the city in March 42     In 42 he was at the head of the British reinforcements that sailed up the ": null
    },
    {
        "Saint Lawrence River": "saint lawrence river"
    },
    {
        " and relieved ": null
    },
    {
        "Quebec City": "quebec city"
    },
    {
        ", which was under siege by the ": null
    },
    {
        "Continental Army": "continental army"
    },
    {
        ". He led forces under General ": null
    },
    {
        "Guy Carleton": "guy carleton, 1st baron dorchester"
    },
    {
        " in the drive that chased the Continental Army from the ": null
    },
    {
        "province of Quebec": "province of quebec"
    },
    {
        ". Carleton then led the British forces onto ": null
    },
    {
        "Lake Champlain": "lake champlain"
    },
    {
        ", but was, in Burgoynes opinion, insufficiently bold when he failed to attempt the capture of ": null
    },
    {
        "Fort Ticonderoga": "fort ticonderoga"
    },
    {
        " after winning the naval ": null
    },
    {
        "Battle of Valcour Island": "battle of valcour island"
    },
    {
        " in October.            The following year, having convinced King ": null
    },
    {
        "George III": "george iii of the united kingdom"
    },
    {
        " and his government of Carletons faults, Burgoyne was given command of the British forces charged with gaining control of Lake Champlain and the ": null
    },
    {
        "Hudson River": "hudson river"
    },
    {
        " valley. The plan, largely of his own creation, was for Burgoyne and his force to cross Lake Champlain from Quebec and capture Ticonderoga before advancing on ": null
    },
    {
        "Albany, New York": "albany, new york"
    },
    {
        ", where they would rendezvous with another British army under General Howe coming north from New York City, and a smaller force that would come down the ": null
    },
    {
        "Mohawk River": "mohawk river"
    },
    {
        " valley under ": null
    },
    {
        "Barry St. Leger": "barry st. leger"
    },
    {
        ". This would divide ": null
    },
    {
        "New England": "new england"
    },
    {
        " from the southern colonies, and, it was believed, make it easier to end the rebellion.     From the beginning Burgoyne was vastly overconfident. Leading what he believed was an overwhelming force, he saw the campaign largely as a stroll that would make him a national hero who had saved the rebel colonies for the crown. Before leaving London he had wagered ": null
    },
    {
        "Charles James Fox": "charles james fox"
    },
    {
        " ten pounds that he would return victorious within a year. He refused to heed more cautious voices, both British and American, that suggested a successful campaign using the route he proposed was impossible, as the failed attempt the previous year had shown.     Underlining the plan was the belief that Burgoynes aggressive thrust from Quebec would be aided by the movements of two other large British forces under Generals Howe and Clinton who would support the advance. However, ": null
    },
    {
        "Lord Germain": "george germain, 1st viscount sackville"
    },
    {
        "s orders dispatched from London were not clear on this point, with the effect that Howe took no action to support Burgoyne, and Clinton moved from New York too late and in too little strength to be any great help to Burgoyne.      As a result of this miscommunication, Burgoyne ended up conducting the campaign single-handedly. He was not yet aware that he would not be gaining additional support, and was still reasonably confident of success. Having amassed an army of over 42 troops in Quebec, Burgoyne was also led to believe by reports that he could rely on the support of large numbers of Native Americans and ": null
    },
    {
        "American Loyalists": "loyalist"
    },
    {
        " who would rally to the flag once the British came south. Even if the countryside was not as pro-British as expected, much of the area between Lake Champlain and Albany was underpopulated anyway, and Burgoyne was skeptical any major enemy force could gather there.     The campaign was initially successful. Burgoyne ": null
    },
    {
        "gained possession": "siege of fort ticonderoga"
    },
    {
        " of the vital outposts of Fort Ticonderoga and ": null
    },
    {
        "Fort Edward": "fort edward , new york"
    },
    {
        ", but, pushing on, decided to break his communications with Quebec, and was eventually hemmed in by a superior force led by American Major General ": null
    },
    {
        "Horatio Gates": "horatio gates"
    },
    {
        ". Several attempts to break through the enemy lines were repulsed at ": null
    },
    {
        "Saratoga": "battle of saratoga"
    },
    {
        " in September and October 42 On 42 October 42 Burgoyne surrendered his entire army, numbering 42. This was the greatest victory the colonists had yet gained, and it proved to be the turning point in the war.           Rather than an outright ": null
    },
    {
        "unconditional surrender": "unconditional surrender"
    },
    {
        ", Burgoyne had agreed to a Convention that involved his men surrendering their weapons, and returning to Europe with a pledge not to return to North America. Burgoyne had been most insistent on this point, even suggesting he would try to fight his way back to Quebec if it was not agreed. Soon afterwards the ": null
    },
    {
        "Continental Congress": "continental congress"
    },
    {
        ", repudiated the treaty and imprisoned the remnants of the army in ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        " and ": null
    },
    {
        "Virginia": "virginia"
    },
    {
        ", where they were sometimes maltreated. This was widely seen as revenge for the poor British treatment of Continental prisoners.     Following Saratoga, the indignation in Britain against Burgoyne was great. He returned at once, with the leave of the American general, to defend his conduct and demanded but never obtained a trial. He was deprived of his regiment and the ": null
    },
    {
        "governorship of Fort William in Scotland": "governor of fort william"
    },
    {
        ", which he had held since 42 Following the defeat, France recognised the United States and entered the war on 42 February 42 transforming it into a global conflict.     Although Burgoyne at the time was widely held to blame for the defeat, historians have over the years shifted responsibility for the disaster at Saratoga to ": null
    },
    {
        "Lord Germain": "george germain, 1st viscount sackville"
    },
    {
        ", the ": null
    },
    {
        "Secretary of State for the Colonies": "secretary of state for the colonies"
    },
    {
        ". Germain had overseen the overall strategy for the campaign and had significantly neglected to order General Howe to support Burgoynes invasion, instead leaving him to believe that he was free to launch his own attack on ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ".            Previously Burgoyne had been a ": null
    },
    {
        "Tory": "tory"
    },
    {
        "-leaning supporter of the ": null
    },
    {
        "North government": "north ministry"
    },
    {
        " but following his return from Saratoga he began to associate with the ": null
    },
    {
        "Rockingham Whigs": "rockingham whigs"
    },
    {
        ". In 42 when his political friends came into office, Burgoyne was restored to his rank, given the colonelcy of the ": null
    },
    {
        "Kings Own Royal Regiment": "kings own royal regiment"
    },
    {
        ", made commander-in-chief in Ireland and appointed a ": null
    },
    {
        "privy councillor": "privy council of great britain"
    },
    {
        ". After the fall of the ": null
    },
    {
        "Rockingham": "charles watson-wentworth, 2nd marquess of rockingham"
    },
    {
        " government in 42 Burgoyne withdrew more and more into private life. His last public service was his participation in the ": null
    },
    {
        "Impeachment of Warren Hastings": "impeachment of warren hastings"
    },
    {
        ". He died quite unexpectedly on 42 August 42 at his home in ": null
    },
    {
        "Mayfair": "mayfair"
    },
    {
        ", after having been seen the previous night at the theatre in apparent good health. Burgoyne is buried in ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        ", in the North Walk of the Cloisters.     After the death of his wife in 42 Burgoyne had four children by his mistress ": null
    },
    {
        "Susan Caulfield": "susan caulfield"
    },
    {
        "; one was Field Marshal ": null
    },
    {
        "John Fox Burgoyne": "john fox burgoyne"
    },
    {
        ", father of ": null
    },
    {
        "Hugh Talbot Burgoyne": "hugh talbot burgoyne"
    },
    {
        ", ": null
    },
    {
        "VC": "victoria cross"
    },
    {
        ".       In his time Burgoyne was a notable playwright, writing a number of popular plays. The most notable were  The Maid of the Oaks   and  The Heiress  . He assisted ": null
    },
    {
        "Richard Brinsley Sheridan": "richard brinsley sheridan"
    },
    {
        " in his production of  The Camp , which he may have co-authored. He also wrote the libretto for ": null
    },
    {
        "William Jackson": "william jackson"
    },
    {
        "s only successful opera The Lord of the Manor . He also wrote a translated ": null
    },
    {
        "semi-opera": "semi-opera"
    },
    {
        " version of ": null
    },
    {
        "Michel-Jean Sedaine": "michel-jean sedaine"
    },
    {
        "s work  Richard Coeur de lion  with music by ": null
    },
    {
        "Thomas Linley the elder": "thomas linley the elder"
    },
    {
        " for the ": null
    },
    {
        "Drury Lane Theatre": "theatre royal, drury lane"
    },
    {
        " where it was very successful in 42  Had it not been for his role in the American War of Independence, Burgoyne would most likely be foremost remembered today as a dramatist.       https://archive.org/details/dramaticandpoet42burggoog The Dramatic and Poetical Works of the Late Lieut. Gen. J. Burgoyne, London 42 Facsimile ed., 42 vols. in 42 42 Scholars Facsimiles & Reprints, .    The Maid of the Oaks      The Camp  possible collaboration with Sheridan    The Lord of the Manor     The Heiress     Richard Coeur de Lion        Burgoyne has often been portrayed by historians and commentators as a classic example of the marginally-competent aristocratic British general who acquired his rank through political connections rather than ability. Accounts of the lavish lifestyle he maintained on the Saratoga campaign, combined with a gentlemanly bearing and his career as a playwright led less-than-friendly contemporaries to caricature him, as historian George Billias writes, a buffoon in uniform who bungled his assignments badly . Much of the historical record, Billias notes, is based upon these characterisations. Billias opines that Burgoyne was a ruthless and risk-taking general with a keen perception of his opponents, and also a perceptive social and political commentator.     Burgoyne has made appearances as a character in historical and ": null
    },
    {
        "alternative history": "alternate history"
    },
    {
        " fiction. He appears as a character in ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        "s play  The Devils Disciple  and its ": null
    },
    {
        "42": "the devils disciple"
    },
    {
        " and ": null
    },
    {
        "42": "the devils disciple"
    },
    {
        " film adaptions, portrayed by ": null
    },
    {
        "Laurence Olivier": "laurence olivier"
    },
    {
        " and ": null
    },
    {
        "Ian Richardson": "ian richardson"
    },
    {
        " respectively. Historical novels by ": null
    },
    {
        "Chris Humphreys": "chris humphreys"
    },
    {
        " that are set during the Saratoga campaign also feature him, while alternate or mystical history versions of his campaign are featured in  For Want of a Nail  by ": null
    },
    {
        "Robert Sobel": "robert sobel"
    },
    {
        " and the 42 ": null
    },
    {
        "CBS Radio Mystery Theater": "cbs radio mystery theater"
    },
    {
        " play Windandingo .": null
    }
]