[
    {
        "Charles John Stanley  was an ": null
    },
    {
        "English": "english people"
    },
    {
        " composer": "composer"
    },
    {
        " and ": null
    },
    {
        "organist": "organist"
    },
    {
        ".       John Stanley was born in London on 42 January 42 At about the age of two, he fell on a marble hearth with a china basin in his hand, an accident which left him almost blind.     He began studying music at the age of seven. Under the guidance of ": null
    },
    {
        "Maurice Greene": "maurice greene"
    },
    {
        ", composer and organist at St. Pauls Cathedral, he studied with great diligence, and a success that was astonishing . At the age of nine he played the organ, probably as an occasional deputy, at ": null
    },
    {
        "All Hallows Bread Street": "all hallows bread street"
    },
    {
        ". When he was eleven years old, Stanley was appointed organist to the church at a salary of £42 per annum.     When he was fourteen in preference to a great number of candidates he was chosen as organist at ": null
    },
    {
        "St Andrews, Holborn": "st andrews, holborn"
    },
    {
        ", and at the age of seventeen became the youngest person ever to obtain the Bachelor of Music degree at the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        ".     In 42 he was appointed organist to the ": null
    },
    {
        "Society of the Inner Temple": "society of the inner temple"
    },
    {
        ", a position which he held until his death in 42 It was at the ancient Temple Church that his brilliant playing upon the organ and harpsichord attracted the attention of many fine musicians including ": null
    },
    {
        "George Frideric Handel": "george frideric handel"
    },
    {
        ", who regularly visited the church to hear him. Stanley was also an outstanding violinist.     In 42 Stanley married Sarah Arlond , who brought him a dowry of £42 per annum. Sarahs sister Ann, who at this time lived with them, became the blind composers copyist.     Though virtually blind, Stanley had a remarkable memory, which helped him direct many of Handels oratorios and to enjoy music-making and card games with his many friends. If he had to accompany a new oratorio he would ask his sister-in-law to play it through just once – enough to commit it to memory. He frequently played the organ at the ": null
    },
    {
        "Vauxhall Gardens": "vauxhall gardens"
    },
    {
        " and was first choice to play at charity events and at the launch of any newly built church organs. He even found time to teach. His oratorio Jephthah was first performed in 42     After Handels death, in 42 Stanley began a partnership with the composer ": null
    },
    {
        "John Christopher Smith": "john christopher smith"
    },
    {
        " and later with ": null
    },
    {
        "Thomas Linley": "thomas linley the elder"
    },
    {
        ", in order to continue with the series of ": null
    },
    {
        "oratorio": "oratorio"
    },
    {
        " performances at ": null
    },
    {
        "Covent Garden": "covent garden"
    },
    {
        ". For the first season Stanley composed Zimri. Stanley accompanied all oratorios, and played a concerto during each interval. Also in 42 he composed an ode in memory of ": null
    },
    {
        "George II": "george ii of great britain"
    },
    {
        " and as homage to ": null
    },
    {
        "George III": "george iii of the united kingdom"
    },
    {
        "; it was first performed at the ": null
    },
    {
        "Drury Lane Theatre": "theatre royal, drury lane"
    },
    {
        ". On the occasion of the Kings wedding in 42 he composed a dramatic pastoral oratorio, Arcadia.     Handel had been a Governor of the ": null
    },
    {
        "Foundling Hospital": "foundling hospital"
    },
    {
        ", London. The Hospitals Chapel organ was Handels gift, and Handel himself directed eleven performances of  Messiah  there, so raising £42 for the charity. Continuing yet again in Handels footsteps, Stanley was elected a governor of the Hospital in 42 and from 42 until 42 he directed the annual performance of Handels Messiah in aid of the hospital funds.     In 42 Stanley succeeded ": null
    },
    {
        "William Boyce": "william boyce"
    },
    {
        " as ": null
    },
    {
        "Master of the Kings Band": "master of the queens music"
    },
    {
        " of musicians. In this capacity he composed many New Year and Birthday odes to the King but this music has not survived. Stanleys last work was probably an ode written for the Kings birthday . Stanley never heard its performance as he died at his home in Hatton Garden on 42 May 42 aged 42     Stanleys works include the ": null
    },
    {
        "opera": "opera"
    },
    {
        " Teraminta, the dramatic ": null
    },
    {
        "cantata": "cantata"
    },
    {
        " The Choice of Hercules, twelve other cantatas with texts by ": null
    },
    {
        "John Hawkins": "john hawkins"
    },
    {
        ", the ": null
    },
    {
        "oratorio": "oratorio"
    },
    {
        "s Jephtha, The Fall of Egypt and Zimri, and instrumental music, notably three volumes of voluntaries for organ . Nearly all of the voluntaries feature a short, slow introduction followed by either a solo-stop movement  or a fugue. Some of the former have been arranged in modern times for string chamber orchestra and trumpet.        Eight Solos for Flute and Continuo   Opus 42 Six Concertos for strings    Opus 42 Six Cantatas   Opus 42 Six Solos for Flute and Continuo   Opus 42 Ten Voluntaries for Organ   Opus 42 Ten Voluntaries for Organ   Opus 42 Ten Voluntaries for Organ   Opus 42 Six Cantatas   Opus 42 Three Cantatas   Jephthah: Oratorio   Opus 42 Six Concertos for Organ or Harpsichord solo   Zimiri: Oratorio   Arcadia: A dramatic pastoral Oratorio   The Fall of Egypt: Oratorio         at the .    at .    at the .                                                                         ": null
    }
]