[
    {
        "   John James Heidegger was a Swiss count and leading ": null
    },
    {
        "impresario": "impresario"
    },
    {
        " of ": null
    },
    {
        "masquerades": "masquerade ball"
    },
    {
        " in the early part of the 42th century.     The son of ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        " clergyman ": null
    },
    {
        "Johann Heinrich Heidegger": "johann heinrich heidegger"
    },
    {
        ", Johann Jacob Heidegger came to England in 42 as a Swiss negotiator. He failed in his undertaking, and was involved in difficulties. So he entered as a private in the Guards, and afterwards became influential in the management of the opera. In 42 he made five hundred guineas by furnishing the spectacle for ": null
    },
    {
        "Motteux": "peter anthony motteux"
    },
    {
        "s opera Tomyris, Queen of Scythia.     From 42 on, as part of a new commercial public entertainment, he promoted ": null
    },
    {
        "masquerade ball": "masquerade ball"
    },
    {
        "s at the ": null
    },
    {
        "Haymarket Theatre": "haymarket theatre"
    },
    {
        ". The fashionable world of ": null
    },
    {
        "London": "london"
    },
    {
        " was enthusiastic about it and called Heidegger the Swiss Count. Though moralists protested and clergymen preached against such activities, the carnivalesque phenomenon became a trend throughout 42th-century London. In 42 ": null
    },
    {
        "William Hogarth": "william hogarth"
    },
    {
        " published a ": null
    },
    {
        "satire": "satire"
    },
    {
        " on Heidegger in his print,  Masquerades and Operas . By that time, masquerades were equally reputed for their great popularity and immoral influences. Indeed, much of the occasions popularity resulted from the aura of sexual danger and mystery, as women of pleasure were also constantly present.     In 42 during the coronation of King George II in Westminster Hall, he provided a spectacle of lighting 42 candles in under three minutes. He had used a burnable connector that ran from candle to candle. According to the poet ": null
    },
    {
        "Thomas Gray": "thomas gray"
    },
    {
        ", the Queen and her ladies were in no small terror as trains of ": null
    },
    {
        "flax": "flax"
    },
    {
        " were set alight and flames ran swiftly from candle to candle. The expiring flax fell in large flakes upon the heads of those beneath but did no harm.     In 42 Heidegger was called in to nurse the ": null
    },
    {
        "Opera": "opera"
    },
    {
        ", which throve by his bold puffing. In 42 ": null
    },
    {
        "Handel": "handel"
    },
    {
        " and Heidegger were permitted to produce operas at the Kings Theatre by The Royal Academy in London. I was born, Heidegger himself said, a Swiss, and came to ": null
    },
    {
        "England": "england"
    },
    {
        " without a farthing, where I have found means to gain 42 a year, & mdash; and to spend it. Now I defy the ablest Englishman to go to ": null
    },
    {
        "Switzerland": "switzerland"
    }
]