[
    {
        "        Juan Molina , better known as John John Molina in the ": null
    },
    {
        "world": "world"
    },
    {
        " of ": null
    },
    {
        "boxing": "boxing"
    },
    {
        ", is a former boxer whose career transcended boxing in ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        ". A multiple time world champion, this boxer was also known as quite a socialite. Molina is a native of ": null
    },
    {
        "Fajardo, Puerto Rico": "fajardo"
    },
    {
        ".       Molina represented Puerto Rico as a ": null
    },
    {
        "Bantamweight": "bantamweight"
    },
    {
        " at the ": null
    },
    {
        "42 Los Angeles Olympic Games": "boxing at the 1984 summer olympicsbantamweight .28.e2.80.93 54 kg.29"
    },
    {
        ". His results were:   42st round bye   Defeated Jarmo Eskelinen 4242   Lost to ": null
    },
    {
        "Pedro Nolasco": "pedro nolasco"
    },
    {
        " 4242     Molina won the ": null
    },
    {
        "Boxing World Cup": "boxing world cup"
    },
    {
        " in ": null
    },
    {
        "Seoul, South Korea": "seoul, south korea"
    },
    {
        ", November 42 by knocking out ": null
    },
    {
        "Kelcie Banks": "kelcie banks"
    },
    {
        " in the finals. Upon returning to Puerto Rico, the 42-year-old youngster announced to ": null
    },
    {
        "Rafael Bracero": "rafael bracero"
    },
    {
        " on ": null
    },
    {
        "TV": "television"
    },
    {
        " he would be ready to fight professional world Featherweight champion  Victor Luvi Callejas  within a year. That wasnt to happen, however.       Molina started as a professional on February 42 42 beating Job Walters by a decision in four. His first three fights were decisions. He won his first 42 bouts, nine of them by ": null
    },
    {
        "knockout": "knockout"
    },
    {
        ". Among the people he beat during that span was Victor Aponte, who was a stablemate of both ": null
    },
    {
        "Alberto Mercado": "alberto mercado"
    },
    {
        " and ": null
    },
    {
        "Juan Carazo": "juan carazo"
    },
    {
        ". Aponte got knocked out by Molina in the 42th and final round. During this period of his career, Molina received much television exposure in Puerto Rico, many of his fights being shown on TV by producer and fight commentator Ivonne Class and her Video Deportes company.     Then, he faced Lupe Suarez, losing for the first time, when he was knocked out in the ninth round. Immediately after suffering his first loss, he embarked on a five-fight win streak, including a disqualification win in four rounds over former ": null
    },
    {
        "Hector Camacho": "hector camacho"
    },
    {
        " world title challenger ": null
    },
    {
        "Rafael Solis": "rafael solis"
    },
    {
        ", and a knockout in eight over Miguel Medina. After those two wins, he was ranked as the number one challenger by the ": null
    },
    {
        "IBF": "international boxing federation"
    },
    {
        ".     On October 42 42 Molina was at The Arco Arena in ": null
    },
    {
        "Sacramento": "sacramento, california"
    },
    {
        ", to challenge the IBF super featherweight champion ": null
    },
    {
        "Tony Lopez": "tony lopez"
    },
    {
        ", in what marked the beginning of a three-fight rivalry between Molina and Lopez. Molina dropped Lopez in round two, but Lopez went on to retain the title by a split decision.     In his next fight, April 42 42 the ": null
    },
    {
        "WBO": "wbo"
    },
    {
        " put him and former ": null
    },
    {
        "WBC": "world boxing council"
    },
    {
        " featherweight champion ": null
    },
    {
        "Juan Laporte": "juan laporte"
    },
    {
        " against each other for the vacant WBO super featherweight title. Molina became a world champion by beating Laporte by a 42-round unanimous decision at ": null
    },
    {
        "Roberto Clemente Coliseum": "roberto clemente coliseum"
    },
    {
        " in ": null
    },
    {
        "San Juan": "san juan, puerto rico"
    },
    {
        ". Then, in September of that year, he returned to Arco Arena to resume his rivalry with Lopez. Molina added the IBF belt to his WBO crown by knocking Lopez out in the tenth round.     On January 42 42 he avenged his loss to Suarez by knocking him out in the sixth round to retain the belt, but then, on May 42 of that year, he and Lopez met for their rubber match, this time in ": null
    },
    {
        "Reno": "reno, nevada"
    },
    {
        ". Lopez dropped Molina and won a unanimous decision to recover his status as world Jr. Lightweight champion.     Between then and 42 Molina won five straight fights, four by knockout. And so, after ": null
    },
    {
        "Brian Mitchell": "brian mitchell"
    },
    {
        " , left the IBF title vacant due to retirement, Molina travelled to ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ", where he met Jackie Gunguzula for the vacant world title. He knocked Gunguzula out in the fourth round to become world champion once again, and, days later, he was the object of a large welcoming at ": null
    },
    {
        "Luis Muñoz Marín International Airport": "luis muñoz marín international airport"
    },
    {
        " in San Juan. During this period of his reign, Molina made seven defenses, beating challengers like ": null
    },
    {
        "Bernard Taylor": "bernard taylor"
    },
    {
        ", ": null
    },
    {
        "Floyd Havard": "floyd havard"
    },
    {
        ", ": null
    },
    {
        "Wilson Rodriguez": "wilson rodriguez"
    },
    {
        ", former world Featherweight champion ": null
    },
    {
        "Gregorio Vargas": "gregorio vargas"
    },
    {
        " and future world Featherweight champion ": null
    },
    {
        "Manuel Mantecas Medina": "manuel medina"
    },
    {
        ", among others.     Around then, he became quite known by the mainstream ": null
    },
    {
        "Puerto Rican": "puerto rico"
    },
    {
        " public, becoming one of the first boxers ever to be portrayed on the cover of  Vea  magazine, and dating a famous model.     Molina then moved up in weight to challenge the WBO ": null
    },
    {
        "lightweight": "lightweight"
    },
    {
        " champion ": null
    },
    {
        "Oscar De La Hoya": "oscar de la hoya"
    },
    {
        ", losing by a unanimous decision in 42 rounds in an ": null
    },
    {
        "HBO Boxing": "hbo boxing"
    },
    {
        " televised event.     After that, Molina engaged in a series of fights against mostly lower-level opposition for the next two years, and he grew frustrated over the fact that his opposition level was being downgraded by promoters after the fight with de la Hoya. He won his next nine bouts, but the only two opponents that can probably be called respectable names in his list of opponents during that span were Jaime Rocky Balboa, beaten by decision in ten, and Isaac Cruz, beaten by a disqualification in four.     On May 42 42 Molina was given a second chance at a world lightweight championship, when he met IBF champion ": null
    },
    {
        "Sugar Shane Mosley": "shane mosley"
    },
    {
        ", in Molinas second ": null
    },
    {
        "HBO": "home box office"
    },
    {
        " fight. Mosley retained the title by a knockout in the eighth round, and Molina went back to the super featherweight division.     His next fight was also for the world title, but he had to wait nine months for that fight. In February 42 he faced IBF super featherweight champion ": null
    },
    {
        "Roberto Garcia": "roberto garcia cortez"
    },
    {
        ", dropping the champion in their ": null
    },
    {
        "pay per view": "pay per view"
    },
    {
        " event but losing a 42-round decision in what turned out to be his last world title fight.     Molina wasnt done with boxing, and he went on to win seven more fights in a row, including two decision wins that were televised by the ": null
    },
    {
        "USA Network": "usa network"
    },
    {
        ": over ": null
    },
    {
        "Emanuel Burton": "emanuel burton"
    },
    {
        " and future ": null
    },
    {
        "Kostya Tszyu": "kostya tszyu"
    },
    {
        " world title challenger ": null
    },
    {
        "Ben Tackie": "ben tackie"
    },
    {
        ".     His last fight was a T.K.O. loss to Mexican ": null
    },
    {
        "Juan Lazcano": "juan lazcano"
    }
]