[
    {
        "              John Marwood Cleese  is an English actor, voice actor, comedian, screenwriter, and producer. He achieved success at the ": null
    },
    {
        "Edinburgh Festival Fringe": "edinburgh festival fringe"
    },
    {
        " and as a scriptwriter and performer on  The Frost Report . In the late 1960s, he co-founded ": null
    },
    {
        "Monty Python": "monty python"
    },
    {
        ", the comedy troupe responsible for the ": null
    },
    {
        "sketch show": "sketch show"
    },
    {
        "  Monty Pythons Flying Circus . Along with his Python co-stars ": null
    },
    {
        "Terry Gilliam": "terry gilliam"
    },
    {
        ", ": null
    },
    {
        "Eric Idle": "eric idle"
    },
    {
        ", ": null
    },
    {
        "Terry Jones": "terry jones"
    },
    {
        ", ": null
    },
    {
        "Michael Palin": "michael palin"
    },
    {
        " and ": null
    },
    {
        "Graham Chapman": "graham chapman"
    },
    {
        ", Cleese starred in Monty Python films, which include:  Monty Python and the Holy Grail  ,  Life of Brian  and  The Meaning of Life  .     In the mid-1970s, Cleese and his first wife, ": null
    },
    {
        "Connie Booth": "connie booth"
    },
    {
        ", co-wrote the sitcom  Fawlty Towers , and he starred in it as ": null
    },
    {
        "Basil Fawlty": "basil fawlty"
    },
    {
        ". The series resulted in Cleese receiving the 1980 ": null
    },
    {
        "BAFTA for Best Entertainment Performance": "british academy television award for best entertainment performance"
    },
    {
        ", and in 2000 the show topped the ": null
    },
    {
        "British Film Institutes": "british film institute"
    },
    {
        "list of the ": null
    },
    {
        "100 Greatest British Television Programmes": "100 greatest british television programmes"
    },
    {
        ". In a 2001 ": null
    },
    {
        "Channel 4": "channel 4"
    },
    {
        " poll Basil was ranked second on their list of the ": null
    },
    {
        "100 Greatest TV Characters": "100 greatest"
    },
    {
        ". Cleese co-starred with ": null
    },
    {
        "Kevin Kline": "kevin kline"
    },
    {
        ", ": null
    },
    {
        "Jamie Lee Curtis": "jamie lee curtis"
    },
    {
        ", and former Python colleague Michael Palin in  A Fish Called Wanda  and  Fierce Creatures  , both of which he also wrote; for A Fish Called Wanda, he was also nominated for the ": null
    },
    {
        "Academy Award for Best Original Screenplay": "academy award for best original screenplay"
    },
    {
        ". He has also starred in  Time Bandits  and  Rat Race  and has appeared in many other films, including  Silverado  ,  Mary Shelleys Frankenstein  , two  James Bond  films , two  Harry Potter  films , and three  Shrek  films.     Emerging from the ": null
    },
    {
        "Cambridge Footlights": "cambridge footlights"
    },
    {
        " in the 1960s, Cleese specialises in ": null
    },
    {
        "satire": "satire"
    },
    {
        ", ": null
    },
    {
        "black comedy": "black comedy"
    },
    {
        ", ": null
    },
    {
        "sketch comedy": "sketch comedy"
    },
    {
        " and ": null
    },
    {
        "surreal humour": "surreal humour"
    },
    {
        ".  With  Yes Minister  writer ": null
    },
    {
        "Antony Jay": "antony jay"
    },
    {
        ", he co-founded ": null
    },
    {
        "Video Arts": "video arts"
    },
    {
        ", a production company making entertaining training films. In 1976, Cleese co-founded  The Secret Policemans Ball  benefit shows to raise funds for the human rights organisation ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        ". Although a long running supporter of the ": null
    },
    {
        "Liberal Democrats": "liberal democrats"
    },
    {
        ", in 1999 he turned down a ": null
    },
    {
        "life peer": "life peer"
    },
    {
        "age offer from the party.       Cleese was born in ": null
    },
    {
        "Weston-super-Mare": "weston-super-mare"
    },
    {
        ", Somerset, the only child of Reginald Francis Cleese , an insurance salesman, and his wife Muriel Evelyn .  His familys surname was originally Cheese, but his father had thought it was embarrassing and used the name Cleese when he enlisted in the ": null
    },
    {
        "Army": "british army"
    },
    {
        " during the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        "; he changed it officially by deed poll in 1923.   As a child, Cleese supported ": null
    },
    {
        "Bristol City FC": "bristol city football club"
    },
    {
        " and ": null
    },
    {
        "Somerset County Cricket Club": "somerset county cricket club"
    },
    {
        ".   Cleese was educated at St Peters Preparatory School , where he received a prize for ": null
    },
    {
        "English": "english studies"
    },
    {
        " and did well at ": null
    },
    {
        "cricket": "cricket"
    },
    {
        " and ": null
    },
    {
        "boxing": "boxing"
    },
    {
        ". When he was 13, he was awarded an ": null
    },
    {
        "exhibition": "exhibition"
    },
    {
        " at ": null
    },
    {
        "Clifton College": "clifton college"
    },
    {
        ", an ": null
    },
    {
        "English public school": "english public school"
    },
    {
        " in Bristol. He was already more than 6  feet tall by then.     Cleese allegedly defaced the school grounds, as a prank, by painting footprints to suggest that the statue of ": null
    },
    {
        "Field Marshal": "field marshal"
    },
    {
        " Earl Haig": "douglas haig, 1st earl haig"
    },
    {
        " had got down from his plinth and gone to the toilet.  Cleese played cricket in the First XI and did well academically, passing 8 ": null
    },
    {
        "O-Levels": "gce ordinary level"
    },
    {
        " and 3 ": null
    },
    {
        "A-Levels": "gce advanced level"
    },
    {
        " in mathematics, physics, and chemistry.   In his autobiography So, Anyway, he says that discovering, aged 17, he had not been made a house prefect by his housemaster affected his outlook: It was not fair and therefore it was unworthy of my respect  ... I believe that this moment changed my perspective on the world.     He could not go straight to ": null
    },
    {
        "Cambridge": "university of cambridge"
    },
    {
        ", as the ending of ": null
    },
    {
        "National Service": "conscription in the united kingdom"
    },
    {
        " meant there were twice the usual number of applicants for places, so he returned to his prep school for two years From Fringe to Flying Circus  – Celebrating a Unique Generation of Comedy 1960–1980  – Roger Wilmut, Eyre Methuen Ltd, 1980, . to teach science, English, geography, history, and Latin  . Life of Brian commentary by Terry Jones, Terry Gilliam and Eric Idle He then took up a place he had won at ": null
    },
    {
        "Downing College, Cambridge": "downing college, cambridge"
    },
    {
        ", to read Law. He also joined the ": null
    },
    {
        "Cambridge Footlights": "footlights"
    },
    {
        ". He recalled that he went to the ": null
    },
    {
        "Cambridge Guildhall": "cambridge guildhall"
    },
    {
        ", where each university society had a stall, and went up to the Footlights stall where he was asked if he could sing or dance. He replied no as he was not allowed to sing at his school because he was so bad, and if there was anything worse than his singing, it was his dancing. He was then asked Well, what do you do? to which he replied, I make people laugh.     At the Footlights theatrical club, he spent a lot of time with ": null
    },
    {
        "Tim Brooke-Taylor": "tim brooke-taylor"
    },
    {
        " and ": null
    },
    {
        "Bill Oddie": "bill oddie"
    },
    {
        " and met his future writing partner ": null
    },
    {
        "Graham Chapman": "graham chapman"
    },
    {
        ". Cleese wrote extra material for the 1961 Footlights Revue I Thought I Saw It Move, Footlights!  – A Hundred Years of Cambridge Comedy  – Robert Hewison, Methuen London Ltd, 1983, . and was Registrar for the Footlights Club during 1962. He was also in the cast of the 1962 Footlights Revue Double Take! Cleese graduated from Cambridge in 1963 with a ": null
    },
    {
        "2:1": "2:1"
    },
    {
        ". Despite his successes on  The Frost Report , his father would send him cuttings from  The Daily Telegraph  offering management jobs in places like ": null
    },
    {
        "Marks and Spencer": "marks and spencer"
    },
    {
        ". ": null
    },
    {
        "Sunday Times": "sunday times"
    },
    {
        ", 16 October 1988.         Cleese was a scriptwriter, as well as a cast member, for the 1963 ": null
    },
    {
        "Footlights Revue": "cambridge footlights revue"
    },
    {
        " A Clump of Plinths. The revue was so successful at the ": null
    },
    {
        "Edinburgh Festival Fringe": "edinburgh festival fringe"
    },
    {
        " that it was renamed  Cambridge Circus  and taken to the ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " in London and then on a tour of New Zealand and Broadway, with the cast also appearing in some of the revues sketches on  The Ed Sullivan Show  in October 1964.     After Cambridge Circus, Cleese briefly stayed in America, performing ": null
    },
    {
        "on": "broadway theatre"
    },
    {
        " and ": null
    },
    {
        "off-Broadway": "off-broadway"
    },
    {
        ". While performing in the musical  Half a Sixpence , Cleese met future Python ": null
    },
    {
        "Terry Gilliam": "terry gilliam"
    },
    {
        ", as well as American actress Connie Booth, whom he married on 20 February 1968. At their wedding at a Unitarian Church in Manhattan, the couple attempted to ensure an absence of any theistic language. The only moment of disappointment, Cleese recalled, came at the very end of the service when I discovered that Id failed to excise one particular mention of the word God. Cleese, John . New York: Crown Archetype, p. 318. Later Booth would become a writing partner.     He was soon offered work as a writer with ": null
    },
    {
        "BBC Radio": "bbc radio"
    },
    {
        ", where he worked on several programmes, most notably as a sketch writer for  The Dick Emery Show . The success of the Footlights Revue led to the recording of a short series of half-hour radio programmes, called  Im Sorry, Ill Read That Again , which were so popular that the BBC commissioned a regular series with the same title that ran from 1965 to 1974. Cleese returned to Britain and joined the cast. In many episodes, he is credited as John Otto Cleese . P70, The Authorised History of Im Sorry I Havent A Clue; Jem Roberts      Also in 1965, Cleese and Chapman began writing on  The Frost Report . The writing staff chosen for The Frost Report consisted of a number of writers and performers who would go on to make names for themselves in comedy.  They included co-performers from Im Sorry, Ill Read That Again and future ": null
    },
    {
        "Goodies": "the goodies"
    },
    {
        " Bill Oddie": "bill oddie"
    },
    {
        " and ": null
    },
    {
        "Tim Brooke-Taylor": "tim brooke-taylor"
    },
    {
        ", and also ": null
    },
    {
        "Frank Muir": "frank muir"
    },
    {
        ", ": null
    },
    {
        "Barry Cryer": "barry cryer"
    },
    {
        ", ": null
    },
    {
        "Marty Feldman": "marty feldman"
    },
    {
        ", ": null
    },
    {
        "Ronnie Barker": "ronnie barker"
    },
    {
        ", ": null
    },
    {
        "Ronnie Corbett": "ronnie corbett"
    },
    {
        ", ": null
    },
    {
        "Dick Vosburgh": "dick vosburgh"
    },
    {
        " and future Python members ": null
    },
    {
        "Eric Idle": "eric idle"
    },
    {
        ", ": null
    },
    {
        "Terry Jones": "terry jones"
    },
    {
        ", and ": null
    },
    {
        "Michael Palin": "michael palin"
    },
    {
        ".   While working on The Frost Report, the future Pythons developed the writing styles that would make their collaboration significant. Cleeses and Chapmans sketches often involved authority figures, some of whom were performed by Cleese, while Jones and Palin were both infatuated with filmed scenes that opened with idyllic countryside panoramas. Idle was one of those charged with writing ": null
    },
    {
        "David Frosts": "david frost"
    },
    {
        "monologue. During this period Cleese met and befriended influential British comedian ": null
    },
    {
        "Peter Cook": "peter cook"
    },
    {
        ".     It was as a performer on The Frost Report that Cleese achieved his breakthrough on British television as a comedy actor, appearing as the tall, patrician figure in the classic  Class sketch , contrasting comically in a line-up with the shorter, middle class ": null
    },
    {
        "Ronnie Barker": "ronnie barker"
    },
    {
        " and the even shorter, working class ": null
    },
    {
        "Ronnie Corbett": "ronnie corbett"
    },
    {
        ". The British Film Institute commented, Its twinning of height and social position, combined with a minimal script, created a classic TV moment.  This series was so popular that in 1966 Cleese and Chapman were invited to work as writers and performers with Brooke-Taylor and Feldman on  At Last the 1948 Show , during which time the  Four Yorkshiremen sketch  was written by all four writers/performers .  Cleese and Chapman also wrote episodes for the first series of  Doctor in the House  . These series were successful, and in 1969 Cleese and Chapman were offered their very own series. However, owing to Chapmans alcoholism, Cleese found himself bearing an increasing workload in the partnership and was, therefore, unenthusiastic about doing a series with just the two of them. He had found working with Palin on The Frost Report an enjoyable experience and invited him to join the series. Palin had previously been working on  Do Not Adjust Your Set  with Idle and Jones, with Terry Gilliam creating the animations. The four of them had, on the back of the success of Do Not Adjust Your Set, been offered a series for ": null
    },
    {
        "Thames Television": "thames television"
    },
    {
        ", which they were waiting to begin when Cleeses offer arrived. Palin agreed to work with Cleese and Chapman in the meantime, bringing with him Gilliam, Jones, and Idle.           Monty Pythons Flying Circus ran for four seasons from October 1969 to December 1974 on ": null
    },
    {
        "BBC Television": "bbc television"
    },
    {
        ", though Cleese quit the show after the third. Cleeses two primary characterisations were as a sophisticated and a stressed-out loony. He portrayed the former as a series of announcers, TV show hosts, and government officials . The latter is perhaps best represented in the ": null
    },
    {
        "Cheese Shop": "cheese shop sketch"
    },
    {
        " and by Cleeses ": null
    },
    {
        "Mr Praline": "mr praline"
    },
    {
        " character, the man with a ": null
    },
    {
        "dead Norwegian Blue parrot": "dead parrot sketch"
    },
    {
        " and a menagerie of other animals all named Eric . He was also known for his working class Sergeant Major character, who worked as a Police Sergeant, Roman Centurion, etc. Cleese also appeared during some abrupt scene changes where he would come in as a radio commentator and, in a rather pompous manner, make the formal and determined announcement And now for something completely different , which later became the title of ": null
    },
    {
        "the first Monty Python film": "and now for something completely different"
    },
    {
        ".             Along with Gilliams animations, Cleeses work with Graham Chapman provided Python with its darkest and angriest moments, and many of his characters display the seething suppressed rage that later characterised his portrayal of ": null
    },
    {
        "Basil Fawlty": "basil fawlty"
    },
    {
        ".     Unlike Palin and Jones, Cleese and Chapman wrote together in the same room; Cleese claims that their writing partnership involved him doing most of the work, while Chapman sat back, not speaking for long periods before suddenly coming out with an idea that often elevated the sketch to a new level. A classic example of this is the ": null
    },
    {
        "Dead Parrot sketch": "dead parrot sketch"
    },
    {
        " , envisaged by Cleese as a satire on poor customer service, which was originally to have involved a broken toaster and later a broken car . It was Chapmans suggestion to change the faulty item into a dead parrot, and he also suggested that the parrot be specifically a Norwegian Blue , giving the sketch a ": null
    },
    {
        "surreal": "surrealism"
    },
    {
        " air which made it far more memorable. McCabe, Bob . The Life of Graham, The authorised biography of Graham Chapman. pp. 90-91. London: Orion Books     Their humour often involved ": null
    },
    {
        "ordinary people": "everyman"
    },
    {
        " in ordinary situations behaving absurdly for no obvious reason. Like Chapman, Cleeses ": null
    },
    {
        "poker face": "deadpan"
    },
    {
        ", clipped middle class accent, and intimidating height allowed him to appear convincingly as a variety of authority figures, such as policemen, detectives, Nazi officers or government officials—which he would then proceed to undermine. Most famously, in the ": null
    },
    {
        "Ministry of Silly Walks": "the ministry of silly walks"
    },
    {
        " sketch , Cleese exploits his stature as the crane-legged civil servant performing a grotesquely elaborate walk to his office. On the Silly Walks sketch, Ben Beaumont-Thomas in  The Guardian  writes, “Cleese is utterly deadpan as he takes the stereotypical ": null
    },
    {
        "bowler-hatted": "bowler hat"
    },
    {
        " political drone and ruthlessly skewers him. All the self-importance, bureaucratic inefficiency and laughable circuitousness of ": null
    },
    {
        "Whitehall": "whitehall"
    },
    {
        " is summed up in one balletic extension of his slender leg.”         Chapman and Cleese also specialised in sketches where two characters would conduct highly articulate arguments over completely arbitrary subjects, such as in the cheese shop , the dead parrot sketch and ": null
    },
    {
        "Argument Clinic": "argument clinic"
    },
    {
        " , where Cleese plays a stone-faced bureaucrat employed to sit behind a desk and engage people in pointless, trivial bickering. Monty Python . The Complete Monty Pythons Flying Circus: All the Words, Volume 2. Pantheon Books. p. 86. All of these roles were opposite Palin —the comic contrast between the towering Cleeses crazed aggression and the shorter Palins shuffling inoffensiveness is a common feature in the series. Occasionally, the typical Cleese–Palin dynamic is reversed, as in ": null
    },
    {
        "Fish Licence": "fish licence"
    },
    {
        " , wherein Palin plays the bureaucrat with whom Cleese is trying to work.     Though Flying Circus lasted four series, by the start of series 3, Cleese was growing tired of dealing with Chapmans alcoholism. He felt, too, that the shows scripts had declined in quality. For these reasons, he became restless and decided to move on. Though he stayed for the third series, he officially left the group before the fourth season.  Cleese received a credit on three episodes of the fourth series which used material from these sessions, though he was officially unconnected with the fourth series. He remained friendly with the group, and all six began writing  Monty Python and the Holy Grail . Much of his work on Holy Grail remains widely quoted, including the ": null
    },
    {
        "Black Knight": "black knight"
    },
    {
        " scene.  Cleese returned to the troupe to co-write and co-star in two further Monty Python films,  Monty Pythons Life of Brian  and  Monty Pythons The Meaning of Life . His attack on Roman rule in Life of Brian – where he asks What have the Romans ever done for us? , before being met with a string of benefits including sanitation, roads and public order – was ranked the seventh funniest line in film in a 2002 poll.  Since the last Python film  Cleese has participated in various live performances with the group over the years.       From 1970 to 1973, Cleese served as ": null
    },
    {
        "rector of the University of St Andrews": "rector of the university of st andrews"
    },
    {
        ".  His election proved a milestone for the university, revolutionising and modernising the post. For instance, the rector was traditionally entitled to appoint an Assessor , a deputy to sit in his place at important meetings in his absence. Cleese changed this into a position for a student, elected across campus by the student body, resulting in direct access and representation for the student body.      Around this time, Cleese worked with comedian ": null
    },
    {
        "Les Dawson": "les dawson"
    },
    {
        " on his sketch/stand-up show  Sez Les . The differences between the two physically and socially  were marked, but both worked well together from series 8 onwards until the series ended in 1976.       In December 1977, Cleese appeared as a guest star on  The Muppet Show .  Cleese was a fan of the show and co-wrote much of the episode.  Cleese also made a cameo appearance in their 1981 film  The Great Muppet Caper  and won the  TV Times  award for Funniest Man on TV  – 1978–79.  In 1979, he starred in a TV special, ": null
    },
    {
        "To Norway, Home of Giants": "to norway, home of giants"
    },
    {
        ", produced by ": null
    },
    {
        "Johnny Bergh": "johnny bergh"
    },
    {
        ".     Throughout the 1970s, Cleese also produced and acted in a number of successful business training films, including  Meetings, Bloody Meetings , and  More Bloody Meetings . These were produced by his company ": null
    },
    {
        "Video Arts": "video arts"
    },
    {
        ". ,  The Independent , 5 January 1996     Fawlty Towers       Cleese achieved greater prominence in the United Kingdom as the neurotic hotel manager ": null
    },
    {
        "Basil Fawlty": "basil fawlty"
    },
    {
        " in Fawlty Towers, which he co-wrote with his wife ": null
    },
    {
        "Connie Booth": "connie booth"
    },
    {
        ". The series won three ": null
    },
    {
        "BAFTA": "bafta"
    },
    {
        " awards when produced and in 2000, it topped the ": null
    },
    {
        "British Film Institutes": "british film institute"
    },
    {
        "list of the ": null
    },
    {
        "100 Greatest British Television Programmes": "100 greatest british television programmes"
    },
    {
        ". In a 2001 poll conducted by ": null
    },
    {
        "Channel 4": "channel 4"
    },
    {
        " Basil Fawlty was ranked second  on their list of the ": null
    },
    {
        "100 Greatest TV Characters": "100 greatest"
    },
    {
        ".   The series also featured ": null
    },
    {
        "Prunella Scales": "prunella scales"
    },
    {
        " as Basils acerbic wife ": null
    },
    {
        "Sybil": "sybil fawlty"
    },
    {
        ", ": null
    },
    {
        "Andrew Sachs": "andrew sachs"
    },
    {
        " as the much abused Spanish waiter ": null
    },
    {
        "Manuel": "manuel"
    },
    {
        ", and Booth as waitress ": null
    },
    {
        "Polly": "polly sherman"
    },
    {
        ", the series voice of sanity. Cleese based Basil Fawlty on a real person, ": null
    },
    {
        "Donald Sinclair": "donald sinclair"
    },
    {
        ", whom he had encountered in 1970 while the Monty Python team were staying at the Gleneagles Hotel in ": null
    },
    {
        "Torquay": "torquay"
    },
    {
        " while filming inserts for their television series. Reportedly, Cleese was inspired by Sinclairs mantra, I could run this hotel just fine if it werent for the guests. He later described Sinclair as the most wonderfully rude man I have ever met, although Sinclairs widow has said her husband was totally misrepresented in the series. During the Pythons stay, Sinclair allegedly threw Idles briefcase out of the hotel in case it contained a bomb, complained about Gilliams American table manners, and threw a bus timetable at another guest after they dared to ask the time of the next bus to town.       The first series was screened from 19 September 1975 on ": null
    },
    {
        "BBC 2": "bbc two"
    },
    {
        ", initially to poor reviews,  but gained momentum when repeated on ": null
    },
    {
        "BBC 1": "bbc one"
    },
    {
        " the following year. Despite this, a second series did not air until 1979, by which time Cleeses marriage to Booth had ended, but they revived their collaboration for the second series. Fawlty Towers consisted of two seasons, each of only six episodes; Cleese and Booth both maintain that this was to avoid compromising the quality of the series. The popularity of Fawlty Towers has endured, and in addition to featuring high in greatest ever television show polls it is often re-broadcast. Mattha Busby, April 9, 2019, . The Guardian, Retrieved 24 May 2019 In a 2002 poll, Basils “": null
    },
    {
        "dont mention the war": "the germans"
    },
    {
        "” comment was ranked the second funniest line in television.       During the 1980s and 1990s, Cleese focused on film, though he did work with ": null
    },
    {
        "Peter Cook": "peter cook"
    },
    {
        " in his one-off TV special Peter Cook and Co. in 1980. In the same year, Cleese played ": null
    },
    {
        "Petruchio": "petruchio"
    },
    {
        ", in ": null
    },
    {
        "Shakespeares": "william shakespeare"
    },
    {
        "  The Taming of the Shrew  in the ": null
    },
    {
        "BBC Television Shakespeare": "bbc television shakespeare"
    },
    {
        " series. In 1981 he starred with ": null
    },
    {
        "Sean Connery": "sean connery"
    },
    {
        " and Michael Palin in the ": null
    },
    {
        "Terry Gilliam": "terry gilliam"
    },
    {
        "-directed  Time Bandits  as ": null
    },
    {
        "Robin Hood": "robin hood"
    },
    {
        ". He also participated in  Monty Python Live at the Hollywood Bowl  and starred in  The Secret Policemans Ball  for ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        ". In 1985, Cleese had a small dramatic role as a sheriff in  Silverado , which had an all-star cast that included ": null
    },
    {
        "Kevin Kline": "kevin kline"
    },
    {
        ", with whom he would star in  A Fish Called Wanda  three years later. In 1986, he starred in  Clockwise  as an uptight school headmaster obsessed with punctuality and constantly getting into trouble during a journey to speak at the ": null
    },
    {
        "Headmasters Conference": "headmasters conference"
    },
    {
        ". Timed with the 1987 UK elections, he appeared in a video promoting ": null
    },
    {
        "proportional representation": "proportional representation"
    },
    {
        ".         In 1988, he wrote and starred in  A Fish Called Wanda  as the lead, Archie Leach, along with ": null
    },
    {
        "Jamie Lee Curtis": "jamie lee curtis"
    },
    {
        ", ": null
    },
    {
        "Kevin Kline": "kevin kline"
    },
    {
        ", and Michael Palin. Wanda was a commercial and critical success, and Cleese was nominated for an ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " for his script. ": null
    },
    {
        "Cynthia Cleese": "cynthia cleese"
    },
    {
        " starred as Leachs daughter. Graham Chapman was diagnosed with ": null
    },
    {
        "throat cancer": "esophageal cancer"
    },
    {
        " in 1989; Cleese, Michael Palin, Peter Cook, and Chapmans partner ": null
    },
    {
        "David Sherlock": "david sherlock"
    },
    {
        ", witnessed Chapmans death. Chapmans death occurred a day before the 20th anniversary of the first broadcast of Flying Circus, with Jones commenting, the worst case of party-pooping in all history. Cleese gave a eulogy at Chapmans memorial service.       Cleese would later play a supporting role in ": null
    },
    {
        "Kenneth Branaghs": "kenneth branagh"
    },
    {
        "adaptation of  Mary Shelleys Frankenstein  alongside Branagh himself and ": null
    },
    {
        "Robert De Niro": "robert de niro"
    },
    {
        ". With ": null
    },
    {
        "Robin Skynner": "robin skynner"
    },
    {
        ", the ": null
    },
    {
        "group analyst": "group analysis"
    },
    {
        " and ": null
    },
    {
        "family therapist": "family therapy"
    },
    {
        ", Cleese wrote two books on relationships:  Families and How to Survive Them , and  Life and How to Survive It . The books are presented as a dialogue between Skynner and Cleese.     The follow-up to A Fish Called Wanda,  Fierce Creatures —which again starred Cleese alongside Kevin Kline, Jamie Lee Curtis, and Michael Palin—was released in 1997, but was greeted with mixed reception by critics and audiences. Cleese has since often stated that making the second film had been a mistake. When asked by his friend, director and restaurant critic ": null
    },
    {
        "Michael Winner": "michael winner"
    },
    {
        ", what he would do differently if he could live his life again, Cleese responded, I wouldnt have married ": null
    },
    {
        "Alyce Faye Eichelberger": "alyce faye eichelberger"
    },
    {
        " and I wouldnt have made Fierce Creatures.      In 1999, Cleese appeared in the ": null
    },
    {
        "James Bond": "james bond"
    },
    {
        " film,  The World Is Not Enough  as ": null
    },
    {
        "Qs": "q"
    },
    {
        " assistant, referred to by Bond as R . In 2002, when Cleese reprised his role in  Die Another Day , the character was promoted, making Cleese the new quartermaster of ": null
    },
    {
        "MI6": "mi6"
    },
    {
        ". In 2004, Cleese was featured as Q in the video game  James Bond 007: Everything or Nothing , featuring his likeness and voice.  Cleese did not appear in the subsequent Bond films,  Casino Royale ,  Quantum of Solace  and  Skyfall ; in the latter film, ": null
    },
    {
        "Ben Whishaw": "ben whishaw"
    },
    {
        " was cast in the role of Q.       Cleese is Provosts Visiting Professor at ": null
    },
    {
        "Cornell University": "cornell university"
    },
    {
        ", after having been ": null
    },
    {
        "Andrew D. White": "andrew d. white"
    },
    {
        " Professor-at-Large from 1999 to 2006. He makes occasional well-received appearances on the Cornell campus. In 2001, Cleese was cast in the comedy  Rat Race  as the eccentric hotel owner Donald P. Sinclair, the name of the ": null
    },
    {
        "Torquay": "torquay"
    },
    {
        " hotel owner on whom he had based the character of Basil Fawlty. In 2002, Cleese made a cameo appearance in the film  The Adventures of Pluto Nash  in which he played James , a computerised chauffeur of a hover car stolen by the title character . The vehicle is subsequently destroyed in a chase, leaving the chauffeur stranded in a remote place on the moon. In 2003, Cleese appeared as Lyle Finster on the US sitcom  Will & Grace . His characters daughter, Lorraine, was played by ": null
    },
    {
        "Minnie Driver": "minnie driver"
    },
    {
        ". In the series, Lyle Finster briefly marries ": null
    },
    {
        "Karen Walker": "karen walker"
    },
    {
        " . In 2004, Cleese was credited as co-writer of a ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " graphic novel": "graphic novel"
    },
    {
        " titled  Superman: True Brit .  Part of DCs ": null
    },
    {
        "Elseworlds": "elseworlds"
    },
    {
        " line of imaginary stories, True Brit, mostly written by ": null
    },
    {
        "Kim Howard Johnson": "kim howard johnson"
    },
    {
        ", suggests what might have happened had ": null
    },
    {
        "Supermans": "superman"
    },
    {
        "rocket ship landed in Britain, not America.     From 10 November to 9 December 2005, Cleese toured New Zealand with his stage show, John Cleese—His Life, Times and Current Medical Problems. Cleese described it as a ": null
    },
    {
        "one-man show": "one-man show"
    },
    {
        " with several people in it, which pushes the envelope of acceptable behaviour in new and disgusting ways . The show was developed in New York City with ": null
    },
    {
        "William Goldman": "william goldman"
    },
    {
        " and includes Cleeses daughter Camilla as a writer and actor . His assistant of many years, Garry Scott-Irvine, also appeared and was listed as a co-producer. The show then played in universities in California and ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        " from 10 January to 25 March 2006 under the title Seven Ways to Skin an Ocelot .  His voice can be downloaded for directional guidance purposes as a downloadable option on some personal ": null
    },
    {
        "GPS": "global positioning system"
    },
    {
        "-navigation device models by company ": null
    },
    {
        "TomTom": "tomtom"
    },
    {
        ".     In a 2005 poll of comedians and comedy insiders, The Comedians Comedian, Cleese was voted second to ": null
    },
    {
        "Peter Cook": "peter cook"
    },
    {
        ".   Also in 2005, a long-standing piece of Internet humour, The Revocation of Independence of the United States , was wrongly attributed to Cleese. In 2006, Cleese hosted a television special of footballs greatest kicks, goals, saves, bloopers, plays, and penalties, as well as footballs influence on culture , featuring interviews with pop culture icons ": null
    },
    {
        "Dave Stewart": "david a. stewart"
    },
    {
        ", ": null
    },
    {
        "Dennis Hopper": "dennis hopper"
    },
    {
        ", and ": null
    },
    {
        "Henry Kissinger": "henry kissinger"
    },
    {
        ", as well as eminent footballers including ": null
    },
    {
        "Pelé": "pelé"
    },
    {
        ", ": null
    },
    {
        "Mia Hamm": "mia hamm"
    },
    {
        ", and ": null
    },
    {
        "Thierry Henry": "thierry henry"
    },
    {
        ". The Art of Soccer with John Cleese  was released in North America on DVD in January 2009 by BFS Entertainment & Multimedia. Also in 2006, Cleese released the song ": null
    },
    {
        "Dont Mention the World Cup": "dont mention the world cup"
    },
    {
        " .       Cleese lent his voice to the ": null
    },
    {
        "BioWare": "bioware"
    },
    {
        " video game  Jade Empire . His role was that of an outlander named Sir Roderick Ponce von Fontlebottom the Magnificent Bastard, stranded in the Imperial City of the Jade Empire. His character is essentially a British ": null
    },
    {
        "colonialist": "colonialism"
    },
    {
        " stereotype who refers to the people of the Jade Empire as savages in need of enlightenment . His armour has the design of a fork stuck in a piece of cheese. In 2007, Cleese appeared in ads for ": null
    },
    {
        "Titleist": "titleist"
    },
    {
        " as a golf course designer named Ian MacCallister , who represents Golf Designers Against Distance . Also in 2007, he started filming the sequel to  The Pink Panther , titled  The Pink Panther 2 , with ": null
    },
    {
        "Steve Martin": "steve martin"
    },
    {
        " and ": null
    },
    {
        "Aishwarya Rai": "aishwarya rai"
    },
    {
        ".     Cleese collaborated with ": null
    },
    {
        "Los Angeles Guitar Quartet": "los angeles guitar quartet"
    },
    {
        " member ": null
    },
    {
        "William Kanengiser": "william kanengiser"
    },
    {
        " in 2008 on the text to the performance piece The Ingenious Gentleman of La Mancha . Cleese, as narrator, and the LAGQ premiered the work in ": null
    },
    {
        "Santa Barbara": "santa barbara county, california"
    },
    {
        ". 2008 also saw reports of Cleese working on a musical version of A Fish Called Wanda with his daughter Camilla.     At the end of March 2009, Cleese published his first article as Contributing Editor to  The Spectator : The real reason I had to join The Spectator .  Cleese has also hosted comedy galas at the ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        " Just for Laughs": "just for laughs"
    },
    {
        " comedy festival in 2006, and again in 2009. Towards the end of 2009 and into 2010, Cleese appeared in a series of television adverts for the Norwegian electric goods shop chain, ": null
    },
    {
        "Elkjøp": "elkjøp"
    },
    {
        ".  In March 2010 it was announced that Cleese would be playing Jasper in the video game  Fable III .         In 2009 and 2010, Cleese toured ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        " and the US with his Alimony Tour Year One and Year Two. In May 2010, it was announced that this tour would extend to the UK , set for May 2011. The show is dubbed the Alimony Tour in reference to the financial implications of Cleeses divorce. The UK tour started in ": null
    },
    {
        "Cambridge": "cambridge"
    },
    {
        " on 3 May, visiting ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        ", ": null
    },
    {
        "Nottingham": "nottingham"
    },
    {
        ", ": null
    },
    {
        "Salford": "salford, greater manchester"
    },
    {
        ", ": null
    },
    {
        "York": "york"
    },
    {
        ", Liverpool, ": null
    },
    {
        "Leeds": "leeds"
    },
    {
        ", Glasgow, ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", ": null
    },
    {
        "Oxford": "oxford"
    },
    {
        ", Bristol and ": null
    },
    {
        "Bath": "bath"
    },
    {
        " .  Later in 2011 John took his Alimony Tour to South Africa. He played ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        " on the 21 & 22 October before moving over to ": null
    },
    {
        "Johannesburg": "johannesburg"
    },
    {
        " where he played from 25 to 30 October. In January 2012 he took his one-man show to Australia, starting in Perth on 22 Jan and throughout the next 4 months visited ": null
    },
    {
        "Adelaide": "adelaide"
    },
    {
        ", ": null
    },
    {
        "Brisbane": "brisbane"
    },
    {
        ", ": null
    },
    {
        "Gold Coast": "city of gold coast"
    },
    {
        ", ": null
    },
    {
        "Newcastle, New South Wales": "newcastle, new south wales"
    },
    {
        ", ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        ", Sydney, and finished up during April in ": null
    },
    {
        "Canberra": "canberra"
    },
    {
        ".     In October 2010, Cleese was featured in the launch of an advertising campaign by ": null
    },
    {
        "The Automobile Association": "the automobile association"
    },
    {
        " for a new home emergency response product.  He appeared as a man who believed the AA could not help him during a series of disasters, including water pouring through his ceiling, with the line The AA? For faulty showers? During 2010, Cleese appeared in a series of radio advertisements for the Canadian insurance company ": null
    },
    {
        "Pacific Blue Cross": "pacific blue cross"
    },
    {
        ", in which he plays a character called Dr. Nigel Bilkington, Chief of Medicine for American General Hospital .       In 2012, Cleese was cast in Hunting Elephants, a ": null
    },
    {
        "heist": "heist film"
    },
    {
        " comedy by ": null
    },
    {
        "Israeli": "israelis"
    },
    {
        " filmmaker Reshef Levi. Cleese had to quit just prior to filming due to heart trouble and was replaced by ": null
    },
    {
        "Patrick Stewart": "patrick stewart"
    },
    {
        ".    Between September and October 2013, Cleese embarked on his first-ever cross-Canada comedy tour. Entitled John Cleese: Last Time to See Me Before I Die tour , he visited Halifax, ": null
    },
    {
        "Ottawa": "ottawa"
    },
    {
        ", Toronto, ": null
    },
    {
        "Edmonton": "edmonton"
    },
    {
        ", Calgary, ": null
    },
    {
        "Victoria": "victoria"
    },
    {
        " and finished in ": null
    },
    {
        "Vancouver": "vancouver"
    },
    {
        ", performing to mostly sold-out venues.  Cleese returned to the stage in ": null
    },
    {
        "Dubai": "dubai"
    },
    {
        " in November 2013, where he performed to a sold-out theatre.      Cleese was interviewed and appears as himself in filmmaker ": null
    },
    {
        "Gracie Ottos": "gracie otto"
    },
    {
        "2013 documentary film  The Last Impresario , about Cleeses longtime friend and colleague ": null
    },
    {
        "Michael White": "michael white"
    },
    {
        ". White produced  Monty Python and the Holy Grail  and Cleeses pre-Python comedy production  Cambridge Circus .  At a comic press conference in November 2013, Cleese and other surviving members of the ": null
    },
    {
        "Monty Python": "monty python"
    },
    {
        " comedy group announced a reuniting performance to be held in July 2014.      Cleese joined with Eric Idle in 2015 and 2016 for a tour of North America, Canada and the ANZUS nations, John Cleese & Eric Idle: Together Again At Last . . . For The Very First Time, playing small theatres and including interaction with audiences as well as sketches and reminisces.  In a ": null
    },
    {
        "Reddit": "reddit"
    },
    {
        " Ask Me Anything interview, Cleese expressed regret that he had turned down the role played by ": null
    },
    {
        "Robin Williams": "robin williams"
    },
    {
        " in  The Birdcage , the butler played by ": null
    },
    {
        "Anthony Hopkins": "anthony hopkins"
    },
    {
        " in  The Remains of the Day , and the clergyman played by ": null
    },
    {
        "Peter Cook": "peter cook"
    },
    {
        " in  The Princess Bride .        In his Alimony Tour Cleese explained the origin of his fondness for ": null
    },
    {
        "black humour": "black humour"
    },
    {
        ", the only thing that he inherited from his mother. Examples of it are the ": null
    },
    {
        "Dead Parrot sketch": "dead parrot sketch"
    },
    {
        ", ": null
    },
    {
        "The Kipper and the Corpse": "the kipper and the corpse"
    },
    {
        " episode of Fawlty Towers, his clip for the 1992 BBC2 mockumentary A Question of Taste , the ": null
    },
    {
        "Undertakers sketch": "undertakers sketch"
    },
    {
        ", and ": null
    },
    {
        "his eulogy": "dead parrot sketchfurther uses"
    },
    {
        " at Graham Chapmans memorial service.      Cleese blamed his mother, who lived to the age of 101, for his problems in relationships with women, saying: It cannot be a coincidence that I spent such a large part of my life in some form of therapy and that the vast majority of the problems I was dealing with involved relationships with women.             Cleese have contributed their services to charitable endeavours and causes—sometimes as an ensemble, at other times as individuals. The cause that has been the most frequent and consistent beneficiary has been the human rights work of ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        " via the  Secret Policemans Ball  benefit shows. The idea of the Ball was conceived by Cleese, with Huffington Post stating “in 1976 he “friended” the then-struggling Amnesty International first with a cheque signed “J. Cleese” — and then by rounding up “a few friends” to put on a show.” Many musicians have publicly attributed their activism—and the organisation of their own ": null
    },
    {
        "benefit events": "benefit concert"
    },
    {
        "—to the inspiration of the work in this field of Cleese and the rest of Python, such as ": null
    },
    {
        "Bob Geldof": "bob geldof"
    },
    {
        " , ": null
    },
    {
        "U2": "u2"
    },
    {
        ", ": null
    },
    {
        "Pete Townshend": "pete townshend"
    },
    {
        ", and ": null
    },
    {
        "Sting": "sting"
    },
    {
        ". . The Guardian. Retrieved 24 September 2019 On the impact of the Ball on Geldof, Sting states, “he took the ‘Ball’ and ran with it.”     Cleese is a long-standing supporter of the ": null
    },
    {
        "Liberal Democrats": "liberal democrats"
    },
    {
        ".  Having previously been a ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        " voter, Cleese switched to the ": null
    },
    {
        "SDP": "social democratic party"
    },
    {
        " after their formation in 1981. During the ": null
    },
    {
        "1987 general election": "1987 united kingdom general election"
    },
    {
        ", Cleese recorded a nine-minute party political broadcast for the ": null
    },
    {
        "SDP–Liberal Alliance": "sdp–liberal alliance"
    },
    {
        ", which spoke about the similarities and failures of the other two parties in a more humorous tone than standard political broadcasts. Cleese has since appeared in broadcasts for the Liberal Democrats, in the ": null
    },
    {
        "1997 general election": "1997 united kingdom general election"
    },
    {
        " and narrating a radio election broadcast for the party during the ": null
    },
    {
        "2001 general election": "2001 united kingdom general election"
    },
    {
        ".      In 2008, Cleese expressed support for ": null
    },
    {
        "Barack Obama": "barack obama"
    },
    {
        " and his ": null
    },
    {
        "presidential candidacy": "barack obama presidential campaign, 2008"
    },
    {
        ", offering his services as a speech writer.  He was an outspoken critic of ": null
    },
    {
        "Republican": "republican party"
    },
    {
        " Vice-Presidential candidate ": null
    },
    {
        "Sarah Palin": "sarah palin"
    },
    {
        ", saying that Michael Palin is no longer the funniest Palin .  The same year, he wrote a satirical poem about ": null
    },
    {
        "Fox News": "fox news"
    },
    {
        " commentator ": null
    },
    {
        "Sean Hannity": "sean hannity"
    },
    {
        " for  Countdown with Keith Olbermann .   Daily Kos.     In 2011, Cleese declared his appreciation for Britains coalition government between the ": null
    },
    {
        "Conservatives": "conservative party"
    },
    {
        " and Liberal Democrats, saying: I think whats happening at the moment is rather interesting. The Coalition has made everything a little more courteous and a little more flexible. I think it was quite good that the Liberal Democrats had to compromise a bit with the Tories. He also criticised the previous ": null
    },
    {
        "Labour": "new labour"
    },
    {
        " government, commenting: Although my inclinations are slightly ": null
    },
    {
        "left-of-centre": "centre-left politics"
    },
    {
        ", I was terribly disappointed with the last Labour government. ": null
    },
    {
        "Gordon Brown": "gordon brown"
    },
    {
        " lacked emotional intelligence and was never a leader. Cleese also declared his support for ": null
    },
    {
        "proportional representation": "proportional representation"
    },
    {
        ".      In April 2011, Cleese said that he had declined a ": null
    },
    {
        "life peerage": "life peerage"
    },
    {
        " for political services in 1999. Outgoing leader of the Liberal Democrats ": null
    },
    {
        "Paddy Ashdown": "paddy ashdown"
    },
    {
        " had put forward the suggestion shortly before stepping down, with the idea that Cleese would take the party whip and sit as a working peer, but the actor quipped that he realised this involved being in England in the winter and I thought that was too much of a price to pay. Cleese also declined a ": null
    },
    {
        "CBE title": "order of the british empire"
    },
    {
        " in 1996 as he thought, they were silly.      In an interview with  The Daily Telegraph  in 2014, Cleese expressed political interest about the ": null
    },
    {
        "UK Independence Party": "uk independence party"
    },
    {
        ", saying that although he was in doubt as to whether he was prepared to vote for it, he was attracted to its challenge to the established political order and the radicalism of its policies on the United Kingdoms membership of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ". He expressed support for immigration, but also concern about the integration of immigrants into British culture.      Talking to  Der Spiegel  in 2015, Cleese expressed a critical view on what he saw as a ": null
    },
    {
        "plutocracy": "plutocracy"
    },
    {
        " that was unhealthily developing control of the governance of the ": null
    },
    {
        "First Worlds": "first world"
    },
    {
        "societies, stating that he had reached a point when he saw that our existence here is absolutely hopeless. I see the rich have got a stranglehold on us. If somebody had said that to me when I was 20, I would have regarded him as a ": null
    },
    {
        "left-wing loony": "loony left"
    },
    {
        ".     In 2016, Cleese publicly supported ": null
    },
    {
        "Brexit": "brexit"
    },
    {
        " in the ": null
    },
    {
        "2016 referendum": "2016 united kingdom european union membership referendum"
    },
    {
        " on leaving the European Union.  He tweeted: If I thought there was any chance of major reform in the EU, Id vote to stay in. But there isnt. Sad. Cleese said that EU bureaucrats had taken away any trace of democratic accountability and suggested they should give up the ": null
    },
    {
        "euro": "euro"
    },
    {
        ", introduce accountability.  In July 2018, Cleese said that he was leaving the UK to relocate to the Caribbean island of ": null
    },
    {
        "Nevis": "nevis"
    },
    {
        ", partly over frustration around the standard of the Brexit debate, including dreadful lies by ": null
    },
    {
        "the right": "right-wing politics"
    },
    {
        " and a lack of reform regarding the press and the voting system.  He emigrated to Nevis on 1 November 2018.      During then-Republican nominee ": null
    },
    {
        "Donald Trumps": "donald trump"
    },
    {
        "run for the US Presidency in 2016, Cleese described Trump as a narcissist, with no attention span, who doesnt have clear ideas about anything and makes it all up as he goes along .  He had previously described the leadership of the Republican Party as the most cynical, most disgracefully immoral people Ive ever come across in a Western civilisation .     In May 2019, Cleese repeated his previous statement that London was no longer an English city, saying virtually all my friends from abroad have confirmed my observation. So there must be some truth in it... I note also that London was the UK city that voted most strongly to remain in the EU. ": null
    },
    {
        "London Mayor": "london mayor"
    },
    {
        " Sadiq Khan": "sadiq khan"
    },
    {
        " responded, These comments make John Cleese sound like hes in character as ": null
    },
    {
        "Basil Fawlty": "basil fawlty"
    },
    {
        ". Londoners know that our diversity is our greatest strength. We are proudly the English capital, a European city and a global hub. Cleese added, I suspect I should apologise for my affection for the Englishness of my upbringing, but in some ways I found it calmer, more polite, more humorous, less tabloid, and less money-oriented than the one that is replacing it.        In 1992, the UK Health Education Authority  recruited Cleese—an ex-smoker—to star in a series of anti-smoking ": null
    },
    {
        "public service announcements": "public service announcements"
    },
    {
        " on British television, which took the form of sketches rife with morbid humor about smoking and were designed to encourage adult smokers to quit.  In a controlled study of regions of central and northern England, one region received no intervention, the PSAs were broadcast in two regions, and one region received both the PSAs plus locally organised anti-tobacco campaigning. The study found that smokers in regions where the PSAs were broadcast were about half again as likely to have quit at the 18-month follow-up point as those who did not see them, irrespective of the local anti-tobacco campaign.       Cleese met ": null
    },
    {
        "Connie Booth": "connie booth"
    },
    {
        " in the US and they married in 1968. In 1971, Booth gave birth to Cynthia Cleese, their only child. With Booth, Cleese wrote the scripts for and co-starred in both series of Fawlty Towers, even though the two were actually divorced before the second series was finished and aired. Cleese and Booth are said to have remained close friends since. Cleese has two grandchildren, Evan and Olivia, through his eldest daughters marriage to ": null
    },
    {
        "Ed Solomon": "ed solomon"
    },
    {
        ".     Cleese married American actress ": null
    },
    {
        "Barbara Trentham": "barbara trentham"
    },
    {
        " in 1981. Their daughter Camilla, Cleeses second child, was born in 1984. He and Trentham divorced in 1990. During this time, Cleese moved to ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ".     In 1992, he married American psychotherapist ": null
    },
    {
        "Alyce Faye Eichelberger": "alyce faye eichelberger"
    },
    {
        ". They divorced in 2008. The divorce settlement left Eichelberger with ": null
    },
    {
        "£": "pound sterling"
    },
    {
        "12  million in finance and assets, including £600,000 a year for seven years. Cleese said, What I find so unfair is that if we both died today, her children would get much more than mine ... I got off lightly. Think what Id have had to pay Alyce if she had contributed anything to the relationship – such as children, or a conversation.      Less than a year later, he returned to the UK, where he has property in London and a home on the ": null
    },
    {
        "Royal Crescent": "royal crescent"
    },
    {
        " in ": null
    },
    {
        "Bath, Somerset": "bath, somerset"
    },
    {
        ".   In August 2012, Cleese married English jewellery designer and former model Jennifer Wade in a ceremony on the Caribbean island of ": null
    },
    {
        "Mustique": "mustique"
    },
    {
        ".      In March 2015, in an interview with  Der Spiegel , he was asked if he was religious. Cleese stated that he did not think much of organised religion and said he was not committed to anything except the vague feeling that there is something more going on than the materialist reductionist people think .  . Retrieved 31 March 2015     Cleese has a passion for ": null
    },
    {
        "lemur": "lemur"
    },
    {
        "s.   Following the 1997 comedy film Fierce Creatures, in which the ": null
    },
    {
        "ring-tailed lemur": "ring-tailed lemur"
    },
    {
        " played a key role, he hosted the 1998 ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " documentary In the Wild: Operation Lemur with John Cleese, which tracked the progress of a ": null
    },
    {
        "reintroduction": "reintroduction"
    },
    {
        " of ": null
    },
    {
        "black-and-white ruffed lemurs": "black-and-white ruffed lemur"
    },
    {
        "back into the ": null
    },
    {
        "Betampona Reserve": "betampona reserve"
    },
    {
        " in Madagascar. The project had been partly funded by Cleeses donation of the proceeds from the London premier of Fierce Creatures.  Cleese is quoted as saying, I adore lemurs. Theyre extremely gentle, well-mannered, pretty and yet great fun  ... I should have married one.     The ": null
    },
    {
        "Bemaraha woolly lemur": "bemaraha woolly lemur"
    },
    {
        " , also known as Cleeses woolly lemur, is native to western Madagascar. The scientist who discovered the species named it after Cleese, mainly because of Cleeses fondness for lemurs and his efforts at protecting and preserving them. The species was first discovered in 1990 by a team of scientists from ": null
    },
    {
        "Zurich University": "university of zurich"
    },
    {
        " led by Urs Thalmann, but was not formally described as a species until 11 November 2005.                                              ": null
    },
    {
        "lemur": "lemur"
    },
    {
        ", the ": null
    },
    {
        "Bemaraha woolly lemur": "bemaraha woolly lemur"
    },
    {
        " , has been named in his honour. John Cleese has mentioned this in television interviews. Also there is mention of this honour in New Scientist —and John Cleeses response to the honour.    An asteroid, ": null
    },
    {
        "9618 Johncleese": "9618 johncleese"
    },
    {
        ", is named in his honour.   Cleese declined a ": null
    },
    {
        "CBE": "cbe"
    },
    {
        " in 1996.   There is a municipal rubbish heap of  in altitude that has been named Mt Cleese at the ": null
    },
    {
        "Awapuni": "awapuni, palmerston north"
    },
    {
        " landfill just outside ": null
    },
    {
        "Palmerston North": "palmerston north"
    },
    {
        " after he dubbed the city suicide capital of New Zealand after a stay there in 2005.  . The Australian, 21 May 2007    The Universal Language skit from  All in the Timing , a collection of short plays by ": null
    },
    {
        "David Ives": "david ives"
    },
    {
        ", centres around a fictional language in which the word for the English language is johncleese .   The post-hardcore rock band ": null
    },
    {
        "I Set My Friends on Fire": "i set my friends on fire"
    },
    {
        " has a song on their  You Cant Spell Slaughter Without Laughter  album titled Reeses Pieces, I Dont Know Who John Cleese Is? .       ; University Degrees          ; Chancellor, visitor, governor, rector, and fellowships          ;Honorary Degrees         The Rectorial Address of John Cleese, Epam, 1971, 8 pages   Cleese Encounters: The Unauthorized Biography of Monty Python Veteran John Cleese, Jonathan Margolis, St. Martins Press, 1992,  The Human Face     Foreword for Time and the Soul, ": null
    },
    {
        "Jacob Needleman": "jacob needleman"
    },
    {
        ", 2003,     Superman: True Brit , ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        ", 2004,  So, Anyway..., 2014, ": null
    },
    {
        "Crown Archetype": "crown archetype"
    },
    {
        ",  Professor at Large: The Cornell Years, 2018, ": null
    },
    {
        "Cornell University Press": "cornell university press"
    },
    {
        ",   Families and How to Survive Them , w/": null
    },
    {
        "Robin Skynner": "robin skynner"
    },
    {
        ", 1983     ,     Life and How to Survive It , w/Robin Skynner 1993     , ": null
    }
]