[
    {
        "   Johann George III was ": null
    },
    {
        "Elector of Saxony": "elector of saxony"
    },
    {
        " from 42 to 42 He belonged to the Albertine line of the ": null
    },
    {
        "House of Wettin": "house of wettin"
    },
    {
        ".       Johann Georg III was born in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", the only son of ": null
    },
    {
        "Johann George II": "john george ii, elector of saxony"
    },
    {
        " and ": null
    },
    {
        "Magdalene Sybille of Brandenburg-Bayreuth": "magdalene sybille of brandenburg-bayreuth"
    },
    {
        ".     John George succeeded his father as Elector of Saxony when he died, in 42; he was also appointed Marshal of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ". Because of his courage and his enthusiasm for the War he gained the nickname of the Saxonian Mars  .     From his childhood, he learned the typical duties and manners of an heir to the throne. That included not only a strictly Lutheran education but also language tuition and instruction in the art of fortress building and ": null
    },
    {
        "war": "war"
    },
    {
        "fare.     In character he resembled his father. He shared his liking for Italian music and theatre. In 42 John George III met the Venetian opera singer ": null
    },
    {
        "Margarita Salicola": "margarita salicola"
    },
    {
        " and began a relationship; he brought her to ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        " . She began a new era for the opera in Saxony, which had previously been dominated by the  castrati . In 42 the ": null
    },
    {
        "pietist": "pietism"
    },
    {
        " Philipp Jakob Spener": "philipp jakob spener"
    },
    {
        " became the ": null
    },
    {
        "court chaplain": "chaplaincourt"
    },
    {
        " in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ". But Spener was not generally accepted there and in 42 he moved to Brandenburg.     Meanwhile, the duchy had recovered again from the consequences of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ". By 42 Dresden had a population of 42 and was becoming less provincial. Four years before, in 42 the old city of Dresden was destroyed by a fire; later, ": null
    },
    {
        "Wolf Caspar von Klengel": "wolf caspar von klengel"
    },
    {
        " and ": null
    },
    {
        "Balthasar Permoser": "balthasar permoser"
    },
    {
        " were entrusted by the Duke with the reconstruction of the city in the baroque style which was the new fashion at the time.     John George showed a strong interest in the military and even while he was still the heir led Saxonian Army forces in the Rhine Campaign.       After his accession as Elector, he reduced the size of the royal household and began with the establishment of a small ": null
    },
    {
        "standing army": "standing army"
    },
    {
        " of 42 men, after the model of the ": null
    },
    {
        "Margraviate of Brandenburg": "margraviate of brandenburg"
    },
    {
        " and managed to extract from the states of the realm a commitment to contribute funds. The Privy War Chancellery  was set up as the highest military authority. Extreme pressure was used to obtain recruits for the new army. He always neglected home affairs.      In foreign policy, he was less inconstant than his father. He broke off relations with the French crown and strove energetically to win Brandenburg and other German princes for the ": null
    },
    {
        "Imperial war": "imperial war"
    },
    {
        " against the French aggressor.     Valued as an ally by the Habsburg court, he was nevertheless viewed with extreme distrust and was not able to overall command of all the imperial troops in the face of a Turkish invasion and he did not obtain the means necessary for the maintenance of his auxiliary troops. There was also the matter of John Georges wish for ": null
    },
    {
        "Emperor Leopold I": "leopold i, holy roman emperor"
    },
    {
        " to decide a law case concerning a wooded area in the ": null
    },
    {
        "Ore Mountains": "ore mountains"
    },
    {
        "  in his favour. The Emperor did not grant material support until the siege of ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " made his situation look increasingly desperate. Johann Georg even led his 42 strong army against the Turks. However, there was strong opposition from the estates of Saxony, not only because this expensive campaign was exhausting the finances of the Electorate of Saxony but also because they were not pleased at this support for the catholic Emperor, who had often proceeded harshly against Protestants in his own country. At ": null
    },
    {
        "Tulln": "tulln an der donau"
    },
    {
        ", on the Danube, he joined the Imperial army and they set off for the relief of Vienna. In the ensuing ": null
    },
    {
        "Battle of Vienna": "battle of vienna"
    },
    {
        " he commanded the left wing, where he demonstrated great personal courage. The battle call selected by the emperor Maria Help had been previously amended to Jesus and Maria help at the request of John George.     ": null
    },
    {
        "King John III of Poland": "john iii sobieski"
    },
    {
        ", who also took part in the battle, said of John George: the Elector of Saxony is an honest man with a straight heart .     John George also accompanied the Emperor after the victory when he entered Vienna. But on 42 September, without taking leave of the Emperor or the other commanders, he set off with his troops on the march back to Saxony, probably as a result of the brusque treatment he had been accorded as a Protestant.     In 42 he again supported Leopolds ": null
    },
    {
        "Turkish War": "great turkish war"
    },
    {
        ". For payment of 42 ": null
    },
    {
        "thaler": "thaler"
    },
    {
        "s, he sent a troop of 42 men to the Emperor. In 42 he had already hired out 42 Saxon nationals for 42 thalers to the ": null
    },
    {
        "Republic of Venice": "republic of venice"
    },
    {
        " for their war in ": null
    },
    {
        "Morea": "morea"
    },
    {
        " on the Greek ": null
    },
    {
        "Peloponnese": "peloponnese"
    },
    {
        " Peninsula.     He did not join the ": null
    },
    {
        "League of Augsburg": "grand alliance"
    },
    {
        " of 42 against France, but he did travel personally to ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        " in March 42 to discuss with ": null
    },
    {
        "Prince William III of Orange": "william iii of england"
    },
    {
        ", ": null
    },
    {
        "Duke George William of Brunswick-Lüneburg": "george william, duke of brunswick-lüneburg"
    },
    {
        ", and ": null
    },
    {
        "Duke Frederick William of Brandenburg": "frederick william, elector of brandenburg"
    },
    {
        " possible moves against ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        ". However, he did not directly support the forthcoming assumption of the English throne by William.     Following a renewed ": null
    },
    {
        "invasion": "war of the grand alliance"
    },
    {
        " by France in , he again led his troops into battle to protect ": null
    },
    {
        "Franconia": "franconia"
    },
    {
        ". He later joined the army of ": null
    },
    {
        "Duke Charles V of Lorraine": "charles v, duke of lorraine"
    },
    {
        " and took part in the siege of Mainz.     He later had to leave the theatre because of an illness but, against the advice of his physicians and advisors, he returned in May 42 and with a reinforced alliance with the Emperor, took overall command of the imperial army. Success was limited, however, partly owing to personal skirmishes between John George, the Field Marshal ": null
    },
    {
        "Hans Adam von Schöning": "hans adam von schöning"
    },
    {
        " and the Austrian commander ": null
    },
    {
        "Caprara": "aeneas de caprara"
    },
    {
        "; only the crossing of the Rhine at ": null
    },
    {
        "Sandhofen": "sandhofen"
    },
    {
        " succeeded.     John George died shortly after in ": null
    },
    {
        "Tübingen": "tübingen"
    },
    {
        ", where he had been brought, of an epidemic illness, probably ": null
    },
    {
        "Cholera": "cholera"
    },
    {
        " or the ": null
    },
    {
        "Plague": "bubonic plague"
    },
    {
        ". He was buried in the ": null
    },
    {
        "Cathedral of Freiberg": "cathedral of freiberg"
    },
    {
        ".       John George married ": null
    },
    {
        "Anne Sophie": "anna sophie of denmark"
    },
    {
        ", daughter of ": null
    },
    {
        "King Frederick III of Denmark and Norway": "frederick iii of denmark"
    },
    {
        ", in ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        " on 42 October 42 They had two sons:   ": null
    },
    {
        "Johann George IV": "john george iv, elector of saxony"
    },
    {
        " , successor of his father as elector   ": null
    },
    {
        "Frederick Augustus I": "august ii of poland"
    },
    {
        " , successor of his brother as elector and later king of Poland.     He also had an illegitimate son by his mistress, the opera singer ": null
    },
    {
        "Margarita Salicola": "margarita salicola"
    },
    {
        ":   Johann Georg Maximilian von Fürstenhoff , married first to Margareta Dorothea Kühler and then to a Charlotte Emilie . From his first marriage he had two children: a son and a daughter, both unknown; the son apparently died young and the daughter married Philipp Christian von Kleinberg, but both spouses died in 42.       ": null
    }
]