[
    {
        "     John Stevens Cabot Abbott , an American historian, pastor, and pedagogical writer, was born in ": null
    },
    {
        "Brunswick, Maine": "brunswick, maine"
    },
    {
        " to Jacob and Betsey Abbott.       He was a brother of ": null
    },
    {
        "Jacob Abbott": "jacob abbott"
    },
    {
        ", and was associated with him in the management of ": null
    },
    {
        "Abbotts Institute": "abbotts institute"
    },
    {
        ", New York City, and in the preparation of his series of brief historical biographies. Dr. Abbott graduated at ": null
    },
    {
        "Bowdoin College": "bowdoin college"
    },
    {
        " in 1825, prepared for the ministry at ": null
    },
    {
        "Andover Theological Seminary": "andover theological seminary"
    },
    {
        ", and between 1830 and 1844, when he retired from the ministry in the ": null
    },
    {
        "Congregational Church": "puritan"
    },
    {
        ", preached successively at ": null
    },
    {
        "Worcester": "worcester, massachusetts"
    },
    {
        ", ": null
    },
    {
        "Roxbury": "roxbury, massachusetts"
    },
    {
        " and ": null
    },
    {
        "Nantucket": "nantucket, massachusetts"
    },
    {
        ", all in ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ".       Owing to the success of a little work, The Mother at Home, he devoted himself, from 1844 onwards, to literature. He was a voluminous writer of books on Christian ethics, and of popular histories, which were credited with cultivating a popular interest in history. He is best known as the author of the widely popular History of Napoleon Bonaparte  , in which the various elements and episodes in Napoleons career are described. Abbott takes a very favourable view towards his subject throughout. Also among his principal works are: History of the Civil War in America ,History of Napoleon III Emperor of the French , and The History of Frederick II, Called Frederick the Great  . He also did a foreword to a book called Life of Boone by W.M. Bogart, about ": null
    },
    {
        "Daniel Boone": "daniel boone"
    },
    {
        " in 1876.     In general, except that he did not write juvenile fiction, his work in subject and style closely resembles that of his brother, ": null
    },
    {
        "Jacob Abbott": "jacob abbott"
    },
    {
        ".       On August 17, 1830 he married Jane Williams Bourne, daughter of Abner Bourne and Abagail Williams.  Together they raised nine children:   John Brown Abbott   Jane Maria Abbott   Waldo Abbott   Harriet Vaughan Abbott   Ellen Williams Abbott   Laura Sallucia Abbott   Elizabeth Ballister Abbott   Emma Susan Abbott   Gorham Dummer Abbott     As a part of the 1872 ": null
    },
    {
        "Iwakura Mission": "iwakura mission"
    },
    {
        " Abbott was given guardianship of ": null
    },
    {
        "Shige Nagai": "shige nagai"
    },
    {
        ", a Japanese girl sent to the United States to be educated.     Abbott died at ": null
    },
    {
        "Fair Haven, Connecticut": "fair haven, connecticut"
    },
    {
        ". In 1910, a series of twenty short biographies of historical characters by J. S. C. and Jacob Abbott, was published. Their brother, ": null
    },
    {
        "Gorham Dummer Abbott": "gorham dummer abbott"
    },
    {
        ", was also an author. Abbotts grandson, Willis Abbott, was a ": null
    },
    {
        "Christian Scientist": "christian science"
    },
    {
        " and an editor of the  Christian Science Monitor .            The Mother At Home    The Path of Peace   The Child At Home   The School-Boy   The history of Christianity : consisting of the life and teachings of Jesus of Nazareth : the adventures of Paul and the apostles and the most interesting events in the progress of Christianity from the earliest period to the present time       The history of the Civil War in America, ;         The History of Napoleon Bonaparte   The French Revolution of 1789   The History of the Civil War in America   The History of Napoleon III, Emperor of the French   Prussia and the Franco-Prussian War   The History of The State of Ohio       Published after 1850 in the series Illustrated History, with other titles by his brother ": null
    },
    {
        "Jacob Abbott": "jacob abbott"
    },
    {
        ". Later reissued in the Famous Characters of History series, and in the 1904 series Makers of History:    Cortez   Henry IV   Louis XIV   King Philip , war chief of the ": null
    },
    {
        "Wampanoag people": "wampanoag people"
    },
    {
        "  Madame Roland   Marie Antoinette : Makers of History   Joseph Bonaparte , elder brother of ": null
    },
    {
        "Napoleon Bonaparte": "napoleon"
    },
    {
        "  Josephine , wife of ": null
    },
    {
        "Napoleon Bonaparte": "napoleon"
    },
    {
        "  Hortense , daughter of ": null
    },
    {
        "Josephine": "joséphine de beauharnais"
    },
    {
        "  Louis Philippe , the last king to rule France, although Emperor ": null
    },
    {
        "Napoleon III": "napoleon iii"
    }
]