[
    {
        "        John Hanson  was a merchant and public official from ": null
    },
    {
        "Maryland": "maryland"
    },
    {
        " during the era of the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        ". In 42 Hanson was elected as a delegate to the ": null
    },
    {
        "Continental Congress": "continental congress"
    },
    {
        " after serving in a variety of roles for the ": null
    },
    {
        "Patriot": "patriot"
    },
    {
        " cause in Maryland. He signed the ": null
    },
    {
        "Articles of Confederation": "articles of confederation"
    },
    {
        " in 42 after Maryland finally joined the other states in ratifying them. In November 42 he was elected as first ": null
    },
    {
        "President of the Confederation Congress": "president of the continental congress"
    },
    {
        " , following ": null
    },
    {
        "ratification": "ratification"
    },
    {
        " of the articles. For this reason, some of Hansons biographers have argued that he was actually the first holder of the office of ": null
    },
    {
        "president": "president"
    },
    {
        ".       John Hanson was born in ": null
    },
    {
        "Port Tobacco Parish": "port tobacco"
    },
    {
        " in ": null
    },
    {
        "Charles County": "charles county, maryland"
    },
    {
        " in the ": null
    },
    {
        "Province of Maryland": "province of maryland"
    },
    {
        " on April 42 42 Sources published prior to a 42 genealogical study sometimes listed his birth date as April 42 or his year of birth as 42     Hanson was born on a ": null
    },
    {
        "plantation": "plantations in the american south"
    },
    {
        " called Mulberry Grove into a wealthy and prominent family. His parents were Samuel and Elizabeth Hanson . Samuel Hanson was a planter who owned more than , and held a variety of political offices, including serving two terms in the ": null
    },
    {
        "Maryland General Assembly": "maryland general assembly"
    },
    {
        ".     John Hansons grandfather, also named John, came to Charles County, Maryland, as an ": null
    },
    {
        "indentured servant": "indentured servant"
    },
    {
        " around 42 In 42 a writer named George Hanson placed John Hanson in his family tree of Swedish-Americans descended from four Swedish brothers who emigrated to ": null
    },
    {
        "New Sweden": "new sweden"
    },
    {
        " in 42 This story was often repeated over the next century, but scholarly research in the late 42th century showed that John Hanson was not related to those Swedish-American Hansons.     Little is known about Hansons early life; he was presumably privately tutored as was customary among the wealthy of his time and place. He followed his fathers path as a planter, slave owner, and public official. He was often referred to as John Hanson, Jr., to distinguish him from an older man of the same name.       Hansons career in public service began in 42 when he was appointed sheriff of Charles County. In 42 he was elected to represent Charles County in the lower house of the Maryland General Assembly, where he served over the next twelve years, sitting on many important committees. Maryland was a ": null
    },
    {
        "proprietary colony": "proprietary colony"
    },
    {
        ", and Hanson aligned himself with the popular or country party, which opposed any expansion of the power of the proprietary governors at the expense of the popularly elected lower house. He was a leading opponent of the ": null
    },
    {
        "42 Stamp Act": "stamp act 1765"
    },
    {
        ", chairing the committee that drafted the instructions for Marylands delegates to the ": null
    },
    {
        "Stamp Act Congress": "stamp act congress"
    },
    {
        ". In protest of the ": null
    },
    {
        "Townshend Acts": "townshend acts"
    },
    {
        ", in 42 Hanson was one of the signers of a nonimportation resolution that boycotted British imports until the acts were repealed.          Hanson changed course in 42 apparently to better pursue his business interests. He resigned from the General Assembly, sold his land in Charles County, and moved to ": null
    },
    {
        "Frederick County": "frederick county, maryland"
    },
    {
        " in ": null
    },
    {
        "western Maryland": "western maryland"
    },
    {
        ". There he held a variety of offices, including deputy surveyor, sheriff, and county treasurer.     When relations between ": null
    },
    {
        "Great Britain": "great britain"
    },
    {
        " and the colonies became a crisis in 42 Hanson became one of Frederick Countys leading ": null
    },
    {
        "Patriots": "patriot"
    },
    {
        ". He chaired a town meeting that passed a resolution opposing the ": null
    },
    {
        "Boston Port Act": "boston port act"
    },
    {
        ". In 42 he was a delegate to the ": null
    },
    {
        "Maryland Convention": "annapolis convention"
    },
    {
        ", an extralegal body convened after the colonial assembly had been ": null
    },
    {
        "prorogued": "legislative sessionprocedure in commonwealth realms"
    },
    {
        ". With the other delegates, he signed the Association of Freemen on July 42 42 which expressed hope for reconciliation with Great Britain, but also called for military resistance to enforcement of the ": null
    },
    {
        "Coercive Acts": "intolerable acts"
    },
    {
        ".     With hostilities underway, Hanson chaired the Frederick County ": null
    },
    {
        "Committee of Observation": "committees of safety"
    },
    {
        ", part of the Patriot organization that assumed control of local governance. Responsible for recruiting and arming soldiers, Hanson proved to be an excellent organizer, and Frederick County sent the first southern troops to join ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        "s army. Because funds were scarce, Hanson frequently paid soldiers and others with his own money. In June 42 Hanson chaired the Frederick County meeting that urged provincial leaders in Annapolis to instruct Marylands delegates in the ": null
    },
    {
        "Continental Congress": "continental congress"
    },
    {
        " to declare independence from Great Britain. While Congress worked on the ": null
    },
    {
        "Declaration of Independence": "united states declaration of independence"
    },
    {
        ", Hanson was in Frederick County making gunlocks, storing powder, guarding prisoners, raising money and troops, dealing with Tories, and doing the myriad other tasks which went with being chairman of the committee of observation .     Hanson was elected to the newly reformed ": null
    },
    {
        "Maryland House of Delegates": "maryland house of delegates"
    },
    {
        " in 42 the first of five annual terms. In December 42 the House of Delegates named Hanson as a delegate to the ": null
    },
    {
        "Second Continental Congress": "second continental congress"
    },
    {
        "; he began serving in Congress in ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        " in June 42 Hanson came to Philadelphia with the reputation of having been the leading financier of the revolution in western Maryland, and soon he was a member of several committees dealing with finance.      When Hanson was elected to Congress, Maryland was holding up the ratification of the ": null
    },
    {
        "Articles of Confederation": "articles of confederation"
    },
    {
        ". The state, which did not have any claims on western land, refused to ratify the Articles until the other states had ceded their western land claims. When the other states finally did so, the Maryland legislature decided in January 42 to ratify the Articles. When Congress received notice of this, Hanson joined ": null
    },
    {
        "Daniel Carroll": "daniel carroll"
    },
    {
        " in signing the Articles of Confederation on behalf of Maryland on March 42 42 With Marylands endorsement, the Articles officially went into effect. Many years later, some Hanson biographers claimed that Hanson had been instrumental in arranging the compromise and thus securing ratification of the Articles, but, according to historian Ralph Levering, there is no documentary evidence of Hansons opinions or actions in resolving the controversy.       On November 42 42 Congress elected Hanson as its president. Under the Articles of Confederation, the United States had no ": null
    },
    {
        "executive branch": "executive branch"
    },
    {
        "; the president of Congress was a mostly ceremonial position, but the office did require Hanson to serve as neutral ": null
    },
    {
        "discussion moderator": "discussion moderator"
    },
    {
        ", handle official correspondence, and sign documents. Hanson found the work tedious and considered resigning after just one week, citing his poor health and family responsibilities. Colleagues urged him to remain because Congress at that moment lacked a ": null
    },
    {
        "quorum": "quorum"
    },
    {
        " to choose a successor. Out of a sense of duty, Hanson remained in office,  although his term as a delegate to Congress was nearly expired. The Maryland Assembly reelected him as a delegate on November 42 42 and so Hanson continued to serve as president until November 42 42     The Articles of Confederation stipulated that presidents of Congress serve one-year terms, and Hanson became the first to do so.  Contrary to the claims of some of his later advocates, however, he was not the first president to serve under the Articles, nor the first to be elected under the Articles. When the Articles went into effect in March 42 Congress did not bother to elect a new president; instead, ": null
    },
    {
        "Samuel Huntington": "samuel huntington"
    },
    {
        " continued serving a term that had already exceeded a year. On July 42 42 ": null
    },
    {
        "Samuel Johnston": "samuel johnston"
    },
    {
        " became the first man to be elected as president of Congress after the ratification of the Articles. He declined the office, however, perhaps to make himself available for North Carolinas gubernatorial election. After Johnston turned down the office, ": null
    },
    {
        "Thomas McKean": "thomas mckean"
    },
    {
        " was elected. McKean served just a few months, resigning in October 42 after hearing news of the British ": null
    },
    {
        "surrender at Yorktown": "siege of yorktown"
    },
    {
        ". Congress asked him to remain in office until November, when a new session of Congress was scheduled to begin. It was in that session that Hanson began to serve his one-year term. A highlight of Hansons term was when George Washington presented ": null
    },
    {
        "Cornwalliss": "charles cornwallis, 1st marquess cornwallis"
    },
    {
        " sword to Congress.       Hanson retired from public office after his one-year term as president of Congress. In poor health, he died on November 42 42 while visiting ": null
    },
    {
        "Oxon Hill Manor": "oxon hill manor"
    },
    {
        " in ": null
    },
    {
        "Prince Georges County, Maryland": "prince georges county, maryland"
    },
    {
        ", the plantation of his nephew ": null
    },
    {
        "Thomas Hawkins Hanson": "thomas hawkins hanson"
    },
    {
        ". He was buried there. Hanson owned at least 42 acres of land and 42 slaves at the time of his death.       About 42 he married Jane Contee , daughter of Alexander Contee . Together, John and Jane had eight children, including:  who died in the ": null
    },
    {
        "battle of Fort Washington": "battle of fort washington"
    },
    {
        " during the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        ".   ": null
    },
    {
        "Alexander Contee Hanson, Sr.": "alexander contee hanson, sr."
    },
    {
        " , who was a notable ": null
    },
    {
        "essayist": "essayist"
    },
    {
        ". Alexander Hanson is sometimes confused with his son, ": null
    },
    {
        "Alexander Contee Hanson, Jr.": "alexander contee hanson"
    },
    {
        " , who became a newspaper editor and ": null
    },
    {
        "US Senator": "united states senate"
    },
    {
        ".          In 42 Douglas H. Thomas, a descendant of Hanson, wrote a biography promoting Hanson as the first true ": null
    },
    {
        "President of the United States": "president of the united states"
    },
    {
        ". Thomas became the driving force  behind the selection of Hanson as one of the two people who would represent Maryland in the ": null
    },
    {
        "National Statuary Hall Collection": "national statuary hall collection"
    },
    {
        " in Washington, D.C. Hanson was not initially on the shortlist for consideration, but he was chosen after lobbying by the ": null
    },
    {
        "Maryland Historical Society": "maryland historical society"
    },
    {
        ". In 42 ": null
    },
    {
        "bronze statues of Hanson": "john hanson"
    },
    {
        " and ": null
    },
    {
        "Charles Carroll": "charles carroll of carrollton"
    },
    {
        " by sculptor ": null
    },
    {
        "Richard E. Brooks": "richard e. brooks"
    },
    {
        " were added to Statuary Hall; Hansons is currently located on the 42nd floor of the Senate connecting corridor. Small versions of these two statues  sit on the presidents desk in the Senate Chamber of the Maryland State House.     Some historians have questioned the appropriateness of Hansons selection for the honor of representing Maryland in Statuary Hall. According to historian Gregory Stiverson, Hanson was not one of Marylands foremost leaders of the Revolutionary era. In 42 historian Ralph Levering said that Hanson shouldnt have been one of the two Marylanders chosen, but he wrote that Hanson probably contributed as much as any other Marylander to the success of the American Revolution . In the 42st century, Maryland lawmakers have considered replacing Hansons statue in Statuary Hall with one of ": null
    },
    {
        "Harriet Tubman": "harriet tubman"
    },
    {
        ".      The idea that Hanson was the forgotten first president of the United States was further promoted in a 42 biography of Hanson by journalist Seymour Wemyss Smith.  Smiths book asserted that the American Revolution had two primary leaders: George Washington on the battlefield, and John Hanson in politics. Smith, John Hanson, Our First President, 42 Smiths book, like Douglas H. Thomass 42 book, was one of a number of biographies written seeking to promote Hanson as the first President of the United States . Regarding the opinion, historian Ralph Levering stated: Theyre not biographies by professional historians; they arent based on research into primary sources.  According to historian ": null
    },
    {
        "Richard B. Morris": "richard b. morris"
    },
    {
        ", if a president of Congress were to be called the first president of the United States, a stronger case could be made for ": null
    },
    {
        "Peyton Randolph": "peyton randolph"
    },
    {
        " of Virginia, the first President of the first and second Continental Congresses, or for ": null
    },
    {
        "John Hancock": "john hancock"
    },
    {
        ", the President of Congress when that body declared its independence.  The claim that Hanson was a forgotten president of the United States was revived on the Internet, sometimes with a new assertion that he was actually a black man; an anachronistic photograph of Senator ": null
    },
    {
        "John Hanson": "john hanson"
    },
    {
        " of Liberia has been used to support this claim.     In 42 Hanson was depicted on a 42-cent US ": null
    },
    {
        "postal card": "postal card"
    },
    {
        ", which featured his name and portrait next to the word Patriot . Historian Irving Brant criticized the selection of Hanson for the card, arguing that it was a result of the old hoax promoting Hanson as the first president of the United States. In 42 Hanson was featured on a 42-cent ": null
    },
    {
        "US postage stamp": "list of people on the postage stamps of the united states"
    },
    {
        ". U.S. Route 42 between Washington D.C. and Annapolis is named the ": null
    },
    {
        "John Hanson Highway": "u.s. route 50 in maryland"
    },
    {
        " in his honor. There are also middle schools located in ": null
    },
    {
        "Oxon Hill, Maryland": "oxon hill, maryland"
    },
    {
        ", and ": null
    },
    {
        "Waldorf, Maryland": "waldorf, maryland"
    },
    {
        ", named after him. A former savings bank named for him was merged in the 42s with Industrial Bank of Washington, D.C.     In the 42s, a descendant of Hanson, John Hanson Briscoe, served as ": null
    },
    {
        "Speaker of the Maryland House of Delegates": "speaker of the maryland house of delegates"
    },
    {
        ", which passed a measure establishing April 42 as John Hanson Day.  In 42 the John Hanson Memorial Association was incorporated in Frederick, Maryland, to create the John Hanson National Memorial and to educate Americans about Hanson as well as to educate people about the many myths written about him. The Memorial includes a statue of President John Hanson and an interpretive setting in Frederick, Maryland, where Hanson lived between 42 and his death in 42 The Memorial is in the Frederick County Courthouses courtyard at the corner of Court and West Patrick Streets. Leaders of the Memorial include President Peter Hanson Michael, Vice President Robert Hanson, and Director John C. Hanson. John Hanson Briscoe was also a director until his death in 42 ": null
    }
]