[
    {
        "            John Newton  was an English ": null
    },
    {
        "Anglican": "anglican"
    },
    {
        " clergyman and ": null
    },
    {
        "abolitionist": "abolitionist"
    },
    {
        " who was forced to serve as a sailor in the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " for a period. He was first a slave of Princess Peye, a black princess of the ": null
    },
    {
        "Sherbro people": "sherbro people"
    },
    {
        " and then, years after, He became the captain of ": null
    },
    {
        "slave ship": "slave ship"
    },
    {
        "s. He became ordained as an evangelical Anglican cleric, served ": null
    },
    {
        "Olney, Buckinghamshire": "olney, buckinghamshire"
    },
    {
        ", for two decades, and also wrote hymns, known for ": null
    },
    {
        "Amazing Grace": "amazing grace"
    },
    {
        " and ": null
    },
    {
        "Glorious Things of Thee Are Spoken": "glorious things of thee are spoken"
    },
    {
        " .     Newton started his career at sea at a young age, and worked on slave ships in the ": null
    },
    {
        "slave trade": "slave trade"
    },
    {
        " for several years. After experiencing a period of ": null
    },
    {
        "Christian conversion": "conversion to christianity"
    },
    {
        " Newton eventually renounced his trade and became a prominent supporter of ": null
    },
    {
        "abolitionism": "abolitionism in the united kingdom"
    },
    {
        ", living to see the UKs abolition of the African slave trade in 1807, just before his death.       John Newton was born in ": null
    },
    {
        "Wapping": "wapping"
    },
    {
        ", London, in 1725, the son of John Newton Sr., a ": null
    },
    {
        "shipmaster": "skipper"
    },
    {
        " in the ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        " service, and Elizabeth . Elizabeth was the only daughter of Simon Scatliff, an instrument maker from London . Elizabeth was brought up as a ": null
    },
    {
        "Nonconformist": "nonconformist"
    },
    {
        ". She died of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " in July 1732, about two weeks before Johns seventh birthday. Newton spent two years at boarding school before going to live in ": null
    },
    {
        "Aveley": "aveley"
    },
    {
        " in ": null
    },
    {
        "Essex": "essex"
    },
    {
        ", the home of his fathers new wife.     At age eleven he first went to sea with his father. Newton sailed six voyages before his father retired in 1742. At that time, Newtons father made plans for him to work at a ": null
    },
    {
        "sugarcane": "sugarcane"
    },
    {
        " plantation": "sugar plantations in the caribbean"
    },
    {
        " in ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        ". Instead, Newton signed on with a merchant ship sailing to the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ".       In 1743, while going to visit friends, Newton was captured and ": null
    },
    {
        "pressed": "impressment"
    },
    {
        " into the naval service by the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ". He became a ": null
    },
    {
        "midshipman": "midshipman"
    },
    {
        " aboard ": null
    },
    {
        "HMS Harwich": "hms harwich"
    },
    {
        ". At one point Newton tried to desert and was punished in front of the crew of 350. Stripped to the waist and tied to the grating, he received a ": null
    },
    {
        "flogging": "flogging"
    },
    {
        " of eight dozen lashes and was reduced to the rank of a common ": null
    },
    {
        "seaman": "seaman"
    },
    {
        ".     Following that disgrace and humiliation, Newton initially contemplated murdering the captain and committing suicide by throwing himself overboard. He recovered, both physically and mentally. Later, while Harwich was en route to ": null
    },
    {
        "India": "india"
    },
    {
        ", he transferred to Pegasus, a ": null
    },
    {
        "slave ship": "slave ship"
    },
    {
        " bound for ": null
    },
    {
        "West Africa": "west africa"
    },
    {
        ". The ship carried goods to Africa and traded them for slaves to be shipped to the colonies in the Caribbean and North America.       Newton did not get along with the crew of Pegasus. In 1745 they left him in West Africa with Amos Clowe, a slave dealer. Clowe took Newton to the coast and gave him to his wife, Princess Peye of the ": null
    },
    {
        "Sherbro people": "sherbro people"
    },
    {
        ". She abused and mistreated Newton just as much as she did her other slaves. Newton later recounted this period as the time he was once an infidel and libertine, a servant of slaves in West Africa. Memorial epitaph, St Mary Woolnoth Church, Lombard Street, London.     Early in 1748 he was rescued by a sea captain who had been asked by Newtons father to search for him, and returned to England on the merchant ship Greyhound, which was carrying ": null
    },
    {
        "beeswax": "beeswax"
    },
    {
        " and dyers wood, now referred to as ": null
    },
    {
        "camwood": "camwood"
    },
    {
        ".       During his 1748 voyage to England after his rescue, Newton had a spiritual conversion. The ship encountered a severe storm off the coast of ": null
    },
    {
        "Donegal": "donegal"
    },
    {
        ", ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        " and almost sank.     He began to read the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " and other religious literature. By the time he reached Britain, he had accepted the doctrines of ": null
    },
    {
        "evangelical Christianity": "evangelical christianity"
    },
    {
        ". The date was 10 March 1748, an anniversary he marked for the rest of his life. From that point on, he avoided profanity, gambling and drinking. Although he continued to work in the slave trade, he had gained sympathy for the slaves during his time in Africa. He later said that his true conversion did not happen until some time later: I cannot consider myself to have been a believer in the full sense of the word, until a considerable time afterwards.        Newton returned in 1748 to ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", England, a major port for the ": null
    },
    {
        "Triangle Trade": "triangle trade"
    },
    {
        ". Partly due to the influence of his fathers friend Joseph Manesty, he obtained a position as ": null
    },
    {
        "first mate": "first mate"
    },
    {
        " aboard the slave ship Brownlow, bound for the ": null
    },
    {
        "West Indies": "west indies"
    },
    {
        " via the coast of ": null
    },
    {
        "Guinea": "guinea"
    },
    {
        ".     It was when returning to England aboard the ship Greyhound in 1748, awoke to find themselves caught in a violent storm and about to sink. He prayed for Gods mercy, the storm died down. After four more weeks at sea the Greyhound made it to port in Lough Swilly, Ireland. This experience marked the beginning of his conversion to Christianity.      Newton continued to work in the slave trade. After his return to England in 1750, he made three voyages as captain of the slave ships Duke of Argyle and African . After suffering a severe stroke in 1754, he gave up seafaring and slave-trading activities, but continued to invest in Manestys slaving operations.     In 1780 Newton moved to the City of London as rector of ": null
    },
    {
        "St Mary Woolnoth Church": "st mary woolnoth"
    },
    {
        ", where he contributed to the work of the ": null
    },
    {
        "Committee for the Abolition of the Slave Trade": "society for effecting the abolition of the slave trade"
    },
    {
        ", formed in 1787. During this time he wrote Thoughts Upon the African Slave Trade. In it he states; So much light has been thrown upon the subject, by many able pens; and so many respectable persons have already engaged to use their utmost influence, for the suppression of a traffic, which contradicts the feelings of humanity; that it is hoped, this stain of our National character will soon be wiped out.        In 1750 Newton married his childhood sweetheart, Mary Catlett, in ": null
    },
    {
        "St. Margarets Church, Rochester": "st. margarets church, rochester"
    },
    {
        ".     Newton adopted his two orphaned nieces, Elizabeth Cunningham and Eliza Catlett, both from the Catlett side of the family.  Newtons niece Alys Newton later married Mehul, a prince from India.        In 1755 Newton was appointed as tide surveyor of the ": null
    },
    {
        "Port of Liverpool": "port of liverpool"
    },
    {
        ", again through the influence of Manesty. In his spare time, he studied ": null
    },
    {
        "Greek": "greek language"
    },
    {
        ", ": null
    },
    {
        "Hebrew": "hebrew"
    },
    {
        ", and ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        ", preparing for serious religious study. He became well known as an evangelical lay minister. In 1757, he applied to be ": null
    },
    {
        "ordained": "ordination"
    },
    {
        " as a priest in the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ", but it was more than seven years before he was eventually accepted.     During this period, he also applied to the ": null
    },
    {
        "Methodist": "methodist"
    },
    {
        "s, ": null
    },
    {
        "Independents": "independent"
    },
    {
        " and ": null
    },
    {
        "Presbyterians": "presbyterians"
    },
    {
        ". He mailed applications directly to the ": null
    },
    {
        "Bishops of Chester": "bishop of chester"
    },
    {
        " and ": null
    },
    {
        "Lincoln": "bishop of lincoln"
    },
    {
        " and the Archbishops of ": null
    },
    {
        "Canterbury": "archbishop of canterbury"
    },
    {
        " and ": null
    },
    {
        "York": "archbishop of york"
    },
    {
        ".     Eventually, in 1764, he was introduced by ": null
    },
    {
        "Thomas Haweis": "thomas haweis"
    },
    {
        " to ": null
    },
    {
        "William Legge, 2nd Earl of Dartmouth": "william legge, 2nd earl of dartmouth"
    },
    {
        ", who was influential in recommending Newton to ": null
    },
    {
        "William Markham": "william markham"
    },
    {
        ", Bishop of Chester. Haweis suggested Newton for the living of ": null
    },
    {
        "Olney": "olney, buckinghamshire"
    },
    {
        ", ": null
    },
    {
        "Buckinghamshire": "buckinghamshire"
    },
    {
        ". On 29 April 1764 Newton received deacons orders, and finally was ordained as a priest on 17 June.     As curate of Olney, Newton was partly sponsored by ": null
    },
    {
        "John Thornton": "john thornton"
    },
    {
        ", a wealthy merchant and evangelical philanthropist. He supplemented Newtons stipend of £60 a year with £200 a year for hospitality and to help the poor . Newton soon became well known for his pastoral care, as much as for his beliefs. His friendship with ": null
    },
    {
        "Dissenters": "english dissenters"
    },
    {
        " and evangelical clergy led to his being respected by Anglicans and ": null
    },
    {
        "Nonconformists": "nonconformism"
    },
    {
        " alike. He spent sixteen years at Olney. His preaching was so popular that the congregation added a gallery to the church to accommodate the many persons who flocked to hear him.     Some five years later, in 1772, ": null
    },
    {
        "Thomas Scott": "thomas scott"
    },
    {
        " took up the curacy of the neighbouring parishes of ": null
    },
    {
        "Stoke Goldington": "stoke goldington"
    },
    {
        " and ": null
    },
    {
        "Weston Underwood": "weston underwood, milton keynes"
    },
    {
        ". Newton was instrumental in converting Scott from a cynical ‘career priest’ to a true believer, a conversion which Scott related in his spiritual autobiography The Force Of Truth . Later Scott became a biblical commentator and co-founder of the ": null
    },
    {
        "Church Missionary Society": "church missionary society"
    },
    {
        ".     In 1779 Newton was invited by John Thornton to become Rector of ": null
    },
    {
        "St Mary Woolnoth": "st mary woolnoth"
    },
    {
        ", ": null
    },
    {
        "Lombard Street": "lombard street, london"
    },
    {
        ", London, where he officiated until his death. The church had been built by ": null
    },
    {
        "Nicholas Hawksmoor": "nicholas hawksmoor"
    },
    {
        " in 1727 in the fashionable ": null
    },
    {
        "Baroque style": "baroque style"
    },
    {
        ". Newton was one of only two evangelical Anglican priests in the capital, and he soon found himself gaining in popularity amongst the growing evangelical party. He was a strong supporter of evangelicalism in the Church of England. He remained a friend of Dissenters as well as Anglicans.     Young churchmen and people struggling with faith sought his advice, including such well-known social figures as the writer and philanthropist ": null
    },
    {
        "Hannah More": "hannah more"
    },
    {
        ", and the young ": null
    },
    {
        "William Wilberforce": "william wilberforce"
    },
    {
        ", a Member of Parliament who had recently suffered a crisis of conscience and religious conversion while contemplating leaving politics. The younger man consulted with Newton, who encouraged Wilberforce to stay in Parliament and serve God where he was .     In 1792, Newton was presented with the degree of ": null
    },
    {
        "Doctor of Divinity": "doctor of divinity"
    },
    {
        " by the ": null
    },
    {
        "College of New Jersey": "princeton university"
    },
    {
        " .          In 1788, 34 years after he had retired from the slave trade, Newton broke a long silence on the subject with the publication of a forceful pamphlet Thoughts Upon the Slave Trade, in which he described the horrific conditions of the slave ships during the ": null
    },
    {
        "Middle Passage": "middle passage"
    },
    {
        ". He apologised for a confession, which  ... comes too late  ... It will always be a subject of humiliating reflection to me, that I was once an active instrument in a business at which my heart now shudders. He had copies sent to every MP, and the pamphlet sold so well that it swiftly required reprinting.     Newton became an ally of ": null
    },
    {
        "William Wilberforce": "william wilberforce"
    },
    {
        ", leader of the Parliamentary campaign to abolish the African slave trade. He lived to see the British passage of the ": null
    },
    {
        "Slave Trade Act 1807": "slave trade act 1807"
    },
    {
        ", which enacted this event.       Newton came to believe that during the first five of his nine years as a slave trader he had not been a Christian in the full sense of the term. In 1763 he wrote: I was greatly deficient in many respects  ... I cannot consider myself to have been a believer in the full sense of the word, until a considerable time afterwards.           In 1767 ": null
    },
    {
        "William Cowper": "william cowper"
    },
    {
        ", the poet, moved to Olney. He worshipped in Newtons church, and collaborated with the priest on a volume of hymns; it was published as  Olney Hymns  in 1779. This work had a great influence on English hymnology. The volume included Newtons well-known hymns: ": null
    },
    {
        "Glorious Things of Thee Are Spoken": "glorious things of thee are spoken"
    },
    {
        ", How Sweet the Name of Jesus Sounds!, Let Us Love, and Sing, and Wonder, Come, My Soul, Thy Suit Prepare, Approach, My Soul, the Mercy-seat , and Faiths Review and Expectation, which has come to be known by its opening phrase, ": null
    },
    {
        "Amazing Grace": "amazing grace"
    },
    {
        " .        Many of Newtons hymns are preserved in the  Sacred Harp , a hymnal used in the American South during the ": null
    },
    {
        "Second Great Awakening": "second great awakening"
    },
    {
        ". Hymns were scored according to the tonal scale for ": null
    },
    {
        "shape note singing": "shape note singing"
    },
    {
        ". Easily learnt and incorporating singers into four-part harmony, shape note music was widely used by evangelical preachers to reach new congregants.     In 1776 Newton contributed a preface to an annotated version of ": null
    },
    {
        "John Bunyans": "john bunyan"
    },
    {
        "  The Pilgrims Progress .     Newton also contributed to the ": null
    },
    {
        "Cheap Repository Tracts": "cheap repository tracts"
    },
    {
        ". He wrote an autobiography entitled   An Authentic Narrative of Some Remarkable And Interesting Particulars in the Life of ------ Communicated, in a Series of Letters, to the Reverend T. Haweiss, which he published anonymously. It was later described as written in an easy style, distinguished by great natural shrewdness, and sanctified by the Lord God and prayer .       Newtons wife Mary Catlett died in 1790, after which he published Letters to a Wife , in which he expressed his grief. Plagued by ill health and failing eyesight, Newton died on 21 December 1807 in London. He was buried beside his wife in St. Mary Woolnoth in London. Both were reinterred at the Church of St. Peter and Paul in Olney in 1893.            ": null
    },
    {
        "St Mary Woolnoth": "st mary woolnoth"
    },
    {
        ". At the bottom of the plaque are the words: The above Epitaph was written by the Deceased who directed it to be inscribed on a plain Marble Tablet. He died on Dec. the 21st, 1807. Aged 82 Years, and his mortal Remains are deposited in the Vault beneath this Church.  ": null
    },
    {
        "Newton, Sierra Leone": "newton, sierra leone"
    },
    {
        " is named after him. To this day his former town of Olney provides philanthropy for the African town. ": null
    },
    {
        "Gospel Music Association": "gospel music association"
    },
    {
        " when he was inducted into the ": null
    },
    {
        "Gospel Music Hall of Fame": "gospel music hall of fame"
    },
    {
        ".  Amazing Grace  highlights Newtons influence on ": null
    },
    {
        "William Wilberforce": "william wilberforce"
    },
    {
        ". ": null
    },
    {
        "Albert Finney": "albert finney"
    },
    {
        " portrays Newton, ": null
    },
    {
        "Ioan Gruffudd": "ioan gruffudd"
    },
    {
        " is Wilberforce, and the film was directed by ": null
    },
    {
        "Michael Apted": "michael apted"
    },
    {
        ". The film portrays Newton as a penitent haunted by the ghosts of 20,000 slaves.   The Nigerian film  The Amazing Grace  , the creation of Nigerian director/writer/producer Jeta Amata, provides an African perspective on the slave trade. Nigerian actors ": null
    },
    {
        "Joke Silva": "joke silva"
    },
    {
        ", Mbong Odungide, and ": null
    },
    {
        "Fred Amata": "fred amata"
    },
    {
        " portray Africans who are captured and taken away from their homeland by slave traders. Newton is played by ": null
    },
    {
        "Nick Moran": "nick moran"
    },
    {
        ".   The 2014 film  Freedom  tells the story of an American slave  escaping to freedom via the ": null
    },
    {
        "Underground Railroad": "underground railroad"
    },
    {
        ". A parallel earlier story depicts John Newton as the captain of a slave ship bound for America carrying Samuels grandfather. Newtons conversion is explored as well.   The documentary, , focuses on the hymn but also includes discussion about John Newton.       African Snow , a play by Murray Watts, takes place in the mind of John Newton. It was first produced at the ": null
    },
    {
        "York Theatre Royal": "york theatre royal"
    },
    {
        " as a co-production with ": null
    },
    {
        "Riding Lights Theatre Company": "riding lights theatre company"
    },
    {
        ", transferring to the ": null
    },
    {
        "Trafalgar Studios": "trafalgar studios"
    },
    {
        " in Londons West End and a National Tour. Newton was played by ": null
    },
    {
        "Roger Alborough": "roger alborough"
    },
    {
        " and ": null
    },
    {
        "Olaudah Equiano": "olaudah equiano"
    },
    {
        " by Israel Oyelumade. ": null
    },
    {
        "Amazing Grace": "amazing grace"
    },
    {
        " is a dramatisation of Newtons life. The 2014 pre-Broadway and 2015 Broadway productions starred ": null
    },
    {
        "Josh Young": "josh young"
    },
    {
        " as Newton.  in the Dallas, Texas area premiered A Wretch Like Me, a dramatisation of John Newtons life story with ballet and chorus accompaniment.   In 2018,  presented Amazing Grace , a newly revised dramatisation of John Newtons life story with dance and chorus accompaniment which was directed by and featured , as John Newton.       Newton is portrayed by actor ": null
    },
    {
        "John Castle": "john castle"
    },
    {
        " in the British television miniseries, The Fight Against Slavery .       ": null
    },
    {
        "Caryl Phillips": "caryl phillips"
    },
    {
        " novel,  Crossing the River  , includes nearly verbatim excerpts of Newtons logs from his Journal of a Slave Trader. ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " by ": null
    },
    {
        "Alan Moore": "alan moore"
    },
    {
        " , an African-American whose favourite hymn is Amazing Grace visits Olney where a local churchman relates the facts of Newmans life to him. He is disturbed by Newtons involvement in the slave trade. Newtons life and circumstances, and the lyrics of Amazing Grace are described in detail.   The Infidel": null
    }
]