[
    {
        "              A joke is a display of ": null
    },
    {
        "humour": "humour"
    },
    {
        " in which words are used within a specific and well-defined narrative structure to make people ": null
    },
    {
        "laugh": "laughter"
    },
    {
        " and is not meant to be taken seriously. It takes the form of a story, usually with dialogue, and ends in a ": null
    },
    {
        "punch line": "punch line"
    },
    {
        ". It is in the punch line that the audience becomes aware that the story contains a second, conflicting meaning. This can be done using a ": null
    },
    {
        "pun": "pun"
    },
    {
        " or other word play such as ": null
    },
    {
        "irony": "irony"
    },
    {
        " or ": null
    },
    {
        "sarcasm": "sarcasm"
    },
    {
        ", a logical incompatibility, nonsense, or other means. Linguist ": null
    },
    {
        "Robert Hetzron": "robert hetzron"
    },
    {
        " offers the definition:          It is generally held that jokes benefit from brevity, containing no more detail than is needed to set the scene for the punchline at the end. In the case of ": null
    },
    {
        "riddle jokes": "riddle joke"
    },
    {
        "or one-liners the setting is implicitly understood, leaving only the dialogue and punchline to be verbalised. However, subverting these and other common guidelines can also be a source of humor—the ": null
    },
    {
        "shaggy dog story": "shaggy dog story"
    },
    {
        " is in a class of its own as an ": null
    },
    {
        "anti-joke": "anti-humor"
    },
    {
        "; although presenting as a joke, it contains a long drawn-out narrative of time, place and character, rambles through many pointless inclusions and finally fails to deliver a punchline. Jokes are a form of humour, but not all humour is a joke. Some humorous forms which are not verbal jokes are: involuntary humour, ": null
    },
    {
        "situational humour": "situational comedy"
    },
    {
        ", ": null
    },
    {
        "practical jokes": "practical jokes"
    },
    {
        ", ": null
    },
    {
        "slapstick": "slapstick"
    },
    {
        " and anecdotes.     Identified as one of the simple forms of oral literature by the Dutch linguist , jokes are passed along anonymously. They are told in both private and public settings; a single person tells a joke to his friend in the natural flow of conversation, or a set of jokes is told to a group as part of scripted entertainment. Jokes are also passed along in written form or, more recently, ": null
    },
    {
        "through the internet": "internet humor"
    },
    {
        ".     ": null
    },
    {
        "Stand-up": "stand-up"
    },
    {
        " comics, ": null
    },
    {
        "comedians": "comedians"
    },
    {
        " and ": null
    },
    {
        "slapstick": "slapstick"
    },
    {
        " work with ": null
    },
    {
        "comic timing": "comic timing"
    },
    {
        ", precision and ": null
    },
    {
        "rhythm": "rhythm"
    },
    {
        " in their performance, relying as much on actions as on the verbal punchline to evoke laughter. This distinction has been formulated in the popular saying A comic says funny things; a comedian says things funny . Generally attributed to ": null
    },
    {
        "Ed Wynn": "ed wynn"
    },
    {
        "            Any joke documented from the past has been saved through happenstance rather than design. Jokes do not belong to refined culture, but rather to the entertainment and leisure of all classes. As such, any printed versions were considered ": null
    },
    {
        "ephemera": "ephemera"
    },
    {
        ", i.e., temporary documents created for a specific purpose and intended to be thrown away. Many of these early jokes deal with scatological and sexual topics, entertaining to all social classes but not to be valued and saved.     Various kinds of jokes have been identified in ancient pre-": null
    },
    {
        "classical": "classical antiquity"
    },
    {
        " texts. In 2008, British TV channel ": null
    },
    {
        "Dave": "dave"
    },
    {
        " commissioned a team of academics, led by humour expert Paul McDonald from the ": null
    },
    {
        "University of Wolverhampton": "university of wolverhampton"
    },
    {
        ", to research the world’s oldest examples of recorded humour. Because humour may difficult to define their condition was a clear set-up and punch line structure . In review, McDonald stated: ...  jokes have varied over the years, with some taking the question and answer format while others are witty proverbs or riddles. What they all share however, is a willingness to deal with taboos and a degree of rebellion. Modern puns, Essex girl jokes and toilet humour can all be traced back to the very earliest jokes identified in this research.  The oldest identified joke is an ancient ": null
    },
    {
        "Sumer": "sumer"
    },
    {
        "ian ": null
    },
    {
        "proverb": "proverb"
    },
    {
        " from 1900 BC containing ": null
    },
    {
        "toilet humour": "toilet humour"
    },
    {
        ": Something which has never occurred since time immemorial; a young woman did not fart in her husband’s lap. Its records were dated to the ": null
    },
    {
        "Old Babylonian period": "first babylonian dynasty"
    },
    {
        " and the joke may go as far back as 2300 BC. The second oldest joke found, discovered on the ": null
    },
    {
        "Westcar Papyrus": "westcar papyrus"
    },
    {
        " and believed to be about ": null
    },
    {
        "Sneferu": "sneferu"
    },
    {
        ", was from ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        " circa 1600 BC: How do you entertain a bored pharaoh? You sail a boatload of young women dressed only in fishing nets down the Nile and urge the pharaoh to go catch a fish. The tale of the three ox drivers from Adab completes the three known oldest jokes in the world. This is a ": null
    },
    {
        "comic triple": "rule of three comedy"
    },
    {
        " dating back to 1200 BC ": null
    },
    {
        "Adab": "adab"
    },
    {
        ". It concerns three men seeking justice from a king on the matter of ownership over a newborn calf, for whose birth they all consider themselves to be partially responsible. The king seeks advice from a priestess on how to rule the case, and she suggests a series of events involving the mens households and wives. Unfortunately, the final portion of the story , has not survived intact, though legible fragments suggest it was bawdy in nature.     The earliest extant joke book is the  Philogelos  , a collection of 265 jokes written in crude ": null
    },
    {
        "ancient Greek": "ancient greek"
    },
    {
        " dating to the fourth or fifth century AD. The author of the collection is obscure and a number of different authors are attributed to it, including Hierokles and Philagros the grammatikos , just Hierokles , or, in the  Suda , Philistion . British classicist ": null
    },
    {
        "Mary Beard": "mary beard"
    },
    {
        " states that the Philogelos may have been intended as a jokesters handbook of quips to say on the fly, rather than a book meant to be read straight through. Many of the jokes in this collection are surprisingly familiar, even though the typical protagonists are less recognisable to contemporary readers: the ": null
    },
    {
        "absent-minded professor": "absent-minded professor"
    },
    {
        ", the eunuch, and people with hernias or bad breath. The Philogelos even contains a joke similar to ": null
    },
    {
        "Monty Pythons": "monty python"
    },
    {
        " Dead Parrot Sketch": "dead parrot sketch"
    },
    {
        " .          ": null
    },
    {
        "During the 15th century": "early modern period"
    },
    {
        ", the ": null
    },
    {
        "printing revolution": "printing pressthe printing revolution"
    },
    {
        " spread across Europe following the development of the ": null
    },
    {
        "movable type printing press": "history of printingmovable type"
    },
    {
        ". This was coupled with the growth of literacy in all social classes. Printers turned out ": null
    },
    {
        "Jestbooks": "jestbook"
    },
    {
        "along with Bibles to meet both ": null
    },
    {
        "lowbrow": "low culture"
    },
    {
        " and ": null
    },
    {
        "highbrow": "highbrow"
    },
    {
        " interests of the populace. One early anthology of jokes was the ": null
    },
    {
        "Facetiae": "facetiae"
    },
    {
        " by the Italian ": null
    },
    {
        "Poggio Bracciolini": "poggio bracciolini"
    },
    {
        ", first published in 1470. The popularity of this jest book can be measured on the twenty editions of the book documented alone for the 15th century. Another popular form was a collection of jests, jokes and funny situations attributed to a single character in a more connected, narrative form of the ": null
    },
    {
        "picaresque": "picaresque"
    },
    {
        " novel. Examples of this are the characters of ": null
    },
    {
        "Rabelais": "rabelais"
    },
    {
        " in France, ": null
    },
    {
        "Till Eulenspiegel": "till eulenspiegel"
    },
    {
        " in Germany, ": null
    },
    {
        "Lazarillo de Tormes": "lazarillo de tormes"
    },
    {
        " in Spain and ": null
    },
    {
        "Master Skelton": "john skelton"
    },
    {
        " in England. There is also a jest book ascribed to ": null
    },
    {
        "William Shakespeare": "shakespeares jest book"
    },
    {
        ", the contents of which appear to both inform and borrow from his plays. All of these early jestbooks corroborate both the rise in the literacy of the European populations and the general quest for leisure activities during the Renaissance in Europe.     The practice of printers to use jokes and cartoons as page fillers was also widely used in the ": null
    },
    {
        "broadsides": "broadside"
    },
    {
        " and ": null
    },
    {
        "chapbooks": "chapbook"
    },
    {
        "of the 19th century and earlier. With the increase in literacy in the general population and the growth of the printing industry, these publications were the most common forms of printed material between the 16th and 19th centuries throughout Europe and North America. Along with reports of events, executions, ballads and verse, they also contained jokes. Only one of many broadsides archived in the Harvard library is described as 1706. Grinning made easy; or, Funny Dicks unrivalled collection of curious, comical, odd, droll, humorous, witty, whimsical, laughable, and eccentric jests, jokes, bulls, epigrams, & c. With many other descriptions of wit and humour.  These cheap publications, ephemera intended for mass distribution, were read alone, read aloud, posted and discarded.     There are many types of joke books in print today; a search on the internet provides a plethora of titles available for purchase. They can be read alone for solitary entertainment, or used to stock up on new jokes to entertain friends. Some people try to find a deeper meaning in jokes, as in Plato and a Platypus Walk into a Bar... Understanding Philosophy Through Jokes . NPR Interview with the authors Cathcart and Klein can be found at  However a deeper meaning is not necessary to appreciate their inherent entertainment value. Magazines frequently use jokes and cartoons as filler for the printed page.  Readers Digest  closes out many articles with an joke at the bottom of the article.  The New Yorker  was first published in 1925 with the stated goal of being a sophisticated humour magazine and is still known for ": null
    },
    {
        "its cartoons": "the new yorkercartoons"
    },
    {
        ".       Telling a joke is a cooperative effort; it requires that the teller and the audience mutually agree in one form or another to understand the narrative which follows as a joke. In a study of ": null
    },
    {
        "conversation analysis": "conversation analysis"
    },
    {
        ", the sociologist ": null
    },
    {
        "Harvey Sacks": "harvey sacks"
    },
    {
        " describes in detail the sequential organisation in the telling a single joke. This telling is composed, as for stories, of three serially ordered and adjacently placed types of sequences … the preface the telling, and the response sequences.  Folklorists expand this to include the context of the joking. Who is telling what jokes to whom? And why is he telling them when? The context of the joke telling in turn leads into a study of ": null
    },
    {
        "joking relationship": "joking relationship"
    },
    {
        "s, a term coined by anthropologists to refer to social groups within a culture who engage in institutionalised banter and joking.       ": null
    },
    {
        "Framing": "frame analysis"
    },
    {
        " is done with a expression which keys the audience in to expect a joke. Have you heard the one… , Reminds me of a joke I heard… , So, a lawyer and a doctor… ; these conversational markers are just a few examples of linguistic frames used to start a joke. Regardless of the frame used, it creates a social space and clear boundaries around the narrative which follows. Audience response to this initial frame can be acknowledgement and anticipation of the joke to follow. It can also be a dismissal, as in this is no joking matter or this is no time for jokes .     Within its performance frame, joke-telling is labelled as a culturally ": null
    },
    {
        "marked": "marked"
    },
    {
        " form of communication. Both the performer and audience understand it to be set apart from the real world. An elephant walks into a bar… ; a native English speaker automatically understands that this is the start of a joke, and the story that follows is not meant to be taken at face value . The framing itself invokes a play mode; if the audience is unable or unwilling to move into play, then nothing will seem funny.       Following its linguistic framing the joke, in the form of a story, can be told. It is not required to be verbatim text like other forms of oral literature such as riddles and proverbs. The teller can and does modify the text of the joke, depending both on memory and the present audience. The important characteristic is that the narrative is succinct, containing only those details which lead directly to an understanding and decoding of the punchline. This requires that it support the same divergent scripts which are to be embodied in the punchline.     The narrative always contains a protagonist who becomes the butt or target of the joke. This labelling serves to develop and solidify ": null
    },
    {
        "stereotypes": "stereotypes"
    },
    {
        " within the culture. It also enables researchers to group and analyse the creation, persistence and interpretation of joke cycles around a certain character. Some people are naturally better performers than others, however anyone can tell a joke because the comic trigger is contained in the narrative text and punchline. A joke poorly told is still funny unless the punchline gets mangled.       The punchline is intended to make the audience laugh. A linguistic interpretation of this punchline / response is elucidated by ": null
    },
    {
        "Victor Raskin": "victor raskin"
    },
    {
        " in his ": null
    },
    {
        "Script-based Semantic Theory of Humour": "theories of humorscript-based semantic theory of humor"
    },
    {
        ". Humour is evoked when a trigger contained in the punchline causes the audience to abruptly shift its understanding of the story from the primary interpretation to a secondary, opposing interpretation. The punchline is the pivot on which the joke text turns as it signals the shift between the scripts necessary to interpret the joke text.  To produce the humour in the verbal joke, the two interpretations need to be both compatible with the joke text AND opposite or incompatible with each other. Thomas R. Shultz, a psychologist, independently expands Raskins linguistic theory to include two stages of incongruity: perception and resolution. He explains that … incongruity alone is insufficient to account for the structure of humour. Within this framework, humour appreciation is conceptualized as a biphasic sequence involving first the discovery of incongruity followed by a resolution of the incongruity.  Resolution generates laughter.     This is the point at which the field of ": null
    },
    {
        "neurolinguistics": "neurolinguistics"
    },
    {
        " offers some insight into the cognitive processing involved in this abrupt laughter at the punchline. Studies by the cognitive science researchers Coulson and ": null
    },
    {
        "Kutas": "marta kutas"
    },
    {
        " directly address the theory of script switching articulated by Raskin in their work. The article Getting it: Human event-related brain response to jokes in good and poor comprehenders measures brain activity in response to reading jokes. Additional studies by others in the field support more generally the theory of two-stage processing of humour, as evidenced in the longer processing time they require. In the related field of ": null
    },
    {
        "neuroscience": "neuroscience"
    },
    {
        ", it has been shown that the expression of laughter is caused by two partially independent neuronal pathways: an involuntary or emotionally driven system and a voluntary system. This study adds credence to the common experience when exposed to an ": null
    },
    {
        "off-colour": "off-color humor"
    },
    {
        " joke; a laugh is followed in the next breath by a disclaimer: Oh, thats bad… Here the multiple steps in cognition are clearly evident in the stepped response, the perception being processed just a breath faster than the resolution of the moral / ethical content in the joke.       Expected response to a joke is ": null
    },
    {
        "laughter": "laughter"
    },
    {
        ". The joke teller hopes the audience gets it and is entertained. This leads to the premise that a joke is actually an understanding test between individuals and groups. If the listeners do not get the joke, they are not understanding the two scripts which are contained in the narrative as they were intended. Or they do get it and dont laugh; it might be too obscene, too gross or too dumb for the current audience. A woman might respond differently to a joke told by a male colleague around the water cooler than she would to the same joke overheard in a womens lavatory. A joke involving ": null
    },
    {
        "toilet humour": "toilet humour"
    },
    {
        " may be funnier told on the playground at elementary school than on a college campus. The same joke will elicit different responses in different settings. The punchline in the joke remains the same, however it is more or less appropriate depending on the current context.       The context explores the specific social situation in which joking occurs. The narrator automatically modifies the text of the joke to be acceptable to different audiences, while at the same time supporting the same divergent scripts in the punchline. The vocabulary used in telling the same joke at a university fraternity party and to ones grandmother might well vary. In each situation it is important to identify both the narrator and the audience as well as their relationship with each other. This varies to reflect the complexities of a matrix of different social factors: age, sex, race, ethnicity, kinship, political views, religion, power relationship, etc. When all the potential combinations of such factors between the narrator and the audience are considered, then a single joke can take on infinite shades of meaning for each unique social setting.     The context, however, should not be confused with the function of the joking. Function is essentially an abstraction made on the basis of a number of contexts . In one long-term observation of men coming off the late shift at a local café, joking with the waitresses was used to ascertain sexual availability for the evening. Different types of jokes, going from general to topical into explicitly sexual humour signalled openness on the part of the waitress for a connection. This study describes how jokes and joking are used to communicate much more than just good humour. That is a single example of the function of joking in a social setting, but there are others. Sometimes jokes are used simply to get to know someone better. What makes them laugh, what do they find funny? Jokes concerning politics, religion or sexual topics can be used effectively to gage the attitude of the audience to any one of these topics. They can also be used as a marker of group identity, signalling either inclusion or exclusion for the group. Among pre-adolescents, dirty jokes allow them to share information about their changing bodies. And sometimes joking is just simple entertainment for a group of friends.       The context of joking in turn leads into a study of ": null
    },
    {
        "joking relationship": "joking relationship"
    },
    {
        "s, a term coined by anthropologists to refer to social groups within a culture who take part in institutionalised banter and joking. These relationships can be either one-way or a mutual back and forth between partners. The joking relationship is defined as a peculiar combination of friendliness and antagonism. The behaviour is such that in any other social context it would express and arouse hostility; but it is not meant seriously and must not be taken seriously. There is a pretence of hostility along with a real friendliness. To put it in another way, the relationship is one of permitted disrespect.  Joking relationships were first described by anthropologists within kinship groups in Africa. But they have since been identified in cultures around the world, where jokes and joking are used to mark and re-inforce appropriate boundaries of a relationship.       The advent of ": null
    },
    {
        "electronic communications": "electronic communication"
    },
    {
        "at the end of the 20th century introduced new traditions into jokes. A verbal joke or cartoon is ": null
    },
    {
        "email": "email"
    },
    {
        "ed to a friend or posted on a ": null
    },
    {
        "bulletin board": "bulletin board"
    },
    {
        "; reactions include a replied email with ": null
    },
    {
        "a ": "smiley"
    },
    {
        "viola jokes": "viola jokes"
    },
    {
        "alks into a b": "alks into a b"
    },
    {
        "wind-up dolls": "wind-up doll joke"
    },
    {
        "knock-knock jokes": "knock-knock jokes"
    },
    {
        "geographic, economic, cultural, linguistic": null
    },
    {
        "Brothers Grimm": "brothers grimm"
    },
    {
        " et al.e.g., numbskull": null
    },
    {
        "lkloristi": "lkloristi"
    },
    {
        "lkloristi": "lkloristi"
    },
    {
        "lkloristi": "lkloristi"
    },
    {
        "primarily oralSOunrealnon-actualabnormalimpossibleLMSITAsNSLASINSwith the caveat that TA and LM may be emptyand other forms of humour": null
    },
    {
        "opp": "opp"
    },
    {
        "ychologi": "ychologi"
    },
    {
        "and playfulnessFACSGTVHKRssee aboveSSTHLMreferring to the mechanism which connects the different linguistic scripts in the jokeKRusually recorded1993a.k.a. framesi.e. dummy punning programsLaughterfrom the Greek , meaning laughter": null
    }
]