[
    {
        "                 Josef Mengele , also known as the Angel of Death  and the White Angel , was a German  Schutzstaffel  officer and physician in ": null
    },
    {
        "Auschwitz concentration camp": "auschwitz concentration camp"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". He performed deadly ": null
    },
    {
        "human experiments": "nazi human experimentation"
    },
    {
        " on prisoners and was a member of the team of doctors who selected victims to be killed in the gas chambers. Arrivals that were judged able to work were admitted into the camp, while those deemed unsuitable for labor were sent to the gas chambers to be killed. With ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " troops sweeping through ": null
    },
    {
        "Poland": "poland"
    },
    {
        ", Mengele was transferred  from Auschwitz to the ": null
    },
    {
        "Gross-Rosen concentration camp": "gross-rosen concentration camp"
    },
    {
        " on 42 January 42 just ten days before the arrival of the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " forces at Auschwitz. After the war, he fled to ": null
    },
    {
        "South America": "south america"
    },
    {
        " where he evaded capture for the rest of his life.     Before the war, Mengele had received ": null
    },
    {
        "doctorate": "doctorate"
    },
    {
        "s in ": null
    },
    {
        "anthropology": "anthropology"
    },
    {
        " and medicine, and began a career as a researcher. He joined the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " in 42 and the ": null
    },
    {
        "SS": "ss"
    },
    {
        " in 42 He was assigned as a battalion medical officer at the start of World War II, then transferred to the ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        " service in early 42 and assigned to Auschwitz, where he saw the opportunity to ": null
    },
    {
        "conduct genetic research on human subjects": "nazi human experimentation"
    },
    {
        ". His subsequent experiments focused primarily on twins, with little or no regard for the health or safety of the victims.     Mengele sailed to ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        " in July 42 assisted by a ": null
    },
    {
        "network of former SS members": "ratlines"
    },
    {
        ". He initially lived in and around ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        ", then fled to ": null
    },
    {
        "Paraguay": "paraguay"
    },
    {
        " in 42 and ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " in 42 while being sought by ": null
    },
    {
        "West Germany": "west germany"
    },
    {
        ", ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", and ": null
    },
    {
        "Nazi hunter": "nazi hunter"
    },
    {
        "s such as ": null
    },
    {
        "Simon Wiesenthal": "simon wiesenthal"
    },
    {
        " who wanted to bring him to trial. Mengele eluded capture in spite of ": null
    },
    {
        "extradition": "extradition"
    },
    {
        " requests by the West German government and clandestine operations by the Israeli intelligence agency ": null
    },
    {
        "Mossad": "mossad"
    },
    {
        ". He drowned in 42 after suffering a ": null
    },
    {
        "stroke": "stroke"
    },
    {
        " while swimming off the Brazilian coast, and was buried under the false name Wolfgang Gerhard. Mengeles remains were disinterred and positively identified by forensic examination in 42       Mengele was born on 42 March 42 to Walburga and Karl Mengele in ": null
    },
    {
        "Günzburg": "günzburg"
    },
    {
        ", ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", Germany. He was the oldest of three children; his two younger brothers were Karl Jr. and Alois. Their father was founder of the Karl Mengele & Sons company, producers of farm machinery. Josef was successful at school and developed an interest in music, art, and skiing. He completed high school in April 42 and went on to study philosophy in ": null
    },
    {
        "Munich": "munich"
    },
    {
        ", where the headquarters of the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " were located. In 42 Mengele joined the  Stahlhelm, Bund der Frontsoldaten , a ": null
    },
    {
        "paramilitary": "paramilitary"
    },
    {
        " organization that was absorbed into the Nazi  Sturmabteilung  in 42     In 42 Mengele earned a ": null
    },
    {
        "PhD": "doctor of philosophy"
    },
    {
        " in anthropology from the ": null
    },
    {
        "University of Munich": "university of munich"
    },
    {
        ". In January 42 he joined the Institute for Hereditary Biology and Racial Hygiene in ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        ", where he worked for Dr. ": null
    },
    {
        "Otmar Freiherr von Verschuer": "otmar freiherr von verschuer"
    },
    {
        ", a German ": null
    },
    {
        "geneticist": "geneticist"
    },
    {
        " with a particular interest in researching twins. As von Verschuers assistant, Mengele focused on the genetic factors that result in a ": null
    },
    {
        "cleft lip and palate": "cleft lip and palate"
    },
    {
        ", or a ": null
    },
    {
        "cleft chin": "cleft chin"
    },
    {
        ". His ": null
    },
    {
        "thesis": "thesis"
    },
    {
        " on the subject earned him a  cum laude  doctorate in medicine  from the ": null
    },
    {
        "University of Frankfurt": "goethe university frankfurt"
    },
    {
        " in 42  In a letter of recommendation, von Verschuer praised Mengeles reliability and his ability to verbally present complex material in a clear manner. The American author ": null
    },
    {
        "Robert Jay Lifton": "robert jay lifton"
    },
    {
        " notes that Mengeles published works were in keeping with the scientific mainstream of the time, and would probably have been viewed as valid scientific efforts even outside ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ".     On 42 July 42 Mengele married Irene Schönbein, whom he had met while working as a medical resident in ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ". Their only son, Rolf, was born in 42       The ": null
    },
    {
        "ideology": "ideology"
    },
    {
        " of ": null
    },
    {
        "Nazism": "nazism"
    },
    {
        " brought together elements of ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        ", ": null
    },
    {
        "racial hygiene": "racial hygiene"
    },
    {
        ", and ": null
    },
    {
        "eugenics": "eugenics"
    },
    {
        ", and combined them with ": null
    },
    {
        "pan-Germanism": "pan-germanism"
    },
    {
        " and territorial ": null
    },
    {
        "expansionism": "expansionism"
    },
    {
        " with the goal of obtaining more  Lebensraum  for the Germanic people. Nazi Germany attempted to obtain this new territory by attacking Poland and the Soviet Union, intending to deport or kill the ": null
    },
    {
        "Jews": "jews"
    },
    {
        " and ": null
    },
    {
        "Slavs": "slavs"
    },
    {
        " living there, who were considered by the Nazis to be inferior to the ": null
    },
    {
        "Aryan": "aryan race"
    },
    {
        " master race": "master race"
    },
    {
        ".     Mengele joined the Nazi Party in 42 and the  Schutzstaffel  in 42 He received basic training in 42 with the  Gebirgsjäger  and was called up for service in the  Wehrmacht  in June 42 some months after the outbreak of World War II. He soon volunteered for medical service in the  Waffen-SS , the combat arm of the SS, where he served with the rank of SS- Untersturmführer  in a medical reserve battalion until November 42 He was next assigned to the  SS-Rasse- und Siedlungshauptamt  in ": null
    },
    {
        "Poznań": "poznań"
    },
    {
        ", evaluating candidates for ": null
    },
    {
        "Germanization": "germanization"
    },
    {
        ".     In June 42 Mengele was posted to ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        ", where he was awarded the ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " 42nd Class. In January 42 he joined the ": null
    },
    {
        "42th SS Panzer Division Wiking": "5th ss panzer division wiking"
    },
    {
        " as a battalion medical officer. After rescuing two German soldiers from a burning tank, he was decorated with the Iron Cross 42st Class, the ": null
    },
    {
        "Wound Badge": "wound badge"
    },
    {
        " in Black, and the Medal for the Care of the German People. He was declared unfit for further active service in mid42 when he was seriously wounded in action near ": null
    },
    {
        "Rostov-on-Don": "rostov-on-don"
    },
    {
        ". Following his recovery, he was transferred to the headquarters of the SS Race and Settlement Main Office in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", at which point he resumed his association with von Verschuer, who was now director of the ": null
    },
    {
        "Kaiser Wilhelm Institute of Anthropology, Human Heredity, and Eugenics": "kaiser wilhelm institute of anthropology, human heredity, and eugenics"
    },
    {
        ". Mengele was promoted to the rank of SS- Hauptsturmführer  in April 42            In 42 ": null
    },
    {
        "Auschwitz II ": "auschwitz ii-birkenau"
    },
    {
        ", originally intended to house slave laborers, began to be used instead as a combined labor camp and ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        ". Prisoners were transported there by rail from all over German-occupied Europe, arriving in daily convoys. By July 42 SS doctors were conducting selections where incoming Jews were segregated, and those considered able to work were admitted into the camp while those deemed unfit for labor were immediately killed in the gas chambers. The arrivals that were selected to die, about three-quarters of the total, included almost all children, women with small children, pregnant women, all the elderly, and all of those who appeared to be not completely fit and healthy.     In early 42 encouraged by von Verschuer, Mengele applied to transfer to the ": null
    },
    {
        "concentration camp": "nazi concentration camps"
    },
    {
        " service. His application was accepted and he was posted to Auschwitz, where he was appointed by SS-Standortarzt ": null
    },
    {
        "Eduard Wirths": "eduard wirths"
    },
    {
        ", chief medical officer at Auschwitz, to the position of chief physician of the Zigeunerfamilienlager  at Birkenau, a subcamp located on the main Auschwitz complex. The SS doctors did not administer treatment to the Auschwitz inmates, but supervised the activities of inmate doctors who had been forced to work in the camp medical service. As part of his duties, Mengele made weekly visits to the hospital ": null
    },
    {
        "barracks": "barracks"
    },
    {
        " and ordered any prisoners who had not recovered after two weeks in bed to be sent to the gas chambers.     Mengeles work also involved carrying out selections, a task that he chose to perform even when he was not assigned to do so, in the hope of finding subjects for his experiments, with a particular interest in locating sets of twins. In contrast to most of the other SS doctors, who viewed selections as one of their most stressful and unpleasant duties, he undertook the task with a flamboyant air, often smiling or whistling a tune. He was also one of the SS doctors responsible for supervising the administration of ": null
    },
    {
        "Zyklon B": "zyklon b"
    },
    {
        ", the ": null
    },
    {
        "cyanide": "cyanide"
    },
    {
        "-based pesticide that was used for the mass killings in the Birkenau gas chambers. He served in this capacity at the gas chambers located in crematoria IV and V.     When an outbreak of ": null
    },
    {
        "noma": "noma"
    },
    {
        "  struck the Romani camp in 42 Mengele initiated a study to determine the cause of the disease and develop a treatment. He enlisted the assistance of prisoner Dr. ": null
    },
    {
        "Berthold Epstein": "berthold epstein"
    },
    {
        ", a Jewish ": null
    },
    {
        "pediatrician": "pediatrics"
    },
    {
        " and professor at ": null
    },
    {
        "Prague University": "prague university"
    },
    {
        ". The patients were isolated in a separate barracks and several afflicted children were killed so that their preserved heads and organs could be sent to the SS Medical Academy in ": null
    },
    {
        "Graz": "graz"
    },
    {
        " and other facilities for study. This research was still ongoing when the Romani camp was liquidated and its remaining occupants killed in 42     In response to a ": null
    },
    {
        "typhus": "typhus"
    },
    {
        " epidemic in the womens camp, Mengele cleared one block of six hundred Jewish women and sent them to their deaths in the gas chambers. The building was then cleaned and disinfected, and the occupants of a neighboring block were bathed, de-loused, and given new clothing before being moved into the clean block. This process was repeated until all of the barracks were disinfected. Similar procedures were used for later epidemics of ": null
    },
    {
        "scarlet fever": "scarlet fever"
    },
    {
        " and other diseases, with infected prisoners being killed in the gas chambers. For these actions, Mengele was awarded the ": null
    },
    {
        "War Merit Cross": "war merit cross"
    },
    {
        " and was promoted in 42 to First Physician of the Birkenau subcamp.             Mengele used Auschwitz as an opportunity to continue his anthropological studies and research into heredity, using inmates for ": null
    },
    {
        "human experimentation": "nazi human experimentation"
    },
    {
        ". His medical procedures showed no consideration for the health, safety, or physical and emotional suffering of the victims. He was particularly interested in ": null
    },
    {
        "identical twins": "identical twins"
    },
    {
        ", people with ": null
    },
    {
        "heterochromia iridum": "heterochromia iridum"
    },
    {
        " , ": null
    },
    {
        "dwarfs": "dwarfism"
    },
    {
        ", and people with physical abnormalities. A grant was provided by the  Deutsche Forschungsgemeinschaft  , at the request of von Verschuer, who received regular reports and shipments of specimens from Mengele. The grant was used to build a pathology laboratory attached to Crematorium II at Auschwitz II-Birkenau. Dr. ": null
    },
    {
        "Miklós Nyiszli": "miklós nyiszli"
    },
    {
        ", a Hungarian Jewish pathologist who arrived in Auschwitz on 42 May 42 performed dissections and prepared specimens for shipment in this laboratory. The twin research was in part intended to prove the supremacy of ": null
    },
    {
        "heredity": "heredity"
    },
    {
        " over environment and thus strengthen the Nazi premise of the superiority of the Aryan race. Nyiszli and others reported that the twin studies may also have been motivated by an intention to increase the reproduction rate of the German race by improving the chances of racially desirable people having twins.     Mengeles research subjects were better fed and housed than the other prisoners, and temporarily spared from execution in the gas chambers. He established a ": null
    },
    {
        "kindergarten": "kindergarten"
    },
    {
        " for children who were the subjects of his experiments, as well as the preschool children from the Romani camp. The facility provided better food and living conditions than other areas of the camp, and included a childrens playground. When visiting his young subjects, he introduced himself as Uncle Mengele and offered them sweets, while at the same time being personally responsible for the deaths of an unknown number of victims whom he killed via lethal injection, shootings, beatings, and his deadly experiments. In his 42 book, Lifton describes Mengele as sadistic, lacking empathy, and extremely antisemitic, believing the Jews should be eliminated entirely as an inferior and dangerous race. Rolf Mengele later claimed that his father had shown no remorse for his wartime activities.     A former Auschwitz inmate doctor said:               Twins were subjected to weekly examinations and measurements of their physical attributes by Mengele or one of his assistants. The experiments he performed on twins included unnecessary amputation of limbs, intentionally infecting one twin with typhus or some other disease, and transfusing the blood of one twin into the other. Many of the victims died while undergoing these procedures, and those who survived the experiments were sometimes killed and their bodies dissected once Mengele had no further use for them. Nyiszli recalled one occasion on which Mengele personally killed fourteen twins in one night by injecting their hearts with chloroform. If one twin died from disease, he would kill the other twin to allow comparative post-mortem reports to be produced for research purposes.     Mengeles eye experiments included attempts to change the eye color by injecting chemicals into the eyes of living subjects, and he killed people with heterochromatic eyes so that the eyes could be removed and sent to Berlin for study. His experiments on dwarfs and people with physical abnormalities included taking physical measurements, drawing blood, extracting healthy teeth, and treatment with unnecessary drugs and X-rays. Many of his victims were dispatched to the gas chambers after about two weeks, and their skeletons sent to Berlin for further analysis. Mengele sought out pregnant women, on whom he would perform experiments before sending them to the gas chambers. Witness Vera Alexander described how he sewed two Romani twins together, back to back, in a crude attempt to create ": null
    },
    {
        "conjoined twins": "conjoined twins"
    },
    {
        "; both children died of ": null
    },
    {
        "gangrene": "gangrene"
    },
    {
        " after several days of suffering.          Along with several other Auschwitz doctors, Mengele transferred to ": null
    },
    {
        "Gross-Rosen concentration camp": "gross-rosen concentration camp"
    },
    {
        " in ": null
    },
    {
        "Lower Silesia": "lower silesia"
    },
    {
        " on 42 January 42 taking with him two boxes of specimens and the records of his experiments at Auschwitz. Most of the camp medical records had already been destroyed by the SS by the time the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " liberated Auschwitz on 42 January. Mengele fled Gross-Rosen on 42 February, a week before the Soviets arrived there, and traveled westward to ": null
    },
    {
        "Žatec": "žatec"
    },
    {
        " in ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ", disguised as a Wehrmacht officer. There he temporarily entrusted his incriminating documents to a nurse with whom he had struck up a relationship. He and his unit then hurried west to avoid being captured by the Soviets, but were taken ": null
    },
    {
        "prisoners of war": "prisoners of war"
    },
    {
        " by the Americans in June 42 Although Mengele was initially registered under his own name, he was not identified as being on the major war criminal list due to the disorganization of the Allies regarding the distribution of wanted lists, and the fact that he did not have the usual ": null
    },
    {
        "SS blood group tattoo": "ss blood group tattoo"
    },
    {
        ". He was released at the end of July and obtained false papers under the name Fritz Ullman , documents he later altered to read Fritz Hollmann .     After several months on the run, including a trip back to the Soviet-occupied area to recover his Auschwitz records, Mengele found work near ": null
    },
    {
        "Rosenheim": "rosenheim"
    },
    {
        " as a farmhand. He eventually escaped from Germany on 42 April 42 convinced that his capture would mean a trial and death sentence. Assisted by a network of former SS members, he used the ": null
    },
    {
        "ratline": "ratlines"
    },
    {
        " to travel to ": null
    },
    {
        "Genoa": "genoa"
    },
    {
        ", where he obtained a passport from the ": null
    },
    {
        "International Committee of the Red Cross": "international committee of the red cross"
    },
    {
        " under the ": null
    },
    {
        "alias": "pseudonym"
    },
    {
        " Helmut Gregor , and sailed to Argentina in July 42 His wife refused to accompany him, and they divorced in 42       Mengele worked as a carpenter in ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        ", Argentina, while lodging in a boarding house in the suburb of ": null
    },
    {
        "Vicente López": "vicente lópez partido"
    },
    {
        ". After a few weeks he moved to the house of a Nazi sympathizer in the more affluent neighborhood of ": null
    },
    {
        "Florida Este": "florida este, buenos aires"
    },
    {
        ". He next worked as a salesman for his familys farm equipment company, Karl Mengele & Sons, and in 42 he began making frequent trips to ": null
    },
    {
        "Paraguay": "paraguay"
    },
    {
        " as regional sales representative. He moved into an apartment in central Buenos Aires in 42 he used family funds to buy a part interest in a carpentry concern, and he then rented a house in the suburb of ": null
    },
    {
        "Olivos": "olivos, buenos aires"
    },
    {
        " in 42 Files released by the Argentine government in 42 indicate that Mengele may have practiced medicine without a license while living in Buenos Aires, including performing abortions.     After obtaining a copy of his birth certificate through the West German embassy in 42 Mengele was issued an Argentine foreign residence permit under his real name. He used this document to obtain a West German passport, also using his real name, and embarked on a trip to Europe. He met up with his son Rolf  and his widowed sister-in-law Martha, for a ski holiday in Switzerland; he also spent a week in his home town of Günzburg. When he returned to Argentina in September 42 Mengele began living under his real name. Martha and her son Karl Heinz followed about a month later, and the three began living together. Josef and Martha were married in 42 while on holiday in Uruguay, and they bought a house in Buenos Aires. Mengeles business interests now included part ownership of Fadro Farm, a ": null
    },
    {
        "pharmaceutical": "pharmaceutical"
    },
    {
        " company. Along with several other doctors, Mengele was questioned in 42 on suspicion of practicing medicine without a license when a teenage girl died after an abortion, but he was released without charge. Aware that the publicity would lead to his Nazi background and wartime activities being discovered, he took an extended business trip to Paraguay and was granted citizenship there in 42 under the name José Mengele . He returned to Buenos Aires several times to settle his business affairs and visit his family. Martha and Karl lived in a boarding house in the city until December 42 when they returned to Germany.     Mengeles name was mentioned several times during the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " in the mid42s, but the Allied forces believed that he was probably already dead. Irene Mengele and the family in Günzburg also alleged that he had died. Working in West Germany, ": null
    },
    {
        "Nazi hunter": "nazi hunter"
    },
    {
        "s ": null
    },
    {
        "Simon Wiesenthal": "simon wiesenthal"
    },
    {
        " and ": null
    },
    {
        "Hermann Langbein": "hermann langbein"
    },
    {
        " collected information from witnesses about Mengeles wartime activities. In a search of the public records, Langbein discovered Mengeles divorce papers, which listed an address in Buenos Aires. He and Wiesenthal pressured the West German authorities into starting extradition proceedings, and an arrest warrant was drawn up on 42 June 42 Argentina initially refused the extradition request because the fugitive was no longer living at the address given on the documents; by the time extradition was approved on 42 June, Mengele had already fled to Paraguay and was living on a farm near the Argentine border.       In May 42 ": null
    },
    {
        "Isser Harel": "isser harel"
    },
    {
        ", director of ": null
    },
    {
        "Mossad": "mossad"
    },
    {
        " , personally led the successful effort to capture ": null
    },
    {
        "Adolf Eichmann": "adolf eichmann"
    },
    {
        " in Buenos Aires. He was also hoping to track down Mengele, so that he too could be brought to trial in Israel. Under interrogation, Eichmann provided the address of a boarding house that had been used as a ": null
    },
    {
        "safe house": "safe house"
    },
    {
        " for Nazi fugitives. ": null
    },
    {
        "Surveillance": "surveillance"
    },
    {
        " of the house did not reveal Mengele or any members of his family, and the neighborhood postman claimed that although Mengele had recently been receiving letters there under his real name, he had since relocated without leaving a forwarding address. Harels inquiries at a machine shop where Mengele had been part owner also failed to generate any leads, so he was forced to abandon the search.     Despite having provided Mengele with legal documents using his real name in 42 , West Germany was now offering a reward for his capture. Continuing newspaper coverage of Mengeles wartime activities, with accompanying photographs, led him to relocate once again in 42 Former pilot ": null
    },
    {
        "Hans-Ulrich Rudel": "hans-ulrich rudel"
    },
    {
        " put him in touch with the Nazi supporter Wolfgang Gerhard, who helped Mengele to cross the border into Brazil. He stayed with Gerhard on his farm near ": null
    },
    {
        "São Paulo": "são paulo"
    },
    {
        " until more permanent accommodation could be found, with Hungarian ": null
    },
    {
        "expatriates": "expatriates"
    },
    {
        " Géza and Gitta Stammer. With the help of an investment from Mengele, the couple bought a farm in ": null
    },
    {
        "Nova Europa": "nova europa"
    },
    {
        ", which Mengele was given the job of managing for them. The three bought a coffee and cattle farm in ": null
    },
    {
        "Serra Negra": "serra negra"
    },
    {
        " in 42 with Mengele owning a half interest. Gerhard had initially told the Stammers that Mengeles name was Peter Hochbichler , but they discovered his true identity in 42 Gerhard persuaded the couple not to report Mengeles location to the authorities by convincing them that they themselves could be implicated for harboring the fugitive. In February 42 West Germany widened its extradition request to include Brazil, having been tipped off to the possibility that Mengele had relocated there.     Meanwhile, ": null
    },
    {
        "Zvi Aharoni": "zvi aharoni"
    },
    {
        ", one of the Mossad agents who had been involved in the Eichmann capture, was placed in charge of a team of agents tasked with tracking down Mengele and bringing him to trial in Israel. Their inquiries in Paraguay revealed no clues to his whereabouts, and they were unable to intercept any correspondence between Mengele and his wife Martha, who was then living in Italy. Agents that were following Rudels movements also failed to produce any leads. Aharoni and his team followed Gerhard to a rural area near São Paulo, where they identified a European man whom they believed to be Mengele. This potential breakthrough was reported to Harel, but the logistics of staging a capture, the budgetary constraints of the search operation, and the priority of focusing on Israels deteriorating relationship with ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " led the Mossad chief to call off the hunt for Mengele in 42       In 42 Mengele and the Stammers jointly purchased a farmhouse in ": null
    },
    {
        "Caieiras": "caieiras"
    },
    {
        ", with Mengele as half owner. When Wolfgang Gerhard returned to Germany in 42 to seek medical treatment for his ailing wife and son, he gave his ": null
    },
    {
        "identity card": "identity document"
    },
    {
        " to Mengele. The Stammers friendship with Mengele deteriorated in late 42 and when they bought a house in São Paulo, Mengele was not invited to join them. The Stammers later bought a bungalow in the ": null
    },
    {
        "Eldorado": "eldorado, são paulo"
    },
    {
        " neighborhood of São Paulo, which they rented out to Mengele. Rolf, who had not seen his father since the ski holiday in 42 visited him at the bungalow in 42; he found an unrepentant Nazi who claimed he had never personally harmed anyone and only carried out his duties as an officer.     Mengeles health had been steadily deteriorating since 42 He suffered a ": null
    },
    {
        "stroke": "stroke"
    },
    {
        " in 42, experienced high blood pressure, and developed an ear infection which affected his balance. On 42 February 42 while visiting his friends Wolfram and Liselotte Bossert in the coastal resort of ": null
    },
    {
        "Bertioga": "bertioga"
    },
    {
        ", Mengele suffered another stroke while swimming and drowned. His body was buried in ": null
    },
    {
        "Embu das Artes": "embu das artes"
    },
    {
        " under the name Wolfgang Gerhard , whose identification Mengele had been using since 42     Other aliases used by Mengele in his later life included Dr. Fausto Rindón and S. Josi Alvers Aspiazu .       Meanwhile, sightings of Josef Mengele were being reported all over the world. Wiesenthal claimed to have information that placed Mengele on the Greek island of ": null
    },
    {
        "Kythnos": "kythnos"
    },
    {
        " in 42 in ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " in 42 in Spain in 42 and in Paraguay in 42 eighteen years after he had left the country. He insisted as late as 42 that Mengele was still alive—six years after he had died—having previously offered a reward of ": null
    },
    {
        "US$": "usd"
    },
    {
        "42 in 42 for the fugitives capture. Worldwide interest in the case was heightened by a mock trial held in ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " in February 42 featuring the testimonies of over one hundred victims of Mengeles experiments. Shortly afterwards, the West German, Israeli, and U.S. governments launched a coordinated effort to determine Mengeles whereabouts. The West German and Israeli governments offered rewards for his capture, as did  The Washington Times  and the ": null
    },
    {
        "Simon Wiesenthal Center": "simon wiesenthal center"
    },
    {
        ".     On 42 May 42 acting on intelligence received by the West German prosecutors office, police raided the house of Hans Sedlmeier, a lifelong friend of Mengele and sales manager of the family firm in Günzburg. They found a coded address book and copies of letters sent to and received from Mengele. Among the papers was a letter from Wolfram Bossert notifying Sedlmeier of Mengeles death. German authorities alerted the police in São Paulo, who then contacted the Bosserts. Under interrogation, they revealed the location of Mengeles grave, and the remains were exhumed on 42 June 42 Extensive ": null
    },
    {
        "forensic": "forensic"
    },
    {
        " examination indicated with a high degree of probability that the body was indeed that of Josef Mengele. Rolf Mengele issued a statement on 42 June confirming that the body was his fathers, and he admitted that the news of his fathers death had been concealed in order to protect the people who had sheltered him for many years.     In 42 ": null
    },
    {
        "DNA test": "dna test"
    },
    {
        "ing confirmed Mengeles identity beyond doubt, but family members refused repeated requests by Brazilian officials to repatriate the remains to Germany. The skeleton is stored at the São Paulo Institute for Forensic Medicine, where it is used as an educational aid during forensic medicine courses at the ": null
    },
    {
        "University of São Paulo": "university of são paulo"
    },
    {
        "s medical school.          In 42 the ": null
    },
    {
        "United States Holocaust Memorial Museum": "united states holocaust memorial museum"
    },
    {
        " received as a donation the ": null
    },
    {
        "Höcker Album": "höcker album"
    },
    {
        ", an album of photographs of Auschwitz staff taken by ": null
    },
    {
        "Karl-Friedrich Höcker": "karl-friedrich höcker"
    },
    {
        ". Eight of the photographs include Mengele.     In February 42 a 42-page volume of Mengeles diary was sold by ": null
    },
    {
        "Alexander Autographs": "alexander autographs"
    },
    {
        " at auction for an undisclosed sum to the grandson of a Holocaust survivor. The unidentified previous owner, who acquired the journals in Brazil, was reported to be close to the Mengele family. A Holocaust survivors organization described the sale as a cynical act of exploitation aimed at profiting from the writings of one of the most heinous Nazi criminals . Rabbi ": null
    },
    {
        "Marvin Hier": "marvin hier"
    },
    {
        " of the Simon Wiesenthal Center was glad to see the diary fall into Jewish hands. At a time when Ahmadinejads Iran regularly denies the Holocaust and anti-Semitism and hatred of Jews is back in vogue, this acquisition is especially significant , he said. In 42 a further 42 volumes of Mengeles diaries were sold—again amidst protests—by the same auction house to an undisclosed collector of World War II memorabilia for US$42.         Racial-Morphological Examinations of the Anterior Portion of the Lower Jaw in Four Racial Groups. This dissertation, completed in 42 and first published in 42 earned him a PhD in anthropology from Munich University. In this work Mengele sought to demonstrate that there were structural differences in the ": null
    },
    {
        "lower jaws": "human mandible"
    },
    {
        " of individuals from different ethnic groups, and that racial distinctions could be made based on these differences. Genealogical Studies in the Cases of Cleft Lip-Jaw-Palate , his medical dissertation, earned him a doctorate in medicine from Frankfurt University. Studying the influence of genetics as a factor in the occurrence of this deformity, Mengele conducted research on families who exhibited these traits in multiple generations. The work also included notes on other abnormalities found in these family lines. Hereditary Transmission of Fistulae Auris. This journal article, published in Der Erbarzt , focuses on ": null
    },
    {
        "fistula auris": "preauricular sinus and cyst"
    },
    {
        " as a hereditary trait. Mengele noted that individuals who have this trait also tend to have a ": null
    },
    {
        "dimple": "dimple"
    },
    {
        " on their chin.": null
    }
]