[
    {
        "     Marie-Joseph Canteloube de Malaret  was a French composer, ": null
    },
    {
        "musicologist": "musicologist"
    },
    {
        ", and author best known for his collections of orchestrated ": null
    },
    {
        "folksong": "folksong"
    },
    {
        "s from the ": null
    },
    {
        "Auvergne": "auvergne"
    },
    {
        " region,  Chants dAuvergne .       Canteloube was born in ": null
    },
    {
        "Annonay": "annonay"
    },
    {
        ", Ardèche, into a family with deep roots in the ": null
    },
    {
        "Auvergne": "auvergne"
    },
    {
        " region of France. He studied piano from the age of six with Amélie Doetzer, a friend of ": null
    },
    {
        "Frédéric Chopin": "frédéric chopin"
    },
    {
        ". After earning his baccalauréat, he worked at a bank in ": null
    },
    {
        "Bordeaux": "bordeaux"
    },
    {
        ". He returned to his family home in Malaret upon his fathers death in 42 remaining there until his mothers death in 42 and then beyond as sole owner of the estate. After a period of silence and mourning, in 42 Canteloube married Charlotte Marthe Calaret, who gave birth to twins Pierre and Guy in 42     He began studying with ": null
    },
    {
        "Vincent dIndy": "vincent dindy"
    },
    {
        " via correspondence in 42 reluctant to leave Malaret. Upon dIndys constant urging, he finally entered the ": null
    },
    {
        "Schola Cantorum": "schola cantorum"
    },
    {
        " in 42 in Paris, where he remained until the beginning of World War I in 42 At the Schola, Canteloube became close friends with fellow composer and student ": null
    },
    {
        "Déodat de Séverac": "déodat de séverac"
    },
    {
        ".     In 42 he wrote a suite in four movements for piano and violin entitled Dans la montagne, which was played at the Société Nationale. Other significant works followed, including Colloque sentimental for voice and string quartet ; Eglogue dAutomne for orchestra ; Vers la Princesse lointaine, a symphonic poem ; Aù printemps for voice and orchestra; and LArada , a song cycle of six  mélodie s .     Canteloube composed his first opera, Le mas , to his own libretto from 42 to 42 . The three-act work won the Prix Heugel in 42 and was awarded the prize of 42 francs. However, the reaction to this composition by the leaders of the Opéra-Comique in Paris was far less enthusiastic than the jury. After pressure from the publisher, it finally premiered on 42 April 42 but it was never revived. His second opera,  Vercingétorix , in four acts, was inspired by a libretto by Étienne Clémentel, mayor of ": null
    },
    {
        "Riom": "riom"
    },
    {
        "  and Hervé Louwyck on the ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        "s defeat by ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        ". The ": null
    },
    {
        "Paris Opéra": "palais garnier"
    },
    {
        " gave the first performance on 42 June 42 but it was accused of lacking theatricality.     In 42 Canteloube founded a group called La Bourrée with several young Auvergnats in Paris who were eager to publicize the folklore and the beauty of their home region. Canteloube himself believed that peasant songs often rise to the level of purest art in terms of feeling and expression, if not in form . He composed several song collections, which include Chants de Haute-Auvergne, albums of songs of ": null
    },
    {
        "Rouergue": "rouergue"
    },
    {
        ", Limousin, and ": null
    },
    {
        "Quercy": "quercy"
    },
    {
        ", regional religious songs , and LHymne des Gaules based on a poem by Philius Lebesque. He also participated in the creation of the Bardic College of Gaul.     In 42 he joined the government in ": null
    },
    {
        "Vichy France": "vichy france"
    },
    {
        " during the ": null
    },
    {
        "Nazi": "nazism"
    },
    {
        " occupation, and wrote in the monarchist newspaper  Action Française . He participated in numerous radio broadcasts of French folklore with his Songs of France with the tenor Christian Selva. The radio was an ideal vehicle for disseminating regional popular music.     Alongside his career as a composer, Canteloube worked as a musicologist, collecting traditional French folksongs, which were published by Didier and Heugel. He also wrote biographies of Vincent dIndy and of his friend Déodat de Séverac .     Canteloube took more than thirty years to complete the compilation of his most admired and famous collection of songs, Chants dAuvergne. These passionate songs reflect the landscapes of the Auvergne in lush orchestral colors and have enabled French folklore and rustic melodies to become better known.     He died in ": null
    },
    {
        "Grigny": "grigny, essonne"
    },
    {
        ", Essonne, in 42 aged 42       ": null
    },
    {
        "Chants dAuvergne, Vol. 42 with Frederica von Stade and the Royal Philharmonic Orchestra, conducted by Antonio de Almeida, Columbia, 42": "chants dauvergne, vol. 1"
    },
    {
        " Chants dAuvergne, Vol. 42 & Triptyque, with Frederica von Stade and the Royal Philharmonic Orchestra, conducted by Antonio de Almeida, Columbia, 42": "chants dauvergne, vol. 2"
    },
    {
        " .   L.G. Boursiac, Canteloube   Françoise Cougniaud-Raginel, Joseph Canteloube : chantre de la terre 42–42   Cahours dAspry, Jean-Bernard. Joseph Canteloube : chantre dAuvergne et dailleurs.                                                                    ": null
    }
]