[
    {
        "            Joseph Aloysius Lyons  was an Australian politician who served as the ": null
    },
    {
        "42th": "list of prime ministers of australia by time in office"
    },
    {
        " Prime Minister of Australia": "prime minister of australia"
    },
    {
        ", in office from 42 until his death in 42 He began his career in the ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        ", but became the founding leader of the ": null
    },
    {
        "United Australia Party": "united australia party"
    },
    {
        " after the ": null
    },
    {
        "42 party split": "australian labor party split of 1931"
    },
    {
        ". He had earlier served as ": null
    },
    {
        "Premier of Tasmania": "premier of tasmania"
    },
    {
        " from 42 to 42     Lyons was born in ": null
    },
    {
        "Stanley, Tasmania": "stanley, tasmania"
    },
    {
        ", and before entering politics worked as a schoolteacher. He was active in the Labor Party from a young age and won election to the ": null
    },
    {
        "Tasmanian House of Assembly": "tasmanian house of assembly"
    },
    {
        " in 42 He served as ": null
    },
    {
        "state treasurer": "treasurer of tasmania"
    },
    {
        " under ": null
    },
    {
        "John Earle": "john earle"
    },
    {
        ", before replacing Earle as party leader in 42 After two elections that ended in hung parliaments, Lyons was appointed premier in 42 at the head of a ": null
    },
    {
        "minority government": "minority government"
    },
    {
        ". He pursued moderate reforms and successfully negotiated a constitutional crisis over the powers of the ": null
    },
    {
        "Legislative Council": "tasmanian legislative council"
    },
    {
        ". At the ": null
    },
    {
        "42 election": "1925 tasmanian state election"
    },
    {
        " he led Labor to its first majority government in Tasmania, but the party lost office three years later.     In 42 Lyons resigned from state parliament to enter federal politics, winning a ": null
    },
    {
        "House of Representatives": "australian house of representatives"
    },
    {
        " seat in Labors landslide victory at the ": null
    },
    {
        "42 election": "1929 australian federal election"
    },
    {
        ". He was immediately appointed to cabinet by the new prime minister ": null
    },
    {
        "James Scullin": "james scullin"
    },
    {
        ", becoming ": null
    },
    {
        "Postmaster-General": "postmaster-general of australia"
    },
    {
        " and ": null
    },
    {
        "Minister for Works and Railways": "minister for works and railways"
    },
    {
        ". In 42 he served as acting treasurer while Scullin was overseas, and came into conflict with the ": null
    },
    {
        "Labor caucus": "australian labor party caucus"
    },
    {
        " over the governments response to the ": null
    },
    {
        "Great Depression": "great depression in australia"
    },
    {
        "; he preferred orthodox financial policies. In early 42 Lyons and his followers left Labor to sit as independents. His exact motivations for leaving the party have been subject to debate. A few months later his group merged with other opposition parties to form the United Australia Party; he was elected ": null
    },
    {
        "Leader of the Opposition": "leader of the opposition"
    },
    {
        ".     Lyons led the UAP to a landslide victory at the ": null
    },
    {
        "42 election": "1931 australian federal election"
    },
    {
        ". Nicknamed Honest Joe , he was known as a masterful political campaigner and became popular with the general public. His personal popularity was a major factor in the governments re-election in ": null
    },
    {
        "42": "1934 australian federal election"
    },
    {
        " and ": null
    },
    {
        "42": "1937 australian federal election"
    },
    {
        "; he was the first prime minister to win three federal elections. The UAP initially governed alone but after 42 formed a coalition with the ": null
    },
    {
        "Country Party": "national party of australia"
    },
    {
        ". Lyons served as his own ": null
    },
    {
        "treasurer": "treasurer of australia"
    },
    {
        " until 42 and oversaw Australias recovery from the Great Depression. He faced a number of foreign-policy challenges, but accelerated Australias transition towards an independent foreign policy. In the lead-up to World War II his government pursued a policy of appeasement and rearmament.     Lyons died of a heart attack in April 42 becoming the first Australian prime minister to die in office. He is the only prime minister from Tasmania and the one of two state premier to become prime minister along with ": null
    },
    {
        "George Reid": "george reid"
    },
    {
        ". Several years after his death, his widow ": null
    },
    {
        "Enid Lyons": "enid lyons"
    },
    {
        " became the first woman elected to the House of Representatives.              Lyons was born in ": null
    },
    {
        "Stanley, Tasmania": "stanley, tasmania"
    },
    {
        ", on 42 September 42 He was the fifth of eight children born to Ellen and Michael Henry Lyons, both of Irish descent. His mother was born in ": null
    },
    {
        "County Kildare": "county kildare"
    },
    {
        " and arrived in Australia in 42 aged eleven, while his father was born in Tasmania to immigrants from ": null
    },
    {
        "County Galway": "county galway"
    },
    {
        ". Lyons was the first prime minister to have an Australian-born parent. His paternal grandfather, Michael Lyons Sr., had arrived in Tasmania in 42 with his wife and an infant daughter. Initially an ": null
    },
    {
        "indentured labourer": "indentured servant"
    },
    {
        ", he became a ": null
    },
    {
        "tenant farmer": "tenant farmer"
    },
    {
        " after completing his term of service, and eventually saved enough to purchase land at Stanley, on the ": null
    },
    {
        "north-west coast": "north west tasmania"
    },
    {
        ". He had a reputation as a shrewd businessman, frequently buying and selling tracts of land and also dabbling in the hotel trade for a period. His sons followed him into farming, and the Lyons family was prominent in the small local community.       When Lyons was four years old, his father moved the family from Stanley to ": null
    },
    {
        "Ulverstone": "ulverstone, tasmania"
    },
    {
        ", where he opened a combined bakery and butchers shop. In 42 he lost the familys savings betting on the ": null
    },
    {
        "Melbourne Cup": "melbourne cup"
    },
    {
        ", driving them into poverty. He had to sell the shop and resort to working as an unskilled labourer; his oldest children took part-time jobs to support the family. Lyons began working at the age of nine, as a printers messenger boy. By the age of twelve, he was cutting scrub for local farmers. Lyons had begun his education at the Ulverstone State School in 42 before switching to the local Catholic school in 42 His early years of schooling were interrupted by his familys financial difficulties, and his attendance was sometimes irregular, though this was not uncommon in small rural schools at the time. In 42 he moved back to Stanley to live with his aunts, Etty and Mary Carroll, and was enrolled at the Stanley State School.       In 42 aged fifteen, Lyons began working as a ": null
    },
    {
        "pupil-teacher": "pupil-teacher"
    },
    {
        " under the ": null
    },
    {
        "monitorial system": "monitorial system"
    },
    {
        ". This allowed him to continue his own education while being paid to teach younger students, and eventually qualify as a full-time teacher himself. Outside of a three-month stint as a relief teacher at ": null
    },
    {
        "Irishtown": "irishtown, tasmania"
    },
    {
        ", he remained at Stanley until early 42 when he was given charge of two small half-time schools on the east coast, Apslawn and Apsley Meadows. During that period, he lived at Apsley House , the family estate of ": null
    },
    {
        "Sir William Lyne": "william lyne"
    },
    {
        ", ": null
    },
    {
        "Premier of New South Wales": "premier of new south wales"
    },
    {
        ". In March 42 Lyons transferred to the Midlands, taking charge of the schools at ": null
    },
    {
        "Conara": "conara, tasmania"
    },
    {
        " and ": null
    },
    {
        "Llewellyn": "llewellyn, tasmania"
    },
    {
        ". He was transferred again in July 42 to ": null
    },
    {
        "Tullah": "tullah, tasmania"
    },
    {
        ", then a few months later to ": null
    },
    {
        "Smithton": "smithton, tasmania"
    },
    {
        ", and then in April 42 to ": null
    },
    {
        "Pioneer": "pioneer, tasmania"
    },
    {
        ". In 42 Lyons moved to ": null
    },
    {
        "Hobart": "hobart"
    },
    {
        " to attend the newly opened Hobart Teachers College for a year. He was then posted to ": null
    },
    {
        "Launceston": "launceston, tasmania"
    },
    {
        ", teaching at the Glen Dhu and Wellington Square State Schools, as well as briefly acting as headmaster at ": null
    },
    {
        "Perth": "perth, tasmania"
    },
    {
        ". He came into conflict with the ": null
    },
    {
        "Department of Education": "department of education"
    },
    {
        " on a number of occasions, often complaining about poor working conditions. His superiors also disapproved of his political activities, which together with his complaints probably contributed to his frequent transfers and failure to win desirable postings.          Lyons came from a family that was broadly sympathetic to the ": null
    },
    {
        "labour movement": "australian labour movement"
    },
    {
        ", but without any formal political involvement. Though widely read, he did not actively participate in politics until after leaving Stanley. Lyons helped found a branch of the ": null
    },
    {
        "Workers Political League": "australian labor party"
    },
    {
        " during his time in Smithton, but was forced to resign his membership due to restrictions on the involvement of public servants in political activities. Those rules were later relaxed, and by 42 he was spending most of his free time campaigning for the ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        "; he had a reputation as a first-rate orator. Lyons was elected to the ": null
    },
    {
        "Tasmanian House of Assembly": "tasmanian house of assembly"
    },
    {
        " at the ": null
    },
    {
        "42 state election": "1909 tasmanian state election"
    },
    {
        ", standing in the six-member ": null
    },
    {
        "Division of Wilmot": "division of wilmot"
    },
    {
        ". This required him to resign from the Education Department and give up his teaching career, which reduced his annual salary from £42 to £42 He was comfortably re-elected ": null
    },
    {
        "in 42": "1912 tasmanian state election"
    },
    {
        ", although he was attacked with a horsewhip during one of his campaign speeches. The son of one of his political opponents was convicted of assault, and the incident received widespread media attention.     Labor came to power in Tasmania in 42 after the existing ": null
    },
    {
        "Liberal": "tasmanian liberal league"
    },
    {
        " government of ": null
    },
    {
        "Albert Solomon": "albert solomon"
    },
    {
        " was defeated on a ": null
    },
    {
        "confidence motion": "confidence motion"
    },
    {
        ". The new premier was ": null
    },
    {
        "John Earle": "john earle"
    },
    {
        ", who had previously held office for one week in October 42  In the new government, Lyons was made ": null
    },
    {
        "Treasurer": "treasurer of tasmania"
    },
    {
        ", Minister for Education, and Minister for Railways; it was common for ministers to hold more than one portfolio.  He was somewhat inexperienced with economic matters, and often turned to his friend and colleague ": null
    },
    {
        "Lyndhurst Giblin": "lyndhurst giblin"
    },
    {
        " for advice; they would eventually renew their relationship at federal level during the 42s. Less than a month after taking office, Lyons announced that the government was moving its accounts from the Commercial Bank of Tasmania to the ": null
    },
    {
        "Commonwealth Bank": "commonwealth bank"
    },
    {
        ", which had only been established a few years earlier. In return he was able to secure a substantial loan and an ": null
    },
    {
        "overdraft": "overdraft"
    },
    {
        " of £42. The government would face a number of challenges during its two years in office, including a statewide drought, a series of ": null
    },
    {
        "bushfires": "bushfires in australia"
    },
    {
        "s in early 42 and labour shortages due to the ongoing war. As Labor was in ": null
    },
    {
        "minority": "minority government"
    },
    {
        ", many of its legislative initiatives were thwarted by the opposition. The party lost the ": null
    },
    {
        "42 state election": "1916 tasmanian state election"
    },
    {
        " by two seats, despite increasing its share of the vote.          When the ALP split over conscription during the First World War in 42 Earle, a pro-conscriptionist, followed Prime Minister ": null
    },
    {
        "Billy Hughes": "billy hughes"
    },
    {
        " out of the Labor party. Like most Australians of Irish Catholic background, Lyons was an anti-conscriptionist and stayed in the Labor Party, becoming its new leader in Tasmania.       Lyons led the Labor opposition in the Tasmanian Parliament until 42 when he became ": null
    },
    {
        "Premier": "premier of tasmania"
    },
    {
        ", leading a minority ALP government. He held office until 42 also serving as Treasurer during the whole period of his premiership. Lyons government was cautious and pragmatic, establishing good relations with business and the conservative government in Canberra, but attracting some criticism from unionists within his own party. Labor narrowly lost the 42 state election to the ": null
    },
    {
        "Nationalist Party": "nationalist party of australia"
    },
    {
        ".      As premier, Lyons faced a ": null
    },
    {
        "constitutional crisis": "constitutional crisis"
    },
    {
        " relating to the powers of the ": null
    },
    {
        "Tasmanian Legislative Council": "tasmanian legislative council"
    },
    {
        " . The Legislative Council had a limited franchise and was occupied mostly by conservative landowners, and was consequently opposed to much of the governments platform. Historically, it had claimed for itself the power to amend ": null
    },
    {
        "money bill": "money bill"
    },
    {
        "s, despite having no express constitutional authority to do so. In November 42 the council returned the governments budget to the Legislative Assembly with a series of proposed reductions in spending. Lyons chose to ignore the amendments, instead sending the bill directly to the Administrator, ": null
    },
    {
        "Herbert Nicholls": "herbert nicholls"
    },
    {
        ", who approved it. In 42 the government amended the state constitution to codify the Legislative Councils powers over money bills, bringing them into line with the other states.     On 42 July 42 Lyons suffered severe leg injuries when his car—driven by a chauffeur—collided with a goods train near ": null
    },
    {
        "Perth": "perth, tasmania"
    },
    {
        ". He came close to death, and stood down from public duties for four months to recover; ": null
    },
    {
        "Allan Guy": "allan guy"
    },
    {
        " was acting premier in his absence. ": null
    },
    {
        "Michael OKeefe": "michael okeefe"
    },
    {
        ", the ": null
    },
    {
        "Speaker of the House of Assembly": "speaker of the tasmanian house of assembly"
    },
    {
        ", was also a passenger in the car, and lingered for several months before dying of his injuries.       At the ": null
    },
    {
        "42 election": "1929 australian federal election"
    },
    {
        " Lyons ran for the federal seat of ": null
    },
    {
        "Wilmot": "division of wilmot"
    },
    {
        ", covering the same territory as his state seat. He was swept into office in Labors landslide victory under ": null
    },
    {
        "James Scullin": "james scullin"
    },
    {
        ". He was appointed ": null
    },
    {
        "Postmaster-General": "minister for broadband, communications and the digital economy"
    },
    {
        " and ": null
    },
    {
        "Minister for Works and Railways": "minister for infrastructure, transport, regional development and local government"
    },
    {
        ".      When the ": null
    },
    {
        "Depression": "great depression"
    },
    {
        " struck in 42 the Scullin government split over its response. Lyons became the leading advocate within the government of orthodox finance and deflationary economic policies, and an opponent of the inflationary, proto-": null
    },
    {
        "Keynesian": "keynesian economics"
    },
    {
        " policies of Treasurer ": null
    },
    {
        "Ted Theodore": "ted theodore"
    },
    {
        ". Theodore was forced to resign over accusations of corruption in June 42 and Scullin took over the Treasury portfolio in addition to the Prime Ministership. Lyons served as acting Treasurer from August 42 to January 42 whilst Scullin was in Britain for the ": null
    },
    {
        "Imperial Conference": "imperial conference"
    },
    {
        ". Lyons announced his plan for recovery in October 42 insisting on the need to maintain a balanced budget and cut public spending and salaries, although also advising lower interest rates and the provision of greater credit for industry.     His conservative economic approach won him support among business, but angered many in the Labor caucus, who wanted to expand the deficit to stimulate the economy, and were horrified at the prospect of cuts in salaries and government spending. Alienated by their attacks, Lyons began to consider suggestions from a group of his new business supporters, including influential members of the Melbourne Establishment, that he leave the government to take over the leadership of the conservative opposition.             When Scullin returned in January 42 he reappointed Theodore to the Cabinet as Treasurer, which Lyons took as a rejection of his own policies. Lyons immediately resigned from the Cabinet, and then in mid–March from the Labor Party. .  University of Tasmania . Retrieved 42 June 42 Accompanied by another senior minister in the Scullin government, ": null
    },
    {
        "James Fenton": "james fenton"
    },
    {
        ", and four other right-wing Labor MPs, he crossed the floor to sit on the opposition benches. Soon afterward, Lyons and his supporters joined with the opposition ": null
    },
    {
        "Nationalist Party": "nationalist party of australia"
    },
    {
        " and the ": null
    },
    {
        "Australian Party": "australian party"
    },
    {
        ", a small party led by Billy Hughes, to form a new party, the ": null
    },
    {
        "United Australia Party": "united australia party"
    },
    {
        " .     Although the UAP was essentially an enlarged Nationalist Party, Lyons was chosen as leader of the party. He thus became ": null
    },
    {
        "Leader of the Opposition": "list of australian leaders of the opposition"
    },
    {
        ", with former Nationalist leader ": null
    },
    {
        "John Latham": "john latham"
    },
    {
        " as his deputy. The UAP realised that Lyons, an affable family man with the common touch, was a far more electorally appealing figure than the aloof Latham. Additionally, his Labor background and his Catholicism would allow him to win traditional Labor constituencies  over to what was essentially an upper- and middle-class conservative party.      In March, at about the same time as Lyons led his group of defectors from the right of the Labor Party across the floor, five left-wing NSW Labor MPs, supporters of ": null
    },
    {
        "New South Wales": "new south wales"
    },
    {
        " Premier ": null
    },
    {
        "Jack Lang": "jack lang"
    },
    {
        ", also split from the official Labor Party over the governments economic policies , forming a Lang Labor group on the cross-benches and costing the government its majority in the House of Representatives. Late in the year, the Langite MPs supported a UAP ": null
    },
    {
        "no-confidence motion": "motion of no confidence"
    },
    {
        " and brought the government down, forcing an early election.                 At the ": null
    },
    {
        "42 election": "1931 australian federal election"
    },
    {
        " Lyons and the UAP offered stable, orthodox financial policies in response to what they branded as Scullins poor stewardship of the economy. While Labor remained split between the official party and the Langites, the UAP projected an image of putting national unity above class conflict. The result was a huge victory for the UAP, which took 42 seats against 42 seats for the two wings of the Labor Party combined. ": null
    }
]