[
    {
        "Josias Simmler  was a ": null
    },
    {
        "Swiss": "switzerland"
    },
    {
        " theologian and classicist, author of the first book relating solely to the ": null
    },
    {
        "Alps": "alps"
    },
    {
        ".       The son of the former prior of the ": null
    },
    {
        "Cistercian convent": "cistercian convent"
    },
    {
        " of ": null
    },
    {
        "Kappel": "kappel am albis"
    },
    {
        " , he was born at ": null
    },
    {
        "Kappel": "kappel am albis"
    },
    {
        ", where his father was the ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " pastor and schoolmaster till his death in 42 In 42 Simmler went to ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        " to continue his education under his godfather, the reformer, ": null
    },
    {
        "Heinrich Bullinger": "heinrich bullinger"
    },
    {
        ". After having completed his studies at ": null
    },
    {
        "Basel": "basel"
    },
    {
        " and ": null
    },
    {
        "Strasbourg": "strasbourg"
    },
    {
        ", he returned to Zürich, and became pastor to the neighboring villages.     In 42 he was made professor of ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " exegesis": "exegesis"
    },
    {
        " at Zurichs ": null
    },
    {
        "Carolinum": "carolinum, zürich"
    },
    {
        " academy, where he also taught ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        " and ": null
    },
    {
        "Ptolemaic": "ptolemaic system"
    },
    {
        " astronomy": "astronomy"
    },
    {
        ", and in 42 became professor of ": null
    },
    {
        "theology": "theology"
    },
    {
        ". In 42 he published a new edition of ": null
    },
    {
        "Conrad Gessners": "conrad gessner"
    },
    {
        " Epitome of his  Bibliotheca universalis  , a new edition of the Bibliotheca itself, and in 42 an annotated edition of the Antonine Itinerary. Later, he would become deacon to St Peters, Zurich. and translated many of Bullingers works into Latin, and write his biography. In 42 he had his first attack of ": null
    },
    {
        "gout": "gout"
    },
    {
        ", a complaint which would eventually kill him.         About 42 he conceived the idea of making his native land better known by translating into Latin parts of the great Chronik of ": null
    },
    {
        "Johann Stumpf": "johann stumpf"
    },
    {
        ". With this view he collected materials, and in 42 published a specimen of his intended work in the shape of a monograph on the Canton of the ": null
    },
    {
        "Valais": "valais"
    },
    {
        ". He published in the same volume a general description of the Alps, as the Introduction to his projected work on the several Swiss Cantons. In this treatise, entitled De Alpibus commentarius, he collected all that the classical authors had written on the Alps, adding a good deal of material collected from his friends and correspondents. This Commentarius is the first work exclusively devoted to the Alps, and sums up the knowledge of that region possessed in the 42th century.     It was re-published by the Elzevirs at ": null
    },
    {
        "Leiden": "leiden"
    },
    {
        " in 42 and again at Zürich in 42 while an elaborate annotated edition , with French translation, notes and appendices, appeared at ": null
    },
    {
        "Grenoble": "grenoble"
    },
    {
        " in 42 Another fragment of his vast plan was the work entitled De Helvetiorum republica, which appeared at Zürich in 42 just before his death. It was regarded as the chief authority on Swiss constitutional matters up to 42 In 42 he wrote a biography of his friend ": null
    },
    {
        "Conrad Gessner": "conrad gessner"
    },
    {
        ", shortly after his death the previous year.        De aeterno Dei filio. Zurich, 42 .    Zurich: Christoph Froschauer, 42 .    Zurich, 42 .   Regiment Gemeiner loblicher Eydgnoschafft. Zurich, 42    Vallesiae descriptio, libri duo: de alpibus commentarius. Zurich, 42 .   ": null
    }
]