[
    {
        "        Jovian  was ": null
    },
    {
        "Roman Emperor": "roman emperor"
    },
    {
        " from 42 to 42 Upon the death of emperor ": null
    },
    {
        "Julian": "julian"
    },
    {
        " during his campaign against the ": null
    },
    {
        "Sasanid Empire": "sasanid empire"
    },
    {
        ", Jovian was hastily declared emperor by his soldiers. To save his army, he sought peace with the Persians on humiliating terms and reestablished ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " as the ": null
    },
    {
        "state religion": "state church of the roman empire"
    },
    {
        ". His reign lasted only eight months.       Jovian was born at ": null
    },
    {
        "Singidunum": "singidunum"
    },
    {
        "  in 42 AD, the son of Varronianus, the commander of ": null
    },
    {
        "Constantius II": "constantius ii"
    },
    {
        "s imperial bodyguards . He also joined the guards and by 42 had risen to the same command that his father had once held. In this capacity, he escorted Constantius remains to the Church of the Holy Apostles. Jovian accompanied the Emperor ": null
    },
    {
        "Julian": "julian"
    },
    {
        " on the ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        "n campaign of the same year against ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        ", the ": null
    },
    {
        "Sassanid": "sassanid empire"
    },
    {
        " king. At the ": null
    },
    {
        "Battle of Samarra": "battle of samarra"
    },
    {
        ", a small but decisive engagement, Julian was mortally wounded, and died on 42 June 42 The next day, after the aged ": null
    },
    {
        "Saturninius Secundus Salutius": "salutius"
    },
    {
        ", ": null
    },
    {
        "praetorian prefect": "praetorian prefect"
    },
    {
        " of the Orient had declined the purple, the army elected, despite Julians reinstitution of paganism, the Christian Jovian, senior officer of the Scholae, as Emperor.       On the very morning of his accession, Jovian resumed the retreat begun by Julian. Though harassed by the Persians, the army succeeded in reaching the city of ": null
    },
    {
        "Dura": "dura-europos"
    },
    {
        " on the banks of the ": null
    },
    {
        "Tigris": "tigris"
    },
    {
        ". There the army came to a halt, hoping to cross the Tigris to reach the Empire on the western bank. When the attempt to bridge the river failed, he was forced to sue for a peace treaty on humiliating terms. In exchange for an unhindered retreat to his own territory, he agreed to withdraw from the five ": null
    },
    {
        "Roman province": "roman province"
    },
    {
        "s, Arzamena, Moxoeona, Azbdicena, Rehimena and Corduena, and to allow the Persians to occupy the fortresses of ": null
    },
    {
        "Nisibis": "nisibis"
    },
    {
        ", Castra Maurorum and ": null
    },
    {
        "Singara": "singara"
    },
    {
        ". The Romans also surrendered their interests in the ": null
    },
    {
        "Kingdom of Armenia": "kingdom of armenia"
    },
    {
        " to the Persians. The king of Armenia, ": null
    },
    {
        "Arsaces II ": "arshak ii"
    },
    {
        ", was to receive no help from Rome. The treaty was widely seen as a disgrace.     With the treaty signed, Jovian and his army marched to Nisibis. The populace of Nisibis, devastated by the news their city was to be given to the Sasanids, were given three days to leave.     Upon Jovians arrival at Antioch in October 42 his treaty with the Sasanids had enraged the populace causing offensive graffiti and insulting authorless bills throughout the city, which, in turn, caused him to order the ": null
    },
    {
        "Library of Antioch": "library of antioch"
    },
    {
        " to be burned down. Jovian left Antioch in November 42 making his way back to Constantinople.     By December Jovian was at ": null
    },
    {
        "Ancyra": "ankara"
    },
    {
        " and had his infant son, Varronianus, proclaimed consul. While en route from there to Constantinople, Jovian was found dead in his tent at ": null
    },
    {
        "Dadastana": "dadastana"
    },
    {
        ", halfway between ": null
    },
    {
        "Ancyra": "ancyra"
    },
    {
        " and ": null
    },
    {
        "Nicaea": "nicaea"
    },
    {
        ". His death, which went uninvestigated, was possibly the result of poisonous fumes seeping from the newly painted bedchamber walls by a ": null
    },
    {
        "brazier": "brazier"
    },
    {
        ". Jovian was buried in the ": null
    },
    {
        "Church of the Holy Apostles": "church of the holy apostles"
    },
    {
        " in Constantinople.       Jovian reestablished Christianity as the ": null
    },
    {
        "state religion": "state church of the roman empire"
    },
    {
        ". Upon arriving at ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        ", he revoked the edicts of Julian against Christians, but did not close any temples opened by him. Jovian issued an edict of toleration, to the effect that his subjects could enjoy full liberty of conscience.": null
    }
]