[
    {
        "Juan de Valdés was a ": null
    },
    {
        "Spanish": "spain"
    },
    {
        " religious writer and ": null
    },
    {
        "Protestant reformer": "protestant reformer"
    },
    {
        ".     He was the younger of twin sons of Fernando de Valdés, hereditary  regidor  of ": null
    },
    {
        "Cuenca": "cuenca"
    },
    {
        " in ": null
    },
    {
        "Castile": "castile"
    },
    {
        ", where Valdés was born. He has been confused with his twin brother ": null
    },
    {
        "Alfonso": "alfonso de valdés"
    },
    {
        " . Alfonso died in 42 at Vienna.       Juan, who probably studied at the ": null
    },
    {
        "University of Alcalá": "university of alcalá"
    },
    {
        ", first appears as the anonymous author of a politico-religious Diálogo de Mercurio y Carón, written and published about 42 A passage in this work may have suggested ": null
    },
    {
        "Don Quixote": "don quixote"
    },
    {
        "s advice to ": null
    },
    {
        "Sancho Panza": "sancho panza"
    },
    {
        " on appointment to his governorship. The Diálogo attacked the corruptions of the Roman Church; hence Valdés, in fear of the ": null
    },
    {
        "Spanish Inquisition": "spanish inquisition"
    },
    {
        ", left Spain for ": null
    },
    {
        "Naples": "naples"
    },
    {
        " in 42     In 42 he removed to ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", where his criticisms of papal policy were condoned, since in his Diálogo he had upheld the validity of ": null
    },
    {
        "Henry VIII": "henry viii of england"
    },
    {
        "s marriage with ": null
    },
    {
        "Catherine of Aragon": "catherine of aragon"
    },
    {
        ". On 42 January 42 he writes from ": null
    },
    {
        "Bologna": "bologna"
    },
    {
        ", in attendance upon ": null
    },
    {
        "Pope Clement VII": "pope clement vii"
    },
    {
        ". From the autumn of 42 he made Naples his permanent residence, his name being Italianized as Valdésso and Val dEsso. Confusion with his brother may account for the statement of his appointment by ": null
    },
    {
        "Charles V": "charles v of naples"
    },
    {
        " as secretary to the viceroy at Naples, ": null
    },
    {
        "Don Pedro de Toledo": "don pedro de toledo"
    },
    {
        "; there is no proof of his holding any official position, though Curione writes of him as cavalliere di Cesare. His house on the Chiaja was the centre of a literary and religious circle; his conversations and writings stimulated the desire for a spiritual reformation of the church.     His first production at Naples was a ": null
    },
    {
        "philological": "philology"
    },
    {
        " treatise, Diálogo de la Lengua . His works entitle him to a foremost place among Spanish prose writers. His friends urged him to seek distinction as a humanist, but his bent was towards problems of Biblical interpretation in their bearing on the devout life. ": null
    },
    {
        "Vermigli": "pietro martire vermigli"
    },
    {
        " and ": null
    },
    {
        "Marcantonio Flaminio": "marcantonio flaminio"
    },
    {
        " were leading spirits in his coterie, which included the marchioness of Pescara ": null
    },
    {
        "Vittoria Colonna": "vittoria colonna"
    },
    {
        " , since 42 and her younger widower sister-in-law, ": null
    },
    {
        "Giulia Gonzaga": "giulia gonzaga"
    },
    {
        ", .     His influence was great on ": null
    },
    {
        "Ochino": "ochino"
    },
    {
        ", for whose sermons he furnished themes. ": null
    },
    {
        "Pietro Carnesecchi": "pietro carnesecchi"
    },
    {
        ", , burned by the Inquisition in 42 who had known Valdés at Rome as a modest and well-bred courtier, found him at Naples wholly intent upon the study of Holy Scripture, translating portions into Spanish from ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " and ": null
    },
    {
        "Greek": "greek language"
    },
    {
        ", with comments and introductions. To him Carnesecchi ascribes his own adoption of the Evangelical doctrine of justification by faith, and at the same time his rejection of the policy of the Lutheran schism. Valdés died at Naples in May 42     His death scattered his band of associates. Abandoning the hope of a regenerated Catholicism, Ochino and Vermigli left Italy. Some of Valdéss writings were by degrees published in Italian translations. Showing much originality and penetration, they combine a delicate vein of semi-mystical spirituality with the personal charm attributed to their author in all contemporary notices. Llorente traces in Valdés the influence of ": null
    },
    {
        "Tauler": "tauler"
    },
    {
        "; any such influence must have been at second hand. The Aviso on the interpretation of Scripture, based on Tauler, was probably the work of Alfonso. Valdés was in relations with Fra Benedetto of Mantua, the anonymous author of Del Benefizio di Gesù Cristo Crocefisso, revised by Flaminio .     The suggestion that Valdés departed from Catholic Orthodoxy about the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        " was first made in 42 by the Transylvanian bishop, ": null
    },
    {
        "Ferenc Dávid": "ferenc dávid"
    },
    {
        "; it has been adopted by Sand , Wallace and other ": null
    },
    {
        "nontrinitarian": "nontrinitarian"
    },
    {
        " writers, and is countenanced by Bayle. To this view some colour is given by isolated expressions in his writings, and by the subsequent course of Ochino . ": null
    },
    {
        "Gaston Bonet-Maury": "gaston bonet-maury"
    },
    {
        " comments: Valdés never discusses the Trinity , reserving it  as a topic for advanced Christians; yet he explicitly affirms the consubstantiality of the Son, whom he unites in doxologies with the Father and the Holy Spirit . Practical theology interested him more than speculative, his aim being the promotion of a healthy and personal piety.        Diálogo de Lactancio y un Arcediano, also known as: Diálogo de las cosas ocurridas en Roma, ca. 42 as well as Diálogo de Mercurio y Carón, ca. 42 by Juans brother: ": null
    },
    {
        "Alfonso de Valdés": "alfonso de valdés"
    },
    {
        ", are ascribed to Juan in the reprint, . An Italian translation  of both works was printed in Venice as .   .   , from a manuscript in the Palatine Library, Vienna; ; .   . First printing: Venice . English translation  by ": null
    },
    {
        " Benjamin Barron Wiffen ": "benjamin barron wiffen"
    },
    {
        " ; no Spanish original is known.    . English translation into . No known Spanish original.   ; all copies of the original edition suppressed by the Spanish Inquisition; thirty-nine of the .   Seven Doctrinal Letters , in English, by JT Betts, with the Opuscules.   Comentario Breve... sobre la Epístola de San Pablo a los Romanos, Venice, 42 ; reprinted, 42; in English, by J. T. Betts, 42   Comentario Breve... sobre la Primera Epístola de san Pablo a los Corintios, Venice, 42   El Evangelio de San Mateo , 42 from Vienna manuscript; in English, by JT Betts, 42   El Salterio , published with the Trataditos from Vienna manuscript.   At Vienna is an unpublished commentary in Spanish on Psalms i.–xli.   ": null
    },
    {
        "Christopher Sandius": "christopher sandius"
    },
    {
        " in his ": null
    },
    {
        "Bibliotheca antitrinitariorum": "bibliotheca antitrinitariorum"
    },
    {
        " mentions a commentary on St Johns Gospel, not known to exist.       Notices of Valdés are in , Bayle and . Revival of interest in him is due to   .   .     Fuller knowledge of his career was opened up by ": null
    },
    {
        "Benjamin B. Wiffen": "benjamin b. wiffen"
    },
    {
        ", whose Life of Valdés is prefixed to Bettss translation of the . Discoveries have since been made in the Aulic Library, Vienna, by ": null
    },
    {
        "Edward Boehmer": "edward boehmer"
    },
    {
        ":   .    ": null
    }
]