[
    {
        "                       Judaism  is the ": null
    },
    {
        "ethnic religion": "ethnic religion"
    },
    {
        " of the ": null
    },
    {
        "Jewish people": "jews"
    },
    {
        ", comprising the collective ": null
    },
    {
        "religious": "religious"
    },
    {
        ", ": null
    },
    {
        "cultural": "cultural"
    },
    {
        " and ": null
    },
    {
        "legal": "legal"
    },
    {
        " tradition and civilization of the ": null
    },
    {
        "Jewish people": "jewish people"
    },
    {
        ". ": null
    },
    {
        "Lawrence Schiffman": "lawrence schiffman"
    },
    {
        ", Understanding Second Temple and Rabbinic Judaism. ": null
    },
    {
        "KTAV Publishing House": "ktav publishing house"
    },
    {
        ", 2003. p. 3. Judaism is considered by religious Jews to be the expression of the ": null
    },
    {
        "covenant": "mosaic covenant"
    },
    {
        " that ": null
    },
    {
        "God": "god in judaism"
    },
    {
        " established with the ": null
    },
    {
        "Children of Israel": "children of israel"
    },
    {
        ". It encompasses a wide body of texts, practices, theological positions, and forms of organization. The ": null
    },
    {
        "Torah": "torah"
    },
    {
        " is part of the larger text known as the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        " or the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        ", and supplemental oral tradition represented by later texts such as the ": null
    },
    {
        "Midrash": "midrash"
    },
    {
        " and the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        ". With between 14.5 and 17.4  million adherents worldwide, Judaism is ": null
    },
    {
        "the tenth largest religion in the world": "major religious groupsreligious demographics"
    },
    {
        ".     Within Judaism there are a variety of movements, most of which emerged from ": null
    },
    {
        "Rabbinic Judaism": "rabbinic judaism"
    },
    {
        ", which holds that God revealed his laws and ": null
    },
    {
        "commandments": "613 mitzvot"
    },
    {
        " to ": null
    },
    {
        "Moses": "moses"
    },
    {
        " on ": null
    },
    {
        "Mount Sinai": "biblical mount sinai"
    },
    {
        " in the form of both the ": null
    },
    {
        "Written": "torah"
    },
    {
        " and ": null
    },
    {
        "Oral Torah": "oral torah"
    },
    {
        ". Historically, all or part of this assertion was challenged by various groups such as the ": null
    },
    {
        "Sadducees": "sadduceesgeneral"
    },
    {
        " and ": null
    },
    {
        "Hellenistic Judaism": "hellenistic judaism"
    },
    {
        " during the ": null
    },
    {
        "Second Temple period": "second temple period"
    },
    {
        "; the ": null
    },
    {
        "Karaites": "karaite judaismkaraite interpretations of the torah"
    },
    {
        " and ": null
    },
    {
        "Sabbateans": "sabbateans"
    },
    {
        " during the early and later medieval period; and among segments of the modern non-Orthodox denominations. Modern branches of Judaism such as ": null
    },
    {
        "Humanistic Judaism": "humanistic judaism"
    },
    {
        " may be ": null
    },
    {
        "nontheistic": "nontheistic"
    },
    {
        ". Today, the largest ": null
    },
    {
        "Jewish religious movements": "jewish religious movements"
    },
    {
        " are ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        " , ": null
    },
    {
        "Conservative Judaism": "conservative judaism"
    },
    {
        ", and ": null
    },
    {
        "Reform Judaism": "reform judaism"
    },
    {
        ". Major sources of difference between these groups are their approaches to ": null
    },
    {
        "Jewish law": "jewish law"
    },
    {
        ", the authority of the ": null
    },
    {
        "Rabbinic tradition": "rabbinic tradition"
    },
    {
        ", and the significance of the ": null
    },
    {
        "State of Israel": "state of israel"
    },
    {
        ". Orthodox Judaism maintains that the Torah and Jewish law are divine in origin, eternal and unalterable, and that they should be strictly followed. Conservative and Reform Judaism are more ": null
    },
    {
        "liberal": "religious liberalism"
    },
    {
        ", with Conservative Judaism generally promoting a more traditionalist interpretation of Judaisms requirements than Reform Judaism. A typical Reform position is that Jewish law should be viewed as a set of general guidelines rather than as a set of restrictions and obligations whose observance is required of all Jews. Historically, ": null
    },
    {
        "special courts": "beth din"
    },
    {
        " enforced Jewish law; today, these courts still exist but the practice of Judaism is mostly voluntary. Authority on theological and legal matters is not vested in any one person or organization, but in the sacred texts and the ": null
    },
    {
        "rabbis": "rabbis"
    },
    {
        " and scholars who interpret them.     Judaism has its roots as an ": null
    },
    {
        "organized religion": "organized religion"
    },
    {
        " in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        " during the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        ".  It evolved from ancient Israelite religions around 500 BCE,  and is considered one of the oldest monotheistic religions.  PBS The ": null
    },
    {
        "Hebrews": "hebrews"
    },
    {
        " and ": null
    },
    {
        "Israelites": "israelites"
    },
    {
        " were already referred to as Jews in later books of the Tanakh such as the ": null
    },
    {
        "Book of Esther": "book of esther"
    },
    {
        ", with the term Jews replacing the title Children of Israel . Judaisms texts, traditions and values strongly influenced later ": null
    },
    {
        "Abrahamic religions": "abrahamic religions"
    },
    {
        ", including ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ", ": null
    },
    {
        "Islam": "islam"
    },
    {
        " and the ": null
    },
    {
        "Bahai Faith": "bahai faith"
    },
    {
        ". Many aspects of Judaism have also directly or indirectly influenced ": null
    },
    {
        "secular": "secular"
    },
    {
        " Western": "western world"
    },
    {
        " ethics": "ethics"
    },
    {
        " and ": null
    },
    {
        "civil law": "civil law"
    },
    {
        ".  ": null
    },
    {
        "Hebraism": "hebraism"
    },
    {
        " was just as important a factor in the ancient era development of ": null
    },
    {
        "Western civilization": "western civilization"
    },
    {
        " as ": null
    },
    {
        "Hellenism": "wikt:hellenism"
    },
    {
        ", and Judaism, as the background of ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ", has considerably shaped Western ideals and morality since ": null
    },
    {
        "Early Christianity": "early christianity"
    },
    {
        ". Cambridge University Historical Series, An Essay on Western Civilization in Its Economic Aspects, p.40: Hebraism, like Hellenism, has been an all-important factor in the development of Western Civilization; Judaism, as the precursor of Christianity, has indirectly had had much to do with shaping the ideals and morality of western nations since the christian era.     Jews are an ": null
    },
    {
        "ethnoreligious group": "ethnoreligious group"
    },
    {
        " including those born Jewish, in addition to ": null
    },
    {
        "converts to Judaism": "converts to judaism"
    },
    {
        ". In 2015, the ": null
    },
    {
        "world Jewish population": "jewish population by country"
    },
    {
        " was estimated at about 14.3  million, or roughly 0.2% of the total world population.  About 43% of all Jews reside in Israel and another 43% reside in the United States and Canada, with most of the remainder living in Europe, and other minority groups spread throughout Latin America, Asia, Africa, and Australia.            Unlike other ancient Near Eastern gods, the Hebrew God is portrayed as unitary and solitary; consequently, the Hebrew Gods principal relationships are not with other gods, but with the world, and more specifically, with the people he created.  Judaism thus begins with ethical monotheism: the belief that God is one and is concerned with the actions of mankind. According to the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        " , God promised ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        " to make of his offspring a great nation. Many generations later, he commanded the nation of ": null
    },
    {
        "Israel": "israelites"
    },
    {
        " to love and worship only one God; that is, the Jewish nation is to reciprocate Gods concern for the world. He also commanded the Jewish people to love one another; that is, Jews are to imitate Gods love for people. These commandments are but two of a large corpus of ": null
    },
    {
        "commandments": "613 mitzvot"
    },
    {
        " and ": null
    },
    {
        "laws": "halakha"
    },
    {
        " that constitute this ": null
    },
    {
        "covenant": "covenant"
    },
    {
        ", which is the substance of Judaism.     Thus, although there is an esoteric tradition in Judaism , Rabbinic scholar ": null
    },
    {
        "Max Kadushin": "max kadushin"
    },
    {
        " has characterized normative Judaism as normal mysticism , because it involves everyday personal experiences of God through ways or modes that are common to all Jews. This is played out through the observance of the ": null
    },
    {
        "Halakha": "halakha"
    },
    {
        " and given verbal expression in the ": null
    },
    {
        "Birkat Ha-Mizvot": "list of jewish prayers and blessings"
    },
    {
        ", the short blessings that are spoken every time a positive commandment is to be fulfilled.   :The ordinary, familiar, everyday things and occurrences we have, constitute occasions for the experience of God. Such things as ones daily sustenance, the very day itself, are felt as manifestations of Gods loving-kindness, calling for the Berakhot. Kedushah, holiness, which is nothing else than the imitation of God, is concerned with daily conduct, with being gracious and merciful, with keeping oneself from defilement by idolatry, adultery, and the shedding of blood. The Birkat Ha-Mitzwot evokes the consciousness of holiness at a rabbinic rite, but the objects employed in the majority of these rites are non-holy and of general character, while the several holy objects are ": null
    },
    {
        "non-theurgic.": "theurgy"
    },
    {
        " And not only do ordinary things and occurrences bring with them the experience of God. Everything that happens to a man evokes that experience, evil as well as good, for a Berakah is said also at evil tidings. Hence, although the experience of God is like none other, the occasions for experiencing Him, for having a consciousness of Him, are manifold, even if we consider only those that call for Berakot.   Whereas ": null
    },
    {
        "Jewish philosophers": "jewish philosophy"
    },
    {
        " often debate whether God is ": null
    },
    {
        "immanent": "immanence"
    },
    {
        " or ": null
    },
    {
        "transcendent": "transcendence"
    },
    {
        ", and whether people have free will or their lives are determined, ": null
    },
    {
        "Halakha": "halakha"
    },
    {
        " is a system through which any Jew acts to bring God into the world.     Ethical monotheism is central in all sacred or normative texts of Judaism. However, monotheism has not always been followed in practice. The Jewish Bible  records and repeatedly condemns the widespread worship of other gods in ": null
    },
    {
        "ancient Israel": "ancient israel"
    },
    {
        ". In the Greco-Roman era, many different interpretations of monotheism existed in Judaism, including the interpretations that gave rise to Christianity.     Moreover, some have argued that Judaism is a non-creedal religion that does not require one to believe in God.   For some, observance of Jewish law is more important than belief in God per se. In modern times, some liberal Jewish movements do not accept the existence of a personified deity active in history.  The debate about whether one can speak of authentic or normative Judaism is not only a debate among religious Jews but also among historians.                Scholars throughout ": null
    },
    {
        "Jewish history": "jewish history"
    },
    {
        " have proposed numerous formulations of Judaisms core tenets, all of which have met with criticism. The most popular formulation is ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " thirteen principles of faith": "13 principles of faith"
    },
    {
        ", developed in the 12th century. According to Maimonides, any Jew who rejects even one of these principles would be considered an apostate and a heretic. Jewish scholars have held points of view diverging in various ways from Maimonides principles.     In Maimonides time, his list of tenets was criticized by ": null
    },
    {
        "Hasdai Crescas": "hasdai crescas"
    },
    {
        " and ": null
    },
    {
        "Joseph Albo": "joseph albo"
    },
    {
        ". Albo and ": null
    },
    {
        "the Raavad": "abraham ben david"
    },
    {
        " argued that Maimonides principles contained too many items that, while true, were not fundamentals of the faith.     Along these lines, the ancient historian ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        " emphasized practices and observances rather than religious beliefs, associating ": null
    },
    {
        "apostasy": "apostasy"
    },
    {
        " with a failure to observe Jewish law and maintaining that the requirements for conversion to Judaism included ": null
    },
    {
        "circumcision": "circumcision"
    },
    {
        " and adherence to traditional customs. Maimonides principles were largely ignored over the next few centuries. Later, two poetic restatements of these principles  became integrated into many Jewish liturgies, leading to their eventual near-universal acceptance.     In modern times, Judaism lacks a centralized authority that would dictate an exact religious dogma. Because of this, many different variations on the basic beliefs are considered within the scope of Judaism. Even so, all ": null
    },
    {
        "Jewish religious movements": "jewish religious movements"
    },
    {
        " are, to a greater or lesser extent, based on the principles of the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        " and various commentaries such as the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " and ": null
    },
    {
        "Midrash": "midrash"
    },
    {
        ". Judaism also universally recognizes the Biblical ": null
    },
    {
        "Covenant": "covenant"
    },
    {
        " between God and the ": null
    },
    {
        "Patriarch": "patriarchs"
    },
    {
        " Abraham": "abraham"
    },
    {
        " as well as the additional aspects of the Covenant revealed to ": null
    },
    {
        "Moses": "moses"
    },
    {
        ", who is considered Judaisms greatest ": null
    },
    {
        "prophet": "prophet"
    },
    {
        ". In the ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        ", a core text of ": null
    },
    {
        "Rabbinic Judaism": "rabbinic judaism"
    },
    {
        ", acceptance of the Divine origins of this covenant is considered an essential aspect of Judaism and those who reject the Covenant forfeit their share in the ": null
    },
    {
        "World to Come": "world to come"
    },
    {
        ".     Establishing the core tenets of Judaism in the modern era is even more difficult, given the number and diversity of the contemporary ": null
    },
    {
        "Jewish denominations": "jewish religious movements"
    },
    {
        ". Even if to restrict the problem to the most influential intellectual trends of the nineteenth and twentieth century, the matter remains complicated. Thus for instance, ": null
    },
    {
        "Joseph Soloveitchiks": "joseph b. soloveitchik"
    },
    {
        "  answer to modernity is constituted upon the identification of Judaism with following the ": null
    },
    {
        "halakha": "halakha"
    },
    {
        " whereas its ultimate goal is to bring the holiness down to the world. ": null
    },
    {
        "Mordecai Kaplan": "mordecai kaplan"
    },
    {
        ", the founder of the ": null
    },
    {
        "Reconstructionist Judaism": "reconstructionist judaism"
    },
    {
        ", abandons the idea of religion for the sake of identifying Judaism with ": null
    },
    {
        "civilization": "civilization"
    },
    {
        " and by means of the latter term and secular translation of the core ideas, he tries to embrace as many Jewish denominations as possible. In turn, ": null
    },
    {
        "Solomon Schechters": "solomon schechter"
    },
    {
        " Conservative Judaism": "conservative judaism"
    },
    {
        " was identical with the tradition understood as the interpretation of Torah, in itself being the history of the constant updates and adjustment of the Law performed by means of the creative interpretation. Finally, ": null
    },
    {
        "David Philipson": "david philipson"
    },
    {
        " draws the outlines of the ": null
    },
    {
        "Reform movement": "reform judaism"
    },
    {
        " in Judaism by opposing it to the strict and traditional rabbinical approach and thus comes to the conclusions similar to that of the Conservative movement.           The following is a basic, structured list of the central works of Jewish practice and thought.   ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        "  and ": null
    },
    {
        "Rabbinic literature": "rabbinic literature"
    },
    {
        " Mesorah": "masoretic text"
    },
    {
        " Targum": "targum"
    },
    {
        " exegesis": "exegesis"
    },
    {
        "    Works of the Talmudic Era   ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        " and commentaries   ": null
    },
    {
        "Tosefta": "tosefta"
    },
    {
        " and the ": null
    },
    {
        "minor tractates": "minor tractates"
    },
    {
        " Talmud": "talmud"
    },
    {
        ":   The ": null
    },
    {
        "Babylonian Talmud": "talmudbabylonian talmud"
    },
    {
        " and commentaries   ": null
    },
    {
        "Jerusalem Talmud": "jerusalem talmud"
    },
    {
        " and commentaries   ": null
    },
    {
        "Midrash": "midrash"
    },
    {
        "ic literature:   ": null
    },
    {
        "Halakhic Midrash": "midrash halakha"
    },
    {
        " Aggadic Midrash": "midrashaggadic midrashim"
    },
    {
        " Halakhic": "halakha"
    },
    {
        " literature   Major Codes of Jewish Law and Custom   ": null
    },
    {
        "Mishneh Torah": "mishneh torah"
    },
    {
        " and commentaries   ": null
    },
    {
        "Tur": "arbaah turim"
    },
    {
        " and commentaries   ": null
    },
    {
        "Shulchan Aruch": "shulchan aruch"
    },
    {
        " and commentaries   ": null
    },
    {
        "Responsa": "responsa"
    },
    {
        " literature   Jewish Thought and Ethics   ": null
    },
    {
        "Jewish philosophy": "jewish philosophy"
    },
    {
        " Musar literature": "musar literature"
    },
    {
        " and other works of ": null
    },
    {
        "Jewish ethics": "jewish ethics"
    },
    {
        " Kabbalah": "kabbalah"
    },
    {
        " Hasidic": "hasidic judaism"
    },
    {
        " works   ": null
    },
    {
        "Siddur": "siddur"
    },
    {
        " and ": null
    },
    {
        "Jewish liturgy": "jewish services"
    },
    {
        "  Piyyut      Many traditional Jewish texts are available online in various ": null
    },
    {
        "Torah databases": "torah database"
    },
    {
        ". Many of these have advanced search options available.             The basis of Jewish law and tradition is the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " . According to rabbinic tradition, there are ": null
    },
    {
        "613 commandments": "613 mitzvot"
    },
    {
        " in the Torah. Some of these laws are directed only to men or to women, some only to the ancient priestly groups, the ": null
    },
    {
        "Kohanim": "kohen"
    },
    {
        " and ": null
    },
    {
        "Leviyim": "levite"
    },
    {
        " , some only to farmers within the ": null
    },
    {
        "Land of Israel": "land of israel"
    },
    {
        ". Many laws were only applicable when the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        " existed, and only 369 of these commandments are still applicable today.      While there have been Jewish groups whose beliefs were based on the written text of the Torah alone , most Jews believe in the ": null
    },
    {
        "oral law": "oral laworal law in judaism"
    },
    {
        ". These oral traditions were transmitted by the ": null
    },
    {
        "Pharisee": "pharisees"
    },
    {
        " school of thought of ancient Judaism and were later recorded in written form and expanded upon by the rabbis.     According to Rabbinical Jewish tradition, God gave both the Written Law  and the ": null
    },
    {
        "Oral law": "oral law"
    },
    {
        " to Moses on ": null
    },
    {
        "Mount Sinai": "biblical mount sinai"
    },
    {
        ". The Oral law is the oral tradition as relayed by God to Moses and from him, transmitted and taught to the sages  of each subsequent generation.     For centuries, the Torah appeared only as a written text transmitted in parallel with the oral tradition. Fearing that the oral teachings might be forgotten, Rabbi ": null
    },
    {
        "Judah haNasi": "judah hanasi"
    },
    {
        " undertook the mission of consolidating the various opinions into one body of law which became known as the Mishnah. Codex Judaica Kantor 2006, p. 146      The Mishnah consists of 63 tractates codifying Jewish law, which are the basis of the Talmud. According to ": null
    },
    {
        "Abraham ben David": "abraham ben david"
    },
    {
        ", the  Mishnah  was compiled by Rabbi ": null
    },
    {
        "Judah haNasi": "judah the prince"
    },
    {
        " after the destruction of Jerusalem, in ": null
    },
    {
        "anno mundi": "anno mundi"
    },
    {
        " 3949, which corresponds to 189 CE. Abraham ben David, Seder Ha-Kabbalah Leharavad, Jerusalem 1971, p.16      Over the next four centuries, the Mishnah underwent discussion and debate in both of the worlds major Jewish communities . The commentaries from each of these communities were eventually compiled into the two ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        "s, the Jerusalem Talmud  and the Babylonian Talmud . These have been further expounded by commentaries of various Torah scholars during the ages.     In the text of the Torah, many words are left undefined and many procedures are mentioned without explanation or instructions. Such phenomena are sometimes offered to validate the viewpoint that the Written Law has always been transmitted with a parallel oral tradition, illustrating the assumption that the reader is already familiar with the details from other, i.e., oral, sources.      Halakha, the rabbinic Jewish way of life, then, is based on a combined reading of the Torah, and the oral tradition—the Mishnah, the halakhic ": null
    },
    {
        "Midrash": "midrash"
    },
    {
        ", the Talmud and its commentaries. The Halakha has developed slowly, through a precedent-based system. The literature of questions to rabbis, and their considered answers, is referred to as ": null
    },
    {
        "responsa": "responsa"
    },
    {
        "  Over time, as practices develop, codes of Jewish law are written that are based on the responsa; the most important code, the ": null
    },
    {
        "Shulchan Aruch": "shulchan aruch"
    },
    {
        ", largely determines Orthodox religious practice today.             Jewish philosophy refers to the conjunction between serious study of philosophy and Jewish theology. Major Jewish philosophers include ": null
    },
    {
        "Solomon ibn Gabirol": "solomon ibn gabirol"
    },
    {
        ", ": null
    },
    {
        "Saadia Gaon": "saadia gaon"
    },
    {
        ", ": null
    },
    {
        "Judah Halevi": "judah halevi"
    },
    {
        ", ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        ", and ": null
    },
    {
        "Gersonides": "gersonides"
    },
    {
        ". Major changes occurred in response to the ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        " leading to the post-Enlightenment Jewish philosophers. Modern Jewish philosophy consists of both Orthodox and non-Orthodox oriented philosophy. Notable among Orthodox Jewish philosophers are ": null
    },
    {
        "Eliyahu Eliezer Dessler": "eliyahu eliezer dessler"
    },
    {
        ", ": null
    },
    {
        "Joseph B. Soloveitchik": "joseph b. soloveitchik"
    },
    {
        ", and ": null
    },
    {
        "Yitzchok Hutner": "yitzchok hutner"
    },
    {
        ". Well-known non-Orthodox Jewish philosophers include ": null
    },
    {
        "Martin Buber": "martin buber"
    },
    {
        ", ": null
    },
    {
        "Franz Rosenzweig": "franz rosenzweig"
    },
    {
        ", ": null
    },
    {
        "Mordecai Kaplan": "mordecai kaplan"
    },
    {
        ", ": null
    },
    {
        "Abraham Joshua Heschel": "abraham joshua heschel"
    },
    {
        ", ": null
    },
    {
        "Will Herberg": "will herberg"
    },
    {
        ", and ": null
    },
    {
        "Emmanuel Lévinas": "emmanuel lévinas"
    },
    {
        ".          ": null
    },
    {
        "Orthodox": "orthodox judaism"
    },
    {
        " and many other ": null
    },
    {
        "Jews": "jews"
    },
    {
        " do not believe that the revealed ": null
    },
    {
        "Torah": "torah"
    },
    {
        " consists solely of its written contents, but of its interpretations as well. The study of ": null
    },
    {
        "Torah": "torah"
    },
    {
        "  is in Judaism itself a sacred act of central importance. For the sages of the ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        " and ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        ", and for their successors today, the study of Torah was therefore not merely a means to learn the contents of Gods revelation, but an end in itself. According to the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        ",   :These are the things for which a person enjoys the dividends in this world while the principal remains for the person to enjoy in the world to come; they are: honoring parents, loving deeds of kindness, and making peace between one person and another. But the study of the Torah is equal to them all. .   In Judaism, the study of ": null
    },
    {
        "Torah": "torah"
    },
    {
        " can be a means of experiencing God . Reflecting on the contribution of the ": null
    },
    {
        "Amoraim": "amoraim"
    },
    {
        " and ": null
    },
    {
        "Tanaim": "tanaim"
    },
    {
        " to contemporary Judaism, Professor Jacob Neusner observed:   :The rabbis logical and rational inquiry is not mere logic-chopping. It is a most serious and substantive effort to locate in trivialities the fundamental principles of the revealed will of God to guide and sanctify the most specific and concrete actions in the workaday world .... Here is the mystery of Talmudic Judaism: the alien and remote conviction that the intellect is an instrument not of unbelief and desacralization but of sanctification.   To study the Written Torah and the Oral Torah in light of each other is thus also to study how to study the word of God.     In the study of Torah, the sages formulated and followed various ": null
    },
    {
        "logic": "logic"
    },
    {
        "al and ": null
    },
    {
        "hermeneutical": "hermeneutics"
    },
    {
        " principles. According to David Stern, all Rabbinic hermeneutics rest on two basic axioms:   :first, the belief in the omni-significance of Scripture, in the meaningfulness of its every word, letter, even scribal flourish; second, the claim of the essential unity of Scripture as the expression of the single divine will.   These two principles make possible a great variety of interpretations. According to the Talmud,   :A single verse has several meanings, but no two verses hold the same meaning. It was taught in the school of R. Ishmael: Behold, My word is like fire—declares the Lord—and like a hammer that shatters rock . Just as this hammer produces many sparks , so a single verse has several meanings. .   Observant Jews thus view the Torah as dynamic, because it contains within it a host of interpretations     According to Rabbinic tradition, all valid interpretations of the ": null
    },
    {
        "written Torah": "written torah"
    },
    {
        " were revealed to Moses at Sinai in ": null
    },
    {
        "oral form": "oral torah"
    },
    {
        ", and handed down from teacher to pupil . When different rabbis forwarded conflicting interpretations, they sometimes appealed to hermeneutic principles to legitimize their arguments; some rabbis claim that these principles were themselves revealed by God to Moses at Sinai.     Thus, ": null
    },
    {
        "Hillel": "hillel the elder"
    },
    {
        " called attention to seven commonly used hermeneutical principles in the interpretation of laws ; ": null
    },
    {
        "R. Ishmael": "r. ishmael"
    },
    {
        ", thirteen . ": null
    },
    {
        "Eliezer b. Jose ha-Gelili": "eliezer b. jose ha-gelili"
    },
    {
        " listed 32, largely used for the exegesis of narrative elements of Torah. All the hermeneutic rules scattered through the ": null
    },
    {
        "Talmudim": "talmudim"
    },
    {
        " and ": null
    },
    {
        "Midrashim": "midrashim"
    },
    {
        " have been collected by ": null
    },
    {
        "Malbim": "malbim"
    },
    {
        " in Ayyelet ha-Shachar, the introduction to his commentary on the ": null
    },
    {
        "Sifra": "sifra"
    },
    {
        ". Nevertheless, R. Ishmaels 13 principles are perhaps the ones most widely known; they constitute an important, and one of Judaisms earliest, contributions to ": null
    },
    {
        "logic": "logic"
    },
    {
        ", ": null
    },
    {
        "hermeneutics": "hermeneutics"
    },
    {
        ", and ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        ". ": null
    },
    {
        "Judah Hadassi": "judah hadassi"
    },
    {
        " incorporated Ishmaels principles into ": null
    },
    {
        "Karaite Judaism": "karaite judaism"
    },
    {
        " in the 12th century. Today R. Ishmaels 13 principles are incorporated into the Jewish prayer book to be read by observant Jews on a daily basis.            The term Judaism derives from Iudaismus, a Latinized form of the Ancient Greek  Ioudaismos  . ": null
    },
    {
        "Greek": "ancient greece"
    },
    {
        "1516Robert Fabian, New Chronicles of England and France, reprint London 1811, p. 334.": null
    },
    {
        "Deuterocanon": "deuterocanon"
    },
    {
        " in ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        " and ": null
    },
    {
        "Eastern Orthodoxy": "eastern orthodox church"
    },
    {
        "that is, Europe, particularly medieval and modern Europesee ": null
    },
    {
        "Haskalah": "haskalah"
    },
    {
        "the ": null
    },
    {
        "Khazars": "khazar"
    },
    {
        " also known as Liberal or Reform Judaismson or daughter of Abraham Who is a Jew i.e., idols200719012005or in some Christian traditions, RabbinismHebrew: Yahadut Rabanit – יהדות רבניתWritten LawWesternwhere the situation is rather different": null
    },
    {
        "thodox56845612": "thodox56845612"
    },
    {
        "a condensed codification of halakha that largely favored Sephardic traditionsAsian and North Africanalong with ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " in many casessee also ": null
    },
    {
        "Sephardic law and customs": "sephardic law and customs"
    },
    {
        " However, individual Sephardi and Mizrahi Jews may be members of or attend synagogues that do adhere to one Ashkenazi-inflected movement or another.hiloni": null
    },
    {
        "sor": "sor"
    },
    {
        "datiEuropeanOrthodoxReform, Conservativemasortii.e., the Middle East, Central Asia, and North Africareligiousultra-Orthodox": null
    },
    {
        "nationalist": "nationalism"
    },
    {
        " harediSome people, in ": null
    },
    {
        "Yiddish": "yiddish"
    },
    {
        ", also refer to observant Orthodox Jews as frum, as opposed to frei 1non-hasidic23 Scripturalists  simple meaning": null
    },
    {
        "mar": "mar"
    },
    {
        "Five Books of Moseswith a special regard also for the ": null
    },
    {
        "Samaritan Book of Joshua": "book of joshua"
    },
    {
        "meaning religion in Geez and Amharicthe Orit": null
    },
    {
        "chesed": "chesed"
    },
    {
        "tzedakah": "tzedakah"
    },
    {
        "lashon hara": "lashon hara"
    },
    {
        "or Shema": null
    },
    {
        "Deuteronomy": "deuteronomy"
    },
    {
        " 6:4Hebrew: כִּפָּה, plural kippot; Yiddish: יאַרמלקע, yarmulkeHebrew: צִיציִת": null
    },
    {
        "Ashkenazi pronunciation": "ashkenazi hebrew"
    },
    {
        ": tzitzisHebrew: טַלִּיתAshkenazi pronunciation: tallissmall tallitHebrew: תְפִלִּיןfrom the Greek word φυλακτήριον, meaning safeguard or amuletYiddish: קיטלburial garmentschaggimderived from the Hebrew word regel , or footPesachthe first month in the Hebrew calendar": null
    },
    {
        "chametz": "chametz"
    },
    {
        " Pentecost or Feast of Weeks cheesecake and blintzes are special favorites Tabernacles or The Festival of Booths sing.  sukkah ": null
    },
    {
        "348514": "348514"
    },
    {
        "Yamim Noraim or Days of Awe also Yom Ha-Zikkaron or Day of Remembrance , and Yom Teruah, or Day of the Sounding of the ": null
    },
    {
        "Shofar": "shofar"
    },
    {
        " literally, head of the year  Day of Atonement ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        ":  Pûrîm ": null
    },
    {
        "lots": "cleromancy"
    },
    {
        " b": "b"
    },
    {
        "Esther 9:22, dedication ": null
    },
    {
        "Hebrew calendar": "hebrew calendar"
    },
    {
        "meaning dedication  or , the Ninth of ": null
    },
    {
        "Av": "av"
    },
    {
        " the 3rd of TishreiHolocaust Remembrance DayIsraeli Memorial DayIsraeli Independence Day": null
    },
    {
        "1434837": "1434837"
    },
    {
        "the main sanctuary ": null
    },
    {
        "nagog": "nagog"
    },
    {
        "called aron ha-kodesh by ": null
    },
    {
        "Ashkenazim": "ashkenazi jews"
    },
    {
        " and hekhal by ": null
    },
    {
        "Sephardim": "sephardi jews"
    },
    {
        "the ark is often closed with an ornate curtain  outside or inside the ark doorscalled  bimah  by Ashkenazim and tebah by Sephardimand services are conducted in Sephardi synagoguesner tamid": null
    },
    {
        "mp": "mp"
    },
    {
        " olo": "olo"
    },
    {
        "but not fish": null
    },
    {
        "ri": "ri"
    },
    {
        "Kohanim": "kohanim"
    },
    {
        "Terumah": "terumah"
    },
    {
        "Fauteuil dElie": "fauteuil delie"
    },
    {
        "dai": "dai"
    },
    {
        "literally seven , observed for one weekobserved for one monthpriest": null
    },
    {
        "Levite": "levite"
    },
    {
        "a supplementary portion from the Prophets or Writingsi.e., from a respected Orthodox rabbi or, if the congregation is Conservative or Reform, from academic seminariessee belownote: the h denotes ": null
    },
    {
        "voiceless pharyngeal fricative": "voiceless pharyngeal fricative"
    },
    {
        "cantorleader—literally agent or representative —of the congregationmaster of the readingor parts of servicessexton judgerabbinical courtcircumcisercircumcisionritual slaughterer ": null
    },
    {
        "ri": "ri"
    },
    {
        "scribephylacteriesscrolls put on doorpostsbills of divorceJewish ethicsc. 535 BCEthen called ": null
    },
    {
        "Canaan": "canaan"
    },
    {
        "blic": "blic"
    },
    {
        "b": "b"
    },
    {
        "oph": "oph"
    },
    {
        "Judah the Prince": null
    },
    {
        "blical schol": "blical schol"
    },
    {
        "d Testament schol": "d testament schol"
    },
    {
        "i": "i"
    },
    {
        "mar": "mar"
    },
    {
        "in the northin the south": null
    },
    {
        "phrat": "phrat"
    },
    {
        "66–73 CE legitimate religion represented by a minimum of ten adult mensee ": null
    },
    {
        "Jewish diaspora": "jewish diaspora"
    },
    {
        "ligi": "ligi"
    },
    {
        "today, known simply as Judaism which became the basis for modern JudaismThe ": null
    },
    {
        "Samaritans": "samaritans"
    },
    {
        " practiced a similar religion, which is traditionally considered separate from Judaism.and developed by later rabbis in the two ": null
    },
    {
        "Talmuds": "talmud"
    },
    {
        " of ": null
    },
    {
        "central": "central europe"
    },
    {
        " and Eastern Europeof Spain, Portugal, and North Africarabbinic19912007": null
    },
    {
        "e Baal Shem T": "e baal shem t"
    },
    {
        "1700–1760or Beshtlit. opponents ": null
    },
    {
        " Liber": "liber"
    },
    {
        "especially those that limited Jewish relations with non-Jewsand skepticalReplacement rate is 2.1.Minneapolis: Fortress, 1996Formal Statement on the Jews": null
    },
    {
        "ghettos": "jewish ghettos in europe"
    },
    {
        "for example selling new clothes in medieval ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        "Jews were readmitted in 1655readmitted in 18681994see: ": null
    },
    {
        "Mawza Exile": "mawza exile"
    },
    {
        "mellahs": "mellah"
    },
    {
        " 12 September 20129 October 2012": null
    }
]