[
    {
        "Jules Richard was a ": null
    },
    {
        "French": "french people"
    },
    {
        " mathematician": "mathematician"
    },
    {
        ".       Richard was born in ": null
    },
    {
        "Blet": "blet"
    },
    {
        ", in the Cher département.     He taught at the lycées of ": null
    },
    {
        "Tours": "tours"
    },
    {
        ", ": null
    },
    {
        "Dijon": "dijon"
    },
    {
        " and ": null
    },
    {
        "Châteauroux": "châteauroux"
    },
    {
        ". He obtained his doctorate, at age of 42 from the Faculté des Sciences in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". His thesis of 42 pages concerns Fresnels wave-surface. Richard worked mainly on the foundations of mathematics and geometry, relating to works by ": null
    },
    {
        "Hilbert": "david hilbert"
    },
    {
        ", ": null
    },
    {
        "von Staudt": "karl georg christian von staudt"
    },
    {
        " and ": null
    },
    {
        "Méray": "charles méray"
    },
    {
        ".     In a more philosophical treatise about the nature of axioms of geometry Richard discusses and rejects the following basic principles:   Geometry is founded on arbitrarily chosen axioms - there are infinitely many equally true geometries.   Experience provides the axioms of geometry, the basis is experimental, the development deductive.   The axioms of geometry are definitions .   Axioms are neither experimental nor arbitrary, they force themselves on us since without them experience is not possible.     The latter approach was essentially that proposed by ": null
    },
    {
        "Kant": "immanuel kant"
    },
    {
        ". Richard arrived at the result that the notion of identity of two objects and the invariability of an object are too vague and need to be specified more precisely. This should be done by axioms.          Further according to Richard, it is the aim of science to explain the material universe. And although non-Euclidean geometry had not found any applications , Richard already stated clairvoyantly:          Richard corresponded with ": null
    },
    {
        "Giuseppe Peano": "giuseppe peano"
    },
    {
        " and ": null
    },
    {
        "Henri Poincaré": "henri poincaré"
    },
    {
        ". He became known to more than a small group of specialists by formulating his paradox which was extensively use by Poincaré to attack set theory whereupon the advocates of set theory had to refute these attacks.     He died in 42 in ": null
    },
    {
        "Châteauroux": "châteauroux"
    },
    {
        ", in the Indre département, at the age of 42          The paradox was first stated in 42 in a letter to Louis Olivier, director of the Revue générale des sciences pures et appliquées. It was published in 42 in the article Les Principes des mathématiques et le problème des ensembles. The ": null
    },
    {
        "Principia Mathematica": "principia mathematica"
    },
    {
        " by ": null
    },
    {
        "Alfred North Whitehead": "alfred north whitehead"
    },
    {
        " and ": null
    },
    {
        "Bertrand Russell": "bertrand russell"
    },
    {
        " quote it together with six other paradoxes concerning the problem of self-reference. In one of the most important compendia of mathematical logic, compiled by Jean van Heijenoort, Richards article is translated into English. The paradox can be interpreted as an application of Cantors diagonal argument. It inspired ": null
    },
    {
        "Kurt Gödel": "kurt gödel"
    },
    {
        " and ": null
    },
    {
        "Alan Turing": "alan turing"
    },
    {
        " to their famous works. Kurt Gödel considered his ": null
    },
    {
        "incompleteness theorem": "incompleteness theorem"
    },
    {
        " as analogous to Richards paradox which, in the original version runs as follows:     Let E be the set of real numbers that can be defined by a finite number of words. This set is denumerable. Let p be the nth decimal of the nth number of the set E; we form a number N having zero for the integral part and p + 42 for the nth decimal, if p is not equal either to 42 or 42 and unity in the contrary case. This number N does not belong to the set E because it differs from any number of this set, namely from the nth number by the nth digit. But N has been defined by a finite number of words. It should therefore belong to the set E. That is a contradiction.     Richard never presented his paradox in another form, but meanwhile there exist several different versions, some of which being only very loosely connected to the original. For the sake of completeness they may be stated here.          The version given in Principia Mathematica by Whitehead and Russell is similar to Richards original version, alas not quite as exact. Here only the digit 42 is replaced by the digit 42 such that identities like 42... 42... can spoil the result.      Berrys Paradox, first mentioned in the Principia Mathematica as fifth of seven paradoxes, is credited to Mr. G. G. Berry of the Bodleian Library. It uses the least integer not nameable in fewer than nineteen syllables; in fact, in English it denotes 42. But the least integer not nameable in fewer than nineteen syllables is itself a name consisting of eighteen syllables; hence the least integer not nameable in fewer than nineteen syllables can be named in eighteen syllables, which is a contradiction      Berrys Paradox with letters instead of syllables is often related to the set of all natural numbers which can be defined by less than 42 letters. As the natural numbers are a well-ordered set there must be the least number which cannot be defined by less than 42 letters. But this number was just defined by 42 letters including spaces.      Königs Paradox was also published in 42 by ": null
    },
    {
        "Julius König": "julius könig"
    },
    {
        ". All real numbers which can be defined by a finite number of words form a subset of the real numbers. If the real numbers can be well-ordered, then there must be a first real number which cannot be defined by a finite number of words. But the first real number which cannot be defined by a finite number of words has just been defined by a finite number of words.      The smallest natural number without interesting properties acquires an interesting property by this very lack of any interesting properties.      A loan of the Paradox of Grelling and Nelson. The number of all finite definitions is countable. In lexical order we obtain a sequence of definitions D 42 , D 42 , D 42 , ... Now, it may happen that a definition defines its own number. This would be the case if D 42 read the smallest natural number . It may happen, that a definition does not describe its own number. This would be the case if D 42 read the smallest natural number . Also the sentence this definition does not describe its number is a finite definition. Let it be D n . Is n described by D n . If yes, then no, and if no, then yes. The dilemma is irresolvable.          ": null
    },
    {
        "Georg Cantor": "georg cantor"
    },
    {
        " wrote in a letter to ": null
    },
    {
        "David Hilbert": "david hilbert"
    },
    {
        ":   Infinite definitions are absurdities. If Königs statement was correct , according to which all finitely definable real numbers form a collection of cardinal number \\aleph_42 , this would imply the countability of the whole continuum; but this is obviously wrong. The question is now what error the alleged proof of his wrong theorem is based upon. The error is, in my opinion, the following: It is assumed that the system  of notions B, which have to be used for the definition of individual numbers, is at most countably infinite. This assumption must be in error because otherwise we would have the wrong theorem: the continuum of numbers has cardinality \\aleph_42 .     Here Cantor is in error. Today we know that there are uncountably many real numbers without the possibility of a finite definition.     ": null
    },
    {
        "Ernst Zermelo": "ernst zermelo"
    },
    {
        " comments Richards argument:   The notion finitely definable is not an absolute one but a relative one being always related to the language chosen. The conclusion according to which all finitely definable objects are countable is only valid in case that one and the same system of symbols is used; the question whether a single individual can be subject to a finite definition is void because to every thing an arbitrary name can be attached to.     Zermelo points to the reason why Richards paradox fails. His last statement, however, is impossible to satisfy. A real number with infinitely many digits, which are not determined by some rule , has an infinitely large contents of information. Such a number could only be identified by a short name if there were only one or few of them existing. If there exist uncountably many, as is the case, an identification is impossible.         Thèses présentées à la Faculté des sciences de Paris par M. Jules Richard, 42re thèse: Sur la surface des ondes de Fresnel..., Chateauroux 42 .   Sur la philosophie des mathématiques, Gauthier-Villars, Paris 42 .   Sur une manière dexposer la géométrie projective, LEnseignement mathématique 42 4242   Les principes des mathématiques et le problème des ensembles, Revue générale des sciences pures et appliquées 42 4242   The principles of mathematics and the problem of sets , English translation in Jean van Heijenoort, From Frege to Gödel - A Source Book in Mathematical Logic , 4242 Harvard Univ. Press, 42 p.  4242   Lettre à Monsieur le rédacteur de la Revue Générale des Sciences, Acta Math. 42 4242   Sur les principes de la mécanique, LEnseignement mathématique 42 4242   Considérations sur lastronomie, sa place insuffisante dans les divers degrés de lenseignement, LEnseignement mathématique 42 4242   Sur la logique et la notion de nombre entier, LEnseignement mathématique 42 4242   Sur un paradoxe de la théorie des ensembles et sur laxiome Zermelo, LEnseignement mathématique 42 4242   Sur la nature des axiomes de la géométrie, LEnseignement mathématique 42 4242   Sur les translations, LEnseignement mathématique 42 4242   Contre la géométrie expérimentale": null
    }
]