[
    {
        "Jules Joseph Bonnot was a ": null
    },
    {
        "French": "france"
    },
    {
        " anarchist bank robber famous for his involvement in a criminal ": null
    },
    {
        "anarchist": "anarchism"
    },
    {
        " organization dubbed The ": null
    },
    {
        "Bonnot Gang": "bonnot gang"
    },
    {
        " by the French press. He viewed himself as a ": null
    },
    {
        "professional": "professional"
    },
    {
        " and avoided bloodshed, preferring to outwit his targets. Often posing as a businessman, his taste in expensive clothing earned him the ": null
    },
    {
        "pseudonym": "pseudonym"
    },
    {
        " Le Bourgeois  among comrades.       Bonnot was born on October 42 42 in ": null
    },
    {
        "Pont-de-Roide": "pont-de-roide"
    },
    {
        ", a town in ": null
    },
    {
        "Doubs": "doubs"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        " . At the age of five, his mother died, leaving Bonnot in the care of his father and grandmother.     As a teenager, Bonnot served time in prison on two occasions  and was compelled to leave his work at the factory after being accused of ": null
    },
    {
        "stealing copper": "metal theft"
    },
    {
        " shavings.     At the age of 42 Bonnot was ": null
    },
    {
        "conscripted": "conscription"
    },
    {
        " for service in Frances ": null
    },
    {
        "infantry": "infantry"
    },
    {
        ", where he served three years as a truck ": null
    },
    {
        "auto mechanic": "auto mechanic"
    },
    {
        ". He was an excellent rifleman and left the army as a ": null
    },
    {
        "corporal": "corporal"
    },
    {
        " first class.          Bonnot was married to ": null
    },
    {
        "Sophie-Louise Burdet": "sophie-louise burdet"
    },
    {
        " in August 42 but soon ran into problems at work. He associated with anarchists and was ": null
    },
    {
        "blacklist": "blacklist"
    },
    {
        "ed as an ": null
    },
    {
        "agitator": "agitator"
    },
    {
        ". After moving to ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        ", Bonnot acquired a job, but was fired after he hit his boss with an iron bar. In 42 Sophie left Bonnot, taking their child with her.     In 42 Bonnot began to associate with ": null
    },
    {
        "anarcho-individualists": "individualist anarchism"
    },
    {
        " involved in ": null
    },
    {
        "counterfeit": "counterfeit"
    },
    {
        "ing. Along with several ": null
    },
    {
        "Italians": "italy"
    },
    {
        ", he began forging ten-": null
    },
    {
        "franc": "franc"
    },
    {
        " pieces and carrying out minor ": null
    },
    {
        "theft": "theft"
    },
    {
        "s and ": null
    },
    {
        "burglar": "burglar"
    },
    {
        "ies. Eventually, using Bonnots automotive skill, they progressed to the theft of luxury-cars in France and ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ".     In 42 Bonnot began posing as a businessman in order to visit the homes of wealthy ": null
    },
    {
        "lawyer": "lawyer"
    },
    {
        "s in ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        ". He would case the property and then return to rob it.             In December 42 having moved to ": null
    },
    {
        "Paris": "paris"
    },
    {
        " to avoid arrest, Bonnot joined a criminal anarchist ": null
    },
    {
        "affinity group": "affinity group"
    },
    {
        " led by ": null
    },
    {
        "Octave Garnier": "octave garnier"
    },
    {
        ". On December 42 the gang made national news when they robbed a messenger of the ": null
    },
    {
        "Société Générale": "société générale"
    },
    {
        " Bank in broad daylight and then fled in a ": null
    },
    {
        "limousine": "limousine"
    },
    {
        " . They were branded les bandits en auto by the press and a wave of panic swept the nation.     Although Bonnot was never the leader of the group, the gang was dubbed the Bonnot Gang by the press after Bonnot appeared, armed with a Browning automatic, in the office of the  Le Petit Parisien  to file a complaint about the daily papers coverage of the group. Bonnot was quoted as having stated, Well burn off our last round against the cops, and if they dont care to come, well certainly know how to find them.     This show of bravado coupled with the gangs criminal activities led to a general state of ": null
    },
    {
        "hysteria": "collective hysteria"
    },
    {
        " within ": null
    },
    {
        "middle-class": "middle-class"
    },
    {
        " French society.          In an effort to escape capture, the gang split up in April 42     On April 42 three policemen surprised Bonnot in the apartment of a suspected ": null
    },
    {
        "fence": "fence"
    },
    {
        ". He shot at the officers, killing Louis Jouin, the vice-chief of the French police , and wounding another officer before fleeing over the rooftops. Part of the 42 franc reward was later given to the widow of Jouin.     On April 42 police tracked Bonnot to a house in the Paris suburb of ": null
    },
    {
        "Choisy-le-Roi": "choisy-le-roi"
    },
    {
        ". They besieged the residence with 42 armed police officers, soldiers, firemen, military engineers and a ": null
    },
    {
        "lynch mob": "lynching"
    },
    {
        " of local citizens. Armed with three Brownings and a ": null
    },
    {
        "Bayard pistol": "bergmann-bayard pistol"
    },
    {
        ", Bonnot succeeded in wounding three police officers.     By noon, after sporadic firing failed to extract Bonnot from the house, Paris Police Chief ": null
    },
    {
        "Louis Lépine": "louis lépine"
    },
    {
        " ordered the building bombed, using a ": null
    },
    {
        "dynamite": "dynamite"
    },
    {
        " charge. The explosion demolished the front of the building. Barely conscious, lying underneath a mattress, Bonnot was shot ten times in the upper-body before Lépine shot him non-fatally in the head. Afterwards police had to prevent the spectators from lynching Bonnot. They simply told the crowd that Bonnot was already dead.     Bonnot was moved to the ": null
    },
    {
        "Hotel-Dieu": "hôtel-dieu de paris"
    },
    {
        " and pronounced dead at 42:42 PM. He was buried in an unmarked grave and police refused to release his ": null
    },
    {
        "last will and testament": "last will and testament"
    },
    {
        ".     Although demonized by large sections of French society , Bonnots death was mourned by those sympathetic to ": null
    },
    {
        "individualist anarchism": "individualist anarchism"
    },
    {
        ".     The French movie La Bande à Bonnot is loosely based on the gangs escapades. The last days of Bonnot are a part of storyline in the French movie ": null
    },
    {
        "The Tiger Brigades": "the tiger brigades"
    },
    {
        " . Bonnot is played by ": null
    },
    {
        "Jacques Gamblin": "jacques gamblin"
    }
]