[
    {
        "         Juliette Gordon Low  was the founder of ": null
    },
    {
        "Girl Scouts of the USA": "girl scouts of the usa"
    },
    {
        ". Inspired by the work of Lord Baden-Powell, founder of Boy Scouts, Juliette Low joined the Girl Guide movement in England, forming a group of Girl Guides in Great Britain in 42     In 42 she returned to the United States, and established the first U.S. Girl Guide troop in ": null
    },
    {
        "Savannah, Georgia": "savannah, georgia"
    },
    {
        ", that year. In 42 the United States Girl Guides became known as the Girl Scouts, and Juliette Gordon Low was the first ever leader. She stayed active until the time of her death.     Her birthday, October 42 is commemorated by the Girl Scouts as ": null
    },
    {
        "Founders Day": "founders day"
    },
    {
        " .       Juliette Magill Kinzie Gordon was born on October 42 42 in Savannah, Georgia. She was named after her grandmother, ": null
    },
    {
        "Juliette Augusta Magill Kinzie": "juliette augusta magill kinzie"
    },
    {
        ", and nicknamed Daisy, a common nickname at the time, by her uncle. She was the second of six children born to ": null
    },
    {
        "William Willie Washington Gordon II": "william washington gordon ii"
    },
    {
        ", a cotton broker with the firm Tison & Gordon, which was later renamed to W. W. Gordon & Company, and Eleanor Nellie Lytle Kinzie, a writer whose family played a role in the founding of Chicago.     Six months after her birth, her father joined the ": null
    },
    {
        "Confederate States Army": "confederate states army"
    },
    {
        " to fight in the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ". In 42 due to the close proximity of ": null
    },
    {
        "Union troops": "union army"
    },
    {
        " to Savannah, she moved with her mother and two sisters to ": null
    },
    {
        "Thunderbolt, Georgia": "thunderbolt, georgia"
    },
    {
        ". After the Union victory in Savannah the same year, her family received many visits from General ": null
    },
    {
        "William T. Sherman": "william t. sherman"
    },
    {
        ", who was a friend of her uncle. Sherman arranged an escort to take her family to Chicago in March 42 Upon arriving in Chicago, Gordon Low became sick with ": null
    },
    {
        "brain fever": "brain fever"
    },
    {
        ", although she recovered without severe complications. A few months later, after President ": null
    },
    {
        "Andrew Johnson": "andrew johnson"
    },
    {
        " issued the amnesty proclamation, her father reunited with the family to move back to Savannah.     As a child, Gordon Low was accident-prone, and she suffered numerous injuries and illnesses. In 42 her mother mentioned in a letter that Daisy fell out of bed – on her head, as usual....  That same year, she broke two of her fingers so severely that her parents considered having them amputated. She also suffered frequent ": null
    },
    {
        "earache": "earache"
    },
    {
        "s and recurring bouts of ": null
    },
    {
        "malaria": "malaria"
    },
    {
        ".       Gordon Low spent more time pursuing art and poetry than she did working on school work. She wrote and performed plays, and she started a newspaper with her cousins called The Malbone Bouquet, which featured some of her early poetry. She formed a club with her cousins, with the goal of helping others. The Helpful Hands Club learned to sew, and tried to make clothes for the children of Italian immigrants. She was dubbed Crazy Daisy by her family and friends, due to her eccentricities. Her cousin Caroline described her by saying, While you never knew what she would do next, she always did what she made up her mind to do.        Gordon Lows parents raised her with traditional Southern values, and they emphasized the importance of duty, obedience, loyalty, and respect. By the age of 42 she had started ": null
    },
    {
        "boarding school": "boarding school"
    },
    {
        ", attending several boarding schools during her teen years, including Miss Emmetts school in New Jersey, the ": null
    },
    {
        "Virginia Female Institute": "stuart hall school"
    },
    {
        ", the Edgehill School, and Mesdemoiselles Charbonniers, a French finishing school in New York. While studying at Edgehill, she joined the secret group Theta Tau , where members held meetings and earned badges. In 42 after she had finished boarding school, Gordon Low took painting lessons in New York. Among her teachers was ": null
    },
    {
        "Robert Walter Weir": "robert walter weir"
    },
    {
        ", a prominent landscape painter.           After the death of her sister Alice in 42 Gordon Low relocated to Savannah to take over the household duties, while her mother grieved. During this period she met William Mackay Low, the son of a family friend, and they began courting in secret. William Low left Savannah to study at the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        ", and they didnt meet again until almost three years later in 42 Gordon Low traveled to Europe while they were separated, and she learned several new skills including ": null
    },
    {
        "shorthand": "shorthand"
    },
    {
        ", ": null
    },
    {
        "bareback riding": "bareback riding"
    },
    {
        ", and hunting ": null
    },
    {
        "partridge": "partridge"
    },
    {
        ". In late 42 William Low proposed marriage.     The Lows Savannah nuptials were held on her parents wedding anniversary, December 42 42 The couple spent their honeymoon at ": null
    },
    {
        "St. Catherines Island": "st. catherines island"
    },
    {
        " near Savannah, GA. Then they leased property in London and ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", spending the ": null
    },
    {
        "social season": "season"
    },
    {
        " in London and the ": null
    },
    {
        "hunting season": "hunting season"
    },
    {
        " in Scotland. They spent much of their first two years of marriage apart, due to her medical problems and his long hunting trips and gambling. The long separations, combined with Gordon Lows inability to have children, caused a strain on their relationship.     Gordon Low spent her time painting, and she learned ": null
    },
    {
        "woodworking": "woodworking"
    },
    {
        " and ": null
    },
    {
        "metalworking": "metalworking"
    },
    {
        ". She also designed and built iron gates for her home in ": null
    },
    {
        "Warwickshire": "warwickshire"
    },
    {
        ". She hosted many parties and events at the house and received visits from ": null
    },
    {
        "HRH Albert Edward, the Prince of Wales": "edward vii"
    },
    {
        ", who was a friend of her husband, and ": null
    },
    {
        "Rudyard Kipling": "rudyard kipling"
    },
    {
        ", whose wife was related to her mother. She devoted time to charity work, although her husband was against it. She made regular visits to a woman with ": null
    },
    {
        "leprosy": "leprosy"
    },
    {
        ", fed and cared for the poor in a nearby village, and joined the local nursing association.       By 42 Gordon Low was growing increasingly unhappy in her relationship. She rarely spent time alone with her husband, who had grown distant and began to have affairs and drink heavily.     In 42 Anna Bridges Bateman, the widow of Sir Hugh Alleyne Saceverell-Bateman, stayed as a guest at the Lows home in Scotland. Gordon Low discovered her husbands affair with Bateman, whereupon she left to stay with friends and family. She worried that he planned to divorce her, so she sent him a ": null
    },
    {
        "telegram": "telegram"
    },
    {
        " asking for a year before making any final decisions. Although he initially didnt want a divorce or a separation, he wrote Gordon Low a year later to ask that they live apart permanently, which she agreed to.     Gordon Lows husband began withholding money from her unless she agreed to a divorce. After talking to a divorce lawyer, she learned that for a divorce to be granted, she would need to prove ": null
    },
    {
        "adultery": "adultery"
    },
    {
        " and desertion, or adultery and cruelty. In the case of adultery, Bateman would need to be named, which would have social repercussions for all involved parties. This caused the divorce proceedings to move slowly.     In late 42 Gordon Low received money from her husband for the first time in two years. She used it and her savings to rent a house in London. Her husband committed to a support agreement in 42 which was to award her 42 pounds a year, the Low home in Savannah, and stocks and securities. Later that year, she purchased her own home in London, along with the house next door, which she rented out for income.     After her husband suffered a possible stroke, Gordon Low temporarily called off the divorce. She felt it was wrong to divorce him while he could not defend himself; the proceedings resumed in January 42 when his condition improved. William Low died from a ": null
    },
    {
        "seizure": "epileptic seizure"
    },
    {
        " in June 42 before the divorce was finalized. After the funeral, it was revealed that he had left almost everything to Bateman, and that he had revoked his 42 support deal with Gordon Low. William Lows sisters contested the ": null
    },
    {
        "will": "will and testament"
    },
    {
        ", with the support of Gordon Low. She ultimately received a sum of money, the Low house in Savannah with its surrounding land, and stocks and securities.            After the death of her husband, Gordon Low traveled, took sculpting classes, and did charity work while looking for a project that she could focus her time and skills on. In May 42 she met ": null
    },
    {
        "Sir Robert Baden-Powell": "sir robert baden-powell"
    },
    {
        " at a party, and was inspired by the ": null
    },
    {
        "Boy Scouts": "boy scouts"
    },
    {
        ", a program that he had organized. At the time, the Boy Scouts had 42 members throughout Europe and the United States. It stressed the importance of military preparedness and having fun, two values that she appreciated. Gordon Low and Baden-Powell became close friends, and spent a large amount of time together over the next year.     In August 42 Gordon Low became involved with the ": null
    },
    {
        "Girl Guides": "girl guides"
    },
    {
        ", an offshoot of the Boy Scouts for girls that was headed by ": null
    },
    {
        "Agnes Baden-Powell": "agnes baden-powell"
    },
    {
        ", Sir Robert Baden Powells sister. She formed a Girl Guides patrol near her home in Scotland, where she encouraged the girls to become self-sufficient by learning how to ": null
    },
    {
        "spin wool": "spinning"
    },
    {
        " and care for livestock. She also taught them knot tying, how to read a map, knitting, cooking, and first aid, and her friends in the military taught the girls ": null
    },
    {
        "drilling": "military parade"
    },
    {
        ", signaling, and camping. She organized two new Girl Guides patrols in London when she visited for the winter of 42       In 42 Gordon Low and Baden-Powell took a trip to the United States to spread the scouting movement. She hoped to spread the movement to her hometown, Savannah, as a way to help girls learn practical skills and build character. When she arrived, she made a phone call to her cousin Nina Pape, a local educator, saying, Ive got something for the girls of Savannah   , and all America, and all the world, and were going to start it tonight.  Shortly after March 42 Gordon Low formed the first two American Girl Guides patrols, registering 42 girls.     The early growth of the Girl Guides movement in the United States was due to Gordon Lows extensive social connections, and she contributed early on by recruiting new members and leaders. She advertised in newspapers and magazines, and recruited her family and friends. Baden-Powell also put her in contact with people interested in Girl Guiding, including ": null
    },
    {
        "Louise Carnegie": "louise whitfield carnegie"
    },
    {
        ". After forming the first American troops, she described herself as deep in Girl Guides,  and by the next year, she had released the first American Girl Guides manual, titled How Girls Can Help Their Country, which was based on  Scouting for Boys  by Robert Baden-Powell and  How Girls Can Help to Build Up the Empire  by Agnes Baden-Powell.     Gordon Low established the first headquarters in a remodeled carriage house, behind the home in Savannah that she inherited from her husband. The headquarters contained meeting rooms for the local Girl Guide patrols, and the lot outside was used for marching and signaling drills and sports, including basketball. Edmund Strudwick Nash, who rented the main house from Gordon Low, offered to pay rent on the carriage house as his contribution to the organization, becoming one of the American Girl Guides first benefactors. Nashs son, ": null
    },
    {
        "Ogden Nash": "ogden nash"
    },
    {
        ", immortalized Mrs Lows House in one of his poems.     Gordon Low traveled along the east coast, spreading Girl Guiding to other communities, before returning to Savannah to speak with ": null
    },
    {
        "President Taft": "william howard taft"
    },
    {
        ", who was making a visit to the Gordon home. She hoped to convince Taft that his daughter Helen should become a patron for the Girl Guides, but she was unsuccessful.       Many competing organizations for girls that claimed to be the closest model to Boy Scouting were forming, and Gordon Low believed that gaining support from prominent people would help legitimize her organization as the official sister organization to the Boy Scouts. Her biggest competition was the ": null
    },
    {
        "Camp Fire Girls": "camp fire girls"
    },
    {
        ", which was formed in part by ": null
    },
    {
        "James E. West": "james e. west"
    },
    {
        ", the Chief executive of the ": null
    },
    {
        "Boy Scouts of America": "boy scouts of america"
    },
    {
        ", and a strong proponent of strict gender roles. In March 42 Gordon Low wrote to the Camp Fire Girls, inviting them to merge into the Girl Guides, but they declined even after Baden-Powell suggested that they reconsider. West considered many of the activities that the Girl Guides participated in to be gender-inappropriate, and he was concerned that the public would question the masculinity of the Boy Scouts if they participated in similar activities.       Although the Girl Guides were growing, the Camp Fire Girls were growing at a faster rate, so Gordon Low traveled to England to seek counsel from the British Girl Guides. By the time she returned to America in 42 she had a plan to spread Girl Guiding nationwide by changing the name from Girl Guides to Girl Scouts, establishing a national headquarters, and recruiting patrons outside of Georgia. Upon returning to Savannah, she learned that the Savannah Girl Guides had already renamed themselves to Girl Scouts because Scout reminded them of Americas pioneer ancestry. West objected to the name change, saying that it trivialized the name of scout and would cause older Boy Scouts to quit. Baden-Powell gave Gordon Low his support on her use of the term scout, although he preferred the term Guide for the British Girl Guides.     In 42 Gordon Low set up the Girl Scouts national headquarters in Washington, D.C., and hired her friend Edith Johnston to be the National Executive Secretary. The national headquarters served as the central information dispenser  for Girl Scouting, as well as the place where girls could purchase their badges and the newly published handbook, How Girls Can Help Their Country.     Gordon Low recruited leaders and members in various states and spoke with every group that she could. Around the same time, she designed and patented the trefoil badge, although West claimed that the trefoil belonged to the Boy Scouts and the Girl Scouts had no right to use it. She traveled back to London in the summer, where she met ": null
    },
    {
        "King George V": "king george v"
    },
    {
        " and ": null
    },
    {
        "Queen Mary of Teck": "queen mary of teck"
    },
    {
        ", and received the Girl Guide Thanks Badge from ": null
    },
    {
        "Princess Louise": "louise, princess royal"
    },
    {
        " for promoting Guiding.     Gordon Low also formed the Honorary Committee of Girl Scouts and elected her family and friends to the committee. By using her connections, she was able to convince Susan Ludlow Parish, ": null
    },
    {
        "Eleanor Roosevelt": "eleanor roosevelt"
    },
    {
        "s godmother; Mina Miller Edison, the wife of ": null
    },
    {
        "Thomas Edison": "thomas edison"
    },
    {
        "; and Bertha Woodward, the wife of the House of Representatives majority leader, to become patrons. Although she had received many patrons support, Gordon Low still funded most Girl Scout expenses herself.       At the start of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", Gordon Low rented ": null
    },
    {
        "Castle Menzies": "castle menzies"
    },
    {
        " in Scotland, and let a family of Belgian refugees temporarily move in.     On February 42 42 she sailed back to the United States on the ": null
    },
    {
        "RMS Lusitania": "rms lusitania"
    },
    {
        ". When she arrived, she continued her work for the Girl Scouts. At the time, the Girl Scouts had 42 patrons and 42 registered members. Gordon Low decided to build a stronger central organization for the Girl Scouts by writing a new constitution that formed an executive committee and a National Council. Gordon Low held the first National Council meeting under the new name, Girl Scouts, Inc. on June 42 42 and was elected the first president of the organization.     The Girl Scouts expanded after the United States entered World War I. Gordon Low publicized the Girl Scouts through newspapers, magazines, events, and film. In 42 Gordon Low relocated the Girl Scout headquarters from Washington DC to New York City. The same year, Gordon Low returned to England to fundraise for and open a home for relatives of wounded soldiers, where she volunteered 42 nights a week. By November, she was back in the United States continuing her work with the Girl Scouts.     In response to the thrift program, a program enacted by the ": null
    },
    {
        "United States Food Administration": "united states food administration"
    },
    {
        " with the goal of teaching women how to conserve food, Girl Scouts in Washington, DC began growing and harvesting their own food and canning perishable goods. ": null
    },
    {
        "Herbert Hoover": "herbert hoover"
    },
    {
        " wrote to Gordon Low, thanking her for the contributions of the Girl Scouts and expressing hope that other Girl Scouts in the country would follow suit. She responded by organizing Girl Scouts to help the ": null
    },
    {
        "Red Cross": "red cross"
    },
    {
        " by making ": null
    },
    {
        "surgical dressings": "surgical dressings"
    },
    {
        " and knitting clothing for soldiers. They also picked ": null
    },
    {
        "oakum": "oakum"
    },
    {
        ", swept workrooms, created scrapbooks for wounded soldiers, and made smokeless trench candles for soldiers to heat their food with.     By the end of 42 Gordon Low convinced ": null
    },
    {
        "Lou Henry Hoover": "lou henry hoover"
    },
    {
        " to become the National Vice President of the Girl Scouts, and ": null
    },
    {
        "Edith Bolling Galt Wilson": "edith bolling galt wilson"
    },
    {
        ", President ": null
    },
    {
        "Woodrow Wilson": "woodrow wilson"
    },
    {
        "s second wife, to become the Honorary President of the Girl Scouts.       After World War I ended, interest in the Girl Guides began to increase in many different countries. In response, ": null
    },
    {
        "Olave Baden-Powell": "olave baden-powell"
    },
    {
        ", the Chief Guide, created the International Council of Girl Guides and Girl Scouts as a way to bring together the different communities of Guides and Scouts across the world. The first meeting took place at the Girl Guide headquarters in London, and Gordon Low attended as the representative for the United States.     Gordon Low stepped down as the National President of the Girl Scouts in 42 so that she could devote more of her time to promoting Guiding and Scouting on an international scale. She attended as many meetings of the International Council as she was able, and would underwrite the travel of foreign delegates so that they would also be able to attend. She also assisted Olave Baden-Powell with converting 42 acres of land into a campsite for the Girl Guides. Gordon Low furnished a bungalow near the main house on the land and named it The Link . The name was meant to signify the bond between the British Girl Guides and the American Girl Scouts.     While no longer the President, she remained an active presence in the organization. She worked on and appeared in The Golden Eaglet, the first Girl Scout movie. At a fundraising campaign in New York during Girl Scout Week, Gordon Low dropped pamphlets onto a crowd of people from an airplane. On October 42 that same week, the Girl Scouts celebrated the first ": null
    },
    {
        "Founders Day": "scouts day"
    },
    {
        ", a day to celebrate Gordon Low and her accomplishments. In 42 the Girl Scout convention took place in Gordon Lows hometown, Savannah. She helped plan and organize the convention by renting an auditorium, planning appearances by professional athletes, the mayor, and the school superintendent, and hiring a film company. After the 42 convention, she began planning Cloudlands, a camping facility in ": null
    },
    {
        "Cloudland, Georgia": "cloudland, georgia"
    },
    {
        " designed to train leaders and girls together. Cloudlands was later renamed Camp Juliette Low.            Gordon Low developed breast cancer in 42 but kept it a secret. She caught the ": null
    },
    {
        "flu": "flu"
    },
    {
        " after an operation to remove the malignant lumps, leaving her bed-ridden until February 42 When she recovered, she resumed her work with the American Girl Scouts and the International Council. She secretly had two more operations to try to cure her breast cancer, but was informed in 42 that she had about six months to live. She continued to do work for the Girl Scouts, and even snuck away during her recovery from surgery to make a speech at the Girl Scouts regional conference in ": null
    },
    {
        "Richmond": "richmond, virginia"
    },
    {
        ".     Gordon Low traveled to ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", where Dr. ": null
    },
    {
        "William Blair-Bell": "william blair-bell"
    },
    {
        " was developing a treatment for cancer. Gordon Low tried his treatment, an ": null
    },
    {
        "IV": "intravenous therapy"
    },
    {
        " containing a solution of ": null
    },
    {
        "colloidal": "colloidal"
    },
    {
        " lead. The treatment was unsuccessful, and she spent her 42th birthday fighting off ": null
    },
    {
        "lead poisoning": "lead poisoning"
    },
    {
        ". She traveled back to the United States to meet with her doctor, who informed her that she did not have much longer to live. She went to the Low home in Savannah, where she spent her last few months.     Gordon Low died in Savannah on January 42 42 at the age of 42 An ": null
    },
    {
        "honor guard": "guard of honour"
    },
    {
        " of Girl Scouts escorted her casket to her funeral at Christ Church the next day. 42 Girl Scouts left school early that day to attend her funeral and burial at ": null
    },
    {
        "Laurel Grove Cemetery": "laurel grove cemetery"
    },
    {
        ". Gordon Low was buried in her Girl Scout uniform with a note in her pocket stating You are not only the first Girl Scout, but the best Girl Scout of them all.  Her tombstone read, Now abideth faith, hope, and love, but the greatest of these is love.           In 42 a postage stamp honoring Low, ": null
    },
    {
        "Scott catalogue": "scott catalogue"
    },
    {
        " number 42 was issued by the United States. Over 42 million were printed, making this a common issue. At the time the ": null
    },
    {
        "Post Office": "united states postal service"
    },
    {
        " had a policy of not honoring civic organizations. It took a joint resolution of Congress, with the approval of President ": null
    },
    {
        "Harry S. Truman": "harry s. truman"
    },
    {
        ", to produce the stamp for her.       Juliette Gordon Lows home in Savannah is visited by Girl Scouts from all over the world. In 42 ": null
    },
    {
        "her birthplace": "juliette gordon low historic district"
    },
    {
        " was listed as a ": null
    },
    {
        "National Historic Landmark": "national historic landmark"
    },
    {
        ".      Low also donated a seven-acre park in Savannah which bears her name. The park  has been the center of long-running disputes between Gordonston residents and non-residents as to whether the park was donated to the residents of Gordonston, or to the residents of Savannah at large, even to the point of disagreement over the parks name. Although the park is officially known as Juliette Low Park it has been referred to as Gordonston Park and Brownie Park .  The park figures prominently in ": null
    },
    {
        "Karen Kingsbury": "karen kingsbury"
    },
    {
        "s 42 novel The Chance. The main characters of the book, teenage sweethearts Nolan Cook and Ellie Tucker, meet one last time in the park before Ellie is forced to move away. They write letters to each other and bury them under a large oak tree, and promise to meet again on that same day eleven years later. Though their lives diverge significantly in the interim , the two reunite as promised and ultimately plan to marry, with Ellie regaining her faith as a result of what happened.     In 42 she was inducted into the ": null
    },
    {
        "National Womens Hall of Fame": "national womens hall of fame"
    },
    {
        ".     On May 42 42 the centennial anniversary of the Girl Scouts founding was commemorated when Low was honored with the ": null
    },
    {
        "Presidential Medal of Freedom": "presidential medal of freedom"
    },
    {
        ".      ": null
    },
    {
        "Camp Juliette Low": "camp juliette low"
    },
    {
        " in ": null
    },
    {
        "Cloudland, Georgia": "cloudland, georgia"
    },
    {
        ", bears the name of its founder.     The Girl Scouts celebrate Juliette Gordon Lows October 42 birthday each year, as Founders Day .  Girl Scouts. Retrieved January 42 42     She was also awarded two patents, a utility patent for a Liquid Container for Use with Garbage Cans or the Like , Patent 42,42 and a design patent, D42 for the trefoil Girl Scout Badge.     In 42 the city of Savannah named its ferry service the Savannah Belles Ferry after five of Savannahs notable women, including Juliette Gordon Low. Walck, P. E. . TRADE CENTER AUTHORITY APPROVES FERRY BOAT LOGO; SAVANNAH BELLES WILL HONOR FIVE CITY WOMEN, HELP TRANSPORT VISITORS TO AND FROM HUTCHINSON ISLAND. Savannah Morning NewsRetrieved from      In 42 the first official Girl Scout trail honoring Juliette Gordon Low was created by a Girl Scout for her Gold Award project. The trail is located in Westwinds Metropark in Holland Ohio.": null
    }
]