[
    {
        "     Julius Streicher was a member of the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        ". He was the founder and publisher of the virulently ": null
    },
    {
        "antisemitic": "antisemitic"
    },
    {
        " newspaper  Der Stürmer , which became a central element of the ": null
    },
    {
        "Nazi propaganda": "nazi propaganda"
    },
    {
        " machine. His publishing firm also released three antisemitic books for children, including the 42  Der Giftpilz  , one of the most widespread pieces of propaganda, which warned about the supposed dangers ": null
    },
    {
        "Jew": "jew"
    },
    {
        "s posed by using the ": null
    },
    {
        "metaphor": "metaphor"
    },
    {
        " of an attractive yet deadly mushroom. The publishing firm was financially very successful and made Streicher a multi-millionaire. At the end of the war, Streicher was convicted of ": null
    },
    {
        "crimes against humanity": "crime against humanity"
    },
    {
        " in the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " and was ": null
    },
    {
        "executed": "hanging"
    },
    {
        ".       Streicher was born in ": null
    },
    {
        "Fleinhausen": "fleinhausen"
    },
    {
        ", in the ": null
    },
    {
        "Kingdom of Bavaria": "kingdom of bavaria"
    },
    {
        ", one of nine children of the teacher Friedrich Streicher and his wife Anna . He worked as an elementary school teacher, as his father had. In 42 Streicher married Kunigunde Roth, a bakers daughter, in ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        ". They had two sons, Lothar and Elmar .     Streicher joined the ": null
    },
    {
        "German Army": "german army"
    },
    {
        " in 42 For his outstanding combat performance during the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        ", he was awarded the ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " 42st and 42nd Class, as well as earning a battlefield commission as an officer , despite having several reported instances of poor behaviour in his military record, and at a time when officers were primarily from aristocratic families. Following the end of World War I, Streicher was demobilised and returned to ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        ". Upon his return, Streicher took up another teaching position there but something unknown happened in 42 which turned him into a radical anti-Semite.        Streicher was heavily influenced by the endemic ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " of pre-war Germany, especially that of ": null
    },
    {
        "Theodor Fritsch": "theodor fritsch"
    },
    {
        ". In February 42 Streicher became active in the antisemitic  Deutschvölkischer Schutz- und Trutzbund  , one of the various radical-nationalist organizations that sprang up in the wake of the failed ": null
    },
    {
        "German Communist revolution of 42": "german revolution of 1918–19"
    },
    {
        ". Such groups fostered the view that Jews and ": null
    },
    {
        "Bolsheviks": "bolsheviks"
    },
    {
        " were synonymous, and that they were traitors trying to subject Germany to Communist rule. In 42 Streicher turned to the Deutschsozialistische Partei , a group whose platform was close to that of the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        ", or Nationalsozialistische Deutsche Arbeiter Partei . The German Socialist Party was created in May 42 as an initiative of ": null
    },
    {
        "Rudolf von Sebottendorf": "rudolf von sebottendorf"
    },
    {
        " as a child of the ": null
    },
    {
        "Thule Society": "thule society"
    },
    {
        ", and its program was based on the ideas of the mechanical engineer Alfred Brunner  Leading members of the DSP were Hans Georg Müller, Max Sesselmann and Friedrich Wiesel, the first two editors of the ": null
    },
    {
        "Münchner Beobachter": "völkischer beobachter"
    },
    {
        ". Julius Streicher founded his local branch in 42 in ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        ". The DSP was officially inaugurated in 42 in ": null
    },
    {
        "Hanover": "hanover"
    },
    {
        ".     By the end of 42 the DSP had branches in Düsseldorf, Kiel, Frankfurt am Main, Dresden, Nuremberg and Munich. Streicher sought to move the German Socialists in a more virulently antisemitic direction – an effort which aroused enough opposition that he left the group and brought his now-substantial following to yet another organisation in 42 the Deutsche Werkgemeinschaft , which hoped to unite the various antisemitic völkisch movements. Meanwhile, Streichers rhetoric against the Jews continued to intensify to such a degree that the leadership of the Deutsche Werkgemeinschaft thought he was dangerous and criticized him for his obsessive hatred of the Jews and foreign races.        In 42 Streicher left the German Socialist Party and joined the Nazi Party, bringing with him enough members of the DSP to almost double the size of the Nazi Party overnight. He would later claim that because his political work brought him into contact with ": null
    },
    {
        "German Jews": "german jews"
    },
    {
        ", he must therefore have been fated to become later on, a writer and speaker on racial politics . He visited ": null
    },
    {
        "Munich": "munich"
    },
    {
        " in order to hear ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " speak, an experience that he later said left him transformed. When asked about that moment, Streicher stated:          Nearly religiously converted by this speech, Streicher believed from this point forward that, it was his destiny to serve Hitler .     In May 42 Streicher founded the sensationalist popular newspaper  Der Stürmer  . From the outset, the chief aim of the paper was to promulgate antisemitic ": null
    },
    {
        "propaganda": "propaganda"
    },
    {
        "; the first issue had an excerpt that stated, As long as the Jew is in the German household, we will be Jewish slaves. Therefore he must go . Historian ": null
    },
    {
        "Richard J. Evans": "richard j. evans"
    },
    {
        " describes the newspaper:     Der Stürmer rapidly established itself as the place where screaming headlines introduced the most rabid attacks on Jews, full of sexual innuendo, racist caricatures, made-up accusations of ritual murder and titillating, semi-pornographic stories of Jewish men seducing innocent German girls.     In November 42 Streicher participated in Hitler’s first effort to seize power, the failed ": null
    },
    {
        "Beer Hall Putsch": "beer hall putsch"
    },
    {
        " in ": null
    },
    {
        "Munich": "munich"
    },
    {
        ". Streicher marched with Hitler in the front row of the would-be ": null
    },
    {
        "revolutionaries": "revolutionary"
    },
    {
        ". As a result of his participation in the attempted Putsch, Streicher was suspended from teaching school. His loyalty to the cause earned him Hitlers lifelong trust and protection; in the years that followed, Streicher would be one of the dictators few true intimates. Streicher and ": null
    },
    {
        "Rudolf Hess": "rudolf hess"
    },
    {
        " were the only Nazis mentioned in  Mein Kampf ; in the book Hitler praised him for subordinating the German Socialist Party to the Nazi Party, a move Hitler believed was essential to the success of the National Socialists. When Hitler was released from his prison sentence at ": null
    },
    {
        "Landsberg am Lech": "landsberg am lech"
    },
    {
        " on 42 December 42 for his role in the Putsch, Streicher was one of the few remaining followers waiting for him at his Munich apartment.     Hitler & ndash; who would value loyalty and faithfulness very highly throughout his life & ndash; remained loyal to Streicher even when he landed in trouble with the Nazi hierarchy. Although Hitler would allow suppression of Der Stürmer at times when it was politically important for the Nazis to be seen as respectable, and although he would admit that Streicher was not a very good administrator, he never withdrew his personal loyalty.     As a reward for Streichers dedication, when the Nazi Party was again legalized and re-organized in 42 Streicher was appointed  Gauleiter  of the Bavarian region of ": null
    },
    {
        "Franconia": "franconia"
    },
    {
        ", which included his home town of ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        ". In the early years of the party’s rise, Gauleiter were essentially party functionaries without real power; but in the final years of the ": null
    },
    {
        "Weimar Republic": "weimar republic"
    },
    {
        ", as the Nazi Party grew, so did their power. During the 42 years of the Nazi regime, Gauleiters such as Streicher would wield immense power and authority, both over party matters and civil ones.     Streicher was also elected to the Bavarian ": null
    },
    {
        "Landtag": "landtag"
    },
    {
        " or legislature, a position which gave him a margin of ": null
    },
    {
        "parliamentary immunity": "parliamentary immunity"
    },
    {
        "—a safety net that would help him resist efforts to silence his ": null
    },
    {
        "racist": "racism"
    },
    {
        " message.     Der Stürmer   Beginning in 42 Streicher used  Der Stürmer  as a mouthpiece not only for general antisemitic attacks, but for calculated ": null
    },
    {
        "smear campaign": "smear campaign"
    },
    {
        "s against specific Jews, such as the ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        " city official Julius Fleischmann, who worked for Streichers nemesis, mayor ": null
    },
    {
        "Hermann Luppe": ":de:hermann luppe"
    },
    {
        ".  Der Stürmer  accused Fleischmann of stealing socks from his quartermaster during combat in ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". Fleischmann sued Streicher and disproved the allegations in court, where Streicher was fined 42 ": null
    },
    {
        "mark": "german reichsmark"
    },
    {
        "s but the detailed testimony exposed less-than-glorious details  of Fleischmanns record, and his reputation was badly damaged. It was proof that Streichers unofficial motto for his tactics was correct: Something always sticks.   Der Stürmer s official slogan, Die Juden sind unser Unglück , was deemed non-actionable under German statutes, since it was not a direct incitement to violence.          Streichers opponents complained to authorities that Der Stürmer violated a statute against religious offense with his constant promulgation of the ": null
    },
    {
        "blood libel": "blood libel against jews"
    },
    {
        " – the ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " accusation that Jews killed ": null
    },
    {
        "Christian": "christians"
    },
    {
        " children to use their blood to make ": null
    },
    {
        "matzoh": "matzoh"
    },
    {
        ". Streicher argued that his accusations were based on ": null
    },
    {
        "race": "race"
    },
    {
        ", not religion, and that his communications were political speech, and therefore protected by the German constitution.     Streicher orchestrated his early campaigns against Jews to make the most extreme possible claims, short of violating a law that might get the paper shut down. He insisted in the pages of his newspaper that the Jews had caused the worldwide ": null
    },
    {
        "Depression": "great depression"
    },
    {
        ", and were responsible for the crippling ": null
    },
    {
        "unemployment": "unemployment"
    },
    {
        " and ": null
    },
    {
        "inflation": "inflation"
    },
    {
        " which afflicted Germany during the 42s. He claimed that Jews were ": null
    },
    {
        "white-slavers": "sexual slavery"
    },
    {
        " responsible for Germanys prostitution rings. Real unsolved killings in Germany, especially of children or women, were often confidently explained in the pages of Der Stürmer as cases of Jewish ": null
    },
    {
        "ritual murder": "ritual murder"
    },
    {
        ".      One of Streichers constant themes was the sexual violation of ethnically German women by Jews, a subject which he used to publish semi-": null
    },
    {
        "pornographic": "pornography"
    },
    {
        " tracts": "tract"
    },
    {
        " and images detailing degrading sexual acts. The fascination with the pornographic aspects of the propaganda in Der Stürmer was an important feature for many antisemites. With the help of his notorious cartoonist ": null
    },
    {
        "Phillip Fips Rupprecht": "philipp rupprecht"
    },
    {
        ", Streicher published image after image of Jewish ": null
    },
    {
        "stereotype": "stereotype"
    },
    {
        "s and sexually-charged encounters. His portrayal of Jews as subhuman and evil is widely considered to have played a critical role in the dehumanization and marginalization of the Jewish minority in the eyes of common Germans – creating the necessary conditions for the later perpetration of the ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        ". To protect himself from accountability, Streicher relied on Hitlers protection. Hitler declared that Der Stürmer was his favorite newspaper, and saw to it that each weekly issue was posted for public reading in special glassed-in display cases known as ": null
    },
    {
        " Stürmerkasten ": ":file:ushmm 64415.jpg"
    },
    {
        ". The newspaper reached a peak circulation of 42 in 42 One of the possible solutions to the Jewish problem Streicher mentioned within the pages of Der Stürmer was ": null
    },
    {
        "shipping all of them to Madagascar": "madagascar plan"
    },
    {
        ".       In April 42 after Nazi control of the German state apparatus gave the  Gauleiter s enormous power, Streicher organised a one-day ": null
    },
    {
        "boycott": "boycott"
    },
    {
        " of Jewish businesses which was used as a dress-rehearsal for other antisemitic commercial measures. As he consolidated his hold on power, he came to more or less rule the city of Nuremberg and his  Gau Franken , and boasted that every Jew had been removed from ": null
    },
    {
        "Hersbruck": "hersbruck"
    },
    {
        ". Among the nicknames provided by his enemies were King of Nuremberg and the Beast of Franconia. Because of his role as Gauleiter of Franconia, he also gained the nickname of  Frankenführer .          Streicher later claimed that he was only indirectly responsible for passage of the anti-Jewish ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        " of 42 and that he felt slighted because he was not directly consulted. Perhaps epitomizing the profound anti-intellectualism of the Nazi Party, Streicher once opined that, If the brains of all university professors were put at one end of the scale, and the brains of the Führer at the other, which end do you think would tip?      Streicher was ordered to take part in the establishment of the ": null
    },
    {
        "Institute for the Study and Elimination of Jewish Influence on German Church Life": "institute for the study and elimination of jewish influence on german church life"
    },
    {
        ", that was to be organized together with the ": null
    },
    {
        "German Christians": "german christians"
    },
    {
        ", the ": null
    },
    {
        "Ministry of Public Enlightenment and Propaganda": "ministry of public enlightenment and propaganda"
    },
    {
        ", the ": null
    },
    {
        "Reich Ministry of Education": "reichserziehungsministerium"
    },
    {
        " and the Reich Ministry of the Churches. A surgical operation prevented Streicher from being able to fully participate and engage in this endeavor. This antisemitic standpoint concerning the Bible can be traced back to the earliest time of the Nazi movement, e.g., ": null
    },
    {
        "Dietrich Eckart": "dietrich eckart"
    },
    {
        "s book Bolshevism from Moses to Lenin: A Dialogue Between Adolf Hitler and Me, where it was claimed that Jewish forgeries had been ": null
    },
    {
        "added": "positive christianity"
    },
    {
        " to the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        ".     In 42 Streicher ordered the Great Synagogue of ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        " destroyed as part of his contribution to  Kristallnacht . Streicher later claimed that his decision was based on his disapproval of its architectural design, which in his opinion disfigured the beautiful German townscape.        ": null
    },
    {
        "John Gunther": "john gunther"
    },
    {
        " described Streicher as the worst of the anti-Semites , and his excesses brought condemnation even from other Nazis. Streichers behaviour was viewed as so irresponsible that he was embarrassing the party leadership; chief among his enemies in Hitlers hierarchy was Reichsmarschall ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        ", who loathed him and later claimed that he forbade his own staff to read Der Stürmer.     Despite his special relationship with Hitler, after 42 Streichers position began to unravel. He was accused of keeping Jewish property seized after Kristallnacht in November 42; he was charged with spreading untrue stories about Göring – such as alleging that Görings daughter Edda was conceived by ": null
    },
    {
        "artificial insemination": "artificial insemination"
    },
    {
        "; and he was confronted with his excessive personal behaviour, including unconcealed adultery, several furious verbal attacks on other Gauleiters and striding through the streets of Nuremberg cracking a bullwhip. In February 42 he was stripped of his party offices and withdrew from the public eye, although he was permitted to continue publishing Der Stürmer. Hitler remained committed to Streicher, whom he considered a loyal friend, despite his unsavory reputation.     Streichers wife, Kunigunde Streicher, died in 42 after 42 years of marriage.     When Germany surrendered to the ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " armies in May 42 Streicher said later, he decided to commit ": null
    },
    {
        "suicide": "suicide"
    },
    {
        ". Instead, he married his former secretary, Adele Tappe. Days later, on 42 May 42 Streicher was captured in the town of ": null
    },
    {
        "Waidring": "waidring"
    },
    {
        ", ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", by a group of American officers led by Major Henry Plitt.             During his trial, Streicher claimed that he had been mistreated by Allied soldiers after his capture. When the German version of the ": null
    },
    {
        "Wechsler-Bellevue": "wechsler adult intelligence scale"
    },
    {
        " IQ test": "iq test"
    },
    {
        " was administered by ": null
    },
    {
        "Gustave Gilbert": "gustave gilbert"
    },
    {
        ", Streicher had the lowest IQ among the defendants. Streicher was not a member of the military and did not take part in planning the Holocaust, or the invasion of other nations. Yet his pivotal role in inciting the extermination of Jews was significant enough, in the prosecutors judgment, to include him in the indictment of Major War Criminals before the ": null
    },
    {
        "International Military Tribunal": "nuremberg trials"
    },
    {
        " – which sat in Nuremberg, where Streicher had once been an unchallenged authority. He complained throughout the process that all his judges were Jews.     Most of the evidence against Streicher came from his numerous speeches and articles over the years. In essence, prosecutors contended that Streichers articles and speeches were so incendiary that he was an ": null
    },
    {
        "accessory": "accessory"
    },
    {
        " to murder, and therefore as culpable as those who actually ordered the mass extermination of Jews. They further argued that he kept up his antisemitic propaganda even after he was aware that Jews were being slaughtered.     Streicher was acquitted of ": null
    },
    {
        "crimes against peace": "crime against peace"
    },
    {
        ", but found guilty of ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        ", and ": null
    },
    {
        "sentenced to death": "capital punishment"
    },
    {
        " on 42 October 42 The judgment against him read, in part:          During his trial, Streicher displayed for the last time the flair for courtroom theatrics that had made him famous in the 42s. He answered questions from his own defence attorney with diatribes against Jews, the Allies, and the court itself, and was frequently silenced by the court officers. Streicher was largely shunned by all of the other Nuremberg defendants. He also peppered his testimony with references to passages of Jewish texts he had so often carefully selected and inserted into the pages of Der Stürmer.        Streicher was ": null
    },
    {
        "hanged": "hanging"
    },
    {
        " at Nuremberg Prison in the early hours of 42 October 42 along with the nine other condemned defendants from the first Nuremberg trial. Göring, Streichers nemesis, committed ": null
    },
    {
        "suicide": "suicide"
    },
    {
        " only hours earlier. Streichers was the most melodramatic of the hangings carried out that night. At the bottom of the scaffold he cried out ": null
    },
    {
        "Heil Hitler": "heil hitler"
    },
    {
        "! . When he mounted the platform, he delivered his last sneering reference to Jewish scripture, snapping Purimfest!  Streichers final declaration before the hood went over his head was, The ": null
    },
    {
        "Bolsheviks": "bolsheviks"
    },
    {
        " will hang you one day!  Joseph Kingsbury-Smith, a journalist for the ": null
    },
    {
        "International News Service": "international news service"
    },
    {
        " who covered the executions, said in his filed report that after the hood descended over Streichers head, he also apparently said Adele, meine liebe Frau! .          The consensus among eyewitnesses was that Streichers hanging did not proceed as planned, and that he did not receive the quick death from ": null
    },
    {
        "spinal": "spinal cord"
    },
    {
        " severing typical of the other executions at Nuremberg. Kingsbury-Smith reported that Streicher went down kicking, which may have dislodged the hangmans knot from its ideal position. U.S. Army ": null
    },
    {
        "Master Sergeant": "master sergeant"
    },
    {
        " John C. Woods": "john c. woods"
    },
    {
        ", who was the main executioner, not only insisted he had performed all executions correctly, but stated he was very proud of his work.     Streichers body, along with those of the other nine executed men and the corpse of Hermann Göring, was cremated at ": null
    },
    {
        "Ostfriedhof ": "ostfriedhof"
    },
    {
        " and the ashes were scattered.": null
    }
]