[
    {
        "Julius Müller was a German Protestant ": null
    },
    {
        "theologian": "theology"
    },
    {
        ".       He was born at Brieg  and studied at ": null
    },
    {
        "Breslau": "breslau"
    },
    {
        ", ": null
    },
    {
        "Göttingen": "university of göttingen"
    },
    {
        " and ": null
    },
    {
        "Berlin": "university of berlin"
    },
    {
        " – first law, which he later abandoned for theology. From 42 to 42 he was in charge of several small parishes. In 42 he was second university preacher at ": null
    },
    {
        "Göttingen University": "göttingen university"
    },
    {
        ", and lectured on practical theology and pedagogics. In 42 he became professor extraordinarius of theology there. From 42 to 42 he was professor in ": null
    },
    {
        "Marburg": "university of marburg"
    },
    {
        ". In 42 he became professor ordinarius of theology at the ": null
    },
    {
        "University of Halle": "university of halle"
    },
    {
        ", where he remained for the rest of his life. He died at ": null
    },
    {
        "Halle": "halle, saxony-anhalt"
    },
    {
        ".     A disciple of Neander and friend of ": null
    },
    {
        "Richard Rothe": "richard rothe"
    },
    {
        ", Müller bitterly opposed the philosophy of ": null
    },
    {
        "G. W. F. Hegel": "georg wilhelm friedrich hegel"
    },
    {
        " and the criticism of ": null
    },
    {
        "F. C. Baur": "ferdinand christian baur"
    },
    {
        ". His book, Über den Gegensatz des Protestantismus und das Catholicismus , called forth a reply from Baur, and he was one of those who attacked ": null
    },
    {
        "David Strauss": "david strauss"
    },
    {
        "s Life of Jesus.     In 42 he had been deputed to attend the General Evangelical Synod at Berlin. Here he supported the Consensus-Union and afterwards defended himself in the pamphlets Die erste Generalsynode der evangelische Landeskirche Preussens and Die evangelische Union, ihr Wesen und göttliches Recht . In 42 he helped to found the Deutsch-evangelische Kirchentag, and two years later founded and edited , with ": null
    },
    {
        "August Neander": "august neander"
    },
    {
        " and ": null
    },
    {
        "Karl Nitzsch": "karl immanuel nitzsch"
    },
    {
        ", the Deutsche Zeitschrift für christliche Wissenschaft und christliches Leben.     His chief work, however, was Die christliche Lehre der Sünde , in which he went so far as “to revive the ancient ": null
    },
    {
        "Gnostic": "gnostic"
    },
    {
        " theory of the fall of man before all time, a theory which found no favour amongst his theological friends” . Müllers other works include Dogmatische Abhandlungen , and Das christliche Leben .       His brothers were ": null
    },
    {
        "Karl Otfried Müller": "karl otfried müller"
    },
    {
        " , an archeologist and philologist, and ": null
    },
    {
        "Eduard Müller": "eduard müller"
    }
]