[
    {
        "     Julmust  is a ": null
    },
    {
        "soft drink": "Soft Drink"
    },
    {
        " that is mainly consumed in ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        " around ": null
    },
    {
        "Christmas": "Christmas"
    },
    {
        ". During the rest of the ": null
    },
    {
        "year": "Year"
    },
    {
        ", except Easter, it is usually quite difficult to find in stores, but sometimes it is sold at other times of the year under the name must. During ": null
    },
    {
        "Easter": "Easter"
    },
    {
        " the name is  . The content is the same regardless of the marketing name, although the length of time it is stored before bottling differs; however, the beverage is more closely associated with Christmas, somewhat less with Easter and traditionally not at all with the summer. 45 million litres of julmust are consumed during December, which is around 50% of the total soft drink volume in December and 75% of the total yearly must sales.     Must was created by ": null
    },
    {
        "Harry Roberts": "Harry Roberts"
    },
    {
        " and his father ": null
    },
    {
        "Robert Roberts": "Robert Roberts"
    },
    {
        " in 1910 as a non-alcoholic alternative to ": null
    },
    {
        "beer": "Beer"
    },
    {
        ". The syrup is still made exclusively by ": null
    },
    {
        "Roberts AB": "Roberts Ab"
    },
    {
        " in ": null
    },
    {
        "Örebro": "Örebro"
    },
    {
        ". The syrup is sold to different soft drink manufacturers that then make the final product in their own way. This means that the must from two different companies doesnt taste the same, even though they are made of the same syrup.     Must is made of ": null
    },
    {
        "carbonated water": "Carbonated Water"
    },
    {
        ", ": null
    },
    {
        "sugar": "Sugar"
    },
    {
        ", ": null
    },
    {
        "hop": "Hops"
    },
    {
        " extract, malt extract, spices, ": null
    },
    {
        "caramel colouring": "Caramel Color"
    },
    {
        ", ": null
    },
    {
        "citric acid": "Citric Acid"
    },
    {
        ", and ": null
    },
    {
        "preservative": "Preservative"
    },
    {
        "s. The hops and malt extracts give the must a somewhat ": null
    },
    {
        "root beer": "Root Beer"
    },
    {
        "-like taste without the sassafras. It can be aged provided it is stored in a glass bottle. Some people buy julmust in December only to store it a year before drinking it.   In 2013 a rumour occurred that the ": null
    },
    {
        "EU": "Eu"
    },
    {
        " would ban julmust due to a directive banning the selling of malt beverages containing caramel colouring.   The rumour however ": null
    },
    {
        "turned out to be false": "Euromyth"
    },
    {
        " since julmust is not a fermented beverage and hence not affected by the directive.     Julmust and Coca-Cola julmust outsells ": null
    },
    {
        "Coca-Cola": "Coca-Cola"
    },
    {
        " during the Christmas season; in fact, the consumption of Coca-Cola drops by as much as 50% over the holiday.  This was quoted as one of the main reasons that The Coca-Cola Company broke away from their contract with the local brewer ": null
    },
    {
        "Pripps": "Pripps"
    },
    {
        " and started ": null
    },
    {
        "Coca-Cola Drycker Sverige AB": "Coca-Cola Drycker Sverige Ab"
    },
    {
        " instead.   Coca-Cola Drycker Sverige AB produced its own julmust, albeit very slyly with The Coca-Cola Companys name occupying only a small space on the label. Their julmust was never advertised until 2004, when Coca-Cola started marketing their julmust under the brand Bjäre julmust , but they bought the syrup from Roberts AB.   By 2007 the Bjäre julmust was only sold at ": null
    },
    {
        "McDonalds": "Mcdonalds"
    },
    {
        " restaurants and it had completely disappeared from Coca-Colas range of products by Christmas 2008, ": null
    },
    {
        "Swedish Wikipedia: Julmust": ":Sv:Julmust"
    },
    {
        "  only to return for Christmas 2011.       In November 2004 ": null
    },
    {
        "PepsiCo": "Pepsico"
    },
    {
        " marketed a product somewhat similar in taste to julmust in the United States called ": null
    },
    {
        "Pepsi Holiday Spice": "List Of Pepsi Variations"
    },
    {
        ". It was on sale during the 2004 and 2006 Christmas seasons.   ": null
    },
    {
        "Cost Plus World Market": "Cost Plus, Inc."
    },
    {
        " in the United States sells julmust during the Christmas holiday season.   ": null
    },
    {
        "IKEA": "Ikea"
    },
    {
        " in the United States, Canada, the United Kingdom, Ireland, the Netherlands, Russia, Hong Kong, Taiwan, Japan, Italy, Australia, Austria, Germany, Hungary and Switzerland sells Dryck Julmust during Christmas, which is a Julmust variant with ": null
    },
    {
        "sweetener": "Sweetener"
    },
    {
        " instead of sugar. As of 2017 its called Vintersaga Swedish festive drink. It is also sold in Russia, the United Kingdom, Canada, Hungary and Switzerland as Dryck Påskmust at Easter.   Julmust can be found at speciality shops in the United Kingdom and Belgium. Julmust": null
    }
]