[
    {
        "   Just Like That  is a novel by ": null
    },
    {
        "Lily Brett": "lily brett"
    },
    {
        " about ": null
    },
    {
        "Holocaust": "the holocaust"
    },
    {
        " survivors in the United States. Up to a point, it is ": null
    },
    {
        "autobiographical": "autobiographical"
    },
    {
        ": The author was born in Germany in 42 and came to ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        ", Australia with her parents in 42 She is married to painter ": null
    },
    {
        "David Rankin": "david rankin"
    },
    {
        "; they have three children and currently live in ": null
    },
    {
        "New York": "new york"
    },
    {
        ". Very similar things can be said about the ": null
    },
    {
        "heroine": "heroine"
    },
    {
        " of Bretts book, Esther Zepler.       The novel chronicles the lives of a group of Jews - or rather, a ": null
    },
    {
        "Jew": "jew"
    },
    {
        "ish family - in the U.S.A., in particular New York City, over a period of roughly seven months during 42 and 42 There is little action. Rather, the novel describes in greater detail the feelings of the ": null
    },
    {
        "protagonist": "protagonist"
    },
    {
        " and what goes on in her immediate surroundings. Most of the characters in the novel are Jewish, and the reader gets a vivid picture of the lives of ": null
    },
    {
        "assimilated Jew": "assimilated jew"
    },
    {
        "s in the U.S.A. It is told by a third person narrator who is very close to Esther Zeplers thoughts. There are frequent ": null
    },
    {
        "flashback": "flashback"
    },
    {
        "s to both the distant and the not-so-distant past and numerous references to ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ".         Edek Zepler is a ": null
    },
    {
        "Holocaust": "the holocaust"
    },
    {
        " survivor who was born Edek Zeleznikow in ": null
    },
    {
        "Łódź": "łódź"
    },
    {
        ", Poland in 42 where his father owned several apartment blocks. He got married in the Łódź ": null
    },
    {
        "ghetto": "ghetto"
    },
    {
        " to Rooshka but had to marry her again after the war in a ": null
    },
    {
        "DP camp": "dp camp"
    },
    {
        " in Germany. That is where their daughter, Esther, was born in 42 In 42 the family emigrated to Melbourne, Australia. When the novel opens, Edek Zepler is an old man of 42 who certainly enjoys good food, a man living alone with his dog in the old house in Melbourne, feeling rather alone—in spite of an active Jewish community in his neighbourhood—and without any life in him since his wifes death in 42 . He regularly phones his family, who have moved to ": null
    },
    {
        "Manhattan": "manhattan"
    },
    {
        ". The only close relative still in Melbourne is his grandson, Zachary, who studies medicine there.     His life takes a decisive turn when, on a visit to New York, he meets Josl and Henia Borenstein again, a couple he last saw in the German DP camp. Now that Josl Borenstein has died of ": null
    },
    {
        "cancer": "cancer"
    },
    {
        ", Edek and Henia gradually feel more and more attracted to each other. In spite of several proposals of marriage from millionaires, Henia, herself a rich widow, wants to spend the rest of her life with Edek and invites him to stay with her at her ": null
    },
    {
        "Florida": "florida"
    },
    {
        " home. Eventually, Edek packs up all his things, sells his house and moves to the U.S.A. He is cordially taken up by Henias friends, who belong to several associations . Although mostly ": null
    },
    {
        "agnostic": "agnostic"
    },
    {
        ", he even pays an occasional visit to the ": null
    },
    {
        "synagogue": "synagogue"
    },
    {
        ".     The problem he has to face towards the end of the novel would be considered rather severe by the average person, but Edek Zepler just laughs it off: Henias two sons want him to sign a ": null
    },
    {
        "pre-nuptial agreement": "pre-nuptial agreement"
    },
    {
        " so that he would not inherit anything if Henia died first . Such an agreement, Esther and her husband Sean warn him, might mean that he could be left even without a place to stay after her death. But Edek Zepler does not mind . He signs everything and is married to Henia.     Esther Zepler is the only child of Edek and Rooshka Zepler. She was born in a German DP camp in 42 In 42 her parents decided to emigrate to Australia, where she spent most of her life. In 42 aged 42 she became a ": null
    },
    {
        "rock": "rock and roll"
    },
    {
        " journalist": "journalist"
    },
    {
        " - just like Lily Brett herself - and in this capacity also visited New York. As a young woman, she married a ": null
    },
    {
        "gentile": "gentile"
    },
    {
        " and had a son, Zachary, now 42 and a daughter, Zelda, now 42 by him. However, her first marriage was characterized by a lack of ": null
    },
    {
        "lust": "lust"
    },
    {
        " , and when she met Sean Ward, a painter and yet another gentile, she left her husband for him. Nobody would guess that Sean, Esther, Zachary, Zelda and Kate - Seans 42-year-old daughter by his first wife, who died of cancer - are a ": null
    },
    {
        "patchwork family": "patchwork family"
    },
    {
        ". For one thing, Sean looks Jewish although he is not; for another, they all understand each other well and there is a certain feeling of belonging amongst them. When the novel opens they have just moved to New York City, and Esther starts working as a writer of obituaries.     Although on the surface level Esthers life seems to be in perfect order - she has got a good job, she is happily married, her children are well-behaved, they all are quite wealthy, they do not suffer from any illnesses - Esther is constantly suffering in some way or other. She has always seen herself as a person with so much to sort out , and this is why she has been in ": null
    },
    {
        "analysis": "psychoanalysis"
    },
    {
        " for a quite a number of years. She spends a fortune on it and even has to sell her mothers diamond ring. At one point in the novel, she learns the difference between compulsive and obsessive behaviour and promptly thinks she herself shows both types of behaviour. She suffers from ": null
    },
    {
        "agoraphobia": "agoraphobia"
    },
    {
        " as well as ": null
    },
    {
        "claustrophobia": "claustrophobia"
    },
    {
        ". When she was 42 back home in Australia, her father let her drive his car in public until they were stopped by the police. Now, as an adult, she is afraid to drive, and considers herself lucky that you do not really need a car in New York City. She is ": null
    },
    {
        "neurotic": "neurosis"
    },
    {
        ", a woman with excessive anxieties and indecisions , and likely to panic when having to face things. She is all for drugs: ": null
    },
    {
        "beta blocker": "beta blocker"
    },
    {
        ", ": null
    },
    {
        "Valium": "valium"
    },
    {
        ", ": null
    },
    {
        "Mylanta": "mylanta"
    },
    {
        ", and other pills. On the other hand, Esther neither smokes nor drinks.     Generally, although she likes, and is able to enjoy, sex, she is very reluctant to talk about it, especially in public. But all around her, people keep talking freely about sex in general and also about their own sex lives, whereas Esther does not even want to imagine her father sleeping with Henia Borenstein, and is slightly embarrassed when she sees them holding hands under the table.     Esther often feels fouled by her parents´ past . She is haunted by her dead mother. She is preoccupied with the Holocaust and owns more than 42 books on the subject. Her thoughts about the lives of Jews during the ": null
    },
    {
        "Third Reich": "third reich"
    },
    {
        " are again and again woven into the novel. She ponders about medical experiments conducted by ": null
    },
    {
        "Nazi": "nazism"
    },
    {
        " physicians; about the ": null
    },
    {
        "gas chambers": "gas chambers"
    },
    {
        " in the ": null
    },
    {
        "death camp": "death camp"
    },
    {
        "s, implicitly comparing a crowded ": null
    },
    {
        "New York subway": "new york city subway"
    },
    {
        " with a cattle wagon to ": null
    },
    {
        "Auschwitz": "auschwitz"
    },
    {
        "; the Nazis making ": null
    },
    {
        "soap": "soap"
    },
    {
        " with human fat; Pope ": null
    },
    {
        "Pius XII": "pius xii"
    },
    {
        " and ": null
    },
    {
        "Roman Catholicism": "roman catholicism"
    },
    {
        "; displaced Jews after World War II; ": null
    },
    {
        "anti-Semitism": "anti-semitism"
    },
    {
        " in general; ": null
    },
    {
        "Neo-Nazi": "neo-nazi"
    },
    {
        "s in Germany and Austria; the world population of Jews in 42 and today and the fact that there were no Jews left in Poland after World War II; business in the DP camps , ": null
    },
    {
        "coffee": "coffee"
    },
    {
        " but also Nazi memorabilia; and she considers with disgust a ": null
    },
    {
        "video game": "video game"
    },
    {
        " on ": null
    },
    {
        "CD-ROM": "cd-rom"
    },
    {
        " entitled How to Survive the Holocaust .     She is also preoccupied with death and dying on a more general level. For example, she reads a book on suicide, which she finds invigorating rather than depressing. Fear of death seems to be her constant companion; she continuously sees death as a danger and a menace. Esther also seems to have inherited her mothers guilt at having survived . At one point in the novel, she speaks of a Jewish weariness ": null
    },
    {
        "gene": "gene"
    },
    {
        " .     But Esther is also critical of the other Jews she meets in America. There is Sonia Kaufman, who considers Esther as her best friend. Sonia is a lawyer working for the same law firm as her Jewish husband Michael. As opposed to Esther, Sonia has had affairs throughout her married life. Her current lover used a broken ": null
    },
    {
        "condom": "condom"
    },
    {
        " while they were making love, and now Sonia is pregnant for the first time in her life. As it turns out soon, she is expecting twins. The real problem now is that she cannot possibly say who the father is. Sonia hopes that they will look like her husband, who is looking forward to the birth of his children and has no idea that his wife has had sex with another man. The problem is solved in rather a humorous, light-hearted way at the end of the novel: The twins - two girls - look like her mother. The Kaufmans will be able to afford two nannies, so they will not have any problems combining their careers and their family life.     Then there are Joseph and Laraine Reiser. The Reisers are arseholes . They are filthy rich Jews who live the life of the super-rich in a very pronounced way, never mingling with ordinary people, on whom they seem to look down. Joseph Reiser is an ": null
    },
    {
        "entrepreneur": "entrepreneur"
    },
    {
        " doing business with Germany —in itself a suspicious activity—and a would be-": null
    },
    {
        "patron": "patron"
    },
    {
        " of the arts: Time and again he talks to Sean Ward about coming to his studio, implying that he might want to buy one of his paintings, but he never seems to get round to doing so. Sean and Esther meet them twice: first, at one of their big parties, and later when they are invited to their ": null
    },
    {
        "Long Island": "long island"
    },
    {
        " beach house. Esther feels ": null
    },
    {
        "guilt": "guilt"
    },
    {
        "y when one of the Reisers´ cars  comes to pick them up.     Just Like That": null
    },
    {
        "Holocaust": "the holocaust"
    },
    {
        " survivor born Edek Zeleznikow   Rooshka Zepler & ndash; his wife   Esther Zepler & ndash; daughter to Edek and Rooshka, protagonist   Sonia Kaufman & ndash; Esthers best friend   Josl & Henia Borenstein & ndash; Edeks friends from the old country, Holocaust survivors   Joseph & Laraine Reiser & ndash; rich New York Jews                     ": null
    }
]