[
    {
        "          In music, just intonation or pure intonation is the ": null
    },
    {
        "tuning": "Musical Tuning"
    },
    {
        " of musical ": null
    },
    {
        "intervals": "Interval"
    },
    {
        " as small ": null
    },
    {
        "whole number": "Natural Number"
    },
    {
        "ratios": "Ratio"
    },
    {
        " of ": null
    },
    {
        "frequencies": "Frequency"
    },
    {
        ". Any ": null
    },
    {
        "interval": "Interval"
    },
    {
        " tuned in this way is called a just interval. Just intervals consist of members of a single ": null
    },
    {
        "harmonic series": "Harmonic Series"
    },
    {
        " of a ": null
    },
    {
        "implied fundamental": "Missing Fundamental"
    },
    {
        ". For example, in the diagram at right, the notes G and middle C , are both members of the harmonic series of the lowest C and their frequencies will be 3 and 4 times, respectively, the fundamental frequency; thus, their interval ratio will be 4:3. If the frequency of the fundamental is 64 ": null
    },
    {
        "Hertz": "Hertz"
    },
    {
        ", the frequencies of the two notes in question would be 192 and 256.     Instruments are not always tuned using these intervals. In the Western world, instruments of fixed pitch, such as pianos, are typically tuned using ": null
    },
    {
        "equal temperament": "Equal Temperament"
    },
    {
        ", in which intervals other than octaves consist of irrational-number frequency ratios. The difference between a just interval and an equal-tempered interval is called a ": null
    },
    {
        "comma": "Comma"
    },
    {
        ".       All tuning systems include frequency ratios of powers of 2, called ": null
    },
    {
        "perfect octaves": "Octave"
    },
    {
        ".     ": null
    },
    {
        "Pythagorean tuning": "Pythagorean Tuning"
    },
    {
        ", or 3-limit tuning, also allows ratios including the number 3, such as 3:2, a ": null
    },
    {
        "perfect fifth": "Perfect Fifth"
    },
    {
        ". Although the interval from C to G is called a perfect fifth for purposes of music analysis regardless of its tuning method, for purposes of discussing tuning systems musicologists may distinguish between a perfect fifth created using the 3:2 ratio and a tempered fifth using some other system, such as ": null
    },
    {
        "meantone": "Meantone Temperament"
    },
    {
        " or equal temperament.     ": null
    },
    {
        "5-limit tuning": "Five-Limit Tuning"
    },
    {
        " encompasses ratios using the number 5 as well, such as 5:4, a ": null
    },
    {
        "major third": "Major Third"
    },
    {
        ". The specialized term perfect third is occasionally used to distinguish the 5:4 ratio from major thirds created using other tuning methods. 7-limit and higher systems use higher partials in the overtone series, but are less common, at least in Western music.     A ": null
    },
    {
        "wolf interval": "Wolf Interval"
    },
    {
        " is an interval whose tuning is far away from its just-tuned equivalent, usually perceived as discordant and undesirable.     ": null
    },
    {
        "Cents": "Cent"
    },
    {
        " are a measure of interval size. In 12-tone equal temperament a half step is 100 cents.            ": null
    },
    {
        "Pythagorean tuning": "Pythagorean Tuning"
    },
    {
        " has been attributed to both ": null
    },
    {
        "Pythagoras": "Pythagoras"
    },
    {
        " and ": null
    },
    {
        "Eratosthenes": "Eratosthenes"
    },
    {
        " by later writers, but may also been analyzed by other early Greeks or other early cultures as well. The oldest known description of the Pythagorean tuning system appears in Babylonian artifacts.      During the second century AD, ": null
    },
    {
        "Claudius Ptolemy": "Ptolemy"
    },
    {
        " described a 5-limit diatonic scale in his influential text on music theory Harmonics, which he called tense diatonic .  Given ratios of string lengths 120, 112 , 100, 90, 80, 75, 66 , and 60, Ptolemy quantified the tuning of what would later be called the ": null
    },
    {
        "Phrygian scale": "Phrygian Mode"
    },
    {
        "  – 16:15, 9:8, 10:9, 9:8, 16:15, 9:8, and 10:9.     Non-Western music, particular that built on pentatonic scales, is largely tuned using just intonation. In China, the ": null
    },
    {
        "guqin": "Guqin"
    },
    {
        " has a musical scale based on ": null
    },
    {
        "harmonic": "Harmonic"
    },
    {
        " overtone": "Overtone"
    },
    {
        " positions. The dots on its soundboard indicate the harmonic positions: , , , , , , , , , , , , .  Indian music has an extensive ": null
    },
    {
        "theoretical framework": "Svara"
    },
    {
        " for tuning in just intonation.                    The prominent notes of a given scale may be tuned so that their frequencies form small whole number ratios.     The 5-limit diatonic major scale is tuned in such a way that major triads on the ": null
    },
    {
        "tonic": "Tonic"
    },
    {
        ", ": null
    },
    {
        "subdominant": "Subdominant"
    },
    {
        ", and ": null
    },
    {
        "dominant": "Dominant"
    },
    {
        " are tuned in the proportion 4:5:6, and minor triads on the ": null
    },
    {
        "mediant": "Mediant"
    },
    {
        " and ": null
    },
    {
        "submediant": "Submediant"
    },
    {
        " are tuned in the proportion 10:12:15. Because of the two sizes of wholetone – 9:8 and 10:9 – the ": null
    },
    {
        "supertonic": "Supertonic"
    },
    {
        " must be microtonally lowered by a ": null
    },
    {
        "syntonic comma": "Syntonic Comma"
    },
    {
        " to form a pure minor triad.     5-limit diatonic major scale on C Murray Campbell and Clive Greated, The Musicians Guide to Acoustics , pp.  172–73. Reprint of the first edition . . Wright, David . Mathematics and Music, Mathematical World 28 pp.  140–41. . Johnston, Ben , A Notation System for Extended Just Intonation , in  Maximum Clarity and Other Writings on Music, edited by Bob Gilmore , p.  78. . : Partch, Harry .  Genesis of a Music , pp.  165 & 73. .        For a justly tuned harmonic minor scale, the mediant is tuned 6:5 and the submediant is tuned 8:5. Natural minor would include a tuning of 9:5 for the ": null
    },
    {
        "subtonic": "Subtonic"
    },
    {
        ".          There are several ways to create a just tuning of the twelve-tone scale.            ": null
    },
    {
        "Pythagorean tuning": "Pythagorean Tuning"
    },
    {
        " can produce a twelve-tone scale, but it does so by involving ratios of very large numbers, corresponding to natural harmonics very high in the harmonic series that do not occur widely in physical phenomena. This tuning uses ratios involving only powers of 3 and 2, creating a sequence of just ": null
    },
    {
        "fifths": "Perfect Fifth"
    },
    {
        " or ": null
    },
    {
        "fourth": "Perfect Fourth"
    },
    {
        "s, as follows:          The ratios are computed with respect to C . Starting from C, they are obtained by moving six steps  to the left and six to the right. Each step consists of a multiplication of the previous pitch by 2/3 , 3/2 , or their ": null
    },
    {
        "inversions": "Inversion"
    },
    {
        " .     Between the ": null
    },
    {
        "enharmonic": "Enharmonic"
    },
    {
        " notes at both ends of this sequence is a ": null
    },
    {
        "pitch": "Pitch"
    },
    {
        " ratio of , or about 23 ": null
    },
    {
        "cents": "Cent"
    },
    {
        ", known as the ": null
    },
    {
        "Pythagorean comma": "Pythagorean Comma"
    },
    {
        ". To produce a twelve-tone scale, one of them is arbitrarily discarded. The twelve remaining notes are repeated by increasing or decreasing their frequencies by a power of 2  to build scales with multiple octaves . A drawback of Pythagorean tuning is that one of the twelve fifths in this scale is badly tuned and hence unusable . This twelve-tone scale is fairly close to ": null
    },
    {
        "equal temperament": "Equal Temperament"
    },
    {
        ", but it does not offer much advantage for ": null
    },
    {
        "tonal": "Tonality"
    },
    {
        " harmony because only the perfect intervals are simple enough to sound pure. Major thirds, for instance, receive the rather unstable interval of 81:64, sharp of the preferred 5:4 by an 81:80 ratio.  The primary reason for its use is that it is extremely easy to tune, as its building block, the perfect fifth, is the simplest and consequently the most ": null
    },
    {
        "consonant": "Consonance And Dissonance"
    },
    {
        " interval after the octave and unison.     Pythagorean tuning may be regarded as a three-limit tuning system, because the ratios can be expressed as a product of integer powers of only whole numbers less than or equal to 3.            A twelve-tone scale can also be created by compounding harmonics up to the fifth. Namely, by multiplying the frequency of a given reference note  by powers of 2, 3, or 5, or a combination of them. This method is called five-limit tuning.     To build such a twelve-tone scale , we may start by constructing a table containing fifteen pitches:          The factors listed in the first row and column are powers of 3 and 5, respectively . Colors indicate couples of ": null
    },
    {
        "enharmonic": "Enharmonic"
    },
    {
        " notes with almost identical pitch. The ratios are all expressed relative to C in the centre of this diagram . They are computed in two steps:     For each cell of the table, a base ratio is obtained by multiplying the corresponding factors. For instance, the base ratio for the lower-left cell is 1/9  ×  1/5    1/45.   The base ratio is then multiplied by a negative or positive power of 2, as large as needed to bring it within the range of the octave starting from C . For instance, the base ratio for the lower left cell is multiplied by 2 6 , and the resulting ratio is 64:45, which is a number between 1:1 and 2:1.     Note that the powers of 2 used in the second step may be interpreted as ascending or descending ": null
    },
    {
        "octave": "Octave"
    },
    {
        "s. For instance, multiplying the frequency of a note by 2 6 means increasing it by 6 octaves. Moreover, each row of the table may be considered to be a sequence of fifths , and each column a sequence of major thirds . For instance, in the first row of the table, there is an ascending fifth from D and A, and another one from A to E. This suggests an alternative but equivalent method for computing the same ratios. For instance, one can obtain A, starting from C, by moving one cell to the left and one upward in the table, which means descending by a fifth and ascending by a major third:     : ×   .     Since this is below C, one needs to move up by an octave to end up within the desired range of ratios :     : ×   .     A 12-tone scale is obtained by removing one note for each couple of enharmonic notes. This can be done in at least three ways, which have in common the removal of G, according to a convention which was valid even for C-based Pythagorean and quarter-comma meantone scales. Note that it is a ": null
    },
    {
        "diminished fifth": "Diminished Fifth"
    },
    {
        ", close to half an octave, above the tonic C, which is a disharmonic interval; also its ratio has the largest values in its numerator and denominator of all tones in the scale, which make it least harmonious: all reasons to avoid it.     This is only one possible strategy of ": null
    },
    {
        "five-limit tuning": "Five-Limit Tuning"
    },
    {
        ". It consists of discarding the first column of the table . The resulting 12-tone scale is shown below:              The table above uses only low powers of 3 and 5 to build the base ratios. However, it can be easily extended by using higher positive and negative powers of the same numbers, such as 5 2 25, 5 −2 1/25, 3 3 27, or 3 −3 1/27. A scale with 25, 35 or even more pitches can be obtained by combining these base ratios, as in ": null
    },
    {
        "five-limit tuning": "Five-Limit Tuning"
    },
    {
        ".       In ": null
    },
    {
        "Indian music": "Indian Music"
    },
    {
        ", the just diatonic scale described above is used, though there are different possibilities, for instance for the sixth pitch , and further modifications may be made to all pitches excepting Sa and Pa.           Some accounts of Indian intonation system cite a given 22 ": null
    },
    {
        "Shruti": "Shruti"
    },
    {
        "s.   According to some musicians, one has a scale of a given 12 pitches and ten in addition :          Where we have two ratios for a given letter name, we have a difference of 81:80 , which is known as the ": null
    },
    {
        "syntonic comma": "Syntonic Comma"
    },
    {
        ". One can see the symmetry, looking at it from the tonic, then the octave.              Some fixed just intonation scales and systems, such as the diatonic scale above, produce ": null
    },
    {
        "wolf interval": "Wolf Interval"
    },
    {
        "s. The above scale allows a minor tone to occur next to a semitone which produces the awkward ratio 32:27 for D-F, and still worse, a minor tone next to a fourth giving 40:27 for D-A. Moving D down to 10:9 alleviates these difficulties but creates new ones: D-G becomes 27:20, and D-B becomes 27:16. This fundamental problem arises in any system of tuning using a limited number of notes.     One can have more ": null
    },
    {
        "frets": "Fret"
    },
    {
        "on a ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        " to handle both As, 9:8 with respect to G and 10:9 with respect to G so that A-C can be played as 6:5 while A-D can still be played as 3:2. 9:8 and 10:9 are less than 1/53 of an octave apart, so mechanical and performance considerations have made this approach extremely rare. And the problem of how to tune chords such as C-E-G-A-D, in typical 5-limit just intonation, is left unresolved . However the frets may be removed entirely—this, unfortunately, makes in-tune fingering of many chords exceedingly difficult, due to the construction and mechanics of the human hand—and the tuning of most complex chords in just intonation is generally ambiguous.     Some composers deliberately use these wolf intervals and other dissonant intervals as a way to expand the tone color palette of a piece of music. For example, the extended piano pieces  The Well-Tuned Piano  by LaMonte Young and The Harp Of New Albion by Terry Riley use a combination of very consonant and dissonant intervals for musical effect. In Revelation , ": null
    },
    {
        "Michael Harrison": "Michael Harrison"
    },
    {
        " goes even further, and uses the tempo of beat patterns produced by some dissonant intervals as an integral part of several movements.     For many fixed-pitch instruments tuned in just intonation, one cannot change ": null
    },
    {
        "keys": "Key"
    },
    {
        " without retuning the instrument. For instance, if a piano is tuned in just intonation intervals and a minimum of wolf intervals for the key of G, then only one other key can have the same intervals, and many of the keys have a very dissonant and unpleasant sound. This makes ": null
    },
    {
        "modulation": "Modulation"
    },
    {
        " within a piece, or playing a repertoire of pieces in different keys, impractical to impossible.     ": null
    },
    {
        "Synthesizers": "Synthesizer"
    },
    {
        "have proven a valuable tool for composers wanting to experiment with just intonation. They can be easily retuned with a ": null
    },
    {
        "microtuner": "Microtuner"
    },
    {
        ". Many commercial synthesizers provide the ability to use built-in just intonation scales or to create them manually. ": null
    },
    {
        "Wendy Carlos": "Wendy Carlos"
    },
    {
        " used a system on her 1986 album  Beauty in the Beast , where one electronic keyboard was used to play the notes, and another used to instantly set the root note to which all intervals were tuned, which allowed for modulation. On her 1987 lecture album Secrets of Synthesis there are audible examples of the difference in sound between equal temperament and just intonation.          The human voice is among the most pitch-flexible instruments in common use. Pitch can be varied with no restraints and adjusted in the midst of performance, without needing to retune. Although the explicit use of just intonation fell out of favour concurrently with the increasing use of instrumental accompaniment , most ": null
    },
    {
        "a cappella": "A Cappella"
    },
    {
        " ensembles naturally tend toward just intonation because of the comfort of its stability. ": null
    },
    {
        "Barbershop quartets": "Barbershop Music"
    },
    {
        " are a good example of this.     The unfretted stringed instruments from the violin family are quite flexible in the way pitches can be adjusted. Stringed instruments that are not playing with fixed pitch instruments tend to adjust the pitch of key notes such as thirds and ": null
    },
    {
        "leading tones": "Leading Tone"
    },
    {
        "so that the pitches differ from equal temperament.     Trombones have a slide that allows arbitrary tuning during performance.     Wind instruments with valves are biased towards natural tuning and must be micro-tuned if equal temperament is required.     Other wind instruments, although built to a certain scale, can be micro-tuned to a certain extent by using the embouchure or adjustments to fingering.       Composers often impose a ": null
    },
    {
        "limit": "Limit"
    },
    {
        " on how complex the ratios may become.  For example, a composer who chooses to write in 7-limit just intonation will not employ ratios that use powers of prime numbers larger than 7. Under this scheme, ratios like 11:7 and 13:6 would not be permitted, because 11 and 13 cannot be expressed as powers of those prime numbers ≤ 7 .     Though just intonation in its simplest form may seem to suggest a necessarily ": null
    },
    {
        "tonal": "Tonality"
    },
    {
        " logic, it need not be the case. Some music of ": null
    },
    {
        "Kraig Grady": "Kraig Grady"
    },
    {
        " and ": null
    },
    {
        "Daniel James Wolf": "Daniel James Wolf"
    },
    {
        " uses just intonation scales designed by ": null
    },
    {
        "Erv Wilson": "Erv Wilson"
    },
    {
        " explicitly for a consonant form of ": null
    },
    {
        "atonality": "Atonality"
    },
    {
        ", and many of Ben Johnstons early works, like the  Sonata for Microtonal Piano  and String Quartet No. 2, use ": null
    },
    {
        "serialism": "Serialism"
    },
    {
        " to achieve a more atonal result.     Alternatively, composers such as ": null
    },
    {
        "La Monte Young": "La Monte Young"
    },
    {
        ", Ben Johnston, ": null
    },
    {
        "James Tenney": "James Tenney"
    },
    {
        ", ": null
    },
    {
        "Marc Sabat": "Marc Sabat"
    },
    {
        ", ": null
    },
    {
        "Wolfgang von Schweinitz": "Wolfgang Von Schweinitz"
    },
    {
        ", Chiyoko Szlavnics, Catherine Lamb, Kristofer Svensson, and Thomas Nicholson have sought a new kind tonality and harmony – one based on the perception and experience of sound, which not only allows for the more familiar consonant structures, but also extends them beyond the 5-limit into a nuanced and diverse network of relationships between tones.      ": null
    },
    {
        "Yuri Landman": "Yuri Landman"
    },
    {
        " devised a just intonation musical scale from an atonal ": null
    },
    {
        "prepared guitar": "Prepared Guitar"
    },
    {
        " playing technique": "Extended Technique"
    },
    {
        " based on adding a third ": null
    },
    {
        "bridge": "Bridge"
    },
    {
        " under the strings. When this bridge is positioned at ": null
    },
    {
        "nodal": "Node"
    },
    {
        " positions of the guitar strings ": null
    },
    {
        "harmonic series": "Harmonic Series"
    },
    {
        ", the volume of the instrument increases and the ": null
    },
    {
        "overtone": "Overtone"
    },
    {
        " becomes clear, having a consonant relation to the complementary opposed string part creating a harmonic ": null
    },
    {
        "multiphonic": "Multiphonic"
    },
    {
        " tone.   by Yuri Landman on furious.com                        Originally a system of notation to describe scales was devised by ": null
    },
    {
        "Hauptmann": "Moritz Hauptmann"
    },
    {
        " and modified by ": null
    },
    {
        "Helmholtz": "Hermann Von Helmholtz"
    },
    {
        " in which Pythagorean notes are started with and subscript numbers are added indicating how many commas to lower by. Hermann von Helmholtz . https://books.google.com/books?idGwE6AAAAIAAJ & printsecfrontcover & dqOn+the+Sensations+of+Tone+as+a+Physiological+Basis+for+the+Theory+of+Music & hlen & eikCzmTsmNIpHRiALfn5G_Bg & saX & oibook_result & ctresult & resnum1 & ved0CDEQ6AEwAAvonepage & qcomma & ffalse On the Sensations of Tone as a Physiological Basis for the Theory of Music, p.276. Longmans, Green. Note the use of the + between just major thirds, − between just minor thirds, | between Pythagorean minor thirds, and ± between perfect fifths. For example, the Pythagorean major third on C is C+E  while the just major third is C+E 1 . A similar system was devised by ": null
    },
    {
        "Carl Eitz": "Carl Eitz"
    },
    {
        " and used in ": null
    },
    {
        "Barbour": "J. Murray Barbour"
    },
    {
        " in which Pythagorean notes are started with and positive or negative superscript numbers are added indicating how many commas to adjust by. Benson, David J. . Music: A Mathematical Offering, p.172. . Cites Eitz, Carl A. . Das mathematisch-reine Tonsystem. Leipzig. For example, the Pythagorean major third on C is C-E 0 while the just major third is C-E −1 .     While these systems allow precise indication of intervals and pitches in print, more recently some composers have been developing notation methods for Just Intonation using the conventional five-line staff. ": null
    },
    {
        "James Tenney": "James Tenney"
    },
    {
        ", amongst others, preferred to combine JI ratios with ": null
    },
    {
        "cents": "Cent"
    },
    {
        " deviations from the ": null
    },
    {
        "equal tempered": "Equal Tempered"
    },
    {
        " pitches, indicated in a legend or directly in the score, allowing performers to readily use electronic tuning devices if desired.  Beginning in the 1960s, Ben Johnston had proposed an alternative approach, redefining the understanding of conventional symbols and adding further accidentals, each designed to extend the notation into higher ": null
    },
    {
        "prime limit": "Prime Limit"
    },
    {
        "s. His notation begins with the 16th-century Italian definitions of intervals and continues from there.  , KyleGann.com. Accessed February 2016.     Johnston‘s method is based on a diatonic C Major scale tuned in JI, in which the interval between D and A is one ": null
    },
    {
        "syntonic comma": "Syntonic Comma"
    },
    {
        " less than a Pythagorean perfect fifth 3:2. To write a perfect fifth, Johnston introduces a pair of symbols representing this comma, + and −. Thus, a series of perfect fifths beginning with F would proceed C G D A+ E+ B+. The three conventional white notes A E B are tuned as Ptolemaic major thirds above F C G respectively. Johnston introduces new symbols for the septimal , undecimal , tridecimal , and further prime-number extensions to create an accidental based exact JI notation for what he has named Extended Just Intonation . Johnston & Gilmore , p.77-88. For example, the Pythagorean major third on C is C-E+ while the just major third is C-E.          In 2000–2004, ": null
    },
    {
        "Marc Sabat": "Marc Sabat"
    },
    {
        " and ": null
    },
    {
        "Wolfgang von Schweinitz": "Wolfgang Von Schweinitz"
    },
    {
        " worked in Berlin to develop a different accidental-based method, the Extended Helmholtz-Ellis JI Pitch Notation.  Following the method of notation suggested by Helmholtz in his classic On the Sensations of Tone as a Physiological Basis for the Theory of Music , incorporating Ellis invention of cents, and continuing Johnstons step into Extended JI , Sabat and Schweinitz consider each prime dimension of harmonic space to be represented by a unique symbol. In particular they take the conventional flats, naturals and sharps as a Pythagorean series of perfect fifths. Thus, a series of perfect fifths beginning with F proceeds C-G-D-A-E-B-F and so on.     For higher primes, additional signs have been designed. To facilitate quick estimation of pitches, cents indications may be added . The convention used is that the cents written refer to the tempered pitch implied by the flat, natural, or sharp sign and the note name. A complete legend and fonts for the notation are open source and available from Plainsound Music Edition.  For example, the Pythagorean major third on C is C-E while the just major third is C-E↓.     One of the great advantages of such notation systems is that they allow the natural harmonic series to be precisely notated.     Sagittal notation is a system of arrow-like accidentals that indicate prime-number comma alterations to tones in a Pythagorean series. It is used to notate both just intonation and equal temperaments. The size of the symbol indicates the size of the alteration. ": null
    },
    {
        "Secor, George D.": "George Secor"
    },
    {
        " and ": null
    },
    {
        "Keenan, David C.": "David C. Keenan"
    },
    {
        " .  , pp. 1–2, Sagittal.org. Originally printed in Xenharmonikôn: An Informal Journal of Experimental Music, Volume 18.       An A-major scale, followed by three major triads, and then a progression of fifths in just intonation.    An A-major scale, followed by three major triads, and then a progression of fifths in equal temperament. The ": null
    },
    {
        "beating": "Beat"
    },
    {
        " in this file may be more noticeable after listening to the above file.    A pair of major thirds, followed by a pair of full major chords. The first in each pair is in equal temperament; the second is in just intonation. Piano sound.    A pair of major chords. The first is in equal temperament; the second is in just intonation. The pair of chords is repeated with a transition from equal temperament to just intonation between the two chords. In the equal temperament chords a roughness or ": null
    },
    {
        "beating": "Beat"
    },
    {
        " can be heard at about 4 ": null
    },
    {
        "Hz": "Hertz"
    },
    {
        " and about 0.8  Hz. In the just intonation triad, this roughness is absent. The ": null
    },
    {
        "square wave": "Square Wave"
    }
]