[
    {
        "Justine Bartolini-Baldelli, née Pecori-Suárez  was a French Princess, being the spouse of Prince ": null
    },
    {
        "Jérôme Bonaparte": "jérôme bonaparte"
    },
    {
        ", heir presumptive of France during the second Empire.       Giustina Pecori-Suárez was the daughter of Bernard Pecori . She was first married to the Italian Marquess Luigi Bartolini-Baldelli. In her second marriage, she became the third wife of ": null
    },
    {
        "Jérôme Bonaparte": "jérôme bonaparte"
    },
    {
        ", youngest brother of Emperor ": null
    },
    {
        "Napoleon I": "napoleon"
    },
    {
        ". They married first in a religious ceremony in Florence in 42 and a second time in a secret civil ceremony on February 42 42 in Paris, ": null
    },
    {
        "France": "second french empire"
    },
    {
        ". Her spouse was the heir presumptive to the throne of France of his nephew Napoleon III during their marriage, placing her in a position to become the next Empress of France.     At the time of her second marriage, she was a rich widow and Jerome heavily indebted, and the marriage enabled him to pay his debts and continued his luxurious lifestyle in Florence. It was a morganatic marriage upon the request of Jerome, who did not wish to recognize her officially and insisted upon calling her Madame la Marquise and have her referred to as such by others. Baron du Casse described her as beautiful, distinguished, sweet and interested in charity, but also as indolent and languid in her habits. She followed Jerome to France in 42 and resided with him in Paris with his son. Despite attempts to do so, she did not succeed in being officially recognized. Her step-son, Prince Napoleon, reportedly disliked her and alienated her from her spouse, who also took a mistress. Her stepson and the Corsican steward of Jerome, Pietra-Santa, accused her of an intrigue with the illegitimate son of Jerome, Jerome David. On this occasion, Jerome did not believe the story and had Pietra-Santa fired. In 42 Jerome was again made Imperial Prince and heir presumptive after his nephew Napoleon III had become emperor. After this, however, he exiled Giustina back to Florence by accusing her of adultery referring to the previous mentioned story. He did, however, repaid her the money she had spent on him in Florence, and purchased a ": null
    },
    {
        "palazzo": "palazzo"
    }
]