[
    {
        "   In ": null
    },
    {
        "Norse cosmology": "norse cosmology"
    },
    {
        ", Jötunheimr  is a location associated with the ": null
    },
    {
        "Jötnar": "jötunn"
    },
    {
        ", entities in ": null
    },
    {
        "Norse mythology": "norse mythology"
    },
    {
        ".       From Jötunheimr, the giants menace the humans in ": null
    },
    {
        "Midgard": "midgard"
    },
    {
        " and the gods in ": null
    },
    {
        "Asgard": "asgard"
    },
    {
        ". The river ": null
    },
    {
        "Ifing": "ifing"
    },
    {
        "  separates Asgard, the realm of the gods, from Jötunheimr, the land of giants. ": null
    },
    {
        "Gastropnir": "gastropnir"
    },
    {
        ", the protection wall for the home of Menglad, and ": null
    },
    {
        "Þrymheimr": "þrymheimr"
    },
    {
        ", home of ": null
    },
    {
        "Þjazi": "þjazi"
    },
    {
        ", were both located in Jötunheimr, which was ruled by King ": null
    },
    {
        "Thrym": "thrym"
    },
    {
        ". ": null
    },
    {
        "Glæsisvellir": "glæsisvellir"
    },
    {
        " was a location in Jötunheimr, where lived the giant ": null
    },
    {
        "Gudmund": "gudmund"
    },
    {
        ", father of ": null
    },
    {
        "Höfund": "höfund"
    },
    {
        ". ": null
    },
    {
        "Utgard": "útgarðar"
    },
    {
        " was a stronghold surrounding the land of the giants,  but in Nordic languages, “Jötunheimr” is also simply a name for the realm of giants .          ": null
    },
    {
        "Gastropnir": "gastropnir"
    },
    {
        " , lover of the human ": null
    },
    {
        "Svipdagr": "svipdagr"
    },
    {
        ".              Located under the second root of the world tree ": null
    },
    {
        "Yggdrasil": "yggdrasil"
    },
    {
        " in Jötunheim, guarded by the jötunn ": null
    },
    {
        "Mímir": "mímir"
    },
    {
        ". The well is the source of Mímirs wisdom. ": null
    },
    {
        "Odin": "odin"
    },
    {
        ", wanting to possess great wisdom, journeys through the land of the giants to acquire it.         Often anglicized as Thrymheim, it was the home of the jötunn Þjazi . Þjazi once tricked ": null
    },
    {
        "Loki": "loki"
    },
    {
        " into aiding him on kidnapping ": null
    },
    {
        "Iðunn": "iðunn"
    },
    {
        ", the ": null
    },
    {
        "goddess": "aesir"
    },
    {
        " who grants magic apples of youth to gods. This act would be the cause of Þjazis death.     ": null
    },
    {
        "Útgarðar": "útgarðar"
    },
    {
        " Utgardoften anglicized as ThrymEds.1973often anglicized as Utgard-Lokianglicized as ThialfiLogi, Old Norse flame Hugi, Old Norse thought resulting in ": null
    },
    {
        "tides": "tide"
    },
    {
        " Elli, Old Norse old age ": null
    },
    {
        " .": "."
    },
    {
        "         Unlike the Greek gods, the gods of Norse mythology were prone to aging. One day, the jötnar Þjazi, disguised as an eagle, swooped down and tricked Loki into bringing him Iðunn, the goddess who supplied magic apples to the gods and goddesses to stay young, in exchange for his life. Fearful of what the ancient giant would do to him, Loki agreed to the bargain.     As soon as Loki reached Asgard, he went straight to the orchard tended by Iðunn and her husband, ": null
    },
    {
        "Bragi": "bragi"
    },
    {
        ". He spun a lie of having found some apples in Midgard that looked the same as hers. Urging her to bring her own basket of apples to compare the two fruits, they departed for the world. When they crossed ": null
    },
    {
        "Bifrost": "bifrost"
    },
    {
        ", Þjazi swooped down and carried Iðunn away. The giant had locked her up in the highest tower in Þrymheimr. The gods and goddesses started aging. Summoning a meeting where every god was present except for Loki, the gods knew that Loki was up to no good. Upon finding the trickster god, he was ordered by Odin to bring back Iðunn and her apples or his life would be forfeited.     Fleeing in terror, Loki sought out Freyja to borrow her suit of falcon feathers. Loki flew to Þrymheimr, where he found Iðunn alone and unguarded. Loki turned the goddess and her basket of apples into a nut and held her in his claws. At this time, Þjazi, in his eagle disguise, was following them. Odin, who saw everything, immediately ordered the gods to build a bonfire at the gates of Asgard. When Þjazi reached the walls, his body caught on fire, and he fell to the ground. The gods slew him with no mercy. Releasing Iðunn from the spell, the gods and goddesses were once again youthful.         Mimir was an ancient being, notorious for his unparalleled wisdom. His dwelling was ": null
    },
    {
        "Mímisbrunnr": "mímisbrunnr"
    },
    {
        " , a sacred well situated under one of the roots of the tree Yggdrasil in Jötunheim": null
    }
]