[
    {
        "Kim Eric Drexler is an American engineer best known for seminal studies of the potential of ": null
    },
    {
        "molecular nanotechnology": "Molecular Nanotechnology"
    },
    {
        " , from the 1970s and 1980s. His 1991 doctoral thesis at ": null
    },
    {
        "Massachusetts Institute of Technology": "Massachusetts Institute Of Technology"
    },
    {
        " was revised and published as the book Nanosystems: Molecular Machinery Manufacturing and Computation , which received the ": null
    },
    {
        "Association of American Publishers": "Association Of American Publishers"
    },
    {
        " award for Best Computer Science Book of 1992.         K. Eric Drexler was strongly influenced by ideas on ": null
    },
    {
        "Limits to Growth": "Limits To Growth"
    },
    {
        " in the early 1970s. During his first year at ": null
    },
    {
        "Massachusetts Institute of Technology": "Massachusetts Institute Of Technology"
    },
    {
        ", he sought out someone who was working on extraterrestrial resources. He found ": null
    },
    {
        "Gerard K. ONeill": "Gerard K. Oneill"
    },
    {
        " of ": null
    },
    {
        "Princeton University": "Princeton University"
    },
    {
        ", a physicist famous for his work on ": null
    },
    {
        "storage rings": "Storage Ring"
    },
    {
        "for ": null
    },
    {
        "particle accelerators": "Particle Accelerator"
    },
    {
        "and his landmark work on the concepts of ": null
    },
    {
        "space colonization": "Space Colonization"
    },
    {
        ". Drexler participated in NASA summer studies on space colonies in 1975 and 1976. He fabricated metal films a few tens of nanometers thick on a wax support to demonstrate the potentials of high performance ": null
    },
    {
        "solar sails": "Solar Sails"
    },
    {
        ". He was active in space politics, helping the ": null
    },
    {
        "L5 Society": "L5 Society"
    },
    {
        " defeat the ": null
    },
    {
        "Moon Treaty": "Moon Treaty"
    },
    {
        " in 1980. Besides working summers for ONeill, building ": null
    },
    {
        "mass driver": "Mass Driver"
    },
    {
        " prototypes, Drexler delivered papers at the first three Space Manufacturing conferences at Princeton. The 1977 and 1979 papers were co-authored with ": null
    },
    {
        "Keith Henson": "Keith Henson"
    },
    {
        ", and patents were issued on both subjects, vapor phase fabrication and space radiators.     During the late 1970s, Drexler began to develop ideas about ": null
    },
    {
        "molecular nanotechnology": "Molecular Nanotechnology"
    },
    {
        " . In 1979, he encountered ": null
    },
    {
        "Richard Feynmans": "Richard Feynman"
    },
    {
        "provocative 1959 talk ": null
    },
    {
        "Theres Plenty of Room at the Bottom": "Theres Plenty Of Room At The Bottom"
    },
    {
        ". In 1981, Drexler wrote a seminal research article, published by ": null
    },
    {
        "PNAS": "Pnas"
    },
    {
        ", Molecular engineering: An approach to the development of general capabilities for molecular manipulation .  This article has continued to be cited, more than 620 times, during the following 35 years.      The term ": null
    },
    {
        "nano-technology": "Nanotechnology"
    },
    {
        " had been coined by the Tokyo Science University professor ": null
    },
    {
        "Norio Taniguchi": "Norio Taniguchi"
    },
    {
        " in 1974 to describe the precision manufacture of materials with nanometer tolerances, and Drexler unknowingly used a related term in his 1986 book  Engines of Creation: The Coming Era of Nanotechnology  to describe what later became known as ": null
    },
    {
        "molecular nanotechnology": "Molecular Nanotechnology"
    },
    {
        " . In that book, he proposed the idea of a nanoscale assembler which would be able to build a copy of itself and of other items of arbitrary complexity. He also first published the term ": null
    },
    {
        "grey goo": "Grey Goo"
    },
    {
        " to describe what might happen if a hypothetical self-replicating molecular nanotechnology went out of control. He has subsequently tried to clarify his concerns about out-of-control self-replicators, and make the case that molecular manufacturing does not require such devices.      He is currently a research fellow at the ": null
    },
    {
        "Future of Humanity Institute": "Future Of Humanity Institute"
    },
    {
        " where his focus is on superintelligence.          Drexler holds three degrees from ": null
    },
    {
        "MIT": "Mit"
    },
    {
        ". He received his ": null
    },
    {
        "B.S.": "Bachelor Of Science"
    },
    {
        " in Interdisciplinary Sciences in 1977 and his ": null
    },
    {
        "M.S.": "M.S."
    },
    {
        " in 1979 in ": null
    },
    {
        "Astro/Aerospace Engineering": "Aerospace Engineering"
    },
    {
        " with a Masters thesis titled Design of a High Performance Solar Sail System. In 1991, he earned a ": null
    },
    {
        "Ph.D.": "Doctorate"
    },
    {
        " through the ": null
    },
    {
        "MIT Media Lab": "Mit Media Lab"
    },
    {
        " after the department of electrical engineering and computer science refused to approve Drexlers plan of study.      His Ph.D. work was the first doctoral degree on the topic of molecular nanotechnology and his thesis, Molecular Machinery and Manufacturing with Applications to Computation, was published as Nanosystems: Molecular Machinery, Manufacturing and Computation , which received the Association of American Publishers award for Best Computer Science Book of 1992.         Drexler was married to Christine Peterson for 21 years. The marriage ended in 2002.     In 2006, Drexler married Rosa Wang, a former investment banker who works with ": null
    },
    {
        "Ashoka: Innovators for the Public": "Ashoka: Innovators For The Public"
    },
    {
        " on improving the social capital markets.            Drexlers work on nanotechnology was criticized as naive by Nobel Prize winner ": null
    },
    {
        "Richard Smalley": "Richard Smalley"
    },
    {
        " in a 2001  Scientific American  article. Smalley first argued that fat fingers made MNT impossible. He later argued that nanomachines would have to resemble chemical enzymes more than Drexlers assemblers and could only work in water. Drexler maintained that both were ": null
    },
    {
        "straw man": "Straw Man"
    },
    {
        " arguments, and in the case of enzymes, wrote that Prof. Klibanov wrote in 1994, ... using an enzyme in organic solvents eliminates several obstacles  ...  Drexler had difficulty in getting Smalley to respond, but in December 2003, Chemical and Engineering news carried a four-part debate.  ": null
    },
    {
        "Ray Kurzweil": "Ray Kurzweil"
    },
    {
        " disputes Smalleys arguments. Ray Kurzweil, The Singularity Is Near, 2005     The ": null
    },
    {
        "National Academies of Sciences, Engineering, and Medicine": "National Academies Of Sciences, Engineering, And Medicine"
    },
    {
        ", in its 2006 review of the ": null
    },
    {
        "National Nanotechnology Initiative": "National Nanotechnology Initiative"
    },
    {
        ", argues that it is difficult to predict the future capabilities of nanotechnology:             Drexler is mentioned in ": null
    },
    {
        "Neal Stephensons": "Neal Stephenson"
    },
    {
        " science fiction": "Science Fiction"
    },
    {
        " novel  The Diamond Age  as one of the heroes of a future world where nanotechnology is ubiquitous.      In the science fiction novel  Newtons Wake  by ": null
    },
    {
        "Ken MacLeod": "Ken Macleod"
    },
    {
        ", a drexler is a nanotech assembler of pretty much anything that can fit in the volume of the particular machine—from socks to starships.      Drexler is also mentioned in the science fiction book  Decipher  by ": null
    },
    {
        "Stel Pavlou": "Stel Pavlou"
    },
    {
        "; his book is mentioned as one of the starting points of the nanomachine construction, as well as giving a better understanding of the way ": null
    },
    {
        "carbon 60": "Fullerene"
    },
    {
        " was to be applied.      ": null
    },
    {
        "James Rollins": "James Rollins"
    },
    {
        " references Drexlers Engines of Creation in his novel Excavation, using his theory of a molecular machine in two sections as a possible explanation for the mysterious Substance Z in the story.      Drexler gets a mention in the ": null
    },
    {
        "Timothy Learys": "Timothy Leary"
    },
    {
        "  Design for Dying  in the Mutation section, briefly detailing the ": null
    },
    {
        "8-circuit model of consciousness": "8-Circuit Model Of Consciousness"
    },
    {
        " .      Drexler is mentioned in ": null
    },
    {
        "Doom Patrol": "Doom Patrol"
    },
    {
        " 57.      Drexler is mentioned in Michael Crichtons novel Prey in the introduction .      The Drexler Facility  of molecular nanotechnology research in ": null
    },
    {
        "Baldr Sky": "Baldr Sky"
    },
    {
        " is named after him. The Assemblers is its key invention.         Engines of Creation    Available    1991; with ": null
    },
    {
        "Christine Peterson": "Christine Peterson"
    },
    {
        " and Gayle Pergamit 1992  February 2007": null
    }
]