[
    {
        "   Kahai  is a handsome ": null
    },
    {
        "Polynesian": "polynesian mythology"
    },
    {
        " demigod": "demigod"
    },
    {
        " whose exploits were popular in many Polynesian mythologies.       In ": null
    },
    {
        "Hawaiian mythology": "hawaiian mythology"
    },
    {
        ", according to the ": null
    },
    {
        "Kumulipo": "kumulipo"
    },
    {
        " he is known as Kahainuiahema and according to Tregear, the legends about Kaha’i are extremely fragmentary and vague, but they indicate that Hema traveled to Kahiki  to receive a tribute called palala for the birth of his son Kaha’i. There he was captured by the Aiaia , died, and was buried in Ulu-paupau. Kaha’i decided to go and avenge his father. A rainbow was the path over which he and his brother ‘Alihi ascended into the skies, where they asked Kane and Kanaloa where Hemas remains were to be found.     :Sources:   : E.R. Tregear, Maori-Polynesian Comparative Dictionary, , 42       In the ": null
    },
    {
        "Tuamotuan": "tuamotus"
    },
    {
        " version of the myth, Tahaki and ": null
    },
    {
        "Karihi": "karihi-nui"
    },
    {
        " are twins, but only Tahaki has magical powers. Tahakis father, Hema, trespassed on lands belonging to the goblins of Matuauru in order to go crabbing. They captured him and took him prisoner, and Tahaki and Karihi begin a quest to rescue him. En route, Karihi accidentally gets snared on the fishing line of their blind grandmother, Kuhi. Tahaki throws coconuts at the old woman and when they hit her, her sight is miraculously restored. Tahaki again sets out to save his father, whom he finds in a pit on ": null
    },
    {
        "Matuaru": "matuaru"
    },
    {
        " and rescues. He then proceeds to Hiva-nui, the land of the goblins, with a strong net called ": null
    },
    {
        "Tukutuhuraho-nui": "tukutuhuraho-nui"
    },
    {
        " . Ensnaring the goblins, he beats them to death. While returning home via the land of the fish, he gives his dark skin to the ": null
    },
    {
        "Hami-kere": "hami-kere"
    },
    {
        " fish. After his death, Tahaki goes to the sacred sky of ": null
    },
    {
        "Kane": "kāne"
    },
    {
        ", where it is set apart to rule over ": null
    },
    {
        "Havaiki-nui": "havaiki-nui"
    },
    {
        ".     :Sources:   :R.D. Craig, Dictionary of Polynesian Mythology , 4242   :J.F. Stimson, Tuamotuan Legends: Island of Anaa , 4242       In a legend from ": null
    },
    {
        "Mangareva": "mangareva"
    },
    {
        ", Tahaki is famous for his reddish skin. During a diving competition off the inner reef, his enemies make Tahaki dive last. As each person dives down, he changes temporarily into a fish and waits below. When at last Tahaki dives, all the fish swarm in, each removing a piece of his beautiful skin. When Tahaki reappears, he is naked. But luckily for him his grandmother is nearby. No sooner does a fish bite off a piece of skin, than the grandmother takes it out of the fishs mouth and puts it in her basket. Then she goes back to the underworld, taking with her all of Tahakis skin. Later, the nude Tahaki and his cousin Karihi go down to the underworld, where his grandmother returns each piece of skin to its rightful place. However, some stick insects have helped themselves to pieces of the skin, using it to beautify their armpits. They will not give it back, but the grandmother tells Tahaki not to worry about it, because they only have the skin from the soles of his feet, and no one will notice. So it is that Mangarevan stick insects have red under their arms.     :Sources:   : T. R. Hiroa , Vikings of the Sunrise, New Zealand Edition, Reprinted 42 42 42       In the Samoan version of the legend, Tafai, his brother Alise, and his sister Ifiifi are the children of Pua and ": null
    },
    {
        "Sigano": "sigano"
    },
    {
        ". Their servant Lauamatoto ascends to heaven in order to find a bride suitable for Tafai. He convinces the goddess Sina-tae-o-i-lagi, daughter of Tagaloa-lagi, to give an audience to the Tafai and his brother, who disguise themselves as ugly old men in order to reach her court safely. Because of their appearance, the goddess rejects them. The next day when they are about to leave, she sees their true appearance and is distraught and chases after them. Tafai threw Sina into a pit, from which she is rescued by his parents, who bring her to live with them. Eventually, Tafai falls in love with her, but she escapes to her home in heaven. Her family convince her to return to earth and marry Tafai, to whom she bears La, the sun, who goes to live with her mother in the sky.     :Sources:   :R.D. Craig, Dictionary of Polynesian Mythology , 42   :A. Kramer, The Samoa Islands , 42   :E.R. Tregear, Maori-Polynesian Comparative Dictionary": null
    }
]