[
    {
        "      Kakinomoto no Hitomaro  was a Japanese  waka  poet and aristocrat of the late ": null
    },
    {
        "Asuka period": "asuka period"
    },
    {
        ". He was the most prominent of the poets included in the  Manyōshū , the oldest waka anthology, but apart from what can be gleaned from hints in the Manyōshū, the details of his life are largely uncertain. He was born to the ": null
    },
    {
        "Kakinomoto clan": "kakinomoto clan"
    },
    {
        ", based in ": null
    },
    {
        "Yamato Province": "yamato province"
    },
    {
        ", probably in the 650s, and likely died in ": null
    },
    {
        "Iwami Province": "iwami province"
    },
    {
        " around 709.     He served as court poet to ": null
    },
    {
        "Empress Jitō": "empress jitō"
    },
    {
        ", creating many works praising the imperial family, and is best remembered for his ": null
    },
    {
        "elegies": "elegy"
    },
    {
        " for various imperial princes. He also composed well-regarded travel poems.     He is ranked as one of the ": null
    },
    {
        "Thirty-six Poetry Immortals": "thirty-six poetry immortals"
    },
    {
        ". ": null
    },
    {
        "Ōtomo no Yakamochi": "ōtomo no yakamochi"
    },
    {
        ", the presumed compiler of the Manyōshū, and ": null
    },
    {
        "Ki no Tsurayuki": "ki no tsurayuki"
    },
    {
        ", the principal compiler of the  Kokin Wakashū , praised Hitomaro as Sanshi no Mon and Uta no Hijiri respectively. From the ": null
    },
    {
        "Heian period": "heian period"
    },
    {
        " on, he was often called Hito-maru . He has come to be revered as a god of poetry and scholarship, and is considered one of the four greatest poets in Japanese history, along with ": null
    },
    {
        "Fujiwara no Teika": "fujiwara no teika"
    },
    {
        ", ": null
    },
    {
        "Sōgi": "sōgi"
    },
    {
        " and ": null
    },
    {
        "Bashō": "bashō"
    },
    {
        ".         The sole early source for the life of the poet Kakinomoto no Hitomaro is the  Manyōshū . His name does not appear in any of the official court documents, perhaps on account of his low rank.          Hitomaro was born into the ": null
    },
    {
        "Kakinomoto clan": "kakinomoto clan"
    },
    {
        ", an offshoot of the ancient . Centred in the northeastern part of the ": null
    },
    {
        "Nara Basin": "nara basin"
    },
    {
        ", the Wani clan had furnished many imperial consorts in the fourth through sixth centuries, and extended their influence from ": null
    },
    {
        "Yamato Province": "yamato province"
    },
    {
        " to ": null
    },
    {
        "Yamashiro": "yamashiro province"
    },
    {
        ", ": null
    },
    {
        "Ōmi": "ōmi province"
    },
    {
        ", ": null
    },
    {
        "Tanba": "tanba province"
    },
    {
        " and ": null
    },
    {
        "Harima": "harima province"
    },
    {
        " provinces. Many of their clan traditions are preserved in the  Nihon Shoki  and, especially, the Kojiki. The Kakinomoto clan were headquartered in either ": null
    },
    {
        "Shinjō, Nara": "shinjō, nara"
    },
    {
        " or, perhaps more likely, the Ichinomoto area of ": null
    },
    {
        "Tenri, Nara": "tenri, nara"
    },
    {
        ". The main Wani clan were also based in this area, so the Kakinomoto clan may have had a particularly close relationship with their parent clan. According to the  Shinsen Shōjiroku , the clans name derives from the ": null
    },
    {
        "persimmon": "persimmon"
    },
    {
        "  tree that grew on their land during the reign of ": null
    },
    {
        "Emperor Bidatsu": "emperor bidatsu"
    },
    {
        ".     The Kakinomoto clan had their ": null
    },
    {
        "hereditary title": "list of japanese court ranks, positions and hereditary titleshereditary titles"
    },
    {
        " promoted from ": null
    },
    {
        "Omi": "omi"
    },
    {
        " to ": null
    },
    {
        "Ason": "ason"
    },
    {
        " in the eleventh month  of 684. According to the Nihon Shoki, ": null
    },
    {
        "Kakinomoto no Saru": "kakinomoto no saru"
    },
    {
        ", the probable head of the clan, had been among ten people appointed , equivalent to ": null
    },
    {
        "Junior Fifth Rank": "list of japanese court ranks, positions and hereditary titlesfifth rank"
    },
    {
        ", in the twelfth month of 681. These facts lead Watase to conjecture that the Kakinomoto clan may have had some literary success in the court of Emperor Tenmu. According to the  Shoku Nihongi , Saru died in 708, having attained the ": null
    },
    {
        "Junior Fourth Rank, Lower Grade": "list of japanese court ranks, positions and hereditary titlesfourth rank"
    },
    {
        ".     There are several theories regarding the relationship of this Kakinomoto no Saru to the poet Hitomaro, including the former being the latters father, brother, uncle, or them being the same person. The theory that they were the same person has been advanced by ": null
    },
    {
        "Takeshi Umehara": "takeshi umehara"
    },
    {
        ", but has little supporting evidence. While the other theories cannot be confirmed, it is certain that they were members of the same clan , and were active at the same time. It is likely that their mutual activity at court had a significant effect on each other.       The year in which he was born is not known, nor can much be said with certainty about any aspects of his life beyond his poetic activities. Watase tentatively takes Hitomaro as being 21 years old  between 673 and 675, which would put his birth between 653 and 655.       The earliest dated work attributed to him in the Manyōshū is his ": null
    },
    {
        "Tanabata": "tanabata"
    },
    {
        " poem  composed in the ninth year of ": null
    },
    {
        "Emperor Tenmus": "emperor tenmu"
    },
    {
        "reign . The content of this poem reveals an awareness of the mythology that, according to the preface to the Kojiki had begun to be compiled during Tenmus reign. Watase also observes that Hitomaros having composed a Tanabata poem means that he was probably attending Tanabata gatherings during this period. A significant number of poems in the  Kakinomoto no Ason Hitomaro Kashū  were apparently recorded by Hitomaro before 690, and are characteristic of court poetry, leading to the conclusion that he was active at court from the early part of Emperor Tenmus reign. From this point he was active in recording and composing love poems at court.     Watase speculates that Hitomaro came to court in the service of the  in response to an imperial edict in 673.     Based on Hitomaros poetic activities during ": null
    },
    {
        "Empress Jitōs": "empress jitō"
    },
    {
        "reign, there are a few possibilities for where Hitomaro was serving at Tenmus court. Watase presents three principal theories: first under the empress-consort Princess Uno-no-sarara ; second under ": null
    },
    {
        "Crown Prince Kusakabe": "crown prince kusakabe"
    },
    {
        "; third in the palace of ": null
    },
    {
        "Prince Osakabe": "prince osakabe"
    },
    {
        ".          Hitomaro acted as a court poet during the reigns of Empress Jitō and ": null
    },
    {
        "Emperor Monmu": "emperor monmu"
    },
    {
        ". In the fourth month of 689, Prince Kusakabe died, and Hitomaro composed an elegy commemorating the prince. He also composed an elegy for ": null
    },
    {
        "Princess Asuka": "princess asuka"
    },
    {
        ", who died in the fourth month of 700, and a poem commemorating an imperial visit to ": null
    },
    {
        "Kii Province": "kii province"
    },
    {
        ".     His poetic composition flourished during the period in which Empress Jitō was active . He composed poetry for numerous members of the imperial family, including the empress, Prince Kusakabe, ": null
    },
    {
        "Prince Karu": "emperor monmu"
    },
    {
        ", ": null
    },
    {
        "Prince Takechi": "prince takechi"
    },
    {
        ", Prince Osakabe, ": null
    },
    {
        "Prince Naga": "prince naga"
    },
    {
        ", ": null
    },
    {
        "Prince Yuge": "prince yuge"
    },
    {
        ", ": null
    },
    {
        "Prince Toneri": "prince toneri"
    },
    {
        ", , ": null
    },
    {
        "Princess Hatsusebe": "princess hatsusebe"
    },
    {
        " and ": null
    },
    {
        "Princess Asuka": "princess asuka"
    },
    {
        ". He apparently composed poetry in ": null
    },
    {
        "Yamato Province": "yamato province"
    },
    {
        " , ": null
    },
    {
        "Yamashiro Province": "yamashiro province"
    },
    {
        " and ": null
    },
    {
        "Ōmi Province": "ōmi province"
    },
    {
        " in the north, Kii Province in the south, ": null
    },
    {
        "Shikoku": "shikoku"
    },
    {
        ", ": null
    },
    {
        "Kyūshū": "kyūshū"
    },
    {
        " and the ": null
    },
    {
        "Seto Inland Sea": "seto inland sea"
    },
    {
        " in the west, as well as ": null
    },
    {
        "Iwami Province": "iwami province"
    },
    {
        " in the northwest.     ": null
    },
    {
        "Susumu Nakanishi": "susumu nakanishi"
    },
    {
        " remarks that the fact that he did not apparently compose elegies for emperors themselves, and that most of his poems centre around princes and princesses, indicates that he was probably a writer affiliated with the literary circles that formed around these junior members of the imperial family.       The ordering of poems, and their headnotes, in volume 2 of the Manyōshū, implies that Hitomaro died shortly before the moving of the capital to ": null
    },
    {
        "Nara": "nara, nara"
    },
    {
        " in 710. He would have been in Iwami Province, at the ": null
    },
    {
        "Sixth Rank": "list of japanese court ranks, positions and hereditary titlessixth rank"
    },
    {
        " or lower.     The date, site and manner of his death are a matter of scholarly debate, due to some contradictory details that are gleaned from poems attributed to Hitomaro and his wife . Taking Watases rough dates, he would have been in his mid-fifties in 709, when Watase speculates he died. ": null
    },
    {
        "Mokichi Saitō": "mokichi saitō"
    },
    {
        " postulated that Hitomaro died in an epidemic that swept Iwami and ": null
    },
    {
        "Izumo": "izumo province"
    },
    {
        " provinces in 707. Hitomaros final poem gives the strong impression that he met his death in the mountains.          Saitō was convinced he had located the site of the Kamoyama of the above poem and erected a monument there, but two poems by Yosami that immediately follow the above in the Manyōshū suggest otherwise, as they mention shells  and a Stone River , neither of which seem likely in the context of Saitōs Kamoyama.        The above-quoted translation is based on Saitōs interpretation of kai as referring to a ravine . Other scholars take the presence of shells as meaning Hitomaro died near the mouth of a river where it meets the sea.        There is no river named Ishikawa near the present Kamoyama; Saitō explained this as Ishikawa perhaps being an archaic name for upper part of another river.     An unknown member of the ": null
    },
    {
        "Tajihi clan": "tajihi clan"
    },
    {
        " wrote a response to Yosami in the persona of Hitomaro, very clearly connecting Hitomaros death to the sea.               Hitomaro was a court poet during the reigns of Empress Jitō and Emperor Monmu, with most of his dateable poems coming from the last decade or so of the seventh century. He apparently left a ": null
    },
    {
        "private collection": "kashū"
    },
    {
        ", the so-called  Kakinomoto no Ason Hitomaro Kashū , which does not survive as an independent work but was cited extensively by the compilers of the Manyōshū.     18  chōka  and 67  tanka   are directly attributed to him in the Manyōshū. All are located in the first four books of the collection. Of these, six chōka and 29 tanka are classified as  zōka  , three chōka and 13 tanka as  sōmon  , and nine chōka and 25 tanka as  banka  . Of note is the fact that he contributed chōka to all three categories, and that he composed so many banka.     Broken down by topic, the above poems include:   three chōka and five tanka about reigning emperors, such as hymns praising Empress Jitōs visits to Yoshino and , and poems lamenting the fallen Ōmi capital; chōka and 17 tanka about imperial princes and princesses such as his elegies for Prince Kusakabe, Prince Takechi, Princess Asuka and  and his songs of praise for Prince Karu, Prince Osakabe, ": null
    },
    {
        "Prince Naga": "prince naga"
    },
    {
        " and Prince Niitabe; chōka and 28 tanka about court women, including the three tanka he composed on the court women accompanying Empress Jitō on her visit to Ise while he stayed in the capital, one chōka and eight tanka mourning ": null
    },
    {
        "Kibitsu no Uneme": "kibitsu no uneme"
    },
    {
        ", ": null
    },
    {
        "Hijikata no Otome": "hijikata no otome"
    },
    {
        " and ": null
    },
    {
        "Izumo no Otome": "izumo no otome"
    },
    {
        ", and a number of romantic exchanges with his wife and other lovers; chōka and three tanka commemorating the bodies of dead people Hitomaro encountered; tanka composed on travel topics that do not fit into any of the above categories .   From the above it can be said that Hitomaros poetry was primarily about affairs of the court, but that he also showed a marked preference for poems on travel.        In addition to the 85 poems directly attributed to Hitomaro by the Manyōshū, two chōka and three tanka in books 3 and 9 are said to be traditionally attributed to Hitomaro. Additionally, there is one Hitomaro tanka in book 15 said to have been recited in 736 by an envoy sent to ": null
    },
    {
        "Silla": "silla"
    },
    {
        ". Including these traditional Hitomaro poems, that gives 20 chōka and 71 tanka. It is quite possible that a significant number of these poems were incorrectly attributed to Hitomaro by tradition. In addition to Hitomaros own compositions, there are also many poems said to have been recorded by him in his ": null
    },
    {
        "personal collection": "kashū"
    },
    {
        ", the  Kakinomoto no Asomi Hitomaro Kashū  . The Hitomaro Kashū included 333 tanka, 35  sedōka , and two chōka. This adds up to a total figure of close to 500 poems directly associated with Hitomaro.       Hitomaro is known for his solemn and mournful elegies of members of the imperial family, whom he described in his courtly poems as gods and children of the sun . He incorporated elements of the ": null
    },
    {
        "national mythology": "japanese mythology"
    },
    {
        " seen in the Kojiki and Nihon Shoki and historical narrative in his poetry. While he is known for his poems praising the imperial family, his poetry is also filled with human sensitivity and a new, fresh folkiness .     His lament for the Ōmi capital is noted for its vivid, sentimental descriptions of the ruins, while his elegy for Prince Takechi powerfully evokes the ": null
    },
    {
        "Jinshin War": "jinshin war"
    },
    {
        ". His Yoshino and  poems praise splendidly the natural scenery and the divinity of the Japanese islands, and his Iwami exchange vividly describes the powerful emotions of being separated from the woman he loved. His romantic poems convey honest emotions, and his travel poems exquisitely describe the mood of the courtiers on these trips. He shed tears for the deaths of even random commoners on country paths and court women whose names he did not even know.     Watase credits him with the creation of an ancient ": null
    },
    {
        "lyricism": "lyricism"
    },
    {
        " that expressed both human sentiment and sincere emotions across both his poems of praise and mourning.          There is evidence that Hitomaro exerted direct influence on the poetry composed during his own time. For example, poems 171 through 193 of Book 1 of the Manyōshū bear similarities to his work. It is generally accepted that the court poets of the following generation , including ": null
    },
    {
        "Yamabe no Akahito": "yamabe no akahito"
    },
    {
        ", were influenced by Hitomaros courtly poems. ": null
    },
    {
        "Ōtomo no Yakamochi": "ōtomo no yakamochi"
    },
    {
        ", a poet of the fourth period who probably had a hand in the final compilation of the collection, held Hitomaro in high regard, praising him as Sanshi no Mon . As discussed ": null
    },
    {
        "above": "later life and death"
    },
    {
        ", the death of Hitomaro appears to have already taken on some legendary characteristics.     In his ": null
    },
    {
        "Japanese preface": "kokinshū kana-jo"
    },
    {
        " to the tenth-century  Kokin Wakashū , ": null
    },
    {
        "Ki no Tsurayuki": "ki no tsurayuki"
    },
    {
        " referred to Hitomaro as Uta no Hijiri . In the ": null
    },
    {
        "Heian period": "heian period"
    },
    {
        " the practice of ": null
    },
    {
        "Hitomaru-eigu": "hitomaru-eigu"
    },
    {
        "  also gained currency, showing that Hitomaro had already begun to be apotheosized. Hitomaros divinity status continued to grow in the ": null
    },
    {
        "Kamakura": "kamakura period"
    },
    {
        " and ": null
    },
    {
        "Muromachi period": "muromachi period"
    },
    {
        "s. The ": null
    },
    {
        "Edo period": "edo period"
    },
    {
        " scholars ": null
    },
    {
        "Keichū": "keichū"
    },
    {
        " and ": null
    },
    {
        "Kamo no Mabuchi": "kamo no mabuchi"
    },
    {
        " tended to reject the various legends about Hitomaro.        In ": null
    },
    {
        "Akashi": "akashi, hyōgo"
    },
    {
        ", ": null
    },
    {
        "Hyōgo Prefecture": "hyōgo prefecture"
    },
    {
        " there is a ": null
    },
    {
        "Kakinomoto Shrine": "kakinomoto shrine"
    },
    {
        " dedicated to him, commemorating an early Heian belief that Hitomaros spirit came to rest in Akashi, an area the historical Hitomaro probably visited multiple times.     Hitomaro is today ranked, along with ": null
    },
    {
        "Fujiwara no Teika": "fujiwara no teika"
    },
    {
        ", ": null
    },
    {
        "Sōgi": "sōgi"
    },
    {
        " and ": null
    },
    {
        "Bashō": "bashō"
    },
    {
        ", as one of the four greatest poets in Japanese history.          ": null
    }
]