[
    {
        "     Kalimantaan is a novel by ": null
    },
    {
        "C. S. Godshalk": "c. s. godshalk"
    },
    {
        " offering a fictionalized account of the exploits of ": null
    },
    {
        "James Brooke": "james brooke"
    },
    {
        " in ": null
    },
    {
        "Sarawak": "sarawak"
    },
    {
        " in ": null
    },
    {
        "Borneo": "borneo"
    },
    {
        ".       The novel uses of a variety of writing forms, including ": null
    },
    {
        "diary": "diary"
    },
    {
        " entries, ": null
    },
    {
        "letter": "letter"
    },
    {
        "s, and straight ": null
    },
    {
        "narrative": "literary technique"
    },
    {
        " to tell its story. The author intentionally makes it difficult to determine what really happens in the story from dreams and fantasies of the characters.       In 42 an English adventurer arrived on the northwest coast of ": null
    },
    {
        "Borneo": "borneo"
    },
    {
        ", commissioned to deliver a letter of gratitude to the ": null
    },
    {
        "Sultan of Brunei": "sultan of brunei"
    },
    {
        " for having safely returned the crew of a British ": null
    },
    {
        "merchantman": "cargo ship"
    },
    {
        ", lost on his coast. It was a region full of ": null
    },
    {
        "headhunter": "headhunting"
    },
    {
        "s, ": null
    },
    {
        "pirate": "pirate"
    },
    {
        " tribes, and ": null
    },
    {
        "slave trade": "slave trade"
    },
    {
        "rs. Most Europeans with the temerity to enter the region had never been heard from again. This particular adventurer, however, seems to know how to play one power against another and manages to keep his balance in the midst of chaos. After performing a service for the Sultan , he is named governor of Sarawak, subject to the Sultan of Brunei. Within a few years, he has become the Rajah of Sarawak, an independent state, and established a dynasty that will last one hundred years.     Godshalk has changed names and details while evoking a sense of the time, place, and atmosphere of the real events. The real adventurer was ": null
    },
    {
        "James Brooke": "james brooke"
    },
    {
        "; Ms. Godshalks is named Gideon Barr. James Brookes schooner was named the Royalist; Gideon Barrs is the Carolina . James Brooke was succeeded by his nephew, ": null
    },
    {
        "Charles Johnson": "charles anthoni johnson brooke"
    },
    {
        ", who took the last name Brooke. Gideon Barr is succeeded by his nephew Richard Hogg .     Although many of the events described actually took place, one cannot simply change the names and read the novel as history. James Brookes mother died in 42 two years after he became Rajah. Gideons mother dies in Borneo much earlier while he is in grade school in England, providing him an emotional link to Borneo James Brooke did not have. James Brooke never married a European, although there is evidence that he was married to a Malay woman. Gideon Barr marries an Englishwoman to provide himself an air of permanence as Rajah and we see much of the later portion of the story through Amelia Barrs eyes. Amelia Barr is fictional, but largely based on ": null
    },
    {
        "Margaret Brooke": "margaret brooke"
    },
    {
        ", wife of the second Rajah, and her book My Life in Sarawak . Gideon also maintains a Malayan mistress who provides a note of tragedy in the way her presence poisons Gideon and Amelias relationship.     On the other hand, the 42 pounds that Brooke/Barr inherited at his fathers death which enabled him to acquire his schooner, the massacre of the sons of the Sultan of Brunei, the Chinese insurrection of 42 and the commission of inquiry in Singapore all took place as described. The inquiry in Singapore was concerned with the battle of Labuan in which Brooke/Barr led British warships in a pre-emptive strike against a pirate fleet, breaking the power of the Bugis for the next twenty years. Brooke/Barrs enemies attempted to use this against him by claiming he had used British naval power to slaughter innocent natives.     Godshalk uses ": null
    },
    {
        "Malay": "malay language"
    },
    {
        " words extensively in the book. While she provides a brief Malay glossary as an appendix, it does not cover all the words she uses. Enjoyment of Kalimantaan will be enhanced if one knows the following Malay words which are not in the glossary provided by the author:      a unit of weight of 42  lb ; 42good mid-day": null
    }
]