[
    {
        "Karl Friedrich Eichhorn was a ": null
    },
    {
        "German": "germany"
    },
    {
        " jurist": "jurist"
    },
    {
        ".     Eichhorn was born in ": null
    },
    {
        "Jena": "jena"
    },
    {
        " as the son of ": null
    },
    {
        "Johann Gottfried Eichhorn": "johann gottfried eichhorn"
    },
    {
        ". He entered the ": null
    },
    {
        "University of Göttingen": "university of göttingen"
    },
    {
        " in 42 In 42 he obtained the professorship of law at ": null
    },
    {
        "Frankfurt ": "viadrina"
    },
    {
        ", holding it till 42 when he accepted the same chair at the new ": null
    },
    {
        "Friedrich Wilhelm University in Berlin": "humboldt university of berlin"
    },
    {
        ". On the ": null
    },
    {
        "call to arms": "sixth coalition"
    },
    {
        " in 42 he became a captain of horse, and received the ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " at the end of the war.     In 42 he was offered the chair of ": null
    },
    {
        "law": "law"
    },
    {
        " at Göttingen, and, preferring it to the Berlin professorship, taught there with great success till ill-health compelled him to resign in 42 His successor in the Berlin chair having died in 42 he again entered on its duties, but resigned two years afterwards. In 42 he also received an appointment in the ministry of foreign affairs, which, with his labours on many state committees and his legal researches and writings, occupied him till his death at ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ".     Eichhorn was regarded as one of the principal authorities on German constitutional law. His chief work is Deutsche Staats- und Rechtsgeschichte . In company with ": null
    },
    {
        "Friedrich Karl von Savigny": "friedrich karl von savigny"
    },
    {
        " and Johann Friedrich Ludwig Göschen he founded the Zeitschrift für geschichtliche Rechtswissenschaft. He was the author besides of Einleitung in des deutsche Privatrecht mit Einschluss des Lehnrechts and the Grundsätze des Kirchenrechts der Katholischen und der Evangelischen Religionspartei in Deutschland, 42 Bde. .       ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " of 42   ": null
    },
    {
        "Pour le Mérite for Arts and Sciences": "pour le mérite for arts and sciences"
    },
    {
        "   Order of the Red Eagle": "order of the red eagle"
    },
    {
        "   Maximilian Order for Science and Art": "bavarian maximilian order for science and art"
    },
    {
        "          ": null
    }
]