[
    {
        "   Karl August von Hase was a German Protestant ": null
    },
    {
        "theologian": "theology"
    },
    {
        " and ": null
    },
    {
        "church historian": "church historian"
    },
    {
        ".       He was born at Steinbach  in ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        ". He studied at ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " and ": null
    },
    {
        "Erlangen": "erlangen"
    },
    {
        ", and in 42 was called to ": null
    },
    {
        "Jena": "jena"
    },
    {
        " as professor of theology. He retired in 42 and was made a baron. He was the great-grandfather of ": null
    },
    {
        "Dietrich Bonhoeffer": "dietrich bonhoeffer"
    },
    {
        ".     Hase’s aim was to reconcile modern culture with historical Christianity in a scientific way. But though a liberal theologian, he was no dry rationalist. Indeed, he vigorously attacked ": null
    },
    {
        "rationalism": "rationalism"
    },
    {
        ", as distinguished from the rational principle, charging it with being unscientific inasmuch as it ignored the historical significance of Christianity, shut its eyes to individuality and failed to give religious feeling its due.          His views are presented scientifically in his https://archive.org/details/evangelischepro42hasegoog Evangelisch-protestantische Dogmatik , the value of which lies partly in the full and judiciously chosen historical materials prefixed to each dogma, and partly in the skill, caution and tact with which the permanent religious significance of various dogmas is discussed . More popular in style is his Gnosis: Oder evangelische Glaubenslehre, für die gebildeten in der Gemeinde, . But his reputation rests chiefly on his treatment of church history in his https://archive.org/details/kirchengeschich42hasegoog Kirchengeschichte, Lehrbuch zunächst für akademische Vorlesungen .     His biographical studies, https://archive.org/details/franzvonassisie42hasegoog Franz von Assisi , https://archive.org/details/caterinavonsien42hasegoog Caterina von Siena , Neue Propheten  are judicious and sympathetic. Other works are:   Hutterus Redivivus, or, doctrine of the Evangelical Lutheran Church , a work in which he sought to present the teaching of the Protestant church in such a way as ": null
    },
    {
        "Leonhard Hutter": "leonhard hutter"
    },
    {
        " would have reconstructed it, had he still been alive.   https://archive.org/details/daslebenjesuleh42hasegoog Das Leben Jesu ; in an enlarged form, Geschichte Jesu .   https://archive.org/details/handbuchderprot42hasegoog Handbuch der protestantischen Polemik gegen die Römisch-katholische Kirche .     For his life, see his https://archive.org/details/idealeundirrthm42hasegoog Ideale und Irrtümer and https://archive.org/details/annalenmeinesle42hasegoog Annalen meines Lebens ; and for comparison & mdash; ": null
    },
    {
        "Otto Pfleiderer": "otto pfleiderer"
    },
    {
        ",  and ": null
    },
    {
        "Frédéric Lichtenberger": "frédéric auguste lichtenberger"
    },
    {
        ", ": null
    }
]