[
    {
        "Karl Schwarz was a German ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " theologian.         He was born at ": null
    },
    {
        "Wiek, R체gen": "wiek, r체gen"
    },
    {
        ". His father, ": null
    },
    {
        "Theodor Schwarz": "theodor schwarz"
    },
    {
        ", pastor at Wiek, was well known as a preacher, and as the writer of a number of popular works under the pseudonym Theodor Melas .       Karl Schwarz studied theology and philosophy at ": null
    },
    {
        "Halle": "university of halle"
    },
    {
        ", and afterwards at ": null
    },
    {
        "Bonn": "university of bonn"
    },
    {
        " and ": null
    },
    {
        "Berlin": "university of berlin"
    },
    {
        " . At Berlin he came under the influence of ": null
    },
    {
        "Schleiermacher": "friedrich daniel ernst schleiermacher"
    },
    {
        " and ": null
    },
    {
        "G. W. F. Hegel": "georg wilhelm friedrich hegel"
    },
    {
        ", whose influences are seen in his work Das Wesen der Religion . In 42 he was imprisoned for six months on account of his advanced political opinions. After his release he helped with the Hallische Jahrb체cher.       From 42 to 42 he lectured at Halle, and was then suspended by the government. In 42 however, he was appointed professor extraordinarius, and later received a number of distinctions . Schwarz took an important part in the founding and directing of the German  Protestantenverein  and became an eminent exponent of liberal theology. His work Zur Geschichte der neuesten Theologie is a valuable source for the history of theology in Germany. His other works include Lessing als Theologe and Grundriss der christ. Lehre . In his memory, a Karl-Schwarz-Stiftung was founded in connection with the theological faculty at the ": null
    },
    {
        "University of Jena": "university of jena"
    },
    {
        ".       G. Rudloff, Karl Schwarz ;   F. Hummel, Zur Bedeutung der Schrift von Karl Schwarz: Uber das Wesen der Religion ;   Herzog-Hauck, Realencyklop채die": null
    }
]