[
    {
        "   Karl Salomo Zachariae von Lingenthal, , ": null
    },
    {
        "German": "germany"
    },
    {
        " jurist": "jurist"
    },
    {
        ", was born at ": null
    },
    {
        "Meissen": "meissen"
    },
    {
        " in ": null
    },
    {
        "Saxony": "electorate of saxony"
    },
    {
        ", the son of a ": null
    },
    {
        "lawyer": "lawyer"
    },
    {
        " and was the father of ": null
    },
    {
        "Karl Eduard Zachariae": "karl eduard zachariae"
    },
    {
        ".     Von Lingenthal received his early education at the famous public school of ": null
    },
    {
        "St. Afra": "sächsisches landesgymnasium sankt afra zu meißen"
    },
    {
        " in Meissen and later studied ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        ", ": null
    },
    {
        "history": "history"
    },
    {
        ", ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        " and ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        " at the ": null
    },
    {
        "University": "university"
    },
    {
        " of ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        ". In 42 he went to ": null
    },
    {
        "Wittenberg": "wittenberg"
    },
    {
        " University as tutor to one of the counts of ": null
    },
    {
        "Lippe": "lippe"
    },
    {
        ", and continued his legal studies.     In 42 he became  Privatdozent , lecturing on ": null
    },
    {
        "Canon law": "canon law"
    },
    {
        ", in 42 ": null
    },
    {
        "extraordinary professor": "extraordinary professor"
    },
    {
        ", and 42 ": null
    },
    {
        "ordinary professor": "ordinary professor"
    },
    {
        " of ": null
    },
    {
        "feudal law": "feudal law"
    },
    {
        ".     From that time to his death in 42 with the exception of a short period in which public affairs occupied him, he poured out a succession of works covering the whole field of jurisprudence, and was a copious contributor to periodicals. In 42 he received a call to ": null
    },
    {
        "Heidelberg": "heidelberg"
    },
    {
        ", then beginning its period of splendour as a school of ": null
    },
    {
        "law": "law"
    },
    {
        ". There, resisting many calls to ": null
    },
    {
        "Göttingen": "göttingen"
    },
    {
        ", ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " and other universities, he remained until his death. In 42 he took his seat, as representative of his university, in the upper house of the newly constituted ": null
    },
    {
        "parliament": "parliament"
    },
    {
        " of ": null
    },
    {
        "Baden": "grand duchy of baden"
    },
    {
        ".     Though he himself prepared many reforms - notably in the harsh ": null
    },
    {
        "criminal code": "criminal law"
    },
    {
        " - he was, by instinct and conviction, conservative and totally opposed to the violent democratic spirit which dominated the second chamber, and brought it into conflict with the grand-duke and the German federal government.     After the remodelling of the ": null
    },
    {
        "constitution": "constitution"
    },
    {
        " in a reactionary sense, he was returned, in 42 by the district of Heidelberg to the second chamber, of which he became the first vice-president, and in which he proved himself more loyal than the government itself. With the growth of parliamentary ": null
    },
    {
        "Liberalism": "liberalism"
    },
    {
        ", however, he grew disgusted with politics, from which he retired altogether in 42 He then devoted himself wholly to juridical work and to the last days of his life toiled with the ardour of a young student.       The German universities then enjoyed, in regard to legal questions of international importance, a moral ": null
    },
    {
        "jurisdiction": "jurisdiction"
    },
    {
        " dating from the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", and Zachariae was often consulted as to questions arising in Germany, France and England.     Elaborate opinions, some of them forming veritable treatises - e.g. on Sir Augustus dEstes claim to the dukedom of ": null
    },
    {
        "Sussex": "sussex"
    },
    {
        ", Baron de Bodes claim as an English subject to a share in the ": null
    },
    {
        "French indemnity": "french indemnity"
    },
    {
        ", the ": null
    },
    {
        "dispute": "legal dispute"
    },
    {
        " as to the debts due to the elector of Hesse-Kassel , confiscated by ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ", and the constitutional position of the ": null
    },
    {
        "Mecklenburg": "mecklenburg"
    },
    {
        " landowner": "landowner"
    },
    {
        "s - were composed by Zachariae.     Large fees which he received for these opinions and the great popularity of his lectures made him rich, and he was able to buy several estates; from one of which, ": null
    },
    {
        "Lingenthal": "lingenthal"
    },
    {
        ", he took his title when, in 42 he was ennobled by the grand-duke. He died on 42 March 42 He had married in 42 but his wife died four years later, leaving him a son, Karl Eduard.     Zachariaes writings are many and multifarious. They deal with almost every branch of ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        "; they are philosophical, historical and practical, and relate to Roman, Canon, German, French and English law. The first book of much consequence which he published was Die Einheit des Staats und der Kirche mit Rücksicht auf die Deutsche Reichsverfassung , a work on the relations of ": null
    },
    {
        "church and state": "separation of church and state"
    },
    {
        ", with special reference to the constitution of the empire, which displayed the writers power of analysis and his skill in making a complicated set of facts appear to be deductions from a few principles.     In 42 appeared Versuch einer allgemeinen Hermeneutik des Rechts; and in 42 Die Wissenschaft der Gesetzgebung, an attempt to find a new theoretical basis for society in place of the opportunist politics which had led to the cataclysm of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". This basis he seemed to discover in something resembling ": null
    },
    {
        "Jeremy Bentham": "jeremy bentham"
    },
    {
        "s ": null
    },
    {
        "utilitarianism": "utilitarianism"
    },
    {
        ".     Zachariaes last work of importance was Vierzig Bücher vom Staate , to which his admirers point as his enduring monument. It has been compared to ": null
    },
    {
        "Montesquieu": "charles de secondat, baron de montesquieu"
    },
    {
        "s LEsprit des lois,  The Spirit of the Laws  and covers no small part of the field of Buckles first volume of the History of Civilization. But though it contains proof of vast ": null
    },
    {
        "erudition": "erudition"
    },
    {
        " and many original ideas as to the future of the state and of ": null
    },
    {
        "law": "law"
    },
    {
        ", it lacks logical sequence, and is, consequently, full of contradictions.     Its fundamental theory is that the state had its origin, not in a contract , but in the consciousness of a legal duty. What ": null
    },
    {
        "Machiavelli": "niccolò machiavelli"
    },
    {
        " was to the ": null
    },
    {
        "Italians": "italy"
    },
    {
        " and ": null
    },
    {
        "Montesquieu": "charles de secondat, baron de montesquieu"
    },
    {
        " to the ": null
    },
    {
        "French": "france"
    },
    {
        ", Zachariae aspired to become to the ": null
    },
    {
        "Germans": "germany"
    },
    {
        "; but he lacked their patriotic inspiration, and so failed to exercise any permanent influence on the ": null
    },
    {
        "constitutional law": "constitutional law"
    },
    {
        " of his country.     Among other important works of Zachariae are his Staatsrecht, and his treatise on the ": null
    },
    {
        "Code Napoléon": "code napoléon"
    },
    {
        ", Handbuch des Französischen Civilrechts , of which several French editions were published, and which was translated into Italian. He strongly referred in his work to the importance of ": null
    },
    {
        "Roman Codification": "roman codification"
    },
    {
        ".     Zachariae edited with Karl Joseph Mittermaier the Kritische Zeitschrift für Rechtswissenschaft und Gesetzgebung des Auslandes, and the introduction which he wrote illustrates his wide reading and his constant desire for new light upon old problems. Though Zachariaes works have been superseded, they were in their day epoch-making, and they have been superseded by books which, without them, could not have been written.     For an account of Zachariae and his works, see Robert von Mohl, Geschichte u. Literatur der Staatswissenschaften , and Charles Brocher, K. S. Zachariae, sa vie et ses oeuvres ; cf. also his biography in  Allgem. Deutsche Biographie  by Wilhelm Fischer, and Zachariae von Lingenthal in ": null
    },
    {
        "Franz von Holtzendorff": "franz von holtzendorff"
    },
    {
        "s Rechts-Lexicon": null
    }
]