[
    {
        "Kassel  is a city located on the ": null
    },
    {
        "Fulda River": "fulda river"
    },
    {
        " in northern ": null
    },
    {
        "Hesse": "hesse"
    },
    {
        ", Germany. It is the administrative seat of the ": null
    },
    {
        "Regierungsbezirk": "regierungsbezirk"
    },
    {
        " Kassel": "kassel"
    },
    {
        " and the ": null
    },
    {
        "district": "districts of germany"
    },
    {
        " of the same name": "kassel"
    },
    {
        " and had 42 inhabitants in December 42 The former capital of the state of Hesse-Kassel has many palaces and parks, including the ": null
    },
    {
        "Bergpark Wilhelmshöhe": "bergpark wilhelmshöhe"
    },
    {
        ", which is a ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " World Heritage Site": "world heritage site"
    },
    {
        ". Kassel is also known for the  documenta  exhibitions of contemporary art. Kassel has a public university with 42 students and a multicultural population .                     Kassel was first mentioned in 42 AD, as the place where two ": null
    },
    {
        "deed": "deed"
    },
    {
        "s were signed by King ": null
    },
    {
        "Conrad I": "conrad of franconia"
    },
    {
        ". The place was called Chasella or Chassalla and was a fortification at a bridge crossing the ": null
    },
    {
        "Fulda river": "fulda"
    },
    {
        ". There are several yet unproven assumptions of the names origin. It could be derived from the ancient Castellum Cattorum, a castle of the Chatti, a German tribe that had lived in the area since Roman times. Another assumption is a portmanteau from Frankonian cas, meaning valley or recess, and sali meaning hall or service building, which can be interpreted as hall in a valley.     A deed from 42 certifies that Cassel had city rights, but the date when they were granted is not known.     In 42 the ": null
    },
    {
        "Landgraviate of Hesse": "landgraviate of hesse"
    },
    {
        ", until then centered in ": null
    },
    {
        "Marburg": "marburg"
    },
    {
        ", was divided among four sons, with ": null
    },
    {
        "Hesse-Kassel": "landgraviate of hesse-kassel"
    },
    {
        " becoming one of its successor states. Kassel was its capital and became a centre of ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        " Protestantism": "protestantism"
    },
    {
        " in Germany. Strong fortifications were built to protect the Protestant stronghold against Catholic enemies. Secret societies, such as ": null
    },
    {
        "Rosicrucianism": "rosicrucianism"
    },
    {
        " flourished, with Christian Rosenkreutz’s work ": null
    },
    {
        "Fama Fraternitis": "fama fraternitis"
    },
    {
        " first published in 42 In 42 Kassel became a refuge for 42 ": null
    },
    {
        "Huguenot": "huguenot"
    },
    {
        "s who found shelter in the newly established borough of Oberneustadt. ": null
    },
    {
        "Landgrave Charles": "charles i, landgrave of hesse-kassel"
    },
    {
        ", who was responsible for this humanitarian act, also ordered the construction of the Oktagon and of the Orangerie. In the late 42th Century, Hesse-Kassel became infamous for selling mercenaries  to the British crown to help suppress the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        " and to finance the construction of palaces and the Landgrave’s opulent lifestyle.     In the early 42th century, the ": null
    },
    {
        "Brothers Grimm": "brothers grimm"
    },
    {
        " lived in Kassel. They collected and wrote most of their ": null
    },
    {
        "fairy tales": "fairy tales"
    },
    {
        " there. At that time, around 42 the Landgraviate was elevated to a Principality and its ruler to  Prince-elector . Shortly after, it was annexed by ": null
    },
    {
        "Napoleon": "napoleon i of france"
    },
    {
        " and in 42 it became the capital of the short-lived ": null
    },
    {
        "Kingdom of Westphalia": "kingdom of westphalia"
    },
    {
        " under Napoleons brother ": null
    },
    {
        "Jérôme": "jérôme bonaparte"
    },
    {
        ". The Electorate was restored in 42     Having sided with Austria in the ": null
    },
    {
        "Austro-Prussian War": "austro-prussian war"
    },
    {
        " to gain supremacy in Germany, the principality was annexed by ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        " in 42 The Prussian administration united ": null
    },
    {
        "Nassau": "nassau"
    },
    {
        ", ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        " and Hesse-Kassel into the new Prussian province of ": null
    },
    {
        "Hesse-Nassau": "hesse-nassau"
    },
    {
        ". Kassel ceased to be a princely residence but soon developed into a major industrial centre, as well as a major railway junction. ": null
    },
    {
        "Henschel & Son": "henschel  &  son"
    },
    {
        ", the largest railway ": null
    },
    {
        "locomotive": "locomotive"
    },
    {
        " manufacturer in Germany at the end of the nineteenth century, was based in Kassel.     In 42 after the ": null
    },
    {
        "Battle of Sedan": "battle of sedan"
    },
    {
        ", ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " was sent as a prisoner to the ": null
    },
    {
        "Wilhelmshöhe Palace": "wilhelmshöhe palace"
    },
    {
        " above the city. During World War I the German military headquarters were located in the Wilhelmshöhe Palace. In the late 42s Nazis destroyed ": null
    },
    {
        "Heinrich Hübsch": "heinrich hübsch"
    },
    {
        "s ": null
    },
    {
        "Kassel Synagogue": "kassel synagogue"
    },
    {
        ".     During World War II, Kassel was the headquarters for Germanys ": null
    },
    {
        "Wehrkreis": "wehrkreis"
    },
    {
        " IX, and a local subcamp of ": null
    },
    {
        "Dachau concentration camp": "dachau concentration camp"
    },
    {
        " provided ": null
    },
    {
        "forced labour": "forced labour"
    },
    {
        " for the ": null
    },
    {
        "Henschel facilities": "bombing of kassel in world war ii"
    },
    {
        ", which included tank production plants. Edward Victor. Alphabetical List of Camps, Subcamps and Other Camps.www.edwardvictor.com/Holocaust/List %42 of % 42 camps. htm The most severe ": null
    },
    {
        "bombing of Kassel in World War II": "bombing of kassel in world war ii"
    },
    {
        " destroyed 42% of the downtown area, and some 42 people were killed and 42 were made homeless. Most of the casualties were civilians or wounded soldiers recuperating in local hospitals, whereas ": null
    },
    {
        "factories": "bombing of kassel in world war ii"
    },
    {
        " survived the attack generally undamaged. ": null
    },
    {
        "Karl Gerland": "karl gerland"
    },
    {
        " replaced the regional ": null
    },
    {
        "Gauleiter": "gauleiter"
    },
    {
        ", ": null
    },
    {
        "Karl Weinrich": "karl weinrich"
    },
    {
        ", soon after the raid.     The Allied ground advance into Germany reached Kassel at the beginning of April 42 The US ": null
    },
    {
        "42th Infantry Division": "80th infantry division"
    },
    {
        " captured Kassel in bitter house-to-house fighting during 42–42 April 42 which included numerous German panzer-grenadier counterattacks, and resulted in further widespread devastation to bombed and unbombed structures alike. Stanton, Shelby, World War II Order of Battle: An Encyclopedic Reference to U.S. Army Ground Forces from Battalion through Division, 4242, Stackpole Books , p. 42     ": null
    },
    {
        "Post-war": "post-war"
    },
    {
        ", most of the ancient buildings were not restored, and large parts of the city area were completely rebuilt in the style of the 42s. A few historic buildings, however, such as the ": null
    },
    {
        "Museum Fridericianum": "fridericianum"
    },
    {
        " , were restored. In 42 the interim parliament  eliminated Kassel in the first round as a city to become the provisional capital of the ": null
    },
    {
        "Federal Republic of Germany": "west germany"
    },
    {
        " . In 42 the town hosted the fourth  Hessentag  state festival . In 42 the Chancellor of West Germany ": null
    },
    {
        "Willy Brandt": "willy brandt"
    },
    {
        " and the Prime Minister of the German Democratic Republic ": null
    },
    {
        "Willy Stoph": "willy stoph"
    },
    {
        " met in Wilhelmshöhe Palace for negotiations between the two German states. In 42 the central rail station moved from Hauptbahnhof  to Kassel-Wilhelmshöhe . The city had a dynamic economic and social development in the recent years, reducing the unemployement rate by half and attracting many new citizens so that the population has grown constantly. Several international operating companies have factories or headquarters in the city . The city is home of several hospitals; the public Klinikum Kassel is one of the largest hospitals in the federal state, offering a wide range of health services.             In 42 the first German ": null
    },
    {
        "observatory": "observatory"
    },
    {
        " was built in Kassel, followed in 42 by the Ottoneum, the first permanent German theatre building. The old building is today the Natural History Museum, and the now-called ": null
    },
    {
        "Staatstheater Kassel": "staatstheater kassel"
    },
    {
        " is located in a nearby building that was constructed in the 42s.   Since 42 Kassel has been home to ": null
    },
    {
        "Bärenreiter": "bärenreiter"
    },
    {
        ", one of the worlds most important music publishers.     Since 42 the ": null
    },
    {
        "Documenta": "documenta"
    },
    {
        ", an international ": null
    },
    {
        "exhibition": "art exhibition"
    },
    {
        " of ": null
    },
    {
        "modern": "modern art"
    },
    {
        " and ": null
    },
    {
        "contemporary art": "contemporary art"
    },
    {
        ", has been held regularly in Kassel. The Documenta now takes place every 42 years. The most recent exhibition, ": null
    },
    {
        "documenta 42": "documenta 14"
    },
    {
        " is being held from June to September, 42 As a result of the Documenta 42 , Kassel became the first town in the world to be illuminated by ": null
    },
    {
        "laser": "laser"
    },
    {
        " beams at night . This laser installation is nowadays still visible at weekends. Other Documenta remnants can be found in many places in Kassel; among those are the ": null
    },
    {
        "42 Oaks": "7000 oaks"
    },
    {
        " , a work of ": null
    },
    {
        "land art": "land art"
    },
    {
        " by the German artist ": null
    },
    {
        "Joseph Beuys": "joseph beuys"
    },
    {
        ". All over the city are art pieces from former Documenta exhibitions. Currently the city plans to construct a Documenta institute connected to the university.       Kassel experiences an ": null
    },
    {
        "oceanic climate": "oceanic climate"
    },
    {
        "  but not so far from marine climates, with a more notable ": null
    },
    {
        "continental": "continental climate"
    },
    {
        " influence than ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ". Using the 4242 normal and 42 °C isotherm, the city already had a ": null
    },
    {
        "humid continental climate": "humid continental climate"
    },
    {
        " .                               The ": null
    },
    {
        "bombing raids of 42": "bombing of kassel in world war ii"
    },
    {
        " destroyed 42% of the city center. The city was almost completely rebuilt during the 42s and is a combination of renovated or reconstructed old buildings and architecture of the 42s. Outside the city center, the suburbs are dominated by 42th-century architecture. The oldest monument is the Druselturm; the Brüderkirche and the ": null
    },
    {
        "Martinskirche": "martinskirche, kassel"
    },
    {
        " are also, in part, of medieval origin. The towers of the Martinskirche are from the 42s.       ": null
    },
    {
        "St. Bonifatius, Kassel": "st. bonifatius, kassel"
    },
    {
        "                  The complex includes Wilhelmshöhe Palace , the Hercules monument, and the Lions Castle.   ": null
    },
    {
        "Wilhelmshöhe Palace": "wilhelmshöhe palace"
    },
    {
        " above the city was built in 42 by landgrave Wilhelm IX of Hesse-Kassel. The palace is now a museum and houses an important collection of Graeco-Roman antiques and a fine gallery of paintings comprising the second largest collection of ": null
    },
    {
        "Rembrandt": "rembrandt"
    },
    {
        "s in Germany. It is surrounded by the beautiful ": null
    },
    {
        "Bergpark Wilhelmshöhe": "bergpark wilhelmshöhe"
    },
    {
        " with many appealing sights. The complex was named a UNESCO World Heritage Site in 42      The ": null
    },
    {
        "Hercules monument": "hercules monument"
    },
    {
        " is a huge octagonal stone structure carrying a giant replica of ": null
    },
    {
        "Hercules Farnese ": "hercules"
    },
    {
        " . From its base down to Wilhelmshöhe Palace runs a long set of artificial cascades which delight visitors during the summer months. Every Sunday and Wednesday afternoon at 42:42 the famous ": null
    },
    {
        "water features": "hercules monument"
    },
    {
        " take place. They start at the Oktagon and during a one-hour walk through the park visitors can follow the waters way until they reach the lake of the Wilhelmshöhe Palace, where a fountain of about    marks the end of the spectacle.     The  Löwenburg  is a replica of a medieval castle, also built during the reign of Wilhelm IX. After the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        " of 42/42 ": null
    },
    {
        "Napoléon III": "napoléon iii"
    },
    {
        " was imprisoned in Wilhelmshöhe. In 42 Wilhelmshöhe became the seat of the German Army High Command : it was there that the military commanders ": null
    },
    {
        "Hindenburg": "paul von hindenburg"
    },
    {
        " and ": null
    },
    {
        "Ludendorff": "erich ludendorff"
    },
    {
        " prepared the German capitulation.       Another large park and also part of the ": null
    },
    {
        "European Garden Heritage Network": "european garden heritage network"
    },
    {
        " is the ": null
    },
    {
        "Karlsaue": "karlsaue"
    },
    {
        " along the Fulda River. Established in the 42th century, it is famous for the ": null
    },
    {
        "Orangerie": "orangerie"
    },
    {
        ", a palace built in 42 as a summer residence for the landgraves. Today, the Orangerie contains the Museum of Astronomy and Technology, with a scale model of the ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        " spanning the entire park and beyond.   In addition, the Park Schönfeld contains a small, municipal ": null
    },
    {
        "botanical garden": "botanical garden"
    },
    {
        ", the ": null
    },
    {
        "Botanischer Garten Kassel": "botanischer garten kassel"
    },
    {
        ".       Europes first public museum, the ": null
    },
    {
        "Museum Fridericianum": "fridericianum"
    },
    {
        " was founded in 42 By the end of the 42th century the museum held one of the largest collections of watches and clocks in the world.   Other art museums in Kassel include:   ": null
    },
    {
        "Wilhelmshöhe Palace": "wilhelmshöhe palace"
    },
    {
        "    New Gallery": "new gallery"
    },
    {
        "    Hessisches Landesmuseum": "hessian state museum, kassel"
    },
    {
        " .       Museum of Natural History   Museum of physics and astronomy in the ": null
    },
    {
        "Orangerie": "orangerie"
    },
    {
        " Orangerie": "orangerie"
    },
    {
        " Louis Spohr": "louis spohr"
    },
    {
        " Museum   ": null
    },
    {
        "Brothers Grimm": "brothers grimm"
    },
    {
        " Museum in the ": null
    },
    {
        "Bellevue Palace": "bellevue palace, kassel"
    },
    {
        "    Museum for Sepulchral Culture   Museum of the Brothers Grimm    Museum of Modern Art    Gemäldegallerie Kassel in the Wilhelmshöhe Palace    Botanical Island        ": null
    },
    {
        "Hessen Kassel": "ksv hessen kassel"
    },
    {
        " is the ": null
    },
    {
        "football": "association football"
    },
    {
        " club in the city, who plays in the ": null
    },
    {
        "Hessenliga": "hessenliga"
    },
    {
        " after being relegated from the ": null
    },
    {
        "Regionalliga Südwest": "regionalliga südwest"
    },
    {
        " in the 42/42 season. The citys own football stadium, the ": null
    },
    {
        "Auestadion": "auestadion"
    },
    {
        " was built in 42 and is able to hold 42 people. It is located in the south of Kassel at the quarter Südstadt, next to the Karlsaue.     Kassel has a long ice hockey tradition.  The team, the ": null
    },
    {
        "Kassel Huskies": "kassel huskies"
    },
    {
        ", was active from 42 to 42 They were founding members of the ": null
    },
    {
        "DEL": "deutsche eishockey liga"
    },
    {
        " in 42 belonging to the league from 4242 and again from 4242 In ": null
    },
    {
        "42": "1996–97 del season"
    },
    {
        ", they were runners-up in the championship playoffs, losing to ": null
    },
    {
        "Adler Mannheim": "adler mannheim"
    },
    {
        ", and reached the semifinals on three more occasions. The Huskies ran into financial difficulties and dissolved in 42 The Young Huskies, which is a junior and youth hockey club, decided to enter a mens team in the Hessenliga. This is the fifth division and the lowest mens competition in the state of ": null
    },
    {
        "Hesse": "hesse"
    },
    {
        ". The new club was expecting no more than 42 supporters for the first home game in the Hessenliga. However, they had over 42 supporters come to watch.              Kassel has ": null
    },
    {
        "seven tram lines": "trams in kassel"
    },
    {
        " , with trams arriving usually every 42 minutes. The city also operates a ": null
    },
    {
        "light rail": "light rail"
    },
    {
        " Stadtbahn": "stadtbahn"
    },
    {
        " network called RegioTram using ": null
    },
    {
        "Regio Citadis": "regio citadis"
    },
    {
        " low-floor trams which run on both tram and main line railway tracks with three lines . Moreover, a number of low-floor ": null
    },
    {
        "bus": "bus"
    },
    {
        "es complete the Kassel public transport system. The introduction of low-floor buses led to the development of the ": null
    },
    {
        "Kassel kerb": "kassel kerb"
    },
    {
        " which improves the ": null
    },
    {
        "accessibility": "accessibility"
    },
    {
        " at ": null
    },
    {
        "bus stop": "bus stop"
    },
    {
        "s.     The city is connected to the ": null
    },
    {
        "national rail network": "deutsche bahn"
    },
    {
        " at two stations, ": null
    },
    {
        "Kassel Central": "kassel hauptbahnhof"
    },
    {
        ", and ": null
    },
    {
        "Kassel-Wilhelmshöhe": "kassel-wilhelmshöhe railway station"
    },
    {
        ". The traditional central station has been reduced to the status of a regional station since the opening of the ": null
    },
    {
        "Hanover-Würzburg high-speed rail line": "hanover-würzburg high-speed rail line"
    },
    {
        " in 42 and its station on the high-speed line at which the ": null
    },
    {
        "InterCityExpress": "intercityexpress"
    },
    {
        " and ": null
    },
    {
        "InterCity": "intercity"
    },
    {
        " services call.     Kassel is connected to the ": null
    },
    {
        "motorways": "autobahn"
    },
    {
        " A 42": "bundesautobahn 7"
    },
    {
        ", ": null
    },
    {
        "A 42": "bundesautobahn 49"
    },
    {
        " and ": null
    },
    {
        "A 42": "bundesautobahn 44"
    },
    {
        ".     The city is served by ": null
    },
    {
        "Kassel Calden Airport": "kassel calden airport"
    },
    {
        ".              The ": null
    },
    {
        "University of Kassel": "university of kassel"
    },
    {
        " is a public higher education institution and was founded in 42 as a so-called reform university offering new and innovative models of teaching. It is the newest university in the state of ": null
    },
    {
        "Hessen": "hessen"
    },
    {
        " and has an urban and lively inner-city campus between the city center and the Northern city district, a typical working-class area with a multicultural population. There were 42 students enrolled at the university in 42 42 of them non-Germans. Two hundred and twenty-four students obtained their doctorate from the university in 42     The University offers a wide range of study programs from organic agriculture to social work. Furthermore, it offers several English  as well as two short-term international programs, the ": null
    },
    {
        "Summer University": "international summer university  kassel"
    },
    {
        " and the ": null
    },
    {
        "Winter University": "international winter university  kassel"
    },
    {
        ". The ": null
    },
    {
        "Kunsthochschule Kassel": "kunsthochschule kassel"
    },
    {
        " is also part of the university with a satellite campus directly at the Karlsaue park in the Southern city district.         Kassel School of Medicine   Fraunhofer-Institut für Windenergie und Energiesystemtechnik , the former Institut für Solare Energieversorgungstechnik   Fraunhofer-Institut für Bauphysik Projektgruppe Kassel   Forschungszentrum für Informationstechnik-Gestaltung   International Center for Development and Decent Work    Internationales Zentrum für Hochschulforschung Kassel   Zentrum für Umweltbewusstes Bauen   Center for Interdisciplinary Nanostructure Science and Technology   AG Friedensforschung       Volksbund Deutsche Kriegsgräberfürsorge ": null
    },
    {
        "German War Graves Commission": "german war graves commission"
    },
    {
        " court": "court"
    },
    {
        "s are located in Kassel, including:     ": null
    },
    {
        "Federal Social Court of Germany": "federal social court of germany"
    },
    {
        "   Hessischer Verwaltungsgerichtshof   Hessisches Finanzgericht   Sozialgericht Kassel   Arbeitsgericht Kassel   Verwaltungsgericht Kassel   Oberlandesgericht Frankfurt/Main in Kassel   Landgericht Kassel   Amtsgericht Kassel and Staatsanwaltschaft Kassel        ": null
    },
    {
        "Valerius Cordus": "valerius cordus"
    },
    {
        " physician and botanist, authored ": null
    },
    {
        "pharmacopoeias": "pharmacopoeias"
    },
    {
        " and herbals.   ": null
    },
    {
        "William IV, Landgrave of Hesse-Kassel": "william iv, landgrave of hesse-kassel"
    },
    {
        "   Landgravine Charlotte of Hesse-Kassel": "landgravine charlotte of hesse-kassel"
    },
    {
        "   Maria Amalia of Courland": "maria amalia of courland"
    },
    {
        " , noblewoman, participated in creation of park at ": null
    },
    {
        "Karlsaue": "karlsaue"
    },
    {
        " Simon Louis du Ry": "simon louis du ry"
    },
    {
        " , architect   ": null
    },
    {
        "Rudolf Erich Raspe": "rudolf erich raspe"
    },
    {
        " , a ": null
    },
    {
        "University of Kassel": "university of kassel"
    },
    {
        " librarian who fled to England after embezzling significant funds from ": null
    },
    {
        "Frederick II, Landgrave of Hesse-Kassel": "frederick ii, landgrave of hesse-kassel"
    },
    {
        ", and wrote  The Surprising Adventures of Baron Munchhausen  ": null
    },
    {
        "Prince Charles of Hesse-Kassel": "prince charles of hesse-kassel"
    },
    {
        "   Prince Frederick of Hesse-Kassel": "prince frederick of hesse-kassel"
    },
    {
        "   Gertrud Elisabeth Mara": "gertrud elisabeth mara"
    },
    {
        " , operatic soprano   ": null
    },
    {
        "Georg Friedrich Sartorius": "georg friedrich sartorius"
    },
    {
        " , research historian and economist   ": null
    },
    {
        "Louis Spohr": "louis spohr"
    },
    {
        " , 42th-century composer and violinist, who is commemorated by a museum in the city   ": null
    },
    {
        "Jérôme Bonaparte": "jérôme bonaparte"
    },
    {
        " , brother of ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        ", lived in Kassel while he was king of ": null
    },
    {
        "Westphalia": "kingdom of westphalia"
    },
    {
        " Brothers Grimm": "brothers grimm"
    },
    {
        ", Jacob and Wilhelm Grimm , academics, linguists, cultural researchers, and authors who collected folklore and published several collections as ": null
    },
    {
        "Grimms Fairy Tales": "grimms fairy tales"
    },
    {
        " Princess and Landgravine Augusta of Hesse-Kassel": "princess augusta of hesse-kassel"
    },
    {
        " , consort to ": null
    },
    {
        "Prince Adolphus, Duke of Cambridge": "prince adolphus, duke of cambridge"
    },
    {
        " Friedrich Armand Strubberg": "friedrich armand strubberg"
    },
    {
        " , merchant, physician, colonist in North America, direct descendant of ": null
    },
    {
        "Frederick I of Sweden": "frederick i of sweden"
    },
    {
        " Albrecht Rosengarten": "albrecht rosengarten"
    },
    {
        " , architect famous for synagogue buildings in Central Europe   ": null
    },
    {
        "Justus Carl Hasskarl": "justus carl hasskarl"
    },
    {
        " , botanist specialising in ": null
    },
    {
        "Pteridophytes": "pteridophytes"
    },
    {
        ", ": null
    },
    {
        "Bryophytes": "bryophytes"
    },
    {
        ", and ": null
    },
    {
        "Spermatophytes": "spermatophytes"
    },
    {
        " Louise of Hesse-Kassel": "louise of hesse-kassel"
    },
    {
        " , princess of Hesse-Kassel, later queen consort of ": null
    },
    {
        "King Christian IX": "christian ix of denmark"
    },
    {
        " of ": null
    },
    {
        "Denmark": "kingdom of denmark"
    },
    {
        " Paul Reuter": "paul reuter"
    },
    {
        " , founder of the ": null
    },
    {
        "Reuters": "reuters"
    },
    {
        " news agency   ": null
    },
    {
        "Israel Meyer Japhet": "israel meyer japhet"
    },
    {
        " choral director in ": null
    },
    {
        "Frankfurt am Main": "frankfurt am main"
    },
    {
        " Carl Friedrich Claus": "carl friedrich claus"
    },
    {
        " , chemist   ": null
    },
    {
        "Adolf Eugen Fick": "adolf eugen fick"
    },
    {
        " , physiologist   ": null
    },
    {
        "Hugo Wilhelm Arthur Nahl": "hugo wilhelm arthur nahl"
    },
    {
        " , artist who designed the ": null
    },
    {
        "Seal of California": "seal of california"
    },
    {
        " Daniel Bandmann": "daniel bandmann"
    },
    {
        " , actor-manager   ": null
    },
    {
        "Jakob Stilling": "jakob stilling"
    },
    {
        " , ophthalmologist, son of ": null
    },
    {
        "Benedict Stilling": "benedict stilling"
    },
    {
        ", surgeon, and brother of ": null
    },
    {
        "Heinrich Stilling": ":de:heinrich stilling"
    },
    {
        ", pathologist   ": null
    },
    {
        "Josias von Heeringen": "josias von heeringen"
    },
    {
        " , general   ": null
    },
    {
        "Philipp Scheidemann": "philipp scheidemann"
    },
    {
        " , briefly Germanys Chancellor after the First World War   ": null
    },
    {
        "Andreas Dippel": "andreas dippel"
    },
    {
        " , operatic tenor   ": null
    },
    {
        "Carl Kaiserling": "carl kaiserling"
    },
    {
        " , pathologist   ": null
    },
    {
        "Franz Rosenzweig": "franz rosenzweig"
    },
    {
        " , philosopher   ": null
    },
    {
        "F. W. Murnau": "f. w. murnau"
    },
    {
        " , movie director in the ": null
    },
    {
        "silent era": "silent film"
    },
    {
        " Helmut Hasse": "helmut hasse"
    },
    {
        " , fundamental theorist in algebra and number theory   ": null
    },
    {
        "Arnold Bode": "arnold bode"
    },
    {
        " , architect, painter, designer, and founder of the documenta   ": null
    },
    {
        "Lucien Scheler": "lucien scheler"
    },
    {
        " , French poet, writer, and publisher   ": null
    },
    {
        "Leni Junker": "leni junker"
    },
    {
        " , athlete who competed mainly in the 42 metres sprint   ": null
    },
    {
        "Dieter Koch-Weser": "dieter koch-weser"
    },
    {
        " , Professor, ": null
    },
    {
        "Harvard Medical School": "harvard medical school"
    },
    {
        " and ": null
    },
    {
        "Harvard School of Public Health": "harvard school of public health"
    },
    {
        " Holger Börner": "holger börner"
    },
    {
        " , politician   ": null
    },
    {
        "Otto Sander": "otto sander"
    },
    {
        " , German film, theater, and voice actor   ": null
    },
    {
        "Hans Eichel": "hans eichel"
    },
    {
        " , politician   ": null
    },
    {
        "Yona Melnik": "yona melnik"
    },
    {
        " , Israeli Olympic judoka   ": null
    },
    {
        "Hubertus Meyer-Burckhardt": "hubertus meyer-burckhardt"
    },
    {
        " , German television journalist and talk show host   ": null
    },
    {
        "Barbara Rudnik": "barbara rudnik"
    },
    {
        " , German actress   ": null
    },
    {
        "Helmut Kollars": "helmut kollars"
    },
    {
        " , writer and illustrator   ": null
    },
    {
        "Chris Hülsbeck": "chris hülsbeck"
    },
    {
        " , video game music composer   ": null
    },
    {
        "Meryem Sahra Uzerli": "meryem sahra uzerli"
    },
    {
        " , Turkish-German actress   ": null
    },
    {
        "Annika Mehlhorn": "annika mehlhorn"
    },
    {
        " , German butterfly and medley swimmer, who competed in the ": null
    },
    {
        "42 Summer Olympics": "2004 summer olympics"
    },
    {
        " Milky Chance": "milky chance"
    },
    {
        " , German folk duo   ": null
    },
    {
        "Yunus Mallı": "yunus mallı"
    },
    {
        " , Turkish footballer                 Kassel is ": null
    },
    {
        "twinned": "twin towns and sister cities"
    },
    {
        " with:      ": null
    },
    {
        "Florence": "florence"
    },
    {
        ", Italy, since 42    ": null
    },
    {
        "İzmit": "i̇zmit"
    },
    {
        ", Turkey, since 42    ": null
    },
    {
        "Mulhouse": "mulhouse"
    },
    {
        ", France, since 42    ": null
    },
    {
        "Ramat Gan": "ramat gan"
    },
    {
        ", Israel, since 42    ": null
    },
    {
        "Rovaniemi": "rovaniemi"
    },
    {
        ", Finland, since 42    ": null
    },
    {
        "Västerås": "västerås"
    },
    {
        ", Sweden, since 42    ": null
    },
    {
        "Yaroslavl": "yaroslavl"
    },
    {
        ", Russia, since 42    Berlin-": null
    },
    {
        "Mitte": "mitte"
    },
    {
        ", Germany, since 42    ": null
    },
    {
        "Arnstadt": "arnstadt"
    },
    {
        ", Germany, since 42   ": null
    }
]