[
    {
        "              Catherine Bush   is an English singer-songwriter and record producer. In 1978, aged 19, she topped the ": null
    },
    {
        "UK Singles Chart": "uk singles chart"
    },
    {
        " for four weeks with her debut single ": null
    },
    {
        "Wuthering Heights": "wuthering heights"
    },
    {
        " , becoming the first female artist to achieve a UK number one with a self-written song.  She has since released 25 UK ": null
    },
    {
        "Top 40": "top 40"
    },
    {
        " singles, including the top-10 hits ": null
    },
    {
        "The Man with the Child in His Eyes": "the man with the child in his eyes"
    },
    {
        " , ": null
    },
    {
        "Babooshka": "babooshka"
    },
    {
        " , ": null
    },
    {
        "Running Up That Hill": "running up that hill"
    },
    {
        " , ": null
    },
    {
        "Dont Give Up": "dont give up"
    },
    {
        "  and ": null
    },
    {
        "King of the Mountain": "king of the mountain"
    },
    {
        " . All ten of her studio albums reached the UK Top 10, including the UK number-one albums  Never for Ever  ,  Hounds of Love  , and the compilation  The Whole Story  . She was the first British solo female artist to top the UK album charts and the first female artist to enter the album chart at number one.      Bush began writing songs at 11. She was signed to ": null
    },
    {
        "EMI Records": "emi records"
    },
    {
        " after ": null
    },
    {
        "Pink Floyd": "pink floyd"
    },
    {
        " guitarist ": null
    },
    {
        "David Gilmour": "david gilmour"
    },
    {
        " helped produce a demo tape. Her debut album,  The Kick Inside , was released in 1978. Bush slowly gained artistic independence in album production, and has produced all her studio albums since ": null
    },
    {
        "The Dreaming": "the dreaming"
    },
    {
        " . She took a hiatus between her seventh and eighth albums ": null
    },
    {
        "The Red Shoes": "the red shoes"
    },
    {
        " and ": null
    },
    {
        "Aerial": "aerial"
    },
    {
        " . She drew attention again in 2014 with her concert residency ": null
    },
    {
        "Before the Dawn": "before the dawn"
    },
    {
        ", her first shows since 1979s ": null
    },
    {
        "The Tour of Life": "the tour of life"
    },
    {
        ".     Bushs eclectic and experimental musical style, unconventional lyrics, and literary themes have influenced a diverse range of artists. She has been nominated for 13 ": null
    },
    {
        "British Phonographic Industry": "british phonographic industry"
    },
    {
        " accolades,  winning for ": null
    },
    {
        "Best British Female Artist": "brit award for british female solo artist"
    },
    {
        " in 1987,  and has been nominated for three ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        "s. In 2002, she was recognised with an ": null
    },
    {
        "Ivor Novello Award": "ivor novello award"
    },
    {
        " for Outstanding Contribution to British Music. In October 2017 she was nominated for induction in the ": null
    },
    {
        "Rock and Roll Hall of Fame": "rock and roll hall of fame"
    },
    {
        " in 2018.  Bush was appointed ": null
    },
    {
        "Commander of the Order of the British Empire": "order of the british empire"
    },
    {
        " in the ": null
    },
    {
        "2013 New Year Honours": "2013 new year honours"
    },
    {
        " for services to music.           Bush was born in ": null
    },
    {
        "Bexleyheath": "bexleyheath"
    },
    {
        ", ": null
    },
    {
        "Kent": "kent"
    },
    {
        ",  to an English medical doctor, Robert Bush , and an Irish mother, Hannah Daly .  She was raised as a ": null
    },
    {
        "Roman Catholic": "catholic church"
    },
    {
        "  in their farmhouse in ": null
    },
    {
        "East Wickham": "east wickham"
    },
    {
        ", an urban village in the neighbouring town of ": null
    },
    {
        "Welling": "welling"
    },
    {
        ", with her elder brothers, John and ": null
    },
    {
        "Paddy": "paddy bush"
    },
    {
        ".  Bush came from an artistic background: her mother was an amateur traditional Irish dancer, her father was an amateur pianist, Paddy worked as a musical instrument maker, and John was a poet and photographer. Both brothers were involved in the local ": null
    },
    {
        "folk music": "folk music"
    },
    {
        " scene.      Kate trained at ": null
    },
    {
        "Goldsmiths College": "goldsmiths, university of london"
    },
    {
        " karate club, where her brother John was a ": null
    },
    {
        "karateka": "karateka"
    },
    {
        ". There, she became known as Ee-ee because of her squeaky ": null
    },
    {
        "kiai": "kiai"
    },
    {
        ".      Her familys musical influence inspired Bush to teach herself the piano at the age of 11. She also played the organ in a barn behind her parents house and studied the violin.  She soon began composing songs, eventually adding her own lyrics.        Bush attended St Josephs Convent Grammar School, a Catholic girls school in nearby ": null
    },
    {
        "Abbey Wood": "abbey wood"
    },
    {
        " which, in 1975, after she had left, became part of St Marys and St Josephs School in ": null
    },
    {
        "Sidcup": "sidcup"
    },
    {
        ".  During this time her family produced a ": null
    },
    {
        "demo tape": "demo"
    },
    {
        " with over 50 of her compositions, which was turned down by record labels. ": null
    },
    {
        "Pink Floyd": "pink floyd"
    },
    {
        " guitarist ": null
    },
    {
        "David Gilmour": "david gilmour"
    },
    {
        " received the demo from Ricky Hopper, a mutual friend of Gilmour and the Bush family. Impressed, Gilmour helped the sixteen-year-old Bush record a more professional demo tape.  Three tracks in total were recorded and paid for by Gilmour.  Rolling Stone  magazine, 8 February 1990, pp  21–2: The Sensual Woman by Sheila Rogers. The tape was produced by Gilmours friend ": null
    },
    {
        "Andrew Powell": "andrew powell"
    },
    {
        ", who went on to produce Bushs first two albums, and sound engineer ": null
    },
    {
        "Geoff Emerick": "geoff emerick"
    },
    {
        ", who had worked with the Beatles.  The tape was sent to ": null
    },
    {
        "EMI": "emi"
    },
    {
        " executive Terry Slater, , Originally published in  who signed her.         The British record industry was reaching a point of stagnation. ": null
    },
    {
        "Progressive rock": "progressive rock"
    },
    {
        " was very popular and visually oriented rock performers were growing in popularity, thus record labels looking for the next big thing were considering experimental acts. Bush was put on ": null
    },
    {
        "retainer": "retainer agreement"
    },
    {
        " for two years by Bob Mercer, managing director of EMI group-repertoire division. According to Mercer, he felt Bushs material was good enough to release, but felt that if the album failed it would be demoralising and if it was successful Bush was too young to handle it.  However, in a 1987 interview, Gilmour disputed this version of events, blaming EMI for initially using the wrong producers.      After the contract signing, EMI gave her a large advance, which she used to enroll in ": null
    },
    {
        "interpretive dance": "interpretive dance"
    },
    {
        " classes taught by ": null
    },
    {
        "Lindsay Kemp": "lindsay kemp"
    },
    {
        ", a former teacher of ": null
    },
    {
        "David Bowie": "david bowie"
    },
    {
        ",  and mime training with ": null
    },
    {
        "Adam Darius": "adam darius"
    },
    {
        ". ": null
    },
    {
        "Darius, A": "adam darius"
    },
    {
        ". The Adam Darius Method, page  236–240. Latonia.    For the first two years of her contract, Bush spent more time on schoolwork than recording. She left school after doing her mock ": null
    },
    {
        "A-levels": "gce advanced level"
    },
    {
        " and having gained ten ": null
    },
    {
        "GCE": "general certificate of education"
    },
    {
        " O-Level": "o-level"
    },
    {
        " qualifications.      Bush wrote and made demos of almost 200 songs, some of which circulated as ": null
    },
    {
        "bootlegs": "bootleg recording"
    },
    {
        ".  From March to August 1977, she fronted the KT Bush Band at public houses in London. The band included ": null
    },
    {
        "Del Palmer": "del palmer"
    },
    {
        " , Brian Bath , and Vic King . She began recording her first album in August 1977.     The Kick Inside and Lionheart     For her début album,  The Kick Inside  , Bush was persuaded to use established session musicians instead of the KT Bush Band. She retained some of these even after she had brought her bandmates back on board.  Her brother Paddy played the harmonica and mandolin. ": null
    },
    {
        "Stuart Elliott": "stuart elliott"
    },
    {
        " played some of the drums and became her main drummer on subsequent albums.  The Kick Inside was released when Bush was 19, with some songs written when she was as young as 13. EMI originally wanted the more rock-oriented track James and the Cold Gun to be her debut single, but Bush, who already had a reputation for asserting herself in decisions about her work, insisted that it should be ": null
    },
    {
        "Wuthering Heights": "wuthering heights"
    },
    {
        " .     In the United Kingdom alone, The Kick Inside sold over a million copies.  Wuthering Heights topped the UK and Australian charts and became an international hit.  Bush became the first woman to reach number one on the UK charts with a self-written song.  A second single, ": null
    },
    {
        "The Man with the Child in His Eyes": "the man with the child in his eyes"
    },
    {
        " , reached number six in the UK charts.  It also made it onto the American ": null
    },
    {
        "Billboard Hot 100": "billboard hot 100"
    },
    {
        " where it reached number 85 in early 1979, and went on to win her an ": null
    },
    {
        "Ivor Novello Award": "ivor novello award"
    },
    {
        " in 1979 for Outstanding British Lyric.  According to  Guinness World Records , Bush was the first female artist in pop history to have written every track on a million-selling debut album.     Bob Mercer blamed Bushs lesser success in the United States on American radio formats, saying there were no outlets for Bushs visual presentation. EMI capitalised on Bushs appearance by promoting the album with a poster of her in a tight pink top that emphasised her breasts. In an interview with  NME  in 1982, Bush criticised the choice: People werent even generally aware that I wrote my own songs or played the piano. The media just promoted me as a female body. Its like Ive had to prove that Im an artist in a female body. In late 1978, EMI persuaded Bush to quickly record a follow-up album,  Lionheart , to take advantage of the success of The Kick Inside. The album was produced by Andrew Powell, assisted by Bush. While it gained high sales and spawned the hit single ": null
    },
    {
        "Wow": "wow"
    },
    {
        " , it did not reach the success of The Kick Inside, reaching number six in the UK album charts. She went on to express dissatisfaction with Lionheart, feeling that it had needed more time.      Bush set up her own publishing company, Kate Bush Music, and her own management company, Novercia, to maintain control of her work. Members of her family, along with Bush herself, composed the board of directors. Following the release of Lionheart, she was required by EMI to undertake heavy promotional work and an exhausting tour.  ": null
    },
    {
        "The Tour of Life": "the tour of life"
    },
    {
        " began in April 1979 and lasted six weeks. It was described by  The Guardian  as an extraordinary, hydra-headed beast, combining music, dance, poetry, mime, burlesque, magic and theatre . The show was co-devised and performed on stage with magician ": null
    },
    {
        "Simon Drake": "simon drake"
    },
    {
        ".  Bush was involved in every aspect of the production, choreography, set design, costume design and hiring. The shows were noted for her dancing, complex lighting and her 17 costume changes per show. Because of her need to dance as she sang, sound engineers used a wire coat hanger and a ": null
    },
    {
        "radio microphone": "wireless microphone"
    },
    {
        " to fashion a headset microphone; it was the first used by a rock performer since ": null
    },
    {
        "the Spotnicks": "the spotnicks"
    },
    {
        " used a primitive version in the early 1960s.  In the same year, Bush wrote and performed the song The Magician , using a fairground-like arrangement, for ": null
    },
    {
        "Menahem Golans": "menahem golan"
    },
    {
        "film  The Magician of Lublin .  The track was scored and arranged by ": null
    },
    {
        "Michael Kamen": "michael kamen"
    },
    {
        ".     Never for Ever and The Dreaming Never for Ever  saw Bushs second foray into production, co-producing with ": null
    },
    {
        "Jon Kelly": "jon kelly"
    },
    {
        ". Her first experience as a producer was on her  Live on Stage  ": null
    },
    {
        "EP": "extended play"
    },
    {
        ", released after her tour the previous year. The first two albums had resulted in a definitive sound evident in every track, with orchestral arrangements supporting the live band sound. The range of styles on Never for Ever is much more diverse, veering from the straightforward rocker Violin to the wistful waltz of hit single ": null
    },
    {
        "Army Dreamers": "army dreamers"
    },
    {
        " .          Never for Ever was her first album to feature synthesisers and drum machines, in particular the ": null
    },
    {
        "Fairlight CMI": "fairlight cmi"
    },
    {
        ", to which she was introduced when providing backing vocals on ": null
    },
    {
        "Peter Gabriels": "peter gabriel"
    },
    {
        " eponymous": "eponymous"
    },
    {
        " third album": "peter gabriel"
    },
    {
        " in early 1980. It was her first record to reach the top position in the UK album charts, also making her the first female British artist to achieve that status, and the first female artist ever to enter the album chart at the top. The top-selling single from the album was ": null
    },
    {
        "Babooshka": "babooshka"
    },
    {
        " , which reached number five in the UK singles chart.  In November 1980, she released the standalone ": null
    },
    {
        "Christmas single": "christmas music"
    },
    {
        " December Will Be Magic Again": "december will be magic again"
    },
    {
        " , which reached number 29 in the UK charts.     September 1982 saw the release of  The Dreaming , the first album Bush produced by herself.  With her new-found freedom, she experimented with production techniques, creating an album that features a diverse blend of musical styles and is known for its near-exhaustive use of the Fairlight CMI. The Dreaming received a mixed reception in the UK, and critics were baffled by the dense soundscapes Bush had created to become less accessible .  Smash Hits  magazine, reviews of The Dreaming In a 1993 interview with  Q  magazine, Bush stated: That was my Shes gone mad album. However, the album became her first to enter the US ": null
    },
    {
        "Billboard 200": "billboard 200"
    },
    {
        " chart, albeit only reaching number 157.  The album entered the UK album chart at number-three,  but is to date her lowest-selling album, garnering only a silver disc.      ": null
    },
    {
        "Sat in Your Lap": "sat in your lap"
    },
    {
        " was the first single from the album to be released. It pre-dated the album by over a year and peaked at number 11 in the UK.  The ": null
    },
    {
        "title track": "the dreaming"
    },
    {
        ", featuring ": null
    },
    {
        "Rolf Harris": "rolf harris"
    },
    {
        " and ": null
    },
    {
        "Percy Edwards": "percy edwards"
    },
    {
        ", stalled at number 48,  while the third single, ": null
    },
    {
        "There Goes a Tenner": "there goes a tenner"
    },
    {
        " , stalled at number 93, UK singles chart peak for There Goes a Tenner :  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref nameOfficialCharts / ref  /ref  ref  /ref ref /ref  ref  /ref ref  /ref ref  /ref  ref nameMightyBush / ref  /ref  ref  /ref ref nameMightyBush / ref name War of Wuthering Heights  /ref  ref  /ref  ref  /ref  ref nameMightyBush /  ref  /ref ref  /ref ref name :0 /  ref  /ref ref  /ref  math /math  ref  /ref  ref  /ref  ref name brits /  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref  ref  /ref ref name BBC News  /ref  ref  /ref  ref  /ref ref  /ref ref  /ref  ref  /ref  ref  /ref  ref nameAllMusicBio /  ref name Simon Reynolds  /ref  ref nameRebel /  ref name Simon Reynolds /  ref  /ref  ref nameEnglishness  /ref ref  /ref ref  /ref ref  /ref  ref nameEnglishness / ref nameRadio4052011  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref nameLittleMiss  /ref  ref name ARTE-France-KB-docu-2019  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref nameQueens  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref nameQueens / ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name :2 /  ref name :4  /ref ref name :2 / ref name :4 /  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name War of Wuthering Heights /  ref  /ref ref  /ref  ref nameLittleMiss / ref  /ref  ref nameRadio4052011 /  ref  /ref  ref  /ref  ref name :3  /ref  ref name :3 /   !-- do not add new albums here without citing a reliable source, see ": null
    },
    {
        "WP:CRYSTAL": "wp:crystal"
    }
]