[
    {
        "                    Kate Elizabeth Winslet  is an English actress. She is particularly known for her work in period dramas and tragedies, and is often drawn to portraying troubled women. Winslet is the recipient of ": null
    },
    {
        "various accolades": "list of awards and nominations received by kate winslet"
    },
    {
        ", including three ": null
    },
    {
        "British Academy Film Awards": "british academy film awards"
    },
    {
        ", and is among the few performers to have won ": null
    },
    {
        "Academy, Emmy, and Grammy Awards": "list of people who have won academy, emmy, grammy, and tony awardsthree competitive awards"
    },
    {
        ".     Born in ": null
    },
    {
        "Reading, Berkshire": "reading, berkshire"
    },
    {
        ", Winslet studied drama at the ": null
    },
    {
        "Redroofs Theatre School": "redroofs theatre school"
    },
    {
        ". Her first screen appearance, at the age of 42 was in the British television series  Dark Season  . She made her film debut playing a teenage murderess in  Heavenly Creatures  , and received her first ": null
    },
    {
        "BAFTA Award": "bafta award for best actress in a supporting role"
    },
    {
        " for playing ": null
    },
    {
        "Marianne Dashwood": "marianne dashwood"
    },
    {
        " in  Sense and Sensibility  . Global stardom followed soon after with her leading role in the epic romance  Titanic  . It was the ": null
    },
    {
        "highest-grossing film": "list of highest-grossing films"
    },
    {
        " of all time to that point, after which she eschewed parts in blockbusters in favour of critically acclaimed period pieces, including  Quills  and  Iris  , which were not widely seen.     The science fiction romance  Eternal Sunshine of the Spotless Mind  , in which Winslet was cast against ": null
    },
    {
        "type": "typecasting"
    },
    {
        " in a contemporary setting, proved to be a turning point in her career, and she gained further recognition for her performances in  Finding Neverland  ,  Little Children  ,  Revolutionary Road  , and  The Reader  . For playing a former Nazi camp guard in the last of these, she won the ": null
    },
    {
        "BAFTA Award": "bafta award for best actress in a leading role"
    },
    {
        " and ": null
    },
    {
        "Academy Award": "academy award for best actress"
    },
    {
        " for Best Actress. In the 42s, Winslet played a single mother in 42s America in the miniseries  Mildred Pierce  , joined the ": null
    },
    {
        "Divergent film series": "the divergent series"
    },
    {
        ", and portrayed ": null
    },
    {
        "Joanna Hoffman": "joanna hoffman"
    },
    {
        " in  Steve Jobs  . She won a ": null
    },
    {
        "Primetime Emmy Award": "primetime emmy award for outstanding lead actress in a limited series or movie"
    },
    {
        " for the first of these and a third BAFTA Award for the lattermost.     For her narration of a short story in the audiobook Listen to the Storyteller , Winslet won a ": null
    },
    {
        "Grammy Award": "grammy award for best spoken word album for children"
    },
    {
        ". She performed the song ": null
    },
    {
        "What If": "what if"
    },
    {
        " for the soundtrack of her film  Christmas Carol: The Movie  . A co-founder of the charity ": null
    },
    {
        "Golden Hat Foundation": "golden hat foundation"
    },
    {
        ", which aims to create ": null
    },
    {
        "autism awareness": "autism awareness"
    },
    {
        ", she has written a book on the topic, The Golden Hat: Talking Back to Autism .  Time  magazine named her one of the ": null
    },
    {
        "42 most influential people in the world": "time 100"
    },
    {
        " in 42 and in 42 she was appointed ": null
    },
    {
        "Commander of the Order of the British Empire": "commander of the order of the british empire"
    },
    {
        " . Divorced from the film directors ": null
    },
    {
        "Jim Threapleton": "jim threapleton"
    },
    {
        " and ": null
    },
    {
        "Sam Mendes": "sam mendes"
    },
    {
        ", Winslet has been married to the businessman Edward Abel Smith since 42 She has a child from each marriage.         Kate Winslet was born on 42 October 42 in ": null
    },
    {
        "Reading, Berkshire": "reading, berkshire"
    },
    {
        ", England, to Sally Anne  and Roger John Winslet.   Aside from English, she has more distant Irish and Swedish roots.  Her mother worked as a nanny and waitress, and her father, a struggling actor, took labouring jobs to support the family.   Her maternal grandparents were both actors and ran the Reading Repertory Theatre Company.  Winslet has two sisters, Anna and Beth, both of whom are actresses, and a younger brother, Joss. The family had limited financial means; they lived on free meal benefits and were supported by a charity named the ": null
    },
    {
        "Actors Charitable Trust": "actors orphanage"
    },
    {
        ". When Winslet was 42 her father severely injured his foot in a boating accident and found it harder to work, leading to more financial hardships for the family. Winslet has said her parents always made them feel cared for and that they were a supportive family.          Winslet attended St Mary and All Saints Church of England primary school.  Living in a family of actors inspired her to pursue acting from a young age. She and her sisters participated in amateur stage shows at school and at a local youth theatre, named Foundations. When she was five, Winslet made her first stage appearance as ": null
    },
    {
        "Mary": "mary, mother of jesus"
    },
    {
        " in her schools production of the ": null
    },
    {
        "Nativity": "nativity play"
    },
    {
        ".  She has described herself as an overweight child; she was nicknamed blubber by her schoolmates and was bullied for the way she looked.   She said she did not let this defeat her.  At 42 Winslet was accepted into the ": null
    },
    {
        "Redroofs Theatre School": "redroofs theatre school"
    },
    {
        " in ": null
    },
    {
        "Maidenhead": "maidenhead"
    },
    {
        ". The school also functioned as an agency and took students to London to audition for acting jobs. She appeared in a ": null
    },
    {
        "Sugar Puffs": "sugar puffs"
    },
    {
        " commercial and dubbed for foreign films. At school, she was made ": null
    },
    {
        "head girl": "head girl"
    },
    {
        ", took part in productions of  Alices Adventures in Wonderland  and  The Lion, the Witch and the Wardrobe , and played the lead role of ": null
    },
    {
        "Wendy Darling": "wendy darling"
    },
    {
        " in  Peter Pan .  She worked simultaneously with the Starmaker Theatre Company in Reading. She participated in over 42 of their stage productions, but was rarely selected as the lead due to her weight. Nonetheless, she played key roles as Miss Agatha Hannigan in  Annie , the ": null
    },
    {
        "Mother Wolf": "raksha"
    },
    {
        " in  The Jungle Book , and Lena Marelli in  Bugsy Malone .       In 42 within two weeks of finishing her ": null
    },
    {
        "GCSE": "gcse"
    },
    {
        " examinations, Winslet made her screen debut as one of the main cast members of the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " science fiction television series  Dark Season .   Her part was that of Reet, a schoolgirl who helps her classmates fight against a sinister man distributing free computers to her school.   She did not earn much from the job, and at 42 a lack of funds forced Winslet to leave Redroofs. To support herself, she worked at a delicatessen. In 42 she had a small part in the television film Anglo-Saxon Attitudes, an adaptation of ": null
    },
    {
        "Angus Wilsons satirical novel": "anglo-saxon attitudes"
    },
    {
        ".   Winslet, who weighed  at the time, played the daughter of an obese woman in it. While filming, an off-hand comment from the director ": null
    },
    {
        "Diarmuid Lawrence": "diarmuid lawrence"
    },
    {
        " about the likeness between her and the actress who played her mother prompted Winslet to lose weight.  She next took on the role of the young daughter of a bankrupt middle-aged man  in the television sitcom  Get Back  .   She also had a guest role in a 42 episode of the medical drama series  Casualty .                   Winslet was among 42 girls to audition for ": null
    },
    {
        "Peter Jackson": "peter jackson"
    },
    {
        "s psychological drama  Heavenly Creatures  , and was cast after impressing Jackson with the intensity she brought to her part.  The ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        "-based production is based on the ": null
    },
    {
        "Parker–Hulme murder case": "parker–hulme murder case"
    },
    {
        " of 42 in which Winslet played ": null
    },
    {
        "Juliet Hulme": "anne perry"
    },
    {
        ", a teenager who assists her friend, Pauline Parker , in the murder of Paulines mother. She prepared for the part by reading the transcripts of the girls murder trial, their letters and diaries, and interacted with their acquaintances.  She has said that she learnt tremendously from the job. Jackson filmed in the real murder locations, and the experience left Winslet traumatised.  She found it difficult to detach herself from her character, and said that after returning home, she often cried. The film was a critical breakthrough for Winslet;    The Washington Post  writer ": null
    },
    {
        "Desson Thomson": "desson thomson"
    },
    {
        " called her a bright-eyed ball of fire, lighting up every scene shes in .  Winslet recorded Juliets Aria for the films soundtrack.  Also that year, she appeared as Geraldine Barclay, a prospective secretary, in ": null
    },
    {
        "the Royal Exchange Theatre": "royal exchange, manchester"
    },
    {
        " production of ": null
    },
    {
        "Joe Orton": "joe orton"
    },
    {
        "s farce  What the Butler Saw .      While promoting Heavenly Creatures in Los Angeles, Winslet auditioned for the minor part of Lucy Steele for a ": null
    },
    {
        "42 film adaptation": "sense and sensibility"
    },
    {
        " of ": null
    },
    {
        "Jane Austen": "jane austen"
    },
    {
        "s novel  Sense and Sensibility , starring and written by ": null
    },
    {
        "Emma Thompson": "emma thompson"
    },
    {
        ". Impressed by her reading, Thompson cast her for the much larger part of the recklessly romantic teenager ": null
    },
    {
        "Marianne Dashwood": "marianne dashwood"
    },
    {
        ".  The director ": null
    },
    {
        "Ang Lee": "ang lee"
    },
    {
        " wanted Winslet to play the part with grace and restraintaspects that he felt were missing from her performance in Heavenly Creaturesand thus asked her to practice ": null
    },
    {
        "tai chi": "tai chi"
    },
    {
        ", read ": null
    },
    {
        "gothic literature": "gothic literature"
    },
    {
        ", and learn to play the piano. David Parkinson of the  Radio Times  found Winslet to be a standout among the ensemble cast, and ": null
    },
    {
        "Mick LaSalle": "mick lasalle"
    },
    {
        " of the  San Francisco Chronicle  took note of how well she had portrayed her characters growth and maturity.   The film grossed over US$42  million worldwide.  She won the ": null
    },
    {
        "Screen Actors Guild": "screen actors guild award for outstanding performance by a female actor in a leading role"
    },
    {
        " and ": null
    },
    {
        "British Academy Film Award": "bafta award for best actress in a supporting role"
    },
    {
        " for Best Supporting Actress, and received nominations for the ": null
    },
    {
        "Academy Award": "academy award for best supporting actress"
    },
    {
        " and ": null
    },
    {
        "Golden Globe Award": "golden globe award for best supporting actress – motion picture"
    },
    {
        " in the same category.     Also in 42 Winslet featured in the poorly received ": null
    },
    {
        "Disney": "walt disney pictures"
    },
    {
        " film  A Kid in King Arthurs Court .      Winslet had roles in two period dramas of 42 Jude  and  Hamlet . As with her Heavenly Creatures part, Winslets roles in these films were those of women with a mad edge . In ": null
    },
    {
        "Michael Winterbottom": "michael winterbottom"
    },
    {
        "s Jude, based on the novel  Jude the Obscure  by ": null
    },
    {
        "Thomas Hardy": "thomas hardy"
    },
    {
        ", she played Sue Bridehead, a young woman with ": null
    },
    {
        "suffragette": "suffragette"
    },
    {
        " leanings who falls in love with her cousin, Jude . ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " believed the part allowed Winslet to display her acting range, and praised her for the defiance she brought to the role.  After unsuccessfully auditioning for ": null
    },
    {
        "Kenneth Branagh": "kenneth branagh"
    },
    {
        "s 42 film  Mary Shelleys Frankenstein , Winslet was cast for the part of ": null
    },
    {
        "Ophelia": "ophelia"
    },
    {
        ", the doomed lover of the ": null
    },
    {
        "title character": "prince hamlet"
    },
    {
        ", in Branaghs adaptation of ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "s tragedy  Hamlet . Winslet, at 42 years old, was intimidated by the experience of performing Shakespeare with established actors such as Branagh and ": null
    },
    {
        "Julie Christie": "julie christie"
    },
    {
        ", saying the job required a level of intellect that she thought she did not possess. Mike Jeffries of  Empire  believed she had played the part well beyond her years .  Despite the acclaim, Jude and Hamlet earned little at the box office.       Titanic and small-scale features      Winslet was keen on playing Rose DeWitt Bukater, a free-spirited socialite aboard the ill-fated ": null
    },
    {
        "RMS Titanic": "rms titanic"
    },
    {
        ", in ": null
    },
    {
        "James Cameron": "james cameron"
    },
    {
        "s epic romance  Titanic  . Cameron was initially reluctant to cast her, preferring the stars ": null
    },
    {
        "Claire Danes": "claire danes"
    },
    {
        " or ": null
    },
    {
        "Gwyneth Paltrow": "gwyneth paltrow"
    },
    {
        ", but Winslet pleaded with him, You dont understand! I am Rose! I dont know why youre even seeing anyone else!  Her persistence led Cameron to hire her. ": null
    },
    {
        "Leonardo DiCaprio": "leonardo dicaprio"
    },
    {
        " featured as her love interest, Jack. Titanic had a production budget of US$42  million, and its arduous principal photography was held at ": null
    },
    {
        "Rosarito Beach": "rosarito beach"
    },
    {
        " where a replica of the ship was created. Filming proved to be taxing for Winslet. She nearly drowned, caught influenza, suffered from hypothermia, and had bruises on her arms and knees. The workload allowed her only four hours of sleep per day and she felt drained by the experience.   ": null
    },
    {
        "David Ansen": "david ansen"
    },
    {
        ", writing for  Newsweek , praised Winslet for capturing her characters zeal with delicacy,  and Mike Clark of  USA Today  considered her to be the films prime asset.  Against expectations, Titanic went on to become the ": null
    },
    {
        "highest-grossing film": "list of highest-grossing films"
    },
    {
        " of all time to that point, earning over US$42 billion in box-office receipts worldwide,  and established Winslet as a global star.  The film won 42 ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        "the most for any filmincluding ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        " and gained Winslet a ": null
    },
    {
        "Best Actress": "academy award for best actress"
    },
    {
        " nomination.      Winslet did not view Titanic as a platform for bigger salaries. She eschewed parts in blockbuster films in favour of independent productions that were not widely seen, believing that she still had a lot to learn and was unprepared to be a star. She later said her decision ensured career longevity.   Hideous Kinky , a low-budget drama shot before the release of Titanic, was Winslets sole film release of 42  She turned down offers to star in  Shakespeare in Love  and  Anna and the King  to do the film.  Based on the ": null
    },
    {
        "semi-autobiographical novel": "hideous kinky"
    },
    {
        " by ": null
    },
    {
        "Esther Freud": "esther freud"
    },
    {
        ", Hideous Kinky tells the story of a single British mother yearning for a new life in 42s Morocco. Writing for  The New York Times , the critic ": null
    },
    {
        "Janet Maslin": "janet maslin"
    },
    {
        " commended Winslets decision to follow-up Titanic with such an offbeat project, and took note of how well she had captured her characters obliviousness and optimism .     ": null
    },
    {
        "Jane Campion": "jane campion"
    },
    {
        "s psychological drama  Holy Smoke!  featured Winslet as an Australian woman who joins an Indian religious cult. She found the script brave and was challenged by the idea of portraying an unlikable, manipulative woman. She learnt an Australian accent and worked closely with Campion to justify her characters vileness.  The film required her to perform explicit sex scenes with her co-star ": null
    },
    {
        "Harvey Keitel": "harvey keitel"
    },
    {
        ", and featured a scene in which her character appears stark naked and urinates on herself.  David Rooney of  Variety  wrote, Showing the kind of courage few young thesps would be capable of and an extraordinary range from animal cunning to unhinged desperation, holds nothing back.  That same year, she voiced a fairy for the animated film  Faeries ,  and won the ": null
    },
    {
        "Grammy Award for Best Spoken Word Album for Children": "grammy award for best spoken word album for children"
    },
    {
        " for narrating the short story The Face in the Lake for the childrens audiobook Listen to the Storyteller.            In  Quills  , a biopic of the erratic ": null
    },
    {
        "Marquis de Sade": "marquis de sade"
    },
    {
        ", starring ": null
    },
    {
        "Geoffrey Rush": "geoffrey rush"
    },
    {
        " and ": null
    },
    {
        "Joaquin Phoenix": "joaquin phoenix"
    },
    {
        ", Winslet played the supporting part of a sexually repressed laundress working in a mental asylum.   Hailing her as the most daring actress working today , James Greenberg of  Los Angeles  magazine praised Winslet for continuing to explore the bounds of sexual liberation .  She received a SAG Award nomination for Best Supporting Actress.  The following year, she played a fictitious mathematician involved in the cracking of the ": null
    },
    {
        "Enigma ciphers": "enigma machine"
    },
    {
        " in ": null
    },
    {
        "Michael Apted": "michael apted"
    },
    {
        "s espionage thriller  Enigma . Winslets character was vastly expanded from a subsidiary love-interest in the ": null
    },
    {
        "novel": "enigma"
    },
    {
        " it was based on to a prominent code-breaker in the film.  She was pregnant while filming, and to prevent this from showing, she wore corsets under her costume.      The biopic  Iris  featured Winslet and ": null
    },
    {
        "Judi Dench": "judi dench"
    },
    {
        " as the novelist ": null
    },
    {
        "Iris Murdoch": "iris murdoch"
    },
    {
        " at different ages. The director ": null
    },
    {
        "Richard Eyre": "richard eyre"
    },
    {
        " cast the two actresses after finding a correspondence of spirit between them .  Winslet was drawn to the idea of playing an intellectual and zesty female lead, and in research, she read Murdochs novels, studied ": null
    },
    {
        "her husband": "john bayley"
    },
    {
        "s memoir  Elegy for Iris , and watched televised interviews of Murdoch.  The project was filmed over four weeks and allowed Winslet to bring her daughter, who was six months old at the time, on set. Writing for  The Guardian , ": null
    },
    {
        "Martin Amis": "martin amis"
    },
    {
        " commented that the seriousness and steadiness of gaze effectively suggest the dawning amplitude of the Murdoch imagination .  Winslet received her third Oscar nomination for Iris, in addition to BAFTA and Golden Globe nominations for Best Supporting Actress.      Winslets third film release of 42 was the animated film  Christmas Carol: The Movie , based on ": null
    },
    {
        "Charles Dickens": "charles dickens"
    },
    {
        " novel": "a christmas carol"
    },
    {
        ". For the films soundtrack she sang ": null
    },
    {
        "What If": "what if"
    },
    {
        " , which proved to be a commercial hit; she donated her earnings from it to childrens charities.   After a year-long absence from the screen, Winslet starred as a headstrong journalist interviewing a professor on ": null
    },
    {
        "death row": "death row"
    },
    {
        " in the thriller  The Life of David Gale  . She agreed to the project to work with the director ": null
    },
    {
        "Alan Parker": "alan parker"
    },
    {
        ", whom she admired, and believed the film raised pertinent questions about capital punishment.  Mick LaSalle thought the film had muddled the subject and disliked both the film and Winslets performance.      Little Children      To avoid typecasting in historical dramas, Winslet sought out films set in contemporary times.  She found it in the science fiction romance  Eternal Sunshine of the Spotless Mind  , in which she played the neurotic and impetuous Clementine, a woman who decides to erase memories of her ex-boyfriend .   Unlike her previous assignments, the role allowed her to display the quirky side to her personality.  Gondry encouraged Carrey and Winslet to improvise on set, and to keep herself agile she practised kickboxing. Eternal Sunshine of the Spotless Mind proved to be a modest financial success and several critics regarded it as one of the best films of the 42st century.    ": null
    },
    {
        "Peter Travers": "peter travers"
    },
    {
        " of  Rolling Stone  considered it to be a uniquely funny, unpredictably tender and unapologetically twisted romance and thought Winslet was electrifying and bruisingly vulnerable in it.  A journalist for  Premiere  magazine credited her for abandoning her corseted English rose persona , and featured it as the 42st greatest film performance of all time.  Winslet considers it to be a favourite among her roles, and she received Best Actress nominations at the Oscar and BAFTA award ceremonies.   She has said the film marked a turning point in her career and prompted directors to offer her a wide variety of parts.     Winslet was paid £42  million to star in her next release of the year, the drama  Finding Neverland .  It is about the relationship between ": null
    },
    {
        "J. M. Barrie": "j. m. barrie"
    },
    {
        "  and the ": null
    },
    {
        "Llewelyn Davies boys": "llewelyn davies boys"
    },
    {
        ", which inspired Barrie to write ": null
    },
    {
        "Peter Pan": "peter pan"
    },
    {
        "; Winslet played the boys mother, ": null
    },
    {
        "Sylvia": "sylvia llewelyn davies"
    },
    {
        ". Despite her reluctance to star in another period piece, Winslet agreed to the project after empathising with Sylvias love for her children.  ": null
    },
    {
        "Ella Taylor": "ella taylor"
    },
    {
        " of  LA Weekly  found Winslet to be radiant and earthy as ever and ": null
    },
    {
        "CNN": "cnn"
    },
    {
        "s ": null
    },
    {
        "Paul Clinton": "paul clinton"
    },
    {
        " thought she was exceptional in a delicate and finely tuned performance .   She received a second Best Actress nomination at that years BAFTA Award ceremony. With a box office gross of US$42  million, Finding Neverland became her most widely seen film since Titanic.      In 42 Winslet took on a guest role in an episode of the British comedy sitcom  Extras , starring ": null
    },
    {
        "Ricky Gervais": "ricky gervais"
    },
    {
        " and ": null
    },
    {
        "Stephen Merchant": "stephen merchant"
    },
    {
        ". She played a satirical version of herself in itan actress, who in an effort to win an Oscar, takes the role of a nun in a ": null
    },
    {
        "Holocaust": "the holocaust"
    },
    {
        " film.  She received a ": null
    },
    {
        "Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series": "primetime emmy award for outstanding guest actress in a comedy series"
    },
    {
        " nomination.  Within three months of giving birth to her second child, Winslet returned to work on  Romance & Cigarettes , a musical romantic comedy directed by ": null
    },
    {
        "John Turturro": "john turturro"
    },
    {
        ", in which she played Tula, a promiscuous and foulmouthed woman.  The part required her to sing and dance, and it helped her lose weight gained during her pregnancy.  She twisted her ankle while filming one of the dance sequences. ": null
    },
    {
        "Derek Elley": "derek elley"
    },
    {
        " of Variety wrote that despite her limited screen time, Winslet had the showiest role and filthiest one-liners .  Winslet declined an offer from ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        " to star in  Match Point  to spend more time with her children.          Winslet had four film releases in 42 She first appeared in  All the Kings Men , a political thriller set in 42s ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        ", featuring ": null
    },
    {
        "Sean Penn": "sean penn"
    },
    {
        " and ": null
    },
    {
        "Jude Law": "jude law"
    },
    {
        ". She played the supporting part of the love interest to Laws character.  The film received negative reviews for its lack of political insight and narrative cohesiveness, and failed to recoup its US$42  million investment.   Her next release, the drama  Little Children , was better received. Based on ": null
    },
    {
        "the novel of the same name": "little children"
    },
    {
        ", the film tells the story of Sarah Pierce, an unhappy housewife who has an affair with a married neighbour . Winslet was challenged by the role of an uncaring mother, as she did not understand or respect her characters actions.  Scenes requiring her to be hostile towards the child actress playing her daughter proved upsetting for her.  Having given birth to two children, Winslet was anxious about the sex scenes in which she had to be nude; she took on the challenge to present a positive image for women with imperfect bodies. ": null
    },
    {
        "A.  O. Scott": "a. & nbsp;o. scott"
    },
    {
        " of The New York Times wrote that Winslet successfully registers every flicker of Sarahs pride, self-doubt and desire, inspiring a mixture of recognition, pity and concern .  With another Academy Award for Best Actress nomination, Winslet, at 42 became the youngest performer to accrue five Oscar nominations.      After Little Children, Winslet played a part she found more sympathetic in ": null
    },
    {
        "Nancy Meyers": "nancy meyers"
    },
    {
        "s romantic comedy  The Holiday .  She played Iris, a Briton who temporarily ": null
    },
    {
        "exchanges homes": "home exchange"
    },
    {
        " with an American  during the Christmas holiday season. The film became Winslets biggest commercial success in nine years, grossing over US$42  million worldwide.  The critic ": null
    },
    {
        "Justin Chang": "justin chang"
    },
    {
        " thought the film was formulaic yet pleasing, and took note of Winslets radiance and charm.  In her final release of the year, Winslet voiced Rita, a scavenging sewer rat, in the animated film  Flushed Away .  Winslets sole project of 42 was as the narrator for the English version of the French childrens film  The Fox and the Child .          Winslet had two critically acclaimed roles in 42  After reading ": null
    },
    {
        "Justin Haythe": "justin haythe"
    },
    {
        "s screenplay for  Revolutionary Road , an adaptation of ": null
    },
    {
        "Richard Yates": "richard yates"
    },
    {
        "s ": null
    },
    {
        "debut novel": "revolutionary road"
    },
    {
        ", Winslet recommended the project to her husband at the time, the director ": null
    },
    {
        "Sam Mendes": "sam mendes"
    },
    {
        ", and her Titanic co-star Leonardo DiCaprio.  The film traces the tribulations of a young married couple in 42s suburban America. Winslet was attracted to the idea of playing a woman whose aspirations had not been met,  and she read  The Feminine Mystique  to understand the psychology of unhappy housewives from the era. Mendes encouraged DiCaprio and Winslet to spend time together, and she believed the small set they used helped them to develop their characters strained relationship. Hailing Winslet as the best English-speaking film actress of her generation , ": null
    },
    {
        "David Edelstein": "david edelstein"
    },
    {
        " of  New York  magazine wrote that there isnt a banal moment in Winslets performance—not a gesture, not a word .           To avoid a scheduling conflict with Revolutionary Road, Winslet turned down an offer to star in  The Reader . After her replacement ": null
    },
    {
        "Nicole Kidman": "nicole kidman"
    },
    {
        " left the project due to her pregnancy, Winslet was signed to it.  Directed by ": null
    },
    {
        "Stephen Daldry": "stephen daldry"
    },
    {
        ", The Reader is based on ": null
    },
    {
        "Bernhard Schlink": "bernhard schlink"
    },
    {
        "s novel  Der Vorleser  and is about Hanna Schmitz, an illiterate ": null
    },
    {
        "Nazi": "nazi"
    },
    {
        " concentration camp": "concentration camp"
    },
    {
        " guard , who has an affair with a teenage boy. Winslet researched the Holocaust and the ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        " guards. To educate herself on the stigma of illiteracy, she spent time with students at the Literacy Partners, an organisation that teaches adults to read and write. Winslet was unable to sympathise with Schmitz and struggled to play the part honestly without humanising her actions.  Despite this, some historians criticised the film for making Schmitz an object of the audiences sympathy and accused the filmmakers of ": null
    },
    {
        "Holocaust revisionism": "holocaust revisionism"
    },
    {
        ".  ": null
    },
    {
        "Todd McCarthy": "todd mccarthy"
    },
    {
        " commended her for supplying a haunting shell to this internally decimated woman , and writing for  The Daily Telegraph , Sukhdev Sandhu considered her to be absolutely fearless here, not just in her willingness to expose herself physically, but her refusal to expose her character psychologically .       Winslet received significant awards attention for her performances in Revolutionary Road and The Reader.  She won a Golden Globe Award for each of these films, and for the latter, she was awarded the Academy Award and ": null
    },
    {
        "BAFTA Award for Best Actress": "bafta award for best actress in a leading role"
    },
    {
        ". At age 42 she surpassed her own record as the youngest performer to garner six Oscar nominations. She also became the third actress in history to win two Golden Globe Awards at the same ceremony.  Exhausted by the media attention during this period, Winslet took two years off work until she was ready to creatively engage again.      Winslet returned to acting with the five-part ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " miniseries  Mildred Pierce  , an adaptation of ": null
    },
    {
        "James M. Cains novel": "mildred pierce"
    },
    {
        " from the director ": null
    },
    {
        "Todd Haynes": "todd haynes"
    },
    {
        ". It is about the titular heroine , a divorcée during the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " struggling to establish a restaurant business while yearning for the respect of her narcissistic daughter . Winslet, who had recently divorced Mendes, believed certain aspects of her characters life mirrored her own. She was intimidated by the scope of the production, as she featured in every scene of the 42-page script.  She was disturbed and upset by the story, and was particularly fascinated by the complex relationship between the mother-daughter pair.  She collaborated closely with the production and costume designers, and learnt to bake pies and prepare chickens. The broadcast received a limited audience but gained positive reviews.   ": null
    },
    {
        "Matt Zoller Seitz": "matt zoller seitz"
    },
    {
        " of ": null
    },
    {
        "Salon": "salon"
    },
    {
        " called the series a quiet, heartbreaking masterpiece and described Winslets performance as terrific—intelligent, focused and seemingly devoid of ego .  She received the ": null
    },
    {
        "Primetime Emmy Award for Outstanding Lead Actress": "primetime emmy award for outstanding lead actress in a limited series or movie"
    },
    {
        ", in addition to ": null
    },
    {
        "Golden Globe": "golden globe award for best actress – miniseries or television film"
    },
    {
        " and ": null
    },
    {
        "SAG Award": "screen actors guild award for outstanding performance by a female actor in a miniseries or television movie"
    },
    {
        " wins.        The ensemble thriller  Contagion  from ": null
    },
    {
        "Steven Soderbergh": "steven soderbergh"
    },
    {
        " was Winslets first film release of 42 She was cast as a disease detective for the ": null
    },
    {
        "CDC": "centers for disease control and prevention"
    },
    {
        ", and she modelled her role on ": null
    },
    {
        "Anne Schuchat": "anne schuchat"
    },
    {
        ", the director of the ": null
    },
    {
        "NCIRD": "national center for immunization and respiratory diseases"
    },
    {
        ".  Contagion was a commercial success, and ": null
    },
    {
        "David Denby": "david denby"
    },
    {
        " of  The New Yorker  praised Winslet for capturing the essence of an exasperated woman.   Her next project was the ": null
    },
    {
        "Roman Polanski": "roman polanski"
    },
    {
        "-directed  Carnage , adapted from the play  God of Carnage  by ": null
    },
    {
        "Yasmina Reza": "yasmina reza"
    },
    {
        ". Set entirely inside an apartment, the ": null
    },
    {
        "black comedy": "black comedy"
    },
    {
        " follows two sets of parents feuding over their respective children. ": null
    },
    {
        "Jodie Foster": "jodie foster"
    },
    {
        ", ": null
    },
    {
        "John C. Reilly": "john c. reilly"
    },
    {
        ", and ": null
    },
    {
        "Christoph Waltz": "christoph waltz"
    },
    {
        " co-starred. The cast rehearsed the script like a play for two weeks, and Winslet brought her children with her to Paris for the eight weeks of filming.   Critics found the adaptation to be less compelling than the play, but praised Foster and Winslets work.  They both received Golden Globe nominations for it.      Steve Jobs      Winslet said her workload in 42 helped her get over heartbreak from her divorce, and after finishing work on Carnage she took a break from acting to focus on her children. A short part that she had filmed four years earlier for the anthology film  Movie 42  was her sole screen appearance of 42 and it received the worst reviews of her career.   Winslet also performed an audiobook recording of ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        "s novel  Thérèse Raquin .   She was reluctant to accept ": null
    },
    {
        "Jason Reitman": "jason reitman"
    },
    {
        "s offer to star in his 42 ": null
    },
    {
        "film adaptation": "labor day"
    },
    {
        " of ": null
    },
    {
        "Joyce Maynard": "joyce maynard"
    },
    {
        "s novel  Labor Day , but agreed after Reitman postponed the production for a year to accommodate Winslets commitment to her children. Set over a ": null
    },
    {
        "Labor Day": "labor day"
    },
    {
        " weekend, it tells the story of Adele , an ": null
    },
    {
        "agoraphobic": "agoraphobic"
    },
    {
        " single mother, who falls in love with an escaped convict. Describing Adeles character as having more vulnerability than strength , Winslet found her to be a departure from the strong-willed women she typically played. A scene in the film required her to make a pie, for which she drew on her baking experience from Mildred Pierce.  Critical reception for the film was negative, but it earned Winslet her tenth Golden Globe nomination.   Chris Nashawaty of  Entertainment Weekly  criticised it as mawkish and melodramatic but commended Winslet for adding layers to her passive role.      The novelty of playing a villainous part drew Winslet to ": null
    },
    {
        "Jeanine Matthews": "list of the divergent trilogy charactersjeanine matthews"
    },
    {
        " in the science fiction film  Divergent  .   Set in a dystopian future, the adaptation of ": null
    },
    {
        "Veronica Roth": "veronica roth"
    },
    {
        "s young adult ": null
    },
    {
        "novel": "divergent"
    },
    {
        " stars ": null
    },
    {
        "Shailene Woodley": "shailene woodley"
    },
    {
        " as a heroine fighting an oppressive regime headed by Winslets character. Winslet was pregnant with her third child while filming, and her tight-fitting costumes had to be altered to accommodate the pregnancy. To maintain her characters intimidating persona, Winslet remained aloof from her co-stars for much of the filming. Richard Lawson of  Vanity Fair  compared the film unfavourably to the ": null
    },
    {
        "Hunger Games film series": "the hunger games"
    },
    {
        ", and thought Winslet was underutilised in it.  The film earned US$42  million worldwide.   A Little Chaos  marked Winslets return to the period film genre.  Directed by ": null
    },
    {
        "Alan Rickman": "alan rickman"
    },
    {
        ", it is about a rivalry among gardeners commissioned to create a fountain at the ": null
    },
    {
        "Palace of Versailles": "palace of versailles"
    },
    {
        ". Winslets role was that of the fictitious architect Sabine de Barra, someone she believed had overcome extreme grief and hardship like herself. Catherine Shoard of The Guardian took note of the emotional honesty Winslet brought to her part, but criticised the implausibility of her role.  Also that year, she read audiobooks of ": null
    },
    {
        "Roald Dahl": "roald dahl"
    },
    {
        "s childrens novels  Matilda  and  The Magic Finger .       In 42 Winslet reprised the role of Jeanine Matthews in the second instalment of the ": null
    },
    {
        "Divergent series": "the divergent series"
    },
    {
        ", subtitled  Insurgent , which despite negative reviews earned US$42  million worldwide.   Her next film, an ": null
    },
    {
        "adaptation": "the dressmaker"
    },
    {
        " of the Australian gothic novel  The Dressmaker , was described by the director ": null
    },
    {
        "Jocelyn Moorhouse": "jocelyn moorhouse"
    },
    {
        " as being reminiscent of the western  Unforgiven  .  Winslet starred as the ": null
    },
    {
        "femme fatale": "femme fatale"
    },
    {
        " Tilly Dunnage, a seamstress who returns to her hometown years after she was accused of murder. She learned to sew for the part and designed some of her own costumes. The production was filmed in the Australian desert and Winslet found it difficult to wear couture dresses in the harsh weather.  Despite disliking the film, Robert Abele of Los Angeles Times commended Winslet for underplaying her over-the-top part.  The film emerged as one of the ": null
    },
    {
        "highest-grossing Australian films": "cinema of australiahighest-grossing australian films"
    },
    {
        " of all time, but earned little elsewhere.   Winslet won an ": null
    },
    {
        "AACTA Award": "aacta award"
    },
    {
        " for ": null
    },
    {
        "Best Actress": "aacta award for best actress in a leading role"
    },
    {
        ".           While filming The Dressmaker, Winslet became aware of an upcoming biopic of ": null
    },
    {
        "Steve Jobs": "steve jobs"
    },
    {
        " by ": null
    },
    {
        "Aaron Sorkin": "aaron sorkin"
    },
    {
        " and directed by ": null
    },
    {
        "Danny Boyle": "danny boyle"
    },
    {
        ". Keen to play Jobs marketing chief and confidant ": null
    },
    {
        "Joanna Hoffman": "joanna hoffman"
    },
    {
        ", she sent a picture of herself dressed as Hoffman to the films producer.   Steve Jobs , starring ": null
    },
    {
        "Michael Fassbender": "michael fassbender"
    },
    {
        " in the title role, is told in three acts, each depicting a key milestone in Jobs career. In preparation, Winslet spent time with Hoffman, and worked with a dialect coach to adopt Hoffmans accent, a mixture of Armenian and Polish, which she considered to be the most difficult of her career. The cast rehearsed each act like a play and filmed it in sequence. Winslet collaborated closely with Fassbender, and their off-screen relationship mirrored the collegial dynamic between Jobs and Hoffman. The film received some of the best reviews of Winslets career but was a box office flop.   Peter Howell of the  Toronto Star  commended her for finding strength and grace in her part, and Gregory Ellwood of ": null
    },
    {
        "HitFix": "hitfix"
    },
    {
        " thought she had improved on Hoffmans characterisation.   She won Golden Globe and BAFTA Awards for Best Supporting Actress, and received her seventh Oscar nomination for it.        ": null
    },
    {
        "John Hillcoat": "john hillcoat"
    },
    {
        "s ensemble crime-thriller  Triple 42  featured Winslet as Irina Vlaslov, a ruthless Russian-Israeli gangster.  The critic Ann Hornaday of The Washington Post felt Winslet had failed to effectively portray her.   Her next release of the year,  Collateral Beauty , about a man  struggling with the death of his daughter, was panned by critics.  Writing for New York magazine, Emily Yoshida criticised it as a vacuous remake of A Christmas Carol and wrote that Winslet had never looked more painted and tired .  It was a modest earner at the box office.  Winslet agreed to the romantic disaster film  The Mountain Between Us  to take on the challenge of a role requiring physical exertion.   It featured ": null
    },
    {
        "Idris Elba": "idris elba"
    },
    {
        " and her as two strangers who crash land on an icy and isolated mountain range. They filmed in the mountains of Western Canada at 42 feet above sea level where the temperature was well below freezing. Winslet performed her own stunts and described it as the most physically gruelling experience of her career.   The Atlantic s Megan Garber praised the chemistry between Elba and Winslet, and Moira Macdonald of  The Seattle Times  thought their charisma had enhanced a mediocre picture.       Woody Allens  Wonder Wheel , a drama set in 42s ": null
    },
    {
        "Coney Island": "coney island"
    },
    {
        ", was Winslets final release of 42 She played Ginny, a temperamental housewife having an affair with a lifeguard . She described Ginny as permanently dissatisfied and uneasy, and playing her proved difficult for Winslet, who suffered from anxiety.  ": null
    },
    {
        "Manohla Dargis": "manohla dargis"
    },
    {
        " of The New York Times disliked Allens writing but credited Winslet for filling her shabby character with feverish life .  When asked about her decision to work with Allen despite an allegation of ": null
    },
    {
        "child sexual abuse": "woody allen sexual assault allegation"
    },
    {
        " against him, Winslet chose not to comment on Allens personal life but said she was pleased with the collaboration. In 42 Winslet provided her voice to  Moominvalley , an animated television series about the ": null
    },
    {
        "Moomins": "moomins"
    },
    {
        ".  She next took on a leading role alongside ": null
    },
    {
        "Susan Sarandon": "susan sarandon"
    },
    {
        " and ": null
    },
    {
        "Mia Wasikowska": "mia wasikowska"
    },
    {
        " in  Blackbird , a remake of the Danish film  Silent Heart  . Benjamin Lee of The Guardian bemoaned that she had been miscast as an uptight woman.          Winslet will next appear alongside an ensemble cast in ": null
    },
    {
        "Wes Anderson": "wes anderson"
    },
    {
        "s drama  The French Dispatch .  She will return to HBO to star in and executive produce  Mare of Easttown , a limited series about a troubled police detective, and will portray ": null
    },
    {
        "Mary Anning": "mary anning"
    },
    {
        " in  Ammonite , co-starring ": null
    },
    {
        "Saoirse Ronan": "saoirse ronan"
    },
    {
        ", which is about a romance between Anning and ": null
    },
    {
        "Charlotte Murchison": "charlotte murchison"
    },
    {
        " in 42s England.    Avatar 42 , a science fiction sequel to James Camerons ": null
    },
    {
        "42 film": "avatar"
    },
    {
        ", which required Winslet to work with ": null
    },
    {
        "motion capture": "motion capture"
    },
    {
        " technology, will follow next. She learned ": null
    },
    {
        "freediving": "freediving"
    },
    {
        " for her part and was able to hold her breath underwater for seven minutes.   She has also committed to portray the model and photographer ": null
    },
    {
        "Lee Miller": "lee miller"
    },
    {
        " in an upcoming biopic and to voice the titular horse in an adaptation of the novel  Black Beauty .           Winslet supports several charities and causes. An orange top she wore in Eternal Sunshine of the Spotless Mind was auctioned in 42 for a fund-raising event at ": null
    },
    {
        "Helen & Douglas House": "helen  &  douglas house"
    },
    {
        ", a hospice in Oxford.  In 42 she became a patron of a ": null
    },
    {
        "Gloucester": "gloucester"
    },
    {
        "-based charity, the Family Haven, which provides counselling services to vulnerable families.  The same year, hand-made envelopes designed by Winslet were auctioned for the Pushing the Envelope campaign created by the ": null
    },
    {
        "National Literacy Trust": "national literacy trust"
    },
    {
        ".  Winslet was one of the celebrities to participate in a 42 auction to raise funds for the ": null
    },
    {
        "Afghanistan Relief Organization": "afghanistan relief organization"
    },
    {
        ".  In 42 she contributed to the Butterfly Book, a compilation of doodles made by several celebrities, to raise money for leukaemia research.           In 42 Winslet narrated the English version of an Icelandic documentary named A Mothers Courage: Talking Back to Autism, about Margret Ericsdottir, whose child Keli Thorsteinsson has non-verbal ": null
    },
    {
        "autism": "autism"
    },
    {
        ". Inspired by the story, she teamed with Ericsdottir in 42 to form an NGO named the ": null
    },
    {
        "Golden Hat Foundation": "golden hat foundation"
    },
    {
        ".  The organisation aims to create ": null
    },
    {
        "autism awareness": "autism awareness"
    },
    {
        " and was named after a poem written by Thorsteinsson.   As the brand ambassador of the luxury brands ": null
    },
    {
        "Lancôme": "lancôme"
    },
    {
        " and ": null
    },
    {
        "Longines": "longines"
    },
    {
        ", Winslet partnered with these companies to raise awareness and funds for the foundation. She created a make-up collection for Lancôme in 42 and, in 42 she designed a new watch for Longines.       In 42 Winslet wrote a book about autism, entitled The Golden Hat: Talking Back to Autism, which was published by ": null
    },
    {
        "Simon & Schuster": "simon  &  schuster"
    },
    {
        ". It contains correspondence between Winslet and Ericsdottir, personal statements from various celebrities, and contributions from Thorsteinsson.  A reviewer for  Publishers Weekly  praised the book for its warmth and sincerity .  The ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " featured the book during a ceremony on the ": null
    },
    {
        "World Autism Awareness Day": "world autism awareness day"
    },
    {
        " of 42  For her work with the Golden Hat Foundation, Winslet received Spains Yo Dona award for Best Humanitarian Work.      Winslet narrated a video for ": null
    },
    {
        "PETA": "people for the ethical treatment of animals"
    },
    {
        " in 42 that showed animal cruelty in the production of ": null
    },
    {
        "foie gras": "foie gras"
    },
    {
        ".  She encouraged chefs to remove the item from their menu and urged consumers to boycott it.  In 42 Winslet lent her support to the ": null
    },
    {
        "UNICEF": "unicef"
    },
    {
        " campaign Worlds Largest Lesson, which creates awareness among children about ": null
    },
    {
        "sustainable development": "sustainable development"
    },
    {
        " and ": null
    },
    {
        "global citizenship": "global citizenship"
    },
    {
        ".  Teased as a child for her weight, Winslet takes a stand against body-shaming and bullying.  She narrated an Australian animated short film named Daisy Chain , about a victim of cyber-bullying.  In 42 Winslet teamed with Leonardo DiCaprios environmental foundation for a fundraiser on global warming.  Also that year, DiCaprio and Winslet auctioned a private dinner with themselves to raise money for a British womans cancer treatment.  Winslet teamed with Lancôme and the National Literacy Trust in 42 to launch a programme that aims to educate underprivileged women in the UK.             While filming Dark Season, Winslet, aged 42 began a romantic relationship with the actor-writer ": null
    },
    {
        "Stephen Tredre": "stephen tredre"
    },
    {
        ", then aged 42  She considered him to be a major influence in her life and lived with him in London.  The couple separated in 42 but they remained close until he died of ": null
    },
    {
        "bone cancer": "bone cancer"
    },
    {
        " two years later.  Winslet missed the premiere of Titanic to attend his funeral.  In a 42 interview, she said she has never got over his death.          A year after Tredres death, Winslet met ": null
    },
    {
        "Jim Threapleton": "jim threapleton"
    },
    {
        " on the set of  Hideous Kinky , in which he was an assistant director. They married in November 42 at her primary school in Reading, and she gave birth to their daughter, Mia, in 42  Describing her marriage to Threapleton as a mess , she later said she had lost control of her instincts during this period. They divorced in 42   Soon after separating from Threapleton, Winslet met the director ": null
    },
    {
        "Sam Mendes": "sam mendes"
    },
    {
        " when he offered her a part in a play. She refused the offer but began dating him.  Disillusioned by the way the British tabloids portrayed her personal life, Winslet moved to New York. She wed Mendes in May 42 on the island of ": null
    },
    {
        "Anguilla": "anguilla"
    },
    {
        ".  Their son, Joe, was born later that year. The family divided their time in New York with frequent visits to their estate in the ": null
    },
    {
        "Cotswolds": "cotswolds"
    },
    {
        " in England. Amid intense media speculation of an affair between Mendes and the actress ": null
    },
    {
        "Rebecca Hall": "rebecca hall"
    },
    {
        ", the couple announced their separation in 42 and were divorced a year later.  Winslet admitted to being heartbroken by the split, but affirmed her determination to look after her children in spite of her marital breakups.      While holidaying at ": null
    },
    {
        "Richard Branson": "richard branson"
    },
    {
        "s estate on ": null
    },
    {
        "Necker Island": "necker island"
    },
    {
        " in 42 Winslet met her third husband, Edward Abel Smith , during a house fire.  The couple married in New York in December 42 and their son, Bear, was born the next year.   After moving back to England, Winslet purchased a property worth £42  million by the sea in ": null
    },
    {
        "West Wittering": "west wittering"
    },
    {
        ", Sussex, where  she lives with Smith and her children.  In a 42 interview, she described how much she enjoyed living in the countryside.     Winslet has said that despite her three marriages, and a family structure that might be perceived as unconventional by some, she does not consider it to be any less of a family . She refuses jobs that take her away from her children for long, and likes to schedule her film commitments to coincide with their school holidays. Discussing her parenting style, Winslet remarked that she enjoys packing lunches and doing the school run.             Several journalists consider Winslet to be among the best actresses of her generation.   Despite achieving stardom early in her career with the top-grossing Titanic, Winslet has rarely acted in commerce-driven pictures.  A journalist for Elle believes her choices reflect the soul and attitude of a jobbing actress, trapped in the body of a movie star .  ": null
    },
    {
        "Tom Perrotta": "tom perrotta"
    },
    {
        ", the author of Little Children, has said that Winslet gravitates toward troubling roles in smaller films , typically those of thorny, potentially unsympathetic women.  The journalist ": null
    },
    {
        "Mark Harris": "mark harris"
    },
    {
        " writes that she specialises in unsentimentalized, restless, troubled, discontented, disconcerted, difficult women and John Hiscock of The Daily Telegraph has identified a theme of characters who are free-spirited with a sexual edge to them. Stephen Whitty of ": null
    },
    {
        "NJ.com": "nj.com"
    },
    {
        " associates Winslet with serious, almost despairing material , although he finds it hard to pigeonhole her as an actress.          Leonardo DiCaprio, who starred with Winslet in Titanic and Revolutionary Road, considers her to be the most prepared and well-researched actor on set , and Jude Law, her co-star in The Holiday, believes that despite her seriousness she remains very calm and good-natured .  Her Steve Jobs director Danny Boyle has identified a willingness in Winslet to avoid typecasting and has said that she takes an effort to reposition directors and producers perspective on her to allow herself to be challenged as an artist.     Winslet has said she is interested in parts of angst-ridden women with strong dispositions masking flaws and insecurities. She connects with women who are either finding their way out of a situation, looking for love, having some struggle within love, or questioning the big things in life . Drawn to parts that are in tandem with her personal struggles at certain points in her life, she finds it difficult to detach herself from her roles, saying that you have to confront your true feelings every single day. And thats pretty exhausting. Then you have to go home and make dinner . Even so, she finds it therapeutic to perform. Winslet is known for her willingness to perform nude scenes, having done so in 42 of her films, although she considers its contribution to the narrative before agreeing to it.  She believes these scenes promote a positive body image among women.         In a 42 article for  Elle , Sally Holmes described Winslets ability to establish rapport with her manner.  Jo Ellison of Vogue writes that she has an authoritative, almost ambassadorial aura , and ": null
    },
    {
        "Kira Cochrane": "kira cochrane"
    },
    {
        " of The Guardian considers her to be articulate, sophisticated, a definite hint of grandeur . Describing Winslet as plain-spoken, Krista Smith of Vanity Fair believes that despite her stardom she is unpretentious.          Winslets weight fluctuations over the years have been well documented by the media.  She has been outspoken about her refusal to allow Hollywood to dictate her weight. In 42 the British edition of  GQ  magazine published photographs of Winslet which had been digitally altered to make her look taller and thinner.  Winslet said the alterations were made without her consent.  GQ subsequently issued an apology.  In 42 she won a defamation case against  Grazia  magazine after it claimed she had visited a dietitian.  She claimed £42 in damages, and donated the amount to an eating disorder charity.  She won another case in 42 against the British tabloid  Daily Mail  after it claimed she had lied about her exercise regimen.  She received an apology and a payout of £42.     Winslet was named one of the most beautiful people in the world by  People  magazine in 42  Her beauty and sex appeal have been picked up by several other publications, including  Harpers Bazaar ,  Who , and Empire magazines.    She has said that she does not subscribe to the beauty ideal of Hollywood, and uses her celebrity to empower women to accept their appearance with pride.  She has spoken against ": null
    },
    {
        "Botox": "botox"
    },
    {
        " and ": null
    },
    {
        "plastic surgery": "plastic surgery"
    },
    {
        ".  In an effort to encourage natural ageing, she formed the British Anti-Cosmetic Surgery League, alongside the actresses Emma Thompson and ": null
    },
    {
        "Rachel Weisz": "rachel weisz"
    },
    {
        ".  She instructs magazines and brands not to digitally smooth her wrinkles in photographs.   Winslet is reluctant to discuss the ": null
    },
    {
        "gender pay gap": "gender pay gap"
    },
    {
        " in Hollywood as she dislikes talking about her salary in public.  In 42  Forbes  reported her annual salary to be US$42  million, a majority of that stemming from her endorsement deals.  Also that year, the ": null
    },
    {
        "UK Film Council": "uk film council"
    },
    {
        " calculated that she had earned £42  million from her acting roles since 42       Time  magazine named Winslet one of the ": null
    },
    {
        "42 most influential people in the world": "time 100"
    },
    {
        " in 42  ": null
    },
    {
        "Madame Tussauds": "madame tussauds"
    },
    {
        " in London unveiled a wax statue of Winslet in 42  The following year, she received an ": null
    },
    {
        "Honorary César": "honorary césar"
    },
    {
        " award, and in 42 she received a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ".   Winslet was appointed ": null
    },
    {
        "Commander of the Order of the British Empire": "commander of the order of the british empire"
    },
    {
        " in the ": null
    },
    {
        "42 Birthday Honours": "2012 birthday honours"
    },
    {
        " for her services to drama.             Prolific in film since 42 Winslets most acclaimed and highest-grossing films, according to the online portal ": null
    },
    {
        "Box Office Mojo": "box office mojo"
    },
    {
        " and the review aggregate site ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    },
    {
        ", include  Heavenly Creatures  ,  Sense and Sensibility  ,  Hamlet  ,  Titanic  ,  Eternal Sunshine of the Spotless Mind  ,  The Holiday  ,  Divergent  ,  Insurgent  , and  Steve Jobs  . Her television projects include the miniseries  Mildred Pierce  .     Winslet has been recognised by the ": null
    },
    {
        "Academy of Motion Picture Arts and Sciences": "academy of motion picture arts and sciences"
    },
    {
        " for the following performances:    ": null
    },
    {
        "42th Academy Awards": "68th academy awards"
    },
    {
        ": ": null
    },
    {
        "Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        ", nomination, for Sense and Sensibility   ": null
    },
    {
        "42th Academy Awards": "70th academy awards"
    },
    {
        ": ": null
    },
    {
        "Best Actress": "academy award for best actress"
    },
    {
        ", nomination, for Titanic   ": null
    },
    {
        "42th Academy Awards": "74th academy awards"
    },
    {
        ": Best Supporting Actress, nomination, for  Iris    ": null
    },
    {
        "42th Academy Awards": "77th academy awards"
    },
    {
        ": Best Actress, nomination, for Eternal Sunshine of the Spotless Mind   ": null
    },
    {
        "42th Academy Awards": "79th academy awards"
    },
    {
        ": Best Actress, nomination, for  Little Children    ": null
    },
    {
        "42st Academy Awards": "81st academy awards"
    },
    {
        ": Best Actress, win, for  The Reader    ": null
    },
    {
        "42th Academy Awards": "88th academy awards"
    },
    {
        ": Best Supporting Actress, nomination, for Steve Jobs     Winslet has won three ": null
    },
    {
        "BAFTA Awards": "british academy film awards"
    },
    {
        ": ": null
    },
    {
        "Best Actress": "bafta award for best actress in a leading role"
    },
    {
        " for The Reader ; and ": null
    },
    {
        "Best Supporting Actress": "bafta award for best actress in a supporting role"
    },
    {
        " for Sense and Sensibility and Steve Jobs . She has also won the ": null
    },
    {
        "Primetime Emmy Award for Outstanding Lead Actress in a Miniseries": "primetime emmy award for outstanding lead actress in a limited series or movie"
    },
    {
        " for Mildred Pierce , and the ": null
    },
    {
        "Grammy Award for Best Spoken Word Album for Children": "grammy award for best spoken word album for children"
    },
    {
        " for narrating the childrens audiobook Listen to the Storyteller . She is among the few actresses to have won three of the four major American entertainment awards .  ": null
    }
]