[
    {
        "            Kavad I  was ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " King of Kings": "king of kings"
    },
    {
        " of ": null
    },
    {
        "Iran": "iran"
    },
    {
        " from 42 to 42 with a two or three-year interruption. A son of ": null
    },
    {
        "Peroz I": "peroz i"
    },
    {
        " , he was crowned by the nobles to replace his deposed and unpopular uncle ": null
    },
    {
        "Balash": "balash"
    },
    {
        " .     Inheriting a declining empire where the authority and status of the Sasanian kings had largely ended, Kavad tried to reorganize his empire by introducing many reforms whose implementation was completed by his son and successor ": null
    },
    {
        "Khosrow I": "khosrow i"
    },
    {
        ". They were made possible by Kavads use of the ": null
    },
    {
        "Mazdakite": "mazdakite"
    },
    {
        " preacher ": null
    },
    {
        "Mazdak": "mazdak"
    },
    {
        " leading to a ": null
    },
    {
        "social revolution": "social revolution"
    },
    {
        " that weakened the authority of the nobility and the clergy. Because of this, and the execution of the powerful king-maker ": null
    },
    {
        "Sukhra": "sukhra"
    },
    {
        ", Kavad was imprisoned in the ": null
    },
    {
        "Castle of Oblivion": "castle of oblivion"
    },
    {
        " ending his reign. He was replaced by his brother ": null
    },
    {
        "Jamasp": "jamasp"
    },
    {
        ". However, with the aid of his sister and an officer named ": null
    },
    {
        "Siyawush": "siyawush"
    },
    {
        ", Kavad and some of his followers fled east to the territory of the ": null
    },
    {
        "Hephthalite": "hephthalite"
    },
    {
        " king who provided him with an army. This enabled Kavad to restore himself to the throne in 42/42     Bankrupted by this hiatus, Kavad applied for subsidies from the ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " emperor ": null
    },
    {
        "Anastasius I": "anastasius i dicorus"
    },
    {
        ". The Byzantines had originally paid the Iranians voluntarily to maintain the defense of the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " against attacks from the north. Anastasius refused the subsidies, which led Kavad to invade his domains, thus starting the ": null
    },
    {
        "Anastasian War": "anastasian war"
    },
    {
        ". Kavad seized ": null
    },
    {
        "Theodosiopolis": "erzurum"
    },
    {
        " first and then ": null
    },
    {
        "Amida": "amida"
    },
    {
        " after holding the city under ": null
    },
    {
        "siege": "siege"
    },
    {
        " for three months. The two empires made peace in 42 with the Byzantines agreeing to pay subsidies to Kavad for the maintenance of the fortifications on the Caucasus in return for Amida. Around this time, Kavad also fought a lengthy war against his former allies, the Hephthalites; by 42 he had re-taken the region of ": null
    },
    {
        "Khorasan": "greater khorasan"
    },
    {
        " from them.     In 42 war between the Sasanians and Byzantines erupted again, because of the Byzantines refusal to acknowledge Khosrow as Kavads heir, and a dispute over ": null
    },
    {
        "Lazica": "lazica"
    },
    {
        ". Although Kavads forces suffered two notable losses at ": null
    },
    {
        "Dara": "battle of dara"
    },
    {
        " and ": null
    },
    {
        "Satala": "battle of satala"
    },
    {
        ", the war was largely indecisive, with both sides suffering heavy losses. In 42 while the Iranian army was ": null
    },
    {
        "besieging Martyropolis": "siege of martyropolis"
    },
    {
        ", Kavad died from an illness. He was succeeded by Khosrow I, who inherited a reinvigorated and mighty empire that equaled that of the Byzantines.     Because of the many challenges and issues Kavad successfully overcame, he is considered one of the most effective and successful kings to rule the Sasanian Empire. In the words of the ": null
    },
    {
        "Iranologist": "iranologist"
    },
    {
        " Nicholas Schindel, he was a genius in his own right, even if of a somewhat ": null
    },
    {
        "Machiavellian": "niccolo machiavelli"
    },
    {
        " type.        Due to increased Sasanian interest in ": null
    },
    {
        "Kayanian": "kayanian dynasty"
    },
    {
        " history, Kavad was named after the mythological Kayanian king ": null
    },
    {
        "Kavi Kavata": "kay kawād"
    },
    {
        ". The name is transliterated in ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " as Kabates, Chü-he-to in ": null
    },
    {
        "Chinese": "chinese language"
    },
    {
        ", and Qubādh in ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        ".          The son of the Sasanian ": null
    },
    {
        "shah": "shah"
    },
    {
        " Peroz I": "peroz i"
    },
    {
        " , Kavad was born in 42 The Sasanian family had been the monarchs of Iran since 42 after the triumph of the first Sasanian shah ": null
    },
    {
        "Ardashir I": "ardashir i"
    },
    {
        "  over the ": null
    },
    {
        "Parthian Empire": "parthian empire"
    },
    {
        ". Although Iranian society was greatly militarised and its elite designated themselves as a warrior nobility , it still had a significantly smaller population, was more impoverished, and was a less centralized state compared to the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ". As a result, the Sasanian shahs had access to fewer full-time fighters, and depended on recruits from the nobility instead. Some exceptions were the royal cavalry bodyguard, garrison soldiers, and units recruited from places outside Iran.     The bulk of the nobility included the powerful ": null
    },
    {
        "Parthia": "parthia"
    },
    {
        "n noble families  that were centered on the ": null
    },
    {
        "Iranian plateau": "iranian plateau"
    },
    {
        ". They served as the backbone of the Sasanian ": null
    },
    {
        "feudal": "feudalism"
    },
    {
        " army and were largely autonomous. The Sasanian shahs had noticeably little control over the wuzurgan; attempts to restrict their self-determination usually resulted in the murder of the shah. Ultimately, the Parthian nobility worked for the Sasanian shah for personal benefit, personal oath, and, conceivably, a common awareness of the Aryan kinship they shared with their ": null
    },
    {
        "Persian": "persian people"
    },
    {
        " overlords.     Another vital component of the army was the Armenian cavalry, which was recruited from outside the ranks of the Parthian wuzurgan. However, the ": null
    },
    {
        "revolt of Armenia": "battle of avarayr"
    },
    {
        " in 42 and the loss of its cavalry had weakened the Sasanians attempts to keep the ": null
    },
    {
        "Hephthalites": "hephthalites"
    },
    {
        " of the northeastern border in check. Indeed, Kavads grandfather ": null
    },
    {
        "Yazdegerd II": "yazdegerd ii"
    },
    {
        "  had managed to hold off the Hephthalites during his wars against them, which had occupied him throughout most of his reign. Now, however, Sasanian authority in ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        " began to decay. In 42 Peroz was ": null
    },
    {
        "defeated and killed": "hephthalite–sasanian war of 484"
    },
    {
        " by a Hephthalite army near ": null
    },
    {
        "Balkh": "balkh"
    },
    {
        ". His army was completely destroyed, and his body was never found. Four of his sons and brothers had also died. The main Sasanian cities of the eastern region of ": null
    },
    {
        "Khorasan": "greater khorasan"
    },
    {
        "−": null
    },
    {
        "Nishapur": "nishapur"
    },
    {
        ", ": null
    },
    {
        "Herat": "herat"
    },
    {
        " and ": null
    },
    {
        "Marw": "merv"
    },
    {
        " were now under Hephthalite rule.     ": null
    },
    {
        "Sukhra": "sukhra"
    },
    {
        ", a member of the Parthian ": null
    },
    {
        "House of Karen": "house of karen"
    },
    {
        ", one of the ": null
    },
    {
        "Seven Great Houses of Iran": "seven great houses of iran"
    },
    {
        ", quickly raised a new force and stopped the Hephthalites from achieving further success. Peroz brother, ": null
    },
    {
        "Balash": "balash"
    },
    {
        ", was elected as shah by the Iranian magnates, most notably Sukhra and the ": null
    },
    {
        "Mihranid": "house of mihran"
    },
    {
        " general ": null
    },
    {
        "Shapur Mihran": "shapur mihran"
    },
    {
        ". However, Balash proved unpopular among the nobility and clergy who had him deposed after just four years in 42 Sukhra, who had played a key role in Balashs deposition, appointed Kavad as the new shah of Iran. According to ": null
    },
    {
        "Miskawayh": "miskawayh"
    },
    {
        " , Sukhra was Kavads maternal uncle.         Kavad ascended the throne at the age of 42 His youth is emphasized on his coins, which show him with short whiskers. He inherited an empire that had reached its lowest ebb. The nobility and clergy exerted great influence and authority over the nation, and were able to act as king-makers, as seen by their choice to depose Balash. Economically, the empire was not doing well either, the result of drought, famine, and the crushing defeats delivered by the Hephthalites. They had not only seized large parts of its eastern provinces, but had also forced the Sasanians to pay vast amounts of ": null
    },
    {
        "tribute": "tribute"
    },
    {
        " to them. Rebellions were occurring in the western provinces including ": null
    },
    {
        "Armenia": "sasanian armenia"
    },
    {
        " and ": null
    },
    {
        "Iberia": "sasanian iberia"
    },
    {
        ". Simultaneously, the countrys peasant class was growing more and more uneasy and alienated from the elite.          The young and inexperienced Kavad was tutored by Sukhra during his first five years as shah. During this period, Kavad was a mere ": null
    },
    {
        "figurehead": "figurehead"
    },
    {
        ", whilst Sukhra was the ": null
    },
    {
        "de facto": "de facto"
    },
    {
        " ruler of the empire. This is emphasized by ": null
    },
    {
        "al-Tabari": "al-tabari"
    },
    {
        ", who states that Sukhra was in charge of government of the kingdom and the management of affairs ... e people came to Sukhra and undertook all their dealings with him, treating Kavad as a person of no importance and regarding his commands with contempt.  Numerous regions and the representatives of the elite paid tribute to Sukhra not to Kavad. Sukhra controlled the royal treasury and the Iranian military. In 42 Kavad, having reached adulthood, wanted to put an end to Sukhras dominance, and had him exiled to his native ": null
    },
    {
        "Shiraz": "shiraz"
    },
    {
        " in southwestern Iran. Even in exile, however, Sukhra was in control of everything except the kingly crown. He bragged about having put Kavad on the throne.     Alarmed by the thought that Sukhra might rebel, Kavad wanted to get rid of him completely. He lacked the manpower to do so, however, as the army was controlled by Sukhra and the Sasanians relied mainly on the military of the Seven Great Houses of Iran. He found his solution in ": null
    },
    {
        "Shapur of Ray": "shapur of ray"
    },
    {
        ", a powerful nobleman from the House of Mihran, and a resolute opponent of Sukhra. Shapur, at the head of an army of his own men and disgruntled nobles, marched to Shiraz, defeated Sukhras forces, and imprisoned him in the Sasanian capital of ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ". Even in prison, Sukhra was considered too powerful and was executed. This caused displeasure among some prominent members of the nobility weakening Kavads status as shah. It also marked the temporary loss of authority of the House of Karen, whose members were exiled in the regions of ": null
    },
    {
        "Tabaristan": "tabaristan"
    },
    {
        " and ": null
    },
    {
        "Zabulistan": "zabulistan"
    },
    {
        ", which was away from the Sasanian court in Ctesiphon.       Not long after Sukhras execution, a ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " priest named ": null
    },
    {
        "Mazdak": "mazdak"
    },
    {
        " caught Kavads attention. Mazdak was the chief representative of a religious and philosophical movement called ": null
    },
    {
        "Mazdakism": "mazdakism"
    },
    {
        ". Not only did it consist of theological teachings, it also advocated for political and social reforms, which would impact the nobility and clergy. The Mazdak movement was against violence and called for the sharing of wealth, women and property, an archaic form of ": null
    },
    {
        "communism": "communism"
    },
    {
        ". According to modern historians ": null
    },
    {
        "Touraj Daryaee": "touraj daryaee"
    },
    {
        " and Matthew Canepa, sharing women was most likely an overstatement and defamation deriving from Mazdaks decree that loosened marriage rules to help the lower classes. Powerful families saw this as a tactic to weaken their lineage and advantages, which was most likely the case. Kavad used the movement as a political tool to curb the power of the nobility and clergy. Royal ": null
    },
    {
        "granaries": "granary"
    },
    {
        " were distributed, and land was shared among the lower-classes.     The ": null
    },
    {
        "historicity": "historicity"
    },
    {
        " of the persona of Mazdak has been questioned. He may have been a fabrication to take blame away from Kavad. Contemporary historians, including ": null
    },
    {
        "Procopius": "procopius"
    },
    {
        " and ": null
    },
    {
        "Joshua the Stylite": "joshua the stylite"
    },
    {
        " make no mention of Mazdak naming Kavad as the figure behind the movement. Mention of Mazdak only emerges in later Middle Persian Zoroastrian documents, namely the  Bundahishn , the  Denkard , and the  Zand-i Wahman yasn . Later Islamic-era sources, particularly al-Tabaris work, also mention Mazdak. These later writings were perhaps corrupted by Iranian oral folklore, given that blame put on Mazdak for the redistribution of aristocratic properties to the people, is a topic repeated in Iranian oral history. Other villains in Iranian history, namely ": null
    },
    {
        "Gaumata": "gaumata"
    },
    {
        " in the ": null
    },
    {
        "Behistun Inscription": "behistun inscription"
    },
    {
        " of the ": null
    },
    {
        "Achaemenid": "achaemenid empire"
    },
    {
        " ruler ": null
    },
    {
        "Darius the Great": "darius the great"
    },
    {
        " , and ": null
    },
    {
        "Wahnam": "wahnam"
    },
    {
        " in the ": null
    },
    {
        "Paikuli inscription": "paikuli inscription"
    },
    {
        " of the Sasanian shah ": null
    },
    {
        "Narseh": "narseh"
    },
    {
        " , are frequently accused of similar misdeeds. Regardless of the main figure behind this movement, the nobility deposed Kavad in 42 They installed his more impressionable brother ": null
    },
    {
        "Jamasp": "jamasp"
    },
    {
        " on the throne. One of the other reasons behind Kavads deposal was his execution of Sukhra. Meanwhile, chaos was occurring in the country, notably in ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        ".             A council soon took place among the nobility to discuss what to do with Kavad. ": null
    },
    {
        "Gushnaspdad": "gushnaspdad"
    },
    {
        ", a member of a prominent family of landowners  proposed that Kavad be executed. His suggestion was overruled, however, and Kavad was imprisoned instead in the ": null
    },
    {
        "Prison of Oblivion": "prison of oblivion"
    },
    {
        " in ": null
    },
    {
        "Khuzestan": "khuzestan"
    },
    {
        ". According to Procopius account, Kavads wife approached the commander of the prison. They came to an understanding that she would be allowed to see Kavad in exchange for sleeping with him. Kavads friend, ": null
    },
    {
        "Siyawush": "siyawush"
    },
    {
        ", who was regularly in the same area as the prison, planned his friends escape by preparing horses near the prison. Kavad changed clothes with his wife to disguise himself as a female, and escaped from the prison and fled with Siyawush.     Al-Tabaris account is different. He says that Kavads sister helped him to escape by rolling him in a carpet, which she made the guard believe was soaked with her menstrual blood. The guard did not object or investigate the carpet, fearing lest he become polluted by it.  One of the authors of the  Prosopography of the Later Roman Empire , John Robert Martindale, proposes she may have in fact been ": null
    },
    {
        "Sambice": "sambice"
    },
    {
        ", Kavads sister-wife, who was the mother of his eldest son, ": null
    },
    {
        "Kawus": "kawus"
    },
    {
        ". Regardless, Kavad managed to escape imprisonment, and fled to the court of the Hephthalite king, where he took refuge. Procopius, .  According to the narratives included in the history of al-Tabari, during his flight Kavad met a peasant girl from Nishapur, named Niwandukht, who became pregnant with his child, who would later be ": null
    },
    {
        "Khosrow I": "khosrow i"
    },
    {
        ". However, the story has been dismissed as fable by the ": null
    },
    {
        "Iranologist": "iranologist"
    },
    {
        " Ehsan Yarshater": "ehsan yarshater"
    },
    {
        ". Khosrows mother was in reality a noblewoman from the ": null
    },
    {
        "Ispahbudhan": "ispahbudhan"
    },
    {
        " clan, one of the Seven Great Houses of Iran. ; ; ;  At the Hephthalite court, Kavad gained the support of the Hephthalite king, and also married his daughter .     During his stay at the Hephthalite court, Kavad might have witnessed the rise of the Hephthalites to a better position than that of their former ": null
    },
    {
        "suzerains": "suzerainty"
    },
    {
        ", the ": null
    },
    {
        "Kidarites": "kidarites"
    },
    {
        ". The present-day district of Qubadian in Balkh, which was then under Hephthalite rule, was most likely founded by Kavad, and may have been where he lived during his exile. In 42 , Kavad returned to Iran with a Hephthalite army. When he crossed the domains of the Kanarangiyan family in Khorasan, he was met by ": null
    },
    {
        "Adergoudounbades": "adergoudounbades"
    },
    {
        ", a member of the family, who agreed to help him. Another noble who supported Kavad was ": null
    },
    {
        "Zarmihr Karen": "zarmihr karen"
    },
    {
        ", a son of Sukhra.     Jamasp and the nobility and clergy did not resist as they wanted to prevent another civil war. They came to an agreement with Kavad that he would be shah again with the understanding that he would not hurt Jamasp or the elite. Jamasp was spared, albeit probably blinded, while Gushnaspdad and other nobles who had plotted against Kavad were executed. Generally, however, Kavad secured his position by lenience. Adergoudounbades was appointed the new head of the Kanarangiyan, while Siyawush was appointed the head of the Sasanian army . Another of Sukhras sons, ": null
    },
    {
        "Bozorgmehr": "bozorgmehr"
    },
    {
        ", was made Kavads minister . Kavads reclamation of his throne displays the troubled circumstances of the empire, where in a time of anarchy a small force was able to overwhelm the nobility-clergy alliance.            Kavads reign is noteworthy for his reforms, which he had been able to make with the nobility and clergy weakened by the Mazdakites. They were not be completed under his reign but were continued by his son, Khosrow I. The serious blows the Sasanians had suffered at the hands of the Hephthalites in the last quarter of the 42th-century was a key reason behind the reforms the two made. Tax reform was implemented, a poll tax was created, and a review of taxable land was undertaken to ensure taxation was fair. The empire was divided into four frontier regions, with a military commander  in charge of each district; a chancery was also added to keep the soldiers equipped. Before Kavad and Khosrows reforms, the Iranians general  managed the empires army. Many of these military commanders were notably from the Parthian wuzurgan, indicating the continuation of their authority, despite the efforts by Kavad and Khosrow. A new priestly office was also created known as the advocate and judge of the poor , which assisted the clergy to help the poor and underprivileged .     The power of the ": null
    },
    {
        "dehqan": "dehqan"
    },
    {
        ", a class of small land-owning magnates, increased substantially . A group of these dehqans was enlisted into a group of cavalry men, who were managed directly by the shah and earned steady wages. This was done to decrease the reliance on the Parthian cavalry. Soldiers were also enlisted from Sasanian allies, such as the Hephthalites, ": null
    },
    {
        "Arabs": "arabs"
    },
    {
        ", and ": null
    },
    {
        "Daylamites": "daylamites"
    },
    {
        ". As a result, the newly rejuvenated Sasanian army proved successful in its efforts in subsequent decades. It sacked the Byzantine city of ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        " in 42 ": null
    },
    {
        "conquered Yemen": "aksumite–persian wars"
    },
    {
        " in the 42s, and under the Parthian military commander ": null
    },
    {
        "Bahram Chobin": "bahram chobin"
    },
    {
        " defeated": "first perso-turkic war"
    },
    {
        " both the Hephthalites and ": null
    },
    {
        "Western Turkic Khaganate": "western turkic khaganate"
    },
    {
        " in the late 42s.     Although the reforms were beneficial for the Sasanian Empire, they may also have resulted in the decline of the traditional links between the aristocracy and the crown under ": null
    },
    {
        "Hormizd IV": "hormizd iv"
    },
    {
        "  and ": null
    },
    {
        "Khosrow II": "khosrow ii"
    },
    {
        " , to the degree that many belonging to the wuzurgan class—notably Bahram Chobin of the Mihran family, and later ": null
    },
    {
        "Shahrbaraz": "shahrbaraz"
    },
    {
        " of the same family—were bold enough to dispute the legitimacy of the Sasanian family and lay claims to the throne.       With his reforms under way by the 42s, Kavad no longer had any use for Mazdak, and he officially stopped supporting the Mazdakites. A debate was arranged where not only the Zoroastrian priesthood, but also Christian and Jewish leaders slandered Mazdak and his followers. According to the  Shahnameh  , written several centuries later by the medieval Persian poet ": null
    },
    {
        "Ferdowsi": "ferdowsi"
    },
    {
        ", Kavad had Mazdak and his supporters sent to Khosrow. His supporters were killed in a walled orchard buried head first with only their feet visible. Khosrow then summoned Mazdak to look at his garden, saying: You will ﬁnd trees there that no-one has ever seen and no-one ever heard of even from the mouth of the ancient sages.  Mazdak, seeing his followers corpses, screamed and passed out. He was executed afterwards by Khosrow, who had his feet fastened on a ": null
    },
    {
        "gallows": "gallows"
    },
    {
        ", and had his men shoot arrows at Mazdak.           Many places were founded or re-built under Kavad. He is said to have founded the city ": null
    },
    {
        "Eran-asan-kerd-Kawad": "eran-asan-kerd-kawad"
    },
    {
        " in ": null
    },
    {
        "Media": "media"
    },
    {
        "; ": null
    },
    {
        "Fahraj": "fahraj, yazd"
    },
    {
        " in ": null
    },
    {
        "Spahan": "spahan"
    },
    {
        "; and Weh-Kawad, Eran-winard-Kawad, Kawad-khwarrah, and ": null
    },
    {
        "Arrajan": "arrajan"
    },
    {
        " in ": null
    },
    {
        "Pars": "pars"
    },
    {
        ". He rebuilt ": null
    },
    {
        "Kirmanshah": "kermanshah"
    },
    {
        " in Media, which he also used as one of his residences. He is also said to have founded a township in ": null
    },
    {
        "Meybod": "meybod"
    },
    {
        ", which was named Haft-adhar , because of a Zoroastrian ": null
    },
    {
        "fire temple": "fire temple"
    },
    {
        " being established there. Its original fire was created by fire brought from seven other temples in Pars, Balkh, ": null
    },
    {
        "Adurbadagan": "adurbadagan"
    },
    {
        ", ": null
    },
    {
        "Nisa": "nisa, turkmenistan"
    },
    {
        ", ": null
    },
    {
        "Spahan": "spahan"
    },
    {
        ", ": null
    },
    {
        "Ghazni": "ghazni"
    },
    {
        ", and Ctesiphon.     In the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        ", Kavad had new ": null
    },
    {
        "fortifications": "fortifications of derbent"
    },
    {
        " built at ": null
    },
    {
        "Derbent": "derbent"
    },
    {
        ", and ordered the construction of the ": null
    },
    {
        "Apzut Kawat wall": "sasanian defense linesapzut kawat"
    },
    {
        " . The prominent ": null
    },
    {
        "Caucasian Albania": "caucasian albania"
    },
    {
        "n fortress of ": null
    },
    {
        "Partaw": "barda, azerbaijan"
    },
    {
        ", which had been rebuilt during the reign of Peroz I and named Perozabad , was fortified by Kavad and called Perozkavad . The Albanian capital of ": null
    },
    {
        "Kabala": "qabala"
    },
    {
        ", a large urban area that included the headquarters of one of the Albanian bishops, was also fortified by Kavad. He founded the city of ": null
    },
    {
        "Baylakan": "beylagan"
    },
    {
        ", which by most researchers is identified with the ruins of Oren-kala. Ultimately, these extensive buildings and fortifications transformed Caucasian Albania into a bastion of Iranian presence in the Caucasus.       The Sasanians exerted considerable influence on trade in the region under Kavad. By using the strategic location of the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ", the Sasanians interfered to prevent Byzantine traders from taking take part in the India trade. They accomplished this either by bargaining with trade associates in the ": null
    },
    {
        "Indian subcontinent": "indian subcontinent"
    },
    {
        "—ranging from the ": null
    },
    {
        "Gupta Empire": "gupta empire"
    },
    {
        " in the north to the ": null
    },
    {
        "Anuradhapura": "anuradhapura kingdom"
    },
    {
        " monarchs of ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        " in the south—or by attacking the Byzantine boats. Iranian traders were also able to seize Indian vessels well before they could make contact with Byzantine traders. These advantages resulted in the Iranian traders establishing something resembling a monopoly over the India trade.             The Sasanians and Byzantines had kept peace since the brief ": null
    },
    {
        "Byzantine–Sasanian War of 42": "byzantine–sasanian war of 440"
    },
    {
        ". The last major war between the two empires had been during the reign of ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        " . However, war finally erupted in 42 Bankrupted by his hiatus in 42–42/42 Kavad applied for subsidies to the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ", who originally had paid the Iranians voluntarily to maintain the defense of the Caucasus against attacks from the north. The Iranians seemingly saw the money as a debt due to them. But now Emperor ": null
    },
    {
        "Anastasius I": "anastasius i"
    },
    {
        "  refused subsidies forcing Kavad to attempt to obtain the money by force. In 42 Kavad invaded ": null
    },
    {
        "Byzantine Armenia": "byzantine armenia"
    },
    {
        " with a force that included Hephthalite soldiers. He captured ": null
    },
    {
        "Theodosiopolis": "theodosiopolis"
    },
    {
        ", perhaps with local support; in any case, the city was undefended by troops and weakly fortified.     He then besieged the fortress-city of ": null
    },
    {
        "Amida": "amida"
    },
    {
        " through the autumn and winter . The siege proved to be a far more difficult enterprise than Kavad had expected; the defenders, although unsupported by troops, repelled the Iranian assaults for three months before they were finally defeated. The Byzantines failed in their attempt to recapture the city. Kavad then tried unsuccessfully to capture ": null
    },
    {
        "Edessa": "edessa, mesopotamia"
    },
    {
        " in ": null
    },
    {
        "Osroene": "osroene"
    },
    {
        ". In 42 an invasion of Armenia by the Huns from the Caucasus led to an armistice; the Byzantines paid subsidies to the Iranians for the maintenance of the fortifications on the Caucasus, in return for Amida. The peace treaty was signed by the ": null
    },
    {
        "Ispahbudhan": "house of ispahbudhan"
    },
    {
        " aristocrat ": null
    },
    {
        "Bawi": "bawi"
    },
    {
        ", Kavads brother-in-law. Although Kavads first war with the Byzantines did not end with a decisive winner, the conquest of Amida was the greatest accomplishment achieved by a Sasanian force since 42 when the same city had been ": null
    },
    {
        "captured": "siege of amida"
    },
    {
        " by Shapur II.          Kavads relationship with his Christian subjects is unclear. In Christian Iberia, where the Sasanians had earlier tried to spread Zoroastrianism, Kavad represented himself as an advocate of orthodox Zoroastrianism. In Armenia, however, he settled disputes with the Christians and appears to have continued Balashs peaceful approach. The Christians of Mesopotamia and Iran proper practised their religion without any persecution, despite the punishment of Christians in Iran proper being briefly mentioned in . Like Jamasp, Kavad also supported the ": null
    },
    {
        "Patriarch of the Church of the East": "patriarch of the church of the east"
    },
    {
        ", ": null
    },
    {
        "Babai": "babai of seleucia-ctesiphon"
    },
    {
        ", and Christians served in high offices at the Sasanian court. According to Eberhard Sauer, Sasanian monarchs only persecuted other religions when it was in their urgent political interests to do so.     Kavads reign marked a new turn in Sasanian-Christian relations; before his reign, ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " had been seen solely as the defender of the Byzantines. This changed under Kavad. According to an apocryphal account in the Chronicle of Pseudo–Zachariah of Mytilene, written by a West ": null
    },
    {
        "Syrian": "syria"
    },
    {
        " monk at Amida in 42 Kavad saw a vision of Jesus whilst besieging Amida, which encouraged him to remain resolute in his effort. Jesus guaranteed to give him Amida within three days, which happened. Kavads forces then sacked the city, taking much booty. The citys church was spared, however, due to the relationship between Kavad and Jesus. Kavad was even thought to have venerated a figure of Jesus. According to modern historian Richard Payne, the Sasanians could now be viewed as adherents of Jesus and his saints, if not Christianity itself.       Not much is known about Kavads wars in the east. According to Procopius, Kavad was forced to leave for the eastern frontier in 42 to deal with an attack by hostile Huns , one of the many clashes in a reportedly lengthy war. After the Sasanian disaster in 42 all of Khorasan was seized by the Hephthalites; no Sasanian coins minted in the area have been found from his first reign. The increased in the number of coins minted at Gorgan during his first reign may indicate a yearly tribute he paid to the Hephthalites. During his second reign, his fortunes changed. A Sasanian campaign in 42 led to the conquest of the Zundaber Castellum, associated with the temple of az-Zunin in the area of ad-Dawar, situated between ": null
    },
    {
        "Bust": "lashkargah"
    },
    {
        " and ": null
    },
    {
        "Kandahar": "kandahar"
    },
    {
        ". A Sasanian coin dating to 42/42 has been found in Marw. This indicates the Sasanians under Kavad had managed to re-conquer Khorasan after successfully dealing with the Hephthalites.          Around 42 to secure the succession of his youngest son Khosrow, whose position was threatened by rival brothers and the Mazdakite sect, and to improve his relationship with the Byzantine emperor ": null
    },
    {
        "Justin I": "justin i"
    },
    {
        ", Kavad proposed that he adopt Khosrow. ;  This proposal was greeted initially with enthusiasm by the Byzantine emperor and his nephew, ": null
    },
    {
        "Justinian": "justinian"
    },
    {
        ". However, Justinians  quaestor , Proclus, opposed the move concerned over the possibility that Khosrow might attempt to take over the Byzantine throne. The Byzantines made a counter-proposal to adopt Khosrow not as a Roman but as a barbarian. Procopius, . In the end the negotiations did not reach a consensus. Khosrow reportedly felt insulted by the Byzantines, and his attitude towards them deteriorated.     Mahbod, who with Siyawush, had acted as the diplomats in the negotiations accused him of purposely sabotaging them. Further accusations were made against Siyawush, which included his reverence for new deities, and having his dead wife buried, a violation of Iranian law. Siyawush was thus most likely a Mazdakite, the religious sect that Kavad had originally, but now no longer, supported. Although Siyawush was a close friend of Kavad and had helped him escape imprisonment, Kavad did not try to prevent his execution. Seemingly his purpose was to restrict Siyawushs immense authority as the head of the Sasanian army, a post which was disliked by the other nobles. Siyawush was executed, and his office was abolished. Despite the breakdown of the negotiations, it was not until 42 that full-scale warfare on the main western frontier broke out. In the intervening years, the two sides preferred waging war by proxy, through Arab allies in the south and Huns in the north.             Hostility between the two powers erupted into conflict once again in 42 just a year after the new Byzantine emperor ": null
    },
    {
        "Justinian I": "justinian i"
    },
    {
        "  had been crowned. The was supposedly the result of the Byzantines not acknowledging Khosrow as Kavads heir. According to the Greek chronicler ": null
    },
    {
        "John Malalas": "john malalas"
    },
    {
        ", military clashes first took place in ": null
    },
    {
        "Lazica": "lazica"
    },
    {
        ", which had been disputed between the two empires since 42 Not long after this the battles also spread down to Mesopotamia, where the Byzantines suffered a heavy defeat near the border. In 42 one of the ": null
    },
    {
        "famous open-field battles": "battle of dara"
    },
    {
        " took place between the Byzantine and Sasanian troops at ": null
    },
    {
        "Dara": "dara"
    },
    {
        ".     The Sasanian army led by ": null
    },
    {
        "Perozes": "perozes"
    },
    {
        ", Pityaxes and ": null
    },
    {
        "Baresmanas": "baresmanas"
    },
    {
        " suffered a severe defeat. The battle did not, however, bring an end to the conflict. The following year Kavad raised an army, which he sent under ": null
    },
    {
        "Azarethes": "azarethes"
    },
    {
        " to invade the Byzantine province of ": null
    },
    {
        "Commagene": "commagene"
    },
    {
        ". When the Byzantine army under ": null
    },
    {
        "Belisarius": "belisarius"
    },
    {
        " approached, Azarethes and his men withdrew east, halting at ": null
    },
    {
        "Callinicum": "raqqa"
    },
    {
        ". In the ": null
    },
    {
        "ensuing battle": "battle of callinicum"
    },
    {
        " the Byzantines suffered a heavy defeat, but Iranian losses were so great Kavad was displeased with Azarethes, and relieved him of his command. Procopius, . In 42 the Iranians ": null
    },
    {
        "besieged Martyropolis": "siege of martyropolis"
    },
    {
        ". During the siege, however, Kavad became ill and died on 42 September. Procopius .  As a result, the siege was lifted and ": null
    },
    {
        "peace was made": "perpetual peace"
    },
    {
        " between Kavads successor Khosrow I and Justinian.          The provinces of ": null
    },
    {
        "Gorgan": "gorgan"
    },
    {
        ", Khuzestan, and ": null
    },
    {
        "Asoristan": "asoristan"
    },
    {
        " provided the most ": null
    },
    {
        "Sasanian coinage": "sasanian coinage"
    },
    {
        " for Kavad during his reign. His reign marks the introduction of distinctive traits on the obverse sides of the coin which includes astral symbols, particularly, a ": null
    },
    {
        "crescent": "crescent"
    },
    {
        " on both of his shoulders, and a star in the left corner. The reverse side shows the traditional fire altar flanked by two attendants facing the it in veneration. Kavad used the title of kay  on his coins, a title that had been used since the reign of his grandfather Yazdegerd II . Kavad was, however, the last Sasanian shah to have kay inscribed on his coins—the last one issued in 42 The regular obverse inscription on his coins simply has his name; in 42 however, the slogan abzōn was added.          According to Procopius and other historians, Kavad had written a succession plan that favoured Khosrow just before his death. Historian John Malalas stated that Kavad crowned Khosrow himself. However, at the beginning of Khosrows reign in 42 Bawi, and other members of the Iranian aristocracy, became involved in a conspiracy to overthrow Khosrow and make Kavad, the son of Kavads second eldest son ": null
    },
    {
        "Jamasp": "jamasp"
    },
    {
        ", the shah of Iran.  Upon learning of the plot, Khosrow executed all of his brothers and their offspring, as well as Bawi and the other nobles who were involved.     Khosrow also ordered the execution of Kavad, who was still a child, and was away from the court, being raised by Adergoudounbades. He sent orders to kill Kavad, but Adergoudounbades disobeyed and secretly raised him until he was betrayed to the shah in 42 by his own son, Bahram. Khosrow had him executed, but Kavad, or someone claiming to be him, managed to flee to the Byzantine Empire. ; ; .       Kavads reign is considered a turning point in Sasanian history. As a result of the many challenges and issues Kavad successfully handled, he is considered one of the most effective and successful kings to rule the Sasanian Empire. In the words of Iranologist Nicholas Schindel he was a genius in his own right, even if of a somewhat ": null
    },
    {
        "Machiavellian": "niccolo machiavelli"
    },
    {
        " type.  He was successful in his efforts to reinvigorate his declining empire paving the way for a smooth transition to his son Khosrow I, who inherited a powerful empire. He improved it further during his reign, becoming one of the most popular shahs of Iran earning the epithet Anushirvan . ; ;                                                   ": null
    }
]