[
    {
        "   Keith Morris is an American singer and songwriter known for his role as frontman of the ": null
    },
    {
        "hardcore punk": "hardcore punk"
    },
    {
        " bands ": null
    },
    {
        "Black Flag": "black flag"
    },
    {
        ", ": null
    },
    {
        "Circle Jerks": "circle jerks"
    },
    {
        ", and ": null
    },
    {
        "Off!": "off!"
    },
    {
        ". Born and raised in ": null
    },
    {
        "Hermosa Beach, California": "hermosa beach, california"
    },
    {
        ", he formed Black Flag at the age of 42 with guitarist ": null
    },
    {
        "Greg Ginn": "greg ginn"
    },
    {
        " and performed on the bands 42 debut ": null
    },
    {
        "EP": "extended play"
    },
    {
        "  Nervous Breakdown . Shortly after leaving Black Flag in 42 he formed the Circle Jerks with guitarist ": null
    },
    {
        "Greg Hetson": "greg hetson"
    },
    {
        "; the band released seven albums between 42 and 42 and have broken up and reformed on numerous occasions. In 42 Morris formed the ": null
    },
    {
        "supergroup": "supergroup"
    },
    {
        " Off! with guitarist ": null
    },
    {
        "Dimitri Coats": "dimitri coats"
    },
    {
        ", bassist ": null
    },
    {
        "Steven Shane McDonald": "steven shane mcdonald"
    },
    {
        ", and drummer ": null
    },
    {
        "Mario Rubalcaba": "mario rubalcaba"
    },
    {
        ". Morris has also appeared as a guest vocalist on several albums by other artists.           Morris was born September 42 42 and grew up in ": null
    },
    {
        "Hermosa Beach, California": "hermosa beach, california"
    },
    {
        ". His father, Jerry, had been a budding ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " drummer in his youth and practiced with visiting jazz groups at the ": null
    },
    {
        "Lighthouse Café": "lighthouse café"
    },
    {
        ". Jerry later opened a ": null
    },
    {
        "bait": "fishing bait"
    },
    {
        " shop in the 42s and struck up a friendship with jazz record producer ": null
    },
    {
        "Ozzie Cadena": "ozzie cadena"
    },
    {
        " . Keith attended ": null
    },
    {
        "Mira Costa High School": "mira costa high school"
    },
    {
        ", where brothers ": null
    },
    {
        "Greg": "greg ginn"
    },
    {
        " and ": null
    },
    {
        "Raymond Ginn": "raymond pettibon"
    },
    {
        " were also students, and graduated in 42 He then studied fine art and painting at the Pasadena Arts Center while working at his fathers bait shop. One of his co-workers at the shop was ": null
    },
    {
        "Bill Stevenson": "bill stevenson"
    },
    {
        ", a Mira Costa student eight years Morris junior who would also go on to be a member of Black Flag.     Morris and his friends spent their spare time hanging out by ": null
    },
    {
        "the Strand": "the strand"
    },
    {
        " under ": null
    },
    {
        "Hermosa Beach pier": "hermosa beach pier"
    },
    {
        ", where they took drugs: Id get off work, and wed get up to trouble, he later recalled, smoking ": null
    },
    {
        "angel dust": "phencyclidine"
    },
    {
        ", snorting elephant tranquilizers. Just real goofy, why-would-you-want-to-do-that? kinda stuff, the kind of thing you get up to when youre young, and into experimenting. If it was a good experience, then cool; if not, well, then it was just a real hard lesson learned.  His early musical tastes included various ": null
    },
    {
        "rock": "rock music"
    },
    {
        " acts such as ": null
    },
    {
        "Bob Seger": "bob seger"
    },
    {
        ", ": null
    },
    {
        "Foreigner": "foreigner"
    },
    {
        ", ": null
    },
    {
        "Montrose": "montrose"
    },
    {
        ", ": null
    },
    {
        "Styx": "styx"
    },
    {
        ", ": null
    },
    {
        "Deep Purple": "deep purple"
    },
    {
        ", ": null
    },
    {
        "Black Sabbath": "black sabbath"
    },
    {
        ", ": null
    },
    {
        "Queen": "queen"
    },
    {
        ", ": null
    },
    {
        "Ten Years After": "ten years after"
    },
    {
        ", ": null
    },
    {
        "Status Quo": "status quo"
    },
    {
        ", ": null
    },
    {
        "Uriah Heep": "uriah heep"
    },
    {
        ", ": null
    },
    {
        "UFO": "ufo"
    },
    {
        ", the ": null
    },
    {
        "Scorpions": "scorpions"
    },
    {
        ", ": null
    },
    {
        "Aerosmith": "aerosmith"
    },
    {
        ", ": null
    },
    {
        "Ted Nugent": "ted nugent"
    },
    {
        ", and the ": null
    },
    {
        "MC42": "mc5"
    },
    {
        ", any kind of fist-pumping, flick-your-bic rock. I was into anything that was loud . He became a freely opinionated and passionate fan of heavy rock and ": null
    },
    {
        "protopunk": "protopunk"
    },
    {
        ", and took a job working at local record store Rubicon Records.       In 42 Morris co-founded ": null
    },
    {
        "Black Flag": "black flag"
    },
    {
        " along with guitarist ": null
    },
    {
        "Greg Ginn": "greg ginn"
    },
    {
        ". Their work ethic proved too challenging for some early members; Ginn and Morris had an especially hard time finding a reliable bass guitarist, and often rehearsed without a bassist, a factor that contributed to the development of Ginns distinctive, often low-pitched guitar sound. Ginns brother ": null
    },
    {
        "Raymond Pettibon": "raymond pettibon"
    },
    {
        " and SST house ": null
    },
    {
        "record producer": "record producer"
    },
    {
        "-to-be ": null
    },
    {
        "Spot": "spot"
    },
    {
        " filled in sometimes at rehearsals.     After a number of line-up changes, Morris recorded vocals for the first Black Flag EP  Nervous Breakdown . He left the band in 42 citing, among other reasons, creative differences with Ginn, and his own freaking out on cocaine and speed.       After leaving Black Flag in 42 Morris founded the ": null
    },
    {
        "Circle Jerks": "circle jerks"
    },
    {
        ", along with former ": null
    },
    {
        "Redd Kross": "redd kross"
    },
    {
        " guitarist ": null
    },
    {
        "Greg Hetson": "greg hetson"
    },
    {
        ". Cited as one of the most important hardcore punk groups, the Circle Jerks were active until 42 when Hetson left the band to continue playing guitar and release a number of albums with ": null
    },
    {
        "Bad Religion": "bad religion"
    },
    {
        ". However, the Circle Jerks reunited in 42 released ": null
    },
    {
        "their last studio album": "oddities, abnormalities and curiosities"
    },
    {
        " to date in 42 and performed on and off until 42 when they went back on hiatus, but announced another reunion in 42        As of 42 Morris has been performing and touring with his latest project ": null
    },
    {
        "Off!": "off!"
    },
    {
        ", which he founded with ": null
    },
    {
        "Dimitri Coats": "dimitri coats"
    },
    {
        " from ": null
    },
    {
        "Burning Brides": "burning brides"
    },
    {
        ", ": null
    },
    {
        "Steven Shane McDonald": "steven shane mcdonald"
    },
    {
        " from ": null
    },
    {
        "Redd Kross": "redd kross"
    },
    {
        ", and ": null
    },
    {
        "Mario Rubalcaba": "mario rubalcaba"
    },
    {
        " from ": null
    },
    {
        "Earthless": "earthless"
    },
    {
        "/": null
    },
    {
        "Rocket From The Crypt": "rocket from the crypt"
    },
    {
        "/": null
    },
    {
        "Hot Snakes": "hot snakes"
    },
    {
        ". Morris stated in a March 42 interview that Off! was asked to open future dates for the ": null
    },
    {
        "Red Hot Chili Peppers": "red hot chili peppers"
    },
    {
        " and they said they would even though it might anger some of their younger punk fans.  Morris has known the band for over 42 years and Chili Peppers singer, ": null
    },
    {
        "Anthony Kiedis": "anthony kiedis"
    },
    {
        ", wore an Off! hat at every show on the bands entire  Im with You World Tour  including some of their music videos.  Morris even filled in for Kiedis during one of the Chili Peppers shows in 42 When Kiedis, who was off scoring drugs, failed to show up for the performance, the band asked Morris to fill in on vocals. Morris, who didnt know any of the lyrics, yelled and made up lyrics to the bands songs to get through the performance. In the Chili Peppers An Oral/Visual History book, bassist Flea said We got an opening slot at the Olympic Auditorium. But Anthony in all his junkie splendor did not show up. Keith Morris from the Circle Jerks said Ill sing and so we went out with him. We were just playing the songs and he would yell out stuff - whatever he could.           In 42 Keith Morris, Chuck Dukowski, Dez Cadena, Bill Stevenson and Descendents member Stephen Egerton, created FLAG as an offshoot of Black Flag. As of now, they are only touring. No plans for an album have been announced.        After the Circle Jerks first break-up in 42 Morris led the bands Bug Lamp  and ": null
    },
    {
        "Midget Handjob": "midget handjob"
    },
    {
        ".  He also provided backing vocals on Operation Rescue , from ": null
    },
    {
        "Bad Religion": "bad religion"
    },
    {
        "s album  Against the Grain  .     Morris also narrated ": null
    },
    {
        "Chris Fuller": "chris fuller"
    },
    {
        "s 42 Gotham Award-nominated independent film  Loren Cass .     Morris appeared as the DJ for the West Coast Punk Rock station Channel X in the video game  Grand Theft Auto V  released on September 42 42       In 42 Morris was diagnosed with adult onset ": null
    },
    {
        "diabetes": "diabetes"
    },
    {
        ". Many of his friends held benefit concerts to help cover his large medical bills. He has also been sober since 42  Nervous Breakdown    Selections from  Everything Went Black          Group Sex     Wild in the Streets     Golden Shower of Hits     Wonderful     VI     Gig     Oddities, Abnormalities and Curiosities        Howling at the Moon on  Gabba Gabba Hey: A Tribute to the Ramones    El Dorado on  Roadside Prophets  soundtrack   The Ballad of Dwight Fry on Welcome to Our Nightmare: A Tribute to Alice Cooper        Midnight Snack Break at the Poodle Factory         First Four EPs     Off!     Wasted Years        ": null
    }
]