[
    {
        "           Kenilworth Castle is located in the town of ": null
    },
    {
        "Kenilworth": "Kenilworth"
    },
    {
        " in ": null
    },
    {
        "Warwickshire": "Warwickshire"
    },
    {
        ", England. Constructed from ": null
    },
    {
        "Norman": "Norman Conquest Of England"
    },
    {
        " through to ": null
    },
    {
        "Tudor": "Tudor Period"
    },
    {
        " times, the ": null
    },
    {
        "castle": "Castle"
    },
    {
        " has been described by the architectural historian Anthony Emery as the finest surviving example of a semi-royal palace of the later middle ages, significant for its scale, form and quality of workmanship . Kenilworth has also played an important historical role. The castle was the subject of the six-month-long ": null
    },
    {
        "Siege of Kenilworth": "Siege Of Kenilworth"
    },
    {
        " in 1266, thought to be the longest siege in Medieval English history, and formed a base for ": null
    },
    {
        "Lancastrian": "House Of Lancaster"
    },
    {
        " operations in the ": null
    },
    {
        "Wars of the Roses": "Wars Of The Roses"
    },
    {
        ". Kenilworth was also the scene of the removal of ": null
    },
    {
        "Edward II": "King Edward Ii Of England"
    },
    {
        " from the English throne, the French insult to ": null
    },
    {
        "Henry V": "King Henry V Of England"
    },
    {
        " in 1414 , and the ": null
    },
    {
        "Earl of Leicesters": "Robert Dudley, 1St Earl Of Leicester"
    },
    {
        "lavish reception of ": null
    },
    {
        "Elizabeth I": "Queen Elizabeth I Of England"
    },
    {
        " in 1575.     The castle was built over several centuries. Founded in the 1120s around a powerful ": null
    },
    {
        "Norman": "Norman Architecture"
    },
    {
        " great tower": "Keep"
    },
    {
        ", the castle was significantly enlarged by ": null
    },
    {
        "King John": "King John I Of England"
    },
    {
        " at the beginning of the 13th century. Huge water defences were created by damming the local streams, and the resulting fortifications proved able to withstand assaults by land and water in 1266. ": null
    },
    {
        "John of Gaunt": "John Of Gaunt"
    },
    {
        " spent lavishly in the late 14th century, turning the medieval castle into a palace fortress designed in the latest ": null
    },
    {
        "perpendicular style": "Perpendicular Periodperpendicular Gothic"
    },
    {
        ". The Earl of Leicester then expanded the castle once again, constructing new ": null
    },
    {
        "Tudor": "Tudor Architecture"
    },
    {
        " buildings and exploiting the medieval heritage of Kenilworth to produce a fashionable ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        " palace.          Although now ruined as a result of the ": null
    },
    {
        "partial destruction": "Slighting"
    },
    {
        " of the castle by Parliamentary forces in 1649 to prevent it being used as a military stronghold after the ": null
    },
    {
        "English Civil War": "English Civil War"
    },
    {
        ", Kenilworth illustrates five centuries of English military and civil architecture. The castle is built almost entirely from local ": null
    },
    {
        "new red sandstone": "New Red Sandstone"
    },
    {
        ". Emery 2000, p.340.       To the south-east of the main castle lie the Brays, a corruption of the French word braie, meaning an external fortification with ": null
    },
    {
        "palisade": "Palisade"
    },
    {
        "s. Morris 2010, p.5. An alternative view is that the name brays derives instead from a corruption of the word bays , a medieval word describing a sequence of ponds similar to the lake structure at Kenilworth; see Thompson 1965, p.158. Only earthworks and fragments of masonry remain of what was an extensive 13th-century ": null
    },
    {
        "barbican": "Barbican"
    },
    {
        " structure including a stone wall and an external ": null
    },
    {
        "gatehouse": "Gatehouse"
    },
    {
        " guarding the main approach to the castle. Pettifer, p.258. The area now forms part of the car park for the castle. Beyond the Brays are the ruins of the Gallery Tower, a second gatehouse remodelled in the 15th century. The Gallery Tower originally guarded the  long, narrow walled-causeway that still runs from the Brays to the main castle. Thompson 1965, p.158. This causeway was called the Tiltyard, as it was used for tilting, or ": null
    },
    {
        "jousting": "Jousting"
    },
    {
        ", in medieval times. The Tiltyard causeway acted both as a dam and as part of the ": null
    },
    {
        "barbican": "Barbican"
    },
    {
        " defences. To the east of the Tiltyard is a lower area of marshy ground, originally flooded and called the Lower Pool, and to the west an area once called the ": null
    },
    {
        "Great Mere": "Mere"
    },
    {
        ". The Great Mere is now drained and forms a ": null
    },
    {
        "meadow": "Meadow"
    },
    {
        ", but would originally have been a large lake covering around , dammed by the Tiltyard causeway. Hull 2009, p.49.     The ": null
    },
    {
        "outer bailey": "Outer Bailey"
    },
    {
        " of Kenilworth Castle is usually entered through Mortimers Tower, today a modest ruin but originally a Norman stone gatehouse, extended in the late 13th and 16th centuries. The outer bailey wall, long and relatively low, was mainly built by ": null
    },
    {
        "King John": "King John I Of England"
    },
    {
        "; it has numerous buttresses but only a few towers, being designed to be primarily defended by the water system of the Great Mere and Lower Pool. The north side of the outer bailey wall was almost entirely destroyed during the slighting. Moving clockwise around the outer bailey from Mortimers Tower, the defences include a west-facing watergate, which would originally have led onto the Great Mere; the Kings gate, a late 17th-century agricultural addition; the Swan Tower, a late 13th-century tower with 16th century additions named after the swans that lived on the Great Mere; the early 13th-century Lunns Tower; and the 14th-century Water Tower, so named because it overlooked the Lower Pool. Pettifer, p.258; Morris 2010, p.24, 29.       Kenilworths inner court consists of a number of buildings set against a ": null
    },
    {
        "bailey": "Ward"
    },
    {
        " wall, originally of Norman origin, exploiting the defensive value of a natural ": null
    },
    {
        "knoll": "Hillock"
    },
    {
        " that rises up steeply from the surrounding area. Pettifer, pp.257–8. The 12th-century ": null
    },
    {
        "great tower": "Keep"
    },
    {
        " occupies the knoll itself and forms the north-east corner of the bailey. Ruined during the slighting, the great tower is notable for its huge corner turrets, essentially hugely exaggerated Norman ": null
    },
    {
        "pilaster": "Pilaster"
    },
    {
        " buttresses": "Buttresses"
    },
    {
        ". Thompson 1991, p.77; Pettifer, p.258. Its walls are  thick, and the towers  high. Hull 2009, p.102. Although Kenilworths great tower is larger, it is similar to that of ": null
    },
    {
        "Brandon Castle": "Brandon Castle"
    },
    {
        " near ": null
    },
    {
        "Coventry": "Coventry"
    },
    {
        "; both were built by the local ": null
    },
    {
        "Clinton family": "Geoffrey De Clinton"
    },
    {
        " in the 1120s. Morris 2010, p.37. The tower can be termed a hall keep, as it is longer than it is wide. The lowest floor is filled with earth, possibly taken from the earlier motte that may have been present on the site, and is further protected by a sloping stone ": null
    },
    {
        "plinth": "Plinth"
    },
    {
        " around the base. The tall Tudor windows at the top of the tower date from the 1570s. Morris 2010, p.8.     Much of the northern part of the inner bailey was built by the 14th-century noble ": null
    },
    {
        "John of Gaunt": "John Of Gaunt"
    },
    {
        " between 1372 and 1380. Emery 2000, p.402. This part of the castle is considered by historian Anthony Emery to be the finest surviving example of a semi-royal palace of the later middle ages, significant for its scale, form and quality of workmanship . Gaunts architectural style emphasised rectangular design, the separation of ground floor service areas from the upper stories and a contrast of austere exteriors with lavish interiors, especially on the 1st floor of the inner bailey buildings. Emery, pp.205–6. The result is considered an early example of the ": null
    },
    {
        "perpendicular style": "Perpendicular Periodperpendicular Gothic"
    },
    {
        " . Stokstad, p.77.        The most significant of Gaunts buildings is his great hall. The great hall replaced an earlier sequence of great halls on the same site, and was heavily influenced by ": null
    },
    {
        "Edward IIIs": "King Edward Iii Of England"
    },
    {
        "design at ": null
    },
    {
        "Windsor Castle": "Windsor Castle"
    },
    {
        ". Emery, p.205; Thompson 1977, pp.211–8. The hall consists of a ceremonial sequence of rooms , approached by a particularly grand staircase, now lost. Emery, p.246; Pettifer, p.258 From the great hall, visitors could look out to admire the Great Mere or the inner court through huge windows. Stokstad, p.78; Pettifer, p.258. The ": null
    },
    {
        "undercroft": "Undercroft"
    },
    {
        " to the hall, used by the service staff, was lit with slits, similar to design at the contemporary ": null
    },
    {
        "Wingfield Manor": "Wingfield Manor"
    },
    {
        ". The roof was built in 1376 by William Wintringham, producing the widest hall, unsupported by pillars, existing in England at the time. Emery, p.543; Emery 2000, p.401, 404. There is some debate amongst historians as to whether this roof was a ": null
    },
    {
        "hammerbeam design": "Hammerbeam Roof"
    },
    {
        ", a ": null
    },
    {
        "collar": "Collar Beam"
    },
    {
        " and ": null
    },
    {
        "truss-brace": "Truss"
    },
    {
        " design, or a combination of the two. An example of the combination of the curved hammerbeam and right-angled collar and truss-brace design can be seen in ": null
    },
    {
        "this depiction": ":Image:Westminster Hall Edited.Jpg"
    },
    {
        " of the roof of ": null
    },
    {
        "Westminster Hall": "The Palace Of Westminster"
    },
    {
        ".     There was an early attempt at symmetry in the external appearance of the great hall  – the Strong and Saintlowe Towers architecturally act as near symmetrical wings to the hall itself, while the plinth of the hall is designed to mirror that of the great tower opposite it. Emery 2000, p.340, 403; Morris 2010, p.13. An unusual multi-sided tower, the Oriel, provides a counterpoint to the main doorway of the hall and was intended for private entertainment by Gaunt away from the main festivities on major occasions. Hull 2009, p.118. The Oriel tower is based on Edward IIIs La Rose Tower at Windsor, which had a similar function. Morris 2010, p.17. Gaunts Strong Tower is so named for being entirely ": null
    },
    {
        "vaulted": "Vault"
    },
    {
        " in stone across all its floors, an unusual and robust design. Morris 2010, p.12. The great hall influenced the design of ": null
    },
    {
        "Bolton": "Bolton Castle"
    },
    {
        " and ": null
    },
    {
        "Raby castles": "Raby Castle"
    },
    {
        ", while the halls roof design became famous and was copied at ": null
    },
    {
        "Arundel Castle": "Arundel Castle"
    },
    {
        " and ": null
    },
    {
        "Westminster Hall": "Palace Of Westminsterwestminster Hall"
    },
    {
        ". Emery, p.205, 543.        Other parts of the castle built by Gaunt include the southern range of state apartments, Gaunts Tower and the main kitchen. Although now extensively damaged, these share the same style as the great hall; this would have unified the appearance of Gaunts palace in a distinct break from the more eclectic medieval tradition of design. Stokstad, pp.77–8. Gaunts kitchen replaced the original 12th-century kitchens, built alongside the great tower in a similar fashion to the arrangement at ": null
    },
    {
        "Conisbrough": "Conisbrough Castle"
    },
    {
        ". Thompson 1991, p.77. Gaunts new kitchen was twice the size of that in equivalent castles, measuring . Morris 2010, p.11.     The remainder of the inner court was built by ": null
    },
    {
        "Robert Dudley, the Earl of Leicester": "Robert Dudley, 1St Earl Of Leicester"
    },
    {
        ", in the 1570s. He built a tower now known as Leicesters building on the south edge of the court as a guest wing, extending out beyond the inner bailey wall for extra space. Morris 2010, p.19. Leicesters building was four floors high and built in a fashionable contemporary Tudor style with brittle, thin walls and grids of windows . Morris 2010, p.19, 48. The building was intended to appear well-proportioned alongside the ancient great tower, one of the reasons for its considerable height. Morris 2010, p.48. Leicesters building set the style for later Elizabethan country house design, especially in the Midlands, with ": null
    },
    {
        "Hardwick Hall": "Hardwick Hall"
    },
    {
        " being a classic example. Johnson 2000, p.234; Morris 2010, p.48. Modern viewing platforms, installed in 2014, provide views from ": null
    },
    {
        "Elizabeth Iss": "Elizabeth I Of England"
    },
    {
        "former bedroom. https://www.bbc.co.uk/news/uk-england-coventry-warwickshire-29053731 Leicesters Building at Kenilworth Castle reopened after more than 350 years, BBC News. Retrieved 11 November 2014.     Leicester also built a ": null
    },
    {
        "loggia": "Loggia"
    },
    {
        ", or open gallery, beside the great keep to lead to the new formal gardens. Stokstad, p.80. The loggia was designed to elegantly frame the view as the observer slowly admired the gardens, and was a new design in the 16th century, only recently imported from Italy.          The rest of Kenilworth Castles interior is divided into three areas: the base court, stretching between Mortimers Tower and Leicesters gatehouse; the left-hand court, stretching south-west around the outside of the inner court; and the right-hand court, to the north-west of the inner court. Morris 2010, p.6. The line of trees that cuts across the base court today is a relatively modern mid-19th century addition, and originally this court would have been more open, save for the collegiate chapel that once stood in front of the stables. Destroyed in 1524, only the chapels foundations remain. Morris 2010, p.29. Each of the courts was designed to be used for different purposes: the base court was considered a relatively public area, with the left and right courts used for more private occasions. Morris 2010, p.24.     Leicesters gatehouse was built on the north side of the base court, replacing an older gatehouse to provide a fashionable entrance from the direction of ": null
    },
    {
        "Coventry": "Coventry"
    },
    {
        ". Morris 2010, p.26. The external design, with its symbolic towers and, originally, battlements, echoes a style popular a century or more before, closely resembling ": null
    },
    {
        "Kirby Muxloe": "Kirby Muxloe Castle"
    },
    {
        " and the Beauchamp gatehouse at ": null
    },
    {
        "Warwick Castle": "Warwick Castle"
    },
    {
        ". Johnson 2000, p.233; Morris 2010, p.26, 47. By contrast the interior, with its contemporary wood panelling, is in the same, highly contemporary Elizabethan fashion of Leicesters building in the inner court. Johnson 2000, p.233. Leicesters gatehouse is one of the few parts of the castle to remain intact. The stables built by ": null
    },
    {
        "John Dudley": "John Dudley, 1St Duke Of Northumberland"
    },
    {
        " in the 1550s also survive and lie along the east side of the base court. Morris 2010, p.28. The stable block is a large building built mostly in stone, but with a timber-framed, decoratively panelled first storey designed in an anachronistic, vernacular style. Morris 2010, p.28; Johnson 2000, p.224. Both buildings could have easily been seen from Leicesters building and were therefore on permanent display to visitors. Leciesters intent may have been to create a deliberately anachronistic view across the base court, echoing the older ideals of chivalry and romance alongside the more modern aspects of the redesign of the castle. Johnson 2000, p.226; Stokstad, p.80.          Much of the right-hand court of Kenilworth Castle is occupied by the castle garden. For most of Kenilworths history the role of the castle garden, used for entertainment, would have been very distinct from that of the surrounding chase, used primarily for hunting. Colvin, p.12. From the 16th century onwards there were elaborate ": null
    },
    {
        "knot gardens": "Knot Garden"
    },
    {
        "in the base court. Hull 2006, p.114. The gardens today are designed to reproduce as closely as possible the primarily historical record of their original appearance in 1575, with a steep terrace along the south side of the gardens and steps leading down to eight square knot gardens. Morris 2010, pp.32–3; Greene and Moore, p.298. In Elizabethan gardens the plants were almost incidental , and instead the design focus was on sculptures, including four wooden obelisks painted to resemble ": null
    },
    {
        "porphyry": "Porphyry"
    },
    {
        " and a marble fountain with a statue of two ": null
    },
    {
        "Greek mythological figures": "Greek Mythology"
    },
    {
        ". Morris 2010, pp.32–3. A timber ": null
    },
    {
        "aviary": "Aviary"
    },
    {
        " contains a range of birds. Morris 2010, p.33. The original garden was heavily influenced by the ": null
    },
    {
        "Italian Renaissance garden": "Italian Renaissance Garden"
    },
    {
        " at ": null
    },
    {
        "Villa dEste": "Villa Deste"
    },
    {
        ". Morris 2010, p.34.     To the north-west of the castle are earthworks marking the spot of the Pleasance , created in 1414 by ": null
    },
    {
        "Henry V": "King Henry V Of England"
    },
    {
        ". The Pleasance was a banqueting house built in the style of a miniature castle. Surrounded by two diamond-shaped ": null
    },
    {
        "moats": "Moat"
    },
    {
        "with its own dock, the Pleasance was positioned on the far side of the Great Mere and had to be reached by boat. Hull 2006, p.114; Colvin, p.11; Emery 2000, p.404. It resembled ": null
    },
    {
        "Richard IIs": "King Richard Ii Of England"
    },
    {
        "retreat at ": null
    },
    {
        "Sheen": "Richmond, London"
    },
    {
        " from the 1380s, and was later copied by his younger brother, Duke Humphrey of Gloucester, at ": null
    },
    {
        "Greenwich": "Greenwich Palace"
    },
    {
        " in the 1430s, as well by his son, ": null
    },
    {
        "John of Lancaster": "John Of Lancaster, 1St Duke Of Bedford"
    },
    {
        " at ": null
    },
    {
        "Fulbrook": "Fulbrook, Warwickshire"
    },
    {
        ". Colvin, p.11; Emery 2000, p.340. The Pleasance was eventually dismantled by ": null
    },
    {
        "Henry VIII": "King Henry Viii Of England"
    },
    {
        " and partially moved into the left-hand court inside the castle itself, possibly to add to the anachronistic appearance. These elements were finally destroyed in the 1650s.               Kenilworth Castle was founded in the early 1120s by ": null
    },
    {
        "Geoffrey de Clinton": "Geoffrey De Clinton"
    },
    {
        ", Lord Chamberlain and treasurer to ": null
    },
    {
        "Henry I": "King Henry I Of England"
    },
    {
        ". Pettifer, p.257. The castles original form is uncertain. It has been suggested that it consisted of a ": null
    },
    {
        "motte": "Motte-And-Bailey"
    },
    {
        ", an earthen mound surmounted by wooden buildings; however, the stone ": null
    },
    {
        "great tower": "Keep"
    },
    {
        " may have been part of the original design. Clinton was a local rival to ": null
    },
    {
        "Roger de Beaumont": "Roger De Beaumont, 2Nd Earl Of Warwick"
    },
    {
        ", the Earl of Warwick and owner of the neighbouring ": null
    },
    {
        "Warwick Castle": "Warwick Castle"
    },
    {
        ", and the king made Clinton the ": null
    },
    {
        "sheriff": "Sheriff"
    },
    {
        " in Warwickshire to act as a counterbalance to Beaumonts power. Crouch, pp.116–7. Clinton had begun to lose the kings favour after 1130, and when he died in 1133 his son, also called Geoffrey, was only a minor. Geoffrey and his uncle ": null
    },
    {
        "William de Clinton": "William De Clinton"
    },
    {
        " were forced to come to terms with Beaumont; this set-back, and the difficult years of ": null
    },
    {
        "the Anarchy": "The Anarchy"
    },
    {
        " , delayed any further development of the castle.     ": null
    },
    {
        "Henry II": "Henry Ii Of England"
    },
    {
        " succeeded to the throne at the end of the Anarchy but during the ": null
    },
    {
        "revolt of 1173–74": "Revolt Of 1173–1174"
    },
    {
        " he faced a significant uprising led by his son, ": null
    },
    {
        "Henry": "Henry The Young King"
    },
    {
        ", backed by the French crown. The conflict spread across England and Kenilworth was garrisoned by Henry IIs forces; Geoffrey II de Clinton died in this period and the castle was taken fully into royal possession, a sign of its military importance. The Clintons themselves moved on to ": null
    },
    {
        "Buckinghamshire": "Buckinghamshire"
    },
    {
        ". By this point Kenilworth Castle consisted of the great keep, the inner bailey wall, a basic causeway across the smaller lake that preceded the creation of the Great Mere, and the local ": null
    },
    {
        "chase": "Chase"
    },
    {
        " for hunting.       Henrys successor, ": null
    },
    {
        "Richard I": "Richard I Of England"
    },
    {
        ", paid relatively little attention to Kenilworth, but under King ": null
    },
    {
        "John": "John I Of England"
    },
    {
        " significant building resumed at the castle. When John was excommunicated in 1208, he embarked on a programme of rebuilding and enhancing several major royal castles. These included ": null
    },
    {
        "Corfe": "Corfe Castle"
    },
    {
        ", ": null
    },
    {
        "Odiham": "Odiham Castle"
    },
    {
        ", ": null
    },
    {
        "Dover": "Dover Castle"
    },
    {
        ", ": null
    },
    {
        "Scarborough": "Scarborough Castle"
    },
    {
        " as well as Kenilworth. John spent £1,115 on Kenilworth Castle between 1210 and 1216, Allen Brown 1955, p.394, referenced in Cathcart King 1988, p.71. building the outer bailey wall in stone and improving the other defences, including creating Mortimers and Lunns Towers. Morris 2010, p.29, 37; Pettifer, p.257. Comparison of medieval financial figures with modern equivalents is challenging, especially with the larger sums of money used for projects such as castles. £1,100 could equate to from between £578,000 to £13m in 2009 terms, depending on the measure used. He also significantly improved the castles water defences by damming the Finham and Inchford Brooks, creating the Great Mere. Hull 2006, p.132. The result was to turn Kenilworth into one of the largest English castles of the time, with one of the largest artificial lake defences in England. Pettifer, p.257; Thompson 1965, p.156. John was forced to cede the castle to the baronial opposition as part of the guarantee of the ": null
    },
    {
        "Magna Carta": "Magna Carta"
    },
    {
        ", before it reverted to royal control early in the reign of his son, ": null
    },
    {
        "Henry III": "Henry Iii Of England"
    },
    {
        ".      Henry III granted Kenilworth in 1244 to ": null
    },
    {
        "Simon de Montfort": "Simon De Montfort, 6Th Earl Of Leicester"
    },
    {
        ", Earl of Leicester, who later became a leader in the ": null
    },
    {
        "Second Barons War": "Second Barons War"
    },
    {
        " against the king, using Kenilworth as the centre of his operations. Platt, p.85. Initially the conflict went badly for King Henry, and after the ": null
    },
    {
        "Battle of Lewes": "Battle Of Lewes"
    },
    {
        " in 1264 he was forced to sign the ": null
    },
    {
        "Mise of Lewes": "Mise Of Lewes"
    },
    {
        ", under which his son, ": null
    },
    {
        "Prince Edward": "Edward I Of England"
    },
    {
        ", was given over to the rebels as a hostage. Prestwich, pp.46–7. Edward was taken back to Kenilworth, where chroniclers considered he was held in unduly harsh conditions. Prestwich, p.47. Released in early 1265, Edward then defeated Montfort at the ": null
    },
    {
        "Battle of Evesham": "Battle Of Evesham"
    },
    {
        "; the surviving rebels under the leadership of ": null
    },
    {
        "Henry de Hastings": "Henry De Hastings, 1St Baron Hastings"
    },
    {
        ", Montforts ": null
    },
    {
        "constable": "Constableunited Kingdom"
    },
    {
        " at Kenilworth, regrouped at the castle the following spring. Carpenter 2004, p.381. Edwards forces proceeded to lay siege to the rebels. Prestwich, p.56.     The ": null
    },
    {
        "Siege of Kenilworth Castle": "Siege Of Kenilworth"
    },
    {
        " in 1266 was probably the longest in English history according to historian Norman Pounds, and at the time was also the largest siege to have occurred in England in terms of the number of soldiers involved. Pounds, p.121; Prestwich, p.56. Simon de Monforts son, ": null
    },
    {
        "Simon de Montfort the Younger": "Simon De Montfort The Younger"
    },
    {
        ", promised in January 1266 to hand over the castle to the king. Five months later this had not happened, and Henry III laid siege to Kenilworth Castle on 21  June. Morris 2010, p.40. Protected by the extensive water defences, the castle withstood the attack, despite Edward targeting the weaker north wall, employing huge ": null
    },
    {
        "siege towers": "Siege Tower"
    },
    {
        "and even attempting a night attack using barges brought from ": null
    },
    {
        "Chester": "Chester"
    },
    {
        ". Hull and Whitehorne, p.32; Morris 2010, p.40. The distance between the royal ": null
    },
    {
        "trebuchets": "Trebuchet"
    },
    {
        "and the walls severely reduced their effectiveness, and heavier trebuchets had to be sent for from London. Papal intervention through the legate ": null
    },
    {
        "Ottobuono": "Pope Adrian V"
    },
    {
        " finally resulted in the compromise of the ": null
    },
    {
        "Dictum of Kenilworth": "Dictum Of Kenilworth"
    },
    {
        ", under which the rebels were allowed to re-purchase their confiscated lands provided they surrendered the castle; Carpenter 2004, p.381; Prestwich, p.57. the siege ended on 14  December 1266. Morris, p.41. The water defences at Kenilworth influenced the construction of later castles in Wales, most notably ": null
    },
    {
        "Caerphilly": "Caerphilly Castle"
    },
    {
        ". Hull 2006, p.77.     Henry granted Kenilworth to his son, ": null
    },
    {
        "Edmund Crouchback": "Edmund Crouchback"
    },
    {
        ", in 1267. Hull and Whitehorne, p.32; Sharpe, p.13; Morris 2010, p.41. Edmund held many tournaments at Kenilworth in the late 13th century, including a huge event in 1279, presided over by the royal favourite ": null
    },
    {
        "Roger de Mortimer": "Roger Mortimer, 1St Baron Mortimer"
    },
    {
        ", in which a hundred knights competed for three days in the tiltyard in an event called ": null
    },
    {
        "the Round Table": "Round Table"
    },
    {
        " , in imitation of the popular ": null
    },
    {
        "Arthurian legends": "King Arthur"
    },
    {
        ".          Edmund Crouchback passed on the castle to his eldest son, ": null
    },
    {
        "Thomas, Earl of Lancaster": "Thomas, 2Nd Earl Of Lancaster"
    },
    {
        ", in 1298. Weir, p.105. Lancaster married ": null
    },
    {
        "Alice de Lacy": "Alice De Lacy, 4Th Countess Of Lincoln"
    },
    {
        ", which made him the richest nobleman in England. Pounds, p.137. Kenilworth became the primary castle of the Lancaster estates, replacing ": null
    },
    {
        "Bolingbroke": "Bolingbroke Castle"
    },
    {
        ", and acted as both a social and a financial centre for Thomas. Thomas built the first great hall at the castle from 1314 to 1317 and constructed the Water Tower along the outer bailey, as well as increasing the size of the chase. Morris 2010, p.14, 29; Thompson 1977, pp.211–8. Lancaster, with support from many of the other English barons, found himself in increasing opposition to ": null
    },
    {
        "Edward II": "Edward Ii Of England"
    },
    {
        ". War broke out in 1322, and Lancaster was captured at the ": null
    },
    {
        "Battle of Boroughbridge": "Battle Of Boroughbridge"
    },
    {
        " and executed. His estates, including Kenilworth, were confiscated by the crown. Edward and his wife, ": null
    },
    {
        "Isabella of France": "Isabella Of France"
    },
    {
        ", spent Christmas 1323 at Kenilworth, amidst major celebrations. Weir, p.157.     In 1326, however, Edward was deposed by an alliance of Isabella and her lover, ": null
    },
    {
        "Roger Mortimer": "Roger Mortimer, 1St Earl Of March"
    },
    {
        ". Edward was eventually captured by Isabellas forces and the custody of the king was assigned to ": null
    },
    {
        "Henry, Earl of Lancaster": "Henry, 3Rd Earl Of Lancaster"
    },
    {
        ", who had backed Isabellas invasion. Weir, p.241. Henry, reoccupying most of the Lancaster lands, was made constable of Kenilworth and Edward was transported there in late 1326; Henrys legal title to the castle was finally confirmed the following year. Morris 2010, p.41; Weir, p.241. Kenilworth was chosen for this purpose by Isabella probably both because it was a major fortification, and also because of the symbolism of its former owners links to popular ideals of freedom and good government. Weir, p.242. Royal ": null
    },
    {
        "writs": "Writ"
    },
    {
        "were issued in Edwards name by Isabella from Kenilworth until the next year. Weir, p.242; Mortimer, p.51. A deputation of leading barons led by ": null
    },
    {
        "Bishop Orleton": "Adam Orleton"
    },
    {
        " was then sent to Kenilworth to first persuade Edward to resign and, when that failed, to inform him that he had been deposed as king. Weir, pp.252–3. Edward formally resigned as king in the great hall of the castle on 21 January 1327. Mortimer, p.53. As the months went by, however, it became clear that Kenilworth was proving a less than ideal location to imprison Edward. Doherty, pp.114–5. The castle was in a prominent part of the Midlands, in an area that held several nobles who still supported Edward and were believed to be trying to rescue him. Henrys loyalty was also coming under question. In due course, Isabella and Mortimer had Edward moved by night to ": null
    },
    {
        "Berkeley Castle": "Berkeley Castle"
    },
    {
        ", where he died shortly afterwards. Doherty, pp.114–5; p.118. Isabella continued to use Kenilworth as a royal castle until her fall from power in 1330. Mortimer, p.75.     ": null
    },
    {
        "Henry of Grosmont, the Duke of Lancaster": "Henry Of Grosmont, 1St Duke Of Lancaster"
    },
    {
        ", inherited the castle from his father in 1345 and remodelled the great hall with a grander interior and roof. Morris 2010, p.14; Thompson 1977, pp.211–8. On his death ": null
    },
    {
        "Blanche of Lancaster": "Blanche Of Lancaster"
    },
    {
        " inherited the castle. Blanche married ": null
    },
    {
        "John of Gaunt": "John Of Gaunt"
    },
    {
        ", the third son of ": null
    },
    {
        "Edward III": "Edward Iii Of England"
    },
    {
        "; their union, and combined resources, made John the second richest man in England next to the king himself. After Blanches death, John married ": null
    },
    {
        "Constance": "Constance Of Castile, Duchess Of Lancaster"
    },
    {
        ", who had a claim to the ": null
    },
    {
        "kingdom of Castile": "Kingdom Of Castile"
    },
    {
        ", and John styled himself the king of Castile and León. Kenilworth was one of the most important of his thirty or more castles in England. John began building at Kenilworth between 1373 and 1380 in a style designed to reinforce his royal claims in Iberia. Emery, p.205. John constructed a grander great hall, the Strong Tower, Saintlowe Tower, the state apartments and the new kitchen complex. Morris 2010, pp.42–5. When not campaigning abroad, John spent much of his time at Kenilworth and ": null
    },
    {
        "Leicester": "Leicester Castle"
    },
    {
        ", and used Kenilworth even more after 1395 when his health began to decline. Emery, p.28; Emery 2000, p.404. In his final years, John made extensive repairs to the whole of the castle complex. Morris 2010, p.45.          Many castles, especially royal castles, were left to decay in the 15th century; Kenilworth, however, continued to be used as a centre of choice, forming a late medieval palace fortress . Pounds, p.256–7. ": null
    },
    {
        "Henry IV": "King Henry Iv Of England"
    },
    {
        ", John of Gaunts son, returned Kenilworth to royal ownership when he took the throne in 1399 and made extensive use of the castle. ": null
    },
    {
        "Henry V": "King Henry V Of England"
    },
    {
        " also used Kenilworth extensively, but preferred to stay in the Pleasance, the mock castle he had built on the other side of the Great Mere. According to the contemporary chronicler ": null
    },
    {
        "John Strecche": "John Strecche"
    },
    {
        ", who lived at the neighbouring ": null
    },
    {
        "Kenilworth Priory": "St Marys Abbey, Kenilworth"
    },
    {
        ", the French openly mocked Henry in 1414 by sending him a gift of ": null
    },
    {
        "tennis balls": "Tennis Ball"
    },
    {
        "at Kenilworth. Walsingham, Preest and Clark, p.399. The French aim was to imply a lack of martial prowess; according to Strecche, the gift spurred Henrys decision to fight the ": null
    },
    {
        "Agincourt campaign": "Battle Of Agincourt"
    },
    {
        ". The account was used by ": null
    },
    {
        "Shakespeare": "William Shakespeare"
    },
    {
        " as the basis for a scene in his play  Henry V .     English castles, including Kenilworth, did not play a decisive role during the ": null
    },
    {
        "Wars of the Roses": "Wars Of The Roses"
    },
    {
        " , which were fought primarily in the form of pitched battles between the rival factions of the ": null
    },
    {
        "Lancastrians": "House Of Lancaster"
    },
    {
        " and the ": null
    },
    {
        "Yorkists": "House Of York"
    },
    {
        ". Pounds, p.249. With the mental collapse of ": null
    },
    {
        "King Henry VI": "King Henry Vi"
    },
    {
        ", ": null
    },
    {
        "Queen Margaret": "Margaret Of Anjou"
    },
    {
        " used the Duchy of Lancaster lands in the Midlands, including Kenilworth, as one of her key bases of military support. Carpenter 1997, p.142. Margaret removed Henry from London in 1456 for his own safety and until 1461, Henrys court divided almost all its time among Kenilworth, ": null
    },
    {
        "Leicester": "Leicester Castle"
    },
    {
        " and ": null
    },
    {
        "Tutbury Castle": "Tutbury Castle"
    },
    {
        " for the purposes of protection. Emery 2000, p.200. Kenilworth remained an important Lancastrian stronghold for the rest of the war, often acting as a military balance to the nearby castle of ": null
    },
    {
        "Warwick": "Warwick Castle"
    },
    {
        ". With the victory of ": null
    },
    {
        "Henry VII": "Henry Vii Of England"
    },
    {
        " at ": null
    },
    {
        "Bosworth": "Battle Of Bosworth Field"
    },
    {
        ", Kenilworth again received royal attention; Henry visited frequently and had a ": null
    },
    {
        "tennis court": "Real Tennis"
    },
    {
        " constructed at the castle for his use. His son, ": null
    },
    {
        "Henry VIII": "Henry Viii Of England"
    },
    {
        ", decided that Kenilworth should be maintained as a royal castle. He abandoned the Pleasance and had part of the timber construction moved into the base court of the castle.          The castle remained in royal hands until it was given to ": null
    },
    {
        "John Dudley": "John Dudley"
    },
    {
        " in 1553. Dudley came to prominence under ": null
    },
    {
        "Henry VIII": "King Henry Viii Of England"
    },
    {
        " and became the leading political figure under ": null
    },
    {
        "Edward VI": "Edward Vi Of England"
    },
    {
        ". Dudley was a patron of ": null
    },
    {
        "John Shute": "John Shute"
    },
    {
        ", an early exponent of classical architecture in England, and began the process of modernising Kenilworth. Morris 2010, p.46. Before his execution in 1553 by ": null
    },
    {
        "Queen Mary": "Mary I Of England"
    },
    {
        " for attempting to place ": null
    },
    {
        "Lady Jane Grey": "Lady Jane Grey"
    },
    {
        " on the throne, Dudley had built the new stable block and widened the tiltyard to its current form.     Kenilworth was restored to Dudleys son, ": null
    },
    {
        "Robert, Earl of Leicester": "Robert Dudley, Earl Of Leicester"
    },
    {
        ", in 1563, four years after the succession of Elizabeth I to the throne. Leicesters lands in Warwickshire were worth between £500–£700 but Leicesters power and wealth, including ": null
    },
    {
        "monopolies": "Monopolyhistorical Monopolies"
    },
    {
        " and grants of new lands, depended ultimately on his remaining a favourite of the queen. Asch, p.43.     Leicester continued his fathers modernisation of Kenilworth, attempting to ensure that Kenilworth would attract the interest of Elizabeth during her regular tours around the country. Elizabeth visited in 1566 and 1568, by which time Leicester had commissioned the royal architect Henry Hawthorne to produce plans for a dramatic, classical extension of the south side of the inner court. Morris 2007, pp.22–35; Morris 2010, p.46. In the event this proved unachievable and instead Leicester employed William Spicer to rebuild and extend the castle so as to provide modern accommodation for the royal court and symbolically boost his own claims to noble heritage. Morris 2010, pp.46–7. After negotiation with his tenants, Leicester also increased the size of the chase once again. Adams p.326. The result has been termed an English Renaissance palace . Johnson 2002, p.142.     Elizabeth viewed the partially finished results at Kenilworth in 1572, but the complete effect of Leicesters work was only apparent during the queens last visit in 1575. Hull and Whitehorne, p.32; Morris 2010, p.47. Leicester was keen to impress Elizabeth in a final attempt to convince her to marry him, and no expense was spared. Morris 2010, p.53. Elizabeth brought an entourage of thirty-one barons and four hundred staff for the royal visit that lasted an exceptional nineteen days; twenty horsemen a day arrived at the castle to communicate royal messages. Hull and Whitehorne, p.32; Morris 2010, p.47; Johnson 2000, p.266. Leicester entertained the Queen and much of the neighbouring region with pageants, fireworks, ": null
    },
    {
        "bear baiting": "Bear-Baiting"
    },
    {
        ", ": null
    },
    {
        "mystery play": "Mystery Play"
    },
    {
        "s, hunting and lavish banquets. Hull and Whitehorne, p.32. The cost was reputed to have amounted to many thousand pounds, almost bankrupting Leicester, though it probably did not exceed £1,700 in reality. Haynes, pp.119–120. The event was considered a huge success and formed the longest stay at such a property during any of Elizabeths tours, yet the queen did not decide to marry Leicester.     Kenilworth Castle was valued at £10,401 in 1588, when Leicester died without legitimate issue and heavily in debt. Sharpe, p.28. In accordance with his will, the castle passed first to his brother ": null
    },
    {
        "Ambrose, Earl of Warwick": "Ambrose Dudley, 3Rd Earl Of Warwick"
    },
    {
        ", and after the latters death in 1590, to his illegitimate son, ": null
    },
    {
        "Sir Robert Dudley": "Robert Dudley"
    },
    {
        ". Adams, Simon. ,  Oxford Dictionary of National Biography , online , Oxford University Press.            Sir Robert Dudley, having tried and failed to establish his legitimacy in front of the Court of the ": null
    },
    {
        "Star Chamber": "Star Chamber"
    },
    {
        ", went to Italy in 1605. In the same year ": null
    },
    {
        "Sir Thomas Chaloner": "Thomas Chaloner"
    },
    {
        ", governor to ": null
    },
    {
        "James Is": "James I Of England"
    },
    {
        " eldest son ": null
    },
    {
        "Prince Henry": "Henry Frederick, Prince Of Wales"
    },
    {
        ", was commissioned to oversee repairs to the castle and its grounds, including the planting of gardens, the restoration of fish-ponds and improvement to the game park. Westby-Gibson, p. 459 During 1611–12 Dudley arranged to sell Kenilworth Castle to Henry, by then Prince of Wales. Henry died before completing the full purchase, which was finalised by his brother, ": null
    },
    {
        "Charles": "King Charles I Of England"
    },
    {
        ", Sharpe, p. 29 who bought out the interest of Dudleys abandoned wife, ": null
    },
    {
        "Alice Dudley": "Alice Dudley, Duchess Of Dudley"
    },
    {
        ". When Charles became king, he gave the castle to his wife, ": null
    },
    {
        "Henrietta Maria": "Henrietta Maria Of France"
    },
    {
        "; he bestowed the stewardship on ": null
    },
    {
        "Robert Carey, Earl of Monmouth": "Robert Carey, 1St Earl Of Monmouth"
    },
    {
        ", and after his death gave it to Careys sons ": null
    },
    {
        "Henry": "Henry Carey, 2Nd Earl Of Monmouth"
    },
    {
        " and ": null
    },
    {
        "Thomas": "Thomas Carey"
    },
    {
        ". Sharpe, p. 29; Morris 2010, p. 48 Kenilworth remained a popular location for both ": null
    },
    {
        "King James I": "James I Of England"
    },
    {
        " and his son Charles, and accordingly was well maintained. The most famous royal visit occurred in 1624, when ": null
    },
    {
        "Ben Jonsons": "Ben Jonson"
    },
    {
        " The Masque of Owls at Kenilworth was performed for Charles.     The ": null
    },
    {
        "First English Civil War": "First English Civil War"
    },
    {
        " broke out in 1642. During its early campaigns, Kenilworth formed a useful counterbalance to the Parliamentary stronghold of Warwick. Roberts and Tincey, p. 46 Kenilworth was used by Charles on his advance to ": null
    },
    {
        "Edgehill": "Battle Of Edgehill"
    },
    {
        " in October 1642 as a base for raids on Parliamentary strongholds in the Midlands. After the battle, however, the royalist garrison was withdrawn on the approach of ": null
    },
    {
        "Lord Brooke": "Robert Greville, 2Nd Baron Brooke"
    },
    {
        ", and the castle was then garrisoned by parliamentary forces. Hughes, p. 148 In April 1643 the new governor of the castle, Hastings Ingram, was arrested as a suspected Royalist ": null
    },
    {
        "double agent": "Double Agent"
    },
    {
        ". Hughes, p. 181 By January 1645 the Parliamentary forces in Coventry had strengthened their hold on the castle, and attempts by Royalist forces to dislodge them from Warwickshire failed. Hutton, p. 46 Security concerns continued after the end of the ": null
    },
    {
        "First Civil War": "First English Civil War"
    },
    {
        " in 1646, and in 1649 Parliament ordered the ": null
    },
    {
        "slighting": "Slighting"
    },
    {
        " of Kenilworth. One wall of the great tower, various parts of the outer bailey and the battlements were destroyed, but not before the building was surveyed by the antiquarian ": null
    },
    {
        "William Dugdale": "William Dugdale"
    },
    {
        ", who published his results in 1656. Morris 2010, p.50.     Colonel Joseph Hawkesworth, responsible for the implementation of the slighting, acquired the estate for himself and converted Leicesters gatehouse into a house; part of the base court was turned into a farm, and many of the remaining buildings were stripped for their materials. In 1660 ": null
    },
    {
        "Charles II": "King Charles Ii Of England"
    },
    {
        " was restored to the throne, and Hawkesworth was promptly evicted from Kenilworth. Morris 2010, p.51. The Queen Mother, Henrietta Maria, briefly regained the castle, with the Earls of Monmouth acting as stewards once again, but after her death King Charles II granted the castle to ": null
    },
    {
        "Sir Edward Hyde": "Edward Hyde, 1St Earl Of Clarendon"
    },
    {
        ", whom he later created Baron Hyde of Hindon and Earl of Clarendon. Sharpe, p.29; Morris 2010, p.51. The ruined castle continued to be used as a farm, with the gatehouse as the principal dwelling; the Kings Gate was added to the outer bailey wall during this period for the use of farm workers.               Kenilworth remained a ruin during the 18th and 19th centuries, still used as a farm but increasingly also popular as a tourist attraction. The first guidebook to the castle, A Concise history and description of Kenilworth Castle, was printed in 1777 with many later editions following in the coming decades. See Sharpe, 1825 for the 25th edition of the original guidebook.   The castles cultural prominence increased after Sir ": null
    },
    {
        "Walter Scott": "Walter Scott"
    },
    {
        " wrote  Kenilworth  in 1821 describing the royal visit of Queen Elizabeth. Very loosely based on the events of 1575, Scotts story reinvented aspects of the castle and its history to tell the story of the pathetic, beautiful, undisciplined heroine ": null
    },
    {
        "Amy Robsart": "Amy Robsart"
    },
    {
        " and the steely Elizabeth I . Shaw, p.177. Although considered today as a less successful literary novel than some of his other historical works, it popularised Kenilworth Castle in the ": null
    },
    {
        "Victorian": "Victorian Era"
    },
    {
        " imagination as a romantic Elizabethan location. Morris 2010, pp.51–2; Shaw, p.177. Kenilworth spawned numerous stage adaptations and ": null
    },
    {
        "burlesque": "Burlesque"
    },
    {
        "s, at least eleven operas, popular ": null
    },
    {
        "redaction": "Redaction"
    },
    {
        "s, and even a scene in a set of ": null
    },
    {
        "dioramas": "Diorama"
    },
    {
        "for home display , including Sir ": null
    },
    {
        "Arthur Sullivans": "Arthur Sullivan"
    },
    {
        "1865 ": null
    },
    {
        "cantata": "Cantata"
    },
    {
        "  The Masque at Kenilworth . Hackett, p.60. ": null
    },
    {
        "J. M. W. Turner": "J. M. W. Turner"
    },
    {
        " painted several watercolours of the castle. http://www.tate.org.uk/art/research-publications/jmw-turner/joseph-mallord-william-turner-kenilworth-castle-from-the-south-west-r1148669 J.M.W. Turner: Sketchbooks, Drawings and Watercolours, Tate. Retrieved 20 March 2016.     The number of visitors increased, including ": null
    },
    {
        "Queen Victoria": "Queen Victoria"
    },
    {
        " and ": null
    },
    {
        "Charles Dickens": "Charles Dickens"
    },
    {
        ". Morris 2010, p.52. Work was undertaken during the 19th century to protect the stonework from further decline, with particular efforts to remove ": null
    },
    {
        "ivy": "Ivy"
    },
    {
        " from the castle in the 1860s.          The castle remained the property of the Clarendons until 1937, when ": null
    },
    {
        "Lord Clarendon": "George Villiers, 6Th Earl Of Clarendon"
    },
    {
        " found the maintenance of the castle too expensive and sold Kenilworth to the industrialist ": null
    },
    {
        "Sir John Siddeley": "John Davenport Siddeley, 1St Baron Kenilworth"
    },
    {
        ". Siddeley, whose tax accounting in the 1930s had been at least questionable, was keen to improve his public image and gave over the running of the castle, complete with a charitable donation, to the ": null
    },
    {
        "Commissioner of Works": "First Commissioner Of Works"
    },
    {
        ". Smith, p.302. In 1958 his son gave the castle itself to the town of Kenilworth and ": null
    },
    {
        "English Heritage": "English Heritage"
    },
    {
        " has managed the property since 1984 and is open to the public. Smith, p.302; Morris, p.52.  The castle is classed as a Grade I ": null
    },
    {
        "listed building": "Listed Building"
    },
    {
        " and as a ": null
    },
    {
        "Scheduled Monument": "Scheduled Monument"
    },
    {
        ".      Between 2005 and 2009, English Heritage attempted to restore Kenilworths garden more closely to its Elizabethan form, using as a basis the description in the ": null
    },
    {
        "Langham letter": "Langham Letter"
    },
    {
        " and details from recent archaeological investigations. http://www.english-heritage.org.uk/server/show/nav.20667 Introduction to the Elizabethan Garden, English Heritage. Retrieved 10 October 2010. The reconstruction cost more than £2  million and was criticised by some archaeologists as being a matter of simulation as much as reconstruction , due to the limited amount of factual information on the nature of the original gardens. Greene and Moore, p.298. In 2008 plans were put forward to re-create and flood the original Great Mere around the castle. As well as re-creating the look of the castle it was hoped that a new mere would be part of the ongoing flood alleviation plan for the area and that the lake could be used for boating and other waterside recreations.    ": null
    }
]