[
    {
        "Kensington is an ": null
    },
    {
        "abstract strategy": "abstract strategy game"
    },
    {
        " board game": "board game"
    },
    {
        " devised by Brian Taylor and Peter Forbes in 42 named after ": null
    },
    {
        "London": "london"
    },
    {
        "s ": null
    },
    {
        "Kensington Gardens": "kensington gardens"
    },
    {
        ", which contains the mosaic upon which the gameboard is patterned. It is played on a geometrical board based on the ": null
    },
    {
        "rhombitrihexagonal tiling": "rhombitrihexagonal tiling"
    },
    {
        " pattern. The objective of the game is to capture a hexagon by occupying the six surrounding vertices. The game maintains an elegant simplicity while still allowing for astonishingly complex strategy. The placing and movement of tokens have been compared to ": null
    },
    {
        "nine mens morris": "nine mens morris"
    },
    {
        ".       The gameboard geometry is based on ": null
    },
    {
        "rhombitrihexagonal tiling": "rhombitrihexagonal tiling"
    },
    {
        " and consists of a combination of seven regular hexagons, thirty squares, and twenty-four triangles. Each player can win on the two hexagons of their respective colour. Additionally, there are three neutral hexagons across the centre of the board which either player can win on. The board is composed of 42 total vertices where tokens can be located. Once all the tokens have been placed down, the board reaches about 42% saturation.       The two players, Red and Blue, alternately place tokens on the intersections of the board until each has placed fifteen. Thereafter they alternate turns sliding a single token along a line to an adjacent vertex.     A player who occupies the three vertices of any triangle has formed a mill and may relocate one enemy token. Occupying the four vertices of a square  allows the player to relocate two enemy tokens. No more than two tokens may be relocated in a single turn, even if a player completes a mill and double mill with the same move.     The winner is the first player to occupy all six vertices of either any neutral hexagon or one of his/her own color. A win can be achieved during either the placement or movement phases of the game.       There is debate in the Kensington community as to the relative advantage of placing first or second. The player to place second also gets to place last which is a definite advantage because that placement cannot be directly countered. This advantage is offset by the other player being able to move first in the sliding phase. Most beginning players will find more success placing second. Often, the player who makes the first mill is able to scatter the opponents tokens and win without difficulty. However, a skilled player may be able to recover from an opponents mill. Relocated tokens can group together to form a mill across the board from their original locations. A popular strategy is to use ones tokens to form jails where the opponent’s relocated tokens are sequestered and unable to form mills or hexagons.     Defense is very difficult thus much the game revolves around being first to secure a mill. The game often ends soon after the first mill is formed. A very powerful configuration is to be able to move a single token back and forth between two spaces creating a mill each turn. This results in certain victory.       In a business venture parallel to  Trivial Pursuit  in Canada, the British inventors set up their own company to make and publish the game. This attracted a fair amount of press attention at the time and Kensington picked up a UK Game of the Year award. Attention for the game was short-lived and the game is now out of print, however secondhand copies are readily available online.       A 42 edition was sold in a package resembling a double-LP album. The front part had a cut-out showing the centre of the one-piece non-folding gameboard which could be slid out of the sleeve like an LP. Rules were printed on the inside and the rear side showed the authors playing the game on the steps of the ": null
    },
    {
        "Albert Memorial": "albert memorial"
    }
]