[
    {
        "The Kerio River is a river in ": null
    },
    {
        "Turkana County": "turkana county"
    },
    {
        ", ": null
    },
    {
        "Kenya": "kenya"
    },
    {
        ". It flows northward into ": null
    },
    {
        "Lake Turkana": "lake turkana"
    },
    {
        ". It is one of the longest rivers in Kenya, originating near the ": null
    },
    {
        "equator": "equator"
    },
    {
        ".         The Kerio River rises on the north slopes of the Amasya Hills to the west of Lake Bogoria.   It flows northward through the ": null
    },
    {
        "Kerio Valley": "kerio valley"
    },
    {
        " between ": null
    },
    {
        "Tugen Hills": "tugen hills"
    },
    {
        " and ": null
    },
    {
        "Elgeyo Escarpment": "elgeyo escarpment"
    },
    {
        ".   The Elgeyo Escarpment rises to over  above the Kerio valley in places.   The Kerio continues northward, often through deep and narrow valleys, to enter Lake Turkana in a delta just south of the delta formed by the ": null
    },
    {
        "Turkwel": "turkwel river"
    },
    {
        " and ": null
    },
    {
        "Lokichar": "lokichar river"
    },
    {
        " rivers.   The Kerio and Turkwel contribute 42% of the river water flowing into Lake Turkana on Kenyan territory . In their lower courses both these rivers are seasonal.     Near its source the Kerio River is fed by two major tributaries flowing down Elgeyo Escarpment: Arror River, and Embobut River.         The Lake Kamnarok National Reserve and ": null
    },
    {
        "Kerio Valley National Reserve": "kerio valley national reserve"
    },
    {
        " lie on the east and west sides of the Kerio River in the upper valley. They are undeveloped, but have abundant birdlife and are known for their scenery.   The left bank of a  section of the river is in the ": null
    },
    {
        "South Turkana National Reserve": "south turkana national reserve"
    },
    {
        ".     In 42 there were allegations that Fluorspar Mines was dumping toxic waste into the river. These were denied by the responsible Minister for Mineral Exploration.   The main locations in ": null
    },
    {
        "Turkana District": "turkana district"
    },
    {
        " for irrigated agriculture are along the Turkwel and Kerio rivers. The Lotubai and Morulem irrigation schemes are on the Kerio.   The main crops are maize and sorghum, which account for 42% of irrigated crops, as well as green grams, cowpeas, bananas, mangoes, oranges and guavas.": null
    }
]