[
    {
        "        Kerry Allen Livgren is an American musician and songwriter, best known as one of the founding members and primary songwriters for the 42s ": null
    },
    {
        "progressive rock": "progressive rock"
    },
    {
        " band ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        ".       Livgren was raised in ": null
    },
    {
        "Topeka, Kansas": "topeka, kansas"
    },
    {
        " by his father, Allen Leroy, an industrial engineer, and his mother, Betty . He was drawn to music at a young age, and his first musical interests developed with classical and jazz influences. His musical odyssey started with an electric guitar he built using a cheap Stella guitar, a Sears amplifier and a low-quality Astatic microphone. Along with learning guitar, Livgren also focused on learning to write songs due to his desire for more creative expression and originality. He attended ": null
    },
    {
        "Washburn University": "washburn university"
    },
    {
        " for some time.       Livgren was a member of numerous bands in the late 42s and early 42s and quickly developed a reputation for complex compositions and poetic lyrics that explored spiritual themes. His investigations into various religions are reflected in the lyrics of his songs on Kansas first six albums.     Livgren formed his first band, the Gimlets, with several close friends in high school including John Pribble, drums, Scott Kessler, bass, Tim Strauss, guitar, and Dan Wright on keyboards. They soon found themselves booked after school and on weekends throughout Kansas and neighboring Missouri, where they played their original compositions, which were a blend of pop, English and psychedelic rock. After graduating from Topeka West High School in 42 Livgren continued to perform with the Gimlets through college before joining a predominantly black mainstream rhythm and blues band named the Mellotones, in which he met keyboard player Don Montre in 42     Forming a deep friendship, Livgren and Montre decided to leave the Mellotones and join the more commercially viable band ": null
    },
    {
        "The Reasons Why": "kansas"
    },
    {
        ", which included ": null
    },
    {
        "Lynn Meredith": "lynn meredith"
    },
    {
        " and Wright. Though this band was doing well financially, Livgren became frustrated because of his desire for more creative expression, and he and Montre decided to start their own band. They briefly reformed the Gimlets with former members Scott Kessler and Wright along with several new members. A short time later, they renamed the band Saratoga after the name on the pencil that Livgren was using to write songs. Saratoga included Meredith, Montre, Wright, Livgren, ": null
    },
    {
        "Phil Ehart": "phil ehart"
    },
    {
        " and ": null
    },
    {
        "Dave Hope": "dave hope"
    },
    {
        ".     In 42 Livgren and Ehart decided to form a new group by combining the best members from Saratoga and Phils band ": null
    },
    {
        "White Clover": "white clover"
    },
    {
        " . While Livgren and Ehart were discussing what to call the new band, Hope walked in on the conversation and suggested they call themselves Kansas. This version of Kansas was known for its complex musical arrangements and originality, but this lineup lasted for only one year.     In 42 Ehart and Hope left the group, and Livgren reworked the band and continued it under the name Kansas. . Kansas II continued to perform Livgrens original works that fused experimental rock with psychedelia and jazz. During this time, Kansas II recorded a demo cassette that was released commercially 42 years later. Kansas II generated a loyal fan following, and the built-in audience helped the band secure concert bookings. However, financial problems plagued the band, and after a record deal with ": null
    },
    {
        "Jefferson Airplane": "jefferson airplane"
    },
    {
        "s label failed to materialize and an old school bus broke down while the band was on the road touring, the band dissolved in 42     Shortly afterward, Livgren was invited by Ehart to join the reformed White Clover, which also included vocalist Walsh, violinist ": null
    },
    {
        "Robby Steinhardt": "robby steinhardt"
    },
    {
        ", bassist Hope, guitarist Williams and Ehart on drums. Before Livgren joined the band, White Clover had sent out a five-song demo tape, which ": null
    },
    {
        "Don Kirshner": "don kirshner"
    },
    {
        " was interested in for his new label. As part of the effort to sign with Kirshner, the players soon renamed themselves ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        ", becoming the third, and eventually the best-known, lineup to use this name.       After three albums in two years failed to provide them with a hit single, ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        " was under pressure from Kirshner and CBS records to write a hit. Livgren and the band realized it was their last chance. Due to Walsh experiencing writers block, Livgren wrote or co-wrote all the songs for the groups fourth album,  Leftoverture . On the last day of rehearsal for the new album, Livgren brought the band one more song, which they performed once before heading to the studio. The song, ": null
    },
    {
        "Carry On Wayward Son": "carry on wayward son"
    },
    {
        " , became Kansas first hit, reaching No. 42     Riding the success of  Leftoverture , Livgren wrote ": null
    },
    {
        "Dust in the Wind": "dust in the wind"
    },
    {
        " for the  Point of Know Return  album. Like Carry On Wayward Son, Dust in the Wind was added to the album at the last minute. Livgren said the song was an acoustic guitar warmup. While playing it one day at home when his wife was doing laundry, she told him he should put it on the album. Since the album at that point had extra time available, he presented the song to the band and it was included. It became their highest charting single, reaching No. 42        In early 42 Livgren became interested in ": null
    },
    {
        "The Urantia Book": "the urantia book"
    },
    {
        ", a series of papers that claim to be a revelation authored by supernatural beings. Its influence can be felt in the lyrics of Kansas 42 album  Monolith . Livgren subsequently rejected Urantia doctrine, and while on tour with the band in support of Monolith, he converted to Christianity. This was a result of a series of debates in the back of the tour bus with Jeff Pollard of ": null
    },
    {
        "Louisianas Le Roux": "louisianas le roux"
    },
    {
        ", the opening act for Kansas during the tour. The discussions between Livgren and Pollard concerned whether the Bible or the Urantia Book was the accurate record of the life of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        ". Because of the debates, Livgren became convinced that the Bible was the genuine record of Christ and that he had been mistaken in following the teachings of the Urantia Book. After a private hotel room conversion experience, he became an evangelical Christian.     In 42 Livgren released his first solo album,  Seeds of Change . The album features several members of Kansas, along with ": null
    },
    {
        "Ambrosia": "ambrosia"
    },
    {
        " singer ": null
    },
    {
        "David Pack": "david pack"
    },
    {
        " and noted heavy metal singer ": null
    },
    {
        "Ronnie James Dio": "ronnie james dio"
    },
    {
        ", who sang on the tracks To Live for the King and Mask of the Great Deceiver.     Livgren recorded three more albums with Kansas. However, tension was growing among the band members as a result of the increasingly Christian perspective of his lyrics. Walsh left the band near the end of 42 as a result, with Steinhardt following suit prior to recording of the bands 42  Drastic Measures  album. Meanwhile, ironically, Livgren had also become increasingly dissatisfied with the bands musical direction , and he would leave the band himself shortly after Drastic Measures was released.     Livgren has continued to appear occasionally with Kansas on various tours since the 42s and contributed new songs to  The Kansas Boxed Set  in 42 and to  Freaks of Nature  in 42 . In 42 the original and current members of Kansas reunited at Livgrens studio to record a new album written entirely by Livgren, titled  Somewhere to Elsewhere . Though the album received very favorable reviews, sales were not comparable to Kansas past successes decades earlier.       In 42 after his departure from Kansas, Livgren recorded his second self-produced album for CBS,  Time Line  with Hope, ": null
    },
    {
        "Warren Ham": "warren ham"
    },
    {
        ", ": null
    },
    {
        "Michael Gleason": "michael gleason"
    },
    {
        " and drummer Dennis Holt. By the end of the recording sessions, the session musicians had jelled, and he decided to name the group ": null
    },
    {
        "AD": "ad"
    },
    {
        ".     Due to legal entanglements caused by his contractual obligations with Kansas, Livgren was unable to market AD in the mainstream secular market. After negotiating with the record label, he received a waiver to perform with AD in the ": null
    },
    {
        "Christian rock": "christian rock"
    },
    {
        " market. Unfortunately, this would become a hindrance to commercial viability for the band. AD toured extensively between 42 and 42 sometimes playing bars and clubs one night and then churches the next. Livgren has stated on several occasions that he experienced some of the highest and lowest points in his career during his time with AD. Livgren mentions in his book Seeds of Change: The Spiritual Quest of Kerry Livgren that his time playing live with AD was his best as a guitarist.     AD released Art of the State in 42 Due to financial difficulties, AD faded away in 42 after releasing the album Reconstructions, though no official breakup was announced. In 42 Livgren released a collection of previously unreleased AD songs titled Prime Mover. Livgren played all instruments, and all vocals were performed by Ham.     In 42 Livgren rediscovered recordings of two AD performances from 42 and 42 that had been recorded by the soundboard engineer. Though they had not been made for release, Livgren remastered them and released them as a thank you to fans on a CD-R title called AD Live. The performances include mistakes and technical problems left intact and is meant as an archival release.       In 42 Livgren released his first all-instrumental album, One of Several Possible Musiks. He played all instruments on the album, which combines orchestral, jazz and rock styles. This effort won Livgren his first ": null
    },
    {
        "Dove Award": "dove award"
    },
    {
        " for Instrumental Album of the Year.     Livgren then released a double-CD retrospective celebrating 42 years since his first solo recording titled Decade. It included Livgrens first two albums,  Seeds of Change  and  Time Line , in their entirety plus tracks from other albums and previously unreleased songs. Enthusiasts of Livgrens music continue to hold this album in high regard, making it very hard to find.     In 42 after moving back to Topeka, Kansas, Livgren created GrandyZine production company and Numavox Records. He converted a restored barn on his farm into a state-of-the-art recording and production facility.     In 42 Livgren released his next solo album, When Things Get Electric, on his new label. In 42 he released his first soundtrack for ": null
    },
    {
        "Sony": "sony"
    },
    {
        "s fourth ": null
    },
    {
        "Minds Eye": "minds eye"
    },
    {
        " computer animation feature titled Odyssey into the Minds Eye. In 42 Livgren mostly re-recorded the album Prime Mover and added five new songs and a new version of Fair Exchange from the ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        " album  Vinyl Confessions  to the reissue, Prime Mover II.       In 42 Livgren released Collectors Sedition, featuring several vocalists including his nephew, Jake Livgren. At this time, Kerry Livgren was writing new songs prolifically and realized that some of them sounded like Kansas. Kerry called up Phil Ehart and offered him the opportunity to hear the songs. This led to a reunion album with Kansas titled  Somewhere to Elsewhere , which featured the then-touring version of Kansas along with Livgren and Dave Hope, the original bassist. The album was recorded at Livgrens Grandyzine Studio in his converted barn where he performed on the album as lead guitarist and keyboardist and produced the album. This was the first time Livgren had written all the songs for a Kansas album.     Shortly after the release of  Somewhere to Elsewhere , Livgren began work on The Best of Kerry Livgren. Both retrospective and forward-looking, it contains tracks from all his solo releases and some AD tracks. The album also includes two new songs and new recordings of four older songs. Each of these new versions features the original vocalists, including Ham, Gleason and Dio.       In 42 ": null
    },
    {
        "Cuneiform Records": "cuneiform records"
    },
    {
        " issued a collection of material recorded by Kansas II, the early lineup that had included Livgren, Meredith, Wright, Montre, John Bolton, Rod Mikinski and Brad Schulz, calling the group ": null
    },
    {
        "Proto-Kaw": "proto-kaw"
    },
    {
        ". The band then reformed under that name and released  Before Became After  in 42 on ": null
    },
    {
        "Inside Out Records": "inside out records"
    },
    {
        ".     They released their second album,  The Wait of Glory , on January 42 42 also on Inside Out Records. Unlike  Before Became After , this work was composed of entirely new material written by Livgren as well as a live DVD of Proto-Kaws appearance at the 42 ": null
    },
    {
        "NEARfest": "nearfest"
    },
    {
        ".     On May 42 42 Proto-Kaw announced that band members were back in the studio working on a new album consisting of new material and reworking older songs from Livgrens solo works. The untitled albums release date was not announced.     In December 42 Livgren announced that Proto-Kaw was no longer together due to the band members other commitments. The CD they had been working on, when and if released, will be a solo release by Livgren with no definite release date.     In late 42 Livgren announced that the members of Proto-Kaw had decided to finish working on the bands partially finished CD. Although he was unable to play guitar or keyboard due to having suffered a stroke, Livgren worked diligently with other band members to finish recording the CD and did all the mixing and post-production work at his home studio. On August 42 42 the band had a CD release party in Kansas City for their fourth CD, entitled Forth.       Livgren has resumed work on one of his most ambitious works to date, titled Cantata: The Resurrection of Lazarus. It is an epic, orchestral and vocal composition based on the Biblical story told in ": null
    },
    {
        "John, Chapter 42": "lazarus of bethany"
    },
    {
        ", and is still in production. It has been in development for more than 42 years and features a large ensemble cast. Numerous vocal talents are being considered for the roles.     Livgren also currently teaches an adult Sunday School class at Topeka Bible Church   and has posted a theological study on his website.      Though Livgren is known for his music, he is quick to point out that it is only one of his many pursuits. On his website, he quotes his biography: Im a family man, I have a role in my church, Im running a record label, a studio, a production company, a farm, and I have more hobbies and interests than there are hours in the day.       As primary songwriter, lead guitarist and keyboard player for Kansas, having penned such hits as ": null
    },
    {
        "Carry On Wayward Son": "carry on wayward son"
    },
    {
        " and ": null
    },
    {
        "Dust in the Wind": "dust in the wind"
    },
    {
        " , Livgren propelled the band to worldwide success and critical acclaim, with numerous gold and multi-platinum albums and more than 42 million recordings sold to date. Kansas produced eight gold albums, one platinum album, two quadruple-platinum albums, one platinum live album, and a 42  million-selling gold single, ": null
    },
    {
        "Dust in the Wind": "dust in the wind"
    },
    {
        " , according to the Kansas State Historical Society.     ": null
    },
    {
        "Carry On Wayward Son": "carry on wayward son"
    },
    {
        " has been covered by bands including ": null
    },
    {
        "Dream Theater": "dream theater"
    },
    {
        ", ": null
    },
    {
        "Rachel Rachel": "rachel rachel"
    },
    {
        ", ": null
    },
    {
        "Critical Mass": "critical mass"
    },
    {
        ", ": null
    },
    {
        "Shryne": "shryne"
    },
    {
        ", ": null
    },
    {
        "Yngwie J. Malmsteen": "yngwie j. malmsteen"
    },
    {
        ", ": null
    },
    {
        "Stryper": "stryper"
    },
    {
        ", and country superstars ": null
    },
    {
        "The Oak Ridge Boys": "the oak ridge boys"
    },
    {
        " as well as continuing appearances on album soundtracks such as the movies  Heroes  and  Anchorman . It is also featured in the video games ": null
    },
    {
        "Guitar Hero II": "guitar hero ii"
    },
    {
        ", ": null
    },
    {
        "Rock Band 42": "rock band 2"
    },
    {
        " and ": null
    },
    {
        "Guitar Hero Smash Hits": "guitar hero smash hits"
    },
    {
        ". The song also was used prominently in the TV series  Supernatural .     ": null
    },
    {
        "Dust in the Wind": "dust in the wind"
    },
    {
        " has been covered by ": null
    },
    {
        "Sarah Brightman": "sarah brightman"
    },
    {
        ", ": null
    },
    {
        "Gabriel & Dresden": "gabriel  &  dresden"
    },
    {
        ", Christian artists ": null
    },
    {
        "Billy Smiley": "billy smiley"
    },
    {
        " and ": null
    },
    {
        "Acappella": "acappella"
    },
    {
        " and by ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " center fielder and aspiring jazz guitarist ": null
    },
    {
        "Bernie Williams": "bernie williams"
    },
    {
        " on his 42 debut album  The Journey Within . It has also been referenced in  Bill and Teds Excellent Adventure . The song was featured in a Subaru commercial in 42 and in the film  Old School . It was also prominently featured in several episodes of the television series  Highlander: The Series . It could also be heard at the end of a 42 Honda commercial as rendered by a marching band. In a small twist of irony, Dust in the Wind was also covered in 42 by ": null
    },
    {
        "John Elefante": "john elefante"
    },
    {
        ", Kansas lead singer following the departure of Steve Walsh, who sang lead on the original version in 42 The single was certified gold as a digital download by the ": null
    },
    {
        "RIAA": "riaa"
    },
    {
        " in 42 almost 42 years after it sold 42 million copies as a single.     Livgrens music is used by permission for the Theophilos Bible Software.  The intro music is an excerpt from And I Saw, As It Were … Konelrad from the album One of Several Possible Musiks. Other portions of the software use the following songs or excerpts from songs:   All Creation Sings from Art Of The State; Beyond The Pale from  Time Line ; Highway to the Heart and No Standing from Reconstructions; Ill Follow You from Prime Mover; Just One Way from  Seeds of Change ; Racing Away from When Things Get Electric; and Smoke Is Rising, Two Thousand Down and When Things Get Electric from When Things Get Electric.     Kerry Livgren is listed as a Famous Kansan by the Kansas State Historical Society.   The platinum record awarded to him for the ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        " album  Monolith  hangs in the ": null
    },
    {
        "Kansas Museum of History": "kansas museum of history"
    },
    {
        ". He was also honored by the ": null
    },
    {
        "Kansas State Legislature": "kansas state legislature"
    },
    {
        " with a commendation on April 42 42         Livgrens keyboard and guitar playing can be heard on the ": null
    },
    {
        "42nd Chapter of Acts": "2nd chapter of acts"
    },
    {
        " albums  Rejoice  ,  Singer Sower  and  Night Light  . He also plays on the ": null
    },
    {
        "Robin Crow": "robin crow"
    },
    {
        " album Electric Cinema and contributes a guitar solo to Long Story, a song on ": null
    },
    {
        "Neal Morse": "neal morse"
    },
    {
        "s album  Testimony  . In addition, Livgren recorded a guitar solo on the song Rockstar Now on the ": null
    },
    {
        "Crunchy": "galactic cowboysmonty colvin"
    },
    {
        " album Loserville .      On his website, Livgren reported in July 42 that he had recently contributed to the new album by former Kansas band mate ": null
    },
    {
        "John Elefante": "john elefante"
    },
    {
        ". According to Elefantes website, Revolution of Mind by John Elefante and ": null
    },
    {
        "Mastedon": "mastedon"
    },
    {
        " is to be released soon.         In 42 Livgren published his autobiography, Seeds of Change: The Spiritual Quest of Kerry Livgren, co-written with Kenneth Boa. A revised and expanded edition was released in 42 that updated the book to cover his time with AD.       On September 42 42 Livgren had a ": null
    },
    {
        "stroke": "stroke"
    },
    {
        " early in the day. His condition was reported as serious, but stable.  By September 42 family members called his condition positive and said his progress in recovering was encouraging.  Livgren underwent surgery and received two stents in his carotid arteries. The area of his brain in which the stroke-causing clot formed deals with language and other high-end skills. Livgrens family says his face did not have the sagging often found in stroke victims, he recognized family members, and would squeeze their hands in recognition. The family established the Kansas band website as the only authorized source for information on Livgrens recovery.  Livgren has now recovered partially and has resumed work on his various musical projects.     He made his first post-stroke appearance with Kansas on January 42 42 when he conducted the Kansas State University Symphony Orchestra for Dust in the Wind during a special concert celebrating the 42th anniversary of the state of Kansas. Livgren was greeted with a prolonged standing ovation.         42  Kansas   Song for America   Masque   Leftoverture   Point of Know Return   Two for the Show  live   42  Monolith   Audio-Visions   Vinyl Confessions   Drastic Measures   Live at the Whisky  live   42  Somewhere to Elsewhere   Theres Know Place Like Home  live   Compilations  The Best of Kansas   Carry On   The Kansas Boxed Set   The Best of Kansas    42  The Ultimate Kansas   Sail On: The 42th Anniversary Collection    42  On the Other Side  re-release of Carry On  Seeds of Change   Time Line    42  Art of the State    42  Reconstructions    42  Prime Mover    42  One of Several Possible Musiks  When Things Get Electric   42 Odyssey into the Minds Eye soundtrack   42 Collectors Sedition    ": null
    }
]