[
    {
        "              Kes is a fictional character on the American ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " television show  Star Trek: Voyager . She is portrayed by actress ": null
    },
    {
        "Jennifer Lien": "jennifer lien"
    },
    {
        ". Set in the 24th century of the  Star Trek  universe, the series follows the crew of the starship ": null
    },
    {
        "USS Voyager": "uss voyager"
    },
    {
        ", stranded far from home and struggling to get back to Earth. Kes is a member of the Ocampa  who joins the crew in the series premiere episode along with her Talaxian boyfriend, ": null
    },
    {
        "Neelix": "neelix"
    },
    {
        ". She subsequently works as ": null
    },
    {
        "the Doctors": "the doctor"
    },
    {
        "medical assistant and develops her mental abilities with ": null
    },
    {
        "Tuvoks": "tuvok"
    },
    {
        "assistance.     Kes storylines focus on her relationships with Neelix, the Doctor, Tuvok, ": null
    },
    {
        "Tom Paris": "tom paris"
    },
    {
        ", and ": null
    },
    {
        "Captain Janeway": "kathryn janeway"
    },
    {
        ". Her psionic powers are also central and secondary themes of some episodes. Lien was removed from the series in the ": null
    },
    {
        "fourth season": "star trek: voyager"
    },
    {
        ", but reprised her role in a ": null
    },
    {
        "season six": "star trek: voyager"
    },
    {
        " episode, ": null
    },
    {
        "Fury": "fury"
    },
    {
        " . Kes has been featured in ": null
    },
    {
        "non-canon": "star trek canon"
    },
    {
        " novels and short stories": "list of star trek novels"
    },
    {
        " adapted from the show.     Critical response to Kes was mostly negative, though some critics praised Liens performance. Although Kes relationship with Neelix was panned, critics had a more mixed-to-positive reaction to her friendships with Tuvok and Tom Paris. Kes relationships with members of Voyagers crew and her psionic powers attracted attention from academics.           Early development of  Star Trek: Voyager , including the Ocampa, began in July 1993. Producers initially imagined the Ocampa as an ": null
    },
    {
        "androgynous": "androgyny"
    },
    {
        " alien species. In later meetings, they agreed on the idea of the Ocampa having a short lifespan, similar to a ": null
    },
    {
        "mayfly": "mayfly"
    },
    {
        ". Kes was intended to live for only seven years, and changes in her appearance were planned for each season, emphasizing her age progression. ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": pp. 175-177 The androgyny concept was dropped, as the first cast description identified Kes, who was initially named Dah, as a female. ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 208 Producers proposed a second Ocampa, shown near the end of his lifespan, as part of the main cast, though this idea was abandoned in favor of ": null
    },
    {
        "Neelix": "neelix"
    },
    {
        ", who was a late addition to the series. Kes was initially created as a ": null
    },
    {
        "scout": "reconnaissance"
    },
    {
        " for  Voyager  journey through the ": null
    },
    {
        "Delta Quadrant": "delta quadrant"
    },
    {
        ", before Neelix assumed the role instead. Kes was then reimagined as a ": null
    },
    {
        "medical intern": "medical intern"
    },
    {
        ". In an August 1993 memo, series creator ": null
    },
    {
        "Jeri Taylor": "jeri taylor"
    },
    {
        " suggested Kes have a ": null
    },
    {
        "superhuman ability": "superhuman abilities"
    },
    {
        " and be caught in a war between two factions. ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 189 ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 191 Producers debated the nature of the characters ": null
    },
    {
        "psionic powers": "psionics"
    },
    {
        ", leading them to ask production associate Zayra Cabot and the Joan Pearce Research Associates to gather information on ": null
    },
    {
        "parapsychology": "parapsychology"
    },
    {
        ". ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 199 They later agreed to portray Kes with some measure of telepathic ability for the pilot episode , and planned to address it further in future episodes. ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 206        When casting Kes, Caretaker director ": null
    },
    {
        "Winrich Kolbe": "winrich kolbe"
    },
    {
        " looked for an actress who was fragile, but with a steely will underneath . The casting call was for only women in their early-twenties or younger. ": null
    },
    {
        "Gross & Altman ": "kes grossaltman1995"
    },
    {
        ": p. 351 Producers hired ": null
    },
    {
        "Jennifer Lien": "jennifer lien"
    },
    {
        " based on their belief that she could embody the characters somewhat childlike and fragile qualities. ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 273 Lien was one of the first cast members hired for the series; at the age of nineteen, she was the youngest actor on the show at the time of its debut. ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 99 Lien only had a basic understanding of the  Star Trek  franchise prior to receiving the part.  She said this allowed her to approach her performance without anxiety. She had auditioned for the show due to the opportunity to play a new alien species, and explained it meant that anything could happen, offering me the chance to learn and grow as an actress . ": null
    },
    {
        "Jennifer Gatti": "jennifer gatti"
    },
    {
        " was considered as a runner-up for Kes, ": null
    },
    {
        "Gross & Altman ": "kes grossaltman1996"
    },
    {
        ": p. 156 and she would later ": null
    },
    {
        "guest star": "guest star"
    },
    {
        " in the episode ": null
    },
    {
        "Non Sequitur": "non sequitur"
    },
    {
        " . ": null
    },
    {
        "Ruditis ": "kes ruditis2003"
    },
    {
        ": p. 66     Series creator ": null
    },
    {
        "Michael Piller": "michael piller"
    },
    {
        " was concerned the pilot was too passionless due to its focus on an ": null
    },
    {
        "action-adventure": "action adventure film"
    },
    {
        " storyline over individual character development; ": null
    },
    {
        "Gross & Altman ": "kes grossaltman1996"
    },
    {
        ": p. 134 ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 235 he explained: The biggest danger in the pilot was in creating a story that nobody cared about. Part of Kes role in the episode, for Piller, was to encourage the audience to care about Neelix. The costumes in Caretaker were created by ": null
    },
    {
        "Robert Blackman": "robert blackman"
    },
    {
        ". ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 232 He said designing Kes clothing was a challenge since producers were still unclear about the character and Lien was very ": null
    },
    {
        "introverted": "introverted"
    },
    {
        ". Although he had difficulty with Lien, Blackman said the cast and crew enjoyed working with her. Kes original costume was ": null
    },
    {
        "pastel colored": "pastel"
    },
    {
        " and based on a ": null
    },
    {
        "sprite": "sprite"
    },
    {
        ", but the producers rejected it after a wardrobe fitting. ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": pp. 295-296     The Ocampa prosthetics for Caretaker were designed by ": null
    },
    {
        "Michael Westmore": "michael westmore"
    },
    {
        ". While the early scenes of Caretaker were filmed, Lien tested various combinations of wigs and prosthetics; cinematographer ": null
    },
    {
        "Marvin V. Rush": "marvin v. rush"
    },
    {
        " filmed each version for series creator ": null
    },
    {
        "Rick Berman": "rick berman"
    },
    {
        " to receive his final approval. ": null
    },
    {
        "Poe ": "kes poe1998"
    },
    {
        ": p. 303 During the shows first two seasons, it took Lien three hours a day to get into her characters hair, make-up, and wardrobe. As the series progressed, Lien developed an allergic response to the ear prosthetics; starting with the episode ": null
    },
    {
        "Before and After": "before and after"
    },
    {
        " , Lien no longer wore the ear prosthetics and Kes was portrayed with longer hair to cover her ears and hide this.        The Caretaker script stated Kes was a dazzling, ethereal beauty, waifish and fragile , with a dignity – her bearing, an alertness in her look, that suggests a being of powerful intelligence . ": null
    },
    {
        "Ruditis ": "kes ruditis2003"
    },
    {
        ": p. 146 On the Star Trek official website, the character is identified as a tough survivor and a bit of a rebel .  In a 1996 interview, Lien characterized Kes as strong and curious and intelligent despite still being a child in a way with the same fears and inhibitions and worries that we all have .  She saw the characters lack of cynicism or precociousness or pretentiousness or sarcasm as different from typical young female roles.  Although she found this kind of diversity in a character difficult to play, Lien enjoyed the process and said: Its a joy to pretend to be this extraordinary creature, so open and everything so new.     Lien was not given information about her characters future storylines prior to receiving the final copies of the scripts. Unlike the shows other actors, she did not campaign for changes to her character, explaining I felt my contribution was more in the acting, and not in the writing .  She viewed Kes developing mental abilities as representing her confidence in being able to choose a path for her life , and identified temptation as a key part in her ": null
    },
    {
        "character arc": "character arc"
    },
    {
        ".  Author ": null
    },
    {
        "Paul Ruditis": "paul ruditis"
    },
    {
        " summed up Kes through the paradoxical phrase fragile power .          Kolbe said Kes and ": null
    },
    {
        "Neelix": "neelix"
    },
    {
        " brought romance and comedy to the series. Lien and Neelixs actor ": null
    },
    {
        "Ethan Phillips": "ethan phillips"
    },
    {
        " said they enjoyed filming their scenes together.  Writer ": null
    },
    {
        "Kenneth Biller": "kenneth biller"
    },
    {
        " wanted to establish the pair as living together and sexually active, but Taylor and Berman thought Kes looked too young for those storylines. Biller proposed scenes in which the characters talk about sex for the first time as a way to explore the weirdness of alien sexuality . This discussion led to dialogue being included in the episode ": null
    },
    {
        "Elogium": "elogium"
    },
    {
        " .  Despite this, the sexual relationship between Kes and Neelix is never clearly defined. ": null
    },
    {
        "Greven ": "kes greven2003"
    },
    {
        ": p. 311     After Kes breaks up with Neelix in ": null
    },
    {
        "Warlord": "warlord"
    },
    {
        " , Phillips asked writers to provide closure for the couple in a subsequent episode. He believed the end of their relationship was too muddy , since Kes was possessed by an alien, and thus unable to control her actions, during the break-up scene.  The writers denied his request, saying: No, lets just drop it, lets move on. ": null
    },
    {
        "Ruditis ": "kes ruditis2003"
    },
    {
        ": pp. 158-159 Producers had planned a scene for the episode ": null
    },
    {
        "Fair Trade": "fair trade"
    },
    {
        " in which Kes and Neelix discuss the end of their romantic relationship, but it was removed due to time constraints. Berman discussed the couple during a 1997 interview, saying: There was a relationship with Neelix that didnt work out that well.      Kes has a more parent-child relationship with ": null
    },
    {
        "Kathryn Janeway": "kathryn janeway"
    },
    {
        " and ": null
    },
    {
        "the Doctor": "the doctor"
    },
    {
        ", portrayed by ": null
    },
    {
        "Kate Mulgrew": "kate mulgrew"
    },
    {
        " and ": null
    },
    {
        "Robert Picardo": "robert picardo"
    },
    {
        ", respectively. Ruditis identified Kes trust in Janeway as representing her desire to explore the universe. Picardo viewed Kes as the Doctors sounding board and emotional confessor as she mentored him on being human. Following the removal of Kes in the ": null
    },
    {
        "fourth season": "star trek: voyager"
    },
    {
        ", Picardo was concerned the Doctor would be relegated to the role as the ": null
    },
    {
        "comic relief": "comic relief"
    },
    {
        ". He suggested producers invert the Doctors relationship with Kes to show him teaching former ": null
    },
    {
        "Borg": "borg"
    },
    {
        " drone ": null
    },
    {
        "Seven of Nine": "seven of nine"
    },
    {
        " about humanity.  A darker relationship between the Doctor and Kes was planned for the episode ": null
    },
    {
        "Darkling": "darkling"
    },
    {
        " . According to writer ": null
    },
    {
        "Joe Menosky": "joe menosky"
    },
    {
        ", the Doctors evil alter ego was going to be perversely sexual and sadistic and have a psychosexual attraction to Kes. Menosky drafted a scene in which the Doctor interacts with holograms of Kes on the ": null
    },
    {
        "holodeck": "holodeck"
    },
    {
        ", including performing surgery on one, but this was cut from the final episode.  Unlike Neelix, Janeway, and the Doctor, Kes has few scenes with ": null
    },
    {
        "BElanna Torres": "belanna torres"
    },
    {
        ". ": null
    },
    {
        "Roxann Dawson": "roxann dawson"
    },
    {
        ", who plays Torres, requested for further interaction between the two.         Lien was removed from Star Trek: Voyager during its fourth season to accommodate the introduction of ": null
    },
    {
        "Jeri Ryan": "jeri ryan"
    },
    {
        ", who plays Seven of Nine. ": null
    },
    {
        "Ruditis ": "kes ruditis2003"
    },
    {
        ": p. 191 ": null
    },
    {
        "Chakotays": "chakotay"
    },
    {
        "actor ": null
    },
    {
        "Robert Beltran": "robert beltran"
    },
    {
        " said changing a lead character mid-season was unusual for the Star Trek franchise,  though Taylor believed it was typical for a show in its later seasons.  There was speculation in the media that ": null
    },
    {
        "Harry Kims": "harry kim"
    },
    {
        "actor ": null
    },
    {
        "Garrett Wang": "garrett wang"
    },
    {
        " was going to be replaced instead, but that he was kept due to his appeal to a certain demographic and placement on ": null
    },
    {
        "Peoples": "people"
    },
    {
        " 50 Most Beautiful People in the World list. Wang said: The timing of that, right during our hiatus, certainly couldnt have hurt me in terms of them keeping me on the show.      Berman and Taylor chose to remove Kes since they felt the character was not properly developed over the course of the show. Executive producer ": null
    },
    {
        "Brannon Braga": "brannon braga"
    },
    {
        " regarded this decision as a failure of imagination on the writers part .  Braga requested freelance writer ": null
    },
    {
        "Bryan Fuller": "bryan fuller"
    },
    {
        " develop the concept for Kes departure.   Receiving a positive response during a pitch meeting, Fuller helped to rewrite the characters final episode ": null
    },
    {
        "The Gift": "the gift"
    },
    {
        " .  He said he had really bonded with Kes during the episodes production.     Some of the series writing staff were sorry that Kes was removed; Kenneth Biller stated:     I was a little bit regretful when Kes left the show, because I thought she was an interesting character to write for—from a science fiction standpoint—because she had certain... she had telepathic abilities, she had this very compressed lifespan, she had things about her character that often lent themselves to interesting storytelling We lost something in losing the Kes character.      Mulgrew was also disappointed by Liens departure, describing it as a great sorrow to me on many levels , describing the departure as the fracturing of an ensemble cast that was extremely special to me .  ": null
    },
    {
        "Tim Russ": "tim russ"
    },
    {
        ", who portrays Tuvok, referred to the characters exit as gracious and poignant .      After leaving Voyager, Lien stopped acting to pursue an ": null
    },
    {
        "associate degree": "associate degree"
    },
    {
        " in health.  Despite this, producers invited her back for an episode because they wanted to use Kes to advance the story.  The concept for this episode, ": null
    },
    {
        "Fury": "fury"
    },
    {
        " , was developed by Braga and written by Fuller and ": null
    },
    {
        "Michael Taylor": "michael taylor"
    },
    {
        ".  Cinefantastique  s Anna L. Kaplan considered Fullers involvement ironic due to his participation in The Gift . Lien was uncomfortable with the original script, and requested that it be rewritten. She said it was difficult to play a different version of Kes and interact with the other characters who had changed since her last appearance. Lien did not have the same allergic response to the ear prosthetics since she did not have to wear them for the same length of time. During a 2010 interview with ": null
    },
    {
        "StarTrek.com": "startrek.com"
    },
    {
        ", Lien said she preferred her performance in The Gift to that for Fury , saying she made a lot of poor acting choices in the latter.         Star Trek: Voyager": null
    },
    {
        "telepathic": "telepathy"
    },
    {
        " and has a life expectancy of nine years. Prior the shows pilot episode, Kes lived with her people in an underground city constructed by a ": null
    },
    {
        "Nacene": "nacene"
    },
    {
        " alien known as the Caretaker. He had cared for the Ocampa since inadvertently destroying their planets ecosystem and atmosphere thousands of years ago; the Ocampa became completely insular and dependent upon him. The Caretaker had sealed the city away from the planets surface to protect the Ocampa; however, Kes dreamed of leaving the Ocampa enclave to explore the galaxy and develop her psionic powers, with which her ancestors were rumored to have far more proficiency. Finding a way to Ocampas surface, she was captured and tortured by the ": null
    },
    {
        "Kazon": "kazon"
    },
    {
        " who hope to gain access to the Ocampa city and its resources; Neelix, a Talaxian, rescued her, and they became a couple.      When the Caretaker realizes he is dying, he abducts beings from the ": null
    },
    {
        "Alpha Quadrant": "alpha quadrant"
    },
    {
        " in the hopes of finding a compatible mate with whom to produce offspring to ensure someone can continue protecting and caring for the Ocampa. In the shows pilot episode, the Caretaker kidnaps members of a ": null
    },
    {
        "Maquis": "maquis"
    },
    {
        " crew and the ": null
    },
    {
        "Starfleet": "starfleet"
    },
    {
        " crew of the starship USS Voyager. Kes helps the ships captains, Kathryn Janeway and Chakotay, recover their missing crew members. Janeway encourages the Caretaker to allow the Ocampa to care for themselves; although he refers to the Ocampa as children and believes they are unable to survive by themselves, she says that they must be allowed to grow up and learn to care for themselves. When the Kazon attack and attempt to steal the Caretakers technology, Janeway orders the destruction of his vessel. Stranded in the Delta Quadrant, the Maquis and Starfleet crew merge on their journey back to the Alpha Quadrant. Kes and Neelix decide to serve as guides to the stranded crews. The remaining Ocampa stay on the planet.      Aboard Voyager, Kes starts a ": null
    },
    {
        "hydroponics": "hydroponics"
    },
    {
        " garden to provide vegetables and fruit for the crews meals.  She also develops a friendship with ": null
    },
    {
        "the Doctor": "the doctor"
    },
    {
        " while studying to become his medical assistant.  She encourages him to develop a better set of social skills and pushes the crew to recognize him as more than just a ": null
    },
    {
        "hologram": "hologram"
    },
    {
        ".  In ": null
    },
    {
        "Phage": "phage"
    },
    {
        " , the ": null
    },
    {
        "Vidiians": "vidiians"
    },
    {
        " harvest Neelixs lungs, and Kes donates one of her own to save his life.  During Elogium , emanations from space-dwelling lifeforms cause Kes to prematurely enter the elogium, the Ocampa female reproductive state. This condition can only occur once during an Ocampa life cycle. Kes and Neelix disagree over the idea of having children. Neelix eventually agrees to being a father, but Kes decides against conceiving a child. After the ship moves away from the life forms, the Doctor determines that Kes has gone through a false alarm; she will be able to go through a true elogium in the future.  Throughout the first two seasons, Neelix becomes jealous of Tom Paris interest in Kes. Neelix and Paris resolve this tension in ": null
    },
    {
        "Parturition": "parturition"
    },
    {
        " while nursing a ": null
    },
    {
        "reptilian humanoid": "reptilian humanoid"
    },
    {
        " baby together during an away mission. ": null
    },
    {
        "Greven ": "kes greven2003"
    },
    {
        ": p. 308     During the first two seasons, Kes slowly develops her psionic powers. She has visions of a planets destruction in ": null
    },
    {
        "Time and Again": "time and again"
    },
    {
        "  and is able to resist a ": null
    },
    {
        "psychoactive trance": "psychoactive drug"
    },
    {
        " to save the crew in ": null
    },
    {
        "Persistence of Vision": "persistence of vision"
    },
    {
        " .  Voyager discovers a second Ocampa colony in ": null
    },
    {
        "Cold Fire": "cold fire"
    },
    {
        " , and its leader Tanis teaches Kes to see and control particles on the ": null
    },
    {
        "subatomic": "subatomic particle"
    },
    {
        " level. Kes was previously trained by ": null
    },
    {
        "Tuvok": "tuvok"
    },
    {
        ", who took a more cautious approach. Under Tanis tutelage, Kes develops ": null
    },
    {
        "pyrokinesis": "pyrokinesis"
    },
    {
        ", but she is unable to control the power and almost kills Tuvok by boiling his blood. After discovering that Tanis is collaborating with the Caretakers first mate, Suspiria, to destroy Voyager, Kes subdues him with her powers. Tuvok reminds Kes that she must learn to control, rather than fear, her darker impulses.  Tiernan, a former dictator of the planet Illari, takes control of Kes body in Warlord . He uses her mental powers to stage a coup against his planets leader. While under Tierans influence, Kes breaks up with Neelix. The crew eventually free Kes from Tierans control and kill him, though she is traumatized by the experience.      In Darkling , Kes becomes attracted to Zahir, who is a part of a humanoid species called the Mikhal Travelers. She is interested in the Mikhal Travelers for their desire to explore space. The Doctor injures Zahir and kidnaps Kes after developing an evil ": null
    },
    {
        "alter ego": "alter ego"
    },
    {
        " while grafting new personalities into his program. Kes considers leaving Voyager to be with Zahir, but later decides against this.  While exploring a Nechani ": null
    },
    {
        "holy site": "holy site"
    },
    {
        " in ": null
    },
    {
        "Sacred Ground": "sacred ground"
    },
    {
        " , Kes is shocked into a coma by its ": null
    },
    {
        "force field": "force field"
    },
    {
        ". The Nechani believe Kes is being punished for her ": null
    },
    {
        "sacrilegious behavior": "sacrilege"
    },
    {
        ". After participating in a religious ritual, Janeway realizes she must rely on her own faith rather than technology to cure Kes. Going against her crews advice, Janeway carries Kes into the shrine. The force field does not harm them, and Kes recovers.      In Before and After , an episode in the ": null
    },
    {
        "third season": "star trek: voyager"
    },
    {
        ", Kes lives short periods of her life in reverse order, starting with her death and ending with her birth. In this ": null
    },
    {
        "alternative timeline": "alternative timeline"
    },
    {
        ", she is romantically involved with Paris, and they have a daughter, Linnis, who marries and has a son with Harry Kim. During this timeline, Kes participates in Voyagers year-long battle with the Krenim, which takes place in the season four episode ": null
    },
    {
        "Year of Hell": "year of hell"
    },
    {
        " . She is infected with particles from a ": null
    },
    {
        "chroniton": "list of fictional elements, materials, isotopes and atomic particles"
    },
    {
        " torpedo during the Krenim attack; Paris speculates that this exposure to chroniton radiation is the reason why Kes is irregularly jumping back in time. When the Doctor brings Kes back to the present, she documents information about the Krenim and their future attack. At the end of the episode, Tuvok says Kes has seen only one possible future for Voyager.  During ": null
    },
    {
        "Scorpion": "scorpion"
    },
    {
        " , Voyager becomes entangled in a major conflict between the Borg and ": null
    },
    {
        "Species 8472": "species 8472"
    },
    {
        ". Partially due to her exposure to the powerful telepathic influx of Species 8472, Kes begins to evolve into a different state of being.   In The Gift , she realizes she can no longer remain aboard Voyager, as her powers threaten to destroy the ship. She uses her newly acquired powers to hurl Voyager and its crew safely beyond Borg space, 9,500 light-years closer to ": null
    },
    {
        "Earth": "earth in science fictionstar trek"
    },
    {
        ", before turning into living energy.      Kes revisits Voyager in Fury , in which she is near the end of her life cycle and experiencing memory loss. She mistakenly believes that Janeway kidnapped her from Ocampa, and she travels back in time to negotiate with the Vidiians, promising to help them access the ship to harvest the crew members organs if they take her younger self home. After this plan is stopped, the younger Kes creates a hologram to remind her future self about her affection for the crew and how much they had cared for her. After seeing the hologram, the older version of Kes says goodbye to the crew before taking her ship back to Ocampa.        Kes appears in ": null
    },
    {
        "non-canon": "star trek canon"
    },
    {
        " novels and short stories adapted from Star Trek: Voyager. In ": null
    },
    {
        "Christie Goldens": "christie golden"
    },
    {
        "1997 book Marooned, an alien kidnaps Kes,  and during ": null
    },
    {
        "Greg Coxs": "greg cox"
    },
    {
        "1997 novel The Black Shore, she feels a psychic call when the crew takes ": null
    },
    {
        "shore leave": "shore leave"
    },
    {
        " on a planet.  Kes is featured in the ": null
    },
    {
        "novels": "list of star trek novels"
    },
    {
        " Mosaic": "mosaic"
    },
    {
        " and Pathways in which she accompanies an away team on an unknown planet and helps the crew escape a prison camp, respectively.    Jennifer Lien contributes recipes for ": null
    },
    {
        "potato salad": "potato salad"
    },
    {
        " and a good-karma ": null
    },
    {
        "lentil soup": "lentil soup"
    },
    {
        " for the 1999 ": null
    },
    {
        "cookbook": "cookbook"
    },
    {
        " based on the series. Written by Ethan Phillips and ": null
    },
    {
        "William J. Birnes": "william j. birnes"
    },
    {
        ", the book mentions that ": null
    },
    {
        "tubers": "tuber"
    },
    {
        " are Kes favorite food.      In Christie Goldens novel trilogy Dark Matters, Kes is known as the Entity , and gathers mutated ": null
    },
    {
        "dark matter": "dark matter"
    },
    {
        ". She has forgotten about her past aboard Voyager after turning into living energy, but slowly regains some memories over the course of the books. She does not contact the crew and is told she is a ": null
    },
    {
        "parallel-universe": "parallel universes in fiction"
    },
    {
        " version of herself, separate from the one featured in Fury . Tuvok, however, does briefly sense her presence before her departure.    In ": null
    },
    {
        "Kirsten Beyers": "kirsten beyer"
    },
    {
        "2012 novel The Eternal Tide, Kes and ": null
    },
    {
        "Q Junior": "q"
    },
    {
        " resurrect Janeway after she is assimilated by the Borg and subsequently killed. Q Junior teaches Kes how to pull Janeways body back together and restore her to her most perfect state.      Kes also features in Heather Jarmans 2006 book Evolution, the third installment of the trilogy String Theory, in which she helps the Doctor and ": null
    },
    {
        "Q": "q"
    },
    {
        " with the birth of an Ocampa-Nacene hybrid. When the Ocampan mother is unable to carry the baby to term, Kes merges with her to act as a surrogate. After giving birth to a boy, Kes takes him to Ocampa; a rainstorm on the planet hints at the recovery of its ecosystem. The novel ": null
    },
    {
        "retcons": "retcons"
    },
    {
        " Kes appearance in Fury as the manifestation of her dark side, formed as a side effect of a confrontation with a renegade Nacene.  In Penny A. Proctors short story Restoration , included in the 2001 anthology Strange New Worlds V, Kes sacrifices herself to revive Ocampas ecosystem.  The ": null
    },
    {
        "mirror universe": "mirror universe"
    },
    {
        " version of Kes features in the Star Trek: Mirror Universe novel series.               Lien received some positive feedback for her performance. In a 1995 review of Caretaker , ": null
    },
    {
        "Varietys": "variety"
    },
    {
        "Kinsey Lowe praised Liens performance as a beguiling blend of naive wonder and fierce dedication .   Screen Rant s Alexandra August applauded Lien for trying her best with what she was given , but felt she could not make Kes very dynamic as a character. Kes removal in season four was praised by critics who believed the character was poorly developed. Rob Owen, writing for Albanys ": null
    },
    {
        "Times Union": "albany times union"
    },
    {
        ", criticized Kes as reduced to a subservient Nurse Chapel role . However, ": null
    },
    {
        "The Virginian-Pilot": "the virginian-pilot"
    },
    {
        " s Larry Bonko was disappointed by Kes exit, as he felt the character gave the series heart .     ": null
    },
    {
        "Screen Rant": "screen rant"
    },
    {
        " contributors felt Kes had potential if her storylines focused more on her short lifespan and mental powers. Snellgrove cited Kes as an example of how certain Star Trek: Voyager character were underused. August felt she was not given enough screen time or character development to become interesting. Thompson described the Ocampa as one of the more fascinating species introduced on Star Trek: Voyager, and wrote that Kes departure was one of the five things that hurt the show.     Kes romance with Neelix was the subject of criticism. Although the relationship was introduced in the pilot, Ruditis felt it was somewhat undefined as the series progressed . TrekMovie.com s Matt Wright panned the couple as borderline gross , and Thompson cited them as having the worst chemistry on the series. Thompson and Gizmodo s Tom Pritchard wrote that Kes would have benefited if Neelix was not included on the show. August criticized the frequency in which Kes storylines revolved around her love life. Kes relationship with other characters received a better response. Thompson praised Paris attraction for Kes as a good setup relationship to guide him into being a better and more responsible man for BElanna . August believed Tuvok and Kes could been an ideal couple if he was not already married.     Critics had a mostly negative response to Kes storyline for Elogium . Commentators questioned the plausibility of an Ocampa woman only giving birth once as it would cause an inevitable decrease in the species population. Jones & Parkin : p. 284 Writer David A. McIntee criticized the elogium as a poorly-done metaphor for puberty , PMS , teenage pregnancy , abortion , and menopause . McIntee : pp. 56-60 On the other hand, Bustle s Marie Southard Ospina praised the episodes depiction of a woman choosing to not have a baby without receiving judgement. Kes return for Fury also received negative feedback from reviewers who found her characterization to be disappointing. Den of Geek! s John Andrews likened the episode to a sad yet compelling character study , although he believed Kes shift in morality was not believable. August dislike the episodes version of Kes, describing it as a ham-fisted way of undermining her entire journey after leaving Voyager .       Kes relationship with Voyager s crew was the focus of academic discussion. Cultural studies scholar Debra Bonita Shaw wrote Janeway only accepts Kes, Neelix, and Seven of Nine as her subordinates; to gain Janeways acceptance, these characters must adhere to an established structure of command and help Voyager return home. Shaw : p. 79 Media studies scholar Aviva Dove-Viebahn was critical of the portrayal of Kes and Neelix as similar to native informants , a character type that she described as token and subjugated . However, Dove-Viebahn clarified that Kes had agency through her mental abilities, which are portrayed as stronger than the crews scientific and medical technology. Dove-Viebahn : p. 606 English literature professor David Greven criticized Kes relationship with Tuvok, writing their differences in race and age was too uncomfortably similar to Uncle Tom s friendship with Little Eva in the 1852 novel ": null
    },
    {
        "Uncle Toms Cabin": "uncle toms cabin"
    },
    {
        ". Greven : p. 106     Scholars discussed her psionic powers in Cold Fire . According to media studies scholar Marion Gymnich, the Star Trek franchise depicts telepathy with infiltrations and mental intrusions . She cited Kes loss of control in Cold Fire as an example of how Star Trek negatively portrays telepathic communication. Gymnich : p. 70 Analyzing the scene in which Kes boils Tuvoks blood, Greven wrote that he becomes a monster similar to those in ": null
    },
    {
        "Frankenstein": "frankenstein"
    },
    {
        ", ": null
    },
    {
        "The Phantom of the Opera": "the phantom of the opera"
    },
    {
        ", and The Monster . Describing the sequence as one of the more disturbing in ": null
    }
]