[
    {
        "      Kettlebaston is a village and a ": null
    },
    {
        "civil parish": "Civil Parishes In England"
    },
    {
        " with just over 30 inhabitants in the ": null
    },
    {
        "Babergh": "Babergh"
    },
    {
        " district of ": null
    },
    {
        "Suffolk": "Suffolk"
    },
    {
        ", England located around  east of ": null
    },
    {
        "Lavenham": "Lavenham"
    },
    {
        ". From the 2011 Census the population of the village was not maintained and is included in the civil parish of ": null
    },
    {
        "Chelsworth": "Chelsworth"
    },
    {
        ". It derives its name from Kitelbeornastuna, , later evolving to Kettlebarston, , and finally to the current spelling. Its existence was first recorded in 1086 in the  Domesday Book .       Once in an area of great wealth, the demise of the ": null
    },
    {
        "mediaeval": "Mediaeval"
    },
    {
        " wool trade": "Wool Trade"
    },
    {
        " was indirectly the saving of the village, , since the locals were unable to afford the expense of upgrading their houses with the latest architectural fashions. The number of ": null
    },
    {
        "timber-framed houses": "Timber Framing"
    },
    {
        "slowly declined over the years, as did the population - from over 200 at its peak, to the point when the village was on the brink of extinction. By the 1960s, with the road no more than an unmade track, and no electricity or mains water supplies, , Kettlebaston was barely standing. In the Spotlight On The Suffolk Scene article, of the Chronicle & Mercury in June 1949, it was noted that a great many houses were category five - derelict, and ready for demolition.     As the agricultural workers left the land in search of other jobs, due to the increased mechanisation of farm work, outsiders discovered the secluded beauty of the rural Suffolk countryside, and a new age dawned. The tiny workmens cottages, which once housed huge families - and some stock and chickens according to local accounts - were lovingly renovated and converted, and the village was reborn, and went on to proudly win Babergh Best Kept Village, and runner up in the Suffolk Community Council Best Kept Village Competition, in 1989.     The village sign, bearing two crossed sceptres topped with doves, was erected to mark the ": null
    },
    {
        "coronation of King George VI and Queen Elizabeth": "Coronation Of King George Vi And Queen Elizabeth"
    },
    {
        ". It also commemorates that, in 1445, ": null
    },
    {
        "Henry VI": "Henry Vi, King Of England"
    },
    {
        " granted the manor of Kettlebaston to ": null
    },
    {
        "William de la Pole, 1st Marquess of Suffolk": "William De La Pole, 1St Duke Of Suffolk"
    },
    {
        ", in return for the service of carrying a golden ": null
    },
    {
        "sceptre": "Sceptre"
    },
    {
        " at the coronation of all the future Kings of England, and an ivory sceptre to carry at the coronation of ": null
    },
    {
        "Margaret of Anjou": "Margaret Of Anjou"
    },
    {
        ", and all future Queens. This honour continued until ": null
    },
    {
        "Henry VIII": "Henry Viii Of England"
    },
    {
        " resumed the manor, although it was later regranted it was without the royal service.     The parish church of St. Mary the Virgin has ": null
    },
    {
        "Norman": "Norman Architecture"
    },
    {
        " origins, and features a ": null
    },
    {
        "font": "Baptismal Font"
    },
    {
        " from around 1200. It is recorded that the church was then built anew in 1342, remaining largely unchanged until targeted by ": null
    },
    {
        "Protestant": "Protestant"
    },
    {
        " vandals in the 1540s. Today it features one of Suffolks finest modern ": null
    },
    {
        "rood screen": "Rood Screen"
    },
    {
        "s, designed by Father Ernest Geldart and decorated by Patrick Osborne, and Enid Chadwick, and a rare ": null
    },
    {
        "Sacred Heart": "Sacred Heart"
    },
    {
        " altar upon a ": null
    },
    {
        "Stuart": "Stuart Period"
    },
    {
        " Holy Table. It now lacks the small lead spire which once topped the tower.     Regarded as a place of ": null
    },
    {
        "pilgrimage": "Pilgrimage"
    },
    {
        " to the followers of the ": null
    },
    {
        "Anglo-Catholic": "Anglo-Catholic"
    },
    {
        " movement from all over the UK, Kettlebaston was the liturgically highest of all Suffolks Anglican churches. From 1930, until his retirement in 1964, Reverend Father Harold Clear Butler said Roman Mass every day, and celebrated High Mass and Benediction on Sundays. He also removed state notices from the porch, and refused to keep registers, or to recognise the office of the local Archdeacon of Sudbury. Despite opposition, the church finally received electric heating and lighting in 2014.     The current village has no shop, school, or pub.                        ": null
    }
]