[
    {
        "   The Keystone Cops  were fictional, humorously incompetent ": null
    },
    {
        "policemen": "policemen"
    },
    {
        ", featured in ": null
    },
    {
        "silent film": "silent film"
    },
    {
        " slapstick comedies produced by ": null
    },
    {
        "Mack Sennett": "mack sennett"
    },
    {
        " for his ": null
    },
    {
        "Keystone Film Company": "keystone studios"
    },
    {
        " between 1912 and 1917.             The idea for the Keystone Cops came from ": null
    },
    {
        "Hank Mann": "hank mann"
    },
    {
        ", who also played police chief Tehiezel in the first film before being replaced by ": null
    },
    {
        "Ford Sterling": "ford sterling"
    },
    {
        ". Their first film was  Hoffmeyers Legacy  but their popularity stemmed from the 1913 short  The Bangville Police  starring ": null
    },
    {
        "Mabel Normand": "mabel normand"
    },
    {
        ".     As early as 1914, Sennett shifted the Keystone Cops from starring roles to background ensemble, in support of comedians like ": null
    },
    {
        "Charlie Chaplin": "charlie chaplin"
    },
    {
        " and ": null
    },
    {
        "Fatty Arbuckle": "roscoe arbuckle"
    },
    {
        ". The Keystone Cops served as supporting players for ": null
    },
    {
        "Marie Dressler": "marie dressler"
    },
    {
        ", Mabel Normand, and Chaplin in the first full-length Sennett comedy feature,  Tillies Punctured Romance  , as well as in  Mabels New Hero  with Normand and Arbuckle;  Making a Living  with Chaplin in his first screen appearance ;  In the Clutches of the Gang  with Normand, Arbuckle, and ": null
    },
    {
        "Al St. John": "al st. john"
    },
    {
        "; and  Wished on Mabel  with Arbuckle and Normand, among others. Comedian/actors ": null
    },
    {
        "Chester Conklin": "chester conklin"
    },
    {
        ",  ": null
    },
    {
        "Jimmy Finlayson": "jimmy finlayson"
    },
    {
        ",  ": null
    },
    {
        "Ford Sterling": "ford sterling"
    },
    {
        "  and director ": null
    },
    {
        "Del Lord": "del lord"
    },
    {
        "  were also Keystone Cops.     In 2010, the previously ": null
    },
    {
        "lost": "lost film"
    },
    {
        " short  A Thief Catcher  was rediscovered at an antique sale in ": null
    },
    {
        "Michigan": "michigan"
    },
    {
        ". The short, filmed in 1914, stars ": null
    },
    {
        "Ford Sterling": "ford sterling"
    },
    {
        ", ": null
    },
    {
        "Mack Swain": "mack swain"
    },
    {
        ", ": null
    },
    {
        "Edgar Kennedy": "edgar kennedy"
    },
    {
        ", and ": null
    },
    {
        "Al St. John": "al st. john"
    },
    {
        " and includes a previously unknown appearance of ": null
    },
    {
        "Charlie Chaplin": "charlie chaplin"
    },
    {
        " as a Keystone Kop.      Bag o Rags, the Keystone Kops unofficial theme music, was composed in 1912 by William Mac McKanless , an African-American orchestra leader, pianist and songwriter.         In Silent Stars, ": null
    },
    {
        "Jeanine Basinger": "jeanine basinger"
    },
    {
        " writes:            The original Keystone Cops numbered only seven: ": null
    },
    {
        "George Jeske": "george jeske"
    },
    {
        ", ": null
    },
    {
        "Bobby Dunn": "bobby dunn"
    },
    {
        ", ": null
    },
    {
        "Mack Riley": "mack riley"
    },
    {
        ", ": null
    },
    {
        "Charles Avery": "charles avery"
    },
    {
        ", ": null
    },
    {
        "Slim Summerville": "slim summerville"
    },
    {
        ", ": null
    },
    {
        "Edgar Kennedy": "edgar kennedy"
    },
    {
        ", ": null
    },
    {
        "Hank Mann": "hank mann"
    },
    {
        ". Lahue, Kalton ; Mack Sennetts Keystone: The man, the myth and the comedies; New York: Barnes; ; p. 194       Mack Sennett continued to use the Keystone Cops intermittently through the 1920s. By the time sound movies arrived, the Keystone Cops popularity had waned. In 1935, director Ralph Staub staged a revival of the Sennett gang for his ": null
    },
    {
        "Warner Brothers": "warner brothers"
    },
    {
        " short subject  Keystone Hotel , featuring a re-creation of the Kops clutching at their hats, leaping in the air in surprise, running energetically in any direction, and taking extreme pratfalls. This footage has been used countless times in later productions purporting to use silent-era material.     The Staub version of the Keystone Cops became a template for later re-creations. ": null
    },
    {
        "20th Century Foxs": "20th century fox"
    },
    {
        "1939 film  Hollywood Cavalcade  had ": null
    },
    {
        "Buster Keaton": "buster keaton"
    },
    {
        " in a Keystone chase scene. However, during his own silent film career, the only time he had been in a chase in the Keystone style was in  The Rough House , by ": null
    },
    {
        "Roscoe Arbuckle": "roscoe arbuckle"
    },
    {
        ". His own police chase scenes, such as in  The Goat  and  Cops  , were highly realistic.  Abbott and Costello Meet the Keystone Kops  included a lengthy chase scene, showcasing a group of stuntmen dressed as Sennetts squad.  ": null
    },
    {
        "Mel Brooks": "mel brooks"
    },
    {
        " directed a car chase scene in the Keystone Cops style in his comedy film  Silent Movie .     By the 1950s surviving silent movie comedians could be pressed into service as Keystone Cops regardless of whether they appeared with the troupe authentically. In the  This Is Your Life  TV tribute to ": null
    },
    {
        "Mack Sennett": "mack sennett"
    },
    {
        ", several Sennett alumni ran on stage dressed as Keystone Cops.     In 1969, Warner Bros announced a series of  Looney Tunes  shorts starring cartoon versions of the Cops were to be produced, but the studio closed its animation department before anything could develop from it.       The name has since been used to criticize any group for its mistakes, particularly if the mistakes happened after a great deal of energy and activity, or for a lack of coordination among the members. For example, the ": null
    },
    {
        "June 2004 election": "2004 canadian federal election"
    },
    {
        " campaign of the ": null
    },
    {
        "Liberal Party of Canada": "liberal party of canada"
    },
    {
        " was compared with the Keystone Kops running around by one of its parliamentary members, ": null
    },
    {
        "Carolyn Parrish": "carolyn parrish"
    },
    {
        ".  In criticizing the ": null
    },
    {
        "Department of Homeland Securitys": "department of homeland security"
    },
    {
        "response to ": null
    },
    {
        "Hurricane Katrina": "hurricane katrina"
    },
    {
        ", Senator ": null
    },
    {
        "Joseph Lieberman": "joseph lieberman"
    },
    {
        " claimed that emergency workers under DHS chief ": null
    },
    {
        "Michael Chertoff": "michael chertoff"
    },
    {
        " ran around like Keystone Kops, uncertain about what they were supposed to do or uncertain how to do it.  Another example is a statement by Peter Beattie, Premier of the Australian state of Queensland, on the counter-terrorism investigation into Gold Coast doctor ": null
    },
    {
        "Mohamed Haneef": "mohamed haneef"
    },
    {
        " in July 2007; after the Australian Federal Police committed a series of blunders, the Premier likened their actions to those of the Keystone Kops . A 2012 U.S. ": null
    },
    {
        "National Transportation Safety Board": "national transportation safety board"
    },
    {
        " report investigating Canadian energy company ": null
    },
    {
        "Enbridges": "enbridge"
    },
    {
        "handling of a July 2010 pipeline spill in the ": null
    },
    {
        "Kalamazoo River": "kalamazoo river"
    },
    {
        " compared it to the Keystone Cops.      In sport, the term has come into common usage by television commentators, particularly in the United Kingdom and ": null
    },
    {
        "Ireland": "republic of ireland"
    },
    {
        ". The rugby commentator Liam Toland uses the term to describe a teams incompetent performance on the pitch. The phrase Keystone cops defending has become a favorite catchphrase for describing a situation in an English football match where a defensive error or a series of defensive errors leads to a goal.  The term was also used to describe the play of the New York Jets against the New England Patriots in the  Buttfumble game , with sportscaster Cris Collinsworth declaring This is the Keystone Cops after the Jets gave up 21 points in 51 seconds.      According to ": null
    },
    {
        "Dave Filoni": "dave filoni"
    },
    {
        ", supervising director of the animated television series  Star Wars: The Clone Wars , the look of the police droid is based on the appearance of the Keystone Kops.  In 2018 David Blair stars as officer keystone in Silent Times Directed by Christopher Annino and Written by Geoff Blanchette. It also stars Olga Kurkulina and WWE legend Ron Bass      The 1983 video game  Keystone Kapers , released for the ": null
    },
    {
        "Atari 2600": "atari 2600"
    },
    {
        ", ": null
    },
    {
        "5200": "atari 5200"
    },
    {
        ", ": null
    },
    {
        "MSX": "msx"
    },
    {
        " and ": null
    },
    {
        "Colecovision": "colecovision"
    },
    {
        ", by ": null
    },
    {
        "Activision": "activision"
    }
]