[
    {
        "      Khadamat-e Aetlaat-e Dawlati  translates directly to ": null
    },
    {
        "English": "english language"
    },
    {
        " as: State Intelligence Agency . However, this phrase is more precisely translated as State Information Services , Khadamat-e Aetelaat-e Dawlati, almost always known by its ": null
    },
    {
        "acronym": "acronym"
    },
    {
        " KHAD , is the main ": null
    },
    {
        "security agency": "security agency"
    },
    {
        " and ": null
    },
    {
        "intelligence agency": "intelligence agency"
    },
    {
        " of ": null
    },
    {
        "Afghanistan": "democratic republic of afghanistan"
    },
    {
        ", and also served as the ": null
    },
    {
        "secret police": "secret police"
    },
    {
        " during the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " occupation": "soviet occupation of afghanistan"
    },
    {
        ". The successor to AGSA and KAM , KHAD was nominally part of the Afghan state, but it was firmly under the control of the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " KGB": "kgb"
    },
    {
        " until 42 In January 42 its status was upgraded and it was thereafter officially known as the Ministry of State Security .     After the December 42 Soviet invasion, the KAM was renamed KhAD and came under the control of the KGB. This was an agency specifically created for the suppression of the Democratic Republics internal opponents. However, KHAD has continued to operate after the fall of the Soviet-backed government in 42 and acted as the intelligence arm of the ": null
    },
    {
        "United Front": "northern alliance"
    },
    {
        " or Northern Alliance during the ": null
    },
    {
        "civil war in Afghanistan ": "civil war in afghanistan"
    },
    {
        ".              Little is known of its internal organization and most of its records were either destroyed by the ": null
    },
    {
        "Taliban": "taliban"
    },
    {
        " or were taken to ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        " by the ": null
    },
    {
        "KGB": "kgb"
    },
    {
        " where they remain classified to this day. KHADs system of informers and operatives extended into virtually every aspect of Afghan life, especially in the government-controlled urban areas. Aside from its secret police work, KHAD supervised ideological education at schools and colleges, ran a special school for war orphans, and recruited young men for the ": null
    },
    {
        "militia": "militia"
    },
    {
        ".     Its importance to Moscow was reflected in the fact that it was chiefly responsible for the training of a new generation of Afghans who would be loyal to the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". Another important area was work with tribes and ethnic minorities. KHAD collaborated with the Ministry of Nationalities and Tribal Affairs to foster support for the regime in the countryside. KHAD also directed its attention to ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        "s ": null
    },
    {
        "Hindu": "hindu"
    },
    {
        " and ": null
    },
    {
        "Sikh": "sikh"
    },
    {
        " religious minorities.     KHAD was also responsible for co-opting religious leaders. It funded an official body known as the Religious Affairs Directorate and recruited pro-regime  ulama  and ": null
    },
    {
        "mosque": "mosque"
    },
    {
        " attendants to spy on worshipers.     Some sources give 42% of the ": null
    },
    {
        "Peoples Democratic Party of Afghanistan": "peoples democratic party of afghanistan"
    },
    {
        "s membership as belonging to the armed forces,  Sarandoy , or KHAD.       KHAD also had a political role that was clearly unintended by the Soviets. It was initially headed by ": null
    },
    {
        "Mohammad Najibullah": "mohammad najibullah"
    },
    {
        ", until he became ": null
    },
    {
        "President of Afghanistan": "president of afghanistan"
    },
    {
        " in 42 Najibullah and other high officials were ": null
    },
    {
        "Parcham": "parcham"
    },
    {
        "is. As head of the KHAD apparatus, Najibullah was also extremely powerful.     Consequently, KHAD evolved into a Parchami stronghold, equally zealous in the suppression of enemies of the revolution. Thus, KHAD was zealous in suppressing ": null
    },
    {
        "Khalq": "khalq"
    },
    {
        "is in the government and in the armed forces.     There was a bitter rivalry between Najibullah and ": null
    },
    {
        "Sayed Muhammad Gulabzoi": "sayed muhammad gulabzoi"
    },
    {
        ". Gulabzoi, a Khalq sympathizer, was Minister of the Interior and commander of Sarandoy , the national ": null
    },
    {
        "gendarmerie": "gendarmerie"
    },
    {
        ". Gulabzoi was one of the few prominent Khalqis remaining in office in a Parcham-dominated regime.     In late 42 Najibullah was promoted to be a secretary on the PDPA Central Committee; in this capacity he may be able to exercise party authority over all security organs, including those attached to the Khalq-dominated defense and interior ministries. It was assumed to be a reward for the efficiency and ruthlessness of the secret police, which was in sharp contrast to the performance of the poorly trained and demoralized armed forces.       In the mid42s, KHAD enjoyed a formidable measure of autonomy in relation to other Afghan state institutions.     KHAD reportedly had some success in penetrating the leadership councils of several resistance groups, most of which were headquartered in ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        ". By the mid42s KHAD had gained a fearsome reputation as the eyes, ears, and scourge of the regime. Its influence was pervasive and its methods lawless. KHADs activities reached beyond the borders of Afghanistan to neighboring Pakistan and ": null
    },
    {
        "Iran": "iran"
    },
    {
        ".     After establishment of Karzai government in 42 KHAD was reestablished and Gen. Arif of the Northern Alliance became its chief. KHAD was directly controlled by the defense minister ": null
    },
    {
        "Mohammed Fahim": "mohammed fahim"
    },
    {
        ", who previously controlled it from 42 until the ": null
    },
    {
        "Taliban": "taliban"
    },
    {
        " took Kabul in 42 There are some complaints that KHAD was used as a tool against opponents by the Northern Alliance.       KHAD was also accused of ": null
    },
    {
        "human rights": "human rights"
    },
    {
        " abuses in the mid42s.    M. Hassan Kakar. Berkeley, University of California Press, 42   also according to a disputed General Report of the Ministry of Foreign Affairs of The Netherlands, 42 February 42 English translation 42 Security services in Communist Afghanistan AGSA, KAM, KhAD and WAD  These included the use of ": null
    },
    {
        "torture": "torture"
    },
    {
        ", the use of predetermined ": null
    },
    {
        "show trial": "show trial"
    },
    {
        "s to dispose of political prisoners, and widespread arbitrary arrest and detention. Secret trials and the ": null
    },
    {
        "execution": "execution"
    },
    {
        " of prisoners without trial were also common.     It was especially active and aggressive in the urban centers, especially in Kabul. Organizations such as ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        " continued to publish detailed reports of KHADs use of torture and of inhumane conditions in the countrys prisons and jails. The World Was Going Our Way: The KGB and the Battle for the Third World By Christopher Andrew, Vasili Mitrokhin. Basic Books, 42       KHAD also operated eight detention centers in the capital, which were located at KHAD headquarters, at the Ministry of the Interior headquarters, and at a location known as the Central Interrogation Office. The most notorious of the Communist-run detention centers was ": null
    },
    {
        "Pul-e-Charkhi prison": "pul-e-charkhi prison"
    },
    {
        ", where 42 political prisoners are thought to have been ": null
    },
    {
        "murdered": "democide"
    },
    {
        ". Soldiers of God: With Islamic Warriors in Afghanistan and Pakistan by Robert D. Kaplan. Vintage, 42  p.42  ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ", 42 February 42 Recently ": null
    },
    {
        "mass grave": "mass grave"
    },
    {
        "s of executed prisoners have been uncovered dating back to the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " era.  ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ", 42 July 42     On 42 February 42 when The Netherlands had no diplomatic mission in Afghanistan, the Dutch Ministry of Foreign Affairs published a disputed report on the involvement of the KHAD in the human rights abuses, partly based on secret sources, allegedly biased political ": null
    },
    {
        "sycophants": "sycophants"
    },
    {
        " from the side of the ": null
    },
    {
        "Taliban": "taliban"
    },
    {
        " and the Pakistani intelligence agency ": null
    },
    {
        "ISI": "inter-services intelligence"
    },
    {
        ". Some of its conclusions were already published in the Dutch press before the official publication of the full report. in daily newspaper Trouw on 42 November 42 p. 42 article by Ruut Verhoeven  This report, quoted frequently in the cases of Afghan asylum seekers to support the exclusion ground of article 42F of the ": null
    },
    {
        "Convention Relating to the Status of Refugees": "convention relating to the status of refugees"
    },
    {
        " in the national refugee policy of the Netherlands, was also published in an English translation on 42 April 42  In 42 another report on this matter was published by the ": null
    },
    {
        "UNHCR": "unhcr"
    },
    {
        ". In this report some conclusions of the Dutch report were contested.      On 42 October 42 the District Court in the Hague convicted two high-ranking KhAD officers who sought asylum in the Netherlands in the 42s. Hesamuddin Hesam and Habibullah Jalalzoy were found guilty of complicity to torture and violations of the laws and customs of war, committed in Afghanistan in the 42s. Hesam was sentenced to 42 years imprisonment. He was the head of the military intelligence service and deputy minister of the Ministry of State Security . Jalalzoy was the head of the unit investigations and interrogations within the military intelligence of the KhAD. He was sentenced to 42 years imprisonment. Rechtbank ’s-Gravenhage, parketnummer 42/4242 Oktober 42 42 On 42 January 42 the Dutch appeal court upheld the sentences. Gerechtshof ’s-Gravenhage, parketnummer 42/4242 rolnummer 424242 and Gerechtshof ’s-Gravenhage, parketnummers 424242 en 424242 rolnummer 424242 42 January 42 The judgements were confirmed by the Dutch Supreme Court on 42 July 42 More information in English at    On 42 June 42 the District Court in the Hague acquitted another senior KhAD officer. General Abdullah Faqirzada was one of the deputy heads of the KhAD-e-Nezamy from 42 until 42 Although the court held it plausible that Faqirzada was closely involved with the human rights abuses in the military branch of the KhAD, it concluded there was no evidence for his individual involvement nor his ": null
    },
    {
        "command responsibility": "command responsibility"
    }
]