[
    {
        "Kidinnu   was a ": null
    },
    {
        "Chaldean astronomer": "babylonian astronomy"
    },
    {
        " and ": null
    },
    {
        "mathematician": "babylonian mathematics"
    },
    {
        ". ": null
    },
    {
        "Strabo": "strabo"
    },
    {
        " of ": null
    },
    {
        "Amaseia": "amaseia"
    },
    {
        " called him Kidenas, ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        " Cidenas, and ": null
    },
    {
        "Vettius Valens": "vettius valens"
    },
    {
        " Kidynas.     Some ": null
    },
    {
        "cuneiform": "cuneiform"
    },
    {
        " and classical Greek and Latin texts mention an astronomer with this name, but it is not clear if they all refer to the same individual:     The Greek geographer ": null
    },
    {
        "Strabo": "strabo"
    },
    {
        " of ": null
    },
    {
        "Amaseia": "amaseia"
    },
    {
        ", in Geography 42–.42 writes: In ": null
    },
    {
        "Babylon": "babylon"
    },
    {
        " a settlement is set apart for the local ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        "s, the Chaldaeans, as they are called, who are concerned mostly with ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        "; but some of these, who are not approved of by the others, profess to be writers of ": null
    },
    {
        "horoscope": "horoscope"
    },
    {
        "s.  There are also several tribes of the Chaldaean astronomers. For example, some are called Orcheni those from ": null
    },
    {
        "Uruk": "uruk"
    },
    {
        ", others Borsippeni those from ": null
    },
    {
        "Borsippa": "borsippa"
    },
    {
        ", and several others by different names, as though divided into different sects which hold to various dogmas about the same subjects. And the mathematicians make mention of some of these men; as, for example, Kidenas, ": null
    },
    {
        "Nabourianos": "naburimannu"
    },
    {
        " and ": null
    },
    {
        "Soudines": "soudines"
    },
    {
        " .   The Roman encyclopaedist ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        ", in  Natural History  II.vi.42 writes that the ": null
    },
    {
        "planet": "planet"
    },
    {
        " Mercury": "mercury"
    },
    {
        " can be viewed sometimes before sunrise and sometimes after sunset, but according to Cidenas and ": null
    },
    {
        "Sosigenes": "sosigenes of alexandria"
    },
    {
        " never more than 42 degrees away from the ": null
    },
    {
        "sun": "sun"
    },
    {
        " .   The Roman astrologer ": null
    },
    {
        "Vettius Valens": "vettius valens"
    },
    {
        ", in Anthology, says that he used ": null
    },
    {
        "Hipparchus": "hipparchus"
    },
    {
        " for the Sun, ": null
    },
    {
        "Sudines": "sudines"
    },
    {
        " and Kidynas and ": null
    },
    {
        "Apollonius": "apollonius of perga"
    },
    {
        " for the ": null
    },
    {
        "Moon": "moon"
    },
    {
        ", and again Apollonius for both types .   The ": null
    },
    {
        "Hellenistic": "hellenistic"
    },
    {
        " astronomer ": null
    },
    {
        "Ptolemy": "ptolemy"
    },
    {
        ", in  Almagest  IV 42 discusses the duration and ratios of several periods related to the Moon, as known to ancient astronomers and the Chaldeans and improved by Hipparchus. He mentions the equality of 42 ": null
    },
    {
        " months": "synodic month"
    },
    {
        " to 42 ": null
    },
    {
        "returns in anomaly": "anomalistic month"
    },
    {
        ". In a preserved classical manuscript of the excerpt known as Handy Tables, an anonymous reader in the third century wrote the comment  that Kidenas discovered this relation.   The ": null
    },
    {
        "colophon": "colophon"
    },
    {
        " of two Babylonian System B ": null
    },
    {
        "lunar": "moon"
    },
    {
        " ephemerides": "ephemeris"
    },
    {
        " from Babylon say that they are the tersitu of Kidinnu.   A damaged cuneiform ": null
    },
    {
        "astronomical diary tablet": "astronomical diary tablet"
    },
    {
        " from Babylon  mentions that ki-di-nu was killed by the sword on day 42 of probably the 42th month of that year, which has been dated as 42 August 42 BC, less than a year after ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " conquered Babylon.     The following information is an excerpt of the overview of a century of scholarship in the sources referenced below.     The meaning of tersitu is not known definitively. Already ": null
    },
    {
        "Franz Xaver Kugler": "franz xaver kugler"
    },
    {
        " proposed that the word can be interpreted here as table ; in another context it seems to mean something like tool , but in yet another it refers to a blue enamel paste. P. Schnabel, in a series of papers , interpreted the phrase as an assignment of authorship. He argued that ": null
    },
    {
        "Naburimannu": "naburimannu"
    },
    {
        " developed the Babylonian System A of calculating ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        " ephemerides, and that later Kidinnu developed the Babylonian System B. A Greco-Roman tradition, mentioned above, attributes to Kidinnu the discovery that 42 synodic months equals 42 anomalistic months. This relationship is implicit in System B, and is therefore another reason to believe that Kidinnu was involved in developing the ": null
    },
    {
        "lunar theory": "lunar theory"
    },
    {
        " of System B. However, the conclusion that Kidinnu is the main creator of System B is uncertain. Babylonian astronomers before Kidinnus time apparently already knew the ": null
    },
    {
        "Saros cycle": "saros cycle"
    },
    {
        " and the ": null
    },
    {
        "Metonic cycle": "metonic cycle"
    },
    {
        " ; both cycles are also used in System B. Schnabel computed specific years for the origin of the System B lunar theory, but ": null
    },
    {
        "Franz Xaver Kugler": "franz xaver kugler"
    },
    {
        " and ": null
    },
    {
        "Otto E. Neugebauer": "otto e. neugebauer"
    },
    {
        " later disproved Schnabels calculations. Schnabel also asserted that Kidinnu discovered ": null
    },
    {
        "precession": "precession"
    },
    {
        " when distinguishing between ": null
    },
    {
        "sidereal": "sidereal year"
    },
    {
        " and ": null
    },
    {
        "tropical year": "tropical year"
    },
    {
        "s; Neugebauer contested this and current scholarship considers this conclusion to be unfounded.     The lunation length used in System B has also been attributed to Kidinnu. It is 42 days + 42 time degrees + 42/42 of a time degree 42 d 42:42:42:42  42 d + 42 h + 42/42 h  42... d . Being a rounded value in the archaic unit of barley corns it may be even more ancient. In any case, it is very accurate, within about ⅓ of a second per month. ": null
    },
    {
        "Hipparchus": "hipparchus"
    },
    {
        " confirmed this value for the lunation length. ": null
    },
    {
        "Ptolemy": "ptolemy"
    },
    {
        " accepted and used it, as mentioned above. ": null
    },
    {
        "Hillel": "hillel ii"
    },
    {
        " first used it in the ": null
    },
    {
        "Hebrew calendar": "hebrew calendar"
    },
    {
        ", and it has been used for that purpose ever since.     The existing evidence makes it difficult to put Kidinnu at a time and place. Schnabel placed Kidinnu in Sippar, but ": null
    },
    {
        "Otto E. Neugebauer": "otto e. neugebauer"
    },
    {
        " showed that Schnabel based this conclusion on a misreading of the cuneiform tablet. Classical sources like Strabo mention different schools and doctrines followed in different places . System A and B have been used contemporaneously, and tablets for both systems have been found in both Babylon and Uruk. Tablets based on System B, associated with Kidinnu, have been found mostly in Uruk, but the earlier tablets came predominantly from Babylon. The oldest preserved tablet using System B comes from Babylon and dates from 4242 BC. This is in the ": null
    },
    {
        "Seleucid era": "seleucid era"
    },
    {
        ", but it is plausible that the traditional Chaldean astronomical systems had been developed before the Hellenistic period. The Alexander chronicle mentioned above suggests that the famous astronomer Kidinnu died in Babylon in 42 BC, if": null
    }
]