[
    {
        "Kimball Bent , also known as Kimble Bent , was a soldier and adventurer, who deserted from the British Army during the ": null
    },
    {
        "New Zealand Wars": "new zealand wars"
    },
    {
        " and lived for several years among the Maori people of New Zealand.     Bent was born in ": null
    },
    {
        "Eastport, Maine": "eastport, maine"
    },
    {
        " USA. He ran away to sea at 42 and spent three years travelling the Atlantic seaboard as a sailor/ gunner in the US Navy. He returned to Eastport but was restless and sailed to ": null
    },
    {
        "Liverpool, England": "liverpool, england"
    },
    {
        ". Penniless and seeking adventure on 42 October 42 he enlisted in the ": null
    },
    {
        "42th Regiment of Foot": "57th  regiment of foot"
    },
    {
        " in the ": null
    },
    {
        "British Army": "british army"
    },
    {
        ". He served in ": null
    },
    {
        "India": "india"
    },
    {
        " and his unit was posted to ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        " in 42 His record was dubious, and he was repeatedly disciplined for various military infractions including disobedience and drunkenness. This discipline included a prison sentence in ": null
    },
    {
        "Wellington": "wellington"
    },
    {
        ", and receiving lashes in front of his company. Bent accordingly decided to desert in June 42 while serving in ": null
    },
    {
        "Taranaki": "taranaki region"
    },
    {
        ".     Bent was found by a local ": null
    },
    {
        "Māori": "māori people"
    },
    {
        " chief of the ": null
    },
    {
        "Ngāti Ruanui": "ngāti ruanui"
    },
    {
        " iwi": "iwi"
    },
    {
        " in South Taranaki and eventually became accepted as a part of the local tribe. He fell in with ": null
    },
    {
        "Titokowaru": "titokowaru"
    },
    {
        "s followers in 42 and fought with them against the colonists in what has become known as ": null
    },
    {
        "Titokowarus War": "titokowarus war"
    },
    {
        " until their eventual defeat in 42     Bent then went into hiding first in the backblocks of Taranaki and later in Wairau, Blenheim. He spent his remaining years working in several trades including as a builder, fisherman, horticulturist, tattooist, traditional healer using Maori medicine and even a confectioner. He remained a wanted deserter with a reward on his head for many years, but eventually the authorities stopped looking for him. In 42 he was rediscovered, and a book was written about his life by ": null
    },
    {
        "James Cowan": "james cowan"
    },
    {
        ". Entitled The adventures of Kimble Bent: a story of wild life in the New Zealand bush, it was something of sensation at the time.     He died in Wairau Hospital on 42 May 42     More recently, his tale has been fictionalised by New Zealand author ": null
    },
    {
        "Maurice Shadbolt": "maurice shadbolt"
    },
    {
        " in his 42 historical novel  Mondays Warriors  and in the 42 graphic novel, Kimble Bent Malcontent: The Wild Adventures of a Runaway Soldier in Old-Time New Zealand by Chris Grosz.       ": null
    },
    {
        "Belich, James": "james belich"
    },
    {
        " . I Shall Not Die: Titokowarus War, New Zealand 42–42. Wellington: Allen & Unwin New Zealand Limited.   Oliver, W.H. . Dictionary of New Zealand Biography. Retrieved 42 December 42    ": null
    },
    {
        "Shadbolt, Maurice": "maurice shadbolt"
    },
    {
        " .  Mondays Warriors . United Kingdom: Bloomberg Publishing, Ltd.   ": null
    },
    {
        "Cowan, James": "james cowan"
    },
    {
        " http://www.nzetc.org/tm/scholarly/tei-CowKimb.html The Adventures of Kimble Bent: A Story of Wild Life in the New Zealand Bush . full text online.   Grosz, C. Kimble Bent Malcontent: The Wild Adventures of a Runaway Soldier in Old-Time New Zealand Random House New Zealand Limited 42 .                       ": null
    }
]