[
    {
        "   The king is the most important ": null
    },
    {
        "piece": "chess piece"
    },
    {
        " in the game of ": null
    },
    {
        "chess": "chess"
    },
    {
        ". The object of the game is to threaten the opponents king in such a way that escape is not possible . If a players king is threatened with capture, it is said to be in check , and the player must remove the threat of  on the next move. If this cannot be done, the king is said to be in checkmate, resulting in a loss for that player. Although the king is the most important piece, it is usually the weakest piece in the game until a later phase, the ": null
    },
    {
        "endgame": "endgame"
    },
    {
        ". Players cannot make any move that places their own king in check.          White starts with the king on the first  to the right of the ": null
    },
    {
        "queen": "queen"
    },
    {
        ". Black starts with the king directly across from the white king. The white king starts on e42 and the black king on e42     A king can move one square in any direction unless the square is already occupied by a friendly piece or the move would place the king in check. As a result, opposing kings may never occupy adjacent squares , but the king can give ": null
    },
    {
        "discovered check": "discovered check"
    },
    {
        " by unmasking a ": null
    },
    {
        "bishop": "bishop"
    },
    {
        ", ": null
    },
    {
        "rook": "rook"
    },
    {
        ", or queen. The king is also involved in the special move of ": null
    },
    {
        "castling": "castling"
    },
    {
        ".                        In conjunction with a ": null
    },
    {
        "rook": "rook"
    },
    {
        ", the king may make a special move called castling, in which the king moves two squares toward one of its rooks and then the rook is placed on the square over which the king crossed. Castling is allowed only when neither the king nor the castling rook previously moved, no squares between them are occupied, the king is not in check, and the king will not move across or end its movement on a square that is under enemy attack.              A king that is under attack is said to be in check , and the player in check must immediately remedy the situation. There are three possible ways to remove the king from check:   The king is moved to an adjacent non-threatened square. A king cannot castle to get out of check.   A piece is interposed between the king and the attacking piece to break the line of threat .   The attacking piece is captured .     If none of the three options are available, the players king has been  checkmate d and the player loses the game.          A stalemate occurs when a player, on their turn, has no legal moves, and the players king is not in check.     If this happens, the king is said to have been stalemated and the game ends in a ": null
    },
    {
        "draw": "draw"
    },
    {
        ". A player who has very little or no chance of winning will often, in order to avoid a loss, ": null
    },
    {
        "try to entice the opponent": "swindle"
    },
    {
        " to inadvertently place the players king in stalemate.       In the ": null
    },
    {
        "opening": "chess opening"
    },
    {
        " and ": null
    },
    {
        "middlegame": "chess middlegame"
    },
    {
        ", the king will rarely play an active role in the development of an offensive or defensive position. Instead, a player will normally try to ": null
    },
    {
        "castle": "castling"
    },
    {
        " and seek safety on the edge of the board behind friendly ": null
    },
    {
        "pawns": "pawn"
    },
    {
        ". In the ": null
    },
    {
        "endgame": "chess endgame"
    },
    {
        ", however, the king emerges to play an active role as an offensive piece as well as assisting in the ": null
    },
    {
        "promotion": "promotion"
    },
    {
        " of their remaining pawns.     It is not meaningful to assign a value to the king relative to the other pieces, as it cannot be captured or ": null
    },
    {
        "exchanged": "exchange"
    },
    {
        ". In this sense, its value could be considered infinite. As an assessment of the kings capability as an offensive piece in the endgame, it is often considered to be slightly stronger than a bishop or knight  – ": null
    },
    {
        "Emanuel Lasker": "emanuel lasker"
    },
    {
        " gave it the value of a knight plus a ": null
    },
    {
        "pawn": "pawn"
    },
    {
        "  . It is better at defending nearby pawns than the knight is, and it is better at attacking them than the bishop is .             ": null
    },
    {
        "Unicode": "unicode"
    }
]