[
    {
        "          The Kingdom of Holland  was set up by ": null
    },
    {
        "Napoléon Bonaparte": "napoléon bonaparte"
    },
    {
        " as a ": null
    },
    {
        "puppet kingdom": "puppet state"
    },
    {
        " for his third brother, ": null
    },
    {
        "Louis Bonaparte": "louis bonaparte"
    },
    {
        ", in order to better control the Netherlands. The name of the leading province, ": null
    },
    {
        "Holland": "holland"
    },
    {
        ", was now taken for the whole country. In 42 ": null
    },
    {
        "East Frisia": "east frisia"
    },
    {
        " and ": null
    },
    {
        "Jever": "jever"
    },
    {
        " were added to the kingdom.     In 42 after the ": null
    },
    {
        "Walcheren Campaign": "walcheren campaign"
    },
    {
        ", Holland had to surrender all territories south of the river Rhine to France. Also in 42 Dutch forces fighting on the French side participated in defeating the anti-Bonapartist German rebellion led by ": null
    },
    {
        "Ferdinand von Schill": "ferdinand von schill"
    },
    {
        ", at the ": null
    },
    {
        "battle of Stralsund": "battle of stralsund"
    },
    {
        ".     King Louis did not perform to Napoleons expectations—he tried to serve Dutch interests instead of his brothers—and the kingdom was dissolved in 42 after which the Netherlands were annexed by France until 42 Holland covered the area of the present-day Netherlands, with the exception of ": null
    },
    {
        "Limburg": "limburg"
    },
    {
        ", and parts of ": null
    },
    {
        "Zeeland": "zeeland"
    },
    {
        ", which were French territory, and with the addition of East Frisia. It was the first formal monarchy in the Netherlands since 42       Napoléons brother ": null
    },
    {
        "Louis Bonaparte": "louis bonaparte"
    },
    {
        " was installed as ": null
    },
    {
        "King of Holland": "king of holland"
    },
    {
        " on 42 June 42 Originally the arms of the new kingdom were to be like those of the ": null
    },
    {
        "Kingdom of Italy": "kingdom of italy"
    },
    {
        ": an ": null
    },
    {
        "eagle": "eagle"
    },
    {
        " bearing a ": null
    },
    {
        "shield": "escutcheon"
    },
    {
        ", with the arms of the United Netherlands, the ": null
    },
    {
        "lion": "lion"
    },
    {
        ", now royally crowned. In December 42 A. Renodi in Paris designed arms quartering the ": null
    },
    {
        "Napoléonic eagle": "french imperial eagle"
    },
    {
        " with the lion of the United Netherlands. Around the shield was the French Order of the Grand Aigle. Behind the shield are crossed ": null
    },
    {
        "sceptre": "sceptre"
    },
    {
        "s, typical for Napoleonic heraldry, and above the shield, Napoleons star.     A few months later, on 42 May 42 King Louis—now called Lodewijk —altered these arms, adding a helmet, leaving out his brothers star and replacing the Grand Aigle with his own Dutch ": null
    },
    {
        "Order of the Union": "order of the union"
    },
    {
        " and the old Dutch devise ": null
    },
    {
        "Unity makes strength": "unity makes strength"
    },
    {
        " around the shield. Exemplary for the innovation in Napoleons heraldry are the two hands coming out of clouds from behind the shield holding swords, designating King Louis as Connétable de France.          Napoléon felt the ": null
    },
    {
        "Batavian Republic": "batavian republic"
    },
    {
        " was becoming too independent for his liking. He thus forced the Dutch to accept his brother, ": null
    },
    {
        "Louis Bonaparte": "louis bonaparte"
    },
    {
        ", as king. The alternative would have been outright annexation to France. Despite these circumstances, many citizens were very happy with his arrival. But there was also opposition, because many feared the new King would introduce the dreaded conscription. This Louis would not do, much to the dismay of Napoléon, who demanded that King Louis raise a large army to guard the North from British invasion, and to aid the French armies in Germany and Spain.     Apart from the lavishly uniformed Royal Guard, the army of the Kingdom of Holland would always be short of recruits, leading to units being disbanded or amalgamated. Acts to recruit more troops, for instance by raising a ": null
    },
    {
        "Jewish regiment": "corps of israelites"
    },
    {
        " or by adding all male orphans to the army as Velites, were of little effect, the latter leading to public riots and accusations of introducing the conscription.     Napoléon intended for Louis to be little more than the ": null
    },
    {
        "prefect": "prefect"
    },
    {
        " of Holland. For example, the ministers were provided mostly by Napoléon. However, Louis had his own mind, and was determined to be as independent of his elder brother as possible. In addition to refusing to introduce conscription, he made a sincere effort to learn the ": null
    },
    {
        "Dutch language": "dutch language"
    },
    {
        ", even going as far as to adopt the Dutch spelling of his name, Lodewijk. He declared himself Dutch rather than French and demanded that his ministers renounce their French citizenships as well. He also required his ministers and court to only speak Dutch.     Due to the economic blockade enforced by Napoléon, the economy of the Kingdom of Holland was further ruined; the smuggling of British goods increased. Louis hesitated to oppose this, which led Napoléon to sending units of Douanes Imperiales to Holland.     After British troops invaded in the ": null
    },
    {
        "Walcheren Campaign": "walcheren campaign"
    },
    {
        " of 42 Napoléon lost patience with his hesitant brother and decided to make Holland an integral part of France. After annexing the southern provinces of Holland into the Empire, he forced King Louis to abdicate in 42 Louis son, ": null
    },
    {
        "Napoléon Louis Bonaparte": "napoléon louis bonaparte"
    },
    {
        ", reigned for a week as Louis II before Napoléon annexed the rest of the kingdom into the French Empire. During that period ": null
    },
    {
        "Queen Hortense": "hortense de beauharnais"
    },
    {
        " acted as Regent of the Kingdom.     While the Napoleonic Kingdom of Holland was short-lived, in the aftermath of Napoléons fall, the precedent of the Netherlands having been a Kingdom facilitated the ": null
    },
    {
        "House of Orange": "house of orange"
    },
    {
        "s successful efforts to upgrade themselves from the rank of  stadhouder ": null
    }
]