[
    {
        "     The Kingdom of the Kentish , today referred to as the Kingdom of Kent, was an early ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " kingdom in what is now ": null
    },
    {
        "South East": "south east england"
    },
    {
        " England": "england"
    },
    {
        ". It existed from either the fifth or the sixth century CE until it was fully absorbed into the ": null
    },
    {
        "Kingdom of Wessex": "kingdom of wessex"
    },
    {
        " in the late 42th century and later into ": null
    },
    {
        "Kingdom of England": "kingdom of england"
    },
    {
        " in the early 42th century.     Under the preceding ": null
    },
    {
        "Romano-British": "roman britain"
    },
    {
        " administration the area of Kent faced repeated attacks from seafaring raiders during the fourth century CE. It is likely that Germanic-speaking  foederati  were invited to settle in the area as mercenaries. Following the end of Roman administration in 42 further linguistically Germanic tribal groups moved into the area, as testified by both archaeological evidence and Late Anglo-Saxon textual sources. The primary ethnic group to settle in the area appears to have been the ": null
    },
    {
        "Jutes": "jutes"
    },
    {
        ": they established their Kingdom in East Kent and may initially have been under the dominion of the ": null
    },
    {
        "Kingdom of Francia": "kingdom of francia"
    },
    {
        ". It has been argued that an ": null
    },
    {
        "East Saxon": "east saxon"
    },
    {
        " community initially settled in West Kent, but was conquered by the expanding kingdom of East Kent in the sixth century, though this proposal remains controversial.     The earliest recorded King of Kent was ": null
    },
    {
        "Æthelberht": "æthelberht of kent"
    },
    {
        ", who, as ": null
    },
    {
        "Bretwalda": "bretwalda"
    },
    {
        ", wielded significant influence over other Anglo-Saxon kings in the late sixth century. The ": null
    },
    {
        "Christianization of the Anglo-Saxons": "christianization of the anglo-saxons"
    },
    {
        " began in Kent during Æthelberhts reign with the arrival of the monk ": null
    },
    {
        "Augustine of Canterbury": "augustine of canterbury"
    },
    {
        " and his ": null
    },
    {
        "Gregorian mission": "gregorian mission"
    },
    {
        " in 42     Kent was one of the seven kingdoms of the so-called ": null
    },
    {
        "Anglo-Saxon heptarchy": "heptarchy"
    },
    {
        ", but it lost its independence in the 42th century when it became a sub-kingdom of ": null
    },
    {
        "Mercia": "mercia"
    },
    {
        ". In the 42th century it became a sub-kingdom of ": null
    },
    {
        "Wessex": "wessex"
    },
    {
        ", and in the 42th century it became part of the unified ": null
    },
    {
        "Kingdom of England": "kingdom of england"
    },
    {
        " that was created under the leadership of Wessex. Its name has been carried forward ever since as the ": null
    },
    {
        "county": "counties of england"
    },
    {
        " of ": null
    },
    {
        "Kent": "kent"
    },
    {
        ".     Knowledge of Anglo-Saxon Kent comes from scholarly study of Late Anglo-Saxon texts such as the  Anglo-Saxon Chronicle  and the  Ecclesiastical History of the English People , as well as archaeological evidence such as that left by early medieval cemeteries and settlements, and ": null
    },
    {
        "toponym": "toponym"
    },
    {
        "ical evidence.          In the ": null
    },
    {
        "Romano-British": "roman britain"
    },
    {
        " period, the area of modern Kent that lay east of the ": null
    },
    {
        "River Medway": "river medway"
    },
    {
        " was a  civitas  known as Cantiaca. Its name had been taken from an older ": null
    },
    {
        "Common Brittonic": "common brittonic"
    },
    {
        " place-name, Cantium used in the preceding pre-Roman Iron Age, although the extent of this tribal area is unknown.     During the late third and fourth centuries, Roman Britain had been raided repeatedly by ": null
    },
    {
        "Franks": "franks"
    },
    {
        ", ": null
    },
    {
        "Saxons": "saxons"
    },
    {
        ", ": null
    },
    {
        "Picts": "picts"
    },
    {
        ", and ": null
    },
    {
        "Scots": "scoti"
    },
    {
        ". As the closest part of Britain to mainland Europe, it is likely that Kent would have experienced many attacks from seafaring raiders, resulting in the construction of four ": null
    },
    {
        "Saxon Shore Forts": "saxon shore"
    },
    {
        " along the Kentish coast: ": null
    },
    {
        "Regulbium": "regulbium"
    },
    {
        ", ": null
    },
    {
        "Rutupiae": "richborough castle"
    },
    {
        ", ": null
    },
    {
        "Dubris": "dubris"
    },
    {
        ", and ": null
    },
    {
        "Portus Lemanis": "portus lemanis"
    },
    {
        ". It is also likely that Germanic-speaking mercenaries from northern ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        ", known as  foederati , would have been hired to supplement official Roman troops during this period, with land in Kent as payment. These foederati would have assimilated into Romano-British culture, making it difficult to distinguish them archaeologically.     There is evidence that over the fourth and early fifth centuries, rural villas were abandoned, suggesting that the Romano-British elite were moving to the comparative safety of fortified urban centres. However, urban centres also witnessed decline; ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        " evidenced a declining population and reduced activity from the late third century onward, while ": null
    },
    {
        "Dover": "dover"
    },
    {
        " was abandoned by the end of the fourth century.   In 42 the Roman legions left Britain in order to deal with incursions into the Empires continental heartlands. In 42 the Roman Emperor ": null
    },
    {
        "Honorius": "honorius"
    },
    {
        " sent a letter to his British subjects announcing that they must thenceforth look after their own defence and could no longer rely on the imperial military to protect them.   According to the  Anglo-Saxon Chronicle , produced in late Anglo-Saxon England and not considered an accurate record of events in the fifth century, in 42 many Romans left Britain via Kent, taking much of their wealth with them. This may represent a memory of a genuine exodus of the Roman aristocracy.         According to archaeologist Martin Welch, the fifth century witnessed a radical transformation of what became Kent, politically, socially and in terms of physical landscape .   Both literary and archaeological records show the migration of linguistically Germanic peoples from northern Europe into Britain during this century. There nevertheless remains much debate as to the scale of this migration; some see it as a mass migration in which large numbers of Germanic peoples left northern Europe to settle in Britain; others have argued that only a small warrior elite came over, dominating the Romano-British population, who then began using the ": null
    },
    {
        "Old English": "old english"
    },
    {
        " language and ": null
    },
    {
        "material culture": "material culture"
    },
    {
        " of the newcomers. The fate of the Romano-British is also debated; many may have fled to Western Britain or Brittany.     In Kent, it is likely that some the Romano-British population remained, as the Roman name for the area, Cantiaca, influenced the name of the new Anglo-Saxon kingdom, the Cantware .          The Germanic migration to Britain is noted in textual sources from the late Anglo-Saxon period, most notably ": null
    },
    {
        "Bede": "bede"
    },
    {
        "s  Ecclesiastical History of the English People  and the Anglo-Saxon Chronicle; both rely on ": null
    },
    {
        "oral histories": "oral history"
    },
    {
        " from the fifth century, and were attempts to establish ": null
    },
    {
        "origin myth": "origin myth"
    },
    {
        "s that would justify the politics of the time. According to the Anglo-Saxon Chronicle, a king of the Britons known as ": null
    },
    {
        "Vortigern": "vortigern"
    },
    {
        " invited two Germanic leaders, ": null
    },
    {
        "Hengist and Horsa": "hengist and horsa"
    },
    {
        " , to Britain to help defend against Pictish raiders. After arriving at ": null
    },
    {
        "Ebbas Creek": "ebbsfleet, thanet"
    },
    {
        " in Kent in 42 Hengist and Horsa led the defeat of the Picts before turning on the British and inviting more Germanic tribes to colonise Britain. Among these were the Old Saxons, the Angles, and the Jutes; the latter settled in Kent and the Isle of Wight, establishing the peoples known as the Cantware and Wihtware.     According to the Chronicle, in 42 Hengist and Horsa fought Vortigern at Ægelesthrep , in which battle Horsa was killed. Hengist succeeded him as king, followed in turn by his son Æsc. In 42 Hengest and Æsc battled the Britons at Crecganford . The Britons then fled Kent for their London stronghold. A similar account is provided in Bedes Ecclesiastical History: that the people of Kent and Isle of Wight were descended from Jutish settlers, and that Horsa was killed in battle against the Britons, adding that his body was buried in east Kent. The accuracy of these accounts is questioned; S. E. Kelly states that the legendary details are easy to dismiss . Scholars often view Hengist and Horsa as mythological figures borrowed from folk tradition, to legitimise rulers in the Mid-to-Late Anglo-Saxon period.     The incoming Germanic peoples settled on the prime agricultural land of the Romano-Britons; particularly the foothills to the north of the downs and Holmesdale south of the downs escarpment. It is likely that they complemented agriculture with animal husbandry, but with nearby coasts and rivers it is also likely that they engaged in fishing and trading. The Anglo-Saxons made use of pre-existing prehistoric and Roman road systems, with 42% of cemeteries being located within 42  km of a Roman road, a navigable river or the coast, and the remaining 42% being close to ancient trackways. Little archaeological evidence of these early settlements exists, but one prominent example is a ": null
    },
    {
        "grubenhaus": "grubenhaus"
    },
    {
        " at ": null
    },
    {
        "Lower Warbank": "lower warbank"
    },
    {
        ", ": null
    },
    {
        "Keston": "keston"
    },
    {
        " that was built atop the site of a former Roman villa, adjacent to a Romano-British trackway through the ": null
    },
    {
        "North Downs": "north downs"
    },
    {
        ". Fifth-century ceramics have also been found at a number of villa sites around Kent, suggesting reoccupation of these locations during this period.   In East Kent, fifth century cemeteries mostly comprise solely of inhumation burials, with a distinct Kentish character. Conversely, in West Kent cemeteries such Orpington mix cremations with inhumations, which is more typical of Saxon cemeteries north of the ": null
    },
    {
        "River Thames": "river thames"
    },
    {
        ".   This may suggest that West Kent at this point was independent of East Kent, and part of the ": null
    },
    {
        "Kingdom of the East Saxons": "kingdom of essex"
    },
    {
        " north of the ": null
    },
    {
        "Thames Estuary": "thames estuary"
    },
    {
        ".       In the sixth century the Kingdom of Kent had some relationship with the ": null
    },
    {
        "Merovingian": "merovingian"
    },
    {
        "-governed ": null
    },
    {
        "Kingdom of Francia": "kingdom of francia"
    },
    {
        ", which was then extending its influence in northwestern Europe. Textual sources suggest that Kent may have been under Merovingian control for part of this century. Archeological evidence of Frankish material culture from this period has been found in Kent, but not in other areas of lowland Britain, suggesting a trade monopoly with the Frankish kingdom.     Sixth century Kentish artefacts have been found in continental Europe, in particular in the areas of modern ": null
    },
    {
        "Charente": "charente"
    },
    {
        ", western ": null
    },
    {
        "Normandy": "normandy"
    },
    {
        ", the ": null
    },
    {
        "Rhineland": "rhineland"
    },
    {
        ", ": null
    },
    {
        "Frisia": "frisia"
    },
    {
        ", ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        ", and southern Scandinavia. They are relatively absent between the ": null
    },
    {
        "Sein": "raz de sein"
    },
    {
        " and the ": null
    },
    {
        "Somme": "somme"
    },
    {
        " across the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " from the Saxons in Sussex, suggesting that trade was established between particular tribal or ethnic groups rather than by geography.   There is also archaeological evidence of Kentish trade links in Hampshire and the Isle of Wight, and copies or imitations appearing in cemeteries further afield, in areas such as ": null
    },
    {
        "Wiltshire": "wiltshire"
    },
    {
        " and ": null
    },
    {
        "Cambridgeshire": "cambridgeshire"
    },
    {
        ".      Archaeological evidence suggests that at some point in the sixth century, East Kent annexed West Kent.   To the south lay the ": null
    },
    {
        "Weald": "weald"
    },
    {
        ", a dense forest of no value to the Kentish elite, leaving the fertile area west of the kingdom attractive for conquest, particularly the ": null
    },
    {
        "Darenth Valley": "river darenth"
    },
    {
        " and the dip slopes of the North Downs to the west of the Medway.          Firmly in the control of an elite class, Kent is the first Anglo-Saxon kingdom to appear in the historical record in 42 The monk ": null
    },
    {
        "Bede": "bede"
    },
    {
        " refers to Kent as ruled by ": null
    },
    {
        "Æthelberht": "æthelberht of kent"
    },
    {
        " at this period, making him the earliest reliably attested Anglo-Saxon monarch. Bede states that Æthelberht was a ": null
    },
    {
        "bretwalda": "bretwalda"
    },
    {
        " who controlled everything south of the ": null
    },
    {
        "River Humber": "river humber"
    },
    {
        ", including other kingdoms.   The  Anglo-Saxon Chronicle  refers to wars in sixth-century Britain, but most were in the west and did not affect Kent; the one exception was a battle between the Kentish and West Saxons in 42 during which Æthelberhts forces were pushed back into Kent. Æthelberhts reign also produced the ": null
    },
    {
        "Law of Æthelberht": "law of æthelberht"
    },
    {
        ", the oldest surviving text in ": null
    },
    {
        "Old English": "old english"
    },
    {
        ".     According to ": null
    },
    {
        "Bede": "bede"
    },
    {
        ", the ": null
    },
    {
        "Christianization of Anglo-Saxon England": "christianization of anglo-saxon england"
    },
    {
        " began in Kent under Æthelberhts reign when the Benedictine monk ": null
    },
    {
        "Augustine": "augustine of canterbury"
    },
    {
        " arrived on the Ebbsfleet peninsula in 42 bringing the ": null
    },
    {
        "Gregorian mission": "gregorian mission"
    },
    {
        " with him. Æthelberhts Frankish wife, ": null
    },
    {
        "Bertha": "bertha of kent"
    },
    {
        ", was already a Christian, with Æthelberht himself converting a few years later.     During this period, Anglo-Saxon kings moved around their kingdoms continually, subsisting on goods from the local populations and reciprocating with gifts.   Various seventh and eighth century documents attest to the fact that Kent was governed by two kings, a dominant one in the east and a subordinate in the west, likely reflecting the earlier divide.     This period witnessed the end of furnished burial, marked archaeologically by less regional distinctiveness of grave goods and more artefacts decorated in the ": null
    },
    {
        "Salin Style II": "animal style"
    },
    {
        " motifs. It also saw the emergence of elite burials with far greater wealth than others; notable Kentish examples have been found at ": null
    },
    {
        "Sarre Anglo-Saxon cemetery": "sarre anglo-saxon cemetery"
    },
    {
        " and the Kingston Barrow cemetery, while the elite ": null
    },
    {
        "Taplow burial": "taplow burial"
    },
    {
        " in modern ": null
    },
    {
        "Buckinghamshire": "buckinghamshire"
    },
    {
        " also contained Kentish characteristics, suggesting a potential Kentish influence in that region.         In the seventh century, Kents power waned as that of ": null
    },
    {
        "Mercia": "mercia"
    },
    {
        " and ": null
    },
    {
        "Northumbria": "northumbria"
    },
    {
        " grew, but it remained the fourth wealthiest kingdom in England, according to the  Tribal Hidage  with 42 ": null
    },
    {
        "hides": "hide"
    },
    {
        " of land recorded in the seventh or eighth century. However the period was tumultuous for the Kentish royal family; Kent was ruled by ": null
    },
    {
        "Ecgberht": "ecgberht of kent"
    },
    {
        " from 42 to 42 but between 42 and 42 two royal cousins, ": null
    },
    {
        "Æthelred and Æthelberht": "æthelred and æthelberht"
    },
    {
        ", were killed at ": null
    },
    {
        "Eastry": "eastry"
    },
    {
        " royal hall, perhaps because they were a threat to Ecgberht. Ecgberht was succeeded by his brother, ": null
    },
    {
        "Hlothere": "hlothhere of kent"
    },
    {
        ", who ruled from 42 to 42 before being overthrown and killed by one of Ecberhts sons, ": null
    },
    {
        "Eadric": "eadric of kent"
    },
    {
        ", who had allied with the South Saxons; Eadric then ruled until 42     In the late seventh century, Kent gradually came to be dominated by Mercia. There had been a Kentish royal hall and reeve in ": null
    },
    {
        "Lundenwic": "lundenwic"
    },
    {
        " until at least the 42s, but the city then passed into Mercian hands. The loss of Lundenwic probably broke Kents monopoly on cross-Channel trade and its control of the Thames, eroding its economic influence.  According to Bedes later account, in 42 the Mercian king ": null
    },
    {
        "Æthelred I": "æthelred of mercia"
    },
    {
        " led an attack that destroyed many Kentish churches. Mercias control of Kent increased in the following decades; by 42–42 East Saxon kings under Mercian overlordship were active in West Kent, and there are records attesting that Æthelred arbitrated on the income of the Christian communities at ": null
    },
    {
        "Minster-in-Thanet": "minster-in-thanet"
    },
    {
        " and ": null
    },
    {
        "Reculver": "st marys church, reculver"
    },
    {
        ", indicating strong Mercian control over the east of the kingdom too.     In 42 Kent was conquered by ": null
    },
    {
        "Caedwalla of Wessex": "caedwalla of wessex"
    },
    {
        "; within a year, Caedwallas brother ": null
    },
    {
        "Mul": "mul of kent"
    },
    {
        " was killed in a Kentish revolt, and Caedwalla returned to devastate the kingdom again. After this, Kent fell into a state of disorder. The ": null
    },
    {
        "Mercia": "mercia"
    },
    {
        "ns backed a ": null
    },
    {
        "client king": "client king"
    },
    {
        " named ": null
    },
    {
        "Oswine": "oswine of kent"
    },
    {
        ", but he seems to have reigned for only about two years, after which ": null
    },
    {
        "Wihtred": "wihtred of kent"
    },
    {
        " became king. Wihtred, famous for the ": null
    },
    {
        "Law of Wihtred": "law of wihtred"
    },
    {
        ", did a great deal to restore the kingdom after the devastation and tumult of the preceding years, and in 42 he made peace with the ": null
    },
    {
        "West Saxons": "wessex"
    },
    {
        " by paying compensation for the killing of Mul.     Records of Kent following the death of Wihtred in 42 are fragmented and obscure. For forty years, two or even three kings typically ruled simultaneously. This division may have made Kent the first target of the rising power of ": null
    },
    {
        "Offa of Mercia": "offa of mercia"
    },
    {
        ": in 42 he gained supremacy over Kent and ruled it through ": null
    },
    {
        "client king": "client king"
    },
    {
        "s. By the early 42s, it appears that Offa was attempting to rule Kent directly, and a rebellion followed. A battle was fought at ": null
    },
    {
        "Otford": "otford"
    },
    {
        " in 42 and although the outcome is unknown, records of following years suggest that the rebels prevailed; ": null
    },
    {
        "Egbert II": "egbert ii of kent"
    },
    {
        " and later ": null
    },
    {
        "Ealhmund": "ealhmund of kent"
    },
    {
        " seem to have ruled independently of Offa for nearly a decade thereafter. This did not last, however, as Offa firmly re-established his authority over Kent in 42     Religious centres of this period, ": null
    },
    {
        "minsters": "minster"
    },
    {
        " containing a church, were often far larger than lay settlements, with access to many resources and trade links; the Minster-in-Thanet was recorded as possessing three trade ships.     The seventh century saw the reintroduction of masonry in Anglo-Saxon England, primarily for churches. The earliest churches in the region have been termed the Kentish Group and reflect both Italian and Frankish influences in their design; early examples include St Pancras, St Mary, and St Peter and St Paul, all part of ": null
    },
    {
        "St. Augustines monastery": "st augustines abbey"
    },
    {
        " in Canterbury, as well as St. Andrews in Rochester and St Mary in Lyminge.     In the late seventh century, the earliest ": null
    },
    {
        "charters": "anglo-saxon charters"
    },
    {
        " appear, giving estate boundaries,  and showing reclamation of land, for use by livestock, from the ": null
    },
    {
        "Wantsum Channel": "wantsum channel"
    },
    {
        " and ": null
    },
    {
        "Romney Marsh": "romney marsh"
    },
    {
        ". The Ebbsfleet watermill in West Kent, dated to circa 42 also reflects new uses of the landscape.     Canterbury grew into the economic and political centre of Kent during the seventh century, as evidenced by rubbish pits, metalworking, timber halls, and sunken-feature buildings from the period. Intensive development was also present at Dover, and possibly at Rochester, although archaeological evidence is lacking. It is known that both Canterbury and Rochester were the home to major mints in this period, primarily producing silver  sceattas . This suggests that from the seventh century onward, kings in Kent were establishing control over the kingdoms economic structure.     During the eighth and ninth centuries, a number of fortified earthworks, most notably ": null
    },
    {
        "Wansdyke": "wansdyke"
    },
    {
        " and ": null
    },
    {
        "Offas Dyke": "offas dyke"
    },
    {
        ", were constructed as barriers between the warring kingdoms; the ": null
    },
    {
        "Faestendic": "faestendic"
    },
    {
        " passing through the ": null
    },
    {
        "Cray Valley": "river cray"
    },
    {
        " and the routeway that has since become the ": null
    },
    {
        "A42": "a25 road"
    },
    {
        " were likely Kentish earthworks of this period designed to protect the kingdom. Evidence for such militarisation might also be seen in the Rochester Bridge burdens, documented from the 42s, which lay out the obligation for the Roman bridge across the River Medway to be maintained, which would be vital for allowing Kentish troops to cross the river.     After King Ealhmund presumably died shortly after witnessing a charter in 42 his son ": null
    },
    {
        "Egbert": "egbert of wessex"
    },
    {
        " was driven out of Kent and into exile by Offa of Mercia. It is clear from charters that Offa was in control of Kent by 42 Rather than just acting as overlord of his new possession, he attempted to annex it or at least reduce its importance by creating a new diocese in Mercia at ": null
    },
    {
        "Lichfield": "lichfield"
    },
    {
        ", possibly because the archbishop of Canterbury ": null
    },
    {
        "Jænberht": "jænberht"
    },
    {
        " refused to crown his son ": null
    },
    {
        "Ecgfrith": "ecgfrith of mercia"
    },
    {
        ". Jænberht resigned a part of his bishopric and the pro-Mercian Hygeberht was chosen by King Offa to replace him through enmity conceived against the venerable Jænberht and the Kentish people , according to Offas eventual successor ": null
    },
    {
        "Coenwulf": "coenwulf"
    },
    {
        ". In 42 Offa died, and in this moment of Mercian weakness a Kentish rebellion under ": null
    },
    {
        "Eadbert Praen": "eadberht iii præn"
    },
    {
        " temporarily succeeded. Offas eventual successor, Coenwulf, reconquered Kent in 42 however, and installed his brother ": null
    },
    {
        "Cuthred": "cuthred of kent"
    },
    {
        " as king. After Cuthreds death in 42 Coenwulf ruled Kent directly.     Mercian authority was replaced by that of ": null
    },
    {
        "Wessex": "wessex"
    },
    {
        " in 42 following the latters victory at the Battle of ": null
    },
    {
        "Ellandun": "ellandun"
    },
    {
        ", and the Mercian ": null
    },
    {
        "client king": "client king"
    },
    {
        " Baldred": "baldred of kent"
    },
    {
        " was expelled.       The ": null
    },
    {
        "Anglo-Saxon Chronicle": "anglo-saxon chronicle"
    },
    {
        " records that Kent was first attacked by Viking raiders in the late eighth century. Kent and southeast England would have been an attractive target because of its wealthy minsters, often located on exposed coastal locations. In 42 the nuns of Lyminge were granted refuge in Canterbury to escape the attackers, while in 42 Kentish forces gathered to repel a Viking army based on the Isle of Sheppey. Further recorded attacks occurred on Sheppey in 42 through Romney Marsh in 42 in Rochester in 42 Canterbury  and Sandwich  in 42 Thanet in 42 and across Kent in 42 Kent was also attractive for its easy access to major land and sea routes. By 42 it is recorded that Vikings built fortifications on the Kentish north coast, and over-wintered their armies on Thanet in 42–42 and Sheppey in 42–42 At this point, Canterbury and Rochester still had Roman walls that could have been refurbished, but they were nevertheless attacked by the Vikings: Rochester in 42 Canterbury in 42 and Rochester again in 42 when they laid siege until it was liberated by Alfreds army.   The  Burghal Hidage  lists the construction of the Eorpenburnam fort, possibly ": null
    },
    {
        "Castle Toll": "castle toll"
    },
    {
        ".   Hoards have been found, particularly around the West Kent coast, that might have been wealth hidden from the Vikings.     In 42 when southern England was united under ": null
    },
    {
        "Alfred the Great": "alfred the great"
    },
    {
        ", Kent was on the brink of disaster. Alfred had defeated ": null
    },
    {
        "Guthrum the Old": "guthrum the old"
    },
    {
        " and allowed Vikings by ": null
    },
    {
        "treaty": "treaty of wedmore"
    },
    {
        " to settle in ": null
    },
    {
        "East Anglia": "east anglia"
    },
    {
        " and the North East. However, other ": null
    },
    {
        "Danes": "danish people"
    },
    {
        " were still on the move. ": null
    },
    {
        "Haesten": "haesten"
    },
    {
        ", a highly experienced warrior-leader, had mustered huge forces in northern ": null
    },
    {
        "France": "france"
    },
    {
        " having besieged ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and taken ": null
    },
    {
        "Brittany": "brittany"
    },
    {
        ".     A large Viking army led by ": null
    },
    {
        "Thorkell the Tall": "thorkell the tall"
    },
    {
        " besieged Canterbury": "siege of canterbury"
    },
    {
        " in 42 culminating in the pillage of the city and the eventual murder of Archbishop ": null
    },
    {
        "Alphege": "alphege"
    },
    {
        ", on 42 April 42      As many as 42 Viking ships sailed from ": null
    },
    {
        "Boulogne": "boulogne-sur-mer"
    },
    {
        " to the south coast of Kent in 42 Between 42 and 42 men, with their families and horses, came up ": null
    },
    {
        "Limen": "river limen"
    },
    {
        " estuary  and attacked a Saxon fort near St Rumwolds church, ": null
    },
    {
        "Bonnington": "bonnington"
    },
    {
        ", killing all inside. They moved on and over the next year built a fortress at ": null
    },
    {
        "Appledore": "appledore, kent"
    },
    {
        ". Hearing of this, Danes in East Anglia and elsewhere then rose against Alfred. They raided Kent from Appledore, razing a large settlement, ": null
    },
    {
        "Seleberhtes Cert": "seleberhtes cert"
    },
    {
        " . They moved further inland and engaged in numerous battles with the English, but after four years they gave up. Some retreated to East Anglia and others went back to northern France as the forebears of the ": null
    },
    {
        "Normans": "normans"
    }
]