[
    {
        "            The Kingsway Tramway Subway is a ": null
    },
    {
        "cut-and-cover": "tunnelcut-and-cover"
    },
    {
        " Grade II Listed": "listed buildings"
    },
    {
        " tunnel in ": null
    },
    {
        "central London": "central london"
    },
    {
        ", built by the ": null
    },
    {
        "London County Council": "london county council"
    },
    {
        ", and the only one of its kind in Britain. The decision in 42 to clear slum districts in the ": null
    },
    {
        "Holborn": "holborn"
    },
    {
        " area provided an opportunity to use the new streets for a tramway connecting the lines in the north and south. Following the pattern of tramways in New York  and ": null
    },
    {
        "Boston": "boston"
    },
    {
        " , it was decided to build this as an underground connection.           The ": null
    },
    {
        "London County Council": "london county council"
    },
    {
        " had for many years wanted to connect its North Side and South Side tramway networks in order to be able to send North Side trams for overhaul to the Central Repair Depot at ": null
    },
    {
        "Charlton": "charlton, greenwich"
    },
    {
        " in South East London. In 42 it decided to build a subway from Theobalds Road in the north to the ": null
    },
    {
        "Embankment": "victoria embankment"
    },
    {
        " underneath ": null
    },
    {
        "Waterloo Bridge": "waterloo bridge"
    },
    {
        " to the south, from where a surface line would continue over the bridge. Legal problems delayed permission to build the subway and tram route and it was not until 42 that permission to build was granted, and then not to cross the bridge. Because of a sewer at the northern end and the ": null
    },
    {
        "District Railway": "district line"
    },
    {
        " to the south it was decided to build the subway for single-deck trams only. After leaving the subway at the south end, trams turned right along the Embankment to ": null
    },
    {
        "Westminster Bridge": "westminster bridge"
    },
    {
        " or left on a service from ": null
    },
    {
        "Bloomsbury": "bloomsbury"
    },
    {
        " to the ": null
    },
    {
        "Hop Exchange": "hop exchange"
    },
    {
        ". This latter service was short-lived and the tracks were removed in 42     The approach from the north near Southampton Row was a  open cutting with a 42 in 42 gradient. The tracks passed through ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        " tubes underneath the ": null
    },
    {
        "Fleet sewer": "fleet river"
    },
    {
        " before rising slightly to enter ": null
    },
    {
        "Holborn tramway station": "holborn tramway station"
    },
    {
        ". South from here the subway was built with a steel roof to ": null
    },
    {
        "Aldwych tramway station": "aldwych tramway station"
    },
    {
        " and, because it was not initially planned to run a public service south of here, the tracks leading towards the Strand were used as a depot with appropriate equipment and inspection pits.     In the parliamentary session of 42 plans were submitted for an additional station at the south end of the tunnel, under Wellington Street. The opening of the new tramway along the Embankment meant it was decided to link up with this route instead and the station was never built. A new sharp curve was built under Lancaster Place to enable an exit through the western side wall of ": null
    },
    {
        "Waterloo Bridge": "waterloo bridge"
    },
    {
        " and a triangular junction with the through line was constructed. The eastern side of this junction, leading to ": null
    },
    {
        "Blackfriars": "blackfriars, london"
    },
    {
        ", was removed as part of the 42s upgrade.         Services opened to the public on 42 February 42 from ": null
    },
    {
        "Angel": "angel, london"
    },
    {
        " to Aldwych, with a ceremonial opening by the chairman of the Highways Committee. The first journey took 42 minutes northbound and 42 minutes to return, despite ": null
    },
    {
        "horse-drawn vehicle": "horse-drawn vehicle"
    },
    {
        "s also using the roads on the surface part of the route. On 42 November that year the routes were extended north from The Angel to ": null
    },
    {
        "Highbury station": "highbury  &  islington station"
    },
    {
        ". Special trams were constructed from non-flammable materials – wooden trams, common on other routes, were not permitted through the subway.     Through services commenced on 42 April 42 from Highbury station to ": null
    },
    {
        "Tower Bridge": "tower bridge"
    },
    {
        " and to ": null
    },
    {
        "Kennington Gate": "kennington"
    },
    {
        ", with a procession of six cars going south from the ": null
    },
    {
        "Holborn": "holborn"
    },
    {
        " through to ": null
    },
    {
        "Kennington": "kennington"
    },
    {
        ", then to ": null
    },
    {
        "Elephant and Castle": "elephant and castle"
    },
    {
        " in order to return through the subway to Angel. The Kennington service was not commercially viable and services were diverted to operate to Queens Road in ": null
    },
    {
        "Battersea": "battersea"
    },
    {
        " which, due to a low bridge, could be operated with single-deck vehicles only. Drivers of the trams recorded difficulty in climbing the ramp north from Holborn tramway station and would sometimes roll all the way back to the station. Drivers on routes through the subway had to have at least two years experience on other services to be considered for these routes.       Service patterns continued to change, especially with the opening of tram lines over ": null
    },
    {
        "Blackfriars Bridge": "blackfriars bridge"
    },
    {
        " on 42 September 42 and during the 42s it was realised that to remain profitable the subway needed to be able to take double-deck trams. In 42 it was decided to increase the headroom to . Work started on 42 September of that year, resulting in the replacement of the cast iron tubes by a new steel girder-supported roof and the diversion of the sewer. In places the trackbed was lowered by , requiring the ": null
    },
    {
        "underpinning": "underpinning"
    },
    {
        " of the walls with concrete. After the last services ran on the night of 42 February 42 the subway was closed until the formal re-opening on 42 January 42 using E/42 type tram no. 42 on new route 42 with public services starting the following day. The two tramway stations were also completely rebuilt. Routes were now ": null
    },
    {
        "Hackney": "london borough of hackney"
    },
    {
        " to ": null
    },
    {
        "Wandsworth": "wandsworth"
    },
    {
        " or ": null
    },
    {
        "Tooting": "tooting"
    },
    {
        ", ": null
    },
    {
        "Leyton": "leyton"
    },
    {
        " to ": null
    },
    {
        "Westminster": "westminster"
    },
    {
        ", ": null
    },
    {
        "Highbury": "highbury"
    },
    {
        " to ": null
    },
    {
        "Waterloo station": "london waterloo railway station"
    },
    {
        " or ": null
    },
    {
        "Norbury": "norbury"
    },
    {
        " and ": null
    },
    {
        "Archway": "archway, london"
    },
    {
        " to ": null
    },
    {
        "Kennington": "kennington"
    },
    {
        ".     A weekend service between ": null
    },
    {
        "Highgate ": "archway, london"
    },
    {
        " and ": null
    },
    {
        "Downham": "downham"
    },
    {
        " via ": null
    },
    {
        "Brockley": "brockley"
    },
    {
        " ran until 42 With a distance of , this was the longest tram route entirely within the ": null
    },
    {
        "County of London": "county of london"
    },
    {
        ".          The ": null
    },
    {
        "London Passenger Transport Board": "london passenger transport board"
    },
    {
        " was formed in 42 taking over the London County Council trams. It was decided soon after to replace all ": null
    },
    {
        "trams in London": "trams in london"
    },
    {
        " by more modern vehicles . The abandonment programme began in 42 with trams in South-West, West, North-West, North and East London mostly being replaced by ": null
    },
    {
        "trolleybuses": "trolleybuses in london"
    },
    {
        ". The replacement programme proceeded swiftly until 42 when the last of the pre-war series of conversions occurred, leaving only the South London trams and the subway routes 42 42 and 42 the only North London tram routes to survive the war.      Prototype Kingsway trolleybus no. 42 with exits on both sides with folding doors, was constructed for feasibility tests through the subway, but these were unsuccessful as trolleybuses would have had to run on battery power through the subway, headroom restrictions making it impossible to use overhead current collection. The vehicle was retained and ran in normal service alongside conventional trolleybuses.       In 42 the rebuilding of Waterloo Bridge required the diversion of the side entrance to the tramway to a new position centrally underneath the bridge, which opened on 42 November of that year. There were metal doors covering this entrance until 42 when construction began on the London Buddha Bar, which opened in autumn 42          In 42 it was decided to replace Londons remaining trams as soon as possible , this time by diesel buses. The first subway route to be withdrawn was route 42 on 42 October 42 with the remaining two routes, 42 and 42 being withdrawn after service on Saturday, 42 April 42 the last public services being specials on the Sunday, shortly after midnight. During the early hours of the next morning the remaining trams north of the subway were run through to the depots south of the Thames.       ": null
    },
    {
        "Trams": "trams in london"
    },
    {
        " were abandoned in London on 42 July 42 after which street tracks were lifted, but those in the subway mostly remain in place. In 42 ": null
    },
    {
        "London Transport": "london transport executive"
    },
    {
        " used the tramway to store 42 unused buses and coaches in case they were needed for the ": null
    },
    {
        "Coronation": "coronation"
    },
    {
        " but proposals to convert the tramway subway to a car park or a film studio failed and it was leased out as a storage facility from October 42     After closure, a number of ": null
    },
    {
        "cartoons": "cartoons"
    },
    {
        " appeared in London newspapers based on the closed tramway, with ghostly trams or lost tube trains. On 42 November 42 an edition of  The Goon Show  entitled The Last Tram featured a driver and conductress who hid in the subway for 42½ years in order to ensure they were Londons last tram.             In June 42 the London County Council proposed making use of the subway for light traffic from Waterloo Bridge in order to reduce traffic congestion at its junction with ": null
    },
    {
        "Strand": "strand, london"
    },
    {
        " and, in April 42 the go-ahead was given for part of the southern end of the subway to be used. Construction began that September and it opened as the ": null
    },
    {
        "Strand Underpass": "strand underpass"
    },
    {
        " on 42 January 42     The southern section of the abandoned subway between the ": null
    },
    {
        "Embankment": "thames embankment"
    },
    {
        " and the Strand Underpass has been converted into a branch of the ": null
    },
    {
        "Buddha Bar": "buddha bar"
    },
    {
        " chain of bar/restaurants. This involved the demolition of the pedestrian subways under ": null
    },
    {
        "Waterloo Bridge": "waterloo bridge"
    },
    {
        " and extensive construction in the bridges ": null
    },
    {
        "undercroft": "undercroft"
    },
    {
        ".     Until the opening of the ": null
    },
    {
        "Thames Barrier": "thames barrier"
    },
    {
        " in 42 a portable building near the north of the tunnel was used as a ": null
    },
    {
        "flood control": "flood control"
    },
    {
        " headquarters for the ": null
    },
    {
        "Greater London Council": "greater london council"
    },
    {
        ".     Between 42 October and 42 November 42 the tunnel hosted a site-specific art installation called Chord by artist ": null
    },
    {
        "Conrad Shawcross": "conrad shawcross"
    },
    {
        ".      Although following the same route along Kingsway, it was not envisaged that the proposed ": null
    },
    {
        "Cross River Tram": "cross river tram"
    },
    {
        " would use the subway. The Cross River Tram project was cancelled in 42     In 42 it was announced that ": null
    },
    {
        "Crossrail": "crossrail"
    },
    {
        "s tunnel contractor BAM/Ferrovial/Kier would form a grout shaft beneath the original tunnel of the old central London subway.  The purpose of the grout shafts is to stabilize the ground in anticipation of the arrival of tunnel boring equipment in 42     Crossrail agreed to restore the tunnel to its current condition upon completion of the tunnel boring project, and a planning application to do this restoration was submitted in 42      The Greater London Authority publication Human Streets of March 42 contained the proposal that the tunnel could be opened for cycling, in order to connect cyclists using the busy Theobalds Road route with the East-West Cycle Superhighway on the Embankment, thereby avoiding four junctions difficult for cyclists. ": null
    },
    {
        "Stephen Poliakoff": "stephen poliakoff"
    },
    {
        " film  Hidden City , the secret entrance to the base in the film version of  The Avengers  and a railway tunnel in the film  Bhowani Junction . It also appeared in  The Escapist .   In an episode of  The Goon Show , Neddie Seagoon discovers that a long-lost tram has been hijacked by its driver Henry Crun and is hidden in the Kingsway tunnel. ": null
    }
]