[
    {
        "         Kings Plains  is a national park in ": null
    },
    {
        "New South Wales": "new south wales"
    },
    {
        ", ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", 42  km from ": null
    },
    {
        "Inverell": "inverell, new south wales"
    },
    {
        ", 42  km from ": null
    },
    {
        "Glen Innes": "glen innes, new south wales"
    },
    {
        " and 42  km north of ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        ".       Kings Plains was founded in January 42 and was made a national park to preserve and protect the array of wild animals, plants and the Kings Plains creek with its many water features and found in 42       Even though Kings Plains National Park is not widely known but people enjoy the vast array of water features joining the Kings Plains creek from non-drying pools to rapids to waterfalls which lead to a gorge. The land itself is mostly made up of sandy soils with shrub. Around the creek the soil is more fertile.       Some vegetation in the Kings Plains woodland includes iron-barks, cypress pine, yellow box, stringy-barks, ": null
    },
    {
        "eucalyptus": "eucalyptus"
    },
    {
        " trees, and ": null
    },
    {
        "apple box": "eucalyptus bridgesiana"
    },
    {
        ". Among the shrubs are rare species such as the grey guinea flower, folded leaf waxflower and Rodd’s star-hair. During spring the parks wildflowers are at their most colourful.       Amongst the large variety of wildlife are eastern grey ": null
    },
    {
        "kangaroos": "kangaroos"
    },
    {
        ", ": null
    },
    {
        "wallaroos": "wallaroos"
    },
    {
        ", ": null
    },
    {
        "wallabies": "wallaby"
    },
    {
        " and ": null
    },
    {
        "koalas": "koalas"
    },
    {
        " which live in the park near water and fertile soils. Also the rare brush-tail wallaby has been in the park. ": null
    },
    {
        "Platypus": "platypus"
    },
    {
        " can be seen along the creek, but some of their habitat above the falls is considered fragile. In the area, 42 bird species have been recorded, including eastern and crimson rosellas, king parrots, yellow-tailed black cockatoos, currawongs, wattle birds and many species of ": null
    },
    {
        "honeyeaters": "honeyeaters"
    },
    {
        ". There are also the endangered glossy black cockatoos, turquoise parrots and regent honeyeaters. In and around Kings Plains Creek the ": null
    },
    {
        "straw-necked ibis": "straw-necked ibis"
    },
    {
        " can be found and high above birds of prey such as the ": null
    },
    {
        "wedge-tailed eagle": "wedge-tailed eagle"
    },
    {
        " and the ": null
    },
    {
        "peregrine falcon": "peregrine falcon"
    }
]