[
    {
        "           King Ottokars Sceptre  is the eighth volume of  The Adventures of Tintin , the comics series by Belgian cartoonist ": null
    },
    {
        "Hergé": "hergé"
    },
    {
        ". Commissioned by the conservative Belgian newspaper  for its childrens supplement , it was serialised weekly from August 42 to August 42 Hergé intended the story as a satirical criticism of the expansionist policies of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ", in particular the ": null
    },
    {
        "annexation": "annexation"
    },
    {
        " of ": null
    },
    {
        "Austria": "federal state of austria"
    },
    {
        " in March 42 . The story tells of young Belgian reporter ": null
    },
    {
        "Tintin": "tintin"
    },
    {
        " and his dog ": null
    },
    {
        "Snowy": "snowy"
    },
    {
        ", who travel to the fictional Balkan nation of ": null
    },
    {
        "Syldavia": "syldavia"
    },
    {
        ", where they combat a plot to overthrow the monarchy of ": null
    },
    {
        "King Muskar XII": "king muskar xii"
    },
    {
        ".     King Ottokars Sceptre was a commercial success and was published in book form by ": null
    },
    {
        "Casterman": "casterman"
    },
    {
        " shortly after its conclusion. Hergé continued The Adventures of Tintin with  Land of Black Gold  until  forced closure in 42 while the series itself became a defining part of the ": null
    },
    {
        "Franco-Belgian comics tradition": "franco-belgian comics"
    },
    {
        ". In 42 Hergé coloured and redrew King Ottokars Sceptre in his distinctive  style with the aid of ": null
    },
    {
        "Edgar P. Jacobs": "edgar p. jacobs"
    },
    {
        " for ": null
    },
    {
        "Casterman": "casterman"
    },
    {
        "s republication. The story introduces the recurring character ": null
    },
    {
        "Bianca Castafiore": "bianca castafiore"
    },
    {
        ", and introduced the fictional countries of Syldavia and ": null
    },
    {
        "Borduria": "borduria"
    },
    {
        ", both of which reappear in later stories. The first volume of the series to be translated into English, King Ottokars Sceptre was adapted for both the 42 ": null
    },
    {
        "Belvision Studios": "belvision studios"
    },
    {
        " animation  Hergés Adventures of Tintin  and for the 42 ": null
    },
    {
        "Ellipse": "ellipse programmé"
    },
    {
        "/": null
    },
    {
        "Nelvana": "nelvana"
    },
    {
        " animated series  The Adventures of Tintin .         Having discovered a lost briefcase in a Belgian park, Tintin returns it to its owner, the ": null
    },
    {
        "sigillographer": "sigillography"
    },
    {
        " Professor ": null
    },
    {
        "Hector Alembick": "professor alembick"
    },
    {
        ", who informs the reporter of his plans to travel to the ": null
    },
    {
        "Balkan nation": "balkans"
    },
    {
        " of Syldavia. Tintin discovers agents spying on him and follows those responsible to a nearby Syldavian restaurant. An unknown man agrees to meet with Tintin but is found unconscious. Shortly after, the reporter receives a threatening note and is then the target of a bomb attack; Tintin survives the latter when police detectives ": null
    },
    {
        "Thomson and Thompson": "thomson and thompson"
    },
    {
        " intercept the bomb. Suspecting that these events are linked to Syldavia, Tintin decides to accompany Professor Alembick on his forthcoming visit to the country. On the plane journey there, Tintin notices Alembick acting out of character, and suspects that an imposter has replaced him. Reading a brochure on Syldavian history, Tintin theorises that the imposter is part of a plot to steal the ": null
    },
    {
        "sceptre": "sceptre"
    },
    {
        " of the Medieval King Ottokar IV from the current ": null
    },
    {
        "King Muskar XII": "king muskar xii"
    },
    {
        " before St. Vladimirs Day, thus forcing him to ": null
    },
    {
        "abdicate": "abdication"
    },
    {
        ".     Forcibly ejected from the plane by the pilot, Tintin survives and informs local police of his fears regarding the plot. However, the police captain is part of the conspiracy, and he organises an ambush in the woods where Tintin will be eliminated. Tintin evades death, and heads to the capital city of Klow in a car carrying the opera singer ": null
    },
    {
        "Bianca Castafiore": "bianca castafiore"
    },
    {
        ". Leaving the car to evade Castafiores singing, Tintin is arrested again and survives another assassination attempt before heading to Klow by foot. Arriving in the city, he meets the Kings  aide-de-camp , ": null
    },
    {
        "Colonel Boris": "colonel jorgen"
    },
    {
        ", and warns him of the plot. However, Boris is also a conspirator and organises a further unsuccessful assassination attempt aimed at Tintin.     Tintin succeeds in personally warning the King about the plot. Concerned, Tintin and Muskar rush to Kropow Castle, where the sceptre is kept, to find that the imposter pretending to be Alembick has succeeded in smuggling it out of the building to his accomplices. With the aid of Thomson and Thompson, who have recently arrived in Syldavia, Tintin pursues the thieves, first by car and then by foot. He is able to prevent the sceptre being carried over the border into neighbouring Borduria, discovering a letter on one of the conspirators. It reveals that the plot has been orchestrated by ": null
    },
    {
        "Müsstler": "müsstler"
    },
    {
        ", a political agitator who runs the Syldavian Iron Guard, or Zyldav Zentral Revolutzionär Komitzät , and who intends to stir up unrest in Syldavia, thereby allowing Borduria to invade and annex the country. Entering Borduria, Tintin commandeers a fighter plane and heads to Klow, but the Syldavian military shoot him down. Parachuting, he continues to Klow by foot, returning the sceptre to the King on St. Vladimirs Day and securing the monarchy. In thanks, the king makes Tintin a Knight of the Order of the Golden Pelican; the first foreigner to receive the honour. Tintin reveals that the imposter was Alembicks twin brother while police arrest Müsstler and rescue Professor Alembick.              King Ottokars Sceptre was not the first Tintin adventure to draw specifically on contemporary events; ": null
    },
    {
        "Hergé": "hergé"
    },
    {
        " had for instance previously made use of the 42 ": null
    },
    {
        "Japanese invasion of Manchuria": "japanese invasion of manchuria"
    },
    {
        " as a political backdrop for the setting in  The Blue Lotus . Hergé had closely observed the unfolding events surrounding the expansionist policies of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ". In producing this story, he was particularly influenced by the  Anschluss , the annexation of ": null
    },
    {
        "Austria": "federal state of austria"
    },
    {
        " by Nazi Germany in March 42 The ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        " and the subsequent ": null
    },
    {
        "Nazi invasion of the Sudetenland": "german occupation of czechoslovakia"
    },
    {
        " followed in October 42 Three weeks after King Ottokars Sceptre finished serialisation, Germany invaded Poland. By this point, the threat to Belgian sovereignty posed by Nazi expansionism was becoming increasingly clear. By 42 the events surrounding the ": null
    },
    {
        "Italian annexation of Albania": "italian invasion of albania"
    },
    {
        " made Hergé insist his editor publish the work to take advantage of current events as he felt Syldavia is Albania . Later Hergé denied that he had just one country in mind.     Hergé claimed that the basic idea behind the story had been given to him by a friend; biographer ": null
    },
    {
        "Benoît Peeters": "benoît peeters"
    },
    {
        " suggested that the most likely candidate was school and ": null
    },
    {
        "scouting": "scouting"
    },
    {
        " friend Philippe Gérard, who had warned of a second war with Germany for years. Tintin scholars have claimed Hergé did not develop the names Syldavia and Borduria himself; instead, the country names had supposedly appeared in a paper included in a 42 edition of the  British Journal of Psychology , in which the author described a hypothetical conflict between a small kingdom and an annexing power. Reportedly, the paper, by ": null
    },
    {
        "Lewis Fry Richardson": "lewis fry richardson"
    },
    {
        " and entitled General Foreign Policy , explored the nature of inter-state conflict in a ": null
    },
    {
        "mathematical": "mathematics"
    },
    {
        " way. Peeters attributed these claims to Georges Laurenceau, but said that no researcher has confirmed this source . Instead, a paper by Richardson entitled Generalized Foreign Politics: A Story in Group Psychology was published in The British Journal of Psychology Monograph Supplements in 42 but did not mention Syldavia or Borduria. In any case, given the publication date, it is unlikely that it was an influence on King Ottokars Sceptre.          Hergé designed Borduria as a satirical depiction of Nazi Germany.   Hergé named the pro-Bordurian agitator Müsstler from the surnames of ": null
    },
    {
        "Nazi": "nazi party"
    },
    {
        " leader ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " and Italys ": null
    },
    {
        "National Fascist": "national fascist party"
    },
    {
        " leader ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        ". The name also had similarities with the ": null
    },
    {
        "British Union of Fascists": "british union of fascists"
    },
    {
        " leader ": null
    },
    {
        "Oswald Mosley": "oswald mosley"
    },
    {
        " and the ": null
    },
    {
        "National Socialist Movement in the Netherlands": "national socialist movement in the netherlands"
    },
    {
        " leader ": null
    },
    {
        "Anton Mussert": "anton mussert"
    },
    {
        ". Müsstlers group was named after the ": null
    },
    {
        "Iron Guard": "iron guard"
    },
    {
        ", a Romanian fascist group that sought to oust ": null
    },
    {
        "King Carol II": "carol ii of romania"
    },
    {
        " and forge a Romanian-German alliance. The Bordurian officers wore uniforms based on those of the German ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        ", while the Bordurian planes are German in design; in the original version Tintin escapes in a ": null
    },
    {
        "Heinkel He 42": "heinkel he 112"
    },
    {
        ", while in the revised version this is replaced by a ": null
    },
    {
        "Messerschmitt Bf 42": "messerschmitt bf 109"
    },
    {
        ". Hergé adopted the basis of Bordurias false flag operation to take over Syldavia from the plans outlined in ": null
    },
    {
        "Curzio Malaparte": "curzio malaparte"
    },
    {
        "s Tecnica del Colpo di Stato .      Syldavias depiction was influenced by the costumes and cultures of ": null
    },
    {
        "Romania": "romania"
    },
    {
        " and the neighboring Balkan region. The mosques that appear in Hergés Syldavia are based on those found throughout the Balkans, while the appearance of the Syldavian village, featuring red-tiled roofs and ": null
    },
    {
        "minarets": "minarets"
    },
    {
        ", may have been specifically inspired by the ": null
    },
    {
        "Bosnia": "bosnia"
    },
    {
        "n town of ": null
    },
    {
        "Mostar": "mostar"
    },
    {
        ". Syldavias mineral rich ": null
    },
    {
        "subsoil": "subsoil"
    },
    {
        " could be taken as a reference to the ": null
    },
    {
        "uranium deposits": "uranium deposits"
    },
    {
        " found under Romanias ": null
    },
    {
        "Carpathian Mountains": "carpathian mountains"
    },
    {
        ". Tintin scholars have noted that the black ": null
    },
    {
        "pelican": "pelican"
    },
    {
        " of Syldavias flag resembles the black eagle of ": null
    },
    {
        "Albanias flag": "flag of albania"
    },
    {
        ", and that Romania is the only European country to which pelicans are native.     The name Syldavia may be a composite of ": null
    },
    {
        "Transylvania": "transylvania"
    },
    {
        " and ": null
    },
    {
        "Moldavia": "moldavia"
    },
    {
        ", two regions with historical ties to Romania. Czech, Slovak, and Bohemian history influenced the Syldavian names, while several ": null
    },
    {
        "medieval Bohemian kings": "list of rulers of bohemia"
    },
    {
        " were the inspiration for the name Ottokar . The ": null
    },
    {
        "Polish language": "polish language"
    },
    {
        " influenced Hergés inclusion of -ow endings to the names of Syldavian places, while Polish history parallels Hergés description of Syldavian history.   The ": null
    },
    {
        "Syldavian language": "syldavian"
    },
    {
        " used in the book had French syntax but with ": null
    },
    {
        "Marollien": "marols"
    },
    {
        " vocabulary, a joke understood by the original Brussels-based readership.     However, despite its Eastern European location, Syldavia itself was partly a metaphor for Belgium - Syldavian King Muskar XII physically resembles King ": null
    },
    {
        "Leopold III of Belgium": "leopold iii of belgium"
    },
    {
        ". Hergés decision to create a fictional Eastern European kingdom might have been influenced by ": null
    },
    {
        "Ruritania": "ruritania"
    },
    {
        ", the fictional country created by ": null
    },
    {
        "Anthony Hope": "anthony hope"
    },
    {
        " for his novel  The Prisoner of Zenda  , which subsequently appeared in film adaptations in ": null
    },
    {
        "42": "the prisoner of zenda"
    },
    {
        ", ": null
    },
    {
        "42": "the prisoner of zenda"
    },
    {
        ", ": null
    },
    {
        "42": "the prisoner of zenda"
    },
    {
        ", and ": null
    },
    {
        "42": "the prisoner of zenda"
    },
    {
        ". Many places within Syldavia are visually based on pre-existing European sites: the  Diplodocus  in the Klow Natural History Museum is based on the one in the ": null
    },
    {
        "Museum für Naturkunde": "museum für naturkunde"
    },
    {
        ", ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        "; the Syldavian Royal Palace is based on both the ": null
    },
    {
        "Charlottenburg Palace": "charlottenburg palace"
    },
    {
        ", Berlin and the ": null
    },
    {
        "Royal Palace of Brussels": "royal palace of brussels"
    },
    {
        "; and Kropow Castle is based on ": null
    },
    {
        "Olavinlinna Castle": "olavinlinna castle"
    },
    {
        ", constructed in fifteenth century ": null
    },
    {
        "Savonia": "savonia"
    },
    {
        " - a historical province of the ": null
    },
    {
        "Swedish Kingdom": "sweden"
    },
    {
        ", located in modern-day Finland. For the revised version, Kropow Castle was drawn with an additional tower, inspired by ": null
    },
    {
        "Vyborg Castle": "vyborg castle"
    },
    {
        ", Russia. The United Kingdom also bore at least one influence on Syldavia, as King Muskar XIIs carriage is based on the ": null
    },
    {
        "British Royal Family": "british royal family"
    },
    {
        "s ": null
    },
    {
        "Gold State Coach": "gold state coach"
    },
    {
        ".       King Ottokars Sceptre was first serialised in Le Petit Vingtième from 42 August 42 to 42 August 42 under the title Tintin En Syldavie . It would prove to be the last Tintin adventure to be published in its entirety in Le Petit Vingtième. From 42 May 42 the story was also serialised in the French Catholic newspaper,  Cœurs Vaillants .   In 42 ": null
    },
    {
        "Éditions Casterman": "casterman"
    },
    {
        " collected the story together in a single hardcover volume; Hergé insisted to his contact at Casterman, Charles Lesne, that they hurry up the process due to the changing political situation in Europe. The Nazi–Soviet ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        " was signed the day Hergé delivered the books remaining drawings; finishing touches included the books original front cover, the royal coat of arms for the title page, and the tapestry depicting the Syldavians 42 victory over the Turks in The Battle of Zileheroum on page 42 Hergé suggested that for this publication, the storys title be changed to The Scepter of Ottokar IV; Casterman changed this to King Ottokars Sceptre.     King Ottokars Sceptre introduced the recurring character of Bianca Castafiore to the series, who appears alongside her pianist ": null
    },
    {
        "Igor Wagner": "igor wagner"
    },
    {
        ". It also witnessed the introduction of antagonist Colonel Jorgen, who reappears in the later Tintin adventures  Destination Moon  and its sequel  Explorers on the Moon . The Alembick brothers inclusion echoes the Balthazar brothers inclusion in  The Broken Ear .     After the conclusion of King Ottokars Sceptre, Hergé continued The Adventures of Tintin with  Land of Black Gold  until ": null
    },
    {
        "Germany placed Belgium under occupation": "german occupation of belgium during world war ii"
    },
    {
        " in 42 and forced the closure of . The adventure Land of Black Gold had to be abandoned.       The story was redrawn and colourised in 42 For this edition, Hergé was assisted by ": null
    },
    {
        "Edgar P. Jacobs": "edgar p. jacobs"
    },
    {
        ", an artist who worked as part of ": null
    },
    {
        "Studios Hergé": "studios hergé"
    },
    {
        ". Jacobs oversaw changes to the costumes and background of the story; in the 42 version, the Syldavian Royal Guards are dressed like British ": null
    },
    {
        "Beefeaters": "beefeaters"
    },
    {
        ", while the 42 version has them dressed in a Balkanised uniform similar to the ": null
    },
    {
        "National Guards Unit of Bulgaria": "national guards unit of bulgaria"
    },
    {
        ". Jacobs also inserted a cameo of himself and his wife in the Syldavian royal court, while in that same scene is a cameo of Hergé, his then-wife Germaine, his brother Paul, and three of his friends - Édouard Cnaepelinckx, ": null
    },
    {
        "Jacques Van Melkebeke": "jacques van melkebeke"
    },
    {
        ", and Marcel Stobbaerts. Hergé and Jacobs also inserted further cameos of themselves at the bottom of page 42 where they appear as uniformed officers. While the character of Professor Alembick had been given the forename of Nestor in the original version, this was changed to Hector for the second; this had been done so as to avoid confusion with the character of ": null
    },
    {
        "Nestor": "nestor"
    },
    {
        ", the butler of ": null
    },
    {
        "Marlinspike Hall": "marlinspike hall"
    },
    {
        ", whom Hergé had introduced in  The Secret of the Unicorn .   Editions Casterman published this second version in book form in 42       King Ottokars Sceptre became the first Tintin adventure to be published for a British audience when  Eagle  serialised the comic in 42 Here, the names of Tintin and Milou were retained, although the characters of Dupond and Dupont were renamed Thomson and Thompson; the latter two names would be adopted by translators Leslie Lonsdale-Cooper and Michael Turner when they translated the series into English for ": null
    },
    {
        "Methuen Publishing": "methuen publishing"
    },
    {
        " in 42     Casterman republished the original black-and-white version of the story in 42 as part of the fourth volume in their  collection. In 42 they then published a facsimile version of that first edition.          ": null
    },
    {
        "Harry Thompson": "harry thompson"
    },
    {
        " described King Ottokars Sceptre as a biting political satire and asserted that it was courageous of Hergé to have written it given that the threat of Nazi invasion was imminent. Describing it as a classic ": null
    },
    {
        "locked room mystery": "locked room mystery"
    },
    {
        " , he praised its tightly constructed plot . Ultimately, he deemed it one of the best three Tintin adventures written before World War II, alongside The Blue Lotus and The Black Island. He also thought it noteworthy that in 42 archaeologists discovered a sceptre belonging to a 42th-century King Ottokar in ": null
    },
    {
        "St. Vitus Cathedral": "st. vitus cathedral"
    },
    {
        ", ": null
    },
    {
        "Prague": "prague"
    },
    {
        ". Hergé biographer ": null
    },
    {
        "Pierre Assouline": "pierre assouline"
    },
    {
        " believed that the story had the atmosphere of ": null
    },
    {
        "Franz Lehár": "franz lehár"
    },
    {
        "s  The Merry Widow , with added touches from the films of ": null
    },
    {
        "Erich von Stroheim": "erich von stroheim"
    },
    {
        " and ": null
    },
    {
        "Ernst Lubitsch": "ernst lubitsch"
    },
    {
        ". Fellow biographer Benoît Peeters thought that it exhibited a political maturity and originality . Further, he felt that Hergé was able to break free from the narrative limits  ... too much realism by the use of Syldavia as a setting.     ": null
    },
    {
        "Jean-Marc Lofficier": "jean-marc lofficier"
    },
    {
        " and Randy Lofficier called King Ottokars Sceptre a Hitchcockian thriller which recaptures the paranoid ambience of  Cigars of the Pharaoh . They compared the pace of the latter part of the story to that of ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        "s  Indiana Jones  films before noting that despite the horrors of the real world that are present with Bordurias inclusion, they do not interfere in the pure escapist nature of the adventure . Ultimately they awarded it three stars out of five.     ": null
    },
    {
        "Michael Farr": "michael farr"
    },
    {
        " opined that the adventure has a convincingly authentic feel due to the satirical portrayal to Nazi Germany, but that this was coupled with sufficient scope for invention with the creation of Syldavia. He compared it to Hitchcocks  The Lady Vanishes . Farr preferred the colour version assembled with E.P. Jacobs aid, however. Deeming it particularly successful , he thought that it was one of the most polished and accomplished adventures in the series, with a perfectly paced and balanced narrative that mixed drama and comedy successfully.     Literary critic ": null
    },
    {
        "Jean-Marie Apostolidès": "jean-marie apostolidès"
    },
    {
        " of ": null
    },
    {
        "Stanford University": "stanford university"
    },
    {
        " asserted that the inclusion of the Iron Guard evoked Colonel ": null
    },
    {
        "François de La Rocque": "françois de la rocque"
    },
    {
        "s ": null
    },
    {
        "Croix-de-Feu": "croix-de-feu"
    },
    {
        ". Noting that the figure of Müsstler was the Evil One without a face , he expressed disbelief regarding Hergés depiction of Syldavia, as there were no apparent economic problems or reasons why Müsstlers anti-monarchist conspiracy was so strong; thus, mass revolution remains schematic .     Literary critic ": null
    },
    {
        "Tom McCarthy": "tom mccarthy"
    },
    {
        " identified several instances in the story that he argued linked to wider themes within the Adventures of Tintin. He identified a recurring host-and-guest theme in Alembicks visit to Syldavia, and believed that the theme of thieving was present in the story as Alembicks identity is stolen. Another theme identified within the series by McCarthy was that of the blurring between the sacred and the political; he saw echoes of this in King Ottokars Sceptre as the King has to wait three days before appearing to the Syldavian public on St. Vladimirs Day, something that McCarthy thought linked to ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        " and the Resurrection. McCarthy also opined that a number of characters in the book visually resembled ": null
    },
    {
        "Captain Haddock": "captain haddock"
    },
    {
        ", a character who would be introduced in the subsequent Tintin adventure, The Crab with the Golden Claws.       King Ottokars Sceptre was the first of The Adventures of Tintin to be adapted for the animated series  Hergés Adventures of Tintin . The series was created by Belgiums ": null
    },
    {
        "Belvision Studios": "belvision studios"
    },
    {
        " in 42 directed by Ray Goossens and written by ": null
    },
    {
        "Greg": "greg"
    },
    {
        ". The studio divided King Ottokars Sceptre into six 42-minute black-and-white episodes that diverted from Hergés original plot in many ways. It was also adapted into a 42 episode of  The Adventures of Tintin  television series by French studio ": null
    },
    {
        "Ellipse": "ellipse"
    },
    {
        " and Canadian animation company ": null
    },
    {
        "Nelvana": "nelvana"
    },
    {
        ". The episode was directed by Stéphane Bernasconi, and Thierry Wermuth voiced the character of Tintin.     Tintin fans adopted the Syldavian language that appears in the story and used it to construct grammars and dictionaries, akin to the fan following of  Star Trek s ": null
    },
    {
        "Klingon": "klingon language"
    },
    {
        " and ": null
    },
    {
        "J.R.R. Tolkien": "j.r.r. tolkien"
    },
    {
        "s ": null
    },
    {
        "Elvish": "elvish languages"
    },
    {
        ".": null
    }
]