[
    {
        "           Christopher Houston Carson , better known as Kit Carson, was an American ": null
    },
    {
        "frontiersman": "frontiersman"
    },
    {
        ". He was a ": null
    },
    {
        "mountain man": "mountain man"
    },
    {
        " , wilderness guide, ": null
    },
    {
        "Indian agent": "indian agent"
    },
    {
        ", and ": null
    },
    {
        "U.S. Army": "united states army"
    },
    {
        " officer. Carson became a frontier legend in his own lifetime via biographies and news articles. Often exaggerated versions of his exploits were the subject of ": null
    },
    {
        "dime novel": "dime novel"
    },
    {
        "s. His understated nature belied confirmed reports of his fearlessness, combat skills, tenacity, and profound effect on the westward expansion of the United States.     Carson left home in rural present-day ": null
    },
    {
        "Missouri": "missouri"
    },
    {
        " at age 16 to become a mountain man and ": null
    },
    {
        "trapper": "animal trapping"
    },
    {
        " in the West. In the 1830s, he accompanied ": null
    },
    {
        "Ewing Young": "ewing young"
    },
    {
        " on an expedition to ": null
    },
    {
        "Mexican California": "alta california"
    },
    {
        " and joined fur-trapping expeditions into the ": null
    },
    {
        "Rocky Mountains": "rocky mountains"
    },
    {
        ". He lived among and married into the ": null
    },
    {
        "Arapaho": "arapaho"
    },
    {
        " and ": null
    },
    {
        "Cheyenne": "cheyenne"
    },
    {
        " tribes.     In the 1840s, Carson was hired as a guide by ": null
    },
    {
        "John C. Frémont": "john c. frémont"
    },
    {
        ". Frémonts expeditions covered much of ": null
    },
    {
        "California": "california"
    },
    {
        ", ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        ", and the ": null
    },
    {
        "Great Basin": "great basin"
    },
    {
        " area. Frémont mapped and wrote reports and commentaries on the ": null
    },
    {
        "Oregon Trail": "oregon trail"
    },
    {
        " to assist and encourage westward-bound ": null
    },
    {
        "American pioneers": "american pioneers"
    },
    {
        ". Carson achieved national fame through Frémonts accounts of his expeditions. Under Frémonts command, Carson participated in the ": null
    },
    {
        "conquest of Mexican California": "conquest of california"
    },
    {
        " at the beginning of the ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        ". Later in the war, Carson was a scout and courier, celebrated for his rescue mission after the ": null
    },
    {
        "Battle of San Pasqual": "battle of san pasqual"
    },
    {
        " and for his coast-to-coast journey from California to ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        " to deliver news of the conflict in California to the U.S. government. In the 1850s, he was appointed as the ": null
    },
    {
        "Indian agent": "indian agent"
    },
    {
        " to the ": null
    },
    {
        "Ute Indians": "ute indians"
    },
    {
        " and the ": null
    },
    {
        "Jicarilla": "jicarilla"
    },
    {
        " Apaches.     During the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ", Carson led a regiment of mostly Hispanic volunteers from ": null
    },
    {
        "New Mexico": "new mexico"
    },
    {
        " on the side of the ": null
    },
    {
        "Union": "union"
    },
    {
        " at the ": null
    },
    {
        "Battle of Valverde": "battle of valverde"
    },
    {
        " in 1862. When the Confederate threat to New Mexico was eliminated, Carson led forces to suppress the ": null
    },
    {
        "Navajo": "navajo people"
    },
    {
        ", ": null
    },
    {
        "Mescalero": "mescalero"
    },
    {
        " Apache, and the ": null
    },
    {
        "Kiowa": "kiowa"
    },
    {
        " and ": null
    },
    {
        "Comanche": "comanche"
    },
    {
        " peoples by destroying their food sources.     Carson was ": null
    },
    {
        "brevetted": "brevet"
    },
    {
        " a ": null
    },
    {
        "Brigadier General": "brigadier general"
    },
    {
        " and took command of ": null
    },
    {
        "Fort Garland, Colorado": "fort garland, colorado"
    },
    {
        ". He was there only briefly: poor health forced him to retire from military life. Carson was married three times and had ten children. The Carson home was in ": null
    },
    {
        "Taos, New Mexico": "taos, new mexico"
    },
    {
        ". Carson died at ": null
    },
    {
        "Fort Lyon, Colorado": "fort lyon, colorado"
    },
    {
        ", of an ": null
    },
    {
        "aortic aneurysm": "aortic aneurysm"
    },
    {
        " on May 23, 1868. He is buried in ": null
    },
    {
        "Taos, New Mexico": "taos, new mexico"
    },
    {
        ", next to his third wife, Josefa.              Christopher Houston Carson was born on ": null
    },
    {
        "Christmas Eve": "christmas eve"
    },
    {
        ", 1809 at the Home of Thomas Young in Madison County, Kentucky. His parents were Lindsay Carson and his second wife, Rebecca Robinson. Lindsay had had five children by his first wife Lucy Bradley, and ten more children by Rebecca. The Christmas Eve occasion of Christopher Kit Houston Carson birth was an interesting experience. Thomas Young and his family had a family tradition to celebrate Christmas by annually having a party at their fashionable home in Houstonville. In addition to their own family, the Youngs would always invite friends and close neighbors. It was to this occasion that Lindsay and Rebecca Carson were invited.   Lindsays wife, Rebecca was expecting the imminent birth of their 6th child. Early in the evening, the hostess, Mrs. Young noticed that Rebecca Carson seemed to be in some distress and knowing of her expectant child, Mrs. Young took Rebecca to a room in another building where she could be in a more comforting environment and attended by a helpful attendant, a woman who was an African-American slave. It was not long until the sound of a new pair of strong lungs sounded out the alarm, a new child had been born to Lindsay and Rebecca Carson. The new mother and father decided quickly their son should be named Christopher Houston Carson, and because of his small size, to give him the nick-name, Kit .   Lindsay Carson had a Scots-Irish ": null
    },
    {
        "Presbyterian": "presbyterianism"
    },
    {
        " background. Sides 8–9 He was a farmer, a cabin builder, and a ": null
    },
    {
        "veteran": "veteran"
    },
    {
        " of the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        " and the ": null
    },
    {
        "War of 1812": "war of 1812"
    },
    {
        ". Roberts 54–55 He fought Indians on the American frontier, losing two fingers on his left hand in a battle with the Fox and Sauk Indians.     The Carson family moved to Boones Lick, ": null
    },
    {
        "Howard County, Missouri": "howard county, missouri"
    },
    {
        ", when Kit was about one year old. The family settled on a tract of land owned by the sons of ": null
    },
    {
        "Daniel Boone": "daniel boone"
    },
    {
        ", who had purchased the land from the Spanish. The Boone and Carson families became good friends, working and socializing together, and intermarrying. Lindsays oldest son William married Boones grand-niece, Millie Boone, in 1810. Their daughter Adaline became Kits favorite playmate. Guild and Carter 9     Missouri was then the frontier of American expansionism west; cabins were forted with tall stockade fences to defend against Indian attacks. As men worked in the fields, sentries were posted with weapons, to protect the farmers. These men were ready to kill any Indian who attacked. ": null
    }
]