[
    {
        "         The Klamath people are a ": null
    },
    {
        "Native American": "native americans in the united states"
    },
    {
        " tribe of the Plateau culture area in ": null
    },
    {
        "Southern Oregon": "southern oregon"
    },
    {
        " and ": null
    },
    {
        "Northern California": "northern california"
    },
    {
        ". Today Klamath people are enrolled in the ": null
    },
    {
        "federally recognized tribes": "federally recognized tribes"
    },
    {
        ":     ": null
    },
    {
        "Klamath Tribes": "klamath tribes"
    },
    {
        " , Oregon   ": null
    },
    {
        "Quartz Valley Indian Community": "quartz valley indian community"
    },
    {
        " , California.         The Klamath people lived in the area around the ": null
    },
    {
        "Upper Klamath Lake": "upper klamath lake"
    },
    {
        " and the ": null
    },
    {
        "Klamath": "klamath river"
    },
    {
        ", ": null
    },
    {
        "Williamson": "williamson river"
    },
    {
        ", and ": null
    },
    {
        "Sprague": "sprague river"
    },
    {
        " rivers. They subsisted primarily on fish and gathered roots and seeds. While there was knowledge of their immediate neighbors, apparently the Klamath were unaware of the existence of the ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        ". Gatschet has described this position as leaving the Klamath living in a protracted isolation from outside cultures.     The Klamath were known to raid neighboring tribes, such as the ": null
    },
    {
        "Achomawi": "achomawi"
    },
    {
        " on the ": null
    },
    {
        "Pit River": "pit river"
    },
    {
        ", and occasionally to take prisoners as slaves. They traded with the ": null
    },
    {
        "Wasco-Wishram": "wasco-wishram"
    },
    {
        " at ": null
    },
    {
        "The Dalles": "the dalles, oregon"
    },
    {
        ". However, scholars such as ": null
    },
    {
        "Alfred L. Kroeber": "alfred l. kroeber"
    },
    {
        " and ": null
    },
    {
        "Leslie Spier": "leslie spier"
    },
    {
        " consider these slaving raids by the Klamath to begin only with the acquisition of the horse.     These natives made southern ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        " their home for long enough to witness the eruption of ": null
    },
    {
        "Mount Mazama": "mount mazama"
    },
    {
        ". It was a legendary volcanic mountain who is the creator of ": null
    },
    {
        "Crater Lake": "crater lake"
    },
    {
        ", now considered to be a beautiful natural formation.       In 42 ": null
    },
    {
        "Peter Skene Ogden": "peter skene ogden"
    },
    {
        ", an explorer for the ": null
    },
    {
        "Hudsons Bay Company": "hudsons bay company"
    },
    {
        ", first encountered the Klamath people, and he was trading with them by 42 The United States ": null
    },
    {
        "frontiersman": "frontiersman"
    },
    {
        " Kit Carson": "kit carson"
    },
    {
        " admired their arrows, which were reported to be able to shoot through a house.       The Klamaths, ": null
    },
    {
        "Modocs": "modoc people"
    },
    {
        ", and the Yahooskin Band of ": null
    },
    {
        "Northern Paiute": "northern paiute"
    },
    {
        " , which was erroneously called Upper Sprague River Snakes believed to be a Band of  Snake Indians , the collective name given to the Northern Paiute, Bannock, and Shoshone Native American tribes, signed a treaty with the ": null
    },
    {
        "United States": "united states"
    },
    {
        " in 42 establishing the ": null
    },
    {
        "Klamath Reservation": "klamath reservation"
    },
    {
        " to the northeast of Upper Klamath Lake. This area was largely part of the traditional territory controlled by the ă′ukuckni Klamath band. The treaty required the tribes to cede the land in the ": null
    },
    {
        "Klamath Basin": "klamath basin"
    },
    {
        ", bounded on the north by the ": null
    },
    {
        "42th parallel": "44th parallel north"
    },
    {
        ", to the United States. In return, the United States was to make a lump sum payment of $42, and annual payments totalling $42 over 42 years, as well as providing infrastructure and staff for the reservation. The treaty provided that, if the Indians drank or stored intoxicating liquor on the reservation, the payments could be withheld; the United States could also locate additional tribes on the reservation in the future. The tribes requested ": null
    },
    {
        "Lindsay Applegate": "lindsay applegate"
    },
    {
        " as the agent to represent the United States to them. The Indian agent estimated the total population of the three tribes at about 42 when the treaty was signed.            Since termination of recognition of their tribal sovereignty in 42 , the Klamath and neighboring tribes have reorganized their government and revived tribal identity. The Klamath, along with the Modoc and Yahooskin, have formed the federally recognized ": null
    },
    {
        "Klamath Tribes": "klamath tribes"
    },
    {
        " confederation. Their tribal government is based in ": null
    },
    {
        "Chiloquin, Oregon": "chiloquin, oregon"
    },
    {
        ".     Some Klamath live on the ": null
    },
    {
        "Quartz Valley Indian Community": "quartz valley indian community"
    },
    {
        " in ": null
    },
    {
        "Siskiyou County, California": "siskiyou county, california"
    },
    {
        ".           Traditionally there were several cultural subdivisions among the Klamath, based on the location of their residency within the Klamath Basin. Despite this, the five recognized tribelets mutually considered each other the same ethnic group, about 42 people in total. Like many Indigenous cultures of the Pacific Northwest, the Klamath lived a semi-sedentary life. Winter settlements were in permanent locations that were reoccupied annually. Construction of the earth-lodges would begin in Autumn, with materials salvaged from abandoned, dilapidated buildings made in previous years. ": null
    },
    {
        "Leslie Spier": "leslie spier"
    },
    {
        " has detailed some of the winter settlement patterns for Klamath as follows:     The towns are not isolated, compact groups of houses, but stretch along the banks for half a mile or more. In fact, the settlements on ": null
    },
    {
        "Williamson river": "williamson river"
    },
    {
        " below the ": null
    },
    {
        "Sprague river": "sprague river"
    },
    {
        " junction form a practically continuous string of houses for five or six miles, the house pits being, in many spots, crowded close together. Informants insisted that many of these were occupied at the same time. When we consider that these earth-lodges may have housed several families, there is strong suggestion of a considerable population.       Marriage was a unique practice for the Klamath, compared to neighboring cultures found in the borderlands of modern ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ", ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        " and ": null
    },
    {
        "Idaho": "idaho"
    },
    {
        ". For example, unlike the ": null
    },
    {
        "Hupa": "hupa"
    },
    {
        ", ": null
    },
    {
        "Karok": "karok"
    },
    {
        ", and ": null
    },
    {
        "Yurok": "yurok"
    },
    {
        ", the Klamath didnt hold formal talks between families for a bride price. Especially notable was the cultural norm that allowed wives to leave husbands, as they were in no sense chattel ... and certainly cannot be disposed of as a possession.        The Klamath use ": null
    },
    {
        "Apocynum cannabinum": "apocynum cannabinum"
    },
    {
        " as a fiber and eat the roots of ": null
    },
    {
        "Lomatium canbyi": "lomatium canbyi"
    },
    {
        ". They use the rootstocks of ": null
    },
    {
        "Sagittaria cuneata": "sagittaria cuneata"
    },
    {
        " as food. Coville, Frederick V., 42 Notes On The Plants Used By The Klamath Indians Of Oregon., Contributions from the U.S. National Herbarium 42:4242 page 42            ": null
    },
    {
        "Dentalium shell": "dentalium shell"
    },
    {
        "s were common among the Klamath prior to colonization. Compared to other native cultures dentalium didnt hold as much financial use among the Klamath. However, longer shells were generally held to be more valuable. Nonetheless these shells were esteemed primarily for as jewelry and personal adornment. Septum piercings were commonly given to younger members of Klamath families to allow inserting dentalium. Some individuals wouldnt however use any shells in their septum. Spier gives the following account for their usage:     The septum of the nose is pierced and the ear lobes, the latter twice or even more frequently. Both sexes insert dentalium shells horizontally through the septum ... Ear pendants are a group of four dentalia hung in a bunch by their tips.     The use of dentalium in septum piercings, in addition to other means of ornamentation, was common among the ": null
    },
    {
        "Wasco-Wishram": "wasco-wishram"
    },
    {
        " as well.       The Klamath people are grouped with the ": null
    },
    {
        "Plateau Indians": "plateau indians"
    },
    {
        " & mdash;the peoples who originally lived on the ": null
    },
    {
        "Columbia River Plateau": "columbia river plateau"
    },
    {
        ". They were most closely linked with the Modoc people.            The Klamath spoke one dialect of the ": null
    },
    {
        "Klamath–Modoc language": "klamath language"
    },
    {
        " - the northern or fi-ukshikni dialect, the other - the southern dialect being spoken by the ": null
    },
    {
        "Modoc people": "modoc people"
    },
    {
        ", who lived south of the Klamath. Once thought to be a language isolate, Klamath–Modoc is now considered a member of the ": null
    },
    {
        "Plateau Penutian": "plateau penutian"
    },
    {
        " language family.     Both the Klamath and the Modoc called themselves maqlaqs, maqlags or Maklaks meaning people . When they wanted to distinguish between themselves they added knii , the Klamath were called ?ewksiknii, people of the Lake , and the Modoc were called moowatdalknii, people of the south .       ": null
    },
    {
        "Natalie Ball": "natalie ball"
    }
]