[
    {
        "        Klaus Emil Julius Fuchs was a German ": null
    },
    {
        "theoretical physicist": "theoretical physics"
    },
    {
        " and ": null
    },
    {
        "atomic spy": "atomic spies"
    },
    {
        " who supplied information from the American, British, and Canadian ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        " to the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " during and shortly after ": null
    },
    {
        "World War II": "second world war"
    },
    {
        ". While at the ": null
    },
    {
        "Los Alamos National Laboratory": "los alamos national laboratory"
    },
    {
        ", Fuchs was responsible for many significant theoretical calculations relating to the first ": null
    },
    {
        "nuclear weapons": "nuclear weapons"
    },
    {
        " and, later, early models of the ": null
    },
    {
        "hydrogen bomb": "hydrogen bomb"
    },
    {
        ". After his conviction in 1950, he served nine years in prison in the United Kingdom and then moved to ": null
    },
    {
        "East Germany": "east germany"
    },
    {
        " where he resumed his career as a physicist and scientific leader.     The son of a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " pastor, Fuchs attended the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        ", where his father was a professor of ": null
    },
    {
        "theology": "theology"
    },
    {
        ", and became involved in student politics, joining the student branch of the ": null
    },
    {
        "Social Democratic Party of Germany": "social democratic party of germany"
    },
    {
        " , and the  Reichsbanner Schwarz-Rot-Gold , the SPDs ": null
    },
    {
        "paramilitary": "paramilitary"
    },
    {
        " organisation. He was expelled from the SPD in 1932, and joined the ": null
    },
    {
        "Communist Party of Germany": "communist party of germany"
    },
    {
        " . He went into hiding after the 1933 ": null
    },
    {
        "Reichstag fire": "reichstag fire"
    },
    {
        ", and fled to the United Kingdom, where he received his ": null
    },
    {
        "PhD": "phd"
    },
    {
        " from the ": null
    },
    {
        "University of Bristol": "university of bristol"
    },
    {
        " under the supervision of ": null
    },
    {
        "Nevill Mott": "nevill mott"
    },
    {
        ", and his ": null
    },
    {
        "DSc": "dsc"
    },
    {
        " from the ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        ", where he worked as an assistant to ": null
    },
    {
        "Max Born": "max born"
    },
    {
        ".     After the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " broke out in Europe, he was interned in the ": null
    },
    {
        "Isle of Man": "isle of man"
    },
    {
        ", and later in Canada. After he returned to Britain in 1941, he became an assistant to ": null
    },
    {
        "Rudolf Peierls": "rudolf peierls"
    },
    {
        ", working on ": null
    },
    {
        "Tube Alloys": "tube alloys"
    },
    {
        " —the British atomic bomb project. He began passing information on the project to the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " through ": null
    },
    {
        "Ruth Kuczynski": "ursula kuczynski"
    },
    {
        ", codenamed Sonia , a German communist and a major in Soviet Military Intelligence who had worked with ": null
    },
    {
        "Richard Sorges": "richard sorge"
    },
    {
        "spy ring in the Far East. In 1943, Fuchs and Peierls went to ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        ", in New York City, to work on the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        ". In August 1944, Fuchs joined the Theoretical Physics Division at the ": null
    },
    {
        "Los Alamos Laboratory": "los alamos laboratory"
    },
    {
        ", working under ": null
    },
    {
        "Hans Bethe": "hans bethe"
    },
    {
        ". His chief area of expertise was the problem of ": null
    },
    {
        "implosion": "implosion"
    },
    {
        ", necessary for the development of the ": null
    },
    {
        "plutonium": "plutonium"
    },
    {
        " bomb. After the war, he returned to the UK and worked at the ": null
    },
    {
        "Atomic Energy Research Establishment": "atomic energy research establishment"
    },
    {
        " at ": null
    },
    {
        "Harwell": "harwell, oxfordshire"
    },
    {
        " as head of the Theoretical Physics Division.     In January 1950, Fuchs confessed that he was a spy. A British court ": null
    },
    {
        "sentence": "sentence"
    },
    {
        "d him to fourteen years ": null
    },
    {
        "imprisonment": "imprisonment"
    },
    {
        " and stripped him of his ": null
    },
    {
        "British citizenship": "british citizenship"
    },
    {
        ". He was released in 1959, after serving nine years, and emigrated to the ": null
    },
    {
        "German Democratic Republic": "german democratic republic"
    },
    {
        " , where he was elected to the ": null
    },
    {
        "Academy of Sciences": "german academy of natural scientists leopoldina"
    },
    {
        " and became a member of the ": null
    },
    {
        "Socialist Unity Party of Germany": "socialist unity party of germany"
    },
    {
        " central committee": "central committee"
    },
    {
        ". He was later appointed deputy director of the ": null
    },
    {
        "Institute for Nuclear Research in Rossendorf": "forschungszentrum dresden-rossendorf"
    },
    {
        ", where he served until he retired in 1979.       Klaus Emil Julius Fuchs was born in ": null
    },
    {
        "Rüsselsheim": "rüsselsheim"
    },
    {
        ", ": null
    },
    {
        "Grand Duchy of Hesse": "grand duchy of hesse"
    },
    {
        ", on 29 December 1911, the third of four children of a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " pastor, ": null
    },
    {
        "Emil Fuchs": "emil fuchs"
    },
    {
        ", and his wife Else Wagner. Fuchs was always known by his last given name, Klaus. He had an older brother Gerhard, an older sister Elisabeth, and a younger sister, Kristel. The family moved to ": null
    },
    {
        "Eisenach": "eisenach"
    },
    {
        ", where Fuchs attended the  Gymnasium , and took his  Abitur . At school, Fuchs and his siblings were taunted over his fathers unpopular political views, which they came to share. They became known as the red foxes , Fuchs being the German word for fox.     Fuchs entered the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        " in 1930, where his father was a professor of ": null
    },
    {
        "theology": "theology"
    },
    {
        ". He became involved in student politics, joining the student branch of the ": null
    },
    {
        "Social Democratic Party of Germany": "social democratic party of germany"
    },
    {
        " , a party that his father had joined in 1912, and the  Reichsbanner Schwarz-Rot-Gold , the partys paramilitary organisation. His father took up a new position as professor of religion at the Pedagogical Academy in ": null
    },
    {
        "Kiel": "kiel"
    },
    {
        ", and in the autumn Fuchs transferred to the ": null
    },
    {
        "University of Kiel": "university of kiel"
    },
    {
        ", which his brother Gerhard and sister Elisabeth also attended. Fuchs continued his studies in mathematics and physics at the university. In October 1931, his mother committed suicide by drinking ": null
    },
    {
        "hydrochloric acid": "hydrochloric acid"
    },
    {
        ". The family later discovered that his maternal grandmother had also taken her own life.      In the ": null
    },
    {
        "March 1932 German presidential election": "1932 german presidential election"
    },
    {
        ", the SPD supported ": null
    },
    {
        "Paul von Hindenburg": "paul von hindenburg"
    },
    {
        " for ": null
    },
    {
        "President": "president of germany"
    },
    {
        ", fearing that a split vote would hand the job to the ": null
    },
    {
        "National Socialist German Workers Party": "national socialist german workers party"
    },
    {
        " candidate, ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ". However, when the ": null
    },
    {
        "Communist Party of Germany": "communist party of germany"
    },
    {
        " ran its own candidate, ": null
    },
    {
        "Ernst Thälmann": "ernst thälmann"
    },
    {
        ", Fuchs offered to speak for him, and was expelled from the SPD. That year Fuchs and all three of his siblings joined the KPD. Fuchs and his brother Gerhard were active speakers at public meetings, and occasionally attempted to disrupt NSDAP gatherings. At one such gathering, Fuchs was beaten up and thrown into the river.     When Hitler became ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        " in January 1933, Fuchs decided to leave Kiel, where the NSDAP was particularly strong and he was a well-known KPD member. He enrolled at the ": null
    },
    {
        "Kaiser Wilhelm Institute for Physics": "kaiser wilhelm institute for physics"
    },
    {
        " in Berlin. On 28 February, he took an early train to Berlin for a KPD meeting there. On the train, he read about the ": null
    },
    {
        "Reichstag fire": "reichstag fire"
    },
    {
        " in a newspaper. Fuchs correctly assumed that opposition parties would be blamed for the fire, and quietly removed his ": null
    },
    {
        "hammer and sickle": "hammer and sickle"
    },
    {
        " lapel pin": "lapel pin"
    },
    {
        ".     The KPD meeting in Berlin was held in secret. Fellow party members urged him to continue his studies in another country. He went into hiding for five months in the apartment of a fellow party member. In August 1933, he attended an anti-fascist conference in Paris chaired by ": null
    },
    {
        "Henri Barbusse": "henri barbusse"
    },
    {
        ", where he met an English couple, Ronald and Jessie Gunn, who invited Fuchs to stay with them in ": null
    },
    {
        "Clapton, Somerset": "clapton, somerset"
    },
    {
        ". He was expelled from the Kaiser Wilhelm Institute in October 1933.       Fuchs arrived in England on 24 September 1933. Jessie Gunn was a member of the Wills family, the heirs to ": null
    },
    {
        "Imperial Tobacco": "imperial tobacco"
    },
    {
        " and benefactors of the ": null
    },
    {
        "University of Bristol": "university of bristol"
    },
    {
        ". She arranged for Fuchs to meet ": null
    },
    {
        "Nevill Mott": "nevill mott"
    },
    {
        ", Bristols professor of physics, and he agreed to take Fuchs on as a research assistant. Fuchs earned his ": null
    },
    {
        "Ph.D.": "ph.d."
    },
    {
        " in physics there in 1937. A paper on A Quantum Mechanical Calculation of the Elastic Constants of Monovalent Metals was published in the  Proceedings of the Royal Society  in 1936. Proc. Roy. Soc. A vol. 153 no. 880 , pp. 622-639. By this time, Mott had a number of German refugees working for him, and lacked positions for them all. He did not think that Fuchs would make much of a teacher, so he arranged a research post for Fuchs, at the ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        " working under ": null
    },
    {
        "Max Born": "max born"
    },
    {
        ", who was himself a German refugee. Fuchs published papers with Born on The Statistical Mechanics of Condensing Systems and On Fluctuations in Electromagnetic radiation in the Proceedings of the Royal Society. He also received a ": null
    },
    {
        "Doctorate in Science": "doctorate in science"
    },
    {
        " degree from Edinburgh. Fuchs proudly mailed copies back to his father in Germany.     In Germany, Emil had been dismissed from his academic post, and, disillusioned with the Lutheran Churchs support of the NSDAP, had become a ": null
    },
    {
        "Quaker": "quaker"
    },
    {
        " in 1933. He was arrested for speaking out against the government, but was only held for one month. Elisabeth married a fellow communist, Gustav Kittowski, with whom she had a child they named Klaus. Elisabeth and Kittowski were arrested in 1933, and sentenced to 18 months imprisonment, but were freed at Christmas. Gerhard and his wife Karin were arrested in 1934, and spent the next two years in prison. Gerhard, Karin, Elisabeth and Kittowski established a car rental agency in Berlin, which they used to smuggle Jews and opponents of the government out of Germany.     After Emil was arrested in 1933, Kristel fled to Zurich, where she studied education and psychology at the ": null
    },
    {
        "University of Zurich": "university of zurich"
    },
    {
        ". She returned to Berlin in 1934, where she too worked at the car rental agency. In 1936, Emil arranged with Quaker friends in the United States for Kristel to attend ": null
    },
    {
        "Swarthmore College": "swarthmore college"
    },
    {
        " there. She visited Fuchs in England en route to America, where she eventually married an American communist, Robert Heineman, and settled in ": null
    },
    {
        "Cambridge, Massachusetts": "cambridge, massachusetts"
    },
    {
        ". She became a permanent resident in the United States in May 1938.   In 1936, Kittowski and Elisabeth were arrested again, and the rental cars were impounded. Gerhard and Karin fled to ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ". Elisabeth was released and went to live with Emil, while Kittowski, sentenced to six years, later escaped from prison and also made his way to Czechoslovakia. In August 1939, Elisabeth committed suicide by throwing herself from a train, leaving Emil to raise young Klaus.       Fuchs applied to become a ": null
    },
    {
        "British citizen": "british citizen"
    },
    {
        " in August 1939, but his application had not been processed before the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " broke out in Europe in September 1939. There was a classification system for ": null
    },
    {
        "enemy alien": "enemy alien"
    },
    {
        "s, but Born provided Fuchs with a reference that said that he had been a member of the SPD from 1930 to 1932, and an anti-Nazi. There matters stood until June 1940, when the police arrived and took Fuchs into custody. He was first interned on the ": null
    },
    {
        "Isle of Man": "isle of man"
    },
    {
        " and then, in July, he was sent to an internment camp in ": null
    },
    {
        "Sherbrooke, Quebec": "sherbrooke, quebec"
    },
    {
        ", Canada. During his internment in 1940, he continued to work and published four more papers with Born: The Mass Centre in Relativity, Reciprocity, Part II: Scalar Wave Functions, Reciprocity, Part III: Reciprocal Wave Functions and Reciprocity, Part IV: Spinor Wave Functions, and one by himself, On the Statistical Method in Nuclear Theory.         While interned in Quebec, he joined a communist discussion group led by ": null
    },
    {
        "Hans Kahle": "hans kahle"
    },
    {
        ". Kahle was a KPD member who had fought in the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        ". After fleeing to Britain with his family, Kahle had helped ": null
    },
    {
        "Jürgen Kuczynski": "jürgen kuczynski"
    },
    {
        " organise the KPD in Britain. Kristel arranged for ": null
    },
    {
        "Israel Halperin": "israel halperin"
    },
    {
        ", the brother-in-law of a friend of hers, ": null
    },
    {
        "Wendell H. Furry": "wendell h. furry"
    },
    {
        ", to bring Fuchs some magazines. Max Born lobbied for his release. On Christmas Day 1940, Fuchs and Kahle were among the first group of internees to board a ship to return to Britain.     Fuchs returned to Edinburgh in January, and resumed working for Born. In May 1941, he was approached by ": null
    },
    {
        "Rudolf Peierls": "rudolf peierls"
    },
    {
        " of the ": null
    },
    {
        "University of Birmingham": "university of birmingham"
    },
    {
        " to work on the ": null
    },
    {
        "Tube Alloys": "tube alloys"
    },
    {
        " program – the British atomic bomb research project. Despite wartime restrictions, he was granted British ": null
    },
    {
        "citizenship": "citizenship"
    },
    {
        " on 7 August 1942 and signed an ": null
    },
    {
        "Official Secrets Act": "official secrets act"
    },
    {
        " declaration form. As accommodation was scarce in wartime Birmingham, he stayed with Rudolf and Genia Peierls. Fuchs and Peierls did some important work together, which included a fundamental paper about isotope separation.     Soon after, Fuchs contacted Jürgen Kuczynski, who was now teaching at the ": null
    },
    {
        "London School of Economics": "london school of economics"
    },
    {
        ". Kuczynski put him in contact with Simon Davidovitch Kremer , the secretary to the military attaché at the ": null
    },
    {
        "Soviet Unions": "soviet union"
    },
    {
        "embassy, who worked for the ": null
    },
    {
        "GRU": "glavnoye razvedyvatelnoye upravleniye"
    },
    {
        " , the ": null
    },
    {
        "Red Armys": "red army"
    },
    {
        "foreign military intelligence directorate. After three meetings, Fuchs was teamed up with a courier so he would not have to find excuses to travel to London. She was ": null
    },
    {
        "Ruth Kuczynski": "ursula kuczynski"
    },
    {
        " , the sister of Jürgen Kuczynski. She was a German communist, a major in Soviet Military Intelligence and an experienced agent who had worked with ": null
    },
    {
        "Richard Sorges": "richard sorge"
    },
    {
        "spy ring in the Far East.     In late 1943, Fuchs  transferred along with Peierls to ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        ", in New York City, to work on ": null
    },
    {
        "gaseous diffusion": "gaseous diffusion"
    },
    {
        " as a means of ": null
    },
    {
        "uranium enrichment": "uranium enrichment"
    },
    {
        " for the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        ". Although Fuchs was an asset of GRU in Britain, his control was transferred to the ": null
    },
    {
        "NKGB": "nkgb"
    },
    {
        " , the Soviet Unions civilian intelligence organisation, when he moved to New York. He spent Christmas 1943 with Kristel and her family in Cambridge. He was contacted by ": null
    },
    {
        "Harry Gold": "harry gold"
    },
    {
        " , an NKGB agent in early 1944.        From August 1944, Fuchs worked in the Theoretical Physics Division at the ": null
    },
    {
        "Los Alamos Laboratory": "los alamos laboratory"
    },
    {
        ", under ": null
    },
    {
        "Hans Bethe": "hans bethe"
    },
    {
        ". His chief area of expertise was the problem of imploding the fissionable core of the ": null
    },
    {
        "plutonium": "plutonium"
    },
    {
        " bomb. At one point, Fuchs did calculation work that ": null
    },
    {
        "Edward Teller": "edward teller"
    },
    {
        " had refused to do because of lack of interest. He was the author of techniques  for calculating the energy of a fissile assembly that goes highly ": null
    },
    {
        "prompt critical": "prompt critical"
    },
    {
        ",  and his report on blast waves is still considered a classic. Fuchs was one of the many Los Alamos scientists present at the ": null
    },
    {
        "Trinity test": "trinity test"
    },
    {
        " in July 1945. In April 1946 he attended a conference at Los Alamos that discussed the possibility of a ": null
    },
    {
        "thermonuclear weapon": "thermonuclear weapon"
    },
    {
        "; one month later he filed a patent with ": null
    },
    {
        "John von Neumann": "john von neumann"
    },
    {
        ", describing a method to initiate fusion in a thermonuclear weapon with an implosion trigger. Bethe considered Fuchs one of the most valuable men in my division and one of the best theoretical physicists we had.      Fuchs, who was known as Karl rather than Klaus at Los Alamos, dated grade school teachers Evelyn Kline and Jean Parker. He befriended ": null
    },
    {
        "Richard Feynman": "richard feynman"
    },
    {
        ". Fuchs and Peierls were the only members of the British Mission to Los Alamos who owned cars, and Fuchs lent his ": null
    },
    {
        "Buick": "buick"
    },
    {
        " to Feynman so Feynman could visit his dying wife in hospital in ": null
    },
    {
        "Albuquerque": "albuquerque"
    },
    {
        ".     Klaus Fuchss main courier was ": null
    },
    {
        "Harry Gold": "harry gold"
    },
    {
        ". ": null
    },
    {
        "Allen Weinstein": "allen weinstein"
    },
    {
        ", the author of The Haunted Wood: Soviet Espionage in America , has pointed out: The NKVD had chosen Gold, an experienced group handler, as Fuchs contact on the grounds that it was safer than having him meet directly with a Russian operative, but ": null
    },
    {
        "Semyon Semyonov": "semyon semyonov"
    },
    {
        " was ultimately responsible for the Fuchs relationship.      Gold reported after his first meeting with Klaus Fuchs:              At the request of ": null
    },
    {
        "Norris Bradbury": "norris bradbury"
    },
    {
        ", who had replaced ": null
    },
    {
        "Robert Oppenheimer": "robert oppenheimer"
    },
    {
        " as director of the Los Alamos Laboratory in October 1945, Fuchs stayed on at the laboratory into 1946 to help with preparations for the ": null
    },
    {
        "Operation Crossroads": "operation crossroads"
    },
    {
        " weapons tests. The US ": null
    },
    {
        "Atomic Energy Act of 1946": "atomic energy act of 1946"
    },
    {
        " prohibited the transfer of information on nuclear research to any foreign country, including Britain, without explicit official authority, and Fuchs supplied highly classified U.S. information to nuclear scientists in Britain as well as to his Soviet contacts. , British official files on Fuchs were still being withheld.       He was highly regarded as a scientist by the British, who wanted him to return to the United Kingdom to work on ": null
    },
    {
        "Britains post-war nuclear weapons program": "nuclear weapons and the united kingdom"
    },
    {
        ". He returned in August 1946 and became the head of the Theoretical Physics Division at the ": null
    },
    {
        "Atomic Energy Research Establishment": "atomic energy research establishment"
    },
    {
        " at ": null
    },
    {
        "Harwell": "harwell, oxfordshire"
    },
    {
        ". From late 1947 to May 1949 he gave ": null
    },
    {
        "Alexander Feklisov": "alexander feklisov"
    },
    {
        ", his Soviet case officer, the principal theoretical outline for creating a hydrogen bomb and the initial drafts for its development as the work progressed in England and America. Meeting with Feklisov six times, he provided the results of the ": null
    },
    {
        "test at Eniwetok Atoll": "operation sandstone"
    },
    {
        " of uranium and plutonium bombs and the key data on production of ": null
    },
    {
        "uranium-235": "uranium-235"
    },
    {
        ".     Also in 1947, Fuchs attended a conference of the ": null
    },
    {
        "Combined Policy Committee": "combined policy committee"
    },
    {
        " , a committee created to facilitate exchange of atomic secrets at the highest levels of governments of the United States, United Kingdom and Canada; ": null
    },
    {
        "Donald Maclean": "donald duart maclean"
    },
    {
        ", another Soviet spy, was also in attendance as British co-secretary of CPC.         By September 1949, information from the ": null
    },
    {
        "Venona project": "venona project"
    },
    {
        " indicated to ": null
    },
    {
        "GCHQ": "gchq"
    },
    {
        " that Fuchs was a spy, but the British intelligence services were wary of indicating the source of their information. The Soviets had broken off contact with him in February. Fuchs may have been subsequently tipped off by ": null
    },
    {
        "Kim Philby": "kim philby"
    },
    {
        ". In October 1949, Fuchs approached Henry Arnold, the head of security at Harwell, with the news that his father had been given a chair at the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        " in ": null
    },
    {
        "East Germany": "east germany"
    },
    {
        ".     Under interrogation by ": null
    },
    {
        "MI5": "mi5"
    },
    {
        " officer ": null
    },
    {
        "William Skardon": "william skardon"
    },
    {
        " at an informal meeting in December 1949, Fuchs initially denied being a spy and was not detained. In January 1950, Fuchs arranged another interview with Skardon and voluntarily confessed that he was a spy. Three days later, he also directed a statement more technical in content to ": null
    },
    {
        "Michael Perrin": "michael perrin"
    },
    {
        ", the deputy controller of atomic energy within the Ministry of Supply. Fuchs told interrogators that the NKGB had acquired an agent in ": null
    },
    {
        "Berkeley, California": "berkeley, california"
    },
    {
        ", who had informed the Soviet Union about ": null
    },
    {
        "electromagnetic separation": "electromagnetic separation"
    },
    {
        " research of uranium-235 in 1942 or earlier. Fuchss statements to British and American intelligence agencies were used to implicate ": null
    },
    {
        "Harry Gold": "harry gold"
    },
    {
        ", a key witness in the trials of ": null
    },
    {
        "David Greenglass": "david greenglass"
    },
    {
        " and ": null
    },
    {
        "Julius and Ethel Rosenberg": "julius and ethel rosenberg"
    },
    {
        " in the United States.     Fuchs later testified that he passed detailed information on the project to the Soviet Union through courier Harry Gold in 1945, and further information about ": null
    },
    {
        "Edward Tellers": "edward teller"
    },
    {
        " unworkable Super design": "history of the teller–ulam designtellers   super"
    },
    {
        " for a ": null
    },
    {
        "hydrogen bomb": "hydrogen bomb"
    },
    {
        " in 1946 and 1947.       ": null
    },
    {
        "Hans Bethe": "hans bethe"
    },
    {
        " once said that Klaus Fuchs was the only physicist he knew who truly changed history. Because the head of the Soviet project, ": null
    },
    {
        "Lavrenti Beria": "lavrenti beria"
    },
    {
        ", used foreign intelligence as a third-party check, rather than giving it directly to the scientists, as he did not trust the information by default, it is unknown whether Fuchss fission information had a substantial effect. Considering that the pace of the Soviet program was set primarily by the amount of uranium they could procure, it is hard for scholars to accurately judge how much time this saved.     According to On a Field of Red, a history of the ": null
    },
    {
        "Comintern": "comintern"
    },
    {
        " by ": null
    },
    {
        "Anthony Cave Brown": "anthony cave brown"
    },
    {
        " and ": null
    },
    {
        "Charles B. MacDonald": "charles b. macdonald"
    },
    {
        ", Fuchss greatest contribution to the Soviets may have been disclosing how uranium could be processed for use in a bomb. Fuchs gave Gold technical information in January 1945 that was acquired only after two years of experimentation at a cost of $400 million. Fuchs also disclosed the amount of uranium or plutonium the Americans planned to use in each atomic bomb.     Whether the information Fuchs passed relating to the hydrogen bomb would have been useful is still debated. Most scholars agree with Hans Bethes 1952 assessment, which concluded that by the time Fuchs left the thermonuclear program in mid-1946, too little was known about the mechanism of the hydrogen bomb for his information to be useful to the Soviet Union. The successful ": null
    },
    {
        "Teller-Ulam design": "teller-ulam design"
    },
    {
        " was not devised until 1951. Soviet physicists later noted that they could see as well as the Americans eventually did that the early designs by Fuchs and ": null
    },
    {
        "Edward Teller": "edward teller"
    },
    {
        " were useless.     Later archival work by Soviet physicist ": null
    },
    {
        "German Goncharov": "german goncharov"
    },
    {
        "  suggested that while Fuchss early work did not help Soviet efforts towards the hydrogen bomb, it was closer to the final correct solution than anyone recognized at the time—and indeed spurred Soviet research into useful problems that eventually provided the correct answer. Since most of Fuchss work on the bomb, including a 1946 patent on a particular model for the weapon, are still classified in the United States, it has been difficult for scholars to fully assess these conclusions. In any case, it seems clear that Fuchs could not have just given the Soviets the secret to the hydrogen bomb, since he did not actually know it himself.       It is likely that Fuchs espionage led the U.S. to cancel a 1950 Anglo-American plan to give Britain American-made atomic bombs. He was prosecuted by Sir ": null
    },
    {
        "Hartley Shawcross": "hartley shawcross"
    },
    {
        ", and was convicted on 1 March 1950 of four counts of breaking the ": null
    },
    {
        "Official Secrets Act": "official secrets act"
    },
    {
        " by ...communicating information to a potential enemy.  After a ": null
    },
    {
        "trial": "trial"
    },
    {
        " lasting less than 90 minutes, ": null
    },
    {
        "Lord Goddard": "rayner goddard, baron goddard"
    },
    {
        " sentenced him to fourteen years ": null
    },
    {
        "imprisonment": "imprisonment"
    },
    {
        ", the maximum for ": null
    },
    {
        "espionage": "espionage"
    },
    {
        ", because the Soviet Union was classed as an ally at the time. In December 1950, he was stripped of his ": null
    },
    {
        "British citizenship": "british citizenship"
    },
    {
        ". The head of the ": null
    },
    {
        "British H-bomb project": "nuclear weapons and the united kingdom"
    },
    {
        ", Sir ": null
    },
    {
        "William Penney": "william penney"
    },
    {
        ", visited Fuchs in prison in 1952.     While imprisoned he was friendly with ": null
    },
    {
        "Irish Republican Army": "irish republican army"
    },
    {
        " prisoner Seamus Murphy whom he played chess with and helped escape.   It was suggested by some that Fuchs had turned IRA leader ": null
    },
    {
        "Cathal Goulding": "cathal goulding"
    },
    {
        " into a Marxist but Seamus Murphy denied this saying Fuchs never tried to turn anyone – it was hard to get a word out of him! .      Fuchs was released on 23 June 1959, after serving nine years and four months of his sentence at ": null
    },
    {
        "Wakefield Prison": "wakefield prison"
    },
    {
        " and promptly emigrated to the ": null
    },
    {
        "German Democratic Republic": "german democratic republic"
    },
    {
        " .       On arrival at ": null
    },
    {
        "Berlin Schönefeld Airport": "berlin schönefeld airport"
    },
    {
        " in the GDR, Fuchs was met by ": null
    },
    {
        "Grete Keilson": "grete keilson"
    },
    {
        ", a friend from his years as a student communist. They were married on 9 September 1959.     In the GDR, Fuchs continued his scientific career and achieved considerable prominence as a leader of research. He became a member of the ": null
    },
    {
        "SED": "socialist unity party of germany"
    },
    {
        " central committee": "central committee"
    },
    {
        " in 1967, and in 1972 was elected to the ": null
    },
    {
        "Academy of Sciences": "german academy of natural scientists leopoldina"
    },
    {
        " where from 1974 to 1978 he was the head of the research area of physics, nuclear and materials science; he was then appointed deputy director of the ": null
    },
    {
        "Institute for Nuclear Research in Rossendorf": "forschungszentrum dresden-rossendorf"
    },
    {
        ", where he served until he retired in 1979. From 1984, Fuchs was head of the scientific councils for energetic basic research and for fundamentals of microelectronics. He received the ": null
    },
    {
        "Patriotic Order of Merit": "patriotic order of merit"
    },
    {
        ", the ": null
    },
    {
        "Order of Karl Marx": "order of karl marx"
    },
    {
        " and the ": null
    },
    {
        "National Prize of East Germany": "national prize of east germany"
    },
    {
        ". A tutorial Fuchs gave to ": null
    },
    {
        "Qian Sanqiang": "qian sanqiang"
    },
    {
        " and other Chinese physicists helped them to develop the first ": null
    },
    {
        "Chinese atomic bomb": "peoples republic of china and weapons of mass destruction"
    },
    {
        ", the ": null
    },
    {
        "596": "596"
    },
    {
        ", which was tested five years later—according to ": null
    },
    {
        "Thomas Reed": "thomas c. reed"
    },
    {
        " and Daniel Stillman, the authors of The Nuclear Express: A Political History of the Bomb and Its Proliferation . Three historians of nuclear weapons history, Robert S. Norris, ": null
    },
    {
        "Jeremy Bernstein": "jeremy bernstein"
    },
    {
        ", and ": null
    },
    {
        "Peter D. Zimmerman": "peter d. zimmerman"
    },
    {
        ", challenged this particular assertion as unsubstantiated conjecture  and asserted that The Nuclear Express is an ambitious but deeply flawed book .       Fuchs died in Berlin on 28 January 1988. He was cremated and his ashes buried in the Pergolenweg of the Socialists Memorial in Berlins ": null
    },
    {
        "Friedrichsfelde Cemetery": "zentralfriedhof friedrichsfelde"
    },
    {
        ".         A documentary film about Fuchs, Väter der tausend Sonnen was released in 1990.           ": null
    }
]