[
    {
        "     Klement Gottwald was a ": null
    },
    {
        "Czechoslovak": "Czechoslovakia"
    },
    {
        " communist": "Communism"
    },
    {
        " politician, who was the leader of the ": null
    },
    {
        "Communist Party of Czechoslovakia": "Communist Party Of Czechoslovakia"
    },
    {
        " from 1929 until his death in 1953–titled as General Secretary until 1945 and as Chairman from 1945 to 1953. He was the first leader of ": null
    },
    {
        "Communist Czechoslovakia": "Communist Czechoslovakia"
    },
    {
        " from 1948 to 1953.     He was the 14th ": null
    },
    {
        "List of Prime Ministers of Czechoslovakia": "List Of Prime Ministers Of Czechoslovakia"
    },
    {
        " from July 1946 until June 1948, the first Communist to hold the post. In June 1948, he was elected as Czechoslovakias first Communist ": null
    },
    {
        "president": "List Of Presidents Of Czechoslovakia"
    },
    {
        ", four months after the ": null
    },
    {
        "1948 coup détat": "1948 Czechoslovak Coup Détat"
    },
    {
        " in which his party seized power with the backing of the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ". He held the post until his death.           Klement Gottwald was born in ": null
    },
    {
        "Heroltice": "Heroltice"
    },
    {
        " as the illegitimate son of a poor peasant. Before the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        " he was trained in ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        " as a ": null
    },
    {
        "carpenter": "Carpentry"
    },
    {
        " but also actively participated in the activities of the ": null
    },
    {
        "Social Democratic youth": "Czech Social Democratic Party"
    },
    {
        " movement.       Klement Gottwald was married to ": null
    },
    {
        "Marta Gottwaldová": ":Cs:Marta Gottwaldová"
    },
    {
        " who, like him, came from a poor family and was an illegitimate child. Although his wife stood by him through his endeavours, and was his faithful companion, she never joined the ": null
    },
    {
        "Communist Party": "Communist Party Of Czechoslovakia"
    },
    {
        ". They had one daughter, Marta.       From 1915 to 1918 Gottwald was a soldier in the ": null
    },
    {
        "Austro-Hungarian Army": "Austro-Hungarian Army"
    },
    {
        ". It is believed that he fought in the ": null
    },
    {
        "Battle of Zborov": "Battle Of Zborov"
    },
    {
        ", which would mean that he fought there against future General and President ": null
    },
    {
        "Ludvík Svoboda": "Ludvík Svoboda"
    },
    {
        ", who fought on the side of the ": null
    },
    {
        "Czechoslovak Legion": "Czechoslovak Legion"
    },
    {
        ".  Thomas Jakl of the Military History Institute called Gottwalds participation in ": null
    },
    {
        "Zborova": "Zborovice"
    },
    {
        " a legend: Gottwald was in a hospital in ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        " during the time of the battle.  In the summer of 1918, Gottwald deserted from the army. After the establishment of the ": null
    },
    {
        "first Czechoslovak Republic": "First Czechoslovak Republic"
    },
    {
        ", he served for two years in the ": null
    },
    {
        "Czechoslovak Army": "Czechoslovak Army"
    },
    {
        ". From 1920 to 1921 he worked in ": null
    },
    {
        "Rousinov": "Rousínov"
    },
    {
        " as a cabinetmaker.           After the collapse of the Union of Workers sports associations , the Communist-oriented party of the organization split off in 1921 and created the Federation of Workers Sports Unions . Gottwald was able to unify the organization to gain considerable power in the local districts, and became the mayor of the 20th district of the FDTJ. In June 1921, he participated in the first ": null
    },
    {
        "Spartakiad": "Spartakiad"
    },
    {
        "a in ": null
    },
    {
        "Prague": "Prague"
    },
    {
        ". In September 1921 he moved from ": null
    },
    {
        "Rousinov": "Rousínov"
    },
    {
        " to ": null
    },
    {
        "Banská Bystrica": "Banská Bystrica"
    },
    {
        ", where he became the editor of the communist magazine  Hlas Ľudu  . At the same time, he was planning FDTJ events at the ": null
    },
    {
        "Banská Bystrica": "Banská Bystrica"
    },
    {
        " district. He became the local mayor of the district, and was the managing director of the 47th district of the FDJT. Later, he moved to ": null
    },
    {
        "Žilina": "Žilina"
    },
    {
        " and became editor in chief of the magazine Spartacus. In 1922 he moved to ": null
    },
    {
        "Vrútky": "Vrútky"
    },
    {
        ", where by decision of the ": null
    },
    {
        "KSČ": "Communist Party Of Czechoslovakia"
    },
    {
        " Central Committee": "Central Committee"
    },
    {
        ", they merged a number of communist magazines and their editors together. In 1924, the editorial staff finally moved to ": null
    },
    {
        "Ostrava": "Ostrava"
    },
    {
        ", where Gottwald finally resettled.          In 1926, Gottwald became a ": null
    },
    {
        "functionary": "Functionary"
    },
    {
        " of the ": null
    },
    {
        "Communist Party": "Communist Party Of Czechoslovakia"
    },
    {
        ", and editor of the Communist Press. From 1926 to 1929 he worked in Prague, where he aided the Secretariat of the ": null
    },
    {
        "KSČ": "Communist Party Of Czechoslovakia"
    },
    {
        " to form a pro-Moscow opposition against the then in power anti-Moscow leadership. Since 1928 he was a member of the ": null
    },
    {
        "Comintern": "Communist International"
    },
    {
        ". Following Comintern policy initiated by Stalin, he carried out the ": null
    },
    {
        "Bolshevization": "Bolshevization"
    },
    {
        " of the Party. H. Gordon Skilling, Gottwald and the Bolshevization of the Communist Party of Czechoslovakia . American Slavic and East European Review 20.4 : 641-655.     In February 1929, at the Fifth Congress of the ": null
    },
    {
        "KSČ": "Communist Party Of Czechoslovakia"
    },
    {
        ", Gottwald was elected party general secretary, alongside Guttmann, ": null
    },
    {
        "Šverma": ":Cs:Jan Šverma"
    },
    {
        ", ": null
    },
    {
        "Slansky": "Rudolf Slánský"
    },
    {
        ", ": null
    },
    {
        "Kopecky": ":Cs:Václav Kopecký"
    },
    {
        " and the Reimans .     In the second half of 1930 the Communist Party carried out a number of reforms in accordance and response with the changes in those of the foreign policy of the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ", namely the introduction of the policy of the formation of the  Popular front against Fascism . In September and October 1938 Gottwald was one of the main leaders of the opposition against the adoption of the ": null
    },
    {
        "Munich Agreement": "Munich Agreement"
    },
    {
        ".       After the banning of the Communist Party Gottwald emigrated to ": null
    },
    {
        "the Soviet Union": "Soviet Union"
    },
    {
        " in November 1938. While there, he opposed the party policy of backing the ": null
    },
    {
        "Molotov-Ribbentrop pact of 1939": "Molotov–Ribbentrop Pact"
    },
    {
        ". After the ": null
    },
    {
        "attack on the Soviet Union": "Operation Barbarossa"
    },
    {
        " in June 1941, Soviet leadership saw the front against fascism as a great opportunity to assert themselves in ": null
    },
    {
        "Czechoslovakia": "Czechoslovakia"
    },
    {
        ", promoting interest in supporting Gottwald after the liberation of ": null
    },
    {
        "Czechoslovakia": "Czechoslovakia"
    },
    {
        ". In 1943 Gottwald agreed with representatives of the ": null
    },
    {
        "Czechoslovak-government-in-exile": "Czechoslovak Government-In-Exile"
    },
    {
        " located in London, along with President ": null
    },
    {
        "Edvard Beneš": "Edvard Beneš"
    },
    {
        ", to unify domestic and foreign anti-fascist resistance and form the ": null
    },
    {
        "National Front": "National Front"
    },
    {
        ". This proved helpful for Gottwald as it helped secure Communist influence in post-war Czechoslovakia.       In 1945, Gottwald gave up the general secretarys post to ": null
    },
    {
        "Rudolf Slánský": "Rudolf Slánský"
    },
    {
        " and was elected to the new position of party chairman. On 10 May 1945 Gottwald returned to Prague as the deputy premier under ": null
    },
    {
        "Zdeněk Fierlinger": "Zdeněk Fierlinger"
    },
    {
        " and as the chairman of the ": null
    },
    {
        "National Front": "National Front"
    },
    {
        ". In March 1946, he led the party to a 38% share of the vote. This was easily the KSČs best performance in an election. Jean-Baptiste Duroselle: Histoire Diplomatique de 1919 à nos jours, pt.3, ch.2, par.5, pag 256. Dalloz 1993, Paris. Gottwald was a firm supporter of the ": null
    },
    {
        "expulsion of ethnic Germans from Czechoslovakia": "Expulsion Of Germans From Czechoslovakia"
    },
    {
        ", gaining mainstream credibility with many Czechs through the use of nationalist rhetoric, exhorting the population to prepare for the final retribution for ": null
    },
    {
        "White Mountain": "Battle Of White Mountain"
    },
    {
        ", for the return of the Czech lands to the Czech people. We will expel for good all descendants of the alien German nobility. Applebaum, Anne. Iron Curtain: The Crushing of Eastern Europe 1944–56. London: Penguin, 2013.          By the summer of 1947, however, the KSČs popularity had significantly dwindled, particularly after the Soviets pressured Czechoslovakia to turn down ": null
    },
    {
        "Marshall Plan": "Marshall Plan"
    },
    {
        " aid after initially accepting it. Most observers believed Gottwald would be turned out of office at the elections due in May 1948. The Communists dwindling popularity, combined with France and Italy dropping the Communists from their coalition governments, prompted ": null
    },
    {
        "Joseph Stalin": "Joseph Stalin"
    },
    {
        " to order Gottwald to begin efforts to set up an undisguised Communist regime in Czechoslovakia.     Outwardly, though, Gottwald kept up the appearance of working within the system, announcing that he intended to lead the Communists to an absolute majority in the upcoming election—something no Czechoslovak party had ever done. The endgame began in February 1948, when a majority of the Cabinet directed the Communist interior minister, , to stop packing the police force with Communists. Nosek ignored this directive, with Gottwalds support. In response, 12 non-Communist ministers resigned. They believed that without their support, Gottwald would be unable to govern and be forced to either give way or resign. Beneš initially supported their position, and refused to accept their resignations. Gottwald not only refused to resign, but demanded the appointment of a Communist-dominated government under threat of a general strike. His Communist colleagues occupied the offices of the non-Communist ministers.      On 25 February, Beneš, fearing Soviet intervention, gave in. He accepted the resignations of the non-Communist ministers and appointed a new government in accordance with Gottwalds specifications. Although ostensibly still a coalition, it was dominated by Communists and pro-Moscow Social Democrats. The other parties were still nominally represented, but with the exception of Foreign Minister ": null
    },
    {
        "Jan Masaryk": "Jan Masaryk"
    },
    {
        " they were ": null
    },
    {
        "fellow travellers": "Fellow Traveller"
    },
    {
        "handpicked by the Communists. From this date forward, Gottwald was effectively the most powerful man in Czechoslovakia.        On 9 May, the National Assembly, now a docile tool of the Communists, approved the so-called ": null
    },
    {
        "Ninth-of-May Constitution": "Ninth-Of-May Constitution"
    },
    {
        ". While it was not a completely Communist document, its Communist imprint was strong enough that Beneš refused to sign it. Later that month, ": null
    },
    {
        "elections": "1948 Czechoslovak Parliamentary Election"
    },
    {
        " were held in which voters were presented with a single list from the National Front, now a Communist-controlled patriotic organization.     Beneš resigned on 2 June. In accordance with the 1920 Constitution, Gottwald took over most presidential functions until 14 June, when he was formally elected as President.       Gottwald initially tried to take a semi-independent line. However, that changed shortly after a meeting with Stalin. Under his direction, Gottwald imposed the Soviet model of government on the country. He ": null
    },
    {
        "nationalized": "Nationalization"
    },
    {
        " the countrys industry and collectivized its farms. There was considerable resistance within the government to Soviet influence on Czechoslovak politics. In response, Gottwald instigated a series of ": null
    },
    {
        "purge": "Purge"
    },
    {
        "s, first to remove non-communists, later to remove some communists as well. Prominent Communists who became victims of these purges and were defendants in the ": null
    },
    {
        "Prague Trials": "Prague Trials"
    },
    {
        " included ": null
    },
    {
        "Rudolf Slánský": "Rudolf Slánský"
    },
    {
        ", the partys general secretary, ": null
    },
    {
        "Vlado Clementis": "Vladimir Clementis"
    },
    {
        " and ": null
    },
    {
        "Gustáv Husák": "Gustáv Husák"
    },
    {
        " , who was dismissed from office for bourgeois nationalism . Slánský and Clementis were executed in December 1952, and hundreds of other government officials were sent to prison. Husák was rehabilitated in the 1960s and became the leader of Czechoslovakia in 1969.     In a famous photograph from 21 February 1948, described also in  The Book of Laughter and Forgetting  by ": null
    },
    {
        "Milan Kundera": "Milan Kundera"
    },
    {
        ", Clementis stands next to Gottwald. When Vladimír Clementis was charged in 1950, he was erased from the photograph by the state propaganda department.  of Gottwald and Clementis from 21 February 1948, Prague, Czechoslovakia, Czech News Agency, ctk.cz.  of Gottwald and Clementis from 21 February 1948, Prague, Czechoslovakia, Czech News Agency, ctk.cz.       Gottwald was a long-time ": null
    },
    {
        "alcoholic": "Alcoholism"
    },
    {
        " , Retrieved 12 October 2019 and suffered from heart disease caused by   ": null
    },
    {
        "syphilis": "Syphilis"
    },
    {
        " that had gone untreated for several years. , Retrieved 12 October 2019 Shortly after attending ": null
    },
    {
        "Stalins funeral": "Stalins Funeral"
    },
    {
        " on 9 March 1953, one of his arteries burst. He died five days later on 14 March 1953, aged 56.     Gottwalds embalmed body was initially displayed in a ": null
    },
    {
        "mausoleum": "Mausoleum"
    },
    {
        " at the site of the ": null
    },
    {
        "Jan Žižka": "Jan Žižka"
    },
    {
        " national monument": "National Monument In Vitkov"
    },
    {
        " in the district of Žižkov, Prague. In 1962 the ": null
    },
    {
        "personality cult": "Personality Cult"
    },
    {
        " ended and it was no longer deemed appropriate to show Gottwalds body. There are accounts that in 1962 Gottwalds body had blackened and was ": null
    },
    {
        "decomposing": "Decomposition"
    },
    {
        " due to a botched ": null
    },
    {
        "embalming": "Embalming"
    },
    {
        ", although other witnesses have disputed this. , Retrieved 19 September 2012 His body was cremated, the ashes returned to the Žižka Monument and placed in a sarcophagus.     After the end of the communist period, Gottwalds ashes were removed from the Žižka Monument and placed in a common grave at Pragues ": null
    },
    {
        "Olšany Cemetery": "Olšany Cemetery"
    },
    {
        ",  together with the ashes of about 20 other communist leaders which had also originally been placed in the Žižka Monument. The Communist Party of Bohemia and Moravia now maintains that common grave.       He was succeeded as de facto leader of Czechoslovakia by ": null
    },
    {
        "Antonín Novotný": "Antonín Novotný"
    },
    {
        ", who became First Secretary of the KSČ. ": null
    },
    {
        "Antonín Zápotocký": "Antonín Zápotocký"
    },
    {
        ", who had been prime minister since 1948, succeeded Gottwald as president.     In tribute, ": null
    },
    {
        "Zlín": "Zlín"
    },
    {
        ", a city in Moravia, now the ": null
    },
    {
        "Czech Republic": "Czech Republic"
    },
    {
        ", was renamed Gottwaldov after him from 1949 to 1990. ": null
    },
    {
        "Zmiiv": "Zmiiv"
    },
    {
        ", a city in ": null
    },
    {
        "Kharkiv Oblast": "Kharkiv Oblast"
    },
    {
        ", ": null
    },
    {
        "Ukrainian SSR": "Ukrainian Ssr"
    },
    {
        ", was named Gotvald after him from 1976 to 1990.     ": null
    },
    {
        "Námestie Slobody": "Námestie Slobody"
    },
    {
        "  in ": null
    },
    {
        "Bratislava": "Bratislava"
    },
    {
        " was named Gottwaldovo námestie after him. A bridge in Prague that is now called ": null
    },
    {
        "Nuselský Most": "Nuselský Most"
    },
    {
        " was once called Gottwaldův Most, and the abutting metro station now called Vyšehrad was called Gottwaldova.     A Czechoslovak 100 Koruna banknote issued on 1 October 1989 as part of the 1985–89 banknote series included a portrait of Gottwald. This note was so poorly received by Czechoslovaks that it was removed from official circulation on 31 December 1990 and was promptly replaced with the previous banknote issue of the same denomination. All Czechoslovak banknotes were removed from circulation in 1993 and replaced by separate Czech and Slovak notes.      In 2005 he was voted the Worst Czech in a ": null
    },
    {
        "ČT": "Čt"
    },
    {
        " poll . He received 26% of the votes. ": null
    }
]