[
    {
        "         Kohen or cohen  is the Hebrew word for ": null
    },
    {
        "priest": "priest"
    },
    {
        " , used in reference to the ": null
    },
    {
        "Aaron": "aaron"
    },
    {
        "ic ": null
    },
    {
        "priesthood": "priestjudaism"
    },
    {
        ". Levitical priests or kohanim are traditionally believed and ": null
    },
    {
        "halakhically": "halakha"
    },
    {
        " required to be of direct ": null
    },
    {
        "patrilineal descent": "patrilineality"
    },
    {
        " from the ": null
    },
    {
        "biblical": "bible"
    },
    {
        " Aaron": "aaron"
    },
    {
        " , brother of Moses.     During the existence of the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        ", kohanim performed the daily and holiday  duties of ": null
    },
    {
        "sacrificial offerings": "korban"
    },
    {
        ". Today, kohanim retain a lesser though distinct status within ": null
    },
    {
        "Rabbinic": "rabbinic"
    },
    {
        " and ": null
    },
    {
        "Karaite Judaism": "karaite judaism"
    },
    {
        ", and are bound by additional restrictions according to ": null
    },
    {
        "Orthodox": "orthodox judaism"
    },
    {
        " Judaism.     In the ": null
    },
    {
        "Samaritan": "samaritan"
    },
    {
        " community, the kohanim have remained the primary religious leaders. ": null
    },
    {
        "Ethiopian Jewish": "beta israel"
    },
    {
        " religious leaders are sometimes called ": null
    },
    {
        "kahen": "kahen"
    },
    {
        ", a form of the same word, but the position is not hereditary and their duties are more like those of rabbis than kohanim in most Jewish communities.       The ": null
    },
    {
        "noun": "noun"
    },
    {
        " kohen is used in the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " to refer to ": null
    },
    {
        "priest": "priest"
    },
    {
        "s, whether Jewish or pagan, such as the kohanim of ": null
    },
    {
        "Baal": "baal"
    },
    {
        "  or ": null
    },
    {
        "Dagon": "dagon"
    },
    {
        ", though Christian priests are referred to in Hebrew by the term komer . Kohanim can also refer to the Jewish nation as a whole, as in ": null
    },
    {
        "Exodus": "book of exodus"
    },
    {
        " 42:42 part of the ": null
    },
    {
        "Parshath Yithro": "yitro"
    },
    {
        ", where the whole of Israel is addressed as a kingdom of priests and a holy nation . The word derives from a ": null
    },
    {
        "Semitic root": "semitic root"
    },
    {
        " common at least to the ": null
    },
    {
        "Central Semitic languages": "central semitic languages"
    },
    {
        "; the ": null
    },
    {
        "cognate": "cognate"
    },
    {
        " Arabic": "arabic language"
    },
    {
        " word  kāhin means ": null
    },
    {
        "soothsayer": "soothsayer"
    },
    {
        ", ": null
    },
    {
        "augur": "augur"
    },
    {
        " , or ": null
    },
    {
        "priest": "priest"
    },
    {
        " .     Translations in the paraphrase of the Aramaic ": null
    },
    {
        "Targum": "targum"
    },
    {
        "ic interpretations include friend in ": null
    },
    {
        "Targum Yonathan": "targum yonathan"
    },
    {
        " to ": null
    },
    {
        "42 Kings": "books of kings"
    },
    {
        " 42:42 master in Targum to ": null
    },
    {
        "Amos": "book of amos"
    },
    {
        " 42:42 and minister in ": null
    },
    {
        "Mechilta": "mekhilta of rabbi ishmael"
    },
    {
        " to ": null
    },
    {
        "Parshah Jethro": "yitro"
    },
    {
        " . As a starkly different translation the title worker and servant , have been offered as a translation as well.               The status of priest kohen was conferred on ": null
    },
    {
        "Aaron": "aaron"
    },
    {
        ", the brother of Moses, and his sons as an everlasting ": null
    },
    {
        "covenant": "covenant"
    },
    {
        " In Hebrew: ברית כהונת עולם  or a ": null
    },
    {
        "covenant of salt": "covenant of salt"
    },
    {
        ". During the 42 years of wandering in the wilderness and until the ": null
    },
    {
        "Holy Temple": "temple in jerusalem"
    },
    {
        " was built in ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ", the priests performed their priestly service in the portable ": null
    },
    {
        "Tabernacle": "tabernacle"
    },
    {
        ".  Their duties involved offering the daily and ": null
    },
    {
        "Jewish holiday": "jewish holiday"
    },
    {
        " sacrifices": "korban"
    },
    {
        ", and blessing the people in a ": null
    },
    {
        "Priestly Blessing": "priestly blessing"
    },
    {
        ", later also known as Nesiat Kapayim .     In a broader sense, since Aaron was a descendant of the ": null
    },
    {
        "Tribe of Levi": "tribe of levi"
    },
    {
        ", priests are sometimes included in the term  Levite s, by direct patrilineal descent. However, not all Levites are priests.     When the Temple existed, most sacrifices and offerings could only be conducted by priests. Non-priest Levites  performed a variety of other Temple roles, including ": null
    },
    {
        "ritual slaughter of animals": "shechita"
    },
    {
        ", song service by use of voice and musical instruments, and various tasks in assisting the priests in performing their service.          The Torah mentions ": null
    },
    {
        "Melchizedek": "melchizedek"
    },
    {
        " king of Salem, identified by ": null
    },
    {
        "Rashi": "rashi"
    },
    {
        " as being ": null
    },
    {
        "Shem": "shem"
    },
    {
        " the son of ": null
    },
    {
        "Noah": "noah"
    },
    {
        ", as a priest kohen to El Elyon . The second is Potiphera, priest of Heliopolis, then Jethro, priest of Midian both ": null
    },
    {
        "pagan": "pagan"
    },
    {
        " priests of their era. i.e. prior to Jethros conversion to judaism - Rashi on  Parshath Yithro      When ": null
    },
    {
        "Esau": "esau"
    },
    {
        " sold the birthright of the first born to ": null
    },
    {
        "Jacob": "jacob"
    },
    {
        ", Rashi explains that the priesthood was sold along with it, because by right the priesthood belongs to the first-born. Only when the first-born sinned in the incident of the ": null
    },
    {
        "golden calf": "golden calf"
    },
    {
        ", the priesthood was given to the Tribe of Levi, which had not been tainted by this incident.     Moses was supposed to receive the priesthood along with the leadership of the Jewish people, but when he argued with God that he should not be the leader, God then chose Aaron as the recipient of the priesthood. Moses is, however, referred to as a priest in ": null
    },
    {
        "Psalms": "psalms"
    },
    {
        " 42:42 - according to tradition , this refers to his service in the first seven days of the dedication of the ": null
    },
    {
        "Tabernacle": "tabernacle"
    },
    {
        ".     Aaron received the priesthood along with his children and any descendants that would be born subsequently. However, his grandson ": null
    },
    {
        "Phinehas": "phinehas"
    },
    {
        " had already been born, and did not receive the priesthood until he killed the prince of the ": null
    },
    {
        "Tribe of Simeon": "tribe of simeon"
    },
    {
        " and the princess of the ": null
    },
    {
        "Midianite": "midianite"
    },
    {
        "s . Thereafter, the priesthood has remained with the descendants of Aaron.                The ": null
    },
    {
        "Torah": "torah"
    },
    {
        " provides for specific vestments to be worn by the priests when they are ministering in the ": null
    },
    {
        "Tabernacle": "tabernacle"
    },
    {
        ": And you shall make holy garments for Aaron your brother, for dignity and for beauty . These garments are described in detail in ,  and . The high priest wore eight holy garments . Of these, four were of the same type worn by all priests, and four were unique to the Kohen Gadol.     Those vestments which were common to all priests, were:   ": null
    },
    {
        "Priestly undergarments": "priestly undergarments"
    },
    {
        "  : ": null
    },
    {
        "linen": "linen"
    },
    {
        " pants reaching from the waist to the knees to cover their nakedness    ": null
    },
    {
        "Priestly tunic": "priestly tunic"
    },
    {
        "  : made of pure linen, covering the entire body from the neck to the feet, with sleeves reaching to the wrists. That of the high priest was embroidered ; those of the priests were plain .   ": null
    },
    {
        "Priestly sash": "priestly sash"
    },
    {
        "  : that of the high priest was of fine linen with ": null
    },
    {
        "embroidered work": "embroidery"
    },
    {
        " in blue and purple and scarlet ; those worn by the priests were of white, twined linen.   ": null
    },
    {
        "Priestly turban": "priestly turban"
    },
    {
        " : that of the high priest was much larger than that of the priests and wound so that it formed a broad, flat-topped turban; that for priests was wound so that it formed a cone-shaped turban, called a migbahat.     The vestments that were unique to the high priest were:   ": null
    },
    {
        "Priestly robe": "priestly robe"
    },
    {
        "  : a sleeveless, blue robe, the lower hem of which was fringed with small golden bells alternating with ": null
    },
    {
        "pomegranate": "pomegranate"
    },
    {
        "-shaped tassels in blue, purple, and scarlet—": null
    },
    {
        "tekhelet": "tekhelet"
    },
    {
        ",  argaman, tolaat shani.   ": null
    },
    {
        "Ephod": "ephod"
    },
    {
        ": a richly embroidered vest or apron with two ": null
    },
    {
        "onyx": "onyx"
    },
    {
        " engraved gem": "engraved gem"
    },
    {
        "stones on the shoulders, on which were engraved the names of the tribes of Israel   ": null
    },
    {
        "Priestly breastplate": "priestly breastplate"
    },
    {
        " : with twelve gems, each engraved with the name of one of the tribes; a pouch in which he probably carried the ": null
    },
    {
        "Urim and Thummim": "urim and thummim"
    },
    {
        ". It was fastened to the Ephod   On the front of the turban was a ": null
    },
    {
        "golden plate": "tzitz"
    },
    {
        " inscribed with the words: Holiness unto ": null
    },
    {
        "YHWH": "yhwh"
    },
    {
        " attached to the mitznefet.     The high priest, like all priests, would minister barefoot when he was serving in the Temple. Like all of the priests, he had to immerse himself in the ": null
    },
    {
        "ritual bath": "mikvah"
    },
    {
        " before vesting and wash his hands and his feet before performing any sacred act. The ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " teaches that neither the kohanim nor the Kohen Gadol were fit to minister unless they wore their priestly vestments: While they are clothed in the priestly garments, they are clothed in the priesthood; but when they are not wearing the garments, the priesthood is not upon them . It is further taught that just as the ": null
    },
    {
        "sacrifices": "korbanot"
    },
    {
        " facilitate an ": null
    },
    {
        "atonement": "atonement in judaism"
    },
    {
        " for ": null
    },
    {
        "sin": "sin"
    },
    {
        ", so do the priestly garments . The high priest had two sets of holy garments: the golden garments detailed above, and a set of white linen garments  which he wore only on ": null
    },
    {
        "the Day of Atonement": "yom kippur"
    },
    {
        " . On that day, he would change his holy garments four times, beginning in the golden garments but changing into the Linen Garments for the two moments when he would enter the ": null
    },
    {
        "Holy of Holies": "holy of holies"
    },
    {
        " , and then change back again into the golden garments after each time. He would immerse in the ritual bath before each change of garments, washing his hands and his feet after removing the garments and again before putting the other set on. The linen garments were only four in number, those corresponding to the garments worn by all priests , but made only of white linen, with no embroidery. They could be worn only once, new sets being made each year.          In every generation when the Temple was standing, one kohen would be singled out to perform the functions of the High Priest . His primary task was the ": null
    },
    {
        "Day of Atonement": "yom kippur"
    },
    {
        " service. Another unique task of the high priest was the offering of a daily meal sacrifice; he also held the prerogative to supersede any priest and offer any offering he chose. Although the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " retains a procedure to select a High Priest when needed, in the absence of the Temple in Jerusalem, there is no High Priest in Judaism today.          ": null
    },
    {
        "King David": "david"
    },
    {
        " assigned each of the 42 priestly clans to a weekly watch  during which its members were responsible for maintaining the schedule of offerings at the Temple in Jerusalem, in accordance with . Prior to that time, the priestly courses numbered a mere eight. This newly instated a cycle of priestly courses, or ": null
    },
    {
        "priestly divisions": "priestly divisions"
    },
    {
        ", which repeated itself roughly twice each year.     When the ": null
    },
    {
        "First": "solomons temple"
    },
    {
        " and ": null
    },
    {
        "Second": "second temple"
    },
    {
        " Temples were built, the priests of Aarons lineage assumed these roles in the Temple in Jerusalem. Each of the 42 groups consisted of six priestly families, with each of the six serving one day of the week. On the ": null
    },
    {
        "Sabbath": "shabbat"
    },
    {
        " day, all six worked in tandem. According to later rabbinical interpretation, these 42 groups changed every Sabbath at the completion of the ": null
    },
    {
        "Mussaf": "mussaf"
    },
    {
        " service.. However, on the biblical festivals all 42 were present in the Temple for duty.     According to the Jerusalem Talmud : Four wards came up out of exile: Yedaiah, Harim, Pašḥūr and Immer. The prophets among them had made a stipulation with them, namely, that even if Jehoiariv should come up out of exile, the officiating ward that serves in the Temple at that time should not be rejected on his account, but rather, he is to become secondary unto them.       Following the Temples destruction at the end of the ": null
    },
    {
        "First Jewish Revolt": "first jewish revolt"
    },
    {
        " and the displacement to the ": null
    },
    {
        "Galilee": "galilee"
    },
    {
        " of the bulk of the remaining Jewish population in ": null
    },
    {
        "Judea": "judea"
    },
    {
        " at the end of the ": null
    },
    {
        "Bar Kochva": "bar kochva"
    },
    {
        " Revolt, Jewish tradition in the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " and poems from the period record that the descendants of each priestly watch established a separate residential seat in towns and villages of the Galilee, and maintained this residential pattern for at least several centuries in anticipation of the reconstruction of the Temple and reinstitution of the cycle of priestly courses. Specifically, this kohanic settlement region stretched from the ": null
    },
    {
        "Beit Netofa Valley": "beit netofa valley"
    },
    {
        ", through the ": null
    },
    {
        "Nazareth": "nazareth"
    },
    {
        " region to ": null
    },
    {
        "Arbel": "arbel"
    },
    {
        " and the vicinity of ": null
    },
    {
        "Tiberias": "tiberias"
    },
    {
        ". In subsequent years, there was a custom of publicly recalling every Sabbath in the synagogues the courses of the priests, a practice that reinforced the prestige of the priests lineage. Robert Bonfil, Jews in Byzantium: Dialectics of Minority and Majority Cultures, Brill: Leiden 42 p. 42      Professor Yosef Tobi, describing a stone inscription found in Yemen and which contains a partial list of the names of the twenty-four priestly courses and their places of residence, writes: Proceedings of the Seminar for Arabian Studies, 42 : British Museum, London; Article, The Jews of Yemen in light of the excavation of the Jewish synagogue in Qanī’, p. 42 by Yosef Tobi. As for the probable strong spiritual attachment held by the Jews of Ḥimyar for the Land of Israel, this is also attested to by an inscription bearing the names of the miśmarōṯ , which was initially discovered in September 42 by ": null
    },
    {
        "W. Müller": "walter w. müller"
    },
    {
        " and then, independently, by P. Grjaznevitch within a mosque in Bayt al-Ḥāḍir, a village situated near Tan‘im, east of Ṣanʻā’. This inscription has been published by several European scholars, but the seminal study was carried out by ": null
    },
    {
        "E.E. Urbach": "ephraim urbach"
    },
    {
        " , one of the most important scholars of rabbinic literature in the previous generation. Ephraim E. Urbach, Mishmarot u-maʻamadot, Tarbiz 42 Jerusalem 42 pp. 42 – 42 The priestly wards were seen as one of the most distinctive elements in the collective memory of the Jewish people as a nation during the period of Roman and Byzantine rule in the Land of Israel following the destruction of the Second Temple, insofar as they came to symbolize Jewish worship within the Land.     It is now uncertain when this stone inscription was first engraved, but certainly it dates back to a time near the Second Temple’s destruction. The complete list of sacerdotal names would normally have included twenty-four priestly wards. However, today, the stone inscription contains only a partial list of their names, with their former places of residence – beginning from the fourth ward, and ending with the fourteenth ward. This was because the stone had been partially broken away, as also part of which was hidden underground. This is the longest roster of names of this kind ever discovered unto this day: Several reconstructions of the stone inscription have since been made. Compare also the reconstruction as was published by Shalom Medina in the journal, Afikim, 42 Tel-Aviv, 42/42 pp. 42–42                   Although kohanim may assume their duties once they reached physical maturity, the fraternity of kohanim generally would not allow young kohanim to begin service until they reached the age of twenty, Talmud Bavli Hullin 42b, ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " Yad": "mishneh torah"
    },
    {
        ", Hilchoth Klei HaMiqdash 42:42 and some opinions state that this age was thirty. ": null
    },
    {
        "Chizkuni": "chizkuni"
    },
    {
        " to Devarim chapter 42 There was no mandatory retirement age. Only when a kohen became physically infirm could he no longer serve. T.B. ibid., and ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " Yad": "mishneh torah"
    },
    {
        ", Hilchoth Biath HaMiqdash 42:42 and Hilchoth Klei HaMiqdash 42:42   A kohen may become disqualified from performing his service for a host of reasons, including, but not limited to, ": null
    },
    {
        "Tumah": "tumah"
    },
    {
        ", marital defilements, and physical blemishes. Of importance is that the kohen is never permanently disqualified from service but is permitted to return to his normal duties once the disqualification ceases.          The kohanim were compensated for their service to the nation and in the Temple through the ": null
    },
    {
        "twenty-four kohanic gifts": "twenty-four kohanic gifts"
    },
    {
        ".  Of these 42 gifts, 42 are listed as to be given even outside the land of Israel. An example of the gifts given to the kohen in the Diaspora are most notably the five ": null
    },
    {
        "shekel": "shekel"
    },
    {
        "s of the ": null
    },
    {
        "Pidyon haben": "pidyon haben"
    },
    {
        " ceremony, and the ": null
    },
    {
        "giving of the foreleg, cheeks and abomasum": "giving of the foreleg, cheeks and abomasum"
    },
    {
        " from each Kosher-slaughtered animal. Although due to the high cost of these parts of beef, halakhic leniency are often sought to avoid their actual giving – see linked page for history detail.               Torah verses and rabbinical commentary to the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        " imply that the kohen has a unique leadership role amongst the nation of Israel. In addition to the well-known role of the kohen to officiate in the sacrificial activity in the Temple , the kohen is presumed to have the responsibility of being knowledgeable in the laws and nuances of the Torah and to be able to give accurate instruction in those laws to the Jewish people.     ": null
    },
    {
        "Rabbi Samson Raphael Hirsch": "rabbi samson raphael hirsch"
    },
    {
        " explains this responsibility as not being the exclusive Torah instructors, but working in tandem with the rabbinic leaders of the era, rabbi s.r. hirsch to chumash while other rabbinic greats – notably the ": null
    },
    {
        "Chasam Sofer": "chasam sofer"
    },
    {
        " and ": null
    },
    {
        "Maharitz Chayes": "maharitz chayes"
    },
    {
        " – acknowledged a unique assignment of torah instruction to the descendants of Aaron.       After the destruction of the Second Temple and the suspension of sacrificial offerings, the formal role of priests in sacrificial services came to an end temporarily . Kohanim, however, retain a formal and public ceremonial role in synagogue prayer services. Kohanim also have a limited number of other special duties and privileges in Jewish religious practice. These special roles have been maintained in ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        ", and sometimes in ": null
    },
    {
        "Conservative Judaism": "conservative judaism"
    },
    {
        ". ": null
    },
    {
        "Reform Judaism": "reform judaism"
    },
    {
        " does not afford any special status or recognition to kohanim.     aliyah ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " in Orthodox ": null
    },
    {
        "synagogue": "synagogue"
    },
    {
        "s , a portion from the Torah is read aloud in the original ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " in front of the congregation. On weekdays, this reading is divided into three; it is customary to call a kohen for the first reading , a Levite for the second reading, and a member of any other Tribe of Israel to the third reading. On Shabbat, the reading is divided into seven portions; a kohen is called for the first aliyah and a levite to the second, and a member of another tribe for the rest.     If a kohen is not present, it is customary in many communities for a levite to take the first aliyah bimkom kohen and an Israelite the second and succeeding ones. This custom is not required by ": null
    },
    {
        "halakha": "halakha"
    },
    {
        " , however, and Israelites may be called up for all aliyot.     In the late 42th and early 42th century, Rabbi ": null
    },
    {
        "Meir of Rothenburg": "meir of rothenburg"
    },
    {
        " ruled that, in a community consisting entirely of kohanim, the prohibition on calling kohanim for anything but the first two and maftir aliyot creates a deadlock situation which should be resolved by calling women to the Torah for all the intermediate aliyot.     The ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        " Rabbinical Assembly": "rabbinical assembly"
    },
    {
        "s ": null
    },
    {
        "Committee on Jewish Law and Standards": "committee on jewish law and standards"
    },
    {
        " , consistent with the Conservative movements general view of the role of kohanim, has ruled that the practice of calling a kohen to the first aliyah represents a custom rather than a law, and that accordingly, a Conservative rabbi is not obligated to follow it. As such, in some Conservative synagogues, this practice is not followed.                The kohanim participating in an Orthodox and some other styles of traditional Jewish prayer service also deliver the priestly blessing, in Hebrew called nesiat kapayim during the repetition of the  Shemoneh Esrei . The text of this blessing is found in  They perform this service by standing and facing the crowd in the front of the congregation, with their arms held outwards and their hands and fingers in a specific formation, with a Jewish prayer shawl or ": null
    },
    {
        "Talit": "talit"
    },
    {
        " covering their heads and outstretched hands so that their fingers cannot be seen. In those congregation where the ": null
    },
    {
        "Minhag": "minhag"
    },
    {
        " is to give the blessing during the week; with five openings , traditionally linked to the verse in ": null
    },
    {
        "Song of Songs": "song of songs"
    },
    {
        " , where it is said that God peeks through the latticework, or the cracks in the wall. However, on Shabbot and Yom Tov it is customary to spread all fingers apart. Kohanim living in Israel and many Sephardic Jews living in areas outside Israel deliver the priestly blessing daily; Ashkenazi Jews living outside Israel deliver it only on Jewish holidays. Of biblical origin. Customs vary as to whether the blessing is delivered outside Israel on a holy day when it falls on Shabbat.          Outside the synagogue, the kohen leads the Pidyon Haben ceremony. This symbolic Redemption of the first-born son is based on the Torah commandment, and you shall redeem all the firstborn of man among your sons .        ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        " recognizes the rules regulating marriage for Jews of priestly stock as being in full force. Rabbinic courts will uphold the laws and will not officiate in a marriage that involves a man who is a Kohen and a Jewish woman who is divorced from an earlier marriage. Areas where Orthodox approaches may create different results include situations where a woman has been raped, kidnapped or held hostage, descendants of converts whose Judaism status turned out to be subject to doubt, ambiguous prior dating histories, and other potentially ambiguous or difficult situations.     A priest of Aarons lineage is forbidden by the Mosaic Law to marry a divorced woman even if she were a native Israelite. Likewise, a male descendant from Aarons line is prohibited to marry a Jewish woman who has had intercourse with a non-Jew, whether she had been raped or she had willfully done so. So, too, he cannot marry a Jewish woman whose birth was by a father who is a Kohen but who violated one of these prohibitions. If he went ahead and did one of these three things, his male issue born from such union is no longer a priest , but rather becomes a Ḥallal - a term designating one who is no longer a priest, but profaned. A priest must maintain an untainted lineage, and his mother must be of Jewish birth. If he married a non-Jewish woman from the gentile nations, his children are no longer priests, but gentiles. Had a priest of Aarons lineage transgressed this prohibition and married a divorced woman, and they had children together, all of his female issue - whether his, or his sons, or his grandchildren - would be prohibited from marrying into the priestly stock for all generations. Yishmael Tanuji Ha-Kohen, Sefer Ha-zikaron, London 42     Rape poses an especially poignant problem. The pain experienced by the families of kohanim who were required to divorce their wives as the result of the rapes accompanying the capture of Jerusalem is alluded to in this Mishnah:     If a woman were imprisoned by non-Jews concerning money affairs, she is permitted to her husband, but if for some capital offense, she is forbidden to her husband. If a town were overcome by besieging troops, all women of priestly stock found in it are ineligible but if they had witnesses, even a slave, or even a bondswoman, these may be believed. But no man may be believed for himself. Rabbi Zechariah ben Hakatsab said, By this Temple, her hand did not stir from my hand from the time the non-Jews entered Jerusalem until they went out. They said to him: No man may give evidence of himself. ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        " Ketubot": "ketubot"
    },
    {
        " 42:42       The Israeli rabbinate will not perform a marriage halakhically forbidden to a kohen. For example, a kohen cannot legally marry a divorced or converted woman in the ": null
    },
    {
        "State of Israel": "state of israel"
    },
    {
        ", although a foreign marriage would be recognized.       ": null
    },
    {
        "Conservative Judaism": "conservative judaism"
    },
    {
        " has issued an emergency takanah temporarily suspending the application of the rules in their entirety, on the grounds that the high intermarriage rate threatens the survival of Judaism, and hence that any marriage between Jews is welcomed. The takanah declares that the offspring of such marriages are to be regarded as kohanim. The movement allows a kohen to marry a convert or divorcee for these reasons:   Since the Temple in Jerusalem is no longer extant and korbanot should not be restored, kohanim are no longer able to perform Temple services in a state of ritual purity.   Because the intermarriage crisis among American Jewry is an extreme situation, the Conservative movement feels it must support the decision of two Jews to marry.              Kohen was a status that traditionally referred to men, passed from father to son, although there were situations where a bat kohen, daughter of a kohen, enjoyed some special status. For example, the first-born son of a bat kohen, or the first-born son of a bat levi  did not require the ritual of  Pidyon HaBen .      In addition, females, although they did not serve in the Tabernacle or the Temple, were permitted to eat or benefit from some of the 42 kohanic gifts. However, if a ": null
    }
]