[
    {
        "In ": null
    },
    {
        "Hawaiian mythology": "hawaiian mythology"
    },
    {
        ", the Kupua are a group of supernatural entities which might be considered gods or spirits.     ": null
    },
    {
        "Hawaii": "hawaii"
    },
    {
        "an ": null
    },
    {
        "myth": "mythology"
    },
    {
        "s and ": null
    },
    {
        "legend": "legend"
    },
    {
        "s abound with such characters. They are traditionally described as ": null
    },
    {
        "monster": "monster"
    },
    {
        "s having the power of appearing in different kinds of bodies. They usually have cruel and vindictive characters and are ready to destroy and devour any persons they can catch. There are, however, many kupuas of kindly spirit who give watchful care to the members of their own families.     Many Hawaiian kupua are considered as gods having a double body, sometimes appearing as a man and sometimes being able to change shape, into an animal, vegetable, or mineral form. The latter form always possesses supernatural powers. ": null
    },
    {
        "William Westervelt": "william westervelt"
    },
    {
        " mentions the following classification for kupua:   Ka-poe-kino-lau   Ka-poe-kino-pua   Ka-poe-kino-manu   Ka-poe-kino-laau   Ka-poe-kino-pupu   Ka-poe-kino-ao   Ka-poe-kino-maani   Ka-poe-kina-ia   Ka-poe-kina-mano   Ka-poe-kina-limu   Ka-poe-kina-pokaku   Ka-poe-kina-hiwa-hiwa       ": null
    },
    {
        "Mamala": "mamala"
    },
    {
        " the surf-rider was a chiefess of kupua character. She is described as a ": null
    },
    {
        "moo": "moo"
    },
    {
        ", or gigantic ": null
    },
    {
        "lizard": "lizard"
    },
    {
        " or ": null
    },
    {
        "crocodile": "crocodile"
    },
    {
        ", as well as a beautiful woman. She could assume whichever shape she most desired. One of the legends says that she was a ": null
    },
    {
        "shark": "shark"
    },
    {
        " and woman.     In an old ": null
    },
    {
        "Honolulu": "honolulu"
    },
    {
        " legend, a kupua who is a dog-man overthrows the government of Kahanai and becomes the ruling power between Nuuanu Valley and the sea. He is a ": null
    },
    {
        "cannibal": "cannibal"
    },
    {
        " and many of the people are killed and eaten by him. He can appear at will either as a man or a dog.     In ": null
    },
    {
        "Maui": "maui"
    },
    {
        ", the king once had a kupua, a ": null
    },
    {
        "rooster": "rooster"
    },
    {
        ", which was very cruel and destructive. He could assume a different bird form for each magic power he possessed. This, with his miraculous human powers, made him superior to all the roosters which had ever been his antagonists in ": null
    },
    {
        "cock-fighting": "cock-fighting"
    },
    {
        ".     In ": null
    },
    {
        "Kauai": "kauai"
    },
    {
        ", Akua-pehu-ale was a kupua who devoured his enemies and was greatly feared and hated even by his own tribe.     In the legend of the ": null
    },
    {
        "bread-fruit": "bread-fruit"
    },
    {
        " tree, ": null
    },
    {
        "Papa": "rangi and papa"
    },
    {
        ", one of the ancestors of the people living in all the islands now known as ": null
    },
    {
        "Polynesia": "polynesia"
    },
    {
        ", is described as a kupua. Her daughter Kap-ula-kinau also has kupua, or magic power.     Other Hawaiian kupua mentioned in the mythology include the famous trickster ": null
    },
    {
        "Māui": "māui"
    },
    {
        ", ": null
    },
    {
        "Iwa": "iwa"
    },
    {
        ", ": null
    },
    {
        "Ono": "ono"
    },
    {
        " and ": null
    },
    {
        "Pekoi": "pekoi"
    },
    {
        ". See also ": null
    },
    {
        "Apukohai": "apukohai"
    }
]