[
    {
        "Kuurne is a ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "West Flanders": "west flanders"
    },
    {
        ". The municipality comprises only the town of Kuurne proper. On January 42 42 Kuurne had a total population of 42. The total area is 42  km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km². The ": null
    },
    {
        "Leie": "leie"
    },
    {
        " functions as a natural border between Kuurne and ": null
    },
    {
        "Harelbeke": "harelbeke"
    },
    {
        ".     Inhabitants from Kuurne are nicknamed donkeys. This is said to be a term of derision given to them by the people of nearby ": null
    },
    {
        "Kortrijk": "kortrijk"
    },
    {
        " because traders from Kuurne habitually set off for the Kortrijk market at an early hour, their ass-drawn carts laden with vegetables. Awoken by the rattle of the cart wheels and the braying of the asses, the people of Kortrijk exclaimed: Its those asses from Kuurne again!     An alternative, more legendary explanation originates from the tale of a priest who had to hold a funeral on ": null
    },
    {
        "Ash Wednesday": "ash wednesday"
    },
    {
        ". He asked the ": null
    },
    {
        "sacrister": "sacrister"
    },
    {
        " to take over his regular service, but the latter couldnt remember the Latin words Memento, homo, quia pulvis es, et in pulverem reverteris , which are to be proclaimed while applying a cross of ash to the foreheads of the churchgoers. Later the priest spoke to him in exasperation, saying: You were born an ass, and you will die an ass! Aha, said the sacrister, Ill remember that! and so saying, he continued giving the people of Kuurne their crosses of ash.     The best-known donkey in Kuurne is Ambroos , a larger-than-life and somewhat stylised statue in front of the ": null
    },
    {
        "town hall": "town hall"
    },
    {
        ". The winner of the annual pro ": null
    },
    {
        "cycling": "cycling"
    },
    {
        " race ": null
    },
    {
        "Kuurne–Brussels–Kuurne": "kuurne–brussels–kuurne"
    },
    {
        " received a big bouquet and a soft toy version of Ambroos to wave from the stage.        ": null
    },
    {
        "Kuressaare": "kuressaare"
    },
    {
        ", Estonia    ": null
    },
    {
        "Chiuza": "chiuza"
    },
    {
        ", Romania    ": null
    },
    {
        "Marcq-en-Baroeul": "marcq-en-baroeul"
    }
]