[
    {
        "        Kálmán Kalocsay  was a ": null
    },
    {
        "Hungarian": "hungary"
    },
    {
        " Esperantist": "esperantist"
    },
    {
        " poet, translator and editor who considerably influenced Esperanto culture, both in its literature and in the language itself, through his original poetry and his translations of literary works from his native ": null
    },
    {
        "Hungarian": "hungarian language"
    },
    {
        " and other languages of Europe. His name is sometimes Esperantized as Kolomano Kaloĉajo, and some of his work was published under various pseudonyms, including C.E.R. Bumy, Kopar, Alex Kay, K. Stelov, Malice Pik and Peter Peneter.     Kalocsay studied medicine and later became a surgeon and the chief infectious disease specialist at a major Budapest hospital. He learned both ": null
    },
    {
        "Esperanto": "esperanto"
    },
    {
        " and its breakaway dialect ": null
    },
    {
        "Ido": "ido"
    },
    {
        " in his adolescence but became more inclined towards Esperanto after he had seen its greater literary potential. In 42 his first original collection of poems, Mondo kaj Koro was published. A further decade passed before the appearance of his collection Streĉita Kordo , which many Esperantists consider as one of the finest collections of original Esperanto poetry, and Rimportretoj , witty poems in ": null
    },
    {
        "rondel": "rondel"
    },
    {
        " style about various people then prominent in the Esperanto movement. In 42 under the pseudonym Peter Peneter, he published Sekretaj Sonetoj , a book of erotic verse.     Kalocsay guided the Esperanto literary world through the magazine and publishing house called Literaturo Mondo . A group of writers who coalesced around this magazine during the 42s and 42s was known as the Budapeŝto skolo .     Works of Kalocsay about literary and linguistic theory include the expansive Plena Gramatiko de Esperanto and Parnasa Gvidlibro , a work on Esperanto poetics co-authored with ": null
    },
    {
        "Gaston Waringhien": "gaston waringhien"
    },
    {
        ", and an academic ": null
    },
    {
        "style guide": "style guide"
    },
    {
        " for Esperanto, Lingvo – Stilo – Formo . Kalocsay also co-compiled the two-volume  Enciklopedio de Esperanto  .     Much was written about Kalocsay by his literary executor ": null
    },
    {
        "Ada Csiszár": "ada csiszár"
    },
    {
        ", after whose death the estate passed to the ": null
    },
    {
        "Esperanto museum of the Austrian National Library": "department of planned languages and esperanto museum"
    }
]