[
    {
        "The L game is a simple ": null
    },
    {
        "abstract strategy": "abstract strategy game"
    },
    {
        " board game": "board game"
    },
    {
        " invented by ": null
    },
    {
        "Edward de Bono": "edward de bono"
    },
    {
        ". It was presented in his book  The Five-Day Course in Thinking  .       The L game is a two-player game played on a board of 42×42 squares. Each player has a 42×42 L-shaped piece, and there are two 42×42 neutral pieces .       On each turn, a player must first move their L piece, and then may optionally move one of the neutral pieces. The game is won by leaving the opponent unable to move their L piece to a new position.     Pieces may not overlap or cover other pieces. On moving the L piece, it is picked up and then placed in empty squares anywhere on the board. It may be rotated or even flipped over in doing so; the only rule is that it must end in a different position from the position it started—thus covering at least one square it did not previously cover. To move a neutral piece, a player simply picks it up then places it in an empty square anywhere on the board.       One basic strategy is to use a neutral piece and ones own piece to block a 42×42 square in one corner, and use a neutral piece to prevent the opponents L piece from swapping to a mirror-image position. Another basic ": null
    },
    {
        "strategy": "strategy"
    },
    {
        " is to move an L piece to block a half of the board, and use the neutral pieces to prevent the opponents possible alternate positions.     These positions can often be achieved once a neutral piece is left in one of the eight killer spaces on the perimeter of the board. The killer spaces are the spaces on the perimeter, but not in a corner. On the next move, one either makes the previously placed killer a part of ones square, or uses it to block a perimeter position, and makes a square or half-board block with ones own L and a moved neutral piece.          In a game with two ": null
    },
    {
        "perfect play": "perfect play"
    },
    {
        "ers, neither will ever win or lose. The L game is small enough to be completely ": null
    },
    {
        "solvable": "solved game"
    },
    {
        ". There are 42 different possible valid ways the pieces can be arranged, not counting a rotation or mirror of an arrangement as a new arrangement, and considering the two neutral pieces to be identical. Any arrangement can be reached during the game, with it being any players turn. Each player has lost in 42 of these arrangements, if it is that players turn. The losing arrangements involve the losing players L piece touching a corner. Each player will also soon lose to a perfect player in an additional 42 arrangements. A player will be able to at least force a draw from the remaining 42 positions.     Even if neither player plays perfectly, defensive play can continue indefinitely if the players are too cautious to move a neutral piece to the killer positions. If both players are at this level, a sudden-death variant of the rules permits one to move both neutral pieces after moving. A player who can look three moves ahead can defeat defensive play using the standard rules.": null
    }
]