[
    {
        "   LArgent is the eighteenth novel in the ": null
    },
    {
        "Rougon-Macquart": "les rougon-macquart"
    },
    {
        " series by ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        ". It was serialized in the periodical  Gil Blas  beginning in November 42 before being published in novel form by Charpentier et Fasquelle in March 42     The novel focuses on the financial world of the ": null
    },
    {
        "Second French Empire": "second french empire"
    },
    {
        " as embodied in the ": null
    },
    {
        "Paris": "paris"
    },
    {
        " Bourse": "paris bourse"
    },
    {
        " and exemplified by the fictional character of Aristide Saccard. Zolas intent was to show the terrible effects of ": null
    },
    {
        "speculation": "speculation"
    },
    {
        " and fraudulent company promotion, the culpable negligence of company directors, and the impotency of contemporary financial laws.     Aristide Saccard is the youngest son of Pierre and Félicité Rougon. He is first introduced in  La fortune des Rougon . Largent is a direct sequel to  La curée  , which details Saccards first rise to wealth using underhanded methods. Sensing his unscrupulous nature, his brother Eugène Rougon prompts Aristide to change his surname from Rougon to Saccard.     Aristides other brother Pascal is the main character of  Le docteur Pascal . He also has two sisters: Sidonie, who appears in La curée, and Marthe, one of the protagonists of  La conquête de Plassans .         The novel takes place in 4242 beginning a few months after the death of Saccards second wife Renée . Saccard is ": null
    },
    {
        "bankrupt": "bankruptcy"
    },
    {
        " and an outcast among the Bourse ": null
    },
    {
        "financier": "financier"
    },
    {
        "s. Searching for a way to reestablish himself, Saccard is struck by plans developed by his upstairs neighbor, the engineer Georges Hamelin, who dreams of restoring ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " to the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        " through great public works: rail lines linking important cities, improved roads and transportation, renovated eastern ": null
    },
    {
        "Mediterranean": "mediterranean sea"
    },
    {
        " ports, and fleets of modern ships to move goods around the world.     Saccard decides to institute a financial establishment to fund these projects. He is motivated primarily by the potential to make incredible amounts of money and reestablish himself on the Bourse. In addition, Saccard has an intense rivalry with his brother Eugène Rougon, a powerful Cabinet minister who refuses to help him after his bankruptcy and who is promoting a more liberal, less ": null
    },
    {
        "Catholic": "roman catholic church"
    },
    {
        " agenda for the Empire. Furthermore, Saccard, an intense ": null
    },
    {
        "anti-Semite": "antisemitism"
    },
    {
        ", sees the enterprise as a strike against the ": null
    },
    {
        "Jew": "jew"
    },
    {
        "ish bankers who dominate the Bourse.   From the beginning, Saccards Banque Universelle stands on shaky ground. In order to manipulate the price of the stock, Saccard and his confreres on the syndicate he has set up to jumpstart the enterprise buy their own stock and hide the proceeds of this illegal practice in a dummy account fronted by a ": null
    },
    {
        "straw man": "straw man"
    },
    {
        ".     While Hamelin travels to ": null
    },
    {
        "Constantinople": "istanbul"
    },
    {
        " to lay the groundwork for their enterprise, the Banque Universelle goes from strength to strength. Stock prices soar, going from 42 francs a share to more than 42 francs in three years. Furthermore, Saccard buys several newspapers which serve to maintain the illusion of legitimacy, promote the Banque, excite the public, and attack Rougon.     The novel follows the fortunes of about 42 characters, cutting across all social strata, showing the effects of stock market speculation on rich and poor. The financial events of the novel are played against Saccards personal life. Hamelin lives with his sister Caroline, who, against her better judgment, invests in the Banque Universelle and later becomes Saccards mistress. Caroline learns that Saccard fathered a son, Victor, during his first days in Paris. She rescues Victor from his life of abject poverty, placing him in a charitable institution. But Victor is completely unredeemable, given over to greed, laziness, and thievery. After he attacks one of the women at the institution, he disappears into the streets, never to be seen again.     Eventually, the Banque Universelle cannot sustain itself. Saccards principal rival on the Bourse, the Jewish financier Gundermann, learns about Saccards financial trickery and attacks, losing stock upon the market, devaluing its price, and forcing Saccard to buy millions of shares to keep the price up. At the final collapse, the Banque holds one-fourth of its own shares worth 42 million francs. The fall of the Banque is felt across the entire financial world. Indeed, all of France feels the force of its collapse. The effects on the characters of Largent are disastrous, including complete ruin, suicide, and exile, though some of Saccards syndicate members escape and Gundermann experiences a windfall. Saccard and Hamelin are sentenced to five years in prison. Through the intervention of Saccards brother Eugène Rougon, who doesnt want a brother in jail, their sentences are commuted and they are forced to leave France. Saccard goes to ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ", and the novel ends with Caroline preparing to follow her brother to ": null
    },
    {
        "Rome": "rome"
    },
    {
        ".       Because the financial world is closely linked with politics, L’argent encompasses many historical events, including:   The 42 ": null
    },
    {
        "Druze": "druze"
    },
    {
        " massacre of ": null
    },
    {
        "Maronite Christians": "maronite church"
    },
    {
        " in ": null
    },
    {
        "Syria": "syria"
    },
    {
        " invasion": "french intervention in mexico"
    },
    {
        " of ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        "   The construction of the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        ", opened in 42   The ": null
    },
    {
        "Austro-Prussian War": "austro-prussian war"
    },
    {
        ", including the ": null
    },
    {
        "Battle of Königgrätz": "battle of königgrätz"
    },
    {
        " at ": null
    },
    {
        "Sadowa": "sadová"
    },
    {
        " in 42   The ": null
    },
    {
        "Third Italian War of Independence": "third italian war of independence"
    },
    {
        "   The ": null
    },
    {
        "Universal Exposition": "exposition universelle"
    },
    {
        " of 42   The publication of  Das Kapital  in 42 and the advent of ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        "      By the end of the novel, the stage is set for the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        " and the fall of the Second Empire.         Zolas plan for the Rougon-Macquart novels was to show how ": null
    },
    {
        "heredity": "heredity"
    },
    {
        " and environment worked on members of one family over the course of the ": null
    },
    {
        "Second Empire": "second french empire"
    },
    {
        ". All of the descendants of Adelaïde Fouque , Saccards grandmother, demonstrate what today would be called ": null
    },
    {
        "obsessive-compulsive": "obsessive-compulsive disorder"
    },
    {
        " behaviors to varying degrees. Saccard is obsessed with money and the building of wealth, to which everything in his life holds second place. In Le docteur Pascal, Zola describes the influence of heredity on Saccard as an adjection in which the natures of his avaricious parents are commingled.     Two other members of the Rougon-Macquart family also appear in Largent: Saccards sons Maxime and Victor . If his fathers obsession is with building wealth, Maximes obsession is with keeping it. A widower, Maxime  lives alone in opulence he does not share. In Le docteur Pascal, Maxime is described as prematurely aged, afraid of pleasure and indeed of all life, devoid of emotion, and cold, characteristics introduced in Largent. Maxime is described as a dissemination of characteristics, having the moral prepotency of his father and the pampered ": null
    },
    {
        "egotism": "egotism"
    },
    {
        " of his mother .     Victor, on the other hand, brought up in squalor, is the furthest extreme Zola illustrates of the Rougon familys degeneracy. Like his great-grandmother Tante Dide, Victor suffers from ": null
    },
    {
        "neuralgic": "neuralgia"
    },
    {
        " attacks. Unlike Jacques Lantier , he is unable to control his criminal impulses, and his disappearance into the streets of Paris is no surprise. Victor is described as a fusion of the lowest characteristics of his parents .     In Le docteur Pascal , Zola tells us that Saccard returns to Paris, institutes a newspaper, and is again making piles of money.     Rougon is the protagonist of  Son Excellence Eugène Rougon , the events of which predate Largent. Saccards daughter Clotilde is the main female character in Le docteur Pascal.       LArgent has had the following translations into English:   Money, translated by ": null
    },
    {
        "Benjamin Tucker": "benjamin tucker"
    },
    {
        ", 42   Money, translated by ": null
    },
    {
        "Ernest A. Vizetelly": "ernest a. vizetelly"
    },
    {
        ", 42   Money, translated by Valerie Minogue, 42 published by ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        " in their Oxford Worlds Classics series       In 42 a ": null
    },
    {
        "silent film": "silent film"
    },
    {
        " adaptation of  LArgent  was directed by ": null
    },
    {
        "Marcel LHerbier": "marcel lherbier"
    },
    {
        ". It used only the skeleton of the plot and it updated the setting to Paris in the 42s.   The 42 French film  LArgent  was directed by ": null
    },
    {
        "Pierre Billon": "pierre billon"
    },
    {
        ".   A three-part television adaptation of the book was directed by ": null
    },
    {
        "Jacques Rouffio": "jacques rouffio"
    }
]