[
    {
        "   La Curée  is the 42nd novel in ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        "s 42-volume series ": null
    },
    {
        "Les Rougon-Macquart": "les rougon-macquart"
    },
    {
        ". It deals with property speculation and the lives of the extremely wealthy ": null
    },
    {
        "Nouveau riche": "nouveau riche"
    },
    {
        " of the ": null
    },
    {
        "Second French Empire": "second french empire"
    },
    {
        ", against the backdrop of ": null
    },
    {
        "Baron Haussmann": "baron haussmann"
    },
    {
        "s reconstruction of ": null
    },
    {
        "Paris": "paris"
    },
    {
        " in the 42s and 42s.     Vastly different from its predecessor and prequel  La Fortune des Rougon , La Curée - the portion of the game thrown to the dogs after a hunt, and thus usually translated as The Kill - is a character study of three personalities: Aristide Rougon --the youngest son of the ruthless and calculating ": null
    },
    {
        "peasant": "peasant"
    },
    {
        " Pierre Rougon and the ": null
    },
    {
        "bourgeois": "bourgeois"
    },
    {
        " Félicité , both of them ": null
    },
    {
        "Bonapartistes": "bonapartism"
    },
    {
        " and consumed by a ": null
    },
    {
        "desire for wealth": "greed"
    },
    {
        ", Aristides young second wife Renée and Maxime, Aristides foppish son from his first marriage.          The book opens with scenes of astonishing opulence, beginning with Renée and Maxime lazing in a luxurious ": null
    },
    {
        "horse-drawn carriage": "horse-drawn carriage"
    },
    {
        ", very slowly leaving a Parisian park  in the 42th century-equivalent of a ": null
    },
    {
        "traffic jam": "traffic jam"
    },
    {
        ". It is made clear very early on that these are staggeringly wealthy characters not subject to the cares faced by the public; they arrive at their mansion and spend hours being dressed by their servants prior to hosting a banquet attended by some of the richest people in Paris. There seems to be almost no continuity between this scene and the end of the previous novel, until the second chapter begins and Zola reveals that this opulent scene takes place almost fourteen years later. Zola then rewinds time to pick up the story practically minutes after La Fortune des Rougon ended.     Following ": null
    },
    {
        "Eugene Rougon": "eugene rougon"
    },
    {
        "s rise to political power in Paris in La Fortune, his younger brother Aristide, featured in the first novel as a talentless journalist, a comic character unable to commit himself unequivocally to the ": null
    },
    {
        "imperial": "imperialism"
    },
    {
        " cause and thus left out in the cold when the rewards were being handed out, decides to follow Eugene to Paris to help himself to the wealth and power he now believes to be his birthright. Eugene promises to help Aristide achieve these things on the condition that he stay out of his way and change his surname to avoid the possibility of bad publicity from Aristides escapades rubbing off on Eugene and damaging his political chances. Aristide chooses the surname Saccard and Eugene gets him a seemingly mundane job at the city planning permission office. The renamed Saccard soon realises that, far from the disappointment he thought the job would be, he is actually in a position to gain insider information on the houses and other buildings that are to be demolished to build Pariss bold new system of ": null
    },
    {
        "boulevard": "boulevard"
    },
    {
        "s. Knowing that the owners of these properties ordered to be demolished by the city government were compensated handsomely, Saccard contrives to borrow money in order to buy up these properties before their status becomes public and then make massive profits.     Saccard is at first unable to get the money to make his initial investments but then his wife falls victim to a terminal illness. Even while she lies dying in the next room, Saccard is already making arrangements to marry rich girl Renée, who is pregnant and whose family wishes to avoid scandal by offering a huge dowry to any man who will marry her and claim the baby as his own. Saccard accepts and his career in speculation is born. He sends his youngest daughter back home to ": null
    },
    {
        "Plassans": "la conquête de plassans"
    },
    {
        " and packs his older son Maxime off to a Parisian ": null
    },
    {
        "boarding school": "boarding school"
    },
    {
        "; we meet Maxime again when he leaves school several years later and meets his new stepmother Renée, who is at least seven years older.     The flashback complete, the rest of the novel takes place after Saccard has made his fortune, against the backdrop of his luxurious mansion and his profligacy and is concerned with a three-cornered plot of sexual and political intrigue. Renée and Maxime begin a semi-": null
    },
    {
        "incest": "incest"
    },
    {
        "uous love affair, which Saccard suspects but appears to tolerate, perhaps due to the commercial nature of his marriage to Renée. Saccard is trying to get Renée to part with the deeds to her family home, which would be worth millions but which she refuses to give up. The novel continues in this vein with the tensions continuing to mount and culminates in a series of bitter observations by Zola on the ": null
    },
    {
        "hypocrisy": "hypocrisy"
    },
    {
        " and ": null
    },
    {
        "immorality": "immorality"
    },
    {
        " of the nouveau riche.     A near-penniless journalist at the time of writing La Curée, Zola himself had no experience of the scenes he describes. In order to counter this lack, he toured a large number of ": null
    },
    {
        "stately home": "stately home"
    },
    {
        "s around France, taking copious notes on subjects like ": null
    },
    {
        "architecture": "architecture"
    },
    {
        ", ladies and mens fashions, jewellery, ": null
    },
    {
        "garden": "garden"
    },
    {
        " design, ": null
    },
    {
        "greenhouse plants": "greenhouse"
    },
    {
        " , ": null
    },
    {
        "carriage": "carriage"
    },
    {
        "s, ": null
    },
    {
        "mannerism": "mannerism"
    },
    {
        "s, ": null
    },
    {
        "servant": "servant"
    },
    {
        "s ": null
    },
    {
        "liveries": "livery"
    },
    {
        "; these notes were time well spent, as many contemporary observers praised the novel for its ": null
    },
    {
        "realism": "literary realism"
    },
    {
        ".       ": null
    },
    {
        "Speculation": "speculation"
    },
    {
        "   Dissipation": "dissipation"
    },
    {
        "   Sexual": "human sexuality"
    },
    {
        "/": null
    },
    {
        "Gender": "gender"
    },
    {
        " deviance": "paraphilia"
    },
    {
        "   The Rise of a New ": null
    },
    {
        "Bourgeoisie": "bourgeoisie"
    },
    {
        "   The Expiration of the Old ": null
    },
    {
        "Bourgeoisie": "bourgeoisie"
    },
    {
        "   The Attempt to Harness ": null
    },
    {
        "Nature": "nature"
    },
    {
        ", or ": null
    },
    {
        "Instincts": "instincts"
    },
    {
        " Overly-Sated   ": null
    },
    {
        "Gluttony": "gluttony"
    },
    {
        "   Immorality": "immorality"
    },
    {
        "       Aristide Saccard, ": null
    },
    {
        "speculator": "speculator"
    },
    {
        " dandy": "dandy"
    },
    {
        " hunchback": "hunchback"
    },
    {
        " lesbian": "lesbian"
    },
    {
        " couple       The novel was first translated very poorly and with many ": null
    },
    {
        "bowdlerizations": "bowdlerizations"
    },
    {
        " and reissued by ": null
    },
    {
        "Henry Vizetelly": "henry vizetelly"
    },
    {
        " in the 42s and 42s under the title The Rush for the Spoil, with an introduction by ": null
    },
    {
        "George Moore": "george moore"
    },
    {
        ".     An unexpurgated translation by the poet and critic ": null
    },
    {
        "Alexander Texeira de Mattos": "alexander texeira de mattos"
    },
    {
        " was published in a limited edition in 42 under the French title, with an English equivalent  in parentheses. This translation, retitled The Kill upon its 42 reprinting, was the standard English text of the novel for over a century. The critic Graham King remarked that its remarkably timeless tone no doubt acts as a deterrent to a more modern competitor.      In 42 two new English translations by ": null
    },
    {
        "Arthur Goldhammer": "arthur goldhammer"
    },
    {
        "  and ": null
    },
    {
        "Brian Nelson": "brian nelson"
    },
    {
        "  were published to acclaim.       La Curée was adapted in the 42 silent Italian film La cuccagna, directed by ": null
    },
    {
        "Baldassarre Negroni": "baldassarre negroni"
    },
    {
        ".     Director ": null
    },
    {
        "Roger Vadim": "roger vadim"
    },
    {
        " updated the setting to modern-day Paris in the 42 film La Curée, released in English-speaking markets as  The Game Is Over . The film starred ": null
    },
    {
        "Jane Fonda": "jane fonda"
    },
    {
        ", ": null
    },
    {
        "Michel Piccoli": "michel piccoli"
    },
    {
        " and ": null
    },
    {
        "Peter McEnery": "peter mcenery"
    }
]