[
    {
        "La Conquête de Plassans is the fourth novel in ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        "s twenty-volume series ": null
    },
    {
        "Les Rougon-Macquart": "les rougon-macquart"
    },
    {
        ". In many ways a sequel to the first novel in the cycle,  La Fortune des Rougon  , this novel is again centred on the fictional ": null
    },
    {
        "Provençal": "provence"
    },
    {
        " town of ": null
    },
    {
        "Plassans": "aix-en-provence"
    },
    {
        " and its plot revolves around a sinister ": null
    },
    {
        "cleric": "cleric"
    },
    {
        "s attempt at ": null
    },
    {
        "political": "politics"
    },
    {
        " intrigue with disastrous consequences for some of the townsfolk.     At the start of the novel, the home life of ": null
    },
    {
        "Francois Mouret": "francois mouret"
    },
    {
        " and his wife and cousin ": null
    },
    {
        "Marthe": "marthe mouret"
    },
    {
        " is portrayed as a generally pleasant and relaxed existence. Francois is slightly ": null
    },
    {
        "compulsive": "compulsive behavior"
    },
    {
        " in his behaviour and Marthe clearly suffers from some sort of ": null
    },
    {
        "mental illness": "mental illness"
    },
    {
        ", which Zola intended to portray as a ": null
    },
    {
        "genetic consequence": "hereditary disorder"
    },
    {
        " of the Rougon-Macquart familys tangled ancestry. Their three children include the eldest son ": null
    },
    {
        "Octave": "octave mouret"
    },
    {
        ", an intelligent but feckless ladies man , as well as the quiet and introverted younger son Serge and the ": null
    },
    {
        "mentally handicapped": "mental handicap"
    },
    {
        " daughter Desirée. Their home lives are shattered by the arrival of a strange cleric, Abbé Faujas, and his mother, who rent a room in the Mourets house. Slowly, it transpires that the mysterious stranger has arrived to try and win influence in the town for outside political forces through a series of Machiavellian intrigues, plots, slanders and insinuations; in the process of doing so, he proceeds to unravel the Mourets lives to such an extent that the bewildered Francois is unwillingly and unnecessarily committed to a mental institution, while poor Marthe becomes obsessively religious, though whether her devotion is to God or Faujas becomes increasingly unclear. In Mourets absence, and Marthes indifference, Faujas unscrupulous sister Olympe and brother in law Trouche take over the Mourets house, and live high at their expense. The reaction of the townsfolk to Faujas outside influence is fascinatingly drawn by Zola, and the tactics of the groups who are in resistance to Abbé Faujas clever machinations are very keenly observed. The narrative is kept up at a tremendous pace and builds to a quite astonishing climax of violence and horror as Zola ends the novel in a near-apocalyptic fury.     Although the novel does assume in its readers a degree of familiarity with the battle between clerical political interests and governmental influence in the provincial towns of the ": null
    },
    {
        "Second Empire": "second french empire"
    },
    {
        " - knowledge which Zolas contemporary readers would certainly have taken for granted, but which seems obscure and almost arcane now - its strength lies not in its politics but in its human ": null
    },
    {
        "drama": "drama"
    },
    {
        ". On the face of it this could have been a relatively dull series of political observations, but instead by the end it is almost a melodrama, such is the anticlerical fury which Zola instils in his work.     The English translation done by ": null
    },
    {
        "Ernest Vizetelly": "ernest vizetelly"
    },
    {
        " in the 42s, still in print under the title The Conquest of Plassans, is much more readable than many of the other Vizetelly texts. A more modern retranslation was undertaken by Brian Rhys for Elek Books and published in 42 under the more expressive but less faithful title A Priest in the House, but it is no longer widely available. The 42 translation by Helen Constantine was published by Oxford World Classics.                                   ": null
    }
]