[
    {
        "         Labour Day  is an ": null
    },
    {
        "annual": "Year"
    },
    {
        " holiday": "Public Holiday"
    },
    {
        " to celebrate the ": null
    },
    {
        "achievements of workers": "Labour Rights"
    },
    {
        ". Labour Day has its origins in the ": null
    },
    {
        "labour union": "Trade Union"
    },
    {
        " movement, specifically the ": null
    },
    {
        "eight-hour day": "Eight-Hour Day"
    },
    {
        " movement, which advocated eight hours for work, eight hours for recreation, and eight hours for rest.     For most countries, Labour Day is synonymous with, or linked with, ": null
    },
    {
        "International Workers Day": "International Workers Day"
    },
    {
        ", which occurs on 1 May. For other countries, Labour Day is celebrated on a different date, often one with special significance for the labour movement in that country. Labour Day is a ": null
    },
    {
        "public holiday": "Public Holiday"
    },
    {
        " in many countries.     In ": null
    },
    {
        "Canada": "Canada"
    },
    {
        " and the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", the holiday is celebrated on the first Monday of September and considered the unofficial end of ": null
    },
    {
        "summer": "Summer"
    },
    {
        ", with ": null
    },
    {
        "summer vacations": "Summer Vacation"
    },
    {
        "ending and students returning to school around then.            For most countries, Labour Day is synonymous with, or linked with, International Workers Day, which occurs on 1 May. Some countries vary the actual date of their celebrations so that the holiday occurs on a Monday close to 1 May.     Some countries have a holiday at or around this date, but it is not a Labour day celebration.              Labour Day in ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " is a public holiday on dates which vary between ": null
    },
    {
        "states and territories": "States And Territories Of Australia"
    },
    {
        ". It is the first Monday in October in the ": null
    },
    {
        "Australian Capital Territory": "Australian Capital Territory"
    },
    {
        ", ": null
    },
    {
        "New South Wales": "New South Wales"
    },
    {
        " and ": null
    },
    {
        "South Australia": "South Australia"
    },
    {
        ". In ": null
    },
    {
        "Victoria": "Victoria"
    },
    {
        " and ": null
    },
    {
        "Tasmania": "Tasmania"
    },
    {
        ", it is the second Monday in March . In ": null
    },
    {
        "Western Australia": "Western Australia"
    },
    {
        ", Labour Day is the first Monday in March. In ": null
    },
    {
        "Queensland": "Queensland"
    },
    {
        " and the ": null
    },
    {
        "Northern Territory": "Northern Territory"
    },
    {
        ", Labour Day occurs on the first Monday in May .  It is on the fourth Monday of March in the territory of ": null
    },
    {
        "Christmas Island": "Christmas Island"
    },
    {
        ".     The first march for an eight-hour day by the ": null
    },
    {
        "labour movement": "Australian Labour Movementearly History"
    },
    {
        " occurred in Melbourne on 21 April 1856.  On this day stonemasons and building workers on building sites around ": null
    },
    {
        "Melbourne": "Melbourne"
    },
    {
        " stopped work and marched from the ": null
    },
    {
        "University of Melbourne": "University Of Melbourne"
    },
    {
        " to Parliament House to achieve an ": null
    },
    {
        "eight-hour day": "Eight-Hour Day"
    },
    {
        ". Their direct action protest was a success, and they are noted as being among the first organised workers in the world to achieve an 8-hour day, with no loss of pay.        Bangladesh Garment Sramik Sanghati, an organization working for the welfare of garment workers, has requested that 24 April be declared Labour Safety Day in ": null
    },
    {
        "Bangladesh": "Bangladesh"
    },
    {
        ", in memory of the victims of the ": null
    },
    {
        "Rana Plaza": "2013 Savar Building Collapse"
    },
    {
        " building collapse.         Labour Day is a national holiday in the ": null
    },
    {
        "Bahamas": "Bahamas"
    },
    {
        ", celebrated on the first Friday in June in order to create a long weekend for workers.  The traditional date of Labour Day in the Bahamas, however, is 7 June, in commemoration of a significant workers strike that began on that day in 1942. Labour Day is meant to honor and celebrate workers and the importance of their contributions to the nation and society. In the capital city, Nassau, thousands of people come to watch a parade through the streets, which begins at mid-morning. Bands in colorful uniforms, traditional African ": null
    },
    {
        "junkanoo": "Junkanoo"
    },
    {
        " performers, and members of various labour unions and political parties are all part of the procession, which ends up at the Southern Recreation Grounds, where government officials make speeches for the occasion. For many residents and visitors to the Bahamas, the afternoon of Labour Day is a time to relax at home or perhaps visit the beach.                Labour Day  has been celebrated in Canada on the first Monday in September since the 1880s. The origins of Labour Day in Canada can be traced back to December 1872 when a parade was staged in support of the Toronto Typographical Unions strike for a 58-hour work-week,  almost a full decade before a ": null
    },
    {
        "similar event in New York City": "Labor Dayhistory"
    },
    {
        " by the American ": null
    },
    {
        "Knights of Labor": "Knights Of Labor"
    },
    {
        ", a late 19th-century U.S. ": null
    },
    {
        "labor federation": "Labor Federation"
    },
    {
        ", launched the movement towards the American Labor Day holiday. Origin of Labor Day, Cincinnati Tribune, Sept. 1, 1895, Special Labor Day supplement, pg. 26. The Toronto Trades Assembly called its 27 unions to demonstrate in support of the Typographical Union who had been on strike since 25 March. ": null
    },
    {
        "George Brown": "George Brown"
    },
    {
        ", Canadian politician and editor of the  Toronto Globe  hit back at his striking employees, pressing police to charge the Typographical Union with conspiracy. Although the laws criminalising union activity were outdated and had already been abolished in Great Britain, they were still on the books in Canada and police arrested 24 leaders of the Typographical Union. Labour leaders decided to call another similar demonstration on 3 September to protest the arrests. Seven unions marched in ": null
    },
    {
        "Ottawa": "Ottawa"
    },
    {
        ", prompting a promise by Canadian ": null
    },
    {
        "Prime Minister": "Prime Minister"
    },
    {
        " Sir ": null
    },
    {
        "John A. Macdonald": "John A. Macdonald"
    },
    {
        " to repeal the barbarous anti-union laws. Parliament passed the ": null
    },
    {
        "Trade Union Act": "Trade Union Act"
    },
    {
        " on 14 June the following year, and soon all unions were seeking a 54-hour work-week.     The Toronto Trades and Labour Council held similar celebrations every spring. American ": null
    },
    {
        "Peter J. McGuire": "Peter J. Mcguire"
    },
    {
        ", co-founder of the ": null
    },
    {
        "American Federation of Labor": "American Federation Of Labor"
    },
    {
        ", was asked to speak at a labour festival in Toronto, Ontario, Canada on 22 July 1882. Returning to the United States, McGuire and the ": null
    },
    {
        "Knights of Labor": "Knights Of Labor"
    },
    {
        " organised a similar ": null
    },
    {
        "parade": "Parade"
    },
    {
        " based on the Canadian event on 5 September 1882 in New York City, USA. On 23 July 1894, Canadian Prime Minister ": null
    },
    {
        "John Thompson": "John Sparrow David Thompson"
    },
    {
        " and his government made Labour Day, to be held in September, an official holiday. In the United States, the New York parade became an annual event that year, and in 1894 was adopted by American president ": null
    },
    {
        "Grover Cleveland": "Grover Cleveland"
    },
    {
        " to compete with ": null
    },
    {
        "International Workers Day": "International Workers Day"
    },
    {
        " .     While Labour Day parades and picnics are organised by unions, many Canadians regard Labour Day as the Monday of the last long weekend of summer. Non-union celebrations include picnics, ": null
    },
    {
        "fireworks display": "Fireworks Display"
    },
    {
        "s, water activities, and public art events. Since the new school year generally starts right after Labour Day, families with school-age children take it as the last chance to travel before the end of summer.     An old fashioned tradition in Canada and the United States frowns upon the wearing of white after Labour Day. Explanations for this tradition vary; the most common is that white is a summer colour and Labour Day unofficially marks the end of summer. The rule may have been intended as a status symbol for new members of the upper and middle classes in the late 19th and early 20th century.      A Labour Day tradition in ": null
    },
    {
        "Atlantic Canada": "Atlantic Canada"
    },
    {
        " is the Wharf Rat Rally in ": null
    },
    {
        "Digby, Nova Scotia": "Digby, Nova Scotia"
    },
    {
        ", while the rest of Canada watches the ": null
    },
    {
        "Labour Day Classic": "Labour Day Classic"
    },
    {
        ", a ": null
    },
    {
        "Canadian Football League": "Canadian Football League"
    },
    {
        " event where rivals like ": null
    },
    {
        "Calgary Stampeders": "Calgary Stampeders"
    },
    {
        " and ": null
    },
    {
        "Edmonton Eskimos": "Edmonton Eskimos"
    },
    {
        ", ": null
    },
    {
        "Hamilton Tiger-Cats": "Hamilton Tiger-Cats"
    },
    {
        " and ": null
    },
    {
        "Toronto Argonauts": "Toronto Argonauts"
    },
    {
        " , and ": null
    },
    {
        "Saskatchewan Roughriders": "Saskatchewan Roughriders"
    },
    {
        " and ": null
    },
    {
        "Winnipeg Blue Bombers": "Winnipeg Blue Bombers"
    },
    {
        " play on Labour Day weekend. Before the demise of the ": null
    },
    {
        "Ottawa Renegades": "Ottawa Renegades"
    },
    {
        " after the 2005 season, that team played the nearby ": null
    },
    {
        "Montreal Alouettes": "Montreal Alouettes"
    },
    {
        " on Labour Day weekend. Since the ": null
    },
    {
        "2014 CFL season": "2014 Cfl Season"
    },
    {
        ", when the ": null
    },
    {
        "Ottawa Redblacks": "Ottawa Redblacks"
    },
    {
        " began play, the Montreal–Ottawa Labour Day tradition has once again been observed. Likewise, ": null
    },
    {
        "Ontario University Athletics": "Ontario University Athletics"
    },
    {
        " has a long-established tradition to play ": null
    },
    {
        "university football": "College Football"
    },
    {
        " on Labour Day.     The Labour Day parade in ": null
    },
    {
        "Grand Falls-Windsor": "Grand Falls-Windsor"
    },
    {
        ", ": null
    },
    {
        "Newfoundland": "Newfoundland"
    },
    {
        " started in 1921 and still continues today, over 90 years later. The celebrations go on for three days with a parade on Labour Day Monday.       Before 1961, 24 May was celebrated in ": null
    },
    {
        "Jamaica": "Jamaica"
    },
    {
        " as Empire Day in honour of the birthday of ": null
    },
    {
        "Queen Victoria": "Queen Victoria"
    },
    {
        " and her emancipation of slaves in Jamaica.  As its name suggests, the day was used to celebrate the British Empire, complete with flag-raising ceremonies and the singing of patriotic songs. In 1961, ": null
    },
    {
        "Jamaican Chief Minister": "Jamaican Chief Minister"
    },
    {
        " Norman Washington Manley": "Norman Washington Manley"
    },
    {
        " proposed the replacement of Empire Day with Labour Day, a celebration in commemoration of 23 May 1938, when ": null
    },
    {
        "Alexander Bustamante": "Alexander Bustamante"
    },
    {
        " led a ": null
    },
    {
        "labour rebellion": "British West Indian Labour Unrest Of 1934–1939"
    },
    {
        " leading to Jamaican independence.     In 1972, ": null
    },
    {
        "Jamaican Prime Minister": "Jamaican Prime Minister"
    },
    {
        " Michael Manley": "Michael Manley"
    },
    {
        " promoted Labour Day as a showcase for the importance of labour to the development of Jamaica, and a day of voluntary community participation to beneficial projects. Since then, Labour Day has been not only a public holiday but also a day of mass community involvement around the country.       Labor Day in ": null
    },
    {
        "Kazakhstan": "Kazakhstan"
    },
    {
        " is celebrated on the last Sunday in September. The holiday was officially established in late 2013. In 1995, the government of Kazakhstan replaced International Workers Day with Kazakhstan Peoples Unity Day. Kazakh President Nursultan Nazarbayev also instituted a special medal that is awarded to veterans of labor on the occasion of the holiday. Labor Day it is widely celebrated across the country with official speeches, award ceremonies, cultural events, etc. It is a non-working holiday for most citizens of Kazakhstan because it always falls on a weekend.        In ": null
    },
    {
        "New Zealand": "New Zealand"
    },
    {
        ", Labour Day is a public holiday held on the fourth Monday in October. Its origins are traced back to the eight-hour working day movement that arose in the newly founded ": null
    },
    {
        "Wellington": "Wellington"
    },
    {
        " colony in 1840, primarily because of carpenter ": null
    },
    {
        "Samuel Parnells": "Samuel Parnell"
    },
    {
        "refusal to work more than eight hours a day. He encouraged other tradesmen also to work for only eight hours a day and in October 1840, a workers meeting passed a resolution supporting the idea. On 28 October 1890, the 50th anniversary of the eight-hour day was commemorated with a parade. The event was then celebrated annually in late October as either Labour Day or Eight-Hour Demonstration Day. In 1899 government legislated that the day be a public holiday from 1900. The day was celebrated on different days in different provinces. This led to ship owners complaining that seamen were taking excessive holidays by having one Labour Day in one port then another in their next port. In 1910 the government stipulated that the holiday would be observed on the same day throughout the nation.       In ": null
    },
    {
        "Trinidad and Tobago": "Trinidad And Tobago"
    },
    {
        ", Labour Day is celebrated every 19 June. This holiday was proposed in 1973   to be commemorated on the anniversary of the 1937 ": null
    },
    {
        "Butler": "Tubal Uriah Butler"
    },
    {
        " labour riots.             In the United States, Labor Day is a ": null
    },
    {
        "federal holiday": "Federal Holiday"
    },
    {
        " observed on the first Monday of September. It is customarily viewed as the end of the ": null
    },
    {
        "summer": "Summer"
    },
    {
        " vacation season. Johnson, Yelena. , Celebrations.com. Retrieved 5 October 2009. Many schools open for the year on the day after Labor Day. Helderman, Rosalind S.  ; The Washington Post, 6 September 2009. The holiday is shared with ": null
    },
    {
        "Canada": "Canada"
    },
    {
        ", where it is known as Labour Day ": null
    }
]