[
    {
        "Labour law  mediates the relationship between workers, employing entities, ": null
    },
    {
        "trade unions": "Trade Union"
    },
    {
        "and the government. Collective labour law relates to the tripartite relationship between ": null
    },
    {
        "employee": "Employee"
    },
    {
        ", ": null
    },
    {
        "employer": "Employer"
    },
    {
        " and union. Individual labour law concerns employees rights at work also through the ": null
    },
    {
        "contract": "Contract"
    },
    {
        " for work.  are social norms  for the minimum socially acceptable conditions under which employees or contractors are allowed to work. Government agencies  enforce labour law .          Labour law arose in parallel with the ": null
    },
    {
        "Industrial Revolution": "Industrial Revolution"
    },
    {
        " as the relationship between worker and employer changed from small-scale production studios to large-scale factories. Workers sought better conditions and the right to join a ": null
    },
    {
        "labour union": "Labour Union"
    },
    {
        ", while employers sought a more predictable, flexible and less costly workforce. The state of labour law at any one time is therefore both the product of, and a component of struggles between various social forces.     As England was the first country to industrialize, it was also the first to face the often appalling consequences of industrial revolution in a less regulated economic framework. Over the course of the late 18th and early to mid-19th century the foundation for modern labour law was slowly laid, as some of the more egregious aspects of working conditions were steadily ameliorated through legislation. This was largely achieved through the concerted pressure from ": null
    },
    {
        "social reform": "Social Reform"
    },
    {
        "ers, notably ": null
    },
    {
        "Anthony Ashley-Cooper, 7th Earl of Shaftesbury": "Anthony Ashley-Cooper, 7Th Earl Of Shaftesbury"
    },
    {
        ", and others.       A serious outbreak of fever in 1784 in ": null
    },
    {
        "cotton mills": "Cotton Mills"
    },
    {
        " near ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        " drew widespread public opinion against the use of children in dangerous conditions. A local inquiry, presided over by Dr ": null
    },
    {
        "Thomas Percival": "Thomas Percival"
    },
    {
        ", was instituted by the ": null
    },
    {
        "justices of the peace": "Justice Of The Peace"
    },
    {
        " for ": null
    },
    {
        "Lancashire": "Lancashire"
    },
    {
        ", and the resulting report recommended the limitation of childrens working hours. From an Essay on Trade , quoted in History of Factory Legislation, by ": null
    },
    {
        "B. Leigh Hutchins": "B. Leigh Hutchins"
    },
    {
        " and ": null
    },
    {
        "Amy Harrison": "Amy Harrison"
    },
    {
        " , pp. 5, 6. In 1802, the first major piece of labour legislation was passed − the ": null
    },
    {
        "Health and Morals of Apprentices Act": "Health And Morals Of Apprentices Act 1802"
    },
    {
        ". This was the first, albeit modest, step towards the protection of labour. The act limited working hours to twelve a day and abolished night work. It required the provision of a basic level of education for all apprentices, as well as adequate sleeping accommodation and clothing.     The rapid industrialisation of manufacturing at the turn of the 19th century led to a rapid increase in child employment, and public opinion was steadily made aware of the terrible conditions these children were forced to endure. The ": null
    },
    {
        "Factory Act of 1819": "Factory Actscotton Mills, Etc. Act 1819"
    },
    {
        " was the outcome of the efforts of the industrialist ": null
    },
    {
        "Robert Owen": "Robert Owen"
    },
    {
        " and prohibited ": null
    },
    {
        "child labour": "Child Labour"
    },
    {
        " under nine years of age and limited the working day to twelve. A great milestone in labour law was reached with the ": null
    },
    {
        "Factory Act of 1833": "Factory Actslabour Of Children, Etc., In Factories Act 1833"
    },
    {
        ", which limited the employment of children under eighteen years of age, prohibited all night work and, crucially, provided for inspectors to enforce the law. Pivotal in the campaigning for and the securing of this legislation were ": null
    },
    {
        "Michael Sadler": "Michael Thomas Sadler"
    },
    {
        " and the ": null
    },
    {
        "Earl of Shaftesbury": "Anthony Ashley-Cooper, 7Th Earl Of Shaftesbury"
    },
    {
        ". This act was an important step forward, in that it mandated skilled inspection of workplaces and a rigorous enforcement of the law by an independent governmental body.     A lengthy campaign to limit the working day to ten hours was led by Shaftesbury, and included support from the ": null
    },
    {
        "Anglican Church": "Anglican Church"
    },
    {
        ".   Many committees were formed in support of the cause and some previously established groups lent their support as well. Yale University Library holds full text versions of the Ten Hours Advocate in its microfilm department The campaign finally led to the passage of the ": null
    },
    {
        "Factory Act of 1847": "Factory Act 1847"
    },
    {
        ", which restricted the working hours of women and children in British factories to effectively 10 hours per day. Bloy, Marjorie  The Factory Question accessed 20  March 2009          These early efforts were principally aimed at limiting child labour. From the mid-19th century, attention was first paid to the plight of ": null
    },
    {
        "working conditions": "Working Conditions"
    },
    {
        " for the workforce in general. In 1850, systematic reporting of fatal accidents was made compulsory, and basic safeguards for health, life and limb in the mines were put in place from 1855. Further regulations, relating to ventilation, fencing of disused shafts, signalling standards, and proper gauges and valves for steam-boilers and related machinery were also set down.     A series of further Acts, in 1860 and 1872 extended the legal provisions and strengthened safety provisions. Steady development of the coal industry, increasing association among miners, and increased scientific knowledge paved the way for the Coal Mines Act of 1872, which extended the legislation to similar industries. The same Act included the first comprehensive code of regulation to govern legal safeguards for health, life and limb. The presence of a more certified and competent management and increased levels of inspection were also provided for.     By the end of the century, a comprehensive set of regulations was in place in England that affected all industries. A similar system was implemented in other industrializing countries in the latter part of the 19th century and the early 20th century.              The basic feature of labour law in almost every country is that the rights and obligations of the worker and the employer are mediated through a ": null
    },
    {
        "contract of employment": "Contract Of Employment"
    },
    {
        " between the two. This has been the case since the collapse of ": null
    },
    {
        "feudalism": "Feudalism"
    },
    {
        ". Many contract terms and conditions are covered by ": null
    },
    {
        "legislation": "Legislation"
    },
    {
        " or ": null
    },
    {
        "common law": "Common Law"
    },
    {
        ". In the US for example, the majority of ": null
    },
    {
        "state laws": "State Law"
    },
    {
        " allow for ": null
    },
    {
        "employment to be at will ": "At-Will Employment"
    },
    {
        ", meaning the employer can terminate an employee from a position for any reason, so long as the reason is not explicitly prohibited, and, conversely, an employee may quit at any time, for any reason , and is not required to give notice.     One example of employment terms in many countries e.g. In the European Union, Directive 91/533 is the duty to provide written particulars of employment with the  essentialia negotii   to an employee. This aims to allow the employee to know concretely what to expect and what is expected. It covers items including ": null
    },
    {
        "compensation": "Compensation And Benefits"
    },
    {
        ", ": null
    },
    {
        "holiday": "Annual Leave"
    },
    {
        " and ": null
    },
    {
        "illness rights": "Sick Leave"
    },
    {
        ", notice in the ": null
    },
    {
        "event of dismissal": "Termination Of Employment"
    },
    {
        " and ": null
    },
    {
        "job description": "Job Description"
    },
    {
        ".     The contract is subject to various legal provisions. An employer may not legally offer a contract that pays the worker less than a minimum wage. An employee may not agree to a contract that allows an employer to ": null
    },
    {
        "dismiss them for illegal reasons": "Wrongful Dismissal"
    },
    {
        ".          Many jurisdictions define the minimum amount that a worker can be paid per hour. Algeria, Australia, Belgium, Brazil, Canada, China, France, Greece, Hungary, India, Ireland, Japan,South Korea, Luxembourg, the Netherlands, New Zealand, Paraguay, Portugal, Poland, Romania, Spain,Taiwan, the United Kingdom, the United States, Vietnam, Germany  and others have laws of this kind. The minimum wage is set usually higher than the lowest wage as determined by the forces of ": null
    },
    {
        "supply and demand": "Supply And Demand"
    },
    {
        " in a ": null
    },
    {
        "free market": "Free Market"
    },
    {
        " and therefore acts as a ": null
    },
    {
        "price floor": "Price Floor"
    },
    {
        ". Each country sets its own ": null
    },
    {
        "minimum wage laws": "Minimum Wage Law"
    },
    {
        "and regulations, and while a majority of industrialized countries has a minimum wage, many developing countries do not.     Minimum wages are regulated and stipulated in some countries that lack explicit laws. In Sweden minimum wages are negotiated between the ": null
    },
    {
        "labour market": "Labour Economics"
    },
    {
        " parties through ": null
    },
    {
        "collective agreements": "Collective Agreements"
    },
    {
        " that also cover non-union workers at workplaces with collective agreements. At workplaces without collective agreements there exist no minimum wages. Non-organized employers can sign substitute agreements directly with trade unions but far from all do. The Swedish case illustrates that in countries without statutory regulation will part of the labour market do not have regulated minimum wages, as self-regulation only applies to workplaces and employees covered by collective agreements . Anders Kjellberg  In Mia Rönnmar and Jenny Julén Votinius Festskrift till Ann Numhauser-Henning. Lund: Juristförlaget i Lund 2017, pp. 357-383 Anders Kjellberg , Department of Sociology, Lund University. Studies in Social Policy, Industrial Relations, Working Life and Mobility. Research Reports 2017:1, Appendix 3 Tables F-G     National minimum wage laws were first introduced in the ": null
    },
    {
        "United States in 1938": "Fair Labor Standards Act"
    },
    {
        ",  Brazil in 1940  India in 1948,  France in 1950  and in the ": null
    },
    {
        "United Kingdom in 1998": "National Minimum Wage Act 1998"
    },
    {
        ".  In the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        ", 18 out of 28 member states have national minimum wages as of 2011.             The living wage is higher than the minimum wage and is designed that a full-time worker would be able to support themselves and a small family at that wage.           The maximum number of hours worked per day or other time interval are set by law in many countries. Such laws also control whether workers who work longer hours must be paid additional compensation.     Before the Industrial Revolution, the workday varied between 11 and 14 hours. With the growth of ": null
    },
    {
        "industrialism": "Industrialism"
    },
    {
        " and the introduction of machinery, longer hours became far more common, reaching as high as 16 hours per day.     The ": null
    },
    {
        "eight-hour movement": "Eight-Hour Day"
    },
    {
        " led to the first law on the length of a working day, passed in 1833 in England. It limited miners to 12 hours and children to 8 hours. The 10-hour day was established in 1848, and shorter hours with the same pay were gradually accepted thereafter. The 1802 ": null
    },
    {
        "Factory Act": "Factory Act"
    },
    {
        " was the first labour law in the UK.     Germany was the next European country to pass labour laws; Chancellor ": null
    },
    {
        "Otto von Bismarcks": "Otto Von Bismarck"
    },
    {
        "main goal was to undermine the ": null
    },
    {
        "Social Democratic Party of Germany": "Social Democratic Party Of Germany"
    },
    {
        ". In 1878, Bismarck instituted a variety of anti-socialist measures, but despite this, socialists continued gaining seats in the ": null
    },
    {
        "Reichstag": "Reichstag"
    },
    {
        ". To appease the working class, he enacted a variety of ": null
    },
    {
        "paternalistic": "Paternalistic"
    },
    {
        " social reforms, which became the first type of ": null
    },
    {
        "social security": "Social Security"
    },
    {
        ". In 1883 the Health Insurance Act was passed, which entitled workers to health insurance; the worker paid two-thirds and the employer one-third of the premiums. Accident insurance was provided in 1884, while old age pensions and disability insurance followed in 1889. Other laws restricted the employment of women and children. These efforts, however, were not entirely successful; the working class largely remained unreconciled with Bismarcks conservative government.     In France, the first labour law was voted in 1841. It limited under-age miners hours. In the ": null
    },
    {
        "Third Republic": "French Third Republic"
    },
    {
        " labour law was first effectively enforced, in particular after ": null
    },
    {
        "Waldeck-Rousseau": "Waldeck-Rousseau"
    },
    {
        " 1884 law legalising ": null
    },
    {
        "trade unions": "Trade Unions"
    },
    {
        ". With the ": null
    },
    {
        "Matignon Accords": "Matignon Accords"
    },
    {
        ", the ": null
    },
    {
        "Popular Front": "Popular Front"
    },
    {
        " enacted the laws mandating 12 days each year of ": null
    },
    {
        "paid vacations": "Annual Leave"
    },
    {
        " for workers and the law limiting the standard workweek to 40 hours.            Other labour laws involve safety concerning workers. The earliest English ": null
    },
    {
        "factory law": "Factory Actsfactory Act 1802"
    },
    {
        " was passed in 1802 and dealt with the safety and health of ": null
    },
    {
        "child": "Child Labour"
    },
    {
        " textile": "Textile"
    },
    {
        " workers.          Such laws prohibited ": null
    },
    {
        "discrimination": "Discrimination"
    },
    {
        " against employees as morally unacceptable and illegal, in particular ": null
    },
    {
        "racial discrimination": "Racial Discrimination"
    },
    {
        " or ": null
    },
    {
        "gender discrimination": "Sexism"
    },
    {
        ".          ": null
    },
    {
        "Convention no. 158": "Termination Of Employment Convention, 1982"
    },
    {
        " of the ": null
    },
    {
        "International Labour Organization": "International Labour Organization"
    },
    {
        " states that an employee cant be fired without any legitimate motive and before offering him the possibility to defend himself . Thus, on April 28, 2006, after the unofficial repeal of the French ": null
    },
    {
        "First Employment Contract": "First Employment Contract"
    },
    {
        ", the ": null
    },
    {
        "Longjumeau": "Longjumeau"
    },
    {
        "  conseil des prudhommes judged the ": null
    },
    {
        "New Employment Contract": "New Employment Contract"
    },
    {
        " contrary to ": null
    },
    {
        "international law": "International Law"
    },
    {
        " and therefore illegitimate and without any juridical value . The court considered that the two-years period of fire at will was unreasonable , and contrary to convention.               Child labour was not seen as a problem throughout most of history, only disputed with the beginning of universal ": null
    },
    {
        "schooling": "Education"
    },
    {
        " and the concepts of ": null
    },
    {
        "labourers": "Labor Rights"
    },
    {
        " and ": null
    },
    {
        "childrens rights": "Childrens Rights"
    },
    {
        ". Use of ": null
    },
    {
        "child labour": "Child Labour"
    },
    {
        " was commonplace, often in factories. In England and Scotland in 1788, about two-thirds of persons working in water-powered ": null
    },
    {
        "textile": "Textile"
    },
    {
        " factories were children.  Child labour can be factory work, mining or quarrying, agriculture, helping in the parents business, operating a ": null
    },
    {
        "small business": "Small Business"
    },
    {
        " , or doing odd jobs. Children work as guides for ": null
    },
    {
        "tourists": "Tourism"
    },
    {
        ", sometimes combined with bringing in business for shops and ": null
    },
    {
        "restaurants": "Restaurant"
    },
    {
        ". Other children do jobs such as assembling boxes or polishing shoes. However, rather than in factories and ": null
    },
    {
        "sweatshop": "Sweatshop"
    },
    {
        "s, most child labour in the twenty-first century occurs in the informal sector, selling on the street, at work in ": null
    },
    {
        "agriculture": "Agriculture"
    },
    {
        " or ": null
    },
    {
        "hidden away in houses": "Child Domestic Work"
    },
    {
        "  — far from the reach of official inspectors and from media scrutiny.           Collective labour law concerns the relationship between employer, employee and ": null
    },
    {
        "trade unions": "Trade Unions"
    },
    {
        ". Trade unions are organizations which generally aim to promote the interests of their members.          Trade unions are organized groups of workers who engage in ": null
    },
    {
        "collective bargaining": "Collective Bargaining"
    },
    {
        " with employers. Some countries require unions and/or employers to follow particular procedures in pursuit of their goals. For example, some countries require that unions poll the membership to approve a strike or to approve using members dues for political projects. Laws may govern the circumstances and procedures under which unions are formed. They may guarantee the right to join a union , or remain silent in this respect. Some legal codes allow unions to obligate their members, such as the requirement to comply with a majority decision in a strike vote. Some restrict this, such as ": null
    },
    {
        "right to work": "Right To Work"
    },
    {
        " legislation in parts of the United States.     In the different organization in the different countries trade union discuses with the employee on behalf of employer. At that time trade union discussed or talk with the manpower of the organization. At that time trade union perform his role like a bridge between the employee and employer.          A legally binding right for workers as a group to participate in workplace management is acknowledged in some form in most developed countries. In a majority of EU member states the workforce has a right to elect directors on the board of large corporations. This is usually called codetermination and currently most countries allow for the election of one third of the board, though the workforce can have the right to elect anywhere from a single director, to just under a half in Germany.   However, ": null
    },
    {
        "German company law": "German Company Law"
    },
    {
        " uses a split board system, in which a supervisory board appoints an executive board . Under the ": null
    },
    {
        "Mitbestimmunggesetz 1976": "Mitbestimmunggesetz 1976"
    },
    {
        ", shareholders and employees elect the supervisory board in equal numbers, but the head of the supervisory board with a casting vote is a shareholder representative. The first statutes to introduce board level codetermination were in Britain, however most of these measures, except in universities, were removed in 1948 and 1979. The oldest surviving statute is found in the United States, in the Massachusetts Laws on manufacturing corporations, introduced in 1919, however this was always voluntary.     In the United Kingdom, similar proposals were drawn up, and a command paper produced named the ": null
    },
    {
        "Bullock Report ": "Bullock Report"
    },
    {
        " was released in 1977 by the ": null
    },
    {
        "James Callaghan": "James Callaghan"
    },
    {
        " Labour Party": "Labour Party"
    },
    {
        " government. Unions would have directly elected half of the board. An independent element would also be added. However, the proposal was not enacted. The ": null
    },
    {
        "European Commission": "European Commission"
    },
    {
        " offered proposals for worker participation in the fifth company law directive , which was also not implemented.     In Sweden, participation is regulated through the Law on board representation . The law covers all private companies with 25 or more employees. In these companies, workers have a right to appoint two board members and two substitutes. If the company has more than 1,000 employees, this rises to three members and three substitutes. It is common practice to allocate them among the major union coalitions.       Workplace statutes in many countries require that employers consult their workers on various issues.                      ": null
    },
    {
        "Strike action": "Strike Action"
    },
    {
        " is the worker tactic most associated with industrial disputes. In most countries, strikes are legal under a circumscribed set of conditions. Among them may be that:   The strike is decided on by a prescribed democratic process .   ": null
    },
    {
        "Sympathy strike": "Sympathy Strike"
    },
    {
        "s, against a company by which workers are not directly employed, may be prohibited.   ": null
    },
    {
        "General strikes": "General Strike"
    },
    {
        "may be forbidden for example, among public safety workers, to maintain ": null
    },
    {
        "public order": "Public Order"
    },
    {
        ".     A ": null
    },
    {
        "boycott": "Boycott"
    },
    {
        " is a refusal to buy, sell, or otherwise trade with an individual or business. Other tactics include ": null
    },
    {
        "go-slow": "Go-Slow"
    },
    {
        ", ": null
    },
    {
        "sabotage": "Sabotage"
    },
    {
        ", ": null
    },
    {
        "work-to-rule": "Work-To-Rule"
    },
    {
        ", ": null
    },
    {
        "sit-in": "Sit-In"
    },
    {
        " or en-masse not reporting to work.  Some labour law explicitly bans such activity, none explicitly allows it.     ": null
    },
    {
        "Picketing": "Picketing"
    },
    {
        " is often used by workers during strikes. They may congregate near the business they are striking against to make their presence felt, increase worker participation and dissuade ": null
    },
    {
        "strike breakers": "Strikebreaker"
    },
    {
        " from entering the workplace. In many countries, this activity is restricted by law, by more general law restricting demonstrations, or by injunctions on particular pickets. For example, labour law may restrict ": null
    },
    {
        "secondary picketing": "Picketing"
    },
    {
        " , or ": null
    },
    {
        "flying pickets": "Flying Picket"
    },
    {
        ". Laws may prohibit obstructing others from conducting lawful business; outlaw obstructive pickets allow court orders to restrict picketing locations or behaving in particular ways .             The labour movement has long been concerned that economic ": null
    },
    {
        "globalization": "Globalization"
    },
    {
        " would weaken worker bargaining power, as their employers could hire workers abroad to avoid domestic labour standards. ": null
    },
    {
        "Karl Marx": "Karl Marx"
    },
    {
        " said:      The International Labour Organization and the World Trade Organization have been a primary focus among international bodies for regulating labour markets. Conflicts arise when people work in more than one country. EU law has a growing body of workplace rules.          Following ": null
    },
    {
        "World War One": "World War One"
    },
    {
        ", the ": null
    },
    {
        "Treaty of Versailles": "Treaty Of Versailles"
    },
    {
        " contained the first constitution of a new ": null
    },
    {
        "International Labour Organization": "International Labour Organization"
    },
    {
        " founded on the principle that labour is not a commodity , and for the reason that peace can be established only if it is based upon social justice . ": null
    },
    {
        "Treaty of Versailles": "Treaty Of Versailles"
    },
    {
        " Part XIII": "S:Constitution Of The International Labour Office"
    },
    {
        ", Section I, and Article 427 ILOs primary role has been to coordinate international labour law by issuing Conventions. ILO members can voluntarily adopt and ratify the Conventions. For instance, the first ": null
    },
    {
        "Hours of Work Convention, 1919": "Hours Of Work  Convention, 1919"
    },
    {
        " required a maximum of a 48-hour week, and has been ratified by 52 out of 185 member states. The UK ultimately refused to ratify the Convention, as did many current EU members, although the ": null
    },
    {
        "Working Time Directive": "Working Time Directive"
    },
    {
        " adopts its principles, subject to individual opt-out. ILOs constitution comes from the 1944 ": null
    },
    {
        "Declaration of Philadelphia": "Declaration Of Philadelphia"
    },
    {
        " and under the 1998 ": null
    },
    {
        "Declaration on Fundamental Principles and Rights at Work": "Declaration On Fundamental Principles And Rights At Work"
    },
    {
        " classified eight conventions as core.     These require freedom to join a union, bargain collectively and take action , abolition of forced labour , abolition of labour by children before the end of compulsory school , and no discrimination at work . Member compliance with the core Conventions is obligatory, even if the country has not ratified the Convention in question. To ensure compliance, the ILO is limited to gathering evidence and reporting on member states progress, relying on publicity to create pressure to reform. Global reports on core standards are produced yearly, while individual reports on countries who have ratified other Conventions are compiled on a bi-annual or less frequent basis.        Because the ILOs enforcement mechanisms are weak, incorporating ": null
    },
    {
        "labour standards in the World Trade Organizations": "Labour Standards In The World Trade Organization"
    },
    {
        " operation has been proposed. WTO oversees, primarily, the ": null
    },
    {
        "General Agreement on Tariffs and Trade": "General Agreement On Tariffs And Trade"
    },
    {
        " treaty aimed at reducing ": null
    },
    {
        "customs": "Customs"
    },
    {
        ", ": null
    },
    {
        "tariffs": "Tariff"
    },
    {
        "and other barriers to import and export of goods, services and capital between its 157 member countries. Unlike for the ILO, contravening WTO rules as recognized by the ": null
    },
    {
        "dispute settlement procedures": "Dispute Settlement In The World Trade Organization"
    },
    {
        " opens a country to retaliation through ": null
    },
    {
        "trade sanctions": "Trade Sanctions"
    },
    {
        ". This could include reinstatement of targeted tariffs against the offender.     Proponents have called for a ": null
    },
    {
        "social clause": "Social Clause"
    },
    {
        " to be inserted into the GATT agreements, for example, by amending Article XX, which provides an exception that allows imposition of sanctions for breaches of human rights. An explicit reference to core labour standards could allow comparable action where a WTO member state breaches ILO standards. Opponents argue that such an approach could undermine labour rights, because industries, and therefore workforces could be harmed with no guarantee of reform. Furthermore, it was argued in the 1996 Singapore Ministerial Declaration 1996 that the ": null
    },
    {
        "comparative advantage": "Comparative Advantage"
    },
    {
        " of countries, particularly low-age developing countries, must in no way be put into question.  Some countries want to take advantage of low wages and fewer rules as a comparative advantage to boost their economies. Another contested point is whether business moves production from high wage to low wage countries, given potential differences in worker productivity.  Since GATT, most trade agreements have been bilateral. Some of these protect core labour standards.  Moreover, in domestic tariff regulations, some countries give preference to countries that respect core labour rights, for example under the EC Tariff Preference Regulation, articles 7 and 8.           ": null
    },
    {
        "Conflicts of laws": "Conflicts Of Laws"
    },
    {
        "  issues arise where workers work in multiple jurisdictions. If a US worker performs part of her job in Brazil, China and Denmark an employer may seek to characterize the employment contract as governed by the law of the country where labour rights are least favourable to the worker, or seek to argue that the most favourable system of labour rights does not apply. For example, in a ": null
    },
    {
        "UK labour law": "Uk Labour Law"
    },
    {
        " case,  Ravat v Halliburton Manufacturing and Services Ltd   Ravat was from the UK but was employed in Libya by a German company that was part of ": null
    },
    {
        "Halliburton": "Halliburton"
    },
    {
        ". He was dismissed by a supervisor based in ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ". He was told he would be hired under UK law terms and conditions, and this was arranged by a staffing department in Aberdeen. Under the UK ": null
    },
    {
        "Employment Rights Act 1996": "Employment Rights Act 1996"
    },
    {
        " he would have a right to claim unfair dismissal, but the Act left open the question of the statutes territorial scope. The UK Supreme Court held that the principle would be that an expatriate worker, would be subject to UK rules if the worker could show a close connection to the UK, which was found in Rabats case.     This fits within the general framework in the EU. Under EU ": null
    },
    {
        "Rome I Regulation": "Rome I Regulation"
    },
    {
        " article 8, ": null
    },
    {
        "Rome I Regulation": "Rome I Regulation"
    },
    {
        "  workers have employment rights of the country where they habitually work. They may have a claim in another country if they can establish a close connection to it. The Regulation emphasises that the rules should be applied with the purpose of protecting the worker. , recital 23 and , recital 13     It is also necessary that a court has jurisdiction to hear a claim. Under the ": null
    },
    {
        "Brussels I Regulation": "Brussels I Regulation"
    },
    {
        " article 19,  this requires the worker habitually works in the place where the claim is brought, or is engaged there.             The European Union has extensive labour laws that officially exclude  matters around direct wage regulation , fairness of dismissals and collective bargaining. A series of Directives regulate almost all other issues, for instance the ": null
    },
    {
        "Working Time Directive": "Working Time Directive"
    },
    {
        " guarantees 28 days of paid holiday, the ": null
    },
    {
        "Equality Framework Directive": "Equality Framework Directive"
    },
    {
        " prohibits all forms of discrimination and the ": null
    },
    {
        "Collective Redundancies Directive": "Collective Redundancies Directive"
    },
    {
        " requires that proper notice is given and consultation takes place on decisions about economic dismissals.     However, the ": null
    },
    {
        "European Court of Justice": "European Court Of Justice"
    },
    {
        " has recently extended the Treaties provisions via ": null
    },
    {
        "case law": "Case Law"
    },
    {
        ". Trade unions have sought to organize across borders in the same way that ": null
    },
    {
        "multinational corporations": "Multinational Corporations"
    },
    {
        " have organized production globally. Unions have sought to take collective action and strikes internationally. However, this coordination was challenged in the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " in two controversial decisions. In  Laval Ltd v Swedish Builders Union   Laval Ltd v Swedish Builders Union  C-319/05  a group of Latvian workers were sent to a construction site in Sweden. The local union took industrial action to make Laval Ltd sign up to the local collective bargaining agreement. Under the ": null
    },
    {
        "Posted Workers Directive": "Posted Workers Directive"
    },
    {
        ", article 3 lays down minimum standards for foreign workers so that workers receive at least the minimum rights that they would have in their home country in case their place of work has lower minimum rights. Article 3 says that this shall not prevent application of terms and conditions of employment which are more favourable to workers . Most people thought this meant that more favourable conditions could be given than the minimum by the host states legislation or a collective agreement. However the ": null
    },
    {
        "European Court of Justice": "European Court Of Justice"
    },
    {
        " said that only the local state could raise standards beyond its minimum for foreign workers. Any attempt by the host state, or a collective agreement would infringe the business freedom under ": null
    },
    {
        "TFEU": "Tfeu"
    },
    {
        " article 56. This decision was implicitly reversed by the European Union legislature in the ": null
    },
    {
        "Rome I Regulation": "Rome I Regulation"
    },
    {
        ", which makes clear in recital 34 that the host state may allow more favourable standards. However, in  The Rosella , the ECJ held that a blockade by the ": null
    },
    {
        "International Transport Workers Federation": "International Transport Workers Federation"
    },
    {
        " against a business that was using an ": null
    },
    {
        "Estonia": "Estonia"
    },
    {
        "n ": null
    },
    {
        "flag of convenience": "Flag Of Convenience"
    },
    {
        " infringed the business right of free establishment under ": null
    },
    {
        "TFEU": "Tfeu"
    },
    {
        " article 49. The ECJ said that it recognized the workers right to strike in accordance with ILO Convention 87, but said that its use must be proportionately to the right of the business establishment.           The ": null
    },
    {
        "Fair Work Act of 2009": "Fair Work Act 2009"
    },
    {
        " provides the regulations governing Australian workplaces and employers. Australia has a minimum wage and workplace conditions overseen by the ": null
    },
    {
        "Fair Work Commission": "Fair Work Commission"
    },
    {
        ".                 In Canadian law, labour law refers to matters connected with unionized workplaces, while employment law deals with non-unionized employees.     In 2017, Premier ": null
    },
    {
        "Brad Wall": "Brad Wall"
    },
    {
        " announced that Saskatchewans government is to cut 3.5 percent from its workers and officers wages in 2018. This salary cut includes ": null
    },
    {
        "MLA": "Legislative Assembly Of Saskatchewan"
    },
    {
        " ministers and the Premiers office staff along all people employed by the government. Unpaid days off, will also be implemented as well as limiting overtime to assist the wage cut.              In the ": null
    },
    {
        "Peoples Republic of China": "Peoples Republic Of China"
    },
    {
        " the basic labour laws are the  Labour Law of Peoples Republic of China  and the  Labour Contract Law of the Peoples Republic of China  . The administrative regulations enacted by the State Council, the ministerial rules and the judicial explanations of the ": null
    },
    {
        "Supreme Peoples Court": "Supreme Peoples Court"
    },
    {
        " stipulate detailed rules concerning various aspects of employment. The government-controlled ": null
    },
    {
        "All China Federation of Trade Unions": "All China Federation Of Trade Unions"
    },
    {
        " is the sole legal labour union. Strikes are formally legal, but in practice are discouraged.            In France, the first labour laws were ": null
    },
    {
        "Waldeck Rousseaus": "Waldeck Rousseau"
    },
    {
        "laws passed in 1884. Between 1936 and 1938 the ": null
    },
    {
        "Popular Front": "Popular Front"
    },
    {
        " enacted a law mandating 12 days each year of paid ": null
    },
    {
        "vacation": "Annual Leave"
    },
    {
        " for workers, and a ": null
    },
    {
        "law": "Matignon Accords"
    },
    {
        " limited the work week to 40 hours, excluding overtime. The ": null
    },
    {
        "Grenelle accords": ":Fr:Accords De Grenelle"
    },
    {
        " negotiated on May 25 and 26th in the middle of the May 1968 crisis, reduced the working week to 44 hours and created trade union sections in each enterprise.   Section syndicale dentreprise  December 27, 1968 law The minimum wage was increased by 25%.  ": null
    },
    {
        "SMIG": ":Fr:Salaire Minimum Interprofessionnel Garanti"
    },
    {
        " In 2000, ": null
    },
    {
        "Lionel Jospins": "Lionel Jospin"
    },
    {
        "government enacted the ": null
    },
    {
        "35-hour workweek": "35-Hour Workweek"
    },
    {
        ", reduced from 39 hours. Five years later, conservative prime minister ": null
    },
    {
        "Dominique de Villepin": "Dominique De Villepin"
    },
    {
        " enacted the ": null
    },
    {
        "New Employment Contract": "New Employment Contract"
    },
    {
        " . Addressing the demands of employers asking for more ": null
    },
    {
        "flexibility": "Labour Market Flexibility"
    },
    {
        " in French labour laws, the CNE sparked criticism from trade unions and opponents claiming it favoured ": null
    },
    {
        "contingent work": "Contingent Work"
    },
    {
        ". In 2006, he then attempted to pass the ": null
    },
    {
        "First Employment Contract": "First Employment Contract"
    },
    {
        " through a vote by emergency procedure, but that was met by ": null
    },
    {
        "students and unions protests": "2006 Labour Protests In France"
    },
    {
        ". President ": null
    },
    {
        "Jacques Chirac": "Jacques Chirac"
    },
    {
        " finally had no choice but to repeal it.              Over fifty national and many more state-level laws govern work in India. So for instance, a permanent worker can be terminated only for proven misconduct or habitual absence.  In the ": null
    },
    {
        "Uttam Nakate": "Uttam Nakate"
    },
    {
        " case, the ": null
    },
    {
        "Bombay High Court": "Bombay High Court"
    },
    {
        " held that dismissing an employee for repeated sleeping on the factory floor was illegal – the decision was overturned by the ": null
    },
    {
        "Supreme Court of India": "Supreme Court Of India"
    },
    {
        " two decades later. In 2008, the ": null
    },
    {
        "World Bank": "World Bank"
    },
    {
        " criticized the complexity, lack of modernization and flexibility in Indian regulations.                     Iran has not ratified the two basic Conventions of the ": null
    },
    {
        "International Labour Organization": "International Labour Organization"
    },
    {
        " on ": null
    },
    {
        "freedom of association": "Freedom Of Association"
    },
    {
        " and ": null
    },
    {
        "collective bargaining": "Collective Bargaining"
    },
    {
        " and one abolishing child labour.                           Mexican labour law reflects the historic interrelation between the state and the ": null
    },
    {
        "Confederation of Mexican Workers": "Confederation Of Mexican Workers"
    },
    {
        ". The confederation is officially aligned with the ": null
    },
    {
        "Institutional Revolutionary Party": "Institutional Revolutionary Party"
    },
    {
        " . While the law promises workers the right to strike and to organize, in practice it is difficult or impossible for independent unions to organize.            In Sweden many workplace issues such as working hours, minimum wage and right to overtime compensation are regulated through collective bargaining agreements in accordance with the Swedish model of self-regulation, i.e. regulation by the labour market parties themselves in contrast to state regulation . Kjellberg, Anders The Swedish Model of Industrial Relations: Self-Regulation and Combined Centralisation-Decentralisation , in Craig Phelan Trade Unionism since 1945: Towards a Global History. Oxford: Peter Lang, pp. 155-198. Volume 1 .  A notable exception is the ": null
    },
    {
        "Employment Protection act": "Employment Protection Act"
    },
    {
        " which regulates employment contracts and extensive employees rights to employment under certain conditions.             The labour law of ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        " covers all standards governing the ": null
    },
    {
        "employment": "Employment"
    },
    {
        " of some kind. The regulation of the employment by private employers is largely harmonized at the ": null
    },
    {
        "federal": "Federal Government"
    },
    {
        " level, while public-sector employment still prevails a variety of ": null
    },
    {
        "cantonal": "Cantonal"
    },
    {
        " laws. In particular, the civil standardization is distributed to a variety of laws. Of greater importance, particularly the new ": null
    },
    {
        "Federal Constitution": "Swiss Federal Constitution"
    },
    {
        " of 1999, the ": null
    },
    {
        "Code of Obligations": "Code Of Obligations"
    },
    {
        " , the ": null
    },
    {
        "Labour Code": "Labour Code"
    },
    {
        " as well as in the public sector, the ": null
    },
    {
        "Federal Personnel Act": "Federal Personnel Act"
    },
    {
        ". J. Brühwiler: Arbeitsrecht in der Schweiz            The ": null
    },
    {
        "Factory Acts": "Factory Act"
    },
    {
        " and the 1823 ": null
    },
    {
        "Master and Servant Act": "Master And Servant Act"
    },
    {
        " were the first laws regulating labour relations in the United Kingdom. Most employment law before 1960 was based upon the Law of Contract. Since then there has been a significant expansion primarily due to the equality movement  and the European Union. Laws are either Acts of Parliament called Statutes, Statutory Regulations or Case Law .     The first significant expansion was the Equal Pay Act of 1970. This act was introduced to bring about pay equality for women in the workplace. Since 1997, changes in UK employment law include enhanced maternity and paternity rights,  the introduction of a National Minimum Wage  and the Working Time Regulations,  which covers working time, rest breaks and the right to paid annual leave. Discrimination law has been tightened, with protection from discrimination now available on the grounds of age, religion or belief and sexual orientation as well as gender, race and disability.                 The ": null
    },
    {
        "Fair Labor Standards Act": "Fair Labor Standards Act"
    },
    {
        " of 1938 set the maximum standard work week to 44 hours. In 1950 this was reduced to 40 hours. A ": null
    },
    {
        "green card": "United States Permanent Resident Card"
    },
    {
        " entitles immigrants to work, without requirement a separate ": null
    },
    {
        "work permit": "Work Permit"
    },
    {
        ". Despite the 40-hour standard maximum work week,  some lines of work require more than 40 hours. For example, farm workers may work over 72 hours a week, followed by at least 24 hours off. Exceptions to the break period exist for certain harvesting employees, such as those involved in harvesting grapes, tree fruits and cotton.     Professionals, clerical , technical, and mechanical employees cannot be terminated for refusing to work more than 72 hours in a work week. Aguilar, Victoria. ,  The AR Group, LLP , Colorado, 13 January 2015. Retrieved on 15 January 2015.   These ceilings, combined with a competitive job market, often motivate American workers to work more hours. American workers on average take the fewest days off of any developed country.      The Fifth and Fourteenth Amendments of the ": null
    },
    {
        "United States Constitution": "United States Constitution"
    },
    {
        " limit the power of the ": null
    },
    {
        "federal": "Federal Government Of The United States"
    },
    {
        " and ": null
    },
    {
        "state": "U.S. State"
    },
    {
        " governments to ": null
    },
    {
        "discriminate": "Discriminate"
    },
    {
        ". The private sector is not directly constrained by the Constitution, but several laws, particularly the ": null
    },
    {
        "Civil Rights Act of 1964": "Civil Rights Act Of 1964"
    },
    {
        ", limit the private sector discrimination against certain groups. The ": null
    },
    {
        "Fifth Amendment": "Fifth Amendment To The United States Constitution"
    },
    {
        "  has an explicit requirement that the Federal Government not deprive individuals of life, liberty, or property , without due process of law and an implicit guarantee that each person receive equal protection of the law. The ": null
    },
    {
        "Fourteenth Amendment": "Fourteenth Amendment To The United States Constitution"
    },
    {
        " explicitly prohibits states from violating an individuals rights of ": null
    },
    {
        "due process": "Due Process"
    },
    {
        " and ": null
    },
    {
        "equal protection": "Equal Protection"
    },
    {
        ". Equal protection limits the State and Federal governments power to ": null
    },
    {
        "discriminate": "Discriminate"
    },
    {
        " in their employment practices by treating employees, former employees, or job applicants unequally because of membership in a group, like a race, religion or sex. ": null
    },
    {
        "Due process": "Due Process"
    },
    {
        " protection requires that employees have a fair procedural process before they are terminated if the termination is related to a liberty , like the right to ": null
    },
    {
        "free speech": "Free Speech"
    },
    {
        ", or a property interest.     The ": null
    },
    {
        "National Labor Relations Act": "National Labor Relations Act"
    },
    {
        ", enacted in 1935 as part of the ": null
    },
    {
        "New Deal": "New Deal"
    },
    {
        " legislation, guarantees workers the right to form unions and engage in collective bargaining.     The ": null
    },
    {
        "Age Discrimination in Employment Act of 1967": "Age Discrimination In Employment Act Of 1967"
    },
    {
        " prohibits employment discrimination based on age with respect to employees 40 years of age or older.     Title VII of the Civil Rights Act is the principal federal statute with regard to ": null
    },
    {
        "employment discrimination": "Employment Discrimination"
    },
    {
        ", prohibiting unlawful employment discrimination by public and private employers, ": null
    },
    {
        "labour organizations": "Trade Union"
    },
    {
        ", training programmes and employment agencies based on race or colour, religion, sex and national origin. Retaliation is also prohibited by Title VII against any person for opposing any practice forbidden by statute, or for making a charge, testifying, assisting, or participating in a proceeding under the statute. The ": null
    },
    {
        "Civil Rights Act of 1991": "Civil Rights Act Of 1991"
    },
    {
        " expanded the damages available to Title VII cases and granted Title VII plaintiffs the right to jury trial.        The beginnings of halakhic labour law are in the Bible, in which two commandments refer to this subject: The law against delayed wages and the workers right to eat the employers crops . The Talmudic law—in which labour law is called laws of worker hiring —elaborates on many more aspects of employment relations, mainly in Tractate Baba Metzia. In some issues the Talamud, following the Tosefta, refers the parties to the customary law: All is as the custom of the region .   Modern halakhic labour law developed very slowly. Rabbi Israel Meir Hacohen interprets the workers right for timely payment in a tendency that clearly favours the employee over the employer, but does not refer to new questions of employment relations. Only in the 1920s we find the first halakhic authority to tackle the questions of trade unions and the right of strike . Rabbis ": null
    },
    {
        "A.I Kook": "Abraham Isaac Kook"
    },
    {
        " and ": null
    },
    {
        "B.M.H. Uziel": "Ben-Zion Meir Hai Uziel"
    },
    {
        " tend to ": null
    },
    {
        "corporatist": "Corporatism"
    },
    {
        " settling of labour ": null
    },
    {
        "conflict": "Conflict"
    },
    {
        "s, while Rabbi ": null
    },
    {
        "Moshe Feinstein": "Moshe Feinstein"
    },
    {
        " clearly adopts the liberal democratic ": null
    },
    {
        "collective bargaining": "Collective Bargaining"
    }
]