[
    {
        "        The Laconia incident was a series of events surrounding the sinking of a British ": null
    },
    {
        "troopship": "Troopship"
    },
    {
        " in the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " on 12  September 1942, during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", and a subsequent aerial attack on German and Italian submarines involved in rescue attempts. , carrying some 2,732  crew, passengers, soldiers, and ": null
    },
    {
        "prisoners of war": "Prisoners Of War"
    },
    {
        ", was torpedoed and sunk by , a German ": null
    },
    {
        "U-boat": "U-Boat"
    },
    {
        ", off the ": null
    },
    {
        "West Africa": "West Africa"
    },
    {
        "n coast. Operating partly under the dictates of the old ": null
    },
    {
        "prize rules": "Prize Rules"
    },
    {
        ", the  commander,  ": null
    },
    {
        "Werner Hartenstein": "Werner Hartenstein"
    },
    {
        ", immediately commenced rescue operations. U-156 broadcast their position on open radio channels to all ": null
    },
    {
        "Allied powers": "Allies Of World War Ii"
    },
    {
        " nearby, and were joined by the crews of several other U-boats in the vicinity.     After surfacing and picking up survivors, who were accommodated on the ": null
    },
    {
        "foredeck": "Foredeck"
    },
    {
        ", U-156 headed on the surface under ": null
    },
    {
        "Red Cross": "Red Cross"
    },
    {
        " banners to rendezvous with ": null
    },
    {
        "Vichy French": "Vichy French"
    },
    {
        " ships and transfer the survivors. En route, the U-boat was spotted by a ": null
    },
    {
        "B-24 Liberator": "B-24 Liberator"
    },
    {
        " bomber of the ": null
    },
    {
        "US Army Air Forces": "Us Army Air Forces"
    },
    {
        ". The aircrew, having reported the U-boats location, intentions, and the presence of survivors, were then ordered to attack the sub. The B-24 killed dozens of Laconias survivors with bombs and ": null
    },
    {
        "strafing": "Strafing"
    },
    {
        " attacks, forcing U-156 to cast their remaining survivors into the sea and ": null
    },
    {
        "crash dive": "Crash Dive"
    },
    {
        " to avoid being destroyed.     Rescue operations were continued by other vessels. Another U-boat, , was also attacked by US aircraft and forced to dive. A total of 1,113  survivors were rescued; however, 1,619  were killed  – mostly Italian POWs. The event changed the general attitude of Germanys naval personnel towards rescuing stranded Allied seamen. The commanders of the  were shortly issued the ": null
    },
    {
        "Laconia Order": "Laconia Order"
    },
    {
        " by Grand Admiral ": null
    },
    {
        "Karl Dönitz": "Karl Dönitz"
    },
    {
        ", which specifically forbade any such attempt and ushered in ": null
    },
    {
        "unrestricted submarine warfare": "Unrestricted Submarine Warfare"
    },
    {
        " for the remainder of the war.     The B-24 pilots mistakenly reported they had sunk , and were awarded medals for their bravery . Neither the US pilots nor their commander were punished or investigated, and the matter was quietly forgotten by the US military. During the later ": null
    },
    {
        "Nuremberg trials": "Nuremberg Trials"
    },
    {
        ", a prosecutor attempted to cite the Laconia Order as proof of ": null
    },
    {
        "war crimes": "War Crimes"
    },
    {
        " by Dönitz and his submariners. The ploy backfired and caused much embarrassment to the United States after the incidents full report had emerged.     Laconia     was built in 1921 as a civilian ocean liner. During ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " she was requisitioned for the war effort, and by 1942 had been converted into a ": null
    },
    {
        "troopship": "Troopship"
    },
    {
        ". At the time of the incident she was transporting mostly Italian ": null
    },
    {
        "prisoners of war": "Prisoners Of War"
    },
    {
        " from ": null
    },
    {
        "Cape Town": "Cape Town"
    },
    {
        " to ": null
    },
    {
        "Freetown": "Freetown"
    },
    {
        ", under the command of Captain Rudolph Sharp. The ship was carrying 463  officers and crew, 87  civilians, 286  British soldiers, 1,793  Italian prisoners and 103  Polish soldiers acting as guards of the prisoners.     Sharp had previously commanded , which had been sunk by German bombs on 17  June 1940, off the French port of ": null
    },
    {
        "Saint-Nazaire": "Saint-Nazaire"
    },
    {
        ", while taking part in ": null
    },
    {
        "Operation Aerial": "Operation Aerial"
    },
    {
        ", the evacuation of British nationals and troops from France, two weeks after the ": null
    },
    {
        "Dunkirk evacuation": "Dunkirk Evacuation"
    },
    {
        ".         Laconia    At 10 p.m., on 12 September 1942,  was on patrol off the coast of western Africa, midway between ": null
    },
    {
        "Liberia": "Liberia"
    },
    {
        " and ": null
    },
    {
        "Ascension Island": "Ascension Island"
    },
    {
        ". The submarines commanding officer,  ": null
    },
    {
        "Werner Hartenstein": "Werner Hartenstein"
    },
    {
        ", spotted the large British ship sailing alone and attacked it. Armed ships—which meant most merchantmen and troop transports—constituted legitimate targets for attack without warning. Armed as such, the Laconia fell into this category, and at 10:22  p.m. she transmitted a message on the 600-meter band: SSS SSS 0434 South / 1125 West Laconia torpedoed.  SSS was the code signifying under attack by submarine . Additional messages were transmitted, but there is no record these were received by any other vessel or station.     Although there were sufficient lifeboats for the entire ships complement, including the Italian prisoners, heavy listing prevented half from being launched until the vessel had settled. The prisoners were abandoned in the locked cargo holds as the ship sank, but most managed to escape by breaking down hatches or climbing up ventilation shafts. Several were shot when a group of prisoners rushed a lifeboat, and a large number were bayoneted to death to prevent their boarding of one of the few lifeboats available. The Polish guards were armed with rifles with fixed bayonets; however, they were not loaded and the guards carried no ammunition. Witnesses indicate that few of the prisoners were shot. Instead, most of the casualties were bayoneted.      By the time the last lifeboats were launched most survivors had already entered the water, so some lifeboats had few passengers. Only one life raft left the ship with prisoners on board; the rest jumped into the ocean. Survivors later recounted how Italians in the water were either shot or had their hands severed by axes if they tried to climb into a lifeboat. The blood soon attracted sharks.  Corporal Dino Monte, one of the few Italian survivors, stated ...  sharks darted among us. Grabbing an arm, biting a leg. Other larger beasts swallowed entire bodies. As Laconia was going under, U-156 surfaced to capture the ships surviving senior officers. To their surprise, they saw over 2,000 people struggling in the water.       Realising that the passengers were primarily POWs and civilians, Hartenstein immediately began rescue operations whilst flying the ": null
    },
    {
        "Red Cross flag": "Red Cross Flag"
    },
    {
        ". Laconia sank at 11:23  p.m., over an hour after the attack. At 1:25  a.m. on 13  September, Hartenstein sent a coded radio message to the  alerting them to the situation. It read: Sunk by Hartenstein, British Laconia, Qu  FF7721, 310  deg. Unfortunately with 1,500 Italian POWs; 90 fished out of the water so far. Request orders.      The head of submarine operations, Admiral ": null
    },
    {
        "Karl Dönitz": "Karl Dönitz"
    },
    {
        ", immediately ordered seven U-boats from the ": null
    },
    {
        "wolfpack Eisbär": "Wolfpack Eisbär"
    },
    {
        ", which had been gathering to take part in a planned surprise attack on Cape Town to divert to the scene to pick up survivors. Dönitz then informed Berlin of the situation and actions he had taken. Hitler was furious and ordered that the rescue be abandoned. Admiral ": null
    },
    {
        "Erich Raeder": "Erich Raeder"
    },
    {
        " ordered Dönitz to disengage the Eisbär boats, which included Hartensteins U-156, and send them to Cape Town as per the original plan. Raeder then ordered , commanded by  ": null
    },
    {
        "Erich Würdemann": "Erich Würdemann"
    },
    {
        ", , under Korvettenkapitän ": null
    },
    {
        "Harro Schacht": "Harro Schacht"
    },
    {
        ", and the Italian submarine  to intercept Hartenstein to take on his survivors and then to proceed to the Laconia site and rescue any Italians they could find. Raeder also requested the Vichy French to send warships from ": null
    },
    {
        "Dakar": "Dakar"
    },
    {
        " and ": null
    },
    {
        "Ivory Coast": "Ivory Coast"
    },
    {
        " to collect the Italian survivors from the three submarines.     The Vichy French, in response, sent the 7,600-ton cruiser  from Dakar, and two sloops, the fast 660-ton Annamite and the slower 2,000-ton , from ": null
    },
    {
        "Conakry": "Conakry"
    },
    {
        ", ": null
    },
    {
        "French Guinea": "French Guinea"
    },
    {
        ", and ": null
    },
    {
        "Cotonou": "Cotonou"
    },
    {
        ", ": null
    },
    {
        "Dahomey": "Dahomey"
    },
    {
        ", respectively. Dönitz disengaged the Eisbär boats and informed Hartenstein of Raeders orders, but he substituted Kapitänleutnant ": null
    },
    {
        "Helmut Wittes": "Helmut Witte"
    },
    {
        "  for U-156 in the Eisbär group and sent the order: All boats, including Hartenstein, only take as many men into the boat as will allow it to be fully ready for action when submerged.      U-156 was soon crammed above and below decks with nearly 200  survivors, including five women, and had another  200 in tow aboard four lifeboats. At 6  a.m. on 13  September, Hartenstein broadcast a message on the  band in English—": null
    },
    {
        "not in code": "Plaintext"
    },
    {
        "—to all shipping in the area, giving his position, requesting assistance with the rescue effort, and promising not to attack. It read: If any ship will assist the shipwrecked Laconia crew I will not attack her, providing I am not being attacked by ship or air force. I picked up 193  men. 4°-53  South, 11°-26  West.  – German submarine.      The British in ": null
    },
    {
        "Freetown": "Freetown"
    },
    {
        " intercepted this message but, believing it might be a ": null
    },
    {
        "ruse of war": "Ruse Of War"
    },
    {
        ", refused to credit it. Two days later, on 15  September, a message was passed to the Americans that Laconia had been torpedoed and the British merchant ship  was en route to pick up survivors. The poorly composed message implied that Laconia had only been sunk that day and made no mention that the Germans were involved in a rescue attempt under a cease-fire or that neutral French ships were also en route.     U-156 remained on the surface at the scene for the next two and a half days. At 11:30  a.m. on 15  September, she was joined by U-506, and a few hours later by both  and the . The four submarines, with lifeboats in tow and hundreds of survivors standing on their decks, headed for the African coastline and a rendezvous with the Vichy French surface warships that had set out from Senegal and Dahomey.        During the night the submarines became separated. On 16  September at 11:25  a.m., U-156 was spotted by an American ": null
    },
    {
        "B-24  Liberator": "Consolidated B-24 Liberator"
    },
    {
        " bomber flying from a secret airbase on ": null
    },
    {
        "Ascension": "Ascension Island"
    },
    {
        ". The submarine was travelling with a Red Cross flag draped across her gun deck. Hartenstein signalled to the pilot in both ": null
    },
    {
        "Morse code": "Morse Code"
    },
    {
        " and English requesting assistance. A British officer also messaged the aircraft: RAF officer speaking from German submarine, Laconia survivors on board, soldiers, civilians, women, children.      Lieutenant James D. Harden of the ": null
    },
    {
        "US Army Air Forces": "Us Army Air Forces"
    },
    {
        " did not respond to the messages; turning away, he notified his base of the situation. The senior officer on duty that day, Captain ": null
    },
    {
        "Robert Richardson III": "Robert Richardson Iii"
    },
    {
        ", who claimed that he did not know that this was a Red Cross-sanctioned German rescue operation, ordered the B-24 to sink the sub. Richardson later claimed he believed that the rules of war at the time did not permit a combat ship to fly Red Cross flags. He feared that the German submarine would attack the two Allied freighters diverted by the British to the site. He assumed that the German submarine was rescuing only the Italian POWs. In his tactical assessment, he believed that the submarine might discover and shell the secret Ascension airfield and fuel tanks, thus cutting off a critical Allied resupply air route to British forces in Egypt and Soviet forces in Russia.     Harden flew back to the scene of the rescue effort, and at 12:32  p.m., attacked with bombs and depth charges. One landed among the lifeboats in tow behind U-156, killing dozens of survivors, while others straddled the submarine itself, causing minor damage. Hartenstein cast adrift those lifeboats still afloat and ordered the survivors on his deck into the water. The submarine submerged slowly to give those still on the deck a chance to get into the water and escape. According to Hardens report, he made four runs at the submarine. On the first three the depth charges and bombs failed to release, on the fourth he dropped two bombs. The crew of the Liberator were later awarded medals for the alleged sinking of U-156, when they had in fact only sunk two lifeboats.     Ignoring Commander Hartensteins request that they stay in the area to be rescued by the Vichy French, two lifeboats decided to head for Africa. One, which began the journey with 68  people on board, reached the African coast 27  days later with only 16  survivors. The other was rescued by a British trawler after 40  days at sea. Only four of its 52  occupants were still alive.     Unaware of the attack, U-507, U-506, and Cappellini continued to pick up survivors. The following morning Commander Revedin of Cappellini found that he was rescuing survivors who had been set adrift by U-156. At 11:30  a.m. Revedin received the following message: Bordeaux to Cappellini: Reporting attack already undergone by other submarines. Be ready to submerge for action against the enemy. Put shipwrecked on rafts except women, children, and Italians, and make for minor grid-square  56 of grid-square  0971 where you will land remainder shipwrecked on to French ships. Keep British prisoners. Keep strictest watch enemy planes and submarines. End of message.      U-507 and U-506 received confirmation from headquarters of the attack on U-156 and were asked for the number of survivors rescued. Commander Schacht of U-507 replied that he had  491, of whom 15  were women and  16 were children. Commander Wurdemann of U-506 confirmed  151, including nine women and children. The next message from headquarters ordered them to cast adrift all the British and Polish survivors, mark their positions and instruct them to remain exactly where they were, then proceed with all haste to the rescue rendezvous. The respective commanders chose not to cast any survivors adrift.     The order given by Richardson has been called a  ": null
    },
    {
        "Allied war crime": "Allied War Crimes"
    },
    {
        ". Under the conventions of war at sea, ships—including submarines—engaged in rescue operations are held to be immune from attack.       Five ": null
    },
    {
        "B-25s": "North American B-25 Mitchell"
    },
    {
        " from Ascensions permanent squadron and Hardins B-24 continued to search for submarines from dawn till dusk. On 17  September, one B-25 sighted Laconias lifeboats and informed Empire Haven of their position. Hardins B-24 sighted U-506, which had 151  survivors on board including nine women and children, and attacked. On the first run the bombs failed to drop, U-506 ": null
    },
    {
        "crash dive": "Crash Dive"
    },
    {
        "d and on the second run the B-24 dropped two  bombs and two  depth charges but they caused no damage.          That same day, the British at Freetown sent an ambiguous message to Ascension informing them that three French ships from Dakar were en route. Captain Richardson assumed the French intended to invade Ascension so the submarine hunting was cancelled in order to prepare for an invasion.     The French cruiser  picked up 52  survivors, all British, while still  from the rendezvous point. Gloire then met with the sloop Annamite with both meeting U-507 and U-506 at the rendezvous point at a little after 2  p.m. on 17  September. With the exception of two British officers kept aboard U-507, the survivors were all transferred to the rescue ships. Gloire sailed off on her own and within four hours rescued another 11  lifeboats. At 10  p.m., Gloire found another lifeboat and proceeded to a planned rendezvous with Annamite.     At 1  a.m., a lookout spotted a light on the horizon, which was investigated despite this meaning Gloire would not be able to make the rendezvous, and a further 84  survivors were rescued. A new rendezvous was arranged, the ships meeting at 9:30  a.m. with Annamite transferring her survivors to Gloire. A count was then taken: 373  Italians, 70  Poles and 597  British who included 48  women and children. Gloire arrived at ": null
    },
    {
        "Dakar": "Dakar"
    },
    {
        " on 21  September to resupply before sailing for ": null
    },
    {
        "Casablanca": "Casablanca"
    },
    {
        ", arriving there on 25  September. On arrival, Colonel Baldwin, on behalf of all the British survivors, presented the captain of Cappellini with a letter that read as follows:          The submarine Cappellini had been unable to find the French warships so radioed for instructions and awaited a response. The French sloop Dumont-d’Urville was sent to rendezvous with Cappellini and by chance rescued a lifeboat from the British cargo ship Trevilley, which had been torpedoed on 12  September. After searching for other Trevilley survivors without luck, Dumont-d’Urville met Cappellini on 20  September. With the exception of six Italians and two British officers, the remaining survivors were transferred to Dumont-d’Urville, which later transferred the Italians to Annamite, which transported them to Dakar on 24  September. Of Laconia’s original complement of  2,732, only 1,113  survived. Of the 1,619  who died, 1,420 were Italian POWs.  Various survivor accounts of the incident.       From Casablanca, most of the survivors were taken to ": null
    },
    {
        "Mediouna": "Mediouna, Morocco"
    },
    {
        " to await transport to a prison camp in Germany. On 8  November, the ": null
    },
    {
        "Allied invasion of North Africa": "Operation Torch"
    },
    {
        " began liberating the survivors, who were taken aboard the ship Anton which landed them in the United States.   Merchant Navy Association     One of the survivors, Gladys Foster, wrote a detailed description of the sinking, the rescue and then subsequent two-month internment in Africa. Gladys was the wife of Chaplain to the Forces the Rev. Denis Beauchamp Lisle Foster, who was stationed in Malta. She was on board the ship with her 14-year-old daughter, Elizabeth Barbara Foster, travelling back to Britain. During the mayhem of the sinking the two were separated and it was not until days later that Gladys discovered her daughter had survived and was on another raft. She was urged to write her recollection not long after landing back in London.     Doris Hawkins, a missionary nurse survived the Laconia incident and spent 27  days adrift in Lifeboat Nine, finally coming ashore on the coast of Liberia. She was returning to England after five years in ": null
    },
    {
        "Palestine": "Mandatory Palestine"
    },
    {
        ", with 14-month-old Sally Kay Readman, who was lost to the sea as they were transferred into the lifeboat.     Doris Hawkins wrote a pamphlet entitled Atlantic Torpedo after her eventual return to England, published by Victor Gollancz in 1943. In it she writes of the moments when Sally was lost: We found ourselves on top of the arms and legs of a panic-stricken mass of humanity. The lifeboat, filled to capacity with men, women and children, was leaking badly and rapidly filling with water; at the same time it was crashing against the ship’s side. Just as Sally was passed over to me, the boat filled completely and capsized, flinging us all into the water. I lost her. I did not hear her cry even then, and I am sure that God took her immediately to Himself without suffering. I never saw her again.      Doris Hawkins was one of 16  survivors . She spent the remaining war years personally visiting the families of people who perished in the lifeboat, returning mementos entrusted to her by them in their dying moments. In Doriss words, It is impossible to imagine why I should have been chosen to survive when so many did not. I have been reluctant to write the story of our experiences, but in answer to many requests I have done so; and if it strengthens someone’s faith, if it is an inspiration to any, if it brings home to others, hitherto untouched, all that those who go down to the sea in ships face for our sakes, hour by hour, day by day, year in and year out  – it will not have been written in vain .     Survivor Jim McLoughlin states in One Common Enemy that after the incident Hartenstein asked him if he was in the ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        ", which he was, and then asked why a passenger ship was armed, stating, If it wasnt armed, I would not have attacked. McLoughlin believes this indicates Hartenstein had thought it was a troop transport rather than a passenger ship; by signalling to the Royal Navy, Laconia was acting as a  ": null
    },
    {
        "auxiliary ship": "Auxiliary Ship"
    },
    {
        ".          The Laconia incident had far-reaching consequences. Up until that point, it was common for U-boats to assist torpedoed survivors with food, water, simple medical care for the wounded, and a ": null
    },
    {
        "compass bearing": "Bearing"
    },
    {
        " to the nearest landmass. It was extremely rare for survivors to be brought on board as space on a U-boat was barely enough for its own crew. On 17  September 1942, in response to the incident, Admiral ": null
    },
    {
        "Karl Dönitz": "Karl Dönitz"
    },
    {
        " issued an order named Triton Null, later known as the ": null
    },
    {
        "Laconia Order": "Laconia Order"
    },
    {
        ". In it, Dönitz prohibited U-boat crews from attempting rescues; survivors were to be left in the sea. Even afterwards, U-boats still occasionally provided aid for survivors.     At the ": null
    },
    {
        "Nuremberg trials": "Nuremberg Trials"
    },
    {
        " held by the Allies in 1946, Dönitz was indicted for war crimes. The issuance of the Laconia Order was the centrepiece of the prosecution case, a decision that backfired badly. Its introduction allowed the defence to recount at length the numerous instances in which German submariners acted with humanity where in similar situations the Allies behaved callously. Dönitz pointed out that the order itself was a direct result of this callousness and the attack on a rescue operation by US aircraft.     The Americans had also practised ": null
    },
    {
        "unrestricted submarine warfare": "Unrestricted Submarine Warfare"
    },
    {
        ", under their own equivalent to the Laconia Order, which had been in force since they entered the war. Michel Thomas Poirier   ": null
    },
    {
        "Chief of Naval Operations": "Chief Of Naval Operations"
    },
    {
        " Submarine Warfare Division 1999 ": null
    },
    {
        "Fleet Admiral": "Fleet Admiral"
    },
    {
        " Chester Nimitz": "Chester Nimitz"
    },
    {
        ", the wartime commander-in-chief of the ": null
    },
    {
        "US Pacific Fleet": "United States Pacific Fleet"
    },
    {
        ", provided unapologetic written testimony on Dönitzs behalf at his trial that the ": null
    },
    {
        "US Navy": "Us Navy"
    },
    {
        " had waged unrestricted submarine warfare in the Pacific from the very first day the United States entered the war. This testimony led the Nuremberg Tribunal to not impose a sentence upon Dönitz, for this breach of law, even though he was convicted of the count.          The ": null
    },
    {
        "Naval War College": "Naval War College"
    },
    {
        " journal, International Law Studies, covers interpretations of ": null
    },
    {
        "international law": "International Law"
    },
    {
        " during armed conflicts and how these laws were applied by each party. In volume  65, chapter three: The Law of Naval Operations , the Laconia incident is examined in the context of the application of international law to Word War II submarine warfare:            ": null
    }
]