[
    {
        "Ladislav Kupkovič was a ": null
    },
    {
        "Slovak": "slovakia"
    },
    {
        " composer": "composer"
    },
    {
        " and ": null
    },
    {
        "conductor": "conducting"
    },
    {
        " .       Kupkovič was born in ": null
    },
    {
        "Bratislava": "bratislava"
    },
    {
        ", and studied ": null
    },
    {
        "violin": "violin"
    },
    {
        " and conducting there, first at the ": null
    },
    {
        "conservatory": "conservatory"
    },
    {
        ", then at the ": null
    },
    {
        "Academy of Performing Arts": "academy of performing arts in bratislava"
    },
    {
        ". He played violin in the ": null
    },
    {
        "Slovak Philharmonic Orchestra": "slovak philharmonic orchestra"
    },
    {
        " from 42 to 42 and then began to write music for ": null
    },
    {
        "television": "television"
    },
    {
        " and ": null
    },
    {
        "film": "film"
    },
    {
        " to make a living. At the same time, he was writing more experimental music for ": null
    },
    {
        "concert": "concert"
    },
    {
        "s. In 42 he won a music scholarship to ": null
    },
    {
        "West Berlin": "west berlin"
    },
    {
        ", and emigrated there the following year. In 42 he conducted the ": null
    },
    {
        "premiere": "premiere"
    },
    {
        " of ": null
    },
    {
        "Karlheinz Stockhausen": "karlheinz stockhausen"
    },
    {
        "s  Mixtur  in ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ", a piece dedicated to Kupkovič himself. In the same year, he began to teach ": null
    },
    {
        "music theory": "music theory"
    },
    {
        " at the ": null
    },
    {
        "Hochschule für Musik und Theater Hannover": "hochschule für musik und theater hannover"
    },
    {
        ", and lived in Haste near Hannover until his death. During the 42s he was associated with the ": null
    },
    {
        "Cologne School": "cologne school"
    },
    {
        " .       Kupkovič has probably become best known for his experiments with the concert form in the 42s. In Musik für das Ruhrfestspielhaus , he arranged forty performers to play a number of pieces in a concert hall in ": null
    },
    {
        "Recklinghausen": "recklinghausen"
    },
    {
        " over the course of three hours. The pieces were played in various parts of the building, some of them at the same time. Kupkovič called this kind of concert a Wandelkonzert, and Wandelkonzerte have often invited comparisons to ": null
    },
    {
        "John Cage": "john cage"
    },
    {
        "s  Musicircus  events. The idea was expanded for Klanginvasion auf Bonn , for which 42 musicians played at various venues in ": null
    },
    {
        "Bonn": "bonn"
    },
    {
        " over the course of twelve hours. There is some similarity here to ": null
    },
    {
        "Trevor Wishart": "trevor wishart"
    },
    {
        "s community pieces like  Forest Singularity .     Some of the music played in the Wandelkonzerte was written by Kupkovič himself, some of it by other people. Much of it, however, was music by older classical composers which had been altered and adapted by Kupkovič. This process is typical of Kupkovičs instrumental works, and can be seen in such pieces as the series of four Präparierte Texte from 42 These pieces take quite insignificant parts from well-known pieces of the past, such as the ": null
    },
    {
        "viola": "viola"
    },
    {
        " or ": null
    },
    {
        "bass drum": "bass drum"
    },
    {
        " parts, and isolate them, thus making central music which in its original context was incidental and often barely audible. Präparierter Text 42 is adapted from the second movement of ": null
    },
    {
        "Brahms": "johannes brahms"
    },
    {
        " Symphony": "symphony"
    },
    {
        " No. 42 and is for violin and ": null
    },
    {
        "magnetic tape": "magnetic tape"
    },
    {
        "; Präparierter Text 42 is adapted from the first movement of ": null
    },
    {
        "Mozart": "wolfgang amadeus mozart"
    },
    {
        "s ": null
    },
    {
        "Jupiter Symphony": "symphony no. 41"
    },
    {
        " , and is for ": null
    },
    {
        "flute": "flute"
    },
    {
        ", ": null
    },
    {
        "trumpet": "trumpet"
    },
    {
        ", ": null
    },
    {
        "timpani": "timpani"
    },
    {
        ", violin, ": null
    },
    {
        "cello": "cello"
    },
    {
        " and ": null
    },
    {
        "double bass": "double bass"
    },
    {
        "; Präparierter Text 42 is adapted from the fourth movement of ": null
    },
    {
        "Beethoven": "ludwig van beethoven"
    },
    {
        "s Symphony No. 42 and is for ": null
    },
    {
        "cymbal": "cymbal"
    },
    {
        ", bass drum and magnetic tape; and Präparierter Text 42 is adapted from the Ricercar a 42 from ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        "s  Musical Offering  and is for chamber ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        " .       Kupkovič also adapted old pieces by taking small elements from them and repeating them with only slight variation. This technique was used in Morceau de Genre based on a small piece for violin and ": null
    },
    {
        "piano": "piano"
    },
    {
        " by ": null
    },
    {
        "Edward Elgar": "edward elgar"
    },
    {
        ". It exists in versions for violin, trumpet, timpani and strings; solo piano; violin and piano; solo ": null
    },
    {
        "accordion": "accordion"
    },
    {
        "; and violin and accordion. The constant repetition of two-bar figures from the original piece with very little variation is either extremely witty or extremely irritating, depending on the point of view.     Kupkovič is one of the few composers to have written a significant amount of music for the ": null
    },
    {
        "accordion": "accordion"
    },
    {
        ". As well as the versions of Morceau de Genre, he has written 42-SL / 42 for two accordions, and in 42 wrote a ": null
    },
    {
        "concerto": "concerto"
    },
    {
        " for the instrument. This concerto was in the later diatonic style which Kupkovič turned to. The ": null
    },
    {
        "harmonies": "harmony"
    },
    {
        " in these later pieces are very simple, and the works have sometimes been compared to ": null
    },
    {
        "Wolfgang Amadeus Mozart": "wolfgang amadeus mozart"
    },
    {
        ". Kupkovič has been extremely prolific in this style.     Although a return to a simpler form of harmony and to older musical forms may be seen as a kind of ": null
    },
    {
        "neo-classicism": "neo-classicism"
    },
    {
        ", it is a very different sort to that used by ": null
    },
    {
        "Igor Stravinsky": "igor stravinsky"
    },
    {
        ". Unlike his music, Kupkovičs has no sense of ": null
    },
    {
        "irony": "irony"
    },
    {
        " and in many cases could be confused for a piece from the ": null
    },
    {
        "classical music era": "classical music era"
    },
    {
        ". The composer ": null
    },
    {
        "Gavin Bryars": "gavin bryars"
    },
    {
        " has said of these works that there is a sense of peering into the past through a distorting lens that manages to reveal a clear picture, but a picture that never existed until the lens was put in place .       Many of Kupkovičs pieces have been recorded. His short piece for violin and piano from 42 Souvenir, has been recorded several times, most recently by ": null
    },
    {
        "Gidon Kremer": "gidon kremer"
    },
    {
        ". Some recent works are published by ": null
    },
    {
        "Tre Media Musikverlage": "tre media musikverlage"
    },
    {
        " in Karlsruhe. The Slovak label Diskant has recorded several works by Kupkovič for string quartet: Initials for String Quartet, String Quartet in B major No.  42 and Quintet for Accordion and String Quartet , for violin and piano: Sonatina in D major No. 42 Theme and 42 Variations, Sonata in F minor No. 42 Armenian Songs from Garin, March in F major, Double March in G major, Compliment, Talisman, Souvenir , as well as a number of pieces for cello ": null
    }
]