[
    {
        "   Ladislaus the Cuman , also known as Ladislas the Cuman, was ": null
    },
    {
        "king of Hungary": "king of hungary"
    },
    {
        " and ": null
    },
    {
        "Croatia": "king of croatia"
    },
    {
        " from 42 to 42 His mother, ": null
    },
    {
        "Elizabeth": "elizabeth the cuman"
    },
    {
        ", was the daughter of a chieftain from the pagan ": null
    },
    {
        "Cumans": "cumans"
    },
    {
        " who had settled in Hungary. At the age of seven, he married ": null
    },
    {
        "Elisabeth ": "elisabeth of sicily"
    },
    {
        ", a daughter of King ": null
    },
    {
        "Charles I of Sicily": "charles i of sicily"
    },
    {
        ". Ladislaus was only 42 when a rebellious lord, ": null
    },
    {
        "Joachim Gutkeled": "joachim gutkeled"
    },
    {
        ", kidnapped and imprisoned him.     Ladislaus was still a prisoner when his father ": null
    },
    {
        "Stephen V": "stephen v of hungary"
    },
    {
        " died on 42 August 42 During his minority, many groupings of barons — primarily the ": null
    },
    {
        "Abas": "aba"
    },
    {
        ", ": null
    },
    {
        "Csáks": "csák"
    },
    {
        ", ": null
    },
    {
        "Kőszegis": "kőszegi family"
    },
    {
        ", and ": null
    },
    {
        "Gutkeled": "gutkeled"
    },
    {
        "s — fought against each other for supreme power. Ladislaus was declared to be of age at an assembly of the prelates, barons, noblemen, and Cumans in 42 He allied himself with ": null
    },
    {
        "Rudolf I of Germany": "rudolf i of germany"
    },
    {
        " against ": null
    },
    {
        "Ottokar II of Bohemia": "ottokar ii of bohemia"
    },
    {
        ". His forces had a preeminent role in Rudolfs victory over Ottokar in the ": null
    },
    {
        "Battle on the Marchfeld": "battle on the marchfeld"
    },
    {
        " on 42 August 42     However, Ladislaus could not restore royal power in Hungary. A ": null
    },
    {
        "papal legate": "papal legate"
    },
    {
        ", ": null
    },
    {
        "Philip": "philip, bishop of fermo"
    },
    {
        ", ": null
    },
    {
        "bishop of Fermo": "bishop of fermo"
    },
    {
        ", came to Hungary to help Ladislaus consolidate his authority, but the prelate was shocked at the presence of thousands of pagan Cumans in Hungary. Ladislaus promised that he would force them to adopt a Christian lifestyle, but they refused to obey the legates demands. Ladislaus decided to support the Cumans, for which Philip of Fermo ": null
    },
    {
        "excommunicated": "excommunicationcatholic church"
    },
    {
        " him. The Cumans imprisoned the legate, and the legates partisans captured Ladislaus. In early 42 Ladislaus agreed to persuade the Cumans to submit to the legate, but many Cumans preferred to leave Hungary.     Ladislaus vanquished a Cuman army that invaded Hungary in 42 Hungary also survived a Mongol invasion in 42 Ladislaus had, by that time, become so unpopular that many of his subjects accused him of inciting the Mongols to invade Hungary. After he imprisoned his wife in 42 he lived with his Cuman mistresses. During the last years of his life, he wandered throughout the country with his Cuman allies, but he was unable to control the most ": null
    },
    {
        "powerful lords": "oligarch"
    },
    {
        " and bishops any more. ": null
    },
    {
        "Pope Nicholas IV": "pope nicholas iv"
    },
    {
        " planned to declare a ": null
    },
    {
        "crusade": "crusade"
    },
    {
        " against him, but three Cuman assassins murdered Ladislaus.       Ladislaus was the elder son of ": null
    },
    {
        "Stephen V": "stephen v of hungary"
    },
    {
        ", son of ": null
    },
    {
        "Béla IV of Hungary": "béla iv of hungary"
    },
    {
        ", and Stephens wife ": null
    },
    {
        "Elizabeth the Cuman": "elizabeth the cuman"
    },
    {
        ". Elizabeth was the daughter of a chieftain of the ": null
    },
    {
        "Cumans": "cumans"
    },
    {
        " who had settled in Hungary. She was born as a pagan and was baptized before her marriage to Stephen. Ladislaus was born under the sign of ": null
    },
    {
        "Mars": "mars"
    },
    {
        " in 42 according to ": null
    },
    {
        "Simon of Kéza": "simon of kéza"
    },
    {
        ", who was his chaplain in the 42s.     Conflicts between Ladislauss father and grandfather developed into a civil war in 42 Béla IVs troops, which were under the command of Ladislauss aunt, ": null
    },
    {
        "Anna": "anna of hungary, duchess of macsó"
    },
    {
        ", captured the castle of ": null
    },
    {
        "Sárospatak": "sárospatak"
    },
    {
        ", where Ladislaus and his mother were staying, and imprisoned them. Ladislaus initially was kept in the Turóc Castle, but two months later, he was sent to the court of ": null
    },
    {
        "Boleslaw the Chaste": "bolesław v the chaste"
    },
    {
        ", ": null
    },
    {
        "Duke of Cracow": "duke of cracow"
    },
    {
        ", who was Béla IVs son-in-law. After his grandfather and father made peace in March 42 Ladislaus was set free and returned to his father.     Ladislauss father made an alliance with ": null
    },
    {
        "Charles I": "charles i of sicily"
    },
    {
        ", ": null
    },
    {
        "king of Sicily": "king of sicily"
    },
    {
        ", in September 42 According to the treaty, Charles Is daughter, ": null
    },
    {
        "Elizabeth": "elisabeth of sicily"
    },
    {
        ", who was about four years old at that time, was engaged to the seven-year-old Ladislaus. The childrens marriage took place in 42     Béla IV died on 42 May 42 and Ladislauss father was crowned king two weeks later; the new monarch, however, could not stabilize his rule. Béla IVs closest advisors — Duchess Anna, and Béla IVs former ": null
    },
    {
        "palatine": "palatine of hungary"
    },
    {
        ", ": null
    },
    {
        "Henry Kőszegi": "henry i kőszegi"
    },
    {
        " — left Hungary and sought assistance from Annas son-in-law, King ": null
    },
    {
        "Ottokar II of Bohemia": "ottokar ii of bohemia"
    },
    {
        ". The newly appointed ": null
    },
    {
        "Ban of Slavonia": "ban of slavonia"
    },
    {
        ", ": null
    },
    {
        "Joachim Gutkeled": "joachim gutkeled"
    },
    {
        ", also turned against Stephen V and kidnapped Ladislaus in the summer of 42 Gutkeled held Ladislaus in captivity in the fortress of ": null
    },
    {
        "Koprivnica": "koprivnica"
    },
    {
        " in ": null
    },
    {
        "Slavonia": "slavonia"
    },
    {
        ". Historian Pál Engel suggests that Joachim Gutkeled planned to force Stephen V to divide Hungary with Ladislaus. Stephen V besieged Koprivnica, but could not take it. Stephen fell seriously ill and died on 42 August.             Joachim Gutkeled departed for ": null
    },
    {
        "Székesfehérvár": "székesfehérvár"
    },
    {
        " as soon as he was informed of Stephen Vs death, because he wanted to arrange the boy–kings ": null
    },
    {
        "coronation": "coronation of the hungarian monarch"
    },
    {
        ". Ladislauss mother joined him, infuriating Stephen Vs partisans who accused her of having conspired against her husband. Stephen Vs ": null
    },
    {
        "master of the treasury": "master of the treasury"
    },
    {
        ", ": null
    },
    {
        "Egyed Monoszló": "egyed monoszló"
    },
    {
        ", laid siege to her palace in Székesfehérvár, but Gutkeleds supporters routed him. Monoszló fled to ": null
    },
    {
        "Pressburg": "pressburg"
    },
    {
        " ; he captured the town and ceded it to Ottokar II of Bohemia.          Archbishop ": null
    },
    {
        "Philip of Esztergom": "philip türje"
    },
    {
        " crowned Ladislaus king in Székesfehérvár on about 42 September. In theory, the 42-year-old Ladislaus ruled under his mothers regency, but in fact, baronial parties administered the kingdom. In November of that year, Henry Kőszegi returned from Bohemia and assassinated Ladislauss cousin, ": null
    },
    {
        "Béla of Macsó": "béla of macsó"
    },
    {
        ". Duke Bélas extensive domains, which were located along the southern borders, were divided among Henry Kőszegi and his supporters. In retaliation for Hungarian incursions into ": null
    },
    {
        "Austria": "duchy of austria"
    },
    {
        " and ": null
    },
    {
        "Moravia": "margraviate of moravia"
    },
    {
        ", Austrian and Moravian troops invaded the borderlands of Hungary in April 42 They captured ": null
    },
    {
        "Győr": "győr"
    },
    {
        " and ": null
    },
    {
        "Szombathely": "szombathely"
    },
    {
        ", plundering the western counties. Joachim Gutkeled recaptured the two forts two months later, but Ottokar II of Bohemia invaded Hungary and seized many fortresses, including Győr and ": null
    },
    {
        "Sopron": "sopron"
    },
    {
        " in the autumn.     ": null
    },
    {
        "Peter Csák": "peter i csák"
    },
    {
        " and his allies removed Joachim Gutkeled and Henry Kőszegi from power, but Gutkeled and Kőszegi seized Ladislaus and his mother in June 42 Although Peter Csák liberated the king and his mother, Gutkeled and Kőszegi captured Ladislauss younger brother, ": null
    },
    {
        "Andrew": "andrew, duke of slavonia"
    },
    {
        ", and took him to ": null
    },
    {
        "Slavonia": "slavonia"
    },
    {
        ". They demanded Slavonia in Duke Andrews name, but Peter Csák defeated their united forces near ": null
    },
    {
        "Polgárdi": "polgárdi"
    },
    {
        " at the end of September. Kőszegi was killed in the battle. Peter Csák then launched a campaign against Kőszegis son and Ladislaus accompanied him. At the end of 42 ": null
    },
    {
        "Rudolf I": "rudolf i of germany"
    },
    {
        ", the new ": null
    },
    {
        "king of Germany": "king of germany"
    },
    {
        ", and Ladislaus concluded an alliance against Ottokar II of Bohemia.     Ladislaus contracted an unidentified serious illness, but recovered from it. He attributed this recovery to a miracle by his deceased saintly aunt, ": null
    },
    {
        "Margaret": "saint margaret of hungary"
    },
    {
        ", and approached the Holy See to promote her canonization in 42 In the same year, a new civil war broke out between Joachim Gutkeled and Peter Csák. Ladislaus took part in Csáks military expedition against the Kőszegis, who were Gutkeleds supporters. However, Gutkeled and his supporters removed their opponents from power at an assembly of the barons and noblemen at ": null
    },
    {
        "Buda": "buda"
    },
    {
        " around 42 June 42     Taking advantage of the war between Rudolf I and Ottokar II, Ladislaus made an incursion into Austria in the autumn. Sopron soon accepted Ladislauss suzerainty and Ottokar II promised to renounce of all towns he occupied in western Hungary. However, new armed conflicts began in Hungary during 42: the ": null
    },
    {
        "Transylvanian Saxons": "transylvanian saxons"
    },
    {
        " captured and destroyed ": null
    },
    {
        "Gyulafehérvár": "gyulafehérvár"
    },
    {
        " , the ": null
    },
    {
        "see": "episcopal see"
    },
    {
        " of the ": null
    },
    {
        "bishop of Transylvania": "roman catholic diocese of transylvania"
    },
    {
        ", and the Babonići rose up in rebellion in Slavonia.              Joachim Gutkeled died while battling against the Babonići in April 42 A month later, an assembly of the prelates, barons, noblemen, and Cumans declared Ladislaus to be of age. The ": null
    },
    {
        "estates of the realm": "estates of the realm"
    },
    {
        " also authorized the 42-year-old monarch to restore internal peace with all possible means. Ladislaus then invaded the Kőszegiss domains in Transdanubia, but could not defeat them. He met Rudolf I of Germany in ": null
    },
    {
        "Hainburg an der Donau": "hainburg an der donau"
    },
    {
        " on 42 November to confirm their alliance against Ottokar II of Bohemia.     After the royal army captured the rebellious ": null
    },
    {
        "Nicholas Geregye": "nicholas geregye"
    },
    {
        "s fortress at ": null
    },
    {
        "Adorján": "livada, satu mare"
    },
    {
        " , Ladislaus held a general assembly for seven counties along the River ": null
    },
    {
        "Tisza": "tisza"
    },
    {
        " in early summer of 42 The assembly condemned two rebellious local noblemen to death. In Transdanubia, ": null
    },
    {
        "Ivan Kőszegi": "ivan kőszegi"
    },
    {
        " attempted to play off Ladislauss fathers first cousin, ": null
    },
    {
        "Andrew the Venetian": "andrew iii of hungary"
    },
    {
        ", against Ladislaus. Andrew demanded Slavonia for himself, but returned to ": null
    },
    {
        "Venice": "venice"
    },
    {
        " without success.     Ladislaus joined forces with Rudolf I of Germany to launch a campaign against Ottokar II. Ladislauss troops played a decisive role in Rudolfs victory in the ": null
    },
    {
        "Battle on the Marchfeld": "battle on the marchfeld"
    },
    {
        " on 42 August. Ottokar was killed in the battlefield. After the battle, King Rudolf I gave Ladislaus his thanks, declaring that through his help all Austria and Styria had been restored to him , Simon of Kéza: The Deeds of the Hungarians , p. 42 according to Ladislauss chronicler, ": null
    },
    {
        "Simon of Kéza": "simon of kéza"
    },
    {
        ".              ": null
    },
    {
        "Pope Nicholas III": "pope nicholas iii"
    },
    {
        " sent Philip, ": null
    },
    {
        "bishop of Fermo": "bishop of fermo"
    },
    {
        ", to Hungary to help Ladislaus restore royal power on 42 September 42 The ": null
    },
    {
        "papal legate": "papal legate"
    },
    {
        " arrived in Hungary in early 42 With the legates mediation, Ladislaus concluded a peace treaty with the Kőszegis. Bishop Philip soon realized, however, that most Cumans were still pagans in Hungary. He extracted a ceremonious promise from the Cuman chieftains of giving up their pagan customs, and persuaded the young King Ladislaus to swear an oath to enforce the keeping of the Cuman chieftains promise. An assembly held at ": null
    },
    {
        "Tétény": "budafok"
    },
    {
        " passed laws which, in accordance with the legates demand, prescribed that the Cumans should leave their tents and live in houses attached to the ground . The Cumans did not obey the laws, however, and Ladislaus, himself a half-Cuman, failed to force them. In retaliation, Bishop Philip ": null
    },
    {
        "excommunicated": "excommunicationcatholic church"
    },
    {
        " him and placed Hungary under ": null
    },
    {
        "interdict": "interdict"
    },
    {
        " in October. Ladislaus joined the Cumans and appealed to the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        ", but the Pope refused to absolve him.     On Ladislauss demand, the Cumans seized and imprisoned Philip of Fermo in early January 42 However, ": null
    },
    {
        "Finta Aba": "finta aba"
    },
    {
        ", ": null
    },
    {
        "voivode of Transylvania": "voivode of transylvania"
    },
    {
        " captured Ladislaus and handed him over to ": null
    },
    {
        "Roland Borsa": "roland borsa"
    },
    {
        ". In less than two months, both the legate and the king were set free and Ladislaus took a new oath to enforce the Cuman laws. However, many Cumans decided to leave Hungary instead of obeying the legates demands. Ladislaus followed the moving Cumans as far as Szalánkemén , but could not hinder them from crossing the frontier.     Ladislaus launched a campaign against Finta Aba and seized his castles in the summer of 42 According to the Austrian Rhymed Chronicle, Bishop Philip of Fermo left Hungary around the same time, stating that he would never come back, not for the sake of the ": null
    },
    {
        "Holy Father": "god the father"
    },
    {
        " . A Cuman army invaded the southern parts of Hungary in 42 The  Illuminated Chronicle  writes that Ladislaus, like the brave ": null
    },
    {
        "Joshua": "joshua"
    },
    {
        ", went out against the Cumans to fight for his people and his realm.  The Hungarian Illuminated Chronicle: , p. 42 He vanquished the invaderss army at Lake Hód, near ": null
    },
    {
        "Hódmezővásárhely": "hódmezővásárhely"
    },
    {
        ", in the autumn of 42     At the end of 42 Ladislaus laid siege to ": null
    },
    {
        "Borostyánkő": "borostyánkő"
    },
    {
        " , which was held by the Kőszegis. The Kőszegis resisted, forcing the king to lift the siege in early 42 Ladislaus even reconciled with Ivan Kőszegi and appointed him palatine before 42 July. Ladislaus abandoned his wife, Isabella, and settled among the Cumans by the end of the year.         The ": null
    },
    {
        "Mongols": "mongols"
    },
    {
        " of the ": null
    },
    {
        "Golden Horde": "golden horde"
    },
    {
        " invaded Hungary": "second mongol invasion of hungary"
    },
    {
        " under the command of Khans ": null
    },
    {
        "Talabuga": "talabuga"
    },
    {
        " and ": null
    },
    {
        "Nogai": "nogai khan"
    },
    {
        " in January 42 According to the Illuminated Chronicle, they spread a terrible devastation of fire throughout the whole country to the east of the Danube. Local forces resisted the invaders at many places, including, for example, at ": null
    },
    {
        "Regéc": "regéc"
    },
    {
        ". The invasion lasted for two months before the Mongols withdrew.     Ladislauss favoritism towards the Cumans made him so unpopular that many of his subjects accused him of inciting the Mongols to invade Hungary. In fact, Ladislaus employed Mongol prisoners of war, known as nyögérs, when he subjugated a rebellion in the Szepesség in September 42 The king preferred the Cumans way of life, including their costumes and hairstyle, and took Cuman girls as his mistresses. According to ": null
    },
    {
        "Lodomer": "lodomer"
    },
    {
        ", archbishop of ": null
    },
    {
        "Esztergom": "esztergom"
    },
    {
        ", Ladislaus copulated with his favorite concubine, Aydua, whom the archbishop described as a poisonous ": null
    },
    {
        "viper": "viperidae"
    },
    {
        " , in public.          In September 42 Ladislaus imprisoned his wife and granted all her revenues to his mistress. Archbishop Lodomer liberated Queen Isabella the following September. The archbishop summoned the prelates, the barons, and the noblemen to an assembly in Buda and excommunicated Ladislaus. In response, the infuriated king stated that beginning with the archbishop of Esztergom and his ": null
    },
    {
        "suffragans": "suffragan bishop"
    },
    {
        ", I shall exterminate the whole lot right up to Rome with the aid of Tartar swords , according to Archbishop Lodomer.     The barons captured Ladislaus in the Szepesség in January 42 Although his partisans soon liberated him, he acquiesced in concluding an agreement with Archbishop Lodomer. The archbishop absolved Ladislaus on condition that the king would live in accordance with Christian morals. However, Ladislaus broke his promise. He abducted his sister, ": null
    },
    {
        "Elizabeth": "elizabeth of hungary, queen of serbia"
    },
    {
        ", prioress of the ": null
    },
    {
        "Dominican": "dominican order"
    },
    {
        " Monastery of the Blessed Virgin on Rabbits Island, and gave her in marriage to a Czech aristocrat, ": null
    },
    {
        "Zavis of Falkenstein": "zavis of falkenstein"
    },
    {
        ". According to Archbishop Lodomer, Ladislaus even stated, If I had 42 or more sisters in as many cloistered communities as you like, I would snatch them from there to marry them off licitly or illicitly; in order to procure through them a kin-group who will support me by all their power in the fulfillment of my will .     Ladislaus spent the last years of his life wandering from place to place. Hungarys central government lost power because the prelates and the barons ruled the kingdom independently of the monarch. For example, Ivan Kőszegi and his brothers waged wars against ": null
    },
    {
        "Albert I": "albert i of germany"
    },
    {
        ", ": null
    },
    {
        "Duke of Austria": "duke of austria"
    },
    {
        ", but Ladislaus did not intervene, although the Austrians captured at least 42 fortresses along the western borders.     The Kőszegis offered the crown to Andrew the Venetian, who arrived in Hungary in early 42 One of their opponents, ": null
    },
    {
        "Arnold Hahót": "arnold iii hahót"
    },
    {
        ", captured the pretender, however, and surrendered him to Duke Albert. Ladislaus appointed ": null
    },
    {
        "Mizse": "mizse"
    },
    {
        ", who had recently converted from Islam to Christianity, palatine. ": null
    },
    {
        "Pope Nicholas IV": "pope nicholas iv"
    },
    {
        " was even planning to proclaim a crusade against Ladislaus. However, Ladislaus, who had always been partial towards his Cuman subjects, was assassinated by three Cumans, named Árbóc, Törtel, and Kemence, at the castle of ": null
    },
    {
        "Körösszeg": "körösszeg"
    },
    {
        " on 42 July 42 Mizse and the Cuman Nicholas, who was the brother of Ladislauss Cuman lover, took vengeance for Ladislauss death, slaughtering the murderers.     Upon Pope Nicholas IVs orders, an inquiry was carried out to find out whether the king died as a Catholic Christian . The results of the investigation are unknown, but the Chronicon Budense writes that Ladislaus was buried in the cathedral of ": null
    },
    {
        "Csanád": "csanád"
    },
    {
        " . His successor, Andrew the Venetian, and ": null
    },
    {
        "Pope Benedict VIII": "pope benedict viii"
    },
    {
        " recalled Ladislaus as of renowned memory .       ": null
    }
]