[
    {
        "      Patrick Lafcadio Hearn , known also by the Japanese name , was a writer, known best for his books about ": null
    },
    {
        "Japan": "Japan"
    },
    {
        ", especially his collections of Japanese ": null
    },
    {
        "legends": "Legend"
    },
    {
        "and ": null
    },
    {
        "ghost stories": "Kwaidan"
    },
    {
        ", such as  Kwaidan: Stories and Studies of Strange Things . In the United States, Hearn is also known for his writings about the city of ": null
    },
    {
        "New Orleans": "New Orleans"
    },
    {
        " based on his ten-year stay in that city.     Born in ": null
    },
    {
        "Greece": "Greece"
    },
    {
        " to a Greek mother and an Irish father, a complex series of conflicts and events led to young Lafcadio Hearn being moved to ": null
    },
    {
        "Ireland": "Ireland"
    },
    {
        ", where he was abandoned first by his mother , then his father and finally by his fathers aunt, who had been appointed his official guardian. At the age of 19 he was put on a boat to the United States, where he found a job as newspaper reporter, first in ": null
    },
    {
        "Cincinnati": "Cincinnati"
    },
    {
        ", ": null
    },
    {
        "Ohio": "Ohio"
    },
    {
        ", and later in New Orleans. From there he was sent as a correspondent, first to the ": null
    },
    {
        "French West Indies": "French West Indies"
    },
    {
        ", where he stayed for two years, and then to Japan, where he would remain for the rest of his life.     In Japan he married a Japanese woman with whom he had four children, and became a naturalized Japanese citizen. His writings about Japan offered the Western world a glimpse into a largely unknown but fascinating culture.           Hearn was born in and named after the island of ": null
    },
    {
        "Lefkada": "Lefkada"
    },
    {
        ", one of the Greek ": null
    },
    {
        "Ionian Islands": "Ionian Islands"
    },
    {
        ", on 27 June 1850.   He was the son of ": null
    },
    {
        "British Army": "British Army"
    },
    {
        " surgeon Charles Bush Hearn  and Rosa Antoniou Kassimatis, a Greek woman of noble ": null
    },
    {
        "Kytheran": "Kythira"
    },
    {
        " lineage through her father, Anthony Kassimatis. His father was stationed in Lefkada during the British ": null
    },
    {
        "proctectorate": "Amical Protectorate"
    },
    {
        " of the ": null
    },
    {
        "United States of the Ionian Islands": "United States Of The Ionian Islands"
    },
    {
        ". Lafcadio was baptized Patricios Lefcadios Hearn in the ": null
    },
    {
        "Greek Orthodox Church": "Church Of Greece"
    },
    {
        ", but he seems to have been called Patrick Lefcadio Kassimati Charles Hearn in English. According to one of his biographers, a family Bible records Patricio Lafcadio Tessima Carlos Hearn, August 1850.  Hearns parents were married in a Greek Orthodox ceremony on 25 November 1849, several months after his mother had given birth to the couples first child, Hearns older brother, George Robert Hearn, on 24 July 1849. George Hearn died on 17 August 1850, two months after Lafcadios birth.         Hearns father was promoted to ": null
    },
    {
        "Staff Surgeon Second Class": "Royal_Army_Medical_Corpsofficer_Ranks"
    },
    {
        " and in 1850 was reassigned from ": null
    },
    {
        "Lefkada": "Lefkada"
    },
    {
        " to the ": null
    },
    {
        "British West Indies": "British West Indies"
    },
    {
        ". Since his family did not approve of the marriage, and worried that his relationship might harm his career prospects, Charles Hearn did not inform his superiors of his son or pregnant wife and left his family behind. In 1852, he arranged to send his son and wife to live with his family in ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        ", Ireland, where they received a cool reception. Charles Hearns Protestant mother, Elizabeth Holmes Hearn, had difficulty accepting Rosa Hearns Catholicism and lack of education . Rosa found it difficult to adapt to a foreign culture and the Protestantism of her husbands family, and was eventually taken under the wing of Elizabeths sister, Sarah Holmes Brenane, a widow who had converted to Catholicism.     Despite Sarah Brenanes efforts, Rosa suffered from homesickness. When her husband returned to Ireland on medical leave in 1853, it became clear that the couple had become estranged. Charles Hearn was assigned to the ": null
    },
    {
        "Crimean Peninsula": "Crimean Peninsula"
    },
    {
        ", again leaving his pregnant wife and child in Ireland. When he came back in 1856, severely wounded and traumatized, Rosa had returned to her home island of ": null
    },
    {
        "Cerigo": "Cerigo"
    },
    {
        " in Greece, where she gave birth to their third son, Daniel James Hearn. Lafcadio had been left in the care of Sarah Brenane.     Charles Hearn petitioned to have the marriage with Rosa annulled, on the basis of her lack of signature on the marriage contract, which made it invalid under English law. After being informed of the annulment, Rosa almost immediately married Giovanni Cavallini, a Greek citizen of Italian ancestry who was later appointed by the British as governor of ": null
    },
    {
        "Cerigotto": "Cerigotto"
    },
    {
        ". Cavallini required as a condition of the marriage that Rosa give up custody of both Lafcadio and James. As a result, James was sent to his father in Dublin and Lafcadio remained in the care of Sarah Brenane . Neither Lafcadio nor James saw their mother again, who had four children with her second husband. Rosa was eventually committed to the National Mental Asylum on ": null
    },
    {
        "Corfu": "Corfu"
    },
    {
        ", where she died in 1882.      Charles Hearn, who had left Lafcadio in the care of Sarah Brenane for the past 4 years, now appointed her as Lafcadios permanent guardian. He married his childhood sweetheart, Alicia Goslin, in July 1857, and left with his new wife for a posting in ": null
    },
    {
        "Secunderabad": "Secunderabad"
    },
    {
        ", where they had three daughters prior to Alicias death in 1861. Lafcadio never saw his father again: Charles Hearn died of malaria in the ": null
    },
    {
        "Gulf of Suez": "Gulf Of Suez"
    },
    {
        " in 1866.      In 1857, at age seven and despite the fact that both his parents were still alive, Hearn became the permanent ward of his great aunt, Sarah Brenane. She divided her residency between Dublin in the winter months, her husbands estate at ": null
    },
    {
        "Tramore": "Tramore"
    },
    {
        ", ": null
    },
    {
        "County Waterford": "County Waterford"
    },
    {
        " on the southern Irish coast, and a house at ": null
    },
    {
        "Bangor, North Wales": "Bangor, Gwynedd"
    },
    {
        ". Brenane also engaged a tutor during the school year to provide basic instruction and the rudiments of Catholic dogma. Hearn began exploring Brenanes library and read extensively in Greek literature, especially myths.        In 1861, Hearns aunt, aware that Hearn was turning away from Catholicism, and at the urging of Henry Hearn Molyneux, a relative of her late husband and a distant cousin of Hearn, enrolled him at the Institution Ecclésiastique, a Catholic church school in ": null
    },
    {
        "Yvetot": "Yvetot"
    },
    {
        ", France. Hearns experiences at the school confirmed his lifelong conviction that Catholic education consisted of conventional dreariness and ugliness and dirty austerities and long faces and ": null
    },
    {
        "Jesuit": "Jesuit"
    },
    {
        "ry and infamous distortion of childrens brains.  Hearn became fluent in French and would later translate into English the works of ": null
    },
    {
        "Guy de Maupassant": "Guy De Maupassant"
    },
    {
        ".     In 1863, again at the suggestion of Molyneux, Hearn was enrolled at ": null
    },
    {
        "St. Cuthberts College, Ushaw": "Ushaw College"
    },
    {
        ", a Catholic ": null
    },
    {
        "seminary": "Seminary"
    },
    {
        " at what is now the ": null
    },
    {
        "University of Durham": "University Of Durham"
    },
    {
        ". In this environment, Hearn adopted the nickname Paddy to try to fit in better, and was the top student in English composition for three years.  At age 16, while at Ushaw, Hearn injured his left eye in a schoolyard mishap. The eye became infected and, despite consultations with specialists in Dublin and London, and a year spent out of school convalescing, went blind. Hearn also suffered from severe ": null
    },
    {
        "myopia": "Myopia"
    },
    {
        ", so his injury left him permanently with poor vision, requiring him to carry a magnifying glass for close work and a pocket telescope to see anything beyond a short distance . The iris was permanently discolored, and left Hearn self-conscious about his appearance for the rest of his life, causing him to cover his left eye while conversing and always posing for the camera in profile so that the left eye was not visible.      In 1867, Henry Molyneux, who had become Sarah Brenanes financial manager, went bankrupt, along with Brenane. There was no money for tuition, and Hearn was sent to Londons East End to live with Brenanes former maid. She and her husband had little time or money for Hearn, who wandered the streets, spent time in workhouses, and generally lived an aimless, rootless existence. His main intellectual activities consisted of visits to libraries and the ": null
    },
    {
        "British Museum": "British Museum"
    },
    {
        ".        By 1869, Henry Molyneux had recovered some financial stability and Brenane, now 75, was infirm. Resolving to end his expenditures on the 19-year-old Hearn, he purchased a one-way ticket to New York and instructed Hearn to find his way to ": null
    },
    {
        "Cincinnati": "Cincinnati"
    },
    {
        ", to locate Molyneuxs sister and her husband, Thomas Cullinan, and to obtain their assistance in making a living. Upon meeting Hearn in Cincinnati, the family had little assistance to offer: Cullinan gave him $5 and wished him luck in seeking his fortune. As Hearn would later write, I was dropped moneyless on the pavement of an American city to begin life.       For a time, he was impoverished, living in stables or store rooms in exchange for menial labor.  He eventually befriended the English printer and communalist ": null
    },
    {
        "Henry Watkin": "Henry Watkin"
    },
    {
        ", who employed him in his printing business, helped find him various odd jobs, lent him books from his library, including utopianists ": null
    },
    {
        "Fourier": "Charles Fourier"
    },
    {
        ", ": null
    },
    {
        "Dixon": "Hepworth Dixon"
    },
    {
        " and ": null
    },
    {
        "Noyes": "John Humphrey Noyes"
    },
    {
        ", and gave Hearn a nickname which stuck with him for the rest of his life, ": null
    },
    {
        "The Raven": "The Raven"
    },
    {
        ", from the ": null
    },
    {
        "Poe": "Edgar Allan Poe"
    },
    {
        " poem. Hearn also frequented the ": null
    },
    {
        "Cincinnati Public Library": "Cincinnati Public Library"
    },
    {
        ", which at that time had an estimated 50,000 volumes. In the spring of 1871 a letter from Henry Molyneux informed him of Sarah Brenanes death and Molyneuxs appointment as sole executor. Despite Brenane having named him as the beneficiary of an annuity when she became his guardian, Hearn received nothing from the estate and never heard from Molyneux again.        By the strength of his talent as a writer, Hearn obtained a job as a reporter for the  Cincinnati Daily Enquirer , working for the newspaper from 1872 to 1875. Writing with creative freedom in one of Cincinnatis largest circulating newspapers, he became known for his lurid accounts of local murders, developing a reputation as the papers premier sensational journalist, as well as the author of sensitive accounts of some of the disadvantaged people of Cincinnati.  The Library of America  selected one of these murder accounts, Gibbeted, for inclusion in its two-century retrospective of American True Crime, published in 2008.  After one of his murder stories, the Tanyard Murder, had run for several months in 1874, Hearn established his reputation as Cincinnatis most audacious journalist, and the Enquirer raised his salary from $10 to $25 per week.           In 1874, Hearn and the young ": null
    },
    {
        "Henry Farny": "Henry Farny"
    },
    {
        ", later a renowned painter of the American West, wrote, illustrated, and published an 8-page weekly journal of art, literature and satire entitled Ye Giglampz. The Cincinnati Public Library reprinted a facsimile of all nine issues in 1983. The work was considered by a twentieth century critic to be Perhaps the most fascinating sustained project he undertook as an editor.      Enquirer ": null
    },
    {
        "anti-miscegenation law": "Anti-Miscegenation Laws In The United States"
    },
    {
        " at that time. In August 1875, in response to complaints from local clergyman about his anti-religious views and pressure from local politicians embarrassed by some of his satirical writing in Ye Giglampz, the Enquirer fired him, citing as its reason his illegal marriage. He went to work for the rival newspaper The Cincinnati Commercial. The Enquirer offered to re-hire him after his stories began appearing in the Commercial and its circulation began increasing, but Hearn, incensed at the papers behavior, refused. Hearn and Foley separated, but attempted reconciliation several times before divorcing in 1877. Foley remarried in 1880.      While working for the Commercial Hearn agreed to be carried to the top of Cincinnatis tallest building on the back of a famous ": null
    },
    {
        "steeplejack": "Steeplejack"
    },
    {
        ", Joseph Roderiguez Weston, and wrote a half-terrified, half-comic account of the experience. It was also during this time that Hearn wrote a series of accounts of the Bucktown and Levee neighborhoods of Cincinnati, ...one of the few depictions we have of black life in a border city during the post-Civil War period.  He also wrote about local black song lyrics from the era, including a song titled Shiloh that was dedicated to a Bucktown resident named Limber Jim.  In addition, Hearn had printed in the Commercial a stanza he had overheard when listening to the songs of the ": null
    },
    {
        "roustabout": "Roustabout"
    },
    {
        "s, working on the citys levee waterfront. Similar stanzas were recorded in song by ": null
    },
    {
        "Julius Daniels": "Julius Daniels"
    },
    {
        " in 1926 and ": null
    },
    {
        "Tommy McClennan": "Tommy Mcclennan"
    },
    {
        " in his version of ": null
    },
    {
        "Bottle Up and Go": "Bottle Up And Go"
    },
    {
        " .             During the autumn of 1877, recently divorced from Mattie Foley and restless, Hearn had begun neglecting his newspaper work in favor of translating into English works of the French author ": null
    },
    {
        "Gautier": "Théophile Gautier"
    },
    {
        ". He had also grown increasingly disenchanted with Cincinnati, writing to Henry Watkin, It is time for a fellow to get out of Cincinnati when they begin to call it the Paris of America. With the support of Watkin and Cincinnati Commercial publisher ": null
    },
    {
        "Murat Halstead": "Murat Halstead"
    },
    {
        ", Hearn left Cincinnati for ": null
    },
    {
        "New Orleans": "New Orleans"
    },
    {
        ", where he initially wrote dispatches on the Gateway to the Tropics for the Commercial.     Hearn lived in New Orleans for nearly a decade, writing first for the newspaper Daily City Item beginning in June 1878, and later for the Times Democrat. Since the Item was a 4-page publication, Hearns editorial work changed the character of the newspaper dramatically. He began at the Item as a news editor, expanding to include book reviews of ": null
    },
    {
        "Bret Harte": "Bret Harte"
    },
    {
        " and ": null
    },
    {
        "Émile Zola": "Émile Zola"
    },
    {
        ", summaries of pieces in national magazines such as  Harpers , and editorial pieces introducing Buddhism and Sanskrit writings. As editor, Hearn created and published nearly two hundred woodcuts of daily life and people in New Orleans, making the Item the first Southern newspaper to introduce cartoons and giving the paper an immediate boost in circulation. Hearn gave up carving the woodcuts after six months when he found the strain was too great for his eye.           At the end of 1881, Hearn took an editorial position with the New Orleans  Times Democrat  and was employed translating items from French and Spanish newspapers as well as writing editorials and cultural reviews on topics of his choice. He also continued his work translating French authors into English: ": null
    },
    {
        "Gérard de Nerval": "Gérard De Nerval"
    },
    {
        ", ": null
    },
    {
        "Anatole France": "Anatole France"
    },
    {
        ", and most notably ": null
    },
    {
        "Pierre Loti": "Pierre Loti"
    },
    {
        ", an author who influenced Hearns own writing style.  Milton Bronner, who edited Hearns letters to ": null
    },
    {
        "Henry Watkin": "Henry Watkin"
    },
    {
        ", wrote: e Hearn of New Orleans was the father of the Hearn of the West Indies and of Japan, and this view was endorsed by Norman Foerster. Norman Foerster , American Poetry and Prose, Revised and Enlarged Edition, Boston: Houghton Mifflin, p. 1149; Hearn, Lafcadio , Letters from the Raven: Being the Correspondence of Lafcadio Hearn with Henry Watkin , ed., Milton Bronner, New York: ": null
    },
    {
        "Brentanos": "Brentanos"
    },
    {
        ". During his tenure at the Times Democrat, Hearn also developed a friendship with editor Page Baker, who went on to champion Hearns literary career; their correspondence is archived at the ": null
    },
    {
        "Loyola University New Orleans": "Loyola University New Orleans"
    },
    {
        " Special Collections & Archives.      The vast number of his writings about New Orleans and its environs, many of which have not been collected, include the citys ": null
    },
    {
        "Creole": "Louisiana Creole People"
    },
    {
        " population and distinctive cuisine, the French Opera, and ": null
    },
    {
        "Louisiana Voodoo": "Louisiana Voodoo"
    },
    {
        ". Hearn wrote enthusiastically of New Orleans, but also wrote of the citys decay, a dead bride crowned with orange flowers .      Hearns writings for national publications, such as  Harpers Weekly  and  Scribners Magazine , helped create the popular reputation of New Orleans as a place with a distinct culture more akin to that of Europe and the Caribbean than to the rest of North America. Hearns best-known Louisiana works include:   Gombo zhèbes: Little dictionary of Creole proverbs   La Cuisine Créole , a collection of culinary recipes from leading chefs and noted Creole housewives who helped make New Orleans famous for its cuisine   Chita: A Memory of Last Island , a novella based on the ": null
    },
    {
        "hurricane of 1856": "1856 Last Island Hurricane"
    },
    {
        " first published in  Harpers Monthly  in 1888     Hearn also published in  Harpers Weekly  the first known written article about ": null
    },
    {
        "Filipinos in the United States": "Filipino Americanhistory"
    },
    {
        ", the Manilamen or ": null
    },
    {
        "Tagalogs": "Tagalog People"
    },
    {
        ", one of whose villages he had visited at ": null
    },
    {
        "Saint Malo": "Saint Malo, Louisiana"
    },
    {
        ", southeast of ": null
    },
    {
        "Lake Borgne": "Lake Borgne"
    },
    {
        " in ": null
    },
    {
        "St. Bernard Parish, Louisiana": "St. Bernard Parish, Louisiana"
    },
    {
        ".          At the time he lived there, Hearn was little known, and even now he is little known for his writing about New Orleans, except by local cultural devotees. However, more books have been written about him than any former resident of New Orleans except ": null
    },
    {
        "Louis Armstrong": "Louis Armstrong"
    },
    {
        ". .     Hearns writings for the New Orleans newspapers included impressionistic descriptions of places and characters and many editorials denouncing political corruption, street crime, violence, intolerance, and the failures of public health and hygiene officials. Despite the fact that he is credited with inventing New Orleans as an exotic and mysterious place, his obituaries of the ": null
    },
    {
        "vodou": "Louisiana Voodoo"
    },
    {
        " leaders ": null
    },
    {
        "Marie Laveau": "Marie Laveau"
    },
    {
        " and ": null
    },
    {
        "Doctor John Montenet": "Doctor John Montenet"
    },
    {
        " are matter-of-fact and debunking. Selections of Hearns New Orleans writings have been collected and published in several works, starting with Creole Sketches  in 1924, and more recently in Inventing New Orleans: Writings of Lafcadio Hearn.      Two Years in the French West Indies Harpers  sent Hearn to the ": null
    },
    {
        "West Indies": "Caribbean"
    },
    {
        " as a correspondent in 1887. He spent two years in ": null
    },
    {
        "Martinique": "Martinique"
    },
    {
        " and in addition to his writings for the magazine, produced two books: Two Years in the French West Indies and Youma, The Story of a West-Indian Slave, both published in 1890.              In 1890, Hearn went to Japan with a commission as a newspaper correspondent, which was quickly terminated. It was in Japan, however, that he found a home and his greatest inspiration. Through the goodwill of ": null
    },
    {
        "Basil Hall Chamberlain": "Basil Hall Chamberlain"
    },
    {
        ", Hearn gained a teaching position during the summer of 1890 at the Shimane Prefectural Common Middle School and Normal School in ": null
    },
    {
        "Matsue": "Matsue, Shimane"
    },
    {
        ", a town in western Japan on the coast of the ": null
    },
    {
        "Sea of Japan": "Sea Of Japan"
    },
    {
        ". The ": null
    },
    {
        "Lafcadio Hearn Memorial Museum": "Lafcadio Hearn Memorial Museum"
    },
    {
        " and his old residence are still two of Matsues most popular tourist attractions. During his fifteen-month stay in Matsue, Hearn married Koizumi Setsu, the daughter of a local ": null
    },
    {
        "samurai": "Samurai"
    },
    {
        " family, with whom he had four children. Kazuo, Iwao, Kiyoshi, and Suzuko: Katharine Chubbuck, Hearn, Lafcadio Carlos , Oxford Dictionary of National Biography, Oxford University Press, 2004 He became a naturalized Japanese, assuming the name Koizumi Yakumo, in 1896 after accepting a teaching position in Tokyo. After having been Greek Orthodox, Roman Catholic, and, later on, ": null
    },
    {
        "Spencerian": "Herbert Spencer"
    },
    {
        ", he became Buddhist. Norman Foerster , American Poetry and Prose, Revised and Enlarged Edition, Boston: Houghton Mifflin, p. 1149.          During late 1891, Hearn obtained another teaching position in ": null
    },
    {
        "Kumamoto": "Kumamoto"
    },
    {
        ", ": null
    },
    {
        "Kyūshū": "Kyūshū"
    },
    {
        ", at the Fifth Higher Middle School, where he spent the next three years and completed his book Glimpses of Unfamiliar Japan . In October 1894, he secured a journalism job with the English-language newspaper Kobe Chronicle, and in 1896, with some assistance from Chamberlain, he began teaching ": null
    },
    {
        "English literature": "English Literature"
    },
    {
        " at ": null
    },
    {
        "Tokyo Imperial University": "Tokyo Imperial University"
    },
    {
        ", a job he had until 1903. In 1904, he was a professor at ": null
    },
    {
        "Waseda University": "Waseda University"
    },
    {
        ".     While in Japan he encountered the art of ": null
    },
    {
        "ju-jutsu": "Ju-Jutsu"
    },
    {
        " which made a deep impression upon him:           On 26 September 1904, he died of heart failure at the age of 54 years. His grave is at the ": null
    },
    {
        "Zōshigaya Cemetery": "Zōshigaya Cemetery"
    },
    {
        " in ": null
    },
    {
        "Toshima, Tokyo": "Toshima, Tokyo"
    },
    {
        ".      In the late 19th century, Japan was still largely unknown and exotic to Westerners. However, with the introduction of Japanese aesthetics, particularly at the Paris ": null
    },
    {
        "Exposition Universelle of 1900": "Exposition Universelle"
    },
    {
        ", Japanese styles became fashionable in Western countries. Consequently, Hearn became known to the world by his writings concerning Japan. In later years, some critics would accuse Hearn of ": null
    },
    {
        "exoticizing": "Exoticism"
    },
    {
        " Japan, but because he offered the West some of its first descriptions of pre-industrial and ": null
    },
    {
        "Meiji Era": "Meiji Era"
    },
    {
        " Japan, his work is generally regarded as having historical value. Komakichi, Nohara, The True Face of Japan, Guo, Nanyang , , New Zealand Journal of Asian Studies 3 , 106–118 Askew, Rie , , New Zealand Journal of Asian Studies 11 , 44–71            Admirers of Hearns work have included ": null
    },
    {
        "Ben Hecht": "Ben Hecht"
    },
    {
        ", . ": null
    },
    {
        "John Erskine": "John Erskine"
    },
    {
        ", and ": null
    },
    {
        "Malcolm Cowley": "Malcolm Cowley"
    },
    {
        ". .     The Japanese director ": null
    },
    {
        "Masaki Kobayashi": "Masaki Kobayashi"
    },
    {
        " adapted four Hearn tales into his 1964 film,  Kwaidan . Some of his stories have been adapted by ": null
    },
    {
        "Ping Chong": "Ping Chong"
    },
    {
        " into his ": null
    },
    {
        "puppet": "Puppet"
    },
    {
        " theatre, including the 1999 Kwaidan and the 2002 OBON: Tales of Moonlight and Rain.     ": null
    },
    {
        "Yone Noguchi": "Yone Noguchi"
    },
    {
        " is quoted as saying about Hearn, His Greek temperament and French culture became frost-bitten as a flower in the North. Noguchi, Yone , Lafcadio Hearn in Japan, New York: Mitchell Kennerley.     There is also a cultural center named after Hearn at the ": null
    },
    {
        "University of Durham": "University Of Durham"
    },
    {
        ".     Hearn was a major translator of the short stories of ": null
    },
    {
        "Guy de Maupassant": "Guy De Maupassant"
    },
    {
        ". .     The first museum in Europe for Lafcadio Hearn was inaugurated in Lefkada, Greece, his birthplace, on 4 July 2014, as Lefcadio Hearn Historical Center. It contains early editions, rare books and Japanese collectibles. The visitors, through photos, texts and exhibits, can wander in the significant events of Lafcadio Hearns life, but also in the civilizations of Europe, America and Japan of the late eighteenth and early nineteenth centuries through his lectures, writings and tales. The municipalities of ": null
    },
    {
        "Kumamoto": "Kumamoto"
    },
    {
        ", ": null
    },
    {
        "Matsue": "Matsue"
    },
    {
        ", ": null
    },
    {
        "Shinjuku": "Shinjuku"
    },
    {
        ", ": null
    },
    {
        "Yaizu": "Yaizu"
    },
    {
        ", ": null
    },
    {
        "Toyama University": "Toyama University"
    },
    {
        ", the Koizumi family and other people from Japan and Greece contributed to the establishment of Lefcadio Hearn Historical Center.      He is also depicted as the main base for Yukari Yakumo and Maribel Hearn in ": null
    },
    {
        "Touhou Project": "Touhou Project"
    },
    {
        " games and audio CDs               Source:    Glimpses of Unfamiliar Japan   Out of the East: Reveries and Studies in New Japan   Kokoro: Hints and Echoes of Japanese Inner Life   http://www.sacred-texts.com/bud/gbf/index.htm Gleanings in Buddha-Fields: Studies of Hand and Soul in the Far East   The Boy who Drew Cats,   Exotics and Retrospectives   Japanese Fairy Tales   http://www.sacred-texts.com/shi/igj/index.htm In Ghostly Japan   Shadowings   Japanese Lyrics   A Japanese Miscellany   Kottō: Being Japanese Curios, with Sundry Cobwebs    Kwaidan: Stories and Studies of Strange Things     http://www.sacred-texts.com/shi/jai/index.htm Japan: An Attempt at Interpretation   The Romance of the Milky Way and other studies and stories       La Cuisine Creole: A Collection of Culinary Recipes   Gombo Zhèbes : A Little Dictionary of Creole Proverbs, Selected from Six Creole Dialects.   Chita: A Memory of Last Island   Creole Sketches       Letters from the Raven; being the correspondence of Lafcadio Hearn with Henry Watkin   Includes Letters from the Raven, Letters to a Lady, Letters of Ozias Midwinter Leaves from the Diary of an Impressionist   Interpretations of Literature   Karma   On Reading in Relation to Literature   Lectures on Shakespeare   Insect-musicians and other stories and sketches   Japans Religions: Shinto and Buddhism   Books and Habits; from the Lectures of Lafcadio Hearn   Writings from Japan: An Anthology   Lafcadio Hearns America: Ethnographic Sketches and Editorials   Lafcadio Hearns Japan: An Anthology of His Writings on the Country and Its People   American Writings   Insect Literature         One of Cleopatras Nights and Other Fantastic Romances by Théophile Gautier    Tales from Theophile Gautier    The Crime of Sylvestre Bonnard by Anatole France     The Temptation of Saint Anthony by Gustave Flaubert    Stories from Emile Zola    The tales of Guy de Maupassant        Stray Leaves From Strange Literature; Stories Reconstructed from the Anvari-Soheili, Baital Pachisi, Mahabharata, Pantchantra, Gulistan, Talmud, Kalewala, etc.   Some Chinese Ghosts   Youma, the Story of a West-Indian Slave   Two Years in the French West Indies": null
    }
]