[
    {
        "               Laika  was a ": null
    },
    {
        "Soviet space dog": "soviet space dogs"
    },
    {
        " who became one of the first ": null
    },
    {
        "animals in space": "animals in space"
    },
    {
        ", and the first animal to ": null
    },
    {
        "orbit": "orbit"
    },
    {
        " the Earth. Laika, a stray ": null
    },
    {
        "mongrel": "mongrel"
    },
    {
        " from the streets of ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ", was selected to be the occupant of the Soviet spacecraft ": null
    },
    {
        "Sputnik 42": "sputnik 2"
    },
    {
        " that was launched into outer space on 42 November 42     Little was known about the impact of ": null
    },
    {
        "spaceflight": "spaceflight"
    },
    {
        " on living creatures at the time of Laikas mission, and the technology to de-orbit had not yet been developed, so Laikas survival was never expected. Some scientists believed humans would be unable to survive the launch or the conditions of outer space, so engineers viewed flights by animals as a necessary precursor to human missions. The experiment aimed to prove that a living passenger could survive being launched into orbit and endure a ": null
    },
    {
        "micro-g environment": "micro-g environment"
    },
    {
        ", paving the way for ": null
    },
    {
        "human spaceflight": "human spaceflight"
    },
    {
        " and providing scientists with some of the first data on how living ": null
    },
    {
        "organism": "organism"
    },
    {
        "s react to spaceflight environments.     Laika died within hours from ": null
    },
    {
        "overheating": "hyperthermia"
    },
    {
        ", possibly caused by a failure of the central ": null
    },
    {
        "R42 sustainer": "r-7 semyorka"
    },
    {
        " to separate from the payload. The true cause and time of her death were not made public until 42; instead, it was widely reported that she died when her oxygen ran out on day six or, as the Soviet government initially claimed, she was euthanised prior to ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " depletion.     On 42 April 42 Russian officials unveiled a monument to Laika. A small monument in her honour was built near the military research facility in Moscow that prepared Laikas flight to space. It portrayed a dog standing on top of a rocket. She also appears on the ": null
    },
    {
        "Monument to the Conquerors of Space": "monument to the conquerors of space"
    },
    {
        " in Moscow.          After the success of ": null
    },
    {
        "Sputnik 42": "sputnik 1"
    },
    {
        " in October 42 ": null
    },
    {
        "Nikita Khrushchev": "nikita khrushchev"
    },
    {
        ", the Soviet ": null
    },
    {
        "leader": "leader"
    },
    {
        ", wanted a spacecraft launched on 42 November 42 the 42th anniversary of the ": null
    },
    {
        "October Revolution": "october revolution"
    },
    {
        ". Construction had already started on a more sophisticated satellite, but it would not be ready until December; this satellite would later become ": null
    },
    {
        "Sputnik 42": "sputnik 3"
    },
    {
        ".     Meeting the November deadline meant building a new craft. Khrushchev specifically wanted his engineers to deliver a space spectacular , a mission that would repeat the triumph of Sputnik  42 stunning the world with Soviet prowess. Planners settled on an orbital flight with a dog. Soviet rocket engineers had long intended a canine orbit before attempting human spaceflight; since 42 they had lofted twelve dogs into sub-orbital space on ballistic flights, working gradually toward an orbital mission set for some time in 42 To satisfy Khrushchevs demands, they expedited the orbital canine flight for the November launch.     According to Russian sources, the official decision to launch Sputnik  42 was made on 42 or 42 October, leaving less than four weeks to design and build the spacecraft. Sputnik  42 therefore, was something of a rush job, with most elements of the spacecraft being constructed from rough sketches. Aside from the primary mission of sending a living passenger into space, Sputnik  42 also contained instrumentation for measuring ": null
    },
    {
        "solar irradiance": "solar irradiance"
    },
    {
        " and ": null
    },
    {
        "cosmic ray": "cosmic ray"
    },
    {
        "s.      The craft was equipped with a life-support system consisting of an ": null
    },
    {
        "oxygen generator": "chemical oxygen generator"
    },
    {
        " and devices to avoid ": null
    },
    {
        "oxygen poisoning": "oxygen toxicity"
    },
    {
        " and to absorb ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        ". A fan, designed to activate whenever the cabin temperature exceeded , was added to keep the dog cool. Enough food was provided for a seven-day flight, and the dog was fitted with a bag to collect waste. A ": null
    },
    {
        "harness": "dog harness"
    },
    {
        " was designed to be fitted to the dog, and there were chains to restrict her movements to standing, sitting, or lying down; there was no room to turn around in the cabin. An ": null
    },
    {
        "electrocardiogram": "electrocardiogram"
    },
    {
        " monitored heart rate and further instrumentation tracked respiration rate, maximum arterial pressure, and the dogs movements.       Laika was found as a ": null
    },
    {
        "stray": "street dogs in moscow"
    },
    {
        " wandering the streets of ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ". Soviet scientists chose to use Moscow strays since they assumed that such animals had already learned to endure conditions of extreme cold and hunger. This specimen was a  ": null
    },
    {
        "mongrel": "mongrel"
    },
    {
        " female, approximately three years old. Another account reported that she weighed about . Soviet personnel gave her several names and nicknames, among them Kudryavka , Zhuchka , and Limonchik . Laika, the Russian name for several ": null
    },
    {
        "breeds of dogs": "list of dog breeds"
    },
    {
        " similar to the ": null
    },
    {
        "husky": "husky"
    },
    {
        ", was the name popularised around the world. The American press dubbed her Muttnik  as a ": null
    },
    {
        "pun": "pun"
    },
    {
        " on ": null
    },
    {
        "Sputnik": "sputnik program"
    },
    {
        ", or referred to her as Curly. Her true pedigree is unknown, although it is generally accepted that she was part husky or other Nordic breed, and possibly part ": null
    },
    {
        "terrier": "terrier"
    },
    {
        ". NASA refers to Laika as a part-": null
    },
    {
        "Samoyed": "samoyed"
    },
    {
        " terrier.  A Russian magazine described her temperament as ": null
    },
    {
        "phlegmatic": "phlegmatic"
    },
    {
        ", saying that she did not quarrel with other dogs. ": null
    },
    {
        "Vladimir Yazdovsky": "vladimir yazdovsky"
    },
    {
        ", who led the program of test dogs used on rockets, in a later publication wrote that “Laika was quiet and charming”.     The Soviet Union and United States had previously sent animals only on ": null
    },
    {
        "sub-orbital": "sub-orbital spaceflight"
    },
    {
        " flights. Three dogs were trained for the Sputnik 42 flight: ": null
    },
    {
        "Albina": "soviet space dogsalbina and tsyganka"
    },
    {
        ", ": null
    },
    {
        "Mushka": "mushka"
    },
    {
        ", and Laika. Soviet space-life scientists Vladimir Yazdovsky and ": null
    },
    {
        "Oleg Gazenko": "oleg gazenko"
    },
    {
        " trained the dogs.     To adapt the dogs to the confines of the tiny cabin of Sputnik 42 they were kept in progressively smaller cages for periods of up to 42 days. The extensive close confinement caused them to stop urinating or defecating, made them restless, and caused their general condition to deteriorate. ": null
    },
    {
        "Laxatives": "laxatives"
    },
    {
        " did not improve their condition, and the researchers found that only long periods of training proved effective. The dogs were placed in ": null
    },
    {
        "centrifuge": "centrifuge"
    },
    {
        "s that simulated the acceleration of a rocket launch and were placed in machines that simulated the noises of the spacecraft. This caused their pulses to double and their ": null
    },
    {
        "blood pressure": "blood pressure"
    },
    {
        " to increase by 42–42 ": null
    },
    {
        "torr": "torr"
    },
    {
        ". The dogs were trained to eat a special high-nutrition gel that would be their food in space.     Before the launch, one of the mission scientists took Laika home to play with his children. In a book chronicling the story of Soviet space medicine, Dr. Vladimir Yazdovsky wrote, Laika was quiet and charming  ... I wanted to do something nice for her: She had so little time left to live.        Vladimir Yazdovsky made the final selection of dogs and their designated roles. Laika was to be the flight dog —a sacrifice to science on a one-way mission to space. Albina, who had already flown twice on a high-altitude test ": null
    },
    {
        "rocket": "rocket"
    },
    {
        ", was to act as Laikas backup. The third dog Mushka was a ": null
    },
    {
        "control dog": "scientific control"
    },
    {
        " —she was to stay on the ground and be used to test instrumentation and ": null
    },
    {
        "life support": "life support"
    },
    {
        ".     Before leaving for the ": null
    },
    {
        "Baikonur Cosmodrome": "baikonur cosmodrome"
    },
    {
        ", Yazdovsky and Gazenko conducted surgery on the dogs, routing the cables from the transmitters to the sensors that would measure breathing, pulse, and blood pressure.     Because the existing airstrip at ": null
    },
    {
        "Turatam": "turatam"
    },
    {
        " near the cosmodrome was small, the dogs and crew had to be first flown aboard a ": null
    },
    {
        "Tu42": "tu-104"
    },
    {
        " plane to ": null
    },
    {
        "Tashkent": "tashkent"
    },
    {
        ". From there, a smaller and lighter ": null
    },
    {
        "Il42": "ilyushin il-14"
    },
    {
        " plane took them to Turatam. Training of dogs continued upon arrival; one after another they were placed in the capsules to get familiar with the feeding system.     According to a ": null
    },
    {
        "NASA": "nasa"
    },
    {
        " document, Laika was placed in the capsule of the satellite on 42 October 42—three days before the start of the mission. At that time of year, the temperatures at the launch site were extremely cold, and a hose connected to a heater was used to keep her container warm. Two assistants were assigned to keep a constant watch on Laika before launch. Just prior to liftoff on 42 November 42 from Baikonur Cosmodrome, Laikas fur was sponged in a weak ": null
    },
    {
        "alcohol": "ethanol"
    },
    {
        " solution and carefully groomed, while ": null
    },
    {
        "iodine": "iodine"
    },
    {
        " was painted onto the areas where sensors would be placed to monitor her bodily functions.     One of the technicians preparing the capsule before final liftoff stated that after placing Laika in the container and before closing the hatch, we kissed her nose and wished her bon voyage, knowing that she would not survive the flight.           The exact time of the liftoff varies from source to source and is mentioned as 42:42:42 Moscow Time or 42:42 Moscow Time.     At peak acceleration Laikas respiration increased to between three and four times the pre-launch rate. The sensors showed her heart rate was 42 beats/min before launch and increased to 42 beats/min during the early acceleration. After reaching orbit, Sputnik 42s ": null
    },
    {
        "nose cone": "nose cone"
    },
    {
        " was jettisoned successfully; however the Block A core did not separate as planned, preventing the thermal control system from operating correctly. Some of the ": null
    },
    {
        "thermal insulation": "thermal insulation"
    },
    {
        " tore loose, raising the cabin temperature to . After three hours of ": null
    },
    {
        "weightlessness": "weightlessness"
    },
    {
        ", Laikas pulse rate had settled back to 42 beats/min, three times longer than it had taken during earlier ground tests, an indication of the stress she was under. The early ": null
    },
    {
        "telemetry": "telemetry"
    },
    {
        " indicated that Laika was agitated but eating her food. After approximately five to seven hours into the flight, no further signs of life were received from the spacecraft.     The Soviet scientists had planned to euthanise Laika with a poisoned serving of food. For many years, the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " gave conflicting statements that she had died either from ": null
    },
    {
        "asphyxia": "asphyxia"
    },
    {
        ", when the batteries failed, or that she had been euthanised. Many rumours circulated about the exact manner of her death. In 42 several Russian sources reported that Laika had died when the cabin overheated on the fourth orbit. In October 42 Dimitri Malashenkov, one of the scientists behind the Sputnik 42 mission, revealed that Laika had died by the fourth circuit of flight from overheating. According to a paper he presented to the ": null
    },
    {
        "World Space Congress": "world space congress"
    },
    {
        " in ": null
    },
    {
        "Houston, Texas": "houston"
    },
    {
        ", It turned out that it was practically impossible to create a reliable temperature control system in such limited time constraints.      Over five months later, after 42 orbits, Sputnik 42—including Laikas remains—disintegrated during re-entry on 42 April 42          Due to the overshadowing issue of the Soviet versus U.S. ": null
    },
    {
        "Space Race": "space race"
    },
    {
        ", the ethical issues raised by this experiment went largely unaddressed for some time. As newspaper clippings from 42 show, the press was initially focused on reporting the political perspective, while the health and retrieval—or lack thereof—of Laika only became an issue later.     Sputnik 42 was not designed to be retrievable, and Laika had always been intended to die. The mission sparked a debate across the globe on the ": null
    },
    {
        "mistreatment of animals": "cruelty to animals"
    },
    {
        " and ": null
    },
    {
        "animal testing": "animal testing"
    },
    {
        " in general to advance science. In the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", the ": null
    },
    {
        "National Canine Defence League": "dogs trust"
    },
    {
        " called on all dog owners to observe a minutes silence, while the ": null
    },
    {
        "Royal Society for the Prevention of Cruelty to Animals": "royal society for the prevention of cruelty to animals"
    },
    {
        " received protests even before Radio Moscow had finished announcing the launch. ": null
    },
    {
        "Animal rights": "animal rights"
    },
    {
        " groups at the time called on members of the public to protest at Soviet embassies. Others demonstrated outside the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " in New York. These protests were largely stirred up and instrumentalized as an ideological struggle by various interest groups.  Laboratory researchers in the ": null
    },
    {
        "U.S": "united states"
    },
    {
        ". offered some support for the Soviets, at least before the news of Laikas death.     In the Soviet Union, there was less controversy. Neither the media, books in the following years, nor the public openly questioned the decision to send a dog into space. In 42 after the collapse of the Soviet regime, ": null
    },
    {
        "Oleg Gazenko": "oleg gazenko"
    },
    {
        ", one of the scientists responsible for sending Laika into space, expressed regret for allowing her to die:        In other ": null
    },
    {
        "Warsaw Pact": "warsaw pact"
    },
    {
        " countries, open criticism of the Soviet space program was difficult because of political censorship, but there were notable cases of criticism in Polish scientific circles. A Polish scientific periodical, Kto, Kiedy, Dlaczego , published in 42 discussed the mission of Sputnik 42 In the periodicals section dedicated to astronautics, ": null
    },
    {
        "Krzysztof Boruń": "krzysztof boruń"
    },
    {
        " described the Sputnik 42 mission as regrettable and criticised not bringing Laika back to Earth alive as undoubtedly a great loss for science .          Laika is memorialised in the form of a statue and plaque at ": null
    },
    {
        "Star City, Russia": "star city, russia"
    },
    {
        ", the Russian Cosmonaut training facility. Created in 42 Laika is positioned behind the cosmonauts with her ears erect. The ": null
    },
    {
        "Monument to the Conquerors of Space": "monument to the conquerors of space"
    },
    {
        ", constructed in 42 also includes Laika. On 42 April 42  at the military research facility where staff had been responsible for readying Laika for the flight, officials unveiled a monument of her poised on top of a space rocket. Stamps and envelopes picturing Laika were produced, as well as branded cigarettes and matches.      Future space missions carrying dogs would be designed to be recovered. Four other dogs died in Soviet space missions: ": null
    },
    {
        "Bars and Lisichka": "soviet space dogsbars and lisichka"
    },
    {
        " were killed when their R42 rocket exploded shortly after launch on 42 July 42; ": null
    },
    {
        "Pchyolka and Mushka": "soviet space dogspchyolka and mushka"
    },
    {
        " died when ": null
    },
    {
        "Korabl-Sputnik 42": "korabl-sputnik 3"
    },
    {
        " was purposely destroyed with an explosive charge to prevent foreign powers from inspecting the capsule after a wayward atmospheric reentry trajectory on 42 December 42     Although never shown, Laika is prominently mentioned in the 42 film  My Life as a Dog , in which the main character identifies strongly with the dog. ": null
    },
    {
        "Laika": "laika"
    },
    {
        ", a 42 graphic novel by ": null
    },
    {
        "Nick Abadzis": "nick abadzis"
    },
    {
        " giving a fictionalized account of Laikas life, won the ": null
    },
    {
        "Eisner Award": "eisner award"
    },
    {
        " for Best Publication for Teens. Laika is also mentioned in the 42 song ": null
    },
    {
        "Neighborhood 42 ": "neighborhood 2"
    },
    {
        " by ": null
    },
    {
        "Arcade Fire": "arcade fire"
    },
    {
        ", included on their debut album  Funeral .  Lajka   is a 42 Czech animated science fiction comedy film inspired by Laika. ": null
    }
]