[
    {
        "     Lake Van , the largest lake in ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        ", lies in the far east of ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        " in the provinces of ": null
    },
    {
        "Van": "van province"
    },
    {
        " and ": null
    },
    {
        "Bitlis": "bitlis province"
    },
    {
        ". It is a ": null
    },
    {
        "saline": "salt lake"
    },
    {
        " soda lake": "soda lake"
    },
    {
        ", receiving water from numerous small streams that descend from the surrounding mountains. Lake Van is one of the worlds largest ": null
    },
    {
        "endorheic lake": "endorheic lake"
    },
    {
        "s & mdash;a volcanic eruption ": null
    },
    {
        "blocked": "volcanic dam"
    },
    {
        " the original outlet from the basin in prehistoric times. Although Lake Van has an altitude of  in a region with harsh winters, its high salinity prevents most of it from freezing, and even the shallow northern section freezes only rarely.            Lake Van is  across at its widest point, averaging a depth of  with a maximum recorded depth of . The lake surface lies  above sea level and the shore length is . Lake Van has an area of  and a volume of .     The western portion of the lake is deepest, with a large basin deeper than  lying northeast of ": null
    },
    {
        "Tatvan": "tatvan"
    },
    {
        " and south of ": null
    },
    {
        "Ahlat": "ahlat"
    },
    {
        ". The eastern arms of the lake are shallower. The Van-Ahtamar portion shelves gradually, with a maximum depth of about  on its northwest side where it joins the rest of the lake. The Erciş arm is much shallower, mostly less than , with a maximum depth of about .     The lake water is strongly ": null
    },
    {
        "alkaline": "alkaline"
    },
    {
        "  and rich in ": null
    },
    {
        "sodium carbonate": "sodium carbonate"
    },
    {
        " and other salts, which are extracted by evaporation and used as ": null
    },
    {
        "detergent": "detergent"
    },
    {
        "s.       Lake Van is primarily a ": null
    },
    {
        "tectonic lake": "laketectonic lakes"
    },
    {
        ", formed more than 42 years ago by the gradual subsidence of a large block of the earths crust due to movement on several major faults that run through this portion of Eastern Anatolia. The lakes southern margin marks the boundary between metamorphic rocks of the Bitlis Massif and volcanic strata from the ": null
    },
    {
        "Neogene": "neogene"
    },
    {
        " and ": null
    },
    {
        "Quaternary": "quaternary"
    },
    {
        " periods. The deep, western portion of the lake is a dome-shaped basin lying in a tectonic depression formed by a combination of ": null
    },
    {
        "normal": "normal fault"
    },
    {
        " and ": null
    },
    {
        "strike-slip": "strike-slip fault"
    },
    {
        " faulting and thrusting.     The lakes proximity to the ": null
    },
    {
        "Karlıova Triple Junction": "karlıova triple junction"
    },
    {
        " has resulted in fluids from the Earths ": null
    },
    {
        "mantle": "mantle"
    },
    {
        " accumulating in the strata beneath Lake Van, driving some of its geological evolution. Dominating the lakes northern shore is the ": null
    },
    {
        "stratovolcano": "stratovolcano"
    },
    {
        " Mount Süphan": "mount süphan"
    },
    {
        ". The broad crater of a second, dormant volcano, ": null
    },
    {
        "Mount Nemrut": "nemrut"
    },
    {
        ", lies close to the western tip of the lake. There is hydrothermal activity throughout the region.     For much of its history, until the ": null
    },
    {
        "Pleistocene": "pleistocene"
    },
    {
        ", Lake Van has had an outlet towards the southwest. However, the level of this threshold has varied over time, as the lake has been blocked by successive ": null
    },
    {
        "lava flows": "lava flows"
    },
    {
        " from ": null
    },
    {
        "Nemrut": "nemrut"
    },
    {
        " volcano westward towards the ": null
    },
    {
        "Muş Plain": "muş province"
    },
    {
        ". This threshold has then been lowered at times by erosion.       The first acoustic survey of Lake Van was performed in 42 Building on this, Kempe and Degens identified three distinct physiographic provinces within the lake: a lacustrine shelf that extends from the shore to a clear gradient change; a steeper lacustrine slope ; and a deep, relatively flat basin province in the western center of the lake. The deepest part of the lake is the Tatvan basin, which is almost completely bounded by faults.          The presence of terraces above the current lake level has long been recognized. On a visit in 42 geologist Felix Oswald noted three raised beaches at 42 42 and 42 feet above the lake level of the time, as well as recently drowned trees. Research in the past century has identified many similar terraces, and the lakes level has fluctuated significantly during that time.     Because Lake Van has no outlet, the present-day level is very dependent on the balance between inflow and evaporation.     The water level of the lake has often altered dramatically. Investigation by Degens and others in the early 42s determined that the highest lake levels  had been during the last ice age, about 42 years ago. Approximately 42 years ago there was a dramatic drop to more than  below the present level. This was followed by an equally-dramatic rise around 42 years ago.     As a deep lake with no outlet, Lake Van has accumulated great amounts of sediment washed in from surrounding plains and valleys, and occasionally deposited as ash from eruptions of nearby volcanoes.   This layer of sediment is estimated to be up to  thick in places, and has attracted climatologists and vulcanologists interested in drilling cores to examine the layered sediments.        In 42 and 42 an international team of geologists led by Dr. Stephan Kempe from the University of Hamburg retrieved ten sediment cores from depths up to . Although these cores only penetrated the first few meters of sediment, they provided sufficient ": null
    },
    {
        "varves": "varves"
    },
    {
        " to give proxy climate data for up to 42 years ": null
    },
    {
        "BP": "before present"
    },
    {
        ".     A team of scientists headed by palaeontologist Professor Thomas Litt at the ": null
    },
    {
        "University of Bonn": "university of bonn"
    },
    {
        " has applied for funding from the ": null
    },
    {
        "International Continental Scientific Drilling Program": "international continental scientific drilling program"
    },
    {
        " for a new, deeper-drilling project to examine the lakes sediments. Litt expects to find that Lake Van stores the climate history of the last 42 years—an incomparable treasure house of data which we want to tap for at least the last 42 years.  A test drilling in 42 detected evidence of 42 volcanic eruptions in the past 42 years.          Similar-but-smaller fluctuations have been seen recently. The level of the lake rose by at least three metres during the 42s, drowning much agricultural land, and seems to be rising again. The level rose approximately two meters in the ten years immediately prior to 42       Lake Van is situated in the highest and largest ": null
    },
    {
        "region": "eastern anatolia region"
    },
    {
        " of Turkey, which has a Mediterranean-influenced ": null
    },
    {
        "humid continental climate": "humid continental climate"
    },
    {
        ". Average temperatures in July are between 42 and 42  °C, and in January between −42  °C to −42  °C. In particularly-cold winter nights the temperature reaches −42  °C. Lake Van mitigates the climate somewhat, so in the city of Van, on the shore of the lake, the average temperature in July is 42  °C, and in January −42  °C. The average annual rainfall in the basin of Lake Van, ranges from 42 to 42  mm. Матвеев: Турция            The only fish known to live in the ": null
    },
    {
        "brackish water": "brackish water"
    },
    {
        " of Lake Van is  Chalcalburnus tarichi  or Pearl Mullet , a ": null
    },
    {
        "Cyprinid": "cyprinid"
    },
    {
        " fish related to ": null
    },
    {
        "chub": "european chub"
    },
    {
        " and ": null
    },
    {
        "dace": "common dace"
    },
    {
        ", which is caught during the spring floods. In May and June, these fish migrate from the lake to less alkaline water, spawning either near the mouths of the rivers feeding the lake or in the rivers themselves. After spawning season it returns to the lake.     42 species of ": null
    },
    {
        "phytoplankton": "phytoplankton"
    },
    {
        " have been recorded in the lake including ": null
    },
    {
        "cyanobacteria": "cyanobacteria"
    },
    {
        ", ": null
    },
    {
        "flagellate": "flagellate"
    },
    {
        "s, ": null
    },
    {
        "diatom": "diatom"
    },
    {
        "s, ": null
    },
    {
        "green algae": "green algae"
    },
    {
        ", and ": null
    },
    {
        "brown algae": "brown algae"
    },
    {
        ". 42 species of ": null
    },
    {
        "zooplankton": "zooplankton"
    },
    {
        " have also been recorded including ": null
    },
    {
        "Rotatoria": "rotatoria"
    },
    {
        ", ": null
    },
    {
        "Cladocera": "cladocera"
    },
    {
        ", and ": null
    },
    {
        "Copepoda": "copepoda"
    },
    {
        " in the lake. Selçuk 42     In 42 researchers reported the discovery of  tall ": null
    },
    {
        "microbialites": "microbialites"
    },
    {
        " in Lake Van. These are solid towers on the lake bed created by mats of coccoid ": null
    },
    {
        "cyanobacteria": "cyanobacteria"
    },
    {
        "  that create ": null
    },
    {
        "aragonite": "aragonite"
    },
    {
        " in combination with ": null
    },
    {
        "calcite": "calcite"
    },
    {
        " precipitating out of the lake water.     The Lake Van region is the home of the rare ": null
    },
    {
        "Van Cat": "van cat"
    },
    {
        " breed of cat, noted for among other things its unusual fascination with water, and is surrounded by fruit and ": null
    },
    {
        "grain": "cereal"
    },
    {
        "-growing agricultural areas.     According to legend, the lake is home to a mysterious sea creature, known as the ": null
    },
    {
        "Lake Van Monster": "lake van monster"
    },
    {
        " which is believed by some to lurk below the surface of the lake, described as being 42–42  ft long with brown scaly skin and with an elongated reptilian head and flippers, resembling an extinct ": null
    },
    {
        "mosasaurus": "mosasaurus"
    },
    {
        " or ": null
    },
    {
        "basilosaurus": "basilosaurus"
    },
    {
        ". Apart from some amateur photographs and videos, there is no physical evidence to prove its existence.             ": null
    },
    {
        "Tushpa": "tushpa"
    },
    {
        ", the capital of ": null
    },
    {
        "Urartu": "urartu"
    },
    {
        ", was located near the shores of Lake Van, on the site of what became medieval Vans castle, west of present-day ": null
    },
    {
        "Van city": "van"
    },
    {
        ". The ruins of the medieval city of Van are still visible below the southern slopes of the rock on which ": null
    },
    {
        "Van Castle": "van castle"
    },
    {
        " is located.     In 42 archaeologists from ": null
    },
    {
        "Van Yüzüncü Yil University": "van yüzüncü yıl university"
    },
    {
        " and a team of independent divers who were exploring Lake Van reported the discovery of a large underwater fortress spanning roughly one kilometer. The team estimates that this fortress was constructed during the Urartian period, based on their visual assessments. The archaeologists believe that the fortress, along with other parts of the ancient city that surrounded it at the time, had slowly become submerged over the millennia by the gradually rising lake.            The lake was the centre of the ": null
    },
    {
        "Armenian": "armenians"
    },
    {
        " kingdom of ": null
    },
    {
        "Ararat": "urartu"
    },
    {
        " from about 42 BC, afterwards of the ": null
    },
    {
        "Satrapy of Armina": "satrapy of armenia"
    },
    {
        ", ": null
    },
    {
        "Kingdom of Greater Armenia": "kingdom of armenia"
    },
    {
        ", and the Armenian Kingdom of ": null
    },
    {
        "Vaspurakan": "vaspurakan"
    },
    {
        ".     Along with ": null
    },
    {
        "Lake Sevan": "lake sevan"
    },
    {
        " in todays ": null
    },
    {
        "Armenia": "armenia"
    },
    {
        " and ": null
    },
    {
        "Lake Urmia": "lake urmia"
    },
    {
        " in todays ": null
    },
    {
        "Iran": "iran"
    },
    {
        ", Van was one of the three great lakes of the Armenian Kingdom, referred to as the seas of Armenia  . Over time, the lake was known by various Armenian names, including .       By the 42th century the region around Lake Van was on the border between the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ", with its capital at ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", and the ": null
    },
    {
        "Turko-Persian Seljuk Empire": "seljuk empire"
    },
    {
        ", with its capital at ": null
    },
    {
        "Isfahan": "isfahan"
    },
    {
        ". In the uneasy peace between the two empires, local Armenian-Byzantine landowners employed ": null
    },
    {
        "Turcoman": "turkmen people"
    },
    {
        " gazi": "gazi"
    },
    {
        "s and Byzantine ": null
    },
    {
        "akritai": "akritai"
    },
    {
        " for protection. The Greek-speaking Byzantines called the lake Thospitis limne .     In the second half of the 42th century Emperor ": null
    },
    {
        "Romanus IV Diogenes": "romanus iv diogenes"
    },
    {
        " launched a campaign to re-conquer Armenia and head off growing Seljuk control. Diogenes and his large army crossed the ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " and confronted a much smaller Seljuk force led by ": null
    },
    {
        "Alp Arslan": "alp arslan"
    },
    {
        " at the ": null
    },
    {
        "Battle of Manzikert": "battle of manzikert"
    },
    {
        ", north of Lake Van on 42 August 42 Despite their greater numbers, the cumbersome Byzantine force was defeated by the more mobile Turkish horsemen and Diogenes was captured.               ": null
    },
    {
        "Alp Arslan": "alp arslan"
    },
    {
        " divided the conquered eastern portions of the Byzantine empire among his Turcoman generals, with each ruled as a hereditary ": null
    },
    {
        "bey": "bey"
    },
    {
        "lik, under overall sovereignty of the ": null
    },
    {
        "Great Seljuq Empire": "great seljuq empire"
    },
    {
        ". Alp Arslan gave the region around Lake Van to his commander ": null
    },
    {
        "Sökmen": "sökmen of ahlatshahs"
    },
    {
        " el Kutbî , who set up his capital at Ahlat on the western side of the lake. The dynasty of ": null
    },
    {
        "Ahlatshahs": "ahlatshahs"
    },
    {
        "  ruled this area from 42 to 42     The Ahlatshahs were succeeded by the ": null
    },
    {
        "Ayyubid": "ayyubid"
    },
    {
        " dynasty.          Near the ": null
    },
    {
        "Van Castle": "van castle"
    },
    {
        " and the southern shore, on ": null
    },
    {
        "Akdamar Island": "akdamar island"
    },
    {
        " lies the 42th century ": null
    },
    {
        "Church of the Holy Cross": "armenian cathedral of the holy cross"
    },
    {
        " , which served as a royal church to the Armenian ": null
    },
    {
        "Vaspurakan": "vaspurakan"
    },
    {
        " kingdom. The ruins of Armenian monasteries also exist on the other three islands of Lake Van: Lim, Arter, and Ktuts. The area around Lake Van was also the home to a large number Armenian monasteries, among the most prominent of these being the 42th century ": null
    },
    {
        "Narekavank": "narekavank"
    },
    {
        " and the 42th century ": null
    },
    {
        "Varagavank": "varagavank"
    },
    {
        ", the former now destroyed.     The Ahlatshahs left a large number of historic ": null
    },
    {
        "tombstones": "tombstones"
    },
    {
        " in and around the town of ": null
    },
    {
        "Ahlat": "ahlat"
    },
    {
        ". Local administrators are currently trying to have the tombstones included in ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        "s ": null
    },
    {
        "World Heritage List": "world heritage list"
    },
    {
        ", where they are currently listed tentatively.       The railway connecting Turkey and ": null
    },
    {
        "Iran": "iran"
    },
    {
        " was built in the 42s, sponsored by ": null
    },
    {
        "CENTO": "cento"
    },
    {
        ". It uses a ": null
    },
    {
        "train ferry": "train ferry"
    },
    {
        " across Lake Van between the cities ": null
    },
    {
        "Tatvan": "tatvan"
    },
    {
        " and ": null
    },
    {
        "Van": "van"
    },
    {
        ", rather than building railway tracks around the rugged shoreline. Transfer from train to ship and back again limits the total carrying capacity. In May 42 talks started between Turkey and Iran to replace the ferry route with a new double track electrified railway.     In December 42 the new generation of ": null
    },
    {
        "train ferries": "train ferry"
    },
    {
        " operated by the ": null
    },
    {
        "Turkish State Railways": "turkish state railways"
    },
    {
        ", the largest of their kind in Turkey, entered service in Lake Van.     ": null
    },
    {
        "Ferit Melen Airport": "van ferit melen airport"
    },
    {
        " in ": null
    },
    {
        "Van": "van, turkey"
    },
    {
        " is located close to the shore of Lake Van. ": null
    },
    {
        "Turkish Airlines": "turkish airlines"
    },
    {
        ", ": null
    },
    {
        "AnadoluJet": "anadolujet"
    },
    {
        ", ": null
    },
    {
        "Pegasus Airlines": "pegasus airlines"
    },
    {
        ", and ": null
    },
    {
        "SunExpress": "sunexpress"
    },
    {
        " are the airline companies in Turkey which have regular flights to this airport.          Lake Van occasionally hosts several ": null
    },
    {
        "water sports": "water sports"
    },
    {
        ", ": null
    },
    {
        "sailing": "sailing"
    },
    {
        ", and ": null
    },
    {
        "inshore powerboat racing": "inshore powerboat racing"
    },
    {
        " events, such as the ": null
    },
    {
        "UIM": "union internationale motonautique"
    },
    {
        " World Offshore 42 Championship": "world offshore championship, turkey"
    },
    {
        "s IOC Van Grand Prix, and the Van Lake Festival.       ": null
    },
    {
        "Adır Island": "adır island"
    },
    {
        " Akdamar Island": "akdamar island"
    },
    {
        " Çarpanak Island": "çarpanak island"
    },
    {
        " Kuş Island": "kuş island"
    }
]