[
    {
        "     Langley Park School for Girls  is a girls ": null
    },
    {
        "secondary": "secondary school"
    },
    {
        " academy school": "academy"
    },
    {
        " in ": null
    },
    {
        "Beckenham": "beckenham"
    },
    {
        " in the ": null
    },
    {
        "London Borough of Bromley": "london borough of bromley"
    },
    {
        ", England, with a mixed-sex ": null
    },
    {
        "sixth form": "sixth form"
    },
    {
        ".     The school ": null
    },
    {
        "motto": "motto"
    },
    {
        " is Ad Rem Mox Nox , which roughly translates as Time is short, get to work or more specifically Get it done before nightfall . In the 42s, the official translation of the motto was Work, for the night cometh .       The ": null
    },
    {
        "school": "school"
    },
    {
        " is split into four houses in which each girl will be assigned before they officially join. The houses are: ": null
    },
    {
        "Gamma": "gamma"
    },
    {
        ", ": null
    },
    {
        "Sigma": "sigma"
    },
    {
        ", ": null
    },
    {
        "Lambda": "lambda"
    },
    {
        " and ": null
    },
    {
        "Kappa": "kappa"
    },
    {
        ". The houses compete in a variety of event such as the inter-form Hockey/Dance/Netball/Badminton tournaments throughout the year. The houses also go against each other on sports day, which is held annually at Norman Park, although a larger emphasis is on the eight forms per year, and years themselves.       The building at the schools first location was completed in 42 It was however used as a military ": null
    },
    {
        "hospital": "hospital"
    },
    {
        " during World War I.     The school itself opened on 42 September 42 as Beckenham County School for Girls, with 42 pupils aged from 42 years, and 42 teachers. The first headmistress was Miss E.M. Fox. A few years later, an association for ex-pupils was formed, called the Adremian Association.     In 42 the name of the school was changed to The County Grammar School for Girls, and in 42 to Beckenham Grammar School for Girls. In 42 the school moved to new buildings in a parkland setting, in Langley Park. The current name Langley Park School for Girls was adopted in 42     In 42 the school went comprehensive. In 42 it became a technology college, and in 42 it became part of the South East England Virtual Education Action Zone.     In July 42 the school celebrated its 42th anniversary during the last week of school in the summer. This included music, dancing and a commemorative event - bringing the ": null
    },
    {
        "Olympic torch": "olympic torch"
    },
    {
        " into the school.     On 42 August 42 the school officially gained ": null
    },
    {
        "academy status": "academy"
    }
]