[
    {
        "   Lanthanum is a ": null
    },
    {
        "chemical element": "chemical element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "symbol"
    },
    {
        " La and ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        " 57. It is a ": null
    },
    {
        "soft": "hardness"
    },
    {
        ", ": null
    },
    {
        "ductile": "ductility"
    },
    {
        ", silvery-white ": null
    },
    {
        "metal": "metal"
    },
    {
        " that tarnishes slowly when exposed to air and is soft enough to be cut with a knife. It is the eponym of the ": null
    },
    {
        "lanthanide": "lanthanide"
    },
    {
        " series, a group of 15 similar elements between lanthanum and ": null
    },
    {
        "lutetium": "lutetium"
    },
    {
        " in the ": null
    },
    {
        "periodic table": "periodic table"
    },
    {
        ", of which lanthanum is the first and the prototype. It is also sometimes considered the first element of the 6th-period ": null
    },
    {
        "transition metals": "transition metals"
    },
    {
        ", which would put it in ": null
    },
    {
        "group 3": "group 3 element"
    },
    {
        ", although lutetium is sometimes placed in this position instead. Lanthanum is traditionally counted among the ": null
    },
    {
        "rare earth element": "rare earth element"
    },
    {
        "s. The usual ": null
    },
    {
        "oxidation state": "oxidation state"
    },
    {
        " is +3. Lanthanum has no biological role in humans but is essential to some bacteria. It is not particularly toxic to humans but does show some antimicrobial activity.     Lanthanum usually occurs together with ": null
    },
    {
        "cerium": "cerium"
    },
    {
        " and the other rare earth elements. Lanthanum was first found by the Swedish chemist ": null
    },
    {
        "Carl Gustav Mosander": "carl gustav mosander"
    },
    {
        " in 1839 as an impurity in ": null
    },
    {
        "cerium nitrate": "cerium nitrate"
    },
    {
        " – hence the name lanthanum, from the ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " λανθάνειν , meaning to lie hidden . Although it is classified as a rare earth element, lanthanum is the 28th most abundant element in the Earths crust, almost three times as abundant as ": null
    },
    {
        "lead": "lead"
    },
    {
        ". In minerals such as ": null
    },
    {
        "monazite": "monazite"
    },
    {
        " and ": null
    },
    {
        "bastnäsite": "bastnäsite"
    },
    {
        ", lanthanum composes about a quarter of the lanthanide content.    It is extracted from those minerals by a process of such complexity that pure lanthanum metal was not isolated until 1923.     Lanthanum compounds have numerous applications as ": null
    },
    {
        "catalysts": "catalysis"
    },
    {
        ", additives in glass, carbon arc lamps for studio lights and projectors, ignition elements in ": null
    },
    {
        "lighters": "lighter"
    },
    {
        "and torches, ": null
    },
    {
        "electron cathodes": "hot cathode"
    },
    {
        ", ": null
    },
    {
        "scintillator": "scintillator"
    },
    {
        "s, ": null
    },
    {
        "GTAW": "gas tungsten arc welding"
    },
    {
        " electrodes, and other things. ": null
    },
    {
        "Lanthanum carbonate": "lanthanum carbonate"
    },
    {
        " is used as a ": null
    },
    {
        "phosphate binder": "phosphate binder"
    },
    {
        " in cases of ": null
    },
    {
        "renal failure": "hyperphosphatemia"
    },
    {
        ".           Lanthanum is the first element and prototype of the lanthanide series. In the periodic table, it appears to the right of the ": null
    },
    {
        "alkaline earth metal": "alkaline earth metal"
    },
    {
        " barium": "barium"
    },
    {
        " and to the left of the lanthanide cerium. Lanthanum is often considered to be a ": null
    },
    {
        "group 3 element": "group 3 element"
    },
    {
        ", along with its lighter ": null
    },
    {
        "congeners": "congener"
    },
    {
        " scandium": "scandium"
    },
    {
        " and ": null
    },
    {
        "yttrium": "yttrium"
    },
    {
        " and its heavier congener, the radioactive ": null
    },
    {
        "actinium": "actinium"
    },
    {
        ", Greenwood and Earnshaw, p. 1102 although this classification is sometimes disputed. Similarly to scandium, yttrium, and actinium, the 57 electrons of a lanthanum atom are arranged in the ": null
    },
    {
        "configuration": "electron configuration"
    },
    {
        " d 1 6s 2 , with three valence electrons outside the noble gas core. In chemical reactions, lanthanum almost always gives up these three valence electrons from the 5d and 6s ": null
    },
    {
        "subshells": "electron shellsubshells"
    },
    {
        " to form the +3 oxidation state, achieving the stable configuration of the preceding noble gas ": null
    },
    {
        "xenon": "xenon"
    },
    {
        ". Greenwood and Earnshaw, p. 1106 Some lanthanum compounds are also known, but they are much less stable.      Among the lanthanides, lanthanum is exceptional as it does not have any 4f electrons; indeed, the sudden contraction and lowering of energy of the 4f orbital that is important for the chemistry of the lanthanides only begins to happen at cerium. Thus it is only very weakly ": null
    },
    {
        "paramagnetic": "paramagnetic"
    },
    {
        ", unlike the strongly paramagnetic later lanthanides . Cullity, B. D. and Graham, C. D. Introduction to Magnetic Materials, John Wiley & Sons,  Furthermore, since the melting points of the trivalent lanthanides are related to the extent of hybridisation of the 6s, 5d, and 4f electrons, lanthanum has the second-lowest melting point among all the lanthanides: 920  °C. Krishnamurthy, Nagaiyar and Gupta, Chiranjib Kumar Extractive Metallurgy of Rare Earths, CRC Press,  The lanthanides become harder as the series is traversed: as expected, lanthanum is a soft metal. Lanthanum has a relatively high ": null
    },
    {
        "resistivity": "resistivity"
    },
    {
        " of 615  nΩm at room temperature; in comparison, the value for the good conductor aluminium is only 26.50  nΩm. Greenwood and Earnshaw, p. 1429  Lanthanum is the least volatile of the lanthanides.  Like most of the lanthanides, lanthanum has a ": null
    },
    {
        "hexagonal crystal structure": "hexagonal crystal system"
    },
    {
        " at room temperature. At 310  °C, lanthanum changes to a ": null
    },
    {
        "face-centered cubic": "face-centered cubic"
    },
    {
        " structure, and at 865  °C, it changes to a ": null
    },
    {
        "body-centered cubic": "body-centered cubic"
    },
    {
        " structure.       As expected from ": null
    },
    {
        "periodic trend": "periodic trend"
    },
    {
        "s, lanthanum has the largest ": null
    },
    {
        "atomic radius": "atomic radius"
    },
    {
        " of the lanthanides and the stable group 3 elements. Hence, it is the most reactive among them, tarnishing slowly in air and burning readily to form ": null
    },
    {
        "lanthanum oxide": "lanthanum oxide"
    },
    {
        ", La 2 O 3 , which is almost as basic as ": null
    },
    {
        "calcium oxide": "calcium oxide"
    },
    {
        ". Greenwood and Earnshaw, p. 1105–7 A centimeter-sized sample of lanthanum will corrode completely in a year as its oxide ": null
    },
    {
        "spalls": "spallation"
    },
    {
        " off like iron ": null
    },
    {
        "rust": "rust"
    },
    {
        ", instead of forming a protective oxide coating like ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        " and lanthanums lighter congeners scandium and yttrium.  Lanthanum reacts with the ": null
    },
    {
        "halogens": "halogen"
    },
    {
        "at room temperature to form the trihalides, and upon warming will form ": null
    },
    {
        "binary compounds": "binary compound"
    },
    {
        "with the nonmetals nitrogen, carbon, sulfur, phosphorus, boron, selenium, silicon and arsenic. Lanthanum reacts slowly with water to form ": null
    },
    {
        "lanthanum hydroxide": "lanthanum hydroxide"
    },
    {
        ", La 3 .  In dilute ": null
    },
    {
        "sulfuric acid": "sulfuric acid"
    },
    {
        ", lanthanum readily forms the aquated tripositive ion : this is colorless in aqueous solution since La 3+ has no f electrons. Lanthanum is the strongest and ": null
    },
    {
        "hardest": "hsab theory"
    },
    {
        " base among the lanthanides and group 3 elements, which is again expected from its being the largest of them. Greenwood and Earnshaw, p. 1434             Naturally occurring lanthanum is made up of two isotopes, the stable 139 La and the ": null
    },
    {
        "primordial long-lived radioisotope": "primordial nuclide"
    },
    {
        " 138 La. 139 La is by far the most abundant, making up 99.910% of natural lanthanum: it is produced in the ": null
    },
    {
        "s-process": "s-process"
    },
    {
        "  and the ": null
    },
    {
        "r-process": "r-process"
    },
    {
        " .  The very rare isotope 138 La is one of the few primordial ": null
    },
    {
        "odd–odd nuclei": "odd–odd nuclei"
    },
    {
        ", with a long half-life of 1.05×10 11  years. It is one of the proton-rich ": null
    },
    {
        "p-nuclei": "p-nuclei"
    },
    {
        " which cannot be produced in the ": null
    },
    {
        "s-": "s-process"
    },
    {
        " or ": null
    },
    {
        "r-process": "r-process"
    },
    {
        "es. 138 La, along with the even rarer ": null
    },
    {
        " 180m Ta": "tantalum-180m"
    },
    {
        ", is produced in the ν-process, where ": null
    },
    {
        "neutrinos": "neutrino"
    },
    {
        "interact with stable nuclei. S. E. Woosley, D. H. Hartmann, R. D. Hoffman, W. C. Haxton: The ν-process. In: The Astrophysical Journal, Vol. 356, 1990, p. 272-301.  All other lanthanum isotopes are ": null
    },
    {
        "synthetic": "synthetic radioisotope"
    },
    {
        ": with the exception of 137 La with a half-life of about 60,000  years, all of them have half-lives less than a day, and most have half-lives less than a minute. The isotopes 139 La and 140 La occur as ": null
    },
    {
        "fission products": "fission product"
    },
    {
        "of uranium.          ": null
    },
    {
        "Lanthanum oxide": "lanthanum oxide"
    },
    {
        " is a white solid that can be prepared by direct reaction of its constituent elements. Due to the large size of the La 3+ ion, La 2 O 3 adopts a hexagonal 7-coordinate structure that changes to the 6-coordinate structure of ": null
    },
    {
        "scandium oxide": "scandium oxide"
    },
    {
        " and ": null
    },
    {
        "yttrium oxide": "yttrium oxide"
    },
    {
        " at high temperature. When it reacts with water, lanthanum hydroxide is formed: a lot of heat is evolved in the reaction and a hissing sound is heard. Lanthanum hydroxide will react with atmospheric ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        " to form the basic carbonate. Greenwood and Earnshaw, p. 1107–8     Lanthanum fluoride is insoluble in water and can be used as a ": null
    },
    {
        "qualitative": "qualitative inorganic analysis"
    },
    {
        " test for the presence of La 3+ . The heavier halides are all very soluble ": null
    },
    {
        "deliquescent": "deliquescent"
    },
    {
        " compounds. The anhydrous halides are produced by direct reaction of their elements, as heating the hydrates causes hydrolysis: for example, heating hydrated LaCl 3 produces LaOCl.     Lanthanum reacts exothermically with hydrogen to produce the dihydride LaH 2 , a black, ": null
    },
    {
        "pyrophoric": "pyrophoricity"
    },
    {
        ", brittle, conducting compound with the ": null
    },
    {
        "calcium fluoride": "calcium fluoride"
    },
    {
        " structure.  This is a non-stoichiometric compound, and further absorption of hydrogen is possible, with a concomitant loss of electrical conductivity, until the more salt-like LaH 3 is reached. Like LaI 2 and LaI, LaH 2 is probably an ": null
    },
    {
        "electride": "electride"
    },
    {
        " compound.     Due to the large ionic radius and great electropositivity of La 3+ , there is not much covalent contribution to its bonding and hence it has a limited ": null
    },
    {
        "coordination chemistry": "coordination chemistry"
    },
    {
        ", like yttrium and the other lanthanides. Greenwood and Earnshaw, pp. 1108–9 Lanthanum oxalate does not dissolve very much in alkali-metal oxalate solutions, and decomposes around 500  °C. Oxygen is the most common ": null
    },
    {
        "donor atom": "donor atom"
    },
    {
        " in lanthanum complexes, which are mostly ionic and often have high coordination numbers over 6: 8 is the most characteristic, forming ": null
    },
    {
        "square antiprism": "square antiprism"
    },
    {
        "atic and ": null
    },
    {
        "dodecadeltahedral": "snub disphenoid"
    },
    {
        " structures. These high-coordinate species, reaching up to coordination number 12 with the use of ": null
    },
    {
        "chelating ligands": "chelating ligand"
    },
    {
        "such as in La 2 3 ·9H 2 O, often have a low degree of symmetry because of stereo-chemical factors.     Lanthanum chemistry tends not to involve π bonding due to the electron configuration of the element: thus its organometallic chemistry is quite limited. The best characterized organolanthanum compounds are the ": null
    },
    {
        "cyclopentadienyl complex": "cyclopentadienyl complex"
    },
    {
        " La 3 , which is produced by reacting anhydrous LaCl 3 with NaC 5 H 5 in ": null
    },
    {
        "tetrahydrofuran": "tetrahydrofuran"
    },
    {
        ", and its methyl-substituted derivatives. Greenwood and Earnshaw, p. 1110          In 1751, the Swedish mineralogist ": null
    },
    {
        "Axel Fredrik Cronstedt": "axel fredrik cronstedt"
    },
    {
        " discovered a heavy mineral from the mine at ": null
    },
    {
        "Bastnäs": "bastnäs"
    },
    {
        ", later named ": null
    },
    {
        "cerite": "cerite"
    },
    {
        ". Thirty years later, the fifteen-year-old ": null
    },
    {
        "Vilhelm Hisinger": "vilhelm hisinger"
    },
    {
        ", from the family owning the mine, sent a sample of it to ": null
    },
    {
        "Carl Scheele": "carl scheele"
    },
    {
        ", who did not find any new elements within. In 1803, after Hisinger had become an ironmaster, he returned to the mineral with ": null
    },
    {
        "Jöns Jacob Berzelius": "jöns jacob berzelius"
    },
    {
        " and isolated a new oxide which they named ceria after the ": null
    },
    {
        "dwarf planet": "dwarf planet"
    },
    {
        " Ceres": "ceres"
    },
    {
        ", which had been discovered two years earlier.  Ceria was simultaneously independently isolated in Germany by ": null
    },
    {
        "Martin Heinrich Klaproth": "martin heinrich klaproth"
    },
    {
        ". Greenwood and Earnshaw, p. 1424 Between 1839 and 1843, ceria was shown to be a mixture of oxides by the Swedish surgeon and chemist ": null
    },
    {
        "Carl Gustaf Mosander": "carl gustaf mosander"
    },
    {
        ", who lived in the same house as Berzelius: he separated out two other oxides which he named lanthana and  didymia .  He partially decomposed a sample of ": null
    },
    {
        "cerium nitrate": "cerium nitrate"
    },
    {
        " by roasting it in air and then treating the resulting oxide with dilute ": null
    },
    {
        "nitric acid": "nitric acid"
    },
    {
        ". See:    , Comptes rendus, 8 : 356-357. From p. 356:  Loxide de cérium, extrait de la cérite par la procédé ordinaire, contient à peu près les deux cinquièmes de son poids de loxide du nouveau métal qui ne change que peu les propriétés du cérium, et qui sy tient pour ainsi dire caché. Cette raison a engagé M. Mosander à donner au nouveau métal le nom de Lantane.      Philosophical Magazine, new series, 14 : 390-391. Since lanthanums properties differed only slightly from those of cerium, and occurred along with it in its salts, he named it from the ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " λανθάνειν . Relatively pure lanthanum metal was first isolated in 1923.       Lanthanum is the third-most abundant of all the lanthanides, making up 39  mg/kg of the Earths crust, behind ": null
    },
    {
        "neodymium": "neodymium"
    },
    {
        " at 41.5  mg/kg and cerium at 66.5  mg/kg. It is almost three times as abundant as ": null
    },
    {
        "lead": "lead"
    },
    {
        " in the Earths crust.    Despite being among the so-called rare earth metals , lanthanum is thus not rare at all, but it is historically so named because it is rarer than common earths such as lime and magnesia, and historically only a few deposits were known. Lanthanum is considered a rare earth metal because the process to mine it is difficult, time-consuming, and expensive. Lanthanum is rarely the dominant lanthanide found in the rare earth minerals, and in their chemical formulae it is usually preceded by cerium. Rare examples of La-dominant minerals are monazite- and lanthanite-.           The La 3+ ion is similarly-sized to the early lanthanides of the cerium group  that immediately follow in the periodic table, and hence it tends to occur along with them in ": null
    },
    {
        "phosphate": "phosphate"
    },
    {
        ", ": null
    },
    {
        "silicate": "silicate"
    },
    {
        " and ": null
    },
    {
        "carbonate": "carbonate"
    },
    {
        " minerals, such as ": null
    },
    {
        "monazite": "monazite"
    },
    {
        " and ": null
    },
    {
        "bastnäsite": "bastnäsite"
    },
    {
        " , where M refers to all the rare earth metals except scandium and the radioactive ": null
    },
    {
        "promethium": "promethium"
    },
    {
        " . Greenwood and Earnshaw, p. 1103 Bastnäsite is usually lacking in ": null
    },
    {
        "thorium": "thorium"
    },
    {
        " and the heavy lanthanides, and the purification of the light lanthanides from it is less involved. The ore, after being crushed and ground, is first treated with hot concentrated sulfuric acid, evolving carbon dioxide, ": null
    },
    {
        "hydrogen fluoride": "hydrogen fluoride"
    },
    {
        ", and ": null
    },
    {
        "silicon tetrafluoride": "silicon tetrafluoride"
    },
    {
        ": the product is then dried and leached with water, leaving the early lanthanide ions, including lanthanum, in solution. Greenwood and Earnshaw, p. 1426–9     The procedure for monazite, which usually contains all the rare earths as well as thorium, is more involved. Monazite, because of its magnetic properties, can be separated by repeated electromagnetic separation. After separation, it is treated with hot concentrated sulfuric acid to produce water-soluble sulfates of rare earths. The acidic filtrates are partially neutralized with ": null
    },
    {
        "sodium hydroxide": "sodium hydroxide"
    },
    {
        " to pH 3-4. Thorium precipitates out of solution as hydroxide and is removed. After that, the solution is treated with ": null
    },
    {
        "ammonium oxalate": "ammonium oxalate"
    },
    {
        " to convert rare earths to their insoluble ": null
    },
    {
        "oxalate": "oxalate"
    },
    {
        "s. The oxalates are converted to oxides by annealing. The oxides are dissolved in nitric acid that excludes one of the main components, ": null
    },
    {
        "cerium": "cerium"
    },
    {
        ", whose oxide is insoluble in HNO 3 . Lanthanum is separated as a double salt with ammonium nitrate by crystallization. This salt is relatively less soluble than other rare earth double salts and therefore stays in the residue. Care must be taken when handling some of the residues as they contain ": null
    },
    {
        " 228 Ra": "radium-228"
    },
    {
        ", the daughter of 232 Th, which is a strong gamma emitter. Lanthanum is relatively easy to extract as it has only one neighbouring lanthanide, cerium, which can be removed by making use of its ability to be oxidised to the +4 state; thereafter, lanthanum may be separated out by the historical method of ": null
    },
    {
        "fractional crystallization": "fractional crystallization"
    },
    {
        " of La 3 ·2NH 4 NO 3 ·4H 2 O, or by ": null
    },
    {
        "ion-exchange": "ion-exchange"
    },
    {
        " techniques when higher purity is desired.     Lanthanum metal is obtained from its oxide by heating it with ": null
    },
    {
        "ammonium chloride": "ammonium chloride"
    },
    {
        " or fluoride and hydrofluoric acid at 300-400  °C to produce the chloride or fluoride:     :La 2 O 3 + 6 NH 4 Cl → 2 LaCl 3 + 6 NH 3 + 3 H 2 O     This is followed by reduction with alkali or alkaline earth metals in vacuum or argon atmosphere:     :LaCl 3 + 3 Li → La + 3 LiCl     Also, pure lanthanum can be produced by electrolysis of molten mixture of anhydrous LaCl 3 and NaCl or KCl at elevated temperatures.          The first historical application of lanthanum was in gas lantern ": null
    },
    {
        "mantles": "gas mantle"
    },
    {
        ". Carl Auer von Welsbach used a mixture of ": null
    },
    {
        "lanthanum oxide": "lanthanum oxide"
    },
    {
        " and ": null
    },
    {
        "zirconium oxide": "zirconium dioxide"
    },
    {
        ", which he called Actinophor and patented in 1886. The original mantles gave a green-tinted light and were not very successful, and his first company, which established a factory in ": null
    },
    {
        "Atzgersdorf": "atzgersdorf"
    },
    {
        " in 1887, failed in 1889.      Modern uses of lanthanum include:       ": null
    },
    {
        "nickel-metal hydride batteries": "nickel-metal hydride battery"
    },
    {
        " is . Due to high cost to extract the other lanthanides, a ": null
    },
    {
        "mischmetal": "mischmetal"
    },
    {
        " with more than 50% of lanthanum is used instead of pure lanthanum. The compound is an ": null
    },
    {
        "intermetallic": "intermetallics"
    },
    {
        " component of the  type.     :As most hybrid cars use nickel-metal hydride batteries, massive quantities of lanthanum are required for the production of hybrid automobiles. A typical hybrid automobile battery for a ": null
    },
    {
        "Toyota Prius": "toyota prius"
    },
    {
        " requires  of lanthanum. As engineers push the technology to increase fuel efficiency, twice that amount of lanthanum could be required per vehicle.     Hydrogen sponge alloys can contain lanthanum. These alloys are capable of storing up to 400 times their own volume of hydrogen gas in a reversible adsorption process. Heat energy is released every time they do so; therefore these alloys have possibilities in energy conservation systems.    ": null
    },
    {
        "Mischmetal": "mischmetal"
    },
    {
        ", a ": null
    },
    {
        "pyrophoric": "pyrophoric"
    },
    {
        " alloy used in lighter flints, contains 25% to 45% lanthanum.    ": null
    },
    {
        "Lanthanum oxide": "lanthanum oxide"
    },
    {
        " and the ": null
    },
    {
        "boride": "lanthanum hexaboride"
    },
    {
        " are used in electronic ": null
    },
    {
        "vacuum tubes": "vacuum tube"
    },
    {
        "as ": null
    },
    {
        "hot cathode": "hot cathode"
    },
    {
        " materials with strong emissivity of ": null
    },
    {
        "electron": "electron"
    },
    {
        "s. Crystals of  are used in high-brightness, extended-life, thermionic electron emission sources for ": null
    },
    {
        "electron microscopes": "electron microscope"
    },
    {
        "and ": null
    },
    {
        "Hall-effect thruster": "hall-effect thruster"
    },
    {
        "s.    ": null
    },
    {
        "Lanthanum trifluoride": "lanthanum trifluoride"
    },
    {
        "  is an essential component of a heavy fluoride glass named ": null
    },
    {
        "ZBLAN": "zblan"
    },
    {
        ". This glass has superior transmittance in the infrared range and is therefore used for fiber-optical communication systems.    Cerium-doped ": null
    },
    {
        "lanthanum bromide": "lanthanum bromide"
    },
    {
        " and ": null
    },
    {
        "lanthanum chloride": "lanthanum bromide"
    },
    {
        " are the recent inorganic ": null
    },
    {
        "scintillator": "scintillator"
    },
    {
        "s, which have a combination of high light yield, best energy resolution, and fast response. Their high yield converts into superior energy resolution; moreover, the light output is very stable and quite high over a very wide range of temperatures, making it particularly attractive for high-temperature applications. These scintillators are already widely used commercially in detectors of ": null
    },
    {
        "neutrons": "neutrons"
    },
    {
        " or ": null
    },
    {
        "gamma rays": "gamma rays"
    },
    {
        ".    ": null
    },
    {
        "Carbon arc lamps": "carbon arc lamp"
    },
    {
        "use a mixture of rare earth elements to improve the light quality. This application, especially by the ": null
    },
    {
        "motion picture": "film"
    },
    {
        " industry for studio lighting and projection, consumed about 25% of the rare-earth compounds produced until the phase out of carbon arc lamps.    ": null
    },
    {
        "Lanthanum oxide": "lanthanum oxide"
    },
    {
        "  improves the alkali resistance of ": null
    },
    {
        "glass": "glass"
    },
    {
        " and is used in making special optical glasses, such as infrared-absorbing glass, as well as ": null
    },
    {
        "camera": "camera"
    },
    {
        " and ": null
    },
    {
        "telescope": "telescope"
    },
    {
        " lenses": "lens"
    },
    {
        ", because of the high ": null
    },
    {
        "refractive index": "refractive index"
    },
    {
        " and low dispersion of rare-earth glasses. Lanthanum oxide is also used as a grain-growth additive during the liquid-phase ": null
    },
    {
        "sintering": "sintering"
    },
    {
        " of ": null
    },
    {
        "silicon nitride": "silicon nitride"
    },
    {
        " and ": null
    },
    {
        "zirconium diboride": "zirconium diboride"
    },
    {
        ".    Small amounts of lanthanum added to ": null
    },
    {
        "steel": "steel"
    },
    {
        " improves its ": null
    },
    {
        "malleability": "malleability"
    },
    {
        ", resistance to impact, and ": null
    },
    {
        "ductility": "ductility"
    },
    {
        ", whereas addition of lanthanum to ": null
    },
    {
        "molybdenum": "molybdenum"
    },
    {
        " decreases its hardness and sensitivity to temperature variations.   Small amounts of lanthanum are present in many pool products to remove the phosphates that feed algae.    Lanthanum oxide additive to tungsten is used in ": null
    },
    {
        "gas tungsten arc welding": "gas tungsten arc welding"
    },
    {
        " electrodes, as a substitute for ": null
    },
    {
        "radioactive": "radioactive"
    },
    {
        " thorium.     Various compounds of lanthanum and other rare-earth elements are components of various catalysis, such as ": null
    },
    {
        "petroleum cracking": "petroleum cracking"
    },
    {
        " catalyst": "catalyst"
    },
    {
        "s.    Lanthanum-barium ": null
    },
    {
        "radiometric dating": "radiometric dating"
    },
    {
        " is used to estimate age of rocks and ores, though the technique has limited popularity.    ": null
    },
    {
        "Lanthanum carbonate": "lanthanum carbonate"
    },
    {
        " was approved as a medication  to absorb excess ": null
    },
    {
        "phosphate": "phosphate"
    },
    {
        " in cases of ": null
    },
    {
        "end-stage renal failure": "hyperphosphatemia"
    },
    {
        ".    Lanthanum fluoride is used in phosphor lamp coatings. Mixed with europium fluoride, it is also applied in the crystal membrane of ": null
    },
    {
        "fluoride ion-selective electrodes": "fluoride selective electrode"
    },
    {
        ".   Like ": null
    },
    {
        "horseradish peroxidase": "horseradish peroxidase"
    },
    {
        ", lanthanum is used as an electron-dense tracer in ": null
    },
    {
        "molecular biology": "molecular biology"
    },
    {
        ".    Lanthanum-modified bentonite  is used to remove phosphates from water in lake treatments.        Lanthanum has no known biological role in humans. The element is very poorly absorbed after oral administration and when injected its elimination is very slow. ": null
    },
    {
        "Lanthanum carbonate": "lanthanum carbonate"
    },
    {
        " was approved as a ": null
    },
    {
        "phosphate binder": "phosphate binder"
    },
    {
        " to absorb excess phosphate in cases of ": null
    },
    {
        "end stage renal disease": "end stage renal disease"
    },
    {
        ".     While lanthanum has pharmacological effects on several receptors and ion channels, its specificity for the ": null
    },
    {
        "GABA": "gamma-aminobutyric acid"
    },
    {
        " receptor is unique among trivalent cations. Lanthanum acts at the same modulatory site on the ": null
    },
    {
        "GABA receptor": "gaba receptor"
    },
    {
        " as ": null
    },
    {
        "zinc": "zinc"
    },
    {
        ", a known negative ": null
    },
    {
        "allosteric": "allosteric"
    },
    {
        " modulator. The lanthanum cation La 3+ is a positive allosteric modulator at native and recombinant GABA receptors, increasing open channel time and decreasing desensitization in a subunit configuration dependent manner.      Lanthanum is an essential cofactor for the methanol dehydrogenase of the ": null
    },
    {
        "methanotrophic": "methanotrophic"
    },
    {
        " bacterium  Methylacidiphilum fumariolicum  SolV, although the great chemical similarity of the lanthanides means that it may be substituted with cerium, praseodymium, or neodymium without ill effects, and with the smaller samarium, europium, or gadolinium giving no side effects other than slower growth.           Lanthanum has a low to moderate level of toxicity and should be handled with care. The injection of lanthanum solutions produces ": null
    },
    {
        "hyperglycemia": "hyperglycemia"
    },
    {
        ", low blood pressure, degeneration of the ": null
    },
    {
        "spleen": "spleen"
    },
    {
        " and ": null
    },
    {
        "hepatic": "liver"
    },
    {
        " alterations. The application in carbon arc light led to the exposure of people to rare earth element oxides and fluorides, which sometimes led to ": null
    },
    {
        "pneumoconiosis": "pneumoconiosis"
    },
    {
        ".   As the La 3+ ion is similar in size to the Ca 2+ ion, it is sometimes used as an easily traced substitute for the latter in medical studies.  Lanthanum, like the other lanthanides, is known to affect human metabolism, lowering cholesterol levels, blood pressure, appetite, and risk of blood coagulation. When injected into the brain, it acts as a painkiller, similarly to ": null
    },
    {
        "morphine": "morphine"
    }
]