[
    {
        "          Lars Magnus Ericsson  was a Swedish ": null
    },
    {
        "inventor": "inventor"
    },
    {
        ", entrepreneur and founder of ": null
    },
    {
        "telephone": "telephone"
    },
    {
        " equipment manufacturer ": null
    },
    {
        "Ericsson": "ericsson"
    },
    {
        " .     Lars Magnus was born in ": null
    },
    {
        "Värmskog": "grums municipality"
    },
    {
        ", ": null
    },
    {
        "Värmland": "värmland"
    },
    {
        ", and grew up in the small village of Vegerbol located between ": null
    },
    {
        "Karlstad": "karlstad"
    },
    {
        " and ": null
    },
    {
        "Arvika": "arvika"
    },
    {
        ". At the age of 12, Ericssons father died forcing him to seek work as a ": null
    },
    {
        "miner": "miner"
    },
    {
        ". He worked until he had money enough to leave the village and move to ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        " in 1867. He then worked for six years for an instrument maker named Öllers & Co. who mainly created ": null
    },
    {
        "telegraph": "telegraphy"
    },
    {
        " equipment. Because of his skills, he was given two state scholarships to study instrument making abroad between 1872 and 1875. One of the companies he worked at was ": null
    },
    {
        "Siemens & Halske": "siemens ag"
    },
    {
        ".     Upon his return to Sweden in 1876, he founded a small mechanical workshop together with his friend Carl Johan Andersson who had also worked at Öllers & Co.. This workshop was actually a former kitchen of some 13  m 2 situated at Drottninggatan 15 in the most central part of Stockholm. Here, he started a ": null
    },
    {
        "telephone": "telephone"
    },
    {
        " company by analyzing Bell company and Siemens telephones and creating his own copies in their image. It was not until they started cooperating with Henrik Tore Cedergren in 1883 that the company would start to grow into the ": null
    },
    {
        "Ericsson": "ericsson"
    },
    {
        " corporation.     In the year 1900 Lars Magnus retired from Ericsson at the age of 54. He kept his shares in the company until 1905 and then sold them all.     He is said to have been a demanding person, and disliked any direct publicity about his personality and did not wish to be idolized. He was, however, deeply respected by his employees. He was always a skeptic and cautious in business. He was also somewhat opposed to ": null
    },
    {
        "patent": "patent"
    },
    {
        "s, as many of the products he made would not have been possible to do if the patent legislation had been overly effective. When his phones were copied by Norwegian companies he did not care, as his phones had in turn been largely copied from Siemens. He initially did not believe in a ": null
    },
    {
        "mass market": "mass market"
    },
    {
        " for telephones, and saw it as a toy for the leisure class.     After his death in 1926, he was buried at ": null
    },
    {
        "Hågelby gård": "hågelby gård"
    },
    {
        " in ": null
    },
    {
        "Botkyrka": "botkyrka"
    },
    {
        ". At his explicit request, there is no ": null
    },
    {
        "headstone": "headstone"
    }
]