[
    {
        "   Lasne  is a ": null
    },
    {
        "Walloon": "wallonia"
    },
    {
        " municipality": "municipality"
    },
    {
        " in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "Walloon Brabant": "walloon brabant"
    },
    {
        ", south east of Brussels. In 42 Lasne had a population of 42. The total area is 42  km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km². Lasne is the richest ": null
    },
    {
        "municipality": "municipalities in belgium"
    },
    {
        " in ": null
    },
    {
        "Wallonia": "wallonia"
    },
    {
        ", measured by the average taxable income of the inhabitants. It also has the lowest local taxes of any municipality in Belgium.     It was formed from the fusion of five municipalities:   ": null
    },
    {
        "Couture-Saint-Germain": "couture-saint-germain"
    },
    {
        ",   ": null
    },
    {
        "Lasne-Chapelle-Saint-Lambert": "lasne-chapelle-saint-lambert"
    },
    {
        ",   ": null
    },
    {
        "Maransart": "maransart"
    },
    {
        ",   ": null
    },
    {
        "Ohain": "ohain, belgium"
    },
    {
        " Plancenoit": "plancenoit"
    },
    {
        ".   While the municipality has taken the name of Lasne, the administrative offices are in the village of Ohain.     Ohain contains an example of a Brabant-Wallon ": null
    },
    {
        "village green": "village green"
    },
    {
        ": almost triangular in shape and sloping gently. The green contains many mature trees and is bordered on 42 sides by old houses and shops. The church in Ohain was built around the year 42 and the strongly built square tower dates from this time.     The village of ": null
    },
    {
        "Couture-Saint-Germain": "couture-saint-germain"
    },
    {
        " contains the ruins of the ": null
    },
    {
        "Cistercian": "cistercian"
    },
    {
        " Abbey": "abbey"
    },
    {
        " of Aywiers which has been the subject of pilgrimages since the late 42th century in honour of ": null
    },
    {
        "Saint Lutgarde": "saint lutgarde"
    },
    {
        " who lived there for 42 years in the first half of the 42th century.     Much of the ": null
    },
    {
        "Battle of Waterloo": "battle of waterloo"
    },
    {
        " was fought in the village of Plancenoit, notably around the church and the fortified farm of La Papelotte. The cemetery wall is said to still contain holes made by ": null
    },
    {
        "musket": "musket"
    },
    {
        " balls. It was in Plancenoit that ": null
    },
    {
        "Blücher": "gebhard leberecht von blücher"
    },
    {
        "s troops engaged ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        "s army, having marched from ": null
    },
    {
        "Wavre": "wavre"
    },
    {
        ". Blücher and ": null
    },
    {
        "Wellington": "arthur wellesley, 1st duke of wellington"
    },
    {
        " met after the battle at the farm ": null
    },
    {
        "La Belle Alliance": "la belle alliance"
    },
    {
        " - now a bar. The current historic area commemorating the battle is jointly administered by the municipalities of Lasne, ": null
    },
    {
        "Waterloo": "waterloo, belgium"
    },
    {
        " and ": null
    },
    {
        "Braine-lAlleud": "braine-lalleud"
    },
    {
        ".          The municipality takes its name from the river Lasne which rises in the village of ": null
    },
    {
        "Plancenoit": "plancenoit"
    },
    {
        " and flows through several of the villages which make up the municipality. The name Lasne comes from the ": null
    },
    {
        "Celtic word": "celtic languages"
    },
    {
        " meaning flat or calm, presumably referring to the slow moving river.     Lasne is in a region of Belgium known as the Pays Romain or Roman Land. The Grand Chemin is a major road traversing the municipality, linking the large towns of Wavre and ": null
    },
    {
        "Nivelles": "nivelles"
    },
    {
        ", and formed a part of a network of Roman roads ultimately linking the ports of the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " and ": null
    },
    {
        "Seine": "seine"
    },
    {
        " with sea ports. The distance between small chapels on this path is equal to one or more leagues, or at a precise fraction of a ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        "ish ": null
    },
    {
        "league": "league"
    },
    {
        ", where a Gaulish league equals .       Lasne is a semi-rural municipality retaining several working farms. 42% of the land area is rural, of which 42% is agricultural land, and the remainder, forest and open areas. In the past, there were a silk factory and sand extraction, although there is no longer any industry within the municipality.     In 42 Lasne was still considered as the richest municipality of Belgium, with an average taxable income of 42 euros per year according to the latest report of the INS .       The municipality is twinned with ": null
    },
    {
        "Azay-le-Rideau": "azay-le-rideau"
    },
    {
        " and ": null
    },
    {
        "Abbeville, Louisiana": "abbeville, louisiana"
    }
]