[
    {
        "      Latin literature includes the essays, histories, poems, plays, and other writings written in the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " language. The beginning of Latin literature dates to 240 BC, when the first stage play was performed in Rome. Latin literature would flourish for the next six centuries. The classical era of Latin literature can be roughly divided into the following periods: ": null
    },
    {
        "Early Latin literature": "latin_literatureearly_latin_literature"
    },
    {
        ", ": null
    },
    {
        "The Golden Age": "latin literaturethe golden_age"
    },
    {
        ", ": null
    },
    {
        "The Imperial Period": "latin_literaturethe_imperial_period"
    },
    {
        " and ": null
    },
    {
        "Late Antiquity": "latin literaturelatin in the middle ages, renaissance, and early modernity"
    },
    {
        ".     Latin was the language of the ancient Romans, but it was also the  lingua franca  of Western Europe throughout the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", so Latin literature includes not only Roman authors like ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        ", ": null
    },
    {
        "Vergil": "vergil"
    },
    {
        ", ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        " and ": null
    },
    {
        "Horace": "horace"
    },
    {
        ", but also includes European writers after the fall of the Empire, from religious writers like ": null
    },
    {
        "Aquinas": "aquinas"
    },
    {
        " , to secular writers like ": null
    },
    {
        "Francis Bacon": "francis bacon"
    },
    {
        " , ": null
    },
    {
        "Baruch Spinoza": "baruch spinoza"
    },
    {
        " , and ": null
    },
    {
        "Isaac Newton": "isaac newton"
    },
    {
        " .              Formal Latin literature began in 240 BC, when a Roman audience saw a Latin version of a Greek play. Duckworth, George Eckel.  University of Oklahoma Press, 1994. p. 3. Web. 15 October 2011. The adaptor was ": null
    },
    {
        "Livius Andronicus": "livius andronicus"
    },
    {
        ", a Greek who had been brought to Rome as a prisoner of war in 272 BC. Andronicus also translated Homers Greek epic the Odyssey into an old type of Latin verse called Saturnian. The first Latin poet to write on a Roman theme was ": null
    },
    {
        "Gnaeus Naevius": "gnaeus naevius"
    },
    {
        " during the 3rd century BC. He composed an epic poem about the ": null
    },
    {
        "first Punic War": "first punic war"
    },
    {
        ", in which he had fought. Naeviuss dramas were mainly reworkings of Greek originals, but he also created tragedies based on Roman myths and history.     Other epic poets followed Naevius. ": null
    },
    {
        "Quintus Ennius": "quintus ennius"
    },
    {
        " wrote a historical epic, the Annals , describing Roman history from the founding of Rome to his own time. He adopted Greek dactylic hexameter, which became the standard verse form for Roman epics. He also became famous for his tragic dramas. In this field, his most distinguished successors were ": null
    },
    {
        "Marcus Pacuvius": "marcus pacuvius"
    },
    {
        " and ": null
    },
    {
        "Lucius Accius": "lucius accius"
    },
    {
        ". These three writers rarely used episodes from Roman history. Instead, they wrote Latin versions of tragic themes that the Greeks had already handled. But even when they copied the Greeks, their translations were not straightforward replicas. Only fragments of their plays have survived.          Considerably more is known about early Latin comedy, as 26 Early Latin comedies are extant – 20 of which ": null
    },
    {
        "Plautus": "plautus"
    },
    {
        " wrote, and the remaining six of which ": null
    },
    {
        "Terence": "terence"
    },
    {
        " wrote. Shipley, Joseph Twadell.  Taylor & Francis, 1964. p. 109. Web. 15 October 2011. These men modeled their comedies on Greek plays known as ": null
    },
    {
        "New Comedy": "ancient greek comedynew comedy"
    },
    {
        ". But they treated the plots and wording of the originals freely. Plautus scattered songs through his plays and increased the humor with puns and wisecracks, plus comic actions by the actors. Terences plays were more polite in tone, dealing with domestic situations. His works provided the chief inspiration for French and English comedies of the 17th century AD, and even for modern American comedy.     The prose of the period is best known through On Agriculture by ": null
    },
    {
        "Cato the Elder": "cato the elder"
    },
    {
        ". Cato also wrote the first Latin history of Rome and of other Italian cities. Mehl, Andreas.  Wiley-Blackwell, 2010. p 52. Web. 18 October 2011. He was the first Roman statesman to put his political speeches in writing as a means of influencing public opinion.     Early Latin literature ended with ": null
    },
    {
        "Gaius Lucilius": "gaius lucilius"
    },
    {
        ", who created a new kind of poetry in his 30 books of Satires . He wrote in an easy, conversational tone about books, food, friends, and current events.          Traditionally, the height of Latin literature has been assigned to the period from 81 BC to AD 17, although recent scholarship has questioned the assumptions that privileged the works of this period over both earlier and later works.  This period is usually said to have begun with the first known speech of ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        " and ended with the death of ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        ".          ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        " has traditionally been considered the master of Latin prose. Eliot, Charles W.  Kessinger Publishing, 2004. p. 3. Web. 15 October 2011. Nettleship, Henry; Haverfield, F.  Cambridge University Press, 2010. p. 105. Web. 18 October 2011. The writing he produced from about 80 BC until his death in 43 BC exceeds that of any Latin author whose work survives in terms of quantity and variety of genre and subject matter, as well as possessing unsurpassed stylistic excellence. Ciceros many works can be divided into four groups: letters, rhetorical treatises, philosophical works, and orations. His letters provide detailed information about an important period in Roman history and offer a vivid picture of the public and private life among the Roman governing class. Ciceros works on oratory are our most valuable Latin sources for ancient theories on education and rhetoric. His philosophical works were the basis of moral philosophy during the Middle Ages. His speeches inspired many European political leaders and the founders of the United States.        ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        " and ": null
    },
    {
        "Sallust": "sallust"
    },
    {
        " were outstanding historical writers of Ciceros time. Caesar wrote commentaries on the Gallic and civil wars in a straightforward style to justify his actions as a general. Sallust adopted an abrupt, pointed style in his historical works. He wrote brilliant descriptions of people and their motives.     The birth of lyric poetry in Latin occurred during the same period. The short love lyrics of ": null
    },
    {
        "Catullus": "catullus"
    },
    {
        " are noted for their emotional intensity. Catullus also wrote poems that attacked his enemies. In his longer poems, he suggested images in rich, delicate language. Contemporary with Catullus, ": null
    },
    {
        "Lucretius": "lucretius"
    },
    {
        " expounded the Epicurean philosophy in a long poem, De rerum natura.     One of the most learned writers of the period was ": null
    },
    {
        "Marcus Terentius Varro": "marcus terentius varro"
    },
    {
        ". Called the most learned of the Romans by ": null
    },
    {
        "Quintillian": "quintillian"
    },
    {
        ",  he wrote about a remarkable variety of subjects, from religion to poetry. But only his writings on agriculture and the Latin language are extant in their complete form.               The emperor ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        " took a personal interest in the literary works produced during his years of power from 27 BC to AD 14. This period is sometimes called the Augustan Age of Latin Literature. ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        " published his pastoral Eclogues, the Georgics, and the Aeneid, an epic poem describing the events that led to the creation of Rome. Virgil told how the Trojan hero Aeneas became the ancestor of the Roman people. Virgil also provided divine justification for Roman rule over the world. Although Virgil died before he could put the finishing touches on his poem, it was soon recognized as the greatest work of Latin literature. Morton Braund, Susanna.  Routledge, 2002. p. 1. Web. 15 October 2011. Colish, Marcía L.  BRILL, 1990. p. 226. Web. 18 October 2011.     Virgils friend ": null
    },
    {
        "Horace": "horace"
    },
    {
        " wrote Epodes, Odes, Satires, and Epistles. The perfection of the Odes in content, form, and style has charmed readers for hundreds of years. The Satires and Epistles discuss ethical and literary problems in an urbane, witty manner. Horaces Art of Poetry, probably published as a separate work, greatly influenced later poetic theories. It stated the basic rules of classical writing as the Romans understood and used them. After Virgil died, Horace was Romes leading poet. Britannica Educational Publishing.  The Rosen Publishing Group, 2011. p. 39. Web. 18 October 2011.     The Latin elegy reached its highest development in the works of ": null
    },
    {
        "Tibullus": "tibullus"
    },
    {
        ", ": null
    },
    {
        "Propertius": "propertius"
    },
    {
        ", and ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        ". Most of this poetry is concerned with love. Ovid also wrote the Fasti, which describes Roman festivals and their legendary origins. Ovids greatest work, the Metamorphoses weaves various myths into a fast-paced, fascinating story. Ovid was a witty writer who excelled in creating lively and passionate characters. The Metamorphoses was the best-known source of Greek and Roman mythology throughout the Middle Ages and the Renaissance. It inspired many poets, painters, and composers.     In prose, ": null
    },
    {
        "Livy": "livy"
    },
    {
        " produced a history of the Roman people in 142 books. Only 35 survived, but they are a major source of information on Rome. Cary, Max; Haarhoff, Theodore Johannes.  Taylor & Francis, 1985. p. 268. Web. 15 October 2011.       From the death of Augustus in AD 14 until about 200, Roman authors emphasized style and tried new and startling ways of expression. During the reign of ": null
    },
    {
        "Nero": "nero"
    },
    {
        " from 54 to 68, the Stoic philosopher ": null
    },
    {
        "Seneca": "seneca the younger"
    },
    {
        " wrote a number of dialogues and letters on such moral themes as mercy and generosity. In his Natural Questions, Seneca analyzed earthquakes, floods, and storms. Senecas tragedies greatly influenced the growth of tragic drama in Europe. His nephew ": null
    },
    {
        "Lucan": "lucan"
    },
    {
        " wrote the Pharsalia , an epic poem describing the civil war between Caesar and ": null
    },
    {
        "Pompey": "pompey"
    },
    {
        ". The Satyricon by ": null
    },
    {
        "Petronius": "petronius"
    },
    {
        " was the first ": null
    },
    {
        "picaresque": "picaresque"
    },
    {
        " Latin novel. Grube, George Maximilian Antony.  Hackett Publishing, 1965. p. 261. Web. 15 October 2011. Only fragments of the complete work survive. It describes the adventures of various low-class characters in absurd, extravagant, and dangerous situations, often in the world of petty crime.     Epic poems included the Argonautica of ": null
    },
    {
        "Gaius Valerius Flaccus": "gaius valerius flaccus"
    },
    {
        ", the Thebaid of ": null
    },
    {
        "Statius": "statius"
    },
    {
        ", and the Punica of ": null
    },
    {
        "Silius Italicus": "silius italicus"
    },
    {
        ". At the hands of ": null
    },
    {
        "Martial": "martial"
    },
    {
        ", the epigram achieved the stinging quality still associated with it. ": null
    },
    {
        "Juvenal": "juvenal"
    },
    {
        " brilliantly satirized vice.     The historian ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        " painted an unforgettably dark picture of the early empire in his Histories and Annals, both written in the early 2nd century. His contemporary ": null
    },
    {
        "Suetonius": "suetonius"
    },
    {
        " wrote biographies of the 12 Roman rulers from ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        " through ": null
    },
    {
        "Domitian": "domitian"
    },
    {
        ". The letters of ": null
    },
    {
        "Pliny the Younger": "pliny the younger"
    },
    {
        " described Roman life of the period. ": null
    },
    {
        "Quintilian": "quintilian"
    },
    {
        " composed the most complete work on ancient education that we possess. Important works from the 2nd century include the Attic Nights of ": null
    },
    {
        "Aulus Gellius": "aulus gellius"
    },
    {
        ", a collection of anecdotes and reports of literary discussions among his friends; and the letters of the orator ": null
    },
    {
        "Marcus Cornelius Fronto": "marcus cornelius fronto"
    },
    {
        " to ": null
    },
    {
        "Marcus Aurelius": "marcus aurelius"
    },
    {
        ". The most famous work of the period was Metamorphoses, also called The Golden Ass, by ": null
    },
    {
        "Apuleius": "apuleius"
    },
    {
        ". This novel concerns a young man who is accidentally changed into a donkey. The story is filled with colorful tales of love and witchcraft.       Pagan Latin literature showed a final burst of vitality in the late 3rd century through 5th centuries. ": null
    },
    {
        "Ammianus Marcellinus": "ammianus marcellinus"
    },
    {
        " in history, ": null
    },
    {
        "Quintus Aurelius Symmachus": "quintus aurelius symmachus"
    },
    {
        " in oratory, and ": null
    },
    {
        "Ausonius": "ausonius"
    },
    {
        " and ": null
    },
    {
        "Rutilius Claudius Namatianus": "rutilius claudius namatianus"
    },
    {
        " in poetry all wrote with great talent. The Mosella by Ausonius demonstrated a modernism of feeling that indicates the end of classical literature as such.     At the same time, other men laid the foundations of ": null
    },
    {
        "Christian Latin literature": "christian latin literature"
    },
    {
        " during the 4th century and 5th century. They included the church fathers ": null
    },
    {
        "Augustine of Hippo": "augustine of hippo"
    },
    {
        ", ": null
    },
    {
        "Jerome": "jerome"
    },
    {
        ", and ": null
    },
    {
        "Ambrose": "ambrose"
    },
    {
        ", and the first great Christian poet, ": null
    },
    {
        "Prudentius": "prudentius"
    },
    {
        ".     During the Renaissance there was a return to the Latin of classical times, called for this reason ": null
    },
    {
        "Neo-Latin": "new latin language"
    },
    {
        ". This purified language continued to be used as the lingua franca among the learned throughout Europe, with the great works of ": null
    },
    {
        "Descartes": "descartes"
    },
    {
        ", ": null
    },
    {
        "Francis Bacon": "francis bacon"
    },
    {
        ", and ": null
    },
    {
        "Baruch Spinoza": "baruch spinoza"
    },
    {
        " all being composed in Latin. Among the last important books written primarily in Latin prose were the works of ": null
    },
    {
        "Swedenborg": "emanuel swedenborg"
    },
    {
        " , ": null
    },
    {
        "Linnaeus": "carl linnaeus"
    },
    {
        " , ": null
    },
    {
        "Euler": "leonhard euler"
    },
    {
        " , ": null
    },
    {
        "Gauss": "carl friedrich gauss"
    },
    {
        " , and ": null
    },
    {
        "Isaac Newton": "isaac newton"
    },
    {
        " , and Latin remains a necessary skill for modern readers of great early modern works of linguistics, literature, and philosophy.     Several of the leading English poets wrote in Latin as well as English. ": null
    },
    {
        "Miltons 1645 Poems": "miltons 1645 poems"
    },
    {
        " are one example, but there were also ": null
    },
    {
        "Thomas Campion": "thomas campion"
    },
    {
        ", ": null
    },
    {
        "George Herbert": "george herbert"
    },
    {
        " and Miltons colleague ": null
    },
    {
        "Andrew Marvell": "andrew marvell"
    },
    {
        ". Some indeed wrote chiefly in Latin and were valued for the elegance and Classicism of their style. Examples of these were ": null
    },
    {
        "Anthony Alsop": "anthony alsop"
    },
    {
        " and ": null
    },
    {
        "Vincent Bourne": "vincent bourne"
    },
    {
        ", who were noted for the ingenious way that they adapted their verse to describing details of life in the 18th century while never departing from the purity of Latin diction. D.K.Money, The Latin Poetry of English Gentlemen , in Neo-Latin Poetry in the British Isles, London 2012,  One of the last to be noted for the quality of his Latin verse well into the 19th century was ": null
    },
    {
        "Walter Savage Landor": "walter savage landor"
    },
    {
        ".        Much Latin writing reflects the Romans interest in rhetoric, the art of speaking and persuading. Public speaking had great importance for educated Romans because most of them wanted successful political careers. When Rome was a ": null
    },
    {
        "republic": "roman republic"
    },
    {
        ", effective speaking often determined who would be elected or what bills would pass. After Rome became an ": null
    },
    {
        "empire": "roman empire"
    },
    {
        ", the ability to impress and persuade people by the spoken word lost much of its importance. But training in rhetoric continued to flourish and to affect styles of writing. A large part of rhetoric consists of the ability to present a familiar idea in a striking new manner that attracts attention. Latin authors became masters of this art of variety.       Latin is a highly inflected language, with many grammatical forms for various words. As a result, it can be used with a pithiness and brevity unknown in English. It also lends itself to elaboration, because its tight syntax holds even the longest and most complex sentence together as a logical unit. Latin can be used with striking conciseness, as in the works of ": null
    },
    {
        "Sallust": "sallust"
    },
    {
        " and ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        ". Or it can have wide, sweeping phrases, as in the works of ": null
    },
    {
        "Livy": "livy"
    },
    {
        " and the speeches of ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        ".     Latin lacks the rich poetic vocabulary that marks the Greek poetry. Some earlier Latin poets tried to make up for this deficiency by creating new compound words, as the Greeks had done. But Roman writers seldom invented words. Except in epic poetry, they tended to use a familiar vocabulary, giving it poetic value by imaginative combinations of words and by rich sound effects. Romes leading poets had great technical skill in the choice and arrangement of language. They also had an intimate knowledge of the Greek poets, whose themes appear in almost all Roman literature.     Latin moves with impressive dignity in the writings of ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        ", ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        ", or ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        ". It reflects the seriousness and sense of responsibility that characterized the ruling class of Rome during the great years of the republic. But the Romans could also relax and allow what ": null
    },
    {
        "Horace": "horace"
    }
]