[
    {
        "   Latveria is a fictional ": null
    },
    {
        "nation": "country"
    },
    {
        " appearing in ": null
    },
    {
        "American comic books": "american comic book"
    },
    {
        "published by ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        ". It is depicted within the storylines of Marvels comic titles as an isolated European country ruled by the fictional Supreme Lord ": null
    },
    {
        "Doctor Doom": "doctor doom"
    },
    {
        ", supposedly located in the ": null
    },
    {
        "Banat": "banat"
    },
    {
        " region. It is surrounded by the ": null
    },
    {
        "Carpathian Mountains": "carpathian mountains"
    },
    {
        ", and also borders ": null
    },
    {
        "Symkaria": "symkaria"
    },
    {
        "  to the south. Its ": null
    },
    {
        "capital": "capital"
    },
    {
        " is Doomstadt.       Latveria first appeared in Fantastic Four Annual 2, published in 1964. ": null
    },
    {
        "Victor von Doom": "doctor doom"
    },
    {
        " is the ruler of Latveria. Though he has been dethroned a number of times, Victor has invariably managed to return to the throne of his country within a matter of months.     Victor also has a council who obey him entirely. In Fantastic Four 536 in 2006, he killed his own ": null
    },
    {
        "Prime Minister": "prime minister"
    },
    {
        " for claiming control of Latveria in his absence and threatened to kill two other ministers if they failed to find the landing spot of ": null
    },
    {
        "Thors": "thor"
    },
    {
        " hammer": "mjolnir"
    },
    {
        ".     Doctor Dooms style of rule can best be described as an ": null
    },
    {
        "absolute monarchy": "absolute monarchy"
    },
    {
        ", as it was revealed that there is no ": null
    },
    {
        "legislature": "legislature"
    },
    {
        ", and one minister boasted Doctor Doom decides everything. His slightest whim is Latverian law! It is shown Doom has devices throughout the Kingdom to watch his people and even has hidden weapons to prevent them leaving without his consent. In one story he is able to activate a force field around Latveria which prevents anybody leaving, though apparently it can be a defense against nuclear attack. Avengers 21       Latveria was formed out of land annexed from southern ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        " centuries before, and possibly land from ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        " as well Fantastic Four 504 as ": null
    },
    {
        "Romania": "romania"
    },
    {
        ".       At some point, Doctor Doom had his army of Servo Guards invade Rotruvia where he was successful at annexing it. All-New, All-Different Avengers 15       Due to Dooms undertakings that drive him away from Latveria, the monarch is often absent. After Dooms descent into ": null
    },
    {
        "Hell": "hell"
    },
    {
        ", the nation became a target for conquest by the neighboring countries. This forces ": null
    },
    {
        "Reed Richards": "mister fantastic"
    },
    {
        " to seize control of the country, attempting to pry the populace out from under the thumb of Doom, while at the same time disarming all of Dooms weaponry and technology, so if he ever returned, he would come back to absolutely nothing. In the process, Richards relocated Doom from Hell into a pocket dimension of his own design, and although Doom used his consciousness-switching abilities to escape, the death of his host body seemingly caused him to die as well, and the ": null
    },
    {
        "Fantastic Four": "fantastic four"
    },
    {
        " pulled out of the country.     However Doom survives this and rules Latveria for a time with a puppet Prime Minister and robotic enforcers.       After the Fantastic Four left, the United States attempted to fill the void left by Doom by establishing a democracy for the nation. The Countess ": null
    },
    {
        "Lucia von Bardas": "lucia von bardas"
    },
    {
        " was elected as Prime Minister. However, when it was revealed that von Bardas was employing the ": null
    },
    {
        "Tinkerer": "tinkerer"
    },
    {
        " to use Dooms technology to arm various tech-based villains in the United States, ": null
    },
    {
        "S.H.I.E.L.D.": "s.h.i.e.l.d."
    },
    {
        " Commander ": null
    },
    {
        "Nick Fury": "nick fury"
    },
    {
        " took action.     During  Secret War , Fury and a number of superheroes invaded Latveria without permission of the US Government and attempted to assassinate von Bardas. While von Bardas survived, she was horribly disfigured and sought to destroy Fury and the heroes responsible. She was killed by S.H.I.E.L.D. Agent ": null
    },
    {
        "Daisy Johnson": "daisy johnson"
    },
    {
        " while trying to blow up New York with the armor of the various villains she employed.       Much of Latveria was destroyed and the population severely reduced by an attack executed by the Marquis of Death .     S.H.I.E.L.D., under the leadership of ": null
    },
    {
        "Iron Man": "iron man"
    },
    {
        " and his team of ": null
    },
    {
        "U.S. sanctioned Avengers": "the mighty avengers"
    },
    {
        " invaded Latveria after discovering Dooms involvement in the release of a ": null
    },
    {
        "symbiote": "symbiote"
    },
    {
        " virus on New York. The country was yet again devastated and Doom was taken into custody for crimes against humanity. The Mighty Avengers 7-12     Doom is released from prison due to the influence of ": null
    },
    {
        "H.A.M.M.E.R director Norman Osborn": "green goblin"
    },
    {
        ". He restores his nation with the use of his time travel technology. Dark Avengers 4       During the  Avengers vs. X-Men  storyline, Spider-Man fights against a ": null
    },
    {
        "Juggernaut": "juggernaut"
    },
    {
        "-empowered ": null
    },
    {
        "Colossus": "colossus"
    },
    {
        " here. AVX Vs 2       The common geographic description of Latveria places it as a small nation, around the area where ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", ": null
    },
    {
        "Romania": "romania"
    },
    {
        " and ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        "  meet in real life. To its south in the Marvel universe is the nation of ": null
    },
    {
        "Symkaria": "symkaria"
    },
    {
        ", which is depicted as a benevolent ": null
    },
    {
        "constitutional monarchy": "constitutional monarchy"
    },
    {
        " in contrast to the dictatorship to its north. The capital city of Latveria is Doomstadt, formerly Hassenstadt, renamed when Doom seized power, located just north of the Kline River. The administrative center is Castle Doom.     Population: 500,000   Type of Government: ": null
    },
    {
        "Dictatorship": "dictatorship"
    },
    {
        "    Languages: ": null
    },
    {
        "German": "german language"
    },
    {
        ", ": null
    },
    {
        "Hungarian": "hungarian language"
    },
    {
        ", ": null
    },
    {
        "English": "english language"
    },
    {
        ", Latverian , ": null
    },
    {
        "Romanian": "romanian language"
    },
    {
        ". ": null
    },
    {
        "Roma": "romani people"
    },
    {
        ", Greek, possibly Bulgarians who migrated in Banat during the Ottoman rule in Bulgaria   Major Business Centers: None   Currency: Latverian ": null
    },
    {
        "Franc": "franc"
    },
    {
        " Doomsday": "doomsday event"
    },
    {
        "The suffix -stadt is German for city or more accurately, keeping Victor von Doom on the thronea group of demonswearing his traditional Marvel armour and cloak1994 TV series": null
    },
    {
        "rvel Comi": "rvel comi"
    },
    {
        "TV series": null
    },
    {
        "mi": "mi"
    },
    {
        "m Alexand": "m alexand"
    },
    {
        "a Aya": "a aya"
    },
    {
        "TV series2005 film2015 film2000 video gamevideo gamevideo game": null
    },
    {
        "rvel Comi": "rvel comi"
    },
    {
        "2008 video gamecomicsvideo gameto provide cover for Peter Parkers attempt to find out what Dr. Doom is plotting": null
    }
]