[
    {
        "In the ": null
    },
    {
        "Polynesian mythology": "polynesian mythology"
    },
    {
        " of ": null
    },
    {
        "Tonga": "tonga"
    },
    {
        ", Laufakanaa was a primordial creator god. Although called Tongan, his home was Ata, and he was better known by the original Tongans on the ": null
    },
    {
        "Lau Islands": "lau islands"
    },
    {
        " than in the kingdom of Tonga proper.     In Tongan cosmogony, the sky and the sea, and the land of ": null
    },
    {
        "Pulotu": "pulotu"
    },
    {
        " existed from the earliest times. All other lands were created later. Either they were thrown down from the sky by ": null
    },
    {
        "Havea Hikuleo": "hikuleo"
    },
    {
        " or, subsequently, they were fished up by ": null
    },
    {
        "Maui": "maui"
    },
    {
        " from the bottom of the ocean. All the makafonua of Hikuleo were full of unevenness, and tended to jump around and were full of holes and pits , while Mauis lands were smooth . ": null
    },
    {
        "Ata": "ata"
    },
    {
        " and ": null
    },
    {
        "Eua": "eua"
    },
    {
        ", the islands which were fished up first, were quite hilly, as Maui apparently was not an expert fisherman yet. His next catch,  he kept much smoother.     The first people of Ata came forth directly from the same uanga as ": null
    },
    {
        "Kohai, Koau, mo Momo": "kohai, koau, mo momo"
    },
    {
        ", and were the ancestors of all other men. At that time the god ": null
    },
    {
        "Tamapoulialamafoa": "tamapoulialamafoa"
    },
    {
        " was the king of the sky, and he commanded some of the ": null
    },
    {
        "Tangaloa": "tangaloa"
    },
    {
        " gods to tell the faahikehe Laufakanaa to go down to the realm of light to become ruler of Ata and also ruler of the winds. Whenever a boat came to Ata in stormy weather, Laufakanaa had to listen to the prayers of the crew and give them a good wind to sail on. The prayer had to consist of an offering of mā cooked in the oil of the grated ": null
    },
    {
        "coconut": "coconut"
    },
    {
        ".     Laufakanaa also brought a special fishing net with him. This typical Ata-net was used by the islanders on special occasions, as when they went fishing for the ": null
    },
    {
        "Tui Tonga": "tui tonga"
    },
    {
        ". As well, the putalinga , the sī , the ngū-ata and tua-ata ": null
    },
    {
        "yams": "yam"
    },
    {
        " were brought down from the sky by Laufakanaa and first grew on ": null
    }
]