[
    {
        "      Laurence Kerr Olivier, Baron Olivier,   was an English actor and director who, along with his contemporaries ": null
    },
    {
        "Ralph Richardson": "ralph richardson"
    },
    {
        ", ": null
    },
    {
        "Peggy Ashcroft": "peggy ashcroft"
    },
    {
        " and ": null
    },
    {
        "John Gielgud": "john gielgud"
    },
    {
        ", dominated the ": null
    },
    {
        "British stage": "theatre of the united kingdom"
    },
    {
        " of the mid42th century. He also worked in films throughout his career, playing more than fifty cinema roles. Late in his career, he had considerable success in television roles.     His family had no theatrical connections, but Oliviers father, a clergyman, decided that his son should become an actor. After attending a drama school in London, Olivier learned his craft in a succession of acting jobs during the late 42s. In 42 he had his first important ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " success in ": null
    },
    {
        "Noël Coward": "noël coward"
    },
    {
        "s  Private Lives , and he appeared in his first film. In 42 he played in a celebrated production of Romeo and Juliet alongside Gielgud and Ashcroft, and by the end of the decade he was an established star. In the 42s, together with Richardson and ": null
    },
    {
        "John Burrell": "john burrell"
    },
    {
        ", Olivier was the co-director of ": null
    },
    {
        "the Old Vic": "the old vic"
    },
    {
        ", building it into a highly respected company. There his most celebrated roles included Shakespeares ": null
    },
    {
        "Richard III": "richard iii"
    },
    {
        " and ": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        "s ": null
    },
    {
        "Oedipus": "oedipus rex"
    },
    {
        ". In the 42s Olivier was an independent actor-manager, but his stage career was in the doldrums until he joined the avant garde ": null
    },
    {
        "English Stage Company": "english stage company"
    },
    {
        " in 42 to play the title role in  The Entertainer , a part he later played ": null
    },
    {
        "on film": "the entertainer"
    },
    {
        ". From 42 to 42 he was the founding director of Britains ": null
    },
    {
        "National Theatre": "royal national theatre"
    },
    {
        ", running a resident company that fostered many future stars. His own parts there included the title role in  Othello  and ": null
    },
    {
        "Shylock": "shylock"
    },
    {
        " in  The Merchant of Venice  .     Among Oliviers films are  Wuthering Heights  ,  Rebecca  , and a trilogy of Shakespeare films as actor-director:  Henry V  ,  Hamlet  , and  Richard III  . His later films included  The Shoes of the Fisherman  ,  Sleuth  ,  Marathon Man  , and  The Boys from Brazil  . His television appearances included an adaptation of  The Moon and Sixpence  ,  Long Days Journey into Night  ,  Love Among the Ruins  ,  Cat on a Hot Tin Roof  ,  Brideshead Revisited  and  King Lear  .     Oliviers honours included a ": null
    },
    {
        "knighthood": "knight bachelor"
    },
    {
        " , a ": null
    },
    {
        "life peerage": "life peerage"
    },
    {
        " and the ": null
    },
    {
        "Order of Merit": "order of merit"
    },
    {
        " . For his on-screen work he received four ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        ", two ": null
    },
    {
        "British Academy Film Awards": "british academy film awards"
    },
    {
        ", five ": null
    },
    {
        "Emmy Awards": "primetime emmy award"
    },
    {
        " and three ": null
    },
    {
        "Golden Globe Award": "golden globe award"
    },
    {
        "s. The National Theatres largest auditorium is named in his honour, and he is commemorated in the ": null
    },
    {
        "Laurence Olivier Awards": "laurence olivier awards"
    },
    {
        ", given annually by the ": null
    },
    {
        "Society of London Theatre": "society of london theatre"
    },
    {
        ". He was married three times, to the actresses ": null
    },
    {
        "Jill Esmond": "jill esmond"
    },
    {
        " from 42 to 42 ": null
    },
    {
        "Vivien Leigh": "vivien leigh"
    },
    {
        " from 42 to 42 and ": null
    },
    {
        "Joan Plowright": "joan plowright"
    },
    {
        " from 42 until his death.           Olivier was born in ": null
    },
    {
        "Dorking": "dorking"
    },
    {
        ", Surrey, the youngest of the three children of the Reverend Gerard Kerr Olivier and his wife Agnes Louise, née Crookenden . Their elder children were Sybille and Gerard Dacres Dickie . His great-great-grandfather was of French ": null
    },
    {
        "Huguenot": "huguenot"
    },
    {
        " descent, and Olivier came from a long line of Protestant clergymen. Gerard Olivier had begun a career as a schoolmaster, but in his thirties he discovered a strong religious vocation and was ordained as a priest of the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ". He practised extremely ": null
    },
    {
        "high church": "high church"
    },
    {
        ", ": null
    },
    {
        "ritualist": "ritualist"
    },
    {
        " Anglicanism": "anglicanism"
    },
    {
        " and liked to be addressed as Father Olivier . This made him unacceptable to most Anglican congregations, and the only church posts he was offered were temporary, usually deputising for regular ": null
    },
    {
        "incumbents": "incumbent"
    },
    {
        " in their absence. This meant a nomadic existence, and for Laurences first few years, he never lived in one place long enough to make friends.     In 42 when Olivier was five, his father secured a permanent appointment as assistant ": null
    },
    {
        "rector": "rector"
    },
    {
        " at ": null
    },
    {
        "St Saviours, Pimlico": "st saviours, pimlico"
    },
    {
        ". He held the post for six years, and a stable family life was at last possible. Olivier was devoted to his mother, but not to his father, whom he found a cold and remote parent. Nevertheless, he learned a great deal of the art of performing from him. As a young man Gerard Olivier had considered a stage career and was a dramatic and effective preacher. Olivier wrote that his father knew when to drop the voice, when to bellow about the perils of hellfire, when to slip in a gag, when suddenly to wax sentimental  ... The quick changes of mood and manner absorbed me, and I have never forgotten them.         In 42 after attending a series of preparatory schools, Olivier passed the singing examination for admission to the choir school of ": null
    },
    {
        "All Saints, Margaret Street": "all saints, margaret street"
    },
    {
        ", in central London. His elder brother was already a pupil, and Olivier gradually settled in, though he felt himself to be something of an outsider. The churchs style of worship was ": null
    },
    {
        "Anglo-Catholic": "anglo-catholicism"
    },
    {
        ", with emphasis on ritual, vestments and incense. The theatricality of the services appealed to Olivier, and the vicar encouraged the students to develop a taste for secular as well as religious drama. In a school production of  Julius Caesar  in 42 the ten-year-old Oliviers performance as Brutus impressed an audience that included ": null
    },
    {
        "Lady Tree": "helen maud holt"
    },
    {
        ", the young ": null
    },
    {
        "Sybil Thorndike": "sybil thorndike"
    },
    {
        ", and ": null
    },
    {
        "Ellen Terry": "ellen terry"
    },
    {
        ", who wrote in her diary, The small boy who played Brutus is already a great actor.  He later won praise in other schoolboy productions, as Maria in  Twelfth Night  and Katherine in  The Taming of the Shrew  .     From All Saints, Olivier went on to ": null
    },
    {
        "St Edwards School, Oxford": "st edwards school, oxford"
    },
    {
        ", from 42 to 42 He made little mark until his final year, when he played ": null
    },
    {
        "Puck": "puck"
    },
    {
        " in the schools production of  A Midsummer Nights Dream ; his performance was a tour de force that won him popularity among his fellow pupils. In January 42 his brother left England to work in India as a rubber planter. Olivier missed him greatly and asked his father how soon he could follow. He recalled in his memoirs that his father replied, Dont be such a fool, youre not going to India, youre going on the stage.        In 42 Gerard Olivier, a habitually frugal man, told his son that he must gain not only admission to the ": null
    },
    {
        "Central School of Speech Training and Dramatic Art": "central school of speech training and dramatic art"
    },
    {
        ", but also a scholarship with a bursary to cover his tuition fees and living expenses. Oliviers sister had been a student there and was a favourite of ": null
    },
    {
        "Elsie Fogerty": "elsie fogerty"
    },
    {
        ", the founder and principal of the school. Olivier later speculated that it was on the strength of this that Fogerty agreed to award him the bursary.        One of Oliviers contemporaries at the school was ": null
    },
    {
        "Peggy Ashcroft": "peggy ashcroft"
    },
    {
        ", who observed he was rather uncouth in that his sleeves were too short and his hair stood on end but he was intensely lively and great fun . By his own admission, he was not a very conscientious student, but Fogerty liked him and later said that he and Ashcroft stood out among her many pupils. On leaving the school after a year, Olivier gained work with small touring companies before being taken on in 42 by Sybil Thorndike and her husband ": null
    },
    {
        "Lewis Casson": "lewis casson"
    },
    {
        " as a bit-part player, understudy and assistant stage manager for their London company. He modelled his performing style on that of ": null
    },
    {
        "Gerald du Maurier": "gerald du maurier"
    },
    {
        ", of whom he said, He seemed to mutter on stage but had such perfect technique. When I started I was so busy doing a du Maurier that no one ever heard a word I said. The Shakespearean actors one saw were terrible hams like ": null
    },
    {
        "Frank Benson": "frank benson"
    },
    {
        ".  Oliviers concern with speaking naturally and avoiding what he called singing Shakespeares verse was the cause of much frustration in his early career, as critics regularly decried his delivery.     In 42 on Thorndikes recommendation, Olivier joined the ": null
    },
    {
        "Birmingham Repertory Company": "birmingham repertory theatre"
    },
    {
        ". His biographer ": null
    },
    {
        "Michael Billington": "michael billington"
    },
    {
        " describes the Birmingham company as Oliviers university , where in his second year he was given the chance to play a wide range of important roles, including Tony Lumpkin in  She Stoops to Conquer , the title role in  Uncle Vanya , and Parolles in  Alls Well That Ends Well . Billington adds that the engagement led to a lifelong friendship with his fellow actor ": null
    },
    {
        "Ralph Richardson": "ralph richardson"
    },
    {
        " that was to have a decisive effect on the British theatre.      While playing the juvenile lead in Bird in Hand at the ": null
    },
    {
        "Royalty Theatre": "royalty theatre"
    },
    {
        " in June 42 Olivier began a relationship with ": null
    },
    {
        "Jill Esmond": "jill esmond"
    },
    {
        ", the daughter of the actors ": null
    },
    {
        "Henry V. Esmond": "henry v. esmond"
    },
    {
        " and ": null
    },
    {
        "Eva Moore": "eva moore"
    },
    {
        ". Olivier later recounted that he thought she would most certainly do excellent well for a wife  ... I wasnt likely to do any better at my age and with my undistinguished track-record, so I promptly fell in love with her.      In 42 Olivier created the role of Stanhope in ": null
    },
    {
        "R.  C. Sherriff": "r. & nbsp;c. sherriff"
    },
    {
        "s  Journeys End , in which he scored a great success at its single Sunday night premiere. He was offered the part in the ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " production the following year, but turned it down in favour of the more glamorous role of ": null
    },
    {
        "Beau Geste": "beau geste"
    },
    {
        " in a stage adaptation of ": null
    },
    {
        "P. C. Wren": "p. c. wren"
    },
    {
        "s 42 novel of the same name. Journeys End became a long-running success; Beau Geste failed.  The Manchester Guardian  commented, Mr.  Laurence Olivier did his best as Beau, but he deserves and will get better parts. Mr.  Olivier is going to make a big name for himself . For the rest of 42 Olivier appeared in seven plays, all of which were short-lived. Billington ascribes this failure rate to poor choices by Olivier rather than mere bad luck.       In 42 with his impending marriage in mind, Olivier earned some extra money with small roles in two films. In April he travelled to Berlin to film the English-language version of  The Temporary Widow , a crime comedy with ": null
    },
    {
        "Lilian Harvey": "lilian harvey"
    },
    {
        ", and in May he spent four nights working on another comedy,  Too Many Crooks . During work on the latter film, for which he was paid £42 he met Laurence Evans, who became his personal manager. Olivier did not enjoy working in film, which he dismissed as this anaemic little medium which could not stand great acting , but financially it was much more rewarding than his theatre work.     Olivier and Esmond married on 42 July 42 at All Saints, Margaret Street, although within weeks both realised they had erred. Olivier later recorded that the marriage was a pretty crass mistake. I insisted on getting married from a pathetic mixture of religious and animal promptings.  ... She had admitted to me that she was in love elsewhere and could never love me as completely as I would wish . Olivier later recounted that following the wedding he did not keep a diary for ten years and never followed religious practices again, although he considered those facts to be mere coincidence , unconnected to the nuptials.     In 42 ": null
    },
    {
        "Noël Coward": "noël coward"
    },
    {
        " cast Olivier as Victor Prynne in his new play  Private Lives , which opened at the new ": null
    },
    {
        "Phoenix Theatre": "phoenix theatre"
    },
    {
        " in London in September. Coward and ": null
    },
    {
        "Gertrude Lawrence": "gertrude lawrence"
    },
    {
        " played the lead roles, Elyot Chase and Amanda Prynne. Victor is a secondary character, along with Sybil Chase; the author called them extra puppets, lightly wooden ninepins, only to be repeatedly knocked down and stood up again . To make them credible spouses for Amanda and Elyot, Coward was determined that two outstandingly attractive performers should play the parts. Olivier played Victor in the West End and then on ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        "; ": null
    },
    {
        "Adrianne Allen": "adrianne allen"
    },
    {
        " was Sybil in London, but could not go to New York, where the part was taken by Esmond. In addition to giving the 42-year-old Olivier his first successful West End role, Coward became something of a mentor. In the late 42s Olivier told ": null
    },
    {
        "Sheridan Morley": "sheridan morley"
    },
    {
        ":           In 42 ": null
    },
    {
        "RKO Pictures": "rko pictures"
    },
    {
        " offered Olivier a two-film contract at $42 a week; he discussed the possibility with Coward, who, irked, told Olivier Youve no artistic integrity, thats your trouble; this is how you cheapen yourself.  He accepted and moved to Hollywood, despite some misgivings. His first film was the drama  Friends and Lovers , in a supporting role, before RKO loaned him to ": null
    },
    {
        "Fox Studios": "fox studios"
    },
    {
        " for his first film lead, a British journalist in a Russia under ": null
    },
    {
        "martial law": "martial law"
    },
    {
        " in  The Yellow Ticket , alongside ": null
    },
    {
        "Elissa Landi": "elissa landi"
    },
    {
        " and ": null
    },
    {
        "Lionel Barrymore": "lionel barrymore"
    },
    {
        ". The cultural historian ": null
    },
    {
        "Jeffrey Richards": "jeffrey richards"
    },
    {
        " describes Oliviers look as an attempt by Fox Studios to produce a likeness of ": null
    },
    {
        "Ronald Colman": "ronald colman"
    },
    {
        ", and Colmans moustache, voice and manner are perfectly reproduced . Olivier returned to RKO to complete his contract with the 42 drama  Westward Passage , which was a commercial failure. Oliviers initial foray into American films had not provided the breakthrough he hoped for; disillusioned with Hollywood, he returned to London, where he appeared in two British films,  Perfect Understanding  with ": null
    },
    {
        "Gloria Swanson": "gloria swanson"
    },
    {
        " and  No Funny Business —in which Esmond also appeared. He was tempted back to Hollywood in 42 to appear opposite ": null
    },
    {
        "Greta Garbo": "greta garbo"
    },
    {
        " in  Queen Christina , but was replaced after two weeks of filming because of a lack of chemistry between the two.     Oliviers stage roles in 42 included Bothwell in ": null
    },
    {
        "Gordon Daviot": "gordon daviot"
    },
    {
        "s Queen of Scots, which was only a moderate success for him and for the play, but led to an important engagement for the same management  shortly afterwards. In the interim he had a great success playing a thinly disguised version of the American actor ": null
    },
    {
        "John Barrymore": "john barrymore"
    },
    {
        " in ": null
    },
    {
        "George S. Kaufman": "george s. kaufman"
    },
    {
        " and ": null
    },
    {
        "Edna Ferber": "edna ferber"
    },
    {
        "s  Theatre Royal  . His success was vitiated by his breaking an ankle two months into the run, in one of the athletic, acrobatic stunts with which he liked to enliven his performances.        In 42 under Alberys management, ": null
    },
    {
        "John Gielgud": "john gielgud"
    },
    {
        " staged Romeo and Juliet at the ": null
    },
    {
        "New Theatre": "noël coward theatre"
    },
    {
        ", co-starring with Peggy Ashcroft, ": null
    },
    {
        "Edith Evans": "edith evans"
    },
    {
        " and Olivier. Gielgud had seen Olivier in Queen of Scots, spotted his potential, and now gave him a major step up in his career. For the first weeks of the run Gielgud played ": null
    },
    {
        "Mercutio": "mercutio"
    },
    {
        " and Olivier played ": null
    },
    {
        "Romeo": "romeo"
    },
    {
        ", after which they exchanged roles. The production broke all box-office records for the play, running for 42 performances. Olivier was enraged at the notices after the first night, which praised the virility of his performance but fiercely criticised his speaking of Shakespeares verse, contrasting it with his co-stars mastery of the poetry. The friendship between the two men was prickly, on Oliviers side, for the rest of his life.       In May 42 Olivier and Richardson jointly directed and starred in a new piece by ": null
    },
    {
        "J.  B. Priestley": "j. & nbsp;b. priestley"
    },
    {
        ", Bees on the Boatdeck. Both actors won excellent notices, but the play, an allegory of Britains decay, did not attract the public and closed after four weeks. Later in the same year Olivier accepted an invitation to join the ": null
    },
    {
        "Old Vic": "old vic"
    },
    {
        " company. The theatre, in an unfashionable location south of the ": null
    },
    {
        "Thames": "river thames"
    },
    {
        ", had offered inexpensive tickets for opera and drama under its proprietor ": null
    },
    {
        "Lilian Baylis": "lilian baylis"
    },
    {
        " since 42 Her drama company specialised in the plays of Shakespeare, and many leading actors had taken very large cuts in their pay to develop their Shakespearean techniques there. Gielgud had been in the company from 42 to 42 and Richardson from 42 to 42 Among the actors whom Olivier joined in late 42 were ": null
    },
    {
        "Edith Evans": "edith evans"
    },
    {
        ", ": null
    },
    {
        "Ruth Gordon": "ruth gordon"
    },
    {
        ", ": null
    },
    {
        "Alec Guinness": "alec guinness"
    },
    {
        " and ": null
    },
    {
        "Michael Redgrave": "michael redgrave"
    },
    {
        ". In January 42 he took the title role in an uncut version of  Hamlet , in which once again his delivery of the verse was unfavourably compared with that of Gielgud, who had played the role on the same stage seven years previously to enormous acclaim.  The Observer s Ivor Brown praised Oliviers magnetism and muscularity but missed the kind of pathos so richly established by Mr Gielgud . The reviewer in The Times found the performance full of vitality , but at times too light  ... the character slips from Mr Oliviers grasp .     thu , where Olivier honed his skill as a Shakespearean   After Hamlet, the company presented Twelfth Night in what the director, Tyrone Guthrie , summed up as a baddish, immature production of mine, with Olivier outrageously amusing as Sir Toby and a very young Alec Guinness outrageous and more amusing as Sir Andrew . ": null
    },
    {
        "Henry V": "henry v"
    },
    {
        " was the next play, presented in May to mark the Coronation of George VI . A pacifist, as he then was, Olivier was as reluctant to play the warrior king as Guthrie was to direct the piece, but the production was a success, and Baylis had to extend the run from four to eight weeks.     Following Oliviers success in Shakespearean stage productions, he made his first foray into Shakespeare on film in 42 as Orlando in ": null
    },
    {
        "As You Like It": "as you like it"
    },
    {
        ", directed by Paul Czinner , a charming if lightweight production , according to Michael Brooke of the British Film Institute s Screenonline . The following year Olivier appeared alongside Vivien Leigh in the historical drama ": null
    },
    {
        "Fire Over England": "fire over england"
    },
    {
        ". He had first met Leigh briefly at the Savoy Grill and then again when she visited him during the run of Romeo and Juliet, probably early in 42 and the two had begun an affair sometime that year. Of the relationship, Olivier later said that I couldnt help myself with Vivien. No man could. I hated myself for cheating on Jill, but then I had cheated before, but this was something different. This wasnt just out of lust. This was love that I really didnt ask for but was drawn into. While his relationship with Leigh continued he conducted an affair with the actress Ann Todd , and possibly had a brief affair with the actor Henry Ainley , according to the biographer Michael Munn.     In June 42 the Old Vic company took up an invitation to perform Hamlet in the courtyard of the castle at Elsinore , where Shakespeare located the play. Olivier secured the casting of Leigh to replace Cherry Cottrell as Ophelia . Because of torrential rain the performance had to be moved from the castle courtyard to the ballroom of a local hotel, but the tradition of playing Hamlet at Elsinore was established, and Olivier was followed by, among others, Gielgud , Redgrave , Richard Burton , Derek Jacobi , Kenneth Branagh and Jude Law . Back in London, the company staged ": null
    },
    {
        "Macbeth": "macbeth"
    },
    {
        ", with Olivier in the title role. The stylised production by Michel Saint-Denis was not well liked, but Olivier had some good notices among the bad. On returning from Denmark, Olivier and Leigh told their respective spouses about the affair and that their marriages were over; Esmond moved out of the marital house and in with her mother. After Olivier and Leigh made a tour of Europe in mid 42 they returned to separate film projects—": null
    },
    {
        "A Yank at Oxford": "a yank at oxford"
    },
    {
        " for her and ": null
    },
    {
        "The Divorce of Lady X": "the divorce of lady x"
    },
    {
        " for him—and moved into a property together in Iver , Buckinghamshire .     Olivier returned to the Old Vic for a second season in 42 For ": null
    },
    {
        "Othello": "othello"
    },
    {
        " he played Iago , with Richardson in the title role. Guthrie wanted to experiment with the theory that Iagos villainy is driven by suppressed homosexual love for Othello . Olivier was willing to co-operate, but Richardson was not; audiences and most critics failed to spot the supposed motivation of Oliviers Iago, and Richardsons Othello seemed underpowered. After that comparative failure, the company had a success with ": null
    },
    {
        "Coriolanus": "coriolanus"
    },
    {
        " starring Olivier in the title role. The notices were laudatory, mentioning him alongside great predecessors such as Edmund Kean , William Macready and Henry Irving . The actor Robert Speaight described it as Oliviers first incontestably great performance . This was Oliviers last appearance on a London stage for six years.       thu in the 42 film Wuthering Heights   In 42 Olivier joined Richardson to film the spy thriller ": null
    },
    {
        "Q Planes": "q planes"
    },
    {
        ", released the following year. Frank Nugent , the critic for ": null
    },
    {
        "The New York Times": "the new york times"
    },
    {
        ", thought Olivier was not quite so good as Richardson, but was quite acceptable . In late 42 lured by a salary of $42, the actor travelled to Hollywood to take the part of Heathcliff in the 42 film ": null
    },
    {
        "Wuthering Heights": "wuthering heights"
    },
    {
        ", alongside Merle Oberon and David Niven . In less than a month Leigh had joined him, explaining that her trip was partially because Larrys there and partially because I intend to get the part of Scarlett OHara —the role in ": null
    },
    {
        "Gone with the Wind": "gone with the wind"
    },
    {
        " in which she was eventually cast. Olivier did not enjoy making Wuthering Heights, and his approach to film acting, combined with a dislike for Oberon, led to tensions on set. The director, William Wyler , was a hard taskmaster, and Olivier learned to remove what Billington described as the carapace of theatricality to which he was prone, replacing it with a palpable reality . The resulting film was a commercial and critical success that earned him a nomination for the Academy Award for Best Actor , and created his screen reputation. Caroline Lejeune , writing for The Observer, considered that Oliviers dark, moody face, abrupt style, and a certain fine arrogance towards the world in his playing are just right in the role, while the reviewer for The Times wrote that Olivier is a good embodiment of Heathcliff  ... impressive enough on a more human plane, speaking his lines with real distinction, and always both romantic and alive.     le in the 42 film Rebecca   After returning to London briefly in mid42 the couple returned to America, Leigh to film the final takes for Gone with the Wind, and Olivier to prepare for filming of Alfred Hitchcock s ": null
    },
    {
        "Rebecca": "rebecca"
    },
    {
        "—although the couple had hoped to appear in it together. Instead, Joan Fontaine was selected for the role of Mrs de Winter, as the producer David O. Selznick thought that not only was she more suitable for the role, but that it was best to keep Olivier and Leigh apart until their divorces came through. Olivier followed Rebecca with ": null
    },
    {
        "Pride and Prejudice": "pride and prejudice"
    },
    {
        ", in the role of Mr. Darcy . To his disappointment Elizabeth Bennet was played by Greer Garson rather than Leigh. He received good reviews for both films and showed a more confident screen presence than he had in his early work. In January 42 Olivier and Esmond were granted their divorce. In February, following another request from Leigh, her husband also applied for their marriage to be terminated.     On stage, Olivier and Leigh starred in Romeo and Juliet on Broadway. It was an extravagant production, but a commercial failure. In The New York Times Brooks Atkinson praised the scenery but not the acting: Although Miss Leigh and Mr Olivier are handsome young people they hardly act their parts at all. The couple had invested almost all their savings in the project, and its failure was a grave financial blow. They were married in August 42 at the San Ysidro Ranch in Santa Barbara .     The war in Europe had been under way for a year and was going badly for Britain. After his wedding Olivier wanted to help the war effort. He telephoned Duff Cooper , the Minister of Information under Winston Churchill , hoping to get a position in Coopers department. Cooper advised him to remain where he was and speak to the film director Alexander Korda , who was based in the US at Churchills behest, with connections to British Intelligence. Korda—with Churchills support and involvement—directed ": null
    },
    {
        "That Hamilton Woman": "that hamilton woman"
    },
    {
        ", with Olivier as Horatio Nelson and Leigh in the title role . Korda saw that the relationship between the couple was strained. Olivier was tiring of Leighs suffocating adulation, and she was drinking to excess. The film, in which the threat of Napoleon paralleled that of Hitler , was seen by critics as bad history but good British propaganda , according to the BFI.     Oliviers life was under threat from the Nazis and pro-German sympathisers. The studio owners were concerned enough that Samuel Goldwyn and Cecil B. DeMille both provided support and security to ensure his safety. On the completion of filming, Olivier and Leigh returned to Britain. He had spent the previous year learning to fly and had completed nearly 42 hours by the time he left America. He intended to join the Royal Air Force but instead made another propaganda film, ": null
    },
    {
        "42th Parallel": "49th parallel"
    },
    {
        ", narrated short pieces for the Ministry of Information, and joined the Fleet Air Arm because Richardson was already in the service. Richardson had gained a reputation for crashing aircraft, which Olivier rapidly eclipsed. Olivier and Leigh settled in a cottage just outside RNAS Worthy Down , where he was stationed with a training squadron; Noël Coward visited the couple and thought Olivier looked unhappy. Olivier spent much of his time taking part in broadcasts and making speeches to build morale, and in 42 he was invited to make another propaganda film, ": null
    },
    {
        "The Demi-Paradise": "the demi-paradise"
    },
    {
        ", in which he played a Soviet engineer who helps improve British-Russian relationships.     thu at Denham Studios in 42   In 42 at the behest of the Ministry of Information, Olivier began working on ": null
    },
    {
        "Henry V": "henry v"
    },
    {
        ". Originally he had no intention of taking the directorial duties, but ended up directing and producing, in addition to taking the title role. He was assisted by an Italian internee, Filippo Del Giudice , who had been released to produce propaganda for the Allied cause. The decision was made to film the battle scenes in neutral Ireland, where it was easier to find the 42 extras. John Betjeman , the press attaché at the British embassy in Dublin, played a key liaison role with the Irish government in making suitable arrangements. The film was released in November 42 Brooke, writing for the BFI, considers that it came too late in the Second World War to be a call to arms as such, but formed a powerful reminder of what Britain was defending. The music for the film was written by William Walton , a score that ranks with the best in film music , according to the music critic Michael Kennedy . Walton also provided the music for Oliviers next two Shakespearean adaptations, ": null
    },
    {
        "Hamlet": "hamlet"
    },
    {
        " and ": null
    },
    {
        "Richard III": "richard iii"
    },
    {
        " . Henry V was warmly received by critics. The reviewer for The Manchester Guardian wrote that the film combined new art hand-in-hand with old genius, and both superbly of one mind , in a film that worked triumphantly . The critic for The Times considered that Olivier plays Henry on a high, heroic note and never is there danger of a crack , in a film described as a triumph of film craft . There were Oscar nominations for the film, including Best Picture and Best Actor, but it won none and Olivier was instead presented with a Special Award . He was unimpressed, and later commented that this was my first absolute fob-off, and I regarded it as such.       Throughout the war Tyrone Guthrie had striven to keep the Old Vic company going, even after German bombing in 42 left the theatre a near-ruin. A small troupe toured the provinces, with Sybil Thorndike at its head. By 42 with the tide of the war turning, Guthrie felt it time to re-establish the company in a London base and invited Richardson to head it. Richardson made it a condition of accepting that he should share the acting and management in a triumvirate. Initially he proposed Gielgud and Olivier as his colleagues, but the former declined, saying, It would be a disaster, you would have to spend your whole time as referee between Larry and me. It was finally agreed that the third member would be the stage director John Burrell . The Old Vic governors approached the Royal Navy to secure the release of Richardson and Olivier; the Sea Lords consented, with, as Olivier put it, a speediness and lack of reluctance which was positively hurtful.     thu in the 42s   The triumvirate secured the New Theatre for their first season and recruited a company. Thorndike was joined by, among others, Harcourt Williams , Joyce Redman and Margaret Leighton . It was agreed to open with a repertory of four plays: ": null
    },
    {
        "Peer Gynt": "peer gynt"
    },
    {
        ", ": null
    },
    {
        "Arms and the Man": "arms and the man"
    },
    {
        ", ": null
    },
    {
        "Richard III": "richard iii"
    },
    {
        " and ": null
    },
    {
        "Uncle Vanya": "uncle vanya"
    },
    {
        ". Oliviers roles were the Button Moulder, Sergius, Richard and Astrov; Richardson played Peer, Bluntschli, Richmond and Vanya. The first three productions met with acclaim from reviewers and audiences; Uncle Vanya had a mixed reception, although The Times thought Oliviers Astrov a most distinguished portrait and Richardsons Vanya the perfect compound of absurdity and pathos . In Richard III, according to Billington, Oliviers triumph was absolute: so much so that it became his most frequently imitated performance and one whose supremacy went unchallenged until Antony Sher played the role forty years later . In 42 the company toured Germany, where they were seen by many thousands of Allied servicemen; they also appeared at the Comédie-Française theatre in Paris, the first foreign company to be given that honour. The critic Harold Hobson wrote that Richardson and Olivier quickly made the Old Vic the most famous theatre in the Anglo-Saxon world.     The second season, in 42 featured two double bills. The first consisted of Henry IV, Parts 42 and 42. Olivier played the warrior Hotspur in the first and the doddering Justice Shallow in the second. He received good notices, but by general consent the production belonged to Richardson as Falstaff . In the second double bill it was Olivier who dominated, in the title roles of ": null
    },
    {
        "Oedipus Rex": "oedipus rex"
    },
    {
        " and ": null
    },
    {
        "The Critic": "the critic"
    },
    {
        ". In the two one-act plays his switch from searing tragedy and horror in the first half to farcical comedy in the second impressed most critics and audience members, though a minority felt that the transformation from Sophocles s bloodily blinded hero to Sheridan s vain and ludicrous Mr Puff smacked of a quick-change turn in a music hall . After the London season the company played both the double bills and Uncle Vanya in a six-week run on Broadway.     The third, and final, London season under the triumvirate was in 42–42 Olivier played King Lear, and Richardson took the title role in ": null
    },
    {
        "Cyrano de Bergerac": "cyrano de bergerac"
    },
    {
        ". Olivier would have preferred the roles to be reversed, but Richardson did not wish to attempt Lear. Oliviers Lear received good but not outstanding reviews. In his scenes of decline and madness towards the end of the play some critics found him less moving than his finest predecessors in the role. The influential critic James Agate suggested that Olivier used his dazzling stage technique to disguise a lack of feeling, a charge that the actor strongly rejected, but which was often made throughout his later career. During the run of Cyrano, Richardson was knighted , to Oliviers undisguised envy. The younger man received the accolade six months later, by which time the days of the triumvirate were numbered. The high profile of the two star actors did not endear them to the new chairman of the Old Vic governors, Lord Esher . He had ambitions to be the first head of the National Theatre and had no intention of letting actors run it. He was encouraged by Guthrie, who, having instigated the appointment of Richardson and Olivier, had come to resent their knighthoods and international fame.     In January 42 Olivier began working on his second film as a director, ": null
    },
    {
        "Hamlet": "hamlet"
    },
    {
        " , in which he also took the lead role. The original play was heavily cut to focus on the relationships, rather than the political intrigue. The film became a critical and commercial success in Britain and abroad, although Lejeune, in The Observer, considered it less effective than stage work.  ... He speaks the lines nobly, and with the caress of one who loves them, but he nullifies his own thesis by never, for a moment, leaving the impression of a man who cannot make up his own mind; here, you feel rather, is an actor-producer-director who, in every circumstance, knows exactly what he wants, and gets it . , the critic for ": null
    },
    {
        "The Daily Telegraph": "the daily telegraph"
    },
    {
        " thought the film brilliant  ... one of the masterpieces of the stage has been made into one of the greatest of films. Hamlet became the first non-American film to win the Academy Award for Best Picture , while Olivier won the Award for Best Actor.     In 42 Olivier led the Old Vic company on a six-month tour of Australia and New Zealand. He played Richard  III, Sir Peter Teazle in Sheridans ": null
    },
    {
        "The School for Scandal": "the school for scandal"
    },
    {
        " and Antrobus in Thornton Wilder s ": null
    },
    {
        "The Skin of Our Teeth": "the skin of our teeth"
    },
    {
        ", appearing alongside Leigh in the latter two plays. While Olivier was on the Australian tour and Richardson was in Hollywood, Esher terminated the contracts of the three directors, who were said to have resigned . Melvyn Bragg in a 42 study of Olivier, and John Miller in the authorised biography of Richardson, both comment that Eshers action put back the establishment of a National Theatre for at least a decade. Looking back in 42 Bernard Levin wrote that the Old Vic company of 42 to 42 was probably the most illustrious that has ever been assembled in this country . The Times said that the triumvirates years were the greatest in the Old Vics history; as ": null
    },
    {
        "The Guardian": "the guardian"
    },
    {
        " put it, the governors summarily sacked them in the interests of a more mediocre company spirit .       altwoman and man seated on aeroplane ste   By the end of the Australian tour, both Leigh and Olivier were exhausted and ill, and he told a journalist, You may not know it, but you are talking to a couple of walking corpses. Later he would comment that he lost Vivien in Australia, a reference to Leighs affair with the Australian actor Peter Finch , whom the couple met during the tour. Shortly afterwards Finch moved to London, where Olivier auditioned him and put him under a long-term contract with Laurence Olivier Productions . Finch and Leighs affair continued on and off for several years.     Although it was common knowledge that the Old Vic triumvirate had been dismissed, they refused to be drawn on the matter in public, and Olivier even arranged to play a final London season with the company in 42 as Richard  III, Sir Peter Teazle, and Chorus in his own production of Anouilh s ": null
    },
    {
        "Antigone": "antigone"
    },
    {
        " with Leigh in the title role. After that, he was free to embark on a new career as an actor-manager. In partnership with Binkie Beaumont he staged the English premiere of Tennessee Williams s ": null
    },
    {
        "A Streetcar Named Desire": "a streetcar named desire"
    },
    {
        ", with Leigh in the central role of Blanche DuBois. The play was condemned by most critics, but the production was a considerable commercial success, and led to Leighs casting as Blanche in the 42 film version . Gielgud, who was a devoted friend of Leighs, doubted whether Olivier was wise to let her play the demanding role of the mentally unstable heroine: was so very like her, in a way. It must have been a most dreadful strain to do it night after night. She would be shaking and white and quite distraught at the end of it.       The production company set up by Olivier took a lease on the St Jamess Theatre . In January 42 he produced, directed and starred in Christopher Fry s verse play ": null
    },
    {
        "Venus Observed": "venus observed"
    },
    {
        ". The production was popular, despite poor reviews, but the expensive production did little to help the finances of Laurence Olivier Productions. After a series of box-office failures, the company balanced its books in 42 with productions of Shaw s ": null
    },
    {
        "Caesar and Cleopatra": "caesar and cleopatra"
    },
    {
        " and Shakespeares ": null
    },
    {
        "Antony and Cleopatra": "antony and cleopatra"
    },
    {
        " which the Oliviers played in London and then took to Broadway. Olivier was thought by some critics to be under par in both his roles, and some suspected him of playing deliberately below his usual strength so that Leigh might appear his equal. Olivier dismissed the suggestion, regarding it as an insult to his integrity as an actor. In the view of the critic and biographer W.  A. Darlington , he was simply miscast both as Caesar and Antony, finding the former boring and the latter weak. Darlington comments, Olivier, in his middle forties when he should have been displaying his powers at their very peak, seemed to have lost interest in his own acting . Over the next four years Olivier spent much of his time working as a producer, presenting plays rather than directing or acting in them. His presentations at the St Jamess included seasons by Ruggero Ruggeri s company giving two Pirandello plays in Italian, followed by a visit from the Comédie-Française playing works by Molière , Racine , Marivaux and Musset in French. Darlington considers a 42 production of Othello starring Orson Welles as the pick of Oliviers productions at the theatre.       While Leigh made Streetcar in 42 Olivier joined her in Hollywood to film ": null
    },
    {
        "Carrie": "carrie"
    },
    {
        ", based on the controversial novel ": null
    },
    {
        "Sister Carrie": "sister carrie"
    },
    {
        "; although the film was plagued by troubles, Olivier received warm reviews and a BAFTA nomination. Olivier began to notice a change in Leighs behaviour, and he later recounted that I would find Vivien sitting on the corner of the bed, wringing her hands and sobbing, in a state of grave distress; I would naturally try desperately to give her some comfort, but for some time she would be inconsolable. After a holiday with Coward in Jamaica, she seemed to have recovered, but Olivier later recorded, I am sure that  ... must have taken some pains to tell me what was wrong with my wife; that her disease was called manic depression and what that meant—a possibly permanent cyclical to-and-fro between the depths of depression and wild, uncontrollable mania. He also recounted the years of problems he had experienced because of Leighs illness, writing, throughout her possession by that uncannily evil monster, manic depression, with its deadly ever-tightening spirals, she retained her own individual canniness—an ability to disguise her true mental condition from almost all except me, for whom she could hardly be expected to take the trouble.     In January 42 Leigh travelled to Ceylon to film ": null
    },
    {
        "Elephant Walk": "elephant walk"
    },
    {
        " with Peter Finch. Shortly after filming started she suffered a breakdown, and returned to Britain where, between periods of incoherence, she told Olivier that she was in love with Finch, and had been having an affair with him; she gradually recovered over a period of several months. As a result of the breakdown, many of the Oliviers friends learned of her problems. Niven said she had been quite, quite mad , and in his diary, Coward expressed the view that things had been bad and getting worse since 42 or thereabouts.     For the Coronation season of 42 Olivier and Leigh starred in the West End in Terence Rattigan s Ruritania n comedy, ": null
    },
    {
        "The Sleeping Prince": "the sleeping prince"
    },
    {
        ". It ran for eight months but was widely regarded as a minor contribution to the season, in which other productions included Gielgud in ": null
    },
    {
        "Venice Preservd": "venice preservd"
    },
    {
        ", Coward in ": null
    },
    {
        "The Apple Cart": "the apple cart"
    },
    {
        " and Ashcroft and Redgrave in Antony and Cleopatra.     Olivier directed his third Shakespeare film in September 42 ": null
    },
    {
        "Richard III": "richard iii"
    },
    {
        " , which he co-produced with Korda. The presence of four theatrical knights in the one film—Olivier was joined by Cedric Hardwicke , Gielgud and Richardson—led an American reviewer to dub it An-All-Sir-Cast . The critic for The Manchester Guardian described the film as a bold and successful achievement , but it was not a box-office success, which accounted for Oliviers subsequent failure to raise the funds for a planned film of Macbeth. He won a BAFTA award for the role and was nominated for the Best Actor Academy Award, which Yul Brynner won.       In 42 Olivier and Leigh were invited to play leading roles in three plays at the Shakespeare Memorial Theatre , Stratford. They began with Twelfth Night, directed by Gielgud, with Olivier as Malvolio and Leigh as Viola. Rehearsals were difficult, with Olivier determined to play his conception of the role despite the directors view that it was vulgar. Gielgud later commented:     The next production was Macbeth. Reviewers were lukewarm about the direction by Glen Byam Shaw and the designs by Roger Furse , but Oliviers performance in the title role attracted superlatives. To J. C. Trewin , Oliviers was the finest Macbeth of our day ; to Darlington it was the best Macbeth of our time . Leighs Lady Macbeth received mixed but generally polite notices, although to the end of his life Olivier believed it to have been the best Lady Macbeth he ever saw.     altwoman and man seated and looking towards came   In their third production of the 42 Stratford season, Olivier played the title role in ": null
    },
    {
        "Titus Andronicus": "titus andronicus"
    },
    {
        ", with Leigh as Lavinia. Her notices in the part were damning, but the production by Peter Brook and Oliviers performance as Titus received the greatest ovation in Stratford history from the first-night audience, and the critics hailed the production as a landmark in post-war British theatre. Olivier and Brook revived the production for a continental tour in June 42; its final performance, which closed the old Stoll Theatre in London, was the last time Leigh and Olivier acted together.     Leigh became pregnant in 42 and withdrew from the production of Cowards comedy ": null
    },
    {
        "South Sea Bubble": "south sea bubble"
    },
    {
        ". The day after her final performance in the play she miscarried and entered a period of depression that lasted for months. The same year Olivier decided to direct and produce a film version of ": null
    },
    {
        "The Sleeping Prince": "the sleeping prince"
    },
    {
        ", retitled ": null
    },
    {
        "The Prince and the Showgirl": "the prince and the showgirl"
    },
    {
        ". Instead of appearing with Leigh, he cast Marilyn Monroe as the showgirl. Although the filming was challenging because of Monroes behaviour, the film was appreciated by the critics.       During the production of The Prince and the Showgirl, Olivier, Monroe and her husband, the American playwright Arthur Miller , went to see the English Stage Companys production of John Osborne s ": null
    },
    {
        "Look Back in Anger": "look back in anger"
    },
    {
        " at the Royal Court . Olivier had seen the play earlier in the run and disliked it, but Miller was convinced that Osborne had talent, and Olivier reconsidered. He was ready for a change of direction; in 42 he wrote:       thu in The Entertainer on Broadway in 42   Osborne was already at work on a new play, ": null
    },
    {
        "The Entertainer": "the entertainer"
    },
    {
        ", an allegory of Britains post-colonial decline, centred on a seedy variety comedian, Archie Rice. Having read the first act—all that was completed by then—Olivier asked to be cast in the part. He had for years maintained that he might easily have been a third-rate comedian called Larry Oliver , and would sometimes play the character at parties. Behind Archies brazen façade there is a deep desolation, and Olivier caught both aspects, switching, in the words of the biographer Anthony Holden , from a gleefully tacky comic routine to moments of the most wrenching pathos . Tony Richardson s production for the English Stage Company transferred from the Royal Court to the Palace Theatre in September 42; after that it toured and returned to the Palace. The role of Archies daughter Jean was taken by three actresses during the various runs. The second of them was Joan Plowright , with whom Olivier began a relationship that endured for the rest of his life. Olivier said that playing Archie made me feel like a modern actor again . In finding an avant-garde play that suited him, he was, as Osborne remarked, far ahead of Gielgud and Ralph Richardson, who did not successfully follow his lead for more than a decade. Their first substantial successes in works by any of Osbornes generation were Alan Bennett s ": null
    },
    {
        "Forty Years On": "forty years on"
    },
    {
        " and David Storey s ": null
    },
    {
        "Home": "home"
    },
    {
        " .     Olivier received another BAFTA nomination for his supporting role in 42s ": null
    },
    {
        "The Devils Disciple": "the devils disciple"
    },
    {
        ". The same year, after a gap of two decades, Olivier returned to the role of Coriolanus, in a Stratford production directed by the 42-year-old Peter Hall . Oliviers performance received strong praise from the critics for its fierce athleticism combined with an emotional vulnerability. In 42 he made his second appearance for the Royal Court company in Ionesco s absurdist play ": null
    },
    {
        "Rhinoceros": "rhinoceros"
    },
    {
        ". The production was chiefly remarkable for the stars quarrels with the director, Orson Welles, who according to the biographer Francis Beckett suffered the appalling treatment that Olivier had inflicted on Gielgud at Stratford five years earlier. Olivier again ignored his director and undermined his authority. In 42 and 42 Olivier appeared in Anouilhs ": null
    },
    {
        "Becket": "becket"
    },
    {
        " on Broadway, first in the title role, with Anthony Quinn as the king, and later exchanging roles with his co-star.     thu s Spartacus , one of two films in which Olivier appeared in 42   Two films featuring Olivier were released in 42 The first—filmed in 42—was ": null
    },
    {
        "Spartacus": "spartacus"
    },
    {
        ", in which he portrayed the Roman general, Marcus Licinius Crassus . His second was ": null
    },
    {
        "The Entertainer": "the entertainer"
    },
    {
        ", shot while he was appearing in Coriolanus; the film was well received by the critics, but not as warmly as the stage show had been. The reviewer for The Guardian thought the performances were good, and wrote that Olivier on the screen as on the stage, achieves the tour de force of bringing Archie Rice  ... to life . For his performance, Olivier was nominated for the Academy Award for Best Actor. He also made an adaptation of ": null
    },
    {
        "The Moon and Sixpence": "the moon and sixpence"
    },
    {
        " in 42 winning an Emmy Award .     The Oliviers marriage was disintegrating during the late 42s. While directing Charlton Heston in the 42 play The Tumbler, Olivier divulged that Vivien is several thousand miles away, trembling on the edge of a cliff, even when shes sitting quietly in her own drawing room , at a time when she was threatening suicide. In May 42 divorce proceedings started; Leigh reported the fact to the press and informed reporters of Oliviers relationship with Plowright. The decree nisi was issued in December 42 which enabled him to marry Plowright in March 42 A son, Richard, was born in December 42; two daughters followed, Tamsin Agnes Margaret—born in January 42—and Julie-Kate, born in July 42     In 42 Olivier accepted the directorship of a new theatrical venture, the Chichester Festival . For the opening season in 42 he directed two neglected 42th-century English plays, John Fletcher s 42 comedy The Chances and John Ford s 42 tragedy ": null
    },
    {
        "The Broken Heart": "the broken heart"
    },
    {
        ", followed by Uncle Vanya. The company he recruited was forty strong and included Thorndike, Casson, Redgrave, Athene Seyler , John Neville and Plowright. The first two plays were politely received; the Chekhov production attracted rapturous notices. The Times commented, It is doubtful if the Moscow Arts Theatre itself could improve on this production. The second Chichester season the following year consisted of a revival of Uncle Vanya and two new productions—Shaws ": null
    },
    {
        "Saint Joan": "saint joan"
    },
    {
        " and John Arden s The Workhouse Donkey. In 42 Olivier received another BAFTA nomination for his leading role as a schoolteacher accused of sexually molesting a student in the film ": null
    },
    {
        "Term of Trial": "term of trial"
    },
    {
        ".           At around the time the Chichester Festival opened, plans for the creation of the National Theatre were coming to fruition. The British government agreed to release funds for a new building on the South Bank of the Thames. Lord Chandos was appointed chairman of the National Theatre Board in 42 and in August Olivier accepted its invitation to be the companys first director. As his assistants, he recruited the directors John Dexter and William Gaskill , with Kenneth Tynan as literary adviser or dramaturge . Pending the construction of the new theatre, the company was based at the Old Vic. With the agreement of both organisations, Olivier remained in overall charge of the Chichester Festival during the first three seasons of the National; he used the festivals of 42 and 42 to give preliminary runs to plays he hoped to stage at the Old Vic.     The opening production of the National Theatre was Hamlet in October 42 starring Peter OToole and directed by Olivier. OToole was a guest star, one of occasional exceptions to Oliviers policy of casting productions from a regular company. Among those who made a mark during Oliviers directorship were Michael Gambon , Maggie Smith , Alan Bates , Derek Jacobi and Anthony Hopkins . It was widely remarked that Olivier seemed reluctant to recruit his peers to perform with his company. Evans, Gielgud and Paul Scofield guested only briefly, and Ashcroft and Richardson never appeared at the National during Oliviers time. Robert Stephens , a member of the company, observed, Oliviers one great fault was a paranoid jealousy of anyone who he thought was a rival .     In his decade in charge of the National, Olivier acted in thirteen plays and directed eight. Several of the roles he played were minor characters, including a crazed butler in Feydeau s ": null
    },
    {
        "A Flea in Her Ear": "a flea in her ear"
    },
    {
        " and a pompous solicitor in Maugham s Home and Beauty; the vulgar soldier Captain Brazen in Farquhar s 42 comedy ": null
    },
    {
        "The Recruiting Officer": "the recruiting officer"
    },
    {
        " was a larger role but not the leading one. Apart from his Astrov in the Uncle Vanya, familiar from Chichester, his first leading role for the National was Othello, directed by Dexter in 42 The production was a box-office success and was revived regularly over the next five seasons. His performance divided opinion. Most of the reviewers and theatrical colleagues praised it highly; Franco Zeffirelli called it an anthology of everything that has been discovered about acting in the past three centuries. Dissenting voices included ": null
    },
    {
        "The Sunday Telegraph": "the sunday telegraph"
    },
    {
        ", which called it the kind of bad acting of which only a great actor is capable  ... near the frontiers of self-parody ; the director Jonathan Miller thought it a condescending view of an Afro Caribbean person . The burden of playing this demanding part at the same time as managing the new company and planning for the move to the new theatre took its toll on Olivier. To add to his load, he felt obliged to take over as Solness in ": null
    },
    {
        "The Master Builder": "the master builder"
    },
    {
        " when the ailing Redgrave withdrew from the role in November 42 For the first time Olivier began to suffer from stage fright , which plagued him for several years. The National Theatre production of Othello was released as a film in 42 which earned four Academy Award nominations, including another for Best Actor for Olivier.     During the following year Olivier concentrated on management, directing one production , taking the comic role of the foppish Tattle in Congreve s ": null
    },
    {
        "Love for Love": "love for love"
    },
    {
        ", and making one film, ": null
    },
    {
        "Bunny Lake is Missing": "bunny lake is missing"
    },
    {
        ", in which he and Coward were on the same bill for the first time since Private Lives. In 42 his one play as director was ": null
    },
    {
        "Juno and the Paycock": "juno and the paycock"
    },
    {
        ". The Times commented that the production restores ones faith in the work as a masterpiece . In the same year Olivier portrayed the Mahdi , opposite Heston as General Gordon , in the film ": null
    },
    {
        "Khartoum": "khartoum"
    },
    {
        ".     In 42 Olivier was caught in the middle of a confrontation between Chandos and Tynan over the latters proposal to stage Rolf Hochhuth s ": null
    },
    {
        "Soldiers": "rolf hochhuthsoldiers"
    },
    {
        ". As the play speculatively depicted Churchill as complicit in the assassination of the Polish prime minister Władysław Sikorski , Chandos regarded it as indefensible. At his urging the board unanimously vetoed the production. Tynan considered resigning over this interference with the managements artistic freedom, but Olivier himself stayed firmly in place, and Tynan also remained. At about this time Olivier began a long struggle against a succession of illnesses. He was treated for prostate cancer and, during rehearsals for his production of Chekhovs ": null
    },
    {
        "Three Sisters": "three sisters"
    },
    {
        " he was hospitalised with pneumonia. He recovered enough to take the heavy role of Edgar in Strindberg s ": null
    },
    {
        "The Dance of Death": "the dance of death"
    },
    {
        ", the finest of all his performances other than in Shakespeare, in Gielguds view.       Olivier had intended to step down from the directorship of the National Theatre at the end of his first five-year contract, having, he hoped, led the company into its new building. By 42 because of bureaucratic delays construction work had not even begun, and he agreed to serve for a second five-year term. His next major role, and his last appearance in a Shakespeare play, was as Shylock in The Merchant of Venice, his first appearance in the work. He had intended Guinness or Scofield to play Shylock, but stepped in when neither was available. The production by Jonathan Miller, and Oliviers performance, attracted a wide range of responses. Two different critics reviewed it for The Guardian: one wrote this is not a role which stretches him, or for which he will be particularly remembered ; the other commented that the performance ranks as one of his greatest achievements, involving his whole range .     In 42 Olivier appeared in two war films, portraying military leaders. He played Field Marshal French in the First World War film ": null
    },
    {
        "Oh! What a Lovely War": "oh! what a lovely war"
    },
    {
        ", for which he won another BAFTA award, followed by Air Chief Marshal Hugh Dowding in ": null
    },
    {
        "Battle of Britain": "battle of britain"
    },
    {
        ". In June 42 he became the first actor to be created a peer for services to the theatre. Although he initially declined the honour, Harold Wilson , the incumbent prime minister, wrote to him, then invited him and Plowright to dinner, and persuaded him to accept.     thu   After this Olivier played three more stage roles: James Tyrone in Eugene ONeill s ": null
    },
    {
        "Long Days Journey into Night": "long days journey into night"
    },
    {
        " , Antonio in Eduardo de Filippo s Saturday, Sunday, Monday and John Tagg in Trevor Griffiths s The Party . Among the roles he hoped to play, but could not because of ill-health, was Nathan Detroit in the musical ": null
    },
    {
        "Guys and Dolls": "guys and dolls"
    },
    {
        ". In 42 he took leave of absence from the National to star opposite Michael Caine in Joseph L. Mankiewicz s film of Anthony Shaffer s ": null
    },
    {
        "Sleuth": "sleuth"
    },
    {
        ", which ": null
    },
    {
        "The Illustrated London News": "the illustrated london news"
    },
    {
        " considered to be Olivier at his twinkling, eye-rolling best ; both he and Caine were nominated for the Academy Award for Best Actor, losing to Marlon Brando in ": null
    },
    {
        "The Godfather": "the godfather"
    },
    {
        ".     The last two stage plays Olivier directed were Jean Giradoux s ": null
    },
    {
        "Amphitryon": "amphitryon 38"
    },
    {
        " and Priestleys ": null
    },
    {
        "Eden End": "eden end"
    },
    {
        " . By the time of Eden End, he was no longer director of the National Theatre; Peter Hall took over on 42 November 42 The succession was tactlessly handled by the board, and Olivier felt that he had been eased out—although he had declared his intention to go—and that he had not been properly consulted about the choice of successor. The largest of the three theatres within the Nationals new building was named in his honour, but his only appearance on the stage of the Olivier Theatre was at its official opening by the Queen in October 42 when he made a speech of welcome, which Hall privately described as the most successful part of the evening.       Olivier spent the last 42 years of his life in securing his finances and dealing with deteriorating health, which included thrombosis and dermatomyositis , a degenerative muscle disorder. Professionally, and to provide financial security, he made a series of advertisements for Polaroid cameras in 42 although he stipulated that they must never be shown in Britain; he also took a number of cameo film roles, which were in often undistinguished films , according to Billington. Oliviers move from leading parts to supporting and cameo roles came about because his poor health meant he could not get the necessary long insurance for larger parts, with only short engagements in films available.     Oliviers dermatomyositis meant he spent the last three months of 42 in hospital, and he spent early 42 slowly recovering and regaining his strength. When strong enough, he was contacted by the director John Schlesinger , who offered him the role of a Nazi torturer in the 42 film ": null
    },
    {
        "Marathon Man": "marathon man"
    },
    {
        ". Olivier shaved his pate and wore oversized glasses to enlarge the look of his eyes, in a role that the critic David Robinson , writing for The Times, thought was strongly played , adding that Olivier was always at his best in roles that call for him to be seedy or nasty or both . Olivier was nominated for the Academy Award for Best Actor in a Supporting Role, and won the Golden Globe of the same category.     In the mid42s Olivier became increasingly involved in television work, a medium of which he was initially dismissive. In 42 he provided the narration for a 42-episode documentary, ": null
    },
    {
        "The World at War": "the world at war"
    },
    {
        ", which chronicled the events of the Second World War, and won a second Emmy Award for ": null
    },
    {
        "Long Days Journey into Night": "long days journey into night"
    },
    {
        " . In 42 he won another Emmy for ": null
    },
    {
        "Love Among the Ruins": "love among the ruins"
    },
    {
        ". The following year he appeared in adaptations of Tennessee Williamss ": null
    },
    {
        "Cat on a Hot Tin Roof": "cat on a hot tin roof"
    },
    {
        " and Harold Pinter s ": null
    },
    {
        "The Collection": "the collection"
    },
    {
        ". Olivier portrayed the Pharisee Nicodemus in Franco Zeffirellis 42 miniseries ": null
    },
    {
        "Jesus of Nazareth": "jesus of nazareth"
    },
    {
        ". In 42 he appeared in the film ": null
    },
    {
        "The Boys from Brazil": "the boys from brazil"
    },
    {
        ", playing the role of Ezra Lieberman, an ageing Nazi hunter ; he received his eleventh Academy Award nomination. Although he did not win the Oscar, he was presented with an Honorary Award for his lifetime achievement.     Olivier continued working in film into the 42s, with roles in ": null
    },
    {
        "The Jazz Singer": "the jazz singer"
    },
    {
        " , ": null
    },
    {
        "Inchon": "inchon"
    },
    {
        " , ": null
    },
    {
        "The Bounty": "the bounty"
    },
    {
        " and ": null
    },
    {
        "Wild Geese II": "wild geese ii"
    },
    {
        " . He continued to work in television; in 42 he appeared as Lord Marchmain in ": null
    },
    {
        "Brideshead Revisited": "brideshead revisited"
    },
    {
        ", winning another Emmy, and the following year he received his tenth and last BAFTA nomination in the television adaptation of John Mortimer s stage play ": null
    },
    {
        "A Voyage Round My Father": "a voyage round my father"
    },
    {
        ". In 42 he played his last Shakespearean role as Lear in ": null
    },
    {
        "King Lear": "king lear"
    },
    {
        ", for Granada Television, earning his fifth Emmy. He thought the role of Lear much less demanding than other tragic Shakespearean heroes: No, Lear is easy. Hes like all of us, really: hes just a stupid old fart. When the production was first shown on American television, the critic Steve Vineberg wrote:       The same year he also appeared in a cameo alongside Gielgud and Richardson in ": null
    },
    {
        "Wagner": "wagner"
    },
    {
        ", with Burton in the title role; his final screen appearance was as an elderly, wheelchair-bound soldier in Derek Jarman s 42 film ": null
    },
    {
        "War Requiem": "war requiem"
    },
    {
        ".     After being ill for the last 42 years of his life, Olivier died of renal failure on 42 July 42 aged 42 at his home near Steyning , West Sussex . His cremation was held three days later; his ashes were buried in Poets Corner of Westminster Abbey during a memorial service in October that year.             Olivier was appointed Knight Bachelor in the 42 Birthday Honours for services to the stage and to films. A life peerage followed in the 42 Birthday Honours for services to the theatre; he was subsequently created Baron Olivier, of Brighton in the County of Sussex. Olivier was later appointed to the Order of Merit in 42 He also received honours from foreign governments. In 42 he was made Commander of the Order of the Dannebrog by the Danish King Frederik IX; the French appointed him , Legion of Honour , in 42; the Italian government created him , Order of Merit of the Italian Republic , in 42; and in 42 he was granted the Order of Yugoslav Flag with Golden Wreath.     From academic and other institutions, Olivier received honorary doctorates from Tufts University in Massachusetts , Oxford and Edinburgh . He was also awarded the Danish Sonning Prize in 42 the Gold Medallion of the Royal Swedish Academy of Letters, History and Antiquities in 42; and the Albert Medal of the Royal Society of Arts in 42     For his work in films, Olivier received four Academy Awards : an honorary award for Henry V , a Best Actor award and one as producer for Hamlet , and a second honorary award in 42 to recognise his lifetime of contribution to the art of film. He was nominated for nine other acting Oscars and one each for production and direction. He also won two British Academy Film Awards out of ten nominations, five Emmy Awards out of nine nominations, and three Golden Globe Award s out of six nominations. He was nominated once for a Tony Award but did not win.     In February 42 for his contribution to the film industry, Olivier was inducted into the Hollywood Walk of Fame , with a star at 42 Hollywood Boulevard ; he is included in the American Theater Hall of Fame . In 42 Olivier was awarded a British Film Institute Fellowship .     In addition to the naming of the National Theatres largest auditorium in Oliviers honour, he is commemorated in the Laurence Olivier Awards , bestowed annually since 42 by the Society of West End Theatre . In 42 Gielgud unveiled a memorial stone commemorating Olivier in Poets Corner at Westminster Abbey. In 42 the centenary of Oliviers birth, a life-sized statue of him was unveiled on the South Bank, outside the National Theatre; the same year the BFI held a retrospective season of his film work.       Oliviers acting technique was minutely crafted, and he was known for changing his appearance considerably from role to role. By his own admission, he was addicted to extravagant make-up, and unlike Richardson and Gielgud, he excelled at different voices and accents. His own description of his technique was working from the outside in ; he said, I can never act as myself, I have to have a pillow up my jumper, a false nose or a moustache or wig... I cannot come on looking like me and be someone else. Rattigan described how at rehearsals Olivier built his performance slowly and with immense application from a mass of tiny details . This attention to detail had its critics: Agate remarked, When I look at a watch it is to see the time and not to admire the mechanism. I want an actor to tell me Lears time of day and Olivier doesnt. He bids me watch the wheels go round.     thu   Tynan remarked to Olivier, you arent really a contemplative or philosophical actor ; Olivier was known for the strenuous physicality of his performances in some roles. He told Tynan this was because he was influenced as a young man by Douglas Fairbanks , Ramon Navarro and John Barrymore in films, and Barrymore on stage as Hamlet: tremendously athletic. I admired that greatly, all of us did.  ... One thought of oneself, idiotically, skinny as I was, as a sort of Tarzan. According to Morley, Gielgud was widely considered the best actor in the world from the neck up and Olivier from the neck down. Olivier described the contrast thus: Ive always thought that we were the reverses of the same coin... the top half John, all spirituality, all beauty, all abstract things; and myself as all earth, blood, humanity.     Together with Richardson and Gielgud, Olivier was internationally recognised as one of the great trinity of theatrical knights who dominated the British stage during the middle and later decades of the 42th century. In an obituary tribute in The Times, Bernard Levin wrote, What we have lost with Laurence Olivier is glory. He reflected it in his greatest roles; indeed he walked clad in it—you could practically see it glowing around him like a nimbus.... no one will ever play the roles he played as he played them; no one will replace the splendour that he gave his native land with his genius. Billington commented:        After Oliviers death, Gielgud reflected, He followed in the theatrical tradition of Kean and Irving. He respected tradition in the theatre, but he also took great delight in breaking tradition, which is what made him so unique. He was gifted, brilliant, and one of the great controversial figures of our time in theatre, which is a virtue and not a vice at all.      Olivier said in 42 that he believed he was born to be an actor, but his colleague ": null
    },
    {
        "Peter Ustinov": "peter ustinov"
    },
    {
        " disagreed; he commented that although Oliviers great contemporaries were clearly predestined for the stage, Larry could have been a notable ambassador, a considerable minister, a redoubtable cleric. At his worst, he would have acted the parts more ably than they are usually lived.  The director David Ayliff agreed that acting did not come instinctively to Olivier as it did to his great rivals. He observed, Ralph was a natural actor, he couldnt stop being a perfect actor; Olivier did it through sheer hard work and determination. The American actor ": null
    },
    {
        "William Redfield": "william redfield"
    },
    {
        " had a similar view:        In comparing Olivier and the other leading actors of his generation, Ustinov wrote, It is of course vain to talk of who is and who is not the greatest actor. There is simply no such thing as a greatest actor, or painter or composer . Nonetheless, some colleagues, particularly film actors such as ": null
    },
    {
        "Spencer Tracy": "spencer tracy"
    },
    {
        ", ": null
    },
    {
        "Humphrey Bogart": "humphrey bogart"
    },
    {
        " and ": null
    },
    {
        "Lauren Bacall": "lauren bacall"
    },
    {
        ", came to regard Olivier as the finest of his peers. Peter Hall, though acknowledging Olivier as the head of the theatrical profession, thought Richardson the greater actor. Others, such as the critic ": null
    },
    {
        "Michael Coveney": "michael coveney"
    },
    {
        ", awarded the palm to Gielgud. Oliviers claim to theatrical greatness lay not only in his acting, but as, in Halls words, the supreme man of the theatre of our time , pioneering Britains National Theatre. As Bragg identified, no one doubts that the National is perhaps his most enduring monument .                  ": null
    }
]