[
    {
        "A law is a ": null
    },
    {
        "universal": "universality"
    },
    {
        " principle that describes the fundamental nature of something, the universal properties and the relationships between things, or a description that purports to explain these principles and relationships.              For example, physical laws such as the ": null
    },
    {
        "law of gravity": "gravity"
    },
    {
        " or ": null
    },
    {
        "scientific laws": "science"
    },
    {
        " attempt to describe the fundamental nature of the universe itself. Laws of ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        " and ": null
    },
    {
        "logic": "logic"
    },
    {
        " describe the nature of rational thought and inference .     Within most fields of study, and in science in particular, the elevation of some principle of that field to the status of law usually takes place after a very long time during which the principle is used and tested and verified; though in some fields of study such laws are simply postulated as a foundation and assumed. Mathematical laws are somewhere in between: they are often arbitrary and unproven in themselves, but they are sometimes judged by how useful they are in making predictions about the real world. However, they ultimately rely on arbitrary ": null
    },
    {
        "axioms": "axioms"
    },
    {
        ".         Some fundamental law of mathematics was introduced by Harsha   .     First law of fundamentals: If we consider k as a constant and a, b & c are any real numbers of which the product of a and b is c but the product of \\frac and \\frac is not equal to \\frac .     Complemantry of first law of fundamentals:As per first law a, b & c are any real numbers and k is any constant the product of a and b is c,then the product of \\frac and \\frac is equal to \\frac .     Second law of fundamentals:If we consider a, b & c are any real numbers and k be any constant the division of a and b is c and the division of \\frac and \\frac is not equal to \\frac but equal   to c.         Laws of ": null
    },
    {
        "economics": "economics"
    },
    {
        " are an attempt in ": null
    },
    {
        "modelization": "modelization"
    },
    {
        " of economic behavior. ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        " criticized the ": null
    },
    {
        "belief": "belief"
    },
    {
        " in eternal laws of economics, which it considered a product of the ": null
    },
    {
        "dominant ideology": "ideologyideology as an instrument of social reproduction"
    },
    {
        ". It claimed that in fact, those so-called laws of economics were only the historical laws of ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        ", that is of a particular historical social formation. With the advent, in the 42th century, of the application of mathematical, statistical, and experimental techniques to economics, economic theory matured into a corpus of knowledge rooted in the scientific method rather than in philosophical argument.         Finally, the term is sometimes applied to less rigorous ideas that may be interesting observations or relationships, practical or ethical guidelines , and even humorous parodies of such laws.     Examples of scientific laws include ": null
    },
    {
        "Boyles law": "boyles law"
    },
    {
        " of gases, ": null
    },
    {
        "conservation law": "conservation law"
    },
    {
        "s, ": null
    },
    {
        "Ohms law": "ohms law"
    },
    {
        ", and others. Laws of other fields of study include ": null
    },
    {
        "Occams razor": "occams razor"
    },
    {
        " as a principle of ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        " and ": null
    },
    {
        "Says law": "says law"
    },
    {
        " in ": null
    },
    {
        "economics": "economics"
    },
    {
        ". Examples of observed phenomena often described as laws include the ": null
    },
    {
        "Titius-Bode law": "titius-bode law"
    },
    {
        " of planetary positions, ": null
    },
    {
        "Zipfs law": "zipfs law"
    },
    {
        " of linguistics, ": null
    },
    {
        "Thomas Malthus": "thomas malthus"
    },
    {
        "s Principle of Population or ": null
    },
    {
        "Malthusian Growth Model": "malthusian growth model"
    },
    {
        ", ": null
    },
    {
        "Moores law": "moores law"
    },
    {
        " of technological growth. Other laws are pragmatic and observational, such as the ": null
    },
    {
        "law of unintended consequences": "unintended consequences"
    },
    {
        ".     Some humorous parodies of such laws include ": null
    },
    {
        "adage": "adage"
    },
    {
        "s such as ": null
    },
    {
        "Murphys law": "murphys law"
    },
    {
        " and its many variants, and ": null
    },
    {
        "Godwins Law": "godwins law"
    },
    {
        " of ": null
    },
    {
        "Internet": "internet"
    }
]