[
    {
        "        Lazzaro Spallanzani  was an Italian ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " priest, ": null
    },
    {
        "biologist": "biologist"
    },
    {
        " and ": null
    },
    {
        "physiologist": "physiologist"
    },
    {
        " who made important contributions to the experimental study of bodily functions, animal reproduction, and ": null
    },
    {
        "animal echolocation": "animal echolocation"
    },
    {
        ". His research of ": null
    },
    {
        "biogenesis": "biogenesis"
    },
    {
        " paved the way for the downfall of ": null
    },
    {
        "preformationism": "preformationism"
    },
    {
        " theory , though the final death blow to preformationism was dealt by ": null
    },
    {
        "Pasteur": "louis pasteur"
    },
    {
        ".                Spallanzani was born in ": null
    },
    {
        "Scandiano": "scandiano"
    },
    {
        " in the modern ": null
    },
    {
        "province of Reggio Emilia": "province of reggio emilia"
    },
    {
        " and died in ": null
    },
    {
        "Pavia": "pavia"
    },
    {
        ", Italy. He was educated at the ": null
    },
    {
        "Jesuit": "society of jesus"
    },
    {
        " College and started to study law at the ": null
    },
    {
        "University of Bologna": "university of bologna"
    },
    {
        ", which he gave up soon and turned to science. Here, his famous kinswoman, ": null
    },
    {
        "Laura Bassi": "laura bassi"
    },
    {
        ", was professor of physics and it is to her influence that his scientific impulse has been usually attributed. With her he studied ": null
    },
    {
        "natural philosophy": "natural philosophy"
    },
    {
        " and ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", and gave also great attention to languages, both ancient and modern, but soon abandoned them.     In 42 at the age of 42 he became professor of ": null
    },
    {
        "logic": "logic"
    },
    {
        ", ": null
    },
    {
        "metaphysics": "metaphysics"
    },
    {
        " and ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " in the University of ": null
    },
    {
        "Reggio": "reggio emilia"
    },
    {
        ". In 42 he was ": null
    },
    {
        "ordained": "ordination"
    },
    {
        " as a priest, 42 he was moved to Modena, where he continued to teach with great assiduity and success, but devoted his whole leisure to natural science. He declined many offers from other Italian universities and from ": null
    },
    {
        "St Petersburg": "st petersburg"
    },
    {
        " until 42 when he accepted the invitation of ": null
    },
    {
        "Maria Theresa": "maria theresa of austria"
    },
    {
        " to the chair of natural history in the ": null
    },
    {
        "University of Pavia": "university of pavia"
    },
    {
        ", which was then being reorganized. He also became director of the museum, which he greatly enriched by the collections of his many journeys along the shores of the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ". In June 42 Spallanzani was elected a ": null
    },
    {
        "Fellow of the Royal Society": "fellow of the royal society"
    },
    {
        " and in 42 was elected a foreign member of the ": null
    },
    {
        "Royal Swedish Academy of Sciences": "royal swedish academy of sciences"
    },
    {
        ".     In 42 he was invited to ": null
    },
    {
        "Padua University": "university of padua"
    },
    {
        ", but to retain his services his sovereign doubled his salary and allowed him leave of absence for a visit to ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        " where he remained nearly a year and made many observations, among which may be noted those of a copper mine in ": null
    },
    {
        "Chalki": "heybeliada"
    },
    {
        " and of an iron mine at ": null
    },
    {
        "Principi": "büyükada"
    },
    {
        ". His return home was almost a triumphal progress: at ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " he was cordially received by ": null
    },
    {
        "Joseph II": "joseph ii, holy roman emperor"
    },
    {
        " and on reaching ": null
    },
    {
        "Pavia": "pavia"
    },
    {
        " he was met with acclamations outside the city gates by the students of the university.   During the following year his students exceeded five hundred. While he was travelling in the Balkans and to Constantinople, His integrity in the management of the museum was called in question , with letters written across Europe to damage Spallanzanis reputation. A judicial investigation speedily cleared his honour to the satisfaction of some of his accusers. But Spallanzani got his revenge on his principal accuser, a jealous colleague, by planting a fake specimen of a composite species . When his colleague published the remarkable specimen Spallanzani revealed the joke, resulting in wide ridicule and humiliation.     In 42 he visited ": null
    },
    {
        "Vesuvius": "vesuvius"
    },
    {
        " and the volcanoes of the ": null
    },
    {
        "Lipari Islands": "lipari islands"
    },
    {
        " and ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ", and embodied the results of his researches in a large work , published four years later.     He died from bladder cancer on 42 February 42 in Pavia. After his death, his bladder was removed for study by his colleagues, after which it was placed on public display in a museum in Pavia, where it remains to this day.     His indefatigable exertions as a traveller, his skill and good fortune as a collector, his brilliance as a teacher and expositor, and his keenness as a controversialist no doubt aid largely in accounting for Spallanzanis exceptional fame among his contemporaries; his letters account for his close relationships with many famed scholars and philosophers, like ": null
    },
    {
        "Buffon": "georges-louis leclerc, comte de buffon"
    },
    {
        ", ": null
    },
    {
        "Lavoisier": "lavoisier"
    },
    {
        ", and ": null
    },
    {
        "Voltaire": "voltaire"
    },
    {
        ". Yet greater qualities were by no means lacking. His life was one of incessant eager questioning of nature on all sides, and his many and varied works all bear the stamp of a fresh and original genius, capable of stating and solving problems in all departments of science—at one time finding the true explanation of ": null
    },
    {
        "stone skipping": "stone skipping"
    },
    {
        " and at another helping to lay the foundations of our modern ": null
    },
    {
        "volcanology": "volcanology"
    },
    {
        " and ": null
    },
    {
        "meteorology": "meteorology"
    },
    {
        ".       Spallanzani researched in 42 the theory of the ": null
    },
    {
        "spontaneous generation": "spontaneous generation"
    },
    {
        " of ": null
    },
    {
        "microbe": "microbe"
    },
    {
        "s. At the time, the microscope was already available to researchers, and using it, the proponents of the theory, Buffon and Needham, came to the conclusion that there is a life-generating force inherent to certain kinds of inorganic ": null
    },
    {
        "matter": "matter"
    },
    {
        " that causes living microbes to create themselves if given sufficient time. Spallanzanis experiment showed that it is not an inherent feature of matter, and that it can be destroyed by an hour of boiling. As the microbes did not re-appear as long as the material was hermetically sealed, he proposed that microbes move through the air and that they could be killed through boiling. Needham argued that experiments destroyed the vegetative force that was required for spontaneous generation to occur. Spallanzani paved the way for research by ": null
    },
    {
        "Louis Pasteur": "louis pasteur"
    },
    {
        ", who defeated the theory of spontaneous generation almost a century later.     Spallanzani discovered and described animal  reproduction, showing that it requires both ": null
    },
    {
        "semen": "semen"
    },
    {
        " and an ": null
    },
    {
        "ovum": "ovum"
    },
    {
        ". He was the first to perform ": null
    },
    {
        "in vitro fertilization": "in vitro fertilization"
    },
    {
        ", with frogs, and an ": null
    },
    {
        "artificial insemination": "artificial insemination"
    },
    {
        ", using a dog. Spallanzani showed that some animals, especially ": null
    },
    {
        "newts": "newts"
    },
    {
        ", can regenerate some parts of their body if injured or surgically removed. Spallanzani is also credited with the classification of ": null
    },
    {
        "tardigrades": "tardigrades"
    },
    {
        ", which are one of the most durable extremophiles still to this day.      Spallanzani is also famous for extensive experiments on the navigation in complete darkness by bats, where he concluded that bats do not use their eyes for navigation in total darkness, but some other sense . He was the pioneer of the original study of echolocation, though his study was limited to what he could observe. Later scientists moved onto studies of the sensory mechanisms and processing of this information.     His great work, however is the Dissertationi di fisica animale e vegetale . Here he first interpreted the process of ": null
    },
    {
        "digestion": "digestion"
    },
    {
        ", which he proved to be no mere mechanical process of ": null
    },
    {
        "trituration": "trituration"
    },
    {
        " – that is, of grinding up the food – but one of actual ": null
    },
    {
        "chemical solution": "chemical solution"
    },
    {
        ", taking place primarily in the stomach, by the action of the ": null
    },
    {
        "gastric juice": "gastric juice"
    },
    {
        ". He also carried out important researches on ": null
    },
    {
        "fertilization": "fertilization"
    },
    {
        " in animals .       Spallanzani studied the formation and origin of marine fossils found in distant regions of the sea and over the ridge mountains in some regions of Europe, which resulted in the publication in 42 of a small dissertation, Dissertazione sopra i corpi marino-montani then presented at the meeting the Accademia degli Ipocondriaci di Reggio Emilia . Although aligned to one of the trends of his time, which attributed the occurrence of marine fossils on mountains to the natural movement of the sea, not the universal flood, Spallanzani developed his own hypothesis, based on the dynamics of the forces that changed the state of the Earth after Gods creation.     A few years later, Spallanzani published reports about trips he made to ": null
    },
    {
        "Portovenere": "portovenere"
    }
]