[
    {
        "         Leather is a durable and flexible material created by ": null
    },
    {
        "tanning": "tanning"
    },
    {
        " animal ": null
    },
    {
        "rawhide": "rawhide"
    },
    {
        " and skins. The most common raw material is ": null
    },
    {
        "cattle": "cattle"
    },
    {
        " hide. It can be produced at manufacturing scales ranging from ": null
    },
    {
        "artisan": "artisan"
    },
    {
        " to modern ": null
    },
    {
        "industrial scale": "heavy industry"
    },
    {
        ".     Leather is used to make a variety of articles, including footwear, automobile seats, clothing, bags, book bindings, fashion accessories, and furniture. It is produced in a wide variety of types and styles and decorated by a wide range of techniques. The earliest record of leather artifacts dates back to 2200 BC.                     The leather manufacturing process is divided into three fundamental subprocesses: preparatory stages, tanning, and crusting. A further subprocess, finishing, can be added into the leather process sequence, but not all leathers receive finishing.     The preparatory stages are when the hide is prepared for tanning. Preparatory stages may include: soaking, hair removal, ": null
    },
    {
        "liming": "liming"
    },
    {
        ", ": null
    },
    {
        "deliming": "deliming"
    },
    {
        ", bating, ": null
    },
    {
        "bleaching": "bleaching"
    },
    {
        ", and ": null
    },
    {
        "pickling": "pickling"
    },
    {
        ".     ": null
    },
    {
        "Tanning": "tanning"
    },
    {
        " is a process that stabilizes the ": null
    },
    {
        "protein": "protein"
    },
    {
        "s, particularly ": null
    },
    {
        "collagen": "collagen"
    },
    {
        ", of the raw hide to increase the thermal, chemical and microbiological stability of the hides and skins, making it suitable for a wide variety of end applications. The principal difference between raw and tanned hides is that raw hides dry out to form a hard, inflexible material that, when rewetted, will putrefy, while tanned material dries to a flexible form that does not become putrid when rewetted.     Many tanning methods and materials exist. The typical process sees tanners load the hides into a drum and immerse them in a tank that contains the tanning liquor . The hides soak while the drum slowly rotates about its axis, and the tanning liquor slowly penetrates through the full thickness of the hide. Once the process achieves even penetration, workers slowly raise the liquors pH in a process called basification, which fixes the tanning material to the leather. The more tanning material fixed, the higher the leathers hydrothermal stability and ": null
    },
    {
        "shrinkage": "shrinkage"
    },
    {
        " temperature resistance.     Crusting is a process that thins and lubricates leather. It often includes a coloring operation. Chemicals added during crusting must be fixed in place. Crusting culminates with a drying and softening operation, and may include splitting, shaving, ": null
    },
    {
        "dyeing": "dyeing"
    },
    {
        ", ": null
    },
    {
        "whitening": "whitening"
    },
    {
        " or other methods.     For some leathers, tanners apply a surface coating, called finishing . Finishing operations can include oiling, brushing, buffing, coating, polishing, embossing, ": null
    },
    {
        "glazing": "glaze"
    },
    {
        ", or ": null
    },
    {
        "tumbling": "tumble finishing"
    },
    {
        ", among others.     Leather can be oiled to improve its water resistance. This ": null
    },
    {
        "currying": "currying"
    },
    {
        " process after tanning supplements the natural oils remaining in the leather itself, which can be washed out through repeated exposure to water. Frequent oiling of leather, with ": null
    },
    {
        "mink oil": "mink oil"
    },
    {
        ", ": null
    },
    {
        "neatsfoot oil": "neatsfoot oil"
    },
    {
        ", or a similar material keeps it supple and improves its lifespan dramatically.        Tanning processes largely differ in which chemicals are used in the tanning liquor. Some common types include:    is tanned using ": null
    },
    {
        "tannins": "tannin"
    },
    {
        "extracted from ": null
    },
    {
        "vegetable matter": "vegetable matter"
    },
    {
        ", such as tree ": null
    },
    {
        "bark": "tanbark"
    },
    {
        " prepared in ": null
    },
    {
        "bark mill": "bark mill"
    },
    {
        "s. It is the oldest known method. It is supple and light brown in color, with the exact shade depending on the mix of materials and the color of the skin. The ": null
    },
    {
        "color tan": "tan"
    },
    {
        " derives its name from the appearance of undyed vegetable-tanned leather. Vegetable-tanned leather is not stable in water; it tends to discolor, and if left to soak and then dry, it shrinks and becomes harder. This is a feature of vegetable-tanned leather that is exploited in traditional shoemaking. In hot water, it shrinks drastically and partly congeals, becoming rigid and eventually brittle. ": null
    },
    {
        "Boiled leather": "boiled leather"
    },
    {
        " is an example of this, where the leather has been hardened by being immersed in hot water, or in boiled ": null
    },
    {
        "wax": "wax"
    },
    {
        " or similar substances. Historically, it was occasionally used as ": null
    },
    {
        "armor": "armor"
    },
    {
        " after hardening, and it has also been used for ": null
    },
    {
        "book binding": "book binding"
    },
    {
        ".   Chrome-tanned leather, invented in 1858, is tanned using ": null
    },
    {
        "chromium sulfate": "chromium  sulfate"
    },
    {
        " and other ": null
    },
    {
        "chromium": "chromium"
    },
    {
        "salts": "salt"
    },
    {
        ". It is also known as wet blue for the pale blue color of the undyed leather. The chrome tanning method usually takes approximately one day to complete, making it best suited for large-scale industrial use. This is the most common method in modern use. It is more supple and pliable than vegetable-tanned leather and does not discolor or lose shape as drastically in water as vegetable-tanned. However, there are environmental concerns with this tanning method, as chromium is a heavy metal.   Aldehyde-tanned leather is tanned using ": null
    },
    {
        "glutaraldehyde": "glutaraldehyde"
    },
    {
        " or ": null
    },
    {
        "oxazolidine": "oxazolidine"
    },
    {
        " compounds. It is referred to as wet white due to its pale cream color. It is the main type of chrome-free leather, often seen in shoes for infants and automobiles. ": null
    },
    {
        "Formaldehyde": "formaldehyde"
    },
    {
        " has been used for tanning in the past; it is being phased out due to danger to workers and sensitivity of many people to formaldehyde.    Chamois leather  is a form of aldehyde tanning that produces a porous and highly water-absorbent leather. Chamois leather is made using marine oils that oxidize to produce the aldehydes that tan the leather.   Brain tanned leathers are made by a labor-intensive process that uses emulsified oils, often those of animal brains such as deer, cattle, and buffalo. They are known for their exceptional softness and washability.   Alum leather is transformed using ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        " salts mixed with a variety of binders and ": null
    },
    {
        "protein": "protein"
    },
    {
        " sources, such as flour and egg yolk. Alum leather is not actually tanned; rather the process is called tawing , and the resulting material reverts to rawhide if soaked in water long enough to remove the alum salts.       In general, leather is produced in the following grades:     Top-grain leather includes the outer layer of the hide, known as the grain, which features finer, more densely packed fibers, resulting in strength and durability. Depending on thickness, it may also contain some of the more fibrous under layer, known as the corium. Types of top-grain leather include:   Full-grain leather contains the entire grain layer, without any removal of the surface. Rather than wearing out, it develops a ": null
    },
    {
        "patina": "patina"
    },
    {
        " during its useful lifetime. It is usually considered the highest quality leather. Furniture and footwear are often made from full-grain leather. Full-grain leather is typically finished with a soluble ": null
    },
    {
        "aniline": "aniline leather"
    },
    {
        " dye. ": null
    },
    {
        "Russia leather": "russia leather"
    },
    {
        " is a form of full-grain leather.   Corrected grain leather has the surface subjected to finishing treatments to create a more uniform appearance. This usually involves buffing or sanding away flaws in the grain, then dyeing and embossing the surface.    Nubuck  is top-grain leather that has been sanded or buffed on the grain side to give a slight nap of short protein fibers, producing a velvet-like surface.   Split leather is created from the corium left once the top-grain has been separated from the hide, known as the drop split. In thicker hides, the drop split can be further split into a middle split and a flesh split.    Suede  is made from the underside of a split to create a soft, napped finish. It is often made from younger or smaller animals, as the skins of adults often result in a coarse, shaggy nap.    Bicast leather  is split leather that has a polyurethane or vinyl layer applied to the surface and embossed to give it the appearance of a grain. It is slightly stiffer than top-grain leather but has a more consistent texture.    Patent leather  is leather that has been given a high-gloss finish by the addition of a coating. Dating to the late 1700s, it became widely popular after inventor ": null
    },
    {
        "Seth Boyden": "seth boyden"
    },
    {
        " developed the first mass-production process, using a linseed-oil-based lacquer, in 1818. Modern versions are usually a form of bicast leather.    Bonded leather , also called reconstituted leather, is a material that uses leather scraps that are shredded and bonded together with polyurethane or ": null
    },
    {
        "latex": "latex"
    },
    {
        " onto a fiber mesh. The amount of leather fibers in the mix varies from 10% to 90%, affecting the properties of the product.           Today, most leather is made of ": null
    },
    {
        "cattle": "cattle"
    },
    {
        " hides, which constitute about 65% of all leather produced. Other animals that are used include sheep, about 13%, goats, about 11%, and pigs, about 10%. Obtaining accurate figures from around the world is difficult, especially for areas where the skin may be eaten.   Other animals mentioned below only constitute a fraction of a percent of total leather production.     Horse hides are used to make particularly durable leathers. ": null
    },
    {
        "Shell cordovan": "shell cordovan"
    },
    {
        " is a horse leather made not from the outer skin but an under layer found only in equine species called the shell. It is prized for its mirror-like finish and anti-creasing properties.     Lamb and deerskin are used for soft leather in more expensive apparel. Deerskin is widely used in work gloves and indoor shoes.     Reptilian skins, such as ": null
    },
    {
        "alligator": "alligator leather"
    },
    {
        ", crocodile, and ": null
    },
    {
        "snake": "snakeskin"
    },
    {
        ", are noted for their distinct patterns that reflect the scales of their species. This has led to hunting and farming of these species in part for their skins.     ": null
    },
    {
        "Kangaroo leather": "kangaroo leather"
    },
    {
        " is used to make items that must be strong and flexible. It is the material most commonly used in ": null
    },
    {
        "bullwhip": "bullwhip"
    },
    {
        "s. Some ": null
    },
    {
        "motorcyclists": "motorcycle"
    },
    {
        " favor kangaroo leather for ": null
    },
    {
        "motorcycle leathers": "motorcycle safety clothingleathers"
    },
    {
        " because of its light weight and abrasion resistance.  Kangaroo leather is also used for falconry jesses, soccer footwear,  and boxing speed bags.      Although originally raised for their feathers in the 19th century, ": null
    },
    {
        "ostrich": "ostrich"
    },
    {
        "es are now more popular for both meat and leather. Henrylito Tacio, , Sun.Star 18 January 2010.  ": null
    },
    {
        "Ostrich leather": "ostrich leather"
    },
    {
        " has a characteristic goose bump look because of the large follicles where the feathers grew. Different processes produce different finishes for many applications, including upholstery, footwear, automotive products, accessories, and clothing.     In ": null
    },
    {
        "Thailand": "thailand"
    },
    {
        ", ": null
    },
    {
        "stingray": "stingray"
    },
    {
        " leather is used in wallets and belts. Stingray leather is tough and durable. The leather is often dyed black and covered with tiny round bumps in the natural pattern of the back ridge of an animal. These bumps are then usually dyed white to highlight the decoration. Stingray rawhide is also used as grips on Chinese swords, Scottish basket hilted swords, and Japanese ": null
    },
    {
        "katana": "katana"
    },
    {
        "s. Stingray leather is also used for high abrasion areas in motorcycle racing leathers     For a given thickness, fish leather is typically much stronger due to its criss-crossed fibers.        Leather produces some environmental impact, most notably due to:   The carbon footprint of cattle rearing   Use of chemicals in the tanning process    Air pollution due to the transformation process          One estimate of the ": null
    },
    {
        "carbon footprint": "carbon footprint"
    },
    {
        " of leather goods is 0.51  kg of CO 2 equivalent per £1 of output at 2010 retail prices, or 0.71  kg CO 2 eq per £1 of output at 2010 industry prices. Mike Berners-Lee, How Bad are Bananas: The Carbon Footprint of Everything , p. 201.         One ton of hide or skin generally produces 20 to 80 m 3 of waste water, including chromium levels of 100–400  mg/l, sulfide levels of   200–800  mg/l, high levels of fat and other solid wastes, and notable pathogen contamination. Producers often add pesticides to protect hides during transport. With solid wastes representing up to 70% of the wet weight of the original hides, the tanning process represents a considerable strain on water treatment installations.          Leather ": null
    },
    {
        "biodegrades": "biodegrade"
    },
    {
        "slowly—taking 25 to 40 years to ": null
    },
    {
        "decompose": "decompose"
    },
    {
        ".  However, vinyl and petrochemical-derived materials take 500 or more years to decompose.           Tanning is especially polluting in countries where environmental regulations are lax, such as in India, the worlds third-largest producer and exporter of leather. To give an example of an efficient pollution prevention system, chromium loads per produced tonne are generally abated from 8  kg to 1.5  kg. ": null
    },
    {
        "VOC": "volatile organic compounds"
    },
    {
        " emissions are typically reduced from 30  kg/t to 2  kg/t in a properly managed facility. A review of the total pollution load decrease achievable according to the ": null
    },
    {
        "United Nations Industrial Development Organization": "united nations industrial development organization"
    },
    {
        "  posts precise data on the abatement achievable through industrially proven low-waste advanced methods, while noting, even though the chrome pollution load can be decreased by 94% on introducing advanced technologies, the minimum residual load 0.15 kg/t raw hide can still cause difficulties when using landfills and composting sludge from wastewater treatment on account of the regulations currently in force in some countries.     In ": null
    },
    {
        "Kanpur": "kanpur"
    },
    {
        ", the self-proclaimed Leather City of World —with 10,000 tanneries as of 2011 and a city of three million on the banks of the ": null
    },
    {
        "Ganges": "ganges"
    },
    {
        "—pollution levels were so high, that despite an industry crisis, the pollution control board decided to shut down 49 high-polluting tanneries out of 404 in July 2009.  In 2003 for instance, the main tanneries effluent disposal unit was dumping 22 tonnes of chromium-laden solid waste per day in the open.      In the Hazaribagh neighborhood of Dhaka in ": null
    },
    {
        "Bangladesh": "bangladesh"
    },
    {
        ", chemicals from tanneries end up in Dhakas main river. Besides the environmental damage, the health of both local factory workers and the end consumer is also negatively affected.  After approximately 15 years of ignoring high court rulings, the government shut down more than 100 tanneries the weekend of 8 April 2017 in the neighborhood.      The higher cost associated with the treatment of effluents than to untreated effluent discharging leads to illegal dumping to save on costs. For instance, in ": null
    },
    {
        "Croatia": "croatia"
    },
    {
        " in 2001, proper pollution abatement cost US$70–100 per ton of raw hides processed against $43/t for irresponsible behavior.  In November 2009, one of Ugandas main leather making companies was caught directly dumping waste water into a wetland adjacent to ": null
    },
    {
        "Lake Victoria": "lake victoria"
    },
    {
        ".        ": null
    },
    {
        "Enzymes": "enzyme"
    },
    {
        "like ": null
    },
    {
        "protease": "protease"
    },
    {
        "s, ": null
    },
    {
        "lipase": "lipase"
    },
    {
        "s, and ": null
    },
    {
        "amylases": "amylase"
    },
    {
        "have an important role in the soaking, dehairing, degreasing, and bating operations of leather manufacturing. Proteases are the most commonly used enzymes in leather production. The enzyme must not damage or dissolve ": null
    },
    {
        "collagen": "collagen"
    },
    {
        " or ": null
    },
    {
        "keratin": "keratin"
    },
    {
        ", but should hydrolyze ": null
    },
    {
        "casein": "casein"
    },
    {
        ", ": null
    },
    {
        "elastin": "elastin"
    },
    {
        ", ": null
    },
    {
        "albumin": "albumin"
    },
    {
        ", ": null
    },
    {
        "globulin": "globulin"
    },
    {
        "-like proteins, and nonstructural proteins that are not essential for leather making. This process is called bating.      Lipases are used in the degreasing operation to hydrolyze fat particles embedded in the skin.      Amylases are used to soften skin, to bring out the grain, and to impart strength and flexibility to the skin. These enzymes are rarely used.       The natural fibers of leather break down with the passage of time. Acidic leathers are particularly vulnerable to ": null
    },
    {
        "red rot": "red rot"
    },
    {
        ", which causes powdering of the surface and a change in consistency. Damage from red rot is aggravated by high temperatures and relative humidities. Although it is chemically irreversible, treatments can add handling strength and prevent disintegration of red rotted leather.     Exposure to long periods of low relative humidities can cause leather to become desiccated, irreversibly changing the fibrous structure of the leather. Chemical damage can also occur from exposure to environmental factors, including ultraviolet light, ozone, acid from sulfurous and nitrous pollutants in the air, or through a chemical action following any treatment with tallow or oil compounds. Both oxidation and chemical damage occur faster at higher temperatures.     Various treatments are available such as ": null
    },
    {
        "conditioners": "conditioner"
    },
    {
        ". ": null
    },
    {
        "Saddle soap": "saddle soap"
    },
    {
        " is used for cleaning, conditioning, and softening leather. Leather shoes are widely conditioned with ": null
    },
    {
        "shoe polish": "shoe polish"
    },
    {
        ".             Due to its excellent resistance to abrasion and wind, leather found a use in rugged occupations. The enduring image of a ": null
    },
    {
        "cowboy": "cowboy"
    },
    {
        " in leather ": null
    },
    {
        "chaps": "chaps"
    },
    {
        " gave way to the leather-jacketed and leather-helmeted ": null
    },
    {
        "aviator": "aviator"
    },
    {
        ". When ": null
    },
    {
        "motorcycles": "motorcycle"
    },
    {
        "were invented, some riders took to wearing heavy leather ": null
    },
    {
        "jackets": "jackets"
    },
    {
        " to protect from ": null
    },
    {
        "road rash": "road rash"
    },
    {
        " and wind blast; some also wear chaps or full leather pants to protect the lower body.     Leathers flexibility allows it to be formed and shaped into balls and protective gear. Subsequently, many sports use equipment made from leather, such as ": null
    },
    {
        "baseball gloves": "baseball glove"
    },
    {
        "and the ": null
    },
    {
        "ball": "ball"
    },
    {
        " used in ": null
    },
    {
        "American football": "american football"
    },
    {
        ".     ": null
    },
    {
        "Leather fetishism": "leather fetishism"
    },
    {
        " is the name popularly used to describe a ": null
    },
    {
        "fetishistic": "sexual fetishism"
    },
    {
        " attraction to people wearing leather, or in certain cases, to the garments themselves.     Many ": null
    },
    {
        "rock groups": "rock group"
    },
    {
        "  are well known for wearing leather clothing. ": null
    },
    {
        "Extreme metal": "extreme metal"
    },
    {
        " bands  and ": null
    },
    {
        "Goth rock": "goth rock"
    },
    {
        " groups have extensive ": null
    },
    {
        "black leather": "black leather"
    },
    {
        " clothing. Leather has become less common in the punk community over the last three decades, as there is opposition to the use of leather from ": null
    },
    {
        "punks who support animal rights": "punk ideologiesanimal rights and veganism"
    },
    {
        ".     Many cars and trucks come with optional or standard leather or leather faced seating.       In countries with significant populations of individuals observing religions which place restrictions on material choices, leather vendors typically clarify the kinds of leather in their products. For example, leather shoes bear a label that identifies the animal from which the leather came. This helps a ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " not accidentally purchase pigskin, and a ": null
    },
    {
        "Hindu": "hindu"
    },
    {
        " to avoid cattleskin, this is to adhere to religious observance and respect. Many vegetarian Hindus do not use any kind of leather. Such ": null
    },
    {
        "taboos": "taboo"
    },
    {
        "increase the demand for religiously neutral leathers such as ": null
    },
    {
        "ostrich": "ostrich"
    },
    {
        " and ": null
    },
    {
        "deer": "deer"
    },
    {
        ".     ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " forbids the comfort of wearing leather shoes on ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        ", ": null
    },
    {
        "Tisha BAv": "tisha bav"
    },
    {
        ", and during mourning.  Also, see ": null
    },
    {
        "Teffilin": "tefillin"
    },
    {
        " and ": null
    },
    {
        "Torah Scroll": "sefer torah"
    },
    {
        ".     ": null
    },
    {
        "Jainism": "jainism"
    },
    {
        " prohibits the use of leather, since it is obtained by killing animals.       Many forms of ": null
    },
    {
        "artificial leather": "artificial leather"
    },
    {
        " have been developed, usually involving polyurethane or vinyl coatings applied to a cloth backing. Many names and brands for such artificial leathers exist, including pleather , a portmanteau of plastic leather , and the brand name ": null
    },
    {
        "Naugahyde": "naugahyde"
    },
    {
        ".      Another alternative is cultured leather which is lab-grown using ": null
    },
    {
        "cell culture": "cell culture"
    },
    {
        " methods.  ": null
    }
]