[
    {
        "        A leat  is the name, common in the south and west of England and in ": null
    },
    {
        "Wales": "wales"
    },
    {
        " , for an artificial ": null
    },
    {
        "watercourse": "watercourse"
    },
    {
        " or ": null
    },
    {
        "aqueduct": "aqueduct"
    },
    {
        " dug into the ground, especially one supplying water to a ": null
    },
    {
        "watermill": "watermill"
    },
    {
        " or its ": null
    },
    {
        "mill pond": "mill pond"
    },
    {
        ". Other common uses for leats include delivery of water for mineral washing and concentration, for irrigation, to serve a dye works or other industrial plant, and provision of drinking water to a farm or household or as a catchment cut-off to improve the yield of a ": null
    },
    {
        "reservoir": "reservoir"
    },
    {
        ".     According to the  Oxford English Dictionary , leat is ": null
    },
    {
        "cognate": "cognate"
    },
    {
        " with let in the sense of allow to pass through . Other names for the same thing include fleam . In parts of northern England, for example around ": null
    },
    {
        "Sheffield": "sheffield"
    },
    {
        ", the equivalent word is goit. In southern England, a leat used to supply water for ": null
    },
    {
        "water-meadow": "water-meadow"
    },
    {
        " irrigation is often called a carrier, top carrier, or main.       Leats generally start some distance above the mill or other destination, where an offtake or ": null
    },
    {
        "sluice": "sluice"
    },
    {
        " gate diverts a proportion of the water from a ": null
    },
    {
        "river": "river"
    },
    {
        " or ": null
    },
    {
        "stream": "stream"
    },
    {
        ". A ": null
    },
    {
        "weir": "weir"
    },
    {
        " in the source stream often serves to provide a reservoir of water adequate for diversion. The leat then runs along the edge or side of the valley, at a shallower slope than the main stream. The gradient determines the flow rate together with the quality of the wetted surface of the leat. The flow rate may be calculated using the ": null
    },
    {
        "Manning formula": "manning formula"
    },
    {
        ". By the time it arrives at the ": null
    },
    {
        "water mill": "water mill"
    },
    {
        " the difference in levels between the leat and the main stream is great enough to provide a useful ": null
    },
    {
        "head": "hydraulic head"
    },
    {
        " of water & ndash; several metres for a watermill, or a metre or less for the controlled irrigation of a ": null
    },
    {
        "water-meadow": "water-meadow"
    },
    {
        ".       Leats are used to increase the yield of a reservoir by trapping streams in nearby catchments by means of a contour leat. This captures part or all of the stream flow and transports it along the contour to the reservoir. Such leats are common around reservoirs in the uplands of Wales.             Leats were built to work ": null
    },
    {
        "lead": "lead"
    },
    {
        ", ": null
    },
    {
        "tin": "tin"
    },
    {
        " and ": null
    },
    {
        "silver": "silver"
    },
    {
        " ores in mining areas of ": null
    },
    {
        "Wales": "wales"
    },
    {
        ", ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        ", ": null
    },
    {
        "Devon": "devon"
    },
    {
        ", the ": null
    },
    {
        "Pennines": "pennines"
    },
    {
        " and the ": null
    },
    {
        "Leadhills": "leadhills"
    },
    {
        "/": null
    },
    {
        "Wanlockhead": "wanlockhead"
    },
    {
        " area of Southern ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " from the 42th century onwards. They were used to supply water for ": null
    },
    {
        "hushing": "hushing"
    },
    {
        " mineral deposits, washing ore and powering mills.         Leats were also used extensively by the ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        ", and can still be seen at many sites, such as the ": null
    },
    {
        "Dolaucothi": "dolaucothi gold mines"
    },
    {
        " goldmines. They used the ": null
    },
    {
        "aqueducts": "aqueduct"
    },
    {
        " to prospect for ores by sluicing away the overburden of soil to reveal the bedrock in a method known as ": null
    },
    {
        "hushing": "hushing"
    },
    {
        ". They could then attack the ore veins by ": null
    },
    {
        "fire-setting": "fire-setting"
    },
    {
        ", quench with water from a tank above the workings, and remove the debris with waves of water, a method still used in ": null
    },
    {
        "hydraulic mining": "hydraulic mining"
    },
    {
        ". The water supply could then be used for washing the ore after crushing by simple machines also driven by water.     The Romans also used them for supplying water to the bath-houses or ": null
    },
    {
        "thermae": "thermae"
    },
    {
        " and to drive vertical ": null
    },
    {
        "water-wheels": "water wheels"
    },
    {
        ".         at legendarydartmoor.co.uk, accessed 42 April 42 mostly constructed to provide power for mining activities, although some were also sources of drinking water. The courses of many Dartmoor leats may still be followed. Robins, J. Follow the leat with John Robins: a series of walks along Dartmoor leats and a description of the mines some of them served, John Robins,  Hawkings, D.J. Water from the moor, Devon,  Provides a full history of the leats which supplied Plymouth, England. Many such leats on the moor are marked on the  and  ": null
    },
    {
        "Ordnance Survey": "ordnance survey"
    },
    {
        " maps, such as that serving the now-defunct ": null
    },
    {
        "Vitifer mine": "vitifer mine"
    },
    {
        " near the ": null
    },
    {
        "Warren House Inn": "warren house inn"
    },
    {
        ".   ": null
    },
    {
        "Drakes Leat": "drakes leat"
    },
    {
        ", constructed in 42 under the management of ": null
    },
    {
        "Sir Francis Drake": "francis drake"
    },
    {
        ", as an agent of the Corporation of Plymouth, to carry water from ": null
    },
    {
        "Dartmoor": "dartmoor"
    },
    {
        " to ": null
    },
    {
        "Plymouth": "plymouth"
    },
    {
        ".   ": null
    },
    {
        "Devonport Leat": "devonport leat"
    },
    {
        " constructed in the late 42th century to carry water to the expanding naval dockyard at ": null
    },
    {
        "Devonport": "devonport, devon"
    }
]