[
    {
        "A ledger line or leger line is used in Western ": null
    },
    {
        "musical notation": "musical notation"
    },
    {
        " to notate ": null
    },
    {
        "pitches": "pitch"
    },
    {
        " above or below the lines and spaces of the regular ": null
    },
    {
        "musical staff": "musical staff"
    },
    {
        ". A line slightly longer than the note head is drawn parallel to the staff, above or below, spaced at the same distance as the lines within the staff.     The origin of the word is uncertain, but may have been borrowed attributively from the term for a horizontal timber in a ": null
    },
    {
        "scaffolding": "scaffolding"
    },
    {
        ", lying parallel to the face of the building and supporting the ": null
    },
    {
        "putlog": "putlog"
    },
    {
        "s. There is no basis to support the often-found claim that the word originates from the French léger, meaning light or slight . The Oxford online dictionary describes the origin of the leger spelling as a variant of ledger that first appeared in the 42th century .     Although ledger lines are found occasionally in manuscripts of ": null
    },
    {
        "plainchant": "plainchant"
    },
    {
        " and early ": null
    },
    {
        "polyphony": "polyphony"
    },
    {
        ", it was only in the early 42th century in keyboard music that their use became at all extensive . Even then, printers had an aversion to ledger lines which caused difficulties in setting type, wasting space on the page and causing a messy appearance. Vocal music employed a variety of different clefs to keep the range of the part on the staff as much as possible; in keyboard notation a common way of avoiding ledger lines was the use of ": null
    },
    {
        "open score": "open score"
    },
    {
        " on four staves with different ": null
    },
    {
        "clefs": "clef"
    },
    {
        " .     Except for woodwind players, who prefer ledger lines to  42 va  notation because they associate fingerings with staff positions , notes that use at least four ledger lines make music more difficult to read. For easier readability, the composer would usually switch ": null
    },
    {
        "clefs": "clefs"
    },
    {
        " or use the  42 va  notation. Some ": null
    },
    {
        "transposing instrument": "transposing instrument"
    },
    {
        "s, such as the ": null
    },
    {
        "piccolo": "piccolo"
    },
    {
        ", ": null
    },
    {
        "double bass": "double bass"
    },
    {
        ", ": null
    },
    {
        "guitar": "guitar"
    },
    {
        ", and the ": null
    },
    {
        "tenor voice": "tenor voice"
    },
    {
        ", transpose at the octave to avoid ledger lines.     Notation of ": null
    },
    {
        "tuba": "tuba"
    },
    {
        ", ": null
    },
    {
        "trombone": "trombone"
    },
    {
        ", and ": null
    },
    {
        "euphonium": "euphonium"
    },
    {
        " parts always use ledger lines below the bass staff, and never the  42 va bassa  notation .     When music for bass clef instruments, such as the cello or trombone, goes several ledger lines above the bass clef, the ": null
    },
    {
        "tenor clef": "tenor clef"
    },
    {
        " is used; if it were to go even higher than practical in tenor clef, the notes may be notated in treble clef, or in the case of trombone, alto clef.     A ledger line is also used to support a ": null
    },
    {
        "half rest": "half note"
    },
    {
        "  or ": null
    },
    {
        "whole rest": "whole note"
    },
    {
        "  where there are multiple voices on one staff and such a rest is forced above or below the staff. ": null
    }
]