[
    {
        "            A legal code is a body of ": null
    },
    {
        "law": "law"
    },
    {
        " written by a local, non-sovereign government authority, such as a municipality. Whether authored or merely adopted by a municipality, it is typically, though not exclusively, enforced by the ": null
    },
    {
        "municipality": "municipality"
    },
    {
        ", as the ": null
    },
    {
        "Authority Having Jurisdiction": "authority having jurisdiction"
    },
    {
        ". A municipal code is usually a type of ": null
    },
    {
        "statutory instrument": "statutory instrument"
    },
    {
        " or ": null
    },
    {
        "delegated legislation": "delegated legislation"
    },
    {
        ".     A municipal legal code is similar in concept, though different in nature, to ": null
    },
    {
        "code": "code"
    },
    {
        "s enacted by sovereign government authorities, such as a national government or a ": null
    },
    {
        "federal state or province": "federal state"
    },
    {
        " within a ": null
    },
    {
        "federation": "federation"
    },
    {
        ".       Locally enforceable codes include but are not limited to:   ": null
    },
    {
        "Building code": "building code"
    },
    {
        " - enforced by building inspectors from the municipal building department   ": null
    },
    {
        "Fire code": "fire code"
    },
    {
        " - enforced by the local fire prevention officers from the local fire department   ": null
    },
    {
        "Noise Control": "noise pollution"
    },
    {
        " Code - enforced by municipal ": null
    },
    {
        "bylaw": "bylaw"
    },
    {
        " officers       Some ": null
    },
    {
        "nation": "nation"
    },
    {
        "al and regional governments may issue model codes, such as a ": null
    },
    {
        "model building code": "model building code"
    },
    {
        ". Examples include the ": null
    },
    {
        "National Building Code of Canada": "national building code of canada"
    },
    {
        ", the  and ": null
    },
    {
        "Germany": "germany"
    },
    {
        "s . All three aforementioned examples are issued as guideline documents, which are then used by their ": null
    },
    {
        "Provinces": "provinces and territories of canada"
    },
    {
        " and ": null
    },
    {
        "Bundesländer": "states of germany"
    },
    {
        ", respectively, as a baseline to author their own building codes, such as the  and fire codes, such as the , respectively, which must then, in turn, also be adopted by the municipalities, before they become local law, which is then locally enforced by the municipalities. Usually, the municipality passes a by-law to adopt the code, so the same book applies across that whole territory or Province, etc.. Alternatively, a municipality may elect to issue its own version, such as ": null
    },
    {
        "The City of Vancouver, British Columbia, Canada": "vancouver"
    },
    {
        ", which typically makes its own changes to the , and then issues its own , rather than to simply adopt the BCBC, as all other municipalities in ": null
    },
    {
        "British Columbia": "british columbia"
    },
    {
        " do.       Typically, volunteers gather in ": null
    },
    {
        "committee": "committee"
    },
    {
        "s at the location of the issuing authority to write and edit the code. Volunteers in both codes and standards writing are generally considered to be ": null
    },
    {
        "stakeholders": "project stakeholder"
    },
    {
        ". The governing body is generally intended to ensure that no one type of stakeholder dominates in order to be able to produce a more balanced and legally defensible final document. General principles of law and philosophy prevailing in the region may also have an influence.       Example legal codes that rely heavily on precedent and the opinions of prior jurists include English ": null
    },
    {
        "common law": "common law"
    },
    {
        " and ": null
    },
    {
        "U.S. Constitutional Law": "u.s. constitutional law"
    },
    {
        ". By contrast most implementations of ": null
    },
    {
        "Islamic": "islamic"
    },
    {
        " Shariah": "shariah"
    },
    {
        ". ": null
    },
    {
        "Napoleonic Code": "napoleonic code"
    },
    {
        ", ": null
    },
    {
        "Chinese Law": "chinese law"
    },
    {
        " and ": null
    },
    {
        "German Law": "german law"
    },
    {
        ", emphasize very specific philosophical principles rooted in ": null
    },
    {
        "Islam": "islam"
    },
    {
        ", French, Chinese, and German philosophy respectively - the role of precedent and prior jurists is much reduced and that of current judges enhanced - thus these can be seen as an ": null
    },
    {
        "ethical code": "ethical code"
    },
    {
        " which applies to the jurists themselves. In construction, precedents may include experience gained through fire losses and structural collapse. Lessons learned can be incorporated into revised codes or updates to prevent further losses.     If a legal system is not controlled by a single institution, the legal code typically includes ways to balance the power of different participants . These measures can reduce the potential for one group of participants to develop a monopoly over the legal system. For example, in a ": null
    },
    {
        "representative democracy": "representative democracy"
    },
    {
        ", it may be required that elected officials make or vote on any changes to the law.     Apart from the foregoing, industry organisations tend to engage in attempts to influence the code writing process through participating in ": null
    },
    {
        "meeting": "meeting"
    },
    {
        "s of task ": null
    },
    {
        "committee": "committee"
    },
    {
        "s and groups and providing evidence to make their cases. An example is the ": null
    },
    {
        "fire sprinkler": "fire sprinkler"
    },
    {
        " lobby": "lobbying"
    },
    {
        ", which favours ": null
    },
    {
        "active fire protection": "active fire protection"
    },
    {
        ", whereas members of the ": null
    },
    {
        "passive fire protection": "passive fire protection"
    },
    {
        " trades, for instance the  would argue the merits of its members work. Stakeholders also include ": null
    },
    {
        "insurance": "insurance"
    },
    {
        " companies, who stand to gain by keeping the operating risks of buildings low, whereas a ": null
    },
    {
        "real-estate developer": "real-estate developer"
    },
    {
        " may seek to ": null
    },
    {
        "keep costs low": "false economy"
    },
    {
        ".       Generally, a legal code serves the dual purpose of broadcasting a certain idea of ": null
    },
    {
        "public morality": "public morality"
    },
    {
        " as well as technical fact, and disclosing the ": null
    },
    {
        "retribution": "retributive justice"
    },
    {
        " that the society, via the enforcing body, will visit on those who offend that morality. As an example, penalties are imposed for constructing an unsafe ": null
    },
    {
        "building": "building"
    },
    {
        " or engaging in actions that will negatively impact the safety of a building. The severity of the punishment is intended to be commensurate with the severity of the offence.          Since there are different types of codes, with differing levels of public safety impact, the severity of consequences and punishment varies. Violating the noise control code inside an apartment may just annoy the neighbours. Building and fire code violations, however, can affect anyone inside and even surrounding a building.     Perpetrators include, but are not limited to the following:   ": null
    },
    {
        "General contractor": "general contractor"
    },
    {
        "   Subcontractor": "subcontractor"
    },
    {
        "   Architect": "architect"
    },
    {
        "    Building owner .   Occupants    ": null
    },
    {
        "Authority Having Jurisdiction": "authority having jurisdiction"
    },
    {
        "   Developers       For predictability, a legal code usually includes a body of prior decisions or ": null
    },
    {
        "precedent": "precedent"
    },
    {
        ", which with the law itself constitutes what is called a ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        ". A ": null
    },
    {
        "jurist": "jurist"
    },
    {
        " is an individual who makes judgements that are incorporated into the jurisprudence, either as cases or as laws themselves.     To speed cases along and ensure uniform representation, many legal codes require a ": null
    },
    {
        "defendant": "defendant"
    },
    {
        " or ": null
    },
    {
        "plaintiff": "plaintiff"
    },
    {
        " to be represented by an ": null
    },
    {
        "attorney at law": "lawyer"
    },
    {
        ", whose responsibility is to take the clients case without prejudice, and to their best to minimize the penalties applied by law, including ideally the release of their client from any responsibility at all.       Recently ": null
    },
    {
        "Lawrence Lessig": "lawrence lessig"
    },
    {
        " has argued in his book  Code and Other Laws of Cyberspace ": null
    }
]