[
    {
        "        Leopold Samuel Leo Marks, ": null
    },
    {
        "MBE": "Mbe"
    },
    {
        " was an English writer, screenwriter, and ": null
    },
    {
        "cryptographer": "Cryptographer"
    },
    {
        ". During the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        " he headed the codes office supporting resistance agents in occupied Europe for the secret ": null
    },
    {
        "Special Operations Executive": "Special Operations Executive"
    },
    {
        " organisation. After the war, Marks became a playwright and screenwriter, writing scripts that frequently utilised his war-time cryptographic experiences. He wrote the script for  Peeping Tom , the controversial film directed by ": null
    },
    {
        "Michael Powell": "Michael Powell"
    },
    {
        " which had a disastrous effect on Powells career, but was later described by ": null
    },
    {
        "Martin Scorsese": "Martin Scorsese"
    },
    {
        " as a masterpiece. In 1998, towards the end of his life, Marks published a personal history of his experiences during the war,  Between Silk and Cyanide , which was critical of the leadership of SOE.       Marks was the son of Benjamin Marks, the joint owner of ": null
    },
    {
        "Marks & Co": "Marks  &  Co"
    },
    {
        ", an antiquarian bookseller in ": null
    },
    {
        "Charing Cross Road": "Charing Cross Road"
    },
    {
        ", London. He was introduced at an early age to ": null
    },
    {
        "cryptography": "Cryptography"
    },
    {
        " when his father showed him ": null
    },
    {
        "Edgar Allan Poes": "Edgar Allan Poe"
    },
    {
        "story,  The Gold-Bug .     From this early interest, he demonstrated his skill at ": null
    },
    {
        "codebreaking": "Codebreaking"
    },
    {
        " by deciphering the secret price codes which his father wrote inside the covers of books. The bookshop subsequently became famous as a result of the book  84, Charing Cross Road , which was based on correspondence between American writer ": null
    },
    {
        "Helene Hanff": "Helene Hanff"
    },
    {
        " and the shops chief buyer, ": null
    },
    {
        "Frank Doel": "Frank Doel"
    },
    {
        ".        Marks was conscripted in January 1942, and trained as a cryptographer; apparently he demonstrated the ability to complete one weeks work in decipherment exercise in a few hours. Unlike the rest of his intake, who were sent to the main British codebreaking centre at ": null
    },
    {
        "Bletchley Park": "Bletchley Park"
    },
    {
        ", Marks was regarded as a misfit and he was assigned the newly formed ": null
    },
    {
        "Special Operations Executive": "Special Operations Executive"
    },
    {
        " in ": null
    },
    {
        "Baker Street": "Baker Street"
    },
    {
        ", which was set up to train agents to operate behind enemy lines in ": null
    },
    {
        "occupied Europe": "German-Occupied Europe"
    },
    {
        " and to assist ": null
    },
    {
        "local resistance groups": "Resistance During World War Ii"
    },
    {
        ". SOE has been described as a mixture of brilliant brains and bungling amateurs . Marks wrote that he had an inauspicious arrival at SOE when it took him all day to decipher a code he had been expected to finish in 20 minutes, because, not atypically, SOE had forgotten to supply the cipher key.     Marks briefed many Allied agents sent into occupied Europe, including ": null
    },
    {
        "Noor Inayat Khan": "Noor Inayat Khan"
    },
    {
        ", the Grouse/Swallow team of four Norwegian ": null
    },
    {
        "Telemark": "Norwegian Heavy Water Sabotage"
    },
    {
        " saboteurs and his own close friend ": null
    },
    {
        "Tommy Yeo-Thomas": "F. F. E. Yeo-Thomas"
    },
    {
        ", nicknamed the White Rabbit . In an interview which accompanied the DVD of the film  Peeping Tom , Marks quoted ": null
    },
    {
        "General Eisenhower": "Dwight D. Eisenhower"
    },
    {
        " as saying that his groups work shortened the war by three months, saving countless lives.     Marks was portrayed by ": null
    },
    {
        "Anton Lesser": "Anton Lesser"
    },
    {
        " in ": null
    },
    {
        "David Morleys": "David Morley"
    },
    {
        " BBC Radio": "Bbc Radio"
    },
    {
        " drama A Cold Supper Behind Harrods. The fiction play was inspired by conversations between Marks and ": null
    },
    {
        "David Morley": "David Morley"
    },
    {
        " and real events in SOE. It featured ": null
    },
    {
        "David Jason": "David Jason"
    },
    {
        ", and ": null
    },
    {
        "Stephanie Cole": "Stephanie Cole"
    },
    {
        " as ": null
    },
    {
        "Vera Atkins": "Vera Atkins"
    },
    {
        ".         One of Markss first challenges  was to phase out double ": null
    },
    {
        "transposition ciphers": "Transposition Cipher"
    },
    {
        "using ": null
    },
    {
        "keys": "Key"
    },
    {
        "based on preselected poems. These ": null
    },
    {
        "poem ciphers": "Poem Code"
    },
    {
        " had the limited advantage of being easy to memorise, but significant disadvantages, including limited cryptographic security, substantial minimum message sizes , and the fact that the methods complexity caused encoding errors.     Cryptographic security was enhanced by Markss innovations, especially worked-out keys . He was credited with inventing the letter ": null
    },
    {
        "one-time pad": "One-Time Pad"
    },
    {
        ", but while he did independently discover the method, he later found it already in use at Bletchley.        While attempting to relegate poem codes to emergency use, he enhanced their security by promoting the use of original poems in preference to widely known ones, forcing a ": null
    },
    {
        "cryptanalyst": "Cryptanalyst"
    },
    {
        " to work it out the hard way for each message instead of guessing an agents entire set of keys after breaking the key to a single message Marks wrote many poems later used by agents, the most famous being one he gave to the agent ": null
    },
    {
        "Violette Szabo": "Violette Szabo"
    },
    {
        ",  The Life That I Have , which gained popularity when it was used in the 1958 film about her,  Carve Her Name With Pride . According to his book, Marks wrote the poem in Christmas 1943 about a girlfriend, Ruth, who had recently died in an air crash in Canada; The Long Life of a Poem , H2G2 Forum, 17 November 2012  supposedly the god-daughter of the head of SOE, Sir ": null
    },
    {
        "Charles Jocelyn Hambro": "Charles Jocelyn Hambro"
    },
    {
        ".   Between Silk and Cyanide, p.452       The life that I have   Is all that I have   And the life that I have   Is yours.     The love that I have   Of the life that I have   Is yours and yours and yours.     A sleep I shall have   A rest I shall have   Yet death will be but a pause.     For the peace of my years   In the long green grass   Will be yours and yours and yours.         ": null
    },
    {
        "Gestapo": "Gestapo"
    },
    {
        " signal tracers endangered clandestine radio operators, and their life expectancy averaged about six weeks. Therefore, short and less frequent transmissions from the codemaster were of value. The pressure could cause agents to make mistakes encoding messages, and the practice was for the home station to tell them to recode it and retransmit it . In response to this problem, Marks established, staffed and trained a group based at ": null
    },
    {
        "Grendon Underwood": "Grendon Underwood"
    },
    {
        ", Buckinghamshire to ": null
    },
    {
        "cryptanalyse": "Cryptanalysis"
    },
    {
        " garbled messages so they could be dealt with in England without forcing the agent to risk retransmitting from the field. Other innovations of his simplified encoding in the field, which reduced errors and made shorter messages possible, both of which reduced transmission time.       The Germans generally did not execute captured radio operators out of hand. The goal was to turn and use them, or to extract enough information to imitate them. For the safety of entire underground circuits , it was important to determine if an operator was genuine and still free, but means of independently checking were primitive. Marks claims that he became convinced that their agents in the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        " had been compromised by the German counter-intelligence ": null
    },
    {
        "Abwehr": "Abwehr"
    },
    {
        ". The Germans referred to their operation as a game —": null
    },
    {
        "Das Englandspiel": "Das Englandspiel"
    },
    {
        ". Markss warnings fell on deaf ears and perhaps as many as 50 further agents were sent to meet their deaths in Holland. The other side of this story was published in 1953 by Markss German opposite number in the Netherlands, ": null
    },
    {
        "Hermann Giskes": "Hermann Giskes"
    },
    {
        ", in his book London Calling North Pole.       In his book , Marks describes the memorandum he wrote detailing his conviction that messages from the Netherlands were being sent either by Germans or by agents who had been turned. He argued that, despite harrowing circumstances, not a single Dutch agent has been so overwrought that hes made a mistake in his coding.... Marks had to face Brigadier ": null
    },
    {
        "Colin Gubbins": "Colin Gubbins"
    },
    {
        ":          Gubbins grills Marks. In particular he wants to know who has seen this report, who typed it :            After the war, Marks went on to write plays and films, including  The Girl Who Couldnt Quite!  ,  Cloudburst  , The Best Damn Lie ,  Guns at Batasi  ,  Sebastian  and  Twisted Nerve  .      Marks wrote the script for ": null
    },
    {
        "Michael Powells": "Michael Powell"
    },
    {
        "film  Peeping Tom  , the story of a ": null
    },
    {
        "serial killer": "Serial Killer"
    },
    {
        " who films his victims while stabbing them. The film provoked critical revulsion, at the time, and was described as evil and pornographic . The film was critically rehabilitated when younger directors, including ": null
    },
    {
        "Martin Scorsese": "Martin Scorsese"
    },
    {
        ", expressed admiration for Markss script. Scorsese subsequently asked Marks to supply the voice of ": null
    },
    {
        "Satan": "Satan"
    },
    {
        " in his 1988 film  The Last Temptation of Christ .      In 1998, Marks published his account of his work in SOE –  Between Silk and Cyanide: A Codemakers Story 1941-1945 . The book was written in the early 1980s, but didnt receive UK Government approval for publication until 1998. Three of the poems published in the book were scrambled into the song Dead Agents by ": null
    },
    {
        "John Cale": "John Cale"
    },
    {
        " performed at the ": null
    },
    {
        "Institute of Contemporary Arts": "Institute Of Contemporary Arts"
    },
    {
        ", London, in April 1999.     Marks describes himself as an ": null
    },
    {
        "agnostic": "Agnostic"
    },
    {
        " in Between Silk and Cyanide, but frequently refers to his Jewish heritage.       He married the portrait painter Elena Gaussen in 1966. The marriage lasted until shortly before his death at home from cancer in January 2001. ": null
    }
]