[
    {
        "      Leopold I  was a German ": null
    },
    {
        "prince": "prince"
    },
    {
        " who became the first ": null
    },
    {
        "King of the Belgians": "king of the belgians"
    },
    {
        " following ": null
    },
    {
        "the countrys independence": "belgian revolution"
    },
    {
        " in 42 He reigned between July 42 and December 42     Born into the ruling family of the small German duchy of ": null
    },
    {
        "Saxe-Coburg-Saalfeld": "saxe-coburg-saalfeld"
    },
    {
        ", Leopold took a commission in the ": null
    },
    {
        "Imperial Russian Army": "imperial russian army"
    },
    {
        " and fought against ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " after French troops overran Saxe-Coburg during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ". After Napoleons defeat, Leopold moved to the ": null
    },
    {
        "United Kingdom": "united kingdom of great britain and ireland"
    },
    {
        " where he married ": null
    },
    {
        "Princess Charlotte of Wales": "princess charlotte of wales"
    },
    {
        ", who was second in line to the British throne and the only legitimate child of the ": null
    },
    {
        "Prince Regent": "george iv of the united kingdom"
    },
    {
        " . Charlotte died after only a year of marriage, but Leopold continued to enjoy considerable status in Britain.     After the ": null
    },
    {
        "Greek War of Independence": "greek war of independence"
    },
    {
        " , Leopold was offered the ": null
    },
    {
        "crown of Greece": "list of kings of greece"
    },
    {
        " but turned it down, believing it to be too precarious. Instead, Leopold accepted the kingship of the newly established ": null
    },
    {
        "Kingdom of Belgium": "belgian revolution"
    },
    {
        " in 42 The Belgian government offered the position to Leopold because of his diplomatic connections with royal houses across Europe, and because as the British-backed candidate, he was not affiliated with other powers, such as France, which were believed to have territorial ambitions in Belgium which might threaten ": null
    },
    {
        "the European balance of power": "concert of europe"
    },
    {
        " created by the 42 ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        ".     Leopold took his oath as King of the Belgians on 42 July 42 an event commemorated annually as ": null
    },
    {
        "Belgian National Day": "belgian national day"
    },
    {
        ". His reign was marked by attempts by the Dutch to recapture Belgium and, later, by internal political division between liberals and Catholics. As a ": null
    },
    {
        "Protestant": "lutheranism"
    },
    {
        ", Leopold was considered liberal and encouraged economic modernisation, playing an important role in encouraging the creation of ": null
    },
    {
        "Belgiums first railway": "history of rail transport in belgiumfirst railways"
    },
    {
        " in 42 and subsequent ": null
    },
    {
        "industrialisation": "industrial revolution"
    },
    {
        ". As a result of the ambiguities in the ": null
    },
    {
        "Belgian Constitution": "constitution of belgium"
    },
    {
        ", Leopold was able to slightly expand the monarchs powers during his reign. He also played an important role in stopping the spread of the ": null
    },
    {
        "Revolutions of 42": "revolutions of 1848"
    },
    {
        " into Belgium. He died in 42 and was succeeded by his son, ": null
    },
    {
        "Leopold II": "leopold ii of belgium"
    },
    {
        ".          Leopold was born in ": null
    },
    {
        "Coburg": "coburg"
    },
    {
        " in the tiny German duchy of ": null
    },
    {
        "Saxe-Coburg-Saalfeld": "saxe-coburg-saalfeld"
    },
    {
        " in modern-day ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        " on 42 December 42 He was the youngest son of ": null
    },
    {
        "Francis, Duke of Saxe-Coburg-Saalfeld": "francis, duke of saxe-coburg-saalfeld"
    },
    {
        ", and Countess ": null
    },
    {
        "Augusta Reuss-Ebersdorf": "augusta reuss-ebersdorf"
    },
    {
        ". In 42 Saxe-Coburg acquired the city of ": null
    },
    {
        "Gotha": "gotha"
    },
    {
        " from the neighboring Duchy of ": null
    },
    {
        "Saxe-Gotha-Altenburg": "saxe-gotha-altenburg"
    },
    {
        " and gave up ": null
    },
    {
        "Saalfeld": "saalfeld"
    },
    {
        " to ": null
    },
    {
        "Saxe-Meiningen": "saxe-meiningen"
    },
    {
        ", becoming ": null
    },
    {
        "Saxe-Coburg and Gotha": "saxe-coburg and gotha"
    },
    {
        ".       In 42 at just six years old, Leopold was given an honorary commission of the rank of ": null
    },
    {
        "colonel": "colonel"
    },
    {
        " in the ": null
    },
    {
        "Izmaylovsky Regiment": "izmaylovsky regiment"
    },
    {
        ", part of the ": null
    },
    {
        "Imperial Guard": "imperial guard"
    },
    {
        ", in the ": null
    },
    {
        "Imperial Russian Army": "imperial russian army"
    },
    {
        ". Six years later, he received a promotion to the rank of ": null
    },
    {
        "Major General": "major general"
    },
    {
        ".     When French troops occupied the Duchy of Saxe-Coburg in 42 during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", Leopold went to Paris where he became part of the Imperial Court of ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ". Napoleon offered him the position of adjutant, but Leopold refused. Instead, he went to Russia to take up a military career in the Imperial Russian cavalry, which was at war with France at the time. He campaigned against Napoleon and distinguished himself at the ": null
    },
    {
        "Battle of Kulm": "battle of kulm"
    },
    {
        " at the head of his  cuirassier  division. By 42 the time of the final defeat of Napoleon, he had reached the rank of ": null
    },
    {
        "lieutenant general": "lieutenant general"
    },
    {
        " at only 42 years of age.          Leopold received ": null
    },
    {
        "British citizenship": "british nationality law"
    },
    {
        " in 42 On 42 May 42 Leopold married ": null
    },
    {
        "Princess Charlotte of Wales": "princess charlotte of wales"
    },
    {
        " at ": null
    },
    {
        "Carlton House": "carlton house, london"
    },
    {
        " in London. Charlotte was the only legitimate child of the ": null
    },
    {
        "Prince Regent George": "george iv of the united kingdom"
    },
    {
        " and therefore second ": null
    },
    {
        "in line to the British throne": "list of heirs to the british throne"
    },
    {
        ". Charlotte had been engaged to ": null
    },
    {
        "the Prince of Orange": "william ii of the netherlands"
    },
    {
        ", but finding him distasteful, broke it off in favour of Leopold. The Prince Regent was displeased, but found Leopold to be charming and possessing every quality to make his daughter happy, thus approving of their marriage. The same year he received an honorary commission to the rank of ": null
    },
    {
        "Field Marshal": "field marshal"
    },
    {
        " and Knight of the ": null
    },
    {
        "Order of the Garter": "order of the garter"
    },
    {
        ". On 42 November 42 after having suffered a miscarriage, Princess Charlotte gave birth to a ": null
    },
    {
        "stillborn": "stillbirth"
    },
    {
        " son. She herself died the next day following complications. Leopold was said to have been heartbroken by her death.     Had Charlotte survived, she would have become ": null
    },
    {
        "queen of the United Kingdom": "queen of the united kingdom"
    },
    {
        " on the death of her father and Leopold presumably would have assumed the role of ": null
    },
    {
        "prince consort": "prince consort"
    },
    {
        ", later taken by his nephew ": null
    },
    {
        "Prince Albert of Saxe-Coburg and Gotha": "prince albert of saxe-coburg and gotha"
    },
    {
        ". Despite Charlottes death, the Prince Regent granted Prince Leopold the British style of  Royal Highness  by ": null
    },
    {
        "Order in Council": "order in council"
    },
    {
        " on 42 April 42      From 42 to 42 Leopold had an affair with the actress ": null
    },
    {
        "Caroline Bauer": "caroline bauer"
    },
    {
        ", who bore a striking resemblance to Charlotte. Caroline was a cousin of his advisor ": null
    },
    {
        "Baron Christian Friedrich von Stockmar": "christian friedrich, baron stockmar"
    },
    {
        ". She came to England with her mother and took up residence at Longwood House, a few miles from ": null
    },
    {
        "Claremont House": "claremont house"
    },
    {
        ". But, by mid42 the liaison was over, and the actress and her mother returned to Berlin. Many years later, in memoirs published after her death, she declared that she and Leopold had engaged in a ": null
    },
    {
        "morganatic marriage": "morganatic marriage"
    },
    {
        " and that he had bestowed upon her the title of Countess Montgomery. He would have broken this marriage when the possibility arose that he could become ": null
    },
    {
        "King of Greece": "king of greece"
    },
    {
        ". K. BAUER, Aus meinem Bühnenleben. Erinnerungen von Karoline Bauer, Berlin, 42–42 The son of Baron Stockmar denied that these events ever happened, and indeed no records have been found of a civil or religious marriage with the actress. E. VON STOCKMAR, Denkwürdigkeiten aus den Papiere des Freihernn Christian Friedrich von Stockmar, Brunswick, 42 ; R. VON WANGENHEIM, Baron Stockmar. Eine coburgisch-englische Geschichte, Coburg, 42       Following a ": null
    },
    {
        "Greek rebellion": "greek war of independence"
    },
    {
        " against the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", Leopold was offered the throne of an independent Greece as part of the ": null
    },
    {
        "London Protocol of February 42": "london protocol"
    },
    {
        ". Though initially showing interest in the position, Leopold eventually turned down the offer on 42 May 42 The role would subsequently be accepted by ": null
    },
    {
        "Otto of Wittelsbach": "otto of greece"
    },
    {
        " in May 42 who ruled until he was finally deposed in October 42             At the end of August 42 rebels in the ": null
    },
    {
        "Southern provinces": "southern netherlands"
    },
    {
        "  of the ": null
    },
    {
        "United Netherlands": "united kingdom of the netherlands"
    },
    {
        " rose up against Dutch rule. The rising, which began in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", pushed the Dutch army back, and the rebels defended themselves against a Dutch attack. International powers ": null
    },
    {
        "meeting in London": "london conference of 1830"
    },
    {
        " agreed to support the independence of Belgium, even though the Dutch refused to recognize the new state.     In November 42 a ": null
    },
    {
        "National Congress": "national congress of belgium"
    },
    {
        " was established in Belgium to create a constitution for the new state. Fears of ": null
    },
    {
        "mob rule": "ochlocracy"
    },
    {
        " associated with republicanism after the ": null
    },
    {
        "French Revolution of 42": "french revolution"
    },
    {
        ", as well as the example of the recent, liberal ": null
    },
    {
        "July Revolution": "july revolution"
    },
    {
        " in France, led the Congress to decide that Belgium would be a ": null
    },
    {
        "popular": "popular monarchy"
    },
    {
        ", ": null
    },
    {
        "constitutional monarchy": "constitutional monarchy"
    },
    {
        ".       The choice of candidates for the position was one of the most controversial issues faced by the revolutionaries. The Congress refused to consider any candidate from the Dutch ruling house of ": null
    },
    {
        "Orange-Nassau": "house of orange-nassau"
    },
    {
        ". Some ": null
    },
    {
        "Orangists": "orangism"
    },
    {
        " had hoped to offer the position to ": null
    },
    {
        "King William I": "william i of the netherlands"
    },
    {
        " or his son, ": null
    },
    {
        "William, Prince of Orange": "william ii of the netherlands"
    },
    {
        ", which would bring Belgium into ": null
    },
    {
        "personal union": "personal union"
    },
    {
        " with the Netherlands like Luxembourg. The ": null
    },
    {
        "Great Power": "great power"
    },
    {
        "s also worried that a candidate from another state could risk destabilizing the ": null
    },
    {
        "international balance of power": "balance of power"
    },
    {
        " and lobbied for a neutral candidate.     Eventually the Congress was able to draw up a shortlist. The three viable possibilities were felt to be ": null
    },
    {
        "Eugène de Beauharnais": "eugène de beauharnais"
    },
    {
        ", a French nobleman and stepson of ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        "; ": null
    },
    {
        "Auguste of Leuchtenberg": "auguste de beauharnais"
    },
    {
        ", son of Eugene; and ": null
    },
    {
        "Louis, Duke of Nemours": "prince louis, duke of nemours"
    },
    {
        " who was the son of the French ": null
    },
    {
        "King Louis-Philippe": "louis-philippe of france"
    },
    {
        ". All the candidates were French and the choice between them was principally between choosing the ": null
    },
    {
        "Bonapartism": "bonapartism"
    },
    {
        " of Beauharnais or Leuchtenberg and supporting the ": null
    },
    {
        "July Monarchy": "july monarchy"
    },
    {
        " of Louis-Philippe. Louis-Philippe realized that the choice of either of the ": null
    },
    {
        "Bonapartist": "bonapartist"
    },
    {
        "s could be first stage of a ": null
    },
    {
        "coup": "coup"
    },
    {
        " against him, but that his son would also be unacceptable to other European powers suspicious of French intentions. Nemours refused the offer. With no definitive choice in sight, Catholics and Liberals united to elect ": null
    },
    {
        "Erasme Louis Surlet de Chokier": "erasme louis surlet de chokier"
    },
    {
        ", a minor Belgian nobleman, as ": null
    },
    {
        "regent": "regent"
    },
    {
        " to buy more time for a definitive decision in February 42        Leopold of Saxe-Coburg had been proposed at an early stage, but had been dropped because of French opposition. The problems caused by the French candidates and the increased international pressure for a solution led to his reconsideration. On 42 April, he was finally approached by a Belgian delegation at ": null
    },
    {
        "Marlborough House": "marlborough house"
    },
    {
        " to officially offer him the throne. Leopold, however, was reluctant to accept.       On 42 July 42 Leopold travelled from Calais to Belgium, entering the country at ": null
    },
    {
        "De Panne": "de panne"
    },
    {
        ". Travelling to Brussels, he was greeted with patriotic enthusiasm along his route. The accession ceremony took place on 42 July on the ": null
    },
    {
        "Place Royale": "place royale"
    },
    {
        " in Brussels. A stand had been erected on the steps of the church of ": null
    },
    {
        "Saint Jacques-sur-Coudenberg": "saint jacques-sur-coudenberg"
    },
    {
        ", surrounded by the names of revolutionaries fallen during the fighting in 42 After a ceremony of resignation by the regent, Leopold, dressed in the uniform of a Belgian lieutenant-general, swore loyalty to the constitution and became king.     The enthronement is generally used to mark the end of the revolution and the start of the Kingdom of Belgium and is celebrated each year as ": null
    },
    {
        "the Belgian national holiday": "belgian national day"
    },
    {
        ".                 Less than two weeks after Leopolds accession, on 42 August, the Netherlands invaded Belgium, starting the ": null
    },
    {
        "Ten Days Campaign": "ten days campaign"
    },
    {
        ". The small Belgian army was overwhelmed by the Dutch assault and was pushed back. Faced with a military crisis, Leopold appealed to the French for support. The French promised support, and the arrival of their  in Belgium forced the Dutch to accept a diplomatic mediation and retreat back to the pre-war border. Skirmishes continued for eight years, but in 42 the two countries signed the ": null
    },
    {
        "Treaty of London": "treaty of london"
    },
    {
        ", establishing Belgiums independence.     Leopold was generally unsatisfied with the amount of power allocated to the monarch in the Constitution, and sought to extend it wherever the Constitution was ambiguous or unclear while generally avoiding involvement in routine politics.          Leopold Is reign was also marked by an economic crisis which lasted until the late 42s. In the aftermath of the revolution, the Dutch had closed the ": null
    },
    {
        "Scheldt": "scheldt"
    },
    {
        " to Belgian shipping, meaning that the port of ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " was effectively useless. The Netherlands and the Dutch colonies in particular, which had been profitable markets for Belgian manufacturers before 42 were totally closed to Belgian goods. The period between 42 and 42 was particularly hard in Flanders, where harvests failed and a third of the population became dependent on poor relief, and have been described as the worst years of Flemish history . The economic situation in Flanders also increased the internal migration to Brussels and the industrial areas of ": null
    },
    {
        "Wallonia": "wallonia"
    },
    {
        ", which continued throughout the period.     Politics in Belgium under Leopold I were polarized between ": null
    },
    {
        "liberal": "liberalism"
    },
    {
        " and ": null
    },
    {
        "Catholic": "political catholicism"
    },
    {
        " political factions, though before 42 they collaborated in ": null
    },
    {
        "Unionist": "unionism in belgium"
    },
    {
        " governments. The liberals were opposed to the Churchs influence in politics and society, while supporting ": null
    },
    {
        "free trade": "free trade"
    },
    {
        ", personal liberties and ": null
    },
    {
        "secularization": "secularization"
    },
    {
        ". The Catholics wanted religious teachings to be a fundamental basis for the state and society and opposed all attempts by the liberals to attack the Churchs official privileges. Initially, these factions existed only as informal groups with which prominent politicians were generally identified. The liberals held power through much of Leopold Is reign. An official ": null
    },
    {
        "Liberal Party": "liberal party"
    },
    {
        " was formed in 42 although a formal ": null
    },
    {
        "Catholic Party": "catholic party"
    },
    {
        " was only established in 42 Leopold, who was himself a Protestant, tended to favor liberals and shared their desire for reform, even though he was not partisan. On his own initiative, in 42 Leopold proposed a law which would have stopped women and children from working in some industries, but the bill was defeated. Leopold was an early supporter of ": null
    },
    {
        "railway": "railway"
    },
    {
        "s, and Belgiums first stretch of this railway, between northern Brussels and ": null
    },
    {
        "Mechelen": "mechelen"
    },
    {
        ", was completed in 42 When completed, it was one of the first passenger railways in ": null
    },
    {
        "continental Europe": "continental europe"
    },
    {
        ".          The success of economic reforms partially mitigated the effects of the economic downturn and meant that Belgium was not as badly affected as its neighbors by the ": null
    },
    {
        "Revolutions of 42": "revolutions of 1848"
    },
    {
        ". Nevertheless, in early 42 a large number of radical publications appeared. The most serious threat of the 42 revolutions in Belgium was posed by Belgian ": null
    },
    {
        "émigré": "émigré"
    },
    {
        " groups. Shortly after the ": null
    },
    {
        "revolution in France": "french revolution of 1848"
    },
    {
        ", Belgian migrant workers living in Paris were encouraged to return to Belgium to overthrow the monarchy and establish a republic. Around 42 armed émigrés of the ": null
    },
    {
        "Belgian Legion": "belgian legionfrench revolution of 1848"
    },
    {
        " attempted to cross the Belgian frontier. The first group, travelling by train, was stopped and quickly disarmed at ": null
    },
    {
        "Quiévrain": "quiévrain"
    },
    {
        " on 42 March 42 The second group crossed the border on 42 March and headed for Brussels. They were confronted by Belgian troops at the hamlet of ": null
    },
    {
        "Risquons-Tout": "risquons-tout"
    },
    {
        " and, during fighting, seven émigrés were killed and most of the rest were captured. To defuse tension, Leopold theatrically offered his abdication, if this was the wish of the majority of his people.     The defeat at Risquons-Tout effectively ended the revolutionary threat to Belgium, as the situation in Belgium began to recover that summer after a good harvest, and ": null
    },
    {
        "fresh elections": "1848 belgian general election"
    },
    {
        " returned a strong Liberal majority.          Because of his family connections and position at the head of a neutral and unthreatening power, Leopold was able to act as an important intermediary in ": null
    },
    {
        "European politics": "politics of europe"
    },
    {
        " during his reign. As a result of this, he earned the nickname the ": null
    },
    {
        "Nestor": "nestor"
    },
    {
        " of Europe , after the wise mediator in ": null
    },
    {
        "Homer": "homer"
    },
    {
        "s  Iliad . Leopold played a particularly important role in moderating relations between the hostile ": null
    },
    {
        "Great Powers": "concert of europe"
    },
    {
        ". In the later part of his reign, his role in managing relations between Great Britain and the ": null
    },
    {
        "French Empire": "french second empire"
    },
    {
        " of ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " was particularly important.     Leopold was particularly known as a political ": null
    },
    {
        "marriage broker": "matchmaking"
    },
    {
        ". Béeche. Arturo E. The Coburgs of Europe. Eurohistory. 42 pp. ii, 42 42 4242  He promoted the marriage of his niece, ": null
    },
    {
        "Queen Victoria of the United Kingdom": "queen victoria of the united kingdom"
    },
    {
        ", to his nephew, ": null
    },
    {
        "Prince Albert of Saxe-Coburg and Gotha": "albert, prince consort"
    },
    {
        ". Even before she succeeded to the throne, Leopold had been advising Victoria by letter, and continued to influence her after her accession.     In foreign policy, Leopolds principal object was the maintenance of ": null
    },
    {
        "Belgian neutrality": "political neutralityformerly neutral"
    },
    {
        ". Despite pressure from the Great Powers, especially over the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        " , Belgium remained neutral throughout the reigns of Leopold I and II.            Leopold married ": null
    },
    {
        "Louise-Marie of Orléans": "louise of orléans"
    },
    {
        "  on 42 August 42 They had four children:     ": null
    },
    {
        "Louis Philippe, Crown Prince of Belgium": "louis philippe, crown prince of belgium"
    },
    {
        " who died in infancy.   ": null
    },
    {
        "Leopold, Duke of Brabant": "leopold ii of belgium"
    },
    {
        " , the future King Leopold II, who married ": null
    },
    {
        "Archduchess Marie-Henriette of Austria": "queen marie-henriette"
    },
    {
        " on 42 August 42 They had four children. He religiously but not civilly remarried ": null
    },
    {
        "Caroline Lacroix": "caroline lacroix"
    },
    {
        ", which made the marriage unrecognized by law, on 42 December 42 on his deathbed. They had two illegitimate sons.   ": null
    },
    {
        "Prince Philippe, Count of Flanders": "prince philippe, count of flanders"
    },
    {
        " who married ": null
    },
    {
        "Princess Marie of Hohenzollern": "princess marie of hohenzollern"
    },
    {
        " on 42 April 42 They had five children.   ": null
    },
    {
        "Princess Charlotte of Belgium": "carlota of mexico"
    },
    {
        " , the future ": null
    },
    {
        "Empress of Mexico": "empress of mexico"
    },
    {
        ", who married ": null
    },
    {
        "Maximilian I of Mexico": "maximilian i of mexico"
    },
    {
        " on 42 July 42 and had no issue. She adopted two sons.     Queen Louise-Marie died of tuberculosis on 42 October 42 aged 42     Leopold also had two sons, George and Arthur, by his mistress Arcadie Meyer .   ": null
    },
    {
        "George": ":fr:georges-frédéric von eppinghoven"
    },
    {
        " von Eppinghoven was born in 42 and ": null
    },
    {
        "Arthur von Eppinghoven": ":fr:arthur von eppinghoven"
    },
    {
        " in 42 At Leopolds request, in 42 his two sons were created Freiherr von Eppinghoven by his nephew, ": null
    },
    {
        "Ernest II, Duke of Saxe-Coburg and Gotha": "ernest ii, duke of saxe-coburg and gotha"
    },
    {
        "; in 42 Arcadie was also created as Baronin von Eppinghoven.        Leopold died in ": null
    },
    {
        "Laeken": "laeken"
    },
    {
        " near Brussels on 42 December 42 aged 42  His funeral was held on 42 December. He is interred in the ": null
    },
    {
        "Royal Crypt": "royal crypt"
    },
    {
        " at the ": null
    },
    {
        "Church of Notre-Dame de Laeken": "church of our lady of laeken"
    },
    {
        ", next to Louise-Marie. He was succeeded by his son, Leopold II, aged 42 who ruled until 42         Belgian naval vessels named in his honour include the  Leopold I , a frigate acquired by Belgium in 42 His ": null
    },
    {
        "monogram": "royal monogram"
    },
    {
        " features on the flag of the Flemish town of ": null
    },
    {
        "Leopoldsburg": "leopoldsburg"
    },
    {
        ". His likeness has also appeared on postage stamps and commemorative coins issued since his death.        His Serene Highness Prince Leopold of Saxe-Coburg-Saalfeld, Duke of Saxony   42 April 42 – 42 November 42: His Royal Highness Prince Leopold of Saxe-Coburg-Saalfeld, Duke of Saxony   42 November 42 – 42 July 42: His Royal Highness Prince Leopold of Saxe-Coburg and Gotha, Duke of Saxony   42 July 42 – 42 December 42: His Majesty The King of the Belgians       ;National decorations    ": null
    },
    {
        "Royal Order of Leopold": "order of leopold"
    },
    {
        ", Founder and Grand Master, 42 July 42     ;Foreign decorations                 ": null
    }
]