[
    {
        "        Les Misérables is a 42 American drama film starring ": null
    },
    {
        "Fredric March": "fredric march"
    },
    {
        " and ": null
    },
    {
        "Charles Laughton": "charles laughton"
    },
    {
        " based upon the famous ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        " novel of the same name": "les misérables"
    },
    {
        ". The movie was adapted by ": null
    },
    {
        "W. P. Lipscomb": "w. p. lipscomb"
    },
    {
        " and directed by ": null
    },
    {
        "Richard Boleslawski": "richard boleslawski"
    },
    {
        ". This was the last film for ": null
    },
    {
        "Twentieth Century Pictures": "twentieth century pictures"
    },
    {
        " before it merged with ": null
    },
    {
        "Fox Film Corporation": "fox film"
    },
    {
        " to form ": null
    },
    {
        "42th Century Fox": "20th century fox"
    },
    {
        ". The plot of the film basically follows Hugos novel  Les Misérables , but there are many differences.     The film was nominated for the ": null
    },
    {
        "Oscar": "academy awards"
    },
    {
        " for ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        ", the ": null
    },
    {
        "Academy Award for Best Assistant Director": "academy award for best assistant director"
    },
    {
        ", the ": null
    },
    {
        "Academy Award for Best Cinematography": "academy award for best cinematography"
    },
    {
        ", and the ": null
    },
    {
        "Academy Award for Best Film Editing": "academy award for best film editing"
    },
    {
        ". The ": null
    },
    {
        "National Board of Review": "national board of review awards 1935"
    },
    {
        " named the film the sixth best of 42        ": null
    },
    {
        "Fredric March": "fredric march"
    },
    {
        " as ": null
    },
    {
        "Jean Valjean": "jean valjean"
    },
    {
        "/": null
    },
    {
        "Champmathieu": "champmathieu"
    },
    {
        " Charles Laughton": "charles laughton"
    },
    {
        " as ": null
    },
    {
        "Inspector Émile Javert": "javert"
    },
    {
        " Cedric Hardwicke": "cedric hardwicke"
    },
    {
        " as ": null
    },
    {
        "Bishop Myriel": "bishop myriel"
    },
    {
        " Rochelle Hudson": "rochelle hudson"
    },
    {
        " as ": null
    },
    {
        "Cosette": "cosette"
    },
    {
        " Marilyn Knowlden": "marilyn knowlden"
    },
    {
        " as Young Cosette   ": null
    },
    {
        "Florence Eldridge": "florence eldridge"
    },
    {
        " as ": null
    },
    {
        "Fantine": "fantine"
    },
    {
        " John Beal": "john beal"
    },
    {
        " as ": null
    },
    {
        "Marius": "marius pontmercy"
    },
    {
        " Frances Drake": "frances drake"
    },
    {
        " as ": null
    },
    {
        "Éponine": "éponine"
    },
    {
        " Ferdinand Gottschalk": "ferdinand gottschalk"
    },
    {
        " and Jane Kerr as the ": null
    },
    {
        "Thénardiers": "thénardiers"
    },
    {
        " Vernon Downing": "vernon downing"
    },
    {
        " as Brissac   ": null
    },
    {
        "Leonid Kinskey": "leonid kinskey"
    },
    {
        " as Genflou   ": null
    },
    {
        "Ian Maclaren": "ian maclaren"
    },
    {
        " as Head Gardener   ": null
    },
    {
        "John Carradine": "john carradine"
    },
    {
        " as ": null
    },
    {
        "Enjolras": "enjolras"
    },
    {
        " Heinie Conklin": "heinie conklin"
    },
    {
        " as Drunk at Inn   ": null
    },
    {
        "Harry Cording": "harry cording"
    },
    {
        " as Beam Warder   ": null
    },
    {
        "Olaf Hytten": "olaf hytten"
    },
    {
        " as Pierre       This adaptation made quite a lot of changes, many of which can also be found in later adaptations:   Valjeans trial, life as a convict and release are presented chronologically, whereas in the novel his previous life is presented in flashback. In addition, the novel begins by introducing the bishop, while in the film he does not appear until Valjean arrives at his door.   The film begins with Valjean being sentenced in 42 for ten years, rather than in 42 for five years.   While the word galleys was still used until the late 42th century to designate the French ": null
    },
    {
        "Bagnio": "bagnio"
    },
    {
        "s, the actual penalty of ": null
    },
    {
        "sending someone to the galleys": "galley slave"
    },
    {
        " was abolished in mid42th century. The galleys portrayed in this film are a huge ": null
    },
    {
        "anachronism": "anachronism"
    },
    {
        ".   In the film, Javert is shown being assigned to the galleys, and seeing Valjeans display of strength at the beginning. In the novel he is not introduced until after Valjean has become mayor.   Javerts first name is given as Émile, while in the novel it is never given.   In the film, Valjeans prison number is 42 while in the novel it is 42   In the novel, Javert is described as a tall man, with a small head, sunken eyes, large sideburns and long hair hanging over his eyes, which differs greatly from ": null
    },
    {
        "Charles Laughton": "charles laughton"
    },
    {
        "s appearance, and his version of Javert in the film wears different clothes than in the novel.   Valjean is released after the 42-year sentence, despite mention of an escape attempt. In the novel he spends 42 years in prison, having been given extra time for trying to escape. He still receives a yellow passport, branding him a violent man for his attempts, however.   In the film, there is no mention of Fantine selling her hair and teeth, or becoming a prostitute, to afford her payments to the Thénardiers. When she confronts Valjean, she does appear to be dressed like a prostitute, but neither Valjean nor Javert make any reference to her clothing.   Valjean brings Cosette to Fantine before Fantine dies, while in the novel he does not fulfill this pledge to Fantine until on his own deathbed.   The Thénardiers inn is called The Sergeant at Waterloo in the novel, but is called The Brave Sergeant in the film.   In the novel, Valjean pays Thénardier 42 francs to settle Fantines debts and takes Cosette, the Thénardiers appear in Paris several years later. No discussion regarding Valjeans intentions takes place in the film; after speaking with Cosette alone, Valjean is seen riding away with her and the Thénardiers are not seen again.   In the novel, only three prisoners identify ": null
    },
    {
        "Champmathieu": "les misérablesminor"
    },
    {
        " as being Valjean, in court. The film adds a fourth convict, Genflou, to the witnesses.   In the film Valjean and Cosette go to the convent with a letter of introduction from M. Madeleine, whereas in the novel they came upon the convent purely coincidentally while fleeing from Javert.   We see Valjean rescue a man whose cart had fallen on him, which arouses Javerts suspicion, but the film does not mention that this man  and the gardener at the convent are the same person.   Marius meets Valjean and Cosette while they ride into the park where he is giving a speech, while in the novel he is simply walking in the ": null
    },
    {
        "Luxembourg Garden": "luxembourg garden"
    },
    {
        " when he sees them.   Éponines role is changed from the novel. In the film, she is the secretary of the revolutionary society Marius belongs to. In the novel, she is the Thénardiers daughter, and is not connected to the revolutionary society. The film makes no mention of her being the Thénardiers daughter.   ": null
    },
    {
        "Gavroche": "gavroche"
    },
    {
        " is cut entirely.   In the novel, Enjolras is the leader of the revolutionaries and Marius is not even a very faithful follower . In the film, Marius is the leader. In addition, the students goal is not a democracy but to better the conditions in the French galleys. Marius says himself: We are not revolutionaries.   In the film, Éponine delivers the message from Marius to Cosette, which Valjean intercepts, causing Valjean to come to the barricade to rescue Marius. In the novel, Gavroche delivers it.   In the film, Javert pursues Valjean and Marius into the sewers, which he does not in the novel, although he does meet Valjean when he exits the sewers, having pursued Thénardier there.   Valjean brings Marius to Valjeans house and Cosette, while in the novel Valjean brings Marius to the house of Marius grandfather ": null
    },
    {
        "M. Gillenormand": "les misérablesminor"
    },
    {
        ", who does not appear in the film. Also, while Valjean thinks Javert is waiting for him and he is going away, he gives Marius and Cosette instructions, including to love each other always and leaving the candlesticks to Cosette, which in the novel appear in his deathbed scene.   In the film, Valjean hides the fact that he expects Javert to arrest him by telling Cosette and Marius that he is still moving to the ": null
    },
    {
        "United Kingdom": "united kingdom"
    }
]