[
    {
        "Leto II Atreides  is a ": null
    },
    {
        "fictional character": "fictional character"
    },
    {
        " from the ": null
    },
    {
        "Dune universe": "dune"
    },
    {
        " created by ": null
    },
    {
        "Frank Herbert": "frank herbert"
    },
    {
        ". Born at the end of  Dune Messiah  , Leto is a central character in  Children of Dune  and is the title character of  God Emperor of Dune  . The character is brought back as a ": null
    },
    {
        "ghola": "ghola"
    },
    {
        " in the ": null
    },
    {
        "Brian Herbert": "brian herbert"
    },
    {
        "/": null
    },
    {
        "Kevin J. Anderson": "kevin j. anderson"
    },
    {
        " sequel": "sequel"
    },
    {
        "s which conclude the original series,  Hunters of Dune  and  Sandworms of Dune  . Leto also appears as a child in the ": null
    },
    {
        "prequel": "prequel"
    },
    {
        "  The Winds of Dune  .     Leto is the son of ": null
    },
    {
        "Paul Atreides": "paul atreides"
    },
    {
        " and his ": null
    },
    {
        "Fremen": "fremen"
    },
    {
        " concubine": "concubinage"
    },
    {
        " Chani": "chani"
    },
    {
        ", and the twin brother of ": null
    },
    {
        "Ghanima": "ghanima atreides"
    },
    {
        ". Leto is named for his paternal grandfather Duke ": null
    },
    {
        "Leto I Atreides": "leto i atreides"
    },
    {
        ", who is killed in the ": null
    },
    {
        "Harkonnen": "house harkonnen"
    },
    {
        " invasion of the ": null
    },
    {
        "desert planet": "desert planet"
    },
    {
        " Arrakis": "arrakis"
    },
    {
        " during the events of  Dune  . Leto II is the second child of Paul to bear that name, the first having been killed as an infant by the Emperors ": null
    },
    {
        "Sardaukar": "sardaukar"
    },
    {
        " in Dune.     Leto is portrayed by ": null
    },
    {
        "James McAvoy": "james mcavoy"
    },
    {
        " in the 42 ": null
    },
    {
        "miniseries": "miniseries"
    },
    {
        "  Frank Herberts Children of Dune .     Dune Messiah ": null
    },
    {
        "Ghanima": "ghanima atreides"
    },
    {
        " near the end of Dune Messiah. Blinded by the blast of a ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        " called a ": null
    },
    {
        "stone burner": "stone burner"
    },
    {
        ", Paul is at a disadvantage when the ": null
    },
    {
        "Tleilaxu": "tleilaxu"
    },
    {
        " Face Dancer": "face dancer"
    },
    {
        " Scytale": "scytale"
    },
    {
        " holds a knife over the newborns and threatens their death if Paul does not surrender his Empire to the Tleilaxu. Paul suddenly finds that he is able to see through the eyes of the infant Leto, allowing him to aim and throw a ": null
    },
    {
        "crysknife": "crysknife"
    },
    {
        " that kills Scytale.     Children of Dune Children of Dune, Leto and Ghanima are nine years old. Because of the ": null
    },
    {
        "melange": "melange"
    },
    {
        " ingested by their mother, which causes unusual effects for the ": null
    },
    {
        "Atreides": "house atreides"
    },
    {
        " bloodline, the twins are ": null
    },
    {
        "pre-born": "pre-born"
    },
    {
        " , meaning that as fetuses they had been awakened to consciousness and to their ": null
    },
    {
        "genetic memories": "genetic memory"
    },
    {
        "; they had been born as fully matured human beings in the bodies of infants. At the start of the novel, Leto is not ": null
    },
    {
        "prescient": "prescience"
    },
    {
        " to the degree that his father Paul had been, but he senses the test his father had faced — to embrace a prescient vision of the universe is to set the universe on that path, a terrible responsibility that comes with terrible power. At the end of Dune Messiah, Paul had forsaken that responsibility by walking into the desert — his time as the ": null
    },
    {
        "Fremen": "fremen"
    },
    {
        " messiah": "messiah"
    },
    {
        " had shown him that he was not strong enough to be messiah/tyrant to the universe. Leto believes that he must face the same test.     At the same time, the Imperium created by Paul is ruled by his sister ": null
    },
    {
        "Alia Atreides": "alia atreides"
    },
    {
        " as regent. The horror of the pre-born — the reason the ": null
    },
    {
        "Bene Gesserit": "bene gesserit"
    },
    {
        " call them ": null
    },
    {
        "abominations": "abomination"
    },
    {
        " — is that they are easily possessed by the ego-memories of their ancestors. When Bene Gesserit awaken to their other memories in the rite of the ": null
    },
    {
        "spice agony": "spice agony"
    },
    {
        ", they are adults with fully formed personalities, and can withstand the inner assault of their forebears; the pre-born have no such defense. Like Leto and Ghanima, Alia had been pre-born, and she succumbs to the pressure under an intense dose of spice. Among her ancestors is the ": null
    },
    {
        "Baron Vladimir Harkonnen": "vladimir harkonnen"
    },
    {
        ", still hungry for revenge against his enemies, the Atreides. Alia is possessed by him, and unconsciously turns against the Atreides empire, plotting to kill Leto and Ghanima and to tear down the Imperium in a bloody civil war.     Independently, Leto and Ghanima both solve the problem of the pre-born. Leto constructs his own personality out of an executive committee of his ancestors; with all possessing him, none can possess him individually. Following an assassination attempt by ": null
    },
    {
        "House Corrino": "house corrino"
    },
    {
        ", Leto disappears into the desert leaving Ghanima behind. As part of Letos plan, Ghanima hypnotizes herself to believe that Leto had been killed. The intense mental discipline needed for this self-deception builds a safe haven in Ghanimas mind for her own personality to safely develop, with the spirit of Chani acting as a guardian.     Leto finds Jacurutu, a ": null
    },
    {
        "sietch": "sietch"
    },
    {
        " that has been forbidden to anyone by Fremen law. There he faces the test his father had refused to take, and embraces prescience, its visions, its attendant power, and the terrible price it will extract — to follow his vision, Leto will become a ": null
    },
    {
        "symbiote": "symbiosis"
    },
    {
        " with the ": null
    },
    {
        "sandworm": "sandworm"
    },
    {
        ", setting the universe on the ": null
    },
    {
        "Golden Path": "golden path"
    },
    {
        ", a future in which humanitys survival is assured. After consuming massive amounts of spice, he allows many ": null
    },
    {
        "sandtrout": "sandtrout"
    },
    {
        " to cover his body, the concentration of spice in his blood fooling the creatures:        This layer gives Leto tremendous strength and speed, acting as a living ": null
    },
    {
        "powered exoskeleton": "powered exoskeleton"
    },
    {
        " and also protection from mature sandworms, who mistake his sandtrout-covered body for a lethal mass of water. He calls it a living, self-repairing ": null
    },
    {
        "stillsuit": "stillsuit"
    },
    {
        " of a sandtrout membrane, and soon notes that he is no longer human. Leto returns to wrest the Imperium from Alia and take his rightful place as Emperor.     God Emperor of Dune    A little more than 42 years have passed, and in God Emperor of Dune, Leto is now almost fully transformed into a sandworm. He is almost invulnerable to physical damage; only his face is susceptible to injury, and his single greatest weakness that he shares with the sandworms, an intense vulnerability to water, is a secret. Letos peace has kept the universe quiet for that time, and the entirety of human society has become an audience for him. He is their emperor; he is their god. His all-female army of ": null
    },
    {
        "Fish Speakers": "fish speakers"
    },
    {
        " keeps order and act as priestesses. Leto believes that a female army is a nurturing disciplinarian, while a male army is essentially predatory, always turns against its civilian support base in the absence of an enemy, and has a strong tendency toward homosexual activities .      Desolate Dune is gone; Arrakis is now a verdant planet with a great river named after ": null
    },
    {
        "Duncan Idaho": "duncan idaho"
    },
    {
        ". Except for Leto, the sandworms are extinct, and all that is left of the ocean without water , bahr bela ma, is a desert preserve set aside for Leto alone. This remnant is called the Sareer and is about the size of ": null
    },
    {
        "California": "california"
    },
    {
        ". The old institutions, the Bene Gesserit, the ": null
    },
    {
        "Bene Tleilax": "bene tleilax"
    },
    {
        ", the ": null
    },
    {
        "Spacing Guild": "spacing guild"
    },
    {
        ", the houses Major and Minor, the ": null
    },
    {
        "Landsraad": "landsraad"
    },
    {
        ", the technocrats of ": null
    },
    {
        "Ix": "ix"
    },
    {
        ", and ": null
    },
    {
        "CHOAM": "choam"
    },
    {
        ", have all faded from power in the face of Letos ": null
    },
    {
        "hydraulic despotism": "hydraulic despotism"
    },
    {
        ": since he has absolute control of the spice on which the whole universe depends, he has the universe in the palm of his hand, and ruthlessly enforces his simplistic order.     Leto has taken over the Bene Gesserits ": null
    },
    {
        "breeding program": "bene gesseritbreeding program"
    },
    {
        " for himself, the same program that produced his father, the ": null
    },
    {
        "Kwisatz Haderach": "kwisatz haderach"
    },
    {
        ". His Golden Path is nearly assured now, and his long rule has begun to bore him; the trap of prescience is an existence without surprises. To ensure that humanity will survive, Leto has spent millennia enforcing quiescence on humanity: people rarely travel, rarely fight in wars, rarely do anything but live and worship him. This repression has created in humanity a deep and urgent need to explode upon the universe, scattering itself beyond the reach of any single tyrant. Leto seeks a solution in which he might die without destroying his people; if a god commits suicide, his worshippers would commit suicide with him. The only option is revolution, so Leto breeds for the person who will overthrow him: ": null
    },
    {
        "Siona Atreides": "siona atreides"
    },
    {
        ", the daughter of his ": null
    },
    {
        "majordomo": "majordomo"
    },
    {
        ", ": null
    },
    {
        "Moneo": "moneo atreides"
    },
    {
        ".     Siona is the second human to carry a gene that makes her invisible to prescience and thus uncontainable by it, the first being the ": null
    },
    {
        "Count Fenring": "count fenring"
    },
    {
        ", from the novel  Dune . Siona is different from Fenring in that she can pass on this gene to her descendants, whereas Fenring was a genetic eunuch. Since Siona cannot be seen in a vision, she cannot be controlled by a vision, nor can her descendants. Thus the tyranny of prescience will end with Siona — humanity can never again be bound by a powerful prescient like Muaddib or the God Emperor himself.     Sionas partner in revolution is ": null
    },
    {
        "Duncan Idaho": "duncan idaho"
    },
    {
        ", the constant companion of Leto throughout the long millennia. For his entire reign, Leto has had a ": null
    },
    {
        "ghola": "ghola"
    },
    {
        " of Duncan in charge of his Fish Speaker army. The Duncans represent the old Atreides loyalty, along with everything vital in humanity, so something in the Duncans always rebels against the holy blasphemy Leto has created; many Duncans die trying to kill Leto. When Siona finally arrives, she finds in Duncan a justification for revolt.     Meanwhile, the rest of the universe is scheming to kill Leto as well. The Bene Tleilax try many ham-fisted schemes; the technocrats of Ix are smarter. They craft a human to seduce Leto. First they create ": null
    },
    {
        "Malky": "malky"
    },
    {
        ", a being of perfect evil, a Devil to Letos God. Malky is a charming ": null
    },
    {
        "Lucifer": "lucifer"
    },
    {
        ", and as ambassador to Letos court he plumbs the depths of Letos piety. In  Dune Messiah , the ": null
    },
    {
        "Face Dancer": "face dancers"
    },
    {
        " Scytale": "scytale"
    },
    {
        " reveals to a ": null
    },
    {
        "Reverend Mother": "reverend mother"
    },
    {
        " that the Bene Tleilax created their own Kwisatz Haderachs, and discovered that Kwisatz Haderachs will die before becoming their opposites . Malkys purpose is to get Leto to turn on his holy creation, but he fails because what the Ixians dont realize is that Leto, more than anyone, knows the blasphemy he has created.     At the same time as Leto is breeding a psi-invisible human, Ix invents another solution: no-chambers. A ": null
    },
    {
        "no-chamber": "no-chamber"
    },
    {
        " is an electro-mechanical construct that hides its contents from prescient vision. Inside the first no-chamber, the Ixians grow their next attempt: Malkys niece, ": null
    },
    {
        "Hwi Noree": "hwi noree"
    },
    {
        ", who shall replace him as Ixs ambassador. Hwi is the opposite of Malky, a creature of pure goodness. Where Malky failed, Hwi succeeds. Leto falls in love with her, and plans to marry her. He is not alone in loving her, however, for his current Duncan has also fallen to her charms. By this chain of events, Leto weakens his godhood enough to allow Sionas revolt the possibility of success.     Leto planned to wed Hwi in what remains of an old Fremen village near the former Sietch Tabr, but changes his mind at the last instant to use the Museum Fremens Tuono Village, the place where Moneo had sent Siona and Duncan in an attempt to keep the peace and keep Duncan alive, safe from the God Emperors wrath. However, that is not to be.     The Royal Peregrination, the journey on foot for any of Letos trips, to Tuono has all the appearance of a normal trip. However, Siona and Duncan, both well aware of the God Emperors coming and his schemes to breed them, are primed for rebellion, not quiet acceptance. Siona uses her power over ": null
    },
    {
        "Nayla": "nayla"
    },
    {
        ", Letos pet Fish Speaker, to set in motion his demise. At the point of the Sareers guardian wall that opens to allow for the passage of the Idaho River, Nayla, caught in her faith in Leto, opens fire on the bridge with a lasgun, destroying it as Leto and Hwi are crossing, dropping them into the Idaho River. The water destroys Letos sandworm body, decomposing it into the sandtrout that will lock up the water in their bodies, recreating the conditions for the sandworms to re-appear, each with a pearl of Letos consciousness and adaptability inside it. Leto dies, his last vision that of the Golden Path, shining brightly in humanitys future. His total reign spanned 42 years.     Before arrival to Tuono, Hwi asks Leto to share their souls , since they cannot interact physically after Letos loss of humanity. Her deep empathy and ability to see beyond the abyss that separates Leto from all human beings—an abyss that no other human would ever dare to cross—and to love him brings a tear in each of his eyes. Earlier, it was remarked that the God Emperor was unable to shed tears, partly because of the disrupting effect water had on his worm body and partly because of the Fremen-inherited inhibition of wasting body water.     Although the Atreides that surround him needed to be shown the absolute horrors that could only be avoided by Letos apparent tyranny in order for them to support the Golden Path, Hwi is able to understand without having seen any proof the altruism in Letos actions and the ultimate sacrifice that he had to make... and is able to love him.     It is that moment that they share that brings forth the deepest emotions in Letos current life... emotions thought forgotten: fear, surprise, admiration, understanding and being understood and ultimately that moment of true happiness that he had lost hope for.     After Letos death, driven by the Famine Times and the pent up desires of thousands of years of Letos enforced peace, which bred stagnation and isolation, humanity explodes out into the universe in waves of migration known as ": null
    },
    {
        "The Scattering": "the scattering"
    },
    {
        " . Humanitys exponential expansion in the Scattering spreads them beyond the ability of any single force to control or threaten their destiny. Thus Letos Golden Path gave humanity both immunity to domination by prescient rulers via Sionas genetic trait, and immunity to domination by any single ruler or disaster by spreading them far and wide into unknown reaches of the universe.     The sandworms which once again travel Dune after Letos death carry, in his words, a pearl of his awareness locked forever in an endless dream. They are worshipped as the Divided God, and their existence keeps humanity locked on Letos Golden Path. In  Heretics of Dune , the Mother Superior of the Bene Gesserit ": null
    },
    {
        "Taraza": "list of dune bene gesserittaraza"
    },
    {
        "  manage to save one sandworm from Rakis before it is destroyed by the ": null
    },
    {
        "Honored Matres": "honored matres"
    },
    {
        ".       More than 42 years after his death, Leto II is brought back as a ": null
    },
    {
        "ghola": "ghola"
    },
    {
        " on board the ": null
    },
    {
        "no-ship": "no-ship"
    },
    {
        "  Ithaca  in Brian Herbert and Kevin J. Andersons continuation of the original series,  Hunters of Dune  . Even at a very young age, this Leto shows signs that he may be more than he seems. During an assassination attempt, he appears to transform into a small sandworm and defends himself before reverting to an innocent one-year-old. Genetically, he is noted to be very unusual; as he grows older, he displays an uncanny intelligence, but is very withdrawn. The current Duncan ghola notes that it had been cruel to bring Leto back without his twin sister, who had been so much of the originals life.     In the concluding novel  Sandworms of Dune  , Leto  can control the worms. After his memories are returned, he leads the seven sandworms being transported on the Ithaca to wreak havoc in ": null
    },
    {
        "Synchrony": "synchrony"
    },
    {
        ", homeworld of the ": null
    },
    {
        "thinking machines": "thinking machines"
    },
    {
        ". At the conclusion of the battle, all seven worms fuse together into one massive worm; Leto steps inside, and they descend below the planets surface. While it is stated that Leto had foreseen the conflict with ": null
    },
    {
        "Omnius": "omnius"
    },
    {
        " and the thinking machines, the ultimate fate of the Golden Path, or the worms status on Synchrony, is left open.       Leto is portrayed by ": null
    },
    {
        "James McAvoy": "james mcavoy"
    },
    {
        " in the 42 ": null
    },
    {
        "miniseries": "miniseries"
    },
    {
        "  Frank Herberts Children of Dune .   Laura Fries of  Variety  wrote, the mini picks up a great deal of charisma when McAvoy and ": null
    },
    {
        "[Jessica] Brooks": "jessica brooks"
    },
    {
        " come aboard as the next generation of the house of Atreides.  The characters Leto and Ghanima were aged from ten-year-olds to teens for the miniseries, which Emily Asher-Perrin of  Tor.com  called a smart move here, as finding two ten year old kids who had the ability to behave as though they had millennia of ancestral memory bubbling up inside of them was always going to be an impossibility. ": null
    }
]