[
    {
        "         Letter from an Unknown Woman  is a novella by ": null
    },
    {
        "Stefan Zweig": "stefan zweig"
    },
    {
        ". Published in 42 it tells the story of an author who, while reading a letter written by a woman he does not remember, gets glimpses into her life story.       A rich and well-known writer , returning home to ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " from one of many holidays, finds a long letter from an unknown woman . As a teenager the woman had lived with her poor widowed mother in the same building and had fallen totally in love with both the opulent cultured lifestyle of her neighbour and the handsome charming man himself. Her passion for the writer was not lessened by the flow of attractive women spending the night with him nor when she had to leave Vienna and moved to ": null
    },
    {
        "Innsbruck": "innsbruck"
    },
    {
        " when her mother remarried. At age 42 she returned to Vienna, took a job and tried to meet the writer again. He did not recognise her and, without revealing her name, she succeeded in spending three nights with him before he disappeared on a long holiday. Pregnant, she lost her job and had to give birth in a refuge for the indigent. Resolved that their child should have a good life, she spent nights with or became mistress of various rich men but would never marry because her heart belonged always to the writer. Out one night with a current lover, she saw the writer in a night club and went home with him instead. To him, she was just an agreeable companion for that night, as he again did not recognise her. In the ": null
    },
    {
        "42 flu pandemic": "1918 flu pandemic"
    },
    {
        ", the child died and she, ill herself, wrote the letter to be posted after her death.       ;Film   In 42 a ": null
    },
    {
        "film version": "letter from an unknown woman"
    },
    {
        " was produced with a screenplay adaptation by ": null
    },
    {
        "Howard Koch": "howard koch"
    },
    {
        ". Starring ": null
    },
    {
        "Joan Fontaine": "joan fontaine"
    },
    {
        ", ": null
    },
    {
        "Louis Jourdan": "louis jourdan"
    },
    {
        ", ": null
    },
    {
        "Mady Christians": "mady christians"
    },
    {
        " and ": null
    },
    {
        "Marcel Journet": "marcel journet"
    },
    {
        ", it was directed by ": null
    },
    {
        "Max Ophüls": "max ophüls"
    },
    {
        ". In 42 Letter from an Unknown Woman was selected for preservation in the United States ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        " by the ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " as being culturally, historically, or aesthetically significant .     In 42 a Spanish-language adaptation made in Mexico, Feliz Año, Amor Mío, starring ": null
    },
    {
        "Marga López": "marga lópez"
    },
    {
        " and ": null
    },
    {
        "Arturo de Córdova": "arturo de córdova"
    },
    {
        ", was released.     In 42 the TV film  Lettre dune inconnue  by French director ": null
    },
    {
        "Jacques Deray": "jacques deray"
    },
    {
        " became the last production of this artist.     In 42 a ": null
    },
    {
        "Chinese adaptation": "letter from an unknown woman"
    },
    {
        " of the novella was made. It was directed by ": null
    },
    {
        "Xu Jinglei": "xu jinglei"
    },
    {
        ".     In 42 ": null
    },
    {
        "Mongolia": "mongolia"
    },
    {
        "n film director ": null
    },
    {
        "Naranbaatar": "naranbaatar"
    },
    {
        " has made the film adaptation of the novella.     ;Opera   In 42 the mono-opera ": null
    },
    {
        "Письмо незнакомки": "письмо незнакомки"
    },
    {
        "  was composed by ": null
    },
    {
        "Antonio Spadavecchia": "antonio spadavecchia"
    },
    {
        " , and staged in the Soviet Union in Russian.                                   ": null
    }
]