[
    {
        "           Lettres de cachet  were letters signed by the ": null
    },
    {
        "king of France": "list of french monarchs"
    },
    {
        ", ": null
    },
    {
        "countersigned": "countersign"
    },
    {
        " by one of his ministers, and closed with the ": null
    },
    {
        "royal seal": "royal seal"
    },
    {
        ", or cachet. They contained orders directly from the king, often to enforce arbitrary actions and judgments that could not be ": null
    },
    {
        "appeal": "appeal"
    },
    {
        "ed.     In the case of organized bodies, lettres de cachet’ were issued for the purpose of preventing assembly or accomplishing some other definite act. The provincial estates were convoked in this manner, and it was by a lettre de cachet , or by showing in person in a  lit de justice , that the king ordered a  parlement  to register a law despite that parlements refusal to pass it.     The best-known lettres de cachet, however, were penal, by which a subject was imprisoned without ": null
    },
    {
        "trial": "trial"
    },
    {
        " and without an opportunity of defense  in a state prison or an ordinary jail, confinement in a ": null
    },
    {
        "convent": "convent"
    },
    {
        " or the ": null
    },
    {
        "General Hospital of Paris": "general hospital of paris"
    },
    {
        ", transportation to the colonies, or expulsion to another part of the realm, or from the realm altogether. The lettres were mainly used against drunkards, troublemakers, prostitutes, squanderers of family fortune, or insane persons. The wealthy sometimes petitioned such lettres to dispose of inconvenient individuals, especially to prevent unequal marriages , or to prevent a scandal .     In this respect, the lettres de cachet were a prominent symbol of the abuses of the  ancien régime  ": null
    },
    {
        "monarchy": "monarchy"
    },
    {
        ", and as such were suppressed during the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". In 1789 and 1790, all cases were revised by a commission which confirmed most of the sentences. Historian ": null
    },
    {
        "Claude Quétel": "claude quétel"
    },
    {
        " has interpreted these confirmations as indicating that the Lettres were not as arbitrary and unjust as they have been represented after the Revolution,  and he hence speaks of a ": null
    },
    {
        "Légende noire": "black legend"
    },
    {
        ".          The power to issue lettres de cachet was a royal privilege recognized by the French monarchic civil law that developed during the 13th century, as the ": null
    },
    {
        "Capetian monarchy": "house of capet"
    },
    {
        " overcame its initial distrust of ": null
    },
    {
        "Roman law": "roman law"
    },
    {
        ". The principle can be traced to a maxim which furnished a text of the  Pandects  of ": null
    },
    {
        "Justinian": "justinian i"
    },
    {
        ": in their Latin version, Rex solutus est a legibus , or The king is released from the laws. The French legal scholars interpreted the imperial office of the Justinian code in a generic way and arrived at the conclusion that every king is an emperor in his own kingdom, that is, he possesses the prerogatives of legal ": null
    },
    {
        "absolutism": "political absolutism"
    },
    {
        " that the  Corpus Juris Civilis  attributes to the Roman emperor.      This meant that when the king intervened directly, he could decide without heeding the laws, and even contrary to the laws. This was an early conception, and in early times the order in question was simply verbal; some ": null
    },
    {
        "letters patent": "letters patent"
    },
    {
        " of Henry III of France in 1576 state that ": null
    },
    {
        "François de Montmorency": "françois de montmorency"
    },
    {
        " was prisoner in our castle of the ": null
    },
    {
        "Bastille": "bastille"
    },
    {
        " in ": null
    },
    {
        "Paris": "paris"
    },
    {
        " by verbal command of the late king ": null
    },
    {
        "Charles IX": "charles ix of france"
    },
    {
        ".     In the 14th century the principle was introduced that the order should be written, and hence arose the lettre de cachet. The lettre de cachet belonged to the class of  lettres closes , as opposed to  lettres patentes , which contained the expression of the legal and permanent will of the king, and had to be furnished with the seal of state affixed by the ": null
    },
    {
        "chancellor": "chancellor"
    },
    {
        ".     The lettres de cachet, on the contrary, were signed simply by a secretary of state for the king; they bore merely the imprint of the kings privy seal, from which circumstance they were often called, in the 14th and 15th centuries, lettres de petit signet or lettres de petit cachet, and were entirely exempt from the control of the chancellor.       While serving the ": null
    },
    {
        "government": "forms of government"
    },
    {
        " as a silent weapon against political adversaries or controversial writers and as a means of punishing culprits of high birth without the scandal of a lawsuit, the lettres de cachet had many other uses. They were employed by the police in dealing with prostitutes, and on their authority lunatics were shut up in hospitals and sometimes in prisons.     They were also often used by heads of families as a means of correction, for example, for protecting the family honour from the disorderly or criminal conduct of sons. The case of the ": null
    },
    {
        "Marquis de Sade": "marquis de sade"
    },
    {
        "  is a prominent example. Wives, too, took advantage of them to curb the profligacy of husbands and vice versa.     In reality, the secretary of state had a delegation and could issue them at his own discretion, and in most cases the king was unaware of their issue. In the 18th century it is certain that the letters were often issued blank, i.e. without containing the name of the person against whom they were directed; the recipient, or ": null
    },
    {
        "mandatary": "mandatary"
    },
    {
        ", filled in the name in order to make the letter effective.       Protests against the lettres de cachet were made continually by the  parlement  of ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and by the provincial parlements, and also by the ": null
    },
    {
        "Estates-General": "estates general"
    },
    {
        ". In 1648, during the ": null
    },
    {
        "Fronde": "fronde"
    },
    {
        ", the sovereign courts of Paris, by their Arrêt dUnion, procured their momentary suppression in a kind of charter of liberties which they imposed upon the crown, but which was short-lived.     It was not until the reign of ": null
    },
    {
        "Louis XVI": "louis xvi of france"
    },
    {
        " that a reaction against the abuse became clearly perceptible. At the beginning of that reign ": null
    },
    {
        "Malesherbes": "guillaume-chrétien de lamoignon de malesherbes"
    },
    {
        " during his short ministry endeavoured to infuse some measure of ": null
    },
    {
        "justice": "justice"
    },
    {
        " into the system, and in March 1784 the ": null
    },
    {
        "baron de Breteuil": "louis auguste le tonnelier de breteuil"
    },
    {
        ", a minister of the kings household, addressed a circular to the intendants and the lieutenant of police with a view to preventing the most serious abuses connected with the issue of lettres de cachet.     The ": null
    },
    {
        "Comte de Mirabeau": "comte de mirabeau"
    },
    {
        " wrote a scathing indictment of lettres de cachet while imprisoned in the dungeon of ": null
    },
    {
        "Vincennes": "vincennes"
    },
    {
        " . The treatise was published after his liberation in 1782 under the title Les Lettres de cachet et des prisons detat and was widely read throughout Europe.     Besides the Bastille, there were thirty prisons in Paris by 1779 in which a peson could be detained without trial. The National Cyclopaedia of Useful Knowledge, Vol.III, London Charles Knight, p.1,002 Convents were used for the same purpose.     They were reported to have been openly sold, in the reign of Louis XV, by the mistress of one of his ministers.     In Paris, in 1779, the ": null
    },
    {
        "Cour des Aides": "cour des aides"
    },
    {
        " demanded their suppression, and in March 1788 the Parlement of Paris made some exceedingly energetic remonstrances, which are important for the light they throw upon old French public law. The crown, however, did not decide to lay aside this weapon, and in a declaration to the States-General in the royal session of June 23, 1789 it did not renounce it absolutely.       Lettres de cachet were abolished after the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " by the Constituent Assembly, but ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " reestablished their penal equivalent by a political measure in the decree of 8 March 1801 on the state prisons. This is all the more striking, given that Napoleon had pushed for measures ensuring the ": null
    },
    {
        "rule of law": "rule of law"
    },
    {
        " in the ": null
    },
    {
        "codes": "napoleonic code"
    },
    {
        " of laws adopted under his rule. This action was one of the acts brought up against him by the senatus-consulte of 3 April 1814, which pronounced his fall considering that he has violated the constitutional laws by the decrees on the state prisons.     lettres de cachet": null
    },
    {
        "Charles Simon Favart": "charles simon favart"
    },
    {
        "   Luke Joseph Hooke": "luke joseph hooke"
    },
    {
        "   Honoré Gabriel Riqueti, comte de Mirabeau": "honoré gabriel riqueti, comte de mirabeau"
    },
    {
        "   Marguerite Monvoisin": "marguerite monvoisin"
    },
    {
        " .   ": null
    },
    {
        "Pigault-Lebrun": "pigault-lebrun"
    },
    {
        "   Alexandre Balthazar Laurent Grimod de La Reynière": "alexandre balthazar laurent grimod de la reynière"
    },
    {
        "   Marquis de Sade": "marquis de sade"
    },
    {
        "   Comte de Sanois": "comte de sanois"
    },
    {
        "   Voltaire": "voltaire"
    },
    {
        "   Jean-François Marmontel": "jean-françois marmontel"
    },
    {
        ", accused to be the author of a satire against the Duke dAumont. His account of his short stay in the Bastille contains a description of the food he received, the room he was imprisoned with his servant, and the goodwill shown to him.   ": null
    },
    {
        "Giacomo Casanova": "giacomo casanova"
    },
    {
        "   Marie-Anne de La Ville": "marie-anne de la ville"
    },
    {
        "    Jean-Baptiste Forqueray": "jean-baptiste forqueray"
    },
    {
        "       Honoré Mirabeau": "honoré mirabeau"
    },
    {
        ",  , written in the dungeon at ": null
    },
    {
        "Vincennes": "vincennes"
    },
    {
        " into which his father had thrown him by a lettre de cachet, one of the ablest and most eloquent of his works, which had an immense circulation and was translated into ": null
    },
    {
        "English": "english language"
    },
    {
        " in 1788.   ": null
    },
    {
        "Doctor Alexandre Manette": "doctor alexandre manette"
    },
    {
        ", in ": null
    },
    {
        "Dickens": "dickens"
    },
    {
        "  A Tale of Two Cities , was thrown into the ": null
    },
    {
        "Bastille": "bastille"
    },
    {
        " prison by means of a lettre de cachet. In addition, ": null
    },
    {
        "Charles Darnay": "charles darnay"
    },
    {
        " suspected that his uncle, a marquis, would have used a lettre de cachet": null
    }
]