[
    {
        "     Lewisville  is a city in ": null
    },
    {
        "Denton County, Texas": "denton county, texas"
    },
    {
        ", United States. It is a suburb within the ": null
    },
    {
        "Dallas-Fort Worth Metroplex": "dallas-fort worth metroplex"
    },
    {
        ". The ": null
    },
    {
        "42 United States Census": "2000 united states census"
    },
    {
        " placed the citys population at 42 and the ": null
    },
    {
        "42 Census": "2010 united states census"
    },
    {
        " placed it at 42, making it one of the fastest-growing city populations in the United States and the 42rd most populous in Texas. It occupies  of land and includes  of ": null
    },
    {
        "Lewisville Lake": "lewisville lake"
    },
    {
        ".     Originally called Holfords Prairie, Lewisville dates back to the early 42s. The arrival of the towns first railroad in 42 engendered its initial growth, and the expansion of the areas transportation infrastructure spurred further development in the early part of the 42th century. Lewisville ": null
    },
    {
        "incorporated": "local government in the united states"
    },
    {
        " in 42 and when construction of Lewisville Lake was completed in the 42s, the city began to expand rapidly.     Lewisvilles proximity to Lewisville Lake have made it a recreational hub of the ": null
    },
    {
        "Dallas–Fort Worth metroplex": "dallas–fort worth metroplex"
    },
    {
        ". The citys municipal government, led by a nonpartisan city council, focuses its recreational and cultural investments on facilities such as Toyota of Lewisville Park and the MCL Grand Theater. The areas transportation infrastructure has evolved around the ": null
    },
    {
        "I42 Corridor": "i-35 corridor"
    },
    {
        " along ": null
    },
    {
        "Interstate 42E": "interstate 35e"
    },
    {
        ". The diversity of its population and industry has created a stable economic climate. ": null
    },
    {
        "Lewisville Independent School District": "lewisville independent school district"
    },
    {
        " provides most of the areas public education programs.           In 42 the ": null
    },
    {
        "Republic of Texas": "republic of texas"
    },
    {
        " chartered the ": null
    },
    {
        "Peters Colony": "peters colony"
    },
    {
        " Land Grant Company  to settle the ": null
    },
    {
        "North Texas": "north texas"
    },
    {
        " area. In 42 John W. King and his wife settled on the east side of the prairie, where the city now lies. Baptist settlers from ": null
    },
    {
        "Platte County, Missouri": "platte county, missouri"
    },
    {
        ", settled on the west side; among them were John and James Holford, who named the area Holfords Prairie. Further south, Presbyterians established a church and called it ": null
    },
    {
        "Flower Mound": "flower mound, texas"
    },
    {
        ". In the confusion over land ownership after the ": null
    },
    {
        "Hedgcoxe War": "hedgcoxe war"
    },
    {
        ", Basdeal Lewis purchased Holfords Prairie in 42 and renamed it after himself.     In 42 the Fox family, which owned about a dozen slaves, buried a slave child called Melinda on the family farm, which eventually became the towns cemetery for black residents. Named Fox–Hembry Cemetery, the plot still exists today. After it had fallen into disrepair, local residents and businesses gathered to restore it in 42 Though ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        " was not on the ballot in the area for the ": null
    },
    {
        "42 Presidential election": "1860 united states presidential election"
    },
    {
        ", residents of Lewisville still gave ": null
    },
    {
        "John C. Breckinridge": "john c. breckinridge"
    },
    {
        " only a 42–42 majority over an ": null
    },
    {
        "electoral fusion": "electoral fusion"
    },
    {
        " option.     During ": null
    },
    {
        "Reconstruction": "reconstruction era of the united states"
    },
    {
        ", Lewisville became home to ": null
    },
    {
        "Denton Countys": "denton county, texas"
    },
    {
        " first ": null
    },
    {
        "cotton gin": "cotton gin"
    },
    {
        ". Built in 42 it could produce up to three bales per day. The ": null
    },
    {
        "Thirteenth Texas Legislature": "thirteenth texas legislature"
    },
    {
        " chartered the Dallas and Wichita Railroad  on terms requiring 42 miles of track to be in running order by July 42 42 Lewisville paid the company $42 to come to the city, with a promise of another $42 on completion. The company fulfilled the deal by completing the railroad tracks to a point just south of Lewisville on the morning of the deadline, and the line began running full-time in 42 Republicans in the ": null
    },
    {
        "Fourteenth Texas Legislature": "fourteenth texas legislature"
    },
    {
        " passed a law on April 42 42 prohibiting alcohol within two miles of the town. Many residents ignored the law, however, and the city retained as many as 42 saloons at one point. The population of the unincorporated town was 42 in 42          On January 42 42 residents voted by a margin of 42 votes to ": null
    },
    {
        "incorporate": "municipal corporation"
    },
    {
        " Lewisville, which established its official boundaries as a city. By 42 Lewisvilles population had increased to 42 making it the fourth most populous municipality in Denton County .     Because the citys economy had become diversified before the ": null
    },
    {
        "Wall Street Crash of 42": "wall street crash of 1929"
    },
    {
        ", Lewisville was relatively well insulated from the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ". Many residents, including business leaders, nevertheless supported the ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        " programs of ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        ". By 42 the ": null
    },
    {
        "Works Progress Administration": "works progress administration"
    },
    {
        " operated a cannery in the city to provide temporary jobs for unemployed residents. As an extension of the ": null
    },
    {
        "Good Roads Movement": "good roads movement"
    },
    {
        ", which had been prominent in Denton County since the early 42s, residents formed the Good Roads Committee of Lewisville to lobby state and federal officials for funding to create better streets. Lewisville celebrated the paving of the ": null
    },
    {
        "U.S. Route 42": "u.s. route 77 in texas"
    },
    {
        " between Denton and ": null
    },
    {
        "Dallas": "dallas"
    },
    {
        " in 42 with a Coming Out of the Mud ceremony. The new pavement closed the Lewisville Gap between the two cities, a stretch of dirt road through the city that often became too muddy for travel.     The new road also led indirectly to the downfall of the areas public transportation system. Between 42 and 42 the Texas Interurban Railway, an electric ": null
    },
    {
        "commuter rail": "commuter rail"
    },
    {
        " service that ran from Dallas to Denton, operated a station in Lewisville. Business leaders in the Lewisville Chamber of Commerce welcomed the service at the time, proudly citing the citys ": null
    },
    {
        "progressive": "progressivism in the united states"
    },
    {
        " citizenship. The areas low population density could not sustain the venture, however, and in 42 the line went out of business and immediately halted service.     On April 42 42 ": null
    },
    {
        "Raymond Hamilton": "raymond hamilton"
    },
    {
        " of the ": null
    },
    {
        "Barrow Gang": "barrow gang"
    },
    {
        " robbed the First National Bank of Lewisville. Residents chased him to ": null
    },
    {
        "Howe, Texas": "howe, texas"
    },
    {
        ", where he was captured at a roadblock and transferred to Dallas County Jail.       Lewisvilles rapid growth began when construction of the Garza–Little Elm Dam finished in 42 expanding the Garza–Little Elm Reservoir into what is now ": null
    },
    {
        "Lewisville Lake": "lewisville lake"
    },
    {
        ". The city adopted a ": null
    },
    {
        "home rule": "home rule in the united states"
    },
    {
        " charter for a ": null
    },
    {
        "council–manager": "council–manager government"
    },
    {
        " style of municipal government in 42 becoming one of only a few home rule cities in Texas with a population of less than 42. In September 42 42 days after ": null
    },
    {
        "Woodstock": "woodstock"
    },
    {
        ", the city hosted the ": null
    },
    {
        "Texas International Pop Festival": "texas international pop festival"
    },
    {
        ", which drew over 42 spectators and featured performances by ": null
    },
    {
        "Janis Joplin": "janis joplin"
    },
    {
        ", ": null
    },
    {
        "B.B. King": "b.b. king"
    },
    {
        " and ": null
    },
    {
        "Led Zeppelin": "led zeppelin"
    },
    {
        ". In 42 the ": null
    },
    {
        "Texas Historical Commission": "texas historical commission"
    },
    {
        " dedicated a historical event marker at the ": null
    },
    {
        "Hebron": "hebron"
    },
    {
        " A-train": "a-train"
    },
    {
        " station in Lewisville to commemorate the event.     When ": null
    },
    {
        "Dallas/Fort Worth International Airport": "dallas/fort worth international airport"
    },
    {
        " opened to the south of the city in 42 and ": null
    },
    {
        "Vista Ridge Mall": "vista ridge mall"
    },
    {
        " opened at the intersection of ": null
    },
    {
        "Interstate 42E": "interstate 35e"
    },
    {
        " and ": null
    },
    {
        "Round Grove Road": "fm 3040"
    },
    {
        " in 42 Lewisville began to undergo rapid suburban growth. Its population increased from 42 in 42 to 42 in 42 making it the 42th most populous city in Texas. In the early 42s, the Lewisville Chamber of Commerce marketed the city with the slogan City of Expanding Horizons . The population reached 42 in 42 and 42 in 42       Lewisville is at   at an elevation of about . It has a total area of , of which  is land. It lies at the southern end of Denton County and the northern end of the ": null
    },
    {
        "Dallas–Fort Worth metroplex": "dallas–fort worth metroplex"
    },
    {
        ", in the eastern part of the ": null
    },
    {
        "Cross Timbers": "cross timbers"
    },
    {
        " region of Texas between the ": null
    },
    {
        "Texas Blackland Prairies": "texas blackland prairies"
    },
    {
        " and the Grand Prairie. Vista Ridge, a small plateau, is in the southeast corner of Lewisville, and the lowest part of Denton County, at , is found in the city. Lewisville sits above the ": null
    },
    {
        "Barnett Shale": "barnett shale"
    },
    {
        ", a geological formation containing a large quantity of ": null
    },
    {
        "natural shale gas": "shale gas in the united states"
    },
    {
        ".     Water constitutes  of the citys total area, including Lewisville Lake, the Elm Fork of the ": null
    },
    {
        "Trinity River": "trinity river"
    },
    {
        ", and two local tributaries of the Elm Fork, Prairie Creek and Timber Creek. A ": null
    },
    {
        "riparian zone": "riparian zone"
    },
    {
        " encompasses a portion of the city in the southeast. The intersection of the Elm Fork and Lake Lewisville has given rise to a ": null
    },
    {
        "delta": "river delta"
    },
    {
        " at the southern end of the lake, extending  south. The ": null
    },
    {
        "Federal Emergency Management Agency": "federal emergency management agency"
    },
    {
        " has labeled much of the area surrounding the delta as Zone AE , meaning the area is subject to ": null
    },
    {
        "42-year flood": "100-year flood"
    },
    {
        " precautions.       Lewisvilles climate is classified as ": null
    },
    {
        "humid subtropical": "humid subtropical climate"
    },
    {
        ". Its ": null
    },
    {
        "Köppen climate classification": "köppen climate classification"
    },
    {
        " is Cfa, which means it has a temperate climate, does not have a ": null
    },
    {
        "dry season": "dry season"
    },
    {
        ", and has a hot summer. According to the ": null
    },
    {
        "United States Department of Agriculture": "united states department of agriculture"
    },
    {
        ", Lewisville is in a ": null
    },
    {
        "hardiness zone": "hardiness zone"
    },
    {
        " of 42a. The city is seldom affected by ": null
    },
    {
        "extreme weather": "extreme weather"
    },
    {
        ", but ": null
    },
    {
        "Hurricane Carla": "hurricane carla"
    },
    {
        " in 42 brought  winds and caused  swells on Lewisville Lake. During heavy rains, Timber Creek can overflow its banks, and on rare occasions, flood some of the surrounding homes. The ": null
    },
    {
        "National Weather Service": "national weather service"
    },
    {
        " defines no official borders for ": null
    },
    {
        "Tornado Alley": "tornado alley"
    },
    {
        ", but Lewisville is considered to be in it.                          The Medical City Lewisville Grand Theater, known informally as the MCL Grand, is on the east side of Interstate 42E in Lewisvilles Old Town. It is a hub for the arts in Lewisville, able to show films, host meetings, and provide a venue for various kinds of artistic performance. The project began in 42 and aimed to fulfill a long-term goal of building an arts center to coincide with the 42 opening of the ": null
    },
    {
        "Old Town Station": "old town"
    },
    {
        ". The facility opened in January 42 with a series of performances, childrens shows, concerts, and exhibits, and the Greater Lewisville Arts Alliance presented the theater with a $42 contribution to begin their fundraiser to place a ": null
    },
    {
        "Steinway": "steinway  &  sons"
    },
    {
        " piano in the theater. In 42 and 42 The Flower Mound Connection newspaper named the MCL Grand the best events venue in Denton County.            The city government created the Lewisville Public Library in 42 naming Cindy Bennett as its first director. A  structure was built where the city hall now stands. A new library facility was built in 42 as part of the municipal building on Main Street. In 42 Lewisville voters approved a 42B tax package, part of which was dedicated to building a new library facility, the childrens wing of which was dedicated to Bennett. The $42 million renovation opened in 42 and it received the Achievement of Excellence in Libraries Award in that year and again in 42 Lewisville was also the temporary home of the ": null
    },
    {
        "George W. Bush Presidential Library": "george w. bush presidential center"
    },
    {
        " until 42       Lewisville is served mainly by media from the Dallas area, but a number of niche publications focus on local news. The Lewisville Enterprise merged with The Lewisville Leader in 42 The papers publisher and editor at the time, U.O. Clements, was a staunch conservative, but vociferously supported the racial integration of ": null
    },
    {
        "Lewisville Independent School District": "lewisville independent school district"
    },
    {
        ", for which he received many anonymous threats from members of the ": null
    },
    {
        "Ku Klux Klan": "ku klux klan"
    },
    {
        ". Clements sold the paper to ": null
    },
    {
        "Harte-Hanks Community Newspapers": "harte-hanks"
    },
    {
        " in 42 Star Newspapers, which owned the Leader, was purchased by 42 Communications in 42 The newspaper is based in ": null
    },
    {
        "Plano, Texas": "plano, texas"
    },
    {
        ". In 42 the Lewisville City Council designated the Lewisville portion of  Neighborsgo , a weekly section of  The Dallas Morning News , as the citys official newspaper of record.          The City of Lewisville operates public recreation facilities, including parks, two recreation centers, and approximately  of trails. The $42 million Railroad Park was built in 42 using the revenue from a quarter-cent sales tax increase; it was the largest capital project in the citys history at the time. It was renamed Toyota of Lewisville Railroad Park in 42 in a deal worth $42 million. The park has a baseball/softball complex, a football complex, eight lighted soccer fields, two concession buildings, a perimeter walking/jogging trail, three man-made lakes, a ": null
    },
    {
        "dog park": "dog park"
    },
    {
        " and the ": null
    },
    {
        "Scion": "scion"
    },
    {
        " Skate Park": "skatepark"
    },
    {
        ". Since 42 the skate park has hosted the Scion Regional Amateur Tour, part an annual series of six skateboarding competitions held across the country. In 42 the venue hosted its first annual ": null
    },
    {
        "triathlon": "triathlon"
    },
    {
        " event benefiting the ": null
    },
    {
        "Court Appointed Special Advocates": "court appointed special advocates"
    },
    {
        " of Denton County.     Lewisville Lake Park comprises , which the city leases from the ": null
    },
    {
        "United States Army Corps of Engineers": "united states army corps of engineers"
    },
    {
        ". The park includes various amenities, including athletic fields and designated campgrounds. The Lewisville Fishing Barge, an indoor–outdoor fishing facility that opened in 42 is on the lake. The park also hosts the Rick Neill Memorial, a cross-country running meet the ": null
    },
    {
        "Lewisville High School": "lewisville high school"
    },
    {
        " track and field team organizes each year. In February 42 the city began to review a development proposal to build a resort hotel and convention center on a  parcel of land next to the lake.     Lewisville is also a major hub of the Northern Golf Corridor of the Dallas–Fort Worth metroplex. Golf facilities in the city include the ": null
    },
    {
        "Hank Haney": "hank haney"
    },
    {
        " Golf Ranch at Vista Ridge and Timbercreek Golf Center. Located on the citys southeast edge, the Lakes at Castle Hills is a ": null
    },
    {
        "Jay Morrish": "jay morrish"
    },
    {
        "-designed course which opened in the late 42s; critics have rated the course highly, praising its amenities and difficulty level. Lake Park Golf Course, near Lewisville Lake, is noted for its beginner-friendly design. The nine-hole,   Lake Park Executive course opened in 42 Lewisville is also home to professional golfer ": null
    },
    {
        "Chad Campbell": "chad campbell"
    },
    {
        ", winner of the 42 ": null
    },
    {
        "Tour Championship": "the tour championship"
    },
    {
        ".     In 42 the Lewisville Park Board proposed a new master plan for the citys parks and recreation facilities. It specifies a major overhaul of the citys trail system, including  of off-street trails,  of enhanced sidewalks,  of bicycle routes, a  paddling trail down the Elm Fork of the Trinity River, and 42 major and minor trailheads throughout the area, many of which would connect to other trail networks. The plan includes numerous crossings of Interstate 42E for pedestrian and bicyclist safety. In March 42 the Park Board began reviewing a new master plan to address the next ten years of park development in the city.            Since 42 the City of Lewisville has operated as a ": null
    },
    {
        "home rule": "home rule in the united states"
    },
    {
        " city with a ": null
    },
    {
        "council–manager": "council-manager government"
    },
    {
        " style of municipal government. Residents elect six ": null
    },
    {
        "at-large": "at-large"
    },
    {
        " members to serve on the City Council, including a mayor. Council elections in Texas are nonpartisan. Members are elected to three-year terms and are not term-limited. The mayor does not vote on issues that come before the council except in the case of a tie. There were three female mayors between 42 and 42 but no woman has served on the City Council since 42 In 42 the ": null
    },
    {
        "Fitch Group": "fitch group"
    },
    {
        " upgraded the citys ": null
    },
    {
        "general obligation bond": "general obligation bond"
    },
    {
        " rating from AA+ to AAA . Lewisville has the lowest municipal property tax rate in the Dallas–Fort Worth metroplex. In the fiscal year 42–42 the city governments operating funds totaled $42,42     The Lewisville Police Department had 42 sworn police officers in 42 and the number had increased to 42 by 42 As of 42 the department included 42 full-time employees, four of whom were administrators. The Lewisville Fire Department included 42 full-time employees, six of whom were administrators. After the ": null
    },
    {
        "September 42 attacks": "september 11 attacks"
    },
    {
        ", the fire department and its then chief, ": null
    },
    {
        "Rick Lasky": "rick lasky"
    },
    {
        ", attracted national attention when they raised a large amount of donations for victims families. As a reward, ": null
    },
    {
        "John Travolta": "john travolta"
    },
    {
        ", ": null
    },
    {
        "Joaquin Phoenix": "joaquin phoenix"
    },
    {
        ", and ": null
    },
    {
        "Robert Patrick": "robert patrick"
    },
    {
        " visited the department in 42 to promote the release of the film  Ladder 42 . In May 42 Lewisville residents approved a sales tax increase to create two public safety districts. The revenue from the increase will fund investments in the citys police and fire departments, including new officers and vehicles, as well as a new fire station in the eastern part of the city.     Lewisville is in the ": null
    },
    {
        "42th  Congressional district": "texass 26th congressional district"
    },
    {
        " in Texas, which is represented in the ": null
    },
    {
        "United States House of Representatives": "united states house of representatives"
    },
    {
        " by ": null
    },
    {
        "Michael C. Burgess": "michael c. burgess"
    },
    {
        ". As of 42 the city is represented in ": null
    },
    {
        "District  42": "texas senate, district 12"
    },
    {
        " of the ": null
    },
    {
        "Texas Senate": "texas senate"
    },
    {
        " by ": null
    },
    {
        "Jane Nelson": "jane nelson"
    },
    {
        ". The city is split between two ": null
    },
    {
        "Texas House of Representatives": "texas house of representatives"
    },
    {
        " districts: ": null
    },
    {
        "District 42": "texas house of representatives, district 63"
    },
    {
        ", represented by ": null
    },
    {
        "Tan Parker": "tan parker"
    },
    {
        ", and ": null
    },
    {
        "District 42": "texas house of representatives, district 65"
    },
    {
        ", represented by Ron Simmons. Lewisville is a voluntary member of the ": null
    },
    {
        "North Central Texas Council of Governments": "north central texas council of governments"
    },
    {
        ", the purpose of which is to coordinate individual and collective local governments and facilitate regional solutions, eliminate unnecessary duplication, and enable joint decisions.            The primary freeway running through Lewisville is Interstate 42E, which runs north–south through the city. Before it was built, US Highway 42  was the main through route, connecting the city with Denton to the north and Dallas to the south. In 42 the ": null
    },
    {
        "Texas Department of Transportation": "texas department of transportation"
    },
    {
        " carried out a ": null
    },
    {
        "Major Investment Study": "transportation in the united statesfunding"
    },
    {
        " to examine the possibility of expanding the section of Interstate 42E between ": null
    },
    {
        "Interstate 42": "interstate 635"
    },
    {
        " and ": null
    },
    {
        "U.S. Route 42": "u.s. route 380"
    },
    {
        ", the primary focus being an   stretch from ": null
    },
    {
        "Texas State Highway 42": "texas state highway 121"
    },
    {
        " to the bridge crossing Lewisville Lake. The project is scheduled to add one general-purpose lane in each direction, in addition to a ": null
    },
    {
        "managed toll lane": "high occupancy/toll and express toll lanes"
    },
    {
        ". The project is expected to allow the city to substantially renovate its portion of the ": null
    },
    {
        "I42 Corridor": "i-35 corridor"
    },
    {
        ". Construction on the first phase of the project is projected to begin in summer 42 and finish in late 42     Texas State Highway 42 which runs along the ": null
    },
    {
        "Sam Rayburn Tollway": "sam rayburn tollway"
    },
    {
        ", intersects with Interstate 42E in the southeastern edge of the city. ": null
    },
    {
        "Farm to Market Road 42": "farm to market road 1171"
    },
    {
        ", known in the city as Main Street, runs east–west across the middle part of the city from ": null
    },
    {
        "Business Highway 42": "business route"
    },
    {
        " to ": null
    },
    {
        "Interstate 42W": "interstate 35w"
    },
    {
        ". ": null
    },
    {
        "Farm to Market Road 42": "farm to market road 407"
    },
    {
        " runs east–west across the northern part of the city. Lewisville also encompasses most of ": null
    },
    {
        "Farm to Market Road 42": "farm to market road 3040"
    },
    {
        ", which runs east–west towards ": null
    },
    {
        "Carrollton": "carrollton, texas"
    },
    {
        " and Flower Mound.     Lewisville residents voted in a special election held on September 42 42 to become a full member of the ": null
    },
    {
        "Denton County Transportation Authority": "denton county transportation authority"
    },
    {
        " . The authority began running a regional bus service in November 42 In 42 the ": null
    },
    {
        "Old Town": "old town station"
    },
    {
        ", ": null
    },
    {
        "Hebron": "hebron station"
    },
    {
        ", and ": null
    },
    {
        "Highland Village/Lewisville Lake": "highland village/lewisville lake station"
    },
    {
        " stations opened as commuter stops along the route of the DCTAs ": null
    },
    {
        "A-train": "a-train"
    },
    {
        ". The route continues north to Denton and south to ": null
    },
    {
        "Trinity Mills Station": "trinity mills station"
    },
    {
        " in Carrollton, where it connects with the ": null
    },
    {
        "Dallas Area Rapid Transit": "dallas area rapid transit"
    },
    {
        " Green Line": "green line"
    },
    {
        " to Dallas. DCTA also owns a Rail Operation and Maintenance Facility in Lewisville.            The ": null
    },
    {
        "42 United States Census": "2010 united states census"
    },
    {
        " recorded a population of 42 in Lewisville, up from the 42 recorded for the ": null
    },
    {
        "42 Census": "2000 united states census"
    },
    {
        ", making it one of the 42 fastest-growing city populations in the United States. The 42 population was made up of 42 households and 42 families. Its ": null
    },
    {
        "racial makeup": "race and ethnicity in the united states census"
    },
    {
        " was 42% White, 42% African American, 42% Native American, 42% Asian , 42% from other races, and 42% from two or more races. 42% of the population was considered to be of ": null
    },
    {
        "Hispanic": "hispanic"
    },
    {
        " or ": null
    },
    {
        "Latino": "latino"
    },
    {
        " origin. There were children under the age of 42 in 42% of the households. The average household size was 42  persons and the average family size was 42  persons. The median age was 42  years. Between 42 and 42 the median income for a Lewisville household was $42, and per capita income was $42. About 42% of the population was below the poverty line, as compared to 42% for Texas as a whole.       The city has a diverse commercial tax base. Its top employers include ": null
    },
    {
        "JPMorgan Chase": "jpmorgan chase"
    },
    {
        ", Lewisville Independent School District, and ": null
    },
    {
        "Nationstar Mortgage": "nationstar mortgage"
    },
    {
        ". Automobile dealerships have flourished there, including Huffines Auto Dealerships and Village Auto Group, which was ranked as one of the top Powerhouses of the New Economy by  Black Enterprise  magazine in 42 Lewisvilles lake and the citys location in the DFW Metroplex has contributed to the largest boat sales market in the state by volume in a state second in the nation in overall boat sales. Because of the citys proximity to Dallas and ": null
    },
    {
        "Fort Worth": "fort worth, texas"
    },
    {
        ", a number of food distribution companies have branches in Lewisville, including ": null
    },
    {
        "Sysco": "sysco"
    },
    {
        " and Meadowbrook Meat Company . ": null
    },
    {
        "Fleming Companies": "core-markfleming companies"
    },
    {
        ", one of the United States largest food distribution companies, relocated to Lewisville in 42 but it filed for ": null
    },
    {
        "Chapter 42 bankruptcy": "chapter 11, title 11, united states code"
    },
    {
        " in 42 after the ": null
    },
    {
        "U.S. Securities and Exchange Commission": "u.s. securities and exchange commission"
    },
    {
        " announced the company had been hiding massive losses. ": null
    },
    {
        "Responsive Education Solutions": "responsive education solutions"
    },
    {
        ", which operates chartered schools nationwide, is also headquartered in Lewisville. ": null
    },
    {
        "Adeptus Health": "adeptus health"
    },
    {
        ", a health care provider, is headquartered in the city.          ": null
    },
    {
        "Lewisville Independent School District": "lewisville independent school district"
    },
    {
        " operates the areas public school system, including ": null
    },
    {
        "Lewisville High School": "lewisville high school"
    },
    {
        ". Four of the districts middle schools feed into two high school feeder campuses; since the 42–42 school year, the ": null
    },
    {
        "Killough": "killough lewisville high school north"
    },
    {
        " and Harmon campuses have served the citys ninth- and tenth-grade students, while the main campus at the intersection of FM 42 and Valley Parkway is used primarily for eleventh- and twelfth-grade students. The district also operates the ": null
    },
    {
        "Dale Jackson Career Center": "dale jackson career center"
    },
    {
        " and Career Center East, along with conducting a night high school in Lewisville.     According to ": null
    },
    {
        "American Community Survey": "american community survey"
    },
    {
        " results from 42 to 42 42% of the citys population aged 42 or older had graduated from high school, 42% held a bachelors degree or higher, and 42% held a graduate or professional degree. The survey estimated that 42 Lewisville residents over the age of three were enrolled in schools.        In addition there are two private schools located in Lewisville, both located in the central portion of the city:        .     Founders Classical Academy, a ": null
    },
    {
        "charter school": "charter school"
    },
    {
        " operated by Lewisville-based ": null
    },
    {
        "ResponsiveEd": "responsiveed"
    },
    {
        ", is also located in Lewisville.       ": null
    }
]