[
    {
        "          The LGM42 Minuteman is a U.S. land-based ": null
    },
    {
        "intercontinental ballistic missile": "intercontinental ballistic missile"
    },
    {
        " , in service with the ": null
    },
    {
        "Air Force": "united states air force"
    },
    {
        " Global Strike Command": "air force global strike command"
    },
    {
        ". , the LGM42G Minuteman III version is the only land-based ICBM in service in the United States, and represents the land leg of the U.S. ": null
    },
    {
        "nuclear triad": "nuclear triad"
    },
    {
        ", along with the ": null
    },
    {
        "Trident": "trident"
    },
    {
        " submarine-launched ballistic missile": "submarine-launched ballistic missile"
    },
    {
        " and nuclear weapons carried by long-range ": null
    },
    {
        "strategic bomber": "strategic bomber"
    },
    {
        "s.     Development of the Minuteman began in the mid42s, when basic research indicated that a ": null
    },
    {
        "solid fuel rocket": "solid fuel rocket"
    },
    {
        " motor could stand ready to launch for long periods of time, in contrast to ": null
    },
    {
        "liquid-fueled rocket": "liquid-fueled rocket"
    },
    {
        "s that required fueling before launch and so might be destroyed in a surprise attack. The missile was named for the Colonial ": null
    },
    {
        "Minutemen": "minutemen"
    },
    {
        " of the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        ", who could be ready to fight on short notice.     The Minuteman entered service in 42 as a ": null
    },
    {
        "deterrence": "deterrence theory"
    },
    {
        " weapon that could hit Soviet cities with a ": null
    },
    {
        "second strike": "second strike"
    },
    {
        " and ": null
    },
    {
        "countervalue": "countervalue"
    },
    {
        " counterattack if the U.S. was attacked. However, the development of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " UGM42 Polaris": "ugm-27 polaris"
    },
    {
        ", which addressed the same role, allowed the Air Force to modify the Minuteman, boosting its accuracy enough to attack hardened military targets, including Soviet missile silos. The Minuteman-II entered service in 42 with a host of upgrades to improve its accuracy and survivability in the face of an ": null
    },
    {
        "anti-ballistic missile": "anti-ballistic missile"
    },
    {
        " system the Soviets were known to be developing. In 42 the Minuteman-III became the first deployed ICBM with ": null
    },
    {
        "multiple independently targetable reentry vehicles": "multiple independently targetable reentry vehicle"
    },
    {
        " : three smaller warheads that improved the missiles ability to strike targets defended by ABMs. They were initially armed with the W42 warhead with a ": null
    },
    {
        "yield": "nuclear weapon yield"
    },
    {
        " of 42 ": null
    },
    {
        "kilotons": "tnt equivalent"
    },
    {
        ".     By the 42s, 42 Minutemen were deployed. This force has shrunk to 42 Minuteman-III missiles  deployed in ": null
    },
    {
        "missile silo": "missile silo"
    },
    {
        "s around ": null
    },
    {
        "Malmstrom AFB": "malmstrom air force base"
    },
    {
        ", ": null
    },
    {
        "Montana": "montana"
    },
    {
        "; ": null
    },
    {
        "Minot AFB": "minot air force base"
    },
    {
        ", ": null
    },
    {
        "North Dakota": "north dakota"
    },
    {
        "; and ": null
    },
    {
        "F.E. Warren AFB": "francis e. warren air force base"
    },
    {
        ", ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        ". The Air Force plans to keep the missile in service until at least 42              Minuteman owes its existence largely to Air Force Colonel ": null
    },
    {
        "Edward N. Hall": "edward n. hall"
    },
    {
        ", who in 42 was given charge of the solid-fuel-propulsion division of ": null
    },
    {
        "General Bernard Schrievers": "bernard adolph schriever"
    },
    {
        " Western Development Division": "western development division"
    },
    {
        ", created to lead development of the ": null
    },
    {
        "SM42 Atlas": "sm-65 atlas"
    },
    {
        " and ": null
    },
    {
        "HGM42A Titan I": "hgm-25a titan i"
    },
    {
        " ICBMs. Solid fuels were already commonly used in short-range rockets. Halls superiors were interested in ": null
    },
    {
        "short-": "short range ballistic missile"
    },
    {
        " and ": null
    },
    {
        "medium": "medium range ballistic missile"
    },
    {
        "-range missiles with solids, especially for use in Europe where the fast reaction time was an advantage for weapons that might be attacked by Soviet aircraft. But Hall was convinced that they could be used for a true ICBM with  range.      To achieve the required energy, that year Hall began funding research at ": null
    },
    {
        "Boeing": "boeing"
    },
    {
        " and ": null
    },
    {
        "Thiokol": "thiokol"
    },
    {
        " into the use of ": null
    },
    {
        "ammonium perchlorate composite propellant": "ammonium perchlorate composite propellant"
    },
    {
        ". Adapting a concept developed in the UK, they cast the fuel into large cylinders with a star-shaped hole running along the inner axis. This allowed the fuel to burn along the entire length of the cylinder, rather than just the end as in earlier designs. The increased burn rate meant increased thrust. This also meant the heat was spread across the entire motor, instead of the end, and because it burned from the inside out it did not reach the wall of the missile fuselage until the fuel was finished burning. In comparison, older designs burned primarily from one end to the other, meaning that at any instant one small section of the fuselage was being subjected to extreme loads and temperatures.     Guidance of an ICBM is based not only on the direction the missile is traveling but the precise instant that thrust is cut off. Too much thrust and the warhead will overshoot its target, too little and it will fall short. Solids are normally very hard to predict in terms of burning time and their instantaneous thrust during the burn, which made them questionable for the sort of accuracy required to hit a target at intercontinental range. This appeared at first to be an insurmountable problem, but in the end, was solved in an almost trivial fashion. A series of ports were added inside the rocket nozzle that were opened when the guidance systems called for engine cut-off. The reduction in pressure was so abrupt that the last burning fuel ejected itself and the flame was extinguished.     The first to use these developments was the US Navy. They had been involved in a joint program with the ": null
    },
    {
        "US Army": "us army"
    },
    {
        " to develop the liquid-fueled ": null
    },
    {
        "PGM42 Jupiter": "pgm-19 jupiter"
    },
    {
        ", but had always been skeptical of the system. They felt that liquid fuels were too dangerous to use onboard ships, especially submarines. Rapid success in the solids development program, combined with ": null
    },
    {
        "Edward Teller": "edward teller"
    },
    {
        "s promise of much lighter ": null
    },
    {
        "nuclear warhead": "nuclear warhead"
    },
    {
        "s during ": null
    },
    {
        "Project Nobska": "project nobska"
    },
    {
        ", led the Navy to abandon Jupiter and begin development of their own solid fuel missile. Aerojets work with Hall was adapted for their ": null
    },
    {
        "UGM42 Polaris": "ugm-27 polaris"
    },
    {
        " starting in December 42       The US Air Force saw no pressing need for a solid fuel ICBM. Development of the ": null
    },
    {
        "SM42 Atlas": "sm-65 atlas"
    },
    {
        " and ": null
    },
    {
        "SM42 Titan": "sm-68 titan"
    },
    {
        " ICBMs was progressing, and storable liquids were being developed that would allow missiles to be left in a ready-to-shoot form for extended periods. Hall saw solid fuels not only as a way to improve launch times or safety, but part of a radical plan to greatly reduce the cost of ICBMs so that thousands could be built. He was aware that new computerized ": null
    },
    {
        "assembly line": "assembly line"
    },
    {
        "s would allow continual production, and that similar equipment would allow a small team to oversee operations for dozens or hundreds of missiles. A solid fuel design would be simpler to build, and easier to maintain.      Halls ultimate plan was to build a number of integrated missiles farms that included factories, ": null
    },
    {
        "missile silos": "missile launch facility"
    },
    {
        ", transport and recycling. Each farm would support between 42 and 42 missiles being produced in a continuous low rate cycle. Systems in a missile would detect failures, at which point it would be removed and recycled, while a newly built missile would take its place.  The missile design was based purely on lowest possible cost, reducing its size and complexity because the basis of the weapons merit was its low cost per completed mission; all other factors – accuracy, vulnerability, and reliability – were secondary.      Halls plan did not go unopposed, especially by the more established names in the ICBM field. ": null
    },
    {
        "Ramo-Wooldridge": "trw inc."
    },
    {
        " pressed for a system with higher accuracy, but Hall countered that the missiles role was to attack Soviet cities, and that a force which provides numerical superiority over the enemy will provide a much stronger deterrent than a numerically inferior force of greater accuracy.  Hall was known for his friction with others and in 42 Schriever removed him from the Minuteman project and sent him to the UK to oversee deployment of the ": null
    },
    {
        "Thor IRBM": "pgm-17 thor"
    },
    {
        ".  On his return to the US in 42 Hall retired from the Air Force, but received his second ": null
    },
    {
        "Legion of Merit": "legion of merit"
    },
    {
        " in 42 for his work on solid fuels.     Although he was removed from the Minuteman project, Halls work on cost reduction had already produced a new design of  diameter, much smaller than the Atlas and Titan at , which meant smaller and cheaper silos. Halls goal of dramatic cost reduction was a success, although many of the other concepts of his missile farm were abandoned.                Previous long-range missiles used liquid fuels that could only be loaded just prior to firing. The loading process took from 42 to 42 minutes in typical designs. Although lengthy, this was not considered to be a problem at the time, because it took about the same amount of time to spin up the ": null
    },
    {
        "inertial guidance system": "inertial guidance system"
    },
    {
        ", set the initial position, and program in the target coordinates.      Minuteman was designed from the outset to be launched in minutes. While solid fuel eliminated the fueling delays, the delays in starting and aligning the guidance system remained. For quick launch, the guidance system would have to be kept running and aligned at all times, which was a serious problem for the mechanical systems, especially the gyroscopes which used ": null
    },
    {
        "ball bearing": "ball bearing"
    },
    {
        "s.      ": null
    },
    {
        "Autonetics": "autonetics"
    },
    {
        " had an experimental design using ": null
    },
    {
        "air bearing": "air bearing"
    },
    {
        "s that they claimed had been running continually from 42 to 42  Autonetics further advanced the ": null
    },
    {
        "state of the art": "state of the art"
    },
    {
        " by building the platform in the form of a ball which could rotate in two directions. Conventional solutions used a shaft with ball bearings at either end that allowed it to rotate around a single axis only. Autonetics design meant that only two gyros would be needed for the inertial platform, instead of the typical three.      The last major advance was to use a general purpose digital computer in place of the analog or custom designed digital computers. Previous missile designs normally used two single-purpose computers; one ran the ": null
    },
    {
        "autopilot": "autopilot"
    },
    {
        " that kept the missile flying along a programmed course, and the second compared the information from the inertial platform to the target coordinates and sent any needed corrections to the autopilot. To reduce the total number of parts used in Minuteman, a single faster computer was used, running separate routines for these functions.      Since the guidance computer would be inactive while the missile sat in the silo, the same computer was also used to run a program that monitored the various sensors and test equipment. With older designs this had been handled by external systems, requiring miles of extra wiring and many connectors. In order to store multiple programs, the computer, the ": null
    },
    {
        "D42B": "d-17b"
    },
    {
        ", was built in the form of a ": null
    },
    {
        "drum machine": "magnetic drum"
    },
    {
        " but used a ": null
    },
    {
        "hard disk": "hard disk"
    },
    {
        " in place of the drum.      Building a computer with the required performance, size and weight demanded the use of ": null
    },
    {
        "transistor": "transistor"
    },
    {
        "s, which were at that time very expensive and not very reliable. Earlier efforts to use transistorized computers for guidance, ": null
    },
    {
        "BINAC": "binac"
    },
    {
        " and the system on the ": null
    },
    {
        "SM42 Navaho": "sm-64 navaho"
    },
    {
        ", had failed and were abandoned. The Air Force and Autonetics spent millions on a program to improve transistor and component reliability 42 times, leading to the Minuteman high-rel parts specifications. The techniques developed during this program were equally useful for improving all transistor construction, and greatly reduced the failure rate of transistor production lines in general. This improved yield, which had the effect of greatly lowering production costs, and had enormous spin-off effects in the electronics industry.      Using a general purpose computer also had long-lasting effects on the Minuteman program and the USs nuclear stance in general. With Minuteman, the targeting could be easily changed by loading new trajectory information into the computers hard drive, a task that could be completed in a few hours. Earlier ICBMs custom wired computers, on the other hand, could only have attacked a single target, whose precise trajectory information was hard-coded directly in the systems logic.        In 42 a series of intelligence reports suggested the Soviets were far ahead in the missile race and would be able to overwhelm the US by the early 42s. If the Soviets were building missiles in the numbers being predicted by the CIA and others within the defense establishment, by as early as 42 they would have enough to attack all SAC and ICBM bases in the US in a single ": null
    },
    {
        "first strike": "first strike"
    },
    {
        ". It was later demonstrated that this ": null
    },
    {
        "missile gap": "missile gap"
    },
    {
        " was just as fictional as the ": null
    },
    {
        "bomber gap": "bomber gap"
    },
    {
        " of a few years earlier, but through the late 42s, it was a serious concern.     The Air Force responded by beginning research into survivable strategic missiles, starting the ": null
    },
    {
        "WS42": "ws-199"
    },
    {
        " program. Initially, this focused on ": null
    },
    {
        "air-launched ballistic missile": "air-launched ballistic missile"
    },
    {
        "s, which would be carried aboard aircraft flying far from the Soviet Union, and thus impossible to attack by either ICBM, because they were moving, or long-range ": null
    },
    {
        "interceptor aircraft": "interceptor aircraft"
    },
    {
        ", because they were too far away. In the shorter term, looking to rapidly increase the number of missiles in its force, Minuteman was given crash development status starting in September 42 Advanced surveying of the potential silo sites had already begun in late 42      Adding to their concerns was a Soviet ": null
    },
    {
        "anti-ballistic missile": "anti-ballistic missile"
    },
    {
        " system which was known to be under development at ": null
    },
    {
        "Sary Shagan": "sary shagan"
    },
    {
        ". WS42 was expanded to develop a ": null
    },
    {
        "maneuvering reentry vehicle": "maneuvering reentry vehicle"
    },
    {
        " , which greatly complicated the problem of shooting down a warhead. Two designs were tested in 42 ": null
    },
    {
        "Alpha Draco": "alpha draco"
    },
    {
        " and the Boost Glide Reentry Vehicle. These used long and skinny arrow-like shapes that provided aerodynamic lift in the high atmosphere, and could be fitted to existing missiles like Minuteman.      The shape of these reentry vehicles required more room on the front of the missile than a traditional reentry vehicle design. To allow for this future expansion, the Minuteman silos were revised to be built  deeper. Although Minuteman would not deploy a ": null
    },
    {
        "boost-glide": "boost-glide"
    },
    {
        " warhead, the extra space proved invaluable in the future, as it allowed the missile to be extended and carry more fuel and payload.                During Minutemans early development, the Air Force maintained the policy that the manned ": null
    },
    {
        "strategic bomber": "strategic bomber"
    },
    {
        " was the primary weapon of nuclear war. Blind bombing accuracy on the order of  was expected, and the weapons were sized to ensure even the hardest targets would be destroyed as long as the weapon fell within this range. The USAF had enough bombers to attack every military and industrial target in the USSR and was confident that its bombers would survive in sufficient numbers that such a strike would utterly destroy the country.      Soviet ICBMs upset this equation to a degree. Their accuracy was known to be low, on the order of , but they carried large warheads that would be useful against ": null
    },
    {
        "Strategic Air Command": "strategic air command"
    },
    {
        "s bombers, which parked in the open. Since there was no system to detect the ICBMs being launched, the possibility was raised that the Soviets could launch a sneak attack with a few dozen missiles that would take out a significant portion of SACs bomber fleet.      In this environment, the Air Force saw their own ICBMs not as a primary weapon of war, but as a way to ensure that the Soviets would not risk a sneak attack. ICBMs, especially newer models that were housed in silos, could be expected to survive an attack by a single Soviet missile. In any conceivable scenario where both sides had similar numbers of ICBMs, the US forces would survive a sneak attack in sufficient numbers to ensure the destruction of all major Soviet cities in return. The Soviets would not risk an attack under these conditions.      Considering this  countervalue  attack concept, strategic planners calculated that an attack of 42 equivalent megatons aimed at the largest Soviet cities would promptly kill 42% of their population and destroy 42% of their industry. Larger attacks raised these numbers only slightly, as all of the larger targets would already have been hit. This suggested that there was a finite deterrent level around 42 megatons that would be enough to prevent a Soviet attack no matter how many missiles they had of their own. All that had to be ensured was that the US missiles survived, which seemed likely given the low accuracy of the Soviet weapons.  Reversing the problem, the addition of ICBMs to the US Air Forces arsenal did not eliminate the need, or desire, to attack Soviet military targets, and the Air Force maintained that bombers were the only suitable platform in that role.      This presented a serious problem for the Air Force. While still pressing for development of newer bombers, like the supersonic ": null
    },
    {
        "B42": "north american xb-70 valkyrie"
    },
    {
        ", it appeared the counter value role was served by the Navys ": null
    },
    {
        "UGM42 Polaris": "ugm-27 polaris"
    },
    {
        ". Polaris had enough range that the submarines could roam open areas of the ocean, and would be essentially invulnerable to attack no matter how many missiles the Soviets had, or how accurate they were. Based on the same 42 equivalent megatons calculation, they set about building a fleet of 42 submarines carrying 42 missiles each, giving the Navy a finite deterrent that was unassailable.      A February 42 memo by ": null
    },
    {
        "RAND": "rand"
    },
    {
        ", entitled The Puzzle of Polaris , was passed around among high-ranking Air Force officials. It suggested that Polaris negated any need for Air Force ICBMs if they were also being aimed at Soviet cities. If the role of the missile was to present an unassailable threat to the Soviet population, Polaris was a far better solution than Minuteman. The document had long-lasting effects on the future of the Minuteman program, which, by 42 was firmly evolving towards a ": null
    },
    {
        "counterforce": "counterforce"
    },
    {
        " capability.        Minutemans final tests coincided with ": null
    },
    {
        "John F. Kennedy": "john f. kennedy"
    },
    {
        " entering the White House. His new ": null
    },
    {
        "Secretary of Defense": "secretary of defense"
    },
    {
        ", ": null
    },
    {
        "Robert McNamara": "robert mcnamara"
    },
    {
        ", was tasked with producing the worlds best defense while limiting spending. McNamara began to apply ": null
    },
    {
        "cost/benefit analysis": "cost/benefit analysis"
    },
    {
        ", and Minutemans low production cost made its selection a foregone conclusion. Atlas and Titan were soon scrapped, and the storable liquid fueled Titan II deployment was severely curtailed.  McNamara also cancelled the ": null
    },
    {
        "B42": "north american xb-70 valkyrie"
    },
    {
        " bomber project.      Minutemans low cost had spin-off effects on non-ICBM programs. The Armys ": null
    },
    {
        "Nike Zeus": "lim-49 nike zeus"
    },
    {
        ", an interceptor missile capable of shooting down Soviet warheads, provided another way to prevent a sneak attack. This had initially been proposed as a way to defend the SAC bomber fleet. The Army argued that upgraded Soviet missiles might be able to attack US missiles in their silos, and Zeus would be able to blunt such an attack. Zeus was expensive and the Air Force said it was more cost-effective to build another Minuteman missile. Given the large size and complexity of the Soviet liquid-fueled missiles, an ICBM building race was one the Soviets could not afford. Zeus was canceled in 42          Minutemans selection as the primary Air Force ICBM was initially based on the same ": null
    },
    {
        "second strike": "second strike"
    },
    {
        " logic as their earlier missiles: that the weapon was primarily one designed to survive any potential Soviet attack and ensure they would be hit in return. But Minuteman had a combination of features that led to its rapid evolution into the USs primary weapon of nuclear war.     Chief among these qualities was its digital computer. This could be updated in the field with new targets and better information about the flight paths with relative ease, gaining accuracy for little cost. One of the unavoidable effects on the warheads trajectory was the mass of the Earth, which is not even, and contains many ": null
    },
    {
        "mass concentrations": "mass concentration"
    },
    {
        " that pull on the warhead. Through the 42s, the Defense Mapping Agency  mapped these with increasing accuracy, feeding that information back into the Minuteman fleet. The Minuteman was deployed with a ": null
    },
    {
        "circular error probable": "circular error probable"
    },
    {
        " of about , but this had improved to about  by 42  This was accomplished without any mechanical changes to the missile or its navigation system.      At those levels, the ICBM begins to approach the manned bomber in terms of accuracy; a small upgrade, roughly doubling the accuracy of the INS, would give it the same  CEP as the manned bomber. Autonetics began such development even before the original Minuteman entered fleet service, and the Minuteman-II had a CEP of . Additionally, the computers were upgraded with more memory, allowing them to store information for eight targets, which the missile crews could select among almost instantly, greatly increasing their flexibility.  From that point, Minuteman became the USs primary deterrent weapon, until its performance was matched by the Navys ": null
    },
    {
        "Trident missile": "trident"
    },
    {
        " of the 42s.     Questions about the need for the manned bomber were quickly raised. The Air Force began to offer a number of reasons why the bomber offered value, in spite of costing more money to buy and being much more expensive to operate and maintain. Newer bombers with better survivability, like the ": null
    },
    {
        "B42": "north american xb-70 valkyrie"
    },
    {
        ", cost many times more than the Minuteman, and, in spite of great efforts through the 42s, became increasingly vulnerable to ": null
    },
    {
        "surface-to-air missile": "surface-to-air missile"
    },
    {
        "s. The ": null
    },
    {
        "B42": "rockwell b-1 lancer"
    },
    {
        " of the early 42s eventually emerged with a price tag around $42 million  while the Minuteman-IIIs built during the 42s cost only $42 million .     The Air Force countered that having a variety of platforms complicated the defense; if the Soviets built an effective ": null
    },
    {
        "anti-ballistic missile": "anti-ballistic missile"
    },
    {
        " system of some sort, the ICBM and SLBM fleet might be rendered useless, while the bombers would remain. This became the ": null
    },
    {
        "nuclear triad": "nuclear triad"
    },
    {
        " concept, which survives into the present. Although this argument was successful, the number of manned bombers has been repeatedly cut and the deterrent role increasingly passed to missiles.       :See also W42 Warhead        The LGM42A Minuteman-I was first test-fired on 42 February 42 at ": null
    },
    {
        "Cape Canaveral": "cape canaveral air force station"
    },
    {
        ", and entered into the ": null
    },
    {
        "Strategic Air Command": "strategic air command"
    },
    {
        "s arsenal in 42 After the first batch of Minuteman Is were fully developed and ready for stationing, the ": null
    },
    {
        "United States Air Force": "united states air force"
    },
    {
        " had originally decided to put the missiles at ": null
    },
    {
        "Vandenberg AFB": "vandenberg afb"
    },
    {
        " in California, but before the missiles were set to officially be moved there it was discovered that this first set of Minuteman missiles had defective boosters which limited their range from their initial  to . This defect would cause the missiles to fall short of their targets if launched over the ": null
    },
    {
        "North Pole": "north pole"
    },
    {
        " as planned. The decision was made to station the missiles at ": null
    },
    {
        "Malmstrom AFB": "malmstrom afb"
    },
    {
        " in ": null
    },
    {
        "Montana": "montana"
    },
    {
        " instead. These changes would allow the missiles, even with their defective boosters, to reach their intended targets in the case of a launch.     The improved LGM42B Minuteman-I became operational at ": null
    },
    {
        "Ellsworth AFB": "ellsworth afb"
    },
    {
        ", ": null
    },
    {
        "South Dakota": "south dakota"
    },
    {
        ", ": null
    },
    {
        "Minot AFB": "minot afb"
    },
    {
        ", ": null
    },
    {
        "North Dakota": "north dakota"
    },
    {
        ", ": null
    },
    {
        "F.E. Warren AFB": "f.e. warren afb"
    },
    {
        ", ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        ", and ": null
    },
    {
        "Whiteman AFB": "whiteman afb"
    },
    {
        ", ": null
    },
    {
        "Missouri": "missouri"
    },
    {
        ", in 42 and 42 All 42 Minuteman-I missiles were delivered by June 42 Each of the bases had 42 missiles emplaced; F.E. Warren had 42 of the Minuteman-IB missiles. Malmstrom had 42 of the Minuteman-I, and about five years later added 42 of the Minuteman-II similar to those installed at ": null
    },
    {
        "Grand Forks AFB": "grand forks afb"
    },
    {
        ", ND.       The Minuteman Is length varied based on which variation one was to look at. The Minuteman I/A had a length of  and the Minuteman I/B had an length of . The Minuteman I weighed roughly , had an operational range of  with an accuracy of about .       The Minuteman-I Autonetics ": null
    },
    {
        "D42 flight computer": "d-17b"
    },
    {
        " used a rotating air bearing magnetic disk holding 42 cold-stored ": null
    },
    {
        "words": "word"
    },
    {
        " in 42 tracks of 42 bits each and one alterable track of 42 words. The time for a D42 disk revolution was 42 ms. The D42 also used a number of short loops for faster access of intermediate results storage. The D42 computational minor cycle was three disk revolutions or 42 ms. During that time all recurring computations were performed. For ground operations, the inertial platform was aligned and gyro correction rates updated. During a flight, filtered command outputs were sent by each minor cycle to the engine nozzles. Unlike modern computers, which use descendants of that technology for ": null
    },
    {
        "secondary storage": "secondary storage"
    },
    {
        " on ": null
    },
    {
        "hard disk": "hard disk"
    },
    {
        ", the disk was the active ": null
    },
    {
        "computer memory": "computer memory"
    },
    {
        ". The disk storage was considered hardened to radiation from nearby nuclear explosions, making it an ideal storage medium. To improve computational speed, the D42 borrowed an instruction look-ahead feature from the Autonetics-built Field Artillery Data Computer  that permitted simple instruction execution every word time.     The ": null
    },
    {
        "D42C": "d-37c"
    },
    {
        " guidance and control computers were used in Minuteman-II missiles and contained components from ": null
    },
    {
        "Texas Instruments": "texas instruments"
    },
    {
        ". The Minuteman-III missiles used D42D computers and completed the 42 missile deployment of this system. The initial cost of these computers ranged from about $42 to $42 .       :See also W42 warhead         The LGM42F Minuteman-II was an improved version of the Minuteman-I missile. Development on the Minuteman-II began in 42 as the Minuteman-I entered the Strategic Air Commands nuclear force. Minuteman-II production and deployment began in 42 and completed in 42 It had an increased range, greater ": null
    },
    {
        "throw weight": "throw weight"
    },
    {
        " and guidance system with better azimuthal coverage, providing military planners with better accuracy and a wider range of targets. Some missiles also carried penetration aids, allowing the higher probability of kill against ": null
    },
    {
        "Moscows anti-ballistic missile system": "a-35 anti-ballistic missile system"
    },
    {
        ". The payload consisted of a single Mk42C reentry vehicle containing a ": null
    },
    {
        "W42": "w56"
    },
    {
        " nuclear warhead with a yield of 42 megatons of TNT .       The Minuteman-II had a length of , weighed roughly , had an operational range of  with an accuracy of about .     The major new features provided by Minuteman-II were:     An improved first-stage motor to increase reliability.   A novel, single, fixed ": null
    },
    {
        "nozzle": "nozzle"
    },
    {
        " with liquid injection thrust vector control on a larger second-stage motor to increase missile range. Additional motor improvements to increase reliability.   An improved guidance system , incorporating ": null
    },
    {
        "microchips": "microchips"
    },
    {
        " and miniaturized discrete electronic parts. Minuteman-II was the first program to make a major commitment to these new devices. Their use made possible multiple target selection, greater accuracy and reliability, a reduction in the overall size and weight of the guidance system, and an increase in the survivability of the guidance system in a nuclear environment. The guidance system contained 42 microchips made by ": null
    },
    {
        "Texas Instruments": "texas instruments"
    },
    {
        ".   A penetration aids system to camouflage the warhead during its reentry into an enemy environment. In addition, the Mk42C reentry vehicle incorporated stealth features to reduce its radar signature and make it more difficult to distinguish from decoys. The Mk42C was no longer made of titanium for this and other reasons.   A larger warhead in the reentry vehicle to increase kill probability.     System modernization was concentrated on ": null
    },
    {
        "launch facilities": "launch facility"
    },
    {
        " and ": null
    },
    {
        "command and control": "command and control"
    },
    {
        " facilities. This provided decreased reaction time and increased survivability when under nuclear attack. Final changes to the system were performed to increase compatibility with the expected ": null
    },
    {
        "LGM42A Peacekeeper": "lgm-118a peacekeeper"
    },
    {
        ". These newer missiles were later deployed into modified Minuteman silos.     The Minuteman-II program was the first mass-produced system to use a computer constructed from integrated circuits . The Minuteman-II integrated circuits were ": null
    },
    {
        "diode–transistor logic": "diode–transistor logic"
    },
    {
        " and ": null
    },
    {
        "diode logic": "diode logic"
    },
    {
        " made by ": null
    },
    {
        "Texas Instruments": "texas instruments"
    },
    {
        ". The other major customer of early integrated circuits was the ": null
    },
    {
        "Apollo Guidance Computer": "apollo guidance computer"
    },
    {
        ", which had similar weight and ruggedness constraints. The Apollo integrated circuits were ": null
    },
    {
        "resistor–transistor logic": "resistor–transistor logic"
    },
    {
        " made by ": null
    },
    {
        "Fairchild Semiconductor": "fairchild semiconductor"
    },
    {
        ". The Minuteman-II flight computer continued to use rotating magnetic disks for primary storage. The Minuteman-II included ": null
    },
    {
        "diodes": "diode"
    },
    {
        " by ": null
    },
    {
        "microsemiconductor": "microsemi"
    },
    {
        ".               The LGM42G Minuteman-III program started in 42 and included several improvements over the previous versions. It was first deployed in 42 Most modifications related to the final stage and reentry system . The final stage was improved with a new fluid-injected motor, giving finer control than the previous four-nozzle system.   Performance improvements realized in Minuteman-III include increased flexibility in reentry vehicle and penetration aids deployment, increased survivability after a nuclear attack, and increased payload capacity. The missile retains a ": null
    },
    {
        "gimbal": "gimbal"
    },
    {
        "led ": null
    },
    {
        "inertial navigation system": "inertial navigation system"
    },
    {
        ".     Minuteman-III originally contained the following distinguishing features:     Armed with ": null
    },
    {
        "W42": "w62"
    },
    {
        " warhead, having a yield of only 42 kilotons TNT, instead of previous ": null
    },
    {
        "W42": "w56"
    },
    {
        "s yield of 42 megatons.   It was the first ": null
    },
    {
        "Multiple Independently Targetable Reentry Vehicles MIRV": "multiple independently targetable reentry vehicle"
    },
    {
        " missile. A single missile was then able to target three separate locations. This was an improvement from the Minuteman-I and Minuteman-II models, which were only able to carry one large warhead.   An RS capable of deploying, in addition to the warheads, ": null
    },
    {
        "penetration aids": "penetration aid"
    },
    {
        " such as ": null
    },
    {
        "chaff": "chaff"
    },
    {
        " and ": null
    },
    {
        "decoys": "decoy"
    },
    {
        ".   Minuteman-III introduced in the post-boost-stage an additional liquid-fuel propulsion system rocket engine that is used to slightly adjust the ": null
    },
    {
        "trajectory": "trajectory"
    },
    {
        ". This enables it to dispense decoys or – with MIRV – dispense individual RVs to separate targets. For the PSRE it uses the bipropellant Rocketdyne RS42 engine.   The Hercules M42 third stage of Minuteman-I and Minuteman-II had thrust termination ports on the sides. These ports, when opened by a detonation of shaped charges, reduced the chamber pressure so abruptly that the interior flame was blown out. This allowed a precisely timed termination of thrust for targeting accuracy. The larger Minuteman-III third-stage motor also has thrust termination ports although the final velocity is determined by PSRE.   A fixed nozzle with a liquid injection thrust vector control system on the new third-stage motor additionally increased range.   A flight computer  with larger disk memory and enhanced capability.   A Honeywell HDC42 flight computer which employed non-destructive readout ": null
    },
    {
        "plated wire memory": "plated wire memory"
    },
    {
        " instead of rotating magnetic disk for primary storage was developed as a backup for the D42D but was never adopted.   The Guidance Replacement Program , initiated in 42 replaced the disk-based D42D flight computer with a new one that uses ": null
    },
    {
        "radiation-resistant": "radiation hardened"
    },
    {
        " semiconductor": "semiconductor"
    },
    {
        " RAM": "ram"
    },
    {
        ".          The existing Minuteman-III missiles have been further improved over the decades in service, with more than $42 billion spent in the last decade to upgrade the 42 missiles.       The Minuteman-III had a length of  , weighed  , had an operational range of greater than  with an accuracy of about .       In December 42 the higher-yield ": null
    },
    {
        "W42": "w78"
    },
    {
        " warhead began replacing a number of the W42s deployed on the Minuteman-IIIs. These were delivered in the Mark 42A reentry vehicle. A small, unknown number of the previous Mark 42 RVs were retained operationally, however, to maintain a capability to attack more-distant targets in the south-central Asian republics of the ": null
    },
    {
        "USSR": "ussr"
    },
    {
        " .       The Guidance Replacement Program replaces the NS42A Missile Guidance Set with the NS42A Missile Guidance Set. The newer system extends the service life of the Minuteman missile beyond the year 42 by replacing aging parts and assemblies with current, high-reliability technology while maintaining the current accuracy performance. The replacement program was completed 42 February 42       Beginning in 42 and continuing through 42 the Propulsion Replacement Program extends the life and maintains the performance by replacing the old solid propellant boosters .       The Single Reentry Vehicle modification enabled the United States ICBM force to abide by the now-vacated ": null
    },
    {
        "START II": "start ii"
    },
    {
        " treaty requirements by reconfiguring Minuteman-III missiles from three reentry vehicles down to one. Though it was eventually ratified by both parties, START II never entered into force and was essentially superseded by follow-on agreements such as ": null
    },
    {
        "SORT": "strategic offensive reductions treaty"
    },
    {
        " and ": null
    },
    {
        "New START": "new start"
    },
    {
        ", which do not limit MIRV capability. Minuteman III remains fitted with a single warhead due to the warhead limitations in New START.       Beginning in 42 Mk42/": null
    },
    {
        "W42": "w87"
    },
    {
        " RVs from the deactivated ": null
    },
    {
        "Peacekeeper": "lgm-118 peacekeeper"
    },
    {
        " missile will be placed on the Minuteman-III force under the Safety Enhanced Reentry Vehicle program. The older ": null
    },
    {
        "W42": "w78"
    },
    {
        " does not have many of the safety features of the newer W42 such as ": null
    },
    {
        "insensitive high explosive": "insensitive high explosive"
    },
    {
        ", as well as more advanced safety devices. In addition to implementing these safety features in at least a portion of the future Minuteman-III force, the decision to transfer W42s onto the missile is based on two features that will improve the targeting capabilities of the weapon: more ": null
    },
    {
        "fuzing": "fuze"
    },
    {
        " options which will allow for greater targeting flexibility and the most accurate reentry vehicle available which provides a greater probability of damage to the designated targets.       The ": null
    },
    {
        "Airborne Launch Control System": "airborne launch control system"
    },
    {
        " is an integral part of the Minuteman ICBM command and control system and provides a survivable launch capability for the Minuteman ICBM force if ground-based launch control centers are destroyed.     When the Minuteman ICBM was first placed on alert, the Soviet Union did not have the number of weapons, accuracy, nor significant nuclear yield to completely destroy the Minuteman ICBM force during an attack. However, starting in the mid42s, the Soviets began to gain parity with the US and now had the potential capability to target and successfully attack the Minuteman force with an increased number of ICBMs that had greater yields and accuracy than were previously available. Studying the problem, even more, SAC realized that in order to prevent the US from launching all 42 Minuteman ICBMs, the Soviets did not have to target all 42 Minuteman missile silos. The Soviets only needed to launch a disarming decapitation strike against the 42 Minuteman LCCs – the ": null
    },
    {
        "command and control sites": "missile launch control center"
    },
    {
        " – in order to prevent the launch of all Minuteman ICBMs. Even though the Minuteman ICBMs would have been left unscathed in their missile silos following an LCC decapitation strike, the Minuteman missiles could not be launched without a command and control capability. In other words, the Soviets only needed 42 warheads to fully eliminate command and control of the Minuteman ICBMs. Even if the Soviets chose to expend two to three warheads per LCC for assured damage expectancy, the Soviets would only have had to expend up to 42 warheads to disable the Minuteman ICBM force – far less than the total number of Minuteman silos. The Soviets could have then used the remaining warheads to strike other targets they chose.           Faced with only a few Minuteman LCC targets, the Soviets could have concluded that the odds of being successful in a Minuteman LCC decapitation strike were higher with less risk than it would have been having to face the almost insurmountable task of successfully attacking and destroying 42 Minuteman silos and 42 Minuteman LCCs to ensure Minuteman was disabled. This theory motivated SAC to design a survivable means to launch Minuteman, even if all the ground-based command and control sites were destroyed.     After thorough testing and modification of ": null
    },
    {
        "EC42": "boeing ec-135"
    },
    {
        " command post aircraft, the ALCS demonstrated its capability on 42 April 42 by launching an ERCS configured Minuteman II out of Vandenberg AFB, CA. Afterward, ALCS achieved Initial Operational Capability on 42 May 42 From that point on, airborne missileers stood alert with ": null
    },
    {
        "ALCS-capable EC42 aircraft": "airborne launch control center"
    },
    {
        " for several decades. All Minuteman ICBM Launch Facilities were modified and built to have the capability to receive commands from ALCS. With ALCS now standing alert around-the-clock, the Soviets could no longer successfully launch a Minuteman LCC decapitation strike. Even if the Soviets attempted to do so, EC42s equipped with the ALCS could fly overhead and launch the remaining Minuteman ICBMs in retaliation.  Now that ALCS was on alert, this complicated Soviet war planning by forcing the Soviets to not only target the 42 LCCs, but also the 42 silos with more than one warhead in order to guarantee destruction. This would have required upwards of 42 warheads to complete such an attack. The odds of being successful in such an attack on the Minuteman ICBM force would have been extremely low.     Today, the ALCS is operated by airborne missileers from ": null
    },
    {
        "Air Force Global Strike Command": "air force global strike command"
    },
    {
        "s ": null
    },
    {
        "42th Strategic Operations Squadron": "625th strategic operations squadron"
    },
    {
        " and ": null
    },
    {
        "United States Strategic Command": "united states strategic command"
    },
    {
        " . The weapon system is now located on board the United States Navys ": null
    },
    {
        "E42B Mercury": "e-6b mercury"
    },
    {
        ". The ALCS crew is integrated into the battle staff of the USSTRATCOM ": null
    },
    {
        "Looking Glass": "operation looking glass"
    },
    {
        " Airborne Command Post and is on alert around-the-clock.          ": null
    }
]