[
    {
        "Liane Gabora is a professor of ": null
    },
    {
        "psychology": "psychology"
    },
    {
        " at the ": null
    },
    {
        "University of British Columbia - Okanagan": "ubc okanagan"
    },
    {
        ". She is best known for her theory of the Origin of the modern mind through conceptual closure, which built on her earlier work on Autocatalytic closure in a cognitive system: A tentative scenario for the origin of culture. Her recent writing on Honing Theory is adding new direction to the considerable work published on theories of creativity.          Gabora has contributed to the study of ": null
    },
    {
        "cultural evolution": "cultural evolution"
    },
    {
        " and ": null
    },
    {
        "evolution of societies": "evolution of societies"
    },
    {
        ", focusing strongly on the role of personal creativity, as opposed to ": null
    },
    {
        "memetic": "memetic"
    },
    {
        " imitation or instruction, in differentiating modern human from prior ": null
    },
    {
        "hominid": "hominidae"
    },
    {
        " or modern ": null
    },
    {
        "ape culture": "ape culture"
    },
    {
        ". In particular, she seems to follow ": null
    },
    {
        "feminist economists": "feminist economists"
    },
    {
        " and ": null
    },
    {
        "green economists": "green economists"
    },
    {
        " in making a very strong, indeed pivotal, distinction between creative enterprise , invention, art or ": null
    },
    {
        "individual capital": "individual capital"
    },
    {
        " and imitative ": null
    },
    {
        "meme": "meme"
    },
    {
        " , rule, social category or ": null
    },
    {
        "instructional capital": "instructional capital"
    },
    {
        " .     Gaboras views contrasts with that of ": null
    },
    {
        "memetics": "memetics"
    },
    {
        " and of the strongest ": null
    },
    {
        "social capital": "social capital"
    },
    {
        " theorists  in that she seems to see, as do theorists of ": null
    },
    {
        "intellectual capital": "intellectual capital"
    },
    {
        ", social signals or labels as markers of trust already invested in individual and instructional complexes - rather than as first class actors in themselves. She puts special emphasis on quantifiable archaeological data, such as the number of different arrow points styles, than on contemporary observations to minimize ": null
    },
    {
        "cultural bias": "cultural bias"
    },
    {
        " and notational bias.     Some of her more recent work raises extremely controversial themes in ": null
    },
    {
        "philosophy of science": "philosophy of science"
    },
    {
        " and strongly challenges the ": null
    },
    {
        "particle physics foundation ontology": "particle physics foundation ontology"
    },
    {
        " . She is also known for her contributions to the ": null
    },
    {
        "subtle technology": "subtle technology"
    },
    {
        " field.     Honing Theory: A Complex Systems Framework for Creativity is her latest publication, which suggests that culture evolves through social interaction and exchange between minds that self-organise and modify based on their environment. Creativity arises due to the possibility of uncertainty and disorder, resulting in arousal and a process of novelty and originality until the arousal dissipates. This in turn feeds the cultural norm which in turn feeds further creativity resulting in part the evolution of culture.       Gabora, L. The origin and evolution of culture and creativity. Journal of Memetics: Evolutionary Models of Information Transmission, 42   Gabora, L. Meme and variations: A computer model of cultural evolution. In 42 Lectures in Complex Systems. Addison-Wesley.   Gabora, L. & Aerts, D. Contextualizing concepts. Proceedings of the 42th International FLAIRS Conference , Pensacola Beach FL, May 4242 American Association for Artificial Intelligence.   Gabora, L. The beer can theory of creativity. In Creative Evolutionary Systems. Morgan Kaufmann.   Aerts, D., Aerts, S., Broekaert, J., & Gabora, L. The violation of Bell inequalities in the macroworld. Foundations of Physics, 42 .   Gabora, L. . Revenge of the neurds: Characterizing creative thought in terms of the structure and dynamics of human memory. Creativity Research Journal, 42 4242   Gabora, L. . Honing theory: A complex systems framework for creativity. Nonlinear Dynamics, Psychology, and Life Sciences, 42 4242                    ": null
    }
]