[
    {
        "Liath Luachra, the Gray of Luachair , is the name of two characters in the ": null
    },
    {
        "Fenian Cycle": "fenian cycle"
    },
    {
        " of ": null
    },
    {
        "Irish mythology": "irish mythology"
    },
    {
        ". Both appear in  The Boyhood Deeds of Fionn , which details the young life and adventures of the hero ": null
    },
    {
        "Fionn mac Cumhaill": "fionn mac cumhaill"
    },
    {
        ".     The first Liath Luachra is one of Fionns foster mothers who raise him after the death of his father ": null
    },
    {
        "Cumhal": "cumhal"
    },
    {
        " at the hands of ": null
    },
    {
        "Goll mac Morna": "goll mac morna"
    },
    {
        ". She is a great warrior and a companion of Fionns aunt, the druidess ": null
    },
    {
        "Bodhmall": "bodhmall"
    },
    {
        "; together they raise the boy in secret in the forest of ": null
    },
    {
        "Sliabh Bladhma": "slieve bloom mountains"
    },
    {
        ". Eventually Fionns ever-spreading fame threatens to bring his fathers killers to him, and his caretakers send him to find his own way. By this point they have taught him enough that he can survive on his own, and he goes into the king of ": null
    },
    {
        "Bantry": "bantry"
    },
    {
        "s service.     The second Liath Luachra is a tall, hideous warrior and a member of the ": null
    },
    {
        "Fianna": "fianna"
    },
    {
        ". He had been an enemy of Cumhal, and even dealt him the first blow in the battle at which he died. Later Goll mac Morna gave him possession of Cumhals treasures, and made him the Fiannas official treasurer. His corrbolg or crane bag is one of the warrior bands great treasures. Eventually he kills a young warrior named Glonda; Fionn sees the mans mother crying blood over the murder and decides to avenge him. He kills Liath easily and takes his treasure from him. This Liath has a son, ": null
    },
    {
        "Conán mac Lia": "conán mac lia"
    }
]