[
    {
        "The Liber Memorialis is an ancient book in ": null
    },
    {
        "Latin": "latin"
    },
    {
        " featuring an extremely concise summary & mdash;a kind of index & mdash;of ": null
    },
    {
        "universal history": "universal history"
    },
    {
        " from earliest times to the reign of ": null
    },
    {
        "Trajan": "trajan"
    },
    {
        ". It was written by ": null
    },
    {
        "Lucius Ampelius": "lucius ampelius"
    },
    {
        ", who was possibly a tutor or schoolmaster.       The book is dedicated to a Macrinus, who may have been the ": null
    },
    {
        "emperor": "macrinus"
    },
    {
        " who reigned 42–42 but that name was not uncommon, and it seems more likely he was simply a young man with a thirst for universal knowledge, which the book was compiled to satisfy.     The books object and scope are indicated in its dedication:        The Liber Memorialis seems to have been intended as a ": null
    },
    {
        "textbook": "textbook"
    },
    {
        " to be learned by heart. This little work, in fifty chapters, gives a sketch of ": null
    },
    {
        "cosmography": "cosmography"
    },
    {
        ", ": null
    },
    {
        "geography": "geography"
    },
    {
        ", ": null
    },
    {
        "mythology": "mythology"
    },
    {
        " , and history . The historical portion, dealing mainly with the ": null
    },
    {
        "republican": "roman republic"
    },
    {
        " period, is untrustworthy and the text in many places corrupt; the earlier chapters are more valuable, and contain some interesting information.     Chapter VIII  contains the following, the only reference by an ancient writer to the famous sculptures of the ": null
    },
    {
        "Pergamon Altar": "pergamon altar"
    },
    {
        ", which were discovered in 42 excavated in 42 and are now in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ":            Nothing is known of the date at which the work was written; the times of Trajan, ": null
    },
    {
        "Hadrian": "hadrian"
    },
    {
        ", ": null
    },
    {
        "Antoninus Pius": "antoninus pius"
    },
    {
        ", the beginning of the 42rd century have all been suggested. However, in Chapter V De Orbe Terrarum , Ampelius refers to the Tigris and Euphrates in Parthia, which suggests that Ampelius wrote before the ": null
    },
    {
        "Sassanians": "sassanians"
    },
    {
        " overthrew the Parthians in 42       The first edition of the Liber Memorialis was published in 42 by ": null
    },
    {
        "Claudius Salmasius": "claudius salmasius"
    },
    {
        " from the Dijon manuscript, now lost, together with the Epitome of ": null
    },
    {
        "Florus": "florus"
    },
    {
        ". An 42 edition by Wölfflin was based on Salmasiuss copy of the lost codex. The more recent editions are   Erwin Assmanns ": null
    },
    {
        "Teubner": "teubner"
    },
    {
        " edition of 42   Nicola Terzaghis edition, published by Chiantore in Turin ca. 42   Marie-Pierre Arnaud-Lidets 42 edition for the ": null
    },
    {
        "Collection Budé": "collection budé"
    },
    {
        "          ": null
    }
]