[
    {
        "A life insurance tax shelter uses investments in insurance to protect income or assets from tax liabilities.  Life insurance  proceeds are not taxable in many ": null
    },
    {
        "jurisdiction": "jurisdiction"
    },
    {
        "s. Since most other forms of income are taxable , consumers are often advised to purchase life insurance policies to either offset future tax liabilities, or to shelter the growth of their investments from taxation. This insurance product is also known as ": null
    },
    {
        "Private placement life insurance": "private placement life insurance"
    },
    {
        ".       In those jurisdictions where life insurance proceeds are only tax free at death, tax liabilities that come due at death are often offset by a policy of the same size. Since the mathematics required to compare different strategies is quite complex, most consumers defer to an ": null
    },
    {
        "accountant": "accountant"
    },
    {
        " or ": null
    },
    {
        "life insurance agent": "life insurance agent"
    },
    {
        " for advice. However, there is often vast differences of opinion between these professionals, even given the same starting conditions. This should not be surprising, given the huge future differences that even small variances in starting conditions can make.     For example, assume that an individual is likely to owe $42.42 in taxes at death. If a ": null
    },
    {
        "permanent life insurance": "permanent life insurance"
    },
    {
        " policy with a $42.42 ": null
    },
    {
        "death benefit": "death benefit"
    },
    {
        " costs $42 per year , and the life expectancy of the person is 42 years, then the following events could occur.     The individual could die early. In this case, it is unlikely that any alternative investment of the $42 per year would have yielded the required $42.42 at death.   The individual could live much longer than expected. The individual could have built up a significant cash value within the policy, depending on investment selection. As such, the individual would have access to these cash values tax-free regardless of growth, provided it is set up properly.     Since one normally does not know which of these will occur  calculations must be based on expected life expectancies for people of similar gender, physical condition, and behaviour.       In an attempt to achieve the best of both worlds , life insurance policies were created containing investment accounts having preferential tax treatment.   This is most often done with a ": null
    },
    {
        "Variable universal life": "variable universal life insurance"
    }
]