[
    {
        "     Life-cycle cost analysis  is a tool to determine the most ": null
    },
    {
        "cost-effective": "cost-effectiveness analysis"
    },
    {
        " option among different competing alternatives to purchase, own, operate, maintain and, finally, dispose of an object or process, when each is equally appropriate to be implemented on technical grounds. For example, for a highway pavement, in addition to the initial construction cost, LCCA takes into account all the user costs, , and agency costs related to future activities, including future periodic maintenance and rehabilitation. All the costs are usually discounted and total to a present-day value known as ": null
    },
    {
        "net present value": "net present value"
    },
    {
        " . This example can be generalized on any type of material, product, or system.     In order to perform an LCCA scoping is critical - what aspects are to be included and what not? If the scope becomes too large the tool may become impractical to use and of limited ability to help in decision-making and consideration of alternatives; if the scope is too small then the results may be skewed by the choice of factors considered such that the output becomes unreliable or partisan. Usually, the LCCA term implies that environmental costs are not included, whereas the similar ": null
    },
    {
        "Whole-Life Costing": "whole-life cost"
    },
    {
        ", or just ": null
    },
    {
        "Life Cycle Analysis": "life cycle analysis"
    },
    {
        " , generally has a broader scope, including ": null
    },
    {
        "environmental costs": "environmental costs"
    },
    {
        ".     To help building and facility managers make sound decisions, the US ": null
    },
    {
        "Federal Energy Management Program": "federal energy management program"
    },
    {
        " provides guidance and resources on applying LCCA that permits the cost-effectiveness of ": null
    },
    {
        "energy": "efficient energy use"
    },
    {
        " and ": null
    },
    {
        "water efficiency": "water efficiency"
    },
    {
        " investments to be evaluated . This document includes an introduction to LCCA.     Life cycle cost can be conducted in two approaches: deterministic and probabilistic method.                      ": null
    }
]