[
    {
        "     Light in August is a ": null
    },
    {
        "42 novel": "1932 in literature"
    },
    {
        " by the ": null
    },
    {
        "Southern American": "southern literature"
    },
    {
        " author ": null
    },
    {
        "William Faulkner": "william faulkner"
    },
    {
        ". It belongs to the ": null
    },
    {
        "Southern gothic": "southern gothic"
    },
    {
        " and ": null
    },
    {
        "modernist": "modernist literature"
    },
    {
        " literary genres.     Set in the authors present day, the ": null
    },
    {
        "interwar period": "interwar period"
    },
    {
        ", the novel centers on two strangers who arrive at different times in Jefferson, ": null
    },
    {
        "Yoknapatawpha County": "yoknapatawpha county"
    },
    {
        ", ": null
    },
    {
        "Mississippi": "mississippi"
    },
    {
        ", a fictional county based on Faulkners home, ": null
    },
    {
        "Lafayette County, Mississippi": "lafayette county, mississippi"
    },
    {
        ". The plot first focuses on Lena Grove, a young pregnant white woman from ": null
    },
    {
        "Alabama": "alabama"
    },
    {
        " looking for the father of her unborn child, and then shifts to explore the life of Joe Christmas, a man who has settled in Jefferson and ": null
    },
    {
        "passes": "passing"
    },
    {
        " as white, but who secretly believes he has some black ancestry. After a series of flashbacks narrating Christmass early life, the plot resumes with his living and working with Lucas Burch, the father of Lenas child, who fled to Jefferson and changed his name when he found out that Lena was pregnant. The woman on whose property Christmas and Burch have been living, Joanna Burden, a descendant of ": null
    },
    {
        "Yankee": "yankee"
    },
    {
        " abolitionists": "abolitionism in the united states"
    },
    {
        " hated by the citizens of Jefferson, is murdered. Burch is caught at the scene of the crime and reveals that Christmas had been romantically involved with her and is part black, thus implying that he is guilty of her murder. While Burch sits in jail awaiting his reward for turning in Christmas, Lena is assisted by Byron Bunch, a shy, mild-mannered bachelor who falls in love with her. Bunch seeks the aid of another outcast in the town, the disgraced former minister Gail Hightower, to help Lena give birth and protect Christmas from being lynched. Though Hightower refuses the latter, Christmas escapes to his house and is shot and castrated by a state guardsman. Burch leaves town without his reward, and the novel ends with an anonymous man recounting a story to his wife about some hitchhikers he picked up on the road to Tennessee & mdash;a woman with a child and a man who was not the father of the child, both looking for the womans husband.     In a loose, unstructured modernist narrative style that draws from ": null
    },
    {
        "Christian allegory": "allegory in the middle ages"
    },
    {
        " and ": null
    },
    {
        "oral storytelling": "oral storytelling"
    },
    {
        ", Faulkner explores themes of race, sex, class and religion in the ": null
    },
    {
        "American South": "american south"
    },
    {
        ". By focusing on characters that are misfits, outcasts, or are otherwise marginalized in their community, he portrays the clash of ": null
    },
    {
        "alienated": "social alienation"
    },
    {
        " individuals against a ": null
    },
    {
        "Puritanical": "puritain"
    },
    {
        ", prejudiced rural society. Early reception of the novel was mixed, with some reviewers critical of Faulkners style and subject matter. However, over time, the novel has come to be considered one of the most important literary works by Faulkner and one of the best English-language novels of the 42th century.          The novel is set in the American South in the 42s, during the time of ": null
    },
    {
        "Prohibition": "prohibition in the united states"
    },
    {
        " and ": null
    },
    {
        "Jim Crow laws": "jim crow laws"
    },
    {
        " that legalized ": null
    },
    {
        "racial segregation": "racial segregation in the united states"
    },
    {
        " in the South. It begins with the journey of Lena Grove, a young pregnant white woman from Doanes Mill, Alabama, who is trying to find Lucas Burch, the father of her unborn child. He has been fired from his job at Doanes Mill and moved to Mississippi, promising to send word to her when he has a new job. Not hearing from Burch and harassed by her older brother for her illegitimate pregnancy, Lena walks and hitchhikes to Jefferson, Mississippi, a town in Faulkners fictional Yoknapatawpha County. There she expects to find Lucas working at another ": null
    },
    {
        "planing mill": "planing mill"
    },
    {
        ", ready to marry her. Those who help her along her four-week trek are skeptical that Lucas Burch will be found, or that he will keep his promise when she catches up with him. When she arrives in Jefferson, Lucas is there, but he has changed his name to Joe Brown. Looking for Lucas, sweet, trusting Lena meets shy, mild-mannered Byron Bunch, who falls in love with Lena but feels honor-bound to help her find Joe Brown. Thoughtful and quietly religious, Byron is superior to Brown in every way but his shyness prevents him from revealing his feelings to Lena.     The novel then switches to the second plot strand, the story of Lucas Burch/Joe Browns partner Joe Christmas. The surly, psychopathic Christmas has been on the run for years, ever since at least injuring, perhaps even killing his strict ": null
    },
    {
        "Methodist": "methodist"
    },
    {
        " adopted father. Although he has light skin, Christmas suspects that he is of ": null
    },
    {
        "African American": "african american"
    },
    {
        " ancestry. Consumed with rage, he is a bitter outcast who wanders between black and white society, constantly provoking fights with blacks and whites alike. Christmas comes to Jefferson three years prior to the central events of the novel and gets a job at the mill where Byron, and later Joe Brown, works. The job at the mill is a cover for Christmass bootlegging operation, which is illegal under Prohibition. He has a sexual relationship with Joanna Burden, an older woman who descended from a formerly powerful abolitionist family whom the town despises as ": null
    },
    {
        "carpetbagger": "carpetbagger"
    },
    {
        "s. Though their relationship is passionate at first, Joanna begins menopause and turns to religion, which frustrates and angers Christmas. At the end of her relationship with Christmas, Joanna tries to force him, at gunpoint, to kneel and pray. Joanna is murdered soon after: her throat is slit and she is nearly decapitated.     The novel leaves readers uncertain whether Joe Christmas or Joe Brown is the murderer. Brown is Christmas business partner in bootlegging and is leaving Joannas burning house when a passing farmer stops to investigate and pull Joannas body from the fire. The sheriff at first suspects Joe Brown, but initiates a manhunt for Christmas after Brown claims that Christmas is black. The manhunt is fruitless until Christmas arrives undisguised in Mottstown, a neighboring town; he is on his way back to Jefferson, no longer running. In Mottstown, he is arrested and jailed, then moved to Jefferson. His grandparents arrive in town and visit Gail Hightower, the disgraced former minister of the town and friend of Byron Bunch. Bunch tries to convince Hightower to give the imprisoned Joe Christmas an alibi, but Hightower initially refuses. Though his grandfather wants Christmas lynched, his grandmother visits him in the Jefferson jail and advises him to seek help from Hightower. As police escort him to the local court, Christmas breaks free and runs to Hightowers house. A childishly cruel white vigilante, Percy Grimm, follows him there and, over Hightowers protest, shoots and castrates Christmas. Having redeemed himself at last, Hightower is then depicted as falling into a deathlike swoon, his whole life flashing before his eyes, including the past adventures of his ": null
    },
    {
        "Confederate": "confederate states of america"
    },
    {
        " grandfather, who was killed while stealing chickens from a farmers shed.     Before Christmas escape attempt, Hightower delivers Lenas child in the cabin where Brown and Christmas had been staying before the murder, and Byron arranges for Brown/Burch to come and see her. Brown deserts Lena once again, but Byron follows him and challenges him to a fight. Brown beats the braver, smaller Bunch, then skilfully hops a moving train and disappears. At the end of the story, an anonymous man is talking to his wife about two strangers he picked up on a trip to Tennessee, recounting that the woman had a child and the man was not the father. This was Lena and Byron, who were conducting a half-hearted search for Brown, and they are eventually dropped off in Tennessee.            ": null
    },
    {
        "New England": "new england"
    },
    {
        " who came to Jefferson after the ": null
    },
    {
        "Civil War": "civil war in the united states"
    },
    {
        ". She is unmarried, lives alone in a manor house outside of Jefferson, and is secretly engaged in a sexual relationship with Joe Christmas. She is murdered, presumably by Christmas, at the start of the novel, and her house is burned down.         Eupheus Doc Hines & ndash; the grandfather of Joe Christmas. He hates Christmas and gives him away to an orphanage when he is born, staying on as a janitor there in order to monitor the boy. Later, when he hears that Christmas is being held on suspicion of murdering Joanna Burden, he travels to Jefferson with his wife and begins to incite a lynch mob to kill Christmas.   Mrs. Hines & ndash; the grandmother of Joe Christmas. She has never seen Christmas after the night of his birth and travels to Jefferson to ensure that her husband does not successfully have him lynched, because she wants to see him again once more before he is tried for murder.   Milly Hines & ndash; the teenage mother of Joe Christmas. She conceives after a tryst with a member of a traveling circus, whom she claims is Mexican. She dies in childbirth after Eupheus Hines refuses to call a doctor for her.   Mr. McEachern & ndash; the adoptive father of Joe Christmas. He is a devout Presbyterian and tries to instill religion in the young orphan he has adopted. He disapproves of Christmass growing disobedience and is presumably killed by his adopted son when the boy is 42   Mrs. McEachern & ndash; the adoptive mother of Joe Christmas. She tries to protect Christmas, though he hates her and pulls away from her attempts to be kind to him.   The dietitian & ndash; a woman who worked at the orphanage where Joe Christmas was raised. After he accidentally sees her with a man in her room, she tries unsuccessfully to have him transferred to an all-black orphanage.   Mr. Armstid & ndash; a man who picks up Lena on her way to Jefferson, lets her spend the night at his house, and then gives her a ride to the city on his wagon.   Mrs. Armstid & ndash; Armstids wife, who gives Lena money in spite of her disdain for the young woman.   Bobbie & ndash; a waitress at a restaurant in ": null
    },
    {
        "Memphis": "memphis, tennessee"
    },
    {
        " whom the adolescent Joe Christmas falls in love with and proposes to on the night that he kills his father at a local dance. She scorns him and leaves him.   Gavin Stevens & ndash; an educated man and district attorney who lives in Jefferson and offers commentary on some of the events at the end of the novel.   Percy Grimm & ndash; the captain of the State ": null
    },
    {
        "National Guard": "national guard of the united states"
    },
    {
        " who kills Joe Christmas and castrates him.          Due to its naturalistic, violent subject matter and obsession with the ghosts of the past, Light in August is characterized as a Southern gothic novel, a genre also exemplified by the works of Faulkners contemporary ": null
    },
    {
        "Carson McCullers": "carson mccullers"
    },
    {
        ", and by later Southern writers like ": null
    },
    {
        "Flannery OConnor": "flannery oconnor"
    },
    {
        ", and ": null
    },
    {
        "Truman Capote": "truman capote"
    },
    {
        ". However, critics like Diane Roberts and David R. Jarraway view Faulkners use of Southern gothic genre ": null
    },
    {
        "trope": "trope"
    },
    {
        "s, such as the dilapidated plantation house and the focus on mystery and horror, as self-conscious modernist commentary on mans warped relationship with the past  and the impossibility of determining true identity.     According to Daniel Joseph Singal, Faulkners literary style gradually developed from 42th century ": null
    },
    {
        "Victorian": "victorian literature"
    },
    {
        " to modernist, with Light in August more firmly grounded in the tradition of the latter. The novel is characteristic of the modernist fascination with polarities & mdash;light and dark, good and evil & mdash;the burden of history on the present, and the splintering of personal identity. The plot is also divided into dual currents, one focusing on Lena Grove and the other on Joe Christmas, a technique that Faulkner continued to use in other works. The narrative is not structured in any particular order, as it is often interrupted by lengthy flashbacks and constantly shifts from one character to another. This lack of organization and narrative continuity was viewed negatively by some critics. As in his other novels, Faulkner employs elements of oral storytelling, allowing different characters to lend voice to the narrative in their own distinct Southern idiom. Unlike some of the other Yoknapatawpha County novels, Light in August does not rely solely on ": null
    },
    {
        "stream-of-consciousness": "stream of consciousness"
    },
    {
        " narration, but also incorporates dialogue and an omniscient ": null
    },
    {
        "third-person narrator": "narrative modethird-person view"
    },
    {
        " that develop the story.       The title refers to the fire of the house that is at the center of the story. The whole novel revolves around one event, the fire, which is visible for miles around, and happens in August.     Some critics have speculated that the meaning of the title derives from a ": null
    },
    {
        "colloquial": "colloquialism"
    },
    {
        " use of the word light to mean giving birth & mdash;typically used to describe when a cow will give birth and be light again & mdash;and connect this to Lenas pregnancy. Speaking of his choice of title, Faulkner denied this interpretation and stated,     . . .in August in Mississippi there’s a few days somewhere about the middle of the month when suddenly there’s a foretaste of fall, it’s cool, there’s a lambence, a soft, a luminous quality to the light, as though it came not from just today but from back in the old classic times. It might have fauns and satyrs and the gods and—from Greece, from Olympus in it somewhere. It lasts just for a day or two, then it’s gone. . .the title reminded me of that time, of a luminosity older than our Christian civilization.      Within the novel itself, the title is alluded to when Gail Hightower sits at his study window waiting for his recurring vision of his grandfathers last raid. The vision always occurs in that instant when all light has failed out of the sky and it would be night save for that faint light which daygranaried leaf and grass blade reluctant suspire, making still a little light on earth though night itself has come.  The story that would eventually become the novel, started by Faulkner in 42 was originally titled Dark House and began with Hightower sitting at a dark window in his home. However, after a casual remark by his wife Estelle on the quality of the light in August, Faulkner changed the title.           All of the protagonists in the novel are misfits and social outcasts surrounded by an impersonal and largely antagonistic rural community, which is represented ": null
    },
    {
        "metonymically": "metonymy"
    },
    {
        " through minor or anonymous characters. Joanna Burden and Reverend Hightower are hounded by the people of Jefferson for years, in a failed effort to make them leave town. Byron Bunch, though more accepted in Jefferson, is still viewed as a mystery or simply overlooked. Both Joe Christmas and Lena Grove are orphans, strangers in town, and social outcasts, though the former draws anger and violence from the community, while the latter is looked down upon but receives generous assistance in her travels. According to ": null
    },
    {
        "Cleanth Brooks": "cleanth brooks"
    },
    {
        ", this opposition between Joe and Lena is a ": null
    },
    {
        "pastoral": "pastoral"
    },
    {
        " reflection of the full spectrum of social alienation in modern society.       There are a variety of parallels with Christian scripture in the novel. The life and death of Joe Christmas is reminiscent of the ": null
    },
    {
        "passion of Christ": "passion of christ"
    },
    {
        ", Lena and her fatherless child parallel ": null
    },
    {
        "Mary": "mary, mother of jesus"
    },
    {
        " and Christ, and Byron Bunch acts as a ": null
    },
    {
        "Joseph": "saint joseph"
    },
    {
        " figure. Christian imagery such as the urn, the wheel, and the shadow, can be found throughout.     Light in August has 42 chapters, as does the ": null
    },
    {
        "Gospel of St. John": "gospel of st. john"
    },
    {
        ". As Virginia V. James Hlavsa points out, each chapter in Faulkner corresponds to themes in John. For example, echoing Johns famous, In the beginning was the Word, and the Word was with God , is Lenas insistent faith in the word of Lucas, who is, after all, the father. John 42 the healing of the lame man by immersion, is echoed by Christmass repeatedly being immersed in liquids. The teaching in the temple in John 42 is echoed by McEacherns attempts to teach Christmas his ": null
    },
    {
        "catechism": "catechism"
    },
    {
        ". The ": null
    },
    {
        "crucifixion": "crucifixion"
    },
    {
        " occurs in John 42 the same chapter in which Christmas is slain and castrated. However, the Christian references are dark and disturbing & mdash;Lena is obviously not a virgin, Christmas is an enraged murderer & mdash;and may be more appropriately viewed as ": null
    },
    {
        "pagan": "pagan"
    },
    {
        " idols mistakenly worshipped as saints.       Faulkner is considered one of the foremost American writers on ": null
    },
    {
        "race in the United States": "racism and ethnic discrimination in the united states"
    },
    {
        ", and his novels, including Light in August, often explore the persistent obsession with blood and race in the South that have carried over from the antebellum era to the 42st century. Christmas has light skin but is viewed as a foreigner by the people he meets, and the children in the orphanage in which he was raised call him nigger. Chapter 42 begins with the oft-cited sentence: Memory believes before knowing remembers, and gives an account of the five year old Christmas amongst the uniform denim of the other children. The first reference to him though is not by these children but by the dietitian who gave him a dollar to not tell about her amorous adventure with an intern doctor. However suspicion must fall on Doc Hines Joes deranged grandfather who placed him in the orphanage and stays on as the boilerman. It is he who may have whispered the lie about the little boys origins to the other children. Because of this, Joe Christmas is fixated on the idea that he has some African American blood, which Faulkner never confirms, and views his parentage as an ": null
    },
    {
        "original sin": "original sin"
    },
    {
        " that has tainted his body and actions since birth. Because of his obsessive struggle with his twin identities, black and white, Christmas lives his life always on the road. The secret of his blackness is one that he abhors as well as cherishes; he often willingly tells white people that he is black in order to see their extreme reactions and becomes violent when one white Northern woman reacts nonchalantly. Though Christmas is guilty of violent crimes, Faulkner emphasizes that he is under the sway of social and psychological forces that are beyond his control and force him to reenact the part of the mythical black murderer and rapist from Southern history.     Christmas exemplifies how existing outside of categorization, being neither black nor white, is perceived as a threat by society that can only be reconciled with violence. He is also perceived as neither male nor female, just as Joanna Burden, whom Faulkner portrays as masculinized, is also neither male nor female and is rejected by her community. Because of this, an early critic concluded that blackness and women were the twin Furies of the Faulknerian deep Southern Waste Land and reflected Faulkners animosity toward life.     However, while women and minorities are both viewed as subversive and are restricted by the ": null
    },
    {
        "patriarchal": "patriarchal"
    },
    {
        " society depicted in the novel, Lena Grove is able to travel safely and be cared for by people who hate and mistrust her, because she plays on the conventional rule that men are responsible for a womans wellbeing. Thus, she is the only stranger who is not alienated and destroyed by the people of Jefferson, because the community recognizes her as the embodiment of nature and life. This ": null
    },
    {
        "romantic": "romanticism"
    },
    {
        " view of women in the novel posits that men have lost their innocent connection to the natural world, while women instinctively possess it.       In Light in August, as in most of the other novels set in Yoknapatawpha County, Faulkner focuses mainly on poor white Southerners, both from the upper and lower classes, who struggle to survive in the ruined post-war economy of the South. The characters in Light in August & mdash;who are mostly from the lower classes, with the exception of Reverend Hightower and Joanna Burden & mdash;are united by poverty and Puritanical values that cause them to regard an unwed mother like Lena Grove with disdain. Faulkner shows the restrictiveness and aggression of their Puritanical zeal, which has caused them to become deformed in their struggle against nature.       When it was first published in 42 the novel was moderately successful; 42 copies were initially printed, with a total of four printings by the end of the year, although a significant number of copies from the fourth printing had not been sold by 42 In 42 ": null
    },
    {
        "Maurice Coindreau": "maurice coindreau"
    },
    {
        " translated the novel into French. In the same year, it was translated into German along with several other novels and short stories by Faulkner. These works initially met with approval from the ": null
    },
    {
        "Nazi": "nazi"
    },
    {
        " censors and received much attention from German literary critics, because they assumed that Faulkner was a ": null
    },
    {
        "conservative": "conservative"
    },
    {
        " agrarian": "agrarianism"
    },
    {
        " positively depicting the struggle for ": null
    },
    {
        "racial purity": "racial hygiene"
    },
    {
        "; soon after, however, Faulkners works were banned by the Nazis, and post-war German criticism reappraised him as an optimistic ": null
    },
    {
        "Christian humanist": "christian humanist"
    },
    {
        ". Faulkners books were not available in Germany until 42 because US army censors also did not approve of his work.     According to Michael Millgate, though it is not typically considered Faulkners best novel, Light in August was recognized early on as being a major text, central to any understanding or evaluation of his career as a whole.  He argues that many of the early American critics, most of whom were urban Northerners who viewed the South as backward and reactionary, focused on Faulkners technical innovation in the field of narrative but missed or ignored the regional details and interconnectedness of the characters and setting to other works by the author. Some reviewers saw Faulkners narrative techniques not as innovations but as errors, offering Faulkner recommendations on how to improve his style and admonishing him for his European modernist tricks . Critics were also displeased with the violence depicted in the novel, pejoratively labeling it gothic fantasy, despite the fact that lynching was a reality in the South. In spite of these complaints, the novel came to be viewed positively because of its violence and dark themes, as this was a contrast to the ": null
    },
    {
        "sentimental": "sentimentalism"
    },
    {
        ", ": null
    },
    {
        "romantic": "romantic novel"
    },
    {
        " Southern literature of the time.     In 42 the ": null
    },
    {
        "Modern Library": "modern library"
    },
    {
        " ranked Light in August 42th on its list of the ": null
    },
    {
        "42 best English-language novels of the 42th century": "modern library 100 best novels"
    },
    {
        ". Additionally, ": null
    },
    {
        "Time": "time"
    },
    {
        " magazine included the novel in its TIME 42 Best English-language Novels from 42 to 42.       ": null
    }
]