[
    {
        "     A light meter is a device used to measure the amount of light. In ": null
    },
    {
        "photography": "photography"
    },
    {
        ", a light meter is often used to determine the proper ": null
    },
    {
        "exposure": "exposure"
    },
    {
        " for a photograph. Typically a light meter will include either ": null
    },
    {
        "digital": "digital data"
    },
    {
        " or ": null
    },
    {
        "analog": "analog computer"
    },
    {
        " electronic circuit, which allows the photographer to determine which ": null
    },
    {
        "shutter speed": "shutter speed"
    },
    {
        " and ": null
    },
    {
        "f-number": "f-number"
    },
    {
        " should be selected for an optimum exposure, given a certain lighting situation and ": null
    },
    {
        "film speed": "film speed"
    },
    {
        ".     Light meters are also used in the fields of ": null
    },
    {
        "cinematography": "cinematography"
    },
    {
        " and ": null
    },
    {
        "scenic design": "scenic design"
    },
    {
        ", in order to determine the optimum light level for a scene. They are used in the general field of ": null
    },
    {
        "architectural lighting design": "architectural lighting design"
    },
    {
        " to verify proper installation and performance of a building lighting system, and in assessing the light levels for growing plants.                                 The earliest type of light meters were called  extinction meters and contained a numbered or lettered row of ": null
    },
    {
        "neutral density filter": "neutral density filter"
    },
    {
        "s of increasing density. The photographer would position the meter in front of his subject and note the filter with the greatest density that still allowed incident light to pass through. The letter or number corresponding to the filter was used as an index into a chart of appropriate aperture and shutter speed combinations for a given ": null
    },
    {
        "film speed": "film speed"
    },
    {
        ".     Extinction meters suffered from the problem that they depended on the ": null
    },
    {
        "light sensitivity of the human eye": "luminosity function"
    },
    {
        " and subjective interpretation.     Later meters removed the human element and relied on technologies incorporating ": null
    },
    {
        "selenium": "selenium"
    },
    {
        ", ": null
    },
    {
        "CdS": "cadmium sulfide"
    },
    {
        ", and ": null
    },
    {
        "silicon": "silicon"
    },
    {
        " photodetector": "photodetector"
    },
    {
        "s.           Selenium and silicon light meters use sensors that are ": null
    },
    {
        "photovoltaic": "photovoltaic"
    },
    {
        ": they generate a voltage proportional to light exposure. Selenium sensors generate enough voltage for direct connection to a meter; they need no battery to operate and this made them very convenient in completely mechanical cameras. Selenium sensors however cannot measure low light accurately and are altogether unable to measure very low light, such as candlelight, moonlight, starlight etc. Silicon sensors need an amplification circuit and require a power source such as ": null
    },
    {
        "batteries": "battery"
    },
    {
        " to operate. CdS light meters use a ": null
    },
    {
        "photoresistor": "photoresistor"
    },
    {
        " sensor whose electrical resistance changes proportionately to light exposure. These also require a battery to operate. Most modern light meters use silicon or CdS sensors. They indicate the exposure either with a needle ": null
    },
    {
        "galvanometer": "galvanometer"
    },
    {
        " or on an ": null
    },
    {
        "LCD": "lcd"
    },
    {
        " screen.     Many modern consumer still and video ": null
    },
    {
        "camera": "camera"
    },
    {
        "s include a built-in meter that measures a scene-wide light level and are able to make an approximate measure of appropriate exposure based on that. Photographers working with controlled lighting and ": null
    },
    {
        "cinematographer": "cinematographer"
    },
    {
        "s use handheld light meters to precisely measure the light falling on various parts of their subjects and use suitable lighting to produce the desired exposure levels.     There are two general types of light meters: reflected-light and incident-light. Reflected-light meters measure the light reflected by the scene to be photographed. All in-camera meters are reflected-light meters. Reflected-light meters are calibrated to show the appropriate exposure for “average” scenes. An unusual scene with a preponderance of light colors or specular highlights would have a higher reflectance; a reflected-light meter taking a reading would incorrectly compensate for the difference in ": null
    },
    {
        "reflectance": "reflectance"
    },
    {
        " and lead to underexposure. Badly underexposed sunset photos are common exactly because of this effect: the brightness of the setting sun fools the cameras light meter and, unless the in-camera logic or the photographer take care to compensate, the picture will be grossly underexposed and dull.     This pitfall is avoided by incident-light meters which measure the amount of light falling on the subject using an ": null
    },
    {
        "integrating sphere": "integrating sphere"
    },
    {
        " placed on top of the light sensor. Because the incident-light reading is independent of the subjects reflectance, it is less likely to lead to incorrect exposures for subjects with unusual average reflectance. Taking an incident-light reading requires placing the meter at the subjects position and pointing it in the general direction of the camera, something not always achievable in practice, e.g., in ": null
    },
    {
        "landscape photography": "landscape photography"
    },
    {
        " where the subject distance approaches infinity.     Another way to avoid under- or over-exposure for subjects with unusual reflectance is to use a spot meter: a reflected-light meter that measures light in a very tight ": null
    },
    {
        "cone": "elliptical cone"
    },
    {
        ", typically with a one degree circular ": null
    },
    {
        "angle of view": "angle of viewcalculating a cameras angle of view"
    },
    {
        ". An experienced photographer can take multiple readings over the shadows, midrange and highlights of the scene to determine optimal exposure, using systems like the ": null
    },
    {
        "Zone System": "zone system"
    },
    {
        ".     Many modern cameras include sophisticated ": null
    },
    {
        "multi-segment metering": "metering modemulti-zone metering"
    },
    {
        " systems that measure the ": null
    },
    {
        "luminance": "luminance"
    },
    {
        " of different parts of the scene to determine the optimal exposure. When using a film whose spectral sensitivity is not a good match to that of the light meter, for example ": null
    },
    {
        "orthochromatic": "orthochromatic"
    },
    {
        " black-and-white or infrared film, the meter may require special filters and re-calibration to match the sensitivity of the film.     There are other types of specialized photographic light meters. Flash meters are used in flash photography to verify correct exposure. Color meters are used where high fidelity in color reproduction is required. ": null
    },
    {
        "Densitometer": "densitometer"
    },
    {
        "s are used in photographic reproduction.         In most cases, an incident-light meter will cause a medium tone to be   recorded as a medium tone, and a reflected-light meter will cause   whatever is metered to be recorded as a medium tone. What   constitutes a “medium tone” depends on meter calibration and   several other factors, including film processing or digital image conversion.     Meter calibration establishes the relationship between subject lighting and recommended camera settings. The calibration of photographic light meters is   covered by ": null
    },
    {
        "ISO 42:42": "citeref iso2720:1974"
    },
    {
        ".         For reflected-light meters, camera settings are related to ISO speed and   subject luminance by the reflected-light exposure equation:       \\frac \\frac       where     N is the relative ": null
    },
    {
        "aperture": "aperture"
    },
    {
        "    t is the exposure time  in seconds   L is the average scene ": null
    },
    {
        "luminance": "luminance"
    },
    {
        " speed": "film speed"
    },
    {
        " illuminance": "illuminance"
    },
    {
        " Exposure value": "exposure value"
    },
    {
        " --  blockquote math /math math /math /blockquote  math /math math /math  math /math  math /math  blockquote /blockquote  math /math math /math math /math ref  /ref math /math math /math math /math  math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math  math /math  math /math ": null
    }
]