[
    {
        "In ": null
    },
    {
        "statistics": "statistics"
    },
    {
        ", the term linear model is used in different ways according to the context. The most common occurrence is in connection with regression models and the term is often taken as synonymous with ": null
    },
    {
        "linear regression": "linear regression"
    },
    {
        " model. However, the term is also used in ": null
    },
    {
        "time series analysis": "time series analysis"
    },
    {
        " with a different meaning. In each case, the designation linear is used to identify a subclass of models for which substantial reduction in the complexity of the related ": null
    },
    {
        "statistical theory": "statistical theory"
    },
    {
        " is possible.            For the regression case, the ": null
    },
    {
        "statistical model": "statistical model"
    },
    {
        " is as follows. Given a sample , \\, i 1, \\ldots, n the relation between the observations Y i  and the ": null
    },
    {
        "independent variables": "independent variables"
    },
    {
        " X ij  is formulated as     : Y_i \\beta_0 + \\beta_1 \\phi_1 + \\cdots + \\beta_p \\phi_p + \\varepsilon_i \\qquad i 1, \\ldots, n     where \\phi_1, \\ldots, \\phi_p may be nonlinear functions. In the above, the quantities ε i  are random variables representing errors in the relationship. The linear part of the designation relates to the appearance of the ": null
    },
    {
        "regression coefficient": "regression coefficient"
    },
    {
        "s, β j  in a linear way in the above relationship. Alternatively, one may say that the predicted values corresponding to the above model, namely   : \\hat_i \\beta_0 + \\beta_1 \\phi_1 + \\cdots + \\beta_p \\phi_p \\qquad ,   are linear functions of the β j .     Given that estimation is undertaken on the basis of a ": null
    },
    {
        "least squares": "least squares"
    },
    {
        " analysis, estimates of the unknown parameters β j  are determined by minimising a sum of squares function   : S \\sum_^n \\left^2 .   From this, it can readily be seen that the linear aspect of the model means the following:   :the function to be minimised is a quadratic function of the β j  for which minimisation is a relatively simple problem;   :the derivatives of the function are linear functions of the β j  making it easy to find the minimising values;   :the minimising values β j  are linear functions of the observations Y i ;   :the minimising values β j  are linear functions of the random errors ε i  which makes it relatively easy to determine the statistical properties of the estimated values of β j .         An example of a linear time series model is an ": null
    },
    {
        "autoregressive moving average model": "autoregressive moving average model"
    },
    {
        ". Here the model for values  in a time series can be written in the form     : X_t c + \\varepsilon_t + \\sum_^p \\phi_i X_ + \\sum_^q \\theta_i \\varepsilon_.\\,     where again the quantities ε t  are random variables representing ": null
    },
    {
        "innovations": "innovation"
    },
    {
        " which are new random effects that appear at a certain time but also affect values of X at later times. In this instance the use of the term linear model refers to the structure of the above relationship in representing X t  as a linear function of past values of the same time series and of current and past values of the innovations. Priestley, M.B. Non-linear and Non-stationary time series analysis, Academic Press.  This particular aspect of the structure means that it is relatively simple to derive relations for the mean and ": null
    },
    {
        "covariance": "covariance"
    },
    {
        " properties of the time series. Note that here the linear part of the term linear model is not referring to the coefficients φ i  and θ i , as it would be in the case of a regression model, which looks structurally similar.         There are some other instances where nonlinear model is used to contrast with a linearly structured model, although the term linear model is not usually applied. One example of this is ": null
    },
    {
        "nonlinear dimensionality reduction": "nonlinear dimensionality reduction"
    }
]