[
    {
        "In ": null
    },
    {
        "linear algebra": "linear algebra"
    },
    {
        ", the linear span  of a ": null
    },
    {
        "set": "set"
    },
    {
        "  of ": null
    },
    {
        "vectors": "vector space"
    },
    {
        " in a ": null
    },
    {
        "vector space": "vector space"
    },
    {
        " is the smallest ": null
    },
    {
        "linear subspace": "linear subspace"
    },
    {
        " that contains the set. It can be characterized either as the ": null
    },
    {
        "intersection": "intersection"
    },
    {
        " of all ": null
    },
    {
        "linear subspace": "linear subspace"
    },
    {
        "s that contain , or as the set of ": null
    },
    {
        "linear combination": "linear combination"
    },
    {
        "s of elements of . The linear span of a set of vectors is therefore a vector space. Spans can be generalized to ": null
    },
    {
        "matroid": "matroid"
    },
    {
        "s and ": null
    },
    {
        "modules": "module"
    },
    {
        ".     For expressing that a vector space  is a span of a set , one commonly uses the following phrases:  spans ;  generates ;  is spanned by ;  is generated by ;  is a spanning set of ;  is a ": null
    },
    {
        "generating set": "generating set"
    },
    {
        " of .         Given a ": null
    },
    {
        "vector space": "vector space"
    },
    {
        " V over a ": null
    },
    {
        "field": "field"
    },
    {
        " K, the span of a ": null
    },
    {
        "set": "set"
    },
    {
        " S of vectors is defined to be the intersection W of all ": null
    },
    {
        "subspaces": "linear subspace"
    },
    {
        " of V that contain S. W is referred to as the subspace spanned by S, or by the vectors in S. Conversely, S is called a spanning set of W, and we say that S spans W.     Alternatively, the span of S may be defined as the set of all finite ": null
    },
    {
        "linear combinations ": "linear combinations"
    },
    {
        " of elements of S, which follows from the above definition.     : \\operatorname \\left \\.     In particular, if S is a ": null
    },
    {
        "finite": "finite set"
    },
    {
        " subset of V, then the span of S is the set of all linear combinations of the elements of S. In the case of infinite S, infinite linear combinations  are excluded by the definition; a ": null
    },
    {
        "generalization": "linear combinationgeneralizations"
    },
    {
        " that allows these is not equivalent.            The ": null
    },
    {
        "real": "real number"
    },
    {
        " vector space R 42 has as a spanning set. This particular spanning set is also a ": null
    },
    {
        "basis": "basis"
    },
    {
        ". If were replaced by , it would also form the ": null
    },
    {
        "canonical basis": "standard basis"
    },
    {
        " of R 42 .     Another spanning set for the same space is given by , but this set is not a basis, because it is ": null
    },
    {
        "linearly dependent": "linear dependency"
    },
    {
        ".     The set is not a spanning set of R 42 ; instead its span is the space of all vectors in R 42 whose last component is zero. That space  is also spanned by the set , as is a linear combination of and . It does, however, span R 42 .     The empty set is a spanning set of since the empty set is a subset of all possible vector spaces in R 42 , and is the intersection of all of these vector spaces.     The set of functions x n  where n is a non-negative integer spans the space of polynomials.         Theorem 42: The subspace spanned by a non-empty subset S of a vector space V is the set of all linear combinations of vectors in S.     This theorem is so well known that at times it is referred to as the definition of span of a set.     Theorem 42: Every spanning set S of a vector space V must contain at least as many elements as any ": null
    },
    {
        "linearly independent": "linear independence"
    },
    {
        " set of vectors from V.     Theorem 42: Let V be a finite-dimensional vector space. Any set of vectors that spans V can be reduced to a basis for V by discarding vectors if necessary . If the ": null
    },
    {
        "axiom of choice": "axiom of choice"
    },
    {
        " holds, this is true without the assumption that V has finite dimension.     This also indicates that a basis is a minimal spanning set when V is finite-dimensional.       Generalizing the definition of the span of points in space, a subset X of the ground set of a ": null
    },
    {
        "matroid": "matroid"
    },
    {
        " is called a spanning set if the rank of X equals the rank of the entire ground set.     The vector space definition can also be generalized to modules.  Given an R-module A and a collection of elements a 42 ,…,a n of A, the ": null
    },
    {
        "submodule": "submodule"
    },
    {
        " of A spanned by a 42 ,…,a n is the sum of ": null
    },
    {
        "cyclic module": "cyclic module"
    },
    {
        "s     : Ra_42 + \\cdots + Ra_n \\left \\     consisting of all R-linear combinations of the elements a i . As with the case of vector spaces, the submodule of A spanned by any subset of A is the intersection of all submodules containing that subset.         In ": null
    },
    {
        "functional analysis": "functional analysis"
    },
    {
        ", a closed linear span of a ": null
    },
    {
        "set": "set"
    },
    {
        " of ": null
    },
    {
        "vectors": "vector space"
    },
    {
        " is the minimal closed set which contains the linear span of that set.     Suppose that X is a normed vector space and let E be any non-empty subset of X. The closed linear span of E, denoted by \\overline or \\overline , is the intersection of all the closed linear subspaces of X which contain E.     One mathematical formulation of this is     : \\overline\\.     The closed linear span of the set of functions x n  on the interval where n is a non-negative integer, depends on the norm used. If the ": null
    },
    {
        "L 42 norm": "lp spacelp spaces"
    },
    {
        " is used, then the closed linear span is the ": null
    },
    {
        "Hilbert space": "hilbert space"
    },
    {
        " of ": null
    },
    {
        "square-integrable function": "square-integrable function"
    },
    {
        "s on the interval. But if the ": null
    },
    {
        "maximum norm": "maximum norm"
    },
    {
        " is used, the closed linear span will be the space of continuous functions on the interval. In either case, the closed linear span contains functions that are not polynomials, and so are not in the linear span itself. However, the ": null
    },
    {
        "cardinality": "cardinality"
    },
    {
        " of the set of functions in the closed linear span is the ": null
    },
    {
        "cardinality of the continuum": "cardinality of the continuum"
    },
    {
        ", which is the same cardinality as for the set of polynomials.         The linear span of a set is dense in the closed linear span. Moreover, as stated in the lemma below, the closed linear span is indeed the ": null
    },
    {
        "closure": "closure"
    },
    {
        " of the linear span.     Closed linear spans are important when dealing with closed linear subspaces .         Let X be a normed space and let E be any non-empty subset of X. Then     \\overline is a closed linear subspace of X which contains E": null
    }
]