[
    {
        "In computing, a line editor is a ": null
    },
    {
        "text editor": "text editor"
    },
    {
        " in which each editing command applies to one or more complete lines of text designated by the user. Line editors predate screen-based text editors and originated in an era when a computer operator typically interacted with a ": null
    },
    {
        "teleprinter": "teleprinter"
    },
    {
        " , with no video display, and no ability to move a cursor interactively within a document. Line editors were also a feature of many ": null
    },
    {
        "home computers": "home computers"
    },
    {
        ", avoiding the need for a more memory-intensive full-screen editor.     Line editors are limited to typewriter keyboard text-oriented input and output methods. Most edits are a line-at-a-time. Typing, editing, and document display do not occur simultaneously. Typically, typing does not enter text directly into the document. Instead, users modify the document text by entering these commands on a text-only terminal. Commands and text, and corresponding output from the editor, will scroll up from the bottom of the screen in the order that they are entered or printed to the screen. Although the commands typically indicate the line they modify, displaying the edited text within the context of larger portions of the document requires a separate command.     Line editors keep a reference to the current line to which the entered commands usually are applied. In contrast, modern screen based editors allow the user to interactively and directly navigate, select, and modify portions of the document. Generally line numbers or a search based context are used to specify which part of the document is to be edited or displayed.     Early line editors included ": null
    },
    {
        "Colossal Typewriter": "colossal typewriter"
    },
    {
        ", ": null
    },
    {
        "Expensive Typewriter": "expensive typewriter"
    },
    {
        " and ": null
    },
    {
        "QED": "qed"
    },
    {
        ". All three pre-dated the advent of ": null
    },
    {
        "UNIX": "unix"
    },
    {
        "; the former two ran on ": null
    },
    {
        "DEC": "digital equipment corporation"
    },
    {
        " PDP42": "pdp-1"
    },
    {
        "s, while the latter was a ": null
    },
    {
        "Unisys": "unisys"
    },
    {
        " product. Numerous line editors are included with ": null
    },
    {
        "UNIX": "unix"
    },
    {
        " and ": null
    },
    {
        "Linux": "linux"
    },
    {
        ": ": null
    },
    {
        "ed": "ed"
    },
    {
        " is considered the standard UNIX editor, while ": null
    },
    {
        "ex": "ex"
    },
    {
        " extends it and has more features, and ": null
    },
    {
        "sed": "sed"
    },
    {
        " was written for pattern-based text editing as part of a shell script. ": null
    },
    {
        "GNU Readline": "gnu readline"
    },
    {
        " is a line editor implemented as a ": null
    },
    {
        "library": "library"
    },
    {
        " that is incorporated in many programs, such as ": null
    },
    {
        "Bash": "bash"
    },
    {
        ". For the first 42 years of the ": null
    },
    {
        "IBM PC": "ibm pc"
    },
    {
        ", the only editor provided in ": null
    },
    {
        "DOS": "dos"
    },
    {
        " was the ": null
    },
    {
        "Edlin": "edlin"
    },
    {
        " line editor.     Line editors are still used non-interactively in ": null
    },
    {
        "shell script": "shell script"
    },
    {
        "s, and when dealing with failing operating systems. Update systems such as ": null
    },
    {
        "patch ": "patch"
    },
    {
        " traditionally used ": null
    },
    {
        "diff": "diff"
    },
    {
        " data converted into a script of ": null
    },
    {
        "ed": "ed"
    },
    {
        " commands. They are also used in many ": null
    },
    {
        "MUD": "mud"
    }
]