[
    {
        "     A line drawing algorithm is a graphical ": null
    },
    {
        "algorithm": "algorithm"
    },
    {
        " for approximating a line segment on discrete graphical media. On discrete media, such as ": null
    },
    {
        "pixel": "pixel"
    },
    {
        "-based ": null
    },
    {
        "displays": "computer display"
    },
    {
        " and ": null
    },
    {
        "printers": "computer printer"
    },
    {
        ", line drawing requires such an approximation . Basic algorithms rasterize lines in one color. A better representation with multiple color gradations requires an advanced process, ": null
    },
    {
        "spatial anti-aliasing": "spatial anti-aliasing"
    },
    {
        ".     On continuous media, by contrast, no algorithm is necessary to draw a line. For example, ": null
    },
    {
        "oscilloscope": "oscilloscope"
    },
    {
        "s use natural phenomena to draw lines and curves.     The Cartesian slope-intercept equation for a straight line is   Y mx+b   With m representing the slope of the line and b as the y intercept. Given that the two endpoints of the line segment are specified at positions and . We can determine values for the slope m and y intercept b with the following calculations, m/ so, by42-m.x42 .          The following is a partial list of line drawing algorithms:   naive algorithm   ": null
    },
    {
        "Digital Differential Analyzer ": "digital differential analyzer"
    },
    {
        " — Similar to the naive line-drawing algorithm, with minor variations.   ": null
    },
    {
        "Bresenhams line algorithm": "bresenhams line algorithm"
    },
    {
        " — optimized to use only additions ; it also avoids floating-point computations.   ": null
    },
    {
        "Xiaolin Wus line algorithm": "xiaolin wus line algorithm"
    },
    {
        " — can perform spatial anti-aliasing, appears ropey from brightness varying along the length of the line   ": null
    },
    {
        "Gupta-Sproull algorithm": "gupta-sproull algorithm"
    },
    {
        "       The simplest method of screening is the direct drawing of the equation defining the line.       dx x42 - x42   dy y42 - y42   for x from x42 to x42       It is here that the points have already been ordered so that x_42 /math math /math math /math ": null
    }
]