[
    {
        "The science fiction sitcom genre is a relatively new one, having started significant growth only during the last few decades of the twentieth century.        ALF  – An alien living with a family on Earth    ALF: The Animated Series - Animated prequel to the sitcom  ALF .    Aliens in the Family  – ": null
    },
    {
        "Jim Henson Productions": "jim henson productions"
    },
    {
        " short-lived cross between  Dinosaurs  and  The Brady Bunch .    Astronauts  – The misadventures of a group of astronauts on a space station; written by two of ": null
    },
    {
        "The Goodies": "the goodies"
    },
    {
        ".    Cavemen  – Sitcom about prehistoric cavemen adapting to life in present-day ": null
    },
    {
        "Atlanta, Georgia": "atlanta, georgia"
    },
    {
        ". Based on the popular ": null
    },
    {
        "GEICO": "geico"
    },
    {
        " commercials.    Cleopatra 42  When complications arise during her breast augmentation surgery, 42th-century exotic dancer Cleo is put into suspended animation. Waking 42 years in the future, Cleo joins two women in their fight against the Baileys.    Clone  – About a created super soldier who is childlike and most likely to hug someone.    Clone High  – Animated comedy-drama about teenage clones of historical figures attending high school.    Come Back Mrs. Noah  – Housewife gets stranded on a space station.    Evil Con Carne  - Animated series about a brain of a Mexican playboy attached to a circus bear.    Far Out Space Nuts  – Two NASA maintenance workers accidentally launch a spaceship and have adventures in outer space.    Final Space  – Adult animated series about an astronaut named Gary Goodspeed and his alien friend, Mooncake, and focuses on their adventures as they try to solve the mystery of “Final Space”.    Futurama  – Adult animated series about a delivery boy who is cryogenically frozen and wakes up in the year 42    Garth Marenghis Darkplace  – Spoof horror/science-fiction soap set in an evil hospital.    Ghosted  – Sitcom about a secret organization of paranormal investigators.    Goodnight Sweetheart  – Man finds portal to the past, falls in love, starts leading a double life.    The Hilarious House of Frightenstein  – Spoof horror/science-fiction sitcom starring ": null
    },
    {
        "Vincent Price": "vincent price"
    },
    {
        " and ": null
    },
    {
        "Billy Van": "billy van"
    },
    {
        ".    The Hitchhikers Guide to the Galaxy  – ": null
    },
    {
        "Douglas Adams": "douglas adams"
    },
    {
        " science fiction farce, on radio, television, computer games, LPs, a towel, and a film.    Holmes & Yo-Yo  – a veteran cop finds himself partnered with a kind-hearted android.    Homeboys in Outer Space  – Short-lived ": null
    },
    {
        "UPN": "upn"
    },
    {
        " series.    Hyperdrive  – Set on a British spaceship in 42    Invader Zim  – an alien is sent to Earth, thinking it is his mission to destroy it, but his leaders are just trying to get rid of him.    Its About Time  – an early example of the genre, involving astronauts who travel back in time to meet a tribe of cavemen.    I Was a Sixth Grade Alien  – Sitcom about an alien child attending a human school.    The Jetsons  – Oldest SF comedy, a ": null
    },
    {
        "Hanna-Barbera": "hanna-barbera"
    },
    {
        " cartoon about George, Jane, Judy, and Elroy Jetson, family of the future.    The Journey of Allen Strange  – Series about an alien befriending a human family.    Kinvig  – a ": null
    },
    {
        "UFO": "unidentified flying object"
    },
    {
        " fanatic becomes convinced that the woman who continually rejects him is an alien queen; written by ": null
    },
    {
        "Nigel Kneale": "nigel kneale"
    },
    {
        " of ": null
    },
    {
        "Quatermass": "quatermass"
    },
    {
        " fame, but critically panned as not very funny.    The Last Man on Earth  – Post-apocalyptic series about a survivor of a virus.    Lexx  – a ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " dark and bloody comedy, not for fainthearted.    Lost in Space  – a ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " adaptation of  Swiss Family Robinson , which focuses around the misadventures of its breakout character, Dr. Zachary Smith.    The Lost Saucer  – a ": null
    },
    {
        "Sid & Marty Krofft": "sid  &  marty krofft"
    },
    {
        " series starring ": null
    },
    {
        "Jim Nabors": "jim nabors"
    },
    {
        " and ": null
    },
    {
        "Ruth Buzzi": "ruth buzzi"
    },
    {
        ".    Luna  – A synthetically produced family in a futuristic urban habitat.    Making History - Sitcom about unlikely friends engaging in time-travel.    Marvin Marvin  – An teenage alien from the planet Klooton goes to Earth to protect himself from evil invaders, starring ": null
    },
    {
        "Lucas Cruikshank": "lucas cruikshank"
    },
    {
        ", However, the show received negative reviews and got cancelled after one season.    Meego  – Childrens show in which a shape-shifting alien lives with a family.    Metal Mickey  – kids show in which a wise-cracking robot lives with a family.    The Middleman  – Based on a comic, it is about a secret organization that takes care of science fiction themed threats.    Mike & Angelo  – an alien comes to Earth and inadvertently causes chaos and havoc to the family he lives with.    Mork & Mindy  – spinoff of  Happy Days  starring ": null
    },
    {
        "Robin Williams": "robin williams"
    },
    {
        " and ": null
    },
    {
        "Pam Dawber": "pam dawber"
    },
    {
        ".    My Favorite Martian  – an alien living on Earth.    My First Planet  - British BBC radio sitcom set on a newly founded space colony.    My Hero  – An alien ": null
    },
    {
        "superhero": "superhero"
    },
    {
        " has difficulty maintaining his suburban secret identity.    My Living Doll  – A psychiatrist finds himself as custodian of an advanced ": null
    },
    {
        "android": "gynoid"
    },
    {
        " developed for space exploration.    Mystery Science Theater 42  – A man and two robots are trapped in orbit and are forced to watch bad films.    Nebulous  – ": null
    },
    {
        "Post-apocalyptic": "apocalyptic and post-apocalyptic fiction"
    },
    {
        " radio sitcom set in 42 after the Earth has been damaged by various environmental disasters.    The Neighbors - Sitcom about a human family in a gated community of aliens.    Not with a Bang  – Post-apocalyptic sitcom about the last people on Earth.    The Orville  – 42-hour episodic sci-fi dramedy, created by ": null
    },
    {
        "Seth MacFarlane": "seth macfarlane"
    },
    {
        ", about the titular U.S.S. Orville .    Other Space  – It follows a young and inexperienced crew as they adventure into an unknown universe to face mysterious clouds, food and fuel shortages, robot rebellions, folds in time, and the occasional alien attack.    Out of This World  – Childrens show about a half-alien girl.    Phil of the Future  – Show about a teenage boy named Phil from year 42 whose family went on vacation in 42 and wound up getting stuck there until the last episode.    Quark  – Show about space garbage collectors starring ": null
    },
    {
        "Richard Benjamin": "richard benjamin"
    },
    {
        ".    Red Dwarf  – Eclectic survivors aboard a mining ship marooned 42 million years travel from the solar system to return to Earth.    Rick and Morty  – Adult animated series about the misadventures of alcoholic scientist Rick and his easily influenced grandson Morty, who split their time between domestic family life and intergalactic space travel.    The Second Hundred Years  – Sitcom about a prospector frozen via ": null
    },
    {
        "cryogenics": "cryogenics"
    },
    {
        ", then brought back to live with his much older son and grandson his own age .    Space Ghost: Coast to Coast  – Adult animated series about a former superhero hosts a late-night talk show.    The Spaceship  – Radio sitcom set on a spaceship in 42 looking for alien life.    The Strangerers  – Two highly eccentric alien agents on an equally eccentric alternative Earth; ends on an unresolved cliffhanger.    They Came From Outer Space  – Two alien brothers from the planet Crouton ditch on their parents plans to send them to Cambridge University, instead going to California to live by the beach and learn about humans . Theyre chased by two bumbling Air Force members intent on their study.    Small Wonder  – About a father who invents a robot child.    42rd Rock from the Sun  – Four aliens try to fit into modern earth posing as a normal family.    Tripping the Rift  – Computer animated space opera satire.    The Troop  – Series about teenagers who secretly hunt monsters.    Undone  – Radio sitcom set in ": null
    },
    {
        "London": "london"
    },
    {
        " across various ": null
    },
    {
        "parallel universes": "parallel universe"
    },
    {
        ". One is Undone – Where the weirdness comes from.    Woops!  – Six survivors of a world ": null
    },
    {
        "nuclear holocaust": "nuclear holocaust"
    },
    {
        " live together in an abandoned farm house.        Ren & Stimpy   NewsRadio   The Big Bang Theory ": null
    }
]