[
    {
        "                                                                   Listed here are persons who have identified themselves as theologically ": null
    },
    {
        "agnostic": "Agnosticism"
    },
    {
        ". Also included are individuals who have expressed the view that the ": null
    },
    {
        "veracity": "Truth"
    },
    {
        " of a ": null
    },
    {
        "gods": "God"
    },
    {
        "existence is ": null
    },
    {
        "unknown": "Weak Agnosticism"
    },
    {
        " or inherently ": null
    },
    {
        "unknowable": "Strong Agnosticism"
    },
    {
        ".                                                                                                                                                        ": null
    },
    {
        "Saul Alinsky": "Saul Alinsky"
    },
    {
        " : American community organizer and writer;  Rules for Radicals       ": null
    },
    {
        "Poul Anderson": "Poul Anderson"
    },
    {
        " : American science fiction author    ": null
    },
    {
        "Piers Anthony": "Piers Anthony"
    },
    {
        " : English-American writer of science fiction and ": null
    },
    {
        "fantasy": "Fantasy"
    },
    {
        "    Susan B. Anthony": "Susan B. Anthony"
    },
    {
        " : American ": null
    },
    {
        "civil rights": "Civil Rights"
    },
    {
        " leader who played a pivotal role in the 19th century ": null
    },
    {
        "womens rights": "Womens Rights"
    },
    {
        " movement to introduce ": null
    },
    {
        "womens suffrage into the United States": "History Of Womens Suffrage In The United States"
    },
    {
        "; co-founder of the first Womens Temperance Movement with ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        " as President     ": null
    },
    {
        "Hannah Arendt": "Hannah Arendt"
    },
    {
        " : German American writer and political theorist    ": null
    },
    {
        "Samuel Beckett": "Samuel Beckett"
    },
    {
        " : Irish ": null
    },
    {
        "avant-garde": "Avant-Gardeexamples"
    },
    {
        " novelist, ": null
    },
    {
        "playwright": "Playwright"
    },
    {
        ", theatre director, and ": null
    },
    {
        "poet": "Poet"
    },
    {
        "; awarded the ": null
    },
    {
        "Nobel Prize in Literature": "Nobel Prize In Literature"
    },
    {
        " in 1969 They were both agnostics, though both set a high associative value on the language in which the traditional religions of their forebears had been expressed, and in conversation and writing were not averse to ironic reference to certain metaphysical concepts. Anthony Cronin, Samuel Beckett: the last modernist , page 90.   ": null
    },
    {
        "Ambrose Bierce": "Ambrose Bierce"
    },
    {
        " : American ": null
    },
    {
        "editorialist": "Editorialist"
    },
    {
        ", ": null
    },
    {
        "journalist": "Journalist"
    },
    {
        ", ": null
    },
    {
        "short story": "Short Story"
    },
    {
        " writer, ": null
    },
    {
        "fabulist": "Fabulist"
    },
    {
        " and ": null
    },
    {
        "satirist": "Satirist"
    },
    {
        "; known for his short story ": null
    },
    {
        "An Occurrence at Owl Creek Bridge": "An Occurrence At Owl Creek Bridge"
    },
    {
        " and his satirical lexicon  The Devils Dictionary  Contrary to McWilliamss claim, however, in the public arena Bierce was not merely an agnostic but a staunch unbeliever regarding the question of Jesus divinity. Donald T. Blume, Ambrose Bierces Civilians and soldiers in context: a critical study, page 323.   ": null
    },
    {
        "Jorge Luis Borges": "Jorge Luis Borges"
    },
    {
        " : ": null
    },
    {
        "Argentine": "Argentina"
    },
    {
        " writer  Being an agnostic means all things are possible, even God, even the Holy Trinity. This world is so strange that anything may happen, or may not happen. Being an agnostic makes me live in a larger, a more fantastic kind of world, almost uncanny. It makes me more tolerant.   ": null
    },
    {
        "Henry Cadbury": "Henry Cadbury"
    },
    {
        " : English biblical scholar and ": null
    },
    {
        "Quaker": "Quaker"
    },
    {
        " who contributed to the ": null
    },
    {
        "New Revised Standard Version": "New Revised Standard Version"
    },
    {
        " of the ": null
    },
    {
        "Bible": "Bible"
    },
    {
        " Henry Cadbury, , republished on the Quaker Universalist Fellowship website. Henry Cadbury stated in a 1936 lecture to ": null
    },
    {
        "Harvard Divinity School": "Harvard Divinity School"
    },
    {
        " students: Most students... wish to know whether I believe in the existence of God or in immortality, and if so why. They regard it impossible to leave these matters unsettled – or at least extremely detrimental to religion not to have the basis of such conviction. Now for my part I do not find it impossible to leave them open.... I can describe myself as no ardent theist or atheist.   ": null
    },
    {
        "Thomas Carlyle": "Thomas Carlyle"
    },
    {
        " : Scottish satirical writer, essayist, historian and teacher during the Victorian era I have recently argued that this linguistic indeterminacy, or as J. Hillis Miller terms it, undecidability, places Carlyle as a perhaps unwilling and yet important contributor to the upsurge of an anti- religious agnosticism that would set in motion the demise of orthodox belief both prophesied and dreaded by Nietzsche. Paul E. Kerry, Marylu Hill, Thomas Carlyle Resartus: Reappraising Carlyes Contribution to the Philosophy of History, Political Theory, and Cultural Criticism , page 69.   ": null
    },
    {
        "Ariel Dorfman": "Ariel Dorfman"
    },
    {
        " : Argentine/Chilean novelist, playwright, essayist, academic, and ": null
    },
    {
        "human rights": "Human Rights"
    },
    {
        " activist    ": null
    },
    {
        "Arthur Conan Doyle": "Arthur Conan Doyle"
    },
    {
        " : Scottish physician and writer; known for his stories about the detective ": null
    },
    {
        "Sherlock Holmes": "Sherlock Holmes"
    },
    {
        "; a prolific writer whose other works include science fiction stories, plays, romances, poetry, non-fiction and historical novels    ": null
    },
    {
        "W.E.B. Du Bois": "W.E.B. Du Bois"
    },
    {
        " : American ": null
    },
    {
        "sociologist": "Sociology"
    },
    {
        ", historian, ": null
    },
    {
        "civil rights": "Civil And Political Rights"
    },
    {
        " activist, ": null
    },
    {
        "Pan-Africanist": "Pan-Africanism"
    },
    {
        ", author and editor; co-founder of the ": null
    },
    {
        "National Association for the Advancement of Colored People": "National Association For The Advancement Of Colored People"
    },
    {
        " in 1909 To be clear, in all the annals of American and African American history, one will probably not find another agnostic as preoccupied with and as familiar with so much biblical, religious, and spiritual rhetoric as WEB Du Bois. Brian Johnson, W.E.B. Du Bois: Toward Agnosticism, 1868–1934, page 3.   ": null
    },
    {
        "Bart D. Ehrman": "Bart D. Ehrman"
    },
    {
        ": American ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        " scholar and a happy agnostic     ": null
    },
    {
        "Edward FitzGerald": "Edward Fitzgerald"
    },
    {
        " : English poet and writer, best known as the poet of the first and most famous English translation of  The Rubaiyat of Omar Khayyam     ": null
    },
    {
        "Betty Friedan": "Betty Friedan"
    },
    {
        " : American writer, ": null
    },
    {
        "activist": "Activism"
    },
    {
        " and ": null
    },
    {
        "feminist": "Feminism"
    },
    {
        "; a leading figure in the womens movement in the United States; her 1963 book,  The Feminine Mystique , is often credited with sparking the ": null
    },
    {
        " second wave of American feminism": "Second-Wave Feminism"
    },
    {
        " in the 20th century   To be sure, when she wrote her groundbreaking book, Friedan considered herself an agnostic Jew, unaffiliated with any religious branch or institution. Kirsten Fermaglich, American Dreams and Nazi Nightmares: Early Holocaust Consciousness and Liberal America, 1957–1965 , page 59.   ": null
    },
    {
        "Frederick James Furnivall": "Frederick James Furnivall"
    },
    {
        " : English second editor of the  Oxford English Dictionary     ": null
    },
    {
        "John Galsworthy": "John Galsworthy"
    },
    {
        " : English novelist and playwright;  The Forsyte Saga  and its sequels, A Modern Comedy and End of the Chapter; won the ": null
    },
    {
        "Nobel Prize in Literature": "Nobel Prize In Literature"
    },
    {
        " in 1932    ": null
    },
    {
        "Neil Gaiman": "Neil Gaiman"
    },
    {
        " : English author of short fiction, novels, comic books, ": null
    },
    {
        "graphic novel": "Graphic Novel"
    },
    {
        "s, audio theatre and films including the comic book series  The Sandman  and novels  Stardust ,  American Gods ,  Coraline , and  The Graveyard Book     ": null
    },
    {
        "Maxim Gorky": "Maxim Gorky"
    },
    {
        " : Russian and Soviet author who brought ": null
    },
    {
        "Socialist Realism": "Socialist Realism"
    },
    {
        " to literature ...Gorky – a religious agnostic praised as a social realist by the communist regime during the demise of imperial Russia... James Redmond, Drama and Philosophy, p. 161. Gorky had long rejected all organized religions. Yet he was not a materialist, and thus he could not be satisfied with Marxs ideas on religion. When asked to express his views about religion in a questionnaire sent by the French journal Mercure de France on April 15, 1907, Gorky replied that he was opposed to the existing religions of Moses, Christ, and Mohammed. He defined religious feeling as an awareness of a harmonious link that joins man to the universe and as an aspiration for synthesis, inherent in every individual. Tova Yedlin, Maxim Gorky: A Political Biography, p. 86.   ": null
    },
    {
        "Thomas Hardy": "Thomas Hardy"
    },
    {
        " : English novelist and poet; while his works typically belong to the Naturalism movement, several poems display elements of the previous Romantic and Enlightenment periods of literature, such as his fascination with the supernatural    ": null
    },
    {
        "Sadegh Hedayat": "Sadegh Hedayat"
    },
    {
        " : Iranian author and writer    ": null
    },
    {
        "Robert A. Heinlein": "Robert A. Heinlein"
    },
    {
        " : American science fiction writer     ": null
    },
    {
        "Joseph Heller": "Joseph Heller"
    },
    {
        " : American satirical novelist, short story writer, and playwright;  Catch-22     ": null
    },
    {
        "Alexander Herzen": "Alexander Herzen"
    },
    {
        " : Russian writer and thinker; the father of Russian socialism ; one of the main fathers of agrarian populism    ": null
    },
    {
        "Aldous Huxley": "Aldous Huxley"
    },
    {
        " : English writer of novels, such as  Brave New World , and wide-ranging ": null
    },
    {
        "essays": "Essay"
    },
    {
        "    A.J. Jacobs": "A.J. Jacobs"
    },
    {
        " : American author During an interview on his book The Year of Living Biblically with George Stroumboulopoulos on the CBC Program The Hour Jacobs states Im still an agnostic, I dont know whether theres a god.    ": null
    },
    {
        "James Joyce": "James Joyce"
    },
    {
        " : Irish novelist and poet, considered to be one of the most influential writers in the ": null
    },
    {
        "modernist": "Modernist"
    },
    {
        " avant-garde ": null
    },
    {
        "movement": "Art Movement"
    },
    {
        " of the early 20th century; best known for his novel  Ulysses  Neither Joyces agnosticism nor his sexual libertinism were known to his mentors at Belvedere and he remained to the end a Prefect of the Sodality of Mary. Bruce Stewart, James Joyce , p. 14.   ": null
    },
    {
        "Franz Kafka": "Franz Kafka"
    },
    {
        " : Czech-born Jewish writer Kafka did not look at writing as a gift in the traditional sense. If anything, he considered both his talent for writing and what he produced as a writer curses for some unknown sin. Since Kafka was agnostic or even an atheist, it is best to assume his sense of sin and curse were metaphors. , Tameri.com.   Kafka was also alienated from his own heritage by his parents perfunctory religious practice and minimal social formality in the Jewish community, though his style and influence is sometimes attributed to Jewish folk lore. Kafka eventually declared himself a socialist atheist, Spinoza, Darwin and Nietzsche some of his influences. C. D. Merriman, .   ": null
    },
    {
        "John Keats": "John Keats"
    },
    {
        " : English ": null
    },
    {
        "Romantic": "Romanticism"
    },
    {
        " poet Keats shared Hunts dislike of institutionalized Christianity, parsons, and the Christian belief in mans innate corruption, but, as an unassertive agnostic, held well short of Shelleys avowed atheism. John Barnard, John Keats, pp. 38–39.   ": null
    },
    {
        "Janusz Korczak": "Janusz Korczak"
    },
    {
        " : Polish Jewish educator, childrens author and ": null
    },
    {
        "pediatrician": "Pediatrics"
    },
    {
        ". After spending many years working as director of an orphanage in Warsaw, Korczak refused freedom and remained with the orphans as they were sent to ": null
    },
    {
        "Treblinka extermination camp": "Treblinka Extermination Camp"
    },
    {
        " during the ": null
    },
    {
        "Grossaktion Warsaw": "Grossaktion Warsaw"
    },
    {
        " of 1942.      ": null
    },
    {
        "Stanislaw Lem": "Stanislaw Lem"
    },
    {
        " : Polish science fiction novelist and essayist    ": null
    },
    {
        "H. P. Lovecraft": "H. P. Lovecraft"
    },
    {
        " : American writer of strange fiction and ": null
    },
    {
        "horror": "Horror Fiction"
    },
    {
        " Lucretius": "Lucretius"
    },
    {
        " : Roman poet and philosopher Lucretius did not deny the existence of gods either, but he felt that human ideas about gods combined with the fear of death to make human beings unhappy. He followed the same materialist lines as Epicurus, and by denying that the gods had any way of influencing our world he said that humankind had no need to fear the supernatural. . BBC.co.uk.   ": null
    },
    {
        "Bernard Malamud": "Bernard Malamud"
    },
    {
        " : American author of novels and short stories; one of the great American Jewish authors of the 20th century    ": null
    },
    {
        "H. L. Mencken": "H. L. Mencken"
    },
    {
        " : German-American journalist, satirist, social critic, ": null
    },
    {
        "cynic": "Cynicism"
    },
    {
        " and ": null
    },
    {
        "freethinker": "Freethought"
    },
    {
        ", known as the Sage of Baltimore When asked what he would do if on his death he found himself facing the twelve apostles, the agnostic Mencken answered, I would simply say, Gentlemen, I was mistaken. , PBS Online, 1999–2001. Retrieved 28 July 2007.   ": null
    },
    {
        "Thomas Mann": "Thomas Mann"
    },
    {
        " : German novelist, short story writer, social critic, philanthropist, essayist, and 1929 ": null
    },
    {
        "Nobel Prize laureate": "Nobel Prize Laureate"
    },
    {
        ", known for his series of highly symbolic and ironic epic novels and novellas, noted for their insight into the psychology of the artist and the intellectual    ": null
    },
    {
        "Vladimir Nabokov": "Vladimir Nabokov"
    },
    {
        " : Russian novelist, poet and short story writer; known for his novel  Lolita    Nabokov is a self-affirmed agnostic in matters religious, political, and philosophical. Donald E. Morton, Vladimir Nabokov , p. 8.   ": null
    },
    {
        "Eugene ONeill": "Eugene Oneill"
    },
    {
        " , American playwright; won the ": null
    },
    {
        "Nobel Prize in Literature": "Nobel Prize In Literature"
    },
    {
        " in 1936 ONeill, an agnostic and an anarchist, maintained little hope in religion or politics and saw institutions not serving to preserve liberty but standing in the way of the birth of true freedom. John P. Diggins, Eugene ONeills America: desire under democracy , p. 130.   ": null
    },
    {
        "Larry Niven": "Larry Niven"
    },
    {
        " : American ": null
    },
    {
        "science fiction author": "Science Fiction Author"
    },
    {
        ";  Ringworld     ": null
    },
    {
        "Fernando Pessoa": "Fernando Pessoa"
    },
    {
        " : Portuguese poet, writer, literary critic and translator, described as one of the most significant literary figures of the 20th century and one of the greatest poets in the Portuguese language    ": null
    },
    {
        "Marcel Proust": "Marcel Proust"
    },
    {
        " : French novelist, critic and essayist, known for his work  In Search of Lost Time  Marcel Proust was the son of a Christian father and a Jewish mother. He himself was baptized and later confirmed as a Catholic, but he never practiced that faith and as an adult could best be described as a mystical atheist, someone imbued with spirituality who nonetheless did not believe in a personal God, much less in a savior. Edmund White, Marcel Proust: A Life .    ": null
    },
    {
        "Philip Pullman": "Philip Pullman"
    },
    {
        " : English childrens author of the trilogy  His Dark Materials ; has said that he is technically an agnostic,  though he also calls himself an ": null
    },
    {
        "atheist": "Atheist"
    },
    {
        "    Alexander Pushkin": "Alexander Pushkin"
    },
    {
        " : Russian author of the Romantic era, considered by many to be the greatest Russian poet and the founder of modern ": null
    },
    {
        "Russian literature": "Russian Literature"
    },
    {
        "    Edward Said": "Edward Said"
    },
    {
        " : ": null
    },
    {
        "Palestinian-American": "Palestinian-American"
    },
    {
        " literary ": null
    },
    {
        "theorist": "Literary Theory"
    },
    {
        " and advocate for ": null
    },
    {
        "Palestinian": "Palestinian People"
    },
    {
        " rights; ": null
    },
    {
        "University Professor": "University Professor"
    },
    {
        " of English and Comparative Literature at ": null
    },
    {
        "Columbia University": "Columbia University"
    },
    {
        "; a founding figure in ": null
    },
    {
        "postcolonialism": "Postcolonialism"
    },
    {
        "     Arthur M. Schlesinger Jr.": "Arthur M. Schlesinger Jr."
    },
    {
        " : American historian and ": null
    },
    {
        "Pulitzer Prize": "Pulitzer Prize"
    },
    {
        "–winning writer    ": null
    },
    {
        "Mary Shelley": "Mary Shelley"
    },
    {
        " : English novelist, short story writer, dramatist, essayist, biographer, and travel writer, best known for her Gothic novel  Frankenstein     ": null
    },
    {
        "Edward Snowden": "Edward Snowden"
    },
    {
        " : American computer specialist, privacy activist and former CIA employee and NSA contractor; disclosed classified details of several top-secret United States and British government mass surveillance programs    ": null
    },
    {
        "Elizabeth Cady Stanton": "Elizabeth Cady Stanton"
    },
    {
        " : American ": null
    },
    {
        "social activist": "Social Activism"
    },
    {
        ", abolitionist, and leading figure of the early ": null
    },
    {
        "womans movement": "Womens Rights Movement"
    },
    {
        ". Her ": null
    },
    {
        "Declaration of Sentiments": "Declaration Of Sentiments"
    },
    {
        ", presented at the ": null
    },
    {
        "Seneca Falls Convention": "Seneca Falls Convention"
    },
    {
        " held in 1848 in ": null
    },
    {
        "Seneca Falls": "Seneca Falls , New York"
    },
    {
        ", ": null
    },
    {
        "New York": "New York"
    },
    {
        ", is often credited with initiating the first organized womans rights and ": null
    },
    {
        "womans suffrage": "Womans Suffrage"
    },
    {
        " movements in the United States.  Late in life she led the effort to write the  Womans Bible  to correct the injustices she perceived against women in the Bible.   ": null
    },
    {
        "Olaf Stapledon": "Olaf Stapledon"
    },
    {
        " : English philosopher and author of several influential works of science fiction    ": null
    },
    {
        "John Steinbeck": "John Steinbeck"
    },
    {
        " : American writer known for novels such as  The Grapes of Wrath  and  East of Eden ; won the ": null
    },
    {
        "Nobel Prize in Literature": "Nobel Prize In Literature"
    },
    {
        " in 1962    ": null
    },
    {
        "Stendhal": "Stendhal"
    },
    {
        " : French writer It must be extremely consoling, he admitted, to have faith in religion, yet even for an agnostic, like himself, life held many beautiful realities – the art of Raphael or Titian, the prose of Voltaire and the poetry of Byron in Don Juan. F. C. Green, Stendhal , p. 200.   ": null
    },
    {
        "Boris Strugatsky": "Boris Strugatsky"
    },
    {
        " : Soviet-Russian science fiction author who collaborated with his brother, Arkady Strugatsky, on various works; their novel Piknik na obochine was translated into ": null
    },
    {
        "English": "English Language"
    },
    {
        " as  Roadside Picnic  in 1977 and was filmed by ": null
    },
    {
        "Andrei Tarkovsky": "Andrei Tarkovsky"
    },
    {
        " under the title  Stalker     ": null
    },
    {
        "Charles Templeton": "Charles Templeton"
    },
    {
        " : Canadian ": null
    },
    {
        "evangelist": "Evangelism"
    },
    {
        "; author of A Farewell to God CBC News reports that Templeton eventually abandoned the pulpit and became an agnostic. https://web.archive.org/web/20020131034308/http://cbc.ca/cgi-bin/templates/view.cgi?categoryCanada & story%2Fnews%2F2001%2F06%2F07%2Ftempleton_010607 Journalist, evangelist Charles Templeton dies   ": null
    },
    {
        "Thucydides": "Thucydides"
    },
    {
        " : Greek historian and author from ": null
    },
    {
        "Alimos": "Alimos"
    },
    {
        ". His History of the Peloponnesian War recounts the 5th-century BC war between Sparta and Athens to the year 411 BC. Thucydides has been dubbed the father of scientific history , because of his strict standards of evidence-gathering and analysis in terms of cause and effect without reference to intervention by the gods, as outlined in his introduction to his work.      ": null
    },
    {
        "Ivan Turgenev": "Ivan Turgenev"
    },
    {
        " : Russian novelist, short story writer and playwright;  A Sportsmans Sketches ,  Fathers and Sons  For example, Leonard Schapiro, Turgenev, His Life and Times 214, writes about Turgenevs agnosticism as follows: Turgenev was not a determined atheist; there is ample evidence which shows that he was an agnostic who would have been happy to embrace the consolations of religion, but was, except perhaps on some rare occasions, unable to do so ; and Edgar Lehrman, Turgenevs Letters xi, presents still another interpretation for Turgenevs lack of religion, suggesting literature as a possible substitution: Sometimes Turgenevs attitude toward literature makes us wonder whether, for him, literature was not a surrogate religion – something in which he could believe unhesitatingly, unreservedly, and enthusiastically, something that somehow would make man in general and Turgenev in particular a little happier. Harold Bloom, Ivan Turgenev, pp. 95–96.   ": null
    },
    {
        "Mark Twain": "Mark Twain"
    },
    {
        ": American ": null
    },
    {
        "humorist": "List Of Humorists"
    },
    {
        ", satirist, lecturer and writer, most noted for his novels Adventures of Huckleberry Finn and The Adventures of Tom Sawyer; In one of our walks about Hartford, when he was in the first fine flush of his agnosticism, he declared that Christianity had done nothing to improve morals and conditions... ": null
    },
    {
        "William Dean Howells": "William Dean Howells"
    },
    {
        ", My Mark Twain . ": null
    },
    {
        "William Dean Howells": "William Dean Howells"
    },
    {
        " and ": null
    },
    {
        "Mark Twain": "Mark Twain"
    },
    {
        " had much in common. They were agnostic but compassionate of the plight of man in an indifferent world... Darrel Abel , Classic Authors of the Gilded Age, iUniverse,  has also been identified a ": null
    },
    {
        "deist": "Deist"
    },
    {
        " At the most, Mark Twain was a mild agnostic, usually he seems to have been an amused Deist. Yet, at this late date his own daughter has refused to allow his comments on religion to be published. Kenneth Rexroth, Humor in a Tough Age; The Nation, 7 March 1959.    ": null
    },
    {
        "Adam Bruno Ulam": "Adam Bruno Ulam"
    },
    {
        " : Polish and American historian and ": null
    },
    {
        "political scientist": "Political Scientist"
    },
    {
        " at ": null
    },
    {
        "Harvard University": "Harvard University"
    },
    {
        "; one of the worlds foremost authorities on ": null
    },
    {
        "Russia": "Russia"
    },
    {
        " and the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ", and the author of twenty books and many articles    ": null
    },
    {
        "Ibn Warraq": "Ibn Warraq"
    },
    {
        ": known for his books critical of Islam Warraq, 60, describes himself now as an agnostic... , World Magazine, 16 June 2007, Vol. 22, No. 22.   ": null
    },
    {
        "Hale White": "Hale White"
    },
    {
        " : British writer and civil servant    ": null
    },
    {
        "Elie Wiesel": "Elie Wiesel"
    },
    {
        " : ": null
    },
    {
        "Romanian": "Romanians"
    },
    {
        "-born Jewish-American writer, professor, political activist and ": null
    },
    {
        "Holocaust survivor": "List Of Holocaust Survivors"
    },
    {
        "; author of 57 books, including Night, a work based on his experiences as a prisoner in the ": null
    },
    {
        "Auschwitz": "Auschwitz"
    },
    {
        ", Buna and Buchenwald ": null
    },
    {
        "concentration camps": "Nazi Concentration Camps"
    },
    {
        "; awarded the ": null
    },
    {
        "Nobel Peace Prize": "Nobel Peace Prize"
    },
    {
        " in 1986    ": null
    },
    {
        "Robert Anton Wilson": "Robert Anton Wilson"
    },
    {
        " : American author, ": null
    },
    {
        "futurologist": "Futurology"
    },
    {
        ", and ": null
    },
    {
        "cryptocracy": "Shadow Government"
    },
    {
        " historian Wilson explains that he is agnostic about everything in  .   ": null
    },
    {
        "Mary Wollstonecraft": "Mary Wollstonecraft"
    },
    {
        " : English writer, philosopher, and advocate of ": null
    },
    {
        "womens rights": "Womens Rights"
    },
    {
        ". During her brief career, she wrote novels, treatises, a ": null
    },
    {
        "travel narrative": "Travel Literature"
    },
    {
        ", a history of the ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        ", a ": null
    },
    {
        "conduct book": "Conduct Book"
    },
    {
        ", and a childrens book. Wollstonecraft is best known for  A Vindication of the Rights of Woman  , in which she argues that women are not naturally inferior to men, but appear to be only because they lack education. She suggests that both men and women should be treated as rational beings and imagines a social order founded on reason.    ": null
    },
    {
        "David Yallop": "David Yallop"
    },
    {
        " : English ": null
    },
    {
        "true crime": "True Crime"
    },
    {
        " author The Herald, Why did this saint fail to act on sinners within his flock? , Anne Simpson, 26 May 2007   ": null
    },
    {
        "Émile Zola": "Émile Zola"
    },
    {
        " : French writer; prominent figure in the literary ": null
    },
    {
        "school of naturalism": "Naturalism"
    },
    {
        "; important contributor to the development of ": null
    },
    {
        "theatrical naturalism": "Naturalism"
    },
    {
        "        Leslie Alexander": "Leslie Alexander"
    },
    {
        " : American sports owner, owner of the ": null
    },
    {
        "Houston Rockets": "Houston Rockets"
    },
    {
        "    Warren Buffett": "Warren Buffett"
    },
    {
        " , American investor; identified himself as agnostic in response to ": null
    },
    {
        "Warren Allen Smith": "Warren Allen Smith"
    },
    {
        ", who had asked him whether he believed in God Faces of the New Atheism: The Scribe, by Nicholas Thompson, Wired Magazine, Issue 14.11, November 2006 .   ": null
    },
    {
        "Henry Dunant": "Henry Dunant"
    },
    {
        " : Swiss businessman and social activist; founder of ": null
    },
    {
        "International Committee of the Red Cross": "International Committee Of The Red Cross"
    },
    {
        "; in 1901 he received the first ": null
    },
    {
        "Nobel Peace Prize": "Nobel Peace Prize"
    },
    {
        ", together with ": null
    },
    {
        "Frédéric Passy": "Frédéric Passy"
    },
    {
        " The first Nobel Peace Prize went, in 1901, to Henri Dunant. Dunant was the founder of the Red Cross, but he could not become its first elective head-so it is widely believed – because of his agnostic views. Oscar Riddle, The Unleashing of Evolutionary Thought , p. 343.   ": null
    },
    {
        "Elon Musk": "Elon Musk"
    },
    {
        " : ": null
    },
    {
        "South African American": "South African American"
    },
    {
        " inventor and entrepreneur best known for founding ": null
    },
    {
        "SpaceX": "Spacex"
    },
    {
        " and co-founding ": null
    },
    {
        "Tesla Motors": "Tesla Motors"
    },
    {
        " and ": null
    },
    {
        "PayPal": "Paypal"
    },
    {
        "     Ted Turner": "Ted Turner"
    },
    {
        ": American founder of ": null
    },
    {
        "Turner Broadcasting System": "Turner Broadcasting System"
    },
    {
        ", now part of Time Warner        ": null
    },
    {
        "John Adams": "John Adams"
    },
    {
        " : American composer    ": null
    },
    {
        "Hideaki Anno": "Hideaki Anno"
    },
    {
        " : Japanese animation and film director; known for his work on the popular anime series  Neon Genesis Evangelion    On his religious beliefs:   ANNO: I dont belong to any kind of organized religion, so I guess I could be considered agnostic. Japanese spiritualism holds that there is kami in everything, and thats closer to my own beliefs. .   ": null
    },
    {
        "Simon Baker": "Simon Baker"
    },
    {
        " : Australian television and movie actor I was religious when I was younger. I was Catholic, raised Catholic. I had certain issues about that. I consciously lapsed. I made a conscious decision to avoid it. Im agnostic. Im not saying I dont have faith; I absolutely have faith but dont necessarily have faith in God. I have faith in humanity. Guardians Simon Baker refocuses anger of youth into busy career by Luane Lee, Scripps Howard News Service, 2 January 2003.   ": null
    },
    {
        "David Bazan": "David Bazan"
    },
    {
        " : American singer, songwriter, musician and former frontman of ": null
    },
    {
        "Pedro The Lion": "Pedro The Lion"
    },
    {
        ", an indie rock outfit associated with ": null
    },
    {
        "Christian rock": "Christian Rock"
    },
    {
        " that was controversial among Christians for their language and off-kilter views about religion; his solo career has been focused around his newfound agnosticism.   ": null
    },
    {
        "Monica Bellucci": "Monica Bellucci"
    },
    {
        " : Italian actress and fashion model    ": null
    },
    {
        "Tom Bergeron": "Tom Bergeron"
    },
    {
        " : American television personality and ": null
    },
    {
        "game show host": "Game Show Host"
    },
    {
        "; host of  Americas Funniest Home Videos ,  Hollywood Squares  and  Dancing with the Stars    in which he mentions his agnosticism.   ": null
    },
    {
        "Ingmar Bergman": "Ingmar Bergman"
    },
    {
        " : Swedish director, writer and producer for film, stage and television    ": null
    },
    {
        "Irving Berlin": "Irving Berlin"
    },
    {
        " : American composer and lyricist of Jewish heritage, widely considered one of the greatest songwriters in American history God Bless America, a favorite song of believers, was written by Irving Berlin. It now turns out that Berlin was an agnostic. In Freethought Today Dan Barker documents that Berlin, the son of a Jewish cantor, was an agnostic, that patriotism was his religion. Warren Allen Smith, Gossip from Across the Pond: Articles Published in the United Kingdoms Gay and Lesbian Humanist, 1996–2005, p. 106.   ": null
    },
    {
        "Hector Berlioz": "Hector Berlioz"
    },
    {
        " : French Romantic composer    ": null
    },
    {
        "Gael García Bernal": "Gael García Bernal"
    },
    {
        " : Mexican actor and director; claims to be culturally ": null
    },
    {
        "Catholic": "Catholic Church"
    },
    {
        " and spiritually ": null
    },
    {
        "agnostic": "Agnostic"
    },
    {
        "     Lewis Black": "Lewis Black"
    },
    {
        " : American stand-up comedian, author, playwright, social critic and actor    ": null
    },
    {
        "Johannes Brahms": "Johannes Brahms"
    },
    {
        " : German composer and pianist    ": null
    },
    {
        "Georges Brassens": "Georges Brassens"
    },
    {
        " : French singer-songwriter and poet    ": null
    },
    {
        "Benjamin Britten": "Benjamin Britten"
    },
    {
        " : English composer, conductor, and pianist; a central figure of 20th-century ": null
    },
    {
        "British classical music": "British Classical Music"
    },
    {
        " His life partner, Peter Pears, would describe Britten as an agnostic with a great love for Jesus Christ.        ": null
    },
    {
        "Gavin Bryars": "Gavin Bryars"
    },
    {
        " : English composer and double bassist    ": null
    },
    {
        "Rose Byrne": "Rose Byrne"
    },
    {
        " , Australian actress Actress Rose Byrne on ‘Knowing’ Religion & the End of the World in BBook.com:   Yeah, Id say Im agnostic .   ": null
    },
    {
        "Dick Cavett": "Dick Cavett"
    },
    {
        " : American television talk show host    ": null
    },
    {
        "Charlie Chaplin": "Charlie Chaplin"
    },
    {
        " : English comic actor, film director and composer best known for his work in the United States during the silent film era    ": null
    },
    {
        "Aaron Copland": "Aaron Copland"
    },
    {
        " : American composer    ": null
    },
    {
        "Salvador Dalí": "Salvador Dalí"
    },
    {
        " : Spanish surrealist painter born in Figueres, Spain. Dalí, a skilled draftsman, became best known for the striking and bizarre images in his surrealist work. His painterly skills are often attributed to the influence of Renaissance masters. His arguably best-known work,  The Persistence of Memory , was completed in 1931. Dalís expansive artistic repertoire included film, sculpture, and photography, in collaboration with a range of artists in a variety of media. He allegedly claimed to be both an agnostic and a Roman Catholic.    ": null
    },
    {
        "Daniel Day-Lewis": "Daniel Day-Lewis"
    },
    {
        " : English-Irish actor, three-time ": null
    },
    {
        "Academy Award for Best Actor": "Academy Award For Best Actor"
    },
    {
        " winner    ": null
    },
    {
        "Leonardo DiCaprio": "Leonardo Dicaprio"
    },
    {
        " : American actor Hiatt, Brian .  . Rolling Stone. Im not an atheist, Im agnostic. What I honestly think about is the planet, not my specific spiritual soul floating around.   ": null
    },
    {
        "Ronnie James Dio": "Ronnie James Dio"
    },
    {
        " : American heavy metal singer     ": null
    },
    {
        "Richard Dreyfuss": "Richard Dreyfuss"
    },
    {
        " : American actor    ": null
    },
    {
        "Thomas Eakins": "Thomas Eakins"
    },
    {
        " : American realist painter, photographer, sculptor, and fine arts educator; widely acknowledged to be one of the most important artists in American art history       ": null
    },
    {
        "Christopher Eccleston": "Christopher Eccleston"
    },
    {
        " : English actor    ": null
    },
    {
        "Zac Efron": "Zac Efron"
    },
    {
        " : American actor, star of movies such as  High School Musical  and  17 Again ;   By Tina Sims, The National Ledger, 1 August 2007 was raised ": null
    },
    {
        "agnostic": "Agnosticism"
    },
    {
        " I was raised agnostic, so we never practiced religion... Zac Efron – the new American hearthrob , Strauss, Neil Rolling Stone, 23 August 2007, p. 43.   ": null
    },
    {
        "Carrie Fisher": "Carrie Fisher"
    },
    {
        " : American actress, ": null
    },
    {
        "screenwriter": "Screenwriter"
    },
    {
        " and novelist    ": null
    },
    {
        "Gabriel Fauré": "Gabriel Fauré"
    },
    {
        " : French composer, organist, pianist and teacher; one of the foremost French composers of his generation; his musical style influenced many 20th-century composers     ": null
    },
    {
        "Henry Fonda": "Henry Fonda"
    },
    {
        " : American film and stage actor   Henry Fonda claims to be an agnostic. Not an atheist but a doubter. Howard Teichmann, Fonda: My Life, p. 303.   ": null
    },
    {
        "Emilia Fox": "Emilia Fox"
    },
    {
        " : English actress In response to the question Do you believe in God? , Fox said I would love to, but I wonder sometimes what he believes in. Religion seems to have been created by man to help and guide humankind. Ive no idea, really.    ": null
    },
    {
        "Gilberto Gil": "Gilberto Gil"
    },
    {
        " : Brazilian singer, guitarist, and songwriter, known for both his musical innovation and political commitment    ": null
    },
    {
        "Jean-Luc Godard": "Jean-Luc Godard"
    },
    {
        " : French-Swiss film director, screenwriter and ": null
    },
    {
        "film critic": "Film Criticism"
    },
    {
        "; often identified with the 1960s French film movement La Nouvelle Vague, or ": null
    },
    {
        "New Wave": "French New Wave"
    },
    {
        "    Matt Groening": "Matt Groening"
    },
    {
        " : American creator of animated TV series  The Simpsons  and  Futurama , and the comic  Life in Hell  See , which references a quote from New York Times Magazine, 12–27–98.   ": null
    },
    {
        "Bob Guccione": "Bob Guccione"
    },
    {
        " : American founder and publisher of  Penthouse  magazine   ": null
    },
    {
        "Neil Patrick Harris": "Neil Patrick Harris"
    },
    {
        " : American actor, producer, singer, and director; best known for  Doogie Howser, M.D.  and  How I Met Your Mother ; as a child, belonged to an Episcopal Church with his family, where he sang in choir, but has designated himself as an agnostic on his Myspace   ": null
    },
    {
        "Hergé": "Hergé"
    },
    {
        " : Belgian cartoonist; creator of  The Adventures of Tintin  ": null
    },
    {
        "Gustav Holst": "Gustav Holst"
    },
    {
        " : English composer, arranger and teacher; best known for his orchestral suite  The Planets ; composed a large number of works across a range of genres, although none achieved comparable success     ": null
    },
    {
        "John Humphrys": "John Humphrys"
    },
    {
        " : English radio and television presenter who hosted a series of programmes interviewing religious leaders, Humphrys in Search of God He went looking for God and ended up an angry agnostic – unable to believe but enraged by the arrogance of militant atheists. , John Humphrys The Sunday Times, 2 September 2007   ": null
    },
    {
        "Leoš Janáček": "Leoš Janáček"
    },
    {
        " : Czech composer    ": null
    },
    {
        "Gene Kelly": "Gene Kelly"
    },
    {
        " : American dancer, actor, singer, film director and producer, and choreographer Yudkoff, Alvin Gene Kelly: A Life of Dance and Dreams, Watson-Guptill Publications: New York, NY pp. 58–59   ": null
    },
    {
        "Myles Kennedy": "Myles Kennedy"
    },
    {
        " : American musician, singer, and songwriter; lead vocalist and guitarist of the rock band ": null
    },
    {
        "Alter Bridge": "Alter Bridge"
    },
    {
        "    Larry King": "Larry King"
    },
    {
        " : host of  Larry King Live  When we got married, I said, Look, since Im agnostic, I have no right to tell you not to teach them what you believe. But give them an opening. So if they ever ask me, Id tell them the same thing Im telling you: I dont buy that God, I dont know if theres an afterlife.    ": null
    },
    {
        "Janez Lapajne": "Janez Lapajne"
    },
    {
        " : ": null
    },
    {
        "Slovenia": "Slovenia"
    },
    {
        "n film director, producer, ": null
    },
    {
        "writer": "Screenwriter"
    },
    {
        ", ": null
    },
    {
        "editor": "Film Editor"
    },
    {
        " and ": null
    },
    {
        "production designer": "Production Designer"
    },
    {
        "    Cloris Leachman": "Cloris Leachman"
    },
    {
        " : American actress    ": null
    },
    {
        "Stan Lee": "Stan Lee"
    },
    {
        " American comic book writer, editor, actor, producer, publisher, television personality; former president and chairman of ": null
    },
    {
        "Marvel Comics": "Marvel Comics"
    },
    {
        " The Onion: Is there a God? Stan Lee: Well, let me put it this way... No, Im not going to try to be clever. I really dont know. I just dont know. , The Club, 9 October 2002.   ": null
    },
    {
        "Lemmy": "Lemmy"
    },
    {
        " : English rock singer and ": null
    },
    {
        "bass guitar": "Bass Guitar"
    },
    {
        "ist; founder of the rock band ": null
    },
    {
        "Motörhead": "Motörhead"
    },
    {
        "    James Hetfield": "James Hetfield"
    },
    {
        " : American ": null
    },
    {
        "heavy metal singer": "Heavy Metal Music"
    },
    {
        " and ": null
    },
    {
        "rhythm guitar": "Rhythm Guitar"
    },
    {
        "ist; co-founder of the heavy metal band ": null
    },
    {
        "Metallica": "Metallica"
    },
    {
        "    Annie Lennox": "Annie Lennox"
    },
    {
        " : Scottish recording artist    ": null
    },
    {
        "Emcee Lynx": "Emcee Lynx"
    },
    {
        " : American anarchist ": null
    },
    {
        "hip hop music": "Hip Hop Music"
    },
    {
        "ian; identifies as potentially ": null
    },
    {
        "pantheist": "Pantheism"
    },
    {
        ", agnostic or atheist The closest word I’ve found to describe belief system is Pantheism, but I could also call myself an agnostic or an atheist . —   , Soundtrack for Insurrection, circlealpha.com. Retrieved 21 October 2007.   ": null
    },
    {
        "René Magritte": "René Magritte"
    },
    {
        " : Belgian surrealist artist    ": null
    },
    {
        "Gustav Mahler": "Gustav Mahler"
    },
    {
        " : Austrian Late-Romantic composer and conductor It is particularly poor salesmanship for Ms. Raabe to cite Mahlers supposed conversion from Judaism to Catholicism. In both law and common understanding, a choice made under duress is discounted as lacking in free will. Mahler converted as a mere formality under compulsion of a bigoted law that barred Jews from directorship of the Vienna Hofoper. Mahler himself joked about the conversion with his Jewish friends, and, no doubt, would view with bitter amusement the obtuseness of Ms. Raabes understanding of the cruel choice forced on him: either convert to Christianity or forfeit the professional post for which you are supremely destined. When Mahler was asked why he never composed a Mass, he answered bluntly that he could never, with any degree of artistic or spiritual integrity, voice the Credo. He was a confirmed agnostic, a doubter and seeker, never a soul at rest or at peace. Joel Martel, , New York Times.   He was born a Jew but has been described as a life-long agnostic. At one point he converted to Catholicism, purely for the purpose of obtaining a job that he coveted – director of the Court Opera of Vienna. It was unthinkable for a Jew to hold such a prestigious position, hence the utilitarian conversion to the state religion. Warren Allen Smith, Celebrities in Hell, pp. 76–77.      ": null
    },
    {
        "Dave Matthews": "Dave Matthews"
    },
    {
        " : American musician and actor It would be safe to say that Im agnostic, Matthews says. However, I do feel as though we owe a faith to the world and to ourselves. We owe a grace and gratitude to things that have brought us here. But I think its very ignorant to say, Well, for everything, God has a plan. Thats like an excuse.... Maybe the real faithful act is to commit to something, to take action, as opposed to saying, Well, everything is in the hand of God. See    ": null
    },
    {
        "Brian May": "Brian May"
    },
    {
        " : English musician and astrophysicist most widely known as the guitarist, songwriter and occasional singer of the rock band ": null
    },
    {
        "Queen": "Queen"
    },
    {
        " If you say there is no God, where is evidence there is no God? You can say I dont know. Being an agnostic to me is a scientific point of view, which is supportable. In my experience, I felt at times that there is a God of some kind. I dont subscribe to any organized religion – thats a different matter. But if there is a God, we have very little idea of what that God may be. Thats inherent in what we are, he said. – Brian May,  , 26 July 2011.   ": null
    },
    {
        "Paul McCartney": "Paul Mccartney"
    },
    {
        " : English musician, singer and composer We all feel roughly the same. Were all agnostics. . Interviewed by Jean Shepherd, February 1965 issue.   ": null
    },
    {
        "David Mitchell": "David Mitchell"
    },
    {
        " : British actor, comedian and writer    ": null
    },
    {
        "Edvard Munch": "Edvard Munch"
    },
    {
        " : Norwegian Symbolist painter, printmaker and an important forerunner of expressionist art; known for  The Scream     ": null
    },
    {
        "Ernest Newman": "Ernest Newman"
    },
    {
        " : English music critic and musicologist    ": null
    },
    {
        "Conor Oberst": "Conor Oberst"
    },
    {
        " : American singer-songwriter; fronts the band ": null
    },
    {
        "Bright Eyes": "Bright Eyes"
    },
    {
        " Oberst said: If Im forced to categorize myself I guess Id say I was an agnostic.  , by A. D. Amorosi, Harp magazine, May 2007.   ": null
    },
    {
        "Hubert Parry": "Hubert Parry"
    },
    {
        " : English composer, teacher and historian of music    ": null
    },
    {
        "Neil Peart": "Neil Peart"
    },
    {
        " : Canadian drummer and lyricist for hard rock band Rush; many Rush song lyrics criticize religion and theism Im a linear thinking agnostic, but not an atheist folks.    ": null
    },
    {
        "Sean Penn": "Sean Penn"
    },
    {
        " : American actor, twice winner of the ": null
    },
    {
        "Academy Award for Best Actor": "Academy Award For Best Actor"
    },
    {
        "    Brendan Perry": "Brendan Perry"
    },
    {
        " : English singer and multi-instrumentalist best known for his work as the male half of the duo ": null
    },
    {
        "Dead Can Dance": "Dead Can Dance"
    },
    {
        " with ": null
    },
    {
        "Lisa Gerrard": "Lisa Gerrard"
    },
    {
        " When asked whether he believed in God, he replied: I generally am wary of the black and white veering more towards the grey with regard to these matters but am closer to atheism when push comes to shove in terms of not believing the extravagant claims of theology. After all Extraordinary claims require extraordinary evidence – Carl Sagan If the following definition of an atheist is correct then I would certainly ": null
    },
    {
        "nail my flag to that mast!": "Nailing The Colours"
    },
    {
        " :oborn 1980born 1963smilingborn 19271949–1919born 19671919–20112001from Newsbank1797–18281810–1856born 1937film19791966–2006August 19961864–1949born 1954": null
    },
    {
        "sici": "Sici"
    },
    {
        "born 1951born 1971his mother is Jewishmy poor motherquote begins at 15:05, ends at 16:001928–19891960smangaborn 1974 1813–19011872–1958music critic1972–1973551  BC–479  BC1724–1804born 604 BC20111909–1997born 1928Retrieved 21 April 2008460 BC – 370 BC1859–1952341  BCE–270  BCEborn 19481994Retrieved 14 April 2008philosopherborn 19331902–19891711–17761859–19381894–1952born 19311922–19961873–1958Retrieved 13 October 2006died 420 BCE360 BC – c. 270 BC1872–19701997": null
    },
    {
        "erican magazi": "Erican Magazi"
    },
    {
        "born 1967Contemporary Materials and Information: Political magazine for atheists and the irreligiousMIZUntertitel: Politisches Magazin für Konfessionslose und AtheistInnenAutomatic Google translation of the hosted at Schmidt-Salomons websiteRetrieved 1 April 20081820–1903c. 371 BC – 287 BC1820–18911889–19511872–19672009born 19801883–1967born 1951born 1934born 1931in Portugueseborn 1950born 1937In Spanish. See also: by PROMT Online Translator. Retrieved 13 October 2006.1885–19451857–1938born 193820131886–1988born 1938GermanTranslation by born 1955Deputy Prime Ministerborn 1973born 1958born 1929born 19541862–19521833–1899born 1957born 19431983–19871989–2001born 19381911–1990born 1938born 1961born 1976born 19521916–1996Lok Satta1889–19641771–1858born 19641918–1967born 1948born 1959born 19701919–1987born 1951born 19631916–20141923–2015born 1952born 19601908–1995MHD20041921–2007born 19261854–19231888–19461876–19361908–19911847–19221920–19841851–1929phonograph in American English20031813–1878now known as homeostasis , a term coined by Walter Bradford Cannon born 19201917–199219971815–18641861–19421858–19371908–19741899–198519801852–19341896–19371731–18101916–20041867–19341872–1942astronomy1809–1882and more and more as I grow olderborn 19531902–19841858–1940later redesignated Homo erectus19891858–1917born 192320032002200020061879–1955Retrieved 20 June 20071803–18891901–19541995born 19201898–19681863–19611825–1899chemistry1920–1958born 19301912–2006Retrieved 12 January 20071810–1879such as the hull speed equation1900–197930 January 20121822–19111822–19111900–19791925–2018physics1843–1926born 1941born 19331929–20192010Laughs20071941–2002March 1997mathematician1879–1934astronomerborn 19581852–1922born 19411899–199220091821–18941904–19991862–194320071861–1947born 19461915–20011889–1953   Alexander von Humboldt : German naturalist and explorer. His quantitative work on botanical geography laid the foundation for the field of biogeography . Humboldt, by contrast, was an agnostic in religious sentiment and a Heraclitean in his cosmology; he regarded change, and species mutability, as being as natural as changing wind patterns or ocean currents. Harry Francis Mallgrave, Gottfried Semper: Architect of the Nineteenth Century , page 157.   Andrew Huxley : English physiologist and biophysicist. He won the 1963 Nobel Prize in Physiology or Medicine for his experimental and mathematical work on the basis of nerve action potentials, the electrical impulses that enable the activity of an organism to be coordinated by a central nervous system.   Thomas Henry Huxley : English biologist and coiner of the term agnosticism. Every variety of philosophical and theological opinion was represented there, and expressed itself with entire openness; most of my colleagues were ists of one sort or another; and, however kind and friendly they might be, I, the man without a rag of a label to cover himself with, could not fail to have some of the uneasy feelings which must have beset the historical fox when, after leaving the trap in which his tail remained, he presented himself to his normally elongated companions. So I took thought, and invented what I conceived to be the appropriate title of agnostic. http://www.infidels.org/library/historical/thomas_huxley/huxley_wace/part_02.html Part 2 – Agnosticism, by T. H. Huxley, from http://www.infidels.org/library/historical/thomas_huxley/huxley_wace/ Christianity and Agnosticism: A Controversy, New York: D. Appleton and Company, 1889. Hosted at the Secular Web.   ": null
    },
    {
        "Robert Jastrow": "Robert Jastrow"
    },
    {
        " : American astronomer, physicist and cosmologist.  Message from Professor Robert Jastrow   ": null
    },
    {
        "Edwin Thompson Jaynes": "Edwin Thompson Jaynes"
    },
    {
        " : American physicist and statistician. He wrote extensively on ": null
    },
    {
        "statistical mechanics": "Statistical Mechanics"
    },
    {
        " and on foundations of probability and statistical inference. He also pioneered the field of ": null
    },
    {
        "Digital physics": "Digital Physics"
    },
    {
        ".    ": null
    },
    {
        "James Hopwood Jeans": "James Hopwood Jeans"
    },
    {
        " : ": null
    },
    {
        "English": "England"
    },
    {
        " physicist": "Physicist"
    },
    {
        ", ": null
    },
    {
        "astronomer": "Astronomer"
    },
    {
        " and ": null
    },
    {
        "mathematician": "Mathematician"
    },
    {
        ".    ": null
    },
    {
        "Jerome Karle": "Jerome Karle"
    },
    {
        " : American ": null
    },
    {
        "physical chemist": "Physical Chemist"
    },
    {
        ". Jointly with ": null
    },
    {
        "Herbert A. Hauptman": "Herbert A. Hauptman"
    },
    {
        ", he was awarded the ": null
    },
    {
        "Nobel Prize": "Nobel Prize"
    },
    {
        " in ": null
    },
    {
        "Chemistry": "Chemistry"
    },
    {
        " in 1985, for the direct analysis of ": null
    },
    {
        "crystal structures": "Crystal Structure"
    },
    {
        "using ": null
    },
    {
        "X-ray scattering techniques": "X-Ray Scattering Techniques"
    },
    {
        ".    ": null
    },
    {
        "August Kekulé": "August Kekulé"
    },
    {
        " : German organic chemist. He was one of the most prominent chemists in Europe, especially in theoretical chemistry. He was the principal founder of the theory of chemical structure.  Listed as an agnostic on NNDB.com. , NNDB.com.   ": null
    },
    {
        "John Kendrew": "John Kendrew"
    },
    {
        " , ": null
    },
    {
        "English": "England"
    },
    {
        " biochemist": "Biochemist"
    },
    {
        " and ": null
    },
    {
        "crystallographer": "Crystallography"
    },
    {
        " who shared the 1962 ": null
    },
    {
        "Nobel Prize in Chemistry": "Nobel Prize In Chemistry"
    },
    {
        " with ": null
    },
    {
        "Max Perutz": "Max Perutz"
    },
    {
        "; their group in the ": null
    },
    {
        "Cavendish Laboratory": "Cavendish Laboratory"
    },
    {
        " investigated the structure of ": null
    },
    {
        "heme": "Heme"
    },
    {
        "-containing ": null
    },
    {
        "protein": "Protein"
    },
    {
        "s.    ": null
    },
    {
        "John Maynard Keynes": "John Maynard Keynes"
    },
    {
        " : British economist. His ideas are the basis for the school of thought known as ": null
    },
    {
        "Keynesian economics": "Keynesian Economics"
    },
    {
        ", as well as its various offshoots.  Listed as an agnostic on NNDB.com. , NNDB.com.   ": null
    },
    {
        "Michio Kaku": "Michio Kaku"
    },
    {
        " : American theoretical physicist.   ": null
    },
    {
        "Alfred Kastler": "Alfred Kastler"
    },
    {
        " : ": null
    },
    {
        "French": "French People"
    },
    {
        " physicist": "Physicist"
    },
    {
        ". He won the ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " in 1966.    ": null
    },
    {
        "Joseph Louis Lagrange": "Joseph Louis Lagrange"
    },
    {
        " : Italian-French mathematician and astronomer. He made significant contributions to all fields of analysis, number theory, and classical and celestial mechanics. In religious matters Lagrange was, if anything at all, agnostic. Eric Temple Bell, Men of Mathematics . Napoleon replies: How comes it, then, that Laplace was an atheist? At the Institute neither he nor Monge, nor Berthollet, nor Lagrange believed in God. But they did not like to say so. Baron Gaspard Gourgaud, Talks of Napoleon at St. Helena with General Baron Gourgaud , p. 274. Lagrange and Laplace, though of Catholic parentage, were agnostics. Morris Kline, Mathematics and the Search for Knowledge , page 214.     ": null
    },
    {
        "Irving Langmuir": "Irving Langmuir"
    },
    {
        " : American chemist and physicist. He was awarded the 1932 ": null
    },
    {
        "Nobel Prize in Chemistry": "Nobel Prize In Chemistry"
    },
    {
        " for his work in surface chemistry. About his inattention to religion, his usual response was, Never believe anything that cant be proved. Irving Langmuir, NNDB.com.    ": null
    },
    {
        "Anthony James Leggett": "Anthony James Leggett"
    },
    {
        " : English-American physicist. Professor Leggett is widely recognized as a world leader in the theory of ": null
    },
    {
        "low-temperature physics": "Cryogenics"
    },
    {
        ", and his pioneering work on ": null
    },
    {
        "superfluid": "Superfluid"
    },
    {
        "ity was recognized by the 2003 ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        ".    ": null
    },
    {
        "Joseph Leidy": "Joseph Leidy"
    },
    {
        " : American paleontologist.    ": null
    },
    {
        "Mario Livio": "Mario Livio"
    },
    {
        " : Israeli-American astrophysicist.    ": null
    },
    {
        "Seth Lloyd": "Seth Lloyd"
    },
    {
        " : American mechanical engineer. He is a professor of ": null
    },
    {
        "mechanical engineering": "Mechanical Engineering"
    },
    {
        " at the ": null
    },
    {
        "Massachusetts Institute of Technology": "Massachusetts Institute Of Technology"
    },
    {
        ".   ": null
    },
    {
        "James Lovelock": "James Lovelock"
    },
    {
        " : British scientist, environmentalist and futurologist. He is best known for proposing the ": null
    },
    {
        "Gaia hypothesis": "Gaia Hypothesis"
    },
    {
        ". Im a scientist, not a theologian. I dont know if there is a God or not. Religion requires certainty. Revere and respect Gaia. Have trust in Gaia. But not faith. James Lovelock, , Lawrence E. Joseph, 17 August 2000.   ": null
    },
    {
        "Percival Lowell": "Percival Lowell"
    },
    {
        " : American businessman, author, mathematician, and astronomer who fueled speculation that there were canals on Mars, founded the Lowell Observatory in Flagstaff, Arizona, and formed the beginning of the effort that led to the discovery of ": null
    },
    {
        "Pluto": "Pluto"
    },
    {
        " 14 years after his death.    ": null
    },
    {
        "Frank Malina": "Frank Malina"
    },
    {
        " : American aeronautical engineer and painter, especially known for becoming both a pioneer in the art world and the realm of scientific engineering.    ": null
    },
    {
        "Rudolph A. Marcus": "Rudolph A. Marcus"
    },
    {
        " , ": null
    },
    {
        "Canadian": "Canadians"
    },
    {
        "-born chemist who received the 1992 ": null
    },
    {
        "Nobel Prize in Chemistry": "Nobel Prize In Chemistry"
    },
    {
        " for his theory of ": null
    },
    {
        "electron transfer": "Electron Transfer"
    },
    {
        ".   ": null
    },
    {
        "Lynn Margulis": "Lynn Margulis"
    },
    {
        " : American biologist. She is best known for her theory on the origin of ": null
    },
    {
        "eukaryotic": "Eukaryote"
    },
    {
        " organelle": "Organelle"
    },
    {
        "s, and her contributions to the ": null
    },
    {
        "endosymbiotic theory": "Endosymbiotic Theory"
    },
    {
        ", which is now generally accepted for how certain ": null
    },
    {
        "organelles": "Organelle"
    },
    {
        "were formed. She is also associated with the ": null
    },
    {
        "Gaia hypothesis": "Gaia Hypothesis"
    },
    {
        ", based on an idea developed by the English ": null
    },
    {
        "environmental scientist": "Environmental Scientist"
    },
    {
        " James Lovelock": "James Lovelock"
    },
    {
        ".    ": null
    },
    {
        "Dan McKenzie ": "Dan Mckenzie"
    },
    {
        " : British geophysicist.   ": null
    },
    {
        "Simon van der Meer": "Simon Van Der Meer"
    },
    {
        " : Dutch particle accelerator ": null
    },
    {
        "physicist": "Physicist"
    },
    {
        " who shared the ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " in 1984 with ": null
    },
    {
        "Carlo Rubbia": "Carlo Rubbia"
    },
    {
        " for contributions to the ": null
    },
    {
        "CERN": "Cern"
    },
    {
        " project which led to the discovery of the ": null
    },
    {
        "W and Z particles": "W And Z Particles"
    },
    {
        ", two of the most fundamental constituents of matter. The Dutch Nobel prize-winner, Simon van der Meer expressed this as follows: As a physicist, you have to have a split personality to be still able to believe in a god. Alfred Driessen, Antoine Suarez, Mathematical undecidability, quantum nonlocality, and the question of the existence of God . Listed as an agnostic on NNDB.com. , NNDB.com.   ": null
    },
    {
        "Albert Abraham Michelson": "Albert Abraham Michelson"
    },
    {
        " : American physicist known for his work on the measurement of the speed of light and especially for the ": null
    },
    {
        "Michelson-Morley experiment": "Michelson-Morley Experiment"
    },
    {
        ". In 1907 he received the ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        ".      ": null
    },
    {
        "Ludwig von Mises": "Ludwig Von Mises"
    },
    {
        " : ": null
    },
    {
        "Austrian Economist": "Austrian School"
    },
    {
        " and Philosopher. He was a prominent figure in the ": null
    },
    {
        "Austrian School": "Austrian School"
    },
    {
        " of economic thought. Erik Ritter von Kuehnelt-Leddihn: The Cultural Background of Ludwig von Mises  Indeed, for someone who was an agnostic, Mises wrote a great deal about religion. The number of references he makes to religion is staggering, actually numbering over twenty-five hundred in his published corpus. Laurence M. Vance, , Thursday, 10 February 2005. Ludwig von Mises, who was agnostic, skeptical, and non-political. Block, Walter and Rockwell Jr., Llewellyn H., Man, Economy, and Liberty: Essays in Honor of Murray N. Rothbard, page 168.    ": null
    },
    {
        "Ludwig Mond": "Ludwig Mond"
    },
    {
        " : German-born British chemist and industrialist.    ": null
    },
    {
        "Robert S. Mulliken": "Robert S. Mulliken"
    },
    {
        " : American ": null
    },
    {
        "physicist": "Physics"
    },
    {
        " and ": null
    },
    {
        "chemist": "Chemistry"
    },
    {
        ", primarily responsible for the early development of ": null
    },
    {
        "molecular orbital theory": "Molecular Orbital Theory"
    },
    {
        ", i. e. the elaboration of the ": null
    },
    {
        "molecular orbital": "Molecular Orbital"
    },
    {
        " method of computing the structure of ": null
    },
    {
        "molecule": "Molecule"
    },
    {
        "s. Dr. Mulliken received the ": null
    },
    {
        "Nobel Prize": "Nobel Prize"
    },
    {
        " for chemistry in 1966.    ": null
    },
    {
        "Nathan Myhrvold": "Nathan Myhrvold"
    },
    {
        " : American computer scientist, technologist, mathematician, physicist, entrepreneur, nature and wildlife photographer, master chef. Charlie Rose: What is your sense of religion and spiritual being? Myhrvold: Not. Its – Charlie: Not? Myhrvold: There is a bunch of wonderful stories that people tell themselves and each other that they take as a matter of faith rather than evidence – Im not saying its bad, and they get a tremendous amount of comfort from it. I like things that can be proven and I worry about things where i might be believing exactly what I would like to hear. So it would be wonderful if, after we die here, we go to a much better place, just like it would be wonderful if we were the most important things in the world, but in the past we thought we were really important. We discovered afterwards we werent. As a result, I am much more focused on things that I can understand in a scientific way which kind of – lets faith out of it. Charlie Rose interview,  , 20 May 2010.   ": null
    },
    {
        "David Nalin": "David Nalin"
    },
    {
        " , American physiologist. Nalin had the key insight that ": null
    },
    {
        "Oral rehydration therapy": "Oral Rehydration Therapy"
    },
    {
        " would work if the volume of solution patients drank matched the volume of their fluid losses, and that this would drastically reduce or completely replace the only current treatment for cholera, intravenous therapy. Nalins discoveries have been estimated to have saved over 50 million lives worldwide.    ": null
    },
    {
        "Fridtjof Nansen": "Fridtjof Nansen"
    },
    {
        " , Norwegian explorer, scientist, diplomat, humanitarian and ": null
    },
    {
        "Nobel Peace Prize": "Nobel Peace Prize"
    },
    {
        " laureate. In 1922, he was awarded the ": null
    },
    {
        "Nobel Peace Prize": "Nobel Peace Prize"
    },
    {
        " for his work on behalf of the displaced victims of the First ": null
    },
    {
        "World War": "World War"
    },
    {
        " and related conflicts.    ": null
    },
    {
        "Erwin Neher": "Erwin Neher"
    },
    {
        " , ": null
    },
    {
        "German": "Germany"
    },
    {
        " biophysicist": "Biophysics"
    },
    {
        ". Along with ": null
    },
    {
        "Bert Sakmann": "Bert Sakmann"
    },
    {
        ", he was awarded the ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "Nobel Prize In Physiology Or Medicine"
    },
    {
        " in 1991.    ": null
    },
    {
        "Ronald George Wreyford Norrish": "Ronald George Wreyford Norrish"
    },
    {
        " , ": null
    },
    {
        "British": "United Kingdom"
    },
    {
        " chemist": "Chemist"
    },
    {
        ". As a result of the development of flash photolysis, he was awarded the ": null
    },
    {
        "Nobel Prize in Chemistry": "Nobel Prize In Chemistry"
    },
    {
        " in 1967 along with ": null
    },
    {
        "Manfred Eigen": "Manfred Eigen"
    },
    {
        " and ": null
    },
    {
        "George Porter": "George Porter"
    },
    {
        " for their study of extremely fast chemical reactions.     ": null
    },
    {
        "Robert Noyce": "Robert Noyce"
    },
    {
        " : American physicist, businessman, and inventor. He co-founded ": null
    },
    {
        "Fairchild Semiconductor": "Fairchild Semiconductor"
    },
    {
        " in 1957 and ": null
    },
    {
        "Intel Corporation": "Intel Corporation"
    },
    {
        " in 1968. He is also credited  with the invention of the ": null
    },
    {
        "integrated circuit": "Integrated Circuit"
    },
    {
        " or microchip which fueled the personal computer revolution.    ": null
    },
    {
        "Sherwin B. Nuland": "Sherwin B. Nuland"
    },
    {
        " : American surgeon and author of How We Die.    ": null
    },
    {
        "Paul Nurse": "Paul Nurse"
    },
    {
        " : 2001 ": null
    },
    {
        "Nobel Laureate": "Nobel Laureate"
    },
    {
        " in ": null
    },
    {
        "Physiology": "Physiology"
    },
    {
        " or Medicine, called himself an atheist, but specified that sceptical agnostic was a more philosophically correct term. I gradually slipped away from religion over several years and became an atheist or to be more philosophically correct, a sceptical agnostic.    ": null
    },
    {
        "Bill Nye": "Bill Nye"
    },
    {
        " : American science educator, comedian, television host, actor, mechanical engineer and scientist. Popularly known as Bill Nye the Science Guy . Steve Wartenberg: So, do you believe in God? I asked .   You really cant know, answered Bill Nye the Controversial Guy. Steve Wartenberg, , 6 April 2006.   ": null
    },
    {
        "George Olah": "George Olah"
    },
    {
        " : 1994 ": null
    },
    {
        "Nobel Laureate": "Nobel Laureate"
    },
    {
        " in ": null
    },
    {
        "Chemistry": "Chemistry"
    },
    {
        ", discoverer of ": null
    },
    {
        "superacids": "Superacids"
    },
    {
        ", Today, I consider myself, in Thomas Huxleys terms, an agnostic. I don’t know whether there is a God or creator, or whatever we may call a higher intelligence or being. I don’t know whether there is an ultimate reason for our being or whether there is anything beyond material phenomena. I may doubt these things as a scientist, as we cannot prove them scientifically, but at the same time we also cannot falsify them. For the same reasons, I cannot deny God with certainty, which would make me an atheist. This is a conclusion reached by many scientists. George Olah, A Life of Magic Chemistry   ": null
    },
    {
        "Mark Oliphant": "Mark Oliphant"
    },
    {
        " : Australian physicist and humanitarian. He played a fundamental role in the first experimental demonstration of ": null
    },
    {
        "nuclear fusion": "Nuclear Fusion"
    },
    {
        " and also the development of the ": null
    },
    {
        "atomic bomb": "Atomic Bomb"
    },
    {
        ". It was nice to be honoured but I like Mark not Sir Mark. When ones young, ones brash and all-knowing; when ones old, one realises how little one knows. You asked me earlier if I believed in God and the hereafter. I would tend to say no but when one dies one could well be surprised. Mark Oliphant from an interview in 1996. .   ": null
    },
    {
        "Karl Pearson": "Karl Pearson"
    },
    {
        " : English mathematician who has been credited for establishing the discipline of ": null
    },
    {
        "mathematical statistics": "Mathematical Statistics"
    },
    {
        ".    ": null
    },
    {
        "Saul Perlmutter": "Saul Perlmutter"
    },
    {
        " : American astrophysicist. He shared both the 2006 ": null
    },
    {
        "Shaw Prize": "Shaw Prize"
    },
    {
        " in Astronomy and the 2011 ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " with ": null
    },
    {
        "Brian P. Schmidt": "Brian P. Schmidt"
    },
    {
        " and ": null
    },
    {
        "Adam Riess": "Adam Riess"
    },
    {
        " for providing evidence that the expansion of the universe is accelerating.   ": null
    },
    {
        "Henri Poincaré": "Henri Poincaré"
    },
    {
        " : French ": null
    },
    {
        "mathematician": "Mathematician"
    },
    {
        ", ": null
    },
    {
        "theoretical physicist": "Theoretical Physicist"
    },
    {
        ", engineer, and a ": null
    },
    {
        "philosopher of science": "Philosophy Of Science"
    },
    {
        ". He is often described as a ": null
    },
    {
        "polymath": "Polymath"
    },
    {
        ", and in mathematics as The Last Universalist, since he excelled in all fields of the discipline as it existed during his lifetime.      ": null
    },
    {
        "Siméon Denis Poisson": "Siméon Denis Poisson"
    },
    {
        " : French mathematician, geometer, and physicist.    Now Ibn al-Haytham was a devout Muslim – that is, he was a supernaturalist. He studied science because he considered that by doing this he could better understand the nature of the god that he believed in – he thought that a supernatural agent had created the laws of nature. The same is true of virtually all the leading scientists in the Western world, such as Galileo and Newton, who lived after al-Haytham, until about the middle of the twentieth century. There were a few exceptions – Pierre Laplace, Siméon Poisson, Albert Einstein, Paul Dirac and Marie Curie were naturalists for example. John Ellis, How Science Works: Evolution: A Student Primer, p. 13.   ": null
    },
    {
        "George Pólya": "George Pólya"
    },
    {
        " : ": null
    },
    {
        "Hungarian Jew": "Hungarian Jew"
    },
    {
        "ish ": null
    },
    {
        "mathematician": "Mathematician"
    },
    {
        ". He was a professor of mathematics from 1914 to 1940 at ": null
    },
    {
        "ETH Zürich": "Eth Zürich"
    },
    {
        " and from 1940 to 1953 at ": null
    },
    {
        "Stanford University": "Stanford University"
    },
    {
        ". He made fundamental contributions to ": null
    },
    {
        "combinatorics": "Combinatorics"
    },
    {
        ", ": null
    },
    {
        "number theory": "Number Theory"
    },
    {
        ", ": null
    },
    {
        "numerical analysis": "Numerical Analysis"
    },
    {
        " and ": null
    },
    {
        "probability theory": "Probability Theory"
    },
    {
        ". He is also noted for his work in ": null
    },
    {
        "heuristics": "Heuristics"
    },
    {
        " and mathematics education.    ": null
    },
    {
        "Carolyn Porco": "Carolyn Porco"
    },
    {
        " : American planetary scientist. She is best known for her work in the exploration of the outer ": null
    },
    {
        "solar system": "Solar System"
    },
    {
        ", beginning with her imaging work on the Voyager missions to ": null
    },
    {
        "Jupiter": "Jupiter"
    },
    {
        ", ": null
    },
    {
        "Saturn": "Saturn"
    },
    {
        ", ": null
    },
    {
        "Uranus": "Uranus"
    },
    {
        " and ": null
    },
    {
        "Neptune": "Neptune"
    },
    {
        " in the 1980s.   ": null
    },
    {
        "Vladimir Prelog": "Vladimir Prelog"
    },
    {
        " : Croatian organic chemist. He won the ": null
    },
    {
        "Nobel Prize in Chemistry": "Nobel Prize In Chemistry"
    },
    {
        " in 1975.    ": null
    },
    {
        "Vilayanur S. Ramachandran": "Vilayanur S. Ramachandran"
    },
    {
        " : Indian-American neuroscientist. Best known for his work in the fields of ": null
    },
    {
        "behavioral neurology": "Behavioral Neurology"
    },
    {
        " and visual ": null
    },
    {
        "psychophysics": "Psychophysics"
    },
    {
        ".    ": null
    },
    {
        "C. V. Raman": "C. V. Raman"
    },
    {
        " : Indian physicist whose work was influential in the growth of science in India. He was the recipient of the ": null
    },
    {
        "Nobel Prize for Physics": "Nobel Prize For Physics"
    },
    {
        " in 1930 for the discovery that when light traverses a transparent material, some of the light that is deflected changes in wavelength. This phenomenon is now called ": null
    },
    {
        "Raman scattering": "Raman Scattering"
    },
    {
        " and is the result of the ": null
    },
    {
        "Raman effect": "Raman Effect"
    },
    {
        ".     ": null
    },
    {
        "Lisa Randall": "Lisa Randall"
    },
    {
        " : American theoretical physicist and a student of particle physics and cosmology. She works on several of the competing models of ": null
    },
    {
        "string theory": "String Theory"
    },
    {
        " in the quest to explain the fabric of the universe. Her best known contribution to the field is the ": null
    },
    {
        "Randall–Sundrum model": "Randall–Sundrum Model"
    },
    {
        ", first published in 1999 with ": null
    },
    {
        "Raman Sundrum": "Raman Sundrum"
    },
    {
        ".    ": null
    },
    {
        "John Strutt, 3rd Baron Rayleigh": "John Strutt, 3Rd Baron Rayleigh"
    },
    {
        " : ": null
    },
    {
        "English": "England"
    },
    {
        " physicist": "Physicist"
    },
    {
        " who, with ": null
    },
    {
        "William Ramsay": "William Ramsay"
    },
    {
        ", discovered the element ": null
    },
    {
        "argon": "Argon"
    },
    {
        ", an achievement for which he earned the ": null
    },
    {
        "Nobel Prize for Physics": "Nobel Prize For Physics"
    },
    {
        " in 1904. He also discovered the phenomenon now called ": null
    },
    {
        "Rayleigh scattering": "Rayleigh Scattering"
    },
    {
        ", explaining why the sky is blue, and predicted the existence of the ": null
    },
    {
        "surface waves": "Surface Wave"
    },
    {
        "now known as ": null
    },
    {
        "Rayleigh waves": "Rayleigh Waves"
    },
    {
        ". Rayleighs textbook, The Theory of Sound, is still referred to by acoustic engineers today.    ": null
    },
    {
        "Grote Reber": "Grote Reber"
    },
    {
        " : American ": null
    },
    {
        "amateur astronomer": "Amateur Astronomer"
    },
    {
        " and pioneer of ": null
    },
    {
        "radio astronomy": "Radio Astronomy"
    },
    {
        ". He was instrumental in investigating and extending ": null
    },
    {
        "Karl Janskys": "Karl Jansky"
    },
    {
        "pioneering work, and conducted the first ": null
    },
    {
        "sky survey": "Sky Survey"
    },
    {
        " in the radio frequencies. His 1937 radio antenna was the second ever to be used for astronomical purposes and the first parabolic reflecting antenna to be used as a ": null
    },
    {
        "radio telescope": "Radio Telescope"
    },
    {
        " . I submit that Hubble was looking for this principle of tired light. A hundred years from now, people will look back on the Big Bang Creationists and their antics with laughter much as we laugh at those who argued over how many angels can dance on the head of a pin! Grote Reber, , page 49. Listed as an agnostic on NNDB.com. , NNDB.com   ": null
    },
    {
        "Robert Coleman Richardson": "Robert Coleman Richardson"
    },
    {
        " : American experimental physicist. He, along with ": null
    },
    {
        "David Lee": "David Lee"
    },
    {
        ", as senior researchers, and then graduate student ": null
    },
    {
        "Douglas Osheroff": "Douglas Osheroff"
    },
    {
        ", shared the 1996 ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " for their 1972 discovery of the property of ": null
    },
    {
        "superfluid": "Superfluid"
    },
    {
        "ity in helium-3 atoms in the ": null
    },
    {
        "Cornell University": "Cornell University"
    },
    {
        " Laboratory of Atomic and Solid State Physics": "Laboratory Of Atomic And Solid State Physics"
    },
    {
        ".   ": null
    },
    {
        "Charles Richet": "Charles Richet"
    },
    {
        " : French physiologist, won the 1913 ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "Nobel Prize In Physiology Or Medicine"
    },
    {
        " for his work on ": null
    },
    {
        "anaphylaxis": "Anaphylaxis"
    },
    {
        ". Eugenie Richet was a highly religious woman; Charles made his first communion with real devotion and fleetingly promised to enter the priesthood, but he abandoned his childhood faith during his adolescence. As an adult, he became an agnostic, a freethinker and a Freemason, who was nonetheless fairly tolerant of his wife Amelies continued faith. Mark S. Micale, The mind of modernism: medicine, psychology, and the cultural arts in Europe and America, 1880–1940 , page 220.   ": null
    },
    {
        "Isaac Roberts": "Isaac Roberts"
    },
    {
        " : Welsh engineer and business man best known for his work as an ": null
    },
    {
        "amateur astronomer": "Amateur Astronomer"
    },
    {
        ", pioneering the field of ": null
    },
    {
        "astrophotography": "Astrophotography"
    },
    {
        " of ": null
    },
    {
        "nebulae": "Nebulae"
    },
    {
        ".    ": null
    },
    {
        "Richard J. Roberts": "Richard J. Roberts"
    },
    {
        " : British ": null
    },
    {
        "biochemist": "Biochemist"
    },
    {
        " and ": null
    },
    {
        "molecular biologist": "Molecular Biology"
    },
    {
        ". He was awarded the 1993 ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "Nobel Prize In Physiology Or Medicine"
    },
    {
        " with ": null
    },
    {
        "Phillip Allen Sharp": "Phillip Allen Sharp"
    },
    {
        " for the discovery of ": null
    },
    {
        "introns": "Intron"
    },
    {
        "in ": null
    },
    {
        "eukaryotic": "Eukaryote"
    },
    {
        " DNA": "Dna"
    },
    {
        " and the mechanism of gene-splicing.    ": null
    },
    {
        "Józef Rotblat": "Józef Rotblat"
    },
    {
        " : Polish-British physicist. Along with the Pugwash Conferences on Science and World Affairs, he received the Nobel Peace Prize in 1995. Rotblat: I have to admit, however, that there are really many things that I do not know. I am not a particularly religious person, and this is the reason for my agnosticism. To be an agnostic simply means that I do not know and will keep seeking the answer for eternity. This is my response to questions about religion. Joseph Rotblat, Daisaku Ikeda, A quest for global peace: Rotblat and Ikeda on war, ethics, and the nuclear threat, p. 94.   ": null
    },
    {
        "Carl Sagan": "Carl Sagan"
    },
    {
        " : astronomer and skeptic. Famed scientist Carl Sagan was also a renowned sceptic and agnostic who during his life refused to believe in anything unless there was physical evidence to support it. Unbelievers Quest by Jerry Adler, in Newsweek, 31 March 1997.  hosted at Questia Online Library accessed 2 November 2007.   ": null
    },
    {
        "Frederick Sanger": "Frederick Sanger"
    },
    {
        " : English ": null
    },
    {
        "biochemist": "Biochemist"
    },
    {
        " and a two-time ": null
    },
    {
        "Nobel Laureate": "Nobel Laureate"
    },
    {
        " in ": null
    },
    {
        "Chemistry": "Chemistry"
    },
    {
        ". . This interview, which took place on 16 September 1997, was republished in:    ": null
    },
    {
        "Nicholas Saunderson": "Nicholas Saunderson"
    },
    {
        " : English scientist and mathematician.    ": null
    },
    {
        "Peter Schuster": "Peter Schuster"
    },
    {
        " : Professor of Theoretical Chemistry at the ": null
    },
    {
        "University of Vienna": "University Of Vienna"
    },
    {
        ".    ": null
    },
    {
        "Harlow Shapley": "Harlow Shapley"
    },
    {
        " : American astronomer. Best known for determining the correct position of the ": null
    },
    {
        "Sun": "Sun"
    },
    {
        " within the ": null
    },
    {
        "Milky Way galaxy": "Milky Way Galaxy"
    },
    {
        ".     ": null
    },
    {
        "Charles Scott Sherrington": "Charles Scott Sherrington"
    },
    {
        " : English neurophysiologist, histologist, bacteriologist, and pathologist. He, along with ": null
    },
    {
        "Edgar Adrian": "Edgar Adrian"
    },
    {
        ", won the 1932 ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "Nobel Prize In Physiology Or Medicine"
    },
    {
        ". Pavlov also sharply criticised Sherringtons agnosticism. I am all the more surprised, Pavlov went on to say, that for some reason or other he regards knowledge of this soul as something pernicious and clearly expresses this point of view; according to him... George Windholz, Psychopathology and psychiatry , page 419.   ": null
    },
    {
        "George Gaylord Simpson": "George Gaylord Simpson"
    },
    {
        " : American ": null
    },
    {
        "paleontologist": "Paleontologist"
    },
    {
        ". He is considered to be one of the most influential paleontologist of the 20th century, and a major participant in the ": null
    },
    {
        "modern evolutionary synthesis": "Modern Synthesis"
    },
    {
        ". By his early teens, Simpson had given up being a Christian, although he had not formally declared himself an atheist. At college he began the gradual development of what might best be called positivistic agnosticism: a belief that the world could be known and explained by ordinary empirical observation without recourse to supernatural forces. Ultimate causation, he considered unknowable. Léo F. Laporte, Simple curiosity; letters from George Gaylord Simpson to his family, 1921–1970 , p. 16.   ": null
    },
    {
        "Jens C. Skou": "Jens C. Skou"
    },
    {
        " : Danish chemist. In 1997 he received the ": null
    },
    {
        "Nobel Prize in Chemistry": "Nobel Prize In Chemistry"
    },
    {
        "  for his discovery of ": null
    },
    {
        "Na + , K + -ATPase": "Na+/K+-Atpase"
    },
    {
        ".    ": null
    },
    {
        "Homer Smith": "Homer W. Smith"
    },
    {
        " : American physiologist. His research work focused on the kidney and he discovered ": null
    },
    {
        "inulin": "Inulin"
    },
    {
        " at the same time as ": null
    },
    {
        "A.N. Richards": "A.N. Richards"
    },
    {
        ".    ": null
    },
    {
        "William Smith ": "William Smith"
    },
    {
        " : English ": null
    },
    {
        "geologist": "Geologist"
    },
    {
        ", credited with creating the first nationwide ": null
    },
    {
        "geological map": "Geological Map"
    },
    {
        ". He is known as the Father of English Geology for collating the geological history of England and Wales into a single record, although recognition was very slow in coming.    ": null
    },
    {
        "George Smoot": "George Smoot"
    },
    {
        " : American ": null
    },
    {
        "astrophysicist": "Astrophysics"
    },
    {
        ", ": null
    },
    {
        "cosmologist": "Cosmology"
    },
    {
        ", Nobel laureate, and $1  million TV quiz show prize winner . He won the ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " in 2006 for his work on the ": null
    },
    {
        "Cosmic Background Explorer": "Cosmic Background Explorer"
    },
    {
        " with ": null
    },
    {
        "John C. Mather": "John C. Mather"
    },
    {
        " that led to the measurement of the ": null
    },
    {
        "black body": "Black Body"
    },
    {
        " form and ": null
    },
    {
        "anisotropy": "Anisotropy"
    },
    {
        " of the ": null
    },
    {
        "cosmic microwave background radiation": "Cosmic Microwave Background Radiation"
    },
    {
        ".    ": null
    },
    {
        "Charles Proteus Steinmetz": "Charles Proteus Steinmetz"
    },
    {
        " : German-American mathematician and electrical engineer.    ": null
    },
    {
        "Piero Sraffa": "Piero Sraffa"
    },
    {
        " : influential Italian economist whose book Production of Commodities by Means of Commodities is taken as founding the Neo-Ricardian school of Economics.    ": null
    },
    {
        "Albert Szent-Györgyi": "Albert Szent-Györgyi"
    },
    {
        " : ": null
    },
    {
        "Hungarian": "Hungary"
    },
    {
        " physiologist": "Physiologist"
    },
    {
        " who won the ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "Nobel Prize In Physiology Or Medicine"
    },
    {
        " in 1937. He is credited with discovering ": null
    },
    {
        "vitamin C": "Vitamin C"
    },
    {
        " and the components and reactions of the ": null
    },
    {
        "citric acid cycle": "Citric Acid Cycle"
    },
    {
        ".    ": null
    },
    {
        "Leo Szilard": "Leo Szilard"
    },
    {
        " , Austro-Hungarian physicist and inventor.   Both Enrico and Leo were agnostics. Nina Byers, .    ": null
    },
    {
        "Igor Tamm": "Igor Tamm"
    },
    {
        " : ": null
    },
    {
        "Soviet": "Soviet Union"
    },
    {
        " physicist": "Physicist"
    },
    {
        " who received the 1958 ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        ", jointly with ": null
    },
    {
        "Pavel Alekseyevich Cherenkov": "Pavel Alekseyevich Cherenkov"
    },
    {
        " and ": null
    },
    {
        "Ilya Frank": "Ilya Frank"
    },
    {
        ", for their 1934 discovery of ": null
    },
    {
        "Cherenkov radiation": "Cherenkov Radiation"
    },
    {
        ".    ": null
    },
    {
        "Edward Teller": "Edward Teller"
    },
    {
        " : ": null
    },
    {
        "Hungarian-American": "Hungarian American"
    },
    {
        " theoretical": "Theoretical Physics"
    },
    {
        " physicist": "Physicist"
    },
    {
        ", known colloquially as the father of the ": null
    },
    {
        "hydrogen bomb": "Hydrogen Bomb"
    },
    {
        " . Teller made numerous contributions to ": null
    },
    {
        "nuclear": "Nuclear Physics"
    },
    {
        " and ": null
    },
    {
        "molecular physics": "Molecular Physics"
    },
    {
        ", ": null
    },
    {
        "spectroscopy": "Spectroscopy"
    },
    {
        " , and ": null
    },
    {
        "surface": "Surface"
    },
    {
        " physics.    ": null
    },
    {
        "Thorvald N. Thiele": "Thorvald N. Thiele"
    },
    {
        " : Danish astronomer, actuary and mathematician, most notable for his work in statistics, interpolation and the three-body problem. He was the first to propose a mathematical theory of ": null
    },
    {
        "Brownian motion": "Brownian Motion"
    },
    {
        ". Thiele introduced the cumulants and the likelihood function; these contributions were not credited to Thiele by ": null
    },
    {
        "Ronald A. Fisher": "Ronald A. Fisher"
    },
    {
        ", who nevertheless named Thiele to his list of the greatest statisticians of all time on the strength of Thieles other contributions.    ": null
    },
    {
        "E. Donnall Thomas": "E. Donnall Thomas"
    },
    {
        " : American physician, professor emeritus at the ": null
    },
    {
        "University of Washington": "University Of Washington"
    },
    {
        ", and director emeritus of the clinical research division at the ": null
    },
    {
        "Fred Hutchinson Cancer Research Center": "Fred Hutchinson Cancer Research Center"
    },
    {
        ". In 1990 he shared the ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "Nobel Prize In Physiology Or Medicine"
    },
    {
        " with ": null
    },
    {
        "Joseph E. Murray": "Joseph Murray"
    },
    {
        " for the development of cell and ": null
    },
    {
        "organ transplant": "Organ Transplant"
    },
    {
        "ation. Thomas developed ": null
    },
    {
        "bone marrow": "Bone Marrow"
    },
    {
        " transplantation": "Stem Cell Transplantation"
    },
    {
        " as a treatment for ": null
    },
    {
        "leukemia": "Leukemia"
    },
    {
        ".    ": null
    },
    {
        "John Tyndall": "John Tyndall"
    },
    {
        " : Prominent 19th century experimental physicist. Known for producing a number of discoveries about processes in the atmosphere. Though research activities dominated his working days, Faraday never neglected to meet with his Christian friends for worship and prayer. We quote again from John Tyndall who, it should be said, was an agnostic: I think that a good deal of Faradays week-day strength and persistency might be referred to his Sunday Exercises. He drinks from a fount on Sunday which refreshes his soul for a week. The Biblical Creation Society,  , 2002. The odd subtext of that offer was that Faraday was intensely religious, and Tyndall was as fascinated with Faradays convictions as he was with prayer, miracles, and cosmology. Faraday drinks from a fount on Sunday which refreshes his soul for a week, said the agnostic Tyndall with obvious fascination – and, perhaps, a trace of envy. John H. Lienhard, , The Engines of our Ingenuity.   ": null
    },
    {
        "Neil deGrasse Tyson": "Neil Degrasse Tyson"
    },
    {
        " : American astrophysicist, science communicator, the Frederick P. Rose Director of the ": null
    },
    {
        "Hayden Planetarium": "Hayden Planetarium"
    },
    {
        " at the Rose Center for Earth and Space, and a Research Associate in the Department of Astrophysics at the American Museum of Natural History.    ": null
    },
    {
        "Stanislaw Ulam": "Stanislaw Ulam"
    },
    {
        " : Polish-Jewish mathematician. He participated in Americas ": null
    },
    {
        "Manhattan Project": "Manhattan Project"
    },
    {
        ", originated the ": null
    },
    {
        "Teller–Ulam design": "Teller–Ulam Design"
    },
    {
        " of thermonuclear weapons, invented the Monte Carlo method of computation, and suggested ": null
    },
    {
        "nuclear pulse propulsion": "Nuclear Pulse Propulsion"
    },
    {
        ". Im an agnostic. Sometimes I muse deeply on the forces that are for me invisible. When I am almost close to the idea of God, I feel immediately estranged by the horrors of this world, which he seems to tolerate... Later Ulam expressed his opinions about matters that have very little in common with science. Polska Agencja Międzyprasowa, Poland: Issue 9 .    ": null
    },
    {
        "Martinus J. G. Veltman": "Martinus J. G. Veltman"
    },
    {
        " : Dutch theoretical physicist. He shared the 1999 ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " with his former student ": null
    },
    {
        "Gerardus t Hooft": "Gerardus T Hooft"
    },
    {
        " for their work on particle theory.   ": null
    },
    {
        "Rudolf Virchow": "Rudolf Virchow"
    },
    {
        " : German doctor, anthropologist, pathologist, prehistorian, biologist and politician. Referred to as the father of modern pathology, he is considered one of the founders of ": null
    },
    {
        "social medicine": "Social Medicine"
    },
    {
        ".  Virchow had no use for teleology in pathology: The teleo-logical purists were always forced to go back to original sin, without finding this way much recognition. We found Virchow to be an agnostic as early as 1845. Erwin Heinz Ackerknecht, Rudolf Virchow: doctor, statesman, anthropologist , p. 51.   ": null
    },
    {
        "John von Neumann": "John Von Neumann"
    },
    {
        " : Hungarian-American mathematician and polymath who made major contributions to a vast number of fields, including ": null
    },
    {
        "set theory": "Set Theory"
    },
    {
        ", ": null
    },
    {
        "functional analysis": "Functional Analysis"
    },
    {
        ", ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ", ": null
    },
    {
        "ergodic theory": "Ergodic Theory"
    },
    {
        ", ": null
    },
    {
        "geometry": "Geometry"
    },
    {
        ", ": null
    },
    {
        "fluid dynamics": "Fluid Dynamics"
    },
    {
        ", ": null
    },
    {
        "economics": "Economics"
    },
    {
        ", ": null
    },
    {
        "linear programming": "Linear Programming"
    },
    {
        ", ": null
    },
    {
        "game theory": "Game Theory"
    },
    {
        ", ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        ", ": null
    },
    {
        "numerical analysis": "Numerical Analysis"
    },
    {
        ", ": null
    },
    {
        "hydrodynamics": "Hydrodynamics"
    },
    {
        ", and ": null
    },
    {
        "statistics": "Statistics"
    },
    {
        ", as well as many other mathematical fields. It is indicated that he was an ": null
    },
    {
        "agnostic Catholic": "Agnostic Catholic"
    },
    {
        " due to his agreement with Pascals Wager.       ": null
    },
    {
        "Alfred Russel Wallace": "Alfred Russel Wallace"
    },
    {
        " : British naturalist, explorer, geographer, anthropologist and biologist. He is best known for independently proposing a theory of ": null
    },
    {
        "evolution": "Evolution"
    },
    {
        " due to ": null
    },
    {
        "natural selection": "Natural Selection"
    },
    {
        " that prompted ": null
    },
    {
        "Charles Darwin": "Charles Darwin"
    },
    {
        " to publish his own theory.    ": null
    },
    {
        "André Weil": "André Weil"
    },
    {
        " : French mathematician. He is especially known for his foundational work in ": null
    },
    {
        "number theory": "Number Theory"
    },
    {
        " and ": null
    },
    {
        "algebraic geometry": "Algebraic Geometry"
    },
    {
        ". Andre Weil was an agnostic but respected religions. I. Grattan-Guinness, Bhuri Singh Yadav, History of the Mathematical Sciences .    ": null
    },
    {
        "Walter Frank Raphael Weldon": "Walter Frank Raphael Weldon"
    },
    {
        " : English evolutionary biologist and a founder of ": null
    },
    {
        "biometry": "Biometry"
    },
    {
        ". He was the joint founding editor of ": null
    },
    {
        "Biometrika": "Biometrika"
    },
    {
        ", with ": null
    },
    {
        "Francis Galton": "Francis Galton"
    },
    {
        " and ": null
    },
    {
        "Karl Pearson": "Karl Pearson"
    },
    {
        ".    ": null
    },
    {
        "Norbert Wiener": "Norbert Wiener"
    },
    {
        " , American mathematician and child prodigy. He is regarded as the originator of ": null
    },
    {
        "cybernetics": "Cybernetics"
    },
    {
        ". On June 2, 1964, Swami Sarvagatananda presided over the memorial service at MIT in remembrance of Norbert Wiener — scion of Maimonides, father of cybernetics, avowed agnostic — reciting in Sanskrit from the holy books of Hinduism, the Upanishads and the Bhagavad Gita. Flo Conway, Jim Siegelman, Dark Hero of the Information Age: In Search Of Norbert Wiener—Father of Cybernetics , p. 329.   ": null
    },
    {
        "Eugene Wigner": "Eugene Wigner"
    },
    {
        " : ": null
    },
    {
        "Hungarian": "Hungary"
    },
    {
        " American ": null
    },
    {
        "theoretical physicist": "Theoretical Physicist"
    },
    {
        " and ": null
    },
    {
        "mathematician": "Mathematician"
    },
    {
        ". He received a share of the ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " in 1963 for his contributions to the theory of the atomic nucleus and the elementary particles, particularly through the discovery and application of fundamental symmetry principles ; the other half of the award was shared between ": null
    },
    {
        "Maria Goeppert-Mayer": "Maria Goeppert-Mayer"
    },
    {
        " and ": null
    },
    {
        "J. Hans D. Jensen": "J. Hans D. Jensen"
    },
    {
        ". Wigner is important for having laid the foundation for the theory of ": null
    },
    {
        "symmetries": "Symmetry In Physics"
    },
    {
        " in ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " as well as for his research into the structure of the ": null
    },
    {
        "atomic nucleus": "Atomic Nucleus"
    },
    {
        ". It was Eugene Wigner who first identified ": null
    },
    {
        "Xe-135": "Xe-135"
    },
    {
        " poisoning in nuclear reactors, and for this reason it is sometimes referred to as Wigner poisoning. Wigner is also important for his work in pure mathematics, having authored a number of ": null
    },
    {
        "theorem": "Mathematical Theorem"
    },
    {
        "s.    ": null
    },
    {
        "Frank Wilczek": "Frank Wilczek"
    },
    {
        " : American theoretical physicist. Along with David J. Gross and Hugh David Politzer, won the Nobel Prize in Physics in 2004. Although Wilczek grew up in the Roman Catholic faith, he now considers himself agnostic. He still has a fondness for the Church, so this book should not offend Christians. In fact Wilczek cites Father James Malley for a Jesuit Credo that states: It is more blessed to ask forgiveness than permission. Jim Walker, nobeliefs.com.    ": null
    },
    {
        "Steve Wozniak": "Steve Wozniak"
    },
    {
        " : co-founder of ": null
    },
    {
        "Apple Computer": "Apple Computer"
    },
    {
        " and inventor of the Apple I and Apple II.    ": null
    },
    {
        "Chen Ning Yang": "Chen Ning Yang"
    },
    {
        " : Chinese-born American physicist who works on ": null
    },
    {
        "statistical mechanics": "Statistical Mechanics"
    },
    {
        " and ": null
    },
    {
        "particle physics": "Particle Physics"
    },
    {
        ". He and ": null
    },
    {
        "Tsung-dao Lee": "Tsung-Dao Lee"
    },
    {
        " received the 1957 Nobel Prize in Physics for their work on parity nonconservation of weak interaction.    ": null
    },
    {
        "Hubert Yockey": "Hubert Yockey"
    },
    {
        " : American physicist and information theorist.    ": null
    },
    {
        "Hans Zinsser": "Hans Zinsser"
    },
    {
        " : American ": null
    },
    {
        "bacteriologist": "Bacteriologist"
    },
    {
        " and a prolific author. He is known for his work in isolating the ": null
    },
    {
        "typhus": "Typhus"
    },
    {
        " bacterium and developing a protective vaccine.  Listed as an agnostic on NNDB.com. , NNDB.com.       ": null
    },
    {
        "Steve Austin": "Stone Cold Steve Austin"
    },
    {
        " : American professional wrestler.    ": null
    },
    {
        "Kristy Hawkins": "Kristy Hawkins"
    },
    {
        " : American IFBB professional bodybuilder and scientist.    ": null
    },
    {
        "Edmund Hillary": "Edmund Hillary"
    },
    {
        " : New Zealand mountaineer, explorer and philanthropist. He along with ": null
    },
    {
        "Tenzing Norgay": "Tenzing Norgay"
    },
    {
        " became the first climbers confirmed as having reached the summit of ": null
    },
    {
        "Mount Everest": "Mount Everest"
    },
    {
        ".    ": null
    },
    {
        "Pat Tillman": "Pat Tillman"
    },
    {
        " : American professional football player and U.S. Army veteran. Krakauer, Jon Where Men Win Glory, Doubleday, 2009, pp. 116 and 314. Tillman was an agnostic, perhaps even an atheist . See also quotes from Tillmans brother Kevin.   ": null
    },
    {
        "Rafael Nadal": "Rafael Nadal"
    },
    {
        " : Spanish professional tennis player.    ": null
    },
    {
        "Rob Van Dam": "Rob Van Dam"
    },
    {
        " : American professional wrestler, winner of three separate major promotion world championships.   ": null
    },
    {
        "Leonardo DiCaprio": "Leonardo Dicaprio"
    }
]