[
    {
        "            Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " composed ": null
    },
    {
        "cantatas": "bach cantata"
    },
    {
        ", ": null
    },
    {
        "motets": "list of motets by johann sebastian bach"
    },
    {
        ", ": null
    },
    {
        "masses, Magnificats": "bachs church music in latin"
    },
    {
        ", ": null
    },
    {
        "Passions": "passions"
    },
    {
        ", ": null
    },
    {
        "oratorios": "list of oratorios by johann sebastian bach"
    },
    {
        ", ": null
    },
    {
        "four-part chorales": "list of chorale harmonisations by johann sebastian bach"
    },
    {
        ", ": null
    },
    {
        "songs and arias": "list of songs and arias by johann sebastian bach"
    },
    {
        ". His instrumental music includes ": null
    },
    {
        "concerto": "concerto"
    },
    {
        "s, ": null
    },
    {
        "suite": "suite"
    },
    {
        "s, ": null
    },
    {
        "sonata": "sonata"
    },
    {
        "s, ": null
    },
    {
        "fugues": "list of fugal works by johann sebastian bach"
    },
    {
        ", and other works ": null
    },
    {
        "for organ": "list of organ compositions by johann sebastian bach"
    },
    {
        ", ": null
    },
    {
        "harpsichord, lute": "list of keyboard and lute compositions by johann sebastian bach"
    },
    {
        ", ": null
    },
    {
        "violin, cello, flute, chamber ensemble": "list of chamber music works by johann sebastian bach"
    },
    {
        " and ": null
    },
    {
        "orchestra": "list of orchestral works by johann sebastian bach"
    },
    {
        ".     There are over 1000 known compositions by Bach. Nearly all of them are listed in the  , which is the best known and most widely used catalogue of Bachs compositions.          The earliest lists of Bachs compositions are given by ": null
    },
    {
        "his biographers": "biographies of johann sebastian bach"
    },
    {
        ", starting from ": null
    },
    {
        "his obituary": "bachs nekrolog"
    },
    {
        " which gives a list of instrumental ": null
    },
    {
        "works printed during the composers lifetime": "list of compositions by johann sebastian bach printed during his lifetime"
    },
    {
        " , followed by a list which groups other types of compositions he wrote. The ": null
    },
    {
        "first separately published biography of the composer": "johann sebastian bach: his life, art, and work"
    },
    {
        ", by ": null
    },
    {
        "Johann Nikolaus Forkel": "johann nikolaus forkel"
    },
    {
        ", follows the same setup: its ninth chapter first lists printed works , followed by a rough overview of the unpublished ones. In the first half of the 19th century more works were published, so the next biographies had more elaborate appendices listing printed works, referring to these works by publisher, and the number or page number given to the works in these publications. So, for example, the ": null
    },
    {
        "Prelude and Fugue in E-flat major": "prelude and fugue in e flat major, bwv 552"
    },
    {
        " can be indicated as ": null
    },
    {
        "C. F. Peters": "c. f. peters"
    },
    {
        " Vol. III No. 1 , or any of the variants          In the second half of the 19th century the ": null
    },
    {
        "Bach-Gesellschaft": "bach-gesellschaft"
    },
    {
        " published all of Bachs works in around 50 volumes, the so-called ": null
    },
    {
        "Bach Gesellschaft Ausgabe": "bach gesellschaft ausgabe"
    },
    {
        " .  This offered a unique identification of all of Bachs known works, a system that was quickly adopted, for instance by the biographers: ": null
    },
    {
        "Philipp Spitta": "philipp spitta"
    },
    {
        " used it complementarily to the Peters edition numbering for the BG volumes that had appeared when he was writing ": null
    },
    {
        "his Bach-biography": "spittas johann sebastian bach"
    },
    {
        " in the second half of the 19th century , and Terry used it in the third Appendix to his 20th-century translation of Forkels biography. ": null
    },
    {
        "Johann Nikolaus Forkel": "johann nikolaus forkel"
    },
    {
        " translated by ": null
    },
    {
        "Charles Sanford Terry": "charles sanford terry"
    },
    {
        ".  New York: Harcourt, Brace and Howe; London: Constable. 1920.      But there was still a lot of confusion: some authors preferred to list Bachs works according to ": null
    },
    {
        "Novellos": "novello  &  co"
    },
    {
        "editions, or ": null
    },
    {
        "Augener": "augener  &  co."
    },
    {
        "s, or ": null
    },
    {
        "Schirmer": "g. schirmer inc."
    },
    {
        "s,... giving rise to various conversion tables at the end of books on Bachs compositions .       In 1900 the BG published its last volume, and dissolved itself, as its primary goal, publishing all of Bachs known works, was accomplished. The BG was succeeded by the ": null
    },
    {
        "Neue Bachgesellschaft": "neue bachgesellschaft"
    },
    {
        " , with a new set of goals . Occasionally however the NBG published newly discovered works, or variants not published in the BGA. For instance the 1740s version of  O Jesu Christ, meins Lebens Licht  was published in NBG XVII 1 in 1916 .          In 1950 the Bach-Werke-Verzeichnis was published, allocating a unique number to every known composition by Bach. ": null
    },
    {
        "Wolfgang Schmieder": "wolfgang schmieder"
    },
    {
        ", the editor of that catalogue, grouped the compositions by genre, largely following BG for the collation : ": null
    },
    {
        "Wolfgang Schmieder": "wolfgang schmieder"
    },
    {
        " . Thematisch-systematisches Verzeichnis der musikalischen Werke von Johann Sebastian Bach. Leipzig: Breitkopf & Härtel, 1950. Unaltered up unto its eighth printing in 1986.      ": null
    },
    {
        "Kantaten ": "bwv chapter 1"
    },
    {
        ", BWV 1–224   ": null
    },
    {
        "Motetten ": "bwv chapter 2"
    },
    {
        ", BWV 225–231   ": null
    },
    {
        "Messen, Messensätze, Magnificat ": "bwv chapter 3"
    },
    {
        ", BWV 232–243   ": null
    },
    {
        "Passionen, Oratorien ": "bwv chapter 4"
    },
    {
        ", BWV 244–249   ": null
    },
    {
        "Vierstimmige Choräle ": "bwv chapter 5"
    },
    {
        ", BWV 250–438   ": null
    },
    {
        "Lieder, Arien, Quodlibet ": "bwv chapter 6"
    },
    {
        ", BWV 439–524   ": null
    },
    {
        "Werke für Orgel ": "bwv chapter 7"
    },
    {
        ", BWV 525–771   ": null
    },
    {
        "Werke für Klavier ": "bwv chapter 8"
    },
    {
        ", BWV 772–994   ": null
    },
    {
        "Werke für Laute ": "bwv chapter 9"
    },
    {
        ", BWV 995–1000   ": null
    },
    {
        "Kammermusik ": "bwv chapter 10"
    },
    {
        ", BWV 1001–1040   ": null
    },
    {
        "Orchesterwerke ": "bwv chapter 11"
    },
    {
        ", BWV 1041–1071, originally in two separate chapters: Concertos and Overtures   ": null
    },
    {
        "Kanons ": "bwv chapter 12"
    },
    {
        ", BWV 1072–1078   ": null
    },
    {
        "Musikalisches Opfer, Kunst der Fuge ": "bwv chapter 13"
    },
    {
        ", BWV 1079–1080     For instance, the Prelude and Fugue in E-flat major now became ": null
    },
    {
        "BWV 552": "bwv 552"
    },
    {
        ", situated in the range of the works for organ. In contrast to other catalogues such as the ": null
    },
    {
        "Köchel catalogue": "köchel catalogue"
    },
    {
        " for ": null
    },
    {
        "Mozarts": "mozart"
    },
    {
        "compositions there is no attempt at chronological organization in the BWV numbering, for instance ": null
    },
    {
        "BWV 992": "bwv 992"
    },
    {
        " is an early composition by Bach. Exceptionally BWV numbers are also indicated as Schmieder numbers .  at      Another consequence of the ordering principles of the BWV was that it tore known collections apart, for instance ": null
    },
    {
        "Clavier-Übung III": "clavier-übung iii"
    },
    {
        " was partly in the organ compositions range , with the four duets listed among the keyboard compositions .       The Anhang , i.e. Appendix, of the BWV listed works that were not suitable for the main catalogue, in three sections:   ": null
    },
    {
        "I – lost works, or works of which only a tiny fraction had survived": "bwv anhang"
    },
    {
        "   II – works of dubious authenticity": "bwv anhang ii"
    },
    {
        "   III – works that were once attributed to Bach, but for which it had been established they were not composed by him": "bwv anhang iii"
    },
    {
        "   Within each section of the Anhang the works are sorted by genre, following the same sequence of genres as the main catalogue.          Schmieder published the BWVs second edition in 1990, with some modifications regarding authenticity discriminations, and more works added to the main catalogue and the Anhang. A strict numerical collation was abandoned to insert additions, or when for another reason compositions were regrouped. For example, ": null
    },
    {
        "BWV 11": "bwv 11"
    },
    {
        ", formerly listed as a Cantata, was moved to the fourth chapter of the main catalogue as an Oratorio. Rather than renumbering a composition, an arrow indicated where the composition was inserted:  meaning BWV  11, inserted after BWV  249b . Similarly,  meant ": null
    },
    {
        "BWV  1083": "bwv & nbsp;1083"
    },
    {
        ", inserted after BWV  243a . Also authenticity discriminations, based on new research, could lead to such repositionings within the catalogue, e.g.  became  indicating it was now considered a spurious work. Thematisch-systematisches Verzeichnis der musikalischen Werke von Johann Sebastian Bach: Bach-Werke-Verzeichnis, überarbeitete und erweiterte Ausgabe. Wiesbaden: Breitkopf & Härtel, 1990.  –      In 1998 ": null
    },
    {
        "Alfred Dürr": "alfred dürr"
    },
    {
        " and Yoshitake Kobayashi published a small edition of the catalogue, based on the 1990 second edition. This edition, known as BWV 2a , contained a few further updates and collation rearrangements. ": null
    },
    {
        "Alfred Dürr": "alfred dürr"
    },
    {
        ", Yoshitake Kobayashi , Kirsten Beißwenger. Bach Werke Verzeichnis: Kleine Ausgabe, nach der von Wolfgang Schmieder vorgelegten 2. Ausgabe. Preface in English and German. Wiesbaden: Breitkopf & Härtel, 1998.  –      New additions to BWV 2 /BWV 2a included:   ": null
    },
    {
        "BWV 1081–1126": "additions to the main catalogue"
    },
    {
        " BWV Anh. 190–213": "additions to the anhang"
    },
    {
        "     A few exceptions to the principle that compositions werent renumbered were when a composition from the Anhang could be recovered and/or authenticated as Bachs, so that it deserved a place in the main catalogue, in which case it was given a number above 1080. So, for example, BWV  Anh.  205 → BWV  1121 .  at      Other renumberings and additional numbers involved alternative or earlier versions of basically the same composition, which were indicated by adding a lower case letter to the BWV number. Examples:   ": null
    },
    {
        "BWV 243a": "bwv 243a"
    },
    {
        ": 1723 E major version of the 1733 Magnificat in D major ": null
    },
    {
        "BWV 243": "bwv 243"
    },
    {
        " BWV 1071": "bwv 1071"
    },
    {
        " renumbered to ": null
    },
    {
        "BWV 1046a": "bwv 1046a"
    },
    {
        "    BWV Anh. 198": "bwv anh. 198"
    },
    {
        " renumbered to ": null
    },
    {
        "BWV 149/1a": "bwv 149/1a"
    },
    {
        "      Some versions were completely removed from the catalogue, e.g. ": null
    },
    {
        "BWV 655b": "bwv 655b"
    },
    {
        " and ": null
    },
    {
        "c": "bwv 655c"
    },
    {
        "     Slashes indicate movements: e.g. ": null
    },
    {
        "BWV  149": "bwv & nbsp;149"
    },
    {
        "/1 indicates the first movement of the Cantata BWV  149. Another example: the ": null
    },
    {
        "Agnus Dei": "mass in b minor structureagnus dei"
    },
    {
        " of the ": null
    },
    {
        "Mass in B minor": "mass in b minor"
    },
    {
        " can be indicated as BWV  232/22 , or alternatively as BWV  232 IV /4 .       ": null
    },
    {
        "Numbers above BWV 1126": "21st century"
    },
    {
        " were added in the 21st century.       An upper case R added to a BWV number indicates a ": null
    },
    {
        "reconstructed version": "reconstructions"
    },
    {
        ", that is a conjectured earlier version of a known composition. One of such reconstructions, the Concerto for oboe and violin, as published in NBA VII/7 p.  75, based on the double harpsichord concerto BWV 1060, is known as ": null
    },
    {
        "BWV 1060R": "bwv 1060r"
    },
    {
        ".       As of mid-2018 the ": null
    },
    {
        "Bach digital": "bd"
    },
    {
        " website started to implement the new numbers of the 3rd edition of the Bach-Werke-Verzeichnis, which had been announced for publication in that year.  at ": null
    },
    {
        "Bach Archive": "bach archive"
    },
    {
        " website For example, the Leipzig version of the ": null
    },
    {
        "Christ lag in Todes Banden cantata": "bwv 4"
    },
    {
        " used to be BWV  4 in previous versions of the catalogue, and, in BWV 3 , has become ": null
    },
    {
        "BWV  4.2": "bwv & nbsp;4.2"
    },
    {
        ". Work  at the ": null
    },
    {
        "Bach digital": "bd"
    },
    {
        " website, as updated 6 July 2018.          In the meantime, the ": null
    },
    {
        "New Bach Edition": "new bach edition"
    },
    {
        " was being published,  at  offering a new system to refer to Bachs works, e.g. , which is Series  IV, Volume  4, p.  2 and p.  105 , for BWV  552.          Some years after the completion of the NBA in 2007 its publisher ": null
    },
    {
        "Bärenreiter": "bärenreiter"
    },
    {
        " joined with the ": null
    },
    {
        "Bach Archive": "bach archive"
    },
    {
        " again to publish revised editions of some of Bachs scores. These revised editions, aligning with the NBA editions , but outside that group of publications, were published under the name Johann Sebastian Bach: New Edition of the Complete Works – Revised Edition , in short: New Bach Edition – Revised , abbreviated as NBArev. Where the original NBA editions were exclusively in German, the volumes of the Revised series have their introductions both in German and English. Its first volume, NBArev 1, was a new edition of the ": null
    },
    {
        "Mass in B minor": "mass in b minor"
    },
    {
        ", appearing in 2010.  at the ": null
    },
    {
        "Bärenreiter": "bärenreiter"
    },
    {
        " website       The Bach Compendium , a catalogue covering Bachs vocal works, was published in 1985. ": null
    },
    {
        "Hans-Joachim Schulze": "hans-joachim schulze"
    },
    {
        " and ": null
    },
    {
        "Christoph Wolff": "christoph wolff"
    },
    {
        ". Bach Compendium: Analytisch-bibliographisches Repertorium der Werke Johann Sebastian Bachs, Vol. 1 . Leipzig 1985ff. Occasionally works that have no BWV number can be identified by their BC number, e.g. BC  C  8 for ": null
    },
    {
        "Der Gerechte kömmt um": "der gerechte kömmt um"
    },
    {
        " an arrangement attributed to Bach on stylistic grounds, however unmentioned in the BWV.  at        Bachs Notenbibliothek is a list of works Bach had at his disposition. Works of other composers which were arranged by Bach and/or which he copied for performance usually have a BNB number. Kirsten Beißwenger . Johann Sebastian Bachs Notenbibliothek. Kassel: Bärenreiter.        The ": null
    },
    {
        "Berlin State Library": "berlin state library"
    },
    {
        " holds an important collection of composition manuscripts relating to Bach. Some versions of works are best known by their principal manuscript in the SBB, for instance  , or according to the abbreviations used at the Bach-digital website .               Apart from indicating his first published keyboard composition as Opus 1, Bach didnt use ": null
    },
    {
        "opus number": "opus number"
    },
    {
        "s, so Bachs works cant be listed by opus number. Lists following publication chronologies are for example implied in the first list in Bachs obituary, and BG numbers – overall lists covering all of Bachs compositions in order of first publication are however not a way Bachs compositions are usually presented.     Listing Bachs works according to their time of composition cant be done comprehensively: for many works the period in which they were composed is a very wide range. For Bachs larger vocal works research has led to some more or less generally accepted chronologies, covering most of these works: a catalogue in this sense is Philippe Zwangs list giving a chronological number to the cantatas BWV 1–215 and 248–249.  at  This list was published in 1982 as Guide pratique des cantates de Bach in Paris, . A revised edition was published in 2005 .          Various catalogues with works by other composers have intersections with collections of works associated with Bach:  at    ;BR-WFB BR : ": null
    },
    {
        "Bach-Repertorium": "wilhelm friedemann bachworks list"
    },
    {
        " numbers for works by ": null
    },
    {
        "Wilhelm Friedemann Bach": "wilhelm friedemann bach"
    },
    {
        ", e.g. BWV  970 BR  A49   :Other BRs:   :BR-CPEB: works by ": null
    },
    {
        "Carl Philipp Emanuel Bach": "carl philipp emanuel bach"
    },
    {
        "   :BR-JCFB: works by ": null
    },
    {
        "Johann Christoph Friedrich Bach": "johann christoph friedrich bach"
    },
    {
        "   ;Fk F : ": null
    },
    {
        "Falck catalogue": "wilhelm friedemann bachworks list"
    },
    {
        " numbers for works by ": null
    },
    {
        "Wilhelm Friedemann Bach": "wilhelm friedemann bach"
    },
    {
        ", e.g. BWV  970 F  25/2   ;H : ": null
    },
    {
        "Helm": "list of compositions by carl philipp emanuel bach"
    },
    {
        " numbers for works by ": null
    },
    {
        "Carl Philipp Emanuel Bach": "carl philipp emanuel bach"
    },
    {
        ", e.g. BWV  1036 H  569   ;HWV : Works by ": null
    },
    {
        "George Frideric Handel": "george frideric handel"
    },
    {
        ", e.g. BWV  Anh.  106 ": null
    },
    {
        "HWV": "händel-werke-verzeichnis"
    },
    {
        "  605   ;TWV : Compositions by ": null
    },
    {
        "Georg Philipp Telemann": "georg philipp telemann"
    },
    {
        ", e.g. BWV  824 ": null
    },
    {
        "TWV": "georg philipp telemannpartial list of works"
    },
    {
        "  32:14   ;Warb W : ": null
    },
    {
        "Warburton": "list of compositions by johann christian bach"
    },
    {
        " numbers for works by ": null
    },
    {
        "Johann Christian Bach": "johann christian bach"
    },
    {
        ", e.g.  W  A22    ;Wq : ": null
    },
    {
        "Wotquenne": "list of compositions by carl philipp emanuel bach"
    },
    {
        " numbers for works by ": null
    },
    {
        "Carl Philipp Emanuel Bach": "carl philipp emanuel bach"
    },
    {
        ", e.g. BWV  1036 Wq  145       There are over 1500 works that feature in a catalogue of works by Bach, like the Bach-Werke-Verzeichnis, and/or in a collection of works associated with Bach . Of these around a thousand are original compositions by Bach, that is: more than a mere copy or transcription of an earlier work by himself or another composer.           :See also  Legend to the table  below       ": null
    },
    {
        "Mass in B minor": "mass in b minor"
    },
    {
        "; ": null
    },
    {
        "Kyrie–Gloria Masses": "kyrie–gloria masses, bwv 233–236"
    },
    {
        "; separate Mass movements  St Matthew Passion ;  St John Passion ;  St Mark Passion ;  St Luke Passion  Christmas Oratorio ;  Easter Oratorio  ": null
    },
    {
        "tributed to Keiserattributed to Keis": "tributed to keiserattributed to keis"
    },
    {
        " not set by Bach, apart from using some parts of this text in his St Matthew Passionusually for SATB choirmost prominently in the ": null
    },
    {
        "chorale cantatas": "chorale cantata"
    },
    {
        "  separate   doubtfuldoubtfulWeddingincompletestrophic aria rediscovered in 2005                ": null
    }
]