[
    {
        "   This list includes European ": null
    },
    {
        "countries": "countries"
    },
    {
        " and ": null
    },
    {
        "regions": "regions"
    },
    {
        " that were part of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", or that were given ": null
    },
    {
        "Latin": "latin"
    },
    {
        " place names in ": null
    },
    {
        "historical": "historical"
    },
    {
        " references": "reference work"
    },
    {
        ". As a large portion of the latter were only created during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", often based on scholarly ": null
    },
    {
        "etiology": "etiology"
    },
    {
        ", this is not to be confused with a list of the actual names modern regions and settlements bore during the ": null
    },
    {
        "classical era": "classical era"
    },
    {
        ".       Until the ": null
    },
    {
        "Modern Era": "modern era"
    },
    {
        ", ": null
    },
    {
        "Latin": "latin"
    },
    {
        " was the ": null
    },
    {
        "common language": "lingua franca"
    },
    {
        " for ": null
    },
    {
        "scholarship": "scholarship"
    },
    {
        " and ": null
    },
    {
        "mapmaking": "cartography"
    },
    {
        ". During the 19th and 20th centuries, German scholars in particular have made significant contributions to the study of historical place names, or Ortsnamenkunde. These studies have, in turn, contributed to the study of ": null
    },
    {
        "genealogy": "genealogy"
    },
    {
        ". For genealogists and historians of pre-Modern Europe, knowing alternate names of places is vital to extracting information from both public and private records. Even specialists in this field point out, however, that the information can be easily taken out of context, since there is a great deal of repetition of place names throughout Europe; reliance purely on apparent connections should therefore be tempered with valid historical methodology.       Latin place names are not always exclusive to one place & mdash; for example, there were several Roman cities whose names began with Colonia and then a more descriptive term. During the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", these were often shortened to just Colonia. One of these, Colonia Agrippinensis, retains the name today in the form of ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ".     Early sources for ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " names show numerous variants and spellings of the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " names.     The modern canonical name is listed first. Sources are listed chronologically. In general, only the earliest source is shown for each name, although many of the names are recorded in more than one of the sources. Where the source differs in spelling, or has other alternatives, these are listed following the source. As an aid to searching, variants are spelled completely, and listed in most likely chronology.     Superscripts indicate:   Latinized form of the Greek-derived name.   Latinized form of the Asian-derived name via Greek.   Altered Latinized form of the Greek-derived name.                       ": null
    },
    {
        "Czech Republic": "czech republic"
    },
    {
        "              Estonia": "estonia"
    },
    {
        "                                             ": null
    }
]