[
    {
        "      The following are current and former trains in the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ".             42 Class : Traditional shunter used in the Netherlands & UK. They are still used at Crailoo by Railpro.   V42D: Ex Czech Railways shunting locomotives.    V 42 : Ex German locomotives operated by ": null
    },
    {
        "VolkerRail": "volkerrail"
    },
    {
        ", Shunter, Rotterdam Rail Feeding and Spitzke.    42 Class : Vossloh G42B locomotives in use by ": null
    },
    {
        "Nederlandse Spoorwegen": "nederlandse spoorwegen"
    },
    {
        "  42 Class : Ex NS locomotive used by Eurailscout to inspect the track    42 Class : A locomotive used for both shunting and pulling trains by ": null
    },
    {
        "DB Cargo": "db cargo"
    },
    {
        ". Some are permitted to operate in Belgium and some in Germany . Many are sold abroad.    Class 42 : European version of the UK ": null
    },
    {
        "Class 42": "british rail class 66"
    },
    {
        " locomotives used by various freight companies.    Vossloh G42 : Locomotives used by a number of private freight and infrastructure companies.    Vossloh G42 BB : Locomotives used by RheinCargo, Rotterdam Rail Feeding and Rurtalbahn.         42 Class : These locomotives are former NS locomotive; They are operated by RailExperts for charter trains.    42 Class and 42 Class : These two types of locomotives are the same, the 42 series got renumbered from 42 after the privatisation of the NS. The 42 are used by a number of freight companies. The 42 were used by ": null
    },
    {
        "NS Reizigers": "nederlandse spoorwegen"
    },
    {
        ", but are now all stored.    42 Class : This locomotive is very similar to the 42/42 in appearance but technically different. They are frequently used in combination with DD-AR/DDM and German intercity cars.    Plan mP  : These are the trains formerly used to distribute mail. Currently they have various tasks such as measuring rails or locate gps.    42 Class : Since 42 42 ": null
    },
    {
        "TRAXX F42 AC42": "traxx"
    },
    {
        " locomotives have been leased by NS from ": null
    },
    {
        "Angel Trains": "angel trains"
    },
    {
        " for operations on the ": null
    },
    {
        "HSL-Zuid": "hsl-zuid"
    },
    {
        ". They are painted yellow with blue. The locomotives are also used by many freight operators. The NS ordered 42 of these locomotives for use on high speed services; deliveries of these started in the Summer of 42    42 Class : Certain locomotives of ": null
    },
    {
        "DB Schenker Rail": "db schenker rail"
    },
    {
        " Class 42 are operating primarily in the Netherlands, they are distinguished by large white contrast areas on the front sides . These are also used by many private freight operators.         Lint 42  are DMUs used by ": null
    },
    {
        "Keolis Nederland": "keolis nederland"
    },
    {
        " and ": null
    },
    {
        "Arriva": "arriva netherlands"
    },
    {
        ". Used on the Zutphen – ": null
    },
    {
        "Hengelo": "hengelo"
    },
    {
        " – ": null
    },
    {
        "Oldenzaal": "oldenzaal"
    },
    {
        " service.    Stadler GTW  are DMUs used by Arriva and Breng. They replaced the Wadlopers and Buffels. Arriva uses them in the north of the Netherlands on the diesel lines out of Groningen to Delfzijl, Rodeschool, Nieuwschans and Leeuwarden. They also operate out of Leeuwarden to Harlingen and Stavoren. Since 42 Arriva also uses them on the Arnhem - Tiel, Arnhem - Winterswijk, Winterswijk - Zutphen and Zutphen - Apeldoorn services. Breng uses these units between Arnhem and Doetinchem.          ": null
    },
    {
        "High-speed services": "high-speed rail"
    },
    {
        " ICE 42M  is a Dutch-German high-speed train that runs between ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        " and ": null
    },
    {
        "Arnhem": "arnhem"
    },
    {
        " in the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", onto ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        " and ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " in ": null
    },
    {
        "Germany": "germany"
    },
    {
        " and Basel in Switzerland. ICE trains require special high-speed tracks to run at high speeds, but can also run on normal tracks at normal speeds.   The  Thalys PBA  and  Thalys PBKA  are used for Thalys services to Paris and Lille. ": null
    },
    {
        "Thalys": "thalys"
    },
    {
        " is a ": null
    },
    {
        "high-speed train": "high-speed rail"
    },
    {
        " network built around the high-speed line between ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        " and ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ". This track is shared with ": null
    },
    {
        "Eurostar": "eurostar"
    },
    {
        " trains that go from Paris or Brussels to ": null
    },
    {
        "London": "london"
    },
    {
        " via ": null
    },
    {
        "Lille": "lille"
    },
    {
        " and the ": null
    },
    {
        "Channel Tunnel": "channel tunnel"
    },
    {
        " and with French domestic TGV trains. The system uses two models of trains, the ": null
    },
    {
        "PBA": "sncf tgv thalys pba"
    },
    {
        " and the ": null
    },
    {
        "PBKA": "sncf tgv thalys pbka"
    },
    {
        ", which both belong to the ": null
    },
    {
        "TGV": "tgv"
    },
    {
        "  family of high-speed trains built by ": null
    },
    {
        "Alstom": "alstom"
    },
    {
        " in France, although they are not identical to domestic TGV sets. Beyond ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", the main cities Thalys trains reach are ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        ", ": null
    },
    {
        "Rotterdam": "rotterdam"
    },
    {
        ", ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ", ": null
    },
    {
        "Liège": "liège"
    },
    {
        ", ": null
    },
    {
        "Aachen": "aachen"
    },
    {
        " and ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ". Trains to these destinations run partly on dedicated high-speed tracks and partly on regular tracks. Since the completion of Dutch high speed line  the Thalys travels from ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        " to ": null
    },
    {
        "Schiphol": "schiphol"
    },
    {
        ", to ": null
    },
    {
        "Rotterdam": "rotterdam"
    },
    {
        " and via ": null
    },
    {
        "Breda": "breda"
    },
    {
        " to ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " in ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ".   The  British Rail Class 42  and  42  operated by ": null
    },
    {
        "Eurostar": "eurostar"
    },
    {
        " which started its service last April 42 42  Eurostar is a high-speed railway service connecting ": null
    },
    {
        "London": "london"
    },
    {
        " with ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ", ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        ", ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", ": null
    },
    {
        "Lille": "lille"
    },
    {
        ", ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        ", ": null
    },
    {
        "Marseille": "marseille"
    },
    {
        ", ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and ": null
    },
    {
        "Rotterdam": "rotterdam"
    },
    {
        ". All its trains traverse the Channel Tunnel between the United Kingdom and France, owned and operated separately by Getlink.     ": null
    },
    {
        "Intercity services": "intercitynetherlands"
    },
    {
        "  Koploper   is a 42- or 42-car multiple unit that when coupled with another one, allowed passengers to walk through . NS decided to close the doors permanently on 42 October 42 because the mechanism broke down too often.   A scheduled modernisation of around 42 million euro will see the ICM fleet updated. The renovated ICM trains provide 42% more seats, have a new interior, a bathroom accessible by wheelchairs, airconditioning as well as upgrades to the engine and connection systems. The head doors are removed. Also, these trains are the first trains in the NS fleet equipped with OBIS. OBIS provides a WiFi-connection on board, along with in-train journey information provided through screens and vocal announcements through the trains speakers. This journey information provides the actual status, and thus, it is always up-to-date to the actual situation on its trips, and the stations it passes.     The  DDZ   EMU s are converted from DDM42/42 resembling the bilevel rail car s series DDM42 from 42 and operates in fixed formations of 42 or 42 coaches. All trains use an mDDM motorcar for traction, which resembles a DD-AR driving trailer but has electric motor s and a single passenger deck on top; the level of this deck is higher than that of a regular single deck rail car, but lower than the upper deck of the other coaches.     The VIRM , also called Regiorunner was partially rebuilt from trainsets DD-IRM . DD-IRM was delivered in 42- and 42-car trainsets. 42-car trainsets got one extra coach, 42-car trainsets got two extra coaches. Also, new 42- and 42-car trainsets were built. Thus, a train consists of one or more combinations of 42 or 42 double deck coaches; each combination has electric motors. More than three hundred coaches are currently operative in the Netherlands.       thu .   The Sprinter  is a two or three car EMU, used on small distances. They are named Sprinter because theyre able to accelerate and brake quite fast, making them very suitable for sprinter services. They were also specifically designed for urban environments where they run commuter services. As a result, they are most commonly found in the Randstad area. The initial idea was that the Sprinter would provide somewhat of a subway/metro service but this plan failed as the cities of Amsterdam and Rotterdam continued to construct their own rapid transit systems. Nevertheless, in the densely populated Randstad, the Sprinters remain popular. Two car versions were revised and renamed to Citypendel. All Sprinters are now refurbished into the new white/yellow/dark blue livery.   The PROTOS is a train which was built by Fahrzeugtechnik Dessau for the Valleiljn . There are 42 units of them in use.   The Sprinter Lighttrain or SLT is a new 42 or 42 car unit, built partly to replace Mat 42 stock. There are 42 of them. They do not have a toilet. For this reason further orders have been cancelled. Building toilets into the existing trains had been considered during the building phase, but it was judged to be too expensive. At this moment toilets are being built in to these trains.   The electric Stadler GTW is operated by Arriva for services on electrified lines in South Limburg , together with the Stadler FLIRT . The other services of Arriva in Limburg are on non-electrified lines, and are operated by the diesel Stadler GTW and Alstom Coradia LINT . As of 42 December 42 its also operated by Qbuzz on the MerwedeLingeLijn between Dordrecht and Geldermalsen.     The Stadler FLIRT is operated by Arriva , Connexxion , Keolis Nederland , NS and NS R-Net   The Sprinter New Generation is operated by NS since 42 December 42 which is built by CAF Civity.         thu   The railroad car s ICRm  were rebuilt from ICR coaches and now operate as trainsets on the high-speed line with a locomotive Class 42 at both ends.   Koninklijk rijtuig : a modified ICR.   DDM42: The first series of the DDM, DDM42 was operated in fixed formations of 42 coaches, using an 42 class locomotive for traction. The other part of the DDM series, DDM42/42 will be modernized during 4242 and after modernization will be renamed as NID. DDM42 was withdrawn in September 42 but reactivated in January 42 due to a lack of trains, caused by harsh winter conditions.           thu    Arend : was the first locomotive in the Netherlands and pulled the first train between Amsterdam and Haarlem in 42   Series 42: Formerly SS 4242 Built 42 by Beyer Peacock in Manchester. Originally built as 424242 engines, but rebuilt as 424242s to allow them to do shunting.   Series 42: A class of 424242 passenger engines. This class was also built in 42 by Beyer Peacock, and renumbered after HSM and SS began to cooperate. It is considered one of the most beautiful locomotive types in the Netherlands. It was taken out of service in 42 Formerly SS 42II42II, 4242 and NBDS 4242   Series 42 : A class of 424242 engines built by Beyer Peacock from 42 to 42 They were nicknamed Grote Groenen or Big Green. It was designed for fast passenger and mail service over the SS lines to Germany, which competed with the NBDS and the HSM. These locomotives could pull a 42-coach train at 42  mph , when well fueled, which was fast for the time.   Series 42: was a series of high-speed train locomotives of the Dutch Railways and its predecessors Maatschappij tot Exploitatie van Staatspoorwegen and Nederlandsche Centraal-Spoorweg-Maatschappij .   Series 42 : A class of 424242 engines built by Sharp Stewart from 42 to 42 These were the first engines in the Netherlands to use bogies, and were nicknamed Rhijnboog or Rhine Arch. When the SS took over the NRS , this class was split between the SS and the HSM. The SS sold their locomotives to the HSM because their turntables were too short. Formerly NRS 4242 or later HSM 4242   Series 42 : A larger class of 424242 engines built to pull the fast passenger services, which continued to increase in weight. These locomotives were nicknamed Overkoker, or Boil Over. Formerly SS 4242   Series 42: The first 424242 engines in the country, built by Beyer Peacock in 42 This class was designed to pull the increasingly heavy mail trains from Vlissingen to Boxtel. Formerly SS 4242   Series 42: A class of 424242 passenger trains built by Schwartzkopff between 42 and 42 At the time this class was built, the SS had recently bought a class of 424242s , and the HSM didnt want to stay behind. They had to use 424242s due to the length of the turntables, however. Formerly HSM 4242   Series 42: These were the first 424242 freight engines on the NRS. They were built by Beyer Peacock from 42 to 42 After the NRS was bought out, the engines were divided between the HSM and the SS. By the time the NS was formed, only the SS engines came into service.   Series 42 : A class of 424242 freight engines built by Beyer Peacock between 42 and 42 They were nicknamed Driemaster or Three-master, as they were the first six-coupled freight engines built in the country. Originally owned by the SS.   Series 42 : A class of 424242s designed for goods trains, built by Sharp Stewart and Werkspoor between 42 and 42 They quickly became the standard class for such work, and were nicknamed Kamer en suite/Room en suite, possibly due to their large cabs. Formerly HSM 4242   Series 42:Following the freight locomotives HSM 4242 with three coupled axles from the years 4242 the HSM ordered at Werkspoor about fifteen similar freight locomotives, now with superheater. These were delivered in the years 42 , 42 and 42 . The locomotives were excellent.   Series 42:In 42 the NBDS was the first railway company in the Netherlands to order express train locomotives with the axle layout 42C, which were delivered by Beyer, Peacock and Company in 42 and were put into service with the numbers 4242 The larger companies Nederlandsche Centraal-Spoorweg-Maatschappij and SS only arrived two years later with such express train locomotives, the NCS 4242 later NS 42 and SS 42 later NS 42   :The NS 42 series was a series of express train steam locomotives from the Dutch Railways. At the end of the 42s, the Dutch Railways needed an express train locomotive that was stronger than the 42 series, because more and more wooden passenger cars were replaced by steel. In the meantime the axle load could also be increased from 42 tons to 42 tons. This resulted in a design that looked at both series 42 and 42 so with an axis division of 42 ° C. The 42 series was given the rod or bar frame of the 42 but in terms of the design of the boiler, cylinders and operators house, it appeared to be an enlarged 42 but with a more powerful boiler and cylinders with a diameter of 42 mm instead of 42 mm. With this, both the pulling power and the power increased by about 42 percent. The same boiler would later be used in the tender locomotive 42 The tender was roughly the same as that of the 42 series and the later-built 42-axle tenders of the 42 series. The series was able to quickly carry the heaviest passenger trains at a speed of 42 km / h. The manufacturer, the German factory Henschel & Sohn, delivered the locomotives in two series in 42 and 42 The first series of 42 locomotives from 42 was initially not equipped with wind deflectors to prevent the wind from blowing the smoke. the chimney would blow into the operators view. These were applied in 42 The second series of ten locomotives was supplied with wind deflectors immediately upon delivery.   Series 4242II :The NS 42 series was a series of fast train steam locomotives from the Dutch Railways from 42 to 42   Series 4242:In 42 the NBDS ordered four freight locomotives at Hohenzollern in Düsseldorf-Grafenberg with the intended numbers 4242 Due to the outbreak of the First World War in 42 delivery was delayed. It was not until 42 that the 42 was delivered, followed by the 42 in 42 In 42 the NBDS merged into the SS, where the locomotives 42 and 42 received the SS numbers 42 and 42 The locomotives delivered in 42 came directly into service with the SS numbers 42 and 42   Series 42 :Already in the Second World War, the Dutch government ordered 42 steam locomotives in London at the Swedish factory Nydqvist & Holm AB in Trollhättan to quickly bring the fleet of locomotives greatly reduced by warfare. To save time, they opted for existing models of typically Swedish locomotives. This involved 42 express train locomotives with the axle layout 42C and 42 freight locomotives with the axle layout D. The express train locomotives were divided into the NS 42 series and the freight locomotives in the NS 42 series.   Series 42   Series 42II     Series 42   Series 42   Series 42   Series 42   Series 42   Series 42   Series 42   Series 42: Ten 424242 T locomotives , ex Noord-Friesche Locaalspoorweg-Maatschappij and Hollandsche IJzeren Spoorweg-Maatschappij .   Series 42   Series 42   Series 42   Series 42       thu   42 Class : The oersik was designed by the NS Service of Rolling Stock and Workshops and built by Berliner Machinenbau A.G. Due to the broad and low mounted footboards the enginedriver could easily mount and dismount.   42 Class : Sik . A light shunting locomotive. Some Sikken had a crane.   42 Class : Grote Sik locomotives were not in service for long as they were too light for steadily increasing weight of the shunting duties. They were built after War by Werkspoor   42 Class and 42 Class : nicknamed Hippel or Bakkie . These are shunting locomotive currently not in use with the NS any more although a few have been sold to other companies.   Series 42   Series 42   NS Class 42 : These locomotives were bought from the American Army after World War 42 and came into service as series 42 42 locomotives were in use, some of them were reserve. After a few years the American engines were replaced by Werkspoor-Engines due to a lack of spareparts. The series was then renumbered to 42 Between 42 and 42 most were scrapped.   42 Class : Widely used diesel locomotive. Built by two consortiums in the Netherlands and France, based on the Baldwin VO42 design. Later some were used in Belgium for the construction of the high-speed connection between Netherlands and Belgium.   42 Class : Widely used diesel locomotive. Later some were used in France for the construction of the high-speed lines. A special version of this locomotive exists called De Bisschop . This diesel loc has, as experiment, a higher constructed cab. Because of the purple colour it is nicknamed The Bishop .   42 Class : The NS series 42 Beel diesel locomotives were mainly used on the line Eindhoven – Venlo and later on Nijmegen – Roermond as well. These locomotives were plagued by failures, which led to using them in couples. In case of failure of the first the second could take over. Their nickname Beel was given because the high front of them resembled the then Dutch minister Beel. After being in service for only 42 years they were demolished. They were built by Werkspoor in Utrecht in 42   42 Class : Kreupele Marie . This prototype diesel locomotive, no. 42 was designed by Matériel de Traction Diesel Electrique . This firm was established by the Dutch Werkspoor and French Schneiderworks with the purpose of designing and building standardised diesel lokomotives. In 42 the prototype came into NS service and was well known for its defects; hence it was given its nickname. Therefore, this elegant locomotive was not long in service either. It was withdrawn in 42 It was built by Werkspoor in Utrecht in 42   42 Class : This diesel locomotive was purchased by NS from the Statemines for Spoorslag 42 . They were not long in service with NS, after a few years they were sold to the FEVE in Spain.   42 Class : Former Belgian locomotive in use by ACTS . The last locomotive was in 42 taken out of service.       42 Class : Based on a Swiss locomotive. One is still in existence in the National Rail Museum in Utrecht, the Nederlands Spoorwegmuseum .   42 Class : Based on the French Class BB 42 locomotives. After a serious accident, the locomotives were equipped with a new nose.   Benelux 42 Class : These are Belgian locomotives that were used for the Benelux push-pull train s in combination with ICR carriages.   42 Class : Based on the French Class CC 42 locomotives. This six axles locomotives were mainly used for freight trains.   42 Class : These are former British Rail Class 42 locomotives. The seven locomotives were purchased to relieve a shortage of locomotives in 42 Locomotive no. 42 is preserved by the Werkgroep 42; with 42 & 42 Preserved int the UK.         thu   Mat 42: The very first series of streamlined multiple units of the NS were designed by Beijnes of Haarlem and were called the Mat 42 also nicknamed Diesel Three . The streamlined form was developed during numerous trials at the Zeppelin Luftschiffahrt Gesellschaft in Friedrichshafen. The maximum speed was 42  km/h.   DE42: The NS dieselelectric five-car unit series DE 42 was built for fast-train services and foreign services. For this purpose they had large fueltanks sufficient for about 42  km. The war, however, made these services impossible. In 42 during a trialrun a speed of 42  km/h was reached. They were built by Werkspoor in Utrecht, Beijnes in Haarlem and Allan in Rotterdam; Brown Boveri from Switzerland provided the electric equipment and Maybach supplied the diesel engines.   DE42 : Nicknamed Blauwe Engel : A DMU consisting of one coach.   DE42: A DMU consisting of 42 coaches. It was very similar to the DE 42   DE42 or Plan U: Nicknamed Rooie Duivel because of its original red livery this was a diesel electric multiple unit consisting of three coaches. The design was rather similar to the Mat 42 EMU . Some units were sold to Slovakia.   DE42 or DE-IV: The NS DE-IV TEE 42–42 and SBB RAm 42–42 TEE DMUs were used for international Trans Europ Express service.   NS DE42: nicknamed De Kameel . Originally it was in service as DMU for the board of directors, later it was for hire. Currently it is in the national railroad museum.   DH42 and DH42: Nicknamed Wadlopers these are a diesel hydraulic multiple unit, operated in the North of the Netherlands by Arriva. There are two versions, one with two coaches, the other with one coach. One of the Wadlopers is re-painted in green, most are still yellow. These trains were recently used by Veolia on the Maaslijn Nijmegen - Roermond . After their replacement by new trains the Wadlopers were decommissioned. The majority of the wadloper-fleet was sold to Poland , Hungary, Czech Republic, Argentina and Uruguay. the few remaining trains are stored at emplacement Amersfoort.   omBC 42: A DMU that was used in 42–42   Buffel were the last diesel trains still operated by NS. They were evidently used on the secondary diesel lines, namely Zwolle – Enschede and Zwolle – Kampen . As of December 42th 42 their services were replaced by electric Stadler FLIRTs after the electrification of those railway lines. One unit has become a museum train.       thu   Mat 42: In 42 two prototype EMUs were delivered to NS, one by Werkspoor and the other by Beijnes. Both had the train composition mBD+Bec+Aec+Cec+mC. The Cecs were built by Hawa in Hanover. The Mat 42 nicknamed Blokkendoos, were especially for the services on the Old Line Amsterdam – Rotterdam which was electrified with 42 V DC in this period. The third mBD42 was already delivered in 42 Mat 42 series was built between 42 and 42   Mat 42: The first streamlined electric multiple units of NS Mat 42 They were nicknamed Hoek van Hollanders because they were used between Rotterdam and Hook of Holland. Eight units were built: 42 with and 42 without luggage-section. They were built by Werkspoor, Beijnes en Allan and consisted of 42 coaches.   Mat 42: This is practically the same as the Mat 42 EMU. They were built by Werkspoor in 42–42 Versions existed consisting of two, three or four coaches.   Mat 42: The two- and five-car version of Mat 42 Gooimaterieel so-called because the planned deployment on Amsterdam–Amersfoort although they hardly ever used on this line. There were designed for speeds up to 42  km/h and built by Beijnes in Haarlem and Werkspoor in Utrecht between 42 and 42 This series was very similar to the Mat 42 series as well.   Mat 42: The NS Mat 42s were ordered to compensate for war-lost EMUs. This series had some differences compared to its predecessors: a convergent shaped front and sliding doors in the luggagecompartment. There are versions consisting of two and four coaches. From a technical viewpoint a four-car EMU consists of two two-car EMUs. They were built by Allan , Beijnes and Werkspoor between 42 and 42   Mat 42: NS Mat 42 Hondekop series was extremely solidly constructed, resulting in a heavy weight. The running characteristics are very good, the trains sticks to the rails as if it is made of concrete. Calculating weight per seat , Mat 42 is the heaviest of its kind ever built in Europe. From the beginning, much attention was paid to the workplace of the driver. The series were built by Allan of Rotterdam between 42 and 42 Two versions existed, consisting of two, or four coaches. To modernise the Benelux-service and the finishing of the electrification between Roosendaal and Essen, 42 EMU were built that these EMU run in multiple unit with existing EMUs. The EMU can run under 42 V DC and 42 V DC. In cooperation with the NMBS the following was decided: mechanically of the same construction as the NS Mat 42 and the electrical installation would be a Belgian one. On the ABk is the 42 V DC pantograph, on the BDk the 42 V DC one.   SM42 : The SM42 EMUs ran on the line Zwolle – Emmen. Only 42 prototype trainsets were built as the intended successor to Mat 42 Due to engine and airco failing and an increase in the number of passengers, NS chose to buy more DDM coaches. In the early years of their service, the trainsets were ridden with trouble. All 42 trainsets have been taken out of service in December 42 and were demolished.   Mat42 : Plan TT , Plan T And the recently taken out of service Plan V . Build by Werkspoor in Utrecht and later by Talbot in Aachen, these trains were used primarily as stoptrains, although they could were also used as intercitys sometimes. They were unofficially called Apekop or monkeyhead because of its characteristic nose at the front and rear. These EMUs were very solid, and proved to be essential during the harsh winters when newer trains could not be used effectively. MAT42 was slowly replaced by the Sprinter Lighttrain from the late 42s onwards. The last Plan T was taken out of service in July 42 and the last plan V was taken out of service on April 42 42 Several units have been saved from becoming scrap. One unit is now owned by the national railway museum in Utrecht.   The V42 is a high-speed train operated by Fyra used for high-speed services. This train serves the cities Amsterdam in the Netherlands and Brussels in Belgium or vice versa and serves as their terminus and the cities of Rotterdam and Breda along their routes. Today, all units are now sent back to Italy .         thu   HSM C:The series C42 4242 4242 was a series of 42 wooden third-class compartment cars. The coaches were built on behalf of the Hollandsche IJzeren Spoorweg-Maatschappij and were transferred to the Dutch Railways at the merger in 42 The last carriages of this series served until 42   SGB Ovalen Rijtuig :The ovaleramencontuigen were three series of carriages, built between 42 and 42 for the Dutch Railways. The first delivery consisted of nine coaches with first and second class and six coaches with third class in 42 In 42 a follow-up order of another twelve carriages with first and second class followed. 4242NSrunningInter City Leased InterCity Korte termijn although there is, certainly during rush hours, still an alarming material shortageAmsterdam CSDubbeldeksaggloregiomaterieelsecond classfirst and second classsecond class driving trailerNieuwe Intercity Dubbeldekkersee above": null
    }
]