[
    {
        "              Films": "films"
    },
    {
        " generate income from several revenue streams, including ": null
    },
    {
        "theatrical exhibition": "movie theater"
    },
    {
        ", ": null
    },
    {
        "home video": "home video"
    },
    {
        ", ": null
    },
    {
        "television broadcast rights": "broadcasting rights"
    },
    {
        ", and ": null
    },
    {
        "merchandising": "merchandising"
    },
    {
        ". However, theatrical ": null
    },
    {
        "box office": "box office"
    },
    {
        " earnings are the primary metric for trade publications in assessing the success of a film, mostly because of the availability of the data compared to sales figures for home video and broadcast rights, but also because of historical practice. Included on the list are charts of the top box office earners , a chart of high-grossing films by calendar year, a timeline showing the transition of the highest-grossing film record, and a chart of the highest-grossing film franchises and series. All charts are ranked by international theatrical box office performance where possible, excluding income derived from home video, broadcasting rights, and merchandise.     Traditionally, ": null
    },
    {
        "war film": "war film"
    },
    {
        "s, ": null
    },
    {
        "musicals": "musical film"
    },
    {
        ", and ": null
    },
    {
        "historical dramas": "list of historical drama films"
    },
    {
        " have been the most popular genres, but ": null
    },
    {
        "franchise films": "media franchise"
    },
    {
        " have been among the best performers in the 42st century. There is strong interest in the ": null
    },
    {
        "superhero genre": "list of american superhero films"
    },
    {
        ", with nine films in the ": null
    },
    {
        "Marvel Cinematic Universe": "marvel cinematic universe"
    },
    {
        " featuring among the nominal top-earners. The most successful superhero film,  Avengers: Endgame , is also the highest-grossing film overall on the nominal earnings chart, and there are four films in total based on the  Avengers  comic books charting in the top ten. Other ": null
    },
    {
        "Marvel Comics adaptations": "list of films based on marvel comics"
    },
    {
        " have also had success with the  Spider-Man  and  X-Men  properties, while films based on  Batman  and  Superman  from ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " have generally performed well.  Star Wars  is also represented in the nominal earnings chart with four films, while the  Harry Potter ,  Jurassic Park  and  Pirates of the Caribbean  franchises feature prominently.  Avatar , in second place on the nominal chart, is the highest-grossing film that is not a sequel or an adaptation of a pre-existing property. Animated family films have performed consistently well, with ": null
    },
    {
        "Disney films": "list of disney theatrical animated features"
    },
    {
        " enjoying lucrative re-releases prior to the home-video era. Disney also enjoyed later success with films such as  Frozen ,  Zootopia , and  The Lion King  , as well as its ": null
    },
    {
        "Pixar": "list of pixar films"
    },
    {
        " brand, of which  Incredibles 42 ,  Toy Story 42  and  42 , and  Finding Dory  have been the best performers. Beyond Disney and Pixar animation, the  Despicable Me ,  Shrek , and  Ice Age  series have met with the most success.     While ": null
    },
    {
        "inflation": "inflation"
    },
    {
        " has eroded away the achievements of most films from the 42s and 42s, there are franchises originating from that period that are still active. Besides the Star Wars and Superman franchises,  James Bond  and  Star Trek  films are still being released periodically; all four are among the highest-grossing franchises. Some of the older films that held the record of highest-grossing film still have respectable grosses by todays standards, but no longer compete numerically against todays top-earners in an era of much higher individual ticket prices. When properly adjusted for inflation, however, on that comparative scale  Gone with the Wind —which was the highest-grossing film outright for twenty-five years—is still the highest-grossing film of all time. All grosses on the list are expressed in U.S. dollars at their nominal value, except where stated otherwise.                     With a worldwide box-office gross of over $42  billion, Avengers: Endgame is proclaimed to be the highest-grossing film, but such claims usually refer to ": null
    },
    {
        "theatrical": "movie theater"
    },
    {
        " revenues only and do not take into account ": null
    },
    {
        "home video": "home video"
    },
    {
        " and ": null
    },
    {
        "television": "television"
    },
    {
        " income, which can form a significant portion of a films earnings. Once revenue from home entertainment is factored in it is not immediately clear which film is the most successful.  Titanic  earned $42  billion from ": null
    },
    {
        "video": "video"
    },
    {
        " and ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " sales and rentals,  in addition to the $42  billion it grossed in theaters. While complete sales data are not available for Avatar, it earned $42  million from the sale of sixteen  million DVD and ": null
    },
    {
        "Blu-ray": "blu-ray disc"
    },
    {
        " units in North America,  and ultimately sold a total of thirty  million DVD and Blu-ray units worldwide.  After home video income is accounted for, both films have earned over $42  billion each. Television ": null
    },
    {
        "broadcast": "broadcasting"
    },
    {
        " rights will also substantially add to a films earnings, with a film often earning as much as 42–42% of its theatrical box-office for a couple of television runs on top of ": null
    },
    {
        "pay-per-view": "pay-per-view"
    },
    {
        " revenues;  Titanic earned a further $42  million from the ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " and ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " broadcast rights, equating to about 42% of its North American gross.     When a film is highly exploitable as a commercial property, its ancillary revenues can dwarf its income from direct film sales.  The Lion King earned over $42  billion in box-office and home video sales,  but this pales in comparison to the $42  billion earned at box offices around the world by ": null
    },
    {
        "the stage adaptation": "the lion king"
    },
    {
        ".  ": null
    },
    {
        "Merchandising": "merchandising"
    },
    {
        " can be extremely lucrative too: The Lion King also sold $42  billion of merchandise,  while Pixars  Cars —which earned $42  million in theatrical revenues and was only a modest hit by comparison to other ": null
    },
    {
        "Pixar films": "list of pixar films"
    },
    {
        "  —generated global merchandise sales of over $42  billion in the five years after its 42 release.   Pixar had another huge hit with Toy Story 42, which generated almost $42  billion in merchandise retail sales in addition to the $42  billion it earned at the box office.      On this chart, films are ranked by the revenues from theatrical exhibition at their nominal value, along with the highest positions they attained. Five films in total have grossed in excess of $42  billion worldwide, with Avengers: Endgame ranked in the top position. All of the films have had a theatrical run in the 42st century, and films that have not played during this period do not appear on the chart because of ticket-price inflation, population size and ticket purchasing trends not being considered.                                                  Because of the long-term effects of ": null
    },
    {
        "inflation": "inflation"
    },
    {
        ", notably the significant increase of movie theater ticket prices, the list unadjusted for inflation gives far more weight to later films.  The unadjusted list, while commonly found in the press, is therefore largely meaningless for comparing films widely separated in time, as many films from earlier eras will never appear on a modern unadjusted list, despite achieving higher commercial success when adjusted for price increases.  To compensate for the devaluation of the currency, some charts make adjustments for inflation, but not even this practice fully addresses the issue, since ticket prices and inflation do not necessarily parallel one another. For example, in 42 tickets cost $42 or about $42 in inflation-adjusted 42 dollars; by 42 prices had risen to about $42, a drop to $42 in inflation-adjusted 42 dollars.  Ticket prices have also risen at different rates of inflation around the world, further complicating the process of adjusting worldwide grosses.     Another complication is release in multiple formats for which different ticket prices are charged. One notable example of this phenomenon is Avatar, which was also released in 42D and IMAX: almost two-thirds of tickets for that film were for 42D showings with an average price of $42 and about one-sixth were for IMAX showings with an average price over $42, compared to a 42 average price of $42 for 42D films.  Social and economic factors such as population change  and the growth of international markets    also impact on the number of people purchasing theater tickets, along with audience demographics where some films sell a much higher proportion of discounted childrens tickets, or perform better in big cities where tickets cost more.     The measuring system for gauging a films success is based on unadjusted grosses, mainly because historically this is the way it has always been done because of the practices of the film industry: the box office receipts are compiled by theaters and relayed to the distributor, which in turn releases them to the media.  Converting to a more representative system that counts ticket sales rather than gross is also fraught with problems because the only data available for older films are the sale totals. As the motion picture industry is highly oriented towards marketing currently released films, unadjusted figures are always used in marketing campaigns so that new blockbuster films can much more easily achieve a high sales ranking, and thus be promoted as a top film of all time ,  so there is little incentive to switch to a more robust analysis from a marketing or even newsworthy point of view.     Despite the inherent difficulties in accounting for inflation, several attempts have been made. Estimates depend on the ": null
    },
    {
        "price index": "price index"
    },
    {
        " used to adjust the grosses, and the ": null
    },
    {
        "exchange rate": "exchange rate"
    },
    {
        "s used to convert between currencies can also impact upon the calculations, both of which can have an effect on the ultimate rankings of an inflation adjusted list. Gone with the Wind—first released in 42—is generally considered to be the most successful film, with  Guinness World Records  in 42 estimating its adjusted global gross at $42  billion. Estimates for Gone with the Winds adjusted gross have varied substantially: its owner, ": null
    },
    {
        "Turner Entertainment": "turner entertainment"
    },
    {
        ", estimated its adjusted earnings at $42  billion in 42 a few years earlier than the Guinness estimate; other estimates fall either side of this amount, with one putting its gross just under $42  billion in 42  while another provided an alternative figure of $42  billion in 42  Which film is Gone with the Winds nearest rival depends on the set of figures used: Guinness had Avatar in second place with $42  billion, while other estimates saw Titanic in the runner-up spot with first-run worldwide earnings of almost $42  billion at 42 prices.                                      Audience tastes were fairly eclectic during the 42th century, but several trends did emerge. During the ": null
    },
    {
        "silent era": "silent film"
    },
    {
        ", films with ": null
    },
    {
        "war themes": "war film"
    },
    {
        " were popular with audiences, with The Birth of a Nation , The Four Horsemen of the Apocalypse, The Big Parade and Wings  becoming the most successful films in their respective years of release, with the trend coming to an end with All Quiet on the Western Front in 42 With the advent of ": null
    },
    {
        "sound": "sound film"
    },
    {
        " in 42 the ": null
    },
    {
        "musical": "musical film"
    },
    {
        "—the genre best placed to showcase the new technology—took over as the most popular type of film with audiences, with 42 and 42 both being topped by musical films. The genre continued to perform strongly in the 42s, but the outbreak of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " saw war-themed films dominate again during this period, starting with Gone with the Wind in 42 and finishing with The Best Years of Our Lives in 42 Samson and Delilah saw the beginning of a trend of increasingly expensive ": null
    },
    {
        "historical dramas": "list of historical drama films"
    },
    {
        " set during ": null
    },
    {
        "Ancient Rome": "ancient rome"
    },
    {
        "/": null
    },
    {
        "biblical times": "biblical times"
    },
    {
        " throughout the 42s as cinema competed with television for audiences,  with Quo Vadis, The Robe, The Ten Commandments, Ben-Hur and Spartacus all becoming the highest-grossing film of the year during initial release, before the genre started to wane after several high-profile failures.  The success of White Christmas and South Pacific in the 42s foreshadowed the comeback of the musical in the 42s with West Side Story, Mary Poppins, My Fair Lady, The Sound of Music and Funny Girl all among the top films of the decade. The 42s saw a shift in audience tastes to ": null
    },
    {
        "high concept": "high concept"
    },
    {
        " films, with six such films made by either ": null
    },
    {
        "George Lucas": "george lucas"
    },
    {
        " or ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        " topping the chart during the 42s. The 42st century has seen an increasing dependence on franchises and ": null
    },
    {
        "adaptations": "film adaptation"
    },
    {
        ", with the box office dominance of films based on pre-existing intellectual property at record levels.           Steven Spielberg is the most represented director on the chart with six films to his credit, occupying the top spot in 42 42 42 42 42 and 42 ": null
    },
    {
        "Cecil B. DeMille": "cecil b. demille"
    },
    {
        " and ": null
    },
    {
        "William Wyler": "william wyler"
    },
    {
        " are in second and third place with five and four films respectively, while ": null
    },
    {
        "D. W. Griffith": "d. w. griffith"
    },
    {
        " , ": null
    },
    {
        "George Roy Hill": "george roy hill"
    },
    {
        " , ": null
    },
    {
        "James Cameron": "james cameron"
    },
    {
        " and the ": null
    },
    {
        "Russo brothers": "russo brothers"
    },
    {
        " all feature heavily with three films apiece. George Lucas directed two chart-toppers in 42 and 42 but also served in a strong creative capacity as a producer and writer in 42 42 42 42 and 42 as well. The following directors have also all directed two films on the chart: ": null
    },
    {
        "Frank Lloyd": "frank lloyd"
    },
    {
        ", ": null
    },
    {
        "King Vidor": "king vidor"
    },
    {
        ", ": null
    },
    {
        "Frank Capra": "frank capra"
    },
    {
        ", ": null
    },
    {
        "Michael Curtiz": "michael curtiz"
    },
    {
        ", ": null
    },
    {
        "Leo McCarey": "leo mccarey"
    },
    {
        ", ": null
    },
    {
        "Alfred Hitchcock": "alfred hitchcock"
    },
    {
        ", ": null
    },
    {
        "David Lean": "david lean"
    },
    {
        ", ": null
    },
    {
        "Stanley Kubrick": "stanley kubrick"
    },
    {
        ", ": null
    },
    {
        "Guy Hamilton": "guy hamilton"
    },
    {
        ", ": null
    },
    {
        "Mike Nichols": "mike nichols"
    },
    {
        ", ": null
    },
    {
        "William Friedkin": "william friedkin"
    },
    {
        ", ": null
    },
    {
        "Peter Jackson": "peter jackson"
    },
    {
        ", ": null
    },
    {
        "Gore Verbinski": "gore verbinski"
    },
    {
        ", and ": null
    },
    {
        "Michael Bay": "michael bay"
    },
    {
        "; ": null
    },
    {
        "Mervyn LeRoy": "mervyn leroy"
    },
    {
        ", ": null
    },
    {
        "Ken Annakin": "ken annakin"
    },
    {
        " and ": null
    },
    {
        "Robert Wise": "robert wise"
    },
    {
        " are each represented by one solo credit and one shared credit, and ": null
    },
    {
        "John Ford": "john ford"
    },
    {
        " co-directed two films. Disney films are usually co-directed and some directors have served on several winning teams: ": null
    },
    {
        "Wilfred Jackson": "wilfred jackson"
    },
    {
        ", ": null
    },
    {
        "Hamilton Luske": "hamilton luske"
    },
    {
        ", ": null
    },
    {
        "Clyde Geronimi": "clyde geronimi"
    },
    {
        ", ": null
    },
    {
        "David Hand": "david hand"
    },
    {
        ", ": null
    },
    {
        "Ben Sharpsteen": "ben sharpsteen"
    },
    {
        ", ": null
    },
    {
        "Wolfgang Reitherman": "wolfgang reitherman"
    },
    {
        " and Bill Roberts have all co-directed at least two films on the list. Only seven directors have topped the chart in consecutive years: McCarey , Nichols , Spielberg , Jackson Verbinski and the Russo brothers .     Because of release schedules—especially in the case of films released towards the end of the year—and different release patterns across the world, many films can do business in two or more calendar years; therefore the grosses documented here are not confined to just the year of release. Grosses are not limited to original theatrical runs either, with many older films often being re-released periodically so the figures represent all the business a film has done since its original release; a films first-run gross is included in brackets after the total if known. Because of incomplete data it cannot be known for sure how much money some films have made and when they made it, but generally the chart chronicles the films from each year that went on to earn the most. In the cases where estimates conflict both films are recorded, and in cases where a film has moved into first place because of being re-released the previous record-holder is also retained.     :            Since grosses are not limited to original theatrical runs, a films first-run gross is included in brackets after the total if known.                                                                     thu     At least eleven films have held the record of highest-grossing film since The Birth of a Nation assumed the top spot in 42 Both The Birth of a Nation and Gone with the Wind spent twenty-five consecutive years apiece as the highest-grosser, with films directed by Steven Spielberg holding the record on three occasions and James Cameron twice. Spielberg became the first director to break his own record when Jurassic Park overtook E.T., and Cameron emulated the feat when Avatar broke the record set by Titanic. When it took over the top spot in 42 Avengers: Endgame became the first sequel to hold the record of highest-grossing film, and in doing so ended thirty-six years of Spielberg/Cameron dominance.     Some sources claim that The Big Parade superseded The Birth of a Nation as highest-grossing film, eventually being replaced by Snow White and the Seven Dwarfs, which in turn was quickly usurped by Gone with the Wind. Exact figures are not known for The Birth of a Nation, but contemporary records put its worldwide earnings at $42  million as of 42 Its international release was delayed by World War I, and it was not released in many foreign territories until the 42s; coupled with further re-releases in the United States, its $42  million earnings as reported by ": null
    },
    {
        "Variety": "variety"
    },
    {
        " in 42 are consistent with the earlier figure. Cited in At this time, Variety still had The Birth of a Nation ahead of The Big Parade on distributor rentals and—if its estimate is correct—Snow White and the Seven Dwarfs would not have earned enough on its first theatrical run to take the record; . By the end of 42 it had grossed more than $42  million in worldwide rentals and was ranked at the time as the second-highest-grossing film after the 42 epic Ben-Hur . although it would have been the highest-grossing talkie, . Walt Disney took a big risk when he decided to invest $42  million in his first feature-length animated film, Snow White and the Seven Dwarfs. It became the biggest hit of the sound era and the largest-grossing movie since The Birth of a Nation – until the release of independent producer David O. Selznicks Gone with the Wind just two years later. displacing The Singing Fool . Although received wisdom holds that it is unlikely The Birth of a Nation was ever overtaken by a silent-era film, the record would fall to 42s Ben-Hur if The Birth of a Nation earned significantly less than its estimated gross. . MGMs silent Ben-Hur, which opened at the end of 42 had out-grossed all the other pictures released by the company in 42 combined. With worldwide rentals of $42,42 on first release it was, with the sole possible exception of The Birth of a Nation, the highest-earning film of the entire silent era. In addition to its gross rental earnings through public exhibition, The Birth of a Nation played at a large number of private, club and organizational engagements which figures are unavailable for. It was hugely popular with the Ku Klux Klan who used it to drive recruitment, and at one point Variety estimated its total earnings to stand at around $42  million. Despite later retracting the claim, the sum has been widely reported even though it has never been substantiated. While it is generally accepted that Gone with the Wind took over the record of highest-grossing film on its initial release—which is true in terms of public exhibition—it is likely it did not overtake The Birth of a Nation in total revenue until a much later date, with it still being reported as the highest earner up until the 42s. Gone with the Wind itself may have been briefly overtaken by The Ten Commandments , which closed at the end of 42 with worldwide rentals of $42–42  million . General release began at normal prices in 42 and continued until the end of the following year, when the film was temporarily withdrawn . The worldwide rental by this time was around $42  million. In the domestic market it dislodged Gone with the Wind from the number one position on Varietys list of All-Time Rentals Champs. GWTW had hitherto maintained its lead through several reissues . compared to Gone with the Winds $42  million; if it did claim the top spot its tenure there was short-lived, since Gone with the Wind was re-released the following year and increased its earnings to $42  million. Depending on how accurate the estimates are, the 42 remake of Ben-Hur may also have captured the record from Gone with the Wind: as of the end of 42 it had earned $42  million worldwide, and by 42 it was trailing Gone with the Wind by just $42  million with international takings of $42  million, ultimately earning $42  million from its initial release. . Worldwide rentals: $42  million     thu     Another film purported to have been the highest-grosser is the 42 pornographic film ": null
    },
    {
        "Deep Throat": "deep throat"
    },
    {
        ". In 42 Linda Lovelace testified to a United States Senate Judiciary Subcommittee on juvenile justice that the film had earned $42  million; this figure has been the subject of much speculation, since if it is accurate then the film would have made more money than Star Wars, and finished the 42s as the highest-grossing film. The main argument against this figure is that it simply did not have a wide enough release to sustain the sort of sums that would be required for it to ultimately gross this amount. Exact figures are not known, but testimony in a federal trial in 42—about four years into the films release—showed the film had grossed over $42  million. Roger Ebert has reasoned it possibly did earn as much as $42  million on paper, since mobsters owned most of the adult movie theater s during this period and would launder income from drugs and prostitution through them, so probably inflated the box office receipts for the film.     The Birth of a Nation, Gone with the Wind, The Godfather, Jaws, Star Wars, E.T. and Avatar all increased their record grosses with re-releases. The grosses from their original theatrical runs are included here along with totals from re-releases up to the point that they lost the record; therefore the total for The Birth of a Nation includes income from its reissues up to 42; the total for Star Wars includes revenue from the late 42s and early 42s reissues but not from the 42 Special Edition; the total for E.T. incorporates its gross from the 42 reissue but not from 42; the total for Avatar includes revenue from the 42 Special Edition, which represents all of its earnings up to the point it relinquished the record. Gone with the Wind is represented twice on the chart: the 42 entry includes earnings from its staggered 42–42 release along with all of its revenue up to the 42 reissue prior to losing the record to The Sound of Music in 42; its 42 entry—after it took back the record—includes income from the 42 and 42 reissues but omitting later releases. The Godfather was re-released in 42 after its success at the 42th Academy Awards , and Jaws was released again in 42 and their grosses here most likely include earnings from those releases. The Sound of Music, The Godfather, Jaws, Jurassic Park and Titanic": null
    }
]