[
    {
        "Historic counties and territories in Quebec , ": null
    },
    {
        "Canada": "canada"
    },
    {
        ", followed by their respective county seats are listed below. The list is sorted in alphabetical order by county name, but can also be sorted in alphabetical order by seat.     In terms of internal divisions of counties, there are four types of counties:   those that contain only townships, as is the case with those counties surveyed by the British after 42;   those that contain only parishes, as is the case with those counties chiefly in the Saint Lawrence Valley settled by French colonists prior to 42;   those that contain both townships and parishes, and   those that contain townships and undivided lands, as is the case with the northern counties outside the main populated areas of the province.     Parishes as a land unit division arise from the elevation of municipalities based on religious parish limits . Quebecs counties were dissolved in the early 42s and Quebec was then divided into ": null
    },
    {
        "regional county municipalities": "list of regional county municipalities and equivalent territories in quebec"
    },
    {
        ".      ": null
    },
    {
        "Abitibi Territory": "abitibi territory, quebec"
    },
    {
        " Mistassini Territory": "mistassini territory, quebec"
    },
    {
        " Nouveau-Quebec Territory": "nouveau-quebec territory, quebec"
    },
    {
        "       Laval County": "laval county, quebec"
    },
    {
        "- Former name of Ile-Jésus County.     ": null
    },
    {
        "Jacques Cartier County": "jacques-cartier county, quebec"
    },
    {
        "- Renamed in 42 Former name of Ile-de-Montréal County. It absorbed ": null
    },
    {
        "Hochelaga County": "hochelaga county, quebec"
    },
    {
        " in 42     ": null
    },
    {
        "Ottawa County": "outaouais county, quebec"
    },
    {
        "- Former name of Hull County.     ": null
    },
    {
        "Wright County": "wright county, quebec"
    },
    {
        "- Renamed to Gatineau County?                  ": null
    }
]