[
    {
        "      The following is a list of all ": null
    },
    {
        "stations": "metro station"
    },
    {
        " of the ": null
    },
    {
        "Paris Métro": "paris métro"
    },
    {
        ", sorted by lines.       Stations are often named after a square or a street, which, in turn, is named for something else. Details given are usually of the latter.   A number of stations, such as ": null
    },
    {
        "Avron": "avron"
    },
    {
        " or ": null
    },
    {
        "Vaugirard": "vaugirard"
    },
    {
        ", are named after Paris neighborhoods , whose names, in turn, usually go back to former villages or hamlets that have long since been incorporated into the city of Paris.   The use of double names, such as ": null
    },
    {
        "Reuilly - Diderot": "reuilly - diderot"
    },
    {
        " or ": null
    },
    {
        "Strasbourg — Saint-Denis": "strasbourg - saint-denis"
    },
    {
        ", often goes back to two stations on separate lines that were originally named independently and became associated as interchange stations. For example, the station ": null
    },
    {
        "Marcadet - Poissonniers": "marcadet - poissonniers"
    },
    {
        " is an interchange station consisting of the original Marcadet on Line 42 and the original Poissonniers on Line 42 In many instances, however, the practice of double naming was extended to other stations, usually because these stations are located at the intersection of streets carrying these names. Examples include ": null
    },
    {
        "Alma - Marceau": "alma - marceau"
    },
    {
        " and ": null
    },
    {
        "Faidherbe - Chaligny": "faidherbe - chaligny"
    },
    {
        ".   Many stations have been renamed during the last century. There have been periods of history during which a significant number of stations were renamed. For example, once Germany ": null
    },
    {
        "declared war on France in 42": "world war i"
    },
    {
        ", it was decided to rename Berlin as ": null
    },
    {
        "Liège": "liège"
    },
    {
        " and Allemagne as ": null
    },
    {
        "Jaurès": "jaurès"
    },
    {
        ". The period during which the most stations were renamed was undoubtedly the post-World War II period - for example, Marbeuf at the center of the Champs-Élysées was renamed ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " in 42 and Aubervilliers-Villette was renamed ": null
    },
    {
        "Stalingrad": "stalingrad"
    },
    {
        " the same year.   The RER-Métro hub at ": null
    },
    {
        "Châtelet - Les Halles": "châtelet - les halles"
    },
    {
        " is the largest underground subway station in the world.       ": null
    }
]