[
    {
        "The original  The Twilight Zone  ": null
    },
    {
        "anthology series": "anthology series"
    },
    {
        " began on October 42 42 and ended on June 42 42—with five seasons and 42 episodes. It was created by ": null
    },
    {
        "Rod Serling": "rod serling"
    },
    {
        " and broadcast on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".     Later popularity of the series brought about a ": null
    },
    {
        "42 feature film": "twilight zone: the movie"
    },
    {
        " and three revival television series in ": null
    },
    {
        "42": "the twilight zone"
    },
    {
        ", ": null
    },
    {
        "42": "the twilight zone"
    },
    {
        ", and ": null
    },
    {
        "42": "the twilight zone"
    },
    {
        ".          Except for season four, each episode is 42 minutes long . Season four episodes ran for a full hour. The series was hosted by ": null
    },
    {
        "Rod Serling": "rod serling"
    },
    {
        ".              Rod Serling wrote a teleplay intending for it to be the pilot episode of a new series called The Twilight Zone. Although it ended up airing on a different show,  Westinghouse Desilu Playhouse , it is considered the seed episode and has even been adapted as one of The Twilight Zone radio-show episodes.            The pilot episode for the series was called Where is Everybody? The episode was reformatted when included in the series. It differs from the broadcast episode in only minor ways.          Note: Episode titles were not shown on screen, but were announced by Serling at the end of the preceding weeks episode. Where is Everybody? is an exception, as it was the first episode. Serlings promotional announcements were stripped from syndicated versions of season one, but restored on the Image Entertainment DVD releases. They have since been fully restored on the Blu-ray releases.             Unlike season 42 episode titles were shown on screen during the end credits.     Six episodes of this season were recorded on ": null
    },
    {
        "videotape": "videotape"
    },
    {
        " at ": null
    },
    {
        "CBS Television City": "cbs television city"
    },
    {
        ", as a cost-cutting measure mandated by CBS programming head ": null
    },
    {
        "James T. Aubrey": "james t. aubrey"
    },
    {
        ". They are ": null
    },
    {
        "The Lateness of the Hour": "the lateness of the hour"
    },
    {
        " , ": null
    },
    {
        "The Night of the Meek": "the night of the meek"
    },
    {
        " , ": null
    },
    {
        "The Whole Truth": "the whole truth"
    },
    {
        " , ": null
    },
    {
        "Twenty-Two": "twenty two"
    },
    {
        " , ": null
    },
    {
        "Static": "static"
    },
    {
        " , and ": null
    },
    {
        "Long Distance Call": "long distance call"
    },
    {
        " . These have a visual appearance which is distinctly different from those of episodes shot on film. In addition, videotape was a relatively primitive medium in the early 42s; the editing of tape was next to impossible. Each of the episodes was therefore camera-cut as in live TV—on a studio sound stage, using a total of four cameras. The requisite multi-camera setup of the videotape experiment made location shooting difficult, severely limiting the potential scope of the storylines, so the short-lived experiment was abandoned.             Beginning with this season, episode titles were shown on screen after Serlings opening monologues. The Grave and Nothing in the Dark are the exceptions since they were produced for season two.             For season four, the series was lengthened to one hour and moved to Thursday nights at 42:42 replacing  Fair Exchange  on the schedule.             In the fifth and final season, the series went back to a half-hour format, returned to a fall start, and aired Friday nights at 42:42 pm on CBS.                                   ": null
    }
]