[
    {
        "      This is a list of the heads of state of Kenya, from the independence of ": null
    },
    {
        "Kenya": "kenya"
    },
    {
        " in 42 to the present day.     From 42 to 42 the head of state under the Constitution of 42 was the ": null
    },
    {
        "Queen of Kenya": "queen of kenya"
    },
    {
        ", ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        ", who was also the ": null
    },
    {
        "Monarch of the United Kingdom": "monarchy of the united kingdom"
    },
    {
        " and the other ": null
    },
    {
        "Commonwealth realm": "commonwealth realm"
    },
    {
        "s. The monarch was represented in Kenya by a ": null
    },
    {
        "Governor-General": "list of heads of state of kenyagovernor-general"
    },
    {
        ". Kenya became a republic under a 42 constitutional amendment and the Monarch, Governor-General and Prime Minister were replaced by an executive ": null
    },
    {
        "President": "president of kenya"
    },
    {
        ".       The succession to the throne was the same as the ": null
    },
    {
        "succession to the British throne": "succession to the british throne"
    },
    {
        ".            The ": null
    },
    {
        "Governor-General": "list of heads of state of kenyagovernor-general"
    },
    {
        " was the representative of the Monarch in Kenya and exercised most of the powers of the Monarch. The Governor-General was appointed for an indefinite term, serving at the pleasure of the Monarch. Since Kenya was granted independence by the ": null
    },
    {
        "Kenya Independence Act 42": "kenya independence act 1963"
    },
    {
        ", rather than being first established as a semi-autonomous ": null
    },
    {
        "Dominion": "dominion"
    },
    {
        " and later promoted to independence by the ": null
    },
    {
        "Statute of Westminster 42": "statute of westminster 1931"
    },
    {
        ", the Governor-General was to be always appointed solely on the advice of the ": null
    },
    {
        "Cabinet of Kenya": "cabinet of kenya"
    },
    {
        " without the involvement of the British government. As Kenya became a Republic before Malcolm MacDonald, the former colonial governor, was replaced, this has never happened. In the event of a vacancy the ": null
    },
    {
        "Chief Justice": "chief justice of kenya"
    },
    {
        " would have served as ": null
    },
    {
        "Officer Administering the Government": "administrator of the government"
    },
    {
        ".     ;Status             Under the 42 Constitutional Amendment establishing the Republic of Kenya, the President replaced the Monarch as head of state and the Prime Minister as chief executive. The President was initially elected by the ": null
    },
    {
        "House of Representatives of Kenya": "house of representatives of kenya"
    },
    {
        ", and, after the merger of the House of Representatives and ": null
    },
    {
        "Senate": "senate of kenya"
    },
    {
        " into a ": null
    },
    {
        "unicameral": "unicameral"
    },
    {
        " National Assembly": "national assembly of kenya"
    },
    {
        ", by the National Assembly, for a five-year term. In the event of a vacancy the ": null
    },
    {
        "Vice-President": "deputy president of kenya"
    },
    {
        " would have served as ": null
    },
    {
        "Acting": "acting"
    },
    {
        " President for 42 days until new elections were held.     Following the enactment of the 42 Constitution of Kenya, the system of election by the National Assembly was replaced by direct elections under a ": null
    },
    {
        "first-past-the-post": "first-past-the-post"
    },
    {
        " system, yet true separation of powers was still not established; The President had to also be elected as an MP and he had to appoint his Ministers from among MPs, the President was still able to dissolve the National Assembly, and the Assembly was still able to declare no confidence in the ministers. Not only that, but until the first multiparty elections in 42 only one candidate - that of the Kenya African National Union - was nominated and automatically declared winner of the elections without voting actually being held.     With the enactment of the 42 Constitution, Kenyas current, the first-past-the-post system was replaced in presidential elections in favor of a ": null
    },
    {
        "two-round system": "two-round system"
    },
    {
        ", the post of Vice-President was renamed Deputy President and was made to automatically succeed to the Presidency in case of a vacancy for the remainder of the term in a full, not merely acting, capacity, and the requirement of the President, DP, and ministers to also be MPs was abolished, finally establishing separation of powers between the executive and legislature.       ;Status                                            ": null
    }
]