[
    {
        "The following is a list of drivers who are currently competing in a series sanctioned by the ": null
    },
    {
        "National Association for Stock Car Auto Racing": "nascar"
    },
    {
        " .       All statistics used in these tables are as of the end of qualifying for the 2019 Digital Ally 400 .           Drivers who will compete in all 2019 Monster Energy NASCAR Cup Series races.          Drivers who will compete in at least one 2019 Monster Energy NASCAR Cup Series race.          Drivers currently without a ride, but who competed for 2018 Monster Energy NASCAR Cup Series championship points.          All statistics used in these tables are as of the end of the 2019 ToyotaCare 250           Drivers who will compete in all 2019 NASCAR Xfinity Series races.          Drivers who will compete in at least one 2019 NASCAR Xfinity Series race.          Drivers currently without a ride, but who competed for 2018 NASCAR Xfinity Series championship points.          All statistics used in these tables are as of the end of the 2019 Vankor 350           Drivers who will compete in all 2019 NASCAR Gander Outdoors Truck Series races.          Drivers who will compete in at least one 2019 NASCAR Gander Outdoors Truck Series race.          Drivers currently without a ride, but who competed for 2018 NASCAR Camping World Truck Series championship points.          All statistics used in these tables are as of the end of the 2017 Pintys Fall Brawl 200                      All statistics used in these tables are as of the end of the 2019 Eneos NAPA Auto 150        Drivers who will compete in all 2019 NASCAR K & N Pro Series West races.          Drivers who will compete in at least one 2019 NASCAR K & N Pro Series West race.          All statistics used in these tables are as of the end of the 2019 Zombie Auto 150        Drivers who will compete in all 2019 NASCAR K & N Pro Series East races.          Drivers who will compete in at least one 2019 NASCAR K & N Pro Series East race.          All statistics used in these tables are as of the end of the 2019 Icebreaker 150                      All statistics used in these tables are as of the end of the 2015 RedCo 240                      All statistics used in these tables are as of the end of the 2019 American Festival NASCAR Finals . Records earned from 2009–2011 when the series was still called Racecar Euro Series will not be included to the statistics.       Drivers who competed in all 2019 NASCAR Whelen Euro Series races.          Drivers who competed in at least one 2019 NASCAR Whelen Euro Series race.          All statistics used in these tables are as of the end of the 2018 American Festival NASCAR Finals . Records earned from 2009–2011 when the series was still called Racecar Euro Series will not be included to the statistics.       Drivers who are scheduled to compete in all 2019 NASCAR Whelen Euro Series races.          Drivers who are scheduled to compete in at least one 2019 NASCAR Whelen Euro Series race.          All statistics used in these tables are as of the end of the 2019 Pensacola 200 presented by Inspectra Thermal Solutions        Drivers who will compete in all 2019 ARCA Menards Series races.          Drivers who will compete in at least one 2019 ARCA Menards Series race.   ": null
    }
]