[
    {
        "For other cycling related terms see ": null
    },
    {
        "Glossary of cycling": "glossary of cycling"
    },
    {
        ".     List of bicycle parts by alphabetic order:      Axle : as in the generic definition, a rod that serves to attach a wheel to a bicycle and provides support for bearings on which the wheel rotates. Also sometimes used to describe suspension components, for example a swing arm pivot axle    Bar ends : extensions at the end of straight handlebars to allow for multiple hand positions    Bar plugs  or end caps: plugs for the ends of handlebars    Basket : cargo carrier    Bearing : a device that facilitates rotation by reducing friction    Bell : an audible device for warning pedestrians and other cyclists    Belt-drive : alternative to chain-drive Bicycle brake cable: see Cable  Bottle cage : a holder for a water bottle    Bottom bracket : The bearing system that the pedals rotate around. Contains a spindle to which the crankset is attached and the bearings themselves. There is a bearing surface on the spindle, and on each of the cups that thread into the frame. The bottom bracket may be overhaulable or not overhaulable . The bottom bracket fits inside the bottom bracket shell, which is part of the bicycle frame    Brake : devices used to stop or slow down a bicycle. Rim brakes and disc brakes are operated by brake levers, which are mounted on the handlebars. Band brake is an alternative to rim brakes but can only be installed at the rear wheel. Coaster brakes are operated by pedaling backward    Brake lever : a lever for actuating a bicycle brake    Brake shifter  or colloquially, brifter : combined shifter and brake lever control    Braze-on : a fitting protruding from a frame to provide attachment, typically for cable housings or tire pumps and similar accessories    Cable guide : a fitting below the bottom bracket which guides a piece of bare inner ": null
    },
    {
        "bowden cable": "bowden cable"
    },
    {
        " around a corner    Cable : a metal cable enclosed in part by a metal and plastic housing that is used to connect a control, such as a brake or shifting lever, to the device it activates    Cartridge bearing : a type of bearing that is not user-serviceable, but must be replaced as a unit    Cassette : a group of stacked sprockets on the rear wheel of a bicycle with a rear derailleur    Coaster brake  or backpedal brake    Chain : a system of interlinking pins, plates and rollers that transmits power from the front sprocket to the rear sprocket    Chainguard : ": null
    },
    {
        "Gear case": "gear case"
    },
    {
        " cover for the entire chain either totally encasing  or incomplete. Either way, designed to keep clothing from fouling the chain. See also Skirtguard, Bashguard .  Chainring : front gear, attached to a crank    Chainset : see Crankset  Chainstay : a pair of tubes on a bicycle frame that runs from the bottom bracket to the rear fork ends    Chain tensioner : a device to maintain proper chain tension    Chaintug : a device to aid in setting the proper chain tension   Cluster: a bicycle ": null
    },
    {
        "cogset": "cogset"
    },
    {
        ", either a freewheel, or cassette    Cogset : the set of rear sprockets that attaches to the hub on the rear wheel    Cone : holds bearings in place, pressed against the cup    Cotter : pin for attaching cottered ": null
    },
    {
        "cranks": "cranksetto the bottom bracket"
    },
    {
        "  Coupler : to connect tubing together    Crankset  or chainset: composed of cranks and at least one chainring    Cup : receives ball bearings which roll along its inner surface; integrated on most conventional hubs or can be pressed into older bottom bracket shells. See also Cone  Cyclocomputer : an electronic accessory that measures and displays instantaneous and cumulative speed and distance. Often provides other measurements such as heart rate    Derailleur hanger : a piece on the rear ": null
    },
    {
        "dropout": "dropout"
    },
    {
        " that the derailleur attaches to.    Derailleur : an assembly of levers, usually cable actuated, that moves the chain between sprockets on a cassette or chainring assembly    Down tube : tube on the bicycle frame that runs from the head tube to the bottom bracket    Dropout : a bicycle rear fork end that allows the rear wheel to be removed without first derailing the chain. The term dropout is often incorrectly used to refer to any fork end, but not all fork ends are dropouts    Dustcap : any cap serving to keep dirt and contamination out of an assembly. Common over crank bolts, often plastic    Dynamo : bicycle lighting component, also known as generator  Eyelet :   :42     ": null
    }
]