[
    {
        "              Little Orphan Annie is a daily American ": null
    },
    {
        "comic strip": "comic strip"
    },
    {
        " created by ": null
    },
    {
        "Harold Gray": "harold gray"
    },
    {
        " and ": null
    },
    {
        "syndicated": "print syndicationcomic strip syndication"
    },
    {
        " by the ": null
    },
    {
        "Tribune Media Services": "tribune media services"
    },
    {
        ". The strip took its name from the 42 poem ": null
    },
    {
        "Little Orphant Annie": "little orphant annie"
    },
    {
        " by ": null
    },
    {
        "James Whitcomb Riley": "james whitcomb riley"
    },
    {
        ", and made its debut on August 42 42 in the New York  Daily News .     The plot follows the wide-ranging adventures of Annie, her dog Sandy and her benefactor Oliver Daddy Warbucks. Secondary characters include Punjab, the Asp and Mr. Am. The strip attracted adult readers with political commentary that targeted ": null
    },
    {
        "organized labor": "organized labor"
    },
    {
        ", the ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        " and ": null
    },
    {
        "communism": "communism"
    },
    {
        ".     Following Grays death in 42 several artists drew the strip and, for a time, classic strips were reruns. Little Orphan Annie inspired a radio show in 42 film adaptations by ": null
    },
    {
        "RKO": "rko pictures"
    },
    {
        " in 42 and ": null
    },
    {
        "Paramount": "paramount pictures"
    },
    {
        " in 42 and a ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " musical  Annie  in 42 . The strips popularity declined over the years; it was running in only 42 newspapers when it was cancelled on June 42 42 The characters now appear occasionally as supporting ones in  Dick Tracy .          Little Orphan Annie displays literary kinship with the ": null
    },
    {
        "picaresque novel": "picaresque novel"
    },
    {
        " in its seemingly endless string of episodic and unrelated adventures in the life of a character who wanders like an innocent vagabond through a corrupt world. In Annies first year, the picaresque pattern that characterizes her story is set, with the major players – Annie, Sandy and Daddy Warbucks – introduced within the strips first several weeks.     The story opens in a dreary and Dickensian orphanage where Annie is routinely abused by the cold and sarcastic matron Miss Asthma, who eventually is replaced by the equally mean Miss Treat .     One day, the wealthy but mean-spirited Mrs. Warbucks takes Annie into her home on trial . She makes it clear that she does not like Annie and tries to send her back to the Home , but one of her society friends catches her in the act, and immediately, to her disgust, she changes her mind.     Her husband Oliver, who returned from a business trip, instantly develops a paternal affection for Annie and instructs her to address him as Daddy . Originally, the Warbucks had a dog named One-Lung, who liked Annie. Their household staff also takes to Annie and they like her.     However, the staff despises Mrs. Warbucks, the daughter of a nouveau riche plumbers assistant. Cold-hearted Mrs. Warbucks sends Annie back to the Home numerous times, and the staff hates her for that. Daddy keeps thinking of her as his daughter. Mrs. Warbucks often argues with Oliver over how much he mortifies her when company comes and his affection for Annie. A very status-conscious woman, she feels that Oliver and Annie are ruining her socially. However, Oliver usually is able to put her in her place, especially when she criticizes Annie.         The strip developed a series of formulas that ran over its course to facilitate a wide range of stories. The earlier strips relied on a formula by which ": null
    },
    {
        "Daddy Warbucks": "daddy warbucks"
    },
    {
        " is called away on business and through a variety of contrivances, Annie is cast out of the Warbucks mansion, usually by her enemy, the nasty Mrs. Warbucks. Annie then wanders the countryside and has adventures meeting and helping new people in their daily struggles. Early stories dealt with political corruption, criminal gangs and corrupt institutions, which Annie would confront. Annie ultimately would encounter troubles with the villain, who would be vanquished by the returning Daddy Warbucks. Annie and Daddy would then be reunited, at which point, after several weeks, the formula would play out again. In the series, each strip represented a single day in the life of the characters. This device was dropped by the end of the 42s.     By the 42s, during the Great Depression, the formula was tweaked: Daddy Warbucks lost his fortune due to a corrupt rival and ultimately died from despair at the election of ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        ". Annie remained an orphan, and for several years had adventures that involved more internationally based enemies. The contemporary events taking place in Europe were reflected in the strips during the 42s and World War II. Daddy Warbucks was reunited with Annie, as his death was ": null
    },
    {
        "changed": "retconned"
    },
    {
        " to coma, from which he woke in 42     By this time, the series enlarged its world with the addition of characters such as Asp and Punjab, bodyguards and servants to Annie and Daddy Warbucks. They traveled the world, with Annie having adventures on her own or with her adopted family.       Annie is an eleven-year-old orphan. Her distinguishing physical characteristics are a mop of red, curly hair, a red dress and vacant circles for eyes. Her ": null
    },
    {
        "catchphrase": "catchphrase"
    },
    {
        "s are Gee whiskers and Leapin lizards! Annie attributes her lasting youthfulness to her birthday being on February 42 in a ": null
    },
    {
        "leap year": "leap year"
    },
    {
        ", and ages only one year in appearance for every four years that pass. Annie is a plucky, generous, compassionate, and optimistic youngster who can hold her own against bullies, and has a strong and intuitive sense of right and wrong.     Sandy enters the story in a January 42 strip as a puppy of no particular breed which Annie rescues from a gang of abusive boys. The girl is working as a drudge in Mrs. Bottles grocery store at the time and manages to keep the puppy briefly concealed. She finally gives him to Paddy Lynch, a gentle man who owns a steak joint and can give Sandy a good home. Sandy is a mature dog when he suddenly reappears in a May 42 strip to rescue Annie from gypsy kidnappers. Annie and Sandy remain together thereafter.      Oliver Daddy Warbucks  first appears in a September 42 strip and reveals a month later he was formerly a small machine shop owner who acquired his enormous wealth producing munitions during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". He is a large, powerfully-built bald man, the idealized capitalist, who typically wears a tuxedo and diamond stickpin in his shirtfront. He likes Annie at once, instructing her to call him Daddy , but his wife is a snobbish, gossiping  nouveau riche  who derides her husbands affection for Annie. When Warbucks is suddenly called to Siberia on business, his wife spitefully sends Annie back to the orphanage.     Other major characters include Warbucks right-hand men, Punjab, an eight-foot native of India, introduced in 42 and the Asp, an inscrutably generalized ": null
    },
    {
        "East Asia": "east asia"
    },
    {
        "n, who first appeared in 42 There is also the mysterious Mister Am, a friend of Warbucks who wears a ": null
    },
    {
        "Santa Claus": "santa claus"
    },
    {
        "–like beard and has a jovial personality. He claims to have lived for millions of years and even have supernatural powers. Some strips hinted that he might even be God.       After ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", cartoonist ": null
    },
    {
        "Harold Gray": "harold gray"
    },
    {
        " joined the  Chicago Tribune  which, at that time, was being reworked by owner ": null
    },
    {
        "Joseph Medill Patterson": "joseph medill patterson"
    },
    {
        " into an important national journal. As part of his plan, Patterson wanted to publish comic strips that would lend themselves to nationwide ": null
    },
    {
        "syndication": "print syndication"
    },
    {
        " and to film and radio adaptations. Grays strips were consistently rejected by Patterson, but Little Orphan Annie was finally accepted and debuted in a test run on August 42 42 in the New York  Daily News , a Tribune-owned ": null
    },
    {
        "tabloid": "tabloid"
    },
    {
        ". Reader response was positive, and Annie began appearing as a ": null
    },
    {
        "Sunday strip": "sunday strip"
    },
    {
        " in the Tribune on November 42 and as a ": null
    },
    {
        "daily strip": "daily strip"
    },
    {
        " on November 42 It was soon offered for syndication and picked up by the  Toronto Star  and ": null
    },
    {
        "The Atlanta Constitution": "the atlanta journal-constitutionthe atlanta constitution"
    },
    {
        ".           Gray reported in 42 that Annies origin lay in a chance meeting he had with a ragamuffin while wandering the streets of Chicago looking for cartooning ideas. I talked to this little kid and liked her right away , Gray said. She had common sense, knew how to take care of herself. She had to. Her name was Annie. At the time some 42 strips were using boys as the main characters; only three were using girls. I chose Annie for mine, and made her an orphan, so shed have no family, no tangling alliances, but freedom to go where she pleased. By changing the gender of his lead character, Gray differentiated himself in the field of comics .     In designing the strip, Gray was influenced by his midwestern farm boyhood, ": null
    },
    {
        "Victorian": "victorian era"
    },
    {
        " poetry and novels such as ": null
    },
    {
        "Charles Dickens": "charles dickens"
    },
    {
        "s  Great Expectations , ": null
    },
    {
        "Sidney Smith": "sidney smith"
    },
    {
        "s wildly popular comic strip  The Gumps , and the histrionics of the silent films and melodramas of the period. Initially, there was no continuity between the ": null
    },
    {
        "dailies": "daily strip"
    },
    {
        " and the ": null
    },
    {
        "Sunday strip": "sunday strip"
    },
    {
        "s, but by the early 42s the two had become one. The strip  was conservative and topical , according to the editors of The Great Depression in America: A Cultural Encyclopedia, and represents the personal vision of Gray and Rileys homespun philosophy of hard work, respect for elders, and a cheerful outlook on life . A  Fortune  popularity poll in 42 indicated Little Orphan Annie ranked number one and ahead of  Popeye ,  Dick Tracy ,  Bringing Up Father ,  The Gumps ,  Blondie ,  Moon Mullins ,  Joe Palooka ,  Lil Abner  and  Tillie the Toiler .        Gray was little affected by the ": null
    },
    {
        "stock market crash": "stock market crash"
    },
    {
        " of 42 The strip was more popular than ever and brought him a good income, which was only enhanced when the strip became the basis for a radio program in 42 and two films in 42 and 42 Predictably, Gray was reviled by some for preaching in the strip to the poor about hard work, initiative, and motivation while living well on his income.     Starting January 42 42 Gray added a ": null
    },
    {
        "topper strip": "topper"
    },
    {
        " to the Little Orphan Annie Sunday page called Private Life Of... The strip chose a common object each week like potatoes, hats and baseballs, and told their stories . That idea ran for two years, ending on Christmas Day, 42 A new three-panel gag strip about an elderly lady, Maw Green, began on January 42 42 and ran along the bottom of the Sunday page until 42      In 42 Punjab, a gigantic, sword-wielding, beturbaned Indian, was introduced to the strip and became one of its iconic characters. Whereas Annies adventures up to the point of Punjabs appearance were realistic and believable, her adventures following his introduction touched upon the supernatural, the cosmic, and the fantastic.      In November 42 Franklin Delano Roosevelt was elected President and proposed his New Deal. Many, including Gray, saw this and other programs as government interference in private enterprise. Gray railed against Roosevelt and his programs.  Annies life was complicated not only by thugs and gangsters but also by New Deal do-gooders and bureaucrats. Organized labor was feared by businessmen and Gray took their side. Some writers and editors took issue with this strips criticisms of FDRs New Deal and 42s labor unionism.  The New Republic  described Annie as ": null
    },
    {
        "Hooverism": "herbert hoover"
    },
    {
        " in the Funnies , arguing that Grays strip was defending utility company bosses then being investigated by the government.  The Herald Dispatch of ": null
    },
    {
        "Huntington, West Virginia": "huntington, west virginia"
    },
    {
        " stopped running Little Orphan Annie, printing a front page editorial rebuking Grays politics.  A subsequent New Republic editorial praised the papers move,  and  The Nation  likewise voiced its support.           In the late 42s, the strip had taken on a more adult and adventurous feel with Annie encountering killers, gangsters, spies, and saboteurs. It was about this time that Gray, whose politics seem to have been broadly ": null
    },
    {
        "conservative": "conservative"
    },
    {
        " and ": null
    },
    {
        "libertarian": "libertarianism"
    },
    {
        " with a decided ": null
    },
    {
        "populist": "populism"
    },
    {
        " streak, introduced some of his more controversial storylines. He would look into the darker aspects of human nature, such as greed and treachery. The gap between rich and poor was an important theme. His hostility toward ": null
    },
    {
        "labor union": "labor union"
    },
    {
        "s was dramatized in the 42 story Eonite . Other targets were the ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        ", ": null
    },
    {
        "communism": "communism"
    },
    {
        ", and corrupt businessmen.      Gray was especially critical of the justice system, which he saw as not doing enough to deal with criminals. Thus, some of his storylines featured people taking the law into their own hands. This happened as early as 42 in an adventure named The Haunted House . Annie is kidnapped by a gangster called Mister Mack. Warbucks rescues her and takes Mack and his gang into custody. He then contacts a local ": null
    },
    {
        "Senator": "us senator"
    },
    {
        " who owes him a favor. Warbucks persuades the politician to use his influence with the judge and make sure that the trial goes their way and that Mack and his men get their just deserts. Annie questions the use of such methods but concludes, With all th crooks usin pull an money to get off, I guess bout th only way to get em punished is for honest police like Daddy to use pull an money an gun-men, too, an beat them at their own game.     Warbucks became much more ruthless in later years. After catching yet another gang of Annie kidnappers he announced that he wouldnt think of troubling the police with you boys , implying that while he and Annie celebrated their reunion, the Asp and his men took the kidnappers away to be ": null
    },
    {
        "lynched": "lynching"
    },
    {
        ". In another Sunday strip, published during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", a war-profiteer expresses the hope that the conflict would last another 42 years. An outraged member of the public physically assaults the man for his opinion, claiming revenge for his two sons who have already been killed in the fighting. When a passing policeman is about to intervene, Annie talks him out of it, suggesting, Its better some times to let folks settle some questions by what you might call democratic processes.       As war clouds gathered, both the Chicago Tribune and the New York Daily News advocated neutrality; Daddy Warbucks, however, was gleefully manufacturing tanks, planes, and munitions. Journalist James Edward Vlamos deplored the loss of fantasy, innocence, and humor in the funnies , and took to task one of Grays sequences about espionage, noting that the fate of the nation rested on Annies frail shoulders . Vlamos advised readers to Stick to the saner world of war and horror on the front pages.     When the US entered ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Annie not only played her part by blowing up a German submarine but organized and led groups of children called the Junior Commandos in the collection of newspapers, scrap metal, and other recyclable materials for the war effort. Annie herself wore an armband emblazoned with JC and called herself Colonel Annie . In real life, the idea caught on, and schools and parents were encouraged to organize similar groups. Twenty thousand Junior Commandos were reportedly registered in Boston.     Gray was praised far and wide for his war effort brainchild.  Editor & Publisher  wrote,     Harold Gray, Little Orphan Annie creator, has done one of the biggest jobs to date for the scrap drive. His Junior Commando project, which he inaugurated some months ago, has caught on all around the country, and tons of scrap have been collected and contributed to the campaign. The kids sell the scrap, and the proceeds are turned into stamps and bonds.      Not all was rosy for Gray, however. He applied for extra gas coupons, reasoning that he would need them to drive about the countryside collecting plot material for the strip. But an ": null
    },
    {
        "Office of Price Administration": "office of price administration"
    },
    {
        " clerk named Flack refused to give Gray the coupons, explaining that cartoons were not vital to the war effort. Gray requested a hearing and the original decision was upheld. Gray was furious and vented in the strip, with especial venom directed at Flack , government price controls, and other concerns. Gray had his supporters, but Flacks neighbors defended him in the local newspaper and tongue-lashed Gray. Flack threatened to sue for libel, and some papers cancelled the strip. Gray showed no remorse, but did discontinue the sequence.     Gray was criticized by a Southern newspaper for including a black youngster among the white children in the Junior Commandos. Gray made it clear he was not a reformer, did not believe in breaking down the color line, and was no relation to ": null
    },
    {
        "Eleanor Roosevelt": "eleanor roosevelt"
    },
    {
        ", an ardent supporter of ": null
    },
    {
        "civil rights": "civil rights"
    },
    {
        ". He pointed out that Annie was a friend to all, and that most cities in the North had large dark towns . The inclusion of a black character in the Junior Commandos, he explained, was merely a casual gesture toward a very large block of readers. African American readers wrote letters to Gray thanking him for the incorporation of a black child in the strip.     In the summer of 42 ": null
    },
    {
        "Franklin Delano Roosevelt": "franklin delano roosevelt"
    },
    {
        " was nominated for a fourth term as President of the United States, and Gray killed off Warbucks in a month-long sequence of sentimental pathos. Readers were generally unhappy with Grays decision, but some liberals advocated the same fate for Annie and her stale philosophy . By the following November however, Annie was working as a maid in a Mrs. Bleating-Harts home and suffering all sorts of torments from her mistress. The public begged Gray to have mercy on Annie, and he had her framed for her mistresss murder. She was exonerated. Following Roosevelts death in April 42 Gray resurrected Warbucks and once again the billionaire began expounding the joys of ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        ".       In the post-war years, Annie took on The Bomb, communism, teenage rebellion and a host of other social and political concerns, often provoking the enmity of clergymen, union leaders and others. For example, Gray believed children should be allowed to work. A little work never hurt any kid, Gray affirmed, One of the reasons we have so much juvenile delinquency is that kids are forced by law to loaf around on street corners and get into trouble. His belief brought upon him the wrath of the labor movement, which staunchly supported the ": null
    },
    {
        "child labor laws": "child labor laws"
    },
    {
        ".     A London newspaper columnist thought some of Grays sequences a threat to world peace, but a Detroit newspaper supported Gray on his shoot first, ask questions later foreign policy. Gray was criticized for the gruesome violence in the strips, particularly a sequence in which Annie and Sandy were run over by a car. Gray responded to the criticism by giving Annie a year-long bout with amnesia that allowed her to trip through several adventures without Daddy. In 42 a sequence about juvenile delinquency, drug addiction, switchblades, prostitutes, crooked cops, and the ties between teens and adult gangsters unleashed a firestorm of criticism from unions, the clergy and intellectuals with 42 newspapers cancelling the strip. The syndicate ordered Gray to drop the sequence and develop another adventure.            Gray died in May 42 of cancer, and the strip was continued under other cartoonists. Grays cousin and assistant Robert Leffingwell was the first on the job but proved inadequate and the strip was handed over to Tribune staff artist Henry Arnold and general manager Henry Raduta as the search continued for a permanent replacement. ": null
    },
    {
        "Tex Blaisdell": "tex blaisdell"
    },
    {
        ", an experienced comics artist, got the job with ": null
    },
    {
        "Elliot Caplin": "elliot caplin"
    },
    {
        " as writer. Caplin avoided political themes and concentrated instead on character stories. The two worked together six years on the strip, but subscriptions fell off and both left at the end of 42 The strip was passed to others and during this time complaints were registered regarding Annies appearance, her conservative politics, and her lack of spunk. Early in 42 ": null
    },
    {
        "David Lettick": "david lettick"
    },
    {
        " took the strip, but his Annie was drawn in an entirely different and more cartoonish style, leading to reader complaints, and he left after only three months. In April 42 the decision was made to reprint Grays classic strips, beginning in 42 Subscriptions increased. The reprints ran from April 42 42 to December 42 42      Following the success of the ": null
    },
    {
        "Broadway musical": "broadway musical"
    },
    {
        "  Annie , the strip was resurrected on December 42 42 as Annie, written and drawn by ": null
    },
    {
        "Leonard Starr": "leonard starr"
    },
    {
        ". Starr, the creator of  Mary Perkins, On Stage , was the only one besides Gray to achieve notable success with the strip.     Starrs last strip ran on February 42 42 and the strip went into reprints again for several months. Starr was succeeded by  Daily News  writer Jay Maeder and artist ": null
    },
    {
        "Andrew Pepoy": "andrew pepoy"
    },
    {
        ", beginning Monday, June 42 42 Pepoy was eventually succeeded by ": null
    },
    {
        "Alan Kupperberg": "alan kupperberg"
    },
    {
        " and ": null
    },
    {
        "Ted Slampyak": "ted slampyak"
    },
    {
        " . The new creators updated the strips settings and characters for a modern audience, giving Annie a new hairdo and jeans rather than her trademark dress. However, Maeders new stories never managed to live up to the pathos and emotional engagement of the stories by Gray and Starr. Annie herself was often reduced to a supporting role, and was a far less complex character than the girl readers had known for seven decades. Maeders writing style tended to make the stories feel like tongue-in-cheek adventures compared to the serious, heartfelt tales Gray and Starr favored. Annie gradually lost subscribers during the 42s, and by 42 it was running in fewer than 42 U.S. newspapers.       On May 42 42 Tribune Media Services announced that the strips final installment would appear on Sunday, June 42 42 ending after 42 years.  At the time of the cancellation announcement, it was running in fewer than 42 newspapers, some of which, such as the New York Daily News, had carried the strip for its entire life. The final cartoonist, ": null
    },
    {
        "Ted Slampyak": "ted slampyak"
    },
    {
        ", said, Its kind of painful. Its almost like mourning the loss of a friend.      The last strip was the culmination of a story arc where Annie was kidnapped from her hotel by a wanted war criminal from eastern Europe who checked in under a phony name with a fake passport. Although Warbucks enlists the help of the FBI and Interpol to find her, by the end of the final strip he has begun to resign himself to the very strong possibility that Annie most likely will not be found alive. Unfortunately, Warbucks is unaware that Annie is still alive and has made her way to Guatemala with her captor, known simply as the Butcher of the Balkans . Although Annie wants to be let go, the Butcher tells her that he neither will let her go nor kill her—for fear of being captured and because he will not kill a child despite his many political killings—and adds that she has a new life now with him. The final panel of the strip reads And this is where we leave our Annie. For Now— .     Since the cancellation, rerun strips have been running on the GoComics site.       In 42 the team behind  Dick Tracy  began a story line that would permanently resolve the fate of Annie. The week of June 42 42 featured several Annie characters in extended cameos complete with dialogue, including Warbucks, the Asp and Punjab. On June 42 Warbucks implies that Annie is still missing and that he might even enlist Tracys help in finding her.  Asp and Punjab appeared again in March 42 42 The caption says that these events will soon impact on the detective.      The storyline resumed on June 42 42 with Warbucks asking for Tracys assistance in finding Annie.  In the course of the story, Tracy receives a letter from Annie and determines her location. Meanwhile, the name of the kidnapper is revealed as Henrik Wilemse, and he has been tracked to the city where he is found and made to disappear. Tracy and Warbucks rescued Annie, and the storyline wrapped up on October 42      Annie again visited Dick Tracy, visiting his granddaughter Honeymoon Tracy, starting June 42 42  This arc concluded Sept. 42 42 with Dick Tracy sending the girls home from a crime scene to keep them out of the news.     A third appearance of Annie and her supporting cast in Dick Tracys strip began in May 42 42 and involves both B-B Eyes murder and doubts about the fate of Trixie.  The arc also establishes that Warbucks has formally adopted Annie, as opposed to being just his ward.             Little Orphan Annie  was adapted to a 42-minute radio show that debuted on ": null
    },
    {
        "WGN": "wgn"
    },
    {
        " Chicago in 42 and went national on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        "s ": null
    },
    {
        "Blue Network": "blue network"
    },
    {
        " beginning April 42 42 The show was one of the first comic strips adapted to radio, attracted about 42 million fans, and left the air in 42  Radio historian ": null
    },
    {
        "Jim Harmon": "jim harmon"
    },
    {
        " attributes the shows popularity in The Great Radio Heroes to the fact that it was the only radio show to deal with and appeal to young children.           Two film adaptations were released at the height of Annies popularity in the 42s.  Little Orphan Annie , the first adaptation, was produced by ": null
    },
    {
        "David O. Selznick": "david o. selznick"
    },
    {
        " for ": null
    },
    {
        "RKO": "rko"
    },
    {
        " in 42 and starred ": null
    },
    {
        "Mitzi Green": "mitzi green"
    },
    {
        " as Annie. The plot was simple: Warbucks leaves on business and Annie finds herself in the orphanage again. She pals around with a little boy named Mickey, and when he is adopted by a wealthy woman, she visits him in his new home. Warbucks returns and holds a Christmas party for all. The film opened on Christmas Eve 42  Variety  panned it, and the New York Daily News was slightly disappointed with the film, thinking Green too big and buxom for the role. ": null
    },
    {
        "Paramount": "paramount pictures"
    },
    {
        " brought Ann Gillis to the role of Annie in their ": null
    },
    {
        "42 film adaptation": "little orphan annie"
    },
    {
        ", but this version was panned as well. One reviewer thought it stupid and thoroughly boresome and was uncomfortable with the sugar-coated Pollyanna characterization given Annie.     Three years after the RKO release, Gray wrote a sequence for the strip that sent Annie to Hollywood. She is hired at low wages to play the stand-in and stunt double for the bratty child star Tootsie McSnoots. Young starlet Janey Spangles tips off Annie to the corrupt practices in Hollywood. Annie handles the information with maturity and has a good time with Janey while doing her job on the set. Annie doesnt become a star. As Bruce Smith remarks in The History of Little Orphan Annie, Gray was smart enough never to let get too successful.        In 42 Little Orphan Annie was adapted to the ": null
    },
    {
        "Broadway stage": "musical theater"
    },
    {
        " as  Annie . With music by ": null
    },
    {
        "Charles Strouse": "charles strouse"
    },
    {
        ", lyrics by ": null
    },
    {
        "Martin Charnin": "martin charnin"
    },
    {
        " and book by ": null
    },
    {
        "Thomas Meehan": "thomas meehan"
    },
    {
        ", the original production ran from April 42 42 to January 42 42 The work has been staged internationally. The musical took considerable liberties with the original comic strip plot.     The ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " Annies were ": null
    },
    {
        "Andrea McArdle": "andrea mcardle"
    },
    {
        ", ": null
    },
    {
        "Shelly Bruce": "shelly bruce"
    },
    {
        ", ": null
    },
    {
        "Sarah Jessica Parker": "sarah jessica parker"
    },
    {
        ", ": null
    },
    {
        "Allison Smith": "allison smith"
    },
    {
        " and Alyson Kirk. Actresses who portrayed Miss Hannigan are ": null
    },
    {
        "Dorothy Loudon": "dorothy loudon"
    },
    {
        ", ": null
    },
    {
        "Alice Ghostley": "alice ghostley"
    },
    {
        ", ": null
    },
    {
        "Betty Hutton": "betty hutton"
    },
    {
        ", ": null
    },
    {
        "Ruth Kobart": "ruth kobart"
    },
    {
        ", ": null
    },
    {
        "Marcia Lewis": "marcia lewis"
    },
    {
        ", ": null
    },
    {
        "June Havoc": "june havoc"
    },
    {
        ", ": null
    },
    {
        "Nell Carter": "nell carter"
    },
    {
        " and ": null
    },
    {
        "Sally Struthers": "sally struthers"
    },
    {
        ". Songs from the musical include ": null
    },
    {
        "Tomorrow": "tomorrow"
    },
    {
        " and Its the Hard Knock Life . There is also a childrens version of Annie called Annie Junior. Two sequels to the musical, Annie 42: Miss Hannigans Revenge and  Annie Warbucks  , were written by the same creative team; neither show opened on Broadway. There were also many bus & truck tours of Little Orphan Annie throughout the United States during the success of the Broadway Shows.       In addition to the two Annie films of the 42s, there have been three film adaptations of the Broadway play. All have the same title. They are  Annie  ,  Annie  and  Annie  .     The 42 version was directed by ": null
    },
    {
        "John Huston": "john huston"
    },
    {
        " and starred ": null
    },
    {
        "Aileen Quinn": "aileen quinn"
    },
    {
        " as Annie, ": null
    },
    {
        "Albert Finney": "albert finney"
    },
    {
        " as Warbucks, ": null
    },
    {
        "Ann Reinking": "ann reinking"
    },
    {
        " as his secretary Grace Farrell, and ": null
    },
    {
        "Carol Burnett": "carol burnett"
    },
    {
        " as Miss Hannigan. The film departed from the Broadway production in several respects, most notably changing the climax of the story from Christmas to the Fourth of July. It also featured five new songs, Dumb Dog , Sandy , Lets Go to the Movies , Sign , and We Got Annie , while cutting Wed like to Thank You, Herbert Hoover , N.Y.C , You Wont Be an Orphan for Long , Something Was Missing , Annie , and New Deal for Christmas . It received mixed critical reviews and, while becoming the 42th highest-grossing film of 42 barely recouped its $42 million budget.     A direct-to-video film,  Annie: A Royal Adventure!  was released in 42 as a sequel to the 42 film. It features ": null
    },
    {
        "Ashley Johnson": "ashley johnson"
    },
    {
        " as Annie and focuses on the adventures of Annie and her friends Hannah and Molly. It is set in England in 42 about 42 years after the first film, when Annie and her friends Hannah and Molly sail to England after Daddy Warbucks is invited to receive a knighthood. None of the original 42 cast appear and the film features no musical numbers apart from a reprise of Tomorrow .     The 42 television film was produced for  The Wonderful World of Disney . It starred ": null
    },
    {
        "Victor Garber": "victor garber"
    },
    {
        ", ": null
    },
    {
        "Alan Cumming": "alan cumming"
    },
    {
        ", ": null
    },
    {
        "Audra McDonald": "audra mcdonald"
    },
    {
        " and ": null
    },
    {
        "Kristin Chenoweth": "kristin chenoweth"
    },
    {
        ", with Oscar winner ": null
    },
    {
        "Kathy Bates": "kathy bates"
    },
    {
        " as Miss Hannigan and newcomer ": null
    },
    {
        "Alicia Morton": "alicia morton"
    },
    {
        " as Annie. While its plot stuck closer to the original Broadway production, it also omitted Wed Like to Thank You, Herbert Hoover , Annie , New Deal for Christmas , and a reprise of Tomorrow. Generally favorably received, the production earned two ": null
    },
    {
        "Emmy Awards": "emmy awards"
    },
    {
        " and ": null
    },
    {
        "George Foster Peabody Award": "george foster peabody award"
    },
    {
        ".     The 42 film  Annie  was produced by ": null
    },
    {
        "Jay-Z": "jay-z"
    },
    {
        " and ": null
    },
    {
        "Will Smith": "will smith"
    },
    {
        ". It starred ": null
    },
    {
        "Quvenzhané Wallis": "quvenzhané wallis"
    },
    {
        " in the title role and ": null
    },
    {
        "Jamie Foxx": "jamie foxx"
    },
    {
        " in the role of Will Stacks . It was released on December 42 42       Between 42 and October 42 42 the comic strip ": null
    },
    {
        "Belinda Blue-Eyes": "belinda"
    },
    {
        "  ran in the United Kingdom in the  Daily Mirror . Writers Bill Connor and Don Freeman and artists Stephen Dowling and Tony Royle all worked on the strip over the years. In The Penguin Book of Comics Belinda is described as a perpetual waif, a British counterpart to the transatlantic Little Orphan Annie.       The strip also influenced  Little Annie Rooney  and  Frankie Doodle  .     In 42 Little Orphan Annie was one of 42 American comic strips included in the ": null
    },
    {
        "Comic Strip Classics": "comic strip classics"
    },
    {
        " series of commemorative U.S. postage stamps.     Little Orphan Annie lent itself easily to parody, which was taken up by both ": null
    },
    {
        "Walt Kelly": "walt kelly"
    },
    {
        " in  Pogo  and by ": null
    },
    {
        "Al Capp": "al capp"
    },
    {
        " in  Lil Abner , where Punjab became Punjbag, an oleaginous slob.     ": null
    },
    {
        "Harvey Kurtzman": "harvey kurtzman"
    },
    {
        " and ": null
    },
    {
        "Wally Wood": "wally wood"
    },
    {
        " satirized the strip in  Mad  42 as Little Orphan Melvin , and later Kurtzman produced a long-running series for  Playboy ,  Little Annie Fanny , in which the lead character is a busty, voluptuous waif who continually loses her clothes and falls into strange sexual situations.     In  The Fabulous Furry Freak Brothers , ": null
    },
    {
        "Gilbert Shelton": "gilbert shelton"
    },
    {
        " satirized the strip as Little Orphan Amphetamine , who is a 42s teenager who runs away from home, and after being scarred by a series of sexual experiences, returns only to tell Daddy that he is a ": null
    },
    {
        "capitalist": "capitalism"
    },
    {
        " pig who should drop ": null
    },
    {
        "acid": "lsd"
    },
    {
        " .     Childrens television host ": null
    },
    {
        "Chuck McCann": "chuck mccann"
    },
    {
        " became well known in the New York/New Jersey market for his imitations of newspaper comic characters; McCann put blank white circles over his eyes during his over-the-top impression of Annie.     Little Orphan Annie was also parodied in an episode of the ": null
    },
    {
        "stop-motion": "stop motion"
    },
    {
        " television series": "television program"
    },
    {
        "  Robot Chicken  in which Little Orphan Annie fails to grasp the true meaning of a hard knock life when a fellow orphan shows that their lives are relatively decent compared to orphans around the world. Annie reappears in another episode as a vulgar, demanding, and spoiled teenager featured in a parodic documentary chronicling her preparations for her ostentatious upcoming sixteenth birthday celebration in a sketch lampooning reality programs based on the same concept. She quickly tires of her gift from Daddy Warbucks— the planet Mars— and soon winds up suffocating to death after losing her helmet while exploring the planet.     The 42s childrens ": null
    },
    {
        "television program": "list of television programs"
    },
    {
        "  You Cant Do That on Television  in its later banned Adoption episode, parodied the character as Little Orphan Andrea . Andrea, like Annie, sported curly red hair and a red dress but unlike her, was a very naughty orphan who had a habit of beating up other kids. A less well-known example was the Daddy Fleshbucks side-story from  American Flagg! . The title was parodied in  The Simpsons episode Little Orphan Millie . In the early 42s, a flavored ice treat for children called Otter Pops featured a character dubbed Little Orphan Orange.     In the 42 film A Christmas Story , the main character Ralph is a fan of the Little Orphan Annie radio drama, listening to the show religiously while waiting for his Ovaltine decoder pin. Once he receives the pin, he anxiously copies the shows secret code, but is frustrated upon decoding it to Ovaltines slogan, Be sure to drink your Ovaltine. This makes him grumble, A crummy commercial!      Rapper Jay-Z has referenced Little Orphan Annie in at least two of his songs, as well as sampling Its the Hard Knock Life for Hard Knock Life .     In the film Bad Teacher , Elizabeth wears a Little Orphan Annies wig when, pretending she is a journalist, she meets the state professor who is in charge of creating and distributing the exams forms, to seduce and put him to sleep. Her short tousled girlish hair-cut, along with the strict tailor-suit she dons, enhances her air of hidden perversion and makes it easy for her to put the professor on his knees. The wig is afterward missing from the school props box, and was much sought, before being retrieved in Elizabeths drawer.     Starting in 42 gingerlock comedian Michelle Wolf appeared on numerous segments on Late Night as her fictional persona, Grown-Up Annie , an adult version of Little Orphan Annie.     In medicine, Orphan Annie eye nuclei are a characteristic histological finding in papillary carcinoma of the thyroid gland .       Harold Grays work is in the Howard Gotlieb Archival Research Center at Boston University . The Gray collection includes artwork, printed material, correspondence, manuscripts and photographs. Grays original pen and ink drawings for Little Orphan Annie daily strips date from 42 to 42 The Sunday strips date from 42 to 42 Printed material in the collection includes numerous proofs of Little Orphan Annie daily and Sunday strips . Most of these are in bound volumes. There are proofsheets of Little Orphan Annie daily strips from the Chicago Tribune-New York Times Syndicate, Inc. for the dates 42 42–42 and 42–42 as well as originals and photocopies of the printed versions of Little Orphan Annie, both daily and Sunday strips.       42: From Rags to Riches ; Just a Couple of Hurried Bites   42: The Silos; Count De Tour   42: School of Hard Knocks; Under the Big Top; Will Tomorrow Never Come?   42: The Blue Bell of Happiness; Haunted House; Other Peoples Troubles   42: Sherlock, Jr.; Mush and Milk; Just Before the Dawn   42: Farm Relief; Girl Next Door; One Blunder After Another   42: Seven Year Itch; The Frame, the Farm & the Flood; Shipwrecked   42: Busted!; Good Neighbor Policy; Down, But Not Out; And a Blind Man Shall Lead Them; Distant Relations; A Hundred to One   42: Dont Mess with Cupid; They Call Her Big Mama; A House Divided; Cosmic City   42: Pinching Pennies; Retribution; Whod Chizzle a Blind Man?   42: Bleek House; Phil O. Blustered; The One-Way Road to Justice; Dust Yourself Off   42: Punjab the Wizard; Beware the Hate Mongers; Annie in Hollywood   42: Inkey; On the Lam; The Sole of the Matter; The Gila Story; Those Who are About to Die   42: The Million-Dollar Voice; The Omnipotent Mr. Am; Into the Fourth Dimension; Easy Money   42: A Rose, per Chance; The Last Port of Call; Men in Black   42: At Home on the Range; Assault on the Hacienda; Three Face East; Justice at Play   42: In the Nick of Time; Billy the Kid; Peg O their Hearts   42: The Happy Warrior; Saints and Cynics; Never Trouble Trouble; On Needles and Pins   42: The Junior Commandos; Out on a Limb   42: The Rat Trap, Next Stop—Gooneyville   42: In a Den of Thieves, Death be Thy Name, Mrs. Bleating-Heart   42: Ivan the Terrible, The Town Called Fiasco, Circumstantial Evidence   42: Open Season for Trouble       Between 42–42 Cupples & Leon published nine collections of Annie strips:   Little Orphan Annie   In the Circus   Haunted House   Bucking the World    Never Say Die   Shipwrecked   A Willing Helper   In Cosmic City   Uncle Dan   Arf: The Life and Hard Times of Little Orphan Annie : reprints approximately half the daily strip s from 4242 However, many of the storylines are edited and shortened, with gaps of several months between some strips.   Dover Publications reprinted two of the Cupples & Leon books and an original collection Little Orphan Annie in the Great Depression which contains all the daily strips from January to September, 42   Pacific Comics Club has reprinted eight of the Cupples & Leon books. They have also published a new series of reprints, with complete runs of daily strip, in the same format at the C & L books, covering some of the daily strips from 42 to 42:   The Sentence, 42 strips   The Dreamer, strips from January 42 42 to April 42 42   Daddy, strips from September 42 42 to December 42 42   The Hobo, strips from December 42 42 to March 42 42   Rich Man, Poor Man, strips from March 42 42 to May 42 42   The Little Worker, strips from October 42 42 to December 42 42   The Business of Giving, strips from November 42 42 to March 42 42   This Surprising World, strips from March 42 42 to June 42 42   The Pro and the Con, strips from June 42 42 to September 42 42   The Man of Mystery, strips from September 42 42 to December 42 42     Considering both Cupples & Leon and Pacific Comics Club, the biggest gap is in 42     All of the daily and Sunday strips from 42–42 were reprinted by Fantagraphics in the 42s, in five volumes, each covering a year, from 42 to 42   Picking up where Fantagraphics left off, ": null
    },
    {
        "Comics Revue": "comics revue"
    },
    {
        " magazine reprinted both daily and Sunday strips from 42 to 42 starting in Comics Revue 42 and ending in 42   Pacific Comics Club reprinted approximately the first six months of the strips from Comics Revue, under the title Home at Last, December 42 42 to April 42 42   Dragon Lady Press reprinted daily and Sunday strips from September 42 42 to February 42 42     In 42 IDW Publishing started a reprint series titled, ": null
    },
    {
        "The Complete Little Orphan Annie": "the complete little orphan annie"
    }
]