[
    {
        "           Titus Livius  – simply rendered as Livy  in ": null
    },
    {
        "English": "english language"
    },
    {
        " – was a ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " historian. He wrote a monumental history of ": null
    },
    {
        "Rome": "rome"
    },
    {
        " and the Roman people –  Ab Urbe Condita Libri   – covering the period from the earliest legends of Rome before the traditional foundation in 753 BC through the reign of ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        " in Livys own lifetime. He was on familiar terms with members of the ": null
    },
    {
        "Julio-Claudian dynasty": "julio-claudian dynasty"
    },
    {
        " and even in friendship with Augustus,  whose young grandnephew, the future emperor ": null
    },
    {
        "Claudius": "claudius"
    },
    {
        ", he exhorted to take up the writing of history.        Livy was born in Patavium in northern ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", now modern ": null
    },
    {
        "Padua": "padua"
    },
    {
        ". There is a debate about the year of his birth – either in 64 BC, or more likely, in 59 BC .  At the time of his birth, his home city of Patavium was the second wealthiest on the Italian peninsula, and the largest in the province of ": null
    },
    {
        "Cisalpine Gaul": "cisalpine gaul"
    },
    {
        ". Cisalpine Gaul was merged in ": null
    },
    {
        "Italia": "roman italy"
    },
    {
        " during his lifetime and its inhabitants were given Roman citizenship by Julius Caesar. In his works, Livy often expressed his deep affection and pride for Patavium, and the city was well known for its conservative values in ": null
    },
    {
        "morality": "morality"
    },
    {
        " and politics. He was by nature a recluse, mild in temperament and averse to violence; the restorative peace of his time gave him the opportunity to turn all his imaginative passion to the legendary and historical past of the country he loved.      Livys teenage years were during the 40s BC, when a period of ": null
    },
    {
        "numerous civil wars throughout the Roman world": "roman civil wars"
    },
    {
        " occurred. The governor of Cisalpine Gaul at the time, ": null
    },
    {
        "Asinius Pollio": "gaius asinius pollio"
    },
    {
        ", tried to sway Patavium into supporting ": null
    },
    {
        "Marcus Antonius ": "mark antony"
    },
    {
        ", the leader of one of the warring factions. The wealthy citizens of Patavium refused to contribute money and arms to Asinius Pollio, and went into hiding. Pollio then attempted to bribe the slaves of those wealthy citizens to expose the whereabouts of their masters; his bribery did not work, and the citizens instead pledged their allegiance to the ": null
    },
    {
        "Senate": "roman senate"
    },
    {
        ". It is therefore likely that the Roman civil wars prevented Livy from pursuing a higher education in Rome or going on a tour of ": null
    },
    {
        "Greece": "greece"
    },
    {
        ", which was common for adolescent males of the nobility at the time. Many years later, Asinius Pollio derisively commented on Livys patavinity , saying that Livys Latin showed certain provincialisms frowned on at Rome. Pollios dig may have been the result of bad feelings he harboured toward the city of Patavium from his experiences there during the civil wars.     Livy probably went to Rome in the 30s BC  , and it is likely that he spent a large amount of time in the city after this, although it may not have been his primary home. During his time in Rome, he was never a senator nor held a government position. His writings contain elementary mistakes on military matters, indicating that he probably never served in the ": null
    },
    {
        "Roman army": "roman army"
    },
    {
        ". However, he was educated in philosophy and rhetoric. It seems that Livy had the financial resources and means to live an independent life, though the origin of that wealth is unknown. He devoted a large part of his life to his writings, which he was able to do because of his financial freedom.     Livy was known to give recitations to small audiences, but he was not heard of to engage in ": null
    },
    {
        "declamation": "declamation"
    },
    {
        ", then a common pastime. He was familiar with the emperor ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        " and the imperial family. Augustus was considered by later Romans to have been the greatest Roman emperor, benefiting Livys reputation long after his death. ": null
    },
    {
        "Suetonius": "suetonius"
    },
    {
        " described how Livy encouraged the future emperor ": null
    },
    {
        "Claudius": "claudius"
    },
    {
        ", who was born in 10 BC, to write historiographical works during his childhood. .     Livys most famous work was his history of ": null
    },
    {
        "Rome": "rome"
    },
    {
        ". In it he narrates a complete history of the city of Rome, from its foundation to the death of Augustus. Because he was writing under the reign of Augustus, Livys history emphasizes the great triumphs of Rome. . He wrote his history with embellished accounts of Roman heroism in order to promote the new type of government implemented by Augustus when he became emperor. . In Livys preface to his history, he said that he did not care whether his personal fame remained in darkness, as long as his work helped to preserve the memory of the deeds of the world’s preeminent nation . . Because Livy was mostly writing about events that had occurred hundreds of years earlier, the historical value of his work was questionable, although many Romans came to believe his account to be true. .     Livy was married and had at least one daughter and one son. He also produced other works, including an essay in the form of a letter to his son, and numerous dialogues, most likely modelled on similar works by ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        ".     Titus Livius died in his home city of Patavium in either  AD 12 or 17; the latter would have been three years after the death of the emperor Augustus.             Livys only surviving work is the History of Rome , which was his career from his mid-life, probably 32, until he left ": null
    },
    {
        "Rome": "rome"
    },
    {
        " for ": null
    },
    {
        "Padua": "padua"
    },
    {
        " in old age, probably in the reign of ": null
    },
    {
        "Tiberius": "tiberius"
    },
    {
        " after the death of Augustus. When he began this work he was already past his youth; presumably, events in his life prior to that time had led to his intense activity as a historian. ": null
    },
    {
        "Seneca the Younger": "seneca the younger"
    },
    {
        " gives brief mention that he was also known as an orator and philosopher and had written some treatises in those fields from a historical point of view.  .           Livys  History of Rome  was in high demand from the time it was published and remained so during the early years of the empire. ": null
    },
    {
        "Pliny the Younger": "pliny the younger"
    },
    {
        " reported that Livys celebrity was so widespread, a man from ": null
    },
    {
        "Cadiz": "cadiz"
    },
    {
        " travelled to Rome and back for the sole purpose of meeting him.  Livys work was a source for the later works of ": null
    },
    {
        "Aurelius Victor": "aurelius victor"
    },
    {
        ", ": null
    },
    {
        "Cassiodorus": "cassiodorus"
    },
    {
        ", ": null
    },
    {
        "Eutropius": "eutropius"
    },
    {
        ", ": null
    },
    {
        "Festus": "festus"
    },
    {
        ", ": null
    },
    {
        "Florus": "florus"
    },
    {
        ", ": null
    },
    {
        "Granius Licinianus": "granius licinianus"
    },
    {
        " and ": null
    },
    {
        "Orosius": "paulus orosius"
    },
    {
        ". ": null
    },
    {
        "Julius Obsequens": "julius obsequens"
    },
    {
        " used Livy, or a source with access to Livy, to compose his De Prodigiis, an account of ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        " events in Rome from the consulship of ": null
    },
    {
        "Scipio": "lucius cornelius scipio asiaticus"
    },
    {
        " and ": null
    },
    {
        "Laelius": "gaius laelius"
    },
    {
        " to that of Paulus Fabius and Quintus Aelius.     Livy wrote during the reign of Augustus, who came to power after a civil war with generals and consuls claiming to be defending the ": null
    },
    {
        "Roman Republic": "roman republic"
    },
    {
        ", such as ": null
    },
    {
        "Pompey": "pompey"
    },
    {
        ". Patavium had been pro-Pompey. To clarify his status, the victor of the civil war, ": null
    },
    {
        "Octavian Caesar": "octavian caesar"
    },
    {
        ", had wanted to take the title  Romulus  but in the end accepted the senate proposal of Augustus. Rather than abolishing the republic, he adapted it and its institutions to imperial rule.     The historian ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        ", writing about a century after Livys time, described the Emperor Augustus as his friend. Describing the trial of ": null
    },
    {
        "Cremutius Cordus": "aulus cremutius cordus"
    },
    {
        ", Tacitus represents him as defending himself face-to-face with the frowning Tiberius as follows:          Livys reasons for returning to ": null
    },
    {
        "Padua": "padua"
    },
    {
        " after the death of Augustus are unclear, but the circumstances of ": null
    },
    {
        "Tiberius": "tiberius"
    },
    {
        " reign certainly allow for speculation.          During the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", interest in Livy declined because Western scholars were more focused on religious texts. Due to the length of the work, the literate class was already reading summaries rather than the work itself, which was tedious to copy, expensive, and required a lot of storage space. It must have been during this period, if not before, that manuscripts began to be lost without replacement.     The ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " was a time of intense revival; the population discovered that Livys work was being lost and large amounts of money changed hands in the rush to collect Livian manuscripts. The poet ": null
    },
    {
        "Beccadelli": "beccadelli"
    },
    {
        " sold a country home for funding to purchase one manuscript copied by ": null
    },
    {
        "Poggio": "gian francesco poggio bracciolini"
    },
    {
        ". ": null
    },
    {
        "Petrarch": "petrarch"
    },
    {
        " and ": null
    },
    {
        "Pope Nicholas V": "pope nicholas v"
    },
    {
        " launched a search for the now missing books. ": null
    },
    {
        "Laurentius Valla": "laurentius valla"
    },
    {
        " published an amended text initiating the field of Livy scholarship. ": null
    },
    {
        "Dante": "dante"
    },
    {
        " speaks highly of him in his poetry, and ": null
    },
    {
        "Francis I of France": "francis i of france"
    },
    {
        " commissioned extensive artwork treating Livian themes; ": null
    },
    {
        "Niccolò Machiavellis": "niccolò machiavelli"
    },
    {
        "work on ": null
    },
    {
        "republic": "republic"
    },
    {
        "s, the  Discourses on Livy  is presented as a commentary on the History of Rome. Respect for Livy rose to lofty heights. ": null
    },
    {
        "Walter Scott": "walter scott"
    },
    {
        " reports in ": null
    },
    {
        "Waverley": "waverley"
    },
    {
        " as an historical fact that a Scotchman involved in the first Jacobite uprising of 1715 was recaptured because, having escaped, he yet lingered near the place of his captivity in the hope of recovering his favorite Titus Livius.      Modern historians have developed their own views of Livy and his place in the ancient world, which were not current in ancient times. For example, one text on Western civilization pronounces: Livy was the prose counterpart of ": null
    },
    {
        "Vergil": "virgil"
    },
    {
        ", as both have been standard in the study of ": null
    },
    {
        "Golden Age": "golden age"
    },
    {
        " Latin": "latin"
    },
    {
        " literature.  Golden Age Latin was not known as such in classical times and the ancient reader could choose from a vastly larger bibliography; but, in fact, private reading was a privilege of the literate few, who had the wealth to buy manuscripts or have them copied and had the time for library research. Public readings of works, however, were common and the usual method in which an author became known.       Livy was likely born between 64 and 59 B.C. and died sometime between A.D. 12 to 17. He started his work sometime between 31 B.C. and 25 B.C. ": null
    },
    {
        "St. Jerome": "st. jerome"
    },
    {
        " says that Livy was born the same year as ": null
    },
    {
        "Marcus Valerius Messala Corvinus": "marcus valerius messala corvinus"
    },
    {
        " and died the same year as ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        ". Messala, however, was born earlier, in 64 BC, and Ovids death, usually taken to be the same year as Livys, is more uncertain. As an alternative view, ": null
    },
    {
        "Ronald Syme": "ronald syme"
    },
    {
        " argues for 64 BC – 12 AD as a range for Livy, setting the death of Ovid at 12.  A death date of 12, however, removes Livy from Augustus best years and makes him depart for Padua without the good reason of the second emperor, ": null
    },
    {
        "Tiberius": "tiberius"
    },
    {
        ", being not as tolerant of his republicanism. The contradiction remains.     The authority supplying information from which possible vital data on Livy can be deduced is ": null
    },
    {
        "Eusebius of Caesarea": "eusebius of caesarea"
    },
    {
        ", a ": null
    },
    {
        "bishop": "bishop"
    },
    {
        " of the early ": null
    },
    {
        "Christian Church": "christian church"
    },
    {
        ". One of his works was a summary of world history in ": null
    },
    {
        "ancient Greek": "ancient greek"
    },
    {
        ", termed the  Chronikon , dating from the early 4th century AD. This work was lost except for fragments , but not before it had been translated in whole and in part by various authors such as ": null
    },
    {
        "St. Jerome": "st. jerome"
    },
    {
        ". The entire work survives in two separate manuscripts, ": null
    },
    {
        "Armenian": "armenian language"
    },
    {
        " and Greek . St. Jerome wrote in Latin. Fragments in ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " exist.     ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        " work consists of two books: the  Chronographia , a summary of history in annalist form, and the Chronikoi Kanones, tables of years and events. St. Jerome translated the tables into Latin as the  Chronicon , probably adding some information of his own from unknown sources. Livys dates appear in Jeromes Chronicon.     The main problem with the information given in the ": null
    },
    {
        "manuscripts": "manuscript"
    },
    {
        "is that, between them, they often give different dates for the same events or different events, do not include the same material entirely, and reformat what they do include. A date may be in Ab Urbe Condita or in ": null
    },
    {
        "Olympiads": "olympiad"
    },
    {
        "or in some other form, such as age. These variations may have occurred through scribal error or scribal license. Some material has been inserted under the aegis of ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        ".     The topic of manuscript variants is a large and specialized one, on which authors of works on Livy seldom care to linger. As a result, standard information in a standard rendition is used, which gives the impression of a standard set of dates for Livy. There are no such dates. A typical presumption is of a birth in the 2nd year of the 180th Olympiad and a death in the first year of the 199th Olympiad, which are coded 180.2 and 199.1 respectively.  All sources use the same first ": null
    },
    {
        "Olympiad": "olympiad"
    },
    {
        ", 776/775–773/772 BC by the modern calendar. By a complex formula , these codes correspond to 59 BC for the birth, 17 AD for the death. In another manuscript the birth is in 180.4, or 57 BC.        ": null
    }
]