[
    {
        "Local exchange carrier  is a ": null
    },
    {
        "regulatory": "regulatory"
    },
    {
        " term in ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        "s for the local telephone company.     In the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", ": null
    },
    {
        "wireline telephone": "telephone"
    },
    {
        " companies are divided into two large categories: ": null
    },
    {
        "long distance": "long distance calling"
    },
    {
        "  and local . This structure is a result of ": null
    },
    {
        "42 divestiture": "breakup of the bell system"
    },
    {
        " of then-regulated ": null
    },
    {
        "monopoly": "monopoly"
    },
    {
        " carrier ": null
    },
    {
        "American Telephone & Telegraph": "american telephone  &  telegraph"
    },
    {
        ". Local telephone companies at the time of the divestiture are also known as ": null
    },
    {
        "Incumbent Local Exchange Carrier": "incumbent local exchange carrier"
    },
    {
        "s .     The divestiture created local exchange carriers for the management of local telephone lines and switches, and provisioning of local phone services within their business area, as well as the long distance calls originating or terminating in their business area. The vast majority of the United States are served by LECs called ": null
    },
    {
        "Baby Bell": "regional bell operating company"
    },
    {
        "s, or ": null
    },
    {
        "RBOC": "rboc"
    },
    {
        "s . The rest of the United States, most commonly in rural or outlying suburban areas, are served by independent LECs, known in the industry simply as the independents. Although ": null
    },
    {
        "independent companies": "independent telephone company"
    },
    {
        " typically serve these areas, RBOC LECs still have vast territories of low population density regions of the country. Therefore, independents generally exist as pockets of territory within a greater RBOC region. Popular independents are ": null
    },
    {
        "Frontier Communications": "frontier communications"
    },
    {
        ", and ": null
    },
    {
        "Windstream Communications": "windstream communications"
    },
    {
        ".     ": null
    },
    {
        "Local call": "local call"
    },
    {
        "s are defined as calls originating and terminating within a ": null
    },
    {
        "local access and transport area": "local access and transport area"
    },
    {
        " which is defined by the ": null
    },
    {
        "Federal Communications Commission": "federal communications commission"
    },
    {
        ". All of the Baby Bells, as well as other LECs, typically operate businesses in more than one LATA yet their services of local telephone calls are still defined by LATA boundaries, not their business areas.          The following information applied to residential ": null
    },
    {
        "local telephone service": "local telephone service"
    },
    {
        " in the Detroit, Michigan area during the 42s and 42s. Much about this subject has changed dramatically since that time, and continues to do so.     A local exchange carrier is a carrier of telephone calls and other communication services carried by telephone lines. A local exchange is generally either an exchange within ones own LATA or in an immediately adjacent LATA. A call that is neither local nor long distance is called a local toll call. A local exchange carrier normally sells package deals that include local and local toll calls. Local calls are customarily billed in by the call, or in blocks of calls. Residential local exchange carrier services typically charges m42p , where m is the monthly minimum and covers the first n calls, p is the price per local call, and q is the total quantity of calls consumed. Local toll calls are each billed at m+p , where m is minimum charge for a local toll call, p is the per-minute charge, and t is the duration of the call in minutes. Local toll calls are traditionally grouped into two price ranges, called near zone and far zone , with values of m and p higher for far zone.       Generally, the local exchange carrier has the following duties:   ": null
    },
    {
        "Resale": "resale"
    },
    {
        " – The duty not to prohibit, and not to impose unreasonable or discriminatory conditions or limitations on, the resale of its telecommunications services.   ": null
    },
    {
        "Number portability": "local number portability"
    },
    {
        " – The duty to provide, to the extent technically feasible, number portability in accordance with requirements prescribed by the Commission.   Dialing parity – The duty to provide dialing parity to competing providers of telephone exchange service and telephone toll service, and the duty to permit all such providers to have nondiscriminatory access to telephone numbers, operator services, directory assistance, and directory listing, with no unreasonable dialing delays.   Access to ": null
    },
    {
        "right-of-way": "easement"
    },
    {
        " – The duty to afford access to the ": null
    },
    {
        "poles": "utility pole"
    }
]