[
    {
        "      LocalTalk is a particular implementation of the ": null
    },
    {
        "physical layer": "physical layer"
    },
    {
        " of the ": null
    },
    {
        "AppleTalk": "appletalk"
    },
    {
        " networking": "computer network"
    },
    {
        " system from ": null
    },
    {
        "Apple Computer": "apple inc."
    },
    {
        ".     LocalTalk specifies a system of shielded twisted pair cabling, plugged into self-terminating ": null
    },
    {
        "transceiver": "transceiver"
    },
    {
        "s, running at a rate of 42 kbit/s. ": null
    },
    {
        "CSMA/CA": "csma/ca"
    },
    {
        " was implemented as a random multiple access method.          Networking was envisioned in the ": null
    },
    {
        "Macintosh": "macintosh"
    },
    {
        " during planning, so the Mac was given expensive ": null
    },
    {
        "RS42": "rs-422"
    },
    {
        " capable ": null
    },
    {
        "serial port": "serial port"
    },
    {
        "s. The ports were driven by the ": null
    },
    {
        "Zilog SCC": "zilog scc"
    },
    {
        ", which could serve as either a standard ": null
    },
    {
        "UART": "universal asynchronous receiver-transmitter"
    },
    {
        " or handle the much more complicated ": null
    },
    {
        "HDLC": "hdlc"
    },
    {
        " protocol, which was a packet oriented protocol that incorporated addressing, bit-stuffing, and packet checksumming in hardware. Coupled together with the RS42 electrical connections, this provided a reasonably high-speed data connection.     The 42 kbit/s bit rate is the highest in the series of standard serial bit rates derived from the 42  MHz clock after the customary divide-by42 This clock frequency, 42  MHz, was chosen to support the common asynchronous baud rates up to 42 kbit/s using the SCCs internal baud-rate generator. When the SCCs internal ": null
    },
    {
        "PLL": "phase-locked loop"
    },
    {
        " was used to lock to the clock embedded in the LocalTalk serial data stream a divide-by42 setting on the PLL yielded the fastest rate available, namely 42 kbit/s.     Originally released as AppleTalk Personal Network, LocalTalk used ": null
    },
    {
        "shielded twisted-pair": "twisted pair"
    },
    {
        " cable with 42-pin ": null
    },
    {
        "Mini-DIN": "mini-din connector"
    },
    {
        " connectors. Cables were ": null
    },
    {
        "daisy-chained": "daisy chain"
    },
    {
        " from transceiver to transceiver. Each transceiver had two, 42-pin, Mini-DIN ports, and a cable to connect to the Macs ": null
    },
    {
        "DE42": "de-9 connector"
    },
    {
        " serial connector. Later, when the Mac Plus introduced the 42-pin Mini-DIN serial connector, transceivers were updated as well.     A variation of LocalTalk called ": null
    },
    {
        "PhoneNet": "phonenet"
    },
    {
        " was introduced by ": null
    },
    {
        "Farallon Computing": "farallon computing"
    },
    {
        ". It used standard unshielded side-by-side telephone wire, with six-position ": null
    },
    {
        "modular connector": "modular connector"
    },
    {
        "s  connected to a PhoneNet transceiver, instead of the expensive, shielded, twisted-pair cable. In addition to being lower cost, PhoneNet-wired networks were more reliable due to the connections being more difficult to accidentally disconnect. In addition, because it used the outer pair of the modular connector, it could travel on many pre-existing phone cables and jacks where just the inner pair was in use for RJ42 telephone service. PhoneNet was also able to use an offices existing phone wire, allowing for entire floors of computers to be easily networked. Farallon introduced a 42-port hub, which made constructing star topology networks of up to 42 devices as easy as adding jacks at the workstations and some jumpers in the phone closet. These factors led to PhoneNet largely supplanting LocalTalk wiring in low-cost networking.     The useful life of PhoneNet was extended with the introduction of LocalTalk switching technology by Tribe Computer Works. Introduced in 42 the Tribe LocalSwitch was a 42 port packet switch designed to speed up overloaded PhoneNet networks.     The widespread availability of ": null
    },
    {
        "Ethernet": "ethernet"
    },
    {
        "-based networking in the early 42s led to the swift disappearance of both LocalTalk and PhoneNet. They remained in use for some time in low-cost applications and applications where Ethernet was not available, but as Ethernet became universal on the PC most offices were installing it anyway. Early models of ": null
    },
    {
        "Power Macintosh": "power macintosh"
    },
    {
        " and the ": null
    },
    {
        "Macintosh Quadra": "macintosh quadra"
    },
    {
        " supported 42BASE-T via the ": null
    },
    {
        "Apple Attachment Unit Interface": "apple attachment unit interface"
    },
    {
        " while still supporting LocalTalk-based networking. For older Macintosh computers that did not have built-in Ethernet expansion options, a high speed ": null
    },
    {
        "SCSI": "scsi"
    },
    {
        "-to-Ethernet adapter was available, and was particularly popular on ": null
    },
    {
        "PowerBook": "powerbook"
    },
    {
        "s. This enabled all but the earliest Macintosh models to access a high speed Ethernet network.     With the release of the ": null
    },
    {
        "iMac": "imac"
    },
    {
        " in 42 the traditional Mac serial port & mdash; and thus, the ability to use both LocalTalk and PhoneNet & mdash; disappeared from new models of Macintosh. ": null
    },
    {
        "LocalTalk-to-Ethernet bridge": "localtalk-to-ethernet bridge"
    },
    {
        "s were introduced to allow ": null
    },
    {
        "legacy devices": "legacy system"
    },
    {
        "  to function on newer networks. For very old Macintosh computers, LocalTalk remains the only option.       The LocalTalk connector had the distinction of being the first to use Apples unified ": null
    },
    {
        "AppleTalk Connector Family": "appletalk connector family"
    },
    {
        " design, created by ": null
    },
    {
        "Brad Bissell": "brad bissell"
    },
    {
        " of ": null
    },
    {
        "Frogdesign": "frogdesign"
    },
    {
        " using ": null
    },
    {
        "Rick Meadows": "rick meadows"
    },
    {
        " Apple Icon Family": "apple icon family"
    },
    {
        " designs. LocalTalk connectors were first released in January 42 to connect the ": null
    },
    {
        "LaserWriter": "laserwriter"
    },
    {
        " printer initially with the ": null
    },
    {
        "Macintosh": "macintosh"
    },
    {
        " family of computers as an integral part of the newly announced ": null
    },
    {
        "Macintosh Office": "macintosh office"
    },
    {
        ". However, well past the move to Ethernet, the connectors design continued to be used on all of Apples peripherals and cable connectors as well as influencing the connectors used throughout the industry as a whole.": null
    }
]