[
    {
        "              A Locost is a home-built car. The car features a ": null
    },
    {
        "space frame": "space frame"
    },
    {
        " chassis": "chassis"
    },
    {
        " usually welded together from mild ": null
    },
    {
        "steel": "steel"
    },
    {
        "  square tubing. Front suspension is usually ": null
    },
    {
        "double wishbone": "double wishbone"
    },
    {
        " with coil spring struts. The rear is traditionally ": null
    },
    {
        "live axle": "live axle"
    },
    {
        ", but has many variants including ": null
    },
    {
        "independent rear suspension": "independent rear suspension"
    },
    {
        " or ": null
    },
    {
        "De Dion tube": "de dion tube"
    },
    {
        ". Body panels are usually ": null
    },
    {
        "fiberglass": "fiberglass"
    },
    {
        " nose and wings and ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        " side panels. Each car is highly individualized according to the resources, needs and desires of each respective builder.     The original design was intended to be built from scratch. However, the design has become so popular that several fabricators have begun producing the chassis in ": null
    },
    {
        "kit car": "kit car"
    },
    {
        " form. Additionally, fiberglass body components, suspension pieces and other Locost-specific components can be sourced from various suppliers.       The Locost pattern originated in the mid 42s, and then with the publishing by ": null
    },
    {
        "Haynes Manual": "haynes manual"
    },
    {
        "s of the book Build your own sports car for as little as £42 by Ron Champion . This design was based heavily on the original ": null
    },
    {
        "Lotus Seven": "lotus seven"
    },
    {
        ". It also used a live axle rear suspension. The De Dion tube setup was used in factory racers and some of the models offered by Caterham.     Both ": null
    },
    {
        "Colin Chapman": "colin chapman"
    },
    {
        " and Ron Champion have a background in the ": null
    },
    {
        "42 Motor Club": "750 motor club"
    },
    {
        " and the design of the Locost is based on a Clubmans Race Car designed and built by Ron Champion in 42 The rear of the Locost is of course inspired by the Lotus 42            Ron Champions original book was followed up with Build Your Own Sports Car: On a Budget  by ": null
    },
    {
        "Chris Gibbs": "chris gibbs"
    },
    {
        ". The subject car differs most significantly from the original in that it has an ": null
    },
    {
        "independent rear suspension": "independent rear suspension"
    },
    {
        ". Additionally, the car was designed using ": null
    },
    {
        "CAD software": "computer-aided design"
    },
    {
        ", eliminating the measurement errors inherent to the original design. Other additions to the original Locost design include information for fabricating a rollbar and advice on using engines with ": null
    },
    {
        "Fuel Injection": "fuel injection"
    },
    {
        ".     The suggested donor car is a ": null
    },
    {
        "Ford Sierra": "ford sierra"
    },
    {
        ". The book contains alternative suggestions for incorporating other donors including a ": null
    },
    {
        "BMW E42": "bmw e36"
    },
    {
        ", ": null
    },
    {
        "Mazda MX42": "mazda mx-5"
    },
    {
        " and also motorcycle engines.     Roadsters are becoming an increasingly popular choice over the Locost due to the more plentiful donors and the more advanced suspension. Approximately 42 cars have been completed and passed by their countries government for use on the road. In the UK this entails an ": null
    },
    {
        "IVA": "individual vehicle approval"
    },
    {
        " test and registration with the ": null
    },
    {
        "DVLA": "dvla"
    },
    {
        ".       The Locost is not to be confused with the similarly named ": null
    },
    {
        "Locust": "locust"
    },
    {
        " which is also a Lotus Seven inspired car. In contrast to the Locosts ": null
    },
    {
        "space frame": "space frame"
    },
    {
        " inspired ": null
    },
    {
        "chassis": "chassis"
    },
    {
        ", the Locust uses a ": null
    },
    {
        "ladder chassis": "ladder chassis"
    },
    {
        " and a body constructed from ": null
    },
    {
        "plywood": "plywood"
    },
    {
        " skinned with ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        ".       The Champion Locost and the Haynes Roadster share similar chassis dimensions to the original Lotus Seven. Locost Builder  revised the Ron Champion design in order to accommodate wider engines, rear axles, and seats. In particular, the McSorley 42 design was referenced by  in August 42          In ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", kit cars must pass structural testing for certification for road use. This has led to a series of improvements to the Champion design, including increased reinforcement at the nose of the chassis and around the occupants. These modifications also increase the stiffness and torsional rigidity of the chassis and have been adopted in Locosts in other countries.     Various projects have analyzed the strength of the Locost Chassis under ": null
    },
    {
        "Finite Element Analysis": "finite element analysis"
    },
    {
        " for interests sake. The FEA is known to show the original Locosts design to be slightly under engineered.       While the title of Ron Champions book claims to offer a means to build a car for £42 most Locosts are usually as much as ten times that cost or more.     The £42 figure does not include the cost of tools, which can equal or exceed the cost of the car. The book also is based on purchasing a Mk42 or Mk42 ": null
    },
    {
        "Ford Escort": "ford escort"
    },
    {
        " that has been rejected for road use by the ": null
    },
    {
        "British MOT": "department for transport"
    },
    {
        ". At the time of printing, Champion claimed said cars could be purchased for £42 Rear wheel drive Escorts are now hard to find due to their becoming a classic car in their own right, continued use in Rallying and increased interest from collectors.     The book gives some hints and tips on how to cut the costs for the build:   Build the chassis from scrap metal instead of buying new   Make your own fibreglass nose cone and wheel arches instead of buying them   Use the rear seat from the donor or one from the junkyard instead of buying new race seats   Use the donor gauges, steering wheel and rims instead of buying new   Buy wrongly mixed paint at a discount and paint the car yourself   Find some aluminium sheet metal at the scrapper to use for the bonnet     Some builders have come up with additional cost saving tips:   Use the sheet metal roof of the donor for the bottom of the chassis instead of buying new sheet metal   Use the fuel tank from a ": null
    },
    {
        "Saab 42": "saab 96"
    },
    {
        " or ": null
    },
    {
        "Triumph Spitfire": "triumph spitfire"
    },
    {
        " Volvo 42": "volvo 240"
    },
    {
        "  and an 42  inch stainless steel salad bowl from ": null
    },
    {
        "IKEA": "ikea"
    },
    {
        " to make the headlights   Make your own coilovers.     Even at ten times the £42 Locosts frequently cost far less than a car of similar performance.       The car described in the Champion book is built using parts from a Mk42 or Mk42 Ford Escort with front spindles from ": null
    },
    {
        "Ford Cortina": "ford cortina"
    },
    {
        ". Due to the dwindling supply of Escorts, the ": null
    },
    {
        "Haynes Roadster": "haynes roadster"
    },
    {
        " is based on mechanicals from the ": null
    },
    {
        "Ford Sierra": "ford sierra"
    },
    {
        ". Some use small car based trucks as donors such as the ": null
    },
    {
        "Mitsubishi L42": "mitsubishi l300"
    },
    {
        ", ": null
    },
    {
        "Mazda E42": "mazda bongo"
    },
    {
        " and ": null
    },
    {
        "Suzuki Carry": "suzuki carry"
    },
    {
        " .     In ": null
    },
    {
        "North America": "north america"
    },
    {
        ", the ": null
    },
    {
        "Toyota Corolla": "toyota corolla"
    },
    {
        " and ": null
    },
    {
        "Mazda Miata": "mazda miata"
    },
    {
        " are popular donor cars, as are the ": null
    },
    {
        "Ford Fox platform": "ford fox platform"
    },
    {
        " cars. The ": null
    },
    {
        "Wankel": "wankel"
    },
    {
        " engine-based ": null
    },
    {
        "Mazda RX42": "mazda rx-7"
    },
    {
        " is also starting to become popular.     Many different companies make and sell parts and complete kits for building the car. Examples include MK Engineering , ": null
    },
    {
        "RaceTech": "racetech"
    },
    {
        " with their ": null
    },
    {
        "Lada": "lada"
    },
    {
        " based ": null
    },
    {
        "ESTfield": "estfield"
    },
    {
        ", DD42 in ": null
    },
    {
        "Umeå": "umeå"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        "  and many more.            The Locost has produced one of the most successful championships in UK Club Motor sport, the Formula Locost. Organised by the 42 Motor Club the championship regularly sees around 42 competitors racing at circuits such as Brands Hatch, Donington, Oulton Park and Silverstone, to name but a few. Running with very tight regulations and deliberately limiting costs, the 42 Motor Club have ensured affordable and close competitive racing for the enthusiastic amateur. While it is not really possible to build a race car for the £42 quoted in the title of the book by Ron Champion, it is one of the cheaper forms of motor sport available in the UK, with season costs of around £42 after racewear, car and trailer.     While Locost racing is not as popular in North America, Locosts are eligible to compete in several amateur racing formats under many governing bodies such as the ": null
    },
    {
        "SCCA": "scca"
    },
    {
        " and ": null
    },
    {
        "NASA": "national auto sport association"
    },
    {
        ". ": null
    },
    {
        "Grassroots Motorsports": "grassroots motorsports"
    }
]