[
    {
        "Logic of Empire is a ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novella": "novella"
    },
    {
        " by American writer ": null
    },
    {
        "Robert A. Heinlein": "robert a. heinlein"
    },
    {
        ". Part of his ": null
    },
    {
        "Future History": "future history"
    },
    {
        " series, it originally appeared in  Astounding Science Fiction  , and was collected in  The Green Hills of Earth  .     Ostensibly a tale about a man in the wrong place at the wrong time, and his struggle to free himself from the oppressive circumstances in which he is plunged, this story also serves to explain how slavery develops in a new colony. Even in the future, the technology available to a new colony is always initially low. If a machine to do a necessary job is too expensive to import , a human must do it instead. If too many jobs must be done by hand and there is a shortage of labor compared with independent resources that free labor could take up , a market for slavery develops. Decades later, while there is still an abundance of land, this market remains because the colony itself has quotas to meet and debts to repay - they cannot spare the resources to develop local industries to make the machines themselves and free labor does not have to bid its price down enough to outcompete slave labor.     Throughout the story, Heinlein takes the view of the objective narrator when describing Venusian society. Logic of Empire places different rationales on the people who participate in slavery. There are no real villains; everybodys just doing their job, trying to maximize income in a mercantilist system. Even the plantation owner who owns the hero is portrayed as a struggling — and failing — small businessman, whose main motivation is to secure a livelihood for his daughter.       Two well-off ": null
    },
    {
        "Earth": "earth"
    },
    {
        " men are arguing about whether there is ": null
    },
    {
        "slavery": "slavery"
    },
    {
        " on ": null
    },
    {
        "Venus": "venus"
    },
    {
        ", and one of them gets ": null
    },
    {
        "shanghai": "shanghaiing"
    },
    {
        "ed there—or so he believes; they later find out that theyve bet one another about the topic, gotten drunk, and signed on. Upon his arrival, he finds his ": null
    },
    {
        "contract": "indentured servant"
    },
    {
        " sold to a farmer. His discovery that it will take him years to ": null
    },
    {
        "work off his debt": "debt bondage"
    },
    {
        " is compounded by his realization that he cannot get to sleep at night without rhira, an expensive local ": null
    },
    {
        "narcotic": "narcotic"
    },
    {
        ", thus increasing his debt every day.         There is in the story a casual reference to the rise of the fanatic preacher Nehemiah Scudder, who would eventually be elected president and establish a theocratic dictatorship which would rule the US for several generations. Heinlein considered writing a story focusing on his rise, which would have had the name The Sound of His Wings and which would have chronologically followed directly upon Logic of Empire . He never did, and a great gap was left in the Future History which resumes with the overthrow of the theocracy in ": null
    },
    {
        "If This Goes On—": "if this goes on—"
    },
    {
        " .         on the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        "                   ": null
    }
]