[
    {
        "                         London Docklands is the riverfront and former docks in ": null
    },
    {
        "London": "london"
    },
    {
        ". It is located in inner east and southeast London, in the boroughs of ": null
    },
    {
        "Southwark": "london borough of southwark"
    },
    {
        ", ": null
    },
    {
        "Tower Hamlets": "london borough of tower hamlets"
    },
    {
        ", ": null
    },
    {
        "Lewisham": "london borough of lewisham"
    },
    {
        ", ": null
    },
    {
        "Newham": "london borough of newham"
    },
    {
        ", and ": null
    },
    {
        "Greenwich": "royal borough of greenwich"
    },
    {
        ". The ": null
    },
    {
        "docks": "dock"
    },
    {
        " were formerly part of the ": null
    },
    {
        "Port of London": "port of london"
    },
    {
        ", at one time the ": null
    },
    {
        "worlds largest port": "worlds largest port"
    },
    {
        ". After the docks closed, the area had become derelict and poverty-ridden by the 1980s. The Docklands regeneration began later that decade; it has been redeveloped principally for commercial and residential use. The name London Docklands was used for the first time in a government report on redevelopment plans in 1971 and has since been almost universally adopted. The redevelopment created wealth, but also led to some conflict between the new and old communities in the area.       In ": null
    },
    {
        "Roman": "roman britain"
    },
    {
        " and ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " times, ships arriving in the ": null
    },
    {
        "River Thames": "river thames"
    },
    {
        " tended to dock at small quays in the present-day ": null
    },
    {
        "City of London": "city of london"
    },
    {
        " or ": null
    },
    {
        "Southwark": "southwark"
    },
    {
        ", an area known as the ": null
    },
    {
        "Pool of London": "pool of london"
    },
    {
        ". However, these gave no protection against the elements, were vulnerable to thieves and suffered from a lack of space at the quayside. The ": null
    },
    {
        "Howland Great Dock": "greenland dock"
    },
    {
        " in ": null
    },
    {
        "Rotherhithe": "rotherhithe"
    },
    {
        "  was designed to address these problems, providing a large, secure and sheltered anchorage with room for 120 large vessels. It was a major commercial success, and provided for two phases of expansion during the ": null
    },
    {
        "Georgian": "georgian era"
    },
    {
        " and ": null
    },
    {
        "Victorian era": "victorian era"
    },
    {
        "s.     The first of the Georgian docks was the ": null
    },
    {
        "West India": "west india docks"
    },
    {
        " , followed by the ": null
    },
    {
        "London": "london docks"
    },
    {
        " , the ": null
    },
    {
        "East India": "east india docks"
    },
    {
        " , the Surrey , the ": null
    },
    {
        "Regents Canal Dock": "regents canal dock"
    },
    {
        " , ": null
    },
    {
        "St Katharine": "st katharine docks"
    },
    {
        " and the West India South . The Victorian docks were mostly further east, comprising the ": null
    },
    {
        "Royal Victoria": "royal victoria dock"
    },
    {
        " , ": null
    },
    {
        "Millwall": "millwall dock"
    },
    {
        " and ": null
    },
    {
        "Royal Albert": "royal albert dock"
    },
    {
        " . The ": null
    },
    {
        "King George V Dock": "king george v dock, london"
    },
    {
        " was a late addition in 1921.       Three principal kinds of docks existed. Wet docks were where ships were laid up at anchor and loaded or unloaded. Dry docks, which were far smaller, took individual ships for repairing. Ships were built at dockyards along the riverside. In addition, the river was lined with innumerable ": null
    },
    {
        "warehouses, piers, jetties and dolphins": "list of locations in the port of london"
    },
    {
        " . The various docks tended to specialise in different forms of produce. The Surrey Docks ": null
    },
    {
        "concentrated on timber": "british timber trade"
    },
    {
        ", for instance; Millwall took grain; St Katharine took wool, sugar and rubber; and so on.     The docks required an army of workers, chiefly ": null
    },
    {
        "lightermen": "lightermen"
    },
    {
        "  and quayside workers, who dealt with the goods once they were ashore. Some of the workers were highly skilled: the lightermen had their own ": null
    },
    {
        "livery company": "livery company"
    },
    {
        " or guild, while the ": null
    },
    {
        "deal porters": "deal porters"
    },
    {
        " were famous for their acrobatic skills. Most were unskilled and worked as casual labourers. They assembled at certain points, such as pubs, each morning, where they were selected more or less at random by foremen. For these workers, it was effectively a lottery whether they would get work on any particular day. This arrangement continued until as late as 1965, although it was somewhat regularised after the creation of the ": null
    },
    {
        "National Dock Labour Scheme": "national dock labour scheme"
    },
    {
        " in 1947.     The main dockland areas were originally low-lying marshes, mostly unsuitable for agriculture and lightly populated. With the establishment of the docks, the dock workers formed a number of tight-knit local communities with their own distinctive cultures and slang. Due to poor communications with other parts of London, they tended to develop in some isolation. Road access to the ": null
    },
    {
        "Isle of Dogs": "isle of dogs"
    },
    {
        ", for example, was only via two ": null
    },
    {
        "swing bridge": "swing bridge"
    },
    {
        "s. Local sentiment there was so strong that Ted Johns, a local community campaigner, and his supporters, in protest at the lack of social provision from the state, unilaterally declared independence for the area, set up a so-called Island Council with Johns himself as its elected leader, and blocked off the two access roads.  Telegraph 14 May 2004 accessed 14 May 2015          The docks were originally built and managed by a number of competing private companies. From 1909, they were managed by the ": null
    },
    {
        "Port of London Authority": "port of london authority"
    },
    {
        " which amalgamated the companies in a bid to make the docks more efficient and improve ": null
    },
    {
        "labour relations": "labour relations"
    },
    {
        ". The PLA constructed the last of the docks, the King George V, in 1921, as well as greatly expanding the ": null
    },
    {
        "Tilbury docks": "port of tilbury"
    },
    {
        ".      ": null
    },
    {
        "German bombing": "the blitz"
    },
    {
        " during the ": null
    },
    {
        "Second World War": "world war ii"
    },
    {
        " caused massive damage to the docks, with 380,000 tons of ": null
    },
    {
        "timber": "timber"
    },
    {
        " destroyed in the Surrey Docks in a single night. Nonetheless, following post-war rebuilding they experienced a resurgence of prosperity in the 1950s. The end came suddenly, between approximately 1960 and 1970, when the shipping industry adopted the newly invented ": null
    },
    {
        "container system": "containerization"
    },
    {
        " of cargo transportation. Londons docks were unable to accommodate the much larger vessels needed by containerization, and the shipping industry moved to deep-water ports such as Tilbury and ": null
    },
    {
        "Felixstowe": "port of felixstowe"
    },
    {
        ". Between 1960 and 1980, all of Londons docks were closed, leaving around eight square miles of derelict land in East London. Unemployment was high, and poverty and other social problems were rife.             Efforts to redevelop the docks began almost as soon as they were closed, although it took a decade for most plans to move beyond the drawing board and another decade for redevelopment to take full effect. The situation was greatly complicated by the large number of landowners involved: the PLA, the ": null
    },
    {
        "Greater London Council": "greater london council"
    },
    {
        " , the ": null
    },
    {
        "British Gas Corporation": "british gas plc"
    },
    {
        ", five borough councils, ": null
    },
    {
        "British Rail": "british rail"
    },
    {
        " and the ": null
    },
    {
        "Central Electricity Generating Board": "central electricity generating board"
    },
    {
        ".     To address this problem, in 1981 the ": null
    },
    {
        "Secretary of State for the Environment": "secretary of state for the environment"
    },
    {
        ", ": null
    },
    {
        "Michael Heseltine": "michael heseltine"
    },
    {
        ", formed the ": null
    },
    {
        "London Docklands Development Corporation": "london docklands development corporation"
    },
    {
        " to redevelop the area. This was a statutory body appointed and funded by central government , with wide powers to acquire and dispose of land in the Docklands. It also served as the development planning authority for the area.     Another important government intervention was the designation in 1982 of an ": null
    },
    {
        "enterprise zone": "enterprise zone"
    },
    {
        ", an area in which businesses were exempt from property taxes and had other incentives, including simplified planning and capital allowances. This made investing in the Docklands a significantly more attractive proposition and was instrumental in starting a property boom in the area.     The LDDC was controversial; it was accused of favouring elitist luxury developments rather than affordable housing, and it was unpopular with the local communities, who felt that their needs were not being addressed. Nonetheless, the LDDC was central to a remarkable transformation in the area, although how far it was in control of events is debatable. It was wound up in 1998 when control of the Docklands area was handed back to the respective local authorities.     The massive development programme managed by the LDDC during the 1980s and 1990s saw a huge area of the Docklands converted into a mixture of residential, commercial and light industrial space. The clearest symbol of the whole effort was the ambitious ": null
    },
    {
        "Canary Wharf": "canary wharf"
    },
    {
        " project that constructed Britains tallest building at the time and established a second major financial centre in London. However, there is no evidence that the LDDC foresaw this scale of development; nearby ": null
    },
    {
        "Heron Quays": "heron quays"
    },
    {
        " had already been developed as low-density offices when Canary Wharf was proposed, and similar development was already underway on Canary Wharf itself, ": null
    },
    {
        "Limehouse Studios": "limehouse studios"
    },
    {
        " being the most famous occupant.     Canary Wharf was far from trouble-free; the property slump of the early 1990s halted further development for several years. Developers found themselves, for a time, saddled with property that they were unable to sell or let.          The Docklands historically had poor transport connections. This was addressed by the LDDC with the construction of the ": null
    },
    {
        "Docklands Light Railway": "docklands light railway"
    },
    {
        " , which connected the Docklands with the City. According to Transport for London, the owner of the project, it was a remarkably   inexpensive development, costing only £77 million in its first phase, as it relied on reusing disused railway infrastructure and derelict land for much of its length. The LDDC originally requested a full ": null
    },
    {
        "London Underground": "london underground"
    },
    {
        " line, but the Government refused to fund it.     The LDDC also built the ": null
    },
    {
        "Limehouse Link tunnel": "limehouse link tunnel"
    },
    {
        ", a ": null
    },
    {
        "cut and cover": "cut and cover"
    },
    {
        " road tunnel linking the Isle of Dogs to ": null
    },
    {
        "The Highway": "the highway"
    },
    {
        " at a cost of over £150 million per kilometre, one of the most expensive stretches of road ever built.      The LDDC also contributed to the development of ": null
    },
    {
        "London City Airport": "london city airport"
    },
    {
        " , opened in October 1987 on the spine of the ": null
    },
    {
        "Royal Docks": "royal docks"
    },
    {
        ".     The London Undergrounds ": null
    },
    {
        "Jubilee line": "jubilee line"
    },
    {
        " was extended eastwards in 1999; it now serves Rotherhithe/": null
    },
    {
        "Surrey Quays": "surrey quays"
    },
    {
        " at ": null
    },
    {
        "Canada Water station": "canada water station"
    },
    {
        ", the Isle of Dogs at ": null
    },
    {
        "Canary Wharf tube station": "canary wharf tube station"
    },
    {
        ", ": null
    },
    {
        "Greenwich": "greenwich"
    },
    {
        " at ": null
    },
    {
        "North Greenwich tube station": "north greenwich tube station"
    },
    {
        " and the nearby Royal Docks at ": null
    },
    {
        "Canning Town station": "canning town station"
    },
    {
        ". The DLR was extended in 1994 to serve much of the Royal Docks area when the ": null
    },
    {
        "Beckton": "beckton"
    },
    {
        " branch was opened. The Isle of Dogs branch was extended further south, and in 1999 it began serving Greenwich town centre—including the ": null
    },
    {
        "Cutty Sark": "cutty sark"
    },
    {
        " museum—": null
    },
    {
        "Deptford": "deptford"
    },
    {
        " and finally ": null
    },
    {
        "Lewisham": "lewisham"
    },
    {
        ". In 2005, a new branch of the DLR opened from Canning Town to serve what used to be the eastern terminus of the ": null
    },
    {
        "North London Line": "north london line"
    },
    {
        ", including a station at ": null
    },
    {
        "London City Airport": "london city airport dlr station"
    },
    {
        ". It was then further extended to ": null
    },
    {
        "Woolwich Arsenal": "woolwich arsenal station"
    },
    {
        " in 2009.       Further development projects are being proposed and put into practice within the London Dockland area, such as:     Extensions of the DLR, possibly to ": null
    },
    {
        "Dagenham": "dagenham"
    },
    {
        ".   ": null
    },
    {
        "Crossrail": "crossrail"
    },
    {
        " links to central London, ": null
    },
    {
        "Reading": "reading railway station"
    },
    {
        " and ": null
    },
    {
        "Heathrow Airport": "heathrow airport"
    },
    {
        ".   Further development of ": null
    },
    {
        "Canada Water": "canada water"
    },
    {
        ".   Redevelopment of ": null
    },
    {
        "Blackwall Basin": "blackwall basin"
    },
    {
        " and ": null
    },
    {
        "Wood Wharf": "wood wharf"
    },
    {
        ", east of Canary Wharf.   New skyscrapers to be built at Canary Wharf, including the ": null
    },
    {
        "Riverside South": "riverside south"
    },
    {
        " towers, the ": null
    },
    {
        "Heron Quays West": "heron quays west"
    },
    {
        " double-skyscraper development and the ": null
    },
    {
        "North Quay": "north quay, london"
    },
    {
        " project, consisting of three towers.     In the early 21st century, redevelopment is spreading into the more suburban parts of east and southeast London, and into the parts of the counties of ": null
    },
    {
        "Kent": "kent"
    },
    {
        " and ": null
    },
    {
        "Essex": "essex"
    },
    {
        " that abut the ": null
    },
    {
        "Thames Estuary": "thames estuary"
    },
    {
        ". See ": null
    },
    {
        "Thames Gateway": "thames gateway"
    },
    {
        " and ": null
    },
    {
        "Lower Lea Valley": "lower lea valley"
    },
    {
        " for further information on this trend.           The numbers of several ": null
    },
    {
        "London Buses": "london buses"
    },
    {
        " routes are prefixed D for Docklands; all run on the north bank of the River Thames as part of the London bus network, and act as feeder buses to the DLR. The D network was developed in the early stages of Docklands redevelopment; it was originally much larger, but as transport rapidly improved across east London, the need for the D routes reduced. Today only four remain, running primarily in ": null
    },
    {
        "Tower Hamlets": "london borough of tower hamlets"
    },
    {
        " and briefly into ": null
    },
    {
        "Newham": "london borough of newham"
    },
    {
        " and ": null
    },
    {
        "Hackney": "london borough of hackney"
    },
    {
        ". ": null
    },
    {
        "Docklands Buses": "docklands buses"
    },
    {
        " operates all routes apart from route D3, which is run by ": null
    },
    {
        "Stagecoach London": "stagecoach london"
    },
    {
        ".       The population of the Docklands has more than doubled during the last 30 years, and the area has become both a major business centre and, for many, an increasingly desirable area to live. Canary Wharf has become one of Europes biggest clusters of skyscrapers and a major extension to the financial services district of the City of London.     Although most of the old wharfs and warehouses have been demolished, some have been restored and converted into flats. Most of the docks themselves have survived and are now used as marinas or watersports centres; a major exception is the Surrey Commercial Docks, which are now largely filled in. Although large ships can—and occasionally still do—visit the old docks, all of the commercial traffic has moved downriver.     The revival of the Docklands has had major effects in run-down surrounding areas. Greenwich and Deptford are undergoing large-scale redevelopment, chiefly as a result of the improved transport links making them more attractive to commuters.     The Docklands redevelopment has, however, had some less beneficial aspects. The massive property boom and consequent rise in house prices has led to friction between the new arrivals and the old Docklands communities, who have complained of being squeezed out. It has also made for some of the most striking disparities to be seen anywhere in Britain: luxury executive flats constructed alongside run-down public housing estates.     The Docklands status as a symbol of ": null
    },
    {
        "Margaret Thatchers": "margaret thatcher"
    },
    {
        "Britain has also made it a target for terrorists. After a failed attempt to bomb Canary Wharf in 1992, a large IRA ": null
    },
    {
        "bomb exploded at South Quay on 9 February 1996": "1996 docklands bombing"
    },
    {
        ". Two people died in the explosion, forty people were injured and an estimated £150 million of damage was caused. The parlous state of the Docklands property market at the time of the blast, combined with a lengthy delay in implementing redevelopment, means a true estimate of the financial cost is difficult to reach.  This bombing ended an ": null
    },
    {
        "IRA": "provisional irish republican army"
    },
    {
        " ceasefire.  James McArdle was imprisoned for 25 years after a trial at ": null
    },
    {
        "Woolwich": "woolwich"
    },
    {
        " Crown Court": "crown court"
    },
    {
        " that ended on 24 June 1998. Under the terms of the ": null
    },
    {
        "Good Friday Agreement": "good friday agreement"
    },
    {
        " and ": null
    },
    {
        "royal prerogative of mercy": "royal prerogative of mercy"
    },
    {
        " officially signed by Queen ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        ", McArdle was released on 28 June 2000.      London Docklands is served by its own free newspaper, the Docklands, launched in 2006 by Archant London following the purchase of Docklands News, the ex-LDDC newspaper that was then owned by Ivy Communications. It is delivered weekly to properties and available to pick up from various locations in the area. It has the highest circulation of any newspaper in the area. A sister title, The Peninsula, was launched in 2007, covering the ": null
    },
    {
        "Greenwich Peninsula": "greenwich peninsula"
    },
    {
        ".     In a further sign of regeneration in the area, the Docklands now has its own symphony orchestra, ": null
    },
    {
        "Docklands Sinfonia": "docklands sinfonia"
    },
    {
        "; this was formed in January 2009 and is based at ": null
    },
    {
        "St Annes Limehouse": "st annes limehouse"
    },
    {
        ". , East London Advertiser, 16 September 2008       The offices of  The Independent  group of publications were at one time situated in the Docklands. In 2008, ": null
    },
    {
        "Independent News & Media": "independent news  &  media"
    },
    {
        " announced that The Independent would be moving its offices to Northcliffe House in ": null
    },
    {
        "Kensington": "kensington"
    },
    {
        ". Ponsford, Dominic. .  Press Gazette . 28 November 2008. Retrieved on 6 September 2011. Under a deal signed today, the Independent titles will share back office functions with the Daily Mail, Mail on Sunday, Metro and Evening Standard at Northcliffe House in Kensington.     Since 1990, the London’s Docklands has become one of the world’s leading global internet hubs since the opening of the carrier-neutral ": null
    },
    {
        "Telehouse": "telehouse europe"
    },
    {
        " campus which hosts the vast majority of ": null
    },
    {
        "LINX’s": "london internet exchange"
    },
    {
        " internet peering traffic, occupying over 73,000 square metres.  In August 2016, Telehouse Europe opened $177 million North Two data centre of 24,000 square metres that became the only UK data centre to own a 132 kV on-campus grid substation that is directly connected to the ": null
    },
    {
        "National Grid": "national grid"
    }
]