[
    {
        "Long Live Walter Jameson is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone .              Walter Jameson, a college professor, is engaged to a young doctoral student named Susanna Kittridge. Susannas father, Sam Kittridge, another professor at Jamesons college, becomes suspicious of Jameson because he does not appear to have aged in the twelve years they have known each other and seems to have unrealistically detailed knowledge of some pieces of history that do not appear in texts. Jameson at one point reads from an original ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        " diary in his possession. Later, Kittridge recognizes Jameson in a ": null
    },
    {
        "Mathew Brady": "mathew brady"
    },
    {
        " Civil War photograph. After he presents these pieces of evidence, Jameson ultimately reveals his real life history. Agelessness was imparted to him by an alchemist more than 42 years ago. Jameson does not know what was done to him, only that the alchemist was gone when he recovered, and he then stopped aging. Soon, he had to become a constant refugee. He tells Kittridge that he learned a terrible lesson from living for so long and longs for death. He keeps a revolver in his desk drawer, but does not have the courage to use it.     Realizing that if Jameson marries his daughter, she will grow old, and Jameson will eventually abandon her in order to keep his secret, Kittridge refuses permission for Jameson to marry his daughter. Jameson defies him and proposes to Susanna, and they plan to immediately elope.     Jameson is accosted by Laurette Bowen , one of his wives, whom he abandoned when she grew old and frail. She claims that she cannot allow Jameson to destroy another womans life. She discovers Jamesons pistol lying on his desk and shoots him. Shortly after Bowen leaves, Kittridge enters Jamesons study and finds him bleeding, but seemingly at peace. Jameson rapidly ages and collapses on the floor. Susanna enters the house. Kittridge tries to stop her from seeing the aged Jameson, saying only that he is gone. He is unable to keep her out of the room, but inside she discovers only an empty suit of clothes with a white substance near the collar and sleeves. When Susanna asks what is on the floor, the professor replies, Dust, only dust.              The scenes of Walter Jamesons aging was performed by using an old movie-making trick. Age lines were drawn on actor ": null
    },
    {
        "Kevin McCarthy": "kevin mccarthy"
    },
    {
        "s face in red make-up. During the beginning of the scene, red lighting was used, bathing the scene in red and hiding the age lines. As the scene progressed, the red lights were turned down and green lights were brought up. Under the green lights, the red age lines were prominent. The lighting changes were unseen by the audience because it was filmed in black-and-white. The ultimate result is the appearance of a complete make-up change with no cuts to the scene. ": null
    },
    {
        "Confederates": "confederate states of america"
    },
    {
        ", on Gen. ": null
    },
    {
        "John Bell Hood": "john bell hood"
    },
    {
        "s order, to destroy ": null
    },
    {
        "munitions": "munitions"
    },
    {
        " and thereby prevent them from falling into Federal hands. Gen. ": null
    },
    {
        "William Tecumseh Sherman": "william tecumseh sherman"
    },
    {
        "s fire would not take place until November as his army began ": null
    },
    {
        "Sherman’s March to the Sea": "sherman’s march to the sea"
    },
    {
        ".   This episode was remade as ": null
    },
    {
        "Queen of the Nile ": "queen of the nile"
    },
    {
        " with some variations: a centuries old ": null
    },
    {
        "femme fatale": "femme fatale"
    },
    {
        " seduces men so she can sacrifice their ": null
    },
    {
        "lifeforce": "souls"
    },
    {
        " to remain young forever. The footage of the victim aging was the same aging trick as used on Walter Jameson; in fact the footage of the remains of Jameson was reused in this later episode.       For the DVD release Kevin McCarthy returned to record an audio commentary for the episode, revealing that he never met Rod Serling and that, aside from  Invasion of the Body Snatchers ": null
    }
]