[
    {
        "         Louis IX , commonly known as Saint Louis, is the only ": null
    },
    {
        "King of France": "King Of France"
    },
    {
        " to be canonized in the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        ". Louis was ": null
    },
    {
        "crowned in Reims": "Coronation Of The French Monarch"
    },
    {
        " at the age of 12, following the death of his father ": null
    },
    {
        "Louis VIII": "Louis Viii"
    },
    {
        "; his mother, ": null
    },
    {
        "Blanche of Castile": "Blanche Of Castile"
    },
    {
        ", ruled the kingdom as regent until he reached maturity. During Louis childhood, Blanche dealt with the opposition of rebellious vassals and obtained a definitive victory in the ": null
    },
    {
        "Albigensian Crusade": "Albigensian Crusade"
    },
    {
        " which had started 20 years earlier.     As an adult, Louis IX faced recurring conflicts with some of the most-powerful nobles, such as ": null
    },
    {
        "Hugh X of Lusignan": "Hugh X Of Lusignan"
    },
    {
        " and ": null
    },
    {
        "Peter of Dreux": "Peter Of Dreux"
    },
    {
        ". Simultaneously, ": null
    },
    {
        "Henry III of England": "Henry Iii Of England"
    },
    {
        " tried to restore his ": null
    },
    {
        "continental possessions": "Angevin Empire"
    },
    {
        ", but was utterly defeated at the ": null
    },
    {
        "battle of Taillebourg": "Battle Of Taillebourg"
    },
    {
        ". His reign saw the annexation of several provinces, notably parts of ": null
    },
    {
        "Aquitaine": "Aquitaine"
    },
    {
        ", ": null
    },
    {
        "Maine": "Maine"
    },
    {
        " and ": null
    },
    {
        "Provence": "Provence"
    },
    {
        ".     Louis IX was a reformer and developed French royal justice, in which the king was the supreme judge to whom anyone could appeal to seek the amendment of a judgment. He banned ": null
    },
    {
        "trials by ordeal": "Trial By Ordeal"
    },
    {
        ", tried to prevent the ": null
    },
    {
        "private wars": "Feud"
    },
    {
        "that were plaguing the country, and introduced the ": null
    },
    {
        "presumption of innocence": "Presumption Of Innocence"
    },
    {
        " in criminal procedure. To enforce the application of this new legal system, Louis IX created ": null
    },
    {
        "provosts": "Provost"
    },
    {
        " and ": null
    },
    {
        "bailiff": "Bailiff"
    },
    {
        "s.     Following a vow he made after a serious illness and confirmed after a miraculous cure, Louis IX took an active part in the ": null
    },
    {
        "Seventh": "Seventh Crusade"
    },
    {
        " and ": null
    },
    {
        "Eighth Crusade": "Eighth Crusade"
    },
    {
        "s. He died from ": null
    },
    {
        "dysentery": "Dysentery"
    },
    {
        " during the latter crusade, and was succeeded by his son ": null
    },
    {
        "Philip III": "Philip Iii Of France"
    },
    {
        ".     Louiss actions were inspired by ": null
    },
    {
        "Christian": "Christianity"
    },
    {
        " zeal and Catholic devotion. He decided to severely punish ": null
    },
    {
        "blasphemy": "Blasphemy"
    },
    {
        " ,  ": null
    },
    {
        "gambling": "Gambling"
    },
    {
        ", ": null
    },
    {
        "interest-bearing loans": "Usury"
    },
    {
        " and ": null
    },
    {
        "prostitution": "Prostitution"
    },
    {
        ". He spent exorbitant sums on presumed ": null
    },
    {
        "relics": "Relics"
    },
    {
        " of ": null
    },
    {
        "Christ": "Christ"
    },
    {
        ", for which he built the ": null
    },
    {
        "Sainte-Chapelle": "Sainte-Chapelle"
    },
    {
        ". He expanded the scope of the ": null
    },
    {
        "Inquisition": "Inquisition"
    },
    {
        " and ordered the ": null
    },
    {
        "burning": "Book Burning"
    },
    {
        " of ": null
    },
    {
        "Talmuds": "Talmud"
    },
    {
        "and other Jewish books. He is the only ": null
    },
    {
        "canonized": "Canonization"
    },
    {
        " king of France, and there are consequently many ": null
    },
    {
        "places named after him": "Louis Ix Of Franceplaces Named After Saint Louis"
    },
    {
        ".       Much of what is known of Louiss life comes from ": null
    },
    {
        "Jean de Joinvilles": "Jean De Joinville"
    },
    {
        "famous  Life of Saint Louis . Joinville was a close friend, confidant, and counselor to the king, and he also participated as a witness in the papal inquest into Louis life that ended with his canonisation in 1297 by ": null
    },
    {
        "Pope Boniface VIII": "Pope Boniface Viii"
    },
    {
        ".     Two other important biographies were written by the kings ": null
    },
    {
        "confessor": "Confessor"
    },
    {
        ", ": null
    },
    {
        "Geoffrey of Beaulieu": "Geoffrey Of Beaulieu"
    },
    {
        ", and his chaplain, ": null
    },
    {
        "William of Chartres": "William Of Chartres"
    },
    {
        ". While several individuals wrote biographies in the decades following the kings death, only Jean of Joinville, Geoffrey of Beaulieu, and William of Chartres wrote from personal knowledge of the king, and all three are biased favorably to the king. The fourth important source of information is ": null
    },
    {
        "William of Saint-Parthus": "William Of Saint-Parthus"
    },
    {
        " 19th century biography, Vie de St Louis, ed. H.-F. Delaborde, Paris, 1899 which he wrote using the papal inquest mentioned above.       Louis was born on 25 April 1214 at ": null
    },
    {
        "Poissy": "Poissy"
    },
    {
        ", near Paris, the son of ": null
    },
    {
        "Louis the Lion": "Louis Viii Of France"
    },
    {
        " and ": null
    },
    {
        "Blanche of Castile": "Blanche Of Castile"
    },
    {
        ", and baptised in La Collégiale Notre-Dame church. His grandfather on his fathers side was ": null
    },
    {
        "Philip II": "Philip Ii Of France"
    },
    {
        ", king of France; while his grandfather on his mothers side was ": null
    },
    {
        "Alfonso VIII": "Alfonso Viii Of Castile"
    },
    {
        ", king of ": null
    },
    {
        "Castile": "Kingdom Of Castile"
    },
    {
        ". Tutors of Blanches choosing taught him most of what a king must know—Latin, public speaking, writing, military arts, and government.  He was nine years old when his grandfather Philip II died and his father ascended as Louis VIII. Plaque in the church, Collégiale Notre-Dame, Poissy, France. Louis was 12 years old when his father died on 8 November 1226. He was crowned king within the month at ": null
    },
    {
        "Reims Cathedral": "Reims Cathedral"
    },
    {
        ". Because of Louiss youth, his mother ruled France as ": null
    },
    {
        "regent": "Regent"
    },
    {
        " during his minority.      Louis mother trained him to be a great leader and a good Christian. She used to say:           His younger brother ": null
    },
    {
        "Charles I of Sicily": "Charles I Of Sicily"
    },
    {
        " was created ": null
    },
    {
        "count of Anjou": "Count Of Anjou"
    },
    {
        ", thus founding the ": null
    },
    {
        "Capetian Angevin": "Capetian House Of Anjou"
    },
    {
        " dynasty.     No date is given for the beginning of Louiss personal rule. His contemporaries viewed his reign as co-rule between the king and his mother, though historians generally view the year 1234 as the year in which Louis began ruling personally, with his mother assuming a more advisory role.  She continued to have a strong influence on the king until her death in 1252.        On 27 May 1234, Louis married ": null
    },
    {
        "Margaret of Provence": "Margaret Of Provence"
    },
    {
        " and she was crowned in the cathedral of Sens the next day. Louiss marriage had political connections, his wife was sister to ": null
    },
    {
        "Eleanor": "Eleanor Of Provence"
    },
    {
        ", later the wife of ": null
    },
    {
        "Henry III of England": "Henry Iii Of England"
    },
    {
        ". The new queens religious zeal made her a well suited partner for the king. He enjoyed her company, and was pleased to show her the many public works he was making in Paris, both for its defence and for its health. They enjoyed riding together, reading, and listening to music. This attention raised a certain amount of jealousy in his mother, who tried to keep them apart as much as she could.          In the 1230s, ": null
    },
    {
        "Nicholas Donin": "Nicholas Donin"
    },
    {
        ", a Jewish convert to Christianity, translated the ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        " and pressed 35 charges against it to ": null
    },
    {
        "Pope Gregory IX": "Pope Gregory Ix"
    },
    {
        " by quoting a series of passages about ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        ", ": null
    },
    {
        "Mary": "Mary"
    },
    {
        " or Christianity that he considered ": null
    },
    {
        "blasphemous": "Blasphemy"
    },
    {
        ". There is a Talmudic passage, for example, where ": null
    },
    {
        "Jesus of Nazareth": "Jesus In The Talmud"
    },
    {
        " is sent to Hell to be ": null
    },
    {
        "boiled in excrement": "Tzoah Rotachat"
    },
    {
        " for eternity. Donin also selected an injunction of the Talmud that permits Jews to kill non-Jews. This led to the ": null
    },
    {
        "Disputation of Paris": "Disputation Of Paris"
    },
    {
        ", which took place in 1240 at the court of Louis IX, where rabbi ": null
    },
    {
        "Yechiel of Paris": "Yechiel Of Paris"
    },
    {
        " defended the Talmud against the accusations of Nicholas Donin. The translation of the Talmud from Judeo Aramaic to a language that non-Jews could understand was seen by Jews as a profound violation. The disputation led to the condemnation of the Talmud and the burning of thousands of copies.        When Louis was 15, his mother brought an end to the ": null
    },
    {
        "Albigensian Crusade": "Albigensian Crusade"
    },
    {
        " in 1229 after signing an agreement with Count ": null
    },
    {
        "Raymond VII, Count of Toulouse": "Raymond Vii, Count Of Toulouse"
    },
    {
        " that cleared the latters father of wrongdoing. ": null
    },
    {
        "Raymond VI, Count of Toulouse": "Raymond Vi, Count Of Toulouse"
    },
    {
        " had been suspected of murdering a preacher on a mission to convert the ": null
    },
    {
        "Cathars": "Cathars"
    },
    {
        ".     Louis went on two ": null
    },
    {
        "crusade": "Crusade"
    },
    {
        "s, in his mid-30s in 1248 , and then again in his mid-50s in 1270 .                   In 1248 Louis decided that his obligations as a son of the Church outweighed those of his throne, and he left his kingdom for a disastrous six-year adventure. Since the base of Muslim power had shifted to Egypt, Louis did not even march on the ": null
    },
    {
        "Holy Land": "Holy Land"
    },
    {
        "; any war against ": null
    },
    {
        "Islam": "Islam"
    },
    {
        " now fit the definition of a Crusade.      Louis and his followers landed in Egypt on 5 June 1249 and began his first crusade with the rapid capture of the port of ": null
    },
    {
        "Damietta": "Damietta"
    },
    {
        ". Tyerman, p. 787 This attack caused some disruption in the Muslim ": null
    },
    {
        "Ayyubid": "Ayyubid Dynasty"
    },
    {
        " empire, especially as the current sultan, ": null
    },
    {
        "Al-Malik as-Salih Najm al-Din Ayyub": "As-Salih Ayyub"
    },
    {
        ", was on his deathbed. However, the march from Damietta toward ": null
    },
    {
        "Cairo": "Cairo"
    },
    {
        " through the ": null
    },
    {
        "Nile River Delta": "Nile River Delta"
    },
    {
        " went slowly. The rising of the Nile and the summer heat made it impossible for them to advance and follow up on their success. During this time, the Ayyubid sultan died, and the sultans wife ": null
    },
    {
        "Shajar al-Durr": "Shajar Al-Durr"
    },
    {
        " set in motion a sudden power shift that would make her Queen and eventually place the Egyptian army of the ": null
    },
    {
        "Mamluks": "Mamluks"
    },
    {
        " in power. On 8 February 1250 Louis lost his army at the ": null
    },
    {
        "Battle of Al Mansurah": "Battle Of Al Mansurah"
    },
    {
        " and was captured by the Egyptians. His release was eventually negotiated in return for a ransom of 400,000  livres tournois   and the surrender of the city of Damietta. Tyerman, pp. 789–798            Following his release from Egyptian captivity, Louis spent four years in the ": null
    },
    {
        "Latin kingdoms": "Kingdom Of Jerusalem"
    },
    {
        " of ": null
    },
    {
        "Acre": "Acre, Israel"
    },
    {
        ", ": null
    },
    {
        "Caesarea": "Caesarea"
    },
    {
        ", and ": null
    },
    {
        "Jaffa": "Jaffa"
    },
    {
        ", using his wealth to assist the ": null
    },
    {
        "Crusaders": "Crusaders"
    },
    {
        " in rebuilding their defences  and conducting diplomacy with the Islamic powers of Syria and Egypt. In the spring of 1254 he and his army returned to France.     Louis exchanged multiple letters and emissaries with ": null
    },
    {
        "Mongol": "Mongol Empire"
    },
    {
        " rulers of the period. During his first crusade in 1248, Louis was approached by envoys from ": null
    },
    {
        "Eljigidei": "Eljigidei"
    },
    {
        ", the Mongol military commander stationed in ": null
    },
    {
        "Armenia": "Mongol Armenia"
    },
    {
        " and ": null
    },
    {
        "Persia": "Ilkhanate"
    },
    {
        ". Eljigidei suggested that King Louis should land in Egypt, while Eljigidei attacked Baghdad, to prevent the Saracens of Egypt and those of Syria from joining forces. Louis sent ": null
    },
    {
        "André de Longjumeau": "André De Longjumeau"
    },
    {
        ", a Dominican priest, as an emissary to the Great Khan ": null
    },
    {
        "Güyük Khan": "Güyük"
    },
    {
        " in Mongolia. Güyük died before the emissary arrived at his court, however, and nothing concrete occurred. Instead his queen and now regent, ": null
    },
    {
        "Oghul Qaimish": "Oghul Qaimish"
    },
    {
        ", politely turned down the diplomatic offer.      Louis dispatched another envoy to the Mongol court, the Franciscan ": null
    },
    {
        "William of Rubruck": "William Of Rubruck"
    },
    {
        ", who went to visit the Great Khan ": null
    },
    {
        "Möngke": "Möngke"
    },
    {
        " in Mongolia. He spent several years at the Mongol court. In 1259, ": null
    },
    {
        "Berke": "Berke"
    },
    {
        ", the ruler of the Golden Horde, westernmost part of the ": null
    },
    {
        "Mongolian Empire": "Mongolian Empire"
    },
    {
        ", demanded the submission of Louis. Denis Sinor – The Mongols in the West. Journal of Asian History v.33 n.1 On the contrary, Mongolian Emperors Möngke and ": null
    },
    {
        "Khubilais": "Kublai Khan"
    },
    {
        "brother, the ": null
    },
    {
        "Ilkhan": "Ilkhan"
    },
    {
        " Hulegu, sent a letter seeking military assistance from the king of France, but the letter did not reach France.             In a parliament held at Paris, 24 March 1267, Louis and his three sons took the cross. On hearing the reports of the missionaries, Louis resolved to land at Tunis, and he ordered his younger brother, Charles of Anjou, to join him there. The crusaders, among whom was the English prince ": null
    },
    {
        "Edward Longshanks": "Edward Longshanks"
    },
    {
        ", landed at ": null
    },
    {
        "Carthage": "Carthage"
    },
    {
        " 17 July 1270, but disease broke out in the camp. Many died of dysentery, and on 25 August, Louis himself died. Magill & Aves, p. 606.       Louis patronage of the arts drove much innovation in ": null
    },
    {
        "Gothic art": "Gothic Art"
    },
    {
        " and ": null
    },
    {
        "architecture": "Gothic Architecture"
    },
    {
        ", and the style of his court radiated throughout Europe by both the purchase of art objects from Parisian masters for export, and by the marriage of the kings daughters and female relatives to foreign husbands and their subsequent introduction of Parisian models elsewhere. Louis personal chapel, the  Sainte-Chapelle  in Paris, was copied more than once by his descendants elsewhere. Louis most likely ordered the production of the ": null
    },
    {
        "Morgan Bible": "Morgan Bible"
    },
    {
        ", a masterpiece of medieval painting.          During the so-called golden century of Saint Louis , the kingdom of France was at its height in Europe, both politically and economically. Saint Louis was regarded as primus inter pares , first among equals, among the kings and rulers of the continent. He commanded the largest army and ruled the largest and wealthiest kingdom, the European centre of arts and intellectual thought at the time. The foundations for the famous college of theology later known as the ": null
    },
    {
        "Sorbonne": "Sorbonne"
    },
    {
        " were laid in Paris about the year 1257. The prestige and respect felt in Europe for King Louis IX were due more to the attraction that his personality created rather than to military domination. For his contemporaries, he was the quintessential example of the Christian prince and embodied the whole of ": null
    },
    {
        "Christendom": "Christendom"
    },
    {
        " in his person. His reputation for saintliness and fairness was already well established while he was alive, and on many occasions he was chosen as an arbiter in quarrels among the rulers of Europe.     Shortly before 1256, ": null
    },
    {
        "Enguerrand IV, Lord of Coucy": "Enguerrand Iv, Lord Of Coucy"
    },
    {
        ", arrested and without trial hanged three young squires of Laon whom he accused of poaching in his forest. In 1256 Louis had him arrested and brought to the ": null
    },
    {
        "Louvre": "Palais Du Louvre"
    },
    {
        " by his sergeants. Enguerrand demanded judgment by his peers and trial by battle, which the king refused because he thought it obsolete. Enguerrand was tried, sentenced, and ordered to pay 12,000 livres. Part of the money was to pay for masses in perpetuity for the men he had hanged.     In 1258, Louis and ": null
    },
    {
        "James I of Aragon": "James I Of Aragon"
    },
    {
        " signed the ": null
    },
    {
        "Treaty of Corbeil": "Treaty Of Corbeil"
    },
    {
        ", under which Louis renounced his feudal overlordship over the ": null
    },
    {
        "County of Barcelona": "County Of Barcelona"
    },
    {
        " and ": null
    },
    {
        "Roussillon": "Roussillon"
    },
    {
        ", which was held by the King of Aragon. James in turn renounced his feudal overlordship over several counties in southern France including ": null
    },
    {
        "Provence": "Provence"
    },
    {
        " and ": null
    },
    {
        "Languedoc": "Languedoc"
    },
    {
        ". In 1259 Louis signed the ": null
    },
    {
        "Treaty of Paris": "Treaty Of Paris"
    },
    {
        ", by which ": null
    },
    {
        "Henry III of England": "Henry Iii Of England"
    },
    {
        " was confirmed in his possession of territories in southwestern France and Louis received the provinces of ": null
    },
    {
        "Anjou": "Anjou"
    },
    {
        ", ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        " , ": null
    },
    {
        "Poitou": "Poitou"
    },
    {
        ", ": null
    },
    {
        "Maine": "Maine"
    },
    {
        ", and ": null
    },
    {
        "Touraine": "Touraine"
    },
    {
        ".            The perception of Louis IX as the exemplary Christian prince was reinforced by his religious zeal. Louis was an extremely devout Catholic, and he built the  Sainte-Chapelle  , located within the royal palace complex , on the  Île de la Cité  in the centre of Paris. The Sainte Chapelle, a prime example of the ": null
    },
    {
        "Rayonnant": "Rayonnant"
    },
    {
        " style of ": null
    },
    {
        "Gothic architecture": "Gothic Architecture"
    },
    {
        ", was erected as a shrine for what Louis believed to be the ": null
    },
    {
        "Crown of Thorns": "Crown Of Thorns"
    },
    {
        " and a fragment of the ": null
    },
    {
        "True Cross": "True Cross"
    },
    {
        ", supposed precious ": null
    },
    {
        "relics": "Relic"
    },
    {
        "of the ": null
    },
    {
        "Passion": "Passion"
    },
    {
        " of Christ. He acquired these in 1239–41 from Emperor ": null
    },
    {
        "Baldwin II": "Baldwin Ii, Latin Emperor"
    },
    {
        " of the ": null
    },
    {
        "Latin Empire": "Latin Empire"
    },
    {
        " of ": null
    },
    {
        "Constantinople": "Constantinople"
    },
    {
        " by agreeing to pay off the imperial debt Baldwin owed to Niccolo Quirino, a wealthy Venetian merchant, a debt to which Baldwin had pledged the Crown of Thorns as collateral.  Louis IX paid the exorbitant sum of 135,000 ": null
    },
    {
        "livres": "French Livre"
    },
    {
        " .     Louis IX took very seriously his mission as lieutenant of God on Earth , with which he had been invested when he was crowned in ": null
    },
    {
        "Reims": "Reims"
    },
    {
        ". To fulfill this duty, he conducted two ": null
    },
    {
        "crusade": "Crusade"
    },
    {
        "s. They contributed to his prestige, even though both ended disastrously. Everything he did was for what he saw as the glory of God and the good of his people. He protected the poor and was never heard to speak ill of anyone. He excelled in penance, leaving to us both a ": null
    },
    {
        "hair shirt": "Cilice"
    },
    {
        " and a ": null
    },
    {
        "scourge": "Scourge"
    },
    {
        ", and had a great love for the Church. He was merciful even to rebels. When he was urged to put to death a prince who had followed his father in rebellion, he refused, saying: A son cannot refuse to obey his father.          In 1230 the King forbade all forms of ": null
    },
    {
        "usury": "Usury"
    },
    {
        ", defined at the time as any taking of interest and therefore covering most banking activities. Where the original borrowers from Jewish and Lombard lenders could not be found, Louis exacted from those lenders a contribution towards the crusade which Pope Gregory was then trying to launch.  Louis also ordered, at the urging of ": null
    },
    {
        "Pope Gregory IX": "Pope Gregory Ix"
    },
    {
        ", the burning in Paris in 1243 of some 12,000 manuscript copies of the ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        " and other Jewish books. Eventually, the edict against the Talmud was overturned by Gregory IXs successor, ": null
    },
    {
        "Innocent IV": "Pope Innocent Iv"
    },
    {
        ".      In addition to Louis legislation against banking and to his burning of Jewish books, he expanded the scope of the ": null
    },
    {
        "Inquisition": "Inquisition"
    },
    {
        " in France and set the punishment for ": null
    },
    {
        "blasphemy": "Blasphemy"
    },
    {
        " to ": null
    },
    {
        "mutilation": "Mutilation"
    },
    {
        " of the tongue and lips. The area most affected by this expansion was southern France where the ": null
    },
    {
        "Cathar": "Cathar"
    },
    {
        " sect had been strongest. The rate of these confiscations reached its highest levels in the years before his first crusade, and slowed upon his return to France in 1254. In 1250, he headed a crusade and was taken prisoner. During his captivity, he recited the ": null
    },
    {
        "Divine Office": "Canonical Hours"
    },
    {
        " every day. After his release against ransom, he visited the Holy Land before returning to France. In these deeds, Louis IX tried to fulfill what he saw as the duty of France as the eldest daughter of the Church , a tradition of protector of the Church going back to the ": null
    },
    {
        "Franks": "Franks"
    },
    {
        " and ": null
    },
    {
        "Charlemagne": "Charlemagne"
    },
    {
        ", who had been crowned by the ": null
    },
    {
        "Pope Leo III": "Pope Leo Iii"
    },
    {
        " in Rome in 800. Indeed, the kings of France were known by the title most Christian king . The relationship between France and the papacy was at its peak in the 12th and 13th centuries, and most of the crusades were actually called by the popes from French soil.     Louis was renowned for his charity. Beggars were fed from his table, he ate their leavings, washed their feet, ministered to the wants of the lepers, and daily fed over one hundred poor. He founded many hospitals and houses: the House of the ": null
    },
    {
        "Filles-Dieu": "Filles-Dieu"
    },
    {
        " for reformed prostitutes; the ": null
    },
    {
        "Quinze-Vingt": "Quinze-Vingts National Eye Hospital"
    },
    {
        " for 300 blind men , hospitals at Pontoise, Vernon, Compiégne.      St. Louis installed a house of the ": null
    },
    {
        "Trinitarian Order": "Trinitarian Order"
    },
    {
        " in his ": null
    },
    {
        "château of Fontainebleau.": "Palace Of Fontainebleau"
    },
    {
        " He chose Trinitarians as his chaplains, and was accompanied by them on his crusades. In his spiritual testament he wrote: My dearest son, you should permit yourself to be tormented by every kind of martyrdom before you would allow yourself to commit a mortal sin.                 Blanche , died in infancy.   ": null
    },
    {
        "Isabella": "Isabella Of France, Queen Of Navarre"
    },
    {
        " , married ": null
    },
    {
        "Theobald II of Navarre": "Theobald Ii Of Navarre"
    },
    {
        ".   ": null
    },
    {
        "Louis": "Louis Of France"
    },
    {
        " . Betrothed to ": null
    },
    {
        "Berengaria of Castile": "Berengaria Of Castile, Lady Of Guadalajara"
    },
    {
        " in Paris on 20 August 1255.   ": null
    },
    {
        "Philip III": "Philip Iii Of France"
    },
    {
        " , married firstly to ": null
    },
    {
        "Isabella of Aragon": "Isabella Of Aragon, Queen Of France"
    },
    {
        " in 1262 and secondly to ": null
    },
    {
        "Maria of Brabant": "Marie Of Brabant, Queen Of France"
    },
    {
        " in 1274.   John , died in infancy.   ": null
    },
    {
        "John Tristan": "John Tristan, Count Of Valois"
    },
    {
        " , Count of Valois, married ": null
    },
    {
        "Yolande II, Countess of Nevers": "Yolande Ii, Countess Of Nevers"
    },
    {
        ".   ": null
    },
    {
        "Peter": "Peter I, Count Of Alençon"
    },
    {
        " , Count of Perche and Alençon, married ": null
    },
    {
        "Joanne of Châtillon": "Joanne Of Châtillon"
    },
    {
        ".   ": null
    },
    {
        "Blanche": "Blanche Of France, Infanta Of Castile"
    },
    {
        " , married ": null
    },
    {
        "Ferdinand de la Cerda, Infante of Castile": "Ferdinand De La Cerda, Infante Of Castile"
    },
    {
        ".   ": null
    },
    {
        "Margaret": "Margaret Of France, Duchess Of Brabant"
    },
    {
        " , married ": null
    },
    {
        "John I, Duke of Brabant": "John I, Duke Of Brabant"
    },
    {
        ".   ": null
    },
    {
        "Robert": "Robert, Count Of Clermont"
    },
    {
        " , Count of Clermont, married ": null
    },
    {
        "Beatrice of Burgundy": "Beatrice Of Burgundy, Lady Of Bourbon"
    },
    {
        ". The French crown devolved upon his male-line descendant, ": null
    },
    {
        "Henry IV": "Henry Iv Of France"
    },
    {
        ", when the legitimate male line of Roberts older brother Philip III died out in 1589.   ": null
    },
    {
        "Agnes": "Agnes Of France, Duchess Of Burgundy"
    },
    {
        " , married ": null
    },
    {
        "Robert II, Duke of Burgundy": "Robert Ii, Duke Of Burgundy"
    },
    {
        ".     Louis had his two children that died in infancy buried at the ": null
    },
    {
        "Cistercian": "Cistercians"
    },
    {
        " abbey of Royaumont": "Royaumont Abbey"
    },
    {
        "; in 1820 they were transferred to ": null
    },
    {
        "Saint-Denis Basilica": "Saint-Denis Basilica"
    },
    {
        ".            During his second crusade, Louis died at ": null
    },
    {
        "Tunis": "Tunis"
    },
    {
        " on 25 August 1270, in an epidemic of ": null
    },
    {
        "dysentery": "Dysentery"
    },
    {
        " that swept through his army. Cross & Livingstone, p. 1004. Lock, p. 183. Uncommon in Muslim burial practice, the territory where he died, his body was subject to the process known as  mos Teutonicus   for its transportation back to France. He was succeeded by his son, ": null
    },
    {
        "Philip III": "Philip Iii Of France"
    },
    {
        ".     His heart and intestines, however, were conveyed by his younger brother, ": null
    },
    {
        "Charles I of Naples": "Charles I Of Naples"
    },
    {
        ", for burial in the cathedral of ": null
    },
    {
        "Monreale": "Monreale"
    },
    {
        " near ": null
    },
    {
        "Palermo": "Palermo"
    },
    {
        ". Gaposchkin, p. 28. His bones were carried in a lengthy processional across Sicily, Italy, the Alps, and France, until they were interred in the royal necropolis at ": null
    },
    {
        "Saint-Denis": "Saint Denis Basilica"
    },
    {
        " in May 1271. Gaposchkin, pp. 28–29. Charles and Philip later disbursed a number of ": null
    },
    {
        "relics": "Relic"
    },
    {
        "to promote his veneration. Gaposchkin, pp. 28–30; 76.            ": null
    },
    {
        "Pope Boniface VIII": "Pope Boniface Viii"
    },
    {
        " proclaimed the canonisation of Louis in 1297; Louis IX, Oxford Dictionary of Saints, , 326. he is the only French king to be declared a ": null
    },
    {
        "saint": "Saint"
    },
    {
        ".  Louis IX is often considered the model of the ideal Christian monarch. The impact of his canonization was so great that many of his ": null
    },
    {
        "successors": "List Of Kings Of France"
    },
    {
        " were named Louis.     Named in his honour, the ": null
    },
    {
        "Sisters of Charity of St. Louis": "Sisters Of Charity Of St. Louis"
    },
    {
        " is a Roman Catholic ": null
    },
    {
        "religious order": "Religious Orderchristian Tradition"
    },
    {
        " founded in ": null
    },
    {
        "Vannes": "Vannes"
    },
    {
        ", France, in 1803.  A similar order, the Sisters of St Louis, was founded in ": null
    },
    {
        "Juilly": "Juilly, Seine-Et-Marne"
    },
    {
        " in 1842. Our Father and Patron St. Louis / St. Louis, King of France, 1214–1270 AD       He is honoured as co-patron of the ": null
    },
    {
        "Third Order of St. Francis": "Third Order Of St. Francis"
    },
    {
        ", which claims him as a member of the Order. Even in childhood, his compassion for the poor and suffering people had been obvious to all who knew him and when he became king, over a hundred poor people ate in his house on ordinary days. Often the king served these guests himself. Such acts of charity, coupled with Louis devout religious practices, gave rise to the legend that he joined the Third Order of St. Francis. Though it is unlikely that Louis did join the order, his life and actions proclaimed him one of them in spirit.         The cities of ": null
    },
    {
        "San Luis Potosí": "San Luis Potosí"
    },
    {
        " in Mexico; ": null
    },
    {
        "St. Louis, Missouri": "St. Louis, Missouri"
    },
    {
        "; ": null
    },
    {
        "St. Louis, Michigan": "St. Louis, Michigan"
    },
    {
        "; ": null
    },
    {
        "San Luis, Arizona": "San Luis, Arizona"
    },
    {
        "; ": null
    },
    {
        "San Luis, Colorado": "San Luis, Colorado"
    },
    {
        "; ": null
    },
    {
        "Saint-Louis du Sénégal": "Saint-Louis Du Sénégal"
    },
    {
        "; ": null
    },
    {
        "Saint-Louis": "Saint-Louis, Haut-Rhin"
    },
    {
        " in Alsace; as well as ": null
    },
    {
        "Lake Saint-Louis": "Lake Saint-Louis"
    },
    {
        " in Quebec, the ": null
    },
    {
        "Mission San Luis Rey de Francia": "Mission San Luis Rey De Francia"
    },
    {
        " in California and ": null
    },
    {
        "São Luís, Maranhão": "São Luís, Maranhão"
    },
    {
        " in Brazil; St. Louis in Saskatchewan, Canada; are among the many places named after the French king and saint.     The Cathedral Saint-Louis in ": null
    },
    {
        "Versailles": "Versailles, Yvelines"
    },
    {
        "; the ": null
    },
    {
        "Basilica of St. Louis, King of France completed in 1834": "Basilica Of St. Louis, King Of France"
    },
    {
        " and the ": null
    },
    {
        "Cathedral Basilica of St. Louis completed in 1914": "Cathedral Basilica Of Saint Louis"
    },
    {
        ", both in St. Louis, Missouri; and the ": null
    },
    {
        "St. Louis Cathedral, New Orleans": "St. Louis Cathedral, New Orleans"
    },
    {
        " were also named for the king. The French royal ": null
    },
    {
        "Order of Saint Louis": "Order Of Saint Louis"
    },
    {
        " , the ": null
    },
    {
        "Île Saint-Louis": "Île Saint-Louis"
    },
    {
        " as well as a hospital in the 10th arrondissement of Paris also bear his name. The national church of France in Rome also carries his name: San Luigi dei Francesi in Italian or Saint Louis of France in English. Also the ": null
    },
    {
        "Cathedral of St Louis": "Cathedral Of St Louis"
    },
    {
        " in Plovdiv, Bulgaria, the ": null
    },
    {
        "Church of St Louis": "List Of Churches In Moscowcentre"
    },
    {
        " in Moscow, Russia, and rue Saint Louis of ": null
    },
    {
        "Pondicherry": "Pondicherry"
    },
    {
        ".     Port-Louis, the capital city of Mauritius, as well as its cathedral are also named after St. Louis, who is the patron saint of the island.     Thailand: ": null
    },
    {
        "Saint Louis Hospital": "โรงพยาบาลเซนต์หลุยส์"
    },
    {
        ", and ": null
    },
    {
        "Saint Louis Church": "โบสถ์เซนต์หลุยส์"
    },
    {
        " in ": null
    },
    {
        "Sathon": "Sathon"
    },
    {
        ", ": null
    },
    {
        "Bangkok": "Bangkok"
    },
    {
        " were named after St.Louis, the patron saint of the founder. The name Saint Louis also exists as the Saint Louis neighbourhood and Soi Saint Louis 1, 2 and 3 alley , which are the area within the hospital.       A bas-relief of St. Louis is one of the carved portraits of historic lawmakers that adorns the chamber of the ": null
    },
    {
        "United States House of Representatives": "United States House Of Representatives"
    },
    {
        ".     Saint Louis is also portrayed on a ": null
    },
    {
        "frieze": "Frieze"
    },
    {
        " depicting a timeline of important lawgivers throughout world history, on the North Wall of the ": null
    },
    {
        "Courtroom": "Courtroom"
    },
    {
        " at the ": null
    },
    {
        "Supreme Court of the United States": "Supreme Court Of The United States"
    },
    {
        ".      A statue of St. Louis by the sculptor John Donoghue stands on the roofline of the ": null
    },
    {
        "New York State Appellate Division": "New York State Appellate Division"
    },
    {
        " Court at 27 Madison Avenue in New York City.     The ": null
    },
    {
        "Apotheosis of St. Louis": "Apotheosis Of St. Louis"
    },
    {
        " is an equestrian statue of the saint, by ": null
    },
    {
        "Charles Henry Niehaus": "Charles Henry Niehaus"
    },
    {
        ", that stands in front of the ": null
    },
    {
        "Saint Louis Art Museum": "Saint Louis Art Museum"
    },
    {
        " in Forest Park.     A heroic portrait by ": null
    },
    {
        "Baron Charles de Steuben": "Charles De Steuben"
    },
    {
        " hangs in the ": null
    },
    {
        "Basilica of the National Shrine of the Assumption of the Blessed Virgin Mary": "Basilica Of The National Shrine Of The Assumption Of The Blessed Virgin Mary"
    },
    {
        " in ": null
    },
    {
        "Baltimore": "Baltimore"
    },
    {
        ". An 1821 gift of ": null
    },
    {
        "King Louis XVIII of France": "Louis Xviii Of France"
    },
    {
        ", it depicts St. Louis burying his plague-stricken troops before the siege of ": null
    },
    {
        "Tunis": "Tunis"
    },
    {
        " at the beginning of the ": null
    },
    {
        "Eighth Crusade": "Eighth Crusade"
    },
    {
        " in 1270.       Davis, William Stearns,  Falaise of the Blessed Voice  aka  The White Queen . New York, NY: Macmillan, 1904   ": null
    },
    {
        "Peter Berling": "Peter Berling"
    },
    {
        ",  The Children of the Grail  ": null
    },
    {
        "Jules Verne": "Jules Verne"
    },
    {
        ", To the Sun?/Off on a Comet! A comet takes several bits of the Earth away when it grazes the Earth. Some people, taken up at the same time, find the Tomb of Saint Louis is one of the bits, as they explore the comet.   ": null
    },
    {
        "Adam Gidwitz": "Adam Gidwitz"
    },
    {
        ", The Inquisitors Tale ": null
    },
    {
        "Marc-Antoine Charpentier": "Marc-Antoine Charpentier"
    },
    {
        ", Motet for Saint Louis": null
    }
]