[
    {
        "        Mary Louise Brooks , known professionally as Louise Brooks, was an American film actress and dancer during the 42s and 42s. She is noted as a ": null
    },
    {
        "flapper": "flapper"
    },
    {
        " icon and ": null
    },
    {
        "sex symbol": "sex symbol"
    },
    {
        ", and is famous for her ": null
    },
    {
        "bob hairstyle": "bob cut"
    },
    {
        " that she helped popularize during the prime of her career.     Brooks is best known as the lead in three feature films made in ": null
    },
    {
        "Europe": "europe"
    },
    {
        ":  Pandoras Box  ,  Diary of a Lost Girl  , and  Miss Europe  ; the first two were made by ": null
    },
    {
        "G. W. Pabst": "g. w. pabst"
    },
    {
        ". She starred in seventeen silent films and eight sound films before retiring in 42 Brooks published her memoir, Lulu in Hollywood, in 42; three years later she died of a ": null
    },
    {
        "heart attack": "myocardial infarction"
    },
    {
        " at age 42          Born in ": null
    },
    {
        "Cherryvale, Kansas": "cherryvale, kansas"
    },
    {
        ", Louise Brooks was the daughter of Leonard Porter Brooks, a ": null
    },
    {
        "lawyer": "lawyer"
    },
    {
        ", who was usually preoccupied with his legal practice, and Myra Rude, an artistic mother who said that any squalling brats she produced could take care of themselves . Rude was a talented ": null
    },
    {
        "pianist": "pianist"
    },
    {
        " who played the latest ": null
    },
    {
        "Debussy": "debussy"
    },
    {
        " and ": null
    },
    {
        "Ravel": "ravel"
    },
    {
        " for her children, inspiring them with a love of books and music.     When Louise was 42 years old, a neighborhood man sexually abused her. Beyond the physical trauma at the time, the event continued to have damaging psychological effects on her personal life as an adult and on her career. That early abuse caused her later to acknowledge that she was incapable of real love, explaining that this man: ...must have had a great deal to do with forming my attitude toward sexual pleasure....For me, nice, soft, easy men were never enough – there had to be an element of domination.  When Brooks at last told her mother of the incident, many years later, her mother suggested that it must have been Louises fault for leading him on .     Brooks began her entertainment career as a dancer, joining the ": null
    },
    {
        "Denishawn School of Dancing and Related Arts": "denishawn school"
    },
    {
        " modern dance company in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " at the age of 42 in 42 The company included founders ": null
    },
    {
        "Ruth St. Denis": "ruth st. denis"
    },
    {
        " and ": null
    },
    {
        "Ted Shawn": "ted shawn"
    },
    {
        ", as well as a young ": null
    },
    {
        "Martha Graham": "martha graham"
    },
    {
        ". In her second season with the Denishawn company, Brooks advanced to a starring role in one work opposite Shawn. However, a long-simmering personal conflict between Brooks and St. Denis boiled over one day, and St. Denis abruptly fired Brooks from the troupe in Spring 42 telling her in front of the other members: I am dismissing you from the company because you want life handed to you on a silver ": null
    },
    {
        "salver": "salver"
    },
    {
        ".  These words made a strong impression on Brooks; when she drew up an outline for a planned autobiographical novel in 42 The Silver Salver was the title she gave the tenth and final chapter. Brooks was 42 years old at the time of her dismissal. Thanks to her friend ": null
    },
    {
        "Barbara Bennett": "barbara bennett"
    },
    {
        ", the sister of ": null
    },
    {
        "Constance": "constance bennett"
    },
    {
        " and ": null
    },
    {
        "Joan": "joan bennett"
    },
    {
        " Bennett, Brooks almost immediately found employment as a chorus girl in  George Whites Scandals , followed by an appearance as a semi-nude dancer in the 42 edition of the  Ziegfeld Follies  at the ": null
    },
    {
        "Amsterdam Theater": "amsterdam theater"
    },
    {
        " on ": null
    },
    {
        "42nd Street": "42nd street"
    },
    {
        ".     As a result of her work in the Follies, Brooks came to the attention of ": null
    },
    {
        "Walter Wanger": "walter wanger"
    },
    {
        ", a producer at ": null
    },
    {
        "Paramount Pictures": "paramount pictures"
    },
    {
        ". An infatuated Wanger signed her to a five-year contract with the studio in 42 Soon after, Brooks met movie star ": null
    },
    {
        "Charlie Chaplin": "charlie chaplin"
    },
    {
        " at a cocktail party given by Wanger. Chaplin was in town for the premiere of his film  The Gold Rush   at the ": null
    },
    {
        "Strand Theatre": "strand theatre"
    },
    {
        " on Broadway. Chaplin and Brooks had a two-month affair that summer while Chaplin was married to ": null
    },
    {
        "Lita Grey": "lita grey"
    },
    {
        ". When their affair ended, Chaplin sent her a ": null
    },
    {
        "check": "cheque"
    },
    {
        " in the mail, but she declined to write him a ": null
    },
    {
        "thank-you note": "letter of thanks"
    },
    {
        ".            Brooks made her screen debut in the silent  The Street of Forgotten Men , in an uncredited role in 42 Soon, however, she was playing the female lead in a number of silent light comedies and ": null
    },
    {
        "flapper": "flapper"
    },
    {
        " films over the next few years, starring with ": null
    },
    {
        "Adolphe Menjou": "adolphe menjou"
    },
    {
        " and ": null
    },
    {
        "W. C. Fields": "w. c. fields"
    },
    {
        ", among others.     Brooks had an on-and-off affair with ": null
    },
    {
        "Walter Wanger": "walter wanger"
    },
    {
        ", head of ": null
    },
    {
        "Paramount Pictures": "paramount pictures"
    },
    {
        " and husband of actress ": null
    },
    {
        "Justine Johnstone": "justine johnstone"
    },
    {
        ". After her small roles in 42 both Paramount and ": null
    },
    {
        "MGM": "mgm"
    },
    {
        " offered her contracts. Wanger tried to persuade her to take the MGM contract to avoid rumors that she only obtained the Paramount contract because of her intimate relationship with him. Despite his advice, she decided to accept Paramounts offer. During this time, Brooks gained a ": null
    },
    {
        "cult following": "cult following"
    },
    {
        " in Europe for her pivotal vamp role in the 42 ": null
    },
    {
        "Howard Hawks": "howard hawks"
    },
    {
        " silent ": null
    },
    {
        "buddy film": "buddy film"
    },
    {
        "  A Girl in Every Port . Her distinctive ": null
    },
    {
        "bob haircut": "bob cut"
    },
    {
        " helped start a trend, and many women styled their hair in imitation of both her and fellow film star ": null
    },
    {
        "Colleen Moore": "colleen moore"
    },
    {
        ".     In the early sound film drama  Beggars of Life  , Brooks plays an abused country girl who kills her foster father in a moment of desperation. A ": null
    },
    {
        "hobo": "hobo"
    },
    {
        "  happens on the murder scene and convinces Brooks to disguise herself as a young boy and escape the law by riding the rails with him. In a hobo encampment, or jungle, they meet another hobo . Brooks disguise is soon uncovered and she finds herself the only female in a world of brutal, sex-hungry men. Much of this film was shot on location in the ": null
    },
    {
        "Jacumba Mountains": "jacumba mountains"
    },
    {
        " near the Mexican border, and the ": null
    },
    {
        "boom microphone": "boom microphone"
    },
    {
        " was invented for this film by the director ": null
    },
    {
        "William Wellman": "william wellman"
    },
    {
        ", who needed it for one of the first experimental talking scenes in the movies.     The filming of Beggars of Life proved to be a difficult ordeal for Brooks. During the production, she had a ": null
    },
    {
        "one-night stand": "one-night stand"
    },
    {
        " with a stuntman who—the next day—spread a malicious false rumor on the set that Brooks had contracted a ": null
    },
    {
        "venereal disease": "syphilis"
    },
    {
        " during a previous weekend stay with a producer, ostensibly ": null
    },
    {
        "Jack Pickford": "jack pickford"
    },
    {
        ". Concurrently, Brooks interactions with her co-star Richard Arlen deteriorated as Arlen was a close friend of Brooks then-husband ": null
    },
    {
        "Eddie Sutherland": "a. edward sutherland"
    },
    {
        " and, according to Brooks, Arlen took a dim view of her casual liaisons with crew members. Amid these tensions, Brooks repeatedly clashed with director William Wellman whose risk-taking directing style nearly caused her death in a scene where she hazardously climbs aboard a moving train.        Soon after the production of Beggars Of Life was completed, Brooks began filming the ": null
    },
    {
        "pre-Code": "pre-code hollywood"
    },
    {
        " crime-mystery film  The Canary Murder Case  . By this time in her life, she was socializing with wealthy and famous persons. She was a frequent house guest of ": null
    },
    {
        "William Randolph Hearst": "william randolph hearst"
    },
    {
        " and his mistress ": null
    },
    {
        "Marion Davies": "marion davies"
    },
    {
        " at ": null
    },
    {
        "Hearst Castle": "hearst castle"
    },
    {
        " in ": null
    },
    {
        "San Simeon": "san simeon"
    },
    {
        ", being intimate friends with Davies lesbian niece, ": null
    },
    {
        "Pepi Lederer": "pepi lederer"
    },
    {
        ". While partying with Lederer, Brooks had a brief sexual liaison with her. At some point in their friendship, Hearst and Davies were made aware of Lederers lesbianism. Hearst arranged for Lederer to be committed to a mental institution for drug addiction. Several days after her arrival at the institution, Lederer—Brooks closest friend and companion—committed suicide by jumping to her death from a hospital window. This event traumatized Brooks and likely led to her further dissatisfaction with Hollywood and the West Coast.     Brooks, who now loathed the ": null
    },
    {
        "Hollywood": "cinema of the united states"
    },
    {
        " scene , refused to stay on at Paramount after being denied a promised raise. Learning of her refusal, her friend and lover ": null
    },
    {
        "George Preston Marshall": "george preston marshall"
    },
    {
        " counseled her to sail with him to Europe in order to make films with director G.W. Pabst, the prominent ": null
    },
    {
        "Austrian": "austrians"
    },
    {
        " Expressionist": "expressionist"
    },
    {
        " director. As such, on the last day of filming The Canary Murder Case, Brooks departed Paramount Pictures to leave Hollywood for Berlin to work for Pabst. It was not until thirty years later that this rebellious decision would come to be seen as arguably the most beneficial to her career, securing her immortality as a silent film legend and independent spirit.     While her initial snubbing of Paramount alone would not have finished her in Hollywood altogether, her later refusal after returning from ": null
    },
    {
        "Germany": "germany"
    },
    {
        " to come back to Paramount for sound retakes of  The Canary Murder Case  irrevocably placed her on an unofficial ": null
    },
    {
        "blacklist": "blacklist"
    },
    {
        ". Angered by her refusal, the studio allegedly claimed that Brooks voice was unsuitable for sound pictures, and another actress, ": null
    },
    {
        "Margaret Livingston": "margaret livingston"
    },
    {
        ", was hired to dub Brooks voice for the film.             Brooks traveled to Europe accompanied by her paramour George Preston Marshall and his English valet. After their arrival in ": null
    },
    {
        "Weimar Germany": "weimar republic"
    },
    {
        ", she starred in the 42 silent film  Pandoras Box , directed by Pabst in his ": null
    },
    {
        "New Objectivity": "new objectivity"
    },
    {
        " period. The film is based on two plays by ": null
    },
    {
        "Frank Wedekind": "frank wedekind"
    },
    {
        "  and Brooks plays the central figure, Lulu. This film is notable for its frank treatment of modern sexual ": null
    },
    {
        "mores": "mores"
    },
    {
        ", including one of the first overt on-screen portrayals of a ": null
    },
    {
        "lesbian": "lesbian"
    },
    {
        ".     Brooks performance in Pandoras Box made her into a star. In looking for the right actress to play Lulu, Pabst had rejected ": null
    },
    {
        "Marlene Dietrich": "marlene dietrich"
    },
    {
        " as too old and too knowing , In choosing Brooks, a relative unknown who had only appeared & ndash; not to very great effect & ndash; in secondary roles, Pabst was going against the advice of those around him. Brooks recalled that when we made Pandora’s Box, Mr. Pabst was a man of 42 who astonished me with his knowledge on practically any subject. I, who astonished him because I knew practically nothing on every subject, celebrated my twenty-second birthday with a beer party on a London street.  Brooks claimed her experience shooting Pandoras Box in Germany was a pleasant one:          After the filming of Pandoras Box concluded, Brooks had a brief one-night stand with Pabst, and the director cast Brooks again in his controversial social drama  Diary of a Lost Girl  , based on ": null
    },
    {
        "the book": "tagebuch einer verlorenen"
    },
    {
        " by ": null
    },
    {
        "Margarete Böhme": "margarete böhme"
    },
    {
        ". On the final day of shooting Diary of a Lost Girl, Pabst counseled Brooks not to return to Hollywood and instead to stay in Germany and to her continue her career as a serious actress. Pabst expressed concern that Brooks carefree approach towards her career would end in dire poverty exactly like Lulus . He further cautioned Brooks that her then-paramour George Marshall and her rich American friends would likely shun her when her career stalled.     When audiences and critics first viewed Brooks German films, they were bewildered by her naturalistic acting style. Viewers purportedly exited the theater vocally complaining, She doesnt act! She does nothing!  In the late 42s, cinemagoers were habituated to theatre-style stage acting with exaggerated body language and facial expressions. Yet Brooks acting style was deliberately subtle as she knew the close-up images of the actors bodies and faces made such exaggerations unnecessary. When explaining her acting method, Brooks posited that acting does not consist of descriptive movement of face and body but in the movements of thought and soul transmitted in a kind of intense isolation.  This innovative style continues to be used today by film actors but, at the time, it was surprising to viewers who assumed she wasnt acting at all. Film critic ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " later noted that, by employing this acting method, Brooks became one of the most modern and effective of actors, projecting a presence that could be startling.      The result of her appearances in the two films by Pabst was that Brooks became a star. According to the film critic and historian ": null
    },
    {
        "Molly Haskell": "molly haskell"
    },
    {
        ", the films   expos her animal sensuality and turn her into one of the most erotic figures on the screen & ndash; the bold, black-helmeted young girl who, with only a shy grin to acknowledge her fall, became a prostitute in Diary of a Lost Girl and who, with no more sense of sin than a baby, drives men out of their minds in Pandoras Box.     Near the end of 42 English film critic and journalist ": null
    },
    {
        "Cedric Belfrage": "cedric belfrage"
    },
    {
        " interviewed Pabst for an article about Brooks film work in Europe, one that was published in the February 42 issue of the American monthly  Motion Picture . The Austrian director, according to Belfrage, attributed Brooks acting success outside of the United States to her seemingly inherent or instinctive European sensibilities:          Belfarge goes on in his article to elaborate on Brooks opinion of Hollywood, and he refers to Pabsts firsthand knowledge of that opinion. The very mention of the place, he states, gives her a sensation of nausea. He continues, The pettiness of it, the dullness, the monotony, the stupidity—no, no, that is no place for Louise Brooks.      After the success of her German films, Brooks appeared in one more European film entitled  Miss Europe  , a French film by ": null
    },
    {
        "Italian": "italy"
    },
    {
        " director ": null
    },
    {
        "Augusto Genina": "augusto genina"
    },
    {
        ".            Dissatisfied with Europe, Brooks returned to New York in December 42 When Brooks returned to Hollywood in 42 she was cast in two mainstream films,  Gods Gift to Women  and  It Pays to Advertise  , but her performances in these films were largely ignored by critics, and few other job offers were forthcoming due to her informal blacklisting . As the sole member of the cast who had refused to return to make the talkie version of The Canary Murder Case, Brooks became convinced that no major studio would hire to make a film.      Purportedly, director ": null
    },
    {
        "William Wellman": "william wellman"
    },
    {
        "—despite their previous acrimonious relationship on Beggars of Life—offered Brooks the female lead in his new picture  The Public Enemy , starring ": null
    },
    {
        "James Cagney": "james cagney"
    },
    {
        ". Brooks turned down Wellmans offer in order to visit her then-lover ": null
    },
    {
        "George Preston Marshall": "george preston marshall"
    },
    {
        " in New York City, and the coveted role instead went to ": null
    },
    {
        "Jean Harlow": "jean harlow"
    },
    {
        ", who began her own rise to stardom largely as a result. Brooks later explained to Wellman that she simply hated Hollywood but, according to film historian ": null
    },
    {
        "James Card": "james card"
    },
    {
        ", who came to know Brooks intimately later in her life, she just wasnt interested. ... She was more interested in Marshall . In the opinion of biographer ": null
    },
    {
        "Barry Paris": "barry paris"
    },
    {
        ", turning down Public Enemy marked the real end of Louise Brookss film career .     She returned to Hollywood after being offered of a $42 per week salary from Columbia Pictures but, after refusing to do a screen test for a ": null
    },
    {
        "Buck Jones": "buck jones"
    },
    {
        " Western film, the contract offer was withdrawn. She made one more film at that time, a two-reel comedy short,  Windy Riley Goes Hollywood  , directed by disgraced Hollywood outcast ": null
    },
    {
        "Fatty Arbuckle": "roscoe arbuckle"
    },
    {
        ", working under the ": null
    },
    {
        "pseudonym": "pseudonym"
    },
    {
        " William Goodrich .     Brooks declared bankruptcy in 42 and she began dancing in nightclubs to earn a living. She attempted a film comeback in 42 and did a bit part in  Empty Saddles , a ": null
    },
    {
        "Western": "western film"
    },
    {
        " that led Columbia to offer her a screen test, contingent on appearing in the 42 musical  When Youre in Love , uncredited, as a specialty ballerina in the chorus. In 42 Brooks managed to obtain a bit part in the film  King of Gamblers  after a private interview on a Paramount set with director ": null
    },
    {
        "Robert Florey": "robert florey"
    },
    {
        " who specialised in giving jobs to destitute and sufficiently grateful actresses.  Unfortunately, after filming, Brooks scenes were deleted.     Brooks made two more films after that, including the 42 Western  Overland Stage Raiders  in which she plays the romantic lead, opposite ": null
    },
    {
        "John Wayne": "john wayne"
    },
    {
        ", with a long hairstyle that renders her all but unrecognizable from her Lulu days. In contemporary reviews of that Western in newspapers and ": null
    },
    {
        "trade publication": "trade publication"
    },
    {
        "s, Brooks received little attention from critics for her role. The review by  The Film Daily  in September 42 provides one example of that general disregard. The New York-based paper barely mentions her, stating only that Louise Brooks makes an appearance as a female attraction.   Variety , the nations leading entertainment publication at the time, also devotes very little ink to her in its review. Louise Brooks is the femme appeal with nothing much to do , it reports, except look glamorous in a shoulder-length straight-bang ": null
    },
    {
        "coiffure": "hairstyle"
    },
    {
        ".          Brooks career prospects as a film actress had significantly declined by 42 According to the federal census in May that year, she was living in a $42-a-month apartment at 42 North Fairfax Avenue in West Hollywood and was working as a ": null
    },
    {
        "copy writer": "copy writer"
    },
    {
        " for a magazine. Soon, however, she found herself unemployed and increasingly desperate for a steady income. She also realized during this time that the only people who wanted to see me were men who wanted to sleep with me.  That realization was underscored by her longtime friend Paramount executive Walter Wanger, who warned her that she would likely become a call girl if she remained in Hollywood. Upon hearing Wangers warning, Brooks purportedly also remembered Pabsts earlier predictions about the dire circumstances to which she would be driven if her career stalled in Hollywood: I heard his words again — hissing back to me. And listening this time, I packed my trunks and went home to Kansas.      Heeding Wangers warning, Brooks briefly returned to ": null
    },
    {
        "Wichita": "wichita, kansas"
    },
    {
        ", where she was raised, but this undesired return turned out to be another kind of hell.  I retired first to my fathers home in Wichita, she later recalled, but there I found that the citizens could not decide whether they despised me for having once been a success away from home or for now being a failure in their midst.  For her part, Brooks admitted that I wasnt exactly enchanted with them, and I must confess to a lifelong curse: My own failure as a social creature.      After an unsuccessful attempt at operating a dance studio, she returned to New York City. Following brief stints there as a radio actor in ": null
    },
    {
        "soap operas": "soap operas"
    },
    {
        " and a gossip columnist, she worked as a ": null
    },
    {
        "salesgirl": "retail clerk"
    },
    {
        " in a ": null
    },
    {
        "Saks Fifth Avenue": "saks fifth avenue"
    },
    {
        " store in Manhattan. Between 42 and 42 Brooks embarked upon a career as a ": null
    },
    {
        "courtesan": "courtesan"
    },
    {
        " with a few select wealthy men as clients. As her finances eroded, an impoverished Brooks began working regularly for an ": null
    },
    {
        "escort agency": "escort agency"
    },
    {
        " in New York. Recalling this difficult period in her memoirs, Brooks wrote that she frequently pondered suicide:          She spent subsequent years drinking and escorting while subsisting in obscurity and poverty in a small New York apartment. By this time, all of her rich and famous friends had forgotten her.  Angered by this ostracization, she attempted to write a tell-all memoir titled Naked on My Goat, a title drawn from ": null
    },
    {
        "Goethe": "goethe"
    },
    {
        "s novel  Faust . After working on that autobiography for years, she destroyed the entire manuscript by throwing it into an incinerator. As time passed, she increasingly drank more and continued to suffer from suicidal tendencies.            In the early 42s, French film historians such as ": null
    },
    {
        "Henri Langlois": "henri langlois"
    },
    {
        " rediscovered Brooks films, proclaiming her an unparalleled actress who surpassed even ": null
    },
    {
        "Marlene Dietrich": "marlene dietrich"
    },
    {
        " and ": null
    },
    {
        "Greta Garbo": "greta garbo"
    },
    {
        " as a film icon, much to her purported amusement. This rediscovery led to Louise Brooks film revivals and rehabilitated her reputation in her home country.     During this time, ": null
    },
    {
        "James Card": "james card"
    },
    {
        ", the film curator for the ": null
    },
    {
        "George Eastman House": "george eastman house"
    },
    {
        ", discovered Brooks living as a recluse in New York City. He persuaded her in 42 to move to ": null
    },
    {
        "Rochester, New York": "rochester, monroe county, new york"
    },
    {
        ", to be near the George Eastman House film collection where she could study cinema and write about her past career. With Cards assistance, she became a noted film writer. Although Brooks had been a heavy drinker since the age of 42 she remained relatively sober to begin writing perceptive essays on cinema in film magazines, which became her second career.      In her later years, Brooks rarely granted interviews yet had special relationships with film historians ": null
    },
    {
        "John Kobal": "john kobal"
    },
    {
        " and ": null
    },
    {
        "Kevin Brownlow": "kevin brownlow"
    },
    {
        ". In the 42s, she was interviewed extensively on film for the documentaries  Memories of Berlin: The Twilight of Weimar Culture  , produced and directed by ": null
    },
    {
        "Gary Conklin": "gary conklin"
    },
    {
        ", and  Hollywood  , by Brownlow and ": null
    },
    {
        "David Gill": "david gill"
    },
    {
        ". Lulu in Berlin is another rare filmed interview, produced by ": null
    },
    {
        "Richard Leacock": "richard leacock"
    },
    {
        " and Susan Woll, released a year before her death but filmed a decade earlier. In 42 she was profiled by the film writer ": null
    },
    {
        "Kenneth Tynan": "kenneth tynan"
    },
    {
        " in his essay The Girl in the Black Helmet , the title an allusion to her bobbed hair, worn since childhood. In 42 writer ": null
    },
    {
        "Tom Graves": "tom graves"
    },
    {
        " was allowed into Brooks small apartment for an interview, and later wrote about the often awkward and tense conversation in his article My Afternoon with Louise Brooks .       On August 42 42 after suffering from ": null
    },
    {
        "arthritis": "arthritis"
    },
    {
        " and ": null
    },
    {
        "emphysema": "emphysema"
    },
    {
        " for many years, Brooks died of a ": null
    },
    {
        "heart attack": "heart attack"
    },
    {
        " in her apartment in ": null
    },
    {
        "Rochester, New York": "rochester, new york"
    },
    {
        ". She had no survivors and was buried in ": null
    },
    {
        "Holy Sepulchre Cemetery": "holy sepulchre cemetery"
    },
    {
        " in Rochester.              In the summer of 42 Brooks married ": null
    },
    {
        "Eddie Sutherland": "a. edward sutherland"
    },
    {
        ", the director of the film she made with ": null
    },
    {
        "W. C. Fields": "w. c. fields"
    },
    {
        ", but by 42 had become infatuated with ": null
    },
    {
        "George Preston Marshall": "george preston marshall"
    },
    {
        ", owner of a chain of laundries and future owner of the ": null
    },
    {
        "Washington Redskins": "washington redskins"
    },
    {
        " football team, following a chance meeting with him that she later referred to as the most fateful encounter of my life . She divorced Sutherland, mainly due to her budding relationship with Marshall, in June 42 Sutherland was purportedly extremely distraught when Brooks divorced him and, on the first night after their separation, he attempted to take his life with an overdose of sleeping pills.     Throughout the late 42s and early 42s, Brooks continued her on-again, off-again relationship with George Preston Marshall which she later described as abusive. Marshall was purportedly her frequent bedfellow and constant adviser between 42 and 42  Marshall repeatedly asked her to marry him but, after learning that she had had many affairs while they were together and believing her to be incapable of fidelity, he married film actress ": null
    },
    {
        "Corinne Griffith": "corinne griffith"
    },
    {
        " instead.          In 42 Brooks sued the New York glamour photographer ": null
    },
    {
        "John de Mirjian": "john de mirjian"
    },
    {
        " to prevent publication of his risque studio portraits of her; the lawsuit made him notorious.      In 42 she married Chicago millionaire ": null
    },
    {
        "Deering Davis": "deering davis"
    },
    {
        ", a son of ": null
    },
    {
        "Nathan Smith Davis, Jr.": "nathan smith davis, jr."
    },
    {
        ", but abruptly left him in March 42 after only five months of marriage, without a good-bye ... and leaving only a note of her intentions behind her. According to Card, Davis was just another elegant, well-heeled admirer , nothing more. The couple officially divorced in 42     In her later years, Brooks insisted that both her previous marriages were loveless and that she had never loved anyone in her lifetime: As a matter of fact, Ive never been in love. And if I had loved a man, could I have been faithful to him? Could he have trusted me beyond a closed door? I doubt it.  Despite her two marriages, she never had children, referring to herself as Barren Brooks . Her many paramours from years before had included a young ": null
    },
    {
        "William S. Paley": "william s. paley"
    },
    {
        ", the founder of ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ". Paley provided a small monthly ": null
    },
    {
        "stipend": "stipend"
    },
    {
        " to Brooks for the remainder of her life, and this stipend kept her from committing suicide at one point.     Sometime before 42 Brooks converted to ": null
    },
    {
        "Roman Catholicism": "roman catholicism"
    },
    {
        ".            In a 42 profile by  The New Yorker , theater critic and writer ": null
    },
    {
        "Kenneth Tynan": "kenneth tynan"
    },
    {
        " described her as the most seductive, sexual image of Woman ever committed to celluloid. Shes the only unrepentant hedonist, the only pure pleasure-seeker, I think Ive ever known.  By her own admission, Brooks was a sexually liberated woman, unafraid to experiment, even posing nude for art photography, and her liaisons with many film people were legendary, although much of it is speculation.     Brooks enjoyed fostering speculation about her sexuality, cultivating friendships with ": null
    },
    {
        "lesbian": "lesbian"
    },
    {
        " and ": null
    },
    {
        "bisexual": "bisexual"
    },
    {
        " women including ": null
    },
    {
        "Pepi Lederer": "pepi lederer"
    },
    {
        " and ": null
    },
    {
        "Peggy Fears": "peggy fears"
    },
    {
        ", but eschewing relationships. She admitted to some lesbian dalliances, including a one-night stand with ": null
    },
    {
        "Greta Garbo": "greta garbo"
    },
    {
        ". She later described Garbo as masculine but a charming and tender lover . Despite all this, she considered herself neither lesbian nor bisexual:            Following her death in 42 Brooks has had a significant legacy in novels, comics, music and film.          Brooks has inspired cinematic characters such as ": null
    },
    {
        "Sally Bowles": "sally bowles"
    },
    {
        " in ": null
    },
    {
        "Bob Fosse": "bob fosse"
    },
    {
        "s 42 film  Cabaret . For her portrayal of Bowles, ": null
    },
    {
        "Liza Minnelli": "liza minnelli"
    },
    {
        " reinvented the character with ": null
    },
    {
        "Lulu makeup": "pandoras box"
    },
    {
        " and ": null
    },
    {
        "helmet-like coiffure": "shingle bob"
    },
    {
        " based on Brooks 42s persona. Similarly, films such as ": null
    },
    {
        "Jonathan Demme": "jonathan demme"
    },
    {
        "s  Something Wild  features a reckless femme fatale  who calls herself Lulu and wears a bob, and in the 42 film  Death Becomes Her , ": null
    },
    {
        "Isabella Rosselini": "isabella rosselini"
    },
    {
        " plays Lisle von Rhoman, a character inspired by Brooks. More recently, ": null
    },
    {
        "Laura Moriarty": "laura moriarty"
    },
    {
        " wrote  The Chaperone , which depicts Brooks initial arrival in New York, plus her career decline as an actress. The film stars ": null
    },
    {
        "Haley Lu Richardson": "haley lu richardson"
    },
    {
        " and ": null
    },
    {
        "Elizabeth McGovern": "elizabeth mcgovern"
    },
    {
        ".       Brooks film persona served as the literary inspiration for ": null
    },
    {
        "Adolfo Bioy Casares": "adolfo bioy casares"
    },
    {
        " when he wrote his ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novel  The Invention of Morel  about a man attracted to Faustine, a woman who is only a projected 42-D image. In a 42 interview, Casares explained that Faustine is directly based on his love for Louise Brooks who vanished too early from the movies . Elements of The Invention of Morel, minus the science fiction elements, served as a basis for ": null
    },
    {
        "Alain Resnais": "alain resnais"
    },
    {
        "s 42 film  Last Year at Marienbad .     In ": null
    },
    {
        "Neil Gaiman": "neil gaiman"
    },
    {
        "s novel  American Gods , the character Czernobog refers to Brooks as the greatest movie star of all time. In her 42 novel of supernatural horror, Houdini Heart, ": null
    },
    {
        "Ki Longfellow": "ki longfellow"
    },
    {
        " uses Brooks as an actual character in the leading characters visions. Brooks appears as a central character in the 42 novel The Chaperone by ": null
    },
    {
        "Laura Moriarty": "laura moriarty"
    },
    {
        ". In ": null
    },
    {
        "Gayle Forman": "gayle forman"
    },
    {
        "s novels Just One Day and Just One Year, the protagonist is called Lulu because her bobbed hair resembles Brooks.       Brooks also had a significant influence in the graphics world. She inspired the long-running  Dixie Dugan  newspaper strip by ": null
    },
    {
        "John H. Striebel": "john h. striebel"
    },
    {
        ". The strip began in the late 42s and ran until 42 which grew out of the serialized novel and later stage musical, Show Girl, that writer ": null
    },
    {
        "J.P. McEvoy": "j.p. mcevoy"
    },
    {
        " had loosely based on Louises days as a ": null
    },
    {
        "Follies girl": "ziegfeld follies"
    },
    {
        " on Broadway.     Brooks also inspired the erotic comic books of  Valentina , by the late ": null
    },
    {
        "Guido Crepax": "guido crepax"
    },
    {
        ", which began publication in 42 and continued for many years. Crepax became a friend and regular correspondent with Louise late in her life. ": null
    },
    {
        "Hugo Pratt": "hugo pratt"
    },
    {
        ", another comics artist, also used her as inspiration for characters, and even named them after her.     Other comics have drawn upon Brooks distinctive hair-style. Brooks was the visual model for the character of Ivy Pepper in Tracy Butlers  Lackadaisy  comic series. More recently, illustrator ": null
    },
    {
        "Rick Geary": "rick geary"
    },
    {
        " published a 42 graphic novel entitled Louise Brooks: Detective in which Brooks, her movie career having sputtered to a stop, returns to her native Kansas and becomes a private investigator who solves murders.       Brooks has been referenced in a number of songs. In 42 British ": null
    },
    {
        "new wave": "new wave music"
    },
    {
        " group ": null
    },
    {
        "Orchestral Manoeuvres in the Dark": "orchestral manoeuvres in the dark"
    },
    {
        " released ": null
    },
    {
        "Pandoras Box": "pandoras box"
    },
    {
        " as a tribute to Brooks film. Similarly, ": null
    },
    {
        "Soul Coughing": "soul coughing"
    },
    {
        "s 42 song St. Louise Is Listening contains several references to Brooks, and the song Interior Lulu released the next year by ": null
    },
    {
        "Marillion": "marillion"
    },
    {
        " is a reference to Brooks and mentions her in its first lines.     In 42 American metal group ": null
    },
    {
        "Metallica": "metallica"
    },
    {
        " and singer-songwriter ": null
    },
    {
        "Lou Reed": "lou reed"
    },
    {
        " released the double album  Lulu  with a Brooks-like mannequin on the cover. And, more recently, ": null
    },
    {
        "Natalie Merchant": "natalie merchant"
    },
    {
        "s self-titled 42 album, the song Lulu is a biographical portrait of Brooks.       As is the case with many of her contemporaries, a number of Brooks films are considered to be lost. Her key films survive, however, particularly Pandoras Box and Diary of a Lost Girl, which have been released on DVD in North America by the ": null
    },
    {
        "Criterion Collection": "criterion collection"
    },
    {
        " and ": null
    },
    {
        "Kino Video": "kino video"
    },
    {
        ", respectively.     As of 42 Miss Europe and The Show Off have also seen limited North American DVD release. Her short film Windy Riley Goes Hollywood was included on the DVD release of Diary of a Lost Girl. Her final film, Overland Stage Raiders, was released on VHS and then in 42 on DVD.     ": null
    }
]