[
    {
        "        Louis I, also Louis the Great ; or Louis the Hungarian , was ": null
    },
    {
        "King of Hungary": "king of hungary"
    },
    {
        " and ": null
    },
    {
        "Croatia": "king of croatia"
    },
    {
        " from 42 and ": null
    },
    {
        "King of Poland": "king of poland"
    },
    {
        " from 42 He was the first child of ": null
    },
    {
        "Charles I of Hungary": "charles i of hungary"
    },
    {
        " and his wife, ": null
    },
    {
        "Elizabeth of Poland": "elizabeth of poland, queen of hungary"
    },
    {
        ", to survive infancy. A 42 treaty between his father and ": null
    },
    {
        "Casimir III of Poland": "casimir iii of poland"
    },
    {
        ", Louiss maternal uncle, confirmed Louiss right to inherit the ": null
    },
    {
        "Kingdom of Poland": "kingdom of poland"
    },
    {
        " if his uncle died without a son. In exchange, Louis was obliged to assist his uncle to reoccupy the lands that Poland had lost in previous decades. He bore the title of ": null
    },
    {
        "Duke of Transylvania": "duke of transylvania"
    },
    {
        " between 42 and 42 but did not administer the province.     Louis was of age when he succeeded his father in 42 but his deeply religious mother exerted a powerful influence on him. He inherited a centralized kingdom and a rich treasury from his father. During the first years of his reign, Louis launched a ": null
    },
    {
        "crusade": "northern crusades"
    },
    {
        " against the ": null
    },
    {
        "Lithuanians": "lithuanians"
    },
    {
        " and restored royal power in ": null
    },
    {
        "Croatia": "kingdom of croatia"
    },
    {
        "; his troops defeated a ": null
    },
    {
        "Tatar": "tatars"
    },
    {
        " army, expanding his authority towards the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        ". When his brother, ": null
    },
    {
        "Andrew, Duke of Calabria": "andrew, duke of calabria"
    },
    {
        ", husband of Queen ": null
    },
    {
        "Joanna I of Naples": "joanna i of naples"
    },
    {
        ", was assassinated in 42 Louis accused the queen of his murder and punishing her became the principal goal of his foreign policy. He launched two campaigns to the ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        " between 42 and 42 His troops occupied large territories on both occasions, and Louis adopted the styles of ": null
    },
    {
        "Neapolitan sovereigns": "king of naples"
    },
    {
        " , but the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " never recognized his claim. Louiss arbitrary acts and atrocities committed by his mercenaries made his rule unpopular in ": null
    },
    {
        "Southern Italy": "southern italy"
    },
    {
        ". He withdrew all his troops from the Kingdom of Naples in 42     Like his father, Louis administered Hungary with absolute power and used ": null
    },
    {
        "royal prerogative": "royal prerogative"
    },
    {
        "s to grant privileges to his courtiers. However, he also confirmed the liberties of the ": null
    },
    {
        "Hungarian nobility": "hungarian nobility"
    },
    {
        " at the ": null
    },
    {
        "Diet": "diet of hungary"
    },
    {
        " of 42 emphasizing the equal status of all noblemen. At the same Diet, he introduced an ": null
    },
    {
        "entail": "fee tail"
    },
    {
        " system and a uniform rent payable by the peasants to the landowners, and confirmed the right to free movement for all peasants. He waged wars against the Lithuanians, ": null
    },
    {
        "Serbia": "serbian empire"
    },
    {
        ", and the ": null
    },
    {
        "Golden Horde": "golden horde"
    },
    {
        " in the 42s, restoring the authority of Hungarian monarchs over territories along frontiers that had been lost during previous decades. He forced the ": null
    },
    {
        "Republic of Venice": "republic of venice"
    },
    {
        " to renounce the ": null
    },
    {
        "Dalmatia": "dalmatia"
    },
    {
        "n towns in 42 He also made several attempts to expand his suzerainty over the rulers of ": null
    },
    {
        "Bosnia": "banate of bosnia"
    },
    {
        ", ": null
    },
    {
        "Moldavia": "principality of moldavia"
    },
    {
        ", ": null
    },
    {
        "Wallachia": "principality of wallachia"
    },
    {
        ", and parts of ": null
    },
    {
        "Bulgaria": "second bulgarian empire"
    },
    {
        " and Serbia. These rulers were sometimes willing to yield to him, either under duress or in the hope of support against their internal opponents, but Louiss rule in these regions was only nominal during most of his reign. His attempts to convert his pagan or Orthodox subjects to Catholicism made him unpopular in the Balkan states. Louis established a university in ": null
    },
    {
        "Pécs": "pécs"
    },
    {
        " in 42 but it was closed within two decades because he did not arrange for sufficient revenues to maintain it.     Louis inherited Poland after his uncles death in 42 Since he had no sons, he wanted his subjects to acknowledge the right of his daughters to succeed him in both Hungary and Poland. For this purpose, he issued the ": null
    },
    {
        "Privilege of Koszyce": "privilege of koszyce"
    },
    {
        " in 42 spelling out the liberties of ": null
    },
    {
        "Polish noblemen": "polish noblemen"
    },
    {
        ". However, his rule remained unpopular in Poland. In Hungary, he authorized the ": null
    },
    {
        "royal free cities": "royal free cities"
    },
    {
        " to delegate jurors to the high court hearing their cases and set up a new high court. Suffering from a ": null
    },
    {
        "skin disease": "skin disease"
    },
    {
        ", Louis became even more religious during the last years of his life. At the beginning of the ": null
    },
    {
        "Western Schism": "western schism"
    },
    {
        ", he acknowledged ": null
    },
    {
        "Urban VI": "urban vi"
    },
    {
        " as the legitimate ": null
    },
    {
        "pope": "pope"
    },
    {
        ". After Urban deposed Joanna and put Louiss relative ": null
    },
    {
        "Charles of Durazzo": "charles iii of naples"
    },
    {
        " on the throne of Naples, Louis helped Charles occupy the kingdom. In Hungarian historiography, Louis was regarded for centuries as the most powerful Hungarian monarch who ruled over an empire whose shores were washed by three seas .            Born on 42 March 42 Louis was the third son of ": null
    },
    {
        "Charles I of Hungary": "charles i of hungary"
    },
    {
        " and his wife, ": null
    },
    {
        "Elizabeth of Poland": "elizabeth of poland, queen of hungary"
    },
    {
        ". He was named for his fathers uncle, ": null
    },
    {
        "Louis": "louis of toulouse"
    },
    {
        ", ": null
    },
    {
        "Bishop of Toulouse": "bishop of toulouse"
    },
    {
        ", ": null
    },
    {
        "canonized": "canonized"
    },
    {
        " in 42 The first-born son of his parents, Charles, died before Louis was born. Louis became his fathers heir after the death of his brother Ladislaus in 42     He had a liberal education by the standards of his age and learned French, German and Latin. He showed a special interest in history and ": null
    },
    {
        "astrology": "astrology"
    },
    {
        ". A cleric from ": null
    },
    {
        "Wrocław": "wrocław"
    },
    {
        ", Nicholas, taught him the basic principles of Christian faith. However, Louiss religious zeal was due to his mothers influence. In a royal charter, Louis remembered that in his childhood, a knight of the royal court, Peter Poháros, often carried him on his shoulders. His two tutors, ": null
    },
    {
        "Nicholas Drugeth": "nicholas drugeth"
    },
    {
        " and Nicholas Knesich, saved the lives of both Louis and his younger brother, ": null
    },
    {
        "Andrew": "andrew, duke of calabria"
    },
    {
        ", when ": null
    },
    {
        "Felician Záh": "felician záh"
    },
    {
        " attempted to assassinate the royal family in ": null
    },
    {
        "Visegrád": "visegrád"
    },
    {
        " on 42 April 42     Louis was only nine when he stamped a treaty of alliance between his father and ": null
    },
    {
        "John of Bohemia": "john of bohemia"
    },
    {
        ". A year later, Louis accompanied his father in invading ": null
    },
    {
        "Austria": "duchy of austria"
    },
    {
        ". On 42 March 42 John of Bohemias son and heir, ": null
    },
    {
        "Charles": "charles iv, holy roman emperor"
    },
    {
        ", ": null
    },
    {
        "Margrave of Moravia": "margrave of moravia"
    },
    {
        ", signed a new treaty with Charles I of Hungary and Louis in ": null
    },
    {
        "Visegrád": "visegrád"
    },
    {
        ". According to the treaty, Charles of Moravia acknowledged the right of Charles Is sons to succeed their maternal uncle, ": null
    },
    {
        "Casimir III of Poland": "casimir iii of poland"
    },
    {
        ", if Casimir died without a male issue. Louis also pledged that he would marry the margraves three-year-old daughter, ": null
    },
    {
        "Margaret": "margaret of bohemia, queen of hungary"
    },
    {
        ".     Casimir IIIs first wife, ": null
    },
    {
        "Aldona of Lithuania": "aldona of lithuania"
    },
    {
        ", died on 42 May 42 Two leading ": null
    },
    {
        "Polish noblemen": "szlachta"
    },
    {
        "Zbigniew, chancellor of Cracow, and ": null
    },
    {
        "Spycimir Leliwita": "spycimir leliwita"
    },
    {
        "persuaded Casimir, who had not fathered a son, to make his sister, Elizabeth, and her offspring his heirs. According to the 42th-century ": null
    },
    {
        "Jan Długosz": "jan długosz"
    },
    {
        ", Casimir held a ": null
    },
    {
        "general sejm": "general sejm"
    },
    {
        " in ": null
    },
    {
        "Cracow": "cracow"
    },
    {
        " where the assembled prelates and nobles The Annals of Jan Długosz , p. 42 proclaimed Louis as Casimirs heir, but the reference to the sejm is anachronistic. Historian Paul W. Knoll writes that Casimir preferred his sisters family to his own daughters or a member of a ": null
    },
    {
        "cadet branch": "cadet branch"
    },
    {
        " of the ": null
    },
    {
        "Piast dynasty": "piast dynasty"
    },
    {
        ", because he wanted to ensure the king of Hungarys support against the ": null
    },
    {
        "Teutonic Knights": "teutonic knights"
    },
    {
        ". Louiss father and uncle signed a treaty in ": null
    },
    {
        "Visegrád": "visegrád"
    },
    {
        " in July whereby Casimir III made Louis his heir if he died without a son. In exchange, Charles I pledged that Louis would reoccupy ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        " and other Polish lands lost to the ": null
    },
    {
        "Teutonic Order": "teutonic order"
    },
    {
        " without Polish funds and would only employ Poles in the royal administration in Poland.     Louis received the title of ": null
    },
    {
        "Duke of Transylvania": "duke of transylvania"
    },
    {
        " from his father in 42 but he did not administer the province. According to a royal charter from the same year, Louiss bride, ": null
    },
    {
        "Margaret of Bohemia": "margaret of bohemia, queen of hungary"
    },
    {
        ", lived in the Hungarian royal court. Louiss separate ducal court was first mentioned in a royal charter of 42                Charles I died on 42 July 42 Five days later, ": null
    },
    {
        "Csanád Telegdi": "csanád telegdi"
    },
    {
        ", Archbishop of ": null
    },
    {
        "Esztergom": "archdiocese of esztergom"
    },
    {
        ", crowned Louis king with the ": null
    },
    {
        "Holy Crown of Hungary": "holy crown of hungary"
    },
    {
        " in ": null
    },
    {
        "Székesfehérvár": "székesfehérvár"
    },
    {
        ". Although Louis had attained the age of majority, his mother Elizabeth acted as a sort of co-regent for decades, because she exerted a powerful influence on him. Louis inherited a rich treasury from his father, who had strengthened royal authority and ruled without holding ": null
    },
    {
        "Diets": "diet of hungary"
    },
    {
        " during the last decades of his reign.     Louis introduced a new system of land grants, excluding the grantees brothers and other kinsmen from the donation in contrast with customary law: such estates ": null
    },
    {
        "escheat": "escheat"
    },
    {
        "ed to the Crown if the grantees last male descendants died. On the other hand, Louis often ": null
    },
    {
        "promoted a daughter to a son": "prefection"
    },
    {
        " , that is authorized a daughter to inherit her fathers estates, although customary law prescribed that the landed property of a deceased nobleman who had no sons was to be inherited by his kinsmen. Louis often granted this privilege to the wives of his favorites. Louis also frequently ": null
    },
    {
        "authorized landowners to apply capital punishment": "jus gladii"
    },
    {
        " in their estates, limiting the authority of the magistrates of the ": null
    },
    {
        "counties": "county"
    },
    {
        ".     ": null
    },
    {
        "William Drugeth": "william drugeth"
    },
    {
        ", an influential advisor of Louiss late father, died in September 42 He bequeathed his landed property to his brother, Nicholas, but Louis confiscated those estates. In late autumn, Louis dismissed his fathers ": null
    },
    {
        "Voivode of Transylvania": "voivode of transylvania"
    },
    {
        ", ": null
    },
    {
        "Thomas Szécsényi": "thomas szécsényi"
    },
    {
        ", although Szécsényis wife was a distant cousin of the ": null
    },
    {
        "queen mother": "queen mother"
    },
    {
        ". Louis especially favored the ": null
    },
    {
        "Lackfi": "lackfi"
    },
    {
        "s: eight members of the family held high offices during his reign. ": null
    },
    {
        "Andrew Lackfi": "andrew lackfi"
    },
    {
        " was the commander of the royal army during the first war of Louiss reign. In late 42 or early 42 he invaded ": null
    },
    {
        "Serbia": "serbian empire"
    },
    {
        " and restored the ": null
    },
    {
        "Banate of Macsó": "banate of macsó"
    },
    {
        ", which had been lost during his fathers reign.     ": null
    },
    {
        "Robert the Wise": "robert the wise"
    },
    {
        ", ": null
    },
    {
        "King of Naples": "king of naples"
    },
    {
        ", died on 42 January 42 In his ": null
    },
    {
        "testament": "will and testament"
    },
    {
        ", he declared his granddaughter, ": null
    },
    {
        "Joanna I": "joanna i of naples"
    },
    {
        ", his sole heir, excluding Louiss younger brother, Andrew, Joannas husband, from becoming co-ruler. Louis and his mother regarded this as an infringement of a previous agreement between the late kings of Naples and Hungary. He visited his brides father, ": null
    },
    {
        "Charles of Moravia": "charles iv, holy roman emperor"
    },
    {
        ", in ": null
    },
    {
        "Prague": "prague"
    },
    {
        " to persuade him to intervene on Andrews behalf with Charless former tutor, ": null
    },
    {
        "Pope Clement VI": "pope clement vi"
    },
    {
        ", the overlord of the ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        ". Louis also sent envoys to his Neapolitan relatives and the high officials of the kingdom, urging them to promote his brothers interests. Their mother, Elizabeth, left for Naples in the summer, taking with her almost the whole royal treasure, including more than  of silver and  of gold. During her seven-month-long stay in Italy, she was only able to persuade her daughter-in-law and the pope to promise that Andrew would be crowned as Joannas husband.     According to the nearly contemporaneous chronicle of ": null
    },
    {
        "John of Küküllő": "john of küküllő"
    },
    {
        ", Louis launched his first campaign against a group of ": null
    },
    {
        "Transylvanian Saxons": "transylvanian saxons"
    },
    {
        ", who had refused to pay taxes, and forced them to yield in the summer of 42 During his stay in Transylvania, ": null
    },
    {
        "Nicholas Alexander": "nicholas alexander of wallachia"
    },
    {
        "who was the son of ": null
    },
    {
        "Basarab": "basarab i of wallachia"
    },
    {
        ", the ruling ": null
    },
    {
        "prince of Wallachia": "prince of wallachia"
    },
    {
        "swore loyalty to Louis on his fathers behalf in ": null
    },
    {
        "Brassó": "brașov"
    },
    {
        " ; thus the suzerainty of the Hungarian monarchs over ": null
    },
    {
        "Wallachia": "wallachia"
    },
    {
        " was, at least outwardly, restored.     Louis joined a ": null
    },
    {
        "crusade": "northern crusades"
    },
    {
        " against the pagan ": null
    },
    {
        "Lithuanians": "lithuanians"
    },
    {
        " in December 42 The crusadersincluding ": null
    },
    {
        "John of Bohemia": "john of bohemia"
    },
    {
        ", Charles of Moravia, ": null
    },
    {
        "Peter of Bourbon": "peter i, duke of bourbon"
    },
    {
        ", and ": null
    },
    {
        "William of Hainaut and Holland": "william ii, count of hainaut"
    },
    {
        " laid siege to ": null
    },
    {
        "Vilnius": "vilnius"
    },
    {
        ". However, a Lithuanian invasion of the lands of the Teutonic Knights forced them to lift the siege. Louis returned to Hungary in late February 42 He dispatched Andrew Lackfi to invade the lands of the ": null
    },
    {
        "Golden Horde": "golden horde"
    },
    {
        " in retaliation for the ": null
    },
    {
        "Tatars": "tatars"
    },
    {
        " earlier plundering raids against Transylvania and the ": null
    },
    {
        "Szepesség": "szepesség"
    },
    {
        " . Lackfi and his army of mainly ": null
    },
    {
        "Székely": "székelys"
    },
    {
        " warriors inflicted a defeat on a large Tatar army. Thereafter the Golden Hordes control of the lands between the ": null
    },
    {
        "Eastern Carpathians": "eastern carpathians"
    },
    {
        " and the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        " weakened. A conflict between Louiss uncle and father-in-law led to a war between Poland and Bohemia in April. In this war Louis supported his uncle with reinforcements in accordance with the agreement of 42     While Louiss armies were fighting in Poland and against the Tatars, Louis marched to ": null
    },
    {
        "Croatia": "kingdom of croatia"
    },
    {
        " in June 42 and besieged ": null
    },
    {
        "Knin": "knin"
    },
    {
        ", the former seat of the late ": null
    },
    {
        "Ivan Nelipac": "ivan i nelipac"
    },
    {
        ", who had successfully resisted Louiss father, forcing his widow and son to surrender. The ": null
    },
    {
        "Counts of Corbavia": "kurjaković family"
    },
    {
        " and other Croatian noblemen also yielded to him during his stay in Croatia. The citizens of ": null
    },
    {
        "Zadar": "zadar"
    },
    {
        " rebelled against the ": null
    },
    {
        "Republic of Venice": "republic of venice"
    },
    {
        " and accepted his suzerainty. Louis meanwhile returned to ": null
    },
    {
        "Visegrád": "visegrád"
    },
    {
        ". He dispatched ": null
    },
    {
        "Stephen II, Ban of Bosnia": "stephen ii, ban of bosnia"
    },
    {
        ", to assist the burghers of Zadar, but the ban did not fight against the Venetians. ": null
    },
    {
        "Privilege of Kassa": "privilege of koszyce"
    },
    {
        "                   Louiss brother Andrew was murdered in ": null
    },
    {
        "Aversa": "aversa"
    },
    {
        " on 42 September 42 Louis and his mother accused Queen Joanna I, ": null
    },
    {
        "Prince Robert of Taranto": "robert, prince of taranto"
    },
    {
        ", ": null
    },
    {
        "Duke Charles of Durazzo": "charles, duke of durazzo"
    },
    {
        ", and other members of the Neapolitan branches of the ": null
    },
    {
        "Capetian House of Anjou": "capetian house of anjou"
    },
    {
        " of plotting against Andrew. In his letter of 42 January 42 to ": null
    },
    {
        "Pope Clement VI": "pope clement vi"
    },
    {
        ", Louis demanded that the pope dethrone the husband-killer queen in favor of ": null
    },
    {
        "Charles Martel": "charles martel, duke of calabriason of joanna i of naples"
    },
    {
        ", her infant son by Andrew. Louis also laid claim to the regency of the kingdom during the minority of his nephew, referring to his patrilinear descent from the ": null
    },
    {
        "first-born son": "charles martel of anjou"
    },
    {
        " of Robert the Wises father, ": null
    },
    {
        "Charles II of Naples": "charles ii of naples"
    },
    {
        ". He even promised to increase the amount of yearly tribute that the kings of Naples would pay to the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        ". After the pope failed to fully investigate Andrews murder, Louis decided to invade southern Italy. In preparation for the invasion, he sent his envoys to ": null
    },
    {
        "Ancona": "ancona"
    },
    {
        " and other Italian towns before summer 42     ": null
    }
]