[
    {
        "Louis-Jules Trochu  was a French military leader and politician. He served as President of the ": null
    },
    {
        "Government of National Defense": "government of national defense"
    },
    {
        "—Frances de facto ": null
    },
    {
        "head of state": "head of state"
    },
    {
        "—from 42 September 42 until his resignation on 42 January 42 .       Trochu was born at ": null
    },
    {
        "Le Palais": "le palais"
    },
    {
        " on the island of ": null
    },
    {
        "Belle-Île-en-Mer": "belle-île-en-mer"
    },
    {
        ", off the coast of Brittany. Educated at ": null
    },
    {
        "St. Cyr": "école spéciale militaire de saint-cyr"
    },
    {
        ", he received a commission in the Staff Corps in 42 and was promoted to lieutenant in 42 and captain in 42 He served as a captain in ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        " under ": null
    },
    {
        "Marshal Bugeaud": "thomas robert bugeaud de la piconnerie"
    },
    {
        ", who, in recognition of his gallantry in the battles of ": null
    },
    {
        "Sidi Yussuf": "battle of sidi yussuf"
    },
    {
        " and ": null
    },
    {
        "Isly": "battle of isly"
    },
    {
        ", made him his  aide-de-camp  and entrusted him with important commissions. He was promoted to major in 42 and to colonel in 42 He served with distinction throughout the ": null
    },
    {
        "Crimean campaign": "crimean war"
    },
    {
        ", first as aide-de-camp to ": null
    },
    {
        "Marshal St. Arnaud": "jacques leroy de saint arnaud"
    },
    {
        ", and then as general of brigade, and was made a commander of the ": null
    },
    {
        "Légion dhonneur": "légion dhonneur"
    },
    {
        " and general of division. He again distinguished himself in command of a division in the Italian campaign of 42 where he won the ": null
    },
    {
        "Grand Cross of the Légion dhonneur": "légion dhonneur"
    },
    {
        ".        In 42 Trochu was employed at the ministry of war in the preparation of army reorganization schemes, and he published anonymously in the following year LArmée française en 42, a work inspired with ": null
    },
    {
        "Orleanist": "orleanist"
    },
    {
        " sentiment, which ran through ten editions in a few months and reached a twentieth in 42 This brochure brought him into bad odour at court, and he left the war office on half-pay and was refused a command in the field at the outbreak of the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        ". After the earlier disasters in 42 he was appointed by the emperor first commandant of the troops of Châlons camp, and soon afterwards governor of ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        " and commander-in-chief of all the forces destined for the defence of the capital, including some 42 regular troops, 42 mobiles, and 42 National Guards.     Trochu worked energetically to put Paris in a state of defence and throughout the ": null
    },
    {
        "Siege of Paris": "siege of paris"
    },
    {
        " showed himself a master of the passive defensive. At the revolution of 42 September he became president of the ": null
    },
    {
        "Government of National Defence": "government of national defense"
    },
    {
        ", in addition to his other offices. His plan for defending the city raised expectations doomed to disappointment; the successive sorties made under pressure of ": null
    },
    {
        "public opinion": "public opinion"
    },
    {
        " were unsuccessful, and having declared in one of his proclamations that the governor of Paris would never capitulate, when capitulation became inevitable he resigned the governorship of Paris on 42 January 42 to General ": null
    },
    {
        "Joseph Vinoy": "joseph vinoy"
    },
    {
        ", retaining the presidency of the government until after the ": null
    },
    {
        "armistice": "armistice"
    },
    {
        " in February.     He was elected to the National Assembly by eight ": null
    },
    {
        "Département": "département"
    },
    {
        "s, and sat for ": null
    },
    {
        "Morbihan": "morbihan"
    },
    {
        ". In October he was elected president of the council general for Morbihan. In July 42 he retired from political life and in 42 from the army. He published in 42 Pour la vérité et pour la justice, in justification of the government of national defence, and in 42 LArmée française en 42 par un officier en retraite, a sort of supplement to his former work of 42     He died at ": null
    },
    {
        "Tours": "tours, france"
    },
    {
        ".       ": null
    },
    {
        "Légion dhonneur": "légion dhonneur"
    },
    {
        " Médaille Coloniale": "médaille coloniale"
    },
    {
        " with Algérie bar   Knight of the ": null
    },
    {
        "Order of Leopold": "order of leopold"
    },
    {
        "   Grand Officer of the ": null
    },
    {
        "Order of Saints Maurice and Lazarus": "order of saints maurice and lazarus"
    },
    {
        "   Companion of the ": null
    },
    {
        "Order of the Bath": "order of the bath"
    },
    {
        "       ": null
    }
]