[
    {
        "           Rabbi": "rabbi"
    },
    {
        " Louis Ginzberg  was a ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        "ist and leading figure in the ": null
    },
    {
        "Conservative Movement": "conservative judaism"
    },
    {
        " of ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " of the twentieth century. He was born on November 42 42 in ": null
    },
    {
        "Kaunas": "kaunas"
    },
    {
        ", ": null
    },
    {
        "Vilna Governorate": "vilna governorate"
    },
    {
        " ; he died on November 42 42 in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ".            Ginzberg was born into a religious family whose piety and erudition was well known. The family traced its ": null
    },
    {
        "lineage": "lineage"
    },
    {
        " back to the revered talmudist, halachist, and kabbalist ": null
    },
    {
        "Gaon of Vilna": "vilna gaon"
    },
    {
        ". Ginzberg sought to emulate the Vilna Gaons intermingling of academic knowledge in Torah studies under the label historical Judaism; for example, in his book Students, Scholars and Saints, Ginzberg quotes the Vilna Gaon instructing, Do not regard the views of the ": null
    },
    {
        "Shulchan Aruch": "shulchan aruch"
    },
    {
        " as binding if you think that they are not in agreement with those of the Talmud.     He writes in his memoirs that he felt saddened that he had grieved his father, as he recognized that his pious father was disappointed that his son had chosen a more liberal path with regards to Jewish law opposed contrasted to those of his forefathers.     Ginzberg first arrived in America in 42 unsure where he belonged or what he should pursue. Almost immediately, he accepted a position at ": null
    },
    {
        "Hebrew Union College": "hebrew union college"
    },
    {
        " and subsequently wrote articles for the  Jewish Encyclopedia . Still, he had not found his niche.       In 42 he began teaching at the ": null
    },
    {
        "Jewish Theological Seminary of America": "jewish theological seminary of america"
    },
    {
        " in New York City, where he taught until his death. Throughout his life, all of his works were infused with the belief that Judaism and Jewish history could not be understood properly without a firm grasp of ": null
    },
    {
        "Halakhah": "halakhah"
    },
    {
        ". Instead of just studying Halakha, Louis Ginzberg wrote ": null
    },
    {
        "responsa": "responsa"
    },
    {
        ", formal responses to questions of Jewish law.     Many of Ginzbergs Orthodox Jewish peers had deep reservations about his choice to work at JTS. The seminary explicitly encouraged its faculty and students to study ": null
    },
    {
        "rabbinical literature": "rabbinical literature"
    },
    {
        " within its social and historical context; this was sometimes known as Wissenschaft, or the scientific study of Judaism. As a result of this, most Orthodox Jews viewed his works as unacceptable, and virtually none refer to them, much less rely on them, today.     On account of his impressive scholarship in Jewish studies, Ginzberg was one of sixty scholars honored with a doctorate by ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        " in celebration of its tercentenary. Ginzbergs knowledge warranted him the expert to defend Judaism both in national and international affairs. In 42 he defended the Jewish community against anti-Semitic accusations that Jews ritually slaughtered gentiles. In 42 ": null
    },
    {
        "Louis Marshall": "louis marshall"
    },
    {
        " requested that Ginzberg refute a blood libel charge in Kiev based on Jewish sources.       Ginzberg began teaching Talmud at the Jewish Theological Seminary from its reorganization in 42 until his death in 42 For fifty years he trained two generations of future ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        " rabbis. During his era, Ginzberg influenced almost every rabbi of the Conservative Movement in a personal way. For some, Louis Ginzberg serves as a role model even today. Todays leading Conservative ": null
    },
    {
        "posek": "posek"
    },
    {
        " in Israel, Rabbi ": null
    },
    {
        "David Golinkin": "david golinkin"
    },
    {
        ", has written profusely on Louis Ginzberg. Golinkin has recently published a collection of responsa containing 42 questions answered by Ginzberg.     In the opening address, Ginzberg spoke of the need to keep Conservative Jewry under the ": null
    },
    {
        "rubric": "rubric"
    },
    {
        " of ": null
    },
    {
        "Halakhah": "halakhah"
    },
    {
        ". The conception that in religious matters anyone, however ignorant, can judge for himself, is the direct denial of the old Jewish ": null
    },
    {
        "maxim": "maxim"
    },
    {
        ", The ignorant cannot be pious … The majority vote of a Board of Directors of a synagogue is, after all, a negligible quantity when it is in opposition to the vote of historical Judaism with its myriad of Saints and thousands of Sages…The sorting, distributing, selecting, harmonizing and completing can only be done by experienced hands. Ginzbergs initiative to base halakhic decisions on law committees and not laymen is the method the Conservative movement describes as its present one till today.     In 42 at the Sixth Annual Convention, Ginzberg, as the acting president, declared that ": null
    },
    {
        "United Synagogue of Conservative Judaism": "united synagogue of conservative judaism"
    },
    {
        " stood for historical Judaism and thus elaborates:     Now let us understand the exact meaning of the expression historical Judaism…Looking at Judaism from a historical point of view, we become convinced that there is no one aspect deep enough to exhaust the content of such a complex phenomenon as Judaism…Accordingly, Torah-less Judaism… would be an entirely new thing and not the continuation of something given…       One of his ": null
    },
    {
        "responsa": "responsa"
    },
    {
        " concerns the use of wine in the Jewish community during the ": null
    },
    {
        "Prohibition era": "prohibition in the united states"
    },
    {
        ". The ": null
    },
    {
        "Eighteenth Amendment to the United States Constitution": "eighteenth amendment to the united states constitution"
    },
    {
        ", ": null
    },
    {
        "ratified": "ratification"
    },
    {
        " on January 42 42 declared that the manufacture, sale, or transportation of ": null
    },
    {
        "intoxicating liquors": "alcoholic beverage"
    },
    {
        " within... the United States... for beverage purposes is hereby prohibited. The subsequent ": null
    },
    {
        "Volstead Act": "volstead act"
    },
    {
        " defined intoxicating liquors and provided for several exceptions, one of which as for ": null
    },
    {
        "sacramental": "sacramental wine"
    },
    {
        " use. The ": null
    },
    {
        "Christian Church": "christian church"
    },
    {
        " was able to successfully regulate the use of ceremonial wine. The clergy could easily monitor the nominal amount of ": null
    },
    {
        "sacramental wine": "sacramental wine"
    },
    {
        " that each worshipper drank, especially because it was usually drunk only in Church and only on Sundays .     This was not the case for the Jews. Jews needed a greater quantity of wine per person. Furthermore, the wine was drunk in the privacy of the home on ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        ", ": null
    },
    {
        "Jewish holiday": "jewish holiday"
    },
    {
        "s, ": null
    },
    {
        "weddings": "jewish wedding"
    },
    {
        " and  brit milah  . This alone would have made the regulation of ceremonial wine complicated. It was not difficult for crooks to rig illegal wine synagogues to trick the government to receive their wine which would then be bootlegged.     While contemporary Orthodox Jewish authorities are generally permissive of grape juice as a wine substitute,  contemporaneous Orthodox Rabbis soundly rejected its use. The ": null
    },
    {
        "Reform movement": "reform judaism"
    },
    {
        " in 42 proclaimed that ": null
    },
    {
        "grape juice": "grape juice"
    },
    {
        " be used instead of wine to eliminate future complaints. Shortly afterwards, on January 42 42 the ": null
    },
    {
        "Conservative movement": "conservative judaism"
    },
    {
        " publicized the 42-page response written by Ginzberg tackling the halakhic aspects of drinking grape juice instead of wine in light of the historical circumstances. Besides Ginzbergs well-grounded decision to permit grape juice, he includes meta-halakhic reasoning:     …The decision of the author of ": null
    },
    {
        "Magen Abraham": "avraham gombiner"
    },
    {
        " that the commandment is honored best by the use of old wine is rejected. Even this authority would admit that it is better to pronounce the ": null
    },
    {
        "Kiddush": "kiddush"
    },
    {
        " over new wine than to ": null
    },
    {
        "desecrate the Name": "chillul hashem"
    },
    {
        " and to disgrace the Jewish people, and we well know the damage caused the Jewish people by the trafficking in sacramental wine.     At the time of Ginzburgs responsum, the Orthodox rabbinate had exclusive authority to sanction sacramental wine for Jews, and the responsum was thought by the Orthodox community to be tainted by self-interest.       Ginzberg was the author of a number of scholarly Jewish works, including a commentary on Talmud Yerushalmi  and his six-volume The Legends of the Jews, which combined hundreds of legends and ": null
    },
    {
        "parable": "parable"
    },
    {
        "s from a lifetime of ": null
    },
    {
        "midrash": "midrash"
    },
    {
        " research.      Legends of the Jews  is an original synthesis of a vast amount of ": null
    },
    {
        "aggadah": "aggadah"
    },
    {
        " from all of classical ": null
    },
    {
        "rabbinic literature": "rabbinic literature"
    },
    {
        ", as well as ": null
    },
    {
        "apocryphal": "apocryphal"
    },
    {
        ", ": null
    },
    {
        "pseudopigraphical": "pseudopigraphical"
    },
    {
        " and even early Christian literature, with legends ranging from the creation of the world and the fall of Adam, through a huge collection of legends on Moses, and ending with the story of Esther and the Jews in Persia. Ginzberg had an encyclopedic knowledge of all rabbinic literature, and his masterwork included a massive array of aggadot. However he did not create an anthology which showed these aggadot distinctly. Rather, he paraphrased them and rewrote them into one continuous narrative that covered four volumes, followed by two volumes of footnotes that give specific sources. See ": null
    },
    {
        "Jewish folklore": "jewish folklore"
    },
    {
        " and ": null
    },
    {
        "Aggadah": "aggadah"
    },
    {
        ".     Apart from Legends of the Jews, perhaps his best known scholarly work was his Geonica , an account of the Babylonian ": null
    },
    {
        "Geonim": "geonim"
    },
    {
        " containing lengthy extracts from their responsa, as discovered in the form of fragments in the ": null
    },
    {
        "Cairo Geniza": "cairo geniza"
    },
    {
        "h. This work was continued by him in the similar collection entitled Ginze Schechter .     Professor Ginzberg wrote 42 articles and several ": null
    },
    {
        "monograph": "monograph"
    },
    {
        "-length entries for the  Jewish Encyclopedia  , some later collected in his Legend and Lore.  He was an important ": null
    },
    {
        "halakhic": "halakha"
    },
    {
        " authority of the ": null
    },
    {
        "Conservative movement": "conservative judaism"
    },
    {
        " in North America; for a period of ten years , he was virtually the halakhic authority of this movement. He was also founder and president of the American Academy of Jewish Research.     Many of his halakhic responsa are collected in The Responsa of Professor Louis Ginzberg, ed. ": null
    },
    {
        "David Golinkin": "david golinkin"
    },
    {
        ", NY: JTS, 42       Ginzberg had a long term platonic relationship with ": null
    },
    {
        "Henrietta Szold": "henrietta szold"
    },
    {
        ", who was his editor at ": null
    },
    {
        "JPS": "jewish publication society"
    },
    {
        ". She was in love with him, but was 42 years older than him.      Ginzberg visited Berlin in 42 and became engaged to ": null
    },
    {
        "Adele Katzenstein": "adele ginzberg"
    },
    {
        " while he was there. Katzestein was about 42 at the time. They had two children. Son ": null
    },
    {
        "Eli Ginzberg": "eli ginzberg"
    }
]