[
    {
        "   Louis Christophe François Hachette  was a French publisher who established a Paris publishing house designed to produce books and other material to improve the system of school instruction. Publications were initially focused on the classics and subsequently expanded to include books and magazines of all types. The firm is currently part of a global publishing house.       Hachette was born at ": null
    },
    {
        "Rethel": "rethel"
    },
    {
        " in the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        "  département  of France. After studying three years at prestigious ": null
    },
    {
        "École Normale Supérieure": "école normale supérieure"
    },
    {
        " with the view of becoming a teacher 42 he was, on political grounds, expelled from the seminary. In 42 after briefly studying law, Hachette opened Brédif, a bookshop located near the Sorbonne in Paris . The focus of the business was to produce works adapted to improve the system of school instruction and to promote the general culture in the community. He published manuals on various topics including, dictionaries of modern and ancient languages, educational journals, and French, Latin and Greek classics annotated with great care by the most eminent authorities.       In 42 the Guizot Schools Law was passed which required all municipalities to open a primary school. Louis Hachette had been putting together an alphabet primer since 42 and his was the only company capable of responding to the public order for a million textbooks.     In 42 the L. Hachette & Company was founded. That year, Emile Littré signed a contract with the new firm to publish a dictionary, the first volumes of which appear in 42     In 42 Hachette contracted with seven railway companies to create station bookstalls. In addition to travel guides for rail passengers, the small outlets sold novels by authors including Charles Dickens, Gérard de Nerval, George Sand and the children’s series Bibliothèque Rose, including those by La ": null
    },
    {
        "Comtesse de Ségur": "comtesse de ségur"
    },
    {
        ".     In 42 Hachette founded Le Journal pour tous, a publication with a circulation of 42 weekly.     Hachette started printing  Le Tour du Monde ": null
    }
]