[
    {
        "              Love in a Cold Climate is a novel by ": null
    },
    {
        "Nancy Mitford": "nancy mitford"
    },
    {
        ", first published in 42 The title is a direct quotation from ": null
    },
    {
        "George Orwell": "george orwell"
    },
    {
        "s novel  Keep the Aspidistra Flying  .       Love in a Cold Climate is a companion volume to  The Pursuit of Love . The time frame of Love in a Cold Climate is the same as The Pursuit of Love, but the focus is on a different set of characters. Fanny remains the fictional narrator. In The Pursuit of Love, Fanny narrates the story of her cousin Linda Radlett. In Love in a Cold Climate, Fanny narrates the story of Polly, to whom Fanny is distantly related through her fathers family. Lady Leopoldina Hampton, is the only child of the supremely aristocratic and very rich Earl of Montdore and his wife, Sonia. Lady Montdore is a product of the minor ranks of the aristocracy and her marriage to an earl is regarded as a social coup on her part. She is depicted by Fanny, as an avaricious, greedy snob, but not without charm. Her thrusting personality, allied to her husbands impeccable social standing, riches and political influence makes her a formidable woman. Lady Montdore, unbeknown to Lord Montdore, takes advantage of her husbands reputation to forward her own career as a hostess and manipulator of her social circle. Their daughter is Polly, whom Fanny loses contact with when Lord Montdore is sent as ": null
    },
    {
        "Viceroy of India": "viceroy of india"
    },
    {
        ".     Fanny receives an invitation to visit the Montdores upon their return from India. She has great affection for Polly, but Polly reveals little of herself. Polly has ": null
    },
    {
        "come out": "debutante"
    },
    {
        " in India and as a beautiful and socially important debutante, is expected to have a very successful season in London. However, Polly consistently demonstrates a total lack of interest in the London season and all of the men she meets. She is hoping that in a cold climate , society will be less interested in love affairs. Lady Montdore is exasperated by her daughters apparent indifference to love and marriage. Important potential suitors acknowledge that Polly is very beautiful, but find her cold and aloof. Polly reveals to no one that she has been in love with her uncle, Boy Dougdale since she was 42 Boy is snobbish and sexually rapacious; his many affairs are common knowledge to both his wife and society at large. Fanny and her Radlett cousins have long suspected that the sexually ambiguous Boy has ": null
    },
    {
        "paedophile": "paedophile"
    },
    {
        " tendencies and he is a joke amongst Fannys cousins for his inappropriate touches and lecherous behaviour towards young girls. Polly marries Boy shortly after her aunts death, causing a scandal in her social circle and distressing her parents deeply. Unbeknownst to Polly, Boy has been Lady Montdores lover for many years. She is excluded from her fathers will upon her marriage and she and Boy ostracised from society. They move to ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " for several years.     Pollys place in the family is filled by the heir to Lord Montdores ": null
    },
    {
        "entailed": "entailed"
    },
    {
        " fortune and title, Cedric Hampton. Born in ": null
    },
    {
        "Nova Scotia": "nova scotia"
    },
    {
        " to a minor member of the Montdore family, Cedric has used his exceptional good looks and personal charm to establish a place within the homosexual milieu of the European aristocracy. He has lived a life of luxury as the lover of rich and aristocratic men. Cedric accepts an invitation to visit the Montdores. His natural love of beauty, innate good taste and his careful use of flattery, enable Cedric to win the affections of Lord and Lady Montdore and many others. Cedric focuses his attentions upon Lady Montdore who uses Cedrics popularity and charm to reestablish herself as a leading society hostess, to Cedrics advantage.     Fanny and Cedric soon become close friends. Polly and Boy return from Sicily, out of love and their marriage turned sour. While pregnant, Polly is regularly visited by the elderly Duke of Paddington who lavishes her with attention. Polly reconciles with her mother after bearing a child who dies shortly after its birth. Cedric and Boy meet and fall in love. Cedric arranged the whole thing perfectly , according to Fanny. While Polly recovers from the difficult birth, Cedric whisks Boy and Lady Montdore to France, leaving Polly free to be carried off by the elderly Duke. While this outcome shocks the conservative social circles in which they mix, Fanny takes a broader minded view, pleased to see people she loves each finding happiness in their own way.         Polly Hampton, the daughter of Lord and Lady Montdore, is renowned for her beauty but not much else   Lady Montdore, Pollys abrasive, narcissistic and inconsiderate mother   Lord Montdore, Pollys kindly and rather dull father and the previous Viceroy of India   Fanny Wincham, the narrator, is a distant cousin of Polly and a frequent visitor of the family.   Linda Radlett, Fannys cousin and best friend, daughter of Lord and Lady Alconleigh. Her relationships form a central part of story in  The Pursuit of Love .   Louisa Radlett, eldest daughter of Lord and Lady Alconleigh, marries Lord Fortwilliam.   Cedric Hampton, the heir to Hampton and a close friend of Fannys, is flagrantly homosexual and extremely charming. He causes a great deal of gossip and scandal, yet most people are won over by his charm once they meet him. Once he arrives at Hampton, he spends most of his time making over his aunt   Harvey Boy Dougdale, husband of Lord Montdores sister Patricia and later the husband of Polly Hampton. Boy is bisexual and known for his extremely active sex life   Lady Patricia Dougdale, whom Polly is said to resemble, is the wife of Boy Dougdale. Patricia pined for Boy for several years before he finally married her, but within six months of the wedding Patricia became aware of her husbands extramarital affairs. She was long afflicted with ill health and her death is a major plot point in the story   Davey Warbeck, Fannys uncle and close friend of the Montdores and the Alconleighs   Jassy Radlett, Fannys cousin, is a regular visitor who never fails to cheer up Fanny   Victoria Radlett, Jassys younger sister, and likewise one of Fannys most welcome visitors   Matthew Alconleigh, father of Jassy and Victoria and uncle to Fanny, Matthew is notable for his intense loathing of Cedric Hampton   Sadie Alconleigh, Fannys aunt and mother of Jassy and Victoria, is a close friend of the Montdores   Alfred Wincham, an Oxford don and Fannys husband. Although Fanny often claims that she and her husband are perfectly suited for one another, Alfred is often dismissive of his wifes behaviour and interests   Norma Cozens, Fannys neighbour, is one of her closest friends despite their many differences in temperament   Mrs. Chaddesley Corbett, the most popular and prominent socialite of her day and an important visitor at Hampton   Fabrice de Sauveterre, a wealthy French duke and a guest at Hampton. Sauveterre is a major character in The Pursuit of Love        Dont Tell Alfred  is a sequel to the novel giving further insight into the married life of Fanny and Alfred.       Love in a Cold Climate has been adapted twice as a ": null
    },
    {
        "mini-series": "mini-series"
    },
    {
        ":   in ": null
    },
    {
        "42": "love in a cold climate"
    },
    {
        " by ": null
    },
    {
        "Simon Raven": "simon raven"
    },
    {
        " for ": null
    },
    {
        "Thames Television": "thames television"
    },
    {
        " starring ": null
    },
    {
        "Lucy Gutteridge": "lucy gutteridge"
    },
    {
        ", ": null
    },
    {
        "Rosalyn Landor": "rosalyn landor"
    },
    {
        ", ": null
    },
    {
        "Michael Aldridge": "michael aldridge"
    },
    {
        ", ": null
    },
    {
        "Judi Dench": "judi dench"
    },
    {
        ", ": null
    },
    {
        "Vivian Pickles": "vivian pickles"
    },
    {
        " and ": null
    },
    {
        "Jean-Pierre Cassel": "jean-pierre cassel"
    },
    {
        " 42": "love in a cold climate"
    },
    {
        " by ": null
    },
    {
        "Deborah Moggach": "deborah moggach"
    },
    {
        " for the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " starring ": null
    },
    {
        "Rosamund Pike": "rosamund pike"
    },
    {
        ", ": null
    },
    {
        "Elisabeth Dermot-Walsh": "elisabeth dermot-walsh"
    },
    {
        ", ": null
    },
    {
        "Celia Imrie": "celia imrie"
    },
    {
        " and ": null
    },
    {
        "Alan Bates": "alan bates"
    },
    {
        "     Both versions were broadcast in the United States by ": null
    },
    {
        "PBS": "public broadcasting service"
    },
    {
        " as part of  Masterpiece Theatre .                          ": null
    }
]