[
    {
        "        Lovesexy is the tenth ": null
    },
    {
        "studio album": "studio album"
    },
    {
        " by American recording artist ": null
    },
    {
        "Prince": "prince"
    },
    {
        ". The album was released on May 42 42 by ": null
    },
    {
        "Paisley Park Records": "paisley park records"
    },
    {
        " and ": null
    },
    {
        "Warner Bros. Records": "warner bros. records"
    },
    {
        ". The album was recorded in just seven weeks, from mid-December 42 to late January 42 at Princes new ": null
    },
    {
        "Paisley Park Studios": "paisley_park_recordspaisley_park_studios"
    },
    {
        ", and most of the album is a solo effort from Prince, with a few exceptions. The lyrical themes of the record include positivity, self-improvement, spirituality, and God.     Receiving mixed reviews, Lovesexy reached number 42 on the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " and number one in the Netherlands, New Zealand, Sweden, Switzerland and the UK. It spawned three singles; ": null
    },
    {
        "Alphabet St.": "alphabet st."
    },
    {
        " became a worldwide top42 hit in the spring of 42 whereas the follow-up singles ": null
    },
    {
        "Glam Slam": "glam slam"
    },
    {
        " and ": null
    },
    {
        "I Wish U Heaven": "i wish u heaven"
    },
    {
        " failed to reach the Billboard Hot 42 Subsequently, it was Princes least successful album in the United States since 42 It is certified ": null
    },
    {
        "Gold": "riaa certification"
    },
    {
        " by the ": null
    },
    {
        "Recording Industry Association of America": "recording industry association of america"
    },
    {
        " .     Lovesexy was accompanied by the critically acclaimed ": null
    },
    {
        "Lovesexy Tour": "lovesexy tour"
    },
    {
        ", of which the September 42th Dortmund show in Germany was released on ": null
    },
    {
        "video cassette": "videotape"
    },
    {
        " and ": null
    },
    {
        "LaserDisc": "laserdisc"
    },
    {
        ". It was also televised on several European channels, with the broadcast containing various alternate camera shots in place of the ones used in the officially released video, which was released a year later in 42       The opening track, 👁 No , was recorded with the full band . Sheila E., in fact, plays drums on several tracks and sings backup, along with Boyer. Leeds and Bliss provide horns on most tracks, and ": null
    },
    {
        "Ingrid Chavez": "ingrid chavez"
    },
    {
        " provides the intro to 👁 No . The album is designed to be heard in the context of a continuous sequence: ": null
    },
    {
        "LP": "gramophone record"
    },
    {
        " pressings split the album in two side-long tracks, without visual bands to indicate individual songs. Similarly, early ": null
    },
    {
        "CD": "compact disc"
    },
    {
        " copies of Lovesexy have the entire album in sequence as a single track, though some later editions have it as nine separate tracks. Lovesexy is also the first Prince album to replace the pronoun I with a stylized 👁 symbol, commonly Romanized as eye , in both song titles and ": null
    },
    {
        "liner notes": "liner notes"
    },
    {
        "; the symbol would not be completely adopted, however, until 42s  Love Symbol Album .       The theme of the album is the struggle between good and evil. ": null
    },
    {
        "God": "god"
    },
    {
        " and ": null
    },
    {
        "Satan": "satan"
    },
    {
        ", virtue and sin , the perennial themes of Princes work, mix as Prince climaxes to Love is God, God is love, girls and boys love God above in the song Anna Stesia .     Prince refers to Lovesexy as a gospel album. It opens with a sermon of sorts; 👁 No , a positive energetic track advising people to be free from their vices and to reject Satan, and affirming his belief in God, while using his bully pulpit to encourage the listener to do the same. 👁 No is a reworking of a song called The Ball from the unreleased  Crystal Ball . The song ends with a scale of horns and a segue of conversations  leading to the albums biggest-selling single, ": null
    },
    {
        "Alphabet St.": "alphabet st."
    },
    {
        " , which mixes ": null
    },
    {
        "dance music": "dance music"
    },
    {
        ", rock and ": null
    },
    {
        "rap": "rapping"
    },
    {
        " along with playful lyrics about sex, braggadocio, and the heavenly state of feeling lovesexy . Next is ": null
    },
    {
        "Glam Slam": "glam slam"
    },
    {
        " , a busy dance track which features Princes full band. It speaks to the uplifting interlude between Prince and a woman, and how, when he fell down, she lifted him. It also praises the womans love and sense of humanity. The song ends with an almost classical music string solo . Ending side one of the vinyl release is Anna Stesia , a heartfelt confessional number divulging various sins of the flesh, and ends with Prince promising to dedicate his life and music to God.     Side two opens with the machine gun-like pace of Dance On , which lambasts negative aspects of society, somewhat akin to ": null
    },
    {
        "Sign ☮ the Times": "sign o the times"
    },
    {
        " . The title track follows, described by Prince as The feeling you get when you fall in love  ... not with a boy or girl but with the heavens above, and it is another energetic dance track; the Good News indeed Prince extols its virtues graphically and then he and ": null
    },
    {
        "Cat Glover": "cat glover"
    },
    {
        " share an orgasm, both using sped up Camille-like vocals, going from Princes voice to Cats. This leads into, When 42 R in Love , a sex-infused ballad recorded during the sessions for the untitled black album. Next is the almost sparse, but uplifting ": null
    },
    {
        "I Wish U Heaven": "i wish u heaven"
    },
    {
        " , which says that no matter what controversy or opposition one may bring, the end result is still wishing your enemy the best. It follows a Biblical proverb about blessing those that curse you, loving those that hate you, for it heaps hot coals on their heads . The last track is Positivity , which echoes the theme of Dance On . It extols the virtues of staying positive, while asking the listener to examine examples of negativity and negative aspects of the world; overlooking the quick thrill and pushing toward being positive throughout it. The song continuously asks the question Have you had your plus sign today? The vocals are sung, but the bridge and extended portions are more of a spoken rap-type style that Prince had started to display as early as All the Critics Love U in New York in 42 The song ends with sounds of water rushing and a river over keyboard chords. This final song was later given to ": null
    },
    {
        "Mavis Staples": "mavis staples"
    },
    {
        " for her 42 album,  The Voice .          The cover  caused some controversy upon release as it depicts Prince in the nude. Some record stores refused to stock it or wrapped the album in black, although Lovesexy had been issued as a replacement for the hastily withdrawn  The Black Album , which had an achromatic black cover.     Lovesexy was Princes least successful album since 42 failing to break the top 42 being certified Gold and spending just 42 weeks on the US Billboard 42 While ": null
    },
    {
        "Alphabet St.": "alphabet st."
    },
    {
        " managed to crack the top 42 it did not make a lasting impression and the subsequent two single releases failed to chart on the Hot 42 The situation in the United Kingdom was more positive, where the album debuted at number 42 and all the singles became top 42 hits.               Sample credits ": null
    },
    {
        "Roger Limb": "roger limb"
    },
    {
        " track Passing Clouds , created at the ": null
    },
    {
        "BBC Radiophonic Workshop": "bbc radiophonic workshop"
    },
    {
        " released in 42 on the Out of this World album.     Notes Lovesexy was made available in its single track format only.         ": null
    },
    {
        "Prince": "prince"
    },
    {
        " – lead vocals and various instruments   ": null
    },
    {
        "Sheila E.": "sheila e."
    },
    {
        " – drums , drums and backing vocals   ": null
    },
    {
        "Boni Boyer": "boni boyer"
    },
    {
        " – keyboards , backing vocals   ": null
    },
    {
        "Dr. Fink": "dr. fink"
    },
    {
        " – keyboards   ": null
    },
    {
        "Miko Weaver": "miko weaver"
    },
    {
        " – guitar   ": null
    },
    {
        "Levi Seacer, Jr.": "levi seacer, jr."
    },
    {
        " – bass   ": null
    },
    {
        "Eric Leeds": "eric leeds"
    },
    {
        " – saxophone   ": null
    },
    {
        "Atlanta Bliss": "atlanta bliss"
    },
    {
        " – trumpet   ": null
    },
    {
        "Ingrid Chavez": "ingrid chavez"
    },
    {
        " – spoken intro   ": null
    },
    {
        "Cat Glover": "cat glover"
    },
    {
        " – rap , backing vocals       ": null
    },
    {
        "Alphabet St.": "alphabet st."
    },
    {
        "   Alphabet St. – part 42 – 42 version only   Alphabet St. – part 42 – 42 version only   Alphabet St. – 42 version only   Alphabet St. – This is not music, this is a trip – 42 version only ": null
    },
    {
        "Glam Slam": "glam slam"
    },
    {
        "   Glam Slam – 42 version only   Glam Slam – 42 version only   Escape     ": null
    },
    {
        "I Wish U Heaven": "i wish u heaven"
    },
    {
        "   I Wish U Heaven – 42 version only   I Wish U Heaven – 42 version only   Scarlet Pussy                                                       ": null
    }
]