[
    {
        "The low birth-weight paradox is an apparently ": null
    },
    {
        "paradox": "paradox"
    },
    {
        "ical observation relating to the ": null
    },
    {
        "birth weight": "birth weight"
    },
    {
        "s and ": null
    },
    {
        "mortality rate": "mortality rate"
    },
    {
        " of children born to ": null
    },
    {
        "tobacco smoking": "tobacco smoking"
    },
    {
        " mothers. ": null
    },
    {
        "Low birth-weight": "low birth-weight"
    },
    {
        " children born to ": null
    },
    {
        "smoking mother": "smoking and pregnancy"
    },
    {
        "s have a lower ": null
    },
    {
        "infant mortality": "infant mortality"
    },
    {
        " rate than the low birth weight children of non-smokers. It is an example of ": null
    },
    {
        "Simpsons paradox": "simpsons paradox"
    },
    {
        ".       Traditionally, babies weighing less than a certain amount have been classified as having low birth weight. In a given population, low birth weight babies have a significantly higher ": null
    },
    {
        "mortality": "infant mortality"
    },
    {
        " rate than others; thus, populations with a higher rate of low birth weights typically also have higher rates of child mortality than other populations.     Based on prior research, the children of smoking mothers are more likely to be of low birth weight than children of non-smoking mothers. Thus, by extension the child mortality rate should be higher among children of smoking mothers. So it is a surprising real-world observation that low birth weight babies of smoking mothers have a lower child mortality than low birth weight babies of non-smokers.       At first sight these findings seemed to suggest that, at least for some babies, having a smoking mother might be beneficial to ones health. However the paradox can be explained ": null
    },
    {
        "statistically": "statistics"
    },
    {
        " by uncovering a  lurking variable  between smoking and the two key variables: birth weight and risk of mortality. Both variables are acted on independently by smoking and other adverse conditions — birth weight is lowered and the risk of mortality increases. However, each condition does not necessarily affect both variables to the same extent.     The birth weight ": null
    },
    {
        "distribution": "frequency distribution"
    },
    {
        " for children of smoking mothers is shifted to lower weights by their mothers actions. Therefore, otherwise healthy babies are born underweight. However, they still have a lower mortality rate than children who have other, more severe, medical reasons why they are born underweight.     In short, smoking is harmful in that it contributes to low birth weight which has higher mortality than normal birth weight, but other causes of low birth weight are generally more harmful than smoking.       If one corrects and adjusts for the confounding by smoking, via stratification or multivariable regression modelling to statistically control for smoking, one finds that the association between birth weight and mortality may be attenuated towards the null. Nevertheless, most epidemiologic studies of birth weight and mortality have controlled for maternal smoking, and the adjusted results, although attenuated after adjusting for smoking, still indicated a significant association.     Additional support for the hypothesis that birth weight and mortality can be acted on independently came from the analysis of birth data from ": null
    },
    {
        "Colorado": "colorado"
    }
]