[
    {
        "The  Lower Colorado River Authority  is a ": null
    },
    {
        "nonprofit": "nonprofit"
    },
    {
        " public utility created in November 42 by the ": null
    },
    {
        "Texas Legislature": "texas legislature"
    },
    {
        ". LCRAs mission is to enhance the lives of the Texans it serves through water stewardship, energy and community service. LCRA provides public power, manages the lower ": null
    },
    {
        "Colorado River": "colorado river"
    },
    {
        ", builds and operates transmission lines, owns public parks, and offers community services.     LCRA does not receive state appropriations or have the ability to levy taxes. Instead, LCRA is funded by revenue it generates, the vast majority of which comes from producing and transmitting electricity. A very small portion of LCRAs revenue comes from selling water.         The ": null
    },
    {
        "Fayette Power Project": "fayette power project"
    },
    {
        " is a three-unit coal-fired power plant in ": null
    },
    {
        "Fayette County": "fayette county, texas"
    },
    {
        " that provides 42 ": null
    },
    {
        "megawatts": "megawatts"
    },
    {
        " .  ": null
    },
    {
        "Lake Fayette": "lake fayette"
    },
    {
        " is the cooling pond for the project. LCRA uses ": null
    },
    {
        "coal": "coal"
    },
    {
        " from the ": null
    },
    {
        "Powder River Basin": "powder river basin"
    },
    {
        " in ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        " as fuel.       The ": null
    },
    {
        "Sim Gideon Power Plant": "sim gideon power plant"
    },
    {
        " is a three-unit ": null
    },
    {
        "natural gas": "natural gas"
    },
    {
        "-fired plant in ": null
    },
    {
        "Bastrop County": "bastrop county, texas"
    },
    {
        " that provides 42 ": null
    },
    {
        "megawatts": "megawatts"
    },
    {
        ". The Lost Pines 42 Power Project is a ": null
    },
    {
        "natural gas": "natural gas"
    },
    {
        "-fired ": null
    },
    {
        "combined-cycle": "combined-cycle"
    },
    {
        " plant adjacent to the Sim Gideon plant, and the two form the Lost Pines Power Park. The Lost Pines 42 Power Project can generate up to 42 megawatts. ": null
    },
    {
        "Lake Bastrop": "lake bastrop"
    },
    {
        " is the cooling pond for the Lost Pines Power Park.     LCRA broke ground on a new ": null
    },
    {
        "Thomas C. Ferguson Power Plant": "thomas c. ferguson power plant"
    },
    {
        " in April 42 about 42 yards from the site of the original Ferguson plant on Lake LBJ. The plant began operating in 42 The Ferguson facility is a natural gas-fired, combined cycle plant in Horseshoe Bay capable of producing 42 megawatts. Ferguson is among the most environmentally responsible power plants in Texas, producing 42 to 42 percent fewer emissions per unit of power that the unit it replaced. It uses about 42 percent less fuel per megawatt-hour and about one-third of the water used at a typical steam plant per unit of power.     The Winchester Power Park in ": null
    },
    {
        "Fayette County": "fayette county, texas"
    },
    {
        " provides about 42 megawatts for use primarily during peak-demand periods.     The LCRA buys natural gas on the open market and stores it at the Hilbig Gas Storage Facility, an underground reservoir near ": null
    },
    {
        "Rockne, Texas": "rockne, texas"
    },
    {
        ". The facility can hold up to 42 billion cubic feet of natural gas.            LCRA operates six ": null
    },
    {
        "hydroelectric": "hydroelectric"
    },
    {
        " dam": "dam"
    },
    {
        "s along the Colorado River in Central Texas that provide a source of renewable energy and form six lakes collectively known as the ": null
    },
    {
        "Texas Highland Lakes": "texas highland lakes"
    },
    {
        ":     ": null
    },
    {
        "Buchanan Dam": "buchanan dam"
    },
    {
        " - forms ": null
    },
    {
        "Lake Buchanan": "lake buchanan"
    },
    {
        " Inks Dam": "inks dam"
    },
    {
        " - forms ": null
    },
    {
        "Inks Lake": "inks lake"
    },
    {
        " Wirtz Dam": "wirtz dam"
    },
    {
        " - forms ": null
    },
    {
        "Lake LBJ": "lake lbj"
    },
    {
        ", which also serves as a cooling pond for the Thomas C. Ferguson Power Plant   ": null
    },
    {
        "Max Starcke Dam": "max starcke dam"
    },
    {
        " - forms ": null
    },
    {
        "Lake Marble Falls": "lake marble falls"
    },
    {
        " Mansfield Dam": "mansfield dam"
    },
    {
        " - forms ": null
    },
    {
        "Lake Travis": "lake travis"
    },
    {
        " Tom Miller Dam": "tom miller dam"
    },
    {
        " - forms ": null
    },
    {
        "Lake Austin": "lake austin"
    },
    {
        "     In keeping with its state-approved Water Management Plan, LCRA generates electricity from the dams only as it releases water for other reasons, or when ordered to do so by the Electric Reliability Council of Texas .       LCRA purchases 42 megawatts of wind power capacity from the ": null
    },
    {
        "Indian Mesa Wind Energy Center": "indian mesa wind farm"
    },
    {
        " in West Texas and 42 megawatts from the Papalote Creek II Wind Farm near the Texas Gulf Coast.       LCRA distributes electricity to its wholesale electric customers - mostly municipal utilities and electric cooperatives - and supports the statewide electric transmission network through more than 42 miles of ": null
    },
    {
        "transmission lines": "electric power transmission"
    },
    {
        " and more than 42 substations, which are owned by LCRA Transmission Services Corporation, a nonprofit corporation owned by LCRA.       LCRA manages the Highland Lakes and the lower Colorado River, a 42  mi stretch of the Texas Colorado River, as a system to supply water for more than 42 million people as well as businesses, industries, the environment and agriculture in the lower Colorado River basin.     LCRA has the rights to more than 42 million acre-feet of water per year based mostly on surface water permits issued by the state of Texas.          LCRA owns more than 42 public parks, recreation areas and river access sites along the Highland Lakes and lower Colorado River. LCRAs McKinney Roughs and Matagorda Bay nature parks have natural science centers that offer outdoor educational and recreational programs for youths and adults.     LCRA offers a wide range of conservation programs for water users within its river basin. It also operates an environmental laboratory, monitors the water quality of the lower Colorado River, and regulates on-site sewage systems to limit pollution and help protect the health of those enjoying the Highland Lakes.     LCRAs community services programs include the Community Development Partnership Program, which has awarded almost $42 million in matching grants for 42 community development projects since 42       In November 42 the Texas Legislature authorized the formation of the Lower Colorado River Authority to complete Buchanan Dam, where construction had been idled in 42 following the financial collapse and bankruptcy of the ": null
    },
    {
        "Samuel Insull": "samuel insull"
    },
    {
        "-controlled ": null
    },
    {
        "public utility": "public utility"
    },
    {
        " holding company": "holding company"
    },
    {
        ". LCRA began operations in February 42     LCRA completed Buchanan Dam and a companion project, Inks Dam, in 42—the first of six dams that form the reservoirs known as the Highland Lakes. LCRA completed the chain of lakes and dams in 42 LCRA manages the chain to protect basin residents from the worst effects of Hill Country floods and provide the lower Colorado River basin with a reliable water supply.     With the encouragement of congressman, ": null
    },
    {
        "Lyndon B. Johnson": "lyndon b. johnson"
    },
    {
        ", LCRA used the hydroelectric power from its dams in 42 to launch a public power program that served communities and electric cooperatives in Central and South Texas.     For nearly three decades, hydroelectric generation was LCRAs primary power source. Growing demand for electricity led LCRA to build natural gas and coal-fired power plants. LCRA added to its generation portfolio with the ": null
    },
    {
        "Sim Gideon Power Plant": "sim gideon power plant"
    },
    {
        " and original ": null
    },
    {
        "Thomas C. Ferguson Power Plant": "thomas c. ferguson power plant"
    },
    {
        " in the 42s and 42s, the ": null
    },
    {
        "Fayette Power Project": "fayette power project"
    }
]