[
    {
        "   Lucius Quinctius  Cincinnatus  was a ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " patrician": "patrician"
    },
    {
        ", ": null
    },
    {
        "statesman": "roman senate"
    },
    {
        ", and ": null
    },
    {
        "military leader": "roman army"
    },
    {
        " of the early ": null
    },
    {
        "Roman Republic": "roman republic"
    },
    {
        " who became a ": null
    },
    {
        "legend": "legend"
    },
    {
        "ary figure of ": null
    },
    {
        "Roman virtue": "virtus"
    },
    {
        "—particularly ": null
    },
    {
        "civic virtue": "civic virtue"
    },
    {
        "—by the time of the ": null
    },
    {
        "Empire": "roman empire"
    },
    {
        ".     Cincinnatus was a conservative opponent of the rights of the ": null
    },
    {
        "plebeians": "plebeians"
    },
    {
        " who fell into poverty because of ": null
    },
    {
        "his son": "caeso quinctius"
    },
    {
        "s violent opposition to their desire for a ": null
    },
    {
        "written code": "code of law"
    },
    {
        " of ": null
    },
    {
        "equitably enforced": "equality before the law"
    },
    {
        " laws": "roman law"
    },
    {
        ". Despite his old age, he worked his own ": null
    },
    {
        "small farm": "roman agriculture"
    },
    {
        " until an invasion prompted his fellow citizens to call for his leadership. He came from his plow to assume ": null
    },
    {
        "complete control over the state": "roman dictator"
    },
    {
        " but, upon achieving a swift victory, relinquished his power and its perquisites and returned to his farm. His success and immediate resignation of his near-absolute authority with the end of this crisis  has often been cited as an example of outstanding leadership, service to the greater good, ": null
    },
    {
        "civic virtue": "civic virtue"
    },
    {
        ", humility, and modesty. As a result, he has inspired a number of organizations and other entities, some named in his honor. In the United States, parallels are drawn between Cincinnatus and national hero ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        ", and, as such, the ": null
    },
    {
        "Society of the Cincinnati": "society of the cincinnati"
    },
    {
        ", the town of ": null
    },
    {
        "Cincinnatus, New York": "cincinnatus, new york"
    },
    {
        ", and the city of ": null
    },
    {
        "Cincinnati, Ohio": "cincinnati, ohio"
    },
    {
        " are named after him.     Modern historians question some particulars of the story recounted in ": null
    },
    {
        "Livy": "livy"
    },
    {
        " and elsewhere but usually accept Cincinnatus as a historical figure who served as ": null
    },
    {
        "suffect consul": "suffect consul"
    },
    {
        " in 42BC and as ": null
    },
    {
        "dictator": "roman dictator"
    },
    {
        " in 42BC and again in 42BC, when the patricians called on him to suppress the feared uprising of the plebeians under ": null
    },
    {
        "Spurius Maelius": "spurius maelius"
    },
    {
        ".                According to the traditional accounts, Lucius would have been born about 42BC, during the last decade of the ": null
    },
    {
        "Roman Kingdom": "roman kingdom"
    },
    {
        ". He would have been a member of the lesser ": null
    },
    {
        "patrician": "patrician"
    },
    {
        " clan": "gens"
    },
    {
        "  Quinctia": "quinctia"
    },
    {
        ", whom ": null
    },
    {
        "Tullus Hostilius": "tullus hostilius"
    },
    {
        " supposedly moved to Rome from the ": null
    },
    {
        "Latin": "latins"
    },
    {
        " city of ": null
    },
    {
        "Alba Longa": "alba longa"
    },
    {
        ". The clans first ": null
    },
    {
        "consul": "consul"
    },
    {
        " was ": null
    },
    {
        "Titus Quinctius Capitolinus Barbatus": "titus quinctius capitolinus barbatus"
    },
    {
        ", elected in 42BC. As both Titus and Lucius are recorded as the son and grandson of men named Lucius Quinctius, Titus is sometimes thought to have been Luciuss brother. This suggests Lucius was the first of his ": null
    },
    {
        "cognomen": "cognomen"
    },
    {
        " , meaning the ": null
    },
    {
        "curly hair": "curly hair"
    },
    {
        "ed . The family was relatively rich.     In the late 42sBC, Rome was fending off ": null
    },
    {
        "raids": "roman-aequian wars"
    },
    {
        " by the ": null
    },
    {
        "Aequi": "aequi"
    },
    {
        " to their east and, beginning in 42BC, the ": null
    },
    {
        "tribune": "tribune of the plebs"
    },
    {
        " G. Terentilius Harsa": "g. terentilius harsa"
    },
    {
        " began pressing for ": null
    },
    {
        "codification": "code of laws"
    },
    {
        " of the ": null
    },
    {
        "Roman law": "roman law"
    },
    {
        "s in order to establish a kind of ": null
    },
    {
        "constitution": "constitution"
    },
    {
        " that would check the near-regal power of the ": null
    },
    {
        "patrician": "roman patrician"
    },
    {
        " consuls. In the years that followed, he and the other plebeians were ignored, fended off, rejected on procedural grounds, and finally beaten and driven from the streets by gangs of patricians and their ": null
    },
    {
        "clients": "roman client"
    },
    {
        ", supposedly including Cincinnatuss son ": null
    },
    {
        "Caeso": "caeso quinctius"
    },
    {
        ".     The violent resistance of the patricians to such a blameless request prompted ": null
    },
    {
        "so much unrest": "conflict of the orders"
    },
    {
        " that Appius Herdonius was able to seize the ": null
    },
    {
        "Capitoline Hill": "capitoline hill"
    },
    {
        " and hold it against the city with a gang of outlaws and ": null
    },
    {
        "rebel slaves": "slave revolt"
    },
    {
        " or with an army of ": null
    },
    {
        "Sabines": "sabines"
    },
    {
        " . The ": null
    },
    {
        "consul": "roman consul"
    },
    {
        " Publius Valerius Poplicola was killed in its recovery in 42BC and Cincinnatus, probably illegally, became the ": null
    },
    {
        "suffect": "suffect consul"
    },
    {
        " consul for the remainder of the year. Cincinnatus was himself a violent opponent of the plebs proposal,  which made no progress during his administration. His son was supposedly driven from town and killed for his murder of a plebeian. Cincinnatus quit the city and retired to an estate he held to the west of the ": null
    },
    {
        "Tiber": "tiber"
    },
    {
        ".     He served as ": null
    },
    {
        "dictator": "dictator of rome"
    },
    {
        ", a king-like figure appointed by the Republic in times of extreme emergency, in 42 or 42BC in order to lead reinforcements to the defense of the ": null
    },
    {
        "Roman army": "roman army"
    },
    {
        " under the consul ": null
    },
    {
        "L. Minucius Esquilinus Augurinus": "lucius minucius esquilinus augurinus"
    },
    {
        " at ": null
    },
    {
        "Mount Algidus": "battle of mount algidus"
    },
    {
        ". Many of the details of the story are now assumed to be spurious and some consider the entire military account fictional, believing its parallels with T. Quinctius Cincinnatuss 42BC defeat of ": null
    },
    {
        "Praeneste": "praeneste"
    },
    {
        " and ": null
    },
    {
        "Fabius the Delayer": "quintus fabius maximus verrucosus"
    },
    {
        "s 42BC rescue of ": null
    },
    {
        "M. Minucius Rufus": "marcus minucius rufus"
    },
    {
        " from ": null
    },
    {
        "Hannibal": "hannibal"
    },
    {
        " too great for chance. Cincinnatus is recorded, having taken advantage of his position as dictator, to ignore the objections of the ": null
    },
    {
        "tribunes": "tribune of the plebs"
    },
    {
        " and to charge his sons accuser Marcus Volscius for ": null
    },
    {
        "perjury": "perjury"
    },
    {
        ", driving him into exile.      During the ": null
    },
    {
        "decemvir": "decemvir"
    },
    {
        "ate, he ran unsuccessfully for a position in their government in 42BC  but Livy notes his involvement in the discussion about opening the consulship to plebeians.     Possibly, he returned as dictator in 42BC to defend Rome against the conspiracy the ": null
    },
    {
        "prefect": "praefectus annonae"
    },
    {
        " L. Minucius Augurinus": "lucius minucius esquilinus augurinus"
    },
    {
        " alleged ": null
    },
    {
        "Spurius Maelius": "spurius maelius"
    },
    {
        " was plotting against the Republic. When Spurius Maelius ignored his summons, he was killed by Cincinnatuss master of horse and any plot collapsed. He presumably died sometime soon afterwards.              In the traditional accounts of the story, Cincinnatuss son ": null
    },
    {
        "Caeso": "caeso quinctius"
    },
    {
        " was an openly violent opponent of the attempts of the plebeians to enact the Terentilian Law, which sought to codify the Roman legal tradition and circumscribe the authority of the patrician consuls. Caeso would lead gangs to drive the ": null
    },
    {
        "Tribunes of the Plebs": "tribunes of the plebs"
    },
    {
        " from the ": null
    },
    {
        "Forum": "roman forum"
    },
    {
        ", disrupting the procedures necessary to approve it. He was brought up on capital charges in 42BC but released on a large ": null
    },
    {
        "bail": "bail"
    },
    {
        ". A plebeian named Marcus Volscius testified that his brother, while feeble from sickness, had been knocked down and injured by Caeso with such force that he later died. Rather than face his accusers in court, Caeso fled to the ": null
    },
    {
        "Etruscans": "etruscans"
    },
    {
        ". He was then ": null
    },
    {
        "condemned to death": "death penalty"
    },
    {
        "  in absentia  and his father subjected to a huge punitive fine, forcing him to sell most of his estates and to retire from public life to personally work a small farm . Modern historians particularly reject the fine as a later invention inserted to explain the dictators supposed poverty and heighten his virtues.  Some reject the story in its entirety.             In 42BC, the ": null
    },
    {
        "Aequi": "aequi"
    },
    {
        " to Romes east broke their treaty of the year before and attempted to retake ": null
    },
    {
        "Tusculum": "tusculum"
    },
    {
        " . The consuls for the year—": null
    },
    {
        "L. Minucius Esquilinus Augurinus": "lucius minucius esquilinus augurinus"
    },
    {
        " and ": null
    },
    {
        "G. Nautius Rutilus": "gaius nautius rutilus"
    },
    {
        "—led out two armies, one to Tusculums relief and another to strike against the lands of the Aequi and their ": null
    },
    {
        "Sabine": "sabines"
    },
    {
        " allies. Upon reaching ": null
    },
    {
        "Mount Algidus": "mount algidus"
    },
    {
        " in the ": null
    },
    {
        "Alban Hills": "alban hills"
    },
    {
        ", the army under L. Minucius Esquilinus Augurinus encamped and rested instead of immediately attacking. The Aequi quickly deployed around their position and successfully besieged them, with only five ": null
    },
    {
        "horsemen": "roman cavalry"
    },
    {
        " escaping to tell the ": null
    },
    {
        "Roman Senate": "roman senate"
    },
    {
        " what had happened. With the army of the second consul unable to help, the senators fell into a panic and authorized the nomination of a dictator. G. Nautius Rutilus or Horatius Pulvillus named Cincinnatus for a term of six months.     A group of senators was sent to Cincinnatus to inform him of his appointment, finding him while he was plowing his farm. He asked them, Is everything all right? and they replied that they hoped it might turn out well for both him and his country , asking that he don his ": null
    },
    {
        "senatorial toga": "senatorial toga"
    },
    {
        " before hearing the Senates mandate. He then called out to his wife Racilia, telling her to bring his toga from their cottage. Once he was properly dressed, the delegation hailed him as a dictator and ordered him to come to the city. He crossed the ": null
    },
    {
        "Tiber": "tiber"
    },
    {
        " in one of the senates boats and was greeted on his return by his three sons and most of the senators. Several ": null
    },
    {
        "lictor": "lictor"
    },
    {
        "s were given to him for protection and enforcement of his orders.     The next morning, Cincinnatus went to the ": null
    },
    {
        "Forum": "roman forum"
    },
    {
        " and named Lucius Tarquitius as his ": null
    },
    {
        "master of the horse": "magister equitum"
    },
    {
        ". He then went to the assembly of the people and ordered every man of military age to appear on the ": null
    },
    {
        "Field of Mars": "campus martius"
    },
    {
        "  by the end of the day with twelve times the normal amount of ": null
    },
    {
        "encamping spikes": "sudis"
    },
    {
        ". They then marched to the relief of the consuls relieving army. At the ": null
    },
    {
        "Battle of Mount Algidus": "battle of mount algidus"
    },
    {
        ", they used their spikes to quickly besiege the besieging Aequi. Rather than slaughter them between the two Roman camps, Cincinnatus accepted their pleas for mercy and offered an amnesty provided that three principal offenders were executed and Gracchus Cloelius and their other leaders be delivered to him in chains. A ": null
    },
    {
        "yoke": "yoke"
    },
    {
        " of three spears was then set up and the Aequi made to pass under it as an act of submission, bowing and admitting their defeat. Cincinnatus then disbanded his army and returned to his farm, abandoning his control a mere fifteen days after it had been granted to him.            On the nomination of his brother or nephew ": null
    },
    {
        "Titus Quinctius Capitolinus Barbatus": "titus quinctius capitolinus barbatus"
    },
    {
        ", Cincinnatus came out of retirement for a second term as dictator in 42BC to deal with the feared plot of the wealthy plebeian ": null
    },
    {
        "Spurius Maelius": "spurius maelius"
    },
    {
        " to buy the loyalty of the poor and establish himself as king over Rome. Cincinnatus named ": null
    },
    {
        "C. Servilius Ahala": "gaius servilius ahala"
    },
    {
        " his ": null
    },
    {
        "master of the horse": "master of the horse"
    },
    {
        " and directed him to bring Spurius Maelius before him. He and the other patricians then garrisoned the Capitoline Hill and other strongholds around the city. Maelius fended off Ahalas officer with a butchers knife and fled into a crowd. Ahala led a band of patricians into the crowd and killed him during his flight. With the crisis resolved, Cincinnatus again resigned his commission, having served 42 days . Various aspects of the story are connected with dubious ": null
    },
    {
        "etiological legends": "etiological myth"
    },
    {
        " and it may have no more connection to the dictator of 42BC than the fact that the consul for the year was a member of the same clan.       Cincinnatus became a legend to the Romans. Twice granted supreme power, he held onto it for not a day longer than absolutely necessary. He consistently demonstrated great honorability and integrity. The high esteem in which he was held by the later Romans is sometimes extended to his compatriots. One legend from the end of his life claims a Capitolinus defended one of his sons from a charge of military incompetence by asking the jury who would go to tell the aged Cincinnatus the news in the event of a conviction. The son was said to have been acquitted because the jury could not bring itself to break the old mans heart.             Many Italian cities have plazas, streets, or other locations named after Cincinnatus . The ": null
    },
    {
        "Cincinnato": "cincinnato, italy"
    },
    {
        " neighborhood in ": null
    },
    {
        "Anzio": "anzio"
    },
    {
        ", Italy is named in his honor.     The legend of Cincinnatuss selfless service for his country has continued to inspire admiration. It has also been invoked to honor other political leaders, notably ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        ". Washingtons relinquishing of control of the ": null
    },
    {
        "Continental Army": "continental army"
    },
    {
        ", refusal to consider establishing a monarchy or assuming monarchical powers, and voluntary retirement after two terms as ": null
    },
    {
        "president": "president of the united states"
    },
    {
        " to return to his farm at ": null
    },
    {
        "Mount Vernon": "mount vernon"
    },
    {
        " have made allusions to Cincinnatus common in historical  and literary treatments of the era.     The ": null
    },
    {
        "Society of the Cincinnati": "society of the cincinnati"
    },
    {
        " was established by ": null
    },
    {
        "Henry Knox": "henry knox"
    },
    {
        " in 42 to assist the ": null
    },
    {
        "officers": "military officer"
    },
    {
        " of the ": null
    },
    {
        "Continental Army": "continental army"
    },
    {
        " and ": null
    },
    {
        "Navy": "continental navy"
    },
    {
        " and their families; to preserve the ideals of the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        "; and to maintain the ": null
    },
    {
        "union": "federalistunited states"
    },
    {
        " of the ": null
    },
    {
        "former colonies": "thirteen colonies"
    },
    {
        ". A French Society of the Cincinnati was founded soon afterward by King ": null
    },
    {
        "Louis XVI": "louis xvi"
    },
    {
        ". ": null
    },
    {
        "Cincinnati, Ohio": "cincinnati"
    },
    {
        " and ": null
    },
    {
        "Cincinnatus, New York": "cincinnatus, new york"
    },
    {
        ", in the United States, were named in its honor. ": null
    },
    {
        "Encyclopædia Britannica, 42th ed.": ":s:eb9"
    },
    {
        " , ": null
    },
    {
        "Vol. V": ":s:encyclopædia britannica, ninth edition/volume v"
    },
    {
        ", ": null
    },
    {
        "Cincinnati": ":s:encyclopædia britannica, ninth edition/cincinnati"
    }
]