[
    {
        "   Lulu is an ": null
    },
    {
        "opera": "opera"
    },
    {
        " in three acts by ": null
    },
    {
        "Alban Berg": "alban berg"
    },
    {
        ". Berg adapted the ": null
    },
    {
        "libretto": "libretto"
    },
    {
        " from ": null
    },
    {
        "Frank Wedekind": "frank wedekind"
    },
    {
        "s two Lulu ": null
    },
    {
        "plays": "play"
    },
    {
        ", Erdgeist  and Die Büchse der Pandora . The opera tells the story of a mysterious young woman known as Lulu, who follows a downward spiral from a well-kept mistress in Vienna to a street prostitute in London, while being both a victim and a purveyor of destruction. It explores the idea of the femme fatale and the duality between her feminine and masculine qualities. Berg died before completing the third and final act, and in the following decades the opera was typically performed incomplete. Since the 42 publication of the version including ": null
    },
    {
        "Friedrich Cerha": "friedrich cerha"
    },
    {
        "s orchestration of the act 42 sketches, it has become standard. Lulu is especially notable for using ": null
    },
    {
        "serialism": "serialism"
    },
    {
        " at a time that was particularly inhospitable to it. ": null
    },
    {
        "Theodor W. Adorno": "theodor w. adorno"
    },
    {
        " wrote, The opera Lulu is one of those works that reveals the extent of its quality the longer and more deeply one immerses oneself in it.            Berg was familiar with Wedekinds Erdgeist by 42 when he was nineteen. He also saw Die Büchse der Pandora in 42 in a production by ": null
    },
    {
        "Karl Kraus": "karl kraus"
    },
    {
        " on 42 May, and was inspired by the introductory speech that Kraus delivered on that occasion. In Wedekinds two Lulu plays, now often performed together under that title, Erdgeist forms the basis for the act 42 and act 42 scene 42 of the opera culminating in her shooting Dr. Schön, while Die Büchse der Pandora forms the basis for the rest of act 42 and act 42 Lulus imprisonment, escape and subsequent decline and murder.       Berg did not begin work on Lulu until after he had completed his other opera,  Wozzeck , in 42 Thanks to Wozzecks success Berg had the economic security that enabled him to embark on a second opera. However, life for the musical world was becoming increasingly difficult in the 42s both in Vienna and Germany due to rising ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " and the ": null
    },
    {
        "Nazi": "nazi"
    },
    {
        " cultural ideology that denounced ": null
    },
    {
        "modernity": "modernity"
    },
    {
        ". Even to have an association with someone who was Jewish could lead to denunciation, and Berg had studied with the Jewish composer ": null
    },
    {
        "Arnold Schoenberg": "arnold schoenberg"
    },
    {
        ". Wozzecks success was short lived as theatre after theatre succumbed to political pressure and refused to produce it, Erich Kleiber s 42 November 42 production being the last, while sets and scenery were systematically destroyed. Wozzeck was also banned in the Soviet Union as bourgeois . Berg found that opportunities for his work to be performed in Germany were growing scarce and in September 42 his music was proscribed as Entartete Musik under the label Kulturbolschewismus .     Despite these conditions, Berg worked on the score of Lulu in seclusion at his lodge, the Waldhaus, in Carinthia . In the spring of 42 he learned from Wilhelm Furtwängler that production of Lulu in Berlin would be impossible under the current cultural and political situation. It was at this point that he set the work on the opera aside to prepare a concert suite, in the event that the opera could never be performed, and also considered expanding it into a Lulu Symphony. This was his Symphonische Stücke aus der Oper Lulu   for soprano and orchestra. Subsequently Erich Kleiber performed the piece at the Berlin State Opera on 42 November, and despite an enthusiastic reception by some sections of the audience, the subsequent condemnation by the authorities prompted Kleibers resignation four days later and subsequent departure from Germany. In particular the reaction of periodicals such as ": null
    },
    {
        "Die Musik": "die musik"
    },
    {
        " and Zeitschrift für Musik was exceptionally hostile. A few days later, on December 42 Goebbels made a speech equating atonality with the Jewish intellectual infection, while the January 42 issue of Die Musik suggested that any reviewer who had written anything favourable about the suite should be dismissed.     In January 42 the Russian-born American violinist Louis Krasner , who had championed Bergs work in the United States, had approached Berg to commission a violin concerto. Berg was reluctant to set aside Lulu for this, but the money was welcomed, as Berg was in financial difficulties, financially and artistically ruined by the ": null
    },
    {
        "Reichskulturkammer": "reichskulturkammer"
    },
    {
        " . At first there was only a tentative agreement, but at the end of March he told Krasner he would compose it and had started some preliminary work. But it was the tragic death of eighteen-year-old Manon Gropius on April 42 that prompted Berg to set aside Lulu for the concerto, which he dedicated to her. The violin concerto was completed swiftly, between April and August of that year but the time he spent on that meant he was unable to complete the opera before his sudden death on December 42     The following portions of the third and final act were fully scored: the first 42 bars; the instrumental interlude between scenes 42 and 42; and the finale of the opera, beginning with the monologue of Countess Geschwitz.  The rest of the work remained in short score with indications of instrumentation for much of it. Berg was able to hear the Symphonic Pieces in a BBC radio broadcast from the Queens Hall , London, on 42 March 42 conducted by Sir Adrian Boult and produced by Edward Clark . It was the first time he had ever heard any of the music of Lulu. He was not to hear these excerpts performed live until a concert in Vienna on December 42 a fortnight before his death.       Berg specified that a number of cast members should take more than one role. Thus, the singers of Lulus three husbands return as her clients while a prostitute: one performer each appears as the Doctor and the Professor, as the Painter and the Negro, and as Dr. Schön and Jack the Ripper. Other specified combinations are one mezzo-soprano as the Dresser, the Schoolboy, and the Groom; one tenor as the Prince, the Manservant, and the Marquis; one bass as the Animal Tamer and the Athlete, and another bass as the Theatre Manager and the Banker. Another aspect of the cast list that differs from Wedekinds original is that all characters in the two plays receive a proper name. Berg removed all of these names except for the five leading roles of Lulu, Schön, Alwa, Geschwitz and Schigolch. Some of Wedekinds other names have been sometimes applied to Bergs characters: for example the Athlete is often referred to as Rodrigo Quast , but this name is nowhere to be found in the score.       It is late42th-century Vienna. Lulu is married to Dr Goll, a physician. Lulu, who goes by the name Nelly, is having her portrait painted by Walter Schwarz, an artist who is in love with her. Dr Ludwig Schön, a newspaper editor and widower, and his son Alwa, a composer, are briefly present. As the artist pursues Lulu, they are surprised by her husband, who suffers a fatal stroke. Lulu marries Schwarz, and they appear to prosper with Dr Schöns help. But Lulu is troubled when she discovers Schön has become engaged. The latter visits her and reveals how he has taken her from the street and raised her, but they have been in a relationship. He says that Schigolch, an elderly beggar, is her father. When Schön tells Schwarz about Lulus past, he is horrified and he kills himself. Schön then puts Lulu on the stage, where she creates a scene over his fiancée and compels him to write a letter breaking off the engagement. Lulu marries Schön, who is jealous of her admirers, of which there are many, including the lesbian Countess Geschwitz and his own son Alwa, on whom he eavesdrops, learning that Lulu poisoned his first wife. He gives her a gun and tells her to shoot herself. Instead she kills him, for which she is tried and imprisoned, but she contrives to escape after changing places with Countess Geschwitz. Alwa and Lulu flee to Paris, from where they once again flee, destitute, to London, where Lulu is obliged to work the streets, but brings home Jack the Ripper, who murders her.            The animal tamer appears from behind the curtain, whip in hand     A circus animal tamer welcomes the audience, Hereinspaziert in die Menagerie and describes the various animals in his menagerie , such as tigers, bears and monkeys. He lifts the curtain, and calls for the snake to be brought on. A stage hand carries out Lulu  dressed as Pierrot , while the animal tamer describes her in biblical terms as the source of evil, fated to murder, Sie ward geschaffen, Unheil anzustiften ... Zu morden – ohne dass es einer spürt. , and orders her off, while inviting the audience to see what will unfold. He then retires behind the curtain, which rises on scene 42         Scene 42: A spacious but shabby artists studio. A podium, folding screen, easel with unfinished portrait of Lulu, divan with tiger skin, step ladder and sculpture. Lulu is standing on the podium, posing as Pierrot, holding a shepherds crook     The Painter is painting Lulus portrait. Dr. Schön is watching, and is joined by his son, Alwa. He excuses himself because he has to go to a rehearsal, and he and Dr. Schön leave. Alone with Lulu, the Painter makes passes at her. She rejects him initially, as he pursues her round the studio , during which the ladder falls and the statue breaks. At one stage, he also refers to her as Eva. She explains that she is expecting her husband. Eventually she succumbs to his advances. The artist has locked the studio door, and when Dr. Goll arrives, there is consternation. However, he manages to break the door down, and on finding Lulu and the artist together, dies of a stroke. At first they do not realise her husband is dead and he goes to call a doctor. Lulu is alone with her husbands corpse, . When she accepts that he is dead, she reflects that she is now rich, to the artists horror, Jetzt bin ich reich – Es ist grauenerregend . They sing a duet in which he questions her beliefs, and the answer is always the same, Eine Frage: Kannst Du die Wahrheit sagen? – Ich weiss es nicht . While Lulu is changing into her street clothes, the artist addresses her husbands corpse .     Interlude     Scene 42: An elegant drawing room in Lulus apartment, the studio beyond, her finished portrait on the wall. Lulu, on a chaise-longue is gazing into her hand mirror     The artist enters with the mail, again addressing her as Eve. In the mail he learns he has sold another painting of her, and mentions he has sold a number of paintings since they were married. She places one, a letter from Countess Corticelli, in her bosom. Another brings notice of Dr. Schöns engagement, which seems to trouble her. They sing a love duettino, Ich finde, Du siehst heute reizend aus – Ich komme aus dem Bad . She is visited by Schigolch, who remarks of the artist . Schigolch is an asthmatic beggar who seems to have been featured in her past in an unspecified way, he asks for money which she gives him, and when he calls her Lulu , she states she has not been called that in a long time. As she is showing him out, Dr. Schön arrives  and recognises him, referring to him as Lulus father, which she does not deny. Dr. Schön asks Lulu to stay out of his life from now on, since he is engaged and it would be scandalous for them to see each other socially, but she says she belongs only to him . Their discussion reveals that all the good fortune Lulu has experienced comes from the interventions of Schön, and that they have been meeting regularly. The exchange becomes increasingly agitated, until the return of the artist, who asks what has transpired. Lulu leaves in a huff, while Schön implies that he has had a longstanding affair with Lulu, since she was twelve, and rescued her from the streets as a flower seller. The artist becomes increasingly distressed as he learns how little he knows about Lulu, not even her name, which appears to be different for every lover. Schön informs him about Schigolch being her father, and that after the death of his wife, Lulu appeared to be trying to take her place, so that he arranged to marry her off to Dr Goll. Increasingly Schön urges the artist to confront Lulu, which he agrees to and leaves the room, but a terrible groan is heard off stage and Schön discovers the artist has locked the door. Lulu returns and they discuss what to do next, but are interrupted by the arrival of Alwa, who announces that revolution has broken out on the streets of Paris, which is causing consternation back at the newspaper office. Lulu brings a hatchet, and they force open the door, only to find the artist is dead. From a partly audible telephone conversation Schön has, which he implies is with the police, it is revealed that the artist cut his throat. Lulu, once again, is unmoved by the tragedy, while Schön and Alwa hope that the political news will sweep aside the scandal. When Schön calls her Ungeheuer! , Lulu hints that she and Dr. Schön will be married after all . The curtain falls as the door bell rings, which they believe is the police.     Interlude      Scene 42: In Lulus dressing room in the theatre, a folding screen upstage, a poster of Lulus portrait is seen     Lulu is changing behind the screen, Alwa is pouring champagne. The two discuss whether Schön will come that night, and a Prince who wants to take her to Africa. Alwa recalls his mothers death, and how he had hoped that Lulu would replace her, while Lulu observes that his father put her on the stage in the hope that somebody rich would marry her and take her off his hands. Lulu emerges in a ballet dress, Alwa appears smitten and they drink. At the sound of a bell, Lulu leaves to take the stage. Alwa watches her leave and then contemplates writing an opera based on Lulus life, but as he draws out the scenes he comes to the conclusion that they are too gruesome. Applause can be heard, and the Prince enters and reveals his wish to marry Lulu. It is apparent her sudden fame is due to favourable reviews published by Schön. Suddenly the bell starts ringing incessantly and an uproar is heard off stage. Alwa appears startled and Lulu enters suddenly, flinging herself in a chair, followed by the dresser and theatre manager who explain that she fainted. She implies it was because she saw Schön with his fiancée, Mit seiner Braut! whereupon Schön himself enters and Lulu refuses to continue because his fiancée is in the audience. All try to persuade Lulu to return to the stage, in a sextet Das hättest Du Dir besser erspart! , then Schön dismisses the company leaving Lulu and himself alone. He admonishes her, Wie kannst Du die Szene gegen mich ausspielen? , they argue and she taunts him with the Prince and his inability to break off their relationship. It is apparent that he is torn between the two women, and she begins to exploit his weakness, compelling him to write a letter that she dictates, breaking off the engagement . Schön expresses feelings of impending doom, Jetzt – kommt – die Hinrichtung... and Lulu having achieved her purpose prepares to return to the stage       Scene 42: In Lulus house, a magnificent German Renaissance style room with a gallery and staircase. A folding Chinese screen in front of the fireplace. Again, Lulus portrait can be seen, this time on an easel. Lulu is in an armchair in a morning gown, Countess Geschwitz on an ottoman, in masculine clothes, her face veiled. Dr Schön is standing     Countess Geschwitz, an admirer of Lulu now married to Schön, is visiting her to invite her to a ball. She has brought flowers and, complimenting her on her portrait, wishes to paint her herself. Schön is clearly uncomfortable and Lulu shows Geschwitz out. Schön, left alone appears disturbed and jealous and speaks of madness, producing a revolver , Der Irrsinn hat sich meiner Vernunft schon bemächtigt . On her return Lulu tries to convince Schön to take the afternoon off and go for a drive with her , but he points out that he is due at the stock exchange . Lulu starts to lavish affection on Schön, and they go into the bedroom, whereupon Geschwitz reenters the house and hides behind the screen. Schigolch and two other admirers, the athlete, who is carrying the struggling schoolboy , all enter. Schigolch states that he also lives in the house and that they have paid him to leave them with Lulu, who then reappears. She is dressed for the ball, décolleté with orchids between her breasts. She leans in to the schoolboy, urging him to smell the flowers. As she leaves they begin to discuss the Prince, who has gone abroad  and Schigolch states that he too, like the rest of the world wishes to marry Lulu, Wer hat sie nicht ursprünglich heiraten wollen! , a sentiment with which they all agree, as he explains that Lulu is not his daughter.     When Lulu returns, she also agrees that she never had a father. They discuss Schön, who has left for the exchange, and what Lulu refers to as his Verfolgungswahn , but a servant announces his return and the athlete and schoolboy also hide while Schigolch starts to leave. However, it is Alwa who enters, not his father and she orders refreshments as they sit and start to talk and flirt. Schön enters unnoticed, sees his son, and he too hides. Their conversation becomes more intense and Alwa declares his love for Lulu, Liebst Du mich Mignon? , burying his head in her lap. At this point, Lulu confesses to Alwa that she poisoned his mother. Meanwhile, unnoticed by the couple Schön sees the athlete and draws his revolver, but the athlete indicates it is Alwa he should kill, and hides again, but by this time Lulu notices them and announces his presence.     Schön reveals himself, once again announcing revolution in Paris, newspaper in hand and drags Alwa away. The athlete briefly reappears pursued by Schön, revolver in hand. Schön, believing the athlete escaped, begins to harangue Lulu , handing the revolver to Lulu, who appears unperturbed, and implying she should kill herself before he kills Alwa. She points the revolver at him, but instead she fires at the ceiling. Increasingly agitated, Schön seizes the revolver and begins to search the house looking for Lulus lovers, but finds only Geschwitz whom he locks in another room. Again he gives Lulu the gun, implying her suicide will save his reputation from being considered a cuckold , meine Stirn zu verzieren – i.e. with horns. Lulu sings the Lied der Lulu  in which she asks for a divorce, saying she can only be als was ich bin . Schön only replies that he will murder her and make it look like suicide, forcing her to her knees and pointing the gun at her while holding it in her hand . While Schön is momentarily distracted by the schoolboys sudden appearance, Lulu empties the remaining five rounds into him. However, he is still alive, and realises he has yet another rival, Und – da – ist – noch – einer! . He calls for his son, who reappears, while Lulu appears remorseful, and then he dies. Lulu goes to leave but Alwa bars her way. She begs him not to give her up , which he refuses to do despite her offers to be his for the rest of her life, Ich will Dir treu sein mein Leben lang . Once again, a doorbell announces the arrival of the police.     Interlude in the form of a ": null
    },
    {
        "silent film": "silent film"
    },
    {
        ". Both film and the musical accompaniment are in the form of a ": null
    },
    {
        "palindrome": "palindrome"
    },
    {
        ". The film depicts four main events, pivoting on Lulus one year in prison, and four following her imprisonment, forming the palindrome. The first sequence shows the arrest, detention, trial and the prison door closing. The second sequence shows the reverse with the prison door opening, the medical assessment, the isolation ward in hospital, and her escape. In each mirror event the number of people involved is the same, for example three people arrest her and three liberate her. As the palindrome progresses, Lulu loses hope in detention, is tried and transferred to prison, where she becomes resigned to her fate. There hope returns as she contracts ": null
    },
    {
        "cholera": "cholera"
    },
    {
        " and after a further trial by doctors is transferred to hospital where hope grows as Geschwitz visits her, they change clothes, and Lulu escapes disguised as the other woman. During the palindrome many details and symbols, before and after prison, match each other, including Lulus portrait, a recurring visual ": null
    },
    {
        "motif": "motif"
    },
    {
        " throughout the opera.     Scene 42: The same place as scene 42 one year later, an air of neglect, daylight has been shut out. The portrait is now leaning against the fireplace, facing away from the audience,     Countess Geschwitz, Alwa and the athlete are anxiously awaiting Schigolch, and discussing the escape plan. The athlete is dressed as Alwas footman and is planning to marry Lulu and take her to Paris as an acrobat. Geschwitz appears frail and will take Lulus place in hospital. She is funding the escape, but refuses Alwas offer of financial help. She is going to sacrifice her own freedom by taking Lulus place so that nobody will discover she has escaped until it is too late. When Schigolch arrives, he and Geschwitz depart for the hospital, while the other two men discuss their plans. Alwa has sold the newspaper and written a melodrama for Lulu to star in. They begin to argue over money but are interrupted by the schoolboy  who has just broken out of prison and has also devised a scheme to free Lulu. Alwa and the athlete lie to him that Lulu is dead, showing him a newspaper article about her illness, then they throw him out. Schigolch arrives with Lulu , looking very pale and weak from her illness. The athlete is disgusted at seeing her in this state, abandons his plan and goes off saying that he will summon the police instead. Schigolch goes to buy train tickets and as soon as he has gone Lulu, who has been acting the part of the invalid, makes an instant recovery. Now left alone with Alwa she explains the plot in detail. Geschwitz went to Hamburg to nurse cholera patients and deliberately infected both herself and Lulu with contaminated clothing so that they were both placed in an isolation ward together. After Geschwits was discharged, she returned to visit Lulu and they changed places , while Lulu feigned invalidism in order to get rid of the athlete. Now alone with Alwa, the portrait is returned to the easel and Lulu proceeds to seduce the willing Alwa once again. They declare their love for each other in a second love duet, uns sehen, so oft wir wollen reaching its climax with Alwas hymn to Lulu , and make plans agreeing to go away together. At the end of the duet and scene she asks him, Ist das noch der Diwan, – auf dem sich – dein Vater – verblutet hat? .       Scene 42: A spacious drawing room in Lulus luxurious house in Paris. Lulus portrait hangs on the wall. The guests are assembled     Lulu is living in Paris under the alias of a French countess, a grand birthday party is taking place at Lulus house and the athlete who is planning to get married proposes a toast to her. The Marquis shows an unusual interest in the fifteen-year-old girl. The guests move to the gaming room to play baccarat . The conversation moves to discussing shares in the Jungfrau Railway, which most of the guests at the party have invested in to varying extents, and which appear to be performing magnificently.     The Marquis has discovered Lulus true identity, and is blackmailing her , threatening to hand her over to the authorities. She offers herself to him, having had a previous affair, but his interests lie more in human trafficking of women and girls for commercial sexual exploitation , Lied des Mächenhändlers: Ich sagte dir doch, daß ich auch Mächenhändler bin . Again, Lulu sings about who she is and what she has become, as in her act II Lied; Ich tauge nicht für diesen Beruf. Als ich fünfzehn Jahre alt war, hätte mir das gefallen können . The Marquis indicates he could summon the policeman stationed out in the street and claim the reward for her capture, but he would get a far higher price by selling her to a Cairo brothel to whom he has sent a picture of her portrait as Eve. She offers to pay him, but he is aware that Alwas fortune is all in the railway shares, and he wants cash and gives her a deadline later that day. She reads a note the athlete handed her just before the Marquis confronted her and learns that he too wants to blackmail her. Geschwitz accuses her of not returning the favours and affection she showed Lulu when they were in hospital. The athlete returns and makes it apparent that he is still interested in Lulus affections and also gives her a deadline, duet: Einen Moment! Hast du meinen Brief gelesen? . A telegram arrives for the Banker informing him the railway shares are now worthless. When Schigolch arrives, asking for money for his girlfriend , Lulu collapses in despair but confides in him.     Schigolch too has designs upon Lulu, but she persuades him that if he can arrange for the athletes death she will give him the money, which he says he will do if she can persuade the athlete to come to his home, which she promises. The Marquis suspects the athlete, but he denies it. Lulu then proceeds to convince the athlete that if he spends the night with Geschwitz, she will pay Lulu who can then pay him the blackmail money. She then persuades the countess that she will give herself to her if she spends the night with the athlete. Although puzzled, Geschwitz agrees to the bargain. Having achieved this, Lulu turns to her valet and orders him to change clothes with her. The news of the railway collapse spreads through the company to general despair. Lulu, dressed as her valet, informs Alwa they have been discovered and the police are on their way, and they escape. Again the scene ends with the arrival of the police, who confront the valet before realising their mistake.     Scene 42: A windowless ": null
    },
    {
        "garret": "garret"
    },
    {
        " in London, with a leaking skylight. A bucket collects water dripping from the skylight. On the floor a torn mattress. A door leads to Lulus bedroom     Alwa and Schigolch are discussing their predicament. They and Lulu are now living in poverty and on the run. It is Lulus first day of work as a Freudenmädchen , from which they intend to make a living, although Alwa is ambivalent. When they hear Lulu approaching with her first client, a professor, they hide. The professor remains silent throughout, is very gentle and pays her generously. Lulu is thrilled. The Countess Geschwitz, now shabbily dressed, then arrives with the portrait of Lulu, which she has removed from the frame and brought from Paris. Lulu is disturbed at seeing it, but Alwa is inspired and hangs it on the wall, believing it will please the clients, and they discuss the fate of the artist, quartet: Ihr Körper stand auf dem Höhepunkt . Lulu goes out to prove her attractiveness, leaving with Geschwitz. Alwa reveals that Lulu had contracted venereal disease from the Marquis and in turn passed it on to him.     Lulu returns with her second client, the Negro, Komm nur herein, mein Schatz! Komm! , who becomes angry at being asked to pay in advance and attacks her. Alwa rushes to her defence but is killed by the Negro, who then leaves, followed by Lulu in despair while Schigolch removes the body. Geschwitz returns, saying Lulu sent her away, while Schigolch leaves. She produces a gun and considers killing herself, bitterly believing that Lulu would shed mir keine Träne nach , then changes her mind and goes to hang herself, pausing first in reverence before Lulus portrait. She is interrupted by the entrance of Lulu and her third client, Jack the Ripper. When asked, she says Geschwitz is her crazy sister. Jack makes to leave, saying he has little money and she is asking too much, she pleads with him and they haggle over the price, while she reveals it is her first day on the job, as he suspected. He also guesses the true nature of Geschwitzs feelings for Lulu. Lulu says she is drawn to Jack and eventually offers to give herself to him without payment. They go into the bedroom. Geschwitz, left to herself, resolves to return to Germany to become a lawyer and work for womens rights. On hearing Lulus screams, she rushes to the bedroom door but Jack emerges with a blood-stained knife that he plunges into her body, and she collapses. Jack calmly washes his hands in the basin, not believing his luck at having killed two women at once, Ich bin doch ein verdammter Glückspilz! , complains about the lack of a towel and leaves. In her dying breath Geschwitz declares her eternal love for Lulu, Lulu! Mein Engel! Laß dich noch einmal sehn! Ich bin dir nah! Bleibe dir nah! In Ewigkeit! .           The character of Lulu has been described as embodying both elements of female sexualitys dualism, earth-mother and whore . In the words of Karl Kraus , she is the woman who became the destroyer of all because everyone destroyed her . Bergs involvement with the lower depths of society in his two dramatic works, ": null
    },
    {
        "Wozzeck": "wozzeck"
    },
    {
        " and Lulu, surprised even Schoenberg. Like Wozzeck, Lulu is social criticism, a tragedy in which the protagonists are portrayed as victims, gradually becoming enslaved to social forces they are too weak to deal with. Palindromes in the piece take many forms, such as the rise and fall of Lulu and the recycling of the actors: the three men whose deaths she contributes become Lulus three clients, and the man she murdered murders her. Alwa, thought to be the antithesis of Lulu, was changed from Wedekinds dramatist to Bergs composer, and is assumed to be a stand-in for Berg himself. In all cases the music underscores and confirms Bergs dramatic allusions.                   ;Woodwinds:   : 42 flutes   : 42 oboe s   : 42 clarinet s in B-flat   : 42 bass clarinet in B♭   : 42 alto saxophone in E♭   : 42 bassoon s     ;Brass:   : 42 horns in F   : 42 trumpet s in C   : 42 trombone s   : tuba         ; Percussion   : timpani   : triangle   : tambourine   : snare drum   : jazz drum   : bass drum   : cymbal s   : switch   : 42 tam-tams   : xylophone   : vibraphone     ;Keyboard:   : piano     ;Strings:   : harp     : violin s I   : violins II   : viola s   : cello s   : double bass es         The onstage jazz band in Act I, scene iii consists of:         : 42 clarinet s in B♭   : 42 bass clarinet in B♭   : 42 alto saxophone in E♭   : 42 tenor saxophone in B♭   : 42 contrabassoon   : 42 Jazz trumpets in C   : 42 Jazz trombones   : 42 sousaphone         : Jazz drum set   : 42 banjo   : 42 piano   : 42 violins with jazz horns   : 42 contrabass       In Act III, scene i, Cerhas edition uses a smaller onstage ensemble that requires:     A piccolo   A flute   42 clarinet s   A bass clarinet   A contrabassoon     In Lulu, Berg introduced the vibraphone into the orchestra of Western art music, an instrument that had been previously solely associated with jazz.       thu   Berg was obsessed with symmetry in his works and Lulu is no exception, the whole being perceived as a palindrome or mirror. Lulus popularity in the first act is mirrored by the squalor she lives in during act 42 and this is emphasised by Lulus husbands in act 42 being played by the same singers as her clients in act 42 The motifs associated with each, being repeated.     This mirror-like structure is further emphasised by the film interlude at act 42 at the very centre of the work. The events shown in the film are a miniature version of the mirror structure of the opera as a whole and the music accompanying the film is an exact palindrome – it reads the same forwards as backwards. The centre-point of this palindrome is indicated by an arpeggio played on the piano , first rising, then falling .     Berg assigns specific vocal styles to each character with descriptive orchestral representation, recapitulative episodes to emphasise psychological significance and pitch-sets . Recapitulation includes having single singers performing multiple roles. The use of pitch includes the use of twelve- tone row s.       Cell z is the basic cell of Lulu and generates trope I:     thu     Although some of Lulu is freely composed, Berg also makes use of his teacher Arnold Schoenbergs twelve-tone technique . Rather than using one tone row for the entire work, however, he gives each character his or her own tone row, meaning that the tone rows act rather like the leitmotif s in Richard Wagner s operas.     thu     From this one tone row, Berg derives tone rows for many of the characters. For example, the tone row associated with Lulu herself is: F, G, A, B, C, D, F, D, E, A, B, C. This row is constructed by extracting one note from the basic rows first trichord, then taking the next note from the basic rows second trichord, then taking the third note from the basic rows third trichord, and so on, cycling through the basic row three times.     thu     The tone row associated with Alwa is arrived at by repeating the basic tone row over and over and taking every seventh note;   thu   this results in the following tone row: B, F, E, G, F, B, E, D, A, C, C, G     thu     Similarly, the tone row associated with Dr. Schön is arrived at by repeating the basic tone row and taking the first note, missing one note, taking the next, missing two, taking the next, missing three, taking the next, missing three, taking the next, missing two, taking the next, missing one, taking the next, missing one, taking the next, missing two, taking the next, and so on; this results in the following tone row: B, E, G, G, D, F, E, A, B, C, F, C     thu       The opera was first performed by the Zürich Opera in an incomplete form on June 42 42 Erwin Stein made a vocal score of the whole of act 42 following Bergs death, and Helene Berg, Albans widow, approached Arnold Schoenberg to complete the orchestration. Schoenberg at first accepted, but upon being sent copies of Bergs sketches he changed his mind, saying that it would be a more time-consuming task than he had thought. Helene subsequently forbade anybody else to complete the opera, and for over forty years only the first two acts could be given complete, usually with the act 42 portions of the Lulu Suite played in place of act 42 The last recording made of the original two-act version— Christoph von Dohnányi conducting the Vienna Philharmonic , with Anja Silja in the title role —presented it in this form.     Director Heinz Ruckert shot the silent film featured at the midpoint according to Bergs exacting specifications. The film wordlessly depicts Lulus arrest, trial, incarceration, and ultimate liberation thanks to the cunning of the Countess Geschwitz. Like the music for this sequence , the film has a palindromic structure. The original film is lost save for four stills which remain in the Zürich Stadtarchiv. Each successive production requires a new film to be shot with the stage actors. However, many recent productions omit the film altogether.       Following the Zürich premiere, the opera was seen at La Fenice on 42 September 42 during the Venice Biennale , conducted by Sanzogno . The German premiere was at the Grillo-Theater in Essen on 42 March 42 with Carla Spletter in the title role, and the Netherlands premiere on July 42 of that year at the Stadsschouwburg in Amsterdam as part of the Holland Festival , both with conducted by Gustav König and broadcast to the UK on the BBC on 42 August. This was followed by a production at Hamburg in 42 with Helga Pilarczyk in a Günther Rennert production, conducted by Leopold Ludwig which was also seen at the Paris Opera in 42 and La Scala in 42 and Sadlers Wells 42     In its two-act form plus sketches of the third act, Lulu": null
    }
]