[
    {
        "        The lunar phase or phase of the Moon is the shape of the directly ": null
    },
    {
        "sunlit": "sunlight"
    },
    {
        " portion of the ": null
    },
    {
        "Moon": "moon"
    },
    {
        " as viewed from ": null
    },
    {
        "Earth": "earth"
    },
    {
        ". The lunar phases gradually and cyclically change over the period of a ": null
    },
    {
        "synodic month": "lunar monthsynodic month"
    },
    {
        " , as the ": null
    },
    {
        "orbit": "orbit"
    },
    {
        "al positions of the Moon around Earth and of Earth around the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " shift.     The Moons rotation is ": null
    },
    {
        "tidally locked": "tidal locking"
    },
    {
        " by Earths ": null
    },
    {
        "gravity": "gravity"
    },
    {
        "; therefore, most of the same lunar side always faces Earth. This ": null
    },
    {
        "near side": "near side of the moon"
    },
    {
        " is variously sunlit, depending on the position of the Moon in ": null
    },
    {
        "its orbit": "orbit of the moon"
    },
    {
        ". Thus, the sunlit portion of this face can vary from 0%  to 100% . The ": null
    },
    {
        "lunar terminator": "terminator lunar terminator"
    },
    {
        " is the boundary between the illuminated and darkened hemispheres.     Each of the four intermediate lunar phases is around 7.4 ": null
    },
    {
        "day": "day"
    },
    {
        "s, but this ": null
    },
    {
        "varies slightly": "orbital eccentricity"
    },
    {
        " due to the ": null
    },
    {
        "elliptical": "elliptic orbit"
    },
    {
        " shape of the Moons orbit. Aside from some ": null
    },
    {
        "craters": "lunar craters"
    },
    {
        " near the lunar poles, such as ": null
    },
    {
        "Shoemaker": "shoemaker"
    },
    {
        ", all parts of the Moon see around 14.77 days of ": null
    },
    {
        "daylight": "daylight"
    },
    {
        ", followed by 14.77 days of ": null
    },
    {
        "night": "night"
    },
    {
        " .           In ": null
    },
    {
        "western culture": "western culture"
    },
    {
        ", the four principal phases of the Moon are ": null
    },
    {
        "new moon": "new moon"
    },
    {
        ", first quarter, ": null
    },
    {
        "full moon": "full moon"
    },
    {
        ", and third quarter . These are the instances when the Moons ": null
    },
    {
        "ecliptic longitude": "ecliptic coordinate system"
    },
    {
        " and the Suns ": null
    },
    {
        "ecliptic": "ecliptic"
    },
    {
        " longitude differ by 0°, 90°, 180°, and 270°, respectively. Each of these phases occur at slightly different times when viewed from different points on Earth. During the intervals between principal phases, the Moons apparent shape is either ": null
    },
    {
        "crescent": "crescent"
    },
    {
        " or ": null
    },
    {
        "gibbous": "wikt:gibbous"
    },
    {
        ". These shapes, and the periods when the Moon shows them, are called the intermediate phases and last one-quarter of a ": null
    },
    {
        "synodic month": "synodic month"
    },
    {
        ", or 7.38 days, on average. However, their durations ": null
    },
    {
        "vary slightly": "orbital eccentricity"
    },
    {
        " because the ": null
    },
    {
        "Moons orbit": "orbit of the moon"
    },
    {
        " is rather ": null
    },
    {
        "elliptical": "elliptic orbit"
    },
    {
        ", so the satellites ": null
    },
    {
        "orbital speed": "orbital speed"
    },
    {
        " is not constant. The descriptor waxing is used for an intermediate phase when the Moons apparent shape is thickening, from new to full moon, and waning when the shape is thinning.     The eight principal and intermediate phases are given the following names, in sequential order:                         Non-Western cultures may use a different number of lunar phases; for example, traditional ": null
    },
    {
        "Hawaiian culture": "hawaiian culture"
    },
    {
        " has a total of 30 phases .        When the Sun and Moon are ": null
    },
    {
        "aligned on the same side": "conjunction"
    },
    {
        " of the Earth, the Moon is new , and the side of the Moon facing Earth is not illuminated by the Sun. As the Moon waxes , the lunar phases progress through new moon, crescent moon, first-quarter moon, ": null
    },
    {
        "gibbous": "wikt:gibbous"
    },
    {
        " moon, and full moon. The Moon is then said to wane as it passes through the gibbous moon, third-quarter moon, crescent moon, and back to new moon. The terms old moon and new moon are not interchangeable. The old moon is a waning sliver until the moment it aligns with the Sun and begins to wax, at which point it becomes new again.  Half moon is often used to mean the first- and third-quarter moons, while the term quarter refers to the extent of the Moons cycle around the Earth, not its shape.     When an illuminated hemisphere is viewed from a certain angle, the portion of the illuminated area that is visible will have a two-dimensional shape as defined by the intersection of an ": null
    },
    {
        "ellipse": "ellipse"
    },
    {
        " and circle . If the half-ellipse is convex with respect to the half-circle, then the shape will be gibbous , Origin: 1350–1400; Middle English ": null
    }
]