[
    {
        "           Lutefisk  or lutfisk  is a ": null
    },
    {
        "traditional dish": "traditional dish"
    },
    {
        " of some ": null
    },
    {
        "Nordic countries": "nordic countries"
    },
    {
        ". It is traditionally part of the Christmas feast: the Norwegian ": null
    },
    {
        "julebord": "julebord"
    },
    {
        " and Swedish ": null
    },
    {
        "julbord": "julbord"
    },
    {
        ", as well as the similar Finnish ": null
    },
    {
        "joulupöytä": "joulupöytä"
    },
    {
        ".     It is made from aged ": null
    },
    {
        "stockfish": "stockfish"
    },
    {
        " , or ": null
    },
    {
        "dried and salted whitefish": "dried and salted cod"
    },
    {
        " , and ": null
    },
    {
        "lye": "lye"
    },
    {
        " . It is ": null
    },
    {
        "gelatinous": "gelatinous"
    },
    {
        " in texture. Its name literally means lye fish.                   Lutefisk is dried ": null
    },
    {
        "whitefish": "whitefish"
    },
    {
        "  treated with ": null
    },
    {
        "lye": "lye"
    },
    {
        ". The first step is soaking the ": null
    },
    {
        "stockfish": "stockfish"
    },
    {
        " in cold water for five to six days . The saturated stockfish is then soaked in an unchanged solution of cold water and lye for an additional two days. The fish swells during this soaking, and its ": null
    },
    {
        "protein": "protein"
    },
    {
        " content decreases by more than 42 percent, producing a ": null
    },
    {
        "jelly": "gelatin"
    },
    {
        "-like consistency.     When this treatment is finished, the fish is ": null
    },
    {
        "caustic": "causticity"
    },
    {
        ", with a ": null
    },
    {
        "pH": "ph"
    },
    {
        " of 42–42 To make the fish edible, a final treatment of yet another four to six days of soaking in cold water is needed. Eventually, the lutefisk is ready to be cooked.     In Finland, the traditional ": null
    },
    {
        "reagent": "reagent"
    },
    {
        " used is ": null
    },
    {
        "birch": "birch"
    },
    {
        " ash. It contains high amounts of ": null
    },
    {
        "potassium carbonate": "potassium carbonate"
    },
    {
        " and ": null
    },
    {
        "bicarbonate": "potassium bicarbonate"
    },
    {
        ", giving the fish a more mellow treatment than wood lye. It is important not to marinate the fish too long in the lye because ": null
    },
    {
        "saponification": "saponification"
    },
    {
        " of the fish fats may occur.       After the preparation, the lutefisk is saturated with water and must therefore be cooked extremely carefully so that it does not fall to pieces.        To create a firm consistency in lutefisk, it is common to spread a layer of salt over the fish about half an hour before it is cooked. This will release some of the water in the fish meat. The salt must be rinsed off carefully before cooking.     Lutefisk does not need additional water for the cooking; it is sufficient to place it in a pan, salt it, seal the lid tightly, and let it ": null
    },
    {
        "steam cook": "steaming"
    },
    {
        " under a very low heat for 42–42 minutes. An alternative is to wrap in ": null
    },
    {
        "aluminium foil": "aluminium foil"
    },
    {
        " and bake at 42  °C for 42–42 minutes.     Another option is to ": null
    },
    {
        "parboil": "parboil"
    },
    {
        " lutefisk; wrapped in ": null
    },
    {
        "cheesecloth": "cheesecloth"
    },
    {
        " and gently boiled until tender. Lutefisk can also be boiled directly in a pan of water. Janet Kinglin, Norwegian Dishes     Lutefisk sold in North America may also be cooked in a ": null
    },
    {
        "microwave oven": "microwave oven"
    },
    {
        ". The average cooking time is 42–42 minutes per whole fish at high power in a covered glass cooking dish, preferably made of ": null
    },
    {
        "heat resistant glass": "pyrex"
    },
    {
        ". The cooking time will vary, depending upon the power of the microwave oven.     When cooking and eating lutefisk, it is important to clean the lutefisk and its residue off pans, plates, and utensils immediately. Lutefisk left overnight becomes nearly impossible to remove. Sterling silver should never be used in the cooking, serving or eating of lutefisk, which will permanently ": null
    },
    {
        "corrode": "corrosion"
    },
    {
        " silver. Stainless steel utensils are recommended instead.            In Norway, Lutefisk is traditionally served with boiled ": null
    },
    {
        "potato": "potato"
    },
    {
        "es, mashed green ": null
    },
    {
        "pea": "pea"
    },
    {
        "s, melted butter and small pieces of fried ": null
    },
    {
        "bacon": "bacon"
    },
    {
        ".     In Sweden and Finland, lutefisk is a part of the Christmas tradition and is mostly eaten with boiled ": null
    },
    {
        "potatoes": "potatoes"
    },
    {
        ", green ": null
    },
    {
        "peas": "peas"
    },
    {
        " and ": null
    },
    {
        "white sauce": "white sauce"
    },
    {
        ". Regional variations include a sprinkle of freshly ground ": null
    },
    {
        "allspice": "allspice"
    },
    {
        " or ": null
    },
    {
        "black pepper": "black pepper"
    },
    {
        " and the addition of coarsely ground ": null
    },
    {
        "mustard": "mustard seed"
    },
    {
        " in the white sauce . In parts of ": null
    },
    {
        "Jämtland": "jämtland"
    },
    {
        " it is served on flat bread along with ": null
    },
    {
        "whey cheese": "whey cheese"
    },
    {
        ".     In the United States, lutefisk is often served with a variety of side dishes—including ": null
    },
    {
        "bacon": "bacon"
    },
    {
        ", ": null
    },
    {
        "pea": "pea"
    },
    {
        "s, pea stew, potatoes, ": null
    },
    {
        "lefse": "lefse"
    },
    {
        ", ": null
    },
    {
        "gravy": "gravy"
    },
    {
        ", mashed ": null
    },
    {
        "rutabaga": "rutabaga"
    },
    {
        ", ": null
    },
    {
        "white sauce": "béchamel sauce"
    },
    {
        ", melted or ": null
    },
    {
        "clarified butter": "clarified butter"
    },
    {
        ", ": null
    },
    {
        "syrup": "syrup"
    },
    {
        ", and geitost, or old ": null
    },
    {
        "cheese": "cheese"
    },
    {
        " . It is sometimes eaten with ": null
    },
    {
        "meatball": "meatball"
    },
    {
        "s, which is not traditional in Scandinavia. Side dishes vary greatly from family to family and region to region, and can be a source of jovial contention when eaters of different traditions of lutefisk dine together.     Today, ": null
    },
    {
        "akvavit": "akvavit"
    },
    {
        " and ": null
    },
    {
        "beer": "beer"
    },
    {
        " often accompany the meal due to its use at festive and ceremonial occasions.     Lutefisk prepared from cod is somewhat notorious – even in Scandinavia – for its intensely offensive odor. Conversely, lutefisk prepared from ": null
    },
    {
        "pollock": "pollock"
    },
    {
        " or ": null
    },
    {
        "haddock": "haddock"
    },
    {
        " emits almost no odor.     The taste of well-prepared lutefisk is very mild, and the white sauce is often spiced with pepper or other strong-tasting spices. In ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        ", this method  is common among ": null
    },
    {
        "Swedish-Americans": "swedish-americans"
    },
    {
        ", while ": null
    },
    {
        "Norwegian-Americans": "norwegian-americans"
    },
    {
        " often prefer to eat it unseasoned with melted butter or cream sauce.                An article in  Smithsonian  magazine quotes some oft-rendered tall tales regarding the origins of the dish:          The actual reason is probably that the lack of major salt deposits in the area favored the drying process for the preservation of whitefish - a process known for millennia. Stockfish is very nutrient-rich, and one can assume that it was also consumed domestically, although it was during the boom in the stockfish trade in the late Middle Ages, the product became accessible throughout Scandinavia, as well as the rest of Europe. The higher quality stockfish would be soaked in water, then boiled and eaten with melted butter. Lower grade qualities would be harder and more fuel consuming to boil and it has been suggested that adding ash from beech or birch in the boiling water, would break down the protein chains and speed up the process. The introduction of lye in the preparation process might therefore have been incidental.       Lutefisk as a Christmas season meal has gained attention in Norway over the past 42 years.    The Norwegian Seafood Export Council indicated sales of lutefisk to restaurants and catering companies in Norway increased by 42% between 42 and 42 A 42 survey found 42% of Norwegians ate lutefisk during the ": null
    },
    {
        "Christmas holiday season": "christmas and holiday season"
    },
    {
        ", although only 42% would consider it for their Christmas dinner. Annechen Bahr Bugge, , Grøstad gård, 42 November 42     Far more lutefisk is consumed in the United States than in Scandinavia, much of it by ": null
    },
    {
        "Scandinavian American": "scandinavian american"
    },
    {
        "s in ": null
    },
    {
        "Lutheran": "lutheranism"
    },
    {
        " churches and ": null
    },
    {
        "fraternal": "fraternal organizations"
    },
    {
        " lodges. Erica Janik, ,  Smithsonian , December 42 42     ": null
    },
    {
        "Madison, Minnesota": "madison, minnesota"
    },
    {
        " has dubbed itself the lutefisk capital of the world as well as claiming the largest per capita consumption of lutefisk in Minnesota. Eric Dregni, Minnesota Marvels: Roadside Attractions in the Land of Lakes, University of Minnesota Press ,  St. Olaf College in Northfield, Minnesota serves lutefisk during their Christmas Festival concerts. They also host an annual music festival called Lutefest . Lutefisk, though, is not served at this festival.       Lutefisk is also consumed in Canada because of its relatively large ": null
    },
    {
        "Scandinavian population": "scandinavian canadians"
    },
    {
        ", particularly in Western Canada. There are about 42 ": null
    },
    {
        "Norwegian Canadians": "norwegian canadians"
    },
    {
        ", 42 ": null
    },
    {
        "Swedish Canadians": "swedish canadians"
    },
    {
        ", 42 ": null
    },
    {
        "Danish Canadians": "danish canadians"
    },
    {
        " and 42 ": null
    },
    {
        "Finnish Canadians": "finnish canadians"
    },
    {
        ". Organizations such as the ": null
    },
    {
        "Sons of Norway": "sons of norway"
    },
    {
        " hold annual lutefisk dinners. Lutefisk is sometimes available in specialty stores  and supermarkets where there are large Scandinavian populations. ": null
    },
    {
        "Kingman, Alberta": "kingman, alberta"
    },
    {
        " proclaims itself on its greeting sign to be the Lutefisk capital of Alberta .       The ": null
    },
    {
        "Wisconsin": "wisconsin"
    },
    {
        " Employees Right to Know Law specifically exempts lutefisk in defining toxic substances .         or    or    or  ": null
    }
]