[
    {
        "        Lycopodiopsida is a class of herbaceous ": null
    },
    {
        "vascular plant": "vascular plant"
    },
    {
        "s known as lycopods, lycophytes or other terms including the component lyco-. Members of the class are called clubmosses, firmosses and quillworts. They have dichotomously branching stems bearing simple leaves called ": null
    },
    {
        "microphylls": "microphylls and megaphylls"
    },
    {
        " and reproduce by means of ": null
    },
    {
        "spore": "spore"
    },
    {
        "s borne in ": null
    },
    {
        "sporangia": "sporangium"
    },
    {
        " on the sides of the stems at the bases of the leaves. Although living species are small, during the ": null
    },
    {
        "Carboniferous": "carboniferous"
    },
    {
        ", extinct tree-like forms formed huge forests that dominated the landscape and contributed to ": null
    },
    {
        "coal": "coal"
    },
    {
        " deposits.     The nomenclature and classification of plants with microphylls varies substantially among authors. A consensus classification for extant species was produced in 42 by the ": null
    },
    {
        "Pteridophyte Phylogeny Group": "pteridophyte phylogeny group"
    },
    {
        " , which places them all in the class Lycopodiopsida, which includes the classes Isoetopsida and Selaginellopsida used in other systems.  Alternative classification systems have used ranks from division to subclass. In the PPG  I system, the class is divided into three orders, ": null
    },
    {
        "Lycopodiales": "lycopodiales"
    },
    {
        ", ": null
    },
    {
        "Isoetales": "isoetales"
    },
    {
        " and ": null
    },
    {
        "Selaginellales": "selaginellales"
    },
    {
        ".       Club-mosses are homosporous, but the genera  Selaginella  and  Isoetes  are heterosporous, with female spores larger than the male, and gametophytes forming entirely within the spore walls. A few species of Selaginella such as  S.  apoda  and  S.  rupestris  are also ": null
    },
    {
        "viviparous": "viviparity"
    },
    {
        "; the gametophyte develops on the mother plant, and only when the sporophytes primary shoot and root is developed enough for independence is the new plant dropped to the ground. Club-moss ": null
    },
    {
        "gametophytes": "gametophyte"
    },
    {
        " are ": null
    },
    {
        "mycoheterotrophic": "myco-heterotrophy"
    },
    {
        " and long-lived, residing underground for several years before emerging from the ground and progressing to the ": null
    },
    {
        "sporophyte": "sporophyte"
    },
    {
        " stage.         The extant lycophytes are ": null
    },
    {
        "vascular plant": "vascular plant"
    },
    {
        "s with ": null
    },
    {
        "microphyllous leaves": "microphylls and megaphylls"
    },
    {
        ", distinguishing them from the ": null
    },
    {
        "euphyllophyte": "euphyllophyte"
    },
    {
        "s . The sister group of the extant lycophytes and their closest extinct relatives are generally believed to be the ": null
    },
    {
        "zosterophyll": "zosterophyll"
    },
    {
        "s, a ": null
    },
    {
        "paraphyletic": "paraphyly"
    },
    {
        " or ": null
    },
    {
        "plesion": "plesion"
    },
    {
        " group. Ignoring some smaller extinct taxa, the evolutionary relationships are as shown below.      , there was broad agreement, supported by both molecular and morphological evidence, that the extant lycophytes fell into three groups, treated as orders in PPG  I, and that these, both together and individually, are ": null
    },
    {
        "monophyletic": "monophyly"
    },
    {
        ", being related as shown in the cladogram below:          The rank and name used for the taxon holding the extant lycophytes varies widely. Table 42 below shows some of the highest ranks that have been used. Systems may use taxa at a rank lower than the highest given in the table with the same circumscription; for example, a system that uses Lycopodiophyta as the highest ranked taxon may place all of its members in a single subclass.           Some systems use a higher rank for a more broadly defined taxon of lycophytes that includes some extinct groups more distantly related to extant lycophytes, such as the ": null
    },
    {
        "zosterophyll": "zosterophyll"
    },
    {
        "s. For example, Kenrick & Crane use the subdivision Lycophytina for this purpose, with all extant lycophytes falling within the class Lycopsida. Other sources exclude the zosterophylls from any lycophyte taxon.     In the ": null
    },
    {
        "Pteridophyte Phylogeny Group": "pteridophyte phylogeny group"
    },
    {
        " classification of 42 , the three orders are placed in a single class, Lycopodiopsida, holding all extant lycophyte species. Older systems have used either three classes, one for each order, or two classes, recognizing the closer relationship between Isoetales and Selaginellales. In these cases, a higher ranked taxon is needed to contain the classes . As Table 42 shows, the names Lycopodiopsida and Isoetopsida are both ambiguous.             The PPG I system divides up the extant lycophytes as shown below.   Class Lycopodiopsida Bartl.   :Order ": null
    },
    {
        "Lycopodiales": "lycopodiales"
    },
    {
        " DC. ex Bercht. & J.Presl   ::Family ": null
    },
    {
        "Lycopodiaceae": "lycopodiaceae"
    },
    {
        " P.Beauv.   :Order ": null
    },
    {
        "Isoetales": "isoetales"
    },
    {
        " Prantl   ::Family ": null
    },
    {
        "Isoetaceae": "isoetaceae"
    },
    {
        " Dumort.   :Order ": null
    },
    {
        "Selaginellales": "selaginellales"
    },
    {
        " Prantl   ::Family ": null
    },
    {
        "Selaginellaceae": "selaginellaceae"
    },
    {
        " Willk     Some extinct groups, such as ": null
    },
    {
        "zosterophyll": "zosterophyll"
    },
    {
        "s, fall outside the limits of the taxon as defined by the classifications in Table 42 above. However, other extinct groups fall within some ": null
    },
    {
        "circumscriptions": "circumscription"
    },
    {
        " of this taxon. Taylor et al. and Mauseth include a number of extinct orders in their division Lycophyta, although they differ on the placement of some genera. The orders included by Taylor et al. are:   Order †": null
    },
    {
        "Drepanophycales": "drepanophycales"
    },
    {
        "    Order †": null
    },
    {
        "Protolepidodendrales": "protolepidodendrales"
    },
    {
        " Lepidodendrales": "lepidodendrales"
    },
    {
        " Pleuromeiales": "pleuromeiales"
    },
    {
        "   Mauseth uses the order †Asteroxylales, placing Baragwanathia in the Protolepidodendrales.     The relationship between some of these extinct groups and the extant ones was investigated by Kenrick and Crane in 42 When the genera they used are assigned to orders, their suggested relationship is:                   The Lycopodiopsida are distinguished from other vascular plants by the possession of microphylls and by their sporangia, which are lateral as opposed to terminal and which open transversely rather than longitudinally. In some groups, the sporangia are borne on sporophylls that are clustered into strobili. Phylogenetic analysis shows the group branching off at the base of the evolution of vascular plants and they have a long evolutionary history. ": null
    },
    {
        "Fossil": "fossil"
    },
    {
        "s are abundant worldwide, especially in ": null
    },
    {
        "coal deposits": "coal"
    },
    {
        ". Fossils that can be ascribed to the Lycopodiopsida first appear in the Silurian period, along with a number of other vascular plants. The ": null
    },
    {
        "Silurian": "silurian"
    },
    {
        "  Baragwanathia longifolia  is one of the earliest identifiable species.  Lycopodolica  is another Silurian genus which appears to be an early member of this group. The group evolved roots independently from the rest of the vascular plants.     From the ": null
    },
    {
        "Devonian": "devonian"
    },
    {
        " onwards, some species grew large and tree-like. Devonian fossil trees from ": null
    },
    {
        "Svalbard": "svalbard"
    },
    {
        ", growing in equatorial regions, raise the possibility that they drew down enough carbon dioxide to change the earths climate significantly.  During the ": null
    },
    {
        "Carboniferous": "carboniferous"
    },
    {
        ", tree-like forms  formed huge forests that dominated the landscape. Unlike modern trees, leaves grew out of the entire surface of the trunk and branches, but fell off as the plant grew, leaving only a small cluster of leaves at the top. The trees are marked with diamond-shaped scars where they once had leaves. Quillworts are considered their closest extant relatives and share some unusual features with these ": null
    },
    {
        "fossil": "fossil"
    },
    {
        " trees, including the development of both bark, ": null
    },
    {
        "cambium": "cambium"
    },
    {
        " and ": null
    },
    {
        "wood": "wood"
    },
    {
        ", a modified shoot system acting as roots, bipolar and ": null
    },
    {
        "secondary growth": "secondary growth"
    },
    {
        ", and an upright stance. The remains of scale-trees formed many fossil ": null
    },
    {
        "coal": "coal"
    },
    {
        " deposits. In Fossil Park, ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ", ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", fossilized lycophyte trees can be found in ": null
    },
    {
        "sandstone": "sandstone"
    },
    {
        ".     The Lycopodiopsida had their maximum diversity in the ": null
    },
    {
        "Pennsylvanian": "pennsylvanian"
    },
    {
        " , particularly tree-like Lepidodendron and  Sigillaria  that dominated tropical wetlands. The complex ecology of these tropical rainforests ": null
    },
    {
        "collapsed": "carboniferous rainforest collapse"
    },
    {
        " during the Middle Pennsylvanian due to a change in climate. In ": null
    },
    {
        "Euramerica": "euramerica"
    },
    {
        ", tree-like species apparently became extinct in the Late Pennsylvanian, as a result of a transition to a much drier climate, giving way to ": null
    },
    {
        "conifer": "conifer"
    },
    {
        "s, ": null
    },
    {
        "fern": "fern"
    },
    {
        "s and ": null
    },
    {
        "horsetails": "equisetidae"
    },
    {
        ". In ": null
    },
    {
        "Cathaysia": "cathaysia"
    },
    {
        " , tree-like species survived into the ": null
    },
    {
        "Permian": "permian"
    },
    {
        ". Nevertheless, lycopodiopsids are rare in the ": null
    },
    {
        "Lopingian": "lopingian"
    },
    {
        " , but regained dominance in the ": null
    },
    {
        "Induan": "induan"
    },
    {
        " , particularly  Pleuromeia . After the worldwide ": null
    },
    {
        "Permian–Triassic extinction event": "permian–triassic extinction event"
    },
    {
        ", members of this group pioneered the repopulation of habitats as opportunistic plants. The heterogeneity of the terrestrial plant communities increased markedly during the Middle Triassic when plant groups like horsetails, ferns, ": null
    },
    {
        "pteridosperm": "pteridosperm"
    },
    {
        "s, ": null
    },
    {
        "cycad": "cycad"
    },
    {
        "s, ": null
    },
    {
        "ginkgos": "ginkgoales"
    },
    {
        " and conifers resurfaced and diversified quickly.       Lycophytes form associations with microbes such as fungi and bacteria, including ": null
    },
    {
        "arbuscular mycorrhizal": "arbuscular mycorrhiza"
    },
    {
        " and ": null
    },
    {
        "endophytic": "endophyte"
    },
    {
        " associations.     Arbuscular mycorrhizal associations have been characterized in all stages of the lycophyte lifecycle: ": null
    },
    {
        "mycoheterotrophic": "myco-heterotrophy"
    },
    {
        " gametophyte, photosynthetic surface-dwelling gametophyte, young sporophyte, and mature sporophyte. Arbuscular mycorrhizae have been found in  Selaginella spp. roots and vesicles.     During the mycoheterotrophic gametophyte lifecycle stage, lycophytes gain all of their carbon from subterranean ": null
    },
    {
        "glomalean": "glomerales"
    },
    {
        " fungi. In other plant taxa, glomalean networks transfer carbon from neighboring plants to mycoheterotrophic gametophytes. Something similar could be occurring in Huperzia hypogeae gametophytes which associate with the same glomalean phenotypes as nearby Huperzia hypogeae sporophytes.     Fungal endophytes have been found in many species of lycophyte, however the function of these endophytes in host plant biology is not known. Endophytes of other plant taxa perform roles such as improving plant competitive fitness, conferring biotic and abiotic stress tolerance, promoting plant growth through phytohormone production or production of limiting nutrients. However, some endophytic fungi in lycophytes do produce medically relevant compounds. Shiraia sp Slf42 is an endophytic fungus present in Huperzia serrata that produces Huperzine A, a biomedical compound which has been approved as a drug in China and a dietary supplement in the U.S. to treat Alzheimers Disease. This fungal endophyte can be cultivated much more easily and on a much larger scale than H. serrata itself which could increase the availability of Huperzine A as a medicine.       The spores of lycopods are highly flammable and so have been used in ": null
    },
    {
        "fireworks": "fireworks"
    },
    {
        ". ": null
    },
    {
        "Lycopodium powder": "lycopodium powder"
    },
    {
        ", the dried spores of the common clubmoss, was used in Victorian theater to produce flame-effects. A blown cloud of spores burned rapidly and brightly, but with little heat. ": null
    }
]