[
    {
        "               Lydia  was an ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " kingdom": "monarchy"
    },
    {
        " of western ": null
    },
    {
        "Asia Minor": "asia minor"
    },
    {
        " located generally east of ancient ": null
    },
    {
        "Ionia": "ionia"
    },
    {
        " in the modern western ": null
    },
    {
        "Turkish": "turkey"
    },
    {
        " provinces of ": null
    },
    {
        "Uşak": "uşak province"
    },
    {
        ", ": null
    },
    {
        "Manisa": "manisa province"
    },
    {
        " and inland ": null
    },
    {
        "İzmir": "izmir province"
    },
    {
        ". Its population spoke an ": null
    },
    {
        "Anatolian language": "anatolian languages"
    },
    {
        " known as ": null
    },
    {
        "Lydian": "lydian language"
    },
    {
        ". Its capital was ": null
    },
    {
        "Sardis": "sardis"
    },
    {
        ". Rhodes, P.J. A History of the Classical Greek World 478-323 BC. 2nd edition. Chichester: Wiley-Blackwell, 2010, p. 6.     The Kingdom of Lydia existed from about 1200 BC to 546 BC. At its greatest extent, during the 7th century BC, it covered all of western ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        ". In 546 BC, it became a province of the ": null
    },
    {
        "Achaemenid Persian Empire": "achaemenid empire"
    },
    {
        ", known as the ": null
    },
    {
        "satrapy of Lydia": "lydia"
    },
    {
        " or Sparda in ": null
    },
    {
        "Old Persian": "old persian"
    },
    {
        ". In 133 BC, it became part of the ": null
    },
    {
        "Roman": "roman republic"
    },
    {
        " province of Asia": "asia"
    },
    {
        ".     ": null
    },
    {
        "Coins": "coin"
    },
    {
        "are said to have been invented in Lydia around the 7th century BC. Lydia in Oxford Dictionary of English. ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ", 2010. Oxford Reference Online. 14 October 2011.       The ": null
    },
    {
        "endonym": "endonym"
    },
    {
        " Śfard  survives in bilingual and trilingual stone-carved notices of the ": null
    },
    {
        "Achaemenid Empire": "achaemenid empire"
    },
    {
        ": the ": null
    },
    {
        "satrapy": "satrapy"
    },
    {
        " of Sparda , ": null
    },
    {
        "Aramaic": "aramaic"
    },
    {
        " Saparda, ": null
    },
    {
        "Babylonian": "akkadian language"
    },
    {
        " Sapardu, ": null
    },
    {
        "Elamitic": "elamitic"
    },
    {
        " Išbarda, Hebrew .  These in the Greek tradition are associated with ": null
    },
    {
        "Sardis": "sardis"
    },
    {
        ", the capital city of King ": null
    },
    {
        "Gyges": "gyges of lydia"
    },
    {
        ", constructed during the 7th century BC. Lydia is called Kisitan in The Flower of the History of the East by ": null
    },
    {
        "Hayton of Corycus": "hayton of corycus"
    },
    {
        ", which was corrupted to Quesiton in  The Travels of Sir John Mandeville .     The region of the Lydian kingdom was during the 15th-14th centuries part of the ": null
    },
    {
        "Arzawa": "arzawa"
    },
    {
        " kingdom. However, the Lydian language is usually not categorized as part of the Luwic subgroup, unlike the other nearby Anatolian languages ": null
    },
    {
        "Luwian": "luwian language"
    },
    {
        ", ": null
    },
    {
        "Carian": "carian language"
    },
    {
        ", and ": null
    },
    {
        "Lycian": "lycian language"
    },
    {
        ". I. Yakubovich, Sociolinguistics of the Luvian Language, Leiden: Brill, 2010, p. 6        An Etruscan/Lydian association has long been a subject of conjecture. The Greek historian ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        " stated that the Etruscans came from Lydia, repeated in ": null
    },
    {
        "Virgils": "virgil"
    },
    {
        "epic poem the  Aeneid , and Etruscan-like language was found on the ": null
    },
    {
        "Lemnos stele": "lemnos stele"
    },
    {
        " from the Aegean Sea island of Lemnos. However, the decipherment of ": null
    },
    {
        "Lydian": "lydian language"
    },
    {
        " and its classification as an ": null
    },
    {
        "Anatolian language": "anatolian language"
    },
    {
        " mean that ": null
    },
    {
        "Etruscan": "etruscan language"
    },
    {
        " and Lydian were not even part of the same language family. Furthermore, a ": null
    },
    {
        "mitochondrial DNA": "mitochondrial dna"
    },
    {
        " study suggests that the Etruscans were probably an indigenous population, showing that Etruscans appear to fall very close to a Neolithic population from ": null
    },
    {
        "Central Europe": "central europe"
    },
    {
        " and to other Tuscan populations, strongly suggesting that the Etruscan civilization developed locally from the ": null
    },
    {
        "Villanovan culture": "villanovan culture"
    },
    {
        ", and genetic links between Tuscany and ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        " date back to at least 5,000 years ago during the ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " and the most likely separation time between Tuscany and Western Anatolia falls around 7,600 years ago .        The boundaries of historical Lydia varied across the centuries. It was bounded first by ": null
    },
    {
        "Mysia": "mysia"
    },
    {
        ", ": null
    },
    {
        "Caria": "caria"
    },
    {
        ", ": null
    },
    {
        "Phrygia": "phrygia"
    },
    {
        " and coastal ": null
    },
    {
        "Ionia": "ionia"
    },
    {
        ". Later, the military power of ": null
    },
    {
        "Alyattes": "alyattes of lydia"
    },
    {
        " and ": null
    },
    {
        "Croesus": "croesus"
    },
    {
        " expanded Lydia, which, with its capital at ": null
    },
    {
        "Sardis": "sardis"
    },
    {
        ", controlled all Asia Minor west of the River Halys, except ": null
    },
    {
        "Lycia": "lycia"
    },
    {
        ". After the Persian conquest the River ": null
    },
    {
        "Maeander": "maeander"
    },
    {
        " was regarded as its southern boundary, and during imperial Roman times Lydia comprised the country between Mysia and Caria on the one side and Phrygia and the ": null
    },
    {
        "Aegean Sea": "aegean sea"
    },
    {
        " on the other.       The ": null
    },
    {
        "Lydian language": "lydian language"
    },
    {
        " was an ": null
    },
    {
        "Indo-European language": "indo-european language"
    },
    {
        " in the ": null
    },
    {
        "Anatolian language family": "anatolian languages"
    },
    {
        ", related to ": null
    },
    {
        "Luwian": "luwian"
    },
    {
        " and ": null
    },
    {
        "Hittite": "hittite language"
    },
    {
        ". Due to its fragmentary attestation, the meanings of many words are unknown but much of the grammar has been determined. Similar to other Anatolian languages, it featured extensive use of ": null
    },
    {
        "prefixes": "prefix"
    },
    {
        " and ": null
    },
    {
        "grammatical particles": "grammatical particle"
    },
    {
        "to chain clauses together.  Lydian had also undergone extensive ": null
    },
    {
        "syncope": "syncope"
    },
    {
        ", leading to numerous consonant clusters atypical of Indo-European languages. Lydian finally became ": null
    },
    {
        "extinct": "extinct language"
    },
    {
        " during the 1st century BC.               Lydia developed after the decline of the ": null
    },
    {
        "Hittite Empire": "hittite empire"
    },
    {
        " in the 12th century BC. In Hittite times, the name for the region had been ": null
    },
    {
        "Arzawa": "arzawa"
    },
    {
        ". According to Greek source, the original name of the Lydian kingdom was Maionia , or Maeonia: ": null
    },
    {
        "Homer": "homer"
    },
    {
        "  refers to the inhabitants of Lydia as Maiones . As for the etymologies of Lydia and Maionia, see H. Craig Melchert , ": null
    },
    {
        "University of North Carolina at Chapel Hill": "university of north carolina at chapel hill"
    },
    {
        ", pp. 3, 4, 11 . Homer describes their capital not as Sardis but as Hyde ; Hyde may have been the name of the district in which Sardis was located. See Strabo xiii.626. Later, ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        "  adds that the Meiones were renamed Lydians after their king ": null
    },
    {
        "Lydus": "lydus"
    },
    {
        " , son of ": null
    },
    {
        "Atys": "atys of lydia"
    },
    {
        ", during the mythical epoch that preceded the Heracleid dynasty. This ": null
    },
    {
        "etiological": "etiology"
    },
    {
        " eponym": "eponym"
    },
    {
        " served to account for the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " ethnic name Lydoi . The ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " term for Lydians,  Lûḏîm  , as found in the ": null
    },
    {
        "Book of Jeremiah": "book of jeremiah"
    },
    {
        " , has been similarly considered, beginning with ": null
    },
    {
        "Flavius Josephus": "flavius josephus"
    },
    {
        ", to be derived from ": null
    },
    {
        "Lud son of Shem": "lud son of shem"
    },
    {
        ";  however, ": null
    },
    {
        "Hippolytus of Rome": "hippolytus of rome"
    },
    {
        " offered an alternative opinion that the Lydians were descended from ": null
    },
    {
        "Ludim": "ludim"
    },
    {
        ", son of ": null
    },
    {
        "Mizraim": "mizraim"
    },
    {
        ". During Biblical times, the Lydian warriors were famous archers. Some Maeones still existed during historical times in the upland interior along the ": null
    },
    {
        "River Hermus": "hermus"
    },
    {
        ", where a town named Maeonia existed, according to ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        "  and ": null
    },
    {
        "Hierocles": "hierocles"
    },
    {
        " .       Lydian mythology is virtually unknown, and their literature and rituals have been lost due to the absence of any monuments or archaeological finds with extensive inscriptions; therefore, myths involving Lydia are mainly from ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ".     For the Greeks, ": null
    },
    {
        "Tantalus": "tantalus"
    },
    {
        " was a primordial ruler of mythic Lydia, and ": null
    },
    {
        "Niobe": "niobe"
    },
    {
        " his proud daughter; her husband ": null
    },
    {
        "Amphion": "amphion and zethus"
    },
    {
        " associated Lydia with ": null
    },
    {
        "Thebes": "thebes, greece"
    },
    {
        " in Greece, and through ": null
    },
    {
        "Pelops": "pelops"
    },
    {
        " the line of Tantalus was part of the ": null
    },
    {
        "founding myths": "founding myth"
    },
    {
        "of ": null
    },
    {
        "Mycenaes": "mycenae"
    },
    {
        "second dynasty.         In Greek myth, Lydia had also adopted the double-axe symbol, that also appears in the Mycenaean civilization, the  labrys . Sources noted in Karl Kerenyi, The Heroes of the Greeks 1959, p. 192. ": null
    },
    {
        "Omphale": "omphale"
    },
    {
        ", daughter of the river Iardanos, was a ruler of Lydia, whom ": null
    },
    {
        "Heracles": "heracles"
    },
    {
        " was required to serve for a time. His adventures in Lydia are the adventures of a Greek hero in a peripheral and foreign land: during his stay, Heracles enslaved the Itones; killed Syleus, who forced passers-by to hoe his vineyard; slew the ": null
    },
    {
        "serpent": "serpent"
    },
    {
        " of the river Sangarios  Hyginus, Astronomica ii.14. and captured the simian tricksters, the ": null
    },
    {
        "Cercopes": "cercopes"
    },
    {
        ". Accounts tell of at least one son of Heracles who was born to either Omphale or a slave-girl: Herodotus  says this was ": null
    },
    {
        "Alcaeus": "alcaeus"
    },
    {
        " who began the line of Lydian ": null
    },
    {
        "Heracleidae": "heracleidae"
    },
    {
        " which ended with the death of ": null
    },
    {
        "Candaules": "candaules"
    },
    {
        " c. 687 BC. ": null
    },
    {
        "Diodorus Siculus": "diodorus siculus"
    },
    {
        " and ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        "  mention a son called Lamos, while pseudo-Apollodorus  gives the name Agelaus and ": null
    },
    {
        "Pausanias": "pausanias"
    },
    {
        " names Tyrsenus as the son of Heracles by the Lydian woman . All three heroic ancestors indicate a Lydian dynasty claiming Heracles as their ancestor. Herodotus refers to a Heraclid dynasty of kings who ruled Lydia, yet were perhaps not descended from Omphale. He also mentions the legend that the ": null
    },
    {
        "Etruscan civilization": "etruscan civilization"
    },
    {
        " was founded by colonists from Lydia led by ": null
    },
    {
        "Tyrrhenus": "tyrrhenus"
    },
    {
        ", brother of Lydus. ": null
    },
    {
        "Dionysius of Halicarnassus": "dionysius of halicarnassus"
    },
    {
        " was skeptical of this story, indicating that the ": null
    },
    {
        "Etruscan language": "etruscan language"
    },
    {
        " and customs were known to be totally dissimilar to those of the Lydians. In addition, the story of the Lydian origins of the Etruscans was not known to ": null
    },
    {
        "Xanthus of Lydia": "xanthus of lydia"
    },
    {
        ", an authority on the history of the Lydians. ": null
    },
    {
        "Robert Drews": "robert drews"
    },
    {
        ", Herodotus 1.94, the Drought Ca. 1200 B.C., and the Origin of the Etruscans, in Historia: Zeitschrift Für Alte Geschichte, vol. 41, no. 1, 1992, pp. 14–39.     Later chronologists ignored Herodotus statement that ": null
    },
    {
        "Agron": "agron of lydia"
    },
    {
        " was the first Heraclid to be a king, and included his immediate forefathers Alcaeus, Belus and Ninus in their list of kings of Lydia. Strabo has Atys, father of Lydus and Tyrrhenus, as a descendant of Heracles and Omphale but that contradicts virtually all other accounts which name Atys, Lydus and Tyrrhenus among the pre-Heraclid kings and princes of Lydia. The gold deposits in the river ": null
    },
    {
        "Pactolus": "pactolus"
    },
    {
        " that were the source of the proverbial wealth of ": null
    },
    {
        "Croesus": "croesus"
    },
    {
        " were said to have been left there when the legendary king ": null
    },
    {
        "Midas": "midas"
    },
    {
        " of ": null
    },
    {
        "Phrygia": "phrygia"
    },
    {
        " washed away the Midas touch in its waters.   In ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        " tragedy  The Bacchae , ": null
    },
    {
        "Dionysus": "dionysus"
    },
    {
        ", while he is maintaining his human disguise, declares his country to be Lydia. Euripides. The Complete Greek Tragedies Vol IV., Ed by Grene and Lattimore, line 463             According to ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        ", the Lydians were the first people to use gold and silver ": null
    },
    {
        "coins": "coin"
    },
    {
        "and the first to establish retail shops in permanent locations. Herodotus. Histories, I, 94. It is not known, however, whether Herodotus meant that the Lydians were the first to use coins of pure gold and pure silver or the first precious metal coins in general. Despite this ambiguity, this statement of Herodotus is one of the pieces of evidence most often cited on behalf of the argument that Lydians invented coinage, at least in the West, although the first coins  were neither gold nor silver but an alloy of the two called ": null
    },
    {
        "electrum": "electrum"
    },
    {
        ". Carradice and Price, Coinage in the Greek World, Seaby, London, 1988, p. 24.     The dating of these first stamped coins is one of the most frequently debated topics of ancient numismatics, N. Cahill and J. Kroll, New Archaic Coin Finds at Sardis, American Journal of Archaeology, Vol. 109, No. 4 , p. 613. with dates ranging from 700 BC to 550 BC, but the most common opinion is that they were minted at or near the beginning of the reign of King Alyattes .  A. Ramage, Golden Sardis, King Croesus Gold: Excavations at Sardis and the History of Gold Refining, edited by A. Ramage and P. Craddock, Harvard University Press, Cambridge, 2000, p. 18. The first coins were made of ": null
    },
    {
        "electrum": "electrum"
    },
    {
        ", an ": null
    },
    {
        "alloy": "alloy"
    },
    {
        " of gold and silver that occurs naturally but that was further debased by the Lydians with added silver and copper. M. Cowell and K. Hyne, Scientific Examination of the Lydian Precious Metal Coinages, King Croesus Gold: Excavations at Sardis and the History of Gold Refining, Harvard University Press, Cambridge, 2000, pp. 169-174.        The largest of these coins are commonly referred to as a 1/3 ": null
    },
    {
        "stater": "stater"
    },
    {
        "  denomination, weighing around 4.7  grams, though no full staters of this type have ever been found, and the 1/3 stater probably should be referred to more correctly as a stater, after a type of a transversely held scale, the weights used in such a scale , which also means standard. L. Breglia, Il materiale proveniente dalla base centrale dellArtemession di Efeso e le monete di Lidia , Istituto Italiano di Numismatica Annali, volumes 18-19 , pp. 9-25. These coins were stamped with a lions head adorned with what is likely a sunburst, which was the kings symbol. E. Robinson, The Coins from the Ephesian Artemision Reconsidered, Journal of Hellenic Studies 71 , p. 159. The most prolific mint for early electrum coins was Sardis which produced large quantities of the lion head thirds, sixths and twelfths along with lion paw fractions.  To complement the largest denomination, fractions were made, including a hekte , hemihekte , and so forth down to a 96th, with the 1/96 stater weighing only about 0.15  grams. There is disagreement, however, over whether the fractions below the twelfth are actually Lydian. M. Mitchiner, Ancient Trade and Early Coinage, Hawkins Publications, London, 2004, p. 219.     Alyattes son was ": null
    },
    {
        "Croesus": "croesus"
    },
    {
        " , who became associated with great wealth. Croesus is credited with issuing the  Croeseid , the first true ": null
    },
    {
        "gold coins": "gold coin"
    },
    {
        "with a standardised purity for general circulation,  and the worlds first ": null
    },
    {
        "bimetallic monetary system": "bimetallism"
    },
    {
        " circa 550 BCE.      It took some time before ancient coins were used for commerce and trade. Even the smallest-denomination electrum coins, perhaps worth about a days subsistence, would have been too valuable for buying a loaf of bread. Hoards, Small Change, and the Origin of Coinage, Journal of the Hellenistic Studies 84 , p. 89 The first coins to be used for retailing on a large-scale basis were likely small silver fractions, Hemiobol, ": null
    },
    {
        "Ancient Greek coinage": "ancient greek coinage"
    },
    {
        " minted in ": null
    },
    {
        "Cyme ": "cyme"
    },
    {
        " under ": null
    },
    {
        "Hermodike II": "hermodike ii"
    },
    {
        " then by the ": null
    },
    {
        "Ionian Greeks": "ionians"
    },
    {
        " in the late sixth century BC. M. Mitchiner, p. 214     Sardis was renowned as a beautiful city. Around 550 BC, near the beginning of his reign, Croesus paid for the construction of the ": null
    },
    {
        "temple of Artemis": "temple of artemis"
    },
    {
        " at ": null
    },
    {
        "Ephesus": "ephesus"
    },
    {
        ", which became one of the ": null
    },
    {
        "Seven Wonders of the ancient world": "seven wonders of the ancient world"
    },
    {
        ". Croesus was defeated in battle by ": null
    },
    {
        "Cyrus II": "cyrus the great"
    },
    {
        " of Persia": "achaemenid empire"
    },
    {
        " in 546 BC, with the Lydian kingdom losing its autonomy and becoming a Persian ": null
    },
    {
        "satrapy": "satrapy"
    },
    {
        ".          According to ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        ", Lydia was ruled by three dynasties from the second millennium BC to 546 BC. The first two dynasties are legendary and the third is historical. Herodotus mentions three early Maeonian kings: ": null
    },
    {
        "Manes": "manes of lydia"
    },
    {
        ", his son ": null
    },
    {
        "Atys": "atys of lydia"
    },
    {
        " and his grandson ": null
    },
    {
        "Lydus": "lydus"
    },
    {
        ".  Lydus gave his name to the country and its people. One of his descendants was ": null
    },
    {
        "Iardanus": "iardanus of lydia"
    },
    {
        ", with whom ": null
    },
    {
        "Heracles": "heracles"
    },
    {
        " was in service at one time. Heracles had an affair with one of Iardanus slave-girls and their son ": null
    },
    {
        "Alcaeus": "alcaeus"
    },
    {
        " was the first of the Lydian Heraclids.      The Maeonians relinquished control to the ": null
    },
    {
        "Heracleidae": "heracleidae"
    },
    {
        " and Herodotus says they ruled through 22 generations for a total of 505 years from c. 1192 BC. The first Heraclid king was ": null
    },
    {
        "Agron": "agron of lydia"
    },
    {
        ", the great-grandson of Alcaeus. He was succeeded by 19 Heraclid kings, names unknown, all succeeding father to son. In the 8th century BC, ": null
    },
    {
        "Meles": "meles of lydia"
    },
    {
        " became the 21st and penultimate Heraclid king and the last was his son ": null
    },
    {
        "Candaules": "candaules"
    },
    {
        " , who was assassinated and succeeded by his former friend ": null
    },
    {
        "Gyges": "gyges of lydia"
    },
    {
        ", who began the Mermnad dynasty.                       In 547 BC, the Lydian king ": null
    },
    {
        "Croesus": "croesus"
    },
    {
        " besieged and captured the Persian city of ": null
    },
    {
        "Pteria": "pteria"
    },
    {
        " in ": null
    },
    {
        "Cappadocia": "cappadocia"
    },
    {
        " and enslaved its inhabitants. The Persian king ": null
    },
    {
        "Cyrus The Great": "cyrus the great"
    },
    {
        " marched with his army against the Lydians. The ": null
    },
    {
        "Battle of Pteria": "battle of pteria"
    },
    {
        " resulted in a stalemate, forcing the Lydians to retreat to their capital city of Sardis. Some months later the Persian and Lydian kings met at the ": null
    },
    {
        "Battle of Thymbra": "battle of thymbra"
    },
    {
        ". Cyrus won and captured the capital city of Sardis by 546 BC. New Testament Cities in Western Asia Minor: Light from Archaeology on Cities of Paul and the Seven Churches of Revelation  p. 65 Lydia became a province  of the Persian Empire.       Lydia remained a satrapy after Persias conquest by the Macedonian king ": null
    },
    {
        "Alexander III": "alexander the great"
    },
    {
        " of ": null
    },
    {
        "Macedon": "macedon"
    },
    {
        ".     When Alexanders empire ended after his death, Lydia was possessed by the major Asian diadoch dynasty, the ": null
    },
    {
        "Seleucids": "seleucids"
    },
    {
        ", and when it was unable to maintain its territory in Asia Minor, Lydia was acquired by the ": null
    },
    {
        "Attalid": "attalid"
    },
    {
        " dynasty of ": null
    },
    {
        "Pergamum": "pergamum"
    },
    {
        ". Its last king avoided the spoils and ravage of a Roman war of conquest by leaving the realm by testament to the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ".               When the Romans entered the capital Sardis in 133 BC, Lydia, as the other western parts of the Attalid legacy, became part of the ": null
    },
    {
        "province of Asia": "asia"
    },
    {
        ", a very rich ": null
    },
    {
        "Roman province": "roman province"
    },
    {
        ", worthy of a governor with the high rank of ": null
    },
    {
        "proconsul": "proconsul"
    },
    {
        ". The whole west of Asia Minor had ": null
    },
    {
        "Jewish": "jewish"
    },
    {
        " colonies very early, and Christianity was also soon present there. ": null
    },
    {
        "Acts of the Apostles": "acts of the apostles"
    },
    {
        " 16:14-15 mentions the baptism of a merchant woman called Lydia from ": null
    },
    {
        "Thyatira": "thyatira"
    },
    {
        ", known as ": null
    },
    {
        "Lydia of Thyatira": "lydia of thyatira"
    },
    {
        ", in what had once been the satrapy of Lydia. Christianity spread rapidly during the 3rd century AD, based on the nearby Exarchate of Ephesus.       Under the ": null
    },
    {
        "tetrarchy": "tetrarchy"
    },
    {
        " reform of Emperor ": null
    },
    {
        "Diocletian": "diocletian"
    },
    {
        " in 296 AD, Lydia was revived as the name of a separate Roman province, much smaller than the former satrapy, with its capital at Sardis.     Together with the provinces of ": null
    },
    {
        "Caria": "caria"
    },
    {
        ", ": null
    },
    {
        "Hellespontus": "hellespontus"
    },
    {
        ", ": null
    },
    {
        "Lycia": "lycia"
    },
    {
        ", ": null
    },
    {
        "Pamphylia": "pamphylia"
    },
    {
        ", ": null
    },
    {
        "Phrygia prima": "phrygia prima"
    },
    {
        " and ": null
    },
    {
        "Phrygia secunda": "phrygia secunda"
    },
    {
        ", ": null
    },
    {
        "Pisidia": "pisidia"
    },
    {
        " and the Insulae , it formed the ": null
    },
    {
        "diocese": "diocese"
    },
    {
        "  of ": null
    },
    {
        "Asia": "asia"
    },
    {
        "na, which was part of the ": null
    },
    {
        "praetorian prefecture": "praetorian prefecture"
    },
    {
        " of Oriens, together with the dioceses ": null
    },
    {
        "Pontiana": "pontiana"
    },
    {
        " , Oriens proper , Aegyptus and ": null
    },
    {
        "Thraciae": "thraciae"
    },
    {
        " .       Under the Byzantine emperor Heraclius , Lydia became part of ": null
    },
    {
        "Anatolikon": "anatolikon"
    },
    {
        ", one of the original  themata , and later of ": null
    },
    {
        "Thrakesion": "thrakesion"
    },
    {
        ". Although the ": null
    },
    {
        "Seljuk Turks": "seljuk turks"
    },
    {
        " conquered most of the rest of Anatolia, forming the ": null
    },
    {
        "Sultanate of Ikonion": "sultanate of ikonion"
    },
    {
        " , Lydia remained part of the Byzantine Empire. While the Venetians occupied Constantinople and Greece as a result of the ": null
    },
    {
        "Fourth Crusade": "fourth crusade"
    },
    {
        ", Lydia continued as a part of the Byzantine ": null
    },
    {
        "rump state": "rump state"
    },
    {
        " called the ": null
    },
    {
        "Nicene Empire": "empire of nicaea"
    },
    {
        " based at ": null
    },
    {
        "Nicaea": "i̇znik"
    },
    {
        " until 1261.       Lydia was captured finally by Turkish  beylik s, which were all absorbed by the ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " state in 1390. The area became part of the Ottoman ": null
    },
    {
        "Aidin Vilayet": "aidin vilayet"
    },
    {
        " , and is now in the modern republic of ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ".       Lydia had numerous Christian communities and, after Christianity became the official religion of the Roman Empire in the 4th century, Lydia became one of the provinces of the diocese of Asia in the ": null
    },
    {
        "Patriarchate of Constantinople": "patriarchate of constantinople"
    },
    {
        ".     The ecclesiastical province of Lydia had a metropolitan diocese at ": null
    },
    {
        "Sardis": "sardis"
    },
    {
        " and suffragan dioceses for ": null
    },
    {
        "Philadelphia": "alaşehir"
    },
    {
        ", ": null
    },
    {
        "Thyatira": "thyatira"
    },
    {
        ", ": null
    },
    {
        "Tripolis": "tripolis"
    },
    {
        ", ": null
    },
    {
        "Settae": "settae"
    },
    {
        ", ": null
    },
    {
        "Gordus": "gordus"
    },
    {
        ", ": null
    },
    {
        "Tralles": "tralles"
    },
    {
        ", ": null
    },
    {
        "Silandus": "silandus"
    },
    {
        ", ": null
    },
    {
        "Maeonia": "maeonia"
    },
    {
        ", ": null
    },
    {
        "Apollonos Hierum": "apollonos hierum"
    },
    {
        ", ": null
    },
    {
        "Mostene": "mostene"
    },
    {
        ", ": null
    },
    {
        "Apollonias": "apollonias"
    },
    {
        ", ": null
    },
    {
        "Attalia": "attalia"
    },
    {
        ", ": null
    },
    {
        "Hyrcania": "hyrcania"
    },
    {
        ", Bage, ": null
    },
    {
        "Balandus": "balandus"
    },
    {
        ", ": null
    },
    {
        "Hermocapella": "hermocapella"
    },
    {
        ", ": null
    },
    {
        "Hierocaesarea": "hierocaesarea"
    },
    {
        ", ": null
    },
    {
        "Acrassus": "acrassus"
    },
    {
        ", ": null
    },
    {
        "Dalda": "dalda"
    },
    {
        ", ": null
    },
    {
        "Stratonicia": "stratonicia"
    },
    {
        ", ": null
    },
    {
        "Cerasa": "cerasa"
    },
    {
        ", ": null
    },
    {
        "Gabala": "jabala"
    },
    {
        ", ": null
    },
    {
        "Satala": "satala"
    },
    {
        ", ": null
    },
    {
        "Aureliopolis": "aureliopolis"
    },
    {
        " and ": null
    },
    {
        "Hellenopolis": "hellenopolis"
    },
    {
        ". Bishops from the various dioceses of Lydia were well represented at the Council of Nicaea in 325 and at the later ecumenical councils. Le Quien, Oriens Christianus, i. 859–98       Ancient episcopal sees of the late Roman province of Lydia are listed in the  Annuario Pontificio  as ": null
    },
    {
        "titular see": "titular see"
    },
    {
        "s: Annuario Pontificio 2013 , Sedi titolari , pp. 819-1013   ": null
    }
]