[
    {
        "        Lyon & Healy Harps, Inc. is an American musical instrument manufacturer based in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ", ": null
    },
    {
        "Illinois": "illinois"
    },
    {
        " and is a subsidiary of ": null
    },
    {
        "Salvi Harps": "salvi harps"
    },
    {
        ". Today best known for concert ": null
    },
    {
        "harp": "harp"
    },
    {
        "s, the companys Chicago headquarters and manufacturing facility contains a showroom and ": null
    },
    {
        "concert hall": "concert hall"
    },
    {
        ". George W. Lyon and Patrick J. Healy began the company in 1864 as a sheet music shop. By the end of the 19th century, they manufactured a wide range of musical instruments—including not only ": null
    },
    {
        "harp": "harp"
    },
    {
        "s, but ": null
    },
    {
        "guitar": "guitar"
    },
    {
        "s, ": null
    },
    {
        "mandolin": "mandolin"
    },
    {
        "s, ": null
    },
    {
        "banjo": "banjo"
    },
    {
        "s, ": null
    },
    {
        "ukuleles": "ukulele"
    },
    {
        "and various ": null
    },
    {
        "brass": "brass instrument"
    },
    {
        " and ": null
    },
    {
        "percussion instrument": "percussion instrument"
    },
    {
        "s.     Today, Lyon & Healy harps are widely played by professional musicians, since they are one of the few makers of harps for ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        "l use—which are known as concert harps or  pedal harp s. Lyon & Healy also makes smaller  folk harp s or ": null
    },
    {
        "lever harps": "folk harp"
    },
    {
        " that use levers to change string pitch instead of pedals. In the 1980s, Lyon & Healy also began to manufacture electroacoustic harps and, later, solid body ": null
    },
    {
        "electric harp": "electric harp"
    },
    {
        "s.         George W. Lyon, a native of ": null
    },
    {
        "Northborough, Massachusetts": "northborough, massachusetts"
    },
    {
        "; and Patrick J. Healy, born in ": null
    },
    {
        "Mallow": "mallow, county cork"
    },
    {
        ", Ireland, founded the company in 1864, after they moved from Boston to start a sheet music shop for music publisher ": null
    },
    {
        "Oliver Ditson": "oliver ditson"
    },
    {
        ". Determining Lyon & Healys history is complicated because its building and company records were destroyed in two fires, including the ": null
    },
    {
        "Great Chicago Fire": "great chicago fire"
    },
    {
        " of 1871. Two smaller fires did little damage to the firm and did not result in data loss.     Company letters and trade catalogs dont provide exact dates that would reveal when Lyon & Healy began manufacturing instruments. An article in the  Musical Courier  states that Lyon & Healy began manufacturing instruments in 1885. Clearly, Lyon & Healy was making fretted string instruments in the 1880s, with ": null
    },
    {
        "Washburn": "washburn guitars"
    },
    {
        " as their premier line. By the 1900s, if not earlier, Lyon & Healy might well have been manufacturing bowed string instruments.     According to Vintage Guitar magazine, Circa 1900, the firm was so large it manufactured under a host of sub-brands; Washburn is perhaps the most recognized, though Leland, Lakeside, and American Conservatory are still seen.  ": null
    },
    {
        "The Sweet By and By": "in the sweet by-and-by"
    },
    {
        " parlor guitar": "parlor guitar"
    },
    {
        " tenor guitar": "tenor guitar"
    },
    {
        " piccolo mandolin": "mandolinmandolin family"
    },
    {
        " mandolin banjos": "mandolin-banjo"
    },
    {
        " and ": null
    },
    {
        "violin-back mandolins": "mandolinarchtop"
    },
    {
        "          The company is known to have made other instruments, including ": null
    },
    {
        "reed organs": "reed organ"
    },
    {
        "and pianos. Lyon & Healy evidently began manufacturing these instruments around 1876 in its factories in Chicago and nearby cities. George W. Lyon patented his cottage upright in 1878 and it was sold under the Lyon & Healy name.     Lyon retired in 1889 and Healy became the companys first president. That year, Lyon & Healy built their first harp. Healy wanted to develop a harp better suited to the rigors of the American climate than available European models. They successfully produced a harp notable for its strength, pitch reliability, and freedom from unwanted vibration. Previously, most harps in North America were made by small groups of craftsmen in ": null
    },
    {
        "France": "france"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        ", ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", or ": null
    },
    {
        "Italy": "italy"
    },
    {
        ".     In 1890, Lyon & Healy introduced the Style 23 Harp, still a popular and recognizable design. It has 47 strings, highly decorative floral carving on the top of the column, base, and feet, and a ": null
    },
    {
        "fleur de lis": "fleur de lis"
    },
    {
        " pattern at the bottom of the column. It is available in a gold version. It is  tall, and weighs about . Lyon & Healy produces one of the most ornate and elaborate harps in the world, the Louis XV, which includes carvings of leaves, flowers, scrolls, and shells along its neck and kneeblock, as well the ": null
    },
    {
        "soundboard": "sound board"
    },
    {
        " edges.     Lyon would later form a new company with E.A. Potter called Lyon & Potter, and remained there until his death on January 12, 1894. Healy died of pneumonia on April 3, 1905. ": null
    },
    {
        "The New Grove Dictionary of Music and Musicians": "the new grove dictionary of music and musicians"
    },
    {
        ", Lyon & Healy , 1980.          In the 1890s the company—which used the slogan, Everything in music —began building pipe organs. In 1894 Robert J. Bennett came to Lyon & Healy from the Hutchens company of Boston to head their organ department. The largest surviving Lyon & Healy pipe organ is at the ": null
    },
    {
        "Our Lady of Sorrows Basilica": "our lady of sorrows basilica"
    },
    {
        " in Chicago. It is a large organ of four manuals and 57 ranks of pipes.     They also made small pipe organs. An example survives at St. Marys Catholic Church in Aspen Colorado. It is a two manual tracker with a 30 note straight pedalboard and 7 ranks. It is believed to have been built around 1900, and can still be pumped by hand.          By the 1900s, Lyon & Healy was one of the largest music publishers in the world, and was a major producer of musical instruments. However, In late 1920s, Lyon & Healy sold its brass musical instrument manufacturing branch . In the 1970s, the firm concentrated solely upon making and selling harps.     In 1928, Lyon & Healy introduced one of the most unusual harps ever mass-produced, the Salzedo Model. The company designed it in collaboration with the harpist ": null
    },
    {
        "Carlos Salzedo": "carlos salzedo"
    },
    {
        ". It an ": null
    },
    {
        "Art Deco": "art deco"
    },
    {
        " style instrument that incorporates bold red and white lines on the soundboard to create a stylized and distinct appearance.     In the 1960s, Lyon & Healy introduced a smaller lever harp, the Troubadour, a 36-string harp for young beginners with smaller hands, and for casual players. This harp stands , and weighs .     In the late 1970s, ": null
    },
    {
        "Steinway & Sons": "steinway  &  sons"
    },
    {
        "  purchased Lyon & Healy and soon after closed all retail stores, which sold sheet music and musical instruments, to focus on harp production.     By 1985, Lyon & Healy also made folk harps, also known as Irish harps, which are even smaller than the Troubadour. The Shamrock model folk harp has 34 strings. It stands  tall with its legs. The legs can be removed so the player can hold the instrument lap—style on the knees. It weighs about . It features ": null
    },
    {
        "Celtic": "celtic art"
    },
    {
        " designs on the soundboard. An Irish or folk harp player is sometimes called a harper rather than  harpist .         ": null
    },
    {
        "DePaul University": "depaul university"
    },
    {
        " now owns the Wabash building. Lyon & Healy harps are still in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ", ": null
    },
    {
        "Illinois": "illinois"
    },
    {
        ", at 168 North Ogden Avenue. The building was once home to the recording studios of ": null
    },
    {
        "Orlando R. Marsh": "orlando r. marsh"
    },
    {
        ".       Wood in harp construction varies by instrument, but ": null
    },
    {
        "Sitka": "sitka, alaska"
    },
    {
        " Spruce  is the most common soundboard wood. Various Lyon & Healy guitars, mandolins, and many other instrument types reside in major musical instrument museums in the U.S. and Europe.     Lyon and Healy now primarily manufactures four types of harps—the lever harp, petite pedal harp, semi-grande pedal harp, and concert grand harp. They also make limited numbers of special harps called concert grands. Lyon & Healy makes electric lever harps in nontraditional colors such as pink, green, blue, and red.       Lyon & Healy Corporation is a musical product distribution company in North America representing brands such as Delta, Relish Guitars, SIM1, Paoletti Guitars and Acus Sound Engineering. Lyon & Healy Corporation aims to become the leading provider of premium quality musical instruments and accessories. ": null
    }
]