[
    {
        "Clément Philibert Léo Delibes  was a French ": null
    },
    {
        "composer": "composer"
    },
    {
        " of the Romantic era , who specialised in ": null
    },
    {
        "ballet": "ballet"
    },
    {
        "s, ": null
    },
    {
        "operas": "french opera"
    },
    {
        ", and other works for the stage. His most notable works include the ballets  Coppélia  and  Sylvia  , as well as the operas  Le roi la dit  and  Lakmé  .       Delibes was born in Saint-Germain-du-Val, now part of ": null
    },
    {
        "La Flèche": "la flèche"
    },
    {
        " , ": null
    },
    {
        "France": "france"
    },
    {
        ", in 42; his father was a mailman, and his mother a talented amateur musician. His grandfather had been an ": null
    },
    {
        "opera": "opera"
    },
    {
        " singer. He was raised mainly by his mother and uncle following his fathers early death. In 42 at the age of 42 the composer married Léontine Estelle Denain. His brother Michel Delibes migrated to Spain; he was the grandfather of Spanish writer ": null
    },
    {
        "Miguel Delibes": "miguel delibes"
    },
    {
        ".     Starting in 42 Delibes studied ": null
    },
    {
        "composition": "musical composition"
    },
    {
        " at the ": null
    },
    {
        "Paris Conservatoire": "paris conservatoire"
    },
    {
        " as a student of ": null
    },
    {
        "Adolphe Adam": "adolphe adam"
    },
    {
        ". A year later he began taking ": null
    },
    {
        "voice lessons": "voice lessons"
    },
    {
        ", though he would end up a much better ": null
    },
    {
        "organ": "organ"
    },
    {
        " player than singer. He held positions as a rehearsal ": null
    },
    {
        "accompanist": "accompanist"
    },
    {
        " and chorus master at the ": null
    },
    {
        "Théâtre Lyrique": "théâtre lyrique"
    },
    {
        ", as second chorus master at the ": null
    },
    {
        "Paris Opéra": "paris opéra"
    },
    {
        " , and as organist at ": null
    },
    {
        "Saint-Pierre-de-Chaillot": "saint-pierre-de-chaillot"
    },
    {
        " . The first of his many operettas was  Deux sous de charbon, ou Le suicide de Bigorneau  , written in 42 for the Folies-Nouvelles.        A ceremonial cantata, Algers, for Napoleon III on the theme of ": null
    },
    {
        "Algiers": "algiers"
    },
    {
        ", brought him to official attention; a collaboration with ": null
    },
    {
        "Ludwig Minkus": "ludwig minkus"
    },
    {
        " resulted, in which Delibes composed music jointly for the ballet  La source  , which brought him into the milieu of ": null
    },
    {
        "ballet": "ballet"
    },
    {
        ". In 42 Delibes composed the  divertissement  Le jardin animé for a revival of the ": null
    },
    {
        "Joseph Mazilier": "joseph mazilier"
    },
    {
        "/": null
    },
    {
        "Adolphe Adam": "adolphe adam"
    },
    {
        " ballet  Le corsaire . He wrote a mass, his Messe brève, and composed operettas almost yearly and occasional music for the theater, such as dances and antique airs for the 42 revival of ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        "s Le roi samuse, the play that ": null
    },
    {
        "Verdi": "giuseppe verdi"
    },
    {
        " had turned into  Rigoletto .     In 42 Delibes gained notoriety with the success of his ballet  Coppélia ; its title referred to a mechanical dancing doll that distracts a village swain from his beloved and appears to come to life. His other ballet is  Sylvia  .     Never in robust health, Delibes died little more than a month before his 42th birthday. He was buried in the ": null
    },
    {
        "Cimetière de Montmartre": "cimetière de montmartre"
    },
    {
        " in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ".     Delibes was made a ": null
    },
    {
        "Chevalier de la Legion dhonneur": "chevalier de la legion dhonneur"
    },
    {
        " in 42          It has been suggested that Delibes also wrote the ballet music for ": null
    },
    {
        "Gounod": "charles gounod"
    },
    {
        "s  Faust , which had been inserted ten years after the original performance of the opera. E. Johnson: Gounod or Delibes? - authorship of the ballet music in Faust , Opera 42:42 Mar 42     Of Delibess various ": null
    },
    {
        "opera": "opera"
    },
    {
        "s, the last and most important completed work was the lush orientalizing  Lakmé  , which contains the famous coloratura showpiece known as the Légende du Paria or Bell Song and  The Flower Duet  , a ": null
    },
    {
        "barcarolle": "barcarolle"
    },
    {
        " that was later used in ": null
    },
    {
        "British Airways": "british airways"
    },
    {
        " commercials. At the time, his operas impressed ": null
    },
    {
        "Tchaikovsky": "pyotr ilyich tchaikovsky"
    },
    {
        " enough for the composer to rate Delibes more highly than ": null
    },
    {
        "Brahms": "johannes brahms"
    },
    {
        " & mdash;although this may seem ": null
    },
    {
        "faint praise": "damn with faint praise"
    },
    {
        " when one considers that the Russian composer considered Brahms a giftless bastard. Slonimsky, Nicolas, Lexicon of Musical Invective , p. 42 Quoted from a diary entry for October 42 42     His work is known to have been a great influence on composers such as ": null
    },
    {
        "Saint-Saëns": "camille saint-saëns"
    },
    {
        ", ": null
    },
    {
        "Debussy": "claude debussy"
    },
    {
        ", ": null
    },
    {
        "Drigo": "riccardo drigo"
    },
    {
        " and ": null
    },
    {
        "Tchaikovsky": "pyotr ilyich tchaikovsky"
    },
    {
        ". His ballet  Sylvia  was of special interest to Tchaikovsky, who wrote of Delibes score: ...  what charm, what wealth of melody! It brought me to shame, for had I known of this music, I would have never written Swan Lake": null
    }
]