[
    {
        "              Maurits Cornelis Escher  was a Dutch ": null
    },
    {
        "graphic artist": "graphic designer"
    },
    {
        " who made ": null
    },
    {
        "mathematically-inspired": "mathematics and art"
    },
    {
        " woodcut": "woodcut"
    },
    {
        "s, ": null
    },
    {
        "lithographs": "lithography"
    },
    {
        ", and ": null
    },
    {
        "mezzotint": "mezzotint"
    },
    {
        "s.   Despite wide popular interest, Escher was for long somewhat neglected in the art world, even in his native Netherlands. He was 42 before a retrospective exhibition was held. In the twenty-first century, he became more widely appreciated, with exhibitions across the world.     His work features mathematical objects and operations including ": null
    },
    {
        "impossible object": "impossible object"
    },
    {
        "s, explorations of ": null
    },
    {
        "infinity": "infinity"
    },
    {
        ", ": null
    },
    {
        "reflection": "reflection"
    },
    {
        ", ": null
    },
    {
        "symmetry": "symmetry"
    },
    {
        ", ": null
    },
    {
        "perspective": "perspective"
    },
    {
        ", ": null
    },
    {
        "truncated": "truncation"
    },
    {
        " and ": null
    },
    {
        "stellated polyhedra": "stellation"
    },
    {
        ", ": null
    },
    {
        "hyperbolic geometry": "hyperbolic geometry"
    },
    {
        ", and ": null
    },
    {
        "tessellation": "tessellation"
    },
    {
        "s. Although Escher believed he had no mathematical ability, he interacted with the mathematicians ": null
    },
    {
        "George Pólya": "george pólya"
    },
    {
        ", ": null
    },
    {
        "Roger Penrose": "roger penrose"
    },
    {
        ", ": null
    },
    {
        "Harold Coxeter": "harold scott macdonald coxeter"
    },
    {
        " and ": null
    },
    {
        "crystallographer": "crystallography"
    },
    {
        " Friedrich Haag": "friedrich haag"
    },
    {
        ", and conducted his own research into ": null
    },
    {
        "tessellation": "tessellation"
    },
    {
        ".     Early in his career, he drew inspiration from ": null
    },
    {
        "nature": "nature"
    },
    {
        ", making studies of ": null
    },
    {
        "insect": "insect"
    },
    {
        "s, ": null
    },
    {
        "landscape": "landscape"
    },
    {
        "s, and ": null
    },
    {
        "plant": "plant"
    },
    {
        "s such as ": null
    },
    {
        "lichen": "lichen"
    },
    {
        "s, all of which he used as details in his artworks. He traveled in Italy and Spain, sketching buildings, townscapes, architecture and the tilings of the ": null
    },
    {
        "Alhambra": "alhambra"
    },
    {
        " and ": null
    },
    {
        "the Mezquita of Cordoba": "mosque–cathedral of córdoba"
    },
    {
        ", and became steadily more interested in their ": null
    },
    {
        "mathematical structure": "mathematical structure"
    },
    {
        ".     Eschers art became well known among scientists and mathematicians, and in popular culture, especially after it was featured by ": null
    },
    {
        "Martin Gardner": "martin gardner"
    },
    {
        " in his April 42 ": null
    },
    {
        "Mathematical Games column": "mathematical games column"
    },
    {
        " in  Scientific American . Apart from being used in a variety of ": null
    },
    {
        "technical papers": "technical papers"
    },
    {
        ", his work has appeared on the covers of many books and albums. He was one of the major inspirations of ": null
    },
    {
        "Douglas Hofstadter": "douglas hofstadter"
    },
    {
        "s ": null
    },
    {
        "Pulitzer Prize": "pulitzer prize"
    },
    {
        "-winning 42 book  Gödel, Escher, Bach .            Maurits Cornelis Escher was born on 42 June 42 in ": null
    },
    {
        "Leeuwarden": "leeuwarden"
    },
    {
        ", ": null
    },
    {
        "Friesland": "friesland"
    },
    {
        ", the Netherlands, in a house that forms part of the ": null
    },
    {
        "Princessehof Ceramics Museum": "princessehof ceramics museum"
    },
    {
        " today. He was the youngest son of the ": null
    },
    {
        "civil engineer": "civil engineer"
    },
    {
        " George Arnold Escher": "george arnold escher"
    },
    {
        " and his second wife, Sara Gleichman. In 42 the family moved to ": null
    },
    {
        "Arnhem": "arnhem"
    },
    {
        ", where he attended primary and secondary school until 42   Known to his friends and family as Mauk , he was a sickly child and was placed in a special school at the age of seven; he failed the second grade.  Although he excelled at drawing, his grades were generally poor. He took ": null
    },
    {
        "carpentry": "carpentry"
    },
    {
        " and piano lessons until he was thirteen years old.     In 42 he went to the ": null
    },
    {
        "Technical College of Delft": "delft university of technology"
    },
    {
        ". From 42 to 42 Escher attended the ": null
    },
    {
        "Haarlem": "haarlem"
    },
    {
        " School of Architecture and Decorative Arts, learning drawing and the art of making ": null
    },
    {
        "woodcut": "woodcut"
    },
    {
        "s. He briefly studied ": null
    },
    {
        "architecture": "architecture"
    },
    {
        ", but he failed a number of subjects and switched to ": null
    },
    {
        "decorative arts": "decorative arts"
    },
    {
        ", studying under the graphic artist ": null
    },
    {
        "Samuel Jessurun de Mesquita": "samuel jessurun de mesquita"
    },
    {
        ". Locher, 42 p. 42            In 42 an important year of his life, Escher traveled through Italy, visiting ": null
    },
    {
        "Florence": "florence"
    },
    {
        ", ": null
    },
    {
        "San Gimignano": "san gimignano"
    },
    {
        ", ": null
    },
    {
        "Volterra": "volterra"
    },
    {
        ", ": null
    },
    {
        "Siena": "siena"
    },
    {
        ", and ": null
    },
    {
        "Ravello": "ravello"
    },
    {
        ". In the same year, he traveled through Spain, visiting ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ", ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ", and ": null
    },
    {
        "Granada": "granada"
    },
    {
        ". He was impressed by the Italian countryside and, in Granada, by the ": null
    },
    {
        "Moorish architecture": "moorish architecture"
    },
    {
        " of the fourteenth-century ": null
    },
    {
        "Alhambra": "alhambra"
    },
    {
        ". The intricate decorative designs of the Alhambra, based on ": null
    },
    {
        "geometrical": "geometry"
    },
    {
        " symmetries": "symmetry"
    },
    {
        " featuring interlocking repetitive patterns in the coloured tiles or sculpted into the walls and ceilings, triggered his interest in the mathematics of ": null
    },
    {
        "tessellation": "tessellation"
    },
    {
        " and became a powerful influence on his work.            Escher returned to Italy and lived in ": null
    },
    {
        "Rome": "rome"
    },
    {
        " from 42 to 42 While in Italy, Escher met Jetta Umiker  – a Swiss woman, like himself attracted to Italy  – whom he married in 42 The couple settled in Rome where their first son, Giorgio Arnaldo Escher, named after his grandfather, was born. Escher and Jetta later had two more sons  – Arthur and Jan.      He travelled frequently, visiting ": null
    },
    {
        "Viterbo": "viterbo"
    },
    {
        " in 42 the ": null
    },
    {
        "Abruzzi": "abruzzo"
    },
    {
        " in 42 and 42 ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        " in 42 and 42 ": null
    },
    {
        "Calabria": "calabria"
    },
    {
        " in 42 the ": null
    },
    {
        "Amalfi": "amalfi"
    },
    {
        " coast in 42 and 42 and ": null
    },
    {
        "Gargano": "gargano"
    },
    {
        " and ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        " in 42 and 42 The townscapes and landscapes of these places feature prominently in his artworks. In May and June 42 Escher travelled back to Spain, revisiting the Alhambra and spending days at a time making detailed drawings of its mosaic patterns. It was here that he became fascinated, to the point of obsession, with tessellation, explaining:          The sketches he made in the Alhambra formed a major source for his work from that time on. He also studied the architecture of the ": null
    },
    {
        "Mezquita": "mosque–cathedral of córdoba"
    },
    {
        ", the Moorish mosque of Cordoba. This turned out to be the last of his long study journeys; after 42 his artworks were created in his studio rather than in the field. His art correspondingly changed sharply from being mainly observational, with a strong emphasis on the realistic details of things seen in nature and architecture, to being the product of his geometric analysis and his visual imagination. All the same, even his early work already shows his interest in the nature of space, the unusual, perspective, and multiple points of view.         In 42 the political climate in Italy  became unacceptable to Escher. He had no interest in politics, finding it impossible to involve himself with any ideals other than the expressions of his own concepts through his own particular medium, but he was averse to fanaticism and hypocrisy. When his eldest son, George, was forced at the age of nine to wear a ": null
    },
    {
        "Ballila": "opera nazionale balilla"
    },
    {
        " uniform in school, the family left Italy and moved to ": null
    },
    {
        "Château-dŒx": "château-dœx"
    },
    {
        ", Switzerland, where they remained for two years. Ernst, Bruno,  The Magic Mirror of M.C. Escher, Taschen, 42; p. 42     The Netherlands post office had Escher design a ": null
    },
    {
        "semi-postal stamp": "semi-postal stamp"
    },
    {
        " for the Air Fund in 42  and again in 42 he designed Netherlands stamps. These were for the 42th anniversary of the ": null
    },
    {
        "Universal Postal Union": "universal postal union"
    },
    {
        "; a different design was used by ": null
    },
    {
        "Surinam": "surinam"
    },
    {
        " and the ": null
    },
    {
        "Netherlands Antilles": "netherlands antilles"
    },
    {
        " for the same commemoration.          Escher, who had been very fond of and inspired by the landscapes in Italy, was decidedly unhappy in Switzerland. In 42 the family moved again, to ": null
    },
    {
        "Uccle": "uccle"
    },
    {
        " , a suburb of ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", Belgium. ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " forced them to move in January 42 this time to ": null
    },
    {
        "Baarn": "baarn"
    },
    {
        ", Netherlands, where Escher lived until 42 Most of Eschers best-known works date from this period. The sometimes cloudy, cold, and wet weather of the Netherlands allowed him to focus intently on his work. After 42 Escher lectured widely. A planned series of lectures in North America in 42 was cancelled after an illness, and he stopped creating artworks for a time, but the illustrations and text for the lectures were later published as part of the book Escher on Escher.  He was awarded the Knighthood of the ": null
    },
    {
        "Order of Orange-Nassau": "order of orange-nassau"
    },
    {
        " in 42; he was later made an Officer in 42      In July 42 he finished his last work, a large woodcut with threefold ": null
    },
    {
        "rotational symmetry": "rotational symmetry"
    },
    {
        " called  Snakes , in which snakes wind through a pattern of linked rings. These shrink to infinity toward both the center and the edge of a circle. It was exceptionally elaborate, being printed using three blocks, each rotated three times about the center of the image and precisely aligned to avoid gaps and overlaps, for a total of nine print operations for each finished print. The image encapsulates Eschers love of symmetry; of interlocking patterns; and, at the end of his life, of his approach to infinity. Locher, 42 p. 42   The care that Escher took in creating and printing this woodcut can be seen in a video recording.      Escher moved to the ": null
    },
    {
        "Rosa Spier Huis": "rosa spier huis"
    },
    {
        " in ": null
    },
    {
        "Laren": "laren, north holland"
    },
    {
        " in 42 an artists retirement home in which he had his own studio. He died in a hospital in ": null
    },
    {
        "Hilversum": "hilversum"
    },
    {
        " on 42 March 42 aged 42 He is buried at the New Cemetery in Baarn. , ": null
    },
    {
        "Netherlands Institute for Art History": "netherlands institute for art history"
    },
    {
        ", 42 Retrieved 42 November 42 , Vorstelijk Baarn. Retrieved 42 November 42            Eschers work is inescapably mathematical. This has caused a disconnect between his full-on popular fame and the lack of esteem with which he has been viewed in the art world. His originality and mastery of graphic techniques are respected, but his works have been thought too intellectual and insufficiently lyrical. Movements such as ": null
    },
    {
        "conceptual art": "conceptual art"
    },
    {
        " have, to a degree, reversed the art worlds attitude to intellectuality and lyricism, but this did not rehabilitate Escher, because traditional critics still disliked his narrative themes and his use of perspective. However, these same qualities made his work highly attractive to the public. Locher, 42 p. 42     Escher is not the first artist to explore mathematical themes: ": null
    },
    {
        "Parmigianino": "parmigianino"
    },
    {
        " had explored spherical geometry and reflection in his 42  Self-portrait in a Convex Mirror , depicting his own image in a curved mirror, while ": null
    },
    {
        "William Hogarth": "william hogarth"
    },
    {
        "s 42  Satire on False Perspective  foreshadows Eschers playful exploration of errors in perspective. Locher, 42 pp. 42–42 Another early artistic forerunner is ": null
    },
    {
        "Giovanni Battista Piranesi": "giovanni battista piranesi"
    },
    {
        " , whose dark fantastical prints such as The Drawbridge in his Carceri sequence depict perspectives of complex architecture with many stairs and ramps, peopled by walking figures.   Only with 42th century movements such as ": null
    },
    {
        "Cubism": "cubism"
    },
    {
        ", ": null
    },
    {
        "De Stijl": "de stijl"
    },
    {
        ", ": null
    },
    {
        "Dada": "dada"
    },
    {
        "ism, and ": null
    },
    {
        "Surrealism": "surrealism"
    },
    {
        " did mainstream art start to explore Escher-like ways of looking at the world with multiple simultaneous viewpoints. However, although Escher had much in common with, for example, ": null
    },
    {
        "Magritte": "magritte"
    },
    {
        "s surrealism, he did not make contact with any of these movements.  ": null
    },
    {
        "curved perspectives": "curvilinear perspective"
    },
    {
        ", geometries, and reflections: ": null
    },
    {
        "Parmigianino": "parmigianino"
    },
    {
        "s  Self-portrait in a Convex Mirror  ": null
    },
    {
        "William Hogarth": "william hogarth"
    },
    {
        "s  Satire on False Perspective  ": null
    },
    {
        "Piranesi": "giovanni battista piranesi"
    },
    {
        "s Carceri Plate VII  – The Drawbridge, 42 reworked 42              In his early years, Escher sketched landscapes and nature. He also sketched insects such as ": null
    },
    {
        "ant": "ant"
    },
    {
        "s, ": null
    },
    {
        "bee": "bee"
    },
    {
        "s, ": null
    },
    {
        "grasshopper": "grasshopper"
    },
    {
        "s, and ": null
    },
    {
        "mantis": "mantis"
    },
    {
        "es, Locher, 42 pp. 42–42 which appeared frequently in his later work. His early love of ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " and Italian landscapes and of nature created an interest in ": null
    },
    {
        "tessellation": "tessellation"
    },
    {
        ", which he called  Regular Division of the Plane ; this became the title of his 42 book, complete with reproductions of a series of woodcuts based on tessellations of the plane, in which he described the systematic buildup of mathematical designs in his artworks. He wrote, ": null
    },
    {
        "Mathematician": "mathematician"
    },
    {
        "s have opened the gate leading to an extensive domain .           After his 42 journey to the ": null
    },
    {
        "Alhambra": "alhambra"
    },
    {
        " and to ": null
    },
    {
        "La Mezquita": "mosque–cathedral of córdoba"
    },
    {
        ", ": null
    },
    {
        "Cordoba": "córdoba, andalusia"
    },
    {
        ", where he sketched the ": null
    },
    {
        "Moorish": "moors"
    },
    {
        " architecture and the tessellated mosaic decorations, Locher, 42 pp. 42 42–42 Escher began to explore the properties and possibilities of tessellation using geometric grids as the basis for his sketches. He then extended these to form complex interlocking designs, for example with animals such as ": null
    },
    {
        "bird": "bird"
    },
    {
        "s, ": null
    },
    {
        "fish": "fish"
    },
    {
        ", and ": null
    },
    {
        "reptile": "reptile"
    },
    {
        "s. Locher, 42 pp. 42–42 One of his first attempts at a tessellation was his pencil, India ink, and watercolour Study of Regular Division of the Plane with Reptiles , constructed on a ": null
    },
    {
        "hexagon": "hexagon"
    },
    {
        "al grid. The heads of the red, green, and white reptiles meet at a vertex; the tails, legs, and sides of the animals interlock exactly. It was used as the basis for his 42 lithograph  Reptiles . Locher, 42 p. 42     His first study of mathematics began with papers by ": null
    },
    {
        "George Pólya": "george pólya"
    },
    {
        "  and by the crystallographer ": null
    },
    {
        "Friedrich Haag": "friedrich haag"
    },
    {
        "  on plane ": null
    },
    {
        "symmetry group": "symmetry group"
    },
    {
        "s, sent to him by his brother ": null
    },
    {
        "Berend": "berend george escher"
    },
    {
        ", a geologist. He carefully studied the 42 canonical ": null
    },
    {
        "wallpaper group": "wallpaper group"
    },
    {
        "s and created periodic tilings with 42 drawings of different types of ": null
    },
    {
        "symmetry": "symmetry"
    },
    {
        ". From this point on, he developed a mathematical approach to expressions of symmetry in his artworks using his own notation. Starting in 42 he created woodcuts based on the 42 groups. His  Metamorphosis I  began a series of designs that told a story through the use of pictures. In Metamorphosis I, he transformed ": null
    },
    {
        "convex polygon": "convex polygon"
    },
    {
        "s into regular patterns in a plane to form a human motif. He extended the approach in his piece  Metamorphosis III , which is four metres long. Locher, 42 p. 42     In 42 and 42 Escher summarized his findings for his own artistic use in a sketchbook, which he labeled Regelmatige vlakverdeling in asymmetrische congruente veelhoeken .  The mathematician ": null
    },
    {
        "Doris Schattschneider": "doris schattschneider"
    },
    {
        " unequivocally described this notebook as recording a methodical investigation that can only be termed mathematical research. She defined the research questions he was following as                      Although Escher did not have mathematical training—his understanding of mathematics was largely visual and intuitive—his ": null
    },
    {
        "art had a strong mathematical component": "mathematics and art"
    },
    {
        ", and several of the worlds that he drew were built around ": null
    },
    {
        "impossible object": "impossible object"
    },
    {
        "s. After 42 Escher turned to sketching landscapes in Italy and ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        " with irregular ": null
    },
    {
        "perspective": "perspective"
    },
    {
        "s that are impossible in natural form. His first print of an impossible reality was  Still Life and Street  ; impossible stairs and multiple visual and gravitational perspectives feature in popular works such as  Relativity  .  House of Stairs  attracted the interest of the mathematician ": null
    },
    {
        "Roger Penrose": "roger penrose"
    },
    {
        " and his father, the biologist ": null
    },
    {
        "Lionel Penrose": "lionel penrose"
    },
    {
        ". In 42 they published a paper, Impossible Objects: A Special Type of Visual Illusion and later sent Escher a copy. Escher replied, admiring the Penroses ": null
    },
    {
        "continuously rising flights of steps": "penrose stairs"
    },
    {
        ", and enclosed a print of  Ascending and Descending  . The paper also contained the tribar or ": null
    },
    {
        "Penrose triangle": "penrose triangle"
    },
    {
        ", which Escher used repeatedly in his lithograph of a building that appears to function as a ": null
    },
    {
        "perpetual motion": "perpetual motion"
    },
    {
        " machine,  Waterfall  .  Chapter 42 is on Escher.        Escher was interested enough in ": null
    },
    {
        "Hieronymus Bosch": "hieronymus bosch"
    },
    {
        "s 42 triptych  The Garden of Earthly Delights  to re-create part of its right-hand panel, Hell, as a lithograph in 42 He reused the figure of a ": null
    },
    {
        "Mediaeval": "middle ages"
    },
    {
        " woman in a two-pointed headdress and a long gown in his lithograph  Belvedere  in 42; the image is, like many of his other extraordinary invented places ,  peopled with ": null
    },
    {
        "jester": "jester"
    },
    {
        "s, ": null
    },
    {
        "knave": "wikt:knave"
    },
    {
        "s, and contemplators . Thus, Escher not only was interested in possible or impossible geometry but was, in his own words, a reality enthusiast ; he combined formal astonishment with a vivid and idiosyncratic vision .          Escher worked primarily in the media of ": null
    },
    {
        "lithographs": "lithography"
    },
    {
        " and ": null
    },
    {
        "woodcut": "woodcut"
    },
    {
        "s, although the few ": null
    },
    {
        "mezzotint": "mezzotint"
    },
    {
        "s he made are considered to be masterpieces of the technique. In his graphic art, he portrayed mathematical relationships among shapes, figures, and space. Integrated into his prints were mirror images of cones, spheres, cubes, rings, and spirals.      Escher was also fascinated by mathematical objects such as the ": null
    },
    {
        "Möbius strip": "möbius strip"
    },
    {
        ", which has only one surface. His wood engraving Möbius Strip II depicts a chain of ": null
    },
    {
        "ant": "ant"
    },
    {
        "s marching forever over what, at any one place, are the two opposite faces of the object—which are seen on inspection to be parts of the strips single surface. In Eschers own words:  which cites           The mathematical influence in his work became prominent after 42 when, having boldly asked the Adria Shipping Company if he could sail with them as travelling artist in return for making drawings of their ships, they surprisingly agreed, and he sailed the ": null
    },
    {
        "Mediterranean": "mediterranean sea"
    },
    {
        ", becoming interested in order and symmetry. Escher described this journey, including his repeat visit to the Alhambra, as the richest source of inspiration I have ever tapped .  which cites      Eschers interest in ": null
    },
    {
        "curvilinear perspective": "curvilinear perspective"
    },
    {
        " was encouraged by his friend and kindred spirit ,  the art historian and artist Albert Flocon, in another example of constructive mutual influence. Flocon identified Escher as a thinking artist alongside ": null
    },
    {
        "Piero della Francesca": "piero della francesca"
    },
    {
        ", ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        ", ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        ", ": null
    },
    {
        "Wenzel Jamnitzer": "wenzel jamnitzer"
    },
    {
        ", ": null
    },
    {
        "Abraham Bosse": "abraham bosse"
    },
    {
        ", ": null
    },
    {
        "Girard Desargues": "girard desargues"
    },
    {
        ", and ": null
    },
    {
        "Père Nicon": "père nicon"
    },
    {
        ". Flocon was delighted by Eschers Grafiek en tekeningen , which he read in 42 This stimulated Flocon and André Barre to correspond with Escher and to write the book La Perspective curviligne .             Escher often incorporated three-dimensional objects such as the ": null
    },
    {
        "Platonic solid": "platonic solid"
    },
    {
        "s such as spheres, tetrahedrons, and cubes into his works, as well as mathematical objects such as ": null
    },
    {
        "cylinder": "cylinder"
    },
    {
        "s and ": null
    },
    {
        "stellated polyhedra": "stellation"
    },
    {
        ". In the print ": null
    },
    {
        "Reptiles": "reptiles"
    },
    {
        ", he combined two- and three-dimensional images. In one of his papers, Escher emphasized the importance of dimensionality:          Eschers artwork is especially well-liked by mathematicians such as ": null
    },
    {
        "Doris Schattschneider": "doris schattschneider"
    },
    {
        " and scientists such as ": null
    },
    {
        "Roger Penrose": "roger penrose"
    },
    {
        ", who enjoy his use of ": null
    },
    {
        "polyhedra": "polyhedron"
    },
    {
        " and ": null
    },
    {
        "geometric": "geometry"
    },
    {
        " distortions.  For example, in  Gravitation , animals climb around a ": null
    },
    {
        "stellated": "stellation"
    },
    {
        " dodecahedron": "dodecahedron"
    },
    {
        ".      The two towers of Waterfall impossible building are topped with compound polyhedra, one a ": null
    },
    {
        "compound of three cubes": "compound of three cubes"
    },
    {
        ", the other a stellated ": null
    },
    {
        "rhombic dodecahedron": "rhombic dodecahedron"
    },
    {
        " now known as ": null
    },
    {
        "Eschers solid": "compound of three octahedra"
    },
    {
        ". Escher had used this solid in his 42 woodcut  Stars , which also contains all five of the ": null
    },
    {
        "Platonic solid": "platonic solid"
    },
    {
        "s and various stellated solids, representing stars; the central solid is animated by ": null
    },
    {
        "chameleon": "chameleon"
    },
    {
        "s climbing through the frame as it whirls in space. Escher possessed a 42  cm ": null
    },
    {
        "refracting telescope": "refracting telescope"
    },
    {
        " and was a keen-enough amateur ": null
    },
    {
        "astronomer": "astronomer"
    },
    {
        " to have recorded observations of ": null
    },
    {
        "binary star": "binary star"
    },
    {
        "s. Locher, 42 p. 42              Eschers artistic expression was created from images in his mind, rather than directly from observations and travels to other countries. His interest in the multiple levels of reality in art is seen in works such as  Drawing Hands  , where two hands are shown, each drawing the other. The critic Steven Poole commented that                 In 42 the International Congress of Mathematicians met in Amsterdam, and N. G. de Bruin organized a display of Eschers work at the Stedelijk Museum for the participants. Both Roger Penrose and ": null
    },
    {
        "H. S. M. Coxeter": "harold scott macdonald coxeter"
    },
    {
        " were deeply impressed with Eschers intuitive grasp of mathematics. Inspired by Relativity, Penrose devised his ": null
    },
    {
        "tribar": "penrose tribar"
    },
    {
        ", and his father, Lionel Penrose, devised an endless staircase. Roger Penrose sent sketches of both objects to Escher, and the cycle of invention was closed when Escher then created the ": null
    },
    {
        "perpetual motion": "perpetual motion"
    },
    {
        " machine of Waterfall and the endless march of the monk-figures of Ascending and Descending.   In 42 Coxeter obtained Eschers permission to use two of his drawings in his paper Crystal symmetry and its generalizations .  He sent Escher a copy of the paper; Escher recorded that Coxeters figure of a hyperbolic tessellation gave me quite a shock : the infinite regular repetition of the tiles in the ": null
    },
    {
        "hyperbolic plane": "models of the hyperbolic plane"
    },
    {
        ", growing rapidly smaller towards the edge of the circle, was precisely what he wanted to allow him to represent ": null
    },
    {
        "infinity": "infinity"
    },
    {
        " on a two-dimensional plane.           Escher carefully studied Coxeters figure, marking it up to analyse the successively smaller circles with which it had been constructed. He then constructed a diagram, which he sent to Coxeter, showing his analysis; Coxeter confirmed it was correct, but disappointed Escher with his highly technical reply. All the same, Escher persisted with ": null
    },
    {
        "hyperbolic tiling": "hyperbolic tiling"
    },
    {
        ", which he called Coxetering . Among the results were the series of wood engravings Circle Limit I–IV. In 42 Coxeter published his finding that these works were extraordinarily accurate: Escher got it absolutely right to the millimeter .  which cites             Eschers special way of thinking and rich graphics have had a continuous influence in mathematics and art, as well as ": null
    },
    {
        "in popular culture": "m. c. escher in popular culture"
    },
    {
        ".         The Escher ": null
    },
    {
        "intellectual property": "intellectual property"
    },
    {
        " is controlled by the M.C. Escher Company, while exhibitions of his artworks are managed separately by the M.C. Escher Foundation.     The primary institutional collections of original works by M.C. Escher are the ": null
    },
    {
        "Escher Museum": "escher museum"
    },
    {
        " in ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        "; the ": null
    },
    {
        "National Gallery of Art": "national gallery of art"
    },
    {
        " ;  the ": null
    },
    {
        "National Gallery of Canada": "national gallery of canada"
    },
    {
        " ;  the ": null
    },
    {
        "Israel Museum": "israel museum"
    },
    {
        " ;  and the ": null
    },
    {
        "Huis ten Bosch": "huis ten bosch"
    },
    {
        " .             Despite wide popular interest, Escher was for a long time somewhat neglected in the art world; even in his native Netherlands, he was 42 before a retrospective exhibition was held.  In the twenty-first century, major exhibitions have been held in cities across the world. An exhibition of his work in Rio de Janeiro attracted more than 42 visitors in 42;  its daily visitor count of 42 made it the most visited museum exhibition of the year, anywhere in the world.  No major exhibition of Eschers work was held in Britain until 42 when the ": null
    },
    {
        "Scottish National Gallery of Modern Art": "scottish national gallery of modern art"
    },
    {
        " ran one in ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        " from June to September 42  moving in October 42 to the ": null
    },
    {
        "Dulwich Picture Gallery": "dulwich picture gallery"
    },
    {
        ", London. The exhibition moved to Italy in 42–42 attracting over 42 visitors in Rome and Bologna,  and then ": null
    },
    {
        "Milan": "milan"
    },
    {
        ".               ": null
    },
    {
        "Doris Schattschneider": "doris schattschneider"
    },
    {
        " identifies eleven strands of mathematical and scientific research anticipated or directly inspired by Escher. These are the classification of regular tilings using the edge relationships of tiles: two-color and two-motif tilings ; color symmetry ; metamorphosis or ": null
    },
    {
        "topological": "topology"
    },
    {
        " change; covering surfaces with symmetric patterns; Eschers algorithm ; creating tile shapes; local versus global definitions of regularity; symmetry of a tiling induced by the symmetry of a tile; orderliness not induced by symmetry groups; the filling of the central void in Eschers lithograph  Print Gallery  by H. Lenstra and B. de Smit.     The ": null
    },
    {
        "Pulitzer Prize": "pulitzer prize"
    },
    {
        "-winning 42 book  Gödel, Escher, Bach  by ": null
    },
    {
        "Douglas Hofstadter": "douglas hofstadter"
    },
    {
        "  discusses the ideas of self-reference and ": null
    },
    {
        "strange loop": "strange loop"
    },
    {
        "s, drawing on a wide range of artistic and scientific sources including Eschers art and the music of ": null
    },
    {
        "J. S. Bach": "johann sebastian bach"
    },
    {
        ".     The ": null
    },
    {
        "asteroid": "asteroid"
    },
    {
        " 42 Escher": "4444 escher"
    },
    {
        " was named in Eschers honor in 42             Eschers fame in popular culture grew when his work was featured by ": null
    },
    {
        "Martin Gardner": "martin gardner"
    },
    {
        " in his April 42 ": null
    },
    {
        " Mathematical Games column": "mathematical games column"
    },
    {
        " in  Scientific American .  Eschers works have appeared on many album covers including ": null
    },
    {
        "The Scaffold": "the scaffold"
    },
    {
        "s 42 L the P with Ascending and Descending; ": null
    },
    {
        "Mott the Hoople": "mott the hoople"
    },
    {
        "s eponymous 42 record with Reptiles, ": null
    },
    {
        "Beaver & Krause": "beaver  &  krause"
    },
    {
        "s 42 In A Wild Sanctuary with Three Worlds; and ": null
    },
    {
        "Mandrake Memorial": "mandrake memorial"
    },
    {
        "s 42 Puzzle with House of Stairs and Curl Up. His works have similarly been used on many book covers, including some editions of ": null
    },
    {
        "Edwin Abbott": "edwin abbott abbott"
    },
    {
        "s Flatland, which used Three Spheres; ": null
    },
    {
        "E. H. Gombrich": "ernst gombrich"
    },
    {
        "s Meditations on a Hobby Horse with Horseman; Pamela Halls Heads You Lose with Plane Filling 42; Patrick A. Hortons Mastering the Power of Story with Drawing Hands; ": null
    },
    {
        "Erich Gamma": "erich gamma"
    },
    {
        " et al.s Design Patterns: Elements of Reusable Object-oriented software with Swans; and Arthur Markmans Knowledge Representation with Reptiles. The World of Escher markets ": null
    },
    {
        "poster": "poster"
    },
    {
        "s, ": null
    },
    {
        "necktie": "necktie"
    },
    {
        "s, ": null
    },
    {
        "T-shirt": "t-shirt"
    },
    {
        "s, and ": null
    },
    {
        "jigsaw puzzle": "jigsaw puzzle"
    },
    {
        "s of Eschers artworks.  Both Austria and the Netherlands have issued ": null
    },
    {
        "postage stamp": "postage stamp"
    }
]