[
    {
        "The Maasai Mara  is a large ": null
    },
    {
        "game reserve": "game reserve"
    },
    {
        " in ": null
    },
    {
        "Narok County": "narok county"
    },
    {
        ", ": null
    },
    {
        "Kenya": "kenya"
    },
    {
        ", contiguous with the ": null
    },
    {
        "Serengeti National Park": "serengeti national park"
    },
    {
        " in ": null
    },
    {
        "Tanzania": "tanzania"
    },
    {
        ". It is named in honor of the ": null
    },
    {
        "Maasai people": "maasai people"
    },
    {
        " and their description of the area when looked at from afar: Mara means spotted in the local Maasai language of Maa, due to the many trees which dot the landscape.     It is world-renowned for its exceptional populations of ": null
    },
    {
        "lions": "panthera leo melanochaita"
    },
    {
        ", ": null
    },
    {
        "leopard": "african leopard"
    },
    {
        "s, ": null
    },
    {
        "cheetahs": "kenyan cheetah"
    },
    {
        "and ": null
    },
    {
        "elephant": "elephant"
    },
    {
        ", and the annual migration of ": null
    },
    {
        "wildebeest": "wildebeest"
    },
    {
        ", ": null
    },
    {
        "zebra": "zebra"
    },
    {
        ", ": null
    },
    {
        "Thomsons gazelle": "thomsons gazelle"
    },
    {
        " and other antelope, to and from the ": null
    },
    {
        "Serengeti": "serengeti"
    },
    {
        " every year known as the ": null
    },
    {
        "Great Migration": "serengetigreat migration"
    },
    {
        ".     The Greater Mara Ecosystem encompasses areas known as the Maasai Mara National Reserve, ": null
    },
    {
        "the Mara Triangle": "mara triangle"
    },
    {
        ", and several , including: Koiyaki, Lemek, Ol Chorro Oirowua, Olkinyei, Siana, Maji Moto, Naikara, Ol Derkesi, Kerinkani, Oloirien, and Kimintet.       When it was originally established in 1961 as a wildlife sanctuary the Mara covered only  of the current area, including the Mara Triangle. The area was extended to the east in 1961 to cover  and converted to a game reserve. The Narok County Council took over management of the reserve at this time. Part of the reserve was given National Reserve status in 1974, and the remaining area of  was returned to local communities. An additional  were removed from the reserve in 1976, and the park was reduced to  in 1984.     In 1994, the TransMara County Council was formed in the western part of the reserve, and control was divided between the new council and the existing Narok County Council. In May 2001, the not-for-profit Mara Conservancy took over management of the Mara Triangle.     Kenya was colonized by British colonial forces up until 1963 when Kenya gained independence. Prior to Kenyan independence, Eastern Africa and much of Africa as a whole, Kenya experienced extreme measures of colonization that has left long lasting negative effects on the country. For example, the establishment of the Maasai Mara National Reserve and Mara Triangle was brought forward by British colonists that wanted to preserve the African wildlife and landscape. The British thought that the local people in the area were causing more harm than they were goos. These establishments completely ignored local communities, which ultimately displaced local peoples from their lands.     The Maasai Mara National Reserve is named specifically after the Maasai people.The Maasai people make up a community that spans across norther, central and southern Kenya and northern parts of Tanzania. As pastoralists, the community holds the belief that they own all of the cattle in the world. The Maasai rely off of their lands to sustain their cattle, as well as themselves and their families. Prior to the establishment of the Mara Triangle and Maasai Mara, the Maasai lived on the land where the current reservers are located. Once the Maasai Mara was declared a national reservation as a conservation area for the protection of wildlife and wilderness, the Maasai were forced to move out of their native lands. The Mara displaced thousands of Maasai, where the community lost culturally significant areas and has put harsh pressures on cattle grazing.               The Maasai Mara National Reserve covers some  in south-western Kenya. It is the northernmost section of the Mara-Serengeti ": null
    },
    {
        "ecosystem": "ecosystem"
    },
    {
        ", which covers some  in Tanzania and Kenya. It is bounded by the Serengeti Park to the south, the Siria ": null
    },
    {
        "escarpment": "escarpment"
    },
    {
        " to the west, and Masai pastoral ranches to the north, east and west. Rainfall in the ecosystem increases markedly along a southeast–northwest gradient, varies in space and time, and is markedly bimodal. The Sand, Talek River and ": null
    },
    {
        "Mara River": "mara river"
    },
    {
        " are the major rivers draining the reserve. Shrubs and trees fringe most drainage lines and cover hillslopes and hilltops.     The terrain of the reserve is primarily open grassland with seasonal riverlets. In the south-east region are clumps of the distinctive ": null
    },
    {
        "acacia": "acacia"
    },
    {
        " tree. The western border is the Esoit Escarpment of the ": null
    },
    {
        "East African Rift": "east african rift"
    },
    {
        ", which is a system of rifts some  long, from Ethiopias Red Sea through Kenya, Tanzania, Malawi and into Mozambique. Wildlife tends to be most concentrated here, as the swampy ground means that access to water is always good, while tourist disruption is minimal. The easternmost border is  from ": null
    },
    {
        "Nairobi": "nairobi"
    },
    {
        ", and hence it is the eastern regions which are most visited by tourists.     Altitude: ;   Rainfall: /month;   Temperature range:             ": null
    },
    {
        "Wildebeest": "wildebeest"
    },
    {
        ", ": null
    },
    {
        "topi": "topi"
    },
    {
        ", ": null
    },
    {
        "zebra": "zebra"
    },
    {
        ", and ": null
    },
    {
        "Thomsons gazelle": "thomsons gazelle"
    },
    {
        " migrate into and occupy the Mara reserve, from the ": null
    },
    {
        "Serengeti": "serengeti"
    },
    {
        " plains to the south and ": null
    },
    {
        "Loita Plains": "loita plains"
    },
    {
        " in the pastoral ranches to the north-east, from July to October or later. Herds of all three species are also resident in the reserve.      ": null
    },
    {
        "Big Five": "big five game"
    },
    {
        "  are found here.  The population of black rhinos was fairly numerous until 1960, but it was severely depleted by poaching in the 1970s and early 1980s, dropping to a low of 15 individuals. Numbers have been slowly increasing, but the population was still only up to an estimated 23 in 1999.     ": null
    },
    {
        "Hippopotami": "hippopotamus"
    },
    {
        " and ": null
    },
    {
        "crocodiles": "nile crocodile"
    },
    {
        "are found in large groups in the Mara and Talek rivers. ": null
    },
    {
        "Hyenas": "spotted hyena"
    },
    {
        ", ": null
    },
    {
        "cheetah": "east african cheetah"
    },
    {
        "s, ": null
    },
    {
        "jackal": "jackal"
    },
    {
        "s, and ": null
    },
    {
        "bat-eared fox": "bat-eared fox"
    },
    {
        "es can also be found in the reserve. The plains between the ": null
    },
    {
        "Mara River": "mara river"
    },
    {
        " and the Esoit Siria Escarpment are probably the best area for game viewing, in particular regarding lion and cheetah.     As in the Serengeti, the wildebeest are the dominant inhabitants of the Masai Mara, and their numbers are estimated in the millions. Around July of each year, these animals migrate north from the Serengeti plains in search of fresh pasture, and return to the south around October. The Great Migration is one of the most impressive natural events worldwide, involving some 1,300,000 ": null
    },
    {
        "wildebeest": "wildebeest"
    },
    {
        ", 500,000 ": null
    },
    {
        "Thomsons gazelle": "thomsons gazelle"
    },
    {
        "s, 97,000 ": null
    },
    {
        "Topi": "topi"
    },
    {
        ", 18,000 ": null
    },
    {
        "elands": "taurotragus"
    },
    {
        ", and 200,000 ": null
    },
    {
        "zebra": "grants zebra"
    },
    {
        "s.     ": null
    },
    {
        "Antelopes": "antelopes"
    },
    {
        " can be found, including ": null
    },
    {
        "Grants gazelle": "grants gazelle"
    },
    {
        "s, ": null
    },
    {
        "impala": "impala"
    },
    {
        "s, ": null
    },
    {
        "duikers": "duiker"
    },
    {
        "and ": null
    },
    {
        "Cokes hartebeest": "cokes hartebeest"
    },
    {
        "s. The plains are also home to the distinctive ": null
    },
    {
        "Masai giraffe": "masai giraffe"
    },
    {
        ". The large ": null
    },
    {
        "roan antelope": "roan antelope"
    },
    {
        " and the nocturnal ": null
    },
    {
        "bat-eared fox": "bat-eared fox"
    },
    {
        ", rarely present elsewhere in Kenya, can be seen within the reserve borders.     More than 470 species of ": null
    },
    {
        "birds": "bird"
    },
    {
        "have been identified in the park, many of which are migrants, with almost 60 species being ": null
    },
    {
        "raptor": "bird of prey"
    },
    {
        "s. Birds that call this area home for at least part of the year include: ": null
    },
    {
        "vulture": "vulture"
    },
    {
        "s, ": null
    },
    {
        "marabou stork": "marabou stork"
    },
    {
        "s, ": null
    },
    {
        "secretary bird": "secretary bird"
    },
    {
        "s, ": null
    },
    {
        "hornbill": "hornbill"
    },
    {
        "s, ": null
    },
    {
        "crowned cranes": "balearica"
    },
    {
        ", ": null
    },
    {
        "ostrich": "ostrich"
    },
    {
        "es, ": null
    },
    {
        "long-crested eagle": "long-crested eagle"
    },
    {
        "s, ": null
    },
    {
        "African pygmy-falcons": "african pygmy-falcon"
    },
    {
        "and the ": null
    },
    {
        "lilac-breasted roller": "lilac-breasted roller"
    },
    {
        ", which is the national bird of Kenya.       Unlike most other National Parks in Kenya the Maasai Mara National Reserve is not administered by the ": null
    },
    {
        "Kenya Wildlife Service": "kenya wildlife service"
    },
    {
        ", but by ": null
    },
    {
        "Narok County": "narok county"
    },
    {
        " government. The more visited eastern part of the park is managed by Narok County Council and the western part, known as the ": null
    },
    {
        "Mara Triangle": "mara triangle"
    },
    {
        ", by the Trans-Mara county council, which is contracting management to the ": null
    },
    {
        "Mara Conservancy": "mara conservancy"
    },
    {
        ",  a local nonprofit organization formed by the local Maasai that contains several anti-poaching units.     The outer areas known as Maasai Mara Conservation area is administered by the Group Ranch Trusts of the Masai community who also have their own rangers for patrolling the park area. The wildlife roam freely across both the Reserve and Conservation areas which are a continuous wildlife ecosystem.       The Maasai Mara is a major research centre for the spotted hyena. With two field offices in the Mara, the ": null
    },
    {
        "Michigan State University": "michigan state university"
    },
    {
        " based Kay E. Holekamp Lab studies the behavior and physiology of this predator, as well as doing comparison studies between large predators in the Mara Triangle and their counterparts in the eastern part of the Mara.     A flow assessment and ": null
    },
    {
        "trans-boundary river": "trans-boundary river"
    },
    {
        " basin management plan between Kenya and Tanzania was completed for the river to sustain the ": null
    },
    {
        "ecosystem": "ecosystem"
    },
    {
        " and the basic needs of 1 million people who depend on its water.      The Mara Predator Project also operates in the Maasai Mara, cataloging and monitoring lion populations throughout the region.  Concentrating on the northern conservancies where communities coexist with wildlife, the project aims to identify population trends and responses to changes in land management, human settlements, livestock movements and tourism. Sara Blackburn, the project manager, works in partnership with a number of lodges in the region by training guides to identify lions and report sightings. Guests are also encouraged to participate in the project by photographing lions seen on game drives. An online database of individual lions is openly accessible, and features information on project participants and focus areas.      Since October 2012, the Mara-Meru Cheetah Project  is working in the Mara monitoring cheetah population, estimating population status and dynamics, and evaluating the predator impact and human activity on cheetah behavior and survival. The head of the Project, Elena Chelysheva, was working in 2001-2002 as Assistant Researcher at the Kenya Wildlife Service Maasai-Mara Cheetah Conservation Project. At that time, she developed original method of cheetah identification based on visual analysis of the unique spot patterns on front limbs and hind limbs , and spots and rings on the tail.  Collected over the years, photographic data allows the project team to trace kinship between generations and build Mara cheetah pedigree. The data collected helps to reveal parental relationship between individuals, survival rate of cubs, cheetah lifespan and personal reproductive history. This work has never been done before and the team is sharing results with the Mara stakeholders and respondents. The ongoing research is a follow-up study, which will compare results with the previous one in terms of cheetah population status and effect of human activity on cheetah behavior and surviving. The project is working in affiliation with Kenya Wildlife Service, Narok and Transmara County Councils and with assistance of Coordinator of Maasai-Mara Cultural Village Tour Association . The team is cooperating with Mara Hyena Project and working with managers and driver-guides from over 30 different Mara camps and lodges. Rangers and driver/guides are trained in cheetah identification techniques and provided with catalogues of the Mara cheetahs.     The Maasai Wilderness Conservation Trust is an organization whose mission statement states the following: The Maasai Wilderness Conservation Trust works to protect the legendary ecosystems and astounding biodiversity of East Africa through conservation that directly benefits local Maasai communities. While the MWCT was founded by an American, Edward Norton, the team is composed largely of Maasai peoples. This organization is prized off of their assistance provided in the local communities that have faced sever threats to their land and ultimately their culture as a whole. While research conducted on wildlife within the Mara is an important factor is sustaining ecotourism and a healthy ecosystem, its equally important that organizations work to ensure a successful future for local communities that have been effected by the park.               Game parks are a major source of ": null
    },
    {
        "hard currency": "hard currency"
    },
    {
        " for Kenya. Entry fees are currently ": null
    },
    {
        "US$": "united states dollar"
    },
    {
        "80 for adult non-East African Residents and $30 for children. There are a number of lodges and tented camps for tourists inside the Reserve and the Conservation area borders. The tourists/visitors cater for their own expenses, unless previously arranged by their agencies.     Although one third of the whole Masai Mara, The ": null
    },
    {
        "Mara Triangle": "mara triangle"
    },
    {
        " has only two lodges within its boundaries  and has well maintained, all weather roads. The rangers patrol regularly which means that there is less poaching and excellent game viewing. There is also strict control over vehicle numbers around animal sightings, allowing for a better experience when out on a game drive.     There are several airports which serve the camps and lodges in the Maasai Mara, including ": null
    },
    {
        "Mara Serena Airport": "mara serena airport"
    },
    {
        ", Musiara Airport and Keekorok, Kichwa Tembo, Ngerende Airport, Ol Kiombo and Angama Mara.     While visiting national reserves or parks in Eastern Africa, its important to research the history of spaces as a tourist, to gain a better understanding and obtain a deeper knowledge of the area. The continent of Africa in particular was affected in a negative manner by colonization, which has long lasting effects on the history of the continent as a whole. Tourists have gained a reputation for coming to these African landscapes, taking a photo and then quickly fleeing, while leaving their ecological waste and carbon footprint behind. In attempts to gain a better reputation for tourist, researching spaces and acknowledging the past history of Kenya and Eastern Africa is essential in mitigating this issue.            The BBC Television show titled  Big Cat Diary  was filmed in both the Reserve and Maasai Conservancy areas of the Mara. The show followed the lives of the big cats living in the reserve. The show highlighted scenes from the Reserves Musiara marsh area and the Leopard Gorge, the Fig Tree Ridge areas and the Mara River, separating the Serengeti and the Maasai Mara.       In 2018, the , a non-profit affiliated with , one of the Maras luxury safari camps, launched  Photographer of the Year competition, to showcase the Mara as a year-round destination and raise funds for conservation initiatives active in there Mara. The inaugural winner was British photographer        A study funded by ": null
    },
    {
        "WWF": "world wide fund for nature"
    },
    {
        " and conducted by ILRI between 1989 and 2003 monitored hoofed species in the Mara on a monthly basis, and found that losses were as high as 75 percent for ": null
    },
    {
        "giraffe": "giraffe"
    },
    {
        "s, 80 percent for ": null
    },
    {
        "common warthog": "common warthog"
    },
    {
        "s, 76 percent for ": null
    },
    {
        "hartebeest": "hartebeest"
    },
    {
        ", and 67 percent for ": null
    },
    {
        "impala": "impala"
    },
    {
        ". The study blames the loss of animals on increased human settlement in and around the reserve. The higher human population density leads to an increased number of livestock grazing in the park and an increase in poaching. The article claims, The study provides the most detailed evidence to date on the declines in the ": null
    },
    {
        "ungulate": "ungulate"
    },
    {
        " populations in the Mara and how this phenomenon is linked to the rapid expansion of human populations near the boundaries of the reserve.     In the Serengeti National Park, a proposed  road from ": null
    },
    {
        "Musoma": "musoma"
    },
    {
        " to ": null
    },
    {
        "Arusha": "arusha"
    },
    {
        ", with ": null
    },
    {
        "tarmac": "asphalt concrete"
    },
    {
        " touching the Serengeti, is raising criticism from scientists who say that the road will disrupt the annual migration of the wildebeest, and that this disruption would affect predators such as ": null
    },
    {
        "lion": "lion"
    },
    {
        "s, ": null
    },
    {
        "cheetahs": "cheetah"
    },
    {
        "and ": null
    },
    {
        "African wild dog": "african wild dog"
    },
    {
        "s, as well as the grasslands themselves.     According to ": null
    },
    {
        "CCTV": "china central television"
    },
    {
        " The route is expected to carry 800 vehicles a day, mostly trucks, by 2015 and 3000 vehicles a day an average of one every 30 seconds by 2035, a campaign promise made by Tanzanian President ": null
    },
    {
        "Jakaya Kikwete": "jakaya kikwete"
    },
    {
        " in 2005 .  In late June 2011 the Tanzanian government decided to cancel the Serengeti road plan due to global outcry.      The rise of local populations in areas neighbouring the reserve has led to the formation of conservation organisations such as the  who aim to ensure the peaceful and prosperous co-existence of humans alongside wildlife.     As a result of the establishment of the Maasai Mara, Maasai people were forced off of their native lands in order to make the Maasai Mara National Reserve . This displaced thousands of Maasai people to outside land that borders the reserve. As the Narok County Council took over the land in 1963, it has limited the Maasai peoples resources and land capacity to graze. Today, there are potential threats on the Maasai people as the MMNR plans to expand.  ": null
    },
    {
        "African leopard": "african leopard"
    },
    {
        " African bush elephant": "african bush elephant"
    },
    {
        " Masai giraffe": "masai giraffe"
    },
    {
        "Spotted hyenas": "spotted hyena"
    },
    {
        "with an ": null
    },
    {
        "impala": "impala"
    },
    {
        " and two ": null
    },
    {
        "vulture": "vulture"
    }
]