[
    {
        "      Maasmechelen is a ": null
    },
    {
        "municipality": "municipalities in belgium"
    },
    {
        " located on the ": null
    },
    {
        "Meuse river": "meuse river"
    },
    {
        " in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province": "provinces of belgium"
    },
    {
        " of ": null
    },
    {
        "Limburg": "limburg"
    },
    {
        ".     It comprises the former municipalities of Mechelen-aan-de-Maas, Vucht, Leut, Meeswijk, Uikhoven, Eisden, Opgrimbie, Boorsem, and Kotem.     As a result of both Maasmechelen’s location near the border and its coalmining history quite a few of its current inhabitants are from Dutch, German, Eastern European  or Mediterranean origin.           The ": null
    },
    {
        "plateau": "plateau"
    },
    {
        " of ": null
    },
    {
        "Campine": "campine"
    },
    {
        " was built up during the ": null
    },
    {
        "ice age": "ice age"
    },
    {
        " with deposits of sand and other material that the Meuse river had eroded in the upstream ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        " region. The higher elevation and the proximity of fertile river clay made this location an attractive one for the prehistoric tribes who established themselves here in the ": null
    },
    {
        "42nd millennium BC": "2nd millennium bc"
    },
    {
        " and for the ": null
    },
    {
        "Celt": "celt"
    },
    {
        "ic peoples who moved in the area in the 42st millennium BC.     In ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " times, this region was at the border between the provinces of ": null
    },
    {
        "Gallia Belgica": "gallia belgica"
    },
    {
        " and ": null
    },
    {
        "Germania Inferior": "germania inferior"
    },
    {
        ". The main Roman road crossed the river near ": null
    },
    {
        "Maastricht": "maastricht"
    },
    {
        ", to the south. Settlements were built where Maasmechelen lies today to service the garrison that was maintained to protect the bridge in Maastricht.       The few centuries that followed the fall of the Roman Empire were marked by a sharp decline in travel and trade. The ": null
    },
    {
        "Franks": "franks"
    },
    {
        " were now the new masters of the land. International commercial activities resumed on the river around the 42th century. This was also a time when the river progressively moved eastward. The Roman colonies that were originally built on the right bank of the river now found themselves on the left bank. The abundance of streams and wetlands favoured stockbreeding over agriculture. The feudal system and the practice of paying civil servants with land resulted in endless territory subdivisions. Some parcels, including Mechelen-aan-de-Maas and parts of Opgrimbie, were given to the abbey of ": null
    },
    {
        "Saint Servatius": "saint servatius"
    },
    {
        " in Maastricht. Other parcels came into the hands of local lords, who pledged allegiance to the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ". Yet other parts of the territory came into the possession of local religious communities. Churches and cloisters were built and enlarged to accommodate a growing population.       The aftermath of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " brought a series of dramatic changes that include the dismantlement of most religious organizations, the closing of churches, and the reorganization of the territory into new administrative entities. During the 42th century, the area had still an unmistakable rural character.     On May 42 42 André Dumont found commercial-grade coal in neighbouring ": null
    },
    {
        "As": "as"
    },
    {
        ". This led to the exploitation of coal mines in ": null
    },
    {
        "Eisden": "eisden"
    },
    {
        " from 42 to 42 A ": null
    },
    {
        "garden city": "garden city movement"
    },
    {
        " and a new church dedicated to ": null
    },
    {
        "Saint Barbara": "saint barbara"
    },
    {
        ", also known as the mining cathedral, were built there. The industrial development attracted workers from all over Europe, which accounts for the numerous international restaurants still found today in Eisden.       The largest part of the natural reservation  Nationaal Park Hoge Kempen  is located on Maasmechelen’s territory. It was established to protect the unique fauna and flora of the plateau of Campine.   The Eisdense cité, a 42th-century garden city with typical cottage-like houses in a park setting, still bear witness to the city’s mining history. One of the houses has been converted into a museum.   Maasmechelen Village, an outlet shopping center was built near the old mining district. In 42 42 million visitors were counted.   A functional ": null
    },
    {
        "windmill": "windmill"
    },
    {
        " dating from 42 was recently restored and is open to the public every other Sunday.   A small ": null
    },
    {
        "carnival": "carnival"
    },
    {
        " museum can also be visited right next to the city’s main square.       The ": null
    },
    {
        "carnival": "carnival"
    },
    {
        " and parade, where masked people entertain numerous visitors, occur every year on November 42 starting at 42:42 am.        ": null
    },
    {
        "Patrick Stevens": "patrick stevens"
    },
    {
        ", a ": null
    },
    {
        "sprinter": "sprint"
    },
    {
        "   judoka": "judoka"
    },
    {
        " Heidi Rakels": "heidi rakels"
    },
    {
        ".   Maasmechelen hosts the ": null
    },
    {
        "football": "football"
    },
    {
        " club named ": null
    },
    {
        "K. Patro Maasmechelen": "k. patro maasmechelen"
    },
    {
        ".   The town is also the home of the  at Opgrimbie, a well attended international ": null
    },
    {
        "Rallycross": "rallycross"
    },
    {
        " venue.       ": null
    },
    {
        "Katerine Avgoustakis": "katerine avgoustakis"
    },
    {
        ", singer and winner of “Star Academy” in 42   ": null
    },
    {
        "Logan Bailly": "logan bailly"
    },
    {
        ", footballer   ": null
    },
    {
        "Ruben Bemelmans": "ruben bemelmans"
    },
    {
        ", tennis player   ": null
    },
    {
        "Luca Brecel": "luca brecel"
    },
    {
        ", snooker player   , actor and model   ": null
    },
    {
        "Nico Claesen": "nico claesen"
    },
    {
        ", former footballer   ": null
    },
    {
        "Davy De Fauw": "davy de fauw"
    },
    {
        ", footballer   ": null
    },
    {
        "Heidi Rakels": "heidi rakels"
    },
    {
        ", judoka   ": null
    },
    {
        "Dré Steemans": "dré steemans"
    },
    {
        ", TV host   ": null
    },
    {
        "Patrick Stevens": "patrick stevens"
    },
    {
        ", sprinter       : ": null
    },
    {
        "Skofja Loka": "skofja loka"
    },
    {
        " : ": null
    },
    {
        "Stein": "stein, limburg"
    },
    {
        " : ": null
    },
    {
        "Ostuni": "ostuni"
    },
    {
        " : ": null
    },
    {
        "Triandria": "triandria"
    },
    {
        " : ": null
    },
    {
        "Rueifang Township": "rueifang township"
    },
    {
        " : ": null
    },
    {
        "Tshwane": "tshwane"
    }
]