[
    {
        "                    Macbeth  is a ": null
    },
    {
        "tragedy": "shakespearean tragedy"
    },
    {
        " by ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "; it is thought to have been first performed in ": null
    },
    {
        "1606": "1606 in literature"
    },
    {
        ". It dramatises the damaging physical and psychological effects of political ambition on those who seek power for its own sake. Of all the plays that Shakespeare wrote during the ": null
    },
    {
        "reign of James I": "jacobean era"
    },
    {
        ", who was patron of Shakespeares ": null
    },
    {
        "acting company": "playing company"
    },
    {
        ", Macbeth most clearly reflects the playwrights relationship with his sovereign. It was first published in the ": null
    },
    {
        "Folio of 1623": "first folio"
    },
    {
        ", possibly from a ": null
    },
    {
        "prompt book": "prompt book"
    },
    {
        ", and is Shakespeares shortest tragedy.     A brave Scottish general named ": null
    },
    {
        "Macbeth": "macbeth"
    },
    {
        " receives a prophecy from a trio of witches that one day he will become ": null
    },
    {
        "King of Scotland": "king of scotland"
    },
    {
        ". Consumed by ambition and spurred to action by his wife, Macbeth murders King Duncan and takes the Scottish throne for himself. He is then wracked with guilt and paranoia. Forced to commit more and more murders to protect himself from enmity and suspicion, he soon becomes a tyrannical ruler. The bloodbath and consequent civil war swiftly take Macbeth and Lady Macbeth into the realms of madness and death.     Shakespeares source for the story is the account of ": null
    },
    {
        "Macbeth, King of Scotland": "macbeth, king of scotland"
    },
    {
        ", ": null
    },
    {
        "Macduff": "macduff"
    },
    {
        ", and ": null
    },
    {
        "Duncan": "duncan i of scotland"
    },
    {
        " in  Holinsheds Chronicles  , a history of England, Scotland, and Ireland familiar to Shakespeare and his contemporaries, although the events in the play differ extensively from the history of the real Macbeth. The events of the tragedy are usually associated with the execution of ": null
    },
    {
        "Henry Garnet": "henry garnet"
    },
    {
        " for complicity in the ": null
    },
    {
        "Gunpowder Plot": "gunpowder plot"
    },
    {
        " of 1605.     In the backstage world of theatre, some believe that the play is cursed, and will not mention its title aloud, referring to it instead as ": null
    },
    {
        "The Scottish Play": "the scottish play"
    },
    {
        " . Over the course of many centuries, the play has attracted some of the most renowned actors to the roles of Macbeth and Lady Macbeth. It has been adapted to film, television, ": null
    },
    {
        "opera": "macbeth"
    },
    {
        ", novels, comics, and other media.        ": null
    },
    {
        "Duncan": "king duncan"
    },
    {
        "king of ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " Malcolm": "malcolm"
    },
    {
        "Duncans elder son   ": null
    },
    {
        "Donalbain": "donalbain"
    },
    {
        "Duncans younger son   ": null
    },
    {
        "Macbeth": "macbeth"
    },
    {
        "a general in the army of King Duncan; originally ": null
    },
    {
        "Thane": "thane"
    },
    {
        " of ": null
    },
    {
        "Glamis": "glamis"
    },
    {
        ", then Thane of ": null
    },
    {
        "Cawdor": "cawdor"
    },
    {
        ", and later king of Scotland   ": null
    },
    {
        "Lady Macbeth": "lady macbeth"
    },
    {
        "Macbeths wife, and later queen of Scotland   ": null
    },
    {
        "Banquo": "banquo"
    },
    {
        "Macbeths friend and a general in the army of King Duncan   ": null
    },
    {
        "Fleance": "fleance"
    },
    {
        "Banquos son   ": null
    },
    {
        "Macduff": "macduff"
    },
    {
        "Thane of ": null
    },
    {
        "Fife": "fife"
    },
    {
        " Lady Macduff": "lady macduff"
    },
    {
        "Macduffs wife   ": null
    },
    {
        "Macduffs son": "macduffs son"
    },
    {
        " Scottish Thanes   ": null
    },
    {
        "Siward": "siward, earl of northumbria"
    },
    {
        "general of the English forces   ": null
    },
    {
        "Young Siward": "young siward"
    },
    {
        "Siwards son   SeytonMacbeths armourer   ": null
    },
    {
        "Hecate": "hecate"
    },
    {
        "queen of the witches   ": null
    },
    {
        "Three Witches": "three witches"
    },
    {
        " in the Scottish army   Three Murderersemployed by Macbeth   ": null
    },
    {
        "Third Murderer": "third murderer"
    },
    {
        " attack Lady Macduff   Portergatekeeper at Macbeths home   DoctorLady Macbeths doctor   Doctorat the English court   GentlewomanLady Macbeths caretaker   Lordopposed to Macbeth   First Apparitionarmed head   Second Apparitionbloody child   Third Apparitioncrowned child   Attendants, Messengers, Servants, Soldiers                   The play opens amid thunder and lightning, and the Three Witches decide that their next meeting will be with Macbeth. In the following scene, a wounded sergeant reports to King Duncan of Scotland that his generals Macbeth, who is the Thane of Glamis, and Banquo have just defeated the allied forces of Norway and Ireland, who were led by the traitorous Macdonwald, and the Thane of ": null
    },
    {
        "Cawdor": "cawdor"
    },
    {
        ". Macbeth, the Kings kinsman, is praised for his bravery and fighting prowess.     In the following scene, Macbeth and Banquo discuss the weather and their victory. As they wander onto a heath, the Three Witches enter and greet them with prophecies. Though Banquo challenges them first, they address Macbeth, hailing him as Thane of Glamis, Thane of Cawdor, and that he will be King hereafter. Macbeth appears to be stunned to silence. When Banquo asks of his own fortunes, the witches respond paradoxically, saying that he will be less than Macbeth, yet happier, less successful, yet more. He will father a line of kings, though he himself will not be one. While the two men wonder at these pronouncements, the witches vanish, and another thane, Ross, arrives and informs Macbeth of his newly bestowed title: Thane of Cawdor. The first prophecy is thus fulfilled, and Macbeth, previously sceptical, immediately begins to harbour ambitions of becoming king.     King Duncan welcomes and praises Macbeth and Banquo, and declares that he will spend the night at Macbeths castle at ": null
    },
    {
        "Inverness": "inverness"
    },
    {
        "; he also names his son Malcolm as his heir. Macbeth sends a message ahead to his wife, Lady Macbeth, telling her about the witches prophecies. Lady Macbeth suffers none of her husbands uncertainty and wishes him to murder Duncan in order to obtain kingship. When Macbeth arrives at Inverness, she overrides all of her husbands objections by challenging his manhood and successfully persuades him to kill the king that very night. He and Lady Macbeth plan to get Duncans two chamberlains drunk so that they will black out; the next morning they will blame the chamberlains for the murder. They will be defenceless as they will remember nothing.         While Duncan is asleep, Macbeth stabs him, despite his doubts and a number of supernatural portents, including a hallucination of a bloody dagger. He is so shaken that Lady Macbeth has to take charge. In accordance with her plan, she frames Duncans sleeping servants for the murder by placing bloody daggers on them. Early the next morning, Lennox, a Scottish nobleman, and Macduff, the loyal Thane of Fife, arrive. A porter opens the gate and Macbeth leads them to the kings chamber, where Macduff discovers Duncans body. Macbeth murders the guards to prevent them from professing their innocence, but claims he did so in a fit of anger over their misdeeds. Duncans sons Malcolm and Donalbain flee to England and Ireland, respectively, fearing that whoever killed Duncan desires their demise as well. The rightful heirs flight makes them suspects and Macbeth assumes the throne as the new King of Scotland as a kinsman of the dead king. Banquo reveals this to the audience, and while sceptical of the new King Macbeth, he remembers the witches prophecy about how his own descendants would inherit the throne; this makes him suspicious of Macbeth.         Despite his success, Macbeth, also aware of this part of the prophecy, remains uneasy. Macbeth invites Banquo to a royal ": null
    },
    {
        "banquet": "banquet"
    },
    {
        ", where he discovers that Banquo and his young son, Fleance, will be riding out that night. Fearing Banquos suspicions, Macbeth arranges to have him murdered, by hiring two men to kill them, later sending a ": null
    },
    {
        "Third Murderer": "third murderer"
    },
    {
        ". The assassins succeed in killing Banquo, but Fleance escapes. Macbeth becomes furious: he fears that his power remains insecure as long as an heir of Banquo remains alive.     At a banquet, Macbeth invites his lords and Lady Macbeth to a night of drinking and merriment. Banquos ": null
    },
    {
        "ghost": "ghosts in european culture"
    },
    {
        " enters and sits in Macbeths place. Macbeth raves fearfully, startling his guests, as the ghost is only visible to him. The others panic at the sight of Macbeth raging at an empty chair, until a desperate Lady Macbeth tells them that her husband is merely afflicted with a familiar and harmless malady. The ghost departs and returns once more, causing the same riotous anger and fear in Macbeth. This time, Lady Macbeth tells the lords to leave, and they do so.              Macbeth, disturbed, visits the three witches once more and asks them to reveal the truth of their prophecies to him. To answer his questions, they summon horrible apparitions, each of which offers predictions and further prophecies to put Macbeths fears at rest. First, they conjure an armoured head, which tells him to beware of Macduff . Second, a bloody child tells him that no one born of a woman will be able to harm him. Thirdly, a crowned child holding a tree states that Macbeth will be safe until ": null
    },
    {
        "Great Birnam Wood": "birnam, perth and kinross"
    },
    {
        " comes to ": null
    },
    {
        "Dunsinane Hill": "dunsinane hill"
    },
    {
        ". Macbeth is relieved and feels secure because he knows that all men are born of women and forests cannot move. Macbeth also asks whether Banquos sons will ever reign in Scotland: the witches conjure a procession of eight crowned kings, all similar in appearance to Banquo, and the last carrying a mirror that reflects even more kings. Macbeth realises that these are all Banquos descendants having acquired kingship in numerous countries. After the witches perform a mad dance and leave, Lennox enters and tells Macbeth that Macduff has fled to England. Macbeth orders Macduffs castle be seized, and, most cruelly, sends murderers to slaughter Macduff, as well as Macduffs wife and children. Although Macduff is no longer in the castle, everyone in Macduffs castle is put to death, including ": null
    },
    {
        "Lady Macduff": "lady macduff"
    },
    {
        " and ": null
    },
    {
        "their young son": "macduffs son"
    },
    {
        ".              Meanwhile, Lady Macbeth becomes racked with guilt from the crimes she and her husband have committed. At night, in the kings palace at Dunsinane, a doctor and a gentlewoman discuss Lady Macbeths strange habit of sleepwalking. Suddenly, Lady Macbeth enters in a trance with a candle in her hand. Bemoaning the murders of Duncan, Lady Macduff, and Banquo, she tries to wash off imaginary bloodstains from her hands, all the while speaking of the terrible things she knows she pressed her husband to do. She leaves, and the doctor and gentlewoman marvel at her descent into madness. Her belief that nothing can wash away the blood on her hands is an ironic reversal of her earlier claim to Macbeth that little water clears us of this deed .     In England, Macduff is informed by Ross that his castle is surprised; wife and babes / Savagely slaughterd . When this news of his familys execution reaches him, Macduff is stricken with grief and vows revenge. Prince Malcolm, Duncans son, has succeeded in raising an army in England, and Macduff joins him as he rides to Scotland to challenge Macbeths forces. The invasion has the support of the Scottish nobles, who are appalled and frightened by Macbeths tyrannical and murderous behaviour. Malcolm leads an army, along with Macduff and Englishmen ": null
    },
    {
        "Siward": "sigurd the dane"
    },
    {
        " , the ": null
    },
    {
        "Earl of Northumberland": "northumberland"
    },
    {
        ", against Dunsinane Castle. While encamped in Birnam Wood, the soldiers are ordered to cut down and carry tree limbs to camouflage their numbers.     Before Macbeths opponents arrive, he receives news that Lady Macbeth has killed herself, causing him to sink into a deep and pessimistic despair and deliver his ": null
    },
    {
        "Tomorrow, and tomorrow, and tomorrow": "tomorrow, and tomorrow, and tomorrow"
    },
    {
        " soliloquy": "soliloquy"
    },
    {
        " . Though he reflects on the brevity and meaninglessness of life, he nevertheless awaits the English and fortifies Dunsinane. He is certain that the witches prophecies guarantee his invincibility, but is struck with fear when he learns that the English army is advancing on Dunsinane shielded with boughs cut from Birnam Wood, in apparent fulfillment of one of the prophecies.     A battle culminates in Macduffs confrontation with Macbeth, who kills Young Siward in combat. The English forces overwhelm his army and castle. Macbeth boasts that he has no reason to fear Macduff, for he cannot be killed by any man born of woman. Macduff declares that he was from his mothers womb / Untimely rippd ,  and is not of woman born , fulfilling the second prophecy. Macbeth realises too late that he has misinterpreted the witches words. Though he realises that he is doomed, he continues to fight. Macduff kills and beheads him, thus fulfilling the remaining prophecy.     Macduff carries Macbeths head onstage and Malcolm discusses how order has been restored. His last reference to Lady Macbeth, however, reveals tis thought, by self and violent hands / Took off her life , but the method of her suicide is undisclosed. Malcolm, now the King of Scotland, declares his benevolent intentions for the country and invites all to see him crowned at ": null
    },
    {
        "Scone": "scone, scotland"
    },
    {
        ".     Although Malcolm, and not Fleance, is placed on the throne, the witches prophecy concerning Banquo was known to the audience of Shakespeares time to be true: James VI of Scotland  was supposedly a descendant of Banquo.                A principal source comes from the  Daemonologie  of King James published in 1597 which included a news pamphlet titled  Newes from Scotland  that detailed the famous ": null
    },
    {
        "North Berwick Witch Trials": "north berwick witch trials"
    },
    {
        " of 1590.  The publication of Daemonologie came just a few years before the tragedy of Macbeth with the themes and setting in a direct and comparative contrast with King James personal experiences with witchcraft. Not only had this trial taken place in Scotland, the witches involved were recorded to have also conducted rituals with the same mannerisms as the three witches. One of the evidenced passages is referenced when the witches involved in the trial confessed to attempt the use of witchcraft to raise a tempest and sabotage the very boat King James and his queen were on board during their return trip from ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ". This was significant as one ship sailing with King James fleet actually sank in the storm. The three witches discuss the raising of winds at sea in the opening lines of Act 1 Scene 3.     Macbeth has been compared to Shakespeares  Antony and Cleopatra . As characters, both Antony and Macbeth seek a new world, even at the cost of the old one. Both fight for a throne and have a nemesis to face to achieve that throne. For Antony, the nemesis is Octavius; for Macbeth, it is Banquo. At one point Macbeth even compares himself to Antony, saying under Banquo / My Genius is rebukd, as it is said / Mark Antonys was by Caesar. Lastly, both plays contain powerful and manipulative female figures: Cleopatra and Lady Macbeth.     Shakespeare borrowed the story from several tales in  Holinsheds Chronicles , a popular history of the British Isles well known to Shakespeare and his contemporaries. In Chronicles, a man named Donwald finds several of his family put to death by his king, ": null
    },
    {
        "King Duff": "dub, king of scotland"
    },
    {
        ", for dealing with witches. After being pressured by his wife, he and four of his servants kill the King in his own house. In Chronicles, Macbeth is portrayed as struggling to support the kingdom in the face of King Duncans ineptitude. He and Banquo meet the three witches, who make exactly the same prophecies as in Shakespeares version. Macbeth and Banquo then together plot the murder of Duncan, at Lady Macbeths urging. Macbeth has a long, ten-year reign before eventually being overthrown by Macduff and Malcolm. The parallels between the two versions are clear. However, some scholars think that ": null
    },
    {
        "George Buchanans": "george buchanan"
    },
    {
        "  Rerum Scoticarum Historia  matches Shakespeares version more closely. Buchanans work was available in Latin in Shakespeares day.     No medieval account of the reign of Macbeth mentions the Weird Sisters, Banquo, or Lady Macbeth, and with the exception of the latter none actually existed. The characters of Banquo, the Weird Sisters, and Lady Macbeth were first mentioned in 1527 by a Scottish historian ": null
    },
    {
        "Hector Boece": "hector boece"
    },
    {
        " in his book Historia Gentis Scotorum  who wanted to denigrate Macbeth in order to strengthen the claim of the House of Stewart to the Scottish throne. Boece portrayed Banquo as an ancestor of the Stewart kings of Scotland, adding in a prophecy that the descendants of Banquo would be the rightful kings of Scotland while the Weird Sisters served to give a picture of King Macbeth as gaining the throne via dark supernatural forces. Macbeth did have a wife, but it is not clear if she was as power-hungry and ambitious as Boece portrayed her, which served his purpose of having even Macbeth realise he lacked a proper claim to the throne, and only took it at the urging of his wife. Holinshed accepted Boeces version of Macbeths reign at face value and included it in his Chronicles. Shakespeare saw the dramatic possibilities in the story as related by Holinshed, and used it as the basis for the play.     No other version of the story has Macbeth kill the king in Macbeths own castle. Scholars have seen this change of Shakespeares as adding to the darkness of Macbeths crime as the worst violation of hospitality. Versions of the story that were common at the time had Duncan being killed in an ambush at ": null
    },
    {
        "Inverness": "inverness"
    },
    {
        ", not in a castle. Shakespeare conflated the story of Donwald and King Duff in what was a significant change to the story.     Shakespeare made another important change. In Chronicles, Banquo is an accomplice in Macbeths murder of King Duncan, and plays an important part in ensuring that Macbeth, not Malcolm, takes the throne in the coup that follows. In Shakespeares day, Banquo was thought to be an ancestor of the ": null
    },
    {
        "Stuart": "house of stuart"
    },
    {
        " King James I. The Banquo portrayed in earlier sources is significantly different from the Banquo created by Shakespeare. Critics have proposed several reasons for this change. First, to portray the kings ancestor as a murderer would have been risky. Other authors of the time who wrote about Banquo, such as ": null
    },
    {
        "Jean de Schelandre": "jean de schelandre"
    },
    {
        " in his Stuartide, also changed history by portraying Banquo as a noble man, not a murderer, probably for the same reasons. Second, Shakespeare may have altered Banquos character simply because there was no dramatic need for another accomplice to the murder; there was, however, a need to give a dramatic contrast to Macbeth—a role which many scholars argue is filled by Banquo.     Other scholars maintain that a strong argument can be made for associating the tragedy with the ": null
    },
    {
        "Gunpowder Plot": "gunpowder plot"
    },
    {
        " of 1605. As presented by Harold Bloom in 2008: holars cite the existence of several topical references in Macbeth to the events of that year, namely the execution of the Father Henry Garnett for his alleged complicity in the Gunpowder Plot of 1605, as referenced in the porters scene.  Those arrested for their role in the Gunpowder Plot refused to give direct answers to the questions posed to them by their interrogators, which reflected the influence of the Jesuit practice of ": null
    },
    {
        "equivocation": "equivocation"
    },
    {
        ". Shakespeare, by having Macbeth say that demons palter...in a double sense and keep the promise to our ear/And break it to our hope , confirmed Jamess belief that equivocation was a wicked practice, which reflected in turn the wickedness of the Catholic Church. Garnett had in his possession A Treatise on Equivocation, and in the play the Weird Sisters often engage in equivocation, for instance telling Macbeth that he could never be overthrown until Great Birnan wood to high Dunsinane hill/Shall Come . Macbeth interprets the prophecy as meaning never, but in fact, the Three Sisters refer only to branches of the trees of Great Birnan coming to Dunsinane hill.       Macbeth cannot be dated precisely but is usually taken as contemporaneous to the other canonical tragedies . While some scholars have placed the original writing of the play as early as 1599, most believe that the play is unlikely to have been composed earlier than 1603 as the play is widely seen to celebrate King James ancestors and the Stuart accession to the throne in 1603 , suggesting that the parade of eight kings—which the witches show Macbeth in a vision in Act IV—is a compliment to King James. Many scholars think the play was written in 1606 in the aftermath of the Gunpowder Plot, citing possible internal allusions to the 1605 plot and its ensuing trials. In fact, there are a great number of allusions and possible pieces of evidence alluding to the Plot, and, for this reason, a great many critics agree that Macbeth was written in the year 1606. Lady Macbeths instructions to her husband, Look like the innocent flower, but be the serpent undert , may be an allusion to a medal that was struck in 1605 to commemorate King James escape that depicted a serpent hiding among lilies and roses.     Particularly, the Porters speech in which he welcomes an equivocator , a farmer, and a tailor to hell , has been argued to be an allusion to the 28 March 1606 trial and execution on 3 May 1606 of the Jesuit ": null
    },
    {
        "Henry Garnet": "henry garnet"
    },
    {
        ", who used the alias Farmer , with equivocator referring to Garnets defence of ": null
    },
    {
        " equivocation ": "mental reservation"
    },
    {
        ". The porter says that the equivocator committed treason enough for Gods sake , which specifically connects equivocation and treason and ties it to the Jesuit belief that equivocation was only lawful when used for Gods sake , strengthening the allusion to Garnet. The porter goes on to say that the equivocator yet could not equivocate to heaven , echoing grim jokes that were current on the eve of Garnets execution: i.e. that Garnet would be hanged without equivocation and at his execution he was asked not to equivocate with his last breath.  The English tailor the porter admits to hell , has been seen as an allusion to Hugh Griffin, a tailor who was questioned by the ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        " on 27 November and 3 December 1607 for the part he played in Garnets miraculous straw , an infamous head of straw that was stained with Garnets blood that had congealed into a form resembling Garnets portrait, which was hailed by Catholics as a miracle. The tailor Griffin became notorious and the subject of verses published with his portrait on the title page.     When James became king of England, a feeling of uncertainty settled over the nation. James was a Scottish king and the son of ": null
    },
    {
        "Mary, Queen of Scots": "mary, queen of scots"
    },
    {
        ", a staunch Catholic and English traitor. In the words of critic ": null
    },
    {
        "Robert Crawford": "robert crawford"
    },
    {
        ", Macbeth was a play for a post-Elizabethan England facing up to what it might mean to have a Scottish king. England seems comparatively benign, while its northern neighbour is mired in a bloody, monarch-killing past. ... Macbeth may have been set in medieval Scotland, but it was filled with material of interest to England and Englands ruler.  Critics argue that the content of the play is clearly a message to James, the new Scottish King of England. Likewise, the critic Andrew Hadfield noted the contrast the play draws between the saintly King Edward the Confessor of England who has the power of the royal touch to cure scrofula and whose realm is portrayed as peaceful and prosperous vs. the bloody chaos of Scotland. James in his 1598 book The Trew Law of Free Monarchies had asserted that kings are always right, if not just, and his subjects owe him total loyalty at all times, writing that even if a king is a tyrant, his subjects must never rebel and just endure his tyranny for their own good. James had argued that the tyranny was preferable to the problems caused by rebellion which were even worse; Shakespeare by contrast in Macbeth argued for the right of the subjects to overthrow a tyrant king, in what appeared to be an implied criticism of Jamess theories if applied to England. Hadfield also noted a curious aspect of the play in that it implies that primogeniture is the norm in Scotland, but Duncan has to nominate his son Malcolm to be his successor while Macbeth is accepted without protest by the Scottish lairds as their king despite being an usurper. Hadfield argued this aspect of the play with the thanes apparently choosing their king was a reference to the Stuart claim to the English throne, and the attempts of the English parliament to block the succession of Jamess Catholic mother, Mary, Queen of Scots, from succeeding to the English throne. Hadfield argued that Shakespeare implied that James was indeed the rightful king of England, but owned his throne not to divine favour as James would have it, but rather due to the willingness of the English Parliament to accept the Protestant son of the Catholic Mary, Queen of Scots, as their king.     Garry Wills provides further evidence that Macbeth is a Gunpowder Play . He points out that every Gunpowder Play contains a necromancy scene, regicide attempted or completed, references to equivocation, scenes that test loyalty by use of deceptive language, and a character who sees through plots—along with a vocabulary similar to the Plot in its immediate aftermath  and an ironic recoil of the Plot upon the Plotters .      The play utilizes a few key words that the audience at the time would recognize as allusions to the Plot. In one sermon in 1605, ": null
    },
    {
        "Lancelot Andrewes": "lancelot andrewes"
    },
    {
        " stated, regarding the failure of the Plotters on Gods day, Be they fair or foul, glad or sad the great Diespiter, the Father of days hath made them both.  Shakespeare begins the play by using the words fair and foul in the first speeches of the witches and Macbeth. In the words of Jonathan Gil Harris, the play expresses the horror unleashed by a supposedly loyal subject who seeks to kill a king and the treasonous role of equivocation. The play even echoes certain keywords from the scandal—the vault beneath the House of Parliament in which Guy Fawkes stored thirty kegs of gunpowder and the blow about which one of the conspirators had secretly warned a relative who planned to attend the House of Parliament on 5 November...Even though the Plot is never alluded to directly, its presence is everywhere in the play, like a pervasive odor.         Scholars also cite an entertainment seen by King James at ": null
    },
    {
        "Oxford": "oxford"
    },
    {
        " in the summer of 1605 that featured three ": null
    },
    {
        "sibyls": "sibyl"
    },
    {
        " like the weird sisters; Kermode surmises that Shakespeare could have heard about this and alluded to it with the weird sisters. However, A. R. Braunmuller in the New Cambridge edition finds the 1605–06 arguments inconclusive, and argues only for an earliest date of 1603.     One suggested allusion supporting a date in late 1606 is the first witchs dialogue about a sailors wife: Aroint thee, witch! the rump-fed ronyon cries./Her husbands to Aleppo gone, master o the Tiger . This has been thought to allude to the Tiger, a ship that returned to England 27 June 1606 after a disastrous voyage in which many of the crew were killed by pirates. A few lines later the witch speaks of the sailor, He shall live a man forbid:/Weary sennights nine times nine . The real ship was at sea 567 days, the product of 7x9x9, which has been taken as a confirmation of the allusion, which if correct, confirms that the witch scenes were either written or amended later than July 1606.     The play is not considered to have been written any later than 1607, since, as Kermode notes, there are fairly clear allusions to the play in 1607.  One notable reference is in ": null
    },
    {
        "Francis Beaumonts": "francis beaumont"
    },
    {
        "  Knight of the Burning Pestle , first performed in 1607. The following lines are, according to scholars, a clear allusion to the scene in which Banquos ghost haunts Macbeth at the dinner table:       When thou art at thy table with thy friends,   Merry in heart, and filled with swelling wine,   Ill come in midst of all thy pride and mirth,   Invisible to all men but thyself,   And whisper such a sad tale in thine ear   Shall make thee let the cup fall from thy hand,   And stand as mute and pale as death itself.     Macbeth was first printed in the ": null
    },
    {
        "First Folio": "first folio"
    },
    {
        " of 1623 and the Folio is the only source for the text. Some scholars contend that the Folio text was abridged and rearranged from an earlier manuscript or prompt book. Often cited as interpolation are stage cues for two songs, whose lyrics are not included in the Folio but are included in ": null
    },
    {
        "Thomas Middletons": "thomas middleton"
    },
    {
        "play  The Witch , which was written between the accepted date for Macbeth and the printing of the Folio. Many scholars believe these songs were editorially inserted into the Folio, though whether they were Middletons songs or preexisting songs is not certain. It is also widely believed that the character of ": null
    },
    {
        "Hecate": "hecatehecate in literature"
    },
    {
        ", as well as some lines of the First Witch , were not part of Shakespeares original play but were added by the Folio editors and possibly written by Middleton, though there is no completely objective proof of such interpolation.       The reconstructive movement was concerned with the recreation of Elizabethan acting conditions, and would eventually lead to the creation of ": null
    },
    {
        "Shakespeares Globe": "shakespeares globe"
    },
    {
        " and similar replicas. One of the movements offshoots was in the reconstruction of Elizabethan pronunciation: for example ": null
    },
    {
        "Bernard Miles": "bernard miles"
    },
    {
        " 1951 Macbeth, for which linguists from ": null
    },
    {
        "University College London": "university college london"
    },
    {
        " were employed to create a transcript of the play in Elizabethan English, then an audio recording of that transcription, from which the actors, in turn, learned their lines.     The pronunciation of many words evolves over time. In Shakespeares day, for example, heath was pronounced as heth , so it rhymed with Macbeth in the sentences by the Witches at the beginning of the play:     Second Witch: Upon the heath. Third Witch: There to meet with Macbeth.     A scholar of antique pronunciation writes, Heath would have made a close rhyme with the -eth of Macbeth, which was pronounced with a short i as in it.      In the theatre programme notes, much was made of how OP performance reintroduces lost rhymes such as the final couplet: So thanks to all at once, and each to one, / Whom we invite to see us crowned at Scone where one sounds like own. The Witches, the plays great purveyors of rhyme, benefited most in this regard. So, babe sounded like bab and rhymed with drab ...      Eoin Price wrote, I found the OP rendition of Banquos brilliant question Or have we eaten on the insane root / That takes the raison prisoner? unduly amusing ; and he adds,     :... fear had two pronunciations: the standard modern pronunciation being one, and fair being the other. Mostly, the actors seemed to pronounce it in a way which accords with the modern standard, but during one speech, Macbeth said fair. This seems especially significant in a play determined to complicate the relationship between fair and foul. I wonder, then, if the punning could be extended throughout the production. Would Banquos lines, Good sir, why do you start and seem to fear / Things that do sound so fair? be fascinatingly illuminated, or merely muddled, by this punning? Perhaps this is a possibility the cast already experimented with and chose to discard, but, for sure, an awareness of the possibility of a fair/fear pun can have interesting ramifications for the play.             Macbeth is an anomaly among Shakespeares tragedies in certain critical ways. It is short: more than a thousand lines shorter than Othello and King Lear, and only slightly more than half as long as Hamlet. This brevity has suggested to many critics that the received version is based on a heavily cut source, perhaps a prompt-book for a particular performance. This would reflect other Shakespearean plays existing in both Quarto and the Folio, where the Quarto versions are usually longer than the Folio versions. Macbeth was first printed in the First Folio, but has no Quarto version  – if there were a Quarto, it would probably be longer than the Folio version. Bradley, AC, Shakespearean Tragedy That brevity has also been connected to other unusual features: the fast pace of the first act, which has seemed to be stripped for action ; the comparative flatness of the characters other than Macbeth; and the oddness of Macbeth himself compared with other Shakespearean tragic heroes. ": null
    },
    {
        "A. C. Bradley": "a. c. bradley"
    },
    {
        ", in considering this question, concluded the play always was an extremely short one , noting the witch scenes and battle scenes would have taken up some time in performance, remarking, I do not think that, in reading, we feel Macbeth to be short: certainly we are astonished when we hear it is about half as long as Hamlet. Perhaps in the Shakespearean theatre too it seemed to occupy a longer time than the clock recorded. Bradley, AC, Shakespearean Tragedy       At least since the days of ": null
    },
    {
        "Alexander Pope": "alexander pope"
    },
    {
        " and ": null
    },
    {
        "Samuel Johnson": "samuel johnson"
    },
    {
        ", analysis of the play has centred on the question of Macbeths ambition, commonly seen as so dominant a trait that it defines the character. Johnson asserted that Macbeth, though esteemed for his military bravery, is wholly reviled.     This opinion recurs in critical literature, and, according to ": null
    },
    {
        "Caroline Spurgeon": "caroline spurgeon"
    },
    {
        ", is supported by Shakespeare himself, who apparently intended to degrade his hero by vesting him with clothes unsuited to him and to make Macbeth look ridiculous by several ": null
    },
    {
        "nimisms": "nimism"
    },
    {
        "he applies: His garments seem either too big or too small for him  – as his ambition is too big and his character too small for his new and unrightful role as king. When he feels as if dressed in borrowed robes , after his new title as Thane of Cawdor, prophesied by the witches, has been confirmed by Ross , Banquo comments: New honours come upon him, Like our strange garments, cleave not to their mould, But with the aid of use . And, at the end, when the tyrant is at bay at Dunsinane, Caithness sees him as a man trying in vain to fasten a large garment on him with too small a belt: He cannot buckle his distemperd cause Within the belt of rule while Angus, in a similar nimism, sums up what everybody thinks ever since Macbeths accession to power: now does he feel his title Hang loose about him, like a giants robe upon a dwarfish thief .     Like ": null
    },
    {
        "Richard III": "richard iii of england"
    },
    {
        ", but without that characters perversely appealing exuberance, Macbeth wades through blood until his inevitable fall. As Kenneth Muir writes, Macbeth has not a predisposition to murder; he has merely an inordinate ambition that makes murder itself seem to be a lesser evil than failure to achieve the crown.  Some critics, such as E. E. Stoll, explain this characterisation as a holdover from Senecan or medieval tradition. Shakespeares audience, in this view, expected villains to be wholly bad, and Senecan style, far from prohibiting a villainous protagonist, all but demanded it.     Yet for other critics, it has not been so easy to resolve the question of Macbeths motivation. ": null
    },
    {
        "Robert Bridges": "robert bridges"
    },
    {
        ", for instance, perceived a paradox: a character able to express such convincing horror before Duncans murder would likely be incapable of committing the crime. For many critics, Macbeths motivations in the first act appear vague and insufficient. ": null
    },
    {
        "John Dover Wilson": "john dover wilson"
    },
    {
        " hypothesised that Shakespeares original text had an extra scene or scenes where husband and wife discussed their plans. This interpretation is not fully provable; however, the motivating role of ambition for Macbeth is universally recognised. The evil actions motivated by his ambition seem to trap him in a cycle of increasing evil, as Macbeth himself recognises: I am in blood Steppd in so far that, should I wade no more, Returning were as tedious as go oer.      While working on Russian translations of Shakespeares works, ": null
    },
    {
        "Boris Pasternak": "boris pasternak"
    },
    {
        " compared Macbeth to ": null
    },
    {
        "Raskolnikov": "raskolnikov"
    },
    {
        ", the protagonist of  Crime and Punishment  by ": null
    },
    {
        "Fyodor Dostoevsky": "fyodor dostoevsky"
    },
    {
        ". Pasternak argues that neither Macbeth or Raskolnikov is a born criminal or a villain by nature. They are turned into criminals by faulty rationalizations, by deductions from false premises. He goes on to argue that Lady Macbeth is feminine  ... one of those active, insistent wives who becomes her husbands executive, more resolute and consistent than he is himself. According to Pasternak, she is only helping Macbeth carry out his own wishes, to her own detriment.          The disastrous consequences of Macbeths ambition are not limited to him. Almost from the moment of the murder, the play depicts Scotland as a land shaken by inversions of the natural order. Shakespeare may have intended a reference to the ": null
    },
    {
        "great chain of being": "great chain of being"
    },
    {
        ", although the plays images of disorder are mostly not specific enough to support detailed intellectual readings. He may also have intended an elaborate compliment to Jamess belief in the ": null
    },
    {
        "divine right of kings": "divine right of kings"
    },
    {
        ", although this hypothesis, outlined at greatest length by Henry N. Paul, is not universally accepted. As in  Julius Caesar , though, perturbations in the political sphere are echoed and even amplified by events in the material world. Among the most often depicted of the inversions of the natural order is sleep. Macbeths announcement that he has murdered sleep is figuratively mirrored in Lady Macbeths sleepwalking.     Macbeths generally accepted indebtedness to medieval tragedy is often seen as significant in the plays treatment of moral order. Glynne Wickham connects the play, through the Porter, to a mystery play on the harrowing of hell . Howard Felperin argues that the play has a more complex attitude toward orthodox Christian tragedy than is often admitted; he sees a kinship between the play and the tyrant plays within the medieval liturgical drama.     The theme of androgyny is often seen as a special aspect of the theme of disorder. Inversion of normative gender roles is most famously associated with the witches and with Lady Macbeth as she appears in the first act. Whatever Shakespeares degree of sympathy with such inversions, the play ends with a thorough return to normative gender values. Some feminist psychoanalytic critics, such as Janet Adelman, have connected the plays treatment of gender roles to its larger theme of inverted natural order. In this light, Macbeth is punished for his violation of the moral order by being removed from the cycles of nature ; nature itself is part of the restoration of moral order.       Critics in the early twentieth century reacted against what they saw as an excessive dependence on the study of character in criticism of the play. This dependence, though most closely associated with Andrew Cecil Bradley , is clear as early as the time of Mary Cowden Clarke , who offered precise, if fanciful, accounts of the predramatic lives of Shakespeares female leads. She suggested, for instance, that the child Lady Macbeth refers to in the first act died during a foolish military action.       thu     In the play, the Three Witches represent darkness, chaos, and conflict, while their role is as agents and witnesses. Their presence communicates treason and impending doom. During Shakespeares day, witches were seen as worse than rebels, the most notorious traytor and rebell that can be. They were not only political traitors, but spiritual traitors as well. Much of the confusion that springs from them comes from their ability to straddle the plays borders between reality and the supernatural. They are so deeply entrenched in both worlds that it is unclear whether they control fate, or whether they are merely its agents. They defy logic, not being subject to the rules of the real world. The witches lines in the first act: Fair is foul, and foul is fair: Hover through the fog and filthy air are often said to set the tone for the rest of the play by establishing a sense of confusion. Indeed, the play is filled with situations where evil is depicted as good, while good is rendered evil. The line Double, double toil and trouble, communicates the witches intent clearly: they seek only trouble for the mortals around them. The witches spells are remarkably similar to the spells of the witch Medusa in Anthony Mundays play ": null
    },
    {
        "Fidele and Fortunio": "fidele and fortunio"
    },
    {
        " published in 1584, and Shakespeare may have been influenced by these.     While the witches do not tell Macbeth directly to kill King Duncan, they use a subtle form of temptation when they tell Macbeth that he is destined to be king. By placing this thought in his mind, they effectively guide him on the path to his own destruction. This follows the pattern of temptation used at the time of Shakespeare. First, they argued, a thought is put in a mans mind, then the person may either indulge in the thought or reject it. Macbeth indulges in it, while Banquo rejects.     According to J. A. Bryant Jr., Macbeth also makes use of Biblical parallels, notably between King Duncans murder and the murder of Christ :               While many today would say that any misfortune surrounding a production is mere coincidence, actors and others in the theatre industry often consider it bad luck to mention Macbeth by name while inside a theatre, and sometimes refer to it indirectly, for example as The Scottish Play , or MacBee , or when referring to the character and not the play, Mr. and Mrs. M , or The Scottish King .     This is because Shakespeare are said to have used the spells of real witches in his text, purportedly angering the witches and causing them to curse the play. Thus, to say the name of the play inside a theatre is believed to doom the production to failure, and perhaps cause physical injury or death to cast members. There are stories of accidents, misfortunes and even deaths taking place during runs of Macbeth.     According to the actor Sir Donald Sinden , in his Sky Arts TV series ": null
    },
    {
        "Great West End Theatres": "great west end theatres"
    },
    {
        ", contrary to popular myth, Shakespeares tragedy Macbeth is not the unluckiest play as superstition likes to portray it. Exactly the opposite! The origin of the unfortunate moniker dates back to repertory theatre days when each town and village had at least one theatre to entertain the public. If a play was not doing well, it would invariably get pulled and replaced with a sure-fire audience pleaser  – Macbeth guaranteed full-houses. So when the weekly theatre newspaper, ": null
    },
    {
        "The Stage": "the stage"
    },
    {
        " was published, listing what was on in each theatre in the country, it was instantly noticed what shows had not worked the previous week, as they had been replaced by a definite crowd-pleaser. More actors have died during performances of Hamlet than in the Scottish play as the profession still calls it. It is forbidden to quote from it backstage as this could cause the current play to collapse and have to be replaced, causing possible unemployment. Great West End Theatres Sky Arts. 10 August 2013     Several methods exist to dispel the curse, depending on the actor. One, attributed to Michael York , is to immediately leave the building the stage is in with the person who uttered the name, walk around it three times, spit over their left shoulders, say an obscenity then wait to be invited back into the building. A related practice is to spin around three times as fast as possible on the spot, sometimes accompanied by spitting over their shoulder, and uttering an obscenity. Another popular ritual is to leave the room, knock three times, be invited in, and then quote a line from Hamlet. Yet another is to recite lines from ": null
    },
    {
        "The Merchant of Venice": "the merchant of venice"
    },
    {
        ", thought to be a lucky play.           The only eyewitness account of Macbeth in Shakespeares lifetime was recorded by Simon Forman , who saw a performance at the Globe on 20 April 1610. Scholars have noted discrepancies between Formans account and the play as it appears in the Folio. For example, he makes no mention of the apparition scene, or of Hecate, of the man not of woman born, or of Birnam Wood. However, Clark observes that Formans accounts were often inaccurate and incomplete  and his interest did not seem to be in giving full accounts of the productions.     As mentioned above, the Folio text is thought by some to be an alteration of the original play. This has led to the theory that the play as we know it from the Folio was an adaptation for indoor performance at the Blackfriars Theatre  – and even speculation that it represents a specific performance before King James. The play contains more musical cues than any other play in the canon as well as a significant use of sound effect s.             All theatres were closed down by the Puritan government on 6 September 1642. Upon the restoration of the monarchy in 1660, two patent companies were established, and the existing theatrical repertoire divided between them. Sir William Davenant , founder of the Dukes Company, adapted Shakespeares play to the tastes of the new era, and his version would dominate on stage for around eighty years. Among the changes he made were the expansion of the role of the witches, introducing new songs, dances and flying, and the expansion of the role of Lady Macduff as a foil to Lady Macbeth. There were, however, performances outside the patent companies: among the evasions of the Dukes Companys monopoly was a puppet version of Macbeth.     Macbeth was a favourite of the seventeenth-century diarist Samuel Pepys , who saw the play on 5 November 1664 , 28 December 1666 , ten days later on 7 January 1667 , on 19 April 1667 , again on 16 October 1667 , and again three weeks later on 6 November 1667 , yet again on 12 August 1668 , and finally on 21 December 1668, on which date the king and court were also present in the audience.     The first professional performances of Macbeth in North America were probably those of The Hallam Company .     In 1744, David Garrick revived the play, abandoning Davenants version and instead advertising it as written by Shakespeare . In fact this claim was largely false: he retained much of Davenants more popular business for the witches, and himself wrote a lengthy death speech for Macbeth. And he cut more than 10% of Shakespeares play, including the drunken porter, the murder of Lady Macduffs son, and Malcolms testing of Macduff. Hannah Pritchard was his greatest stage partner, having her premiere as his Lady Macbeth in 1747. He would later drop the play from his repertoire upon her retirement from the stage. Mrs. Pritchard was the first actress to achieve acclaim in the role of Lady Macbeth  – at least partly due to the removal of Davenants material, which made irrelevant moral contrasts with Lady Macduff. Garricks portrayal focused on the inner life of the character, endowing him with an innocence vacillating between good and evil, and betrayed by outside influences. He portrayed a man capable of observing himself, as if a part of him remained untouched by what he had done, the play moulding him into a man of sensibility, rather than him descending into a tyrant.     John Philip Kemble first played Macbeth in 1778. Although usually regarded as the antithesis of Garrick, Kemble nevertheless refined aspects of Garricks portrayal into his own. However it was the towering and majestic Sarah Siddons who became a legend in the role of Lady Macbeth. In contrast to Hannah Pritchards savage, demonic portrayal, Siddons Lady Macbeth, while terrifying, was nevertheless  – in the scenes in which she expresses her regret and remorse  – tenderly human. And in portraying her actions as done out of love for her husband, Siddons deflected from him some of the moral responsibility for the plays carnage. Audiences seem to have found the sleepwalking scene particularly mesmerising: Hazlitt said of it that all her gestures were involuntary and mechanical ... She glided on and off the stage almost like an apparition.     In 1794, Kemble dispensed with the ghost of Banquo altogether, allowing the audience to see Macbeths reaction as his wife and guests see it, and relying upon the fact that the play was so well known that his audience would already be aware that a ghost enters at that point.     Ferdinand Fleck , notable as the first German actor to present Shakespeares tragic roles in their fullness, played Macbeth at the Berlin National Theatre from 1787. Unlike his English counterparts, he portrayed the character as achieving his stature after the murder of Duncan, growing in presence and confidence: thereby enabling stark contrasts, such as in the banquet scene, which he ended babbling like a child.             Performances outside the patent theatres were instrumental in bringing the monopoly to an end. Robert Elliston , for example, produced a popular adaptation of Macbeth in 1809 at the Royal Circus described in its publicity as this matchless piece of pantomimic and choral performance , which circumvented the illegality of speaking Shakespeares words through mimed action, singing, and doggerel verse written by J. C. Cross.     thu and Charles Kean as the Macbeths, in historically accurate costumes     thu playing Macbeth, from a mid-19th century performance     In 1809, in an unsuccessful attempt to take Covent Garden upmarket, Kemble installed private boxes, increasing admission prices to pay for the improvements. The inaugural run at the newly renovated theatre was Macbeth, which was disrupted for over two months with cries of Old prices! and No private boxes! until Kemble capitulated to the protestors demands.     Edmund Kean at Drury Lane gave a psychological portrayal of the central character, with a common touch, but was ultimately unsuccessful in the role. However he did pave the way for the most acclaimed performance of the nineteenth century, that of William Charles Macready . Macready played the role over a 30-year period, firstly at Covent Garden in 1820 and finally in his retirement performance. Although his playing evolved over the years, it was noted throughout for the tension between the idealistic aspects and the weaker, venal aspects of Macbeths character. His staging was full of spectacle, including several elaborate royal processions.     In 1843 the Theatres Regulation Act finally brought the patent companies monopoly to an end. From that time until the end of the Victorian era , London theatre was dominated by the actor-manager s, and the style of presentation was pictorial  – proscenium stages filled with spectacular stage-pictures, often featuring complex scenery, large casts in elaborate costumes, and frequent use of tableaux vivant . Charles Kean , at Londons Princesss Theatre from 1850 to 1859, took an antiquarian view of Shakespeare performance, setting his Macbeth in a historically accurate eleventh-century Scotland. His leading lady, Ellen Tree , created a sense of the characters inner life: ": null
    },
    {
        "The Times": "the times"
    },
    {
        " critic saying The countenance which she assumed ... when luring on Macbeth in his course of crime, was actually appalling in intensity, as if it denoted a hunger after guilt. At the same time, special effects were becoming popular: for example in Samuel Phelps Macbeth the witches performed behind green gauze , enabling them to appear and disappear using stage lighting.     In 1849, rival performances of the play sparked the Astor Place riot in Manhattan . The popular American actor Edwin Forrest , whose Macbeth was said to be like the ferocious chief of a barbarous tribe played the central role at the Broadway Theatre to popular acclaim, while the cerebral and patrician English actor Macready , playing the same role at the Astor Place Opera House , suffered constant heckling. The existing enmity between the two men  was taken up by Forrests supporters  – formed from the working class and lower middle class and anti-British agitators, keen to attack the upper-class pro-British patrons of the Opera House and the colonially-minded Macready. Nevertheless, Macready performed the role again three days later to a packed house while an angry mob gathered outside. The militia tasked with controlling the situation fired into the mob. In total, 31 rioters were killed and over 100 injured.     Charlotte Cushman is unique among nineteenth century interpreters of Shakespeare in achieving stardom in roles of both genders. Her New York debut was as Lady Macbeth in 1836, and she would later be admired in London in the same role in the mid-1840s. Helen Faucit was considered the embodiment of early-Victorian notions of femininity. But for this reason she largely failed when she eventually played Lady Macbeth in 1864: her serious attempt to embody the coarser aspects of Lady Macbeths character jarred harshly with her public image. Adelaide Ristori , the great Italian actress, brought her Lady Macbeth to London in 1863 in Italian, and again in 1873 in an English translation cut in such a way as to be, in effect, Lady Macbeths tragedy.     thu as Lady Macbeth, an 1888 production     Henry Irving was the most successful of the late-Victorian actor-manager s, but his Macbeth failed to curry favour with audiences. His desire for psychological credibility reduced certain aspects of the role: He described Macbeth as a brave soldier but a moral coward, and played him untroubled by conscience  – clearly already contemplating the murder of Duncan before his encounter with the witches. Irvings leading lady was Ellen Terry , but her Lady Macbeth was unsuccessful with the public, for whom a century of performances influenced by Sarah Siddons had created expectations at odds with Terrys conception of the role.     Late nineteenth-century European Macbeths aimed for heroic stature, but at the expense of subtlety: Tommaso Salvini in Italy and Adalbert Matkowsky in Germany were said to inspire awe, but elicited little pity.           Two developments changed the nature of Macbeth performance in the 20th century: first, developments in the craft of acting itself, especially the ideas of Stanislavski and Brecht ; and second, the rise of the dictator as a political icon. The latter has not always assisted the performance: it is difficult to sympathise with a Macbeth based on Hitler, Stalin, or Idi Amin.     Barry Jackson , at the Birmingham Repertory Theatre in 1923, was the first of the 20th-century directors to costume Macbeth in modern dress .     thu and Edna Thomas in the Federal Theatre Project production that came to be known as the Voodoo Macbeth     In 1936, a decade before his film adaptation of the play, Orson Welles directed Macbeth for the Negro Theatre Unit of the Federal Theatre Project at the Lafayette Theatre in Harlem, using black actors and setting the action in Haiti: with drums and Voodoo rituals to establish the Witches scenes. The production, dubbed The ": null
    },
    {
        "Voodoo Macbeth": "voodoo macbeth"
    },
    {
        ", proved inflammatory in the aftermath of the Harlem riots , accused of making fun of black culture and as a campaign to burlesque negroes until Welles persuaded crowds that his use of black actors and voodoo made important cultural statements.     thu   A performance which is frequently referenced as an example of the plays curse was the outdoor production directed by Burgess Meredith in 1953 in the British colony of Bermuda , starring Charlton Heston . Using the imposing spectacle of Fort St. Catherine as a key element of the set, the production was plagued by a host of mishaps, including Charlton Heston being burned when his tights caught fire.     The critical consensus is that there have been three great Macbeths on the English-speaking stage in the 20th century, all of them commencing at Stratford-upon-Avon : Laurence Olivier in 1955, Ian McKellen in 1976 and Antony Sher in 1999. Oliviers portrayal was immediately hailed as a masterpiece. Kenneth Tynan expressed the view that it succeeded because Olivier built the role to a climax at the end of the play, whereas most actors spend all they have in the first two acts.     The play caused grave difficulties for the Royal Shakespeare Company , especially at the Shakespeare Memorial Theatre . Peter Hall s 1967 production was an acknowledged disaster with the use of real leaves from Birnham Wood getting unsolicited first-night laughs, and Trevor Nunn s 1974 production was an over-elaborate religious spectacle .     But Nunn achieved success for the RSC in his 1976 production at the intimate Other Place , with Ian McKellen and Judi Dench in the central roles. A small cast worked within a simple circle, and McKellens Macbeth had nothing noble or likeable about him, being a manipulator in a world of manipulative characters. They were a young couple, physically passionate, not monsters but recognisable human beings , but their relationship atrophied as the action progressed.     The RSC again achieved critical success in Gregory Doran s 1999 production at The Swan , with Antony Sher and Harriet Walter in the central roles, once again demonstrating the suitability of the play for smaller venues. Dorans witches spoke their lines to a theatre in absolute darkness, and the opening visual image was the entrance of Macbeth and Banquo in the berets and fatigues of modern warfare, carried on the shoulders of triumphant troops. In contrast to Nunn, Doran presented a world in which king Duncan and his soldiers were ultimately benign and honest, heightening the deviance of Macbeth and Lady Macbeth in plotting to kill the king. The play said little about politics, instead powerfully presenting its central characters psychological collapse.     Macbeth returned to the RSC in 2018, when Christopher Eccleston played the title role, with Niamh Cusack as his wife, Lady Macbeth. The play later transferred to the Barbican in London.     In Soviet-controlled Prague in 1977, faced with the illegality of working in theatres, Pavel Kohout adapted Macbeth into a 75-minute abridgement for five actors, suitable for bringing a show in a suitcase to peoples homes .     Spectacle was unfashionable in Western theatre throughout the 20th century. In East Asia, however, spectacular productions have achieved great success, including Yukio Ninagawa s 1980 production with Masane Tsukayama as Macbeth, set in the 16th century Japanese Civil War . The same directors tour of London in 1987 was widely praised by critics, even though they were unable to understand the significance of Macbeths gestures, the huge Buddhist altar dominating the set, or the petals falling from the cherry trees.     Xu Xiaozhong s 1980 Central Academy of Drama production in Beijing made every effort to be unpolitical : yet audiences still perceived correspondences between the central character and Mao Zedong . Shakespeare has often been adapted to indigenous theatre traditions, for example the ": null
    },
    {
        "Kunju": "kunqu"
    },
    {
        " Macbeth of Huang Zuolin performed at the inaugural Chinese Shakespeare Festival of 1986. Similarly, B. V. Karanth s Barnam Vana of 1979 had adapted Macbeth to the Yakshagana tradition of Karnataka , India. In 1997, Lokendra Arambam created Stage of Blood, merging a range of martial arts, dance and gymnastic styles from Manipur , performed in Imphal and in England. The stage was literally a raft on a lake.     ": null
    },
    {
        "Throne of Blood": "throne of blood"
    },
    {
        "  is a 1957 Japanese samurai film co-written and directed by Akira Kurosawa . The film transposes Macbeth from Medieval Scotland to feudal Japan, with stylistic elements drawn from Noh drama. Kurosawa was a fan of the play and planned his own adaptation for several years, postponing it after learning of Orson Welles Macbeth . The film won two Mainichi Film Awards.     The play has been translated and performed in various languages in different parts of the world, and Media Artists was the first to stage its Punjabi adaptation in India . The adaptation by Balram and the play directed by Samuel John have been universally acknowledged as a milestone in Punjabi theatre. The unique attempt involved trained theatre experts and the actors taken from a rural background in Punjab . Punjabi folk music imbued the play with the native ethos as the Scottish setting of Shakespeares play was transposed into a Punjabi milieu.     In September, 2018, Macbeth": null
    }
]