[
    {
        "     The Macedonian phalanx is an ": null
    },
    {
        "infantry": "Infantry"
    },
    {
        " formation": "Formation"
    },
    {
        " developed by ": null
    },
    {
        "Philip II": "Philip Ii Of Macedon"
    },
    {
        " and used by his son ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        " to conquer the ": null
    },
    {
        "Achaemenid Empire": "Achaemenid Empire"
    },
    {
        " and other armies. ": null
    },
    {
        "Phalanx": "Phalanx"
    },
    {
        "es remained dominant on battlefields throughout the Ancient Macedonian Period, although wars had developed into more protracted operations generally involving ": null
    },
    {
        "sieges": "Siege"
    },
    {
        "and ": null
    },
    {
        "naval combat": "Naval Combat"
    },
    {
        " as much as ": null
    },
    {
        "pitched battle": "Pitched Battle"
    },
    {
        "s, until they were ultimately displaced by the ": null
    },
    {
        "Roman": "Ancient Rome"
    },
    {
        " legions": "Roman Legion"
    },
    {
        ".            Philip II spent much of his youth as a hostage at ": null
    },
    {
        "Thebes": "Thebes, Greece"
    },
    {
        ", where he studied under the renowned general ": null
    },
    {
        "Epaminondas": "Epaminondas"
    },
    {
        ", whose reforms were the basis for the phalanx. Phalangites were professional soldiers, and were among the first troops ever to be drilled, thereby allowing them to execute complex maneuvers well beyond the reach of most other armies. They fought packed in a close rectangular formation, usually eight men deep, with a leader at the head of each column and a secondary leader in the middle, so that the back rows could move off to the sides if more frontage was needed.       Each phalangite carried as his primary weapon a ": null
    },
    {
        "sarissa": "Sarissa"
    },
    {
        ", a double-pointed ": null
    },
    {
        "pike": "Pike"
    },
    {
        " over 6  m in length. Before a battle the sarissa were carried in two pieces and then slid together when they were being used. At close range such large weapons were of little use, but an intact phalanx could easily keep its enemies at a distance; the weapons of the first five rows of men all projected beyond the front of the formation, so that there were more spearpoints than available targets at any given time. Men in rows behind the initial five angled their spears at a 45 degree angle in an attempt to ward off arrows or other projectiles.  The secondary weapon was a shortsword called a ": null
    },
    {
        "kopis": "Kopis"
    },
    {
        ", which had a heavy curved section at the end.       The phalanx consisted of a line-up of several ": null
    },
    {
        "battalion": "Battalion"
    },
    {
        " blocks called syntagmata, each of its 16 files  numbering 16 men, for a total of 256 in each unit. Each syntagma was commanded by a syntagmatarch, who - together with his subordinate officers - would form the first row of each block. Connolly, Peter: The Greek Armies, pp. 58-59: The Macedonian Phalanx . MacDonald & Co. Ltd, London, 1982. .     Neither Philip nor Alexander actually used the phalanx as their arm of choice, but instead used it to hold the enemy in place while their heavy ": null
    },
    {
        "cavalry": "Cavalry"
    },
    {
        " broke through their ranks. The ": null
    },
    {
        "Macedon": "Macedon"
    },
    {
        "ian cavalry fought in ": null
    },
    {
        "wedge formation": "Wedge Formation"
    },
    {
        " and was almost always stationed on the far right; after these broke through the enemy lines they were followed by the ": null
    },
    {
        "hypaspists": "Hypaspists"
    },
    {
        ", elite infantrymen who served as the ": null
    },
    {
        "kings": "King"
    },
    {
        "bodyguard, and then the phalanx proper. The left flank was generally covered by allied cavalry supplied by the ": null
    },
    {
        "Thessalians": "Thessaly"
    },
    {
        ", which fought in ": null
    },
    {
        "rhomboid": "Rhomboid"
    },
    {
        " formation and served mainly in a defensive role. Other forces—": null
    },
    {
        "skirmisher": "Skirmisher"
    },
    {
        "s, range troops, reserves of allied ": null
    },
    {
        "hoplite": "Hoplite"
    },
    {
        "s, ": null
    },
    {
        "archers": "Archers"
    },
    {
        ", and ": null
    },
    {
        "artillery": "Artillery"
    }
]