[
    {
        "        A machine gun is a ": null
    },
    {
        "fully automatic": "automatic firearm"
    },
    {
        " mounted or ": null
    },
    {
        "portable firearm": "small arms"
    },
    {
        " designed to fire ": null
    },
    {
        "rifle cartridges": "rifle cartridge"
    },
    {
        "in rapid succession from an ": null
    },
    {
        "ammunition belt": "belt"
    },
    {
        " or ": null
    },
    {
        "magazine": "magazine"
    },
    {
        ". Not all fully automatic firearms are machine guns. ": null
    },
    {
        "Submachine gun": "submachine gun"
    },
    {
        "s, ": null
    },
    {
        "rifles": "automatic rifle"
    },
    {
        ", ": null
    },
    {
        "assault rifle": "assault rifle"
    },
    {
        "s, ": null
    },
    {
        "battle rifle": "battle rifle"
    },
    {
        "s, ": null
    },
    {
        "shotguns": "automatic shotgun"
    },
    {
        ", ": null
    },
    {
        "pistols": "machine pistol"
    },
    {
        " or ": null
    },
    {
        "cannons": "autocannon"
    },
    {
        " may be capable of fully automatic fire, but are not designed for sustained fire. As a class of military rapid-fire guns, machine guns are fully automatic weapons designed to be used as support weapons and generally used when attached to a ": null
    },
    {
        "mount": "weapon mount"
    },
    {
        " or fired from the ground on a ": null
    },
    {
        "bipod": "bipod"
    },
    {
        " or ": null
    },
    {
        "tripod": "tripod"
    },
    {
        ". Many machine guns also use ": null
    },
    {
        "belt feeding": "belt"
    },
    {
        " and ": null
    },
    {
        "open bolt": "open bolt"
    },
    {
        " operation, features not normally found on rifles.                 Unlike ": null
    },
    {
        "semi-automatic firearm": "semi-automatic firearm"
    },
    {
        "s, which require one trigger pull per round fired, a machine gun is designed to fire for as long as the trigger is held down. Nowadays the term is restricted to relatively heavy weapons, able to provide continuous or frequent bursts of automatic fire for as long as ammunition lasts. Machine guns are normally used against personnel, aircraft and light vehicles, or to provide ": null
    },
    {
        "suppressive fire": "suppressive fire"
    },
    {
        ", either directly or indirectly. They are commonly mounted on fast attack vehicles such as ": null
    },
    {
        "technicals": "technical"
    },
    {
        " to provide heavy mobile firepower, armored vehicles such as ": null
    },
    {
        "tanks": "tank"
    },
    {
        "for engaging targets too small to justify use of the primary weaponry or too fast to effectively engage with it, and on aircraft as defensive armament or for strafing ground targets, though on fighter aircraft true machine guns have mostly been supplanted by large-caliber rotary guns.     Some machine guns have in practice sustained fire almost continuously for hours; other automatic weapons overheat after less than a minute of use. Because they become very hot, practically all machine guns fire from an ": null
    },
    {
        "open bolt": "open bolt"
    },
    {
        ", to permit air cooling from the ": null
    },
    {
        "breech": "breech-loading weapon"
    },
    {
        " between bursts. They also usually have either a barrel cooling system, slow-heating heavyweight barrel, or removable barrels which allow a hot barrel to be replaced.     Although subdivided into ": null
    },
    {
        "light": "light machine gun"
    },
    {
        " , ": null
    },
    {
        "medium": "medium machine gun"
    },
    {
        " , ": null
    },
    {
        "heavy": "heavy machine gun"
    },
    {
        " or ": null
    },
    {
        "general-purpose": "general-purpose machine gun"
    },
    {
        " , even the lightest machine guns tend to be substantially larger and heavier than standard infantry arms. Medium and heavy machine guns are either mounted on a ": null
    },
    {
        "tripod": "tripod"
    },
    {
        " or on a vehicle; when carried on foot, the machine gun and associated equipment require additional crew members.     Light machine guns are designed to provide mobile fire support to a squad and are typically air-cooled weapons fitted with a box magazine or drum and a bipod; they may use full-size rifle rounds, but modern examples often use intermediate rounds. Medium machine guns use full-sized rifle rounds and are designed to be used from fixed positions mounted on a tripod. Heavy machine gun is a term originating in World War I to describe heavyweight medium machine guns and persisted into World War II with Japanese ": null
    },
    {
        "Hotchkiss M1914": "hotchkiss m1914 machine gun"
    },
    {
        " clones; today, however, it is used to refer to automatic weapons with a caliber of at least .50 in  but less than 20  mm. A general-purpose machine gun is usually a lightweight medium machine gun that can either be used with a bipod and drum in the light machine gun role or a tripod and belt feed in the medium machine gun role.          Machine guns usually have simple iron sights, though the use of optics is becoming more common. A common aiming system for direct fire is to alternate solid rounds and ": null
    },
    {
        "tracer ammunition": "tracer ammunition"
    },
    {
        " rounds , so shooters can see the trajectory and walk the fire into the target, and direct the fire of other ": null
    },
    {
        "soldier": "soldier"
    },
    {
        "s.     Many ": null
    },
    {
        "heavy machine gun": "heavy machine gun"
    },
    {
        "s, such as the ": null
    },
    {
        "Browning M2": "m2 browning machine gun"
    },
    {
        " .50 caliber machine gun, are accurate enough to engage targets at great distances. During the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", ": null
    },
    {
        "Carlos Hathcock": "carlos hathcock"
    },
    {
        " set the ": null
    },
    {
        "record for a long-distance shot": "longest recorded sniper kills"
    },
    {
        " at  with a .50 caliber heavy machine gun he had equipped with a ": null
    },
    {
        "telescopic sight": "telescopic sight"
    },
    {
        ". Henderson, Charles . Marine Sniper. Berkley Caliber. . This led to the introduction of .50 caliber ": null
    },
    {
        "anti-materiel sniper rifles": "anti-materiel rifle"
    },
    {
        ", such as the ": null
    },
    {
        "Barrett M82": "m82 barrett rifle"
    },
    {
        ".     Other automatic weapons are subdivided into several categories based on the size of the bullet used, whether the ": null
    },
    {
        "cartridge": "cartridge"
    },
    {
        " is fired from a ": null
    },
    {
        "closed bolt": "closed bolt"
    },
    {
        " or an ": null
    },
    {
        "open bolt": "open bolt"
    },
    {
        ", and whether the ": null
    },
    {
        "action": "action"
    },
    {
        " used is locked or is some form of ": null
    },
    {
        "blowback": "blowback"
    },
    {
        ".     Fully automatic firearms using pistol-calibre ammunition are called ": null
    },
    {
        "machine pistols": "machine pistol"
    },
    {
        "or submachine guns largely on the basis of size; those using shotgun cartridges are almost always referred to as ": null
    },
    {
        "automatic shotgun": "automatic shotgun"
    },
    {
        "s. The term ": null
    },
    {
        "personal defense weapon": "personal defense weapon"
    },
    {
        " is sometimes applied to weapons firing dedicated armor-piercing rounds which would otherwise be regarded as machine pistols or SMGs, but it is not particularly strongly defined and has historically been used to describe a range of weapons from ordinary SMGs to compact assault rifles. ": null
    },
    {
        "Selective fire": "selective fire"
    },
    {
        " rifles firing a full-power rifle cartridge from a closed bolt are called ": null
    },
    {
        "automatic rifles": "automatic rifle"
    },
    {
        "or ": null
    },
    {
        "battle rifle": "battle rifle"
    },
    {
        "s, while rifles that fire an intermediate cartridge are called ": null
    },
    {
        "assault rifle": "assault rifle"
    },
    {
        "s.     ": null
    },
    {
        "Assault rifles": "assault rifle"
    },
    {
        "are a compromise between the size and weight of a pistol-calibre submachine gun and a full-size battle rifle, firing intermediate cartridges and allowing semi-automatic and burst or full-automatic fire options , sometimes with both of the latter present.               Many machine guns are of the ": null
    },
    {
        "locked breech": "locked breech"
    },
    {
        " type, and follow this cycle:     Pulling the bolt assembly/bolt carrier rearward by way of the cocking lever to the point bolt carrier engages a sear and stays at rear position until trigger is activated making bolt carrier move forward   Loading fresh round into chamber and locking bolt   Firing round by way of a firing pin or striker hitting the primer that ignites the powder when bolt reaches locked position.   Unlocking and removing the spent case from the chamber and ejecting it out of the weapon as bolt is moving rearward   Loading the next round into the firing chamber. Usually, the recoil ": null
    },
    {
        "spring": "spring"
    },
    {
        " tension pushes bolt back into battery and a ": null
    },
    {
        "cam": "cam"
    },
    {
        " strips the new round from a feeding device, belt or box.   Cycle is repeated as long as the trigger is activated by operator. Releasing the trigger resets the trigger mechanism by engaging a sear so the weapon stops firing with bolt carrier fully at the rear.     The operation is basically the same for all locked breech automatic firearms, regardless of the means of activating these mechanisms. There are also multi-chambered formats, such as ": null
    },
    {
        "revolver cannon": "revolver cannon"
    },
    {
        ", and some automatic weapons, including many ": null
    },
    {
        "submachine guns": "submachine guns"
    },
    {
        ", the ": null
    },
    {
        "Schwarzlose machine gun": "schwarzlose machine gun"
    },
    {
        " etc., that do not lock at all but instead use simple ": null
    },
    {
        "blowback": "blowback"
    },
    {
        " or some type of delayed ": null
    },
    {
        "blowback": "blowback"
    },
    {
        ".         Most modern machine guns are of the locking type, and of these, most utilize the principle of ": null
    },
    {
        "gas-operated reloading": "gas-operated reloading"
    },
    {
        ", which taps off some of the propellant gas from the fired cartridge, using its mechanical pressure to unlock the bolt and cycle the action. The Russian ": null
    },
    {
        "PK machine gun": "pk machine gun"
    },
    {
        " is an example. Another efficient and widely used format is the ": null
    },
    {
        "recoil actuated": "recoil operation"
    },
    {
        " type, which uses the guns recoil energy for the same purpose. Machine guns such as the ": null
    },
    {
        "M2 Browning": "m2 browning machine gun"
    },
    {
        " and ": null
    },
    {
        "MG42": "mg42"
    },
    {
        ", are of this second kind. A cam, lever or actuator absorbs part of the energy of the recoil to operate the gun mechanism.     An externally actuated weapon uses an external power source, such as an electric motor or hand crank, to move its mechanism through the firing sequence. Modern weapons of this type are often referred to as ": null
    },
    {
        "Gatling gun": "gatling gun"
    },
    {
        "s, after the original inventor . They have several barrels each with an associated chamber and action on a rotating carousel and a system of cams that load, cock, and fire each mechanism progressively as it rotates through the sequence; essentially each barrel is a separate bolt-action rifle using a common feed source. The continuous nature of the rotary action, and its relative immunity to overheating allow for an incredibly high cyclic rate of fire, often several thousand rounds per minute. Rotary guns are less prone to jamming than a gun operated by gas or recoil, as the external power source will eject misfired rounds with no further trouble, but this is not possible in the rare cases of self-powered rotary guns. Rotary designs are intrinsically comparatively bulky and expensive, and are therefore generally used with large rounds, 20  mm in diameter or more, often referred to as ": null
    },
    {
        "Rotary cannon": "rotary cannon"
    },
    {
        " – though the rifle-calibre ": null
    },
    {
        "Minigun": "minigun"
    },
    {
        " is an exception to this. Whereas such weapons are highly reliable and formidably effective, one drawback is that the weight and size of the power source and driving mechanism makes them usually impractical for use outside of a vehicle or aircraft mount.     ": null
    },
    {
        "Revolver cannon": "revolver cannon"
    },
    {
        "s, such as the ": null
    },
    {
        "Mauser MK 213": "mauser mk 213"
    },
    {
        ", were developed in World War II by the Germans to provide high-caliber cannons with a reasonable rate of fire and reliability. In contrast to the rotary format, such weapons have a single barrel, and a recoil-operated carriage holding a revolving chamber with typically five chambers. As each round is fired, electrically, the carriage moves back rotating the chamber which also ejects the spent case, indexes the next live round to be fired with the barrel and loads the next round into the chamber. The action is very similar to that of the revolver pistols common in the 19th and 20th centuries, giving this type of weapon its name. A ": null
    },
    {
        "Chain gun": "chain gun"
    },
    {
        " is a specific, patented type of Revolver cannon, the name, in this case, deriving from its driving mechanism.     Firing a machine gun for prolonged periods produces large amounts of heat. In a worst-case scenario this may cause a cartridge to overheat and detonate even when the trigger is not pulled, potentially leading to damage or causing the gun to cycle its action and keep firing until it has exhausted its ammunition supply or jammed . To prevent this, some kind of cooling system is required. Early machine guns were often ": null
    },
    {
        "water-cooled": "water cooling"
    },
    {
        "; while very effective, the water also added considerable weight to an already bulky design. Air-cooled machine guns often feature quick-change barrels , passive cooling fins, or in some designs forced-air cooling, such as that employed by the ": null
    },
    {
        "Lewis Gun": "lewis gun"
    },
    {
        ". Advances in metallurgy and use of special composites in barrel liners allow for greater heat absorption and dissipation during firing. The higher the rate of fire, the more often barrels must be changed and allowed to cool. To minimize this, most air-cooled guns are fired only in short bursts or at a reduced rate of fire. Some designs – such as the many variants of the ": null
    },
    {
        "MG42": "mg42"
    },
    {
        " – are capable of rates of fire in excess of 1,200 rounds per minute. Gatling guns are capable of the fastest firing rates of all, because this design deals with the unwanted heat most efficiently – effectively quick-changing the barrel and chamber after every shot. The multiple guns that comprise a Gatling being a much larger bulk of metal than other, single-barreled guns, they are thus much slower to rise in temperature for a given amount of heat. Simultaneously they are much better at shedding the excess, as the extra barrels not only provide a larger surface area from which to dissipate it, but in the nature of the design are spun at very high speed, which has the benefit of producing enhanced air-cooling as a side-effect.     In weapons where the round seats and fires at the same time, mechanical timing is essential for operator safety, to prevent the round from firing before it is seated properly. Machine guns are controlled by one or more mechanical sears. When a sear is in place, it effectively stops the bolt at some point in its range of motion. Some sears stop the bolt when it is locked to the rear. Other sears stop the firing pin from going forward after the round is locked into the chamber. Almost all machine guns have a safety ": null
    },
    {
        "sear": "sear"
    },
    {
        ", which simply keeps the trigger from engaging.          The first successful machine-gun designs were developed in the mid-19th century. The key characteristic of modern machine guns, their relatively high rate of fire and more importantly mechanical loading,  first appeared in the Model 1862 ": null
    },
    {
        "Gatling gun": "gatling gun"
    },
    {
        ", which was adopted by the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ". These weapons were still powered by hand; however, this changed with ": null
    },
    {
        "Hiram Maxims": "hiram maxim"
    },
    {
        "idea of harnessing recoil energy to power reloading in his ": null
    },
    {
        "Maxim machine gun": "maxim machine gun"
    },
    {
        ". Dr. Gatling also experimented with electric-motor-powered models; as discussed above, this externally powered machine reloading has seen use in modern weapons as well.     While technical use of the term machine gun has varied, the modern definition used by the Sporting Arms and Ammunition Manufacturers Institute of America is a fully automatic firearm that loads, fires and ejects continuously when the trigger is held to the rear until the ammunition is exhausted or pressure on the trigger is released. This definition excludes most early manually operated repeating arms such as volley guns and the Gatling gun.          The first known ancestors of multi-shot weapons were medieval ": null
    },
    {
        "organ gun": "organ gun"
    },
    {
        "s, while the first to have the ability to fire multiple shots from a single barrel without a full manual reload were revolvers made in Europe in the late 1500s. One is a shoulder-gun-length weapon made in Nuremberg, Germany, circa 1580. Another is a revolving ": null
    },
    {
        "arquebus": "arquebus"
    },
    {
        ", produced by Hans Stopler of Nuremberg in 1597.      True repeating long arms were difficult to manufacture prior to the development of the unitary firearm cartridge; nevertheless, lever-action repeating rifles such as the ": null
    },
    {
        "Kalthoff repeater": "kalthoff repeater"
    },
    {
        " and ": null
    },
    {
        "Cookson repeater": "cookson repeater"
    },
    {
        " were made in small quantities in the 17th century.     Perhaps the earliest examples of predecessors to the modern machine gun are to be found in East Asia. According to the Wu-Pei-Chih, a booklet examining Chinese military equipment produced during the first quarter of the 17th century, the Chinese army had in its arsenal the Po-Tzu Lien-Chu-Pao or string-of-100-bullets cannon. This was a repeating cannon fed by a hopper which fired its charges sequentially.  Another repeating gun was produced by a Chinese commoner in the late 17th century. This weapon was also hopper-fed and never went into mass production.           Another early revolving gun was created by ": null
    },
    {
        "James Puckle": "james puckle"
    },
    {
        ", a ": null
    },
    {
        "London": "london"
    },
    {
        " lawyer, who patented what he called The ": null
    },
    {
        "Puckle Gun": "puckle gun"
    },
    {
        " on May 15, 1718. It was a design for a manually operated 1.25 in. caliber, ": null
    },
    {
        "flintlock": "flintlock"
    },
    {
        " cannon with a revolver cylinder able to fire 6–11 rounds before reloading by swapping out the cylinder, intended for use on ": null
    },
    {
        "ship": "ship"
    },
    {
        "s. Original patent claim reproduced in: Francis Bannerman Sons, Bannerman Military Goods Catalogue 28 p. 103 It was one of the earliest weapons to be referred to as a machine gun, being called such in 1722,  though its operation does not match the modern usage of the term. According to Puckle, it was able to fire round bullets at ": null
    },
    {
        "Christians": "christians"
    },
    {
        " and square bullets at ": null
    },
    {
        "Turks": "turkic peoples"
    },
    {
        ". However, it was a commercial failure and was not adopted or produced in any meaningful quantity.     In 1777, ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        " gunsmith": "gunsmith"
    },
    {
        " Joseph Belton offered the ": null
    },
    {
        "Continental Congress": "continental congress"
    },
    {
        " a ": null
    },
    {
        " new improved gun ": "belton flintlock"
    },
    {
        ", which was capable of firing up to twenty shots in five seconds; unlike older repeaters using complex lever-action mechanisms, it used a simpler system of ": null
    },
    {
        "superposed load": "superposed load"
    },
    {
        "s, and was loaded with a single large ": null
    },
    {
        "paper cartridge": "paper cartridge"
    },
    {
        ". Congress requested that Belton modify 100 flintlock muskets to fire eight shots in this manner, but rescinded the order when Beltons price proved too high.       In the early and mid-19th century, a number of rapid-firing weapons appeared which offered multi-shot fire, mostly ": null
    },
    {
        "volley gun": "volley gun"
    },
    {
        "s. Volley guns  and double-barreled pistols relied on duplicating all parts of the gun, though the ": null
    },
    {
        "Nock gun": "nock gun"
    },
    {
        " used the otherwise-undesirable chain fire phenomenon to propagate a spark from a single flintlock mechanism to multiple barrels. Pepperbox pistols also did away with needing multiple hammers but used multiple manually operated barrels. Revolvers further reduced this to only needing a pre-prepared cylinder and linked advancing the cylinder to cocking the hammer. However, these were still manually operated.     In the 1830s a machine gun was designed by a Swiss man called Jacob Steuble, who tried to sell it to the Russian, English and French governments. The English and Russian governments showed interest but the former refused to pay Steuble, who later sued them for this transgression, and the latter tried to imprison him. The French government showed interest at first and while they noted that mechanically there was nothing wrong with Steubles invention they turned him down, stating that the machine both lacked novelty and could not be usefully employed by the army.             In 1847 a short description of a prototype electrically-ignited mechanical machine gun was published in Scientific American by a J.R. Nichols. The model described is small in scale and works by rotating a series of barrels vertically so that it is feeding at the top from a tube or hopper and could be discharged immediately at any elevation after having received a charge, according to the author.      In 1854 a British patent for a mechanically operated machine gun was filed by Henry Clarke. This weapon used multiple barrels arranged side by side, fed by a revolving cylinder that was in turn fed by hoppers, similar to the system used by Nichols. The gun could be fired by percussion or electricity, according to the author. Unlike other mechanically operated machine guns of the era, this weapon didnt use any form of self-contained cartridge, with firing being carried out by separate percussion caps.  In the same year, water cooling was proposed for machine guns by ": null
    },
    {
        "Henry Bessemer": "henry bessemer"
    },
    {
        ", along with a water cleaning system, though he later abandoned this design. In his patent, Bessemer describes a hydropneumatic blowback-operated, fully automatic cannon. Part of the patent also refers to a steam-operated piston to be used with firearms but the bulk of the patent is spent detailing the former system.      In America, a patent for a machine gun type weapon was filed by John Andrus Reynolds in 1855.  Another early American patent for a manually operated machine gun was filed by C. E. Barnes in 1856.      In France and Britain, a mechanically operated machine gun was patented in 1856 by the Frenchman Francois Julien. This weapon was a cannon that fed from a type of open-ended tubular magazine, only using rollers and an endless chain in place of springs.      The ": null
    },
    {
        "Agar Gun": "agar machine gun"
    },
    {
        ", otherwise known as a coffee-mill gun because of its resemblance to a coffee mill, was invented by Wilson Agar at the beginning of the US Civil War. The weapon featured mechanized loading using a hand crank linked to a hopper above the weapon. The weapon featured a single barrel and fired through the turning of the same crank; it operated using paper cartridges fitted with percussion caps and inserted into metal tubes which acted as chambers; it was therefore functionally similar to a revolver. The weapon was demonstrated to President Lincoln in 1861. He was so impressed with the weapon that he purchased 10 on the spot for $1,500 apiece. The Union Army eventually purchased a total of 54 of the weapons. However, due to antiquated views of the Ordnance Department the weapons, like its more famous counterpart the Gatling Gun, saw only limited use.     The ": null
    },
    {
        "Gatling gun": "gatling gun"
    },
    {
        ", patented in 1861 by ": null
    },
    {
        "Richard Jordan Gatling": "richard jordan gatling"
    },
    {
        ", was the first to offer controlled, sequential fire with mechanical loading. The designs key features were machine loading of prepared cartridges and a hand-operated crank for sequential high-speed firing. It first saw very limited action in the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        "; it was subsequently improved and used in the ": null
    },
    {
        "Franco-Prussian war": "franco-prussian war"
    },
    {
        " and ": null
    },
    {
        "North-West Rebellion": "north-west rebellion"
    },
    {
        ". Many were sold to other armies in the late 19th century and continued to be used into the early 20th century, until they were gradually supplanted by Maxim guns. Early multi-barrel guns were approximately the size and weight of contemporary ": null
    },
    {
        "artillery": "artillery"
    },
    {
        " pieces, and were often perceived as a replacement for cannon firing ": null
    },
    {
        "grapeshot": "grapeshot"
    },
    {
        " or ": null
    },
    {
        "canister shot": "canister shot"
    },
    {
        ". Emmott, N.W. The Devils Watering Pot United States Naval Institute Proceedings September 1972 p. 70 The large wheels required to move these guns around required a high firing position, which increased the vulnerability of their crews. Sustained firing of ": null
    },
    {
        "gunpowder": "gunpowder"
    },
    {
        " cartridges generated a cloud of smoke, making concealment impossible until ": null
    },
    {
        "smokeless powder": "smokeless powder"
    },
    {
        " became available in the late 19th century. Emmott, N.W. The Devils Watering Pot United States Naval Institute Proceedings September 1972 p. 72 Gatling guns were targeted by artillery they could not reach, and their crews were targeted by ": null
    },
    {
        "snipers": "sniper"
    },
    {
        "they could not see. The Gatling gun was used most successfully to expand European colonial empires, since against poorly equipped indigenous armies it did not face such threats.     In 1870 a Lt. D. H. Friberg of the Swedish army patented a fully automatic recoil-operated firearm action and may have produced firing prototypes of a derived design around 1882: this was the forerunner to the 1907 ": null
    },
    {
        "Kjellman machine gun": "kjellman machine gun"
    },
    {
        ", though, due to rapid residue buildup from the use of black powder, Fribergs design was not a practical weapon.      Also in 1870, the Bavarian regiment of the Prussian army used a unique mitrailleuse style weapon in the Franco-Prussian war. The weapon was made up of four barrels placed side by side that replaced the manual loading of the French mitrailleuse with a mechanical loading system featuring a hopper containing 41 cartridges at the breech of each barrel. Although it was used effectively at times, mechanical difficulties hindered its operation and it was ultimately abandoned shortly after the war ended .             The first practical self-powered machine gun was invented in 1884 by ": null
    },
    {
        "Sir Hiram Maxim": "sir hiram maxim"
    },
    {
        ". The ": null
    },
    {
        "Maxim machine gun": "maxim machine gun"
    },
    {
        " used the recoil power of the previously fired bullet to reload rather than being hand-powered, enabling a much higher rate of fire than was possible using earlier designs such as the ": null
    },
    {
        "Nordenfelt": "nordenfelt gun"
    },
    {
        " and Gatling weapons. Maxim also introduced the use of water cooling, via a water jacket around the barrel, to reduce overheating. Maxims gun was widely adopted, and derivative designs were used on all sides during the First World War. The design required fewer crew and was lighter and more usable than the Nordenfelt and Gatling guns. First World War combat experience demonstrated the military importance of the machine gun. The United States Army issued four machine guns per regiment in 1912, but that allowance increased to 336 machine guns per regiment by 1919.         Heavy guns based on the Maxim such as the ": null
    },
    {
        "Vickers machine gun": "vickers machine gun"
    },
    {
        " were joined by many other machine weapons, which mostly had their start in the early 20th century such as the ": null
    },
    {
        "Hotchkiss machine gun": "hotchkiss machine gun"
    },
    {
        ". ": null
    },
    {
        "Submachine guns": "submachine gun"
    },
    {
        "  as well as lighter machine guns  saw their first major use in ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", along with heavy use of large-caliber machine guns. The biggest single cause of ": null
    },
    {
        "casualties": "casualty"
    },
    {
        " in World War I was actually artillery, but combined with ": null
    },
    {
        "wire entanglement": "wire entanglement"
    },
    {
        "s, machine guns earned a fearsome reputation.     Another fundamental development occurring before and during the war was the incorporation by gun designers of machine gun auto-loading mechanisms into handguns, giving rise to semi-automatic pistols such as the ": null
    },
    {
        "Borchardt": "borchardt c-93"
    },
    {
        " , automatic ": null
    },
    {
        "machine pistols": "machine pistol"
    },
    {
        "and later submachine guns .     Machine guns were mounted in aircraft for the first time in ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". Immediately this raised a problem. The most effective position for guns in a single-seater fighter was clearly, for the purpose of aiming, directly in front of the pilot; but this placement would obviously result in bullets striking the moving propeller. Early solutions, aside from simply hoping that luck was on the pilots side with an unsynchronized forward-firing gun, involved either aircraft with pusher props like the ": null
    },
    {
        "Vickers F.B.5": "vickers f.b.5"
    },
    {
        ", ": null
    },
    {
        "Royal Aircraft Factory F.E.2": "royal aircraft factory f.e.2"
    },
    {
        " and ": null
    },
    {
        "Airco DH.2": "airco dh.2"
    },
    {
        ", wing mounts like that of the ": null
    },
    {
        "Nieuport 10": "nieuport 10"
    },
    {
        " and ": null
    },
    {
        "Nieuport 11": "nieuport 11"
    },
    {
        " which avoided the propeller entirely, or armored propeller blades such as those mounted on the ": null
    },
    {
        "Morane-Saulnier L": "morane-saulnier l"
    },
    {
        " which would allow the propeller to deflect unsynchronized gunfire. By ": null
    },
    {
        "mid 1915": "fokker e.i"
    },
    {
        ", the introduction of a reliable ": null
    },
    {
        "gun synchronizer": "synchronization gear"
    },
    {
        " by the ": null
    },
    {
        "Imperial German Flying Corps": "luftstreitkräfte"
    },
    {
        " made it possible to fire a closed-bolt machine gun forward through a spinning propeller by timing the firing of the gun to miss the blades. The Allies had no equivalent system until 1916 and their aircraft suffered badly as a result, a period known as the ": null
    },
    {
        "Fokker Scourge": "fokker scourge"
    },
    {
        ", after the ": null
    },
    {
        "Fokker Eindecker": "fokker eindecker"
    },
    {
        ", the first German plane to incorporate the new technology.         As better materials became available following the First World War, light machine guns became more readily portable; designs such as the ": null
    },
    {
        "Bren light machine gun": "bren light machine gun"
    },
    {
        " replaced bulky predecessors like the ": null
    },
    {
        "Lewis gun": "lewis gun"
    },
    {
        " in the squad support weapon role, while the modern division between medium machine guns like the ": null
    },
    {
        "M1919 Browning machine gun": "m1919 browning machine gun"
    },
    {
        " and heavy machine guns like the ": null
    },
    {
        "Browning M2": "browning m2"
    },
    {
        " became clearer. New designs largely abandoned water jacket cooling systems as both undesirable, due to a greater emphasis on mobile tactics and unnecessary, thanks to the alternative and superior technique of preventing overheating by swapping barrels.          The interwar years also produced the first widely used and successful ": null
    },
    {
        "general-purpose machine gun": "general-purpose machine gun"
    },
    {
        ", the German ": null
    },
    {
        "MG 34": "mg 34"
    },
    {
        ". While this machine gun was equally able in the light and medium roles, it proved difficult to manufacture in quantity, and experts on industrial metalworking were called in to redesign the weapon for modern tooling, creating the ": null
    },
    {
        "MG 42": "mg 42"
    },
    {
        ". This weapon was simpler, cheaper to produce, fired faster, and replaced the MG 34 in every application except vehicle mounts, since the MG 42s barrel changing system could not be operated when it was mounted.     Submachine guns evolved during the war, going from complex and finely made weapons like the ": null
    },
    {
        "Thompson submachine gun": "thompson submachine gun"
    },
    {
        " to weapons designed for mass-production and easy replacement like the ": null
    },
    {
        "Sten gun": "sten gun"
    },
    {
        ". On the Eastern Front, entire Soviet divisions were equipped with nothing but the ": null
    },
    {
        "PPSh-41": "ppsh-41"
    },
    {
        " submachine gun. Experience in close-range city combat led to the German military desiring a weapon representing a compromise between the high fire volume of the SMG and the accuracy of a full-size rifle; after a false start with the ": null
    },
    {
        "FG 42": "fg 42"
    },
    {
        ", this led to the development of the ": null
    },
    {
        "MP 44": "mp 44"
    },
    {
        " select-fire assault rifle, the first weapon to be called such.          Experience with the MG42 led to the US issuing a requirement to replace the aging Browning Automatic Rifle with a similar weapon, which would also replace the M1919; simply using the MG42 itself was not possible, as the design brief required a weapon which could be fired from the hip or shoulder like the BAR. The resulting design, the ": null
    },
    {
        "M60 machine gun": "m60 machine gun"
    },
    {
        ", was issued to troops during the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ".     As it became clear that a high-volume-of-fire weapon would be needed for fast-moving jet aircraft to reliably hit their opponents, Gatlings work with electrically powered weapons was recalled and the 20  mm ": null
    },
    {
        "M61 Vulcan": "m61 vulcan"
    },
    {
        " designed; a miniaturized 7.62  mm version initially known as the mini-Vulcan and quickly shortened to ": null
    },
    {
        "minigun": "minigun"
    },
    {
        " was soon in production for use on helicopters, where the volume of fire could compensate for the instability of the helicopter as a firing platform.               The most common interface on machine guns is a ": null
    },
    {
        "pistol grip": "pistol grip"
    },
    {
        " and ": null
    },
    {
        "trigger": "trigger"
    },
    {
        ". On earlier manual machine guns, the most common type was a ": null
    },
    {
        "hand crank": "hand crank"
    },
    {
        ". On externally powered machine guns, such as miniguns, an electronic button or trigger on a joystick is commonly used. Light machine guns often have a butt stock attached, while vehicle and ": null
    },
    {
        "tripod": "tripod"
    },
    {
        " mounted machine guns usually have spade grips. In the late 20th century, scopes and other complex optics became more common as opposed to the more basic ": null
    },
    {
        "iron sights": "iron sights"
    },
    {
        ".     Loading systems in early manual machine guns were often from a hopper of loose cartridges. Manual-operated volley guns usually had to be reloaded manually all at once . With hoppers, the rounds could often be added while the weapon was firing. This gradually changed to belt-fed types. Belts were either held in the open by the person, or in a bag or box. Some modern vehicle machine guns used linkless feed systems however.     Modern machine guns are commonly mounted in one of four ways. The first is a ": null
    },
    {
        "bipod": "bipod"
    },
    {
        " – often these are integrated with the weapon. This is common on ": null
    },
    {
        "light machine guns": "light machine guns"
    },
    {
        " and some ": null
    },
    {
        "medium machine guns": "medium machine guns"
    },
    {
        ". Another is a ": null
    },
    {
        "tripod": "tripod"
    },
    {
        ", where the person holding it does not form a leg of support. Medium and ": null
    },
    {
        "heavy machine guns": "heavy machine gun"
    },
    {
        "usually use tripods. On ships, vehicles and aircraft machine guns are usually mounted on a ": null
    },
    {
        "pintle mount": "pintle mount"
    },
    {
        " – basically a steel post that is connected to the frame or body. Tripod and pintle mounts are usually used with spade grips. The last major mounting type is one that is disconnected from humans, as part of an armament system, such as a tank coaxial or part of an aircrafts armament. These are usually electrically fired and have complex sighting systems, for example, the ": null
    },
    {
        "US Helicopter Armament Subsystems": "us helicopter armament subsystems"
    },
    {
        ".   ": null
    }
]