[
    {
        "   In ": null
    },
    {
        "Irish mythology": "irish mythology"
    },
    {
        ", Mag Mell  was a mythical realm achievable through death and/or glory. Unlike the ": null
    },
    {
        "underworld": "underworld"
    },
    {
        " in some mythologies, Mag Mell was a pleasurable paradise, identified as either an island far to the west of Ireland or a kingdom beneath the ocean. However, Mag Mell was similar to the fields of ": null
    },
    {
        "Elysium": "elysium"
    },
    {
        " in Greek mythology, and like the fields of Elysium, was accessible only to a select few. Furthermore, Mag Mell, like the numerous other mystical islands said to be off the coast of Ireland, was never explicitly stated in any surviving mythological account to be an afterlife. Rather, it is usually portrayed as a paradisal location populated by deities, which is occasionally visited by some adventurous mortals. In its island guise it was visited by various Irish heroes and monks forming the basis of the Adventure Myth or ": null
    },
    {
        "echtrae": "echtrae"
    },
    {
        " as defined by ": null
    },
    {
        "Myles Dillon": "myles dillon"
    },
    {
        " in his book Early Irish Literature. This otherworld is a place where sickness and death do not exist. It is a place of eternal youth and beauty. Here, music, strength, life and all pleasurable pursuits come together in a single place. Here happiness lasts forever, no one wants for food or drink. It is the Irish equivalent of the Greek ": null
    },
    {
        "Elysium": "elysium"
    },
    {
        " or the ": null
    },
    {
        "Valhalla": "valhalla"
    },
    {
        " of the Norse.     Legends say its ruler is the ": null
    },
    {
        "Fomorian": "fomorians"
    },
    {
        " King ": null
    },
    {
        "Tethra": "tethra"
    },
    {
        ", or more frequently ": null
    },
    {
        "Manannan mac Lir": "manannan mac lir"
    },
    {
        ". Mag Mells allure extended from the pagan era to Christian times. In later stories, the realm is less an afterlife destination than an ": null
    },
    {
        "Earthly Paradise": "garden of eden"
    },
    {
        " which adventurers could reach by traveling west from ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", often blown off course by providential tempests while on an inspired mission. They typically explore many other fantastic islands before reaching their destination and returning home . Among these voyagers are ": null
    },
    {
        "St. Brendan": "st. brendan"
    },
    {
        ", ": null
    },
    {
        "Bran mac Febal": "bran mac febal"
    },
    {
        " , and ": null
    },
    {
        "Máel Dúin": "máel dúin"
    }
]