[
    {
        "      Magic is a category into which have been placed various beliefs and practices considered separate from both ": null
    },
    {
        "religion": "religion"
    },
    {
        " and ": null
    },
    {
        "science": "science"
    },
    {
        ". Emerging within ": null
    },
    {
        "Western culture": "western culture"
    },
    {
        ", the term has historically often had pejorative connotations, with things labelled magical perceived as being socially unacceptable, primitive, or foreign. The concept has been adopted by scholars in the ": null
    },
    {
        "humanities": "humanities"
    },
    {
        " and ": null
    },
    {
        "social sciences": "social sciences"
    },
    {
        ", who have proposed various different—and often mutually exclusive—definitions of the term. Many contemporary scholars regard the concept to be so problematic that they reject it altogether.     The term magic derives from the ": null
    },
    {
        "Old Persian": "old persian"
    },
    {
        " magu, a word that applied to a form of religious functionary about which little is known. During the late sixth and early fifth centuries BCE, this term was adopted into ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        ", where it was used with negative connotations to apply to rites that were regarded as fraudulent, unconventional, and dangerous. This meaning of the term was then adopted by ": null
    },
    {
        "Latin": "latin"
    },
    {
        " in the first century BCE. Via Latin, the concept was incorporated into ": null
    },
    {
        "Christian theology": "christian theology"
    },
    {
        " during the first century CE, where magic was associated with ": null
    },
    {
        "demons": "demons"
    },
    {
        " and thus defined against religion. This concept was pervasive throughout the Middle Ages, when Christian authors categorised a diverse range of practices—such as enchantment, ": null
    },
    {
        "witchcraft": "witchcraft"
    },
    {
        ", ": null
    },
    {
        "incantation": "incantation"
    },
    {
        "s, ": null
    },
    {
        "divination": "divination"
    },
    {
        ", ": null
    },
    {
        "necromancy": "necromancy"
    },
    {
        ", and ": null
    },
    {
        "astrology": "astrology"
    },
    {
        "—under the label magic. In ": null
    },
    {
        "early modern Europe": "early modern europe"
    },
    {
        ", ": null
    },
    {
        "Protestants": "protestantism"
    },
    {
        " often claimed that ": null
    },
    {
        "Roman Catholicism": "roman catholicism"
    },
    {
        " was magic rather than religion, and as Christian Europeans began colonising other parts of the world in the sixteenth century they labelled the non-Christian beliefs they encountered magical. In that same period, Italian ": null
    },
    {
        "humanists": "humanism"
    },
    {
        " reinterpreted the term in a positive sense to create the idea of ": null
    },
    {
        "natural magic": "natural magic"
    },
    {
        ". Both negative and positive understandings of the term recurred in Western culture over the following centuries.     Since the nineteenth century, academics in various disciplines have employed the term magic but have defined it in different ways and used it in reference to different things. One approach, associated with the ": null
    },
    {
        "anthropologists": "anthropology"
    },
    {
        " Edward Tylor": "edward tylor"
    },
    {
        " and ": null
    },
    {
        "James G. Frazer": "james g. frazer"
    },
    {
        ", uses the term to describe beliefs in ": null
    },
    {
        "hidden sympathies": "sympathetic magic"
    },
    {
        " between objects that allow one to influence the other. Defined in this way, magic is portrayed as the opposite to science. An alternative approach, associated with the ": null
    },
    {
        "sociologists": "sociology"
    },
    {
        " Marcel Mauss": "marcel mauss"
    },
    {
        " and ": null
    },
    {
        "Émile Durkheim": "émile durkheim"
    },
    {
        ", employs the term to describe private rites and ceremonies and contrasts it with religion, which it defines as a communal and organised activity. By the 42s, many scholars were rejecting the terms utility for scholarship. They argued that it drew arbitrary lines between similar beliefs and practices that were instead considered religious and that, being rooted in Western and Christian history, it was ": null
    },
    {
        "ethnocentric": "ethnocentrism"
    },
    {
        " to apply it to other cultures.     Throughout Western history, there have been individuals who engaged in practices that their societies called magic and who sometimes referred to themselves as magicians. Within modern ": null
    },
    {
        "occultism": "occultism"
    },
    {
        ", which developed in nineteenth-century Europe, there are many self-described magicians and people who practice ritual activities that they call magic. In this environment, the concept of magic has again changed, usually being defined as a technique for bringing about changes in the physical world through the force of ones will. This definition was pioneered largely by the influential British occultist ": null
    },
    {
        "Aleister Crowley": "aleister crowley"
    },
    {
        " and is used in occultist movements such as ": null
    },
    {
        "Wicca": "wicca"
    },
    {
        ", ": null
    },
    {
        "LaVeyan Satanism": "laveyan satanism"
    },
    {
        ", and ": null
    },
    {
        "chaos magic": "chaos magic"
    },
    {
        ".                   The historian ": null
    },
    {
        "Owen Davies": "owen davies"
    },
    {
        " stated that the word magic was beyond simple definition , and had a range of meanings . Similarly, the historian Michael D. Bailey characterised magic as a deeply contested category and a very fraught label ; as a category, he noted, it was profoundly unstable given that definitions of the term have varied dramatically across time and between cultures . Scholars have engaged in extensive debates as to how to define magic, with such debates resulting in intense dispute. Throughout such debates, the scholarly community has failed to agree on a definition of magic, in a similar manner to how they have failed to agree on a definition of religion. Even among those throughout history who have described themselves as magicians, there has been no common understanding of what magic is.     Concepts of magic generally serve to sharply demarcate certain practices from other, otherwise similar practices in a given society. According to Bailey: In many cultures and across various historical periods, categories of magic often define and maintain the limits of socially and culturally acceptable actions in respect to numinous or occult entities or forces. Even more basically they serve to delineate arenas of appropriate belief.  In this, he noted that drawing these distinctions is an exercise in power . Similarly, Randall Styers noted that attempting to define magic represents an act of demarcation by which it is juxtaposed against other social practices and modes of knowledge such as religion and science . The historian Karen Louise Jolly described magic as a category of exclusion, used to define an unacceptable way of thinking as either the opposite of religion or of science .          Within Western culture, the term magic has been linked to ideas of the ": null
    },
    {
        "Other": "other"
    },
    {
        ", foreignness, and primitivism. In Styers words, it has become a powerful marker of cultural difference . It has also been repeatedly presented as the archetypally non-modern phenomenon. Among Western intellectuals in the late nineteenth and early twentieth centuries, magic was seen as a defining feature of primitive mentalities and was commonly attributed to marginal groups, locations, and periods.     The concept and term magic developed in European society and thus using it when discussing non-Western cultures or pre-modern forms of Western society raises problems, as it may impose Western categories that are alien to them. While magic remains an ": null
    },
    {
        "emic": "emic and etic"
    },
    {
        " term in the history of Western societies, it remains an ": null
    },
    {
        "etic": "emic and etic"
    },
    {
        " term when applied to non-Western societies. During the twentieth century, many scholars focusing on Asian and African societies rejected the term magic , as well as related concepts like ": null
    },
    {
        "witchcraft": "witchcraft"
    },
    {
        " , in favour of the more precise terms and concepts that existed within these specific societies. A similar approach has been taken by many scholars studying pre-modern societies in Europe, such as ": null
    },
    {
        "Classical antiquity": "classical antiquity"
    },
    {
        ", who find the modern concept of magic inappropriate and favour more specific terms originating within the framework of the ancient cultures which they are studying. Alternately, this term implies that all categories of magic are ethnocentric and that such Western preconceptions are an unavoidable component of scholarly research.     Many scholars have argued that the use of the term as an analytical tool within academic scholarship should be rejected altogether. The scholar of religion ": null
    },
    {
        "Jonathan Z. Smith": "jonathan z. smith"
    },
    {
        " for example argued that it had no utility as an ": null
    },
    {
        "etic": "etic"
    },
    {
        " term that scholars should use. The historian of religion ": null
    },
    {
        "Wouter Hanegraaff": "wouter hanegraaff"
    },
    {
        " agreed, stating that the term magic is an important object of historical research, but not intended for doing research.  Bailey noted that, as of the early 42st century, few scholars sought grand definitions of magic but instead focused their attentions on careful attention to particular contexts , examining what a term like magic meant to a given society; this approach, he noted, call into question the legitimacy of magic as a universal category . The scholars of religion Berndt-Christian Otto and ": null
    },
    {
        "Michael Stausberg": "michael stausberg"
    },
    {
        " suggested that it would be perfectly possible for scholars to talk about ": null
    },
    {
        "amulet": "amulet"
    },
    {
        "s, ": null
    },
    {
        "curse": "curse"
    },
    {
        "s, healing procedures, and other cultural practices often regarded as magical in Western culture without any recourse to the concept of magic itself. The idea that magic should be rejected as an analytic term developed in anthropology, before moving into ": null
    },
    {
        "Classical studies": "classical studies"
    },
    {
        " and ": null
    },
    {
        "Biblical studies": "biblical studies"
    },
    {
        " in the 42s. Since the 42s, the terms usage among scholars of religion has declined.             maguš     The English words magic, mage and magician come from the Latin magus, through the Greek μάγος, which is from the ": null
    },
    {
        "Old Persian": "old persian"
    },
    {
        " maguš . The Old Persian magu- is derived from the ": null
    },
    {
        "Proto-Indo-European": "proto-indo-european"
    },
    {
        " magh , which was absorbed into the Iranian language; Iranians thereafter began using the word maguš or maghu, which may have led to the ": null
    },
    {
        "Old Sinitic": "old chinese"
    },
    {
        " Mᵞag . The Old Persian form seems to have permeated Ancient ": null
    },
    {
        "Semitic languages": "semitic languages"
    },
    {
        " as the ": null
    },
    {
        "Talmudic": "talmudic"
    },
    {
        " Hebrew": "hebrew"
    },
    {
        " magosh, the ": null
    },
    {
        "Aramaic": "aramaic"
    },
    {
        " amgusha , and the ": null
    },
    {
        "Chaldea": "chaldea"
    },
    {
        "n maghdim ; from the first century BCE onwards, ": null
    },
    {
        "Syria": "syria"
    },
    {
        "n magusai gained notoriety as magicians and soothsayers.     The Magi are mentioned in both the ": null
    },
    {
        "Book of Jeremiah": "book of jeremiah"
    },
    {
        " and the ": null
    },
    {
        "Behistun Inscription": "behistun inscription"
    },
    {
        " of ": null
    },
    {
        "Darius I": "darius i"
    },
    {
        ", indicating that they had gained considerable power and influence by the middle of the first millennium BCE. A number of ancient Greek authors discuss these Persian mágoi in their works. Among the first to do so was the historian ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        ", who states that the mágoi were one of seven Median tribes and that they served as functionaries at the court of the ": null
    },
    {
        "Achaemenid Empire": "achaemenid empire"
    },
    {
        ", where they acted as advisers to the king. According to Herodotus, these Persian mágoi were also in charge of various religious rites, namely sacrifices and the interpretation of dreams.          The Magi travelled far beyond Mesopotamia and the Levant. They were present in India by at least the first century BCE, as well as in Ethiopia, Egypt, and throughout Asia Minor. Many ancient sources claim they were ": null
    },
    {
        "Zarathustrians": "zarathustrianism"
    },
    {
        ", or that ": null
    },
    {
        "Zarathustra": "zarathustra"
    },
    {
        ", who may have lived as early as 42 BCE, was himself a Maguš; according to sinologist ": null
    },
    {
        "Victor H. Mair": "victor h. mair"
    },
    {
        ", they arrived in China at around this time. ": null
    },
    {
        "Ilya Gershevitch": "ilya gershevitch"
    },
    {
        " has described them as a professional priesthood to whom Zarathustrianism was merely one of the forms of religion in which they ministered against payment, much as a professional musician earns his living by performing the works of different composers .         The term magic has its origins in ": null
    },
    {
        "Ancient Greece": "ancient greece"
    },
    {
        ".   During the late sixth and early fifth centuries BC, the Persian maguš was Graecicized and introduced into the ancient Greek language as μάγος and μαγεία. In doing so it underwent a transformation of meaning, gaining negative connotations, with the magos being regarded as a charlatan whose ritual practices were fraudulent, strange, unconventional, and dangerous. As noted by Davies, for the ancient Greeks—and subsequently for the ancient Romans— magic was not distinct from religion but rather an unwelcome, improper expression of it – the religion of the other . The historian Richard Gordon suggested that for the ancient Greeks, being accused of practicing magic was a form of insult .     This change in meaning was influenced by the military conflicts that the Greek city-states were then engaged in against the Persian Empire. In this context, the term makes appearances in such surviving text as ": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        "  Oedipus Rex , ": null
    },
    {
        "Hippocrates": "hippocrates"
    },
    {
        "  De morbo sacro , and ": null
    },
    {
        "Gorgias": "gorgias"
    },
    {
        "  Encomium of Helen . In Sophocles play, for example, the character ": null
    },
    {
        "Oedipus": "oedipus"
    },
    {
        " derogatorily refers to the seer ": null
    },
    {
        "Tiresius": "tiresius"
    },
    {
        " as a magos—in this context meaning something akin to quack or charlatan—reflecting how this epithet was no longer reserved only for Persians.     In the first century BC, the Greek concept of the magos was adopted into ": null
    },
    {
        "Latin": "latin"
    },
    {
        " and used by a number of ": null
    },
    {
        "ancient Roman": "ancient roman"
    },
    {
        " writers as magus and magia. The earliest known Latin use of the term was in ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        "s  Eclogue , written around 42 BC, which makes reference to magicis… sacris . The Romans already had other terms for the negative use of supernatural powers, such as veneficus and saga. The Roman use of the term was similar to that of the Greeks, but placed greater emphasis on the judicial application of it. Within the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", laws would be introduced criminalising things regarded as magic.   In ancient Roman society, magic was associated with societies to the east of the empire; the first century CE writer ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        " for instance claimed that magic had been created by the Iranian philosopher ": null
    },
    {
        "Zoroaster": "zoroaster"
    },
    {
        ", and that it had then been brought west into Greece by the magician ": null
    },
    {
        "Osthanes": "osthanes"
    },
    {
        ", who accompanied the military campaigns of the Persian King ": null
    },
    {
        "Xerxes": "xerxes i"
    },
    {
        ".         In the first century CE, early Christian authors absorbed the ": null
    },
    {
        "Greco-Roman": "greco-roman world"
    },
    {
        " idea of magic and incorporated it into their developing ": null
    },
    {
        "Christian theology": "christian theology"
    },
    {
        ". These Christians retained the Greco-Roman negative connotations of the term and enhanced them by incorporating conceptual patterns borrowed from Jewish thought. Like earlier Graco-Roman thinkers, the early Christians attributed the origins of magic to an area to the east of Europe, among the Babylonians, Persians, or Egyptians. The Christians shared with earlier classical culture the idea that magic was something distinct from proper religion, although drew their distinction between the two in different ways.          For early Christian writers like ": null
    },
    {
        "Augustine of Hippo": "augustine of hippo"
    },
    {
        ", magic did not merely constitute fraudulent and unsanctioned ritual practices, but was the very opposite of religion because it relied upon cooperation from ": null
    },
    {
        "demons": "demons"
    },
    {
        ", the henchmen of ": null
    },
    {
        "Satan": "satan"
    },
    {
        ". In this, Christian ideas of magic were closely linked to the Christian category of ": null
    },
    {
        "paganism": "paganism"
    },
    {
        ", and both magic and paganism were regarded as belonging under the broader category of superstitio , another term borrowed from pre-Christian Roman culture. This Christian emphasis on the inherent immorality and wrongness of magic as something conflicting with good religion was far starker than the approach in the other large ": null
    },
    {
        "monotheistic": "monotheism"
    },
    {
        " religions of the period, Judaism and Islam. For instance, while Christians regarded demons as inherently evil, the ": null
    },
    {
        "jinn": "jinn"
    },
    {
        "—comparable entities in ": null
    },
    {
        "Islamic mythology": "islamic mythology"
    },
    {
        "—were perceived as more ambivalent figures by Muslims.     The model of the magician in Christian thought was provided by ": null
    },
    {
        "Simon Magus": "simon magus"
    },
    {
        ", or Simon the Magician , a figure who opposed ": null
    },
    {
        "Saint Peter": "saint peter"
    },
    {
        " in both the ": null
    },
    {
        "Acts of the Apostles": "acts of the apostles"
    },
    {
        " and the apocryphal yet influential ": null
    },
    {
        "Acts of Peter": "acts of peter"
    },
    {
        ". The historian Michael D. Bailey stated that in medieval Europe, magic was a relatively broad and encompassing category . Christian theologians believed that there were multiple different forms of magic, the majority of which were types of ": null
    },
    {
        "divination": "divination"
    },
    {
        ". For instance, ": null
    },
    {
        "Isidore of Seville": "isidore of seville"
    },
    {
        " produced a catalogue of things he regarded as magic in which he listed ": null
    },
    {
        "augury": "augury"
    },
    {
        ", ": null
    },
    {
        "necromancy": "necromancy"
    },
    {
        ", ": null
    },
    {
        "astrology": "astrology"
    },
    {
        ", ": null
    },
    {
        "incantations": "incantations"
    },
    {
        ", ": null
    },
    {
        "horoscopes": "horoscopes"
    },
    {
        ", ": null
    },
    {
        "amulets": "amulets"
    },
    {
        ", ": null
    },
    {
        "geomancy": "geomancy"
    },
    {
        ", ": null
    },
    {
        "hydromancy": "hydromancy"
    },
    {
        ", ": null
    },
    {
        "aeromancy": "aeromancy"
    },
    {
        ", ": null
    },
    {
        "pyromancy": "pyromancy"
    },
    {
        ", enchantment and ligatures. Medieval Europe also saw magic come to be associated with the Old Testament figure of ": null
    },
    {
        "Solomon": "solomon"
    },
    {
        "; various ": null
    },
    {
        "grimoires": "grimoires"
    },
    {
        ", or books outlining magical practices, were written that claimed to have been written by Solomon, most notably the  Key of Solomon .     In early medieval Europe, magia was a term of condemnation. In medieval Europe, Christians often suspected Muslims and Jews of engaging in magical practices; in certain cases, these perceived magical rites—including the ": null
    },
    {
        "alleged Jewish sacrifice of Christian children": "blood libel"
    },
    {
        "—resulted in Christians massacring these religious minorities. Christian groups often also accused other, rival Christian groups—which they regarded as ": null
    },
    {
        "heretical": "heresy"
    },
    {
        "—of engaging in magical activities. Medieval Europe also saw the term maleficium applied to forms of magic that were conducted with the intention of causing harm. The later Middle Ages saw words for these practitioners of harmful magical acts appear in various European languages: sorcière in French, Hexe in German, strega in Italian, and bruja in Spanish. The English term for malevolent practitioners of magic, witch, derived from the earlier ": null
    },
    {
        "Old English": "old english"
    },
    {
        " term wicce.              During the early modern period, the concept of magic underwent a more positive reassessment through the development of the concept of  magia naturalis  . This was a term introduced and developed by two Italian humanists, ": null
    },
    {
        "Marsilio Ficino": "marsilio ficino"
    },
    {
        " and ": null
    },
    {
        "Giovanni Pico della Mirandola": "giovanni pico della mirandola"
    },
    {
        ". For them, magia was viewed as an elemental force pervading many natural processes, and thus was fundamentally distinct from the mainstream Christian idea of demonic magic. Their ideas influenced an array of later philosophers and writers, among them ": null
    },
    {
        "Paracelsus": "paracelsus"
    },
    {
        ", ": null
    },
    {
        "Giordano Bruno": "giordano bruno"
    },
    {
        ", ": null
    },
    {
        "Johannes Reuchlin": "johannes reuchlin"
    },
    {
        ", and ": null
    },
    {
        "Johannes Trithemius": "johannes trithemius"
    },
    {
        ". According to the historian ": null
    },
    {
        "Richard Kieckhefer": "richard kieckhefer"
    },
    {
        ", the concept of magia naturalis took firm hold in European culture during the fourteenth and fifteenth centuries, attracting the interest of ": null
    },
    {
        "natural philosophers": "natural philosophy"
    },
    {
        " of various theoretical orientations, including ": null
    },
    {
        "Aristotelians": "aristotelianism"
    },
    {
        ", ": null
    },
    {
        "Neoplatonists": "neoplatonism"
    },
    {
        ", and ": null
    },
    {
        "Hermeticists": "hermeticism"
    },
    {
        ".     Adherents of this position argued that magia could appear in both good and bad forms; in 42 the French librarian ": null
    },
    {
        "Gabriel Naudé": "gabriel naudé"
    },
    {
        " wrote his Apology for all the Wise Men Falsely Suspected of Magic, in which he distinguished Mosoaicall Magick —which he claimed came from God and included prophecies, miracles, and ": null
    },
    {
        "speaking in tongues": "speaking in tongues"
    },
    {
        "—from geotick magic caused by demons. While the proponents of magia naturalis insisted that this did not rely on the actions of demons, critics disagreed, arguing that the demons had simply deceived these magicians. By the seventeenth century the concept of magia naturalis had moved in increasingly naturalistic directions, with the distinctions between it and science becoming blurred. The validity of magia naturalis as a concept for understanding the universe then came under increasing criticism during the ": null
    },
    {
        "Age of Enlightenment": "age of enlightenment"
    },
    {
        " in the eighteenth century.     Despite the attempt to reclaim the term magia for use in a positive sense, it did not supplant traditional attitudes toward magic in the West, which remained largely negative. At the same time as magia naturalis was attracting interest and was largely tolerated, Europe saw an active persecution of accused witches believed to be guilty of maleficia. Reflecting the terms continued negative associations, ": null
    },
    {
        "Protestants": "protestantism"
    },
    {
        " often sought to denigrate ": null
    },
    {
        "Roman Catholic": "roman catholicism"
    },
    {
        " sacramental and devotional practices as being magical rather than religious. Many Roman Catholics were concerned by this allegation and for several centuries various Roman Catholic writers devoted attention to arguing that their practices were religious rather than magical. At the same time, Protestants often used the accusation of magic against other Protestant groups which they were in contest with. In this way, the concept of magic was used to prescribe what was appropriate as religious belief and practice.   Similar claims were also being made in the Islamic world during this period. The Arabian cleric ": null
    },
    {
        "Muhammad ibn Abd al-Wahhab": "muhammad ibn abd al-wahhab"
    },
    {
        "—founder of ": null
    },
    {
        "Wahhabism": "wahhabism"
    },
    {
        "—for instance condemned a range of customs and practices such as divination and the veneration of spirits as sihr, which he in turn claimed was a form of  shirk , the sin of idolatry.         In the sixteenth century, European societies began to conquer and colonise other continents around the world, and as they did so they applied European concepts of magic and witchcraft to practices found among the peoples whom they encountered. Usually, these European colonialists regarded the natives as primitives and savages whose belief systems were diabolical and needed to be eradicated and replaced by Christianity. Because Europeans typically viewed these non-European peoples as being morally and intellectually inferior to themselves, it was expected that such societies would be more prone to practicing magic. Women who practiced traditional rites were labelled witches by the Europeans.          In various cases, these imported European concepts and terms underwent new transformations as they merged with indigenous concepts. In West Africa, for instance, Portuguese travellers introduced their term and concept of the feitiçaria  and the feitiço to the native population, where it was transformed into the concept of the  fetish . When later Europeans encountered these West African societies, they wrongly believed that the fetiche was an indigenous African term rather than the result of earlier inter-continental encounters. Sometimes, colonised populations themselves adopted these European concepts for their own purposes. In the early nineteenth century, the newly independent Haitian government of ": null
    },
    {
        "Jean-Jacques Dessalines": "jean-jacques dessalines"
    },
    {
        " began to suppress the practice of ": null
    },
    {
        "Vodou": "haitian vodou"
    },
    {
        ", and in 42 Haitain law-codes categorised all Vodou practices as sortilège , suggesting that it was all conducted with harmful intent, whereas among Vodou practitioners the performance of harmful rites was already given a separate and distinct category, known as maji.     By the nineteenth century, European intellectuals no longer saw the practice of magic through the framework of ": null
    },
    {
        "sin": "sin"
    },
    {
        " and instead regarded magical practices and beliefs as an aberrational mode of thought antithetical to the dominant cultural logic – a sign of psychological impairment and marker of racial or cultural inferiority .     As educated elites in Western societies increasingly rejected the efficacy of magical practices, legal systems ceased to threaten practitioners of magical activities with punishment for the crimes of diabolism and witchcraft, and instead threatened them with the accusation that they were defrauding people through promising to provide things which they could not.     This spread of European colonial power across the world influenced how academics would come to frame the concept of magic.   In the nineteenth century, a number of scholars adopted the traditional, negative concept of magic. That they chose to do so was not inevitable, for they could have followed the example adopted by prominent ": null
    },
    {
        "esotericists": "western esotericism"
    },
    {
        " active at the time like ": null
    },
    {
        "Helena Blavatsky": "helena blavatsky"
    },
    {
        " who had chosen to use the term and concept of magic in a positive sense.   Various writers also used the concept of magic to criticise religion by arguing that the latter still displayed many of the negative traits of the former. An example of this was the American journalist ": null
    },
    {
        "H. L. Mencken": "h. l. mencken"
    },
    {
        " in his polemical 42 work  Treatise on the Gods ; he sought to critique religion by comparing it to magic, arguing that the division between the two was misplaced. The concept of magic was also adopted by theorists in the new field of ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", where it was often used synonymously with ": null
    },
    {
        "superstition": "superstition"
    },
    {
        " , although the latter term proved more common in early psychological texts.     In the late nineteenth and twentieth centuries, ": null
    },
    {
        "folklorists": "folkloristics"
    },
    {
        " examined rural communities across Europe in search of magical practices, which at the time they typically understood as survivals of ancient belief systems. It was only in the 42s that anthropologists like ": null
    },
    {
        "Jeanne Favret-Saada": "jeanne favret-saada"
    },
    {
        " also began looking in depth at magic in European contexts, having previously focused on examining magic in non-Western contexts. In the twentieth century, magic also proved a topic of interest to the ": null
    },
    {
        "Surrealists": "surrealism"
    },
    {
        ", an artistic movement based largely in Europe; the Surrealism ": null
    },
    {
        "Andre Breton": "andre breton"
    },
    {
        " for instance published LArt magique in 42 discussing what he regarded as the links between magic and art.     The scholarly application of magic as a sui generis category that can be applied to any socio-cultural context was linked with the promotion of ": null
    },
    {
        "modernity": "modernity"
    },
    {
        " to both Western and non-Western audiences.     The term magic has become pervasive in the popular imagination and idiom.   In contemporary contexts, the word magic is sometimes used to describe a type of excitement, of wonder, or sudden delight , and in such a context can be a term of high praise . Despite its historical contrast against science, scientists have also adopted the term in application to various concepts, such as ": null
    },
    {
        "magic acid": "magic acid"
    },
    {
        ", ": null
    },
    {
        "magic bullets": "magic bullet"
    },
    {
        ", and ": null
    },
    {
        "magic angle": "magic angle"
    },
    {
        "s.              Modern Western magic has challenged widely-held preconceptions about contemporary religion and spirituality.   The polemical discourses about magic influenced the self-understanding of modern magicians, a number of whom—such as ": null
    },
    {
        "Aleister Crowley": "aleister crowley"
    },
    {
        " and ": null
    },
    {
        "Julius Evola": "julius evola"
    },
    {
        "—were well versed in academic literature on the subject.   According to scholar of religion Henrik Bogdan, arguably the best known emic definition of the term magic was provided by Crowley. Crowley—who favoured the spelling ": null
    },
    {
        "magick": "magick"
    },
    {
        " over magic to distinguish it from stage illusionism—was of the view that Magick is the Science and Art of causing Change to occur in conformity with Will . Crowleys definition influenced that of subsequent magicians. ": null
    },
    {
        "Dion Fortune": "dion fortune"
    },
    {
        " of the ": null
    },
    {
        "Fraternity of the Inner Light": "fraternity of the inner light"
    },
    {
        " for instance stated that Magic is the art of changing consciousness according to Will . ": null
    },
    {
        "Gerald Gardner": "gerald gardner"
    },
    {
        ", the founder of ": null
    },
    {
        "Gardnerian Wicca": "gardnerian wicca"
    },
    {
        ", stated that magic was attempting to cause the physically unusual , while ": null
    },
    {
        "Anton LaVey": "anton lavey"
    },
    {
        ", the founder of ": null
    },
    {
        "LaVeyan Satanism": "laveyan satanism"
    },
    {
        ", described magic as the change in situations or events in accordance with ones will, which would, using normally acceptable methods, be unchangeable.      The ": null
    },
    {
        "chaos magic": "chaos magic"
    },
    {
        " movement emerged during the late 42th century, as an attempt to strip away the ": null
    },
    {
        "symbol": "symbol"
    },
    {
        "ic, ": null
    },
    {
        "ritual": "ritual"
    },
    {
        "istic, ": null
    },
    {
        "theological": "theology"
    },
    {
        " or otherwise ornamental aspects of other occult traditions and distill magic down to a set of basic techniques.      These modern Western concepts of magic rely on a belief in correspondences connected to an unknown occult force that permeates the universe. As noted by Hanegraaff, this operated according to a new meaning of magic, which could not possibly have existed in earlier periods, precisely because it is elaborated in reaction to the disenchantment of the world .    For many, and perhaps most, modern Western magicians, the goal of magic is deemed to be personal spiritual development.   The perception of magic as a form of self-development is central to the way that magical practices have been adopted into forms of ": null
    },
    {
        "modern Paganism": "modern paganism"
    },
    {
        " and the ": null
    },
    {
        "New Age": "new age"
    },
    {
        " phenomenon.   One significant development within modern Western magical practices has been ": null
    },
    {
        "sex magic": "sex magic"
    },
    {
        ". This was a practice promoted in the writings of ": null
    },
    {
        "Paschal Beverly Randolph": "paschal beverly randolph"
    },
    {
        " and subsequently exerted a strong interest on occultist magicians like Crowley and ": null
    },
    {
        "Theodor Reuss": "theodor reuss"
    },
    {
        ".     The adoption of the term magic by modern occultists can in some instances be a deliberate attempt to champion those areas of Western society which have traditionally been marginalised as a means of subverting dominant systems of power. The influential American ": null
    },
    {
        "Wicca": "wicca"
    },
    {
        "n and author ": null
    },
    {
        "Starhawk": "starhawk"
    },
    {
        " for instance stated that Magic is another word that makes people uneasy, so I use it deliberately, because the words we are comfortable with, the words that sound acceptable, rational, scientific, and intellectually correct, are comfortable precisely because they are the language of estrangement.          Modern scholarship has produced various definitions and theories of magic. According to Bailey, these have typically framed magic in relation to, or more   frequently in distinction from, religion and science.  Since the emergence of the ": null
    },
    {
        "study of religion": "study of religion"
    },
    {
        " and the ": null
    },
    {
        "social science": "social science"
    },
    {
        "s, magic has been a central theme in the theoretical literature produced by scholars operating in these academic disciplines. Magic is one of the most heavily theorized concepts in the study of religion, and also played a key role in early theorising within anthropology. Styers believed that it held such a strong appeal for social theorists because it provides such a rich site for articulating and contesting the nature and boundaries of modernity . Scholars have commonly used it as a foil for the concept of religion, regarding magic as the illegitimate sibling of religion. Alternately, others have used it as a middle-ground category located between religion and science.     The context in which scholars framed their discussions of magic was informed by the spread of European colonial power across the world in the modern period.   These repeated attempts to define magic resonated with broader social concerns, and the pliability of the concept has allowed it to be readily adaptable as a polemical and ideological tool . The links that intellectuals made between magic and primitives helped to legitimise European and Euro-American imperialism and colonialism, as these Western colonialists expressed the view that those who believed in and practiced magic were unfit to govern themselves and should be governed by those who, rather than believing in magic, believed in science and/or religion. In Baileys words, the association of certain peoples with magic served to distance and differentiate them from those who ruled over them, and in large part to justify that rule.      Many different definitions of magic have been offered by scholars, although — according to Hanegraaff — these can be understood as variations of a small number of heavily influential theories.              The intellectualist approach to defining magic is associated with two prominent British ": null
    },
    {
        "anthropologists": "anthropology"
    },
    {
        ", ": null
    },
    {
        "Edward Tylor": "edward tylor"
    },
    {
        " and ": null
    },
    {
        "James G. Frazer": "james g. frazer"
    },
    {
        ". This approach viewed magic as the theoretical opposite of ": null
    },
    {
        "science": "science"
    },
    {
        ", and came to preoccupy much anthropological thought on the subject. This approach was situated within the evolutionary models which underpinned thinking in the social sciences during the early 42th century. The first social scientist to present magic as something that predated religion in an evolutionary development was ": null
    },
    {
        "Herbert Spencer": "herbert spencer"
    },
    {
        "; in his A System of Synthetic Philosophy, he used the term magic in reference to ": null
    },
    {
        "sympathetic magic": "sympathetic magic"
    },
    {
        ". Spencer regarded both magic and religion as being rooted in false speculation about the nature of objects and their relationship to other things.     Tylors understanding of magic was linked to his concept of ": null
    },
    {
        "animism": "animism"
    },
    {
        ". In his 42 book Primitive Culture, Tylor characterized magic as beliefs based on the error of mistaking ideal analogy for real analogy .  In Tylors view, primitive man, having come to associate in thought those things which he found by experience to be connected in fact, proceeded erroneously to invert this action, and to conclude that association in thought must involve similar connection in reality. He thus attempted to discover, to foretell, and to cause events by means of processes which we can now see to have only an ideal significance . Tylor was dismissive of magic, describing it as one of the most pernicious delusions that ever vexed mankind . Tylors views proved highly influential, and helped to establish magic as a major topic of anthropological research.          Tylors ideas were adopted and simplified by James Frazer. He used the term magic to mean sympathetic magic, describing it as a practice relying on the magicians belief that things act on each other at a distance through a secret sympathy , something which he described as an invisible ether . He further divided this magic into two forms, the homeopathic and the contagious . The former was the idea that like produces like , or that the similarity between two objects could result in one influencing the other. The latter was based on the idea that contact between two objects allowed the two to continue to influence one another at a distance. Like Taylor, Frazer viewed magic negatively, describing it as the bastard sister of science , arising from one great disastrous fallacy .     Where Frazer differed from Tylor was in characterizing a belief in magic as a major stage in humanitys cultural development, describing it as part of a tripartite division in which magic came first, religion came second, and eventually science came third. For Frazer, all early societies started as believers in magic, with some of them moving away from this and into religion. He believed that both magic and religion involved a belief in spirits but that they differed in the way that they responded to these spirits. For Frazer, magic constrains or coerces these spirits while religion focuses on conciliating or propitiating them . He acknowledged that their common ground resulted in a cross-over of magical and religious elements in various instances; for instance he claimed that the ": null
    },
    {
        "sacred marriage": "sacred marriage"
    },
    {
        " was a fertility ritual which combined elements from both world-views.     Some scholars retained the evolutionary framework used by Frazer but changed the order of its stages; the German ethnologist ": null
    },
    {
        "Wilhelm Schmidt": "wilhelm schmidt"
    },
    {
        " argued that religion—by which he meant ": null
    },
    {
        "monotheism": "monotheism"
    },
    {
        "—was the first stage of human belief, which later degenerated into both magic and ": null
    },
    {
        "polytheism": "polytheism"
    },
    {
        ". Others rejected the evolutionary framework entirely. Frazers notion that magic had given way to religion as part of an evolutionary framework was later deconstructed by the folklorist and anthropologist ": null
    },
    {
        "Andrew Lang": "andrew lang"
    },
    {
        " in his essay Magic and Religion ; Lang did so by highlighting how Frazers framework relied upon misrepresenting ethnographic accounts of beliefs and practiced among indigenous Australians to fit his concept of magic.         The functionalist approach to defining magic is associated with the French ": null
    },
    {
        "sociologists": "sociology"
    },
    {
        " Marcel Mauss": "marcel mauss"
    },
    {
        " and ": null
    },
    {
        "Emile Durkheim": "emile durkheim"
    },
    {
        ".   In this approach, magic is understood as being the theoretical opposite of religion.     Mauss set forth his conception of magic in a 42 essay, A General Theory of Magic . Mauss used the term magic in reference to any rite that is not part of an organized cult: a rite that is private, secret, mysterious, and ultimately tending towards one that is forbidden . Conversely, he associated religion with organised cult. By saying that magic was inherently non-social, Mauss had been influenced by the traditional Christian understandings of the concept. Mauss deliberately rejected the intellectualist approach promoted by Frazer, believing that it was inappropriate to restrict the term magic to sympathetic magic, as Frazer had done. He expressed the view that there are not only magical rites which are not sympathetic, but neither is sympathy a prerogative of magic, since there are sympathetic practices in religion .     Mauss ideas were adopted by Durkheim in his 42 book  The Elementary Forms of the Religious Life . Durkheim was of the view that both magic and religion pertained to sacred things, that is to say, things set apart and forbidden . Where he saw them as being different was in their social organisation. Durkheim used magic to describe things that were inherently anti-social, existing in contrast to what he referred to as a Church, the religious beliefs shared by a social group; in his words, There is no Church of magic.  Durkheim expressed the view that there is something inherently anti-religious about the maneuvers of the magician , and that a belief in magic does not result in binding together those who adhere to it, nor in uniting them into a group leading a common life.  Durkheims definition encounters problems in situations—such as the rites performed by Wiccans—in which acts carried out communally have been regarded, either by practitioners or observers, as being magical.     Scholars have criticized the idea that magic and religion can be differentiated into two distinct, separate categories. The social anthropologist ": null
    },
    {
        "Alfred Radcliffe-Brown": "alfred radcliffe-brown"
    },
    {
        " suggested that a simple dichotomy between magic and religion was unhelpful and thus both should be subsumed under the broader category of ": null
    },
    {
        "ritual": "ritual"
    },
    {
        ". Many later anthropologists followed his example.   Nevertheless, this distinction is still often made by scholars discussing this topic.          The emotionalist approach to magic is associated with the English anthropologist ": null
    },
    {
        "Robert Ranulph Marett": "robert ranulph marett"
    },
    {
        ", the Austrian ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        ", and the Polish anthropologist ": null
    },
    {
        "Bronisław Malinowski": "bronisław malinowski"
    },
    {
        ".     Marett viewed magic as a response to stress. In a 42 article, he argued that magic was a cathartic or stimulating practice designed to relieve feelings of tension. As his thought developed, he increasingly rejected the idea of a division between magic and religion and began to use the term magico-religious to describe the early development of both. Malinowski understood magic in a similar manner to Marett, tackling the issue in a 42 article. He rejected Frazers evolutionary hypothesis that magic was followed by religion and then science as a series of distinct stages in societal development, arguing that all three were present in each society. In his view, both magic and religion arise and function in situations of emotional stress although whereas religion is primarily expressive, magical is primarily practical. He therefore defined magic as a practical art consisting of acts which are only means to a definite end expected to follow later on . For Malinowski, magical acts were to be carried out for a specific end, whereas religious ones were ends in themselves. He for instance believed that fertility rituals were magical because they were carried out with the intention of meeting a specific need. As part of his ": null
    },
    {
        "functionalist": "structural functionalism"
    },
    {
        " approach, Malinowski saw magic not as irrational but as something that served a useful function, being sensible within the given social and environmental context.          The term magic was used liberally by Freud. He also saw magic as emerging from human emotion but interpreted it very differently to Marett.   Freud explains that the associated theory of magic merely explains the paths along which magic proceeds; it does not explain its true essence, namely the misunderstanding which leads it to replace the laws of nature by psychological ones . Freud emphasizes that what led primitive men to come up with magic is the power of wishes: His wishes are accompanied by a motor impulse, the will, which is later destined to alter the whole face of the earth in order to satisfy his wishes. This motor impulse is at first employed to give a representation of the satisfying situation in such a way that it becomes possible to experience the satisfaction by means of what might be described as motor ": null
    },
    {
        "hallucination": "hallucination"
    },
    {
        "s. This kind of representation of a satisfied wish is quite comparable to childrens play, which succeeds their earlier purely sensory technique of satisfaction. As time goes on, the psychological accent shifts from the motives for the magical act on to the measures by which it is carried out—that is, on to the act itself. It thus comes to appear as though it is the magical act itself which, owing to its similarity with the desired result, alone determines the occurrence of that result.      In the early 42s, the anthropologists Murray and Rosalie Wax put forward the argument that scholars should look at the magical worldview of a given society on its own terms rather than trying to rationalize it in terms of Western ideas about scientific knowledge. Their ideas were heavily criticised by other anthropologists, who argued that they had set up a false dichotomy between non-magical Western worldview and magical non-Western worldviews. The concept of the magical worldview nevertheless gained widespread use in history, folkloristics, philosophy, cultural theory, and psychology. The notion of ": null
    },
    {
        "magical thinking": "magical thinking"
    },
    {
        " has also been utilised by various psychologists. In the 42s, the psychologist ": null
    },
    {
        "Jean Piaget": "jean piaget"
    },
    {
        " used the concept as part of their argument that children were unable to clearly differentiate between the mental and the physical. According to this perspective, children begin to abandon their magical thinking between the ages of six and nine.     According to ": null
    },
    {
        "Stanley Tambiah": "stanley tambiah"
    },
    {
        ", magic, science, and religion all have their own quality of rationality , and have been influenced by politics and ideology. As opposed to religion, Tambiah suggests that mankind has a much more personal control over events. Science, according to Tambiah, is a system of behavior by which man acquires mastery of the environment.             Many of the practices which have been labelled magic can be performed by anyone. For instance, some charms can be recited by individuals with no specialist knowledge nor any claim to having a specific power. Others require specialised training in order to perform them. Some of the individuals who performed magical acts on a more than occasional basis came to be identified as magicians, or with related concepts like sorcerers/sorceresses, ": null
    },
    {
        "witch": "witch"
    },
    {
        "es, or cunning folk. Identities as a magician can stem from an individuals own claims about themselves, or it can be a label placed upon them by others. In the latter case, an individual could embrace such a label, or they could reject it, sometimes vehemently.     There can be economic incentives that encouraged individuals to identify as magicians. In the cases of various forms of traditional healer, as well as the later stage magicians or illusionists, the label of magician could become a job description. Others claim such an identity out of a genuinely held belief that they have specific unusual powers or talents. Different societies have different social regulations regarding who can take on such a role; for instance, it may be a question of familial heredity, or there may be gender restrictions on who is allowed to engage in such practices.   A variety of personal traits may be credited with giving magical power, and frequently they are associated with an unusual birth into the world.  For instance, in Hungary it was believe that a  táltosok  would be born with teeth or an additional finger. In various parts of Europe, it was believed that being born with a ": null
    },
    {
        "caul": "caul"
    },
    {
        " would associate the child with supernatural abilities. In some cases, a ritual initiation is required before taking on a role as a specialist in such practices, and in others it is expected that an individual will receive a mentorship from another specialist.     Davies noted that it was possible to crudely divide magic specialists into religious and lay categories . He noted for instance that Roman Catholic priests, with their rites of ": null
    },
    {
        "exorcism": "exorcism"
    },
    {
        ", and access to ": null
    },
    {
        "holy water": "holy water"
    },
    {
        " and blessed herbs, could be conceived as being magical practitioners. Some historians have drawn a differentiation between those practitioners who engage in high magic, and those who engage in low magic. In this framework, high magic is seen as more complex, involving lengthy and detailed ceremonies as well as sophisticated, sometimes expensive, paraphernalia. Low magic is associated with simpler rituals such as brief, spoken charms.     However, the most common method of identifying, differentiating, and establishing magical practitioners from common people is by ": null
    },
    {
        "initiation": "initiation"
    },
    {
        ". By means of rites the magicians relationship to the supernatural and his entry into a closed professional class is established .   Mauss argues that the powers of both specialist and common magicians are determined by culturally accepted standards of the sources and the breadth of magic: a magician cannot simply invent or claim new magic. In practice, the magician is only as powerful as his peers believe him to be.     Throughout recorded history, magicians have often faced scepticism regarding their purported powers and abilities. For instance, in sixteenth-century England, the writer ": null
    },
    {
        "Reginald Scot": "reginald scot"
    },
    {
        " wrote  The Discoverie of Witchcraft , in which he argued that many of those accused of witchcraft or otherwise claiming magical capabilities were fooling people using illusionism.            Those regarded as being magicians have often faced suspicion from other members of their society. This is particularly the case if these perceived magicians have been associated with social groups already considered morally suspect in a particular society, such as foreigners, women, or the lower classes. In contrast to these negative associations, many practitioners of activities that have been labelled magical have emphasised that their actions are benevolent and beneficial. This conflicted with the common Christian view that all activities categorised as being forms of magic were intrinsically bad regardless of the intent of the magician, because all magical actions relied on the aid of demons. There could be conflicting attitudes regarding the practices of a magician; in European history, authorities often believed that cunning folk and traditional healers were harmful because their practices were regarded as magical and thus stemming from contact with demons, whereas a local community might value and respect these individuals because their skills and services were deemed beneficial.     In Western societies, the practice of magic, especially when harmful, was usually associated with women. For instance, during the witch trials of the early modern period, around three quarters of those executed as witches were female, to only a quarter who were men. That women were more likely to be accused and convicted of witchcraft in this period might have been because their position was more legally vulnerable, with women having little or no legal standing that was independent of their male relatives. The conceptual link between women and magic in Western culture may be because many of the activities regarded as magical—from rites to encourage fertility to potions to induce ": null
    },
    {
        "abortion": "abortion"
    },
    {
        "s—were associated with the female sphere. It might also be connected to the fact that many cultures portrayed women as being inferior to men on an intellectual, moral, spiritual, and physical level.": null
    }
]