[
    {
        "A magneto-optic effect is any one of a number of phenomena in which an ": null
    },
    {
        "electromagnetic wave": "electromagnetic wave"
    },
    {
        " propagates through a medium that has been altered by the presence of a quasistatic ": null
    },
    {
        "magnetic field": "magnetic field"
    },
    {
        ". In such a medium, which is also called gyrotropic or gyromagnetic, left- and right-rotating elliptical polarizations can propagate at different speeds, leading to a number of important phenomena. When light is transmitted through a layer of magneto-optic material, the result is called the ": null
    },
    {
        "Faraday effect": "faraday effect"
    },
    {
        ": the plane of ": null
    },
    {
        "polarization": "polarization"
    },
    {
        " can be rotated, forming a ": null
    },
    {
        "Faraday rotator": "faraday rotator"
    },
    {
        ". The results of reflection from a magneto-optic material are known as the ": null
    },
    {
        "magneto-optic Kerr effect": "magneto-optic kerr effect"
    },
    {
        " .     In general, magneto-optic effects break ": null
    },
    {
        "time reversal symmetry": "time reversal symmetry"
    },
    {
        " locally as well as ": null
    },
    {
        "Lorentz reciprocity": "lorentz reciprocity"
    },
    {
        ", which is a necessary condition to construct devices such as ": null
    },
    {
        "optical isolator": "faraday isolator"
    },
    {
        "s .     Two gyrotropic materials with reversed rotation directions of the two principal polarizations, corresponding to complex-conjugate ε tensors for lossless media, are called ": null
    },
    {
        "optical isomer": "optical isomer"
    },
    {
        "s.         In particular, in a magneto-optic material the presence of a magnetic field  can cause a change in the ": null
    },
    {
        "permittivity": "permittivity"
    },
    {
        " tensor ε of the material. The ε becomes anisotropic, a 42×42 matrix, with ": null
    },
    {
        "complex": "complex number"
    },
    {
        " off-diagonal components, depending of course on the frequency ω of incident light. If the absorption losses can be neglected, ε is a ": null
    },
    {
        "Hermitian matrix": "hermitian matrix"
    },
    {
        ". The resulting ": null
    },
    {
        "principal axes": "optical axis"
    },
    {
        " become complex as well, corresponding to elliptically-polarized light where left- and right-rotating polarizations can travel at different speeds .     More specifically, for the case where absorption losses can be neglected, the most general form of Hermitian ε is:     : \\varepsilon \\begin   \\varepsilon_ & \\varepsilon_ + i g_z & \\varepsilon_ - i g_y \\\\   \\varepsilon_ - i g_z & \\varepsilon_ & \\varepsilon_ + i g_x \\\\   \\varepsilon_ + i g_y & \\varepsilon_ - i g_x & \\varepsilon_ \\\\   \\end     or equivalently the relationship between the ": null
    },
    {
        "displacement field": "electric displacement field"
    },
    {
        " D and the ": null
    },
    {
        "electric field": "electric field"
    },
    {
        " E is:     : \\mathbf \\varepsilon \\mathbf \\varepsilon \\mathbf + i \\mathbf \\times \\mathbf     where \\varepsilon is a real ": null
    },
    {
        "symmetric matrix": "symmetric matrix"
    },
    {
        " and \\mathbf is a real ": null
    },
    {
        "pseudovector": "pseudovector"
    },
    {
        " called the gyration vector, whose magnitude is generally small compared to the eigenvalues of \\varepsilon . The direction of g is called the axis of gyration of the material. To first order, g is proportional to the applied ": null
    },
    {
        "magnetic field": "magnetic field"
    },
    {
        ":     : \\mathbf \\varepsilon_42 \\chi^ \\mathbf     where \\chi^ \\! is the ": null
    },
    {
        "magneto-optical susceptibility": "magneto-optical susceptibility"
    },
    {
        " . If this susceptibility itself depends upon the electric field, one can obtain a ": null
    },
    {
        "nonlinear optical": "nonlinear optics"
    },
    {
        " effect of ": null
    },
    {
        "magneto-optical parametric generation": "magneto-optical parametric generation"
    },
    {
        " .     The simplest case to analyze is the one in which g is a principal axis of \\varepsilon , and the other two eigenvalues of \\varepsilon are identical. Then, if we let g lie in the z direction for simplicity, the ε tensor simplifies to the form:     : \\varepsilon \\begin   \\varepsilon_42 & + i g_z & 42 \\\\   - i g_z & \\varepsilon_42 & 42 \\\\   42 & 42 & \\varepsilon_42 \\\\   \\end     Most commonly, one considers light propagating in the z direction . In this case the solutions are elliptically polarized electromagnetic waves with ": null
    },
    {
        "phase velocities": "phase velocity"
    },
    {
        " 42 / \\sqrt . This difference in phase velocities leads to the Faraday effect.     For light propagating purely perpendicular to the axis of gyration, the properties are known as the ": null
    },
    {
        "Cotton-Mouton effect": "cotton-mouton effect"
    },
    {
        " and used for a ": null
    },
    {
        "Circulator": "circulator"
    },
    {
        ".       Kerr Rotation and Kerr Ellipticity are changes in the polarization of incident light which comes in contact with a gyromagnetic material. Kerr Rotation is a rotation in the plane of polarization of transmitted light, and Kerr Ellipticity is the ratio of the major to minor axis of the ellipse traced out by ": null
    },
    {
        "elliptically": "elliptical polarization"
    },
    {
        " polarized light on the plane through which it propagates. Changes in the orientation of polarized incident light can be quantified using these two properties.        According to classical physics, the speed of light varies with the permittivity of a material:     v_p \\frac     where v_p is the velocity of light through the material, \\epsilon is the material permittivity, and \\mu is the material permeability. Because the permittivity is anisotropic, polarized light of different orientations will travel at different speeds.     This can be better understood if we consider a wave of light that is circularly polarized . If this wave interacts with a material at which the horizontal component travels at a different speed than the vertical component , the two components will fall out of the 42 degree phase difference changing the Kerr Ellipticity     A change in Kerr Rotation is most easily recognized in linearly polarized light, which can be separated into two ": null
    },
    {
        "Circularly polarized": "circular polarization"
    },
    {
        " components: Left-Handed Circular Polarized light and Right-Handed Circular Polarized light. The anisotropy of the Magneto Optic material permittivity causes a difference in the speed of LCP and RCP light, which will cause a change in the angle of polarized light. Materials that exhibit this property are known as ": null
    },
    {
        "Birefringent": "birefringence"
    },
    {
        ".     From this rotation, we can calculate the difference in orthogonal velocity components, find the anisotropic permittivity, find the gyration vector, and calculate the applied magnetic field ": null
    }
]