[
    {
        "      The Magnavox Odyssey  is the first commercial ": null
    },
    {
        "home video game console": "home video game console"
    },
    {
        ". It was developed by a small team led by ": null
    },
    {
        "Ralph H. Baer": "ralph h. baer"
    },
    {
        " at ": null
    },
    {
        "Sanders Associates": "sanders associates"
    },
    {
        " and released by ": null
    },
    {
        "Magnavox": "magnavox"
    },
    {
        " in the United States in September 42 and overseas the following year. The Odyssey consists of a white, black, and brown box which connects to a television set, and two rectangular ": null
    },
    {
        "controllers": "video game controllers"
    },
    {
        " attached by wires. It is capable of displaying three square dots on the screen in ": null
    },
    {
        "monochrome": "monochrome"
    },
    {
        " black and white, with differing behavior for the dots depending on the game played, and with no sound capabilities. Players place plastic overlays on the screen to create visuals, and the one or two players for each game control their dots with the three knobs and one button on the controller in accordance with the rules given for the game. The Odyssey console came packaged with dice, paper money, and other ": null
    },
    {
        "board game": "board game"
    },
    {
        " paraphernalia to go along with the games, and a ": null
    },
    {
        "peripheral": "peripheral"
    },
    {
        " controller—the first video game ": null
    },
    {
        "light gun": "light gun"
    },
    {
        "—was sold separately.     The idea for a video game console was thought up by Baer in August 42 and over the next three years he, along with Bill Harrison and Bill Rusch, created seven successive prototype consoles. The seventh, known as the Brown Box, was shown to several manufacturers before Magnavox agreed to produce it in January 42 After releasing the console in September 42 through their dealerships, Magnavox sold between 42 and 42 units by the end of the year, and 42 by the time the console was discontinued in 42 The console spawned the ": null
    },
    {
        "Odyssey series": "odyssey series"
    },
    {
        " of ": null
    },
    {
        "dedicated consoles": "dedicated consoles"
    },
    {
        ", as well as the 42 ": null
    },
    {
        "Magnavox Odyssey²": "magnavox odyssey²"
    },
    {
        ". One of the 42 games made for the system, a ping pong game, was an inspiration for ": null
    },
    {
        "Atari": "atari"
    },
    {
        "s successful  Pong  arcade game, in turn driving sales of the console. Baers patents for the system and the games, including what was termed by a judge as the pioneering patent of the ": null
    },
    {
        "video game art": "video game art"
    },
    {
        " , formed the basis of a series of lawsuits spanning 42 years, earning Sanders and Magnavox over US$42 million. The release of the Odyssey marked the end of the ": null
    },
    {
        "early history of video games": "early history of video games"
    },
    {
        ", and the rise of the commercial ": null
    },
    {
        "video game industry": "video game industry"
    },
    {
        " along with the start of the ": null
    },
    {
        "first generation of video game consoles": "first generation of video game consoles"
    },
    {
        ".            The Odyssey consists of a black, white, and brown oblong box connected by wires to two rectangular ": null
    },
    {
        "controllers": "game controller"
    },
    {
        ". The primary console box connects to the television set through an included switchbox, which allows the player to switch the television input between the Odyssey and the regular television input cable, and presents itself like a television channel. The controllers, which are designed to sit on a flat surface, contain one button marked Reset on the top of the controller and three ": null
    },
    {
        "knob": "control knob"
    },
    {
        "s: one on the right side of the controller, and two on the left with one extending from the other. The reset button does not reset the game, but instead is used by different games to reset individual elements, such as making a players dot visible after it is turned off during a game. The system can be powered by six ": null
    },
    {
        "C batteries": "c battery"
    },
    {
        ", which were included. An optional ": null
    },
    {
        "AC power supply": "alternating current"
    },
    {
        " was sold separately. The Odyssey lacks ": null
    },
    {
        "sound capability": "sound effect"
    },
    {
        " and can only display ": null
    },
    {
        "monochrome": "monochrome"
    },
    {
        " white shapes on a blank black screen.     Internally, the Odyssey architecture is composed of digital computing parts. The circuitry is implemented in ": null
    },
    {
        "diode–transistor logic": "diode–transistor logic"
    },
    {
        " using discrete ": null
    },
    {
        "transistor": "transistor"
    },
    {
        "s and ": null
    },
    {
        "diode": "diode"
    },
    {
        "s, rather than the newly emerging ": null
    },
    {
        "transistor–transistor logic": "transistor–transistor logic"
    },
    {
        " integrated circuits, due to cost concerns. The games themselves do not use ": null
    },
    {
        "ROM cartridge": "rom cartridge"
    },
    {
        "s like later consoles, but instead use game cards composed of ": null
    },
    {
        "printed circuit board": "printed circuit board"
    },
    {
        "s that plug into the console. These cards modify the internal circuitry like a set of switches or ": null
    },
    {
        "jumpers": "jumper"
    },
    {
        ", causing the Odyssey to display different components and react to inputs differently. Multiple games use the same cards, with different instructions given to the player to change the style of game.        The Odyssey is capable of displaying three square dots and a vertical line on the screen. Two of the dots are controlled by the two players, and the third by the system itself. The main console has two dials, one of which moves the vertical line across the screen, and one which adjusts the speed of the computer-controlled dot. Different games direct the player to adjust the dials to different positions, for example to change the center line of a ": null
    },
    {
        "tennis": "tennis"
    },
    {
        " game into the side wall of a ": null
    },
    {
        "handball": "handball"
    },
    {
        " game. The games include plastic overlays which stick to the television via static cling, to create visuals for the game. Different games that use the same game card can have different overlays, which can change a game with the same controls from, for example, a mountain ski path to a movement-based ": null
    },
    {
        "Simon Says": "simon says"
    },
    {
        " game.     In addition to the overlays, the Odyssey came with dice, poker chips, score sheets, play money, and game boards much like a traditional ": null
    },
    {
        "board game": "board game"
    },
    {
        ". One ": null
    },
    {
        "peripheral": "peripheral"
    },
    {
        " controller was released for the Odyssey, the first video game ": null
    },
    {
        "light gun": "light gun"
    },
    {
        ". Named the Shooting Gallery, the rifle-shaped device registered a hit when pointed at a light source such as a dot on the television screen. Four shooting-based games were included with the light gun.          In 42 while working for military contractor Loral Electronics, engineer ": null
    },
    {
        "Ralph H. Baer": "ralph h. baer"
    },
    {
        " was assigned to build a television set; while doing so, Baer claims he had the idea to build something into a television set that the owner could control, rather than only hooking it up to a remote television station. Baer did not pursue the idea, but it returned to him in August 42 while waiting for a bus. Baer, then the head of the Equipment Design Division at military contractor ": null
    },
    {
        "Sanders Associates": "sanders associates"
    },
    {
        ", came up with the concept of using a television to play games, and the next morning wrote up a four-page proposal for a US$42 game box that would plug into a television screen and play games on it. While the commercial ": null
    },
    {
        "video game industry": "video game industry"
    },
    {
        " did not yet exist at that point, the ": null
    },
    {
        "very first electronic computer games": "early history of video games"
    },
    {
        " had been developed at the start of the 42s, and by 42 several ": null
    },
    {
        "early mainframe games": "early mainframe games"
    },
    {
        " had been developed for ": null
    },
    {
        "mainframe computers": "mainframe computers"
    },
    {
        ", which were typically only found in large academic or research institutions. In the proposal, Baer began by referring to the project using military terminology, but by the time he finished it he was referring to it as Channel LP, short for lets play . The proposed device would transmit a signal that the television set could tune into as if it were a television channel, and Baer described several games that could be played on it.     As Channel LP had little to do with the typical military contracts Sanders worked on, rather than bring the idea to his bosses Baer instead commandeered an empty room and assigned one of his technicians, Bob Tremblay, to work on it with him. By December 42 an initial prototype later christened TV Game 42 was completed, which could display and move a vertical line on a television screen. Baer demonstrated the prototype to the Sanders director of research and development, Herbert Campman, who hesitantly agreed to fund it for US$42 of labor and US$42 for materials, making it an official project.        Baer spent the next few months designing further prototypes, and in February 42 assigned technician Bill Harrison to begin building the project. Harrison spent the next few months in between other projects building out successive modifications to the prototype. Baer, meanwhile, collaborated with engineer Bill Rusch on the design of the console, including developing the basis of many games for the system. The first game was developed by May, a two-player game where the players repeatedly press a button in competition to fill or empty a bucket of water, and by June multiple games were completed for what was then a second prototype box. These included a game where players controlled dots chasing each other and a ": null
    },
    {
        "light gun shooter": "light gun shooter"
    },
    {
        " game with a plastic rifle. Baer demonstrated the new prototype to Campman, who enjoyed the shooting game, increased funding, and recommended Baer demonstrate the project to senior management. Baer demonstrated the console to the board, who were largely uninterested, though a couple of members were enthusiastic; nevertheless, CEO Royden Sanders authorized the project to be continued with the aim of selling or licensing the console as a commercial product.     By August 42 Baer and Harrison had completed a third prototype machine, but had found that to even come near to Baers initial aim of a US$42 or $42 console would require so much to be excluded that the resulting console would not be very enjoyable. Baer additionally felt that he was not proving successful at designing fun games for the system; to make up for this he formally added Bill Rusch, who had helped him come up with the initial games for the console, to the project. Though the pair found Rusch difficult to work with, he soon proved his value to the team by coming up with a way to display three spots on the screen at once rather than the previous two, and proposing the development of a ping pong game. By November, the team, now on their fourth prototype machine, had a ping pong game, a chasing game, a light gun game, and three types of controllers: joysticks for the chase game, a rifle for the light gun game, and a three dial controller for the ping pong game. Campman felt that the system was advanced enough to begin trying to find a manufacturer to buy it; they had decided to aim for selling the rights to produce the console, as Sanders was not in the business of making and selling commercial electronics.        The team first approached the cable television industry, and the prototype attracted the attention of TelePrompter Corporation, who had seen it during a visit. After a few months of talks, cash-flow problems forced TelePrompter to back out in April 42 The same economic downturn that caused TelePrompters problems caused financial difficulties at Sanders as well, which put the project on hold after the fifth prototype was developed while simultaneously undergoing large-scale layoffs. It was picked up again in September, this time without Rusch, and went through two more iterations resulting in January 42 in the seventh prototype, known as the Brown Box due to the wood-grain stickers on the casing. With the system now largely complete, Baer and Harrison were unsure who to approach to sell it until a Sanders patent attorney recommended contacting television manufacturers. Baer demonstrated the system to several companies, who all expressed enthusiasm; only ": null
    },
    {
        "RCA": "rca"
    },
    {
        " was willing to purchase the device, however, and an agreement could not be reached. Soon afterwards, though, RCA executive Bill Enders left RCA for ": null
    },
    {
        "Magnavox": "magnavox"
    },
    {
        " and convinced them to look at the console again. The three creators of the Brown Box again demonstrated the device to Magnavox in July 42; they received a tepid reaction from most of the executives, but Vice President of Marketing Gerry Martin was in favor and Magnavox agreed to produce the console. After a long period of negotiations the two companies finally signed an agreement in January 42        Magnavox designed the exterior of the machine, and re-engineered some the internals with some consultation from Baer and Harrison; they removed the ability to display color, used only the three dial controller, and changed the system of selecting games from a dial to separate game cards that modified the consoles circuitry when plugged into the console. At the time, color televisions were still seen as a luxury item, and the ability to show color would have added additional expense and time spent dealing with ": null
    },
    {
        "FCC": "federal communications commission"
    },
    {
        " testing and regulations. The internal circuitry had been designed with discrete components rather than integrated circuits due to cost concerns; these concerns were no longer valid by 42 but Magnavox did not have enough time to redesign every internal component of the machine prior to the planned production start date. Magnavox named the console first as the Skill-O-Vision while testing, and then released it as the Odyssey. The rifle game was turned into a separately sold add-on game, Shooting Gallery, and Magnavox added paper money, playing cards, and poker chips to the console, to go along with the plastic overlays for the games that enhanced the primitive visuals. The new additions helped raise the price of the console to US$42. Baer was upset with the board game additions, which he felt were pointless add-ons that would go unused by players. Magnavox announced the systems launch date of September 42 and demonstrated it for months prior to Magnavox dealerships and media.          Magnavox began advertising the Odyssey in mid-September 42 including an appearance on the game show  Whats My Line?  on October 42 42 As neither  Pong  nor the term video game existed, the company described the console as the new electronic game of the future and closed-circuit electronic playground . After ordering 42 units, before release, Magnavox increased its production capabilities and built a larger inventory, as market testing found an enthusiastic response to the console. The Odyssey was sold only through Magnavox dealers; the company hoped that as the first such product, consumers would visit its stores. The device retailed for US$42, or US$42 when purchased with a Magnavox television.     There are conflicting reports between Baer and Magnavox employees as to whether Magnavox produced 42 or 42 consoles in 42; additionally, Odyssey product manager Bob Fritsche recalled selling 42 units that year, while Baer recalled sales being closer to 42. Baer stated that he felt the low initial sales were due to the high price—US$42 in 42 is —and because of Magnavox restricting sales to its dealerships and implying that the device only worked with Magnavox televisions. Other sources have stated that dealers misled customers to sell more televisions, though advertisements explicitly stated that it worked with any set. Customers unfamiliar with the new device may have misunderstood Odysseys interoperability.     Magnavox assistant product planner Don Emry said that the sales were in line with the original projections, if not with the production run. According to Baer, after the initial holiday season Magnavox considered dropping the console, but the modest continuing demand the following year convinced them to manufacture an additional 42 units for the 42 holiday season, selling 42 of them. The console was also released in 42 other countries: Australia, Belgium, France, Germany, Greece, Israel, Italy, the Soviet Union, Spain, Switzerland, the United Kingdom, and Venezuela, with different games. In late 42 Magnavox ran a large advertising campaign for all of its 42 products, including sponsoring ": null
    },
    {
        "Frank Sinatra": "frank sinatra"
    },
    {
        "s November television special  Ol Blue Eyes Is Back . Commercials during the special and advertisements for it showed the Odyssey and other Magnavox products. The company sold 42 Odyssey units in 42 or 42 according to Baer. Magnavox discontinued the console after 42; according to Baer it sold 42 units in total worldwide, though statements by Fritsche indicate it may have been higher. The light gun peripheral sold 42 units.            As the Odyssey was discontinued Magnavox released the first successive ": null
    },
    {
        "dedicated consoles": "dedicated consoles"
    },
    {
        "—consoles that could only play games built into the system—in the ": null
    },
    {
        "Odyssey series": "odyssey series"
    },
    {
        ", the Odyssey 42 and Odyssey 42 as part of the ": null
    },
    {
        "first generation of video game consoles": "first generation of video game consoles"
    },
    {
        "; the Odyssey 42 was only capable of playing the ping pong and hockey games from the original Odyssey. Eleven dedicated Odyssey consoles were produced before a true follow-up console in 42 the ": null
    },
    {
        "Magnavox Odyssey²": "magnavox odyssey²"
    },
    {
        ".     While it showed the potential of video game consoles and marked the end of the ": null
    },
    {
        "early history of video games": "early history of video games"
    },
    {
        " and the beginning of the commercial video game industry, the Odyssey is not generally considered a major commercial success. Magnavox produced no more games for the console after 42 and rejected Baers proposals for an add-on that would add sound to games, a putting controller and associated golf game, and console variants that would have been cheaper or supported up to four players. While a few clone systems were produced in limited quantities, and multiple dedicated systems—generally focused on ping pong game variants—were created by several companies, no other true home video consoles were produced until the 42 ": null
    },
    {
        "Fairchild Semiconductor": "fairchild semiconductor"
    },
    {
        " Channel F": "fairchild channel f"
    },
    {
        ".     In 42 Ralph Baer was awarded the ": null
    },
    {
        "National Medal of Technology": "national medal of technology and innovation"
    },
    {
        " for his groundbreaking and pioneering creation, development and commercialization of interactive video games, which spawned related uses, applications, and mega-industries in both the entertainment and education realms . In June 42 the ": null
    },
    {
        "Museum of Modern Art": "museum of modern art"
    },
    {
        " added the Magnavox Odyssey to its ": null
    },
    {
        "permanent collection of video games": "list of video games in the museum of modern art"
    },
    {
        ". MoMAs Paul Galloway described the console as a masterpiece of engineering and industrial design and stated that it was hard to overstate the importance of place in the birth of the industry . The Brown Box prototype and the TV Game 42 prototype are located at the ": null
    },
    {
        "Smithsonian Institution": "smithsonian institution"
    },
    {
        "s ": null
    },
    {
        "National Museum of American History": "national museum of american history"
    },
    {
        " in ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        ".          In May 42 ": null
    },
    {
        "Nutting Associates": "nutting associates"
    },
    {
        " chief engineer ": null
    },
    {
        "Nolan Bushnell": "nolan bushnell"
    },
    {
        ", designer of the first commercial ": null
    },
    {
        "arcade video game": "arcade game"
    },
    {
        ",  Computer Space , saw a demonstration of the Odyssey at a dealership. Inspired, when he quit Nutting to start his own company, ": null
    },
    {
        "Atari": "atari, inc."
    },
    {
        ", he assigned ": null
    },
    {
        "Allan Alcorn": "allan alcorn"
    },
    {
        " to create a cheap ping pong arcade game as a training exercise, though he did not tell Alcorn that it was for training nor that the idea was based on the Odyssey Table Tennis game. Alcorn soon developed Pong, which Bushnell recognized as a potential hit, and it became the companys first game. Pong was very successful, and in turn helped drive sales of the Odyssey; Baer once noted that customers bought the console because of Table Tennis, in turn because of Pong, and joked that they may as well have stopped designing games after that game card. In 42 however, Magnavox sued Atari along with several competitors including Nutting, Allied Leisure, ": null
    },
    {
        "Bally Midway": "midway games"
    },
    {
        ", and ": null
    },
    {
        "Williams Electronics": "wms industries"
    },
    {
        " for infringing on Baers patents for video games played on a television screen. Baer has stated that the lawsuits were not filed right away because Magnavox and Sanders needed to wait until they could expect to be awarded more money than it would cost to pursue the suits. The root of the conflict was a pair of patents by Baer—one which described how the Odyssey showed player-controlled objects, or dots, on a video monitor and described a number of games that could be played with the system, and an earlier one that went into detail about how the Odyssey used that system to have two dots collide with each other and have one bounce off, specifically using a game of ping pong as an example.     The judge ruled that Baers more general patent for the Odyssey constituted the pioneering patent of the video game art , and held the defendants games as infringing the patents. Atari settled early on in the court case with Magnavox, and in return were granted a license in exchange for US$42 million and access granted to Magnavox to all technology produced by Atari from June 42 to June 42 while the other defendants paid higher penalties. Over the next twenty years, Sanders and Magnavox sued several other companies over the issue, focusing on ": null
    },
    {
        "paddle-and-ball": "paddle"
    },
    {
        " type games like Pong and Table Tennis that were more clearly related to the ping pong game patent; the final lawsuits ended in the mid 42s. Defendants included Coleco, ": null
    },
    {
        "Mattel": "mattel"
    },
    {
        ", ": null
    },
    {
        "Seeburg": "seeburg corporation"
    },
    {
        ", and ": null
    },
    {
        "Activision": "activision"
    },
    {
        "; Sanders and Magnavox won or settled every lawsuit. Many of the defendants unsuccessfully attempted to claim that the patents only applied to the specific hardware implementations that Baer had used, or that they were invalidated by prior computer or electronic games. In 42 ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        " sued and tried to invalidate Baers patents, claiming as prior art the 42  Tennis for Two  game built by ": null
    },
    {
        "William Higinbotham": "william higinbotham"
    },
    {
        ". The court, however, ruled that the ": null
    },
    {
        "oscilloscope": "oscilloscope"
    },
    {
        "-based game did not use video signals and therefore did not qualify as a video game, and ruled again in favor of Magnavox and Sanders. Magnavox won more than US$42 million in the various patent lawsuits and settlements involving the Odyssey related patents. In addition, they had a large number of licensees of patents, with over one hundred already by the mid 42s.       A total of 42 games distributed on 42 different game cards were released for the Magnavox Odyssey. 42 games were included with the console—a set of 42 in America and a different set of 42 in other countries—with 42 others available for purchase either individually for US$42 or in a pack for US$42; the additional games primarily used the same game cards with different screen overlays and instructions. Another game, Percepts, was available for free to players that sent in a survey card. A light gun accessory, Shooting Gallery, was available for purchase, and included four games on two cards that used the rifle. A final four games were released for sale in 42 designed wholly or in part by Don Emry. The games do not enforce game rules or keep track of score; that is left up to the players.     ": null
    }
]