[
    {
        "Mainstream hardcore, mainstyle or newstyle hardcore is a subgenre of ": null
    },
    {
        "hardcore techno": "hardcore"
    },
    {
        ". The essence of mainstream hardcore sound is a ": null
    },
    {
        "distorted": "distortion"
    },
    {
        " bass drum": "bass drum"
    },
    {
        " sound, overdriven to the point where it becomes clipped into a distorted ": null
    },
    {
        "square wave": "square wave"
    },
    {
        " and makes a recognizably melodic tone.     Often the Roland Alpha ": null
    },
    {
        "Juno": "roland juno-106"
    },
    {
        " or the kick from a ": null
    },
    {
        "Roland TR42": "roland tr-909"
    },
    {
        " was used to create this sound. Mainstream hardcore tracks typically include ": null
    },
    {
        "samples": "sampling"
    },
    {
        " and synthesized melodies with the typical tempo ranging from 42 to 42 ": null
    },
    {
        "bpm": "beats per minute"
    },
    {
        ". Violence, drugs and profanity are common themes in mainstream hardcore, perceptible through its samples and lyrics, often screamed, ": null
    },
    {
        "pitch shift": "pitch shift"
    },
    {
        "ed, or distorted.          The mainstream hardcore sound derives from the ": null
    },
    {
        "early hardcore": "early hardcore"
    },
    {
        " . In the late 42s, the early hardcore became less popular than the ": null
    },
    {
        "Hardstyle": "hardstyle"
    },
    {
        ". After surviving underground for a number of years, in 42 the gabber regained some popularity in the Netherlands, although the sound is more mature, darker, and ": null
    },
    {
        "industrial": "industrial music"
    },
    {
        ". Some producers started embracing a slower style characterized by a deeper, harder bass drum that typically had a longer envelope than was possible in the traditional, faster style. In this aspect, this new form of gabber obviously cannot be considered less powerful than its precursor. This newer sound was referred to as New Style or Mainstream and as the tempo got slower and slower it began to become similar to Chicago hard house. Many hardcore enthusiasts hated Chicago hard house and the ": null
    },
    {
        "club": "nightclub"
    },
    {
        " scene it typified, and frequently DJs would be booed by one group of fans and cheered for by another at the same party, depending on the tempo and style of music they were playing. This is similar to the rivalry and mutual dislike that surfaced earlier between fans of regular hardcore and happy hardcore. Eventually the two styles met in the middle, and most gabber today is produced in a range of 4242 bpm. This style is typically a bit slower than the Rotterdam style of the mid42s.          Mainstream hardcore is characterized by its bass drum sound. Essentially, it comes from taking a normal synthesized bass drum and over-driving it heavily. The approximately sinusoidal sample starts to clip into a square wave with a falling pitch. This results in a number of effects: the frequency spectrum spreads out, thus achieving a louder, more aggressive sound. It also changes the amplitude envelope of the sound by increasing the sustain. Due to the distortion, the drum also develops a melodic tone. It is not uncommon for the bass drum pattern to change pitch throughout the song to follow the bass line. Lots of tracks rely on a clean, detuned ": null
    },
    {
        "supersaw": "supersaw"
    },
    {
        " lead, similar to ": null
    },
    {
        "uplifting trance": "uplifting trance"
    },
    {
        " and can therefore sound happy .          Frenchcore is a genre of music derived from hardcore techno. It came out during the late 42s and early 42s. Frenchcore has gained greater notoriety, especially in France, the Netherlands and Italy.     Frenchcore is completely created with the help of a computer. It is characterized by an increased tempo usually between 42 and 42 BPM in a 42/42 time.  Frenchcore uses instruments from the minimalist and industrial music, techno and Gabber  . Frenchcore producers use often mostly French voice samples originating from movies, video clips, or video games, and even synthesizer for use. Often, entire excerpts from industrial tracks are taken and experimentally extended. Frenchcore kicks are different from hardcore kicks in that the kicks pitch is more recognizable, and often sound wubbier.         ": null
    },
    {
        "Enzyme Records": "enzyme records"
    },
    {
        " ID & T": "id & t"
    },
    {
        " Masters of Hardcore": "masters of hardcore"
    },
    {
        " Rotterdam Records": "rotterdam records"
    }
]