[
    {
        "      Mambo is a genre of Cuban dance music pioneered by the ": null
    },
    {
        "charanga": "charanga"
    },
    {
        " Arcaño y sus Maravillas": "arcaño y sus maravillas"
    },
    {
        " in the late 1930s and later popularized in the ": null
    },
    {
        "big band": "big band"
    },
    {
        " style by ": null
    },
    {
        "Pérez Prado": "pérez prado"
    },
    {
        ". It originated as a syncopated form of the ": null
    },
    {
        "danzón": "danzón"
    },
    {
        ", known as ": null
    },
    {
        "danzón-mambo": "danzón-mambo"
    },
    {
        ", with a final, improvised section, which incorporated the  guajeo s typical of ": null
    },
    {
        "son cubano": "son cubano"
    },
    {
        " . These guajeos became the essence of the genre when it was played by big bands, which did not perform the traditional sections of the danzón and instead leaned towards ": null
    },
    {
        "swing": "swing music"
    },
    {
        " and ": null
    },
    {
        "jazz": "jazz"
    },
    {
        ". By the late 1940s and early 1950s, mambo had become a dance craze in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " as its ": null
    },
    {
        "associated dance": "mambo"
    },
    {
        " took over the East Coast thanks to Pérez Prado, ": null
    },
    {
        "Tito Puente": "tito puente"
    },
    {
        ", ": null
    },
    {
        "Tito Rodríguez": "tito rodríguez"
    },
    {
        " and others. In the mid-1950s, a slower ballroom style, also derived from the danzón, ": null
    },
    {
        "cha-cha-cha": "cha-cha-cha"
    },
    {
        ", replaced mambo as the most popular dance genre in North America. Nonetheless, mambo continued to enjoy some degree of popularity into the 1960s and new derivative styles appeared, such as dengue; by the 1970s it had been largely incorporated into ": null
    },
    {
        "salsa": "salsa music"
    },
    {
        ".            The earliest roots of mambo can be traced to the  danzón de nuevo ritmo  , later known as danzón-mambo, made popular by the orchestra ": null
    },
    {
        "Arcaño y sus Maravillas": "arcaño y sus maravillas"
    },
    {
        " conducted by flautist ": null
    },
    {
        "Antonio hi": "antonio arcaño"
    },
    {
        "     Orestes López": "orestes lópez"
    },
    {
        " and his brother ": null
    },
    {
        "Israel López Cachao ": "cachao"
    },
    {
        ", main composers of the Maravillas, were the first to denominate a final upbeat, improvised section of the popular Cuban ": null
    },
    {
        "danzón": "danzón"
    },
    {
        " as a mambo. This innovation a key step in the process of evolution of the danzón, which over the years had progressively lost its structural rigidity to the benefit of musicians and dancers alike. Prior to the danzón de nuevo ritmo, in 1910, ": null
    },
    {
        "José Urfé": "josé urfé"
    },
    {
        " had first added a ": null
    },
    {
        "montuno": "montuno"
    },
    {
        "  as a final part of his composition El bombín de Barreto. This was a swinging section consisting of a repeated musical phrase, which introduced some elements of the ": null
    },
    {
        "son": "son"
    },
    {
        " into the ": null
    },
    {
        "danzón": "danzón"
    },
    {
        ". During the mid-to-late 1930s, some members of the Arcaño group were saying vamos a mambear when referring to the ": null
    },
    {
        "montuno": "montuno"
    },
    {
        " or final improvisation of the ": null
    },
    {
        "danzón": "danzón"
    },
    {
        ". Sublette, Ned. Cuba and its Music: From the First Drums to the Mambo. Chicago: Chicago Review Press, 2004: 508 It was Arcaños cellist, ": null
    },
    {
        "Orestes López": "orestes lópez"
    },
    {
        ", who created the first ": null
    },
    {
        "danzón": "danzón"
    },
    {
        " called ": null
    },
    {
        "Mambo": "mambo"
    },
    {
        " .  In this piece, some syncopated motives taken from the son style were combined with improvised flute passages. Orovio, p. 130.     Antonio Arcaño described the mambo as follows: Mambo is a type of syncopated  montuno  that possesses the rhythmic charm, informality and eloquence of the Cuban people. The pianist attacks the mambo, the flute picks it up and improvises, the violin executes rhythmic chords in double stops, the double bass inserts a tumbao, the timbalero plays the cowbell, the güiro scrapes and plays the maracas rhythm, the indispensable tumba  reaffirms the bass tumbao and strengthens the timbal. Giro, Radamés: Todo lo que usted quiso saber sobre el Mambo. Panorama de la música popular cubana. Editorial Letras Cubanas, La Habana, Cuba, 1998, P. 212.         ": null
    },
    {
        "Dámaso Pérez Prado": "dámaso pérez prado"
    },
    {
        ", a pianist and arranger from ": null
    },
    {
        "Matanzas, Cuba": "matanzas, cuba"
    },
    {
        ", established his residence in Havana at the beginning of the 1940s and began to work at night clubs and orchestras, such as Paulina Alvarezs and Casino de La Playa. In 1949 he traveled to Mexico looking for job opportunities and achieved great success with a new style, to which he assigned a name that had been already used by ": null
    },
    {
        "Antonio Arcaño": "antonio arcaño"
    },
    {
        ", the mambo. Díaz Ayala, Cristóbal: Música cubana, del Areyto a la Nueva Trova, Ediciones Universal, Miami Florida, 1993. p. 194.     Perez Prados style differed from the previous mambo concept. The new style possessed a greater influence from North-American ": null
    },
    {
        "jazz": "jazz music"
    },
    {
        ", and an expanded instrumentation consisting of four to five trumpets, four to five saxophones, double bass, drums, maracas, cowbell, congas and bongoes. This new mambo included a catchy counterpoint between the trumpets and the saxophones that induced the body to move along with the rhythm, stimulated at the end of each musical phrase by a characteristic deep throat sound expression.     Because his music was aimed at an audience that lived primarily outside Cuba, Pérez Prado used a large number of international influences, especially North-American, in his arrangements. This is evident in his arrangements of songs such as Mambo Rock , Patricia and Tequila , where he uses a triple meter U.S. swing rhythm fused with elements from ": null
    },
    {
        "Cuban rumba": "cuban rumba"
    },
    {
        " and ": null
    },
    {
        "son": "son"
    },
    {
        ". Pérez Prados repertoire included numerous international pieces such as Cerezo Rosa , María Bonita , Tea For Two , La Bikina , ": null
    },
    {
        "Cuando Calienta El Sol": "cuando calienta el sol"
    },
    {
        " , ": null
    },
    {
        "Malagueña": "malagueña"
    },
    {
        " and En Un Pueblito Español , among many others. Rodríguez Ruidíaz, Armando: Los sonidos de la música cubana. Evolución de los formatos instrumentales en Cuba. . P. 49 – 50.     Famous Cuban singer ": null
    },
    {
        "Beny Moré": "beny moré"
    },
    {
        " also lived in Mexico between 1945 and 1952  . He composed and recorded some mambos there with Mexican orchestras, especially the one led by Rafael de Paz; they recorded Yiri Yiri Bon , La Culebra , Mata Siguaraya , ": null
    },
    {
        "Solamente Una Vez": "solamente una vez"
    },
    {
        " and Bonito Y Sabroso  . Benny and Perez Prado recorded 28 mambo songs including La Múcura , Rabo Y Oreja , and Pachito Eché  . At this time Benny also recorded with the orchestra of Jesús Chucho Rodríguez.     Prados recordings were meant for the Latin American and U.S. latino markets, but some of his most celebrated mambos, such as Mambo No. 5 and Que Rico El Mambo , quickly crossed over to a wider U.S. audience. León, Javier F. Mambo. Encyclopedia of Latino Popular Culture. Ed. Cordelia Chávez Candelaria, Arturo J. Aldama, Peter J. García, Alma Alvarez-Smith. 2 vols. Connecticut: Praeger, 2004: 510         Mambo arrived in 1947 and mambo music and dance became popular soon  . Recording companies began to use mambo to label their records and advertisements for mambo dance lessons were in local newspapers. New York City had made mambo a transnational popular cultural phenomenon. In New York the mambo was played in a high-strung, sophisticated way that had the ": null
    },
    {
        "Palladium Ballroom": "palladium ballroom"
    },
    {
        ", the famous Broadway dance-hall, jumping. The Ballroom soon proclaimed itself the temple of mambo , for the citys best dancers—the Mambo Aces, ": null
    },
    {
        " Killer Joe Piro": "killer joe piro"
    },
    {
        ", Augie and Margo Rodriguez. Augie and Margo were still dancing 50 years later in ": null
    },
    {
        "Las Vegas": "las vegas valley"
    },
    {
        ".     Some of New Yorks biggest mambo dancers and bands of the 1950s included: Augie & Margo, Michael Terrace & Elita, Carmen Cruz & Gene Ortiz, Larry Selon & Vera Rodríguez, Mambo Aces, ": null
    },
    {
        "Killer Joe Piro": "killer joe piro"
    },
    {
        ", Paulito and Lilon, Louie Maquina, ": null
    },
    {
        "Pedro Aguilar": "pedro aguilar"
    },
    {
        " , ": null
    },
    {
        "Machito": "machito"
    },
    {
        ", ": null
    },
    {
        "Tito Rodríguez": "tito rodríguez"
    },
    {
        ", ": null
    },
    {
        "Jose Curbelo": "jose curbelo"
    },
    {
        ", Akohh, and ": null
    },
    {
        "Noro Morales": "noro morales"
    }
]