[
    {
        "           A mammoth is any ": null
    },
    {
        "species": "species"
    },
    {
        " of the ": null
    },
    {
        "extinct": "extinct"
    },
    {
        " genus": "genus"
    },
    {
        " Mammuthus, one of the many genera that make up the ": null
    },
    {
        "order": "order"
    },
    {
        " of trunked ": null
    },
    {
        "mammals": "mammal"
    },
    {
        "called ": null
    },
    {
        "proboscidea": "proboscidea"
    },
    {
        "ns. The various species of mammoth were commonly equipped with long, curved ": null
    },
    {
        "tusks": "tusks"
    },
    {
        " and, in northern species, a covering of long ": null
    },
    {
        "hair": "hair"
    },
    {
        ". They lived from the ": null
    },
    {
        "Pliocene": "pliocene"
    },
    {
        " epoch": "epoch"
    },
    {
        " into the ": null
    },
    {
        "Holocene": "holocene"
    },
    {
        " at about 4,000 years ago, and various species existed in Africa, Europe, Asia, and North America. They were members of the family ": null
    },
    {
        "Elephantidae": "elephantidae"
    },
    {
        ", which also contains the two genera of modern ": null
    },
    {
        "elephants": "elephant"
    },
    {
        "and their ancestors.     The oldest representative of Mammuthus, the ": null
    },
    {
        "South African mammoth": "mammuthus subplanifrons"
    },
    {
        " , appeared around 5 million years ago during the early ": null
    },
    {
        "Pliocene": "pliocene"
    },
    {
        " in what is now southern and eastern Africa. Descendant species of these mammoths moved north and continued to propagate into numerous subsequent species, eventually covering most of Eurasia before extending into the Americas at least 600,000 years ago. The last species to emerge, the ": null
    },
    {
        "woolly mammoth": "woolly mammoth"
    },
    {
        " , developed about 400,000 years ago in East Asia, with some surviving on Russias ": null
    },
    {
        "Wrangel Island": "wrangel island"
    },
    {
        " in the ": null
    },
    {
        "Arctic Ocean": "arctic ocean"
    },
    {
        " until as recently as roughly 3,700 to 4,000 years ago, still extant during the construction of the ": null
    },
    {
        "Great Pyramid": "great pyramid of giza"
    },
    {
        " of ": null
    },
    {
        "ancient Egypt": "ancient egypt"
    },
    {
        ".       The earliest known ": null
    },
    {
        "proboscideans": "proboscideans"
    },
    {
        ", the ": null
    },
    {
        "clade": "clade"
    },
    {
        " that contains the elephants, existed about 55 million years ago around the ": null
    },
    {
        "Tethys Sea": "tethys sea"
    },
    {
        " area. The closest relatives of the Proboscidea are the ": null
    },
    {
        "sirenians": "sirenians"
    },
    {
        " and the ": null
    },
    {
        "hyrax": "hyrax"
    },
    {
        "es. The family ": null
    },
    {
        "Elephantidae": "elephantidae"
    },
    {
        " is known to have existed six million years ago in Africa, and includes the living elephants and the mammoths. Among many now extinct clades, the ": null
    },
    {
        "mastodon": "mastodon"
    },
    {
        " is only a distant relative of the mammoths, and part of the separate ": null
    },
    {
        "Mammutidae": "mammutidae"
    },
    {
        " family, which diverged 25 million years before the mammoths evolved.      The following ": null
    },
    {
        "cladogram": "cladogram"
    },
    {
        " shows the placement of the genus Mammuthus among other proboscideans, based on ": null
    },
    {
        "hyoid": "hyoid"
    },
    {
        " characteristics:          Since many remains of each species of mammoth are known from several localities, it is possible to reconstruct the evolutionary history of the genus through morphological studies. Mammoth species can be identified from the number of enamel ridges on their molars; the primitive species had few ridges, and the amount increased gradually as new species evolved and replaced the former ones. At the same time, the crowns of the teeth became longer, and the skulls become higher from top to bottom and shorter from the back to the front over time to accommodate this.        The first known members of the genus Mammuthus are the African species  Mammuthus subplanifrons  from the ": null
    },
    {
        "Pliocene": "pliocene"
    },
    {
        " and  Mammuthus africanavus  from the ": null
    },
    {
        "Pleistocene": "pleistocene"
    },
    {
        ". The former is thought to be the ancestor of later forms. Mammoths entered Europe around 3 million years ago; the earliest known type has been named M. rumanus, which spread across Europe and China. Only its molars are known, which show it had 8–10 enamel ridges. A population evolved 12–14 ridges and split off from and replaced the earlier type, becoming  M. meridionalis . In turn, this species was replaced by the steppe mammoth,  M. trogontherii , with 18–20 ridges, which evolved in East Asia ca. 1 million years ago. Mammoths derived from M. trogontherii evolved molars with 26 ridges 200,000 years ago in Siberia, and became the ": null
    },
    {
        "woolly mammoth": "woolly mammoth"
    },
    {
        ", M. primigenius.  The Columbian mammoth,  M. columbi , evolved from a population of M. trogontherii that had entered North America. A 2011 genetic study showed that two examined specimens of the Columbian mammoth were grouped within a subclade of woolly mammoths. This suggests that the two populations interbred and produced fertile offspring. It also suggested that a North American form known as M. jeffersonii may be a hybrid between the two species.      By the late Pleistocene, mammoths in continental Eurasia had undergone a major transformation, including a shortening and heightening of the cranium and mandible, increase in molar hypsodonty index, increase in plate number, and thinning of dental enamel. Due to this change in physical appearance, it became customary to group European mammoths separately into distinguishable clusters:     Early Pleistocene – Mammuthus meridionalis   Middle Pleistocene – Mammuthus trogontherii   Late Pleistocene – Mammuthus primigenius     There is speculation as to what caused this variation within the three chronospecies. Variations in environment, climate change, and migration surely played roles in the evolutionary process of the mammoths. Take M. primigenius for example: Woolly mammoths lived in opened grassland biomes. The cool steppe-tundra of the Northern Hemisphere was the ideal place for mammoths to thrive because of the resources it supplied. With occasional warmings during the ice age, climate would change the landscape, and resources available to the mammoths altered accordingly.            The word mammoth was first used in Europe during the early 17th century, when referring to maimanto tusks discovered in Siberia.  John Bell, ": null
    },
    {
        "John Bell": "john bell"
    },
    {
        ", Travels from St Petersburg in Russia to diverse parts of Asia, Edinburgh, 1806, pages 383-386 who was on the ": null
    },
    {
        "Ob River": "ob river"
    },
    {
        " in 1722, said that mammoth tusks were well known in the area. They were called mammons horn and were often found in washed-out river banks. Some local people claimed to have seen a living mammoth, but they only came out at night and always disappeared under water when detected. He bought one and presented it to ": null
    },
    {
        "Hans Sloan": "hans sloan"
    },
    {
        " who pronounced it an elephants tooth.     The folklore of some native peoples of Siberia, who would routinely find mammoth bones, and sometimes frozen mammoth bodies, in eroding river banks, had various interesting explanations for these finds. Among the ": null
    },
    {
        "Khanty people": "khanty people"
    },
    {
        " of the ": null
    },
    {
        "Irtysh River": "irtysh river"
    },
    {
        " basin, a belief existed that the mammoth was some kind of a water spirit. According to other Khanty, the mammoth was a creature that lived underground, burrowing its tunnels as it went, and would die if it accidentally came to the surface.    The concept of the mammoth as an underground creature was known to the Chinese, who received some mammoth ivory from the Siberian natives; accordingly, the creature was known in China as yǐn shǔ 隐鼠, the hidden rodent . . Bertholdss source for the ": null
    },
    {
        "Irtysh Ostyaks": "khanty people"
    },
    {
        " belief is      ": null
    },
    {
        "Thomas Jefferson": "thomas jefferson"
    },
    {
        ", who famously had a keen interest in ": null
    },
    {
        "paleontology": "paleontology"
    },
    {
        ", is partially responsible for transforming the word mammoth from a noun describing the prehistoric elephant to an adjective describing anything of surprisingly large size. The first recorded use of the word as an adjective was in a description of a large wheel of cheese  given to Jefferson in 1802. Simpson, J. . . Oxford English Dictionary Online, Oxford University Press. Accessed 05-JUN-2009.          Like their modern relatives, mammoths were quite large. The largest known species reached heights in the region of  at the shoulder and weights of up to , while exceptionally large males may have exceeded . However, most species of mammoth were only about as large as a modern ": null
    },
    {
        "Asian elephant": "asian elephant"
    },
    {
        " . Both sexes bore tusks. A first, small set appeared at about the age of six months, and these were replaced at about 18 months by the permanent set. Growth of the permanent set was at a rate of about  per year.       Based on studies of their close relatives, the modern elephants, mammoths probably had a ": null
    },
    {
        "gestation": "gestation"
    },
    {
        " period of 22 months, resulting in a single calf being born. Their social structure was probably the same as that of ": null
    },
    {
        "African": "african elephant"
    },
    {
        " and Asian elephants, with females living in herds headed by a matriarch, whilst bulls lived solitary lives or formed loose groups after sexual maturity.      Scientists discovered and studied the remains of a mammoth calf, and found that fat greatly influenced its form, and enabled it to store large amounts of nutrients necessary for survival in temperatures as low as .  The fat also allowed the mammoths to increase their muscle mass, allowing the mammoths to fight against enemies and live longer.        Depending on the species or race of mammoth, the diet differed somewhat depending on location, although all mammoths ate similar things. For the Columbian mammoth,  M. columbi , the diet was mainly ": null
    },
    {
        "grazing": "grazing"
    },
    {
        ". American Columbian mammoths fed primarily on cacti leaves, trees, and shrubs. These assumptions were based on mammoth feces and mammoth teeth. Mammoths, like modern day elephants, have ": null
    },
    {
        "hypsodont molars": "molar hypsodont"
    },
    {
        ". These features also allowed mammoths to live an expansive life because of the availability of grasses and trees.      For the Mongochen mammoth, its diet consisted of herbs, grasses, larch, and shrubs, and possibly ": null
    },
    {
        "alder": "alder"
    },
    {
        ". These inferences were made through the observation of mammoth feces, which scientists observed contained non-arboreal pollen and moss spores.      European mammoths had a major diet of ": null
    },
    {
        "C3 carbon fixation": "c3 carbon fixation"
    },
    {
        " plants. This was determined by examining the isotopic data from the European mammoth teeth.      The arctic tundra and steppe where the mammoths lived appears to have been dominated by ": null
    },
    {
        "forb": "forb"
    },
    {
        "s, not grass. There were richer in protein and easier to digest than grasses and wooden plants, which came to dominate the areas when the climate became wetter and warmer. This could have been a major contributor to why the arctic megafauna went extinct.        The Yamal baby mammoth Lyuba, found in 2007 in the Yamal Peninsula in Western Siberia, suggests that baby mammoths, as do modern baby elephants, ate the dung of adult animals. The evidence to show this is that the dentition of the baby mammoth had not yet fully developed to chew grass. Furthermore, there was an abundance of ascospores of ": null
    },
    {
        "coprophilous fungi": "coprophilous fungi"
    },
    {
        " from the pollen spectrum of the babys mother. Coprophilous fungi are fungi that grow on animal dung and disperse spores in nearby vegetation, which the baby mammoth would then consume. Spores might have gotten into its stomach while grazing for the first few times. Coprophagy may be an ": null
    },
    {
        "adaptation": "adaptation"
    },
    {
        ", serving to populate the infants gut with the needed ": null
    },
    {
        "microbiome": "microbiome"
    },
    {
        " for digestion.     Mammoths alive in the ": null
    },
    {
        "Arctic": "arctic"
    },
    {
        " during the ": null
    },
    {
        "Last Glacial Maximum": "last glacial maximum"
    },
    {
        " consumed mainly ": null
    },
    {
        "forb": "forb"
    },
    {
        "s, such as  Artemisia ; ": null
    },
    {
        "graminoids": "graminoid"
    },
    {
        "were only a minor part of their diet.           The ": null
    },
    {
        "woolly mammoth": "woolly mammoth"
    },
    {
        "  was the last species of the genus. Most populations of the woolly mammoth in North America and Eurasia, as well as all the ": null
    },
    {
        "Columbian mammoths": "columbian mammoth"
    },
    {
        "  in North America, died out around the time of the last ": null
    },
    {
        "glacial retreat": "quaternary glaciation"
    },
    {
        ", as part of a ": null
    },
    {
        "mass extinction": "quaternary extinction event"
    },
    {
        " of ": null
    },
    {
        "megafauna": "pleistocene megafauna"
    },
    {
        " in northern Eurasia and the Americas. Until recently, the last woolly mammoths were generally assumed to have vanished from Europe and southern Siberia about 12,000 years ago, but new findings show some were still present there about 10,000 years ago. Slightly later, the woolly mammoths also disappeared from continental northern Siberia.  A small population survived on ": null
    },
    {
        "St. Paul Island, Alaska": "st. paul island, alaska"
    },
    {
        ", up until 3750  BC,    and the small  mammoths of ": null
    },
    {
        "Wrangel Island": "wrangel island"
    },
    {
        " survived until 1650  BC.   Recent research of sediments in Alaska indicates mammoths survived on the American mainland until 10,000 years ago.      A definitive explanation for their extinction has yet to be agreed upon. The warming trend that occurred 12,000 years ago, accompanied by a glacial retreat and rising sea levels, has been suggested as a contributing factor. Forests replaced open woodlands and grasslands across the continent. The available habitat would have been reduced for some megafaunal species, such as the mammoth. However, such climate changes were nothing new; numerous ": null
    },
    {
        "very similar": ":file:five myr climate change.png"
    },
    {
        " warming episodes": ":file:atmospheric co2 with glaciers cycles.gif"
    },
    {
        " had occurred previously within the ": null
    },
    {
        "ice age": "quaternary glaciation"
    },
    {
        " of the last several million years without producing comparable megafaunal extinctions, so climate alone is unlikely to have played a decisive role. The spread of advanced human hunters through northern ": null
    },
    {
        "Eurasia": "eurasia"
    },
    {
        " and the ": null
    },
    {
        "Americas": "americas"
    },
    {
        " around the time of the extinctions, however, was a new development, and thus might have contributed significantly.        Whether the general mammoth population died out for climatic reasons or due to ": null
    },
    {
        "overhunting": "overhunting"
    },
    {
        " by humans is controversial.  During the transition from the Late Pleistocene epoch to the Holocene epoch, there was shrinkage of the distribution of the mammoth because progressive warming at the end of the Pleistocene epoch changed the mammoths environment. The ": null
    },
    {
        "mammoth steppe": "mammoth steppe"
    },
    {
        " was a periglacial landscape with rich herb and grass vegetation that disappeared along with the mammoth because of environmental changes in the climate. Mammoths had moved to isolated spots in Eurasia, where they disappeared completely. Also, it is thought that Late Paleolithic and Mesolithic human hunters might have affected the size of the last mammoth populations in Europe.  There is evidence to suggest that humans did cause the mammoth extinction, although there is no definitive proof. It was found that humans living south of a mammoth steppe learned to adapt themselves to the harsher climates north of the steppe, where mammoths resided. It was concluded that if humans could survive the harsh north climate of that particular mammoth steppe then it was possible humans could hunt mammoths everywhere. Another hypothesis suggests mammoths fell victim to an infectious disease.   A combination of ": null
    },
    {
        "climate change": "climate change"
    },
    {
        " and hunting by humans may be a possible explanation for their extinction.  Homo erectus  is known to have consumed mammoth meat as early as 1.8 million years ago,  though this may mean only successful scavenging, rather than actual hunting. Later humans show greater evidence for hunting mammoths; mammoth bones at a 50,000-year-old site in South Britain suggest that ": null
    },
    {
        "Neanderthals": "neanderthals"
    },
    {
        " butchered the animals,  while various sites in Eastern Europe dating from 15,000 to 44,000 years old suggest humans  built dwellings using mammoth bones .  However, the ": null
    },
    {
        "American Institute of Biological Sciences": "american institute of biological sciences"
    },
    {
        " notes that bones of dead elephants, left on the ground and subsequently trampled by other elephants, tend to bear marks resembling butchery marks, which have allegedly been misinterpreted as such by ": null
    },
    {
        "archaeologists": "archaeology"
    },
    {
        ".      Many hypotheses also seek to explain the regional extinction of mammoths in specific areas. Scientists have speculated that the mammoths of ": null
    },
    {
        "Saint Paul Island": "saint paul island"
    },
    {
        ", an isolated enclave where mammoths survived until about 8,000 years ago, died out as the island shrank by 80–90% when sea levels rose, eventually making it too small to support a viable population.  Similarly, genome sequences of the Wrangel Island mammoths indicate a sharp decline in genetic diversity, though the extent to which this played a role in their extinction is still unclear.  Another hypothesis, said to be the cause of mammoth extinction in Siberia, comes from the idea that many may have drowned. While traveling to the Northern River, many of these mammoths broke through the ice and drowned. This also explains bones remains in the Arctic Coast and islands of the New Siberian Group.     ": null
    },
    {
        "Dwarfing": "insular dwarfism"
    },
    {
        " occurred with the ": null
    },
    {
        "pygmy mammoth": "pygmy mammoth"
    },
    {
        " on the outer ": null
    },
    {
        "Channel Islands of California": "channel islands of california"
    },
    {
        ", but at an earlier period. Those animals were very likely killed by early Paleo-Native Americans, and habitat loss caused by a rising sea level that split ": null
    },
    {
        "Santa Rosae": "santa rosae"
    },
    {
        " into the outer Channel Islands.           An estimated 150 million mammoths are buried in the frozen Siberian tundra.  One proposed scientific use of this preserved genetic material, is to recreate living mammoths. This has long been discussed theoretically but has only recently become the subject of formal effort due to advances in ": null
    },
    {
        "molecular biology": "molecular biology"
    },
    {
        " techniques and cloning of mammals. . BBC News, 23 April 2015. .      According to one research team, a mammoth cannot be recreated, but they will try to eventually grow in an artificial womb a hybrid elephant with some woolly mammoth traits. . BBC News. Helen Pilcher, 22 February 2017. . Gregory E. Kaebnick, and Bruce Jennings. The Hastings Center Report. 26 July 2017 Comparative genomics shows that the mammoth genome matches 99% of the elephant genome, so some researchers aim to engineer an elephant with some mammoth genes that code for the external appearance and traits of a mammoth. Pennsylvania State University . Accessed: October 2018. The outcome would be an elephant-mammoth hybrid with no more than 1% mammoth genes. And now separate projects are working on gradually adding mammoth genes to elephant cells in vitro. . National Geographic Channel.       Mammoths live alongside humans in the fictional world of the ": null
    },
    {
        "A Song of Ice and Fire": "a song of ice and fire"
    }
]