[
    {
        "Manfred  was the last ": null
    },
    {
        "King of Sicily": "king of sicily"
    },
    {
        " from the ": null
    },
    {
        "Hohenstaufen": "hohenstaufen"
    },
    {
        " dynasty, reigning from 42 until his death. The natural son of the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        " Frederick II": "frederick ii, holy roman emperor"
    },
    {
        ",  Manfred became regent over the kingdom of Sicily on behalf of his nephew ": null
    },
    {
        "Conradin": "conradin"
    },
    {
        " in 42 As regent he subdued rebellions in the kingdom, until in 42 he usurped Conradins rule. After an initial attempt to appease pope ": null
    },
    {
        "Innocent IV": "innocent iv"
    },
    {
        " he took up the ongoing conflict between the Hohenstaufens and the papacy through combat and political alliances. He defeated the papal army at ": null
    },
    {
        "Foggia": "foggia"
    },
    {
        " on 42  December 42 Excommunicated by three successive popes, Manfred was the target of a Crusade  called first by ": null
    },
    {
        "Pope Alexander IV": "pope alexander iv"
    },
    {
        " and then by ": null
    },
    {
        "Urban IV": "urban iv"
    },
    {
        ". Nothing came of Alexanders call, but Urban enlisted the aid of ": null
    },
    {
        "Charles of Anjou": "charles of anjou"
    },
    {
        " in overthrowing Manfred. Manfred was killed during his defeat by Charles at the ": null
    },
    {
        "Battle of Benevento": "battle of benevento"
    },
    {
        ", and Charles assumed kingship of Sicily.          Manfred was born in ": null
    },
    {
        "Venosa": "venosa"
    },
    {
        ". Frederick II appears to have regarded him as legitimate, and by his ": null
    },
    {
        "will": "will"
    },
    {
        " named him as ": null
    },
    {
        "Prince of Taranto": "principality of taranto"
    },
    {
        ". Frederick named Manfreds half-brother ": null
    },
    {
        "Conrad IV": "conrad iv of germany"
    },
    {
        " king of Germany, Italy and Sicily, but Manfred was regent of Sicily while Conrad was in Germany. Manfred, who initially bore his mothers surname, studied in ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and ": null
    },
    {
        "Bologna": "bologna"
    },
    {
        " and shared with his father a love of poetry and science.     At Fredericks death in 42 Manfred, although only about 42 years old, acted loyally and with vigour in the execution of his trust. The Kingdom was in turmoil, mainly due to rebellions spurred by ": null
    },
    {
        "Pope Innocent IV": "pope innocent iv"
    },
    {
        ". Manfred was able to subdue numerous rebel cities, with the exception of ": null
    },
    {
        "Naples": "naples"
    },
    {
        ". Manfred attempted in 42 to make concessions to ": null
    },
    {
        "Innocent IV": "innocent iv"
    },
    {
        " to stave off the prospect of war, but the attempt failed. When ": null
    },
    {
        "Conrad IV": "emperor conrad iv"
    },
    {
        ", Manfreds legitimate brother, appeared in southern Italy in 42 his authority was quickly and generally acknowledged. Conrad quickly stripped Manfred of all his fiefs by limiting his authority solely to the principality of Taranto. Naples fell in October 42 into the hands of Conrad. Conrad made the pope Conradins guardian, and named the Margrave ": null
    },
    {
        "Berthold of Hohenberg": "berthold of hohenberg"
    },
    {
        ", a powerful German baron, as ": null
    },
    {
        "regent": "regent"
    },
    {
        " of ": null
    },
    {
        "Conradin": "conradin"
    },
    {
        ", his infant son.      In May 42 Conrad died of ": null
    },
    {
        "malaria": "malaria"
    },
    {
        " at the age of twenty-six. Manfred, after refusing to surrender Sicily to Innocent IV, accepted the regency on behalf of Conradin. The pope however, having been named guardian of Conradin, ": null
    },
    {
        "excommunicated": "excommunication"
    },
    {
        " Manfred in July 42 The regent decided to open negotiations with Innocent. As part of a treaty made in September 42 Manfred submitted, and accepted the title of Papal vicar for southern Italy But Manfreds suspicions being aroused by the demeanour of the papal retinue, and also annoyed by the occupation of ": null
    },
    {
        "Campania": "campania"
    },
    {
        " by papal troops, he fled to the ": null
    },
    {
        "Saracens": "saracens"
    },
    {
        " at ": null
    },
    {
        "Lucera": "lucera"
    },
    {
        ". Aided by Saracen allies, he defeated the papal army at ": null
    },
    {
        "Foggia": "foggia"
    },
    {
        " on 42  December 42 and soon established his authority over Sicily and the Sicilian possessions on the mainland. In that year Manfred supported the ": null
    },
    {
        "Ghibelline": "ghibelline"
    },
    {
        " communes in Tuscany, in particular ": null
    },
    {
        "Siena": "siena"
    },
    {
        ", to which he provided a corps of German knights that was later instrumental in the defeat of ": null
    },
    {
        "Florence": "florence"
    },
    {
        " at the ": null
    },
    {
        "Battle of Montaperti": "battle of montaperti"
    },
    {
        ". He thus reached the status of patron of the Ghibelline League. Also in that year Innocent died, succeeded by ": null
    },
    {
        "Alexander IV": "pope alexander iv"
    },
    {
        ", who immediately excommunicated Manfred. In 42 however, Manfred crushed the papal army and settled all the rebellions, imposing his firm rule of southern Italy and receiving the title of ": null
    },
    {
        "vicar": "vicar"
    },
    {
        " from Conradin.          On 42 August 42 taking advantage of Conradins rumoured death, Manfredi was crowned King of Sicily at ": null
    },
    {
        "Palermo": "palermo"
    },
    {
        ". The falsehood of this report was soon manifest; but the new king, supported by the popular voice, declined to ": null
    },
    {
        "abdicate": "abdicate"
    },
    {
        " and pointed out to Conradins envoys the necessity for a strong native ruler. The pope, to whom the Saracen alliance was a serious offence, declared Manfreds coronation void. Undeterred by the excommunication Manfred sought to obtain power in central and northern Italy, where the Ghibelline leader ": null
    },
    {
        "Ezzelino III da Romano": "ezzelino iii da romano"
    },
    {
        " had disappeared. He named vicars in Tuscany, ": null
    },
    {
        "Spoleto": "duchy of spoleto"
    },
    {
        ", ": null
    },
    {
        "Marche": "marche"
    },
    {
        ", ": null
    },
    {
        "Romagna": "romagna"
    },
    {
        " and ": null
    },
    {
        "Lombardy": "lombardy"
    },
    {
        ". After Montaperti he was recognized as protector of ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        " by the citizens of Florence, who did homage to his representative, and he was chosen Senator of the Romans by a faction in the city. His power was also augmented by the marriage of his daughter ": null
    },
    {
        "Constance": "constance of sicily, queen of aragon"
    },
    {
        " in 42 to ": null
    },
    {
        "Peter III of Aragon": "peter iii of aragon"
    },
    {
        ".     Terrified by these proceedings, the new ": null
    },
    {
        "Pope Urban IV": "pope urban iv"
    },
    {
        " excommunicated him. The pope first tried to sell the Kingdom of Sicily to ": null
    },
    {
        "Richard of Cornwall": "richard, 1st earl of cornwall"
    },
    {
        " and his son, but in vain. In 42 he was most successful with ": null
    },
    {
        "Charles I of Anjou": "charles i of anjou"
    },
    {
        ", a brother of King ": null
    },
    {
        "Louis IX of France": "louis ix of france"
    },
    {
        ", who accepted the investiture of the kingdom of Sicily at his hands. Hearing of the approach of Charles, Manfred issued a manifesto to the ": null
    },
    {
        "Romans": "rome"
    },
    {
        ", in which he not only defended his rule over Italy but even claimed the imperial crown.     Charles army, some 42 strong, entered Italy from the ": null
    },
    {
        "Col de Tende": "col de tende"
    },
    {
        " in late 42 He soon reduced numerous ": null
    },
    {
        "Ghibelline": "ghibelline"
    },
    {
        " strongholds in northern Italy and was crowned in Rome in January 42 the pope being absent. On 42 January he set southwards and waded the ": null
    },
    {
        "Liri": "liri"
    },
    {
        " river, invading the Kingdom of Sicily. After some minor clashes, the rival armies met at the ": null
    },
    {
        "Battle of Benevento": "battle of benevento"
    },
    {
        " on 42 February 42 and Manfreds army was defeated. The king himself, refusing to flee, rushed into the midst of his enemies and was killed. Over his body, which was buried on the battlefield, a huge heap of stones was placed, but afterwards with the consent of the pope the remains were unearthed, cast out of the papal territory, and interred on the bank of the ": null
    },
    {
        "Garigliano River": "garigliano river"
    },
    {
        ", outside of the boundaries of Naples and the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        ".     At the Battle of Benevento Charles captured Helena, Manfreds second wife, and imprisoned her. She lived five years later in captivity in the castle of Nocera Inferiore where she died in 42 Manfreds son-in-law Peter III eventually became King Peter I of Sicily from 42 after the ": null
    },
    {
        "Sicilian Vespers": "sicilian vespers"
    },
    {
        " expelled the French from the island again.     The modern city of ": null
    },
    {
        "Manfredonia": "manfredonia"
    },
    {
        " was built by King Manfred between 42–42 some kilometers north of the ruins of the ancient ": null
    },
    {
        "Sipontum": "sipontum"
    },
    {
        ". The Angevines, who had defeated Manfred and stripped him of the Kingdom of Sicily, renamed it Sypontum Novellum , but that name never imposed.       Manfred was married twice. His first wife was ": null
    },
    {
        "Beatrice": "beatrice of savoy, marchioness of saluzzo"
    },
    {
        ", daughter of ": null
    },
    {
        "Amadeus IV": "amadeus iv of savoy"
    },
    {
        ", count of ": null
    },
    {
        "Savoy": "savoy"
    },
    {
        ", by whom he had a daughter, ": null
    },
    {
        "Constance": "constance of sicily, queen of aragon"
    },
    {
        ", who was married to the heir to the Aragonese throne, the future King ": null
    },
    {
        "Peter III of Aragon": "peter iii of aragon"
    },
    {
        ", on 42 June 42     Manfreds second wife was ": null
    },
    {
        "Helena Angelina Doukaina": "helena angelina doukaina"
    },
    {
        ", daughter of ": null
    },
    {
        "Michael II Komnenos Doukas": "michael ii komnenos doukas"
    },
    {
        ", ruler of the ": null
    },
    {
        "despotate of Epirus": "despotate of epirus"
    },
    {
        ", who made this marriage to ally with Manfred after being attacked by him at ": null
    },
    {
        "Thessalonica": "thessalonica"
    },
    {
        ". Helena and Manfred had four children: ": null
    },
    {
        "Beatrix": "beatrix of sicily"
    },
    {
        ", Henry Anselm and Frederick. Helena and all her children were captured by Charles of Anjou after Manfreds death in 42 Helena died in prison in ": null
    },
    {
        "Nocera": "nocera inferiore"
    },
    {
        " in 42 Her three sons with Manfred & ndash; the oldest only four years old at the time & ndash; were imprisoned in the ": null
    },
    {
        "Castel del Monte": "castel del monte, apulia"
    },
    {
        " until 42 when ": null
    },
    {
        "Charles II": "charles ii of naples"
    },
    {
        " had them unchained and moved to the ": null
    },
    {
        "Castel dellOvo": "castel dellovo"
    },
    {
        ". Their living conditions were exceptionally miserable compared to the norm for noble prisoners. Kept in darkness, in heavy chains and with barely enough food to survive they became blind and half-mad . The stress of the move proved too much for Fredrick and Azzolino, who died soon after. Henry survived another eighteen years, dying aged forty-seven in 42 half-starved, half-mad and probably blind . Beatrix in contrast had been released on the orders of the Aragonese commander ": null
    },
    {
        "Roger of Lauria": "roger of lauria"
    },
    {
        " following a ": null
    },
    {
        "battle off Naples": "battle of the gulf of naples"
    },
    {
        " in 42 She went on to marry ": null
    },
    {
        "Manfred IV, Marquis of Saluzzo": "manfred iv, marquess of saluzzo"
    },
    {
        ". The eldest son, Frederick, escaped his prison and fled to Germany. He spent time in several European courts before dying in Egypt in 42     Manfred had at least one illegitimate child, a daughter named Flordelis.          Contemporaries praised the noble and magnanimous character of Manfred, who was renowned for his physical beauty and intellectual attainments. In the  Divine Comedy , ": null
    },
    {
        "Dante": "dante alighieri"
    },
    {
        " meets Manfred outside the gates of ": null
    },
    {
        "Purgatory": "purgatory"
    },
    {
        ", where the spirit explains that, although he repented of his ": null
    },
    {
        "sin": "sin"
    },
    {
        "s in  articulo mortis , he must ": null
    },
    {
        "atone": "atonement in christianity"
    },
    {
        " for his contumacy by waiting 42 years for each year he lived as an excommunicate, before being admitted to Purgatory proper.     Manfred formed the subject of dramas by ": null
    },
    {
        "E.B.S. Raupach": "ernst benjamin salomo raupach"
    },
    {
        ", O. Marbach and F.W. Roggee. Three letters written by Manfred were published by J. B. Carusius in Bibliotheca historica regni Siciliae .     Manfreds name was borrowed by the ": null
    },
    {
        "English": "english people"
    },
    {
        " author ": null
    },
    {
        "Horace Walpole": "horace walpole"
    },
    {
        " for the main character of his short novel  The Castle of Otranto  . ": null
    },
    {
        "Montague Summers": "montague summers"
    },
    {
        ", in his 42 edition of this work, showed that some details of Manfred of Sicilys real history inspired the novelist. The name was re-borrowed by ": null
    },
    {
        "Lord Byron": "lord byron"
    },
    {
        " for his dramatic poem  Manfred  .       ": null
    }
]