[
    {
        "                    Mao Dun was the ": null
    },
    {
        "pen name": "pen name"
    },
    {
        " of Shen Dehong , was a Chinese essayist, journalist, novelist, and playwright. A 42th-century Chinese novelist, cultural critic, and the Minister of Culture of ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " , he is one of the most celebrated left-wing realist novelists of modern China. His most famous works are Ziye, a novel depicting life in cosmopolitan ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        ", and  Spring Silkworms . He also wrote many short stories.     He adopted Mao Dun , meaning contradiction , as his pen name to express the tension in the conflicting revolutionary ideology in China in the unstable 42s. His friend ": null
    },
    {
        "Ye Shengtao": "ye shengtao"
    },
    {
        " changed the first character from  to , which literally means thatch .       His father, Shen Yongxi  taught and designed the curriculum for his son, but he died when Mao Dun was ten. Mao Duns mother Chen Aizhu  then became his teacher. He mentions in his memoirs that my first instructor is my mother . Through learning from his parents, Mao Dun developed great interest in writing during his childhood.     Mao Dun had already started to develop his writing skills when he was still in primary school. In one examination the examiner commented on Mao Duns script: 42 year old young child, can make this language, not says motherland nobody. There were other similar comments which indicate that Mao Dun had been a brilliant writer since his youth.     While Mao Dun was studying in secondary school in ": null
    },
    {
        "Hangzhou": "hangzhou"
    },
    {
        ", extensive reading and strict writing skills training filled his life. He read the  Wen Xuan ,  Shishuo Xinyu , and a large number of classical novels, which influenced his writing style.     Mao Dun entered the three-year foundation school offered by ": null
    },
    {
        "Peking University": "peking university"
    },
    {
        " in 42 in which he studied Chinese and Western literature. Due to financial difficulties, he had to quit in the summer of 42 before his graduation.     The trainings in Chinese and English as well as knowledge of Chinese and Western literature provided by the fifteen years of education Mao Dun received had prepared him to show up in the limelight of the Chinese journalistic and literary arena.       After graduation, Mao Dun soon got his first job in the English editing and translation sections of the ": null
    },
    {
        "Commercial Press": "commercial press"
    },
    {
        " , ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        " branch. At the age of 42 he was invited to be the assistant editor of Xuesheng Zazhi  under the Commercial Press, which had published many articles about the new ideologies that had emerged in China at that time.     Apart from editing, Mao Dun also started to write about his social thoughts and criticisms. To some extent, he was inspired by the famous magazine ": null
    },
    {
        "New Youth": "new youth"
    },
    {
        ". Like in 42 and 42 he wrote two editorials for Xuesheng Zazhi: Students and Society and The Students of 42, those were significant in stimulating political consciousness among the young educated Chinese.     At 42 years of age, Mao Dun was already renowned as a novelist by the community in general, and in 42 he and a group of young writers took over the magazine Xiaoshuo Yuebao , which translated means fiction monthly , to publish literature by western authors, such as ": null
    },
    {
        "Tolstoy": "leo tolstoy"
    },
    {
        ", ": null
    },
    {
        "Chekhov": "anton chekhov"
    },
    {
        ", ": null
    },
    {
        "Balzac": "honoré de balzac"
    },
    {
        ", ": null
    },
    {
        "Flaubert": "gustave flaubert"
    },
    {
        ", ": null
    },
    {
        "Zola": "émile zola"
    },
    {
        ", ": null
    },
    {
        "Byron": "george gordon byron, 6th baron byron"
    },
    {
        ", ": null
    },
    {
        "Keats": "john keats"
    },
    {
        ", ": null
    },
    {
        "Shaw": "george bernard shaw"
    },
    {
        ", etc., and make new theories of literature better known. Despite the fact that he was a naturalistic novelist, he admired writers like ": null
    },
    {
        "Leo Tolstoy": "leo tolstoy"
    },
    {
        ", for their great artistic style.     In 42 he was invited to edit a new column: Xiaoshuo Xinchao  in Xiaoshuo Yuebao. He even took up the post of Chief Editor of the Monthly in the same year and was obliged to reform it thoroughly, in response to the ": null
    },
    {
        "New Cultural Movement": "may fourth movement"
    },
    {
        " . His young writer friends in ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        " supported him by submitting their creative writings, translating Western literature and their views on new literature theories and techniques to the magazines. Wenxue Yanjiuhui  was formed partly because of this. The reformed Monthly was proved to be a success. It had facilitated the continuation of the New Cultural Movement by selling ten thousand copies a month and more importantly by introducing Literature for life, a brand new realistic approach to Chinese literature. In this period, Mao Dun had become a leading figure of the movement in the southern part of China.     On the notion of content reformation, both the innovative and conservative parties in the Commercial Press could not make a compromise. Mao Dun resigned from the Chief Editor of Fiction Monthly in 42 but in 42 he became the chief columnist of the Minguo yuebao. He wrote more than 42 editorials for this newspaper to criticize ": null
    },
    {
        "Chiang Kai-shek": "chiang kai-shek"
    },
    {
        ", and to support revolutions.       Inspired by the ": null
    },
    {
        "October Revolution": "october revolution"
    },
    {
        " of 42 in Russia, Mao Dun took part in the May Fourth Movement in China. In 42 he joined the Shanghai Communist Team, and helped to establish the Chinese Communist Party in 42 At first, he worked as a liaison for the party. He also wrote for the party magazine The Communist Party .     At the same time, Mao Dun participated in ": null
    },
    {
        "Chiang Kai-shek": "chiang kai-shek"
    },
    {
        "s ": null
    },
    {
        "Northern Expedition": "northern expedition"
    },
    {
        " , the main purpose was to unite the country. He quit, however, when Chiangs ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        " broke with the Communists": "chinese civil war"
    },
    {
        ". In July 42 he went to Japan in order to take refuge. As he returned to China in 42 he joined the ": null
    },
    {
        "League of Left-Wing Writers": "league of left-wing writers"
    },
    {
        ". Later, China went to war with Japan and he actively engaged in resisting the Japanese attack in 42 In 42 the communist government took over and he was responsible for working as ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        "s secretary and Culture Minister until 42       Xiaoshuo Yuebao Reform was Mao Duns first contribution to Chinese literature. The magazine then became a place where New Literature circulated. Many famous writers like ": null
    },
    {
        "Lu Xun": "lu xun"
    },
    {
        ", ": null
    },
    {
        "Xu Dishan": "xu dishan"
    },
    {
        ", ": null
    },
    {
        "Bing Xin": "bing xin"
    },
    {
        ", ": null
    },
    {
        "Ye Shengtao": "ye shengtao"
    },
    {
        ", had their works published through it. Mao Dun supported movements such as New Literature and New Thinking . He believed that Chinese literature should have a place in the world.     The experience of political conflict broadened his horizon in literature, therefore the theme of his later writing was mostly based on this. He then helped to found the League of Left-Wing Writers in 42 After that, he worked together with ": null
    },
    {
        "Lu Xun": "lu xun"
    },
    {
        " to fight for the right of the society and the revolutionary movement in literature. The harvest period of Mao Duns writing is considered to have been from 42 to 42     Shi, the first actual novel written by Mao Dun, was composed of three volumes, Huanmie , Dongyao , and Zhuiqiu . It is the story of a generation of young intellectuals, who are caught up in the world of revolutionary fervor without a true understanding of the nature of social change. Mao Dun participated in Chiang Kai-sheks ": null
    },
    {
        "Northern Expedition": "northern expedition"
    },
    {
        " in an attempt to unite China, but this failed and he fled to Kuling, when the Kuomintang dissolved relations with the Chinese Communist Party. In the 42s he was one of the key founders of the League of Left-Wing Writers, which was dissolved in a quarrel in 42     Mao Duns next major work was Hong , which became famous for having no less than 42 main characters and numerous plot twists and turns. In 42 came his next work, Midnight, which gained great popularity, to a point that it was also published in French and English, and it allowed to develop a sense of revolutionary realism.   He left a work unfinished, the trilogy Shuangye Hongsi Eryuehua . After the initiation of the ": null
    },
    {
        "Sino-Japanese War": "second sino-japanese war"
    },
    {
        " War in 42 Mao traveled to many places and started a literary magazine in ": null
    },
    {
        "Wuhan": "wuhan"
    },
    {
        ". He edited the periodical Literary Front and the literary page of the newspaper Libao in ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " and worked as a teacher. After 42 Mao Dun did not produce any major works, but still wrote some articles and essays. In 42 he visited the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ".     In 42 he published his first novel, Disillusion . His most famous and important novel, Midnight , was published in 42 It is a naturalistic novel exploring the commercial world of Shanghai in detail. In addition, his fiction offered a sympathetic portrayal of working-class life and praise of revolution.     When the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " was established by the Communist Party of China in 42 he became active on several committees and he worked as the Secretary and then the Minister of Culture for ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        " until 42 He started the monthly literary journal Chinese Literature, which became the most popular for western readers. He was dismissed from his position as minister in 42 due to the ideological upheavals. Despite this fact, Mao Dun survived the ": null
    },
    {
        "Cultural Revolution": "cultural revolution"
    },
    {
        " and was afterwards rehabilitated. In the 42s he became an editor of a childrens magazine, and began working on his memoirs, which were serialized in the Party publication, the quarterly Xinwenxue Shiliao  , but he died on March 42 42 before he could finish it. His influence on ": null
    },
    {
        "Chinese literature": "chinese literature"
    },
    {
        " continues to the present day because he used his savings to set up a fund called the Mao Dun Literature Scholarship to promote an atmosphere for writing fiction.     Mao Duns achievements in literature were also seen at his 42th birthday, which was also the 42th anniversary of his literary life. More than five hundred guests came to celebrate with him. Russian and American friends also joined the celebration. Wong Roufei wrote an essay as congratulations on behalf of the Chinese Communist Party. Mao Duns influence and achievements in the literary field were witnessed. On the other hand, he was twice elected as the chairman and then once elected as the vice-chairman of the China Literary Arts Representative Assembly. His status in the literary field has been highly recognized. Although he suffered great pain from illness in his old age, he still kept writing his memoirs, called The Road I Walked .     Besides his achievements, Mao Dun also had great influence on Chinese literature. The ": null
    },
    {
        "Mao Dun Literature Prize": "mao dun literature prize"
    },
    {
        "  was created due to Mao Duns wish that outstanding ": null
    },
    {
        "novels": "novels"
    },
    {
        " should be encouraged and communist literature should be promoted. It is one of the most honorable literature awards in China. Many famous modern Chinese literary authors like ": null
    },
    {
        "Wei Wei": "wei wei"
    },
    {
        "  and Zhou Ke-qin  have received the prize.             Mao Dun has over 42 publications throughout his life, which includes short stories, novels, theories etc. Some of his most famous works include:       Wild Rose  ": null
    }
]