[
    {
        "           In the  Star Trek  ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " franchise, the Maquis  are a 24th-century ": null
    },
    {
        "paramilitary organization": "paramilitary organization"
    },
    {
        "-": null
    },
    {
        "terrorist": "terrorism"
    },
    {
        " group  first introduced in the 1994 episode ": null
    },
    {
        "The Maquis": "the maquis"
    },
    {
        " of the television series  Star Trek: Deep Space Nine , and subsequently appearing in  Star Trek: The Next Generation  and  Star Trek: Voyager . The Maquis story debuted when three Star Trek television shows running from the late 1980s to 2001 took place in the same fictional science-fiction universe at the same time in the future . As a result, the Maquis story was told across dozens of episodes with many more shows providing the context in the wider Star Trek narrative.     The Maquis are also featured in the comic book saga  The Maquis: Soldier of Peace  by ": null
    },
    {
        "Malibu Comics": "malibu comics"
    },
    {
        ", who held the rights to Deep Space Nine comics in the 1990s.   The Maquis are an important part of Star Trek: Voyager, as the formative plot for the series is that a Federation and a Maquis crew are stranded together on the opposite side of the Galaxy.  The Maquis are also in the book series The Badlands by ": null
    },
    {
        "Susan Wright": "susan wright"
    },
    {
        ", who also has written many other non-canon Trekiverse novels published by ": null
    },
    {
        "Pocket Books": "pocket books"
    },
    {
        ".       The concept of the Maquis was introduced by the creators of Deep Space Nine so that it could play a role in the upcoming Voyager, which was scheduled to begin airing in 1995. As ": null
    },
    {
        "Jeri Taylor": "jeri taylor"
    },
    {
        " commented, we knew that we wanted to include a renegade element in Voyager, and that the show would involve a ship housing both ": null
    },
    {
        "Starfleet": "starfleet"
    },
    {
        " people and those idealistic freedom fighters that the Federation felt were outlaws  Therefore, the creators of Star Trek decided to create a backstory for the Maquis in several episodes of Deep Space Nine and The Next Generation, and they named them after the ": null
    },
    {
        "French guerrilla fighters of the Second World War": "maquis"
    },
    {
        ". The recurring characters of ": null
    },
    {
        "Michael Eddington": "michael eddington"
    },
    {
        "  in Deep Space Nine and ": null
    },
    {
        "Ro Laren": "ro laren"
    },
    {
        "  in The Next Generation became members of the Maquis, and Voyager contained three regular former Maquis characters: ": null
    },
    {
        "Chakotay": "chakotay"
    },
    {
        " , ": null
    },
    {
        "BElanna Torres": "belanna torres"
    },
    {
        " , and ": null
    },
    {
        "Tom Paris": "tom paris"
    },
    {
        " ; as well as recurring character ": null
    },
    {
        "Seska": "seska"
    },
    {
        " .     In ": null
    },
    {
        "Caretaker": "caretaker"
    },
    {
        " , the pilot episode of Star Trek: Voyager, the ": null
    },
    {
        "titular starship": "uss voyager"
    },
    {
        " pursues a Maquis ship into the ": null
    },
    {
        "Badlands": "list of star trek regions of spacebadlands"
    },
    {
        " before being teleported to the ": null
    },
    {
        "Delta Quadrant": "galactic quadrants delta quadrant"
    },
    {
        ".           According to the fictional storyline of the Star Trek universe, the Maquis were formed in the 24th century after a peace treaty was enacted between the ": null
    },
    {
        "United Federation of Planets": "united federation of planets"
    },
    {
        " and the ": null
    },
    {
        "Cardassian Union": "cardassian union"
    },
    {
        ", redesignating the demilitarized zone between the two powers, which resulted in the Federation ceding several of their colony worlds to the Cardassians. Although the colonists were offered free relocation to elsewhere in Federation territory, some insisted on remaining on the ceded worlds, effectively becoming Cardassian Union citizens. Some of these colonists subsequently formed the Maquis to protect themselves from Cardassian aggression, although they received no official support from the Federation, who feared breaking the peace treaty with the Cardassians, which would lead to war.     Nonetheless, various Federation members supported the Maquis cause, and illegally helped to supply them with weapons and other technology that they could use in their struggle. In several cases, the Federation actually intervened in the war between the Maquis and the Cardassians, aiding the latter in recognition of the peace treaty. In one case, the Federation ship  tracked a Maquis vessel to the Badlands with the intention of apprehending it, but an alien force transported both to the Delta Quadrant, on the opposite side of the ": null
    },
    {
        "Milky Way Galaxy": "milky way galaxy"
    },
    {
        ". The two crews were forced to unite to survive against alien threats such as the ": null
    },
    {
        "Kazon": "kazon"
    },
    {
        " and the ": null
    },
    {
        "Borg": "borg"
    },
    {
        ". In later years, when the Cardassians joined the ": null
    },
    {
        "Dominion": "dominion"
    },
    {
        " to fight in the ": null
    },
    {
        "Dominion War": "dominion war"
    },
    {
        " against the Federation, the Dominion aided the Cardassian military in wiping out the Maquis, a prelude to their war against the Federation and its allies.     The Maquis provide moral challenges to existing characters such as Quark and Sisko on Deep Space Nine station.  Quark is lured into selling weapons to the Maquis by an attractive ": null
    },
    {
        "Vulcan": "vulcan"
    },
    {
        " woman, showing how his desire for money unwittingly turned him into an illegal arms dealer. Sisko must navigate the internal politics of the Cardassians and Federation as he tries to uphold the peace treaty, in addition to being tested by his old friend trying to recruit him into the rebellion.       Background:     The Cardassians were previously introduced on Star Trek The Next Generation in January 1991 with the episode The Wounded which lays some of the foundation for the Maquis story as does the story arc of Ensign Ro, introduced on The Next Generation in the fall of 1991     ": null
    },
    {
        "The Wounded": "the wounded"
    },
    {
        " introduces the Cardassians and the Federation-Cardassian peace treaty   ": null
    },
    {
        "Ensign Ro": "ensign ro"
    },
    {
        " Introduces Bajoran character ": null
    },
    {
        "Ro Laren": "ro laren"
    },
    {
        " Chain of Command": "chain of command"
    },
    {
        " further develops Cardassian-Federation relationship   ": null
    },
    {
        "Duet": "duet"
    },
    {
        " further develops Cardassian-Bajor story   ": null
    },
    {
        "Journeys End": "journeys end"
    },
    {
        " background on the Federation-Cardassian peace treaty     Maquis-focused episodes:   ": null
    },
    {
        "The Maquis, Part I and Part II": "the maquis"
    },
    {
        "    Preemptive Strike": "preemptive strike"
    },
    {
        "   Tribunal": "tribunal"
    },
    {
        "   Defiant": "defiant"
    },
    {
        "   Caretaker": "caretaker"
    },
    {
        "   Heart of Stone": "heart of stone"
    },
    {
        "    Learning Curve": "learning curve"
    },
    {
        "   Dreadnought": "dreadnought"
    },
    {
        " Aftermath of Maquis-Cardassian war   ": null
    },
    {
        "For the Cause": "for the cause"
    },
    {
        "   For the Uniform": "for the uniform"
    },
    {
        "   Blaze of Glory": "blaze of glory"
    },
    {
        " Could be considered the end of the Maquis story arc   ": null
    },
    {
        "Worst Case Scenario": "worst case scenario"
    },
    {
        "   Repression": "repression"
    },
    {
        " Introduces Maquis member Teero     Other Voyager and Deep Space Nine shows contribute to the Maquis story          Various members of the Maquis are characters in TNG, DS9, and Voyager, although membership is sometimes transitory and as revealed by the Maquis saga, for example some are revealed as Federation agents. The reveal of a characters identity is common plot device throughout the storyline. Many episodes play on these questions     Examples:   ": null
    },
    {
        "BElanna Torres": "belanna torres"
    },
    {
        "    Chakotay": "chakotay"
    },
    {
        ", commands Maquis space vessel.     ": null
    },
    {
        "Calvin Hudson": "calvin hudson"
    },
    {
        "    Macias": "preemptive strike"
    },
    {
        "    Michael Eddington": "michael eddington"
    },
    {
        " ": null
    }
]