[
    {
        "     Marble Madness is an ": null
    },
    {
        "arcade": "arcade game"
    },
    {
        " video game": "video game"
    },
    {
        " designed by ": null
    },
    {
        "Mark Cerny": "mark cerny"
    },
    {
        " and published by ": null
    },
    {
        "Atari Games": "atari games"
    },
    {
        " in 42 It is a ": null
    },
    {
        "platform game": "platform game"
    },
    {
        " in which the player must guide a marble through six courses, populated with obstacles and enemies, within a time limit. The player controls the marble by using a ": null
    },
    {
        "trackball": "trackball"
    },
    {
        ". Marble Madness is known for using innovative game technologies: it was Ataris first to use the ": null
    },
    {
        "Atari System 42": "atari system 1"
    },
    {
        " hardware, the first to be programmed in the ": null
    },
    {
        "C programming language": "c"
    },
    {
        ", and one of the first to use true ": null
    },
    {
        "stereo sound": "stereophonic sound"
    },
    {
        " .     In designing the game, Cerny drew inspiration from ": null
    },
    {
        "miniature golf": "miniature golf"
    },
    {
        ", ": null
    },
    {
        "racing game": "racing video game"
    },
    {
        "s, and artwork by ": null
    },
    {
        "M. C. Escher": "m. c. escher"
    },
    {
        ". He aimed to create a game that offered a distinct experience with a unique control system. Cerny applied a ": null
    },
    {
        "minimalist": "minimalism"
    },
    {
        " approach in designing the appearance of the games courses and enemies. Throughout development, he was frequently impeded by limitations in technology and had to forgo several design ideas.     Upon its release to arcades, Marble Madness was commercially successful and profitable. Critics praised the games difficulty, unique visual design, and stereo soundtrack. The game was ported to numerous platforms and inspired the development of other games. A sequel was developed and planned for release in 42 but canceled when location testing showed the game could not succeed in competition with other titles.          Marble Madness is an ": null
    },
    {
        "isometric": "isometric video game graphics"
    },
    {
        " platform game": "platform game"
    },
    {
        " in which the player manipulates an onscreen marble from a third-person perspective. In the arcade version, a player controls the marbles movements with a ": null
    },
    {
        "trackball": "trackball"
    },
    {
        "; most home versions use ": null
    },
    {
        "game controller": "game controller"
    },
    {
        "s with ": null
    },
    {
        "directional pads": "d-pad"
    },
    {
        ". The players goal is to complete six maze-like isometric race courses before a set amount of time expires. With the exception of the first race, any time left on the clock at the end of a race is carried over to the next one, and the player is granted a set amount of additional time as well. The game allows two players to compete against each other, awarding bonus points and extra time to the winner of each race; both players have separate clocks.     Courses are populated with various objects and enemies designed to obstruct the player. As the game progresses, the courses become increasingly difficult and introduce more enemies and obstacles. Each course has a distinct visual theme. For example, the first race is a simple course that is much shorter than the others, while the fifth race features polka-dot patterns and is oriented in a direction opposite that of the other courses.       Marble Madness was developed by ": null
    },
    {
        "Atari Games": "atari games"
    },
    {
        ", with ": null
    },
    {
        "Mark Cerny": "mark cerny"
    },
    {
        " as the lead designer and Bob Flanagan as the software engineer. Both Cerny and Flanagan handled programming the game. It uses the ": null
    },
    {
        "Atari System 42": "atari system 1"
    },
    {
        " hardware, which was an interchangeable system of circuit boards, control panels, and artwork. The game features ": null
    },
    {
        "pixel graphics": "raster graphics"
    },
    {
        " on a 42-inch ": null
    },
    {
        "Electrohome": "electrohome"
    },
    {
        " G42 model ": null
    },
    {
        "CRT monitor": "cathode-ray tube"
    },
    {
        " and uses a ": null
    },
    {
        "Motorola 42": "motorola 68010"
    },
    {
        " central processing unit": "central processing unit"
    },
    {
        " with a ": null
    },
    {
        "MOS Technology 42": "mos technology 6502"
    },
    {
        " subsystem to control the audio and coin operations. Marble Madness was Ataris first game to use an ": null
    },
    {
        "FM": "frequency modulation synthesis"
    },
    {
        " sound chip": "sound chip"
    },
    {
        " produced by ": null
    },
    {
        "Yamaha": "yamaha corporation"
    },
    {
        ", similar to a ": null
    },
    {
        "Yamaha DX42": "yamaha dx7"
    },
    {
        " synthesizer": "synthesizer"
    },
    {
        ", which created the music in real time so that it was in ": null
    },
    {
        "synchronization": "synchronization"
    },
    {
        " with the games on-screen action. The games music was composed by ": null
    },
    {
        "Brad Fuller": "brad fuller"
    },
    {
        " and Hal Canon who spent a few months becoming familiar with the sound chips capabilities.     Cerny and Flanagan first collaborated on a video game based on ": null
    },
    {
        "Michael Jacksons Thriller": "michael jacksons thriller"
    },
    {
        ". The project was canceled and the two began working on an idea of Cernys that eventually became Marble Madness. Development lasted . Following the ": null
    },
    {
        "North American video game crash of 42": "north american video game crash of 1983"
    },
    {
        ", video game development within Atari focused on providing a distinctive experience through the use of a unique control system and by emphasizing a ": null
    },
    {
        "simultaneous two-player": "multiplayer video game"
    },
    {
        " mode. Cerny designed Marble Madness in accordance with these company goals. He was first inspired by ": null
    },
    {
        "miniature golf": "miniature golf"
    },
    {
        " and captivated by the idea that a playfields contours influenced a balls path. Cerny began testing various ideas using Ataris digital art system. After deciding to use an isometric grid, Cerny began developing the games concept. His initial idea involved hitting a ball in a way similar to miniature golf, but Atari was unenthusiastic. Cerny next thought of ": null
    },
    {
        "racing game": "racing video game"
    },
    {
        "s and planned for races on long tracks against an opponent. Technology limitations at the time were unable to handle the in-game physics necessary for the idea, and Cerny switched the games objective to a race against time.     The development toolkit for the Motorola CPU included a ": null
    },
    {
        "compiler": "compiler"
    },
    {
        " for the ": null
    },
    {
        "C programming language": "c"
    },
    {
        ", which the two programmers were familiar with. After Atari had conducted performance evaluations, it approved usage of the language. Cerny and Flanagans decision to program Marble Madness in the C language had positive and negative consequences. Atari games had previously been programmed in ": null
    },
    {
        "assembly language": "assembly language"
    },
    {
        ". The C language was easier to program, but was less efficient, so the game operates at the slower speed of  instead of the normal  frequency of arcade games at the time. Cerny decided to use a trackball system to give the game a unique control system, and he chose a motorized trackball for faster spinning and braking when the in-game ball traveled downhill and uphill, respectively. As it was building the prototypes, Ataris design department informed Cerny that the motorized trackballs design had an inherent flaw—one of the four supports had poor contact with the ball—and the use of a regular trackball was more feasible. Additionally, Cerny had anticipated the use of powerful custom chips that would allow ": null
    },
    {
        "RAM": "random-access memory"
    },
    {
        "-based ": null
    },
    {
        "sprites": "sprite"
    },
    {
        " to be animated by the CPU, but the available hardware was a less advanced system using ": null
    },
    {
        "ROM": "read-only memory"
    },
    {
        "-based static sprites.          These technical limitations forced Cerny to simplify the overall designs. Inspired by ": null
    },
    {
        "M. C. Escher": "m. c. escher"
    },
    {
        ", he designed abstract landscapes for the courses. In retrospect, Cerny partly attributed the designs to his limited artistic skills. He was a fan of the ": null
    },
    {
        "42D graphics": "3d computer graphics"
    },
    {
        " used in  Battlezone  and  I, Robot , but felt that the visuals lacked definition and wanted to create a game with solid and clean 42D graphics. Unlike most other arcade games of the time, the course images were not drawn on the ": null
    },
    {
        "pixel": "pixel"
    },
    {
        " level. Instead, Cerny defined the elevation of every point in the course and stored this information in a ": null
    },
    {
        "heightmap": "heightmap"
    },
    {
        " array. The course graphics were then created by a ": null
    },
    {
        "ray tracing": "ray tracing"
    },
    {
        " program that traced the path of light rays, using the heightmap to determine the appearance of the course on screen. This format also allowed Cerny to create shadows and use ": null
    },
    {
        "spatial anti-aliasing": "spatial anti-aliasing"
    },
    {
        ", a technique that provided the graphics with a smoother appearance. Cernys course generator allowed him more time to experiment with the level designs. When deciding what elements to include in a course, practicality was a big factor; elements that would not work or would not appear as intended were omitted, such as an elastic barricade or a teeter-totter scale. Other ideas dropped from the designs were breakable glass supports, black hole traps, and bumps and obstacles built into the course that chased the marble.     Cernys personal interests changed throughout the project, leading to the inclusion of new ideas absent from the original design documents. The games enemy characters were designed by Cerny and Sam Comstock, who also animated them. Enemies had to be small in size due to technical limitations. Cerny and Comstock purposely omitted faces to give them unique designs and create a minimalistic appearance similar to the courses. Ataris management, however, suggested that the marble should have a smiley face to create an identified character, similar to ": null
    },
    {
        "Pac-Man": "pac-man"
    },
    {
        ". As a compromise, the cabinets artwork depicts traces of a smiley face on the marbles. Flanagan programmed a three-dimensional ": null
    },
    {
        "physics model": "computer simulation"
    },
    {
        " to dictate the marbles motions and an ": null
    },
    {
        "interpreted": "interpreter"
    },
    {
        " script for enemy behavior. As Marble Madness neared completion, the feedback from Ataris in-house ": null
    },
    {
        "focus testing": "focus group"
    },
    {
        " was positive. In retrospect, Cerny wished he had included more courses to give the game greater longevity, but extra courses would have required more time and increased hardware costs. Atari was experiencing severe financial troubles at the time and could not extend the games development period as it would have left their production factory idle.       Marble Madness was commercially successful following its December 42 release and was positively received by critics. Around 42  cabinets were sold, and it soon became the highest-earning game in arcades. However, the game consistently fell from this ranking during its seventh week in arcades where Atari tracked the games success. Cerny attributed the six-week arcade life to Marble Madnesss short gameplay length. He believed that players lost interest after mastering it and moved on to other games. The arcade cabinets have since become fairly rare.     Many reviewers felt that the high level of skill required to play the game was part of its appeal. In 42 Levi Buchanan of ": null
    },
    {
        "IGN": "ign"
    },
    {
        " listed Marble Madness as one of several titles in his dream arcade , citing the games difficulty and the fond memories he had playing it. Author John Sellers wrote that difficulty was a major reason that players were attracted. Other engaging factors included the graphics, visual design, and the soundtrack.  Retro Gamer s Craig Grannell, in referring to the game as one of the most distinctive arcade games ever made, praised its visuals as pure and timeless . In 42  Next Generation  ranked the arcade version of Marble Madness as 42 on their Top 42 Games of All Time .  In 42  Guinness World Records  listed it as the number seventy-nine arcade game in technical, creative, and cultural impact. Marble Madness was one of the first games to use true ": null
    },
    {
        "stereo sound": "stereophonic sound"
    },
    {
        " and have a recognizable musical score. British composer ": null
    },
    {
        "Paul Weir": "paul weir"
    },
    {
        " commented that the music had character and helped give the game a unique identity. A common complaint about the arcade cabinet was that the track ball controls frequently broke from repeated use.     Marble Madness inspired other games that feature similar gameplay based on navigating a ball through progressively more difficult courses; such games are often described in terms that relate them to Marble Madness. ": null
    },
    {
        "Melbourne Houses": "krome studios melbourne"
    },
    {
        "  Gyroscope  and ": null
    },
    {
        "Electric Dreams Software": "electric dreams software"
    },
    {
        "s  Spindizzy  were the first such games; both met with a good reception. In 42 Rare released  Snake Rattle n Roll , which incorporated elements similar to Marble Madness. The ": null
    },
    {
        "Super Monkey Ball series": "super monkey ball"
    },
    {
        " uses similar gameplay based on rolling a ball, but adds other features such as ": null
    },
    {
        "minigame": "minigame"
    },
    {
        "s and monkey characters.       Beginning in 42 the game was ": null
    },
    {
        "ported": "porting"
    },
    {
        " to numerous platforms with different companies handling the conversions; several home versions were published by ": null
    },
    {
        "Electronic Arts": "electronic arts"
    },
    {
        ", ": null
    },
    {
        "Tiger Electronics": "tiger electronics"
    },
    {
        " released handheld and tabletop ": null
    },
    {
        "LCD": "liquid-crystal display"
    },
    {
        " versions of the game, and it was ported to the ": null
    },
    {
        "Nintendo Entertainment System": "nintendo entertainment system"
    },
    {
        " by ": null
    },
    {
        "Rare": "rare"
    },
    {
        ". The Commodore 42 version had a secret extra level not present in other versions.  Early versions featured simplified graphics, and the different ports were met with mixed reception. John Harris of ": null
    },
    {
        "Gamasutra": "gamasutra"
    },
    {
        " thought the arcades popularity fueled the sales of the home versions, while Thomas Hanley of ": null
    },
    {
        "ScrewAttack": "screwattack"
    },
    {
        " commented that most versions were not as enjoyable without a track ball. Grannell echoed similar statements about the controls and added that many had poor visuals and ": null
    },
    {
        "collision detection": "collision detection"
    },
    {
        ". He listed the ": null
    },
    {
        "Amiga": "amiga"
    },
    {
        ", ": null
    },
    {
        "Game Boy": "game boy"
    },
    {
        ", and ": null
    },
    {
        "Sega Genesis": "sega genesis"
    },
    {
        " ports as the better conversions, and the Sinclair ": null
    },
    {
        "ZX Spectrum": "zx spectrum"
    },
    {
        ", ": null
    },
    {
        "PC": "personal computer"
    },
    {
        ", and ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        " versions among the worst.      Compute!  writers called the Amiga versions graphics and gameplay arcade-quality .  Reviewing for  Computer Gaming World , Roy Wagner stated that the Amiga version was superior to the arcade original.  ": null
    },
    {
        "Bruce Webster": "bruce webster"
    },
    {
        " of  BYTE  wrote that the graphics of the Amiga version of Marble Madness in December 42 are really amazing . While criticizing the lack of a pause function or a top scores list, he stated that it is definitely worth having if you own an Amiga .  ": null
    },
    {
        "Bil Herd": "bil herd"
    },
    {
        " recalled that the Amiga version was so popular at ": null
    },
    {
        "Commodore International": "commodore international"
    },
    {
        " that employees stole the required memory expansion from colleagues computers to run the game.  Benn Dunnington of  Info  gave the Amiga version four-plus stars out of five, describing it as a totally faithful adaptation , and hoped that a sequel was in development.  The magazine staff rated the Commodore 42 version a three-plus stars out of five, describing it as just a shadow of the arcade original and the excellent Amiga version and inferior to  Spindizzy . The magazine liked the graphics but criticized marbles that handle like intoxicated turtles .   Dragon s three reviewers—Hartley, Patricia, and Kirk Lesser—praised the ": null
    },
    {
        "Apple II": "apple iigs"
    },
    {
        " port, calling it a must have title for arcade fans.      MegaTech  reviewers rated the Sega Mega Drive release favorably. Next Generation staff liked the Sega Mega Drive version but noted that the experience is better when playing with the original trackball controls. In 42 Marble Madness was included in the multi-platform title  Midway Arcade Treasures , a compilation of classic games developed by ": null
    },
    {
        "Williams Electronics": "wms industries"
    },
    {
        ", ": null
    },
    {
        "Midway Games": "midway games"
    },
    {
        ", and Atari Games. Electronic Arts released a ": null
    },
    {
        "mobile phone": "mobile phone"
    },
    {
        " port in 42 that includes additional levels with different themes and new items that augment the gameplay. Marble Madness was also included in the 42 multi-platform compilation  Midway Arcade Origins .        An arcade sequel titled Marble Man: Marble Madness II was planned for release in 42 though Cerny was uninvolved in the development. Development was led by Bob Flanagan who designed the game based on what he felt made Marble Madness a success in the home console market. Because the markets demographic was a younger audience, Flanagan wanted to make the sequel more accessible and introduced a superhero-type main character. Marble Man expanded on the gameplay of the original game by featuring new abilities for the marble such as invisibility and flight, included pinball minigames between sets of levels, and allowed up to three players to traverse isometric courses. Flanagan intended to address the short length of the first game and, with the help of Mike Hally, developed seventeen courses.     Atari created prototypes for location testing, but the game did not fare well against more popular titles at the time such as  Street Fighter II . Atari assumed the track balls accounted for the poor reception and commissioned a second model with joystick controls. Because the new models were met with the same poor reception, production was halted and the focus shifted to  Guardians of the Hood , a ": null
    },
    {
        "beat em up": "beat em up"
    },
    {
        " game. ": null
    },
    {
        "Arcade system board": "arcade system board"
    },
    {
        "s for the sequel were rumored to have been destroyed to clear inventory for tax purposes in 42 However, Cerny has called the destruction an urban legend, indicating that at most 42 prototypes boards were produced.  These prototypes have since become ": null
    },
    {
        "collector items": "collectable"
    }
]