[
    {
        "           Marcel Dupré  was a French ": null
    },
    {
        "organist": "organist"
    },
    {
        ", ": null
    },
    {
        "composer": "composer"
    },
    {
        ", and ": null
    },
    {
        "pedagogue": "pedagogue"
    },
    {
        ".       Born at ": null
    },
    {
        "Rouen": "rouen"
    },
    {
        " into a musical family, Marcel Dupré was a child prodigy. His father Albert Dupré was organist in Rouen and a friend of ": null
    },
    {
        "Aristide Cavaillé-Coll": "aristide cavaillé-coll"
    },
    {
        ", who built an organ in the family house when Marcel was 42 years old. Having already taken lessons from ": null
    },
    {
        "Alexandre Guilmant": "alexandre guilmant"
    },
    {
        ", he entered the ": null
    },
    {
        "Paris Conservatoire": "paris conservatoire"
    },
    {
        " in 42 where he studied with ": null
    },
    {
        "Louis Diémer": "louis diémer"
    },
    {
        " and ": null
    },
    {
        "Lazare Lévy": "lazare lévy"
    },
    {
        " , Guilmant and ": null
    },
    {
        "Louis Vierne": "louis vierne"
    },
    {
        " , and ": null
    },
    {
        "Charles-Marie Widor": "charles-marie widor"
    },
    {
        " . In 42 Dupré won the Grand ": null
    },
    {
        "Prix de Rome": "prix de rome"
    },
    {
        " for his ": null
    },
    {
        "cantata": "cantata"
    },
    {
        ", Psyché. Twelve years later, he was appointed professor of organ performance and improvisation at the ": null
    },
    {
        "Paris Conservatoire": "paris conservatoire"
    },
    {
        ", a position he held until 42     Dupré became famous for performing more than 42 organ recitals throughout Australia, the United States, Canada and Europe, which included a recital series of 42 concerts of the complete works of ": null
    },
    {
        "Bach": "bach"
    },
    {
        " in 42  and 42 , both performed entirely from memory. The sponsorship of an American transcontinental tour by the ": null
    },
    {
        "John Wanamaker Department Store": "wanamakers"
    },
    {
        " interests rocketed his name into international prominence. Duprés Symphonie-Passion began as an improvisation on ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        "s ": null
    },
    {
        "Wanamaker Organ": "wanamaker organ"
    },
    {
        ". In 42 he was elected as an honorary member of ": null
    },
    {
        "Phi Mu Alpha Sinfonia": "phi mu alpha sinfonia"
    },
    {
        " fraternity, by the fraternitys Alpha chapter at the ": null
    },
    {
        "New England Conservatory": "new england conservatory"
    },
    {
        " in Boston.     Succeeding Widor in 42 as titular organist at ": null
    },
    {
        "St. Sulpice": "église saint-sulpice, paris"
    },
    {
        " in Paris, Dupré retained this position for the rest of his life; thus it happened that, since Widor had been there for more than six decades, the position changed hands only once in a century. From 42 to 42 Dupré was director of the ": null
    },
    {
        "American Conservatory": "american conservatory"
    },
    {
        ", which occupies the Louis XV wing of the ": null
    },
    {
        "Château de Fontainebleau": "château de fontainebleau"
    },
    {
        " near Paris. In 42 on the death in a road accident of ": null
    },
    {
        "Claude Delvincourt": "claude delvincourt"
    },
    {
        ", Dupré became director of the ": null
    },
    {
        "Paris Conservatoire": "paris conservatoire"
    },
    {
        "; but he held this post for only two years before the prevailing national laws forced him to retire at the age of 42 He died in 42 in ": null
    },
    {
        "Meudon": "meudon"
    },
    {
        " . His wife lived until 42     As a composer, he produced a wide-ranging oeuvre of 42 opus numbers. He also taught two generations of well-known organists such as ": null
    },
    {
        "Jehan Alain": "jehan alain"
    },
    {
        " and ": null
    },
    {
        "Marie-Claire Alain": "marie-claire alain"
    },
    {
        ", ": null
    },
    {
        "Jean-Marie Beaudet": "jean-marie beaudet"
    },
    {
        ", ": null
    },
    {
        "Pierre Cochereau": "pierre cochereau"
    },
    {
        ", ": null
    },
    {
        "Françoise Renet": "françoise renet"
    },
    {
        ", ": null
    },
    {
        "Jeanne Demessieux": "jeanne demessieux"
    },
    {
        ", ": null
    },
    {
        "Rolande Falcinelli": "rolande falcinelli"
    },
    {
        ", ": null
    },
    {
        "Jean-Jacques Grunenwald": "jean-jacques grunenwald"
    },
    {
        ", ": null
    },
    {
        "Jean Guillou": "jean guillou"
    },
    {
        ", ": null
    },
    {
        "Jean Langlais": "jean langlais"
    },
    {
        ", ": null
    },
    {
        "Carl Weinrich": "carl weinrich"
    },
    {
        " and ": null
    },
    {
        "Olivier Messiaen": "olivier messiaen"
    },
    {
        ", to name only a few. Aside from a few fine works for aspiring organists  most of Duprés music for the organ ranges from moderately to extremely difficult, and some of it makes almost impossible technical demands on the performer .     Duprés most often heard and recorded compositions tend to be from the earlier part of his career. During this time he wrote the Three Preludes and Fugues, Op. 42 , with the First and Third Preludes being pronounced unplayable by no less a figure than Widor. Such, indeed, is these preludes level of complexity that Dupré was the only organist able to play them in public for years.     In many ways Dupré may be viewed as a ": null
    },
    {
        "Paganini": "niccolò paganini"
    },
    {
        " of the organ. Being a virtuoso of the highest order, he contributed extensively to the development of technique although, like Paganini, his music is largely unknown to musicians other than those who play the instrument for which the music was written. A fair and objective critique of his output should take into account the fact that, occasionally, the emphasis on virtuosity and technique can be detrimental to the musical content and substance. Nevertheless his more successful works combine this virtuosity with a high degree of musical integrity, qualities found in compositions such as the Symphonie-Passion, the Chemin de la Croix, the Preludes and Fugues, the Esquisses and Évocation, and the Cortège et Litanie.     As well as composing prolifically, Dupré prepared study editions of the organ works of ": null
    },
    {
        "Bach": "johann sebastian bach"
    },
    {
        ", ": null
    },
    {
        "Handel": "handel"
    },
    {
        ", ": null
    },
    {
        "Mozart": "mozart"
    },
    {
        ", ": null
    },
    {
        "Liszt": "liszt"
    },
    {
        ", ": null
    },
    {
        "Mendelssohn": "felix mendelssohn"
    },
    {
        ", ": null
    },
    {
        "Schumann": "robert schumann"
    },
    {
        ", ": null
    },
    {
        "César Franck": "césar franck"
    },
    {
        ", and ": null
    },
    {
        "Alexander Glazunov": "alexander glazunov"
    },
    {
        ". He also wrote a method for organ , 42 treatises on organ improvisation , and books on harmonic analysis , counterpoint , fugue , and accompaniment of Gregorian chant , in addition to essays on organ building, acoustics, and philosophy of music. As an improviser, Dupré excelled as perhaps no other did during the 42th century, and he was able to take given themes and spontaneously weave whole symphonies around them, often with elaborate contrapuntal devices including fugues. The achievement of these feats was partially due to his native genius and partially due to his extremely hard work doing paper exercises when he was not busy practising or composing.     Although his emphasis as composer was the organ, Duprés catalog of musical compositions also includes works for piano, orchestra and choir, as well as chamber music, and a number of transcriptions.       : See  List of compositions by Marcel Dupré .           ": null
    }
]