[
    {
        "               Marc Léopold Benjamin Bloch  was a ": null
    },
    {
        "French historian": "list of contemporary french historians"
    },
    {
        ". A founding member of the ": null
    },
    {
        "Annales School": "annales school"
    },
    {
        " of French social history, he specialised in ": null
    },
    {
        "medieval history": "medieval history"
    },
    {
        " and published widely on ": null
    },
    {
        "Medieval France": "medieval france"
    },
    {
        " over the course of his career. As an academic, he worked at the ": null
    },
    {
        "University of Strasbourg": "university of strasbourg"
    },
    {
        " , the ": null
    },
    {
        "University of Paris": "university of paris"
    },
    {
        " , and the ": null
    },
    {
        "University of Montpellier": "university of montpellier"
    },
    {
        " .     Born in ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " to an ": null
    },
    {
        "Alsatian Jewish": "history of the jews in alsace"
    },
    {
        " family, Bloch was raised in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", where his father—the ": null
    },
    {
        "classical historian": "classical historian"
    },
    {
        " Gustave Bloch": "gustave bloch"
    },
    {
        "—worked at ": null
    },
    {
        "Sorbonne University": "sorbonne university"
    },
    {
        ". Bloch was educated at various Parisian ": null
    },
    {
        "lycées": "lycée"
    },
    {
        "and the ": null
    },
    {
        "École Normale Supérieure": "école normale supérieure"
    },
    {
        ", and from an early age was affected by the ": null
    },
    {
        "anti-semitism": "anti-semitism"
    },
    {
        " of the ": null
    },
    {
        "Dreyfus affair": "dreyfus affair"
    },
    {
        ". During the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", he served in the French Army and fought at the ": null
    },
    {
        "First Battle of the Marne": "first battle of the marne"
    },
    {
        " and the ": null
    },
    {
        "Somme": "battle of the somme"
    },
    {
        ". After the war, he was awarded his doctorate in 1918 and became a ": null
    },
    {
        "lecturer": "lecturer"
    },
    {
        " at the University of Strasbourg. There, he formed an intellectual partnership with ": null
    },
    {
        "modern historian": "modern historian"
    },
    {
        " Lucien Febvre": "lucien febvre"
    },
    {
        ". Together they founded the Annales School and began publishing the ": null
    },
    {
        "journal": "academic journal"
    },
    {
        "  Annales dhistoire économique et sociale  in 1929. Bloch was a modernist in his ": null
    },
    {
        "historiographical": "historiography"
    },
    {
        " approach, and repeatedly emphasised the importance of a multidisciplinary engagement towards history, particularly blending his research with that on ": null
    },
    {
        "geography": "geography"
    },
    {
        ", ": null
    },
    {
        "sociology": "sociology"
    },
    {
        " and ": null
    },
    {
        "economics": "economics"
    },
    {
        ", which was his subject when he was offered a post at the University of Paris in 1936.     During the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " Bloch volunteered for service, and was a logistician during the ": null
    },
    {
        "Phoney War": "phoney war"
    },
    {
        ". Involved in the ": null
    },
    {
        "Battle of Dunkirk": "battle of dunkirk"
    },
    {
        " and spending a brief time in Britain, he unsuccessfully attempted to secure passage to the United States. Back in France, where his ability to work was curtailed by new anti-Semitic regulations, he applied for and received one of the few permits available allowing Jews to continue working in the French university system. He had to leave Paris, and complained that the ": null
    },
    {
        "Nazi German": "nazi germany"
    },
    {
        " authorities looted his apartment and stole his books; he was also forced to relinquish his position on the editorial board of Annales. Bloch worked in ": null
    },
    {
        "Montpellier": "montpellier"
    },
    {
        " until November 1942 when Germany ": null
    },
    {
        "invaded": "case anton"
    },
    {
        " Vichy France": "vichy france"
    },
    {
        ". He then joined the ": null
    },
    {
        "French Resistance": "french resistance"
    },
    {
        ", acting predominantly as a courier and translator. In 1944, he was captured in ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " and ": null
    },
    {
        "executed by firing squad": "executed by firing squad"
    },
    {
        ". Several works—including influential studies like  The Historians Craft  and  Strange Defeat —were published posthumously.     His historical studies and his death as a member of the Resistance together made Bloch highly regarded by generations of post-war French historians; he came to be called the greatest historian of all-time . By the end of the 20th century, historians were making a more sober assessment of Blochs abilities, influence, and legacy, arguing that there were flaws to his approach.           Marc Bloch was born in Lyon on 6 July 1886, one of two children to ": null
    },
    {
        "Gustave": "gustave bloch"
    },
    {
        " and Sarah Bloch,  Ebstein. Blochs family were ": null
    },
    {
        "Alsatian Jew": "alsatian jew"
    },
    {
        "s: ": null
    },
    {
        "secular": "secular humanism"
    },
    {
        ", liberal and loyal to the ": null
    },
    {
        "French Republic": "french republic"
    },
    {
        ". They struck a balance , says the historian ": null
    },
    {
        "Carole Fink": "carole fink"
    },
    {
        ", between both fierce Jacobin patriotism and the antinationalism of the left . His family had lived in Alsace for five generations under French rule. In 1871, France was forced to cede ": null
    },
    {
        "the region": "alsace-lorraine"
    },
    {
        " to Germany following its defeat in the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        ". The year after Blochs birth, his father was appointed professor of ": null
    },
    {
        "Roman History": "roman history"
    },
    {
        " at the Sorbonne, and the family moved to Paris— the glittering capital of the Third Republic . Marc had a brother, Louis Constant Alexandre, seven years his senior. The two were close, although Bloch later described Louis as being occasionally somewhat intimidating. The Bloch family lived at 72, ": null
    },
    {
        "Rue dAlésia": "rue dalésia"
    },
    {
        ", in the ": null
    },
    {
        "14th arrondissement of Paris": "14th arrondissement of paris"
    },
    {
        ". Gustave began teaching Marc history while he was still a boy, with a secular, rather than ": null
    },
    {
        "Jewish, education": "jewish education"
    },
    {
        " intended to prepare him for a career in professional French society. Blochs later close collaborator, ": null
    },
    {
        "Lucien Febvre": "lucien febvre"
    },
    {
        ", visited the Bloch family at home in 1902; although the reason for Febvres visit is now unknown, he later wrote of Bloch how            Blochs biographer Karen Stirling ascribed significance to the era in which Bloch was born: the middle of the ": null
    },
    {
        "French Third Republic": "french third republic"
    },
    {
        ", so after those who had founded it and before the generation that would aggressively challenge it . When Bloch was nine-years-old, the ": null
    },
    {
        "Dreyfus affair": "dreyfus affair"
    },
    {
        " broke out in France. As the first major display of political ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " in Europe, it was probably a formative event of Blochs youth, along with, more generally, the atmosphere of  fin de siècle  Paris. Bloch was 11 when ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        " published  JAccuse…! , his indictment of the French establishments antisemitism and corruption. Bloch was greatly affected by the Dreyfus affair, but even more affected was nineteenth-century France generally, and his fathers employer, the École Normale Supérieure, saw existing divides in French society reinforced in every debate. Gustave Bloch was closely involved in the ": null
    },
    {
        "Dreyfusard": "dreyfusard"
    },
    {
        " movement and his son agreed with the cause.     Bloch was educated at the prestigious ": null
    },
    {
        "Lycée Louis-le-Grand": "lycée louis-le-grand"
    },
    {
        " for three years, where he was consistently head of his class and won prizes in French, history, Latin and natural history. He passed his  baccalauréat , in Letters and Philosophy, in July 1903, being graded trés bien . The following year, he received a ": null
    },
    {
        "scholarship": "scholarship"
    },
    {
        " and undertook postgraduate study there for the École normale supérieure  . His father had been nicknamed le Méga by his students at the ÉNS and the moniker Microméga was bestowed upon Bloch. Here he was taught history by ": null
    },
    {
        "Christian Pfister": "christian pfister"
    },
    {
        " and ": null
    },
    {
        "Charles Seignobos": "charles seignobos"
    },
    {
        ", who led a relatively new school of historical thought which saw history as broad themes punctuated by tumultuous events. Another important influence on Bloch from this period was his fathers contemporary, the sociologist ": null
    },
    {
        "Émile Durkheim": "émile durkheim"
    },
    {
        ", who pre-figured Blochs own later emphasis on cross-disciplinary research. The same year, Bloch visited England; he later recalled being struck more by the number of homeless people on the ": null
    },
    {
        "Victoria Embankment": "victoria embankment"
    },
    {
        " than the new Entente Cordiale relationship between the two countries.     The Dreyfus affair had soured Blochs views of the ": null
    },
    {
        "French Army": "french army"
    },
    {
        ", and he considered it laden with snobbery, anti-semitism and anti-republicanism . ": null
    },
    {
        "National service": "national service"
    },
    {
        " had been made compulsory for all French adult males in 1905, with an enlistment term of two years. Bloch joined the ": null
    },
    {
        "46th Infantry Regiment": "4th infantry regiment"
    },
    {
        " based at ": null
    },
    {
        "Pithiviers": "pithiviers"
    },
    {
        " from 1905 to 1906.          By this time, changes were taking place in French academia. In Blochs own speciality of history, attempts were being made at instilling a more scientific methodology. In other, newer departments such a sociology, efforts were made at establishing an independent identity. Bloch graduated in 1908 with degrees in both geography and history . He had a high respect for ": null
    },
    {
        "historical geography": "historical geography"
    },
    {
        ", then a speciality of French historiography, as practiced by his tutor ": null
    },
    {
        "Vidal de la Blache": "vidal de la blache"
    },
    {
        " whose Tableau de la géographie Bloch had studied at the ÉNS, and ": null
    },
    {
        "Lucien Gallois": "lucien gallois"
    },
    {
        ". Bloch applied unsuccessfully for a fellowship at the  Fondation Thiers . As a result, he travelled to Germany in 1909 where he studied ": null
    },
    {
        "demography": "demography"
    },
    {
        " under ": null
    },
    {
        "Karl Bücher": "karl bücher"
    },
    {
        " in ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " and ": null
    },
    {
        "religion": "religious studies"
    },
    {
        " under ": null
    },
    {
        "Adolf Harnack": "adolf von harnack"
    },
    {
        " in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        "; he did not, however, particularly socialise with fellow students while in Germany. He returned to France the following year and again applied to the Fondation, this time successfully. Bloch researched the medieval ": null
    },
    {
        "Île-de-France": "île-de-france"
    },
    {
        " in preparation for his thesis. This research was Blochs first focus on rural history. His parents had moved house and now resided at the ": null
    },
    {
        "Avenue dOrleans": "avenue dorleans"
    },
    {
        ", not far from Blochs quarters.     Blochs research at the Fondation—especially his research into the ": null
    },
    {
        "Capetian kings": "capetian dynasty"
    },
    {
        "—laid the groundwork for his career. He began by creating maps of the Paris area illustrating where serfdom had thrived and where it had not. He also investigated the nature of serfdom, the culture of which, he discovered, was founded almost completely on custom and practice. His studies of this period formed Bloch into a mature scholar and first brought him into contact with other disciplines whose relevance he was to emphasise for most of his career. Serfdom as a topic was so broad that he touched on commerce, currency, popular religion, the nobility, as well as art, architecture and literature. His ": null
    },
    {
        "doctoral thesis": "doctoral thesis"
    },
    {
        "—a study of 10th-century French serfdom—was titled Rois et Serfs, un Chapitre dHistoire Capétienne. Although it helped mould Blochs ideas for the future, it did not, says Bryce Loyn, give any indication of the originality of thought that Bloch would later be known for, and was not vastly different to what others had written on the subject. Following his graduation, he taught at two ": null
    },
    {
        "lycée": "lycée"
    },
    {
        "s, first in Montpelier, a minor university town of 66,000 inhabitants. With Bloch working over 16 hours a week on his classes, there was little time for him to work on his thesis. He also taught at the ": null
    },
    {
        "University of Amiens": "university of amiens"
    },
    {
        ". While there, he wrote a review of Febvres first book, Histoire de Franche-Comté. Bloch intended to turn his thesis into a book, but the First World War intervened.       Both Marc and Louis Bloch volunteered for service in the French Army. Although the Dreyfus Affair had soured Blochs views of the French Army, he later wrote that his criticisms were only of the officers; he had respect only for the men . Bloch was one of over 800 ÉNS students who enlisted; 239 were to be ": null
    },
    {
        "killed in action": "killed in action"
    },
    {
        ". On 2 August 1914 he was assigned to the 272nd Reserve Regiment. Within eight days he was stationed on the Belgian border where he fought in the ": null
    },
    {
        "Battle of the Meuse": "battle of the meuse"
    },
    {
        " later that month. His regiment took part in the general retreat on the 25th, and the following day they were in ": null
    },
    {
        "Barricourt": "barricourt"
    },
    {
        ", in the ": null
    },
    {
        "Argonne": "forest of argonne"
    },
    {
        ". The march westward continued towards the ": null
    },
    {
        "River Marne": "river marne"
    },
    {
        "—with a temporary ": null
    },
    {
        "recuperative halt": "rest and recuperation"
    },
    {
        " in ": null
    },
    {
        "Termes": "termes, ardennes"
    },
    {
        "—which they reached in early September. During the ": null
    },
    {
        "First Battle of the Marne": "first battle of the marne"
    },
    {
        ", Blochs troop was responsible for the assault and capture of ": null
    },
    {
        "Florent": "florent"
    },
    {
        " before advancing on ": null
    },
    {
        "La Gruerie": "la gruerie"
    },
    {
        ". Bloch led his troop with shouts of Forward the 18th! They suffered heavy casualties: 89 men were either missing or known to be dead. Bloch enjoyed the early days of the war; like most of his generation, he had expected a short but glorious conflict. Gustave Bloch remained in France, wishing to be close to his sons at the front.      Except for two months in hospital followed by another three recuperating, he spent the war in the infantry; he joined as a ": null
    },
    {
        "sergeant": "sergeant"
    },
    {
        " and rose to become the ": null
    },
    {
        "head of his section": "section french army"
    },
    {
        ". Bloch kept a ": null
    },
    {
        "war diary": "war diary"
    },
    {
        " from his enlistment. Very detailed in the first few months, it rapidly became more general in its observations. However, says the historian ": null
    },
    {
        "Daniel Hochedez": "daniel hochedez"
    },
    {
        ", Bloch was aware of his role as both a witness and narrator to events and wanted as detailed a basis for his historiographical understanding as possible. The historian Rees Davies notes that although Bloch served in the war with considerable distinction , it had come at the worst possible time both for his intellectual development and his study of medieval society.     For the first time in his life, Bloch later wrote, he worked and lived alongside people he had never had close contact with before, such as shop workers and labourers, with whom he developed a great ": null
    },
    {
        "camaraderie": "camaraderie"
    },
    {
        ". It was a completely different world to the one he was used to, being a world where differences were settled not by words but by bullets . His experiences made him rethink his views on history, and influenced his subsequent approach to the world in general. He was particularly moved by the collective psychology he witnessed in the ": null
    },
    {
        "trenches": "wwi trenches"
    },
    {
        ". He later declared he knew of no better men than the men of the Nord and the Pas de Calais  with whom he had spent four years in close quarters. His few references to the French generals were sparse and sardonic.     Apart from the Marne, Bloch fought at the battles of ": null
    },
    {
        "the Somme": "battle of the somme"
    },
    {
        ", the ": null
    },
    {
        "Argonne": "meuse-argonne offensive"
    },
    {
        ", and the ": null
    },
    {
        "final German assault on Paris": "paris in world war iparis again on the front lines"
    },
    {
        ". He survived the war, which he later described as having been an honour to have served through. He had, however, lost many friends and colleagues. Among the closest of them, all killed in action, were: ": null
    },
    {
        "Maxime David": "maxime david"
    },
    {
        " , ": null
    },
    {
        "Antoine-Jules Bianconi": "antoine-jules bianconi"
    },
    {
        " and ": null
    },
    {
        "Ernest Babut": "ernest babut"
    },
    {
        " . Bloch himself was wounded twice and decorated for courage, receiving the ": null
    },
    {
        "Croix de Guerre": "croix de guerre"
    },
    {
        " and the ": null
    },
    {
        "Légion dHonneur": "légion dhonneur"
    },
    {
        ". He had joined as a ": null
    },
    {
        "non-commissioned officer": "non-commissioned officer"
    },
    {
        ", received an ": null
    },
    {
        "officers commission": "officers commission"
    },
    {
        " after the Marne, and had been promoted to ": null
    },
    {
        "warrant officer": "warrant officer"
    },
    {
        " and finally a captain in the ": null
    },
    {
        "fuel service": "military fuel service"
    },
    {
        ",  before the war ended. He was clearly, says Loyn, both a good and a brave soldier; he later wrote, I know only one way to persuade a troop to brave danger: brave it yourself .     While on front-line service, Bloch contracted severe ": null
    },
    {
        "arthritis": "arthritis"
    },
    {
        " which required him to retire regularly to the ": null
    },
    {
        "thermal baths": "thermal bath"
    },
    {
        "of ": null
    },
    {
        "Aix-les-Bains": "aix-les-bains"
    },
    {
        " for treatment. He later remembered very little of the historical events he found himself in, writing only that his memories were a discontinuous series of images, vivid in themselves, but badly arranged, like a reel of motion picture film containing some large gaps and some reversals of certain scenes . Bloch later described the war, in a detached style, as having been a gigantic social experience, of unbelievable richness . For example, he had a habit of noting the different coloured smoke that different shells made — ": null
    },
    {
        "percussion bombs": "shell percussion fuze"
    },
    {
        " had black smoke, ": null
    },
    {
        "timed bombs": "artillery fuzetime fuzes"
    },
    {
        " were brown. He also remembered both the friends killed at our side ... of the intoxication which had taken hold of us when we saw the enemy in flight . He also considered it to have been four years of fighting idleness . Following the ": null
    },
    {
        "Armistice in November 1918": "armistice of 11 november 1918"
    },
    {
        ", Bloch was ": null
    },
    {
        "demobilised": "demobilization"
    },
    {
        " on 13 March 1919.           The war was fundamental in re-arranging Blochs approach to history, although he never acknowledged it as a turning point. In the years following the war, a disillusioned Bloch rejected the ideas and the traditions that had formed his scholarly training. He rejected the political and biographical history which up until that point was the norm, along with what the historian George Huppert has described as a laborious cult of facts that accompanied it. In 1920, with the opening of the ": null
    },
    {
        "University of Strasbourg": "university of strasbourg"
    },
    {
        ", Bloch was appointed chargé de cours  of medieval history. ": null
    },
    {
        "Alsace-Lorraine": "alsace-lorraine"
    },
    {
        " had been returned to France with the ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        "; the status of the region was a ": null
    },
    {
        "contentious political issue": "november 1918 in alsace-lorraine"
    },
    {
        " in Strasbourg, its capital, which had a large German population. Bloch, however, refused to take either side in the debate; indeed, he appears to have avoided politics entirely. Under ": null
    },
    {
        "Wilhelmine Germany": "wilhelmine germany"
    },
    {
        ", Strasbourg had rivalled Berlin as a centre for intellectual advancement, and the University of Strasbourg possessed the largest academic library in the world. Thus, says ": null
    },
    {
        "Stephan R. Epstein": "stephan r. epstein"
    },
    {
        " of the ": null
    },
    {
        "London School of Economics": "london school of economics"
    },
    {
        ", Blochs unrivalled knowledge of the European Middle Ages was ... built on and around the French University of Strasbourgs inherited German treasures . Bloch also taught French to the few German students who were still at the Centre dÉtudes Germaniques at the ": null
    },
    {
        "University of Mainz": "university of mainz"
    },
    {
        " during the ": null
    },
    {
        "Occupation of the Rhineland": "occupation of the rhineland"
    },
    {
        ". He refrained from taking a public position when France ": null
    },
    {
        "occupied the Ruhr": "occupation of the ruhr"
    },
    {
        " in 1923 over Germanys perceived failure to pay ": null
    },
    {
        "war reparations": "war reparations"
    },
    {
        ".     Bloch began working energetically, and later said that the most productive years of his life were spent at Strasbourg. In his teaching, his delivery was halting. His approach sometimes appeared cold and distant—caustic enough to be upsetting—but conversely, he could be also both charismatic and forceful. Durkheim died in 1917, but the movement he began against the smugness that pervaded French intellectual thinking continued. Bloch had been greatly influenced by him, as Durkheim also considered the connections between historians and sociologists to be greater than their differences. Not only did he openly acknowledge Durkheims influence, but Bloch repeatedly seized any opportunity to reiterate it, according to R. C. Rhodes.     At Strasbourg he again met Febvre, who was now a leading historian of the 16th century. Modern and medieval seminars were adjacent to each other at Strasbourg, and attendance often overlapped. Their meeting has been called a germinal event for 20th-century historiography , and they were to work closely together for the rest of Blochs life. Febvre was some years older than Bloch and was probably a great influence on him. They lived in the same area of Strasbourg and became kindred spirits, often going on walking trips across the ": null
    },
    {
        "Vosges": "vosges"
    },
    {
        " and other excursions.     Blochs fundamental views on the nature and purpose of the study of history were established by 1920. That same year he defended, and subsequently published, his thesis. It was not as extensive a work as had been intended due to the war. There was a provision in French ": null
    },
    {
        "further education": "further education"
    },
    {
        " for doctoral candidates for whom the war had interrupted their research to submit only a small portion of the full-length thesis usually required. It sufficed, however, to demonstrate his credentials as a medievalist in the eyes of his contemporaries. He began publishing articles in ": null
    },
    {
        "Henri Berrs": "henri berr"
    },
    {
        " Revue de Synthèse Historique": "revue de synthèse"
    },
    {
        ". Bloch also published his first major work,  Les Rois Thaumaturges , which he later described as ce gros enfant . In 1928, Bloch was invited to lecture at the Institute for the Comparative Study of Civilizations in Oslo. Here he first expounded publicly his theories on total, comparative history:        Annales His Oslo lecture, called Towards a Comparative History of Europe , formed the basis of his next book, Les Caractères Originaux de lHistoire Rurale Française. In the same year he founded the historical journal  Annales  with Febvre. One of its aims was to counteract the administrative school of history, which Davies says had committed the arch error of emptying history of human element . As Bloch saw it, it was his duty to correct that tendency. Both Bloch and Febvre were keen to refocus French historical scholarship on social rather than ": null
    },
    {
        "political history": "political history"
    },
    {
        " and to promote the use of sociological techniques. The journal avoided ": null
    },
    {
        "narrative history": "narrative history"
    },
    {
        " almost completely.     The inaugural issue of the Annales stated the editors basic aims: to counteract the arbitrary and artificial division of history into periods, to re-unite history and social science as a single body of thought, and to promote the acceptance of all other schools of thought into historiography. As a result, the Annales often contained commentary on contemporary, rather than exclusively historical, events. Editing the journal led to Bloch forming close professional relationships with scholars in different fields across Europe. The Annales was the only academic journal to boast a preconceived methodological perspective. Neither Bloch nor Febvre wanted to present a neutral facade. During the decade it published it maintained a staunchly left-wing position. ": null
    },
    {
        "Henri Pirenne": "henri pirenne"
    },
    {
        ", a Belgian historian who wrote ": null
    },
    {
        "comparative history": "comparative history"
    },
    {
        ", closely supported the new journal. Before the war he had acted in an unofficial capacity as a conduit between French and German schools of historiography. ": null
    },
    {
        "Fernand Braudel": "fernand braudel"
    },
    {
        "—who was himself to become an important member of the Annales School after World War Two—later described the journals management as being a chief executive officer—Bloch—with a minister of foreign affairs—Febvre.     The comparative method allowed Bloch to discover instances of uniqueness within aspects of society, and he advocated it as a new kind of history. According to Bryce Lyon, Braudel and Febvre, promising to perform all the burdensome tasks themselves, asked Pirenne to become ": null
    },
    {
        "editor-in-chief": "editor-in-chief"
    },
    {
        " of Annales to no avail. Pirenne remained a strong supporter, however, and had an article published in the first volume in 1929. He became close friends with both Bloch and Febvre. He was particularly influential on Bloch, who later said that Pirennes approach should be the model for historians and that at the time his country was fighting beside mine for justice and civilisation, wrote in captivity a history of Europe . The three men kept up a regular correspondence until Pirennes death in 1935. In 1923, Bloch attended the inaugural meeting of the ": null
    },
    {
        "International Congress on Historical Studies": "international congress on historical studies"
    },
    {
        " in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", which was opened by Pirenne. Bloch was a prolific reviewer for Annales, and during the ": null
    },
    {
        "1920s and 1930s": "interwar period"
    },
    {
        " he contributed over 700 reviews. These were both criticisms of specific works, but more generally, represented his own fluid thinking during this period. The reviews demonstrate the extent to which he shifted his thinking on particular subjects.       In 1930, both keen to make a move to Paris, Febvre and Bloch applied to the  École pratique des hautes études  for a position: both failed. Three years later Febvre was elected to the ": null
    },
    {
        "Collège de France": "collège de france"
    },
    {
        ". He moved to Paris, and in doing so, says Fink, became all the more aloof. This placed a strain on Blochs and his relations, although they communicated regularly by letter and much of their correspondence has been preserved. In 1934, Bloch was invited to speak at the ": null
    },
    {
        "London School of Economics": "london school of economics"
    },
    {
        ". There he met ": null
    },
    {
        "Eileen Power": "eileen power"
    },
    {
        ", ": null
    },
    {
        "R. H. Tawney": "r. h. tawney"
    },
    {
        " and ": null
    },
    {
        "Michael Postan": "michael postan"
    },
    {
        ", among others. While in London, he was asked to write a section of the Cambridge Economic History of Europe; at the same time, he also attempted to foster interest in the Annales among British historians. He later told Febvre in some ways he felt he had a closer affinity with academic life in England than that of France. For example, in comparing the ": null
    },
    {
        "Bibliothèque Nationale": "bibliothèque nationale de france"
    },
    {
        " with the ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        ", he said that     During this period he supported the ": null
    },
    {
        "Popular Front": "popular front"
    },
    {
        " politically. Although he did not believe it would do any good, he signed Alains—": null
    },
    {
        "Émile Chartiers": "émile chartier"
    },
    {
        " pseudonym": "pseudonym"
    },
    {
        "—petition against ": null
    },
    {
        "Paul Boncours": "paul boncour"
    },
    {
        " Militarisation": "militarisation"
    },
    {
        " laws in 1935. While he was opposed to the growth of ": null
    },
    {
        "European fascism": "fascism in europe"
    },
    {
        ", he also objected to demagogic appeals to the masses to fight it, as the ": null
    },
    {
        "Communist Party": "french communist party"
    },
    {
        " was doing. Febvre and Bloch were both firmly on the left, although with different emphases. Febvre, for example, was more militantly Marxist than Bloch, while the latter criticised both the ": null
    },
    {
        "pacifist left": "pacifism"
    },
    {
        " and corporate ": null
    },
    {
        "trade union": "trade union"
    },
    {
        "ism.     In 1934, ": null
    },
    {
        "Étienne Gilson": "étienne gilson"
    },
    {
        " sponsored Blochs candidacy for a chair at the Collège de France. The College, says the historian ": null
    },
    {
        "Eugen Weber": "eugen weber"
    },
    {
        ", was Blochs dream appointment, although one never to be realised, as it was one of the few institutions in France where personal research was central to lecturing. ": null
    },
    {
        "Camille Jullian": "camille jullian"
    },
    {
        " had died the previous year, and his position was now available. While he had lived, Julian had wished for his chair to go to one of his students, ": null
    },
    {
        "Albert Grenier": "albert grenier"
    },
    {
        ", and after his death, his colleagues generally agreed with him. However, Gilson proposed that not only should Bloch be appointed, but that the position be redesignated the study of comparative history. Bloch, says Weber, enjoyed and welcomed new schools of thought and ideas, but mistakenly believed the College should do so also. The College did not. The contest between Bloch and Grenier was not just the struggle for one post between two historians, but the path that historiography within the College would take for the next generation. To complicate the situation further, the country was in both ": null
    },
    {
        "political": "6 february 1934 crisis"
    },
    {
        " and ": null
    },
    {
        "economic crises": "great depression in france"
    },
    {
        ", and the College had had its budget slashed by 10%. No matter who filled it, this made another new chair financially unviable. By the end of the year, and with further retirements, the College had lost four professors: it could replace only one, and Bloch was not appointed. Bloch personally suspected his failure was due to anti-Semitism and ": null
    },
    {
        "Jewish quota": "jewish quota"
    },
    {
        "s. At the time, Febvre blamed it on a distrust of Blochs approach to scholarship by the academic establishment, although Epstein has argued that this could not have been an over-riding fear as Blochs next appointment indicated.       ": null
    },
    {
        "Henri Hauser": "henri hauser"
    },
    {
        " retired from the ": null
    },
    {
        "Sorbonne": "sorbonne university"
    },
    {
        " in 1936, and his ": null
    },
    {
        "chair": "chair"
    },
    {
        " in ": null
    },
    {
        "economic history": "economic history"
    },
    {
        " was up for appointment. Bloch— distancing himself from the encroaching threat of Nazi Germany —applied and was approved for his position. This was a more demanding position than the one he had applied for at the College. Weber has suggested Bloch was appointed because unlike at the College, he had not come into conflict with many faculty members. Weber researched the archives of the College in 1991 and discovered that Bloch had indicated an interest in working there as early as 1928, even though that would have meant him being appointed to the chair in ": null
    },
    {
        "numismatics": "numismatics"
    },
    {
        " rather than history. In a letter to the recruitment board written the same year, Bloch indicated that although he was not officially applying, he felt that this kind of work deserves to have its place one day in our great foundation of free scientific research . H. Stuart Hughes says of Blochs Sorbonne appointment: In another country, it might have occasioned surprise that a medievalist like Bloch should have been named to such a chair with so little previous preparation. In France it was only to be expected: no one else was better qualified . His first lecture was on the theme of never-ending history, a process, a never to be finished thing. Davies says his years at the Sorbonne were to be the most fruitful of Blochs career, and according to Epstein he was by now the most significant French historian of his age. In 1936, Friedman says he considered using Marx in his teachings, with the intention of bringing some fresh air into the Sorbonne.     The same year, Bloch and his family visited ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", where they were ": null
    },
    {
        "chaperoned": "chaperone"
    },
    {
        " by the Italian historian ": null
    },
    {
        "Gino Luzzatto": "gino luzzatto"
    },
    {
        ". During this period they were living in the ": null
    },
    {
        "Sèvres – Babylone": "sèvres – babylone"
    },
    {
        " area of Paris, next to the ": null
    },
    {
        "Hôtel Lutetia": "hôtel lutetia"
    },
    {
        ".     By now, Annales was being published six times a year to keep on top of current affairs, however, its outlook was gloomy . In 1938, the publishers withdrew support and, experiencing financial hardship, the journal moved to cheaper offices, raised its prices and returned to publishing quarterly. Febvre increasingly opposed the direction Bloch wanted to take the journal. Febvre wanted it to be a journal of ideas , whereas Bloch saw it as a vehicle for the exchange of information to different areas of scholarship.     By early 1939, war was known to be imminent. Bloch, in spite of his age, which automatically exempted him, had a ": null
    },
    {
        "reserve": "reservist"
    },
    {
        " commission for the army holding the rank of ": null
    },
    {
        "captain": "captain"
    },
    {
        ". He had already been mobilised twice in false alarms. In August 1939, he and his wife Simonne intended to travel to the ICHS in ": null
    },
    {
        "Bucharest": "bucharest"
    },
    {
        ". In autumn 1939, just before the outbreak of war, Bloch published the first volume of Feudal Society.       On 24 August 1939, at the age of 53, Bloch was mobilised for a third time, now as a fuel supply officer. He was responsible for the mobilisation of the French Armys massive ": null
    },
    {
        "motorised unit": "motorized unit"
    },
    {
        "s. This involved him undertaking such a detailed assessment of the French fuel supply that he later wrote he was able to count petrol tins and ration every drop of fuel he obtained. During the first few months of the war, called the ": null
    },
    {
        "Phoney War": "phoney war"
    },
    {
        ", he was stationed in Alsace. He possessed none of the eager patriotism with which he had approached the First World War. Instead, Carole Fink suggests that because Bloch felt himself to have been discriminated against, he had begun to distance himself intellectually and emotionally from his comrades and leaders . Back in Strasbourg, his main duty was the evacuation of civilians to behind the ": null
    },
    {
        "Maginot Line": "maginot line"
    },
    {
        ". Further transfers occurred, and Bloch was re-stationed to ": null
    },
    {
        "Molsheim": "molsheim"
    },
    {
        ", ": null
    },
    {
        "Saverne": "saverne"
    },
    {
        ", and eventually to the ": null
    },
    {
        "1st Army": "1st army"
    },
    {
        " headquarters in ": null
    },
    {
        "Picardy": "picardy"
    },
    {
        ", where he joined the Intelligence Department, in liaison with the ": null
    },
    {
        "British": "british expeditionary force"
    },
    {
        ".     Bloch was largely bored between 1939 and May 1940 as he often had little work to do. To pass the time and occupy himself, he decided to begin writing a history of France. To this end, he purchased notebooks and began to work out a structure for the work. Although never completed, the pages he managed to write, in his cold, poorly lit rooms , eventually became the kernel of The Historians Craft. At one point he expected to be invited to neutral ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " to deliver a series of lectures in ": null
    },
    {
        "Liège": "liège"
    },
    {
        ". These never took place, however, disappointing Bloch very much; he had planned to speak on Belgian ": null
    },
    {
        "neutrality": "neutral country"
    },
    {
        ". He also turned down the opportunity to travel to Oslo as an ": null
    },
    {
        "attaché": "attaché duty"
    },
    {
        " to the French Military Mission there. He was considered an excellent candidate for the position due to his fluency in Norwegian and knowledge of the country. Bloch considered it and came close to accepting; ultimately, though, it was too far from his family, whom he rarely saw enough of in any case. Some academics had escaped France for ": null
    },
    {
        "The New School": "the new school"
    },
    {
        " in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", and the School also invited Bloch. He refused, possibly because of difficulties in obtaining ": null
    },
    {
        "visas": "travel visa"
    },
    {
        ": the US government would not grant visas to every member of his family.          In May 1940, the German army outflanked the French and forced them to withdraw. Facing capture in ": null
    },
    {
        "Rennes": "rennes"
    },
    {
        ", Bloch disguised himself in civilian clothes and lived under German occupation for a fortnight before returning to his family at their country home in ": null
    },
    {
        "Fougères": "fougères"
    },
    {
        ". He fought at the ": null
    },
    {
        "Battle of Dunkirk": "battle of dunkirk"
    },
    {
        " in May–June 1940 and was ": null
    },
    {
        "evacuated to England": "dunkirk evacuation"
    },
    {
        " with the ": null
    },
    {
        "British Expeditionary Force": "british expeditionary force"
    },
    {
        " on the requisitioned ": null
    },
    {
        "steamer": "steamship"
    },
    {
        " MV Royal Daffodil": "mv royal daffodil"
    },
    {
        ", which he later described as taking place under golden skies coloured by the black and fawn smoke . Before the evacuation, Bloch ordered the immediate burning of fuel supplies. Although he could have remained in Britain, he chose to return to France the day he arrived because his family was still there.     Bloch felt that the French Army lacked the  esprit de corps  or fervent fraternity  of the French Army in the First World War. He saw the French generals of 1940 as behaving as unimaginatively as ": null
    },
    {
        "Joseph Joffre": "joseph joffre"
    },
    {
        " had in the first war. He did not, however, believe that the earlier war was an indication of how the next would progress: no two successive wars , he wrote in 1940, are ever the same war .     To Bloch, France collapsed because her generals failed to capitalise on the best qualities humanity possessed—character and intelligence—because of their own sluggish and intractable progress since World War I. He was horrified by the defeat which, Carole Fink has suggested, he saw as being worse, for both France and the world, than her previous defeats at ": null
    },
    {
        "Waterloo": "battle of waterloo"
    },
    {
        " and ": null
    },
    {
        "Sedan": "battle of sedan"
    },
    {
        ". Bloch understood the reasons for Frances sudden defeat: not in the rumours of British betrayal, communist ": null
    },
    {
        "fifth columns": "fifth column"
    },
    {
        "or fascist plots, but in her failure to ": null
    },
    {
        "motorise": "motorized infantry"
    },
    {
        ", and perhaps more importantly, her failure to understand what motorisation meant. He understood that it was the latter that allowed the French army to become bogged down in Belgium, and this had been compounded by the French armys slow retreat. He wrote in Strange Defeat that a fast, motorised retreat might have saved the army.     Two-thirds of France was occupied by Germany. Bloch, one of the only elderly academics to volunteer, was demobilised soon after ": null
    },
    {
        "Philippe Pétains": "philippe pétain"
    },
    {
        "government signed the ": null
    },
    {
        "Armistice of 22 June 1940": "armistice of 22 june 1940"
    },
    {
        " forming ": null
    },
    {
        "Vichy France": "vichy france"
    },
    {
        " in the remaining southern-third of the country. Bloch moved south, where in January 1941, he applied for and received one of only ten exemptions to the ban on employing Jewish academics the Vichy government made. This was probably due to Blochs pre-eminence in the field of history. He was allowed to work at the University of Strasbourg-in-exile , the universities of ": null
    },
    {
        "Clermont-Ferrand": "university of clermont-ferrand"
    },
    {
        ", and Montpellier. The latter, further south, was beneficial to his wifes health, which was in decline. The ": null
    },
    {
        "dean of faculty": "dean"
    },
    {
        " at Montpellier was ": null
    },
    {
        "Augustin Fliche": "augustin fliche"
    },
    {
        ", an ": null
    },
    {
        "ecclesiastical historian": "ecclesiastical historian"
    },
    {
        " of the Middle Ages, who, according to Weber, made no secret of his antisemitism . He disliked Bloch further for having once given him a poor ": null
    },
    {
        "review": "peer review"
    },
    {
        ". Fliche not only opposed Blochs transfer to Montpellier but made his life uncomfortable when he was there. The Vichy government was attempting to promote itself as a return to traditional French values. Bloch condemned this as propaganda; the rural idyll that Vichy said it would return France to was impossible, he said, because the idyllic, docile peasant life of the French right had never existed .       Blochs professional relationship with Febvre was also under strain. The Nazis wanted French ": null
    },
    {
        "editorial boards": "editorial board"
    },
    {
        "to be stripped of Jews in accordance with German ": null
    },
    {
        "racial policies": "racial policy of nazi germany"
    },
    {
        "; Bloch advocated disobedience, while Febvre was passionate about the survival of Annales at any cost. He believed that it was worth making concessions to keep the journal afloat and to keep Frances intellectual life alive. Bloch rejected out of hand any suggestion that he should, in his words, fall into line . Febvre also asked Bloch to resign as joint-editor of the journal. Febvre feared that Blochs involvement, as a Jew in Nazi-occupied France, would hinder the journals distribution. Bloch, forced to accede, turned the Annales over to the sole editorship of Febvre, who then changed the journals name to ": null
    },
    {
        "Mélanges dHistoire Sociale": "mélanges dhistoire sociale"
    },
    {
        ". Bloch was forced to write for it under the pseudonym Marc Fougères. The journals bank account was also in Blochs name; this too had to go. Henri Hauser supported Febvres position, and Bloch was offended when Febvre intimated that Hauser had more to lose than both of them. This was because, whereas Bloch had been allowed to retain his research position, Hauser had not. Bloch interpreted Febvres comment as implying that Bloch was not a victim. Bloch, alluding to his ethnicity, replied that the difference between them was that, whereas he feared for his children because of their Jewishness, Febvres children were in no more danger than any other man in the country.     The Annalist historian ": null
    },
    {
        "André Burguière": "andré burguière"
    },
    {
        " suggests Febvre did not really understand the position Bloch, or any French Jew, was in. Already damaged by this disagreement, Blochs and Febvres relationship declined further when the former had been forced to leave his library and papers in his Paris apartment following his move to Vichy. He had attempted to have them transported to his ": null
    },
    {
        "Creuse": "creuse"
    },
    {
        " residence, but the Nazis—who had made their headquarters in the hotel next to Blochs apartment—looted his rooms and confiscated his library in 1942. Bloch held Febvre responsible for the loss, believing he could have done more to prevent it.     Blochs mother had recently died, and his wife was ill; furthermore, although he was permitted to work and live, he faced daily harassment. On 18 March 1941, Bloch made his ": null
    },
    {
        "will": "will and testament"
    },
    {
        " in Clermont-Ferrand. The Polish social historian ": null
    },
    {
        "Bronisław Geremek": "bronisław geremek"
    },
    {
        " suggests that this document hints at Bloch in some way foreseeing his death, as he emphasised that nobody had the right to avoid fighting for their country. In March 1942 Bloch and other French academics such as ": null
    },
    {
        "Georges Friedmann": "georges friedmann"
    },
    {
        " and ": null
    },
    {
        "Émile Benveniste": "émile benveniste"
    },
    {
        ", refused to join or condone the establishment of the ": null
    },
    {
        "Union Générale des Israelites des France": "judenrat"
    },
    {
        " by the Vichy government, a group intended to include all Jews in France, both of birth and immigration.          In November 1942, as part of an operation known as ": null
    },
    {
        "Case Anton": "case anton"
    },
    {
        ", the German Army crossed the ": null
    },
    {
        "demarcation line": "demarcation line"
    },
    {
        " and occupied the territory previously under direct Vichy rule. This was the catalyst for Blochs decision to join the ": null
    },
    {
        "French Resistance": "french resistance"
    },
    {
        " sometime between late 1942 and March 1943. Bloch was careful not to join simply because of his ethnicity or the laws that were passed against it. As Burguière has pointed out, and Bloch would have known, taking such a position would effectively indict all Jews who did not join . Burguière has pinpointed Blochs motive for joining the Resistance in his characteristic refusal to mince his words or play half a role. Bloch had previously expressed the view that there can be no salvation where there is not some sacrifice . He sent his family away, and returned to Lyon to join the underground.     In spite of knowing a number of ": null
    },
    {
        "francs-tireurs": "francs-tireurs et partisans"
    },
    {
        " around Lyon, Bloch still found it difficult to join them because of his age. Although the Resistance recruited heavily among university lecturers—and indeed, Blochs ": null
    },
    {
        "alma mater": "alma mater"
    },
    {
        ", the École Normale Superieur, provided it with many members—he commented in exasperation to Simonne that he didnt know it is so difficult to offer ones life . The French historian and philosopher ": null
    },
    {
        "François Dosse": "françois dosse"
    },
    {
        " quotes a member of the franc-tireurs active with Bloch as later describing how that eminent professor came to put himself at our command simply and modestly . Bloch utilised his professional and military skills on their behalf, writing propaganda for them and organising their supplies and ": null
    },
    {
        "materiel": "materiel"
    },
    {
        ", becoming a regional organiser. Bloch also joined the  Mouvements Unis de la Résistance  , section R1, and edited the underground newsletter, Cahiers Politique. He went under various pseudonyms: Arpajon, Chevreuse, Narbonne. Often on the move, Bloch used ": null
    },
    {
        "archival research": "archival research"
    },
    {
        " as his excuse for travelling. The journalist-turned-resistance fighter ": null
    },
    {
        "Georges Altman": "georges altman"
    },
    {
        " later told how he knew Bloch as, although originally a man, made for the creative silence of gentle study, with a cabinet full of books was now running from street to street, deciphering secret letters in some Lyonaisse Resistance garret ; all Blochs notes were kept in code. For the first time, suggests Lyon, Bloch was forced to consider the role of the individual in history, rather than the collective; perhaps by then even realising he should have done so earlier.         Bloch was arrested at the Place de Pont, Lyon, during a major ": null
    },
    {
        "roundup": "roundup"
    },
    {
        " by the Vichy  milice  on 8 March 1944, and handed over to ": null
    },
    {
        "Klaus Barbie": "klaus barbie"
    },
    {
        " of the ": null
    },
    {
        "Lyon Gestapo": "gestapo"
    },
    {
        ". Bloch was using the pseudonym Maurice Blanchard , and in appearance was an ageing gentleman, rather short, grey-haired, bespectacled, neatly dressed, holding a briefcase in one hand and a cane in the other . He was renting a room above a dressmakers on the rue des Quatre Chapeaux; the Gestapo raided the place the following day. It is possible Bloch had been ": null
    },
    {
        "denounced": "denunciation"
    },
    {
        " by a woman working in the shop. In any case, they found a radio transmitter and many papers. Bloch was imprisoned in ": null
    },
    {
        "Montluc prison": "montluc prison"
    },
    {
        ", during which time his wife died. He was tortured with, for example, ice-cold baths which knocked him out. His ribs and a wrist were broken, which led to his being returned to his cell unconscious. He eventually caught ": null
    },
    {
        "bronchopneumonia": "bronchopneumonia"
    },
    {
        " and fell seriously ill. It was later claimed that he gave away no information to his interrogators, and while incarcerated taught French history to other inmates.          In the meantime, the allies had ": null
    },
    {
        "invaded Normandy": "invasion of normandy"
    },
    {
        " on 6 June 1944. As a result, the Nazi regime was keen to evacuate and wanted to liquidate their holdings  in France; this meant disposing of as many prisoners as they could. Between May and June 1944 around 700 prisoners were shot in scattered locations to avoid the risk of this becoming common knowledge and inviting Resistance reprisals around southern France. Among those killed was Bloch, one of a group of 26 Resistance prisoners picked out in Montluc and driven along the ": null
    },
    {
        "Saône": "saône"
    },
    {
        " towards ": null
    },
    {
        "Trévoux": "trévoux"
    },
    {
        " on the night of 16 June 1944. Driven to a field near ": null
    },
    {
        "Saint-Didier-de-Formans": "saint-didier-de-formans"
    },
    {
        ", they were shot by the Gestapo in groups of four. According to Lyon, Bloch spent his last moments comforting a 16-year-old beside him who was worried that the bullets might hurt. Bloch fell first, reputedly shouting Vive la France  before being shot. A ": null
    },
    {
        "coup de grâce": "coup de grâce"
    },
    {
        " was delivered. One man managed to crawl away and later provided a detailed report of events; the bodies were discovered on 26 June. For some time Blochs death was merely a dark rumour  until it was confirmed to Febvre.     At his burial, his own words were read at the graveside. With them, Bloch proudly acknowledged his Jewish ancestry while denying religion in favour of his being foremost a Frenchman. He described himself as a stranger to any formal religious belief as well as any supposed racial solidarity, I have felt myself to be, quite simply French before anything else . According to his instructions, no orthodox prayers were said over his grave, and on it was to be carved his epitaph dilexi veritatem . In 1977, his ashes were transferred from St-Didier to Fougeres and the gravestone was inscribed as he requested.     Febvre had not approved of Blochs decision to join the Resistance, believing it to be a waste of his brain and talents, although, as Davies points out, such a fate befell many other French intellectuals . Febvre continued publishing Annales, , dividing his time between his country ": null
    },
    {
        "château": "château"
    },
    {
        " in the ": null
    },
    {
        "Franche-Comté": "franche-comté"
    },
    {
        " and working at the École Normale in Paris. This caused some outrage, and, after ": null
    },
    {
        "liberation": "liberation of paris"
    },
    {
        ", when classes were returning to a degree of normality, he was booed by his students at the Sorbonne.          Blochs first book was LIle de France, published in 1913. A small book, Lyon calls it light, readable and far from trivial , and showing the influence of ": null
    },
    {
        "H. J. Fleure": "h. j. fleure"
    },
    {
        " in how Bloch combined discussion on geography, language and archaeology. It was translated into English in 1971. Davies says 1920s Rois et Serfs, , is a long and rather meandering essay , although it had the potential to be Blochs definitive monograph upon the single topic that might have evoked his genius at his fullest , the transition from ": null
    },
    {
        "antiquity": "classical antiquity"
    },
    {
        " to the Middle Ages. Loyn also describes it as a loose-knit monograph , and a program to move forward rather than a full-length academic text.     Blochs most important early work—based on his doctoral dissertation—was published in 1924 as Rois et Thaumaturges; it was published in English as The Royal Touch: Monarchy and Miracles in France and England in 1973. Here he examined medieval belief in the ": null
    },
    {
        "royal touch": "royal touch"
    },
    {
        ", and the degree to which kings used such a belief for propaganda purposes. It was also the first example of Blochs inter-disciplinary approach, as he utilised research from the fields of anthropology, medicine, psychology and ": null
    },
    {
        "iconography": "iconography"
    },
    {
        ". It has been described as Blochs first masterwork. It has a 500-page descriptive analysis of the medieval view of royalty effectively possessing supernatural powers. Verging on the ": null
    },
    {
        "antiquarian": "antiquarian"
    },
    {
        " in his microscopic approach, and much influenced by the work of ": null
    },
    {
        "Raymond Crawfurd": "raymond crawfurd"
    },
    {
        "—who saw it as a dubious if exotic aspect of medicine, rather than history—Bloch makes diverse use of evidence from different disciplines and periods, assessing the ": null
    },
    {
        "Kings Evil": "kings evil"
    },
    {
        " as far forward as the 19th century. The book had originally been inspired by discussions Bloch had with Louis, who acted as a medical consultant while his brother worked on it. Bloch concluded that the royal touch involved a degree of ": null
    },
    {
        "mass delusion": "mass delusion"
    },
    {
        " among those who witnessed it.     1931 saw the publication of Les caractéres originaux de lhistoire rurale francaise. In this—what Bloch called mon petit livre —he used both the traditional techniques of historiographical analysis and his newer, multi-faceted approach, with a heavy emphasis on maps as evidence. Bloch did not allow his new methods to detract from the former: he knew, says the historian Daniel Chirot, that the traditional methods of research were the bread and butter of historical work. One had to do it well to be a minimally accepted historian . The first of two classic works , says Hughes, and possibly his finest, studies the relationship between physical geographical location and the development of political institutions. Loyn has called Blochs assessment of medieval French rural law great, but with the addendum that he is not so good at describing ordinary human beings. He is no Eileen Power, and his peasants do not come to life as hers do . In this study, Chirot says Bloch entirely abandoned the concept of linear history, and wrote, instead, from the present or near past into the distant past, and back towards the present . Febvre wrote the introduction to the book for its publication, and described the technique as reading the past from the present , or what Bloch saw as starting with the known and moving into the unknown.       La Société Féodale was published in two volumes  in 1939, and was translated into English as ": null
    },
    {
        "Feudal Society": "feudal society"
    },
    {
        " in 1961. Bloch described the study as something of a sketch, although Stirling has called it his most enduring work ... still a cornerstone of medieval curricula  in 2007 and representative of Bloch at the peak of his career. In Feudal Society he used research from the broadest range of disciplines to date to examine feudalism in the broadest possible way—most notably including a study of ": null
    },
    {
        "feudal Japan": "feudal japan"
    },
    {
        ". He also compared areas where feudalism was imposed, rather than organically developed  and where it was never established . Bloch defined feudal society as, from the peasants point of view , politically fragmentary, where they are ruled by an aristocratic upper-class.     Daniel Chirot has described The Royal Touch, French Rural History and Feudal Society—all of which concentrate on the French Middle Ages—as Blochs most significant works. Conversely, his last two— The Historians Craft  and Strange Defeat—have been described as unrepresentative of his historical approach in that they discuss contemporary events in which Bloch was personally involved and without access to primary sources. Strange Defeat was uncompleted at the time of his death, and both were published posthumously in 1949. Davies has described The Historians Craft as beautifully sensitive and profound ; the book was written in response to his son, Étienne, asking his father, what is history? . In his introduction, Bloch wrote to Febvre.          Likewise,  Strange Defeat , in the words of ": null
    },
    {
        "R. R. Davies": "r. r. davies"
    },
    {
        ", is a damning and even intolerant analysis  of the long- and short-term reasons ": null
    },
    {
        "France fell in 1940": "fall of france"
    },
    {
        ". Bloch affirmed that the book was more than a personal memoir; rather, he intended it as a deposition and a testament. It contains— uncomfortably and honestly —Blochs own self-appraisal:          Bloch emphasises failures in the French mindset: in the loss of morale of the soldiery and a failed education of the officers, effectively a failure of both character and intelligence on behalf of both. He condemns the mania for ": null
    },
    {
        "testing": "test"
    },
    {
        " in education which, he felt, treated the testing as being an end in itself, draining generations of Frenchmen and Frenchwomen of originality and initiative or thirst for knowledge, and an appreciation only of successful cheating and sheer luck . Strange Defeat has been called Blochs autopsy of the France of the inter-war years.     A collection of essays was published in English in 1961 as Land and Work in Medieval Europe. The long essay was a favoured medium of Blochs, including, Davies says, the famous essay on the water mill and the much-challenged one on the problem of gold in medieval Europe . In the former, Bloch saw one of the most important technological advances of the era, in the latter, the effective creation of a European currency. Although one of his best essays, according to Davies— Liberté et servitude personelles au Moyen Age, particulement en France —was not published when it could have been; this, he remarked was an unpardonable omission .       Davies says Bloch was no mean disputant  in ": null
    },
    {
        "historiographical": "historiographical"
    },
    {
        " debate, often ": null
    },
    {
        "reducing an opponents argument": "reductio ad absurdum"
    },
    {
        " to its most basic weaknesses. His approach was a reaction against the prevailing ideas within French historiography of the day which, when he was young, were still very much based on that of the German School, pioneered by ": null
    },
    {
        "Leopold von Ranke": "leopold von ranke"
    },
    {
        ". Within French historiography this led to a forensic focus on ": null
    },
    {
        "administrative history": "administrative history"
    },
    {
        " as expounded by historians such as ": null
    },
    {
        "Ernest Lavisse": "ernest lavisse"
    },
    {
        ". While he acknowledged his and his generation of historians debt to their predecessors, he considered that they treated historical research as being little more meaningful than detective work. Bloch later wrote how, in his view, There is no waste more criminal than that of erudition running ... in neutral gear, nor any pride more vainly misplaced than that in a tool valued as an end in itself . He believed it was wrong for historians to focus on the evidence rather than the human condition of whatever period they were discussing. Administrative historians, he said, understood every element of a government department without understanding anything of those who worked in it.     Bloch was very much influenced by ": null
    },
    {
        "Ferdinand Lot": "ferdinand lot"
    },
    {
        ", who had already written comparative history, and by the work of ": null
    },
    {
        "Jules Michelet": "jules michelet"
    },
    {
        " and ": null
    },
    {
        "Fustel de Coulanges": "fustel de coulanges"
    },
    {
        " with their emphasis on social history, Durkheims sociological methodology, ": null
    },
    {
        "François Simiands": "françois simiand"
    },
    {
        " social economics, and ": null
    },
    {
        "Henri Bergsons": "henri bergson"
    },
    {
        " philosophy of ": null
    },
    {
        "collectivism": "collectivism"
    },
    {
        ". Blochs emphasis on using comparative history harked back to the ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        ", when writers such as ": null
    },
    {
        "Voltaire": "voltaire"
    },
    {
        " and ": null
    },
    {
        "Montesquieu": "montesquieu"
    },
    {
        " decried the notion that history was a linear narrative of individuals and pushed for a greater use of philosophy in studying the past. Bloch condemned the German-dominated school of ": null
    },
    {
        "political economy": "political economy"
    },
    {
        ", which he considered analytically unsophisticated and riddled with distortions . Equally condemned were then-fashionable ideas on ": null
    },
    {
        "racial theories": "racial identity"
    },
    {
        " of ": null
    },
    {
        "national identity": "national identity"
    },
    {
        ". Bloch believed that political history on its own could not explain deeper ": null
    },
    {
        "socioeconomics": "socioeconomics"
    },
    {
        " trends and influences.     Bloch did not see social history as being a separate field within historical research. Rather, he saw all aspects of history to be inherently a part of social history. By definition, all history was social history, an approach he and Febvre termed  histoire totale , not a focus on points of fact such as dates of battles, reigns, and changes of leaders and ministries, and a general confinement by the historian to what he can identify and verify. Bloch explained in a letter to Pirenne that, in Blochs eyes, the historians most important quality was the ability to be surprised by what he found— I am more and more convinced of this , he said; damn those of us who believe everything is normal! Bloch identified two types of historical era: the generational era and the era of civilisation: these were defined by the speed with which they underwent change and development. In the latter type of period, which changed gradually, Bloch included physical, structural and psychological aspects of society, while the generational era could experience fundamental change over a relatively few generations. Bloch founded what modern French historians call the regressive method of historical scholarship. This method avoids the necessity of relying solely on historical documents as a source, by looking at the issues visible in later historical periods and drawing from them what they may have looked like centuries earlier. Davies says this was particularly useful in Blochs study of village communities as the strength of communal traditions often preserves earlier customs in a more or less fossilized state . Bloch studied peasant tools in museums, and in action, and discussed their use with the people themselves. He believed that in observing a plough or an annual harvest one was observing history, as more often than not both the technology and the technique were much the same as they had been hundreds of years earlier. However, the individuals themselves were not his focus, which was on the collectivity, the community, the society . He wrote about the peasantry, rather than the individual peasant; says Lyon, he roamed the provinces to become familiar with French agriculture over the long term, with the contours of peasant villages, with agrarian routine, its sounds and smells. Bloch claimed that both fighting alongside the peasantry in the war and his historical research into their history had shown him the vigorous and unwearied quickness  of their minds.     Bloch described his area of study as the comparative history of European society and explained why he did not identify himself as a medievalist: I refuse to do so. I have no interest in changing labels, nor in clever labels themselves, or those that are thought to be so.  He did not leave a full study of his ": null
    },
    {
        "methodology": "methodology"
    },
    {
        ", although it can be effectively reconstructed piecemeal. He believed that history was the science of movement , but did not accept, for example, the aphorism that one could protect against the future by studying the past. His did not use a revolutionary approach to historiography; rather, he wished to combine the schools of thinking that preceded him into a new broad approach to history and, as he wrote in 1926, to bring to history ce murmure qui nétait pas de la mort , . He criticised what he called the idol of the origins , where historians concentrate overly hard on the formation of something to the detriment of studying the thing itself.     Blochs comparative history led him to tie his researches in with those of many other schools: social sciences, linguistics, ": null
    },
    {
        "philology": "philology"
    },
    {
        ", comparative literature, folklore, geography and ": null
    },
    {
        "agronomy": "agronomy"
    },
    {
        ". Similarly, he did not restrict himself to French history. At various points in his writings Bloch commented on medieval Corsican, Finnish, Japanese, Norwegian and Welsh history. R. R. Davies has compared Blochs intelligence with what he calls that of the Maitland of the 1890s , regarding his breadth of reading, use of language and ": null
    },
    {
        "multidisciplinary": "multidisciplinarity"
    },
    {
        " approach. Unlike ": null
    },
    {
        "Maitland": "f. w. maitland"
    },
    {
        ", however, Bloch also wished to synthesise ": null
    },
    {
        "scientific history": "scientific history"
    },
    {
        " with ": null
    },
    {
        "narrative history": "narrative history"
    },
    {
        ". According to Stirling, he managed to achieve an imperfect and volatile imbalance between them. Bloch did not believe that it was possible to understand or recreate the past by the mere act of compiling facts from sources; rather, he described a source as a witness, and like most witnesses , he wrote, it rarely speaks until one begins to question it . Likewise, he viewed historians as detectives who gathered evidence and testimony, as ": null
    },
    {
        "juges dinstruction": "juge dinstruction"
    },
    {
        " charged with a vast enquiry of the past .          Bloch was not only interested in periods or aspects of history but in the importance of history as a subject, regardless of the period, of intellectual exercise. Davies writes, he was certainly not afraid of repeating himself; and, unlike most English historians, he felt it his duty to reflect on the aims and purposes of history . Bloch considered it a mistake for the historian to confine himself overly rigidly to his own discipline. Much of his editorializing in Annales emphasised the importance of parallel evidence to be found in neighbouring fields of study, especially ": null
    },
    {
        "archaeology": "archaeology"
    },
    {
        ", ": null
    },
    {
        "ethnography": "ethnography"
    },
    {
        ", ": null
    },
    {
        "geography": "geography"
    },
    {
        ", ": null
    },
    {
        "literature": "literature"
    },
    {
        ", ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", ": null
    },
    {
        "sociology": "sociology"
    },
    {
        ", ": null
    },
    {
        "technology": "technology"
    },
    {
        ", ": null
    },
    {
        "air photography": "air photography"
    },
    {
        ", ": null
    },
    {
        "ecology": "ecology"
    },
    {
        ", ": null
    },
    {
        "pollen analysis": "pollen analyses"
    },
    {
        " and ": null
    },
    {
        "statistics": "statistics"
    },
    {
        ". In Blochs view, this provided not just for a broader field of study, but a far more comprehensive understanding of the past than would be possible from relying solely on historical sources. Blochs favourite example of how technology impacts society was the ": null
    },
    {
        "watermill": "watermill"
    },
    {
        ". This can be summed up as illustrating how it was known of but little used in the classical period; it became an economic necessity in the early medieval period; and finally, in the later Middle Ages it represented a scarce resource increasingly concentrated in the nobilitys hands.     Bloch also emphasised the importance of geography in the study of history, and particularly in the study of rural history. He suggested that, fundamentally, they were the same subjects, although he criticised geographers for failing to take historical chronology or ": null
    },
    {
        "human agency": "human agency"
    },
    {
        " into account. Using a farmers field as an example, he described it as fundamentally, a human work, built from generation to generation . Bloch also condemned the view that rural life was immobile. He believed that the Gallic farmer of the Roman period was inherently different to his 18th-century descendants, cultivating different plants, in a different way. He saw England and Frances agricultural history as developing similarly, and, indeed, discovered an ": null
    },
    {
        "Enclosure Movement": "enclosure movement"
    },
    {
        " in France throughout the 15th, 16th and 17th centuries on the basis that it had been occurring in England in similar circumstances. Bloch also took a deep interest in the field of linguistics and their use of the ": null
    },
    {
        "comparative method": "comparative method"
    },
    {
        ". He believed that using the method in historical research could prevent the historian from ignoring the broader context in the course of his detailed local researches: a simple application of the comparative method exploded the ethnic theories of historical institutions, beloved of so many German historians .            Bloch was not a tall man, being  in height and an elegant dresser. Eugen Weber has described Blochs handwriting as impossible . He had expressive blue eyes, which could be mischievous, inquisitive, ironic and sharp . Febvre later said that when he first met Bloch in 1902, he found a slender young man with a timid face . Bloch was proud of his familys history of defending France: he later wrote, My great-grandfather was a serving soldier in 1793; ... my father was one of the defenders of Strasbourg in 1870 ... I was brought up in the traditions of patriotism which found no more fervent champions than the Jews of the Alsatian exodus .     Bloch was a committed supporter of the Third Republic and politically left wing. He was not a ": null
    },
    {
        "Marxist": "marxism"
    },
    {
        ", although he was impressed by ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        " himself, whom he thought was a great historian if possibly an unbearable man personally. He viewed contemporary politics as purely moral decisions to be made. He did not, however, let it enter into his work; indeed, he questioned the very idea of a historian studying politics. He believed that society should be governed by the young, and, although politically he was a moderate, he noted that revolutions generally promote the young over the old: even the Nazis had done this, while the French had done the reverse, bringing to power a generation of the past . According to Epstein, following the First World War, Bloch presented a curious lack of empathy and comprehension for the horrors of modern warfare , while ": null
    },
    {
        "John Lewis Gaddis": "john lewis gaddis"
    },
    {
        " has found Blochs failure to condemn ": null
    },
    {
        "Stalinism": "stalinism"
    },
    {
        " in the 1930s disturbing . Gaddis suggests that Bloch had ample evidence of Stalins crimes and yet sought to shroud them in utilitarian calculations about the price of what he called progress .     Although Bloch was very reserved—and later acknowledged that he had generally been old-fashioned and timid with women—he was good friends with Lucien Febvre and Christian Pfister. In July 1919 he married Simonne Vidal, a cultivated and discreet, timid and energetic  woman, at a ": null
    },
    {
        "Jewish wedding": "jewish wedding"
    },
    {
        ". Her father was the ": null
    },
    {
        "Inspecteur-Général de Ponts et Chaussées": "ponts et chaussées"
    },
    {
        ", and a very prosperous and influential man. Undoubtedly, says Friedman, his wifes family wealth allowed Bloch to focus on his research without having to depend on the income he made from it. Bloch was later to say he had found great happiness with her, and that he believed her to have also found it with him. They had six children together, four sons and two daughters. The eldest two were a daughter Alice, and a son, Étienne. As his father had done with him, Bloch took a great interest in his childrens education, and regularly helped with their ": null
    },
    {
        "homework": "homework"
    },
    {
        ". He could, though, be caustically critical  of his children, particularly Étienne. Bloch accused him in one of his wartime letters of having poor manners, being lazy and stubborn, and of being possessed occasionally by evil demons . Regarding the facts of life, Bloch told Etienne to attempt always to avoid what Bloch termed contaminated females .     Bloch was certainly ": null
    },
    {
        "agnostic": "agnosticism"
    },
    {
        ", if not ": null
    },
    {
        "atheist": "atheism"
    },
    {
        ", in matters of religion. His son Étienne later said of his father, in his life as well as his writings not even the slightest trace of a supposed Jewish identity can be found. Marc Bloch was simply French . Some of his pupils believed him to be an ": null
    },
    {
        "Orthodox Jew": "orthodox jew"
    },
    {
        ", but Loyn says this is incorrect. While Blochs Jewish roots were important to him, this was the result of the political tumult of the Dreyfuss years, said Loyn: that it was only anti-semitism that made him want to affirm his Jewishness .     Blochs brother Louis became a doctor, and eventually the head of the ": null
    },
    {
        "diphtheria": "diphtheria"
    },
    {
        " section of the ": null
    },
    {
        "Hôpital des Enfants-Malades": "hôpital des enfants-malades"
    },
    {
        ". Louis died prematurely in 1922. Their father died in March the following year. Following these deaths, Bloch took on responsibility for his ageing mother as well as his brothers widow and children. Eugen Weber has suggested that Bloch was probably a ": null
    },
    {
        "monomania": "monomania"
    },
    {
        "c who, in Blochs own words, abhorred falsehood . He also abhorred, as a result of both the Franco-Prussian war and more recently World War One, ": null
    },
    {
        "German nationalism": "german nationalism"
    },
    {
        ". This extended to that countrys culture and scholarship, and is probably the reason he never debated with ": null
    },
    {
        "German historians": "german historiography"
    },
    {
        ". Indeed, in Blochs later career, he rarely mentioned even those German historians with whom he must, professionally, have felt an affinity, such as ": null
    },
    {
        "Karl Lamprecht": "karl gotthard lamprecht"
    },
    {
        ". Lyon says Lamprecht had denounced what he saw as the German obsession with political history and had focused on ": null
    },
    {
        "art": "art history"
    },
    {
        " and comparative history, thus infuriat the Rankianer . Bloch once commented, on English historians, that en Angleterre, rien quen Angleterre  . He was not, though, particularly critical of English historiography, and respected the long tradition of rural history in that country as well as more materially the government funding that went into historical research there.          It is possible, argues Weber, that had Bloch survived the war, he would have stood to be appointed ": null
    },
    {
        "Minister of Education": "ministry of national education"
    },
    {
        " in a post-war government and reformed the education system he had condemned for losing France the war in 1940. Instead, in 1948, his son Étienne offered the ": null
    },
    {
        "Archives Nationales": "archives nationales"
    },
    {
        " his fathers papers for repository, but they rejected the offer. As a result, the material was placed in the vaults of the École Normale Supérieure, where it lay untouched for decades .     ": null
    },
    {
        "Intellectual historian": "intellectual history"
    },
    {
        " Peter Burke": "peter burke"
    },
    {
        " named Bloch the leader of what he called the French Historical Revolution , and Bloch became an icon for the post-war generation of new historians. Although he has been described as being, to some extent, the object of a ": null
    },
    {
        "cult": "cult"
    },
    {
        " in both England and France— one of the most influential historians of the twentieth century  by Stirling, and the greatest historian of modern times by ": null
    },
    {
        "John H. Plumb": "john h. plumb"
    },
    {
        "—this is a reputation mostly acquired postmortem. Henry Loyn suggests it is also one which would have amused and amazed Bloch. According to Stirling, this posed a particular problem within French historiography when Bloch effectively had ": null
    },
    {
        "martyr": "martyr"
    },
    {
        "dom bestowed upon him after the war, leading to much of his work being overshadowed by the last months of his life. This led to indiscriminate heaps of praise under which he is now almost hopelessly buried . This is partly at least the fault of historians themselves, who have not critically re-examined Blochs work but rather treat him as a fixed and immutable aspect of the historiographical background.     At the turn of the millennium there is a woeful lack of critical engagement with Marc Blochs writing in contemporary academic circles according to Stirling. His legacy has been further complicated by the fact that the second generation of Annalists led by ": null
    },
    {
        "Fernand Braudel": "fernand braudel"
    },
    {
        " has co-opted his memory , combining Blochs academic work and Resistance involvement to create a founding myth . The aspects of his life which made Bloch easy to beatify have been summed up by ": null
    },
    {
        "Henry Loyn": "henry loyn"
    },
    {
        " as Frenchman and Jew, scholar and soldier, staff officer and Resistance worker ... articulate on the present as well as the past .      The first critical biography of Bloch did not appear until Carole Finks Marc Bloch: A Life in History was published in 1989. This, wrote ": null
    },
    {
        "S. R. Epstein": "s. r. epstein"
    },
    {
        ", was the professional, extensively researched and documented story of Blochs life, and, he commented, probably had to overcome a strong sense of protectiveness among the guardians of Blochs and the Annales memory . Since then, continuing scholarship—such as that by Stirling, who calls Bloch a visionary, although a flawed one—has been more critically objective of Blochs recognisable weaknesses. For example, although he was a keen advocate for chronological precision and textual accuracy, his only major work in this area, a discussion of ": null
    },
    {
        "Osbert of Clares": "osbert of clare"
    },
    {
        " Life of Edward the Confessor": "vita ædwardi regis"
    },
    {
        ", was subsequently seriously criticised  by later experts in the field such as ": null
    },
    {
        "R. W. Southern": "r. w. southern"
    },
    {
        " and ": null
    },
    {
        "Frank Barlow": "frank barlow"
    },
    {
        "; Epstein later suggested Bloch was a mediocre theoretician but an adept artisan of method . Colleagues who worked with him occasionally complained that Blochs manner could be cold, distant, and both timid and hypocritical  due to the strong views he had held on the failure of the French education system. Blochs reduction of the role of individuals, and their personal beliefs, in changing society or making history has been challenged. Even Febvre, reviewing Feudal Society on its post-war publication, suggested that Bloch had unnecessarily ignored the individuals role in societal development.     Bloch has also been accused of ignoring unanswered questions and presenting complete answers when they are perhaps not deserved, and of sometimes ignoring internal inconsistencies. ": null
    },
    {
        "Andrew Wallace-Hadrill": "wallace-hadrill"
    },
    {
        " has also criticised Blochs division of the feudal period into two distinct times as artificial. He also says Blochs theory on the transformation of blood-ties into feudal bonds do not match either the chronological evidence or what is known of the nature of the early family unit. Bloch seems to have occasionally ignored, whether accidentally or deliberately, important contemporaries in his field. ": null
    },
    {
        "Richard Lefebvre des Noëttes": "richard lefebvre des noëttes"
    },
    {
        ", for example, who founded ": null
    },
    {
        "the history of technology": "history of technology"
    },
    {
        " as a new discipline, built new ": null
    },
    {
        "harnesses": "harness saddle"
    },
    {
        " from medieval illustrations, and drew histographical conclusions. Bloch, though, does not seem to have acknowledged the similarities between his and Lefebvres approaches to physical research, even though he cited much earlier historians. Davies argued that there was a ": null
    },
    {
        "sociological": "sociological"
    },
    {
        " aspect to Blochs work which often neutralised the precision of his historical writing; as a result, he says, those of Blochs works with a sociological conception, such as Feudal Society, have not always stood the test of time .     Comparative history, too, still proved controversial many years after Blochs death, and Bryce Lyon has posited that, had Bloch survived the war, it is very likely that his views on history—already changing in the early years of the second war, just as they had done in the aftermath of the first—would have re-adjusted themselves against the very school he had founded. Stirling suggests what distinguished Bloch from his predecessors was that he effectively became a new kind of historian, who strove primarily for transparency of methodology where his predecessors had striven for transparency of data  while continuously critiquing himself at the same time. Davies suggests his legacy lies not so much in the body of work he left behind him, which is not always as definitive as it has been made out to be, but the influence he had on a whole generation of French historical scholarship . Blochs emphasis on how rural and village society has been neglected by historians in favour of the lords and manorial courts that ruled them influenced later historians such as ": null
    },
    {
        "R. H. Hilton": "r. h. hilton"
    },
    {
        " in the study of the economics of peasant society. Blochs combination of economics, history and sociology was forty years before it became fashionable , argues Daniel Chirot, which he says could make Bloch a founding father of post-war sociology scholarship.     The English-language journal ": null
    },
    {
        "Past & Present": "past  &  present"
    },
    {
        ", published by ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ", was a direct successor to the Annales, suggests Loyn. ": null
    },
    {
        "Michel Foucault": "michel foucault"
    },
    {
        " said of the Annales School, what Bloch, Febvre and Braudel have shown for history, we can show, I believe, for the history of ideas . Blochs influence spread beyond historiography after his death. In the ": null
    },
    {
        "2007 French presidential election": "2007 french presidential election"
    },
    {
        ", Bloch was quoted many times. For example, candidates ": null
    },
    {
        "Nicolas Sarkozy": "nicolas sarkozy"
    },
    {
        " and ": null
    },
    {
        "Marine Le Pen": "marine le pen"
    },
    {
        " both cited Blochs lines from Strange Defeat: there are two categories of Frenchmen who will never really grasp the significance of French history: those who refuse to be thrilled by the Consecration of our Kings at Reims, and those who can read unmoved the account of the ": null
    },
    {
        "Festival of Federation": "festival of federation"
    },
    {
        " . In 1977, Bloch received a ": null
    },
    {
        "state reburial": "state burial"
    },
    {
        "; streets schools and universities have been named after him, and the ": null
    },
    {
        "centennial": "centennial"
    },
    {
        " of Blochs birth was celebrated at a conference held in Paris in June 1986. It was attended academics of various disciplines, particularly historians and anthropologists. ": null
    },
    {
        "Legion of Honour": "legion of honour"
    },
    {
        " Croix de Guerre 1914-1918": "croix de guerre 1914-1918"
    },
    {
        ", 4 mentions in despatches   ": null
    },
    {
        "Croix de Guerre 1939-1945": "croix de guerre 1939-1945"
    },
    {
        ", 1 mention in despatches       ": null
    }
]