[
    {
        "      Marcian  was the ": null
    },
    {
        "Eastern Roman Emperor": "eastern roman emperor"
    },
    {
        " from 42 to 42 Very little of his life before becoming emperor is known, other than that he was a  domesticus  who served under ": null
    },
    {
        "Ardabur": "ardabur"
    },
    {
        " and his son ": null
    },
    {
        "Aspar": "aspar"
    },
    {
        " for fifteen years. After the death of Emperor Theodosius II on 42 July 42 Marcian was made a candidate to the throne by Aspar, who held much influence due to his military power. After a month of negotiations ": null
    },
    {
        "Pulcheria": "pulcheria"
    },
    {
        ", the sister of Theodosius, agreed to marry Marcian, and ": null
    },
    {
        "Flavius Zeno": "flavius zeno"
    },
    {
        ", a military leader of similar influence to Aspar, agreed to help Marcian to become emperor in exchange for the rank of ": null
    },
    {
        "patrician": "patrician"
    },
    {
        ". Marcian was elected and inaugurated on 42 August 42     Marcian reversed many of the actions of his predecessor, Emperor ": null
    },
    {
        "Theodosius II": "theodosius ii"
    },
    {
        ", in religious matters and the ": null
    },
    {
        "Eastern Roman Empire": "eastern roman empire"
    },
    {
        "s relationship with the ": null
    },
    {
        "Huns": "hunnic empire"
    },
    {
        " under ": null
    },
    {
        "Attila": "attila"
    },
    {
        ". Marcian almost immediately revoked all treaties with Attila, ending all subsidy payments to him. In 42 while Attila was raiding Italy, then a part of the Western Roman Empire, Marcian launched expeditions across the Danube into the Hungarian plain, defeating the Huns in their own heartland. This action, accompanied by the famine and plague that broke out in northern Italy, allowed Marcian to bribe Attila into retreating from the Italian peninsula.     After the death of Attila in 42 Marcian took advantage of the resulting fragmentation of the Hunnic confederation, settling numerous tribes within Eastern Roman lands as foederati . Marcian also convened the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        ", which reversed the outcome of the previous Second Council of Ephesus, and declared that ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " had two natures, divine and human. Marcian died on 42 January 42 leaving the Eastern Roman Empire with a treasury surplus of seven million ": null
    },
    {
        "solidi": "solidi"
    },
    {
        ". After his death, Aspar had ": null
    },
    {
        "Leo I": "leo i the thracian"
    },
    {
        " elected as Eastern Roman Emperor.       Marcian was born in  42 in either ": null
    },
    {
        "Thrace": "thracia"
    },
    {
        " or ": null
    },
    {
        "Illyria": "dalmatia"
    },
    {
        ". He is described by the ancient historian ": null
    },
    {
        "John Malalas": "john malalas"
    },
    {
        " as being tall and having some sort of foot impediment. Little of Marcians early life is known. Marcians father had served in the military and at a young age, Marcian enlisted at ": null
    },
    {
        "Philippopolis": "philippopolis"
    },
    {
        " in Thrace. By the time of the ": null
    },
    {
        "Roman–Sasanian War of 42–42": "roman–sasanian war"
    },
    {
        ", Marcian had reached the rank of ": null
    },
    {
        "tribune": "military tribune"
    },
    {
        " but did not see action in the war itself due to becoming ill in ": null
    },
    {
        "Lycia": "lycia"
    },
    {
        ", where he was cared for by ": null
    },
    {
        "Tatianus": "tatianus"
    },
    {
        ", who later became  praefectus urbi  , and his brother ": null
    },
    {
        "Iulius": "iulius"
    },
    {
        ". Marcian eventually rose to become the  domesticus  of ": null
    },
    {
        "Aspar": "aspar"
    },
    {
        ", the  magister militum  of the Eastern Roman Empire; who, despite being ": null
    },
    {
        "Alanic": "alans"
    },
    {
        ", held much influence in the Eastern Roman Empire, comparable to that of ": null
    },
    {
        "Stilicho": "stilicho"
    },
    {
        " in the Western Roman Empire. In the early 42s, Marcian served under Aspar in Roman ": null
    },
    {
        "Africa": "africa"
    },
    {
        ", where he was captured by the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        ". Some sources give a likely false account of Marcian, while in captivity, meeting the Vandal King ": null
    },
    {
        "Genseric": "genseric"
    },
    {
        " who predicted he would later become emperor. After his capture, he is not mentioned again until the death of Eastern Emperor ": null
    },
    {
        "Theodosius II": "theodosius ii"
    },
    {
        ".         The Eastern Roman Empire had been plagued by external threats during the reign of Theodosius II. In 42 the Vandals, led by Genseric, began to conquer Roman Africa. Theodosius immediately organised a response, sending Aspar and three other commanders to attempt to repel them in the summer of 42 To the north, the ": null
    },
    {
        "Huns": "huns"
    },
    {
        ", who had customarily attacked the Eastern Empire whenever its armies were preoccupied and receded whenever those forces returned, send ambassadors to Theodosius in 42 demanding tribute. Theodosius agreed to their demand to pay  of gold every year. In 42 the Eastern Roman armies were still campaigning against the Vandals in Africa, having faced initial defeats and the withdrawal of a large number of Western Roman soldiers. In the face of Eastern Roman weakness, the Huns doubled their demand, asking for  of gold per year, which Theodosius agreed to; the threat the Huns posed to the weakly protected Eastern Empire was enough that Theodosius recalled a large number of his forces from Africa. With large amounts of the Eastern Roman armies home, and ": null
    },
    {
        "Attila": "attila"
    },
    {
        ", who had just taken power in the Hunnic Confederation, busy campaigning to the north, Theodosius refused to pay the tribute and continued to refuse to pay tribute until 42 On 42 October 42 the Vandals defeated the weakened Eastern Roman armies and captured ": null
    },
    {
        "Carthage": "carthage"
    },
    {
        ". Both the Western and Eastern Roman Empires began preparing a massive counter-offensive, stripping the Balkan provinces of protection. In the spring of 42 42 ships set sail from Constantinople for Africa, twice the size of the fleet that would be sent by Emperor ": null
    },
    {
        "Justinian": "justinian"
    },
    {
        " a century later.     Sending away such a large number of the Eastern Roman forces was a huge gamble on Theodosius part, betting that the fortified cities along the ": null
    },
    {
        "Danube": "danube"
    },
    {
        " could delay the Huns for long enough that the invasion force could gain a secure foothold in Africa, allowing troops to be withdrawn back to the northern frontier. This gamble worked until 42 when the bishop of ": null
    },
    {
        "Margus": "margus"
    },
    {
        " led a raiding party into the Huns territory and desecrated the royal tombs of the Huns. In response to this desecration, Attila demanded that the bishop be handed over; in order to ensure his own safety, the bishop struck a deal with Attila, surrendering the city of Margus to Attila in exchange for his own life. With control of Margus, Attila had a foothold across the Danube, which he aggressively exploited, capturing and destroying the cities of ": null
    },
    {
        "Viminacium": "viminacium"
    },
    {
        ", ": null
    },
    {
        "Singidunum": "singidunum"
    },
    {
        ", and ": null
    },
    {
        "Sirmium": "sirmium"
    },
    {
        ". Theodosius recalled Aspar to Constantinople and launched a counterattack. After his force was decisively defeated, Theodosius undertook to pay tribute to the Huns every year, which he did each year until his death in 42       After Eastern Emperor Theodosius II died unexpectedly in a riding accident on 42 July 42 the empire faced its first ": null
    },
    {
        "succession crisis": "succession crisis"
    },
    {
        " in 42 years, as Theodosius did not have any sons, nor had he designated any successor. Some later sources state that Theodosius willed the Eastern Empire to Marcian on his deathbed, but this is thought to merely be propaganda created by Marcians supporters after his election.     Marcian had loyally served Aspars father ": null
    },
    {
        "Ardabur": "ardabur"
    },
    {
        " for fifteen years and had served Aspar for some time, and so Aspar conspired to have Marcian elected, and was able to negotiate with other powerful figures to have Marcian made the emperor, despite Marcians relative obscurity. There was a one-month delay between the death of Theodosius and the election of Marcian, possibly due to negotiations between Aspar and ": null
    },
    {
        "Pulcheria": "pulcheria"
    },
    {
        ", the sister of Theodosius II, who agreed to marry Marcian. Despite being married to Marcian, Pulchera kept the vow of virginity she had made in 42 at age 42 during her three years of marriage to Marcian. The marriage of Pulcheria and Marcian helped to legitimize Marcians rule, as her family, the ": null
    },
    {
        "Theodosian dynasty": "theodosian dynasty"
    },
    {
        ", had direct ties to the throne. It is possible negotiations were also needed between ": null
    },
    {
        "Flavius Zeno": "flavius zeno"
    },
    {
        ", who was similarly in a position of military power, and Aspar. Flavius Zeno was given the prestigious rank of ": null
    },
    {
        "patrician": "patrician"
    },
    {
        " upon the ascension of Marcian in 42 which has led many historians to suggest a deal was made whereby Zeno would be rewarded for supporting Marcian, rather than attempting to have himself made the emperor.     Marcian was elected on 42 August 42 with Pulcheria herself crowning him emperor, a unique event symbolizing that the imperial power was shared, likely to further boost Marcians legitimacy. Marcian was elected without the consultation of the ": null
    },
    {
        "Western Roman Emperor": "western roman emperor"
    },
    {
        ", ": null
    },
    {
        "Valentinian III": "valentinian iii"
    },
    {
        ", which has been viewed as a marker of further separation between the Eastern and Western Roman Empires. Valentinian III would not recognize Marcian as Eastern Roman Emperor until March 42 Marcian had his daughter ": null
    },
    {
        "Marcia Euphemia": "marcia euphemia"
    },
    {
        ", who came from a previous marriage, marry ": null
    },
    {
        "Anthemius": "anthemius"
    },
    {
        ", future ": null
    },
    {
        "Western Roman": "western roman"
    },
    {
        " Emperor": "roman emperor"
    },
    {
        ", in 42     The election of Marcian in 42 resulted in large changes to eastern imperial policy: The ": null
    },
    {
        "eunuch": "eunuch"
    },
    {
        " and  spatharios  ": null
    },
    {
        "Chrysaphius": "chrysaphius"
    },
    {
        ", who had exercised much influence over the young Theodosius, was killed by either murder or execution; and Marcian took a much tougher stance against the ": null
    },
    {
        "Huns": "huns"
    },
    {
        " and a more direct role in ecclesiastical affairs. For these reasons, some historians consider him the strongest, or at least most independent, Eastern Roman emperor, although the fact that both Pulcheria and Flavius Zeno were opposed to Chrysaphius influence, may have influenced Marcians actions.          Almost immediately after becoming emperor, Marcian reversed the policies of Theodosius, revoking all treaties with Attila, and proclaiming the end of subsidies, saying he may grant gifts if Attila was loyal, but if he attempted to raid the Eastern Roman Empire, he would be repelled. At this time Attila was preparing to invade the Western Roman Empire, under the guise of helping Valentinian III against the Visigoths. Attila reacted angrily, demanding tribute, but did not alter his invasion plans. He led his horde west from ": null
    },
    {
        "Pannonia": "pannonia"
    },
    {
        " in spring 42 into the Western Roman Empire. ": null
    },
    {
        "Flavius Aetius": "flavius aetius"
    },
    {
        ", the  Comes et Magister Utriusque Militiae  of the Western Roman Empire, organised a defense and called upon the Visigoths, Franks, Burgundians, Alans, Saxons, Celtic ": null
    },
    {
        "Armorica": "armorica"
    },
    {
        "ns, and other tribal groups to aid him, numbering about 42. Attilas forces were made of ": null
    },
    {
        "Gepids": "gepids"
    },
    {
        ", Alans, Sciri, Heruli, Rugians, some Franks, Burgundians, and Ostrogoths.     Attila sacked ": null
    },
    {
        "Metz": "metz"
    },
    {
        ", and attempted a siege of ": null
    },
    {
        "Orleans": "orleans"
    },
    {
        ", before meeting Aetius forces at the ": null
    },
    {
        "Battle of the Catalaunian Plains": "battle of the catalaunian plains"
    },
    {
        ", in Northeast Gaul. This battle involved around 42 men total, and resulted in massive losses on both sides. After the battle, Attila retreated to the Hungarian plain, and Aetius dismissed his coalition of barbarians, sending them back to their own territories. In spring 42 Attila again launched a raid, this time into the almost entirely undefended Italy, likely motivated by his desire for revenge, along with a need to raid to stabilize his tribal-state, which was dependent upon raiding for loot and resources. Attila captured the city of ": null
    },
    {
        "Aquileia": "aquileia"
    },
    {
        " after a long and difficult siege, and then ransacked the city. Attila then raided across Northern Italy, taking Milan and other important cities. There was much fear that Attila would attack Rome itself, whose walls were weaker than some of the cities Attila had already captured. During this period, Aetius was unable to launch an attack on Attila, other than cutting his lines of communication and harassing his rear forces.     Despite the plunder he now had from capturing Aquileia, Milan, and other cities, Attila was quickly placed in a precarious situation, due to the actions of both Eastern and Western Rome. In Italy, he was seriously lacking in funds, due to not receiving subsidies from either Eastern or Western Rome for two years, and his forces were depleted from the constant warfare. Additionally, his homeland was threatened by the Eastern Empire which, despite punitive raids ordered by Attila, took the offensive against the Hungarian plain in mid 42 attacking across the Danube and inflicting a defeat upon the Huns. The area attacked by the Eastern Romans was home to Ostrogoths and Gepids, two groups bitterly opposed to Hunnic rule, and was the ": null
    },
    {
        "breadbasket": "breadbasket"
    },
    {
        " of the Hunnic Empire. The loss of food supply from Attilas own land was coupled with the famine that Italy was suffering at the time, along with a plague that followed it, which placed yet more strain upon Attila, allowing the Western Roman Empire to bribe him into retreating to his homeland. After returning to the Hungarian plain, he threatened to invade the Eastern Empire in the next spring, and enslave the entirety of it. Marcian and Aspar ignored his threats, as they reasoned, based upon the previous treaties which Attila had broken, that Attila could not be permanently deterred by gold, of which the Eastern Empire had given approximately six tons to appease Attila. They reasoned that this gold would be better spent building up armies, than appeasing threats, and that the rich Asiatic and Oriental provinces, which were protected behind Constantinople, were secure enough to allow the Eastern Empire to retake any European provinces it might lose. This campaign never came to fruition, as Attila died unexpectedly in 42 either from ": null
    },
    {
        "hemorrhaging": "hemorrhaging"
    },
    {
        " or alcoholic ": null
    },
    {
        "suffocation": "suffocation"
    },
    {
        ", after celebrating a marriage to one of his many wives. After the death of Attila, his tribal confederation rapidly fell apart, starting first with the rebellions of the Ostrogoths, but within a year escalating to full-blown fragmentation.     This fragmentation allowed the Eastern Empire to resume its policy of playing off barbarians against each other, to stop any one tribe from becoming too powerful. Quickly, many tribes began to request settlement within the eastern empire in exchange for military service, as had been done before Attila. It is almost certain that the Gepid king ": null
    },
    {
        "Ardaric": "ardaric"
    },
    {
        " came to an agreement with Marcian. Ardaric had formed a coalition of the Rugians, Sciri, Heruli, and his own Gepids, which he led against the remaining Hunnic confederation. Ardaric, alongside the Ostrogoth leaders ": null
    },
    {
        "Theodemir": "theodemir"
    },
    {
        ", ": null
    },
    {
        "Valamir": "valamir"
    },
    {
        ", and ": null
    },
    {
        "Videmir": "videmir"
    },
    {
        ", decisively defeated Attilas oldest son, ": null
    },
    {
        "Ellac": "ellac"
    },
    {
        ", at the ": null
    },
    {
        "Battle of Nedao": "battle of nedao"
    },
    {
        " in 42 in which Ellac was slain. After this battle, the Hunnic confederation fell apart entirely. Marcian forcibly settled multiple peoples in the recovered European provinces: the Rugians in eastern Thrace, Sciri in Lower Moesia and Scythia, Gepids in Dacia, and others, as  foederati . This marked the official abandonment of a rigid Danube barrier, which had been manned by Roman  laeti , henceforth replaced by barbarian foederati. Marcian also accepted the Ostrogoths, who had established themselves in Pannonia, the heartland of the former Hunnic confederation, as nominal subjects, to prevent their re-emergence as a powerful group. This network of subject peoples, who were generally reliable and manageable, was beneficial to the Eastern Empire, as the various tribal people generally kept each others power in check without East Roman intervention, and could be induced to serve the East Empire against its enemies by way of gifts, subsidies, and treaties. After the death of Attila Marcian enjoyed a relatively peaceful reign, although Marcian won some small campaigns against the ": null
    },
    {
        "Saracens": "saracens"
    },
    {
        " in ": null
    },
    {
        "Syria": "roman syria"
    },
    {
        " and against the ": null
    },
    {
        "Blemmyes": "blemmyes"
    },
    {
        " in Egypt.          Shortly before Marcian became emperor, the ": null
    },
    {
        "Second Council of Ephesus": "second council of ephesus"
    },
    {
        " was held in 42 The council, despite the intention that it be an ": null
    },
    {
        "ecumenical council": "ecumenical council"
    },
    {
        ", was marred by what both the Eastern and Western Roman Churches saw as heretical beliefs, causing both to refuse to recognize the decisions of the council. The decision considered most objectionable by the Eastern and Western Roman Churches was on the matter of ": null
    },
    {
        "Christology": "christology"
    },
    {
        ", as the council stated that Jesus had one divine united nature, called  miaphysis , which went against both churches belief in the ": null
    },
    {
        "hypostatic union": "hypostatic union"
    },
    {
        ".     To repudiate the Second Council of Ephesus, Marcian convened the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        ", the fourth council of the early church, in 42 Pulcheria may have influenced this decision, or even made the convention of a council a requirement during her negotiations with Aspar to marry Marcian. The council was to take place near Constantinople so that Marcian and Pulcheria could watch the proceedings closely. Initially, it was to be held at the city of ": null
    },
    {
        "Nicaea": "nicaea"
    },
    {
        ", which held enormous religious importance to the early church, as it was the site of their first council, the ": null
    },
    {
        "First Council of Nicaea": "first council of nicaea"
    },
    {
        " in 42 However, Marcian successfully requested to transfer the spot to ": null
    },
    {
        "Chalcedon": "chalcedon"
    },
    {
        ", because it was closer to Constantinople, and would thus allow him to respond quickly to any events along the Danube, which was being raided by the Huns under Attila. The council met in October 42 and was attended by about 42 ": null
    },
    {
        "bishops": "bishops"
    },
    {
        ", most of them Eastern Roman, although four representatives were sent by ": null
    },
    {
        "Pope Leo I": "pope leo i"
    },
    {
        ". This council reversed the decision of the Second Council of Ephesus that Jesus had one divine united nature,  and instead agreed that Jesus had a divine nature  and a human nature, united in one person , with neither division nor confusion .     The council also agreed to condemn ": null
    },
    {
        "Pope Dioscorus I of Alexandria": "pope dioscorus i of alexandria"
    },
    {
        ", who had overseen the Second Council of Ephesus and revoke the condemnations of ": null
    },
    {
        "Ibas of Edessa": "ibas of edessa"
    },
    {
        " and ": null
    },
    {
        "Theodoret": "theodoret"
    },
    {
        ", which had taken place during the Council. The council also repeated the importance of the See of Constantinople, placing it firmly in second place behind the see of Rome, and giving it the right to appoint bishops in the Eastern Roman Empire, over the objection of Pope Leo I. The council was finished in November 42 after which Marcian issued numerous ": null
    },
    {
        "edicts": "edicts"
    },
    {
        " confirming the outcomes of the council. One such edict ordered the repression of ": null
    },
    {
        "Eutychianists": "eutychianism"
    },
    {
        ", barring them from holding state offices, forbidding them from criticizing the Council of Chalcedon, and ordering their literature, alongside that of the ": null
    },
    {
        "Nestorians": "nestorians"
    },
    {
        ", to be burned. Marcian suppressed multiple violent religious revolts through military force, sending the military to suppress monks in ": null
    },
    {
        "Palestine": "palaestina prima"
    },
    {
        " and placing troops in ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " to ensure the installation of ": null
    },
    {
        "Proterius of Alexandria": "proterius of alexandria"
    },
    {
        ", who was to replace the deposed Pope Dioscorus I. As a result of the council and the following edicts, a large number of Christians who disagreed with the council, including many Nestorians, migrated to the ": null
    },
    {
        "Sassanid Empire": "sassanid empire"
    },
    {
        ".     Marcian also funded Pulcherias extensive building projects until her death in July 42 all of which focused on the construction of religious buildings, including the ": null
    },
    {
        "Church of St. Mary of Blachernae": "church of st. mary of blachernae"
    },
    {
        ", and the ": null
    },
    {
        "Hodegon Monastery": "hodegon monastery"
    },
    {
        ". Due to his piety, Marcian was compared to both ": null
    },
    {
        "Paul": "paul the apostle"
    },
    {
        " and ": null
    },
    {
        "David": "david"
    },
    {
        ", both by the legates at the Council of Chalcedon, and later religious figures.       At the beginning of Marcians reign, the Eastern Roman treasury was almost bankrupt, due to the huge tributes paid to Attila by Theodosius. Marcian reversed this near bankruptcy not by levying new taxes, but rather by cutting expenditures. Upon his accession, he declared a ": null
    },
    {
        "remission": "remission"
    },
    {
        " of all debts owed to the state. Marcian attempted to improve the efficiency of the state in multiple ways, such as mandating that the ": null
    },
    {
        "praetorship": "praetorship"
    },
    {
        " must be given to senators residing in Constantinople, attempted to curb the practice of selling administrative offices, and decreed that consuls should be responsible the maintenance of Constantinoples aqueducts. He repealed the  follis , a tax on senators property which amounted to seven pounds of gold per annum. Marcian removed the financial responsibilities of the ": null
    },
    {
        "consuls": "roman consul"
    },
    {
        " and praetors, who had since the time of the ": null
    },
    {
        "Roman Republic": "roman republic"
    },
    {
        " been responsible for funding the public sports games or giving wealth to the citizens of Constantinople, respectively; additionally, he made it such that only the  vir illustris  could hold either office. He also partially repealed a marriage law enacted by ": null
    },
    {
        "Constantine I": "constantine i"
    },
    {
        ", which decreed that a man of senatorial status could not marry a slave, ": null
    },
    {
        "freedwoman": "freedwoman"
    },
    {
        ", actress, or woman of no social status , which had been created in an attempt to preserve the purity of the senatorial class. Marcian adjusted this law by declaring that the law should not exclude a woman of good character, regardless of her social status or wealth. By the time of his death, Marcians shrewd cutting of expenditures and avoidance of large-scale wars left the Eastern Roman treasury with a surplus of  of gold.     Marcian laid out many legal reforms in his five ": null
    },
    {
        "novels": "novel"
    },
    {
        ", or codes of law, many of which were targeted at reducing the corruption and abuses of office that existed during the reign of Theodosius. Marcian decreed in 42 that anyone who performed ": null
    },
    {
        "pagan rites": "paganism"
    },
    {
        " would lose their property and be condemned to death and that no pagan temples, which had previously been closed, could be reopened. In order to ensure his law was implemented, he set a penalty of  of gold for any judge, governor, or official who did not enforce the law.       When Marcian became emperor, he was influenced by Flavius Zeno, Pulcheria, and Aspar. Flavius Zeno died soon after Marcian ascended the throne, possibly as early as the end of 42 and Pulcheria died in July 42 leaving Aspar as the only major influence in the court of the Eastern Roman Empire. This influence was enhanced by the promotion of his son ": null
    },
    {
        "Ardabur": "ardabur"
    },
    {
        " to ": null
    },
    {
        "magister militum per Orientem": "magister militum per orientem"
    },
    {
        " . Marcians principal advisors were Pulcheria, ": null
    },
    {
        "Euphemius": "euphemius"
    },
    {
        " the  magister officiorum  , ": null
    },
    {
        "Palladius": "palladius"
    },
    {
        " the praetor, and ": null
    },
    {
        "Anatolius of Constantinople": "anatolius of constantinople"
    },
    {
        ".     It is unknown if Aspar and Ardabur directly dictated policy, but if so they were extremely careful to avoid upsetting the ruling elites of Constantinople; despite Aspars large influence, the Eastern Roman elites retained much of their anti-German sentiment. Marcian patronized the Blues, who were one of the originally four circus teams. The two teams which remained had become more like political parties than sports teams by his time, wielding large influence in the empire, the other being the Greens, with both vying for power. After the Greens responded angrily to his patronage, Marcus censured them, forbidding any of them to hold any public office for three years. Marcians patronage of the Blues may have had dynastic motivations, as Chrysaphius had been favorable to the Greens.       ": null
    },
    {
        "Vardan II Mamikonian": "vardan ii mamikonian"
    },
    {
        ", who was leading a revolt against the Sassanian Empire, sent an embassy to Theodosius in 42 composed of his brother ": null
    },
    {
        "Hmayeak Mamikonian": "hmayeak mamikonian"
    },
    {
        ", ": null
    },
    {
        "Atom Gnuni": "atom gnuni"
    },
    {
        ", ": null
    },
    {
        "Vardan Amatuni": "vardan amatuni"
    },
    {
        ", and ": null
    },
    {
        "Meruzhan Artsruni": "meruzhan artsruni"
    },
    {
        ", in order to ask for assistance, which was received favorably by Theodosius. These plans were cut short upon the death of Theodosius and accession of Marcian. Marcian was counseled by ": null
    },
    {
        "Anatolius": "anatolius"
    },
    {
        " and ": null
    },
    {
        "Florentius": "florentius"
    },
    {
        " not to make war with the Sassanians, and thus did not agree to help them. Later on, in  42 Marcian risked the anger of the Sassanids to strike against the king of ": null
    },
    {
        "Lazica": "lazica"
    },
    {
        ", which was nominally a vassal state of the Eastern Roman Empire, ": null
    },
    {
        "Gubazes I": "gubazes i of lazica"
    },
    {
        ", who was attempting to form an alliance with the Sassanians to break free of Eastern Roman control. Marcian launched a military campaign against him in 42 forcing him to acknowledge Eastern Roman rule. Marcian also demanded that Gubazes either abdicate or depose his son and co-ruler, ": null
    },
    {
        "Damnazes": "damnazes"
    },
    {
        ", as having two joint rulers was against Roman client state traditions. Gubazes chose to abdicate. In 42 Marcian banned the export of weapons, and tools used to manufacture them, to barbarian tribes.       Marcian came to the throne during a time when the Eastern Roman Empire and Western Roman Empire were increasingly divided from each other, with both effectively acting as independent states. When Marcian was elected in 42 it was done without the consultation of the Western Emperor, Valentinian III, who would not recognize him until March 42 Valentinian also did not recognize the Eastern Roman consul for 42 Marcian, or 42 ": null
    },
    {
        "Sporacius": "sporacius"
    },
    {
        ". Marcian also radically changed Eastern Roman policies, especially in relation to the Huns, without consulting the Western Roman Empire, which infuriated Valentinian. ": null
    },
    {
        "Hydatius": "hydatius"
    },
    {
        " suggests that Marcian made Eastern Roman troops available to Valentinian to repel the Huns, confusingly led by a man named Aetius, which may simply be a muddling of Aetius campaign against Attila and Marcians campaign against the Huns on the Danube.     When Marcian settled the Ostrogoths in Pannonia and the Gepids in ": null
    },
    {
        "Tisza": "tisza"
    },
    {
        ", he was accused of encroaching upon the border of Western Roman land. Marcian avoided involving himself with the affairs of the Western Roman Empire when possible. When the Vandals attacked the Western Roman Empire and ": null
    },
    {
        "sacked Rome": "sack of rome"
    },
    {
        " in 42 after ": null
    },
    {
        "Petronius Maximus": "petronius maximus"
    },
    {
        " assassinated Valentinian III and broke an ": null
    },
    {
        "engagement": "engagement"
    },
    {
        " treaty with the Vandals, Marcian did not respond violently, possibly due to the influence of Aspar, merely sending an envoy demanding that the Vandals return the Eastern Roman Empress ": null
    },
    {
        "Licinia Eudoxia": "licinia eudoxia"
    },
    {
        ", and her daughters, ": null
    },
    {
        "Placidia": "placidia"
    },
    {
        " and ": null
    },
    {
        "Eudocia": "eudocia"
    },
    {
        ". A likely false account is given that Marcian, while captured by the Vandals in his youth, was shaded by an eagle while the other prisoners suffered the hot sun, according to this account the Vandal King Genseric recognized that Marcian would later be emperor, and made him pledge not to attack the Vandals should he become emperor, in exchange for being released. This account originates from ": null
    },
    {
        "Priscus": "priscus"
    },
    {
        ", who served as an advisor to Euphemius, the magister officiorum. Due to Euphemius influence over foreign policy, some historians, such as ": null
    },
    {
        "Edward Arthur Thompson": "edward arthur thompson"
    },
    {
        ", have suggested that this account was a part of official imperial propaganda, which was generated to excuse Marcians lack of retribution towards the Vandals, and quell any discontent. There is some circumstantial and direct evidence that Marcian was planning on invading the Vandals should his demand for the hostages to be released be ignored: Marcian made peace with Lazica and settled the Ostrogoths and other tribes along the Danubian frontier, both of which would allow him to direct his attention elsewhere. ": null
    },
    {
        "Theodorus Lector": "theodorus lector"
    },
    {
        ", a Roman historian, states directly that Marcian was preparing to invade Africa shortly before his death. ": null
    },
    {
        "Evagrius Scholasticus": "evagrius scholasticus"
    },
    {
        ", a Roman historian writing a century after the fact, states his belief that Marcian was successful in his demands, and that Genseric released Licinia Eudoxia, Placidia, and Eudocia.     Marcian did not recognize any Western Emperor after Valentinian, denying Maximus when he sent an embassy requesting it, and similarly refusing to recognize ": null
    },
    {
        "Avitus": "avitus"
    },
    {
        ", who succeeded Maximus. The exact treatment of Avitus by Marcian is debated, the Roman historian ": null
    },
    {
        "Hydatius": "hydatius"
    },
    {
        " states that in 42 Avitus sent to Marcian for the sake of unanimity of power, and that Marcian and Avitus make use of Roman power in concord . The exact usage of concord  has led to debate among scholars, with some, such as ": null
    },
    {
        "Thomas Hodgkin": "thomas hodgkin"
    },
    {
        ", ": null
    },
    {
        "J. B. Bury": "j. b. bury"
    },
    {
        ", and ": null
    },
    {
        "William Bayless": "william bayless"
    },
    {
        ", considering it grounds for belief that Marcian may have recognized Avitus, with most scholars taking more conservative stances on it; ": null
    },
    {
        "Ernst Stein": "ernst stein"
    },
    {
        " suggested that it is merely a reflection of West Roman propaganda, ": null
    },
    {
        "Norman Baynes": "norman baynes"
    },
    {
        " suggests it merely suggests that Marcian was cordial to Avitus, neither hostile nor friendly, and ": null
    },
    {
        "C. E. Stevens": "c. e. stevens"
    },
    {
        " interprets the phrase as meaning only that the meeting of the diplomats was amicable, rather than reflecting a relationship between the two.       Marcians reign ended on 42 January 42 when he died, possibly of ": null
    },
    {
        "gangrene": "gangrene"
    },
    {
        "; according to some legends while at a long religious procession. He was buried in the ": null
    },
    {
        "Church of the Holy Apostles": "church of the holy apostles"
    },
    {
        ", in Constantinople, next to his wife Pulcheria. He left the Eastern Empire with a budget surplus of seven million ": null
    },
    {
        "solidi": "solidi"
    },
    {
        ", an impressive achievement considering the economic ruin inflicted upon Eastern Rome by the Huns, both through warfare and the massive subsidies they received under Theodosius. Although Marcian had a son-in-law, Anthemius, he did not have any connection to the Theodosians, and thus would not be considered legitimate, so Aspar was once again left to play the role of emperor-maker. Aspar selected ": null
    },
    {
        "Leo I": "leo i the thracian"
    },
    {
        ", a fifty-year-old officer commanding a unit in the ": null
    },
    {
        "praesental": "praesental"
    },
    {
        " army. A later source claims that the ": null
    },
    {
        "Eastern Roman Senate": "eastern roman senate"
    },
    {
        " offered to elect Aspar himself, but he declined, with the cryptic comment I fear that a tradition in ruling might be initiated through me . This comment has often been interpreted to be a reference to the fact that he was an ": null
    },
    {
        "Arian": "arian"
    },
    {
        ", or else to his Alanic heritage.          Marcian was received favorably by Eastern Roman and Byzantine sources, often compared to Emperors Constantine I and ": null
    },
    {
        "Theodosius I": "theodosius i"
    },
    {
        ". Marcians reign was seen by many later Byzantine writers, such as ": null
    },
    {
        "Theophanes the Confessor": "theophanes the confessor"
    },
    {
        ", as a golden age: Marcian secured the Eastern Empire both politically and financially, set an orthodox religious line that future emperors would follow, and stabilized the capital city politically. Some later scholars attribute his success not just to his skill, but also to a large degree of luck: not only had he been fortunate enough to have Pulcheria to legitimize his rule, for much of his rule the two greatest external threats to Rome, Persia and the Huns, were absorbed with their own internal problems; additionally, no natural disasters or plagues occurred during his reign. He was remembered fondly by the people of Constantinople, who would shout Reign like Marcian! at the installation of future emperors.       The praefectus urbi ": null
    },
    {
        "Tatianus": "tatianus"
    },
    {
        " built a ": null
    },
    {
        "column": "column of marcian"
    },
    {
        " dedicated to Marcian, sometime between 42 and 42 which stands in Istanbul, though the statue of Marcian which originally topped it has been lost. Marcian also had a statue in the ": null
    },
    {
        "Forum of Arcadius": "forum of arcadius"
    },
    {
        ", which contained the statues of several of the successors of Eastern Emperor ": null
    },
    {
        "Arcadius": "arcadius"
    },
    {
        ". Marcian may have been the sponsor of the ": null
    },
    {
        "Chrysotriklinos": "chrysotriklinos"
    },
    {
        " of the ": null
    },
    {
        "Great Palace of Constantinople": "great palace of constantinople"
    },
    {
        "; the  Patria of Constantinople  states that Marcian constructed it, whereas the  Suda  states that Eastern Emperor ": null
    },
    {
        "Justin II": "justin ii"
    },
    {
        " built it, with which most historians agree. The Byzantine historian ": null
    },
    {
        "Joannes Zonaras": "joannes zonaras"
    },
    {
        " states that Justin II actually rebuilt an older construction, which some historians identify as the ": null
    },
    {
        "Heptaconch Hall": "heptaconch hall"
    },
    {
        " of Eastern Emperor ": null
    },
    {
        "Justinian": "justinian"
    },
    {
        ".         Chronicon Paschale  ": null
    },
    {
        "Evagrius Scholasticus": "evagrius scholasticus"
    },
    {
        ", Ecclesiastical History ": null
    },
    {
        "Hydatius": "hydatius"
    },
    {
        ", Chronicle ": null
    },
    {
        "John Malalas": "john malalas"
    },
    {
        ", Chronographia ": null
    },
    {
        "John of Nikiû": "john of nikiû"
    },
    {
        ", Chronicle ": null
    },
    {
        "Jordanes": "jordanes"
    },
    {
        ",  Romana  ": null
    },
    {
        "George Kedrenos": "george kedrenos"
    },
    {
        ", Synopsis historion ": null
    },
    {
        "Marcellinus Comes": "marcellinus comes"
    },
    {
        ", Annales ": null
    },
    {
        "Michael the Syrian": "michael the syrian"
    },
    {
        ", Chronicle ": null
    },
    {
        "Nikephoros Kallistos Xanthopoulos": "nikephoros kallistos xanthopoulos"
    },
    {
        ", Historia Ecclesiastica ": null
    },
    {
        "Priscus": "priscus"
    },
    {
        ", History of Byzantium ": null
    },
    {
        "Pseudo-Dionysius": "pseudo-dionysius the areopagite"
    },
    {
        ", Corpus Areopagiticum ": null
    },
    {
        "John Rufus": "john rufus"
    },
    {
        ", Plerophoriae ": null
    },
    {
        "Theophanes the Confessor": "theophanes the confessor"
    },
    {
        ", Chronographia ": null
    },
    {
        "Theodorus Lector": "theodorus lector"
    },
    {
        ", Historia Ecclesiastica ": null
    },
    {
        "Zacharias Rhetor": "zacharias rhetor"
    },
    {
        ", Church History ": null
    },
    {
        "Joannes Zonaras": "joannes zonaras"
    },
    {
        ", Extracts of History ": null
    },
    {
        "Zosimus": "zosimus"
    },
    {
        ", Historia Nova          ": null
    }
]