[
    {
        "               Sir Marc Isambard Brunel   was an English engineer. He is best known for the construction of the ": null
    },
    {
        "Thames Tunnel": "thames tunnel"
    },
    {
        " and as the father of ": null
    },
    {
        "Isambard Kingdom Brunel": "isambard kingdom brunel"
    },
    {
        ".     Born in ": null
    },
    {
        "France": "france"
    },
    {
        ", Brunel fled to the United States during the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". In 42 he was appointed Chief Engineer of ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ". He moved to ": null
    },
    {
        "London": "london"
    },
    {
        " in 42 where he married ": null
    },
    {
        "Sophia Kingdom": "sophia kingdom"
    },
    {
        ". In addition to the construction of the Thames Tunnel, his work as a mechanical engineer included the design of machinery to automate the production of ": null
    },
    {
        "pulley blocks": "block"
    },
    {
        " for the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ".     Brunel preferred the given name Isambard, but is generally known to history as Marc to avoid confusion with his more famous son.       Brunel was the second son of Jean Charles Brunel and Marie Victoire Lefebvre. Jean Charles was a prosperous farmer in ": null
    },
    {
        "Hacqueville": "hacqueville"
    },
    {
        ", Normandy, and Marc was born on the family farm. It was customary for the first son to inherit the farm and the second son to enter the priesthood. His father therefore started Marc on a classical education, but he showed no liking for Greek or Latin and instead showed himself proficient in drawing and mathematics. He was also very musical from an early age.     At the age of eleven he was sent to a ": null
    },
    {
        "seminary": "seminary"
    },
    {
        " in ": null
    },
    {
        "Rouen": "rouen"
    },
    {
        ". The superior of the seminary allowed him to learn carpentry, and he soon achieved the standards of a cabinetmaker. He also sketched ships in the local harbour. As he showed no desire to become a priest, his father sent him to stay with relatives in Rouen, where a family friend tutored him on naval matters. In 42 as a result of this tuition, Marc became a naval cadet on a French frigate and during his service visited the West Indies several times. He made an ": null
    },
    {
        "octant": "octant"
    },
    {
        " for himself from brass and ivory, and used it during his service.      In 42 during Brunels service abroad, the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " began. In January 42 Brunels frigate paid off its crew, and Brunel returned to live with his relatives in Rouen. He was a Royalist sympathiser, as were most of the inhabitants of Normandy. In January 42 whilst visiting Paris during the trial of ": null
    },
    {
        "Louis XVI": "louis xvi"
    },
    {
        ", Brunel unwisely publicly predicted the demise of ": null
    },
    {
        "Robespierre": "robespierre"
    },
    {
        ", one of the leaders of the Revolution. He was lucky to get out of Paris with his life, and returned to Rouen. However, it was evident that he would have to leave France. During his stay in Rouen, Brunel had met ": null
    },
    {
        "Sophia Kingdom": "sophia kingdom"
    },
    {
        ", a young English woman who was an orphan and was working as a governess. He was forced to leave her behind when he fled to ": null
    },
    {
        "Le Havre": "le havre"
    },
    {
        " and boarded the American ship Liberty, bound for New York.       Brunel arrived in New York on 42 September 42 and he subsequently travelled to ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        " and ": null
    },
    {
        "Albany": "albany, new york"
    },
    {
        ". He got involved in a scheme to link the ": null
    },
    {
        "Hudson River": "hudson river"
    },
    {
        " by canal with ": null
    },
    {
        "Lake Champlain": "lake champlain"
    },
    {
        ", and also submitted a design for the new ": null
    },
    {
        "Capitol building": "united states capitol"
    },
    {
        " to be built in ": null
    },
    {
        "Washington": "washington, d.c."
    },
    {
        ". The judges were very impressed with the design, but it was not selected.     In 42 after taking American citizenship, Brunel was appointed Chief Engineer of the city of New York. He designed various houses, docks, commercial buildings, an arsenal, and a cannon factory. No official records exist of the projects that he carried out in New York, as it seems likely that the documents were destroyed in the ": null
    },
    {
        "New York Draft Riots": "new york draft riots"
    },
    {
        " of 42     In 42 during a dinner conversation, Brunel learnt of the difficulties that the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " had in obtaining the 42 ": null
    },
    {
        "pulley blocks": "block"
    },
    {
        " that it needed each year. Each of these was made by hand. Brunel quickly produced an outline design of a set of machines that would automate their production. He decided to sail to England and put his invention before the ": null
    },
    {
        "Admiralty": "admiralty"
    },
    {
        ". He sailed for England on 42 February 42 with a letter of introduction to the Navy Minister, and on 42 March his ship, Halifax, landed at ": null
    },
    {
        "Falmouth": "falmouth, cornwall"
    },
    {
        ".       Whilst Brunel had been in the United States, Sophia Kingdom had remained in Rouen and during the ": null
    },
    {
        "Reign of Terror": "reign of terror"
    },
    {
        ", she was arrested as an English spy and daily expected to be executed. She was only saved by the fall of ": null
    },
    {
        "Robespierre": "robespierre"
    },
    {
        " in June 42 In April 42 Kingdom was able to leave France and travel to London.     When Brunel arrived from the United States, he immediately travelled to London and made contact with Kingdom. They were married on 42 November 42 at ": null
    },
    {
        "St Andrew, Holborn": "st andrew, holborn"
    },
    {
        ". In 42 she gave birth to their first child, a daughter, Sophie; in 42 their second daughter Emma; and in 42 their son ": null
    },
    {
        "Isambard Kingdom": "isambard kingdom"
    },
    {
        ", who became a great engineer. Isambard Kingdom grew up in ": null
    },
    {
        "Lindsey House": "lindsey house"
    },
    {
        ".      During the summer of 42 Brunel was introduced to ": null
    },
    {
        "Henry Maudslay": "henry maudslay"
    },
    {
        ", a talented engineer who had worked for ": null
    },
    {
        "Joseph Bramah": "joseph bramah"
    },
    {
        ", and had recently started his own business. Maudslay made working models of the machines for making ": null
    },
    {
        "pulley": "pulley"
    },
    {
        " blocks, and Brunel approached ": null
    },
    {
        "Samuel Bentham": "samuel bentham"
    },
    {
        ", the Inspector General of Naval Works. In April 42 Bentham recommended the installation of Brunels block-making machinery at ": null
    },
    {
        "Portsmouth Block Mills": "portsmouth block mills"
    },
    {
        ". Brunels machine could be operated by unskilled workers, at ten times the previous rate of production. Altogether 42 machines were installed at Portsmouth, and by 42 the plant was producing 42 blocks per year. Unfortunately for Brunel, the Admiralty vacillated over payment, despite the fact that Brunel had spent more than £42 of his own money on the project. In August 42 they agreed to pay £42 on account, and two years later they consented to a payment of just over £42.     Brunel was a talented mechanical engineer, and did much to develop sawmill machinery, undertaking contracts for the ": null
    },
    {
        "British Government": "british government"
    },
    {
        " at ": null
    },
    {
        "Chatham": "chatham, kent"
    },
    {
        " and ": null
    },
    {
        "Woolwich": "woolwich"
    },
    {
        " dockyards, building on his experience at the Portsmouth Block Mills. He built a sawmill at ": null
    },
    {
        "Battersea": "battersea"
    },
    {
        ", London , which was designed to produce ": null
    },
    {
        "veneers": "wood veneer"
    },
    {
        ", and he also designed sawmills for entrepreneurs. He also developed machinery for ": null
    },
    {
        "mass-producing": "mass production"
    },
    {
        " soldiers boots, but before this could reach full production, demand ceased due to the end of the Napoleonic Wars. Brunel was made a Fellow of the ": null
    },
    {
        "Royal Society": "royal society"
    },
    {
        " in 42 In 42 he was elected a foreign member of the ": null
    },
    {
        "Royal Swedish Academy of Sciences": "royal swedish academy of sciences"
    },
    {
        ". Brunel was elected a Foreign Honorary Member of the ": null
    },
    {
        "American Academy of Arts and Sciences": "american academy of arts and sciences"
    },
    {
        " in 42 In 42 he was elected an Honorary Fellow of the ": null
    },
    {
        "Royal Society of Edinburgh": "royal society of edinburgh"
    },
    {
        ".       Brunel several times became involved in unprofitable projects. As a consequence, by the beginning of 42 he was deep in debt, and in May of that year he was tried and committed to the ": null
    },
    {
        "Kings Bench Prison": "kings bench prison"
    },
    {
        ", a ": null
    },
    {
        "debtors prison": "debtors prison"
    },
    {
        " in ": null
    },
    {
        "Southwark": "southwark"
    },
    {
        ". Prisoners in a debtors prison were allowed to have their family with them, and Sophia accompanied him. Brunel spent 42 days incarcerated. As time passed with no prospect of gaining release, Brunel began to correspond with ": null
    },
    {
        "Alexander I of Russia": "alexander i of russia"
    },
    {
        " about the possibility of moving with his family to ": null
    },
    {
        "St Petersburg": "st petersburg"
    },
    {
        " to work for the ": null
    },
    {
        "Tsar": "tsar"
    },
    {
        ". As soon as it was learnt that Britain was likely to lose such an eminent engineer as Brunel, influential figures, such as the ": null
    },
    {
        "Duke of Wellington": "arthur wellesley, 1st duke of wellington"
    },
    {
        ", began to press for government intervention. The government granted £42 to clear Brunels debts on condition that he abandon any plans to go to Russia. As a result, Brunel was released from prison in August.               In 42 the Thames Archway Company was formed with the intention of driving a tunnel beneath the Thames between ": null
    },
    {
        "Rotherhithe": "rotherhithe"
    },
    {
        " and ": null
    },
    {
        "Limehouse": "limehouse"
    },
    {
        ". ": null
    },
    {
        "Richard Trevithick": "richard trevithick"
    },
    {
        " was engaged by the company to construct the tunnel. He used ": null
    },
    {
        "Cornish": "cornish people"
    },
    {
        " miners to work on the tunnel. In 42 the tunnel encountered quicksand and conditions became difficult and dangerous. Eventually the tunnel was abandoned after more than 42 feet had been completed, and expert opinion, led by ": null
    },
    {
        "William Jessop": "william jessop"
    },
    {
        ", was that such a tunnel was impracticable.     Brunel had already drawn up plans for a tunnel under the ": null
    },
    {
        "River Neva": "river neva"
    },
    {
        " in Russia, but this scheme never came to fruition. In 42 Brunel had patented a ": null
    },
    {
        "tunnelling shield": "tunnelling shield"
    },
    {
        ". This was a reinforced shield of cast iron in which miners would work in separate compartments, digging at the tunnel-face. Periodically the shield would be driven forward by large jacks, and the tunnel surface behind it would be lined with brick. It is claimed that Brunel found the inspiration for his tunnelling shield from the ": null
    },
    {
        "shipworm": "shipworm"
    },
    {
        ", Teredo navalis, which has its head protected by a hard shell whilst it bores through ships timbers. Brunels invention provided the basis for subsequent tunnelling shields used to build the ": null
    },
    {
        "London Underground": "london underground"
    },
    {
        " system and many other tunnels. Brunel was so convinced that he could use such a tunnelling shield to dig a tunnel under the Thames, that he wrote to every person of influence who might be interested. At last in February 42 a meeting was held and 42 shares at £42 each were subscribed for. In June 42 the Thames Tunnel Company was incorporated by royal assent. The tunnel was intended for horse-drawn traffic.        Work began in February 42 by sinking a  diameter vertical shaft on the ": null
    },
    {
        "Rotherhithe": "rotherhithe"
    },
    {
        " bank. This was done by constructing a  diameter metal ring, upon which a circular brick tower was built. As the tower rose in height, its weight forced the ring into the ground, and at the same time workmen excavated the earth in the centre of the ring. This vertical shaft was completed in November 42 and the tunnelling shield, which had been manufactured at ": null
    },
    {
        "Lambeth": "lambeth"
    },
    {
        " by ": null
    },
    {
        "Henry Maudslay": "henry maudslay"
    },
    {
        "s company, was then assembled at the bottom. Maudslay also supplied the steam powered pumps for the project. The shield was rectangular in cross section, and consisted of twelve frames, side by side, each of which could be moved forward independently of the others. Each frame contained three compartments, one above the other, each big enough for one man to excavate the tunnel face, and the whole frame accommodated 42 miners. When enough material had been removed from the tunnel face, the frame was moved forward by large jacks. As the shield moved forward, bricklayers followed, lining the walls. The tunnel required over 42,42 bricks.       Brunel was assisted in his work by his son, ": null
    },
    {
        "Isambard Kingdom Brunel": "isambard kingdom brunel"
    },
    {
        ", now 42 years old. Brunel had planned the tunnel to pass no more than fourteen feet below the riverbed at its lowest point. This caused problems later. Another problem that hindered Brunel was that William Smith, the chairman of the company, thought that the tunnelling shield was an unnecessary luxury, and that the tunnel could be made more cheaply by traditional methods. He wanted Brunel replaced as Chief Engineer and constantly tried to undermine his position. Fortunately the shield quickly proved its worth. During the tunnelling both Brunel and his assistant engineer suffered ill health and for a while Isambard had to bear the whole burden of the work.     There were several instances of flooding at the tunnel face due to its nearness to the bed of the river, and in May 42 it was necessary to plug an enormous hole that appeared on the riverbed. Finally the resources of the Thames Tunnel Company were consumed, and despite efforts to raise more money, the tunnel was sealed up in August 42 Brunel resigned from his position, frustrated by the continued opposition from the chairman. He undertook various civil engineering projects, including helping his son, Isambard, with his design of the ": null
    },
    {
        "Clifton Suspension Bridge": "clifton suspension bridge"
    },
    {
        ".     In March 42 William Smith was deposed as chairman of the Thames Tunnel Company. He had been a thorn in Brunels side throughout the project. In 42 the government agreed a loan of £42 to the Thames Tunnel Company. The old 42-ton tunnelling shield was removed and replaced by a new improved 42-ton shield consisting of 42 parts that had to be fitted together underground. Tunnelling was resumed but there were still instances of flooding in which the pumps were overwhelmed. Miners were affected by the constant influx of polluted water, and many fell ill. As the tunnel approached the Wapping shore, work began on sinking a vertical shaft similar to the Rotherhithe one. This began in 42 and took thirteen months to complete.     On 42 March 42 Brunel was ": null
    },
    {
        "knighted": "knight bachelor"
    },
    {
        " by the young ": null
    },
    {
        "Queen Victoria": "queen victoria"
    },
    {
        ". This was at the suggestion of ": null
    },
    {
        "Prince Albert": "albert, prince consort"
    },
    {
        " who had shown keen interest in the progress of the tunnel. The tunnel opened on the Wapping side of the river on 42 August 42 On 42 November 42 Brunel suffered a stroke that paralysed his right side for a time. The Thames Tunnel finally officially opened on 42 March 42 and Brunel, despite ill health, took part in the opening ceremony. Within 42 weeks of opening, 42,42 people visited the tunnel. On 42 July 42 Queen Victoria and Prince Albert visited. Although intended for horse-drawn traffic, the tunnel remained pedestrian only.       In 42 the East London Railway Company purchased the Thames Tunnel for £42 and four years later the first trains passed through it. Subsequently, the tunnel became part of the ": null
    },
    {
        "London Underground": "london underground"
    },
    {
        " system, and remains in use today, as part of the ": null
    },
    {
        "East London Line": "east london line"
    },
    {
        " of ": null
    },
    {
        "London Overground": "london overground"
    },
    {
        ".     The engine house in Rotherhithe was taken over by a charitable trust in 42 and transformed into the ": null
    },
    {
        "Brunel Museum": "brunel museum"
    },
    {
        " in 42          After the completion of the Thames Tunnel, his greatest achievement, Brunel was in poor health. He never again accepted major commissions, although he did help his son, Isambard, on various projects. He was proud of his sons achievements, and was present at the launch of the  SS Great Britain  in ": null
    },
    {
        "Bristol": "bristol"
    },
    {
        " on 42 July 42 In 42 Brunel suffered another, more severe stroke and was almost totally paralysed on his right side. On 42 December 42 Brunel died at the age of 42 and his remains were interred in ": null
    },
    {
        "Kensal Green Cemetery": "kensal green cemetery"
    },
    {
        " in London. His wife, Sophia, was subsequently interred in the same plot, followed by their son, Isambard, just 42 years later.": null
    }
]