[
    {
        "        Maria Goeppert Mayer was a German-born American ": null
    },
    {
        "theoretical physicist": "theoretical physicist"
    },
    {
        ", and ": null
    },
    {
        "Nobel laureate": "nobel laureate"
    },
    {
        " in ": null
    },
    {
        "Physics": "nobel prize in physics"
    },
    {
        " for proposing the ": null
    },
    {
        "nuclear shell model": "nuclear shell model"
    },
    {
        " of the ": null
    },
    {
        "atomic nucleus": "atomic nucleus"
    },
    {
        ". She was the second woman to win a Nobel Prize in physics, the first being ": null
    },
    {
        "Marie Curie": "marie curie"
    },
    {
        ". In 42 the ": null
    },
    {
        "Maria Goeppert-Mayer Award": "maria goeppert-mayer award"
    },
    {
        " for early-career women physicists was established in her honor.     A graduate of the ": null
    },
    {
        "University of Göttingen": "university of göttingen"
    },
    {
        ", Goeppert Mayer wrote her doctoral thesis on the theory of possible ": null
    },
    {
        "two-photon absorption": "two-photon absorption"
    },
    {
        " by atoms. At the time, the chances of experimentally verifying her thesis seemed remote, but the development of the ": null
    },
    {
        "laser": "laser"
    },
    {
        " permitted this. Today, the unit for the two-photon ": null
    },
    {
        "absorption cross section": "absorption cross section"
    },
    {
        " is named the Goeppert Mayer unit.     Maria Goeppert married ": null
    },
    {
        "Joseph Edward Mayer": "joseph edward mayer"
    },
    {
        " and moved to the United States, where he was an associate professor at ": null
    },
    {
        "Johns Hopkins University": "johns hopkins university"
    },
    {
        ". Strict rules against ": null
    },
    {
        "nepotism": "nepotism"
    },
    {
        " prevented Johns Hopkins University from taking her on as a faculty member, but she was given a job as an assistant and published a landmark paper on ": null
    },
    {
        "double beta decay": "double beta decay"
    },
    {
        " in 42 In 42 she moved to ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        ", where she took an unpaid position. During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", she worked for the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        " at Columbia on ": null
    },
    {
        "isotope separation": "isotope separation"
    },
    {
        ", and with ": null
    },
    {
        "Edward Teller": "edward teller"
    },
    {
        " at the ": null
    },
    {
        "Los Alamos Laboratory": "los alamos laboratory"
    },
    {
        " on the development of the ": null
    },
    {
        "Tellers Super bomb": "tellers   super   bomb"
    },
    {
        ".     After the war, Goeppert Mayer became a voluntary associate professor of Physics at the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        " and a senior physicist at the university-run ": null
    },
    {
        "Argonne National Laboratory": "argonne national laboratory"
    },
    {
        ". She developed a mathematical model for the structure of nuclear shells, for which she was awarded the Nobel Prize in Physics in 42 which she shared with ": null
    },
    {
        "J. Hans D. Jensen": "j. hans d. jensen"
    },
    {
        " and ": null
    },
    {
        "Eugene Wigner": "eugene wigner"
    },
    {
        ". In 42 she was appointed full professor of physics at the ": null
    },
    {
        "University of California, San Diego": "university of california, san diego"
    },
    {
        ".       Maria Göppert was born on June 42 42 in Kattowitz , a ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        "n city in ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        ", the only child of ": null
    },
    {
        "Friedrich Göppert": ":de:friedrich göppert"
    },
    {
        " and his wife Maria née Wolff. In 42 she moved with her family to ": null
    },
    {
        "Göttingen": "göttingen"
    },
    {
        " when her father, a sixth-generation university professor, was appointed as the professor of pediatrics at the ": null
    },
    {
        "University of Göttingen": "university of göttingen"
    },
    {
        ". Goeppert was closer to her father than her mother. Well, my father was more interesting , she later explained. He was after all a scientist .     Göppert was educated at the Höhere Technische in Göttingen, a school for middle-class girls who aspired to higher education. In 42 she entered the Frauenstudium, a private high school run by ": null
    },
    {
        "suffragettes": "suffragettes"
    },
    {
        " that aimed to prepare girls for university. She took the  abitur , the university entrance examination, at age 42 a year early, with three or four girls from her school and thirty boys. All the girls passed, but only one of the boys did.     In the Spring of 42 Göppert entered the University of Göttingen, where she studied mathematics. A purported shortage of women mathematics teachers for schools for girls led to an upsurge of women studying mathematics at a time of high unemployment, and there was even a female professor of mathematics at Göttingen, ": null
    },
    {
        "Emmy Noether": "emmy noether"
    },
    {
        ", but most were only interested in qualifying for their teaching certificates.     Instead, Goeppert became interested in physics, and chose to pursue a ": null
    },
    {
        "Ph.D.": "ph.d."
    },
    {
        " In her 42 doctoral thesis   she worked out the theory of possible ": null
    },
    {
        "two-photon absorption": "two-photon absorption"
    },
    {
        " by atoms. ": null
    },
    {
        "Eugene Wigner": "eugene wigner"
    },
    {
        " later described the thesis as a masterpiece of clarity and concreteness . At the time, the chances of experimentally verifying her thesis seemed remote, but the development of the ": null
    },
    {
        "laser": "laser"
    },
    {
        " permitted the first experimental verification in 42 when two-photon-excited fluorescence was detected in a ": null
    },
    {
        "europium": "europium"
    },
    {
        "-doped crystal.  To honor her fundamental contribution to this area, the unit for the two-photon ": null
    },
    {
        "absorption cross section": "absorption cross section"
    },
    {
        " is named the GM . One GM is 42 −42 cm 42 s photon −42 .  Her examiners were three ": null
    },
    {
        "Nobel prize": "nobel prize"
    },
    {
        " winners: ": null
    },
    {
        "Max Born": "max born"
    },
    {
        ", ": null
    },
    {
        "James Franck": "james franck"
    },
    {
        " and ": null
    },
    {
        "Adolf Otto Reinhold Windaus": "adolf otto reinhold windaus"
    },
    {
        " .     On January 42 42 Goeppert married ": null
    },
    {
        "Joseph Edward Mayer": "joseph edward mayer"
    },
    {
        ", an American ": null
    },
    {
        "Rockefeller fellow": "rockefeller foundation"
    },
    {
        " who was one of James Francks assistants.  The two had met when Mayer had boarded with the Goeppert family. The couple moved to Mayers home country of the United States, where he had been offered a position as associate professor of chemistry at ": null
    },
    {
        "Johns Hopkins University": "johns hopkins university"
    },
    {
        ". They had two children, Maria Ann  and Peter Conrad.       Strict rules against ": null
    },
    {
        "nepotism": "nepotism"
    },
    {
        " prevented Johns Hopkins University from hiring Goeppert Mayer as a faculty member.  These rules, created at many universities to prevent patronage, had by this time lost their original purpose and were primarily used to prevent the employment of women married to faculty members. She was given a job as an assistant in the Physics Department working with German correspondence, for which she received a very small salary, a place to work and access to the facilities. She taught some courses, and published an important paper on ": null
    },
    {
        "double beta decay": "double beta decay"
    },
    {
        " in 42        There was little interest in ": null
    },
    {
        "quantum mechanics": "quantum mechanics"
    },
    {
        " at Johns Hopkins but Goeppert Mayer worked with ": null
    },
    {
        "Karl Herzfeld": "karl herzfeld"
    },
    {
        " in this area. They collaborated on a number of papers, including a paper with Herzfelds student A.L. Sklar on the spectrum of ": null
    },
    {
        "benzene": "benzene"
    },
    {
        ".   She also returned to Göttingen in the summers of 42 42 and 42 to work with her former examiner Born, writing an article with him for the Handbuch der Physik. This ended when the ": null
    },
    {
        "NSDAP": "nsdap"
    },
    {
        " came to power in 42 and many academics, including Born and Franck, lost their jobs. Goeppert Mayer and Herzfeld became involved in refugee relief efforts.     Joe Mayer was fired in 42 He attributed this to the hatred of women on the part of the dean of physical sciences, which he thought was provoked by Goeppert Mayers presence in the laboratory. Herzfeld agreed and added that, with Goeppert Mayer, Franck and Herzfeld all at Johns Hopkins, some thought that there were too many German scientists there. There were also complaints from some students that Mayers chemistry lectures contained too much modern physics. Mayer took up a position at ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        ", where the chairman of the Physics Department, ": null
    },
    {
        "George B. Pegram": "george b. pegram"
    },
    {
        ", arranged for Goeppert Mayer to have an office, but she received no salary. She soon made good friends with ": null
    },
    {
        "Harold Urey": "harold urey"
    },
    {
        " and ": null
    },
    {
        "Enrico Fermi": "enrico fermi"
    },
    {
        ", who arrived at Columbia in 42 Fermi asked her to investigate the ": null
    },
    {
        "valence shell": "valence shell"
    },
    {
        " of the undiscovered ": null
    },
    {
        "transuranic elements": "transuranic elements"
    },
    {
        ". Using the ": null
    },
    {
        "Thomas–Fermi model": "thomas–fermi model"
    },
    {
        ", she predicted that they would form a new series similar to the ": null
    },
    {
        "rare earth elements": "rare earth elements"
    },
    {
        ". This proved to be correct.          In December 42 Goeppert Mayer took up her first paid professional position, teaching science part-time at ": null
    },
    {
        "Sarah Lawrence College": "sarah lawrence college"
    },
    {
        ". In the spring of 42 with the United States embroiled in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", she joined the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        ". She accepted a part-time research post from Urey with Columbia Universitys Substitute Alloy Materials Laboratories. The objective of this project was to find a means of separating the ": null
    },
    {
        "fissile": "fissile"
    },
    {
        " uranium42": "uranium-235"
    },
    {
        " isotope in natural uranium; she researched the chemical and thermodynamic properties of ": null
    },
    {
        "uranium hexafluoride": "uranium hexafluoride"
    },
    {
        " and investigated the possibility of separating isotopes by photochemical reactions. This method proved impractical at the time, but the development of lasers would later open the possibility of ": null
    },
    {
        "separation of isotopes by laser excitation": "separation of isotopes by laser excitation"
    },
    {
        ".     Through her friend ": null
    },
    {
        "Edward Teller": "edward teller"
    },
    {
        ", Goeppert Mayer was given a position at Columbia with the Opacity Project, which researched the properties of matter and radiation at extremely high temperatures with an eye to the development of the ": null
    },
    {
        "Tellers Super bomb": "tellers   super   bomb"
    },
    {
        ", the wartime program for the development of ": null
    },
    {
        "thermonuclear weapon": "thermonuclear weapon"
    },
    {
        "s. In February 42 Joe was sent to the ": null
    },
    {
        "Pacific War": "pacific war"
    },
    {
        ", and Goeppert Mayer decided to leave her children in New York and join Tellers group at the ": null
    },
    {
        "Los Alamos Laboratory": "los alamos laboratory"
    },
    {
        ". Joe came back from the Pacific earlier than expected, and they returned to New York together in July 42     In February 42 Joe became a professor in the Chemistry Department and the new ": null
    },
    {
        "Institute for Nuclear Studies": "institute for nuclear studies"
    },
    {
        " at the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        ", and Goeppert Mayer was able to become a voluntary associate professor of physics at the school. When Teller also accepted a position there, she was able to continue her Opacity work with him. When the nearby ": null
    },
    {
        "Argonne National Laboratory": "argonne national laboratory"
    },
    {
        " was founded on July 42 42 Goeppert Mayer was also offered a part-time job there as a senior physicist in the theoretical physics division. She responded I dont know anything about nuclear physics.  She programmed the ": null
    },
    {
        "Aberdeen Proving Ground": "aberdeen proving ground"
    },
    {
        "s ": null
    },
    {
        "ENIAC": "eniac"
    },
    {
        " to solve criticality problems for a ": null
    },
    {
        "liquid metal cooled reactor": "liquid metal cooled reactor"
    },
    {
        " using the ": null
    },
    {
        "Monte Carlo method": "monte carlo method"
    },
    {
        ".             During her time at Chicago and Argonne in the late 42s, Goeppert Mayer developed a mathematical model for the structure of ": null
    },
    {
        "nuclear shells": "nuclear shell model"
    },
    {
        ", which she published in 42   Her model explained why certain numbers of nucleons in an atomic nucleus result in particularly stable configurations. These numbers are what Eugene Wigner called  magic numbers : 42 42 42 42 42 42 and 42 Enrico Fermi provided a critical insight by asking her: Is there any indication of ": null
    },
    {
        "spin orbit coupling": "spin orbit coupling"
    },
    {
        "?  She realised that this was indeed the case, and postulated that the nucleus is a series of closed shells and pairs of neutrons and protons tend to couple together. She described the idea as follows:        Three German scientists, ": null
    },
    {
        "Otto Haxel": "otto haxel"
    },
    {
        ", ": null
    },
    {
        "J. Hans D. Jensen": "j. hans d. jensen"
    },
    {
        ", and ": null
    },
    {
        "Hans Suess": "hans suess"
    },
    {
        ", were also working on solving the same problem, and arrived at the same conclusion independently. While their results were announced in an issue of the ": null
    },
    {
        "Physical Review": "physical review"
    },
    {
        " before Goeppert Mayer in June 42 Goeppert Mayers work was received for review in February 42 while the work of the German authors was received later in April 42   Afterwards, she collaborated with them. Hans Jensen co-authored a book with Goeppert Mayer in 42 titled Elementary Theory of Nuclear Shell Structure. In 42 Goeppert Mayer, Jensen, and Wigner shared the ": null
    },
    {
        "Nobel Prize for Physics": "nobel prize for physics"
    },
    {
        " for their discoveries concerning nuclear shell structure.  She was the second female Nobel laureate in physics, after ": null
    },
    {
        "Marie Curie": "marie curie"
    },
    {
        ", and would be the last for over half a century, until ": null
    },
    {
        "Donna Strickland": "donna strickland"
    },
    {
        " was awarded the prize in 42       In 42 Goeppert Mayer was appointed full professor of physics at the ": null
    },
    {
        "University of California, San Diego": "university of california, san diego"
    },
    {
        ". Although she suffered from a stroke shortly after arriving there, she continued to teach and conduct research for a number of years. She was elected a Fellow of the ": null
    },
    {
        "American Academy of Arts and Sciences": "american academy of arts and sciences"
    },
    {
        " in 42  Goeppert Mayer died in ": null
    },
    {
        "San Diego, California": "san diego, california"
    },
    {
        ", on February 42 42 after a ": null
    },
    {
        "heart attack": "myocardial infarction"
    },
    {
        " that had struck her the previous year left her ": null
    },
    {
        "coma": "coma"
    },
    {
        "tose. She was buried at ": null
    },
    {
        "El Camino Memorial Park": "el camino memorial park"
    },
    {
        " in San Diego.      After her death, the ": null
    },
    {
        "Maria Goeppert Mayer Award": "maria goeppert mayer award"
    },
    {
        " was created by the ": null
    },
    {
        "American Physical Society": "american physical society"
    },
    {
        " to honor young female physicists at the beginning of their careers. Open to all female physicists who hold Ph.D.s, the winner receives money and the opportunity to give guest lectures about her research at four major institutions.  In December 42 the APS named Argonne National Laboratory an APS Historic Site in recognition of her work.  Argonne National Laboratory also honors her by presenting an award each year to an outstanding young woman scientist or engineer,  while the University of California, San Diego hosts an annual Maria Goeppert Mayer symposium, bringing together female researchers to discuss current science.  ": null
    },
    {
        "Crater Goeppert Mayer": "goeppert-mayer"
    },
    {
        " on ": null
    },
    {
        "Venus": "venus"
    },
    {
        ", which has a diameter of about 42  km, is also named after Goeppert-Mayer.  In 42 she was inducted into the ": null
    },
    {
        "National Womens Hall of Fame": "national womens hall of fame"
    },
    {
        ".  In 42 she was included in the third issuance of the American Scientists collection of US postage stamps, along with ": null
    },
    {
        "Melvin Calvin": "melvin calvin"
    },
    {
        ", ": null
    },
    {
        "Asa Gray": "asa gray"
    },
    {
        ", and ": null
    },
    {
        "Severo Ochoa": "severo ochoa"
    },
    {
        ".  Her papers are in the ": null
    },
    {
        "Geisel Library": "geisel library"
    },
    {
        " at the University of California, San Diego,  and the universitys physics department is housed in Mayer Hall, which is named after her and her husband. ": null
    }
]