[
    {
        "     Maria Eleonora of Brandenburg  was a ": null
    },
    {
        "German": "German People"
    },
    {
        " princess": "Princess"
    },
    {
        " and ": null
    },
    {
        "queen consort": "Queen Consort"
    },
    {
        " of ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ".     She was the daughter of ": null
    },
    {
        "John Sigismund, Elector of Brandenburg": "John Sigismund, Elector Of Brandenburg"
    },
    {
        ", and ": null
    },
    {
        "Anna, Duchess of Prussia": "Anna, Duchess Of Prussia"
    },
    {
        ", daughter of ": null
    },
    {
        "Albert Frederick, Duke of Prussia": "Albert Frederick, Duke Of Prussia"
    },
    {
        ".     In the year 1620, Maria Eleonora married the Swedish king ": null
    },
    {
        "Gustavus Adolphus": "Gustavus Adolphus Of Sweden"
    },
    {
        " with her mothers consent, but against the will of her brother ": null
    },
    {
        "George William, Elector of Brandenburg": "George William, Elector Of Brandenburg"
    },
    {
        ", who had just succeeded her father. She bore her husband a daughter, ": null
    },
    {
        "Christina": "Christina Of Sweden"
    },
    {
        ", in 1626.     She was described as the most beautiful queen in Europe, and, as her daughter later said, had all the virtues and vices associated with her gender.       In 1616, the 22-year-old ": null
    },
    {
        "Gustavus Adolphus of Sweden": "Gustavus Adolphus Of Sweden"
    },
    {
        " started looking for a Protestant bride. He had since 1613 tried to get ": null
    },
    {
        "his mothers": "Christina Of Holstein-Gottorp"
    },
    {
        "permission to marry the noblewoman ": null
    },
    {
        "Ebba Brahe": "Ebba Brahe"
    },
    {
        ", but this was not allowed, and he had to give up his wishes to marry her, though he continued to be in love with her. He received reports with the most flattering descriptions of the physical and mental qualities of the beautiful 17-year-old princess Maria Eleonora. Elector John Sigismund was favorably inclined towards the Swedish king, but he had become very infirm after an apoplectic stroke in the autumn of 1617. His determined Prussian wife showed a strong dislike for this Swedish suitor, because Prussia was a Polish fief and the Polish King ": null
    },
    {
        "Sigismund III Vasa": "Sigismund Iii Vasa"
    },
    {
        " still resented his loss of Sweden to Gustavus Adolphus father ": null
    },
    {
        "Charles IX": "Charles Ix Of Sweden"
    },
    {
        ".     Maria Eleonora had additional suitors in the young ": null
    },
    {
        "William of Orange": "William Ii, Prince Of Orange"
    },
    {
        ", ": null
    },
    {
        "Wladislaw Vasa of Poland": "Wladislaw Iv Of Poland"
    },
    {
        ", ": null
    },
    {
        "Adolf Friedrich of Mecklenburg": "Adolf Frederick I, Duke Of Mecklenburg"
    },
    {
        " and even the future ": null
    },
    {
        "Charles I of England": "Charles I Of England"
    },
    {
        ". Maria Eleonoras brother George William was flattered by the offer of the British Crown Prince and proposed their younger sister ": null
    },
    {
        "Catherine": "Catherine Of Brandenburg"
    },
    {
        " as a more suitable wife for the Swedish king. Maria Eleonora, however, seems to have had a preference for Gustavus Adolphus. For him it was a matter of honour to acquire the hand of Maria Eleonora and none other. He had the rooms of his castle in ": null
    },
    {
        "Stockholm": "Stockholm"
    },
    {
        " redecorated and started making preparations to leave for ": null
    },
    {
        "Berlin": "Berlin"
    },
    {
        " to press his suit in person, when a letter arrived from Maria Eleonoras mother to his mother. The Electress demanded in no uncertain terms that the Queen Dowager should prevent her sons journey, as being prejudicial to Brandenburgs interests in view of the state of war existing between Sweden and Poland . Her husband, she wrote, was so enfeebled in will by illness that he could be persuaded to agree to anything, even if it tended to the destruction of the country . It was a rebuff that verged on an insult.          The Elector John Sigismund, Maria Eleonoras father, died on 23 December 1619, and the prospect of a Swedish marriage seemed gone with him. In the spring of 1620, however, stubborn Gustavus Adolphus arrived in Berlin. The Electress Dowager maintained an attitude of reserve and even refused to grant the Swedish king a personal meeting with Maria Eleonora. All those who were present, however, noticed the princesss interest in the young king. Afterwards, Gustavus Adolphus made a round of other Protestant German courts with the professed intention of inspecting a few matrimonial alternatives. On his return to Berlin, the Electress Dowager seems to have become completely captivated by the charming Swedish king. After plighting his troth to Maria Eleonora, Gustavus Adolphus hurried back to Sweden to make arrangements for the reception of his bride.     The new Elector, George William, who resided in Prussia, was appalled when he heard of his mothers independent action. He wrote to Gustavus Adolphus to refuse his consent to the marriage until Sweden and Poland had settled their differences. It was the Electress Dowager, however, who, in accordance with Hohenzollern family custom, had the last word in bestowing her daughters hand in marriage. She sent Maria Eleonora to territory outside of George Williams reach and concluded the marriage negotiations herself.     Anna of Prussia provided herself with a selection of objects of value from the exchequer before she joined Maria Eleonora in ": null
    },
    {
        "Brunswick": "Braunschweig"
    },
    {
        ". A detachment of the Swedish fleet took the women over to ": null
    },
    {
        "Kalmar": "Kalmar"
    },
    {
        ", where Gustavus Adolphus was impatiently awaiting them. The ": null
    },
    {
        "wedding": "Wedding Of Gustav Ii Adolf And Maria Eleonora"
    },
    {
        " took place in Stockholm on 25 November 1620. A comedy was performed based on the history of ": null
    },
    {
        "Olof Skötkonung": "Olof Skötkonung"
    },
    {
        ". Gustavus Adolphus - in his own words - finally had a Brandenburg lady in his marriage bed . Anna of Prussia actually stayed with her daughter in Sweden for several years after the marriage.       Gustavus Adolphus shared Maria Eleonoras interest in architecture and her love of music, while she was sentimentally devoted to her husband. Often, she lamented that she never had her hero for herself. Foreign ambassadors found her gracious and beautiful and she had good taste, although her character showed some extravagant traits. Maria Eleonora had a definite liking for entertainment and sweetmeats, and she soon succumbed to the current fashionable craze for buffoons and dwarfs. She spoke French, the court language of the age, but never bothered to learn to write German or Swedish correctly.     Within six months of their marriage, Gustavus Adolphus left to command the siege of ": null
    },
    {
        "Riga": "Riga"
    },
    {
        ", leaving Maria Eleonora in the early stages of her first pregnancy. She lived exclusively in the company of her German ladies-in-waiting and had difficulty in adapting herself to the Swedish people, countryside and climate. She disliked the bad roads, sombre forests and wooded houses, roofed with turf. She also pined for her husband. A year after their wedding she had a miscarriage and became seriously ill. She was tempestuous, excessive, neurotic and jealous. She was often given to harsh language, and she did not spare her husband, even when strangers were present. Her emotional life lacked balance, and everything Maria Eleonora undertook on her own initiative needed careful watching. Soon Gustavus Adolphus intimates knew that his married life was a source of grief and anxiety.     In the autumn of 1623 Maria Eleonora gave birth to a daughter, but the baby died the next year. At that time, the only surviving male heirs were the hated king of Poland and his sons. With Gustavus Adolphus risking his life in battles, an heir to the throne was anxiously awaited. In the autumn Maria Eleonora was pregnant for a third time. In May 1625 she was in good spirits and insisted on accompanying her husband on the royal yacht to review the fleet. There seemed to be no danger, as the warships were moored just opposite the castle, but a sudden storm nearly capsized the yacht. The queen was hurried back to the castle, but when she got there she was heard to exclaim: Jesus, I cannot feel my child! Shortly afterwards the longed-for son was stillborn.       With the renewal of the war with Poland, Gustavus Adolphus had to leave his wife again. It is likely that she gave way to depression and grief, as we know she did in 1627, and it is probably for this reason that the king let his queen join him in Livonia after the Poles had been defeated in January 1626. By April, Maria Eleonora found she was again pregnant. No risks were taken this time and the astrologers predicted the birth of a son and heir. During a lull in the warfare, Gustavus Adolphus hurried back to Stockholm to await the arrival of the baby. The birth was a difficult one. On 7 December, a baby was born with a fleece , which enveloped it from its head to its knees, leaving only its face, arms and lower part of its legs free. Moreover, it had a large nose and was covered with hair. Thus, it was assumed the baby was a boy, and so the King was told. Closer inspection, however, determined that the baby was a girl. Gustavus Adolphus half-sister ": null
    },
    {
        "Catherine": "Catherine Of Sweden"
    },
    {
        " informed him that the child was a girl. She carried the baby in her arms to the king in a condition for him to see and to know and realise for himself what she dared not tell him . Gustavus Adolphus remarked: She is going to be clever, for she has taken us all in. His disappointment did not last long, and he decided that she would be called Christina after his mother. He gave orders for the birth to be announced with all the solemnity usually accorded to the arrival of a male heir. This seems to indicate that Gustavus Adolphus, at the age of 33, had little hope of having other children. Maria Eleonoras state of health seems to be the most likely explanation for this. Her later portraits and actions, however, do not indicate that she was physically fragile.     Shortly after the birth, Maria Eleonora was in no condition to be told the truth about the babys sex, and the king and court waited several days before breaking the news to her. She screamed: Instead of a son, I am given a daughter, dark and ugly, with a great nose and black eyes. Take her from me, I will not have such a monster! She may have suffered from a ": null
    },
    {
        "post-natal depression": "Post-Natal Depression"
    },
    {
        ". In her agitated state, the queen tried to injure the child.      In Christinas early childhood, she repeatedly met with accidents. Once a beam fell mysteriously upon the cradle. Another time, she fell from a flight of stairs, apparently by accident. On another occasion the nursemaid was blamed for dropping the baby onto a stone floor, injuring a shoulder that ever afterwards remained a little crooked.     In the year after Christinas birth, Maria Eleonora was described as being in a state of hysteria owing to her husbands absences. In 1632 Gustavus Adolphus described his wife as being a very sick woman . There was some excuse for her; she had lost three babies and still felt herself an isolated foreigner in a hostile land, even more so after 1627 when her brother joined Swedens enemies. Meanwhile, her husbands life was constantly in danger when he was on campaign. In 1627 Gustavus Adolphus was both ill and wounded. Two years later he had a narrow escape at ": null
    },
    {
        "Stuhm": "Stuhm"
    },
    {
        ".     Gustavus Adolphus was devoted to his daughter and tried to raise Christina like a boy. At the age of two, she clapped her hands and laughed with joy when the great cannons of ": null
    },
    {
        "Kalmar Castle": "Kalmar Castle"
    },
    {
        " boomed out the royal salute. Afterwards, Gustavus Adolphus often took his daughter with him to military reviews. Maria Eleonora showed little affection for her daughter and was not allowed any influence in Christinas upbringing. The princess was placed in the care of Gustavus Adolphus half-sister Catherine and the Chancellor ": null
    },
    {
        "Axel Oxenstierna": "Axel Oxenstierna"
    },
    {
        ".     In 1630 Gustavus Adolphus concluded that ": null
    },
    {
        "Habsburg": "Habsburg"
    },
    {
        " designs for Baltic supremacy threatened Swedens very existence and also its religious freedom. Before he left to join the ": null
    },
    {
        "Thirty Years War": "Thirty Years War"
    },
    {
        ", he discussed a possible regency with members of the government and admitted to them that his wife was a miserable woman . Even so, Gustavus Adolphus could not bring himself to nominate a regency council in which her name did not appear. To Axel Oxenstierna, he confessed: If anything happens to me, my family will merit your pity the mother lacking in common sense, the daughter a minor - hopeless, if they rule, and dangerous, if others come to rule over them.                    During the next two years Gustavus Adolphus marched across a devastated ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", conquering ": null
    },
    {
        "Pomerania": "Pomerania"
    },
    {
        " and ": null
    },
    {
        "Mecklenburg": "Mecklenburg"
    },
    {
        ". In early November 1632 he went to ": null
    },
    {
        "Erfurt": "Erfurt"
    },
    {
        " to say goodbye to Maria Eleonora, who had been in Germany since the previous winter. In the ": null
    },
    {
        "Battle of Lützen": "Battle Of Lützen"
    },
    {
        ", the 37-year-old Gustavus Adolphus was shot in the back. He fell and was dragged for some distance by his horse. He managed to free himself from the stirrup, but while lying on the ground The Lion of the North was killed by another shot through his head. By nightfall both armies were exhausted, but ": null
    },
    {
        "Bernard of Saxe-Weimar": "Bernard Of Saxe-Weimar"
    },
    {
        " and the Swedes had captured all the Imperial artillery and were in possession of the key position. The kings body was found lying face downwards in the mud, plundered of everything but his shirt.     Maria Eleonora was not included in the regency government during the minority of her daughter, as the council of the state did not consider her suitable as regent. The king had never actually left any instructions that she should not be included in the case of a minor regency, but they supported their grounds for excluding her by the claim that the late king had said to them that she should never be entrusted with matters of state, though he never left any papers to confirm this.   When she was informed that the regency government had been formed in May 1633 and that she had been excluded from it, Maria Eleonora was reportedly offended, and pointed out that her late mother-in-law, ": null
    },
    {
        "Christina of Holstein-Gottorp": "Christina Of Holstein-Gottorp"
    },
    {
        ", had served as regent during the minority of her late spouse. In reply, however, the representative of the regency council, ": null
    },
    {
        "Gabriel Gustafsson Oxenstierna": "Gabriel Gustafsson Oxenstierna"
    },
    {
        ", responded that her information of the regency of queen dowager Christina was highly exaggerated, and that Sweden actually had no tradition to include queen dowagers in minor regencies.  This was in fact a lie: not only had the queen dowager Christina in fact been regent, but king ": null
    },
    {
        "Gustav I of Sweden": "Gustav I Of Sweden"
    },
    {
        " had proclaimed his queen ": null
    },
    {
        "Margaret Leijonhufvud": "Margaret Leijonhufvud"
    },
    {
        " regent in case of a minor regency in 1544, and ": null
    },
    {
        "John III of Sweden": "John Iii Of Sweden"
    },
    {
        " had provided for such a regency for both his first queen, ": null
    },
    {
        "Catherine Jagiellon": "Catherine Jagiellon"
    },
    {
        ", as well as for his second, ": null
    },
    {
        "Gunilla Bielke": "Gunilla Bielke"
    },
    {
        ".   Maria Eleonora, however, accepted the response, and declared that she would satisfied to entrust politics to others and to be in control of the custody of her daughter.      In 1633 Maria Eleonora returned to Sweden with the embalmed body of her husband. In ": null
    },
    {
        "Nyköping": "Nyköping"
    },
    {
        ", 7-year-old ": null
    },
    {
        "Queen Christina": "Christina Of Sweden"
    },
    {
        " came in solemn procession to the ship to receive her mother. Later she wrote: I embraced the queen my mother, she drowned me with her tears and practically smothered me in her arms. For more than a year Maria Eleonora condemned Christina to a mourning seclusion in rooms draped with black and lit by candles day and night, from which every ray of light was excluded. She made her daughter sleep with her in a bed over which her fathers heart was hung in a golden casket. Things were made worse by Maria Eleonoras continual weeping. Christina, who also was somewhat malformed with one shoulder higher than the other, also detested her mothers dwarfs and buffoons. She became seriously ill; an ulcer appeared on her left breast, causing her terrible pain and a high fever until it burst. In the summer of 1634 the funeral procession finally wound its way to Stockholm. Queen Christina later wrote about her mother: She carried out her role of mourning to perfection.     Maria Eleonora had plunged into a prolonged period of emotional dysregulation due to grief. She found it more difficult than ever to conceal her dislike of Swedish rocks and mountains, the freezing air, and all the rest of it . During the rest of her life she preserved the memory of her husband, weeping for hours and even days on end. When the regency council tried to separate Christina from her mother, Maria Eleonora wept and protested so bitterly that nothing was done.       In 1636 Maria Eleonora was taken to Gripsholm castle and officially lost her parental rights to her daughter, because at times she was completely out of her mind. In 1639 a letter written by her and intended for Swedens archenemy, the King ": null
    },
    {
        "Christian IV of Denmark": "Christian Iv Of Denmark"
    },
    {
        ", was intercepted. After a summons, Maria Eleonora appeared at her daughters court in a flood of tears in the summer of 1640. Queen Christina, 13 years old, reasoned with her mother and dissuaded her from taking up residence at Nyköping near Denmark. Afterwards, Maria Eleonora returned to Gripsholm. To undertake one of her periodic fasts, she retired to the seclusion of her own apartment, accompanied by only one of her ladies-in-waiting, Anna Sofia von Bülow. Maria Eleonora wrote regularly to her daughter Christina. She and her German court wanted to leave their exile at Gripsholm castle. Christina replied tactfully, knowing that the Council would not permit the queen mother any leave. Eventually her mother asked to leave Sweden altogether. Christina invited her to Stockholm, attempting to persuade her to stay in the country. At night the two ladies let themselves down from a window and were rowed in a boat to the other side of the nearby lake, where a carriage was waiting for them. They drove to Nyköping, where they boarded a Danish ship. King Christian IV had intended the ship to take her home to Brandenburg, but she convinced the captain to bring her to Denmark instead. She was well received by the Danish king, but Maria Eleonora wanted to go home to Brandenburg. The electoral prince there demanded financial compensation from Sweden, where on the contrary the Council expected to withdraw her appanage as well as her properties. Finally the teenage Christina succeeded in negotiating a certain alimony for her mother, adding to this from her own purse.          In Denmark, Maria Eleonora became the guest of King ": null
    },
    {
        "Christian IV": "Christian Iv"
    },
    {
        ". The Elector George William refused to receive his sister in Brandenburg, so Maria Eleonora had to wait until his death in December that year before her nephew gave her permission to visit Brandenburg. Still, the new Elector insisted that Sweden should provide for his aunts upkeep. She received a small pension of 30,000 écus a year. After a while Maria Eleonora surprisingly started to long for Sweden, and in 1648 she returned. Queen Christina went to meet her mothers ship. It was delayed by a storm and the young queen slept in the open for two nights and contracted a fever, which kept her in bed for some days. In October 1650 Maria Eleonora attended her daughters postponed coronation ceremony. Christina then bought the newly erected castle Makalös for her, close to the royal castle in Stockholm. It would have been enormously expensive, but Christina never paid. Instead she handed it back in 1652.     In June 1654, Christina shocked everyone when she decided to abdicate in favour of her cousin ": null
    },
    {
        "Charles Gustav": "Charles X Gustav Of Sweden"
    },
    {
        ". Maria Eleonora had grave doubts about her daughters abdication and its possible effect upon her own finances. Christina and Charles Gustav visited her at Nyköping in April 1654 and promised the Queen Dowager that she would be provided for. Christina abdicated June 5, 1654. Maria Eleonora died in March 1655. At that time, ex-Queen Christina was living in Brussels; she converted to Catholicism in December 1655.       ": null
    }
]