[
    {
        "   Marinette is a ": null
    },
    {
        "loa": "loa"
    },
    {
        " of power and violence in ": null
    },
    {
        "Haitian Vodou": "haitian vodou"
    },
    {
        ". In her ": null
    },
    {
        "petro": "petro loa"
    },
    {
        " form she is called Marinette Bras Cheche or Marinette Pied Cheche suggesting that she is ": null
    },
    {
        "skeletal": "skeleton"
    },
    {
        ".     She is believed to be the ": null
    },
    {
        "Mambo": "mambo"
    },
    {
        " who sacrificed the black pig at the culmination of the start of the first ": null
    },
    {
        "Haitian Revolution": "haitian revolution"
    },
    {
        ". While she is feared and tends to ride those she ": null
    },
    {
        "possesses": "spirit possession"
    },
    {
        " violently, she can also be seen as one who frees her people from bondage.     Marinette is represented by a ": null
    },
    {
        "screech owl": "screech owl"
    },
    {
        " and is often seen as the protector of ": null
    },
    {
        "werewolves": "werewolves"
    },
    {
        ". Her ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        " counterpart is the ": null
    },
    {
        "Anima Sola": "anima sola"
    },
    {
        "  who can either free one from bondage or drag you back. Her colors are black and deep blood red. Her offerings are black ": null
    },
    {
        "pig": "pig"
    },
    {
        "s and black ": null
    },
    {
        "rooster": "rooster"
    },
    {
        "s plucked alive.     Mambo Marinette is not cruel. She only gets cruel in possession, when people burn animals or humans. Her colors are red and black. She likes Salvia, black pepper, lavender and sweets.       Marinette is a main character in Rem Oscuros book I am the Dark.   FLÏRT, a band from Hamburg, Germany, refers to Marinette in the song Marinette of the Dry Feet .   Marinette is the main antagonist in the DC Comics Series Ragman - Cry of the Dead.   Marinette appears in the DC/Vertigo Comics series House of Whispers which takes place in the Sandman universe.   Marinette, or Her Lady of the Dry Arms, appears in The Bruja by Michael Molisani.                     ": null
    }
]