[
    {
        "           Maria Theresa Walburga Amalia Christina  was the only female ruler of the ": null
    },
    {
        "Habsburg dominions": "habsburg monarchy"
    },
    {
        " and the last of the ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        ". She was the sovereign of ": null
    },
    {
        "Austria": "archduchy of austria"
    },
    {
        ", ": null
    },
    {
        "Hungary": "kingdom of hungary"
    },
    {
        ", ": null
    },
    {
        "Croatia": "kingdom of croatia"
    },
    {
        ", ": null
    },
    {
        "Bohemia": "crown of bohemia"
    },
    {
        ", ": null
    },
    {
        "Transylvania": "principality of transylvania"
    },
    {
        ", ": null
    },
    {
        "Mantua": "mantua"
    },
    {
        ", ": null
    },
    {
        "Milan": "milan"
    },
    {
        ", ": null
    },
    {
        "Lodomeria and Galicia": "kingdom of galicia and lodomeria"
    },
    {
        ", the ": null
    },
    {
        "Austrian Netherlands": "austrian netherlands"
    },
    {
        ", and ": null
    },
    {
        "Parma": "parma"
    },
    {
        ". By marriage, she was ": null
    },
    {
        "Duchess of Lorraine": "duchess of lorraine"
    },
    {
        ", ": null
    },
    {
        "Grand Duchess of Tuscany": "grand duchess of tuscany"
    },
    {
        " and ": null
    },
    {
        "Holy Roman Empress": "holy roman empress"
    },
    {
        ".     She started her 42-year reign when her father, ": null
    },
    {
        "Emperor Charles VI": "emperor charles vi"
    },
    {
        ", died in October 42 Charles VI paved the way for her accession with the ": null
    },
    {
        "Pragmatic Sanction of 42": "pragmatic sanction of 1713"
    },
    {
        " and spent his entire reign securing it. He neglected the advice of ": null
    },
    {
        "Prince Eugene of Savoy": "prince eugene of savoy"
    },
    {
        ", who averred that a strong military and a rich treasury were more important than mere signatures. Eventually, he left behind a weakened and impoverished state, particularly due to the ": null
    },
    {
        "War of the Polish Succession": "war of the polish succession"
    },
    {
        " and the ": null
    },
    {
        "Russo-Turkish War ": "russo-turkish war"
    },
    {
        ". Moreover, upon his death, ": null
    },
    {
        "Saxony": "electorate of saxony"
    },
    {
        ", ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        ", ": null
    },
    {
        "Bavaria": "electorate of bavaria"
    },
    {
        ", and ": null
    },
    {
        "France": "kingdom of france"
    },
    {
        " all repudiated the sanction they had recognised during his lifetime. ": null
    },
    {
        "Frederick II of Prussia": "frederick ii of prussia"
    },
    {
        " promptly invaded and took the affluent Habsburg province of ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        " in the seven-year conflict known as the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        ". In defiance of the grave situation, she managed to secure the vital support of the Hungarians for the war effort. Over the course of the war, despite the loss of Silesia and a few minor territories in Italy, Maria Theresa successfully defended her rule over most of the Habsburg empire. Maria Theresa later unsuccessfully tried to reconquer Silesia during the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        ".     Maria Theresa and her husband, ": null
    },
    {
        "Francis I, Holy Roman Emperor": "francis i, holy roman emperor"
    },
    {
        ", had eleven daughters, including the ": null
    },
    {
        "Queen of France": "marie antoinette"
    },
    {
        ", the ": null
    },
    {
        "Queen of Naples and Sicily": "maria carolina of austria"
    },
    {
        ", the ": null
    },
    {
        "Duchess of Parma": "maria amalia, duchess of parma"
    },
    {
        ", and five sons, including two Holy Roman Emperors, ": null
    },
    {
        "Joseph II": "joseph ii, holy roman emperor"
    },
    {
        " and ": null
    },
    {
        "Leopold II": "leopold ii, holy roman emperor"
    },
    {
        ". Of the sixteen children, ten survived to adulthood. Though she was expected to cede power to Francis and Joseph, both of whom were officially her co-rulers in Austria and Bohemia, Maria Theresa was the absolute sovereign who ruled with the counsel of her advisers.     Maria Theresa promulgated institutional, financial and educational reforms, with the assistance of ": null
    },
    {
        "Wenzel Anton of Kaunitz-Rietberg": "wenzel anton, prince of kaunitz-rietberg"
    },
    {
        ", ": null
    },
    {
        "Friedrich Wilhelm von Haugwitz": "friedrich wilhelm von haugwitz"
    },
    {
        " and ": null
    },
    {
        "Gerard van Swieten": "gerard van swieten"
    },
    {
        ". She also promoted ": null
    },
    {
        "commerce": "commerce"
    },
    {
        " and the development of agriculture, and reorganised Austrias ramshackle military, all of which strengthened Austrias international standing. However, she despised the Jews and the Protestants, and on certain occasions she ordered their expulsion to remote parts of the realm. She also advocated for the state church and refused to allow ": null
    },
    {
        "religious pluralism": "religious pluralism"
    },
    {
        ". Consequently, her regime was criticized as intolerant by some contemporaries.          The second and eldest surviving child of ": null
    },
    {
        "Holy Roman Emperor Charles VI": "holy roman emperor charles vi"
    },
    {
        " and ": null
    },
    {
        "Elisabeth Christine of Brunswick-Wolfenbüttel": "elisabeth christine of brunswick-wolfenbüttel"
    },
    {
        ", Archduchess Maria Theresa was born on 42 May 42 in ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", a year after the death of her elder brother, Archduke Leopold, and was baptised on that same evening. The ": null
    },
    {
        "dowager": "dowager"
    },
    {
        " empresses, her aunt ": null
    },
    {
        "Wilhelmine Amalia of Brunswick-Lüneburg": "wilhelmine amalia of brunswick-lüneburg"
    },
    {
        " and grandmother ": null
    },
    {
        "Eleonor Magdalene of Neuburg": "eleonor magdalene of neuburg"
    },
    {
        ", were her godmothers. Most descriptions of her baptism stress that the infant was carried ahead of her cousins, ": null
    },
    {
        "Maria Josepha": "maria josepha of austria"
    },
    {
        " and ": null
    },
    {
        "Maria Amalia": "maria amalia, holy roman empress"
    },
    {
        ", the daughters of Charles VIs elder brother and predecessor, ": null
    },
    {
        "Joseph I": "joseph i, holy roman emperor"
    },
    {
        ", before the eyes of their mother, Wilhelmine Amalia. It was clear that Maria Theresa would outrank them, even though their grandfather, ": null
    },
    {
        "Holy Roman Emperor Leopold I": "leopold i, holy roman emperor"
    },
    {
        ", had his sons sign the ": null
    },
    {
        "Mutual Pact of Succession": "mutual pact of succession"
    },
    {
        ", which gave precedence to the daughters of the elder brother. Her father was the only surviving male member of the House of Habsburg and hoped for a son who would prevent the extinction of his dynasty and succeed him. Thus, the birth of Maria Theresa was a great disappointment to him and the people of Vienna; Charles never managed to overcome this feeling.     Maria Theresa replaced Maria Josepha as ": null
    },
    {
        "heir presumptive": "heir presumptive"
    },
    {
        " to the Habsburg realms the moment she was born; Charles VI had issued the ": null
    },
    {
        "Pragmatic Sanction of 42": "pragmatic sanction of 1713"
    },
    {
        " which had placed his nieces behind his own daughters in the line of succession. Charles sought the other European powers approval for disinheriting his nieces. They exacted harsh terms: in the ": null
    },
    {
        "Treaty of Vienna ": "treaty of vienna"
    },
    {
        ", Great Britain demanded that Austria abolish the ": null
    },
    {
        "Ostend Company": "ostend company"
    },
    {
        " in return for its recognition of the Pragmatic Sanction. In total, ": null
    },
    {
        "Great Britain": "kingdom of great britain"
    },
    {
        ", ": null
    },
    {
        "France": "early modern france"
    },
    {
        ", ": null
    },
    {
        "Saxony": "electorate of saxony"
    },
    {
        ", ": null
    },
    {
        "United Provinces": "dutch republic"
    },
    {
        ", ": null
    },
    {
        "Spain": "enlightenment in spain"
    },
    {
        ", ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        ", ": null
    },
    {
        "Denmark": "denmark-norway"
    },
    {
        ", ": null
    },
    {
        "Sardinia": "kingdom of sardinia"
    },
    {
        ", ": null
    },
    {
        "Bavaria": "history of bavaria"
    },
    {
        " and the ": null
    },
    {
        "Diet of the Holy Roman Empire": "diet of the holy roman empire"
    },
    {
        " recognised the sanction.  France, Spain, Saxony, Bavaria and Prussia later reneged.          Little more than a year after her birth, Maria Theresa was joined by a sister, ": null
    },
    {
        "Maria Anna": "archduchess maria anna of austria"
    },
    {
        ", and another one, named Maria Amalia, was born in 42 The portraits of the imperial family show that Maria Theresa resembled Elisabeth Christine and Maria Anna. The Prussian ambassador noted that she had large blue eyes, fair hair with a slight tinge of red, a wide mouth and a notably strong body. Unlike many other members of the House of Habsburg, neither Maria Theresas parents nor her grandparents were closely related to each other.     Maria Theresa was a serious and reserved child who enjoyed singing and archery. She was barred from horse riding by her father, but she would later learn the basics for the sake of her ": null
    },
    {
        "Hungarian coronation ceremony": "coronation of the hungarian monarch"
    },
    {
        ". The imperial family staged opera productions, often conducted by Charles  VI, in which she relished participating. Her education was overseen by ": null
    },
    {
        "Jesuits": "society of jesus"
    },
    {
        ". Contemporaries thought her ": null
    },
    {
        "Latin": "latin"
    },
    {
        " to be quite good, but in all else, the Jesuits did not educate her well. Her spelling and punctuation were unconventional and she lacked the formal manner and speech which had characterised her Habsburg predecessors. Maria Theresa developed a close relationship with ": null
    },
    {
        "Countess Marie Karoline von Fuchs-Mollard": "marie karoline von fuchs-mollard"
    },
    {
        ", who taught her etiquette. She was educated in drawing, painting, music and dancing – the disciplines which would have prepared her for the role of ": null
    },
    {
        "queen consort": "queen consort"
    },
    {
        ". Her father allowed her to attend meetings of the council from the age of 42 but never discussed the affairs of state with her. Even though he had spent the last decades of his life securing Maria Theresas inheritance, Charles never prepared his daughter for her future role as sovereign.       The question of Maria Theresas marriage was raised early in her childhood. ": null
    },
    {
        "Leopold Clement of Lorraine": "léopold clément, hereditary prince of lorraine"
    },
    {
        " was first considered to be the appropriate suitor, and he was supposed to visit Vienna and meet the Archduchess in 42 These plans were forestalled by his death from ": null
    },
    {
        "smallpox": "smallpox"
    },
    {
        ".     Leopold Clements younger brother, ": null
    },
    {
        "Francis Stephen": "francis i, holy roman emperor"
    },
    {
        ", was invited to Vienna. Even though Francis Stephen was his favourite candidate for Maria Theresas hand, the Emperor considered other possibilities. Religious differences prevented him from arranging his daughters marriage to the Protestant prince ": null
    },
    {
        "Frederick of Prussia": "frederick ii of prussia"
    },
    {
        ". In 42 he betrothed her to ": null
    },
    {
        "Charles of Spain": "charles iii of spain"
    },
    {
        " and her sister, Maria Anna, to ": null
    },
    {
        "Philip of Spain": "philip, duke of parma"
    },
    {
        ". Other European powers compelled him to renounce the pact he had made with the Queen of Spain, ": null
    },
    {
        "Elisabeth Farnese": "elisabeth farnese"
    },
    {
        ". Maria Theresa, who had become close to Francis Stephen, was relieved.        Francis Stephen remained at the imperial court until 42 when he ascended the throne of Lorraine, but was not formally promised Maria Theresas hand until 42 January 42 during the ": null
    },
    {
        "War of the Polish Succession": "war of the polish succession"
    },
    {
        ". ": null
    },
    {
        "Louis XV of France": "louis xv of france"
    },
    {
        " demanded that Maria Theresas fiancé surrender his ancestral ": null
    },
    {
        "Duchy of Lorraine": "duchy of lorraine"
    },
    {
        " to accommodate his father-in-law, ": null
    },
    {
        "Stanisław I": "stanisław i"
    },
    {
        ", who had been deposed as King of Poland. Francis Stephen was to receive the ": null
    },
    {
        "Grand Duchy of Tuscany": "grand duchy of tuscany"
    },
    {
        " upon the death of childless Grand Duke ": null
    },
    {
        "Gian Gastone de Medici": "gian gastone de medici, grand duke of tuscany"
    },
    {
        ". The couple were married on 42 February 42     The Duchess of Lorraines love for her husband was strong and possessive. The letters she sent to him shortly before their marriage expressed her eagerness to see him; his letters, on the other hand, were stereotyped and formal. She was very jealous of her husband and his infidelity was the greatest problem of their marriage, with ": null
    },
    {
        "Maria Wilhelmina, Princess of Auersperg": "maria wilhelmina von neipperg"
    },
    {
        ", as his best-known mistress.     Upon Gian Gastones death on 42 July 42 Francis Stephen ceded Lorraine and became Grand Duke of Tuscany. In 42 Charles  VI sent the young couple to make their formal entry into Tuscany. A triumphal arch was erected at the Porta Galla in celebration, where it remains today. Their stay in ": null
    },
    {
        "Florence": "florence"
    },
    {
        " was brief. Charles  VI soon recalled them, as he feared he might die while his heiress was miles away in Tuscany. In the summer of 42 Austria suffered defeats during the ongoing ": null
    },
    {
        "Russo-Turkish War": "russo-turkish war"
    },
    {
        ". The Turks reversed Austrian gains in ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        ", ": null
    },
    {
        "Wallachia": "wallachia"
    },
    {
        " and ": null
    },
    {
        "Bosnia": "bosnia eyalet"
    },
    {
        ". The Viennese rioted at the cost of the war. Francis Stephen was popularly despised, as he was thought to be a cowardly French spy. The war was concluded the next year with the ": null
    },
    {
        "Treaty of Belgrade": "treaty of belgrade"
    },
    {
        ".          Charles VI died on 42 October 42 probably of mushroom poisoning. He had ignored the advice of ": null
    },
    {
        "Prince Eugene of Savoy": "prince eugene of savoy"
    },
    {
        " who had urged him to concentrate on filling the treasury and equipping the army rather than on acquiring signatures of fellow monarchs. The Emperor, who spent his entire reign securing the Pragmatic Sanction, left Austria in an impoverished state, bankrupted by the recent Turkish war and the ": null
    },
    {
        "War of the Polish Succession": "war of the polish succession"
    },
    {
        "; the treasury contained only 42 ": null
    },
    {
        "gulden": "austro-hungarian gulden"
    },
    {
        ", which were claimed by his widow. The army had also been weakened due to these wars; instead of the full number of 42, the army had been reduced to about 42, and they were scattered in small areas from the Austrian Netherlands to Transylvania, and from Silesia to Tuscany. They were also poorly trained and discipline was lacking. Later Maria Theresa even made a remark: as for the state in which I found the army, I cannot begin to describe it.      Maria Theresa found herself in a difficult situation. She did not know enough about matters of state and she was unaware of the weakness of her fathers ministers. She decided to rely on her fathers advice to retain his counselors and to defer to her husband, whom she considered to be more experienced, on other matters. Both decisions later gave cause for regret. Ten years later, Maria Theresa recalled in her Political Testament the circumstances under which she had ascended: I found myself without money, without credit, without army, without experience and knowledge of my own and finally, also without any counsel because each one of them at first wanted to wait and see how things would develop.      She dismissed the possibility that other countries might try to seize her territories and immediately started ensuring the imperial dignity for herself; since a woman could not be elected ": null
    },
    {
        "Holy Roman Empress": "holy roman emperor"
    },
    {
        ", Maria Theresa wanted to secure the imperial office for her husband, but Francis Stephen did not possess enough land or rank within the Holy Roman Empire. In order to make him eligible for the imperial throne and to enable him to vote in the ": null
    },
    {
        "imperial election": "imperial election"
    },
    {
        "s as ": null
    },
    {
        "elector of Bohemia": "elector of bohemia"
    },
    {
        " , Maria Theresa made Francis Stephen ": null
    },
    {
        "co-ruler": "coregency"
    },
    {
        " of the Austrian and Bohemian lands on 42 November 42 It took more than a year for the Diet of Hungary to accept Francis Stephen as co-ruler, since they asserted that the sovereignty of Hungary could not be shared. Despite her love for him and his position as co-ruler, Maria Theresa never allowed her husband to decide matters of state and often dismissed him from council meetings when they disagreed.     The first display of the new queens authority was the formal act of ": null
    },
    {
        "homage": "homage"
    },
    {
        " of the Lower Austrian Estates to her on 42 November 42 It was an elaborate public event which served as a formal recognition and legitimation of her accession. The ": null
    },
    {
        "oath of fealty": "oath of fealty"
    },
    {
        " to Maria Theresa was taken on the same day in the Ritterstube of the Hofburg.                  Immediately after her accession, a number of European sovereigns who had recognised Maria Theresa as heir broke their promises. Queen Elisabeth of Spain and Elector ": null
    },
    {
        "Charles Albert of Bavaria": "charles vii, holy roman emperor"
    },
    {
        ", married to Maria Theresas deprived cousin Maria Amalia and supported by Empress Wilhelmine Amalia, coveted portions of her inheritance. Maria Theresa did secure recognition from King ": null
    },
    {
        "Charles Emmanuel III of Sardinia": "charles emmanuel iii of sardinia"
    },
    {
        ", who had not accepted the Pragmatic Sanction during her fathers lifetime, in November 42     In December, ": null
    },
    {
        "Frederick II of Prussia": "frederick ii of prussia"
    },
    {
        " invaded the ": null
    },
    {
        "Duchy of Silesia": "duchy of silesia"
    },
    {
        " and requested that Maria Theresa cede it, threatening to join her enemies if she refused. Maria Theresa decided to fight for the mineral-rich province. Frederick even offered a compromise: he would defend Maria Theresas rights if she agreed to cede to him at least a part of Silesia. Francis Stephen was inclined to consider such an arrangement, but the Queen and her advisers were not, fearing that any violation of the Pragmatic Sanction would invalidate the entire document. Maria Theresas firmness soon assured Francis Stephen that they should fight for Silesia, and she was confident that she would retain the jewel of the House of Austria . The resulting war with Prussia is known as the ": null
    },
    {
        "First Silesian War": "first silesian war"
    },
    {
        ". The invasion of Silesia by Frederick was the start of a lifelong enmity; she referred to him as that evil man .     As Austria was short of experienced military commanders, Maria Theresa released ": null
    },
    {
        "Marshall Neipperg": "wilhelm reinhard von neipperg"
    },
    {
        ", who had been imprisoned by her father for his poor performance in the Turkish War. Neipperg took command of the Austrian troops in March. The Austrians suffered a crushing defeat at the ": null
    },
    {
        "Battle of Mollwitz": "battle of mollwitz"
    },
    {
        " in April 42 France drew up a plan to partition Austria between Prussia, Bavaria, Saxony and Spain: Bohemia and ": null
    },
    {
        "Upper Austria": "upper austria"
    },
    {
        " would be ceded to Bavaria, and the Elector would become Emperor, whereas ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        " and ": null
    },
    {
        "Upper Silesia": "upper silesia"
    },
    {
        " would be granted to the ": null
    },
    {
        "Electorate of Saxony": "electorate of saxony"
    },
    {
        ", ": null
    },
    {
        "Lower Silesia": "lower silesia"
    },
    {
        " and ": null
    },
    {
        "Glatz": "kłodzko"
    },
    {
        " to Prussia, and the entire Austrian ": null
    },
    {
        "Lombardy": "duchy of milan"
    },
    {
        " to Spain. ": null
    },
    {
        "Marshall Belle-Isle": "charles louis auguste fouquet, duc de belle-isle"
    },
    {
        " joined Frederick at Olmütz. Vienna was in a panic, as none of Maria Theresas advisors expected France to betray them. Francis Stephen urged Maria Theresa to reach a ": null
    },
    {
        "rapprochement": "rapprochement"
    },
    {
        " with Prussia, as did Great Britain. Maria Theresa reluctantly agreed to negotiations.     Contrary to all expectations, the young Queen gained significant support from Hungary. Her coronation as Queen of Hungary took place in ": null
    },
    {
        "St. Martins Cathedral": "st martins cathedral, bratislava"
    },
    {
        ", ": null
    },
    {
        "Pressburg": "pressburg"
    },
    {
        ", on 42 June 42 She had spent months honing the equestrian skills necessary for the ceremony and negotiating with the ": null
    },
    {
        "Diet": "diet"
    },
    {
        ". To appease those who considered her gender to be a serious obstacle, Maria Theresa assumed masculine titles. Thus, in nomenclature, Maria Theresa was archduke and king; normally, however, she was styled as queen.     By July, attempts at conciliation had completely collapsed. Maria Theresas ally, the Elector of Saxony, now became her enemy, and George  II declared the ": null
    },
    {
        "Electorate of Hanover": "electorate of hanover"
    },
    {
        " to be neutral. Therefore, she needed troops from Hungary in order to support the war effort. Although she had already won the admiration of the Hungarians, the number of volunteers were only in hundreds. Since she required them in thousands or even tens of thousands, she decided to appear before the Hungarian Diet on 42 September 42 while wearing the crown of St Stephen. She began addressing the Diet in ": null
    },
    {
        "Latin": "latin"
    },
    {
        ", and she asserted that the very existence of the Kingdom of Hungary, of our own person and children, and our crown, are at stake. Forsaken by all, we place our sole reliance in the fidelity and long-tried valor of the Hungarians.  The response was rather boorish, with the queen being questioned and even heckled by members of the Diet; someone cried that she better apply to Satan than the Hungarians for help.  However, she managed to show her gift for theatrical displays by holding her son and heir, ": null
    },
    {
        "Joseph": "joseph ii, holy roman emperor"
    },
    {
        ", while weeping, and she dramatically consigned the future king to the defense of the brave Hungarians . This act managed to win the sympathy of the members, and they declared that they would die for Maria Theresa.     In 42 the Austrian authorities informed Maria Theresa that the Bohemian populace would prefer Charles Albert to her as sovereign. Maria Theresa, desperate and burdened by pregnancy, wrote plaintively to her sister: I dont know if a town will remain to me for my delivery.  She bitterly vowed to spare nothing and no one to defend her kingdom when she wrote to the Bohemian chancellor, ": null
    },
    {
        "Count Philip Kinsky": "philip kinsky"
    },
    {
        ": My mind is made up. We must put everything at stake to save Bohemia.  On 42 October, the Elector of Bavaria captured ": null
    },
    {
        "Prague": "prague"
    },
    {
        " and declared himself ": null
    },
    {
        "King of Bohemia": "king of bohemia"
    },
    {
        ". Maria Theresa, then in Hungary, wept on learning of the loss of Bohemia. Charles Albert was unanimously elected Holy Roman Emperor on 42 January 42 which made him the only non-Habsburg to be in that position since 42 The Queen, who regarded the election as a catastrophe, caught her enemies unprepared by insisting on a winter campaign; the same day he was elected emperor, Austrian troops under ": null
    },
    {
        "Ludwig Andreas von Khevenhüller": "ludwig andreas von khevenhüller"
    },
    {
        " captured ": null
    },
    {
        "Munich": "munich"
    },
    {
        ", Charles Alberts capital.        The ": null
    },
    {
        "Treaty of Breslau": "treaty of breslau"
    },
    {
        " of June 42 ended hostilities between Austria and Prussia. With the First Silesian War at an end, the Queen soon made the recovery of Bohemia her priority. French troops fled Bohemia in the winter of the same year. On 42 May 42 Maria Theresa had herself crowned Queen of Bohemia in ": null
    },
    {
        "St. Vitus Cathedral": "st. vitus cathedral"
    },
    {
        ".     Prussia became anxious at Austrian advances on the Rhine frontier, and Frederick again invaded Bohemia, beginning a ": null
    },
    {
        "Second Silesian War": "second silesian war"
    },
    {
        "; Prussian troops sacked Prague in August 42 The French plans fell apart when Charles Albert died in January 42 The French overran the ": null
    },
    {
        "Austrian Netherlands": "austrian netherlands"
    },
    {
        " in May.     Francis Stephen was elected Holy Roman Emperor on 42 September 42 Prussia recognised Francis as emperor, and Maria Theresa once again recognised the loss of Silesia by the ": null
    },
    {
        "Treaty of Dresden": "treaty of dresden"
    },
    {
        " in December 42 ending the Second Silesian War. The wider war dragged on for another three years, with fighting in northern Italy and the Austrian Netherlands; however, the core Habsburg domains of Austria, Hungary and Bohemia remained in Maria Theresas possession. The ": null
    },
    {
        "Treaty of Aachen": "treaty of aix-la-chapelle"
    },
    {
        ", which concluded the eight-year conflict, recognised Prussias possession of Silesia, and Maria Theresa ceded the ": null
    },
    {
        "Duchy of Parma": "duchy of parma"
    },
    {
        " to ": null
    },
    {
        "Philip of Spain": "philip, duke of parma"
    },
    {
        ". France had successfully conquered the Austrian Netherlands, but Louis XV, wishing to prevent potential future wars with Austria, returned them to Maria Theresa.             Frederick of Prussias invasion of Saxony in August 42 began a ": null
    },
    {
        "Third Silesian War": "third silesian war"
    },
    {
        " and sparked the wider ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        ". Maria Theresa and ": null
    },
    {
        "Kaunitz": "wenzel anton, prince of kaunitz-rietberg"
    },
    {
        " wished to exit the war with possession of Silesia. Before the war started, Kaunitz had been sent as an ambassador at Versailles from 4242 to win over the French. Meanwhile, the British still refused to help Maria Theresa in reclaiming Silesia, and Frederick II himself managed to secure the ": null
    },
    {
        "Treaty of Westminster ": "treaty of westminster"
    },
    {
        " with them. Subsequently, Maria Theresa sent ": null
    },
    {
        "Georg Adam, Prince of Starhemberg": "georg adam, prince of starhemberg"
    },
    {
        " to negotiate an agreement with France, and the result was the ": null
    },
    {
        "First Treaty of Versailles": "treaty of versailles"
    },
    {
        " of 42 May 42 Thus, the efforts of Kaunitz and Starhemberg managed to pave a way for a ": null
    },
    {
        "Diplomatic Revolution": "diplomatic revolution"
    },
    {
        "; previously, France was one of Austrias archenemies together with Russia and the Ottoman Empire, but after the agreement, they were united by a common cause to contain Frederick II and British colonial expansion.  However, historians have blamed this treaty for causing the loss of the French colonial empire, since Louis XV was required to deploy troops in Germany and to provide subsidies of 4242 million pounds a year to Maria Theresa that were vital for the Austrian war effort in Bohemia and Silesia.     On 42 May 42 the ": null
    },
    {
        "Second Treaty of Versailles": "treaty of versailles"
    },
    {
        " was signed, whereby Louis XV promised to provide Austria with 42 men in addition to 42 million gulden yearly. They would also continue the war in Continental Europe until Prussia could be compelled to abandon Silesia and Glatz. In return, Austria would cede several towns in the Austrian Netherlands to the son-in-law of Louis XV, ": null
    },
    {
        "Philip of Parma": "philip, duke of parma"
    },
    {
        ", who in turn would grant his Italian duchies to Maria Theresa.     ": null
    },
    {
        "Maximilian von Browne": "maximilian ulysses browne"
    },
    {
        " commanded the Austrian troops. Following the indecisive ": null
    },
    {
        "Battle of Lobositz": "battle of lobositz"
    },
    {
        " in 42 he was replaced by ": null
    },
    {
        "Prince Charles Alexander of Lorraine": "prince charles alexander of lorraine"
    },
    {
        ", Maria Theresas brother-in-law. However, he was appointed only because of his familial relations; he turned out to be an incompetent military leader, and he was later replaced by ": null
    },
    {
        "Leopold Joseph von Daun": "leopold joseph von daun"
    },
    {
        ", ": null
    },
    {
        "Franz Moritz von Lacy": "franz moritz von lacy"
    },
    {
        " and ": null
    },
    {
        "Ernst Gideon von Laudon": "ernst gideon von laudon"
    },
    {
        ". Frederick himself was startled by Lobositz; he eventually re-grouped for another attack in June 42 The ": null
    },
    {
        "Battle of Kolin": "battle of kolin"
    },
    {
        " that followed was a decisive victory for Austria. Frederick lost one third of his troops, and before the battle was over, he had left the scene. Subsequently, Prussia was defeated at ": null
    },
    {
        "Hochkirch": "battle of hochkirch"
    },
    {
        " in Saxony on 42 October 42 at ": null
    },
    {
        "Kunersdorf": "battle of kunersdorf"
    },
    {
        " in Brandenburg on 42 August 42 and at ": null
    },
    {
        "Landeshut": "battle of landeshut"
    },
    {
        " near Glatz in June 42 Hungarian and Croat light hussars led by ": null
    },
    {
        "Count Hadik": "andrás hadik"
    },
    {
        " raided Berlin": "1757 raid on berlin"
    },
    {
        " in 42 Austrian and Russian troops even occupied Berlin for several days in August 42 However, these victories did not enable the Habsburgs to win the war, as the French and Habsburg armies were destroyed by Frederick at ": null
    },
    {
        "Rossbach": "battle of rossbach"
    },
    {
        " in 42 After the defeat in ": null
    },
    {
        "Torgau": "battle of torgau"
    },
    {
        " on 42 November 42 Maria Theresa realised that she could no longer reclaim Silesia without Russian support, which vanished after the death of Tsaritsa Elizabeth in early 42 In the meantime, France was losing badly in America and India, and thus they had reduced their subsidies by 42%. Since 42 Kaunitz had tried to organise a diplomatic congress to take advantage of the accession of ": null
    },
    {
        "George III of the United Kingdom": "george iii of the united kingdom"
    },
    {
        ", as he did not really care about Germany. Finally, the war was concluded by the ": null
    },
    {
        "Treaty of Hubertusburg": "treaty of hubertusburg"
    },
    {
        " and ": null
    },
    {
        "Paris": "treaty of paris"
    },
    {
        " in 42 Austria had to leave the Prussian territories that were occupied. Although Silesia remained under the control of Prussia, a new balance of power was created in Europe, and Austrian position was strengthened by it thanks to its alliance with the Bourbons in Madrid, Parma and Naples. Maria Theresa herself decided to focus on domestic reforms and refrain from undertaking any further military operations.          Like all members of the ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        ", Maria Theresa was a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ", and a devout one. She believed that religious unity was necessary for a peaceful public life and explicitly rejected the idea of ": null
    },
    {
        "religious toleration": "religious toleration"
    },
    {
        ". She even advocated for a state church. and contemporary adversary travelers criticised her regime as bigoted, intolerant and superstitious. However, she never allowed the Church to interfere with what she considered to be prerogatives of a monarch and kept Rome at arms length. She controlled the selection of archbishops, bishops and abbots. Overall, the ecclesiastical policies of Maria Theresa were enacted to ensure the primacy of State control in Church-State relations. She was also influenced by ": null
    },
    {
        "Jansenist": "jansenism"
    },
    {
        " ideas. One of the most important aspects of Jansenism was the advocation of maximum freedom of national churches from Rome. Although Austria had always stressed the rights of the state in relation to the church, Jansenism provided new theoretical justification for this.     Maria Theresa promoted the ": null
    },
    {
        "Greek Catholics": "greek catholic church"
    },
    {
        " and emphasised their equal status with Roman Catholics. Despite the fact that Maria Theresa was a very pious person, she also enacted policies that suppressed exaggerated display of piety, such as the prohibition of public ": null
    },
    {
        "flagellantism": "flagellantism"
    },
    {
        ". Furthermore, she significantly reduced the number of religious holidays and monastic orders.       Her relationship with the ": null
    },
    {
        "Jesuits": "society of jesus"
    },
    {
        " was complex. Members of this order educated her, served as her confessors, and supervised the religious education of her eldest son. The Jesuits were powerful and influential in the early years of Maria Theresas reign. However, the queens ministers convinced her that the order posed a danger to her monarchical authority. Not without much hesitation and regret, she issued a decree that removed them from all the institutions of the monarchy, and carried it out thoroughly. She forbade the publication of ": null
    },
    {
        "Pope Clement XIII": "pope clement xiii"
    },
    {
        "s bull, which was in favour of the Jesuits, and promptly confiscated their property when ": null
    },
    {
        "Pope Clement XIV": "pope clement xiv"
    },
    {
        " suppressed the order.            Though she eventually gave up trying to convert her non-Catholic subjects to Catholicism, Maria Theresa regarded both the ": null
    },
    {
        "Jews": "jews"
    },
    {
        " and ": null
    },
    {
        "Protestants": "protestants"
    },
    {
        " as dangerous to the state and actively tried to suppress them. She was probably the most anti-Jewish monarch of her time, having inherited the traditional prejudices of her ancestors and acquired new ones. This was a product of deep religious devotion and was not kept secret in her time. In 42 she wrote of the Jews: I know of no greater plague than this race, which on account of its deceit, usury and avarice is driving my subjects into beggary. Therefore as far as possible, the Jews are to be kept away and avoided.  Her hatred was so deep that she was willing to tolerate Protestant businessmen and financiers in Vienna, such as the Swiss-born Johann Fries, since she wanted to break free from the Jewish financiers.     In December 42 she proposed to her ministers the expulsion of Jews from Austria and Bohemia. Her first intention was to deport all Jews by 42 January, but having accepted the advice of her ministers, who were concerned by the number of future deportees that could reach 42, had the deadline slipped to June. The expulsion orders were only retracted in 42 due to pressures from other countries, including Great Britain. She also ordered the deportation of around 42 Jews from Prague amid accusations that they were disloyal at the time of the Bavarian-French occupation during the War of the Austrian Succession. The order was then expanded to all Jews of Bohemia and major cities of Moravia, although the order was later backtracked except for Prague Jews that had already been expelled. In addition to this, she exiled Protestants from Austria to ": null
    },
    {
        "Transylvania": "transylvania"
    },
    {
        ", including 42 from ": null
    },
    {
        "Upper Austria": "upper austria"
    },
    {
        " in the 42s. Despite this, practical, demographic and economic considerations prevented her from expelling the Protestants en masse. In 42 she abandoned the idea of expelling ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        "n Protestants after Joseph, who was opposed to her intentions, threatened to abdicate as emperor and co-ruler. Finally, she was forced to grant them some toleration by allowing them to worship privately. Joseph himself regarded his mothers religious policies as unjust, impious, impossible, harmful and ridiculous .     In the third decade of her reign, influenced by her Jewish courtier ": null
    },
    {
        "Abraham Mendel Theben": "abraham mendel theben"
    },
    {
        ", Maria Theresa issued edicts that offered some state protection to her Jewish subjects. Her actions during the late stages of her reign contrast her early opinions. She forbade the forcible conversion of Jewish children to Christianity in 42 and in 42 she forbade Catholic clergy from extracting ": null
    },
    {
        "surplice fees": "surplice fees"
    },
    {
        " from her Jewish subjects. In 42 she ordered the release of those Jews who had been jailed for a ": null
    },
    {
        "blood libel": "blood libel"
    },
    {
        " in the village of Orkuta. Notwithstanding her strong dislike of Jews, Maria Theresa supported Jewish commercial and industrial activity in Austria. There were also parts of the realm where the Jews were treated better, such as ": null
    },
    {
        "Trieste": "trieste"
    },
    {
        ", ": null
    },
    {
        "Gorizia": "gorizia"
    },
    {
        " and ": null
    },
    {
        "Vorarlberg": "vorarlberg"
    },
    {
        ".               Policies of Maria Theresas government towards their ": null
    },
    {
        "Eastern Orthodox": "eastern orthodox"
    },
    {
        " subjects were marked by special interests, relating not only to complex religious situation in various southern and eastern regions of the ": null
    },
    {
        "Habsburg Monarchy": "habsburg monarchy"
    },
    {
        ", inhabited by ": null
    },
    {
        "Eastern Orthodox Christians": "eastern orthodox christians"
    },
    {
        ", mainly ": null
    },
    {
        "Serbs": "serbs"
    },
    {
        " and ": null
    },
    {
        "Romanians": "romanians"
    },
    {
        ", but also regarding the political aspirations of Habsburg court towards several neighbouring lands and regions in Southeastern Europe, still held by the declining ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " and also inhabited by Eastern Orthodox population.     Maria Theresas government confirmed and continued to uphold old privileges, granted to their Eastern Orthodox subjects by previous Habsburg monarchs , but at the same time new reforms were enforced, establishing much firmer state control over the Eastern Orthodox ": null
    },
    {
        "Metropolitanate of Karlovci": "metropolitanate of karlovci"
    },
    {
        ". Those reforms were initiated by royal patents, known as Regulamentum privilegiorum and Regulamentum Illyricae Nationis , and finalized in 42 by the ": null
    },
    {
        "Declaratory Rescript of the Illyrian Nation": "declaratory rescript of the illyrian nation"
    },
    {
        ", a comprehensive document that regulated all major issues relating to religious life of Eastern Orthodox subjects and administration of the Metropolitanate of Karlovci. Maria Theresas Rescript of 42 was kept in force until 42              Maria Theresa was as conservative in matters of state as in those of religion, but implemented significant reforms to strengthen Austrias military and bureaucratic efficiency. She employed ": null
    },
    {
        "Friedrich Wilhelm von Haugwitz": "friedrich wilhelm von haugwitz"
    },
    {
        ", who modernised the empire by creating a standing army of 42  men, paid for with 42  million ": null
    },
    {
        "gulden": "austro-hungarian gulden"
    },
    {
        " extracted from each crown-land. The central government was responsible for the army, although Haugwitz instituted taxation of the nobility, who never before had to pay taxes. Moreover, after Haugwitz was appointed as the head of the new central administrative agency dubbed the Directory  in 42 he initiated a radical centralization of state institutions down to the level of the District Office . Thanks to this effort, by 42 there was a class of government officials numbering around 42. However, Lombardy, the Austrian Netherlands and Hungary were almost completely untouched by this reform. In case of Hungary, she was particularly mindful of her promise that she would respect the privileges in the kingdom, including the immunity of nobles from taxation.     In light of the failure to reclaim Silesia during the Seven Years War, the governing system was once again reformed to strengthen the state. The Directory was transformed into the United Austrian and Bohemian Chancellery in 42 that was equipped with a separate, independent judiciary and separate financial bodies. She also refounded the Hofkamer in 42 which was a ministry of finances that controlled all revenues from the monarchy. In addition to this, there was the Hofrechenskammer or the exchequer which was tasked with the handling of all financial accounts. Meanwhile, in 42 Maria Theresa created the Council of State , composed of the state chancellor, three members of the high nobility and three knights, which served as a committee of experienced people who advised her. The council of state lacked executive or legislative authority, but nevertheless showed the difference between the form of government employed by Frederick II of Prussia. Unlike the latter, Maria Theresa was not an autocrat who acted as her own minister. Prussia would adopt this form of government only after 42     Maria Theresa doubled the state revenue from 42 to 42 million gulden between 42 and 42 though her attempt to tax clergy and nobility was only partially successful. These financial reforms greatly improved the economy. After Kaunitz became the head of the new Staatsrat, he pursued a policy of aristocratic Enlightenment that relied on persuasion to interact with the estates, and he was also willing to retract some of Haugwitzs centralization to curry favour with them. Nonetheless, the governing system remained centralised, and a strong institution made it possible for Kaunitz to increase state revenues substantially. In 42 for the first time ever the Habsburg Monarchy achieved its first balanced budget, and by 42 the Habsburg state revenue had reached 42 million gulden.            After Maria Theresa recruited ": null
    },
    {
        "Gerard van Swieten": "gerard van swieten"
    },
    {
        " from the Netherlands, he also employed a fellow Dutchman named ": null
    },
    {
        "Anton de Haen": "anton de haen"
    },
    {
        ", and de Haen was the actual founder of the Viennese Medicine School . Maria Theresa also banned the creation of new burial grounds without prior government permission, thus countering wasteful and unhygienic burial customs. Meanwhile, her decision to have her children ": null
    },
    {
        "inoculated": "variolation"
    },
    {
        " after the smallpox epidemic of 42 was responsible for changing Austrian physicians negative view of inoculation. Maria Theresa herself inaugurated inoculation in Austria by hosting a dinner for the first sixty-five inoculated children in ": null
    },
    {
        "Schönbrunn Palace": "schönbrunn palace"
    },
    {
        ", waiting on the children herself. In 42 she enacted a strict regulation of the sale of poisons, and apothecaries were obliged to keep a poison register recording the quantity and circumstances of every sale. If someone unknown tried to purchase a poison, that person had to provide two character witnesses before a sale could be effectuated. Three years later, she prohibited the use of lead in any eating or drinking vessels; the only permitted material for this purpose was pure tin.          The centralization of the Habsburg government necessitated the creation of a unified legal system. Previously, various lands in the Habsburg realm had their own laws. These laws were compiled and the resulting Codex Theresianus could be used as a basis for legal unification. In 42 the Constitutio Criminalis Theresiana was published, and this was a codification of the traditional criminal justice system since the Middle Ages. This criminal code allowed the possibility of establishing the truth through torture, and it also criminalised witchcraft and various religious offenses. Although this law came into force in Austria and Bohemia, it was not valid in Hungary.     She was particularly concerned with the sexual morality of her subjects. Thus, she established a Chastity Commission  in 42 to clamp down on prostitution, ": null
    },
    {
        "homosexuality": "homosexuality"
    },
    {
        ", ": null
    },
    {
        "adultery": "adultery"
    },
    {
        " and even sex between members of different religions.  This Commission cooperated closely with the police, and the Commission even employed secret agents to investigate private lives of men and women with bad reputation. They were authorised to raid banquets, clubs, and private gatherings, and to arrest those suspected of violating social norms. The punishments included whipping, deportation, or even the death penalty.     In 42 Austria outlawed torture, particularly at the behest of Joseph II. Much unlike Joseph, but with the support of religious authorities, Maria Theresa was opposed to the abolition of torture. Born and raised between ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        " and ": null
    },
    {
        "Rococo": "rococo"
    },
    {
        " eras, she found it difficult to fit into the intellectual sphere of the ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        ", which is why she only slowly followed humanitarian reforms on the continent.     From an institutional perspective, in 42 she founded the Supreme Judiciary as a court of final appeal for all hereditary lands.       ": null
    },
    {
        "Austrian": "austrian"
    },
    {
        " historian Karl Vocelka observed that the educational reforms enacted by Maria Theresa were really founded on ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        " ideas, although the ulterior motive was still to meet the needs of an absolutist state, as an increasingly sophisticated and complicated society and economy required new administrators, officers, diplomats and specialists in virtually every area.  Previously, the existing primary schools were run by various orders of the Catholic Church. After her reform, compulsory and secular primary schools were established. Maria Theresa herself might have wanted the schools to teach Catholic orthodoxy, but the curriculum focused on social responsibility, social discipline, work ethic and the use of reason rather than mere ": null
    },
    {
        "rote learning": "rote learning"
    },
    {
        ". All children of both genders from the ages of six to twelve were required to attend school. The education reform was met with hostility particularly by peasants who wanted the children to work in the fields instead. Maria Theresa crushed the dissent by ordering the arrest of all those opposed. Overall, although the idea had merit, the reforms were not as successful as they were expected to be; in some parts of Austria, half of the population was illiterate well into the 42th  century.     Maria Theresa permitted non-Catholics to attend university and allowed the introduction of secular subjects , which influenced the decline of ": null
    },
    {
        "theology": "theology"
    },
    {
        " as the main foundation of university education. Furthermore, under her reign, educational institutions were created to prepare officials for work in the state bureaucracy, the ": null
    },
    {
        "Theresianum": "theresianum"
    },
    {
        " was established in Vienna in 42 to educate nobles sons, a military school named the ": null
    },
    {
        "Theresian Military Academy": "theresian military academy"
    },
    {
        " was founded in ": null
    },
    {
        "Wiener Neustadt": "wiener neustadt"
    },
    {
        " in 42 and an ": null
    },
    {
        "Oriental Academy": "diplomatic academy of vienna"
    },
    {
        " for future diplomats was created in 42     In the 42s she established the ": null
    },
    {
        "Theresian Institution of Noble Ladies": "theresian institution of noble ladies"
    },
    {
        " at ": null
    },
    {
        "Prague Castle": "prague castle"
    },
    {
        ", which served as a religious lay order and educational institution for unmarried Austrian and Hungarian noblewomen.        Her regime was also known for institutionalising censorship of publications and learning. English author Sir ": null
    },
    {
        "Nathaniel Wraxall": "nathaniel wraxall"
    },
    {
        " once wrote from Vienna: e injudicious bigotry of the Empress may chiefly be attributed the deficiency It is hardly credible how many books and productions of every species, and in every language, are proscribed by her. Not only ": null
    },
    {
        "Voltaire": "voltaire"
    },
    {
        " and ": null
    },
    {
        "Rousseau": "rousseau"
    },
    {
        " are included in the list, from the immoral tendency or licentious nature of their writings; but many authors whom we consider as unexceptionable or harmless, experience a similar treatment.  The censorship particularly affected works that were deemed to be against the Catholic religion. Ironically, for this purpose, she was aided by Gerard van Swieten who was considered to be an enlightened man.       Maria Theresa endeavoured to increase the living standards of the people, since she could see a causal link between peasant living standards, productivity and state revenue. The Habsburg government under her rule also tried to strengthen its industry through government interventions. After the loss of Silesia, they implemented subsidies and trade barriers to encourage the move of Silesian textile industry to northern Bohemia. In addition, they cut back ": null
    },
    {
        "guild": "guild"
    },
    {
        " privileges, and internal duties on trade were either reformed or removed . Another economic issue that had to be tackled during the reign of Maria Theresa was the regulation of noble privileges vis-à-vis peasant well-being. Although Maria Theresa was initially reluctant to meddle in such affairs, government interventions were made possible by the perceived need for economic power and the emergence of a functioning bureaucracy, and interventions were also further eased by widespread peasant unrest induced by the effects of war and famine in 4242 and noble abuse of manorial rights. In 4242 a series of ": null
    },
    {
        "Robot Patent": "robot patent"
    },
    {
        "s were issued by Maria Theresa, and these patents regulated and restricted peasant labour only in the German and Bohemian parts of the realm. The goal was to ensure that peasants not only could support themselves and their family members, but also help cover the national expenditure in peace or war. However, such reform was fiercely resisted by the Hungarian nobility. Meanwhile, Joseph was hoping for a more radical change, and he himself abolished forced peasant labour during his reign in 42 although this was later retracted by Emperor Leopold II.             Over the course of twenty years, Maria Theresa gave birth to sixteen children, thirteen of whom survived infancy. The first child, ": null
    },
    {
        "Maria Elisabeth": "archduchess maria elisabeth of austria"
    },
    {
        " , was born a little less than a year after the wedding. The childs sex caused great disappointment and so would the births of ": null
    },
    {
        "Maria Anna": "archduchess maria anna of austria"
    },
    {
        ", the eldest surviving child, and ": null
    },
    {
        "Maria Carolina": "archduchess maria carolina of austria"
    },
    {
        " . While fighting to preserve her inheritance, Maria Theresa gave birth to ": null
    },
    {
        "a son": "joseph ii, holy roman emperor"
    },
    {
        " named after ": null
    },
    {
        "Saint Joseph": "saint joseph"
    },
    {
        ", to whom she had repeatedly prayed for a male child during the pregnancy. Maria Theresas favourite child, ": null
    },
    {
        "Maria Christina": "archduchess maria christina, duchess of teschen"
    },
    {
        ", was born on her 42th  birthday, four days before the defeat of the Austrian army in ": null
    },
    {
        "Chotusitz": "battle of chotusitz"
    },
    {
        ". Five more children were born during the war: ": null
    },
    {
        "Maria Elisabeth": "archduchess maria elisabeth of austria"
    },
    {
        ", ": null
    },
    {
        "Charles": "archduke charles joseph of austria"
    },
    {
        ", ": null
    },
    {
        "Maria Amalia": "maria amalia, duchess of parma"
    },
    {
        ", ": null
    },
    {
        "Leopold": "leopold ii, holy roman emperor"
    },
    {
        " and Maria Carolina . During this period, there was no rest for Maria Theresa during pregnancies or around the births; the war and child-bearing were carried on simultaneously. Five children were born during the peace between the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        " and the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        ": ": null
    },
    {
        "Maria Johanna": "archduchess maria johanna gabriela of austria"
    },
    {
        ", ": null
    },
    {
        "Maria Josepha": "archduchess maria josepha of austria"
    },
    {
        ", ": null
    },
    {
        "Maria Carolina": "maria carolina of austria"
    },
    {
        ", ": null
    },
    {
        "Ferdinand": "archduke ferdinand of austria-este"
    },
    {
        " and ": null
    },
    {
        "Maria Antonia": "marie antoinette"
    },
    {
        ". She delivered her last child, ": null
    },
    {
        "Maximilian Francis": "archduke maximilian francis of austria"
    },
    {
        ", during the Seven Years War, aged 42 Maria Theresa asserted that, had she not been almost always pregnant, she would have gone into battle herself.     Maria Theresas mother, Empress Elisabeth Christine, died in 42 Four years later, Maria Theresas governess, Marie Karoline von Fuchs-Mollard, died. She showed her gratitude to Countess Fuchs by having her buried in the ": null
    },
    {
        "Imperial Crypt": "imperial crypt, vienna"
    },
    {
        " along with the members of the imperial family.     Shortly after giving birth to the younger children, Maria Theresa was confronted with the task of marrying off the elder ones. She led the marriage negotiations along with the campaigns of her wars and the duties of state. She used them as pawns in dynastic games and sacrificed their happiness for the benefit of the state. A devoted but self-conscious mother, she wrote to all of her children at least once a week and believed herself entitled to exercise authority over her children regardless of their age and rank.        Following her fiftieth birthday in May 42 Maria Theresa contracted ": null
    },
    {
        "smallpox": "smallpox"
    },
    {
        " from her daughter-in-law, ": null
    },
    {
        "Maria Josepha of Bavaria": "maria josepha of bavaria"
    },
    {
        ". She survived, but the new empress did not. Maria Theresa then forced her daughter, Archduchess Maria Josepha, to pray with her in the ": null
    },
    {
        "Imperial Crypt": "imperial crypt"
    },
    {
        " next to the unsealed tomb of Empress Maria Josepha. The Archduchess started showing smallpox rash two days after visiting the crypt and soon died. Maria Carolina was to replace her as the pre-determined bride of King ": null
    },
    {
        "Ferdinand IV of Naples": "ferdinand i of the two sicilies"
    },
    {
        ". Maria Theresa blamed herself for her daughters death for the rest of her life because, at the time, the concept of an extended incubation period was largely unknown and it was believed that Maria Josepha had caught smallpox from the body of the late empress.     In April 42 Maria Theresas youngest daughter, Maria Antonia, married ": null
    },
    {
        "Louis": "louis xvi of france"
    },
    {
        ", ": null
    },
    {
        "Dauphin of France": "dauphin of france"
    },
    {
        ", by ": null
    },
    {
        "proxy": "proxy marriage"
    },
    {
        " in Vienna. Maria Antonias education was neglected, and when the French showed an interest in her, her mother went about educating her as best she could about the ": null
    },
    {
        "court of Versailles": "palace of versailles"
    },
    {
        " and the French. Maria Theresa kept up a fortnightly correspondence with Maria Antonia, now called ": null
    },
    {
        "Marie Antoinette": "marie antoinette"
    },
    {
        ", in which she often reproached her for laziness and frivolity and scolded her for failing to conceive a child.     Maria Theresa was not just critical of Marie Antoinette. She disliked Leopolds reserve and often blamed him for being cold. She criticised Maria Carolina for her political activities, Ferdinand for his lack of organisation, and Maria Amalia for her poor ": null
    },
    {
        "French": "french language"
    },
    {
        " and haughtiness. The only child she did not constantly scold was Maria Christina, who enjoyed her mothers complete confidence, though she failed to please her mother in one aspect – she did not produce any surviving children.     One of Maria Theresas greatest wishes was to have as many grandchildren as possible, but she had only about two dozen at the time of her death, of which all the eldest surviving daughters were named after her, with the exception of ": null
    },
    {
        "Princess Carolina of Parma": "princess carolina of parma"
    },
    {
        ", her eldest granddaughter by Maria Amalia.            Emperor Francis died on 42 August 42 while he and the court were in ": null
    },
    {
        "Innsbruck": "innsbruck"
    },
    {
        " celebrating the wedding of his second son, Leopold. Maria Theresa was devastated. Their eldest son, Joseph, became Holy Roman Emperor. Maria Theresa abandoned all ornamentation, had her hair cut short, painted her rooms black and dressed in mourning for the rest of her life. She completely withdrew from court life, public events, and theater. Throughout her widowhood, she spent the whole of August and the eighteenth of each month alone in her chamber, which negatively affected her mental health. She described her state of mind shortly after Franciss death: I hardly know myself now, for I have become like an animal with no true life or reasoning power.      Upon his accession to the imperial throne, Joseph ruled less land than his father had in 42 since he had given up his rights over Tuscany to Leopold, and thus he only controlled ": null
    },
    {
        "Falkenstein": "falkenstein, rhineland-palatinate"
    },
    {
        " and ": null
    },
    {
        "Teschen": "duchy of teschen"
    },
    {
        ". Believing that the emperor must possess enough land to maintain his standing as emperor, Maria Theresa, who was used to being assisted in the administration of her vast realms, declared Joseph to be her new co-ruler on 42 September 42 From then on, mother and son had frequent ideological disagreements. The 42  million gulden that Joseph inherited from his father was injected into the treasury. Maria Theresa had another loss in February 42 when Haugwitz died. She gave her son absolute control over the military following the death of ": null
    },
    {
        "Leopold Joseph von Daun": "leopold joseph von daun"
    },
    {
        ".     According to Austrian historian Robert A. Kann, Maria Theresa was a monarch of above-average qualifications but intellectually inferior to Joseph and Leopold. Kann asserts that she nevertheless possessed qualities appreciated in a monarch: warm heart, practical mind, firm determination and sound perception. Most importantly, she was ready to recognise the mental superiority of some of her advisers and to give way to a superior mind while enjoying support of her ministers even if their ideas differed from her own. Joseph, however, was never able to establish rapport with the same advisers, even though their philosophy of government was closer to Josephs than to Maria Theresas.        The relationship between Maria Theresa and Joseph was not without warmth but was complicated and their personalities clashed. Despite his intellect, Maria Theresas force of personality often made Joseph cower. Sometimes, she openly admired his talents and achievements, but she was also not hesitant to rebuke him. She even wrote: We never see each other except at dinner ... His temper gets worse every day ... Please burn this letter ... I just try to avoid public scandal. In another letter, also addressed to Josephs companion, she complained: He avoids me ... I am the only person in his way and so I am an obstruction and a burden ... Abdication alone can remedy matters. After much contemplation, she chose not to abdicate. Joseph himself often threatened to resign as co-regent and emperor, but he, too, was induced not to do so. Her threats of abdication were rarely taken seriously; Maria Theresa believed that her recovery from smallpox in 42 was a sign that God wished her to reign until death. It was in Josephs interest that she remained sovereign, for he often blamed her for his failures and thus avoided taking on the responsibilities of a monarch.     Joseph and Prince Kaunitz arranged the First Partition of Poland despite Maria Theresas protestations. Her sense of justice pushed her to reject the idea of partition, which would hurt the Polish people . She even once argued, What right have we to rob an innocent nation that it has hitherto been our boast to protect and support? The duo argued that it was too late to abort now. Besides, Maria Theresa herself agreed with the partition when she realised that Frederick II of Prussia and Catherine II of Russia would do it with or without Austrian participation. Maria Theresa claimed and eventually took Galicia and Lodomeria ; in the words of Frederick, the more she cried, the more she took .     A few years after the partition, Russia defeated the Ottoman Empire in the Russo-Turkish War . Following the signing of the Treaty of Küçük Kaynarca in 42 that concluded the war, Austria entered into negotiations with the Sublime Porte . Thus, in 42 the Ottoman Empire ceded the northwestern part of Moldavia to Austria. Subsequently, on 42 December 42 Maximilian III Joseph, Elector of Bavaria died without leaving any children. As a result, his territories were coveted by ambitious men, including Joseph, who tried to swap Bavaria for the Austrian Netherlands. This alarmed Frederick II of Prussia, and thus the War of Bavarian Succession erupted in 42 Maria Theresa very unwillingly consented to the occupation of Bavaria, and a year later she made peace proposals to Frederick II despite Josephs objections. Although Austria managed to gain the Innviertel area, this Potato War caused a setback to the financial improvement that the Habsburg had made. The 42 gulden in annual revenue from 42 inhabitants of Innviertel were not comparable to the 42,42 gulden that were spent during the war.       thu   It is unlikely that Maria Theresa ever completely recovered from the smallpox attack in 42 as 42th-century writers asserted. She suffered from shortness of breath , fatigue , cough , distress, necrophobia and insomnia . She later developed edema .     Maria Theresa fell ill on 42 November 42 Her physician Dr. Störk thought her condition serious, although Joseph was confident that she would recover in no time. By 42 November, she asked for the last rites , and on 42 November, the doctor told her that the time had come. On 42 November, she died surrounded by her remaining children. Her longtime rival Frederick the Great , on hearing of her death, said that she had honored her throne and her sex, and though he had fought against her in three wars, he never considered her his enemy. With her death, the House of Habsburg died out and was replaced by the House of Habsburg-Lorraine . Joseph, already co-sovereign of the Habsburg dominions, succeeded her, and introduced sweeping reforms in the empire; Joseph II produced nearly 42 edicts per year , whereas Maria Theresa only issued about 42 edicts annually.     Maria Theresa understood the importance of her public persona": null
    }
]