[
    {
        "   Marie of France was a French princess and Countess consort of Champagne. She was regent of the county of Champagne in 4242 and in 4242     She was the elder daughter of King ": null
    },
    {
        "Louis VII of France": "louis vii of france"
    },
    {
        " and Duchess ": null
    },
    {
        "Eleanor of Aquitaine": "eleanor of aquitaine"
    },
    {
        ". Her parents marriage was annulled in 42 and custody of Marie and her sister, ": null
    },
    {
        "Alix": "alix of france"
    },
    {
        ", was awarded to their father. Both Louis and Eleanor remarried quickly, with Eleanor becoming Queen of England as the spouse of ": null
    },
    {
        "King Henry II": "henry ii of england"
    },
    {
        ". Marie had numerous half-siblings, including kings ": null
    },
    {
        "Philip II of France": "philip ii of france"
    },
    {
        " and ": null
    },
    {
        "John": "john, king of england"
    },
    {
        " and ": null
    },
    {
        "Richard I of England": "richard i of england"
    },
    {
        ".         In 42 when Louis married ": null
    },
    {
        "Adele of Champagne": "adele of champagne"
    },
    {
        ", he betrothed Marie and Alix to Adeles brothers. After her betrothal, Marie was sent to the abbey of ": null
    },
    {
        "Avenay": "avenay"
    },
    {
        " in ": null
    },
    {
        "Champagne": "champagne"
    },
    {
        " for her education. In 42 Marie married ": null
    },
    {
        "Henry I, Count of Champagne": "henry i, count of champagne"
    },
    {
        ". They had four children:   ": null
    },
    {
        "Henry II of Champagne": "henry ii of champagne"
    },
    {
        "   Scholastique of Champagne": "scholastique of champagne"
    },
    {
        " , married William IV of Macon   ": null
    },
    {
        "Marie of Champagne": "marie of champagne"
    },
    {
        " , married ": null
    },
    {
        "Baldwin I of Constantinople": "baldwin i of constantinople"
    },
    {
        " Theobald III of Champagne": "theobald iii of champagne"
    },
    {
        "         Marie was left as regent for Champagne when Henry I went on pilgrimage to the Holy Land from 42 until 42 While her husband was away, Maries father died and her half-brother, Philip, became king. He confiscated his mothers dower lands and married ": null
    },
    {
        "Isabelle of Hainaut": "isabelle of hainaut"
    },
    {
        ", who was previously betrothed to Maries eldest son. This prompted Marie to join a party of disgruntled nobles—including Queen Adele and the ": null
    },
    {
        "archbishop of Reims": "william of the white hands"
    },
    {
        "—in plotting against Philip. Eventually, relations between Marie and her royal brother improved. Her husband died soon after his return from the Holy Land.     Now a widow with four young children, Marie considered marrying ": null
    },
    {
        "Philip of Flanders": "philip i, count of flanders"
    },
    {
        ", but the engagement was broken off suddenly for unknown reasons. Marie resumed regency when her son also went on Crusade, governing Champagne from 42 to Henrys death in 42       Marie retired to the nunnery of Châuteau de Fontaines-les-Nonnes near Meaux, and died there in 42 She was buried in ": null
    },
    {
        "Meaux Cathedral": "meaux cathedral"
    },
    {
        ".     On 42 June 42 the ": null
    },
    {
        "Huguenots": "huguenots"
    },
    {
        " took over the town of Meaux and devastated many edifices, including the Cathedral. Backed up by Parisian refugees, the Huguenots of the Meaux region called a meeting in the market district and chose a leader, Louis de Meaux, seigneur de la Ramée. They took the keys to the town, put guards at the gates, and then made for the Cathedral. They attacked the sculpted stone decorations and liturgical furniture; it was on this occasion that the tomb of Marie de Champagne, in the choir, was destroyed.     Marie was also a patron of literature, including ": null
    },
    {
        "Andreas Capellanus": "andreas capellanus"
    },
    {
        ", who served in her court, and ": null
    },
    {
        "Chrétien de Troyes": "chrétien de troyes"
    },
    {
        ". She was literate in French and Latin, and maintained her own library. A deep affection existed between Marie and her half-brother ": null
    },
    {
        "King Richard": "richard i of england"
    },
    {
        ", and his celebrated poem Ja nuns hons pris, lamenting his captivity in Austria, was dedicated to her.        Eleanor of Aquitaine: Lord and Lady, 42   Evergates, Theodore. Aristocratic Women in Medieval France, 42                                     ": null
    }
]