[
    {
        "      Marisol Malaret Contreras is a ": null
    },
    {
        "Puerto Rican": "puerto rican people"
    },
    {
        " TV Host, model and beauty queen. She was the very first ": null
    },
    {
        "Puerto Rican": "puerto rican people"
    },
    {
        " woman to be crowned ": null
    },
    {
        "Miss Universe": "miss universe"
    },
    {
        ".       She started to work from an early age due to the death of her father and chronic illness of her mother. She was reportedly persuaded by Puerto Rican make-up artist Carmen Andino to compete in the Miss Puerto Rico pageant, then owned by Puerto Rican modeling guru and businesswoman ": null
    },
    {
        "Anna Santisteban": "anna santisteban"
    },
    {
        ". Malarets strong will, impeccable ethics and stunning beauty made her a crowd favorite in the local contest. Before winning, she worked as an executive secretary in the Puerto Rico Telephone Company.     She has one brother, Jesús and five half-siblings, Joseph, Alicia, Rita, Antonio, and Raul. Her parents are Lydia Contreras and José Antonio Malaret.     She has been married three times. First to former male model Butch James. The second, to musician Corky Stroman, with whom she has her only child, daughter, Sasha. The third to Cuban-born engineer Frank Cué.       The auburn-haired, blue-green eyed Malaret won the title on July 42 42 at the ": null
    },
    {
        "Miami Beach Auditorium": "miami beach auditorium"
    },
    {
        " in ": null
    },
    {
        "Miami Beach, Florida": "miami beach, florida"
    },
    {
        ".     Due to her win in the Miss Universe pageant, she was honored with what was considered until then one of the biggest welcomings ever at ": null
    },
    {
        "San Juan": "san juan, puerto rico"
    },
    {
        "s ": null
    },
    {
        "Luis Muñoz Marín International Airport": "luis muñoz marín international airport"
    },
    {
        ", then known as Isla Verde International Airport.     Malarets face has graced the covers of countless international and Puerto Rican entertainment and gossip magazines, such as ": null
    },
    {
        "Vea": "vea"
    },
    {
        ", ": null
    },
    {
        "Teve Guía": "teve guía"
    }
]