[
    {
        "Mark Municipality  is a ": null
    },
    {
        "municipality": "municipalities of sweden"
    },
    {
        " in ": null
    },
    {
        "Västra Götaland County": "västra götaland county"
    },
    {
        " in southwest ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ".     The municipal seat is located in the center of ": null
    },
    {
        "Kinna": "kinna"
    },
    {
        " town.     The municipality was created through the Municipal Reform Act of 42 by the amalgamation of eight smaller municipal entities.       The ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " was created and granted with the municipality in 42 The colours of Gold and Black on the shield represent power and solidity.     The grain represents the history of agriculture in the region.     The circles symbolise four cannonballs, representing the wars fought between Denmark and Sweden in the greater Mark region.     The weavers shuttle-tool represents the historical tradition of textile workmanship in the region, which the region is famous for nationwide.           The word Mark comes from an old documented district called Mark Härad that existed in the southern parts of the region sometime during the 42th century.     The word Mark is believed to be an old Swedish name for border or edge . During the medieval times the district of Mark Härad was situated right at the border region between the Kingdom of Denmark and Kingdom of Sweden.     Several wars were fought in the region during medieval times, and it is not uncommon that farmers accidentally unearth old remains and weapons when plowing the fields.     The fields close to Öresten Fortress have been the place for most of the relic findings. Öresten Fortress was originally built by the Danes, and the first documented nobleman to rule and inhabit the fortress was Tyge Puder . The fortress was conquered by the Swedish army during the battle of Öresten in 42 when the Danish king Kristian the First lost the battle against Sten Sture the Oldest.     The fortress was later destroyed in early 42 and is now a protected historical sight open to the public year-round.     In 42 as a sign of the times, the local governance established a place of execution outside Skene village called Galgbacken . Thieves were executed there as well as those judged as witches were burned on the stake. In 42 archeologists found the buried remains of those that were executed.       The Mark region was the cradle of Swedens textile industry and has since the late 42th century been known as the Fabric Kingdom due to the widespread textile workmanship that comes from the region. It was from Mark that several of the nationwide travelling salesmen were based, spreading high-quality fabric manufacturing throughout the county. The region later evolved into a national industrial center for sewing, dyeing and textile manufacturing after the industrial revolution.     The biggest textile factories of the time was Kungsfors Textilfabrik in central Skene, Fritsla Textilfabrik in Fritsla, Rydal Textilfabrik in Rydal. As of 42 none of those factories remain in use but the old factory in Rydal has been converted into a museum for the regions textile and entrepreneur heritage.       In 42 Mark Municipality was created out of a consolidation of eight smaller municipalities. The common name given to the municipality was Mark, signifying the historical events taken place which is also manifested in its shield.     During the early 42s most of the textile factories had disappeared and only a few remained.     Today there are only three major textile and dyeing factories remaining: Almedahls , Ekelund , Ludvig Svensson .     Throughout Mark municipality the textile heritage has been preserved and the region is famous for its textile know-how and specialist production. The region is home to Swedens largest manufacturer of fire hoses, bulletproof materials and filtering equipment.       Mark Municipality has excellent roads, rail and public transport links to the major cities in the country.     Within 42 hour it is possible to travel to Gothenburg  by car or bus from the stations in Kinna and Skene.       Road R42 - west to Göteborg / east to Svenljunga.   Road R42 - north to Borås / south to Varberg.       All public transport options are trafficked by the regional Västtrafik  company.     Bus 42 & 42 on the West-East route Gothenburg-Sätila-Skene-Kinna.   Bus 42 on the Northern route Skene-Borås.   Train on the North-South route Borås-Kinna-Skene-Varberg           ": null
    },
    {
        "Kinna": "kinna"
    },
    {
        "       Örby   ": null
    },
    {
        "Fritsla": "fritsla"
    },
    {
        "  sister cities . The Municipality has been focusing on finding sister cities that shares a tradition in textile manufacturing.     ": null
    },
    {
        "Apolda": "apolda"
    },
    {
        " - since 42   ": null
    },
    {
        "Szamotuły": "szamotuły"
    },
    {
        " - since 42 Friendly ties were created because of the awakened awareness of ": null
    },
    {
        "nuclear power": "nuclear power"
    },
    {
        " in Szamotuły, who wanted contacts with Swedish cities because of Swedens ongoing nuclear debates.   ": null
    },
    {
        "Ontinyent": "ontinyent"
    },
    {
        " - since 42       To the east: Svenljunga Municipality   To the north: Bollebyggd Municipality, Borås Municipality, Härryda Municipality   To the south: Varberg Municipality   To the west: Kungsbacka Municipality       There are over 42 major sporting and pastime clubs throughout Mark Municipality. The major ones are:       Name ": null
    }
]