[
    {
        "   The Mars trilogy is a series of ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novels by ": null
    },
    {
        "Kim Stanley Robinson": "kim stanley robinson"
    },
    {
        " that chronicles the settlement and ": null
    },
    {
        "terraforming of the planet Mars": "terraforming of mars"
    },
    {
        " through the personal and detailed viewpoints of a wide variety of characters spanning almost two centuries. Ultimately more ": null
    },
    {
        "utopia": "utopia"
    },
    {
        "n than ": null
    },
    {
        "dystopia": "dystopia"
    },
    {
        "n, the story focuses on ": null
    },
    {
        "egalitarian": "egalitarianism"
    },
    {
        ", sociological, and scientific advances made on ": null
    },
    {
        "Mars": "mars"
    },
    {
        ", while ": null
    },
    {
        "Earth": "earth"
    },
    {
        " suffers from ": null
    },
    {
        "overpopulation": "human overpopulation"
    },
    {
        " and ": null
    },
    {
        "ecological disaster": "ecological disaster"
    },
    {
        ".     The three novels are Red Mars , Green Mars , and Blue Mars . The Martians is a collection of short stories set in the same ": null
    },
    {
        "fictional universe": "fictional universe"
    },
    {
        ". Red Mars won the ": null
    },
    {
        "BSFA Award": "bsfa award"
    },
    {
        " in 42 and ": null
    },
    {
        "Nebula Award for Best Novel": "nebula award for best novel"
    },
    {
        " in 42 Green Mars won the ": null
    },
    {
        "Hugo Award for Best Novel": "hugo award for best novel"
    },
    {
        " and ": null
    },
    {
        "Locus Award for Best Science Fiction Novel": "locus award for best science fiction novel"
    },
    {
        " in 42 Blue Mars also won the Hugo and Locus Awards in 42      Icehenge  , Robinsons first novel about Mars, is not set in this universe but deals with similar themes and plot elements. The trilogy shares some similarities with Robinsons more recent novel  42  , for instance, the terraforming of Mars and the extreme longevity of the characters in both novels.            Red Mars  – Colonization    Red Mars starts in 42 with the first colonial voyage to Mars aboard the Ares, the largest interplanetary spacecraft ever built and home to a crew who are to be the first hundred Martian colonists. The ship was built from clustered ": null
    },
    {
        "space shuttle external fuel tanks": "space shuttle external tank"
    },
    {
        " which, instead of reentering Earths atmosphere, had been boosted into orbit until enough had been amassed to build the ship. The mission is a joint American–Russian undertaking, and seventy of the First Hundred are drawn from these countries . The book details the trip out, construction of the first settlement on Mars by Russian engineer Nadia Cherneshevsky, as well as establishing colonies on Mars hollowed out asteroid-moon ": null
    },
    {
        "Phobos": "phobos"
    },
    {
        ", the ever-changing relationships between the colonists, debates among the colonists regarding both the ": null
    },
    {
        "terraforming": "terraforming"
    },
    {
        " of the planet and its future relationship to Earth. The two extreme views on terraforming are personified by Saxifrage Sax Russell, who believes their very presence on the planet means some level of terraforming has already begun and that it is humanitys obligation to spread life as it is the most scarce thing in the known universe, and Ann Clayborne, who stakes out the position that humankind does not have the right to change entire planets at their will.     Russells view is initially purely scientific but in time comes to blend with the views of Hiroko Ai, the chief of the Agricultural Team who assembles a new belief system devoted to the appreciation and furthering of life ; these views are collectively known as the Green position, while Claybornes naturalist stance comes to be known as Red. The actual decision is left to the United Nations Organization of Mars Affairs , which greenlights terraforming, and a series of actions get underway, including the drilling of ": null
    },
    {
        "mohole": "mohole"
    },
    {
        "s to release subsurface heat; thickening of the atmosphere according to a complicated bio-chemical formula that comes to be known as the Russell cocktail after Sax Russell; and the detonation of nuclear explosions deep in the sub-surface ": null
    },
    {
        "permafrost": "permafrost"
    },
    {
        " to release water. Additional steps are taken to connect Mars more closely with Earth, including the insertion of an Areosynchronous asteroid ": null
    },
    {
        "Clarke": "4923 clarke"
    },
    {
        " to which a ": null
    },
    {
        "space elevator": "space elevator"
    },
    {
        " cable is tethered.     Against the backdrop of this development is another debate, one whose principal instigator is Arkady Bogdanov of the Russian contingent . Bogdanov argues that Mars need not and should not be subject to Earth traditions, limitations, or authority. He is to some extent joined in this position by John Boone, famous as the First Man on Mars from a preceding expedition and rival to Frank Chalmers, the technical leader of the American contingent. Their rivalry is further exacerbated by competing romantic interest in Maya Katarina Toitovna, the leader of the Russian contingent.     ": null
    },
    {
        "Earth": "earth"
    },
    {
        " meanwhile increasingly falls under the control of ": null
    },
    {
        "transnational corporation": "transnational corporation"
    },
    {
        "s that come to dominate its governments, particularly smaller nations adopted as flags of convenience for extending their influence into Martian affairs. As UNOMAs power erodes, the Mars treaty is renegotiated in a move led by Frank Chalmers; the outcome is impressive but proves short-lived as the transnats find ways around it through loop-holes. Things get worse as the nations of Earth start to clash over limited resources, expanding debt, and population growth as well as restrictions on access to a new longevity treatment developed by Martian science—one that holds the promise of lifespans into the hundreds of years. In 42 with Boone dead and exploding immigration threatening the fabric of Martian society, Bogdanov launches a revolution against what many now view as occupying transnat troops operating only loosely under an UNOMA rubber-stamp approval. Initially successful, the revolution proves infeasible on the basis of both a greater-than-expected willingness of the Earth troops to use violence and the extreme vulnerability of life on a planet without a habitable atmosphere. A series of exchanges sees the cutting of the space elevator, bombardment of several Martian cities , the destruction of Phobos and its military complex, and the unleashing of a great flood of torrential groundwater freed by nuclear detonations.     By the end, most of the First Hundred are dead, and virtually all who remain have fled to a hidden refuge established years earlier by Ai and her followers. The revolution dies and life on Mars returns to a sense of stability under heavy transnat control. The clash over resources on Earth breaks out into a full-blown ": null
    },
    {
        "world war": "world war"
    },
    {
        " leaving hundreds of millions dead, but cease-fire arrangements are reached when the transnats flee to the safety of the developed nations, which use their huge militaries to restore order, forming ": null
    },
    {
        "police-states": "police state"
    },
    {
        ". But a new generation of humans born on Mars holds the promise of change. In the meantime, the remaining First Hundred —including Russell, Clayborne, Toitovna, and Cherneshevsky— settle into life in Hiroko Ais refuge called Zygote, hidden under the ": null
    },
    {
        "Martian south pole": "planum australe"
    },
    {
        ".     Green Mars  – Terraforming    Green Mars takes its title from the stage of terraforming that has allowed plants to grow. It picks up the story 42 years after the events of Red Mars in the dawn of the 42nd century, following the lives of the remaining First Hundred and their children and grandchildren. Hiroko Ais base under the south pole is attacked by UN Transitional Authority forces, and the survivors are forced to escape into a underground organization known as the Demimonde. Among the expanded group are the First Hundreds children, the ": null
    },
    {
        "Nisei": "nisei"
    },
    {
        ", a number of whom live in Hirokos second secret base, Gamete.     As unrest in the multinational control over Marss affairs grows, various groups start to form with different aims and methods. Watching these groups evolve from Earth, the CEO of the Praxis Corporation sends a representative, Arthur Randolph, to organize the resistance movements. This culminates into the Dorsa Brevia agreement, in which nearly all the underground factions take part. Preparations are made for a second revolution beginning in the 42s, from converting moholes to missiles silos or hidden bases, sabotaging orbital mirrors, to propelling Deimos out of Mars gravity well and out into deep space so it could never be used as a weapons platform as Phobos was.     The book follows the characters across the Martian landscape, which is explained in detail. Russells character infiltrates the transnat terraforming project, with a carefully crafted fake identity as Stephen Lindholm. The newly evolving Martian biosphere is described at great length and with more profound changes mostly aimed at warming up the surface of Mars to the brink of making it habitable, from continent-sized ": null
    },
    {
        "orbital mirrors": "space mirror"
    },
    {
        ", another space elevator built , to melting the northern polar ice cap, and digging moholes deep enough to form ": null
    },
    {
        "volcanoes": "volcanoes"
    },
    {
        ". A mainstay of the novel is a detailed analysis of philosophical, political, personal, economic, and geological experiences of the characters. The story weaves back and forth from character to character, providing a picture of Mars as seen by them.     Sax, alias Stephen, eventually becomes romantically involved with Phyllis, who had survived the events of 42 from the end of the first novel, but she discovers his true identity and has him arrested. Members of the underground launch a daring rescue from the prison facility where Sax suffers torture and interrogation that causes him to have a stroke; Maya kills Phyllis in the process of the rescue.     The book ends on a major event which is a sudden catastrophic rise in Earths global sea levels not caused primarily by any ": null
    },
    {
        "greenhouse effect": "greenhouse effect"
    },
    {
        " but by the eruption of a chain of ": null
    },
    {
        "volcano": "volcano"
    },
    {
        "es underneath the ice of West ": null
    },
    {
        "Antarctica": "antarctica"
    },
    {
        ", disintegrating the ice sheet and displacing the fragments into the ocean. The resultant flooding causes global chaos on Earth, creating the perfect moment for the Martian underground to seize control of Martian society from Earth. Following a series of largely bloodless coups, an extremist faction of Reds bombs a dam near Burroughs, the major city where the remaining United Nations forces have concentrated, in order to force the security forces to evacuate. The entire city is flooded and the population of the city has to walk a staggeringly long distance in the open Martian atmosphere to Libya Station, in order to resettle in other locations. With this, control of Mars is finally wrested away from Earth with minimal loss of life, leaving the weary survivors hopeful about the prospects of their newfound political autonomy.     Blue Mars  – Long-term results    Blue Mars takes its title from the stage of terraforming that has allowed atmospheric pressure and temperature to increase so that liquid water can exist on the planets surface, forming rivers and seas. It follows closely in time from the end of Green Mars and has a much wider scope than the previous two books, covering an entire century after the second revolution. As Earth is heavily flooded by the sudden melting of the Antarctic ice cap, the once mighty metanats are brought to their knees; as the Praxis Corporation paves a new way of democratic businesses . Mars becomes the Head of the system, giving universal healthcare, free education, and an abundance of food. However, this sparks illegal immigration from Earth, so to ease the population strain on the Blue Planet, Martian scientists and engineers are soon put to the task of creating asteroid cities; where small planetoids of the ": null
    },
    {
        "Belt": "asteroid belt"
    },
    {
        " are hollowed out, given a ": null
    },
    {
        "spin to produce gravity": "centrifugal force"
    },
    {
        ", and a mini-sun is created to produce light and heat.     With a vast increase in sciences, technologies, and spacecraft manufacturing, this begins the Accelerando ; where humankind spreads its civilization throughout the Solar System, and eventually beyond. As Venus, the ": null
    },
    {
        "Jovian moons": "moons of jupiter"
    },
    {
        ", the ": null
    },
    {
        "Saturnian moons": "moons of saturn"
    },
    {
        ", and eventually ": null
    },
    {
        "Triton": "triton"
    },
    {
        " are colonized and terraformed in some way, Jackie Boone takes an interstellar vessel to another star system twenty ": null
    },
    {
        "light-year": "light-year"
    },
    {
        "s away, where they will start to terraform the planets and moons found there.     The remaining First Hundred are generally regarded as living legends. Reports of Hirokos survival are numerous, and purported sightings occur all over the colonized solar system, but none are substantiated. Nadia and Art Randolph lead a constitutional congress in which a global system of government is established that leaves most cities and settlements generally autonomous, but subject to a central representative legislature and two systems of courts, one legal and the other environmental. The environmental court is packed with members of the Red faction as a concession . Vlad, Marina, and Ursula, the original inventors of the longevity treatments, introduce a new economic system that is a hybrid of capitalism, socialism, and environmental conservationism. During a trip to Earth occurring alongside the congress, Nirgal , Maya, and Sax negotiate an agreement that allows Earth to send a number of migrants equal to 42% of Mars population to Mars every year. Following the adoption of the new constitution, Nadia is elected the first president of Mars and serves competently, although she does not enjoy politics. She and Art work together closely, and eventually fall in love and have a child.     Sax Russell devotes himself to various scientific projects, all the while continuing to recover from the effects of his stroke. Since the second revolution, he feels enormous guilt that his pro-terraforming position became the dominant one at the expense of the goals of Anns anti-terraforming stance, as Sax and Ann have come to be regarded as the original champions of their respective positions. Sax becomes increasingly preoccupied with seeking forgiveness and approval from Ann, while Ann, depressed and bitter from her many political and personal losses, is suicidal and refuses to accept any more longevity treatments. However, when Sax witnesses Ann collapse into a coma during an attempt to demonstrate to her the beauty of the terraformed world, he arranges for her to be resuscitated and to be treated with the longevity treatment, both against her will.     The longevity treatments themselves begin to show weaknesses once those receiving them reach the two-century mark in age. The treatments reduce most aging processes to a negligible rate, but are much less effective when it comes to brain function, and in particular memory. Maya in particular suffers extreme lapses in memory, although she remains high functioning most of the time. Further, as people age, they begin to show susceptibility to strange, fatal conditions which have no apparent explanation and are resistant to any treatment. Most common is the event that comes to be known as the quick decline , where a person of extremely advanced age and in apparently good health suffers a sudden fatal heart arrythmia and dies abruptly. The exact mechanism is never explained. Michel dies of the quick decline, while attending the wake of another First Hundred member. Russell speculates that Michels quick decline was brought on by the shock of seeing Maya fail to remember Frank Chalmers upon looking at a treasured photo of him on her refrigerator. As a result of this and Russells own problems with memory, he organizes a team of scientists to develop medicine that will restore memory. The remaining members of the First Hundred, of which there are only 42 congregate in Underhill, and take the medicine. It works so well that Russell remembers his own birth. He and Ann Clayborne finally recall that they had been in love prior to leaving Earth the very first time, but both had been too socially inept and nervous about their chances for selection for the Mars voyage to reveal this to each other. Their famous argument over terraforming had been a mere continuation of a running conversation they had been having since they still lived on Earth. Through the memory treatment it is also revealed that Phyllis had been lobbying to free Sax from his torturers when she was murdered by Maya. Maya herself declines the treatment. Sax also distinctly recalls Hiroko assisting him in finding his rover in a storm before he nearly froze to death before disappearing once again and is convinced she remains alive, although the question of whether she is actually alive is never resolved.     Eventually, the anti-immigration factions of the Martian government provoke massive illegal immigration from Earth, risking another war; however, under the leadership of Ann and Sax, who have fallen in love again following their reconciliation, along with Maya, the Martian population unites to reconstitute the government to accept more immigration from Earth, diffusing the imminent conflict and ushering in a new golden age of harmony and security on Mars.     The Martians  – Short stories    The Martians is a collection of ": null
    },
    {
        "short stories": "short story"
    },
    {
        " that takes place over the timespan of the original trilogy of novels, as well as some stories that take place in an alternate version of the novels where the First Hundreds mission was one of exploration rather than colonization. Buried in the stories are several hints about the eventual fate of the Martian terraforming program.   Michel in Antarctica   Exploring Fossil Canyon    The Archaeae Plot   The Way the Land Spoke to Us   Maya and Desmond   Four Teleological Trails   Coyote Makes Trouble   Michel in Provence   Green Mars  Discovering Life    Arthur Sternbach Brings the Curveball to Mars   Salt and Fresh   The Constitution of Mars   Some Work Notes and Commentary on the Constitution by Charlotte Dorsa Brevia   Jackie on Zo   Keeping the Flame   Saving Noctis Dam   Big Man in Love   An Argument for the Deployment of All Safe Terraforming Technologies   Selected Abstracts from The Journal of Areological Studies   Odessa   Sexual Dimorphism    Enough Is as Good as a Feast   What Matters   Coyote Remembers   Sax Moments   A Martian Romance    If Wang Wei Lived on Mars and Other Poems inc The Names of the Canals , The Soundtrack   Purple Mars           Trans-national Corporations, nicknamed transnats , are extremely powerful multinational corporations that first emerge in the mid42st century. Robinson tracks the evolution of the transnats into what he terms metanats . These multinational corporations have grown so large as a result of ": null
    },
    {
        "globalization": "globalization"
    },
    {
        " that they have sufficient economic power to take over or strongly manipulate national governments, initially only relatively small ": null
    },
    {
        "third-world": "third world"
    },
    {
        " governments, but later, larger developed governments too, effectively running whole countries. In Robinsons ": null
    },
    {
        "future history": "future history"
    },
    {
        ", the metanational corporations become similar to ": null
    },
    {
        "nation-state": "nation-state"
    },
    {
        "s in some respects, while continually attempting to take over competitors in order to become the sole controller of the ": null
    },
    {
        "interplanetary": "wikt:interplanetary"
    },
    {
        " market": "market"
    },
    {
        ". As the Mars trilogy draws to a close in the mid42rd century, the metanational corporations are forced by a global ": null
    },
    {
        "catastrophe": "disaster"
    },
    {
        " to concede more democratic powers to their workforces.     Although there are many transnational and metanational corporations mentioned, two play an active role in the development of the plotline: Praxis, a largely benevolent and relatively democratic firm, and Subarashī, which plays a large role in the maltreatment of the citizens of Mars.       Genetic engineering is first mentioned in Red Mars; it takes off when Sax creates an alga to withstand the harsh Martian temperature and convert its atmosphere into breathable air. Eventually this is done on a massive scale, with thousands of types of GE algae, lichen and bacteria being created to terraform the planet. In Green Mars, GE animals began to be created to withstand the thin Martian atmosphere, and to produce a working planetary-biosphere. By Blue Mars, GE is commonly being done on humans, willingly, to help them better adapt to the new worlds; to breathe thinner air , or to see better in the dimmer light of the outer planets.       The books also speculate on the colonization of other planets and ": null
    },
    {
        "moon": "moon"
    },
    {
        "s in the ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        ", and include descriptions of settlements or terraforming efforts on ": null
    },
    {
        "Callisto": "callisto"
    },
    {
        ", ": null
    },
    {
        "Mercury": "mercury"
    },
    {
        ", ": null
    },
    {
        "Titania": "titania"
    },
    {
        ", ": null
    },
    {
        "Miranda": "miranda"
    },
    {
        " and ": null
    },
    {
        "Venus": "venus"
    },
    {
        ". Toward the end of the last novel, humans are taking sub-light colony ships to other stars, taking advantage of the longevity treatments to survive the trip to their destinations.     A great portion of Blue Mars is concerned with the effects of extreme longevity on its protagonists, most of whom have lived over two hundred years as a result of repeated ": null
    },
    {
        "longevity": "longevity"
    },
    {
        " treatments. In particular, Robinson speculates on the ": null
    },
    {
        "psychological": "psychology"
    },
    {
        " effects of ultra-longevity, including memory loss, personality change, mental instability, and existential boredom.         The initial colonists from the Ares who established a permanent colony. Many of them later become leaders or exemplary figures in the transformation of Mars or its new society. The First Hundred actually consisted of 42 with Coyote being smuggled aboard the Ares by Hiroko.       An American ": null
    },
    {
        "astronaut": "astronaut"
    },
    {
        ", who was the first human to walk on Mars in the year 42 He returns a public hero and uses his considerable influence to ": null
    },
    {
        "lobby": "lobbying"
    },
    {
        " for a second mission, this time one of ": null
    },
    {
        "colonization": "colonization"
    },
    {
        ". Boone received a large amount of ": null
    },
    {
        "radiation": "radiation"
    },
    {
        " on his first trip to Mars, more than the recommended dosage according to medical regulations. However, his celebrity status allows him to skirt this. On the second voyage, Boone is one of the First Hundred colonists sent to permanently colonize Mars. His accomplishments and natural charm yield him an informal leadership role. In the first chapter of Red Mars, John Boone is assassinated in a plot instigated by Frank Chalmers. The narrative then steps back to the First Hundreds voyage to Mars aboard the spaceship Ares. His ideas continue as a point of reference for the remainder of the trilogy. Boones character portrayal is complex; in one light, Boone is a stereotypically simple, heroic figure, an everyman hero: his first words on his first trip to Mars are Well, here we are. He is almost uniformly cheerful and good-natured, and approaches everything he undertakes with hale bonhomie. But later in Red Mars, Robinson switches to Boones ": null
    },
    {
        "point of view": "point of view"
    },
    {
        ", and it is in this section that it is revealed that late in life, Boone is addicted to omegendorph, a fictional drug that is based on ": null
    },
    {
        "endorphin": "endorphin"
    },
    {
        "s in the ": null
    },
    {
        "human brain": "human brain"
    },
    {
        ". In addition, it reveals that at least some of his seeming simplicity might simply be an act designed to further his political goals. Overall, Boone is presented as larger-than-life.       Head of the American contingent, he is ": null
    },
    {
        "Machiavellian": "machiavellianism"
    },
    {
        " in his use of power. However, his cynicism is later shown to be a form of self-defense; Chalmers is at least partly driven by a hidden idealistic side. Early in the voyage to Mars, he becomes sexually involved with Maya Toitovna, the leader of the Russian contingent of the mission. During the second half of the voyage, Toitovna becomes involved with Boone. Already bitter that Boone became the first to walk on Mars instead of him as they were both candidates for the mission and that he was allowed to join the colonization trip despite his manipulations, Chalmers further despises Boone because of Toitovnas affection. His dislike culminates in his involvement in a plot to assassinate Boone, which ultimately succeeds and allows him to take over handling major affairs on Mars. This ultimately becomes his undoing, as his ruthless governance and aggressive diplomatic work backfire on him during the revolution of 42 In the final chapters of Red Mars, Chalmers flees with Toitovna and other members of the First Hundred to join the hidden colonists at the polar ice cap but dies along the way when he is caught outside their vehicle during an ": null
    },
    {
        "aquifer": "aquifer"
    },
    {
        " flood in ": null
    },
    {
        "Valles Marineris": "valles marineris"
    },
    {
        ".       An emotional woman who is at the center of a love triangle between Boone and Chalmers, she begins as head of the Russian contingent. The novels hint that she used both wit and seduction to rise through the ranks of the Russian space agency to become the leader of the first colonization mission. After the first revolution, she flees with other members of the First Hundred to the hidden colony in the pole. She becomes a school teacher of the children of the hidden colonists but later becomes a powerful political force. After the deaths of Chalmers and Boone, she falls in love with Michel Duval. She suffers heavily from ": null
    },
    {
        "bipolar disorder": "bipolar disorder"
    },
    {
        " and from memory-related psychological disorders with growing age, which often lead her to isolate herself from others and sometimes turn violent. Throughout the novels, Maya takes an active political role, helping to keep the surviving First Hundred together during the failed revolution of 42 and guiding the successful revolutions that occur decades later, despite her psychological problems.       A Russian engineer who started out building nuclear reactors in ": null
    },
    {
        "Siberia": "siberia"
    },
    {
        ", during the voyage and initial exploration of Mars, she does her best to avoid the squabbles of the other members of the First Hundred. Instead, she busies herself by building the first permanent habitation of Mars, Underhill, using programmed automated robots. She also helps to construct a new and larger habitat, and research facility in a nearby canyon. In the later books, she becomes a reluctant politician. Chernyshevski is in love with Bogdanov and is devastated when he is killed in an attack by anti-revolutionary forces associated with UNOMA, the transnationals and Phyllis Boyle during the first Martian revolution. In retaliation for Bogdanovs murder, she activates his hidden weapon system, built into ": null
    },
    {
        "Phobos": "phobos"
    },
    {
        ", which causes the entire moon to decelerate in orbit and destructively ": null
    },
    {
        "aerobrake": "aerobrake"
    },
    {
        " in Mars atmosphere, utterly destroying it. In Blue Mars, she falls in love with Art Randolph, with whom she eventually starts a family. After Martian independence, she grudgingly becomes the first president of Mars.       A mechanical engineer with ": null
    },
    {
        "anarchist": "anarchism"
    },
    {
        " leanings, possibly based on the ": null
    },
    {
        "Russian": "russian people"
    },
    {
        " Machist": "ernst mach"
    },
    {
        ", ": null
    },
    {
        "Alexander Bogdanov": "alexander bogdanov"
    },
    {
        " and ": null
    },
    {
        "Arkady Strugatsky": "arkady strugatsky"
    },
    {
        ", he is regarded by many other members of the First Hundred, particularly Boyle, as a troublemaker. He leads the team which establishes an outpost on the moon ": null
    },
    {
        "Phobos": "phobos"
    },
    {
        ", and leads an uprising against the transnational corporation towards the end of first novel. Like Boone , his political ideas weigh heavily on characters later in the series. In love with Nadia Chernyshevski, he is killed during the first Martian revolution in 42       An American ": null
    },
    {
        "physicist": "physicist"
    },
    {
        ", he is a brilliant and creative scientist, and is greatly respected for his intellectual gifts. However, he is socially awkward and often finds it difficult to understand and relate to other people. Russell is a leader of the Green movement, the goal of which is to ": null
    },
    {
        "terraform": "terraforming"
    },
    {
        " Mars. During Green Mars, Sax suffers a stroke while being tortured by government security forces and fellow member of the First Hundred, Phyllis Boyle . He subsequently suffers from ": null
    },
    {
        "Expressive aphasia": "expressive aphasia"
    },
    {
        " and has to relearn how to speak and becomes less predictable in his actions. Originally apolitical, this event and a growing attachment to Mars itself leads Russell to become the physical architect of the second revolution. After memory issues become apparent in many of the remaining first hundred including Sax he begins work on an ambitious project to gather the remaining first hundred and have them try an experimental treatment he helped to develop. It is after this that Sax realizes his persistent attempts to please Ann are actually because he is also secretly in love with Ann Clayborne, who cannot stand him at first, but after decades on Mars, eventually reconciles. ": null
    },
    {
        "Saxifrage": "saxifrage"
    },
    {
        " means stonebreaker and is the name for an Alpine plant that grows between stones.       An American ": null
    },
    {
        "geologist": "geologist"
    },
    {
        ", Clayborne is one of the first areologists and maintains a stalwart desire to see Mars preserved in the state it holds when humans arrive. Clayborne early on debates Saxifrage Russell over the proper role of humanity on Mars and though initially apolitical, this stance marks her as the original Red, while Russells hands-on terraforming reflects the antithesis of these views. Clayborne is shown to prefer solitude during much of the series, and even her relationship with fellow First Hundred settler Simon is subject to introspective silence in most cases. Simons death and the estrangement she finds from their son Peter when the latter emerges as a leading moderate green drive her to further isolation. Claybornes relationship with Russell is shown to be complex, the two of them taking early opposite views but the situation slowly changing as Russell comes to appreciate what has been unleashed and what has indeed been lost as science gives way to commercial exploitation that he cannot control. During the events of Blue Mars, Russell intervenes to save Claybornes life; later, the two are revealed to have once shared an attraction that went astray because of a casual misinterpretation between them. Ann undergoes a drastic change towards Blue Mars due to the emergence of something inside of her that she describes as anti-Ann and something else that she cant quite describe.       A Japanese expert on ": null
    },
    {
        "biology": "biology"
    },
    {
        ", agriculture, and ecological systems, it was Ai who smuggled Desmond Coyote Hawkins onto the Ares . She is the charismatic leader of the farm team, one of the important work groups and cliques among the First Hundred. She thus becomes the focus of many of the trilogys central themes. Most importantly, she teaches the importance of maintaining a respectful relation with ones planet. On Mars, this is called the Areophany. In the secret colony Zygote, which Hiroko established, the first generation of children of the First Hundred, the ectogenes, are all the product of artificial insemination outside of any human body. Hiroko uses the ova of the female members of the First Hundred as the female genetic material and uses the sperm of the male members of the First Hundred to fertilize the ova. Although Hiroko is seldom at the center of the narrative, her influence is pervasive. She disappears for the final time in Green Mars. Her ultimate fate is left unresolved.       A French ": null
    },
    {
        "psychologist": "psychologist"
    },
    {
        " pivotally involved in early psychological screening of First Hundred candidates in Antarctica which he describes as being a collection of double bind requirements. Duval is assigned to accompany the Mars mission and is treated as an observer rather than as a member of the team during the early events of Red Mars. His aloof personality enforces this ostracism and also subverts his relationships with others, but in time it becomes clear that Duval is struggling with his own psychological issues perhaps more than anyone else from the expedition. During the first disappearance of the farm team, he is invited by Hiroko to flee with the farm team and establish Zygote, the first hidden colony. Duval desperately wants to return to ": null
    },
    {
        "Provence": "provence"
    },
    {
        " as he remembers it, and after visiting as a part of the Martian diplomatic mission to Earth, he becomes even more homesick. Duval falls in love with Maya Toitovna and guides her through particularly challenging psychological episodes throughout most of the series, dying late in Blue Mars of heart arrhythmia when Maya displays signs of very heavy temporary memory loss.       Nearly sixty when he arrives on Mars, a Russian biological scientist who is the oldest of the First Hundred. Taneev heads medical treatment and most research projects on Mars, becoming famous as the creator of the gerontological treatment used to regenerate human cellular systems and ushering in a new era of longevity. He lives in Acheron on the Great Escarpment in the north of Mars before fleeing to the hidden colony after the First Revolution but later returns to his research, falling victim to quick decline late in the events of Blue Mars. For much of his Mars-centric life, Taneev lives in a ": null
    },
    {
        "ménage à trois": "ménage à trois"
    },
    {
        " with Ursula and Marina, the exact nature of which is never resolved.          A Christian American geologist with a harsh personality that does not win her many friends among the First Hundred and gains particular enmity from Ann Clayborne. As the Mars situation develops, Boyle sides against most of the First Hundred in favor of the increasingly authoritarian United Nations Office of Mars Affairs and its successor, the ": null
    },
    {
        "corporate": "corporate"
    },
    {
        "/quasi-fascist United Nations Transitional Authority . Her influence is strongest during the later events of Red Mars, where by the 42 revolution she has been placed in charge of the asteroid Clarke that serves as the counterweight of the First ": null
    },
    {
        "Space Elevator": "space elevator"
    },
    {
        ". The events of the revolution send Clarke spinning off into the outer Solar System at the end of Red Mars; Green Mars finds her back in the equation, but her influence is greatly reduced against the backdrop of a much-expanded UNTA presence. Boyle engages in a brief sexual relationship with Saxifrage Russell while the latter is living under an assumed identity and is singularly capable of discerning who he really is, turning him over the UNTA. She is later present at a session in Kasei Vallis where Russell is being tortured, and is killed by Maya Toitovna. Later, as his memory recovers, Russell reveals that Boyle had been opposed to his torture and was demanding that he be released at the time that Mayas team freed him.       A ": null
    },
    {
        "Trinidad": "trinidad"
    },
    {
        "ian stowaway, he is a friend and supporter of Hiroko, and a fervent ": null
    },
    {
        "anarchist communist": "anarchist communist"
    },
    {
        ". Present in Red Mars only as a stowaway who eventually blends effortlessly into the Martian background, he is not even identified as anything more than Coyote until the beginning of Green Mars. He becomes a leading figure in the underground and an unofficial coordinator of a developing ": null
    },
    {
        "gift economy": "gift economy"
    },
    {
        ".       Since the trilogy covers over 42 years of human history, later immigrants and the children and grandchildren of the First Hundred eventually become important characters in their own right.     The Martians use the same terminology for different generations as ": null
    },
    {
        "Japanese Americans": "japanese americans"
    },
    {
        ". People who immigrated from Earth are called issei, the first generation born on Mars are ": null
    },
    {
        "nisei": "nisei"
    },
    {
        ", and the second-generation Martians are sansei. Third-generation Martians are called yonsai.       Kasei is the son of Hiroko and John Boone and the father of Jackie Boone. Kasei is the leader of the Kakaze, a radical Red faction. His name is Japanese for the planet Mars. He dies during the second revolution, after an unsuccessful attack on the second space elevator.       The son of Hiroko and Coyote, he is raised communally by Hiroko and her followers in Zygote. He is a good-natured wanderer who eventually becomes a political leader advocating ties with Earth. He is one of the founders of the Free Mars movement and is famous for his running technique that allows him to run all day for days on end. As Nadias assistants, he and Art are instrumental in getting the Martian constitution written. Later he is sent on a diplomatic mission to Earth but nearly dies from an infection. His name is ancient Babylonian for ": null
    },
    {
        "Mars": "mars"
    },
    {
        " .       The granddaughter of Hiroko and John Boone , she emerges as a leader of the Free Mars movement, but is seen to change her platform based on whatever keeps her in power . After her daughter Zos death, she retires in grief and joins a one-way expedition to an ": null
    },
    {
        "extrasolar planet": "extrasolar planet"
    },
    {
        " near ": null
    },
    {
        "Aldebaran": "aldebaran"
    },
    {
        ".       Peter Clayborne is the son of Ann Clayborne and Simon Frazier, being one of the first children born on Mars. Peter holds a position of older brother to all of the following first generation. Many revolutionary and later political decisions of the Mars First movement are influenced by his opinions and judgment. He works part-time as an engineer and a green politician.       Jackies daughter; she has feline traits inserted into her genome via the gerontological longevity treatment. In Blue Mars, she travels the solar system running political errands for Jackie, although the two do not get along particularly well. Her character is portrayed as ": null
    },
    {
        "hedonistic": "hedonistic"
    },
    {
        " and explicitly ": null
    },
    {
        "nihilistic": "nihilism"
    },
    {
        ", making sexual satisfaction a priority and seemingly having little regard for the feelings of others. On the other hand, she apparently has a conscience, risking her life to rescue a man on Mercury and later dying in an attempt to save a distressed flier.       The daughter of Nadia and Art.         A representative of the Praxis corporation sent to contact the Martian underground movement on a quasi-": null
    },
    {
        "diplomatic": "diplomacy"
    },
    {
        " mission in an attempt to create a system of ecological capitalism based on democratic corporations. Like the other metanationals, it takes on intensive economic and political ties with governments, but Praxis aims for partnerships rather than exploitive relationships.     42Imaginova Corpspacecraftfrom the Web site of the ": null
    },
    {
        "Planetary Society": "planetary society"
    },
    {
        ". Accessed 424242": null
    }
]