[
    {
        "        Martha Ellen Scott was an American ": null
    },
    {
        "actress": "actress"
    },
    {
        ". She was featured in major films such as ": null
    },
    {
        "Cecil B. DeMille": "cecil b. demille"
    },
    {
        "s  The Ten Commandments  , and ": null
    },
    {
        "William Wyler": "william wyler"
    },
    {
        "s  Ben-Hur  , playing the mother of ": null
    },
    {
        "Charlton Heston": "charlton heston"
    },
    {
        "s character in both films. She originated the role of Emily Webb in ": null
    },
    {
        "Thornton Wilder": "thornton wilder"
    },
    {
        "s  Our Town  on Broadway in 42 and later recreated the role in the ": null
    },
    {
        "42 film version": "our town"
    },
    {
        " for which she was nominated for the ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        ".       Scott was born in ": null
    },
    {
        "Jamesport, Missouri": "jamesport, missouri"
    },
    {
        ", the daughter of Letha and Walter Alva Scott, an engineer and garage owner. Her mother was a second cousin of U.S. President ": null
    },
    {
        "William McKinley": "william mckinley"
    },
    {
        ". The Scott family remained in Jamesport until Martha was thirteen years old when they moved to Kansas City, Missouri and eventually to Detroit, Michigan. Scott became interested in acting in high school, an interest she furthered by attending the University of Michigan, earning a teaching certificate and a Bachelor of Arts degree in drama in 42            Scott received a career boost right out of college when she appeared with the Globe Theatre Troupe in a series of ": null
    },
    {
        "Shakespeare": "william shakespeare"
    },
    {
        " productions at the ": null
    },
    {
        "Century of Progress": "century of progress"
    },
    {
        " worlds fair in Chicago in 42 Following that she moved to New York City, where she found steady work both in stock stage productions and in radio dramas. In 42 she made her Broadway debut in the original staging of ": null
    },
    {
        "Thornton Wilder": "thornton wilder"
    },
    {
        "s play  Our Town  as Emily Webb, the tragic young woman who dies in childbirth.          Two years later Scott reprised the role of Emily in her film debut when  Our Town  was made into a movie. Her critically acclaimed performance earned her an Academy Award nomination for ": null
    },
    {
        "Best Actress": "academy award for best actress"
    },
    {
        ".     Scott found steady movie work for the next four decades, appearing in major epics such as The Ten Commandments, Ben-Hur,  The Desperate Hours , and  Airport 42 . ": null
    },
    {
        "Charlton Heston": "charlton heston"
    },
    {
        " was a frequent co-star with Scott on both stage and screen. As she told an interviewer in 42 I played his mother twice and his wife twice. I was his mother in Ben Hur and The Ten Commandments. I was his wife on the stage in New York in Design for a Stained Glass Window and The Tumbler in London.          In 42 Scott joined ": null
    },
    {
        "Henry Fonda": "henry fonda"
    },
    {
        " and ": null
    },
    {
        "Robert Ryan": "robert ryan"
    },
    {
        " in forming a theatrical production company called The Plumstead Playhouse. It later became the Plumstead Theatre Company and moved to Los Angeles. The company produced  First Monday in October , both on stage and on film. Scott co-produced both versions. Her last production was  Twelve Angry Men , which was performed at the Henry Fonda Theatre in Hollywood, California.          Martha Scott first began appearing in TV roles in the mediums early days. Her first role came in 42 on  The Nash Airflyte Theater , followed by several guest appearances on  Robert Montgomery Presents  and other shows of televisions golden age , including two episodes of  Alfred Hitchcock Presents . This pattern of guest roles continued through the 42s with appearances on  Route 42 ,  Ironside , and  The Courtship of Eddies Father  among others. In the mid42s, Scott was the narrator for Modern Romances, an afternoon program on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        "-TV.     Scott was also a frequent TV guest star in the 42s. She had recurring roles as ": null
    },
    {
        "Bob Newhart": "bob newhart"
    },
    {
        "s mother on  The Bob Newhart Show , the mother of Colonel Steve Austin  on both  The Six Million Dollar Man  and  The Bionic Woman  as well as Patricia Shepard, ": null
    },
    {
        "Sue Ellen": "sue ellen ewing"
    },
    {
        " and ": null
    },
    {
        "Kristin": "kristin shepard"
    },
    {
        "s mother on  Dallas  during its early years and later during the 42 season. Scott was cast in single episode guest appearances on several hit shows of the era like  The Sandy Duncan Show ,  Columbo: Playback  ,  The Mod Squad ,  Marcus Welby, M.D. , and  The Love Boat . She played the role of Jennifer Talbot, Terri Brocks nasty grandmother on  General Hospital  for six months which ended when her character was murdered and stuffed in a drain pipe.     In the 42s she had a regular role on the short-lived series  Secrets of Midland Heights  and appeared in several television movies and single-episode shows such as  Magnum, P.I. ,  The Paper Chase , and  Highway to Heaven . In the late 42s, she and ": null
    },
    {
        "Jeffrey Lynn": "jeffrey lynn"
    },
    {
        " acted in an episode of  Murder, She Wrote , which was a direct sequel to their 42 feature film  Strange Bargain . Scotts final acting role on television was in 42 in the movie Daughter of the Streets.             Martha Scott was twice-married, first to radio producer and announcer Carleton William Alsop from 42 to 42 and then to jazz pianist and composer ": null
    },
    {
        "Mel Powell": "mel powell"
    },
    {
        " from 42 until his death in 42 She had one child with Alsop, son Carleton Scott Alsop, and two daughters—Mary Powell Harpel and Kathleen Powell,—with her second husband.     According to her son, Scott, his mother never forgot about her childhood hometown, using the mental image of a Jamesport cemetery in preparation for her Oscar-nominated role in Our Town. Said Alsop, She told me she used that place as her image because its so serene and beautiful and that her deceased McKinley and Scott relatives became the Gibbs and the Webbs in the play .     A ": null
    },
    {
        "Democrat": "democratic party"
    },
    {
        ", she supported the campaign of ": null
    },
    {
        "Adlai Stevenson": "adlai stevenson ii"
    },
    {
        " during the ": null
    },
    {
        "42 presidential election": "1952 united states presidential election"
    },
    {
        " Motion Picture and Television Magazine, November 42 page 42 Ideal Publishers .     Martha Scott died on May 42 42 in ": null
    },
    {
        "Van Nuys": "van nuys"
    },
    {
        ", ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ", aged 42 from natural causes. She was interred next to Powell in the Masonic Cemetery in her native Jamesport, Missouri.       For her contribution in the theatre, Scott has a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        " at 42 Hollywood Boulevard.         Our Town  – Emily Webb    The Howards of Virginia  – Jane Peyton-Howard    Cheers for Miss Bishop  – Ella Bishop    They Dare Not Love  – Marta Keller    One Foot in Heaven  – Hope Morris Spence    Stage Door Canteen  – Martha Scott    Hi Diddle Diddle  – Janie Prescott Phyffe    In Old Oklahoma  – Catherine Elizabeth Allen    So Well Remembered  – Olivia    Strange Bargain  – Georgia Wilson    When I Grow Up  – Mother Reed    The Desperate Hours  – Ellie Hilliard    The Ten Commandments  – Yochabel    Eighteen and Anxious  – Lottie Graham    Sayonara  – Mrs. Webster    Ben-Hur  – Miriam    The Devils Daughter  – Mrs. Stone    Charlottes Web  – Mrs. Arable    The Man from Independence  – Mamma Truman    Thursdays Game  – Mrs. Reynolds    Airport 42  – Sister Beatrice    The Bob Newhart Show  - Fathers and Sons and Mothers as Bobs mother Martha Hartley    The Turning Point  – Adelaide    The Word  - Sarah Randall    First Monday in October  – Cameo Appearance    Summer Girl  - Martina Shelburne    Adam  – Gram Walsh    Doin Time on Planet Earth  – Virginia Camalier          ": null
    }
]