[
    {
        "              Martin Ludwig Bormann was a German ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " official and head of the ": null
    },
    {
        "Nazi Party Chancellery": "nazi party chancellery"
    },
    {
        ". He gained immense power by using his position as ": null
    },
    {
        "Adolf Hitlers": "adolf hitler"
    },
    {
        "private secretary to control the flow of information and access to Hitler. After ": null
    },
    {
        "Hitlers suicide": "hitlers suicide"
    },
    {
        " on 30 April 1945, he was ": null
    },
    {
        "Party Minister of the National Socialist German Workers Party": "party minister of the national socialist german workers party"
    },
    {
        ".     Bormann joined a paramilitary  Freikorps  organisation in 1922 while working as manager of a large estate. He served nearly a year in prison as an accomplice to his friend ": null
    },
    {
        "Rudolf Höss": "rudolf höss"
    },
    {
        "  in the murder of ": null
    },
    {
        "Walther Kadow": "walther kadow"
    },
    {
        ". Bormann joined the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " in 1927 and the  Schutzstaffel  in 1937. He initially worked in the partys insurance service, and transferred in July 1933 to the office of ": null
    },
    {
        "Deputy Führer": "deputy führer"
    },
    {
        " Rudolf Hess": "rudolf hess"
    },
    {
        ", where he served as chief of staff.     Bormann used his position to create an extensive bureaucracy and involve himself as much as possible in the decision making. He gained acceptance into Hitlers inner circle, and accompanied him everywhere, providing briefings and summaries of events and requests. He began acting as Hitlers personal secretary on 12 August 1935. Bormann assumed Hess former duties, with the title of Head of the Parteikanzlei , after Hess solo flight to Britain on 10 May 1941 to seek peace negotiations with the British government. He had final approval over civil service appointments, reviewed and approved legislation, and by 1943 had de facto control over all domestic matters. Bormann was one of the leading proponents of the ongoing persecution of the Christian churches and favoured harsh treatment of ": null
    },
    {
        "Jews": "jews"
    },
    {
        " and ": null
    },
    {
        "Slavs": "slavs"
    },
    {
        " in the areas conquered by Germany during World War II.     Bormann returned with Hitler to the  Führerbunker  in Berlin on 16 January 1945 as the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " approached the city. After ": null
    },
    {
        "Hitler committed suicide": "death of adolf hitler"
    },
    {
        ", Bormann and others attempted to flee Berlin on 2 May to avoid capture by the Soviets. Bormann probably committed suicide on a bridge near ": null
    },
    {
        "Lehrter station": "berlin hauptbahnhof"
    },
    {
        ". His body was buried nearby on 8 May 1945, but was not found and confirmed as Bormanns until 1973; the identification was reaffirmed in 1998 by DNA tests. The missing Bormann was tried  in absentia  by the International Military Tribunal in the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " of 1945 and 1946. He was convicted of ": null
    },
    {
        "war crimes": "war crime"
    },
    {
        "and ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        " and sentenced to death by hanging.       Born in ": null
    },
    {
        "Wegeleben": "wegeleben"
    },
    {
        "  in the ": null
    },
    {
        "Kingdom of Prussia": "kingdom of prussia"
    },
    {
        " in the ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        ", Bormann was the son of Theodor Bormann , a post office employee, and his second wife, Antonie Bernhardine Mennong. The family was ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        ". He had two half-siblings from his fathers earlier marriage to Louise Grobler, who died in 1898. Antonie Bormann gave birth to three sons, one of whom died in infancy. Martin and ": null
    },
    {
        "Albert": "albert bormann"
    },
    {
        " survived to adulthood. Theodor died when Bormann was three, and his mother soon remarried.     Bormanns studies at an agricultural trade high school were interrupted when he joined the 55th Field Artillery Regiment as a gunner in June 1918, in the last days of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". He never saw action, but served garrison duty until February 1919. After working a short time in a cattle feed mill, Bormann became estate manager of a large farm in ": null
    },
    {
        "Mecklenburg": "mecklenburg"
    },
    {
        ". Shortly after starting work at the estate, Bormann joined an ": null
    },
    {
        "antisemitic": "antisemitic"
    },
    {
        " landowners association. While ": null
    },
    {
        "hyperinflation in the Weimar Republic": "hyperinflation in the weimar republic"
    },
    {
        " meant that money was worthless, foodstuffs stored on farms and estates became ever more valuable. Many estates, including Bormanns, had  Freikorps  units stationed on site to guard the crops from pillaging. Bormann joined the Freikorps organisation headed by ": null
    },
    {
        "Gerhard Roßbach": "gerhard roßbach"
    },
    {
        " in 1922, acting as section leader and treasurer.     On 17 March 1924 Bormann was sentenced to a year in Elisabethstrasse Prison as an accomplice to his friend ": null
    },
    {
        "Rudolf Höss": "rudolf höss"
    },
    {
        " in the murder of ": null
    },
    {
        "Walther Kadow": "walther kadow"
    },
    {
        ". The perpetrators believed Kadow had tipped off the ": null
    },
    {
        "French occupation": "occupation of the ruhr"
    },
    {
        " authorities in the ": null
    },
    {
        "Ruhr District": "ruhr district"
    },
    {
        " that fellow Freikorps member ": null
    },
    {
        "Albert Leo Schlageter": "albert leo schlageter"
    },
    {
        " was carrying out ": null
    },
    {
        "sabotage": "sabotage"
    },
    {
        " operations against French industries. Schlageter was arrested and was executed on 23 May 1923. On the night of 31 May, Höss, Bormann and several others took Kadow into a meadow out of town, where he was beaten and his throat cut. After one of the perpetrators confessed, police dug up the body and laid charges in July. Bormann was released from prison in February 1925. He joined the  Frontbann , a short-lived ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " paramilitary": "paramilitary"
    },
    {
        " organisation created to replace the  Sturmabteilung  , which had been banned in the aftermath of the failed ": null
    },
    {
        "Munich Putsch": "munich putsch"
    },
    {
        ". Bormann returned to his job at Mecklenburg and remained there until May 1926, when he moved in with his mother in Oberweimar.       In 1927, Bormann joined the National Socialist German Workers Party . His membership number was 60,508. He joined the  Schutzstaffel  on 1 January 1937 with number 278,267. By special order of ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        " in 1938, Bormann was granted SS number 555 to reflect his  Alter Kämpfer  status.       Bormann took a job with Der Nationalsozialist, a weekly paper edited by NSDAP member ": null
    },
    {
        "Hans Severus Ziegler": "hans severus ziegler"
    },
    {
        ", who was deputy  Gauleiter  for ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        ". After joining the NSDAP in 1927, Bormann began duties as regional press officer, but his lack of public-speaking skills made him ill-suited to this position. He soon put his organisational skills to use as business manager for the  Gau  . He moved to Munich in October 1928, where he worked in the SA insurance office. Initially the NSDAP provided coverage through insurance companies for members who were hurt or killed in the frequent violent skirmishes with members of other political parties. As insurance companies were unwilling to pay out claims for such activities, in 1930 Bormann set up the Hilfskasse der NSDAP , a benefits and relief fund directly administered by the party. Each party member was required to pay premiums and might receive compensation for injuries sustained while conducting party business. Payments out of the fund were made solely at Bormanns discretion. He began to gain a reputation as a financial expert, and many party members felt personally indebted to him after receiving benefits from the fund. In addition to its stated purpose, the fund was used as a last-resort source of funding for the NSDAP, which was chronically short of money at the time. After the NSDAPs success in the ": null
    },
    {
        "1930 general election": "1930 german federal election"
    },
    {
        ", where they won 107 seats, party membership grew dramatically. By 1932 the fund was collecting 3 million ": null
    },
    {
        "Reichsmarks": "reichsmark"
    },
    {
        "per year.     Bormann also worked on the staff of the SA from 1928 to 1930, and while there he founded the National Socialist Automobile Corps, precursor to the ": null
    },
    {
        "National Socialist Motor Corps": "national socialist motor corps"
    },
    {
        ". The organisation was responsible for co-ordinating the donated use of motor vehicles belonging to party members, and later expanded to training members in automotive skills.     Reichsleiter and head of the party chancellery Machtergreifung  in January 1933, the relief fund was repurposed to provide general accident and property insurance, so Bormann resigned from its administration. He applied for a transfer and was accepted as chief of staff in the office of ": null
    },
    {
        "Rudolf Hess": "rudolf hess"
    },
    {
        ", the ": null
    },
    {
        "Deputy Führer": "deputy führer"
    },
    {
        ", on 1 July 1933. Bormann also served as personal secretary to Hess from 4 July 1933 until May 1941. Hess department was responsible for settling disputes within the party and acted as an intermediary between the party and the state regarding policy decisions and legislation. Bormann used his position to create an extensive bureaucracy and involve himself in as much of the decision-making as possible. On 10 October 1933 Hitler named Bormann  Reichsleiter  of the NSDAP, and in November he was named  Reichstag  deputy. By June 1934, Bormann was gaining acceptance into Hitlers inner circle and accompanied him everywhere, providing briefings and summaries of events and requests.        In 1935, Bormann was appointed as overseer of renovations at the ": null
    },
    {
        "Berghof": "berghof"
    },
    {
        ", Hitlers property at ": null
    },
    {
        "Obersalzberg": "obersalzberg"
    },
    {
        ". In the early 1930s, Hitler bought the property, which he had been renting since 1925 as a vacation retreat. After he became ": null
    },
    {
        "chancellor": "chancellor of germany"
    },
    {
        ", Hitler drew up plans for expansion and remodelling of the main house and put Bormann in charge of construction. Bormann commissioned the construction of barracks for the SS guards, roads and footpaths, garages for motor vehicles, a guesthouse, accommodation for staff, and other amenities. Retaining title in his own name, Bormann bought up adjacent farms until the entire complex covered . Members of the inner circle built houses within the perimeter, beginning with ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        ", ": null
    },
    {
        "Albert Speer": "albert speer"
    },
    {
        ", and Bormann himself. Bormann commissioned the building of the  Kehlsteinhaus  , a tea house high above the Berghof, as a gift to Hitler on his fiftieth birthday . Hitler seldom used the building, but Bormann liked to impress guests by taking them there.     While Hitler was in residence at the Berghof, Bormann was constantly in attendance and acted as Hitlers personal secretary. In this capacity, he began to control the flow of information and access to Hitler. During this period, Hitler gave Bormann control of his personal finances. In addition to salaries as chancellor and president, Hitlers income included money raised through royalties collected on his book  Mein Kampf  and the use of his image on postage stamps. Bormann set up the ": null
    },
    {
        "Adolf Hitler Fund of German Trade and Industry": "adolf hitler fund of german trade and industry"
    },
    {
        ", which collected money from German industrialists on Hitlers behalf. Some of the funds received through this programme were disbursed to various party leaders, but Bormann retained most of it for Hitlers personal use. Bormann and others took notes of Hitlers thoughts expressed over dinner and in monologues late into the night and preserved them. The material was published after the war as  Hitlers Table Talk .     The office of the Deputy Führer had final approval over civil service appointments, and Bormann reviewed the personnel files and made the decisions regarding appointments. This power impinged on the purview of Minister of the Interior ": null
    },
    {
        "Wilhelm Frick": "wilhelm frick"
    },
    {
        ", and was an example of the overlapping responsibilities typical of the Nazi regime. Bormann travelled everywhere with Hitler, including trips to Austria in 1938 after the  Anschluss  , and to the ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        " after the signing of the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        " later that year. Bormann was placed in charge of organising the 1938 ": null
    },
    {
        "Nuremberg Rally": "nuremberg rally"
    },
    {
        ", a major annual party event.        Hitler intentionally played top party members against one another and the NSDAP against the civil service. In this way, he fostered distrust, competition, and infighting among his subordinates to consolidate and maximise his own power. He typically did not give written orders; instead he communicated them verbally or had them conveyed through Bormann. Falling out of favour with Bormann meant that access to Hitler was cut off. Bormann proved to be a master of intricate political infighting. Along with his ability to control access to Hitler, this enabled him to curtail the power of ": null
    },
    {
        "Joseph Goebbels": "joseph goebbels"
    },
    {
        ", Göring, Himmler, ": null
    },
    {
        "Alfred Rosenberg": "alfred rosenberg"
    },
    {
        ", ": null
    },
    {
        "Robert Ley": "robert ley"
    },
    {
        ", ": null
    },
    {
        "Hans Frank": "hans frank"
    },
    {
        ", Speer, and other high-ranking officials, many of whom became his enemies. This ruthless and continuous intriguing for power, influence, and Hitlers favour came to characterise the inner workings of the Third Reich.     As ": null
    },
    {
        "World War II": "european theatre of world war ii"
    },
    {
        " progressed, Hitlers attention became focused on foreign affairs and the conduct of the war to the exclusion of all else. Hess, not directly engaged in either of these endeavours, became increasingly sidelined from the affairs of the nation and from Hitlers attention; Bormann had successfully supplanted Hess in many of his duties and usurped his position at Hitlers side. Hess was concerned that Germany would face a war on two fronts as plans progressed for ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ", the invasion of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " scheduled to take place later that year. He flew solo to Britain on 10 May 1941 to seek peace negotiations with the British government. He was arrested on arrival and spent the rest of the war as a British prisoner, eventually receiving a life sentence for ": null
    },
    {
        "war crimes": "war crime"
    },
    {
        "at the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " in 1946. Speer later said Hitler described Hess departure as one of the worst blows of his life, as he considered it a personal betrayal. Hitler ordered Hess to be shot should he return to Germany and abolished the post of Deputy Führer on 12 May 1941, assigning Hess former duties to Bormann, with the title of Head of the Parteikanzlei . In this position he was responsible for all NSDAP appointments, and was answerable only to Hitler. Associates began to refer to him as the Brown Eminence , although never to his face.     Bormanns power and effective reach broadened considerably during the war. By early 1943, the war produced a labour crisis for the regime. Hitler created a three-man committee with representatives of the State, the army, and the Party in an attempt to centralise control of the war economy. The committee members were ": null
    },
    {
        "Hans Lammers": "hans lammers"
    },
    {
        " , Field Marshal ": null
    },
    {
        "Wilhelm Keitel": "wilhelm keitel"
    },
    {
        ", chief of the  Oberkommando der Wehrmacht  , and Bormann, who controlled the Party. The committee was intended to independently propose measures regardless of the wishes of various ministries, with Hitler reserving most final decisions to himself. The committee, soon known as the Dreierausschuß , met eleven times between January and August 1943. However, they ran up against resistance from Hitlers cabinet ministers, who headed deeply entrenched spheres of influence and were excluded from the committee. Seeing it as a threat to their power, Goebbels, Göring, and Speer worked together to bring it down. The result was that nothing changed, and the Committee of Three declined into irrelevance.       While Article 24 of the ": null
    },
    {
        "National Socialist Program": "national socialist program"
    },
    {
        " called for conditional toleration of Christian denominations and a  Reichskonkordat  treaty with the ": null
    },
    {
        "Vatican": "holy see"
    },
    {
        " was signed in 1933, purporting to guarantee religious freedom for Catholics, Hitler believed that religion was fundamentally incompatible with National Socialism. Bormann, who was strongly anti-Christian, agreed; he stated publicly in 1941 that National Socialism and Christianity are irreconcilable.  Out of political expediency, Hitler intended to postpone the elimination of the Christian churches until after the war. However, his repeated hostile statements against the church indicated to his subordinates that a continuation of the  Kirchenkampf  would be tolerated and even encouraged.     Bormann was one of the leading proponents of the ongoing persecution of the Christian churches. In February 1937, he decreed that members of the clergy should not be admitted to the NSDAP. The following year he ruled that any members of the clergy who were holding party offices should be dismissed, and that any party member who was considering entering the clergy had to give up his party membership. While Bormanns push to force the closure of theological departments at Reich universities was unsuccessful, he was able to reduce the amount of religious instruction provided in public schools to two hours per week and mandated the removal of crucifixes from classrooms. Speer notes in his memoirs that while drafting plans for  Welthauptstadt Germania , the planned rebuilding of Berlin, he was told by Bormann that churches were not to be allocated any building sites.     As part of the campaign against the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ", hundreds of monasteries in Germany and Austria were confiscated by the Gestapo and their occupants were expelled. In 1941 the Catholic Bishop of Münster, ": null
    },
    {
        "Clemens August Graf von Galen": "clemens august graf von galen"
    },
    {
        ", publicly protested against this persecution and against ": null
    },
    {
        "Action T4": "action t4"
    },
    {
        ", the Nazi ": null
    },
    {
        "involuntary euthanasia": "involuntary euthanasia"
    },
    {
        " programme under which the mentally ill, physically deformed, and incurably sick were to be killed. In a series of sermons that received international attention, he criticised the programme as illegal and immoral. His sermons led to a widespread ": null
    },
    {
        "protest movement among church leaders": "nazi euthanasia and the catholic church"
    },
    {
        ", the strongest protest against a Nazi policy up until that point. Bormann and others called for Galen to be hanged, but Hitler and Goebbels concluded that Galens death would only be viewed as a martyrdom and lead to further unrest. Hitler decided to deal with the issue when the war was over.     ": null
    },
    {
        "George Mosse": "george mosse"
    },
    {
        " wrote of Bormanns beliefs:        However, ": null
    },
    {
        "Richard Overy": "richard overy"
    },
    {
        " describes Bormann as an atheist.       Preoccupied with military matters and spending most of his time at his military headquarters on the ": null
    },
    {
        "eastern front": "eastern front"
    },
    {
        ", Hitler came to rely more and more on Bormann to handle the domestic policies of the country. On 12 April 1943, Hitler officially appointed Bormann as Personal Secretary to the Führer. By this time Bormann had de facto control over all domestic matters, and this new appointment gave him the power to act in an official capacity in any matter.          Bormann was invariably the advocate of extremely harsh, radical measures when it came to the treatment of Jews, the conquered eastern peoples, and prisoners of war. He signed the decree of 31 May 1941 extending the 1935 ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        " to the annexed territories of the East. Thereafter, he signed the decree of 9 October 1942 prescribing that the permanent ": null
    },
    {
        "Final Solution": "final solution"
    },
    {
        " in ": null
    },
    {
        "Greater Germany": "greater germanic reich"
    },
    {
        " could no longer be solved by emigration, but only by the use of ruthless force in the special camps of the East , that is, extermination in ": null
    },
    {
        "Nazi death camps": "nazi death camps"
    },
    {
        ". A further decree, signed by Bormann on 1 July 1943, gave ": null
    },
    {
        "Adolf Eichmann": "adolf eichmann"
    },
    {
        " absolute powers over Jews, who now came under the exclusive jurisdiction of the Gestapo. Historian ": null
    },
    {
        "Richard J. Evans": "richard j. evans"
    },
    {
        " estimates that 5.5 to 6 million Jews, representing two-thirds of the Jewish population of Europe, were exterminated by the Nazi regime in the course of ": null
    },
    {
        "The Holocaust": "the holocaust"
    },
    {
        ".     Knowing Hitler viewed ": null
    },
    {
        "Slavic people": "slavic people"
    },
    {
        " as inferior, Bormann opposed the introduction of German criminal law into the conquered eastern territories. He lobbied for and eventually achieved a strict separate penal code that implemented ": null
    },
    {
        "martial law": "martial law"
    },
    {
        " for the Polish and Jewish inhabitants of these areas. The Edict on Criminal Law Practices against Poles and Jews in the Incorporated Eastern Territories , promulgated 4 December 1941, permitted corporal punishment and death sentences for even the most trivial of offences.     Bormann supported the hard-line approach of ": null
    },
    {
        "Erich Koch": "erich koch"
    },
    {
        ", Reichskommissar in ": null
    },
    {
        "Reichskommissariat Ukraine": "reichskommissariat ukraine"
    },
    {
        ", in his brutal treatment of Slavic people. ": null
    },
    {
        "Alfred Rosenberg": "alfred rosenberg"
    },
    {
        ", serving as head of the ": null
    },
    {
        "Reich Ministry for the Occupied Eastern Territories": "reich ministry for the occupied eastern territories"
    },
    {
        ", favoured a more moderate policy. After touring collective farms around ": null
    },
    {
        "Vinnytsia": "vinnytsia"
    },
    {
        ", Ukraine, Bormann was concerned about the health and good physical constitution of the population, as he was concerned that they could constitute a danger to the regime. After discussion with Hitler, he issued a policy directive to Rosenberg that read in part:          Bormann and Himmler shared responsibility for the  Volkssturm  , which drafted all remaining able-bodied men aged 16 to 60 into a last-ditch militia founded on 18 October 1944. Poorly equipped and trained, the men were sent to fight on the eastern front, where nearly 175,000 of them were killed without having any discernible impact on the Soviet advance.       Hitler transferred his headquarters to the  Führerbunker  in Berlin on 16 January 1945, where he  remained until the end of April. The Führerbunker was located under the ": null
    },
    {
        "Reich Chancellery": "reich chancellery"
    },
    {
        " garden in the government district of the city centre. The ": null
    },
    {
        "Battle of Berlin": "battle of berlin"
    },
    {
        ", the final major Soviet offensive of the war, began on 16 April 1945. By 19 April the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " started to encircle the city. On 20 April, his 56th birthday, Hitler made his last trip to the surface. In the ruined garden of the Reich Chancellery, he awarded ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        "es to boy soldiers of the ": null
    },
    {
        "Hitler Youth": "hitler youth"
    },
    {
        ". That afternoon, Berlin was bombarded by Soviet artillery for the first time. On 23 April, ": null
    },
    {
        "Albert Bormann": "albert bormann"
    },
    {
        " left the bunker complex and flew to the Obersalzberg. He and several others had been ordered by Hitler to leave Berlin.     In the early morning hours of 29 April 1945, ": null
    },
    {
        "Wilhelm Burgdorf": "wilhelm burgdorf"
    },
    {
        ", Goebbels, ": null
    },
    {
        "Hans Krebs": "hans krebs"
    },
    {
        ", and Bormann witnessed and signed ": null
    },
    {
        "Hitlers last will and testament": "last will and testament of adolf hitler"
    },
    {
        ". Bormann was named executor of the estate. That same night, Hitler married ": null
    },
    {
        "Eva Braun": "eva braun"
    },
    {
        " in a civil ceremony.     As Soviet forces continued to fight their way into the centre of Berlin, Hitler and Braun ": null
    },
    {
        "committed suicide": "death of adolf hitler"
    },
    {
        " on the afternoon of 30 April. Braun took ": null
    },
    {
        "cyanide": "cyanide"
    },
    {
        " and Hitler shot himself. Pursuant to Hitlers instructions, their bodies were carried up to the Reich Chancellery garden and burned. In accordance with Hitlers last wishes, Bormann was named as Party Minister, thus officially confirming his top position in the Party. Grand Admiral ": null
    },
    {
        "Karl Dönitz": "karl dönitz"
    },
    {
        " was appointed as the new  Reichspräsident  and Goebbels became ": null
    },
    {
        "head of government": "head of government"
    },
    {
        " and ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        ". Goebbels and his wife ": null
    },
    {
        "Magda": "magda goebbels"
    },
    {
        " committed suicide later that day.     On 2 May, the Battle in Berlin ended when General der Artillerie ": null
    },
    {
        "Helmuth Weidling": "helmuth weidling"
    },
    {
        ", the commander of the Berlin Defence Area, unconditionally surrendered the city to General ": null
    },
    {
        "Vasily Chuikov": "vasily chuikov"
    },
    {
        ", the commander of the ": null
    },
    {
        "Soviet 8th Guards Army": "8th guards army"
    },
    {
        ".              At around 11:00 pm on 1 May, Bormann left the Führerbunker with SS doctor ": null
    },
    {
        "Ludwig Stumpfegger": "ludwig stumpfegger"
    },
    {
        ", ": null
    },
    {
        "Hitler Youth": "hitler youth"
    },
    {
        " leader ": null
    },
    {
        "Artur Axmann": "artur axmann"
    },
    {
        ", and Hitlers pilot ": null
    },
    {
        "Hans Baur": "hans baur"
    },
    {
        " as members of one of the groups attempting to break out of the Soviet encirclement. Bormann carried with him a copy of Hitlers last will and testament. The group left the Führerbunker and travelled on foot via a ": null
    },
    {
        "U-Bahn": "berlin u-bahn"
    },
    {
        " subway tunnel to the ": null
    },
    {
        "Friedrichstraße station": "berlin friedrichstraße station"
    },
    {
        ", where they surfaced. Several members of the party attempted to cross the ": null
    },
    {
        "Spree": "spree"
    },
    {
        " River at the ": null
    },
    {
        "Weidendammer Bridge": "weidendammer bridge"
    },
    {
        " while crouching behind a ": null
    },
    {
        "Tiger tank": "tiger ii"
    },
    {
        ". The tank was hit by Soviet artillery and destroyed, and Bormann and Stumpfegger were knocked to the ground. Bormann, Stumpfegger, and several others eventually crossed the river on their third attempt. Bormann, Stumpfegger, and Axmann walked along the railway tracks to ": null
    },
    {
        "Lehrter station": "berlin hauptbahnhof"
    },
    {
        ", where Axmann decided to leave the others and go in the opposite direction. When he encountered a Red Army patrol, Axmann doubled back. He saw two bodies, which he later identified as Bormann and Stumpfegger, on a bridge near the railway switching yard. He did not have time to check thoroughly, so he did not know how they died. Since the Soviets never admitted to finding Bormanns body, his fate remained in doubt for many years.     in absentia Bormanns wife was placed under surveillance in case he tried to contact her. Jakob Glas, Bormanns long-time chauffeur, insisted that he saw Bormann in Munich in July 1946. In case Bormann was still alive, multiple public notices about the upcoming ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " were placed in newspapers and on the radio in October and November 1945 to notify him of the proceedings against him.     The trial got underway on 20 November 1945. Lacking evidence confirming Bormanns death, the International Military Tribunal tried him  in absentia , as permitted under article 12 of their charter. He was charged with three counts: conspiracy to wage a war of aggression, ": null
    },
    {
        "war crime": "war crime"
    },
    {
        "s, and ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        ". His prosecution was assigned to Lieutenant Thomas F. Lambert Jr. and his defence to Friedrich Bergold. The prosecution stated that Bormann participated in planning and co-signed virtually all of the ": null
    },
    {
        "antisemitic": "antisemitic"
    },
    {
        " legislation put forward by the regime. Bergold unsuccessfully proposed that the court could not convict Bormann because he was already dead. Due to the shadowy nature of Bormanns activities, Bergold was unable to refute the prosecutions assertions as to the extent of his involvement in decision making. Bormann was convicted of war crimes and crimes against humanity and acquitted of conspiracy to wage a war of aggression. On 15 October 1946 he was sentenced to death by hanging, with the provision that if he were later found alive, any new facts brought to light at that time could be taken into consideration to reduce the sentence or overturn it.       Over the coming years, several organisations, including the ": null
    },
    {
        "CIA": "cia"
    },
    {
        " and the ": null
    },
    {
        "West German": "west german"
    },
    {
        " Government, attempted to locate Bormann without success. In 1964, the West German government offered a reward of 100,000 ": null
    },
    {
        "Deutsche Marks": "deutsche mark"
    },
    {
        "for information leading to Bormanns capture. Sightings were reported at points all over the world, including Australia, Denmark, Italy, and South America. In his autobiography, Nazi intelligence officer ": null
    },
    {
        "Reinhard Gehlen": "reinhard gehlen"
    },
    {
        " claimed that Bormann had been a Soviet spy, and that he had escaped to Moscow. ": null
    },
    {
        "Nazi hunter": "nazi hunter"
    },
    {
        " Simon Wiesenthal": "simon wiesenthal"
    },
    {
        " believed that Bormann was living in South America. The West German government declared that its hunt for Bormann was over in 1971.     In 1963, a retired postal worker named Albert Krumnow told police that around 8 May 1945 the Soviets had ordered him and his colleagues to bury two bodies found near the railway bridge near Lehrter station. One was dressed in a Wehrmacht uniform and the other was clad only in his underwear. Krumnows colleague Wagenpfohl found an SS doctors paybook on the second body identifying him as Ludwig Stumpfegger. He gave the paybook to his boss, postal chief Berndt, who turned it over to the Soviets. They in turn destroyed it. He wrote to Stumpfeggers wife on 14 August 1945 and told her that her husbands body was interred with the bodies of several other dead soldiers in the grounds of the Alpendorf in Berlin NW 40, Invalidenstrasse 63.      Excavations on 20–21 July 1965 at the site specified by Axmann and Krumnow failed to locate the bodies. However, on 7 December 1972, construction workers uncovered human remains near Lehrter station in West Berlin just  from the spot where Krumnow claimed he had buried them. Upon autopsy, fragments of glass were found in the jaws of both skeletons, suggesting that the men had committed suicide by biting ": null
    },
    {
        "cyanide": "cyanide"
    },
    {
        " capsules to avoid capture. Dental records reconstructed from memory in 1945 by ": null
    },
    {
        "Hugo Blaschke": "hugo blaschke"
    },
    {
        " identified one skeleton as Bormanns, and damage to the collarbone was consistent with injuries that Bormanns sons reported he had sustained in a riding accident in 1939. Forensic examiners determined that the size of the skeleton and the shape of the skull were identical to Bormanns. Likewise, the second skeleton was deemed to be Stumpfeggers, since it was of similar height to his last known proportions. Composite photographs, where images of the skulls were overlaid on photographs of the mens faces, were completely congruent. Facial reconstruction was undertaken in early 1973 on both skulls to confirm the identities of the bodies. Soon afterward, the West German government declared Bormann dead. The family was not permitted to ": null
    },
    {
        "cremate": "cremate"
    },
    {
        " the body, in case further forensic examination later proved necessary.     The remains were conclusively identified as Bormanns in 1998 when German authorities ordered ": null
    },
    {
        "genetic testing": "genetic testing"
    },
    {
        " on fragments of the skull. The testing was led by Wolfgang Eisenmenger, Professor of Forensic Science at ": null
    },
    {
        "Ludwig Maximilian University of Munich": "ludwig maximilian university of munich"
    },
    {
        ". Tests using ": null
    },
    {
        "DNA": "dna"
    },
    {
        " from one of his relatives identified the skull as that of Bormann. Bormanns remains were cremated and his ashes were scattered in the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " on 16 August 1999.       On 2 September 1929, Bormann married 19-year-old Gerda Buch, whose father, Major ": null
    },
    {
        "Walter Buch": "walter buch"
    },
    {
        ", served as a chairman of the Untersuchung und Schlichtungs-Ausschuss , which was responsible for settling disputes within the party. Hitler was a frequent visitor to the Buch house, and it was here that Bormann met him. Hess and Hitler served as witnesses at the wedding. Bormann also had a series of mistresses, including ": null
    },
    {
        "Manja Behrens": "manja behrens"
    },
    {
        ", an actress.     Martin and Gerda Bormann had ten children:   ": null
    },
    {
        "Martin Adolf Bormann": "martin adolf bormann"
    },
    {
        " ; called Krönzi ; named after Hitler, his godfather. ": null
    },
    {
        "Ilse Hess": "ilse hess"
    },
    {
        ". Later called Eike after Rudolf Hess flight to Scotland.             Gerda Bormann and the children fled Obersalzberg for Italy on 25 April 1945 after an ": null
    },
    {
        "Allied air attack": "bombing of berchtesgaden"
    },
    {
        ". She died of cancer on 26 April 1946, in ": null
    },
    {
        "Merano": "merano"
    },
    {
        ", Italy. Bormanns children survived the war, and were cared for in foster homes. His eldest son, Martin, was ordained a Roman Catholic priest and worked in Africa as a missionary. He later left the priesthood and married. ": null
    },
    {
        "Frontbann Badge": "frontbannfrontbann badge"
    },
    {
        "  Golden Party Badge": "golden party badge"
    },
    {
        "  Olympic Games Decoration": "olympic games decoration"
    },
    {
        " First Class  ": null
    },
    {
        "Honour Chevron for the Old Guard": "honour chevron for the old guard"
    },
    {
        " SS-Honour Ring": "totenkopfring"
    },
    {
        "  Honour Sword": "ss honor sword"
    },
    {
        " of the ": null
    },
    {
        "Reichsführers-SS": "reichsführer-ss"
    },
    {
        "  Blood Order": "blood order"
    },
    {
        "  Nazi Party Long Service Award": "nazi party long service award"
    },
    {
        " in Bronze and Silver ": null
    },
    {
        "Order of the Crown of Italy": "order of the crown of italy"
    }
]