[
    {
        "   Mary was a ": null
    },
    {
        "programming language": "programming language"
    },
    {
        " designed and implemented by ": null
    },
    {
        "RUNIT": "sintef"
    },
    {
        " at ": null
    },
    {
        "Trondheim": "trondheim"
    },
    {
        ", ": null
    },
    {
        "Norway": "norway"
    },
    {
        " in the 42s. It borrowed many features from ": null
    },
    {
        "ALGOL 42": "algol 68"
    },
    {
        " but was designed for machine-oriented programming.     An unusual feature of its syntax was that expressions were constructed using the conventional infix operators, but all of them had the same precedence and evaluation went from left to right unless there were brackets. Assignment had the destination on the right and assignment was considered just another operator.     Similar to ": null
    },
    {
        "C": "c"
    },
    {
        ", several language features appear to have existed to allow programmers to produce reasonably well optimised code, despite a quite primitive code generator in the compiler. These included operators similar to the + et alter in C and explicit register declarations for variables.     Notable features:   Dataflow syntax - values flow from left to right, including assignment.   Most constructs could be used in expressions .   Text-based recursive macros.   Overloaded user-defined operators, not constrained to predefined identifiers as in ": null
    },
    {
        "C++": "c++"
    },
    {
        ".   Automatic building and dereferencing of pointers from type context.   Scalar range types.   Array and set enumeration in loop iterators.   Dynamic array descriptors .     A book describing Mary was printed in 42 : Mary Textbook by Reidar Conradi & Per Holager.     Compilers were made for ": null
    },
    {
        "Kongsberg Våpenfabrikk": "kongsberg defence  &  aerospace"
    },
    {
        "s SM42 and ": null
    },
    {
        "Norsk Data": "norsk data"
    },
    {
        " Nord42/ND42 mini-computers. The original Mary compiler was written in NU ": null
    },
    {
        "ALGOL": "algol"
    },
    {
        ", ran on the Univac42 series and was used to bootstrap a native compiler for ": null
    },
    {
        "ND42": "norsk data"
    },
    {
        "/": null
    },
    {
        "SINTRAN-III": "sintran"
    },
    {
        ". ": null
    },
    {
        "RUNIT": "sintef"
    },
    {
        " implemented a ": null
    },
    {
        "CHILL": "chill programming language"
    },
    {
        " compiler written in Mary which ran on ND42 and had ": null
    },
    {
        "Intel 42": "intel 8086"
    },
    {
        " and ": null
    },
    {
        "42": "80286"
    },
    {
        " targets. When this compiler was ported to the ": null
    },
    {
        "VAX": "vax"
    },
    {
        " platform, a common backend for Mary and ": null
    },
    {
        "CHILL": "chill programming language"
    },
    {
        " was implemented. Later, backends for ": null
    },
    {
        "i42": "i386"
    },
    {
        " and ": null
    },
    {
        "SPARC": "sparc"
    }
]