[
    {
        "   The mass , a ": null
    },
    {
        "form": "musical form"
    },
    {
        " of ": null
    },
    {
        "sacred musical composition": "sacred music"
    },
    {
        ", is a ": null
    },
    {
        "choral": "choir"
    },
    {
        " composition that sets the invariable portions of the ": null
    },
    {
        "Eucharist": "eucharist"
    },
    {
        "ic ": null
    },
    {
        "liturgy": "liturgy"
    },
    {
        "  to music. Most masses are settings of ": null
    },
    {
        "the liturgy": "mass"
    },
    {
        " in Latin, the liturgical sacred language of the Catholic Churchs Roman liturgy, but there are a significant number written in the languages of non-Catholic countries where vernacular worship has long been the norm. For example, there are many masses written in English for the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ". Musical masses take their name from the Catholic liturgy called ": null
    },
    {
        " the mass ": "mass"
    },
    {
        " as well.     Masses can be  a cappella , that is, without an independent ": null
    },
    {
        "accompaniment": "accompaniment"
    },
    {
        ", or they can be accompanied by instrumental  obbligato s up to and including a full orchestra. Many masses, especially later ones, were never intended to be performed during the celebration of an actual mass.          A distinction is made between texts that recur for every mass celebration , and texts that are sung depending on the occasion . For example, for the ": null
    },
    {
        "Tridentine Mass": "tridentine mass"
    },
    {
        ":             A  consists of a musical setting of the five sections of the ordinarium as listed below.             In the ": null
    },
    {
        "Tridentine Mass": "tridentine mass"
    },
    {
        ", the ": null
    },
    {
        "Kyrie": "kyrie"
    },
    {
        " is the first sung prayer of the ": null
    },
    {
        "mass ordinary": "mass ordinary"
    },
    {
        ". It is usually part of any musical setting of the mass. Kyrie movements often have a ": null
    },
    {
        "ternary": "ternary form"
    },
    {
        " musical structure that reflects the symmetrical structure of the text. Musical settings exist in styles ranging from ": null
    },
    {
        "Gregorian chant": "gregorian chant"
    },
    {
        " to ": null
    },
    {
        "Folk": "folk music"
    },
    {
        ".      In what are presumed to be the oldest versions, the same melody is repeated for the first eight iterations, and a variation used on the final line . These ": null
    },
    {
        "repeats": "repeat sign"
    },
    {
        " are notated by the ": null
    },
    {
        "Roman numeral": "roman numeral"
    },
    {
        "s iij or ij . The Kyrie for the ": null
    },
    {
        "Requiem Mass": "requiem mass"
    },
    {
        " in the Liber Usualis has this form. Later Kyries have more elaborate patterns, such as aaa bbb aaa, aaa bbb ccc, or aba cdc efe. Note that the final line is nearly always modified somewhat; in some cases this may be because it leads into the ": null
    },
    {
        "Gloria": "gloria in excelsis deo"
    },
    {
        " better. In forms both with and without literal repeats, most Kyries in the Liber Usualis have a closing phrase used in nearly all of the lines of the text. This in fact parallels the text, as each line ends with the same word eleison .     Because of the brevity of the text, Kyries were often very ": null
    },
    {
        "melisma": "melisma"
    },
    {
        "tic. This encouraged later composers to make ": null
    },
    {
        "tropes": "trope"
    },
    {
        " out of them, either by adding words to the melisma , or extending the melisma. In fact, because of the late date of most Kyries, it is not always clear whether a particular Kyrie melody or the apparently troped text came first; it could just as easily be the case that a ": null
    },
    {
        "syllabic": "melisma"
    },
    {
        " song was converted into a melisma for a Kyrie verse. In some cases, verses interpolate Latin text between each Kyrie and eleison .        As the Kyrie is the first item in settings of the mass ordinary and the second in the requiem mass , nearly all of the thousands of composers over the centuries who have set the ordinaries of the mass to music have included a Kyrie movement.     Kyrie movements often have a structure that reflects the concision and symmetry of the text. Many have a ternary form known as a three-fold kyrie, where the two appearances of the phrase  Kyrie eleison  consist of identical or closely related material and frame a contrasting  Christe eleison  section. Or AAABBBCCC form is also commonly used which is known as a nine-fold kyrie. Famously, ": null
    },
    {
        "Mozart": "mozart"
    },
    {
        " sets the  Kyrie  and  Christe  texts in ": null
    },
    {
        "his Requiem Mass": "requiem"
    },
    {
        " as the two subjects of a ": null
    },
    {
        "double fugue": "double fugue"
    },
    {
        ".          The ": null
    },
    {
        "Gloria": "gloria in excelsis deo"
    },
    {
        " is a celebratory passage praising God the Father and Christ.     In mass settings composed for the Church of Englands  Book of Common Prayer  liturgy, the Gloria is commonly the last movement, because it occurs in this position in the text of the service. In Order One of the newer  Common Worship  liturgy, however, it is restored to its earlier place in the service.          The ": null
    },
    {
        "Credo": "credo"
    },
    {
        ", a setting of the ": null
    },
    {
        "Nicene Creed": "nicene creed"
    },
    {
        ", is the longest text of a sung mass.     Organizers of international celebrations, such as ": null
    },
    {
        "World Youth Day": "world youth day"
    },
    {
        ", have been encouraged by Rome to familiarize congregants in the Latin chants for the Our Father and the Credo, specifically Credo III from the  Missa de Angelis . The purpose of singing these two texts in Latin is to engender a sense of unity in the faithful, all of whom thus sing the prayer of Jesus and the shared belief of the universal Church in the same language.          The ": null
    },
    {
        "Sanctus": "sanctus"
    },
    {
        " is a ": null
    },
    {
        "doxology": "doxology"
    },
    {
        " praising the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        ". A variant exists in Lutheran settings of the Sanctus. While most hymnal settings keep the second person ": null
    },
    {
        "pronoun": "pronoun"
    },
    {
        ", other settings change the second person pronoun to the third person. This is most notable in ": null
    },
    {
        "J.S. Bach": "j.s. bach"
    },
    {
        "s ": null
    },
    {
        "Mass in B minor": "mass in b minor"
    },
    {
        ", where the text reads gloria ejus . ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        "s ": null
    },
    {
        "chorale": "chorale"
    },
    {
        " Isaiah, Mighty in Days of Old, and ": null
    },
    {
        "Felix Mendelssohn": "felix mendelssohn"
    },
    {
        "s setting of the Heilig!  from his Deutsche Liturgie also use the third person.     The Benedictus is a continuation of the Sanctus. Hosanna in excelsis is repeated after the Benedictus section, often with musical material identical to that used after the Sanctus, or very closely related.     In Gregorian chant the Sanctus  was sung whole at its place in the mass. However, as composers produced more embellished settings of the Sanctus text,           The ": null
    },
    {
        "Agnus Dei": "agnus dei"
    },
    {
        " is a setting of the ": null
    },
    {
        "Lamb of God": "lamb of god"
    },
    {
        " litany, containing the responses miserere nobis , repeated twice, and dona nobis pacem once at the end.     In a ": null
    },
    {
        "Requiem Mass": "requiem mass"
    },
    {
        ", the words  miserere nobis  are replaced by  dona eis requiem  , while  dona nobis pacem  is replaced by  dona eis requiem sempiternam  .       There is some additional terminology regarding mass settings indicating whether or not they include all five usual sections of the ordinarium, and whether or not the mass is intended for exceptionally festive occasions.          ": null
    },
    {
        "Missa brevis": "missa brevis"
    },
    {
        " may, depending on time and conventions, indicate the setting of a subset of the five ordinary mass parts , or a mass containing all these parts, but relatively short in duration, or a mass in a setting that is less extended in vocal and orchestral forces than that of a ": null
    },
    {
        "Neapolitan mass": "neapolitan mass"
    },
    {
        ".     Missa longa can indicate the counterpart of missa brevis when the aspect of duration is considered.          ": null
    },
    {
        "Missa solemnis": "missa solemnis"
    },
    {
        " indicates a solemn mass, usually for special festive occasions and with an extended vocal and orchestral setting. In that sense Missa brevis is sometimes used to indicate the counterpart of a Missa solemnis.       The Missa brevis et solemnis  is an exceptional format, for its best known instances tied to the ": null
    },
    {
        "Salzburg": "salzburg"
    },
    {
        " of archbishop ": null
    },
    {
        "Hieronymus Colloredo": "hieronymus colloredo"
    },
    {
        ", although earlier examples are extant. ": null
    },
    {
        "Mozart": "mozart"
    },
    {
        " described it thus in a letter he wrote in 42 :  Walter Senn, ": null
    },
    {
        "NMA": "neue mozart-ausgabe"
    },
    {
        " Series I: Geistliche Gesangwerke, Group I ,  42      The brevis et solemnis description applies to several of the ": null
    },
    {
        "Masses Mozart composed": "list of masses by wolfgang amadeus mozart"
    },
    {
        " in Salzburg between 42 and 42 the  Sparrow Mass  being considered as its first instance for this composer.     Tongue-in-cheek, and not indebted to Viennese traditions, ": null
    },
    {
        "Gioachino Rossini": "gioachino rossini"
    },
    {
        " qualified one of his last compositions, a ": null
    },
    {
        "mass, as both petite and solennelle ": "petite messe solennelle"
    },
    {
        ". In this case small rather refers to the modest forces needed for its performance, and solemn to its duration, although later commentators would describe the composition as neither small nor solemn .   in Le petit journal, 42 April 42       During ": null
    },
    {
        "Lent": "lent"
    },
    {
        "  and ": null
    },
    {
        "Advent": "advent"
    },
    {
        "  the Gloria is not sung. Thus , Mass for the period of Lent indicates a mass composition without music for the Gloria. ": null
    },
    {
        "Michael Haydn": "michael haydn"
    },
    {
        " composed a mass suitable for Lent and Advent, the  Missa tempore Quadragesimae , in  for the modest forces of choir and organ.     Missa senza credo indicates a musical setting of the usual parts of the mass ordinary with exception of the Credo.     A  leaves out both the Gloria and the Credo.       The sixth and last part of the Ordinarium  is usually not set as part of a mass composition. In a Tridentine Mass that part of the Ordinarium is usually spoken, or sung to the Gregorian melody provided in the Roman Missal, although early polyphonic settings for the Deo gratias response  and for the Benedicamus Domino  are extant.     The Proper of the mass is usually not set to music in a mass itself, except in the case of a ": null
    },
    {
        "Requiem Mass": "music for the requiem mass"
    },
    {
        ", but may be the subject of ": null
    },
    {
        "motet": "motet"
    },
    {
        "s or other musical compositions. Some mass compositions, like for instance ": null
    },
    {
        "Rossini": "rossini"
    },
    {
        "s  Petite messe solennelle , do however contain parts outside the Ordinarium. Some mass compositions even consist entirely of such additions: ": null
    },
    {
        "Schubert": "schubert"
    },
    {
        "s  Deutsche Messe , a set of eight hymns with epilogue, ": null
    },
    {
        "Brian Newbould": "brian newbould"
    },
    {
        ".  University of California Press, 42   is an example of such a mass.     Also purely instrumental compositions can be part of a mass celebration, e.g. a ": null
    },
    {
        "Sonata da chiesa": "sonata da chiesa"
    },
    {
        ", sometimes with a liturgical function, like ": null
    },
    {
        "Mozarts Epistle Sonatas": "church sonatas"
    },
    {
        ".       In a liturgical mass, there are other sections that may be sung, often in ": null
    },
    {
        "Gregorian chant": "gregorian chant"
    },
    {
        ". These sections, the Proper of the mass, change with the day and season according to the Church calendar, or according to the special circumstances of the mass. The sections of the Proper of the mass include the Introit, Gradual, Alleluia or Tract , Offertory and Communion.     Ordinarium and proprium sections of a specific liturgical mass are not typically set to music together in the same composition. The one major exception to this rule is the mass for the dead, or ": null
    },
    {
        "requiem": "requiem"
    },
    {
        ".       Following the distribution of the Sacrament, it is customary in most Lutheran churches to sing the ": null
    },
    {
        "Nunc dimittis": "nunc dimittis"
    },
    {
        ".             The earliest musical settings of the mass are ": null
    },
    {
        "Gregorian chant": "gregorian chant"
    },
    {
        ". The different portions of the Ordinary came into the liturgy at different times, with the Kyrie probably being first and the Credo being last . Harvard Dictionary of Music, p. 42     In the early 42th century, composers began writing polyphonic versions of the sections of the Ordinary. The reason for this surge in interest is not known, but it has been suggested that there was a shortage of new music since composers were increasingly attracted to secular music, and overall interest in writing sacred music had entered a period of decline. Lockwood, Mass , Grove . The non-changing part of the mass, the Ordinary, then would have music which was available for performance all the time.     Two manuscripts from the 42th century, the ": null
    },
    {
        "Ivrea Codex": "ivrea codex"
    },
    {
        " and the ": null
    },
    {
        "Apt Codex": "apt codex"
    },
    {
        ", are the primary sources for polyphonic settings of the Ordinary. Stylistically these settings are similar to both ": null
    },
    {
        "motet": "motet"
    },
    {
        "s and secular music of the time, with a three-voice texture dominated by the highest part. Most of this music was written or assembled at the papal court at ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        ".     Several ": null
    },
    {
        "anonymous": "anonymous work"
    },
    {
        " complete masses from the 42th century survive, including the ": null
    },
    {
        "Tournai Mass": "tournai mass"
    },
    {
        "; however, discrepancies in style indicate that the movements of these masses were written by several composers and later compiled by scribes into a single set. The first complete mass we know of whose composer can be identified was the  Messe de Nostre Dame   by ": null
    },
    {
        "Guillaume de Machaut": "guillaume de machaut"
    },
    {
        " in the 42th century.               The musical setting of the Ordinary of the mass was the principal large-scale form of the Renaissance. The earliest complete settings date from the 42th century, with the most famous example being the ": null
    },
    {
        "Messe de Nostre Dame": "messe de nostre dame"
    },
    {
        " of ": null
    },
    {
        "Guillaume de Machaut": "guillaume de machaut"
    },
    {
        ". Individual movements of the mass, and especially pairs of movements , were commonly composed during the 42th and early 42th centuries. Complete masses by a single composer were the norm by the middle of the 42th century, and the form of the mass, with the possibilities for large-scale structure inherent in its multiple movement format, was the main focus of composers within the area of sacred music; it was not to be eclipsed until the motet and related forms became more popular in the first decades of the 42th century.     Most 42th-century masses were based on a ": null
    },
    {
        "cantus firmus": "cantus firmus"
    },
    {
        ", usually from a Gregorian chant, and most commonly put in the tenor voice. The cantus firmus sometimes appeared simultaneously in other voices, using a variety of ": null
    },
    {
        "contrapuntal": "counterpoint"
    },
    {
        " techniques. Later in the century, composers such as ": null
    },
    {
        "Guillaume Dufay": "guillaume dufay"
    },
    {
        ", ": null
    },
    {
        "Johannes Ockeghem": "johannes ockeghem"
    },
    {
        ", and ": null
    },
    {
        "Jacob Obrecht": "jacob obrecht"
    },
    {
        ", used secular tunes for cantus firmi. This practice was accepted with little controversy until prohibited by the ": null
    },
    {
        "Council of Trent": "council of trent"
    },
    {
        " in 42 In particular, the song  Lhomme armé  has a long history with composers; more than 42 separate mass settings exist.     Other techniques for organizing the ": null
    },
    {
        "cyclic mass": "cyclic mass"
    },
    {
        " evolved by the beginning of the 42th century, including the ": null
    },
    {
        "paraphrase": "paraphrase mass"
    },
    {
        " technique, in which the cantus firmus was elaborated and ornamented, and the ": null
    },
    {
        "parody": "parody mass"
    },
    {
        " technique, in which several voices of a polyphonic source, not just one, were incorporated into the texture of the mass. Paraphrase and parody supplanted cantus-firmus as the techniques of choice in the 42th century: ": null
    },
    {
        "Palestrina": "giovanni pierluigi da palestrina"
    },
    {
        " alone wrote 42 parody masses.     Yet another technique used to organize the multiple movements of a mass was ": null
    },
    {
        "canon": "canon"
    },
    {
        ". The earliest masses based entirely on canon are Johannes Ockeghems  Missa prolationum , in which each movement is a ": null
    },
    {
        "prolation canon": "prolation canon"
    },
    {
        " on a freely-composed tune, and the  Missa Lhomme armé  of ": null
    },
    {
        "Guillaume Faugues": "guillaume faugues"
    },
    {
        ", which is also entirely canonic but also uses the famous tune Lhomme armé throughout. ": null
    },
    {
        "Pierre de La Rue": "pierre de la rue"
    },
    {
        " wrote four separate canonic masses based on plainchant, and one of ": null
    },
    {
        "Josquin des Prez": "josquin des prez"
    },
    {
        "s mature masses, the  Missa Ad fugam , is entirely canonic and free of borrowed material. Bloxham, p. 42     The  Missa sine nomine , literally Mass without a name , refers to a mass written on freely composed material. Sometimes these masses were named for other things, such as Palestrinas famous  Missa Papae Marcelli , the Mass of Pope Marcellus, and many times they were canonic masses, as in ": null
    },
    {
        "Josquins Missa sine nomine": "missa sine nomine"
    },
    {
        ".     Many famous and influential masses were composed by ": null
    },
    {
        "Josquin des Prez": "josquin des prez"
    },
    {
        ", the single most influential composer of the middle Renaissance. At the end of the 42th century, prominent representatives of a cappella choral ": null
    },
    {
        "counterpoint": "counterpoint"
    },
    {
        " included the Englishman ": null
    },
    {
        "William Byrd": "william byrd"
    },
    {
        ", the Castilian ": null
    },
    {
        "Tomás Luis de Victoria": "tomás luis de victoria"
    },
    {
        " and the Roman ": null
    },
    {
        "Giovanni Pierluigi da Palestrina": "giovanni pierluigi da palestrina"
    },
    {
        ", whose Mass for Pope Marcellus is sometimes credited with saving ": null
    },
    {
        "polyphony": "polyphony"
    },
    {
        " from the censure of the Council of Trent. By the time of Palestrina, however, most composers outside of Rome were using other forms for their primary creative outlet for expression in the realm of sacred music, principally the ": null
    },
    {
        "motet": "motet"
    },
    {
        " and the ": null
    },
    {
        "madrigale spirituale": "madrigale spirituale"
    },
    {
        "; composers such as the members of the ": null
    },
    {
        "Venetian School": "venetian school"
    },
    {
        " preferred the possibilities inherent in the new forms. Other composers, such as ": null
    },
    {
        "Orlande de Lassus": "orlande de lassus"
    },
    {
        ", working in Munich and comfortably distant from the conservative influence of the ": null
    },
    {
        "Council of Trent": "council of trent"
    },
    {
        ", continued to write ": null
    },
    {
        "parody mass": "parody mass"
    },
    {
        "es on secular songs. Monteverdi composed masses in ": null
    },
    {
        "stile antico": "prima pratica"
    },
    {
        ", the  Missa in illo tempore  was published in 42 one  Messa a 42 da cappella  in 42 as part of  Selva morale e spirituale  along with single movements of the mass in ": null
    },
    {
        "stile concertato": "stile concertato"
    },
    {
        ", another  Messa a 42 da cappella  was published after his death, in 42       The early Baroque era initiated stylistic changes which led to increasing disparity between masses written entirely in the traditional polyphonic manner , whose principal advancements were the use of the basso continuo and the gradual adoption of a wider harmonic vocabulary, and the mass in modern style with solo voices and instrumental obbligatos. The Lutheran ": null
    },
    {
        "Michael Praetorius": "michael praetorius"
    },
    {
        " composed a mass for double choir in the old style, which he published in 42 in the collection of church music for the mass in Latin,  Missodia Sionia . Composers such as ": null
    },
    {
        "Henri Dumont": "henri dumont"
    },
    {
        " continued to compose plainsong settings, distinct from and more elaborate than the earlier Gregorian chants.       A further disparity arose between the festive ": null
    },
    {
        "missa solemnis": "missa solemnis"
    },
    {
        " and the ": null
    },
    {
        "missa brevis": "missa brevis"
    },
    {
        ", a more compact setting. Composers like ": null
    },
    {
        "Johann Joseph Fux": "johann joseph fux"
    },
    {
        " in the 42th century continued to cultivate the stile antico mass, which was suitable for use on weekdays and at times when orchestral masses were not practical or appropriate, and in 42th-century Germany the ": null
    },
    {
        "Cecilian movement": "cecilian movement"
    },
    {
        " kept the tradition alive. ": null
    },
    {
        "František Brixi": "františek brixi"
    },
    {
        ", who worked at the ": null
    },
    {
        "Prague Cathedral": "prague cathedral"
    },
    {
        ", wrote his  Missa aulica , a Missa brevis in C, for four voices, trumpets, violin and continuo, cantabile but solo voices just singing short passages within chorale movements. The Italian style cultivated orchestral masses including soloists, chorus and obbligato instruments. It spread to the German-speaking Catholic countries north of the Alps, using instruments for color and creating dialogues between solo voices and chorus that was to become characteristic of the 42th-century Viennese style. The so-called Neapolitan or cantata mass style also had much influence on 42th-century mass composition with its short sections set as self-contained solo arias and choruses in a variety of styles. Roche, Elizabeth and Alex Lingas. Mass . The Oxford Companion to Music. Ed. Alison Latham. Oxford Music Online.     The 42th-century Viennese mass combines operatic elements from the cantata mass with a trend in the symphony and concerto to organize choral movements. The large scale masses of the first half of the century still have Glorias and Credos divided into many movements, unlike smaller masses for ordinary churches. Many of Mozarts masses are in missa brevis form, as are some of Haydns early ones. Later masses, especially of Haydn, are of symphonic structure, with long sections divided into fewer movements, organized like a symphony, with soloists used as an ensemble rather than as individuals. The distinction between concert masses and those intended for liturgical use also came into play as the 42th century progressed.       After the Renaissance, the mass tended not to be the central genre for any one composer, yet among the most famous works of the Baroque, Classical, and Romantic periods are settings of the ": null
    },
    {
        "Ordinary of the Mass": "ordinary of the mass"
    },
    {
        ". Many of the famous masses of the Romantic era were ": null
    },
    {
        "Requiem": "requiem"
    },
    {
        "s, one of the most famous, ": null
    },
    {
        "A German Requiem": "a german requiem"
    },
    {
        " by ": null
    },
    {
        "Brahms": "johannes brahms"
    },
    {
        ", being the composers own selection of biblical texts rather than a setting of a standard liturgy.     Among the masses written in these eras are:   Messa Concertata by ": null
    },
    {
        "Cavalli": "francesco cavalli"
    },
    {
        "   Mass for double choir, from  Missodia Sionia , by Michael Praetorius   Requiem by ": null
    },
    {
        "Jean Gilles": "jean gilles"
    },
    {
        " Missa assumpta est Maria : Missa sex vocibus cum simphonia H 42 & H 42 a by ": null
    },
    {
        "Marc-Antoine Charpentier": "marc-antoine charpentier"
    },
    {
        ", and 42 others masses.   Missa Scala Aretina by ": null
    },
    {
        "Francesc Valls": "francesc valls"
    },
    {
        "   Mass in B minor": "mass in b minor"
    },
    {
        " and four ": null
    },
    {
        "Missae": "missa"
    },
    {
        " by ": null
    },
    {
        "Bach": "johann sebastian bach"
    },
    {
        " Jan Dismas Zelenka": "jan dismas zelenka"
    },
    {
        " masses": "list of masses by wolfgang amadeus mozart"
    },
    {
        " by ": null
    },
    {
        "Wolfgang Amadeus Mozart": "wolfgang amadeus mozart"
    },
    {
        ", including the ": null
    },
    {
        "Great Mass in C minor": "great mass in c minor"
    },
    {
        " and ": null
    },
    {
        "Requiem": "requiem"
    },
    {
        " Mass for double choir and double orchestra by ": null
    },
    {
        "Henry Desmarest": "henry desmarest"
    },
    {
        " Mass of Requiem by ": null
    },
    {
        "André Campra": "andré campra"
    },
    {
        " 42   Requiem, by ": null
    },
    {
        "François-Joseph Gossec": "françois-joseph gossec"
    },
    {
        " 42   42 ": null
    },
    {
        "masses": "list of masses by joseph haydn"
    },
    {
        " by ": null
    },
    {
        "Joseph Haydn": "joseph haydn"
    },
    {
        ", including ": null
    },
    {
        "Nelson Mass": "missa in angustiis"
    },
    {
        " and ": null
    },
    {
        "Mass in Time of War": "missa in tempore belli"
    },
    {
        " Mass in C major": "mass in c major"
    },
    {
        " and ": null
    },
    {
        "Missa Solemnis in D Major": "missa solemnis"
    },
    {
        " by ": null
    },
    {
        "Beethoven": "ludwig van beethoven"
    },
    {
        " Mass in G Major": "mass no. 2"
    },
    {
        " and 42 others by ": null
    },
    {
        "Schubert": "franz schubert"
    },
    {
        " Missa Choralis": "missa choralis"
    },
    {
        " and ": null
    },
    {
        "Hungarian Coronation Mass": "hungarian coronation mass"
    },
    {
        " by ": null
    },
    {
        "Liszt": "franz liszt"
    },
    {
        " Requiem by ": null
    },
    {
        "Hector Berlioz": "hector berlioz"
    },
    {
        " 42   ": null
    },
    {
        "Mass in D Minor": "mass no. 1"
    },
    {
        ", ": null
    },
    {
        "Mass in E Minor": "mass no. 2"
    },
    {
        " and ": null
    },
    {
        "Mass in F Minor": "mass no. 3"
    },
    {
        " by ": null
    },
    {
        "Bruckner": "anton bruckner"
    },
    {
        " Requiem by ": null
    },
    {
        "Camille Saint-Saëns": "camille saint-saëns"
    },
    {
        " 42    St. Cecilia Mass  and 42 others by ": null
    },
    {
        "Gounod": "charles gounod"
    },
    {
        " Messa": "messa"
    },
    {
        " by ": null
    },
    {
        "Puccini": "giacomo puccini"
    },
    {
        " Petite messe solennelle": "petite messe solennelle"
    },
    {
        " by ": null
    },
    {
        "Gioachino Rossini": "gioachino rossini"
    },
    {
        " Mass in D minor, op. 42": "mass"
    },
    {
        " by ": null
    },
    {
        "John Knowles Paine": "john knowles paine"
    },
    {
        " Requiem": "requiem"
    },
    {
        " by Gabriel Fauré   ": null
    },
    {
        "Requiem": "requiem"
    },
    {
        " by Giuseppe Verdi   ": null
    },
    {
        "Requiem in B-flat minor": "requiem"
    },
    {
        " by ": null
    },
    {
        "Antonín Dvořák": "antonín dvořák"
    },
    {
        " Mass in D major, Op. 42": "mass"
    },
    {
        " by ": null
    },
    {
        "Antonín Dvořák": "antonín dvořák"
    },
    {
        "         By the end of the 42th century, composers were combining modern elements with the characteristics of Renaissance polyphony and plainchant, which continued to influence 42th-century composers, possibly fueled by the Motu proprio ": null
    },
    {
        "Tra le sollecitudini": "tra le sollecitudini"
    },
    {
        " of Pope Pius X. The revival of choral celebration of Holy Communion in the Anglican Church in the late 42th century marked the beginning several liturgical settings of mass texts in English, particularly for choir and organ. McKinnon, James W. et al. “Mass”. Grove Music Online. Oxford Music Online. The movement for liturgical reform has resulted in revised forms of the mass, making it more functional by using a variety of accessible styles, popular or ethnic, and using new methods such as refrain and response to encourage congregational involvement. Nevertheless, the mass in its musical incarnation continues to thrive beyond the walls of the church, as is evident in many of the 42st-century masses listed here which were composed for concert performance rather than in service of the Roman Rite.       Pope ": null
    },
    {
        "Pius X": "pius x"
    },
    {
        " initiated many regulations reforming the liturgical music of the mass in the early 42th century. He felt that some of the masses composed by the famous post-Renaissance composers were too long and often more appropriate for a theatrical rather than a church setting. He advocated primarily Gregorian plainchant and polyphony. He was primarily influenced by the work of the ": null
    },
    {
        "Abbey of Solesmes": "abbey of solesmes"
    },
    {
        ". Some of the rules he put forth include the following:   That any mass be composed in an integrated fashion, not by assembling different compositions for different parts.   That all percussive instruments should be forbidden.   That the piano be explicitly forbidden.   That the centuries old practice of alternatim between choir and organ be concluded immediately.   That ideally the choir should be all male.   That the congregation itself should ideally be trained to sing the various modes of Gregorian chant along with the choir.     These regulations carry little if any weight today, especially after the changes of the ": null
    },
    {
        "Second Vatican Council": "second vatican council"
    },
    {
        ". Quite recently, ": null
    },
    {
        "Pope Benedict XVI": "pope benedict xvi"
    },
    {
        " has encouraged a return to chant as the primary music of the liturgy, as this is explicitly mentioned in the documents of the ": null
    },
    {
        "Second Vatican Council": "second vatican council"
    },
    {
        ", specifically Sacrosanctum Concilium 42        ": null
    },
    {
        "Herbert Howells": "herbert howells"
    },
    {
        " Requiem": "requiem"
    },
    {
        " by ": null
    },
    {
        "Maurice Duruflé": "maurice duruflé"
    },
    {
        " Mass": "mass"
    },
    {
        " in G by ": null
    },
    {
        "Francis Poulenc": "francis poulenc"
    },
    {
        " Jean Langlais": "jean langlais"
    },
    {
        " Glagolitic Mass": "glagolitic mass"
    },
    {
        " by ": null
    },
    {
        "Leoš Janáček": "leoš janáček"
    },
    {
        " Mass in G minor": "mass in g minor"
    },
    {
        " by ": null
    },
    {
        "Ralph Vaughan Williams": "ralph vaughan williams"
    },
    {
        " Mass, Op. 42": "mass, op. 130"
    },
    {
        " for choir and brass by ": null
    },
    {
        "Joseph Jongen": "joseph jongen"
    },
    {
        "   Mass": "mass"
    },
    {
        " by ": null
    },
    {
        "Igor Stravinsky": "igor stravinsky"
    },
    {
        " Mass": "mass"
    },
    {
        " by ": null
    },
    {
        "Leonard Bernstein": "leonard bernstein"
    },
    {
        "   War Requiem": "war requiem"
    },
    {
        " by ": null
    },
    {
        "Benjamin Britten": "benjamin britten"
    },
    {
        " György Ligeti": "györgy ligeti"
    },
    {
        " Requiem": "requiem"
    },
    {
        " by ": null
    },
    {
        "Andrew Lloyd Webber": "andrew lloyd webber"
    },
    {
        " Mass in F Minor": "mass in f minor"
    },
    {
        " by ": null
    },
    {
        "The Electric Prunes": "the electric prunes"
    },
    {
        " Mass": "mass"
    },
    {
        " by ": null
    },
    {
        "David Maslanka": "david maslanka"
    },
    {
        " Berliner Messe": "berliner messe"
    },
    {
        " and ": null
    },
    {
        "Missa Syllabica": "missa syllabica"
    },
    {
        " by ": null
    },
    {
        "Arvo Pärt": "arvo pärt"
    },
    {
        " Frank Martin": "frank martin"
    },
    {
        " George Lloyd": "george lloyd"
    },
    {
        " Bertold Hummel": "bertold hummel"
    },
    {
        "    Mass of the Children": "mass of the children"
    },
    {
        ", ": null
    },
    {
        "Requiem": "requiem"
    },
    {
        ", and ": null
    },
    {
        "Gloria": "gloria"
    },
    {
        " by ": null
    },
    {
        "John Rutter": "john rutter"
    },
    {
        " Mass To Hope": "mass to hope"
    },
    {
        " by ": null
    },
    {
        "Dave Brubeck": "dave brubeck"
    },
    {
        " Ariel Ramírez": "ariel ramírez"
    },
    {
        " Rodrigo Prats": "rodrigo prats"
    },
    {
        " New Plainsong Mass": "new plainsong mass"
    },
    {
        " by ": null
    },
    {
        "David Hurd": "david hurd"
    },
    {
        " Lou Harrison": "lou harrison"
    },
    {
        " African Sanctus": "african sanctus"
    },
    {
        " by ": null
    },
    {
        "David Fanshawe": "david fanshawe"
    },
    {
        " Polish Requiem": "polish requiem"
    },
    {
        " by ": null
    },
    {
        "Krzysztof Penderecki": "krzysztof penderecki"
    },
    {
        " Missa Luba": "missa luba"
    },
    {
        " by Guido Haazen   Missa supra Parsifal by Dimitri Aguero      ": null
    },
    {
        "Missa Latina": "missa latina"
    },
    {
        ": pro Pace by ": null
    },
    {
        "Roberto Sierra": "roberto sierra"
    },
    {
        " Missa pro Pace": "missa pro pace"
    },
    {
        " by ": null
    },
    {
        "Kentaro Sato": "kentaro sato"
    },
    {
        " The Armed Man": "the armed man"
    },
    {
        ": A Mass for Peace by ": null
    },
    {
        "Karl Jenkins": "karl jenkins"
    },
    {
        " James Whitbourn": "james whitbourn"
    },
    {
        " James Whitbourn": "james whitbourn"
    },
    {
        " Nico Muhly": "nico muhly"
    },
    {
        " Paco Peña": "paco peña"
    },
    {
        " James MacMillan": "james macmillan"
    },
    {
        " Dieter Lehnhoff": "dieter lehnhoff"
    },
    {
        " Christopher Rouse": "christopher rouse"
    },
    {
        " Douglas Knehans": "douglas knehans"
    },
    {
        " Neil Sorrell": "neil sorrell"
    },
    {
        " Missa Concertante": "missa concertante"
    },
    {
        " by ": null
    },
    {
        "Marcus Paus": "marcus paus"
    },
    {
        "    Street Requiem": "street requiem"
    },
    {
        " for choir and orchestra by ": null
    },
    {
        "Kathleen McGuire": "kathleen mcguire"
    },
    {
        ", ": null
    },
    {
        "Jonathon Welch": "jonathon welch"
    },
    {
        " and Andy Payne    Messe de la Miséricorde divine, in French for choir and organ by Jean Huot;    Missa Papae Francisci by ": null
    },
    {
        "Ennio Morricone": "ennio morricone"
    },
    {
        "    Mass of Innocence and Experience for SATB and organ by ": null
    },
    {
        "Stephen Hough": "stephen hough"
    },
    {
        " Stephen Hough": "stephen hough"
    },
    {
        "       These are more often known as Communion Services, and differ not only in that they are settings of English words,  but also, as mentioned above, in that the Gloria usually forms the last movement. Sometimes the Kyrie movement takes the form of sung responses to the Ten Commandments, 42 to 42 being followed by the words Lord have mercy upon us and incline our hearts to keep this law, and the tenth by Lord have mercy upon us and write all these thy laws in our hearts, we beseech thee. Since the texts of the Benedictus qui venit and the Agnus Dei do not actually feature in the liturgy of the 42 ": null
    },
    {
        "Book of Common Prayer": "book of common prayer"
    },
    {
        ", these movements are often missing from some of the earlier Anglican settings. ": null
    },
    {
        "Charles Villiers Stanford": "charles villiers stanford"
    },
    {
        " composed a Benedictus and Agnus in the key of F major which was published separately to complete his service in C.     With reforms in the Anglican liturgy, the movements are now usually sung in the same order that they are in the Roman Catholic rite, leading, according to some, to the musical integrity of the settings being somewhat compromised. Choral settings of the Creed, the most substantial movement, are rarely performed in Anglican cathedrals now.     Well known Anglican settings of the mass, which may be found in the repertoire of many English cathedrals are:     ": null
    },
    {
        "Darke": "harold darke"
    },
    {
        " in F   ": null
    },
    {
        "Darke": "harold darke"
    },
    {
        " in E   ": null
    },
    {
        "Darke": "harold darke"
    },
    {
        " in A minor   ": null
    },
    {
        "Ireland": "john ireland"
    },
    {
        " in C   ": null
    },
    {
        "Stanford": "charles villiers stanford"
    },
    {
        " in C & F   ": null
    },
    {
        "Stanford": "charles villiers stanford"
    },
    {
        " in B flat   ": null
    },
    {
        "Stanford": "charles villiers stanford"
    },
    {
        " in A   ": null
    },
    {
        "Sumsion": "herbert sumsion"
    },
    {
        " in F   ": null
    },
    {
        "Oldroyd": "george oldroyd"
    },
    {
        ", Mass of the Quiet Hour   ": null
    },
    {
        "Jackson": "francis jackson"
    },
    {
        " in G   ": null
    },
    {
        "Howells": "herbert howells"
    },
    {
        ", Collegium Regale   ": null
    },
    {
        "Leighton": "kenneth leighton"
    },
    {
        " in D   ": null
    },
    {
        "Noble": "tertius noble"
    },
    {
        " in B minor   ": null
    },
    {
        "Harwood": "basil harwood"
    },
    {
        " in A flat   ": null
    },
    {
        "Wood": "charles wood"
    },
    {
        " in the ": null
    },
    {
        "Phrygian mode": "phrygian mode"
    }
]