[
    {
        "     Masterpiece  is a drama ": null
    },
    {
        "anthology television series": "anthology television series"
    },
    {
        " produced by ": null
    },
    {
        "WGBH Boston": "wgbh-tv"
    },
    {
        ". It premiered on ": null
    },
    {
        "Public Broadcasting Service": "public broadcasting service"
    },
    {
        " on January 42 42 making it Americas longest-running weekly ": null
    },
    {
        "prime time": "prime time"
    },
    {
        " drama series. The series has presented numerous acclaimed British productions. Many of these are produced by the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ", but the line-up has also included programs shown on the UK commercial channels ": null
    },
    {
        "ITV": "itv"
    },
    {
        " and ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        ".       Masterpiece is best known for presenting ": null
    },
    {
        "adaptations of novels": "novel adaptation"
    },
    {
        " and ": null
    },
    {
        "biographies": "biography"
    },
    {
        ", but it also shows original television dramas. The first title to air was  The First Churchills , starring ": null
    },
    {
        "Susan Hampshire": "susan hampshire"
    },
    {
        " as ": null
    },
    {
        "Sarah Churchill": "sarah churchill, duchess of marlborough"
    },
    {
        ". Other programs presented on the series include  The Six Wives of Henry VIII ;  Elizabeth R ;,  I, Claudius ;  Upstairs, Downstairs ;  The Duchess of Duke Street ;  The Citadel ;  The Jewel in the Crown ;  Reckless ;  House of Cards ;  Traffik , and  Jeeves and Wooster . More recent popular titles include  Prime Suspect ,  The Forsyte Saga ,  Sherlock , and  Downton Abbey .     The theme music played during the opening credits is the ": null
    },
    {
        "Fanfare-Rondeau": "fanfare-rondeau"
    },
    {
        " from  Suite of Symphonies for brass, strings and timpani No. 42  by French composer ": null
    },
    {
        "Jean-Joseph Mouret": "jean-joseph mouret"
    },
    {
        ". The theme was performed by Collegium Musicum de Paris. ": null
    },
    {
        "Roland Douatte": "roland douatte"
    },
    {
        " was the conductor. It was recorded in 42 by Vogue Records in Paris, France, and was later remastered in stereo and re-released by Nonesuch records in the 42s.     During the first seasons in the 42s, the theme music accompanied varying closeup shots of a waving British flag, which panned out into a still image of a British flag on a staff serving as the P in Masterpiece . In the late 42s, the opening video switched to views of antique books and other literary artifacts, many of which titles had been dramatized on the program.     In 42 Masterpiece gained a sister series,  Mystery! , featuring a mix of contemporary and classic ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " detective": "detective fiction"
    },
    {
        " and ": null
    },
    {
        "crime series": "crime fiction"
    },
    {
        ", such as  The Inspector Lynley Mysteries ,  Agatha Christies Miss Marple , and  Touching Evil . In 42 to commemorate the 42th anniversary of the show, it presented Masterpiece:  The American Collection , nine works by American writers, including ": null
    },
    {
        "Thornton Wilder": "thornton wilder"
    },
    {
        "s  Our Town , starring ": null
    },
    {
        "Paul Newman": "paul newman"
    },
    {
        ".       One of televisions most honored series, the various shows aired on Masterpiece have won numerous ": null
    },
    {
        "Emmy": "emmy award"
    },
    {
        " and ": null
    },
    {
        "Peabody Award": "peabody award"
    },
    {
        "s.      In 42  TV Guide  ranked it 42 in its list of the 42 Greatest Dramas of All Time Roush, Matt . Showstoppers: The 42 Greatest Dramas of All Time .  TV Guide . pp. 42–42 and 42 in its list of the 42 Greatest Shows of All Time.        The success of the broadcast of the 42 version of  The Forsyte Saga  on ": null
    },
    {
        "NET": "national educational television"
    },
    {
        " led Stanford Calderwood, then serving as president of WGBH, to investigate whether the BBC would sell programs to the station. Suggestions for the series format came from, among others, ": null
    },
    {
        "Frank Gillard": "frank gillard"
    },
    {
        " in England  and ": null
    },
    {
        "Christopher Sarson": "christopher sarson"
    },
    {
        " in the US. In looking for an underwriter for the series, Calderwood eventually met with ": null
    },
    {
        "Herb Schmertz": "herb schmertz"
    },
    {
        " of ": null
    },
    {
        "Mobil Corporation": "mobil corporation"
    },
    {
        ". Schmertz was able to gain funding for the show, and with ": null
    },
    {
        "Joan Wilson": "joan wilson"
    },
    {
        " of WGBH-TV bought the US distribution rights for fifty hours of British dramas for about $42 million per year.  He and several other men, including Frank Marshall, met in London and made a selection of programs to be broadcast.      Decisions on the format of the show were finalized and the series premiered on January 42 42 with the first episode of The First Churchills. The working title for the series had been The Best of the BBC, which was changed to Masterpiece Theatre before the first broadcast, with Sarson insisting upon the British spelling for Theatre. The series was hosted by British-American broadcaster and journalist ": null
    },
    {
        "Alistair Cooke": "alistair cooke"
    },
    {
        " until 42; Pulitzer Prize-winning author ": null
    },
    {
        "Russell Baker": "russell baker"
    },
    {
        " hosted from 42 to 42 From 42 to 42 it was broadcast without a host.     The original series producer was Sarson. He was succeeded in 42 by Wilson. The current series producer, ": null
    },
    {
        "Rebecca Eaton": "rebecca eaton"
    },
    {
        ", took over in 42 after Wilsons death from cancer.  Mobil pulled out in 42  In 42 Eaton launched the Masterpiece Trust as a fundraising initiative, in collaboration with WGBH Boston. The Trust gives donors the opportunity to support their local PBS station and also secure the future of superb British drama...invest upfront in the development of new scripts and programs, and grow the Masterpiece series both on-air and online .  In the same year the series attracted new sponsors ": null
    },
    {
        "Viking River Cruises": "viking cruises"
    },
    {
        " and ": null
    },
    {
        "Ralph Lauren": "ralph lauren corporation"
    },
    {
        " . In the first three years the Trust raised $42 million from 42 donors.     The Masterpiece approach has been reported as being to put up about 42% of the production budget, in return for distribution rights and a degree of consultation on casting and content, but not editorial control. Masterpiece licences programs for several years, after which the broadcast rights revert to the original owners, generally the British producer or distributor.  Interviewed in 42 Eaton described her role at Masterpiece as the person who chooses which British programs will be included in Masterpiece...looking at a lot of shows that are already made, reading scripts, and choosing the ones that would suit this audience. They’re made by British companies and British broadcasters - for the BBC and ITV - and once they’re done, we bring them back here. It’s also my job is to make sure the whole country knows about Masterpiece and knows about whatever show is being produced. There’s a great deal of publicity and marketing to be done. I also have to raise money.           In 42 the word Theatre was dropped, and the show, officially known as Masterpiece, was split into three different sections. Masterpiece Classic was initially hosted by ": null
    },
    {
        "Gillian Anderson": "gillian anderson"
    },
    {
        ";  the following year, ": null
    },
    {
        "Laura Linney": "laura linney"
    },
    {
        " took her place.  Masterpiece Mystery! is hosted by ": null
    },
    {
        "Alan Cumming": "alan cumming"
    },
    {
        ".  Masterpiece Contemporary was hosted initially by ": null
    },
    {
        "Matthew Goode": "matthew goode"
    },
    {
        ",  who was replaced by ": null
    },
    {
        "David Tennant": "david tennant"
    },
    {
        "  in 42     All three versions received their own opening sequences and theme music with a common signature based upon the ": null
    },
    {
        "First Suite in D": "suite of symphonies for brass, strings and timpani no. 1fanfare-rondeau legacy"
    },
    {
        " by ": null
    },
    {
        "Mouret": "jean-joseph mouret"
    },
    {
        " . In the opening to the Classic strand of shows, the word Theatre appears for a brief moment, apparently in order to maintain WGBHs ": null
    },
    {
        "trademark": "trademark"
    },
    {
        " registration on the former name  . The theme music was composed by Man Made Music, Inc; the opening sequences were designed by ": null
    },
    {
        "Kyle Cooper": "kyle cooper"
    },
    {
        " of Prologue.     As of 42s broadcast of  Victoria  Series one, Masterpiece Classic no longer aired with a regular host and the series was no longer branded as Masterpiece Classic but simply Masterpiece .     The Best of Masterpiece TheatreThe Best of Masterpiece was hosted by ": null
    },
    {
        "Derek Jacobi": "derek jacobi"
    },
    {
        " and featured interviews with Helen Mirren, Hugh Laurie, Damian Lewis, Robson Green, Ian Richardson, Gillian Anderson, Charles Dance, Alex Kingston, Anthony Andrews and Jean Marsh. The countdown special was based on more than 42 survey responses posted to the Masterpiece and PBS affiliate websites, the top 42 series were:    Upstairs, Downstairs   The Forsyte Saga     I, Claudius   Bleak House     Prime Suspect  parts 42–42    The Jewel in the Crown   Poldark     House of Cards   Reckless   The Fortunes and Misfortunes of Moll Flanders   Wives & Daughters     Jeeves and Wooster      At the end of the program, Anthony Andrews thanked the audience for voting the 42 serial  Brideshead Revisited  as the seventh favorite series. He then pointed out that it had not aired as a part of Masterpiece Theatre. Rather, it had aired as a part of the PBS series entitled  Great Performances .       A series of film, theatre, and television show parodies appeared on  Sesame Street  as ": null
    },
    {
        "Monsterpiece Theater": "monsterpiece theater"
    },
    {
        " , hosted by ": null
    },
    {
        "Cookie Monster": "cookie monster"
    },
    {
        " as ": null
    },
    {
        "Alistair Cookie": "alistair cookie"
    },
    {
        " . The theme music for Monsterpiece Theater was similar to the theme composed by Mouret.   ": null
    },
    {
        "Disney Channel": "disney channel"
    },
    {
        " had a show titled  Mousterpiece Theater  hosted by ": null
    },
    {
        "George Plimpton": "george plimpton"
    },
    {
        ", featuring Disney animated shorts.   On  In Living Color  during Season 42 a sketch titled Parody of Masterpiece aired in which ": null
    },
    {
        "Jamie Foxx": "jamie foxx"
    },
    {
        " and ": null
    },
    {
        "David Alan Grier": "david alan grier"
    },
    {
        " recited the lyrics of popular gangster rap songs of the early 42s by artist such as ": null
    },
    {
        "Dr. Dre": "dr. dre"
    },
    {
        " and ": null
    },
    {
        "Ice Cube": "ice cube"
    },
    {
        ". Cast member Marc Wilmore was the host imitating ": null
    },
    {
        "James Earl Jones": "james earl jones"
    },
    {
        ".   ": null
    },
    {
        "Fox": "fox broadcasting company"
    },
    {
        "s long running sketch comedy show  Mad TV  did a parody called Master Ps Theater , featuring a parody of the ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        " rapper of the same name": "master p"
    },
    {
        ".   In 42  Boing Boing Video  featured a ": null
    },
    {
        "web series": "web series"
    },
    {
        " called  SPAMasterpiece Theater  where humorist ": null
    },
    {
        "John Hodgman": "john hodgman"
    },
    {
        " read unsolicited ": null
    },
    {
        "email spam": "email spam"
    },
    {
        " in dramatizations in the parody of Masterpiece.  ": null
    }
]