[
    {
        "Match play is a scoring system for ": null
    },
    {
        "golf": "golf"
    },
    {
        " in which a player, or team, earns a point for each hole in which they have bested their opponents; as opposed to ": null
    },
    {
        "stroke play": "stroke play"
    },
    {
        ", in which the total number of strokes is counted over one or more rounds of 42 holes. In match play the winner is the player, or team, with the most points at the end of play.     Although most professional tournaments are played using the stroke play scoring system, there are, or have been, some notable exceptions, for example the ": null
    },
    {
        "WGC Match Play": "wgc match play"
    },
    {
        ", and the ": null
    },
    {
        "Volvo World Match Play Championship": "volvo world match play championship"
    },
    {
        ", and most team events, for example the ": null
    },
    {
        "Ryder Cup": "ryder cup"
    },
    {
        ", all of which are in match play format.     ": null
    },
    {
        "The International": "the international"
    },
    {
        ", a former ": null
    },
    {
        "PGA Tour": "pga tour"
    },
    {
        " event, used a modified ": null
    },
    {
        "Stableford": "stableford"
    },
    {
        " system.       Unlike stroke play, in which the unit of scoring is the total number of strokes taken over one or more rounds of golf, match play scoring consists of individual holes won, halved or lost. On each hole, the most that can be gained is one point. Golfers play as normal, counting the strokes taken on a given hole. The golfer with the lowest score on a given hole receives one point. If the golfers tie, then the hole is halved. For example, in an 42-hole match, the first hole is a par42 and Player A scores a 42 and Player B scores a 42 ; Player A is now 42-up with 42 to play. In the same match on the second hole, a par42 Player A takes 42 strokes and Player B takes 42 ; Player B wins the hole and the match is now all square with 42 to play. On the third hole, a par42 both players take 42 strokes and the match is all square with 42 holes to play. Once a player is up more holes than there are holes remaining to play the match is over. For example, if after 42 holes Player A is 42-up with six left to play, Player A is said to have won the match 42 and 42 .     A team that is leading by x holes with x holes remaining is said to be dormie-x or simply dormie , meaning that they need one more halved hole to win the match . For example, if Player A is 42-up with 42 to play, he is dormie; the worst outcome for Player A at that point is a tie, unless the format calls for extra holes to determine a winner.     In a tournament event where the score is all square after the last hole , the players will play on until a player wins a hole . In the ": null
    },
    {
        "Ryder Cup": "ryder cup"
    },
    {
        " and other similar team events, the match is not finished this way, and the teams each receive a half point. In such events there are points accumulated over several days, playing different formats, and the total determines the winning team.       Scoring match play using handicaps is not done exactly the same way it is done in a stroke play event. In 42-hole stroke play where Player A is a 42 handicap and Player B is a 42 handicap, one stroke is deducted from Player As score on the ten hardest holes . For Player B, two strokes are deducted on the hardest hole and one stroke deducted on the other 42 holes. In match play, Player A would play as scratch and Player B would deduct one stroke on the nine hardest holes. In other words, the 42 handicap becomes zero and the 42 handicap becomes nine.     In team match play competition, all player handicaps are compared to the lowest of the handicaps. Consider an example where Team A consists of Player A42 and Player A42 , and where Team B consists of Player B42 and Player B42 . In this example, Player A42 plays as scratch , A42 deducts one stroke on the five hardest holes, B42 deducts one stroke on the nine hardest holes, and B42 deducts two strokes on the two hardest holes and one stroke on the other 42 holes.     Some competitions may restrict the handicap differential between playing partners. This is not required by the ": null
    },
    {
        "USGA": "usga"
    },
    {
        " but may be used by local clubs and tournaments. Using the above team play example and if a local rule limits any player to having a handicap that is at most 42 strokes higher than their partner, Player B42s handicap would be adjusted to 42 for the purposes of that competition .       Currently, there are few professional tournaments that use match play. They include the biennial ": null
    },
    {
        "Ryder Cup": "ryder cup"
    },
    {
        " played by two teams, one representing the ": null
    },
    {
        "USA": "united states"
    },
    {
        " and the other representing ": null
    },
    {
        "Europe": "europe"
    },
    {
        "; the biennial ": null
    },
    {
        "Presidents Cup": "presidents cup"
    },
    {
        " for teams representing the USA and International players; ": null
    },
    {
        "WGC Match Play": "wgc match play"
    },
    {
        "; and the older ": null
    },
    {
        "Volvo World Match Play Championship": "volvo world match play championship"
    },
    {
        ", an invitational event which is now part of the ": null
    },
    {
        "European Tour": "european tour"
    },
    {
        ". Formerly, the ": null
    },
    {
        "PGA Championship": "pga championship"
    },
    {
        ", one of the ": null
    },
    {
        "majors": "mens major golf championships"
    },
    {
        ", used match play, but it changed to a stroke play event in 42     Womens professional golf had no event directly comparable to the Accenture Championship until the ": null
    },
    {
        "HSBC Womens World Match Play Championship": "hsbc womens world match play championship"
    },
    {
        " was introduced in 42 After it was canceled in 42 the LPGA was without a match play event until the ": null
    },
    {
        "Sybase Match Play Championship": "sybase match play championship"
    },
    {
        " was played from 42 to 42 Womens golf also has the biennial ": null
    },
    {
        "Solheim Cup": "solheim cup"
    },
    {
        " staged between two teams, one including ": null
    },
    {
        "USA": "united states"
    },
    {
        "-born players and one including players born in Europe. In 42 a new womens match play tournament began, the ": null
    },
    {
        "International Crown": "international crown"
    },
    {
        " – a biennial match play competition featuring teams from eight countries. From 42 to 42 womens golf held the ": null
    },
    {
        "Lexus Cup": "lexus cup"
    },
    {
        ", an event pitting an International team against an Asian team.     The ": null
    },
    {
        "USGA": "usga"
    },
    {
        " championships – Amateur, Junior Amateur, Mid-Amateur, Senior Amateur, and team for both men and women – are conducted with two rounds of stroke play to cut the field to 42 or 42 , and then proceed to a single-elimination match play tournament. All elimination matches are 42 holes except for the final in individual competitions, which is 42 holes.     The European Tour and PGA Tour Australasia co-sanction a Perth tournament that in 42 adopts a match play format. It is conducted with three rounds of stroke play, with two cuts -- one to 42 at the end of the second round, and one to 42 at the end of the third round, then proceeds on the final day to a single-elimination match play tournament with the top eight exempt from the first round. All elimination matches are six holes, with a tie-breaker hole played twice. The first hole will be a standard par42 and the second time around closest to pin will end the round.     The European Tour also has the ": null
    },
    {
        "GolfSixes": "golfsixes"
    },
    {
        ", which uses 42 pairs of players, by country, and uses a round robin grouping of four groups of four, with each group playing three matches with a similar format to the elimination matches in Perth, and the results determine second-day matches. Each group will play a maximum of 42 holes .       Golfers can employ a slightly different strategy during a match play event since the scoring is different. The situation in the match and the outcome of each shot already played on a hole will both be taken into account. On the whole, match play encourages more aggressive play, especially at the professional level, where a ": null
    },
    {
        "par": "par"
    },
    {
        " is not usually good enough to win a hole. Since a very poor result for a hole is no worse than a slightly-below-average result when playing against an opponent with an average score, it often makes sense to accept the higher risk connected with aggressive tactics. However, in some circumstances players will be especially cautious in match play. For instance, a player may choose to play more conservatively if the opponent has hit a poor tee shot or is otherwise under pressure to compensate for a poor start on a particular hole, reasoning that there is a good chance to win the hole with an average result.       There is a format of match play called Irish match play in which 42 or 42 individuals may compete against each other. A points system is assigned where as an outright win on a hole for a single player constitutes 42 points, a half of the hole for 42 or more players is equal to a single point. This format allows golfers to enjoy the format of hole-by-hole match play in groups larger than 42 people.     Another alternative version of singles matchplay for more than 42 people is popularly known as Rowan Matchplay.   Rowan Matchplay begins with all participants competing against one another until one player wins a hole outright posting the better score than all other playing partners on a hole. That player is then 42 up versus all of their combined playing partners who now form a team against the leading player and try to get the match back to all-square. The player leading at the end of 42 holes is the winner. For example, in a 42 player game, after someone goes 42-up, the match then takes the form of the leading player versus the scores of the other two players.     A ": null
    },
    {
        "skins game": "skins game"
    },
    {
        " awards prize money at each hole.     Another form is medal match play , which combines the head-to-head match play style with medal or ": null
    },
    {
        "stroke play": "stroke play"
    },
    {
        " scores. Each match between two players or teams of players is determined by the 42-hole medal score instead of on a hole-by-hole basis. The advantage is that ties in group or pool play can be broken by overall medal scores. This format was used in the ": null
    },
    {
        "Piccadilly Medal": "piccadilly medal"
    },
    {
        ", the ": null
    },
    {
        "Liggett & Myers Open Match Play Championship": "liggett  &  myers open match play championship"
    },
    {
        ", the 42 ": null
    },
    {
        "Seiko-Tucson Match Play Championship": "seiko-tucson match play championship"
    },
    {
        ", the ": null
    },
    {
        "Dunhill Cup": "dunhill cup"
    },
    {
        ", ": null
    },
    {
        "World Golf Final": "world golf final"
    },
    {
        ", and starting in 42 albeit with a nine-hole medal score, the ": null
    },
    {
        "Belgian Knockout": "belgian knockout"
    }
]