[
    {
        "      In the spelling of ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " and some other ": null
    },
    {
        "Semitic languages": "semitic languages"
    },
    {
        ", matres lectionis  are certain consonants that are used to indicate a vowel. The letters that do this in Hebrew are  aleph  ,  he  ,  waw   and  yod  . The yod and waw in particular are more often vowels than they are consonants.     In ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        ", the matres lectionis are ": null
    },
    {
        "ʾalif": "aleph"
    },
    {
        " , ": null
    },
    {
        "wāw": "waw"
    },
    {
        "  and ": null
    },
    {
        "yāʾ": "yodh"
    },
    {
        " .     The original value of the matres lectionis correspond closely to what is called in modern linguistics ": null
    },
    {
        "glides": "glide"
    },
    {
        " or semivowels. Encyclopedia of Arabic Language and Linguistics, Brill, 2006, 2.238, 308-9.       Because the scripts used to write some Semitic languages lack vowel letters, unambiguous reading of a text might be difficult. Therefore, to indicate vowels , consonant letters are used. For example, in the Hebrew ": null
    },
    {
        "construct-state": "construct state"
    },
    {
        " form bēt, meaning the house of , the middle letter  in the spelling  acts as a vowel, but in the corresponding absolute-state form bayit , which is spelled the same, the same letter represents a genuine consonant. Matres lectionis are extensively employed only in Hebrew, ": null
    },
    {
        "Aramaic": "aramaic language"
    },
    {
        ", ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " and ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        ", but the phenomenon is also found in the ": null
    },
    {
        "Ugaritic": "ugaritic alphabet"
    },
    {
        ", ": null
    },
    {
        "Moabite": "moabite language"
    },
    {
        ", ": null
    },
    {
        "South Arabian": "south arabian alphabet"
    },
    {
        " and ": null
    },
    {
        "Phoenician": "phoenician alphabet"
    },
    {
        " alphabets.         Historically, the practice of using matres lectionis seems to have originated when  and  diphthongs, written with the yod  and the waw  consonant letters respectively, monophthongized to simple long vowels  and . This epiphenomenal association between consonant letters and vowel sounds was then seized upon and used in words without historic diphthongs.     In general terms, it is observable that early ": null
    },
    {
        "Phoenician": "phoenician alphabet"
    },
    {
        " texts have very few matres lectionis, and that during most of the 1st millennium BCE, Hebrew and Aramaic were quicker to develop matres lectionis than Phoenician. However, in its latest period of development in ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        " , Phoenician developed a very full use of matres lectionis, including the use of the letter ": null
    },
    {
        "Ayin": "ayin"
    },
    {
        " , also used for this purpose much later in ": null
    },
    {
        "Yiddish orthography": "yiddish orthography"
    },
    {
        ".     In pre-exilic Hebrew, there was a significant development of the use of the letter He  to indicate word final vowels other than ī and ū. This was probably inspired by the phonological change of the third-person singular possessive suffix from  ": null
    }
]