[
    {
        ": Aleman is sometimes used to refer to German.        Mateo Alemán y del Nero  was a Spanish ": null
    },
    {
        "novelist": "novelist"
    },
    {
        " and writer.       Alemán was born in ": null
    },
    {
        "Seville": "seville"
    },
    {
        ", Andalucía, where he graduated at ": null
    },
    {
        "the University": "university of seville"
    },
    {
        " in 42 He later studied at ": null
    },
    {
        "Salamanca": "salamanca"
    },
    {
        " and ": null
    },
    {
        "Alcalá": "alcalá de henares"
    },
    {
        ", and from 42 to 42 held a post in the treasury; in 42 he was arrested on suspicion of ": null
    },
    {
        "malversation": "wiktionary:malversation"
    },
    {
        ", but was speedily released. According to some authors, he was descended from Jews forcibly converted to Catholicism after 42 and one of his forebears had been burned by the ": null
    },
    {
        "Inquisition": "inquisition"
    },
    {
        " for secretly continuing to practice Judaism. In 42 he published the first part of  Guzmán de Alfarache , a celebrated ": null
    },
    {
        "picaresque novel": "picaresque novel"
    },
    {
        " which passed through no less than sixteen editions in five years; a spurious sequel was issued in 42 but the authentic continuation did not appear until 42        In 42 Alemán married, unhappily, Catalina de Espinosa, and was constantly in money difficulties, being imprisoned for debt at ": null
    },
    {
        "Seville": "seville"
    },
    {
        " at the end of 42     In 42 Alemán emigrated to ": null
    },
    {
        "America": "north america"
    },
    {
        ", and is said to have carried on business as a printer in Mexico, where he is assumed to have remained for the rest of his life. His Ortografía castellana , published in Mexico, contains ingenious and practical proposals for the reform of Spanish spelling. Nothing is recorded of Alemán after 42 but it is sometimes asserted that he was still living in 42       In addition to the works already mentioned, Alemán is the author of a life of ": null
    },
    {
        "St. Anthony of Padua": "st. anthony of padua"
    },
    {
        ", and versions of two odes of ": null
    },
    {
        "Horace": "horace"
    },
    {
        " bear witness to his taste and metrical accomplishment. His most famous work, however, is  Guzmán de Alfarache , which was translated into French in 42 into Italian in 42 into German in 42 into English in 42 by ": null
    },
    {
        "James Mabbe": "james mabbe"
    },
    {
        ", and into ": null
    },
    {
        "Latin": "latin"
    },
    {
        " in 42": null
    }
]