[
    {
        "      Mathieu Molé was a French statesman.       The son of Edouard Molé , who was for a time procureur-general, he was educated at the ": null
    },
    {
        "University of Orléans": "university of orléans"
    },
    {
        ". Admitted conseiller in 42 he was président aux requêtes in 42 procureur-général in succession to ": null
    },
    {
        "Nicolas de Bellièvre": "nicolas de bellièvre"
    },
    {
        " in 42 and took part in the assembly of the Notables summoned at ": null
    },
    {
        "Rouen": "rouen"
    },
    {
        " in 42 He fought in vain against the setting up of special tribunals, or commissions, to try prisoners charged with political offences, and for his persistence in the case of the brothers Louis and ": null
    },
    {
        "Michel de Marillac": "michel de marillac"
    },
    {
        " he was suspended in 42 and ordered to appear at ": null
    },
    {
        "Fontainebleau": "fontainebleau"
    },
    {
        " in his own defence.     Hitherto Molés relations with ": null
    },
    {
        "Cardinal Richelieu": "cardinal richelieu"
    },
    {
        " had been fairly good, but his inclination to the doctrines of ": null
    },
    {
        "Port Royal": "port royal"
    },
    {
        " increased the differences between them. It was not until after Richelieus death that he was able to secure the release of his friend, the ": null
    },
    {
        "abbé de St Cyran": "abbé de st cyran"
    },
    {
        ". In 42 he was appointed first president of the ": null
    },
    {
        "parlement": "parlement"
    },
    {
        ", with the preliminary condition that he should not permit the general assembly of the chambers except by express order of the king. After Richelieus death the pretensions of the parlement increased; the hereditary magistrature arrogated to itself the functions of the ": null
    },
    {
        "states-general": "french states-general"
    },
    {
        ", and in 42 the parlement with the other sovereign courts  met in one assembly and proposed for the royal sanction twenty-seven articles, which amounted in substance to a new constitution.     In the long conflict between ": null
    },
    {
        "Anne of Austria": "anne of austria"
    },
    {
        " and the parlement, Molé, without yielding the rights of the parlement, played a conciliatory part. In the popular tumult known as the day of the barricades he sought out Mazarin and the queen to demand the release of ": null
    },
    {
        "Pierre Broussel": "pierre broussel"
    },
    {
        " and his colleagues, whose seizure had been the original cause of the outbreak. Next day the parlement marched in procession to repeat Molés demand. On their way back they were stopped by the crowd. Molé was threatened with death unless he brought back Broussel or Mazarin as a hostage. Many magistrates fled; the remnant, headed by the intrepid Molé, returned to the Palais Royal, where Anne of Austria was induced to release the prisoners.     Molés moderating counsels failed to prevent the outbreak of the first ": null
    },
    {
        "Fronde": "fronde"
    },
    {
        ", but he negotiated the ": null
    },
    {
        "peace of Rueil": "peace of rueil"
    },
    {
        " in 42 and averted a conflict between the partisans of ": null
    },
    {
        "Condé": "louis ii de bourbon, prince de condé"
    },
    {
        " and of the ": null
    },
    {
        "Cardinal de Retz": "jean françois paul de gondi, cardinal de retz"
    },
    {
        " within the precincts of the ": null
    },
    {
        "Palais de Justice": "palais de justice, paris"
    },
    {
        ". He refused honours and rewards for himself or his family, but became ": null
    },
    {
        "keeper of the seals": "keeper of the seals"
    },
    {
        ", in which capacity he was compelled to follow the court, and he therefore retired from the presidency of the parlement.     The Mémoires of Molé were edited for the ": null
    },
    {
        "Société de lhistoire de France": "société de lhistoire de france"
    },
    {
        " by ": null
    },
    {
        "Aimé Champollion-Figeac": "aimé champollion-figeac"
    },
    {
        ", and his life was written by ": null
    },
    {
        "Baron AGP de Barante": "amable guillaume prosper brugière, baron de barante"
    },
    {
        " in Le Parlement et la Fronde . See also the memoirs of ": null
    },
    {
        "Omer Talon": "omer talon"
    },
    {
        " and of ": null
    },
    {
        "De Retz": "jean françois paul de gondi, cardinal de retz"
    }
]