[
    {
        "Matrilineality is the tracing of ": null
    },
    {
        "kinship": "kinship"
    },
    {
        " through the female line. It may also correlate with a ": null
    },
    {
        "social system": "social system"
    },
    {
        " in which each person is identified with their matriline –  their mothers ": null
    },
    {
        "lineage": "lineage"
    },
    {
        "  – and which can involve the ": null
    },
    {
        "inheritance": "inheritance"
    },
    {
        " of property and/or titles. A matriline is a ": null
    },
    {
        "line of descent": "line of descent"
    },
    {
        " from a ": null
    },
    {
        "female": "female"
    },
    {
        " ancestor": "ancestor"
    },
    {
        " to a ": null
    },
    {
        "descendant": "kinship"
    },
    {
        "  in which the individuals in all intervening generations are mothersin other words, a mother line . In a matrilineal ": null
    },
    {
        "descent system": "kinship and descent"
    },
    {
        ", an individual is considered to belong to the same ": null
    },
    {
        "descent group": "descent group"
    },
    {
        " as their mother. This matrilineal descent pattern is in contrast to the more common pattern of ": null
    },
    {
        "patrilineal descent": "patrilineal descent"
    },
    {
        " from which a ": null
    },
    {
        "family name": "family name"
    },
    {
        " is usually derived. The matriline of historical nobility was also called their enatic or uterine ancestry, corresponding to the ": null
    },
    {
        "patrilineal": "patrilineal"
    },
    {
        " or agnatic ancestry.     In some traditional societies and cultures, membership in their groups was –  and, in the following list, still is if shown in italics  – inherited matrilineally. Examples include the ": null
    },
    {
        "Cherokee": "cherokee"
    },
    {
        ", ": null
    },
    {
        "Choctaw": "choctaw"
    },
    {
        ",  Gitksan , ": null
    },
    {
        "Haida": "haida people"
    },
    {
        ", ": null
    },
    {
        "Hopi": "hopi"
    },
    {
        ", ": null
    },
    {
        "Iroquois": "iroquois"
    },
    {
        ", ": null
    },
    {
        "Lenape": "lenape"
    },
    {
        ", ": null
    },
    {
        "Navajo": "navajo people"
    },
    {
        " and ": null
    },
    {
        "Tlingit": "tlingit people"
    },
    {
        " of ": null
    },
    {
        "North America": "north america"
    },
    {
        "; the  Kuna people  of Panama; the  Kogi  and ": null
    },
    {
        "Carib": "kalina people"
    },
    {
        " of South America; the  Minangkabau  people of ": null
    },
    {
        "West Sumatra": "west sumatra"
    },
    {
        ", ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        " and ": null
    },
    {
        "Negeri Sembilan": "negeri sembilan"
    },
    {
        ", ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        "; the  Trobrianders ,  Dobu  and Nagovisi of Melanesia; the ": null
    },
    {
        "Nairs": "nairs"
    },
    {
        " of ": null
    },
    {
        "Kerala": "kerala"
    },
    {
        " and the ": null
    },
    {
        "Bunt": "bunt"
    },
    {
        "s and ": null
    },
    {
        "Billava": "billava"
    },
    {
        " of ": null
    },
    {
        "Karnataka": "karnataka"
    },
    {
        " in south ": null
    },
    {
        "India": "india"
    },
    {
        "; the  Khasi ,  Jaintia  and  Garo  of ": null
    },
    {
        "Meghalaya": "meghalaya"
    },
    {
        " in northeast India; the  Ngalops  and  Sharchops  of ": null
    },
    {
        "Bhutan": "bhutan"
    },
    {
        ";  Muslims  and the  Tamils  in eastern ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        "; the  Mosuo  of ": null
    },
    {
        "China": "china"
    },
    {
        "; the  Kayah  of Southeast Asia, the ": null
    },
    {
        "Basques": "basques"
    },
    {
        " of ": null
    },
    {
        "Spain": "spain"
    },
    {
        " and ": null
    },
    {
        "France": "france"
    },
    {
        "; the  Akan  including the  Ashanti  of west ": null
    },
    {
        "Africa": "africa"
    },
    {
        "; virtually all groups across the so-called ": null
    },
    {
        "matrilineal belt": "matrilineal belt"
    },
    {
        " of south-central Africa; the  Tuareg  of west and north Africa; the  Serer  of ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        ", ": null
    },
    {
        "The Gambia": "the gambia"
    },
    {
        " and ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        "; and most  Jewish  communities.       In the late 42th century, almost all prehistorians and anthropologists believed, following ": null
    },
    {
        "Lewis H. Morgan": "lewis h. morgan"
    },
    {
        "s influential book  Ancient Society , that early human kinship everywhere was matrilineal. Murdock, G. P. 42 Social Structure. London and New York: Macmillan, p. 42 This idea was taken up by ": null
    },
    {
        "Friedrich Engels": "friedrich engels"
    },
    {
        " in  The Origin of the Family, Private Property and the State . The Morgan-Engels thesis that humanitys earliest domestic institution was not the ": null
    },
    {
        "family": "family"
    },
    {
        " but the matrilineal ": null
    },
    {
        "clan": "clan"
    },
    {
        " soon became incorporated into ": null
    },
    {
        "communist orthodoxy": "communist theory"
    },
    {
        ". In reaction, most 42th century social anthropologists considered the theory of matrilineal priority untenable, Malinowski, B. 42 Marriage: Past and Present. A debate between Robert Briffault and Bronislaw Malinowski, ed. M. F. Ashley Montagu. Boston: Porter Sargent. Harris, M. 42 The Rise of Anthropological Theory. London: Routledge, p. 42 although during the 42s and 42s, a range of ": null
    },
    {
        "feminist": "feminism"
    },
    {
        " scholars often attempted to revive it. Leacock, E. B. 42 Myths of Male Dominance. Collected articles on women cross-culturally. New York: Monthly Review Press.     In recent years, ": null
    },
    {
        "evolutionary biologist": "evolutionary biologist"
    },
    {
        "s, geneticists and ": null
    },
    {
        "palaeoanthropologist": "palaeoanthropologist"
    },
    {
        "s have been reassessing the issues, many citing genetic and other evidence that early human kinship may have been matrilineal after all. Hrdy, S. B. 42 Mothers and others. The evolutionary origins of mutual understanding. London and Cambridge, MA: Belknap Press of Harvard University Press. Knight, C. 42  In N. J. Allen, H. Callan, R. Dunbar and W. James , Early Human Kinship. Oxford: Blackwell, pp. 4242 Opie, K. and C. Power, 42 Grandmothering and Female Coalitions. A basis for matrilineal priority? In N. J. Allen, H. Callan, R. Dunbar and W. James , Early Human Kinship. Oxford: Blackwell, pp. 4242 Chris Knight, 42  . One crucial piece of indirect evidence has been genetic data suggesting that over thousands of years, women among ": null
    },
    {
        "sub-Saharan Africa": "sub-saharan africa"
    },
    {
        "n hunter-gatherers have chosen to reside postmaritally not with their husbands family but with their own mother and other natal kin.   Schlebusch, C.M. Genetic variation in Khoisan-speaking populations from southern Africa. Dissertation, University of Witwatersrand this is available online, see pages following p.42 Fig 42 and p.4242 fig 42 and p.42 p.42   Another line of argument is that when sisters and their mothers help each other with childcare, the descent line tends to be matrilineal rather than patrilineal.  Biological anthropologists are now widely agreed that cooperative childcare was a development crucial in making possible the evolution of the unusually large human brain and characteristically human psychology.              Matrilineal ": null
    },
    {
        "surname": "surname"
    },
    {
        "s are names transmitted from mother to daughter, in contrast to the more familiar patrilineal surnames transmitted from father to son, the pattern most common among ": null
    },
    {
        "family name": "family name"
    },
    {
        "s today. For clarity and for brevity, the scientific terms patrilineal surname and matrilineal surname are usually abbreviated as patriname and  matriname . Sykes, Bryan .  The Seven Daughters of Eve . W.W. Norton. ; pp. 4242 ": null
    },
    {
        "Bryan Sykes": "bryan sykes"
    },
    {
        " uses matriname and states that women adding their own matriname to mens patriname would really help in future genealogy work and historical record searches. Sykes also states that a womans matriname will be handed down with her ": null
    },
    {
        "mtDNA": "mtdna"
    },
    {
        ", the main topic of his book.       There appears to be some evidence for the presence of matrilineality in ": null
    },
    {
        "Pre-Islamic Arabia": "pre-islamic arabia"
    },
    {
        ", in a very limited number of the Arabian peoples ; ": null
    },
    {
        "Korotayev": "korotayev"
    },
    {
        ",  A.  V. , . on the other hand, there does not seem to be any reliable evidence for the presence of matrilineality in Islamic Arabia, although the ": null
    },
    {
        "Fatimid Caliphate": "fatimid caliphate"
    },
    {
        " claimed succession from the Islamic ": null
    },
    {
        "Prophet Mohammad": "prophet mohammad"
    },
    {
        " via his daughter ": null
    },
    {
        "Fatima": "fatimah"
    },
    {
        ".     A modern example from South Africa is the order of succession to the position of the ": null
    },
    {
        "Rain Queen": "rain queen"
    },
    {
        " in a culture of ": null
    },
    {
        "matrilineal primogeniture": "matrilineal succession"
    },
    {
        ": not only is ": null
    },
    {
        "dynastic": "dynasty"
    },
    {
        " descent reckoned through the female line, but only females are eligible to inherit.       Most of the example cultures in this article are based on ": null
    },
    {
        "clan": "clan"
    },
    {
        "s. Any clan might possibly contain from one to several or many  descent group s or family groups – i.e., any matrilineal clan might be descended from one or several or many unrelated female ancestors. Also, each such descent group might have its own ": null
    },
    {
        "family name": "family name"
    },
    {
        " or surname, as one possible cultural pattern. The following two example cultures each follow a different pattern, however:     Example 42 Members of the clan culture ": null
    },
    {
        "Minangkabau": "minangkabau people"
    },
    {
        " do not even have a surname or family name, see ": null
    },
    {
        "this cultures own section": "minangkabau"
    },
    {
        " below. In contrast, members do have a clan name, which is important in their lives although not included in the members name. Instead, ones name is just ones ": null
    },
    {
        "given name": "given name"
    },
    {
        ".     Example 42 Members of the clan culture ": null
    },
    {
        "Akan": "akan people"
    },
    {
        ", see ": null
    },
    {
        "its own section": "akan"
    },
    {
        " below, also do not have matrilineal surnames and likewise their important clan name is not included in their name. However, members names do commonly include second names which are called surnames but which are not routinely passed down from either father or mother to all their children as a family name. de Witte, Marleen . Long live the dead!: changing funeral celebrations in Asante, Ghana. Published by Het Spinhuis. , p. 42 Readers may verify this by inspecting an actual ": null
    },
    {
        "family tree": "family tree"
    },
    {
        " on p. 42 via Google Books at  & printsecfrontcover & dqde+Witte,+Marleen & hlen & saX & eiL_ihT42_jM42Tg42gX42_-jaCA & ved42CDYQ42AEwAQvonepage & q%42Adwoa%42Dufie%42 & ffalse .     Note well that if a culture did include ones clan name in ones name and routinely handed it down to all children in the descent group then it would automatically be the family name or surname for ones descent group .       While a mother normally takes care of her own children in all cultures, in some matrilineal cultures an uncle-father will take care of his nieces and nephews instead: in other words social fathers here are uncles. There is a disconnection between the role of father and genitor . In such matrilineal cultures, especially where residence is also ": null
    },
    {
        "matrilocal": "matrilocal"
    },
    {
        ", a man will exercise guardianship rights not over the children he fathers but exclusively over his sisters children, who are viewed as his own flesh. These childrens biological father – unlike an uncle who is their mothers brother and thus their caregiver – is in some sense a stranger to them, even when affectionate and emotionally close. Schneider, D. M. 42 The distinctive features of matrilineal descent groups. Introduction. In Schneider, D. M. and K. Gough Matrilineal Kinship. Berkeley: University of California Press, pp. 4242 This may be true for the traditional ": null
    },
    {
        "Akan culture below": "akan"
    },
    {
        ", for example.     According to ": null
    },
    {
        "Steven Pinker": "steven pinker"
    },
    {
        ", attributing to Kristen Hawkes, among foraging groups matrilocal societies are less likely to commit female infanticide than are patrilocal societies. Pinker, Steven, The Better Angels of Our Nature: Why Violence Has Declined , p.  42 .             While men held positions of religious and political power, Spartan constitution mandated that inheritance and proprietorship pass from mother to daughter.      In Pictish society, succession in leadership was matrilineal , with the reigning chief succeeded by either his brother or perhaps a nephew but not through patrilineal succession of father to son.               Occupied for 42 years by Native Americans, the land that would become New Jersey was overseen by ": null
    },
    {
        "clan": "clan"
    },
    {
        "s of the ": null
    },
    {
        "Lenape": "lenape"
    },
    {
        " or ": null
    },
    {
        "Lenni Lenape": "lenni lenape"
    },
    {
        " or ": null
    },
    {
        "Delaware": "delaware"
    },
    {
        ", who farmed, fished, and hunted upon it. The pattern of their culture was that of a matrilineal agricultural and mobile hunting society that was sustained with fixed, but not permanent, settlements in their matrilineal clan territories. Leadership by men was inherited through the maternal line, and the women elders held the power to remove leaders of whom they disapproved.     Villages were established and relocated as the clans farmed new sections of the land when soil fertility lessened and when they moved among their fishing and hunting grounds by seasons. The area was claimed as a part of the Dutch ": null
    },
    {
        "New Netherland": "new netherland"
    },
    {
        " province dating from 42 where active trading in furs took advantage of the natural pass west, but the Lenape prevented permanent settlement beyond what is now Jersey City.     Early Europeans who first wrote about these Indians found matrilineal social organization to be unfamiliar and perplexing. ... As a result, the early records are full of clues about early Lenape society, but were usually written by observers who did not fully understand what they were seeing. This quote is from ": null
    },
    {
        "Lenni-Lenape": "lenni-lenape"
    },
    {
        "s ": null
    },
    {
        "Society": "lenni-lenapesociety"
    },
    {
        " section.          The ": null
    },
    {
        "Hopi": "hopi people"
    },
    {
        " , according to Alice Schlegel, had as its gender ideology  ... one of female superiority, and it operated within a social actuality of sexual equality. Schlegel, Alice, Hopi Gender Ideology of Female Superiority, in Quarterly Journal of Ideology: A Critique of the Conventional Wisdom , vol. VIII, no. 42 42 p. 42 and see pp. 42–42 . According to LeBow , in the Hopi, gender roles  ... are egalitarian  .... ither sex is inferior. LeBow, Diana, Rethinking Matriliny Among the Hopi, op. cit., p. LeBow concluded that Hopi women participate fully in  ... political decision-making. LeBow, Diana, Rethinking Matriliny Among the Hopi, op. cit., p. 42 According to Schlegel, the Hopi no longer live as they are described here Schlegel, Alice, Hopi Gender Ideology of Female Superiority, op. cit., p. 42 n. 42 and the attitude of female superiority is fading . Schlegel said the Hopi were and still are matrilinial Schlegel, Alice, Hopi Gender Ideology of Female Superiority, op. cit., p. 42 and the household  ... was matrilocal .     Schlegel explains why there was female superiority as that the Hopi believed in life as the highest good  ... the female principle  ... activated in women and in Mother Earth  ... as its source and that the Hopi were not in a state of continual war with equally matched neighbors Schlegel, Alice, Hopi Gender Ideology of Female Superiority, op. cit., p. 42 and had no standing army so that the Hopi lacked the spur to masculine superiority and, within that, as that women were central to institutions of clan and household and predominated within the economic and social systems , the ": null
    },
    {
        "Clan Mother": "clan mother"
    },
    {
        ", for example, being empowered to overturn land distribution by men if she felt it was unfair, Schlegel, Alice, Hopi Gender Ideology of Female Superiority, op. cit., p. 42 since there was no countervailing  ... strongly centralized, male-centered political structure .          The ": null
    },
    {
        "Iroquois Confederacy or League": "iroquois"
    },
    {
        ", combining five to six Native American ": null
    },
    {
        "Haudenosaunee": "iroquois"
    },
    {
        " nations or tribes before the ": null
    },
    {
        "U.S.": "united states"
    },
    {
        " became a nation, operated by ": null
    },
    {
        "The Great Binding Law of Peace": "great law of peace"
    },
    {
        ", a constitution by which women retained matrilineal-rights and participated in the Leagues political decision-making, including deciding whether to proceed to war, Jacobs, Renée E., Iroquois Great Law of Peace and the United States Constitution: How the Founding Fathers Ignored the Clan Mothers, in American Indian Law Review, vol. 42 no. 42 pp. 42–42 esp. pp. 42–42 . through what may have been a matriarchy Jacobs, Renée, Iroquois Great Law of Peace and the United States Constitution, in American Indian Law Review, op. cit., pp. 42–42 or gyneocracy . Jacobs, Renée, Iroquois Great Law of Peace and the United States Constitution, in American Indian Law Review, op. cit., p. 42 & p. 42 n. 42 quoting Carr, L., The Social and Political Position of Women Among the Huron-Iroquois Tribes, Report of the Peabody Museum of American Archaeology, p. 42 . The dates of this constitutions operation are unknown: the League was formed in approximately 42–42 but the constitution was oral until written in about 42 Jacobs, Renée, Iroquois Great Law of Peace and the United States Constitution, in American Indian Law Review, op. cit., p. 42 & n. 42 The League still exists.              Some 42 million ": null
    },
    {
        "Akan": "akan people"
    },
    {
        " live in Africa, particularly in ": null
    },
    {
        "Ghana": "ghana"
    },
    {
        " and ": null
    },
    {
        "Ivory Coast": "ivory coast"
    },
    {
        ".  Many but not all of the Akan still de Witte, Marleen . Long live the dead!: changing funeral celebrations in Asante, Ghana. Published by Het Spinhuis. . All de Witte pages referenced below, and many more pages, are available online via Google Books at  & pgPA42 & dqAbusua & hlen & eiiTRaTdj42N42P42lweKm42XfDA & saX & oibook_result & ctresult & resnum42 & ved42CCcQ42AEwAAvonepage & qAbusua & ffalse . practice their traditional matrilineal customs, living in their traditional ": null
    },
    {
        "extended family": "extended family"
    },
    {
        " households, as follows. The traditional Akan economic, political and social organization is based on maternal lineages, which are the basis of inheritance and succession. A lineage is defined as all those related by ": null
    },
    {
        "matrilineal descent": "matrilineal descent"
    },
    {
        " from a particular ancestress. Several lineages are grouped into a political unit headed by a chief and a council of elders, each of whom is the elected head of a lineage & mdash; which itself may include multiple extended-family households. Public offices are thus vested in the lineage, as are land tenure and other lineage property. In other words, lineage property is inherited only by matrilineal kin. Busia, Kofi Abrefa . Encyclopædia Britannica, 42 William Benton, publisher, The University of Chicago. , Vol. 42 p. 42     The principles governing inheritance stress sex, generation and age & mdash; that is to say, men come before women and seniors before juniors. When a woman’s brothers are available, a consideration of generational seniority stipulates that the line of brothers be exhausted before the right to inherit lineage property passes down to the next senior genealogical generation of sisters sons. Finally, it is when all possible male heirs have been exhausted that the females may inherit.     Each lineage controls the lineage land farmed by its members, functions together in the veneration of its ancestors, supervises marriages of its members, and settles internal disputes among its members. Owusu-Ansah, David . , Ghana: The Akan Group . This source, Ghana , is one of the Country Studies available from the US Library of Congress. Archived by WebCite® at  on 42Aug42     The political units above are likewise grouped into eight larger groups called  abusua  , named Aduana, Agona, Asakyiri, Asenie, Asona, Bretuo, Ekuona and Oyoko. The members of each abusua are united by their belief that they are all descended from the same ancient ancestress. Marriage between members of the same abusua is forbidden. One inherits or is a lifelong member of the lineage, the political unit, and the abusua of ones mother, regardless of ones gender and/or marriage. Note that members and their spouses thus belong to different abusuas, mother and children living and working in one household and their husband/father living and working in a different household.     According to this source ashanti.com.au . , Ashanti Home Page: The Ashanti Family unit Archived at WebCite  on 42 March 42 of further information about the Akan, A man is strongly related to his mothers brother but only weakly related to his fathers brother. This must be viewed in the context of a ": null
    },
    {
        "polygamous": "polygamous"
    },
    {
        " society in which the mother/child bond is likely to be much stronger than the father/child bond. As a result, in inheritance, a mans nephew will have priority over his own son. Uncle-nephew relationships therefore assume a dominant position.     Certain other aspects of the Akan culture are determined ": null
    },
    {
        "patrilineally": "patrilineally"
    },
    {
        " rather than matrilineally. There are 42 patrilineal ": null
    },
    {
        "Ntoro": "ntoro"
    },
    {
        " groups, and everyone belongs to their fathers Ntoro group but not to his family lineage and abusua. Each patrilineal Ntoro group has its own surnames, de Witte , p. 42 shows such surnames in a ": null
    },
    {
        "family tree": "family tree"
    },
    {
        ", which provides a useful example of names. taboos, ritual purifications, and etiquette.     A recent book provides this update on the Akan: Some families are changing from the above abusua structure to the ": null
    },
    {
        "nuclear family": "nuclear family"
    },
    {
        ". de Witte , p. 42 Housing, childcare, education, daily work, and elder care etc. are then handled by that individual family rather than by the abusua or clan, especially in the city. de Witte , p. 42 The above taboo on marriage within ones abusua is sometimes ignored, but clan membership is still important, with many people still living in the abusua framework presented above.            The ": null
    },
    {
        "Tuareg": "tuareg people"
    },
    {
        " are a large ": null
    },
    {
        "Berber": "berbers"
    },
    {
        " ethnic confederation found across several nations in north Africa, including ": null
    },
    {
        "Niger": "niger"
    },
    {
        ", ": null
    },
    {
        "Mali": "mali"
    },
    {
        " and ": null
    },
    {
        "Algeria": "algeria"
    },
    {
        ". The Tuareg are clan-based, Haven, Cynthia . , New exhibition highlights the artful Tuareg of the Sahara, Stanford University. Archived at WebCite  on 42Apr42 and are largely matrilineal . Spain, Daphne . Gendered Spaces. University of North Carolina Press. ; p. 42 ": null
    },
    {
        "Murphy, Robert F.": "robert f. murphy"
    },
    {
        " . Untitled review of a 42 major ethnographic study of the Tuareg. American Anthropologist, New Series, 42 , No. 42 4242  The Tuareg are ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        ", but mixed with a heavy dose of their pre-existing beliefs including matrilineality.     Tuareg women enjoy high status within their society, compared with their ": null
    },
    {
        "Arab": "arab"
    },
    {
        " counterparts and with other Berber tribes: Tuareg social status is transmitted through women, with residence often ": null
    },
    {
        "matrilocal": "matrilocal residence"
    },
    {
        ". Most women could read and write, while most men were illiterate, concerning themselves mainly with herding livestock and other male activities. The livestock and other movable property were owned by the women, whereas personal property is owned and inherited regardless of gender. In contrast to most other Muslim cultural groups, men wear veils but women do not. This custom is discussed in more detail in the Tuareg articles ": null
    },
    {
        "clothing section": "tuareg peopleclothing"
    },
    {
        ", which mentions it may be the protection needed against the blowing sand while traversing the ": null
    },
    {
        "Sahara desert": "sahara"
    },
    {
        ". Bradshaw Foundation . , The Tuareg of the Sahara . Archived by WebCite® at  on 42Jun42          The ": null
    },
    {
        "Serer people": "serer people"
    },
    {
        " of ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        ", the ": null
    },
    {
        "Gambia": "gambia"
    },
    {
        " and ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        " are patrilineal  as well as matrilineal . There are several ": null
    },
    {
        "Serer matriclans": "serer maternal clans"
    },
    {
        " and ": null
    },
    {
        "matriarchs": ":category:serer matriarchs"
    },
    {
        ". Some of these matriarchs include ": null
    },
    {
        "Fatim Beye": "lingeer fatim beye"
    },
    {
        " and ": null
    },
    {
        "Ndoye Demba": "lingeer ndoye demba"
    },
    {
        " — matriarchs of the ": null
    },
    {
        "Joos matriclan": "joos maternal dynasty"
    },
    {
        " which also became a dynasty in ": null
    },
    {
        "Waalo": "waalo"
    },
    {
        " . Some ": null
    },
    {
        "matriclan": "matriclan"
    },
    {
        "s or maternal clans form part of ": null
    },
    {
        "Serer medieval": "serer history"
    },
    {
        " and ": null
    },
    {
        "dynastic": ":category:serer royalty"
    },
    {
        " history, such as the ": null
    },
    {
        "Guelowar": "guelowar"
    },
    {
        "s. The most revered clans tend to be rather ancient and form part of ": null
    },
    {
        "Serer ancient history": "serer ancient history"
    },
    {
        ". These ": null
    },
    {
        "proto-Serer": "timeline of serer history"
    },
    {
        " clans hold great significance in ": null
    },
    {
        "Serer religion": "serer religion"
    },
    {
        " and ": null
    },
    {
        "mythology": "serer creation myth"
    },
    {
        ". Some of these proto-Serer matriclans include the Cegandum and Kagaw, whose historical account is enshrined in Serer religion, mythology and ": null
    },
    {
        "traditions": "traditions"
    },
    {
        ".  ": null
    },
    {
        "Gravrand, Henry": "henry gravrand"
    },
    {
        ", La Civilisation Sereer - Cosaan , p 42 Nouvelles Editions africaines ,      In Serer culture, inheritance is both matrilineal and patrilineal. It all depends on the asset being inherited — i.e. whether the asset is a paternal asset — requiring paternal inheritance  or a maternal asset — requiring maternal inheritance . The actual handling of these maternal assets is discussed in the subsection ": null
    },
    {
        "Role of the Tokoor": "serer maternal clansrole of the tokoor"
    },
    {
        " of one of the above-listed main articles.          The ": null
    },
    {
        "Berber": "berbers"
    },
    {
        " inhabitants of ": null
    },
    {
        "Gran Canaria": "gran canaria"
    },
    {
        " island had developed a matrilineal society by the time the ": null
    },
    {
        "Canary Islands": "canary islands"
    },
    {
        " and their people, called ": null
    },
    {
        "Guanches": "guanches"
    },
    {
        ", were conquered by the Spanish.               Matrilineality among the ": null
    },
    {
        "Muslims": "muslims"
    },
    {
        " and ": null
    },
    {
        "Tamils": "tamils"
    },
    {
        " in the Eastern Province of ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        " arrived from ": null
    },
    {
        "Kerala": "kerala"
    },
    {
        ", India via Muslim traders before 42 CE. Ruwanpura, Kanchana N. . Matrilineal Communities, Patriarchal Realities: A Feminist Nirvana Uncovered. Ann Arbor: University of Michigan Press, paperback ; see p. 42 This page 42 of the Ruwanpura book is accessible online via Google Books . The books TOC and pages 4242 and 4242 are currently accessible. ": null
    },
    {
        "McGilvray, Dennis B.": "dennis b. mcgilvray"
    },
    {
        " . Households in Akkaraipattu: Dowry and Domestic Organization among Matrilineal Tamils and Moors of Sri Lanka, in J. N. Gray and D. J. Mearns Society From the Inside Out: Anthropological Perspectives on the South Asian Household, pp. 4242 London: Sage Publications. Matrilineality here includes ": null
    },
    {
        "kinship": "kinship"
    },
    {
        " and social organization, inheritance and property rights. Humphries, Jane . Gender Inequality and Economic Development, in Dieter Bos Economics in a Changing World, Volume 42: Public Policy and Economic Organization. New York: St. Martins Press; pp. 4242 Ruwanpura, 42 p. 42 Accessible online as above. For example, the mothers ": null
    },
    {
        "dowry": "dowry"
    },
    {
        " property and/or house is passed on to the eldest daughter. Ruwanpura, 42 p. 42 Accessible online as above. McGilvray, 42 pp. 4242 The ": null
    },
    {
        "Sinhalese people": "sinhalese people"
    },
    {
        " are the third ethnic group in eastern Sri Lanka, Ruwanpura, 42 pp. 4242 and p. 42 and have a kinship system which is intermediate between that of matrilineality and that of ": null
    },
    {
        "patrilineality": "patrilineality"
    },
    {
        ", Ruwanpura, 42 p. 42 Yalman, Nur . Under the Bo Tree: Studies in Caste, Kinship, and Marriage in the Interior of Ceylon. Berkeley: University of California Press. along with bilateral inheritance . Ruwanpura, 42 p. 42 While the first two groups speak the ": null
    },
    {
        "Tamil language": "tamil language"
    },
    {
        ", the third group speaks the ": null
    },
    {
        "Sinhalese language": "sinhalese language"
    },
    {
        ". The Tamils largely identify with ": null
    },
    {
        "Hinduism": "hinduism"
    },
    {
        ", the Sinhalese being primarily ": null
    },
    {
        "Buddhist": "buddhist"
    },
    {
        ". Ruwanpura, 42 pp. 4242 Accessible online as above. The three groups are about equal in population size. Ruwanpura, 42 p. 42   \t   ": null
    },
    {
        "Patriarchal": "patriarchal"
    },
    {
        " social structures apply to all of Sri Lanka, but in the ": null
    },
    {
        "Eastern Province": "eastern province, sri lanka"
    },
    {
        " are mixed with the matrilineal features summarized in the paragraph above and described more completely in the following subsection:     ": null
    },
    {
        "Eastern Sri Lanka": "eastern province, sri lanka"
    },
    {
        " is highly regarded even among ": null
    },
    {
        "feminist economists": "feminist economics"
    },
    {
        " for the relatively favourable position of its women, reflected in womens equal achievements in ": null
    },
    {
        "Human Development Indices": "human development index"
    },
    {
        " as well as matrilineal and ": null
    },
    {
        "bilateral": "bilateral descent"
    },
    {
        " inheritance patterns and property rights . Ruwanpura, , p.42 Accessible online as above. Humphries, 42 p. 42   She also conversely argues that feminist economists need to be cautious in applauding Sri Lankas gender-based achievements and/or matrilineal communities , Ruwanpura, 42 p. 42 Accessible online as above. because these matrilineal communities coexist with patriarchal structures and ideologies and the two can be strange but ultimately compatible bedfellows , Ruwanpura, 42 p. 42 and see p. 42 . Accessible online as above. as follows:     She positions Sri Lankan women within gradations of patriarchy by beginning with a brief overview of the main religious traditions, ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        ", ": null
    },
    {
        "Hinduism": "hinduism"
    },
    {
        ", and ": null
    },
    {
        "Islam": "islam"
    },
    {
        ", and the ways in which patriarchal interests are promoted through religious practice in Eastern Sri Lanka . Ruwanpura, 42 pp.  42–42 Accessible online as above. Thus, feminists have claimed that Sri Lankan women are relatively well positioned in the ": null
    },
    {
        "South Asian": "south asian"
    },
    {
        " region, Ruwanpura, 42 p. 42 Accessible online as above. Agarwal, Bina . A Field of Ones Own: Gender and Land Rights in South Asia. New Delhi: Cambridge University Press. despite patriarchal institutional laws that .... are likely to work against the interests of women, which is a co-operative conflict between women and these laws. Ruwanpura, 42 p. 42 Ruwanpura, 42 p. 42 . For example, the economic welfare of female-heads depends upon networks , networks that mediate the patriarchal-ideological nexus. Ruwanpura, 42 pp.  42–42 She wrote that some female heads possessed feminist consciousness Ruwanpura, 42 p.  42 .  and, at the same time, that in many cases female-heads are not vociferous feminists  ... but rather victims of patriarchal relations and structures that place them in precarious positions.... they have held their ground  ... provided for their children . Ruwanpura, 42 p.  42     On the other hand, she also wrote that feminists including ": null
    },
    {
        "Malathi de Alwis": "malathi de alwis"
    },
    {
        " and ": null
    },
    {
        "Kumari Jayawardena": "kumari jayawardena"
    },
    {
        " have criticized a romanticized view of womens lives in Sri Lanka put forward by Yalman, and mentioned the Sri Lankan case where young women raped are married-off/required to cohabit with the rapists! Ruwanpura, 42 p.  42 n.  42          In the ": null
    },
    {
        "Minangkabau": "minangs"
    },
    {
        " matrilineal ": null
    },
    {
        "clan": "clan"
    },
    {
        " culture in ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        ", a persons ": null
    },
    {
        "clan": "clan"
    },
    {
        " name is important in their marriage and their other cultural-related events. Sanday, Peggy Reeves . , Report from Indonesia . Archived by WebCite® at  on 42May42 Sanday, Peggy Reeves . Women at the Center: Life in a Modern Matriarchy. Cornell University Press. . Parts of this book are available online at books.google.com . Fitzsimmons, Caitlin . , A matrilineal, Islamic society in Sumatra . Archived by WebCite at  on 42May42 Two totally unrelated people who share the same clan name can never be married because they are considered to be from the same clan mother . Likewise, when ": null
    },
    {
        "Minangs": "minangs"
    },
    {
        " meet total strangers who share the same clan name, anywhere in Indonesia, they could theoretically expect to feel that they are distant relatives. Sanday 42 p.42 Minang people do not have a family name or surname; neither is ones important clan name included in ones name; instead ones ": null
    },
    {
        "given name": "given name"
    },
    {
        " is the only name one has. Sanday 42 p.42     The ": null
    },
    {
        "Minangs": "minangs"
    },
    {
        " are one of the worlds largest matrilineal societies/cultures/ethnic groups, with a population of 42 million in their home province ": null
    },
    {
        "West Sumatra": "west sumatra"
    },
    {
        " in Indonesia and about 42 million elsewhere, mostly in Indonesia. The Minang people are well-known within their country for their tradition of matrilineality and for their dedication to Islam & mdash; despite Islam being supposedly patrilineal . This well-known accommodation, between their traditional complex of customs, called ": null
    },
    {
        "adat": "adat"
    },
    {
        ", and their religion, was actually worked out to help end the Minangkabau 4242 ": null
    },
    {
        "Padri War": "padri war"
    },
    {
        ". This source is available online.     As further described in the same online source, their adat and their Islam religion each help the other to avoid the extremes of some modern global trends: Their strong belief in and practice of adat helps their Islam religion to not adopt a simplistic anti-Western version of Islam, while their strong belief in and practice of both Islam and adat helps the Minangs to limit or avoid some undesired effects of modern global capitalism.     The ": null
    },
    {
        "Minangkabau": "minangkabau people"
    },
    {
        " are a prime example of a matrilineal culture with female inheritance. With Islamic religious background of ": null
    },
    {
        "complementarian": "complementarian"
    },
    {
        "ism and places a greater number of men than women in positions of religious and political power. Inheritance and proprietorship pass from mother to daughter. The society of Minangkabau exhibits the ability of societies to lack ": null
    },
    {
        "rape culture": "rape culture"
    },
    {
        " without ": null
    },
    {
        "social equity": "social equity"
    },
    {
        " of genders.      Besides Minangkabau, several other ethnics in Indonesia are also matrilineal and have similar culture as the Minangkabau. They are Suku Melayu Bebilang, Suku Kubu and Kerinci people. Suku Melayu Bebilang live in Kota Teluk Kuantan, Kabupaten Kuantan Singingi , Riau. They have similar culture as the Minang. Suku Kubu people live in Jambi and South Sumatera. They are around 42 42 people. Suku Kerinci people mostly live in Kabupaten Kerinci, Jambi. They are around 42 42 people --       Originally, ": null
    },
    {
        "Chinese surname": "chinese surname"
    },
    {
        "s were derived matrilineally, linguistics.berkeley.edu . , Naming practices . A PDF file with a section on Chinese naming practices . Archived at WebCite  on 42Apr42 although by the time of the ": null
    },
    {
        "Shang dynasty": "shang dynasty"
    },
    {
        "  they had become patrilineal.       Archaeological data supports the theory that during the ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " period  in China, Chinese matrilineal clans evolved into the usual patrilineal families by passing through a transitional patrilineal clan phase. Evidence includes some richly furnished tombs for young women in the early Neolithic ": null
    },
    {
        "Yangshao": "yangshao"
    },
    {
        " culture, whose multiple other collective burials imply a matrilineal clan culture. Toward the late Neolithic period, when burials were apparently of couples, a reflection of patriarchy , an increasing elaboration of presumed chiefs burials is reported.     Relatively isolated ethnic minorities such as the ": null
    },
    {
        "Mosuo": "mosuo"
    },
    {
        " in southwestern China are highly matrilineal, and use matrilineal family names, i.e., ": null
    },
    {
        "matriname": "matriname"
    },
    {
        "s.        Most ethnic groups classified as  are matrilineal.      On ": null
    },
    {
        "North Vietnam": "north vietnam"
    },
    {
        ", according to Alessandra Chiricosta, the legend of ": null
    },
    {
        "Âu Cơ": "âu cơ"
    },
    {
        " is said to be evidence of the presence of an original matriarchy  ... and led to the double kinship system, which developed there  .... combined matrilineal and patrilineal patterns of family structure and assigned equal importance to both lines. Chiricosta, Alessandra, Following the Trail of the Fairy-Bird: The Search For a Uniquely Vietnamese Womens Movement, in Roces, Mina, & Louise P. Edwards, eds., Womens Movements in Asia: Feminisms and Transnational Activism , p.  42 and see p.  42 .             Of communities recognized in the ": null
    },
    {
        "national Constitution": "constitution of india"
    },
    {
        " as Scheduled Tribes, some  ... matriarchal and matrilineal Mukherjee, Sucharita Sinha, Womens Empowerment and Gender Bias in the Birth and Survival of Girls in Urban India, in Feminist Economics, vol. 42 no. 42 , p.  42 citing Srinivas, Mysore Narasimhachar, The Cohesive Role of Sanskritization and Other Essays , & Agarwal, Bina, A Field of Ones Own: Gender and Land Rights in South Asia . and thus have been known to be more egalitarian. Mukherjee, Sucharita Sinha, Womens Empowerment and Gender Bias in the Birth and Survival of Girls in Urban India, op. cit., p.  42 Several hindu communities in South India practiced matrilineality, especially the ": null
    },
    {
        "Tiyyas": "ezhava"
    },
    {
        " Nossiter, Thomas Johnson": "thomas nossiter"
    },
    {
        " . Keralas Identity: Unity and Diversity. In Communism in Kerala: A Study in Political Adaptation. University of California Press. . Retrieved 424242 P.  42 and ": null
    },
    {
        "Nair": "nair"
    },
    {
        "     in the state of ": null
    },
    {
        "Kerala": "kerala"
    },
    {
        ", and the ": null
    },
    {
        "Bunts": "bunt"
    },
    {
        " and ": null
    },
    {
        "Billava": "billava"
    },
    {
        " in the states of Kerala and ": null
    },
    {
        "Karnataka": "karnataka"
    },
    {
        ". The system of inheritance was known as ": null
    },
    {
        "Marumakkathayam": "marumakkathayam"
    },
    {
        " in the Nair community or ": null
    },
    {
        "Aliyasantana": "aliyasantana"
    },
    {
        " in the Bunt and the ": null
    },
    {
        "Billava": "billava"
    },
    {
        " community, and both communities were subdivided into ": null
    },
    {
        "clan": "clan"
    },
    {
        "s. This system was exceptional in the sense that it was one of the few traditional systems in western historical records of India that gave women some liberty and the right to property.     In the matrilineal system, the family lived together in a ": null
    },
    {
        "tharavadu": "tharavadu"
    },
    {
        " which was composed of a mother, her brothers and younger sisters, and her children. The oldest male member was known as the karanavar and was the head of the household, managing the family estate. Lineage was traced through the mother, and the children belonged to the mothers family.Earlier times ": null
    },
    {
        "surname": "surname"
    },
    {
        " would be of the maternal side. All family property was jointly owned. In the event of a partition, the shares of the children were clubbed with that of the mother. The karanavars property was inherited by his sisters sons rather than his own sons.  ": null
    },
    {
        "Amitav Ghosh": "amitav ghosh"
    },
    {
        " has stated that, although there were numerous other matrilineal succession systems in communities of the south Indian coast, the Nairs achieved an unparalleled eminence in the anthropological literature on matrilineality .  To access it via GoogleBooks, click on book title.     In the ": null
    },
    {
        "northeast India": "northeast india"
    },
    {
        "n state ": null
    },
    {
        "Meghalaya": "meghalaya"
    },
    {
        ", the ": null
    },
    {
        "Khasi": "khasi people"
    },
    {
        ", ": null
    },
    {
        "Garo": "garo people"
    },
    {
        ", ": null
    },
    {
        "Jaintia people": "pnar people"
    },
    {
        " have a long tradition of a largely matrilinear system in which the youngest daughter inherits the wealth of the parents and takes over their care.           A culture similar to the those practiced by the Minangkabau as a product of West Sumatran migration into the ": null
    },
    {
        "Malay peninsular": "malay peninsular"
    },
    {
        " in the 42th centurybecoming the basis for the state of ": null
    },
    {
        "Negeri Sembilan": "negeri sembilan"
    },
    {
        " known as the ": null
    },
    {
        "Adat Perpatih": "adat perpatih"
    },
    {
        ".         Some oceanic societies, such as the Marshallese and the Trobrianders, , esp. or only chaps. I, II, & VI. the Palauans, The Palauan culture  the Yapese The Yapese kinship  and the Siuai,  are characterized by matrilineal descent. The sisters sons or the brothers of the decedent are commonly the successors in these societies.          Matrilineality in Judaism or matrilineal descent in Judaism is the tracing of ": null
    },
    {
        "Jewish": "judaism"
    },
    {
        " descent through the maternal line. Virtually all Jewish communities have followed matrilineal descent from at least early ": null
    },
    {
        "Tannaitic": "tannaim"
    },
    {
        " times to Modern times. Reviewed by ": null
    },
    {
        "Louis Jacobs": "louis jacobs"
    },
    {
        ",  Originally published in Judaism 42 , 4242 The origins and date-of-origin of matrilineal descent in Judaism are uncertain. ": null
    },
    {
        "Orthodox Jews": "orthodox judaism"
    },
    {
        ", who believe that matrilineality and matriarchy within Judaism are related to the metaphysical concept of the Jewish soul,  Also, from the perspective of classical Jewish belief, the primary identity of all people follows the mother. Genesis 42:42 Rashi. maintain that matrilineal descent is an Oral Law from at least the time of the Receiving of the Torah on ": null
    },
    {
        "Mt. Sinai": "mount sinai"
    },
    {
        " . Midrash Rabbah, Numbers, 42 ": null
    },
    {
        "Conservative Jewish": "conservative judaism"
    },
    {
        " Theologian Rabbi ": null
    },
    {
        "Louis Jacobs": "louis jacobs"
    },
    {
        " suggests that the marriage practices of the Jewish community were re-stated as a law of matrilineal descent in the early Tannaitic Period .     The law of matrilineal descent was first codified, as all Jewish Oral Law, in the Mishnah . Kiddushin 42:42 Interestingly science currently believes that mitochondrial DNA , a human genome that is exceptionally both circular and distinct from Nuclear DNA, is unique in that it is transmitted exclusively by a mother to both her daughters and sons. The Torah may similarly be suggesting that a brother and sister from the same mother are closer than a brother and a sister from just the same father . The ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " see Kiddushin 42b and Yebamoth 42a adduces the law of matrilineal descent from Deuteronomy: you shall not intermarry with them: you shall not give your daughter to his son, and you shall not take his daughter for your son. For he will turn away your son from following Me, and they will worship the gods of others… Deuteronomy 42:4242 Conservative Jewish Theologian Rabbi Louis Jacobs dismisses the suggestion that the Tannaim were influenced by the Roman legal system... In Roman law, without connubium, the right to contract a legal marriage according to Roman Law , the marriage was not a justum matrimonium, a legal Roman marriage and the children from a such a union had no legal father and therefore followed the status of the mother. Interestingly, “ ese restrictions as to marriage were not founded on any enactments; they were a part of that large mass of Roman law which belongs to Jus Moribus Constitutum ”  and that even if the Rabbis were familiar with the Roman law, they might have reacted to it by preserving the patrilineal principle, holding fast to their own system.     The Jewish Oral Tradition cites the Book of Ezra, Chapters 42 42 regarding the law of matrilineal descent in Judaism. The medieval French commentator, ": null
    },
    {
        "Rabbi Shlomo Yitzchaki": "rashi"
    },
    {
        " in his commentary on Prophets references the law of matrilineal descent regarding Tamar, daughter of King David. II Samuel 42:42 Rashi Maimonides re-codified the law of matrilineal descent in his compilation of Jewish Law, Mishneh Torah . Maimonides Laws of Forbidden Relationships, 42:42 The law of matrilineal descent was again re-codified in the Code of Jewish Law, ": null
    },
    {
        "Shulchan Aruch": "shulchan aruch"
    },
    {
        " without mention of any dissenting opinion. Even HaEzer 42:42     The Hellenized Jewish philosopher, ": null
    },
    {
        "Philo of Alexandria": "philo"
    },
    {
        " calls the child of a Jew and a non-Jew a nothos , regardless of whether the non-Jewish parent is the father or the mother. On the Life of Moses 42.42 On the Virtues 42, On the Life of Moses 42.42   While Flavius ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        " , the Romanized Jewish historian, writing about events that were alleged to have occurred a century prior, has ": null
    },
    {
        "Antigonus II Mattathias": "antigonus ii mattathias"
    },
    {
        " , the last Hasmonean king of Judea, denigrating ": null
    },
    {
        "Herod": "herod the great"
    },
    {
        " –whose fathers family were Idumean Arabs forcibly converted to Judaism by ": null
    },
    {
        "John Hyrcanus": "john hyrcanus"
    },
    {
        " Josephus, Antiquities, 42.42 and whose mother, according to Josephus, was either an Idumean Arab Josephus, Antiquities, 42.42 or Arabian Josephus, Wars, 42.42 – by referring to him as an Idumean i.e. a half-Jew and as therefore unfit to be given governorship of Judea by the Romans. Josephus, Antiquities, 42.42     In practice, Jewish denominations define ": null
    },
    {
        "Who is a Jew?": "who is a jew?"
    },
    {
        " via descent in different ways. All denominations of Judaism have protocols for ": null
    },
    {
        "conversion": "conversion to judaism"
    },
    {
        " for those who are not Jewish by descent.     Orthodox Judaism practices matrilineal descent and considers it axiomatic. see Rabbi Moses Feinstein’s re-affirmation of matrilineal descent, Elberg, Rabbi S., September, 42 HaPardes Rabbinical Journal, Hebrew, vol.42 Is.42 p. 42 The Conservative Jewish Movement also practices matrilineal descent as virtually all Jewish communities have for at least two thousand years. In 42 the Conservative Movements Rabbinical Assembly reiterated the commitment of the Conservative Movement to the practice of matrilineal descent.  In 42 the ": null
    },
    {
        "Central Conference of American Rabbis": "central conference of american rabbis"
    },
    {
        " of ": null
    },
    {
        "Reform Judaism": "reform judaism"
    },
    {
        " passed a resolution waiving the need for formal conversion for anyone with at least one Jewish parent, provided that either one is raised as a Jew, by Reform standards, or one engages in an appropriate act of public identification, formalizing a practice that had been common in Reform synagogues for at least a generation. This 42 resolution departed from the Reform Movements previous position requiring formal conversion to Judaism for children without a Jewish mother.  However, the closely associated ": null
    },
    {
        "Israel Movement for Reform and Progressive Judaism": "israel movement for reform and progressive judaism"
    },
    {
        " has rejected this resolution and requires formal conversion for anyone without a Jewish mother.   Karaite Judaism does not accept Jewish Oral Law as definitive, believing that all divine commandments were recorded with their plain meaning in the written Torah. As such, they interpret the Hebrew Bible to indicate that Jewishness can only follow patrilineal descent. In 42 the ": null
    },
    {
        "Reconstructionist": "reconstructionist judaism"
    },
    {
        " movement became the first American Jewish movement to pass a resolution recognizing Jews of patrilineal descent.       Certain ancient myths have been argued to expose ancient traces of matrilineal customs that existed before historical records.     The ancient historian ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        " is cited by ": null
    },
    {
        "Robert Graves": "robert graves"
    },
    {
        " in his translations of Greek myths as attesting that the ": null
    },
    {
        "Lycia": "lycia"
    },
    {
        "ns ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        ", before 42 ": null
    },
    {
        "BCE": "bce"
    },
    {
        ". , History of Herodotus . Gravess notation is i.42 meaning in Book 42 – Scroll down to paragraph 42 to find the Lycians. ": null
    },
    {
        "Graves, Robert": "graves, robert"
    },
    {
        " .  The Greek Myths , Vol. 42. Penguin Books. ; p. 42 . of their times still reckoned by matrilineal descent, or were matrilineal, as were the ": null
    },
    {
        "Caria": "caria"
    },
    {
        "ns. Graves 42; p. 42 .     In Greek mythology, while the royal function was a ": null
    },
    {
        "male privilege": "male privilege"
    },
    {
        ", power devolution often came through women, and the future king inherited power through marrying the queen heiress. This is illustrated in the ": null
    },
    {
        "Homer": "homer"
    },
    {
        "ic myths where all the noblest men in Greece vie for the hand of ": null
    },
    {
        "Helen": "helen of troy"
    },
    {
        " , as well as the Oedipian cycle where ": null
    },
    {
        "Oedipus": "oedipus"
    },
    {
        " weds the recently widowed queen at the same time he assumes the Theban kingship.     This trend also is evident in many ": null
    },
    {
        "Celtic myths": "celtic mythology"
    },
    {
        ", such as the ": null
    },
    {
        "mabinogi": "mabinogi"
    },
    {
        " stories of ": null
    },
    {
        "Culhwch and Olwen": "culhwch and olwen"
    },
    {
        ", or the ": null
    },
    {
        "Ulster Cycle": "ulster cycle"
    },
    {
        ", most notably the key facts to the ": null
    },
    {
        "Cúchulainn": "cúchulainn"
    },
    {
        " cycle that Cúchulainn gets his final secret training with a ": null
    },
    {
        "warrior": "warrior"
    },
    {
        " woman, ": null
    },
    {
        "Scáthach": "scáthach"
    },
    {
        ", and becomes the lover of her daughter; and the root of the ": null
    },
    {
        "Táin Bó Cuailnge": "táin bó cuailnge"
    },
    {
        ", that while ": null
    },
    {
        "Ailill": "ailill mac máta"
    },
    {
        " may wear the crown of ": null
    },
    {
        "Connacht": "connacht"
    },
    {
        ", it is his wife ": null
    },
    {
        "Medb": "medb"
    },
    {
        " who is the real power, and she needs to affirm her equality to her husband by owning chattels as great as he does.     The Picts are widely cited as being matrilineal.  thanks to the practise of matrilineal descent followed by the Picts, and a large number of eligible would-be kings  the Picts are known as strong adherents to the concept of matrilineal descent     A number of other ": null
    },
    {
        "Breton": "breton people"
    },
    {
        " stories also illustrate the motif. Even the ": null
    },
    {
        "King Arthur": "king arthur"
    },
    {
        " legends have been interpreted in this light by some. For example, the ": null
    },
    {
        "Round Table": "round table"
    },
    {
        ", both as a piece of furniture and as concerns the majority of knights belonging to it, was a gift to Arthur from ": null
    },
    {
        "Guinevere": "guinevere"
    },
    {
        "s father ": null
    },
    {
        "Leodegrance": "leodegrance"
    },
    {
        ".     Arguments also have been made that matrilineality lay behind various ": null
    },
    {
        "fairy tale": "fairy tale"
    },
    {
        " plots which may contain the vestiges of folk traditions not recorded.     For instance, the widespread motif of a father who wishes to marry his own daughter—appearing in such tales as  Allerleirauh ,  Donkeyskin ,  The King who Wished to Marry His Daughter , and  The She-Bear —has been explained as his wish to prolong his reign, which he would lose after his wifes death to his son-in-law. ": null
    },
    {
        "Schlauch, Margaret": "margaret schlauch"
    },
    {
        " . Chaucers Constance and Accused Queens. New York: Gordian Press. ; p. 42 More mildly, the hostility of kings to their daughters suitors is explained by hostility to their successors. In such tales as  The Three May Peaches ,  Jesper Who Herded the Hares , or  The Griffin , kings set dangerous tasks in an attempt to prevent the marriage. Schlauch 42 p. 42     Fairy tales with hostility between the mother-in-law and the heroine—such as  Marys Child ,  The Six Swans , and Perraults ": null
    },
    {
        "Sleeping Beauty": "sleeping beauty"
    }
]