[
    {
        "                  Matthäus Merian der Ältere was a ": null
    },
    {
        "Swiss": "switzerland"
    },
    {
        "-born ": null
    },
    {
        "engraver": "engraver"
    },
    {
        " who worked in Frankfurt for most of his career, where he also ran a publishing house. He was a member of the ": null
    },
    {
        "patrician": "patrician"
    },
    {
        " Basel ": null
    },
    {
        "Merian family": "merian family"
    },
    {
        ".           Born in ": null
    },
    {
        "Basel": "basel"
    },
    {
        ", Merian learned the art of ": null
    },
    {
        "copperplate": "intaglio printing"
    },
    {
        " engraving in ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        ". He next worked and studied in ": null
    },
    {
        "Strasbourg": "strasbourg"
    },
    {
        ", ": null
    },
    {
        "Nancy": "nancy, france"
    },
    {
        ", and ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", before returning to Basel in 42 The following year he moved to ": null
    },
    {
        "Oppenheim": "oppenheim"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        " where he worked for the publisher Johann Theodor de Bry, who was the son of renowned engraver and traveler ": null
    },
    {
        "Theodor de Bry": "theodor de bry"
    },
    {
        ".     In 42 Merian married Maria Magdalena de Bry, daughter of the publisher, and was for a time associated with the de Bry publishing house. In 42 when Oppenheim was destroyed by fire during the Spanish occupation, they moved back to Basel, but three years later returned to Germany, this time to ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        ". They had four daughters and three sons, including ": null
    },
    {
        "Matthäus Merian the Younger": "matthäus merian the younger"
    },
    {
        ". Maria Magdalena de Bry died in 42 and the following year Matthäus married Johanna Catharina Hein. Five years later, Matthäus died, leaving his wife with two small children, ": null
    },
    {
        "Anna Maria Sibylla Merian": "maria sibylla merian"
    },
    {
        " who later became a pioneering ": null
    },
    {
        "naturalist": "naturalist"
    },
    {
        " and illustrator and a son, Maximilian, who died before his third birthday.       In 42 Merian took over the publishing house of his father-in-law after de Brys death. In 42 he became a citizen of Frankfurt and could henceforth work as an independent publisher. He spent most of his working life in Frankfurt.     Early in his life, he had created detailed town plans in his unique style, e.g. a plan of Basel and ": null
    },
    {
        "a plan of Paris": "merian plan of paris"
    },
    {
        " . With ": null
    },
    {
        "Martin Zeiler": "martin zeiler"
    },
    {
        " , a German geographer, and later with his own son, Matthäus Merian  , he produced a series of Topographia. The 42-volume set was collectively known as the  Topographia Germaniae . It includes numerous town plans and views, as well as maps of most countries and a World Map & mdash;it was such a popular work that it was re-issued in many editions. He also took over and completed the later parts and editions of the Grand Voyages and Petits Voyages, originally started by de Bry in 42     Merians work inspired the  Suecia Antiqua et Hodierna  by ": null
    },
    {
        "Erik Dahlberg": "erik dahlberg"
    },
    {
        ". The German travel magazine  Merian  is named after him.     He was also noted for the finesse of his alchemical illustrations, in books such as the  Musaeum Hermeticum  and  Atalanta Fugiens  .     Matthäus Merian died after several years of illness in 42 in ": null
    },
    {
        "Langenschwalbach": "bad schwalbach"
    },
    {
        ", near ": null
    },
    {
        "Wiesbaden": "wiesbaden"
    },
    {
        ".     After his death, his sons ": null
    },
    {
        "Matthäus Jr.": "matthäus merian the younger"
    },
    {
        " and Caspar took over the publishing house. They continued publishing the Topographia Germaniae and the  Theatrum Europaeum  under the name Merian Erben": null
    }
]