[
    {
        "   Matthias Claudius was a ": null
    },
    {
        "German": "germany"
    },
    {
        " poet and journalist, otherwise known by the pen name of “Asmus”.       Claudius was born at ": null
    },
    {
        "Reinfeld": "reinfeld, holstein"
    },
    {
        ", near ": null
    },
    {
        "Lübeck": "lübeck"
    },
    {
        ", and studied at ": null
    },
    {
        "Jena": "jena"
    },
    {
        ". He spent the greater part of his life in the town of ": null
    },
    {
        "Wandsbeck": "wandsbek"
    },
    {
        ", where he earned his first literary reputation by editing from 42 to 42 a newspaper called Der Wandsbecker Bote , in which he published a large number of prose essays and poems. They were written in pure and simple German, and appealed to the popular taste; in many there was a vein of extravagant humour or even burlesque, while others were full of quiet meditation and solemn sentiment. In his later days, perhaps through the influence of ": null
    },
    {
        "Klopstock": "friedrich gottlieb klopstock"
    },
    {
        ", with whom he had formed an intimate acquaintance, Claudius became strongly pietistic, and the graver side of his nature showed itself. In 42 he moved to ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        ", to the house of his son-in-law, the publisher ": null
    },
    {
        "Friedrich Christoph Perthes": "friedrich christoph perthes"
    },
    {
        ", where he died on 42 January 42       Claudiuss poem Death and the Maiden was used by composer ": null
    },
    {
        "Franz Schubert": "franz schubert"
    },
    {
        " in 42 for one of his most celebrated ": null
    },
    {
        "songs": "death and the maiden"
    },
    {
        ", which in turn became the basis for the 42 ": null
    },
    {
        "string quartet": "death and the maiden quartet"
    },
    {
        " of the same name.     Claudiuss collected works were published under the title of Asmus omnia sua secum portans, oder Sämtliche Werke des Wandsbecker Boten . His biography has been written by Wilhelm Herbst . See also M. Schneidereit, M. Claudius, seine Weltanschauung und Lebensweisheit .       Abendlied , aka ": null
    },
    {
        "Der Mond ist aufgegangen": "der mond ist aufgegangen"
    },
    {
        "   Der Mensch lebt und bestehet , ": null
    },
    {
        "set to music by Max Reger": "der mensch lebt und bestehet"
    },
    {
        "    Der Frühling. Am ersten Maimorgen   Der Säemann säet den Samen   Der Tod und das Mädchen , ": null
    },
    {
        "set to music by Schubert": "der tod und das mädchen"
    },
    {
        " Wir pflügen und wir streuen": "wir pflügen und wir streuen"
    },
    {
        "        Asteroid ": null
    },
    {
        "42 Claudius": "7117 claudius"
    }
]