[
    {
        "Matteo Carcassi was a famous Italian ": null
    },
    {
        "guitarist": "classical guitar"
    },
    {
        " and composer.       Carcassi was born in ": null
    },
    {
        "Florence": "florence"
    },
    {
        ", Italy, and first studied the ": null
    },
    {
        "piano": "piano"
    },
    {
        ", but learned ": null
    },
    {
        "guitar": "guitar"
    },
    {
        " when still a child. He quickly gained a reputation as a ": null
    },
    {
        "virtuoso": "virtuoso"
    },
    {
        " concert": "concert"
    },
    {
        " guitarist.     He moved to ": null
    },
    {
        "Germany": "germany"
    },
    {
        " in 1810, gaining almost immediate success. In 1815, he was living in Paris, earning his living as a teacher of both the piano and the guitar. On a concert tour in Germany in 1819, he met his friend ": null
    },
    {
        "Antoine Meissonnier": "antoine meissonnier"
    },
    {
        " for the first time. Also a famous guitarist, Meissonnier published many of Carcassis works in his Paris publishing house. For Meissonnier he also arranged a number of popular songs for guitar that were originally written for piano, including works by ": null
    },
    {
        "Théodore Labarre": "théodore labarre"
    },
    {
        " and ": null
    },
    {
        "Loïsa Puget": "loïsa puget"
    },
    {
        ".     From 1820 on, Carcassi spent the majority of his time in Paris. In 1823, he performed an extremely successful series of concerts in ": null
    },
    {
        "London": "london"
    },
    {
        " that earned him great fame, both as a performing artist and as a teacher. However, in Paris, a long time passed before his talents were truly recognized, partly because of the presence of ": null
    },
    {
        "Ferdinando Carulli": "ferdinando carulli"
    },
    {
        ".     Carcassi was in Germany again during autumn 1824. Afterwards he performed in London, where his reputation now gave him access to more prestigious concert halls. Finally he returned to Paris. For several years, he made concert trips from here to the most important cultural towns of Europe, including London. After a short return to performing in 1836, he quit his concert practice around 1840 and died in Paris in 1853.       Carcassi wrote a method for guitar , first published with Schott in ": null
    },
    {
        "Mainz": "mainz"
    },
    {
        ", in 1836. It is still valuable, relevant and interesting. His most famous works are collected in his ": null
    },
    {
        "25 Etudes op. 60": "25 studies for guitar, op. 60"
    },
    {
        ". In these, he managed to blend technical skills and brilliant romantic music. This is the reason his music is still played by so many classical guitarists today.        Det Kongelige Bibliotek, Denmark    The Music Library of Sweden     by Carcassi from Cantorion.org.    ": null
    },
    {
        "Mutopia Project": "mutopia project"
    },
    {
        "                                                   ": null
    }
]