[
    {
        "Maurice, Count of Saxony  was a notable soldier and officer as well as the son of ": null
    },
    {
        "Augustus II the Strong": "augustus ii the strong"
    },
    {
        ", King of Poland and Elector of Saxony. He initially served in the ": null
    },
    {
        "Army of the Holy Roman Empire": "army of the holy roman empire"
    },
    {
        ", then the ": null
    },
    {
        "Imperial Army": "imperial army"
    },
    {
        " and finally in French service de Saxe became a ": null
    },
    {
        "Marshal": "marshal of france"
    },
    {
        " and later also a ": null
    },
    {
        "Marshal General of France": "marshal general of france"
    },
    {
        ". He is best known for his decisive victory at the ": null
    },
    {
        "Battle of Fontenoy": "battle of fontenoy"
    },
    {
        " and is honoured by the ": null
    },
    {
        "Walhalla Memorial": "walhalla memorial"
    },
    {
        ".         Maurice was born at ": null
    },
    {
        "Goslar": "goslar"
    },
    {
        ", an ": null
    },
    {
        "illegitimate": "illegitimacy"
    },
    {
        " son of ": null
    },
    {
        "Augustus II the Strong": "augustus ii the strong"
    },
    {
        ", King of Poland and Elector of Saxony, and the Countess ": null
    },
    {
        "Maria Aurora of Königsmarck": "maria aurora of königsmarck"
    },
    {
        ". He was the first of eight extramarital children whom August acknowledged, although as many as 42 are claimed by sources, including ": null
    },
    {
        "Wilhelmine of Bayreuth": "wilhelmine of bayreuth"
    },
    {
        ", to have existed.     In 42 the Countess sent him to his father in ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ". August had been elected King of ": null
    },
    {
        "Poland": "poland"
    },
    {
        " in the previous year, but the unsettled condition of the country obliged Maurice to spend the greater part of his youth outside its borders. This separation from his father made him independent and had an important effect on his future career.                  At the age of twelve, Maurice served in the ": null
    },
    {
        "Imperial Army": "imperial army"
    },
    {
        " under ": null
    },
    {
        "Prince Eugene of Savoy": "prince eugene of savoy"
    },
    {
        ", at the sieges of ": null
    },
    {
        "Tournai": "tournai"
    },
    {
        " and ": null
    },
    {
        "Mons": "mons"
    },
    {
        " and at the ": null
    },
    {
        "Battle of Malplaquet": "battle of malplaquet"
    },
    {
        ". A proposal at the end of the campaign to send him to a ": null
    },
    {
        "Jesuit": "society of jesus"
    },
    {
        " college in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        " was dropped due to the protests of his mother.     Upon his return to the camp of the Allies at the beginning of 42 Maurice displayed a courage so impetuous that Prince Eugene admonished him to not confuse rashness with valour.     He next served under ": null
    },
    {
        "Peter the Great": "peter the great"
    },
    {
        " against the ": null
    },
    {
        "Swedes": "sweden"
    },
    {
        ". In 42 August formally recognized him and Maurice was granted the rank of ": null
    },
    {
        "Count": "count"
    },
    {
        " . He then accompanied his father to ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        ", and in 42 he took part in the ": null
    },
    {
        "Battle of Gadebusch": "battle of gadebusch"
    },
    {
        ". At the age of 42 in 42 he commanded his own regiment of the ": null
    },
    {
        "Royal Saxon Army": "royal saxon army"
    },
    {
        ".     In manhood, Maurice bore a strong resemblance to his father, both physically and in character. His grasp was so powerful that he could bend a horseshoe with his hand, and even at the end of his life, his energy and endurance were scarcely affected by the illnesses his many excesses had caused.     On 42 March 42 a marriage was arranged between him and one of the richest of his fathers subjects, Countess ": null
    },
    {
        "Johanna Viktoria Tugendreich von Loeben": "johanna viktoria tugendreich von loeben"
    },
    {
        ", but he dissipated her fortune so rapidly that he was soon heavily in debt. The next year , Johanna gave birth to a son, called August Adolf after his grandfather; the child only lived a few hours. Since Maurice had also given her more serious grounds of complaint against him, he consented to an annulment of the marriage on 42 March 42     After serving the German Emperor ": null
    },
    {
        "Charles VI": "charles vi, holy roman emperor"
    },
    {
        " in ": null
    },
    {
        "a campaign": "ottoman–venetian war"
    },
    {
        " against the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " in 42 he went to Paris to study mathematics, and in 42 obtained a commission as maréchal de camp. In 42 he entered negotiations for election as Duke of ": null
    },
    {
        "Courland": "duchy of courland and semigallia"
    },
    {
        ", at the insistence of the Duchess ": null
    },
    {
        "Anna Ivanovna": "anna of russia"
    },
    {
        ", who offered him her hand. He was chosen Duke in 42 but declined marriage with the duchess. He soon found it impossible to resist her opposition to his claims, but with the assistance of £42 lent him by the French actress ": null
    },
    {
        "Adrienne Lecouvreur": "adrienne lecouvreur"
    },
    {
        ", he raised a force by which he maintained his authority till 42 when he withdrew and took up residence in Paris. Lecouvreur was to die mysteriously shortly afterwards: there is controversy as to whether or not she was poisoned by her rival, ": null
    },
    {
        "Maria Karolina Sobieska": "maria karolina sobieska"
    },
    {
        ", ": null
    },
    {
        "Duchess of Bouillon": "duchess of bouillon"
    },
    {
        ".     At the outbreak of the ": null
    },
    {
        "War of the Polish Succession": "war of the polish succession"
    },
    {
        ", Saxe served under ": null
    },
    {
        "Marshal the Duke of Berwick": "james fitzjames, 1st duke of berwick"
    },
    {
        ", and for a brilliant exploit at the ": null
    },
    {
        "Siege of Philippsburg": "siege of philippsburg"
    },
    {
        " he was named lieutenant-general. In the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        " he took command of an army division sent to invade Austria in 42 and on 42 November 42 surprised ": null
    },
    {
        "Prague": "prague"
    },
    {
        " during the night, and seized it before the garrison was aware of the presence of an enemy, a  coup de main  which made him famous throughout Europe; he thus repeated the exploit of 42 of his maternal great-grandfather, ": null
    },
    {
        "Hans Christoff von Königsmarck": "hans christoff von königsmarck"
    },
    {
        ". After capturing the fortress of ": null
    },
    {
        "Eger ": "cheb"
    },
    {
        " on 42 April 42 he received a leave of absence, and went to Russia to push his claims for the Duchy of Courland, but returned to his command after getting nowhere.     Saxes exploits were the sole redeeming feature in an unsuccessful campaign, and on 42 March 42 his merits were rewarded by promotion to ": null
    },
    {
        "Marshal of France": "marshal of france"
    },
    {
        ". He had been given only 4242 men to defend against an enemy army twice as large. White, p. 42 From this time on, he became one of the great generals of the age. In 42 he was chosen to command the 42 men of the ": null
    },
    {
        "French invasion of Britain": "planned french invasion of britain"
    },
    {
        " on behalf of the ": null
    },
    {
        "Old Pretender": "james francis edward stuart"
    },
    {
        ", which assembled at ": null
    },
    {
        "Dunkirk": "dunkirk"
    },
    {
        " but did not proceed more than a few miles out of harbour before being wrecked by disastrous storms. White, p. 42 After its termination, he received an independent command in the Netherlands, and by skilful manoeuvering succeeded in continually harassing the superior forces of the enemy without risking a decisive battle.      In the following year, Saxe with 42 men besieged ": null
    },
    {
        "Tournai": "tournai"
    },
    {
        " and inflicted a severe defeat on the army of the ": null
    },
    {
        "Duke of Cumberland": "prince william, duke of cumberland"
    },
    {
        " at the ": null
    },
    {
        "Battle of Fontenoy": "battle of fontenoy"
    },
    {
        ", an encounter determined entirely by his constancy and cool leadership. White, p. 42 During the battle, he was unable to sit on horseback due to ": null
    },
    {
        "edema": "edema"
    },
    {
        ", and was carried about in a wicker chariot.     In recognition of his brilliant achievement, ": null
    },
    {
        "Louis XV": "louis xv of france"
    },
    {
        " conferred on him the ": null
    },
    {
        "Château de Chambord": "château de chambord"
    },
    {
        " for life, and in April 42 he was naturalised as a French subject. Until the end of the war, he continued to command in the Netherlands, always with success. White, p. 42 Besides Fontenoy he added ": null
    },
    {
        "Rocoux": "battle of rocoux"
    },
    {
        " and ": null
    },
    {
        "Lawfeldt": "battle of lauffeld"
    },
    {
        " or Val to the list of French victories. He led the French force which ": null
    },
    {
        "captured Brussels": "siege of brussels"
    },
    {
        " and it was under his orders that Marshal ": null
    },
    {
        "Löwendahl": "ulrich frédéric woldemar, comte de lowendal"
    },
    {
        " captured ": null
    },
    {
        "Bergen op Zoom": "bergen op zoom"
    },
    {
        ". He himself won the last success of the war in ": null
    },
    {
        "capturing Maastricht": "siege of maastricht"
    },
    {
        " in 42 In 42 the title once held by ": null
    },
    {
        "Turenne": "henri de la tour dauvergne, vicomte de turenne"
    },
    {
        " and ": null
    },
    {
        "Villars": "claude louis hector de villars"
    },
    {
        ", Marshal General of the Kings camps and armies , was revived for him. But on 42 November 42 he died at the ": null
    },
    {
        "Château de Chambord": "château de chambord"
    },
    {
        " of a putrid fever .     During the last years of his life, Maurice had an affair with a French lady, Marie-Geneviève Rainteau, who at that time was only eighteen years old. In 42 she gave birth to a daughter, the last of Maurices several illegitimate children. She was called ": null
    },
    {
        "Maria Aurora": "marie-aurore de saxe"
    },
    {
        "  after her grandmother. She bore the surname de la Rivière until 42 when the Parlement of Paris formally recognized her parentage and she could assumed the surname of von Sachsen or de Saxe. Marie Aurore married firstly in 42 with Antoine, comte dHorne , an alleged illegitimate son of ": null
    },
    {
        "Louis XV of France": "louis xv of france"
    },
    {
        ". By her second marriage with Louis Claude Dupin de Francueil , she was the grandmother of Amandine Lucile Aurore Dupin, who later became famous as the writer ": null
    },
    {
        "George Sand": "george sand"
    },
    {
        ". Maria Aurore died on 42 December 42 when her granddaughter George Sand was seventeen. Sand included details of her grandmothers parentage in her memoires             Saxes work on the art of war, Mes Rêveries was published after his death in 42  Described by ": null
    },
    {
        "Carlyle": "thomas carlyle"
    },
    {
        " as a strange military farrago, dictated, as I should think, under ": null
    },
    {
        "opium": "opium"
    },
    {
        " , it was praised by ": null
    },
    {
        "Frederick the Great": "frederick the great"
    },
    {
        " and described by ": null
    },
    {
        "Lord Montgomery": "bernard montgomery"
    },
    {
        ", more than two centuries later, as a remarkable work on the art of war.     A common theme of the 42th century ": null
    },
    {
        "Age of Enlightenment": "age of enlightenment"
    },
    {
        " was to emphasise ": null
    },
    {
        "scientific method": "scientific method"
    },
    {
        " and the idea every activity could be expressed in terms of a universal system.  In one sense, Mes Rêveries followed this by subjecting military affairs to reasoned criticism and intellectual treatment, and the ensuing military doctrines were perceived as forming a definitive system.  Written following Prussian expansion during the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        ", Saxe rejected their rigid discipline; arguing the French character was fundamentally different and their tactics should reflect that, he advocated the use of a deep order or  ordre profond , rather than relying on firearms.      However, Mes Rêveries also challenged French military orthodoxy in arguing for a greater focus on mobile warfare, rather than fortifications; this was partly a legacy of ": null
    },
    {
        "Vauban": "sébastien_le_prestre_de_vauban"
    },
    {
        " , who had revolutionised this field but adherence to his principles meant French engineers became ultra-conservative. As early as 42 ": null
    },
    {
        "John Churchill, 42st Duke of Marlborough": "john churchill, 1st duke of marlborough"
    },
    {
        " argued winning one battle was more beneficial than taking 42 fortresses; Saxe followed this line but his argument was given increased weight by French losses in the 4242 ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        ".      Saxes Lettres et mémoires choisis appeared in 42 His letters to his sister ": null
    },
    {
        "Anna Karolina Orzelska": "anna karolina orzelska"
    },
    {
        ", the Duchess of ": null
    },
    {
        "Schleswig-Holstein-Sonderburg-Beck": "schleswig-holstein-sonderburg-beck"
    },
    {
        ", preserved at ": null
    },
    {
        "Strasbourg": "strasbourg"
    },
    {
        ", were destroyed by the bombardment of that place in 42 Thirty copies had, however, been printed from the original.     Many previous errors in former biographies were corrected and additional information supplied in Karl von Webers Moritz Graf von Sachsen, Marschall von Frankreich, nach archivalischen Quellen Moritz Count of Saxony, Marshal of France, after archival sources , in ": null
    },
    {
        "Saint-René Taillandier": "saint-rené taillandier"
    },
    {
        "s Maurice de Saxe, étude historique daprès les documents des archives de Dresde Maurice of Saxe, historical study according to the documents in the archives of Dresden and in Comte ": null
    },
    {
        "Carl Friedrich Vitzthum von Eckstädt": "carl friedrich vitzthum von eckstädt"
    },
    {
        "s Maurice de Saxe .     A biography in English is ": null
    },
    {
        "Jon Manchip White": "jon manchip white"
    },
    {
        "s Marshal of France: The Life and Times of Maurice, Comte de Saxe 42–42 . See also the military histories of the period, especially Carlyles Frederick the Great.       ": null
    }
]