[
    {
        "Mauricio Raúl Kagel  was a ": null
    },
    {
        "German": "germans"
    },
    {
        "-": null
    },
    {
        "Argentine": "argentina"
    },
    {
        " composer": "composer"
    },
    {
        " notable for developing the ": null
    },
    {
        "theatrical": "theatrical"
    },
    {
        " side of musical ": null
    },
    {
        "performance": "performance"
    },
    {
        " . He spent his last fifty years in Germany, dying after a long illness at the age of 42 .       Kagel was born in ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        ", ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ", into an Ashkenazi Jewish family that had fled from Russia in the 42s . He studied music, history of ": null
    },
    {
        "literature": "literature"
    },
    {
        ", and ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        " in ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        " . In 42 he moved as a scholar to ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ", Germany, where he lived until his death.         From 42–42 and 42–42 he taught at the ": null
    },
    {
        "International Summer School at Darmstadt": "darmstädter ferienkurse"
    },
    {
        " . He also taught from 42–42 at the ": null
    },
    {
        "State University of New York at Buffalo": "university at buffalo, the state university of new york"
    },
    {
        " as ": null
    },
    {
        "Slee Professor of music theory": "slee professor of music theory"
    },
    {
        ". At the ": null
    },
    {
        "Berlin Film and Television Academy": "deutsche film- und fernsehakademie berlin"
    },
    {
        " he was a visiting lecturer. He served as director of courses for new music in ": null
    },
    {
        "Gothenburg": "gothenburg"
    },
    {
        " and Cologne . He was professor for new music theatre at the ": null
    },
    {
        "Cologne Conservatory": "cologne conservatory"
    },
    {
        " from 42–42 Among his students were ": null
    },
    {
        "Maria de Alvear": "maria de alvear"
    },
    {
        ", ": null
    },
    {
        "Carola Bauckholt": "carola bauckholt"
    },
    {
        ", ": null
    },
    {
        "Branimir Krstić": "branimir krstić"
    },
    {
        ", ": null
    },
    {
        "David Sawer": "david sawer"
    },
    {
        ", , ": null
    },
    {
        "Juan Maria Solare": "juan maria solare"
    },
    {
        ", ": null
    },
    {
        "Gerald Barry": "gerald barry"
    },
    {
        ", and ": null
    },
    {
        "Chao-Ming Tung": "chao-ming tung"
    },
    {
        ".          Some of his pieces give specific theatrical instructions to the performers , such as to adopt certain facial expressions while playing, to make their stage entrances in a particular way, to physically interact with other performers, and so on. For this reason commentators at times related his work to the ": null
    },
    {
        "Theatre of the Absurd": "theatre of the absurd"
    },
    {
        ". He has been regarded by music historians as deploying a critical intelligence interrogating the position of music in society . He was also active in the fields of film and photography, proving that the possibilities of music are inexhaustible. In 42 Kagel was invited by ": null
    },
    {
        "Walter Fink": "walter fink"
    },
    {
        " as the second composer featured in the annual ": null
    },
    {
        "Komponistenporträt": "rheingau musik festivalportraits of living composers"
    },
    {
        " of the ": null
    },
    {
        "Rheingau Musik Festival": "rheingau musik festival"
    },
    {
        ". In 42 he received the ": null
    },
    {
        "Ernst von Siemens Music Prize": "ernst von siemens music prize"
    },
    {
        ".       Staatstheater remains, probably, Kagel’s best-known work. It is the piece that most clearly shows his absurdist tendency. He described it as a “": null
    },
    {
        "ballet": "ballet"
    },
    {
        " for non-dancers,” although it is in many ways more like an ": null
    },
    {
        "opera": "opera"
    },
    {
        "; the devices it uses as ": null
    },
    {
        "musical instrument": "musical instrument"
    },
    {
        "s include ": null
    },
    {
        "chamber pot": "chamber pot"
    },
    {
        "s and ": null
    },
    {
        "enema": "enema"
    },
    {
        " equipment. As the work progresses, the piece itself, and opera and ballet in general, becomes its own subject matter.     Similar is the ": null
    },
    {
        "radio": "radio"
    },
    {
        " play": "play"
    },
    {
        " Ein Aufnahmezustand which is about the incidents surrounding the recording of a radio play. In Con voce , a masked trio silently mimes playing instruments. Match , is a “tennis game” for cellists with a percussionist as umpire  , also the subject of one of Kagels films and perhaps the best-known of his works of instrumental theatre .     But Kagel wrote a large number of more conventional “pure” pieces too, including ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        "l music, ": null
    },
    {
        "chamber music": "chamber music"
    },
    {
        ". Many of these make references to music of the past by, among others, Beethoven, Brahms, Bach and Liszt .     Kagel also made ": null
    },
    {
        "film": "film"
    },
    {
        "s, with one of the best known being  Ludwig van  , a critical interrogation of the uses of ": null
    },
    {
        "Beethoven": "ludwig van beethoven"
    },
    {
        "s music made during the bicentenary of that composers birth . In it, a reproduction of Beethovens studio is seen, as part of a fictive visit of the ": null
    },
    {
        "Beethoven House": "beethoven house"
    },
    {
        " in ": null
    },
    {
        "Bonn": "bonn"
    },
    {
        ". Everything in it is papered with sheet music of Beethovens pieces. The soundtrack of the film is a ": null
    },
    {
        "piano": "piano"
    },
    {
        " playing the music as it appears in each shot. Because the music has been wrapped around curves and edges, it is somewhat distorted, but Beethovenian motifs can still be heard. In other parts, the film contains parodies of radio or TV broadcasts connected with the Beethoven Year 42 . Kagel later turned the film into a piece of sheet music itself which could be performed in a concert without the film—the score consists of close-ups of various areas of the studio, which are to be interpreted by the performing ": null
    },
    {
        "pianist": "pianist"
    },
    {
        ".         Dos piezas for orchestra   Heterophonie for orchestra   Zehn Märsche, um den Sieg zu verfehlen , for brass orchestra   Les idées fixes, rondo for orchestra   Opus 42 for orchestra   Konzertstück , for timpani and orchestra   Études for orchestra   Fremde Töne & Widerhall , for orchestra         ": null
    },
    {
        "String Sextet": "string sextet"
    },
    {
        "   Transición II for piano, percussion, and two tapes   Sonant for guitar, harp, contrabass, and skin instruments   Match for three players   Musik für Renaissance-Instrumente, for two up to twenty-two instruments   String Quartets Nos. 42 and 42   Der Schall for five players performing on 42 plucked-string, percussion, and wind instruments   Acustica for experimental sound-producers and loud-speakers   Morceau de concours for 42 or 42 trumpets   Dressur, trio for wood percussion   Rrrrrrr..., six duos for two percussionists   Pan a tutti i Papagheni, for piccolo and string quartet   Piano Trio No. 42   String Quartet No. 42   Aus dem Nachlass, pieces for viola, cello, and contrabass   Phantasiestück for flute and piano   String Quartet No. 42   Schattenklänge, three pieces for bass clarinet   Art bruit for a percussionist and an assistant   Piano Trio No. 42         Fürst Igor – Strawinsky, a requiem for ": null
    },
    {
        "Igor Strawinsky": "igor strawinsky"
    },
    {
        " for bass and instruments    Sankt-Bach-Passion  for soloists, choirs and orchestra   Mitternachtsstük for voices and instruments on four fragments from the diary of ": null
    },
    {
        "Robert Schumann": "robert schumann"
    },
    {
        "   Schwarzes Madrigal , for choir, trumpet, tuba and 42 percussionists   In der Matratzengruft for tenor and ensemble         Staatstheater   Mare nostrum, Scenic Play for countertenor, baritone, flute, oboe, guitar, harp, cello and percussion   Kantrimiusik, pastorale for voices and instruments   Music-Epic about the Devil “La trahison orale”         Ludwig van": null
    }
]