[
    {
        "     Max Headroom is an American satirical ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " television series by ": null
    },
    {
        "Chrysalis Visual Programming": "chrysalis group"
    },
    {
        " and Lakeside Productions for ": null
    },
    {
        "Lorimar-Telepictures": "lorimar-telepictures"
    },
    {
        " that aired in the United States on ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " from March 31, 1987 to May 12, 1988. The series is set in a futuristic ": null
    },
    {
        "dystopia": "dystopia"
    },
    {
        " ruled by an ": null
    },
    {
        "oligarchy": "oligarchy"
    },
    {
        " of ": null
    },
    {
        "television network": "television network"
    },
    {
        "s.       In the future, an oligarchy of television networks rules the world. Even the government functions primarily as a puppet of the network executives, serving mainly to pass laws — such as banning off switches on televisions — that protect and consolidate the networks power. Television technology has advanced to the point that viewers physical movements and thoughts can be monitored through their television sets. Almost all non-television technology has been discontinued or destroyed. The only real check on the power of the networks is Edison Carter, a crusading investigative journalist who regularly exposes the unethical practices of his own employer, and the team of allies both inside and outside the system who assist him in getting his reports to air and protecting him from the forces that wish to silence or kill him.         Edison Carter  is a hard-hitting reporter for Network 23, who sometimes uncovered things that his superiors in the network would have preferred be kept private. Eventually, one of these instances required him to flee his workspace, upon which he was injured in a motorcycle accident in a parking lot.     The series depicted very little of the past described by Edison. He met a female ": null
    },
    {
        "televangelist": "televangelist"
    },
    {
        " when his reporting put him at odds with the Vu Age Church that she now headed. Edison was sent on a near-rampage to avenge a former colleague, who died as a result of a story on dream-harvesting.     Edison cares about his co-workers, especially Theora Jones and Bryce Lynch, and he has a deep respect for his producer, Murray .        Max Headroom is a computer reconstruction of Carter, created after ": null
    },
    {
        "Bryce Lynch": "bryce lynch"
    },
    {
        " uploaded a copy of his mind. He appears as a computer-rendered bust of Carter superimposed on a wire-frame background. Since Carters last sight before the motorcycle crash was the sign Max. headroom on a parking garage gate, these were the reconstructions first words and ultimately his name. While Carter is a dedicated professional, Max is a wisecracking observer of human contradictions.     Despite being the titular character, Max sparsely appeared on the show. While he occasionally played a significant part in a plot — sometimes by traveling through networks to gain information or by revealing secrets about Carter that Carter himself wouldnt divulge — his most frequent role was as comic relief, delivering brief quips in reaction to certain events or giving a humorous soliloquy at the end of an episode.      ": null
    },
    {
        "television pilot": "television pilot"
    },
    {
        " film for the series. She was Network 23s star controller and, working with Edison, the networks star reporter, she often helped save the day for everyone. She was also a potential love interest for Edison, but that subplot was not explored fully on the show before it was cancelled.     Network 23s personnel files list her father as unknown, her mother as deceased, and her brother as Shawn Jones; Shawn is the focus on the second episode broadcast, Rakers .     Theora Jones was played by ": null
    },
    {
        "Amanda Pays": "amanda pays"
    },
    {
        ", who along with ": null
    },
    {
        "Matt Frewer": "matt frewer"
    },
    {
        " and ": null
    },
    {
        "W. Morgan Sheppard": "w. morgan sheppard"
    },
    {
        ", was one of only three cast members to also appear in the American-made series that followed.      ": null
    },
    {
        "Chris Young": "chris young"
    },
    {
        "mputer securi": "mputer securi"
    },
    {
        "x Headro": "x headro"
    },
    {
        "Charles Rocket": "charles rocket"
    },
    {
        "ss no numeric row1978 TV seriesalso produced by Lorimarfor example, in the episode Body Banks , Blank Reg says: Its a book. Its a ": null
    },
    {
        "non-volatile storage medium": "non-volatile memory"
    },
    {
        ". Its very rare. You should ave one. This statement also anticipates the mid-2000s controversy over the replacement of print by online and e-book sources.": null
    },
    {
        " TV chann": "tv chann"
    },
    {
        "filmstutteringlyFarscape": null
    },
    {
        "15 fi": "15 fi"
    },
    {
        "under license from Warner Bros. Home Entertainment other than Matt Frewer": null
    }
]