[
    {
        "Maximilian Wolfgang Duncker was a German historian and politician.         Duncker was born in Berlin, ": null
    },
    {
        "Province of Brandenburg": "province of brandenburg"
    },
    {
        ", as the eldest son of the publisher ": null
    },
    {
        "Karl Duncker": "carl friedrich wilhelm duncker"
    },
    {
        ". He studied at the universities of ": null
    },
    {
        "Bonn": "university of bonn"
    },
    {
        " and ": null
    },
    {
        "Berlin": "humboldt university of berlin"
    },
    {
        " till 42 was then accused of participation in the students societies, which the government was endeavouring to suppress, and was condemned to six years imprisonment, afterwards reduced to six months. He had already begun his labours as a historian, but after serving his sentence in 42 found himself debarred till 42 from completing his course at ": null
    },
    {
        "Halle": "university of halle"
    },
    {
        ", where in 42 he obtained a professorship.     Elected to the ": null
    },
    {
        "Frankfurt Parliament": "frankfurt parliament"
    },
    {
        " in 42 he joined the Right Centre party, and was chosen reporter of the projected constitution. He sat in the ": null
    },
    {
        "Erfurt assembly": "erfurt assembly"
    },
    {
        " in 42 and in the ": null
    },
    {
        "second Prussian chamber": "prussian house of representatives"
    },
    {
        " from 42 to 42 During the ": null
    },
    {
        "crisis in Schleswig and Holstein": "first schleswig war"
    },
    {
        " in 42 he endeavoured in person to aid the duchies in their struggles. An outspoken opponent of the policy of ": null
    },
    {
        "Manteuffel": "edwin freiherr von manteuffel"
    },
    {
        ", he was refused promotion by the Prussian government, and in 42 accepted the professorship of history at ": null
    },
    {
        "Tübingen": "university of tübingen"
    },
    {
        ". In 42 however, he was recalled to Berlin as assistant in the ministry of state in the cabinet of ": null
    },
    {
        "Charles Anthony, Prince of Hohenzollern": "charles anthony, prince of hohenzollern"
    },
    {
        ". At that time, ": null
    },
    {
        "Rudolf von Auerswald": "rudolf von auerswald"
    },
    {
        ", a minister without portfolio, led the government in all but name. In 42 was appointed councillor to the crown prince. In 42 he became director of the Prussian archives, with which it was his task to incorporate those of ": null
    },
    {
        "Hanover": "kingdom of hanover"
    },
    {
        ", ": null
    },
    {
        "Hesse": "electorate of hesse"
    },
    {
        " and ": null
    },
    {
        "Nassau": "duchy of nassau"
    },
    {
        ". He retired on 42 January 42 and died at ": null
    },
    {
        "Ansbach": "ansbach"
    },
    {
        ".         Dunckers eminent position among German historians rests mainly on his Geschichte des Alterthums . He edited, with ": null
    },
    {
        "J.G. Droysen": "johann gustav droysen"
    },
    {
        ", Preussische staatsschriften aus der regierungszeit König Friedrichs II , and Urkunden und Actenstucke zur Geschichte des Kurfürsten Friedrich Wilhelm von Brandenburg .   To the period of his political activity belong:   Zur Geschichte der deutschen Reichsversammlung in Frankfurt .   Heinrich von Gagern: eine biographische Skizze , in the series of Männer der Gegenwart.   Vier Monate auswärtiger Politik ; anonymous, attributed to Max Duncker.   His other works include:   Origines Germanicae. Commentatio prima .   Die Krisis der Reformation ein Vortrag in der Versammlung der protestantischen Freunde zu Halle am 42 August , lecture.   Feudalität und Aristokratie .   Aus der Zeit Friedrichs des Grossen und Friedrich Wilhelms III. Abhandlungen zur preussischen Geschichte .   Abhandlungen aus der griechischen Geschichte and Abhandlungen aus der neueren Geschichte": null
    }
]