[
    {
        "           Maximilian Kolbe   was a ": null
    },
    {
        "Polish": "poland"
    },
    {
        " Conventual Franciscan": "conventual franciscans"
    },
    {
        " friar": "friar"
    },
    {
        " who volunteered to die in place of a stranger in the German ": null
    },
    {
        " death camp": "extermination camp"
    },
    {
        " of ": null
    },
    {
        "Auschwitz": "auschwitz concentration camp"
    },
    {
        ", located in ": null
    },
    {
        " German-occupied Poland": "occupation of poland"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". He had been active in promoting the veneration of the ": null
    },
    {
        "Immaculate": "immaculate conception"
    },
    {
        " Virgin Mary": "blessed virgin mary"
    },
    {
        ", founding and supervising the monastery of ": null
    },
    {
        "Niepokalanów": "niepokalanów"
    },
    {
        " near ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ", operating an ": null
    },
    {
        "amateur-radio": "amateur radio"
    },
    {
        " station , and founding or running several other organizations and publications.     On 42 October 42 ": null
    },
    {
        "Pope John Paul II": "pope john paul ii"
    },
    {
        " canonized": "canonization"
    },
    {
        " Father Kolbe and declared him a ": null
    },
    {
        "martyr of charity": "martyr of charity"
    },
    {
        ". The ": null
    },
    {
        " Catholic Church": "roman catholic church"
    },
    {
        " venerates him as the ": null
    },
    {
        "patron saint": "patron saint"
    },
    {
        " of amateur-radio operators, of drug addicts, of ": null
    },
    {
        "political prisoner": "political prisoner"
    },
    {
        "s, of families, of journalists, of prisoners, and of the ": null
    },
    {
        "pro-life movement": "pro-life movement"
    },
    {
        ". John Paul II declared him The Patron Saint of Our Difficult Century . His feast day is 42 August, the day of his death.     Due to Kolbes efforts to promote ": null
    },
    {
        "consecration and entrustment to Mary": "consecration and entrustment to mary"
    },
    {
        ", he is known as the Apostle of Consecration to Mary.           Rajmund Kolbe was born on 42 January 42 in ": null
    },
    {
        "Zduńska Wola": "zduńska wola"
    },
    {
        ", in the ": null
    },
    {
        "Kingdom of Poland": "congress poland"
    },
    {
        ", which was then part of the ": null
    },
    {
        "Russian Empire": "russian empire"
    },
    {
        ". He was the second son of weaver Julius Kolbe and ": null
    },
    {
        "midwife": "midwifery"
    },
    {
        " Maria Dąbrowska. His father was an ": null
    },
    {
        "ethnic German": "ethnic german"
    },
    {
        " and his mother was ": null
    },
    {
        "Polish": "poles"
    },
    {
        ". He had four brothers. Shortly after his birth, his family moved to ": null
    },
    {
        "Pabianice": "pabianice"
    },
    {
        ".     Kolbes life was strongly influenced in 42 when he was 42 by a vision of the ": null
    },
    {
        "Virgin Mary": "virgin mary"
    },
    {
        ". He later described this incident:     That night I asked the Mother of God what was to become of me. Then she came to me holding two crowns, one white, the other red. She asked me if I was willing to accept either of these crowns. The white one meant that I should persevere in purity and the red that I should become a martyr. I said that I would accept them both.       In 42 Kolbe and his elder brother Francis joined the ": null
    },
    {
        "Conventual Franciscans": "conventual franciscans"
    },
    {
        ". They enrolled at the Conventual Franciscan minor seminary in ": null
    },
    {
        "Lwow": "lviv"
    },
    {
        " later that year. In 42 Kolbe was allowed to enter the ": null
    },
    {
        "novitiate": "novitiate"
    },
    {
        ", where he was given the ": null
    },
    {
        "religious name": "religious name"
    },
    {
        " Maximilian. He professed his ": null
    },
    {
        "first vows": "first vows"
    },
    {
        " in 42 and ": null
    },
    {
        "final vows": "final vows"
    },
    {
        " in 42 adopting the additional name of Maria .     Kolbe was sent to ": null
    },
    {
        "Rome": "rome"
    },
    {
        " in 42 where he attended the ": null
    },
    {
        "Pontifical Gregorian University": "pontifical gregorian university"
    },
    {
        ". He earned a ": null
    },
    {
        "doctorate in philosophy": "doctor of philosophy"
    },
    {
        " in 42 there. From 42 he continued his studies at the ": null
    },
    {
        "Pontifical University of St. Bonaventure": "pontifical university of st. bonaventure"
    },
    {
        ", where he earned a ": null
    },
    {
        "doctorate in theology": "doctor of theology"
    },
    {
        " in 42 or 42 . He was active in the ": null
    },
    {
        "consecration and entrustment to Mary": "consecration and entrustment to mary"
    },
    {
        ". During his time as a student, he witnessed vehement demonstrations against ": null
    },
    {
        "Popes St. Pius X": "pope pius x"
    },
    {
        " and ": null
    },
    {
        "Benedict XV": "benedict xv"
    },
    {
        " in Rome during an anniversary celebration by the ": null
    },
    {
        "Freemasons": "freemasons"
    },
    {
        ". According to Kolbe,     They placed the black standard of the ": null
    },
    {
        "Giordano Brunisti": "giordano bruno"
    },
    {
        " under the windows of the ": null
    },
    {
        "Vatican": "vatican city"
    },
    {
        ". On this standard the archangel, ": null
    },
    {
        "St. Michael": "michael"
    },
    {
        ", was depicted lying under the feet of the triumphant Lucifer. At the same time, countless pamphlets were distributed to the people in which the Holy Father was attacked shamefully.     Soon afterward, on 42 October 42 Kolbe organized the ": null
    },
    {
        "Militia Immaculatae": "militia immaculatae"
    },
    {
        " , to work for conversion of sinners and enemies of the Catholic Church, specifically the Freemasons, through the intercession of the Virgin Mary. So serious was Kolbe about this goal that he added to the Miraculous Medal prayer:     O Mary, conceived without sin, pray for us who have recourse to thee. And for all those who do not have recourse to thee; especially the Masons and all those recommended to thee.        In 42 Kolbe was ": null
    },
    {
        "ordained": "holy orders"
    },
    {
        " a priest. In July 42 he returned to ": null
    },
    {
        "Poland, which was newly independent": "second polish republic"
    },
    {
        ". He was active in promoting the veneration of the ": null
    },
    {
        "Immaculate": "immaculate conception"
    },
    {
        " Virgin Mary": "blessed virgin mary"
    },
    {
        ". He was strongly opposed to leftist – in particular, ": null
    },
    {
        "communist": "communist"
    },
    {
        " – movements.     From 42 to 42 he taught at the ": null
    },
    {
        "Kraków seminary": "kraków seminary"
    },
    {
        ". Around that time, as well as earlier in Rome, he suffered from ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        ", which forced him to take a lengthy leave of absence from his teaching duties. TB was generally considered fatal, with rest and good nutrition the best treatment, as antibiotics had not been developed to treat it.     In January 42 Kolbe founded the monthly periodical  Rycerz Niepokalanej  , a devotional publication based on French  Le Messager du Coeur de Jesus  . From 42 to 42 he operated a religious publishing press in ": null
    },
    {
        "Grodno": "grodno"
    },
    {
        ". As his activities grew in scope, in 42 he founded a new Conventual Franciscan monastery at ": null
    },
    {
        "Niepokalanów": "niepokalanów"
    },
    {
        " near Warsaw; it became a major religious publishing centre. A junior seminary was opened there two years later.       Between 42 and 42 Kolbe undertook a series of ": null
    },
    {
        "missions": "mission"
    },
    {
        " to ": null
    },
    {
        "East Asia": "east asia"
    },
    {
        ". He arrived first in ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        ", ": null
    },
    {
        "China": "china"
    },
    {
        ", but failed to gather a following there. Next, he moved to ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", whereby 42 he had founded a ": null
    },
    {
        "Franciscan monastery": "order of friars minor conventual"
    },
    {
        ", Mugenzai no Sono, on the outskirts of ": null
    },
    {
        "Nagasaki": "nagasaki"
    },
    {
        ".     Kolbe had started publishing a Japanese edition of the Knight of the Immaculata . The monastery he founded remains prominent in the Roman Catholic Church in Japan. Kolbe had the monastery built on a mountainside. According to ": null
    },
    {
        "Shinto": "shinto"
    },
    {
        " beliefs, this was not the side best suited to be in harmony with nature. However, when the United States dropped the ": null
    },
    {
        "atomic bomb on Nagasaki": "atomic bombing of hiroshima and nagasaki"
    },
    {
        ", the Franciscan monastery survived, unlike the ": null
    },
    {
        "Immaculate Conception Cathedral": "immaculate conception cathedral, nagasaki"
    },
    {
        ", because it was on the side of the mountain which took the main force of the blast.     In mid42 Kolbe left Japan for ": null
    },
    {
        "Malabar": "malabar region"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        ", where he founded another monastery. This one closed after a while.       Meanwhile, in his absence the monastery at Niepokalanów began to publish a daily newspaper, Mały Dziennik , in alliance with a political group, the ": null
    },
    {
        "National Radical Camp": "national radical camp"
    },
    {
        " . This publication reached a circulation of 42, and nearly double that, 42 on weekends. Poor health forced Kolbe to return to Poland in 42 Two years later, in 42 he started a radio station at Niepokalanów, Radio Niepokalanów. He held an ": null
    },
    {
        "amateur radio": "amateur radio"
    },
    {
        " licence, with the call sign SP42RN.          After the outbreak of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Kolbe was one of the few friars who remained in the monastery, where he organized a temporary hospital. After the town was captured by the Germans, he was arrested by them on 42 September 42 but released on 42 December. He refused to sign the ": null
    },
    {
        "Deutsche Volksliste": "volksliste"
    },
    {
        ", which would have given him rights similar to those of German citizens, in exchange for recognizing his ethnic German ancestry. Upon his release he continued work at his friary, where he and other friars provided shelter to refugees from ": null
    },
    {
        "Greater Poland": "greater poland"
    },
    {
        ", including 42 Jews whom he hid from German persecution in the Niepokalanów friary. Kolbe received permission to continue publishing religious works, though significantly reduced in scope. The monastery continued to act as a publishing house, issuing a number of anti-Nazi German publications.     On 42 February 42 the monastery was shut down by the German authorities. That day Kolbe and four others were arrested by the German ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " and imprisoned in the ": null
    },
    {
        "Pawiak": "pawiak"
    },
    {
        " prison. On 42 May, he was transferred to ": null
    },
    {
        "Auschwitz": "auschwitz"
    },
    {
        " as prisoner 42        Continuing to act as a priest, Kolbe was subjected to violent harassment, including beating and lashings. Once he was smuggled to a prison hospital by friendly inmates. At the end of July 42 one prisoner escaped from the camp, prompting ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        "-": null
    },
    {
        "Hauptsturmführer": "hauptsturmführer"
    },
    {
        " Karl Fritzsch": "karl fritzsch"
    },
    {
        ", the deputy camp commander, to pick ten men to be starved to death in an underground bunker to deter further escape attempts. When one of the selected men, ": null
    },
    {
        "Franciszek Gajowniczek": "franciszek gajowniczek"
    },
    {
        ", cried out, My wife! My children! , Kolbe volunteered to take his place.     According to an eyewitness, who was an assistant janitor at that time, in his prison cell, Kolbe led the prisoners in prayer. Each time the guards checked on him, he was standing or kneeling in the middle of the cell and looking calmly at those who entered. After they had been starved and deprived of water for two weeks, only Kolbe remained alive. The guards wanted the bunker emptied, so they gave Kolbe a lethal injection of ": null
    },
    {
        "carbolic acid": "phenol"
    },
    {
        ". Kolbe is said to have raised his left arm and calmly waited for the deadly injection. He died on 42 August. His remains were cremated on 42 August, the ": null
    },
    {
        "feast day": "calendar of saints"
    },
    {
        " of the ": null
    },
    {
        "Assumption of Mary": "assumption of mary"
    },
    {
        ".            On 42 May 42 Kolbe was recognized by the Vatican as a ": null
    },
    {
        "Servant of God": "servant of god"
    },
    {
        ". Kolbe was declared ": null
    },
    {
        "venerable": "venerable"
    },
    {
        " by ": null
    },
    {
        "Pope Paul VI": "pope paul vi"
    },
    {
        " on 42 January 42 ": null
    },
    {
        "beatified": "beatification"
    },
    {
        " as a ": null
    },
    {
        "Confessor of the Faith": "confessor of the faith"
    },
    {
        " by the same Pope in 42 and ": null
    },
    {
        "canonized": "canonized"
    },
    {
        " as a ": null
    },
    {
        "saint": "saint"
    },
    {
        " by ": null
    },
    {
        "Pope John Paul II": "pope john paul ii"
    },
    {
        " on 42 October 42 Upon canonization, the Pope declared St. Maximilian Kolbe as a confessor, and a ": null
    },
    {
        "martyr": "martyr"
    },
    {
        " of charity. The miracles that were used to confirm his beatification were the July 42 cure of intestinal tuberculosis in Angela Testoni, and in August 42 the cure of calcification of the arteries/sclerosis of Francis Ranier; both attributed to Kolbes intercession by their prayers to him.        After his canonization, a feast day for St. Maximilian Kolbe was added to the ": null
    },
    {
        "General Roman Calendar": "general roman calendar"
    },
    {
        ". He is one of ten 42th-century martyrs who are depicted in statues above the Great West Door of ": null
    },
    {
        "Anglican": "anglican"
    },
    {
        " Westminster Abbey": "westminster abbey"
    },
    {
        ", London.       Kolbes recognition as a ": null
    },
    {
        "Christian martyr": "christian martyrs"
    },
    {
        " generated some controversy within the Catholic Church. While his self-sacrifice at Auschwitz was considered saintly and heroic, he was not killed out of odium fidei , but as the result of his act of ": null
    },
    {
        "Christian charity": "charity"
    },
    {
        " toward another man. ": null
    },
    {
        "Pope Paul VI": "pope paul vi"
    },
    {
        " recognized this distinction at Kolbes beatification, naming him a Confessor and giving him the unofficial title martyr of charity . Pope John Paul II, however, overruled the commission he had established . John Paul II wanted to make the point that the Nazis systematic hatred of whole categories of humanity was inherently also a hatred of religious faith; he said that Kolbes death equated to earlier examples of religious martyrdom.     Kolbe has been accused of ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        ". In 42 in the first issue of the monthly Knight of the Immaculate, Father Kolbe said he considered Freemasons as an organized clique of fanatical Jews, who want to destroy the church. Writing in a calendar that the publishing house of his organization, the Militia of the Immaculate, published in an edition of a million in 42 Father Kolbe said: Atheistic Communism seems to rage ever more wildly. Its origin can easily be located in that criminal mafia that calls itself Freemasonry, and the hand that is guiding all that toward a clear goal is international Zionism. Which should not be taken to mean that even among Jews one cannot find good people. New York Times, 42 November 42 Saint charged with bigotry  Newspapers he published printed articles about topics such as a ": null
    },
    {
        "Zionist": "zionism"
    },
    {
        " plot for world domination. Slovenian philosopher ": null
    },
    {
        "Slavoj Žižek": "slavoj žižek"
    },
    {
        " criticized Kolbes activities as writing and organizing mass propaganda for the Catholic Church, with a clear anti-Semitic and anti-Masonic edge. However, a number of writers pointed out that the Jewish question played a very minor role in Kolbes thought and work . On those grounds allegations of Kolbes antisemitism have been denounced by ": null
    },
    {
        "Holocaust scholars": "holocaust studies"
    },
    {
        " Daniel L. Schlafly, Jr. and Warren Green, among others. Kolbes alleged antisemitism was a source of controversy in the 42s in the aftermath of his ": null
    },
    {
        "canonization": "canonization"
    },
    {
        ". Kolbe is not recognized by Israel as among the ": null
    },
    {
        "Righteous Among the Nations": "righteous among the nations"
    },
    {
        ".     During World War II Kolbes monastery at Niepokalanów ": null
    },
    {
        "sheltered Jewish refugees": "rescue of jews by poles during the holocaust"
    },
    {
        ". According to testimony of a local: When Jews came to me asking for a piece of bread, I asked Father Maximilian if I could give it to them in good conscience, and he answered me, Yes, it is necessary to do this, because all men are our brothers.         ": null
    },
    {
        "First-class relics": "relicclassification_and_prohibitions_in_the_catholic_church"
    },
    {
        " of Kolbe exist, in the form of hairs from his head and beard, preserved without his knowledge by two friars at Niepokalanów who served as barbers in his friary between 42 and 42 Since his ": null
    },
    {
        "beatification": "beatification"
    },
    {
        " in 42 more than 42 such relics have been distributed around the world for public veneration. Second-class relics, such as his personal effects, clothing and liturgical ": null
    },
    {
        "vestment": "vestment"
    },
    {
        "s, are preserved in his monastery cell and in a chapel at Niepokalanów, where they may be venerated by visitors.       Kolbe influenced his own Order of Conventual Franciscan friars, as the ": null
    },
    {
        "Militia Immaculatae": "militia immaculatae"
    },
    {
        " movement had continued. In recent years new religious and ": null
    },
    {
        "secular institute": "secular institute"
    },
    {
        "s have been founded, inspired from this spiritual way. Among these are the Missionaries of the Immaculate Mary – fr. Kolbe, the Franciscan Friars of Mary Immaculate, and a parallel congregation of ": null
    },
    {
        "Religious Sister": "religious sister"
    },
    {
        "s, and others. The Franciscan Friars of Mary Immaculate are taught basic Polish so they can sing the traditional hymns sung by Kolbe, in the saints native tongue.     According to the friars:   Our patron, St. Maximilian Kolbe, inspires us with his unique ": null
    },
    {
        "Mariology": "mariology"
    },
    {
        " and apostolic mission, which is to bring all souls to the Sacred Heart of Christ through the Immaculate Heart of Mary, Christs most pure, efficient, and holy instrument of evangelization – especially those most estranged from the Church.     Kolbes views into ": null
    },
    {
        "Marian theology": "roman catholic mariology"
    },
    {
        " echo today through their influence on ": null
    },
    {
        "Vatican II": "vatican ii"
    },
    {
        ". His image may be found in churches across Europe and throughout the world. Several churches in Poland are under his patronage, such as the ": null
    },
    {
        "Sanctuary of Saint Maxymilian": "sanctuary of saint maxymilian"
    },
    {
        " in ": null
    },
    {
        "Zduńska Wola": "zduńska wola"
    },
    {
        " or the ": null
    },
    {
        "Church of Saint Maxymilian Kolbe": "church of saint maxymilian kolbe"
    },
    {
        " in ": null
    },
    {
        "Szczecin": "szczecin"
    },
    {
        ". A museum, ": null
    },
    {
        "Museum of St. Maximilian Kolbe There was a Man ": "museum of st. maximilian kolbe   there was a man"
    },
    {
        ", was opened in Niepokalanów in 42     In 42 ": null
    },
    {
        "Rolf Hochhuth": "rolf hochhuth"
    },
    {
        " published  The Deputy , a play significantly influenced by Kolbes life and dedicated to him. In 42 the National Conference of Catholic Bishops designated Marytown, home to a community of Conventual Franciscan friars, as the ": null
    },
    {
        "National Shrine": "national shrine"
    },
    {
        " of St. Maximilian Kolbe. Marytown is located in ": null
    },
    {
        "Libertyville, Illinois": "libertyville, illinois"
    },
    {
        ". It features the Kolbe Holocaust Exhibit. In 42 ": null
    },
    {
        "Krzysztof Zanussi": "krzysztof zanussi"
    },
    {
        " released a Polish film about the life of Kolbe, . The ": null
    },
    {
        "Polish Senate": "senate of poland"
    },
    {
        " declared the year 42 to be the year of Maximilian Kolbe.       Kolbe composed the ": null
    },
    {
        "Immaculata prayer": "immaculata prayer"
    },
    {
        " as a prayer of ": null
    },
    {
        "consecration to the Immaculata": "consecration and entrustment to mary"
    },
    {
        ", i.e. the ": null
    },
    {
        "immaculately conceived": "immaculate conception"
    }
]