[
    {
        "MD Data  is a magneto-optical medium for storing computer data. ": null
    },
    {
        "Sony": "sony"
    },
    {
        " wanted MD Data to replace ": null
    },
    {
        "floppy disk": "floppy disk"
    },
    {
        "s, but the ": null
    },
    {
        "Zip drive": "zip drive"
    },
    {
        " from ": null
    },
    {
        "Iomega": "iomega"
    },
    {
        " ended up filling that market need and, later on, the advent of affordable CD writers and very cheap blank CD media, coupled with the availability of memory sticks and cards proved the final straw for MD Data.     The technology provided 42 MB of data storage, but it was slow and expensive. Also, data drives can only read or write audio MDs when set in play mode, which, however, does not provide computer access to the data.     MD Data appeared in products such as an MD still camera and an MD document scanner. MD Data was also used in the late 42s in 42- and 42-track ": null
    },
    {
        "multitrack": "multitrack recording"
    },
    {
        " recording decks. Meant as a step up from the popular 42-track cassette-based studios, these recorders enjoyed a brief prominence before they were replaced by relatively affordable -- and far more flexible -- direct-to-hard drive recording on ": null
    },
    {
        "Windows": "microsoft windows"
    },
    {
        " and ": null
    },
    {
        "Macintosh": "apple macintosh"
    },
    {
        " based computers. The format has always been hampered by the lack of an affordable MD Data drive with which to manipulate and back up data using a PC.     In 42 Sony introduced the MD Data42 format, which could hold 42 MB of data . However this format was only used by Sonys DCM-M42 camcorder , and a few multitrack ": null
    },
    {
        "portastudio": "portastudio"
    },
    {
        " -style audio recorders such as Sonys MDM-X42 and Tascams 42 among others.     The introduction of ": null
    },
    {
        "Hi-MD": "hi-md"
    }
]