[
    {
        "      The mechanicals are six characters in  A Midsummer Nights Dream  who perform the ": null
    },
    {
        "play-within-a-play": "story within a story"
    },
    {
        "  Pyramus and Thisbe . They are a group of ": null
    },
    {
        "amateur": "amateur"
    },
    {
        " and mostly incompetent ": null
    },
    {
        "actor": "actor"
    },
    {
        "s from around ": null
    },
    {
        "Athens": "athens"
    },
    {
        ", looking to make names for themselves by having their production chosen among several acts as the courtly entertainment for the royal wedding party of ": null
    },
    {
        "Theseus": "theseus"
    },
    {
        " and ": null
    },
    {
        "Hippolyta": "hippolyta"
    },
    {
        ". The servant-spirit ": null
    },
    {
        "Puck": "puck"
    },
    {
        " describes them as rude mechanicals in Act III, Scene 42 of the play, in reference to their occupations as ": null
    },
    {
        "skilled manual laborers": "mechanic"
    },
    {
        ".     The biggest ham among them, ": null
    },
    {
        "Bottom": "nick bottom"
    },
    {
        ", becomes the unlikely object of interest for the fairy queen ": null
    },
    {
        "Titania": "titania"
    },
    {
        " after she is charmed by a love potion and he is turned into a monster with the head of an ": null
    },
    {
        "ass": "donkey"
    },
    {
        " by ": null
    },
    {
        "Puck": "puck"
    },
    {
        ".          Peter Quinces name is derived from quines or ": null
    },
    {
        "quoins": "quoin"
    },
    {
        " , which are the strenthening blocks that form the outer corners of stone or brickwork in a building.       Quinces amateurish playwriting is usually taken to be a parody of the popular ": null
    },
    {
        "mystery play": "mystery play"
    },
    {
        "s of the pre-": null
    },
    {
        "Elizabethan era": "elizabethan era"
    },
    {
        ", plays that were also produced by craftspeople. His ": null
    },
    {
        "metrical": "metrical rhythm"
    },
    {
        " preferences are references to vernacular ballads.     Despite Quinces obvious shortcomings as a writer, ": null
    },
    {
        "Stanley Wells": "stanley wells"
    },
    {
        " argues that he partly resembles Shakespeare himself. Both are from a craftsmanly background, both work quickly and both take secondary roles in their own plays. Robert Leach makes the same point.     In performing the play, Quince recites the prologue but struggles to fit his lines into the meter and make the rhymes. The noble audience makes jocular comments, whilst the rest of the mechanicals struggle .       Traditionally, Peter Quince is portrayed as a bookish character, caught up in the minute details of his play, but as a theatrical organizer. However, in the ": null
    },
    {
        "42 film version": "a midsummer nights dream"
    },
    {
        " of A Midsummer Nights Dream, he is portrayed by ": null
    },
    {
        "Roger Rees": "roger rees"
    },
    {
        " as a strong character extremely capable of being a director. It is he who leads the search party looking for ": null
    },
    {
        "Nick Bottom": "nick bottom"
    },
    {
        " in the middle of the play.     Many interpret Quince to be an author surrogate, representing William Shakespeare, albeit a comical version of himself.       The character is named in the title of a ": null
    },
    {
        "Wallace Stevens": "wallace stevens"
    },
    {
        " poem, ": null
    },
    {
        "Peter Quince at the Clavier": "peter quince at the clavier"
    },
    {
        " , which is written in the first person as if spoken by Quince. The character also inspired the name of Commander Peter Quincy Taggart in the 42 film  Galaxy Quest .             Snug is a minor character in the play. He is a ": null
    },
    {
        "joiner": "joiner"
    },
    {
        " from ": null
    },
    {
        "Athens": "athens"
    },
    {
        " who is assigned by ": null
    },
    {
        "Peter Quince": "peter quince"
    },
    {
        " to play the part of the lion in ": null
    },
    {
        "Pyramus and Thisbe": "pyramus and thisbe"
    },
    {
        ". When he is first assigned the part, he is afraid it may take him a while to finally remember his lines . ": null
    },
    {
        "Bottom": "nick bottom"
    },
    {
        " offers to play the part of the lion , but he is rejected by Quince, who worries that his loud and ferocious roar in the play will frighten the ladies of power in the audience and get Quince and all his actors hanged. In the end, the lions part is revised to explain that he is in fact not a lion and means the audience no harm.     Snug is often played as a stupid man, a manner describing almost all of the Mechanicals.     Snug is the only Mechanical to whom the playwright did not assign a first name.     In ": null
    },
    {
        "Jean-Louis": "jean-louis supervielle"
    },
    {
        " and ": null
    },
    {
        "Jules Supervielles": "jules supervielle"
    },
    {
        " french adaptation,  Le Songe dune nuit dété  , Snug is renamed to , where ": null
    },
    {
        "Georges Neveuxs": "georges neveux"
    },
    {
        " 42 adaptation": "le songe dune nuit dété"
    },
    {
        " used the English names.     On the Elizabethan stage, the role of Snug and the other Mechanicals was intended to be doubled with ": null
    },
    {
        "Titanias": "titania"
    },
    {
        " four fairy escorts: Moth, Mustardseed, Cobweb, and Peaseblossom.             Nick Bottom provides ": null
    },
    {
        "comic relief": "comic relief"
    },
    {
        " throughout the play. A weaver by trade, he is famously known for getting his head transformed into that of a donkey by the elusive ": null
    },
    {
        "Puck": "puck"
    },
    {
        ". Bottom and Puck are the only two characters who converse with and progress the three central stories in the whole play. Puck is first introduced in the fairies story and creates the drama of the lovers story by messing up who loves whom, and places the donkey head on Bottoms in his story. Similarly, Bottom is performing in a play in his story intending it to be presented in the lovers story, as well as interacting with ": null
    },
    {
        "Titania": "titania"
    },
    {
        " in the fairies story.          Francis Flutes occupation is a ": null
    },
    {
        "bellows": "bellows"
    },
    {
        "-mender. He is forced to play the female role of Thisbe in ": null
    },
    {
        "Pyramus and Thisbe": "pyramus and thisbe"
    },
    {
        " , a ": null
    },
    {
        "play-within-the-play": "play-within-the-play"
    },
    {
        " which is performed for ": null
    },
    {
        "Theseus": "theseus"
    },
    {
        " marriage celebration.     In the play Flute speaks through the wall  to Pyramus .     Flute is a young, excited actor who is disappointed when he finds he is meant to play a woman in their interlude before the duke and the duchess.     Flutes name, like that of the other mechanicals, is ": null
    },
    {
        "metonymical": "metonym"
    },
    {
        " and derives from his craft: Flute references a ": null
    },
    {
        "church organ": "church organ"
    },
    {
        ", an instrument prominently featuring the ": null
    },
    {
        "bellows": "bellows"
    },
    {
        " a bellows-mender might be called upon to repair.     In ": null
    },
    {
        "Jean-Louis": "jean-louis supervielle"
    },
    {
        " and ": null
    },
    {
        "Jules Supervielles": "jules supervielle"
    },
    {
        " french adaptation,  Le Songe dune nuit dété  , Flute is renamed to , where ": null
    },
    {
        "Georges Neveuxs": "georges neveux"
    },
    {
        " 42 adaptation": "le songe dune nuit dété"
    },
    {
        " used the English names.     On the Elizabethan stage, the role of Flute and the other Mechanicals was intended to be doubled with ": null
    },
    {
        "Titanias": "titania"
    },
    {
        " four fairy escorts: Moth , Mustardseed, Cobweb, and Peaseblossom.             Tom Snout is a ": null
    },
    {
        "tinker": "tinker"
    },
    {
        ", and one of the Mechanicals of Athens.     In the ": null
    },
    {
        "play-within-a-play": "play-within-a-play"
    },
    {
        ", Tom Snout plays the wall which separates Pyramus and Thisbes gardens. In  Pyramus and Thisbe , the two lovers whisper to each other through Snouts fingers . Snout has eight lines under the name of Tom Snout, and two lines as The Wall. He is the Wall for Act V-Scene 42     Tom Snout was originally set to play Pyramuss father, but the need for a wall was greater, so he discharged The Wall. Snout is often portrayed as a reluctant actor and very frightened, but the other mechanicals  are usually much more frightened than Tom Snout.     Snouts name, like that of the other mechanicals, is ": null
    },
    {
        "metonymical": "metonym"
    },
    {
        " and derives from his craft: Snout means a nozzle or a spout, a feature of the kettles a tinker often mends.          Robin Starveling plays the part of Moonshine in their performance of  Pyramus and Thisbe ": null
    }
]