[
    {
        "     Mechanized infantry  are ": null
    },
    {
        "infantry": "infantry"
    },
    {
        " units equipped with ": null
    },
    {
        "armored personnel carriers": "armored personnel carriers"
    },
    {
        " or ": null
    },
    {
        "infantry fighting vehicles": "infantry fighting vehicle"
    },
    {
        " for transport and ": null
    },
    {
        "combat": "combat"
    },
    {
        " .     Mechanized infantry is distinguished from ": null
    },
    {
        "motorized infantry": "motorized infantry"
    },
    {
        " in that its vehicles provide a degree of protection from hostile fire, as opposed to soft-skinned wheeled vehicles for motorized infantry. Most APCs and IFVs are fully tracked or are all-wheel drive vehicles , for mobility across rough ground. Some nations distinguish between mechanized and armored  infantry, designating troops carried by APCs as mechanized and those in IFVs as armored.     The support weapons for mechanized infantry are also provided with motorized transport, or they are built directly into combat vehicles to keep pace with the mechanized infantry in combat. For units equipped with most types of APC or any type of IFV, fire support weapons, such as ": null
    },
    {
        "machine gun": "machine gun"
    },
    {
        "s, ": null
    },
    {
        "autocannon": "autocannon"
    },
    {
        "s, small-bore direct-fire ": null
    },
    {
        "howitzer": "howitzer"
    },
    {
        "s, and ": null
    },
    {
        "anti-tank guided missiles": "anti-tank guided missile"
    },
    {
        "are often mounted directly on the infantrys own transport vehicles.     Compared with light truck-mobile infantry, mechanized infantry can maintain rapid tactical movement and, if mounted in IFVs, have more integral firepower. It requires more combat supplies and ordnance supplies , and a comparatively larger proportion of manpower is required to crew and maintain the vehicles. For example, most APCs mount a section of seven or eight infantrymen but have a crew of two. Most IFVs carry only six or seven infantry but require a crew of three. To be effective in the field, mechanized units also require many mechanics, with specialized maintenance and recovery vehicles and equipment.             Some of the first mechanized infantry were ": null
    },
    {
        "German": "german empire"
    },
    {
        " assault teams mounted on ": null
    },
    {
        "A7V": "a7v"
    },
    {
        " tanks during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". The vehicles were extra-large to let them carry sizeable assault teams and would regularly carry infantry on board in addition to their already large crews that were trained as storm troopers. All machine-gun-armed A7V tanks carried two small flame throwers for their dismounts to use. A7V tank would often carry a second officer to lead the assault team.     During the ": null
    },
    {
        "Battle of St. Quentin": "operation michaelst. quentin"
    },
    {
        ", A7Vs were accompanied by 20 ": null
    },
    {
        "storm troopers": "stormtrooper"
    },
    {
        " from Rohr Assault Battalion, but it is unspecified if they were acting as dismounts or were accompanying the tanks on foot. During the battle, tank crews were reported to have dismounted and attacked enemy positions with grenades and flamethrowers on numerous occasions.     Another example of the use of such a method of fighting is the ": null
    },
    {
        "capture of Villers-Bretonneux": "first battle of villers-bretonneux"
    },
    {
        ", in which A7Vs would suppress the defenders with machine gun fire and assault teams would dismount and attack them with grenades.      Towards the end of World War I, all the armies involved were faced with the problem of maintaining the momentum of an attack. Tanks, artillery, or infiltration tactics could all be used to break through an enemy defense, but almost all offensives launched in 1918 ground to a halt after a few days. The following infantry quickly became exhausted, and artillery, supplies and fresh formations could not be brought forward over the battlefields quickly enough to maintain the pressure on the regrouping enemy     It was widely acknowledged that cavalry was too vulnerable to be used on most European battlefields, but many armies continued to deploy them. ": null
    },
    {
        "Motorized infantry": "motorized infantry"
    },
    {
        " could maintain rapid movement, but their trucks required either a good road network or firm open terrain, such as desert. They were unable to traverse a battlefield obstructed by craters, barbed wire, and trenches. Tracked or all-wheel drive vehicles were to be the solution.     Following the war, development of mechanized forces was largely theoretical for some time, but many nations began rearming in the 1930s. The ": null
    },
    {
        "British Army": "british army"
    },
    {
        " had established an ": null
    },
    {
        "Experimental Mechanized Force": "experimental mechanized force"
    },
    {
        " in 1927, but it failed to pursue that line because of budget constraints and the prior need to garrison the frontiers of the British Empire.     Although some proponents of mobile warfare, such as ": null
    },
    {
        "J. F. C. Fuller": "j. f. c. fuller"
    },
    {
        ", advocated building tank fleets , other, such as ": null
    },
    {
        "Heinz Guderian": "heinz guderian"
    },
    {
        " in Germany, ": null
    },
    {
        "Adna R. Chaffee Jr.": "adna r. chaffee jr."
    },
    {
        " in the United States, and ": null
    },
    {
        "Mikhail Tukhachevsky": "mikhail tukhachevsky"
    },
    {
        " in the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", recognized that tank units required close support from infantry and other arms and that such supporting arms needed to maintain the same pace as the tanks.     As the Germans rearmed in the 1930s, they equipped some infantry units in their new  Panzer  ": null
    },
    {
        "divisions": "division"
    },
    {
        "with the ": null
    },
    {
        "half-track": "half-track"
    },
    {
        " Sd.Kfz. 251": "sd.kfz. 251"
    },
    {
        ", which could keep up with tanks on most terrain. The ": null
    },
    {
        "French Army": "french army"
    },
    {
        " also created light mechanized  divisions in which some of the infantry units possessed small tracked carriers. Together with the motorization of the other infantry and support units, this gave both armies highly mobile combined-arms formations. The German doctrine was to use them to exploit breakthroughs in  Blitzkrieg  offensives, whereas the French envisaged them being used to shift reserves rapidly in a defensive battle.            As ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " progressed, most major armies integrated ": null
    },
    {
        "tanks": "tank"
    },
    {
        "or ": null
    },
    {
        "assault guns": "assault gun"
    },
    {
        "with mechanized infantry, as well as other supporting arms, such as artillery and engineers, as ": null
    },
    {
        "combined arms": "combined arms"
    },
    {
        " units.     Allied armored formations included a mechanized infantry element for combined arms teamwork. For example, US armored divisions had a balance of three battalions each of tanks, armored infantry, and ": null
    },
    {
        "self-propelled artillery": "self-propelled artillery"
    },
    {
        ". The US armored infantry was fully equipped with M2 and ": null
    },
    {
        "M3 halftrack": "m3 halftrack"
    },
    {
        "s. In the British and Commonwealth armies, Type A armoured brigades, intended for independent operations or to form part of armored divisions, had a motor infantry battalion mounted in ": null
    },
    {
        "Bren Carriers": "bren carrier"
    },
    {
        "or later in lend-lease halftracks. Type B brigades lacked a motor infantry component and were subordinated to infantry formations.     The ": null
    },
    {
        "Canadian Army": "canadian army"
    },
    {
        " and, subsequently the British Army, used expedients such as the ": null
    },
    {
        "Kangaroo APC": "kangaroo"
    },
    {
        ", usually for specific operations rather than to create permanent mechanized infantry formations. The first such operation was ": null
    },
    {
        "Operation Totalize": "operation totalize"
    },
    {
        " in the ": null
    },
    {
        "Battle of Normandy": "battle of normandy"
    },
    {
        ", which failed to achieve its ultimate objectives but showed that mechanized infantry could incur far fewer casualties than dismounted troops in set-piece operations.      The German Army, having introduced mechanized infantry in its Panzer divisions, later named them  Panzergrenadier  units. In the middle of the war, it created entire mechanized infantry divisions and named Panzergrenadier divisions.     Because the German economy could not produce adequate numbers of its half-track APC, barely a quarter or a third of the infantry in Panzer or Panzergrenadier divisions were mechanized, except in a few favored formations. The rest were moved by truck. However, most German reconnaissance units in such formations were also primarily mechanized infantry and could undertake infantry missions when it was needed. The ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        " generally used jeeps, armored cars, or light tanks for reconnaissance.     The ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " began the war while still in the process of reorganizing its armored and mechanized formations, most of which were destroyed during the first months of the German Invasion of the Soviet Union. About a year later, the Soviets recreated division-sized mechanized infantry units, termed ": null
    },
    {
        "mechanized corps": "mechanized corps"
    },
    {
        ", usually with one tank brigade and three mechanized infantry brigades, with motorized supporting arms. They were generally used in the exploitation phase of offensives, as part of the prewar Soviet concept of ": null
    },
    {
        "deep operations": "deep operations"
    },
    {
        ".     The Soviet Army also created several ": null
    },
    {
        "cavalry mechanized groups": "cavalry mechanized group"
    },
    {
        "in which tanks, mechanized infantry and horsed cavalry were mixed. They were also used in the exploitation and pursuit phases of offensives. Red Army mechanized infantry were generally ": null
    },
    {
        "carried on tanks": "tank desant"
    },
    {
        " or trucks, with only a few dedicated lend-lease half-track APCs.     The ": null
    },
    {
        "New Zealand Army": "new zealand army"
    },
    {
        " ultimately fielded ": null
    },
    {
        "a division": "2nd new zealand division"
    },
    {
        " of a roughly similar composition to a Soviet mechanized corps, which fought in the ": null
    },
    {
        "Italian Campaign": "italian campaign"
    },
    {
        ", but it had little scope for mobile operations until near the end of the war.     The ": null
    },
    {
        "Romanian Army": "romanian army"
    },
    {
        " fielded a mixed assortment of vehicles. These amounted to 126 French-designed ": null
    },
    {
        "Renault UE Chenillettes": "renault ue chenillette"
    },
    {
        "which were licence-built locally, 34 captured and refurbished ": null
    },
    {
        "Soviet armored tractors": "komsomolets armored tractor"
    },
    {
        ", 27 German-made armored half-tracks of the ": null
    },
    {
        "Sd.Kfz. 250": "sd.kfz. 250"
    },
    {
        " and ": null
    },
    {
        "Sd.Kfz. 251": "sd.kfz. 251"
    },
    {
        " types, over 200 Czechoslovak ": null
    },
    {
        "Tatra": "tatra"
    },
    {
        ", ": null
    },
    {
        "Praga": "praga"
    },
    {
        " and ": null
    },
    {
        "Skoda": "škoda auto"
    },
    {
        " trucks  as well as 300 German ": null
    },
    {
        "Horch": "horch"
    },
    {
        " 901 4x4 field cars. Ronald L. Tarnstrom, Balkan Battles, Trogen Books, 1998, pp. 341-342 and 407 ": null
    },
    {
        "Sd.Kfz. 8": "sd.kfz. 8"
    },
    {
        " and ": null
    },
    {
        "Sd.Kfz. 9": "sd.kfz. 9"
    },
    {
        " half-tracks were also acquired,  as well as nine vehicles of the ": null
    },
    {
        "Sd.Kfz. 10": "sd.kfz. 10"
    },
    {
        " type and 100 ": null
    },
    {
        "RSO/01": "raupenschlepper ost"
    },
    {
        " fully tracked tractors. Mark Axworthy, Cornel I. Scafeș, Cristian Crăciunoiu, Third Axis, Fourth Ally: Romanian Armed Forces in the European War, 1941-1945, Arms and Armour, 1995, pp. 87 and 124 The Romanians also produced five prototypes of an ": null
    },
    {
        "indigenous": "t-1 tractor"
    },
    {
        " artillery tractor.         In the postwar era, the early years of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ", the Soviet Army and ": null
    },
    {
        "NATO": "nato"
    },
    {
        " further developed the equipment and doctrine for mechanized infantry. With the exception of ": null
    },
    {
        "airborne formations": "russian airborne troops"
    },
    {
        ", the Red Army mechanized all its infantry formations. Initially, wheeled APCs, like the ": null
    },
    {
        "BTR-152": "btr-152"
    },
    {
        ", were used, some of which lacked overhead protection and were therefore vulnerable to artillery fire. It still gave the Soviet Army greater strategic flexibility because of the large land area and the long borders of the Soviet Union and its allies in the ": null
    },
    {
        "Warsaw Pact": "warsaw pact"
    },
    {
        ".     The US Army established the basic configuration of the tracked APC with the ": null
    },
    {
        "M75": "m75 armored personnel carrier"
    },
    {
        " and ": null
    },
    {
        "M59": "m59 armored personnel carrier"
    },
    {
        " before it adopted the lighter ": null
    },
    {
        "M113": "m113 armored personnel carrier"
    },
    {
        ", which could be carried by ": null
    },
    {
        "Lockheed C-130 Hercules": "lockheed c-130 hercules"
    },
    {
        " and other transport aircraft. The vehicle gave infantry the same mobility as tanks but with much less effective armor protection .     In the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", the M113 was often fitted with extra armament and used as an ad hoc infantry fighting vehicle. Early operations by the ": null
    },
    {
        "Army of the Republic of Vietnam": "army of the republic of vietnam"
    },
    {
        " using the vehicle showed that troops were far more effective while they were mounted in the vehicles than when they dismounted. American doctrine subsequently emphasized mounted tactics. The Americans ultimately deployed a mechanized brigade and ten mechanized battalions to Vietnam.     Even more important for future developments was the Soviet ": null
    },
    {
        "BMP-1": "bmp-1"
    },
    {
        ", which was the first true IFV. Its introduction prompted the development of similar vehicles in Western armies, such as the ": null
    },
    {
        "West German": "west germany"
    },
    {
        " Marder": "marder"
    },
    {
        " and American ": null
    },
    {
        "M2 Bradley": "m2 bradley"
    },
    {
        ". Unlike the APC, which was intended merely to transport the infantry from place to place under armor, the IFV possessed heavy firepower that could support the infantry in attack or defense. Many IFVs were also equipped with firing ports from which their infantry could fire their weapons from inside, but they were generally not successful and have been dropped from modern IFVs.     Soviet organization led to different tactics between the light and the heavy varieties of mechanized infantry. In the Soviet Army, a first-line motor rifle division from the 1970s onward usually had two regiments equipped with wheeled ": null
    },
    {
        "BTR-60": "btr-60"
    },
    {
        " APCs and one with the tracked BMP-1 IFV. The light regiments were intended to make dismounted attacks on the divisions flanks, and the BMP-equipped heavy regiment remained mounted and supported the divisions tank regiment on the main axis of advance. Both types of infantry regiment still were officially titled motor rifle units.      A line of development in the Soviet Armed Forces from the 1980s was the provision of specialized IFVs for use by the ": null
    },
    {
        "Russian Airborne Troops": "russian airborne troops"
    },
    {
        ". The first of them was the ": null
    },
    {
        "BMD-1": "bmd-1"
    },
    {
        ", which had the same firepower as the ": null
    },
    {
        "BMP-1": "bmp-1"
    },
    {
        " but be carried in or even parachuted from the standard Soviet transport aircraft. That made airborne formations into mechanized infantry at the cost of reducing bayonet strength, as the BMD could carry only three or at most four paratroopers in addition to its three-man crew. They were used in that role in the ": null
    },
    {
        "Soviet invasion of Afghanistan": "soviet–afghan war"
    },
    {
        " in 1979.               At present, almost all infantry units from industrialized nations are provided with some type of motor transport. Infantry units equipped with IFVs rather than lighter vehicles are commonly designated as heavy , indicating more combat power but also more costly long-range transportation requirements. In ": null
    },
    {
        "Operation Desert Shield": "gulf waroperation desert shield"
    },
    {
        ", during the buildup phase of the First Gulf War, the U.S. Army was concerned about the lack of mobility, protection and firepower offered by existing rapid deployment formations; and also about the slowness of deploying regular armored units. The experience led the U.S. Army to form ": null
    },
    {
        "combat brigades": "brigade combat team"
    },
    {
        " based on the ": null
    },
    {
        "Stryker": "stryker"
    },
    {
        " wheeled IFV.     In the British Army, heavy units equipped with the ": null
    },
    {
        "Warrior IFV": "warrior tracked armoured vehicle"
    },
    {
        " are described as armoured infantry , and units with the ": null
    },
    {
        "Bulldog APC": "fv432bulldog"
    },
    {
        " as mechanised infantry . This convention is becoming widespread; for example the ": null
    },
    {
        "French Army": "french army"
    },
    {
        " has motorisées units equipped with the wheeled ": null
    },
    {
        "VAB": "véhicule de lavant blindé"
    },
    {
        " and mécanisées units with the tracked ": null
    },
    {
        "AMX-10P": "amx-10p"
    },
    {
        ".     The transport and other logistic requirements have led many armies to adopt wheeled APCs when their existing stocks of tracked APCs require replacement. An example is the Canadian Army, which has used the ": null
    },
    {
        "LAV III": "lav iii"
    },
    {
        " wheeled IFV in fighting in Afghanistan. The ": null
    },
    {
        "Italian": "italian army"
    },
    {
        ", ": null
    },
    {
        "Spanish": "spanish army"
    },
    {
        " and ": null
    },
    {
        "Swedish": "swedish army"
    },
    {
        " armies are adopting new indigenous-produced tracked IFVs. The Swedish ": null
    },
    {
        "CV90": "cv90"
    },
    {
        " IFV in particular has been adopted by several armies.        A recent trend seen in the ": null
    },
    {
        "Israel Defense Forces": "israel defense forces"
    },
    {
        " and the ": null
    },
    {
        "Armed Forces of the Russian Federation": "armed forces of the russian federation"
    },
    {
        " is the development and introduction of exceptionally well-armored APCs , such as the ": null
    },
    {
        "IDF Achzarit": "idf achzarit"
    },
    {
        ", that are converted from obsolete ": null
    },
    {
        "main battle tanks": "tank"
    },
    {
        " . Such vehicles are usually expedients, and lack of space prevents the armament of an IFV being carried in addition to an infantry section or squad. In the Russian Army, such vehicles were introduced for fighting in urban areas, where the risk from short range infantry anti-tank weapons, such as the ": null
    },
    {
        "RPG-7": "rpg-7"
    },
    {
        ", is highest, after Russian tank and motor infantry units suffered heavy losses fighting insurgents in ": null
    },
    {
        "Grozny": "grozny"
    },
    {
        " during the ": null
    },
    {
        "First Chechen War": "first chechen war"
    },
    {
        " in 1995.     Many APCs and IFVs currently under development are intended for rapid deployment by aircraft. New technologies that promise reduction in weight, such as electric drive, may be incorporated. However, facing a similar threat in ": null
    },
    {
        "post-invasion Iraq": "history of iraq"
    },
    {
        " to that which prompted the Russians to convert tanks to APCs, the occupying armies have found it necessary to apply extra armor to existing APCs and IFVs, which adds to the overall size and weight. Some of the latest designs  are intended to allow a light, basic model vehicle, which is air-transportable, to be fitted in the field with additional protection, thereby ensuring both strategic flexibility and survivability.         It is generally accepted that single weapons system types are much less effective without the support of the full combined arms team; the pre-World War II notion of tank fleets has proven to be as unsound as the World War I idea of unsupported infantry attacks. Though many nations armored formations included an ": null
    },
    {
        "organic": "organic"
    },
    {
        " mechanized infantry component at the start of World War II, the proportion of mechanized infantry in such combined arms formations was increased by most armies as the war progressed.     The lesson was re-learned, first by the Pakistani Army in the 1965 War with India, where the nation fielded two different types of armored divisions: one which was almost exclusively armor , while another was more balanced . The latter division showed itself to be far more combat capable than the former.     Having achieved spectacular successes in the offensive with tank-heavy formations during the ": null
    },
    {
        "Six-Day War": "six-day war"
    },
    {
        ", the ": null
    },
    {
        "Israel Defense Forces": "israel defense forces"
    },
    {
        " found in the ": null
    },
    {
        "Yom Kippur War": "yom kippur war"
    }
]