[
    {
        "         Medium tank is a ": null
    },
    {
        "classification of tanks": "tank classification"
    },
    {
        ", particularly prevalent during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " which represented a compromise between the mobility oriented ": null
    },
    {
        "light tanks": "light tanks"
    },
    {
        " and the armour and armament oriented ": null
    },
    {
        "heavy tank": "heavy tank"
    },
    {
        "s. The most widely produced, cost effective and successful tanks of World War II  were all medium tank designs, and the success of the concept would later lead to the development of later generations of medium tanks such as the Chieftain. Many of the medium tanks lines became what are called ": null
    },
    {
        "main battle tank": "main battle tank"
    },
    {
        " in most countries.       The first tanks to carry the name Medium appeared in the First World War with the British ": null
    },
    {
        "Medium Mark A Whippet ": "medium mark a whippet"
    },
    {
        ". It was smaller and lighter than the ": null
    },
    {
        "British heavy tanks": "mark i tank"
    },
    {
        " and only carried machine guns.     The medium tank doctrine came into use in the ": null
    },
    {
        "interwar period": "interwar period"
    },
    {
        ". Its existence outlasted the ": null
    },
    {
        "super-heavy tank": "super-heavy tank"
    },
    {
        " and ": null
    },
    {
        "heavy tank": "heavy tank"
    },
    {
        " and gradually transitioned into the ": null
    },
    {
        "main battle tank": "main battle tank"
    },
    {
        ".            Medium tanks of the ": null
    },
    {
        "interwar period": "interwar period"
    },
    {
        " included the British ": null
    },
    {
        "Vickers Medium Mark II": "vickers medium mark ii"
    },
    {
        " and the Soviet multi-turreted ": null
    },
    {
        "T42": "t-28"
    },
    {
        ".   In the period leading up to World War II, the British stopped using the term Medium for their tanks as the new philosophy of ": null
    },
    {
        "Cruiser tank": "cruiser tank"
    },
    {
        " and ": null
    },
    {
        "Infantry tank": "infantry tank"
    },
    {
        " which defined tanks by the role rather than size came into use.     There were medium tanks that focused on anti-infantry capabilities , and medium tanks which were more focused on the anti-tank role, mounting high-velocity ": null
    },
    {
        "tank gun": "tank gun"
    },
    {
        "s. The French ": null
    },
    {
        "cavalry tanks": "somua s35"
    },
    {
        "  focused on speed in addition to power and protection of the other designs. They were similar to what other countries called medium tanks.     When Soviet tank designers were preparing a successor to the ": null
    },
    {
        "BT tank": "bt tank"
    },
    {
        " series, they combined its excellent mobility with thick, sloped armour and the unprecedented firepower of a 42  mm high-velocity gun. The result was the ": null
    },
    {
        "T42 medium tank": "t-34 medium tank"
    },
    {
        ", whose superb capabilities shocked the German ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        " when it invaded the Soviet Union. The lessons of ": null
    },
    {
        "Blitzkrieg": "blitzkrieg"
    },
    {
        ", first employed by the Germans and eventually adopted by other nations, found their best expression in formations of mutually-supporting medium tanks and ": null
    },
    {
        "motorised infantry": "motorised infantry"
    },
    {
        ". The traditional view of infantry and cavalry tank roles was rendered obsolete.        Both the Soviet Union and the ": null
    },
    {
        "United States": "united states"
    },
    {
        " benefited from their ability to manufacture a well-balanced medium tank in very large numbers - around 42 ": null
    },
    {
        "T42": "t-34"
    },
    {
        "s and 42 ": null
    },
    {
        "M42 Sherman": "m4 sherman"
    },
    {
        " tanks were built during the war period.       During and after World War II, the roles of light tanks were gradually taken over by less-expensive armoured cars and specialised reconnaissance vehicles. Heavy tanks, having shown their limitations in combat, experienced a limited post-war arms race of progressively more heavily armed and armoured designs. With the rise of more sophisticated anti-tank missile weapons, to which heavy tanks had demonstrated high vulnerability, these too were eventually phased out.     With advances in technology, aspects such as mobility, armour and weaponry pushed the medium tank to form the core of a countrys armoured fighting capability, eventually merging into the ": null
    },
    {
        "Main Battle Tank": "main battle tank"
    },
    {
        ". Simpler and more economical ": null
    },
    {
        "self-propelled gun": "self-propelled gun"
    },
    {
        "s, and later ": null
    },
    {
        "anti-tank guided missile": "anti-tank guided missile"
    },
    {
        "s, came to fulfil some fire-support and anti-tank roles, thus shifting the tactical approach how tanks were used.     In the 42s, medium tanks continued to be used, such as Canadian medium tanks in Kosovo in 42 which were much better suited to the poor roads and soft ground than the French armoured cars there, but were still able to move along narrow streets and over lighter bridge classifications than the much heavier American Abrams tanks.       The role of medium tanks started with a prioritisation of speed. Medium tanks could travel faster, but needed help to cross trenches, where heavy tanks were large enough to cross unaided. In British use, this evolved into the ": null
    },
    {
        "Cruiser tank": "cruiser tank"
    }
]